{
  "nome_completo": "Bartholomew Lloyd",
  "nome_curto": "Bartholomew Lloyd",
  "ano_nascimento": "1772",
  "ano_morte": "1837",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lloyd_Bartholomew/",
  "lugar_nascimento": "New Ross, County Wexford, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "Bartholomew Lloyd\nwas the son of Humphrey Lloyd\n(4\nAugust\n1735\n-\n5\nOctober\n1786)\nof New Ross, County Wexford, and Margaret Borbridge of Deralossory, County Wicklow. Humphrey and Margaret Lloyd were married on\n22\nNovember\n1766\nand had three sons: Bartholomew Lloyd, the subject of this biography; John Lloyd, born\n24\nDecember\n1774\n; and Robert Lloyd, born\n6\nJanuary\n1785\n. They also had five daughters, Rachel, Anne, Harriet, Frances and Mary. Bartholomew's education was arranged by his uncle, the Rev John Lloyd, Rector of Ferns and Kilbride, and Prebendary of Clone, Diocese of Ferns\n[\n5\n]\n:-\nThis kind and excellent man, whose memory was long cherished among his parishioners, placed his young charge under the care of the Rev John Alexander of Ross, by whom he was instructed in the course reparatory for College.\nBartholomew's uncle died when he was nine years old and his father died when he was fourteen so at this stage Bartholomew had, to some extent, to make his own way in the world although he still had a large extended family. He entered Trinity College, Dublin in\n1787\nas a pensioner, meaning that he had to support himself financially. He was taught by Robert Burrowes\n(1756\n-\n1841)\nwho, a few years later in\n1792\n, published the book\nObservations on the Course of Science Taught at Present in Trinity College, Dublin: With Some Improvements Suggested Therein\n. Thomas Moore writes of Burrowes in\n[\n4\n]\n:-\nThe tutor under whom I was placed on entering College was the Rev Burrowes, a man of considerable reputation, as well for classical acquirements as for wit and humour.\nAlthough Lloyd entered Trinity without the award of a scholarship, his progress was excellent and in\n1790\nhe was awarded a scholarship for his classical achievements. He graduated with a B.A. in\n1792\nand, pursuing his main interests of mathematics and physics, in\n1796\nhe was awarded a junior fellowship. His achievements in the fellowship examination are related in\n[\n5\n]\n:-\nWe have been informed, on the best authority, that, at the examination in Physics, he answered every question proposed to him, and in the Mathematical Examination, every question but one - an instance, we believe, almost solitary in the history of University successes.\nWe note that through Lloyd's time as an undergraduate at Trinity College, Dublin, Richard Murray was the Professor of Mathematics. He was a rather poor mathematician and calculus was not taught at Trinity College at this time. Murray retired from teaching in\n1795\nbut the chair of mathematics was not filled until after his death in\n1799\n.\nLloyd continued to undertake research in mathematics despite having an extremely high teaching load. Thomas Romney Robinson explains in\n[\n3\n]\nthe difficulties that fellows of Trinity College, Dublin, had in pursuing a research career. We note that although these comments were written a few years after Lloyd held his fellowship, they apply equally well to Lloyd's time:-\nUnder the system pursued at present in Trinity College, its fellows can scarcely be expected to devote themselves to any work of research, or even of compilation; constantly employed in the duties of tuition, which harass the mind more than the most abstract studies, they can have but little inclination, at the close of the day, to commence a new career of labour. How different is this from the state of the English Universities, where the tutors constitute a very small part of the body, and the remainder have both leisure and incitement to pursue their peculiar studies, and increase the literary fame of their Alma Mater by their publications. In the present case the author happened to be less occupied than most of his brethren, yet he was engaged from seven to eight hours daily in academical duties for the year during which he composed this work.\nIn July\n1799\nLloyd married Eleanor McLaughlin, a daughter of Patrick McLaughlin of Dublin, Dunsaughlin and Kilmartin. Bartholomew and Eleanor Lloyd had four sons:\nHumphrey Lloyd\n(\nborn\n1800\n, who has a biography in this archive\n)\n; Bartholomew Clifford Lloyd\n(\nborn\n1808)\n; Robert Clifford Lloyd\n(\nborn\n1809)\n; and John Frederick Lloyd\n(\nborn\n1810)\n. They also had six daughters: Anne; Eleanor\n(\nborn\n1801)\n; Elizabeth\n(\nborn\n1808)\n; Harriet\n(\nborn\n1803)\n; Margaret; and Maria\n(\nwe have listed these in alphabetical order since we do not know all their dates of birth\n)\n. Fellows of Trinity College were required to be celibate so the reader may ask how Bartholomew Lloyd could have married and had many children. The answer is that, although the rule had always been in place it had not been enforced up to\n1811\nand, up to that time fellows married but did not declare this to the College which had a convention of not asking fellows if they were married. This changed in\n1811\nand from then on the celibacy rule was strictly enforced.\nFollowing the death of Richard Murray in\n1799\n, William Magee\n(1766\n-\n1831)\nwas appointed as Professor of Mathematics at Trinity College, Dublin. He, like Murray, was not a research mathematician and still no calculus was introduced into the undergraduate curriculum. Nevertheless, he was a popular teacher, well-liked by his students. There was a very good mathematician on the staff at Trinity College, Dublin, during these years.\nJohn Brinkley\nhad been appointed to the Andrews Chair of Astronomy at Trinity in\n1790\nand, two years later, he was also appointed as Royal Astronomer of Ireland. In this role he lived at Dunsink Observatory which was outside Dublin but he still had a major influence on the University. He was a strong advocate for the continental approach to calculus and, although he avoided using mathematical technicalities in his teaching, still his research involved developing calculus in the continental style. Certainly, despite having studied no calculus as an undergraduate, nevertheless Lloyd was now reading continental mathematics texts. We must assume that, at least in part, he was motivated to make these studies by\nBrinkley\n.\nIn\n1812\nMagee, who had been ordained in\n1790\n, resigned as Professor of Mathematics to become Rector of Cappagh, in the diocese of Derry, and Killyleagh, in the diocese of Down. He later became Archbishop of Dublin. Although we suggested above that Magee was a rather second-rate mathematician, nevertheless he was elected a fellow of the\nRoyal Society of London\nin\n1813\nfor being:-\n... a gentleman of high distinction for mathematical and philosophical knowledge and author of several works of importance.\nIn\n1813\nMagee became Dean of Cork and, in the same year Lloyd was appointed to succeed him as Professor of Mathematics at Trinity College, Dublin. This, we note, was quite remarkable since Lloyd had never been promoted to a senior fellowship and had remained a junior fellow from\n1796\nto\n1813\n. He now set about transforming the teaching of mathematics at Trinity.\nLacroix\nhad written the excellent textbook\nTraité élémentaire de calcul differéntiel et du calcul intégral\n(1802)\nto support his lectures and Lloyd now introduced this into the Trinity curriculum. In\n1811\nPoisson\nhad published a two volume treatise\nTraité de mécanique\nwhich gave an exceptionally clear treatment based on his course notes at the École Polytechnique in Paris. This work was also introduced into the Trinity curriculum by Lloyd. Trinity had undergone a sudden transformation from a university where no calculus was in the curriculum to one where the latest continental texts were being used. We note in passing that, unlike most British universities, Dublin had moved straight to the continental approach without ever teaching the fluxions of\nIsaac Newton\n.\nDionysius Lardner\n(1793\n-\n1859)\nentered Trinity in\n1812\n, was awarded a B.A. in\n1817\nand an M.A. in\n1819\n. He studied mathematics and science and became a writer of popular articles on these subjects. Writing in\n1820\nabout Lloyd's remarkable transformation of mathematics teaching at Trinity College, Dublin, Lardner says\n[\n1\n]\n:-\nBy the impulse which it thus received, the study of mathematics\n[\nat Trinity\n]\nhas leaped a chasm of a hundred years, and men who, according to the system pursued two years before the advancement of Dr Lloyd to the professorship of mathematics, would be employed in fathoming the mysteries of Decimal Fractions, are rather more respectably employed with the 'Mécanique Céleste'.\nWriting in\n1822\n(\nbut only published in\n1831\nin\nA treatise on algebraic geometry\n)\n, Lardner goes into more detail. First he describes the state of mathematics in Trinity College in\n1812\n[\n2\n]\n:-\nSuch a course of study might have been very proper in the University of Dublin in the year\n1712\n; but in the year\n1812\n, with the accumulated discoveries of a century, the various scientific establishments of Britain and the continent, all actively cultivating physical and mathematical science in their most improved state, the continuance of such a system must have been considered disgraceful. Deeply impressed with this feeling, Dr Lloyd, singly and unassisted, conceived and executed the most rapid revolution ever effected in the details of a great public institution.\nLardner continues to describe the remarkable transformation under Lloyd\n[\n2\n]\n:-\nIn order to appreciate the benefits derived from his exertions, it will be only necessary to compare the state of science already described, with its state in the present year\n1822\n. Among the undergraduates, those who now look for high academical honours read the works of Cagnoli and Woodhouse on Trigonometry,\nBrinkley\n's Astronomy, a course of\nAlgebraic geometry\n, equivalent to the extent of the first part of the present treatise, the Elementary Treatise of\nLacroix\non the Differential, and part of that on the Integral Calculus; with\nPeacock\n's examples as a praxis; a selection from the 'Mécanique' of\nPoisson\n, including the Statics, the Dynamical principle of\nD'Alembert\n, with its various applications; the theory of the moments of inertia, the motion of a body round a fixed axis, and most of the Hydrodynamics; also the subject of the first seventeen propositions, and the seventh section of the 'Principia', and the theory of projectiles 'in vacuo', all treated analytically.\nIn fact in\n1822\n, the year that Lardner wrote the above remarks, Lloyd moved from the Chair of Mathematics to the Erasmus Smith Chair of Natural and Experimental Philosophy which had become vacant on the death of William Davenport. We should mention that, while professor of mathematics, Lloyd published\nA Treatise on Analytic Geometry\n(1819)\n.\nA J McConnell spoke about Lloyd in his Address to the\nRoyal Irish Academy\nat the\nQuaternion\nCentenary Meeting held on\n8\nNovember\n1944\n[\n6\n]\n:-\nLloyd himself does not appear to have published any original work, but he was a brilliant teacher and inspirer of others. His 'Mechanical Philosophy', a beautifully written book with very elegant notation, was one of the first English text-books on mechanics written in the spirit of the new reforms. He was largely instrumental in persuading the College to elect young men to the mathematical chairs, for example,\nHamilton\nat twenty-one and\nMacCullagh\nat twenty-seven, a most unusual occurrence in those days, and in the very year he became Provost\n(1831)\nhe instituted the moderatorship examinations, thus providing for the first time honour degrees for the more brilliant students.\nThe work referred to in this quote is Lloyd's two-volume work\nAn Elementary Treatise of Mechanical Philosophy, written for the use of the undergraduate students of the University of Dublin\n(1828)\n. In the Preface to this work, Lloyd explains why he must limit the mathematics used in the book:-\n... whilst\n[\nDublin University\n]\ninvites by honours to the highest attainments, and provides the most able assistance for those who may be so allured, it forbears from compelling attention to the subjects of its instructions beyond very moderate limits. The sound discretion manifested in this treatment of the younger members, is chiefly conspicuous in what relates to their mathematical studies. In a course of academic instruction, by which the youth of the country are to be qualified for the various professional duties of active life, and, therefore, necessarily embracing a considerable variety of subjects, it was not to be proposed that all should become profound mathematicians. Neither could it be deemed expedient to interfere with the tastes of individuals, by which they may be directed into some other of the many walks of literature, perhaps equally useful, and certainly to many minds more inviting. In a society so diversified by tastes and objects, the number of those who do not enter on the higher branches of Mathematics must, at all times, be considerable.\nWe note that his view of the relatively low mathematics level at Trinity is in spite of the major revisions he himself had instituted. You can read the full Preface to this work at\nTHIS LINK\n.\nThe book is given a\n20\n-page review in\n[\n7\n]\n. Here is a brief extract from that review:-\n... the difficult task of conducting the inquirer through the intricacies of her newly explored regions, by putting him in possession of accurate and complete charts of her several districts, was, as yet, but partially and incompletely accomplished. Dr Lloyd, therefore, unites the highest claims to our gratitude for his bold and successful effort to supply, in an important part, this deficiency. His work appears to us to be, as far as it goes, and to promise in its progress still to be the most considerable work of our day; it effectually rescues us from all suspicion of our inferiority of ability to pursue these high subjects by the highest means; it exhibits powers of intellect not second to the ablest of our foreign contemporaries; and it cannot, we think, fail to exalt our scientific character abroad, and to extend the influence and progress of such studies at home. .... the style unites the perfections of philosophical precision and classical elegance, and exhibits a clearness, a simplicity, and a harmony which bespeak a mind that can lift itself from its subject and view its bearings with a comprehensive glance. ... There is judgment displayed in the selection of the materials which are likely to be of most value to the student; skill generally exhibited in their disposition and development, and originality in moulding them so as to harmonise with the whole. We need, therefore, scarcely add, that we shall hail the appearance of the second volume as completing the most valuable treatise on mechanics which has yet appeared in our language.\nIn\n1831\nLloyd became Provost of Trinity College, Dublin. One of Lloyd's first tasks as Provost was to improve the structure of Mathematics and of Natural Philosophy. Up to this time both chairs had been filled by someone who simultaneously was a senior fellow. Lloyd separated these roles and made other improvements such as in the structure of the fellowship examinations. The first to benefit from the restructuring of the professorships was his son\nHumphrey Lloyd\nwho was appointed to fill the Erasmus Smith Chair of Natural and Experimental Philosophy. As we mentioned above, fellows were by this time required to be celibate. Lloyd indicated that he wanted to see this rule changed for the newly restructured chairs but, seeing that there was strong opposition to this he dropped his proposal. The first to benefit from Lloyd's changes to the chair of mathematics was\nJames MacCullagh\nwho filled this position in\n1835\n. In the thirteen years between Lloyd leaving the chair of mathematics and\nMacCullagh\nfilling the chair there had been two professors, namely James Wilson, who had published\nFirst Elements of the Theory of Series and Differences\n(1822)\n, and Franc Sadleir\n(1775\n-\n1851)\n.\nAfter the reforms of mathematics and physics, Lloyd turned his attention to reforming theology. However, after only six years as Provost, he died in\n1837\nat the age of sixty-five and was buried in the College Chapel. At his funeral the Rev W Archer Butler, Professor of Moral Philosophy, gave a speech and we quote a few lines below\n[\n8\n]\n:-\n... he felt of what importance it was that the busy analysing spirit of the age, instead of being idly neglected or arrogantly contemned, should be met and directed in the seminaries of education. These sound and comprehensive views, his characteristic activity at once organised the means for attaining them; and the only misconception he betrayed in the arrangement of this invaluable machinery was in an estimate too kind and flattering of him whom he selected to work it! The leading members of the university have already decided upon public, permanent, and striking memorials of their sense of the loss which we have all sustained. ... Forget not, that however you may attribute to causes more secondary and immediate the advancement of your faculties, you will still be the pupils of him who gave these causes being. Forget not this, and it will add to the feeble efforts of your present instructor the powerful motive of exertion, contained in the conviction that every successful struggle of yours for mental perfection is contributing to the height and splendour of the monument of the most devoted, the most enlightened, and the most energetic governor your university ever possessed.\nThere are a few additional pieces of information about Lloyd that we should give. In addition to the positions we have mentioned above, in\n1821\n,\n1823\nand\n1825\nhe was elected regius professor of Greek. In\n1823\nand\n1827\nhe was Archbishop King's lecturer in divinity. He played an important role in the\nRoyal Irish Academy\nand was elected as its President in\n1835\n. Also in\n1835\nhe served as president of the\nBritish Association\nfor their meeting in Dublin.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}