{
  "nome_completo": "Benjamin Osgood Peirce",
  "nome_curto": "Benjamin Osgood Peirce",
  "ano_nascimento": "1854",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peirce_B_O/",
  "lugar_nascimento": "Beverly, Massachusetts, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Benjamin Osgood Peirce\n's father, also named Benjamin Osgood Peirce\n(1812\n-\n1883)\n, was a scientist and teacher. He was the son of Benjamin Peirce and Rebecca Orme. Benjamin Osgood Peirce, the father of the subject of this biography, attended Colby University, graduating in\n1835\n. He married Mehetable Osgood Seccomb, who was also teaching in Georgia, on\n15\nJune\n1841\n. She was the daughter of Ebenezer Peirce and Mary Marston. Mehetable and Benjamin had three children: Emily Rebecca Osgood Peirce, Mary Osgood Peirce, and Benjamin Osgood Peirce, the subject of this biography. Benjamin Osgood Peirce, the father, served as Professor of Mathematics and Natural Philosophy at New Hampton Institution from\n1835\nto\n1837\n, then as Principal of Madison Female Academy, Georgia, from\n1838\nand\n1839\n. He remained in Georgia until\n1847\nas Principal of Penfield Female Seminary and then as Professor of Chemistry and Natural Philosophy at Mercer University. In\n1847\n, because his wife was suffering ill health, he moved north to Beverly, Massachusetts, north of Boston, where his son Benjamin Osgood Peirce, the subject of this biography, was born. At this time he had changed professions and was a merchant in the South African trade but retained his scholarly interests.\nBenjamin Osgood II, the subject of this biography, was taught much as a child by his father. From his father, he inherited a love of music. His father was an excellent flute player but taught his son to play the piano and sing. The two spoke Latin when they went on long walks. In\n1864\nBenjamin Osgood II, then about\n10\nyears old, accompanied his father on a trip to the Cape of Good Hope. He wrote several letters home and these have survived. He sent his best wishes to numerous of his friends back home, asked his sister to take care of his possessions, and told of various boyish pranks, especially on board the ship on the journey. Back in the United States, he attended Beverly High School and graduated in\n1870\n.\nGiven his extraordinary love for scholarship in later life, it seems hard to understand why the young boy lost interest in this aspect of life at this time. Perhaps the teaching at Beverly High School had been uninspiring. Anyway, after leaving school he served an apprenticeship as a carpenter. At this time he did read a lot, kept up his Latin and his love of music began to play an even greater part in his life when he joined the Salem Oratorio Society where his fine voice was greatly appreciated. He also played a large part in the local Baptist Church and the church organist gave him a love of Bach's fugues.\n(\nBach seems to be the favourite composer of many mathematicians.\n)\nSuddenly in\n1872\nhe had a change of heart and decided that he wanted to enter college. With only a few months before the college entrance examinations, he had to show exceptional devotion to hard work to get himself up to the required standard in a short time. In fact he worked so hard during this period that he damaged his health and suffered for it for some months afterwards. He was successful in the entrance examinations to Harvard College, entering in the autumn of\n1872\n. His family moved from Beverly to Cambridge, Massachusetts, so that Peirce was able to live at home while his undertook his studies. Two members of his class became his close friends, namely George Stevenson Pine\n(1853\n-\n1944)\nand Edward Brown Lefavour\n(1854\n-\n1889)\n. Pine, who became an Episcopal priest\n[\n8\n]\n:-\n... has a vivid recollection of Peirce in his college days. They used to take long summer tramps together with great enjoyment, in which the rollicking humor of the latter was no small element. Percival Lowell was their classmate; the now President Lowell was a year behind them. At one time Peirce, Pine, Lefavour, and the two Lowells were all together in a course of elective mathematics given by\nBenjamin Peirce\n, then at the height of his fame. It was a notable company. Mr Pine disclaims any talent for mathematics, and says he took the course because his friends were in it; but Le Favour was the one classmate who for the whole four years of college outranked Peirce, and the career of the others I have mentioned is well known. It is interesting to hear Mr Pine's observation that Peirce and Lefavour took criticism in docile fashion from their illustrious teacher, but that the Lowells always wanted to argue the point.\nHe graduated from Harvard College with a degree in his main subject of physics in\n1876\n. He was placed second in his class, his friend Edward Lefavour being ranked first. He was offered a position as an assistant to John Trowbridge\n(1843\n-\n1923)\nin the physics laboratory. Trowbridge had brought a major change to the department at Harvard following his appointment in\n1870\n. He said\n[\n7\n]\n:-\nThe department of physics in a University must embrace both teaching and investigation. If it is given entirely to teaching, the cause of science suffers, and the object of a University which is founded both to teach and increase the sum of human knowledge is defeated.\nPeirce began publishing papers, his first, written jointly with his friend Lefavour, was entitled\nOn the effect of armatures on the magnetic state of electromagnets\nand appeared in\n1875\n. In the same year he also published the single authored paper\nOn the induction spark produced in breaking a galvanic circuit between the poles of a magnet\n[\n7\n]\n:-\nPeirce ... was Trowbridge's first research student. His brilliance became evident early. Of a research paper on magnetism, it was said \"There was not ... in all America at that time another college junior capable of all this\". He taught both mathematics and physics ...\nPeirce was awarded a Parker Fellowship which allowed him to continue his studies in Europe. He reached Germany in\n1877\nand boarded with a landlady in Leipzig. However, he spoke little French or German so struggled at first\n[\n8\n]\n:-\nThe landlady and her daughter, after vain attempts to reach an understanding with him by way of any language at their command, suggested waiting for the arrival of the son of the family, a student in the University. When this young man appeared he tried Peirce in Latin. Now, if ever there went to Germany an American student of physics who could speak Latin, Peirce was that student; but the German pronunciation of this language was unfamiliar to him; so again there was difficulty, and the other young man, losing patience, exclaimed, \"Have you never been to school?\"\nIn Leipzig, he undertook research, advised by Eilhard Ernst Gustav Wiedemann\n(1852\n-\n1928)\nand Wilhelm Gottlieb Hankel\n(1814\n-\n1899)\n,\nHermann Hankel\n's father. He was awarded a Ph.D. from the University of Leipzig in\n1879\nfor his thesis\nÜber die Electromotorische Knifte von Gaselemente\n. While in Leipzig, he had met Isamella Turnbull Landreth who was a Scottish girl from Edinburgh who was studying music at the Conservatory in Leipzig. Peirce's love of music meant that he had joined the choral society, the Riedelsche Verein, and attended many musical events where he had met Isamella. He then went to Berlin where he spent\n1880\nworking with\nHermann von Helmholtz\n. At this time Peirce was particularly interested in studying properties of magnetism. While in Berlin he met a fellow student,\nKarl Pearson\n, and the two became good friends.\nPearson\nwrote\n(\nquoted in\n[\n9\n]\n)\n:-\nPeirce was representative of all that was best in science; he was never a self-seeker nor a self-advertiser, and I learnt more from him than from many of our professed teachers in Berlin.\nThese years in Germany were particularly important for Peirce who learnt mathematical techniques used in theoretical physics, topics hardly studied at all in the United States at this time. However, the experimental work he carried out on batteries at this time proved unfortunate for the relation he was seeking\n(\npostulated by Wiedemann\n)\nbetween electromotive force and heat generated simply does not exist, as his experiments demonstrated. He only gave his experimental results and never claimed that they showed Wiedemann's theory was incorrect. Later in\n1880\nhe returned to the United States where he was appointed as a mathematics teacher at the Boston Latin School. In the following year he was appointed as an Instructor in Mathematics at Harvard where he built up the teaching of mathematical physics. Having now secured a permanent academic post, Peirce married Isamella Landreth in Edinburgh, Scotland, on\n27\nJuly\n1882\n; they had two daughters.\nIn\n1884\nPeirce was promoted to Assistant Professor of Mathematics and Physics, working under Joseph Lovering\n(1813\n-\n1892)\nwho was Hollis Professor of Mathematics and Natural Philosophy at Harvard, a post he had been appointed to in\n1838\n. Peirce was assisted in developing the teaching of mathematical physics at Harvard by his colleague William Elwood Byerly\n(1849\n-\n1935)\n. Byerly had been appointed as an assistant professor of mathematics at Harvard in\n1876\nand promoted to full professor in\n1881\n. Together they taught calculus and its applications, constructing a two year course which Peirce and Byerly taught starting in alternate years. Arthur Gordon Webster, who was a student at Harvard at this time, writes\n[\n12\n]\n:-\nA splendid course it was, and those students who took it under one disputed with those taking it under the other as to which was the better teacher. But the most notable course instituted by Peirce and shared by this pair of masterly teachers was that one in which Peirce treated the theory of the Newtonian potential function, and Byerly the theory of\nFourier\n's series.\nEach wrote a text based on half the material of the course but, given the structure of their course, it was natural that they contributed to both books. Byerly's text\nElements of the integral calculus\nwas first published in\n1881\n, while Peirce's text\nElements of the theory of the Newtonian potential function\nwas first published in\n1886\n. Both these texts continued to grow with further editions. As an indication of the cooperation of Peirce and Byerly on the two books, we note that Peirce published a table of integrals as a supplement to the edition which Byerly brought out in\n1889\n. Peirce's\nA short table of integrals\nwas a very popular work which soon became a book in its own right rather than a supplement. It had become a book of\n134\npages by\n1899\n.\nErnest William Brown\nreviewed this\n1899\nedition and wrote\n[\n6\n]\n:-\nThis is a revised and much enlarged edition of the author's well-known table of integrals, forming a very useful handbook of formulae which in many cases are long and complicated to remember. It constitutes a labour saving volume of considerable value. There are\n897\nformulae in all. These include the indefinite integrals of many rational and irrational algebraic and transcendental functions, formulae of reduction, and the more important definite integrals. There are numerous auxiliary formulae, for example, those arising in trigonometry, the principal relations between the elliptic integrals\n(\nJacobian notation\n)\n, and series for frequently occurring functions. In the last the author has been careful to state the limits within which the expansions are valid.\nJoseph Lovering had retired in\n1888\nand Peirce was appointed to succeed him becoming Hollis Professor of Mathematics and Natural Philosophy. However, the extreme hard work that he undertook over many years eventually took its toll on his health and in\n1900\nhe suffered a collapse. For two years he was unable to undertake his teaching duties. However, rather strangely, during this period although he could not do any work in physics, he was able to undertake work on mathematics. He returned to teaching in\n1902\nbut his health was still poor. He walked with a cane and usually moved about holding on to anything near for support. His health slowly improved and he became more active in research than ever: for example, he published\n4\npapers in\n1903\n.\nHe was now an important figure in applied mathematics in the United States and he soon received recognition for his achievements. He was elected to the Council of the\nAmerican Mathematical Society\n, serving from\n1896\nto\n1898\n. He was a founder of the American Physical Society when it began in\n1899\nand was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1906\n. He was honoured with election to foreign academies such as the\nMathematical Circle of Palermo\nand the Physical Society of France. In\n1910\nhe was awarded an honorary degree by Harvard University. In\n1912\nhe represented Harvard University at the celebrations for the\n250\nth\nanniversary of the founding of the\nRoyal Society of London\n.\nHarry Bateman\n, writing in\n[\n4\n]\n, says that Peirce was a:-\n... master of the methods dealing with the partial differential equations of mathematical physics.\nEdwin Hall writes in\n[\n9\n]\nthat Peirce:-\n... was a great scholar and a remarkable man. Big and powerful of body, and ambidextrous, he was in mind also capable and proficient far beyond the ordinary measure of his fellows. He seemed to grasp with equal ease and to retain with equal tenacity the profoundest generalizations of mathematics or physics and the smallest bits of information likely to be of service in his work. He always knew the best materials and the best tools to use and the best way to use them. Fertile in ideas, strong of purpose, ceaseless, literally so, in industry, businesslike by instinct and tradition from his merchant ancestors, sympathetic and generous beyond the wishes of his friends, he was a mighty, beneficent, and genial power, wherever he took his stand; and he was successful, as few men are successful, in winning the confidence, the admiration, and the affection of those with whom he was associated.\nArthur Gordon Webster writes\n[\n12\n]\n:-\nAbsolute self-abnegation and devotion to duty were the keynote of his character. With him modesty was so excessive as to almost cease to be a virtue. When consulted by a colleague with regard to some difficulty, almost invariably his first response was that he did not know anything about the subject, and it was necessary to draw him out with insistence in order to get at his superior knowledge. He was always fearful of giving trouble to some one, and frequently lay awake at night worrying over the troubles of others, never his own. Always cheerful and ready with a joke or anecdote, he was the kindest and sanest of advisers. Possessed of a sure and childlike religious faith, he was almost a Puritan in the conduct of his own life, but absolutely sympathetic and charitable toward others. Only himself he did not spare. Often his friends would remonstrate with him against his risking his health by overwork, but it was impossible to get him to desist. His teaching was characterized by the greatest clearness and infinite pains. Everything that he did was done with elegance and neatness.\nThe extreme activity that Peirce began after his illness in\n1900\n-\n02\ncontinued until the spring of\n1913\nwhen again his health became so bad that he was forced to stop teaching before the end of the academic year. However, he was still able to visit Britain with his family. As well as visiting England, he made a trip to Scotland where his wife's brothers were working. Both were ministers in the Church of Scotland, the Rev. James Landreth\n(1850\n-\n1934)\n, the Parish Minister at Logie-Pert, Angus, and the Rev. Peter Robert Landreth, the Parish Minister of St John, Perth. James Landreth, who was awarded an M.A. by Edinburgh University in\n1874\n, served at Logie-Pert from\n1884\nto\n1934\n. Peirce had excellent relations with his wife's brothers and they shared many intellectual interests. During his visit to Britain Peirce's health gave cause for concern, he suffered a minor stroke and had heart problems. He returned to Harvard during the summer of\n1913\nand began teaching again at the start of the autumn term. Although he had severe difficulties, he continued to teach through the term but during the Christmas break his illness became much more acute and, after two weeks of great suffering, he died. His funeral service was held in Appleton Chapel.\nIn\n1926\nthe book\nMathematical and Physical Papers,\n1903\n-\n13\nwas published. E P Adams writes\n[\n3\n]\n:-\nThe publication of the collected papers of those who have made important contributions to science is always a valuable undertaking, and it is gratifying to have this volume which includes most of Professor Peirce's publications during the last ten years of his life. Most of the papers in this volume are concerned with the magnetic properties of iron. Professor Peirce devoted much time to the study of this subject, and his work is marked by the great care he took in his experiments and by his thoroughgoing analysis of the details of the problems involved; it is an admirable example of the best type of experimental work. There are also included in this volume four papers of more mathematical interest, dealing with problems in the theory of the potential.\nFor a fairly complete list of Peirce's publications, see\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}