{
  "nome_completo": "Beno Eckmann",
  "nome_curto": "Beno Eckmann",
  "ano_nascimento": "1917",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eckmann/",
  "lugar_nascimento": "Berne, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Beno Eckmann\nwas brought up in Bern where he attended the\nGymnasium\nobtaining his Diploma in\n1935\n. He then entered the Eidgenössische Technische Hochschule Zürich where he was taught mathematics by a number of outstanding mathematicians. Eckmann fully appreciated the importance of this aspect in his mathematical development writing\n[\n1\n]\n:-\nI feel that the best thing that can happen to a University mathematician is to have good teacher and/or good students; I was fortunate enough to have both. With regard to good teachers it certainly suffices if I mention names:\nHeinz Hopf\n,\nPlancherel\n,\nPólya\n,\nBernays\n. As a student I attended their courses and seminars and was introduced in an unusually personal way to the world of mathematics.\nEckmann graduated with his Master's Degree from the Eidgenössische Technische Hochschule Zürich\n(\nETH\n)\nin\n1939\n. He was appointed as an Assistant to\nPlancherel\nwhile he worked for his doctorate under\nHopf\n. Eckmann explains how these two provided a remarkable foundation for his career in\n[\n1\n]\n:-\nAs an assistant to\nPlancherel\nI had the opportunity to work, and even lecture, in different fields, including analysis. Under the wonderful guidance of\nHeinz Hopf\nI then got into my doctoral thesis work. It was characteristic of\nHopf\n's views on our science that this meant not only learning algebraic topology - then a very young field - but also getting acquainted with group theory,\ndifferential geometry\n, and algebra in the \"abstract\" sense of the\nEmmy Noether\nschool. The combination of these fields, considered at that time to be largely separated from each other, remained a constant challenge during all my later work ...\nIn\n1941\nEckmann was awarded his Dr. sc. math.\n(\nequivalent to a Ph.D.\n)\nfrom ETH Zürich. He submitted a thesis which was judged quite outstanding, even relative to the high standards they had, and Eckmann was awarded the Kern Prize and silver medal for his work. After the award of the doctorate he remained at Zürich as a\nPrivatdozent\nuntil\n1942\nwhen he was appointed as a lecturer at the University of Lausanne.\nThe most important person to influence Eckmann during his years at the University of Lausanne was\nGeorges de Rham\nwho was an extraordinary professor there when Eckmann arrived and became full professor in\n1943\n. Eckmann writes:-\nMy first University appointment was in Lausanne\n1942\n-\n48\nwhere close contacts with\nGeorges de Rham\nprovided friendship and stimulation.\nWhile holding the position in Lausanne, Eckmann visited the Institute for Advanced Study at Princeton. He arrived there in January\n1947\nand remained there for most of the year, returning to Lausanne in September. This gave him:-\n... the possibility of concentrated research and meeting so many mathematicians whose names had been familiar before, when contacts were not possible because of the war.\nIn\n1948\nEckmann, who had already been promoted to Extraordinary Professor at Lausanne, was offered a full Professorship back at the Eidgenössische Technische Hochschule Zürich. It was an opportunity that he certainly was not going to turn down and, pleased to be back, he remained as Professor there until he retired in\n1984\n. He did, however, make many visits as a visiting professor. For example he was a visiting Professor at the University of Michigan during the summer of\n1950\n, the University of Illinois during the winter of\n1952\n, the University of California at Berkeley during the summer of\n1955\nand the Scuola Normale Superiore in Pisa in the spring of\n1958\n.\nAn important change in Eckmann's duties in Zürich occurred in\n1964\n. In that year the Forschungsinstitut für Mathematik\n(\nMathematics Research Institute\n)\nwas founded in Zürich. Eckmann was appointed as Head of the Institute and he held this position until he retired in\n1984\n. He writes that the Institute was:-\n... designed especially for the purpose of inviting visitors to cooperate with the department members and their students. The Institute rapidly developed into a well-known international centre of mathematics research; needless to say, it was of great benefit to me ...\nIn April\n1977\na Colloquium was held in Zürich to celebrate Eckmann's\n60\nth\nbirthday.\nSaunders Mac Lane\nspoke at the Colloquium about Eckmann's contributions to the founding of homological algebra and category theory.\nPeter Hilton\n, who had been a personal friend of Eckmann's for many years spoke in detail of Eckmann's research in topology: continuous solutions of systems of linear equations, a group-theoretical proof of the\nHurwitz\n-\nRadon\ntheorem, complexes with operators, spaces with means, simple homotopy type. Details of these research contributions are given in\n[\n2\n]\n.\nHilton\ndescribed Eckmann's contributions to mathematics as being described by the names:-\n... unification, clarification and penetration.\nEckmann,\n[\n1\n]\n, expresses his thanks to\nPeter Hilton\nfor their many years of collaborations:-\nI am deeply grateful, not only for stimulation and sharing so many ideas with me, but also for his friendship ...\nIt was not only with\nPeter Hilton\nthat Eckmann collaborated. Rather collaboration was what he liked to do and many of his research papers arose from these collaborations, many of which were with his students.\nFinally we should comment on other roles which Eckmann held and honours which he has received. He was Secretary to the\nInternational Mathematical Union\nfrom\n1956\nto\n1961\n, President of the Swiss Mathematical Society in\n1961\n-\n62\n, and a member of the research Council of the Swiss National Science Foundation from\n1964\nto\n1984\n. He received honorary degrees from Fribourg in\n1964\n, Lausanne Polytechnique in\n1969\n, and the Israel Institute of Technology in\n1983\n. He was also awarded the Prix Mondial Nessim Habif from the University of Geneva in\n1967\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Topology"
  ]
}