{
  "nome_completo": "Charles Bernard Childs",
  "nome_curto": "Bernard Childs",
  "ano_nascimento": "1895",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Childs/",
  "lugar_nascimento": "Wandsworth, London, England",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Bernard Childs\n's father was Charles Alfred Childs\n(\nborn in Kingston, Surrey about\n1865)\nwho was a commercial clerk. His mother was Emily G Childs\n(\nborn in Kingston about\n1866)\n. In\n1911\n, Charles Bernard Childs, our mathematician, was studying at The College, Hadham Road, Bishop's Stortford.\nChilds studied at the University of Birmingham, graduating with a B.Sc. in\n1920\n. A quick calculation shows that he was twenty-five years old when he graduated and this was because he began his studies at Birmingham a few years after leaving secondary school. He remained at Birmingham undertaking research for a doctorate in Natural Philosophy and this was awarded in\n1922\nfor his thesis\nThe thermomagnetic properties of carbon steels at temperatures round the Curie point\n.\nChilds was appointed as an Assistant Lecturer in Natural Philosophy at Edinburgh University in\n1922\n. He was promoted to lecturer in\n1924\n. In\n1956\nhe became a Senior lecturer and remained in this position until his death five years later.\nShortly after arriving in Edinburgh as an Assistant, Bernard Childs joined the\nEdinburgh Mathematical Society\nin March\n1923\n. He was elected to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1956\n, his proposers being Norman Feather,\nRobert Schlapp\n,\nJames Paton\n,\nThomas R Bolam\n.\nAn obituary, written by Norman Feather, appears in the\nRoyal Society of Edinburgh\nYear Book\n1957\n, pages\n10\n-\n12\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nFinally we note that Childs had many interests other than his subject. Feather writes\n[\n1\n]\n:-\nHe was founder Chairman of the Scottish Community Drama Association from\n1926\nto\n1930\n, when he was appointed to the office of Vice-President which he held for the remainder of his life. Parallel to this interest, with a touch of science intruding, was his interest in the cinema: he held successively the offices of Vice-Chairman\n(1948\n-\n51)\n, Chairman\n(1951\n-\n54)\nand Secretary\n(1954\n-\n56)\nof the British Universities' Film Council. Over a longer period he was an office-bearer of the Edinburgh Association of University Teachers\n(\nSecretary,\n1933\n-\n35\nand\n1951\n-\n53\n; Vice-President,\n1953\n-\n56)\n.",
  "math_areas": []
}