{
  "nome_completo": "William Werner Boone",
  "nome_curto": "Bill Boone",
  "ano_nascimento": "1920",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boone/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "Urbana, Illinois, USA",
  "biografia": "Bill Boone\n's parents were not very well off financially so after he had attended a number of Roman Catholic schools, he was not able to further his education at college due to the financial pressure his parents were under. This meant that while he trained as an accountant after leaving high school he had to earn his way working as a barman. However his real ambition at this time was to become a writer and he attended workshops on writing and wrote a short story\nWang Fu Makes a Choice\n. Don Collins writes\n[\n1\n]\n:-\nThis varied background left Bill with a wide range of experience and literary interests and he always retained a fascination with the dramatic aspects of life. One book he much admired was Thomas Wolfe's 'Of Time and the River' whose hero, afflicted with a Faustian thirst for knowledge, moves from the rural South of the United States to Boston and then to England and France, and there is a superficial parallel to this in Bill's all-inquisitive progress from the Mid-West to sophisticated Princeton and subsequent regular visits to Europe. However, Bill never lost the directness and openness that one thinks of as characteristic of the provincial America of his youth, and his vigorous personality and broad Mid-West accent left an abiding impression on all who knew him.\nDespite his literary interests, Bill decided to turn to mathematics, a subject which seemed to grow in importance for him around this time in his life, and he studied part-time for a degree at the University of Cincinnati. He graduated with an A.B. in\n1945\nand, the same year, began graduate studies at Princeton University. Boone was never called up for active service during World War II but in the latter years of the war, while he studied part-time for his degree, he also did technical work for the armed services as his contribution to the war effort. After graduating in\n1945\n, he was appointed as an Instructor in Mathematics at Princeton University and at the same time began to undertake research towards his doctorate, with\nAlonso Church\nas his advisor. Boone married Eileen Herweh in\n1949\n; they had two sons William and Theodore. He had a spell as an Instructor of Mathematics at Rutgers before being appointed as Assistant Professor at the Catholic University in Washington in\n1950\n.\nHe obtained a doctorate from Princeton in\n1952\nhaving failed to carry out\nEmil Post\n's suggestion of constructing a\nfinitely presented group\nwith insoluble word problem.\nPost\nand Markov had independently constructed\nsemigroups\nwith this property in\n1947\n. In fact Boone had constructed for his doctoral thesis an example of a finitely presented group with no way to decide if a given element lies in the subsemigroup generated a fixed finite set. His thesis was entitled\nSeveral Simple, Unsolvable Problems of Group Theory Related to the Word Problem\n. In\n1950\nAlan Turing\nhad given an example of a cancellative semigroup with insoluble word problem\n(\nhaving at one stage believed incorrectly that he could solve the problem for groups\n)\n. Following these ideas of\nTuring\n's, Boone finally proved the insolubility of the word problem for groups in\n1957\n, two years after\nPetr Sergeevich Novikov\npublished his proof. In many ways he was unlucky not to have published before\nNovikov\nfor, after reviewing\nTuring\n's\n1950\npaper, he had realised how to construct a group with insoluble word problem but his teaching duties had been too heavy to allow him the opportunity to work through his ideas\n[\n1\n]\n:-\nIn later years Bill regretted a little that it had taken him so long to complete his proof, but it was not in his nature to rush things and whenever he had teaching or other commitments these would absorb much of his time and he would not be able to devote himself to the process of slowly becoming immersed in his research. Bill's strength as a mathematician was his ability to master, painstakingly and thoroughly, a mass of intricate combinatorial detail and this strength was severely sapped by routine distractions.\nOnly after spending\n1954\n-\n56\nat the Institute for Advanced Study in Princeton, funded by the Fulbright Commission, was he able to put in the necessary time to complete his proof. He wrote up the results of his thesis in four parts under the title\nCertain simple, unsolvable problems of group theory\n; two parts appeared in\n1954\n, and two more in\n1955\n. His proof that the word problem for groups was insoluble appeared as parts V and VI in\n1957\n.\nRoger Lyndon\nwrites in a review:-\nA proof is given of the unsolvability of the Word Problem in the theory of groups. A group is defined, in terms of a finite number of generators and a finite number of defining relations, such that the set of all those formal products of generators and their inverses that represent the identity element is not recursive. The proof is independent of, and different from, an earlier proof by\nP S Novikov\n. The method is a refinement of that used by the author in the earlier papers of this series ...\nBoone set off for a prolonged tour of Europe in\n1956\nand his travels were assisted by the award of a Guggenheim fellowship in\n1957\n[\n1\n]\n:-\nOslo, in\n1956\n-\n57\n, visiting\nT Skolem\n, was followed in\n1957\n-\n58\nby Münster, Manchester and Oxford. This was the most carefree time in Bill's career - though he was, by temperament, a man never entirely free from worries - for he had a major result behind him and time to think. Also the variety and diversity of Europe and its languages and cultures made a deep impression on him and, at a less elevated level, he acquired a taste for German beer and for the English habit of ending the working day by discussing mathematics in a nearby pub. He was proud, too, of the fact that he learnt some Norwegian and was extraordinarily pleased when someone described his occupation as 'peripatetic scholar'. Bill was gregarious in the extreme and made many friends among European mathematicians, notably G Hasenjaeger in Germany and\nJ L Britton\n,\nG Higman\nand\nB H Neumann\nin England, to name only a few.\nBoone's first inclination after proving his insolubility theorem was not to move on to other problems but rather to keep on polishing and improving his proof. His next publications had precisely this aim:\nThe word problem\n(1958)\nand\nThe word problem\n(1959)\ngave an improvement and simplification of his earlier results and methods. By\n1959\nhe had published ten papers but eight of them had just two titles between them. The other two papers were\nThe equivalence of the word problem and Magnus's extended word problem\n(1956)\nand\nAnalysis of Turing's \"The word problem in semigroups with cancellation\"\n(1958)\n. Boone proved in\n1959\nthat many other decision problems for groups were insoluble which was published in a joint publication\nSome unsolvable problems about elements and subgroups of groups\nwith\nGilbert Baumslag\nand\nBernhard Neumann\n. From\n1958\nBoone worked at the University of Illinois, Urbana, first as an Associate Professor, and from\n1960\nas a full professor. He was based at the University of Illinois, Urbana, for the rest of his life, but he loved Europe and spent much time there. He spent the years\n1972\n-\n73\nand\n1978\n-\n79\nat Oxford and wrote a joint paper\nAn algebraic characterisation of groups with solvable word problem\nwith\nGraham Higman\nduring the first of these visits which is of major importance. It gives an algebraic characterisation of groups with soluble word problem connecting this property with embeddability in a\nsimple group\n.\nDon Collins recounts Boone's health problems in\n[\n1\n]\n:-\nAs a young man Bill was thin and fit but he put on weight in his middle years and perhaps this in combination with his intense nature caused him to have a major heart attack in the spring of\n1971\n. However, he recovered well and enjoyed good health throughout the\n1970\ns. In December\n1981\nhe became seriously ill with cancer of the pancreas but, after surgery, recovered and came to Oxford in the summer of\n1982\n, looking well and sporting a white beard. By the spring of\n1983\n, though, something was wrong again but eventually after further surgery he was deemed to be cured. Still in hospital, he was making good progress when he died suddenly of a heart attack.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic"
  ]
}