{
  "nome_completo": "Anicius Manlius Severinus Boethius",
  "nome_curto": "Boethius",
  "ano_nascimento": "480",
  "ano_morte": "524",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boethius/",
  "lugar_nascimento": "in or near Rome, Byzantine Empire (now Italy)",
  "lugar_morte": "Pavia, Gothic Empire (now Italy)",
  "biografia": "Anicius Manlius Severinus Boethius\ncame from the family of Anicii who had been Christians for around\n100\nyears. He became an orphan when he was about seven years old when his father, who became consul in\n487\n, died soon afterwards. Boethius was brought up in the house of the aristocratic family of Quintus Aurelius Memmius Symmachus. In fact Symmachus himself had been consul in\n485\njust before Boethius's father.\nBoethius was extremely well educated, being fluent in Greek and very familiar with the works of the Greek philosophers. Although there is no firm evidence to prove that Boethius ever studied in Athens or Alexandria, many historians believe that this must have been the case for him to have achieved a unique level of scholarship among his countrymen.\nHe married Symmachus's daughter Rusticiana and they had two sons who would follow their father in being appointed to high public office. Boethius served a term as consul in\n510\nwhile in\n522\nhis two sons held the office of consul simultaneously.\nEducation and knowledge were important to Boethius and he used his talents in writing and translating. His understanding of mathematics was rather limited, however, and the text he wrote on arithmetic was of poor quality and although his geometry text has not survived there is little reason to believe that is was any better. Despite this his mathematics texts were the best available and were used for many centuries during a time when mathematical achievement in Europe was at a remarkably low point. Boethius's\nArithmetic\nwas based on the work of\nNicomachus\nand, although this gave it a strange character by the mathematical standards of today, it taught medieval scholars about Pythagorean\nnumber theory\n.\nBoethius was one of the main sources of material for the quadrivium, an educational course introduced into monasteries consisting of four topics: arithmetic, geometry, astronomy, and the theory of music. On this last topic Boethius wrote on the relation of music to science, suggesting that the pitch of a note one hears is related to the frequency of sound.\nHe embarked on an ambitious project to translate and write commentaries on all the works of both\nPlato\nand\nAristotle\n. His aim was to show the ways in which these two most important Greek philosophers agreed with each other. It was a project that Boethius was never to finish, in particular he died before he could translate\nPlato\n's work and fulfil his aim of harmonising the two philosophies.\nHe did, however, make Latin translations of\nAristotle\n's\nCategories\nand\nDe interpretatione\nand of\nPorphyry\n's\nIsagoge\nⓉ\n(\nIntroduction\n)\nwith two commentaries, which were widely used throughout the Middle Ages. Up to the\n12\nth\ncentury his writings and translations were the main works on logic in Europe becoming known collectively as the\nLogica vetus\n(\nmeaning the old logic\n)\n.\nRussell\nsays that Boethius stands out as a man of great learning and great zeal, free from superstition and fanaticism. He writes in\n[\n14\n]\n:-\nHe would have been remarkable in any age, in the age in which he lived, he is utterly amazing.\nBoethius became head of all the government and court services under Theodoric, king of Italy and of the Goths.\nRussell\nwrites in\n[\n14\n]\n:-\nTheodoric employed Boethius to reform the coinage, and to astonish less sophisticated barbarian kings with such devices as sun-dials and water-clocks.\nTheodoric ruled Italy as essentially an independent monarch although he was the nominal representative of the Byzantine emperor. He had himself proclaimed king at Ravenna in\n494\nafter taking back Italy from Odoacer. Boethius became magister officiorum under Theodoric in about\n520\n. It was about this time that Boethius worked to mend relations between the Church in Rome and the Church in Constantinople which may in the end have been the reasons that he fell from favour.\nJustin I in Constantinople was an orthodox Christian whereas Theodoric was an Arian. When the senator Albinus was accused of treason \"for having written to the Emperor Justin against the rule of Theodoric\" he was defended by Boethius. This led to Boethius himself being charged with treason, and other serious charges were also brought such as the practice of magic and of sacrilege.\nBoethius was put in prison and there he wrote his most famous work\nDe consolatione philosophiae\n.\nRussell\nsays:-\nTheodoric ... believed, rightly or wrongly, that there was a plot involving men in his own government. This led him to imprison and execute his minister, the senator Boethius.\nSymmachus, Boethius's father-in-law, defended him against the charges but this only led to Symmachus himself being charged. Boethius was sentenced to death, the sentence was ratified by the Senate probably against its will, and it was carried out. Symmachus was also sentenced to death and, when Theodoric himself died in\n526\nit was widely believed that he had been paid back for his crimes.\nThe\nDe consolatione philosophiae\nlooked at the\n[\n2\n]\n:-\n... questions of the nature of good and evil, of fortune, chance, or freedom, and of divine foreknowledge. ... in the fifth book, for example, he attempted to resolve the apparent difficulty of reconciling human freedom with the divine foreknowledge, a problem that among Stoic thinkers - though by no means uniquely among them - had been in general currency for a long time.\nThe powerful, yet simple, Platonic theism and morality which shines out of the\nDe consolatione philosophiae\nmade it extremely popular during the Middle Ages and the Renaissance. Perhaps aware that his aim in translating\nPlato\nwas not to be fulfilled, Boethius put into his work a Platonic view of knowledge and reality. The work was originally written in Latin but it was later translated into many different languages.\nWe give an example of a picture of Boethius in his study which is taken from a translation of\nDe consolatione philosophiae\ninto French. The translation was made by Jean de Meun and dedicated to Philip IV of France. This means that the original was produced before Philip's death in\n1314\n. The drawing is taken from a copy made by André Rousseau, a bookseller attached to the University of Bourges, completed on\n1\nFebruary\n1476\n. There are seven illustrations by the famous artist Jean Colombe, of which \"Boethius in his study\" appears in the translation of Boethius's original introduction.",
  "math_areas": [
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}