{
  "nome_completo": "Boris Avraamovich Trakhtenbrot",
  "nome_curto": "Boris Trakhtenbrot",
  "ano_nascimento": "1921",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Trakhtenbrot/",
  "lugar_nascimento": "Briceva, Northern Bessarabia (now Moldova)",
  "lugar_morte": "Tel Aviv, Israel",
  "biografia": "Boris Trakhtenbrot\n's first name is sometimes written\nBoaz\n, his middle name sometimes appears as\nAbramovich\nand his last name is sometimes transliterated as\nTrahtenbrot\n,\nTrachtenbrot\nor\nTrajhtenbrot\n. The village of Briceva or Brichevo in which he was born, mainly housing Jewish agricultural workers and their families, was close to the towns of Balti and Soroca. He was born into a Jewish family. It was in Briceva that he attended primary school but for his secondary schooling he was required to go to one of the larger nearby towns and he studied at schools in both Balti and Soroca. He wrote\n[\n13\n]\n:-\nI was fortunate to have very good teachers of mathematics. My success in learning, and especially in mathematics, was echoed by the benevolence of the teachers and the indulgence of my fellow pupils. The latter was even more important to me, since it, to some degree, compensated for the discomfort and awkwardness caused by my poor vision.\nOn\n1\nSeptember\n1939\nWorld War II began when German troops invaded Poland. This was the year that Trakhtenbrot graduated from high school. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that initially the war had little effect on life in the Soviet Union and Trakhtenbrot continued with his education. However, it led to major political changes which saw Bessarabia become part of the Moldavian Soviet Socialist Republic on\n2\nAugust\n1940\n. Having completed his secondary education, in\n1940\nhe entered the Faculty of Physics and Mathematics of the Moldavian Pedagogical Institute in Kishinev. This new institution, which only opened in August\n1940\n, was designed to train school teachers. Trakhtenbrot writes\n[\n13\n]\n:-\nThe curriculum covered a standard spectrum of teachers' training topics. In particular, mathematical courses presented basics in Calculus, Linear Algebra and Algebra of Polynomials, Analytical Geometry, Projective Geometry, Foundations of Geometry\n(\nincluding Lobachevsky Geometry\n)\n, Elements of Set Theory and Number Theory.\nOn\n8\nNovember\n1940\n, shortly after he began his studies, the area was struck by the powerful Vrancea earthquake which caused devastation across large areas of Moldova. Substantial damage occurred in Kishinev, the major city of Moldova. As if this was not trouble enough, things got much worse for Moldova on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. There was no time to even realise what was happening for, on that day, German bombers attacked Kishinev and bombs fell close to the Moldavian Pedagogical Institute campus. Continual bombing raids saw much of the city in flames and Trakhtenbrot fled from Kishinev in early July before the city fell to the advancing German troops on\n14\nJuly. We mentioned above his eyesight problems and these meant that he was not required to serve in the military. He writes\n[\n13\n]\n:-\n... after many mishaps,\n[\nI\n]\narrived as a refugee in Chkalov\n(\nnow Orenburg\n)\non the Ural River. Here, I enrolled in the local pedagogic institute. A year later we moved to Buguruslan in the Chkalov region, to where the Kishinev Institute was evacuated to in order to train personnel for the forthcoming return home as soon as our region would be liberated. Almost all the lecturers were former high school teachers - skilled people whose interests lay in the pedagogic aspects of mathematics and physics. ... Nikolai S Titov, a former Ph.D. student of Moscow University, who happened to flee to Buguruslan, lectured on Set Theory. I was deeply impressed by the beauty and novelty of this theory. Unfortunately, this was only a transient episode in those hard and anxious days. Actually, during the war years\n1941\n-\n1944\n, my studies were irregular, being combined with employment in a felt boot factory, a storehouse and, finally, in the Kuybyshev-Buguruslan Gas Trust. In August\n1944\nthe institute was evacuated to Kishinev and I returned to my native regions ...\nBack in Kishinev, Trakhtenbrot qualified as a secondary school teacher of mathematics in\n1945\n. The years of war had meant that he was approaching\n25\nyears of age before obtaining this qualification but, nevertheless, he decided that he wanted to continue his study of mathematics. He enrolled for a Master's Degree at the University of Chernovtsy, in Ukraine, in September\n1945\n. There he attended lectures by Alexander A Bobrov, whose course on set theory, based on\nFelix Hausdorff\n's book on that topic, made him feel that this was a subject on which he would like to do research. He made a visit to Lviv University to meet\nAndrey Kolmogorov\nwhich proved useful, despite\nKolmogorov\ncancelling his trip, since he was able to have discussions with\nBoris Gnedenko\nwho advised him to contact\nPiotr Sergeevich Novikov\nand Alexey Andreevich Lyapunov\n(1911\n-\n1973)\n. Around this time he met Berta Isakovna Rabinovich\n(1921\n-\n2013)\nwhom he married in\n1947\n. Berta:-\n... lovingly, selflessly, and steadfastly supported Boaz \"through fire and water\". Berta was also a motherly figure for his many students, whom she always welcomed warmly and for whom she invariably prepared the most delicious meals.\nBoris and Berta Trakhtenbrot had two sons, Mark\n(\nborn\n1950)\nand Yossef\n(\nborn\n1952)\n. Mark Trakhtenbrot became a computer scientist and was a member of the team that received the ACM Software System Award in\n2007\nfor Statemate. Let us return to Trakhtenbrot's time at Chernovtsy and his wish to continue to doctoral studies.\nTwo visits to Moscow led to\nNovikov\nagreeing to supervise Trakhtenbrot's doctoral dissertation which he began in October\n1947\nin the Kiev Mathematical Institute of the Ukrainian Academy of Sciences. He wrote\n[\n14\n]\n:-\nMy first acquaintance with S A Yanovskaya occurred in\n1947\nat the seminar she ran together with\nP S Novikov\n. Having graduated from the Chernovtsy University, I had just started my Ph.D. studies at the Kiev Mathematical Institute of the Ukrainian Academy of Sciences. The director of the institute,\nM A  Lavrentev\n, approved my petition to specialize in mathematical logic under\nP S Novikov\n, who held a permanent position at the Moscow Mathematical Institute of the USSR Academy. It was also agreed to grant me long-term scientific visits to Moscow where I would stay with my advisor. At that time departments of mathematical logic did not yet exist in the USSR and the Yanovskaya-\nNovikov\nresearch seminar \"Mathematical Logic and Philosophical Problems of Mathematics\" was the main medium in which research and concomitant activities in the area were conducted. ... The atmosphere dominating the meetings of the seminar was democratic and informal. Everybody, including the students, felt and behaved at ease without strong regulations and formal respect for rank. For me - a graduate of a provincial university, this seemed quite unusual; I was happy to acquire these habits and later to promote them at my own seminars.\nTrakhtenbrot was awarded his doctorate in\n1950\nfor his thesis\nDecidability Problems for Finite Classes and Definitions of Finite Sets\n. Here are two major results from that thesis:\nThere is no algorithm which decides for an arbitrary given formula of the first-order logic of predicates whether this formula has or does not have a finite interpretation.\nIn each \"elementary axiomatisable\" set theory there exist two definitions of finite set whose equivalence can neither be proved nor refuted in this theory.\nHe published his first paper,\nThe impossibility of an algorithm for the decidability problem on finite classes\n, in\nDoklady\nin\n1950\n.\nHaskell Curry\nwrites in a review:-\nThe author asserts that there does not exist any general recursive algorithm for deciding whether a formula of the restricted functional calculus is true in every finite domain. This is related to\nChurch\n's result that no such algorithm exists for deciding whether a formula is derivable\n(\nand hence true in every domain, finite or infinite\n)\n. ... An application to the theory of finite sets is mentioned.\nOn\n5\nDecember\n1950\n, after the defence of his thesis, Trakhtenbrot moved to Penza, about\n700\nkm south east of Moscow, for a position at the Belinski Pedagogical Institute. However, there were problems as soon as he arrived. He wrote to Alexey Lyapunov on\n13\nDecember:-\nDear Alexey, arrived safely in Penza and have already begun work. I have trouble with the flat\n(\nas usual, it was promised but not given\n)\n, and I will have a decisive conversation with the boss ... If I knew that I still have some opportunity to go elsewhere, I would even leave Penza, if they do not resolve the housing problem ...\nHis arrival in Penza is described in\n[\n12\n]\n:-\n... the new Ph.D. Trakhtenbrot, who arrived in\n1950\nin the University at Penza, was certainly not of proletarian background - a Jew who spoke eight languages, whose research was decidedly abstract and \"pure\", and who, if his present manner may accurately be extrapolated back over fifty years, must have seemed to the casual observer an easy fit to the stereotype of an absent-minded professor. Whispered accusations of bourgeois idealism were heard: in that era of Stalinist paranoia they were gravely threatening.\nThe \"gravely threatening\" accusations against Trakhtenbrot were based on his research topics and on the seminars that he gave. He gives a very full account of this \"Penza Affair\" in\n[\n14\n]\n. Let us give an indication here what the affair was about.\nIn three issues of Pravda in June, July and August\n1950\nStalin published\nMarxism and Problems of Linguistics.\nThis led to academics criticising the work of others, particularly to see if it complied with Communist thinking. The foundations of mathematics had already been an area where certain works were considered contrary to such thinking, for example\nHilbert\n's ideas that mathematics could be completely built on sets of provably consistent axioms were considered \"correct\" but\nGödel\n's incompleteness,\nRussell\n's set paradoxes and\nTarski\n's logic were all considered \"wrong\". In fact\nRussell\nhad been labelled a warmonger and\nTarski\nas a militant bourgeois. When Trakhtenbrot delivered his first lecture at Penza,\nThe Method of Symbolic Calculi in Mathematics\n, to his fellow mathematicians, in which he talked about results from his thesis, he was denounced as \"an idealist of Carnapian variety.\" In further lectures throughout\n1951\nhe tried to undo the damage but the attacks on him being an idealist only became worse. Here is an extract from a letter he received from one of his colleagues in June\n1951\n(\nsee\n[\n14\n]\n)\n:-\nThe lecturer circumvents philosophical problems. He does not criticize the bourgeois idealists, who parasitize on mathematical logic\n(\nRussell\n,\nTarski\nand others\n)\n. The lecturer persistently holds a neutral position in the dispute between materialism and idealism in mathematical logic, deliberately avoiding the subjects broached in his lectures. The very term \"good formula\" is not appropriate: a formula which is good for the capitalist is bad for us. I asked you several times and you always replied that you chose basic formulas and arbitrary transformations, that you did not apply any restrictions. What drives you to cling to this freedom? Holding on to it you reveal yourself as an idealist.\nTrakhtenbrot replied to these criticisms\n(\nsee\n[\n14\n]\nfor copies of his replies\n)\nand some leading mathematicians such as\nP S Novikov\nand A A Lyapunov, and to a lesser extent\nA N Kolmogorov\nand\nA G Kurosh\n, all came to his defence. Trakhtenbrot explains that he learnt to play the game of attacking \"vulgarisers of Marxism\" to make himself acceptable. However, the affair had consequences and he wrote to Alexey Lyapunov on\n2\nFebruary\n1952\n:-\nDear, dear Alexey. I thought that I would be able to travel to Moscow for the holidays, but the exacerbation of my stomach illness will not allow me. This aggravation is due, apparently, in part, to the unrest and feelings of relentless persecution that I abundantly receive from the Head of the Department of Mathematics. The story of \"idealism\" has received wide publicity in the Institute; the feisty nature of the case became more and more pronounced. I gave a talk at the Department of Marxism-Leninism, and they liked my report. The Department determined that \"there is no idealism in this symbolic calculus\" ... Finally, on\n31\nJanuary after a meeting of the Academic Council, I was informed that the management and the party organization of the Institute had investigated the case and concluded that in my reports, and in my work there is no idealism ... I'm incredibly tired of all these squabbles ... In general, this year for me is lost in a senseless fight with windmills ... .\nIn a similar vein, he wrote in\n[\n14\n]\n:-\nMy health was undermined by permanent tension, dread and a hard teaching load\n(\noften more than\n20\nhours weekly\n)\n. It goes without saying that for about two years I was unable to dedicate time to research. In those circumstances it was the selfless care and support of my wife Berta that saved me from collapse. I should also mention the beneficial and calming effect of the charming central Russian landscape which surrounded our dwelling.\nIn fact he only published one paper between\n1950\nand\n1955\n, namely\nOn recursive separability\n(1953)\n.\nHaskell Curry\nwrites in a review of that paper:-\nIt is well known that there is an analogy between the theory of recursive functions and the theory of analytic sets; further that this analogy breaks down in that it is possible to have two disjoint recursively enumerable sets which cannot be separated by a recursive set. The author shows that the set of all identically true formulas of the first-order predicate calculus and the set of all formulas refutable in some finite domain give rise\n(\nby a\nGödel\nenumeration\n)\nto such a pair of recursively inseparable sets.\nFrom\n1950\nto\n1960\nTrakhtenbrot worked in Penza, both at the Belinski Pedagogical Institute and at the Penza Industrial Institute which was renamed the Penza Polytechnical Institute in\n1958\n. In\n1960\nhe moved to the Siberian branch of the Mathematical Institute of the\nUSSR Academy of Sciences\n, the Akademgorodok, near Novosibirsk. This had been established in\n1957\nby\nMikhail Alekseevich Lavrentev\n,\nSergei Lvovich Sobolev\nand Sergey Alekseyevich Khristianovich\n(1908\n-\n2000)\nwith\nLavrentev\nas its founding chairman. Trakhtenbrot was based in Novosibirsk and in that city he also taught at the State University. He worked there until December\n1980\nwhen he left and emigrated to Israel. He was appointed as a professor at Tel Aviv University from\n1\nJanuary\n1981\n.\nWe have said little about Trakhtenbrot's remarkable contributions. For some extracts from reviews of some of his books, see\nTHIS LINK\n.\nWe quote from\n[\n3\n]\nto give an overview of his contributions:-\nHe is unmatched in combining farsighted vision, unfaltering commitment, masterful command of the field, technical virtuosity, aesthetic expression, eloquent clarity, and creative vigour with humility and devotion to students and colleagues. For over half a century, Trakhtenbrot has been making seminal contributions to virtually all of the central aspects of theoretical computer science, inaugurating numerous new areas of investigation. He has displayed an almost prophetic ability to foresee directions that are destined to take centre stage, a decade or more before anyone else takes notice. He has never been tempted to slow down or limit his research to areas of endeavour in which he has already earned recognition and honour. Rather, he continues to probe the limits and position himself at the vanguard of a rapidly developing field, while remaining, as always, unassuming and open-minded. ... The list of topics upon which Trakhtrenbrot has made a lasting impression is breathtaking in its scope: decidability problems in logic, finite automata theory, the connection between automata and monadic second-order logic, complexity of algorithms, abstract complexity, algorithmic logic, probabilistic computation, program verification, the lambda calculus and foundations of programming languages, programming semantics, semantics and methodology for concurrency, networks, hybrid systems, and much more. Despite this prolificacy of subjects, the entire body of his work demonstrates the same unique melding of supreme mathematical prowess, with profound depth and thoroughness.\nIn June\n1991\n\"An International Symposium on Theoretical Computer Science in honour of Boris A Trakhtenbrot on the occasion of his Retirement and Seventieth Birthday\" took place in Tel Aviv. On Friday,\n28\nApril\n2006\n, the School of Computer Science at Tel Aviv University held a \"Computation Day Celebrating Boaz\n(\nBoris\n)\nTrakhtenbrot's Eighty-Fifth Birthday\". The book\n[\n1\n]\nwas produced to celebrate this\n85\nth birthday. In\n2011\n, the European Association for Theoretical Computer Science awarded Trakhtenbrot, then about to turn\n90\n, its annual Distinguished Achievements Award.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}