{
  "nome_completo": "Caleb Gattegno",
  "nome_curto": "Caleb Gattegno",
  "ano_nascimento": "1911",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gattegno/",
  "lugar_nascimento": "Alexandria, Egypt",
  "lugar_morte": "Paris, France",
  "biografia": "Caleb Gattegno\n's father, Menachem Gattegno, was descended from Spanish merchants who had emigrated to Alexandria, Egypt. Caleb's mother was named Bchora. Caleb, the eighth of his parents' nine children, was born and brought up in Alexandria. His siblings were Shmuel\n(\nborn\n1898)\n, Rebecca, Isaac, Leoni, Stella, Jerom, Mayer and Elyasaf. It was a hard upbringing in which he had to work from a very young age to earn money to live on. With no formal education, from about the age of fourteen he began to educate himself. He was particularly fond of studying mathematics and he quickly found the benefits of teaching himself for he was then able to earn money tutoring others.\nThe level that Gattegno reached studying on his own was quite remarkable for, at the age of twenty, in\n1931\n, he sat the external degree examinations of the University of Marseille in Cairo. He was awarded the Licencié ès Sciences in Physics and Chemistry in\n1931\nand, in the following year, he sat the mathematics examinations and was awarded a Licencié ès Sciences in Mathematics in\n1932\n. With the award of his degrees, he was able to be employed as a teacher and, from\n1932\nto\n1936\n, he was a mathematics teacher at the Lycée Français in Alexandria. This school had been set up and was run by the Mission Laïque Française, an organisation set up in\n1902\nby Pierre Deschamps with the aim of spreading the French language and French culture to countries outside France. In addition to teaching at this school, he set up the Mathematics Seminar of Alexandria in\n1932\nwhich was the first modern institution in Alexandria where university level mathematics was taught. Gattegno did not stop studying at this stage and, after teaching for four years at the Lycée Français in Alexandria, in\n1936\n, he was awarded the Diplôme d'Etudes Supérieurs de Mathématiques from the University of Marseille, again taking the external examinations in Cairo. In\n1937\nhe was awarded a doctorate from Basle University, Switzerland, for his\n37\n-page thesis\nLes cas essentiellement géodésiques des équations de Hamilton-Jacobi intégrables par séparation des variables\nⓉ\n(\nThe essentially geodesic cases of Hamilton-Jacobi equations integrable by separation of variables\n)\n.\nGattegno married Gabrielle Jaouich and they had children Alma and Dolores\n(\nknown as Lola\n)\n. In\n1938\nhe founded the Centre d'Études Supérieures Scientifique et Techniques in Cairo. He worked in Cairo as its director through the years of World War II until\n1945\n. Alma, his daughter, writes\n[\n2\n]\n:-\nMy sister Lola and I had a very happy childhood, in spite of the upheaval of the Second World War. During that time, my father spent a lot of time with me and we often played. He always told me bedtime stories, fairy tales from different cultures, as well as the French classics - simplified so I could understand them. But he also made up his own stories, to suit my age as I grew up. I knew then that it wasn't the same, because he often forgot the names of the characters he was inventing for me. Before that, he never forgot the names of the characters from novels and plays. So already in the late\n1930\ns and early\n1940\ns, he had started on the stories he first published in French as the 'Six contes pour enfants'\n(\n'Six Tales for Children'\n)\nto which he later added two more for the 'Eight Tales'. He chose to publish our favourite stories.\nIn fact the work that Alma refers to was\nSix contes pour enfants\nⓉ\n(\nSix children's tales\n)\npublished in\nLes Lettres françaises\n(\nCairo\n)\nⓉ\n(\nFrench letters\n(\nCairo\n)\n)\n(1944)\n. In the same year Gattegno published\nLes enfants et nous - Causerie pédagogique\nⓉ\n(\nChildren and us - Instructional talk\n)\n, also in\nLes Lettres françaises\n(\nCairo\n)\nⓉ\n(\nFrench letters\n(\nCairo\n)\n)\n. Earlier he had published\nContribution à l'étude psychologique du Trac\nⓉ\n(\nContribution to the psychological study of stage-fright\n)\n(1941)\nand\nLes problèmes de l'éducationde l'après guerre\nⓉ\n(\nThe problems of post-war education\n)\n(1943)\n. In\n1945\nhe published\nAnalyze générale et topologie de l'espace des connaissances\nⓉ\n(\nGeneral analysis and topology of the knowledge space\n)\n.\nIn\n1945\nGattegno went to England, spending the year\n1945\n-\n46\nas a Visiting Professor of Mathematics at the University of Liverpool. He then taught in the University of London and various schools in London over the years\n1946\n-\n57\n. Alma writes\n[\n2\n]\n:-\nAfter the war, Dad went to England to lecture at Liverpool University for a year and returned to take me family over in\n1946\n. He was then a lecturer at London University. We were very suddenly uprooted and taken to a country still suffering from the privations of war, where children played in bombed sites. The whole environment was strange, the people and the language; though my sister and I spoke English well, the education system was different, friends difficult to find. We moved three times and went to different schools before we settled in Hampton Hill. He sent us to good schools, encouraging us to do well.\nGattegno did much more than teach, however, for he also studied, founded organisations and ran summer schools. Let us quote Alma again regarding these summer schools\n[\n2\n]\n:-\nIn\n1947\n, Dad organised his first holiday camp for children in Neuilly, France. He had founded the Association Internationale pour l'Exchange des Jeunes\n(\nInternational Association for the Exchange of Youth\n)\nto bring together children from different nationalities and social backgrounds during their school holidays. This was a cultural and educational period of two to four weeks, which allowed them to become friends, and for some this became a life-long friendship. The accommodation was often in famous places which were vacant at that time: boarding-schools, a castle, a convent, etc. Initially, these camps were for children of our age, then the age level went up as we got older until we also had adults join us. Dr G ran most of them himself with other teachers helping, and later some groups were conducted by them, while he was with another group elsewhere. Lola and I attended one every year. Our French cousins also came to some of them, and have fond memories of that time. We visited France, Belgium, Holland, Germany, Switzerland, Denmark with participants from several of these countries in each camp. One special holiday was in April\n1951\nat the Herzberg Volkshochschule near Aarau in Switzerland. It was combined with a seminar of mathematicians, scientists, and medical specialists, various groups holding their meetings at different times. But it allowed us younger people to come in contact with very interesting adults who were well-known in their own areas.\nJim Reed describes these \"holiday camps for children\" in\n[\n19\n]\n:-\nAll these holidays followed a similar pattern: we explored the immediate surroundings, had trips further afield, and - especially memorable - afternoon discussions which Dr G chaired, asking some basic question that probed our understanding and attitudes to life. He was a born teacher. Why else would he have been running yet more educational courses in his free vacation time from the London University Institute of Education? I had some fine teachers at my school, but Dr G was something different again. What sticks in my mind is not any one particular subject, but his style and method. He would sit with us all round him, his posture upright and slightly formal, speaking clearly and fluently with his still foreign accent. His approach was often teasing, provocative, designed to unsettle your assumptions and prejudices, very much the Socratic Method; serious but with an underlying humor, a sparkle of irony behind his glasses. Sometimes he would put you in the middle of the circle and get you to say something, answer some question, and then suggest something you'd revealed about yourself, your character, your outlook.\nAs well as teaching at the University of London, he was studying there for a Master's Degree in education which was awarded in\n1948\nfor his thesis\nThe Mathematical Definition of Education\n. In\n1952\nhe was awarded a second doctorate, this time from the University of Lille, France, for his work on philosophy and teaching. His thesis was entitled\nReserches sur une pédagogie de l'affectivité\nⓉ\n(\nResearch on a pedagogy of affectivity\n)\n.\nHe founded the International Commission for the Study and Improvement of the Teaching of Mathematics in\n1950\n. Among its original members were\nGustave Choquet\nand\nJean Dieudonné\n, and soon\nPedro Puig Adam\n,\nGuido Castelnuovo\nand other leading mathematicians joined. In\n1952\n, Gattegno founded the Association for Teaching Aids in Mathematics with the aim that \"all children should learn mathematics through lively and interesting experiences.\" This British organisation continues to exist, now named the Association of Teachers of Mathematics\n(\nATM\n)\n, a name they adopted in\n1962\n. In the same year of\n1952\nhe founded the journal\nMathematics Teaching\n, as the journal of the Association, and it continues to publish with the\n265\nth volume appearing in February\n2019\n.\nAnother project that Gattegno started while in London was translating Jean Piaget from French to English. Alma writes\n[\n2\n]\n:-\nHe not only wrote his own books. He also translated two of Jean Piaget's books with our friend Mrs F Hodgson, and I often listened to them as they worked and considered how to convey Piaget's ideas in English. Mrs Hodgson was a lecturer at the language education department of the University of London where Dad was in the mathematics department. She helped us to adjust to life in England and her library of English literature was a great source of enjoyment for me.\nGattegno was unhappy about certain aspects of Piaget's\nThe Child's Conception of Number\nand, after consulting with Piaget, he made considerable changes to the English translation to fit with Gattegno's own ideas. It was published in\n1951\n.\nIn\n1953\nGattegno came across Cuisenaire rods, invented by Emile-Georges Cuisenaire\n(1891\n-\n1976)\nto help teach arithmetic to children. It was Gattegno who knew how to publicise Cuisenaire's ideas and together they published\nNumbers in colour\n(1954)\n. Gattegno writes in the Preface:-\n... the importance of Cuisenaire's discovery can be formulated in mathematical and psychological terms. Mathematically he has created a material that can exemplify all the arithmetical relationships met with in school life, so that we have an aide which is adequate at every stage, when we pass from counting to multiplication, from addition to fractions or to proportion, for we have a set of rods that can be \"structured\" in a variety of ways according to the particular relations that is in question. ... Psychologically, the value of Cuisenaire's contribution lies in the fact that by providing a semi-abstract material he has overcome the obstacle of the gap between active and intellectual thought. Our minds are swift when dealing with images and representations but they move slowly in the actual performance of an action.\nAlso in\n1954\nGattegno set up the Cuisenaire Company in England with himself as the director. The Company still exists, see\n[\n8\n]\nand\n[\n22\n]\n.\nGattegno was based in London until\n1965\nalthough he spent much time travelling to various countries around the world. His influence during the London years was not only from his travels but also from the students he taught at the London Institute of Education. For example, his ideas for teaching reached countries like South Africa through students who returned there after studying with him in London. He refused to visit South Africa because of its apartheid policies at this time. One visit we should mention in particular was his visit to Ethiopia in\n1957\non a United Nations mission to find solutions to the high rate of illiteracy in that country. He also made trips to the United States. For example the Bridgeport Post of\n9\nJuly\n1961\nreports that:-\nMiss Rosemarie Seligmann, of Veterans Park, is on Long Island attending the Workshop in Modern Mathematics with Dr Caleb Gattagno, which covers the Cuisenaire-Gattagno approach to the teaching of algebra and arithmetic.\nIn\n1965\nhe moved from London to the United States. He set up\nEducational Solutions Worldwide Inc\n. in New York in\n1968\n, a company which still exists - see many of the references below. As an example of the dozens of reports of events Gattegno organised in the United States, we quote from the\nTimes Standard\nof\n7\nJune\n1974\n:-\nCrescent City - A \"Words in Color Workshop\" offering one college semester unit in credit is being offered Monday and Tuesday here. The workshop, from\n8\n:\n30\na.m. -\n4\n:\n30\np.m. each day at Pacamo Camp in Del Norte County enables teachers and aides to present the program to students as has been done for five years in a pilot program at Joe Hamilton School. ... Developed by the linguist Dr Caleb Cattegno, the method is based on color-coding the sounds of a language and can even be successful with color-blind students.\nThe number of books that Caleb Gattegno wrote is truly amazing. It is certainly true that most are short and he also utilised material from papers that he wrote but, nevertheless, the number and range is quite remarkable. We give a small sample of the books that Gattegno wrote with some extracts from Prefaces and some reviews. The Prefaces are extremely informative in showing Gattegno's views and, in some cases, how events in his life influenced these views, see\nTHIS LINK\n.\nIn\n1980\nCaleb Gattegno addressed a meeting of the Canadian Mathematics Education Study Group, giving the talk\nReflections on Forty Years of Work on Mathematics Teaching\n. It was published in the\nProceedings\nof the meeting. The same talk was republished in\nFor the Learning of Mathematic\ns\n8\n(3)\n(1988)\n,\n41\n-\n42\n. For a version of Gattegno's\n1980\ntalk, see\nTHIS LINK\n.\nTo learn something of Gattegno as a person we quote from\n[\n16\n]\n:-\nWho was Caleb Gattegno? This question is difficult, even impossible to answer  ... we can say that, though he descended from a family of Sephardic Jews, lived in Egypt, once held a Spanish passport, and eventually gained British citizenship, Gattegno bypassed nationality, freed himself of labels and flags, and became a citizen of the world. He was an autodidact, a scientist, an inventor, a teacher, and a student of human learning. He not only was an educator of international proportions who created a number of important, innovative techniques for the teaching and learning of languages and mathematics but also made seminal contributions to understanding the learning process, at all ages. He published\n[\naround\n120]\nbooks and\n[\nover\n500]\nother writings on his epistemological, psychological, and pedagogical research, including his theories concerning the teaching of mathematics, reading, writing, and languages. He believed in and respected the powers that every person possesses for learning any discipline.\nIn July\n1988\n, although seriously ill, he conducted a seminar\nLe mystère de la communication\nⓉ\n(\nThe mystery of communication\n)\nnear Grenoble in France. After the seminar he went to Paris where he died of cancer in the Clinique Geoffroy Saint-Hilaire at the age of\n76\n.\nLet us end with this tribute from\n[\n6\n]\n:-\nDr Caleb Gattegno believed that all human beings are inherently gifted with virtually limitless powers of self-learning. Awareness and command of those powers are fundamental to our self-fulfilment, more so than any particular thing we can learn. For people to remain in control of their learning powers, Gattegno saw the need to radically transform education.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}