{
  "nome_completo": "Carl Benjamin Boyer",
  "nome_curto": "Carl Boyer",
  "ano_nascimento": "1906",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boyer/",
  "lugar_nascimento": "Hellertown, Pennsylvania, USA",
  "lugar_morte": "Brooklyn, New York City, New York, USA",
  "biografia": "Carl Boyer\n's parents were Howard Franklin Boyer\n(\nborn\n17\nFebruary\n1873\nin Springtown, Pennsylvania, died\n23\nAugust\n1925\nin Durham, Pennsylvania\n)\nand Rebecca Catherine Eisenhart\n(\nborn\n6\nDecember\n1877\nin Bingen, Pennsylvania, died\n14\nOctober\n1962\nin Durham, Pennsylvania\n)\n. Howard Boyer was a topographer and engineer who married Rebecca who came from a family of farmers. Howard and Rebecca had three children, Carl having an older sister Rebecca Eisenhart Boyer\n(11\nOctober\n1903\n-\n16\nAugust\n1998)\nand a younger brother Gilbert Eisenhart Boyer\n(28\nJune\n1908\n-\n28\nDecember\n1990)\n. Charles Gillispie writes\n[\n9\n]\n:-\nIt must be clear to anyone who knows the Pennsylvania German country, and who knew him, that Carl exemplified the firmest and most self-disciplined of its qualities throughout his career and in every aspect of his life.\nAlthough born in Hellertown, Carl was brought up in New York. He attended Newtown High School, Elmhurst, New York, graduating in\n1924\n. In his final year at High School, Boyer was ranked first in his class and won a Pulitzer scholarship which paid his tuition fees at Columbia College. At university, he worked to earn money to cover his living expenses which were not covered by the scholarship. He graduated from Columbia College in\n1928\n, gaining an A.B. with honours in mathematics\n[\n9\n]\n:-\nHe knew he wanted to be a teacher and in college imagined himself teaching mathematics and physics in a high school somewhere near home.\nWhile an undergraduate at Columbia, Boyer took a course on the history of science given by Frederick Barry\n(1876\n-\n1943)\n. Barry was the first holder of a chair in the History of Science in the United States and taught at Columbia from\n1912\nuntil his death. After the award of his A.B., Boyer became a tutor at the Brooklyn branch of the City College of New York. This College had been founded in the middle of the\n19\nth\ncentury to provide free higher education for students selected entirely on merit. When Boyer began tutoring there it was a men-only College. However in\n1930\nthe Brooklyn branch became the Brooklyn College, a coeducational institution which was municipally funded. While tutoring at Brooklyn, Boyer was also still studying at Columbia College. He was awarded his Master's degree from Columbia University, an M.A., in\n1929\nand was advised by Barry to take a Ph.D. in intellectual history. This he did while he continued teaching at Brooklyn College\n[\n9\n]\n:-\n... when he was still studying in graduate school, he was also teaching fifteen hours per week of daytime classes and nine hours of night school.\nBoyer became an Instructor in mathematics at Brooklyn College in\n1934\n.\nLynn Thorndike\n(1882\n-\n1965)\nhad studied medieval history at Columbia and, after positions at two other universities, he was appointed to Columbia University in\n1924\nas Professor of History. At Columbia he held a seminar 'Studies in intellectual history of the closing medieval and early modern centuries' which Boyer attended and at this seminar he met Marjorie Duncan Nice. She was born in\n1912\n, the daughter of Leonard Blaine Nice, Professor of Physiology at the Chicago Medical School, and Margaret Morse Nice, an ornithologist. Marjorie and Carl were married on\n29\nJune\n1935\n. They had four sons; Hugh\n(\nborn\n6\nFebruary\n1939)\n, Timothy\n(\nborn\n20\nMarch\n1941)\n, Russell\n(\nborn\n19\nMarch\n1944)\nand Kenneth\n(\nborn\n30\nJune\n1948)\n. Marjorie completed her Ph.D. in History at Columbia University in\n1958\n. She was an expert in travel, transportation and bridges in medieval France, publishing books such as\nTravel in Medieval France\n(1958)\n,\nMedieval Suspended Carriages\n(1959)\n,\nand\nMedieval French Bridges: A History\n(1976)\n.\nCharles Gillispie writes in\n[\n9\n]\nabout how Boyer, in studying the history of mathematics, went against the prevailing attitudes at Columbia:-\nA person less calm in self-acceptance might have resented the indifference of the mathematicians at Columbia. I understand from quite other sources that the department then was in an extremely ambitious mood. However that may have been, Carl Boyer never allowed himself to be discouraged, and he proceeded to become his own kind of mathematician. There was not then any doubt - nor has there been subsequently among his students or those who have read his writings - about the professionalism, range, and accuracy of his knowledge of mathematics. His bent was to erudition, however, not innovation. What resolution it required to persevere in a discipline in which all the premium was on the creation of new pieces of mathematics - in which old mathematics was often denatured or patronized as childish can begin to be appreciated only since sociological study has brought home the force and nature of scientific norms of behaviour. Of course, the reality was there before the sociologists analyzed it, but the only indication that Carl ever suffered from this was his advice to one of his four sons, all of whom are in scientific or scholarly life, not to go into mathematics unless confident of his own creativeness.\nIn addition to his work at Brooklyn College, Boyer was a Lecturer in Science at University College, Rutgers University, from\n1935\nto\n1941\n. In\n1939\nhe was awarded his Ph.D. from Columbia University and, in the same year, he published his famous book\nThe Concepts of the Calculus\nwhich was his doctoral thesis. To read an extract from Boyer's Preface and extracts from reviews of this book see\nTHIS LINK\n.\nIn\n1941\nBoyer was promoted to Assistant Professor of Mathematics at Brooklyn College. Following the publication of his book in\n1939\n, Boyer published a number of papers on a wide variety of historical topics. The first of these papers are:\nEarly estimates of the velocity of light\n(1939)\n,\nA vestige of Babylonian influence in thermometry\n(1942)\n,\nCavalieri, limits and discarded infinitesimals\n(1942)\n,\nEarly principles in the calibration of thermometers\n(1942)\n,\nAn early reference to division by zero\n(1943)\n,\nFractional indices, exponents, and powers\n(1943)\n,\nHistory of the measurement of heat\n(1943)\n, and\nPascal's formula for the sums of powers of the integers\n(1943)\n.\nMorris Kline\nwrites\n[\n14\n]\n:-\nRecognition of his remarkable contributions came slowly but steadily. One of the wisest mathematicians of recent times,\nRichard Courant\n, gladly endorsed Carl's initial work by writing a Preface to the second\n(1949)\nedition\n[\nof 'The Concepts of the Calculus'\n]\nand at the same time endorsed Carl's activity with the words, \"Teachers, students, and scholars who really want to comprehend the forces and appearances of science must have some understanding of the present aspect of knowledge as a result of historical evolutions.\"\nThis second edition was only produced with considerable difficulty as Gillispie explains\n[\n9\n]\n:-\n... the Press wanted to break up type immediately, on the grounds that there would be no demand for such a book. But Carl felt confidence in his work and, having already had to subsidize much of the cost of publication, paid for the storage of the type for some months until reviews should appear. The one written for Isis was lost with the issue destroyed in Belgium in\n1940\n, and, with a family to support, he had to consent to dispersal of the type. As we all know, a second edition was demanded in\n1949\nand was introduced by\nRichard Courant\n, and the book has often been reprinted.\nRichard Courant\nwrote in his Foreword to the Second Edition:-\nThe present volume, which fortunately can appear in a second printing, is an important contribution towards clarification of the many steps which led to the development of the concepts of calculus from antiquity to the present day; beyond that, it gives a connected and highly readable account of this fascinating story. The book ought to reach every teacher of mathematics; then it certainly will have a strong influence towards a healthy reform in the teaching of mathematics.\nAt Brooklyn College, Boyer was promoted to Associate Professor in\n1948\nand to full Professor in\n1952\n.\nBoyer played a large role in the History of Science Society. He was on the council in\n1943\n-\n45\n,\n1950\n-\n53\nand vice-president\n1957\n-\n58\n. He served as Secretary of the Metropolitan New York Section of the\nMathematical Association of America\nfrom\n1945\nto\n1947\n, and Vice-president of the American Association for the Advancement of Science\n(1958\n-\n59)\n. He was elected a Corresponding member of International Academy of History of Science in\n1957\n, becoming a full member in\n1961\n. He was a Visiting Professor of mathematics at Yeshiva University\n(1952\n-\n58)\nand Rose Morgan Visiting Professor at the University of Kansas\n(1966\n-\n67)\n.\nWe have already mentioned his book\nThe Concepts of the Calculus\nfirst published in\n1939\nwith a second edition in\n1949\n. It was reprinted as\nThe History of the Calculus and its Conceptual Development\nin\n1959\n. His other books are\nA History of Analytic Geometry\n(1956)\n,\nThe Rainbow: From Myth to Mathematics\n(1959)\nand\nA History of Mathematics\n(1968)\n. This classic History of Mathematics was updated by Uta C Merzbach after Boyer died and\nA History of Mathematics\nby Carl B Boyer and Uta C Merzbach was published in\n1991\n. For extracts of reviews from all these books see\nTHIS LINK\n.\nLet us give some even more brief extracts here from reviews of two of these books. Howard Eves, reviewing\nHistory of Analytic Geometry\n(1956)\n, writes\n[\n7\n]\n:-\nProfessor Boyer has in scholarly fashion sketched the fascinating story of the emergence and development of this important branch of mathematics, filling in many lacunae and correcting many errors perpetrated by early writers and perpetuated by subsequent historians of mathematics.\nJudith Victor Grabiner, reviewing\nA History of Mathematics\n(1968)\n, writes\n[\n10\n]\n:-\nAt last there is a history of mathematics that can be recommended without reservation. Making full and critical use of recent scholarship, Boyer has avoided major errors of fact or interpretation. And unlike several currently popular handbooks, the work is neither too concise nor too elementary. The guiding principle of Boyer's book is that continuity in the development of mathematical ideas is the rule rather than the exception.\nAs to Boyer's personality, we quote from\nMorris Kline\n[\n14\n]\n:-\nThe immediately impressive and bold innovations that one finds in Carl's work lead one to expect an aggressive, assertive personality. But Carl was quiet, unobtrusive, modest, and even self-deprecatory. Closer contact, and I have been fortunate to have had this, reveals that beneath the self-effacement there was the courage, conviction and determination of a man who had seen a serious gap in mathematical research and education and had resolved to fill it despite lack of early recognition and even disinterest from colleagues working in more prestigious areas who deluded themselves that they were carrying the ball for mathematics.\nIn the last years of his life he suffered a painful circulatory affliction. It was intended to dedicate the November\n1976\npart of\nHistoria Mathematica\nto Boyer in celebration of his\n70\nth\nbirthday. Sadly, however, he died suddenly from a heart attack in the April of that year. The November\n1976\npart of\nHistoria Mathematica\nbecame a memorial issue. He had become the book editor for that journal in\n1974\n. His wife Marjorie outlived him by\n33\nyears and died on\n28\nSeptember\n2009\n.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}