{
  "nome_completo": "John Carruthers Beattie",
  "nome_curto": "Carruthers Beattie",
  "ano_nascimento": "1866",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beattie/",
  "lugar_nascimento": "Waterbeck, Dumfriesshire, Scotland",
  "lugar_morte": "Capetown, South Africa",
  "biografia": "Carruthers Beattie\n's father was Thomas Beattie\n(\nborn about\n1830\nin Half Morton, Dumfriesshire Scotland\n)\nwho was a Grocer. His mother was Elspeth Beattie\n(\nborn in St Mungo, Dumfriesshire about\n1834)\n.\nCarruthers Beattie attended St John's Boarding School in Workington for seven years, then spent a year at Moray House in Edinburgh before beginning his university education. He took the Preliminary Examinations of the Educational Institute of Scotland, passing English, History, Geography, Latin, Arithmetic, Algebra, Euclid I II III, Mechanics, Logic, and Natural Philosophy. He was an undergraduate at the University of Edinburgh matriculating in October\n1885\n. He studied Chemistry with Crum Brown, Botany with J B Balfour, Natural Philosophy with\nTait\n, and Mathematics with\nChrystal\n. He then studied Physics at Munich, Vienna, Berlin and Glasgow, having\nLord Kelvin\nas an advisor. He was awarded the degree of D.Sc. from the University of Edinburgh in\n1896\nfor his thesis\nThe Behaviour of Bismuth Plates in a Steady Magnetic Field\n.\nIn\n1897\nBeattie went to South Africa on being appointed Professor of Applied Mathematics and Experimental Physics at the University of Cape Town. He married Elizabeth Paton in\n1898\n. He continued to work for the University of Cape Town for the rest of his career, being made Vice-Chancellor and Principal of the University of Cape Town in\n1917\n. He was knighted in\n1920\n.\nOn\n2\nJuly\n1927\nBeattie was awarded an honorary LL.D. by the University of Edinburgh. The report of the occasion, which Beattie did not attend in person, is as follows:-\nSir John Carruthers Beattie, F.R.S.E.\n, Vice-Chancellor and Principal of the University of Cape Town\n(\nin absentia.\n)\nSir Carruthers Beattie is an alumnus and Doctor of Science of Edinburgh, who went to Cape Town as Professor of Physics thirty years ago, and soon traversed the heart of the African continent in the course of a magnetic survey. The reputation he made for himself as Professor led to his selection as Principal of the University of Cape Town, when that institution, largely his handiwork, was established in\n1918\n. When its new buildings are completed within a year or two, there will be fulfilled the vision of Cecil Rhodes, who dreamt of a great South African University rising on the slopes of Table Mountain, and actually selected and gifted a site in this magnificent situation. This temple of learning will be a lasting memorial both of the great empire-builder who first conceived the idea, and of the Vice-Chancellor whose executive ability and unflagging exertions have brought it into being. Sir Carruthers's great services to the Dominion have been recognised by the Knighthood conferred upon him, and his alma mater is proud to laureate a son whose name is written so large in the academic history of South Africa; her only regret is that distance and pressure of affairs prevent his presence at today's ceremony.\nBeattie was a member of the\nEdinburgh Mathematical Society\n, joining in November\n1891\n. He was also a member of the South African Philosophical Society and was honoured by that Society by being elected President for session\n1905\n-\n6\n.\nJohn Carruthers Beattie was elected to the\nRoyal Society of Edinburgh\non\n1\nMarch\n1897\n, his proposers being\nSir W Thomson\n(\nLord Kelvin\n)\n,\nPeter Guthrie Tait\n, Alexander Crum Brown,\nCargill Gilston Knott\n.\nAn obituary, written by\nLawrence Crawford\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1947\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics"
  ]
}