{
  "nome_completo": "Celia Mary Hoyles",
  "nome_curto": "Celia Hoyles",
  "ano_nascimento": "1946",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hoyles/",
  "lugar_nascimento": "London, England",
  "lugar_morte": null,
  "biografia": "Celia Hoyles\nwas given the name Celia Mary French and only used the name Hoyles after her first marriage. We will, however, use the name Hoyles throughout this biography. Her parents were Harold Gainsford French\n(1914\n-\n2000)\nand Elsie Florence Last\n(\nborn\n1911)\n. Harold and Elsie were married in Romford, Essex, in\n1938\n. Harold was a Corporated Accountant and, in\n1939\n, they were living at\n48\nLower Park Road, Chigwell, Essex. Celia, the youngest of her parents' three daughters, had older sisters Judith S French\n(\nborn\n1941)\nand Jane C French\n(\nborn\n1944)\n.\nIn\n[\n7\n]\nHoyles spoke about her school education at Loughton County High School for Girls which she entered in\n1957\n:-\nI've always enjoyed mathematics at school. I was actually quite a high-achieving student. I did like mathematics. Actually, I rather enjoyed Latin. Maybe that's because it's beautifully logical. I enjoyed the sciences, and also English and history. I'm never very good at foreign languages, but I did study French. But basically, I just was a diligent student who had developed a love for learning and wanting to understand and do well. I had several mathematics teachers and was very fortunate - they were all good although different from each other. I remember, in particular, the mathematics teachers I had, when I did A-level .... One of these teachers who taught me pure mathematics, was very thorough, very caring in explaining, and so she always would make sure that you understood the point of what you were doing as well as just doing it. And I had another teacher who taught me applied mathematics who was similarly caring but had a lot of flair and made things really enjoyable and you could see some of the applications - she was an engineer actually. So I think I was lucky in that I experienced both these sides: a teacher who really emphasised the systematic nature of it all, and one who inspired you with the applications and the wonder of it all.\nCelia French\n(\nas she then was\n)\nand her two sisters were all outstanding tennis players with both Jane and Celia qualifying to play at Junior Wimbledon. Jane and Celia competed in the Aberdare Cup on more than one occasion. Jane was Junior Wimbledon Girl's Champion in\n1962\n. Celia was the school tennis captain in\n1964\nand wrote:-\nThe First VI once again won the Eastern Area of the Aberdare Cup, thus qualifying for a place in the final at Wimbledon. Here they were supported by nearly half the school, but in spite of valiant efforts only came\n2\nnd, losing to Millfield.\nAfter graduating from Loughton County High School in\n1964\n, Hoyles entered the University of Manchester where her main subject was mathematics. She was a highly successful student and graduated in\n1967\nwith a First Class Honours degree in Mathematics. She was awarded the Dalton prize for the best first-class degree in Mathematics. Speaking of her undergraduate years at Manchester she said\n[\n7\n]\n:-\n... my tutor\n[\nwas\n]\nDavid Fowler\n. He was really very good. I think he was just very inspirational and supportive.\nAfter graduating she decided not to continue with her mathematical studies but rather to become a secondary school teacher. She began teaching in London in\n1967\n[\n4\n]\n:-\nShe needed to find a way of combining her love for the subject with her need to communicate. ... So for her, the answer was teaching - in London's East End. \"It made me rethink my mathematics,\" she says. \"You become automated and routine with things like fractions and calculus. When you're teaching, you've got to unpack all that and ask: why do I do it like this?\"\nIn\n1969\nHoyles married Martin Hoyles\n(\nborn\n1940\nin Falmouth, Cornwall\n)\n. Also in\n1969\n, while continuing to teach in London schools, Hoyles began studying for a PGCE\n(\nthe Post Graduate Certificate in Education teaching qualification\n)\nat the University of London. She was awarded the PGCE with distinction in\n1971\nand continued her part-time study for a Master's Degree. In\n1972\nshe was appointed as a Senior Lecturer at the Polytechnic of North London, working on a course to convert teachers of other subjects into mathematics specialists. In\n1973\nshe was awarded an M.Ed. with distinction by the University of London\n[\n7\n]\n:-\nMy master's was about thinking how to engage \"disadvantaged\" students in mathematics, and I looked at different intervention programs. I think it was called \"mathematics for the disadvantaged\" or something like that. You wouldn't call it that now.\nIn\n1975\nshe embarked on research for a Ph.D. working part-time in parallel with her work at the Polytechnic of North London. She was awarded a Ph.D. in\n1980\nfor her thesis\nFactors in school learning - the pupils' view: a study with particular reference to mathematics\n. She said\n[\n7\n]\n:-\n... in my Ph.D. I was investigating students' views of mathematics and how they saw what the subject and subject learning was about, whether they felt that it was important for them, whether they thought it was hard or easy and why etc.\nShe published the results of the research for her thesis in the paper\nThe pupil's view of mathematics learning\n(1982)\n. The paper had the following abstract:-\nThis article reports an exploratory study which set out to examine how\n14\n-year-old pupils perceive good and bad learning experiences in school. In particular, it describes the significant features in learning experiences which were associated with mathematics. Eighty-four pupils were asked, in semi-structured interviews, to tell stories about times when they had felt particularly good or particularly bad when learning. A story consisted of a 'critical' event actually experienced by the pupil and what the pupil had felt at the time. The structure of the interview used and the means by which the qualitative data were analysed are discussed, as well as the main findings of the research.\nHere is a quote from Hoyles' conclusions:-\n... the stories collected in this research did seem to show that pupils were much more concerned with their own role in relation to learning mathematics than learning other subjects. Pupils had strong ideas about what they were capable of doing and what they were capable of understanding in mathematics and their mathematical experiences were dominated by this focus on self and feelings about oneself. There was, however, diversity within the mathematics stories which suggested that pupils differed in the goals they set themselves with regard to mathematics.\nIn\n1984\nHoyles was appointed Professor of Mathematical Education at the Institute of Education, University of London\n(\nnow the Institute of Education, University College London\n)\n. This was a newly established chair and, when appointed, she was the youngest professor in the University of London.\nHoyles co-presented the Yorkshire Television programme 'Fun and Games' for ITV with Johnny Ball beginning in\n1987\n. From\n1988\nshe co-presented the programme with Rob Buckman. In total,\n26\nepisodes in\n4\nseries were shown between\n22\nJuly\n1987\nand\n15\nMay\n1990\n. The following is the Synopsis of the show:-\nStrangely compelling audience participation show based around usually mathematical or spatial puzzles. No real games to speak of but plenty of \"soÂ\nthat's\nÂ how it's done\" moments. Actually saying this, the end of each show would usually involve some sort of two player mathematical challenge and more often than not it would be some sort of dressed up variation on the legendary \"don't take the last matchstick\" game. Remember, always go second and make sure they add up to four!\nHoyles explained in\n[\n4\n]\nthat 'Fun and Games' had:-\n...\n10\nmillion viewers. People recognised her in the street - she even got an upgrade on a long-haul flight. \"The idea - and I'm passionate about it - was to get parents involved in their children's maths. Parents read to their children, so why can't they do maths with them? We wanted to get people talking about maths in the home, and it worked.\"\nIn\n1996\nHoyles married her second husband, Richard Noss. Hoyles and Noss were colleagues who had co-authored many papers from the mid\n1980\ns.\nLet us give a small example of Hoyles' work. She was a member of a panel that presented their work on\nThe Teaching of Proof\nto the International Congress of Mathematicians held in Beijing in\n2002\n. Section\n3\nof that paper, written by Hoyles, was entitled\nThe complexity of learning to prove deductively\n. It begins:-\nDeductive mathematical proof offers human beings the purest form of distinguishing right from wrong; it seems so transparently straightforward - yet it is surprisingly difficult for students. Proof relies on a range of 'habits of mind' - looking for structures and invariants, identifying assumptions, organising logical arguments - each of which, individually, is by no means trivial. Additionally these processes have to be coordinated with visual or empirical evidence and mathematical results and facts, and are influenced by intuition and belief, by perceptions of authority and personal conviction, and by the social norms that regulate what is required to communicate a proof in any particular situation.\nThe failure of traditional geometry teaching in schools stemmed at least partly from a lack of recognition of this complexity underlying proof: the standard practice was simply to present formal deductive proof\n(\noften in a ritualised two-column format\n)\nwithout regard to its function or how it might connect with students' intuitions of what might be a convincing argument: 'deductivity was not taught as reinvention, as Socrates did, but\n[\nthat it\n]\nwas imposed on the learner'. Proving should be part of the problem solving process with students able to mix deduction and experiment, tinker with ideas, shift between representations, conduct thought experiments, sketch and transform diagrams.\nIn\n2002\nHoyles was appointed Dean of Research and Consultancy at the Institute of Education, University College London. She held this position for two years then, in\n2004\n, she was appointed as the Government Chief Adviser for Mathematics, advising the Secretary of State for Education\n[\n11\n]\n:-\nHer time as Chief Adviser for Mathematics to the UK government was pivotal in raising the profile of mathematics within Whitehall, ensuring that rigorous research had a direct impact on policy development.\nDuring her time in this position Hoyles continued in her professorship at University College London as she also did when, in\n2007\n, she was appointed Director of the National Centre for Excellence in Teaching of Mathematics. Her work at the Centre was the main reason for her being made Dame Commander of the Order of the British Empire\n(\nDBE\n)\nin\n2014\n[\n8\n]\n:-\nThe impact of her work as Director of the National Centre for Excellence in Teaching Mathematics is now being demonstrated, with increasing numbers of young people progressing to university to study mathematics and many of the brightest and best entering the teaching profession. Her vision for the Centre has resulted in a highly successful combination of face-to-face regional support with virtual support via a portal, resulting in a tenfold increase in the number of teachers regularly using the portal - well over\n100\n,\n000\ntoday.\nHoyles has received many honours in addition to the DBE she received in\n2014\nwhich followed the OBE she had received in\n2004\n. Also in\n2004\nshe was awarded the\nHans Freudenthal\nMedal for research in mathematics education, by the International Commission on Mathematical Instruction of the\nInternational Mathematical Union\n. The citation states\n[\n1\n]\n:-\nThe first\nHans Freudenthal\nMedal of the International Commission on Mathematical Instruction\n(\nICMI\n)\nis awarded to Professor Celia Hoyles. This distinction recognises the outstanding contribution that Celia Hoyles has made to research in the domain of technology and mathematics education, both in terms of theoretical advances and through the development and piloting of national and international projects in this field, aimed at improving through technology the mathematics education of the general population, from young children to adults in the workplace. ...\nCelia Hoyles belongs to that special breed of mathematics educators who, even while engaging with theoretical questions, do not lose sight of practice; and reciprocally, while engaged in advancing practice, do not forget the lessons they have learned from theory and from empirical research. Celia Hoyles' commitment to the improvement of mathematics education, in her country and beyond, can be felt in every detail of her multi-faceted, diverse professional activity. Her enthusiasm and vision are universally admired by those who have been in direct contact with her. It is thanks to people like Celia Hoyles, with a clear sense of mission and the ability to build bridges between research and practice while contributing to both, that the community of mathematics education has acquired, over the years, a better-defined identity.\nThe\nRoyal Society\npresented Hoyles with their Kavli Education Medal in\n2011\n[\n11\n]\n:-\nDame Nancy Rothwell FRS, chair of the selecting committee for the award, said: \"We are very pleased to be able to make our first award to an individual that has made an invaluable contribution to mathematics education at every stage in her career. Her time as Chief Advisor for Mathematics to the UK government was pivotal in raising the profile of mathematics within Whitehall, ensuring that rigorous research had a direct impact on policy development. At a time when a good mathematics education system is vital to our country's future economic competitiveness, her continued contributions are very highly appreciated.\"\nCommenting on her award, Professor Hoyles said: \"I have loved mathematics all my life and have worked to foster this love and engagement in others through my research and practice. As an educator rather than a practicing mathematical researcher, the award of a medal by the Royal Society is something I would not have dreamed possible. I am of course delighted, honoured and not a little daunted.\nI am sure that the establishment of the\nRoyal Society\nKavli Education Medal in the field of Science and Mathematics Education will enhance still further the status of these two domains in this country; and I hope that my work plays some part in furthering this goal.\"\nIn addition to these honours, she had held many honorary positions: Member, Council for National Academic Awards\n(1979\n-\n84)\n; Member, International Committee of the International Group for the Psychology of Mathematics Education\n(1983\n-\n87)\n; President, British Society for Research into Learning Mathematics\n(1984\n-\n86)\n; Member, Economic and Social Research Council Research Grants Board\n(1994\n-\n99)\n; Chair, Joint Mathematical Council of the United KingdomÂ Â\n(1999\n-\n03)\n; Founding Member, Advisory Committee on Mathematics Education\n(2002\n-\n04)\n; Member, Executive Committee of the International Commission on Mathematical Instruction\n(2006\n-\n09)\n; Member,\nEuropean Mathematical Society\n, Committee for Mathematics Education\n(2008\n-\n16)\n; President, Mathematics Section of the British Science Association\n(2013)\n; President, the\nInstitute of Mathematics and its Applications\n(2014\n-\n15)\n; Member, Advisory Board for the new Interactive Gallery, Science Museum\n(2014)\n; and Member, Advisory Board for the new Mathematics Gallery, Science Museum\n(2014)\n.\nThe Mathematics Gallery at the Science Museum opened in December\n2016\nand, in conjunction with its opening, the book\nMathematics: How It Shaped Our World\nwas published. Hoyles, jointly with Helen Wilson, wrote the chapter\nMathematics: a living, changing landscape\n[\n6\n]\n:-\nThe chapter highlights the step change in mathematics and explains how information technology, computers and the internet are now integral to the system, rather than tools.\nDame Celia said: \"There is a general perception of maths as being something that is hard, boring and irrelevant. Our chapter argues that mathematics is powerful, intriguing, beautiful and useful. We show the ways in which mathematicians experiment and how mathematics is changing. To have a maths gallery in the prestigious Science Museum is genuinely exciting. On the Advisory Committee, I emphasised the importance of mathematics underpinning the objects in the museum, and that we should make this as visible as possible. From the moment you walk in, the magnificent Zaha Hadid architecture and the objects on show could lead to a seismic shift in the way people perceive maths.\"\nFinally, we note that Hoyles was awarded honorary degrees: The Open University\n(2006)\n; Loughborough University\n(2008)\n; and Sheffield Hallam University\n(2011)\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}