{
  "nome_completo": "Charles Matthew Whish",
  "nome_curto": "Charles Whish",
  "ano_nascimento": "1795",
  "ano_morte": "1833",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whish/",
  "lugar_nascimento": "Marylebone, London, England",
  "lugar_morte": "Cuddapah, India",
  "biografia": "Charles Whish\n's parents were Martin Whish\n(1743\n-\n1826)\n, a Commissioner of Excise, and Harriett Tyssen\n(1765\n-\n1841)\nof Park Street, Grosvenor Square. Martin Whish was married three times and Harriett Tyssen was his third wife whom he married in June\n1786\n. Martin Whish had\n18\nchildren and\n15\nof these\n18\nchildren were with Harriett. These\n15\nwere born between\n1787\nand\n1806\n. Of these\n15\nchildren,\n7\nwere older than Charles Matthew, the subject of this biography, and\n7\nwere younger.\nCharles Whish studied at the East India College at Hertford, north of London. This College, founded in\n1806\n, trained administrators for the Honourable East India Company. The College taught mathematics and natural philosophy, with William Dealtry\n(1775\n-\n1847)\nand Bewick Bridge\n(1767\n-\n1833)\nbeing the professors of mathematics at the time when Whish studied there. The College also had a strong team teaching Arabic, Persian and various Indian languages. A third important topic taught at the College was law and since Whish had a legal career in India we must assume that he also studied law at the College at Hertford. In\n1810\nWhish passed the College examinations 'with credit'. In his second term he won prizes in Persian and Hindustani awarded by the College Council at a prize giving held on\n30\nMay\n1811\n.\nThe College of Fort St George was founded in\n1812\nin Madras,\n(\nnow Chennai\n)\nIndia. Its purpose was to train British men, who had recently arrived in India, in the local languages. Whish arrived at the College in\n1812\nwhen he was register to the Zillah Court of south Malabar. During his career in India, he wrote a Malayalam grammar and dictionary that were published by the College of Fort St George.\nWe have given some evidence to show that Whish was a skilled linguist but so far we have given little evidence that he would make a major contribution to mathematics. But he did make a major contribution with a single paper in which he showed that the Indians had developed powerful mathematical techniques long before the Europeans made similar advances. Now our story involves, in addition to Whish, two others in the Honourable East India Company, namely John Warren\n(1769\n-\n1830)\nand George Hyne. The East India Company was interested in understanding local calendars and the methods used by the Hindus in constructing them. Warren seems to have been assigned such a task by the Company but the other two were also interested and became involved in the work. Whish discovered that certain Hindu texts contained approximations to π which had been found using series expansions. The question then arose as to whether the Hindus had developed these methods themselves or whether they had learnt them from Europeans.\nWhish sent an early version of a paper he had written on this topic to the Madras Literary Society some time before\n1825\n. The pre-\n1825\npaper was discussed by Whish, John Warren and George Hyne. These discussions showed the reaction of others at the time to the suggestion that the Hindu had developed powerful mathematical techniques. For example Hyne wrote\n[\n14\n]\n:-\n... the Hindus never invented the series; it was communicated with many others, by Europeans, to some learned Natives in modern times ... the pretensions of the Hindus to such a knowledge of geometry, is too ridiculous to deserve attention.\nIt is worth noting that Warren and Hyne were considerably senior to Whish who, in\n1825\n, was only\n30\n. Warren, for instance, was\n56\nyears old. It must have taken a lot of courage from Whish to persevere with his work in the face of comments of this type from his older colleagues. Although Whish believed at first that these series had been found by the Hindus, his two colleagues made him change his opinion. The following written by Warren shows this\n[\n14\n]\n:-\n... in Mr Hyne's opinion the Hindus never invented the series referring in the Quadrature of the Circle which were found in their possession in various parts of India; and that Mr Whish, from whom he had obtained some of those which were communicated to the Madras Literary Society, after having first expressed a belief that they were indigenous, had subsequently reasons for thinking them entirely modern, and derived from the Europeans; observing that not one of the Jyautish Sastras who used these Rules, were capable of demonstrating them.\nSo at this stage Whish, Warren and Hyne believed that the series must have been communicated to the Hindus by Europeans because the Hindus who told them about the series were not able to prove that the results were correct. Whish had been convinced by his older colleagues to change his view and believe that the series had been given to the Hindus by Europeans, but he reverted to his earlier opinion when he discovered proofs of the results in the\nYuktibhasa\n. He published a now famous paper\nOn the Hindú Quadrature of the Circle, and the Infinite Series of the Proportion of the Circumference to the Diameter Exhibited in the Four Sástras, the Tantra Sangraham, Yucti Bháshá, Carana Padhati, and Sadratnamála\nwhich was published in the\nTransactions of the Royal Asiatic Society of Great Britain and Ireland\nin\n1834\n. Whish writes in his paper about the results in the\nTantra Sangraham\n, the\nCarana Padhati\n, and the\nSadratnamála\n:-\nThe approximations to the true value of the circumference with a given diameter, exhibited in these three works, are so wonderfully correct, that European mathematicians, who seek for such proportion in the doctrine of fluxions, or in the more tedious continual bisection of an arc, will wonder by what means the Hindu has been able to extend the proportion to so great a length. Some quotations which I shall make from these three books, will show that a system of fluxions peculiar to their authors alone among Hindus, has been followed by them in establishing their quadratures of the circle; and a few more verses, which I shall hereafter treat of and explain, will prove, that by the same mode also, the sines, cosines, etc. are found with the greatest accuracy. ... Having thus submitted to the inspection of the curious eight different infinite series, extracted from Bráhmanical works for the quadrature of the circle, it will be proper to explain by what steps the Hindu mathematician has been led to these forms, which have only been made known to Europeans, through the method of fluxions, the invention of the illustrious\nNewton\n. ... it is a fact which I have ascertained beyond a doubt, that the invention of infinite series of these forms has originated in Malabar, and is not, even to this day, known to the eastward of the range of Gháts which divides that country, called in the earliest times Céralam, from the countries of Madura, Coimbatore, Mysore, and those in succession, to that northward of these provinces.\nHe also writes in his\n1834\npaper:-\nA further account of the Yuktibhasa, the demonstrations of the rules for the quadrature of the circle by infinite series, with the series for the sines, cosines, and their demonstrations, will be given in a separate paper.\nWhish never had the opportunity to write that paper since he died in\n1833\n, before his important work was published.\nWe noted above that Whish started his career as register to the Zillah Court of south Malabar. He continued to higher positions until he became a Criminal Judge in Cuddapah. He died at the age of\n38\nin Cuddapah and was buried in Cuddapah Town Cemetery where his tomb can still be found today with the engraving:-\nSacred to the memory of C M Whish, Esquire of the Civil Service, who departed this life on the\n14\nth\nApril\n1833\n, aged\n38\nyears.\nAlthough we have reached the end of Whish's life, we are only at the beginning of the story of his remarkable paper. Whish's paper was not completely forgotten over the following\n100\nyears - it would be more fair to say that it was largely ignored. The first paper that really carried on Whish's work was the\n1944\npaper\n[\n8\n]\n. This paper by K Mukunda Marar and C T Rajagopal begins:-\nThis paper is a sequel to an article bearing the same title contributed more that a hundred years ago in the Transactions of the Royal Asiatic Society of Great Britain and Ireland, by Charles M Whish of the Hon. East India Company's Civil Service in the Madras Establishment. The article of Whish has come to be accepted as one of our chief sources of information concerning Hindu achievements in \"circle squaring\", but the questions it raises with regard to the date of these achievements have still to be answered. ...\nIt would be fair to say that\nCadambathur Tiruvenkatacharlu Rajagopal\n(1903\n-\n1978)\nwas the first person to continue Whish's work.\nRajagopal\nwrites in\n1949\nin\n[\n10\n]\n:-\nA little over a century has elapsed since the first attempt was made to mark on the map of modern scholarship this virgin continent\n[\nHindu mathematics\n]\n. The person who sighted the unknown coast was, by an odd trick of time, an English civilian of the Hon East India Company, Charles M Whish by name. Whish's paper carrying the abbreviated title \"On the Hindu Quadrature of the Circle\", submitted to the 'Royal Asiatic Society of Great Britain and Ireland' on\n15\nth\nDecember\n1832\n, did not advertise his importance as the discoverer of a strange hinterland. There was little in the title of the paper to assure its readers that the material offered to them had with difficulty drawn from that stock of mixed mathematics which the children of Kerala had till then looked upon as its exclusive property; there was nothing in it which suggested that the author had overcome the exclusivism of the Keraliyas with the help of their pundits and princes - a help by no means easy to secure then, for, as we know today, the companions of our author in the civil service of the Hon East India Company were \"fortune-hunting adventurers lost to all sense of public morality\" who did much to alienate the sympathies of the natives.\nHere is a\n21\nst  Century view given by M Ram Murty\n[\n13\n]\n:-\nEarlier, due to scanty historical research, we had the impression that the Indian discoveries were sporadic and isolated. But the findings of the work of\nMadhava\nand his school changes all that. It seems that these findings first came to light in\n1834\nwhen Charles Whish published a paper in the 'Transactions of the Royal Asiatic Society' entitled \"On the Hindu quadrature of the circle and the infinite series of the proportion of the circumference to the diameter exhibited in the four sastras, the Tantrasangraham, Yukti Bhasha, Caruna Paddhati, and Sadratnamala\". However, these findings did not seem to make it to the history books, largely because many did not read the Royal Asiatic Society Journal and partly because there was a European bias that fundamental notions of calculus could not have been discovered by an Indian. ... Moreover, Whish's paper appears at the height of colonial rule and consistent with the phenomenon of \"orientalism\"\n(\nas noted by the historian Edward Said\n)\n, any contribution from a \"subject nation\" was deliberately ignored or undervalued. This applied equally to contributions from Africa or other Asiatic nations.\nHere is another modern opinion from David Pingree in\n[\n9\n]\n:-\nOne example I can give you relates to the Indian\nMadhava\n's demonstration, in about\n1400\nA.D., of the infinite power series of trigonometrical functions using geometrical and algebraic arguments. When this was first described in English by Charles Matthew Whish, in the\n1830\ns, it was heralded as the Indians' discovery of the calculus. This claim and\nMadhava\n's achievements were ignored by Western historians, presumably at first because they could not admit that an Indian discovered the calculus, but later because no one read anymore the 'Transactions of the Royal Asiatic Society', in which Whish's article was published. The matter resurfaced in the\n1950\ns, and now we have the Sanskrit texts properly edited, and we understand the clever way that\nMadhava\nderived the series without the calculus; but many historians still find it impossible to conceive of the problem and its solution in terms of anything other than the calculus and proclaim that the calculus is what\nMadhava\nfound. In this case the elegance and brilliance of\nMadhava\n's mathematics are being distorted as they are buried under the current mathematical solution to a problem to which he discovered an alternate and powerful solution.\nIt is extremely difficult to stand up and argue for something which the rest of the world thinks, in Hyne's words, is \"too ridiculous to deserve attention\". It requires great courage to argue for something that you know people will ridicule you for saying. I\n[\nEFR\n]\nthink Whish was one of the first Europeans to question the Eurocentric view of the world in general and in mathematics in particular. This was a first step in a process that still has not been completed. If it has not been completely achieved in nearly\n200\nyears, we get some idea of how significant it was that Whish started the process. Another point worth making here is that the British treated the \"Natives\" in India badly - they considered themselves the masters of the ignorant Hindus. Naturally the Hindus reacted to this attitude as one would expect, with distrust and dislike of their British masters. We make this point to emphasise how remarkable it was that Whish was able to gain the trust and help of the local Hindu. He must have been quite a remarkable man in so many different ways.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}