{
  "nome_completo": "Cheryl Elisabeth Praeger",
  "nome_curto": "Cheryl Praeger",
  "ano_nascimento": "1948",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Praeger/",
  "lugar_nascimento": "Toowoomba, Queensland, Australia",
  "lugar_morte": null,
  "biografia": "Cheryl Praeger\n's parents, Eric Noel Praeger and Queenie Hannah Elizabeth Praeger, were both from a poor background and, having to leave school to earn their living, had no chance of participating in higher education. Both Cheryl's parents, however, encouraged their children to educational achievements. Cheryl's mother always had an ambition that her children would be able to benefit from a university education. When Cheryl was born her father was working for the Commercial Bank of Australia and this led to the family moving from one town to another as Cheryl was growing up. In an interview with\nBernhard Neumann\nin\n1999\n, Cheryl said\n[\n4\n]\n:-\nWe lived on the Darling Downs -- in Toowoomba, where I was born, and then Warwick. I was about to start school in Warwick when he was transferred to Margate, on Moreton Bay just north of Brisbane, so I began school there at Humpybong State School -- a wonderful name. After four years we moved again, to Nambour, about\n60\nmiles north of Brisbane. By that stage Dad was an accountant in the bank. He underwent manager training and expected to be moved as manager of a branch somewhere, but I think the new manager in Nambour wanted him to stay longer to help him settle in.\nAfter one year at high school in Nambour, Cheryl's family moved again, this time to Brisbane, because her father had changed career and wanted to open an office there as a chiropractor. In Brisbane she attended the Brisbane Girls Grammar School as a day pupil for three years. By this time she knew that she wanted to study mathematics, but it might have been music as she explained\n[\n4\n]\n:-\nMy mother's youngest brother, Uncle Darcy, played the organ at a central Brisbane Baptist Church that we went to whenever we visited my Grandma. I could see him up in the organ loft at the front of the church, and I think I always wanted to play the piano. So my mother put away the money that the government used to give mothers in those days -- it was to buy us milk, I think -- and when I was eight years old she was able to buy a piano and I could begin to learn to play it. ...  I thought about taking up music seriously, but at age\n11\n-- because of a certain amount of disobedience -- I had an accident in a pool and dislocated my finger and fractured it in a couple of places. It took two years of very serious physiotherapy for me to get it strong enough and straight enough to be able to play the piano again. So it was my ambition to play the piano but I certainly couldn't have taken it up professionally.\nAfter leaving school Praeger enrolled in the University of Queensland and completed her four year B.Sc. degree in\n1969\n. Her honours courses were entirely mathematics, but in her first two years of study she also took courses in physics. Between her third and fourth years Praeger spent eight weeks at the Australian National University. She had been awarded a scholarship to enable her to work there, obtaining her first experience of research in mathematics.\nBernhard Neumann\nsuggested a problem to her which she solved and so published her first paper\nNote on a functional equation\nwhile still an undergraduate. It was her first taste of research and\n[\n4\n]\n:-\nIt was a great thrill.\nPraeger had studied the functional equation\nx\n(\nn\n+\n1\n)\n−\nx\n(\nn\n)\n=\nx\n2\n(\nn\n)\nx(n+1) - x(n) = x^{2}(n)\nx\n(\nn\n+\n1\n)\n−\nx\n(\nn\n)\n=\nx\n2\n(\nn\n)\n, where\nx\n2\n(\nn\n)\n=\nx\n(\nx\n(\nn\n)\n)\nx^{2}(n) = x(x(n))\nx\n2\n(\nn\n)\n=\nx\n(\nx\n(\nn\n)\n)\nand\nx\nx\nx\nis an integer-valued function of the integer variable\nn\nn\nn\n, and found a three-parameter family of solutions.\nAfter completing her undergraduate course Praeger was offered a scholarship to undertake research at the Australian National University but she was also offered a Commonwealth Scholarship to study at the University of Oxford in England. She chose the latter. At Oxford, Praeger was in St Anne's College and assigned\nPeter Neumann\n(\nson of\nBernhard Neumann\nand\nHanna Neumann\n)\nas a supervisor for her research. She was awarded an M.Sc. in\n1972\nand then her doctorate in\n1974\nfor her thesis\nFinite Permutation Groups\n. In fact she finished her doctorate in\n1973\nand returned to Australia in that year before being awarded her doctorate in the following year 'in absentia'. Her first paper on group theory\nSylow subgroups of transitive permutation groups\nappeared in print in\n1973\nBack in Australia, Praeger was appointed to a three year postdoctoral fellowship at the Australian National University\n(\nANU\n)\nbut spent one semester at the University of Virginia in the United States. She attended the Second International Conference on the Theory of Groups at ANU in\n1973\ngiving a talk on\nSylow subgroups of finite permutation groups\nwhich was published in the Proceedings of the Conference. A series of three papers on a similar topic\nOn the Sylow subgroups of a doubly transitive permutation group\nappeared in\n1974\nand\n1975\n. At ANU Praeger lived at University House and there she met a statistics research student John Henstridge. They were married in August\n1975\n. In early\n1976\nthey moved to the University of Western Australia in Perth where Praeger had been offered a temporary two-year position and her husband was offered a one year tutorship which would allow him to complete his doctorate. They lived in St George's College, the oldest college at the University. Before the end of her contract, Praeger was offered a permanent post by the University of Western Australia which she chose in preference to a three-year lectureship she had been offered at the University of Melbourne\n[\n4\n]\n:-\nIn\n1978\nwe moved from the college to a small unit, and our first child, James, was born in '\n79\n. Then our second son, Timothy, came in\n1982\nand we moved again -- the unit was just a bit small for us. We couldn't close the door because of the cot. Our house now is lovely ...\nIn fact Praeger wrote one joint paper with her husband,\nNote on primitive permutation groups and a Diophantine equation\n, which was published by the journal\nDiscrete Mathematics\nin\n1980\n. In\n1982\nPraeger was promoted to Senior Lecturer, then to Professor of Mathematics less than a year later.\nPraeger has one of the most stunning publication records of any mathematician. Up to the time of writing this biography in September\n2006\nover\n250\npapers had appeared in print. This vast publication record makes it impossible to even give an overview of all the topics she has studied but we should remark on just a few to at least give a flavour of her remarkable contributions. We have already noted that her doctoral work was on permutation groups and her early papers were on this topic. Later this interest broadened to a more general study of group actions. From there she became interested in the structure of the objects on which the groups acted, so she moved into the theory of combinatorial designs. But this interest in designs also took another form\n[\n4\n]\n:-\nI also became involved in designs used for experimental layouts for agricultural experiments that statisticians would analyse - to help statisticians to understand what symmetry groups were involved in the particular experimental designs which they were interested in.\nExamples of papers in which Praeger looked at groups acting on structures are\nSymmetric graphs and a characterization of the odd graphs\n(1980)\nwhich investigates graphs with large groups of automorphisms. In\nEnumeration of rooted trees with a height distribution\n(1985)\nwritten jointly with P Schultz and N C Wormald, the authors used generating functions to find a new solution to the problem of determining the number of rooted trees whose vertices have a given height distribution.\nAnother topic to which Praeger had made major contributions is Computational Group Theory. She moved into this topic through first wanting to introduce computers into undergraduate teaching, then realising that having a research student in this area would help her develop an appreciation of computing. Having organised a workshop given by experts in computational group theory so that members of her research team at the University of Western Australia could gain expertise, she was told of areas which needed improvement. After making a strong contribution to solving these problems, she was invited to the Computational Group Theory meeting in Oberwolfach, Germany, in\n1988\n.\nJoachim Neubüser\n, at that time the leader of the team developing the computing system GAP\n(\nGroups, Algorithms, and Programming\n)\n, suggested at that meeting that an important area to develop would be finding algorithms to recognise matrix groups analogous to those which had already been invented for permutation groups. Praeger was immediately interested and she began an important line of research which has made major contributions to Computational Group Theory.\nOne of Praeger's most popular lecture topics at a lower level is on mathematics and weaving. She has published three papers on the topic:\nMathematics and weaving\n(1986)\n;\nMathematics and weaving.\nI\n. Fabrics and how they hang together\n(1987)\n; and\nMathematics and weaving.\nII\n. Setting up the loom and factorizing matrices\n(1988)\n.\nPraeger has received many honours for her mathematical contributions. For example she was President of the\nAustralian Mathematical Society\nduring\n1992\n-\n94\n, elected a fellow of the\nAustralian Academy of Science\nin\n1996\n, and made a Member of the Order of Australia in\n1999\n.\nIn\n2003\nshe was awarded the Centenary Medal of the Australian Government for services to Mathematics. In the following year she was selected for being in the top\n1\n% of most highly cited research mathematicians worldwide, having published more than\n250\nresearch articles and\n3\nbooks. In\n2005\nthe Université Libre de Bruxelles, Belgium, awarded her an honorary mathematics doctorate. She was given an honorary degree by the University of St Andrews in November\n2015\n.\nYou can see a a copy of the laureation address and her reply to it at\nTHIS LINK\nWe have mentioned above some of Praeger's popular mathematics lectures. Let us give a recent example of a talk she gave on Tuesday\n13\nMay\n2008\nto the 'Friends of the University Library' at the University of Western Australia. The talk was entitled\nWhat makes a \"good\"  mathematician?\nand her abstract reads:-\nJust about every part of modern society is underpinned by mathematical technology, and the only way to benefit from and manage the information/data explosion is by building smarter mathematics. But how smart are mathematicians? How can we measure what makes a mathematician \"good\"?\nFinally let us note that among her hobbies are hiking, cycling, spinning wool, and sailing.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Number Theory",
    "Statistics"
  ]
}