{
  "nome_completo": "Choi Seok-jeong",
  "nome_curto": "Choi Seok-jeong",
  "ano_nascimento": "1646",
  "ano_morte": "1715",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Choi_Seok-jeong/",
  "lugar_nascimento": "Chopyeong-myeon, Jincheon-gun, South Korea",
  "lugar_morte": "Chopyeong-myeon, Jincheon-gun, South Korea",
  "biografia": "Choi Seok-jeong\n's father was Choi Choi-ryang, and his mother was An Hunjing. It was a family of scholars, diplomats and politicians in the Joseon Dynasty of Korea. The Joseon Dynasty ruled Korea for five hundred years from around\n1400\nto\n1900\n.\nChoi Seok-jeong's grandfather Choi Myeong-gil\n(1586\n-\n1647)\nwas a neo-Confucian scholar who held several important posts in the government. This was a very difficult time in Korea since the Chinese Qing invasion of Joseon in the winter of\n1636\nled to the Joseon becoming completely defeated and left the Chinese Qing Dynasty in control. At this time Choi Myeong-gil was Jwauijeong, the Second State Councillor of the Uijeongbu\n(\nState Council\n)\n, and he went to Shenyang in China in\n1637\nto negotiate the release and repatriation of Korean prisoners of war. In\n1643\nhe was imprisoned in Shenyang and detained for two years. After his death, he was severely criticised by neo-Confucian rationalists for insisting on reconciliation and compromise. He died when Choi Seok-jeong, the subject of this biography, was one year old. The consequences of the war with the Qing were, however, far reaching and when Choi Seok-jeong became a leading politician he had to concentrate on the Joseon's recovery.\nChoi Seok-jeong had a younger brother Choi Seok-hang\n(1654\n-\n1724)\nwho also became an important politician. He was described as follows:-\nAlthough he was small and shabby in appearance, he was accurate in his judgment and received a reputation as one of the best among the politicians.\nBy the age of\n9\n, Choi Seok-jeong had already memorised the\nBook of Songs\n, a Chinese Confucian classic collection of poems, and\nThe Book of Records\n, a history chronicle. By the age of\n12\n, he had reached the level of being able to understand the\nZhou Yi\n, the ancient Chinese divination text whose name is often translated as 'Book of Changes' or 'Classic of Changes'. This was a remarkable achievement and he was widely considered as a child prodigy. He also studied the writings of Park Se-chae\n(1631\n-\n1695)\n, the author of many texts.\nAt the age of\n17\n, he began his career as a civil servant and, in\n1671\nhe took the examination which saw the start of his political career\n[\n3\n]\n:-\nAs a professional bureaucrat, he did not cling to his cause but he took care of the people's difficulties, tried to reform political evils, and tried to reduce the anger caused by conflict in his political party.\nTogether with Yun Jeung and Nam Gu-man, Choi Seok-jeon led the political party known as the Soron. It was a period of great political instability with disagreements leading to political parties splitting up and new parties forming. The Soron, meaning 'young learning', had formed when the Westerners political party split in\n1683\n. Choi Seok-jeo served in many capacities, for example in\n1699\nwhen Sukjong was King, he was Jwauijeong, the Second State Councillor of the Uijeongbu\n(\nState Council\n)\n. He served as Yeonguijeong, the Chief State Councillor of the Uijeongbu\n(\nState Council\n)\n, in\n1701\n,\n1702\n-\n03\nand\n1705\n-\n10\n. This role would best be described as equivalent to that of a modern prime minister. As a leading political figure, he had his portrait painted. It is the one displayed beside this biography\n[\n10\n]\n:-\nIn this portrait, Choi Seok-jeong is depicted wearing a green, round-collared official robe and a black satin hat, sitting in a chair covered with leopard fur, with his hands held together inside the sleeves of his robe. His feet, encased in black leather shoes, rest upon a footstool which is, in turn, placed upon a woven rush mat with a floral design. The chest of his robe bears a large square rank badge embroidered with twin cranes, while the exclusive rhinoceros horn belt worn around his waist symbolises his status as an official of the Major First Rank. The artist used outlining and shading techniques originating from Western art to create a more three-dimensional effect in his depiction of the sitter's face. The painting is regarded as a rare and important example of the official portraits of the early eighteenth century, which tended to be more natural in terms of their execution when compared with portraits of meritorious subjects from the seventeenth century, whose subjects tended to be expressed with greater volume and rigidness of posture.\nHe made many visits to China and learned of the advances in science and technology through Western contacts. This led to him being keen to promote the use of books such as the\nTongwen Suanzhi\nin Korea. This book was a Chinese text based on the writings of\nChristopher Clavius\nand\nMichael Stifel\nas transmitted to China by\nMatteo Ricci\n.\nThere is much more that could be said of the political career of such an important politician at a fascinating period in Korean history, but since this site is concerned with the history of mathematics, we must turn to Choi Seok-jeong's mathematical contributions. We learn a little of his mathematical work through letters he wrote to Lee Segu\n(1646\n-\n1700)\n[\n9\n]\n:-\nChoi Seok-jeong and Lee Segu studied Western calendars and mathematics together around\n1683\n, and in addition to direct exchanges, they continued to exchange letters and discuss academic issues. There are\n24\nletters written by Choi Seok-jeong to Lee Segu on arithmetic, astronomy, and calendars which reflect their research together.\nBefore looking at some of Choi Seok-jeong's major mathematical contributions, let us explain what Latin squares are, what orthogonal Latin squares are, and how magic squares are made from pairs of orthogonal Latin squares.\nA Latin square is an arrangement of\nn\nn\nn\nsymbols in\nn\n2\nn^{2}\nn\n2\ncells arranged in\nn\nn\nn\nrows and\nn\nn\nn\ncolumns such that each symbol occurs once in each row and in each column. Such a Latin square is said to be of order\nn\nn\nn\n. If two Latin squares of the same order\nn\nn\nn\nare superimposed on one another and if each pair of symbols in the resultant array occurs only once they are called orthogonal Latin squares. A square\nn\n×\nn\nn \\times  n\nn\n×\nn\narray of the integers\n1\n,\n2\n,\n.\n.\n.\n,\nn\n2\n1, 2, ..., n^{2}\n1\n,\n2\n,\n.\n.\n.\n,\nn\n2\nis called a magic square if the sums of the numbers in each row, each column, and both main diagonals are the same. This sum will be\n1\n2\nn\n(\nn\n2\n+\n1\n)\n\\large\\frac{1}{2}\\normalsize n(n^{2}+1)\n2\n1\n​\nn\n(\nn\n2\n+\n1\n)\n. To obtain a magic square from two orthogonal Latin squares, replace each pair\n(\nx\n,\ny\n)\n(x, y)\n(\nx\n,\ny\n)\nin the superimposed orthogonal Latin squares by\nn\n(\nx\n−\n1\n)\n+\ny\nn(x-1) + y\nn\n(\nx\n−\n1\n)\n+\ny\n.\nMagic squares have been known since\n650\nBC, and in all probability, from much earlier than that. Although Latin squares were certainly known in the\n12\nth century, for  long time it was thought that the idea of orthogonal Latin squares was first introduced by\nEuler\nin\n1782\n. This, however, is not the case since an example of two orthogonal Latin squares of order\n9\nappear in the book \"Gusuryak\" written by Choi Seok-jeong. Sangwook Ree explains in\n[\n13\n]\nthat Choi Seok-jeong:-\n... wrote a mathematical book titled \"Gusuryak\" in\n1715\n-\n1718\n. Joseon had begun to be introduced to Western culture in about that time. He had certainly read the book \"Cheonhakchoham,\" which introduced Koreans to the Western world, but his academic knowledge was based on Confucianism. In his book  \"Gusuryak,\" he was trying to understand mathematics on the basis of the ancient Asian philosophy of I Ching. In that philosophy, all things in the universe originate from yin and yang in dynamic balance, a theory called taegeuk, from which four symbols, the sasang, emerge. This idea conveys a sense of change in the universe. The taegeuk and the sasang are both elements of the national flag of Korea. Asian traditional mathematics was based on the \"Nine Chapters on the Mathematical Art.\" Choi classified mathematical operations, problems and all nine chapters into four classes, represented by the four sasang symbols. Trying to understand mathematics and patterns with those four symbols, he produced a remarkable study of magic squares and related topics, in particular an orthogonal Latin square of order\n9\n. This is an accomplishment predating\nEuler\n's work by more than\n60\nyears.\nHere is a picture of the orthogonal Latin squares of order\n9\nas they appear in the \"Gusuryak\":\nHere is Choi Seok-jeong's orthogonal Latin squares of order\n9\nin modern notation:\nFrom the orthogonal Latin squares, he was able to construct a magic square of order\n9\n.\nLet us note that Choi Seok-jeong comments in \"Gusuryak\" that he was unable to construct orthogonal Latin squares of order\n10\n. In fact\nEuler\nalso failed in an attempt to construct orthogonal Latin squares of order\n10\nand conjectured in\n1782\nthat orthogonal Latin squares of order\nn\nn\nn\ndid not exist for integers\nn\nn\nn\nof the form\n4\nm\n+\n2\n4m + 2\n4\nm\n+\n2\n. It was not only Choi Seok-jeong and\nEuler\nwho failed to construct orthogonal Latin squares of order\n10\nfor attempts to construct such a square became an obsession for many mathematicians over the years. In\n1959\nErnest Tilden Parker\n(1926\n-\n1991)\nfound two orthogonal Latin squares of order\n10\nusing a computer search. It was one of the earliest combinatorial problems solved using an electronic computer.\nThere is another fascinating problem invented by Choi Seok-jeong which appears in the \"Gusuryak\", namely the Hexagonal Tortoise Problem. Let us illustrate the problem with the example from \"Gusuryak\". Here is a lattice with\n9\nhexagons:\nThe problem is to assign the numbers\n1\n, ...,\n30\nto the\n30\nvertices of the hexagons so that the sum of the vertices of each hexagon is the same. Here is Choi Seok-jeong's solution from the \"Gusuryak\":\nHere is Choi Seok-jeong's solution in modern notation:\nThe problem clearly generalises and is of considerable interest today because of its application to coding theory.\nAlthough we have recorded some brilliant highlights from the \"Gusuryak\", it was on the whole not quite such a stunning work as this suggests\n[\n13\n]\n:-\nFrom a mathematical perspective, \"Gusuryak\" is not as good as perhaps\n24\nother books by mathematicians of the Joseon period. But his idea of trying to understand mathematics according to the principle of the change of the universe given in I Ching is considered unique, and the orthogonal Latin square is a major accomplishment.\nJoseson suffered a series of invasions from Japan beginning in\n1592\nand from the Quin Dynasty of China in\n1636\n-\n1637\n, and lost all its national records and books. \"Gusuryak\" was a big help for Joseson to recover its mathematics and related science and technology. Choi's study of magic squares contained some results never seen in Chinese mathematics, and other results are applicable today to the hexagonal tortoise problem of coding theory.\nIn\n[\n9\n]\nLee Sang-Gu and Lee Jae Hwa ask \"how was it possible to write an academic book while busy with politics?\" They have found some evidence that Choi Seok-jeong was able to write the work when taking a break from politics due to illness.\nAfter resigning from his government positions, Choi Seok-jeong lived mainly at the foot of Sorae Mountain. Soraesan is a mountain in the region bordering Siheung and Incheon. It is located near the present-day Incheon Grand Park. While he was there he wrote a poem which, of course, is impossible to translate into English. The following, however, gives the gist of some ideas in it:-\nThe foot of Soraesan Mountain is a good place to live, so even if you are not old, you are relaxed.\nThere are many loud noises the wild crane over the wind.\nAfter the snow falls, a couple of plum blossoms on the river bank are blooming, but how can I build a fortress wall with my academic skills rather than doubt?\nI read Yang Woong's writing and found out the village trail is not too small, the real music is only in the fire.\nIt is only in recent years that Choi Seok-jeong's contributions to mathematics have been fully recognised. In the second edition of the\nHandbook of Combinatorial Designs\n(2007)\nedited by Charles J Colbourn and Jeffrey H Dinitz, there is the following on page\n12\n:-\nThe literature on latin squares goes back at least\n300\nyears to the monograph 'Koo-Soo-Ryak' by Choi Seok-Jeong\n(1646\n-\n1715)\n; he uses orthogonal latin squares of order\n9\nto construct a magic square and notes that he cannot find orthogonal latin squares of order\n10\n.\nChoi Seok-jeong was appointed to the Korea Science & Technology Hall of Fame on\n23\nNovember\n2013\nby the Ministry of Science and Technology and the Korean Academy of Science and Technology. On\n6\nSeptember\n2018\n, a ceremony was held to commemorate the completion of the Choi Seok-jeong seminar room at the Korea Advanced Institute of Science and Technology. On\n16\nApril\n2019\n, South Korea issued a\n330\nSouth Korean won stamp in his honour. See\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Combinatorics",
    "Number Theory"
  ]
}