{
  "nome_completo": "Christoff Rudolff",
  "nome_curto": "Christoff Rudolff",
  "ano_nascimento": "1499",
  "ano_morte": "1543",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rudolff/",
  "lugar_nascimento": "Jauer, Silesia (now Jawor, Poland)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Little is known about\nChristoff Rudolff\n's origins, family and school education. However, Wolfgang Kaunzner's research has come up with a possible lead\n[\n11\n]\n:-\nIn the summer semester of\n1493\nCristoferus Valentini de Jauer matriculated at the University Kraków and he received a baccalaureate degree in\n1495\nas Cristophorus de Jauer. It is possibly that this is a relative of Rudolff's or even Rudolff himself.\nThe town of Jauer, in which he was born, was culturally Polish but had been under the control of the Bohemians since\n1335\n. It would appear that Rudolff's mother tongue was German and, during his lifetime, Jauer came under Austrian Habsburgs control in\n1526\n. By this time, however, he was living in Vienna. In fact he studied algebra in Vienna between\n1517\nand\n1521\n. His teacher there was Heinrich Schreyber from Erfurt, who is better known by his Latin name Henricus Grammateus. Schreyber taught at the University of Vienna between\n1517\nand\n1521\n, so we know that Rudolff must have studied there for some period before\n1521\n. He remained in Vienna after studying at the university and earned his living giving private lessons in mathematics. He did use the facilities offered by the university, being able to use books in the university library and talking with academics at the university. However, he never held an official position at the university and characterised himself, in the Foreword of one of his books, as:-\n... an amateur of the liberal arts.\nRudolff's book\nCoss\n, written in\n1525\n, is the first German algebra book. The book was dedicated to the bishop of Brixen\n(\nstill known as Brixen to the German speaking population, but now the town is in Italy and known as Bressanone in Italian\n)\n. At this time Brixen was controlled by the Habsburgs and this dedication makes one wonder whether Rudolff had spent some time there. The reason for the title is that\n'cosa'\nis a 'thing' which was used for the unknown. For many years algebraists were called cossists and algebra was known as the cossic art. Although this is the first German algebra book, containing some important innovations, there were already a number of algebra books\n(\nsome only existing in manuscript\n)\nwhich Rudolff had studied before writing his text. These included Robert of Chester's translation of\nal-Khwarizmi\n's\nHisab al-jabr w'al-muqabala\n, which was available in manuscript form, and he used a compilation of algebra texts by Johann Vögelin who worked in Vienna. Rudolff uses letters for algebraic quantities, unlike early algebra texts as he points out in Coss:-\nThis is evident from old books on algebra, written many years ago, in which quantities are represented, not by characters, but by words written out in full, 'drachm', 'thing', 'substance', etc., and in the solution of each special example the statement was put, 'one thing', in such words as ponatur, una res, etc.\nFrom this quote we see that he must have read the Latin Regensburg algebra of\n1461\nfor in that work the solution to all problems begin with the words 'Pono quod lucrum sit una res'. We will return to look at the contents of\nCoss\nin a moment, but first let us look at Rudolff's other works.\nIn\n1526\n, the year after\nCoss\nappeared, Rudolff produced\nKünstliche Rechnung mit der Ziffer und mit den Zahlpfennigen\nⓉ\n(\nCalculating sums with the number and the number of pennies\n)\n. This work studied applications of mathematics to commerce and industry. Of course, the beginning of the\n16\nth\ncentury saw the cottage industries of earlier times replaced by larger scale manufacturing ventures which required considerably more management and financial control thus leading to a much greater need for arithmetical skills. The book was divided into three parts. The first part,\nGrundbüchlein\nⓉ\n(\nBasic booklet\n)\n, introduced the reader to methods of calculating with whole numbers and with fractions. Both methods of calculating using an abacus and methods of calculating without using the abacus are given. The second part,\nRegelbüchlein\nⓉ\n(\nRule booklet\n)\n, teaches the reader the 'Regel de Tri', the 'rule of three' or the rule of proportionality, and the 'Wellischen Practica', the 'Welsch practice' which was an Italian method for solving applied arithmetical problems. The third part of the book,\nExempelbüchlein\nⓉ\n(\nExample booklet\n)\n, contains around\n300\nproblems and results which concentrate on the needs of those working in commercial or manufacturing organisations. The book, however, also contains some applications to mathematical recreations.\nIn\n1530\nRudolff produced the book\nExempelbüchlin\nⓉ\n(\nExample booklet\n)\nwhich has much in common with the third part of his earlier work and contains\n293\nproblems. This book, published in Augsburg, is important for it is the first work in which one finds calculations with decimal fractions. His notation for decimals is not very different from that used today; instead of the modern \"decimal point\", Rudolff uses a bar to separate the integral and fractional parts.\nDavid Smith\nwrites\n[\n13\n]\n:-\nIn this work\n[\nRudolff\n]\nsolved an example in compound interest, and used the bar precisely as we should use a decimal point today. If any particular individual were to be named as having the best reason to be called the inventor of decimal fractions, Rudolff would seem to be the man, because he apparently knew how to operate with these forms as well as merely to write them, as various predecessors had done. His work, however, was not appreciated, and apparently was not understood, and it was not until\n1585\nthat a book upon the subject appeared.\nKurt Vogel explains  in\n[\n1\n]\nthat, as well as the collection of arithmetical problems, the book contains:-\n... tables of measurements for many regions, a list of symbols used in gauging, and numerous hints for solving problems.\nLet us return to Rudolff's\nCoss\nand, first, give its full title:\nBehend vnnd Hubsch Rechnung durch die kunstreichen regeln Algebre so gemeinlicklich die Coss genent werden\nⓉ\n(\nA clever way of calculating sums by the artful rules of algebra commonly called 'the thing'\n)\n. The book was published in Strasbourg. We noted above some of the manuscripts on algebra which Rudolff had read before producing his book and in fact many of his fellow mathematicians criticised him for 'stealing' his examples from earlier texts. It was standard practice at this time, and for many years after this, to use examples from earlier works and\nMichael Stifel\nstrongly defends Rudolff from these attacks. It is reasonable to believe that Rudolff's fellow mathematicians were upset at this book because it was written in German rather than Latin.\nThere are two parts to the book: the first part contains twelve chapters and this material, writes Rudolff, must be mastered by the reader before he progresses to a study of algebra which comprises the second part of the book. What, then, must the reader master before beginning algebra? The chapters contain explanations of how to calculate with numbers, both whole numbers and fractions, then the famous rule of three is explained followed by methods to compute square roots and cube roots of numbers. He used √ for square roots\n(\nthe first to use this notation\n)\n,\nfor cube roots and\nfor\n4\nth\nroots. This does seem a little strange and\nStifel\nthought so since he adopted\nfor cube roots and\nfor\n4\nth\nroots in his second edition of\nCoss\n. Returning to the first edition, Rudolff computes with expressions involving square roots. For example he subtracts\n5\n+ √\n8\nfrom\n12\n+ √\n128\nto get\n7\n+ √\n72\n. Slightly more difficult is his example\n(\n√\n50\n-\n2)\n-\n(\n√\n32\n-\n5\n)\n= √\n2\n+\n3\nand then, after examples of increasing difficulty, ends with\n(\n√\n450\n- √\n18)\n-\n(\n√\n32\n+ √\n8)\n= √\n72\n. Next come formulas for summing arithmetic and geometric series. This takes us to the end of the fourth chapter of part\n1\n. Beginning with chapter\n5\nhe considers algebraic expressions. Where we would write:\n1\n,\nx\n,\nx\n2\n,\nx\n3\n,\nx\n4\n,\nx\n5\n,\nx\n6\n,\nx\n7\n,\nx\n8\n,\nx\n9\n1, x, x^{2}, x^{3}, x^{4}, x^{5}, x^{6}, x^{7}, x^{8}, x^{9}\n1\n,\nx\n,\nx\n2\n,\nx\n3\n,\nx\n4\n,\nx\n5\n,\nx\n6\n,\nx\n7\n,\nx\n8\n,\nx\n9\nRudolff writes a list of ten, essentially different, symbols. Opposite each symbol is its name\n(\nwe give our modern symbol and Rudolff's name for the first few entries\n)\n:\n1\n - Dragma or numerus\nx\nx\nx\n - radix\nx\n2\nx^{2}\nx\n2\n- zensus\nx\n3\nx^{3}\nx\n3\n- cubus\nx\n4\nx^{4}\nx\n4\n- zensdezens\nThe list goes up to\nx\n9\nx^{9}\nx\n9\nwhich is named\ncubus de cubo\n. Under the list Rudolff writes:-\nDragma or numerus is taken here as\n1\n. It is no number, but assigns other numbers their kind. Radix is the side or root of a square. Zensus, the third in order, is always a square; it arises from the multiplication of the radix into itself. Thus, when radix means\n2\n, then\n4\nis the zensus.\nRudolff goes on to look at adding, subtracting, multiplying and dividing polynomial expressions. Using modern notation for powers of the unknown, rather than those of Rudolff, we see that he gets quite far as the following example shows:\n12\nx\n+\n2\n−\nx\n−\n2\n12\n=\n148\n−\nx\n2\n12\nx\n+\n24\n\\Large\\frac{12}{x+2}\\normalsize - \\Large\\frac{x-2}{12}\\normalsize =\\Large\\frac{148-x^2}{12x+24}\\normalsize\nx\n+\n2\n1\n2\n​\n−\n1\n2\nx\n−\n2\n​\n=\n1\n2\nx\n+\n2\n4\n1\n4\n8\n−\nx\n2\n​\nThe second part of Rudolff's\nCoss\ncontains three chapters. The first of these gives methods for solving linear and quadratic equations. Earlier works on solving equations had presented the reader with\n24\ndifferent cases but Rudolff reduces this to\n8\ncases. In looking at the case of a quadratic of the form\na\nx\n2\n+\nb\n=\nc\nx\nax^{2} + b = cx\na\nx\n2\n+\nb\n=\nc\nx\nhe believed at first that there was only one solution to this equation which will solve the original problem, but he later recognised his error and realised that such equations have two solutions. The second chapter is again concerned with solving equations and presents rules for solving them. The third chapter, like the final chapter to the first part, presents examples; in this part of the work there are over\n400\nof them\n[\n1\n]\n:-\nSome of the problems involve abstract numbers; others, taken from daily life, are presented in fantastic forms similar to those of the 'Enigmata' of recreational mathematics. In some of the problems Rudolff introduces a second unknown, q\n(\nfor 'quantitas'\n)\n. If there are more unknowns than equations, the problem is considered indeterminate. For several such problems concerned with \"splitting the bill\"\n(\nZechenaufgaben\n)\nRudolff supplied all the possible solutions. The 'Coss' ends with three cubic problems. Rudolff does not work out their solutions because, as he stated, he wanted to stimulate further algebraic research.\nThere are some other features of\nCoss\nthat are worth mentioning. He introduced the notation\n√\n.\n12\n+\n√\n140\n√.12 + √140\n√\n.\n1\n2\n+\n√\n1\n4\n0\nto mean\n√\n(\n12\n+\n√\n140\n)\n√(12 + √140)\n√\n(\n1\n2\n+\n√\n1\n4\n0\n)\nand so distinguish it from\n√\n12\n+\n√\n140\n√12 + √140\n√\n1\n2\n+\n√\n1\n4\n0\n. Later authors added a second dot to indicate how far the square root extended\n(\ngiving the dots precisely the meaning of the brackets we have used. Another important feature of\nCoss\nis that Rudolff uses letters to represent numbers. Earlier cossists had only used letters for the unknown. To indicate exactly how Rudolff did this we give an example from the book:-\nTake\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nthis sum, assume for it a position, which, being empty, is called\nc\nc\nc\n. Then subtract\nc\nc\nc\nfrom\na\na\na\n, what remains call\nd\nd\nd\n. Now I say that\n√\nc\n+\n√\nd\n√c + √d\n√\nc\n+\n√\nd\nis the square root of the first binomial.\nKurt Vogel evaluates Rudolff's importance in\n[\n1\n]\n:-\nRudolff's importance in the history of mathematics lies in his having written the first comprehensive book on algebra in German. In this work he went far beyond his teacher Grammateus, especially concerning calculation with\nrational\nand\nirrational\npolynomials. Rudolff was aware of the double root of the equation\na\nx\n2\n+\nb\n=\nc\nx\nax^{2} + b = cx\na\nx\n2\n+\nb\n=\nc\nx\nand gave all the solutions to indeterminate first-degree equations. His writings are remarkable both for the occasional appearance of decimal fractions and for improvements in symbolism. Adding a diagonal stroke to the points used by earlier cossists, Rudolff introduced ... signs ... for the second, third, and fourth roots. His work also gives a hint of the beginnings of exponential arithmetic and the fundamental idea of logarithms - that is, setting\nx\n0\nx^{0}\nx\n0\nequal to\n1\n. His methodical hints on using the Coss are worth noting as well. In brief, Rudolff's role in the development of mathematical studies in Germany was analogous to that of\nFibonacci\nin Italy.\nAs to his influence on later mathematicians, we note that\nMichael Stifel\nbrought out a new addition to Rudolff's\nCoss\nin\n1553\n, adding some important material of his own. In\n[\n10\n]\nAlbrecht Heeffer identifies Rudolff's\nCoss\nas the source of most of the problems in the first volume of\nEuler\n's\nVollständige Anleitung zur Algebra\n(1770)\n. In fact when\nEuler\nwas learning mathematics he made a careful study of Rudolff's work.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Number Theory"
  ]
}