{
  "nome_completo": "Christine Ladd-Franklin",
  "nome_curto": "Christine Ladd-Franklin",
  "ano_nascimento": "1847",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ladd-Franklin/",
  "lugar_nascimento": "Windsor, Connecticut, USA",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "Christine Ladd-Franklin\n's name before she married was Christine Ladd, but she was often known as Kitty. Her parents were Eliphalet Ladd, who was a successful New York merchant, and Augusta Niles and both were originally from New England. Christine was the eldest of Eliphalet and Augusta's three children, having a younger brother Henry and a younger sister Jane.\nIn order to understand how Christine Ladd had the will and determination to succeed at a time when the odds were stacked heavily against women, we should look briefly at her mother Augusta's views. Augusta and her sister Juliet Niles were\n[\n4\n]\n:-\n... both staunch supporters of women's rights.\nIn fact Augusta once wrote in a letter that\n[\n4\n]\n:-\n... women belonged not only in the pulpit, a place for which they were peculiarly suited, but also every place where a man should be.\nShe wrote this after attending a women's rights lecture and, Christine as a young child, attended these lectures with her mother.\nUntil she was six years old Christine and her family lived in New York, then they moved to Windsor, Connecticut. When Christine was twelve years old, however, her mother died. At this time she was sent to live with her father's mother in Portsmouth, New Hampshire. For two years she attended Wesleyan Academy in Wilbraham, Massachusetts where she followed the same course as the boys who were being prepared to enter Harvard University. Christine's father encouraged her, writing in a letter to her\n[\n4\n]\n:-\nAll you want is a little more courage you can do as well as anyone I have no doubt, so do not be afraid but go ahead and do your best. And my word for it you will have as good an essay as anyone in the school.\nShe graduated from the College in\n1865\nand wanted to study at Vassar College in Poughkeepsie, New York. This was a women's college which had been set up to allow women to obtain an education of equivalent standard to that available to men. However Ladd's family, particularly her father's mother, were opposed to this course of action, despite the encouragement that her father had shown. Ladd wrote in her diary at this time\n[\n3\n]\n:-\nVassar! Land of my longing! Mine at last... Is it really for the best? I confess I have misgivings - everyone is so opposed to it ...\nDespite the opposition, Ladd won them round and entered the second year of the course at Vassar College supported financially by Juliet Niles, her mother's sister whom we mentioned above. Her father wrote encouragingly to her about her good performance\n[\n4\n]\n:-\nI was pleased to see that you passed so good an examination in all your different studies and I trust you will stand No.\n1\nin your classes though I suppose that you will have abler contestants that at Wilbraham but then you must fight the harder.\nLadd spent one year at Vassar, then took a year out, because of financial difficulties, when she taught in Utica, New York. However it was a year in which she not only made money by teaching but also\n[\n6\n]\n:-\n... practised piano, read in three or four languages, worked problems in trigonometry, and collected\n150\nbotanical specimens.\nWhen she returned to Vassar College after teaching for a year, she was greatly encouraged by the professor of astronomy there,\nMaria Mitchell\n, to follow her interests in mathematics and science. In fact Ladd was really interested in physics but at this time, although mathematics was possible for women, physics was not possible since they were not allowed into the laboratories. She graduated from Vassar College in\n1869\nwith an A.B. and went into teaching.\nFor nine years Ladd taught in schools in Pennsylvania, Massachusetts, and New York as an instructor of science and mathematics. She continued to take an active interest in mathematics and wrote numerous articles in that topic in the\nEducational Times\n, published in London England. She also published work in the American publication\nThe Analyst\n. Teaching, however, began to displease her. She wrote in her diary\n[\n3\n]\n:-\nSunday evening is the most miserable time of all the week. The burdens of the morrow look impossible to be born. Teaching I hate with a perfect hatred...I shall not be able to endure it another year.\nJohns Hopkins University opened in Baltimore, Maryland, as a graduate school for men in\n1876\n. In\n1877\nSylvester\naccepted the chair of mathematics at Johns Hopkins University and it was to\nSylvester\nthat Ladd turned to see if she could be admitted to study for a doctorate in mathematics.\nSylvester\nalready knew of Ladd through her mathematics articles in\nEducational Times\n, which he had read in England before coming to the United States, and so he requested that the University admit Ladd even although entry was not in general open to women. Ladd was admitted to Johns Hopkins in\n1878\non the condition that she only attend lectures given by\nSylvester\n.\nSylvester\nwas not the only quality mathematician at Johns Hopkins. There was also\nWilliam Story\nand the mathematical logician\nCharles Peirce\n. After one very successful year at Johns Hopkins when Ladd only attended\nSylvester\n's lectures, the university relented and allowed her to attend lectures by others. In particular she attended those by\nWilliam Story\nand\nCharles Peirce\n.\nSylvester\nalso persuaded the University to award her a $\n500\na year fellowship for the three years\n1879\n-\n82\n, but she was not entitled to the title \"Fellow\" nor was her name recorded on the list of students at the university.\nCharles Peirce\n's only academic post was the courses on logic he gave at Johns Hopkins from\n1879\nand\n1884\nand it was these courses which led Ladd to write a doctoral thesis entitled\nThe Algebra of Logic\n. Now when we say \"doctoral thesis\" we should make it clear that as women were not officially admitted to Johns Hopkins they certainly could not graduate so, although Ladd's dissertation was published in\n1883\n, she was not awarded a Ph.D. She had published several papers in the\nAmerican Journal of Mathematics\nwhile she undertook research and few men who were receiving their Ph.D.s at this time could have equalled her achievements. One of the mathematics faculty at Johns Hopkins was\nFabian Franklin\nwho was about five years younger than Ladd. They married on\n24\nAugust\n1882\nand within two years two children were born, although one died while an infant the other, Margaret, survived.\nHurvich writes in\n[\n7\n]\nabout how Ladd-Franklin, as she now called herself, became interested in colour vision:-\nHer interest in this area began with a study\n(1886)\nof the horpoter, which is the locus of points in external space whose images are so formed on the retinas of the two eyes that they are seen singly in binocular vision.\nLadd-Franklin wrote up the results of her studies in a paper which was published in the first volume of the\nAmerican Journal of Psychology\nin\n1887\n. In the same year she was awarded an honorary LL.D. degree from Vassar College.\nFabian Franklin\ntook sabbatical leave in session\n1891\n-\n92\nand what better place was there for a mathematician to spend their sabbatical than at Göttingen in Germany. Ladd-Franklin went to Göttingen with her husband and daughter Margaret and, although Göttingen would not admit women to lectures, she was able to persuade G E Muller, a leading expert on colour vision, to let her conduct experiments in his laboratory. Muller went even further and often repeated for her lectures which he had given yet Ladd-Franklin was not permitted to attend.\nWishing to study under Hermann von\nHelmholtz\nin Berlin, she left her husband in Göttingen to care for Margaret while she spent a while in Berlin. There she was able to work in\nHelmholtz\n's laboratory and to attend lectures at the university. Ladd-Franklin developed her own theory of colour vision while working in Germany and in\n1892\nshe visited England and presented it to an International Congress of Psychology in London.\nBack in the United States,\nFabian Franklin\nresumed his teaching at Johns Hopkins and Ladd-Franklin asked to be allowed to lecture at the University. Her request was turned down, as were several other requests she made over the following years. Beginning in\n1901\nshe helped to administer the Sarah Berliner fellowships which were to support women who had recent been awarded a Ph.D. in their postdoctoral research. She continued to help administer these fellowships for\n17\nyears.\nAlso in\n1901\n, she became the associate editor for logic and philosophy in Baldwin's Dictionary of Philosophy and Psychology, a position she held until\n1905\n. The year before this Johns Hopkins relented and allowed her to teach one course in logic and philosophy. This arrangement was continued on a yearly basis over the following years until\n1909\n.\nFabian Franklin\nhad decided to end his mathematical career in\n1905\nand take up journalism. When he obtained the post of associate editor of the New York Evening Post in\n1910\nLadd-Franklin went to New York with her husband.\nShe was never able to obtain a proper academic post, for these were certainly closed to married ladies, but she was able to continue to teach part-time. This she did at Columbia University from\n1912\n-\n1913\n, then at Clark University and Harvard University in\n1913\n, finally teaching at the University of Chicago in\n1914\n. She seldom received payment for giving courses at these universities.\nTypical of her attempts to attend meetings of experimental psychologists were letters she wrote in\n1912\n[\n3\n]\n:-\nI am particularly anxious to bring my views up, once in a while, for hand-to-hand discussion before experts, and just now I have especially a paper which I should like very much to read before your meeting of experimental psychologists. I hope you will not say nay!\nThe experimental psychologists did say nay and Ladd-Franklin wrote again\n[\n3\n]\n:-\n... a scientific meeting is a public affair, and it is not open to you to leave out a class of fellow workers without extreme discourtesy.\nShe was never admitted to these meetings, but times were slowly changing and, in\n1926\n, Johns Hopkins University awarded Ladd-Franklin a Ph.D. for the dissertation she had completed in\n1882\n. In\n1929\nshe published a major work on colour vision\nColour and Colour Theories\n. This collected together the research she had undertaken on the subject over many years.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}