{
  "nome_completo": "Jessie Chrystal MacMillan",
  "nome_curto": "Chrystal Macmillan",
  "ano_nascimento": "1872",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacMillan_Chrystal/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Chrystal Macmillan\n's parents were John Macmillan and Jessie Chrystal Finlayson. She was one of a family of nine children, having eight brothers. Her parents sent her as a boarder to St Leonard's School in St Andrews, a fairly new school at this time as it had been founded in\n1877\n. Macmillan then returned to Edinburgh and began her studies at Edinburgh University first matriculating in October\n1892\n. Before matriculating she had passed the Preliminary Examination in English, Mathematics, French, Dynamics and Science. She was one of the first women to be admitted to a university course in Scotland, since it was in\n1892\nthat women were admitted for the first time. However, she would not be one of the first to graduate since other women had already studied university level courses and were able to graduate with an M.A. in\n1893\n.\nMacmillan studied Mathematics with\nChrystal\nand  Natural Philosophy with\nTait\nin session\n1892\n-\n93\n. In session\n1893\n-\n94\nshe took Chemistry and Practical Chemistry with Drinkwater in the School of Medicine, Intermediate Honours Mathematics with\nChrystal\nand Intermediate Honours Natural Philosophy with\nKnott\n. In the following academic year\n1894\n-\n95\nshe studied Advanced Honours Mathematics with Chrystal, Astronomy and Practical Astronomy with Copeland, then in\n1895\n-\n96\nAdvanced Natural Philosophy with\nTait\n. She was awarded a B.Sc. in April\n1896\nbecoming the first woman graduate with a degree in science from Edinburgh.\nAfter studying at the University of Berlin over the summer of\n1896\n, Macmillan returned to Edinburgh and matriculated in the Faculty of Arts in October\n1896\nafter passing the Preliminary Examination in Greek. She then took courses on Moral Philosophy and Mental Philosophy in session\n1896\n-\n97\n, Political Economy and Greek in session\n1897\n-\n98\n, Moral Philosophy in\n1898\n-\n99\n, and Mental Philosophy in session\n1899\n-\n1900\n. Having already taken the Honours courses in Mathematics and Natural Philosophy in\n1894\n-\n95\nand\n1895\n-\n96\nrespectively, she graduated in April\n1900\nwith Second Class Honours in Moral Philosophy and Logic as well as First Class Honours in Mathematics and Natural Philosophy. In this she scored another first, becoming the first woman to graduate from Edinburgh with First Class Honours in Mathematics and Natural Philosophy. In addition to her academic studies, while at university she had played a major role in the Women's Debating Society, an activity which was to stand them in good stead.\nAfter graduating Macmillan worked for the Scottish Federation of Women's Suffrage Societies, campaigning for women's rights to vote. At this time the Scottish Universities\n(\nSt Andrews, Aberdeen, Glasgow and Edinburgh\n)\nelected four MPs to Parliament. Members of the General Councils of these universities formed the electorate, all 'persons' on the Councils having the right to vote. The word 'person' was used throughout the statutes. The General Councils consisted of the graduates of the four universities, and now Macmillan and many other women were graduates. However, women were denied the right to vote for the first general election in which the university seat of Edinburgh and St Andrews was contested in February\n1906\n. She, along with other women, argued that women graduates were 'persons' and therefore allowed to vote in electing the university MPs. As honorary secretary of the Women Graduates of the Scottish Universities\n(\nParliamentary Franchise\n)\nCommittee, Macmillan brought a court action in\n1906\nto argue that women graduates had the right to vote as 'persons' on the General Councils. The case was lost, and their appeal was dismissed. In\n1908\nthe case was brought before the House of Lords, the final arbiter in legal matters. Macmillan became the first woman to plead before the House of Lords\n[\n2\n]\n:-\nLate in that day the case was opened by Miss Macmillan, who spoke for three-quarters of an hour. It was inevitable that the Press should refer to her as a modern Portia. The Glasgow Herald reporter added that she wore an appropriate costume with a fur necklet and a wide-brimmed hat to match her dress; that she was a little nervous at the start but warmed to the subject and that she argued law in an admirable speaking voice. Two days later the hearing was resumed and Miss Macmillan, dressed this time in a dark red costume and hat, with ermine furs, spoke for three hours with complete self-possession and great skill in exposition.\nThe case was rejected and Macmillan moved to London to carry on the fight for women's rights to vote. She was elected to the executive of the National Union of Women's Suffrage Societies, and also played a major role as Secretary of the International Woman Suffrage Alliance from\n1913\nto\n1920\n. When war broke out in\n1914\nMacmillan, who strongly opposed the war, resigned from the National Union of Women's Suffrage Societies because of the position it took. Her opposition to the war took a very practical form. She was on the first boat to cross the North Sea taking a food convoy to Flushing after the fall of Antwerp. She then proposed a Women's Congress in The Hague to:-\n... discuss the principles on which peace should be made and, if so agreed, to act internationally.\nThe conference was held in April\n1915\n, with Macmillan one of only three British women able to attend since the North Sea was by that time closed. She was elected a member of the delegation from that Congress to present proposals to heads of neutral states for halting World War I. She then went to the United States to assist the those opposing America's entry into the war. After the war ended in\n1918\n, Macmillan was a delegate at the International Congress of Women in Zürich in May\n1919\nwhich issued a strong condemnation of the harsh terms imposed on Germany by the Treaty of Versailles. She presented these views to the\n1919\nParis Peace Conference but, as had happened so often in her life, again her views were ignored. Looking back on these events with the benefit of hindsight, we can now say that Macmillan's views have been shown to have been right.\nBy this time women aged\n30\nor over had been given the right to vote by the Representation of the People Act which was passed by the House of Commons in June\n1917\nand by the House of Lords in February\n1918\n. Macmillan was now able to join the legal profession, which had been opened to women, and felt that from this position she would be better able to advance the causes in which she believed. Macmillan entered the Middle Temple, and was called to the bar on\n28\nJanuary\n1924\n[\n3\n]\n:-\nShe was the right kind of lawyer, one who held that Law should be synonymous with Justice ... Her chief aim in life - one might call it her passion - was to give every woman of every class and nation the essential protection of justice. She was, herself, a great and very just human being ... She could not budge an inch on matters of principle but she never lost her temper and never bore a grudge in defeat.\nMacmillan joined the Edinburgh Mathematical Society in May\n1897\nwhen she was reading for her M.A. at Edinburgh. She was the second woman member of the Society, joining a few months before Charlotte Scott who was the third woman member. The first woman member was Flora Philip who joined in\n1886\n. Macmillan remained a member of the Society until\n1915\n.\nMacmillan received much recognition for her achievements. A fund was set up at Livingston House, Broadway, London, to provide an annual Chrystal Macmillan Prize for women students of Law and to support the societies with whose work she was particularly associated. A Millennial plaque is at Kings Buildings\n(\nWest Mains Road\n)\n, in Edinburgh. It reads:\nIn honour of\nJESSIE CHRYSTAL MACMILLAN\n1872\n-\n1937\nSuffragist, founder of Women's International League for Peace and Freedom,\nfirst woman science graduate of the University\n(1896)\n.\nThe University of Edinburgh has also named a building in her honour. The following statement was issued by the School of Social and Political Studies:-\nThe School of Social and Political Studies wishes to name its newly refurbished building after Chrystal Macmillan as key aspects of her life and work relate to matters of central concern to the School including gender, international politics, human rights, personhood and social identity. The Millennial Plaque at King's Buildings erected in her honour uses her full name, Jessie Chrystal Macmillan but throughout her professional life she was invariably known as Chrystal Macmillan and the School wishes to name its refurbished building 'The Chrystal Macmillan Building'.\nHer death is described in\n[\n1\n]\n:-\nIn June\n1937\nChrystal Macmillan had to have a leg amputated. She died from heart disease at\n8\nChalmers Crescent, Edinburgh, on\n21\nSeptember\n1937\n, and was cremated on\n23\nSeptember in Edinburgh. In her will she left bequests to the Open Door International for the Economic Emancipation of the Woman Worker, and to the Association for Moral and Social Hygiene. A memorial prize is awarded annually in her name by the society of the Middle Temple to the highest placed woman student in the bar's final examinations.",
  "math_areas": [
    "Logic"
  ]
}