{
  "nome_completo": "Cleomedes",
  "nome_curto": "Cleomedes",
  "ano_nascimento": "10",
  "ano_morte": "70",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cleomedes/",
  "lugar_nascimento": "possibly Lysimachia, Hellespont, Greece (now Turkey)",
  "lugar_morte": null,
  "biografia": "Cleomedes\nis known only through his book\nOn the Circular Motions of the Celestial Bodies\nwhich is an uninspiring astronomy textbook. There are a number of points of interest in this book, however, as we shall discuss below.\nWe should first discuss the perplexing question of the period in which Cleomedes lived. The only certainty here is that\nOn the Circular Motions of the Celestial Bodies\ndiscusses the work of\nPosidonius\nat length and so is clearly written after the middle of the first century BC. In fact\nOn the Circular Motions of the Celestial Bodies\nends with the words\n(\nsee for example\n[\n3\n]\n)\n:-\nThe preceding teachings are not the author's own opinion but collected from older or more recent summaries; much of it is taken from\nPosidonius\n.\nIt is hard to estimate from these words how long after\nPosidonius\nthe author, Cleomedes, is writing.\nHeath\n[\n2\n]\nfavours a date in the middle of the first century BC. He also points out:-\nAs\n[\nCleomedes\n]\nseems to know nothing of the works of\nPtolemy\n, he can hardly... have lived later than the beginning of the second century AD.\nNeugebauer\n, however, disagrees with these conclusions of\nHeath\nand proposes that Cleomedes wrote his text around\n370\nAD. His argument is based on a comment by Cleomedes in the text where he remarks than there are two bright stars\n(\nAldebaran and Antares\n)\nsuch that the rising of one and the setting of the other take place at the same time. These stars Cleomedes claims lie at\n15\n° of their sign. Using\nPtolemy\n's positions for the stars at the time the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nwas written and\nPtolemy\n's value of\n1\n° per\n100\nyears for precession,\nNeugebauer\ngets his date of\n371\nAD for Cleomedes writings, to which\nNeugebauer\nestimates a maximum error of\n50\nyears on either side.\nAstronomically\nNeugebauer\n's calculations are of course perfectly correct. However they are suspect for a number of other reasons. Firstly the data in\nOn the Circular Motions of the Celestial Bodies\ndoes not seem to be due to Cleomedes but to a variety of sources. Of course accepting this argument would make Cleomedes dates later still. Secondly the data in Cleomedes is of widely differing degrees of accuracy. Some is very good, while other data has errors of\n20\n%. Thirdly the actual astronomical event of Aldebaran setting and Antares rising at the same instant can never be observed.\nHeath\n's comment that Cleomedes knows nothing of the works of\nPtolemy\nis also less certain than it might at first appear. Cleomedes is writing an elementary textbook and it is certainly not always the case that one mentions recent research in a low level textbook. For example many elementary textbooks on applied mathematics still use\nNewton\n's gravitational methods\n(\nand for good reason\n)\n100\nyears after\nEinstein\ngave an improved theory of gravitation.\nIn\n[\n1\n]\nDicks suggests that the most likely date for Cleomedes is the first century AD and we have taken that as the best available compromise from what is known. That is not to say that\nNeugebauer\n's date is impossible. In fact there are other features of the text which would tend to support the fourth century AD as a date, despite the lack of references to\nPtolemy\n. Not least of these is the fact that this was a period when many second rate textbooks of this nature were written and the style is not unlike that of other fourth century AD texts, some of which give the same astronomical data as Cleomedes.\nOn the Circular Motions of the Celestial Bodies\nis a work in two volumes. We commented above that it was important for a number of reasons. The most important certainly is that it gives us the best indication that we have of the contents and the style of a text by\nPosidonius\n. As\nHeath\ncomments\n[\n2\n]\n:-\n... the very long first chapter of Book II\n(\nnearly half of the Book\n)\n... seems for the most part to be copied bodily from\nPosidonius\n.\nBut this is not Cleomedes' main aim in writing the text. It is written to attack the\nEpicureans\nwho believed among other odd beliefs, that the sun was as large as it looked, namely one foot across. Cleomedes spends much time in his text showing that this is false, but it does seem as if he is going to extremes when he compares Epicureans unfavourably with rats, reptiles and worms. Cleomedes' own philosophical views show that he is a\nStoic\n.\nSince\nOn the Circular Motions of the Celestial Bodies\nis compiled from a number of sources, there is a fair variation in the quality, and in many places the book fails to be consistent where the various sources disagree. Whenever a piece of text is thought to be due to Cleomedes himself, there is much evidence that his understanding of the topic was very limited and, but for the quality of his sources, one feels that Cleomedes would not fare any better than the Epicureans for naiveté.\nLunar eclipses are described well in the text, and the conical shape of the earth's shadow shows an interesting depth of understanding\n(\nat least of Cleomedes' source\n)\n. He also correctly explains the reports of lunar eclipses seen when both the sun and moon are above the horizon as being due to\nrefraction\n.\nNeugebauer\ngives samples of the sense and nonsense which are mixed in Cleomedes\n[\n3\n]\n:-\nCleomedes states that no fixed star has an apparent diameter less than one finger\n(\na rather absurd exaggeration\n)\nwhile the apparent diameter of Venus should be two fingers, i.e.\n1\n6\n\\large\\frac{1}{6}\\normalsize\n6\n1\n​\nof the lunar or solar diameter. Of some interest is the remark that the absolute size of fixed stars may reach, or even surpass, the sun ... it is\n[\nalso\n]\nsaid that the earth, seen from the sun, would appear at best a very small star.\nOne further interest in Cleomedes' work is that it is in\nOn the Circular Motions of the Celestial Bodies\nthat we learn of\nEratosthenes\nmethod of measuring the circumference of the earth. This is one of the best known of the achievements of early mathematical astronomy and we are indebted to Cleomedes for relating the method. Of course not everyone believes that the story of\nEratosthenes\n' measurement is authentic but, despite this, it is widely accepted.\nFinally we should remark that\nNeugebauer\nsuggests from a study of certain astronomical data given in\nOn the Circular Motions of the Celestial Bodies\nthat Cleomedes lived in the Hellespont on the Black Sea, suggesting the city of Lysimachia.\nNeugebauer\nadmits that the city of Lysimachia was destroyed in\n144\nBC which seems at odds with his own date of\n370\nAD for Cleomedes but he is able to show that despite the disaster of\n144\nBC records of the city certainly extend up to the fourth century AD. The weakness of\nNeugebauer\n's argument must surely be that almost all of Cleomedes' text and data is taken from the works of others so\nNeugebauer\n's arguments seem only to give strong evidence for one of Cleomedes' sources having written in Lysimachia.",
  "math_areas": [
    "Applied Mathematics"
  ]
}