{
  "nome_completo": "Clifford Henry Taubes",
  "nome_curto": "Clifford Taubes",
  "ano_nascimento": "1954",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taubes/",
  "lugar_nascimento": "Rochester, New York, USA",
  "lugar_morte": null,
  "biografia": "Clifford Taubes\nwas brought up in Rochester, New York, a city on the banks of Lake Ontario. He has a younger brother, Gary Taubes, who was born in Rochester, New York, on\n30\nApril\n1956\n. Gary, who has degrees in applied physics, aerospace engineering and journalism, is now a well known journalist and author writing on scientific subjects. Clifford did not have an interest in mathematics when at high school but found science to be his favourite subject. An excellent student at the High School, he was encouraged by his father to apply to Cornell University for his university studies. He felt that the subject for him was astrophysics but since it was impossible to major in astrophysics at Cornell, he majored in physics. Of course, to major in physics meant that he had to take some mathematics courses and he took engineering mathematics which was mainly involved with solving differential equations. This did not greatly excite him but in his final year he took an introductory topology course and found it fascinating. He was an exceptionally good student and graduated from Cornell in\n1975\n.\nDespite finding Introductory Topology fascinating, Taubes continued with his aim of studying astrophysics. He applied to Princeton University for graduate studies in astrophysics and, having been accepted, became a graduate student in the Astronomy Department working with Larry Smarr. Larry Lee Smarr\n(\nborn\n16\nOctober\n1948)\nhad studied at the University of Missouri and then had undertaken research for a Ph.D. at the University of Texas at Austin. He had been awarded the degree in\n1975\nfor his thesis\nThe Structure of General Relativity with a Numerical Illustration: The Collision of Two Black Holes\n.\nTaubes said, however\n[\n12\n]\n:-\nI hated it. It might not have had anything to do with the graduate school but a lot to do with me.\nGiven his reaction, he is almost certainly right that the problem was not the subject, for he felt he wanted to he away from people. The feeling was so strong that he applied to several Forestry Schools and was accepted by Washington State University, in Pullman, Washington. His idea at this stage was to become a forest fire warden, living alone in a forest ready to report on any fires. He would almost certainly have followed that route but for the influence of one of the professors at Princeton, Bill Press. William Henry Press\n(\nborn\n23\nMay\n1948)\nhad been an undergraduate at Harvard before studying for a Ph.D. at the California Institute of Technology. He was awarded a doctorate in\n1972\nfor his thesis\nApplications of Black Hole Perturbation Techniques\nand, after two years as an assistant professor at Caltech, he moved to Princeton in\n1974\nwhere he was also an assistant professor. Both Smarr and Press were about to move to Harvard when Taubes got to know them in the Princeton Astronomy Department. Press encouraged Taubes to apply to the Harvard Physics Department. He told Taubes that if he did not like Harvard he could always go off and live in the woods, but if he went off to live in the woods after his one year at Princeton, it would be almost impossible to return to study physics. Without making a decision one way or the other, Taubes applied to do graduate studies of physics at Harvard and was accepted; he now had to chose between forestry or physics.\nAfter his one year at Princeton, Taubes returned to live with his parents in Rochester over the summer. He said\n[\n12\n]\n:-\n... I had bought a car. As I was driving out to the driveway, if I turned to the right, that was to the west, I was going to forestry graduate school. And if I turned to the left, which was sort of to the east and to Harvard, then I was going to physics graduate school. The question in my mind as I got in the car and drove off was \"Was I going to turn right, or was I going to turn left?\" Finally Bill Press's advice that \"you can always go into the woods\" came into my head, so I said, \"alright, I'll turn left to Harvard because I can always go off in the woods.\"\nThe reader will be wondering where this is leading since Taubes is one of the outstanding mathematics of today\n(2024)\n, yet our story so far has taken us from physics to astrophysics, then back to physics. Taubes' interests had, however, up to this point always been in cosmology and, when he began graduate studies in physics at Harvard, his aim was still to understand the structure of the universe. It was now that he began his path towards mathematics for he was convinced that the answer to understanding the structure of the universe was through mathematics. Although this seems like a sensible approach, it may, at least in part, have been motivated by Taubes' dislike of experimental physics. He then took, as part of his graduate studies, as many mathematics courses as he could.\nIn the interview\n[\n12\n]\nTaubes explains that there were two reasons why he ended up a mathematician rather than a physicist. One was not surprising; he became \"seduced by the beauty of mathematics.\" He claims, probably with tongue in cheek, that the second reason was because the Department of Mathematics at Harvard had superb gourmet cake at their weekly colloquia, while the Department of Physics had:-\n... really dry, sort of panned cake that I used to get in high school, stale and awful, and it was basically horrible stuff.\nThe real second reason was probably the fact that the mathematicians liked to discuss their work with each other and give each other advice while:-\n... in the physics department you never told anybody what you were thinking about because they would publish it the next day.\nAt Harvard, Taubes' Ph.D. advisor was Arthur Michael Jaffe\n(\nborn\n22\nDecember\n1937)\n. Jaffe had a chemistry degree from Princeton University\n(1959)\n, he had a mathematics degree from the University of Cambridge\n(1961)\nand a doctorate in Physics from Princeton\n(1966)\n. He had been appointed as Professor of Physics in Harvard\n1970\nbut, remaining at Harvard, had become Professor of Mathematical Physics there in\n1974\n. Taubes' first paper\nSolution of the almost-Killing equation and conformal almost-Killing equation in the\nKerr\nspacetime\nwas published in\n1978\n. In the paper he records that he is a National Science Foundation Pre-Doctoral Fellow in the Department of Physics at Harvard University. The paper has the following Abstract\n[\n22\n]\n:-\nFour linearly independent classes of vector solutions to the generalised almost-\nKilling\nequation in the\nKerr\nspacetime are presented in terms of S A Teukolsky's radial and angular functions. The vector solutions which are asymptotic to the ten\nMinkowski\n-space\nKilling\nvectors are given.\nTaubes gives the following Acknowledgement:-\nI wish to thank William Press and Larry Smarr for their encouragement and advice and especially for comments on the manuscript. I thank James York for helpful discussions.\nThis paper was published in the same year that Taubes was awarded his M.S. by Harvard University. His second paper, published a year later in\n1979\n, is\nO\n(\n2\n)\nO(2)\nO\n(\n2\n)\nsymmetric connections in an\nS\nU\n(\n2\n)\nSU(2)\nS\nU\n(\n2\n)\nYang-Mills theory\n. He gives his address as Lyman Laboratory of Physics, Harvard University, and the Abstract states\n[\n23\n]\n:-\nThe general O\n(2)\nsymmetric Yang-Mills equations are derived. An ansatz for O\n(2)\nsymmetric merons is presented and it is shown that any connection in this ansatz will have SU\n(2)\ntopological charge density which is a sum of delta functions at points in a plane with weights ±\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n. It is shown that any connection in this ansatz will be\nC\n∞\nC^{∞}\nC\n∞\naway from these points.\nTaubes gives the following Acknowledgement:-\nThe author would like to express gratitude to Thordur Jonsson for his many suggestions and criticisms, and to Arthur Jaffe for suggesting this problem and serving as a constant source of advice.\nWe note that Thordur Jonsson was a fellow Ph.D. student of Taubes at Harvard.\nAlthough those mentioned in the acknowledgements of these two papers were a very positive influence on Taubes, perhaps the most important influence on the direction of his research came, however, through Erick Weinberg. Erick James Weinberg\n(\nborn\n29\nAugust\n1947)\nstudied at Manhattan College in New York City, then undertook research at Harvard University with Sidney Coleman as his advisor and was awarded a Ph.D. in\n1973\nfor his thesis\nRadiative corrections as the origin of spontaneous symmetry breaking\n. He gave a seminar in Harvard around\n1978\nwhich Taubes attended. Taubes said that in the seminar Weinberg\n[\n20\n]\n:-\n... posed a problem about the existence of solutions to the so-called vortex equations; these come from the Ginzburg-\nLandau\nmodel for superconducting vortices. I went home and stumbled on a proof that the postulated solutions did indeed exist. This was roughly in\n1978\n, and to my amusement, these same vortex equations have been with me in one form or another for the past thirty years.\nTaubes's solution to the problem posed by Weinberg was published in the paper\nArbitrary N-Vortex Solutions to the First Order Ginzburg-Landau Equations\n(1980)\n. He writes\n[\n24\n]\n:-\nWe prove that a set of N not necessarily distinct points in the plane determine a unique, real analytic solution to the first order Ginzburg-\nLandau\nequations with vortex number N. This solution has the property that the Higgs field vanishes only at the points in the set and the order of vanishing at a given point is determined by the multiplicity of that point in the set. We prove further that these are the only\nC\n∞\nC^{∞}\nC\n∞\nsolutions to the first order Ginzburg-\nLandau\nequations.\nIn January\n1980\nTaubes was awarded a Ph.D. for his thesis\nThe Structure of Static Euclidean Gauge Fields\nand graduated with the degree in June\n1980\n. He was then appointed as a junior fellow at Harvard University. Also in\n1980\n, Taubes published his first book, written jointly Arthur Jaffe, namely\nVortices and Monopoles: The Structure of Static Gauge Theories\n. For more information about this book, see\nTHIS LINK\n.\nThere was one further person who was a major influence on Taubes during his graduate studies at Harvard, namely\nRaoul Bott\n. He wrote\n[\n20\n]\n:-\nRaoul had his class on differential geometry and topology; I and myriad others were enthralled by his glorious lectures. I more or less finished writing my PhD thesis in the fall of\n1979\n, and with six months until the June\n1980\ngraduation, was at a bit of a loose end.\nRaoul Bott\nsuggested that I hang out at the Institute of Advanced Studies to talk with a differential equations specialist by the name of\nKaren Uhlenbeck\n. Steve Adler was kind enough to arrange an unofficial sort of stay, and so I headed down to Princeton.\nKaren\nhad a profound effect on my subsequent view of mathematics. She taught me\n(\nand is still teaching me\n)\na tremendous amount ...\nAfter his junior fellowship at Harvard ended in\n1983\n, Taubes was appointed as acting associate professor at the University of California at Berkeley. Two years later, in\n1985\n, he returned to Harvard as Professor of Mathematics. He held a National Science Foundation Mathematical Sciences Postdoctoral Fellowship\n(1984\n-\n1987)\n. His outstanding contributions quickly led to invitations to speak at major events. He delivered an invited address at the \"Special Session on Nonlinear Generalizations of Maxwell's Equations\" at the\nAmerican Mathematical Society\nMeeting at the University of Massachusetts at Amherst in October\n1981\n. He delivered an\nAmerican Mathematical Society\nInvited Address at the Joint Mathematics Meetings in Eugene, Oregon in August\n1984\n. Even more prestigious was the invitation to deliver a\n45\n-minute address at the International Congress of Mathematicians at Berkeley in\n1986\n; he gave the lecture\nGauge theories and nonlinear partial differential equations\n. He was also an invited speaker at the \"Symposium on the Mathematical Heritage of\nHermann Weyl\n\", held at Duke University in May\n1987\n, where he delivered the lecture\nModuli spaces and homotopy theory\n.\nClifford Taubes married Anne Elizabeth Warner who was born on\n24\nAugust\n1954\nin Boston, Massachusetts. Warner had attended Yale University, graduating with a B.A. in Russian studies,\ncum laude\n, in\n1977\n. She had then studied at Harvard Law School but became famous when she rowed eights for the United States in the\n1975\nWorld Rowing Championships in Nottingham, England\n(\nawarded silver\n)\n, in the\n1977\nWorld Rowing Championships in Amsterdam, The Netherlands, and in the\n1978\nWorld Rowing Championships at Lake Karapiro, New Zealand. In the\n1976\nSummer Olympics in Montreal, Canada, she was a member of the American eight-oared crew which won the bronze medal. She then had a career as a lawyer. Clifford and Anne Taubes lived in Belmont, Massachusetts, and had two children, Alice and Hannibal, but they later divorced. Alice Lorraine Taubes was born in September\n1986\nand Hannibal Taubes was born on\n27\nNovember\n1989\n.\nTaubes was awarded the\nAmerican Mathematical Society\n's\n1991\nOswald Veblen\nPrize in Geometry for his foundational work in Yang-Mills theory. The prize was presented to him at the Joint Mathematics Meetings in San Francisco. The Citation for the Prize begins\n[\n1\n]\n:-\nTaubes, since the time of his Ph.D. thesis and book on vortices and monopoles\n(\nco-authored with Arthur Jaffe\n)\n, has done as much as any individual to forge emerging physical concepts into powerful mathematical tools. The harnessing of Yang-Mills theory by mathematicians began with\nKaren Uhlenbeck\n's work on the singularities of, and curvature estimates for, the solutions of these equations. From this beginning, Taubes laid a geometric and analytical foundation for the study of the Yang-Mills functional. His initial paper - \"Self-dual Yang-Mills connections on non-self-dual\n4\n-manifolds\"\n(1982)\n- contained the technical basis for\nSimon Donaldson\n's first celebrated non-existence theorem.\nFor the full Citation and other details about the\nOswald Veblen\nPrize in Geometry, see\nTHIS LINK\n.\nThe\n1991\nOswald Veblen\nPrize in Geometry was the first of several major prizes awarded to Taubes. He received the\nAcadémie des sciences\n'\nÉlie Cartan\nPrize in\n1993\n, the Clay Research Award in\n2008\n, the\n2008\nNational Academy of Sciences\nAward in Mathematics, and the\n2009\nShaw Prize in Mathematics. For more information about these prizes, see\nTHIS LINK\n.\nWe mentioned above Taubes' first book\nVortices and Monopoles\n(1990)\nwritten in collaboration with Arthur Jaffe. He wrote several further books, all single authored:\nL\n2\nL^{2}\nL\n2\nmoduli spaces on\n4\n-manifolds with cylindrical ends\n(1993)\n;\nMetrics, Connections and Gluing Theorems\n(1996)\n;\nSeiberg Witten and Gromov invariants for symplectic\n4\n-manifolds\n(2000)\n;\nModeling Differential Equations in Biology\n(2000)\n; and\nDifferential Geometry: Bundles, Connections, Metrics and Curvature\n(2011)\n. He also published a video of \"The Seiberg-\nWitten\ninvariants\", the lectures delivered in San Francisco, California, January\n1995\n. For more information about these books, see\nTHIS LINK\n.\nThe\nNotices\nof the\nAmerican Mathematical Society\nasked D Kotschick, Ludwig-Maximilians-Universität München, and T S Mrowka, Massachusetts Institute of Technology to review the work done by Taubes up to\n2008\n. Their excellent overview appears in\n[\n10\n]\nand can be read at\nTHIS LINK\n.\nFrom Taubes' wish to live alone in the forest, we get some idea about his personality. He expanded on this in the interview\n[\n12\n]\n:-\nRight now I'm pretty much a hermit. I don't go to parties or functions. I'm not that comfortable in certain social gatherings. I don't make small talk. ... I interact with my students. I'm in my office almost all day. It's just that it's doing mathematics or talking about mathematics that interests me, not so much talking about what the latest movie is, or sports, or things like that. If you want to talk about mathematics, I'm happy to talk about that.\nTaubes does, however, have at least one passion in addition to mathematics and that is history. He said\n[\n12\n]\n:-\nI'm interested in history. Recent history. I'm interested in the\n1900\ns. It was such a horrible time. There were these horrible wars, WWI, WWII. Of course, all that happened because of what happened in the previous century. I'm interested in how people think, why do people come to conclusions they do, why the United States is in this kind of quagmire in Afghanistan, why do we keep making the same mistakes, why did we make the mistakes we made in Indo-China and Vietnam, why are we so stupid when we go out into the world. ... we go to Afghanistan, and we always say \"rescue them from the Taliban,\" which I think is sort of appreciated, actually. And then we end up staying there, and they end up hating us. ... The people end up hating us because without even knowing it, we are disrespectful to their culture, to their religion, to their beliefs without even knowing it because nobody knows anything about what other people think. And so we walk in there, and everybody ends up hating us. ... I want to know how people think and their history and culture. One thing I learned as a mathematician and teaching mathematics is that everybody's brain works differently. What seems obvious to me is not obvious to my students and to others. And when I say something, and I think I say something that's as clear as a bell, when they interpret it, it's not as clear as a bell. It has many different interpretations. And what's to my mind really fascinating and interesting about people is that everybody's brain works differently. And trying to learn what it is, you know, somebody who grew up in some mountain village in Afghanistan, how do they think. They're not dumb, it's the same human species. They just think differently. It's interesting to me, and I want to know why they think the way they do. So that's one of the reasons I read histories.\nLet us end by giving details of a couple of recent talks by Taubes. On\n17\nSeptember\n2022\nhe gave the lecture\nAnalysis Theorems in Gauge Theory\nat the conference \"Glimpses of Mathematics, Now and Then: A Celebration of\nKaren Uhlenbeck\n's\n80\nth Birthday\" which was held at the Institute for Advanced Study. His Abstract reads\n[\n25\n]\n:-\nIn Jules Verne's novel 'Journey to the Centre of the Earth', the intrepid explorers, having entered via Snaefellsjökull, are guided by the initials AS\n(\nfor Arne Saknussemm\n)\netched on rocks along the way. Here, with regards to gauge theory analysis, we find the initials KKU showing us the path forward. I will elaborate in my talk.\nOn\n23\nFebruary\n2024\nCliff Taubes spoke at the \"Harvard Gauge Theory and Topology Seminar\". The title of his talk was\nSpectral flow and reducible solutions to the massive Vafa-Witten equations.\nThe Abstract is as follows\n[\n26\n]\n:-\nThe Vafa-\nWitten\nequations\n(\nwith or without a mass term\n)\nconstitute a non-linear, first order system of differential equations on a given oriented, compact, Riemannian\n4\n-manifold. Because these are the variational equations of a functional, the linearised equations at any given solution can be used to define an elliptic, first order, self-adjoint differential operator. This talk will describe bounds\n(\nupper and lower\n)\nfor the spectral flow between respective versions of this operator that are defined by the elements in diverging sequences of reducible solutions.\n(\nThe spectral flow is formally the difference between the respective\nMorse\nindices of the solutions when they are viewed as critical points of the functional.\n)\nIn some cases, the absolute value of the spectral flow is bounded along the sequence, whereas in others it diverges. This is a curious state of affairs. In any event, the analysis introduces localisation and excision techniques to calculate spectral flow which may be of independent interest.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}