{
  "nome_completo": "Cyrus Colton MacDuffee",
  "nome_curto": "Cyrus Colton MacDuffee",
  "ano_nascimento": "1895",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacDuffee/",
  "lugar_nascimento": "Oneida, New York, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Cyrus Colton MacDuffee\n's parents were Cyrus Thompson MacDuffee\n(1842\n-\n1917)\nand Elisabeth Louise Sewirr\n(1856\n-\n1928)\n. Cyrus Thompson MacDuffee was born in Mcduffietown, Seneca, New York, on\n11\nFebruary\n1842\n. His parents were Harmon Harrison Mcduffee and Margaret S Warne. His first wife was Kate M Schwartz, his second wife was Anna Hubbard, then he married Elisabeth Louise Sewirr, the mother of Cyrus Colton MacDuffee. Cyrus Thompson MacDuffee died in Oneida, New York, on\n14\nJuly\n1917\n.\nMacDuffee was educated in New York and went to Colgate University to study for his first degree. This University had been founded in\n1820\nas the Baptist Education Society of the State of New York, and was known as the Hamilton Literary and Theological Institution from\n1823\nto\n1846\n. It was then named Madison University until given the name Colgate University in\n1890\n, named after the soap manufacturer William Colgate. MacDuffee graduated from Colgate University with a B.S. degree in\n1917\nand then went to Chicago University to study for a Master's degree. He was awarded an S.M. by Chicago in\n1920\n, continuing to study there for his doctorate advised by\nLeonard Eugene Dickson\n. He submitted his\n16\n-page thesis\nInvariantive Characterizations of Linear Algebras with the Associative Law Not Assumed\nin\n1921\nand was awarded a Ph.D. in\n1922\n. He published his thesis in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1922\n.\nOn\n7\nSeptember\n1921\n, MacDuffee married Mary Augusta Bean; they had four children, Robert Colton MacDuffee, Fredric Dearborn MacDuffee, Mary Elizabeth MacDuffee, and Helen Sewirr MacDuffee. MacDuffee was appointed as an instructor at Princeton University in\n1922\nand taught there for three years. During these years, he was promoted to assistant professor in\n1924\n. While at Princeton he published a number of papers including:\nOn transformable systems and covariants of algebraic forms\n(1923)\n,\nOn covariants of linear algebras\n(1924)\n,\nThe nullity of a matrix relative to a field\n(1925)\nand\nOn the complete independence of the functional equations of involution\n(1925)\n.\nMacDuffee left Princeton in\n1925\nand was appointed as an assistant professor at Ohio State University. He was promoted to associate professor at Ohio State in\n1929\nand then to full professor there in\n1933\n. He published his classic book\nThe Theory of Matrices\nin the same year he became full professor.\nYou can read an extract of a review of this book by Mark H Ingraham at:\nTHIS LINK\nHe continued to publish on rings and algebras with papers such as\nA correspondence between matrices and quadratic ideals\n(1927)\n,\nAn introduction to the theory of ideals in linear associative algebras\n(1929)\n,\nThe discriminant matrix of a semi-simple algebra\n(1931)\n, and\nMatrices with elements in a principal ideal ring\n(1933)\n. In\n1933\n, in a joint paper with Claiborne G Latimer, he published\nA Correspondence Between Classes of Ideals and Classes of Matrices\nin the\nAnnals of Mathematics\n. This paper contains the theorem which today is known as the Latimer-MacDuffee theorem. He made a considerable effort to build the graduate school at Ohio during his years there and during the first half of the\n1930\ns he was thesis advisor for six students who were undertaking research for a Ph.D.\nIn\n1935\nMacDuffee moved to the University of Wisconsin where he was appointed as a professor. He spent the rest of his career at Wisconsin becoming a major figure in the American mathematical scene. He gave long service to the\nMathematical Association of America\n. He was vice president in\n1942\n-\n44\n, president during\n1945\n-\n1946\nand served on the board of governors as an ex-president from\n1947\nto\n1952\n. He delivered the address\nAn Objective in Education\nto a joint meeting of the Wisconsin Section of the\nMathematical Association of America\n, the Mathematics Section of the Wisconsin Education Association and the Mathematics Club of Milwaukee at the Milwaukee State Teachers College on\n5\nMay\n1945\n. He gave the address\nThe Scholar in a Scientific World\nas retiring president in January\n1948\n.\nYou can read extracts from these two addresses at\nTHIS LINK\nWhen his period on the board of governors of the\nMathematical Association of America\ncame to an end he wrote the following letter to the Secretary-Treasurer Harry M Gehman:\nDear Gehman:\nThank you for your nice letter kicking me off the Board of Governors. I had figured that it was about due. As Julius Caesar once remarked, tempus sure does fugit and it doesn't seem long ago that I attended my first meeting of the Board. The members all seemed very ancient to me then, but now I undoubtedly seem ancient to the new members. I trust that you will have many re-elections to the office of Secretary-Treasurer until the newly elected members will say to one another, \"Do you see that old man over there with the cane and the long beard? That is Harry Gehman!\"\nSincerely\n,\nMac\nIn\n1945\nMacDuffee succeeded W D Cairns on the War Policy Committee. He was also a member of the National Research Council and served as secretary of the American Association for the Advancement of Science. He delivered the address\nMathematics curriculum in perspective\nto a symposium on mathematics instruction run by the American Association for the Advancement of Science at Indianapolis on\n27\nDecember\n1957\n.\nYou can read an extract from this address at:\nTHIS LINK\nIn addition, he was also a very active member of the\nAmerican Mathematical Society\nserving on its council as well as taking on the role of editor of the\nTransactions\n. In\n1952\nhe succeeded R E Langer as chairman of the Mathematics department at the University of Wisconsin.\nWe have already mentioned MacDuffee's\n1933\nbook\nThe Theory of Matrices\n. This was the first of four classic books that MacDuffee wrote, the other three being\nAn introduction to abstract algebra\n(1940)\n,\nVectors and matrices\n(1943)\nand\nTheory of equations\n(1954)\n.\nYou can read extracts of reviews of these books at:\nTHIS LINK\nThe extracts from MacDuffee's addresses give a good indication of his views on the teaching of mathematics. Because he was so involved in all aspects of teaching, it seems fitting to end this biography by quoting from\n[\n9\n]\npart of his description of a course he gave at the University of Wisconsin:-\nThe course which I have been giving at Wisconsin for the last couple of years is still entitled the Theory of Equations, but might more properly be called the Theory of Polynomials. This approach seems to unify the somewhat scattered topics in the theory of equations, and to give a deeper insight into the subject which is particularly valuable to those who go on in algebra and to those who contemplate teaching algebra.\nYou may not agree with me in bringing in about a week of the theory of numbers, but I have found it desirable, and after all the only way to check a pedagogical theory is to try it out. Only a little of the theory of numbers is required, the definitions of primes and units, scales of notation, the greatest common divisor algorithm, and the unique factorization theorem. The ideas are here presented in their simplest form free of computational difficulties.\nLater the corresponding concepts and theorems must be proved for polynomials. Just as a matter of experience I have found that students have trouble with this topic if it is first presented to them by way of polynomials. The introduction of this bit of number theory seems necessary in order to teach the polynomial theory regardless of its intrinsic interest. After this bit of number theory it is easy to attack the problem of finding the integral solutions of an equation having integral coefficients, and the rational solutions of an equation having rational coefficients.\nLet us consider for a moment the theorem that if an equation with integral coefficients has a rational solution, when this solution is expressed in lowest terms the numerator is a divisor of the constant term of the equation. The proof depends upon the theorem in number theory that if a number divides a product and is relatively prime to one of the factors, it must divide the other factor. This students are ordinarily asked to accept as obvious, but I have seen some able students quite disturbed by it. It is proved in our bit of number theory and students having had this week of number theory really seem to understand the proof.\nThe plan which I have been following is to start with polynomials over the rational field, later take up polynomials over the real field, and finally polynomials over the complex field. It is well to call attention to the properties of a field, but it is not necessary to call them postulates or to introduce the notion of an abstract field. Other fields, if introduced at all, are postponed until late in the course.\nThe high points in the theory of polynomials are the\nEuclid\nalgorithm, the unique factorization theorem, the representation of one polynomial as a polynomial in powers of a second, and the properties of the derivative in regard to multiple zeros. All of these results hold for every coefficient field but can first be introduced for polynomials over the rational field. At this point the decomposition of a rational function into a sum of partial fractions can be rigorously established. The students are familiar with the process from integral calculus and some of them are astonished when you point out that the universality of the method had not been proved to them.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}