{
  "nome_completo": "Daniel Jay Rudolph",
  "nome_curto": "Daniel Rudolph",
  "ano_nascimento": "1949",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rudolph/",
  "lugar_nascimento": "Sheridan, Wyoming, USA",
  "lugar_morte": "Fort Collins, Colorado, USA",
  "biografia": "Daniel Rudolph\n's parents were William Franklin Rudolph\n(1922\n-\n2000)\nand Betty Johnalou Waldner\n(1921\n-\n2004)\n(\nknown as Johnalou\n)\n. They had married on\n8\nAugust\n1943\nin Loveland, Colorado. Daniel, known to his friends and colleagues as Dan, was the middle of his parents' three sons, the other two being Gregory William Rudolph\n(8\nAugust\n1947\n-\n28\nNovember\n1981)\n, and the youngest James L Rudolph:-\nJohnalou loved playing the piano and singing in the choir. In later years, she loved quilting, writing poetry, genealogy, travel and she was an avid Scrabble player.\nThe family moved to Fort Collins when Dan was very young and he was brought up on the family farm there. He attended Fort Collins High School where he took a very active part in a full range of activities. For example, he was a member of the school Chemistry Club, the Physics Club, and the Computer Club. He also took part in the Flying Club and took part in student activities by being on the Student Council. His main academic interest at school was science and he was a semifinalist in the Westinghouse Science Talent Search. He graduated from Fort Collins High School in\n1968\nand, later that year, matriculated at the California Institute of Technology. When he entered Caltech he planned to major in theoretical physics.\nOf course, as part of his studies in theoretical physics, Rudolph studied mathematics courses and he soon decided that he wanted to be a mathematician rather than a theoretical physicist. He was awarded a bachelor's degree in\n1972\n, having been awarded, earlier in that year, Caltech's\nE T Bell\nPrize for Undergraduate Mathematics Research. During his undergraduate years at Caltech he had taken dance classes and modern dance performance would become a serious hobby later in his life. After graduating with a B.S., Rudolph went to Stanford University to undertake research. During the year\n1972\n-\n73\nhe studied for his Master's Degree and was awarded a M.S. in\n1973\n. The authors of\n[\n1\n]\nwrite:-\nDan arrived at Stanford in a period when it was an epicentre of revolutionary work in ergodic theory, following\nDon Ornstein\n's proof\n(\npublished\n1970)\nthat Bernoulli shifts of equal entropy are measurably isomorphic. Visitors and students congregated at Stanford, especially over the summers, developing the new methods, solving old problems and creating new ones, with long daily lunches in the sunshine outside the Student Union. Dan gravitated to the excitement, and wrote his Ph.D. thesis under\nDon Ornstein\n.\nRudolph's\n59\n-page thesis was entitled\nNon-Bernoulli Behavior of the Roots of K-Automorphisms\nand it earned him a Ph.D. in\n1975\n. His thesis advisor,\nDonald Samuel Ornstein\n, had a major impact on the direction of Rudolph's style of mathematics as the authors of\n[\n1\n]\npoint out:-\nIt is hard to overestimate\nOrnstein\n's influence in setting the direction of Dan's mathematics.\nErgodic theory\nfor decades had been dominated by functional analysis. The complementary style of ergodic theory in the Ornstein school was measure theory with deep combinatorial insight and barehanded invention. This style seemed for Dan as natural as breathing, and it was the core of his mathematical work.\nPerhaps this would be a good point to quote from Rudolph's introduction to his description of his own research by giving his description of ergodic theory\n[\n3\n]\n:-\nMy area of study is measurable dynamics, what is usually called 'ergodic theory'. This is a central branch of\ndynamical systems\nwith broad connections to smooth and low-dimensional dynamics, symbolic dynamics, topological dynamics, you name it, and to other branches of mathematics,\nfunctional analysis\n, geometry, combinatorics, number theory, you name it. The central assumption of dynamics is that one has a phase space and some group or semigroup of self-maps of that space that play the role of describing time evolution of the phase space.\nAfter the award of his doctorate, Rudolph spent the year\n1975\n-\n76\nas a postdoctoral fellow at the Hebrew University of Jerusalem. Before taking up this position he had given an invited lecture to the Rennes Conference in Dynamical Systems, which was held at the University of Rennes in France. At the Institute for Advanced Studies of the Hebrew University he gave a lecture series on 'Nonequivalence' in the spring of\n1976\n.\nDon Ornstein\nalso spent\n1975\n-\n76\nat the Hebrew University of Jerusalem. He writes\n[\n4\n]\n:-\nI was Dan's thesis advisor at Stanford in the\n70\ns. But more than being one of my best students, Dan became a lifelong friend and valued colleague ... After finishing his Ph.D., Dan joined me and a group of some of the very best people in Ergodic Theory for a year at the Institute of Advanced Study at the Hebrew University in Jerusalem. It was during that year that I realized what a formidable mathematician he was. There was a problem in particular that was central to several things on which we were working. Although we all tried very hard to solve it; Dan beat us all with a ingenious solution. Best of all, the year in Jerusalem allowed us to form an even closer friendship as he was very much a part of our family.\nIn the summer of\n1976\nRudolph returned to the United States, taking up a fellowship at the Miller Institute of the University of California at Berkeley. He held this position for two years before moving back to Stanford University where he was appointed as an assistant professor in\n1978\n.\nSeveral papers by Rudolph appeared while he was at the Hebrew University. For example, in\n1976\nthree papers were published:\nTwo Nonisomorphic K-automorphisms with Isomorphic Squares\n;\n(\nwith G Schwarz\n)\nOn attaining d-bar\n; and\nA Two-Valued Step Coding for Ergodic Flows\n. A further two papers appeared in\n1977\nand five in\n1978\n. Rudolph spent three years at Stanford\n(1978\n-\n81)\nbut during this time he stayed at the University of Maryland during the autumn of\n1979\nparticipating in the 'Special Year in Ergodic Theory and Dynamical Systems'. He was appointed as an Associate Professor at the University of Maryland in\n1981\nand was a Sloan fellow during the academic year\n1981\n-\n82\n. However, in November\n1981\ntragedy struck the family. Rudolph's older brother Gregory had studied at Fort Collins High School and Colorado State University, graduating with a degree in physical science in\n1969\n. He trained as a pilot, receiving several awards. He married Kristin Ellen Johnson on\n17\nMarch\n1968\n; they had two children, Lisa Michelle Rudolph\n(\nborn\n1970)\nand Scott Bowen Rudolph\n(\nborn\n1972)\n. On\n28\nNovember\n1981\nGregory, his wife Kristin, and their two children all died in a plane crash. The plane, a twin-engine Beechcraft, piloted by Gregory Rudolph crashed while attempting to land at Cedar City Airport.\nDan Rudolph spent\n23\nyears at the University of Maryland where he was appointed as a full professor in\n1985\n. The authors of\n[\n1\n]\ndescribe his years at Maryland, during which he:-\n... developed into one of the world leaders in ergodic theory. In addition to his many activities in Maryland, he made several long trips abroad to France, Poland and Israel, where his influence is still felt today. He organised many meetings and special year events at Maryland and turned it into one of the leading centres for research in classical ergodic theory.\nLet us give a little more details about the periods he spent at other universities. He was a Visiting Professor: at the University of Paris VI, September\n1988\n-March\n1989\n; at the Mathematics Institute of the University of Warwick, May-June\n1989\n; at the\nNicolaus Copernicus\nUniversity in Toruń, July\n1989\n; at the University of North Carolina at Chapel Hill, January-June\n1991\n; at the Université d'Aix-Marseille, January-June\n1993\n; and at the Université de François Rabelais in Tours, June-July\n1993\n. Of course he gave lectures at these universities and at many others during his career. We should mention in particular, however, the invited\n45\n-minute lecture he gave at the International Congress of Mathematicians in Beijing in\n2002\nentitled\nApplications of orbit equivalence to actions of discrete amenable groups\n. Of course, his contributions to the University of Maryland were many and substantial. The university honoured him for these contributions with their Distinguished Scholar Teacher award in\n1987\n.\nThe authors of\n[\n1\n]\ngive a good indication of his teaching style and his character:-\nWhether giving a mathematics talk or teaching a mathematics class; Dan was a performer. He was dynamic, in motion, on a stage. Perhaps leaning far forward on one foot, or pulling forward on a mime's invisible taut rope or striking a pose. This physical expression reflected his other life in modern dance. His relentless positivity was humbling and inspiring. In a problematic colleague, he would see the part to admire; with a problematic student, he would find some path to success. Dan did not write people off. He brought out the best in the people he knew. Dan was an early riser: a farm boy gets up and does his chores. For a while, he kept a sign up in his Maryland office: 'Eat problems for breakfast'. At a conference, he might wander off early to a coffeehouse, drink six shots of espresso, and return to meet groggy colleagues with a theorem.\nBefore\n1991\n, Rudolph would work at the university all day and then spend his evenings with friends or participating in his modern dance. In fact he would often perform with modern dance companies and a friend even choreographed a duet dedicated to Rudolph's parents entitled 'For Bill and Johnalou' in which he starred. In\n1991\nRudolph married Michelle Hyde; they had three children, Beatrice, Jonah and Layton. Rudolph was devoted to his children and evenings became a precious time to be spent with the children - no longer with friends or dance. Only when the children were both asleep in bed would he again go back to his mathematics research. Alvin Mayes, a colleague at the University of Maryland, wrote in\n[\n4\n]\nabout Rudolph as a dancer:-\nDan danced in the Maryland DC community from\n1980\nto about\n2000\nand a supporter through organizations like the Dance Place. There are two specific dance events that Dan felt very proud of. One was when he danced with his wife Michelle in a work called \"Allegro Brilliante\" and the second was when he had the opportunity to perform \"For Bill and Johnalou\"\n(\na work celebrating the love of his parents\n)\nin a special showing for his parents when they were visiting Maryland.\nRudolph published two important books. The first was\nFundamentals of measurable dynamics. Ergodic theory on Lebesgue spaces\n(1990)\n. Andrés del Junco writes in a review:-\nThe ergodic theory of measure-preserving transformations is a subject which has come of age only in the last thirty years. ...\n[\nRudolph's book\n]\nis the first systematic account which incorporates more recent insights and refinements, and this in itself makes it valuable. Specifically, it covers three topics not yet addressed by any text, to my knowledge. Firstly there is a self-contained treatment of the theory of\nLebesgue\nspaces, which is especially welcome, as the original paper by Rokhlin is notoriously difficult. Secondly there is a very thorough treatment of the Burton-Rothstein approach to\nOrnstein\n's theorem and\nKrieger\n's generator theorem via joinings. Particularly in the\nOrnstein\ntheory, this leads to cleaner, more powerful and more unified arguments as well as a strengthening of some of the results. Finally, there is an introduction to the author's own notion of minimal self-joinings, a versatile tool for the construction of counterexamples. More than this, however, this book reflects some of the author's own distinctive and powerful points of view, applied even to otherwise standard topics.\nThe second of his two books was written in collaboration with Janet Whalen Kammeyer. The book,\nRestricted orbit equivalence for actions of discrete amenable groups\n, was published in\n2002\n. A reviewer writes:-\nAs is evident from the title, this book generalizes the theory of restricted orbit equivalence to the setting of actions of discrete amenable groups. The work is deep and technically demanding. The authors have taken pains to organize the exposition to make it as accessible as possible. In particular, the background and overview material they have chosen to include and the organization of the book makes it appropriate for a variety of audiences.\nIn fact Janet Whalen Kammeyer was Rudolph's first Ph.D. student, writing her thesis\nClassifying the two point extensions of Bernoulli Z actions\nat the University of Maryland and receiving the degree in\n1988\n. She wrote\n[\n4\n]\n:-\nHe was an inspiring teacher, an encouraging Ph.D. advisor and a good friend and colleague. I believe I was his first Ph.D. student, earning my degree in\n1988\nat the University of Maryland. We later collaborated in writing the book, 'Restricted Orbit Equivalence for Actions of Discrete Amenable Groups'. I have many wonderful memories of Dan, including the fact that he was a modern dancer. There was one time when he recruited a handful of us graduate students to dance, as extras, in a production he was in. As you can imagine, we were a very funny group of non-dancers.\nIn\n2005\nRudolph was appointed to the Albert C Yates Endowed Chair in Mathematics in the College of Natural Sciences of Colorado State University. However, a second tragedy soon hit the Rudolph family. His health began to deteriorate and motor neurone disease was diagnosed. This dreadful illness, the one from which\nStephen Hawking\nsuffers, is also known as amyotrophic lateral sclerosis\n(\nALS\n)\nor Lou Gehrig's disease. Michael Boyle writes in\n[\n4\n]\nabout Rudolph's incredible courage and optimism in the face of his deteriorating health:-\nDan's relentless positivity was humbling, and inspiring. Over the years, greeted with some colleague's behaviour I thought unreasonable and demanding, he would find a way to be supportive of that colleague. Encountering a dubious student, he would find a way to help. Dan didn't write people off. That astonishing positivity extended to ALS. Hearing of a near tragic accident of one of my siblings, Dan told me he was lucky to have a transparent problem like ALS. I don't think so. Dan mentioned an ALS victim who had a list of things that made his life worth living. He was losing them one by one, and said would kill himself when there were only\n50\nleft. Dan said, when he lost one, he would find another one to put on the list.\nLet us end this biography by quoting from Michael Boyle\n[\n4\n]\n. This is a more informal way of saying many of the same things which are in the article\n[\n1\n]\n:-\nThe good thing about saying some words remotely is that there is a chance of getting through them. Dan's death would not be such a huge loss for us if he had not been such a remarkable human being. He leaves a hole like the Grand Canyon. But what a canyon!!. A part of that was mathematical brilliance. His forte was the creative act, the new construction. But he also built theories and had visions. He worked on many problems with many people. He liked to help. He had fun. At the Pingree Park conference in August, I mentioned a result I had figured out over a day or two. Instantly and with an air of great mischief, Dan said, \"Oh, I can do that.\" The University of Maryland created an honour called \"Distinguished Scholar Teacher\". Dan was the math department's first nominee, and first winner. There was a common element to Dan's dance, research talks and university teaching. He was a performer. Dan had a sense of upholding the needs of a community. At Maryland, in the math department he was the exemplary citizen. Calculus reform with an eye to helping minorities. Three years as graduate chair. Acting as chair for a year. Starting the Spiral program, an undergraduate REU oriented especially to students from traditionally black colleges and universities. Leading the department's application for an NSF VIGRE Grant FIVE TIMES, and succeeding on the fifth.\n(\nYou may need an academic background to appreciate the pain of that process.\n)\nAt his mathematical level, he could have avoided all that and just had fun with his research. He didn't. Dan's relentless positivity was humbling, and inspiring. Over the years, greeted with some colleague's behaviour I thought unreasonable and demanding, he would find a way to be supportive of that colleague. Encountering a dubious student, he would find a way to help. Dan didn't write people off.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Topology"
  ]
}