{
  "nome_completo": "Daniel Afedzi Akyeampong",
  "nome_curto": "Daniel Akyeampong",
  "ano_nascimento": "1938",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Akyeampong/",
  "lugar_nascimento": "Senya Beraku, British Gold Coast (now Ghana)",
  "lugar_morte": "Accra, Ghana",
  "biografia": "Daniel Akyeampong\nwas the son of Peter Napoleon Akyeampong and Charity Afful. He was the youngest of his parents' children, born in the coastal town of Senya Beraku about\n80\nkm from Accra. At the age of six, Daniel entered the Senya Beraku Local Council School in\n1945\n. He attended this school for eight years completing his primary education in\n1953\n.\nIn\n1954\nAkyeampong began his studied at Mfantsipim School in Cape Coast, Ghana. This school was founded in\n1876\nby the Methodist Missionary Society as the Wesleyan High School. It was named the Mfantsipim School in\n1905\nwhen it merged with another school. It was founded as a boys' boarding school and it has remained this type of school. When Akyeampong entered the school it had moved to a location on Kwabotwe Hill and the headmaster was Francis Lodwic Bartels, the first black headmaster and, rather significantly, he had himself been a pupil at the school. The boarding school had seven dormitories and Akyeampong lived in Balmer-Acquah, the first of the seven dormitories to be built. His abilities were recognised at this stage and he missed a year, going straight into Form\n2\n. He graduated in\n1959\nas the Best Student in Physical Sciences and Mathematics. Let us note that, in the middle of the five years that he spent at this school, Ghana gained independence from Britain on\n6\nMarch\n1957\n. The school had an \"Old Boys Association\" called MOBA, the Mfantsipim Old Boys Association. Akyeampong's MOBA\n57\nyear group became a second family to him.\nIn\n1960\nAkyeampong entered the University of Ghana and graduated with a B.Sc.\n(\nSpecial\n)\nin Mathematics in July. While at the university he was a member of Commonwealth Hall. The University of Ghana had been founded in\n1948\nas the University College of the Gold Coast, a college of the University of London, England. Although Ghana gained independence in\n1957\nit wasn't until\n1961\n, in the middle of Akyeampong's studies, that the university gained full independence. After graduating from the University of Ghana, Akyeampong went to England with the aim of undertaking research at the University of London.\nIn October\n1963\nhe entered the Imperial College of Science and  Technology, London, initially to take the diploma coursework in  mathematical physics before starting on his Ph.D. studies. However this turned out rather differently to what he expected as he related in\n[\n1\n]\n:-\nProfessor Abdus Salam taught the class in group theory. His lectures were very popular and one had to go early to find a seat. Following my successful completion of the coursework in the summer of\n1964\n, he invited me to his office one day, and told me about a new international centre for theoretical physics to be established in Trieste, Italy, which he was going to direct in the autumn of the same year, and the reason why he expected me to join him there. That was how in October\n1964\n, Jimmy Boyce, Ray Rivers and myself became the first postgraduate students of Salam in Trieste, and so had the honour of joining the post doctoral colleagues Bob Delbourgo and John Strathdee to become members of the group that was christened by Ms Jean Bouckley and Ms Miriam Lewis as \"the Salam Boys\".\nIn the same article, Akyeampong wrote about the research environment in the International Centre for Theoretical Physics, Trieste, where he became one of the first Fellows in\n1964\n-\n65\n[\n1\n]\n:-\nSalam worked hard to get the Centre known world-wide and we were naturally infected by his ceaseless dedication. We had our lunches together at the Mensa dei Ferrovieri with him at the table head, John and Ray at one side of the table and Bob and Jimmy on the other, with me deciding when to sit next to Ray or to Jimmy. These became physics working lunches - with paper napkins serving as writing equipment - and each session usually ended with several suggestions from Salam or Bob or John for us graduate students to pursue later. The excitement and enthusiasm Salam displayed were infectious; and later when I had the privilege to collaborate with Delbourgo, who was my unofficial supervisor, it became clear that he was indeed a chip off the old block.\nWe note that Abdus Salam\n(1926\n-\n1996)\nwas a Pakistani theoretical physicist who was awarded the\n1979\nNobel Prize in Physics for his contributions to the electroweak unification theory. For Akyeampong's assessment of what Abdus Salam and the International Centre for Theoretical Physics, Trieste, contributed to science in Africa, see\nTHIS LINK\n.\nWhile he was a research student, Akyeampong began publishing high quality papers. Here are a few examples of the papers he published around this time:\nThe scalar behavior of vector electrodynamics at high energy\n(1964)\n,\nThe scalar behaviour of charged vector meson theory at high energy\n(1965)\n,\nBaryon octet scattering in\nU\nÂ\n(\n12\n)\nU^{~}(12)\nU\nÂ\n(\n1\n2\n)\n(1965)\n,\nNucleon-nucleon scattering in\nU\nÂ\n(\n12\n)\nU^{~}(12)\nU\nÂ\n(\n1\n2\n)\n(1965)\n,\nMass formula for\nU\n6\nâ\nU\n6\nU_{6} \\otimes  U_{6}\nU\n6\nâ\nâ\nU\n6\nâ\n(1966)\n,\nThe quark model and elastic baryon-baryon scattering\n(1967)\n. These papers have his address as the International Atomic Energy Agency, International Centre for Theoretical Physics, Trieste.\nAkyeampong left Trieste in September\n1966\nand was awarded a Ph.D. in Mathematical Physics by the University of London in October\n1966\nwith his thesis\nApplications of higher symmetry groups to particle physics\n. As well as having Abdus Salam as an official supervisor, he also had the theoretical physicist Paul Taunton Matthews\n(1919\n-\n1987)\n, based at the University of London, as an advisor. In addition to the Ph.D., Akyeampong received a DIC\n(\nDiploma of Membership of Imperial College\n)\nin Mathematical Physics in November\n1966\n.\nReturning to Ghana late in\n1966\n, he was appointed as a Lecturer in Mathematics at the University of Ghana. He was a popular lecturer with his students who called him \"Prof Akye\". Soon after he started teaching there he met Charlotte Sally Newton in Volta Hall. They quickly became friends and they were married on\n11\nApril\n1970\n; they had two sons and one daughter, Angelo Ekow Oguah Akyeampong, Adrian Kofi Nuamah Akyeampong and Adeline Adwoa Akooley Akyeampong.\nNot only was he lecturing at the University of Ghana but he was also an Associate of the International Centre for Theoretical Physics, Trieste, from\n1967\nto\n1975\n, and a Senior Associate from\n1976\nto\n1993\n. He explained how this came about\n[\n1\n]\n:-\nWhen in September\n1966\nI went to say good-bye, I thought that was going to be the last time I would see\n[\nAbdus Salam\n]\n. However, a few months after my arrival in Ghana, I received a letter from him informing me that I had been made an associate of the Centre. As an associate, I spent three months at the Centre after nine months of teaching and research at home. I do remember very vividly the standard questions he would ask on each visit, when I showed up to report my presence. \"Oh, you are here?\" he would say. \"How is Ghana? Have you found a place to live? Where is your office?\" And then finally \"What are you working on?\" Then he would say \"Strathdee and I have been working on this interesting problem. Why don't you see him for more details?\" It was through the Associateship Scheme which was extended several times for me that I was able to maintain a close working relationship with him, and for that I shall be forever grateful.\nAt the University of Ghana, Akyeampong's career progressed steadily. He was promoted to Senior Lecturer in\n1972\n, to Associate Professor in\n1976\nand then, in\n1982\n, he became the first Ghanaian to be appointed as a full Professor of Mathematics. He had served as Head of the Department of Mathematics from his promotion to Associate Professor in\n1976\nand continued in this role until\n1983\n. After a short time he again served as Head of the Department of Mathematics, this time from\n1985\nto\n1988\n, followed by a third period from\n1994\nto\n1999\n. Between his second and third spells as Head of the Department of Mathematics, he served as Pro-Vice Chancellor of the University of Ghana\n[\n2\n]\n:-\nAs Pro-Vice Chancellor, he was the Chairman of the Academic Planning committee, the Estimates Committee, the Housing Committee, the Management Committee of the Housing Loan scheme, the Residence Board, the advisory Boards of all the Institutes in the University and the School of Performing Arts. He also served on several University Boards/Committees including the Inter-Faculty Committee on Regulations Governing the Bachelor's degree, just to name one.\nIn addition to his duties at the University of Ghana, he also took on several roles in different aspects of education in Ghana. For example: a Member of the National Council for Higher Education\n(1972\n-\n1980)\n; a Member of the Council for Scientific and Industrial Research\n(1975\n-\n1978\n,\n1992\n-\n1997)\n; the Honorary Secretary of the Ghana Academy of Arts and Science\n(1975\n-\n1978)\n; the President of the Mathematical Association of Ghana\n(1988\n-\n1994)\n; a member of the National Implementation Committee on Tertiary Education Reforms\n(1989\n-\n1992)\n; a representative of University of Ghana on the Ghana National Committee of the West African Examinations Council\n(1992\n-\n1996)\n; a member of the National Council for Tertiary Education\n(1993\n-\n2004)\n; the Chairman of the National Accreditation Board,\n(1994\n-\n2004)\n; the Vice-President of the Ghana Academy of Arts and Sciences\n(1995\n-\n1998)\n; the Chairman of the Committee on Evaluation of National Policy Objectives on Tertiary Education, Ministry of Education\n(1998)\n; the Chairman of the Committee to Review the Grading System for the Basic Education Certificate Examination\n(1999)\n; the Chairman of the Country Selection Committee for the Ford Foundation International Fellowship Program\n(2000\n-\n2002)\n; the Chairman of West African Examinations Council Committee set up to investigate the leakage of the\n2002\nBasic Education Certificate Examination; a member of the President's Committee of the review of Education Reforms in Ghana\n(2002)\n; and a member of the Board of Trustees of the Ghana Education Trust Fund\n(2003\n-\n2005)\n.\nHe was active in the\nAfrican Mathematical Union\n, and was an assistant editor of the Union's journal\nAfrika Matematica\n. He also served on the editorial board of\nDiscovery and Innovation\n, a journal of African Academy of Sciences. Perhaps his most prestigious position on the world scientific stage was his a membership of the Executive Board of the International Council for Science, Paris, France, from\n1993\nto\n1999\n, becoming elected its Vice President from\n1996\nto\n1999\n. He was also elected to the Mathematical Sciences Section of the World Academy of Sciences in\n1991\n. His election was based on his exceptional contributions to theoretical physics, symmetry groups in physics, and grand unified theories.\nIn addition to publishing\n26\npapers in leading journals and conference proceedings, he also published the book\nThe Two Cultures Revisited: Interactions of Science and Culture\n, which was the text of his\n25\nth J B Danquah Memorial Lecture published by the Ghana Academy of Arts and Sciences.\nTo understand something of his character, we quote from\n[\n2\n]\n:-\nProfessor Akyeampong was a man of principle! He was strict but fair in all he did. To some, he may have looked unapproachable but once you got to know him, you would discover that he was one with an unparalleled sense of humour, witty, fun loving and a loud infectious laughter. This jovial personality was a constant when he was with family, friends and his \"world famous\" MOBA\n57\ngroup. Professor Akyeampong was a devoted family man. To his three children, he imparted discipline, integrity, love and respect for all and a desire for knowledge - and Maths and Science! He would always supervise their Maths homework and would continually repeat, \"My dear friend, Mathematics is the easiest subject in the world\". Whether they believed that or not, was another story. His love for his wife was legendary. To sum it up in one sentence - she was his best friend and Ewuraba Sarah, as he affectionately called her, was his partner for life. They were blessed with\n45\nyears of marital bliss.\nAkyeampong broke a femur on Sunday\n21\nDecember\n2014\nand was admitted to Korle Bu hospital in Accra for surgery. All seemed to go well and he was back home for the\n2015\nNew Year celebrations. On\n24\nJanuary\n2015\n, however, he suffered a septic shock and was readmitted to Korle Bu hospital. After six weeks in the hospital, he died at the age of\n76\n.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics"
  ]
}