{
  "nome_completo": "Danuta Gierulanka",
  "nome_curto": "Danuta Gierulanka",
  "ano_nascimento": "1909",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gierulanka/",
  "lugar_nascimento": "Kraków, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Danuta Gierulanka\nwas the daughter of Kazimierz Gierula and Zofia Romanowska. Kazimierz Gierula\n(1884\n-\n1940)\nwas a railway construction engineer and a pioneer in the study of railway statistics. He spent most of his life in Kraków only living in Warsaw for a short period. He died during the Nazi occupation of Poland in World War II.\nIn addition to their daughter Danuta, Kazimierz and Zofia Gierula had a son Jerzy Kazimierz Gierula\n(\nborn\n20\nFebruary\n1917\nin Kraków, died\n14\nJanuary\n1975\nin Kraków\n)\n. In\n1935\n, Jerzy graduated from August Witkowski Gymnasium in Kraków and in the same year began studying physics at the Jagiellonian University. During the World War II he could not continue his studies at the University, so he worked as a watchmaker and continued his studies in secret. He obtained his first degree in\n1945\n, and a doctorate in physics\n1950\n. He became a leading expert in the physics of elementary particles and the atomic nucleus. From\n1969\nuntil his death he worked at the Kraków branch of the Institute of Nuclear Research, as the head of the Department of Nuclear Physics of High and Medium Temperatures.\nDanuta was eight years older than her brother. Her elementary and secondary education was in Kraków. She graduated from a Kraków Gymnasium in\n1927\nand later that year entered the Jagiellonian University in Kraków to study mathematics. At this time, the head of mathematics at the Jagiellonian University was\nStanisław Zaremba\nwho worked on partial differential equations and potential theory. Also teaching there was\nWitold Wilkosz\nwho was very versatile. He both researched and taught set theory, logic, topology, measure theory, mathematical analysis, analytic functions, differential equations, mathematical physics and algebra.\nWilkosz\nhad two assistants, Jan Józef Leśniak\n(1901\n-\n1980)\nand Irena Wilkosz\n(\nWilkosz\n's wife\n)\n.\nTadeusz Ważewski\nwas appointed to the Jagiellonian University as a docent in\n1927\n, the year Gierulanka began her studies.\nWażewski\nwas also interested in research in differential equations. Given the interests of those teaching at the University, it is not surprising that Gierulanka wrote the required thesis for her Master's Degree on differential equations. She graduated with the Master's Degree in\n1932\nhaving submitted the thesis\nPeriodic solutions of differential equations\n(\nPolish\n)\n. At this stage Gierulanka was not qualified to teach in schools, so she remained at the Jagiellonian University to study for the examinations for a teaching licence. She passed the examinations for the teaching licence in\n1933\nand began teaching mathematics, physics, chemistry and an introduction to philosophy in Gymnasiums.\nShe taught at the Gymnasium for girls run by the Benedictine Sisters in Staniątki near Niepołomice, about\n20\nkm east of the centre of Kraków. This well known girls' school was considered to be one of the finest in Galicia. She also taught at the Private Female Gymnasium Mary's Institute in Kraków. In\n1938\nshe began undertaking research at the Jagiellonian University for her doctorate advised by Władysław Heinrich. Heinrich\n(1869\n-\n1957)\nhad studied mathematics at the Polytechnic in Zurich\n(1889\n-\n1891)\n, then psychology and philosophy at the University of Munich\n(1891\n-\n1893)\nand philosophy at the University of Zurich\n(1893\n-\n1894)\n, where he defended his doctoral thesis in\n1894\n. In\n1897\nhe became an assistant at the Department of Experimental Physics at the Jagiellonian University and by\n1911\nhe was a full professor and head of the Department of Philosophy at the Jagiellonian University in Kraków.\nGierulanka had only been undertaking research for her doctorate for a year when World War II broke out. The German invasion of Poland on\n1\nSeptember\n1939\nbegan World War II. By the first week of September\n1939\nthe German army occupied Kraków. A German commander, SS-Sturmbannführer Bruno Müller, ordered Tadeusz Lehr-Spławiński, the rector of the Jagiellonian University, to convene a meeting of all the University's professors in the Collegium Novum on\n6\nNovember\n1939\n. Müller addressed the meeting saying that the Jagiellonian University had always been a \"source of anti-German attitudes.\" Soldiers entered and arrested\n183\nprofessors and others at the meeting. The University of closed and did not reopen until the war ended in\n1945\n.\nDuring the years of World War II, Gierulanka took jobs in commercial offices to support herself, and she supplemented this with giving private tuition. In January\n1940\n, Włodzimierz Gałecki began to organise a secret educational administration in Kraków. To see why the Poles took such an action, one need only look at a document produced by Heinrich Himmler, second in command to Hitler, on\n5\nMay\n1940\nwhich required all education in Poland to be in German and\n[\n8\n]\n:-\n... for the non-German population of the East there can be no type of school above the four-grade rudimentary school. The job of these schools should be confined to the teaching of counting\n(\nno higher than up to\n500)\n, the writing of one's name, and the teaching that God's commandment means obedience to the Germans, honesty, industry and politeness. Reading I do not consider essential.\nBoth Danuta Gierulanka and her brother Jerzy Gierula, whose studies at the Jagiellonian University were also interrupted by the war, took part in the secret education. This was a very brave action since if the authorities had discovered what they were doing the consequences would have been very severe. For example the mathematician\nWładysław Ślebodziński\n, who had taught at the Jagiellonian University until\n1921\n, was involved in giving underground lectures which led to him being imprisoned by the Germans in three concentration camps.\nAfter Kraków was liberated from the German occupiers, the Jagiellonian University reopened on\n19\nMarch\n1945\n. It was a difficult time with\n25\n% of the staff having been killed. Chairs had to be developed and staff appointed. Gierulanka was appointed as senior assistant in the Laboratory of Experimental Psychology. This, however, was not the only position she took on since she also taught mathematics at the Hugo Kołłątaj Lyceum in Kraków. In addition to these two posts, she also continued to undertake research for her doctorate. She submitted the thesis\nOn acquiring geometrical notions\n(\nPolish\n)\nwhich was examined by her advisor Władysław Heinrich, the psychologist Stefan Szuman, and the mathematician\nTadeusz Ważewski\n. Stefan Szuman had established the Department of Educational Psychology at the Jagiellonian University in\n1928\nand had been a full professor since\n1934\n.\nWażewski\nwas impressed by the thesis and questioned Gierulanka about her approach to teaching non-euclidean geometry and how she would identify students with outstanding mathematical talent. Szuman wrote in his report:-\nShe investigated the psychological process of forming clear and rigorous notions in geometry by the pupils.\nThe committee recommended the award of the doctorate with distinction.\nMaria Anna Zając takes a deep look at Gierulanka's doctoral thesis in\n[\n12\n]\n. She writes:-\nThe subject of the research - as Danuta Gierulanka wrote - emerged from her own professional experience, from everyday struggles with the craft of a mathematics teacher at school, motivating her to try to remedy the failures she experienced in working with students. It is a certain paradox - she stated at the beginning of her work in Kraków junior high schools - that mathematics, being a science of \"the simplest, most transparent and harmonious structure\", is in fact a particularly difficult school subject for the vast majority of students, and for some even hated. However, not every teacher, even if he or she is a so-called reflective teacher, undertakes scientific research to investigate the causes of his or her didactic difficulties and low effectiveness of teaching his or her subject.\nGierulanka's doctoral thesis was published as a book in\n1958\n. Here is an example of what she writes concerning \"acquiring the geometric concept of a square\" taken from\n[\n6\n]\n:-\nThus, for example, I will say that I have acquired the concept of a square if something has happened that can be described in outline more or less as follows: At first I had no idea what the word \"square\" meant. Thanks to certain procedures on the part of someone explaining the meaning of this name to me, i.e. pointing out in some direct or indirect way the object designated to me, I have reached such a state that I am able to do what I could not do before, namely, distinguish squares from non-squares, describe them, state their properties, construct them, and generally solve such problems concerning squares for the solution of which mechanical repetition of what was given to me as an explanation is not enough, but it is necessary to refer to some object that has become available to me; and in this case it is an object different from the words and actions of the person who taught me about it, but such an object to which these words and actions referred. In my experiences, however, I can precisely distinguish subjective moments of certainty, of a clear orientation towards something, of intellectual trust, moments that ultimately oppose decisively a certain sense of emptiness, uncertainty and instability that accompanied the first encounters with the name of the square in the initial stages of the described process. Despite the opposition of these subjective moments occurring in these extreme stages of the process, the transition from one to the other takes place rather gradually. I express the occurrence of moments characteristic of the final stage of the process by saying, for example: \"I know, I understand what a square is.\"\nRoman Ingarden\n(\nthe father of the physicist\nRoman Stanislaw Ingarden\nwho has a biography in this archive\n)\nhad been a major influence on Gierulanka from\n1946\nwhen he obtained his Master's Degree from the Jagiellonian University but from\n1950\nto\n1956\nhe was prevented from working at the university by the Communist authorities. It was suggested that Gierulanka should write a candidate's thesis on mathematical analysis incorporating her ideas concerning psychological research. In\n1953\nshe moved to the Department of Mathematical Analysis where she was appointed as an adjunct in the Chair of Mathematical Analysis. She did not write such a thesis for reasons she explained in the submission of her\nhabilitation\nthesis\n(\nsee below\n)\nand in\n1957\nshe returned to the Laboratory of Experimental Psychology. By this time Ingarden was working again at the University, made possible by a change in the political situation in\n1956\nwhen Nikita Khrushchev denounced Stalin's purges and ushered in a less repressive era in the Soviet Union. After one year in the Laboratory of Experimental Psychology, Gierulanka was appointed as an adjunct in the Chair of Philosophy, headed by Ingarden, and worked on writing an habilitation thesis. In\n1962\nshe submitted the habilitation thesis\nThe problem of specificity of mathematical cognition\n(\nPolish\n)\nwhich was published as\n[\n7\n]\n. As part of this submission, she was required to write 'Information on my previous scientific work' which is an interesting document:-\nInfluenced by lectures and seminars conducted by Prof R Ingarden, in which I participated regularly since\n1946\n, I was getting an even broader view of the philosophical problematics related to my psychological work. A problem in which I have taken stronger and stronger interest since\n1948\nis the problem of specificity of mathematics; in its solution I would see a natural complement of the work on acquiring geometrical notions.\n[\nThis work\n]\ngave an idea - thanks to investigation of the course of suitable psychical thought processes - only about psychological sources of the paradoxical opposition between the fundamental clarity and comprehensibility of mathematics and the actual state of its being comprehended. To explain it fully it is necessary to realise what the specific character of mathematics, and of the cognitive means it employs, consists of. Seeing Cartesian mental intuition and what is called 'clara et distincta perceptio' as a cognitive activity typical for mathematics, I analysed this notion. ... Another kind of cognitive processes very relevant for mathematical cognition are processes of understanding. I have been concerned with the problems of understanding since\n1951\n, conducting for\n2\nyears research in the Laboratory of Experimental Psychology concerning primarily understanding of texts. With the subsidy from Scientific Pedagogical Society I conducted research parallel to this, concerning learning mathematics from textbooks, including analysis and criticism of school textbooks in geometry in use at that time. ... Because of the financial difficulties of the Scientific Pedagogical Society the research ceased, and the partial results obtained were not published; those concerning textbooks became obsolete when change occurred.\nHer habilitation thesis was examined by\nZofia Krygowska\n, Izydora Dąmbska, Tadeusz Czeżowski and Roman Ingarden. The authors of\n[\n4\n]\nwrite:-\nIn her habilitation, Gierulanka addressed the problem of mathematical cognition as a philosopher, although she also used some previously collected psychological materials. ...  Gierulanka analysed mathematical perception and deduction from the phenomenological standpoint and described attempts at systematisation and unification of mathematics. She did not consider reduction to set theory as true solution of the problem of unification of mathematics. She criticised Bourbakist mathematics, blaming it for, among other things, being arbitrary in constructing systems of axioms and making unnatural generalisations. However, she saw some possibilities for applying the notion of mathematical structure\nThis philosophy habilitation should have meant that Gierulanka would be appointed to a permanent position in the Department of Philosophy, but this did not happen. She returned to the Laboratory of Experimental Psychology where she worked until she retired in\n1971\n. It is claimed in\n[\n11\n]\nthat, although Ingarden had been allowed to return to the University in\n1956\n, the Communist authorities still tried to make things difficult for him and for Gierulanka. She never obtained a full professorship and it is thought that this was due to pressure from the authorities.\nGierulanka continued to keep close contacts with Roman Ingarden whose grandson Andrzej Ingarden writes in\n[\n10\n]\n:-\nI remember that weekly visits\n[\nby Roman Ingarden\n]\nto our home were always combined with scientific visits with Ms Gierulanka, who lived one floor below us. These were always connected. Ever since Ms Gierulanka moved into the same building, my Grandfather would go and spend an hour with her first, because they always had something to fix, discuss and plan.\nAfter her habilitation, Gierulanka published several articles, written in Polish, such as:\nThe epistemological position of understanding\n(1964)\n;\nThe role and tasks of descriptive psychology of consciousness\n(1968)\n; and\nUnderstanding some cultural products\n. After the death of Roman Ingarden in\n1970\n, she wrote several articles about him and about his work. These include\n(\nwritten in Polish\n)\n:\nDirections of Roman Ingarden's philosophical research\n(1964)\n;\nThe philosophy of Roman Ingarden. An attempt to penetrate the structure of his whole work\n(1972)\n;\nOutline of the internal structure of Roman Ingarden's philosophical work\n(1972)\n;\nThe shape of the phenomenological method in Roman Ingarden's philosophy\n(1989)\n; and\nOn the Sources of the Relationship Between Ingarden's and Husserl's Philosophy: A Position on Reduction\n(1995)\n. She was also one of the three authors of the English language paper\nThe Philosophic Work of Roman Ingarden\n(1977)\n, and of the single author papers\nL'accomplissement de l'oeuvre de R Ingarden\nⓉ\n(\nThe completion of R Ingarden's work\n)\n(1980)\nand\nIngarden's Philosophical Work\n(1989)\n.\nGierulanka also did editorial work and translated several books. She translated some of Ingarden's works from German to Polish and was an editor of his collected works. She translated from German to Polish the ﬁrst and second volume of Edmund Husserl's\nIdeen zu einer reinen Phänomenologie und phänomenologischen Philosophie\nⓉ\n(\nIdeas for a reintroduction of phenomenology and phenomenological philosophy\n)\n, and in collaboration with her brother Jerzy Gierula she made a Polish translation of Edith Stein\n'\ns doctoral thesis\nZum Problem der Einfühlung\nⓉ\n(\nThe problem of empathy\n)\n.\nLet us give two further memories of Gierulanka taken from\n[\n10\n]\n. Maria Gołaszewska writes:-\nDanuta Gierulanka was very attentive around Ingarden, planning, helping him out. I think it's worth mentioning that Ingarden's favourite hobby was developing photos. He simply liked taking pictures and having models to photograph. Not classic models, but for example ... Gierulanka.\nAndrzej Półtawski writes:-\nDanuta Gierulanka was a great lecturer and a very clever head. She taught us psychology, but you know that Gierulanka had a master's degree in mathematics, a PhD in psychology and a habilitation in philosophy. These were really elaborate, well-prepared lectures with a certain analytical flair.\nGierulanka had continued to undertake research after her retirement in\n1971\nand, right up to her death at the age of\n85\n, she had continued to publish. She felt, however, that she had been poorly treated\n[\n4\n]\n:-\nShe retired with the sense of injustice: the programme of doctoral studies in university teaching for assistants in various academic disciplines was not launched and the university authorities did not show recognition of her work and achievements.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}