{
  "nome_completo": "David Moncrieff Johnstone",
  "nome_curto": "David Johnstone",
  "ano_nascimento": "1877",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Johnstone/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "David Johnstone\n's father was  John Johnstone\n(\nborn in Edinburgh about\n1844)\nwho was a printer compositor. His mother was  Helen Johnstone\n(\nborn Perth, Perthshire about\n1848)\n. David Johnstone had an older brother James  who, like his father, became a printer compositor.\nDavid Johnstone entered St Leonard's Public School, Edinburgh, in\n1883\n. He spent seven years at the school, followed by five years at George Heriot's Hospital School, Edinburgh. In this latter school he was in the same class as\nDrysdale\nand the two became friends\n(\nthey went together when they first matriculated at Edinburgh University and appear in the Matriculation Album as consecutative entries\n)\n. Johnstone gave his home address as\n27\nSt Leonard Street when he first matriculated.\nAt George Heriot's, Johnstone sat the Leaving Certificate examinations and passed at Higher level English, Mathematics, French, and Latin\n(\nsome in June\n1894\n, some in June\n1895)\n. After having passed the Preliminary Examination, he first matriculated at Edinburgh University in October\n1895\n. He studied Mathematics and Natural Philosophy\t at the Ordinary level between October\n1895\nand April\n1896\n. In the following session he took courses in Logic, Psychology and Chemistry. He studied Latin during the summer of\n1896\nand\n1897\n. He thejn concentrated on Mathematics and Natural Philosophy, taking these at Intermediate Honours level in\n1896\n-\n97\nand\n1897\n-\n8\nrespectively, then both at Advanced Honours level in\n1898\n-\n99\nand\n1899\n-\n1900\n. He graduated with an M.A. with Second Class Honours in Mathematics and Natural Philosophy in April\n1900\n. He was awarded a B.Sc.\n(\nPure\n)\nin the same year.\nJohnstone joined the\nEdinburgh Mathematical Society\nin December\n1900\nafter he graduated. By this time he was a Science Master at Spier's School, Beith. He soon moved back to the school where he himself had studied when appointed to George Heriot's School. He taught there for over\n20\nyears before moving to the Provincial Training College, Edinburgh on\n1\nOctober\n1925\n.\nArchibald Milne was the Principal Lecturer in charge of Mathematics at Edinburgh Provincial Committee for Teacher Training, that is Moray House; he was assisted by a lecturer who taught both Mathematics and Science. In the Minutes\n[\n4\n]\n(\ndated\n20\n/\n7\n/\n1925)\nit reported that Dr Milne was recommended for the appointment of Depute Director of Studies. This post arose from the agreement between the University Court and the National Committee\n(\nto which Edinburgh Provincial Committee for Teacher Training reported and made recommendations\n)\nto jointly appoint to the post of Professor of Education and Director of Studies.\n(\nThe first appointee to this post was Professor Godfrey Thomson\n)\n.\nThe same Minutes note that for the post of Principal Lecturer Mathematics five candidates had been interviewed. 'Mr David M Johnstone M.A. B.Sc., Mathematical Master in George Heriot's School' was recommended to the Central Executive Committee for appointment. His pay scale was £\n650\nin £\n20\nincrements to £\n750\n.\nMr Johnstone remained at Moray House as Principal Lecturer Mathematics until\n1935\n. The Minutes of\n16\n/\n10\n/\n1935\nreport that Mr Johnstone had died:-\nMr Johnstone was Master of Arts of Edinburgh University with Honours in Mathematics and Natural Philosophy, and held also the B.Sc. degree. After twenty five years' experience as a teacher he was appointed to Moray House Staff on\n1\nOctober\n1925\nas Principal Lecturer in Mathematics.\nHe proved himself to be a gifted lecturer and a wise and tactful member of the Methods staff. In the social and corporate life of the College he took a most active and ungrudging share. For his strong integrity of character and his happy personality he was held in high regard by the Provincial Committee, by all his colleagues, and to an exceptional degree by his students\n.\nMr William Taylor was recommended as the appointee to replace Mr Johnstone.\nJohnstone joined the\nEdinburgh Mathematical Society\nin December\n1900\nafter he graduated. By this time he was a Science Master at Spier's School, Beith. He remained a member of the Society for the rest of his life.",
  "math_areas": []
}