{
  "nome_completo": "David Bryant Mumford",
  "nome_curto": "David Mumford",
  "ano_nascimento": "1937",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mumford/",
  "lugar_nascimento": "Worth, Sussex, England",
  "lugar_morte": null,
  "biografia": "David Mumford\n's father, William Mumford, was English and\n[\n2\n]\n:-\n... a visionary with an international perspective, who started an experimental school in Tanzania based on the idea of appropriate technology...\nMumford's father worked for the United Nations from its foundations in\n1945\nand this was his job while Mumford was growing up. Mumford's mother was American and the family lived on Long Island Sound in the United States, a semi-enclosed arm of the North Atlantic Ocean with the New York- Connecticut shore on the north and Long Island to the south.\nAfter attending Exeter School, Mumford entered Harvard University. It was at Harvard that Mumford first became interested in algebraic varieties. He relates in\n[\n2\n]\n:-\n... a classmate said \"Come with me to hear\nProfessor Zariski\n's first lecture, even though we won't understand a word\" and\nOscar Zariski\nbewitched me. When he spoke the words \"algebraic variety\", there was a certain resonance in his voice that said distinctly that he was looking into a secret garden. I immediately wanted to be able to do this too. It led me to\n25\nyears of struggling to make this world tangible and visible.\nAfter graduating from Harvard, Mumford was appointed to the staff there. He was appointed professor of mathematics in\n1967\nand, ten years later, he became Higgins Professor. He was chairman of the Mathematics Department at Harvard from\n1981\nto\n1984\nand MacArthur Fellow from\n1987\nto\n1992\n.\nMumford's greatest honour was being awarded a\nFields Medal\nat the International Congress in Vancouver in\n1974\n.\nTate\ndescribes the work that Mumford was awarded the Fields Medal for in\n[\n6\n]\n. He writes:-\nMumford's major work has been a tremendously successful multi-pronged attack on problems of the existence and structure of varieties of moduli, that is, varieties whose points parameterise isomorphism classes of some type of geometric object. Besides this he has made several important contributions to the theory of algebraic surfaces. ... Mumford has carried forward, after\nZariski\n, the project of making algebraic and rigorous the work of the Italian school on algebraic surfaces. He has done much to extend\nEnriques\n' theory of classification to characteristic p >\n0\n, where many new difficulties appear.\nTate\ngoes on to explain in more technical terms Mumford's work in\n[\n6\n]\nand it is also described in\n[\n4\n]\n. In the\n1980\ns however, the direction of Mumford's work changed dramatically. He writes in\n[\n1\n]\nthat, after his first wife Erika died:-\n... I turned from\nalgebraic geometry\nto an old love - is there a mathematical approach to understanding thought and the brain? This is applied mathematics and I have to say that I don't think theorems are very important here. I met remarkable people who showed me the crucial role played by statistics, Grenander, Geman and\nDiaconis\n.\nThe article\n[\n3\n]\nis a survey of this new area that Mumford has worked on. It makes fascinating reading and we quote here some comments from the introduction which give an idea of the scope of the ideas covered:-\nThe term \"Pattern Theory\" was introduced by Ulf Grenander in the\n70\n's as a name for a field of applied mathematics which gave a theoretical setting for a large number of related ideas, techniques and results from fields such as computer vision, speech recognition, image and acoustic signal processing, pattern recognition and its statistical side, neural nets and parts of artificial intelligence. ... The problem that \"Pattern Theory\" aims to solve ... may be described as follows \"the analysis of the patterns generated by the world in any modularity, with all their naturally occurring complexity and ambiguity, with the goal of reconstructing the processes, objects and events that produced them and of predicting these patterns when they reoccur\".\nMumford has received many honours in addition to the Fields Medal. He received an honorary D.Sc. from the University of Warwick in\n1983\n, an honorary D.Sc. from the Norwegian University of Science and Technology in\n2000\n, and an honorary D.Sc. from Rockefeller University in\n2001\n. He was elected to the\nNational Academy of Sciences\nin\n1975\n, elected an Honorary Fellow of the Tata Institute of Fundamental Research in\n1978\n, elected a Foreign Member of\nAccademia Nazionale dei Lincei\n, Rome, in\n1991\n, elected an Honorary Member of\nLondon Mathematical Society\nin\n1995\n, elected to the American Philosophical Society in\n1997\n, and elected a Foreign Member of the\nRoyal Society\nin\n2008\n. He was awarded the Shaw Prize in\n2006\n, the Steele Prize for Mathematical Exposition by the\nAmerican Mathematical Society\nin\n2007\n, and the Wolf Prize in\n2008\n. He was elected President of the\nInternational Mathematical Union\nin\n1995\n, a position he held until\n1999\n.\nLet us mention the book\nIndra's Pearls: The Vision of Felix Klein\nwhich he published with Caroline Series and David Wright in\n2002\n. Vasily Chernecky begins a review of this remarkable book as follows:-\nFelix Klein\n, one of the great nineteenth-century geometers, discovered in mathematics an idea prefigured in Buddhist mythology: the heaven of Indra contained a net of pearls, each of which was reflected in its neighbour, so that the whole Universe was mirrored in each pearl.\nKlein\nstudied infinitely repeated reflections and was led to forms with multiple co-existing symmetries, each simple in itself, but whose interactions produce fractals on the edge of chaos. For a century these images, which were practically impossible to draw by hand, barely existed outside the imagination of mathematicians. However in the\n1980\ns the authors embarked on the first computer exploration of\nKlein\n's vision, and in so doing found further extraordinary images of their own. The book is written as a guide to actually coding the algorithms which are used to generate the delicate fractal filigrees, most of which have never appeared in print before.\nFinally, to get a feeling for his current interests we mention a lecture he delivered on\n11\nFebruary\n2008\n. The lecture was entitled\nWhat's an infinite dimensional manifold and how can it be useful in hospitals?\nand Mumford gave the following abstract:-\nMorphing faces has become a popular game but what is the math behind it? One way to view it is as the construction of geodesics on an infinite dimensional manifold of shapes. I will try to explain what this means, using simple examples and then go on show why it is proposed as a new tool in the diagnosis of medical conditions.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}