{
  "nome_completo": "David Harold Blackwell",
  "nome_curto": "David Blackwell",
  "ano_nascimento": "1919",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blackwell/",
  "lugar_nascimento": "Centralia, Illinois, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "David Blackwell\n's parents were Grover Blackwell and Mabel Johnson and David was the oldest of their four children. Grover Blackwell worked for the Illinois Central Railroad and his job consisted of looking after the locomotives while Mabel looked after the family bringing up David, his two brothers and one sister.\nAs an African American David might well have attended one of the two racially segregated elementary schools in Centralia but, in his own words, he was fortunate to attend an integrated school. He said in an interview\n[\n2\n]\n:-\nSouthern Illinois was probably fairly racist even when I was growing up there. The school I went to was integrated, but there was also a segregated white school in the same town. There were in fact two segregated schools, one that only blacks could attend and one that only whites could attend. But I was not even aware of these problems - I had no sense of being discriminated against. My parents protected us from it and I didn't encounter enough of it in the schools to notice it.\nHe had a mixed reaction to mathematics at school. Algebra and trigonometry were not all that attractive to Blackwell:-\nI could do it and I could see that it was useful, but it wasn't really exciting.\nOn the other hand he quite enjoyed geometry, having a good teacher of the suject at high school, and he applied his growing mathematical skills to games such as noughts and crosses where he began to analyse whether there was always a winning strategy for the first player.\nIn\n1935\n, at age\n16\n, Blackwell entered the University of Illinois. His interest in mathematics continued to grow\n[\n2\n]\n:-\nThe most interesting thing I remember from calculus was\nNewton\n's method for solving equations. That was the only thing in calculus I really liked. The rest of it looked like stuff that was useful for engineers in finding moments of inertia and volumes and such.\nIt was a course on real analysis, based on\nHardy\n's\nPure Mathematics\n, rather than the calculus which really turned him on to a career in mathematics\n[\n2\n]\n:-\nThat's the first time I knew that serious mathematics was for me. It became clear that it was not simply a few things that I liked. The whole subject was just beautiful.\nUniversity was not to be an easy time for Blackwell, however, for he soon realised that his father was having to borrow money to finance his studies. He then took jobs such as dishwashing to help earn money but at the same time he took courses over the summers and was able to graduate with a B.A. in\n1938\nafter three years of study. After graduating Blackwell continued to study at the University of Illinois for his Master's degree which was awarded in\n1939\nand then for his doctorate supervised by Joseph\nDoob\n. This was awarded in\n1941\n, when Blackwell was still only\n22\nyears old, for a thesis on Markov chains.\nAt this point Blackwell received a prestigious one year appointment as Rosenwald Postdoctoral Fellow at the Institute for Advanced Study in Princeton. This, however, led to problems over the fact that Blackwell was a black African American. The standard practice was to have Fellows of the Institute become honorary Faculty members of Princeton University but, in Blackwell's case, this caused a problem. At that time Princeton University had never had a black undergraduate student much less a black Faculty member and this produced opposition within the University. The President of the University wrote to the Director of the Institute for Advanced Study saying that the Institute were abusing the hospitality of the University with such an appointment. Fortunately at the time Blackwell was not fully aware of the problems his appointment was causing.\nWhile at the Institute, Blackwell started to look for academic appointments. He made enquiries at each of the\n105\nblack Colleges to see if any post were available. One might see the fact that he concentrated on obtaining a job at a black College as a sign that he was aware of the powerful discrimination against African Americans, but he has later explained that this was not quite how he saw it; rather he simply accepted that a black teacher would be limited to teach at a black College. He did seek a position at the University of California at Berkeley, however, and was interviewed by\nNeyman\nfor the post.\nNeyman\nstrongly support his appointment but others had far too strong prejudices to allow Blackwell to be appointed. He was offered a post at the Southern University at Baton Rouge which he held in\n1942\n-\n43\n, followed by a year as an Instructor at Clark College in Atlanta.\nThe pinnacle of achievement for an African American academic in those days was an appointment at Howard University. Blackwell said himself that Howard\n[\n2\n]\n:-\n... was the ambition of every black scholar.\nAppointed as an Instructor in\n1944\n, it took him only three years to be promoted to full professor and Head of the Department of Mathematics. In the year of his appointment Blackwell married Ann Madison. He served as Head until\n1954\nwhen he left Howard to take up a professorship at the University of California at Berkeley. By this time Blackwell's interests had turned towards statistics and in\n1956\nhe became Chairman of the Department of Statistics.\nIt was a lecture in\n1945\nby Abe Girshick of the Department of Agriculture on sequential analysis which sparked Blackwell's interest in statistics. He began to collaborate with Girshick and in\n1954\nthey jointly published the book\nTheory of Games and Statistical Decisions\n. Blackwell's interest in the theory of games had been heightened during three summers between\n1948\nand\n1950\nwhen he worked at the RAND Corporation. One of the \"games\" he studied there was that of two duellists who approach each other with a loaded pistol. If one fires he has to continue to approach the other. What is the optimal moment for the duellist to shoot? In another variation of the \"game\" the guns are silent and so a player does not know if his opponent has fired unless he is hit. The Cold War did much to promote interest in this type of game, and Blackwell soon became a leading expert.\nIn\n1954\nBlackwell was invited to address the International Congress of Mathematicians in Amsterdam. In the following year he was elected President of the Institute of Mathematical Statistics. Many more honours were to come his way. He was elected Vice President of the\nAmerican Statistical Association\n, Vice President of the International Statistical Institute, and Vice President of the\nAmerican Mathematical Society\n. In\n1965\nhe was elected to the\nNational Academy of Sciences\n. He received the\nJohn von Neumann\nTheory Prize from the Operations Research Society of America in\n1979\nfor his work in dynamic programming and the\nR A Fisher\nAward from the Committee of Presidents of Statistical Societies in\n1986\n.\nIn\n[\n2\n]\nBlackwell said that the work which gave him the most satisfaction was\nInfinite games and analytic sets\nwhich he published in the Proceedings of the\nNational Academy of Sciences\nin\n1967\n. He had found a game theory proof of the\nKuratowski\nReduction theorem and connecting the areas of game theory and topology\n[\n2\n]\n:-\n... gave me real joy, connecting these two fields that had not been previously connected.\nBlackwell remained at the University of California until he retired in\n1989\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}