{
  "nome_completo": "Derrick Henry Lehmer",
  "nome_curto": "Derrick Henry Lehmer",
  "ano_nascimento": "1905",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lehmer_Derrick/",
  "lugar_nascimento": "Berkeley, California, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Derrick Lehmer\nwas known as Dick. His parents were Clara Eunice Mitchell and\nDerrick Norman Lehmer\n(\noften called DNL to distinguish him from his son DHL, or as we noted Dick\n)\n. DNL was a professor of mathematics at Berkeley who was interested in number theory and mechanical computation. Eunice and DNL had five children so Dick grew up in a large family. He attended school in Berkeley but it was his father who had the greatest influence on him, and even at a very young age he became involved in his father's ideas in number theory and particularly his interest in constructing machines to assist with number theory calculations.\nTo give an indication of his father's work during the time that Dick was growing up, let us mention that DNL published\nFactor table for the first ten millions\nwhen Dick was four years old, and\nList of prime numbers from\n1\nto\n10006721\nwhen he was nine. Dick was fascinated to listen to his father describe mathematical ideas to him even at this age. After completing his school education, Dick entered Berkeley to study physics. He was now highly involved with his father's ideas so on the one hand he studied physics courses, while on the other hand he helped his father both with the number theory computations he was undertaking and with the mechanical ideas that he was developing to help him make these calculations.\nOne project that DNL worked on during the time that Dick was an undergraduate was his work on\nFactor Stencils\nwhich was published in\n1929\n. This gave a method of factorising a number using cards with holes punched in them and it was later described by Dick Lehmer as follows:-\nSince every quadratic residue\nR\nR\nR\nof a number\nN\nN\nN\nis also a quadratic residue of every possible factor of\nN\nN\nN\n, it follows that the problem of factoring a number\nN\nN\nN\nis hereby reduced to the discovery of an adequate number of quadratic residues\nR\nR\nR\nof\nN\nN\nN\nand the superposition of the corresponding stencils to reveal those few primes having these residues\nR\nR\nR\n.\nWhile he was a physics undergraduate, Dick helped his father to produce the stencils. They worked with residues\nR\n<\n240\nR < 240\nR\n<\n2\n4\n0\nand covered\n5000\nprimes which includes all primes up to\n48611\n. This enabled integers up to\n4861\n1\n2\n=\n2363029321\n48611^{2} = 2363029321\n4\n8\n6\n1\n1\n2\n=\n2\n3\n6\n3\n0\n2\n9\n3\n2\n1\nto be factored. While DHL and his father were working on the stencils another undergraduate at Berkeley, Emma Trotskaia who was a mathematics student studying DNL's courses, assisted them. Emma would soon become Dick's wife and Dick and\nEmma Lehmer\nwould become one of the most famous husband and wife mathematics teams.\nIn\n1927\nLehmer graduated from Berkeley with a B.A. degree in Physics and he went to the University of Chicago to undertake research for his doctorate in mathematics with\nL E Dickson\nas his supervisor. In the following year\nEmma Trotskaia\ngraduated with a B.A. degree with honours in Mathematics and, just prior to her taking her final examinations, Dick and\nEmma Lehmer\nwere married. Once\nEmma\n's exams were over, they set out on a tour which began in the redwood forest, went on to Japan, and finally a visit which let Dick meet his new wife's family before they returned to Berkeley. Dick was not happy working under\nDickson\nin Chicago so he had accepted an offer of an instructorship at Brown University in Providence, Rhode Island. The recently married couple drove across the United States to Brown University where both enrolled for a Master's degree.\nLehmer was awarded his Master's Degree in\n1929\nand his doctorate, also from Brown University, in\n1930\n. His dissertation, which was supervised by\nTamarkin\n, was\nAn Extended Theory of Lucas's Functions\n. Lehmer's life over the next few years involved moving from place to place hoping for a permanent university post in the particularly difficult times of the Great Depression. After receiving his doctorate, Lehmer was awarded a National Research Fellowship and with this he spent\n1930\n-\n31\nat the California Institute of Technology and then\n1931\n-\n32\nat Stanford. After a spell at the Institute for Advanced Study at Princeton, where he held a second Fellowship, Lehmer moved to a more permanent post at Lehigh University in Pennsylvania.\nLehmer and his wife remained at Lehigh until\n1940\nexcept for the year\n1938\n-\n39\nwhich they spent in England visiting both the University of Cambridge and the University of Manchester. In England they met, among others,\nHardy\n,\nLittlewood\n,\nDavenport\n,\nMahler\n,\nMordell\n, and\nErdős\n. Back in the United States not long after the outbreak of World War II, Lehmer spent another year at Lehigh before accepting a post in Berkeley in\n1940\n. It was the job he always wanted and it was a great joy to Lehmer and his family to return home.\nThe Lehmers spent\n1945\n-\n46\nat the Aberdeen Proving Ground where Lehmer's task was to help set up and operate the ENIAC\n(\nElectronic Numerical Integrator and Calculator\n)\ncomputer. Although the computer worked most of the time computing trajectories for ballistics problems, on some weekends the Lehmers used it to solve certain number theory problems using it as an electronic sieve\n[\n1\n]\n:-\nWhen they could arrange child care, they often stayed at the lab all night long while the ENIAC processed one of their problems. They would return home at the break of dawn. They were pleased to find that the sieve worked in successfully solving problems.\nIn February\n1950\nSenator Joseph R McCarthy of Wisconsin claimed that\n205\nState Department employees were communists who were disloyal to the United States. McCarthy enjoyed a highly successful few years by making these charges of disloyalty that, though mostly undocumented, badly hurt government employees, teachers, and university professors. Although McCarthy was the most prominent person taking this line, it was a road that the United States was already on and the State of California had for some time been discussing loyalty oaths. In\n1950\nthe Board of Regents of the State of California decided to implement a policy that all employees sign a loyalty oath, and the University of California at Berkeley was chosen as one of the first test cases for it. Nineteen faculty members of the University of California refused; Lehmer was one such faculty member.\nThe assumption was that anyone who would not sign the oath must be a communist sympathiser and must be sacked, so Lehmer, as one of those who refused, lost his position. Many considered that the oath violated their rights of academic freedom which university researchers valued most highly. Of course the witch-hunts against imaginary communists in the early\n1950\ns was a disgraceful affair which cost many their jobs and led to long-term suffering. For Lehmer, however, the problem was not so acute for he was able to take up the post of Director of the National Bureau of Standards' Institute for Numerical Analysis for the time that he was unable to hold his faculty position in Berkeley. Others were not as fortunate as he was and suffered real hardships. After the courts proclaimed the oath to be unconstitutional, Lehmer was reinstated at Berkeley.\nLehmer's\nSelected Papers\npublished in\n1981\ngives a good indication of the range of topics on which he worked. The chapter headings are:\nLucas\n's functions; Tests for primality; Continued fractions;\nBernoulli numbers\nand polynomials;\nDiophantine equations\n; Numerical functions; Matrices; Power residues;\nAnalytic number theory\n; Partitions; Modular forms; Cyclotomy; Combinatorics; Sieves; Equation solving; Computing techniques; and Miscellaneous. His most famous monograph was\nGuide to Tables in the Theory of Numbers\n.\nR D Carmichael\n, reviewing the book, wrote:-\nA descriptive account is given of existing tables in the theory of numbers; this is set forth in such a way as to indicate clearly what each table contains. A bibliography, arranged alphabetically by authors, gives exact references to the material cited and supplies information concerning the holdings, in libraries of the United States and Canada, of the books and pamphlets to which reference is made. Errata in the tables are listed, the sources being given in the cases of errata previously printed; Lehmer's contributions in the way of new indications of errata are notable.\nLehmer was awarded an honorary degree from Brown University in\n1980\n. The citation reads in part:-\nProlific in research, you have made far-reaching contributions to number theory. You were among the first to recognize the importance of high-speed computers as an aid to mathematical research. With great energy and enthusiasm, you demonstrated how, in both theory and practice, computers can be an invaluable tool in testing conjectures.\nLehmer lectured at the International Conference on Computers and Mathematics held at Stanford University in\n1986\n. His talk,\nFactorization then and now\n, covered one of the topics to which he had made major contributions. He was a pioneer in the application of mechanical methods, including digital computers, to the solution of problems in number theory and he talked about some of the methods used to factorise numbers including: factor tables, trial division,\nLegendre\n's method, factor stencils, the\ncontinued fraction\nmethod,\nFermat\n's method, methods based on quadratic forms, and\nShanks\n's method.\nLet us mention a number of other topics for which Lehmer will be remembered. One must be the\nLucas\n-Lehmer primality test which uses the\nFermat\ncongruence, and in particular his application to testing whether a\nMersenne\nnumber was prime. He also made major contributions to studying the density of primes with a given primitive root and to the study of the partition function, in particular verifying certain conjectures by\nRamanujan\n. He was the first person to attack the\nRiemann Hypothesis\nby using a computer to check if the roots lie on the critical line. Luck, however, often plays a large role in determining how famous a mathematician will become, and Lehmer's attack on the\nRiemann\nHypothesis only provided evidence that the hypothesis was true whereas had the world been different it might have yielded a counterexample.\nBrillhart, who received a Ph.D. in\n1967\nfor a thesis supervised by Lehmer, comments in\n[\n1\n]\non Lehmer as a lecturer:-\nAs a lecturer\n[\nLehmer\n]\nwas much appreciated not only for his classical scholarship in mathematics and number theory, but also for his dry sense of humour and wit.\nBrillhart also comments:-\nAs a thinker\n[\nLehmer\n]\nwas sagaciously independent, not being devoted to dogmas, systems, or rituals.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}