{
  "nome_completo": "Dimitri Fedorovich Egorov",
  "nome_curto": "Dimitri Fedorovich Egorov",
  "ano_nascimento": "1869",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Egorov/",
  "lugar_nascimento": "Moscow, Russia",
  "lugar_morte": "Kazan, USSR",
  "biografia": "Dimitri Fedorovich Egorov\n's parents were Fedor Ivanovich Egorov, the Director of the Moscow Teachers' Institute, and Olga Nikolaevna Makhova, the daughter of a Collegiate Councillor. Fedor Ivanovich taught algebra and geometry as part of the three-year course to train secondary school teachers at the Moscow Teachers' Institute. Dimitri Fedorovich was educated at home for the first part of his life and only when he reached secondary school age did he begin his formal school education. He entered the fourth class of the Moscow Second\nProgymnasium\n, then moved to the Sixth Moscow Gymnasium where he attended the fifth and sixth year classes. He graduated from the Sixth Moscow Gymnasium in\n1887\nhaving been awarded the gold medal. Then he entered Moscow University to study mathematics and physics, enrolling later in\n1887\n. The teacher to influence him most at this time was\nNicolai Vasilievich Bugaev\nbut he also attended lectures from\nAlexandr Ivanovich Nekrasov\n,\nNikolai Egorovich Zhukovsky\n, the geometer Vasilii Yakovlevich Tsinger\n(1836\n-\n1907)\n, and the physicists Aleksandr Grigorievich Stoletov\n(1839\n-\n1896)\nand Aleksei Petrovich Sokolov. He graduated in\n1891\nhaving submitted his thesis\nSecond-order confocal surfaces in a space of constant curvature\n. Tsinger, who was an examiner of the thesis, wrote in his report\n(\nquoted in\n[\n11\n]\n)\n:-\nEgorov has presented to the examination commission a very extensive and interesting work on the extension of properties of confocal surfaces to analogous forms in a space of\nn\nn\nn\ndimensions. In this paper, in addition to the independent, very elegant and simple solution of the problem proposed, the originality and logical rigour of the exposition of the basic general geometrical principles deserve special mention, as does also the very successful working out of many details.\nEgorov wrote his first paper\nSome relations in the theory of integrals over divisors\nwhile still an undergraduate. The paper discussed numerical integrals and derivatives, clearly influenced by\nBugaev\n's work in this area, and was published in\n1892\n. After the award of his first degree, Egorov remained at Moscow University working towards his Master's Degree\n(\nequivalent to a Ph.D.\n)\n.\nNekrasov\nand Tsinger wrote supporting his application for financial support while he was undertaking this work. Tsinger wrote\n(\nquoted in\n[\n11\n]\n)\n:-\nAmong the young men who have completed the university course and the examinations of the commission this year, Mr Egorov attracted special attention. Due to his outstanding mathematical talents, his excellent general education and his real inclination towards scientific knowledge, Mr Egorov, in his remarkably conscientious and completely successful passage through all subjects of the Mathematical Department, found the opportunity of considerably enlarging his knowledge by a very extensive acquaintance with mathematical literature and a special study of many branches of modern geometry\nEgorov received a Treasury grant for two years during which time he undertook work for his Master's Degree. He was appointed an assistant lecturer at Moscow University on\n27\nJanuary\n1894\n, obtaining his Master's Degree in October\n1899\nfor his thesis\nSecond-order partial differential equations in two independent variables\nwhich he had defended on\n22\nSeptember\n1899\n. He continued working for his doctorate\n(\nequivalent in level to the\nhabilitation\n)\nand he was awarded this degree on\n24\nMarch\n1901\nfor his dissertation\nOn a class of orthogonal systems\n. He had defended his dissertation a couple of days earlier with Boleslav Kornelievich Mlodzeevskii\n(1858\n-\n1923)\nand\nKonstantin Alekseevich Andreev\n(1848\n-\n1921)\nas his examiners.\nHe spent a year abroad, spending the summer of\n1902\nin Berlin, where he attended lectures by\nFrobenius\nbefore moving to Paris where he remained until the beginning of the following summer  attending lectures by\nDarboux\n,\nHadamard\n,\nLebesgue\n, and\nPoincaré\n. He returned to Germany to spend the summer of\n1903\nin Göttingen attending lectures by\nKlein\n,\nHilbert\nand\nMinkowski\n. On\n14\nAugust\n1903\nhe was appointed as an extraordinary professor at Moscow University, becoming a full professor in March\n1904\n. Egorov married Anna Ivanovich Grzhimali, the daughter of Ivan Grzhimali who was a top violinist and professor at the Moscow Conservatory. Anna was an excellent pianist and singer and her sister Natalya, who lived with Egorov and his wife for many years, was a professional pianist\n[\n2\n]\n:-\nDmitri's marriage to Anna placed the young couple in the midst of the leading cultural and social elite of Moscow. ... In the Egorov apartment, located on Boris and Gleb Street in the prestigious Arbat region of Moscow, music was often in the air. Two pianos competed with each other, a grand piano for Natalya and a smaller one for Anna. Natalya frequently gave lessons there for young piano students ... . Sometimes her father Ivan came to the apartment for social events, where he would play for the guests on his rare Stradivarius violin.\nEgorov worked on triply orthogonal systems and potential surfaces, making a major contribution to\ndifferential geometry\n. In particular his doctoral dissertation made significant contributions to these areas. The dissertation begins with the following introduction:-\nSince the appearance of the classic memoir of\nGauss\n(\nin\n1827)\nand the no less famous treatise of\nLamé\n(\nin\n1850)\n, curvilinear coordinates have been an indispensable tool for the investigation of almost all branches of differential geometry and for many fields of applied mathematics. However, the theoretical significance of curvilinear coordinates is not exhausted merely by their significance as an instrument of research. In fact, the theory of curvilinear coordinates is, essentially, nothing other than the theory of lines on a surface and of systems of surfaces in space, and from this point of view this theory is evidently one of the most important constituents of differential geometry.\nSome of the results of Egorov's doctoral dissertation were presented by\nDarboux\nin his famous four volume work\nLeçons sur la théorie général des surfaces et les applications géométriques du calcul infinitésimal\n(1910)\n. A theorem in the theory of functions of a real variable is now named after Egorov. This theorem appeared in his paper\nSur les suites des fonctions measurables\nwhich was published by the\nAcademy of Sciences\nin Paris in\n1911\n.\nVyacheslaw Vassilievich Stepanov\n, one of Egorov's pupils, regarded the publication of this paper as marking the birth of a new Moscow School of Mathematics. In\n1923\nEgorov published the book\nPrinciples of the calculus of variations\n. This book, based on lecture courses he had given, showed that his interest in the topic had continued after his own research contributions in\n1905\n. In the same year of\n1923\nhe published two further books,\nTextbook for higher technical schools\n, and\nElements of number theory\n. Egorov also worked on\nintegral equation\npublishing significant papers such as\nSur quelques points de la théorie des équations integrates à limites fixes\nand\nSur la théorie des équations integrates au noyau symmetrique\nwhich were both published in\n1928\n. In the following year he published lecture notes under the title\nIntegration of differential equations. Course of lectures\n... .\nEgorov was a devoted teacher who taught at Gymnasium No\n5\n, Gymnasium No\n6\nand the F I Kreiman Gymnasium in Moscow. He also taught at the Moscow College of Engineering, at the Moscow Teachers' Institute and at the Advanced Courses for Women. At Moscow University, before his appointment as a professor, he taught courses on the synthetic theory of conics, number theory, the geometrical theory of partial differential equations, the theory of\ndeterminants\n, and the theory of binary forms. After he was appointed as a professor, he taught courses on differential geometry, the integration of differential equations, integral equations, the calculus of variations, number theory, and the theory of surfaces. Kuznetsov writes in\n[\n11\n]\n:-\nEgorov's lectures were always of a high scientific level and were of unimpeachable rigour and corresponded to the leading scientific trends of his time.\nHe lectured to\nPavel Sergeevich Aleksandrov\nwho gave this assessment of his professor\n(\nquoted in\n[\n11\n]\n)\n:-\nExceptionally restrained, slightly dry, Egorov was to a high degree master of his art both as regards the internal, logical and purely mathematical structure of his lectures and as regards their external, verbal structure, and, what is more important, these lectures could serve as a matchless example of mathematical rigour, but this really brilliant mastery of composition, free from any external effects, was aimed at the trained listener, which explains why Egorov was primarily a Professor for advanced courses. However, the formal merits, refinements of calculation, always the shortest path of logical deduction, possibly sometimes even overwhelmed the listener, who in Egorov's lectures received every mathematical theory in its definitive crystallized form.\nNikolai Nikolaevich Luzin\nwas Egorov's first student and became a member of the school Egorov created in Moscow dealing with functions of a real variable. Egorov and\nLuzin\nare now considered as joint founders of the influential Moscow School of Pure Mathematics. In\n1917\nEgorov became secretary of the\nMoscow Mathematical Society\n. Then in\n1921\nhe was elected vice-president, becoming president the following year. In\n1923\nEgorov became director of the Institute for Mechanics and Mathematics at Moscow State University which had been founded two years earlier. Also in\n1923\nEgorov was appointed as Chairman of the Mathematics Syllabus Commission of Moscow University. He was elected a corresponding member of the\nUSSR Academy of Sciences\nin\n1924\n. At this time he was one of the most influential mathematicians in Russia, exerting a major influence as a researcher, an administrator and as a teacher. However the Russian Revolution of\n1917\nhad set in motion a political system which began to see Egorov as a problem. He was a deeply religious man and we illustrate this by quoting the geometer Nikolai Mikhailovich Beskin\n(\nsee\n[\n5\n]\n)\n:-\nOn getting to know Egorov, one was struck with his religiosity. At his home I saw priests with whom he was deeply respectful, kissing their hands on meeting. On his desk, along with mathematical books, was the Bible. He alternated reading mathematical literature with the reading of theological literature for relaxation.\nIn\n1919\nthe Church of St Tatiana the Martyr, the Moscow University church, was closed by the university authorities. Egorov was highly critical of this action\n[\n2\n]\n:-\n... when the church building was converted into a student club, dance hall, and auditorium, Egorov pointedly refused to attend any of the events held there, considering them a desecration. Of course his stance was noticed, both by students and by university administrators.\nIn\n1922\n-\n23\nthere was a mass execution of clergy and in\n1928\nthe attack was renewed. From within mathematics, Ernst Kol'man\n(1892\n-\n1979)\nwas a Marxist who began to attack Egorov. A university professor was poorly paid at this time, and Egorov had been teaching part-time at the Civil Engineering Institute in Moscow from the early\n1920\ns to supplement his income. Kol'man, in\n1924\n, attacked Egorov at a meeting in the Engineering Institute, describing him as:-\n... a reactionary supporter of religious beliefs, a dangerous influence on students, and a person who mixes mathematics and mysticism.\nSoon after this Egorov was dismissed from his position at the Institute and\nNikolai Grigorievich Chebotaryov\nwas appointed to fill the vacant position.\nChebotaryov\nwas a supporter of the Soviet system but once he realised that he had been appointed because Egorov, whom he idealised as a mathematician, had been dismissed for political reasons he became unhappy and resigned the position. Now Egorov was still in a position of power in the\nMoscow Mathematical Society\nand he tried to shelter academics who had been dismissed from their posts. He tried to prevent the attempt to impose Marxist methodology on scientists. The\nUSSR Academy of Sciences\nseemed at first to offer Egorov their support for on\n13\nFebruary\n1929\nhe was made a full member. His position was greatly weakened, however, when his own students turned against him\n[\n2\n]\n:-\nOn\n21\nDecember\n1929\n, Egorov was severely chastised at a meeting of graduate students at Moscow University. This was a new development: his own students were turning on him. They accused him of \"religious zeal and proselytizing,\" of \"ossification, inertia, lack of political zeal in reforming pedagogical research and methodology.\" Egorov was greatly saddened to see his previous friends and students become his critics, but he absolutely refused to back down. He replied to the criticism by saying that his religious views were his own affair, and pointed out that instead of displaying \"inertia\" he had laboured for years to improve mathematics in Russia - through the university, through the\nMoscow Mathematical Society\n, and in close collaboration with students who earlier, he noted, had expressed appreciation for his work on their behalf.\nIn the spring of\n1930\nEgorov was dismissed as director of the Institute for Mechanics and Mathematics and given a public rebuke. In September of the same year he was arrested as a \"religious sectarian\" and put in prison. The\nMoscow Mathematical Society\ncontinued to support Egorov, refusing to expel him, and those who presented papers at the next meeting, including\nAleksandr Gennadievich Kurosh\n, were to be expelled by an \"Initiative group\" who took over the Society in November\n1930\n. They expelled Egorov denouncing him as a reactionary and a churchman. In\n1931\nthe Society put the following editorial into their journal\n(\nsee for example\n[\n14\n]\n)\n:-\nUntil recently the Mathematical Society had retained its cliquish academic character. Prof Egorov, a reactionary and a churchman, headed the society. He opposed the policies of Soviet power ... , under the guise of defending \"academic traditions\" and \"pure apolitical science.\" The growth of the proletarian strata among the graduate students ... and their struggle against the reactionary wing of the professors decisively turned the basic cadres of Soviet mathematicians ... , to active participation in social construction ... . In the Mathematical Society an initiative group, including many prominent mathematicians, was formed to reorganize the society. The declaration of the initiative group was accepted by the Mathematical Society ... . The Society expelled Egorov and other reactionaries, and replaced them mainly with graduate students ... .  The editors call upon Soviet mathematicians to close ranks around the journal and help to turn it into a fighting organ of Soviet mathematics.\nEgorov spent a short time in prison in Moscow, then was sent to prison in Kazan. He went on a hunger strike in prison and eventually, by this time close to death, he was taken to the prison hospital in Kazan.\nChebotaryov\n's wife, Maria Smirnitskaia, was working as a doctor in the prison hospital and she recognised the famous mathematician. He was too ill to be saved, but Maria Smirnitskaia signed Egorov's death certificate before his death and told the guards that he had died. She then took him to her own home where he died the following day in\nChebotaryov\n's arms. Egorov was buried in the Arskoe Cemetery in Kazan after a funeral attended only by\nChebotaryov\nand Egorov's wife.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}