{
  "nome_completo": "Dimitrie Pompeiu",
  "nome_curto": "Dimitrie Pompeiu",
  "ano_nascimento": "1873",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pompeiu/",
  "lugar_nascimento": "Brosca, near Dorohoi, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Dimitrie Pompeiu\nattended both primary and secondary school in Dorohoi in Botosani county in northeastern Romania. After graduating from secondary school, he went to Bucharest where he studied at the Normal Teachers School which was modelled on the École Normale in Paris. He qualified as a teacher in\n1893\nand began his teaching career when he was appointed as a teacher at a school in Galati. From Galati he moved to a school in Ploiesti and remained there until\n1898\n.\nAfter being given leave of absence from school teaching, Pompeiu went to Paris in\n1898\nto continue his mathematical studies. After obtaining his licence he continued to undertake research for his doctorate with\nHenri Poincaré\nas his thesis advisor. He submitted his thesis\nSur la continuite des fonctions de variables complexes\nⓉ\n(\nOn continuity of complex variables functions\n)\nand defended it on\n31\nMarch\n1905\nbefore a committee chaired by\nHenri Poincaré\nwhich included\nÉmile Picard\n,\nGabriel Koenigs\n,\nPaul Appell\nand\nÉdouard Goursat\n. The thesis was published in Paris in\n1905\nand, in the same year, was also published in the\nAnnales de la faculté des sciences de Toulouse\n. This thesis was an important work and we shall discuss something of its content and importance below. For the moment let us continue to outline Pompeiu's career.\nHe returned to Romania in the autumn of\n1905\nwhere he was appointed as a lecturer in mathematics at the University of Iasi. He was promoted to professor of mechanics at Iasi in\n1907\nand remained there until\n1912\nwhen he moved to the University of Bucharest. His appointment in Bucharest was an important one for he became the successor of\nSpiru Haret\nwho was one of the two most famous of the first generation of Romanian mathematicians. The second of the pair of famous first generation of Romanian mathematicians was David Emmanuel and, when Emmanuel retired in\n1930\n, Pompeiu was named Professor of the Theory of Functions to succeed him. A small selection of the papers published by Pompeiu following his doctoral thesis are:\nSur les fonctions dérivées\nⓉ\n(\nOn derived functions\n)\n(1907)\n,\nSur un Exemple de Fonction Analytique Partout Continue\nⓉ\n(\nOn an example of an everywhere continuous analytical function\n)\n(1910)\n,\nSur une équation intégrale\nⓉ\n(\nOn an integral equation\n)\n(1913)\n, Sur les équations fonctionnelles des polynômes à variables réelles\nⓉ\n(\nOn functional equations of real variables polynomials\n)\n(1934)\n,\nDu point à l'infini comme point singulier isolé\nⓉ\n(\nThe point at infinity as isolated singular point\n)\n(1938)\n,\nRemarques sur l'équation de Riccati\nⓉ\n(\nNotes on the Riccati equation\n)\n(1940)\n,\nLa géométrie et les imaginaires: démonstration de quelques théorèmes élémentaires\nⓉ\n(\nGeometry and the imaginary: Demonstration of some elementary theorems\n)\n(1940)\n, and\nDe la définition du pôle en théorie des fonctions\nⓉ\n(\nOn the definition of a pole in complex analysis\n)\n(1940)\n.\nWe promised to return to discuss Pompeiu's doctoral thesis. The motivation for the research he carried out was a question about the singularities of uniform analytic functions posed by\nPainlevé\nin\nLeçons sur la théorie analytique des équations differentielles\nⓉ\n(\nLectures on the analytic theory of differential equations\n)\nin\n1897\n. The difficulty arose when, also in\n1905\n, Ludovic Zoritti wrote a doctoral thesis in which he claimed to have proved that a uniform analytic function cannot be continuously extended on the set of its singularities. However, Pompeiu's doctoral thesis written in the same year proved the existence of certain analytic functions which could be extended continuously on their set of singularities even though this set had positive measure. Clearly both results could not be correct and the difficulty was resolved in\n1909\nwhen\nDenjoy\nconfirmed that Pompeiu's results were correct, and he found the error in Zoritti's theorems. Pompeiu's examples had been constructed using ideas due to Koepcke and they were difficult to understand. However, in\n1907\nPompeiu had clarified the whole situation by constructing simpler examples in his paper\nSur les fonctions dérivées\nⓉ\n(\nOn derived functions\n)\nwhich we mentioned above. The functions which he constructed in this paper are now called 'Pompeiu functions'. Marcus discusses these functions in\n[\n9\n]\nand traces their influence on the development of analysis.\nThere was another important idea in Pompeiu's doctoral thesis, namely the distance between two sets which he called the 'écart' and 'écart mutuel' which\n[\n4\n]\n:-\n.... allows Pompeiu to see the compact subsets in the plane as the elements of another set and to define in a natural way limits, closure, etc. for this \"set of sets\". Consequently, Pompeiu is also considered as one of the founders of the theory of hyperspaces.\nMcAllister, in\n[\n8\n]\n, makes a detailed historical study and agrees that Pompeiu must be considered as one of the founders of the theory of hyperspaces. The distance between sets is now usually called the '\nHausdorff\ndistance' since the idea appears in\nHausdorff\n's famous book\nGrundzuege der Mengenlehre\nⓉ\n(\nBroad outlines of set theory\n)\n(1914)\n. In this work\nHausdorff\ngives a slightly different definition of distance between sets but he also credits Pompeiu's work and shows that the two definitions give the same topology. McAllister writes on page\n310\nand\n311\nof\n[\n8\n]\n:-\n...\n[\nPompeiu\n]\nmay with some justice be said to have invented hyperspaces, and\nHausdorff\n's use of them in\n1914\nin his treatise Grundzuege der Mengenlehre has made them very well known ....\nI have found no evidence of the\nHausdorff\nmetric itself before Pompeiu's thesis\n.\nPetru Mocanu has written of Pompeiu's contributions in\n[\n10\n]\n. He writes:-\nThere is no doubt that Pompeiu's preferred area was analysis, especially complex analysis, but he achieved remarkable results in other areas such as mechanics. Pompeiu initiated the theory of polygenus functions as a natural extension of analytic functions. He introduced the notion of a special type of derivative, the areolar derivative of a complex function, extending the\nCauchy\nformula which today is sometimes called the\nCauchy\n-Pompeiu formula. In a short paper in\n1929\n[\nSur certains systemes d'équations linéires et sur une propriété intégrale des fonctions de plusieurs variables\nⓉ\n(\nOn some systems of linear equations and a proper integral of functions of several variables\n)\n]\nhe proved that if the double integral of a continuous function takes the same value over any square of given side, then the function is constant. This simple remark has led to many interesting problems in analysis known as the problem of Pompeiu.\nThe authors of\n[\n4\n]\nstate that around\n1000\npapers have been written which cite this\n1929\npaper by Pompeiu - a remarkable achievement. Among other topics on which Pompeiu published research articles we mention interpolation theory. On this topic he wrote six papers spread throughout his career - they are discussed in\n[\n14\n]\n.\nIn\n[\n6\n]\nIacob\ndiscusses Pompeiu's design for a three-year mechanics course in Bucharest, using both students' notes and university records. After World War I ended, Pompeiu organised the Mathematics Seminar at the University of Cluj. He was the first director of the seminar which he modelled on the seminar at the Collège de France. Finally let us mention that Pompeiu, along with\nPetru Sergescu\n, founded the journal\nMathematica\n(\nCluj\n)\nand he was its first editor.\nPompeiu was honoured with election to the\nRomanian Academy of Sciences\nin\n1934\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}