{
  "nome_completo": "Dmitrii Matveevich Sintsov",
  "nome_curto": "Dmitrii Matveevich Sintsov",
  "ano_nascimento": "1867",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sintsov/",
  "lugar_nascimento": "Viatka (now Kirov), Russia",
  "lugar_morte": "Kharkov, Ukraine",
  "biografia": "Dmitrii Matveevich Sintsov\nwas born in Viatka\n(\nsometimes written as Vyatka\n)\nwhich was a large city in western Russia and the administrative centre of the Kirov Province. The change of name of this city to Kirov did not happen until\n1934\nwhen it was renamed after the Soviet official Sergey M Kirov. He attended the Third Kazan High School, graduating with the Gold Medal in\n1886\n. Later in the year in which he graduated from the High School, he began his studies at Kazan University, graduating in\n1890\n. This University, the result of one of the many reforms of the Emperor Alexander I, was founded in\n1805\n, and was famed in mathematics by having\nLobachevsky\nas its rector from\n1827\nto\n1846\n. By the time Sintsov began his university studies he was already convinced that mathematics was the topic for him to concentrate on, and he became a member of the mathematics section of the Physics and Mathematics Faculty of the university. His lecturers in mathematics were A V Vasil'ev, F M Suvorov, V V Preobrazhenskii and P S Nazimov. He also took courses in astronomy with D I Dubyago.\nSintsov's first research was on\nBernoulli\nfunctions of fractional order and he carried this out while taking his fourth year undergraduate courses. His paper on the topic was published in the\nNotices of the Kazan Physics and Mathematics Society\nin\n1890\n. This was a remarkable piece of work for a student at this stage in his undergraduate studies and it earned him a Gold Medal. Although Sintsov's interests moved away from the areas of his first scientific investigations, nevertheless he did undertake further research into Bernoulli functions and published further papers on this topic near the beginning of his career. Having made such an excellent start to his research, his \"esteemed teacher\" Aleksandr Vasil'evich Vasil'ev\n(1853\n-\n1929)\nrecommended that he continue his studies at the University of Kazan with the aim of qualifying as a High School teacher. He spent three years, from the beginning of February\n1891\nto the beginning of February\n1894\n, taking the necessary courses to obtain his teaching qualification. During this period he was being advised on research topics by Vasil'ev and, following his advice, he wrote his Master's Thesis\nThe Theory of Connexes in Space in Connection with the Theory of First Order Partial Differential Equations\n. I A Naumov explains in\n[\n7\n]\n:-\nThe German mathematician\nA Clebsch\nwas the first to investigate the theory of connexes in the period\n1870\n-\n1872\n. He considered plane connexes i.e., plane geometrical objects, where the point-straight line combination was chosen as the basic element of the plane. Such connexes are termed ternary.\nClebsch\nconstructed the geometry of a ternary connex and applied it to the theory of ordinary\ndifferential equations\n.\nSintsov was appointed to the staff of Kazan University and taught there from\n1894\nto\n1899\n. After leaving Kazan, Sintsov taught at the Odessa Higher Mining School, then, in\n1903\n, he was appointed to Kharkov University where he taught until his death in\n1946\n. He took a leading role in the development of mathematics at Kharkov University and, for many years, he was President of the\nKharkov Mathematical Society\n. This Society is one of the early mathematics societies, being founded in\n1879\n. Following\nVladimir Andreevich Steklov\n's presidency from\n1902\nto\n1906\n, Sintsov took over as President, and held the position until his death forty years later\n[\n8\n]\n:-\nThrough Sintsov's initiative, the\nKharkov Mathematical Society\nwas deeply involved in the improvement of mathematical education in the schools of the Kharkov region. Sintsov also put considerable effort into maintaining the\nKharkov Mathematical Society\nmathematical library which is still one of the most complete mathematical libraries in Ukraine.\nSintsov had an outstanding research record, and published\n267\nworks during his long and productive scientific and teaching career. Of course through his many years of research his interests varied but the main areas on which he worked were the theory of\nconics\nand applications of this geometrical theory to the solution of differential equations and, perhaps most important of all, the theory of nonholonomic\ndifferential geometry\n. I A Naumov writes\n[\n7\n]\n:-\nHis classical work on the theory of connexes, of which he was one of the founders, and on nonholonomic differential geometry are well known far beyond the frontiers of our country.\nThe book in which the articles\n[\n2\n]\n(\nwritten by Ja P Blank who was a student of Sintsov\n)\nand\n[\n5\n]\nappear, contains a selection of the Sintsov's major works on nonholonomic geometry. These were first published during the years\n1927\n-\n1940\nand include:\nA generalization of the Enneper-\nBeltrami\nformula to systems of integral curves of the Pfaffian equation Pdx + Qdy + Rdz =\n0\n(1927)\n;\nProperties of a system of integral curves of Pfaff's equation, Extension of Gauss's theorem to the system of integral curves of the Pfaffian equation Pdx + Qdy + Rdz =\n0\n(1927)\n;\nGaussian curvature, and lines of curvature of the second kind\n(1928)\n;\nThe geometry of Mongian equations\n(1929)\n;\nCurvature of the asymptotic lines\n(\ncurves with principal tangents\n)\nfor surfaces that are systems of integral curves of Pfaffian and Mongian equations and complexes\n(1929)\n;\nOn a property of the geodesic lines of the system of integral curves of Pfaff's equation\n(1936)\n;\nStudies in the theory of Pfaffian manifolds\n(\nspecial manifolds of the first and second kind\n)\n(1940)\nand\nStudies in the theory of Pfaffian manifolds\n(1940)\n.\nAt Kharkov University, Sintsov created a school of geometry which became the leading school in this field in Ukraine and has continued to flourish through the years still today being a leading centre. There he studied the geometry of\nMonge\nequations and he introduced the important ideas of asymptotic line curvature of the first and second kind. In\n1903\nhe published two papers on the functional equation\nf\n(\nx\n,\ny\n)\n+\nf\n(\ny\n,\nz\n)\n=\nf\n(\nx\n,\nz\n)\nf (x, y) + f (y, z) = f (x, z)\nf\n(\nx\n,\ny\n)\n+\nf\n(\ny\n,\nz\n)\n=\nf\n(\nx\n,\nz\n)\n, now called the 'Sintsov equation,' which are discussed by Detlef Gronau in\n[\n4\n]\n. He writes:-\nSintsov gave in\n1903\nan elegant proof of its general real solution, which has the form\nf\n(\nx\n,\ny\n)\n=\nq\n(\nx\n)\n−\nq\n(\ny\n)\nf (x, y) = q(x) - q(y)\nf\n(\nx\n,\ny\n)\n=\nq\n(\nx\n)\n−\nq\n(\ny\n)\n, where q is an arbitrary function in one variable. ...\n[\nSintsov\n]\nwas the first who gave\n(\nin two papers ... in\n1903)\nelementary simple proofs of its general real solutions. But before, it was\nMoritz Cantor\nwho proposed these equations\n(\nthere are two equations\n)\n. In his journal 'Zeitschrift fur Mathematik und Physik,' ... he published\n[\na note on them\n]\nin\n1896\n. Cantor quotes these equations as examples of equations in three variables which can be solved by the method of differential calculus due to\nNiels Henrik Abel\n. ... The proof of Sintsov  is much simpler and elegant.\nSintsov also took an interest in the history of mathematics and one of the major projects which he undertook in this area was the detailed study of the work of previous mathematicians at Kharkov University. This work provides a fascinating account of the development of mathematics there from the founding of the university in\n1805\n.\nThe\nUkrainian Academy of Sciences\nhonoured Sintsov by electing him to membership on\n22\nFebruary\n1939\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}