{
  "nome_completo": "Domninus of Larissa",
  "nome_curto": "Domninus",
  "ano_nascimento": "420",
  "ano_morte": "480",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Domninus/",
  "lugar_nascimento": "Larissa (now Shaizar), Syria",
  "lugar_morte": null,
  "biografia": "Domninus\nwas a Syrian, and by religion a Jew, who was born in the town of Larissa\n(\noften identified with Laodicea but probably a separate town\n)\non the Orontes River. He went to Athens where he became a pupil of\nSyrianus\nwho was the head of\nPlato's Academy\nthere.\nProclus\n, although slightly older than Domninus, was also a pupil of Syrianus at the\nAcademy\nat the same time.\nMarinus\n, who was later a pupil of\nProclus\nand eventually took over as head of the\nAcademy\nfollowing\nProclus\n, writes about a rivalry between Domninus and\nProclus\n[\n1\n]\n:-\n[\nSyrianus\n]\noffered to discourse to them on either the Orphic theories or the oracles; but Domninus wanted Orphism,\nProclus\nthe oracles, and they had not agreed when Syrianus died...\nIf at first Domninus and\nProclus\nwere merely student rivals, certainly it grew into a more serious disagreement centred on how\nPlato\n's philosophy should be interpreted. This serious disagreement saw\nProclus\ncome out as the victor in the sense that the\nAcademy\npreferred his views.\nProclus\nsucceeded Syrianus as head of the\nAcademy\nin Athens while, a short while later, Domninus left Athens and returned to his home town of Larissa.\nThe mathematical work of Domninus only came to light after the publication of his\nManual of Introductory Arithmetic\nin\n1832\n, and its importance was not realised until\nPaul Tannery\nbegan publishing a number of works on Domninus in\n1884\n. Although Domninus wrote a number of books the only other known in detail is\nHow to take a ratio out of a ratio\nwhich was not published until\n1883\nin\n[\n3\n]\n.\nThe\nManual of Introductory Arithmetic\nstudies numbers, means, and proportion. The book is in five parts\n[\n1\n]\n:-\n... an examination of numbers in themselves, an examination of numbers in relation to other numbers, the theory of numbers both in themselves and in relation to others, the theory of means and proportions, and the theory of numbers as figures.\nAt the end of the book Domninus says that he intends to treat some of the subjects more fully in\nElements of Arithmetic\nbut it is not known if he ever wrote it! Certainly he would not be the first or last mathematician to refer to a future work which never materialised.\nHeath\n[\n2\n]\nwrites of the\nManual of Introductory Arithmetic\n:-\nIt is a sketch of the elements of the theory of numbers, very concise and well arranged, and is interesting because it indicates a serious attempt at a reaction against the Introductio arithmetica of\nNicomachus\nand a return to the doctrine of\nEuclid\n.\nThe second book,\nHow to take a ratio out of a ratio\n, published in translation in\n1883\n, studies manipulation of ratios into other forms.\nHeath\ncasts some doubt as to whether this book is actually by Domninus. He writes\n[\n2\n]\n:-\n... if it not by Domninus, it probably belongs to the same period.\nBulmer-Thomas in\n[\n1\n]\nis more certain that it is by Domninus and conjectures that the work was, at least in part, work by Domninus towards the\nElements of Arithmetic\nwhich he had promised to write.\nWe do have some indications of the character of Domninus, but these may be very unfair since they are related to us by\nDamascius\n, the last head of the\nAcademy\n. Since Domninus's philosophy was considered old-fashioned and out of favour by the\nAcademy\nthe claims made by Damascius may have been aimed at discrediting him. Damascius wrote that when Domninus was an old man he\n[\n1\n]\n:-\n...loved only the conversation of those who praised his superiority and that he would not admit to his company a young man who argued with him about a point in arithmetic.",
  "math_areas": [
    "Number Theory"
  ]
}