{
  "nome_completo": "Douglas Geoffrey Northcott",
  "nome_curto": "Douglas Northcott",
  "ano_nascimento": "1916",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Northcott/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Sheffield, England",
  "biografia": "Douglas Northcott\n's father was Geoffrey Douglas Spence Robertson, an electrical engineer. It would be reasonable to ask at this point why Douglas Northcott's name was not Douglas Robertson. In fact that is precisely what his name was for the first\n18\nor so years of his life. Douglas never knew his father since, tragically, he was killed in an accident only weeks after his son was born. His mother was Clara Freda Behl and she remarried when Douglas was two years old so he grew up believing that her husband, Arthur Kynaston Northcott, was his father. Only when he was a teenager was he told about the death of his father, but he had a deep attachment to Arthur Northcott and in\n1935\nhe went through the legal process of changing his name from Douglas Robertson to Douglas Northcott.\nThe Northcott family were poor and Douglas grew up in somewhat difficult circumstances in a poor area of London. He did receive a good primary education at Laystall Street School where his abilities were recognised and he was given individual tuition by masters. In particular he was taught to solve simultaneous equations and prove elementary theorems in Euclidean geometry which gave him a love of mathematics at this early stage in his education. In\n1927\nhe was nominated for a 'presentation vacancy' at Christ's Hospital in West Horsham. This was a fine school with an excellent reputation which took in boys whose parents were unable to pay the fees for a boarding school. Several leading mathematicians with biographies in this archive including\nWilliam Burnside\n,\nPhilip Hall\nand\nChristopher Zeeman\nwere pupils at Christ's Hospital. The mathematics master C J A Trimble was a fine teacher and this combined with Northcott's outstanding abilities saw him win, in\n1935\n, a Bayliss Scholarship to enter St John's College, Cambridge to study mathematics.\nHighly successful undergraduate years saw Northcott become a\nWrangler\nin the Mathematical Tripos of\n1937\n. He then went on to study for Part III, taking courses on\nFourier series\nand divergent series from\nG H Hardy\nwhich strongly influenced him. He was awarded a distinction in Part III of the Mathematical Tripos in\n1938\nand asked\nHardy\nif he would supervise his research if he remained at Cambridge.\nHardy\nwas popular as a research supervisor and at this time already had six students but he recognised Northcott's potential and so he took him on as his seventh student. He quickly produced excellent results and he submitted his work\nSome inequalities between periodic functions and their derivatives\nfor publication in the\nJournal of the London Mathematical Society\n; it appeared in\n1939\n.\nAt this point Northcott was awarded a Commonwealth Fund Scholarship to allow him to study\nBanach spaces\nat Princeton University. He booked a passage to the United States in a liner which was due to sail on\n3\nSeptember\n1939\n. However, on\n1\nSeptember\n1939\nGermany invaded Poland and preparations for war were already in place for on the same day children began to be evacuated from London. On the following day Chamberlain, the British Prime Minister, sent an ultimatum to Hitler and, having received no response, Britain declared war on Germany on\n3\nSeptember. Northcott had already decided not to proceed with his trip to the United States and instead reported to the Cambridge University Joint Recruiting Board to offer his services in the war effort. He was told that he would be\n[\n1\n]\n:-\n... held in a pool to be employed in technical services, and that in the meantime he should continue with his mathematical research.\nAfter a few weeks of waiting he became impatient to be serving his country in an active capacity so volunteered to join the Royal Artillery in November.\nHardy\nwas very unhappy that his student should be choosing active service and tried to persuade him to remain at Cambridge undertaking research. Northcott, however, was totally committed to the course of action he had chosen. His regiment was posted to India and there he became seriously ill. His condition was such that his parents were informed that he was dangerously ill. However after spending a period in hospital, during which time he was able to concentrate on some mathematical research in Tauberian theorems, he recovered sufficiently to rejoin his regiment. Fearing a Japanese invasion of Malaya his regiment was sent to Ipoh in the west of that country. Northcott, however, became ill again this time with malaria. He was still recovering from that illness when the Japanese attacked Malaya from the north on\n8\nDecember\n1941\n. The\n5\nth\nand\n18\nth\ndivisions of the Japanese Twenty-fifth Army moved south marching down the west coast. The main British force was at Jitra in the north and that fell to the Japanese on\n11\nDecember. The British forces fell back and the Japanese took Ipoa on\n28\nDecember. Northcott recovered sufficiently to rejoin his division which had fallen back to Port Swettenham but that fell on\n10\nJanuary\n1942\n. Northcott remained with his regiment as they fell back to try to defend Singapore. By\n13\nFebruary they were defending the city itself and Northcott was on the beach near the Raffles hotel two days later when General Percival surrendered unconditionally. About\n80\n,\n000\nBritish troops, including Northcott, were taken prisoner and he suffered a further illness contracting peritonitis before being sent by ship to Japan where they suffered appalling conditions in a camp while working on an industrial project. He remained a prisoner in Japan until the country surrendered after the dropping of two atomic bombs by the United States in August\n1945\n[\n1\n]\n:-\n... while a prisoner of war, ... Northcott was able to think about mathematics; indeed, thinking about mathematics probably helped him survive his war experiences. Sometimes he tried to reconstruct proofs of results that he had learnt as a student; at other; he attempted to build up a theory of integration for functions with values in a\nBanach\nspace. He recorded his results about this theory in a notebook that he kept in his gas-mask case. On one occasion his gas-mask was stolen and he never saw it again, and so he had to start again. His second notebook survived the war and, in due course, provided material for his Ph.D. thesis and his fellowship dissertation.\nFew postgraduate students can have done research in more difficult conditions!\nAfter the war ended Northcott returned to Cambridge to try to slot back into his position as a research student that he had left in\n1939\n.\nHardy\nhad retired by this time so he became a student of\nJ E Littlewood\n. He wrote up the results he had obtained while in hospital in India as the paper\nAbstract Tauberian theorems with applications to power series and Hilbert series\nwhich was published in\n1947\n. He also wrote up the results he had obtained as a prisoner-of-war in Japan to submit as his fellowship dissertation. Then, in\n1946\n, he sailed to the United States on the maiden voyage of the liner\nQueen Elizabeth\nto take up the Commonwealth Fellowship he had been awarded before the war, and study at Princeton. The\nQueen Elizabeth\nhad been launched in\n1938\nand used as a troopship during World War II before entering transatlantic service of the Cunard Line in\n1946\n. On\n16\nOctober she sailed from Southampton bound for New York and Northcott had many famous passengers for company, including a number of diplomats bound for the first session of the new United Nations.\nAt Princeton rather than analysis which had been the main focus before the war, the main area had moved towards algebra. In particular\nEmil Artin\nand\nClaude Chevalley\nwere running a seminar which Northcott attended and soon found himself attracted to the subject.\nArtin\nsuggested that he read papers by\nAndré Weil\nand soon Northcott was producing interesting results. Two papers he published in\n1949\n,\nAn inequality in the theory of arithmetic on algebraic varieties\nand\nA further inequality in the theory of arithmetic on algebraic varieties\ndeveloped\nWeil\n's ideas. After nearly two years at Princeton, Northcott returned to Cambridge where he had been awarded a research fellowship for St John's College. He held this for a total of six years, in addition being appointed an assistant lecturer during\n1949\n-\n51\n, then being promoted to lecturer. During this period at Cambridge he married Rose Hilda Austin in\n1949\n; they had two daughters Anne Particia\n(\nborn\n1950)\nand Pamela Rose\n(\nborn\n1952)\n.\nAlthough Northcott was happy in Cambridge, his family had now outgrown the college flat that he lived in so he decided to look for other openings. He did not have to wait long for he was appointed to the Town Trust Chair of Pure Mathematics at Sheffield in\n1952\n. He spent the rest of his career at Sheffield, The authors of\n[\n1\n]\nwrite:-\nWhen Douglas Northcott first joined the staff at the University of Sheffield, there was a single Department of Mathematics, he was the only professor, and the administrative head. Subsequently the department split into four departments: Pure Mathematics, Applied Mathematics, Probability and Statistics, and Computer Science. Northcott remained the head of a department for\n30\nyears, until his retirement in\n1982\n. Rose's unstinting support helped him cope with the demands of the headship\n(\nand other significant administrative roles, such as that of dean of Pure Science\n(\nin\n1958\n-\n61)\nand Vice-President of the\nLondon Mathematical Society\n(\nin\n1968\n-\n69))\n... Even though Douglas served as head for\n30\nyears, he was, with Rose's support, able to make time for writing seven books and about\n70\nresearch papers after his Ph.D.\nLet us now look briefly at some of these seven books. The first was\nIdeal theory\n(1953)\n. This is a delightful book which I\n[\nEFR\n]\npurchased as an undergraduate in the early\n1960\ns and which gave me a love of algebra. I S Cohen, reviewing the book, writes:-\nThis well-written book provides a self-contained treatment of certain portions of the modern theory of ideals in Noetherian rings, including the elements of the theory of local rings. No previous knowledge whatsoever of ring theory is assumed, and beginners to the subject will find here a very readable account. ... the presentation is clear and makes pleasant reading, and ... the book will encourage many who would not otherwise have done so to study ideal theory and algebraic geometry.\nNorthcott's\nIdeal Theory\nPreface is at\nTHIS LINK\n.\nIn\n1960\nNorthcott published\nAn introduction to homological algebra\n. D Buchsbaum writes:-\nThe author has written this book in order to acquaint the student of mathematics with the ideas and methods of homological algebra. He has assumed that the reader is familiar with the notions of group, ring, and field, but otherwise the presentation is self-contained. ... It should be pointed out that the author has used his talent for expository writing, and the book is very clear and easy to read.\nAnother text on homological algebra,\nA first course of homological algebra\n, appeared in\n1973\n. Northcott writes in the Preface that the book is designed:-\n... for a first course of homological algebra, assuming only a knowledge of the most elementary parts of the theory of modules. The amount of time available ... ruled out any approach which required the elaborate machinery or great generality that is sometimes associated with the subject. The alternative was to build the course round a number of\n[\ninteresting\n]\ntopics ... and create the necessary tools by ad hoc constructions.\nT W Hungerford, himself the author of excellent algebra texts, writes:-\n... anyone who believes that a first homological algebra course should include some \"applications\" and that a limited, concrete approach is the best way to prepare students for the high level of abstraction and generality of contemporary categorical algebra should seriously consider this book.\nFurther books followed such as\nFinite free resolutions\n(1976)\n,\nAffine sets and affine groups\n(1980)\n, and\nMultilinear algebra\n(1984)\n. A review by W V Vasconcelos of this last mentioned text begins:-\nThis book is a grand tour of the main objects of multilinear algebra, conducted in a spare, yet rich, fashion. It focuses on the construction of the tensor, exterior and symmetric algebras of a module over a commutative ring and, by bringing out some of their relationships, develops the theory of several associated structures.\nFinally we should mention the important collaboration between Northcott and\nDavid Rees\nwhich resulted in several papers, the importance of which is brought out beautifully in\n[\n1\n]\n.\nNorthcott retired in\n1982\nand in that year the\nLondon Mathematical Society\nheld a meeting in Sheffield in his honour. He had been honoured with election to the\nRoyal Society\nin\n1961\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}