{
  "nome_completo": "Duncan Liddel",
  "nome_curto": "Duncan Liddel",
  "ano_nascimento": "1561",
  "ano_morte": "1613",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Liddel/",
  "lugar_nascimento": "Aberdeen, Scotland",
  "lugar_morte": "Aberdeen, Scotland",
  "biografia": "Duncan Liddel\nwas the son of John Liddel who is described in\n[\n4\n]\nas \"a respectable citizen of Aberdeen.\" We note that Liddel's name sometimes appears as Liddell. He attended schools in Aberdeen where he gained an expertise in languages before entering King's College, Aberdeen, for his university education.\nBefore we continue with Liddel's biography, let us note that all his publications appear to be in medicine with none in mathematics. This is despite the fact that he appears to have been more interested in mathematics than any other topic. John Henry gives a plausible reason in\n[\n7\n]\n:-\n... Liddel wanted to make a career in mathematics, but that, like many others before him, he failed to do so, and turned instead\n(\nor, as well\n)\nto medicine - which was always, by strong contrast with mathematics, a reliable way to earn a steady, and often lucrative, income. Liddel's polymathy, in short, can be seen as the result of necessity rather than as the untrammelled ranging of an ambitious free spirit. I see Liddel as a mathematician first and foremost ...\nWe present a version of\n[\n4\n]\n(\nsee also\n[\n15\n]\nand\n[\n16\n]\n)\n, which gives a\n1790\nbiography of Liddel, at\nTHIS LINK\n.\nAfter studying at King's College, Aberdeen, Liddel appears to have been uncertain as to what career he should follow and, in\n1579\n, he left Scotland and travelled to Frankfurt an der Oder, now known as Frankfurt\n(\nOder\n)\na town in Germany close to the Polish border. The University of Frankfurt an der Oder had received its charter from Emperor Maximillian I in\n1500\nand from Pope Julius II in\n1506\n. By the time that Liddel went there, it had been reformed along the lines of Wittenberg University. There Liddel met fellow Scot, John Craig who influenced him greatly so we should give brief details of John Craig\n(\nwho must not be confused with the\nJohn Craig\nwho has a biography in this archive\n)\n.\nJohn Craig, the son of the Edinburgh tailor and merchant Robert Craig, had been taught mathematics and astronomy in Frankfurt an der Oder by\nPaul Wittich\n. Let us remark that Craig later returned to Scotland and became personal physician to James VI of Scotland\n(\nlater James I after the union of the crowns of England and Scotland\n)\n. Craig, although not a particularly good mathematician, is interesting, particularly in the light of a comment by the historian Anthony à Wood\n(1632\n-\n1695)\nthat\nNapier\ngot the idea for logarithms from a method brought back from the Continent by John Craig. It is certainly possible that the method referred to by Wood is one invented by\nWittich\nsince we know that\nWittich\nfound how to replace multiplication and division with addition and subtraction using the rules for sines and cosines of the sums and differences of angles. In one of his copies of\nDe revolutionibus\n,\nWittich\nused the blank space at the end of a chapter to write out an example of his method, known as prosthaphaeresis\n[\n2\n]\n:-\nAnd this was precisely one of the pages that John Craig had transcribed into his copy of 'De revolutionibus'\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nwhen he was being tutored by\nWittich\nin Frankfurt an der Oder in\n1576\n. In turn he took his annotated copy with him when he returned to Edinburgh, and he surely must have shown it to\nNapier\nwho was living in a castle in the area.\nBy October\n1579\n, when Liddel arrived at Frankfurt an der Oder,\nWittich\nwas back in Wrocław where he worked with Andreas Dudith. John Craig, however, was still in Frankfurt an der Oder at that time although, after around fifteen years on the Continent, he returned to Scotland around\n1582\n. Craig taught Liddel mathematics, philosophy and medicine. If Liddel had been unsure of what he should do before meeting Craig, there is no doubt that he was quickly convinced by Craig that mathematics was the subject for him. Liddel also\n[\n10\n]\n:-\n... entered the humanist and scientific circle of the Italo-Hungarian man of letters Andreas Dudith-Sbardellati\n(1533\n-\n1589)\nand the physician Crato von Krafftheim\n(1519\n-\n1585)\n.\nWhen Craig was preparing to leave Frankfurt an der Oder, he advised Liddel to go to Wrocław and study with\nPaul Wittich\n.\nLiddel studied under\nWittich\nat Wrocław for over a year before returning to Frankfurt an der Oder. There he gave private tuition in mathematics and philosophy but, perhaps thinking that this was not going to be a lucrative occupation, continued his study of medicine. In\n1587\nan epidemic broke out in Frankfurt an der Oder and Liddel left the town, moving to the University of Rostock. It may well be that Liddel went there at the suggestion of John Craig for, Johannes Caselius\n(1533\n-\n1613)\n, the Professor of Rhetoric at Rostock, clearly knew Craig and wrote to him about Liddel. Caselius wrote that Liddel is\n[\n4\n]\n:-\n... an excellent mathematician\n[\nin\n]\nthe more perfect knowledge of the Copernican system, and other astronomical questions. ... Mr Liddel was the first person in Germany, who explained the motions of the heavenly bodies, according to the three different hypotheses of\nPtolemy\n,\nCopernicus\n, and\nTycho Brahe\n.\nGeorge Molland says that Liddel went to meet\nTycho Brahe\nat Uraniborg, on the Danish island of Hveen, at least twice while he was at Rostock\n[\n11\n]\n:-\nLater the friendship\n[\nbetween Liddel and\nTycho Brahe\n]\nturned to enmity when\nBrahe\ncame strongly to suspect Liddel of plagiarizing his astronomical system, in which the sun rotated annually around the earth, the moon rotated about the earth, but the other planets circuited the sun. ... Liddel always claimed that he gave\nBrahe\nfull credit for his system, but he clearly added his own mathematical details, which was probably the source of the confusion.\nIt was Caselius who wrote a letter of recommendation for Liddel to the Academic Senate of Helmstadt, dated\n1\nJanuary\n1591\n, in which he stressed Liddel's mathematical expertise and his close connection to Brucaeus and his acquaintance with\nBrahe\n. On\n24\nJuly\n1591\nLiddel took up employment at the University of Helmstadt and spent many years teaching mathematics there. The University of Helmstadt, known as the Julian Academy after its founder Henry Julius\n(1564\n-\n1613)\n, Duke of Brunswick-Lüneburg, had been founded in October\n1576\n. It was a large Protestant university with four faculties, theology, law, medicine and philosophy. The magnificent auditorium, the Juleum Novum, opened in\n1592\nshortly after Liddel began teaching there. This wonderful building still stands in Helmstadt. The Julian Academy had two chairs of mathematics, and soon after he came to Helmstadt, Liddel was appointed to the lower of the two chairs. The higher chair was occupied by Erhard Hofmann\n(1544\n-\n1593)\n. Hofmann was the first mathematics professor at the Julian Academy with an annual salary of\n100\ngold florins. After having given two trial lectures about which a report was sent to the Duke of Brunswick-Lüneburg, Hofmann was appointed professor of mathematics with effect from\n22\nOctober\n1576\n. He was admitted to the faculty of philosophy on\n25\nApril\n1577\nand became dean of the faculty of philosophy six times and vice rector of the university in the winter semester of\n1584\n-\n85\n. In\n1593\nhe travelled from the university to settle a border dispute and, on his return journey, fell ill and died in March\n1593\nat Wolfsburg Castle. After his death, Liddel was promoted to the higher chair of mathematics at Helmstadt in\n1593\nand Simon Mencius, already the professor of Latin, was appointed to the lower chair. In his first year of teaching in the higher chair Liddel gave the two courses\n(\ni\n)\nGeometriae fundamenta figurarum usum et geodesiam una cum triangulorum doctrina\nⓉ\n(\nFoundations of geodesic geometry with triangles\n)\nand\n(\nii\n)\nTheoriae coelestium motuum iuxta triplicem hypothesin una cum tabularum tum Alphonsinarum quam Prutenicarum explicatione\nⓉ\n(\nTheory of celestial motion and explanations of the Alphonsine and Prutenic tables\n)\n. For the next nine years\n[\n3\n]\n:-\n... he gave repeated courses of lectures on geometry, astronomy, and universal geography; instructing his pupils in the whole circle of mathematical science, and particularly in the new theories of the planetary system, which until his time were very imperfectly understood or taught in that country.\nMore details of his teaching are given in\n[\n10\n]\n:-\nProfessor Liddel's lectures are apparently the most ambitious, as he lectured on advanced scientific books:\nTycho Brahe\n's 'De mundi aetherei recentioribus phaenomenis'\n(\nUraniborg,\n1588)\nfor planetary theory and\nJohannes Regiomontanus\n's 'Tabulae directionum'\nⓉ\n(\nTables of directions\n)\nfor trigonometry. It is also plausible that he used\nCopernicus\n's 'De revolutionibus orbium coelestium'\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n, of which he owned two copies, to introduce the heliocentric hypothesis, as announced in the syllabi. Even relative to geography, he sought to integrate classical and modern sources, as he lectured on Pomponius Mela as well as on \"histories and descriptions of lands according to the most recent\n[\nexplorers\n]\n\"\n(\nhistoria et descriptione regionum secundum recentiores\nⓉ\n(\nRecent history and description of regions\n)\n)\n. One can assume that he employed a book like Simon Grynaeus's 'Novus orbis', a collection of reports on Western as well as Oriental countries.\nHe did not only teach mathematics for, in\n1596\nhe obtained an M.D., was admitted to the Faculty of Medicine, and taught in that faculty in addition to his mathematical commitments. He taught in both faculties until\n1600\nwhen he resigned his chair of mathematics. It was filled by Heinrich Schaper\n(1560\n-\n1629)\nwho, after the death of Simon Mencius in\n1606\n, held both chairs. Liddel remained in Helmstadt until\n1607\n, but he was involved in another quarrel\n[\n10\n]\n:-\nLiddel was also involved, along with Caselius, the logician Cornelius Martini\n(1568\n-\n1621)\n, and the professor of Aristotelian philosophy Owen Günther\n(1532\n-\n1615)\nin a quarrel concerning the dignity of philosophy which burst out between\n1598\nand\n1601\n, after the professor of theology Daniel Hofmann\n(1538\n-\n1611)\naccused philosophers of being the fathers of all heresies. The polemic, known as the 'Hofmannstreit', ended with the success of the professors of the philosophical faculty against the intransigent theologian, also thanks to the intervention of professors at the University of Rostock and Duke Heinrich Julius. Liddel stayed in Helmstedt until\n1607\n, when he returned to Aberdeen with his mathematical books, among which were two copies of 'De revolutionibus'\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nand a rare handwritten copy of\nCopernicus\n's 'Commentariolus'\nⓉ\n(\nCommentaries\n)\n.\nBack in Scotland, Liddel lived on his estate at Pitmedden, within a few kilometres of Aberdeen. On\n12\nJuly\n1612\nhe was at Edinburgh, where he subscribed his first deed of settlement. On\n9\nDecember\n1613\nhe executed another deed of settlement this time at Aberdeen. With these settlements, Liddel\n[\n13\n]\n:-\n... left money to found the Chair of Mathematics at Marischal College under the patronage of the Town Council, he left money for bursaries that would enable poor students to attend the College, he donated his extensive library of books on Astronomy, Mathematics and Medicine along with his mathematical instruments to Marischal College, in addition to his estate, and he left money for the Town Council to erect a splendid memorial plaque in St Nicholas Church. Personally, he was never a student of Marischal College\n(\nit was founded when he was\n32)\nnor a member of its staff. In return, a large ornamental granite memorial was erected by the Senatus in\n1637\non his donated land near Dyce. The monument still stands today in excellent condition. His books, which are now some\n400\nyears old, are an extremely valuable resource among the Historic Collections of the University Library and include a first edition of\nCopernicus\n's 'De Revolutionibus'\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n, a copy of\nCopernicus\n' very rare 'Commentariolus'\nⓉ\n(\nCommentaries\n)\nand other works from the very early years of modern astronomy.\nJohn Stuart writes\n[\n4\n]\n:-\nDr Liddel, having never been married, left the remainder of his fortune to his brother, John Liddel, and a sister, both of whom had children, and some of whose descendants are still alive in Aberdeen\n[\nNote: This was written in\n1790]\n. One son of his brother John is well known to have succeeded Dr William Johnston in the mathematical chair endowed by his uncle; but the young man having acted imprudently, was, according to the author here referred to, most unjustly deprived of his office.",
  "math_areas": [
    "Geometry"
  ]
}