{
  "nome_completo": "Earle Raymond Hedrick",
  "nome_curto": "Earle Raymond Hedrick",
  "ano_nascimento": "1876",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hedrick/",
  "lugar_nascimento": "Union City, Randolph, Indiana, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Earle Raymond Hedrick\n's parents were Simon Peter Hedrick\n(1835\n-\n1923)\nand Amy Isabella Vail\n(1838\n-\n1923)\n. Simon Hedrick was born in Violet, Fairfield county, Ohio and came from a Dutch family who had emigrated to Pennsylvania around\n1670\n. The name seems to have originally been Hetrig but was later changed to Hedrick. After attending Liber College and Lebanon Normal School, Lebanon, Ohio, Simon became a school teacher and taught in Mercer and Darke Counties, Ohio, and in Randolph county, Indiana. Several of these years were spent teaching in schools in Union City, Ohio, and Indiana. He gave up teaching for health reasons and became a carpenter, then a lumber dealer before becoming a grain dealer. He married Amy Isabella Vail, the daughter of William Vail and Lydia Vorhees, on\n3\nMay\n1860\nin Portland, Indiana. Simon and Amy Hedrick had four children: Aurie Hedrick\n(1864\n-\n1938)\n, Blanche Estella Hedrick\n(1868\n-\n1941)\n, Simon Clyde Hedrick\n(\nborn\n1874)\nand Earle Raymond Hedrick, the subject of this biography. Let us record here that Aurie Hedrick graduated from Union City High School in\n1880\n, studied at the University of Michigan and continued her studies of mathematics at Leipzig. She also studied music at Frankfurt an Main. She married professor Ernst Voss and taught mathematics in high schools in Union City, Indiana, Oak Park, Illinois, Saginaw, Michigan, and Madison for\n42\nyears.\nThe Hedrick family moved to Ann Arbor and Earle attended High School there from\n1891\nto\n1892\npreparing to enter the University of Michigan. He studied at the University from\n1892\nto\n1896\n, graduating with an A.B. He then spent a year as a teacher of mathematics at the High School in Sheboygan, Wisconsin, before beginning graduate studies at Harvard University in\n1897\n. W B Ford writes that at Harvard\n[\n8\n]\n:-\n... his talents were soon recognized by both faculty and students. It was my fortune to have been one of these fellow students at the time and I can testify that Hedrick's keen mind was quite the envy of the aspiring young group of that period. While most of us followed the customary practice of taking notes during a lecture and felt obliged to work over them ponderously later, Hedrick seemed to grasp all instantly. He would ply the lecturer from time to time with inquiries indicating fine discriminations of thought such as arise from possible exceptional cases or bearings in related fields. To me at least his performance was little less then phenomenal.\nAt Harvard his studies were directed by\nMaxime Bôcher\nand\nWilliam Osgood\namong others and he was awarded his Master's degree in\n1898\n. While at Harvard he wrote his first paper\nOn three dimensional determinants\n(1899\n/\n1900)\nwhich was published in the\nAnnals of Mathematics\n. In this paper Hedrick write:-\nA considerable portion of the material for this paper was prepared in collaboration with Mr W D Cairns, now of Oberlin College,\n0\nhio; but he should not be held responsible for any statements made in it.\nThe W D Cairns who Hedrick mentions in this quote is William DeWeese Cairns\n(1871\n-\n1955)\n. Cairns was a graduate student at Harvard from\n1896\nto\n1898\nso overlapped with Hedrick for two years. He later worked closely with Hedrick on projects that we will mention below.\nOsgood had studied at Göttingen undertaking research for two years there advised by\nFelix Klein\n. He had received a Parker fellowship from Harvard to study abroad and it is likely that he advised Hedrick to follow the same course. Hedrick was awarded the Parker fellowship and he spent the sessions\n1899\n-\n00\nand\n1900\n-\n01\nat the University of Göttingen in Germany. There he profited greatly by attending lectures by\nDavid Hilbert\n,\nFelix Klein\nand other exceptional mathematicians. He was awarded a doctorate by Göttingen in February\n1901\nfor a dissertation, supervised by\nHilbert\n,\nÜber den analytischen Charakter der Lösungen von Differentialgleichungen\n(\nOn the analytic character of solutions of differential equations\n)\n. Harvard awarded Hedrick a scholarship for a third year to study at the École Normale Supérieure in Paris and there he spent part of\n1901\nin contact with\nEdouard Goursat\n,\nÉmile Picard\n,\nJacques Hadamard\n,\nPaul Appell\nand\nJules Tannery\n. This strengthen his interests in differential equations, the calculus of variations, and functions of a real variable which he would work on for the rest of his life. It also led to Hedrick translating\nGoursat\n's\nCours d'Analyse\ninto English which provided an important text for American students. His time in Göttingen also led to his next two mathematical papers. He published\nOn the Sufficient Conditions in the Calculus of Variations\n(1902)\nin which he writes:-\nThe sufficient conditions in the calculus of variations have recently received a great deal of attention; and it would seem fitting that attempts be made to simplify their discussion whenever possible, and to render the agreement more exact between the known necessary and the known sufficient conditions. Such is the purpose of this paper, which also seeks to present the sufficient conditions in compact form. The work will to a large extent follow lectures delivered at Göttingen by Professor\nHilbert\n,\n1899\n-\n1901\n.\nThe second of these two papers is the two-part paper\nOn the characteristics of differential equations\nboth parts of which appeared in the\nAnnals of Mathematics\nin\n1903\n. He writes:-\nThe importance of the theory of characteristics in the study of differential equations is well known to all who are interested in that subject. The ordinary developments are, however, somewhat lacking in rigour. It is the purpose of this paper to present, in somewhat altered form, a new method for the introduction and treatment of characteristics, devised by\nHilbert\nand given by him in lectures at Göttingen\n1900\n-\n1901\n.\nAfter returning to the United States, Hedrick married Helen Breedon Seidenstricker on\n21\nOctober\n1901\n. They had nine children of their own and one adopted girl. The children are: Edith Vail Hedrick\n(\nborn\n1903)\n, Helen B Hedrick\n(\nborn\n1904)\n, Dorothy Jane Hedrick\n(\nborn\n1906)\n, Earl Raymond Hedrick\n(\nborn\n1907)\n, Amy Isabella Hedrick\n(\nborn\n1909)\n, Rachel Esther Hedrick\n(\nborn\n1910)\n, Clyde Lewis Hedrick\n(\nborn\n1911)\n, Frank J Hedrick\n(\nborn\n1913)\n, Margaret Hedrick\n(\nborn\n1913\n, died aged\n2\nmonths\n)\n, and Elizabeth B Hedrick\n(\nborn\n1915)\n.\n[\nWe note that the years of birth are only approximate and are worked out from their given age at the time of a Census. Also note that Dorothy, Amy, Clyde and Frank went on to attend the University of California at Los Angeles.\n]\nHedrick was appointed an instructor in mathematics in the Sheffield Scientific School at Yale University, a post he held from\n1901\nto\n1903\n. In\n1903\nhe was appointed professor of mathematics at the University of Missouri and remained there until\n1920\n. During World War I he served as director of mathematics to the army Educational Corps in the American Expeditionary Force. In\n1920\nhe was appointed professor of mathematics, and head of department, at the University of California at Los Angeles. In\n1937\nhe became the Vice-president and Provost of the University of California. The Academic Senate Committee consisting of\nWilliam M Whyburn\n, Bennet M Allen and Waldemar Westergaard write\n[\n20\n]\n:-\nAs a member of the University of California faculty, Dr Hedrick exhibited qualities of leadership which resulted in his participation in almost every major activity or development that occurred during his period of service. This was especially true on the Los Angeles campus where he had a vital, consuming interest and where he visualized unlimited possibilities for growth. From the outset he urged that faculty and students strive constantly toward the development of a major university atmosphere, and he insisted that the high standards of a great university be maintained - both by the students in their classroom work and by the faculty in their research and teaching. Although he subscribed fully to the principle that the true growth of the University would be insured only if carefully chosen scholars were added to the faculty when and where needed to stimulate continued growth on the part of the staff, he recognized the fact that the real reputation and standing of the University would be determined by the combined scholarly activities of an inspired faculty constantly striving toward a single goal of high intellectual achievement. Through his research, editorial work, and regular attendance at scientific meetings, he did much to focus attention on the Los Angeles campus as a growing centre of research. As a high administrative officer, he directed his full energies to actions which would enhance the reputation of the University in all of its fields of activity. By performing his manifold duties on the Los Angeles campus with wisdom and foresight, Dr Hedrick exercised a great influence throughout the University, and this influence extended to other universities of the country through his expert analysis of complex administrative matters. Wherever he went, his counsel was diligently sought on problems spread over a wide range. He quickly focused his keen mind on any problem and invariably contributed much toward a complete solution.\nIn addition to his research in pure mathematics, Hedrick was also interested in applications of mathematics and he wrote papers on a generalised form of Hooke's law and the transmission of heat in boilers. He became an active member of the Society for the Promotion of Electrical Engineering, the American Society of Mechanical Engineering and the American Institute of Electrical Engineers.\nHedrick's editorial work, however, was extraordinary. He was editor of the\nAmerican Mathematical Monthly\nfrom\n1913\nto\n1915\n, editor-in-chief of the\nBulletin\nof the\nAmerican Mathematical Society\nfrom\n1921\nto\n1937\n, he was editor of\n34\nvolumes in the Engineering Science Series and\n35\nvolumes in the Series of Mathematical Texts. In addition to his editorial work for the\nAmerican Mathematical Society\nhe was vice-president in\n1916\nand president in\n1929\n-\n30\n. He was also president of the\nMathematical Association of America\nin\n1916\n. This came about is a slightly strange way. While he was editor of the\nAmerican Mathematical Monthly\n, there was a suggestion that the\nAmerican Mathematical Society\nshould extend its interests to college mathematics and take over running the\nMonthly\n. Others suggested the creation of a new organisation to cover this area and to run the\nMonthly\n. Hedrick favoured the\nAmerican Mathematical Society\noption and wrote on\n28\nApril\n1914\n:-\nI am firmly opposed to the creation of an organization other than the Society which should undertake to support the 'Monthly' and ask the support as members of these people. Indeed, unless absolutely forced, I would refuse to join in the formation of such an organization other than the Society.\nHowever in\n1915\nthe\nAmerican Mathematical Society\ndecided that it did not want to run the\nMonthly\nand pushed for the creation of a new organisation. Despite saying that he would refuse to join such an organisation, nevertheless Hedrick, as editor of the\nMonthly\n, presided over the founding meeting of the\nMathematical Association of America\non\n30\n-\n31\nDecember\n1915\nat Columbus. At this meeting Hedrick was elected as the first president of the\nMathematical Association of America\n. He wrote\n[\n15\n]\n:-\nNo man can speak with authority concerning the future of this new Association which was created by those who met at Columbus last December. Its future lies with those who constitute its membership. ... The great fact which we cannot overlook is that we now have a large and representative body of men and women interested in mathematics joined together in this association to foster whatever they believe to be worthy and beneficial.\nThe Association did indeed flourish and\n27\nyears later Hedrick wrote\n[\n10\n]\n:-\nTwenty-seven years have now passed since the\nMathematical Association of America\nwas founded. During this time its membership has increased to considerably more than twice the eleven hundred charter members; meetings are held in twenty-two different sections throughout the country; and an ambitious program of periodical and book publication, and of sponsorship of other periodicals and of prize competitions, has come to fruition.\nFor further quotes by Hedrick on mathematics, the\nAmerican Mathematical Monthly\nand the\nMathematical Association of America\n, see\nTHIS LINK\n.\nWe noted above that W D Cairns and Hedrick were friends from their time as graduate students at Harvard. Cairns served on the editorial board of the\nAmerican Mathematical Monthly\n, beginning in\n1913\n, and was elected Secretary-Treasurer of the\nMathematical Association of America\nat its founding meeting. Cairns and Hedrick were therefore close colleagues over many years.\nHedrick had only one Ph.D. student, Eula Adeline Weeks. She graduated with a Ph.D. from the University of Missouri in\n1915\n. Judy Green and Jeanne LaDuke write in\n[\n9\n]\n:-\nEula Weeks\n(\nKing\n)\n, who earned her Ph.D. in\n1915\n, was vice president of the National Council of teachers of Mathematics\n1922\n-\n23\nand was a member of the board of directors\n1923\n-\n26\nwhile teaching in a high school in St Louis. She also served on the National Committee on Mathematical Requirements. This committee, chaired by Dartmouth's J W Young, \"included mathematicians\nE H Moore\n,\nOswald Veblen\n, and\nDavid E Smith\nin addition to several prominent teachers and administrators from the secondary school system.\" The\n1923\nreport of the committee was published by the\nMathematical Association of America\n.\nArchibald relates that his main hobby is carrying out\n[\n2\n]\n:-\n... long-continued experiments in crossing varieties of flowers to produce new types.\nHe was described in\n[\n5\n]\nas:-\nA tall, courtly man with a delightful sense of humour, Dr Hedrick jokingly referred to his appointment as Vice President and Provost as \"The Accident,\" telling friends that \"I no longer have any intellectual interests - I just sit and talk to people.\"\nHedrick is buried in Glendale City, Los Angeles county, California in the Forest Lawn Memorial Park which is a cemetery famous for its elaborate statues and reproductions of famous shrines and works of art. W B Ford writes\n[\n8\n]\n:-\nThose who knew Hedrick best will miss most his genial companionship and sincere spirit of friendship.\nVirgil Snyder\nwrites\n[\n17\n]\n:-\nIn all his numerous and exacting duties, each performed with great patience and consummate skill, the main characteristic of this man was his consideration of human attributes. He was always interested, he was always sympathetic and he was always helpful.\nAmong the honours given to Hedrick after his death we mention Hedrick Hall at the University of California at Los Angeles\n[\n5\n]\n:-\nThe fourth of the residence halls on the west side of the campus was named Hedrick Hall in\n1963\n(\ncompleted in\n1964)\nin honour of Earle Raymond Hedrick, Vice President and Provost of UCLA from\n1937\nuntil his retirement in\n1942\n. Prior to his elevation he had been a member of the mathematics department for\n13\nyears.\nAlso, the Earle Raymond Hedrick lectures were established by the\nMathematical Association of America\nin his honour. The first Earle Raymond Hedrick lecturers were\nTibor Radó\nin\n1952\nand\nPaul Halmos\nin\n1953\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Topology"
  ]
}