{
  "nome_completo": "Eberhard Frederich Ferdinand Hopf",
  "nome_curto": "Eberhard Hopf",
  "ano_nascimento": "1902",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hopf_Eberhard/",
  "lugar_nascimento": "Salzburg, Austria",
  "lugar_morte": "Bloomington, Indiana, USA",
  "biografia": "Eberhard Hopf\n, an Austrian mathematician who made significant contributions in\ntopology\nand\nergodic theory\n, was born in Salzburg. Most of his scientific formation, however, was in Germany, where he received a Ph.D. in Mathematics in\n1926\nand, in\n1929\n, his\nHabilitation\nin Mathematical Astronomy from the University of Berlin.\nIn\n1930\nHopf received a fellowship from the Rockefeller Foundation to study classical mechanics with\nBirkhoff\nat Harvard in the United States. He arrived Cambridge, Massachusetts in October of\n1930\nbut his official affiliation was not the Harvard Mathematics Department but, instead, the Harvard College Observatory. While in the Harvard College Observatory he worked on many mathematical and astronomical subjects including topology and ergodic theory. In particular he studied the theory of measure and invariant integrals in ergodic theory and his paper\nOn time average theorem in dynamics\nwhich appeared in the\nProceedings of the National Academy of Sciences\nis considered by many as the first readable paper in modern ergodic theory. Another important contribution from this period was the\nWiener-Hopf equations\n, which he developed in collaboration with\nNorbert Wiener\nfrom the Massachusetts Institute of Technology. By\n1960\n, a discrete version of these equations was being extensively used in electrical engineering and geophysics, their use continuing until the present day. Other work which he undertook during this period was on stellar atmospheres and on elliptic\npartial differential equations\n.\nOn\n14\nDecember\n1931\n, with the help of\nNorbert Wiener\n, Hopf joined the Department of Mathematics of the Massachusetts Institute of Technology accepting the position of Assistant Professor. Initially he had a three years contract but this was subsequently extended to four years\n(1931\nto\n1936)\n. While at MIT, Hopf did much of his work on ergodic theory which he published in papers such as\nComplete Transitivity and the Ergodic Principle\n(1932)\n,\nProof of Gibbs Hypothesis on Statistical Equilibrium\n(1932)\nand\nOn Causality, Statistics and Probability\n(1934)\n. In this\n1934\npaper Hopf discussed the method of arbitrary functions as a foundation for\nprobability\nand many related concepts. Using these concepts Hopf was able to give a unified presentation of many results in ergodic theory that he and others had found since\n1931\n. He also published a book\nMathematical problems of radiative equilibrium\nin\n1934\nwhich was reprinted in\n1964\n. In addition of being an outstanding mathematician, Hopf had the ability to illuminate the most complex subjects for his colleagues and even for non specialists. Because of this talent many discoveries and demonstrations of other mathematicians became easier to understand when described by Hopf.\nIn\n1936\n, at the end of the MIT contract, Hopf received an offer of full professorship in the University of Leipzig. As a result of this Hopf, with his wife Ilse, returned to Germany which, by this time, was already being ruled by the Nazi party. In Leipzig Hopf undertook research on quantic mechanics\n(1937)\n,\nGeodesics on manifolds of negative curvature\n(1939)\n,\nStatistik der geod\n(1939)\nand on the influence of curvature of a closed Riemannian manifold on its topology\n(1941)\n.\nOne important event from this period was the publication of the book\nErgodentheorie\nⓉ\n(\nErgodic theory\n)\n(1937)\n, most of which was written when Hopf was still at the Massachusetts Institute of Technology. In that book containing only\n81\npages, Hopf made a precise and elegant summary of ergodic theory. In\n1940\nHopf was on the list of the invited lecturers to the International Congress of Mathematicians to be held in Cambridge, Massachusetts. Because of the start of World War II, however, this Congress was cancelled.\nIn\n1942\nHopf was drafted to work in the German Aeronautical Institute. In\n1944\n, one year before the end of World War II, Hopf was appointed to a professorship at the University of Munich. He held this post until\n1947\nby which time he had returned to the United States, where he presented the definitive solution of\nHurewicz\n's problem. On\n22\nFebruary\n1949\nHopf became a US citizen. He joined Indiana University as a Professor in\n1949\n, a position he held until he retired in\n1972\n. In\n1962\nhe was made Research Professor of Mathematics, staying in that position until his death.\nAn important publication from this period was\nAn inequality for positive linear integral operators\n(1963)\nwhich appeared in the\nJournal for Mathematics and Mechanics\n. This paper is concerned with some extensions of Jentzsch's theorem on the existence of a positive eigenfunction for a positive integral operator.\nIn\n1971\nHopf was the\nAmerican Mathematical Society\nGibbs\nLecturer. Coming out of this lecture was a paper\nErgodic theory and the geodesic flow on surfaces of constant negative curvature\nwhich he published in the\nBulletin of the American Mathematical Society\n. Hopf wrote in the introduction to that paper:-\nFamous investigations on the theory of surfaces of constant negative curvature have been carried out around the turn of the century by\nF Klein\nand\nH Poincaré\nin connection with complex function theory. The theory of the geodesics in the large on such surfaces was developed later in the famous memoirs by\nP Koebe\n. This theory is purely topological. The measure-theoretical point of view became dominant in the later thirties after the advent of ergodic theory, and the papers of G A Hedlund and E Hopf on the ergodic character of the geodesic flow came into being. The present paper is an elaboration of the author's\nGibbs\nlecture of this year\n[1971]\nand at the same time of the author's paper of\n1939\non the subject, at least of its part concerning constant negative curvature.\nHopf was never forgiven by many people for his moving to Germany in\n1936\n, where the Nazi party was already in power. As a result most of his work to ergodic theory and topology was neglected or even attributed to others in the years following the end of World War II. An example of this was the dropping of Hopf's name from the discrete version of the so called Wiener-Hopf equations, which are currently referred to as \"Wiener filter\".\nIn\n[\n4\n]\nIcha summarises Hopf's mathematical achievements:-\nHis interests and principal achievements were in the fields of partial and ordinary\ndifferential equations\n,\ncalculus of variations\n, ergodic theory, topological dynamics,\nintegral equations\n,\ndifferential geometry\n, complex function theory and\nfunctional analysis\n. Hopf's work is also of the greatest importance to the hydrodynamics, theory of turbulence and radiative transfer theory.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}