{
  "nome_completo": "Edward Alexander Bouchet",
  "nome_curto": "Edward Bouchet",
  "ano_nascimento": "1852",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bouchet/",
  "lugar_nascimento": "New Haven, Connecticut, USA",
  "lugar_morte": "New Haven, Connecticut, USA",
  "biografia": "Edward Alexander Bouchet\nwas the son of William Francis Bouchet\n(1817\n-\n1885)\nand Susan Cooley\n(1817\n-\n1920)\n. William Bouchet was born in South Carolina, but moved to New Haven where he worked as a slave for a plantation owner. The plantation owner freed him from slavery and gave him money to start a business. He worked as an unskilled labourer and later in life became a porter at Yale College\n(\nnow Yale University\n)\n. He became prominent in the Black community of New Haven, serving as deacon of the Congregational Church on Temple Street, the oldest church in the city for Blacks formally recognised in\n1829\n. Susan Cooley, the daughter of Asher Cooley and Jane Drake was born in Westport, Fairfield, Connecticut. Throughout her long life she appears on many census forms, her \"Race\" being given as \"Black\", \"Coloured\" or, at least once, as \"Mulatto\"\n(\nmeaning mixed race\n)\n. Susan washed laundry for Yale College students.\nWilliam Bouchet married Susan Cooley in the Congregational Church in New Haven on\n15\nMay\n1841\n. The Reverend Amos G Beman married them. He was:-\n... pastor of the Temple Street Church from\n1838\nto\n1857\n, a noted temperance lecturer, anti-slavery agitator, agent and station master of the Underground Railway, and tireless worker for Negro Suffrage in Connecticut.\nWilliam and Susan Cooley had four children: Jane Hannah Bouchet\n(1843\n-\n1900)\n, Frances Bouchet\n(1845\n-\n1930)\n, Georgianna Bouchet\n(1849\n-\n1924)\nand Edward Alexander Bouchet\n(1852\n-\n1918)\n, the subject of this biography. At this time there was total segregation in school education and Edward\nBouchet attended the first school in New Haven for African Americans, the Artisan Street Colored School. This was a small school with thirty pupils which had only one teacher, Sarah Wilson. She was a black teacher who had opened a school for African Americans in her own house in\n1854\n. Bouchet attended this school until\n1866\nwhen he entered New Haven High School. In fact Sarah Wilson played an important role in Bouchet's career since she encouraged him to learn and to make the most of his obviously exceptional academic abilities. He was accepted by Hopkins Grammar School in\n1868\nand there he studied history, mathematics, Greek, and Latin for two years, graduating in June\n1870\nranked first in his year. Hopkins Grammar School was a private boys school which trained its students in classics and in science to prepare them for entry to Yale College.\nWe are unsure exactly when Edward\nBouchet's father, William, became a janitor at Yale College. On the\n1860\ncensus his occupation is given as \"Helper\" while by the time of the\n1870\ncensus he was a janitor at Yale College\n(\nnow Yale University\n)\n. The fact that Bouchet's father worked at Yale College must have played a role in him wanting his son to study there. In fact, Edward Bouchet was not the first African American student at Yale, the first being Richard Henry Green who graduated in\n1857\n. There may have been one or two African American students at Yale in the\n1860\ns when Bouchet's father began working there so he would have seen that it was not impossible for his son to attend.\nEdward Bouchet entered Yale College in September\n1870\nand graduated\nsumma cum laude\nwith a B.A. in\n1874\n. He took courses in German, French, Greek, Latin, mathematics, mechanics, physics, and astronomy. His marks were high in all his subjects but his best mark was in mathematics. He graduated ranked sixth out of a class of\n124\nstudents. He was elected a member of Yale's chapter of the Phi Beta Kappa Honorary Society, becoming the second African American in the Society. The Yale chapter of Phi Beta Kappa had been inactive for a few years so Bouchet was not elected Phi Beta Kappa until\n1884\n. George Washington Henderson\n(1850\n-\n1936)\nof the University of Vermont was elected Phi Beta Kappa in\n1877\nso the delay at Yale meant that Bouchet was denied the honour of being the first African American Phi Beta Kappa.\nBouchet now had some luck\n[\n17\n]\n:-\nAs a talented young black man interested in science, Bouchet had come to the attention of Alfred Cope, a philanthropist in Philadelphia who was on the board of managers for the Institute for Colored Youth. The Institute for Colored Youth was one of the few places in the city where black students could get an academic high school education. Cope wanted to build up the science program there, and hoped to bring Bouchet onto the staff. But before recruiting him as a teacher, Cope encouraged Bouchet to continue his studies, and paid for his graduate education at Yale.\nHe then undertook research and, two years later in June of\n1876\n, he was awarded a Ph.D. degree in Physics from Yale College. He was advised by Arthur Williams Wright\n(1836\n-\n1915)\n, the first scientist to be awarded a Ph.D. outside Europe. Bouchet's dissertation was on geometrical optics and it had the title \"Measuring Refractive Indices.\" This achievement made him the first African American to be awarded a Ph.D. To measure this achievement, we note that he was only the sixth person to be awarded a Ph.D. in physics by Yale.\nSadly Bouchet's race meant that he had a very different career than he deserved with his qualifications. His applications for a university position were unsuccessful, certainly because of racial discrimination. As a result, he accepted Alfred Cope's offer of a position at the Institute for Colored Youth in Philadelphia. This Institute had been set up by the Quaker, Richard Humphreys, in\n1837\nas a school for boys but in\n1852\nit had become a prominent coeducational private primary and high school. When Bouchet was appointed to the Institute, its Principal was Fanny Jackson Coppin\n(1837\n-\n1913)\n, the first black woman in the United States to be the head of an institution of higher learning. Before becoming Principal, Coppin had taught Greek, Latin, and mathematics at the Institute\n[\n17\n]\n:-\nAt the Institute for Colored Youth, Bouchet headed the school's new science program. In addition to physics and chemistry, Bouchet taught classes in astronomy, physical geography, and physiology. An advocate for improving science education, Bouchet repeatedly asked the school's board of managers to provide laboratory space for students to perform individual experiments. In addition to his regular teaching, Bouchet gave lectures on various scientific topics for students and staff, and even reached out to the wider community by giving public lectures on science.\nBouchet joined the African Episcopal Church of St Thomas in Philadelphia, taking an active role on the vestry and as church secretary for many years. Appointed a lay reader by the bishop, he took an active part in the church services. This Church provided a focal point for Philadelphia's African Americans\n[\n6\n]\n:-\nBouchet took his scientific interests and abilities beyond the Institute for Colored Youth into the broader black community, giving public lectures on various scientific topics. He was also a member of the Franklin Institute, a foundation for the promotion of the mechanical arts, chartered in\n1824\n. Bouchet maintained his ties with Yale through the local chapter of the Yale Alumni Association, attending all meetings and annual dinners.\nAround\n1900\nthere was a movement to have African Americans study technical subjects and not academic subjects. The main leader of the African American community at this time was Booker Taliaferro Washington\n(1856\n-\n1915)\nwho believed that the way forward for the community was to built economic strength through giving African Americans industrial skills rather than academic ones\n[\n18\n]\n:-\nWhen Coppin retired as principal in\n1901\n, the Quaker managers were persuaded by Booker T Washington to change the classical thrust of the institution and replace it with a more industrial curriculum. Consequently, the Institute for Colored Youth closed its doors in Philadelphia in\n1902\nand moved to Cheyney, Pennsylvania, where it subsequently became Cheyney State College.\nThe immediate consequence in this change of direction for the Institute for Colored Youth was that the skilled academic Bouchet was no longer needed and he lost his job in\n1902\n, fired by the all-white board. From September\n1902\nto November\n1903\n, Bouchet taught mathematics and physics at the Charles H Sumner High School in St Louis, Missouri, the only black public high school in the city. From November\n1903\nto May\n1904\n, he was the business manager of the Provident Hospital in St Louis, a small facility run by African-American physicians for their patients.\nThe Louisiana Purchase Exposition\n(\nalso known as the St Louis World's Fair\n)\nwas an international trade fair was exhibition spaces for over\n60\ncountries held from May to December\n1904\n. Bouchet was employed as U.S. Inspector of Customs at Ceylon Court, the exhibition site for Ceylon. In October\n1906\nBouchet became manager of the St Paul's Normal and Industrial School at Lawrenceville, Brunswick County, Virginia. This school was founded by the Episcopal priest and educator Archdeacon James S Russell in\n1888\nto educate African Americans. In September\n1908\n, Bouchet became principal of the Lincoln High School at Gallipolis, Ohio. All African American children in Gallipolis had to attend this school, built in\n1868\n, and only in\n1918\n, the year Bouchet died, did segregation at high schools in the town ease.\nBouchet left Lincoln High School in\n1913\nwhen his health deteriorated with an attack of arteriosclerosis. He returned to his home in New Haven but an improvement in his health saw him accept a position on the faculty of Bishop College in Marshall, Texas. This College had been founded by the Baptist Home Mission Society in\n1881\nto educate Baptist African Americans. Despite being founded to educate African Americans, most of the staff up to the time of Bouchet's appointment were European Americans. Only ten years after Bouchet's death did the College appoint an African American as president. In\n1916\nill health again forced Bouchet to resign and, once again, he returned to his home in New Haven.\nWe know surprisingly little about Bouchet as a person since he left no writings with his thoughts on education or any other topic. A friend wrote in an obituary\n(\nsee\n[\n17\n]\n)\nthat Bouchet was:-\n... a man of keen sensibilities and unusual refinement. He was a prolific reader and was greatly interested in the history of his own people and of his native town.\nBouchet never married and had no children. He died of heart failure in his home at New Haven and was buried in Evergreen Cemetery, New Haven.\nIn recent years many honours have been given to Bouchet. For example: he was a\n2019\nhonouree of the National Society of Black Physicists\n[\n11\n]\n: the American Physical Society makes the Edward A Bouchet Award\n[\n9\n]\n; the Edward Alexander Bouchet Graduate Honor Society was inaugurated by Yale University and Howard University on\n15\nSeptember\n2005\n, in commemoration of Bouchet's birthday\n[\n5\n]\n; Yale University holds the Annual Yale Bouchet Conference on Diversity and Graduate Education\n[\n2\n]\n; and the Edward Bouchet Abdus Salam Institute is named for him.\nLet us say a little more about some of these honours.\nIn\n1988\n, the Edward Bouchet Abdus Salam Institute\n[\nnamed at that time as the Edward A Bouchet - International Centre for Theoretical Physics Institute\n]\nwas created by Professor Abdus Salam, the Nobel Laureate and Founding Director of the International Centre for Theoretical Physics\n[\nit is now named the Abdus Salam International Centre for Theoretical Physics\n]\nand the Distinguished Professor of Science and Engineering and Professor of Physics and First Chair of the Edward Bouchet Abdus Salam Institute, Dr Joseph Andrew Johnson III.\nThe Edward Alexander Bouchet Graduate Honor Society\n(\nBouchet Society\n)\nwas named for the first African American doctoral recipient in the United States. It recognises outstanding scholarly achievement and promotes diversity and excellence in doctoral education and the professoriate. The Bouchet Society is a network of preeminent scholars who exemplify academic and personal excellence, foster environments of support and serve as examples of scholarship, leadership, character, service, and advocacy for students who have been traditionally underrepresented in the academies.\nThe Edward A Bouchet Award promotes the participation of underrepresented minorities in physics by identifying and recognizing a distinguished minority physicist who has made significant contributions to physics research and the advancement of underrepresented minority scientists. The programme helps to publicise the lecturer's work and career development to the physics community, especially among minority physics students. The award was established in\n1994\nby the American Physical Society Committee on Minorities in Physics, and supported for\n18\nyears by the Research Corporation, a private foundation for the advancement of science and technology. Subsequently the Award was supported by a grant from the Alfred Sloan Foundation and is now endowed thanks to individual and institutional donations.\nFor a list of previous winners of the Edward A Bouchet Award, each with the citation, see\nTHIS LINK\n.",
  "math_areas": []
}