{
  "nome_completo": "Edward Burns Ross",
  "nome_curto": "Edward Ross",
  "ano_nascimento": "1881",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ross/",
  "lugar_nascimento": "Maud, Aberdeenshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Edward Ross\n's father was  William Ross\n(\nborn in Helmsdall, Sutherland about\n1832)\nwho was a supervisor with the Inland Revenue. His mother was  Ann Ross\n(\nborn in Dundee about\n1841)\nwho was a school teacher. Edward had two older sisters, Marjory\n(\nborn about\n1870)\nand Hannah\n(\nborn about\n1875)\n.\nEdward Ross was six years old when his father died and at this time his mother moved from Maud, Aberdeenshire, to Edinburgh where he continued his schooling. Educated at George Watson's School in Edinburgh, Ross was dux of the school in\n1898\n, matriculating at the University of Edinburgh in October of that year. His undergraduate career was outstanding: he won the Mitchell and Shortt Bursary, the Bruce of Grangehill and Falkland Bursary, and the Vans Dunlop Scholarship in Natural Philosophy. In\n1902\nhe graduated M.A., with First Class Honours in Mathematics and Natural Philosophy.\nAfter graduating Ross went to Cambridge, beginning his studies in October\n1902\n. He was Seventh\nWrangler\nin the Mathematical Tripos of\n1904\nand in the same year was awarded a Ferguson Scholarship. This is reported in\nThe Scotsman\nof\n5\nOctober\n1904\n:-\nThe Ferguson Scholarships\nThe examinations for these scholarships were conducted in the Trustees' Chambers, Glasgow, on\n20\n,\n21\n,\n22\nSeptember\n1904\nby Andrew Munro, M.A., Queen's College, Cambridge in mathematics. The mathematics scholarship was divided between Edward Burns Ross, M.A., Edinburgh University, and Peter Fraser, M.A., Aberdeen University.\nAfter a First Class performance in Part II of the Mathematical Tripos in\n1906\n, Ross was appointed as Assistant to\nKarl Pearson\nat University College, London in October\n1906\n. In the following year he accepted the post of Professor of Mathematics at the Christian College, Madras\n(\nnow Chennai\n)\n, India.\nRoss had studied with\nG H Hardy\nin Cambridge, so this gives an interesting link between\nHardy\nand Madras mathematicians. One of Ross's best students at Madras was S R Rangathan who went on to become a founder of library science\n[\n2\n]\n:-\nRanganathan joined the junior intermediate class at the Madras Christian College in March\n1909\n. Even in those days, there were paucity of college seats. Ranganathan was picked up for his excellent marks in all the subjects and the principal. Prof. Skinner spotted him in a crowd of students and admitted him into the course. Ranganathan passed B.A. with a first class in March/April\n1913\n. In June, same year, he joined the M.A. class in Mathematics with Professor Edward B. Ross as his teacher. Being a favourite student of Prof. Ross, Ranganathan had an excellent Guru-Shishya relationship. More than class room discussions, corridor and staircase discussions were taken recourse to. Ranganathan ingrained this trait into his own discipline later on. Ranganathan did his Master's degree in\n1916\nand he wanted to be a teacher in Mathematics. He also took a course in teaching technique and gained L T degree from a teachers' college. During his college days, Ranganathan cultivated intimacy with his teachers, Professors Moffat and J.P. Manickam of Physics, Prof. Sabhesan of Botany, Prof. Chinnathambi Pillai and L.N. Subramanyam of Mathematics. But Prof. Ross remained his favourite Guru throughout his life.\nRanganathan dedicated his book\nThe five laws of library science\nto Ross:-\nE B Ross, to whom the author owes so much more, for a casual remark of his which convinced the author of the need for a book of this sort which seeks to reduce and relate all the principles and practice of library work to a few fundamental laws\nIn\n1925\nRanganathan endowed a mathematicial fellowship at Madras Christian College in honour of Ross. According to\n[\n3\n]\n:-\nRoss trained Ranganathan in the art of thinking and made him adept in perceiving those things around which an ordinary mind ordinarily overlooks. He told Ranganathan of the intrinsic interconnection of one entity with another to the extent that \"Thou cannot stir a flower without troubling of a star\". In our infinite world, stars and flowers, fire and rain, Nature and God, to take a few examples at random, are all linked together in a Great Chain of Being.\nIn\n1921\n, while back in Scotland on leave, Ross cooperated with\nB Bevan-Baker\nin an important paper\nOn the Vibrations of a Particle about a Position of Equilibrium\nin which they explained the long-noted phenomenon of the great difference between the orbit of Jupiter and that of Saturn. See\n[\n1\n]\n.\nRoss continued working in Madras until\n1932\nwhen he was forced to retire due to ill health. He then returned to Edinburgh, living at\n41\nLiberton Brae, where he was looked after by his sisters for the final\n15\nyears of his life during which time his health continued to deteriorate.\nRoss joined the\nEdinburgh Mathematical Society\nin\n1903\nand remained a member throughout his career in India, and his retirement to Edinburgh. While still in Edinburgh he read his paper\nThe contact of a member of a family of curves with the envelope\nto the Society at its meeting on Friday\n13\nJanuary\n1905\n. He was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\n, his proposers being\nSir Edmund T Whittaker\n,\nCargill Gilston Knott\n,\nEllice Martin Horsburgh\n,\nDavid Gibb\n.\nAn obituary, written by\nEdmund Whittaker\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1948\n/\n1949\n, page\n43\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nHis death was reported in\nThe Scotsman:-\nDeath of Former Madras Professor\nThe death has occurred at his home,\n41\nLiberton Brae, Edinburgh of Professor Edward Burns Ross, who in\n1933\nretired from the post of Professor of Mathematics in Madras Christian College. Educated at Edinburgh University, where he graduated M.A., and subsequently at Cambridge, he was appointed to Madras College in\n1906\n. A zealous teacher, he exerted a powerful religious influence in the College, was a generous friend of the students, and gave much time and thought to the extension of the College library. In\n1915\nhe was elected a Fellow of the Royal Society of Edinburgh. Professor Ross was\n65\nyears of age.",
  "math_areas": []
}