{
  "nome_completo": "Edward Waring",
  "nome_curto": "Edward Waring",
  "ano_nascimento": "1736",
  "ano_morte": "1798",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Waring/",
  "lugar_nascimento": "Old Heath (near Shrewsbury), Shropshire, England",
  "lugar_morte": "Pontesbury, Shropshire, England",
  "biografia": "Edward Waring\n's father, John Waring, was a farmer. Several generations of his family lived at Mytton in Shropshire. John Waring married Elizabeth and their son Edward was educated at Shrewsbury school.\nWaring entered Magdalene College, Cambridge on\n24\nMarch\n1753\n. He won a Milbridge scholarship and he was admitted as a\nsizar\n, meaning that he paid a reduced fee but essentially worked as a servant to make good the fee reduction. He immediately impressed his teachers with his mathematical ability and he graduated B.A. in\n1757\nas senior\nwrangler\n.\nOn\n24\nApril\n1754\nWaring was elected a fellow of Magdalene College. Waring's most famous work was\nMeditationes Algebraicae\nwhich he worked on during the next few years. He submitted the first chapter of this work to the\nRoyal Society\nbut following this nothing happened for two years. When Waring was nominated for the Lucasian Chair of Mathematics at Cambridge in\n1759\n, the work was distributed as\nMiscellanea Analytica\nto prove he was qualified for the post despite his youth.\nWilliam Powell of St John's College Cambridge had his own ideas about who should fill the Lucasian Chair of Mathematics and attempted to prevent Waring being appointed. He put out a pamphlet entitled\nObservations\nwhich criticised Waring and doubted his mathematical abilities. Waring responded to this criticism on\n25\nJanuary\n1760\nwith the pamphlet\nA reply to the observations\n.  Powell, still following his own agenda, was not going to give up that easily and responded immediately with\nDefence of the observations\n.\nJohn Wilson\nnow wrote\nA letter\nto support Waring and this was sufficient to see him confirmed as Lucasian professor on\n28\nJanuary\n1760\nat the age of\n23\n.\nWhen\nMiscellanea Analytica\nwas published as a complete work in\n1762\n, Waring chose to call it a second edition. Rather strangely, despite it being a second edition, it was given a new title\nMeditationes Algebraicae\n. We shall comment further below on this important work, covering topics in the theory of equations,\nnumber theory\nand geometry. On\n2\nJune\n1763\nWaring was elected a Fellow of the\nRoyal Society\n.\nIn\n1764\nLalande\npublished\nLife of Condorcet\n. In this work it was claimed that there were no first-class analysts in England. Waring responded quickly to this comment by writing a letter to\nNevil Maskelyne\n, the Astronomer Royal. In the letter Waring pointed out that\nd'Alembert\n,\nEuler\nand\nLagrange\nhad all praised his\n1762\nwork. Waring wrote that in the book he had given:-\n... somewhare between three and four hundred new propositions of one kind or another, considerably more than have been given by any other English writer.\nHowever, Waring knew that his work had not been widely read for he added that he:-\n... never could hear of any reader in England, out of Cambridge, who took pains to read and understand it ...\nThe reason that so few had read the book was partly because the subject matter was difficult, partly because Waring was a poor communicator, and partly because he did not have a good algebraic notation. It would be reasonable to compare Waring with\nRuffini\nwho, about\n150\nyears later, suffered the same fate with his work in algebra for much the same reasons.\nOne would not expect the Lucasian professor of mathematics to take a medical degree but that is exactly what Waring did, graduating with his M.D. in\n1767\n. For a short time he practised medicine in various London hospitals, then Addenbroke hospital in Cambridge and finally at a hospital in St Ives, Huntingtonshire. However, he gave up practising medicine by\n1770\n[\n8\n]\n:-\n... he was very short-sighted and very shy in manner, so that he quickly abandoned his profession.\nOne might ask how Waring could practise medicine and hold the Lucasian Chair at the same time. Well, he never lectured as part of his duties. Some claim that it was because his ideas were so profound that they could not be communicated in lectures, but if truth be told it is more likely that the reason was because he was a poor communicator with handwriting which was almost impossible to read.\n[\nI will agree that such problems have not stopped others lecturing!\n]\nIn\n1776\nWaring married Mary Oswell. They lived for a while in Shrewsbury but the town was not to Mary's liking and the couple moved to Waring's estate at Plealey in Pontesbury.\nWaring's\nMiscellane analytica\n... of\n1762\nformed the basis, as we have noted, of further books.\nProprietates algebraicarum curvarum\n, covering geometry, was published in\n1772\n. A further work\nMiscellanea Analytica\nappeared in\n1776\nwith a new expanded edition in\n1785\n.\nMeditationes Algebraicae\n, covering the theory of equations and number theory, appeared in\n1770\nwith an expanded version in\n1782\n.\nIn\nMeditationes Algebraicae\nWaring proves that all rational symmetric functions of the roots of an equation can be expressed as\nrational functions\nof the coefficients. He derived a method for expressing symmetric polynomials and he investigated the cyclotomic equation\nx\nn\n−\n1\n=\n0\nx^{n} - 1 = 0\nx\nn\n−\n1\n=\n0\n. This work makes Waring one of the earliest contributers to\nGalois theory\n. In particular, discussing Problem\n22\nof Chapter\n3\n, Weeks writes\n[\n3\n]\n:-\nThe most significant aspect of Waring's treatment of this example is the symmetric relation between the roots of the quartic equation and its resolvent cubic. This is, in essence, the first result in the theory of symmetric functions\n(\nbeyond the basic building blocks which appeared in Chapter\n1)\n, a theory whose systematic development was not to appear until the\n19\nth\ncentury\n(\nLagrange\n,\nGauss\n, and others\n)\nand was ultimately followed by the theory of permutation groups\n(\nGalois\n,\nJordan\n, ...\n)\n.\nChapter\n4\nof\nMeditationes Algebraicae\ncontains results such as:-\nk equations in k unknowns can be reduced to one equation with one unknown.\nHis result that the product of the degrees of the original equations is the degree of the single reduced equation is known as the Generalised Theorem of\nBézout\n.\nThe rest of the book deals with number theory, a topic in which Waring made some interesting advances. He stated that any even integer can be written as the sum of two primes and every odd integer is either a prime or the sum of three primes. This result, now known as the\nGoldbach conjecture\n, is one of the most famous unsolved problems of mathematics. Although\nGoldbach\nproposed his question in a letter to\nEuler\nlong before Waring published\nMeditationes Algebraicae\nit is still worth noting that Waring's version was the first to be published.\nWaring also stated, without giving a proof, what is now known as 'Waring's theorem':-\nEvery integer is equal to the sum of not more than\n9\ncubes. Also every integer is the sum of not more than\n19\nfourth powers, and so on ....\nIn\n1909\nHilbert\nproved that given any integer\nn\nn\nn\nthere is an integer\nm\nm\nm\n(\ndepending on\nn\nn\nn\n)\nsuch that every integer is a sum of\nm\nn\nm n\nm\nn\nth powers. It is reasonable to assume that Waring had this type of result in mind when he stated 'Waring's theorem'.\nHilbert\n's proof led to major new theorems in number theory.\nWaring also wrote on algebraic curves, classifying quartic curves into\n12\nmain divisions with\n84551\nsubdivisions.\nSeveral descriptions of Waring given by authors from his own period are not too flattering. One writes that he was:-\n... one of the strongest compounds of vanity and modesty which the human character exhibits. The former, however, is his predominant feature.\nAnother says that he is:-\n... one of the greatest analysts that England has produced ...\n[\nnear the end of his life being\n]\nsunk into a deep religious melancholy approaching to insanity.\nThis last statement may partly explain the strange fact that although Waring was elected a Fellow of the\nRoyal Society\nin\n1763\nand had the great distinction of being awarded its Copley Medal in\n1784\n, he resigned from the Society in\n1795\nclaiming poverty. He was awarded other honours, however, such as election to the Royal Society of Göttingen and the Royal Society of Bologna. Perhaps the most accurate assessment of Waring was made by Thomas Thomson:-\nWaring was one of the profoundest mathematicians of the eighteenth century; but the inelegance and obscurity of his writings prevented him from obtaining that reputation to which he was entitled.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}