{
  "nome_completo": "Edward Charles Titchmarsh",
  "nome_curto": "Edward Titchmarsh",
  "ano_nascimento": "1899",
  "ano_morte": "1963",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Titchmarsh/",
  "lugar_nascimento": "Newbury, Berkshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Edward Titchmarsh\nwas known as Ted to his contemporaries. His grandfather was a grocer in Royston while Ted's father, Edward Harper Titchmarsh, became a Congregational minister in Newbury, Berkshire. Ted was the second of three children born to Edward and Caroline Titchmarsh. Ted's father moved to Sheffield, where again he was the Congregational minister, and it was in Sheffield that Ted attended King Edward VII School. He later wrote of his time at this school:-\nThe first occasion on which I distinguished myself was when I was in one of the fourth forms. The headmaster for some unknown reason made the whole upper school do an arithmetic paper, the same for all forms. The mathematical specialists in the sixth form came out top, and I came next. ... At this point one had to choose either classical or modern subjects: I was put on the classical side. I learnt enough Latin to pass and enough Greek to fail. It became clear that mathematics was my real subject and I began to specialise in it.\nIn December\n1916\n, when he was seventeen years old, Titchmarsh won an Open Mathematical Scholarship to Balliol College, Oxford and he began his studies there in October\n1917\n. By this time, of course, Britain had been involved in World War I for three years and Titchmarsh, by now eighteen years of age, was soon undertaking war service. After just one term at Oxford he joined the Royal Engineers and in August\n1918\nhe was sent to France as a dispatch rider. Titchmarsh was fortunate to have arrived in France at a point when the tide of the war had changed. There had been major offensives by the German armies throughout June and July of\n1918\nbut as Titchmarsh landed in France the Allied forces were making steady advances, driving the German troops out of France.\nTitchmarsh carried out his duties as a dispatch rider first on horseback and then on a motorcycle. By October\n1918\nthe Allies had recovered most of German occupied France and a part of Belgium. German morale collapsed, the German Kaiser William II abdicated on\n9\nNovember, and on\n11\nNovember the war ended with the signing of the Armistice between Germany and the Allies. However Titchmarsh served with the Royal Engineers for almost a further year before he was able to return to his interrupted studies in Oxford in October\n1919\n.\nAt Oxford he was tutored by J W Russell.\nMary Cartwright\nwrote\n(\nsee\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nAt Russell's first lecture the room was packed to the doors, and Russell said: \"Ah, there's my clever pupil Mr Titchmarsh - he knows it all, he can go away.\" Russell dictated his lectures word for word and examples were handed out - and then, if necessary, solutions to examples. Some of Titchmarsh's solutions replaced the official ones.\nAt Oxford Titchmarsh soon came under the influence of\nHardy\nand he later wrote:-\nFrom\n[\nHardy\n]\nI learnt what mathematical analysis is, and at his suggestion I devoted myself to research in pure mathematics.\nHardy\nheld a class which did not form part of the syllabus. The class met once a week on Monday evenings after dinner and it would begin with a talk and then continue until late in the evening with the members taking part in deep mathematical discussions. Titchmarsh attended this class, as did\nMary Cartwright\n. Of course Titchmarsh and\nHardy\nhad a common passion, namely cricket, which must have served Titchmarsh well. His uncle was a professional cricketer and Titchmarsh often played in the regular cricket matches with\nHardy\n.\nTitchmarsh graduated with a First Class degree in\n1922\nand won mathematical scholarships for his outstanding work. He did not read for his doctorate but was appointed as a Senior Lecturer at University College London in\n1923\n. This appointment in London did not see Titchmarsh end his association with Oxford. Far from it, he took the examinations for a Prize Fellowship at Magdalen College Oxford, also in\n1923\n, and, having won the Fellowship, he held it for seven years. Not only did he lecture in London, where he supervised doctoral students, but he also began publishing high quality research papers on mathematical analysis. During the academic year\n1928\n-\n29\nHardy\nwas at Princeton, and it was Titchmarsh who took over the supervision of\nMary Cartwright\nwho was, at that time, one of\nHardy\n's doctoral students at Oxford.\nDespite having duties at both London and Oxford, Titchmarsh found time to visit his father who was by this time a Congregational minister in Essex. In\n1925\nhe married Kathleen Blomfield, who was the daughter of his father's Church Secretary. They had three children, all daughters.\nCharles Burkill\nheld the chair of pure mathematics at Liverpool from\n1924\nuntil\n1929\nwhen he took up a lectureship at Peterhouse, Cambridge. Titchmarsh was appointed to\nBurkill\n's chair at Liverpool, a post he held for two years before he succeeded to\nHardy\n's Savilian chair at Oxford when\nHardy\nmoved to Cambridge. Wilson, in\n[\n9\n]\nrecounts how the appointment came about:-\nBy chance, Titchmarsh was visiting Oxford to examine a doctorate and bumped into\nFerrar\nwho asked him whether he had applied for\nHardy\n's vacant Oxford Chair. Titchmarsh said no, but\n(\nencouraged by\nFerrar\n)\nthought that he might. He sent in an application on a single sheet saying that he wished to apply for the geometry Chair but could not undertake to lecture on geometry as\nHardy\nhad done. Two days later he was appointed and the statutes were changed to say that the Savilian Professor of Geometry no longer had to lecture on geometry. Titchmarsh held the Savilian Chair of Geometry at Oxford for\n30\nyears.\nFerrar\nwrote this about Titchmarsh's mathematical work\n[\n3\n]\n:-\nTitchmarsh, from his earliest research days, displayed a power of analysis that marked him out as a mathematician whose reputation would be world wide. This power he carefully fostered and strengthened. Research papers and books flowed steadily from his pen ...\nAll Titchmarsh's work was in analysis, in fact he refused to lecture on any other topic. His method of working was to concentrate on a topic until he tired of it, when he would write a book on that topic. He studied\nFourier series\nand\nFourier\nintegrals writing\nIntroduction to the Theory of Fourier Integrals\n(1937)\n. Other topics to which he made major contributions included entire functions of a complex variable and, working with\nHardy\n,\nintegral equations\n.\nHe also did important work on the\nRiemann zeta function\nwriting\nThe Zeta-Function of Riemann\n(1930)\nwhich he brought up-to-date as\nThe Theory of the Riemann Zeta-Function\n(1951)\nwhich\n[\n1\n]\n:-\n... contained practically everything that was known on the subject.\nHis most popular book\nThe theory of functions\nwas published in\n1932\n, and\n[\n1\n]\n:-\n... a generation of mathematicians learned the theory of analytic functions and\nLebesgue\nintegration from it, and also learned\n(\nby observation\n)\nhow to write mathematics.\nFrom\n1939\nTitchmarsh concentrated on the theory of series expansions of eigenfunctions of\ndifferential equations\n, work which helped to resolve problems in\nquantum mechanics\n. However\n[\n1\n]\n:-\n... he saw physics as a source of interesting mathematics problems; but his interest was exclusively in the mathematics, without any regard for its real applicability.\nHis work on this topic occupied him for the last\n25\nyears of his life and he published much of it in\nEigenfunction Expansions Associated with Second-Order Differential Equations\n(1946\n,\n1958)\n.\nTitchmarsh was elected to the\nRoyal Society\nin\n1931\nand received its\nSylvester\nMedal in\n1955\n:-\n... in recognition of his distinguished researches on the\nRiemann\nzeta-function, analytic theory of numbers,\nFourier analysis\nand eigenfunction expansions.\nHe received many other honours for his important contributions to mathematics. He served as President of the\nLondon Mathematical Society\nin\n1945\n-\n47\nand was awarded its\nDe Morgan\nMedal in\n1953\nand its Berwick Prize. The University of Sheffield, which of course is situated in the town in which he attended school, awarded him an honorary doctorate in\n1953\n.\nFerrar\nwrites about Titchmarsh's lecturing style\n[\n3\n]\n:-\nAs a lecturer he was conscientious and careful, but in no way outstanding save on rare occasions. These occasions were when, with an audience of professional mathematicians, he was lecturing on his own current research; and then the lecture lit up with his own zeal for the subject.\nSir Michael Atiyah\nreminisces about Titchmarsh in\n[\n4\n]\n:-\nHe was a scholarly man who sat in his room and wrote beautiful books - impeccable, effectively written textbooks, from which many students have learnt their complex analysis. But he was a man of very few words; his influence was not due to personal contact but through his writing. When I first came to Oxford he was curator of the Mathematical Institute, so as a newly arrived member I had to go to him to get a key to my office. I was duly ushered into his big room, where he was sitting at his desk. I sat down and he handed over the key, and then I expected a word of welcome of some words of advice, but we just sat in silence. After five minutes, I left.\nOutside mathematics, Titchmarsh had relatively few interests\n[\n3\n]\n:-\nHe was a retiring person and was not easy to know, but his shyness was relieved by a sense of humour which would suddenly transform him. He was very happy at home and he enjoyed listening to music and watching cricket, a game in which his father's family had been distinguished.\nCharles Coulson\n, one of his colleagues, wrote a tribute to Titchmarsh:-\nThere were many things about Ted that I have always much admired - his utter humility, which never betrayed anything but the greatest simplicity; his complete integrity ... and his kindness to me when I arrived first; to his students\n(\nwho worshipped him\n)\nand to everyone.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}