{
  "nome_completo": "Edwin Hewitt",
  "nome_curto": "Edwin Hewitt",
  "ano_nascimento": "1920",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hewitt_Edwin/",
  "lugar_nascimento": "Everett, Snohomish, Washington, USA",
  "lugar_morte": "Seattle, Washington, USA",
  "biografia": "Edwin Hewitt\nwas the son of Irenaeus Prime Hewitt\n(1879\n-\n1961)\nand Margaret Guthrie\n(1889\n-\n1946)\n. Irenaeus Hewitt, born in Lexington, Dawson, Nebraska to Thomas Jefferson Hewitt\n(1837\n-\n1886)\nand Fanny Augusta Rockwood\n(1842\n-\n1915)\non\n5\nDecember\n1879\n, was a Navy Supply Officer at Puget Sound Naval Yard who married Margaret Guthrie in Omaha, Douglas, Nebraska on\n16\nFebruary\n1915\n. Puget Sound Naval Yard had been established in\n1891\nand, during World War I, it constructed many ships to assist in the war such as submarines, minesweepers, tugs and ships designed to search for enemy submarines. He was a graduate of the Washington law college in\n1904\n. Margaret, born in Cheyenne, Laramie, Wyoming to William Eugene Guthrie and Margaret S Hewitt on\n19\nApril\n1889\n, was a teacher of English to adults and a co-author of\nAn outline of vocabulary building; a course for adult Americans\n. She had graduated at the University of Washington in\n1911\n. Irenaeus and Margaret Hewitt had three children, William Guthrie Hewitt\n(1916\n-\n1983)\n, Helen Margaret Hewitt\n(1918\n-\n1953)\nand Edwin Hewitt\n(1920\n-\n1999)\n, the subject of this biography.\nHe described his own youth as follows\n[\n10\n]\n:-\nMy early memories are for the most part happy, though I carry to this day recollections of stern discipline meted out for this or that childish crime. I suppose I was precocious, though by no means a prodigy. I learned mathematics and French with little effort. In grammar school I had a hard time with written arithmetic, though mental arithmetic and word problems were simple. At ten years of age I heard about logarithms, at thirteen about trigonometric functions. I was an insufferable child. I had - and still suffer from - a terrible habit of mouthing off.\nAt the time of the\n1930\nUS Census, the Hewitt family are living in Everett, Snohomish, Washington and Edwin's father is still working at the Puget Sound Naval Yard. Edwin,\n10\nyears old at this time, is attending school. The family moved to Chicago where they lived at\n5016\nEllis Avenue, Chicago. Edwin attended the Principia Academy, an Christian Science School in St Louis, Missouri, for three years\n[\n13\n]\n:-\nI had a marvellous mathematics teacher at Principia, Paul C Dietz. He gave me my head and the run of his exiguous mathematical library. I read trigonometry on my own, ditto\nEuclid\n(\nI loved ruler-and-compass constructions\n)\n, built models of the regular solids, wrote out on tape an estimate of\n1200\n!\n1200!\n1\n2\n0\n0\n!\n, found in Thornton C Frye's probability text, and enjoyed wielding a Keuffel and Esser log log duplex sliderule, which I still have. Of course, it is only an antique now. I had a fine teacher of French at Principia, Moniseur Robbins. He gave me a good start in French, and turned me loose to read 'Les Misérables' on my own: this was my first experience of reading a serious book in a foreign tongue. The Latin teacher at Principia was a Mrs Semple, a lady of the old school. We learned our Latin from her and much more about what the Germans called 'Umgang mit Menschen'\nⓉ\n(\nDealing with people\n)\n.\nAfter Principia Academy, he spent two years at Leelanau School, a boarding school in Glen Arbor, Michigan. This school:-\n... was founded in\n1929\nin Glen Arbor, Michigan by Skipper and Cora Beals and Major and Helen Huey as a for-profit college-preparatory school for students who wanted to learn in a Christian Science community.\nIn\n1936\n, when he was only\n16\nyears old, he was awarded a scholarship to Harvard University. This was reported in both\n[\n2\n]\nand\n[\n11\n]\n. The\nHarvard Crimson,\n1\nSeptember\n1936\n, records\n[\n2\n]\n:-\nSixteen boys from high schools and private schools in the Middle Western and Southern states have been selected from among more than three hundred candidates in the area for scholarships to enter Harvard College this fall. The awards total $\n5\n,\n900\n. The boys, who were school leaders in scholarship and class activities, were chosen from an area including Ohio, Indiana, Illinois, Michigan, Wisconsin, Minnesota, Iowa, Kentucky, Missouri and Tennessee. The scholarships announced today went to ... Edwin Hewitt, of\n5016\nEllis Avenue, Chicago, Ill., Leelanau School, Glen Arbor, Michigan.\nWhen Hewitt entered Harvard in\n1936\n,\nGeorge David Birkhoff\nwas Perkins Professor of Mathematics and\nMarshall Stone\nwas an associate professor\n[\n13\n]\n:-\nMy six years at Harvard were happy. I melted into the crowd, no longer an underage, undersized misfit. The mathematics faculty was awe-inspiring.\nGeorge David Birkhoff\n, an Olympian figure, was also dean of the Faculty of Arts and Sciences. William Caspar Graustein was a dignified man who always wore black three-piece suits.\nEdward Vermilye Huntington\nwas an elderly scholar, plainly not part of the power structure.\nJoseph Leonard Walsh\nwas greatly respected for his flawless lectures, though not for the\nWalsh\n-\nRademacher\nfunctions: we had not heard of them. The younger faculty included\nDavid Vernon Widder\n,\nSaunders Mac Lane\n,\nGarrett Birkhoff\n,\nWillard van Orman Quine\n[\nI think he was in the Philosophy Department: he gave brilliant courses on mathematical logic\n]\n, and\nMarshall Harvey Stone\n.\nLet us note at this point that we will quote from\n[\n13\n]\non a number of occasions during this biography. A version of the whole article is available at\nTHIS LINK\n.\nWe get some information about Hewitt from the\n1940\nUS Census. The family at this time were living at\n1354\nEast\n47\nth Street, Chicago. Hewitt's father was an Assistant Personal director of the Candy Manufacturing Company and his mother was a teacher at a private school. Hewitt was awarded a first degree in\n1940\nand continued to undertake postgraduate studies for his Master's Degree which was awarded in\n1941\n. Of course, World War II was now a factor in the life of any young man in the United States and Hewitt completed his Draft Card on\n1\nJuly\n1941\n. His residence at this time was Kirkland House, Cambridge, Massachusetts. The Draft Card contains a physical description: weight\n160\nlbs; complexion light; eyes blue; hair brown; height\n5\nft\n10\nins; wears glasses and has a scar over his right eye. On\n28\nNovember\n1941\nhe became a mason, joining The Harvard Lodge.\nHewitt undertook research with\nMarshall Stone\nas his thesis advisor. He submitted his thesis\nOn a Problem of Set Theoretic Topology\nand was awarded a Ph.D. in May\n1942\n. His thesis was published in the\nDuke Mathematical Journal\nin the following year. He gives the following acknowledgement:-\nThe writer is enormously indebted to Professor\nM H Stone\nfor guidance in research preliminary to the preparation of this dissertation.\nThe Introduction begins as follows:-\nThe present paper is concerned with the problem of determining under what conditions a topological space can be resolved into two complementary sets each of which is dense in the given space. A space admitting such a resolution is said to be 'resolvable'; a space\n(\nsatisfying a certain restriction to be specified below\n)\nwhich cannot be so resolved is said to be 'irresolvable'. Several of the techniques made use of in obtaining a partial answer to this question have applications to other topological problems. We shall indicate such applications where they occur.\nThe principal construction, indeed, utilised in producing irresolvable topological spaces is a special case of an operation to which any topological space may be subjected and which we have named topological expansion. The first chapter is accordingly devoted to the development of a theory of such expansions. We investigate properties of spaces which are preserved under arbitrary expansions, giving in this connection a separation axiom of peculiar interest first stated by\nUrysohn\n. In considering various types of expansions, we prove the existence of a particular expansion enjoying a number of curious properties. This expansion, called a maximal expansion, is essential in the construction of irresolvable spaces. We also consider various properties of contraction, the operation inverse to expansion.\nThe second chapter contains a study of irresolvable spaces. The existence of irresolvable connected\nT\n1\nT_{1}\nT\n1\n​\n-spaces, totally disconnected\nUrysohn\nspaces, and totally disconnected completely regular spaces is proved directly from the expansion theory. Some irresolvable spaces enjoy a very strong disconnectivity property, which we investigate in detail.\nIn the final chapter, it is shown that, metric spaces, bicompact\nHausdorff\nspaces, spaces satisfying the first countability axiom of\nHausdorff\n, and various other special spaces are all resolvable. We also obtain a reduction showing that only\nT\n1\nT_{1}\nT\n1\n​\n-spaces, and in fact only bicompact\nT\n1\nT_{1}\nT\n1\n​\n-spaces, need be considered in dealing with the resolution problem.\nHe taught at Harvard for six months before undertaking war work as an operations analyst with the United States Army Air Force in\n1943\n. He was flown to England to work at the Operations Research Station of the\n8\nth Bomber Command in England, where he worked to calculate bomb trajectories and ways to defend bombers against German planes. While he was in England, his engagement was announced in the\nBoston Globe\non\n22\nApril\n1943\n[\n7\n]\n:-\nMr and Mrs Edward T Blanchard of Belmont, announce the engagement of their daughter, Miss Carol Blanchard, to Edwin Hewitt of Cambridge, son of Mr and Mrs Irenaeus Hewitt of Chicago, Illinois. Miss Blanchard is now a junior in the School of English at Simmons College. Mr Hewitt was graduated from Harvard in\n1940\n, where he received his master's degree in\n1941\nand his Ph.D. in\n1942\n. He is now on special duty abroad for the United States Army Air Forces.\nCarol Blanchard\n(1923\n-\n2001)\nhad attended Belmont High School and then Simmons College. The College records her address as\n79\nChilton Street, Belmont, Massachusetts and her \"not-so-secret passions are mountains, mathematicians, pretzels, and poetry.\" The date of their marriage is given as\n4\nMarch\n1944\nbut that does not quite work with the fact that Hewitt returned to the United States on\n10\nAugust\n1944\n. He flew by Air Transport Command leaving from Prestwick, Scotland, going to the Pentagon, Washington D.C. Perhaps he crossed the Atlantic more than once in each direction. Edwin and Carol Hewitt had two daughters: Elizabeth Hewitt and Margaret Hewitt. Later, in April\n1962\n, they were divorced and Hewitt married\n30\nyear old Pamela Jones Meyer on\n28\nMay\n1964\n. They were divorced in October\n1973\n.\nAfter being discharged from the military in September\n1945\n, he was awarded a Guggenheim Foundation award and spent the year\n1945\n-\n46\nat the Institute for Advanced Study at Princeton\n[\n13\n]\n:-\nThere was a galaxy of eminences at the Institute for Advanced Study:\nAlbert Einstein\n,\nCarl Ludwig Siegel\n,\nJohn von Neumann\n(\nwho was around only part of the time\n)\nHermann Weyl\n,\nKurt Gödel\n,\nJames W Alexander\n,\nMarston Morse\n. Richard Arens was\nMorse\n's assistant;\nErnst Straus\n,\nEinstein\n's. At Princeton University there were\nWedderburn\n(\na man of small stature, no longer young, who wore well-cut tweeds\n)\n,\nH P Robertson\n,\nL P Eisenhart\n,\nSalomon Bochner\n,\nRalph Fox\n,\nEmil Artin\n,\nSolomon Lefschetz\n,\nClaude Chevalley\n. I was very much an 'Unterspieler' but enjoyed watching the big shots, attending their seminars, and observing their foibles. I was horrified one day to watch\nChevalley\nbait\nWeyl\nlike a terrier nipping at a water buffalo, while\nWeyl\nwas trying to give a lecture on\nLie\ngroups.\nHewitt taught at Bryn Mawr College for the year\n1946\n-\n47\n, then moved to Chicago where he had two half-time jobs, one in the Department of Mathematics at the University of Chicago, the other on a military research project Chicago Ordnance Research. This move to Chicago was rather disastrous as he explained\n[\n13\n]\n:-\nI lost the military job by running afoul of the regular army colonel, Frank Fenton Reed, who was the Army liaison officer. I then found that\nMarshall Stone\nhad no interest whatever in hiring me full time in his department. The man in charge of the Chicago Ordnance Research, Dean Walter Bartky, was decent enough about my plight but could do nothing to mitigate it. So I served out my one-year appointment in wretched circumstances.\nThree offers of jobs in the spring of\n1948\nsaw him able to choose the one which looked most attractive. He accepted the offer from the University of Washington, pleased to go to Seattle, a place he had pleasant memories of from his childhood\n[\n13\n]\n:-\nI was taken with Seattle. We were welcomed by old friends from the\n1920\ns, now rather grey at the temples. We found reasonable living accommodations. The department was a comfortable little group, which was for the most part unconcerned with research. Professors\nZ W Birnbaum\n(\na Polish-born statistician\n)\n, Ross A Beamont, and Herbert S Zuckerman rapidly became good friends. In particular, I found in Zuckerman a wonderful friend and collaborator. I learned most of my classical mathematics from him, a side that I had foolishly neglected in order to follow the sirens of functional analysis and set-theoretic topology. Herbert and I worked together from the autumn of\n1948\nuntil the day of his tragic and untimely death in June\n1970\n. I am proud that my name stands alongside his, attached to now classical theorems in Diophantine approximation, the structure of semigroups, and abstract harmonic analysis.\nHewitt spent the whole of his career at the University of Washington but spent time away on teaching visits, research visits and sabbatical leave: Uppsala, Sweden\n(1951\n-\n52)\n, Australian National University, Canberra\n(1963\n;\n1970\n;\n1976\n, Mathematics Institute of Academy of Sciences, Moscow, Russia\n(1969\n-\n70\n;\n1973\n;\n1976)\n, Erlangen and Passau, Germany\n(1975\n-\n76\n;\n1986)\n, the University of Texas\n(1972\n-\n73)\n, the University of Fairbanks, Alaska\n(1982)\n, Hokkaido University, Japan\n(1982)\n, University of Passau, Federal Republic Germany\n(1986)\n, University of Singapore\n(1988)\n.\nDuring March-May\n1957\nhe was a visiting lecturer with the\nMathematical Association of America\n. During this time, he gave the lecture\nThe role of compactness in analysis\non several different occasions. The lecture began\n[\n12\n]\n:-\nAnalysis is an immense field of mathematics, and compactness concepts and arguments enter in a great many different branches of analysis. To give a really adequate picture of the role of compactness in analysis would require in fact a survey of much of analysis: a task obviously impossible of accomplishment within the confines of a short essay, to say nothing of the limitations of the writer. After some remarks about the concept of compactness as such, therefore, we shall give examples from various parts of analysis in which compactness enters as a necessary hypothesis. These examples range from highly elementary to fairly sophisticated. They have been chosen partly to illuminate the concept and partly as important theorems of analysis. No attempt has been made to be exhaustive.\nHewitt wrote several influential books, both monographs and teaching texts; for details see\nTHIS LINK\n.\nW W Comfort writes about Hewitt's work in topology in\n[\n5\n]\n:-\nBy any workable standard, Edwin Hewitt was a topological colossus. What is surprising, in view of the strong topological legacy he left us, is the paucity, in numerical terms, of his contributions. Even with a broad and generous interpretation of topology, one can classify no more than\n10\nof his approximately\n103\nresearch papers under that rubric. His definitive departure at the age of\n35\nfrom topological research in favour of harmonic analysis and locally compact abelian groups has been much noted and discussed by Hewitt-watchers and interested amateur historians. There were apparently two threads to this change of direction. My personal insight into the principal of these derives from the fact that Hewitt interrupted me 'sotto voce' on each of the two occasions in my life when he was in the audience and I was at the podium singing his praises. On the first of these, in October,\n1982\n, when I introduced his Colloquium talk 'On a Theorem of F and\nM Riesz\n' at Wesleyan University, he asserted \"I was prone to error in topology. I abandoned the field in\n1948\nplus epsilon.\" On the second, during my hour talk at the HewittFest at the University of Washington in\n1988\n, when I drew special attention to the remarkable paper 'Rings of real-valued continuous functions I', he noted simply \"There were errors in that paper.\" As to the second apparent motivation for the early career change of orientation, he declared himself publicly on the folly of his misspent youth: \"I see little use for the elaborations of axiomatic topology. I had a rather severe case of the disease as a young man, but I'm happy to say it has been almost totally cured.\"\nOne of Hewitt's best known results is the Hewitt-\nSavage\nzero-one law which appeared in his joint paper with\nJimmie Savage\n,\nSymmetric measures on Cartesian products\n(1955)\n. In this paper they note that their result:-\n... was commented on by several who saw a prepublication copy of this paper. Blackwell, and Chung and Derman wrote us independently that they had become interested in the following question in connection with forthcoming publications. Is it true that the partial sums of a sequence of identically distributed independent random variables visit an arbitrary\nBorel\nset infinitely often with probability either\n0\nor\n1\n? As they point out, the affirmative answer, which they had already demonstrated in certain cases, is an immediate consequence of Theorem\n11\n.\n3\n[\nthe Hewitt-\nSavage\nzero-one law\n]\n.\nHalmos\nand\nDoob\nhave shown us direct proofs, both of which make it plain that the theorem is close to and scarcely deeper than the ordinary\n0\n-\n1\nlaw. These proofs are, with their authors' permission, presented below.\nIn\n[\n13\n]\nHewitt writes that the main purpose of their 'zero-one' paper was:-\n... a construction of measures on extreme points of a convex set that is a special case of what later became\nChoquet\ntheory.\nWalter Schempp writes about Hewitt as a lecturer in\n[\n19\n]\n(\nsee also\n[\n18\n]\n)\n. Hewitt said:-\n\"The big secret I've learned the last few years is to love the students. I wish I'd learned it earlier.\" The standard material of lectures in analysis which he had offered so often to utterly different listeners he laid out before his students with his characteristic verve and explored it in lively dialogue with them, memorably spiced with little stories. \"The only stupid question is the one that isn't asked.\" His ever friendly responsiveness to students should not be misunderstood: he did not compromise in the mathematical demands he made on them. \"Exercises are to a mathematician what Czerny is to a pianist.\"\nHewitt took on several important roles both in his own university and in the wider mathematical community. For example he was a member of the Mathematics division of the National research Council from\n1957\nto\n1969\n, being on the executive committee during\n1960\n-\n62\nand\n1967\n-\n69\n. He also served as a member of the United States National Committee for Mathematics from\n1973\nto\n1977\n, being its chairman during\n1975\n-\n1977\n. In the University of Washington he served as vice-chairman, then chairman, of the Faculty Senate during\n1873\n-\n75\n.\nHewitt loved mathematics, music and, above all, travelling. After he retired in\n1986\nhe continued his life of travelling and undertaking research. He found languages easy to learn and so had quickly learnt the language of the countries he had visited including French, German, Swedish, Russian, and Japanese. After retiring he started learning Chinese. Sadly his active retirement was short\n[\n10\n]\n:-\nIn January,\n1989\n, while attending a joint-meeting of the\nMathematical Association of America\nand the\nAmerican Mathematical Society\nin Phoenix, Hewitt suffered a massive stroke, which affected his speech, numerical abilities and other functions. Still, he continued to live alone and enjoyed entertaining friends. A subsequent stroke, along with other health problems, forced him into a nursing home, speechless and essentially unresponsive - the end of a good, long run.\nDeborah Tepper Haimo writes\n[\n10\n]\n:-\nMathematicians are judged by their mathematics not their social graces, and some important mathematicians have been social misfits. Most, however, are rather ordinary people, socially. And a few are even very adept socially, collecting large numbers of friends, collaborators and pleasant adventures while still doing important mathematics. Edwin Hewitt is in this last group. His life ... shows that it is possible to enjoy life, enjoy people, and also enjoy and do first-rate mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}