{
  "nome_completo": "Elemér Kiss",
  "nome_curto": "Elemér Kiss",
  "ano_nascimento": "1929",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kiss/",
  "lugar_nascimento": "Braşov, Romania",
  "lugar_morte": "Târgu-Mureş, Romania",
  "biografia": "Elemér Kiss\nwas born in Brașov, Romania. The town is also known as Kronstadt in German and Brassó in Hungarian. His father was István Kiss\n(1904\n-\n1996)\nand his mother was Berta Csedő\n(1904\n-\n1985)\n. He was brought up in Armaseni\n(\nHungarian name Csikménaság\n)\n, a village in Csík region, where his father was a teacher in the local school and his mother was a kindergarten teacher. Their family, as many families at that time, led a very simple life, but they brought up their three children with great love, all of them graduating from university. His father, István, was a beekeeper as well as a school teacher, and the respect for nature and local region that Elemér inherited from his parents was evident later on in papers he wrote on bees, namely\nThe Bees and Geometry\nand\nConstruction of Bees\n. He attended high school in Miercurea Ciuc\n(\nCsíkszereda\n)\nwhere he studied at the\nGymnasium\nwhere his mathematics teachers were Gergely Borcsa and Kálmán Bakó. He began his studies at the Catholic Gymnasium in\n1940\nand, after eight years at the school, Kiss went to Cluj where he attended the\nBolyai\nUniversity, beginning his studies in\n1948\n. There is a quite complicated story of the Hungarian and Romanian universities in Cluj\n(\nand even the name of the city of Cluj, which was renamed Cluj-Napoca in the Ceausescu era\n)\n. For a short history of the\nBolyai\nUniversity we refer the reader to our biography of\nGyula Maurer\nwho was also a student at the\nBolyai\nUniversity when Kiss entered, but two years ahead of him. At the\nBolyai\nUniversity Kiss had Samu Borbély, Ferenc Radó and Jenő Gergely among his professors.\nKiss graduated from the\nBolyai\nUniversity in\n1951\n, obtaining a qualification to teach mathematics and physics at a high school, and spent the next ten years as a secondary school teacher. He was employed at the\nFarkas Bolyai\nHigh School in Târgu-Mureș\n(\nthe city is known as Marosvásárhely in Hungarian\n)\n. This school is named after the mathematician\nFarkas Bolyai\nwho was a teacher at the school. His son\nJános Bolyai\n, an even more famous mathematician than his father, also studied at this school. However, this school has a long history stretching back to\n1557\nand was one of the first schools of the Reformed Church in Transylvania. Kiss taught at this famous school until\n1961\nwhen he was appointed as a lecturer in the Mathematics Department of the Teachers' College in Târgu-Mureș. This Pedagogical Institute had been founded in Târgu-Mureș in\n1960\nand, despite several changes of name and changes in structure, has continued to operate in the city being, since\n1996\n, the Petru Maior University of Târgu-Mureș. We note that Petru Maior\n(1760\n-\n1821)\nafter whom the university is now named, was one of the leading Transylvanian scholars of his time making contributions to history, philosophy, linguistics, Christian morals, and to both secular and religious education. In this period, Kiss was elected a member in the leadership of the Romanian Society of mathematics between\n1962\n-\n65\n.\nIn\n1964\nhe was married to Ágnes Julianna Tankó, a mathematics teacher, and they had two sons, Levente, born in\n1966\n, and Péter born in\n1969\n. Levente became a scientist in Budapest, he was awarded a D.Sc. in biology, and has four children, Márton, Boróka, Kornél-Ábel, and Lotti-Emma, while Péter was awarded a Ph.D. in electrical engineering. He now lives in New Jersey and has three daughters, Zsuzsa, Eszter and Kinga.\nIn\n1974\nKiss was awarded his doctorate from the Babeș-Bolyai University of Cluj for his thesis on algebra. His thesis advisor was the algebraist\nGheorghe Pic\nwho was head of the Department of Mathematics at Babeș-Bolyai University. Kiss served as Head of the Department of Mathematics between\n1976\nand\n1985\n. At this time the institution in which he worked was called the Institute of Higher Education of Târgu-Mureș. In\n1985\nit became the Institute of Education and Engineering, being part of the Polytechnic Institute of Cluj, then in\n1991\nit became the Technical University of Târgu-Mureș. Kiss continued to teach at this institution in each of its different characters and different names. Between\n1975\nand\n1995\nhe was a member of the editorial board of the mathematical journal\nMatematikai Lapok\n, edited in Cluj. In\n1999\n, when Kiss was seventy years of age, he retired from the Petru Maior University of Târgu-Mureș. At this time he was one of the founders of the Sapientia Hungarian University of Transylvania in Târgu-Mureș where he worked until his death.\nWe look now at the mathematical contributions made by Kiss. His first papers were on algebraic equations and polynomials. He published two papers in Romanian, namely\nCommon roots of an arbitrary number of algebraic equations of higher order\n(1966)\nand\nA theorem of Hurwitz type\n(1967)\n. The first of these gives theorems specifying necessary and sufficient conditions for\nn\n−\nk\nn - k\nn\n−\nk\nequations each of degree\nn\nn\nn\nto have\nk\n+\n1\nk + 1\nk\n+\n1\ncommon roots,\n0\n≤\nk\n≤\nn\n−\n1\n0 ≤ k ≤ n - 1\n0\n≤\nk\n≤\nn\n−\n1\n. The second paper generalises a theorem of\nHurwitz\ngiving conditions on the coefficients of a polynomial under which the zeros lie within a certain annulus in the complex plane. The next topic to interest Kiss was related to ring theory. He published two papers in German, namely\nÜber eine Kategorie von Halbmoduln\nⓉ\n(\nOn a category of semimodules\n)\n(1974)\nand\nÜber das Linkspseudozentrum eines Ringes\nⓉ\n(\nOn the left pseudo center of a ring\n)\n(1978)\n. In the second of these papers Kiss generalises standard properties of the centre of a ring to the pseudocentre. He continued his work on the pseudocentre of a ring and published two papers in English, namely\nRings with dense left pseudocenter\n(1988)\n, and\nLeft pseudocommutative rings\n(1988)\n.\nThe research for which Kiss is most famous is his contributions to the history of mathematics which he began in the middle of the\n1990\ns. His contributions to the history of mathematics are exclusively on topic related to\nJános Bolyai\n. In particular he studied number theory and algebra in\nBolyai\n's work leading to a much better understanding of the range of\nBolyai\n's contributions. Before this work, almost everyone had thought that\nBolyai\n's only significant contribution was to non-euclidean geometry. In\n1995\nKiss published\nFermat's theorem in János Bolyai's manuscripts\n. Working on\nBolyai\n's manuscripts, Kiss found that\nBolyai\ninvestigated\nFermat\n's Little Theorem which, he says, is \"unexpected, for all the authors of\nBolyai\n's monographs agree with the opinion that the creator of the non-Euclidean geometry hadn't ever been dealing with number theoretic problems\".\nKiss continued to explore this line of research and published\nA short proof of Fermat's two-square theorem given by János Bolyai\n(1997)\n,\nJános Bolyai's enquiries on the decomposition of the primes\n4\nm\n+\n1\n4m + 1\n4\nm\n+\n1\ninto sums of two squares\n(1998)\n, and\nNotes on János Bolyai's researches in number theory\n(1999)\n. Stefan Porubsky writes in a review of the\n1999\npaper:-\nJános Bolyai\nis mostly known as one of the founders of non-Euclidean geometry. It is less well known that he left several thousand pages of manuscript notes written for his own satisfaction. After examining the manuscripts kept in the Teleki-Bolyai Library in Marosvásárhely\n(\nTârgu-Mureș\n)\n, the author reviews the number-theoretical achievements of\nBolyai\nin this paper. It is documented here that\nBolyai\n's manuscripts contain many ideas which have hitherto been attributed to other mathematicians. The topics covered are related to the converse of\nFermat\n's little theorem, pseudoprimes to base\n2\n, complex integers, decomposition of primes as the sum of two squares and\nFermat\nnumbers.\nIn\n1999\nKiss's book\nMathematical gems from the Bolyai chests. János Bolyai's discoveries in number theory and algebra as recently deciphered from his manuscripts\nwas published. This was an English translation of his Hungarian text. The book received an award from the\nHungarian Academy of Science\nfor its exceptional value and, in addition, received the\nBolyai\nAward of the\nJános Bolyai\nFoundation. Colin Fletcher reviewed this important book and, after giving a summary of\nBolyai\n's life, writes:-\nSome biographers have suggested that his\n[\nBolyai\n's\n]\noriginality was dissipated after the appearance of the Appendix, and even that his interest in mathematics slumped. Using the fields of algebra and number theory this book attempts to show that this was not so. When\nJános Bolyai\ndied, the military governor seized all his manuscripts, and had them put in chests and transported to the castle so that they could be examined for military secrets. Thus were his papers\n(\nby and large\n)\npreserved for posterity, approximately\n14\n,\n000\npages of manuscripts. The task facing researchers has not been easy: there are few dates, no numbered pages, pages missing, notes on envelopes and theatre programmes, idiosyncratic mathematical notations and newly invented words. Examples of the mess are given in the text. It is known that a number of letters and notes have been destroyed.\nBolyai\n's \"Responsio\" was his entry to a Leipzig competition of\n1837\nconcerning the construction of complex numbers. In it he defined them as ordered pairs of reals\n(\nas had\nHamilton\na few years earlier\n)\nand he made a connection with the non-Euclidean geometry of the Appendix. In number theory a lot of his work was original, some of it preceding published work of others. He was interested in prime numbers both in\nZ\n\\mathbb{Z}\nZ\nand in\nZ\n[\ni\n]\n\\mathbb{Z}[i]\nZ\n[\ni\n]\n. In\nZ\n\\mathbb{Z}\nZ\nhe tried to find a formula for primes and was led to speculate whether\nFermat\n's theorem had a converse. This in turn led him to the discovery of the smallest pseudoprime\n341\n, and to the proof of a theorem of\nSir James Jeans\nwhich was published while he was an undergraduate in\n1898\n.\nBolyai\ndisplayed an odd mixture of ignorance and originality. He was able to give new short proofs of\nFermat\n's theorem on primes of the form\n4\nm\n+\n1\n4m + 1\n4\nm\n+\n1\n, and yet at one point he assumed that\n2\np\n−\n1\n2^{p} - 1\n2\np\n−\n1\nwas always prime. His knowledge of number theory was mainly derived from the 'Disquisitiones' of\nGauss\n, and this produced blind spots.\nGauss\ndid not mention that the converse of\nWilson\n's theorem was proved by\nLagrange\n, and so\nBolyai\nwas unaware of the fact and he produced his own proof.\nTurning to\nBolyai\n's work on the Gaussian integers, the author claims that\nBolyai\n\"elaborated the arithmetics of complex integers independently of\nGauss\n, and approximately at the same time\".\nGauss\nstill had the priority and indeed the more exhaustive treatment, but\nBolyai\nindependently had the results on greatest common divisors and unique factorisation. Earlier historians, such as\nStäckel\n, seem to have missed such originality.\nFinally, we note that\nBolyai\nworked on the solvability of polynomial equations and the fundamental theorem of algebra. The text ends with translations of a number of letters between father and son. Our one-club golfer has turned out to be more of an all-round player.\nAfter the publication of this book, Kiss continued to publish papers improving understanding of the mathematical achievements of\nJános Bolyai\n. He published\nJános Bolyai, the versatile mathematician\n(2002)\n, and\n(\nwith József Sándor\n)\nOn a congruence by János Bolyai, connected with pseudoprimes\n(2004)\n. In the second of these papers the authors study a congruence discovered in manuscripts of\nBolyai\n. They prove some theorems related with pseudoprimes. These theorems give necessary and sufficient conditions to obtain certain congruences modulo a power of a prime.\nIn\n2006\n, the year in which Kiss died, he published\nJános Bolyai's new face\n. Doru Stefanescu writes in a review:-\nThe paper presents the main mathematical contributions of\nJános Bolyai\nin number theory and algebra. The author studied several manuscripts of\nBolyai\nand found that\nBolyai\nobtained consistent results in fields other than geometry. In the paper under review, the author discusses the results of\nBolyai\non\nFermat\n's little theorem, pseudoprime and\nMersenne\nnumbers, and Diophantine and exponential Diophantine equations. The paper contains many excerpts from the manuscripts of\nBolyai\nand a short section on his correspondence with his father\nFarkas Bolyai\n, who was also a mathematician.\nFour years after Kiss's death, a joint paper with Péter Gábor Szabó was published, namely\nThe problems of the mathematical analysis in the manuscript heritage of the two Bolyais\n(\nHungarian\n)\n(2010)\n.\nAmong the honours given to Kiss we mention his election to the\nHungarian Academy of Sciences\n(2001)\nand being made a Freeman of the city of Târgu-Mureș\n(2006)\n. The Kiss Elemér College of the Sapientia Hungarian University of Transylvania in Târgu-Mureș is named for him.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}