{
  "nome_completo": "Mary Ann Elizabeth Stephansen",
  "nome_curto": "Elizabeth Stephansen",
  "ano_nascimento": "1872",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stephansen/",
  "lugar_nascimento": "Bergen, Norway",
  "lugar_morte": "Espeland, Norway",
  "biografia": "Elizabeth Stephansen\nused the spelling 'Elisabeth' for her name until she was in her middle\n30\ns. She was widely known as Betzy. Her parents were Gerche Reimers Jahn and Anton Stephan Stephansen and, if the names 'Mary Ann Elizabeth' sound very English for a Norwegian girl, this is easily explained since she was named after her maternal grandmother who was indeed English and named Mary Ann Elizabeth Lockwood. Betzy's father Anton Stephansen first worked in the manufacturing business, then as a salesman before deciding to open his own business. He opened a textile shop in Bergen in\n1870\nas a first step towards opening a textile factory which he did\n25\nyears later. Shortly after setting up his textile shop he married Gerche Jahn, and Betzy was the first of their seven children.\nAnton Stephansen's shop provided a good income and Betzy grew up in a prosperous Bergen family. After a happy childhood she entered Bergen Katedralskole in\n1887\n. Two other girls started their education at the school at the same time and these three were the first girls in a boys school. She wrote later\n(\nsee for example\n[\n1\n]\n)\n:-\nI can't say that we thought of the situation as in any way sensational that we were female students in a boys school. From the point of view of the school they made no special arrangements for our sake ...\nStephansen studied science at the Bergen Katedralskole graduating with her diploma in\n1891\n. Women could study at universities in Norway at this time; in fact the first women were admitted in\n1887\nfour years before Stephansen graduated from high school. However Norwegian universities did not provide the education that she was looking for so she decided to sit the entrance examination for the Eidgenössische Polytechnikum in Zürich\n(\nlater to become the Eidgenössische Technische Hochschule\n)\n. We know a little of how this came about through a letter which her mother wrote on\n8\nFebruary\n1892\nin support of an application that Stephansen was making for a grant from the Queen Josefine endowment. Gerche Stephansen wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nBetzy, our eldest daughter, as you perhaps know graduated last summer with honours. Her inclination and desire was to study mathematics. If she were to study natural science at our university, it would take six years and she would have to study many other subjects she has no interest in, since our university provides more of an education for government officials than an education in particular subjects. Therefore she was allowed to travel to the Polytechnikum in Zürich where she registered in the mathematics department and did very well in the entrance examination, which was very difficult. She was, for example, the only Norwegian who passed and over a hundred of all those who took the examination failed, of all nationalities of course. Zürich and Paris were the only places that a woman could be accepted, we chose Zürich as the Polytechnikum there is highly recommended and we thought it would be cheaper than Paris. ...\nStephansen's application, perhaps helped by the letter of support from her mother, was successful and she was awarded a grant from the Queen Josefine endowment. At Zürich she attended lecture courses by\nHurwitz\nand\nFrobenius\namong others. She took a year off in the middle of her studies spending the year\n1894\n-\n95\nhelping her family set up their textile factory in Espeland near Bergen. The family set up home in Espeland and opened the factory which manufactured textiles for her father's firm A S Stephansen A/S. Returning to Zürich she graduated from the Polytechnikum in\n1896\n. Stephansen wanted to become a secondary school teacher of mathematics but although women had earned the right to become secondary school teachers in Norway in precisely the year that Stephansen was awarded her degree, they were not allowed to receive permanent contracts. Stephansen was employed from\n1896\nas a part-time teacher at her old school, Bergen Katedralskole, for two years and then she taught at Bergen Tekniske Skole for a year, teaching four hours a week. Of course pupils were completely surprised to have a woman teacher. Some of these pupils wrote on\n27\nApril\n1889\n(\nsee\n[\n1\n]\n)\n:-\nAs a curiosity we can mention that this year\n[\nthe school\n]\nhas hired a very attractive young lady as an assistant in second year physics and mathematics since the class this spring was so large it had to be divided into two parallel sessions. To what extent the council of teachers has acted rashly by hiring such a young example of the fair sex, only time will tell. To begin with there are probably many who find that a female teacher for grown technicians is rather modern, while others so lose their senses when they meet her face to face during examinations that they forget even the simplest rules of good form, not to mention mathematical formulas ...\nDuring the time that she was teaching Stephansen was working on her doctoral dissertation on partial differential equations.\nEuler\n,\nd'Alembert\nand\nLagrange\nhad studied which second order partial differential equations which could be reduced to first order and this had been generalised by the Norwegian mathematician Alf Guldberg who, in\n1900\n, had described all those third order partial differential equations which could be reduced to second order equations. In her thesis, Stephansen generalised Guldberg's work and succeeded in describing all those fourth order partial differential equations which could be reduced to equations of the third order. The problem broke up into a large number of cases all requiring to be analysed separately. The authors of\n[\n1\n]\nwrite:-\nStephansen's acute sense for all kinds of hidden symmetries, not easily detected without clever manipulations with complicated quantities and expressions, was unusual, to say the least.\nStephansen's thesis\nÜber Partielle Differentialgleichungen vierter Ordung die ein intermediäres Integral besitzen\nⓉ\n(\nOn partial differential equations of the fourth order possess an intermediate integral\n)\nwas published in\n1902\nand in that year she was awarded her doctorate by the University of Zürich. The Eidgenössische Polytechnikum could not award doctorates which is why she had to submit her thesis to the University of Zürich. With the award of the doctorate in mathematics Stephansen became the first Norwegian woman to be awarded a doctorate in a science subject. After making a successful application to the Executive Committee of the Royal Norwegian Frederik's University for a travel grant, she spent the winter semester of\n1902\n-\n03\nat the University of Göttingen where she attended courses by\nHilbert\n,\nKlein\nand\nZermelo\n. In fact she became friends with\nHilbert\n, visiting his home on numerous occasions. Stephansen published another paper in\n1903\non differential equations, the idea for which came out of\nHilbert\n's course of lectures that she attended.\nBack in Norway, Stephansen worked as a teacher at Olaf Berg's Girls School in Oslo. She continued to undertake mathematical research and wrote two further papers, this time on difference equations, which were published in\n1905\nand\n1906\n. In\n1906\nshe was appointed to the Norges Landbrukshoiskole\n(\nNorwegian Agricultural College\n)\nand worked there until she retired in\n1937\n. At the College she taught mathematics and physics, and from\n1921\nshe was appointed\ndocent\nin mathematics\n[\n2\n]\n:-\nShe always took her work to class in her knitting basket, along with her knitting and lived in the student residences the entire time she worked as an assistant. While there she was also responsible for processing all the meteorological results and writing these up for the College's annual report.\nAfter Stephansen retired in\n1937\nshe went to Espeland to live with her sister Gerda. It did not turn out to be quite the peaceful retirement that Stephansen would have expected for on\n9\nApril\n1940\nHitler disregarded Norway's neutrality and ordered an invasion. By the following day German troops were in Bergen and Stephansen found herself in an occupied land. Many Norwegians were taken prisoner and held in a prison camp at Espeland. Stephansen, of course, could speak fluent German and she ignored the personal risks involved to give what help she could to the prisoners in the camp. After the war ended she was awarded the King's Medal of Service for the outstanding efforts she had made to help her fellow countrymen.",
  "math_areas": [
    "Calculus"
  ]
}