{
  "nome_completo": "Ellis Robert Kolchin",
  "nome_curto": "Ellis Kolchin",
  "ano_nascimento": "1916",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kolchin/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "Ellis Kolchin\nwas the son of Morris Kolchin and Betty Steinreich. He studied at Columbia University where, after graduating, he continued to undertake research under Joseph\nRitt\n. While he was a research student, Kolchin married Kate Weil on\n14\nJune\n1940\n; they had two children Peter and Ellen. Well before he had completed his research he was writing papers such as\nOn certain ideals of differential polynomials\n(1939)\n, written jointly with Ritt, and\nOn the basis theorem for infinite systems of differential polynomials\n(1939)\n. Both papers appeared in the\nBulletin of the American Mathematical Society\n. In\n1941\nhe submitted his doctoral dissertation\nOn the Exponents of Differential Ideals\nand was awarded a Ph.D. He published the main results in a paper with the same title\nOn the Exponents of Differential Ideals\nin the\nAnnals of Mathematics\nin\n1941\n.\nThe United States entered World War II on\n11\nDecember\n1941\nafter the Japanese attack on Pearl Harbour four days earlier. Kolchin served with Naval Intelligence, first in Washington, then in the South Pacific. Despite serving his country during the war, Kolchin was still able to publish papers such as\nOn the basis theorem for differential systems\n(1942)\nand begin his fundamental work on the\nGalois theory\nof differential fields in the three part paper\nExtensions of differential fields\n. Part\n1\nappeared in\n1942\n, part\n2\nin\n1944\nand part\n3\nin\n1947\n. Other papers around this time were\nAlgebraic matric groups\n(1946)\nand\nThe Picard-Vessiot theory of homogeneous linear ordinary differential equations\n(1946)\n.\nKolchin returned to Columbia University at Morningside Heights, Manhattan, after serving in the South Pacific and accepted a position there. He was steadily promoted, being named Adrian Professor of Mathematics in\n1976\n. He retired in\n1986\nbut continued to undertake research right up to his death at the age of\n75\n.\nIn\n1977\nContributions to algebra : A collection of papers dedicated to Ellis Kolchin\nwas published. The Preface explains some of the main directions of Kolchin's contributions:-\nAlthough the articles in this volume are in the main devoted to commutative algebra, linear algebraic group theory, and differential algebra, the diversity of subjects covered - complex analysis, algebraic K-theory, logic, stochastic matrices,\ndifferential geometry\n, ... - is a reflection of Ellis Kolchin's wide-ranging mathematical curiosity. His deep and abiding interest has always been in the application of the powerful and clarifying techniques of algebra to problems in the theory of differential equations. Following the tradition set by Joseph Fels Ritt\n(1893\n-\n1951)\n, the founding father of differential algebra, his desire has been to remove the algebraic aspects of differential equations from analysis. It was in the course of applying the Ritt theory to the classical\nPicard\n-\nVessiot\ntheory that he became one of the pioneers of linear algebraic group theory. In this volume we celebrate the influence that Kolchin's work on the\nGalois\ntheory of differential fields has had on the development of differential algebra and linear algebraic group theory.\nIn\n1973\nKolchin published\nDifferential algebra and algebraic groups\n. P Blum, reviewing the book, pays a nice tribute to Kolchin:-\nThis book, published after years of careful preparation, is a tour de force of the highest proportions. The author, as is well known, is the leading authority in the field of differential algebra. There are few people working in this area who have not benefited enormously through personal contact with him and none who have not been influenced by his publications. His goal here is to present a unified exposition of the subject, in an algebraic setting, presuming no more than a standard first year graduate course in algebra.\nIn\n1985\nKolchin published\nDifferential algebraic groups\n. In a review, A R Magid gives a clear, but rather technical, description of the topic which Kolchin spent his life developing. For those who have the background to understand the terms mentioned, we give an extract:-\nThis book gives the foundations of a theory of differential algebraic groups. It is intended that such a theory bear to algebraic groups the same relation that the theory of differential equations bears to the theory of algebraic equations. Algebraic groups can be viewed as groups in the category of algebraic varieties, where the latter are taken to be locally given as sets of simultaneous solutions of algebraic equations. But in fact the foundational aspects of the theory are better served by an abstract view of algebraic varieties as sets with an additional structure, where the latter is usually a sheaf of integral domains, but could be taken as a collection of fields with specialization relations\n(\nthe ring of sections over a set is replaced by its quotient field and the restriction maps endue the specializations\n)\n. To lay the foundations of differential algebraic groups, the author adopts a similar formulation: the objects are sets with attached collections of fields and specialization maps, except now the fields are extensions, inside some fixed universal differential field U, of a fixed subfield F with set of derivation operators D, and the specializations must preserve the D - F structure. With these objects the theory is developed.\nAs we indicated above, Kolchin spent his whole career at Columbia University. However he did spend time in other institutions supported by several different bodies. For example he was a Guggenheim Fellow at the Sorbonne in\n1954\n-\n55\n. He was a National Science Fellow at the University of Paris in\n1960\n-\n61\n. He was also a visiting professor at the Institute for Advanced Study at Princeton, the Tata Institute in Bombay, and the Kyoto Mathematics Institute in Japan. In the Preface to\n[\n1\n]\n, H Bass, A Buium and P J Cassidy write:-\nFluent in Russian, he fostered contact with Soviet mathematicians, and in\n1965\n, he was an exchange lecturer in the Soviet Union under the joint sponsorship of the U.S. and Soviet Academies of Science. In August\n1975\n, he was Colloquium Lecturer at the\nAmerican Mathematical Society\nSummer meeting.\nKolchin was honoured for his achievements. He was elected a fellow of the\nAmerican Academy of Arts and Sciences\nand the American Association for the Advancement of Science. His seminar in differential algebra, the longest ongoing mathematics seminar at Columbia University, ran for over\n30\nyears. It was a whole day meeting with participants taking lunch in the Moon Palace. It was the most vigorous meeting with a very open exchange of ideas. In the Preface to\n[\n1\n]\nthe authors point out:-\nThe members of the circle that formed around Kolchin were energised by his mathematical power and integrity, by his generosity in sharing his techniques and insights, by his kindness, and in general by the values he personified.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}