{
  "nome_completo": "Elwin Bruno Christoffel",
  "nome_curto": "Elwin Christoffel",
  "ano_nascimento": "1829",
  "ano_morte": "1900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Christoffel/",
  "lugar_nascimento": "Montjoie Aachen (now Monschau), Germany",
  "lugar_morte": "Strasbourg, France",
  "biografia": "Elwin Christoffel\nwas noted for his work in mathematical analysis, in which he was a follower of\nDirichlet\nand\nRiemann\n.\nChristoffel's parents both came from families who were in the cloth trade. He attended an elementary school in Montjoie\n(\nwhich was renamed Monschau in\n1918)\nbut then spent a number of years being tutored at home in languages, mathematics and classics. He attended secondary schools from\n1844\nuntil\n1849\n. At first he studied at the Jesuit\nGymnasium\nin Cologne but moved to the Friedrich-Wilhelms Gymnasium in the same town for at least the three final years of his school education. He was awarded the final school certificate with a distinction in\n1849\n.\nChristoffel studied at the University of Berlin from\n1850\nwhere he was taught by\nBorchardt\n,\nEisenstein\n,\nJoachimsthal\n,\nSteiner\nand\nDirichlet\n. It was\nDirichlet\nwho had the greatest influence on him and Christoffel is rightly thought of as a student of\nDirichlet\n's.\nAfter one year of military service in the Guards Artillery Brigade, he returned to Berlin to study for his doctorate which he was awarded in\n1856\nwith a dissertation on the motion of electricity in homogeneous bodies. His examiners included mathematicians and physicists,\nKummer\nbeing one of the mathematics examiners.\nAt this point Christoffel spent three years outside the academic world. He returned to Montjoie where his mother was in poor health but read widely from the works of\nDirichlet\n,\nRiemann\nand\nCauchy\n. It has been suggested that this period of academic isolation had a major effect on his personality and on his independent approach towards mathematics.\nButzer\n, in\n[\n3\n]\n, remarks that Christoffel's biographers have described him as\na lonely man, ... shy, distrustful, unsociable, irritable and brusque.\nIt would seem unreasonable to attribute these aspects of his character solely to these three years, yet clearly these years had a large influence on him and certainly contributed to his being an very independent thinker. It was during this time that he published his first two papers. These papers, which appeared in\n1858\n, are on numerical analysis, in particular numerical integration. He generalised\nGauss\n's method of\nquadrature\nand expressed the polynomials which are involved as a\ndeterminant\n. This is now called Christoffel's theorem.\nIn\n1859\nChristoffel took the qualifying examination to become a university teacher and was appointed a lecturer at the University of Berlin. In\n1862\nhe was appointed to the chair at the Polytechnicum in Zürich, filling the post left vacant when\nDedekind\nwent to Brunswick. The Polytechnic School in Zürich had been set up seven years before and the mathematics courses which they offered were mainly aimed at engineering students. Christoffel was to have a huge influence on mathematics at the Polytechnicum, setting up an institute for mathematics and the natural sciences there.\nIn\n1868\nChristoffel was offered a chair at the Gewerbsakademie in Berlin which is now the University of Technology of Berlin. This was not the first time an attempt had been made to interest Christoffel in moving to this university since a new position had been set up and the university authorities wanted an eminent mathematician to fill he post. Shortly after the\n1868\noffer to Christoffel another position was offered to him, namely to become a founding director of the new Polytechnicum at Aachen. This new university, now the prestigious Rheinisch- Westfälische Technische Hochschule at Aachen, must have been an attractive idea to Christoffel who was born and brought up close to Aachen.\nChristoffel, however, did not accept the Aachen position: perhaps he was already committed to the Gewerbsakademie in Berlin for he certainly left Zürich for Berlin to take up his new post on\n1\nApril\n1869\n. This move may have been a mistake for Christoffel. He and his colleague\nAronhold\ntried to attract high quality students to the Gewerbsakademie but this proved difficult with the highly prestigious University of Berlin with\nWeierstrass\n,\nKummer\nand\nKronecker\nclose by.\nAfter three years at the Gewerbsakademie in Berlin, Christoffel was offered the chair of mathematics at the University of Strasbourg. This was a university with a long and distinguished past, but the university was undergoing a major reorganisation following the Prussian capture of Alsace- Lorraine. From his appointment in\n1872\nChristoffel began to built up a new Institute for mathematics there much along the lines which he had followed in Zürich\n10\nyears before. He was assisted in his efforts to build this new highly successful department by his colleague\nReye\n.\nChristoffel was to hold this chair until he was forced to retire due to ill health in\n1892\n. He broke his arm in an accident shortly before he retired and this was certainly one of the reasons he decided to retire.\nHeinrich Weber\nwas appointed to succeed him at Strasbourg in\n1895\n.\nChristoffel supervised six doctoral students while at Strasbourg. At least four of these were to become university professors of mathematics, including Paul\nEpstein\n.\nChristoffel published papers on function theory including\nconformal mappings\n, geometry and\ntensor\nanalysis,\nRiemann\n's o-function, the theory of invariants, orthogonal polynomials and\ncontinued fractions\n,\ndifferential equations\nand\npotential theory\n, light, and shock waves.\nSome of Christoffel's early work was on conformal mappings of a simply connected region bounded by polygons onto a circle. This work on conformal mappings was published in four papers between\n1868\nand\n1870\n. The first of these papers was written while Christoffel was at Zürich, the remaining three papers on the Christoffel-\nSchwarz\nformula were written while he was at the Gewerbsakademie in Berlin.\nBetween\n1865\nand\n1871\nChristoffel published four important papers on potential theory, three of them dealing with the\nDirichlet\nproblem. In\n1877\nChristoffel published a paper on the propagation of plane waves in media with a surface discontinuity. This was an early contribution to the theory of shock waves and followed earlier work on one dimensional gas flows by\nRiemann\n.\nChristoffel was interested in the theory of invariants. He wrote six papers on this topic. He wrote important papers which contributed to the development of the tensor calculus of C G\nRicci-Curbastro\nand Tullio\nLevi-Civita\n. The Christoffel symbols\n[\nij,k\n]\nwhich he introduced are fundamental in the study of tensor analysis. The Christoffel reduction theorem, so named by\nKlein\n, solves the local equivalence problem for two quadratic differential forms. In\n[\n3\n]\nButzer\nwrites:-\nThe procedure Christoffel employed in his solution of the equivalence problem is what Gregorio\nRicci-Curbastro\nlater called covariant differentiation, Christoffel also used the latter concept to define the basic\nRiemann\n-Christoffel curvature tensor. ... The importance of this approach and the two concepts Christoffel introduced, at least implicitly, can only be judged when one considers the influence it has had.\nIndeed this influence is clearly seen since this allowed\nRicci-Curbastro\nand\nLevi-Civita\nto develop a coordinate free differential calculus which\nEinstein\n, with the help of\nGrossmann\n, turned into the tensor analysis mathematical foundation of general relativity.\nChristoffel wrote\n35\npapers but this does not represent the full extent of his mathematical work. In fact, in common with many others at that time, much of his original research was put into his lecture courses and only through that source was it known. Timerding described Christoffel's teaching, this description is quoted in\n[\n3\n]\n:-\nChristoffel was one of the most polished teachers ever to occupy a chair. His lectures were meticulously prepared, to the smallest detail ... His delivery was lucid and of the greatest aesthetic perfection ... The core of the lectures was the course on complex function theory, distinguished by the inspirational name of\nRiemann\n. Christoffel had developed\nRiemann\n's function theory independently, particularly in the area of ultraelliptic functions, but did not publish his research, presenting them only in his lectures, after the model of\nWeierstrass\n.\nIt is very difficult to rank mathematicians. How does one compare someone who worked solely in one area with another who contributed to many areas? Again how does one compare someone who worked on differential equations with a geometer? Despite the obvious difficulties, and minor differences of opinion, it is still surprising how much agreement there is on such a ranking. In\n[\n5\n]\nButzer\nand Fehér attempt to fit Christoffel into such a ranking:-\nIt is difficult to compare a differential geometer with a function theorist, or those working on ordinary and\npartial differential equations\nwith numerical analysts. Christoffel not only contributed to all these fields, but his interests extended to orthogonal polynomials and continued fractions, and the applications of his work to the foundations of tensor analysis, to geodetical science, to the theory of shock waves, to the dispersion of light. Nevertheless, it is widely recognised, at least in the German speaking countries of Europe, that\nRiemann\nwas the best mathematician of the\n19\nth\ncentury, behind\nGauss\nand ahead of\nWeierstrass\n. In our opinion Christoffel's teacher\nDirichlet\n, belongs to the next most important group of mathematicians which includes\n(\nin chronological order of birth\n)\nJacobi\n,\nKummer\n,\nKronecker\n,\nDedekind\n,\nCantor\nand\nKlein\n. Christoffel himself should be placed in a second group following these. This second group, which may partly overlap with the former, would include such illustrious names as\nMöbius\n,\nvon Staudt\n,\nPlücker\n,\nHeine\n,\nDu Bois-Reymond\n,\nCarl Neumann\n,\nLipschitz\n,\nFuchs\n,\nSchwarz\n,\nHurwitz\nand\nMinkowski\n.\nIf mathematical physicists are also taken into account then\nButzer\nand Fehér believe that Christoffel would have to be compared with\nGreen\n,\nHamilton\n,\nSylvester\n,\nHelmholtz\n,\nCayley\n,\nKirchhoff\n,\nMaxwell\n,\nBeltrami\n,\nLie\n,\nBoltzmann\n,\nPoincaré\nand\nFredholm\n. I\n[\nEFR\n]\nmust say that I find it surprising that some of these mathematicians are considered by\nButzer\nand Fehér to be mathematical physicists.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}