{
  "nome_completo": "Emanuel Sperner",
  "nome_curto": "Emanuel Sperner",
  "ano_nascimento": "1905",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sperner/",
  "lugar_nascimento": "Waltdorf, Upper Silesia (now Poland)",
  "lugar_morte": "Laufen, Sulzburg, Baden-Württemberg, Germany",
  "biografia": "Emanuel Sperner\n's father was an estate agent who worked in Neisse\n(\nnow Nysa\n)\n, the main town in the region, which was known as the \"Silesian Rome\" because of its many old churches. Waltdorf was a village close to Neisse. His name, Emanuel, was an Old Testament name meaning \"God with us\" and Bachmann writes in\n[\n1\n]\nthat Sperner was proud of his biblical name and felt a closeness with Emanuel Kant whom he greatly admired. Sperner attended the Carolinum\nGymnasium\nin Neisse where he received an excellent education. As well as giving him an excellent background in mathematics he graduated from the school in\n1925\nhaving learnt six languages. In particular, he always spoke of his debt to his German teacher G Janocha who taught him to think in a logical and clear way.\nIn\n1925\n, the year he graduated from the Carolinum Gymnasium in Neisse, Sperner entered the University of Freiburg. However life did not prove that easy for the young student who had to overcome illness. As was the custom for students at this time, Sperner did not spend the whole of his university career at a single university but, after two semesters, he went to the University of Hamburg. At Hamburg he had\nWilhelm Blaschke\nas his thesis advisor but he was also taught and advised by\nOtto Schreier\n. Sperner greatly appreciated\nBlaschke\n's help and often in later life spoke about how much he owed to his advice. Sperner was awarded his doctorate, with distinction, on\n15\nNovember\n1928\nfor his thesis\nNeuer Beweis für die Invarianz der Dimensionszahl und des Gebietes\nⓉ\n(\nNew proof of the invariance of dimension and number of the region\n)\n. This thesis contained the important result which today is known as Sperner's lemma. Sperner published a paper with the same title as his thesis, which he submitted to the Hamburg Mathematical Seminar in June\n1928\nand it was published later that year. In the paper he writes:-\nThe suggestion for dealing with these questions was given to me by\nOtto Schreier\nin Hamburg, and I would like to express my warmest thanks to him at this point.\nThe editors of\n[\n1\n]\ndescribe the contents:-\nSperner was just\n22\nwhen in\n1928\nhe published his second paper, 'Neuer Beweis für die Invarianz der Dimensionszahl und des Gebietes'\nⓉ\n(\nNew proof of the invariance of dimension and number of the region\n)\n(1928)\n, in which he developed new methods, with which he was able to prove the\nLebesgue\nCovering Theorem, the invariance of dimension and also the invariance of domains, in an elementary way. The basic 'Sperner Lemma' used for this created great interest in topology:\nB Knaster\n,\nC Kuratowski\n, and\nS Mazurkiewicz\nwere able to prove the\nBrouwer\nFixed Point Theorem with its help. Sperner himself exerted great influence by applying the ideas he developed too.\nWe should give an indication of what 'Sperner's Lemma' states. First we define a Sperner labelling:\nDefinition. A\nSperner labelling\nof a triangle's triangulation is a labelling that satisfies the following conditions:\nThe vertices of the original triangle are labelled with three different letters\nA\n,\nB\nA, B\nA\n,\nB\n, and\nC\nC\nC\n.\nVertices of the triangulation that lie on the side\nA\nB\nAB\nA\nB\nare labelled either\nA\nA\nA\nor\nB\nB\nB\n. A similar condition holds for the vertices on sides\nB\nC\nBC\nB\nC\nand\nA\nC\nAC\nA\nC\n.\nThere is no restriction on labelling of the vertices of the triangulation inside the original triangle.\nThen Sperner's Lemma states:-\nEvery Sperner labelling contains at least one triangle of the triangulation labelled ABC.\nAs the above quote by the editors of\n[\n1\n]\nindicates, this paper was not the first that Sperner published.\nNote zu der Arbeit von Herrn B L van der Waerden: \"Ein Satz über Klasseneinteilungen von endlichen Mengen\"\nⓉ\n(\nNote on the work of van der Waerden: 'A theorem about classifications of finite sets'\n)\nwas submitted to the Hamburg Mathematical Seminar in January\n1927\nand published later that year. In February\n1927\nhe submitted his paper\nEin Satz über Untermengen einer endlichen Menge\nⓉ\n(\nA theorem on subsets of a finite set\n)\nto\nMathematische Zeitschrift\nand it was published early in\n1928\n. Now this last mentioned paper contains the result which today is known as Sperner's Theorem. This theorem describes the largest possible collection of subsets of a given set with the property that no subset in the collection contains any other subset in the collection. The fact that Sperner had discovered two results while still a research student which remain of major significance today is quite remarkable. But he had other results of great significance, for example his paper\nÜber einen kombinatorischen Satz von Macaulay und seine Anwendungen auf die Theorie der polynomideale\nⓉ\n(\nOn a combinatorial set of Macaulay and its applications to the theory of polynomials\n)\n(1929)\n. The importance of this paper can be seen from the fact that an English translation\nOn a combinatorial theorem of Macaulay and its applications to the theory of polynomial ideals\nwas published in\n2008\n. Marco Fontana, reviewing the\n2008\ntranslation, writes:-\nThis is the English translation of an interesting and still relevant paper published in\n1930\n[\nactually the paper was submitted in July\n1929\nand published later that year\n]\n. The aim of this paper was to produce a simpler and shorter proof of a combinatorial theorem proved by\nF S Macaulay\nin\n1927\n. The author also added new versions of some of the most relevant applications of this theorem to the theory of polynomial ideals and the\nHilbert\ncharacteristic function.\nIn winter\n1929\n-\n30\nSperner gave his first lecture course 'Analytic geometry and algebra II' at the University of Hamburg.\nOtto Schreier\n, who was only\n28\nyears old, died in June\n1929\n. He had planned to publish his lectures as a book but had not made any progress on that project before his death. Sperner now took over the project, and decided to publish Schreier's lectures with his own contributions added. \"Einführung in die analytische Geometrie und Algebra. I\" appeared in print in\n1931\n.\nHenry George Forder\nbegins his review\n[\n4\n]\n:-\nSchreier\nintended eventually to publish his Hamburg lectures on analytical geometry and algebra in book form; and after his premature death in\n1929\nthese were completed and edited by his pupil Sperner. Three-quarters of the present first volume discuss the analytical geometry of\nn\nn\nn\ndimensions and the relevant algebra in a unified way; no special knowledge is assumed, but considerable demands are often made on the attention of the reader. The first chapter deals with affine space and linear equations. ... Chapter two,\n[\nis\n]\non Euclidean space and\ndeterminant\ntheory ... The second part,\n[\nis\n]\non the theory of fields ...\nSperner\nhabilitated\nat Hamburg in the summer of\n1932\nafter submitting his major work\nÜber die fixpunktfreien Abbildungen der ebene\nⓉ\n(\nOn the fixed-point-free images of the plane\n)\n. At this stage Sperner was only\n26\nyears old and considered too young to be taken seriously as a university professor so, in August\n1932\nimmediately after habilitating, he travelled to Peking in China taking a route via North America and Japan. He went at the invitation of the China Foundation for the Promotion of Education and Culture and, arriving in September\n1932\n, he became a visiting professor at the National University of Peking. He taught in Peking until\n1934\n, having some outstanding students such as\nShiing-shen Chern\nand Ky Fan\n(1914\n-\n2010)\n. In\n1934\nhe married Annemarie Voss, who was a student at the University of Hamburg. He was appointed as an ordinary professor at the University of Königsberg on\n1\nNovember\n1934\n. The position had become vacant since\nKurt Reidemeister\nwho had been appointed to the chair in\n1927\nhad been forced out by the Nazis in\n1933\nas \"politically unsound\". In\n1935\nSperner published \"Einführung in die Analytische Geometrie und Algebra II\".\nHenry George Forder\nwrites in\n[\n5\n]\n:-\nThis final volume contains an introduction to the theory of\n(\nfinite\n)\nmatrices, which has already been published separately and is now out of print, together with a treatment of\nn\nn\nn\n-dimensional analytic geometry from the projective, affine and metric points of view, as far as the classification of quadrics.\nBefore continuing to describe Sperner's career, let us move forward to the English translations of these books.\nIntroduction to Modern Algebra and Matrix Theory\nby\nSchreier\nand Sperner was published in\n1951\n.\nKurt Hirsch\nwrites\n[\n6\n]\n:-\n'Einführung in die Algebra und Analytische Geometrie' has for many years been a favourite text-book for first year undergraduates in German universities. One of its unique features is the simultaneous treatment of fundamental concepts in algebra and in affine and projective geometry. The present skilful English translation has incorporated the \"Vorlesungen über Matrizen\"\n(\nas in the German second edition\n)\n, but has omitted the long final chapter on projective geometry in\nn\nn\nn\ndimensions. The result is that the accent is much more on the algebraic developments than in the original and that the geometry serves more as illustration than as motivation. This is also expressed in the changed title from which the reference to geometry has disappeared. ... Apart from this change of emphasis the book has preserved its carefully didactic character. The thorough explanations of concepts, the meticulous statements of assumptions, the elegance of treatment\n(\nwhich is not always brief, but always lucid\n)\ndeserve the highest praise.\nT C Holyoke, also reviewing this English translation, writes:-\nThis outstanding book forms a good introduction to some of the topics and methods of modern algebra, and appears to be well suited for use as a text in a course of that nature. The treatment of the subject matter is concrete, and frequent geometric illustrations and motivations are given.\nIn\n1961\nthe omitted material on projective geometry was translated into English and published as\nProjective Geometry of n Dimensions\n. J W Archbold writes\n[\n2\n]\n:-\nThe reviewer feels that it is a great pity, as regards the teaching of projective geometry, that the present book has taken so long to appear. Indeed it arrives at a period when the projective geometry in undergraduate courses is being whittled down in favour of vector space theory. If it had appeared sooner this book would have done much to make projective geometry more attractive.\nWe return to our description of Sperner's life and career. In\n1940\n, while in Königsberg, his wife died from a blood disorder following the birth of their daughter. Now Friedrich Bachmann was appointed to lecture at the University of Königsberg in the summer of\n1941\n. He writes in\n[\n3\n]\nabout the advice he received from Sperner:-\nSperner, who had a natural teaching talent himself, advised me to keep giving easy-to-understand lectures, but to increase the difficulty of the exercises and he handed me a collection sufficiently hard problems.\nOf course, by this time World War II was disrupting normal life throughout Europe. From the spring of\n1942\n, Sperner worked as an assistant in the Navy's Weather Service. He married his second wife, Antonie Schwörer, in Biberach an der Riss; their two sons Emanuel Sperner Jr and Peter Sperner both became mathematicians. While still undertaking this war work in\n1943\n, Sperner accepted an appointment as a professor at Strassburg. He began teaching there but in the autumn of\n1944\nAllied troops approached the city and the university was closed. A request was submitted to transfer Sperner to the University of Hamburg where, not only were there staff shortages, but he had contacts with the naval observatory there though his war work. However, he was released from his war work with the Navy and assigned to undertake work at the Mathematics Institute at Oberwolfach.\nWilhelm Süss\nwas the director of the Oberwolfach Institute and Sperner was appointed as deputy director. Together with\nSüss\n, he must be considered as one of the founders of the Oberwolfach Mathematics Research Institute. In\n1946\nSperner became a guest professor at the University of Freiburg but continued to work at Oberwolfach. The war years had disrupted Sperner's publication record and the first paper he published following the war was\nDie Ordnungsfunktionen einer Geometrie\nⓉ\n(\nThe regulatory function of a geometry\n)\n(1948)\n. In the paper, Sperner, who gives his address as Oberwolfach, writes:-\nI lectured on this subject for the first time in November\n1943\nin Bucharest and Timișoara.\nLeonard M Blumenthal, reviewing this paper, writes:-\nThe author introduces the concept of an order-function for the purpose of making geometric order relations amenable to algebraic formulation and treatment.\nThis short paper only announced Sperner's ideas and in the following year he published a detailed account of his concept of an order-function, showing which betweenness and separation properties may be algebraically described.\nIn\n1949\nSperner was appointed as an ordinary professor at the University of Bonn. While at Bonn, he developed a type of generalised affine space, influenced by\nHilbert\n's 'Foundations of geometry', which was taken up by other mathematicians, particularly those in Italy. He remained at Bonn for five years before being appointed as an ordinary professor at the University of Hamburg in\n1954\n. He spent the rest of his career at Hamburg, being rector of the university from\n1963\nto\n1965\n. He retired in\n1974\nand was made professor emeritus at that time. While holding the chair at Hamburg, Sperner spent several periods as a visiting professor in a number of different institutions. He spent the year\n1961\n-\n62\nat the University of Pittsburgh in the United States, he was at the University of South Africa in Pretoria in\n1966\n, at the University of Witwatersrand in Johannesburg in\n1969\n, at the University of California at Berkeley in the United States in\n1970\nand in the same year he visited the University of Sao Paulo in  Brazil.\nSperner had a long association with the\nGerman Mathematical Society\n(\nDMV\n)\n. He joined the Society in\n1930\nand in\n1935\nhe became secretary following\nLudwig Bieberbach\n's resignation from that position.\nBieberbach\nhad published an \"open letter\" in the Jahresbericht, the journal of the Society, which was highly critical of\nHarald Bohr\nbecause he had attacked\nBieberbach\n's racist views. Towards the end of\n1935\nSperner gave up the position of secretary to become editor of the Jahresbericht, replacing\nKonrad Knopp\nwho had resigned. Sperner continued as editor until the closure of the Jahresbericht at the end of\n1943\n. He also took on the role of deputy treasurer, taking over the duties of\nHelmut Hasse\n, the treasurer, when he was on military service. He was a member of the board which, in\n1938\n, wrote to Jewish members asking them to resign. He write to the other three members of the board\n(\nHelmut Hasse\n, Conrad Müller and\nWilhelm Süss\n)\non\n28\nMarch\n1939\nlisting all remaining Jewish mathematicians who were still being sent reports of meetings of the DMV. Sperner remained a member of the\nGerman Mathematical Society\nuntil his death in\n1980\n.\nSperner was, the editors of\n[\n1\n]\nnote, one of the leading geometers of his day. They write:-\nHis group-theoretical proof of\nDesargues\n' Theorem remains a lasting, and much admired, result in absolute axiomatics; his theories of ordering functions and of weakly affine spaces are secure pieces of the discipline of the foundations of geometry.\nSperner received much recognition for his contributions. He was elected to membership of the Königsberger Gelehrten Gesellschaft, the Arbeitsgemeinschaft für Forschung des Landes Nordrhein-Westfalen, the Rheinisch-Westfälischen Akademie der Wissenschaften, and the Joachim Jungius Society of Sciences in Hamburg. In\n1958\nhe was awarded a Medal from the University of Helsinki, in\n1973\nhe was elected an honorary member of the\nHamburg Mathematical Society\n, and in\n1975\nreceived an Honorary Doctorate from the Mathematics Department of the Free University of Berlin. In\n1978\na colloquium and celebration was held to make the\n50\nth\nanniversary of his doctorate.\nThe Black Forest had always been an area that held a special attraction for Sperner and, after he retired, he built a home in Sulzburg-Laufen, near Badenweiler. He lived there until his death in\n1980\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}