{
  "nome_completo": "Emilie Norton Martin",
  "nome_curto": "Emilie Martin",
  "ano_nascimento": "1869",
  "ano_morte": "1936",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Martin_Emilie/",
  "lugar_nascimento": "Elizabeth, New Jersey, USA",
  "lugar_morte": "South Hadley, Massachusetts, USA",
  "biografia": "Emilie Martin\n's parents were Robert Wilkie Martin\n(1841\n-\n1907)\nand Mary Holmes Ford. Robert Wilkie Martin was born in Port Richmond, Philadelphia on\n14\nJune\n1841\n. His parents, Thomas Martin and Agnes Thornley, were both born in Bolton, England, and emigrated to the United States. Robert married Mary Holmes Ford in\n1868\nand they had three children: Emilie Norton Martin, the subject of this biography; Imbrie Martin\n(\nwho became Miller after her marriage\n)\n; and Collier Ford Martin\n(1873\n-\n1941)\n. Robert Martin became a prominent homeopathic surgeon in Philadelphia. An obituary states:-\nTo know him was to greatly esteem his characteristic goodness of heart and earnestness of purpose.\nCollier Ford Martin became a physician and professor of medicine in Philadelphia.\nEmilie Martin's preparation to study at college was two-fold, partly by attending Mrs E L Head's School in Germantown, Philadelphia, and partly by studying on her own. Let us note that Germantown had been a separate borough but had been incorporated into Philadelphia in\n1854\n. Mrs E L Head's School provided a way for women students to prepare for entry into Bryn Mawr College and Martin was one of a number of students taking that route. She entered Bryn Mawr College in\n1890\nand, after majoring in mathematics and Latin, she graduated with a B.A. in\n1894\n. Bryn Mawr College was quite a young institution when Martin began her studies there for it had been founded only five years earlier in\n1885\n. It was a nondenominational college although founded by the Quaker Joseph Taylor on Quaker principles. The head of mathematics at Bryn Mawr College when Martin studied there was\nCharlotte Angas Scott\nwho had been a student of\nArthur Cayley\nin Girton College, University of Cambridge. She became the first head of mathematics at Bryn Mawr College and immediately gave the College a strong reputation in that subject. One must not think that because Bryn Mawr College was a women's institution that all the professors were women. In fact when\nScott\nwas appointed she was one of only two women professors among the seven appointed. In\n1893\n, while she was a student at Bryn Mawr College, Martin started to act as a private tutor in mathematics and Latin. She would continue to do this to support herself over the following ten years.\nBryn Mawr College was the first institution in the United States to offer higher degrees to women and, after graduating in\n1894\n, Martin spent a semester as a graduate student. During this semester she studied both mathematics and physics. She was advised by\nCharlotte Scott\nbut also helped by James Harkness\n(1864\n-\n1923)\n. Harkness, who had studied at Trinity College, University of Cambridge, was connected with Bryn Mawr College from\n1888\n, becoming a professor of mathematics there in\n1896\n. After one semester of graduate study, Martin spent the second semester of\n1894\n-\n95\nas a teacher of Latin in the Bryn Mawr School in Baltimore. In the following academic year,\n1895\n-\n96\n, she was appointed as a fellow at Bryn Mawr College and she was able to resume her research aiming at a doctorate. She continued as a graduate student in\n1896\n-\n97\nand during that year she won a Mary E Garrett European fellowship which provided her with funds for a year of study abroad.\nThis fellowship was funded by Mary Elizabeth Garrett who inherited a fortune from her father who was president of the first major American railway. Mary Garrett was friendly with Martha Carey Thomas and a group of other women all set on helping women achieve a better education. With Mary Garrett's money, they founded the Bryn Mawr School for Girls in Baltimore in\n1885\n. This was the school where Martin taught Latin. In\n1893\nMary Garrett gave substantial funds to Bryn Mawr College which funded many things including the Mary E Garrett fellowship for study and research in a European University. The fellowship was established in\n1894\nand Martin received $\n500\nwhich funded her stay during\n1897\n-\n98\nat the Göttingen University in Germany. There she attended courses by\nFelix Klein\nand\nDavid Hilbert\n. We note that Martha Carey Thomas, mentioned above, was president of Bryn Mawr College from\n1894\nto\n1922\n.\nAfter her year at Göttingen, Martin returned to Bryn Mawr College where she was appointed as a fellow by courtesy in mathematics for\n1898\n-\n99\n. In\n1899\nshe submitted her thesis\nOn the Imprimitive Substitution Groups of Degree Fifteen and the Primitive Substitution Groups of Degree Eighteen\nto Bryn Mawr College for the degree of Ph.D. She had presented an abstract of her thesis to the\n1899\nsummer  meeting of the\nAmerican Mathematical Society\nbut she did not submit the thesis for publication until January\n1901\n. Rather surprisingly, there is no mention of her thesis nor acknowledgement of any assistance from those at Bryn Mawr or at Göttingen in the paper. The Introduction to the paper is as follows:-\nThe following work is, with some slight modifications, the same as that of which an abstract was presented at the summer meeting of the\nAmerican Mathematical Society\nin\n1899\n. With regard to the imprimitive groups of degree fifteen, which form the subject matter of the first part of this paper, it should be stated that I have added two new groups to the list as originally presented, namely, the groups with five systems of imprimitivity simply isomorphic to the alternating and symmetric groups of degree\n5\n, and that Dr Kuhn reported at the February meeting of the Society,\n1900\n, that he had carried the investigation further, adding\n28\nto the\n70\ngroups that I succeeded in finding. In the second part of this paper the determination of the primitive groups of degree\n18\ndepends to a great extent upon the lists of transitive groups of lower degrees already determined. Any new discovery of groups of degree less than\n18\nwould necessitate an examination of such groups to determine whether they can be combined with others in such a way as to generate a primitive group of degree\n18\n. This list, therefore, cannot claim to be absolutely complete, since omissions are always possible.\nAlthough there is no acknowledgement of the help Martin received from\nCharlotte Scott\nin the paper, we know that she certainly did greatly appreciate this help and she endowed a book fund at Bryn Mawr to acknowledge her \"appreciation for the guidance of\nCharlotte Scott\n.\"\nAfter submitting her thesis in\n1899\n, Martin took a teaching position in Misses Kirk's School in Rosemont, Pennsylvania, where she spent a year.\nIn\n1899\nshe was one of the first women to join the\nAmerican Mathematical Society\n. See\nTHIS LINK\n.\nShe spent the academic year\n1901\n-\n02\nundertaking postgraduate work at Bryn Mawr, then in\n1903\nshe was appointed as an instructor in mathematics at Mount Holyoke College. This institution was one of the first in the United States to offer higher education for women. It had been founded as Mount Holyoke Female Seminary by Mary Lyon in\n1837\n. Martin taught there until the end of the first semester of\n1904\n-\n05\n. She had requested leave of absence for the second semester of that academic year which she spent constructing the general index to the first thirteen volumes of the\nAmerican Mathematical Society\n's\nBulletin\n. Martin spent\n1906\n-\n07\nundertaking postdoctoral study at Bryn Mawr before returning to her position as an instructor in mathematics at Mount Holyoke College. She was promoted to associate professor in\n1911\nand we learn much about her ideas concerning the teaching of mathematics to women in her article\nDiscussions: Relating to Required Mathematics for Women Students\nwhich she published in\nAmer. Math. Monthly\n24\n(8)\n(1917)\n,\n394\n-\n398\n:-\nMy belief is that in spite of her school training, however thorough, the student needs some college mathematics if she is to have an education that will send her out into life with the best general equipment. Mathematics as taught in college is viewed from an angle different from that used in the schoolroom. This statement does not apply to solid geometry which is only an extension of the plane geometry of the school, and which we hope some day to see put back in its proper place in connection with plane geometry. Take, however, college algebra and trigonometry. Both of these subjects make use of material in the way of ideas and methods that the student has already worked with in school, but this material is handled in a very different way. In her algebra the schoolgirl is concerned almost entirely with processes. She needs but little theory. This little is sometimes explained to her, sometimes she has to remember and reproduce it; but even in the latter case the average student seems to have acquired little grasp of the underlying principles. The consequence is that almost every college freshman has a definite idea of logical reasoning as connected with the subject of geometry, but has little idea of it in connection with any other part of mathematics. ...\nWith the two apparently contradictory tendencies at present noticeable - one, to minimize for women even in the science courses in college the necessity of any mathematical training beyond that of the high school course; the other, to encourage these same students to place more and more emphasis upon their work in science, especially in the line of laboratory research, - it is evident that the majority of women workers in science will soon be forced to limit themselves to those fields in science that can be cultivated by means of the very simplest mathematical tools. These fields may be wide and they may be fertile, but by permitting this limitation women are denying to themselves the equality of opportunity with men that has been won for them at such a cost by the pioneers in the struggle for the right of women to share in the higher education.\nMartin published\nSome varieties of space\nin\nThe Mathematics Teacher\n16\n(8)\n(1923)\n,\n470\n-\n480\n. We give a brief extract:-\nThe purpose of this paper is to make a rapid survey some of the more important varieties of space. Of necessity only the most striking of the simpler properties can be brought out, and any theorems given will be stated without proof. ... First let us consider space as Euclidean geometry has interpreted it to us. ... in Euclidean space one line and only one can be drawn through a point so as to be parallel to a given line. From this property of Euclidean space we have the various theorems about parallels cut by transversals, the theorem that the sum of the angles of a triangle is a straight angle, the construction of similar triangles, and so on. The two non-Euclidean geometries that are to be discussed here arose when geometers first followed to their logical conclusions the hypotheses that through a point more than one line could be drawn parallel to a given line, and that through a point no line could be drawn parallel to a given line. The first gave rise to hyperbolic geometry, the second to elliptic geometry. ... In each of the types of geometry so far considered - Euclidean, hyperbolic, elliptic - there appears in the formulas of their trigonometry and analytical geometry a constant that differentiates the space in which it appears from the others. This \"space constant\" is imaginary for elliptic space, positive for hyperbolic space, and infinite for Euclidean space. Various tests have been suggested for discovering the space constant of the space we live in. Most of the methods depend upon measurements of some kind, and so are subject to error. More over most of the tests suggested depend themselves implicitly if not explicitly upon the assumption that the geometry of our world is Euclidean. There is small wonder that at present we can only say that some measurements indicate that our space constant is very large and positive, while other theories indicate that we live in an elliptic space. So far there is no rigorous test.\nMartin was promoted to full professor in\n1925\nand took on the role of Chairman of the Mathematics Department in\n1927\n. In\n1934\nshe was told by her doctors that she had cancer. She resigned her professorship at Mount Holyoke College in September\n1935\nand she was made professor emeritus at this time. She died in her accommodation on the Mount Holyoke College campus in February of the following year. The\nBryn Mawr Alumnae Bulletin\nreported her death\n[\n2\n]\n:-\nIn losing Miss Martin, the students and faculty of the college have lost a stimulating and delightful friend. ... As an influential member of the faculty, Miss Martin was vigorous and wise in her judgment, never passive, and never satisfied with the second-rate. The college has reason to give thanks for Miss Martin's long and valuable service as teacher, as head of an important department, as member of many student and faculty groups. Those who knew at first hand her friendship will never forget their gratitude.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}