{
  "nome_completo": "Emilio Cafaro",
  "nome_curto": "Emilio Cafaro",
  "ano_nascimento": "1952",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cafaro/",
  "lugar_nascimento": "Lecce, Italy",
  "lugar_morte": "Turin, Italy",
  "biografia": "Emilio Cafaro\n's parents were Antonio and Giovanna Cafaro. Emilio Cafaro graduated in Physics at Pisa and then in Nuclear Engineering at the Politecnico di Torino in\n1980\n. He continued to undertake research at the Polytechnic in Turin for his doctorate and, in\n1988\n, before being awarded a Ph.D., he was appointed as a Postgraduate Researcher at the\nVon Karman\nInstitute in Brussels. He graduated with a PhD in Energetics from the Politecnico in Turin in\n1989\n.\nCafaro began publishing in\n1984\nwhen, in collaboration with N Bellomo and G Rizzi, he published\nOn the mathematical modelling of physical systems by ordinary differential stochastic equations\n. A review of this paper states:-\nThis very interesting paper considers some physical systems in mechanics and relativistic mechanics modelled by stochastic differential equations\n(\nequations with random coefficients as well as initial conditions\n)\n.\nFor more details from this review and for abstracts of a few of Cafaro's other papers, see\nTHIS LINK\n.\nBy the time Cafaro received his Ph.D. in\n1989\nhe already had twelve publications. For a list of Cafaro's publications compiled by Umberto Lucia, see\nTHIS LINK\n.\nOn\n7\nNovember\n1990\nhe was appointed as an Assistant professor of Engineering Thermodynamics at the Politecnico di Torino and then, at the same University, as an Associate Professor of Engineering Thermodynamics in\n1991\n.\nCafaro married Fiammetta Volterri on\n30\nMarch\n1993\n; they had one daughter.\nA tragic fire took place in the Mont Blanc tunnel on the morning of\n24\nMarch\n1999\nwhen a Belgium lorry caught fire in the tunnel. Smoke rapidly filled the tunnel and, although some cars which had entered the tunnel managed to escape, many were trapped. A feature which severely hampered rescue attempts was that cars and fire engines could not drive through the tunnel to or from the scene of the fire because the fumes from the fire meant there was insufficient oxygen in the tunnel for their engines to operate. Cafaro was an expert on thermo fluid dynamics and had studied many aspects of fires. For example, he had written the paper\nDynamical modelling of fires in buildings\n(1995)\n. He was one of the panel of experts who studied the tragic Mont Blanc tunnel fire. For information about Cafaro's work on fires in enclosed spaces see the Abstract and the excerpt from the Introduction to his paper\nDeterministic-stochastic approach to compartment fire modelling\n(2009)\n. You can see this at\nTHIS LINK\n.\nThe following information about Emilio Cafaro come from Umberto Lucia\n[\n2\n]\n.\nHe taught Heat transfer\n(1994\n-\n2002)\n, Environmental fluid-dynamics\n(2001\n-\n2002)\n, Renewable Energy\n(2002\n-\n2003)\n, Combustion systems\n(2003\n-\n2004)\n, Turbulent fluid numerical models\n(\nPhD course,\n1998\n-\n99)\nand, recently, Fire Safety Engineering. He was head of the Combustion Laboratory of the Energy Department at the Politecnico di Torino. We can see from his list of publications that many of his papers were presented to conferences around the world. He was the scientific chairman of the\n70\nth\nEurotherm Seminar \"Physical and Mathematical Modelling of Fires in Enclosures and Fire Protection\" in Turin on\n7\n-\n10\nOctober\n2002\n. His areas of research included:\n(1)\nNon equilibrium thermodynamics;\n(2)\nEnergy analysis and optimization;\n(3)\nMathematical modelling in pollution analysis related to energy power; and\n(4)\nNumerical and analytical thermo-fluid-dynamics.\nHe developed the scientific support to the Istituto Superiore Antincendi of the Ministero dell'Interno, ANAS board on the Mont Blanc tunnel fire, etc. He made research visits to Princeton University in the USA, University of Maryland in the USA, Imperial College in London, and the École Normale Supérieure in Paris. He was a very original scientist, able to solve any of the problems he met.\nAmong Cafaro's interests outside science, we mention his love of music. He was an able pianist but his interest in music also led to an interest in computer generated music. He died at the age of\n62\nand his funeral was held in the Temple Crematorium of Turin on Wednesday\n1\nApril\n2015\n.\nThe newspaper report of his death in\nTorino Today\nstates\n[\n3\n]\n:-\nProfessor Emilio Cafaro, a professor of industrial engineering and information, died at age\n62\n. His death has affected much the Turin university structure as Cafaro was known both for his collaborations with the Ministry of Infrastructure and for his studies carried out with researchers in the field of fire\n(\nhe also collaborated with the Corpo dei Vigili del Fuoco\n)\n. Cafaro Emilio leaves his wife and a daughter.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Statistics"
  ]
}