{
  "nome_completo": "Ennio  De Giorgi",
  "nome_curto": "Ennio De Giorgi",
  "ano_nascimento": "1928",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Giorgi/",
  "lugar_nascimento": "Lecce, Puglia, Italy",
  "lugar_morte": "Pisa, Italy",
  "biografia": "Ennio De Giorgi\n's mother was Stefania Scopinich, whose family came from Lussino. His father, Nicholas De Giorgi, was a teacher whose interests included the Arabic language, history and geography. He had a sister Rose and a brother Mario. Sadly Ennio's father died in\n1930\n, and after this Stefania did a wonderful job of bringing up her family. Ennio attended the \"G Palmieri\" high school in his home town and showed exceptional talents. However. initially, his interests were not directed towards mathematics\n[\n3\n]\n:-\n... as a child I had a special taste for puzzling out solutions to little problems, but I also had a certain passion for experimenting with little gadgets - experiments, if not of physics, of \"pre-physics'\".\nAfter graduating from secondary school in\n1946\nand obtaining his liceo, he travelled to Rome to enter the University there but, given his interests in gadgets, it was the Faculty of Engineering that he entered with the intention of taking a degree in engineering. Despite his decision of the topic to study, De Giorgi had already discoved while at school the joy of finding proofs of mathematical theorems which were different from those written in the textbooks. This is certainly an early indication of his love of research.\nAfter one year of study he decided that mathematics, and not engineering, was the subject for him\n[\n3\n]\n:-\nIn those days the courses of study in mathematics, engineering, and physics were the same for the first two years. It was in that first year that I realized that my natural aptitude was, above all, in mathematics.\nIn mathematics he studied with Mauro Picone who influenced him strongly\n[\n3\n]\n:-\n... at the Institute for Mathematics in Rome I studied with and received my degree from Professor Picone, who was, as an academic, faithful to the style of those days, that of the so-called \"Baron\", but who, in discussions of scientific problems, was completely open. I remember that while I was still a student, he said, \"Mind that when we speak of scientific problems you are completely free to tell me that I am mistaken, because we are equal in front of science.\" So he was extremely liberal in scientific dialog but fully respectful of the discipline and the academic customs of the day. For these reasons Picone became one of the great teachers and had many very diverse students, like Fichera,\nCaccioppoli\n, and many others, with greatly differing personalities and interests, even in mathematics. Everyone was attracted to Picone because of his accessibility, his interest in all problems, whether those which he personally had studied and resolved or those which interested whoever came to speak with him.\nDe Giorgi completed his undergraduate studies in\n1950\nwhen he was awarded his laurea. He then began research work at the\nCastelnuovo\nInstitute of Rome where he was an assistant to Mauro Picone.\nJacques-Louis Lions\nand François Murat write in\n[\n7\n]\n(\nsee also\n[\n6\n]\n)\n:-\nProfessor and student were indeed an odd match: the former, a classicist, dressed with rigour and elegance; the latter, unorthodox, already wearing his strange beret. But M Picone, a seasoned observer of the development of science, knew how to spot talent; he soon acknowledged E De Giorgi's exceptional abilities. The assistant was freed from all constraints and worked as he pleased at his own leisurely but, in the end, frightfully efficient rhythm.\nDe Giorgi attended lectures by\nCaccioppoli\non geometric\nmeasure theory\n, but already by this time he had his own ideas about how to attack problems of minimal surfaces. Influenced by methods which\nCaccioppoli\nhad developed, De Giorgi went on to develop new techniques in geometric measure theory and he applied his results to the calculus of variations proving his regularity theorem for almost all minimal surfaces.\nIn\n1955\nDe Giorgi gave an important example which showed nonuniqueness for solutions of the Cauchy problem for partial differential equations of parabolic type whose coefficents satisfy certain regularity conditions. In the following year he proved what has become known as \"De Giorgi's Theorem\" concerning the Hölder continuity of solutions of elliptic partial differential equations of second order. These results were similar to those proved by\nNash\nat about the same time. De Giorgi said\n[\n3\n]\n:-\nNash and I proved the same theorem, or, rather, two theorems very close to each other. From the theorem of\nNash\none can deduce more or less immediately my theorem, following a quite different line of proof. Thus, from my experiences, the discovery of a theorem can be made by different people, as if it were there waiting for someone to uncover it, and the statement of the theorem is always the same. However, the invented proof can vary greatly according to the mathematician who finds it.\nIn\n1958\nDe Giorgi was appointed to the Chair of Mathematical Analysis at the University of Messina and he took up the appointment in December of that year. He held this post for less than a year, however, for he was approached by\nAlessandro Faedo\nwho persuaded him to move to the Scuola Normale Superiore at Pisa. In the autumn of\n1959\nDe Giorgi moved to Pisa to take up the Chair of Mathematical Analysis\n[\n7\n]\n:-\nFor almost forty years, he lived there, taught there, and was a constant source of inspiration for the mathematical school that he founded. Always cheerful, always available, he enjoyed long debates with his students during which he would toss out original ideas and propose conjectures, or sketching the lines of a proof.\nA full description of De Giorgi's mathematical work is given in\n[\n1\n]\nas is a list of his\n149\npublications. The authors of this paper are all students of De Giorgi and they describe his contributions to geometric measure theory, the solution of\nHilbert\n's XIXth problem in any dimension, the solution of the\nn\nn\nn\n-dimensional\nPlateau\nproblem, the solution of the\nn\nn\nn\n-dimensional Bernstein problem, some results on partial differential equations in Gevrey spaces, convergence problems for functionals and operators, free boundary problems, semicontinuity and relaxation problems, minimum problems with free discontinuity set, and motion by mean curvature.\nDe Giorgi received many honours for his outstanding mathematical contributions including the\nCaccioppoli\nPrize in\n1960\n, the National Prize of\nAccademia dei Lincei\nfrom the President of the Italian Republic in\n1973\n, and the Wolf Prize from the President of the Israel Republic in\n1990\n. He was also awarded Honoris Causa degrees in Mathematics from the University of Paris in\n1983\nat a ceremony at the Sorbonne and in Philosophy from the University of Lecce in\n1992\n. He was elected to many academies including: the\nAccademia dei Lincei\n, the\nPontifical Academy of Sciences\n, the\nAcademy of Sciences of Turin\n, the Lombard Institute of Science and Letters, the\nAcadémie des Sciences\nin Paris, and the\nNational Academy of Sciences\nof the United States.\nWe should not end this biography without mentioning other aspects of De Giorgi's live. He was a very religious man and often spoke of his beliefs in connection to mathematics. In particular he believed that the power of mathematics to describe the world lay in religion\n[\n3\n]\n:-\nFor me the most suggestive indicator is in the Book of Proverbs, one of the most ancient books of the Bible, which at a certain point says that wisdom\n(\nwhich is wider than mathematics\n)\nwas with God when He created the world and that this wisdom is to be found by men who search for it and adore it. Mathematics is one of the most significant manifestations of the love of wisdom.\nThere is another aspect of De Giorgi's life that we should mention. He was a passionate advocate of human rights and he expressed this by his active work with Amnesty International\n[\n3\n]\n:-\n... there is the beautiful article\n(\nof the declaration of human rights\n)\nabout the school which recommends not only tolerance but also understanding and friendship between the various nations and the various religious groups. These, comprehension and friendship, are two notions which are often forgotten when one talks of tolerance. Pure and sentimental tolerance is insufficient; only when united with understanding and friendship does it truly allow human activity to progress. In particular, the sciences cannot move forward without understanding and friendship among all scientists.\nWe should recount the way that he put his beliefs into practice. In\n1966\nGiovanni Prodi\nasked him to help with teaching at the university in Asmara, the capital of Eritrea, which was run by Italian nuns. He accepted with enthusiasm, and taught there for one month in each year until\n1973\n.\nFrom\n1988\nDe Giorgi began to experience health problems. He returned every summer after this to his home town of Lecce, in southern Italy, to be with his brother and sister and their families. In September\n1996\nhe was taken to hospital in Pisa where he died following an operation.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}