{
  "nome_completo": "Enrico Bompiani",
  "nome_curto": "Enrico Bompiani",
  "ano_nascimento": "1889",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bompiani/",
  "lugar_nascimento": "Rome, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Enrico Bompiani\n's parents were Arturo Bompiani, a leading expert in medicine, and Domenica Gaifani. Arturo was an obstetrician who edited\nIl Bollettino trimestrale del R Istituto Ostetrico-ginecologico\nⓉ\n(\nThe Quarterly Bulletin of the Royal Obstetrics and Gynecological Institute\n)\n. Enrico had three brothers: Gaetano Bompiani was born in\n1887\nand became a medical professor at Sassari, Bari, Siena, Parma, Pisa, Padua and Rome; Arturo Bompiani was born in\n1890\nand also studied medicine, publishing important works on anatomy and obstetric physiology; Paolo Bompiani was born in\n1891\n. Despite this family tradition of studying medicine, Bompiani decided that he wanted to go down a different path and study mathematics.\nAt La Sapienza University of Rome, Bompiani was advised by\nGuido Castelnuovo\nwho, in\n1909\n, suggested to him that he look at a line geometry interpretation in projective\n4\n-space of\nEugène Cosserat\n's results on systems of circles in\n3\n-space. After undertaking research on this topic, Bompiani was awarded his laurea in\n1910\nfor his thesis\nSpazio rigato a quattro dimensioni e spazio cerchiato ordinario\nⓉ\n(\nFour-dimensional space and ordinary circular space\n)\n. He had defended his thesis on\n5\nJuly\n1910\n. Although he continued to work on mathematics over the next years, this was made much more difficult with the military duties that he was required to perform. After completing his laurea he was called up for military service and served for the year\n1910\n-\n11\n.\nIn\n1911\nhe was appointed as\nCastelnuovo\n's assistant at the University of Rome, the appointment being for two years. However, this was interrupted when he was called for military duty during the Italian-Turkish war which broke out when Italy invaded Libya in October\n1911\n. This invasion did not go as smoothly as the Italians had hoped and in May\n1912\n, to put pressure on the Ottomans, Italy invaded Rhodes and the Dodecanese. In August\n1912\nBompiani was called up to support the Italian war but, despite this, he was able to attend the International Congress of Mathematicians in Cambridge, England,\n22\nAugust to\n28\nAugust\n1912\n, where he delivered the paper\nRecenti progressi nella geometria proiettiva differenziali degli iperspazi\nⓉ\n(\nRecent advances in differential projective geometry of hyperspace\n)\n. The peace treaty before the end of\n1912\nallowed Bompiani to return to his assistantship in Rome.\nCastelnuovo\ncommunicated Bompiani's results to\nCorrado Segre\nin Turin who praised them but also reported that he had submitted a paper with related results and that his student\nAlessandro Terracini\nwas undertaking research in the same area. This was to start a long collaboration between Bompiani and the Turin school. Towards the end of Bompiani's two years in Rome he was released from his duties so that he could spend some time at Göttingen. On\n16\nOctober\n1913\nhe took up a position at the University of Pavia as an assistant to\nFrancesco Gerbaldi\n.\nCastelnuovo\nhad greatly appreciated Bompiani as we can see from the report he wrote to the Faculty at Rome\n(\nsee for example\n[\n8\n]\n)\n:-\nProfessor\nCastelnuovo\nreports to the Faculty that his assistant Dr Bompiani is leaving Rome for Pavia, where he has been offered a better position. Professor\nCastelnuovo\nexpresses his regret at loosing the assistance of his young collaborator who showed, during the two-year assistantship, excellent qualities both as a researcher and as a teacher. Bompiani, thanks to the conscientious way he carried out his duties and to his special aptitude for teaching, contributed greatly to the preparation of his students.\nHowever, Bompiani did not have such a good experience as\nGerbaldi\n's assistant. This is not surprising if one considers the description of\nGerbaldi\nby Renato Calapso, the son of\nGerbaldi\n's assistant Pasquale Calapso\n[\n7\n]\n:-\nShort and bitter, like February, dark face, closed and sullen, always unhappy,\nGerbaldi\nappeared to me \"like a dark night.\" ... My father, who was his assistant for eight long years, was terrified of him, because, in truth, he was a kind of torturer.\nGerbaldi\nhad been unhappy to leave Sicily for Pavia where he did little mathematics which only made Bompiani's time as his assistant even more difficult. To illustrate these difficulties we note that\nGerbaldi\ninsisted that his assistants teach no theory to students, only check their exercises. In\n1914\nBompiani was appointed as a\nlibero docente\nin Pavia, meaning that he could give lectures without being supervised by a professor.\nAlthough Italy had a treaty with Germany and Austro-Hungary, they did not enter the war when it broke out in August\n1914\n. The Allies tried to persuade Italy to join them and, due to the long rivalry between Italy and Austro-Hungary, Italy declared war on Austro-Hungary on\n23\nMay\n1915\n. From that time until October\n1919\nBompiani was periodically called for military duty, serving in various roles including work on aeronautics and fighting on the front. When not undertaking military duties, he was in Rome where he had been appointed in December\n1915\nagain as\nCastelnuovo\n's assistant. Despite the interruptions to his academic career, Bompiani maintained a remarkable research output and by the time he was fully released from military duties towards the end of\n1919\nhe already had over\n30\npapers published.\nFor a list of Bompiani's publications, see\nTHIS LINK\n.\nHis military duties having ended, Bompiani returned to full-time duties as\nCastelnuovo\n's assistant in Rome. He continued in this position until\n1923\nby which time he had the offer of two possible chairs. The first was at the University of Modena. In October\n1922\nFederigo Enriques\ninformed\nCastelnuovo\nthat Bompiani had won the competition for an extraordinary professorship in projective and analytic geometry at the University of Modena.\nCastelnuovo\nclearly did not want to lose Bompiani but nevertheless his advice to Bompiani that a better opportunity would come up soon was certainly made in Bompiani's best interests. Perhaps he already knew that Bompiani was likely to be offered a professorship at the Higher Technical Institute in Milan and indeed in November\n1922\nhe was offered the position of professor of analytic, projective and descriptive geometry. The Institute at Milan said that Bompiani had:-\n... been given the best possible recommendations both as a teacher and as a scholar devoted to the science of geometry.\nBompiani now had two positions on offer, although any appointment required the approval of the Minister of Education. In December Bompiani wrote to the Minister saying he would accept the professorship in Modena but, if the Minister agreed, he would prefer Milan. Indeed the position in Milan was formalised and he took up the position at the beginning of\n1923\n. However, he only stayed a year in Milan for other opportunities arose. He was offered a chair at the School of Architecture in Rome and, although this was a less prestigious position, nevertheless it would have brought him back to Rome where he longed to be. Before he had made a final decision on accepting the School of Architecture chair, he was offered a chair of projective and descriptive geometry at Bologna which had become vacant since\nFederigo Enriques\nhad just left Bologna to take up a chair in La Sapienza University of Rome. The Faculty of Science at Bologna had agreed to appoint him at a meeting on\n23\nOctober\n1923\nwhen they made the following assessment\n(\nsee for example\n[\n8\n]\n)\n:-\nProfessor Enrico Bompiani, an extraordinary professor at the Higher Technical Institute in Milan, is well known to mathematicians for several important papers in the geometric area, mainly in the area of modern projective-differential geometry. Because of his scientific skills, which also has been recently recognized in several ways, one of which being his first appointment, and because of his well known teaching skills, the Faculty unanimously proposes to appoint him to the chair of Projective and Descriptive Geometry in our University.\nThis position looked very attractive, not least since\nEnriques\nhad gone from Bologna to Rome, so it seemed the right stepping stone for Bompiani in his quest for a chair at the University of Rome. However, shortly after accepting the Bologna chair, his life was complicated by the University of Milan making him a financially tempting offer of a chair there. He wondered about accepting Milan and sought\nCastelnuovo\n's advice.\nCastelnuovo\nreplied that to be in a strong position for a chair in Rome he should not keep moving from one place to the next. Bompiani took this advice and, after his appointment in\n1923\n, spent the next three years in Bologna.\nIn\n1923\n-\n24\nBompiani taught Riemannian geometry and absolute differential calculus at Bologna and, in the following year, first order differential equations. His publications during these years was remarkable with\n19\npapers appearing in print in\n1923\n-\n25\n. For the titles of these papers, see\nTHIS LINK\n.\nBompiani's appointment to Bologna was to an extraordinary chair and he had the right to seek an ordinary professorship after three years. A committee consisting of\nEugenio Bertini\n,\nGino Loria\nand\nFederigo Enriques\nwas set up to determine if he merited the promotion. Their report states\n(\nsee for example\n[\n8\n]\n)\n:-\n... above all one has to comment about his collection of papers on classical projective differential geometry, which, in the last few years, following a fundamental memoir by\nFubini\n, achieved results which are of real important for science. However, the approach of the distinguished mathematician from Turin is purely analytical, and Bompiani deserves the credit for having brought about its geometric understanding. He has thus contributed in an essential way to the construction of the new theory. ... for the whole collection of his papers, for their lucidity as well as for their breadth, for the importance of some of his results, for the varieties of tools and the quality of the exposition, Bompiani has by now attained a position of honour among geometers of the young Italian school.\nIn the following year,\n1927\n, Bompiani achieved his aim of returning to Rome. This was not without difficulties since he competed against mathematicians of the quality of\nLeonida Tonelli\n,\nGuido Fubini\nand\nUgo Amaldi\n. However, Bompiani was strongly supported by\nCastelnuovo\nwho put forward the following support\n(\nsee for example\n[\n8\n]\n)\n:-\nEnrico Bompiani, ordinary professor of Projective and Descriptive Geometry at the University of Bologna, developed over the last fifteen years, with a strong commitment and strenuous work, a coherent research project on various topics of metric and projective differential geometry, following the viewpoint of\nMonge\n, the founder of descriptive geometry. Bompiani's value is universally well known, his teaching ability makes clear why our faculty decided to propose him for the vacant chair of Descriptive Geometry, which is a part of the discipline taught by him in Bologna.\nHis application was helped since by this time his work had been recognised with several prizes including the mathematical prize of the Besso Foundation in\n1923\nand the gold medal from the\nNational Academy of Sciences of Italy\nin\n1926\n. Bompiani was appointed to La Sapienza University of Rome and so achieved the aim he had worked towards for years. However by this time Italy was under Fascist rule and this would play a large role in Bompiani's activities over the next years.\nThe Italian Fascist Party had been founded by Mussolini in October\n1921\nand in the following year he became prime minister after near civil war in the country. Over the next years elections were abolished, free speech was prevented, and opposition parties and unions were disbanded. The Fascist government reorganised the Italian National Research Council and in\n1927\nset up the National Committee for Mathematics as a part of the reorganised Research Council. Bompiani was appointed secretary of the National Committee for Mathematics when it was formed. In July\n1930\nBompiani joined the Fascist Party. It is unclear whether he did so because he believed in what the Fascists stood for or whether he did it because he thought it would help in forwarding his career. Certainly Bompiani was keen to travel and work abroad and since this would have propaganda benefits to the Italian government, he received their encouragement. For example he was a Visiting Professor at the University of Chicago from\n1930\nto\n1934\nand he took part in the preparations for the Italian pavilion at the Chicago Century of Progress World's Fair of\n1933\n-\n1934\n.\nHe went along with the Fascist views in a number of ways. In particular he produced the document\nContributi italiani alla matematica\nⓉ\n(\nItalian contributions to mathematics\n)\nfor the Exhibition of Italian Civilization in\n1939\n. According to this document, no Jewish Italian mathematician had made any contributions to mathematics, for none were mentioned. Perhaps the most notable person to be omitted was\nCastelnuovo\n, who was Jewish, who had done so much to support Bompiani. This was in stark contrast to Bompiani's paper\nItalian contributions to modern mathematics\nwhich was published in the\nAmerican Mathematical Monthly\nin\n1930\nwhere the contributions of Jewish Italian mathematicians are described as they should be.\nThe\nItalian Mathematical Union\nwas founded in\n1922\nwith Bompiani as one of its founding members. He was elected vice-president in\n1938\nand, in the part of the Union's\nBulletin\ndated\n10\nDecember\n1939\nthere appears a declaration, signed by Bompiani and other members of the Scientific Committee, declaring the Aryan nature of Italian mathematics. This was, in our opinion, as ridiculous as\nLudwig Bieberbach\n's \"Deutsche Mathematik.\"\nFollowing the end of World War II there was an attempt to purge Italy of those who had collaborated with the Fascists. A jury, which included\nCastelnuovo\n, was set up to look at academics at the University of Rome. Bompiani was accused of propaganda activities for the Fascists, particularly in his trips abroad.\nCastelnuovo\nmade no attempt to support Bompiani against these accusations. The purge had no practical affect on Bompiani's career and he continued to hold his chair at the University of Rome until he retired in\n1964\n. However he also held visiting professorships at the Missouri University of Kansas City in\n1946\nand at the University of Pittsburgh, Pennsylvania, several times between\n1947\nand\n1961\n. He was Mellon Professor at the University of Pittsburgh in\n1959\n-\n1961\n.\nWe have already listed some awards given to Bompiani. Others honours include election to the\nAccademia dei Lincei\nin\n1935\nand the award of the Academy's Royal Prize in\n1938\n. He served as president of the\nItalian Mathematical Union\nfrom\n1949\nto\n1952\nand Secretary of the\nInternational Mathematical Union\nfrom\n1951\nto\n1954\n. In\n1972\n, on the\n50\nth anniversary of the founding of the\nItalian Mathematical Union\n, he was awarded their Gold Medal.\nHe was elected to the\nNational Academy of Sciences of Italy\nin\n1951\n. He was also elected a member of: the Academy of Sciences of the Institute of Bologna; the Academy of Romania; the Lombard Institute of Sciences, Letters and Arts; the Academy of Sciences of Turin; the Society of Sciences of Liege; the\nAustrian Academy of Sciences\n; and the\nRoyal Belgium Academy of Science\n. He was awarded an honorary degree from the universities of Groningen\n(1964)\n, Bologna\n(1966)\nand Jassy\n(1970)\n. He served on the editorial boards of many journals including\nAnnali di matematica pura ed applicata\n,\nRendiconti del Circolo matematico di Palermo\n,\nRendiconti di matematica e delle sue applicazioni\n,\nBollettino dell'Unione matematica italiana\n,\nZentralblatt für Mathematik\n,\nArchiv der Mathematik\n, and\nCompositio mathematica.\nFinally let us mention that Bompiani founded the International Mathematical Summer Centre\n(\nCIME\n)\nin\n1954\n. He remained Director from its founding until\n1974\n. The activity of the CIME, which has attracted leading international mathematicians to teach course, has been, and continues to be, a very great help and benefit to young mathematicians, both Italian and foreign.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}