{
  "nome_completo": "Enrique Aurelio Planchart Rotundo",
  "nome_curto": "Enrique Planchart",
  "ano_nascimento": "1937",
  "ano_morte": "2021",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Planchart/",
  "lugar_nascimento": "Caracas, Venezuela",
  "lugar_morte": "Caracas, Venezuela",
  "biografia": "Enrique Planchart\nwas the son of Enrique Planchart Loynaz\n(1894\n-\n1953)\nand Luisa Rotundo Blanco\n(1897\n-\n1952)\n. The Planchart family originally came from Catalonia, Spain, and it reached Venezuela when two Planchart brothers arrived there in around\n1848\n. Enrique Planchart Loynaz had studied at a school run by French fathers in Caracas, and\n1912\nhad been one of the founders of the Círculo de Bellas Artes, a group of landscape artists and writers. A poet and critic, he was later head of the Ministry of Education and of the Venezuelan National Library. Luisa Rotundo Blanco was a pianist and harpsichordist. Enrique Planchart Loynaz and his wife had two sons, Alejandro Enrique Planchart\n(1935\n-\n2019)\nand Enrique Aurelio Planchart\n(1937\n-\n2021)\n, the subject of this biography. Let us note that the Planchart family was large, loving, musical and culturally prominent. Luis Xavier Grisanti writes\n[\n11\n]\n:-\nHis uncle, the playwright and novelist, Julio Planchart, was a member of the National Academy of History and ambassador of Venezuela in Chile. The home of his grandparents, Enrique Planchart Ruiz and Soledad Loynaz, was a melting pot of culture, knowledge and Venezuelan identity.\nEnrique Planchart's elder brother, Alejandro Enrique Planchart, became one of the world's leading music scholars. He was, for many years, a professor in the Music Department of the University of California at Santa Barbara. We note here that Enrique Planchart had lost both his parents by the time he was sixteen years old.\nEnrique Planchart attended the Colegio América in the San Bernardino area of Caracas. This school, which opened in\n1939\n, had been founded by Spanish exiles and financed by the Caracas elite who wanted a secular school. At this school he had the mathematics teacher\nÁngel Palacio Gros\nwho taught him from the\n3\nrd year of his Baccalaureate.\nÁngel Palacio Gros\nwas Spanish, had fought in the Spanish Civil War for the Republicans and was taken prisoner in\n1938\nafter a defeat at the Battle of Teruel. Pressure from the Venezuelan government led to his release in\n1947\nand exile to Venezuela. Planchart writes in\n[\n16\n]\n:-\n... I was lucky of having from the\n3\nrd year of the Baccalaureate to the\n2\nnd year of the University,\nÁngel Palacio Gros\nas professor of geometry.\nIn fact the Colegio América had a strong link with the School of Physics and Mathematics in the Central University of Venezuela. This university in Caracas was founded in\n1721\nmaking it the oldest university in Venezuela and one of the oldest in the Americas.\nÁngel Palacio Gros\nbegan teaching at the Central University of Venezuela in\n1948\nbut in\n1951\nhe signed the manifesto against the revocation of the Organic Statute of National Universities and was dismissed. He returned to teaching at the Colegio América, becoming Planchart's teacher, but\nPalacio Gros\nwas reinstated to his university position so when Planchart began his studies of mathematics at the Central University of Venezuela in Caracas he continued to be taught by\nPalacio Gros\n. We note that while at university in the late\n1950\ns, Planchart met and became close friends with\nGonzalo Pérez Iribarren\n. These two shared a passion for mathematics and they became friends for life.\nThe Faculty of Science was created in the Central University of Venezuela in\n1958\nand Planchart was present at the Act of Creation. He writes\n[\n16\n]\n:-\nIt was an Academic Act of great solemnity, presided over by the Rector Francisco de Venanzi. Without a doubt, this act marks a milestone in the history of Mathematics in Venezuela, it was the first Faculty of Sciences in the country and soon the first Mathematics graduates in Venezuela would graduate.\nIn January\n1962\nRaimundo Chela\nbecame Head of the Department of Mathematics and Planchart describes being a student in the Department at this time\n[\n16\n]\n:-\n... in the cafeteria of the Faculty of Humanities, behind Engineering,\nRaimundo Chela\nshared a table with several students from the School of Mathematics: José Masón, Federico Martin and myself. We drank coffee, sometimes several, and we talked. ... After jokes, comments about music or poetry and discussing politics\n(\nalways politics for hours\n)\n, the conversation would move to Mathematics: Number Theory or Galois Theory, most of the time. Also, frequently, stories and anecdotes about famous mathematicians.\nThe Simón Bolívar University was opened in Caracas on\n19\nJanuary\n1970\n. It was developed with the aim of strengthening the economic and social state of the country and, with a high entry requirements, it has particular emphasis on sciences, mathematics, engineering, and humanities. Planchart became a a full-time contracted professor in the Department of Pure and Applied Mathematics of the University on\n1\nJanuary\n1973\n. He was Head of the Department of Mathematics and Computer Science from\n10\nOctober\n1973\nto\n31\nAugust\n1980\n.\nPlanchart spent seven years as Head of the Department of Mathematics and Computer Science at Simón Bolívar University but he had never undertaken research for a Ph.D. He decided that he wanted to study for a doctorate and went to the University of California, Berkeley, where he undertook research advised by Alan David Weinstein. Weinstein, born in New York City in\n1943\n, had been awarded a Ph.D. by the University of California, Berkeley in\n1967\nwith a thesis supervised by\nShiing-Shen Chern\n. He undertook research on differential geometry and had been a full professor since\n1976\n. Planchart was awarded a Ph.D. in\n1982\nfor his thesis\nAnalogies in Symplectic Geometry of Some Results of Cartan in Representation Theory\n. The Abstract to the thesis begins\n[\n15\n]\n:-\nE Cartan\nproves in his paper: 'Sur la détermination d'un système orthogonal complet dans un espace de Riemann symétrique clos'\nⓉ\n(\nOn the determination of a complete orthogonal system in a closed symmetric Riemann space\n)\n, that the irreducible unitary representations of the group of isometries G of a Riemannian symmetric space appearing in the space of complex square integrable functions\nU\n2\n(\nM\n)\nU_{2}(M)\nU\n2\n​\n(\nM\n)\n, are those for which the isotropy group H of a point leaves a vector fixed. He also proves that such a representation appears with multiplicity one. Given the connections between the theory of unitary representations of a\nLie\ngroup G, and the theory of Ad*-equivariant Hamiltonian actions of G, established in the work of\nA Kirillov\nand B Kostant, the question arises as to whether these theorems of\nCartan\nhave an analogue in the other theory.\nReturning to the Simón Bolívar University, Planchart became coordinator of the Bachelor and Postgraduate Degrees in Mathematics, a position he held from\n15\nMay\n1983\nto\n16\nJune\n1985\n.\nThe\n7\nth Latin American School of Mathematics was held at the Simón Bolívar University\n16\n-\n27\nJuly\n1984\n. Planchart delivered the course\nGeometría simpléctica\nⓉ\n(\nSymplectic geometry\n)\nwhich was published as a\n109\n-page book. José F Cariñena reviewed the book and writes\n[\n2\n]\n:-\nThese notes of a course given in Caracas in the\n7\nth Latin American School of Mathematics are a simple introduction to symplectic geometry which can be useful for both physicists interested in an up-to-date presentation of classical mechanics and classical field theory and mathematicians with an interest in the applications of the modern tools of differential geometry to different branches of physics. It is written at the graduate student level, and after a general introduction of the basic definitions and theorems of symplectic geometry, such as for instance the\nDarboux\n-Weinstein theorem, as well as their applications to Hamiltonian systems, the author studies symplectic actions of\nLie\ngroups and the reduction technique for systems with symmetry. Finally, the last section is devoted to developing the\nKirillov\n-Kostant-Souriau method of the orbits of the coadjoint action.\nPlanchart directed the National Centre for the Improvement of Science Teaching\n(\nCENAMEC-USB\n)\nfrom\n1989\nto\n1999\n. It is as a member of CENAMEC that he wrote the short paper\nMapas\nⓉ\n(\nMaps\n)\nin\n2004\n. The paper begins\n[\n18\n]\n:-\nMan has seen the need to represent the Earth on a flat surface, which is given the name of a geographical chart or map. The problem with making a map of the Earth, or part of it, is to construct a bijection between part of the sphere and a plane. From experience we know that this cannot be done without breaking or deforming the sphere, and here lies the mathematical richness of the problem. We have to sacrifice some property or relationship in the sphere and what we sacrifice depends on what we want to do with the map. Ideally we would like an isometric map, which preserves all distances and geometric properties. Since this is not possible, we can be content with a map that preserves geodesics\n(\na geodesic is the line that marks the shortest path between two points\n)\n. On the sphere, the geodesics are the arcs of maximum circumference; in the plane, they are the line segments. A map produced by projection from the centre of the Earth onto a tangent plane preserves the geodesics.\nAlthough his early papers were on high level mathematics, his later publications were mostly on mathematical education. Here are samples of his papers:\nGeometría simpléctica\nⓉ\n(\nSymplectic geometry\n)\n(1984)\n;\nGeometría simpléctica y sistemas hamiltonianos completamente integrables\nⓉ\n(\nSymplectic geometry and fully integrable Hamiltonian systems\n)\n(1988)\n;\nLa Geometría de los Teoremas de Conmutatividad en Variedades Poissonianas de Dimensión Infinita\nⓉ\n(\nGeometry of commutativity theorems on Poissonian manifolds of infinite dimension\n)\n(1990)\n;\nEnseñanza de la ciencia en Venezuela: un reto al futuro\nⓉ\n(\nScience education in Venezuela: a challenge for the future\n)\n(1995)\n,\nRaimundo Chela\n(2000)\n;\nPrograma Igualdad de Oportunidades-USB\nⓉ\n(\nEqual Opportunities Program-USB\n)\n(2003)\n;\nPrograma de Especialización en Didáctica de las Matemáticas en Educación Media-USB\nⓉ\n(\nSpecialization Program in Didactics of Mathematics in Secondary Education-USB\n)\n(2003)\n;\nMapas\nⓉ\n(\nMaps\n)\n(2004)\n;\nEducación matemática y formación de profesores: propuestas para Europa y Latinoamérica\nⓉ\n(\nMathematics education and teacher training: proposals for Europe and Latin America\n)\n(2005)\n; and\nLa enseñanza de la matemática en Venezuela, programa de didáctica de la Matemática para educación media\nⓉ\n(\nMathematics teaching in Venezuela, Mathematics didactics program for secondary education\n)\n(2005)\n.\nHe received awards for the high level mathematical papers he published up to\n1990\n[\n5\n]\n:-\nPlanchart's scientific work was recognised by the\nVenezuelan Academy of Physical, Mathematical and Natural Sciences\n, of which he was a Corresponding Member, as well as by the National Council for Scientific and Technological Research\n(\nConicit\n)\nwhich in\n1989\nawarded him the Prize for Best Scientific Work in Mathematics, and in\n1991\nan honourable mention for this same award.\nIn\n2000\n, Planchart played the main role in setting up the Equal Opportunities Programme\n(\nPrograma Igualdad de Oportunidades, PIO\n)\nand became its first coordinator. Alexander Bueno writes\n[\n1\n]\n:-\nThe PIO, his masterpiece as a socio-educational aid programme, has been the most important social responsibility programme in the Simón Bolívar University since its inception. This programme is born from the disproportion that the admission statistics of our university had been showing in relation to the proportion of students from public institutions admitted versus institutions from the private sector, reaching a proportion of\n96\n% of students from private institutions in the late\n1990\ns and\n4\n% from the public sector. That was the main motivation for creating the PIO.\nSoraya Villarreal explains in\n[\n19\n]\nhow Planchart built up the PIO:-\nProfessor Planchart's concern to contribute to improving education in the country originated a tour of more than\n150\nsecondary education institutions located in the states of Miranda, La Guaira and the Capital District, looking for young people who wanted to study scientific-technological careers, and formed a work team that became a family, which not only remains united, but also continues to generate change in the secondary education institutions of the official sector through this programme.\nHe continued his efforts to bring in changes to improve the way mathematics was being taught, particularly at secondary school level. He was the driving force behind the 'Specialisation in Didactics of Mathematics in Secondary Education', a postgraduate programme at the Simón Bolívar University. He wrote the paper\n[\n17\n]\nsetting out his ideas:-\nCurrently, in the teaching of Mathematics in Venezuela, one of the main problems is the deficiency in the effective application of didactics that allows guaranteeing the success of the teaching-learning processes of Mathematics. This is even more evident in the subject of geometry, which is systematically omitted despite being in the contents of the programmes of the educational levels preceding the higher one. In addition, in recent years in the field of Mathematics Education there have been vertiginous changes that have forced us to review the situation of Mathematics and its teaching at different educational levels.\nGiven this situation, it seems necessary to promote programmes that respond to the new innovative trends that have been emerging in the field of Mathematics Education, such as, among others, the impact of new technologies, modelling, new evaluation techniques, motivation, methodological changes towards the acquisition of the typical processes of mathematical thought, heuristics\n(\nproblem solving\n)\nas a tool for teaching mathematics, etc. And some trends in mathematical content: a shift towards discrete mathematics, the impact of the content of modern calculation methods, the recovery of geometric thinking and spatial intuition, the rise of random thinking, of probability and statistics.\nPlanchart was elected Rector of the Simón Bolívar University in July\n2009\nafter an election in which he stood against the electrical engineer José Ferrer, who at that time was academic vice-rector. When elected, Planchart said\n[\n5\n]\n:-\nThe University is threatened; the values of the University do not seem shared by those who administer the State in these times; they favour institutions that are not universities, that are training schools for people who are capable of carrying out specific tasks that may seem important at the moment, but who do not have, and will not have, the capacity to continue their self-training, to develop and adapt to changes in the world that are unstoppable.\n...\nthe University has to remain open, it is a enormous sacrifice for all, we know. This so-called socialist government has made the university system only for a privileged group, for those who have transportation and can eat three times a day. We will be left with fewer students and fewer teachers, but we have to continue, because the opposite would be to bury the Simón Bolívar University.\nIt was not long before the threats to the university that Planchart saw became very real indeed. The\n2010\nparliamentary election in Venezuela took place on\n26\nSeptember\n2010\n. In Venezuela the Plan República was a military deployment carried out during all electoral processes whose main purpose was to safeguard order and security during elections. In the early hours of the election day members of Plan República entered the Simón Bolívar University with long weapons, raiding the centre set up by Voto Joven, a youth group who argued for the extension of political rights to youth and the strengthening of democracy in Venezuela. The raiders had no search warrant, took away computers owned by Voto Joven, and violated the autonomy of the university.\nPlanchart was only supposed to serve as rector for a period of four years,\n2009\n-\n2013\n. The government, however, suspended elections for university rectors, so he remained in office. In\n2017\nthere was extraordinary political interference in the running of the university. Beginning in January\n2017\nthere were protests throughout Venezuela when the government arrested many opposition leaders. The academic vice-rector of the Simón Bolívar University resigned and on\n8\nJune\n2017\nthe university presented two candidates, Oscar González and Solange Issa, to the National Council of Universities to fill the position. The minister for university education, science and technology, Hugbel Roa, ignored the university's opinion and proposed Luis Holder as a candidate. On\n11\nJuly the National Council of Universities appointed Luis Holder. Planchart wrote\n[\n3\n]\n:-\nHolder has an unfortunate history at the Simón Bolívar University\n(\nhe was a professor for a term in the nineties\n)\n, his resumé shows that he has only held managerial positions, not academic ones, he has no thesis students, students or interns, he has no research activities, except for three articles of\n1994\nthat he published when he finished his doctoral thesis. He has no scientific publications, he is not an academic. We explained to the National Council of Universities the academic, not political, reasons why Holder should not be appointed, as well as the community consultation process that produced the candidacies of Óscar González and Solange Issa. They are recognised professors who have the support of the entire University, professors, students, employees and workers.\nHolder took up the appointment on\n7\nSeptember\n2017\nand Planchart announced that the University was making an appeal. The appeal failed and, despite student and staff protests, Holder continued to hold the position.\nPlanchart's health deteriorated but he made every effort to continue carrying out his duties. Luis Xavier Grisanti wrote\n[\n11\n]\n:-\nDuring the COVID-\n19\npandemic, he helped promptly deliver virtual classes. At all times, he especially supported low-income students. He survived several strokes, without neglecting his duties as rector.\nOn\n27\nJuly\n2021\n, Planchart died leaving his wife, Isbelia Martin, and his children. At a meeting on\n5\nAugust\n2021\nin Simón Bolívar University to bid farewell and honour Planchart, Benjamin Scharifker, former Rector and Professor Emeritus of the University, gave a speech in which he spoke of the rigour with which Planchart had conducted his life\n[\n19\n]\n:-\nA rigour that perhaps came from his mathematical training, but that beyond analysis and geometry gave him an extraordinary mastery of space and time to be able to develop a strategic vision that allowed him to carry out the many academic aspects he did throughout his life. A strategic thought that in the last years of his life he used for the benefit of the university, delivering his vision of the future until his last breath.\nGrisanti wrote\n[\n11\n]\n:-\nIn his messages to the university community, Rector Planchart tried to create awareness among the students about the challenges of the integral development of Venezuela in the framework of the great scientific and technological advances of Humanity and the III and IV Industrial Revolutions. Overcoming the rentier atavism of Venezuelan society was the object of his perennial concern and self-sacrificing pedagogical work. It remains for his colleagues and disciples to follow his legacy in favour of sustainable development and not rent-seeking in Venezuela. His dream of turning our country into a knowledge society in line with the most advanced nations in terms of scientific and technological development is about to come true.\nAlexander Bueno writes\n[\n1\n]\n:-\nTo speak of Professor Planchart, is to speak of a visionary, honest, ethical, responsible, good person, hardworking and very stubborn man, when something was in his head he did not stop until he achieved it. He felt love and passion for the projects he generated.\nFollowing Planchart's death, Luis Holder was appointed as rector of Simón Bolívar University. He had already acted in that capacity during times when Planchart had been too ill to carry out his duties.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}