{
  "nome_completo": "Eratosthenes of Cyrene",
  "nome_curto": "Eratosthenes",
  "ano_nascimento": "276 BC",
  "ano_morte": "194 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eratosthenes/",
  "lugar_nascimento": "Cyrene, North Africa (now Shahhat, Libya)",
  "lugar_morte": "Alexandria, Egypt",
  "biografia": "Eratosthenes\nwas born in Cyrene which is now in Libya in North Africa. His teachers included the scholar Lysanias of Cyrene and the philosopher Ariston of Chios who had studied under Zeno, the founder of the\nStoic\nschool of philosophy. Eratosthenes also studied under the poet and scholar Callimachus who had also been born in Cyrene. Eratosthenes then spent some years studying in Athens.\nThe library at Alexandria was planned by Ptolemy I Soter and the project came to fruition under his son Ptolemy II Philadelphus. The library was based on copies of the works in the library of\nAristotle\n. Ptolemy II Philadelphus appointed one of Eratosthenes' teachers Callimachus as the second librarian. When Ptolemy III Euergetes succeeded his father in\n245\nBC and he persuaded Eratosthenes to go to Alexandria as the tutor of his son Philopator. On the death of Callimachus in about\n240\nBC, Eratosthenes became the third librarian at Alexandria, in the library in a temple of the Muses called the Mouseion. The library is said to have contained hundreds of thousands of papyrus and vellum scrolls.\nDespite being a leading all-round scholar, Eratosthenes was considered to fall short of the highest rank.\nHeath\nwrites\n[\n4\n]\n:-\n[\nEratosthenes\n]\nwas, indeed, recognised by his contemporaries as a man of great distinction in all branches of knowledge, though in each subject he just fell short of the highest place. On the latter ground he was called Beta, and another nickname applied to him, Pentathlos, has the same implication, representing as it does an all-round athlete who was not the first runner or wrestler but took the second prize in these contests as well as others.\nCertainly this is a harsh nickname to give to a man whose accomplishments in many different areas are remembered today not only as historically important but, remarkably in many cases, still providing a basis for modern scientific methods.\nOne of the important works of Eratosthenes was\nPlatonicus\nwhich dealt with the mathematics which underlie\nPlato\n's philosophy. This work was heavily used by\nTheon of Smyrna\nwhen he wrote\nExpositio rerum mathematicarum\nand, although\nPlatonicus\nis now lost,\nTheon of Smyrna\ntells us that Eratosthenes' work studied the basic definitions of geometry and arithmetic, as well as covering such topics as music.\nOne rather surprising source of information concerning Eratosthenes is from a forged letter. In his commentary on Proposition\n1\nof\nArchimedes\n'\nSphere and cylinder\nBook II,\nEutocius\nreproduces a letter reputed to have been written by Eratosthenes to Ptolemy III Euergetes. The letter describes the history of the problem of the\nduplication of the cube\nand, in particular, it describes a mechanical device invented by Eratosthenes to find line segments\nx\nx\nx\nand\ny\ny\ny\nso that, for given segments\na\na\na\nand\nb\nb\nb\n,\na\n:\nx\n=\nx\n:\ny\n=\ny\n:\nb\na : x = x : y = y : b\na\n:\nx\n=\nx\n:\ny\n=\ny\n:\nb\n.\nBy the famous result of\nHippocrates\nit was known that solving the problem of finding two mean proportionals between a number and its double was equivalent to solving the problem of duplicating the cube. Although the letter is a forgery, parts of it are taken from Eratosthenes' own writing. The letter, which occupies an important place in the history of mathematics, is discussed in detail in\n[\n14\n]\n. An original Arabic text of this letter was once kept in the library of the St Joseph University in Beirut. However it has now vanished and the details given in\n[\n14\n]\ncome from photographs taken of the letter before its disappearance.\nOther details of what Eratosthenes wrote in\nPlatonicus\nare given by\nTheon of Smyrna\n. In particular he described there the history of the problem of duplicating the cube\n(\nsee\nHeath\n[\n4\n]\n)\n:-\n... when the god proclaimed to the Delians through the oracle that, in order to get rid of a plague, they should construct an alter double that of the existing one, their craftsmen fell into great perplexity in their efforts to discover how a solid could be made the double of a similar solid; they therefore went to ask\nPlato\nabout it, and he replied that the oracle meant, not that the god wanted an alter of double the size, but that he wished, in setting them the task, to shame the Greeks for their neglect of mathematics and their contempt of geometry.\nEratosthenes erected a column at Alexandria with an epigram inscribed on it relating to his own mechanical solution to the problem of doubling the cube\n[\n4\n]\n:-\nIf, good friend, thou mindest to obtain from any small cube a cube the double of it, and duly to change any solid figure into another, this is in thy power; thou canst find the measure of a fold, a pit, or the broad basin of a hollow well, by this method, that is, if thou thus catch between two rulers two means with their extreme ends converging. Do not thou seek to do the difficult business of\nArchytas\n's cylinders, or to cut the cone in the triads of\nMenaechmus\n, or to compass such a curved form of lines as is described by the god-fearing\nEudoxus\n. Nay thou couldst, on these tablets, easily find a myriad of means, beginning from a small base. Happy art thou, Ptolemy, in that, as a father the equal of his son in youthful vigour, thou hast thyself given him all that is dear to muses and Kings, and may be in the future, O Zeus, god of heaven, also receive the sceptre at thy hands. Thus may it be, and let any one who sees this offering say \"This is the gift of Eratosthenes of Cyrene\".\nEratosthenes also worked on\nprime numbers\n. He is remembered for his prime number sieve, the 'Sieve of Eratosthenes' which, in modified form, is still an important tool in\nnumber theory\nresearch. The sieve appears in the\nIntroduction to arithmetic\nby\nNicomedes\n.\nAnother book written by Eratosthenes was\nOn means\nand, although it is now lost, it is mentioned by\nPappus\nas one of the great books of geometry. In the field of geodesy, however, Eratosthenes will always be remembered for his measurements of the Earth.\nEratosthenes made a surprisingly accurate measurement of the circumference of the Earth. Details were given in his treatise\nOn the measurement of the Earth\nwhich is now lost. However, some details of these calculations appear in works by other authors such as\nCleomedes\n,\nTheon of Smyrna\nand\nStrabo\n. Eratosthenes compared the noon shadow at midsummer between Syene\n(\nnow Aswan on the Nile in Egypt\n)\nand Alexandria. He assumed that the sun was so far away that its rays were essentially parallel, and then with a knowledge of the distance between Syene and Alexandria, he gave the length of the circumference of the Earth as\n250\n,\n000\nstadia\n.\nOf course how accurate this value is depends on the length of the stadium and scholars have argued over this for a long time. The article\n[\n11\n]\ndiscusses the various values scholars have given for the stadium. It is certainly true that Eratosthenes obtained a good result, even a remarkable result if one takes\n157\n.\n2\nmetres for the stadium as some have deduced from values given by\nPliny\n. It is less good if\n166\n.\n7\nmetres was the value used by Eratosthenes as Gulbekian suggests in\n[\n11\n]\n.\nSeveral of the papers referenced, for example\n[\n10\n]\n,\n[\n15\n]\nand\n[\n16\n]\n, discuss the accuracy of Eratosthenes' result. The paper\n[\n15\n]\nis particularly interesting. In it Rawlins argues convincingly that the only measurement which Eratosthenes made himself in his calculations was the zenith distance on the summer\nsolstice\nat Alexandria, and that he obtained the value of\n7\n°\n12\n'. Rawlins argues that this is in error by\n16\n' while other data which Eratosthenes used, from unknown sources, was considerably more accurate.\nEratosthenes also measured the distance to the sun as\n804\n,\n000\n,\n000\nstadia and the distance to the Moon as\n780\n,\n000\nstadia. He computed these distances using data obtained during lunar eclipses.\nPtolemy\ntells us that Eratosthenes measured the tilt of the Earth's axis with great accuracy obtaining the value of\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nof\n180\n°, namely\n23\n°\n51\n'\n15\n\".\nThe value\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nhas fascinated historians of mathematics, for example the papers\n[\n9\n]\nand\n[\n17\n]\nare written just to examine the source of this value. Perhaps the most commonly held view is that the value\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nis due to\nPtolemy\nand not to Eratosthenes.\nHeath\n[\n4\n]\nargues that Eratosthenes used\n24\n° and that\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nof\n180\n° was a refinement due to\nPtolemy\n. Taisbak\n[\n17\n]\nagrees with attributing\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nto\nPtolemy\nalthough he believes that Eratosthenes used the value\n2\n15\n\\large\\frac{2}{15}\\normalsize\n1\n5\n2\n​\nof\n180\n°. However Rawlins\n[\n15\n]\nbelieves that a\ncontinued fraction\nmethod was used to calculate the value\n11\n83\n\\large\\frac{11}{83}\\normalsize\n8\n3\n1\n1\n​\nwhile Fowler\n[\n9\n]\nproposes that the anthyphairesis\n(\nor\nEuclidean algorithm\n)\nmethod was used\n(\nsee also\n[\n3\n]\n)\n.\nEratosthenes made many other major contributions to the progress of science. He worked out a calendar that included leap years, and he laid the foundations of a systematic chronography of the world when he tried to give the dates of literary and political events from the time of the siege of Troy. He is also said to have compiled a star catalogue containing\n675\nstars.\nEratosthenes made major contributions to geography. He sketched, quite accurately, the route of the Nile to Khartoum, showing the two Ethiopian tributaries. He also suggested that lakes were the source of the river. A study of the Nile had been made by many scholars before Eratosthenes and they had attempted to explain the rather strange behaviour of the river, but most like\nThales\nwere quite wrong in their explanations. Eratosthenes was the first to give what is essentially the correct answer when he suggested that heavy rains sometimes fell in regions near the source of the river and that these would explain the flooding lower down the river. Another contribution that Eratosthenes made to geography was his description of the region \"Eudaimon Arabia\", now the Yemen, as inhabited by four different races. The situation was somewhat more complicated than that proposed by Eratosthenes, but today the names for the races proposed by Eratosthenes, namely Minaeans, Sabaeans, Qatabanians, and Hadramites, are still used.\nEratosthenes writings include the poem\nHermes\n, inspired by astronomy, as well as literary works on the theatre and on\nethics\nwhich was a favourite topic of the Greeks. Eratosthenes is said to have became blind in old age and it has been claimed that he committed suicide by starvation.",
  "math_areas": [
    "Geometry",
    "Number Theory"
  ]
}