{
  "nome_completo": "Erich Kähler",
  "nome_curto": "Erich Kähler",
  "ano_nascimento": "1906",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kahler/",
  "lugar_nascimento": "Leipzig, Germany",
  "lugar_morte": "Wedel, near Hamburg, Germany",
  "biografia": "Erich Kähler\n's father Ernst Kähler was a telegraph inspector but had spent\n12\nyears in the Navy as an oboist. Erich's mother was Elsa Götsch. Erich attended school in Leipzig. At first he was inspired by books his mother bought him about Sven Hedin, a Swedish explorer who led a series of expeditions through Central Asia and as a consequence made important archaeological and geographical findings. After wanting to to follow Hedin and be an explorer, Erich developed an interest in astronomy which by about the age of\n12\ndeveloped into a love for mathematics. When he was about to start his final year at high school it was clear that he already knew so much mathematics he would not profit from the mathematics lessons. The principal of the high school, a Mr Donat, had taken university mathematics courses by\nWeierstrass\nand still had his lecture notes. He gave these to Kähler who, through studying them, learnt about the work of\nGauss\nand about elliptic and abelian functions.\nKähler, while still at school, had the idea of writing a doctoral thesis on fractional differentiation. He wrote a\n50\npage thesis which he submitted to\nHölder\n, asking if it would earn him a doctorate. He received the reply that most universities would make today, namely that one has to pursue a course of study before qualifying for a doctorate. He entered the University of Leipzig in\n1924\nand took a course on\nGalois theory\nin his first semester. He also read works by\nGauss\n,\nAbel\n,\nWeierstrass\n,\nRiemann\n,\nLagrange\nand got to know\nArtin\npersonally. In addition to mathematics, he took courses on astronomy and physics. His thesis advisor was\nLeon Lichtenstein\nbut Kähler chose himself the topic for his doctoral dissertation\nÜber die Existenz von Gleichgewichtsfiguren, die sich aus gewissen Lösungen des n-Körperproblems ableiten\nⓉ\n(\nOn the existence of equilibrium figures which are derived from certain solutions of the  n-body problem\n)\n)\n. He was awarded a doctorate in\n1928\n. He continued to study at Leipzig after the award of his doctorate, supported by fellowship from the Notgemeinschaft der Deutschen Wissenschaften.\nIn the summer of\n1929\nhe was an assistant at the University of Königsberg. However, a meeting with\nArtin\nin Hamburg led to him being offered a position of assistant to\nBlaschke\nwhich he took up after completing his summer in Königsberg. He submitted his\nhabilitation\nthesis on the integrals of algebraic differential equations to Hamburg in\n1930\nand became a\nPrivatdozent\n.\nBlaschke\nwas very impressed with his assistant and, in\n1931\n, gave him a strong recommendation for a professorship at the University of Rostock. However Kähler found Hamburg an exciting and inspiring mathematical environment, so chose to remain there. The award of a Rockefeller fellowship enabled him to spend the academic year\n1931\n-\n32\nin Italy where he studied with\nEnriques\n,\nCastelnuovo\n,\nLevi-Civita\n,\nSeveri\n, and\nBeniamino Segre\n.\nIn\n1932\nKähler published\nÜber eine bemerkenswerte Hermitesche Metrik\nⓉ\n(\nOver a remarkable Hermitian metric\n)\nin which he introduced the notion of what today are called Kähler metrics. This paper was the starting point for Kähler geometry with its notions of Kähler manifolds and Kähler groups which are today fundamental ideas in string theory and the study of space-time. In\n1934\nChern\ncame to Hamburg. He writes in\n[\n7\n]\n:-\nI arrived in Hamburg in the summer of\n1934\n. The University began in November and I attended, among other classes, Kähler's seminar on exterior differential systems. He had just published his booklet entitled Einführung in die Theorie der Systeme von Differentialgleichungen, which gives a treatment of the theory developed by\nÉlie Cartan\n.\n[\nFor my thesis I\n]\nreceived much advice from Kähler, from whom I learned the subject of exterior differential calculus and what is now known as the Cartan-Kähler theory. We had frequent lunches together at the restaurant Curio Haus near the Seminar. He told me many things, mathematical or otherwise. My gratitude to him cannot be overstated.\nKähler went to the University of Königsberg in\n1935\nand he was appointed an ordinary professor in the following year. His interests now moved towards mathematical physics and he lectured on the way that mathematics, physics and astronomy are related. In\n1938\nhe married Luise Günther; they had a son Helmuth\n(\nborn\n1939)\n, a daughter Gisela\n(\nborn\n1942)\n, and a son Reinhard\n(\nborn\n1948)\n. Reinhard\n[\n2\n]\n:-\n... was handicapped and thus the more beloved by parents and siblings.\nWith the outbreak of World War II in\n1939\nKähler was called up - his son Helmuth was two weeks old when the call-up papers arrived. In a way he was pleased to serve in the Navy since he was not then required to become involved in Nazi activities. The war then saw a break in his mathematical activities. Towards the end of the war he was stationed in Saint-Nazaire on the Loire River estuary, which was occupied by the Germans, who used the port as a major Atlantic submarine base. He was taken prisoner and put in the French prisoner of war camp on the Ile de Ré, in the Bay of Biscay. From there he was taken to another camp at Mulsanne near Le Mans. In fact it was a time when he was able to return to his mathematics since he had many friends among the French mathematicians who saw that he was allowed books and sent mathematics papers and books that he requested.\nAfter he was released in\n1947\nhe became a lecturer at Hamburg and was reunited with his family after the long forced separation. In\n1948\nhe was appointed to the chair of mathematics at the University of Leipzig. The chair had been vacant following Paul\nKoebe\n's death in\n1945\n. Berndt and Bohm write\n[\n2\n]\n:-\nIn retrospect the time in Leipzig was the most fruitful scientific period of Erich Kähler's life. ...\n[\nHe\n]\ngave a five semester course with sometimes more than\n10\nhours of classes per week, in which he expostulated on algebra, algebraic geometry, function theory and arithmetic. The results presented in this course were then published in\n1958\nin a\n399\npages volume of Annali di Matematica under the title \"Geometria Aritmetica\"\nⓉ\n(\nGeometric arithmetic\n)\n.\nHowever, Kähler's friend\nAndré Weil\nreviews the work in a somewhat more critical way:-\nThis, in more ways than one, is an unusual piece of work. By its size, it is a book; it appears as a volume in a journal. The author is German; the book appears in Italian. The subject combines algebra and geometry, with some arithmetical flavouring; but the author, instead of following in his terminology the accepted usage in either one of those subjects, or adapting it to his purposes, has chosen to borrow his vocabulary from philosophy, so that rings, homomorphisms, factor-rings, ideals, complete local rings appear as \"objects\", \"perceptions\", \"subjects\", \"perspectives\", \"individualities\". The book includes altogether new material along with much which turns out to be quite familiar\n(\nsometimes to the point of triteness\n)\nonce it is translated back into more familiar language; but no attempt is made to point out what may be novel and what is not so; there are no historical or bibliographical indications, no \"Leitfaden\", no introduction apart from a two-page philosophical discourse which ends up with the following statement: \"... bibliographical references would probably have obscured the fact that a single philosophical tendency has been the real motive power behind the chain of my reasonings.\"\nDuring his time in Leipzig, Kähler became increasingly unhappy with the East German government so when he had the opportunity to go to the Technical University of Berlin in\n1958\nhe was quick to take it.\nArtin\ndied at the end of\n1962\nand in\n1964\nKähler was offered the vacant chair at Hamburg. He held this chair until he retired in\n1974\n. These years in Hamburg were ones of great personal tragedy. His son Reinhard died in a rafting accident in August\n1966\n. Kähler's wife became ill with leukaemia and died in\n1970\n[\n2\n]\n:-\nNow in view of his personal suffering, his need became even stronger to find a connection of mathematics to chemistry, biology and even to theology and the ingenious mathematician became a mathematical dreamer who thought he could solve all problems of this world by mathematical methods.\nHe did, however, find some personal happiness when he married Charlotte Schulze in\n1972\n. She was the widow of his brother who had died near the end of the war.\nTypical of his attempts to bring mathematics and philosophy together is the paper\nAlso sprach Ariadne\n(1992)\n.  Doru Stefanescu writes:-\nThe author considers various mathematical interpretations of some philosophical texts. He especially dwells on the theory of monades of Leibniz and on the work \"Also sprach Zarathustra\" of F Nietzsche. His speculative considerations are illustrated by suggestive examples from set theory, mathematical logic, abstract algebra and differential, algebraic and analytic geometry. He considers basic philosophic concepts such as Sein, Schein, monades, transcendental perception, pure reason, Sehkraft, and mathematical objects such as equivalence relations, polynomials, projections. The main thesis of the paper is that\nalgebraic geometry\nis a prolegomenon to a mathematical theory of monades.\nAmong other contributions after he retired, we mention two further works. In\nThe Poincaré group\n(1986)\nKähler defines a new\nPoincaré\ngroup using the theory of\nquaternions\nand puts forward the hypothesis that a general theory of matter must be founded on this new\nPoincaré\ngroup. In\nRaum-Zeit-Individuum\nⓉ\n(\nSpace-time-individual\n)\n(1992)\nKähler attempts to reformulate the\nLorentz\nmetric of space-time relativity physics in order to rid it of the purely imaginary time variable.\nKähler received many honours. He was elected as an honorary member of the Hamburg Mathematical Society in\n1976\n. He was elected to a number of academies: the Academy of Sciences of Saxony\n(1949)\n, the\nBerlin Academy of Science\n(1955)\n, the\nGerman Academy of Scientists Leopoldina\n(1957)\n, the\nAccademia dei Lincei\n(1957)\n, and the Accademia di Scienze e Lettere Milano\n(1992)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}