{
  "nome_completo": "Ernest Corominas i Vigneaux",
  "nome_curto": "Ernest Corominas",
  "ano_nascimento": "1913",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Corominas/",
  "lugar_nascimento": "Barcelona, Spain",
  "lugar_morte": "Lyon, France",
  "biografia": "Ernest Corominas i Vigneaux\n's father was Pere Corominas i Montanya\n(1870\n-\n1939)\n, a writer, economist, prominent leftist intellectual and Republican politician. Ernest's mother was Celestina Vigneaux i Cibils\n(1878\n-\n1964)\n, a teacher and educationalist who introduced the Montessori method into Catalan schools. Pere and Celestina Corominas were married in\n1902\nand the first of their eight children, Joan Coromines, was born on\n21\nMarch\n1905\n. Joan\n(\nin English John\n)\nbecame a famous Catalan linguist and the author of the etymological dictionary of the Spanish language\nDiccionario crítico etimológico de la lengua castellana\nⓉ\n(\nCritical etymological dictionary of the Castillian language\n)\n. He was a Guggenheim Fellow in Linguistics in\n1945\n,\n1948\n, and\n1957\n. Ernest had an older sister, Júlia Coromines Vigneaux who was born in\n1910\n. She became a famous Catalan physician and psychoanalyst.\nErnest Corominas was brought up in Barcelona where he entered the University of Barcelona. There he studied architecture and mathematics and graduated in\n1936\n. Spain was plunged into a civil war in July\n1936\n, close to the time that Corominas graduated. The war began with a military coup against the left-wing Popular Front government which had been elected near the beginning of\n1936\n. This coup did not achieve a quick success and the country was split between the Republicans, who were loyal to the left-wing democratically elected government, and the Nationalist led by the fascist General Francisco Franco. Given that we have already said that Corominas's father was a left-wing Republican politician, it will come as no surprise to learn that Corominas joined the Republican army. He served as a military engineering officer.  Although the Spanish Civil War is known as a civil war, in fact the Nationalist side was supported by both Germany and Italy who supplied both air power and troops. The war raged on with the Republicans slowly losing territory and by the middle of\n1938\nthey held two areas which were not connected. One of these was around Barcelona where Corominas was part of the Republican defenders when the Nationalists launched an all out assault late in December\n1938\n. The campaign was fought in January and February\n1939\nwith Corominas ordered to destroy bridges to ensure that the remnants of the Republican army could escape. By February\n1939\nCorominas, together with many of his fellow soldiers and civilian refugees, had escaped to France. The journey had been horrific in extremely harsh winter weather.\nCorominas was now one of around\n500\n,\n000\nSpanish refugees in France but they were not welcomed there, especially the Republican soldiers. Quite quickly he realised that the whole of Europe was about to be engulfed in war. His experiences in Spain had been horrific and he felt that there was no way he could go though an experience like that all over again. France was keen to see the refugees sent back to Spain but they also negotiated with Mexico, Chile and the Dominican Republic who were prepared to accept Spanish Republican refugees. Various organisations helped provide funding to allow the refugees to be sent on ships to America. Corominas sailed for Chile on the SS Winnipeg from Port Trompeloup Pauillac, north of Bordeaux, on\n4\nAugust\n1939\n.\nThe left-wing Chilean poet Pablo Neruda had held diplomatic posts in Barcelona and Madrid before moving to France during the time of the Spanish Civil War. He had been appointed by the Chilean President as special consul for Spanish emigrants in Paris. Neruda organised the conversion of the SS Winnipeg from being a cargo ship to carry over\n2000\nrefugees. He also played a role in selecting refugees for the journey. With Corominas and fellow Republican soldiers on board, the SS Winnipeg sailed through the Panama Canal and at that time they learnt of the Molotov-Ribbentrop Pact between Germany and the Soviet Union made on\n23\nAugust. The fact that this Pact agreed a division of Poland between these two powers was not public knowledge at this time. On\n1\nSeptember\n1939\nGermany invaded Poland and on\n3\nSeptember Britain and France declared war on Germany. On this same day the SS Winnipeg arrived in Valparaíso and, on the following day the refugees were welcomed by Salvador Allende on behalf of the Chilean authorities.\nCorominas had not had a chance to take up employment due to the Spanish Civil War. He had a degree in architecture and mathematics so, once in Chile, he began working as an architect. After six months he moved to Buenos Aires in Argentina. The Spanish mathematician\nJulio Rey Pastor\nhad been teaching at the University of Buenos Aires since\n1921\nbut had returned to Europe on a number of occasions. He had been in Barcelona when Corominas was studying at the University and they had met at this time.\nRey Pastor\noffered Corominas the position of Assistant in Mathematics at the University of Buenos Aires. This was quite a bold move since Corominas had not had the opportunity to study mathematics any further after graduating with his first degree. However, strongly encouraged by\nRey Pastor\n, Corominas spent a year at the University of Buenos Aires making good use of the library there to read advanced mathematical texts. In\n1941\nhe was appointed as Full Professor of Mathematics in the Institute of Economics at Mendoza, and there he taught financial mathematics. Although still in Argentina, being in Mendoza meant he was now back to being close to Santiago in Chile where he had worked as an architect.\nCorominas now began to undertake research in mathematics and publish his results. In\n1945\nhe published\nDifferential properties of continuous functions which lack angular points\n(\nSpanish\n)\nwhich was reviewed by\nR P Boas Jr\nwho writes:-\nThe author observes that many of the classical properties of derivatives can be generalized to the\nDini\nderivatives of continuous functions which need not be differentiable but have no corners, a corner being a point at which the upper derivative on one side is less than the lower derivative on the other side. For example, the law of the mean holds for one\n(\nat least\n)\nof the two derivatives on either side. One\n(\nat least\n)\nof the derivatives on either side takes all values between its upper and lower bounds. Any of the derivatives omits at most a countable number of values between its upper and lower bounds; at most two derivatives, one from each side, one upper and one lower, can omit even one value.\nContinuing to work on generalised derivatives, Corominas published\nOn Peano's generalized derivatives\n(\nSpanish\n)\nin\n1946\nwhich improves on results obtained by\nArnaud Denjoy\non\nPeano\nderivatives.\nWhile living in Mendoza, Corominas met Maria Edith Guevara, the cousin of Ernesto \"Che\" Guevara, who later became a revolutionary and friend of Fidel Castro. Corominas married Maria Edith Guevara in Mendoza in\n1946\n; they later had three children, Edith, Henri, and Helene who were all born in Paris.\nJuan Perón became president of Argentina on\n4\nJune\n1946\n. Despite a need for highly qualified teaching staff in the universities, Peron then fired more than\n1\n,\n500\nuniversity staff who opposed him. Corominas was dismissed from his position but\nArnaud Denjoy\n, who had been impressed by Corominas's papers, offered him a position at the Centre National de la Recherche Scientifique in Paris in\n1947\n. There he undertook research, continuing the path he had begun in Argentina with advice from\nRey Pastor\n, but now advised by Denjoy who was also interested in the same questions. Soon after beginning research in France he obtained results which he published in\nSur un théorème de M Denjoy\nⓉ\n(\nOn a theorem of M Denjoy\n)\n(1948)\n. He was awarded his doctorate in\n1952\nfrom the University of Paris for his thesis which contained two parts, the first part on generalised derivatives and the second part on asymptotic properties of polynomials. He published the first part in\n1953\nunder the title\nContribution à la théorie de la dérivation d'ordre supérieur\nⓉ\n(\nContribution to the theory of higher order derivation\n)\n. He described how he came to undertake the work in the introduction:-\nThe following problem, which was put to me by Mr\nJ Rey Pastor\n, is at the origin of my research. Is it possible to extend to the derivatives of higher order or differential quotients, the classical theorems on the formal derivation of series? This problem quickly led me to a more general one. Is it possible to extend to differential quotients the fundamental theorems of the Differential Calculus, that is to say, the theorems of\nRolle\n, finite increment, etc. I answer this in the affirmative, by uniformly applying a process of proof, from which one can produce all the theorems which are the basis of the Differential Calculus. These theorems and their applications constitute the first part of this thesis. These questions were all the more interesting since Mr\nA Denjoy\nhad already shown interest in the study of differential quotients. He gave them substance by solving, among other questions, the three fundamental problems raised by any generalization of the notion of derivative, namely: establishing links with classical derivatives; proving that they determine their primitives and finally giving a total calculus, allowing us to go back from the derivative to its primitive.\nLater in the paper Corominas also expressed his appreciation of the support he had received from various of the Paris mathematicians:-\nI would like to take this opportunity to express my admiration for the brilliant and profound work of M\nArnaud Denjoy\n, from whom I have drawn so much inspiration and which is at the origin of this field of research which contains such great riches. I especially want to show my appreciation of the honour he has given me by allowing me to participate in the mathematical activity of Paris. May I be permitted to express my affectionate gratitude to M\nGustave Choquet\n, who has constantly offered me friendly advice. Finally, I would like to thank\nPaul Dubreil\n, who has done me the honour of being a member of the Jury.\nThe second part of his thesis was not published until\n1960\n-\n61\nwhen it appeared as the two papers\nAlgèbre asymptotique\nⓉ\n(\nAsymptotic algebra\n)\n(1960\n,\n1961)\n. Evelyn Frank writes in a review:-\nThis is a study of the asymptotic properties of polynomials\np\ni\n(\nx\n)\np_{i}(x)\np\ni\n​\n(\nx\n)\nof bounded degree. The values of\nx\n(\ni\n)\nx(i)\nx\n(\ni\n)\nsatisfy certain conditions of regularity, and in general the problems are concerned with sequences i satisfying all the conditions of regularity.\nThe Consejo Superior de Investigaciones Científicas\n(\nCSIC\n)\n, a similar body to the French Centre National de la Recherche Scientifique\n(\nCNRS\n)\n, was set up following the Spanish Civil War. It followed the principles of the Franco regime, was politicised and emphasised applied research.\nRey Pastor\n, despite his attempts to stay out of politics, was expelled from Argentina in\n1952\n. He was the leading Spanish mathematician so there was a move to attract him back to Spain to work at the CSIC with the offer of a good salary.\nRey Pastor\nhoped that a position at CSIC would mean he could lead Spanish mathematics so accepted this role. He invited Corominas to join him at the CSIC so, in\n1952\n, Corominas returned to Barcelona taking up a position at the CSIC. Once settled into his new position Corominas produced a remarkable result published in two joint papers with\nFerran Sunyer i Balaguer\n.\nSunyer\nwas a Spanish mathematician who was confined to a wheelchair for his whole life. He sent some of his work to Paris but published mostly in Spanish. Corominas and\nSunyer\nproduced the wonderful result:-\nIf f\n(\nx\n)\nis infinitely differentiable, and some derivative\n(\nof order depending on x\n)\nvanishes at each x, then f\n(\nx\n)\nis a polynomial.\nThey announced this result, and other related results, in\nSur des conditions pour qu'une fonction infiniment dérivable soit un polynome\nⓉ\n(\nOn conditions for an infinitely differentiable function to be a polynomial\n)\nbut the full proof appears in the Spanish paper\nConditions for an infinitely differentiable function to be a polynomial\n. Both papers were published in\n1954\n.\nCorominas hoped that he would be able to set up a research school in Barcelona but, despite\nRey Pastor\n's best efforts, he only ever had temporary appointments which were badly-paid. We know that the CSIC was politicised and Corominas, with his Republican military background and family connections, must have been discriminated against. In\n1953\nhe was awarded a Guggenheim Fellowship. He was able to travel to the United States, leaving his family in Spain, and spent the time from February\n1955\nto January\n1956\nat the Institute for Advanced Study at Princeton. In\n1956\n, back in Barcelona, he lectured on ordered sets, a topic in which he had become interested while at the Institute for Advanced Study. However, his position at the CSIC left him very disappointed and, in\n1960\n, he decided to emigrate to Caracas in Venezuela. Leaving in September\n1960\nhe wrote a farewell letter to\nFerran Sunyer i Balaguer\n[\n3\n]\n:-\nSo we won't see each other again, before my departure. But it seems to me not to matter. Our friendship is deep, by temperament and affinity. It was a paradox that we found each other in such a rarefied milieu and become connected scientifically in such a rich way when that is difficult even in contexts of high culture.\nAfter civil riots had forced the Venezuelan dictator Marcos Evangelista Pérez Jiménez been to leave the country in\n1958\n, new laws had come into place establishing that university staff and students could work in an environment of freedom and tolerance. Hopeful that this would give him the right atmosphere for teaching and research, Corominas had accepted a position at the Central University of Venezuela in Caracas. However, Caracas did not provide Corominas with the peace he looked for to devote himself to mathematics. In late\n1960\n, pro-Castro students rioted and clashed with police on the streets of Caracas and took refuge in the University. There was a military siege of the Central University where Corominas was working. The insurgency continued throughout\n1961\nand in September\n1962\nthere were bombings in Caracas. Corominas had no fellow mathematicians interested in the topics that he studied so, when he was offered a professorship at the Claude Bernard University of Lyon in France in\n1964\nhe was happy to accept.  This appointment proved the most successful of his career. He became a French citizen in\n1966\nand continued to hold this chair in Lyon until he retired in\n1982\n. Several of his students went on to university posts. Maurice Pouzet, one of these students, writes\n[\n6\n]\n:-\nHis students and all who knew him well, remember his quiet confidence, his encouraging demeanor, and his delight at whatever scientific progress and success occurred around him.\nHis work during this period was concerned with ordered sets and\np\np\np\n-primary abelian groups. In\n1971\nhe published two papers:\nSur une application de l'algèbre ordinale à la théorie des groupes abéliens de torsion\nⓉ\n(\nOn an application of ordinal algebra to the theory of torsional abelian groups\n)\n; and\nApplication de l'algèbre ordinale aux groupes abéliens de torsion\nⓉ\n(\nApplication of ordinal algebra to torsional abelian groups\n)\n. In\n1973\n, in collaboration with his students Robert Bonnet and Maurice Pouzet, he published\nSimplification pour la multiplication ordinale\nⓉ\n(\nSimplification for ordinal multiplication\n)\n. His last paper, published in\n1990\n, was\nSur les ensembles ordonnés projectifs et la propriété du point fixe\nⓉ\n(\nOn projective ordered sets and the fixed-point property\n)\n. He gives the following summary of this paper:-\nWe introduce a concept of projectivity for ordered sets. We show that our projective ordered sets are irreducible with respect to products and retracts. We present two hypotheses closely connected to the fixed point property. Among examples of projective ordered sets supporting these hypotheses are crowns, superpositions of crowns, truncated Boolean lattices, and ramified and connected posets of height\n2\n.\nRetirement certainly did not stop Corominas continuing to attend seminars and conferences. For example he attended the\n1991\nconference 'Algebras and Orders' in Montreal, Canada. He continued to participate in the Ordinal Algebra Seminar in Lyon, attending as usual on Thursday\n23\nJanuary\n1992\n. He suffered a stroke shortly after the seminar and died on the following day.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}