{
  "nome_completo": "Ernesto Cesàro",
  "nome_curto": "Ernesto Cesàro",
  "ano_nascimento": "1859",
  "ano_morte": "1906",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cesaro/",
  "lugar_nascimento": "Naples, Kingdom of the Two Sicilies (now Italy)",
  "lugar_morte": "Torre Annunziata, Italy",
  "biografia": "Ernesto Cesàro\n's father was Luigi Cesàro and his mother was Fortunata Nunziante who was Luigi's second wife. Luigi was a farmer in Torre Annunziata who also sold his produce in a shop. He was a forward looking man being one of the first farmers in Italy to use machinery to improve production on his farm. In\n1860\n, the year after Ernesto was born, there was a revolution led by Giuseppe Garibaldi aimed at achieving Italian unification. In fact on\n17\nMarch\n1861\n, almost exactly two years after Ernesto's birth, the Kingdom of Italy was formally created. Luigi Cesàro strongly supported the move towards Italian unification but this was not an easy time for farmers in Italy\n(\nnor for many others\n)\nand Ernesto grew up difficult financial circumstances.\nThe newly created country of Italy suffered many problems but it also had a new confidence in education from which Cesàro benefited in his early years. He studied at the\nGymnasium\nin Naples for a year but after completing the first class he went to a seminary in Nola where he studied for two years. Returning to the Gymnasium in Naples he completed another year there graduating from the fourth class in\n1872\n. His elder brother Guiseppe had been in Liège since\n1867\n. In\n1873\nCesàro's father sent him to join Guiseppe who was by that time a lecturer in mineralogy and crystallography at the École des Mines in Liège. Cesàro entered the École des Mines as a student but, preferring to study in Italy, made application for a university place there. His applications were unsuccessful so he had to remain at the École in Liège where he studied mathematics with\nCatalan\n.\nCesàro returned to Torre Annunziata in Italy for a number of years after the death of his father in\n1879\n. Back in Italy he married Angelina, who was a close relation. The death of Cesàro's father had given the family even more financial problems than they had before, but eventually Cesàro won a scholarship to allow him to study further at Liège and in\n1882\nhe returned to Belgium to continue his studies.\nCatalan\nhelped him to publish his first mathematical paper\nSur diverses questions d'arithmétique\nⓉ\n(\nOn various  arithmetical problems\n)\nwhich was published in\n1883\n.\nSur diverses questions d'arithmétique\nⓉ\n(\nOn various  arithmetical problems\n)\nwas the first of a series which Cesàro wrote on the\ntheory of numbers\n. Nine further papers by him on this topic appeared by\n1885\n. They looked at problems concerning\n[\n1\n]\n:-\n... the number of common divisors of two numerals, determination of the values of the sum totals of their squares, the probability of incommensurability of three arbitrary numbers, and so on; to these he attempted to apply obtained results in the theory of\nFourier series\n.\nCesàro visited Paris during the period of his studies at Liège and there he attended lectures by\nHermite\n,\nDarboux\n,\nSerret\nBriot\n,\nBouquet\nand\nChasles\nat the Sorbonne.\nHermite\nin particular was interested in the results which Cesàro had obtained and he quoted these in his own work of\n1883\n. Cesàro was particularly interested in lectures he attended given by\nDarboux\non geometry and this led him to make his own studies of intrinsic geometry along similar lines. Back in Liège after the trip to Paris, Cesàro fell out with one of the professors there and left for Italy without completing his studies.\nHe had always wanted to study in Italy and now at last he was given the opportunity. Supported by\nCremona\n,\nBattaglini\nand\nDini\n, he was awarded a scholarship to allow him to undertake research at the University of Rome which he entered in\n1884\n. Over the next two years wrote eighty works on\n[\n1\n]\n:-\n... infinite arithmetics, isobaric problems,\nholomorphic\nfunctions,\ntheory of probability\n, and, particularly, intrinsic geometry.\nOne might have thought that this remarkable record of productivity would have been sufficient to gain him his doctorate but he had to wait for a further year before this was awarded in\n1887\n. By this time he already had a post, having won a competition for a chair at the Lycée Terenzio Mamiani in Rome. After one month at the Lycée Terenzio Mamiani, however, Cesàro was offered the chair of mathematics at Palermo and Cremona advised him to accept it. He remained at Palermo until\n1891\n, moving then to Naples where he held the chair of mathematical analysis until his death.\nCesàro's main contribution was to\ndifferential geometry\n. Influenced by\nDarboux\nwhile in Paris he formulated 'intrinsic geometry'. This is his most important contribution which he described in\nLezione di geometria intrinseca\nⓉ\n(\nLecture on intrinsic geometry\n)\n(\nNaples,\n1896)\n. He made excellent use of an idea due to\nDarboux\nwhich adopted a special coordinate system which applied to curves. At a variable point on the curve the coordinates consisted of the tangent to the curve, the principal normal and the binormal. The\nLezione di geometria intrinseca\ncontains descriptions of curves which today are named after Cesàro. He later extended his methods to study the\nKoch\ncurves which are continuous everywhere but nowhere differentiable.\nThe\nLezione di geometria intrinseca\nⓉ\n(\nLecture on intrinsic geometry\n)\nalso deals with surfaces and\nn\nn\nn\n-dimensional spaces. Cesàro later pointed out that in fact his geometry did not use the parallel axiom so constituted a study of\nnon-euclidean geometry\n.\nIn addition to differential geometry Cesàro worked on many topics such as number theory where, in addition to the topics we mentioned above, he studied the distribution of primes trying to improve on results obtained in this area by\nChebyshev\n. He also contributed to the study of divergent series, a topic which interested him early in his career, and we should note that in his work on mathematical physics he was a staunch follower of\nMaxwell\n. This helped to spread\nMaxwell\n's ideas to the Continent which was important since, although it it hard to realise this now, it took a long time for scientists to realise the importance of his theories.\nCesàro's interest in mathematical physics is also evident in two very successful calculus texts which he wrote. He then went on to write further texts on mathematical physics, completing one on elasticity. Two further works, one on the mathematical theory of heat and the other on hydrodynamics, were in preparation at the time of his death.\nCesàro died in tragic circumstances. His seventeen year old son went swimming in the sea near Torre Annunziata and got into difficulties in rough water. Cesàro went to rescue his son but sustained injuries which led to his death.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}