{
  "nome_completo": "Ernst Leonard Lindelöf",
  "nome_curto": "Ernst Lindelöf",
  "ano_nascimento": "1870",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lindelof/",
  "lugar_nascimento": "Helsingfors, Russian Empire (now Helsinki, Finland)",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Ernst Lindelöf\n's father Leonard Lorenz Lindelöf was professor of mathematics in Helsingfors from\n1857\nto\n1874\n. Helsingfors, today Helsinki, was controlled by Sweden and Russia at various times in its history. Finland had been ceded to Russia in\n1809\n. At the time that time Lindelöf's father was appointed professor of mathematics at the university, the main building of the university on Senate Square had recently been completed. Helsingfors was a town of only\n20\n,\n000\nat this time and under Russian control. By the time that Lindelöf went to study mathematics at Helsingfors University in\n1887\nhis father was no longer the professor there. The city was still under Russian control but it had undergone a rapid expansion and by then had a population of\n60\n,\n000\n.\nLindelöf spent the year\n1891\nin Stockholm, and the years\n1893\n-\n94\nin Paris returning to Helsingfors where he graduated in\n1895\n. He then taught there as a\ndocent\n, visiting Göttingen in\n1901\n. He returned to Helsingfors where he became assistant professor in\n1902\n, becoming a full professor the following year. Helsinki was still under Russian control and indeed the Russians had implemented a policy of Russification in reply to the national movements which had arisen. By\n1904\nthe rapidly growing city had a population of\n111\n,\n000\nand was the centre of activists working for an independent Finland. This was proclaimed in\n1917\n.\nLindelöf remained as professor of mathematics in Helsinki until he retired in\n1938\n. It was a time of rapid economic growth for the new country and the university flourished and rapidly expanded. Lindelöf supported his new country undertaking his university duties with great enthusiasm. From\n1907\nhe served on the editorial board of\nActa Mathematica\n.\nLindelöf's first work in\n1890\nwas on the existence of solutions for\ndifferential equations\n. It is an outstanding paper. Then he worked on analytic functions, applying results of\nMittag-Leffler\nin a study of the asymptotic investigation of\nTaylor series\n. In particular he was interested in the behaviour of such functions in the neighbourhood of singular points.\nHe considered analogues of\nFourier series\nand applied them to\ngamma functions\n. He also wrote on\nconformal mappings\n. His work on analytic continuation is explained in a well-written book\nLe calcul des résidus et ses applications à la théorie des fonctions\nⓉ\n(\nCalculation of residues and its applications to the theory of functions\n)\n(\nParis,\n1905)\n. Oettel describes the contents of this treatise in\n[\n1\n]\n:-\nIn it he examines the role which residue theory\n(\nCauchy\n)\nplays in function theory as a means of access to modern analysis. In this endeavour he applies the results of\nMittag-Leffler\n. Moreover he considers series analogous to\nFourier\nsummation formulas and applications to the gamma function and the\nRiemann\nfunction. In addition, new results concerning the\nStirling\nseries and analytic continuation are presented. The book concludes with an asymptotic investigation of series defined by\nTaylor\n's formula.\nThis work was translated into several different languages, including German and Finnish and Swedish and ran to several editions.\nLater in his life Lindelöf gave up research to devote himself to teaching and writing his excellent textbooks. In addition to the\n1905\nwork referred to above which is largely on his own research, he wrote the textbook\nDifferential and integral calculus and their applications\nwhich was published in four volumes between\n1920\nand\n1946\n. Another fine textbook\nIntroduction to function theory\nwas published in\n1936\n.\nAnother important role which Lindelöf played in Finland was the encouragement of the study of the history of mathematics in that country. For his outstanding contributions to Scandinavian mathematics he was honoured by the universities of Uppsala, Oslo, Stockholm, and Helsinki.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}