{
  "nome_completo": "Ernst Friedrich Ferdinand Zermelo",
  "nome_curto": "Ernst Zermelo",
  "ano_nascimento": "1871",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zermelo/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Freiburg im Breisgau, Germany",
  "biografia": "Ernst Zermelo\n's parents were Ferdinand Zermelo and Maria Augusta Elisabeth Ziegler. His father was a college professor so Zermelo was brought up in a family where academic pursuits were encouraged. His secondary school education was at the Luisenstädtisches\nGymnasium\nin Berlin and he graduated from the gymnasium in\n1889\n.\nAt this time it was the custom for students in Germany to study at a number of different universities and indeed that is precisely what Zermelo did. His studies were undertaken at three universities, namely Berlin, Halle and Freiburg, and the subjects he studied were quite wide ranging and included mathematics, physics and philosophy.\nAt these universities he attended courses by\nFrobenius\n,\nLazarus Fuchs\n,\nPlanck\n,\nSchmidt\n,\nSchwarz\nand Edmund Husserl. This was an impressive collection of inspiring lecturers and Zermelo began to undertake research in mathematics after completing his first degree. His doctorate was completed in\n1894\nwhen the University of Berlin awarded him the degree for a dissertation\nUntersuchungen zur Variationsrechnung\nⓉ\n(\nStudies on the calculus of variations\n)\nwhich followed the\nWeierstrass\napproach to the\ncalculus of variations\n. In this thesis he\n[\n1\n]\n:-\n... extended\nWeierstrass\n's method for the extrema of integrals over a class of curves to the case of integrands depending on derivatives of arbitrarily high order, at the same time giving a careful definition of the notion of neighbourhood in the space of curves.\nAfter the award of his doctorate, Zermelo remained at the University of Berlin where he was appointed assistant to\nPlanck\nwho held the chair of theoretical physics there. At this stage Zermelo's work was turning more towards areas of applied mathematics and, under\nPlanck\n's guidance, he began to work for his\nhabilitation\nthesis studying hydrodynamics.\nIn\n1897\nZermelo went to Göttingen, perhaps the leading centre for mathematical research in the world at that time, where he completed his habilitation, submitting his dissertation\nHydrodynamische Untersuchungen über die Wirbelbewegungen in einer Kugelfläche\nⓉ\n(\nHydrodynamic studies of the vortex motion in a spherical surface\n)\nin\n1899\n. Immediately following the award of the degree he was appointed as a lecturer at Göttingen on the strength of his contributions to\nstatistical mechanics\nas well as to the calculus of variations.\nThe direction of Zermelo's research was soon to take a major change.\nCantor\nhad put forward the\ncontinuum hypothesis\nin\n1878\n, conjecturing that every infinite subset of the continuum is either countable\n(\ni.e. can be put in\n1\n-\n1\ncorrespondence with the natural numbers\n)\nor has the cardinality of the continuum\n(\ni.e. can be put in\n1\n-\n1\ncorrespondence with the real numbers\n)\n. The importance of this was seen by\nHilbert\nwho made the continuum hypothesis the first in the list of problems which he proposed in his Paris lecture of\n1900\n.\nHilbert\nsaw this as one of the most fundamental questions which mathematicians should attack in the\n1900\ns and he went further in proposing a method to attack the conjecture. He suggested that first one should try to prove another of\nCantor\n's conjectures, namely that any set can be well ordered.\nPerhaps it would be helpful to give a definition of a well ordered set at this point. A set\nS\nS\nS\nis well ordered if it has a relation < defined on it which satisfies three properties:\n(\ni\n)\nfor any elements\na\n,\nb\na, b\na\n,\nb\nin\nS\nS\nS\neither\na\n=\nb\n,\na\n<\nb\na = b, a < b\na\n=\nb\n,\na\n<\nb\nor\nb\n<\na\nb < a\nb\n<\na\n.\n(\nii\n)\nfor every\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nin\nS\nS\nS\nwith\na\n<\nb\na < b\na\n<\nb\nand\nb\n<\nc\nb < c\nb\n<\nc\nthen\na\n<\nc\na < c\na\n<\nc\n.\n(\niii\n)\nevery non-empty subset of\nS\nS\nS\nhas a least element.\nThe set of natural numbers with the usual ordering is therefore a well ordered set but the set of integers is not well ordered with the usual ordering since the subset of negative integers has no least element.\nZermelo began to work on the problems of set theory, in particular taking up\nHilbert\n's idea to head towards a resolution of the problem of the continuum hypothesis. In\n1902\nZermelo published his first work on set theory which was on the addition of transfinite cardinals. Two years later, in\n1904\n, he succeeded in taking the first step suggested by\nHilbert\ntowards the continuum hypothesis when he proved that every set can be well ordered. This result brought fame to Zermelo and also earned him a quick promotion for, in December\n1905\n, he was appointed as professor in Göttingen.\nThe\naxiom of choice\nis the basis for Zermelo's proof that every set can be well ordered; in fact the axiom of choice is equivalent to the well ordering property so we now know that this axiom has to be used. His proof of the well ordering property used the axiom of choice to construct sets by transfinite induction. Although Zermelo certainly gained fame for his proof of the well ordering property, set theory at this time was in the rather unusual position that many mathematicians rejected the type of proofs that Zermelo had discovered. There were strong feelings as to whether such non-constructive parts of mathematics were legitimate areas for study and Zermelo's ideas were certainly not accepted by quite a number of mathematicians\n[\n1\n]\n:-\nThe proof stirred the mathematical world and produced a great deal of criticism - most of it unjustified - which Zermelo answered elegantly in Neuer Beweis\nⓉ\n(\nNew evidence\n)\n...\nAs this quote indicates, Zermelo's reaction to these criticisms was to try to prove the well ordering property with a proof that would find more widespread acceptance, and this he succeeded in doing in the paper\nNeuer Beweis\nⓉ\n(\nNew evidence\n)\nwhich he published in\n1908\n. It was a paper which he specifically directed at critics of his work. On the one hand he emphasised the formal character of his new proof of the well ordering and on the other hand he argued that his critics, and other mathematicians, also used the axiom of choice when dealing with infinite sets.\nZermelo made other fundamental contributions to axiomatic set theory which were partly a consequence of the criticism of his first major contribution to the subject and partly because set theory began to become an important research topic at Göttingen. The set theory paradoxes first appeared around\n1903\nwith the publication of\nRussell\n's paradox. Zermelo had in fact discovered a similar set paradox himself but did not publish the result. Rather it prompted him to make the first attempt to axiomatise set theory and he began this task in\n1905\n. Having produced an axiom system he wanted to prove that his axioms were consistent before publishing the work, but he failed to achieve this.\nIn\n1908\nZermelo published his axiomatic system despite his failure to prove consistency. He gave seven axioms : Axiom of extensionality, Axiom of elementary sets, Axiom of separation, Power set axiom, Union axiom, Axiom of choice and Axiom of infinity.\nZermelo usually stated his axioms and theorems in words rather than symbols. In fact he did not often use the formal language for quantifiers such as ∃ or ∀ and binding variables that were then being used, instead, he used ordinary expressions such as \"there exists\" or \"for all\".\nIt is worth commenting that\nSkolem\nand\nFraenkel\nindependently improved Zermelo's axiom system in around\n1922\n. The resulting system, with ten axioms, is now the most commonly used one for axiomatic set theory. It enables the contradictions of set theory to be eliminated yet  the results of classical set theory excluding the paradoxes can be derived.\nIn\n1910\nZermelo left Göttingen when he was appointed to the chair of mathematics at the Zürich University. His health was poor but his position was helped by the award of a prize of\n5000\nmarks for his major contributions to set theory. The prize was awarded on the initiative of\nHilbert\nand certainly it was an attempt to enable Zermelo rest and so to regain his health.\nWhen his health had not improved by\n1916\nZermelo resigned his chair in Zürich and moved to the Black Forest in Germany where he lived for ten years. He was appointed to an honorary chair at Freiburg im Breisgau in\n1926\nbut he renounced his chair in\n1935\nbecause of his disapproval of Hitler's regime. At the end of the World War II Zermelo requested that he be reinstated to his honorary position in Freiburg and indeed he was reinstated to the post in\n1946\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}