{
  "nome_completo": "Ernst Carl Gerlach Stueckelberg",
  "nome_curto": "Ernst Stueckelberg",
  "ano_nascimento": "1905",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stueckelberg/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Geneva, Switzerland",
  "biografia": "First let us look at\nErnst Stueckelberg\n's name. He was baptised\nJohann Melchior Ernst Karl Gerlach Stückelberg\nbut in later life he gave his name as Ernst Carl Gerlach Stückelberg. However, it is more complicated than this. His father was Alfred Stückelberg, who was a lawyer, and Alfred's father was the Swiss artist Ernst Stückelberg\n(1831\n-\n1903)\n, painter of Tell's chapel. Legend says that Wilhelm Tell saved himself with a leap out of Gessler's boat at a corner of the Lake of Uri. A chapel to commemorate this stood from the\n14\nth\ncentury but in\n1879\n-\n80\na new chapel was built\n(\nwhich still stands\n)\nand decorated with four marvellous frescos showing scenes of Tell's life painted by Ernst Stückelberg. The mother of Ernst Stueckelberg, the subject of this biography, was Alice Breidenbach and as her father had no male children, her children were allowed to use the title von Breidenbach zu Breidenstein und Melsbach after his death in\n1911\n. Then Ernst Stueckelberg's full name became\nJohann Melchior Ernst Karl Gerlach Stückelberg von Breidenbach zu Breidenstein und Melsbach\n.\nErnst had a strict upbringing and, as Philip Morse writes, Stueckelberg\n[\n2\n]\n:-\n... could not help his name, nor could he help his mannerisms, which had been drilled into him by his father. He once told me his father would not allow him to take off his coat or tie even when he was studying by himself in his own room.\nStueckelberg was brought up and educated in Basel where he attended the Humanistic\nGymnasium\n, a\n16\nth\ncentury secondary school in the Cathedral Square of Basel. In\n1930\n, only a few years after Stueckelberg graduated from the school, it changed its name to Gymnasium am Münsterplatz. He began his university studies at the University of Basel and at this stage his interests were in experimental rather than theoretical physics. He moved from his home town of Basel to Munich where he undertook research with\nArnold Sommerfeld\n.\nSommerfeld\nis, of course, known as a theoretical physicist, but after he came to Munich in\n1906\nhe wanted to be able to direct experimental work aimed at checking his theories. In fact he supervised a large number of students at Munich in programmes of experimental research as well as theoretical physics. Stueckelberg worked in the Institute which had been set up for\nSommerfeld\n, with rooms for seminars, rooms for assistants, and laboratories for experimental work. He submitted his doctoral thesis on his experimental results on the properties of cathode rays to the University of Basel in\n1926\nand he was awarded the degree of Dr. phil. in the following year.\nIt was only after completing his doctoral thesis that Stueckelberg moved from experimental physics to theoretical physics. He also moved countries, going to the United States in\n1927\nto study at Princeton University. Philip Morse met Stueckelberg at this time. He writes\n[\n2\n]\n:-\nI also came to know a rather stiff young man, tall and thin, with an aristocratic profile and a Prussian manner and carriage. His full name was Ernst Carl Gerlach Melchior Stueckelberg von Breidenbach zu Breidenstein. ... he really wanted to become a physicist, and he had come to study under Compton. We came to be close friends, perhaps because opposites attract.\nThe Michigan summer physics programme was held every year and, in\n1928\n,\nKramers\nlectured on quantum theory and\nEhrenfest\non statistical physics. Also lecturing were Sam Goudsmit and\nGeorge Uhlenbeck\n. Stueckelberg arrived halfway through the summer and from then on Morse,\nKramers\nand Stueckelberg would go on outings and spend time together drinking beer\n[\n2\n]\n:-\nIt didn't take much urging, on Ernst's and my part, to get\nKramers\nto talk physics during our evening meals with beer. In fact, these meals turned into a series of tutorials on the quantum mechanics. A marathon session took place during the day\nKramers\nwas getting ready to go back to Holland. Stueckelberg and I helped with the packing while\nKramers\nlectured. Occasionally all three of us would gather around the table while\nKramers\nwrote out a few equations, illustrating how they fitted together to explain some atomic property or other. These casual lectures started both Ernst and me off in new research directions.\nBack at Princeton\n[\n2\n]\n:-\nStueckelberg and I had laid out a whole series of calculations we wanted to attempt. We saw a chance to get in on the ground floor of research in quantum mechanics.\nThey were helped by Edward U Condon, a pioneer in quantum mechanics, and\nHoward P Robertson\n, who was appointed as professor of physics at Princeton in\n1929\n. In\n1930\nStueckelberg was appointed as a research associate and assistant professor at Princeton. He gave a paper at the New York meeting of the Physical Society held at Columbia University then in the autumn of\n1930\nthen, along with Morse who was collaborating on various research topics, he went to spend time at Sommerfeld's Institute in Munich. There Stueckelberg and Morse worked together on high energy collisions. In the spring Stueckelberg, together with Morse, moved to England to spend time at Cambridge.\nHowever, these were difficult times with signs of the Great Depression evident in Europe during his visit. By the time he returned to Princeton economic conditions were deteriorating and his employment at Princeton came to an end in\n1932\nas funding became increasingly tight. He returned to Switzerland where he became a\nPrivatdozent\nat the University of Zürich in\n1933\n. Gregor Wentzel held the Chair for Theoretical Physics at the University of Zürich at this time and\nWolfgang Pauli\nwas professor at the Eidgenössische Technische Hochschule Zürich, so Zürich had a high reputation for theoretical physics. Stueckelberg submitted his\nhabilitation\nthesis to the University of Zürich and gained the right to become a lecturer.\nIn September\n1934\nStueckelberg submitted the paper\nRelativistisch invariante Störungstheorie des Diracschen Elektrons\nⓉ\n(\nThe relativistically invariant perturbation theory of the Dirac electron\n)\nto\nAnnalen der Physik\n. It looks at high energy collision phenomena between electrons and nuclei.\nPauli\nwrote to\nHeisenberg\nabout this paper on\n5\nFebruary\n1937\n(\nover two years after its publication\n)\n:-\nConcerning the formalisation of scattering theory, I wish to draw your attention to a paper of Stueckelberg\n(1934)\n. This paper is not written very well, but the basic idea\n(\nwhich goes back to Wentzel\n)\nseems to me reasonable; it consists of establishing relativistic invariance by the fact that one removes space and time totally from the theory, and directly examines the coefficients of the four-dimensional\nFourier\nexpansion of the wave function.\nArthur Schidlof, who held the chair of theoretical physics at the University of Geneva, died in\n1934\n. Stueckelberg was appointed to succeed him in the following year. In this same year,\n1935\n, he gave an explanation of nuclear interactions as being due to the exchange of vector bosons. He did not publish his ideas on this since\nPauli\ntold him it was ridiculous. Hideki Yukawa received the Nobel prize in\n1949\nfor giving a similar explanation of nuclear interactions. Lacki, Ruegg and Telegdi write\n[\n6\n]\n:-\nThe contribution of Stueckelberg ... constitutes the first complete and easily generalizable instance of a manifest relativistically invariant perturbative calculus. It is of interest in many respects, both technical and epistemological. The \"modernity\" of this contribution is striking and characteristic of Stueckelberg's original turn of mind.\nA big advance in theoretical physics was the renormalization programme in quantum field theory. At the\n1948\nSolvay congress, Oppenheimer insisted on preserving covariance in all steps of the calculation if one wants to eliminate the infinities which otherwise occur. He then quoted Stueckelberg's\n1934\npaper as giving an example of such a covariant theory. This was not Stueckelberg's only contribution to the renormalization programme, however, for in the early\n1940\ns he wrote a long paper outlining a complete and correct description of the renormalization procedure for quantum electrodynamics. He sent it to the\nPhysical Review\n, but it was rejected. As Stueckelberg later recalled:-\nThey said it was not a paper, it was a programme, an outline, a proposal ...\nHe then set about filling in all the details but\nSchwinger\nand\nFeynman\npublished their version first and Stueckelberg received no recognition for his remarkable contributions. In\n1965\nSin-Itiro Tomonaga,\nJulian Schwinger\nand\nRichard P Feynman\nwere jointly awarded the Nobel Prize for Physics:-\n... for their fundamental work in quantum electrodynamics, with deep-ploughing consequences for the physics of elementary particles.\nAfter receiving the Nobel Prize,\nFeynman\nlectured at CERN to an audience which included Stueckelberg. Jagdish Mehra writes\n[\n7\n]\n:-\nAfter the lecture, Stueckelberg was making his way out alone ... from the CERN ampitheatre, when\nFeynman\n- surrounded by admirers - made the remark: \"He\n[\nStueckelberg\n]\ndid the work and walks alone toward the sunset; and, here I\n[\nFeynman\n]\nam, covered in all the glory, which rightfully should be his!\"\nIn\n1951\nStueckelberg and Andre Petermann invented the renormalization group. In\n1982\nKenneth G Wilson was awarded the Nobel Prize for Physics:-\n... for his theory for critical phenomena in connection with phase transitions.\nThe Press Release for this award states that:-\nWilson built his theory on an essential modification of a method in theoretical physics called renormalization group theory, which was developed already during the fifties and was applied with varying success to different problems.\nIn his Nobel Lecture, Wilson said:-\nStueckelberg and Petermann observed that transformation groups could be defined which relate different reparametrizations - they called these groups \"groupes de normalization\" which is translated \"renormalization group\".\nAndré Petermann recalls working with Stueckelberg\n[\n5\n]\n:-\nI was not really a student of Stueckelberg, but a recently graduate mathematician working on direct products of generalized functions and on the space on which they can be defined. Stueckelberg, having such a problem with his student T A Green, in the work they were doing in S-matrix theory, asked me if I would be interested in working at the Swiss Atomic Energy Commission, in order to deal with this problem in a mathematical way, according to\nSchwartz\n,\nSobolev\nand others. I took the job, and Stueckelberg became more my boss than my professor and later my beloved friend. I worked there during three years, leaving\n(\non the advice of Stueckelberg\n)\nto go to\nNiels Bohr\nin Copenhagen.\nStueckelberg continued to hold the chair at Geneva until he retired in\n1975\n. However, he was also appointed professor at the University of Lausanne in\n1956\n, again holding this position until he retired. He suffered mental health problems and was given the treatment which was common at that time, namely administered electric shocks. Although the problems continued to recur, Stueckelberg was able to carry out his duties. A few months before his death the struggle was becoming too much for him. He said:-\nI look forward every day to my eventual journey to Heaven ... We live too long ...\nHe is buried in the Cimetière de Plainpalais, Rue des Rois, Geneva\n(\nwhere the reformer John Calvin is also buried\n)\n.\nAlthough Stueckelberg never received the recognition for his achievement which many felt that he so clearly deserved, he did receive a number of significant honours. In\n1976\nhe was awarded the\nMax Planck\nmedal by the Deutsche Physikalische Gesellschaft\n(\nGerman Physical Society\n)\n. He was an honorary member of the Romanian Physics Society and of the Institut de Coimbra. He received honorary doctorates from the Universities of Neuchâtal and of Berne in\n1963\n. In December\n2005\nan International symposium celebrating the centenary of the birth\nof E C G Stueckelberg was held at Geneva University.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Statistics"
  ]
}