{
  "nome_completo": "Ernst Witt",
  "nome_curto": "Ernst Witt",
  "ano_nascimento": "1911",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Witt/",
  "lugar_nascimento": "Alsen (German Baltic island) (now Als, Denmark)",
  "lugar_morte": "Hamburg, Germany",
  "biografia": "Ernst Witt\n's parents were Heinrich Witt and Charlotte Jepsen. Heinrich Witt's father, also named Heinrich Witt, was a school teacher passionately dedicated to religious education in schools. Heinrich Witt, Ernst's father, was the seventh of thirteen children and his very religious upbringing led him to study theology at Halle University. He always intended to become a missionary and, after the Liebenzell Mission was set up in Hamburg in November\n1899\nthey appointed Heinrich Witt to be their first missionary in China in March\n1900\n. He went to Yuan-Chow and, in\n1906\n, married Charlotte Jepsen from Sonderburg. They had a daughter who was born in China, and the family returned to Germany for their first leave home in\n1911\n. It was during this two years leave that Ernst was born on the island of Alsen. Alsen together with the rest of North Schleswig became part of Germany in\n1864\n. The island and was returned to Denmark by plebiscite in\n1920\n, nine years after Witt's birth there, and is now known as Als. The island is separated from the Sundeved peninsula of southern Jutland by a narrow piece of water called Als Sound.\nWhen Ernst was two years old, his parents returned to China to continue their missionary work. Heinrich Witt became head of the Liebenzell Mission in Changsha. Ernst spent the next nine years of his life in China with his elder sister and four younger siblings. He learnt Chinese from the Chinese nannies employed to look after the children, and he also learn arithmetic from his father. However, Heinrich Witt was very involved in his missionary work which took him on many long journeys through China. His children were somewhat neglected. First Heinrich sent his eldest daughter back to Germany to live with his brother in Müllheim. Then in the spring of\n1920\nErnst and his younger brother Otto were also sent to live with their uncle in Müllheim. His uncle was a preacher with eight children of his own and he ran a home for children of missionaries - usually there were at least\n30\nchildren in total. The home was strictly run and did not provide a very stimulating environment for the young Witt. However he was now able to attend the Realschule in Müllheim where his enthusiasm for mathematics soon became evident as did his liking for chemistry.\nAfter graduating from the Realschule in Müllheim, Witt went to Freiburg in\n1927\nwere he attended the Oberrealschule. At this time his parents returned from China for another two year leave and they were in Germany for the years when Witt was at the Oberrealschule. At this school Witt was fortunate to have a talented mathematics teacher, Karl Öttinger, who quickly realised the extraordinary talent of his pupil and did everything he could to allow him to progress rapidly to advanced topics. In\n1929\nWitt's parent returned to China leaving all their children in Germany. Witt took his Abitur examination in the same year, then entered the University of Freiburg to study mathematics and physics. At Freiburg he was taught by, among others,\nAlfred Loewy\nand\nOskar Bolza\n. It was usually for students at German universities at this time to move between institutions and after two terms at Freiburg, Witt moved to Göttingen for the start of the\n1930\nsummer term. He attended lectures by\nGustav Herglotz\n,\nHermann Weyl\n, James Franck and\nEmmy Noether\n.\nHerglotz\nquickly realised that Witt had remarkable mathematical gifts. Having seen a remarkably simple proof by Witt of\nWedderburn\n's theorem that every finite skew field is commutative,\nHerglotz\nencouraged him to submit it for publication and it became Witt's first paper appearing in\n1931\n.\nEmil Artin\n, who held the chair at Hamburg, lectured at Göttingen in\n1932\nand Witt attended his lectures on class field theory and was greatly influenced by them. At\nArtin\n's invitation he spent some time in Hamburg studying the class field theory of number fields.\nOn\n30\nJanuary\n1933\nHitler came to power. Witt joined the Nazi Party on\n1\nMay\n1933\nand also the SA, the military wing of the Party. It has been claimed that\nOswald Teichmüller\n, who was like Witt a student at Göttingen, convinced him to join.\nEmmy Noether\n, who was Jewish, was dismissed from her post by the Nazis but continued to give lectures in her home. At one of the lectures Witt turned up wearing his SA\n(\nSturm Abteilung: Storm Section\n)\nuniform. His doctorate was obtained from Göttingen where his doctoral studies were officially supervised by\nHerglotz\n. However, it was\nEmmy Noether\nwho suggested a topic related to the\nRiemann\n-\nRoch\ntheorem and this was indeed the topic on which his dissertation\nRiemann-Rochscher Satz und Z-Funktion im Hyperkomplexen\nⓉ\n(\nRiemann-Roch theorem and Z function in hyper complexes\n)\nwas written. The oral exemination was held at the end of July\n1933\n; the committee comprising\nHerglotz\n,\nWeyl\nand the physicist Robert Pohl. He had written up the thesis in the first week of July and submitted it on the\n7\nth\n. He published his thesis in\n1934\nin\nMathematische Annalen\n.\nHerglotz\nwrote in\n1946\nabout Witt's activities in the SA\n(\nsee for example\n[\n7\n]\n)\n. He:-\n... joined the SA, urged on by the simple wish ... not to stand apart, while others carried their burden. I asked him about his impression of his comrades, whose ideas, as I suspected, would often come into conflict with his devotion to science. His answer was: \"I don't know much about them. During our night marches I never talk to them, and in the morning I go home immediately, to continue my studies where I left them the evening before.\"  In those days we had much trouble with certain 'activists', particularly among the younger lecturers. I would like to emphasize the fact that Witt always stood apart from this group and its troublemaking. He was completely absorbed in his mathematical work, which he only interrupted for night and pack marches. The way he looked at the time caused quite a bit of worry.\nThis view that Witt put mathematics before Nazi ideology is born out by many, both staunch Nazi supporters and those opposed to the Nazi ideas. The pro-Nazi Werner Weber wrote about Witt:-\n... Witt once explained that all sciences can reshape themselves in accordance with the spirit of the times; only in mathematics must everything remain as before.\nWeyl\nresigned his professorship at Göttingen, and after arguments between hard-line Nazis and some who were less hard-line,\nHelmut Hasse\nwas offered the chair which he took up in\n1934\n. Witt joined\nHasse\n's seminar on congruence function fields and p-adic numbers; he was appointed as\nHasse\n's assistant.\nOswald Teichmüller\nand Ludwig Schmid were also members of the seminar, and Schmid collaborated with Witt on ideas which would lead to the Witt vector calculus. Witt\nhabilitated\nwith Hasse in\n1936\n. In February of that year he took an oral examination and gave his habilitation lecture in June\n1936\n. Kersten writes\n[\n7\n]\n:-\nHis habilitation on the theory of quadratic forms in arbitrary fields ranks as one of his most famous works. In it he introduced what was later named the 'Witt ring' of quadratic forms. Shortly after that, Witt introduced the ring of 'Witt vectors', which had a great influence on the development of modern algebraic geometry\n(\nsee\n[\n4\n]\nand\n[\n5\n]\n)\n.\nThe Nazis dismissed\nOtto Toeplitz\nfrom his chair in Bonn in\n1935\n. In the following year\nHerglotz\nargued strongly in support of Witt becoming\nToeplitz\n's successor but the chair was not filled until\n1939\nwhen\nWolfgang Krull\nwas appointed. Witt published\nTreue Darstellung Liescher Ringe\nⓉ\n(\nFaithful representations of Lie rings\n)\nin\n1937\n, which was inspired by earlier work of\nWilhelm Magnus\non free\nLie algebras\n. In this paper Witt showed that any\nLie\nalgebra over a field has a faithful representation in an associative algebra, and that there exists an associative algebra which is universal with respect to this construction. This, together with results of\nPoincaré\nfrom\n1899\nand Birkhoff in\n1937\n(\nindependently of Witt\n)\n, led to the famous\nPoincaré\n-\nBirkhoff\n-Witt theorem\n(\nsee\n[\n3\n]\nfor the history of the theorem\n)\n. Murray Bremner writes:-\nThe\nPoincaré\n-\nBirkhoff\n-Witt theorem gives an explicit description of the universal associative enveloping algebra of any Lie algebra over any field, and thereby establishes a remarkable relation between associative and nonassociative algebras. It is one of the most important theorems in mathematics, connecting such diverse areas as representation theory, differential geometry, and universal algebra.\nIn August\n1937\nhe attended the compulsory National Socialist course for lecturers and was given the follow assessment\n(\nsee\n[\n7\n]\n)\n:-\nNational Socialist thinking: Mediocre\nIndependent propagandist in any situation: No\nNational Socialist disposition: Limited\nPhysical capabilities: weakly-built, cannot be established because of a sporting injury.\nGeneral enthusiasm for his duty: shirker\nBehaviour towards people around him: quiet, restrained, his manners are somewhat insecure.\nDescription of his character: Witt has shown himself to be quiet, modest and restrained, with a tendency to keep to himself; characteristic features are a certain naivety and eccentricity. He is honest and straightforward. He dedicates himself to his work with dogged tenacity, continuously brooding and thinking and thus represents the typical, politically indifferent researcher and scientist, who will probably be successful in his subject, but who, at least for the time being, is lacking any of the qualities of a leader or educator.\nEmil Artin\nwas not a Jew but his wife was a Jew so when the \"New Official's Law\" was passed by the Nazis in\n1937\naffecting those who were related to Jews by marriage he was forced from his post at the University of Hamburg.\nArtin\nleft Germany for the United States. Witt was appointed to fill the vacancy at Hamburg in\n1938\n, at first as a lecturer, then from\n1\nSeptember\n1939\nas an extraordinary professor.  He remained there until he retired in\n1979\n. In\n1940\nhe married Erna Bannow, from Göttingen. She was a mathematician who had gone to work with\nArtin\nin Hamburg; they had two daughters. Erna Bannow's doctoral dissertation\nDie Automorphismengruppen der Cayley-Zahlen\nⓉ\n(\nThe automorphism groups of the Cayley numbers\n)\nwas published in\n1940\nas was Witt's report on the thesis.\nWitt was called up for war service in February\n1940\nbut managed to get it deferred for a year. From February\n1941\nhe trained as a radio operator and in June was sent to the Russian front. However he became ill and, in November, was sent back to Germany. He recovered from the illness, after which he was sent to undertake decoding work in Berlin. At the end of the war he was taken prisoner, but still in\n1945\nwas freed to return to Hamburg. However, he was dismissed from his professorship at Hamburg because of his association with the Nazis. Many of his colleagues wrote supporting his reinstatement, all testifying that Witt, despite his membership of the Party, had quickly realised that the aims of the Nazi Party were incompatible with scientific progress which was always the most important thing in his life. He was reinstated in April\n1947\n, appointed as a personal professor in\n1954\nand a full professor in\n1957\n. He retired on\n30\nSeptember\n1979\n. We note that following the two papers\nSpiegelungsgruppen und Aufzählung halbeinfacher Liescher Ringe\nⓉ\n(\nReflection groups and enumeration of semisimple Lie rings\n)\nand\nEine Identität zwischen Modulformen zweiten Grades\nⓉ\n(\nAn identity between modular forms of second degree\n)\n, both published in\n1941\n, no further publications by Witt appeared until\n1949\nwhen he published\nRekursionsformel für Volumina sphärischer Polyeder\nⓉ\n(\nRecursion for the volume of  spherical polyhedra\n)\n.\nWitt made many visits to lecture on his work. He lectured in Spain and, as a consequence of these lectures, published two expository papers in Spanish:\nOn Zorn's theorem\n(1950)\n, and\nIntuitionistic mathematics\n(1951)\n. Among other visits, usually to give lecture courses, we mention Rome\n(\nDecember\n1952\nto April\n1953)\n, Barcelona\n(\nautumn\n1953)\n, and Istanbul\n(\nspring\n1958)\n. He spent the academic year\n1960\n-\n61\nat the Institute for Advanced Study at Princeton in the United States. Witt was always completely honest and often rather naive, and he showed this side of his character during his time in Princeton. He is supposed to have shown around his driver's licence, which was authorised with a swastika, without realising that it would cause offence. In spring\n1961\nKurosh\nand Witt were introduced in Princeton.\nKurosh\nhad lectured about a theorem of Witt's and, when told that, Witt smiled and said \"I proved that theorem when I was in the USSR\".\nKurosh\nreplied in a friendly way \"Why, I never knew you visited the USSR. When was that?\" Witt replied \"When I was in the Wehrmacht\".\nKurosh\nturned on his heel and left without a word. Witt never quite understood why his openness about such matters led to his colleagues at Princeton avoiding him.\nWitt's work was mainly concerned with quadratic forms and various related fields such as algebraic function fields, Witt vectors,\nLie rings\nand\nMathieu\ngroups. He is best known for his introduction of Witt vectors which appeared in his paper in\n1936\nin\nJ. Reine Angew. Math\n. The original construction of Witt vectors is given in the articles\n[\n4\n]\nand\n[\n5\n]\n(\n[\n4\n]\nis a German translation of\n[\n5\n]\n)\n. The papers\n[\n6\n]\n,\n[\n7\n]\nand\n[\n8\n]\nare written by Ina Kersten who was one of Witt's pupils at Hamburg and his assistant during the two years before he retired. Kersten describes Witt's final years\n[\n7\n]\n:-\nSince\n1969\n, he suffered from allergies to various detergents and adhesives for wallpapers and carpets. He complained about dizziness and a diminishing ability to concentrate. Because of these troubles, he had to decline several invitations for talks at home and abroad, and in\n1975\n, he experienced a slight stroke. Moreover, because of his allergies, he could not join the move of the mathematics department to a modern high-rise building, in which, because of some kind of air conditioning, the windows could not be opened. Thus he got more and more isolated, and his general reputation to be an eccentric was strengthened. On his account the colloquia of the mathematics department were held in another building, and he could attend them until shortly before his death.\nWitt received many honours such as membership of the\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\nin\n1937\n, the\nHamburg Mathematical Society\n, the oldest mathematical society in the world which still exists today, in\n1954\n, and the\nGöttingen Academy of Sciences\nin\n1978\n.\nWe end this biography by quoting Segal\n[\n2\n]\n:-\nErnst Witt seems to have actually suited a usual caricature of a mathematician - both heedless and ignorant of the world, somewhat naive, self-absorbed in his mathematical universe, truly unpolitical. This is also a caricature sometimes used to explain academic reaction to the Nazis. In both cases it is almost always false. Witt is worth consideration because his life seems to show that the caricatures could, in fact, both be true.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}