{
  "nome_completo": "Etta Zuber Falconer",
  "nome_curto": "Etta Zuber Falconer",
  "ano_nascimento": "1933",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Falconer/",
  "lugar_nascimento": "Tupelo, Mississippi, USA",
  "lugar_morte": "Atlanta, Georgia, USA",
  "biografia": "Etta Zuber\n's parents were Walter A Zuber, who was a medical doctor, and Zadie L Montgomery who was a musician. Walter and Zadie had two children, both daughters. The older girl was Alice with Etta the younger of the two. Etta was born into an African - American family who clearly valued education and she had the advantage that, somewhat unusually for this time, her mother Zadie had been educated at College; in fact at Spelman College where Etta would spend most of her career.\nEtta attended schools in Tupelo and completed her school education at George Washington High School. Graduating from the High School in\n1949\nEtta Zuber entered the traditionally Black Fisk University in Nashville, Tennessee, where she studied mathematics with chemistry as her minor subject. She was fortunate that at Fisk she was taught by\nEvelyn Boyd Granville\nwho was one of the first two African- American women to be awarded a Ph.D.\nGranville\nwas appointed Associate Professor of Mathematics at Fisk University and taught there from\n1950\nto\n1952\n. Even though\nGranville\nwas only at Fisk for part of Zuber's undergraduate years she was still an inspiring teacher yet not the only teacher at Fisk to strongly influence Zuber for\nLee Lorch\nalso played a major role\n[\n1\n]\n:-\nThere are several persons who have had a tremendous impact upon my professional life. Dr\nLee Lorch\ninspired me to study mathematics and helped to mould me as a person because of his belief in the dignity of all people. He remains my mentor to this day. One of the first Black women to earn at Ph.D. in mathematics, Dr\nEvelyn Boyd Granville\n, taught me during my college days and became my first career role model.\nZuber graduated with a B.A. in\n1953\nand then went to the University of Wisconsin at Madison to undertake graduate studies. However she now encountered problems as she has explained\n[\n1\n]\n:-\nCan you imagine what it was like for a\n19\nyear old Black female from Tupelo, Mississippi who had been immersed in segregation for all her life to attend the University of Wisconsin? I underwent a major culture shock. ... I gravitated to students from Africa, a roommate from Thailand, and an office-mate from India, who was the only person to whom I could ask a mathematics question.\nAcademically she did well and was awarded a Master's Degree in\n1954\n. However, she felt uncomfortable in Madison decided to return home to Mississippi. She accepted a teaching position at Okolona Junior College in Okolona, Mississippi in\n1954\n. It was while she taught there that she met Dolan Falconer and the two married. They had three children, Dolan Jr, Alice, and Walter.\nFor the rest of this biography we will refer to Etta Zuber as Falconer. She remained at Okolona Junior College until\n1963\nbut she began to attend summer courses towards the end of this period. She attended the University of Illinois-Champaign at Urbana during the summers of\n1962\nto\n1965\n, spending the academic year\n1964\n-\n65\nat the National Science Foundation Teacher Training Institute at the University of Illinois-Champaign. She continued to teach after leaving Okolona Junior College, accepting a teaching post at Howard High School in Chattanooga for the academic year\n1963\n-\n64\nbefore being appointed as an Instructor at Spelman College in Atlanta, Georgia, in\n1965\n. She was now in a post in the College where her mother had studied and she spent most of the rest of her career at Spelman College.\nAlthough she had left her graduate studies at the University of Wisconsin without undertaking research for a doctorate, she now decided to study for a Ph.D. in algebra at Emory University. Her studies there were supervised by Trevor Evans:-\n... my dissertation advisor,\n[\nwho\n]\nfostered my growth in the area of algebra.\nFalconer was awarded her Ph.D. in\n1969\nfor a thesis entitled\nQuasi group Identities Invariant under Isotopy\n. Two papers by Falconer were based on her thesis. The first\nIsotopy invariants in quasigroups\nwas published in\n1970\nin the\nTransactions of the American Mathematical Society\n. It is an excellent piece of work which considers loop and quasigroup identities that are invariant under isotopy, proving a number of very interesting results. The second of the two papers was\nIsotopes of some special quasigroup varieties\npublished in\n1971\nby the\nHungarian Academy of Sciences\n. In it Falconer characterises the classes of all quasigroups that are isotopic to some special classes of loops. In particular she shows that a necessary and sufficient condition for a quasigroup be isotopic to a group is that it satisfies a generalised group identity. She also finds necessary and sufficient condition that a quasigroup be isotopic to various types of loops such as a\nMoufang\nloop.\nFalconer was appointed to the Mathematics Department at Norfolk State University in Norfolk, Virginia in\n1971\nand after spending the academic year\n1971\n-\n72\nthere she returned to Spelman College at Professor of Mathematics and Head of the Mathematics Department. In\n1982\nshe became Head of the Division of Natural Sciences and in\n1990\nshe became Fuller E Calloway Professor of mathematics and Director of Science Programs and Policy at Spelman College. Houston writes in\n[\n1\n]\n:-\nThis succession of promotions have permitted her to positively impact the lives of hundreds of young ladies in mathematics and the sciences as well as scores of faculty. During her approximately thirty year tenure at Spelman, Falconer has become one of American's most productive, distinguished and influential mathematics and science educators, generously sharing her time, talents, energies, scholarly publications and presentations with thousands of persons throughout the USA.\nRather remarkably Falconer did not end her education at this point but continued to study. In particular she took a second Master's Degree, this time in Computer Science from Atlanta University in\n1982\n.\nWhen one examines the two papers on quasigroup and loops which we described briefly above, then one cannot help feeling sorry that Falconer did not continue her research in this area. It is clear that she had much to offer as a research mathematician. However, it is probable that her contributions as an educator, devoting her energies to improve the participation of African American women in mathematics and science, has proved much more valuable. She has worked through major organisations to achieve her aims. For example she has served in various capacities: the American Association for the Advancement in Science; the\nAssociation for Women in Mathematics\n; the\nMathematical Association of American\n; the\nAmerican Mathematical Society\n; the National Institute of Science; and the National Science Foundation.\nCertainly her contributions have been recognised with many awards and honours. In particular she received the National Association of Mathematicians Distinguished Service Award in\n1994\nand the Association for Women in Mathematics Louis Hay Award for contributions to Mathematics Education in\n1995\n. In her address after receiving this award in\n1995\nFalconer said:-\nI have devoted my entire life to increasing the number of highly qualified African Americans in mathematics and mathematics related careers. High expectations, the building of self confidence, and the creation of a nurturing environment have been essential components for the success of these students. They have fully justified my beliefs. Perhaps the most rewarding moments have come when younger faculty have undertaken the same goal and have surpassed my efforts - reaching out to the broader community to help minorities and women achieve in mathematics.\nFurther honours given to Falconer includes the Giants in Science Award from the Quality Education for Minorities Network in\n1996\nand an honorary doctorate from the University of Wisconsin at Madison in\n1996\n. In\n2001\nshe was awarded the Lifetime Mentor Award from the American Association for the Advancement in Science.",
  "math_areas": [
    "Algebra"
  ]
}