{
  "nome_completo": "Eudoxus of Cnidus",
  "nome_curto": "Eudoxus",
  "ano_nascimento": "408 BC",
  "ano_morte": "355 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eudoxus/",
  "lugar_nascimento": "Cnidus (on Resadiye peninsula), Asia Minor (now Knidos, Turkey)",
  "lugar_morte": "Cnidus, Asia Minor (now Turkey)",
  "biografia": "Eudoxus of Cnidus\nwas the son of Aischines. As to his teachers, we know that he travelled to Tarentum, now in Italy, where he studied with\nArchytas\nwho was a follower of\nPythagoras\n. The problem of\nduplicating the cube\nwas one which interested\nArchytas\nand it would be reasonable to suppose that Eudoxus's interest in that problem was stimulated by his teacher. Other topics that it is probable that he learnt about from\nArchytas\ninclude\nnumber theory\nand the theory of music.\nEudoxus also visited Sicily, where he studied medicine with Philiston, before making his first visit to Athens in the company of the physician Theomedon. Eudoxus spent two months in Athens on this visit and he certainly attended lectures on philosophy by\nPlato\nand other philosophers at the\nAcademy\nwhich had only been established a short time before.\nHeath\n[\n3\n]\nwrites of Eudoxus as a student in Athens:-\n... so poor was he that he took up his abode at the Piraeus and trudged to Athens and back on foot each day.\nAfter leaving Athens, he spent over a year in Egypt where he studied astronomy with the priests at Heliopolis. At this time Eudoxus made astronomical observations from an observatory which was situated between Heliopolis and Cercesura. From Egypt Eudoxus travelled to Cyzicus in northwestern Asia Minor on the south shore of the sea of Marmara. There he established a School which proved very popular and he had many followers.\nIn around\n368\nBC Eudoxus made a second visit to Athens accompanied by a number of his followers. It is hard to work out exactly what his relationship with\nPlato\nand the\nAcademy\nwere at this time. There is some evidence to suggest that Eudoxus had little respect for\nPlato\n's analytic ability and it is easy to see why that might be, since as a mathematician his abilities went far beyond those of\nPlato\n. It is also suggested that\nPlato\nwas not entirely pleased to see how successful Eudoxus's School had become. Certainly there is no reason to believe that the two philosophers had much influence on each others ideas.\nEudoxus returned to his native Cnidus and there was acclaimed by the people who put him into an important role in the legislature. However he continued his scholarly work, writing books and lecturing on theology, astronomy and meteorology.\nHe had built an observatory on Cnidus and we know that from there he observed the star Canopus. The observations made at his observatory in Cnidus, as well as those made at the observatory near Heliopolis, formed the basis of two books referred to by\nHipparchus\n. These works were the\nMirror\nand the\nPhaenomena\nwhich are thought by some scholars to be revisions of the same work.\nHipparchus\ntells us that the works concerned the rising and setting of the constellations but unfortunately these books, as all the works of Eudoxus, have been lost.\nHe constructed a sundial here. You can see a picture of it at\nTHIS LINK\n.\nEudoxus made important contributions to the theory of proportion, where he made a definition allowing possibly\nirrational\nlengths to be compared in a similar way to the method of cross multiplying used today. A major difficulty had arisen in mathematics by the time of Eudoxus, namely the fact that certain lengths were not comparable. The method of comparing two lengths\nx\nx\nx\nand\ny\ny\ny\nby finding a length\nt\nt\nt\nso that\nx\n=\nm\n×\nt\nx = m \\times  t\nx\n=\nm\n×\nt\nand\ny\n=\nn\n×\nt\ny = n \\times  t\ny\n=\nn\n×\nt\nfor whole numbers\nm\nm\nm\nand\nn\nn\nn\nfailed to work for lines of lengths\n1\nand √\n2\nas the Pythagoreans had shown.\nThe theory developed by Eudoxus is set out in\nEuclid\n's\nElements\nBook V. Definition\n4\nin that Book is called the Axiom of Eudoxus and was attributed to him by\nArchimedes\n. The definition states\n(\nin\nHeath\n's translation\n[\n3\n]\n)\n:-\nMagnitudes are said to have a ratio to one another which is capable, when a multiple of either may exceed the other.\nBy this Eudoxus meant that a length and an area do not have a capable ratio. But a line of length √\n2\nand one of length\n1\ndo have a capable ratio since\n1\n× √\n2\n>\n1\nand\n2\n×\n1\n> √\n2\n. Hence the problem of irrational lengths was solved in the sense that one could compare lines of any lengths, either\nrational\nor irrational.\nEudoxus then went on to say when two ratios are equal. This appears as\nEuclid\n's\nElements\nBook V Definition\n5\nwhich is, in\nHeath\n's translation\n[\n3\n]\n:-\nMagnitudes are said to be of the same ratio, the first to the second and the third to the fourth, when, if any equimultiples whatever be taken of the first and the third, and any equimultiples whatever of the second and fourth, the former equimultiples alike exceed, are alike equal to, or are alike less than the latter equimultiples taken in corresponding order.\nIn modern notation, this says that\na\n:\nb\nand\nc\n:\nd\nare equal\n(\nwhere\na\n,\nb\n,\nc\n,\nd\na, b, c, d\na\n,\nb\n,\nc\n,\nd\nare possibly irrational\n)\nif for every possible pair of integers\nm\n,\nn\nm, n\nm\n,\nn\nif\nm\na\n<\nn\nb\nma < nb\nm\na\n<\nn\nb\nthen\nm\nc\n<\nn\nd\nmc < nd\nm\nc\n<\nn\nd\n,\nif\nm\na\n=\nn\nb\nma = nb\nm\na\n=\nn\nb\nthen\nm\nc\n=\nn\nd\nmc = nd\nm\nc\n=\nn\nd\n,\nif\nm\na\n>\nn\nb\nma > nb\nm\na\n>\nn\nb\nthen\nm\nc\n>\nn\nd\nmc > nd\nm\nc\n>\nn\nd\n.\nHuxley writes in\n[\n1\n]\n:-\nIt is difficult to exaggerate the significance of the theory, for it amounts to a rigorous definition of real number. Number theory was allowed to advance again, after the paralysis imposed on it by the Pythagorean discovery of irrationals, to the inestimable benefit of all subsequent mathematics.\nA number of authors have discussed the ideas of real numbers in the work of Eudoxus and compared his ideas with those of\nDedekind\n, in particular the definition involving '\nDedekind\ncuts' given in\n1872\n.\nDedekind\nhimself emphasised that his work was inspired by the ideas of Eudoxus.\nHeath\n[\n3\n]\nwrites that Eudoxus's definition of equal ratios:-\n... corresponds exactly to the modern theory of irrationals due to\nDedekind\n, and that it is word for word the same as\nWeierstrass\n's definition of equal numbers.\nHowever, some historians take a rather different view. For example, the article\n[\n15\n]\n(\nquoting from the author's summary\n)\n:-\n... analyses, first, the historical significance of the theory of proportions contained in Book V of\nEuclid\n's \"Elements\" and attributed to Eudoxus. It then demonstrates the radical originality, relative to this theory, of the definition of real numbers on the basis of the set of rationals proposed by\nDedekind\n. Two conclusions:\n(1)\nthere are not in Book V of the \"Elements\" the gaps perceived by\nDedekind\n;\n(2)\none cannot properly speak of an 'influence' of Eudoxus's ideas on\nDedekind\n's theory.\nAnother remarkable contribution to mathematics made by Eudoxus was his early work on integration using his\nmethod of exhaustion\n. This work developed directly out of his work on the theory of proportion since he was now able to compare irrational numbers. It was also based on earlier ideas of approximating the area of a circle by\nAntiphon\nwhere\nAntiphon\ntook\ninscribed\nregular polygons with increasing numbers of sides. Eudoxus was able to make\nAntiphon\n's theory into a rigorous one, applying his methods to give rigorous proofs of the theorems, first stated by\nDemocritus\n, that\nthe volume of a pyramid is one-third the volume of the prism having the same base and equal height;\nand\nthe volume of a cone is one-third the volume of the cylinder having the same base and height.\nThe proofs of these results are attributed to Eudoxus by\nArchimedes\nin his work\nOn the sphere and cylinder\nand of course\nArchimedes\nwent on to use Eudoxus's method of exhaustion to prove a remarkable collection of theorems.\nWe know that Eudoxus studied the classical problem of the duplication of the cube.\nEratosthenes\n, who wrote a history of the problem, says that Eudoxus solved the problem by means of curved lines.\nEutocius\nwrote about Eudoxus's solution but it appears that he had in front of him a document which, although claiming to give Eudoxus's solution, must have been written by someone who had failed to understand it.\nPaul Tannery\ntried to reconstruct Eudoxus's proof from very little evidence, so it must remain no more than a guess. Tannery's ingenious suggestion was that Eudoxus had used the kampyle curve in his solution and, as a consequence, the curve is now known as the kampyle of Eudoxus.\nHeath\n, however, doubts Tannery's suggestions\n[\n3\n]\n:-\nTo my mind the objection to it is that it is too close an adaptation of\nArchytas\n's ideas ... Eudoxus was, I think, too original a mathematician to content himself with a mere adaptation of\nArchytas\n's method of solution.\nWe have still to discuss Eudoxus's planetary theory, perhaps the work for which he is most famous, which he published in the book\nOn velocities\nwhich is now lost. Perhaps the first comment that is worth making is that Eudoxus was greatly influenced by the philosophy of the Pythagoreans through his teacher\nArchytas\n. Therefore it is not surprising that he developed a system based on spheres following\nPythagoras\n's belief that the sphere was the most perfect shape. The\nhomocentric sphere system\nproposed by Eudoxus consisted of a number of rotating spheres, each sphere rotating about an axis through the centre of the Earth. The axis of rotation of each sphere was not fixed in space but, for most spheres, this axis was itself rotating as it was determined by points fixed on another rotating sphere.\nAs in the diagram on the right, suppose we have two spheres\nS\n1\nS_{1}\nS\n1\n​\nand\nS\n2\nS_{2}\nS\n2\n​\n, the axis\nX\nY\nXY\nX\nY\nof\nS\n1\nS_{1}\nS\n1\n​\nbeing a diameter of the sphere\nS\n2\nS_{2}\nS\n2\n​\n. As\nS\n2\nS_{2}\nS\n2\n​\nrotates about an axis\nA\nB\nAB\nA\nB\n, then the axis\nX\nY\nXY\nX\nY\nof\nS\n1\nS_{1}\nS\n1\n​\nrotates with it. If the two spheres rotate with constant, but opposite, angular velocity then a point\nP\nP\nP\non the equator of\nS\n1\nS_{1}\nS\n1\n​\ndescribes a figure of eight curve. This curve was called a\nhippopede\n(\nmeaning a horse-fetter\n)\n.\nEudoxus used this construction of the hippopede with two spheres and then considered a planet as the point\nP\nP\nP\ntraversing the curve. He introduced a third sphere to correspond to the general motion of the planet against the background stars while the motion round the hippopede produced the observed periodic retrograde motion. The three sphere subsystem was set into a fourth sphere which gave the daily rotation of the stars.\nThe planetary system of Eudoxus is described by\nAristotle\nin\nMetaphysics\nand the complete system contains\n27\nspheres.\nSimplicius\n, writing a commentary on\nAristotle\nin about\n540\nAD, also describes the spheres of Eudoxus. They represent a magnificent geometrical achievement. As\nHeath\nwrites\n[\n3\n]\n:-\n... to produce the retrogradations in this theoretical way by superimposed axial rotations of spheres was a remarkable stroke of genius. It was no slight geometrical achievement, for those days, to demonstrate the effect of the hypothesis; but this is nothing in comparison with the speculative power which enabled the man to invent the hypothesis which could produce the effect.\nThere is no doubting this incredible mathematical achievement. But there remain many questions which one must then ask. Did Eudoxus believe that the spheres actually existed? Did he invent them as a geometrical model which was purely a computational device? Did the model accurately represent the way the planets are observed to behave? Did Eudoxus test his model with observational evidence?\nOne argument in favour of thinking that Eudoxus believed in the spheres only as a computational device is the fact that he appears to have made no comment on the substance of the spheres nor on their mode of interconnection. One has to distinguish between Eudoxus's views and those of\nAristotle\nfor as Huxley writes in\n[\n1\n]\n:-\nEudoxus may have regarded his system simply as an abstract geometrical model, but\nAristotle\ntook it to be a description of the physical world...\nThe question of whether Eudoxus thought of his spheres as geometry or a physical reality is studied in the interesting paper\n[\n29\n]\nwhich argues that Eudoxus was more interested in actually representing the paths of the planets than in predicting astronomical phenomena.\nCertainly the model does not represent, and perhaps more significantly could not represent, the actual paths of the planets with a degree of accuracy which would pass even the simplest of observational tests. As to the question of how much Eudoxus relied on observational data in verifying his hypothesis,\nNeugebauer\nwrites in\n[\n7\n]\n:-\n... not only do we not have evidence for numerical data in the construction of Eudoxus's homocentric spheres but it would also be difficult how his theory could have survived a comparison with observational parameters.\nPerhaps it is just too modern a way of thinking to wonder how Eudoxus could have developed such an intricate theory without testing it out with observational data.\nMany of the early commentators believed that\nPlato\nwas the inspiration for Eudoxus's representation of planetary motion by his system of homocentric spheres. These view are still quite widely held but the article\n[\n19\n]\nargues convincingly that this is not so and that the ideas which influenced Eudoxus to come up with his masterpiece of\n3\n-dimensional geometry were Pythagorean and not from\nPlato\n.\nAs a final comment we should note that Eudoxus also wrote a book on geography called\nTour of the Earth\nwhich, although lost, is fairly well known through around\n100\nquotes in various sources. The work consisted of seven books and studied the peoples of the Earth known to Eudoxus, in particular examining their political systems, their history and background. Eudoxus wrote about Egypt and the religion of that country with particular authority and it is clear that he learnt much about that country in the year he spent there. In the seventh book Eudoxus wrote at length on the Pythagorean Society in Italy again about which he was clearly extremely knowledgeable.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}