{
  "nome_completo": "Felix Adalbert Behrend",
  "nome_curto": "Felix Behrend",
  "ano_nascimento": "1911",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Behrend/",
  "lugar_nascimento": "Charlottenburg, Berlin, Germany",
  "lugar_morte": "Richmond, Victoria, Australia",
  "biografia": "Felix Behrend\n's parents were Felix W Behrend and Maria Zoellner. Felix W Behrend had a doctorate and was a mathematics and physics teacher at the Herderschule in Berlin. His son, Felix Junior, also attended the Herderschule in Berlin, showing exceptional talents not only for mathematics but also creative writing. He completed his studies at the\nRealgymnasium\nin\n1929\n. In the same year he entered university and, following the usual German tradition of the time, his student years were spent in more than one university. He studied mathematics and theoretical physics at both the University of Hamburg and the University of Berlin. However, he soon realised that his favourite topics were in pure mathematics and as he progressed he moved towards specialising in this area.\nBehrend studied number theory for his doctorate at the University of Berlin with Erhard\nSchmidt\nas his advisor. He was awarded his doctorate in\n1933\nfor his dissertation\nÜber numeri abundantes\nⓉ\n(\nOn abundant numbers\n)\n. Even before the award of his doctorate he had published three papers on number theory, the first two being\nÜber einen Satz von Herrn Jarnik\nⓉ\n(\nOn a theorem of Jarnik\n)\n(1932)\nand\nÜber numeri abundantes\nⓉ\n(\nOn abundant numbers\n)\n(1932)\n. Of course\n1933\n, the year that Behrend was awarded his doctorate, was also the year that Hitler came to power in Germany. We have not mentioned earlier that the Behrend family were Jewish since it had not seemed particularly significant prior to\n1933\n. However on\n7\nApril\n1933\nthe Nazis passed a law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent, with exemptions for participants in World War I and pre-war officials. This did not affect Behrend directly since he was not in employment at this time, but it quickly affected the family. Behrend's father was, by this time, headmaster of a leading Berlin school and he was first demoted and later dismissed from his post.\nAfter the award of his doctorate Behrend decided to leave Germany and continue his studies away from Nazi influence. He went first to England, where he studied at Cambridge, then moved to Zürich and finally to Prague. In Prague he worked as an actuary in a life insurance company but also undertook research in pure mathematics at the Charles University and was awarded a D.Sc. for his significant contributions in\n1938\n. At this time he published\nÜber Systeme reeller algebraischer Gleichungen\nⓉ\n(\nOn systems of real algebraic equations\n)\nwhich appeared in\nCompositio Mathematica\nin\n1939\n. The Nazi threat which had made him leave Germany in\n1933\nwas by this time making him feel unsafe in Prague. He left Prague in\n1939\n, returning first to Zürich, and then to London in England shortly before the outbreak of World War II.\nLike many Germans who fled from the Nazi threat, he found himself in England which was at war with his native Germany. He continued his work on number theory and published\nOn obtaining an estimate of the frequency of the primes by means of the elementary properties of the integers\nin the\nJournal\nof the\nLondon Mathematical Society\nin\n1940\n. The fact that he was passionately anti-Nazi did nothing to help save him from being interned as an enemy alien in\n1940\nand he was put on the ship the Dunera bound for Australia. He served periods of internment at Hay, Orange and Tatura in Australia. His experiences in Camp\n7\nat Hay during\n1940\n-\n41\nare related in\n[\n2\n]\n. One should not think that internment meant an end to mathematics, for he gave lecture courses at the Camp and prepared some of his younger fellow internees for mathematics examinations at the University of Melbourne.\nAfter his release in\n1942\n, Behrend was appointed as a tutor at the University of Melbourne. He continued his research in number theory and published\nOn the frequency of the primes\nin the\nJournal\nof the Royal Society of New South Wales in\n1942\n. This paper was a continuation of the one he had published in London two years earlier. In the following year he published a paper on a totally different topic. This was\nA polyhedral model of the projective plane\nwhich also appeared in the\nJournal\nof the Royal Society of New South Wales.\nDonald Coxeter\nreviewed the paper, writing:-\nThe author improves upon the work of Merz and Humbert\n(1942)\nby constructing a simpler model of the projective plane in the form of a polyhedron in ordinary space without any singular vertices. There are\n6\nvertices of degree\n3\n,\n6\nof degree\n4\n,\n21\nedges,\n9\nquadrangular faces and one hexagonal face. Six of the quadrangular faces penetrate one another along \"false edges.\" Adequate instructions are given for carrying out the construction in paper or thin cardboard.\nBehrend was promoted to lecturer in the Mathematics Department of the University of Melbourne in\n1943\n, then to senior lecturer in\n1948\n, and finally to associate professor\n1954\n-\n62\n. He maintained his interest in number theory, writing\nOn sets of integers which contain no three terms in arithmetical progression\nin\n1946\n. Two years later he again published on a new topic with his paper\nThe uniform convergence of sequences of monotonic functions\n. In the same year of\n1948\nhe also published\nGeneralization of an inequality of Heilbronn and Rohrbach\nand\nSome remarks on the distribution of sequences of real numbers\n,  with\nSome remarks on the construction of continuous non-differentiable functions\nbeing published in the\nProceedings\nof the\nLondon Mathematical Society\nin the following year.\nIn\nA contribution to the theory of magnitudes and the foundations of analysis\n(1956)\nBehrend characterised the additive semigroup of positive real numbers, the \"magnitudes\" of the title. In the same year in\nNote on the compactification of separated uniform spaces\nhe gave a simple method of obtaining, for any uniform space S, a uniform structure which is totally bounded and compatible with the topology of S. He gave criteria for the uniformizability of a topological space in\nUniformizability and compactifiability of topological spaces\n(1957)\n. His main interest had by now firmly moved from number theory to topology and he is particularly remembered for introducing modern general topology to the University of Melbourne.\nBehrend is commemorated by the 'Behrend memorial lecture in mathematics', established at the University of Melbourne in\n1963\nwith funds provided by his widow.\nFor more information about Behrend's life and details of his outstanding contributions to teaching see his obituary at\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}