{
  "nome_completo": "Ernst Ferdinand Adolf Minding",
  "nome_curto": "Ferdinand Minding",
  "ano_nascimento": "1806",
  "ano_morte": "1885",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Minding/",
  "lugar_nascimento": "Kalisz, Russian Empire (now Poland)",
  "lugar_morte": "Dorpat, Russia (now Tartu, Estonia)",
  "biografia": "Ferdinand Minding\n's father was Gottlieb Minding\n(1781\n-\n1816)\nfrom Breslau who, at the time of Ferdinand's birth, was a lawyer in Kalisz but also a musician who was a librettist. His mother was Modesta\n(\ndied\n1814)\n, the daughter of Johann Valentin von Holst\n(1758\n-\n1841)\n, a lawyer in Riga, and Caroline Colins\n(1758\n-\n1841)\n.\nThe family moved from Kalisz to Hirschberg in Prussian Silesia when Ferdinand was one year old since his father, Gottlieb Minding, was appointed as a judge in that city. Hirschberg is now known as Jelenia Góra and today it is a town in Poland near the Polish-Czech border. The American statesman John Quincy Adams, who later became the sixth President of the United States, visited Hirschberg in\n1800\nand wrote:-\nNothing can be more beautiful than the location of Hirschberg, a beautifully built city with numerous splendid buildings, in a valley surrounded by hills on all sides, with the magnificent view of the Giant Mountains\nFerdinand attended Hirschberg\nGymnasium\n, graduating with his\nAbitur\nin\n1824\n. From there he went to the University of Halle where he studied philology and philosophy for two semesters. At this time it was typical for university students in this part of the world to spend parts of their undergraduate years at different universities and so, after his two semesters at Halle, Minding went to the University of Berlin where he continued his studies attending courses by Georg Wilhelm Friedrich Hegel\n(1770\n-\n1831)\nwho at that time was giving courses on aesthetics, the philosophy of religion, the philosophy of history, and the history of philosophy. He also attended lectures by the historian Leopold von Ranke, who was appointed to Berlin in\n1825\n. Ranke opposed the views of Hegel on the philosophy of history so Minding received an interestingly different approach from these two teachers. He also listened to some lectures on natural sciences and mathematics but he concentrated his studies on philosophy.\nHe graduated from Berlin in\n1827\nand then taught in secondary schools. In\n1828\n-\n29\nhe taught mathematics, history and German at the Gymnasium in Elberfeld. Except for attending a few lectures, Minding had not studied mathematics at university, so how did he become a mathematics teacher? The answer is that he was self taught in mathematics having studied the subject on his own while pursuing other topics at university. While he was a school teacher, he studied for his doctorate in mathematics which was awarded by the University of Halle for his thesis\nDe valore integralium duplicum quam proxime inveniendo\nⓉ\n(\nFinding approximations to a double integral\n)\non approximating the values of double integrals. For someone to reach the level of a doctoral thesis without having been formally taught mathematics is a quite remarkable achievement. Minding published his thesis, having made some minor changes to it, in\nCrelle\n's\nJournal für die reine und angewandte Mathematik\n, as\nÜber die Berechnung des Näherungswertes doppelter Integrale\nⓉ\n(\nOn the calculation of the approximation value of double integrals\n)\n(1830)\n.\nIn\n1830\nMinding became a mathematics lecturer at the University of Berlin where he taught the barycentric calculus as presented in the works of\nAugust Möbius\nand published\nAuflösung einiger Aufgaben der analytischen Geometrie mittels des barycentrischen Calculs\nⓉ\n(\nDissolution of some problems of analytical geometry by barycentric calculus\n)\n(1830)\n. He also gave lectures on\nnumber theory\nwhich he wrote up as a textbook\nAnfangsgrunde der hoheren Arithmetik\nⓉ\n(\nBeginnings of  higher arithmetic\n)\n(1832)\n. Minding announced the publication of his book in\nCrelle\n's\nJournal für die reine und angewandte Mathematik\nin\n1831\nand in his announcement he\n[\n4\n]\n:-\n... described pure number theory as both a necessary foundation for algebra\n(\nwhose basic notion is that of number\n)\nand a paradigm for a rigorously developed, autonomous branch of mathematics.\nIn his book Minding\n[\n4\n]\n:-\n... presents shortened and expurgated version of\n[\nGauss\n's 'Disquisitiones Arithmeticae'\n]\nfocusing on the basic parts of the various sections ... Minding dropped the more delicate part of\nGauss\n's theory of forms\n(\ngenera, composition\n)\n, but added things expected from the perspective of a textbook, for instance, linear\nDiophantine equations\nor\ncontinued fractions\n. He did, however, identify the\nquadratic reciprocity\nlaw as \"the most remarkable theorem of higher arithmetic,\" and, in an historical endnote\n[\non page\n198]\n, stressed rigour: \"\nGauss\n's 'Disquisitiones Arithmeticae' offers a presentation of arithmetic conducted with ancient rigour and distinguished by new discoveries. Among other things an excellent merit of the work lies in the rigorous proof of the reciprocity theorem. Since then the science has been enriched by a non-negligible number of new proofs and results, some of which are to be found in the memoirs of various learned societies, others in mathematical journals, and especially in\nCrelle\n's Journal for Mathematics.\"\nIn addition to teaching at the University, in\n1834\nMinding began teaching at the School of Architecture in Berlin, taking over courses which had been taught up to that time by\nLejeune Dirichlet\n. Minding gave courses of lectures on the theory of curves, on analytical dynamics, and on analysis at the School of Architecture. In\n1836\nhe married Auguste Regler\n(1810\n-\n1889)\nin Berlin. Auguste was the daughter of Carl August Regler and Henriette Kempsky. Ferdinand and Auguste Minding had one son, Karl Bernhard Minding\n(\nborn\n1839)\n, and two daughters. In\n1842\nLejeune Dirichlet\nproposed Minding for election to the\nBerlin Academy of Science\nbut he was not elected at this time and this may have prompted Minding to seek a position away from Berlin. An additional factor in deciding to leave Berlin must have been the fact that he had, on two occasions, attempted to gain promotion to extraordinary professor, both attempts having ended in failure. In the following year,\n1843\n, he left Berlin when he was appointed as professor of mathematics at the University of Dorpat, a post he held for\n40\nyears. We note that Dorpat is today known as Tartu. This university was in a slightly unusual position since Estonia had been controlled by Sweden and by Russia at different periods and, at this time, it was controlled by Russia. However, teaching at the university was in the German language and, although the finance and administration of the university was from Russia, its academic leanings were towards Germany with the majority of the professors being German.\nMoving to Dorpat meant that Minding became a colleague of Karl Eduard Senff\n(1810\n-\n1849)\n. Senff had studied at Dorpat under Martin Bartels, then was appointed to teach there in\n1834\n, and was promoted to professor in\n1837\n. In fact the\nFrenet\n-\nSerret\nformulas should be named after Senff who had them in his thesis\nTheoremata principalia e theoria curvarum et superficierum\nⓉ\n(\nFundamental theorems from the theory of curves and surfaces\n)\nin\n1831\n, sixteen years before\nJean Frenet\n's thesis containing the formulae and\nJoseph Serret\n's work on the topic. Sadly the collaboration between Minding and Senff was relatively short since Senff died in December\n1849\n. However, they were able to jointly supervise the undergraduate studies of\nKarl Mikhailovich Peterson\nwho later wrote his Candidate's Thesis\nÜber die Biegung der Flächen\nⓉ\n(\nOn bending of surfaces\n)\nadvised by Minding. While mentioning Minding's famous students we should include\nAxel Harnack\nwho studied with Minding while an undergraduate but went to Germany for his doctorate.\nAt Dorpat, Minding taught algebra, analysis, geometry,\nprobability\n, mechanics and physics. He\n[\n6\n]\n:-\n... wrote many important works not only on\ndifferential geometry\nbut also in the theory of ordinary\ndifferential equations\n, in analytic mechanics\n(\nanticipating the geometrical treatment later developed by\nBeltrami\nand\nLipschitz\n)\n, in the calculus of variations\n(\nespecially on the isoperimetric problem for curved surfaces\n)\n, etc.\nFrom\n1851\nuntil\n1855\nhe was Dean of the Faculty of Physicomathematics at Dorpat\n[\n1\n]\n:-\nIn\n1850\nthe Faculty of Philosophy\n[\nof the University of Dorpat\n]\nwas divided into that of physicomathematics and that of history-philology, and in\n1851\nMinding was elected to a four-year term as dean of the former division.\nIn\n1864\nMinding and the other members of his family became Russian citizens and, in the same year, he was elected to the\nSt Petersburg Academy of Sciences\n.\nHis work, which continued\nGauss\n's study of\n1828\non the differential geometry of surfaces, greatly influenced\nKarl Peterson\n.\nAdolf Kneser\nsaid of Minding:-\nMinding may be described as the first successor of\nGauss\n, who, though moving along the master's path, has gone in essential points beyond\nGauss\n.\nFor example, in\n1830\nMinding published on the problem of the shortest closed curve on a given surface enclosing a given area. He introduced the 'geodesic curvature' although he did not use the term which was due to\nBonnet\nwho discovered it independently in\n1848\n. In fact\nGauss\nhad proved these results in\n1825\nbefore either Minding or\nBonnet\n, but he had not published them. Minding also studied the bending of surfaces proving what is today called Minding's theorem in\n1839\n. The following year he published in\nCrelle\n's\nJournal für die reine und angewandte Mathematik\na paper giving results about trigonometric formulae on surfaces of constant curvature.\nLobachevsky\nhad published, also in\nCrelle\n's Journal, related results three years earlier and these results by\nLobachevsky\nand Minding formed the basis of\nBeltrami\n's interpretation of hyperbolic geometry in\n1868\n. Victor Katz writes\n[\n5\n]\n:-\nGauss\n's studies were continued by Minding, who was particularly interested in surfaces of constant negative curvature and, in an article in\n1839\n, found the three surfaces of revolution to which they can be applied, among them the surface generated by the revolution of the tractrix around its own asymptote, i.e.,\nBeltrami\n's 'pseudosphere'. In a later article\n(1840)\n, Minding arrived at another interesting result, though without perceiving its important implications. He observed that the trigonometric relations in geodesic triangles of a surface of constant negative curvature could be obtained from the corresponding formulas of spherical geometry on a sphere of radius R by multiplying R by √-\n1\n. While Minding failed to notice that these formulas agree with those for the hyperbolic plane, established by\nLobachevsky\nin his 'Imaginary geometry'\n(1837)\n,\nBeltrami\nwas aware of this fact, which he developed in his 'Attempt'.\nMinding also worked on differential equations, algebraic functions, continued fractions and analytic mechanics. In differential equations he used\nintegrating factor\nmethods. This work won Minding the Demidov prize of the\nSt Petersburg Academy of Sciences\nin\n1861\n. It was further developed by\nA N Korkin\n.\nDarboux\nand\nÉmile Picard\npushed these results still further in\n1878\n.\nFor a list of papers written by Minding, see\nTHIS LINK\n.\nPapers published by Minding from\n1868\nuntil the end of his life include\n(\nwe give English translations of the German or French titles\n)\n:\nProof of a theorem in statics\n(1868)\n;\nA rule of forming denominators and numerators in the representation of a continued fraction by an ordinary fraction\n(1869)\n;\nOn a problem in the probability theory originating from meteor observations\n(1869)\n;\nOn the method of least squares\n(1871)\n;\nOn the mean curvature of surfaces\n(1875)\n;\nOn the curves of shortest circumference on surfaces of revolution\n(1876)\n;\nOn some isoperimetric problems\n(1877)\n;\nTheory of shortest curves on curved surfaces\n(1878)\n; and\nOn the Theory of the shortest curves over rings with given area on curved surfaces\n(1878)\n.\nYou can see the German or French titles in the list of Minding's papers at\nTHIS LINK\n.\nIn\n1882\n, with a rise in nationalistic policies in Russia, a move began to change the University of Dorpat to a Russian institution, both in terms of the language of instruction and the nationality of the professors. It was renamed the University of Yuryev in\n1898\nand, except for a period of German occupation during World War II, it became the University of Tartu in\n1919\nwith teaching in Estonian. Minding retired in\n1883\n, near the start of this change forced on the university. He died two years later.\nAs we mentioned above, Minding was awarded the prestigious Demidov Prize by the\nSt Petersburg Academy of Sciences\nin\n1861\n. He was elected to the\nSt Peterburg Academy of Sciences\nin\n1864\n, the same year in which he took Russian citizenship. He was further honoured by the\nSt Petersburg Academy of Sciences\nin\n1879\nwhen they made him an honorary member.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}