{
  "nome_completo": "Ferdinand Rudio",
  "nome_curto": "Ferdinand Rudio",
  "ano_nascimento": "1856",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rudio/",
  "lugar_nascimento": "Wiesbaden, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Ferdinand Rudio\n's parents were Heinrich Rudio, a public official of the Duchy of Nassau, and Luise Klein, the daughter of a well-known forestry official. At the time that Ferdinand was born, the Duchy of Nassau was an independent region under the rule of the Duke of Nassau having Wiesbaden as its capital. However, in\n1866\n, when Ferdinand was ten years old, the Duke supported Austria in the Seven Weeks' War so, after they lost to Prussia, the district was taken over by Prussia becoming the Hesse-Nassau region of that country. Ferdinand had a good upbringing in a stable, comfortably-off, middle-class family. He attended the\ngymnasium\nin his home town of Wiesbaden, entering in\n1866\n. After four years at the gymnasium, he changed school and completed his education at the Realgymnasium in Wiesbaden from\n1870\nto\n1874\n. This school education gave him an excellent background in foreign languages and in history which would prove important to his future scholarly contributions. He also obtained an excellent education in mathematics and science but this did not immediately make him aim for a career in mathematics for when he left the Realgymnasium his intention was to become an engineer.\nHe entered the Eidgenössische Polytechnikum Zürich in\n1874\nto study civil engineering but, after three semesters in the Engineering Department, he moved to the Mathematics and Physics Department, influenced by the inspirational teaching of\nKarl Geiser\n. It was only in the year before Rudio entered the Polytechnikum that\nGeiser\nhad been appointed to a full professorship of higher mathematics and synthetic geometry, with special responsibility for teaching mathematics to engineering students and to mathematics students. Rudio also had Kurt Culmann\n(1821\n-\n1881)\n,\nWilhelm Fiedler\nand\nHermann Schwarz\nas lecturers. From\n1877\nuntil\n1880\nRudio studied at the University of Berlin where he attended the seminar of\nEduard Kummer\nand\nKarl Weierstrass\n. Advised by these two famous mathematicians, he obtained a doctorate from the University of Berlin with a thesis on\nKummer\n's problem of determining all surfaces of which the centres of curvature form second order cofocal surfaces. He reduced this problem to the problem of solving a\ndifferential equation\n. An abstract of his thesis,\nZur Theorie der Flächen, deren Krümmungsmittelpunktsflächen confocale Flächen zweiten Grades sind\nⓉ\n(\nOn the theory of surfaces whose centre of curvature surfaces are confocal surfaces of the second degree\n)\n(1880)\n, was published in\nCrelle\n's Journal in\n1883\n.\nAfter the award of his doctorate in\n1880\n, Rudio followed the advice of\nKarl Geiser\nand returned to Zürich to work on his\nhabilitation\nthesis. In\n1881\nRudio habilitated at the Eidgenössische Polytechnikum Zürich and became a\nprivatdocent\nthere. The year\n1883\nmarked the centenary of\nLeonhard Euler\n's death and on the\n6\nDecember of that year a small seminar was held in Zürich to celebrate the occasion. Rudio gave a short biographical talk on\nEuler\nat the seminar, an event which in itself was pretty minor but would become much more significant\n25\nyears later when Rudio published the text of his\n1883\ntalk as part of the\n1907\ncelebrations of the\n200\nth\nanniversary of Euler's birth. In\n1885\n, Rudio was promoted to extraordinary professor and, in\n1889\n, he was appointed to a full professorship of mathematics. He was to hold this professorship until he retired in\n1928\n. He married Maria Emma Müller, the daughter of Carl Wilhelm Nepomuk, in\n1888\n. Maria was from Rheinfelden, near Basle on the Swiss-German border; Ferdinand and Maria Rudio had three daughters.\nRudolf Wolf\n, the professor of astronomy at the Eidgenössische Polytechnikum Zürich and director of the Zürich Observatory, also held a role as director of the Eidgenössische Polytechnikum library. He died in December\n1893\nand, in\n1894\n, Rudio was appointed to fill this position as head of the library. He played an important role in bringing the library up-to-date and continued in this role for\n25\nyears. Over the first few of these years he managed the complete renovation of the library that was newly opened in\n1900\n.\nThe first International Congress of Mathematicians was held at the Eidgenössische Polytechnikum Zürich from\n9\nto\n11\nAugust\n1897\n. The chairman of the organising committee was\nKarl Geiser\n, who was elected president of the Congress, and Rudio was one of the two secretaries. Rudio made a report to the opening session of the Congress in which he said\n[\n2\n]\n:-\nIt suffices to consult the program or to glance at this room to agree that the congresses already would be justified even if they did not have any other goal than of offering the mathematicians of all the countries of the world the occasion to talk sincerely and to share ideas. The personal relations and the progresses that directly or indirectly report to science are always one of the primary targets of any scientific meeting.\nThis address by Rudio to the opening session of the first ever International Congress of Mathematicians, entitled\nOn the object and organization of international congresses\n, contained much of importance, as Curbera explains in\n[\n2\n]\n:-\nFerdinand Rudio, one of the Swiss organizers of the congress, listed the new directions opened by the congress, which needed international agreements. They included the issue of unifying mathematical terminology and units, as had been done recently by the physicists with the volt, the ampere, and the ohm. There was also the need for an international literary journal for mathematics; the 'Jahrbuch über die Fortschritte der Mathematik'\nⓉ\n(\nYearbook on the progress of mathematics\n)\nhad been in publication since\n1868\n, and the 'Repertoire Bibliographique des Sciences Mathématiques'\nⓉ\n(\nBibliographic directory of Mathematical Sciences\n)\nsince\n1885\n, but they were slow in delivering the information on the developments of a science producing many more results at a much faster speed. He also mentioned the need for a general classification of mathematics that would help the bibliographic effort. He pointed out that the list of participants of the congress should be seen as the starting point of an international directory of mathematicians, where one could find addresses and field of speciality of all mathematicians in the world\n(\nthis idea had to wait until\n1958\nwhen the first World Directory of Mathematicians appeared\n)\n. Rudio complemented this idea with the proposal of creating a biographical dictionary of current mathematicians, which would include portraits of the most important. Rudio summarized all projects in a lemma: \" Viribus unitis! sei unsere Losung\".\n(\n\"United our forces! This is our watchword.\"\n)\n.\nThis address by Rudio is contained in the proceedings of the Congress which Rudio edited. It was published with the title\nVerhandlungen Des Ersten Internationalen Mathematiker-Kongresses in Zürich Vom\n9\n. Bis\n11\n. August\n1897\n.\nJames Pierpont\nreviews the volume in\n[\n7\n]\n:-\nThe Zürich congress will always possess an especial interest as the first international congress. The present stately octavo volume is the official report of the same, prepared by Professor Rudio, one of the two general secretaries. The first eighty pages recount in an agreeable manner the events of the congress and are very interesting reading. The address of welcome by the president, Professor\nGeiser\n, and the paper by Professor Rudio \"On the object and organization of international congresses\" are given in full. ... The remaining\n225\npages are devoted to the scientific addresses and papers read at the congress.\n...\nMathematicians will be grateful to Professor Rudio for this very complete and attractive report. The book contains so much of general interest that it will be welcome to all.\nRudio worked on\ngroup theory\n, algebra and geometry. His best known publication in these areas is his classic textbook\nDie Elemente Der Analytischen Geometrie\nⓉ\n(\nElements Of Analytical Geometry\n)\n(1908)\n. He is best remembered, however, for his work in the history of mathematics, in particular he wrote a major work on\nsquaring the circle\n,\nDer Bericht des Simplicius über die Quadraturen des Antiphon und des Hippokrates\nⓉ\n(\nAccount of Simplicius on the quadratures of the antiphon of Hippocrates\n)\n(1902)\n, and he also wrote biographies of mathematicians, for example he published important papers on\nGotthold Eisenstein\n. One of his most important contributions to mathematics was editing the collected works of\nEuler\n. Rudio proposed the project in\n1883\nsince this was the centenary of\nEuler\n's death. He continued to advocate the importance of this project and at the International Congress of Mathematicians at Zürich in\n1897\nhe suggested it would be a suitable memorial for the year\n1907\nwhich was the bicentennial of\nEuler\n's birth. Andreas Kleinert and Martin Mattmüller write in\n[\n5\n]\n:-\nFerdinand Rudio had untiringly lobbied for an initiative that ultimately turned out to be successful. On every occasion, and most particularly at the First International Congress of Mathematicians, which was held at Zürich in\n1897\n, Rudio had urged the worldwide community to honour its obligations toward the great scientist by undertaking the edition of\nEuler\n's complete works. When the city of Basel commemorated Euler's\n200\nth\nbirthday in\n1907\n, Rudio delivered a thrilling speech in which he appealed to Swiss patriotism and to international solidarity in favour of an edition of\nEuler\n's works: \"Switzerland will always be grateful to the academies of Berlin and St Petersburg for having given our\nEuler\n, to whom his native country was too narrow, the opportunity to perform his outstanding work\". He addressed his speech in particular to the representatives of the Swiss Naturalist Society\n(\nSchweizerische Naturforschende Gesellschaft\n, SNG, now the\nSwiss Academy of Natural Science\n, SCNAT\n)\nand to the representatives of the academies of Berlin and St Petersburg who assisted at the ceremony.\nThe project was not approved until\n1909\n, twenty six years after Rudio first proposed it. Andreas Speiser writes in\n[\n11\n]\n:-\nThe Swiss Society of Natural Sciences\n(\nSchweizerische Naturforschende Gesellschaft\n)\nat its annual meeting in Glarus on August\n31\n,\n1908\n, created the\nEuler\nCommission to edit the Collected Works of\nLeonhard Euler\n, in conjunction with the Central Committee. On September\n6\n,\n1909\n, the same Society decided on \"the edition of the Collected Works of\nLeonhard Euler\nin the original languages, convinced of rendering the entire scientific world a service thereby.\"\nRudio was appointed general editor for the project. He edited two volumes himself, namely\nLeonhard Euleri Opera Omnia: Series Prima: Commentationes Arithmeticae -\n1\nst\nPart\nⓉ\n(\nComplete works of Leonhard Euler: Commentaries on arithmetic: First part:\n)\n(1915)\nand\nLeonhard Euleri Opera Omnia: Series Prima: Commentationes Arithmeticae -\n2\nnd\nPart\nⓉ\n(\nComplete works of Leonhard Euler: Commentaries on arithmetic: Second part:\n)\n(1917)\n. He collaborated in the editing of three more. In fact he supervised the production of over\n30\nvolumes in his role as general editor. The authors of\n[\n3\n]\nwrite:-\nAs managing editor he was also responsible for all the correspondence about the edition, as well as for the \"contracts with the editorial staff.\" He had been able to acquire all of\nEuler\n's published writings and each editor received the \"manuscript of his volumes from Rudio already put together, so that the editor's work was only a matter of looking through the whole and perhaps making remarks in the margins.\" The final responsibility lay with the managing editor.\nNote that the quotes within this quotation are from page\n162\nof\n[\n10\n]\n.\nIn recognition to his outstanding contributions to mathematics, particularly to Swiss mathematics, he was awarded an honorary doctorate by the University of Zürich in\n1919\n. He continued to teach at the Eidgenössische Technische Hochschule\n(\nas the Eidgenössische Polytechnikum Zürich was renamed in\n1911)\nuntil\n1928\nand he also continued to manage the Euler project until this same date. He was forced to retire at this time due to poor health and indeed he died in the following year. In\n[\n3\n]\nhis contributions are summarised as follows:-\nAs a professor of mathematics at the Eidgenössische Technische Hochschule\n(\nETH\n)\n(\nSwiss Federal Institute of Technology\n)\nin Zürich, head of the library, a leading member of the GeP Society\n(\nan alma mater organisation of former \"Polytechnicians,\"\n)\nand a member of the lectures' association of both the University and the Polytechnic\n(\nthe representative body of the popular \"Town Hall Lectures\" in Zürich\n)\n, as well as editor of the Zürcher Naturforschende Gesellschaft\n(\nZürich Natural Sciences Society\n)\n, Ferdinand Rudio greatly influenced the scientific culture of his chosen country of adoption. He achieved lasting fame, however, as an historian of mathematics, above all through his persistent efforts which led to the publication of\nLeonhard Euler\n's 'Opera omnia'\n(\nComplete Edition\n)\n.\nWe note that he was president of the\nZürich Natural Sciences Society\nediting their quarterly journal from\n1893\nto\n1912\n. He also wrote\nGeschichte der Naturforschenden Gesellschaft\n1746\n-\n1896\n, an important article to celebrate the\n150\nth\nanniversary of the founding of the Society.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}