{
  "nome_completo": "Ferenc Radó",
  "nome_curto": "Ferenc Radó",
  "ano_nascimento": "1921",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rado_Ferenc/",
  "lugar_nascimento": "Timişoara, Romania",
  "lugar_morte": "Cluj, Romania",
  "biografia": "Ferenc Radó\nwas born into a Jewish family in Timișoara. The city had been occupied by Serbia in\n1919\nbut, in the following year, it was allotted by the Treaty of Trianon to Romania. It was therefore a Romanian city when Ferenc was born and it was in Timișoara that he grew up. He attended Jewish primary and secondary school in the city, including the Jewish Lyceum. He was an outstanding pupil who showed his extraordinary potential when he was ranked third out of over one thousand students seeking university entrance in\n1939\n. He entered the Engineering School in Bucharest in that year but his outstanding progress suddenly came to an end. To understand quite how this came about we need to look at the political situation that had been developing in Romania, particularly looking at how the small Jewish minority in Romania were treated.\nIn eastern Europe, anti-Semitism became widespread in Poland, Hungary, and Romania in the years following World War I. The Jewish community, which formed\n4\n.\n2\npercent of Romania's population in\n1930\n, was subject to discrimination, as anti-Semitism was widespread. Carol II had acceded to the throne in\n1930\nbut the world economic depression caused hard times for the whole population. The Iron Guard was a Romanian fascist organization that fed on anti-Semitism and mystical nationalism. It grew in strength as the economy of the country collapsed but it was suppressed after King Carol II proclaimed a dictatorship in\n1938\n. Despite the ups and downs of the Iron Guards, acts of violence against Jews were rare until the outbreak of World War II. King Carol's position became untenable after Russia, Hungary and Bulgaria captured parts of Romania between June and September of\n1940\n. The Iron Guards returned to a position of power and members of the organisation joined General Ion Antonescu in ruling the country from\n1940\n. A Romanian alliance with Nazi Germany strengthened the hand of the anti-Semites and the country turned on its Jewish citizens. Radó, just having commenced his university course, was prevented from continuing with his university studies.\nWorse was to follow for the nineteen year old student. He was sent to a labour camp where he was forced to spend three years\n[\n1\n]\n:-\nConditions were terrible, nevertheless he created possibilities for himself to study mathematics, usually hidden behind heaps of excavated earth.\nBy\n1944\nAntonescu, who ruled the country as a dictator, realised that Germany would lose the war. He, and the democratic opposition in Romania, feared invasion by Russia. On\n23\nAugust\n1944\nAntonescu was overthrown and a new government committed to the Allied war effort against Germany was formed. Russia invaded a week later and there was a number of years of political uncertainty. As far as Radó was concerned, however, the new government proved beneficial for he was allowed to continue his education. He began again his university studies, this time at the University of Cluj. He graduated in\n1946\nwith a degree which qualified him to teach mathematics at secondary schools in Romania. He returned to his home city of Timișoara where he was appointed to teach mathematics at the Jewish Lyceum where he himself had been a student. By\n1948\nthe Communists were in power in Romania, supported by Russian military power, and the school system was nationalised as the communist leaders laid the foundations of a totalitarian regime. Following the educational reforms, Radó taught at a state school in Timișoara. He also taught for a year at the new Pedagogical Institute in the city. In\n1950\nhe was appointed to the University of Cluj. Let us look now at changes that occurred within that institution over the next few years.\nCluj\n(\nknown also by its German name, Klausenburg, and its Hungarian name, Kolozsvár\n)\nhad, with the rest of Transylvania, been incorporated into Romania in\n1919\n, two years before Radó was born. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n.\n(\nThe Hungarian university in Cluj moved first to Budapest, then to Szeged.\n)\nIn\n1940\n, Hungary captured the part of Romania containing Cluj, the Hungarian university was moved back from Szeged to Cluj, and the Romanian university in Cluj moved to Sibiu and Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. It was here that Radó had studied for his degree, gaining his teacher's qualification in\n1946\n. Parts of the Hungarian university in Cluj moved back to Szeged, while that part which remained in Cluj was named the Bolyai University\n(\nafter\nJános Bolyai\n)\n. In\n1959\nthe Babeș University and the Bolyai University in Cluj joined to became the Babeș-Bolyai University and Radó continued to teach there. He was promoted to full professor of mathematics at the Babeș-Bolyai University of Cluj in\n1969\nand he held this position until he retired in\n1985\n.\nLet us now look briefly at Radó's mathematical contributions. First we note that as well as publishing under the name Ferenc Radó, he also published papers under the names Francisc Radó and François Radó. His first paper\nRemarks on an infinite linear system\n(\nRomanian\n)\nwas published in\n1953\n. In\n1955\nhe gave a course on nomography to engineers and technicians. This was published as\nLectures on nomography\n(\nRomanian\n)\nin the following year. D Mazkewitsch writes in a review:-\nTreated are: Nomograms for equations with two variables, with three variables\n(6\ntypes\n)\n, order and class of nomograms, nomograms with several variables, projective and homographic transformation of nomograms, classification of nomograms.\nAll nomograms are constructed from determinants. No geometric constructions are given. The presentation is good and well illustrated by solved examples ...\nNomography played an important part in his research during the first part of his career. He published papers such as the following written in Romanian:\nTwo theorems concerning the separation of variables in nomography\n(1955)\n;\nOn rhomboidal nomograms\n(1956)\n;\nThe best projective transformation of the scales of alignment nomograms\n(1957)\n; and\nFunctional equations in connection with nomography\n(1958)\n.\nAfter this Radó's interests turned towards the algebraic foundations of geometry. He studied\n[\n1\n]\n:-\n... embedding conditions of a semi-web into a\nReidemeister\nweb. He continued with non-injective collineations of two Desarguesian projective planes, which led him to ring geometry. ... he became interested in characterising isometries of metric vector spaces with as weak assumptions as possible. He also obtained remarkable results in mathematical programming.\nOn this latter topic we mention his contributions in\n1963\nwhen he introduced the \"branch and bound\" technique to solve the disjunctive programming problem. E Balas writes in a review:-\nThe basic principle of the branch and bound technique devised by Land and Doing for the integer programming problem and adapted by Little, Murty, Sweeney, and Karel for solving the travelling salesman problem, is rediscovered here independently, stated in a more general form and used to solve a very important problem: liner programs with logical constraints ...\nFinally we note Radó's contributions as on the editorial board of the\nJournal of Geometry\nand\nAequationes Mathematicae\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}