{
  "nome_completo": "Ferran Sunyer i Balaguer",
  "nome_curto": "Ferran Sunyer",
  "ano_nascimento": "1912",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sunyer/",
  "lugar_nascimento": "Figueres, Girona, Spain",
  "lugar_morte": "Barcelona, Spain",
  "biografia": "Ferran Sunyer\n's parents were Ricard Sunyer i Molinas\n(1884\n-\n1914)\n, a medical doctor, and Àngela Balaguer i Masdevall\n(1890\n-\n1955)\n. Maria Carbona i Balaguer, Àngels Carbona i Balaguer and Ferran Carbona i Balaguer\n(1909\n-\n1979)\nwere first cousins of Ferran Sunyer who were orphaned at a young age and brought up by Àngela Balaguer. Perhaps saying they were orphaned is not quite true since their father had deserted the family making no provision for his wife and children. His wife, Clara Balaguer, the only sister of Àngela Balaguer, died of tuberculosis shortly after this. Ferran Carbona was three years older than Ferran Sunyer, the subject of this biography. He went on to become a chemical engineer who had left-wing views and fought for the Republicans during the Spanish Civil War. This, we will see, is not irrelevant to a later positive episode in Ferran Sunyer's life.\nRicard Sunyer had died of tuberculosis, a few months before the death of Àngela's sister, when his son Ferran was only two years old. Ricard Sunyer had followed the family tradition of becoming a physician, having a father and grandfather who were also doctors. The family were well off and owned land in Vilajoan, south of Figueres, a town near the south coast of Spain about\n20\nkm from the border with France.\nFerran Sunyer was born with a severe motor disability which soon became apparent. His doctors thought the young child would not live but, although severely physically disabled, it quickly became clear that the young child was not mentally disabled. However, the doctors recommended that he should not be educated since the strain might prove fatal. Anyway, they said, what was the point of educating a child who was so severely disabled that he would never be able to do anything.\nFerran's mother was very surprised to discover that when he reached the age of four he was able to read. Although nobody had tried to teach him, the young child had been able to learn by himself. From this time on his mother decided that she would ignore the advice of the doctors and educate her son herself. There would have been no possibility of Ferran attending school. He could not eat himself, he could not move unless wheeled around by family members in a wheelchair and, although he did learn to speak, it was only something he did with the greatest difficulty. Certainly no school at this time would have been able to cope with such a severely disabled child. The family moved to Barcelona where Sunyer lived for the rest of his life. However, he did love to spend time during the summers on the estate in Vilajoan.\nWe have said that Sunyer was educated by his mother but as she knew no mathematics we need to try to understand how this severely disabled boy developed into what many consider to be the leading Spanish mathematician of his day. He was totally self-educated without the assistance of anyone who knew any mathematics. Antoni Malet writes in\n[\n4\n]\n:-\nWhen the Sunyer i Balaguer family moved to Barcelona, it is very likely that Ferran Sunyer studied mathematics and experimental science from the notes and textbooks of his cousin Ferran Carbona, who earned a degree in chemical engineering. Sunyer had practically no use of his hands. With time he learned to pick up sheets of paper that he could move on the desk. On a normal working day, in the morning he was left in his room with his books open and the articles laid out that he wished to read. He worked mentally. Occasionally, when he wanted to remember a formula or a partial result, he dictated it. While his mother was alive, she, who knew absolutely nothing about mathematics, would carefully copy those formulas in a notebook; after her death, his cousins continued the practice. That notebook full of formulas was the only tool Sunyer used in his work. When he had an article ready, 'finished in his head', he dictated the text, inserting in it formulas from the notebook.\nIn\n1933\nhe read the seventh edition of\nJoseph Alfred Serret\n's\nCours d'algèbre supérieure\nⓉ\n(\nHigher algebra course\n)\nwhich, we must assume, his cousin had borrowed for him from the library of the University of Barcelona. Discovering an error on the book, Sunyer found a correct proof and, in early\n1934\n, sent a short paper to\nÉmile Picard\nwho was the secretary of the\nAcadémie des Sciences\nin Paris. A covering letter explained that Sunyer hoped that the paper might be published but, if that was not possible, perhaps he might receive an opinion on it.\nPicard\n(\nwho was\n77\nyears old at this time\n)\nnever replied to Sunyer and this might have dispirited anyone with less determination but, despite the difficulties he worked under, it did not prevent him from continuing to undertake research.\nIn December\n1938\nSunyer made another attempt to have a paper published. In fact he had written two papers and he sent them to\nJacques Hadamard\nwith the following letter, the original version of which, with its errors in the French, is given in\n[\n4\n]\n:-\nMonsieur\nJacques Hadamard\n,\nParis.\nSir: I send you enclosed two original notes, if you think them sufficiently interesting please be so kind as to communicate them to the\nAcademy of Sciences\n. In any case, I would be infinitely grateful to your extreme kindness if you allowed me to know your authoritative and always valuable opinion, which, because my training has been undertaken completely by self-study, would be of even greater usefulness for me. The war of invasion that the Iberian people are suffering has not allowed me to obtain all the works and memoirs that I would desire. Therefore excuse me, Sir, if you find any fault in the references in these notes.\nWith all my anticipated thanks, I send you, Sir, the assurance of my esteem most marked by admiration.\nHe got a very positive and encouraging reply from\nHadamard\nwho arranged for one of his papers,\nSur une classe de transformations des formules de sommabilité\nⓉ\n(\nOn a class of transformations of summable formulas\n)\n, to be published in the\nComptes Rendus\nof the\nParis Academy of Sciences\n. It was published in\n1939\nand in it Sunyer constructed a class of methods of analytic continuation. When we say that he received a reply from\nHadamard\nwe should note that he received it indirectly since Barcelona was captured by Franco's forces in January\n1939\nand\nHadamard\n's letter never reached him. However, Sunyer's cousin, Ferran Carbona, had fled to Paris so that he could continue to support the Republican forces using his chemical knowledge to manufacture ammunition.  He was able to get news to Sunyer regarding\nHadamard\n's response in which he encouraged Sunyer to continue to undertake research.\nIn the same year,\n1939\n, Sunyer's first paper in Spanish was published, namely\nOn a theorem of Professor Picard\n(\nSpanish\n)\n, in which he proved the \"little\"\nPicard\ntheorem by applying the theory of normal families in a new way. This paper was reviewed for\nMathematical Reviews\nby\nRalph Philip Boas Jr\nso, at this early stage,\nBoas\nbecame familiar with Sunyer's work. In\n1942\nSunyer published\nOn some results concerning the theorems of Picard, Landau and Schottky and on a criterion of quasinormality\n(\nSpanish\n)\n. In this paper, using a theorem of\nRolf Nevanlinna\n, Sunyer proved a result about meromorphic functions, proved a criterion for quasi-normality of a family of meromorphic functions, and, deduced from this extensions of\nLandau\n's theorem and\nSchottky\n's theorem. This paper was also reviewed for\nMathematical Reviews\nby\nRalph Philip Boas Jr\nbut, because at this time he was working for the military, he published the review under the name E S Pondiczery.\nWhen Germany invaded France in\n1940\nHadamard\nfled the country and went to the United States where he had a temporary position at Columbia University in New York. Sunyer lost contact with him at this time and it was only after\nHadamard\nhad spent a year in England and returned to Paris as soon as the war ended that he was able to resume contact sending him a memoir on lacunary\nTaylor series\n. This renewed contact, begun in\n1946\n, was extremely important to Sunyer since\nHadamard\nput him in contact with\nSzolem Mandelbrojt\n. He advised Sunyer on improvements to his mathematical style and also improvements to his French. Two notes with results from the memoir on lacunary\nTaylor\nseries were quickly published. They were both called\nSur la substitution d'une valeur exceptionnelle par une propriété lacunaire\nⓉ\n(\nOn the substitution of an exceptional value by a lacunary property\n)\n(1947)\n. Sunyer continued to publish papers such as\nOn a class of transformations of the algorithms for summation of analytic series\n(\nSpanish\n)\n(1948)\n,\nOn the exclusion of an exceptional function by a gap condition\n(\nSpanish\n)\n(1948)\n,\nUne généralisation des fonctions presque-périodiques\nⓉ\n(\nA generalization of the almost-periodic functions\n)\n(1949)\n,\nA new generalization of almost periodic functions\n(\nCatalan\n)\n(1949)\n, and\nProperties of entire functions\n(\nof finite order\n)\nrepresented by lacunary Taylor series\n(\nSpanish\n)\n(1949)\n. These led to his being awarded the Agell Prize by the Academy of Barcelona in\n1947\nand\n1948\n, then a prize by the province of Zaragoza in\n1950\n.\nThe Consejo Superior de Investigaciones Científicas\n(\nCSIC\n)\n, a similar body to the French Centre National de la Recherche Scientifique\n(\nCNRS\n)\n, was set up following the Spanish Civil War. It followed the principles of the Franco regime, was politicised and emphasised applied research. Sunyer applied for a position in the CSIC in January\n1948\n. He was given a temporary position with a very small stipend.\nRey Pastor\naccepted a position at CSIC and invited\nErnest Corominas\nto join him at the CSIC so, in\n1952\n,\nCorominas\n, who had left Spain when Barcelona fell to Franco's army, returned to Barcelona taking up a position at the CSIC. Sunyer and\nCorominas\nproduced a remarkable result published in two joint papers in which they proved:-\nIf f\n(\nx\n)\nis infinitely differentiable, and some derivative\n(\nof order depending on x\n)\nvanishes at each x, then f\n(\nx\n)\nis a polynomial.\nThey announced this result, and other related results, in\nSur des conditions pour qu'une fonction infiniment dérivable soit un polynome\nⓉ\n(\nOn conditions for an infinitely differentiable function to be a polynomial\n)\nbut the full proof appears in the Spanish paper\nConditions for an infinitely differentiable function to be a polynomial\n. Both papers were published in\n1954\n.\nLet us record at this point how the three women, first Sunyer's mother\n(\nshe died in\n1955)\nand then his two cousins, cared for him and gave him the opportunity to undertake mathematical research. Every day they had to lift him from his bed to his chair, wash and clothe him, feed him and give him the materials he wanted to read. However, despite this one should not think that he was permanently confined to his home. He spent the summers in Vilajoan where he enjoyed being taken into the countryside. He was also taken to mathematics conferences and attended the annual meetings of the Spanish Mathematical Society. He attended the Réunion des Mathématiciens d'Expression Latine in Nice in\n1957\nwhere he talked with\nSzolem Mandelbrojt\nand said he would like to meet\nWacław Sierpinski\nsince he had discovered an error in a proof in\nSierpinski\n's book\nHypothèse du continu\nⓉ\n(\nThe continuum hypothesis\n)\nwhich had been published in\n1934\n.\nMandelbrojt\nwas somewhat reluctant but, with Sunyer determined to talk to\nSierpinski\n, the meeting took place. As a result\nSierpinski\npublished a note in which he wrote:-\nRegarding the following proof, M Sunyer Balaguer has noted that it is not correct ...\nStanisłas Saks\nwas killed by the Gestapo in November\n1942\nand his manuscripts no longer exist. I myself lost my library and my archives in the flames in\n1944\n. It is therefore impossible to determine today what was the proof of\nS Saks\n. In any case it is remarkable that thanks to M Sunyer Balaguer, the error has been found\n23\nyears after the appearance of the first edition of my book.\nDespite only being able to speak with great difficulty, Sunyer was able to lecture at conferences. He did this by simply talking to the audience while someone assisted by writing formulas on the blackboard. This could result in a publication, written up by one of the mathematicians attending the conference.\nThrough\nMandelbrojt\n, Sunyer had been put in contact with\nArchibald James Macintyre\naround\n1956\n. At this time\nArchibald Macintyre\nwas in Aberdeen but their correspondence continued after\nArchibald Macintyre\nand his wife were appointed to the University of Cincinnati in the United States in\n1958\n. In the following year\nMacintyre\ninvited Sunyer to make a research visit to the United States in exchange for an American researcher visiting Barcelona. Sunyer was keen make the visit but, sadly, the University of Barcelona and CSIC both rejected his application. He was, however, able to attend further conferences abroad such as in Florence, and an harmonic analysis meeting in Oberwolfach in\n1965\n.\nWe mentioned above that\nRalph Philip Boas Jr\nwas familiar with Sunyer's work and it is worth recording that he was so taken with the\n1954\nresult of\nCorominas\nand Sunyer quoted above that he wrote a whole book around it, namely\nA primer of real functions\n(1960)\n. I S Gál writes\n[\n3\n]\n:-\nLong before this book was published Professor\nBoas\ntold me of his plans to write a new Carus monograph on a less specialized topic than those presented in the last few volumes. He had already decided to write a first introduction to real variable theory and in order to have a guiding line he planned to include everything which is necessary to formulate and prove\n[\nthe\n1954\nresult of\nCorominas\nand Sunyer\n]\n.\nDespite his severe disability, Sunyer became more integrated into the mathematical community as the years went on and several mathematicians would visit him in his home in Barcelona. We also note that, during the last five years of his life\n1962\n-\n67\n, he held research grants from the Office of Naval Research of the United States Navy. His application for these grants had been strongly supported by\nBoas\n. However, he was always marginalised within the Spanish mathematical community. Antoni Malet suggests\n(\nsee\n[\n4\n]\nand\n[\n5\n]\n)\nthat this was partly due to his disability and partly due to his insistence on promoting the Catalan language and Catalan spelling in his writings. It was not until one month before his death that Sunyer was promoted to Scientific Researcher in CSIC.\nAfter his death, his cousins Maria Carbona i Balaguer and Àngels Carbona i Balaguer created the Foundation Ferran Sunyer i Balaguer in\n1983\n. This Foundation was  integrated into the Institut d'Estudis Catalans in\n1991\n. From\n1993\nThe Ferran Sunyer i Balaguer Prize has been awarded for a mathematical monograph of an expository nature presenting the latest developments in an active area of research in Mathematics.\nWe end our biography by quoting from Victor Pambuccian's review of\n[\n1\n]\nwhere he gives a good summary of Sunyer's mathematical contributions\n(\nsee\n[\n6\n]\n)\n:-\nThe bulk of his work, published between\n1939\nand\n1970\n, is on topics in the theory of entire and meromorphic functions, where his main tendency is that of generalizing important results, and is grouped in the volume under review into eight sections:\n(\ni\n)\n\"miscellaneous papers\", one of which contains generalizations of the theorems of\nLandau\n,\nSchottky\n,\nPicard\n, and of\nMontel\n's normality criterion, another on a new method for the summation of power series, but also a paper that falls entirely outside of the realm of analysis\n(\nto which all other papers are devoted\n)\n, answering a question raised by\nSierpinski\nin\n1951\non order types;\n(\nii\n)\nand\n(\niii\n)\n, spread over\n220\npages, the study of exceptional values of an entire function as influenced by the lacunarity of the\nTaylor\n(\nor\nDirichlet\n)\nseries defining it,\n(\nii\n)\ncontaining F Sunyer i Balaguer's 'Acta Mathematica' paper of\n1952\n;\n(\niv\n)\nwork on the behaviour of an entire function and its derivatives and primitives along\nBorel\n-\nValiron\ndirections of maximal type;\n(\nv\n)\ngeneralizations of\nS Mandelbrojt\n's fundamental inequality\n(\nvi\n)\ntopics in the theory of entire functions and overconvergence;\n(\nvii\n)\ngeneralizations of quasi-periodic and elliptic functions;\n(\nviii\n)\ndifferentiable functions of a real variable, containing a lovely result\n(\nthe only one with a co-author,\nE Corominas\n)\npublished in\n1954)\n...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}