{
  "nome_completo": "Florian Cajori",
  "nome_curto": "Florian Cajori",
  "ano_nascimento": "1859",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cajori/",
  "lugar_nascimento": "St Aignan (near Thusis), Graubünden, Switzerland",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Florian Cajori\n's father, Georg Cajori, was an engineer. He built roads and bridges in Switzerland which, given the mountainous country, required great skill and expertise. Florian's mother was Catherine Camenisch. Florian attended schools in Switzerland, first in Zillis, which lies about seven kilometres south of Thusis, and then in Chur, the capital of Graubünden canton in eastern Switzerland.\nCajori emigrated to the United States in\n1875\nwhen he was sixteen years old. He entered the State Normal School in Whitewater, Wisconsin in\n1876\nand graduated two years later. Cajori did not enter university immediately after graduating, but he taught in a country school before beginning his studies of mathematics at the University of Wisconsin. After being awarded a B.S. from Wisconsin in\n1883\n, he entered Johns Hopkins University in January\n1884\n. Having studied for about eighteen months at Johns Hopkins, Cajori left in June\n1885\nand was awarded his Master's degree by the University of Wisconsin the following year.\nAfter leaving Johns Hopkins University, Cajori was appointed as assistant professor at Tulane University in New Orleans in\n1885\neven before receiving his Master's degree. He became professor of applied mathematics at Tulane in\n1887\n. He held the chair of physics at Colorado College in Colorado Springs from\n1889\nto\n1898\nand during this time, in\n1890\n, he married Elizabeth G Edwards; they had one son. Also during this time, in\n1894\n, he was awarded his doctorate from Tulane University.\nCajori held the chair of mathematics at Colorado College from\n1898\nuntil\n1918\n, being Dean of the Department of Engineering for the last fifteen years of his time at Colorado Springs. He was appointed to a specially created chair in the history of mathematics at the University of California at Berkeley in\n1918\n. This was the first chair in the history of mathematics to be founded in the United States and it says much of Cajori's high reputation that a special chair was created at this leading university.\nAs he approached the age of seventy his health began to fail. He underwent a major operation in February\n1930\n, never made a full recovery and died at his home in Berkeley six months later.\nWe must now examine a little of the contribution which Cajori made to the history of mathematics to understand his high international reputation in the subject which gained him many honours in his lifetime but the somewhat less regard in which he is held by historians of science today. Before looking at his main work on the history of mathematics, let us first note that he did write some textbooks which were not historical texts such as\nAn introduction to the modern theory of equations\n(1904)\nand\nElementary algebra: First year course\n(1915)\n. He did not carry out research into any area of mathematics other than its history.\nCajori wrote many historical books and we shall make some comments on a few of them. An early book was\nThe teaching and history of mathematics in the United States\n(1890)\nwhich profiles twenty-two American institutions. This interesting work shows a major trend towards graduate study and research in these institutions. The book is examined in detail in\n[\n7\n]\n.\nPerhaps the book which first brought Cajori fame was\nA History of Mathematics\n(1894\n,\n2\nnd\ned.\n1919)\n. We\n[\nEFR and JJOC\n]\nhave a copy of this book and it is still a good book to consult. It was literally the first book to attempt to present the history of mathematics in a popular and readable fashion and indeed it was highly successful in its aims.\nA History of Mathematical Notations\n,\n2\nvolumes\n(1928\n-\n29)\nis undoubtedly Cajori's greatest work. Zund writes in\n[\n8\n]\nthat it:-\n... is simply monumental and remains unsurpassed in its detail and meticulous scholarship ...\nAfter Cajori's death\nSir Isaac\nNewton\n's \"Mathematical principles\" of Natural Philosophy and His System of the World\nwas published in\n1934\n. Cajori makes very clear his aim in producing this edition of\nNewton\n's\nPrincipia\nwhich was to make the text readable to modern readers by replacing the archaic language used in the existing English translations of\nNewton\n's Latin text. However\n[\n8\n]\n:-\nHis \"improved\" language was based on a modernisation of the\n1729\nMotte translation - without reference to\nNewton\n's Latin edition - and contains numerous errors and deviations from the original meaning. Likewise, his modernisation of the technical language was incomplete and not entirely consistent. Hence, his presentation of\nNewton\nneither faithfully serves the modern reader nor the historian of science with regard to Newton's original thoughts.\nCajori wrote about twelve books and a large number of papers and reports on the history of mathematics. Among his other contributions are\nA History of Elementary Mathematics with Hints on Methods of Teaching\n(1896)\n,\nA History of the Logarithmic Slide Rule and Allied Instruments\n(1909)\n,\nWilliam\nOughtred\n, a Great Seventeenth- Century Teacher of Mathematics\n(1916)\n, and\nEarly Mathematical Sciences in North and South America\n(1928)\n.\nAlthough we have made indicated that at times Cajori's work lacked the scholarship which one would expect of such an eminent scientist, we must not give too negative an impression of this important figure. He almost single-handedly created the history of mathematics as an academic subject in the United States and, particularly with his book on the history of mathematical notation, he is still one of the most quoted historians of mathematics today.\nFinally we should look at honours Cajori received. He was elected president of the\nMathematical Association of America\nin\n1917\n-\n18\n, vice-president of the American Association for the Advancement of Science in\n1923\n. He also served in that capacity for the History of Science Society\n(1924\n-\n25)\nand the Comité International d'Histoire des Sciences\n(1929\n-\n30)\n. He had the distinction of being awarded a D.Sc. and three honorary LL.D. degrees.",
  "math_areas": [
    "Applied Mathematics"
  ]
}