{
  "nome_completo": "Florimond de Beaune",
  "nome_curto": "Florimond de Beaune",
  "ano_nascimento": "1601",
  "ano_morte": "1652",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Beaune/",
  "lugar_nascimento": "Blois, France",
  "lugar_morte": "Blois, France",
  "biografia": "Florimond de Beaune\n's name is often given in the form Debeaune. He was born in Blois, which is in central France on the Loire River and, at the time de Beaune was born there, it was almost a second capital of France. Florimond de Beaune's father, also called Florimond de Beaune, was the illegitimate son of Jean II de Beaune whose brother was the archbishop Renaud de Beaune. However Florimond senior was made legitimate and inherited the title which eventually went to his son, the subject of this biography. Florimond de Beaune senior was a squire with an estate being the Seigneur de Goulioux. Florimond de Beaune, the mathematician, inherited the estate from his father, so he also became Seigneur de Goulioux.\nDe Beaune was educated in Paris where he went on to study law although his status meant that he had no need to take a degree. After military service he had little need for earning a living. He married Philiberte Anne Pelluis on\n21\nDecember\n1621\nbut the marriage lasted less than a year since she died in August\n1622\n. He married Marguerite du Lot on\n15\nDecember\n1623\n; this second marriage brought considerable wealth to de Beaune. The marriage produced three sons and one daughter; one of the sons became a priest. De Beaune bought the office of counselor to the court of justice in Blois, and was only an amateur mathematician. He inherited an estate near Blois and he spent a lot of his time on this estate. As we noted, his second marriage brought de Beaune a substantial amount of money. It enabled him to build up an extensive library as well as to build himself an observatory at the town house which he also owned. In fact his library contained a good proportion of astronomy works\n(\nabout a third of the total\n)\nin addition to a fine collection of mathematics volumes. In\n[\n7\n]\nPierre Costabel examines an inventory of de Beaune's library drawn up after his death by his heirs. He draws some conclusions:-\nNothing in Greek is represented in the library.\nThe classification by authors shows that de Beaune possessed all the works by\nKepler\n,\nGalileo\n,\nDescartes\nand\nJ-B Morin\npublished at that time, and most of those of\nMersenne\nand\nGassendi\n.\nThe classification by subjects shows an equal division between works on science and those on general culture.\nThe places of publication show the facility of obtaining works published outside of France\n.\nIt is unfortunate that little of de Beaune's mathematical work survives although\nPaul Tannery\nwas able, from correspondence of de Beaune's that he discovered, to come to interesting conclusions.  De Beaune posed a number of challenging problems\n[\n1\n]\n:-\nAccording to\nBeaugrand\n, the first of these problems - which in the present state of textual study appears to concern itself only with the determination of the tangent to an analytically defined curve - interested Debeaune \"in a design touching on dioptrics.\" As to the second of these problems, the one that has been particularly identified with Debeaune and that ushered in what was called at the end of the seventeenth century the \"inverse of tangents\" i.e., the determination of a curve from a property of its tangent - Debeaune told\nMersenne\non\n5\nMarch\n1639\nthat he sought a solution with only one precise aim: to prove that the isochronism of string vibrations and of pendulum oscillations was independent of the amplitude. This statement, which is not easily justified except in the language of differential and integral calculus, was fifty years ahead of scientific developments and - by itself - reveals Debeaune's singular ability to translate physical questions into the abstract language of mathematical analysis, despite the inadequacies of the operative means of his time.\nDe Beaune did, however, publish some work for he produced the first important introduction to\nDescartes\n' cartesian geometry. He wrote\nNotes brièves\nⓉ\n(\nBrief notes\n)\nwhich was published in\n1649\nas part of the first Latin edition of\nDescartes\n'\nLa Géométrie\n. De Beaune proved among many results that\ny\n2\n=\nx\ny\n+\nb\nx\n,\ny\n2\n=\n−\nd\ny\n+\nb\nx\n,\ny\n2\n=\nb\nx\n−\nx\n2\ny^{2} = xy + bx, y^{2} = -dy + bx, y^{2} = bx - x^{2}\ny\n2\n=\nx\ny\n+\nb\nx\n,\ny\n2\n=\n−\nd\ny\n+\nb\nx\n,\ny\n2\n=\nb\nx\n−\nx\n2\nrepresent\nhyperbola\n,\nparabola\nand\nellipse\nrespectively. Two other papers by de Beaune on algebra appeared as part of the second edition of\nLa Géométrie\n. In fact de Beaune and\nDescartes\nwere good friends and corresponded frequently on mathematical topics. Many of the top French scientists of the time corresponded with de Beaune, for example\nClaude Mydorge\n,\nJacques de Billy\nand\nMarin Mersenne\n, and friends visited him to discuss mathematical topics, for example\nDescartes\nand\nErasmus Bartholin\n. When he was very ill near the end of his life, de Beaune entrusted\nBartholin\nwith several manuscripts and asked him to arrange for their publication. The two algebra papers published in the second edition of\nLa Géométrie\nwere among these manuscripts, but the others were not published by\nBartholin\nand appeared lost. However, in\n1963\n,\nLa doctrine de l'angle solide construit sous trois angles plans\nwas discovered\n[\n11\n]\n:-\nDe Beaune intended  ... 'Doctrine de l'angle solide construit sous trois angles plans' for posthumous publication, but the treatise never found its way into print because of the complexity of its accompanying diagrams. Every trace of the work was lost until\n1963\n, when it was rediscovered among manuscripts in the\nRoberval\nArchive at the\nAcadémie des Sciences\nin Paris, and thus it appears for the first time in the present critical edition\n(\nthe book\n[\n2\n]\n)\n. The treatise is of interest chiefly because it is a work of pure synthetic geometry consisting of some\n125\npropositions composed in the style of\nEuclid\nby one of the ablest practitioners of the new analytical art typified by the works of\nDescartes\nand\nFermat\n. And while he built on results found in works on trigonometry by\nSnell\n, Girard, and\nBriggs\n, de Beaune avoided the numerical methods employed by these and other mathematical practitioners of the period in favour of pure geometry, indicating that he distinguished clearly between two genres of mathematics.\nDe Beaune was also interested in mechanics and optics and wrote on these topics. However his work in these areas was never published and little is known of these contributions. We do know from\nMersenne\nthat de Beaune wrote\nMéchaniques\nⓉ\n(\nMechanics\n)\nand we know from\nFrans van Schooten\nthat he wrote\nDioptrique\nⓉ\n(\nDioptrics\n)\n. Historians still have some hope that manuscripts of these will be found one day. His interest in optics was related to his interest in astronomy for he worked on grinding lenses, in particular experimenting with non-spherical lenses. De Beaune gained the reputation of being the finest instrument maker of his day which is why\nDescartes\nwrote to de Beaune in March\n1639\n.\nDescartes\nhad designed a machine for grinding hyperbolic lenses that he described in\nLa Dioptrique\nand he asked de Beaune if he could make the instrument. De Beaune became obsessed with the idea of making\nDescartes\n' machine to grind lenses and devoted his whole time to the project.\nDescartes\nknew that de Beaune was the only person who had the technical proficiency, a deep understanding of mathematics and a fascination with astronomy. However in January\n1640\n, despite his expertise, de Beaune cut his hand badly on a piece of roughly shaped glass which he was trying to cut into a hyperbolic shape. When\nDescartes\nheard about the accident he seemed pleased that his scientific imagination went beyond what the best technician could make. He wrote to\nChristiaan Huygens\n's father:-\nDo you think I am saddened by this? On the contrary, I tell you that in the very failure of the hands of the best craftsman, I understand just how far my reasoning has reached.\nSeveral years after the accident, de Beaune returned to the topic of lenses but by this time he was more interested in the theory than in grinding lenses. His last few years were painful ones\n[\n1\n]\n:-\nAfflicted with various and painful infirmities, particularly gout, Debeaune resigned as counselor around\n1648\nand withdrew to a town house, the upper floor of which faced due south. There he had - at least for a time - an observatory at his disposal. However, his failing eyesight deteriorated rapidly, and he died shortly after having a foot amputated.\nLet us end this biography with two quotes. The first from Costabel\n[\n2\n]\n:-\nFlorimond de Beaune appears in light of his library to have been an enlightened Christian and an erudite humanist, unencumbered by philosophical tradition and quite open to the ideas of his age.\nThe second quote is from de Beaune himself in a letter he wrote to\nMersenne\non\n5\nMarch\n1639\n:-\nI do not think that one could acquire any solid knowledge of nature in physics without geometry, and the best of geometry consists of analysis, of such kind that without the latter it is quite imperfect.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}