{
  "nome_completo": "Florence Nightingale David",
  "nome_curto": "Florence Nightingale David",
  "ano_nascimento": "1909",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/David/",
  "lugar_nascimento": "Ivington, near Leominster, England",
  "lugar_morte": "Kensington, Contra Costa County, California, USA",
  "biografia": "Florence Nightingale David\n's father was William Richard David\n(\nborn in Pullandraes, Tondu, Glamorganshire, Wales in about\n1884)\nwho was an Elementary School head teacher. Her mother was Florence Maude David\n(\nborn in Wolverhampton, Staffordshire, England in about\n1882)\nwho was also an Elementary School head teacher.\nFlorence Nightingale David was given the names 'Florence Nightingale' by her parents because they were friends of\nFlorence Nightingale\n. In fact\nFlorence Nightingale\ndied a year after Florence Nightingale David was born. In\n1929\nFlorence entered Bedford College for Women with the intention of becoming an actuary. She graduated in\n1931\nwith a mathematics degree but when she applied to a London insurance firm for an actuarial job she was turned down. Although she was the most highly qualified of the applicants for the post, the firm were not prepared to employ a woman as an actuary. At this point her father encouraged her, saying that she would meet discrimination throughout her life and she would just have to persevere. She went to see\nKarl Pearson\nto ask his advice about obtaining an actuarial position.\nPearson\nwas certainly impressed with David and he offered her a research assistant position in University College London. Her first publication, written jointly with\nPearson\nand S A Stouffer, appeared in\nBiometrika\nin\n1932\n. In that year\nWilks\nand Churchill Eisenhart visited London and together with David attended\nFisher\n's lectures. David, being a woman, was not allowed to ask any questions and she certainly felt that questions needed to be asked after what she considered were awful lectures\n[\n3\n]\n:-\nI would sit next to Churchill Eisenhart and\nSam Wilks\n, who were visiting, and I'd say \"Ask him! Ask him!\" Maybe it's a good thing to have a bad lecturer. After\nFisher\n's lecture I would go spend about three hours in the library to try to understand what he was up to.\nAfter\nPearson\nhad arranged for the research assistant position to be extended, David was offered an assistant lectureship in statistics at University College London following\nPearson\n's retirement in\n1935\n. She accepted the post and taught there while continuing to undertake research in statistics. It was\nNeyman\nwho insisted that she complete a doctorate. In\n1938\nshe was awarded a Ph.D. in statistics and continued to teach at University College until the outbreak of World War II in\n1939\n.\nDuring the war she undertook work as an Experimental Officer in the Ordnance Board for the Ministry of Supply, a Senior Statistician for the Research and Experiments Department for the Ministry of Home Security, a Member of the Land Mines Committee of the Scientific Advisory Council, and as a Scientific Advisor on Mines to the Military Experimental Establishment. Of course her statistical expertise meant that her skills were much in demand to help with the war effort. On the one hand David felt that the opportunities which World War II opened up for women were extremely valuable. On the other hand the obituary in the\nDaily Telegraph\nstated that:-\n... during the Second World War she studied air-raid bombing patterns to determine the locations of German launching silos. Since the Germans moved their silos from week to week, she had little success in this and described the war as having wasted six years of her life.\nWhen the war ended David returned to University College London to resume her lecturing post, now as a lecturer. She was promoted to a readership on the strength of her achievements in research in statistics and then in\n1962\nshe was promoted to Professor of Statistics. Before this she supervised John G Saw's doctoral thesis on\nEstimating and Testing Techniques with Ordered Variables Applied to Censored Samples\n. His degree was awarded in\n1959\n.\nDavid remained at University College London until\n1967\n. During this period she received many honours. In particular she was elected a Fellow of the Institute of Mathematical Statistics, a Fellow of the\nAmerican Statistical Association\nin\n1954\n, and a Member of the International Statistical Institute. She served on the University Senate of University College, and was also a Governor of Bedford College for Women. David was appointed as a visiting professor and research statistician at the Department of Statistics and Applied Climatology and Forestry Division at the University of California, Berkeley.\nIt was in\n1948\nthat David had made her first visit to California and after that she regularly taught summer schools at Berkeley. She purchased a house, jointly with Evelyn Fix, in Kensington near Berkeley in\n1961\n. In\n1967\nDavid joined the University of California at Riverside and in the following year she was appointed to the Chair of Biostatistics in the newly established Department of Biostatistics. The Department was renamed the Department of Statistics in\n1970\nand David became the Chair of Statistics. However\n[\n4\n]\n:-\nDavid's years at Riverside were tumultuous ones, in which she had to struggle to develop the new Statistics Department according to her vision. She had to fight both the mathematicians and all of the other departments that wanted to house their own statisticians.\nShe explained in\n[\n3\n]\n:-\n[\nT\n]\nhe mathematicians tried to swallow me. I fought them on the senate floor and all over the place ... I was a Professor of Economics, in all I had five different titles. They were all trying to get a statistical monopoly.\nIt is worth noting that she served as the Review Editor for\nBiometrics\nfrom\n1972\nto\n1976\n. After holding the Chair of Statistics at Riverside for seven years, during which time she returned to her home in Kensington every weekend, she retired in\n1977\nand became Professor Emeritus and Research Associate in Biostatistics at the University of California at Berkeley. She continued to work as a consultant with the United States Forestry Service.\nDavid was renowned as a teacher as well as a researcher. In\n1970\n-\n71\nshe received the Distinguished Teaching Award from the University of California at Riverside. In August\n1992\nshe received the Elizabeth L Scott Award from the Committee of Presidents of Statistical Societies for her:-\n... efforts in opening the door to women in statistics; for contributions to the profession over many years, for contributions to education, science and public service; for research contributions to combinatorics, statistical methods, applications and understanding history; and her spirit as a lecturer and as a role model.\nDavid died of lung cancer at the age of\n83\nat her home in Kensington, in Contra Costa County, California. In\n2001\nthe Florence Nightingale David Award was established to be awarded to a:-\n... female statistician who serves as role models to women through her contributions to the profession through excellence in research, leadership of multidisciplinary collaborative groups, statistics education, or service to the professional societies.\nLet us look at a few examples of David's contributions to statistics. We can only examine a few since she wrote nine books and over\n100\npapers. David published\nTables of the ordinates and probability integral of the distribution of the correlation coefficient in small samples\nin\n1938\n. In the following year she published\nOn Neyman's \"smooth\" test for goodness of fit\nin\nBiometrika\n. This paper throws light on what constitutes a large sample for\nNeyman\n's criterion of smoothness of fit of order\nk\nk\nk\n. After she returned to University College after World War II she published\nA power function for tests of randomness in a sequence of alternatives\nand\nA\nc\n2\nc^{2}\nc\n2\n'smooth' test for goodness of fit\nwhich both appeared in\nBiometrika\nin\n1947\n. The first investigates the behaviour of the nonparametric test for randomness based on the number of alternations of an event and its complement in a series of trials. In the second David examines the signs of the deviations from expected numbers to see whether they change sufficiently often.\nIn\n1949\nDavid published\nProbability Theory for Statistical Methods\n, an elementary textbook in the theory of probability for students of statistics.\nWolfowitz\n, reviewing the text, writes:-\nThe author is obviously very enthusiastic and devoted to her task. The examples are many, frequently original, lively, and interesting.\nIn\n1962\nDavid published\nGames, gods and gambling\nwhich many regard as her most significant book. It presents a history of probability and statistical ideas and was republished by\nDover Publications\nin\n1998\n. Also in\n1962\nshe published\nElementary statistical exercises\nwritten jointly with\nEgon Pearson\n. In the following year she published\nCombinatorial chance\nwritten jointly with David E Barton. In the book the authors write:-\nIn combinatorial chance ... the ideas are simple and easy to understand, but the manipulative procedures are discouraging in that they depend on mathematical tricks which have to be learnt.\nBut\nBirnbaum\nwrites in his review of the book:-\n...\n[\nDavid and Barton\n]\nproceed to present both the ideas and the mathematical tricks in a most enjoyable manner and with as much order and method as the subject permits. The book is written with care but without pedantry, and takes the reader from deceivingly simple problems to serious and sometimes quite involved mathematical theory.\nDavid and Barton wrote a paper in\n1966\nwhich, since the archive is based in Scotland, we must mention. This is\nA persistence problem in renewal theory : Robert the Bruce's spider\n. In this they looked at the problem of Robert the Bruce's spider. They assume it attempted to climb a smooth wall at unit speed. The distribution of the height it reached before slipping back to the floor is exponential. After slipping, it rested for a fixed time and then restarted its climb. In the paper the density of the total time required for the spider to successfully climb the wall is calculated. Also in\n1966\nDavid and Barton, together with\nMaurice Kendall\n, published\nSymmetric function and allied tables\n. A symmetric function of\nn\nn\nn\nvariables is one which remains unchanged when any pair of variables are interchanged. For example\nx\n+\ny\n+\nz\n,\nx\ny\nz\nx + y + z, xyz\nx\n+\ny\n+\nz\n,\nx\ny\nz\nand\nx\ny\n+\ny\nz\n+\nz\nx\nxy + yz + zx\nx\ny\n+\ny\nz\n+\nz\nx\nare symmetric functions of three variables. Siddiqui, in reviewing the text, writes:-\nThe main body of tables is preceded by an extensive introduction. The introduction presents theory, examples of the applications of the theory and explains the uses of the tables. It is written in a lucid style and is a good introduction to the subject even for a beginner.\nSome of David's work was directed towards applications of statistics to ecology. For example in\n1972\nDavid published\nMeasurement of diversity\nand we present her own summary of the work:-\nThe several measurements used by ecologists to measure diversity in plant and animal populations have been summarized by E C Pielou. This present paper is concerned with an extension of the idea of diversity in plant populations and, in particular, with the description of data produced by a densitometer. Further papers applying the present ideas to actual forests counts where there is more than one observation to a cell will appear elsewhere.\nDavid Barton describes David's character in\n[\n1\n]\n:-\nThose who worked with her and indeed her students at all levels will remember a woman of great generosity and charm. She had a very short fuse and could be extremely rude when she chose. Her enormous energy, prolific output and uncertain temper made her an exciting colleague to work with.\nUtts writes in\n[\n4\n]\n:-\nF N David lived a full and ambitious life, and will long be remembered, not only for her famous cigars, but for her place in the history of statistics.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Statistics"
  ]
}