{
  "nome_completo": "Floyd Burton Jones",
  "nome_curto": "Floyd Burton Jones",
  "ano_nascimento": "1910",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jones_Burton/",
  "lugar_nascimento": "Cisco, Texas, USA",
  "lugar_morte": "Santa Barbara, California, USA",
  "biografia": "Floyd Burton Jones\n' father was a pharmacist who was interested in local politics in Shackelford County, Texas. This had the effect of making Jones grow up wishing to be a lawyer, for his father mixed with the top lawyers of the County. Jones won a Regents' Scholarship to study at the University of Texas and when he entered the University he was certainly still intending to become a lawyer and he enrolled in the pre-law program.\nLaw is a subject which requires a student to be able to memorise large amounts of information and Jones soon discovered that this was not one of his strengths. Although one can see how this might have led him to mathematics the route was not as simple as that for the topic which he decided to take up instead of law was chemistry. Lawyers do not need to study mathematics but chemists do, and so at this point Jones took mathematics courses. Soon he was taking more mathematics courses than he needed for his chemistry degree since he was enjoying them so much.\nPerhaps the main factor which led Jones to finally decide to become a mathematician was\nR L Moore\n. He quickly spotted Jones's talents for the subject even when he was only taking the mathematics courses necessary for the chemistry degree.\nMoore\ndid not try to make Jones change degrees for a second time and indeed he did complete his chemistry degree in\n1932\n. At this point\nMoore\nshowed how deeply he believed in Jones's mathematical ability for he offered him a job as a part-time mathematics instructor. This was too good an offer to refuse so Jones took up the post in September\n1932\nand at the same time he began studies for his doctorate in mathematics. His first publication\nA theorem concerning locally peripherally separable spaces\nwas written at this time and appeared in the\nBulletin of the American Mathematical Society\nin\n1935\n. He joined the Faculty at the University of Texas as an Instructor in September\n1935\n, after being awarded his doctorate in that year, and he was promoted to Assistant Professor in September\n1940\n.\nIn\n1942\nJones left the University of Texas to undertake War work at Harvard Underwater Sound Laboratory where he helped develop scanning sonar used in anti-submarine warfare. In\n1944\nhe returned to his post at the University of Texas where he remained as Associate Professor until he was offered a full Professorship at the University of North Carolina at Chapel Hill in\n1950\n. There he was Chairman of the department of Mathematics until\n1962\nwhen he accepted a Professorship at the University of California at Riverside. He remained there until he retired in\n1978\n.\nIn\n[\n4\n]\nRogers writes of Jones's research:-\n... results that had an enormous impact on the development of point set topology and continuum theory ...\nJones wrote\n67\npapers, his first in\n1935\nbeing on separable spaces, while his third in\n1937\non normal spaces is one of his most important. he then weakened one of\nMoore\n's Foundations Axioms, showing that the weakened axiom together with the other axioms implied\nMoore\n's stronger version. He also wrote many papers on homogeneous continua.\nNyikos, in\n[\n2\n]\n, writes of Jones's contributions to the normal\nMoore\nspace problem:-\nWhen Burton Jones posed the normal\nMoore\nspace problem in\n1933\n, he probably had little inkling of the role this problem would play in the history of point-set topology. It has given rise to hundreds of papers in topology and quite a few\n(\nand their number is growing!\n)\nin set theory as well. But more importantly, it has helped to generate interest in topology by set theorists, and it has kept us point-set topologists happy with our subject by giving us a tantalizing set of problems and partial results for us to think and talk about.\nHowever, Jones's contributions were not only in research; perhaps, as Rogers' suggests, the most important came though his teaching abilities\n[\n4\n]\n:-\n... as brilliant as Jones' research was, it was overshadowed by his great skill as a teacher and his work as a human being. In fact, his main interest was teaching and introducing mathematics to the upcoming generation.\nL McAuley, in\n1969\n, wrote of:-\n... the magical power of Jones in the classroom - a master who breathes the very life of mathematics into his students.\nPerhaps the best way to understand Jones' methods of teaching is to quote from his own description of his methods which he gave in\n[\n1\n]\n:-\nI like to state false propositions\n(\njust as if they were true\n)\nfor students to prove. And quite frequently I state a number of definitions and ask students to formulate some theorems using them. I feel that examples\n(\nand counterexamples\n)\nare very important for both understanding and motivation. In particular one's intuition is aided by examples of spaces that do not satisfy the axioms as much as by examples that do; for instance,\n(\nin my approach to\ngeneral topology\n)\ntopological spaces\n(\neven compact and\nHausdorff\n)\nthat are not semi-metric and semi-metric spaces which are not metric.\nAnd its nice to have a sequence of theorems which are useful but which can be proved by everybody. Elementary properties of connected point sets can be formulated into a sequence of this sort.\nIt is a good plan to encourage students to change a theorem until they can prove it; weaken the conclusion or strengthen the hypothesis or both. This helps to avoid frustration and is good practice.\nThe instructor should convey confidence, especially in the beginning. The students should soon learn that some things he can do quickly but others may take effort and time. Given six months practice, a student who never thought of a proof in his life and didn't know how to start, may develop to the point where he can settle almost anything you propose. I find this very rewarding and satisfying. It happens often enough to keep one's enthusiasm for teaching vitally alive.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Topology"
  ]
}