{
  "nome_completo": "Forest Ray Moulton",
  "nome_curto": "Forest Ray Moulton",
  "ano_nascimento": "1872",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moulton/",
  "lugar_nascimento": "Le Roy, Michigan, USA",
  "lugar_morte": "Wilmette, Illinois, USA",
  "biografia": "Forest Ray Moulton\n's parents were Mary C Smith and Belah G Moulton who were farmers with\n160\nacres of land between Grand Rapids and Traverse City in Michigan. Belah Moulton had fought in the Civil War and had received the land as a war veteran. However it was heavily forested land and Belah had to clear the trees before he could start to farm there. In fact Forest was his parent's first child and he was born in a log cabin in the forest. That Forest was born in the forest is not a coincidence, for his mother named him since he was:-\n... a perfect ray of light and happiness in that dense forest.\nNo formal schooling was possible for Forest in the rural environment that he grew up in, but his parents and grandparents\n(\nparticularly his mother\n)\ngave him a solid foundation to his education. In fact he became a teacher himself a one-room school where pupils of all ages were educated in the same classroom before he received formal teaching himself. Then he entered Albion College, in Albion, Michigan. The college, affiliated with the United Methodist Church, was founded in\n1835\nto educate the region's settlers and Indians. Moulton became a part-time instructor at Albion in\n1892\nand held this position until he graduated from the College in\n1894\n. In\n1895\nhe entered the University of Chicago to undertake graduate studies. He was appointed as an assistant in\n1896\nand in the same year he married Estella L Gillette; they had five children. In\n1898\nhe became an associate professor and Director of the Department of Astronomy. He  was awarded a Ph.D. with distinction from Chicago in\n1899\n. His career continued to develop and he reached the rank of full professor in\n1912\n. Once the United States entered World War I, Moulton was commissioned a major in the Army and was put in charge of the Ballistics Branch of the Army Ordinance Department at the Aberdeen Proving Ground in Maryland.\nMoulton's main interests were in the application of mathematics to problems in astronomy. He published\nOn a class of particular solutions of the problem of four bodies\nin\n1900\nand\nA class of periodic solutions of the problem of three bodies with application to the lunar theory\nin\n1906\nboth in the\nTransactions of the American Mathematical Society\n. Other papers, this time in the\nAnnals of Mathematics\n, include\nThe straight line solutions of the problem of n bodies\n(1910)\nand\nThe deviations of falling bodies\n(1913)\n. His books include\nAn Introduction to Celestial Mechanics\n(1902)\n,\nAn introduction to astronomy\n(1906)\n,\nDescriptive astronomy\n(1912)\n,\nPeriodic orbits\n(1920)\nThe Nature of the World and Man\n(1926)\n,\nDifferential equations\n(1930)\n,\nAstronomy\n(1931)\n, and\nConsider the Heavens\n(1935)\n. He also became quite a celebrity for, in addition to writing popular texts, he had a regular radio science programme while a professor at Chicago. He was one of the first professors to try to use the medium of radio to popularise science.\nMoulton is best known, however, as the co-author with Thomas C Chamberlin of the Chamberlin-Moulton planetesimal hypothesis of the origin and evolution of the solar system. The origin, early development and subsequent fate of the their hypothesis is examined in detail in\n[\n1\n]\nand\n[\n2\n]\n. Moulton began working with Chamberlin, who was professor of geology at Chicago, when he was undertaking graduate studies at Chicago. Chamberlin correctly realised that the earth was much older than the age proposed by\nKelvin\nwhich was accepted at that time. He proposed that the planets and their moons were formed by the accretion of small solid particles rather than by condensation of gaseous or liquid material. However it was Moulton who made Chamberlin's idea into a solid theory by providing the necessary mathematical calculations. Although the theory soon fell out of favour, it contains many ideas which are still part of the modern theories.\nAfter World War I ended Moulton returned to the University of Chicago where he continued to teach until\n1926\nwhen he resigned and became a director of the Utilities Power and Light Company in Chicago. He also became an advisor to the president of the Company. The move was not an easy one since the Great Depression began in\n1929\nand by\n1932\none quarter of the workers in the United States were unemployed. Moulton's Company came close to collapse in\n1933\nbut it just survived. He remained a director until\n1937\nwhen he took up the post of permanent secretary of the American Association for the Advancement of Science. He remained in this post until he retired in\n1948\n. Moulton and his wife Estella divorced in\n1936\nand, in\n1939\n, he married Alicia Pratt. In fact he was divorced for a second time in the year before his death.\nIn\n1950\nMoulton, by this time\n78\nyears old, moved to Evanston, Illinois, where one of his brothers was Professor of Mathematics at Northwestern University. F C Leonard, writing on the death of Moulton in the Journal of the Royal Astronomical Society of Canada, explains that:-\nMoulton was a first-rate teacher and public speaker as well as an accomplished writer, and he ranked as one of the greatest masters of celestial mechanics, not only of his own generation but of all time. As man and scholar, through his sympathetic interest and generous encouragement, he inspired the warmest affection and highest admiration in the student who was privileged to have him for a friend.\nMoulton's most famous pupil was\nEdwin Hubble\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus"
  ]
}