{
  "nome_completo": "Francis Dominic Murnaghan",
  "nome_curto": "Francis Murnaghan",
  "ano_nascimento": "1893",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Murnaghan/",
  "lugar_nascimento": "Omagh, Co. Tyrone, Ireland",
  "lugar_morte": "Baltimore, Maryland, USA",
  "biografia": "Francis Murnaghan\nwas known as Frank. His parents, Angela Mooney and George Murnaghan, were Roman Catholics although George had been educated at a Protestant school. They were Irish, but George had emigrated to the United States where he had made money building houses and as the keeper of a livery stable in St Louis, Missouri. Angela and George had three children while living in the United States, but they returned to Ireland in the late\n1880\ns and purchased a farm, Lisanelly, near Omagh, Co. Tyrone. After their return they had a further six children, and Frank was the seventh of the nine. George Murnaghan took an active part in political life, serving on Tyrone County Council and becoming a Nationalist Member of Parliament, and left the running of the farm to his large family.\nFrank was educated at the Christian Brothers School, a Catholic school in Omagh. He graduated in\n1910\n, entering University College, Dublin, in that year. Three years of study saw him achieve a first class degree in mathematics in\n1913\n, and he remained at University College, Dublin, for one further year to take a Master's Degree. He was taught applied mathematics at University College by\nArthur Conway\nwho held the chair of Mathematical Physics there. Murnaghan was awarded a National University of Ireland Travelling Scholarship to study abroad but, with the outbreak of World War I, his initial idea of studying in Germany became a non-starter. He discussed with\nArthur Conway\npossible alternative places at which he could study, and Johns Hopkins University in the United States was suggested.\nHarry Bateman\nhad been appointed there in\n1912\nand his interests in partial differential equations fitted perfectly with Murnaghan's interests at the time.\nArriving at Johns Hopkins University in Baltimore, Murnaghan began doctoral studies working on differential equations which arose in the study of radio-active decay. His official supervisor was\nFrank Morley\nwho was Head of the Mathematics Department but he was much influenced by\nBateman\n. In\n1916\nMurnaghan submitted his thesis\nThe Lines of Electric Force Due to a Moving Electron\nand was awarded his Ph.D. Following this he was appointed as a lecturer at the Rice Institute in Houston, Texas. This was a newly opened institution funded through the will of William Marsh Rice, with the first classes being held in\n1912\n(\nit did not become Rice University until\n1960)\n. Murnaghan helped supervise the studies of the first Ph.D. produced by the Rice Institute, namely Hubert Evelyn Bray whose thesis\nA Green's Theorem in Terms of Lebesgue Integrals\nwas submitted in\n1918\n, the year Murnaghan left.\nFrom the Rice Institute he returned to Johns Hopkins University where he was appointed Associate Professor. While he had been at the Rice Institute, Murnaghan had met Ada Mary Kimbell and in\n1919\n, the year following his return to Johns Hopkins, they married. They had a son named Francis Dominic after his father, and known as Francis Dominic Jnr, and a daughter Patricia. Their son had a career in the legal profession, while Patricia studied mathematics at Bryn Mawr and became Head of the Mathematics Department at a girl's school in Baltimore. In\n1928\nMurnaghan became a naturalized citizen of the United States but\n[\n5\n]\n:-\n... he never lost his Irish heritage or deep feeling for Ireland.\nIn fact he returned to Ireland for a number of extended visits throughout his life.\nIn\n1928\nFrank Morley\nretired as Head of Mathematics at Johns Hopkins, and Murnaghan was appointed as Professor and Head of the Mathematics Department. He held this post until\n1948\nwhen he retired after a disagreement with the President of Johns Hopkins University, and went to São Paulo, Brazil, where he was appointed as the first Professor of Mathematics at the Instituto Tecnologico de Aeronautica. He returned to the United States on several occasions but in\n1959\nhe retired from his position in São Paulo and, back in the United States, continued to work on mathematics. In particular he was a consultant on ship and aircraft design for the Department of the Navy, David Taylor Model Basin, in Bethesda, Maryland.\nLet us now examine the mathematics which interested Murnaghan. The first comment to make here is that he was interested in a wide range of mathematical topics from within both pure and applied mathematics. Perhaps it is easiest to understand how he saw the study of mathematics and its applications by quoting from the Preface to his first book\nVector analysis and the theory of relativity\n(1922)\n. He wrote:-\n... it is to the physicist rather than to the mathematician that we must look for the conquest of the secrets of nature. ... this makes it a pleasure and a duty of the mathematician to adapt his powerful methods to the needs of the physicist and especially to explain these methods in a manner intelligible to anyone well-grounded in algebra and calculus.\nThis text was based on lectures he gave in the summer of\n1920\nat Johns Hopkins. Other excellent works on the applications of mathematics followed. In\n1929\n, in collaboration with Joseph Sweetman Ames, a physicist colleague at Johns Hopkins, he published\nTheoretical mechanics: an introduction to mathematical physics\n. This was another classic, reprinted by Dover in\n1958\n. In\n1932\n, in collaboration with\nHarry Bateman\nand Hugh Dryden, he produced an impressive National Research Council report\nHydrodynamics\nwhich was again reprinted by Dover in\n1956\n.\nOver the period up to\n1936\n, in addition to the major texts we have already mentioned, Murnaghan undertook research and published papers on a wide variety of topics such as electrodynamics, relativity, tensor analysis, elasticity, dynamics, aerodynamics, quantum mechanics, and celestial mechanics. Of course this meant that he was deeply involved in solving differential equations, and indeed he also wrote papers on this topic. After\n1936\nhe became interested in a pure mathematics topic.\nHis great interest in pure mathematics was in the theory of group representations, but he makes it clear that his interest in this topic is motivated by the importance of its applications. He wrote\nThe theory of group representations\n(1938)\nand he states his aims in the Preface which are to give an:-\n... elementary and self-contained account of the theory of group representations with special reference to those groups which have turned out to be of fundamental significance for quantum mechanics, especially nuclear physics.\nThis text became a classic and was republished by Dover Publications in\n1963\n. He also published\nThe orthogonal and symplectic groups\nin\n1958\nwhich arose from a series of twenty lectures he gave in Dublin in\n1957\n. A further important text on this topic was\nThe unitary and rotation groups\n(1962)\nwhich concentrated on representations of unitary and orthogonal groups.\nAlthough we have mentioned six books by Murnaghan, this is less than half his total of books since he published\n16\nin all. We also mention\nIntroduction to Applied Mathematics\n(1948)\nwhich is a text for graduate students. It covers topics such as: vectors and matrices;\nFourier series\n; boundary value problems;\nLegendre\nand\nBessel functions\n;\nintegral equations\n; the\ncalculus of variations\nand dynamics; and the operational calculus. After he retired from his position in Brazil and returned to the United States he published\nThe calculus of variations\nand\nThe Laplace transformation\n, both in\n1962\n. The first of these is a short book of less that\n100\npages written for engineers and scientists, while the second consists of\n19\nlectures on such topics as: the\nFourier\nintegral; the\nLaplace\nintegral transformation; the differential equations of\nLaguerre\nand\nBessel\n; properties of special functions; asymptotic series for an error function, and for certain\nBessel\nfunctions.\nThe final book he published was\nEvaluation of the probability integral to high precision\nwhich was a report for the Department of the Navy, David Taylor Model Basin. Murnaghan's own summary of its contents is as follows:-\nThe 'converging factor' for an asymptotic series representing a function\nf\n(\nx\n)\nf(x)\nf\n(\nx\n)\nis that number by which the\n(\nn\n+\n1\n)\n(n+1)\n(\nn\n+\n1\n)\nst term of the series must be multiplied so that the result of adding this product to the sum of the first\nn\nn\nn\nterms will be\nf\n(\nx\n)\nf(x)\nf\n(\nx\n)\n. This report describes the determination to high precision of this factor for the asymptotic series representing the probability integral. Tables of this factor to\n63\ndecimal places are included for n ranging from\n2\nto\n64\n.\nAs a teacher, Murnaghan certainly appears to have had great style. He is described by Zund\n[\n5\n]\nas:-\n... a born teacher who had a seemingly insatiable desire to communicate his enthusiasm for mathematics.\nIn\n[\n2\n]\nLewis gives a delightful quote from Russell Baker\n(\nwho went on to become a prize-winning journalist\n)\nwho attended Murnaghan's calculus lectures in\n1942\n:-\nDr Murnaghan was a spirited rosy-cheeked gentleman with silvery locks, who spoke with a pronounced Irish brogue. his energetic classroom manner was like the theatrical performance of an Irish character actor with a fondness for pixie roles.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}