{
  "nome_completo": "Francesco de Giovanni",
  "nome_curto": "Francesco de Giovanni",
  "ano_nascimento": "1955",
  "ano_morte": "2024",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Giovanni/",
  "lugar_nascimento": "Naples, Italy",
  "lugar_morte": "Salerno, Italy",
  "biografia": "Francesco de Giovanni\nwas the son of Eugenio de Giovanni and Elli Efmorfias. Eugenio was drafted into the Italian Army during World War II and became a member of the Italian forces occupying Greece. Italy, with German support, had taken over Greece which surrendered in April\n1941\n. On\n8\nSeptember\n1943\nItaly surrendered to the Allies and following this many Italian soldiers in Greece were killed or imprisoned by the Germans. Eugenio's brother, named Francesco, was executed in Rhodes following the armistice. Eugenio de Giovanni ended up in jail and, on\n16\nDecember\n1944\n, while still in jail, he married the Greek girl Elli Efmorfias. Elli's mother persuaded her daughter to move to Naples and live with Eugenio's parents. This she did and, when the war ended in\n1945\n, Eugenio was freed and joined his wife in Naples; he then worked for the Real Albergo dei Poveri in the city.\nFrancesco was the third son of Eugenio and Elli de Giovanni, and was named Francesco after his uncle who had been executed in Rhodes. He grew up in a house with three dogs, a cat, several canaries, and some turtles. This gave him a love of animals which he kept throughout his life. He was keen on soccer and basketball which he played in the grounds of the Real Albergo dei Poveri where his father worked. From a young age he loved comics and was particularly keen of \"Superman\" stories.\nIt was in Naples that Francesco was educated. He had a classical education and developed a love of mathematics at High School. His teacher Mario Ferraiuolo, realising that he was teaching a very talented mathematician, told the school examining board that he was certain that de Giovanni would become a university professor of mathematics. He graduated from the High School in\n1973\nand later that year began his studies at the University of Naples Federico II. From this time on mathematics almost took over his life\n[\n5\n]\n:-\nMathematics became an indispensable passion, to the point that when his girlfriend at the time asked him to choose between her and mathematics, he chose mathematics.\nHe was taught analysis by\nFederico Cafiero\nwho had taken up the Chair of Mathematics at the University of Naples in\n1959\n. It was, however, Mario Curzio who had the greatest influence on him. Curzio, who had been publishing papers on group theory since\n1953\n, inspired de Giovanni to become interested in research in group theory. Under his supervision, de Giovanni graduated summa cum laude from the University of Naples in\n1978\n. His first publication\nAlcuni omomorfismi tra reticoli di sottogruppi\nⓉ\n(\nSome homomorphisms between lattices of subgroups\n)\nappeared in the year he graduated. This paper investigated obtaining information about a group whose subgroup lattice was known. In fact subgroup lattices of groups became a common theme in his research to which he frequently returned.\nWhile studying at the University of Naples, de Giovanni met Silvana Franciosi who also undertook research in group theory. Franciosi, born in\n1956\n, began collaborating with de Giovanni and they published their first joint paper in\n1979\n, namely\nSu una particolare classe di formazioni saturate\nⓉ\n(\nOn a particular class of saturated formation\n)\n. Alessandro Scarselli writes in a review\n[\n9\n]\n:-\nThe authors extend to a particular class of saturated formations of finite groups some results of R W Carter and T Hawkes concerning relations between chief factors of a soluble group and a given saturated formation.\nThis was the first of over\n80\npapers on which de Giovanni and Franciosi collaborated. With Bernhard Amberg they also published the classic book\nProducts of groups\n(1992)\nwhich John S Wilson praises highly and ends his review by writing\n[\n12\n]\n:-\nThe mathematical community should be grateful to the authors for this account of a challenging subject which has developed rapidly in the last forty years but in which some very natural questions still remain open. It is to be hoped that the exposure of these questions to a wider audience will lead to solutions to some of them within the next forty years.\nThe authors of\n[\n5\n]\nwrite:-\nThe years of his higher education and the very beginning of his career were shared with Silvana Franciosi, who would then become his wife and mother to his first daughter, Marta.\nItaly had military conscription from the time it was introduced by Napoleon Bonaparte after his invasion in\n1796\n. There was no way that de Giovanni could avoid this after he graduated in\n1978\nbut, since the military believed that mathematics was all about counting, he spent his year of military service being assigned the task of counting ammunition. In\n1982\nhe was appointed University Researcher for the Algebra and Geometry section at the Faculty of Sciences\n(\nMathematics, Physics and Natural Science\n)\nof the University of Naples Federico II. It was a position he held until\n1987\n. During the time he held this post, he was able to spend a full academic year at the University of Urbana-Champaign in the United States. While there he and his wife Silvana Franciosi collaborated with Derek Robinson which led to the important\n3\n-author paper\nOn torsion in groups whose automorphism groups have finite rank\n. In this paper, which de Giovanni considered to be one of the deepest he wrote, the authors\n[\n5\n]\n:-\n... proved that if the automorphism group of a soluble-by-finite group G has finite abelian subgroup rank, then the\nSylow\nsubgroups of G are Cernikov. During his stay, Francesco learned how to exploit brand new\n(\nco\n)\nhomology techniques in group theory: it was something that really made a difference once he came back to Italy.\nDe Giovanni was able to spend one semester of the academic year\n1986\n-\n87\nat the University of Mainz in Germany where he collaborated with Bernhard Amberg. This collaboration led to the publication of the book\nProducts of groups\n(1992)\nwhich we mentioned above.\nThe fact that Bernard Amberg and Marty Newell from Galway, who were two of de Giovanni's best friends, had both been students of\nReinhold Baer\nis not a coincidence. De Giovanni was passionate about\nBaer\n's mathematics and although he never met\nBaer\nin person he had studied all his papers on infinite group theory and had based much of his work on developing ideas he found in these papers. For example\nBaer\nhad studied how finite elements of a group\nG\nG\nG\nare restricted by finiteness hypotheses on the automorphism group\nA\nu\nt\nG\nAut G\nA\nu\nt\nG\nof\nG\nG\nG\n. The fact that Derek Robinson had looked at problems of this type was one factor in de Giovanni making a year-long research visit to the University of Urbana-Champaign where Robinson was based. The de Giovanni, Franciosi, Robinson paper\nOn torsion in groups whose automorphism groups have finite rank\nwhich we mentioned above continues looking at this type of problem first studied by\nBaer\n. In fact\nReinhold Baer\nis mentioned in the review of\n47\nof de Giovanni's papers, starting with\nWeak complementation in group theory\n(1981)\nand continuing to\nSpectra of groups\n(2023)\n.\nIn\n1987\nde Giovanni was promoted to Extraordinary Professor of Algebra at the University of Naples \"Federico II\" and then Full Professor of Algebra from\n1990\n. He held many other important university positions, for example: Chair of the Mathematics BS degree programme\n(1999\n-\n2002\n,\n2005\n-\n2008)\n; Coordinator of the Ph.D. programme in Mathematical Sciences\n(2009\n-\n2019)\n; Deputy Director of the Mathematics Department\n(2004\n-\n2007\n,\n2009\n-\n2012\n,\n2015\n-\n2019)\n; and Member of the Faculty Board of the Doctoral Program in Mathematical Sciences\n(1992\n-\n2024)\n. From\n2009\nto\n2024\nhe was coordinator of the Research Doctorate in Mathematical Sciences of the Naples-Naples II-Salerno University Consortium, and for the same Consortium he delivered various group theory courses. He was an excellent Ph.D. thesis advisor and he successfully advised at least\n28\ndoctoral students between\n1992\nand\n2018\n[\n5\n]\n:-\nHe has always been like a father figure to his students; he was always ready to welcome them, listen to their problems, and advise them in the wisest way possible. He loved being in company and share the joy of research at any time\n(\nthis could be seen for instance from the fact that he has more than\n45\nco-authors\n)\n. Lunches, festivities, errands, chores: nothing would have stopped his overflow of joy in calling the current student/friend/colleague for a new nice result, or simply for talking about some future research plans.\nHe organised the conference 'Infinite Groups\n1994\n' which was held in Ravello, Italy,\n23\n-\n27\nMay of the year\n1994\n. I\n[\nEFR\n]\nattended this conference and I know that it was exceptionally well organised. The choice of Ravello as a venue was inspiring, it must be one of the most beautiful places on earth. The\nProceeding\nof the Conference was published in\n1996\nwith Francesco de Giovanni and Martin Newell as editors. Among papers delivered at the conference and published in the\nProceeding\nwe mention: Bernhard Amberg,\nSome Results and Problems about Factorized Groups\n; Silvana Franciosi and Francesco de Giovanni,\nGroups Satisfying the Minimal Condition on Non-Subnormal Subgroups\n; and Martin L Newell,\nOn the\n4\n-Levi Centre and the\n4\n-Bell Centre of a Group\n. We also mention the excellent paper\nFrom Finite to Infinite Groups: a Historical Survey\nby Guido Zappa.\nEven the best of conference organisers have to cope with unexpected events. Since Ravello is not an easy place to get to by public transport, de Giovanni arranged for a bus to take some of the participants from Naples to Ravello. I\n[\nEFR\n]\nwas on this bus which, on its journey to Ravello, came to a dip in the road under a low bridge. The front of the bus went under the bridge but, as the front started to come up from the dip the roof of the bus struck the bridge with a fearful grind. Firmly jammed, we had a long wait in the bus before help arrived. A memorable start to one of the best conferences I have attended. Beginning in\n2007\n, de Giovanni\n(\nhelped by Marty Newell from Galway and Francesco Catino from University of Salento\n)\norganised the series of conferences 'Advances in Group Theory and Applications'. It has been held in Otranto in\n2007\n, Porto Cesareo in\n2009\n, Porto Cesareo in\n2011\n, Porto Cesareo in\n2013\n, Porto Cesareo in\n2015\n, Lecce in\n2017\n, Lecce in\n2019\n, and Lecce in\n2023\n. Of course, there was no\n2021\nconference because of COVID.\nThe COVID lockdowns saw de Giovanni start a collaboration with Bert Wehrfritz, University of London, and Marco Trombetti. Wehrfritz was a world leading expert on linear groups, a topic which de Giovanni had not worked on before. The collaboration lead to the\n3\n-author paper\nLinear groups whose proper subgroups are close to being nilpotent\n(2021)\n. It has the following Abstract:-\nThe aim of this paper is to describe linear groups in which all proper subgroups belong to a group class X for several relevant choices of X. In particular, we study linear groups either with only nilpotent-by-finite proper subgroups or with only paranilpotent subgroups; here a group G is paranilpotent if it has a normal series of finite length whose factors are abelian and have only G-invariant subgroups.\nThis was the first in a series of papers coming out of the\n3\n-author collaboration. There followed:\nThe upper and lower central series in linear groups\n(2022)\n;\nLinear groups with restricted conjugacy classes\n(2022)\n;\nGroups whose proper subgroups are linear\n(2022)\n;\nSubnormality in linear groups\n(2023)\n;\nHall classes of groups with a locally finite obstruction\n(2024)\n;\nHall classes in linear groups\n(2024)\n; and\nHall classes of groups\n(2024)\n.\nAlthough de Giovanni was passionate about group theory, this did not mean that he could not also be passionate about other interests. One of these interests was collecting rare coins and medals. He also collected numismatic books and manuals for ancient coin collectors and had an exceptionally valuable collection of such works\n[\n5\n]\n:-\n... he liked to share his passions with students and friends, and in fact when he wanted to reward a student or a friend for their success\n(\nmaybe they won a position somewhere, or they got a promotion\n)\n, he usually gifted them with a rare coin or medal.\nAnother of his passions was football and he was an avid supporter of Juventus FC. His passion for Juventus certainly was not to do with where it is based since the club is based in Turin, a considerable distance from Naples. In fact we doubt there are many major Italian football teams based further from Naples than Juventus\n[\n5\n]\n:-\n... just think that at some point, in his office, a reproduction of the Juventus Stadium appeared. He was so passionate about Juventus that many members of his family and some of his students became\n(\nand already were\n)\nJuventus supporters as well. As he would always tell, at some point in time, he was so passionate that he started thinking that if Juventus would lose a match, then something bad would happen to him.\nDe Giovanni played a large role in supporting Italian mathematics, for example he was a member of the Scientific Committee of the\nItalian Mathematical Union\nfrom\n1997\nto\n2015\n. He was also President of Mathesis\n2021\nto\n2024\n. Mathesis, the Italian Society of Mathematical and Physical Sciences, was founded in\n1895\non the initiative of some secondary school teachers with the aim of improving and strengthen the teaching of mathematics in schools of all levels. It is one of the oldest Italian scientific societies, and in particular the oldest dedicated to mathematics. There is another way that de Giovanni has made a major contribution to group theory and that is through his editorial work. He served on the editorial boards of: the\nMediterranean Journal of Mathematics\n;\nNote di Matematica\n;\nMathematics\n;\nRendiconti dell'Accademia di Scienze Fisiche e Matematiche della Società Nazionale di Scienze Lettere ed Arti\n;\nBollettino dell'Unione Matematica Italiana\n; and the\nJournal of Group Theory\n. In addition to serving on the boards of these journals, he was editor-in-chief of the journals\nRicerche di Matematica\nand\nPeriodico di Matematiche\n. Despite all this editorial work, or perhaps because of it, he decided to found a group theory association and an associated journal.\nIn\n2015\nde Giovanni founded the association \"AGTA - Advances in Group Theory and Applications\" with himself as President\n[\n2\n]\n:-\nThe association \"AGTA - Advances in Croup Theory and Applications\" aims to promote and disseminate the scientific culture and the research in group theory and its applications, and it wishes to become a reference point for young people intending to start research on this subject, regardless of their geographical origin. To achieve this purpose, AGTA organises international conferences and publishes a journal devoted to group theory and its applications. The section \"Group Theory News\" contains information on other meetings of interest to researchers of the theory, while \"'Group Theory Archivum\" is a collection of images, historical articles and other documents related to the theory of groups and to group theorists.\nDe Giovanni founded the open access journal\nAdvances in Group Theory and Applications\nto be issued by the association AGTA. The Aims and Scope are given in\n[\n1\n]\n:-\nThe journal Advances in Group Theory and Applications is a publication issued by the non­profit association AGTA, with the aim of publishing high-quality research papers containing original and significant results in any topic of group theory and its applications. In order to submit a paper to Advances in Group Theory and Applications it must not have been previously published\n(\nin any language\n)\nand it must not be under evaluation for publication elsewhere; moreover, its submission must have been approved by all co-authors\n(\nif any\n)\n. Papers are accepted after a rigorous peer-review process in order to guarantee an high quality of the published papers and avoid plagiarism. Note that there are no publication processing charges, since all costs associated with the publication and production are covered by the association AGTA.\nAGTA wishes that the journal could be a reference point for all group theorists, and in particular for the young ones; to this aim the journal also contains a section of open problems and allows reproduction and distribution of the papers only for non-commercial uses.\nDe Giovanni had many other ideas to implement things useful to group theorists. For example, in collaboration with Marco Trombetti he implemented the Group Theory Genealogy Project. This has constructed a graph with group theorists as vertices and edges are \"Ph.D. advisor to student.\" As of June\n2024\nthere are\n2315\ngroup theorists in the graph, each with their photograph\n(\nif available\n)\n. Also with Marco Trombetti, he created the Group Theory Impact Factor\n[\n2\n]\n:-\nThe aim of the Group Theory Impact Factor is to provide a solid way to recognise which journals have a central role in group theory. The index is calculated on a time span of\n10\nyears, it essentially depends on how many citations per group-theory-paper the journal has and also on how many group-theory-papers the journal publish each year.\nTo calculate this index, they have examined all the group theory papers in\n174\njournals over a period of ten years. Other projects de Giovanni initiated are AGTA Conferences, AGTA Research Project in Naples, the\nReinhold Baer\nPrize, AGTA Lost Monographs, Open Problems in Group Theory, and Researching in Group Theory.\n(\nSee\n[\n2\n]\nfor details about all these projects\n)\n. After de Giovanni died in February\n2024\n, Marco Trombetti wrote\n[\n11\n]\n:-\nWith his untimely passing, he not only left an unfillable void in our hearts, but he also left many unaccomplished projects and dreams concerning the association AGTA - Advances in Group Theory and Applications, the journal and the future of group theory itself. But he had\n(\nand still has\n)\nmany friends and students sharing those same dreams, and they are now trying to carry on his wishes, so I'm pretty sure that these dreams will become reality one day or another.\nHe died of a heart attack at the young age of\n68\n. That he remained remarkably active in the last years of his life can be seen from the activities we have described above and the fact that in\n2020\n-\n2024\nhe published\n20\nresearch papers.\nThe authors of\n[\n3\n]\nwrite:-\nFrancesco was not only a scientific guide for his students, but also an example of humanity. He knew how to value each person for their own peculiarities, establishing a relationship of deep affection. He enthusiastically praised them for their successes and encouraged them with gentleness and understanding in moments of difficulty. With many colleagues he has established a sincere friendship, made not only of mutual respect but also of affection and conviviality. The smile he had when he was in the company of the people he loved, family, friends, colleagues and students, will forever remain in the hearts and minds of those who were close to him.\nThe authors of\n[\n5\n]\nwrite:-\nOn\n29\nAugust\n2011\n, Francesco married Mariella Longobardi\n(\nwho is currently Professor of Probability at the University of Naples \"Federico II\"\n)\n. They happily lived ever since with five sons\n(\nAlberto, Francesca, Domenico and the twins Reinhold and Cristiano\n)\nin a house full of love and animals until that tragic day, when an unpredictable heart attack took him from their lives. ... in fact he lived with five cats\n(\none of which was named after another group theorist, \"Romalis\"\n)\n, some canaries, and two seagulls. Another of Francesco's passions was art in general, and literature and reading in particular. His favourite book was \"The Master and Margarita\" by Mikhail Bulgakov, but he also liked very much those of Andrea Camilleri.\nAmong the honours given to de Giovanni for his outstanding contributions to group theory, we should mention that he was awarded an honorary doctorate in\n2006\nby the National University of Ireland\n(\nGalway\n)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Statistics"
  ]
}