{
  "nome_completo": "Frans van Schooten",
  "nome_curto": "Frans van Schooten",
  "ano_nascimento": "1615",
  "ano_morte": "1660",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schooten/",
  "lugar_nascimento": "Leiden, Netherlands",
  "lugar_morte": "Leiden, Netherlands",
  "biografia": "Frans van Schooten\n's name can also be written as Frans van Schoten or Frans Verschooten. Sometimes the Latin version Franciscus van Schooten is used. We should refer to the subject of this biography as Frans van Schooten Junior so as not to confuse him with his father, Frans van Schooten Senior\n(\nsometimes called The Elder\n)\n, who was also a mathematician. Frans van Schooten Senior was born in\n1581\nin Nieuwkerke in West Flanders, but when he was two years old his father\n(\nthe grandfather of the subject of this biography\n)\n, who was a baker, fled to avoid the advancing Spanish troops. The family were Protestants and so feared for their lives both from the Catholic troops and from the Inquisition. They settled in Leiden where van Schooten Senior's brother Joris van Schooten was born in\n1587\n. Joris became a painter and his work can still be seen in the Lutheran church in Leiden and in museums; perhaps he is most famous for having Rembrandt as a pupil. Frans Senior married Jannetgen Haermansdr van Hogenvorst from Delft in\n1609\n. Their first child was Frans van Schooten Junior but certainly by\n1625\nJannetgen had died and on\n31\nMarch of that year his father remarried. His second wife was Maria Gool, the cousin of his colleague\nJacob Gool\n. Frans van Schooten Senior studied mathematics under\nLudolph van Ceulen\nat the Engineering School in Leiden. However,\nvan Ceulen\ndied in\n1610\nwhile van Schooten Senior was still a student. In\n1612\nvan Schooten Senior filled the vacant position at the Engineering School, and he was given the title of professor three years later. Van Schooten Senior published works such as a treatise on perspective in\n1600\n,\nTabulae sinuum tangentium secantium, ad radium\n10000000\nⓉ\n(\nTables of sines, tangents and secants, to a radius of\n10000000\n)\nin\n1627\n, and a Dutch translation of\nEuclid\n's\nElements\n.\nWe should say a little about the Engineering School at Leiden, for it plays a major role in the lives of Frans van Schooten Senior, Frans van Schooten Junior, and Pieter van Schooten\n(\nthe half-brother of the subject of this biography\n)\n. Prince Morits August of Orange, a son of William of Orange, became Stadtholder of Holland and Zeeland, and Admiral of the Dutch fleet, in\n1585\n. He needed administrators, calculators, surveyors, mapmakers and fortress builders so decided to set up an Engineering School where such skills could be learnt. In\n1600\nPrince Morits asked\nSimon Stevin\n, who was in his service as an advisor, to set up an engineering school within the University of Leiden.\nStevin\ndrew up the mathematical teaching programme for the School and\nLudolph van Ceulen\nand Simon Fransz van Merwen were appointed as the first lecturers in the School. It was housed in a vacant convent - in fact many monasteries were empty at this time either because the Catholic monks had voluntarily left Protestant Holland or, in some cases, because they had been driven out. Rudolph Snell\n(1546\n-\n1613)\nwas the professor of mathematics at the University of Leiden and also supervised the examinations at the Engineering School. After his death in\n1613\nhis son\nWillebrord Snell\nsucceeded him.\nWillebrord Snell\ndied in\n1626\nand was succeeded by\nJacob Gool\nwhom we mentioned above. As well as being professor of mathematics, he was also the professor of Arabic.\nVan Schooten Junior had been taught by his father and had studied mathematics, French and Latin before he enrolled at the University of Leiden on\n15\nMay\n1631\n. He had a good background in mathematics having studied\nMichael Stifel\n's edition of\nChristoff Rudolff\n's\nCoss\nand read both Dutch and French editions of works by\nSimon Stevin\n. He had read\nLudolph van Ceulen\n's\nArithmetische en geometrische Fondamenten\nⓉ\n(\nArithmetic and geometric fundamentals\n)\n,\nAlbert Girard\n's\nInvention nouvelle en l'algèbre\nⓉ\n(\nA new discovery in algebra\n)\n, as well as\nGirard\n's edition of\nStevin\n's\nArithmetique\nand\nBonaventura Cavalieri\n's work on indivisibles. Van Schooten was also familiar with the classical Greek texts having read\nFrederico Commandino\n's editions of works by\nArchimedes\n,\nApollonius\nand\nPappus\n. At the University of Leiden, he studied mathematics under professor\nJacob Gool\n. It was through\nGool\nthat van Schooten Junior was first introduced to\nDescartes\nin\n1632\n. While he was a student, his half-brother Pieter van Schooten was born in Leiden on\n22\nFebruary\n1634\n. Pieter also became a mathematician and architect, and later taught at the Engineering School in Leiden; he died in\n1679\n. Van Schooten Junior graduated with his Artium Liberalium Magister from the University of Leiden in\n1635\n.\nAfter graduating, he began teaching at the Engineering School. Two years later when\nDescartes\nwas visiting Leiden he again met van Schooten Junior. At this stage\nDiscours de la méthode\nⓉ\n(\nDiscourse on method\n)\nwith its appendix\nLa Géométrie\nⓉ\n(\nGeometry\n)\nhad not been published and\nDescartes\nasked van Schooten Junior to assist with making the illustrations. He also made a portrait of\nDescartes\n, one of the few that exist. That he was a talented artist should come as no surprise, for we mentioned above his artistically talented uncle Joris van Schooten. Strongly influenced by\nDescartes\n, van Schooten Junior wrote\nRecueil de calcul pour l'intelligence de la Geometrie de Monsr des Cartes\nⓉ\n(\nCompendium of calculation for the understanding of the geometry of Descartes\n)\n, a short work on symbolic algebra, around\n1639\n. This contact with\nDescartes\nproved important for van Schooten since\nDescartes\nprovided contacts for van Schooten to become acquainted with\nMarin Mersenne\n's circle in Paris on an extended period of travel. Around\n1641\nhe set out, travelling first to Paris where he met\nMersenne\nand learnt about the mathematical advances made by\nViète\nand\nFermat\nas well as having the opportunity to further his studies of\nDescartes\n' works.\nFermat\n's results were contained in treatises that were circulating in manuscript form and van Schooten took the opportunity to make copies of them. While in Paris he also obtained manuscripts of\nViète\n's work and, after his travels were over, he published them in Leiden as\nViète Opera mathematica\nⓉ\n(\nVieta's mathematical works\n)\nin\n1646\n. Given that we said that he had made copies of\nFermat\n's manuscripts, it is reasonable at this point to wonder why he did not publish these on his return. The answer is that he wanted to publish them but publishers were not interested. Publishers then, as now, want to know that the material they are publishing is of high quality, and\nDescartes\nhad made it known that he considered\nFermat\n's contributions to be of little value. May we suggest that this was not poor judgement on the part of\nDescartes\n, rather it was because\nDescartes\nwas trying to push the thesis that only by using his 'method' could discoveries such as Cartesian geometry be made so he played down\nFermat\n's work. Continuing his travels, van Schooten left Paris and went to London where he stayed until\n1643\ndiscussing mathematics with leading mathematicians there, finally visiting Ireland before returning to Leiden. He continued to correspond with the mathematicians that he had met on his travels after his return. Unfortunately this correspondence is now lost.\nIn\n1643\nvan Schooten became assistant to his father and when his father died two years later he was appointed to his father's chair. At this stage van Schooten was not married but lived with a housekeeper Margaritgen Wijnants from Meppen. The house was in Herensteeg, a street overlooking the Pieterskerk\n(\nSt Peter's Church\n)\nwhich contained\nvan Ceulen\n's grave with a tombstone on which\n35\nplaces of π were engraved.  By\n1649\nvan Schooten and his housekeeper had a common will, and they were formally married on\n19\nJuly\n1652\n. There is no record that they had any children.\nVan Schooten was one of the main people to promote the spread of Cartesian geometry and this is a more important contribution than the results of his own researches. He printed the first Latin version of\nDescartes\n'\nLa géométrie\nⓉ\n(\nGeometry\n)\nin\n1649\n. It is claimed that\nDescartes\n, who went to Stockholm in\n1649\n, opposed this project by van Schooten. However\nDirk Struik\nwrites\n[\n4\n]\n:-\nDescartes\nlived in the Dutch Republic from\n1629\nto\n1649\n, the period of his greatest productivity. Living a retired bachelor's life, he made his ideas known through highly advanced books and correspondence with his peers. His only mathematical book, the 'Géométrie' of\n1637\n, was sketchy and at many places obscure. The triumph of Cartesian ideas in mathematics, the creation of a Cartesian school of thought, both in Holland and to a certain extent also abroad, is in no small degree due to the Leiden professor Frans van Schooten.\nVan Schooten established a vigorous research school in Leiden which included his private pupils\nChristiaan Huygens\n,\nHenrik van Heuraet\nand\nJohannes Hudde\n, and this school was one of the main reasons for the rapid development of Cartesian geometry in the mid\n17\nth\ncentury. It had been on\nDescartes\n' recommendation that van Schooten replaced\nJan Stampioen\nas tutor to\nHuygens\nand his brother. The teacher and his extremely talented pupil soon became good friends. After his students had left Leiden, van Schooten,\nHuygens\n,\nHudde\nand\nvan Heuraet\ncorresponded regarding the properties of curves and other topics at the forefront of research at the time. Most of the correspondence was directed through van Schooten in the sense that his students would write to him to explain their discoveries and he would inform the others as well as publish certain of their results as appendices to his own publications. In a small way he was copying\nMersenne\n's way of operating which he had experienced at first hand in Paris. The authors of\n[\n3\n]\ngive an excellent overview of van Schooten's contributions:-\n[\nVan Schooten\n]\nwas very interested in and well aware of the important new developments in mathematics which combined geometry and algebra into analytic geometry. This new branch of mathematics enabled the mathematician to study properties of curves by algebraic means. There were some connections to physics ... but on the whole van Schooten confined himself to mathematics proper. He translated the 'Géométrie' into Latin\n(1649\n, second edition\n1659\n-\n61)\n, he wrote comments and explanations to it, transformed it into a systematic theory, and took it as a starting point for further exploration. In this manner he brought the new developments within the reach of his students and colleagues. Van Schooten had several bright private students,\nChristiaan Huygens\n,\nJohannes Hudde\n,\nHenrik van Heuraet\n,\nJohan Witt\nand others, constituting an active audience for Cartesian mathematics. ... The structure of the group primarily depended on personal contacts with van Schooten, who guided his chosen students into doing research, and would include their results in his own publications, especially in the\n1659\n-\n1661\nedition of the 'Géométrie'.\nThis\n1659\n-\n1661\nedition contained appendices by three of van Schooten disciples,\nJan de Witt\n,\nJohan Hudde\n, and\nHendrick van Heuraet\n. He had earlier published\nDe organica conicarum sectionum in plano descriptione, tractatus\nⓉ\n(\nTreatise on the organic description of conic sections in a plane\n)\n(1646)\nwhich was reprinted as part of his major work\nExercitationes mathematicae libri quinque\n(\nMathematical exercises in five books\n)\nⓉ\n(\nMathematical exercises in five books\n)\nin\n1657\n. Among the interesting problems he studied in his\n1646\nwork was how to write the\nn\nn\nn\nth root of\na\n+\n√\nb\na + √b\na\n+\n√\nb\nin the form\nx\n+\n√\ny\nx + √y\nx\n+\n√\ny\n, and the problem of constructing a cyclic quadrilateral of given sides, one side being required to be the diameter of the circle. The five books of\nExercitationes mathematicae\neach have about\n100\npages, so the whole work is quite a large treatise. Book I gives a review of arithmetic and basic geometry. In Book II,\nConstructio problematium simplicium geometricorum\n, he studies straight edge constructions for solving geometrical problems, followed by an attempted reconstruction of the works of\nApollonius\non plane loci in Book III. In Book IV,\nOrganica conicarum sectionum\n, which contains the earlier publication, he studied the problem of drawing conic sections mechanically. He gave the, now standard, method of drawing an ellipse with a piece of string whose ends are attached to two pegs. Several of the instruments he designed are described and illustrated in\n[\n5\n]\n. Book V is titled\nSectiones triginta miscellaneas\nand develops combinatorial techniques for counting problems.\nFermat\nand\nDescartes\nhad discovered new pairs of amicable numbers some years before\n(\npairs of numbers, the sum of the factors of one number being equal to the other number\n)\n. In this book van Schooten gives a methods to find these numbers which he hoped would lead to the discovery of further pairs of\namicable numbers\n- this however did not happen. Typical of van Schooten's publications,\nExercitationes mathematicae\nⓉ\n(\nMathematical exercises\n)\nalso contained an appendix by one of his students. This was the important work on\nprobability\nDe ratiocinis in ludo aleae\nby\nHuygens\n. It was from\nExercitationes mathematicae\nⓉ\n(\nMathematical exercises\n)\nby van Schooten that\nIsaac Newton\nlearnt much of his mathematics while a student at Cambridge.\nSee\nTHIS LINK\nand\nTHIS LINK\n.\nAfter Frans van Schooten died in\n1660\n, his half-brother Pieter van Schooten was appointed to the chair at the Engineering School at Leiden becoming the third van Schooten to hold this chair in succession. Pieter van Schooten continued in this position until his death in\n1679\n.\nLet us end our biography by quoting Hofmann's evaluation of van Schooten given in\n[\n1\n]\n:-\nSchooten possessed an excellent knowledge of the mathematics of both his own time and earlier periods. Beside being an extraordinarily industrious and conscientious scholar, a skilful communicator, and an inspiring teacher, he was a man of rare unselfishness. He recognised his own limitations and did not seek to overstep them. Fascinated by the personality and ideas of\nDescartes\n, he worked hard to popularise the new mathematics; his highly successful efforts assured its triumph.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}