{
  "nome_completo": "Friedrich Bachmann",
  "nome_curto": "Friedrich Bachmann",
  "ano_nascimento": "1909",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bachmann_Friedrich/",
  "lugar_nascimento": "Wernigerode, Germany",
  "lugar_morte": "Kiel, Germany",
  "biografia": "Friedrich Bachmann\nwas born in Wernigerode, a little town in the Harz mountains, Northern Germany. He was the son of the Lutheran minister and teacher Hans Bachmann who published works such as\nDas Jesusbild der sogenannten modernen Theologie und der geschichtliche Jesus\nⓉ\n(\nThe image of Jesus in the so-called modern theology and the historical Jesus\n)\n(1912)\n. Friedrich's paternal grandfather was the mathematician\nPaul Bachmann\n(1837\n-\n1920)\n, who had studied with\nDirichlet\nand\nDedekind\n, had\nKummer\nas the advisor for his PhD and, after his\nHabilitation\nin\n1868\nin Breslau, had become a full professor in Münster.\nPaul Bachmann\nis well known as the author of several textbooks in Number Theory and has a biography in this archive.\nFriedrich Bachmann attended the\nGymnasium\nin Münster and, after graduating, he studied from\n1927\nin Berlin and Münster. His first area of research was Mathematical Logic and the Foundations of Mathematics, and in\n1933\nhe was awarded his PhD by the Westfälische Wilhelms University of Münster for his thesis\nUntersuchungen zur Grundlegung der Arithmetik mit besonderer Beziehung auf Dedekind, Frege, und Russell\nⓉ\n(\nStudies on the foundation of arithmetic with special reference to Dedekind, Frege and Russell\n)\n. His thesis advisor at Münster had been\nHeinrich Scholz\n(1884\n-\n1956)\nwho had been appointed there as a full professor of Philosophy in\n1928\nand later became professor of Mathematical Logic and Foundations of Mathematics.\nAfter further work on logic, including starting to prepare the correspondence between\nGottlob Frege\nand\nBertrand Russell\nfor publication, Bachmann turned to questions on geometry. In\n1936\nhe published in\nMathematische Annalen\n(\nvolume\n113\n, pages\n424\n-\n451)\nthe extensive paper\nEine Begründung der absoluten Geometrie der Ebene\nⓉ\n(\nA justification of absolute geometry of the plane\n)\nin which he investigated plane absolute geometries based upon a set of incidence, orthogonality, and weak congruence axioms. He continued this work in his paper\nStufen der absoluten Geometrie. Die Frage nach der Unabhängigkeit der Anordnung\nⓉ\n(\nStages of absolute geometry. The question of the independence of the arrangement\n)\n(1940)\npublished in the same journal. From\n1935\nhe was an assistant to\nKurt Reidemeister\nin Marburg where he habilitated in\n1939\n, becoming a\nPrivatdozent\nthere. In\n1941\nand\n1943\n-\n44\nhe lectured at Königsberg, having lectured at the Humboldt University of Berlin during the academic year\n1942\n-\n43\n. He published\nEin lineares Vollständigkeitsaxiom\nⓉ\n(\nA linear completeness axiom\n)\nin\n1943\nin which he investigated\nHilbert\n's system of axioms for Euclidean geometry. In the same year he began substituting for Fritz Lettenmeyer at the Christian-Albrechts Universität in Kiel where he was promoted to 'Ordentlicher Professor'\n(\nFull Professor\n)\non\n1\nMarch\n1949\n.\nTogether with\nKarl-Heinrich Weise\n, Bachmann had a main share in rebuilding the 'Mathematisches Seminar' at Kiel after the war. In\n1962\n-\n63\nhe was elected Dean of the Mathematics and Science section of the Faculty of Philosophy of Kiel University. Together with others, from\n1960\nonwards he served as editor of the several volume work\nGrundzüge der Mathematik für Lehrer an Gymnasien sowie für Mathematiker in Industrie und Wirtschaft\nⓉ\n(\nPrinciples of mathematics for teachers at secondary schools and for mathematicians in industry and business\n)\n.\nBachmann's lectures were highly liked and respected for their clarity and for being well structured. He would take extreme care in their preparation. Several of his courses were circulated in the form of very readable lecture notes. Many of the mathematics students at Kiel at that time owe an important part of their mathematical education to him. As demonstrated in the 'Mathematical Genealogy Project', several of his PhD students later became professors of mathematics. Although he did not like publicity much, his profound knowledge of philosophy and logic allowed him to play an important role when a chair in the department of philosophy was dedicated to logic and filled by Paul Lorenzen from\n1956\nto\n1962\n, and later by Kurt Schütte from\n1963\nto\n1966\n, broadening the scope of mathematics at Kiel beyond the 'Mathematisches Seminar' proper.\nHis scientific work at Kiel was mainly devoted to the axiomatic foundation of geometry. In the short note\nZur Begründung der Geometrie aus dem Spiegelungsbegriff\nⓉ\n(\nIn support of the geometry of line reflection\n)\nin\nMathematische Annalen\nin\n1951\nhe presented his well-known reduced version of A Schmidt's 'Axiomensystem der metrischen\n(\nabsoluten\n)\nGeometrie' which is a system of axioms for absolute geometry based on line reflection only. In\n1959\nhis monograph\nAufbau der Geometrie aus dem Spiegelungsbegriff\nⓉ\n(\nConstruction of the geometry of line reflection\n)\nappeared as vol. XCVI of the\n(\nSpringer\n)\n'Grundlehren der Mathematischen Wissenschaften'. In this book Bachmann develops plane metric geometry by systematic use of reflections and the group of motions generated by them. In the preface he summarizes the main idea of his approach:-\nIf one coinsiders the reflections themselves as geometric entities, namely as new \"points\" and \"lines\", one can define geometric relations such as \"incidence\" and \"orthogonality\" between them by group theoretical relations in such a way that the new domain is a faithful image of the originally given points and lines with their incidence, orthogonality etc.\nDonald Coxeter\n, in the review\n[\n2\n]\n, writes:-\nThis remarkable book is essentially an elaboration of an idea of G Thomsen\n(\nThe treatment of elementary geometry by a group-calculus, Math. Gaz.\n17\n(1933)\n,\n232)\n. ... One soon begins to realize that such a geometry is not necessarily Euclidean. It is more like the \"absolute\" geometry of\nBolyai\n, in which a pencil of lines having a common perpendicular is not necessarily the same as a pencil of parallels. In fact, the geometry may be regarded as a special kind of abstract group whose generators, called \"points\" and \"lines,\" are involutory, with the distinction that , although the product of two lines may be a point, the product of two points is never a line. Even this restriction is later waived so as to cover the case of a generalized elliptic geometry which admits an absolute polarity.\nCoxeter\nends his review as follows:-\nThe above remarks may serve to suggest something of the flavour of this unusual book, which is well written, well printed, well indexed, and \"chock full\" of unfamiliar results. All geometers and most algebraists will be glad to keep it on an accessible shelf.\nBachmann published an extended and updated second edition of this book in\n1973\n. Later Bachmann dealt with an extension of his approach to so-called Hjelmslev groups, which is presented in the\n1989\n, posthumously published, book\nEbene Spiegelungsgeometrie. Eine Vorlesung über Hjelmslev-Gruppen\nⓉ\n(\nLine reflection geometry. A lecture on Hjelmslev groups\n)\n. Dirk Keppens writes:-\nThis interesting book deals with a class of plane metric geometries associated to certain groups. ... The book presents a detailed and complete study of the important class of Hjelmslev groups and their associated Hjelmslev group planes. ... It is proved that the groups of plane absolute geometry are Hjelmslev groups. ... . By means of the additional polar triangle axiom the Hjelmslev groups can be divided into two classes: elliptic and nonelliptic ones. Both classes are studied and all elliptic Hjelmslev groups are classified. ... This book is a must for all research workers in metric geometry and for all mathematicians interested in geometry and groups.\nIn\n1970\n, in collaboration with Eckart Schmidt, Bachmann had published\nn-Ecke\nⓉ\n(\nn-gons\n)\n(\nan English translation with the title\nn-gons\nappeared in\n1975)\n. Dirk Keppens, reviewing the\n1970\nGerman version, begins his review as follows:-\nThis is a delightful little book on polygons or, rather, on mappings between polygons. The authors prefer the title '\nn\nn\nn\n-gons'\n(\nin contrast to polygons\n)\nfor this book, since the mappings under consideration always map\nn\nn\nn\n-gons into\nn\nn\nn\n-gons for a fixed\nn\nn\nn\n. As a consequence the classes that will occur are classes of\nn\nn\nn\n-gons, again for the same\nn\nn\nn\n.\nFriedrich Bachmann retired on\n31\nMarch\n1977\n, he died on\n1\nOctober\n1982\nin Kiel, leaving his wife Alexandra née von Bredow, who was a great-granddaughter of Bismarck, and a son Sebastian.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}