{
  "nome_completo": "Fritz John",
  "nome_curto": "Fritz John",
  "ano_nascimento": "1910",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/John/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "New York, USA",
  "biografia": "Fritz John\n's father was Hermann Jacobson-John and his mother was Hedwig Bürgel. He studied mathematics from\n1929\nto\n1933\nin Göttingen where he was most influenced by Gustav Herglotz,\nRichard Courant\nand\nHans Lewy\n. On\n30\nJanuary\n1933\nHitler had come to power and on\n7\nApril\n1933\nthe Civil Service Law had been passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. This was an unfortunate time for a non-Aryan such as Fritz John to be completing his doctoral studies. He saw no future for non-Aryans in the Third Reich and made the decision to go to England.\nJohn published his first paper in\n1934\n; it dealt with\nMorse\ntheory. After receiving the doctoral degree in\n1934\nfrom Göttingen, John was assisted by\nRichard Courant\nto go with his wife to Cambridge, England. He applied to the Academic Assistance Council which had been set up in Britain to deal with such cases. However, the Council did not have the necessary funds to support the academics who were arriving in Britain and it only became possible to give John support because St John's College, Cambridge offered help. This enabled John to spend a year in St John's College as a research scholar. He published papers at this time on the\nRadon\ntransform, a research theme which he would continue to develop for the first period of his career.\nThe University of Kentucky at Lexington offered John an appointment as assistant professor in\n1935\nand he emigrated to the United States becoming naturalised in\n1941\n. From\n1935\ntill\n1946\nJohn lectured at the University of Kentucky where he was promoted to associate professor in\n1942\n. In that year he held a Rockefeller Foundation Fellowship. He was released by the University of Kentucky from\n1943\nto\n1945\nwhile he did war service, being sent to the Ballistic Research Laboratory at the Aberdeen Proving Ground, Maryland as a mathematician for the U.S. War Department.\nHe became an associate professor at New York University in\n1946\nwhere he stayed for the rest of his life. In\n1950\n-\n51\nthe National Bureau of Standards appointed him as Director of research for the Institute of Numerical Analysis while at New York University he became involved with the Courant Group, an applied mathematics research team which\nRichard Courant\nwas building based on the Göttingen model. John was promoted to professor at New York University in\n1951\nand continued his association with the Institute of Mathematical Sciences which was set up under\nCourant\n's leadership in\n1953\n.\nWe mentioned John's early work on the\nRadon\ntransform earlier in this article. From the beginning of his research career through his years in Lexington and during his first fifteen years in New York, his research continued to investigate the\nRadon\ntransform. He applied this in his study of general properties of linear partial differential equations, convex geometry and the mathematical theory of water waves. He wrote an important series of papers on numerical analysis, studying ill-posed problems.\nIn\n1955\nhe held a Fulbright Lectureship at Göttingen University and he was awarded Guggenheim travel grants in\n1963\nand\n1970\n. Roughly the period between these travel grants marks a second phase in John's work. During these years he investigated the mathematical theory of equilibrium nonlinear elasticity. It was in this period that John introduced the space of functions of bounded mean oscillations which plays a fundamental role in harmonic analysis and nonlinear elliptic equations.\nJohn was appointed to the Courant Chair at the Courant Institute of Mathematical Sciences at New York University in\n1978\n. The following year he was Sherman Fairchild Distinguished Scholar at the California Institute of Technology and, in\n1980\n, Senior U.S. Scientist Humboldt awardee in West Germany. He retired in\n1981\nbut at this time his work was concentrating on the theory of nonlinear wave equations. He did not stop work on this topic just because he had retired and continued working on this line of research for at least a further ten years. The paper\n[\n5\n]\n, written by one of John's former students and his collaborator over this final period, gives extensive details of this final phase of John's research.\nMany awards were made to John for his mathematical contributions. He was awarded honorary degrees by the universities of Rome, Bath and Heidelberg. He was awarded the\nGeorge David Birkhoff\nPrize in Applied Mathematics\n(1973)\n, and the Steele Prize by the\nAmerican Mathematical Society\nin\n1984\n. The response he gave at the presentation ceremony in Toronto is interesting:-\nI am highly honoured by this award of a Steele Prize by the American Mathematical Society. I just want to make a remark of a more personal nature about my work. The science of mathematics depends for its growth on the flow of information between its practitioners. The joy of discovering new results ought to be matched by the joy in studying the achievements of others. Unfortunately this latter enjoyment is made difficult by the overwhelming volume of mathematical output and the work involved in absorbing the context of even a single paper. Every mathematician has to compromise on the amount of energy he cab devote to the literature. I myself have been irresistibly attracted to mathematical research almost since my childhood, but always was loath to spend the time needed to keep up with developments. This has severely limited my work. Fortunately there was a compensating factor. I was able to spend most of my mathematical life in the stimulating atmosphere of the\nCourant\nInstitute of Mathematical Sciences at New York University, where I could draw freely on the knowledge and experience of my colleagues.\nLars Gårding\n, writing a Foreword to\n[\n1\n]\n, gives an interesting other side to this view:-\nEvery beginning mathematician eager to prove himself should from time to time study the serious thinking of some of the seminal papers of the past. This will give both a perspective on and a relief from his daily labour with the very latest developments in his field. For anyone interested in the analysis of partial differential equations, the work of Fritz John is especially rewarding. He wrote by now classical papers in convexity, ill-posed problems, the numerical treatment of partial differential equations, quasi-isometry and blow-up in nonlinear wave propagation.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}