{
  "nome_completo": "Gabriel Mouton",
  "nome_curto": "Gabriel Mouton",
  "ano_nascimento": "1618",
  "ano_morte": "1694",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mouton/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Lyon, France",
  "biografia": "Gabriel Mouton\nobtained his doctorate in theology in Lyon. However he spent much of his spare time studying mathematics and astronomy. He took holy orders and spent his whole career in St Paul's Church in Lyon where he was appointed in\n1646\n. Speziali writes in\n[\n1\n]\n:-\nHe spent his whole life in his native city, fulfilling his clerical responsibilities and untroubled by any extraordinary events. During his leisure time he studied mathematics and astronomy and rapidly acquired a certain renown in the city.\nJean Picard\n, who also was an abbé, held Mouton in high esteem and always visited him when in Lyon to work on the determination of the city's geographic position.\nHis most famous work\nObservationes diametrorum solis et lunae apparentium\nⓉ\n(\nObservations of apparent diameters of the sun and of the moon,\n)\npublished in\n1670\nstudied interpolation and a standard of measurement based on the pendulum.\nLalande\nwrote:-\nThis volume contains interesting memoirs on interpolations and on the project of a universal standard of measurement based on the pendulum.\nHis methods of interpolation used successive numerical differences in a way similar to those used by\nBriggs\nin the construction of his logarithm tables. In this work Mouton became the first to propose the decimal system of measurement based on the size of the earth. He also suggested a standard linear measurement, which he called the mille, based on the length of the arc of one second of longitude at the equator on the Earth's surface and divided decimally. He suggested divisions he called the\ncenturia, decuria, virga, virgula, decima, centesima\nand\nmillesima\nso that a\nvirgula\n, a ten thousandth of a mille, was about\n18\n.\n5\ncm or a little over\n7\ninches. The\nvirga\nwas quite close to the ancient French measure of a\ntoise\nor\n6\npieds\n(\nfeet\n)\n. Mouton wanted a practical means to determine the length of a\nvirgula\n. Certainly one could not measure the circumference of the earth, so he proposed a standard based on the length of a pendulum. He conducted experiments which led him to the conclusion that a simple pendulum of length one\nvirgula\nwould oscillate\n3959\n.\n2\ntimes in\n30\nminutes. Mouton stated that there was a marvellous regularity in nature which made a metric system of measurement based on nature fit in with human activity.\nMouton's proposed standard of measurement was taken seriously, at least at the theoretical level, and\nJean Picard\nstrongly supported him, as did\nHuygens\nin\n1673\n. In London the\nRoyal Society\nalso considered these proposals to have considerable merit. It would be over\n100\nyears, however, before the French returned to Mouton's proposal and the definition of the metre was made in a different way to Mouton's suggestion.\nLeibniz\nmade discoveries similar to Mouton. Speziali writes in\n[\n1\n]\n:-\nWhen\nLeibniz\nwent to London in January\n1673\n, he took with him his \"Dissertio de arte combinatoria\"\nⓉ\n(\nDissertation on the art of combinatorics\n)\n. He summarised its contents to\nJohn Pell\nand in particular, explained what he called \"différences génératrices.\"\nⓉ\n(\nGenerating differences.\n)\nPell\nremarked that he had read something very similar in Mouton's book, which had appeared three years earlier.\nLeibniz\nhad learned, during his stay in Paris, that the book was in preparation but did not know that it had been published. While visiting Oldenburg,\nLeibniz\nfound Mouton's book and observed that\nPell\nhad been right; but he was able to prove that his own, more theoretical and general ideas and results had been reached independently of Mouton's.\nMouton also produced\n10\nplace tables of logarithmic sines and cosines and an astronomical pendulum of remarkable precision. As an astronomical observer he made remarkably accurate observations of the apparent diameter of the sun.",
  "math_areas": [
    "Combinatorics"
  ]
}