{
  "nome_completo": "Garrett Birkhoff",
  "nome_curto": "Garrett Birkhoff",
  "ano_nascimento": "1911",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Birkhoff_Garrett/",
  "lugar_nascimento": "Princeton, New Jersey, USA",
  "lugar_morte": "Water Mill, New York, USA",
  "biografia": "Garrett Birkhoff\n's father was\nG D Birkhoff\nwho also has a biography in this archive. Garrett was educated at home until he was eight years old when he began to attend school. This first school was a public grammar school\n(\npublic school here is the American meaning so is the opposite of a private school\n)\nwhich he attended for three years then, rather than enter high school at this young age, he spent a year enjoying himself playing sports and maturing before entering Browne and Nichols school at the age of twelve. Unlike his first school, Browne and Nichols was a private school.\nAt Browne and Nichols high school he had an excellent mathematics teacher in Harry Gaylord who had written a textbook with\nBôcher\n. Again, as at his primary school, Garrett progressed very rapidly and despite going to Europe with his parents during his third year of study he was still ready to take the examinations a year early. His parents had encouraged him to do this because they were going on a major year long tour and so, after passing the examinations, Garrett attended a boarding school at Lake Placid for a year, spending much time on sport, before he entered Harvard University in\n1928\n.\nBefore he entered Harvard, Birkhoff's father pressed him to decide on what profession he would eventually follow. That was when\n[\n2\n]\n:-\n... I decided to become a mathematician. I liked mathematics, and my father being a mathematician was no reason I should not become one too.\nGarrett's father,\nG D Birkhoff\n, advised him to study mathematical physics and Garrett took undergraduate courses with this aim in mind. He attended a course on\npotential theory\ngiven by\nOliver Kellogg\nwhich gave him a good understanding of\ndifferential equations\n. He had already attended a course on analytical mechanics given by\nKellogg\non his first year of study. A course by E C Kemble on\nquantum mechanics\nas well as courses on\nLebesgue\nintegration and\ntopology\ngave him a broad education in mathematics. With lecturers such as\nMorse\nand\nWhitney\n, Birkhoff certainly had inspiring teachers at Harvard. He learned mathematics in addition to the courses he took, for\n[\n2\n]\n:-\n... as a senior, I secretly discovered finite groups in the library, and fell in love with them.\nBirkhoff graduated from Harvard in\n1932\nand was awarded a Henry Fellowship to study at Cambridge University in England. At first he was supervised on mathematical physics at Cambridge but, with a growing interest in abstract algebra, he changed supervisors to work with\nPhilip Hall\n. Birkhoff published a joint paper will\nHall\n,\nOn the order of groups of automorphisms\nwhich appeared in\n1936\n. From Cambridge Birkhoff went to Munich for a month in July\n1933\nand worked on his own on group theory, but while he was there he visited\nCarathéodory\nwho pointed him towards\nvan der Waerden\n's algebra text and Speiser's group theory book.\nReturning to the United States, Birkhoff was a member of the Society of Fellows at Harvard from\n1933\nto\n1936\n, and then he was appointed as an instructor at Harvard in\n1936\n. He worked on two important texts. The first to be published was\nLattice Theory\nwhich appeared in\n1940\n. The second was his famous work\nSurvey of Modern Algebra\nwritten jointly with\nMac Lane\n.\nMac Lane\nhad been at Harvard during\n1934\n-\n36\nand in\n1937\nBirkhoff taught his first undergraduate course on abstract algebra. When\nMac Lane\nreturned to Harvard in\n1938\nhe took over teaching Birkhoff's undergraduate algebra course, then\nMac Lane\ntook the course back in\n1939\n. A joint book growing out of these courses was the natural outcome and\nSurvey of Modern Algebra\nwas published in\n1941\n.\nKaplansky\nwrote about the importance of the text:-\n\"A Survey of Modern Algebra\" opened to American undergraduates what had until then been largely reserved for mathematicians in\nvan der Waerden\n's Moderne Algebra, published a decade earlier. The impact of Birkhoff and\nMac Lane\non the content and teaching of algebra in colleges and universities was immediate and long sustained. What we recognise in undergraduate courses in algebra today took much of its start with the abstract algebra which they made both accessible and attractive.\nMore about this book is at\nTHIS LINK\nand also at\nTHIS LINK\n.\nDuring World War II Birkhoff became involved in applied mathematics again. Perhaps this is rather misleading, for Birkhoff did not consider this work closely related to the mathematical physics which he had started out on. He said\n[\n2\n]\n:-\nMathematical physics and engineering are very different, and I have been more attracted to engineering mathematics, which is concerned with practical problems of immediate importance, than to mathematical physics.\nThis involvement in engineering mathematics came through a committee which he was on together with included\nMorse\nand\nvon Neumann\n. They studied devices to calculate the distance to a target using radar echoes. Later Birkhoff was involved in war work at the Ballistic Research Laboratory at the Aberdeen Proving Ground investigating the effectiveness of exploding shells. Still later a wartime project with the Navy led him into investigating bouncing bombs on water and shock waves around projectiles.\nThe outcome of this last piece of war work was the texts\nHydrodynamics\n(1950)\nand a few years later\nJets, Wakes and Cavities\n(1957)\n. The first of these grew out of lectures he had given at the University of Cincinnati aimed at showing that\n[\n2\n]\n:-\n... hydrodynamics is not what\nLamb\nthought it was.\nBirkhoff's work also took him into computing and his friendship with\nvon Neumann\nled to many interesting discussions on this topic. Computational methods certainly came to the fore when he worked as a consultant for the Westinghouse Corporation in beginning in\n1954\n. This led to Birkhoff's interest in numerical linear algebra.\nAnother piece of consultancy work led Birkhoff into yet another area of mathematics. This is explained in\n[\n6\n]\n:-\nGarrett began his consulting work with General Motors Research in\n1959\n. One of the problems posed there was the mathematical representation of automobile surfaces in order to exploit the then new numerically controlled milling machines for the cutting of dies: these dies were needed for stamping of the outer and inner panels of automobiles. Garrett was quick to recommend the use of cubic splines\n(\ni.e. piecewise cubic polynomials with two continuous derivatives\n)\nfor the representation of smooth curves.\nIn\n1969\nBirkhoff was appointed George Putnam Professor of Pure and Applied Mathematics at Harvard. He held this post until he retired in\n1981\n. He published another important text, jointly with Thomas Bartee, in\n1970\non\nModern Applied Algebra\n. Of the book, which covers applications such as coding theory, Birkhoff said\n[\n2\n]\n:-\nThe book was Bartee's idea, and he selected the applications. We wrote it during the late\n1960\ns.\nYou can see more about this book at\nTHIS LINK\n.\nBirkhoff received many honours. He was awarded honorary degrees by six universities world-wide, he was elected to the\nNational Academy of Sciences\nand the\nAmerican Academy of Arts and Sciences\n. The article\n[\n7\n]\nlists\n50\nstudents who studied for their doctorates under Birkhoff, while\nMathematical Reviews\nlist\n229\npapers authored by him.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Topology"
  ]
}