{
  "nome_completo": "Gaston Maurice Julia",
  "nome_curto": "Gaston Julia",
  "ano_nascimento": "1893",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Julia/",
  "lugar_nascimento": "Sidi bel Abbès, Algeria",
  "lugar_morte": "Paris, France",
  "biografia": "Gaston Julia\n's parents were Delorès Delavent and Joseph Julia. Two generations before, the family had left the Spanish Pyrenees to become established in Algeria after the French colonised the area. Joseph Julia, who was a mechanic, was working in Sidi-bel-Abbès when his son was born. Gaston became interested in mathematics and music when he was young.  He entered school when he was five years old, and was taught by Sister Théoduline. She gave young Gaston certain principles which he followed throughout his life, in particular to always aim at being top in everything he did. She also encouraged Gaston's mother to provide financial support to allow her son to have a good schooling, something that was very difficult to achieve given that the family were very poor. Gaston studied with the Frères des Écoles Chrétiennes\n(\nBrothers of the Christian Schools\n)\nfrom the age of seven. His outstanding abilities were quickly spotted, and his teachers encouraged Gaston's parents to try to get a scholarship to allow him to study at high school.\nIn\n1901\n, when Gaston was eight, the family moved to Oran, a city on the Mediterranean coast in northwest Algeria\n70\nkm north of Sidi-bel-Abbès. There Gaston's father earned his living repairing agricultural machinery. Gaston entered the Lycée in Oran, and his parents wanted him to begin his studies in grade\n5\n. However, the teachers pointed out that pupils in that grade had already studied German for one year while Gaston had no knowledge of the language. However, Gaston requested that they give him a month in the class to prove that he could catch up. Learning on his own from books, he soon caught up and was allowed to remain in this class. By the end of one year he was the best pupil in German as well as in every other subject that he studied. He graduated with distinction in the baccalaureate examinations in science, modern languages, philosophy and mathematics.\nJulia won a scholarship which allowed him to go to Paris and spend the year\n1910\n-\n11\nat the Lycée Janson-de-Sailly where he took classes in higher mathematics. Despite his outstanding abilities, Julia did not find life easy. First, he was still young and had left the familiar country in which he was brought up for the very different life in France. Second, he contracted typhoid fever before he had even begun his studies and was taken to hospital. It was November of\n1910\nbefore he was well enough to embark on a course which normally took two years but which he had to complete in the remaining eight months. Despite these difficulties he was still able to reach a higher standard than any other student. Somehow, he was also able to continue his interest in music, playing on a violin he mother had given him, and it was during this time that he fell in love with the music of Bach, Schubert, and Schumann. Throughout his life these continued to be his favourite composers. He sat the entrance examinations for the École Normale Supériore and the École Polytechnique and was placed first in both entrance examinations. He could choose either university but decided to enter the École Normale on the grounds that it was the stronger of the two establishments for mathematics.\nEntering the École Normale Supériore in\n1911\n, Julia had just completed the examinations for his first degree in mathematics when political events in Europe interrupted his studies. Matters came to a head in July\n1914\nwith various declarations of war, and on\n3\nAugust Germany declared war on France. Events had been moving quickly and Julia received his call up papers one day later. He trained with the\n57\nth\nInfantry Regiment at Libourne and was soon made a corporal, then a sub-lieutenant. He saw action on the western front with the\n144\nth\nInfantry Regiment when sent to the Chemin des Dames ridge. Kaiser Wilhelm II of Germany had his birthday on\n27\nth\nJanuary and the German troops wished to mark the occasion with successes. Accordingly, on\n25\nJanuary they launched a strong attack on the French lines where Julia and his men had just arrived. The following is a report of what happened to Julia that day:-\nJanuary\n25\n,\n1915\n, showed complete contempt for danger. Under an extremely violent bombardment, he succeeded despite his youth\n(22\nyears\n)\nto give a real example to his men. Struck by a bullet in the middle of his face causing a terrible injury, he could no longer speak but wrote on a ticket that he would not be evacuated. He only went to the ambulance when the attack had been driven back. It was the first time this officer had come under fire.\nYou can read Julia's account of how he was treated after his injury at\nTHIS LINK\n.\nMany on both sides were wounded in the action called the 'attack of the Creute farm' in which the Germans captured the remaining allied positions on the plateau. Julia's injury was an extremely painful one and many unsuccessful operations were carried out in an attempt to repair the damage. Eventually, in\n1918\n, he resigned himself to the loss of his nose and he had to wear a leather strap across his face for the rest of his life. Between these painful operations he had carried on his mathematical researches often in his hospital bed. He undertook research at the Collège de France, beginning in\n1916\n, and in\n1917\nhe submitted his doctoral dissertation\nÉtude sur les formes binaires non quadratiques à indéterminées réelles ou complexes, ou à indéterminées conjuguées\nⓉ\n(\nStudy on  non-quadratic real indeterminate  or indefinite conjugal binary forms\n)\n. The examiners of his thesis were\nÉmile Picard\n,\nHenri Lebesgue\nand\nPierre Humbert\n, with\nPicard\nas president of the examining committee.\nIn\n1918\nJulia married Marianne Chausson, one of the nurses who had looked after him while he was in hospital. Marianne was the daughter of the romantic composer Ernest Chausson, who had died in\n1899\nin a freak accident on his bicycle. Gaston and Marianne Julia had six children: Jérôme, Christophe, Jean-Baptiste, Marc, Daniel, and Sylvestre.\nWhen only\n25\nyears of age, Julia published his\n199\npage masterpiece\nMémoire sur l'iteration des fonctions rationelles\nⓉ\n(\nMemoir on the iteration of rational functions\n)\nwhich made him famous in the mathematics centres of his day. The beautiful paper, published in\nJournal de Math. Pure et Appl\n.\n8\n(1918)\n,\n47\n-\n245\n, concerned the iteration of a rational function\nf\nf\nf\n. Julia gave a precise description of the set\nJ\n(\nf\n)\nJ(f)\nJ\n(\nf\n)\nof those\nz\nz\nz\nin\nC\n\\mathbb{C}\nC\nfor which the\nn\nn\nn\nth iterate\nf\nn\n(\nz\n)\nf ^{n}(z)\nf\nn\n(\nz\n)\nstays bounded as\nn\nn\nn\ntends to infinity. He received the Grand Prix of the\nAcademy of Sciences\nfor this remarkable piece of work.\nYou can see an example of a Julia set at\nTHIS LINK\n.\nIn November\n1919\nhe was invited to give the prestigious Peccot Foundation lectures at the Collège de France and was appointed as Maître de Conférences at the École Normale Supériore. At the same time he was appointed répétiteur in analysis at the École Polytechnique, examiner at the École Navale, and professor at the Sorbonne. This appointment to a professorship at the Sorbonne came without a specific chair, but in\n1925\nhe was named to the Chair of Applications of Analysis to Geometry at the Sorbonne. In\n1931\nhe was appointed to the Chair of Differential and Integral Calculus, then in\n1937\nhe was appointed to the Chair of Geometry and Algebra at the École Polytechnique when\nMaurice d'Ocagne\nretired.\nSeminars were organised in Berlin in\n1925\nto study Julia's work on iteration and participants included\nRichard Brauer\n,\nHeinz Hopf\nand\nKurt Reidemeister\n. H Cremer produced an essay on his work which included the first visualisation of a Julia set. Although he was famous in the\n1920\ns, his work on iteration was essentially forgotten until\nBenoit Mandelbrot\nbrought it back to prominence in the\n1970\ns through his fundamental computer experiments. However, Julia was very active mathematically over a wide range of different topics which is perhaps best summarised by looking briefly at the six volumes of his collected works which were published between\n1968\nand\n1970\nedited by\nJacques Dixmier\nand Michel Hervé. Of course the volumes were published before Julia's death so he was able to write the Preface to the volumes himself. In addition to the Preface, Volume\n1\ncontains a list of Julia's\n232\npublications from\n1913\nto\n1965\n. These\n232\npublications consist of\n157\nresearch papers,\n30\nbooks, and\n45\narticles on the history of science or miscellaneous topics.\nVolume\n1\ncontains works on iteration and its applications.\nVolume\n2\n, in three parts, consists of articles on\n(\ni\n)\nJ\nJ\nJ\npoints of functions of one variable,\n(\nii\n)\nJ\nJ\nJ\npoints of functions of several variables, and\n(\niii\n)\nSeries of iterates.\nVolume\n3\ncontains four parts:\n(\ni\n)\nFunctional equations and conformal mapping;\n(\nii\n)\nConformal mapping;\n(\niii\n)\nGeneral lectures; and\n(\niv\n)\nIsolated works in analysis on Implicit function defined by the vanishing of an active function, and on certain series.\nVolume\n4\nis again in four parts:\n(\ni\n)\nFunctional calculus and integral equations;\n(\nii\n)\nQuasianalyticity;\n(\niii\n)\nVarious techniques of analysis; and\n(\niv\n)\nWorks concerning Hilbert space.\nVolume\n5\ncontains works on\n(\ni\n)\nNumber theory; and\n(\nii\n)\nGeometry, mechanics, and electricity.\nVolume\n6\ncontains Julia's miscellaneous writings.\nWhat about the\n30\nbooks? Let us mention\nEléments de géométrie infinitésimale\nⓉ\n(\nElements of infinitesimal geometry\n)\n(1927)\n,\nCours cinématique\nⓉ\n(\nCourse on kinematics\n)\n(1928)\n, and\nExercices d'Analyse\nⓉ\n(\nExercises in analysis\n)\n(4\nvols.\n)\n(1928\n-\n38)\n. Reviewing the first of the four volumes of\nExercices d'Analyse\n,\nEinar Hille\nwrites:-\nThis book is a worthy descendent of a long line of French Exercices sur le calcul infinitésimal. Such collections of problems are intended primarily for the students who prepare themselves for the licence or the\nagrégation\nand contain problems of the type set in these examinations. A thorough knowledge of the theory is expected as well as skill in calculation and the training is directed towards developing both qualities in the students. The present book contains a small number of carefully chosen problems, each problem followed by one or more complete solutions. About two-thirds of the first volume is devoted to the applications of analysis to geometry. An admirable account of the theory of\nFourier series\n(\npp.\n120\n-\n190)\nis eminently suitable as outside reading for first year graduate students. This part of the book will probably be found the most useful one to the general mathematical public outside of France.\nThe classic\nPrincipes Géométriques d'Analyse\nⓉ\n(\nPrinciples of geometric analysis\n)\n(1930)\nwas reviewed by\nVirgil Snyder\nwho wrote:-\nThe present volume has for its purpose the development and explanation of those geometric concepts which are employed in connection with rational, and particularly linear, transformations of a complex variable z, and the consequent transformations of uniform and of multiform functions of z.\nTwo years later Julia produced a second volume of\nPrincipes Géométriques d'Analyse\nⓉ\n(\nPrinciples of geometric analysis\n)\nwhich was reviewed by W Seidel:-\nThis book presents a continuation of the first volume of the author dealing with those aspects of the modern theory of functions of a complex variable which are derivable from simple geometrical principles. As the author himself points out in the preface to the first volume, the most important of these principles is the conformal correspondence between two regions of planar character or two\nRiemann\nsurfaces realized by an analytic function. The book serves the excellent purpose of unifying by means of geometric concepts various branches of the theory of functions which have hitherto been scattered in the literature. The presentation throughout is lucid, rigorous, and elegant.\nAnother classic text\nIntroduction Mathématique aux Theories Quantiques\nⓉ\n(\nIntroduction to the mathematical  of quantum theory\n)\nalso appeared in two volumes, the first in\n1936\nand the second in\n1938\n.\nFrancis Murnaghan\n, reviewing the first volume, wrote:-\nThis book is the sixteenth of the well known series, 'Cahiers Scientifiques,' and is the first of a series which proposes to give the mathematical foundation of quantum mechanics. In this first volume the essential difficulties of quantum mechanics\n(\nsome of which concern the fact that Hubert space is not finite dimensional\n)\nare merely foreshadowed, the attention being directed in the main to vector analysis in a space of finite dimensions. However, the treatment is sophisticated and designed, as far as possible, to carry over to the infinite dimensional case.\nThe second volume was reviewed by\nMarshall Stone\n:-\nThe topics included in the book are presented from a purely mathematical point of view in a clear and lively style. The applications to the theory of matrices and equations, which are largely implicit, in certain of the more abstract treatments, are elaborated here with a wealth of detail which renders them unusually accessible to the student. The author's approach to the modern theory of operators is obviously a cautious one, presumably because of his desire to keep the reader on ground which shall appear as nearly familiar as possible at every stage.\nFurther books by Julia include\nL'espace hilbertien\nⓉ\n(\nHilbert space\n)\n(1949)\nand\nEléments d'algèbre\nⓉ\n(\nElements of algebra\n)\n(1959)\n.\nJulia received many honours for his outstanding mathematical contributions. He was elected to the\nAcademy of Sciences\non\n5\nMarch\n1934\n, filling the place left vacant by the death of\nPainlevé\nin the previous year. He was elected President of the Academy in\n1950\n. He was also elected to the Upsal Academy in Sweden, the\nPontifical Academy of Sciences\n, and many other European Academies. He was also President of the\nFrench Mathematical Society\n. In\n1950\nhe was made an officer of the Légion d'Honneur.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}