{
  "nome_completo": "Marie Georges Humbert",
  "nome_curto": "Georges Humbert",
  "ano_nascimento": "1859",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Humbert_Georges/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Georges Humbert\nnever knew his parents since he was orphaned when he was very young. He was brought up by his grandparents in Franche-Comté where his grandfather was an industrialist. His grandparents sent Georges to the Oratorian College of Juilly to become a boarder there. He studied classics at the College, then he went on to study at the Collège Stanislas in Paris. He graduated from this college in\n1877\nand, was placed first for entry to the École Normale Supérieur and seventh for entry to the École Polytechnique in that year. He chose the École Polytechnique and after graduating in second place he studied engineering at the École des Mines.\nAfter graduating he spent a few years as a mining engineer. His first position in this capacity took him to Vesoul, but after that he moved to Paris where, in addition to his work as a mining engineer, he was soon employed as a teacher at the École Polytechnique and at the École des Mines.\nHumbert obtained a doctorate in mathematics in\n1885\nfor his thesis\nSur les courbes de genre un\nⓉ\n(\nOn curves of genus one\n)\n. He wrote the important work\nApplication de la théorie des fonctions fuchsiennes à l'étude des courbes algébraiques\nⓉ\n(\nApplication of the theory of Fuchsian functions to the study of algebraic curves\n)\nwhich was published in the following year. His work was officially recognised when he was awarded the\nPoncelet\nPrize from the\nAcadémie des Sciences\nin Paris in\n1891\nand the prize from the\nFrench Mathematical Society\nin\n1893\n.\nHumbert married Marie Jagerschmidt in\n1890\nand in the following year his son Pierre was born.\nPierre Humbert\ngrew up to be a mathematician and has a biography in this archive. Georges Humbert's delight at the birth of his son was short-lived, however, for his wife died in\n1892\n. Humbert married again in\n1900\nand with his second wife Suzanne Lambert-Caillemar had two further children.\nIn\n1893\nhe was elected to the role of president of the\nFrench Mathematical Society\nand, two years later, he was appointed professor of analysis at the École Polytechnique. On the death of\nHermite\nin\n1901\n, Humbert was elected to fill his place in the\nAcadémie des Sciences\n. In fact this was highly appropriate for he continued\nHermite\n's work in\nnumber theory\nand, what is more, did so in a very effective manner producing important contributions. He became\nJordan\n's assistant at the Collège de France in\n1904\nsucceeding to\nJordan\n's chair in\n1912\n.\nHis doctorate extended\nClebsch\n's work on curves. He then studied\nAbel\n's work which he developed and put into a geometric setting. It was as a direct consequence of his work on using\nabelian functions\nin geometry which won for him the\n1892\nAcadémie des Sciences\nprize for work on\nKummer\nsurfaces. As Costabel writes in\n[\n1\n]\n:-\nHe thus enriched analysis and gave the complete solution of the two great questions of the transformation of hyperelliptic functions and of their complex multiplication.\nHe also, as we noted above, extended work of\nHermite\nconsidering applications to number theory throughout his life.\nGeorges Humbert would be better known today if the area of mathematics in which he worked had remained in favour. Since it has now become merely something of an historical curiosity rather than mainstream mathematics, his contribution is less well known. It does, however, indicate the quality of his mathematics that, despite this, his name and results are known today. To some extent this is a consequence of the fact that although he worked in a specialised area he had a remarkably broad knowledge of mathematics and his results form links between areas.\nHumbert was a highly respected man who\n[\n1\n]\n:-\n... was remarkably gifted not only in mathematics but also in clarity of expression and intellectual cultivation. He exerted a great influence and was able, by his discretion and objectivity, to assure respect for his religious convictions during a period of some hostility towards religion in French scientific circles.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}