{
  "nome_completo": "George Elmer Forsythe",
  "nome_curto": "George Forsythe",
  "ano_nascimento": "1917",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Forsythe/",
  "lugar_nascimento": "State College, Center, Pennsylvania, USA",
  "lugar_morte": "Stanford, Santa Clara, California, USA",
  "biografia": "George Forsythe\nwas born into a Quaker family. His father, Warren Ellsworth Forsythe, was educated at Oregon Agricultural College\n(\nnow Oregon State University\n)\nand the University of Michigan where he was awarded a medical degree. He married DeEtta Brodie at her home in Portland Oregon in June\n1914\nand was employed at Pennsylvania State College when his son George was born. George Elmer was named after both his grandfathers. Warren Forsythe was sent to Buenos Ayres by the Rockfellar Institute to undertake medical research for two years. On his return to America he was made head of the health Department of the University of Michigan at Ann Arbor. It was in Ann Arbor that George was brought up.\nGeorge Forsythe attended school in Ann Arbor, graduating in spring\n1933\n. Even at this stage he began to take an interest in computing\n[\n7\n]\n:-\nHis interest in computing began early, when as a seventh-grader, he tried using a hand-cranked desk calculator to find the decimal expansion of\n10000\n/\n7699\n. He wanted to see how the digits repeated.\nHe won a scholarship which enabled him to go to Swarthmore, a Quaker college in Swarthmore, Pennsylvania, where he studied mathematics. He graduated from Swarthmore in\n1937\nand went to Brown University in Providence, Rhode Island, to undertake postgraduate studies. He was awarded his M.S. in\n1938\nand undertook research at Brown for his doctorate advised by\nJacob David Tamarkin\n. He was also influenced by\nWilliam Feller\nwho became an associate professor of mathematics at Brown University in\n1939\n. In September\n1939\nAlexandra Illmer, who Forsythe had known at Swarthmore, began her studies at Brown University and he helped her find suitable accommodation. Soon they became close friends and decided to marry on the same day that Forsythe would graduate with his Ph.D., namely\n14\nJune\n1941\n. Their marriage took place at the Society of Friends Meeting House; they had two children Warren\n(\nknown as Tuck\n)\n, who became a biologist, and Diana who studied anthropology. On the day of his wedding, Forsythe had been awarded his doctorate for his thesis\nRiesz Summability Methods of Order r, for\nR\n(\nr\n)\n<\n0\nR(r) < 0\nR\n(\nr\n)\n<\n0\n, Cesaro Summability of Independent Random Variables\nand he published results from his thesis in several papers:\nRiesz summability methods of order r, for\nR\n(\nr\n)\n<\n0\nR(r) < 0\nR\n(\nr\n)\n<\n0\n(1941)\n;\n(\nwith A C Schaeffer\n)\nRemarks on regularity of methods of summation\n(1942)\n; and\nCesàro summability of independent random variables\n(1943)\n. In this last mentioned paper he introduced generalizations of the weak law of large numbers and the central limit theorem of the calculus of\nprobability\n.\nForsythe was appointed as an Instructor in Mathematics at Stanford University in Palo Alto, California but he knew that, because of World War II, he could be called for military service at any time. His wife Sandra, who had given up work on her Ph.D. when she married, was appointed to a teaching position at Vassar College in Hudson Valley in New York State. In the spring of\n1942\nForsythe was called to undertake war work as a meteorologist at the University of California at Los Angeles. Along with Jorgen Holmboe and William Gustin he published the important text\nDynamic Meteorology\nin\n1945\n. Forsythe's wife joined him in Los Angeles after teaching for a year at Vassar College. In the summer of\n1944\nthey went to Washington since Forsythe had been sent to work at the Pentagon as a U.S. Army Air Corps Weatherman. Before the end of the war the weather service, which had been associated with the Army, became the responsibility of the Air Force, and the headquarters moved from the Pentagon to Asheville in North Carolina. He remained there until his military service ended at which stage he had to choose between returning to the Mathematics Department at Brown University or taking up a research position he had been offered with Boeing in Seattle. He chose the latter, spending a year there during which time\n[\n7\n]\n:-\n... he introduced what may have been the first use of automatic computing in that company: inspired by\nW J Eckert\n's book, 'Punched Card Methods in Scientific Computation' he had a tabulating machine set up for scientific data processing.\nAfter a year he was invited by his former colleague and collaborator Jorgen Holmboe to take up a position in the meteorology department of the University of California at Los Angeles; Holmboe was head of the Department. Forsythe took up the position but in\n1948\nhe joined\n[\n7\n]\n:-\n... the Institute for Numerical Analysis of the National Bureau of Standards, a special section located on the campus of the University of California, Los Angeles. He joined the Institute because he wanted to watch the development of the Standards Western Automatic Computer\n(\nSWAC\n)\n, one of the first of the digital computers.\nIn\n1954\nthe Institute for Numerical Analysis was discontinued and Forsythe, along with several other colleagues who had worked at the Institute, was given an appointment in the Mathematics Department at the University of California at Los Angeles. He spent\n1955\n-\n56\nat the Courant Institute in New York, then, in September\n1957\n, he left Los Angeles and returned to Stanford University where he was appointed as professor in the Mathematics Department. In\n1961\na Computer Science Division was set up, still as part of the Mathematics Department, led by Forsythe. In January\n1965\nthis Division became a separate Computer Science Department. The article\n[\n11\n]\ncontains a wealth of information about how Forsythe convinced those around him of the importance and place of computer science. Here are two extracts from letters he wrote in January\n1964\nas he worked towards the creation of a separate Department\n[\n11\n]\n:-\nWe are a bit separate from the Mathematics Department, and have responsibility for courses in numerical analysis, programming, artificial intelligence, and any other areas of Computer Science which we can manage.\nThe role of the Computer Science Division is likely to be increasingly divergent from that of Mathematics. It is important to acquire people with strong mathematics backgrounds, who are nevertheless prepared to follow Computer Science into its new directions.\nAfter the new Department had been running for a while, Forsythe took the year\n1966\n-\n67\nto visit various computer centres in Europe, Asia, and Australia. In\n[\n7\n]\nHerriot describes the aspects of Forsythe's character that made him such a successful leader of this new Department:-\nAs the result of his dynamic leadership and foresight the department developed into one of the nation's outstanding computer science departments. George was very skillful in bringing together our many diverse points of view. He captured the loyalty of all of his colleagues. He had a sense of responsibility to others and to the institutions he chose to serve. It was a principle of his life that people were not instruments to be manipulated toward some end. In each of his positions of leadership, but particularly in his position as department chairman, he felt that the threads of many people's lives, and of their productive work and aspirations, ran through his hands, and that each of these must be worried about and cared for in the proper way. Carefulness, thoughtfulness, energy, attention to detail, a determination not to pass the buck-these give some of the dimensions of his sense of responsibility. He was a master at resolving differences between people with opposing views.\nForsythe was very aware of the need for good books on computer methods. He writes\n[\n5\n]\n:-\nBecause of my knowledge of mathematics texts ten years ago, and my knowledge of the explosive increase in numerical methods in the\n1960\n's, I am confident that today's mathematics books cannot be trusted to include important knowledge about computer methods. ... you can't trust early numerical analysis textbooks either.\nHe did his best to remedy the problem through writing texts and also by acting as editor for Prentice-Hall's excellent Series in Automatic Computation. The books he wrote were:\nBibliography of Russian Mathematics Books\n(1956)\n;\n(\nwith Wolfgang Wasow\n)\nFinite-Difference Methods for Partial Differential Equations\n(1967)\n; and\n(\nwith Cleve B Moler\n)\nComputer Solution of Linear Algebraic Systems\n(1967)\n. It is fairly clear from its title what\nBibliography of Russian Mathematics Books\ncontains but it is useful to look at Forsythe's Preface:-\nThis survey ... is intended to be a list, arranged both by author and subject, of all known Russian mathematical books published since\n1930\nthat a practising mathematician might wish to consult. ... The subject matter of the books listed is mathematics, pure and applied, including tables beyond the most elementary, but excluding descriptive geometry. There are a few titles on quantum mechanics and other branches of mathematical physics, and more on mechanics, mathematical machines and nomography, but these topics are far from completely covered. ... The serial monographs of the Steklov mathematical institute have also been included.\nThe author of\n[\n12\n]\nputs\nFinite-Difference Methods for Partial Differential Equations\ninto context:-\nThe solution of partial differential equations by finite-difference methods constitutes one of the key areas in numerical analysis which have undergone rapid progress during the last decade. These advances have been accelerated largely by the availability of high-speed calculators. As a result, the numerical solution of many types of partial differential equations has been made feasible. This is a development of major significance in applied mathematics. The authors of this book have made an important contribution in this area, by assembling and presenting in one volume some of the best known techniques currently being used in the solution of partial differential equations by finite-difference methods. This, I am certain, has not been an easy task, owing to the fluid state of many of the theories in this field.\nThe book is also praised by George Leo Watson in\n[\n15\n]\n:-\nThe authors seem to have explained this difficult theory as lucidly as possible.\nNext we present two extracts from reviews of\nComputer Solution of Linear Algebraic Systems\n. First R L Johnson in\n[\n10\n]\nwrites:-\nThe aim of this monograph is to present, at the senior-graduate level, an up-to-date account of the methods presently in use for the solution of systems of linear equations. The major emphasis is on direct methods. The authors have succeeded admirably in presenting the material in a very readable fashion which has hitherto been lacking in most numerical analysis texts.\nAlston Householder\nalso is full of praise\n[\n8\n]\n:-\nThis is an excellent brief introduction to the subject, written by two experts with considerable experience. The senior author, in fact, is one of the pioneers. Very little is presupposed on the part of the reader. The necessary theoretical back-ground is developed in an elementary fashion, and detailed algorithms are spelled out and analyzed. For the beginner, and even for those who already have some experience, this book is a must.\nNext we look at some quotations from Forsythe to give us a deeper understanding of his ideas. First, his Technical Report\n[\n3\n]\ngives a good idea of what 'computer science' meant to Forsythe:-\nI consider computer science to be the art and science of exploiting automatic digital computers, and of creating the technology necessary to understand their use. It deals with such related problems as the design of better machines using known components; the design and implementation of adequate software systems for communication between man and machine, and the design and analysis of methods of representing information by abstract symbols and of processes for manipulating these symbols. Computer science must also concern itself with such theoretical subjects supporting this technology as information theory, the logic of the finitely constructible, numerical mathematical analysis, and the psychology of problem solving. Naturally these theoretical subjects are shared by computer science with such disciplines as philosophy, mathematics, and psychology.\nNext we give an extract from\n[\n4\n]\nshowing Forsythe's ideas about teaching undergraduates mathematics:-\nThe student should above all learn as much as possible of the structure. significant ideas, and points of view which constitute mathematics. This is the sine qua non.\nThe student should learn to read independently the mathematical literature at his level of comprehension, and to use mathematical language to write facts, proofs, and ideas precisely and unambiguously, in a style acceptable to not-too-strict editors of mathematical journals. ...\nThe student should know the tools of the mathematical profession\n(\nbooks and machines\n)\n, and how and where to find them and to keep up to date on them. ...\nThe student should have cultivated and practised the solution of mathematical problems new to him. This is where research ability is built. It hardly matters whether the problems have been solved before by some one else.\nThe student should have gone fairly deeply into some other field of knowledge-preferably some field where mathematics is used, like a physical science or the mathematical aspects of economics. ...\nThe student should have learned to enjoy mathematical study.\nForsythe died in the Hoover Hospital section of Stanford University Medical Center of pancreatic cancer at the age of\n55\n.\nLet us end this biography by quoting from\nDonald Knuth\nview as to the important role Forsythe played in the rapid development of computer science\n[\n11\n]\n:-\nThe sudden death of George Forsythe this spring was a serious loss to everyone associated with computing. When we recall the many things he contributed to the field during his lifetime, we consider ourselves fortunate that computer science has had such an able leader. ... It is generally agreed that he, more than any other man, is responsible for the rapid development of computer science in the world's colleges and universities. His foresight, combined with his untiring efforts to spread the gospel of computing, have had a significant and lasting impact; one might almost regard him as the Martin Luther of the Computer Reformation!",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}