{
  "nome_completo": "George Musengi Saitoti",
  "nome_curto": "George Saitoti",
  "ano_nascimento": "1945",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Saitoti/",
  "lugar_nascimento": "Ngong, near Nairobi, Kenya",
  "lugar_morte": "Kibiku forest, Ngong, near Nairobi, Kenya",
  "biografia": "George Saitoti\nwas born in the Aga Khan Hospital, Ngong Road, Nairobi. His parents were Zacharia Kiarie and Zipporah Gathoni who lived in Oloolua, Ngong, Kajiado a little to the west of Nairobi. One immediately asks why Saitoti's father has the surname 'Kiarie' and not 'Saitoti'. The answer is that George Saitoti grew up with the name George Kinuthia Kiarie and only adopted the name Saitoti later in his life. We will, however, for convenience refer to him as George Saitoti throughout this biography. His parents were from the Kikuyu ethnic group, the largest of Kenya's ethnic groups. George was brought up in Olkeri, Maasailand, which is a Maasai region and Zacharia Kiarie had gone through the Maasai initiation rites so he had his son George go through these rites to become a Maasai by assimilation. The reason that the Kiarie family had moved to Maasailand was a result of the Mau Mau uprising of\n1952\n. This uprising, against the British colonists who controlled Kenya, was put down by the British who punished the Kikuyu severely since the bulk of the uprising had been by peoples of that ethnic group. In fact the British government issued an apology in\n2012\nto those who had suffered:-\n... torture and ill-treatment at the hands of the colonial administration.\nZacharia Kiarie escaped from this crackdown on the Kikuyu by taking his family to Olkeri, Maasailand, in the south of Kenya where he had Maasai relatives. At this stage the family changed their name to Musengi. George Saitoti was at this time, therefore, was known as George Musengi. His brother, who became a banking executive with the Kenya Commercial Bank, continued to use the name Ronald Musengi and his brother Johnson also used the name Musengi.\nGeorge Saitoti attended Oloolua Primary School, Kajiado, in the\n1950\ns. In\n1960\nhe entered Mang'u High School in Thika where he had secured a place due to his outstanding performance. This school is a Roman Catholic National High School which had been founded in\n1925\nand had gained a very high reputation. When Saitoti attended, the school was not at its present site but was in Mang'u, between Thika and Gatundu. Although it is definite that Saitoti attended this school, according to\n[\n8\n]\n... he was at the school but never used any of the names associated with him - George Saitoti, Kiarie wa Kinuthia, Kinuthia wa Muthengi, George Musengi - and perhaps any other name you know.\nSomeone named George Saitoti flew from Nairobi to New York arriving on\n8\nSeptember\n1961\n. He gives his date of birth as\n4\nAugust\n1944\n, his place of birth as Ngong, and he is going to Thompson Academy,\n79\nMilk Street, Boston\n9\n, Massachusetts, USA. This is puzzling and I\n[\nEFR\n]\ndo not understand it. The date of birth is one year and one day different from the accepted birthdate of the George Saitoti of this biography, but since data about the subject of this biography is somewhat vague, this may not be significant. But this is not the only puzzle. There is a Thompson Academy on Thompson Island, Boston, and it is a college preparatory boarding school. Its address is not\n79\nMilk Street, Boston\n9\nwhich is, in fact, the address of the Massachusetts Society of Professional Engineers in Boston. There is no evidence that up to this time the subject of this biography was using the name Saitoti. Most biographies, however, say that Saitoti adopted that name when he obtained a scholarship to go to the United States. Nowhere is it explained why he should have to change his name to obtain a scholarship. This must be the George Saitoti of this biography, but in that case he must have graduated from Mang'u High School in\n1961\n, rather than\n1963\nwhich is stated in his biographies. If any reader of this biography can throw light on this puzzle, we would greatly appreciate hearing from them.\nSaitoti was certainly in the United States by September\n1963\nto continue his education as a university undergraduate, a policy introduced by Jomo Kenyatta. In October\n1961\n, after serving seven years in prison for allegedly masterminding the Mau Mau rebellion against British rule, Kenyatta was released and became president of the Kenya African National Union. He wanted good students to be sent to the United States for higher education so that they would in due course take over important positions in the Kenya government. President John F Kennedy agreed to the scheme and around\n800\nstudents benefitted from it. The Kenyan students were, however, facing problems and Kenyatta sent Kimani wa Nyoike to start the African Students Service division within the World University Service to fundraise for the students and help them. Kimani wa Nyoike met Saitoti who had received a Wien international scholarships to study at Brandeis University in Waltham, Massachusetts. Kamau Ngotho reported on a conversation with Kimani wa Nyoike in\n[\n8\n]\n:-\nOnce I had a conversation with retired politician Kimani wa Nyoike, who was in college in the United States together with Saitoti in early\n1960\ns. He told me that Saitoti was a mystery even in their college days. \"I was leader of Kenyan students in our time and we lived as a community. But Saitoti was always a stranger to us,\" Nyoike told me. The retired politician also told me that Saitoti never liked anybody who knew his past near him. \"It is like he had something he didn't want known about him,\" he told me.\nJohn Kamau writes that Saitoti\n[\n4\n]\n:-\n... entered Brandeis in September\n1963\nthrough the Wien international scholarships to study economics and maths. Brandeis was only\n13\nyears old by the time Saitoti arrived there. At Brandeis, Saitoti immersed himself into the university life and was one of the best in high jump. He would also spend time at the Usen Castle's Cholmondeley's Coffee House, ran by the students.\nSaitoti was awarded a B.A. with First Class Honours in Mathematics from Brandeis in\n1967\n. He continued to win scholarships and was able to travel to England where he enrolled for an M.Sc. at the University of Sussex in Brighton. After successfully completing the degree at the University of Sussex, again a scholarship allowed him to continue to study for a doctorate at Warwick University in Coventry, England. At Warwick his thesis advisor was the topologist Luke Hodgkin and Saitoti was awarded a Ph.D. in\n1971\nfor his thesis\nMod-\n2\nK-Theory of the Second Iterated Loop Space on a Sphere\n. His name on the thesis is George Kinuthia Kiarie Saitoti. His advisor, Luke Hodgkin, studied mathematics at Balliol College and St John's College, Oxford before being appointed to Warwick University. He later taught at the University of Algiers and at King's College, London.\nAfter the award of his Ph.D., Saitoti returned to Kenya where he was appointed as a Lecturer in Mathematics at the University of Nairobi. He submitted the paper\nLoop spaces and K-theory\nto the\nJournal\nof the\nLondon Mathematical Society\nin July\n1973\nand it was published in\n1975\n. Rather strangely, this paper lists Saitoti's thesis in the list of references but it does not appear to have a mention in the text of the paper. Further papers were published, one in each of the years\n1974\n,\n1975\n,\n1976\nand\n1977\n. The\n1974\npaper is\nA note on the homology of a differential graded algebra\n. In\n1976\nhe was one of the founders of the\nAfrican Mathematical Union\nwhich took place at the first Pan-African Conference of Mathematicians held in Rabat, Morocco. Its first President was Henri Hogbe Nlend from Cameroon while Saitoti was elected as Vice-President. He held this position until\n1979\n.\nSaitoti's career as a mathematician went well and he was promoted to associate professor and, in\n1983\n, to Head of the Department of Mathematics at the University of Nairobi. He did not concentrate wholly on mathematics, however, for he had a number of other positions. The Minister of Labour appointed him as the chairman of the Agricultural Wages Council on\n3\nNovember\n1972\n, a position he held for two years. He was elected to the East African Legislative Assembly in\n1974\n, serving until\n1977\n. He was appointed as a committee member of the Natural Sciences Advisory Research Committee on\n4\nSeptember\n1979\n. He was appointed chair of the board of directors for the Rift Valley Institute of Science and Technology in September\n1983\n. He also acted as executive chairman at the Kenya Commercial Bank. John Kamau writes\n[\n4\n]\n:-\nDespite his growing public stature, the double cultural heritage appeared to bother Saitoti, gradually turning him into an introvert, according to friends. \"Saitoti rarely shared his problems,\" a close associate remembers. \"Even when among the Maasai or the Kikuyu, you wouldn't catch him speaking any of the tongues. He was like a man with no cultural identity.\"\nIn October\n1983\nSaitoti was nominated to the Kenyan parliament and the President, Daniel Toroitich arap Moi, the second President of Kenya, appointed him as Finance Minister. At this time Kenya was a one-party state, ruled by the Kenya African National Union. In March\n1985\nhe made a major statement\nMajor Issues in Implementing District Focus\n. He spoke about harambee, a policy adopted by Jomo Kenyatta for community self-help projects, stressing its importance in the development strategy of Kenya. There was, however, much concern about corruption, especially involving self-help projects, so Saitoti said:-\nAs part of our effort to use resources more productively, we need greater accountability for harambee funds. Documentation of the collections and project expenditures must be prepared in order to maintain public confidence in harambee.\nIn\n1986\nhe wrote\nA View from Africa\nin which he said:-\nThis is a continent of\n400\nmillion people, only a tiny fraction of whom are producing up to their potential. Africa's agriculture can grow a wide variety of tropical and even temperate crops, often at very high yields, and the possibility for research leading to improved productivity have hardly been touched. Africa's land is rich in mineral wealth, much of it unexplored, and its rivers contain unexploited potential for power and irrigation. With good economic management, good world market conditions, and more patience than we can perhaps afford, African economies should be capable of producing far more output than at present and of noticeably improving the well-being of their people.\nIn\n1988\nSaitoti participated in the general elections and won the Kajiado North parliamentary seat. The voting system used was heavily criticised as favouring the Kenya African National Union, and they were clearly reluctant to more to a more democratic model. President Moi was returned unopposed and he appointed Saitoti as Vice-President of Kenya on\n1\nMay\n1989\n. The Kenya African National Union now had two factions, one determined not to move towards full democracy, the other, led by Saitoti, in favour of change. Saitoti played a very clever role in keeping both sides happy. He turned out to be the longest serving Vice-President holding that position between May\n1989\nand January\n1998\nand again between April\n1999\nand August\n2002\n. He was highly efficient and trusted by President Moi and by his successor President Mwai Kibaki.\nIn September\n1990\nthe Annual Meeting of the Boards of Governors of the World Bank Group met in Washington, D.C., United States. George Saitoti, Governor of the Bank and Fund for Kenya, served as Chairman. He delivered the Opening Address and gave the Concluding Remarks. He began his Opening Address by saying:-\nIt is a great honour for me to welcome you to these Forty-Fifth Annual Meetings of the International Monetary Fund and the World Bank Group. ... The past year has been marked by extraordinary political and economic events, all of which have significant implications for the world economy. Three of these developments stand out as particularly important at this juncture.\nThese three developments were the fall of the Berlin wall, which he strongly welcomed, the progress towards a united Europe, of which he said \"history is being made,\" and developments in the Middle East which would have an \"adverse impact on the world economy.\"\nAlthough he received much praise for his international work, in Kenya he was encountering much opposition against his reforming agenda. On\n13\nFebruary\n1990\n, John Robert Ouko, a Kenyan politician who had served as Foreign Minister from\n1979\nto\n1983\n, was murdered. The murder has never been solved but theories point to either a family feud or a political assassination. Saitoti claimed that attempts were made on his life around the same time. He was both Vice-President and Finance Minister at the time of the Goldenberg scandal. The Goldenberg Scheme was an export promotion scheme in which anyone who exported gold or diamonds could claim\n35\nper cent of their value as a state subsidy. Given Saitoti's stand against corruption it is hard to believe he set this up so that he and his fellow politicians could make personal fortunes. Although the Goldenberg scandal would continue to make his life difficult, he always denied involvement in the scheme and he managed to avoid being charged with any offence.\nIn September\n1994\nhe addressed the International Conference on Population and Development held in Cairo, Egypt. The Abstract of his address is at\nTHIS LINK\n.\nSaitoti gave a speech on the occasion of the World Population Day celebrations on\n11\nJuly\n1997\n. The Abstract of his address is also at\nTHIS LINK\n.\nHe had many opponents in parliament and after the\n1997\nelections the President did not appoint him as Vice-President. Nobody was elected as Vice-President to replace him and in April\n1999\nPresident Moi again made Saitoti Vice-President. In\n2000\nhe gave the keynote speech\nStrengthening mathematics and computer science and research in Kenyan Universities\n. In\n2002\nhe published the book\nThe challenges of economic and institutional reforms in Africa\n. In it he argued as follows:-\nThroughout the continent, post-independence public policies discriminated against historically marginalized and excluded groups\n(\ne.g., women, children, the youth, rural inhabitants, and the many Africans who had been relegated to the periphery of the urban sectors\n)\n. Although these perverse policies generated a significant amount of benefits and privileges for the ruling elites and enhanced their ability to monopolize political power, they imposed significant costs on the poor.\nIt is clear that such arguments would not make Saitoti popular with fellow members of the government. After the Kenya African National Union merged with another party in\n2002\nand changes were made, including the introduction of four Vice-Presidents, Saitoti lost his position. He said at the time:-\nThere comes a time when the nation is much more important than an individual.\nSaitoti joined the Liberal Democratic Party which in turn joined the National Rainbow Coalition. Mwai Kibaki became President and Saitoti was appointed to the Ministry of Education. He certainly feared for his safety as Kamau Ngotho reports in\n[\n8\n]\n:-\n[\nI was in\n]\na high-end hotel in Mombasa in\n2006\n. I had been assigned to do a story on how hotels at the coast had improved on their security as a result of terrorist threats. I was walking into the hotel lobby on a Sunday morning when some mean-looking man pushed me aside. Before I knew what was happening, Saitoti whizzed by escorted by even meaner-looking fellows than the one who had pushed me aside. It was a very sunny morning and Saitoti was the only person I saw that day dressed in a suit and a tie. I would learn that he was always in a suit because he wouldn't leave the house without a bullet-proof vest. Later as I talked to the manager, I mentioned that I had met Saitoti at the entrance. He looked surprised that Saitoti had spent the night there. He told me: \"I know he comes here but he never makes his booking through us. We only get to know we have a VIP guest but can't even tell exactly which room he occupies. We book him at least three rooms in different floors and never get to know which one he uses!\"\nSaitoti was re-elected in\n2007\nto the Kajiado North parliamentary seat standing for the Party of National Unity. He remained loyal to Kibaki during political infighting and was appointed Minister of State for Internal Security and Provincial Administration in the Office of the President in January\n2008\n. In December\n2008\n, as Chairman of the Party of National Unity, he became second in command to the President, returning to the status he had held over many years. He became a member of the National Security Committee in\n2008\nand served for a time as Minister for Foreign Affairs in\n2010\n-\n11\n.\nFor political addresses and papers by Saitoti, see\nTHIS LINK\n.\nIn\n2011\nPresident Mwai Kibaki confirmed that he would stand down as President at the next election in\n2013\n. Saitoti confirmed that he would seek election as President to succeed Kibaki. On Sunday\n10\nJune\n2012\na helicopter carrying Saitoti, the Assistant Minister for Internal Security, and four others crashed in the Kibiku area of the Ngong forest killing everyone on board. It was widely believed that Saitoti had been assassinated but no definite proof has ever been forthcoming. We quoted from Kamau Ngotho above about the hotel where he stayed in Mombasa. Ngotho also wrote\n[\n8\n]\n:-\nIt is in the same hotel where Saitoti spent the last weekend before his death while attending a top-level government function with President Kibaki. Officially, Saitoti was booked at another hotel where the rest of the Cabinet ministers were staying but he had asked one of his aides to stay in the room to give the impression that he was staying there. It is like the minister didn't feel safe staying with fellow cabinet ministers.\nThe article\n[\n1\n]\ndoubts whether he would have had any chance of becoming President:-\nAlthough he was planning to run for the presidency, his mixed parentage - Kikuyu and Masai - would never have given him unqualified support among the Kikuyu in Kenya's highly tribalised politics, while the Maasai are not numerous enough to be big political players. Although Kenya's professional classes may have voted for Saitoti, he was not a populist speaker and would have stood no chance against Uhuru Kenyatta for the Kikuyu vote. According to Charles Hornsby author of 'Kenya: a History Since Independence', \"Saitoti was simply too reserved, distant, academic, and non-tribal - and he didn't have the common touch.\"\nWe have not mentioned Saitoti's family. He was married to Margaret and they had a son Zachary Musengi Saitoti. There is currently a dispute as to whether Zachary was Saitoti's son, his adopted son, or was stolen by the Saitotis.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}