{
  "nome_completo": "George Frederick James Temple",
  "nome_curto": "George Temple",
  "ano_nascimento": "1901",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Temple/",
  "lugar_nascimento": "Kensington, London, England",
  "lugar_morte": "Quarr Abbey, Isle of Wight, England",
  "biografia": "George Temple\n's father was James Temple\n(\nborn in Somerton, Oxfordshire in\n1845)\nwho was a railway inspector working for the Great Western Railway. George's mother was Frances Compton\n(\nborn in Broadwell, Oxfordshire in\n1857)\nwho was always known as Fanny. James Temple, who was baptised on\n4\nAugust\n1845\n, was the second child of his parents, the shepherd John Temple and his wife Ann, having an older brother George, and younger siblings Sarah and Joseph. Fanny Compton, baptised on\n8\nMarch\n1857\n, was the daughter of George Compton, a tailor and Clerk of the Parish, and his wife Elizabeth. Fanny was a late child, her parents being\n49\nand\n39\nwhen she was born, and she had two brothers Frederick and William,\n10\nand\n8\nyears older than her respectively. James Temple married Fanny Compton on\n26\nDecember\n1896\nat St Luke's, Kingston-Upon-Thames, Surrey, England. George Frederick James Temple, the subject of this biography, was their only child, born at\n134\nWornington Road, North Kensington, London and baptised on\n6\nOctober\n1901\nat Notting Hill, Christ Church, Kensington and Chelsea, England. The family were living in London because James Temple was working at Paddington Station. At the\n1911\nUK Census, James Temple was\n65\nyears old and had retired, and the family were living at\n15\nAltenburg Avenue, Ealing. George was nine years old and attending school.\nGeorge Temple was educated in London, attending first Northfields Elementary School which was his local school in Northfields, the area of Ealing in which he lived. There he was taught by Ray Gilbert who was the first of three teachers we mention whom Temple often spoke about later in life, stressing his good fortune at having such outstanding people to begin his mathematical education. Temple began his secondary education at Ealing County School, later known as Ealing Grammar School for Boys, in the year it opened in\n1913\n. There he was taught mathematics by P G Goodall, the second of the three teachers praised by Temple. James Temple, George Temple's father, died in February\n1914\nand was buried on\n24\nFebruary. This meant that George could not continue in full time education after his secondary schooling, so he left school in\n1917\n, when fifteen years old, to seek employment to provide financial support for himself and his mother. He began working for the Prudential Assurance Company.\nIn\n1918\n, less than a year after leaving school, he entered Birkbeck College as an evening student\n(\nthe College had previously been known as London Mechanic's Institution and in\n1920\nwas recognised as a school of the University of London for evening and part-time students\n)\n. At this stage Temple continued to work for the Prudential Assurance Company as his day job and studied mathematics as an evening student. In fact he had not been sure whether to study science or classics, both of which he loved, but decided on science. He was taught mathematics at Birkbeck College by Charles Victor Coates, the third teacher whom he later praised. C V Coates\n(1853\n-\n1944)\nhad been born in Belfast and educated at Queen's College Belfast before studying the mathematical tripos at Cambridge, being\n5\nth wrangler in\n1877\n.\nDuring the year\n1918\n-\n19\n, Temple studied mathematics and physics. He was taught physics by Albert Griffiths\n(1867\n-\n1937)\nwho quickly saw Temple's outstanding potential. Griffiths had been one of the first students to obtain an honours degree in physics from Owens College, Manchester, and had undertaken research at Freiburg, Germany, before becoming a lecturer in physics at the University of Sheffield. By the time Temple was studying at Birkbeck College, Griffiths was head of physics there and he saw that Temple was struggling with a full time job as well as his part-time study so, in\n1919\n, he offered him a part-time research assistant position in physics at Birkbeck College. It was not an easy decision for Temple since giving up his full-time position at the Prudential Assurance Company for a part-time assistant position meant a big drop in salary. Another life changing event, also in\n1919\n, was being received into the Roman Catholic Church.\nClive Kilmister\nwrites\n[\n14\n]\n:-\n... he was received into the Roman Catholic church. His faith formed his life. He had close friendships with a number of Dominicans and Benedictines, loving liturgy and theology, especially Aquinas.\nTemple published his first paper in\n1922\n. On\n23\nMay of that year he submitted the paper\nThe Homographic Treatment of the Symmetrical Optical Instrument\nto the Physical Society of London. Published in\n1922\n, the paper begins:-\nThis Paper gives a homographic treatment of the perfect, symmetrical optical instrument; discusses its focal planes, principal planes and nodal points; and shows that these latter are sufficient to define uniquely the optical properties of the instrument.\nThe object of this Paper is to replace the rather cumbrous algebra of\nAbbe\n's theory of the symmetrical optical instrument by the more elegant methods of modern geometry.\nThe paper was communicated by David Owen, a founder member of the Institute of Physics. Owen had studied the natural sciences tripos at Cambridge being a wrangler in\n1897\n. He taught at Birkbeck College and had been awarded a D.Sc. by the University of London in\n1916\n.\nKilmister\n, writing about Temple's first paper, explains\n[\n13\n]\n:-\nIt was inspired by Smart's lectures on projective geometry and by\nWhittaker\n's Cambridge Tract on the classical theory of the same abstract instrument. In Temple's words: \"Apart from\nvon Staudt\n's theory of the metrization of projective geometry and\nKlein\n's proof that the only perfect optical instrument is the plane mirror, my paper provides the only application of projective geometry to physics.\" It may come as a surprise to readers unaccustomed to Temple's cast of thought to see\nvon Staudt\n's work quoted as a physical application, but this was characteristic of Temple; to him, mathematics was simply the language of physics.\nHe received his B.Sc. in\n1922\n, then began to study the theory of relativity while working as a Steward in the Physics Department of Birkbeck College. In October\n1923\nhe submitted the paper\nA generalisation of Professor Whitehead's theory of relativity\nto the Physical Society of London. The Abstract states:-\nThis Paper gives the generalisation of Prof\nWhitehead\n's theory of relativity appropriate to the case of a space-time manifold of uniform and isotropic curvature. The general equations of the gravitational and electromagnetic fields are obtained. and these are applied to the discussion of the problems of planetary motion and of the deviation of light rays in the solar field.\nAt the end of the paper, a discussion is presented which begins:-\nProf\nA N Whitehead\ncongratulated the Society on publishing the first Paper on this subject from the pen of a young scientist whose work augurs a very distinguished career. The mathematics in the Paper was handled in a way that showed the author to be the master and not the slave of his symbols.\nAlso in\n1924\nTemple published\nCentral orbits in relativistic dynamics treated by the Hamilton-Jacobi method\nin the\nLondon, Edinburgh, and Dublin Philosophical Magazine\n. The paper, communicated by\nA N Whitehead\n, had the following Introduction:-\nThe first part of this paper is devoted to am exposition of a process of integration applicable in particle dynamics on any relativistic theory, and forming the appropriate generalisation of the methods of\nHamilton\nand\nJacobi\nin classical mechanics. In the second part, this method is applied to the problems of planetary motion and of the deviation of rays of light in the solar field according to the theories of\nEinstein\nand\nWhitehead\n.\nKilmister\nwrites\n[\n13\n]\n:-\nAlready a common feature of Temple's work was apparent. His approach was to seek out some important problem before it had become popular, to write a few papers laying the foundations for a solution, and to move on elsewhere before the field became overworked.\nTemple was appointed Demonstrator in Mathematics at the City and Guilds College\n(\nnow Imperial College\n)\n, London in\n1924\n.\nAlfred N Whitehead\nhad been the main reason for Temple's move to Imperial and we have already seen that he had been impressed by the papers on relativity which Temple had published. However\nWhitehead\nleft the chair at Imperial as Temple arrived and\nSydney Chapman\nwas appointed to fill the chair. Temple never wrote a Ph.D. thesis but rather submitted the three papers\nA theory of relativity in which the dynamical manifold can be conformally represented upon the metrical manifold\n(1925)\n,\nOn mass and energy\n(1925)\n,\nStatic and isotropic gravitational fields\n(1926)\nas his dissertation and was awarded the degree\n(\nin\n1924\n, according to the student records\n)\n. In\n1928\nChapman obtained an\n1851\nExhibition for Temple to undertake further research and he spent a year at Imperial working on quantum theory before going to Cambridge where he worked with\nArthur Eddington\n. His original intention was to undertake research at Cambridge for a second Ph.D. advised by\nEddington\nbut, after a year, in\n1930\nhe returned to Imperial College when offered a position there as a Reader. He decided that the Readership was a sufficiently secure post to allow him to marry, so accepted.\nHe married Dorothy Lydia Carson\n(1899\n-\n1979)\non\n2\nSeptember\n1930\nin the Church of St Agnes, West Kirby, Cheshire. Known by all as \"Goggy\", she was born on\n26\nApril\n1899\nin Toxteth Park, Liverpool, Lancashire, the daughter of the clerk Thomas Ellis Carson\n(1870\n-\n1926)\nwho worked for a ship provisions firm in Liverpool, and Rhoda Hignett\n(1875\n-\n1909)\n.\nBack working at Imperial College, Temple's first book\nAn introduction to quantum theory\nwas published in\n1931\n. He now turned to working on\nRayleigh\n's Principle and, in\n1933\n, his second book\nRayleigh's principle and its applications to engineering. The theory and practice of the energy method for the approximate determination of critical loads and speeds\n, written jointly with William G Bickley was published.\nYou can read extracts from the Prefaces of these books, and extracts from some reviews of them at\nTHIS LINK\n.\nLet us note that William Gee Bickley\n(1893\n-\n1969)\n, Temple's co-author, had been awarded an external University of London first class degree in mathematics in\n1913\nafter studying at University College, Reading. He became a mathematics teacher at secondary schools, then taught at Battersea Polytechnic before being awarded a D.Sc. from Imperial College London where he taught mathematics to engineers from\n1929\n. He struggled with poor eyesight all his life, going blind completely in\n1949\n.\nAfter two years working at Imperial College, in\n1932\nTemple was appointed to a chair of mathematics at King's College London. To understand something about this appointment, we need to introduce two people. William Reginald Halliday\n(1886\n-\n1966)\n, historian and archaeologist, was Principal of King's College, having been appointed in\n1928\n. The Head of Mathematics at King's College was Arthur Ernest Jolliffe\n(1871\n-\n1944)\nwho had been awarded a First in Mathematics from the University of Oxford in\n1891\nand tutored at Jesus College, Cambridge from\n1903\nto\n1920\n. After four years as a professor of mathematics at Royal Holloway College, he became professor and head of mathematics at King's College in\n1924\n. Both Halliday and Jolliffe opposed Temple's appointment, having another candidate as their preferred choice. Temple, however, had strong support from\nArthur Eddington\nand\nAndrew Forsyth\nwho had held the chair of mathematics at Imperial College London from\n1913\nuntil he had retired in\n1923\n. Temple was eventually chosen, but Jolliffe's opposition made his first years at King's College difficult ones\n[\n13\n]\n:-\nTemple was elected. He was now\n31\n. His aim was to raise the very low standards to which the department had then sunk. It had come to see its main purpose in terms of its heavy service teaching load and, in agreement with some of the other colleges in the university, a secondary purpose was to teach the existing curriculum in honours mathematics, a course that was some\n50\nyears out of date. In Temple's own words: \"I had to proceed with care and caution until Jolliffe retired in\n1936\nand was succeeded by Professor\nJ G Semple\n. Jolliffe and his colleague S A White hated research and all my work in changing the character of the department.\" The first step was to initiate discussions with\nLouis Filon\n(\nand later\nGeorge Jeffery\n)\nat University College. Eventually, an alternative syllabus was agreed between the two colleges and then operated by them but it was a number of years before all the other colleges joined in.\nTemple's second book on quantum theory,\nThe general principles of the quantum theory\n, appeared in\n1934\n. An extract from a review is given at\nTHIS LINK\n.\nRather surprisingly, none of Temple's biographies we have found mention his enthusiasm for the\nMathematical Association\n. He was elected president of the London Branch of the\nMathematical Association\nand, on\n12\nDecember\n1936\n, gave his Presidential Address entitled\nThe theory of complex numbers\n. The lecture began\n[\n25\n]\n:-\nThe object of this address is to pass in review various theories of complex numbers and to scrutinise them from the standpoint of the teacher engaged in initiating his pupils into this subject. The material of the address is therefore very elementary and well known and roughly a century old, but it is arranged and combined in a way which may perhaps throw some new light on an old problem. It is important to realise at the outset the fundamental issues which involved; and, although it is undesirable to intrude explicit philosophy into a first lesson on complex numbers, it is well for the teacher to have these metamathematical considerations clear in his own mind. Broadly speaking, theories of complex numbers fall into two sets - those in which the complex numbers are 'described', and those in which they are 'constructed'.\nDuring World War II he worked at RAE Farnborough where his work earned him a CBE awarded in\n1955\n. During his time in Farnborough he worked on supersonic fluid flow de-icing of bomber's wings and the serious problem of landing wheel wobble\n[\n13\n]\n:-\nIt was for this investigation that Temple learnt to ride a bicycle, in order to get round the airfield quickly. His inexperience and the unsuitability of his figure for the activity combined to amuse his colleagues. It was during his stay in Farnborough that Temple was elected to the\nRoyal Society\nin\n1943\n, principally for the work on\nDirac\n's equation.\nIn the '\n1939\nEngland and Wales Register', Temple is shown as living at\n8\nHill Close, Hendon, Middlesex, England. His occupation is given as 'University professor of mathematics. Emergency appointment\n(\nStructured\n)\nR.A.E. Farnborough'. His wife Dorothy has occupation 'Unpaid domestic duties'. Also living in the same house is\nGeorge C McVittie\nwith occupation 'University reader in mathematics. Emergency appointment - Air Ministry'. Before the war,\nMcVittie\nand Temple were colleagues in mathematics at King's College, London. There was also a domestic servant living at the same address.\nAfter\n1945\nTemple returned to King's College.\nClive Kilmister\nwrites\n[\n13\n]\n:-\nTemple's return to King's in\n1945\nwas a little reluctant, as he correctly anticipated pressure to serve in many administrative capacities both in college and university. He was able to avoid the worst dangers, to continue with his mathematics and to make the department a very happy place with a strong emphasis on research. I recall the very happy atmosphere in the early\n1950\ns. Temple's undergraduate lectures were said to fall into two categories, both of which were delivered without notes. The first happened on days when he had crossed Waterloo Bridge on the way to college by himself; they enlightened and inspired every member of the class. The second occurred when he had crossed the bridge with a colleague; then the better undergraduates had the chance of seeing a first-rate mathematician at work re-creating the subject as the lecture progressed. Aerodynamics still dominated the applied research. The numerous postgraduate students in that field spent much time with the primitive mechanical calculators of the day. Yet each understood very well the importance of his problem and its general structure. The breadth of Temple's mathematical knowledge was a constant surprise and every member of the staff benefited from informed comment on his work. My own interest in\nEddington\n's work made his comments particularly valuable. The overwhelming aspects of his character were courtesy, kindness and wit, so that he was much loved by all.\nHe advised the Minister of Civil Aviation on air traffic control during\n1948\n-\n50\n.\nTemple worked on a wide variety of topics. Relativity theory, aerodynamics and quantum mechanics have been mentioned above but he also worked on analysis contributing to the study of the\nLebesgue\nintegral.\nIn\n1953\nTemple moved to the Sedleian chair at Oxford to succeed\nSydney Chapman\n. He delivered his Inaugural Lecture as Sedleian Professor of Natural Philosophy before the University of Oxford onÂ\n2\nÂ MarchÂ\n1954\n. You can read the lecture, entitledÂ\nThe Classic and Romantic in Natural Philosophy\n, at\nTHIS LINK\n.\nHe made many visits to the United States. He sailed on the\nAquitania\nfrom Southampton to Halifax, Canada in January\n1947\n, on business associated with the Ministry of Civil Aviation. His other trips were all made with his wife Dorothy, first in\n1949\nand again in\n1950\n. They sailed on the\nQueen Mary\n, arriving in New York on\n15\nSeptember\n1959\n, when making a visit to the Institute for Advanced Study at Princeton from September\n1959\nto January\n1960\n. They returned, again on the\nQueen Mary\n, sailing from New York to Southampton, arriving on\n12\nApril\n1960\n. Later in\n1960\nthey were again on the\nQueen Mary\n, going to the University of Western Ontario where Temple had been appointed as a special advisor on the Applied Mathematics programme. They returned in February\n1961\n.\nWe have already mentioned three of Temple's books but he wrote several others:\nAn introduction to fluid dynamics\n(1958)\n,\nCartesian tensors: An introduction\n(1960)\n, and\nThe structure of the Lebesgue integration theory\n(1971)\n. In\n1981\n(\nat the age of\n80)\nhe published a book on the history of mathematics. This book\n100\nyears of mathematics. A personal viewpoint\n(1981)\ntook him ten years to write and deals with, in his own words:-\n... those branches of mathematics in which I had been personally involved.\nYou can read extracts from reviews of these books at\nTHIS LINK\n.\nHe declared that it was his last mathematics book, and entered the Benedictine Order as a monk. He was ordained in November\n1983\nhaving entered the Benedictine community at Quarr Abbey in Ryde on the Isle of Wight and made his Solemn Profession as a monk in\n1982\n. However he could not stop doing mathematics and when he died he left a manuscript on the foundations of mathematics. He claims:-\nThe purpose of this investigation is to carry out the primary part of\nHilbert\n's programme, i.e. to establish the consistency of set theory, abstract arithmetic and propositional logic and the method used is to construct a new and fundamental theory from which these theories can be deduced.\nTemple was elected a Fellow of the\nRoyal Society\nin\n1943\nand, in\n1970\n, he was awarded the\nSylvester\nMedal of the Society:-\n... in recognition of his many distinguished contributions to applied mathematics, especially in his work on distribution theory.\nHe was President of the\nLondon Mathematical Society\nduring the period\n1951\n-\n53\n. He was also elected President of the\nMathematical Association\n, and gave his Presidential Address entitled\nThe Growth of Mathematics\nin January\n1957\n.\nYou can read this address at\nTHIS LINK\n.\nHe was awarded honorary degrees from Dublin University\n(1961)\n, Louvain University\n(1966)\nand the University of Western Ontario\n(1969)\n. He received this last mentioned honour, a Doctor of Laws degree, on Thursday\n29\nMay\n1969\n[\n27\n]\n:-\nProfessor George Temple, C.B.E., F.R.S., is one of the world's most distinguished mathematicians in both applied and pure mathematics. He is the author of many papers and several books which are classics in their field. He is particularly noted for his contributions to a number of branches of fluid dynamics and to the theory of distributions. Recently he retired from the Sedleian Chair of Natural Philosophy at Oxford and is currently visiting a number of U.S. universities. Prior to becoming Sedleian Professor he was Professor of Mathematics for\n21\nyears at King's College, University of London, England. Professor Temple has been associated with Western since\n1961\nwhen he was special advisor on the Applied Mathematics program.\nTemple died at Kite Hill Nursing Home, Wootton Bridge, Isle of Wight, from prostate cancer and was buried at Quarr Abbey.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}