{
  "nome_completo": "Georges Louis Leclerc Comte de Buffon",
  "nome_curto": "Georges Buffon",
  "ano_nascimento": "1707",
  "ano_morte": "1788",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Buffon/",
  "lugar_nascimento": "Montbard, Côte d'Or, France",
  "lugar_morte": "Paris, France",
  "biografia": "Georges Buffon\n's mother was Anne-Cristine Marlin and his father was Benjamin-François Leclerc. Georges-louis Leclerc, as was his name until\n1725\n, was the eldest of his parents five children. He was born into a wealthy family and his mother, who was a well educated person from whom he said he inherited his intelligence, was related to a wealthy banker. When Georges was ten years old his mother inherited a large sum of money which allowed Benjamin Leclerc to become lord of Buffon and Montbard. The name Buffon was that of an estate that his mother Anne inherited at this time.\nAfter his mother inherited the fortune in\n1717\nthe family moved into a fine house in Dijon and Benjamin Leclerc became a counsellor in the Burgundian parliament. Jacques Roger writes that in Dijon the Leclerc family\n[\n1\n]\n:-\n... occupied an important place in society. The intellectual life of that provincial capital was active but not oriented towards science at that particular time.\nAt this time Georges entered the Jesuit College of Godrans in Dijon and he was educated there until\n1723\n. Three of his younger brothers went on to join the Church but Georges' father wanted his eldest son to study law. It did not look that Georges would become a star in legal circles for his school performance was not above average. The one subject that he did show a talent for was mathematics but he followed his father's wishes and began to study law in\n1723\n. However, he was more interested in mathematics than he was in the law and at the age of\n20\nBuffon\n(\nhe was now calling himself Georges-Louis Leclerc De Buffon\n)\ndiscovered the\nbinomial theorem\n. He corresponded with\nGabriel Cramer\non mechanics, geometry,\nprobability\n,\nnumber theory\nand the differential and integral calculus.\nIn\n1728\nBuffon went to Angers to study mathematics, but he also studied other topics such as medicine and botany. In\n1730\n, while a student in Angers, he became involved in a duel and as a result had to flee the town. He went to Nantes, where he lived with a young English nobleman, the Duke of Kingston. Buffon, the Duke of Kingston and his tutor Nathaniel Hickman, visited southern France and Italy, arriving in Rome early in\n1732\n. When news reached Buffon that his mother had died, he returned to France. His mother had left Buffon her fortune which he inherited despite his father objecting strongly. Buffon decided to settle on what was now his estate at Montbard.\nThe rich young man was now able to make an impression in the highest ranks of the political and scientific circles in Paris. Jean-Frédéric Phélypeaux Comte de Maurepas, the minister to the navy, was undertaking the huge task of reorganizing the severely demoralized French navy. He wanted to improve the construction of ships of war, and he asked Buffon to study the tensile strength of timber to assist in this task. He next published\nMémoire sur le jeu de franc-carreau\nⓉ\n(\nMemoir on the game 'Franc-carreau'\n)\nwhich introduced differential and integral calculus into probability theory. As a result of this fine memoir Buffon was elected to the\nRoyal Academy of Sciences\nin Paris on\n9\nJanuary\n1734\n.\nSomeone who is skilled in financial affairs and who starts with a large amount of money is usually able to make a considerably larger fortune for themselves, and this is precisely what Buffon did over the years from\n1734\nto\n1740\n. However, in addition to time spent on his financial affairs he was also able to work on mathematics, on botany\n(\nin particular plant physiology\n)\nand on forestry where he examined improving properties of timber in his own forests in Burgundy. His main mathematical contribution of this period was the publication of his translation of\nNewton\n's\nMethod of Fluxions and infinite series\nin\n1740\n.\nA new phase in Buffon's life began in July\n1739\nwhen he was appointed as keeper of the royal botanical garden, the\nJardin du Roi\n. It was the Comte de Maurepas, whom we mentioned above, who was the main influence behind this prestigious appointment. Roger in\n[\n1\n]\ndescribes Buffon's life following this appointment:-\nEach spring, from\n1740\non, Buffon left Paris for Montbard, to administer his estates, continue his research, and edit his writings. His robust constitution allowed him to adhere to a well-organised schedule: he arose at dawn and spent the morning at work, and the afternoon on business affairs. For fifty years, Buffon spent the summer on his estate, returning to Paris in the autumn. At the end of this time, he had doubled the area of the Jardin du Roi, enriched its collections, and enlarged its buildings considerably; moreover, he himself had become rich, having been showered with pensions and having increased his landholding.\nBuffon married Françoise de Saint-Belin-Malain in\n1752\n. By this time Buffon was forty-five years of age but his wife was twenty. They had one son in\n1764\nbut Buffon's wife died five years later. It looked as though Buffon's son had a brilliant future and he was expected to achieve fame at least equal to that of his father. When Buffon's son was seventeen years old his father arranged for the naturalist J-B Lamarck to take him with him on his botanical studies through Europe. However brilliance does not always lead to a desire to study and he turned into an unstable spendthrift. During the Terror of the French Revolution he was sent to the guillotine in\n1794\n.\nThe wide range of topics which Buffon wrote on include mathematics, the theory of probability, astronomy and physics, especially optics. He is best known, however, for his work on natural history especially\nDiscours sur la manière d'étudier et de traiter l'histoire naturelle, Théorie de la terre\nⓉ\n(\nDiscourse on how to study and treat natural history;  Theory of the Earth\n)\nand\nHistoire des animaux\nⓉ\n(\nHistory of animals\n)\nall three of which were published in\n1749\n. His aim was to publish\n50\nvolumes of\nHistoire naturelle, générale et particulière\nⓉ\n(\nNatural History, general and specific\n)\nbut only\n36\nhad appeared by the time of his death. It is a major achievement which ambitiously attempts to present all knowledge of natural history, geology, and anthropology and their interconnections in a systematic way in a single work.\nUnlike\nNewton\n, Buffon believed that everything developed through natural phenomena. He what a strong supporter of\nNewton\n's\nPrincipia\nbut rejected the notion that the planets and their motions were a direct consequence of God's intervention. Buffon proposed a method of creation of the planets which involved the collision of a comet with the sun. Although we now know that such a model will not work, it was important in proposing a model which followed the laws of mechanics. His views of geology and the structure of the earth was similarly based on natural events. He wrote:-\nIn order to judge what has happened, or even what will happen, one need only examine what is happening. ... Events which occur every day, movements which succeed each other and repeat themselves without interruption, constant and constantly reiterated operations, these are our causes and our reasons.\nSimilarly Buffon argued that life came about on earth through the appearance of organic matter which was the result of heat on aqueous, oily substances. He worked hard trying to understand reproduction, a major topic of the day, and although his theories are in error they are again based on scientific principles. He argued that species existed but that families did not, being merely an invention of those attempting classification of the animal world. Later in his writings, however, he does admit the idea of a family although he prefers to use the name genus an treat it a little differently from the way others viewed animal classification at this time. Buffon included the human species as one of the species of animals which he studied and applied the same approach and methods\nRoger writes in\n[\n1\n]\n:-\nBuffon's work is of exceptional importance because of its diversity, richness, originality, and influence. Buffon was among the first to create an autonomous science, free of any theological influence. He emphasised the importance of natural history and the great length of geological time. He envisioned the nature of science and understood the roles of palaeontology, zoological geography, and animal psychology.\nDespite these achievements Buffon was not greatly admired during his lifetime as is pointed out in\n[\n2\n]\n:-\nBuffon's position among his contemporaries was by no means assured. Though the public was nearly unanimous in its admiration of him, he met with numerous detractors among the learned. The theologians were aroused by his conceptions of geological history; others criticized his views on biological classification; the philosopher Étienne de Condillac disputed his views on the mental faculties of animals; and many took from his work only some general philosophical ideas about nature that were not faithful to what he had written. Voltaire did not appreciate his style, and\nd'Alembert\ncalled him \"the great phrasemonger.\" According to the writer J-F Marmontel, Buffon had to put up with snubs from the mathematicians, chemists, and astronomers, while the naturalists themselves gave him little support and some even reproached him for writing ostentatiously in a subject that required a simple and natural style.\nBuffon himself reacted to the attacks on him with great dignity and did not get into bad tempered disputes as many scientists of this period did. He wrote to a friend:-\nI shall keep absolute silence ... and let their attacks fall upon themselves.\nHis most notable contribution to mathematics was a probability experiment which he carried out calculating by throwing sticks over his shoulder onto a tiled floor and counting the number of times the sticks fell across the lines between the tiles. He stated\n(\nsee\n[\n10\n]\n)\nthat the favourable cases correspond:-\n... to the area of part of the cycloid whose generating circle has diameter equal to the length of the needle.\nThis experiment caused much discussion among mathematicians which helped towards an understanding of probability. The\n1980\npaper\n[\n6\n]\ngives a new analysis of Buffon's needle experiment, and the author conducts an experiment with\n2000\nthrows which gives π =\n3\n.\n1430\n....\nThe needle experiment, described in\n1777\n, was not the only problem in probability that Buffon examined. Also in\n1777\nhe attempted to calculate the probability that the sun would continue to rise after having been observed to rise\nn\nn\nn\ndays in a row; see\n[\n13\n]\nfor details.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}