{
  "nome_completo": "Georges Henri Reeb",
  "nome_curto": "Georges Reeb",
  "ano_nascimento": "1920",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reeb/",
  "lugar_nascimento": "Saverne, Bas-Rhin, France",
  "lugar_morte": "Strasbourg, France",
  "biografia": "Georges Reeb\n's parents were Theobald Reeb\n(\nborn\n2\nOctober\n1870\nin Keskastel, Alsace, died\n29\nSeptember\n1938\nin Saverne, France\n)\nand Caroline Engel\n(\nborn\n27\nNovember\n1879\nin Pfalzweier, Alsace, died\n28\nNovember\n1966\nin Saverne, France\n)\n. Georges, who had one brother, was born in Saverne which is about\n40\nkm north west of Strasbourg in Alsace. We have given his parents' birthplaces as Alsace rather than specifying France or Germany. This whole region had a difficult history, being a part of France up to the Franco-German war of\n1870\n-\n71\nafter which it became part of Germany. In\n1919\n, following World War I, Alsace again became part of France so Georges grew up in a district which still had quite difficult tensions between the French and German speaking peoples.\nReeb began his university studies at the University of Strasbourg before the start of World War II. However the university was displaced due to the war which began on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but, over the following months, France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. In September\n1939\n, as part of these preparations, the inhabitants of Strasbourg had been evacuated and the University of Strasbourg was displaced to Clermont-Ferrand. Reeb was part of the evacuation and continued his studies in Clermont-Ferrand. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and, by June, France had surrendered and fighting had ended. However, the Germans regarded the university in Clermont-Ferrand as their particular enemy, because of the history of French and German periods of the University of Strasbourg from the time of the Franco-German war in\n1870\n. Reeb, like all the staff and students, had to endure difficult times during the occupation.\nThe advisor for Reeb's doctoral work at Clermont-Ferrand was\nCharles Ehresmann\nwho, like Reeb, was an Alsatian.\nEhresmann\nhad only been appointed to Strasbourg shortly before the university moved to Clermont-Ferrand and Reeb was his second doctoral student. The first of\nEhresmann\n's doctoral students,\nJacques Feldbau\n, had been born in Strasbourg but was Jewish. He did not survive the war, being caught by the Gestapo in June\n1943\n. He published a joint paper with\nEhresmann\nin\n1944\n, namely\nSur les champs d'éléments de contact de dimension p complètement intégrables dans une variété continuement différentiable\nV\nn\nV_{n}\nV\nn\n​\nⓉ\n(\nOn integral varieties of  the fields of completely integrable contact elements of dimension p of in a  continuously differentiable variety V_n\n)\n. This papers studies fields of\np\np\np\n-dimensional elements of contact in a differentiable manifold and, in\n1945\n, Reeb published a single authored paper\nSur les variétés intégrales des champs d'éléments de contact complètement intégrables\nⓉ\n(\nOn integral manifolds of fields of fully integrated contact elements\n)\nwhich extended some of the results contained in his joint paper with\nEhresmann\n. This\n1945\npaper by Reeb also contains theorems about the existence or non-existence of compact integrals for exact Pfaffian forms and Reeb's next paper\nSur les points singuliers d'une forme de Pfaff complètement intégrable ou d'une fonction numérique\nⓉ\n(\nOn the singular points of a completely integrable Pfaff form or numerical function\n)\n(1946)\nstudied a certain type of singular point of a Pfaffian form. All these papers were published in\nComptes rendus\nof the\nAcademy of Sciences\n. Reeb completed his doctoral thesis\nPropriétés topologiques des variétés feuilletées\nⓉ\n(\nTopological properties of laminated varieties\n)\nin\n1948\nand was awarded his doctorate.\nIn\n1952\nReeb was appointed to the University of Grenoble. In the following year\nCharles Ehresmann\nand\nAndré Lichnerowicz\norganised the conference \"\nDifferential geometry\n\" at the University of Strasbourg. Reeb gave a talk at the conference on\nFinsler\nand\nCartan\nspaces. The paper of this talk contains an intrinsic definition of the\nLiouville\nform. Reeb spent time at the Institute for Advanced Study at Princeton in\n1954\n. In\n1963\nhe left Grenoble when he was appointed to the University of Strasbourg. There, together with his colleague Jean Frenkel and helped by\nJean Leray\nand\nPierre Lelong\n, he set up the\nRencontres entre Mathématiciens et Physiciens Théoriciens\nin\n1965\n:-\nThese meetings aimed at creating and strengthening bridges between active mathematicians and physicists in the areas of current strong development. The goal was to promote the recent advances in these disciplines and to make them accessible to wide circles of professional mathematicians and students of mathematics and physics.\nIn\n1966\nReeb and Frenkel also founded the Institute de Recherche mathématique Avancée as the first university laboratory associated to the Centre National de la Recherche Scientifique. Frenkel was the first director of the Institute in\n1966\nbut in the following year Reeb became director and held this position until Claude Godbillon took on that role in\n1972\n. Michèle Audin gives the following summary of Reeb's most important contributions\n[\n1\n]\n:-\nHe is one of the inventors of the theory of foliations. He invented what is now called the \"Reeb foliation\", a foliation of the\n3\n-sphere, all the leaves of which are diffeomorphic to\nR\n2\n\\mathbb{R}^{2}\nR\n2\n, except one, which is a\n(\ncompact!\n)\n2\n-torus. Another useful tool in topology was named after him, the \"Reeb vector field\" associated with a contact form. And Reeb's theorem is the one that tells you that, if a compact manifold has a function with only two critical points, this manifold is homeomorphic to a sphere. This is the way you prove that the\nMilnor\nspheres, although not diffeomorphic, are homeomorphic to the sphere\nS\n7\nS^{7}\nS\n7\n, a result that came in\n1956\n...\nAudin also gives an indication of Reeb's character\n[\n1\n]\n:-\nGeorges Reeb fitted all the prejudices French people might have against Alsatians: he was massive and slow, very slow. Slowness is not a quality French mathematicians usually praise very much. But Reeb did not care. He was even proud of it. He used to say that, when he was a professor at Grenoble University, the students attending his course suggested recording his lectures on tape, so that they could listen to them at double speed. When I arrived in Strasbourg in\n1987\n, he used to come to the department and go from one office to another talking with people, which had always been his way of working. Since he reckoned I was always in a hurry, he used to tell me the \"story of the hurrying Savernois\"\n(\nboth a paradox and a never-ending story\n)\n. He also told many jokes about his complete baldness ....\nReeb published a number of books.\nÉquations différentielles\nⓉ\n(\nDifferential equations\n)\n, written jointly with Robert Campbell, was a\n78\n-page booklet published in\n1964\n. It presented the theory of ordinary differential equations in a form which would prove useful to physicists and engineers. The booklet was in three parts with the third part written by Reeb alone. This part contained results on\ndynamical systems\n, the topological theory of\n2\n-dimensional autonomous systems, applications of fixed-point theorems, stability, and singular perturbation procedures. This material was not available in book farm at this time. In the summer of\n1972\n, Reeb gave a lecture course at the University of Montreal in Canada. These lectures were published as\nFeuilletages: résultats anciens et nouveaux\nⓉ\n(\nFoliations: old and new results\n)\n(1974)\n. In his lectures, Reeb put into context the results which his very active trajectories research group in Strasbourg had obtained. He explained the geometric approach to the theory of differential equations which he had adopted and indicated that it followed the approach begun by\nHenri Poincaré\n,\nPaul Painlevé\nand\nÉlie Cartan\n.\nTowards the end of his career, Reeb's interests moved into other areas of mathematics\n[\n4\n]\n:-\nGeorges Reeb had a strong interest in the relationship between computers and nonstandard analysis, and ... was a dedicated intuitionist.\nFor example, at the Fourth International Colloquium on Differential Geometry at Santiago de Compostela in\n1978\nhe gave the talk\nÉquations différentielles et analyse non classique\nⓉ\n(\nDifferential Equations and non-classical analysis\n)\nwhich surveyed results on the perturbation of dynamical systems obtained using methods of nonstandard analysis. In\n1980\n, at the Third Colloquium on Categories held in Amiens, he gave the lecture\nLa mathématique non standard vieille de soixante ans?\nDedicated to\nEhresmann\n, his talk provided a convincing illustration of the methods and the spirit of nonstandard analysis. In collaboration with Francine Diener, he published the book\nAnalyse non standard\nⓉ\n(\nNonstandard analysis\n)\n(1989)\n. L D Kugler writes in a review:-\nThis text is intended for the mathematician or user of mathematics who wants an easily comprehensible description of nonstandard analysis. The authors use a simplified version of E Nelson's axiomatic approach, and move quickly to the fundamental characterizations that nonstandard analysis provides. ... The book is engagingly written ...\nEdward Nelson, who is mentioned in the previous quote, makes the following personal remarks about Reeb in\n[\n4\n]\n:-\nOne of the most treasured experiences of my life is my friendship with Georges Reeb. We had many strong discussions together, intuitionist versus formalist. What he created was unique in my experience. His rare spirit, gentle but fiercely demanding of the highest standards, inspired a group of younger mathematicians with an unmatched ethos of collegiality. And their discoveries are extraordinary. Reeb found, and led others to find, not only knowledge and beauty in mathematics, but also virtue. His insights into the nature of mathematics will point the way towards the mathematics of the future.\nReeb was honoured many times for his outstanding contributions. He was president of the\nFrench Mathematical Society\nin\n1967\n. The\nAcademy of Sciences\nawarded him their Petit-D'Ormoy prize in\n1971\n. He was awarded honorary degrees from the University of Neuchatel and from the Albert Ludwig University of Freiburg-im-Breisgau.\nGustave Alfred Arthur Choquet\nhad been, from\n1950\n, a professor at the University of Paris. He made important contributions to a variety of fields: topology,\nmeasure theory\n, descriptive set theory, potential theory, and\nfunctional analysis\n. Following Reeb's death, he wrote to Daniel Bernard\n(\nsee\n[\n2\n]\n)\n:-\nI wanted to come to Strasbourg to accompany Reeb to his final resting place and find, among his students and all those who loved him, the precious memory of his warm presence. ...\nThat is what Reeb was for me, as certainly for many others, one of those beings who believe in the wisdom and goodness of man. He will always remain for me a comfort and support during hours of doubt.\nAnd yet I have not had the chance to meet him often: I knew that he was a student of\nCharles Ehresmann\n, that he created and developed a theory of foliations, and that already he had been able to train in his school many bright students who have become very good mathematicians. But it was two circumstances much later that made me discover both the sower of mathematical ideas and the warm and wise man he was.\nThe first was a long conversation following the funeral of\nCharles Ehresmann\nin Amiens; he made me into his disciple convinced of his vision of Non-Standard Analysis: the phrase \"The integers\n1\n,\n2\n,\n3\n, ... etc.. ... do not exhaust the set\nN\n\\mathbb{N}\nN\nin the theory of sets.\"\nMy second prolonged contact with Georges Reeb - and unfortunately it was the last - took place at the Conference at Cerisy-la-Salle three years ago on 'The Continuous and the Discrete'. Many of his students were present, and I was amazed to witness the affection and admiration with which they surrounded him; mutual affection and respect, because he knew how to attract and retain young people by respecting their ideas, the Socratic way which allowed them to discover their mistakes and choose fruitful paths.\nHe was a very human man, an example to us all ...",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}