{
  "nome_completo": "George Szekeres",
  "nome_curto": "George Szekeres",
  "ano_nascimento": "1911",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szekeres/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Adelaide, Australia",
  "biografia": "George Szekeres\nwas the son of Armin Szekeres. George was born into a Jewish Hungarian family who owned a leather business. He soon showed great mathematical talents and, while at high school, was greatly inspired by the journal\nKözépiskolai Matematikai és Fizikai Lapok\n(\nMathematical and Physical Journal for Secondary Schools\n)\nwhich posed mathematical problems and contained articles taking the talented pupil into the deeper delights of the subject.\nOne might have thought that someone so deeply interested in mathematics at school would naturally study mathematics at university. However these were difficult times in Hungary and what George's parents required was a son with the necessary skills to take over the family leather business. He therefore enrolled for a chemical engineering degree at the Technological University of Budapest. Szekeres did not give up his interest in mathematics, however, for he continued to meet with the enthusiastic mathematical problem solvers. These included\nPaul Erdős\nand\nPaul Turán\n, and also a Jewish student named Esther Klein, the daughter of Ignaz Klein. At one of their meetings Esther posed the following problem:-\nGiven five points in the plane no three of which are collinear, prove that four of them form a convex quadrilateral.\nSzekeres and\nErdős\nwrote a paper in\n1935\ngeneralising this result; it became one of the cornerstones of combinatorial geometry. It was\nErdős\nwho chose the name \"Happy Ending problem\" for this, since Szekeres married Esther Klein on\n13\nJune\n1937\n.\nAfter graduating with a degree in chemical engineering in\n1933\n, Szekeres worked for six years as an analytical chemist in Budapest but conditions there became more and more difficult due to the persecution of Jews by the Nazis. George and Esther Szekeres decided to escape from the European nightmare of World War II, and Szekeres took a job in a factory in Shanghai, China, as a leather chemist. This, however, provided no escape from war because when he moved to Shanghai in\n1939\nhe was moving into a war zone. Japanese troops had landed near Shanghai, at the mouth of the Yangtze River, and taken Shanghai in November\n1937\n. Germany and Italy signed a pact with Japan in\n1940\n, the year that Peter, the first child of the Szekeres family, was born in Shanghai, and at this stage Szekeres was again essentially back into the same war he had escaped from in Europe. The factory where he was working closed and the Szekeres family became refugees. They now endured extraordinarily difficult times. The situation in China was dire with Communist and Nationalist military forces opposing each other and both opposing the invading Japanese. The Szekeres family, now with a young son, were in extreme danger and fled for their lives when bombing was taking place. The United States began to build up air power in China and by the end of\n1943\nthe China-based United States\n14\nth\nAir Force was in a position to compete with the Japanese in central China. For a while Szekeres was employed as a clerk in an American air force base, and he remained in China until\n1948\n.\nSzekeres was an outstanding mathematician, but had no formal qualifications in the subject. He had taken a calculus course while an undergraduate at the Technological University of Budapest but this was the only mathematics course he had officially studied. On the other hand he had outstanding mathematics publications such as the\n1935\npaper with\nErdős\n;\nEin Problem über mehrere ebene Bereiche\n(1940)\nin which he gave an elementary proof a conjecture of G Grünwald;\nOn an extremum problem in the plane\n(1941)\n;\nOn a certain class of metabelian groups\n(1948)\n; and\nCountable Abelian groups without torsion\n(1948)\n. It was, nevertheless, an inspired move by the University of Adelaide to offer Szekeres a lectureship in mathematics in\n1948\n. The family arrived in Australia in June\n1948\nand for the first three years they shared a flat with Marta Sved, a Jewish school friend of Esther who had trained as a mathematician and was by this time living with her husband and two children in Adelaide. Szekeres established himself as an outstanding mathematician during fifteen years spent in Adelaide. Judith, the second child of the Szekeres family, was born in Adelaide in\n1954\n. In addition to keeping home and bringing up the children, Esther also did some teaching at the University. In\n1964\nSzekeres was appointed as professor of mathematics in the University of New South Wales.\nD Harvey describes the broad mathematical interests of Szekeres\n[\n4\n]\n:-\nBesides combinatorial geometry, he has also made contributions in the theory of partitions, graph theory, and other areas of combinatorics. Another prominent topic in George's career is general relativity; George is perhaps best known for his role in developing the mathematical theory underlying the study of black holes. He embraced the computer age with enthusiasm, making early contributions to techniques of numerical analysis, especially in the theory of computing high dimensional integrals. More recently, his research interests include combinatorial geometry, Hadamard determinants, and chaos theory.\nThe reference to chaos theory here refers in particular to his interest in\nFeigenbaum\n's functional equation. Let us be a little more specific and give a few examples of papers Szekeres published. There was the\n1957\npaper\nSpinor geometry and general field theory\nwhich Szekeres described in the introduction as follows:-\nThe purpose of the present work is to exploit, more fully than has been done heretofore, the possibilities of spin connection from the point of view of geometrical field theories and to develop a geometry whose connection is derived exclusively from the displacement of spinors  ...\nIn\n1958\nSzekeres published the group theory paper\nOn a problem of D R Hughes\nwritten jointly with\nE G Straus\n, then two years later he published\nOn the singularities of a Riemannian manifold\nin which he discussed the problem of determining when an apparent singularity in a Riemann manifold is real, and when it may be eliminated by an extension of the space. In the same year he published\nOn the propagation of gravitational waves\nand\nOn some extremum problems in elementary geometry\n, this latter paper being written with\nErdős\n. In\n1965\nhe wrote a numerical analysis paper\nSome estimates of the coefficients in the Chebyshev series expansion of a function\nand a paper dealing with a combinatorial problem\nOn a problem of Schütte and Erdős\nwritten jointly with his wife Esther. He continued to publish on relativity with work such as\nKinematic geometry: An axiomatic system for Minkowski space-time\n(1968)\n. Throughout his career he loved combinatorics, graph theory in particular, and he published papers on this topic such as\nPolyhedral decompositions of cubic graphs\n(1973)\nand\nNon-colourable trivalent graphs\n(1975)\nin the few years before he retired.\nWe should say a few words about the interests of Szekeres outside mathematics. As to hobbies he loved art and music, particularly chamber music. He was an accomplished musician playing violin and viola. He played in the North Sydney Symphony Orchestra and the Ku-ring-gai Philharmonic Orchestra, also supporting this orchestra by acting as treasurer from the time it was founded until\n2000\n. He also loved walking and even in the\n1990\ns when he had past eighty years of age, he would set out on long walks with his daughter Judith.\nSzekeres received many honours for his achievements. He was elected to the\nAustralian Academy of Science\nin\n1963\nand was awarded its Thomas Rankin Lyle Medal in\n1968\n. He was also elected to the\nHungarian Academy of Science\n. He was a founder member of the\nAustralian Mathematical Society\nwhen it was founded on\n15\nAugust\n1956\nand served as its president from\n1972\nto\n1974\n. He was made a Member of the Order of Australia in\n2002\n.\nHe retired in\n1976\n, when he reached\n65\n, and was named Emeritus Professor at the University of New South Wales. He continued to be mathematically active publishing many papers during the last\n25\nyears of his life. Let us give a few examples of some of this work. In\n1978\nhe published a joint paper with\nErdős\nentitled\nSome number theoretic problems on binomial coefficients\nwhich gave a number of very difficult problems about binomial coefficients. His\n1985\npaper\nDistribution of labelled trees by diameter\nanalysed the graphs described by the title and, among many other results, found the expected value of the diameter of a random labelled tree on\nn\nn\nn\nvertices.\nAlso in\n1985\nhe showed his continuing interest in using computers in mathematical investigations with\nComputer examination of the two-dimensional simultaneous approximation constant\n. Let us say a little about this paper. In\n1970\nSzekeres had published his two-dimensional\nFarey\ndissection algorithm, then produed a continuous version of it in\n1984\n. In his \"Computer examination\" paper, he  gives a continuous analogue of the best two-dimensional simultaneous Diophantine approximation constant, based on this\n1984\nwork. With this algorithm he then tests the conjecture that the best constant is\n2\n7\n\\large\\frac{2}{7}\\normalsize\n7\n2\n​\n, showing that the data supports the conjecture.\nOther papers examined the asymptotic distribution of partitions,\nHadamard\ndeterminants\n, tilings of the square, and primality testing. Keith Briggs writes\n[\n1\n]\n:-\nI knew George Szekeres from about\n1990\n.  Although officially \"retired\", he maintained an active interest in many areas of mathematics, and was particularly encouraging to young mathematicians.  He would typically listen to a problem, and reply a few days later with a long letter full of useful suggestions. These letters were characterized by a kind of naivety\n(\nin a good sense\n)\n- a child-like enthusiasm was usually evident and if the subject was not one in which he was very experienced, he would not fear to start right at the bottom and work things out for himself.\nAnother unusual quality was George's interest in computational and \"experimental\" mathematics, which he maintained until his last paper on Abel's equation.  I believe George started writing Fortran programs around\n1960\n, for his multidimensional\ncontinued fraction\nalgorithm. In the mid-\n90\ns, I worked with him on\nFeigenbaum\n's functional equation.   We wrote programs to solve several cases of this equation, and I was very impressed by this\n80\nyear-old who knew more about how to actually get computers to do real mathematics than many of my younger colleagues.\nI would thus describe George as a pioneer of experimental mathematics  - he saw the potential of the computer, particularly in testing conjectures, very early.\nWhen Szekeres moved to the University of New South Wales in\n1964\nhe bought a home in Turramurra, which is about\n15\nkm north of Sydney city centre. In order to understand why this beautiful house was very cheap, and to understand a little about the Szekeres family who were happy to buy it, we have to relate some rather gruesome details of events which occurred at the New Year of\n1963\n. On that New Year's day two young men discovered the bodies of Mrs Margaret Chandler and Dr Gilbert Bogle near Fuller's Bridge, on the Lane Cove River in north Sydney. Gilbert Bogle was a physicist at the Commonwealth Scientific and Industrial Research Organization while Margaret Chandler was the wife of Geoffrey Chandler who worked at the same organisation. Gilbert and Margaret were lovers, this being approved by their respective spouses. It was clear that the two had died from poison, but whether it was murder, a suicide pact, or an accidental drugs overdose has never been established. The house at Turramurra, which was on the market at a very low price, was the home of one of these two who were poisoned. It was, however, in a beautiful situation and the Szekeres family did not mind in the least its gruesome history. They lived there until\n2004\nwhen failing health forced George and Esther Szekeres to move from their rather remote home. They went back to Adelaide and soon Esther had to move to the Wynwood Nursing Home. Szekeres too moved to the Nursing Home seven weeks before his death and the two died there within an hour of each other.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}