{
  "nome_completo": "George Atwood",
  "nome_curto": "George Atwood",
  "ano_nascimento": "1745",
  "ano_morte": "1807",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Atwood/",
  "lugar_nascimento": "Westminster, London, England",
  "lugar_morte": "Westminster, London, England",
  "biografia": "George Atwood\n's parents were Isabella Sells of Inglesham, Wiltshire, and Thomas Atwood who was the curate of the parish of St Clement Danes, Westminster, where George was baptized on\n15\nOctober\n(\nthe exact date of his birth is unknown\n)\n. George was the eldest of his parents sons and he had two younger brothers James and Thomas. He was educated at Westminster School which he entered as a king's scholar in\n1759\n. His brother James later entered the same school. In his final year at the school in\n1764\nGeorge was captain of the school. He then entered Trinity College Cambridge on\n5\nJune\n1765\nas a pensioner, meaning that he did not have a scholarship and paid for his own keep in College. He was elected to a scholarship on\n2\nMay of the following year, graduating as third\nWrangler\n(\nranked third among the First Class students\n)\nin the mathematical Tripos of\n1769\nand was first Smith's prizeman in the same year. He became a Fellow of Trinity College in October\n1770\nand taught there also becoming a tutor in\n1773\n. On\n13\nJune\n1776\nhe was elected a Fellow of the\nRoyal Society\n.\nAtwood was a very popular lecturer at Cambridge, giving many demonstrations in his lectures. He published details of his lecture course with descriptions of his demonstrations in\n1776\n[\n2\n]\n:-\nHe demonstrated elementary mechanics and hydrostatics with pulleys, pendulums, and air-pumps, as well as electricity, magnetism, and optics, including\nLeonhard Euler\n's principles of achromatic lenses. He also taught astronomy, mentioning recent surveys of the earth's density by the mathematician\nCharles Hutton\nand the astronomer royal\nNevil Maskelyne\n, plus\nMaskelyne\n's favoured lunar method for longitude.\nWilliam Pitt, British prime minister\n(1783\n-\n1801\n,\n1804\n-\n06)\n, was one of the many students who attended Atwood's popular lectures and later, when Pitt had achieved high office, he employed Atwood in the Treasury. However this was still some way into the future when Atwood gave up his position as tutor at Cambridge in\n1779\nand tried unsuccessfully to obtain a position with the board of longitude. As part of his bid to obtain a position as secretary with the board he sent the details of his Cambridge courses to Sir Joseph Banks, president of the\nRoyal Society\n. In the summer of\n1781\nAtwood sent the\nRoyal Society\ndetails of his applications of geometry to the problems of correcting sightings through sextant mirrors. This work was, as he pointed out to Banks, in line with his belief in the application of mathematical techniques to problems in the physical science.\nIn\n1779\nHutton\nhad became foreign secretary of the\nRoyal Society\nbut was forced to resign in\n1783\nby Sir Joseph Banks, the president of the Society. It was an unfortunate affair which led to considerable controversy in the Society which is discussed in detail\n[\n4\n]\n. Banks claimed that\nHutton\nhad failed to carry out his duties efficiently, but many in the Society supported\nHutton\nand felt that it was in fact Banks who had failed to manage the affairs of the Society competently. Atwood supported\nHutton\n, as did\nMaseres\n,\nMaskelyne\n,\nLanden\n,\nGlenie\n, Hornsby and others, accusing Banks of using excessive authority and of being \"despotic\". They threatened to secede from the\nRoyal Society\n. In fact there was another element to the argument which reflected the rapid increase in the use of mathematics in physical sciences. Atwood, and the others in the mathematicians' mutiny, strongly supported this as we noted above.\nIn\n1784\nPitt arranged that Atwood be given £\n500\na year and an office in the Treasury. His task was:-\n... to devote a large portion of his time to financial calculation.\nAtwood is best known for a work\nA Treatise on the Rectilinear Motion and Rotation of Bodies\n(\npublished by Cambridge University Press in\n1784)\nwhich is a textbook on Newtonian mechanics describing impact and simple harmonic motion. It also describes in detail a machine, now known as Atwood's machine, to demonstrate the laws of uniformly accelerated motion due to gravity. The machine had been constructed by George Adams, a London instrument maker, to Atwood's specification and the first description of it appeared in French in\n1780\n. Alessandro Volta had requested the machine, and copies had also been sent to Spain, but Atwood was pressed to publish a description. This is given in his\n1784\npublication. He also published a second work in the same year\nAnalysis of a Course of Lectures on the Principles of Natural Philosophy\nwhich was an expanded version of his Cambridge course which he had first given detail of in\n1776\n.\nYou can see a picture of Atwood's machine at\nTHIS LINK\n.\nAtwood also published on equations for the use of\nHadley\n's quadrant. He extended theories of\nEuler\nand\nBouguer\non the stability of ships. He was awarded the Copley Medal of the\nRoyal Society\nin\n1798\nfor this work. He also wrote on the construction of arches\n(1801)\nand on the design of a new iron London Bridge over the Thames at Blackfriars.\nAtwood was a renowned amateur chess-player and among other opponents played games against the famous French player Philidor, who was regarded as the unofficial world champion. H E Bird records\n[\n3\n]\n:-\nOf the players who encountered Philidor, Sir Abraham Janssens, who died in\n1775\n, seems to have been the best, Mr. George Atwood, a mathematician, one of Pitt's secretaries came next, he was of a class which we should call third or two grades of odds below Philidor, a high standard of excellence to which but few amateurs attain.\nOne of most interesting features of Atwood as a chess player is that he recorded and preserved some of his games, an unusual practice at that time. These records have survived, among them the last games that Philidor played which were against Atwood at Parsloe's Club in London on\n20\nJune\n1795\n.\nAtwood was highly involved with mathematical calculations which were needed by governments to run the country effectively. For example\n[\n2\n]\n:-\n... during violent wartime struggles over corn prices in\n1800\n-\n01\nhe compiled a vast survey of the assize of bread, the system of price regulation in force since the thirteenth century, including trials of the grain quantity in standard loaves, and of data on bakers' profits, designed to support the Tory government's new policy on price regulation. It was said that this intense work and calculation had broken Atwood's health.\nAtwood's brother Thomas had succeeded his father as curate at St Margaret's, Westminster, and he still held that position at St Margaret's when Atwood was buried there.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}