{
  "nome_completo": "George Salmon",
  "nome_curto": "George Salmon",
  "ano_nascimento": "1819",
  "ano_morte": "1904",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Salmon/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "George Salmon\n's father, Michael Salmon, was a linen merchant while his mother was Helen Weekes, the daughter of the Reverend Edward Weekes. Michael and Helen Salmon has four children; George being their only son. George attended Mr Porter's school in his home town of Cork, in the south of Ireland, and then entered Trinity College, Dublin, in\n1834\n. He studied mathematics and classics at Trinity, winning a classics scholarship in\n1837\n, and graduating with the best First Class degree in mathematics in\n1838\n.\nAt this time Trinity College, Dublin, restricted its fellowships, and scholarships to Anglicans. It was some time after this, in\n1873\n, that all religious requirements were removed from the university. This was not a problem for Salmon, who was an Anglican, but in order to take up the Fellowship that Trinity offered him in\n1841\nhe was required to take holy orders in the Church of Ireland, which indeed he did, being ordained deacon in\n1844\nand a priest in\n1845\n. In addition to his mathematics position, he was appointed to a divinity lectureship in\n1845\n.\nIn\n1844\nSalmon married Frances Anne Salvador, the daughter of the Reverend J L Salvador. They had six children, four boys and two girls, but only two of these six children\n(\nthe eldest boy and the youngest girl\n)\nsurvived him. In\n1848\nhe was appointed as Donegall lecturer in mathematics at Trinity.\nThe mathematics department in Trinity College had some outstanding mathematicians on the staff when Salmon joined them in\n1841\n.\nHamilton\nand\nMacCullagh\nwere on the staff there, as were\nCharles Graves\nand\nHumphrey Lloyd\n. Although the main topic of interest was synthetic geometry, Salmon only worked in this area for a short time before moving into the area of\nalgebraic geometry\n.\nSalmon became interested in the algebraic approach to geometry taken by\nCayley\n,\nSylvester\n,\nHermite\nand later by\nClebsch\n. He became a close friend of\nCayley\nand\nSylvester\nand discovered, together with\nCayley\n, the\n27\nlines on the cubic surface. To be more accurate,\nCayley\ndiscovered these but they were enumerated by Salmon. He also made many discoveries about ruled surfaces and other surfaces, including the idea of the normal singularities of an algebraic surface. As was typical of the time, Salmon's work showed a lack of concern with complete rigour.\nIn\n[\n6\n]\nGow gives many interesting quotations by\nHirst\n,\nPoncelet\n, and several others of Salmon's contemporaries and successors. Many of these comments are surprisingly critical of Salmon's style. He is best remembered for his four textbooks written between\n1848\nand\n1862\nwhich did much to breath life into British mathematics. McConnell writes in\n[\n1\n]\n:-\nThese four treatises on conic sections, higher plane curves, modern higher algebra, and the geometry of three dimensions not only gave a comprehensive treatment of their respective fields but also were written with a clarity of expression and an elegance of style that made them models of what a textbook should be. They were translated into every western European language and ran into many editions\n(\neach incorporating the latest developments\n)\n; they remained for many years the standard advanced textbooks in their respective subjects.\nThe famous four textbooks referred to in this quote are\nA treatise on conic sections\n(1848)\n,\nA treatise on higher plane curves: Intended as a sequel to a treatise on conic sections\n(1852)\n,\nLessons introductory to the modern higher algebra\n(1859)\n, and\nA treatise on the analytic geometry of three dimensions\n(1862)\n.\nA characteristic of Salmon's work was his love of carrying out lengthy calculations. He calculated an invariant of a curve of degree six and published the resulting calculation, which ran to thirteen pages, in the second edition of his treatise on higher algebra which appeared in\n1866\n.\nSalmon received many honours for his mathematical contributions. Elected to the\nRoyal Irish Academy\nin\n1843\nhe received its Cunningham Medal in\n1858\n. He was elected to the\nRoyal Society\nin\n1863\nand awarded the Royal Medal of that Society in\n1863\nand its Copley Medal in\n1889\n. He was also elected to the Institute of France and the academies of\nBerlin\n,\nGöttingen\n, Copenhagen, and the\nAccademia dei Lincei\nof Rome.\nWe have already noted that Salmon was appointed as a lecturer in divinity in\n1845\nand from\n1848\nhe held this lectureship as well as being a lecturer in mathematics. From\n1848\nto\n1866\nhe played a major role in both the departments of mathematics and divinity. We have noted his mathematical contributions over this period above, but we should also note that he had important theological publications. The first of these was his sermon\nPrayer\npublished in\n1849\n, which was followed by a series of publications of his sermons, for example many are collected in\nSermons preached in Trinity College Chapel\n(1861)\nand\nCathedral and University Sermons\n(1900)\n. It was generally accepted that his sermons were better read than listened to, since he did not have a strong voice. He also published many articles on issues dividing the Roman Catholic and Anglican churches.\nIn\n1866\nSalmon was appointed Regius Professor of Divinity at Trinity College, Dublin. At this time he gave up his mathematics lectureship, and although he continued to work at mathematics, it became more for his own amusement. His last mathematics publication was in\n1873\non periods of the recurring decimals of the reciprocals of prime numbers. He published much in the area of theology with works such as\nThe eternity of future punishment\n(1864)\n,\nThe reign of law\n(1873)\n,\nNon-miraculous Christianity\n(1881)\n,\nIntroduction to the New Testament\n(1885)\n,\nThe infallibility of the Church\n(1888)\n,\nThoughts on the textual criticism of the New Testament\n(1897)\n, and a series of articles between\n1877\nand\n1887\non the history of the early Christian Church in the\nDictionary of Christian Biography\n.\nYou can see an article about Salmon's theology at\nTHIS LINK\n.\nIn\n1871\nSalmon was installed as Chancellor of St Patrick's Cathedral and in\n1888\nhe was appointed Provost of Trinity College. He held both positions until his death. In the obituary\n[\n2\n]\ncomments are made about Salmon in both these roles. First as Provost:-\nThe late Provost was a man of tremendous force of character, and over some of his colleagues on the Board he had an influence which may correctly be described as dominating.\nThen as Chancellor of St Patrick's Cathedral\n[\n2\n]\n:-\nIt was a tradition of the Cathedral that its Chancellor should be a man of learning. The great Archbishop Ussher had held the office, and the Chancellor whose loss they deplored today was the most learned of Irish theologians since Ussher's time.\nHis expertise in two distinct fields is also mentioned\n[\n2\n]\n:-\nThe people of Dublin were in the habit of calling Dr Salmon \"a great man\", but possibly they did not all realise how great he actually was. Ten years before his connection with Irish Church affairs had made him popular in Dublin his work as a scientist had made him famous throughout Europe. It was\n40\nyears since he had laid these scientific studies aside and had diverted himself to theology, and\n20\nyears afterwards he was known through Europe as a theologian. It is difficult to recall the name of any modern scholar who had achieved such a reputation in two distinct branches of study.\nSalmon was awarded honorary degrees at Oxford\n(1868)\n, Cambridge\n(1874)\n, Edinburgh\n(1884)\nand University of Christiana\n(\nOslo\n)\n(1902)\n. He was one of those who petitioned for a charter for the new British Academy, and when Edward VII granted a charter for it in\n1902\n, Salmon was one of the founder members.\nLet us quote J Ossory's comments about Salmon's character and hobbies in the\nDictionary of National Biography:-\nHospitable and kindly, Salmon had many friends and interests. In youth a competent musician and a chess played of remarkable powers, he cultivated both recreations until an advanced age. He was an omnivorous reader ... and had a special affection for the older novelists ... The homely vigour and delightful wit of the long letters which he was accustomed to write to his friends entitle him to rank as one of the best letter writers of the\n[19\nth\ncentury\n]\n.\nFinally let us quote Dr Stubbs, the Bishop of Oxford\n[\n2\n]\n:-\nThe Provost of Trinity College is an extraordinary man. On the first day of our acquaintance I was struck with his gracious courtesy, on the second day with his learning, on the third day with his humour, and every day with his humility.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry"
  ]
}