{
  "nome_completo": "George Alexander Carse",
  "nome_curto": "George Carse",
  "ano_nascimento": "1880",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carse/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "George Carse\n's father was  George Carse\n(\nborn in Duns, Berwickshire about\n1856)\nwho was a painter and decorator. His mother was  Jane Carse\n(\nborn in Glasgow about\n1855)\n. George Alexander Carse had two younger sisters, Magdalene\n(\nborn about\n1883)\nand Jane\n(\nborn about\n1888)\n.\nGeorge Carse was brought up in Edinburgh, living at\n120\nLauriston Place. He studied at the Normal School\n(\nE. C.\n)\nfrom age five to age eleven. Then in\n1891\nhe entered George Heriot's School, Edinburgh, being dux of the school in\n1898\n. In June\n1898\nhe passed Mathematics, French, Latin, and English at the Higher level in the Scottish Leaving Certificate examinations.\nThen, after having passed the Preliminary Examination, he first matriculated at the University of Edinburgh in October\n1898\n. There he studied mathematics under\nGeorge Chrystal\n, physics under\nP G Tait\n, and chemistry under Crum Brown. In\n1898\n-\n99\nhe took the Ordinary Classes in Senior Mathematics and Political Economy; in session\n1899\n-\n1900\n, Chemistry, Natural Philosophy, and Latin; then in\n1900\n-\n01\nand\n1901\n-\n02\nhe took the Intermediate Honours Classes in Natural Philosophy and in Mathematics; taking the Advanced Honours Classes in the same two subjects in\n1901\n-\n02\nand\n1902\n-\n03\n. He was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy in April\n1903\n, and also received a B.Sc.\n(\nPure\n)\nin Mathematics, Natural Philosophy and Chemistry in the same year. Among a number of outstanding students in his class was\nJoseph Wedderburn\n.\nDuring\n1903\n-\n4\nCarse undertook research in physics at Edinburgh and also acted as an assistant to J G MacGregor. He then went to Cambridge spending the years\n1904\n-\n7\nin Emmanuel College and the Cavendish Laboratory. He attended lectures by\nSir Joseph Larmor\nand Sir Robert Ball, and worked with Sir J J Thomson. Carse then returned to Edinburgh where he was appointed as Lecturer in Natural Philosophy. He was awared a D.Sc.\n(\nPure\n)\nin\n1908\nfrom Edinburgh. During World War I his war service was spent in the Royal Arsenal, Woolwich between\n1916\nand\n1918\n. Returning to his post in Edinburgh, Carse was promoted to Reader in Natural Philosophy in\n1928\n. He retired in\n1948\n.\nWe note that the Mitchell Lectureship on Methods of Statistics was founded in\n1925\nand endowed by the businessman and president of the Glasgow Chamber of Commerce, Sir George Arthur Mitchell. the first Mitchell Lecturer was George Alexander Carse in\n1925\n.\nCarse joined the\nEdinburgh Mathematical Society\nin session\n1902\n-\n03\nwhile he was working in the Physical Laboratory of the University of Edinburgh. He was elected to the\nRoyal Society of Edinburgh\non\n21\nNovember\n1904\n, his proposers being James Gordon MacGregor,\nGeorge Chrystal\n,\nCargill Gilston Knott\n,\nWilliam Peddie\n.\nAn obituary, written by A Melville Clark, appears in the\nRoyal Society of Edinburgh\nYear Book\n1951\n, pages\n9\n-\n11\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nA report of his death in\nThe Scotsman\nof\n22\nAugust\n1950\nreads:-\nLATE DR G A CARSE\nNoted Services to Education\nA well-known Edinburgh educationist, Dr George Alexander Carse, has died suddenly. A former dux of George Heriot's School, he graduated M.A. with honours and B.Sc. at Edinburgh University in\n1903\n. He then proceeded to Emmanuel College Cambridge, and returned to Edinburgh in\n1907\nwhen he joined the University Staff as a lecturer under Professor Macgregor. In the following year he was awarded the degree of D.Sc. Dr Carse was promoted Reader in the Department of Natural Philosophy in\n1923\nand three years later was admitted a member of the Senatus. He was a director of studies in the Faculty of Arts from\n1922\nand in Science from\n1941\n. Dr Carse retired on September\n30\n,\n1948\n. His distinguished services were not confined to the university. For many years he took a leading part In the work of George Heriot's Trust, and from\n1934\ntill\n1947\nhe held the position of vice-chairman of the Board of Governors. Dr Carse was first elected to the Board in\n1927\nas a representative of Edinburgh University and he filled a number of important offices. From\n1931\nuntil\n1940\nhe was convener of the Foundationers' Committee, and thereafter convener of the Finance Committee until\n1943\n. His knowledge of Trust Orders, bursary regulations, University courses, and all matters educational was of great value to the Governors.\nThey were also well served by him as their representative on outside bodies, particularly the Board of Governors of the Edinburgh and East of Scotland College of Agriculture, on which he served for\n14\nyears, retiring in\n1942\n, and the Heriot-Watt College, in which he took a special interest.",
  "math_areas": [
    "Statistics"
  ]
}