{
  "nome_completo": "Georg Karl Wilhelm Hamel",
  "nome_curto": "Georg Hamel",
  "ano_nascimento": "1877",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamel/",
  "lugar_nascimento": "Düren, Rhineland, Germany",
  "lugar_morte": "Landshut, Germany",
  "biografia": "Georg Hamel\nattended elementary school in Düren, then entered a secondary school in the same city. While part way hrough his schooling he moved to Aachen where he completed his school education in\n1895\n. He studied at the Rheinisch-Westfälische Hochschule in Aachen for two years, then entered Berlin University in\n1897\n. There he was taught by\nSchwarz\n,\nFuchs\n,\nFrobenius\nand\nPlanck\n.\nIn\n1900\nhe went to Göttingen University where he attended lectures by\nHilbert\nand\nKlein\n. At this time\nKlein\nwas running a seminar which studied the theory of elasticity, descriptive geometry, and mechanics, and Hamel participated in this seminar. His doctoral work was supervised by\nHilbert\nand in\n1901\nhe was awarded a doctorate for his thesis\nÜber die Geometrien, in denen die Geraden die Kürzesten sind\nⓉ\n(\nOn geometries in which the lines are the shortest\n)\nwhich studied the Fourth\nHilbert\nProblem. Also in\n1901\nhe passed the state examinations to enable him to teach mathematics and physics in secondary schools. He was appointed as an assistant to\nKlein\nduring the year\n1901\n-\n02\n. He was then appointed assistant to Karl Heun at the Technical University of Karlsruhe in the autumn of\n1902\nand he presented his\nhabilitation\ndissertation to the Technical University of Karlsruhe one year later, qualifying to lecture in mathematics and mechanics.\nThe German Technical University of Brünn was looking for a professor to fill the Chair of Mechanics which fell vacant when Karl Hellmer retired. After rejecting several Austrian candidates as unsuitable, a committee of the University drew up a list of four possible candidates. They placed Hamel in first place stating that\n[\n7\n]\n:-\nHe is the youngest of all the candidates but with his knowledge and scientific achievement, he would be a credit to any university.\nHamel was appointed Professor of Mechanics at the German Technical University of Brünn on\n3\nOctober\n1905\n. He was one of four mathematicians considered to fill\nStäckel\n's chair at the Technical University of Hanover in March\n1908\n. The criteria for that post were that:-\n... the professor to be appointed, besides having fully proved teaching skills and a comprehensive knowledge of mathematics, should also have a clear understanding of its applications to engineering.\nKlein\nspoke highly of Hamel in his reference but considered\nCarathéodory\nsuperior for the particular position, and\nCarathéodory\nwas appointed. In August\n1909\nHamel married Agnes Frangenheim in Cologne. They had three daughters. Hamel was appointed to the chair of mechanics at the Rheinisch-Westfälische Hochschule in Aachen on\n1\nOctober\n1912\n, then in\n1919\nhe moved to the Technical University of Charlottenburg in Berlin where he was appointed as professor of mathematics and mechanics.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany and Nazi policies began to have a major impact on the\nGerman Mathematical Society\nand its members. Hamel was a leading member of the\nGerman Mathematical Society\nand was much involved with the political moves which went on in that Society. In fact he had been chairmen of the Reich Mathematics Association since its foundation in\n1921\n. This Association was a branch of the\nGerman Mathematical Society\nand provided in some sense a political wing. Hamel was clearly associated with the views of National Socialism and in\n1933\nspoke of a spiritual bond between mathematics and the \"Third Reich\".\nIn\n1934\nBieberbach\nmade a bid to become chairman of the Society but his bid failed and\nBlaschke\nwas elected Chairman of the\nGerman Mathematical Society\nin September\n1934\n. However\nBieberbach\n, as secretary to the Society, managed to prevent changes to the statutes of the Society that\nBlaschke\nattempted to introduce and the Reich Ministry of Education intervened forcing both\nBieberbach\nand\nBlaschke\nto resign.\nBlaschke\nresigned the Chairmanship of the\nGerman Mathematical Society\nin January\n1935\nand Hamel was appointed chairman to replace him. Although Hamel met with approval by the National Socialists, his leadership was based on mathematical scholarship despite his close links with Nazi policies. He undertook editorial duties beginning in the spring of\n1935\nfor the\nNeue Deutsche Forschungen\n, a new journal which was set up when the Germans withdrew their support from\nCompositio Mathematica\non the grounds that it was publishing too many works by non-Aryans. Together with\nSüss\nand\nBehnke\n, Hamel also served on an Instruction Commission set up by the\nGerman Mathematical Society\n. After World War II ended Hamel was appointed to the Technical University of Berlin in\n1946\n. He was a visiting professor at the University of Tübingen during\n1946\n-\n47\n.\nHamel worked in function theory, mechanics and the foundations of mathematics. He is perhaps best known for the Hamel basis, published in\n1905\n, when he made an early and explicit use of the\nAxiom of Choice\nto construct a basis for the real numbers as a vector space over the rational numbers. He wrote a number of papers on an axiomatic theory of mechanics, the first two in\n1909\n. His first textbook on mechanics was\nElementare Mechanik\nⓉ\n(\nBasic mechanics\n)\nwhich was published in\n1912\n[\n7\n]\n:-\nThis work, which was more than\n600\npages long, was devoted not only to the elements of mechanics, but also to a number of its special fields. it was based on his lectures at the Technical University\n[\nof Brünn\n]\ndealing with the elements of statics, dynamics, and hydrodynamics, as well as more advanced problems.\nHe wrote papers on differential equations, and on fluid dynamics, for example on the critical velocity of a fluid, that is the velocity at which the flow changes from laminar to turbulent. He made other interesting contributions such as his work on the mechanical \"ciphering machine\" invented by the engineer Alexander von Kryha from Berlin. In\n1927\nHamel computed the size of the key space of the Kryha-Ciphering-Machine, which was quoted extensively by \"Internationale Kryha-Maschinen-Gesellschaft\"\n(\nHamburg\n)\nto infer the unbreakability of the Kryha machines.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics"
  ]
}