{
  "nome_completo": "Georgy Fedoseevich Voronoy",
  "nome_curto": "Georgy Voronoy",
  "ano_nascimento": "1868",
  "ano_morte": "1908",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Voronoy/",
  "lugar_nascimento": "Zhuravka, Poltava guberniya, Russia (now Ukraine)",
  "lugar_morte": "Warsaw, Russian Empire (now Poland)",
  "biografia": "Georgy Voronoy\n's name is sometimes written as\nGeorgii Voronoi.\nHis father owned property at  Zhuravka, Poltava province, where Georgy was born. His father was a professor at the Nezhinsk lycée, then went on to become director of the\nGymnasium\nat Kishinev, then the Gymnasium at Berdyansk, and finally the Gymnasium at Priluki. Georgy completed his high school education at the gymnasium in Priluki, graduating in\n1885\n. During his time at this Gymnasium he had already shown his mathematical brilliance, being particularly fond of algebra. He solved a problem posed by Professor Ermakov of Kiev University on factorising polynomials which had appeared in the\nJournal of Elementary Mathematics\n. Although still a school pupil, this led to his first publication - in fact a quite substantial article.\nHe then entered the University of St Petersburg, joining the Faculty of Physics and Mathematics. There he studied\nSerret\n's algebra text and\nFaà di Bruno\n's work on binary forms. He again was attracted to algebra and found\nSokhotsky\n's course the most enjoyable of all. He wrote in his diary\n(\nsee for example\n[\n2\n]\n)\n:-\nThe pure mathematics lectures captivate me more and more. I prefer\nProfessor Sokhotsky\n's lectures in the special course on higher algebra to all the others. ... The main thing that concerns me is whether I have enough talent.\nThere is no doubt that he had ample talent and his subsequent accomplishments show this very clearly, yet it says something of his personality that he confided his doubts to his diary. Voronoy did not have a particularly easy time at university. By this time his father had retired and although he had held posts of considerable standing, nevertheless he was not well off after retirement and could not fully support his son. Voronoy had to tutor mathematics, often for rather small fees, and, taking such work very seriously and putting much effort into it, he found giving lessons exhausting. He also found life in a student residence difficult and he writes frequently in his diary about the difficulty of studying with so much noise going on and frequent student disturbances.\nAfter graduating from St Petersburg in\n1889\n, writing a dissertation on\nBernoulli numbers\n, Voronoy decided to remain there and work for his teaching qualification. He was awarded a Master's Degree in\n1894\nfor a dissertation on the\nalgebraic integers\nassociated with the roots of an irreducible\ncubic equation\n. He wrote in the Preface to the dissertation:-\nIn the essay I am now presenting, results from the general theory of algebraic integers are applied to the particular case of numbers depending on the root of an irreducible equation\nx\n3\n=\nr\nx\n+\ns\nx^{3} = rx + s\nx\n3\n=\nr\nx\n+\ns\n. The results obtained turn out to be very graphic. All integers of the field in question have a certain form. Using the form taken by the integers, it is not difficult to find a form embracing all the integral numbers divisible by a given ideal number, or, in other words, to find the ideal corresponding to that given ideal number. In our exposition the resolution of these questions is based on a detailed study of the solutions of third-degree equations relative to a prime and a composite modulus.\nVoronoy lectured at Warsaw University, being appointed professor of pure mathematics there in\n1894\n. He wrote his doctoral thesis on algorithms for\ncontinued fractions\nwhich he submitted to the University of St Petersburg. He writes in the Preface to his thesis\nOn a generalisation of the continued fraction algorithm\n(\nRussian\n)\n:-\nIn his article 'De relatione inter ternas pluresve quantitates instituenda'\nEuler\ngave the first generalisation of the continued fraction algorithm. ...\nJacobi\nchanged\nEuler\n's algorithm somewhat in order to unify the calculations.\nVoronoy then discussed\nJacobi\n's generalisation, after which he went on to look at generalisations due to\nPoincaré\nand\nHurwitz\n. He then looked at contributions by\nDirichlet\nand\nHermite\n, showing that none of the above provided a satisfactory generalisation. He then writes:-\nTaking as the basis of our investigations a special way of viewing the continued fraction algorithm, we propose a new generalisation of it.\nIn fact both Voronoy's master's thesis and his doctoral thesis were of such high quality that they were awarded the Bunyakovsky prize by the\nSt Petersburg Academy of Sciences\n.\nLater Voronoy worked on the theory of numbers, in particular he worked on algebraic numbers and the geometry of numbers. He extended work by\nZolotarev\nand his work was the starting point for\nVinogradov\n's investigations. His methods were also used by\nHardy\nand\nLittlewood\n. His major works were\nSur un problème du calcul des fonctions asympototiques\nⓉ\n(\nOn a problem of computing  asympototic functions\n)\n(1903)\n,\nSur une fonction transcendente et ses applications à la sommation de quelques séries\nⓉ\n(\nOn a transcendent function and its application to the summation of some series\n)\n(1903)\n,\nSur quelques propriétés des formes quadratiques positives parfaites\nⓉ\n(\nOn some properties of positive perfect quadratic forms\n)\n(1907)\n, and\nRescherches sur les paralleloèdres primitifs\nⓉ\n(\nResearches on primitive parallelopipeds\n)\n(1908)\n. In the first of these he considered the sum from\n1\nto\nn\nn\nn\nof\nt\n(\ni\n)\nt(i)\nt\n(\ni\n)\n, the number of divisors of\ni\ni\ni\n. This is equal to the number of integral points\n(\nx\n,\ny\n)\n(x, y)\n(\nx\n,\ny\n)\nunder the hyperbola\nx\ny\n=\nn\nxy = n\nx\ny\n=\nn\n.\nDelone\nwrites in\n[\n2\n]\nabout Voronoy's work of\n1907\n-\n08\n:-\nVoronoy's memoir on parallelohedra represents one of the deepest investigations in the geometry of numbers in the world's literature, and the originality of the methods employed in the purely geometrical first part stamps the memoir with the imprint of genius\n.\nIn considering tessellations, Voronoy introduced what are today called Voronoi diagrams or Voronoi tessellations. Today they have wide applications to the analysis of spatially distributed data, so have become important in topics such as geophysics and meteorology. Although known under different names, the notion occurs in condensed matter physics, and in the study of\nLie\ngroups.\nIn\n1904\nVoronoy attended the Third International Congress of Mathematicians at Heidelberg. There he met\nMinkowski\nand they discovered that they were each working on similar topics.\nHis health deteriorated due to gallstones. He wrote in his diary:-\nI am making great progress with the question under study\n[\nindefinite quadratic forms\n]\n; however, at the same time my health is becoming worse and worse. Yesterday I had for the first time a clear idea of the algorithm in the theory of forms I am investigating, but also suffered a strong attack of bilious colic which prevented me from working in the evening and from sleeping the whole night. I am so afraid that the results of my enduring efforts, obtained with such difficulty, will perish along with me.\nSadly his fears were justified and although he is known to have written a\n28\npage paper consisting of his notes on indefinite quadratic forms, this has been lost.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}