{
  "nome_completo": "Germund Dahlquist",
  "nome_curto": "Germund Dahlquist",
  "ano_nascimento": "1925",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dahlquist/",
  "lugar_nascimento": "Uppsala, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Germund Dahlquist\n's father was a minister in the Church of Sweden, the established Lutheran church in Sweden. Germund's mother was a poet, but also wrote a number of well-known hymns. Dahlquist entered Stockholm University in\n1942\nto begin his study of mathematics. The person who had the biggest influence on him was\nHarald Bohr\nwho was teaching there having been forced to leave Denmark due to the German invasion during World War II. Björck, Gear and Söderlind write\n[\n1\n]\n:-\nHarald Bohr\nwas remarkable not only as a mathematician, but also as a very humane and generous person. These are qualities that Dahlquist shared to a high degree.\nBohr\ntook the time to discuss mathematics with his young student and inspired Dahlquist's early interests, which centred on analytic number theory, complex analysis, and analytical mechanics. Dahlquist would later refer to the profound influence on his view of mathematics of that early time with\nBohr\n.\nDahlquist received a first degree from Stockholm University in\n1949\nhaving written a thesis\nOn the Analytic Continuation of Eulerian Products\nwhich he published in\n1952\n. Deciding against continuing to undertake research for his doctorate, he joined the Swedish Board of Computer Machinery as an applied mathematician and programmer. In\n1951\na decision was taken that Sweden should build its own digital computer. Named BESK\n(\nBinary Electronic Sequential Calculator\n)\n, the computer was modelled on the ideas put forward by\nJohn von Neumann\nand\nHerman Goldstine\nin their ideas for the EDVAC\n(\nElectronic Differential Variable Computer\n)\nwhich they produced in the late\n1940\ns. BESK came into operation in December\n1953\nand Dahlquist used the machine to solve differential equations. This led him to a deep study of numerical analysis. He also joined a group using BESK to solve problems relating to weather forecasting. Their methods led to a speeding up of the process of reducing the data and in September\n1954\nthey produced the first\n24\nhour forecast produced on the day in which the input data was collected.\nDuring this time Dahlquist wrote a number of papers such as\nThe Monte Carlo-method\n(1954)\n,\nConvergence and stability for a hyperbolic difference equation with analytic initial-values\n(1954)\n, and\nConvergence and stability in the numerical integration of ordinary differential equations\n(1956)\n. He submitted his doctoral thesis\nStability and error bounds in the numerical integration of ordinary differential equations\nto Stockholm University in\n1958\n, defending it in a viva in December. In the thesis he\n[\n1\n]\n:-\n.... introduced the logarithmic norm\n(\nalso introduced independently by Lozinskii in\n1958)\n, which he used to derive differential inequalities that discriminated between forward and reverse time of integration. Dahlquist was now in a position to derive more realistic error bounds for problems that might not even be well-posed in reverse time. In such cases, the classic\nLipschitz\nconvergence analysis would have failed. Dahlquist was to use this idea throughout his research in stiff differential equations.\nHis thesis advisor was\nFritz Carlson\nbut he also received strong support from\nLars Hörmander\n. The thesis was published in the following year.\nFrom\n1956\nto\n1959\nDahlquist had been head of Mathematical Analysis and Programming Development at the Swedish Board of Computer Machinery. Following the award of his doctorate in\n1959\nhe was appointed to the Royal Institute of Technology in Stockholm. He spent the rest of his career at this institution where the Department of Numerical Analysis, an offshoot the Department of Applied Mathematics, was founded in\n1962\n. In the following year Dahlquist became Sweden's first professorship in Numerical Analysis when he became the professorial head of the Department which at this stage had six members of the academic staff. In the same year of\n1963\nhe published\nStability questions for some numerical methods for ordinary differential equations\n, an expository paper on his fundamental results concerning stability of difference approximations for ordinary differential equations. In the same year he published\nA special stability problem for linear multistep methods\nwhich introduced\nA\nA\nA\n-stability and became one of the most cited papers in numerical analysis. It was published in BIT, a journal which Dahlquist had played a major role in founding in\n1961\n. He served as an editor of BIT for over\n30\nyears.\nIn\n1969\na collaboration with Ake Björck led to the publication of\nNumeriska metoder\n(\nNumerical methods\n)\npublished in Swedish:-\nThis is a substantial, detailed and rigorous textbook of numerical analysis, in which an excellent balance is struck between the theory, on the one hand, and the needs of practitioners\n(\ni.e., the selection of the best methods - for both large-scale and small-scale computing\n)\non the other. The prerequisites are slight\n(\ncalculus and linear algebra and preferably some acquaintance with computer programming\n)\nso that some of the finer theoretical points\n(\nthose at which numerical analysis becomes applied\nfunctional analysis\n, for example\n)\nare outside the scope of the book. However, the class of readers for whom the book is intended are admirably served.\nThe importance of the book is easily seen from the fact that a German translation appeared in\n1972\nunder the title\nNumerische Methoden\n, an English translation was published two years later under the title\nNumerical methods\n, and a Polish translation was published as\nMetody numeryczne\nin\n1983\n. Several later editions and reprints of the various translations of the classic text continued to appear as well as a Chinese translation in\n1990\n.\nThe book\nNumerical Methods in Scientific Computing, Volume\n1\nby Germund Dahlquist and Ake Björck was published in September\n2008\n. Björck writes in the Preface:-\nIn\n1984\nthe authors were invited by Prentice-Hall to prepare a new edition of\n[\nNumerical Methods\n]\n. After some attempts it soon became apparent that, because of the rapid development of the field, one volume would no longer suffice to cover the topics treated in the\n1974\nbook. Thus a large part of the new book would have to be written more or less from scratch. This meant more work than we initially envisaged. Other commitments inevitably interfered, sometimes for years, and the project was delayed. The present volume is the result of several revisions worked out during the past\n10\nyears. Tragically, my mentor, friend, and coauthor Germund Dahlquist died on February\n8\n,\n2005\n, before this first volume was finished. Fortunately the gaps left in his parts of the manuscript were relatively few. Encouraged by his family, I decided to carry on and I have tried to the best of my ability to fill in the missing parts. I hope that I have managed to convey some of his originality and enthusiasm for his subject. It was a great privilege for me to work with him over many years. It is sad that he could never enjoy the fruits of his labour on this book.\nNick Higham, in a review of the book, writes:-\nThis work is a monumental undertaking and represents the most comprehensive textbook survey of numerical analysis to date. It will be an important reference in the field for many years to come.\nIn\n1990\nDahlquist retired from the Royal Institute of Technology in Stockholm, but remained very active in research. As an example let us note the publication of\nOn summation formulas due to Plana, Lindelöf and Abel, and related Gauss-Christoffel rules\nin BIT in three parts\n(1997\n,\n1997\n,\n1999)\n. Dahlquist writes:-\nThree methods, old but not so well known, transform an infinite series into a complex integral over an infinite interval.\nGauss\nquadrature rules are designed for each of them. Various questions concerning their construction and application are studied, theoretically or experimentally. They are so efficient that they should be considered for the development of software for special functions.  Applications are made to slowly convergent alternating and positive series, to\nFourier series\n, to the numerical analytic continuation of power series outside the circle of convergence, and to ill-conditioned power series.\n[\nThe second part\n]\nis mainly concerned with the derivation, analysis and applications of a summation formula, due to\nLindelöf\n, for alternating series and complex power series, including ill-conditioned power series.\nThe authors of\n[\n1\n]\ntell of two other aspects of Dahlquist's life outside of mathematical research, namely his work for Amnesty International and his love of music. Let us quote from their paper the delightful stories they recount regarding these two interests:-\nAs an active member of Amnesty International during the\n1970\ns, Dahlquist worked to help scientists who were politically persecuted, in some cases travelling to offer his encouragement and recognition in person. He used to tell the story of his intervention on behalf of a Russian mathematician who, in despair, had made a thoughtless public statement to the effect that the Soviet Union was \"a land of alcoholics.\" Guriy I Marchuk, who had visited Stockholm University in the\n1960\ns, was then president of the\nUSSR Academy of Sciences\nand vice-chair of the USSR Council of Ministers. Dahlquist wrote to Marchuk pleading the dissident's case. After a long time with no response, two staff members of the Soviet Embassy called at Germund's office one day, bringing greetings from Marchuk and a package, that turned out to contain ... two bottles of vodka!\nNext the story regarding his love of music:-\nGermund had a keen interest in music, mainly classical but also jazz music. He would often happily sit down at the piano and entertain his colleagues with a few old standards, starting with \"On the Sunny Side of the Street\" and ending with \"As Time Goes By.\" But his knowledge went much deeper. On one visit to the USA, with a few colleagues in a fine restaurant, Germund heard a female bar pianist whose music was obviously the highlight of the evening for him. When it was time to leave, Germund told the pianist how much he had enjoyed her stylish playing, adding that it had reminded him of one of his favourites, the great jazz pianist Art Tatum. The pianist was duly flattered, but it was Germund who was surprised when she answered: \"Art Tatum was my father!\"\nDahlquist received many honours for his outstanding contributions. He was elected into the Royal Swedish Academy of Engineering Sciences in\n1965\n. He was a plenary speaker at the International Congress of Mathematicians at Berkeley in\n1986\n. The\nSociety for Industrial and Applied Mathematics\n(\nSIAM\n)\nnamed him their\nJohn von Neumann\nlecturer in\n1988\n. In\n1995\n, on the occasion of his\n70\nth\nbirthday, SIAM established the 'Germund Dahlquist Prize' to be awarded biennially:-\nAwarded to a young scientist\n(\nnormally under\n45)\nfor original contributions to fields associated with Germund Dahlquist, especially the numerical solution of differential equations and numerical methods for scientific computing.\nHe was awarded the Peter Henrici Prize in\n1999\n. The following announcement of the award appeared:-\nYesterday, the Eidgenössische Technische Hochschule Zürich and Society for Industrial and Applied Mathematics presented 'The\n1999\nPeter Henrici Prize' to Germund Dahlquist for his outstanding research and leadership in numerical analysis. He has created the fundamental concepts of stability, A-stability and the nonlinear G-stability for the numerical solution of ordinary differential equations. He succeeded, in an extraordinary way, to relate stability concepts to accuracy and proved the deep results which are nowadays called the first and second Dahlquist barrier. His interests, like Henrici's, are very broad, and he contributed significantly to many parts of numerical analysis. As a human being and scientist, he gives freely of his talent and knowledge to others and remains a model for many generations of scientists to come.\nHe received honorary doctorates from Hamburg University\n(1981)\n, Helsinki University\n(1994)\n, and Linköping University\n(1996)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}