{
  "nome_completo": "Giacomo Albanese",
  "nome_curto": "Giacomo Albanese",
  "ano_nascimento": "1890",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Albanese/",
  "lugar_nascimento": "Geraci Siculo (near Palermo), Italy",
  "lugar_morte": "São Paulo, Brazil",
  "biografia": "Giacomo Albanese\nattended school in Palermo, graduating in\n1909\n. Then he entered the Scuola Normale Superiore in Pisa as a student of mathematics and received his doctorate in\n1913\nhaving the distinction of receiving the 'Ulisse Dini' prize for his doctoral dissertation\nSistemi continui di curve sopra una superficie algebrica\nⓉ\n(\nContinuous systems of curves on an algebraic surface\n)\n. During the time Albanese was studying at the Scola Normale Superiore,\nUlisse Dini\nwas the director of the School, but he also gave lectures on infinitesimal calculus which Albanese attended. Another of his teachers at the School was\nEugenio Bertini\nwho was a leading researcher in\nalgebraic geometry\nand Albanese undertook research for his doctorate under\nBertini\n's supervision. Following the award of his doctorate, Albanese was appointed as\nDini\n's assistant at Pisa. However,\nDini\ndied in\n1918\n, and following his death Albanese became an assistant to\nOnorato Nicoletti\n, an expert in the theory of Hermitian forms who took over\nDini\n's courses on infinitesimal calculus after his death.\nFrom\n1913\nto\n1919\n, as well as his position as assistant, Albanese lectured at the Scuola Normale Superiore in Pisa but he was given leave for military service during the years\n1917\n-\n18\n. Italy had only entered World War I in\n1915\nand at first they fought the Austrians with some victories and some defeats, but in\n1917\nGerman forces joined the Austrian army and the Italian army was pushed back to defensive lines near Venice. With large losses of men, Italy called up all men aged eighteen and over and at this time Albanese was called up for military service. He returned to his position in Pisa at the end of World War I but in\n1919\nhe moved to Padua to become\nFrancesco Severi\n's assistant. Although he was only to serve in this post for a few months it was to have a very significant effect both on the direction of his research and on his research output which increased markedly.\nAlbanese left Padua in the year\n1920\nto take up a professorship in analysis and algebra at the Naval Academy in Livorno which, as happened with Italian chairs, he had won after a competition. Five years later he moved to the University of Catania where he was appointed to the chair of Projective and Descriptive Geometry. Then, in\n1927\n, he returned to Palermo where he spent the next two years. From\n1929\nuntil\n1936\nhe held the chair of geometry at Pisa, a position which he could have continued to occupy for the rest of his life but he was sent to Brazil in\n1936\n.\nAlbanese's research involved examining curves on algebraic surfaces and the genus of an algebraic variety. He considered the problem of resolution of singularities, a major problem in algebraic geometry, and produced some elegant results. He pioneered investigations related to the\nRiemann\n-\nRoch\nproblem and studied the rational equivalence of\n0\n-cycles on surfaces. His name is remembered today for Albanese varieties used as a standard tool in algebraic geometry. Guerraggio writes in\n[\n2\n]\n:-\nSeveri undoubtedly inspired one of\n[\nAlbanese's\n]\nfirst works on algebraic systems of curves on algebraic surfaces, but afterwards Albanese's research turned to the problem of the resolution of the singularities of a surface and to the theory of equivalences of groups of points on a variety\n(\nand, still, to the theory of correspondences\n)\n. One note of his\n[\nTrasformazione birazionale di una algebrica qualunque in un'altra priva di punti multipli\nⓉ\n(\nBirational transformation of any algebra to another without multiple points\n)\n]\nfrom\n1924\npresents a method - extended later to surfaces - to birationally transform a plane curve to a smooth one in the space, without singularities. In other notes from\n1924\n-\n1927\nAlbanese proved sufficient conditions for a surface to be rational; he resolved the problem of the base for the curves on a surface and undertook a general study of the geometry of manifolds. This was in the years in which Albanese became professor of geometry at the University of Catania, going later to Palermo and then to Pisa.\nLet us look briefly at Albanese's paper\nSulle condizioni perchè una algebraica riducible si possa considerare come limite di una curva irreducible\nⓉ\n(\nOn the conditions that a reducible algebraic curve can be considered as the limit of an irreducible curve\n)\n(1928)\n. This paper is studied in depth in\n[\n8\n]\nwhere Nobile writes:-\nIn\n1928\nAlbanese published a beautiful paper, where he presents some very interesting results on families of plane curves. In it, he gives necessary and sufficient conditions in order that a plane curve ... could be a specalization of an integral curve ...\nThe reason Albanese was sent to Brazil in\n1936\nwas as part of the move to establish universities there. The University of São Paulo was founded in\n1934\nand professors were brought there from France, Italy\n(\nbeginning with\nLuigi Fantappiè\n, a pupil of\nVolterra\n, in\n1934)\nand Germany as well as some other European countries. Albanese spent the rest of his life in São Paulo, holding the chair of Analytical, Projective and Descriptive Geometry, except for the year\n1942\nwhen he returned to Pisa because of World War II. Soon after the war ended, Albanese, who was by then back in São Paulo, became closely acquainted with\nAndré Weil\n, who taught there from\n1945\nto\n1947\n. He also became friends with\nOscar Zariski\nwho lectured in São Paulo in\n1945\n. It is Weil who is responsible for the name 'Albanese variety', but Ciliberto and Sernesi\n[\n1\n]\nwrite:-\n... the attribution of this concept to Albanese is dubious ....\nKleiman writes\n[\n7\n]\n:-\nIndeed the basis for this is an article where Albanese studies correspondences between algebraic surfaces through the consideration of the induced action on the space of holomorphic\n1\n-forms.\nCiliberto and Sernesi write in\n[\n1\n]\nthat in São Paulo, Albanese:-\n... created a very good mathematical library, especially rich in books of algebraic geometry.\nA Weil\nand\nO Zariski\ntaught in São Paulo some years later and said that the library was a source of inspiration to both of them.\nFinally we quote from Marcelo Damy, who was a student at São Paulo University in the second half of the\n1930\ns\n[\n3\n]\n:-\nI had the chance to follow the course of ... geometry with Giacomo Albanese. We met a completely different world. In our education as future engineers, we still had the type of lectures so common in most of the Brazilian universities: the professor come in, delivers his lecture, and walks away, without talking with the students and often teaching from an obsolete book. ... It was a surprise for us when we attended\n[\nAlbanese's\n]\nlectures that followed a completely different approach, that showed us these sciences were not only alive but going through such intense change that the amount of research published in the last few years had been greater than the amount since the beginning of these sciences. ... We also came in touch with something that was totally unknown in Brazil - the seminars. Each week the Italians ... would get together to present their research or the main lines of fundamental research being developed abroad. For us - young students used to listening without questioning - it was strange to hear a professor raise questions about and strongly criticize the work of a colleague.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}