{
  "nome_completo": "Giovanni Domenico Cassini",
  "nome_curto": "Giovanni Cassini",
  "ano_nascimento": "1625",
  "ano_morte": "1712",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cassini/",
  "lugar_nascimento": "Perinaldo, Republic of Genoa (now Italy)",
  "lugar_morte": "Paris, France",
  "biografia": "The first thing we should clarify in this biography is\nGiovanni Cassini\n's name. He was given the name Giovanni Domenico by his parents, Jacopo Cassini and Julia Crovesi, after his birth in Italy. However he also used the name Gian Domenico Cassini, and after he moved to France, he changed his name to the French version of Jean-Dominique Cassini. To add just one more comment to the question of his name, he was the first of the famous Cassini family of astronomers and as such is often known as Cassini I.\nWe know little of his parents but certainly his father was a Tuscan. In fact Giovanni was brought up, not by his parents but by an uncle, a brother of his mother Julia Crovesi. After spending two years being educated at Vallebone, Cassini entered the Jesuit College at Genoa where he studied under Casselli. After this he studied at the abbey of San Fructuoso. Taton writes\n[\n1\n]\n:-\nHe showed great intellectual curiosity and was especially interested in poetry, mathematics and astronomy.\nHis first interest, however, was in astrology rather than astronomy. He read widely on this topic and soon was very knowledgeable, yet was convinced that there was no truth in astrological predictions. It was, rather strangely, his extensive knowledge of astrology that led to his first appointment. In\n1644\nthe Marquis Cornelio Malvasia, who was a senator from Bologna with a great interest in astrology, invited Cassini to Bologna. He offered him a position in the Panzano Observatory which he was constructing at that time.\nFrom\n1648\nCassini observed at the Panzano Observatory with instruments which he had purchased with financial resources from the Marquis Malvasia. This was an important time for Cassini who learnt much from the outstanding Jesuit scientists Giovanni Battista Riccioli and Francesco Maria Grimaldi\n(\nwho later discovered diffraction\n)\n. In\n1650\n, Cassini became professor of mathematics and astronomy at the University of Bologna, filling the chair which had been vacant since the death of\nCavalieri\nat the end of November\n1647\n. This appointment came about through the support of the Marquis Malvasia whose important position in Bologna gave him considerable influence in naming\nCavalieri\n's successor.\nCassini observed a comet in\n1652\n-\n3\nand he published an account of his observations which he dedicated to the Duke of Modena. From the work we can see that at this time Cassini believed in an Earth centred solar system, with comets beyond Saturn but originating from the Earth. Observations would lead him to accept the model of the solar system proposed by\nTycho Brahe\nand, in\n1659\n, he presented an Earth centred system with the moon and sun orbiting the Earth and the other planets orbiting the sun. Later he came to accept a version of the Copernican model.\nOne of Cassini's predecessor's as professor of mathematics and astronomy at Bologna had been\nEgnatio Danti\nwho had been appointed in\n1576\n.\nDanti\nhad built a gnomon at the Church of San Petronio in Bologna, one of the largest Christian churches ever built. A small hole allowed the rays of the sun to enter the church. They formed a small image on a scale on the floor which allowed the position of the sun to be accurately determined. The church of San Petronio had mostly been built between\n1445\nand\n1525\n, but work continued on extending it and not long before Cassini arrived in Bologna further building work had made\nDanti\n's gnomon unusable\n[\n1\n]\n:-\nIn\n1653\n, Cassini, wishing to employ such an instrument, sketched a plan for a new and larger\n[\ngnomon\n]\nbut one which would be difficult to build. His calculations were precise; the construction succeeded perfectly; and its success made Cassini a brilliant reputation.\nHe made many important observations with his new gnomon which he published in\nSpecimen observationum Bononiensium\n...\nⓉ\n(\nSome observations made at Bologna ...\n)\n(1656)\n, a work he dedicated to Queen Christina of Sweden who was in exile in Italy at this time.\nHis expertise, however, covered many areas other than astronomy. He was an expert in hydraulics and engineering and as such was consulted regarding the dispute of\n1657\nbetween Bologna and Ferrara on the course of the River Reno. The dispute was settled by Pope Alexander VII with advice from Cassini and for several years after this he was regularly consulted by the Papal Court as an expert on river management. He wrote treatises on this aspect of his work, in particular on the flooding of the river Po. He was also employed by the Pope in\n1663\nas superintendent of fortifications, then he travelled to Rome again in\n1665\nwhen he was named Superintendent of the waters of the ecclesiastical states.\nThe Pope asked Cassini to take Holy Orders for he wished to see him permanently working for him. However, Cassini preferred to keep his post as professor of mathematics and astronomy at Bologna where he taught when not undertaking Papal duties. He continued with his research in astronomy, proposing a model for atmospheric refraction which turned out to be incorrect, making an intensive study of the sun, publishing tables in\n1662\n, and continuing to search for comets. In\n1664\nhe observed a comet which led him to propose a new theory that comets travelled in circular orbits around the sun with the centre of the orbit in the direction of the star Sirius.\nBeginning in\n1664\nCassini was able to observe with new powerful telescopes made by the excellent lens maker Giuseppe Campani of Rome. With these instruments Cassini made a series of new discoveries. In July\n1664\nhe measured the period of rotation of Jupiter on its axis, discovered the bands and spots on the planet, and saw that the planet was flattened at its poles. In\n1666\nhe measured the period of rotation of Mars on its axis, getting a value within three minutes of the correct one, and observed surface features. He published detailed series of observations of the moons of Jupiter in\n1668\n. Cassini discovered discrepancies in his data which at first he attributed to light having a finite speed:-\n... light takes some time to come from the satellite to us; and it takes approximately ten or eleven minutes to traverse a distance equal to the semi-diameter of the Earth's orbit.\nHowever, Cassini was too traditional in his views to accept his own idea, and he soon rejected it and looked for other explanation for the discrepancy. It is rather ironical that it was Cassini's data that was used by Rømer in calculating the speed of light seven years later.\nCassini's brilliant discoveries gave him an international reputation and led to him being invited to Paris by Louis XIV in\n1668\n. The construction of the Paris Observatory had just begun and Cassini was offered a generous salary, free accommodation, and a good travel allowance to oversee the project. The senate of Bologna and Pope Clement IX agreed to the trip which they believed would be a short one of at most two years. However Cassini was immediately involved in the work of the\nAcadémie des Sciences\nalthough at this stage he made little attempt to settle down and improve his French as he still fully intended a quick return to his duties in Italy. After he became head of the Paris Observatory in\n1671\n, he soon changed his views on returning to Italy and became a French citizen two years later, changing his name to Jean-Dominique Cassini. In\n1674\nhe married Geneviève de Laistre who was the daughter of the lieutenant general of the compté of Clermont. On their marriage Geneviève brought with her a dowry which included the Château de Thury in the Oise which became the Cassini summer residence for succeeding generations of the family. There were two sons from this marriage, the younger one\nJacques Cassini\nbeing born in\n1677\nand eventually succeeding to his father's position as head of the Paris Observatory.\nAt the Paris Observatory Cassini continued to make revolutionary discoveries, as he had done in Italy, using a telescope he had brought with him. He was the first to observe four of Saturn's moons: Iapetus\n(1671)\n, Rhea\n(1672)\n, Tethys\n(1684)\n, and Dione\n(1684)\n. He discovered the gap in the ring system of Saturn now known as the Cassini division in\n1675\n. Impressively he correctly proposed that the rings were composed of large numbers of tiny satellites each orbiting the planet. He drew a large Chart of the Moon, which he presented to the\nAcadémie des Sciences\nin\n1679\n. This remained the best that was available prior to the invention of photography for astronomical purposes.\nCassini's tables of Jupiter's moons were used to determine longitudes by providing a universal time with which to compare the local time at various positions on the Earth. While French expeditions measured the longitudes of numerous places, Cassini remained in Paris coordinating their data and making his own measurements. In\n1672\nJean Richer\nmade measurements of Mars from Cayenne, French Guyana, while\nJean Picard\nand Cassini made measurements in Paris. From their data the first accurate value of the solar parallax was found, giving the distance from the Earth to the sun. Another measurement made by\nJean Richer\n, namely that a pendulum with a period of one second is shorter in Cayenne than Paris, led him to explain this by suggesting that the Earth was flattened at the poles. This supported theoretical proposals by\nNewton\nand\nHuygens\n, but Cassini did not accept\nJean Richer\n's explanation. He sought another experiment to determine whether the Earth was a perfect sphere.\nIn order to determine the shape of the Earth, Cassini proposed measuring an arc of the meridian from the north of France to the south. The project was begun in\n1683\nwith Cassini making measurements from Paris towards the south, while\nPhilippe de La Hire\nbegan making measurements north from Paris. The project was cancelled for financial reasons in\n1684\nwhen Cassini had reached Bourges, which is almost exactly in the centre of France.\nIn\n1695\nCassini travelled in Italy. He took his eighteen year old son\nJacques Cassini\nwith him and they made numerous geodesic observations, as well as returning to Bologna where they repaired the gnomon at the Church of San Petronio in Bologna which Cassini had designed nearly thirty years before. In\n1700\nthe meridian project was revived and now, in addition to a number of other scientists, Cassini had his son\nJacques\nto assist him. They made measurements of the meridian from Paris to Perpignan, which is\n13\nkm west of the Mediterranean coast. He obtained results which wrongly suggested that the Earth was elongated at the poles. As someone who rejected\nNewton\n's theory of gravitation, this result was rather pleasing since\nNewton\n's theory led him to a theoretical proof that the Earth would be flattened at the poles. However, having observed the flattening of Jupiter at its poles, it is surprising that he should have been such a strong advocate of the elongation of the Earth.\nIn\n1680\nhe studied the Cassinian curve which is the\nlocus\nof a point the product of whose distances from two fixed foci is constant. He worked on this as part of a study of the relative motions of the Earth and the sun and proposed this as the curve for planetary orbits rather than the ellipse as proposed by Kepler. The lemniscate of\nJacob Bernoulli\nis a member of the Cassinian curves but this was not realised for\n100\nyears.\nFrom around\n1709\nJacques Cassini\ngradually took over his father's duties as head of the Paris Observatory. Cassini's health began to deteriorate, in particular his eyesight became poor so that by\n1711\nhe was nearly completely blind. Fontenelle\n[\n4\n]\nsays that Cassini's calm and gentle character, coming from a deeply religious belief, allowed him to bear nearly total blindness with good cheer.\nTaton gives this assessment of Cassini in\n[\n1\n]\n:-\nJudgements on Cassini's work vary greatly. While many historians, following\nDelambre\n, accuse him of having found his best ideas in the writings of his predecessors and of having oriented French astronomy in an authoritarian and retrograde direction, others insist on the importance of his work as observer and organiser of the research at the Observatory. Although Cassini's control did restrict the Observatory's studies and although he did fight against most of the new theories, his behaviour does not seem as uniformly tyrannical and baleful as\nDelambre\ndescribed it. He was not a theoretician; he was, however, a gifted observer and his indisputable discoveries are sufficient to win him a high position among the astronomers of the pre-Newtonian generation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}