{
  "nome_completo": "Giuseppe Bruno",
  "nome_curto": "Giuseppe Bruno",
  "ano_nascimento": "1828",
  "ano_morte": "1893",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bruno/",
  "lugar_nascimento": "Mondovi (now Italy)",
  "lugar_morte": "Turin, Italy",
  "biografia": "Giuseppe Bruno\n's parents were poor but he won a free place to the Collegio Carlo Alberto where he began university study. He entered the University of Turin in\n1843\n, graduating with a philosophy degree three years later.\nAfter teaching at the Collegio Carlo Alberto during\n1846\n-\n47\nhe moved to Ceva where he taught philosophy, then he returned to Turin. In Turin he taught mathematics at the Collegio Nazionale from\n1850\nas well as tutoring privately.\nIn\n1850\nBruno received a degree in hydraulic engineering and, the following year, he received his doctorate in mathematics. He began acting as a substitute at the University of Turin, teaching where it proved necessary. From\n1852\nto\n1858\nhe taught algebra and geometry, while from\n1860\nto\n1862\nhe taught differential and integral calculus.\nBruno gave up his teaching post at the Collegio Nazionale in\n1861\n, having accepted a post at the Technical Institute the previous year. In\n1863\nhe taught descriptive geometry at the University and, in\n1863\n, he became Professor of Descriptive Geometry.\nHis title was changed to Professor of\nProjective Geometry\nwith Design in\n1875\nand in\n1881\nhe became Chairman of the Faculty of Science. One of Bruno's students,\nCorrado Segre\n, became his assistant in the mid\n1880\ns.\nAll Bruno's publications deal with research into geometry. He only wrote\n21\npapers, having devoted much of his time and energy to teaching. His lifestyle is described in\n[\n1\n]\n:-\n... Bruno had few friends and almost never left the circle of his family. Bruno was a man of duty, playing for his family, servants, and students the role of benevolent despot. But in the classroom he was an excellent teacher, both because of the clarity of his lectures and the enthusiasm for which he gave them.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}