{
  "nome_completo": "Gloria Conyers Hewitt",
  "nome_curto": "Gloria Hewitt",
  "ano_nascimento": "1935",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hewitt/",
  "lugar_nascimento": "Sumter, South Carolina, USA",
  "lugar_morte": null,
  "biografia": "Gloria Hewitt\nwas given the name Gloria Conyers, and only became Gloria Hewitt after her marriage. However, for simplicity we will refer to her as Gloria Hewitt throughout this biography. Her parents were Emmett C Conyers\n(1895\n-\n1968)\nand Crenella Clinkscales\n(1898\n-\n1972)\n. Talking of her parents in an interview\n(\nsee for example\n[\n3\n]\n)\n, she said:-\nMy dad was a printer, an occupation which paid very little money, but one he could perform with dignity and one that allowed him to be his own boss. My mother made an honest living, but very little money, as an elementary school teacher in Sumter, South Carolina.\nHer mother Crenella had been born in Levelland, close to Sumter, and had moved to Sumter to attend the Baptist Morris College. Her father Emmett had been born in Manning but had also attended Morris College in Sumter where he studied education and, after a short time as a teacher, became a printer working for Morris College. Emmett and Crenella Conyers had four children, Emmett Jr\n(\nborn\n2\nMay\n1927\n, died\n13\nNovember\n2013)\n, Joseph\n(\nborn\n1930)\n, James E Conyers\n(\nborn\n6\nMarch\n1932)\nand Gloria\n(\nthe subject of this biography\n)\n. She said\n[\n3\n]\n:-\nMy parents believed that education was the only avenue through which an African American man or woman could better them selves. Therefore, they encouraged all of their children to attend college. While we were not wealthy, by the standards around us, I always thought we were middle class. I was proud of the fact that my parents could vote in the presidential election. Not everyone could in those days.\nIn fact Gloria was taught at home for the first year of her schooling by her mother, who was of course a teacher, but from the second grade she attended Moore Elementary School. To attend this school she had to walk over two miles there and two miles back again each day. She hated this school and, when asked about her experiences of mathematics there, she remembered two things\n[\n3\n]\n:-\nI had not done my homework. The teacher called on me to recite, but I could not do the problems. I was called up to the front of the room and paddled in the hand for what seemed forever. In those days, in the African American community, it was permissible to spank other people's children. I never forgot that incident; I also never forgot to do my arithmetic home work after that.\nAs arithmetic extended to the study of fractions, I discovered I could use the solutions to the problems as barter with the biggest girls in the school, and in exchange no one bothered me. It was a good thing I liked working with fractions!\nAfter graduating from\n7\nth grade at Moore Elementary School, Gloria attended the local High School for one year before entering Mather Academy in Camden. This co-educational school for black pupils was a boarding school and Gloria's parents had to pay for her education there. This must have put an enormous strain on the family finances but her parents were prepared to make sacrifices to let Gloria have a good quality education. At this stage in her education Gloria told people that she wanted to be a nurse. This was not because she particularly wanted to be a nurse, it was more because she knew that medicine was not an option open to African Americans. At this time an African American woman who wanted a professional job was pretty much limited to becoming a teacher. In\n1952\nshe entered Fisk University, Nashville, which had been established in\n1866\nto educate African American students, primarily as a teacher training establishment. This university had, in\n1930\n, become the first African-American institution to he accredited by the Southern Association of Colleges and Schools. Similarly, it had been the first African-American institution to be approved by the Association of American Universities\n(1933)\nand the American Association of University Women\n(1948)\n.\nHewitt was fortunate that the head of mathematics at Fisk was\nLee Lorch\n. He had begun teaching at Fisk in\n1950\nand, after one year as Acting Head of Mathematics, he became Head of Mathematics. Hewitt had performed poorly in the entrance examinations, she never understood why that was the case, and as a result she was put in a low level mathematics class. This she found boring and gaining an \"A\" was no challenge at all. It was\nLee Lorch\nwho rescued her when he asked her if she was going to take the calculus class in her second year. Hewitt had never heard of calculus but she followed the advice of her head of department and enrolled for calculus in her second year. In an interview she explained the impact this class had on her\n[\n4\n]\n:-\nI remember when I took calculus in college the only book I took home over the Christmas holidays was my calculus book. I wanted to do those word problems. I worked on one problem for the whole two weeks before I solved it. It wasn't that hard, but I just didn't understand the process involved. When the light dawned, I was so happy! I don't believe I ever felt so rewarded. It was a major breakthrough. I was hooked. After that, to the amazement of my fellow students, I recall sitting on campus doing calculus problems for recreation\nOn\n28\nMay\n1954\n, Gloria Conyers married Ronald Hewitt in Williamson, Tennessee. On her marriage certificate her age is given as\n21\n, but she was only\n18\nyears old. Gloria Hewitt had a son and Randy Lattimore writes\n[\n3\n]\n:-\nHer parents were crushed. Their dream of educating all their children did not seem to be coming true for their youngest child and only daughter. Her father, who was no longer able to work, agreed to care for her child; and with the help of her parents, she returned to school. Finally, she had to choose a major and prepare for a career. She decided to be a high school mathematics teacher. So she took cookbook-type mathematics courses, methods courses in teaching mathematics, and educational courses.\nHewitt was able to return to her undergraduate studies at Fisk University and she graduated with a B.A. in mathematics in\n1956\n. She was divorced in the year she graduated. Her last years of study had been undertaken without having\nLee Lorch\nas a professor since he had been dismissed from his position at Fisk University in\n1955\n. The reasons are complicated but essentially he was dismissed because he believed in equal opportunities for African Americans. Hewitt's undergraduate degree had been aimed at making her a high school mathematics teacher but once she had been awarded the degree she knew that this was not the right career for her. She had never considered undertaking research in mathematics and was amazed to be offered a teaching assistantship to attend graduate school in mathematics at the University of Washington at Seattle. In fact this offer had been made to her because of\nLee Lorch\n's recommendation and, until she received the offer, she had known nothing about his efforts on her behalf despite meeting him at Fisk just before she graduated when he told her that she should consider graduate school. She said\n[\n2\n]\n:-\n... the thought of entering graduate school in mathematics never crossed my mind. I never knew it crossed\n[\nLorch\n's mind\n]\nuntil I heard of his recommendation.\nLorch\nhad not only recommended her to the University of Washington at Seattle but also to the University of Oregon and she also received an offer from them. After much thought, she chose the University of Washington but it was still a great worry to her that she did not have a good enough mathematical background, her undergraduate courses being more aimed at mathematical education rather than higher mathematical topics. She said in an interview\n[\n1\n]\n:-\nSome of my fellow graduate students did all they could to help and encourage me. They included me in most of their activities. I know this situation was not the norm for a lot of Blacks studying mathematics, but I was fortunate enough to be at the right place at the right time.\nHewitt had always enjoyed sport and this helped her greatly at the University of Washington. On the academic side she was strongly encouraged by Edwin Hewitt\n(1920\n-\n1999)\n. Edwin Hewitt had been awarded a Ph.D. from Harvard University in\n1942\nand had served on the faculty at the University of Washington from\n1954\n. Edwin Hewitt encouraged her to aim at a Ph.D. and Richard Scott Pierce\n(1927\n-\n1992)\nbecame her advisor. Richard Pierce was educated at the California Institute of Technology, where he received his B.S. in\n1950\nand his Ph.D. in\n1952\n. After fellowships at Yale and Harvard, he was on the faculty of the University of Washington from\n1955\nto\n1970\n. With her weak mathematical background, Hewitt found it hard going and at times considered giving up. One of the things which kept her going was the fact that her parents were looking after her young son and she said she kept going:-\n... because of the sacrifices my mother was making.\nShe was awarded a Master's Degree in\n1960\nand, in\n1961\n, she was appointed as an Assistant Professor of Mathematics at the University of Montana at Missoula. In fact this was a position which she had not applied for since, when she received the offer, she was still undertaking research for her doctorate. It was Arthur E Livingston who offered her the job. After teaching mathematics for seven years at the University of Washington, Livingston had been named chairman of the Montana State University Mathematics Department in\n1960\n. When she was first offered the position, Hewitt turned it down. However, some time later Livingston made a second offer to Hewitt and, after persuasion from Edwin Hewitt, she accepted and took up the position in\n1961\n. Now she was able to look after her young son so he joined her in Missoula. She completed the work for her doctorate at the University of Montana at Missoula and was awarded a Ph.D. from the University of Washington for her thesis\nDirect and Inverse Limits of Abstract Algebras\nin\n1962\n.\nIn\n1963\nHewitt published\nThe existence of free unions in classes of abstract algebras\nin the\nProceedings\nof the\nAmerican Mathematical Society\n. She attached a note which read:-\nThe author is indebted to Professor R S Pierce for his valuable suggestions during the preparation of this paper.\nIn\n1967\nshe published the paper\nLimits in certain classes of abstract algebras\nwhich was part of her Ph.D. thesis. Her Abstract is as follows:-\nThis paper is a part of the author's doctoral dissertation submitted to the University of Washington. This paper is primarily concerned with the existence of direct limits in certain classes of Boolean algebras. The concepts of inverse and direct limits are defined relative to a class A of abstract algebras. It is assumed that the algebras in A are of the same type. It is found that classes which are closed under such constructions as the formation of homomorphic images, subalgebras, free products and free unions do admit direct and inverse limits. In fact, the existence of direct limits is closely related to the existence of free products and dually, the existence of inverse limits is related to the existence of free unions. Also there is a relationship between the existence of inverse limits and direct limits.\nIn\n1966\nHewitt was awarded a National Science Foundation postdoctoral fellowship which enabled her to spend a year at the University of Oregon.\nAt the second session of the\nMathematical Association of America\nheld in\n1971\nthere was a discussion on \"Women in Mathematics\" to which Hewitt contributed. The following report is from the\nAmerican Mathematical Monthly\nof November\n1971\n:-\nProfessor Hewitt stated that no one can deny the existence of discriminatory practices against women in mathematics. Too often in making decisions to hire women, marital status, family responsibilities, family size, and such are influential factors. Nepotism rules are invoked, or invented, to justify marginal appointments without fringe benefits or for rejecting the applicant, whereas it should only be assumed that the applicant will desire regular, full-time, permanent employment unless there is clear evidence to the contrary. Recommendations accompanying applications for women often support the myth that women are a poor risk. There are those which declare that the applicant is one of the best students he has ever had, truly exceptional - for a woman she should excel in mathematics. For men and women of equivalent standing, there are too often large discrepancies in salaries, fringe benefits, departmental duties, appointments to key departmental committees. Promotions are much slower for women than for men. The criteria should be the same.\nIn\n1979\nshe published\nThe status of women in mathematics\nin the\nAnnals\nof the\nNew York Academy of Science\n. You can read an extract from her paper at\nTHIS LINK\n.\nAlthough Hewitt regretted not having enough time to undertake research projects at the University of Montana, nevertheless she wrote two reports, namely\nA one model approach to group theory\n(1978)\nand\nEmmy Noether's notions of finiteness conditions - revisited\n(1979)\nwhich both appeared as University of Montana Reports. She published\nOn N-noetherian conditions\nin the\nNotices\nof the\nAmerican Mathematical Society\nin\n1979\nand, ten years later the paper\nCharacterizations of generalized Noetherian rings\nwritten jointly with Francis T Hannick.\nHewitt retired from the University of Montana in May\n1999\nand was given the title of Professor Emeritus. The Board of Regents of the Montana University passed a resolution which stated\n[\n5\n]\n:-\nTHAT:\nGloria Hewitt, Professor in the Department of Mathematical Sciences, in her\n38\nyears of dedicated service to The University of Montana, has merited the commendation of the Board of Regents of the Montana University System, and has earned the title of Professor Emeritus.\nEXPLANATION:\nGloria Hewitt was hired as an Assistant Professor in the Department of Mathematics in Fall\n1961\n. She was born and raised in Summer, South Carolina, and received her B.A. from Fisk University in Nashville, Tennessee. She received her M.S.\n(1960)\nand Ph.D.\n(1962)\ndegrees from the University of Washington, becoming the third\n[\nnote: now known to be fourth\n]\nblack woman in the U.S. to receive a Ph.D. in mathematics. She has been a demanding and inspirational teacher during her\n38\nyears at the University, has supervised one Ph.D. and numerous Masters students, and has been a mentor to many undergraduate students. Professor Hewitt has served on numerous national committees and panels for various professional organizations and agencies including the\nMathematical Association of America\n, the National Science Foundation, the National Security Agency and the National Academy of Sciences. She served as Chair of the Department of Mathematical Sciences from\n1995\nto\n1999\n. During this time she increased the visibility of the department, raised over $\n500\n,\n000\nin gifts to endow innovative new programs to support undergraduate and graduate mathematics students, and oversaw renovations to modernize the Mathematics building. Professor Hewitt was recently recognized for her work with the\n1999\nUM Academic Administrator award. She is also profiled in the\n1998\nbook, 'Women in Mathematics'.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Number Theory"
  ]
}