{
  "nome_completo": "Mauro Graciano Ricalde Gamboa",
  "nome_curto": "Graciano Ricalde",
  "ano_nascimento": "1873",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ricalde/",
  "lugar_nascimento": "Hoctún, Yucatan, Mexico",
  "lugar_morte": "Mérida, Mexico",
  "biografia": "Graciano Ricalde\nwas the son of Ambrosio Benito Ricalde Moguel\n(1840\n-\n1928)\n, Municipal Treasurer of Hoctún, and María Ysidra Gamboa Gamboa\n(\nborn\n1841)\n. It was a farming family employing a few workers to help work their small piece of land. There were seven children in the family, with Graciano being the fifth: María Jesus Ricalde Gamboa\n(\nborn\n1865)\n; Manuel Faustino Ricalde Gamboa\n(\nborn\n1868)\n; Maria Asumción Ricalde Gamboa\n(\nborn\n1869)\n; Manuel Ismael Ricalde Gamboa\n(\nborn\n1872)\n; Mauro Graciano Ricalde Gamboa\n(\nborn\n1873\n, the subject of this biography\n)\n; María Yrinea Ricalde Gamboa\n(\nborn\n1875)\n; and Marcelo Antonio Ricalde Gamboa\n(\nborn\n1882)\n. Graciano was often known as Chano, the short form of his name.\nIn\n1878\n, when Graciano\nwas four years old, the family moved from Hoctún to Hocabá which is only six km south west of Hoctún. Although he was only four years old, Graciano began to attend at an elementary school in Hocabá. His older brother Manuel also began studying at the elementary school at the same time and accompanied the young Graciano. It does not sound strange to us today that someone would begin their education at the age of four but in Mexico at this time it was very unusual. The story that is told is that Graciano left his home one morning without permission and went to the school and asked the head teacher for permission to study letters and numbers there. The head of the elementary school was Alberto Echevarría and he interviewed Graciano and must have realised that this was a bright child since he admitted him at the age of four.\nGraciano's parents were not well off financially and, although the boy was keen to learn, they were not able to offer him encouragement. The school only educated children for three years so, to continue his education, he went back to Hoctún, the town of his birth, and attended the public school there run by Diego S Ricalde who was a relation. After studying at this school, he went to Mérida to study at the Normal School for State Teachers, which he entered in September\n1885\n, three years after the school had been founded. There are two points worth noting here. The first is that the Normal School took in pupils who were at least fourteen years old but Graciano was still a couple of months away from being twelve. He must have either lied about his age, or he received special permission. The second point is that he began his studies by going straight into the second level class. This would suggest that he had studied on his own in addition to his school studies in Hoctún and had covered the work of the first year class. Graciano's parents would not have been able to support his studies at the Normal School but he was awarded a scholarship from the State Government which they awarded to bright students from the State who otherwise could not afford to continue studying.\nAt the Normal School Ricalde was taught Reasoned Arithmetic by José Novelo who was very impressed both by his young student's abilities and also by his dedication to studying. The director of the Normal School at this time was Manuel Sales Cepeda\n(1854\n-\n1924)\n. Cepeda had studied at the Literary Institute and became the professor of mathematics and philosophy there. He had founded the Normal School for State Teachers which had opened on\n15\nJanuary\n1882\nwith Cepeda as its first director. It was Cepeda who first introduced Ricalde to the study of mathematics. Up until that time he had only studied arithmetic. Ricalde became passionate about his mathematical studies and Cepeda was able to give him advice and encouragement.\nRicalde's time at the Normal School for State Teachers was made difficult because of contracting typhoid which forced him to be absent from the school for three or four months. He spent four years studying at the Normal School and graduated in July\n1889\n. The minimum age for a student to graduate was eighteen and Ricalde was only fifteen when he graduated. This was possible since he had shown himself to be an outstanding student and so had been given special permission from the State Congress to sit the examinations for graduating. To continue his interest in mathematics, it appears that he tried to enter the State Engineering School in order to study engineering. He was refused entry, almost certainly because of his age. It is unclear what he did over the following years, but in\n1895\nhe entered the Literary Institute where Manuel Sales Cepeda was the professor of mathematics and philosophy.\nWhile studying at the Literary Institute, Ricalde had the opportunity to show his mathematical abilities. One of the towers of Mérida cathedral was unsafe and there were worries that the people could be in danger. The tower had a large bell at the top which was showing cracks and the city leaders wanted to know if a repair could be done without bringing the bell down to ground level. They decided, if in doubt, ask a mathematician and they requested help from Cepeda, the professor of mathematics. Cepeda in turn asked his outstanding student Ricalde if he would carry out the necessary calculations to determine the weight of the bell. He made accurate calculations and his skill now became apparent not only to those who taught him but also to city leaders. The authors of\n[\n12\n]\nwrite:-\nRicalde's mathematical talent was noticed very early, and one of the anecdotes tells us that at the end of the last century the authorities and the population of the city of Mérida were concerned about the unsafe situation of one of the towers of the Cathedral. An attempt was made to weigh the great bell that was in the upper part of that tower without lowering it, since being cracked it constituted a great danger for the public, and it was necessary to know if it was possible to make repairs without changing the location of said bell. The teacher Manuel Sales Cepeda, then director of the Literary Institute, was entrusted with this challenge, and he chose Graciano to carry out the calculations and deduce the exact weight of the bell, which he did with complete accuracy.\nRicalde began to build a library of advanced mathematics texts as well as volumes of the journal\nL'Intermédiaire des Mathématiciens\nⓉ\n(\nIntermediate Mathematics\n)\nwhich had been established in January\n1894\nby\nÉmile Lemoine\nand Charles-Ange Laisant. From Volume\n2\n,\n1895\n, Ricalde was submitting questions to the journal and submitting solutions to questions posed by others. The questions he posed are related to equations, sequences and number theory. For example, in Volume\n3\n,\n1896\n, he asks the question:-\nI would be interested in knowing if the number\n189\n431\n482\n030\n921\nis prime or composite. Could a correspondent provide me with this information?\nA reply from\nHenri Brocard\n(\nand several others\n)\nin a later part of the same volume says this number is actually divisible by\n13\n. Ricalde responds, in another later part of the same volume, that he knew this but wanted a complete decomposition. He says that he has now found\n189\n431\n482\n030\n921\n=\n13\n×\n14\n447\n591\n×\n1\n008\n587\nbut does not know if the last two numbers are prime. Now, in the\n21\nst century, answering such questions is easy:\n14\n447\n591\n=\n2\n267\n×\n6\n373\nwhile\n1\n008\n587\nis prime. We also learn, from what Ricalde writes in one of the problems in Volume\n5\n(1898)\n, that he has been reading\nTraité de Mécanique rationnelle Volume\n2\nDynamique des systémes - Mécanique analytique\nⓉ\n(\nTreatise on Rational Mechanics Volume\n2\n: Dynamics of systems - Analytical mechanics\n)\n(1896)\nby\nPaul Appell\n. In Volume\n8\n(1901)\nRicalde gives a solution to a special case of\nPell\n's equation.\nFor information about the journal\nL'Intermédiaire des Mathématiciens\nand several further examples of the questions that Ricalde sent to it, see\nTHIS LINK\n.\nPerhaps Ricalde's greatest achievement was the solution of quintic equations using elliptic functions. This allowed him to produce, in a simple way, numerical solutions of quintic equations. He published his method in the Volume\n11\nof the\nAnnales de l'Académie des Sciences\nin\n1901\n. The authors of\n[\n12\n]\nwrite:-\nSince it has not been possible to recover Graciano's writing, we will copy and put together what was explained in the review by Mattínez Becerril: \"Ricalde, independently of the works of others, arrives at the elliptical resolution of the quintic equation by first reducing the equation to a trinomial form by suitable artifices, having noticed that in a third degree equation without the quadratic term it was sufficient to substitute one of the coefficients by the sine of an auxiliary angle so that the roots split into three functions. By analogy, he found that to reduce a quintic equation to the aforementioned form requires other transcendental functions, the elliptic ones, to make this separation, a very simple idea but brilliant at the same time. By means of these functions he derived the roots of quintic equations in an explicit form which in turn provides a very practical means of solving quintic equations numerically. This Ricalde method requires the invariant and covariant algebraic elements of the fifth degree forms.\nThis procedure, inspired by that of\nHermite\n, surpasses it for its simplicity and ease of application ... and so there appears in the 'Annales de l'Académie des Sciences', volume\n11\nof\n1901\n, an application of this procedure to the calculation of the approximate value of a root of the equation:\nx\n5\n−\nx\n−\n0.53499\n=\n0\nx^{5} - x - 0.53499 = 0\nx\n5\n−\nx\n−\n0\n.\n5\n3\n4\n9\n9\n=\n0\nin which the author shows the goodness and advantages of his method.\"\nDespite his enthusiastic study of mathematics, Ricalde qualified as an accountant and quickly became well known for his accounting skills. For example, when two heads of the Commerce Section of the General Treasury of the State were accused of embezzlement, Ricalde was one of two accounting experts assigned to inspect and report on the accounts. Their report, which cleared the two heads of criminal activity, was published on\n6\nApril\n1902\n. Also in\n1902\nRicalde was appointed as director of the School of Engineering by the governor of Yucatán, Olegario Molina Solís\n(1843\n-\n1925)\n. Molina Solís had become an engineer in the\n1870\ns, and was a partner in the first railway built in Yucatán. He was keen to modernise Mexican society and had many schools built. When he became the governor of Yucatán in\n1902\n, he appointed Ricalde, whose reputation by this time as the leading scholar of Yucatán was widely understood, to direct the School of Engineering.\nOn\n29\nDecember\n1902\nRicalde married the school teacher María Felicitas del Carmen Manzanilla y Manzanilla\n(1881\n-\n1954)\n. She had been born in Mérida on\n21\nFebruary\n1881\nto local merchants Francisco Gregorio Manzanilla Rivas\n(1837\n-\n1896)\nand Andrea Manzanilla Canto\n(1854\n-\n1929)\n. Ricalde and his wife had four children: Alfonso Ricalde Manzanilla\n(1904\n-\n1969)\n; José Humberto Ricalde Manzanilla\n(\nborn\n1906)\n; Enrique Ricalde Manzanilla\n(1908\n-\n1977)\n; and Ofelia Ricalde Manzanilla\n(1908\n-\n1977)\n. Let us note that although Enrique and Ofelia were both born in\n1908\n, they were not twins. Enrique was born on\n8\nJanuary while Ofelia was born on\n3\nDecember. Ricalde taught his children mathematics and they all became accountants.\nRicalde only held the position of director of the School of Engineering until\n1905\nwhen he resigned so that he could devote more time to mathematics. Ricalde and his brother Antonio Ricalde Gambo were both interested in astronomy. With the prediction that\nHalley\n's comet would be visible in\n1909\n-\n10\nthere was much fear among the people of Mexico generated in part by press coverage. Ricalde, and others with scientific skills, tried to explain to people what comets were and that the prediction that the earth would pass through the comet's tail was not a cause for concern. Ricalde published the\n20\n-page booklet\n[\n20\n]\nin\n1911\nin which he describes his observations of the comet and also explains the mathematics behind calculating its orbit. The article\n[\n8\n]\ndescribes in detail the contents of Ricalde's booklet:-\nThis work, written in simple and easy-to-understand language, shows that Graciano Ricalde was aware of the scientific ideas that were held in his time about comets, which is why he was able to explain them very clearly to his fellow citizens. In that booklet he also spoke about the necessary elements to establish the type of orbit that a comet can follow; elliptic, parabolic and hyperbolic and explained each of them. In the next section he dealt with the elements of\nHalley\n's orbit, as calculated in\n1907\nand\n1908\nby the English astronomers of the Greenwich Observatory, Philip H Cowell\n(1870\n-\n1949)\nand Andrew C D Crommelin\n(1865\n-\n1939)\n. Based on this data, he described in detail the ephemeris of this comet, mentioning the dates of its closest approach to Earth, both on its journey towards the Sun, and when it began to move away from it. He also explained why and when it was seen as a morning or evening star and stated that on\n18\nMay\n1910\n, the nucleus of this comet was\n25\nmillion kilometres from Earth and it was traveling at a speed of\n46\nkm/s.\nThe booklet shows that Ricalde was aware of\nHenri Poincaré\n's theories about comets which he explains in the booklet. He also explains the theory of French astronomer Hervé Faye\n(1814\n-\n1902)\nconcerning tails of comets. Ricalde first observed\nHalley\n's comet on\n14\nApril\n1910\nand in May, when the comet was a spectacular object for all to see, he sketched it. The sketch, printed in the booklet, contains details which tell us that Ricalde must have had a small telescope since details are sketched which were not visible to the naked eye.\nRicalde was a leading expert in accountancy and on\n10\nSeptember\n1914\nhe was one of three who were appointed by the governor of Yucatán to form a Special Commission to report on the operations recorded in the accounting books of the Henequen Market Regulatory Commission. The commission was headed by Elías León and the other member was Gerardo Manzanilla, a relation of Ricalde's wife. For reasons which are not known, Gerardo Manzanilla resigned on\n10\nNovember\n1914\nand Elías León resigned on\n12\nDecember leaving Ricalde to complete the report himself. He did so and in January\n1915\ngave his report to Eleuterio Ávila, the governor of Yucatán. Ávila went to confer with Venustiano Carranza in the city of Veracruz concerning the Henequen Market after receiving the report and left Toribio de los Santos as governor of Yucatán; he never returned. Ricalde then gave Toribio de los Santos a copy of his report and, when Salvador Alvarado Rubio became governor of Yucatán on\n27\nFebruary\n1915\n, he also was given a copy of the report by Ricalde. Certainly there had been cause for the report to be sought since Ricalde indicated that there was an amount close to four million pesos that was not duly registered.\nA total eclipse of the sun that was to occur on\n10\nSeptember\n1923\nwould be visible from parts of Mexico. In Yucatán the eclipse would only be partial at Mérida but in the western part of the peninsular of Yucatán, the harbour of Champotón in Campeche was near the central line of the eclipse. Ricalde, having made his own calculations concerning the eclipse, went to Champotón with the Mexican Geodistic Commission to observe it. On\n2\nFebruary\n1926\n, Ricalde was appointed as General Treasurer of the State of Yucatán by its governor Álvaro Torre Díaz\n(1883\n-\n1944)\n.\nRicalde died of a throat infection in Mérida on\n9\nNovember\n1942\n. Shortly before his death, a tribute to him by Agustín Aragón\n(1870\n-\n1954)\nwas published in the\nDiario de Yucatán\n. We give an extract from this article\n[\n1\n]\n:-\nGraciano Ricalde was born to be a mathematician with a vocation for abstract mental activity. His ethical lineage is of the most aristocratic; his father was a model of honesty, rectitude and a hard-working man. He studied as a young man and reached the pinnacle of arithmetic calculation ... But he did not stop there, he continued to devoted himself to the cultivation of his mind and reached the teaching profession with the titles of professor to transmit mathematical and astronomical knowledge. ... Between demanding daily tasks and duties of a mentor which he fulfilled scrupulously, without wandering, he steals time from deserved rest in order to be able to study, and dominates Mathematics and Astronomy in a vast extension of each one; he understands them, applies them, calculates and supports himself reading advanced books that he acquires and possesses as their spiritual and civil owner.\nLaplace\n,\nSerret\n,\nCauchy\n,\nHermite\n,\nPoincaré\n,\nAppell\n,\nDelambre\n, ... and others are familiar to him. He collaborates in French in 'L'Intermédiaire des Matémathiciens' and maintains correspondence with\nHenri Poincaré\nand\nSotero Prieto\n(\na brilliant mathematician and his ill-fated compatriot\n)\nand writes gracefully on\nHalley\n's comet on the occasion of its presence in the sky in\n1910\n, and calculated in\n1923\nthe elements of the total solar eclipse of September of that year: for Mérida, Campeche and Champotón; and he goes to Champotón harbour in order to accompany the envoy from the Geographical Studies Directorate, contemplates the marvellous phenomenon and returns to his daily work satisfied with his knowledge and crowned with the laurels of the purest modesty.\nRicalde has been honoured by having the municipal library of Hoctún named the Graciano Ricalde Gamboa Library and the high school in Ticopó named La escuela Graciano Ricalde Gamboa. Since\n2006\nthe Universidad Autónoma de Yucatán began to award the Mauro Graciano Ricalde Gamboa Municipal Mathematics Prize.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Number Theory"
  ]
}