{
  "nome_completo": "Grace Chisholm Young",
  "nome_curto": "Grace Chisholm",
  "ano_nascimento": "1868",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chisholm_Young/",
  "lugar_nascimento": "Haslemere (near London), England",
  "lugar_morte": "Croydon, Surrey, England",
  "biografia": "Grace Chisholm\n's parents were Anna Louisa Bell and Henry Williams Chisholm. Grace was the youngest of her parents' four children with her mother being\n44\nand her father\n59\nyears old when she was born. Henry Chisholm had an important position in the government of the country being chief clerk to the exchequer. Grace had an older brother Hugh Chisholm, born two years earlier, who was also highly talented and went on to achieve fame as the editor of both the eleventh and twelfth editions of the\nEncyclopaedia Britannica\n. Hugh was also highly influential as the city editor of\nThe Times\n.\nGrace was only six years old when her father retired at the age of\n65\nand at this time the family moved to Haslemere in Surrey. There she was educated by a governess at home, then at the age of\n17\nshe passed the Cambridge Senior Examination. Following her family's wishes, Grace become involved in social work among poor people in London. She was stopped by her family from studying medicine, the topic of her choice, then decided to enter Girton College, Cambridge in\n1889\nto study mathematics. At Girton her tutor was\nWilliam Young\n. She obtained a first class degree in mathematics in\n1892\n.\nShe also took\n(\nunofficially, on a challenge, with\nIsabel Maddison\n)\nthe exam for the Final Honours School in mathematics at the University of Oxford on which she out-performed all the Oxford students.\nMary Cartwright\nwrites\n[\n2\n]\n... they were the first women to sit for the Final Honours School of Mathematics, and that they did it to refute a suggestion from one of their coaches that it was more difficult for a woman to obtain a first at Oxford than at Cambridge.\nChisholm then remained at Cambridge for an additional year to compete Part II of the Mathematical Tripos, \"a most unusual thing for a woman to do in those days\" according to\nCartwright\n.\nThe place to go to undertake research in mathematics at that time was Göttingen, which had just set up a course for women, and that is where Grace Chisholm decided to continue her studies. In the reference\n[\n2\n]\na letter she wrote from Göttingen is quoted. In this letter she described\nKlein\n's attitude towards women:-\nProfessor\nKlein\n's attitude is this, he will not countenance the admission of any woman who has not already done good work, and can bring proof of the same in the form of degrees or their equivalent ... and further he will not take any further steps till he has assured himself by a personal interview of the solidity of her claims. Professor\nKlein\n's view is moderate. There are members of the Faculty here who are more eagerly in favour of the admission of women and others who disapprove altogether.\nUnder\nKlein\n's supervision she completed a doctorate in\n1895\n. Her thesis was on\nThe algebraic groups of spherical trigonometry\nand\nKlein\ndiscusses the results in one of his books.\nBy this time Chisholm's parents were elderly, her father being\n86\nyears old, so she returned from Germany to England to help look after them. In the following year, on\n11\nJune, she married\nWilliam Young\nwhom she had met again on her return to England. In fact she turned down his first proposal of marriage and only when he proposed for a second time did she accept.\nWilliam Young\nwas not a mathematical researcher, but Grace of course was trained in research at Göttingen, so she encouraged her husband to begin his research career. Their first child Frank, whom they nicknamed Bimbo, was born in\n1897\n. They lived for a year in Italy where they undertook research in geometry but did not find it particularly exciting. In\n1899\nthey moved to Göttingen where they were encouraged by\nKlein\nto work on set theory.\nThey lived in Göttingen until\n1908\n, and during these years two sons and three daughters were born. Their eldest daughter,\nRosalind Cecily\n(\nwhose married name was\nRosalind Tanner\n)\n, achieved fame as a historian of mathematics. Their son\nLaurence\nalso became a mathematician. In fact\nWilliam\nand Grace put considerable effort into teaching their children and several children's books resulted from this. Their joint work\nA First Book of Geometry\n, which was on paper folding for children, was published in\n1905\n. Two further children's books authored by Grace, written to introduce children to science, were\nBimbo\n(1906)\n, and\nBimbo and the Frogs\n(1907)\n. We noted above that Bimbo was the nickname the Youngs gave their eldest child Frank. After leaving Göttingen in\n1908\nthey settled in Geneva, Switzerland, where they continued a true mathematical partnership in which both contributed. This is described in detail in\n[\n4\n]\n. To quote from one letter of\nWilliam Young\nto his wife\n(\nsee\n[\n4\n]\nfor more details\n)\n:-\nThe fact is that our papers ought to be published under our joint names, but if this were done neither of us get the benefit of it. No. Mine the laurels now and the knowledge. Yours the knowledge only. Everything under my name now, and later when the loaves and fishes are no more procurable in that way, everything or much under your name. At present you cannot undertake a public career. You have your children. I can and do.\nTogether\nWilliam Young\nand Grace wrote\n220\nmathematical articles and several books. One of the books\nThe Theory of Sets of Points\n(1906)\nwas published under their joint names and when Grace Young sent the book to\nCantor\nhe replied:-\nIt is a pleasure for me to see with what diligence, skill and success you have worked and I wish you, in your further researches in this field as well, the finest results, which, with such depth and acuteness of mind on both your parts, you cannot fail to attain.\nIt is almost impossible to tell exactly how much of the work in these papers was due to Grace Young. As\nWilliam Young\nwrote himself, in the same letter part of which has already been quoted above:-\nI am very happy that you are getting on with the ideas. I feel partly as if I were teaching you, and setting you problems which I could not quite do myself but could enable you to.\nWe mentioned above that Grace had wanted to study medicine when she was young but her parents had been against this. However Grace did study medicine, both in Göttingen and in Geneva but she never took any formal examinations to qualify in the subject. She continued to work on mathematical research and, between\n1914\nand\n1916\n, she published work on the foundations of calculus under her own name. She wrote an essay on 'infinite derivatives' which won the Gamble Prize from Girton College in\n1915\n. In the same year, although remaining in Switzerland, the Youngs moved from to live near Lausanne. World War I was, however, tragic for them since Frank, who was an airman, was killed in action. The family were devastated by this tragedy and Grace's health began slowly to decline. By the mid\n1920\ns she had stopped her mathematical research.\nWhen World War II began to affect their lives in Switzerland, Grace Young brought two of her grandchildren\n(\nchildren of her daughter Janet\n)\nto England early in\n1940\n. Although she had intended to return at once, it became impossible on the fall of France and she had to remain in England. Depressed at being separated, William died in\n1942\n. Grace Young outlived her husband by two years, dying at the home of her daughter Janet in Park Road, Croydon.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}