{
  "nome_completo": "Luigi Guido Grandi",
  "nome_curto": "Guido Grandi",
  "ano_nascimento": "1671",
  "ano_morte": "1742",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grandi/",
  "lugar_nascimento": "Cremona (now Italy)",
  "lugar_morte": "Pisa (now Italy)",
  "biografia": "Guido Grandi\n's parents were Pietro Martire Grandi, an embroiderer in gold, and Caterina Legati. Guido was not given that name when he was baptised, rather he was given the name Francesco Lodovico but changed his name to Guido when he entered the Order of the Camaldolese. The family were of modest means and lived their lives in a religious manner. Guido's family had a number notable people in it, perhaps the most significant being Lorenzo, a maternal uncle, who was a physician and professor of Greek at the University of Bologna, and the\n17\nth\ncentury writer Domenico Legati.\nGrandi was educated first by the priest Pietro Canneti\n(1659\n-\n1730)\nand then at the Jesuit college in Cremona. At the College he studied rhetoric and Latin. An important influence on him was\nGiovanni Saccheri\nwhom he met at this time.\nSaccheri\nwas teaching Latin but, Grandi wrote, that:-\n... he had the goodness to instil in me a first love of philosophy and led me to the point where I could progress.\nAt this stage\nSaccheri\nwas not interested in mathematics and there was no mathematics in the courses that Grandi studied. He became a member of the Order of the Camaldolese around Christmas\n1687\n, perhaps being influenced to join this order by his first teacher Pietro Canneti. The Camaldolese Order, an offshoot of the Benedictine Order, was founded about\n1012\nat Camaldoli near Arezzo, Italy. A monastery and hermitage formed one unit in this Order and Grandi studied at the monastery of Sant' Apollinare in Classe, Ravenna. He completed his novitiate at Sant' Apollinare studying philosophy with Father Casimiro Galamini, but still had no contact with mathematics. He also studied literature, hagiography and history in a group led by Pietro Canneti. Students were excluded from the local Accademia dei Concordi\n(\na cultural institution founded around\n1580)\n, the local branch being directed by Pietro Canneti. So, along with fellow students, he founded the Accademia dei Gareggianti. He studied poetry and wrote a work on the theory of music in\n1691\n. Then, in\n1692\n, he was sent to another monastery of the Camaldolese Order in Rome, namely San Gregorio al Celio, where he studied Father Galamini's theology course. He also studied canon law in Rome and in\n1693\ncompleted writing his commentary on Peter Damian's\nLife of Blessed Romuald\n, the founder of the Camaldolese Order. Peter Damian wrote the Life of Blessed Romuald about fifteen years after Romuald's death.\nThe following year, Grandi became a teacher of philosophy and theology at the Camaldolese monastery of Santa Maria degli Angeli in Florence. Up to this time he had shown little interest in mathematics but now his thoughts turned in that direction and he studied on his own the works of\nEuclid\n,\nApollonius\n,\nPappus\nand\nArchimedes\n. In Florence he met with\nVincenzo Viviani\nand learned from him and his students the methods of classical geometry and also the infinitesimal methods of\nBonaventura Cavalieri\n. Grandi published\nGeometrica divinatio Vivianeorum problematum\nⓉ\n(\nGeometric solutions of Viviani's problems\n)\nin\n1699\n. In this work he discussed\nViviani\n's question:-\nA hemisphere has\n4\nequal windows of such a size that the remaining surface can be exactly squared - how is this possible?\nViviani\nhad answered the question using geometry but had not given a proof. Grandi was able to solve the problem using a modification of\nCavalieri\n's infinitesimal methods. The commentary in\n[\n19\n]\nexplains that\nGeometrica divinatio Vivianeorum problematum\nⓉ\n(\nGeometrical problems solved by Viviani\n)\nis:-\n... a work which contains more than its title would lead us to expect, and in which the author remarks many other curiosities in geometry of the same kind, and among others, a portion of the surface of a right cone which can be squared.\nA review of Grandi's work in\nActa eruditorum\nⓉ\n(\nJournal of the learned\n)\nin\n1701\nbrought him recognition in Italy and in other countries. Grand Duke Cosimo III learnt of Grandi's fame and arranged to meet with him around this time. Having learnt much geometry, between\n1699\nand\n1700\nGrandi began to look at applications to optics, mechanics, astronomy. Having now shown a deep understanding of mathematics, Grandi began to teach mathematics at the monastery of Santa Maria degli Angeli. Also around this time, Grandi also began to correspond with\nTommaso Ceva\nwho was at the Jesuit college of Brera in Milan. In fact Grandi was a vigorous correspondent, exchanging letters with many scientists and theologians. Many of the articles in the references discuss Grandi's correspondence, see for example\n[\n7\n]\n,\n[\n8\n]\n,\n[\n10\n]\n,\n[\n11\n]\n,\n[\n13\n]\n,\n[\n16\n]\n,\n[\n17\n]\n,\n[\n18\n]\n, and\n[\n29\n]\n.\nThe Accademia Arcadia was a literary academy which was founded in Rome in\n1690\nto promote a more natural, simple poetic style and around\n1700\nGrandi attended this Academy. Poetry, especially Latin poetry, was a favourite with Grandi throughout his life. His other mathematical friends like\nTommaso Ceva\nwere also lovers of poetry. Grandi was offered a chair of mathematics in Rome but the Grand Duke Cosimo did not want to lose his star mathematician and in May\n1700\n, the Grand Duke Cosimo offered Grandi a position of professor of philosophy at Pisa. Grandi chose to go to Pisa rather than to Rome. In Pisa, he published\nGeometrica demonstratio theorematum Hugenianorum circa logisticam\nⓉ\n(\nDemonstration of Huygens theorem on the logistic curve\n)\nin\n1701\n. In this he studied the logarithmic curve proposed by\nChristiaan Huygens\n, using generalised algebraic methods, series expansions and infinitesimal methods. This is\n[\n19\n]\n:-\n... an excellent specimen of the ancient geometrical method; in which piece also, as well as in his letter to the Jesuit Ceva, which follows it, are found several other curious and novel particulars.\nHe discussed the conical\nloxodrome\n, the curve that cuts the generators of a cone of revolution in a constant angle.\nIn fact Grandi taught methods of the infinitesimal calculus from\n1702\nin private lessons he was giving; he was the first to do so in Italy. In\n1703\n, he published the book\nQuadratura circoli et hyperbolae per infinitas hyperbolas et parabolas quadrabiles geometrice exhibita\nⓉ\n(\nQuadrature of the circle, and hyperbola for infinite hyperbolas and parabolas lunes presented geometrically\n)\nwhich, although it does not contain anything particularly original, nevertheless was important in introducing infinitesimal methods into Italy. Grandi writes in the Preface:-\nBut I have here and there also inserted the dx, dy typical of differential calculus, and their methods of being differentiated and added. Thus had I been able to introduce them in my previous pamphlets too! But then, the secrets of that method had been inaccessible to me, while now, their usefulness and fecundity having been proven, why not insert them among the other methods I am familiar with? Also, the significance of the symbols is very clear, because it only signifies an infinitely small difference between the same x and y, and you will easily find the very rules of calculus if you observe and peruse this tract carefully - unless you want to recourse to the illustrious\nDe L'Hôpital\nwho explains them in a more complete way in his tract on the infinitely small.\nGrandi had studied\nNewton\n's fluxions and\nLeibniz\n's differentials and used both approaches although he favoured the approach by\nLeibniz\n. He sent copies of his work to both these mathematicians and received thanks from\nLeibniz\nand copies of the\nOpticks\nand the\nPrincipia\nfrom\nNewton\n. One of Grandi's results in the\nQuadratura\nⓉ\n(\nQuadrature\n)\ncaused a lot of interest. He used the series expansion\n1\n1\n+\nx\n=\n1\n−\nx\n+\nx\n2\n−\nx\n3\n+\nx\n4\n−\n.\n.\n.\n\\Large\\frac{1}{1+x}\\normalsize  = 1 - x + x^{2} - x^{3} + x^{4} - ...\n1\n+\nx\n1\n​\n=\n1\n−\nx\n+\nx\n2\n−\nx\n3\n+\nx\n4\n−\n.\n.\n.\nand putting\nx\n=\n1\nx = 1\nx\n=\n1\n, obtained\n1\n−\n1\n+\n1\n−\n1\n+\n1\n−\n1\n+\n.\n.\n.\n=\n1\n2\n1 - 1 + 1 - 1 + 1 - 1 + ... = \\large\\frac{1}{2}\\normalsize\n1\n−\n1\n+\n1\n−\n1\n+\n1\n−\n1\n+\n.\n.\n.\n=\n2\n1\n​\n. However, he argued that\n(1\n-\n1)\n+\n(1\n-\n1)\n+\n(1\n-\n1)\n+ ... =\n0\n+\n0\n+\n0\n+\n0\n+... . In the first draft of the work, Grandi claimed that since the sum of infinitely many\n0\ns equaled\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nhe had proved that God could create the word out of nothing. The censor allowed the mathematics to be published but required the removal of the comment that it showed God could create the word out of nothing. Grandi reluctantly agreed to remove the comment but many mathematicians across Europe discussed Grandi's result that\n0\n+\n0\n+\n0\n+\n0\n+\n.\n.\n.\n=\n1\n2\n0 + 0 + 0 + 0 +... = \\large\\frac{1}{2}\\normalsize\n0\n+\n0\n+\n0\n+\n0\n+\n.\n.\n.\n=\n2\n1\n​\n. The\nQuadratura\nⓉ\n(\nQuadrature\n)\nalso contains the first study of the curve which today is known as the Witch of\nAgnesi\n. Grandi gave the curve the name Scala, the scale curve, because it can serve as a measure of light intensity.\nNow although Grandi continued to study the latest developments in mathematics, he also undertook other projects. One major project was the publication of the four-volume\nDissertationes Camaldulenses\nⓉ\n(\nDissertation on the  Camaldese order\n)\n(1707)\nin which he traced the origins of the Order of the Camaldolese. This work was the result of extensive research undertaken by Grandi. However, several scholars were unhappy with Grandi's treatment and he was forbidden to use the archives at Camaldoli. The Grand Duke Cosimo supported Grandi's publication of the\nDissertationes\nand decided that he would move to protect him. The result was Grandi's first mathematical appointment which came in\n1707\nwhen he became mathematician to the Grand Duke of Tuscany, Cosimo III de' Medici. In May\n1708\nhe sent a work on the theory of music to\nIsaac Newton\nwho published it in the\nTransactions\nof the\nRoyal Society of London\nin the following year. In\n1709\nhe was proposed by Newton for a Fellowship of the\nRoyal Society\nand duly elected as a fellow. In the same year, shortly after his election, he published\nOn the nature and properties of sound\nin the\nPhilosophical Transactions\nof the\nRoyal Society of London\n.\nNow Alessandro Marchetti\n(1633\n-\n1714)\nwas a mathematician at Pisa who was a follower of\nGalileo\n. He did not like Grandi's international fame and, in an attempt to discredit him, criticised his\nQuadratura\n. As a result, Grandi published a second edition in\n1710\nand this time he was allowed to include the comment that he had proved that God could create the word out of nothing. Marchetti then published an attack on this second edition in\n1711\nto which Grandi responded with\nDialoghi ...  circa la controversia eccitatagli contro dal sig. dottore Alessandro Marchetti\nⓉ\n(\nA dialogue on the controversy caused by ... Dr Alessandro Marchetti\n)\n(1712)\n. The controversy continued and, even after Marchetti's death in\n1714\n, Grandi wanted to continue the argument since he argued that Marchetti's children had supported their father and so the argument should continue. Perhaps this episode justifies the comment that\n[\n19\n]\n:-\nGrandi it seems was of a turbulent and quarrelsome disposition, being almost always engaged in disputes on various subjects, geometrical, theological, metaphysical or philological.\nIn fact, his quarrelsome nature meant that even his students, while recognising his talents and merits, nevertheless criticised him or left him. However, he lived a simple retiring life among a small circle of friends. His output of scholarly works continued to be exceptional. In\n1710\n, Grandi published\nDe infinitis infinitorum, et infinite parvorum ordinibus disquisitio geometrica\nⓉ\n(\nA geometric account of an infinite number of infinite things and of infinitely small order\n)\nin which he thanked the\nRoyal Society\nfor electing him. In\n1714\nGrandi was appointed Professor of Mathematics at the University of Pisa, a position which became vacant on the death of Marchetti and, in the same year,\nNewton\nsent him a copy of the second edition of the\nPrincipia\n. He took on further duties in\n1716\nwhen he was appointed superintendent of water in Tuscany. In the following year, he was also appointed Pontifical Mathematician to deal with issues of hydraulics in the Romanga, and he helped to carry out an extensive survey of the Po system. In this capacity, he was involved with a number of projects such as ones to drain the Chiana Valley and the Pontine Marshes. Another major project which he undertook around the same time was collaborating with Tommaso Bonaventuri\n(\n?-\n1731)\nand Benedetto Bresciani\n(1658\n-\n1740)\non publishing a\n3\n-volume\nWorks of Galileo Galilei\n(1718)\n[\n1\n]\n:-\nGrandi contributed to it a \"Note on the Treatise of Galileo Concerning Natural Motion,\" in which he gave the first definition of a curve he called the 'versiera'\n(\nfrom the latin 'sinus versus'\n)\n.\nOne of the results for which Grandi is best known today is his definition of the\nrodonea curve\n. Rodonea is the Latin for rose and Grandi first defined these curves in December\n1713\nin a letter he wrote to\nLeibniz\n. He did not publish his results on these curves until ten years after this when he published the paper\nHandful or bouquet of geometrical roses\nin the\nPhilosophical Transactions\nof the\nRoyal Society of London\n. He expanded the material on these curves in\nFlores geometrici ex Rhodonearum, et Cloeliarum curvarum descriptione resultantes\nⓉ\n(\nGeometric flowers from Rhodonea, and a description of the resulting  Cloelia curves\n)\n(1728)\n. In the same work he defines the\nclelie curve\nwhich, like the rodonea curve, he had first mentioned in a letter to\nLeibniz\nin\n1713\n. He named the curve after Countess Clelia Borromeo and dedicated his book to her. If the longitude and colatitude of a point\nP\nP\nP\non a sphere is denoted by\nθ\n\\theta\nθ\nand\nϕ\n\\phi\nϕ\nand if\nP\nP\nP\nmoves so that\nθ\n=\nm\nϕ\n\\theta = m \\phi\nθ\n=\nm\nϕ\n, where\nm\nm\nm\nis a constant, then the locus of\nP\nP\nP\nis a clelie. Grandi also applied the term \"clelies\" to the curves determined by certain trigonometric equations involving the sine function\na\nsin\n⁡\nθ\n=\nb\nsin\n⁡\nm\nϕ\na \\sin \\theta = b \\sin m \\phi\na\nsin\nθ\n=\nb\nsin\nm\nϕ\na\nsin\n⁡\nθ\n=\na\n−\nb\nsin\n⁡\nm\nϕ\na \\sin \\theta = a - b \\sin m \\phi\na\nsin\nθ\n=\na\n−\nb\nsin\nm\nϕ\nThe\nFlores geometrici\nⓉ\n(\nGeometric flowers\n)\nwas, as can be seen from the title, a Latin text. However, Grandi wanted this work to be more widely read than just by scholars so, in\n1729\n, he produced an Italian version of the work which contained additional explanations and proofs.\nGrandi now travelled much, often undertaking practical work on hydraulics and was sometimes in Rome where he advised the Pope Clement XII on calendar reform. He also undertook projects writing biographies of religious figures. However, he did not neglect mathematics, publishing an Italian version of\nEuclid\n's\nElements\nin\n1731\nand a series of works on mechanics\nInstituzioni meccaniche\nⓉ\n(\nInstructions on mechanics\n)\n(1739)\n, arithmetic\nInstituzioni di aritmetica pratica\nⓉ\n(\nInstructions on practical arithmetic\n)\n(1740)\nand geometry\nInstituzioni geometriche\nⓉ\n(\nInstructions on geometry\n)\n(1741)\n. However, by this time he was suffering from severe health problems. From\n1737\nhe began to suffer from memory loss, clearly a form of dementia, and realising that he did not have too long left, he hurried to produce his final publications. By late\n1740\nhis mind had almost completely gone although he still managed to dictate a letter in the early part of\n1741\n. In May\n1742\nhis physical health also became a serious issue and on\n26\nJune he collapsed in the church attached to the monastery in which he lived. He died about a week later and was buried in the monastery church in a tomb with a marble bust by the sculptor Giovanni Baratta\n(1670\n-\n1747)\nand an inscription by Father A Forzoni, one of Grandi's students.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}