{
  "nome_completo": "Gury Vasilievich Kolosov",
  "nome_curto": "Gury Vasilievich Kolosov",
  "ano_nascimento": "1867",
  "ano_morte": "1936",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kolosov/",
  "lugar_nascimento": "Ust, Novgorod guberniya, Russia",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Gury Vasilievich Kolosov\nreceived his school education in St Petersburg where he attended the\nGymnasium\n. He loved mathematics and physics, and proved himself an outstanding pupil at the high school, being awarded the gold medal in\n1885\n. This was the year in which he graduated from the Gymnasium and entered the Faculty of Physics and Mathematics at the University of St Petersburg. He was awarded his first degree in\n1889\nbut continued to study at the university for a qualification to allow him to teach.\nHe passed his Master's examinations in\n1893\nand his Master's dissertation\nOn certain modifications of Hamilton's principle and its application to the solution of problems of mechanics of solid bodies\n(\nRussian\n)\n(1903)\ncontained his first really significant result. This result, which he had first announced in a publication in\n1898\n, was the discovery of\n[\n1\n]\n:-\n... a new \"integrated\" case of motion for a top on a smooth surface, related to the turning of a solid body about a fixed point.\nThe paper which announced this important result was\nOn one case of the motion of a heavy solid body supported by a point on a smooth surface\n(\nRussian\n)\n(1898)\n. We should note at this point that a Master's Degree in Russia at this time was equivalent to what today would be Ph.D. level.\nIn\n1908\nKolosov began working on the theory of elasticity and his doctoral thesis\n(\nequivalent to the German\nhabilitation\nstandard\n)\ncontains Kolosov's formulas expressing the components of the stress tensor and the displacement vector in terms of two analytic functions of one complex variable. However this deep and important piece of work did provoke some controversy as is explained in\n[\n2\n]\n. Kolosov's thesis contained a formal solution of the plane problems of the theory of elasticity. After deriving these he successfully applied the formulas to solve some special cases.\nSteklov\nhad been appointed to examine the thesis and at first he was not convinced that Kolosov's derivation of his formulas was rigorous. The paper\n[\n2\n]\ncontains details of the interesting correspondence and a detailed analysis of Kolosov's work.\nSteklov\nwas eventually became convinced that the derivation was satisfactory.\nThere are two interesting 'follow-ups' to these events. The first is that\nSteklov\nwas right to question the work, but nevertheless it was correct. All doubts were finally removed when\nN I Muskhelishvili\n, a student of Kolosov, completely validated the results several years later. The second interesting comment is that Kolosov was not the first to discover the formulas now named after him . The first discoverer was\nSergei Chaplygin\nwho had derived them ten years earlier, but he had not thought them sufficiently important to publish -\nChaplygin\nof course was quite wrong in this assessment and this fact alone would justify them now being named after Kolosov. The irony of this story is that\nChaplygin\nhad worked in the same department as Kolosov. The formulas were first published by Kolosov in his\n1909\npaper\nAn application of the theory of functions of a complex variable to a planar problem in the mathematical theory of elasticity\n(\nRussian\n)\n.\nFrom\n1893\nKolosov was employed both as the director of the mechanics laboratory at St Petersburg University, and as a teacher at the St Petersburg Institute of Communications Engineers.  He worked at Yurev University from\n1902\nto\n1913\n. If the name of this university is unfamiliar, then perhaps 'Tartu University' or 'Dorpat University' will be more familiar. All are names for the same institution founded in\n1632\nby Gustavus II Adolphus of Sweden. The Estonian name is Tartu, while the German and Swedish names for the same city\n(\nand university\n)\nare both Dorpat. However, between\n1893\nand\n1918\nthe city was known as Yurev or Yuryev and it was during this period that Kolosov worked there. He was appointed in\n1902\nas a\nprivatdozent\nthen was promoted to professor during the eleven years he spent there.\nIn\n1913\nKolosov returned to St Petersburg where he spent the rest of his career. He worked both at St Petersburg University, becoming head of the department of theoretical mechanics in\n1916\n, and at the Electrotechnical Institute where he was appointed head of the department of theoretical mechanics immediately on his return to the city in\n1913\n.  Of course for much of this time\n(\nbetween\n1914\nand\n1924)\n, the city was known as Petrograd. After\n1924\nit became known as Leningrad. Kolosov worked in the famous city through a very difficult period since the Russian Revolution essentially began in St Petersburg in\n1917\n. During the years of the civil war the city fell on very hard times and its population fell by two-thirds to around\n700\n,\n000\nover the three years\n1917\n-\n1920\n. However after the civil war ended the city began to prosper again and by the time of Kolosov's death its population was nearly three million.\nIn addition to the important results we have mention above, we note that in\n1907\nKolosov derived the solution for stresses around an elliptical hole. It showed that the concentration of stress could become far greater, as the radius of curvature at an end of the hole becomes small compared with the overall length of the hole. Engineers have to understand Kolosov results so that stresses can be kept to safe levels. Finally we mention his important text\nApplication of a complex variable to the theory of elasticity\n(\nRussian\n)\npublished in Moscow in\n1935\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry"
  ]
}