{
  "nome_completo": "Hajer Bahouri",
  "nome_curto": "Hajer Bahouri",
  "ano_nascimento": "1958",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bahouri/",
  "lugar_nascimento": "Tunis, Tunisia",
  "lugar_morte": null,
  "biografia": "Hajer Bahouri\nstudied for her first degree at the University of Tunis where she specialised in mathematics. She entered the university in\n1977\nand graduated in\n1979\n. She was awarded the President's Prize for the best performance at national level in Tunisia.\nAfter the award of her first degree, Bahouri went to France to continue her mathematical studies in Paris. She entered the Université de Paris XI\n(\nParis-Sud\n)\nin Orsay and, in\n1980\n, after one year, was awarded the D.E.A. de Mathématique. The D.E.A. is the Diplôme d'études approfondies, which is the equivalent of a Master's degree. She then continued her studies at the Université de Paris XI\n(\nParis-Sud\n)\nundertaking research for the Doctorat\n3\nème cycle, advised by Serge Alinhac.\nLet us say a little about Serge Alinhac who was born in\n1948\n. He was awarded his doctorate in\n1975\nby the Université Paris-Sud for his thesis\nProblèmes de Propagations Hyperboliques Singuliers\n. After teaching at the University of Paris VII and Purdue University in the United States, he had been appointed as a professor at the Université de Paris XI\n(\nParis-Sud\n)\nin\n1978\n. His mathematical area of interest was partial differential equations. Advised by Serge Alinhac, Bahouri was awarded her Doctorat\n3\nème cycle in\n1982\nfor her thesis\nUnicité et non unicité du problème de Cauchy pour des opérateurs à symbole principal réel\nⓉ\n(\nUniqueness and nonuniqueness of the Cauchy problem for operators with a real main symbol.\n)\n. Her first paper, published in\n1983\n, was the\n27\n-page paper\nNon unicité du problème de Cauchy pour des opérateurs à symbole principal réel\nⓉ\n(\nNon uniqueness of the Cauchy problem for real key symbol operators\n)\ncontaining results from her thesis. Bahouri's address on this paper is Université de Paris XI\n(\nParis-Sud\n)\n. Jorge Hounie writes in a review of the paper:-\nThis work is concerned with non-uniqueness in the non-characteristic Cauchy problem for second-order differential operators with smooth coefficients. The author proves three theorems giving sufficient conditions for non-uniqueness\n(\nP is said to have non-uniqueness if there are smooth functions u and a such that Pu + au =\n0\n, u vanishes on the negative side of the initial surface S and does not vanish on any open subset of the positive side of S\n)\n. These conditions bear on the principal part p alone and are related to \"pseudoconvexity'' properties of S and in one case to the nature of the eigenvalues of the fundamental matrix of p at points of double characteristics. The article extends results due to Alinhac, and to Alinhac and Baouendi.\nAfter completing her Doctorat\n3\nème cycle, Bahouri went to the École Polytechnique, in Palaiseau\n(\na southern suburb of Paris\n)\n, being appointed as a researcher in\n1982\n. After two years at the École Polytechnique, she was appointed in\n1984\nas an assistant lecturer at the Université de Paris XI\n(\nParis-Sud\n)\nand also at the University of Rennes I. Her second paper\nNon prolongement unique des solutions d'opérateurs \"Somme de carrés\"\nⓉ\n(\nNo single extension of operator solutions 'Sum of squares'\n)\nhad an École Polytechnique address and appeared in\n1986\n. As the title indicates, in the paper she shows the failure of unique continuation for \"sum of squares'' operators. She adds the following acknowledgement to this paper:-\nIt is to S Alinhac that I owe my interest in this question. I thank him very much. I would also like to thank Jean-Pierre Bourguignon for the advice he has given me.\nWe note that at the time Jean-Pierre Bourguignon, a graduate of the École Polytechnique, was attached to the Centre de mathématique which was partly run by the École Polytechnique and situated on the site of the École Polytechnique at Palaiseau. He was interested in differential geometry, partial differential equations and mathematical physics.\nIn\n1987\ntwo of Bahouri's papers appeared in print and she was awarded her Doctorat d'état by the Université de Paris XI\n(\nParis-Sud\n)\n. Her thesis for this degree was\nUnicité, non unicité et continuité Hölder du problème de Cauchy pour des équations aux dérivées partielles: propagation du front d'onde C\nρ\npour des équations non linéaires\nⓉ\n(\nUnicity, nonuniqueness and Hölder continuity of the Cauchy problem for partial differential equations: propagation of the wavefront C\nρ\nfor nonlinear equations\n)\nand again she was advised by Serge Alinhac. One of the two\n1987\npapers, written in collaboration with L Robbiano, was\nUnicité de Cauchy pour des opérateurs faiblement hyperboliques\nⓉ\n(\nUnicity of Cauchy for weakly hyperbolic operators\n)\n. In it the authors write:-\nWe present, in this work, two uniqueness theorems of the Cauchy problem for hyperbolic operators with respect to a surface. Since hyperbolicity with respect to a surface is a necessary condition for the Cauchy problem to be well posed\n(\nLax-Mizohata theorem\n)\n, most of the results concerning this type of operator deal both with the question of existence and that of uniqueness.\nFor a list of publications by Hajer Bahouri, see\nTHIS LINK\n.\nAfter holding the assistant lecturer positions in France for four years, in\n1988\nshe returned to Tunisia and was appointed as a Professor\n(2\nnd class\n)\nin the Faculty of Science at Tunis, Université des Sciences, des Techniques et de Médecine de Tunis\n(\nTunis II\n)\n. In\n1993\nshe was promoted to Professor\n(1\nst class\n)\nin the Faculty of Science at Tunis and in\n2001\nshe was honoured with being awarded the Tunisian 'Médaille du mérite'.\nIn August\n2002\nthe International Congress of Mathematicians was held in Beijing, China, and Bahouri was an invited participant. Her paper\nQuasilinear wave equations and microlocal analysis\n, written jointly with Jean-Yves Chemin, was published in Volume\n3\nof the\nProceeding\nof the Congress.\nWe will give a few details of Jean-Yves Chemin who has collaborated with Bahouri on\n27\nof the\n62\nof her publications that we list at\nTHIS LINK\n.\nChemin was born in\n1959\nat Rouen, France, and was awarded his doctorate by the Université de Paris XI\n(\nParis-Sud\n)\nin\n1986\n. In that year he was attached to the Centre de mathématique which we mentioned above when giving details of Jean-Pierre Bourguignon. He was awarded his Doctorat d'état in\n1989\nfor a thesis on singularities of non-linear hyperbolic partial differential equations.\nBahouri continued to hold the professorship in the Faculty of Science at Tunis but, in\n2002\n-\n2004\n, she also taught courses at the École Polytechnique, Palaiseau. In\n2003\nshe was made Director of the newly established Laboratoire Equations aux Dérivées Partielles at the University of Tunis. In\n2010\nshe left her positions in Tunis and returned to France when she was appointed as Director of Research\n(1\nst class\n)\nof the Centre national de la recherche scientifique being attached to the Laboratoire d'Analyse et Mathématiques Appliquées, Université Paris-Est-Créteil Val-de-Marne.\nIn\n2016\nBahouri was awarded the Paul Doistau-Émile Blutet Prize of the French\nAcademy of Sciences\n. This prestigious award has been made to a mathematician every even year\n(\nwith a few exceptions of awards on odd years\n)\nsince\n1958\n. For example,\nPierre-Louis Lions\nreceived the award in\n1986\nand\nWendelin Werner\nin\n1999\n.\nFinally let us look at the book\nFourier analysis and nonlinear partial differential equations\nwhich Bahouri wrote in collaboration with Jean-Yves Chemin and Raphaël Danchin. We quote from the review of this book written by Peter Massopust\n[\n4\n]\n:-\nThis book intends to prepare the reader how to apply tools from\nFourier\nanalysis to directly solve problems arising in the theory of nonlinear partial differential equations. The authors have three goals: First, they present a detailed account of the tools and methods from harmonic analysis that are presently used to solve nonlinear partial differential equations. Second, they convey to the reader the simplicity of the\nLittlewood\n-\nPaley\ndecomposition, and thirdly, they present some specific examples of how such\nFourier\nanalysis tools are employed in concrete situations. They consider, among others, evolution equations such as transport and heat equations, linear or quasi-linear symmetric hyperbolic systems, linear, semi-linear and quasi-linear wave equations, and linear and semi-linear\nSchrödinger\nequations. ... Throughout the book, the reader is exposed to detailed discussions, rigorous derivations, and the plethora of\nFourier\n-analytic tools. The presentation is well structured and easy to follow. The goal set by the authors, namely to present the\nFourier\n-analytic tools in such a way that they can be directly applied to the solution of nonlinear differential equations, is met for all the applications studied. Each chapter concludes with a section on references and remarks. Here, the reader is introduced to the literature that is relevant for the current chapter and presented with short historical comments regarding the methods presented in the chapter. For the reader's convenience, a list of notation is given at the end of the References section. This is a textbook for advanced undergraduate or beginning graduate students with a good background in real and functional analysis. However, even active researchers or mathematicians interested in the application of\nFourier\n-analytic tools will find this book very useful.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Topology"
  ]
}