{
  "nome_completo": "Hans Samelson",
  "nome_curto": "Hans Samelson",
  "ano_nascimento": "1916",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Samelson/",
  "lugar_nascimento": "Straßburg, Germany (now Strasbourg, France)",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Hans Samelson\n's parents were Siegfried Samelson and Irmgard Engel. We should say a little about the family background, particularly because of the connection to\nMoritz Pasch\n. Siegfried Samelson was the son of Adolf Samelson and\nMoritz Pasch\n's younger sister Henriette Pasch. The Samelson family were Jewish but Siegfried, who was professor of pediatrics and director of the school health system in Strassburg, married Irmgard Engel who was also a paediatrician. Irmgard was a Christian and not Jewish. It is a sad fact that Siegfried and Irmgard's ethnicity had such a major effect on their lives and those of their children Hans, Klaus and Franz.\nWhen Hans was born in Strassburg the city was in Germany and World War I was taking place. In November\n1918\n, when Hans was two years old, following the defeat of Germany, French troops entered Strassburg and declared the city to be part of France. Hans's younger brother was born in Strasbourg\n(\nas it had been renamed\n)\nin December\n1918\nshortly after the French occupation and before international recognition of the city's transfer to France in the Treaty of Versailles in June\n1919\n. The Samelson family were expelled from Strasbourg by the new French authorities and, after a brief stay in the Black Forest, they returned to Siegfried's hometown of Breslau, where Siegfried became a professor of paediatrics and director of school health system. His wife Irmgard also found work as a paediatrician. Hans's youngest brother Franz was born in Breslau in\n1923\n.\nHans Samelson was educated in Breslau but after the Nazis came to power in\n1933\nnot only did his father lose his position in the university but all three boys, being half-Jewish, also began to have restrictions imposed on their education. Although Hans studied at the University of Breslau, advanced studies were restricted and he left Germany in\n1936\nto study for his doctorate in mathematics at the Eidgenössische Technische Hochschule in Zürich. At this time his brother Klaus, unable to undertake university studies, began an apprenticeship in Hamburg. Hans worked for his doctorate advised by\nHeinz Hopf\nbut also attended lectures by\nMichel Plancherel\nand\nGeorge Pólya\n. In\n1938\nSamelson's paper\nÜber die Drehung der Tangenten offener ebener Kurven\nⓉ\n(\nOn the rotation of the tangents to open plane curves\n)\nwas published and, in the same year, a joint paper\nZum Beweis des Kongruenzsatzes für Eiflächen\nⓉ\n(\nTo prove the congruence theorems for oval surfaces\n)\nwritten with\nHeinz Hopf\nappeared. However, tragedy struck the family in this year of\n1938\nfor on\n9\nNovember the Nazis launched attacks on synagogues, Jewish businesses and home of Jews across Germany. Following Kristallnacht, as this event had been called, Siegfried Samelson decided that the only way he could help his family was to commit suicide. By taking his own life he did manage to ensure that his wife Irmgard and his two sons still in Germany, Klaus and Franz, were able to survive under slightly less severe conditions. Hans Samelson continued his research in Switzerland and in\n1940\npublished\nÜber die Sphären, die als Gruppenräume auftreten\nⓉ\n(\nOn spheres that act as group rings\n)\nin which he gave a topological proof that a compact\nLie\ngroup of rank one\n(\nthat is a\nLie\ngroup in which maximal abelian subgroups are of dimension one is homeomorphic to the circle, the\n3\n-sphere or projective\n3\n-space. He was awarded his doctorate in\n1940\nfor his thesis\nBeiträge zur Topologie der Gruppen-Mannigfaltigkeiten\nⓉ\n(\nContributions to the topology of the group manifolds\n)\n. In the thesis, writes\nAndré Weil\n:-\n... some notable progress is made in the study of the topological structure of compact\nLie\n-groups and of the corresponding homogeneous spaces. ... the methods are those of \"classical\" topology, combined with an extensive use of\nHopf\n's inverse homomorphism, and with some of the simpler results concerning fibre-spaces.\nSamelson married Renate Reiner in\n1940\nbut he had no reason to be in Switzerland after the award of his doctorate. He wrote\n(\nsee\n[\n1\n]\n)\n:-\nIt was clear from the beginning that my only chance was eventual immigration into the USA; in Switzerland my stay was definitely temporary, but as long as I got enough money from home or otherwise to live on - but not from work - they let me stay.\nHowever, he wrote\n[\n5\n]\n:-\n... the Fremdenpolizei\n[\nImmigration Office\n]\ncalled me in frequently to ask me why I was still there.\nHe was fortunate that money was found to enable him to spend\n1941\n-\n42\nat the Institute of Advanced Study in Princeton. However, there was still a major problem for Samelson and his wife had to escape from Europe. He was still liable for military service in Germany and so had to avoid contact with German troops. Samelson and his wife escaped by making for Spain and then taking a boat to New York. He arrived at Princeton with his wife Renate in June\n1941\n. Soon after he arrived,\nHermann Weyl\nwrote to\nHeinz Hopf\nin Zürich\n(\nsee\n[\n1\n]\n)\n:-\nThe Samelsons arrived safely, though after quite an unpleasant journey. He makes an excellent impression on everyone around here. In one of your earlier letters you wrote that his probability of surviving Switzerland was zero.\nAt first the Samelsons sublet an apartment of William \"Ted\" Martin, who was just leaving Princeton, but then found their own place to live. Samelson writes about this year at the Institute for Advanced Study in\n[\n6\n]\n:-\nIt wasn't difficult to meet and get to know everybody who was there; in fact it seems to me that a good deal of the time all of us were together.\n[\nPaul Halmos\n,\n]\nJimmy Savage\n,\nEllis Kolchin\n,\nDavid Blackwell\n, Warren Ambrose,\nGeorge Mackey\n,\nErdős\n,\nKakutani\n, Arthur Stone, Dorothy Maharam,\nIrving Segal\n, Bob Thrall, Abe Taub,\nAlfred Brauer\n, and\nDeane Montgomery\n(\nwith whom I soon started collaborating\n)\n. I am not quite sure I have everybody. The permanent members - those famous names that I had never thought of as people:\nHermann Weyl\n,\nOswald Veblen\n,\nMarston Morse\n,\nJ W Alexander\n,\nvon Neumann\n, also\n(\ninvisible, to me at any rate\n)\nGödel\n, and, somehow floating above this group all by himself and out of reach for me, the serene figure of\nEinstein\n. Actually I didn't see much of the permanent members. I wish I had had more contact with\nAlexander\n. He was quite aristocratic, with intensely blue eyes, and rather elusive; but the few times I talked to him he gave me excellent answers to my questions.\nThe United States entered World War II while Samelson was at the Institute of Advanced Study in Princeton but, despite the fact that he was German and the United States was at war with Germany, he suffered little difficulty\n[\n6\n]\n:-\nThere were in that period two people in our group who were not allowed into Fine Hall at the University, myself\n(\nas a German citizen I was an \"enemy alien\" and might endanger the war work being done there\n)\nand\nDavid Blackwell\n(\nas a black American\n)\n.\nOf course it was vital to Samelson that he remain in the United States after the year in Princeton so he applied for every possible position. He received an offer from the University of Wyoming in Laramie and arrived there in September\n1942\nto take up the post\n[\n6\n]\n:-\nLaramie was a hospitable place, interesting and quite different from anything I had known; it consisted in those days of the University people, the railroad people\n(\n\"Union Pacific\"\n)\n, and the people on the other side of the tracks. The teaching load then was\n18\nhours per week. The most interesting mathematical event was a visit and talk by\nG D Birkhoff\n. The year went by fast, and the question of what to do next year came up again. It could have been Laramie, or Smith College where\nDeane Montgomery\nwas on leave now, but it turned out to be Syracuse, New York, where Ted Martin was starting to build up the Mathematics Department. His first appointment was\nPaul Halmos\n. Spurred on by Paul he made me an offer, and Paul persuaded me to accept it. The third member that year was\nAbe Gelbart\n.\nSamelson took up his appointment at Syracuse University in\n1943\n. World War II was still taking place and he was involved teaching in the Army's Specialized Training Program where soldiers attended for a six-week crash course in calculus. However, he now had a permanent position at Syracuse and he could begin to influence building up a strong mathematics department there\n[\n6\n]\n:-\nLife at Syracuse was quite hectic. The idea of building up a department was quite exciting, even though the physical aspect - the somewhat dark and dank basement of the old Hall of Languages - was not so great. ... Many people were coming to the department, for a shorter or longer time. Among them were\nLoewner\n,\nBers\n,\nRalph Fox\n,\nHenry Scheffé\n, Arthur Milgram\n(\nJim Milgram's father\n)\n, and many more later. It almost seemed as if anybody who was anything must have spent some time at Syracuse. We had many discussions whom to approach next and how. Paul was of course quite involved in this, since he was very up to date and in touch with the mathematical community, and Ted Martin listened carefully to his suggestions. It was quite an education for me.\nIn\n1946\nSamelson moved to Ann Arbor and took up an appointment at the University of Michigan. A year later his mother left Germany and joined him in Ann Arbor. Hans' younger brother Franz also came to Ann Arbor and studied social psychology at the University of Michigan. In\n1956\nSamelson married his second wife Nancy Morse. He left Ann Arbor in\n1960\nwhen he took up a professorship at Stanford University. He served as chair of the Stanford Mathematics Department from\n1979\nto\n1982\n. In\n1986\nhe retired and was made professor emeritus.\nLet us look briefly at his outstanding contributions to research\n[\n5\n]\n:-\nHis earliest work was in the area of transformation groups, and, together with\nD Montgomery\n, he published the very influential paper 'Transformation groups of spheres' in the\n1944\nAnnals of Mathematics. In\n1954\nhe described and analyzed one of the first homotopy operations in the seminal paper A connection between the\nWhitehead\nproduct and the\nPontryagin\nproduct. Today, that operation is called the Samelson product. Perhaps Hans Samelson's most important results were contained in his joint work with\nR Bott\n. The most famous of these papers is 'Applications of the theory of Morse to Symmetric Spaces', American Journal of Mathematics,\n1958\n. The ideas developed here lead to some of the most important developments in topology and geometry during the last\n50\nyears. Above all, they were key in\nR Bott\n's proof of the\nBott\nperiodicity theorems.\nAll those interested in\nLie\nalgebras will know Samelson's wonderful book\nNotes on Lie algebras\n(1969)\n. The Preface begins as follows:-\nThese notes are a slightly expanded version of lectures given at the University of Michigan and Stanford University. Their subject, the basic facts about structure and representations of semisimple\nLie algebras\n, due mainly to\nS Lie\n,\nW Killing\n,\nE Cartan\n, and\nH Weyl\n, is quite classical. My aim has been to follow as direct a path to these topics as I could, avoiding detours and side trips, and to keep all arguments as simple as possible. As an example, by refining a construction of\nJacobson\n's, I get along without the enveloping algebra of a\nLie\nalgebra.\n(\nThis is not to say that the enveloping algebra is not an interesting concept; in fact, for a more advanced development one certainly needs it.\n)\nB Kolman begins a review of the book by writing:-\nThe brief set of notes ... deals with the structure and\nrepresentation theory\nof semi-simple\nLie\nalgebras and succeeds in covering a good deal of material. The subject is treated in the classical fashion, concentrating primarily on\nLie\nalgebras over the field\nC\n\\mathbb{C}\nC\nof complex numbers. The arguments lean heavily on linear algebra; the writing style is clear and the presentation is neither too terse nor too lengthy.\nTwenty years after this first edition was published Samelson produced a revised edition. He begins the Preface:-\nThis is a revised edition of my \"Notes on Lie Algebras\" of\n1969\n. Since that time I have gone over the material in lectures at Stanford University and at the University of Crete\n(\nwhose Department of Mathematics I thank for its hospitality in\n1988)\n. The purpose, as before, is to present a simple straightforward introduction, for the general mathematical reader, to the theory of\nLie\nalgebras, specifically to the structure and the\n(\nfinite dimensional\n)\nrepresentations of the semisimple\nLie\nalgebras. I hope the book will also enable the reader to enter into the more advanced phases of the theory.\nSamelson also published a linear algebra text\nAn introduction to linear algebra\n(1974)\n. George Barker writes in a review:-\nThe present text is suitable for a course in linear algebra at the senior or first year graduate level. ...\n[\nIt\n]\nhas features which make it a good choice for a course. The author's style is pleasant to read. The chapters and sections are of reasonable size and each section has a collection of problems. However, the stylistic device of putting definitions and notation within the statements of theorems is one which I feel should be avoided.\nJames Milgram said\n(\nsee\n[\n4\n]\n)\n:-\nHans was a marvellous expositor. His book on\nLie\nalgebras presents all the basic material in a wonderfully compact yet accessible form. In fact, that thin little book has become one of the basic references in the theory. And it was the same when I would go to his office to ask him questions. The answers were always concise, yet got to the heart of what mattered.\nThe quality of his writing, and Milgram's words about his skill in answering questions, would lead one to expect that he would be an excellent teacher and indeed this was the case. He received the Dean's Award for Distinguished Teaching in\n1977\n. In\n1981\n-\n82\nhe served as Section Chair of the Northern California Section of the\nMathematical Association of America\n.\nAway from mathematics Samelson had many other interests. He loved a wide range of music, in particular classical, opera and jazz. He played instruments, in particular the bassoon and recorder. He was a member of a number of local orchestras such as the Mid-Peninsula Recorder Orchestra. He was also interested in politics and made many contributions to various political campaigns of Democrats. Being outdoors was a great joy to him and he often went hiking and skiing. He loved travelling and wrote a number of historical articles, most notably using his mathematical skills to investigate an architectural puzzle in\n[\n7\n]\n. This letter begins:-\nI would like to report an observation on\nBrunelleschi\n's cupola of S Maria del Fiore in Florence that may interest readers of the Journal of the Society of Architectural Historians. It has to do with the curvature of the groin vaults of the cupola. ...\nHe was a Quaker, active in the Palo Alto Friends Meeting after he retired, serving as treasurer for several years. He died peacefully in his sleep of natural causes in Palo Alto.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}