{
  "nome_completo": "Hans Freudenthal",
  "nome_curto": "Hans Freudenthal",
  "ano_nascimento": "1905",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Freudenthal/",
  "lugar_nascimento": "Luckenwalde, Germany",
  "lugar_morte": "Utrecht, The Netherlands",
  "biografia": "Hans Freudenthal\nwas born into a Jewish family, a fact which would have unfortunate consequences for him during World War II. He was educated in Luckenwalde, the town of his birth, where he studied at the\nGymnasium\n. Although he developed an interest in mathematics and science at this stage, he was also interested in literature and read widely from the classics of literature and poetry. In\n1923\nhe entered the University of Berlin to study mathematics and physics. Two important events took place in\n1927\nwhich would influence the direction of his career.\nBrouwer\nlectured in Berlin in that year and the meeting between Freudenthal and\nBrouwer\nwould lead to Freudenthal's career being entirely in The Netherlands. Also in\n1927\n, Freudenthal spent the summer semester at the University of Paris broadening his already broad interests. At the University of Berlin his doctoral supervisor was\nHopf\nand in\n1931\nFreudenthal was awarded his doctorate for a thesis on the theory of ends of\ngroups\nÜber die Enden topologischer Räume und Gruppen\nⓉ\n(\nOn the ends of topological spaces and groups\n)\n.\nBy the time he was awarded his doctorate, Freudenthal was already in Amsterdam having been invited to go there in\n1930\nas\nBrouwer\n's assistant. He soon progressed to become a lecturer at the Mathematical Institute of the University of Amsterdam. Bos writes\n[\n3\n]\n:-\nAfter settling in The Netherlands, he soon commanded the language and developed a versatile, rich, and direct style of writing in Dutch.\nBeing out of Germany had the advantage to Freudenthal that, when the Nazis came to power in\n1933\nand passed legislation to deprive Jews of their jobs, he could continue with his teaching and research in Amsterdam. He wrote important papers on a spectral theorem for\nRiesz\nspaces in\n1936\nand on the suspension theorems in\n1937\n. He was working on the algebraic characterisation of the\ntopology\nof the real semisimple\nLie groups\nin\n1940\nwhen Germany invaded The Netherlands.\nNow being of Jewish background became highly significant. The Nazi invaders now did not allow Freudenthal to continue to undertake his duties at the University. Bos writes\n[\n3\n]\n:-\nHe spent the war years with his young family in Amsterdam in often difficult circumstances.\nIndeed the circumstances were difficult and during this period of German occupation of that city,\n70\n,\n000\nJewish inhabitants were deported, many going to their deaths in the concentration camps. Freudenthal and his family had to remain in hiding. Bos recounts a story in\n[\n3\n]\nwhich illustrates both Freudenthal's literary ability and the difficult circumstances of the war years:-\nHe competed in several literary contests. In one such competition in\n1944\n, Freudenthal's work, a novel, was awarded first prize. But because of the occupation he could not reveal himself as the author. Therefore, the novel was sent in by a friend who had to play, with considerable risk, the role of a prizewinner; at interviews dinners and speeches. But the ruse succeeded and the prize money reached Freudenthal, a most welcome support during the last war year.\nIn May\n1945\nAmsterdam was liberated by Canadian troops and soon after this Freudenthal was able to resume his duties at the university. He was offered the chair of pure and applied mathematics and foundations of mathematics at Utrecht University and he took up his duties there in\n1946\n. He would hold this chair until he retired in\n1975\n.\nIn\n1971\nFreudenthal was appointed as the first director of the Institute for the Development of Mathematical Education in Utrecht. It was an Institute which he founded, and he was to remain its enthusiastic leader for many years. The Institute became part of the Faculty of Mathematics and Computer Science at Utrecht University in\n1981\nand, in September\n1991\n, it was renamed the Freudenthal Institute.\nAs we have indicated, Freudenthal's early work was on topology and algebra. In addition to the topics we mentioned above, we should single out his work on the characters of the semisimple Lie groups between\n1954\nand\n1956\n. However, he later moved into broad areas including the history of mathematics and mathematical education. Adda writes in\n[\n2\n]\n:-\nHis culture was unbounded in scope and he always struggled\n(\nin many languages\n)\nagainst obscurantism. His thoughts and his works went in many complementary directions: mathematics, history of mathematics, mathematics education, philosophy ... . He worked to open mathematics education to everyone and never lost the intellectual requirements of a great scientific thinker. But he was also a man of action and had a great influence on the development of mathematics education research, not only in the Netherlands but also all around the world.\nFreudenthal's work on the history of mathematics included contributing articles to the\nDictionary of Scientific Biography\n. In this archive we have included in our references articles in that publication on\nArbuthnot\n,\nCauchy\n,\nHaar\n,\nHeine\n,\nHermite\n,\nHilbert\n,\nHopf\n,\nHurwitz\n,\nKerékjártó\n,\nKnopp\n,\nLie\n,\nLoewner\n,\nPringsheim\n,\nQuetelet\n,\nRiemann\n,\nSchönflies\n,\nSchottky\n,\nSylow\n, and\nChristian Wiener\n. In addition we have referred to articles he has written on\nHuygens\n,\nLeibniz\n,\nvon Staudt\n,\nEinstein\n,\nBrouwer\n,\nWeyl\n, and\nvan Dantzig\n. A particular interest that Freudenthal had in the history of mathematics was geometry. Bos, in\n[\n4\n]\n, discusses his contributions to the history of geometry around\n1900\n:-\nIn the late\n1950\ns Freudenthal published several articles on the history of geometry around\n1900\n, in particular on\nHilbert\n's innovative approach to the foundations of geometry. In particular, his essay-review of the eighth edition of\nHilbert\n's Grundlagen der Geometrie has become a standard reference in historical studies of geometry.\nHe made many contributions to mathematical education writing books and papers, and giving lectures on \"the learning of mathematics\" and \"the development of mathematical instruction\". He was strongly opposed to the ideas behind the introduction of the \"new maths\".\nFreudenthal studied the relation between axiomatic mathematics and reality, and this study led him to contribute to\nintuitionism\n, as well as to the application of mathematics to linguistics. On this latter topic we should note his work on Lincos, a language designed for cosmic intercourse which he developed between\n1957\nand\n1960\n.\nVeldkamp in\n[\n17\n]\npays a tribute to Freudenthal, writing:-\nMany people who have known Freudenthal will recall his vivid and inspiring personality.\nHe died peacefully, sitting on a park bench while out for his morning walk near his home in Utrecht.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}