{
  "nome_completo": "Hans Reichardt",
  "nome_curto": "Hans Reichardt",
  "ano_nascimento": "1908",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reichardt/",
  "lugar_nascimento": "Altenburg, Germany",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Hans Reichardt\nwas born in Altenburg, a city in central Germany on the Pleisse River, about\n40\nkm south of Leipzig. His father was a medical doctor. Hans attended the Humanistic\nGymnasium\nin Altenburg where he learnt the three ancient languages of Latin, Greek and Hebrew. In\n1925\nhe entered the University of Jena where he studied mathematics, physics and philosophy. He left Jena to spend one semester studying at the University of Königsberg in\n1928\n, after which he went to Berlin where he was taught mathematics by\nLudwig Bieberbach\n,\nRichard von Mises\n,\nErhard Schmidt\nand\nIssai Schur\n. He also attended physics lectures in Berlin given by\nAlbert Einstein\n,\nMax Planck\nand Max von Laue. From this outstanding collection of lecturers, it was\nSchur\nwith his course of lectures on\nalgebraic number theory\nwhich particularly attracted him. He remained in Berlin until the autumn of\n1931\nwhen he went to Hamburg intent on learning more about algebraic number theory. He spent one semester at the University of Hamburg attending lectures by\nErich Hecke\nand\nEmil Artin\n. After this semester, he moved again, this time to the University of Marburg where he took courses on mathematics, physics and philosophy while undertaking research advised by\nHelmut Hasse\n. He was awarded his doctorate in\n1932\nfor his thesis\nArithmetische Theorie der kubischen Körper als Radikalkörper\nⓉ\n(\nArithmetic theory of cubic fields as radical fields\n)\n.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities. This did not affect Reichardt directly but it had a major affect on the lecturers in the universities in which he obtained posts. He joined the NSDAP\n(\ncommonly known in English as the Nazi Party\n)\nin\n1933\n. Three of his papers on algebraic number theory appeared in\n1933\n, namely\nDie Anzahl der durch\n4\nteilbaren Invarianten der Klassengruppe eines beliebigen quadratischen Zahlkörpers\nⓉ\n(\nThe number of invariants divisible by\n4\nof the class group of any quadratic field\n)\n;\nZur Struktur der absoluten Idealklassengruppe im quadratischen Zahlkörper\nⓉ\n(\nOn the structure of the absolute ideal class group in quadratic number fields\n)\n; and a paper based on his thesis\nArithmetische Theorie der kubischen Körper als Radikalkörper\nⓉ\n(\nArithmetic theory of cubic fields as radical fields\n)\n. In\n1934\nhe was appointed to the University of Frankfurt, becoming\nCarl Ludwig Siegel\n's assistant. The Civil Service Law did not affect\nSiegel\nwho was an Aryan\n(\nto use the terminology of the time which\nSiegel\nhated\n)\nand, at this stage it did not affect some other teachers at Frankfurt, namely\nPaul Epstein\n,\nErnst Hellinger\nor\nMax Dehn\nwho, although Jewish, fell under a clause which exempted non-Aryans who had fought for Germany in World War I.\nOtto Szasz\n, however, had been dismissed from his post and had emigrated to the United States. Although\nSiegel\nwas not affected by the Civil Service Law, he hated the Nazi regime and this was the beginning of a very unhappy time for him.\nReichardt's post was only for a one year and, in\n1935\n, he moved to Jena where he was appointed as\nFriedrich Karl Schmidt\n's assistant.\nSchmidt\nhad held a temporary post in Göttingen in\n1933\nand, in the same year succeeded\nRichard Courant\nas editor of Springer-Verlag's famous \"Yellow Series\" of mathematical monographs when\nCourant\nwas dismissed because he was Jewish.\nSchmidt\nwas a Roman Catholic, and not Jewish, but he was quickly out of favour with the Nazis when he refused to remove\nRichard Courant\n's name from the title page of the Springer series. He also maintained contacts with his Jewish colleagues which displeased the Nazis. In October\n1934\nhe had been called to Jena as ordinary professor of mathematics and director of the mathematical institute. One year later, Reichardt was appointed as his assistant. Reichardt spent two years in this position during which time he published four further papers\nDie Diskriminante einer normalen einfachen Algebra\nⓉ\n(\nThe discriminant of a normal simple algebra\n)\n;\nDer Primdivisorsatz für algebraische Funktionenkörper über einem Konstantenkörper\nⓉ\n(\nThe prime divisor thereom for an algebraic function field over a constant field\n)\n;\nÜber Normalkörper mit Quaternionengruppe\nⓉ\n(\nOn normal fields with the quaternion group\n)\n; and\nEine Bemerkung zur vorstehenden Arbeit von F K Schmidt\nⓉ\n(\nA comment on earlierwork of F K Schmidt\n)\n.\nIn\n1937\nReichardt moved again, this time going to the University of Leipzig where he worked under\nBartel van der Waerden\nwho had been appointed professor of mathematics there in\n1931\n. Although working in Germany,\nvan der Waerden\nrefused to give up his Dutch citizenship and this was making his life very difficult around the time Reichardt became his assistant in\n1937\n. Reichardt worked mainly on two particular areas of algebraic number theory, namely on the inverse problem of\nGalois\ntheory and on the rational points on an elliptic curve. In March\n1939\n, he submitted his\nhabilitation\nthesis\nÜber die Diophantische Gleichung\na\nx\n4\n+\nb\nx\n2\ny\n2\n+\nc\ny\n4\n=\ne\nz\n2\nax^{4} + bx^{2}y^{2} + cy^{4} = ez^{2}\na\nx\n4\n+\nb\nx\n2\ny\n2\n+\nc\ny\n4\n=\ne\nz\n2\nⓉ\n(\nOn the diophantine equation ax\n4\n+ bx\n2\ny\n2\n+ c\n4\n= ez\n2\n)\nto the Philosophy Faculty of the University of Leipzig and became a\ndocent\nat Leipzig in\n1940\n. However, by this time World War II had begun with the Germany invasion of Poland in September\n1939\n. During the war Reichardt kept his position on the staff at the University of Leipzig but did war work for the navy and, from\n1943\n, worked in Berlin for Telefunken AG, one of the major producers of electrical and communications equipment. Telefunken played an important part in Germany's war effort, supplying radio transmitters and radar equipment to help defend the country from the Allied bombing attacks.\nAfter the war, from\n1946\nto\n1952\nReichardt was in the Soviet Union, where he worked on problems of missile technology on the island of Gorodomlja in Lake Seliger in the Valdai Hills which is the source of the river Volga. There had been a biological research station on the island of Gorodomlja since\n1928\nbut it was only in\n1946\nthat a research and development facility for space rockets was established there. Reichardt was not the only German working at the research facility, for several German rocket engineers, such as Helmut Gröttrup who had been Wernher von Braun's assistant during his period developing German rockets during World War II, lived and worked there. Reichardt returned to Germany from the Soviet Union in\n1952\nwhen he was appointed extraordinary professor at the Humboldt University in Berlin. In\n1954\nhe became a full professor with a chair which he held until he retired and became professor emeritus in\n1973\n. At the Humboldt University he supervised the doctorates of many students, including Helmut Boseck, Gunter Schwarze, Rolf Sulanke, Helmut Koch, Manfred Peschel, Herbert Frank, Thomas Friedrich, Ernst-Wilhelm Zink, and Andreas Schierwagen. All the students we have named have become university lecturers supervising their own doctoral students. In\n1959\n, in addition to his university chair, Reichardt was appointed as Director of the Institute of Pure Mathematics of the\nBerlin Academy of Sciences\nwhere he also headed the number theory research group. In the\n1960\ns Reichardt was a founding organiser of the Mathematical Olympiad Competitions in the German Democratic Republic.\nReichardt's mathematical interests turned towards\ndifferential geometry\nand later towards the history of mathematics. One of his first publications on the history of mathematics was\nGauss-Gedenkband, herausgegeben anlässlich das\n100\nTodestages am\n23\nFebruar\n1955\nⓉ\n(\nGauss commemorative volume issued on the occasion of the\n100\nanniversary of his death on February\n23\n,\n1955\n)\n(1957)\nin commemoration of the\n100\nth\nanniversary of\nCarl Friedrich Gauss\n's death. Also in\n1957\nhe published the book\nVorlesungen über Vektor- und Tensorrechnung\nⓉ\n(\nLectures on vector and tensors\n)\n. In\n1960\n, in collaboration with\nWilhelm Blaschke\n, he published\nEinführung in die Differentialgeometrie\nⓉ\n(\nIntroduction to differential geometry\n)\n. Reichardt continued his deep interest in\nGauss\nand his contributions, publishing\nGauss und die nicht-euklidische Geometrie\nⓉ\n(\nGauss and non-Euclidean geometry\n)\nin\n1976\n. Ivor Grattan-Guinness writes in a review:-\nThis short book, written as a contribution to\nGauss\ncelebrations in\n1977\n, covers rather more ground than its title suggests, for it starts with the Greek tradition and wends its way through some eighteenth-century figures and\nGauss\nand then on to\nRiemann\nand\nHilbert\n. This is in itself reasonable since\nGauss\nis renowned for his failure to make his insights public. The account is straightforward, and has judicious extracts quoted from\nGauss\n's correspondence and the writings of others. Students may find it an adequate introduction, and draw educational benefit from the models of\n(\npseudo-\n)\nEuclidean geometry given in the last chapter. But those seeking deeper historical information about this history, especially the philosophical aspects which are so prominent in it, will do better among the recent literature to read I Toth's works.\nNine years later, in\n1985\n, Reichardt published\nGauss und die Anfänge der nicht-euklidischen Geometrie\nⓉ\n(\nGauss and the beginnings of non-Euclidean geometry\n)\n. This book contains a reprint of Reichardt's\n1976\nbook\nGauss und die nicht-euklidische Geometrie\nⓉ\n(\nGauss and non-Euclidean geometry\n)\nbut to this had been added reprints of papers on non-euclidean geometry by\nJanos Bolyai\n,\nNikolai Ivanovich Lobachevsky\nand\nFelix Klein\n. He also contributed articles on\nGauss\nto various encyclopaedias, for example the\n1974\nedition of\nEncyclopaedia Britannica\n.\nWe should mention another aspect of Reichardt's contributions, namely his work with the Heinrich-Hertz-Gymnasium in Berlin. The high school was named after the physicist\nHeinrich Hertz\nin\n1961\nbut the school only received its mathematical emphasis in\n1965\nthrough the efforts of Reichardt and his colleague at the Humboldt University in Berlin, Heinrich Grell\n(1903\n-\n1974)\n. Grell had been a doctoral student of\nEmmy Noether\nand had worked at the University of Jena and the University of Halle. However, he had lost his teaching licence in\n1935\nafter being accused of acts of homosexuality. After undertaking war work, he was reinstated and appointed as a professor at the Humboldt University in\n1948\nwhere he was joined by Reichardt four years later. He was also a colleague of Reichardt's in the\nGerman Academy of Sciences\nwhere the two worked closely. Reichardt and Grell were the driving force behind the movement of the Heinrich-Hertz-Gymnasium towards being a specialist mathematics school and, by\n1969\nwhen it moved to new buildings, all classes in the school were mathematically oriented. The school quickly gained an outstanding reputation throughout the whole country.\nReichardt, who became professor emeritus in\n1973\n, received many honours for his contributions. He was elected a corresponding member of the\nBerlin Academy of Sciences\nin\n1962\nand, in the same year, elected a member of the\nGerman Academy of Scientists Leopoldina\n. In\n1964\nhe became a full member of the\nBerlin Academy of Sciences\n. In\n1961\nand again in\n1964\nhe received the National Award for Science and Technology of the German Democratic Republic.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}