{
  "nome_completo": "Hans Grauert",
  "nome_curto": "Hans Grauert",
  "ano_nascimento": "1930",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grauert/",
  "lugar_nascimento": "Haren-Ems, Niedersachsen, Germany",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Hans Grauert\n's parents were Clemens and Maria Grauert. He was born in Haren-Ems which is in Niedersachsen\n(\nLower Saxony\n)\nin the north of Germany close to the border with The Netherlands. He attended primary school, the local Volksschule, in Haren-Ems from the age of six. After five years, the last two of which were made difficult by World War II, he entered the Mittelschule in Haren-Ems in\n1941\n. Hans' four years at this school were war years but when he left at the end of March\n1945\nthe Allied armies had already crossed the Rhine and Germany was close to defeat. It would be almost a year before Grauert could continue his education.\nThe war had ended by the time Grauert began his studies at the\nGymnasium\nin Meppen, a town about\n12\nkm due south of Haren-Ems. He studied at the school from January\n1946\nuntil he graduated in February\n1949\n. Following this he spent the summer semester at the University of Mainz before moving to the University of Münster where he began his studies in the autumn of\n1949\n. He studied at Münster undertaking research towards his doctorate in\n1952\n. After spending time at the Eidgenössische Technische Hochschule Zürich in\n1953\nwhere he was influenced by\nBeno Eckmann\n, he returned to Münster where he submitted his doctoral thesis\nCharakterisierung der Holomorphiegebiete durch die vollständige Kählersche Metrik\nⓉ\n(\nCharacterizing the domains of holomorphy by full Kahler metric\n)\n. He was awarded his doctorate by the University of Münster on\n30\nJuly\n1954\n. His first paper\nMétrique kaehlérienne et domaines d'holomorphie\nⓉ\n(\nThe Kahler metric and areas of holomorphy\n)\nwas published in French in the same year.\nDuring the next year Grauert was able to undertake work supported by grants from Nordrhein-Westfalen and from Deutsche Forschungsgemeinschaft. He published three papers in\n1955\n, namely\nCharakterisierung der holomorph vollständigen komplexen Räume; Zur Theorie der Modifikationen. I.\nⓉ\n(\nCharacterization of holomorphically complete complex spaces; On the Theory of the modifications. I.\n)\nStetige und eigentliche Modifikationen komplexer Räume\nⓉ\n(\nContinuous and actual modifications of complex spaces\n)\n; and\n(\nwith Reinhold Remmert\n)\nFonctions plurisousharmoniques dans des espaces analytiques. Généralisation d'une théorème d'Oka\nⓉ\n(\nFonctions multiply subharmonics in analytic spaces. Generalisation of a theorem of Oka\n)\n. In September\n1955\nGrauert was appointed as an assistant at the University of Münster submitting his habititation thesis there in February\n1957\n. He spent the year\n1957\n-\n58\nat the Institute for Advanced Study at Princeton, then the spring semester of\n1959\nat the Institut des Hautes Études Scientifiques in Paris. His output of published papers was quite remarkable with four papers being published in\n1956\nand six papers in\n1957\n.\nOn\n1\nSeptember\n1959\nGrauert was appointed as an ordinary professor at the University of Göttingen to fill the chair which\nCarl Ludwig Siegel\nhad occupied. At Göttingen he supervised the doctoral studies of\n44\nstudents, see\n[\n3\n]\nfor details, several of whom collaborated with him on major projects. In\n1994\nGrauert's selected papers were published in\n[\n2\n]\n. The papers are arranged under three headings which indicate the main areas of his research: General theory of complex spaces, Levi problem and pseudoconvexity, Fibre bundles, Direct images,\nq\nq\nq\n-convexity and cohomology, Deformation of complex objects, Decomposition of complex spaces, and  Special results\n(\nwhich contains three papers on complex manifolds\n)\n. Other areas on which Grauert wrote papers, but are not included in\n[\n2\n]\n, are hyperbolicity, non-Archimedean function theory and quantum physics. John E Fornaess reviewing the two volume work writes:-\nHans Grauert has been the leading mathematician in the theory of several complex variables in his generation.\nLet us look briefly at some books Grauert has written. Together with Ingo Lieb\n(\none of his doctoral students who obtained his Ph.D. in\n1965)\nhe published\nDifferential- und Integralrechnung. I\nⓉ\n(\nCalculus. I\n)\nin\n1967\n. In the following year Grauert published\nDifferential- und Integralrechnung. II\nⓉ\n(\nCalculus. II\n)\n, this second volume being written jointly with Wolfgang Fischer\n(\nanother doctoral student of Grauert who obtained his Ph.D. in\n1964)\n. Also in\n1968\nthe third volume\nDifferential- und Integralrechnung. III\nⓉ\n(\nCalculus. III\n)\nwas published, this one being a collaboration between Grauert and Lieb. Each volume ran to several editions, for example the fourth edition of the first volume appeared in\n1976\n. In\n1971\nGrauert published\nAnalytische Stellenalgebren\nⓉ\n(\nAnalytical position algebras\n)\nwritten jointly with Reinhold Remmert. The book studies local algebras of complex analytic spaces. K Wolffhardt writes in a review:-\nThe book is written very carefully and precisely. Interesting examples are described in detail. The book is recommended to everyone interested in analytic algebras who has the\n[\nnecessary\n]\nprerequisites ...\nIn\n1974\nGrauert and Klaus Fritzsche\n(\nyet another doctoral student of Grauert who obtained his Ph.D. in\n1975)\npublished\nEinführung in die Funktionentheorie mehrerer Veränderlicher\nⓉ\n(\nIntroduction to the theory of functions of several variables\n)\n. Wells writes:-\nThis text is an excellent introduction to the classical themes of modern several complex variables theory: domains of holomorphy,\nholomorphic\ncomplexity, pseudoconvexity, the ring of convergent power series, analytic subvarieties and the several variables version of the\nMittag-Leffler\nand\nWeierstrass\nproblems ... The development of the basic theory is done very well, with pedagogically careful definitions, motivating examples and precise\n(\nsometimes even a little pedantic\n)\nproofs of various important results. ... The examples in the text are numerous and often excellent, and form a useful core of the text.  ... Overall this book is highly recommended as an introduction to the subject of several complex variables.\nIn\n1977\nGrauert and Remmert published\nTheorie der Steinschen Räume\nⓉ\n(\nTheory of Stein spaces\n)\n(\nan English translation\nTheory of Stein spaces\nappeared in\n1979\nand was reprinted in\n2004)\nand the same two authors published\nCoherent analytic sheaves\nin\n1984\n. In\n1999\nGrauert and Hans-Christoph Grunau published\nLineare Algebra und analytische Geometrie\nⓉ\n(\nLinear Algebra and Analytic Geometry\n)\n. In the book they explain its origin and Grauert's ideas about teaching are also brought out:-\nThis book evolved from a course given by the elder of the two authors in the winter semester\n1987\n/\n88\nat the University of Göttingen, prepared by the younger author and initially published by the Mathematical Institute of the University of Göttingen. ... Note that on one hand we place great importance on geometry, particularly on the interface between geometric visualization and mathematical-logical formulation; on the other hand, we also treat in this book a large part of the basic theory that is needed, say, by students of mathematical economics or physics, even though it only reflects the contents of the first part of the two-semester course 'Analytical geometry and linear algebra'. Much space is occupied by the treatment of systems of linear equations\n(\nthe Gaussian algorithm\n)\n, the theory of determinants and the theory of eigenvalues of linear mappings in 'Euclidean' vector spaces\n(\ntransformation of principal axes\n)\n. It is our goal to proceed quickly to the core of the topics mentioned and thus we deliberately dispense with the greatest possible generality. Numerous examples, which partly resemble solved exercises, are meant to help with the comprehension of new concepts or methods.\nFinally we mention Grauert and Fritzsche's book\nFrom holomorphic functions to complex manifolds\n(2002)\nwhich is a graduate text designed, the authors write:-\n... to give an understandable introduction to the theory of complex manifolds.\nGrauert has received many honours for his outstanding contributions. He had received honorary doctorates from the universities of Bayreuth, Bochum, and Bonn. Among the academies who have elected him to membership we mention the\nGerman Academy of Scientists Leopoldina\n, the\nGöttingen Academy of Sciences\n, and the academies of Mainz, Catania and Munich. He was invited to give a\n30\nminute address to the International Congress of Mathematicians in Edinburgh in\n1958\n, and a one hour address to the International Congress of Mathematicians in Stockholm in\n1962\n. In\n1991\nthe University of Erlangen awarded him the\nvon Staudt\nPrize.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Topology"
  ]
}