{
  "nome_completo": "Harish-Chandra",
  "nome_curto": "Harish-Chandra",
  "ano_nascimento": "1923",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Harish-Chandra/",
  "lugar_nascimento": "Kanpur, Uttar Pradesh, India",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Harish-Chandra\n's mother was Satyagati Seth, who was the daughter of the lawyer Ram Sanehi Seth, and his father was Chandrakishore who was  a civil engineer. Chandrakishore had been educated at the Thomason Engineering College at Roorkee, then entered the Indian Service of Engineers and the first part of his career was\n[\n14\n]\n:-\n... spent in the field, usually on horseback, inspecting and maintaining the dikes of the extensive network of canals in the northern plains.\nSince Harish-Chandra's father spent most of his time travelling around the country inspecting canals, Harish-Chandra spent most of his childhood living in his maternal grandfather's home in Kanpur. Ram Sanehi Seth was a wealthy man with a large house which was home to many of his relatives. Harish-Chandra, despite being a rather weakly child, did sometimes spend time travelling with his father. His education was treated by the family as of the utmost importance\n[\n14\n]\n:-\nA tutor was hired, and there were visits from a dancing master and a music master. At the age of nine he was enrolled, younger than his schoolmates, in the seventh class. He completed Christ Church High School at fourteen, and remained in Kanpur for intermediate college, which he finished at sixteen ...\nHe then attended the University of Allahabad. Here he studied theoretical physics, this direction being the result of reading\nPrinciples of Quantum Mechanics\nby\nDirac\nwhich he found himself in the university library. He was awarded a B.Sc. in\n1941\n, then a master's degree in\n1943\n. Harish-Chandra worked as a postgraduate research fellow on problems in theoretical physics under Homi Bhabha, at the Indian Institute of Science at Bangalore in Southern India. Bhabha had been a student of\nDirac\nin the\n1930\ns. Harish-Chandra began publishing papers on theoretical physics while at Bangalore, and he published a couple of joint papers with Bhabha extending some of\nDirac\n's results. For the first six months he spent in Bangalore he lived with Dr Kale, a botanist from Allahabad, and his wife who had taught Harish-Chandra French when he was an undergraduate. The Kales had a daughter Lalitha who at this time was a young girl, but about eight years later in\n1952\nhe returned from the United States to India and there married Lalitha.\nBhabha and Harish-Chandra's teacher, K S Krishnan at Allahabad University, recommended him to\nDirac\nfor research work at Cambridge which would lead to Ph.D. degree. In\n1945\nHarish-Chandra went to Gonville and Caius College, Cambridge, where he studied for his doctorate under\nDirac\n's supervision. However Harish-Chandra saw comparatively little of his supervisor, giving up attending\nDirac\n's lecture course when he realised that\nDirac\nwas essentially reading from one of his books. He wrote that\nDirac\nwas\n(\nsee for example\n[\n14\n]\n)\n:-\n... very gentle and kind and yet rather aloof and distant. ...\n[\nI decided\n]\nI should not bother him too much and went to see him about once each term.\nDuring his time in Cambridge he began to move away from physics and became more interested in mathematics attending the lecture courses of\nLittlewood\nand\nHall\n. He also attended a lecture by\nPauli\nand pointed out a mistake in\nPauli\n's work. The two were to become life long friends. Harish-Chandra obtained his degree in\n1947\nfor his thesis\nInfinite irreducible representations of the Lorentz group\nin which he gives a complete classification of the irreducible unitary representations of\nS\nL\n(\n2\n,\nC\n)\nSL(2,\\mathbb{C})\nS\nL\n(\n2\n,\nC\n)\n.\nDirac\nvisited Princeton for the year\n1947\n-\n48\nand Harish-Chandra went to the United States with him, working as his assistant during this time. However he was greatly influenced by the leading mathematicians\nWeyl\n,\nArtin\nand\nChevalley\nwho were working there. It was during this year in Princeton that he finally decided that he was a mathematician and not a physicist. He later wrote\n(\nsee for example\n[\n14\n]\n)\n:-\nSoon after coming to Princeton I became aware that my work on the\nLorentz\ngroup was based on somewhat shaky arguments. I had naively manipulated unbounded operators without paying any attention to their domains of definition. I once complained to\nDirac\nabout the fact that my proofs were not rigorous and he replied, \"I am not interested in proofs but only in what nature does.\" This remark confirmed my growing conviction that I did not have the mysterious sixth sense which one needs in order to succeed in physics and I soon decided to move over to mathematics.\nAfter\nDirac\nreturned to Cambridge, Harish-Chandra remained at Princeton for a second year. He spent\n1949\n-\n50\nat Harvard where he was influenced by\nZariski\n. The period\n1950\nto\n1963\n, spent at Columbia University, New York, was his most productive. During this time he worked on representations of semisimple\nLie\ngroups. Also during this period he had close contact with\nWeil\n. When we say that he spent the years\n1950\n-\n63\nat Columbia University we really mean that he was on the faculty there for this period, but it is fair to say that he spent long periods in other institutions. He spent\n1952\n-\n53\nat the Tata Institute in Bombay and it was during this year that he married Lalitha Kale\n(\noften known as Lily\n)\n; they had two daughters\n[\n14\n]\n:-\nLily ... with good spirits, generous affection, patience, and all-round competence was to pamper him for thirty years.\nHe spent\n1955\n-\n56\nat the Institute for Advanced Study at Princeton,\n1957\n-\n58\nas a Guggenheim Fellow in Paris where he was able to work with\nWeil\nand the two often went walking together. He was a Sloan Fellow at the Institute for Advanced Study from\n1961\nto\n1963\n.\nIn\n[\n14\n]\nHarish-Chandra is quoted as saying that he believed that his lack of background in mathematics was in a way responsible for the novelty of his work:-\nI have often pondered over the roles of knowledge or experience, on the one hand, and imagination or intuition, on the other, in the process of discovery. I believe that there is a certain fundamental conflict between the two, and knowledge, by advocating caution, tends to inhibit the flight of imagination. Therefore, a certain naiveté, unburdened by conventional wisdom, can sometimes be a positive asset.\nArmand Borel describes some of Harish-Chandra's contributions in\n[\n6\n]\n. Schwermer reviews that work as well as\n[\n25\n]\nand what follows is taken from these reviews:-\nThe impression one has of Harish-Chandra's work as a whole is one of surprising cohesiveness and uniformity. His primary interests revolved about the representation theory of reductive groups and harmonic analysis on these groups and their related homogeneous spaces. However Harish-Chandra made several attempts to get into\nalgebraic geometry\nor number theory.\nHe has built a fundamental theory of representations of\nLie groups\nand\nLie algebras\n, respectively of harmonic analysis on these groups and their homogeneous spaces. It was Harish-Chandra who extended the concept of a character of finite-dimensional representations of semisimple Lie groups to the case of infinite-dimensional representations; he proved an analogue of\nWeyl\n's character formula.\nSome major contributions by Harish-Chandra's work may be singled out: the explicit determination of the\nPlancherel\nmeasure for semisimple groups, the determination of the discrete series representations, his results on\nEisenstein\nseries and in the theory of automorphic forms, his \"philosophy of cusp forms\", as he called it, as a guiding principle to have a common view of certain phenomena in the\nrepresentation theory\nof reductive groups in a rather broad sense, including not only the real Lie groups, but p-adic groups or groups over adele rings. His scientific work, being a synthesis of analysis, algebra and geometry, is still of lasting influence.\nHarish-Chandra worked at the Institute of Advanced Study at Princeton from\n1963\n. He was appointed IBM-\nvon Neumann\nProfessor in\n1968\n.\nHe died of a heart attack at the end of a week long conference in Princeton, having earlier suffered from three heart attacks, the first being in\n1969\nand the third in\n1982\n. In October\n1983\na conference in honour of Armand Borel was held in Princeton\n[\n14\n]\n:-\n... for the week of the conference,\n[\nHarish-Chandra's\n]\nvigour and force reasserted themselves. Princeton's warm, clear autumn weather prevailed and between lectures at the conference, on a lawn or a terrace of the Institute, he was the centre of a lively crowd, expressing his views on a variety of topics. On Sunday\n16\nOctober, the last day of the conference he and Lily had many of the participants to their home. He was a sparkling host. In the late afternoon, after the guests had departed, he went for his customary walk, and never returned alive.\nHarish-Chandra received many awards in his career. He was a Fellow of the\nRoyal Society\n(1973)\n, a Fellow of the\nNational Academy of Sciences\n(\nUnited States\n)\n(1981)\n, the\nIndian Academy of Sciences\nand the Indian National Science Academy\n(1975)\n. He won the\nCole\nprize from the\nAmerican Mathematical Society\nin\n1954\nfor his papers on representations of semisimple Lie algebras and groups, and particularly for his paper\nOn some applications of the universal enveloping algebra of a semisimple Lie algebra\nwhich he had published in the\nTransactions of the American Mathematical Society\nin\n1951\n. In\n1974\n, he received the\nRamanujan\nMedal from Indian National Science Academy. He was awarded honorary degrees by Delhi University\n(1973)\nand Yale University\n(1981)\n.\nHaving been both a physicist and a mathematician it is interesting to see Harish-Chandra's view of their relationship. This is described nicely in\n[\n14\n]\n:-\nAlthough he was convinced that the mathematician's very mode of thought prevented him from comprehending the essence of theoretical physics, where, he felt, deep intuition and not logic prevailed, and sceptical of any mathematician who presumed to attempt to understand it, he was even more impatient with those mathematicians in whom a sympathy for theoretical physics was lacking, a failing he attributed in particular to the French school of the\n1950\ns.\nHis character is described in\n[\n28\n]\n:-\n... he was a tall, handsome man, who was somewhat reserved, but who possessed a formal courtesy that did not conceal the depth of his feelings and thought. In his early years he liked to paint and later expressed a fondness for the French Impressionists. ... One of his colleagues suggested that Harish-Chandra survives in his work, which faithfully mirrored his personality: intense, lofty, and uncompromising.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}