{
  "nome_completo": "John Harry Schmidt",
  "nome_curto": "Harry Schmidt",
  "ano_nascimento": "1894",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmidt_Harry/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Halle, Germany",
  "biografia": "Harry Schmidt\nwas the son of Hermann Schmidt,  a secondary school teacher, and Henny Kube. The family were members of the Evangelical Lutheran Church. Harry attended a private school in Hamburg from\n1901\nto\n1904\n, then attended the Oberrealschule in Altona-Ottensen until\n1907\n. He completed his high school education at the\nGymnasium\nat Altona which he attended from\n1907\nto\n1913\n.\nIn the spring of\n1913\nSchmidt graduated from high school passing his final examination. Before beginning his university studies he attended courses over the summer of\n1913\nin mathematics, physics and chemistry at the University of Rostock. He then entered the University of Leipzig in the autumn of\n1913\nand began studying physics, chemistry, mathematics and philosophy. World events, however, were to have a major impact on Schmidt's university education. In July\n1914\nAustria-Hungary issued an ultimatum to Serbia and began to attack them on\n28\nJuly. Before the end of the month Russia had begun to mobilise its forces to attack Austria-Hungary and Germany issued an ultimatum to Russia. Both Russia and France began to mobilise on\n1\nAugust and German troops entered Luxembourg on the next day. Germany declared war on France on\n3\nAugust, German troops invaded Belgium which resulted in Britain making an ultimatum to Germany on\n4\nAugust; World War I had begun. The effect of the war on Schmidt was that, as a student with expertise in physics and chemistry, he was required to undertake war work. Part of this war work was for the army, and was carried out in the Physicochemical Institute of the University of Leipzig. He was still able to combine this war work with undergraduate lectures. His mathematics lecturers at Leipzig included\nWilhelm Blaschke\n,\nGustav Herglotz\n,\nOtto Hölder\nand\nKarl Rohn\n. His physics lecturers included Theodor des Coudres.\nIn\n1918\nSchmidt began undertaking research at the University of Leipzig, working towards his doctoral thesis. His thesis advisors were the physicist Theodor des Coudres and the mathematician\nGustav Herglotz\n. He submitted his theoretical physis thesis\nÜber die Möglichkeit und Stabilität von Gleichgewichtszuständen ruhender sowie rotierender Elektronengruppen innerhalb einer im allgemeinen nichtäquivalenten Kugel von homogener positiver Elektrizität\nⓉ\n(\nOn the possibility and stability of equilibrium states of resting and rotating groups of electrons within a generally not equivalent sphere of homogeneous positive electricity\n)\nto Leipzig in\n1919\nand graduated Dr phil on\n11\nApril. He taught in the high school at Altona from\n1919\nto\n1923\nand during this time, on\n16\nDecember\n1921\nhe married Johanna Fernholz from Bochum. A daughter Irmgard was born on\n9\nAugust\n1923\nand a second daughter Gertrud was born in\n1927\n.\nSchmidt published a number of important books between\n1920\nand\n1922\n, in German, English and Italian. In\n1920\nDas Weltbild der Relativitätstheorie. Allgemeinverständliche Einführung in die Einsteinsche Lehre von Raum und Zeit\nⓉ\n(\nThe world view of the theory of relativity. Elementary introduction to Einstein's theory of space and time\n)\nappeared while\nZahl und Form. Leichtfassliche Einführung in die Mathematik\nⓉ\n(\nNumber and shape. An understadable introduction to mathematics\n)\nwas published in\n1921\n. Also in\n1921\nWeltäther, Elektrizität, Materie. Physikalische Fragen der Gegenwart\nⓉ\n(\nCosmic ether, electricity, matter. Physical issues of the day\n)\nwas published as was the English text\nRelativity and the universe. A popular introduction to Einstein's theory of space and time\n. In the following year the Italian text\nLa prima conoscenza della relatività dell' Einstein alla porta di tutti\nⓉ\n(\nThe first knowledge of the Einstein's relativity theory of all\n)\nwas also published.\nIn\n1923\nSchmidt was appointed as professor at the polytechnic institute in Koethen where he remained until\n1937\n. During this time he published the book for which he is best known internationally, namely his work on the aerodynamics of flight\nAerodynamik des Fluges. Eine Einführung in die mathematische Tragflächentheorie\nⓉ\n(\nAerodynamics of flight. An introduction to the mathematical theory of wings\n)\n(1929)\n. Another major publication during these years was his introduction to the theory of the wave equation\nEinführung in die Theorie der Wellengleichung\nⓉ\n(\nIntroduction to the theory of the wave equation\n)\n(1931)\n. He submitted his\nhabilitation\nthesis to the University of Leipzig on\n8\nMay\n1926\n, becoming a\nprivatdozent\n. He was appointed as an extraordinary professor of mathematics at the University of Leipzig in\n1933\n. Of course this was the year in which there were huge political changes in Germany. Hitler came to power in\n1933\nand within a year had proclaimed himself Chancellor and Führer of the German Reich. Germany had no air force since it was forbidden under the\n1919\ntreaty of Versailles signed after World War I. Hitler now ordered the creation of a German air force and began to rapidly expand the army and navy. In January\n1935\nhe regained the Saar region by holding a plebiscite, and in March\n1936\nGerman troops entered the Rhineland. In August\n1936\ntwo year conscription was declared in Germany. From August\n1937\nSchmidt was employed as a ordinary professor for mathematics in the service of the Reich, working at the aviation laboratory in Berlin-Adlershof.\nThis was a difficult period for Schmidt, for his wife died on\n22\nApril\n1941\n. He then employed a housekeeper to look after his home but by the beginning of\n1943\nBerlin began to be bombed by the British. The first daylight raid on Berlin took place on\n30\nJanuary\n1943\n. Schmidt's home was destroyed in a bombing raid in August, before the Battle of Berlin which began in November and saw sixteen bombing raids over the winter of\n1943\n-\n44\n. For a while after his home was destroyed Schmidt lived with friends in Berlin but in December he found a house in Koethen\n(\nAnhalt\n)\n. He continued to work at the aviation laboratory in Berlin until the end of the war. Germany surrendered in May\n1945\nand Allied forces entered Berlin on\n12\nJuly. Schmidt's employment at the aviation research laboratory came to an end.  While he was working at the laboratory Schmidt published, jointly with Kurt Schröder, a comprehensive report on the theory of laminar boundary layers deals with the basic conceptions and equations\nLaminare Grenzschichten. Ein kritischer Literaturbericht. I. Teil. Grundlagen der Grenzschichttheorie\nⓉ\n(\nLaminar boundary layers. A critical literature review. I. part. Fundamentals of boundary layer theory\n)\n(1942)\n. It is worth noting that one of the main features of the report is the fact that it presents the material in a more rigorous way than usual. To get an idea of what was in this major report we give the section and chapter headings:-\nA. The general equations of motion of hydrodynamics:\n1\n. The equation of continuity, the impulse theorem and the\nNavier\n-\nStokes\nequations.\n2\n. The equations of motion in orthogonal curvilinear coordinates.\n3\n. Parallel curves and normals of a plane arc as coordinate lines.\nB. Introduction of the boundary layer equation:\n1\n. The procedure of Prandtl and Blasius.\n2\n. Complements and generalizations.\n3\n. A systematic study of the neglections made in boundary layer theory.\n4\n. A rigorous solution of the\nNavier\n-\nStokes\nequations as an example.\nC. The assumptions of\nvon Kármán\nand Pohlhausen:\n1\n.\nKármán\n's stream function.\n2\n. Pohlhausen's modification of\nKármán\n's assumption.\n3\n.\nKármán\n's integral condition.\nD. The theory of\nvon Mises\n:\n1\n. The fundamental equations.\n2\n. The analogy with heat conduction.\n3\n. The equations of a steady two-dimensional motion with respect to the stream lines and their orthogonal trajectories.\nE. Related ideas:\n1\n. A remark of\nJeffreys\n.\n2\n. R H Smith's theory of the boundary layer based on a minimum principle.\n3\n. Klose's conception of the boundary layer theory as part of a theory of fluids with vanishing viscosity.\nBefore the end of\n1945\nSchmidt was appointed as an ordinary professor to the Martin-Luther University of Halle-Wittenberg. Soon after this appointment he was also appointed as director of the newly reopened Institute for Applied Mathematics. Although he had an appointment in Halle, Schmidt could not find accommodation there so remained living in his house in Koethen which is about\n25\nkm north of Halle. It was a difficult railway journey for Schmidt to have to make every day. It was a journey which he had to make for two and a half years until eventually, in the spring of\n1948\n, he obtained a house in Halle. Sadly, after only a year living in his new home, Schmidt developed tuberculosis and taken to hospital on\n6\nApril. His salary was stopped in July and he received only a small daily sick pay allowance. Even this small allowance was stopped in February\n1950\nsince at that time he was still in hospital. Schmidt then requested that he be allowed premature retirement, but the University of Halle refused his request. In August\n1950\nhe left hospital and returned to his duties as Director of the Institute, although medical advice prevented him from lecturing. He managed to carry out his duties for a further year before his illness became worse again, leading to his death.\nAfter Schmidt died his colleagues completed the manuscript he was writing giving an introduction to vector and tensors. This was published as\nEinführung in die Vektor und Tensorrechnung unter besonderer Berücksichtigung ihrer physikalischen Bedeutung\nⓉ\n(\nIntroduction to vector and tensor with particular attention to their physical meaning\n)\n(1953)\n. The first two chapters give a clear exposition of the elements of vector algebra and calculus with some physical applications. The third chapter deals briefly with tensors as vector triples and as matrices, using the stress tensor as an illustration.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Logic"
  ]
}