{
  "nome_completo": "Harvey Philip Greenspan",
  "nome_curto": "Harvey Greenspan",
  "ano_nascimento": "1933",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Greenspan_Harvey/",
  "lugar_nascimento": "Brooklyn, New York, USA",
  "lugar_morte": null,
  "biografia": "Harvey Greenspan\n's parents were Louis Greenspan and Jessie Scholnick. Louis Greenspan was born in New York City, New York on\n21\nJanuary\n1906\n, the son of parents who were both born in Russia. The family were Jewish with Yiddish as their first language. In both the\n1930\nand\n1940\nCensus, Louis gives his occupation as a cutter-furrier in the fur manufacturing industry. Jessie Scholnick was born in Leeds, England, the daughter of Harris Scholnick\n(1877\n-\n1960)\nand Fannie Bluestein\n(1888\n-\n1926)\n, both of whom were Yiddish speaking and born in Russia. The Scholnick family left England and settled in New York, USA in\n1914\n. Louis and Jessie Greenspan were married in Brooklyn, New York City, New York, on\n9\nMarch\n1927\n. They had two sons and one daughter:\nDonald Greenspan\n, born on\n24\nJanuary\n1928\n, who became a mathematician and has a biography in this archive; Harvey Greenspan, born\n22\nFebruary\n1933\n, the subject of this biography; and Rosalie Greenspan.\nGreenspan was educated in Brooklyn where after his primary education, his secondary education was at the Thomas Jefferson High School, Brooklyn, New York. His brother,\nDonald Greenspan\n, began his university studies of mathematics when Harvey was still at an early stage in his secondary school education. Harvey graduated from the High School in\n1950\nand began studying mathematics at the City College of New York. In\n1953\nhe received his undergraduate degree from the City College of New York and continued his studies at Harvard University where Applied Mathematics was not closely associated with Pure Mathematics but was in the Division of Applied Science. He was awarded his Master's Degree in\n1954\nand continued his studies for a Ph.D. advised by\nGeorge Francis Carrier\n.\nCarrier\nhad been appointed as Gordon McKay Professor of Mechanical Engineering at Harvard University in\n1952\n. Greenspan is a co-author of\nCarrier\n's obituary\n[\n2\n]\nin which it states:-\nGeorge\n[\nCarrier\n]\nwas widely considered one of the best applied mathematicians the United States ever produced. He loved applied problems with complex mathematical models, for which he found ingenious approximations and asymptotic results. He had a quick mind and remarkable physical intuition, which made him much sought after as a consultant to business and government. He could listen to the description of a problem and come up with the solution or an effective approach to the solution in minutes.\nGreenspan was awarded a Ph.D. by Harvard University in\n1956\nfor his thesis\nThe generation of edge waves by moving pressure distributions\n. He published a paper with the same name in\n1956\nwhich contains the following acknowledgement:-\nThe author wishes to thank Professor\nGeorge Carrier\nfor suggesting this problem and for his assistance in preparing this article. The paper is part of a thesis submitted in partial fulfilment of the requirements for the degree of Doctor of Philosophy in Applied Mathematics at Harvard University. The work was sponsored by the Scripps Institution of Oceanography under contract from the Office of Naval Research.\nThe Abstract of the paper is as follows:-\nAn analytical study is made of the resurgent wave motion induced by pressure distributions moving parallel to a straight coast line. The resurgence is shown to consist of an infinite number of edge wave modes; expressions for these modes are given and the wavelengths, frequencies and amplitudes are shown to be in agreement with experimental results. The effects of a Gaussian pressure distribution are analysed. For large-scale disturbances off the east coast of the United States only the fundamental mode is excited. Conditions, such as storm size, speed and distance from shore, for maximum induced wave amplitudes are derived.\nFollowing the award of his doctorate, Greenspan was appointed as an Assistant Professor of Mathematics at Harvard University, a position he held from\n1957\nto\n1960\n. During these years he published six further papers, three of them being joint publications with\nGeorge Carrier\n. The joint papers were\nWater waves of finite amplitude on a sloping beach\n(1958)\n,\nThe magnetohydrodynamic flow past a flat plate\n(1959)\nand\nThe time-dependent magnetohydrodynamic flow past a flat plate\n(1960)\n. The three single author papers from this period were\nOn the breaking of water waves of finite amplitude on a sloping beach\n(1958)\n,\nOn longitudinal motion in a magnetic field\n(1960)\nand\nFlat plate drag in magnetohydrodynamic flow\n(1960)\n.\nGerald Beresford Whitham\n(1927\n-\n2014)\nwas a British born applied mathematician who had studied at Manchester under\nJames Lighthill\n. He moved to the United States and was working at New York University but then moved to the Massachusetts Institute of Technology. Greenspan writes\n[\n16\n]\n:-\nI knew and liked Gerry Whitham; he had offered me a job at New York University, but when he went to the Massachusetts Institute of Technology, I just followed.\nGreenspan was appointed as an Associate Professor of Applied Mathematics at the Massachusetts Institute of Technology in\n1960\n. He joined a strong group of applied mathematicians including Gerald Whitham, Chia-Chiao Lin\n(1916\n-\n2013)\n, Eric Reissner\n(1913\n-\n1996)\nand\nNorman Levinson\n. German born Reissner had studied at the University of Berlin but became a Ph.D. student at  the Massachusetts Institute of Technology advised by\nDirk Struik\n. He taught at MIT beginning in\n1938\n. C C Lin was born in China where he was awarded a first degree in physics but had studied for a Ph.D. at the California Institute of Technology advised by\nTheodore von Kármán\n. He had joined the MIT faculty in\n1947\n. Greenspan writes that the team he joined\n[\n16\n]\n:-\n... were all first rate. It was a most successful start in the formation of the group, a credit to Lin's efforts, but it lasted only two years after I arrived because of the pressures in the mathematics department. Gerry Whitham decided to go to Caltech, which shows you how smart he was: Gerry had correctly assessed the difficulties of doing anything in the mathematics department at MIT and left immediately. ... There's a normal level of disagreement in a department, which is natural. And then there is an abnormal level of disagreement, in which people leave. So the group was collapsing. ... The difficulties were mainly that the pure mathematicians recognised the need for a service group in applied mathematics, not for a research group. They listed applied mathematics as one of perhaps nine areas of pure mathematics, and they had rules which said that every applied mathematician had to have a mathematics degree in his background.\nThis, then, was the problem which Greenspan faced at MIT. He had written in\n1961\n[\n7\n]\n:-\nPure mathematicians, whatever their specialty, have a common attitude and approach to their work that is easily recognised, and generally agreed upon. Unfortunately, there is as yet no general understanding concerning the nature of study and research in applied mathematics. Perhaps the title itself is at fault but no better name has been suggested. Perhaps the confusion arises from the absence of organised schools or departments of applied mathematics at most of our institutes and universities. Whatever the cause, this vibrant, creative and important subject has been badly\n(\nand in part deliberately\n)\nneglected and our national position in the scientific world it not as strong as it should and indeed must be.\nIn collaboration with Lin, he set out to establish what the subject of applied mathematics should include. It should, in their opinion, include statistics, probability, computation, continuum mechanics, stability, wave theory etc. They drew up a document setting out what they believed was the philosophical basis of the subject. In many respects it followed the philosophy which Greenspan had set out in\n1961\n[\n7\n]\n:-\nApplied mathematics is a branch of science which seeks knowledge and understanding of the external physical universe through the use of mathematical methods and scientific inference. The ultimate goal of the efforts of the applied mathematician lies in the creation of ideas, and that bears repeating, in the creation of ideas, concepts, and methods that are of basic and general applicability to the subject in question, be it elasticity, magneto-hydrodynamics, geophysics, biochemistry, information theory or even economics. The ideal applied mathematician is a truly versatile scientist - a specialist in mathematics - with broad and active interests in many scientific areas. There are three principal facets in his approach to any particular problem, each of equal importance. Firstly, he must formulate physical problems in mathematical symbolism. Secondly he must solve the mathematical problems and thirdly he must discuss, interpret and evaluate the results of his analyses. In this respect the applied mathematician resembles the theoretical physicist in both attitude and approach. The differences are often a matter of degree.\nThe dean viewed the document positively and an Institute committee was set up including professors from meteorology, electrical engineering\n(\nClaude Shannon\n)\n, and economics. The applied mathematicians began to organise a separate department, although at this stage it was still part of mathematics and the pure mathematicians objected to almost every proposal the applied mathematicians made.\nIn\n1964\nGreenspan was promoted to Professor of Applied Mathematics. His vision of how applied mathematics should be organised at MIT prevailed and in\n1973\nhe was able to write the article\n[\n8\n]\nexplaining what had been achieved; see part of that document at\nTHIS LINK\n.\nGreenspan became Chairman of Applied Mathematics at MIT as he explained in\n[\n16\n]\n:-\nI took over the chairmanship, effectively in\n1964\nbut officially in\n1965\n. I moved fairly quickly to have the third floor of Building\n2\nconsolidated as a location for applied mathematicians where they could congregate and communicate. I wanted a secretarial staff dedicated to our objectives and interests.\nAnother task that Greenspan took on at this time was setting up a computing laboratory. Recovering space in the basement of their building which was occupied by chemistry, he set up a new computing laboratory. This was soon being much used, particularly by new Ph.D. students.\nOne of his less successful moves\n(\nby his own rating\n)\nwas his involvement in the revamping of MIT's\nJournal of Mathematics and Physics\n. This journal had been founded in\n1921\nand ran until\n1968\nwhen it was replaced by\nStudies in Applied Mathematics\n. The first managing editor was David J Benney\n(1930\n-\n2015)\nwho had studied at MIT for his Ph.D. advised by Chia-Chiao Lin and spent his whole career at MIT, becoming a full professor of applied mathematics in\n1966\n. Greenspan served on the editorial board of\nStudies in Applied Mathematics\nbut clearly, given his comments in\n[\n16\n]\n, he did not consider it a success. He said in the\n2006\ninterview that:-\n... it was supposed to highlight the activities of applied mathematics at MIT. In this regard, it was not a success. It still exists, but it did not serve its purpose. Very few people contributed their best papers to this, because their best papers would then go unread.\nIn\n1968\nGreenspan published the monograph\nThe Theory of Rotating Fluids\n. In the review\n[\n12\n]\nJames Lighthill\nwrites:-\nThe body of science so built up, laying emphasis on comparing theory and experiment for such movements of rotating masses of homogeneous liquid as can he realised in the laboratory, but referring often to specific geophysical phenomena that may be in part illuminated by individual studies of this kind, is excellently described in this well-written book.\nFor a longer extract from\nLighthill\n's review, and extracts of other reviews of this book, see\nTHIS LINK\n.\nThis book led to Greenspan becoming involved in consulting as he relates in\n[\n16\n]\n:-\nI was a long-time consultant in Sweden, for the Swedish manufacturer of centrifuges. I had written a book on rotating fluids and I was asked by people I knew to come to Alfa Laval in\n1980\nand see whether I could help establish a research group. I did, and it became a long-term and very enjoyable association with exceptional young researchers.\nGreenspan had a major impact on the teaching of applied mathematics at MIT, introducing around ten courses himself into the curriculum. Around half of these were at an advanced level and half were aimed at undergraduates. Tensions arose with the pure mathematicians over the teaching of courses such as undergraduate calculus\n[\n16\n]\n:-\nCalculus was fiercely opposed in the department, because the enrolment here was really the strength on which the pure mathematics faculty grew, although they didn't always do terribly well with it. ... But we introduced our own version, nevertheless, as part of a complete professional curriculum. We were not competing in terms of quality - we didn't have the staff for that - but we did offer high quality and a different approach: \"Here's how scientists use mathematics.\"\nIn\n1973\n, as a consequence of teaching this calculus course, Greenspan published the book\nCalculus - An Introduction to Applied Mathematics\nwritten in collaboration with David J Benney. The authors begin their Preface as follows:-\nIn presenting calculus as an introduction to applied mathematics, we begin an educational curriculum whose basic objective is the twofold capability of formulating a problem mathematically and extracting, by any means, useful and desirable information. The selection of subject matter, the emphasis placed, and the priorities assigned are all predicated to this end, and, in a more personal sense, they reflect our experience and judgment as scientists. Accordingly, our values are quite different from those most commonly expressed in mathematics texts. But in a larger sense we really return to the traditional values that marked the vital development and vigorous application of calculus.\nFor a longer extract from the Preface, as well as extracts from a number of reviews, see\nTHIS LINK\n.\nThe book received much praise, for example Stanley Lucas writes\n[\n15\n]\n:-\nAs the authors point out, to learn the calculus \"in principle\" but not be able to use it in practice is useless. It appears that their goal has been met.\nThe book, however, also received some criticism such as\n[\n14\n]\n:-\nWe move from extreme to opposite extreme, passing through moderation, like a pendulum, with maximum velocity. ... The overemphasis on abstraction in undergraduate mathematics of recent times has produced the inevitable \"backlash\" typified, unfortunately, by this text.\nGreenspan retired from his chair at MIT in\n2002\nand was made Professor Emeritus. He had been honoured in\n1966\nwith election to the\nAmerican Academy of Arts and Sciences\nand, in\n1991\n, with an honorary doctorate from the Royal Institute of Technology in Stockholm.\nWe have seen how Greenspan tried over the years to put forward his own ideas about how applied mathematics should be taught. We end our biography with a link to his comments on this which he made in the\n2006\ninterview\n[\n16\n]\nand also those in his January\n1961\naddress to the\nMathematical Association of America\n; see\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus"
  ]
}