{
  "nome_completo": "Heinrich Behnke",
  "nome_curto": "Heinrich Behnke",
  "ano_nascimento": "1898",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Behnke/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Münster, Germany",
  "biografia": "Heinrich Behnke\nwas born in Horn, a suburb of Hamburg, into a Lutheran family. He entered Göttingen University in the autumn of\n1918\nwhere he attended lectures by\nHilbert\n,\nLandau\nand\nHecke\n. In\n[\n4\n]\nBehnke gives some details of Göttingen University at the time he studied there. Behnke began to work under\nHecke\n, so when\nHecke\ndecided to accept the offer of a chair of mathematics at the newly founded university in Hamburg, Behnke was left with a difficult decision. On the one hand he wanted to continue to work with\nHecke\n, but he had no wish to return to his home town. Behnke describes making the decision in\n[\n1\n]\nwhich saw him return to his home town to continue working for his doctorate. He submitted his doctoral thesis\nÜber analytische Funktionen und algebraische Zahlen\nⓉ\n(\nOn analytic functions and algebraic numbers\n)\nto Hamburg and he received the degree in May\n1922\n.\nAfter receiving his doctorate he went to Heidelberg to study during the summer semester. There he met his future wife Aenne Albersheim who was the daughter of a Frankfurt-am-Main Jewish family. Returning to Hamburg in August he was appointed as an assistant and submitted his\nhabilitation\nthesis to Hamburg in the summer of\n1924\nand, now with his lecturing qualification, he began lecturing in Hamburg. Behnke now considered himself to be sufficiently secure financially to marry Aenne Albersheim in the summer of\n1925\n. Sadly Aenne died in childbirth in\n1927\nand Behnke found himself a widower with a child to support, though he still did not have the professorship he needed for permanent employment. At this time the Albersheim family rallied round and looked after Behnke's young son.\nIt was later in\n1927\nthat Behnke received an offer of an ordinary professorship at the Westfälische Wilhelms University of Münster. Again Behnke faced a dilemma. On the one hand it was a great achievement to be offered a full professorship while still a\nPrivatdozent\n, but on the other hand Münster was in a Roman Catholic region of Germany\n(\nand Behnke was a Lutheran\n)\nand it was the smallest Prussian university. Behnke consulted friends and colleagues before making his decision, and finally, when told that 'Münster is better than its reputation', he decided to accept. He still felt nervous as he travelled there to take up his appointment, and this was not helped by his mother-in-law and brother-in-law who travelled with him as far as Kassel but refused to continue the journey to Münster.\nIn Münster, Behnke met Barbara Marshall, a former mathematics student from Münster who came from a Roman Catholic family of intellectuals. They married in\n1932\nand soon after this Behnke's son, who up until then had been looked after by his first wife's family, was brought to Münster to be brought up by his father and stepmother. On\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany. Behnke was an Aryan so was certainly not affected by the Civil Service Law, passed on\n7\nApril\n1933\n, which provided the means of removing Jewish teachers from the universities. However, Behnke's first wife had been Jewish, so his son was half Jewish. This became a constant source of worry to Behnke, who tried to keep this fact secret and, as a consequence, tried his best not to become involved in any political discussions. Of course anti-Semitism was rife in Germany long before the national Socialists came to power, but up to\n1933\nMünster, probably because of its Catholic tradition, had been little affected.\nHenri Cartan\nspoke of his friendship with Behnke who soon built up a vigorous research group in Münster:-\n... Behnke was a friend of mine. My first invitation to go to Germany occurred in May\n1931\n. Behnke was teaching in Münster-in-Westfalen, and he had a lot of students, about\n40\n. I was invited because I had published a note in the Comptes Rendus de l'Académie des Sciences about circled domains, where I had proved quite easily a theorem which had been proved earlier by Behnke, but under certain conditions, in a particular case. So I was invited to give several lectures in Münster.\nPeter Tullen was an assistant of Behnke in Münster.\nHenri Cartan\nsaid:-\nBehnke's assistant in\n1931\n, namely Peter Thullen, was to become one of my best friends. We collaborated and wrote a paper together for the Mathematische Annalen. I always had a good relationship with Thullen.\nBehnke and Thullen wrote the classic text\nTheorie der Funktionen mehrerer komplexer Veränderlichen\nⓉ\n(\nTheory of functions of several complex variables\n)\n(1934)\nwhich was the first systematic survey of the theory of domains in\nC\nn\n\\mathbb{C}^{n}\nC\nn\nor spread over\nC\nn\n\\mathbb{C}^{n}\nC\nn\n, including basic properties of\nholomorphic\nand\nmeromorphic functions\n, continuation problems, the Levi problem, meromorphic functions with prescribed zeros and poles\n(\nCousin problems\n)\n, domains of holomorphy,\nRunge\napproximation, holomorphic mappings and transformation groups.\nThullen was a Roman Catholic who took a major role in Catholic youth organisations until they were disbanded by the Nazis. He left for Rome in October\n1933\ntelling Behnke that he could never return to Germany while Hitler was in power. Indeed he went to Ecuador and did not return to Europe until several years after the end of World War II. Behnke however took a different course of action. As he wrote in\n[\n1\n]\n:-\nHad I known in\n1933\nall that was before us, I would not have had the courage to avoid escaping abroad. Also in the following Nazi years I frequently played with the idea of leaving, until Jewish friends made it clear to me that positions abroad must be kept open for them.\nMathematical life in Münster changed greatly over the years after the National Socialists came to power. When\nHenri Cartan\nvisited Münster in\n1931\nthere were about\n200\nstudents in the elementary mathematics classes. By\n1933\nthere were\n50\nsuch students, and in the following two years there were\n5\nand\n2\nrespectively. However the number of advanced students held up and, not having students studying elementary mathematics meant that research flourished. Behnke wrote\n[\n1\n]\n:-\nThe scientific work of the seminar ran better from\n1935\nto\n1939\nthan at any other time. Here the trust between professors and students was not troubled in the slightest.\nDuring this time three students of Behnke were awarded their doctorates. Friedrich Sommer received his doctorate in\n1936\nand, in\n1937\nKarl Stein and Wolfgang Rothstein received doctorates for their theses\nZur Theorie der Funktionen mehrerer komplexer Veränderlichen; Die Regularitätshüllen niederdimensionaler Mannigfaltigkeiten\nⓉ\n(\nOn the theory of functions of several complex variables; The regular cases of low-dimensional manifolds\n)\nand\nZur Theorie der analytischen Abbildungen im Raume zweier komplexer Veränderlichen ; Das Verhalten der Abbildungen auf glatten analytischen Randhyperflächen\nⓉ\n(\nOn the theory of analytic mappings in space of two complex variables; The behavior of images on smooth analytical hypersurfaces with boundary\n)\nrespectively. Behnke wrote quite a number of joint papers with Stein during the years following World War II. For example they wrote\nEntwicklung analytischer Funktionen auf Riemannschen Flächen\nⓉ\n(\nDevelopment of analytic functions on Riemann surfaces\n)\n(1949)\n,\nKonvergente Folgen nichtschlichter Regularitätsbereiche\nⓉ\n(\nConvergent consequences for non-simple regular spaces\n)\n(1949)\n,\nElementarfunktionen auf Riemannschen Flächen als Hilfsmittel für die Funktionentheorie mehrerer Veränderlichen\nⓉ\n(\nElementary functions on Riemann surfaces as a tool for complex analysis of multiple variables\n)\n(1950)\n,\nDie Singularitäten der analytischen Funktionen mehrerer Veränderlichen\nⓉ\n(\nThe singularities of analytic functions of several variables\n)\n(1951)\n, and\nDer Severische Satz über analytische Fortsetzung von Funktionen mehrerer Veränderlichen und der Kontinuitätssatz\nⓉ\n(\nThe Severan theorem on analytic continuation of functions of several variables and the continuity theorem\n)\n(1954)\n.\nBehnke became an editor of\nMathematische Annalen\nin\n1938\n. In\n1939\nhe became worried about his responsibilities, particularly in regard to\nBlumenthal\nwho was also an editor and had been supported in this role by\nHilbert\ndespite pressure for his dismissal exerted by the National Socialists since\nBlumenthal\nwas Jewish. Behnke wrote to\nHecke\non\n27\nJanuary\n1939\n(\nsee\n[\n2\n]\n)\n:-\nThe statement ... at the end of every volume that I am responsible for the text, today means something quite different from earlier years. ... Today it is a political obligation ... Neither the publisher, nor the other editors can protect me from the fact that I am the first who could be made liable for\nBlumenthal\nworking with us.\nBehnke continued as an editor of\nMathematische Annalen\nuntil the end of\n1972\nexcept, of course, for the years between\n1945\nand\n1947\nwhen the journal ceased publication.\nTravelling was one of Behnke's favourite pastimes and in particular he loved visiting Switzerland. Every year he took his summer holidays there and he was in Chexbres when it became clear that World War II was about the begin. He returned through Germany with difficulty due to mobilisation and by the time he reached Münster the university was closed. This did not stop students working for their doctorates, and in fact this gave professors more time to devote to such matters. After a semester the university reopened but now it was militarised. During the war, however, Behnke's worries about his son increased. He wrote to\nHecke\non\n19\nAugust\n1942\n[\n2\n]\n:-\nYou have certainly already heard of the new measures against half-Jews. According to them my son must now leave school.\nSüss\nwishes to enquire at the ministry whether I will be allowed to send my son to Switzerland. That is thoroughly uncertain and experienced colleagues have warned me. An accusation could still be brought against me on account of paragraph\n71\nof the civil service law if I tried to send him abroad. That could also be seen as an action inimical to the state. Sometimes one must simply doubt the sense of this world. Are we all only here in order to reciprocally torment one another?\nHe continued to teach at Münster and by the time the city was damaged in the first daylight bombing raid by the allies on\n10\nOctober\n1943\n, Behnke was the only professor of mathematics left there. Parts of the university were damaged and the mathematics building became unusable. After Germany was defeated Behnke was appointed as Dean at Münster, holding this position until\n1949\n.\nWe have mentioned above Behnke's classic text written with his assistant Thullen. He also published\nKlassische Funktionentheorie\nⓉ\n(\nClassical complex analysis\n)\nin two volumes, the first appearing in\n1947\n, the second in the following year. He wrote another book with his former doctoral student Friedrich Sommer. This was\nTheorie der analytischen Funktionen einer komplexen Veränderlichen\nⓉ\n(\nTtheory of analytic functions of a complex variable\n)\nwhich was first published in\n1955\nwith a second edition appearing in\n1962\n. The book was based on lectures given by Behnke and Sommer at Münster:-\nIt pursues two objectives. The first is to give a rigorous detailed account of the classical theory of functions of a complex variable for beginning students who have had prior training in classical real analysis. The second is to give an account of the theory of\nRiemann\nsurfaces and analytic functions on\nRiemann\nsurfaces.\nIn\n1956\nBehnke published\nVorlesungen über allgemeine Zahlentheorie\nⓉ\n(\nLectures on the general theory of numbers\n)\nwhich treated elementary number theory from an algebraic point of view. With Hans Grauert, Behnke wrote the paper\nAnalysis in non-compact complex spaces\n(1960)\nwhich was based on a lecture Behnke gave at a conference on analytic functions at Princeton in\n1957\n. It is a continuation of the report by Behnke given at the International Congress of Mathematicians in Amsterdam in\n1954\n.\nIn addition to his work on complex analysis, Behnke wrote many articles on mathematicians. For example he published works on\nWeierstrass\n,\nToeplitz\n,\nReidemeister\n,\nHopf\n,\nAleksandrov\n,\nKlein\n,\nBlumenthal\n,\nvon Neumann\n, and Lorey. He also was a leading expert on mathematical education publishing articles such as\nFreiheit und Autorität im mathematischen Leben\nⓉ\n(\nFreedom and authority in mathematical life\n)\n(1972)\nwhich considers the professor-student relationship and the way in which a framework, like the\nErlanger program\n, may be immensely stimulating and yet end by being stifling and having to be discarded. Also\nDie Autonomie der Geometrie\nⓉ\n(\nThe autonomy of geometry\n)\n(1971)\nwhich considers the way that geometry is taught in schools.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}