{
  "nome_completo": "Heinrich Scholz",
  "nome_curto": "Heinrich Scholz",
  "ano_nascimento": "1884",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scholz/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Münster, Germany",
  "biografia": "Heinrich Scholz\n's father was a Lutheran minister. Scholz studied theology with Adolf von Harnack at the University of Berlin and, in\n1911\n, wrote an\nHabilitation\nthesis on the philosophy of religion and systematic theology. He then studied philosophy with Richard Falckenberg at the Friedrich-Alexander University of Erlangen-Nürnberg and was awarded a doctorate in\n1913\nfor his dissertation\nSchleiermacher und Goethe; Ein Beitrag zur Geschichte des deutschen Geistes\nⓉ\n(\nSchleiermacher and Goethe; A contribution to the history of the German spirit\n)\n.\nIn\n1917\nScholz was appointed to the chair of Philosophy of Religion at the University of Breslau. He remained there for four years before accepting the Chair of Philosophy at the University of Kiel in\n1921\n. This marked an important change in the direction of Scholz's research for at this time his interests turned towards mathematical logic. From his own account, this new interest came about because he accidentally came across\nWhitehead\n's and\nRussell\n's\nPrincipia Mathematica\nin\n1921\n. Volker Peckhaus writes\n[\n8\n]\n:-\nScholz recognized that this work provided what he had been looking for in vain for so long. It exercised a decisive influence on the subsequent course of his personal life, as he stressed. This work persuaded Scholz of the importance of mathematics for philosophy, although he had at that time no deeper knowledge of this science.\nHowever, another factor in his change in interests was undoubtedly\nOtto Toeplitz\n.\nToeplitz\nhad been an extraordinary professor of mathematics at Kiel in\n1913\nand had become an ordinary professor in the year before Scholz arrived in Kiel. Although researching into\nHilbert spaces\nand spectral theory,\nToeplitz\nhad broad mathematical interests and encouraged Scholz's growing passion for foundational questions in mathematics. In\n[\n3\n]\nSegal suggests that Scholz's love of structure was also important in his move into mathematical logic:-\nScholz's feeling for structure was no small thing. He apparently felt that when having guests for dinner:\n(1)\nno more than six people should be invited;\n(2)\nthere must be an excellent menu;\n(3)\na discussion theme must be planned; and\n(4)\nthe guests should have prepared themselves as much as possible beforehand on this theme.\nWhile he was at Kiel, Scholz's first wife died in\n1924\n. He confessed to his philosopher friend Eduard Spranger while at his wife's grave:-\nYou understand how I am not able to work on things with content.\nOf course for someone like Scholz, who had trained in theology and then philosophy, mathematical logic involved a deep understanding of mathematics which he had never studied. He rectified this by taking an undergraduate degree in mathematics and theoretical physics at Kiel while at the same time carrying out his duties as Professor of Philosophy. In\n1928\nScholz left Kiel and moved to Münster where he was initially appointed as Professor of Philosophy.\nHeinrich Behnke\nhad been appointed as an ordinary professor of mathematics at Münster in\n1927\nand, following Scholz's arrival, the two became good friends. One reason for this may have been the fact that both were Lutherans recently arrived in Münster which was in a Roman Catholic region of Germany.\nRight from the time he arrived at Münster, Scholz worked towards building a school of mathematical logic there. He gave lecture courses on mathematical logic and also lectured on the great philosophers. In\n1931\nhe published\nGeschichte der Logik\nⓉ\n(\nHistory of logic\n)\n, a short but erudite study, which looks at the history of results in logic leading to the study of mathematical logic. A N Prior, reviewing the English translation published thirty years later, writes that Scholz:-\n... pioneered the view that ancient and medieval logic was not something totally different\n(\nfor better or for worse\n)\nfrom what modern logicians are doing by mathematical means. The author was one of the first to see clearly that there is no better aid than modern logic to make clear what\nAristotle\n, the Stoics, the Schoolmen and also a few post-Renaissance figures like\nLeibniz\n, were really after.\nAlso in\n1931\nScholz published the article\nÜber das Cogito, ergo sum\nⓉ\n(\nOn 'Cogito, ergo sum'\n)\nwhich, as the title indicates, examines\nDescartes\n' Cogito argument. In\n1940\nScholz published the\n55\n-page pamphlet\nWas Ist Philosophie? Der Erste und der Letzte Schritt auf dem Wege zu Ihrer Selbstbestimmung\nⓉ\n(\nWhat Is Philosophy? The first and the last step on the way to your self-determination\n)\n.\nPaul Bernays\nwrites that Scholz says\n[\n4\n]\n:-\n... in his concluding summary that the philosophy which he intended is neither more nor less than mathematical logic, axiomatics ... Apparently his view is that foundational research must first attain a more advanced stage, and at the same time the minds of philosophers must, in the school of mathematical logic and axiomatics, be turned to the spirit of clearness and precision - whose compatibility with philosophical profundity is stressed by Scholz in opposition to a frequent opinion - before a valuable speculative synthesis can be hoped for.\nAs we indicated above, Scholz's aim was to establish a world centre of mathematical logic at Münster. He was successful in attracting some top quality doctoral students such as Friedrich Bachmann who was awarded his doctorate in\n1933\n. Other doctoralstudents who went on to become leading researcher include Hans Hermes\n(\ndoctorate in\n1938)\nand Gisbert Hasenjaeger\n(\ndoctorate in\n1950)\n. Scholz made an important step in that direction when he obtained\nFrege\n's estate for Münster in\n1935\n. By this time his research team at Münster were being referred to as \"the Münster school of mathematical logic.\" The Technical University of Karlsruhe held\nErnst Schröder\n's papers and Scholz was also successful in adding these to the growing collection of resources of his school\n[\n8\n]\n:-\nIt was one of the tragic events of war that\nFrege\n's and\nSchröder\n's papers were most probably destroyed during the bomb attacks on Münster in March\n1945\n.\nIn\n1938\nScholz's professorship in Philosophy had its title changed to a professorship in the Philosophy of Mathematics and Science. Its title was changed again in\n1943\nto the Chair of Mathematical Logic and Foundational Questions in Mathematics.\nThe rise to power of the Nazis in Germany was, at first, pleasing to Scholz. He was a conservative nationalist, actually described by his friend\nBehnke\nas a \"small-minded Prussian nationalist\".\nBehnke\navoided discussing political issues with him since he quickly realised that such topics were difficult. In some ways the Nazi laws against the Jews helped Scholz establish Münster as an important centre for logic since the leading researchers in the other centres of Berlin and Göttingen were forced out. However, Scholz cared deeply about his colleagues and soon got himself into trouble by trying to help those facing cruel persecution by the Nazis.\nJan Salamucha, who had been professor of theology at Kraków, was sent to the concentration camp in Sachsenhausen in\n1940\n. On\n14\nMarch\n1940\n, Scholz sent a petition to the education department in the occupied region of Poland seeking Salamucha's release. In October of that year Scholz received a letter from the Education Minister telling him in no uncertain terms that his petition had \"injured the national honour\" and the minister expressed his \"sharpest disapproval\" and told Scholz that he was forbidden from sending any further petitions unless they had the minister's approval. However Salamucha was released, but did not survive the war being murdered by the Nazis in\n1944\n. Despite the warning Scholz had received from the Education Minister he continued to try to help those in difficulty.\nAlfred Tarski\nhad escaped to the United States but his wife remained in Warsaw. Scholz tried to assist them in making contact. He had corresponded with\nJan Łukasiewicz\nfrom\n1938\nand helped him and his wife Regina to leave Poland and hide in Germany.\nHowever, Scholz was able to play the system to the advantage of mathematical logic by keeping on good terms with Nazis like\nBieberbach\n. Max Steck had published a book entitled\nThe main problem of mathematics\nin\n1942\nin which he bitterly attacked the formalist approach to mathematics. He deeply opposed\nHilbert\n's approach which he described as Jewish - the worst possible insult in Germany at this time.\nBieberbach\nasked Scholz to write an article for\nDeutsche Mathematik\n(\nBieberbach\n's racially oriented journal\n)\nto answer the attacks on formalism in Steck's book. This may seem surprising since\nBieberbach\nled the Nazi mathematicians' attack on Jewish mathematics. However, perhaps exactly for this reason he wanted to make sure that\nHilbert\nwas not considered \"Jewish.\" Scholz wrote\nWhat does formalised study of the foundations of mathematics aim at?\nfor publication in\nDeutsche Mathematik\n. Scholz's connections with\nBieberbach\nhad led earlier to funds being provided for a series of monographs on mathematical logic which had started in\n1937\n. That Scholz had received this funding had upset Steck who had attacked it in his\n1942\nbook writing:-\nWhat Scholz has understood is doubtless this, to obtain from the German State huge amounts of publication money for this logic production. We fundamentally reject this logic which praises the English empiricists and sensory philosophers such as the Englishmen Locke,\nBerkeley\n, Hume, and by now find it really time to speak for once about the \"Great Germans\".\nDuring the war years Scholz published the book\nMetaphysik als strenge Wissenschaft\nⓉ\n(\nMetaphysics as rigorous science\n)\n(1941)\nand a number of articles such as\nLeibniz und die mathematische Grundlagenforschung\nⓉ\n(\nLeibniz and basic mathematical research\n)\n(1942)\n,\nWas will die formalisierte Grundlagenforschung?\nⓉ\n(\nWhat will happen to formalized basic research?\n)\n(1943)\nand\nPascals Forderungen an die mathematische Methode\nⓉ\n(\nPascal's claims on the mathematical method\n)\n(1945)\n.\nScholz remained as head of the Institute for Mathematical Logic and Foundational Research at Münster until he retired in\n1952\n. He published a number of major books towards the end of his career:\nVorlesungen über Grundzüge der mathematischen Logik\nⓉ\n(\nLectures on fundamentals of mathematical logic\n)\n(1950)\n; and\n(\nwith H Hermes\n)\nMathematische Logik\nⓉ\n(\nMathematical logic\n)\n(1952)\n. Both receive some criticism from reviewers.\nHaskell Curry\n, reviewing the first of these writes:-\nThis is a treatise on the classical\n(\ntwo-valued\n)\npropositional algebra and the predicate calculus of first order based on it. The author's point of view may be described as semantical. He presupposes \"eine präzisierte Metasprache für welche die zu formalisierende Logik verbindlich ist.\" As he points out in the preface, this implies a certain metaphysical bias. The fundamental idea is that of semantical \"Allgemeingültigheit\", i.e. validity for every possible model. The author develops both the algebra and the calculus from this point of view; the deductive, axiomatic standpoint is not considered at all for the algebra, and is relegated to a secondary role for the calculus. For the algebra this amounts to a treatment from the matrix point of view; but for the calculus it entails that the line between constructive and nonconstructive results is not as sharply drawn as one would expect in a modern work. ...\nReviewing the\n1952\ntext,\nGeorg Kreisel\nwrites:-\nThis monograph treats the propositional calculus, the predicate calculus of first order with and without identity ... The technical parts are clear and concise; the authors' \"semantic\" point of view is described too briefly to be very coherent. The authors state\n(\ni\n)\nthat mathematical logic is intended to provide a precise\n(\nr\n)\nformulation of the notion of consequence on which mathematical theories are based,\n(\nii\n)\nthat they consider those mathematical theories which fall within the scope of two-valued logic 'where every proposition is true or false'. There is no clear indication which branches of mathematics satisfy this condition; it seems that abstract algebras and other axiomatic theories do, intuitive geometry and numerical arithmetic, called a 'kind' of calculus ..., apparently do not.\nGisbert Hasenjaeger whose thesis had been supervised by Scholtz, produced a book\nGrundzüge der mathematischen Logik\nⓉ\n(\nPrinciples of mathematical logic\n)\nin\n1961\nwhich was jointly authored with Scholz despite being published five years after Scholz's death.\nScholz was survived by his second wife, Erna.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}