{
  "nome_completo": "Heinrich Friedrich Karl Ludwig Burkhardt",
  "nome_curto": "Heinrich Burkhardt",
  "ano_nascimento": "1861",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burkhardt/",
  "lugar_nascimento": "Schweinfurt, Germany",
  "lugar_morte": "Munich, Germany",
  "biografia": "Heinrich Burkhardt\nwas born in Schweinfurt, a city in the Franconia region of Bavaria in Germany; the city had become part of the Kingdom of Bavaria in\n1814\n. His father was Carl Heinrich Theodor Burkhardt, who worked as an assessor in the district court,  and died when Heinrich was six years old. He and his younger sister were raised by his mother Caroline Louise née Heyde in her native town of Ansbach. Burkhardt attended the\ngymnasium\nin Ansbach, also in Franconia, before entering university to study mathematics in\n1879\n. At this time the standard pattern for German students was to study at a number of different universities and this was precisely the route followed by Burkhardt. He studied first at the University of Berlin where he attended lectures by\nKarl Weierstrass\n, then at the University of Göttingen where he was taught by\nHermann Schwarz\n, and at the University of Munich where he studied under\nAlexander von Brill\n. He obtained his doctorate from the University of Munich in\n1887\nwith his dissertation\nBeziehungen zwischen der Invariantentheorie und der Theorie algebraischer Integrale und ihrer Umkehrungen\nⓉ\n(\nRelations between the invariant theory and the theory of algebraic integrals and their inverses\n)\n. His thesis supervisor at Munich was Gustav Bauer.\nBurkhardt was appointed to the post of assistant at the University of Göttingen in\n1887\nand he\nhabilitated\nthere in\n1889\n. During his time in Göttingen he also spent a few months in Paris\n(\nwinter\n1893\n/\n94)\nin order to attend lectures by\nPoincaré\n,\nPicard\nand\nFélix Tisserand\n.\nIn\n1897\nBurkhardt was appointed to an ordinary professorship at the University of Zürich, succeeding Arnold Meyer\n(1844\n-\n1896)\n. His inaugural lecture was entitled\nMathematisches und naturwissenschafltiches Denken\nⓉ\n(\nMathematical and natural sciences thinking\n)\n. In the same year of\n1897\nhe married Mathilde Büdinger, daughter of Max Büdinger\n(1828\n-\n1902)\nwho had been professor of history at Zürich and Vienna. Perhaps Burkhardt is best known as one of\nAlbert Einstein\n's examiners. In\n1905\nEinstein\nsubmitted his thesis\nOn a new determination of molecular dimensions\nto the University of Zürich and Burkhardt was appointed to examine the thesis. In his report he stated:-\nThe mode of treatment demonstrates fundamental mastery of the relevant mathematical methods. ... What I checked, I found to be correct without exception.\nFrom Zürich, Burkhardt moved to a chair at the Technical University of Munich in\n1908\n. In Munich he was made an extraordinary member of the Bavarian Academy of Sciences in\n1909\nand then an ordinary member in\n1912\n.\nHis main work was in analysis, particularly the theory of trigonometric series, and on the history of mathematics. Other topics on which Burkhardt published papers included\ngroups\n,\ndifferential equations\n,\ndifferential geometry\nand mathematical physics. One of his papers, published in\n1888\n, was\nBeiträge zur Theorie der hyperelliptischen Sigmafunctionen\nⓉ\n(\nContributions to the theory of hyperelliptic sigma functions\n)\n. Other papers include:\nTheorie der Cremonatransformationen\nⓉ\n(\nTheory of Cremona transformations\n)\n(1892)\n,\nÜber Vectoranalysis\nⓉ\n(\nOn vector analysis\n)\n(1896)\n,\nMathematisches und naturwissenschaftliches Denken\nⓉ\n(\nMathematical and scientific thinking\n)\n(1902)\n,\nÜber Reihenentwicklungen nach oszillierenden Funktionen\nⓉ\n(\nOn series expansions by oscillating functions\n)\n(1903)\n,\nZu den Funktionen des elliptischen Zylinders\nⓉ\n(\nOn functions of the elliptical cylinder\n)\n(1906)\n, and\nMathematische Miszellen aus der Vorlesungspraxis\nⓉ\n(\nMathematical miscellany from the lecture practice\n)\n(1913)\n.\nHe published a two-volume work\nEinführung in die Theorie der analytischen Functionen einer complexen Veränderlichen.\nⓉ\n(\nIntroduction to the theory of analytic functions of a complex variable\n)\nin\n1897\nand\n1899\n. The first volume is subtitled\nFunctionentheoretische Vorlesungen\nⓉ\n(\nFunction-theoretic lectures\n)\nand was reviewed by\nMaxime Bôcher\n[\n2\n]\nwho writes:-\nThe object of the author in writing the little volume before us has been to furnish an introduction to the theory of functions which is not confined to the presentation of the methods of any one school\n(\nCauchy\n,\nWeierstrass\n,\nRiemann\n)\nbut blends these methods as far as possible into an organic whole. The author has been very successful in making his book an introduction not merely to those parts of the theory which have long been classical\n(\nalgebraic, elliptic, and\nAbelian functions\n)\nbut also to the many other important developments of the last thirty years. The mathematical public may well congratulate itself that a mathematician so thoroughly familiar with all sides of the subject as is Professor Burkhardt has undertaken the task of writing an elementary work along these lines.\nThe second volume, which was published in\n1899\n, was subtitled\nElliptische Functional\nⓉ\n(\nElliptic functionals\n)\n. This volume was reviewed by\nJames Pierpont\nwho writes\n[\n9\n]\n:-\nThe theory of\nelliptic functions\nhas developed so rapidly and in so many different directions in recent years that an elementary treatise of moderate compass which would afford a rapid survey of its many and heterogeneous parts has been a long felt want. ... The present volume meets the wants ... most successfully ....\n[\nof\n]\nthose who regard the theory of elliptic functions as merely one division of a greater theory and who thus study the elliptic functions not only on account of the interesting properties they offer per se, but also as a means of becoming more familiar with the principles and methods of the theory of functions, or as a stepping stone to the more abstruse theories of the abelian transcendents and automorphic functions. We are so impressed with its many merits that we do not hesitate to predict for it a rapid and widespread popularity.\nThe characteristic feature of the book is the predominance it gives to the ideas of\nRiemann\n. It is indeed remarkable, as Professor Burkhardt observes, that up to the present time no work on the elliptic functions has treated the theory from\nRiemann\n's standpoint. In several works on this subject we find reference to some of\nRiemann\n's ideas; but with the exception of\nThomae\n's 'Abriss' they are cursory and inadequate. We feel sure that this novel and valuable feature will be widely appreciated. Another feature of the work is its comprehensiveness, accompanied by very moderate proportions. There is something so encouraging to the student in a textbook of moderate size. The main divisions of the theory have received attention in accordance with their relative importance. By seeking everywhere the simplest form of treatment, Professor Burkhardt has succeeded in compressing a great deal into a very small compass. The student who reads this book with care will gain a very good idea of the modern theory of elliptic functions, in spite of the gigantic size this theory has assumed.\nThis work was very popular and further editions where published by Burkhardt in\n1903\n,\n1907\n, and\n1912\n. Then in\n1921\n, G Faber, who succeeded Burkhardt at the Technische Hochschule in Munich, supervised the publication of a further edition of Burkhardt's text. The fourth edition of\n1912\nwas translated into English by S E Rasor, Professor of Mathematics at Ohio State University, and published as\nTheory of functions of a complex variable\nin\n1913\n.\nIncluded among Burkhardt's historical works are\nDie Anfange der Gruppentheorie und Paolo Ruffini\nⓉ\n(\nThe beginnings of group theory and Paolo Ruffini\n)\n(1892)\nand\nEntwicklungen nach oscillierenden Funktionen und Integration der Differentialgleichungen der mathematischen Physik\nⓉ\n(\nDevelopments after oscillitary functions and integration of the differential equations of mathematical physics\n)\n(1904\n-\n8)\n. This latter work is rather chaotic, with unconnected textual quotations following each other, but nevertheless it is very useful as a historical source. It includes details of\nCauchy\n's work in a number of different areas. In\n1907\nBurkhardt published\nVorlesungen über die Elemente der Differential-und Integralrechnungen und ihre Anwendungen zur Beschreibung von Naturerscheinungen\nⓉ\n(\nLectures on the elements of differential and integral calculations and their applications to the description of natural phenomena\n)\nwhich was written as an introductory text for students of chemistry, mineralogy, and statistics.\nThe founders of the\nEncyclopädie der Mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\nwere\nWilhelm Meyer\n,\nHeinrich Weber\n,\nWalther von Dyck\nand\nFelix Klein\n. Early on, before even the title of the encyclopaedia had been decided,\nKlein\nproposed that Burkhardt be invited to join the committee. This committee had quite a difficult time since Burkhardt,\nKlein\n,\nvon Dyck\nand particularly\nMeyer\n, never seemed to agree readily on any of the important decisions. However, the encyclopaedia proved highly important and influential. Burkhardt collaborated with\nWilhelm Meyer\nas joint authors of the article on\npotential theory\nwhich they wrote for the\nEncyclopädie\nin\n1899\n. Burkhardt wrote several other important articles for the\nEncyclopädie\nincluding\nTrigonometrische Reihen und Integrale\nⓉ\n(\nTrigonometric series and integrals\n)\n.\nThe first International Congress of Mathematicians was held in Zürich in\n1897\n.\n[\n5\n]\nAt the committee meeting for the first International Congress of Mathematicians on\n21\nJanuary\n1897\n,\nGeiser\ncould announce that Burkhardt had agreed to sign the invitation to the congress. After that meeting he was also asked to join the reception committee. He attended most of the committee meetings in\n1897\n. Burkhardt was the only professor from the University of Zürich on the organising committee.   Burkhardt also attended the\n1904\nICM in Heidelberg and the\n1912\nICM in Cambridge. As a member of the international committee of the latter he represented the Royal Bavarian Academy of Sciences in Munich.\nZygmunt Janiszewski\n,\nIsabel Maddison\n,\nLudwig Berwald\n, and\nEdward Van Vleck\nare among the many students that Burkhardt taught, and these four are included in this archive.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}