{
  "nome_completo": "Henri Cabannes",
  "nome_curto": "Henri Cabannes",
  "ano_nascimento": "1923",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cabannes/",
  "lugar_nascimento": "Montpellier, Hérault, France",
  "lugar_morte": "Saint-Cyr-sur-Mer, Var, France",
  "biografia": "Henri Cabannes\nwas the son of the physicist Jean Cabannes\n(1885\n-\n1959)\nand Marie Fabry\n(1893\n-\n1976)\n. Jean Cabannes specialised in optics and was trained in the laboratory of the physicist Charles Fabry\n(1867\n-\n1945)\nin Marseille. Charles Fabry's brother, the mathematician Eugène Fabry\n(1856\n-\n1944)\n, was the father of Marie Fabry. Jean Cabannes's studies were interrupted by military service during World War I after which he returned to Charles Fabry's laboratory in Marseille to complete his thesis. He then moved to Montpellier where he married Marie on\n29\nMarch\n1921\n. Henri was one of his parents' four children.\nIt was in Montpellier that Henri Cabannes began his schooling. He studied first at the Lycée de Montpellier and then at the Lycée Saint-Louis in Paris. The family had moved to Paris in\n1937\nwhen Jean Cabannes was appointed as a professor in the Faculty of Science in Paris. Henri entered the École Polytechnique in\n1941\nwhile he was still a pupil in the special preparatory Mathematics class at the lycée Saint-Louis. He then entered the École Polytechnique for a second time when he completed his studies at the lycée but resigned and entered the École Normale Supérieure in October\n1942\n.\nOne has to understand the situation in France at this time since this was in the middle of World War II. The War had begun on\n1\nSeptember\n1939\nwith the German invasion of Poland. On\n3\nSeptember France declared war on Germany. In May\n1940\nGerman troops invade Holland, Belgium and Luxemburg moving on to France. German troops entered Paris on\n14\nJune and on\n22\nJune the Franco-German Armistice was signed. This limited the amount of France occupied by German troops and set up a French government in Vichy which cooperated with Germany. We quote Cabannes writing about being in Paris in\n1942\n[\n3\n]\n:-\nIn\n1942\nI was in a class at the lycée Saint-Louis with Jean-Claude Pecker. On\n7\nJune, some of our comrades, including Pecker, arrived at the school with a yellow star. Pecker and I passed the written and then the oral entrance examination to the École Normale Supérieure. The oral ended for the candidates of the occupied zone on\n14\nJuly\n1942\n. Pecker immediately tore off his yellow star and the next morning, we left both from Saint-Lazare station for Saint-Germain. We went camping on the land of a brave farmer whose address Pecker had. On\n16\nJuly, the French police arrested all Jews in the Paris region and brought them together at the Vélodrome d'Hiver before sending them to Drancy and then to Germany. After a week, the roundup being over, we returned and Pecker went to an unoccupied zone where he lived under a false name.\nEarly in\n1943\nthe Germans conducted a census of Frenchmen aged\n21\nto\n31\nand began to call up Frenchmen born in\n1920\n,\n1921\nand\n1922\nto be sent to Germany to undergo military training. Cabannes, being born in\n1923\n, was not affected by this but, nevertheless, he decided to interrupt his studies at the École Normale Supérieure and try to reach England or North Africa.\nFor Cabannes' own detailed account of his escape to Spain, then North Africa and finally Britain, see\nTHIS LINK\n.\nThe war ended in May\n1945\nand by July Cabannes was back in France. He had left in\n1943\nbefore taking his examinations on rational mechanics so he prepared for this and, after being demobbed on\n21\nOctober he was examined three days later. He passed the Rational Mechanics certificate and completed his bachelor's degree. He then undertook one further year of study at the École Normale Supérieure.\nIn\n1946\nhe was appointed as a Research Associate at the Centre National de la Recherche Scientifique. He now undertook research for his doctorate advised by\nJoseph Pérès\n. He had already published several papers, the first being\nApplication des fractions continues à la formation de nombres transcendants\nⓉ\n(\nApplication of continued fractions  in the formation of transcendental numbers\n)\n(1944)\n. He writes about this paper in\n[\n2\n]\n:-\n... during my stay in Britain, I wrote an article on the application of continued fractions to the formation of transcendental numbers; the relations between France and England being restored, I sent this article to my father, who submitted it to the \"Revue Scientifique\", in which it was published.\nHe published a second paper on continued fractions,\nÉtude des fractions continues ayant leurs quotients en progression arithmétique ou en progression géométrique\nⓉ\n(\nStudy of continued fractions with quotients in arithmetic progression or geometric progression\n)\n(1945)\n, before embarking on the topic for his doctorate.\nIn\n[\n3\n]\nCabannes explains how he chose the area for his research:-\nIn the Air Force, first in Morocco, but especially in England in the Royal Air Force, I had seen the very important progress made in aviation and aeronautics. Fortunately the Germans had failed to realise the importance of the atomic bomb, but in the field of aeronautics they surpassed the Allies. As early as\n1944\n, they had built the flying bombs, the V\n1\ns, which I saw coming crashing down on London, then the V\n2\ns, which I heard crashing on London. The Messerschmitt factories in Augsburg had made the first jet planes, which were used at the beginning of\n1945\n. There was already talk of supersonic flights, and the year\n2000\nwas scheduled for landing on the moon. I thought that by working in fluid mechanics, I would participate in the progress of aeronautics and I asked\nJoseph Pérès\nto direct my research and my first thesis.\nPérès\ntold me that since\n1939\n, France had continued in the study of incompressible fluids, which was sufficient when planes were flying at\n300\nkilometres an hour, but had become insufficient, especially for the future. He therefore advised me to study the German works on the subject and to make a thesis. At the time I had not yet forgotten the German language, which I had learned in high school, and the French had recovered the maximum number of documents in their zone of occupation in Germany and Austria. The aeronautical documents were entrusted to the Office National d'Etudes et de Recherches Aérospatiales\n(\nO.N.E.R.A.\n)\n, the National Office for Aeronautical Studies and Research, which met at regular intervals with German engineers housed in a hotel. I was invited to these meetings; I was a beginner on the subject and later realized that many of the questions I asked were quite naive. But, following\nPérès\nvery judicious advice, on\n5\nFebruary\n1950\n, I submitted the doctoral thesis 'Contribution a l'étude théorique des fluides compressibles. Écoulements transsoniques. Ondes de choc'\nⓉ\n(\nContribution to the theoretical study of compressible fluids. Transonic flow. Shockwaves\n)\n. What a difference from the way that theses are done today, where thesis advisors feed their students with a teaspoon!\nWhile he was undertaking the research for his doctorate Cabannes published seven papers:\nApplication du calcul symbolique à l'étude de la dynamique des fils\nⓉ\n(\nApplication of symbolic calculus to the study of dynamics of strings\n)\n(1948)\n;\nÉtude des écoulements gazeux au voisinage de la vitesse du son\nⓉ\n(\nStudy of gaseous flows in the vicinity of sound velocity\n)\n(1949)\n;\nÉcoulement potentiel discontinu d'un fluide parfait compressible\nⓉ\n(\nDiscontinuous potential flow of a compressible perfect fluid\n)\n(1949)\n;\nDétermination approchée de l'onde de choc détachée\nⓉ\n(\nApproximate determination of the detached shock wave\n)\n(1949)\n;\nÉtude de la singularité au sommet d'une onde de choc attachée, dans un écoulement à deux dimensions\nⓉ\n(\nStudy of singularity at the top of an attached shock wave in a two-dimensional flow\n)\n(1949)\n;\nSur l'onde de choc attachée lorsque la vitesse aval à la pointe de l'obstacle est subsonique\nⓉ\n(\nOn the shock wave attached when the downstream speed at the tip of the obstacle is subsonic\n)\n(1950)\n; and\nCalcul de la courbure au sommet de l'onde de choc attachée dans un écoulement de révolution\nⓉ\n(\nCalculation of the curvature at the top of the shock wave attached in a revolution flow\n)\n(1950)\n.\nIn addition to this remarkable publication record, Cabannes had married Madeleine Lebon. Henri and Madeleine were both Roman Catholics and met at the Catholic youth gatherings. Cabannes writes\n[\n3\n]\n:-\nIn\n1948\n, a classmate, Madeleine Lebon, and I got married. At the time the two schools Ulm and Sèvres were separated, but promotional outings were an opportunity to get to know each other and were at the origin of several marriages.\nIn\n[\n1\n]\nYvonne Choquet-Bruhat\ntells us a little about Madeleine Lebon:-\nMadeleine had passed the scientific competitive exam, but once at the École Normale Supérieure she had decided to follow studies in philosophy, which was allowed by the rules. She hence did what I had considered and that brought us closer. Madeleine Lebon was a full believer, brought up in a practicing Catholic family where she was happy. She was also very close to her brother and sister. \"I have never doubted\", she told me one day. My mother pointed out to me that that assertion is not very compatible with the profession of philosopher. Madeleine was, however, a very intelligent woman who had passed, with \"very good\", both the scientific and literary baccalaureate, a feat I had not managed. As the Aggregation of philosophy did not offer many positions, she had not been admitted to it. She had considered a re-conversion to mathematics - my entire class had been successful at the competitive exam - when marriage and children convinced her to remain a housewife.\nHenri and Madeleine Cabannes had five children, Jean-Pierre, Jean-Paul, André, Hélène, and Benoît. We say more about Madeleine and the children below.\nCabannes's doctoral thesis was examined by Henri Villat,\nJoseph Pérès\nand\nGeorges Valiron\n. After the award of his doctorate, he published his thesis in\n1952\nbut we note the quantity of research output that he produced around that time for, following the seven papers listed above, he had published another eight papers before his thesis was published. In\n1950\nhe was appointed as an assistant lecturer in mathematics at the Faculty of Science in Marseille. In the same year he became an external collaborator with the Office National d'Etudes et de Recherches Aérospatiales\n(\nO.N.E.R.A.\n)\n. In\n1952\nCabannes was promoted to Professor of Rational Mechanics at the Faculty of Science in Marseille and in the following year he became a member of the council of the\nFrench Mathematical Society\n.\nWe said above that we would give more details of the Cabannes' children.\nYvonne Choquet-Bruhat\nwas appointed to Marseille in\n1953\nand met up with the Cabannes\n[\n1\n]\n:-\nI had been happy to find, in Marseille, my friends Henri and Madeleine Cabannes. Madeleine was always optimistic, persuaded of the goodness of God in spite of the problems caused by her second son who, she told me, was not \"well come\". The baby Jean-Paul did not tolerate any dairy product, except Roquefort. The courage and perseverance of Madeleine ensured his survival. In fact Jean-Paul was what was then called a mongoloid. In\n1953\n, the chromosomal origin of this handicap, trisomy twenty-one, was not known. Madeleine spent considerable energy on her son, thinking that assiduous material and intellectual care would make him an ordinary man. She even took him for a Bogomoletz treatment, and persevered in her hope in spite of its failure. Unfortunately, Jean-Paul was a severe case. It is now known that the severity of the harmful effects due to the supernumerary chromosome\n21\ndepends on the location where it is attached to the other two. To her deep regret, pushed by her husband, Madeleine had to resign herself to placing the adolescent Jean-Paul in an appropriate facility in the interest of her other four children, all \"well come\".\nCabannes spent\n9\nmonths as a Visiting Professor at Laval University, Quebec, Canada during\n1956\n-\n57\n.\nThe three children André, Hélène, and Benoît were born while Cabannes was still working at the Faculty of Science in Marseille.\nYvonne Choquet-Bruhat\nwrites about them in\n1957\n-\n8\n[\n1\n]\n:-\nThe Cabannes already had, besides the Down syndrome sufferer Jean-Paul, two boys: Jean-Pierre - a few months older than Michelle\n[\nYvonne Choquet-Bruhat's daughter\n]\n- and André - a few months younger - and a girl of little more than a year, Hélène. In the fall of\n1957\n, they had a fifth child, a charming baby, Benoît. It was the time of the baby boom. Madeleine, a devout Catholic, would still want other children, but as she had to have surgery for a fibroma, it stopped her pregnancies. Henri was rather glad of that; he said, \"Five is good.\" Madeleine was helped by a very nice girl living at their home, but her baby, the little Hélène and Jean-Paul did not let her be idle. The two elders went to the public school in Saint Cyr, but still demanded a lot of time from their mother. Madeleine came each morning to take Michelle and drive her to school with her sons. Jean-Pierre and André were half-boarders but I picked Michelle up to have lunch together. ... In general, Madeleine went in the afternoon to pick up the children from school.\nIn\n1960\nthe Cabannes family moved from Marseille to Paris when he was appointed Professor of General Mechanics at the Faculty of Sciences of Paris. We have details of what Cabannes taught since he published\nCours de mécanique générale\nⓉ\n(\nGeneral mechanics course\n)\nin\n1962\n.\nWilliam Prager\nwrites in a review:-\nThis excellent text corresponds to the course that the author teaches at the Sorbonne. The contents are best indicated by the following titles of chapters and abbreviated headings of sections.\nPart I. General Mechanics: Kinematics\n(\nvectors, velocities, accelerations\n)\n; Kinetics\n(\nmass distributions, quantities associated with velocities, quantities associated with accelerations\n)\n; Principles of mechanics\n(\nfundamental law, momentum theorems, search for absolute frames of reference, special theory of relativity\n)\n; Problem types\n(\nstatics, dynamics, impact, friction\n)\n; Work and power\n(\ndefinitions and basic properties, theorem of virtual velocities, units\n)\n; Differential equations\n(\nmethods of integration, linear equations, oscillations\n)\n; Analytical mechanics\n(\nLagrangian equations for holonomic and non-holonomic systems, stability of equilibrium, small oscillations\n)\n; Rigid bodies\n(\ngeneral theory, gyroscopes\n)\n.\nPart II. Introduction to fluid mechanics: Microscopic aspects\n(\nconcepts of statistical mechanics, hypotheses of kinetic theory, equations of kinetic theory, macroscopic equations\n)\n; Macroscopic aspects\n(\nintegral form of equations of motion, equations for continuous motions, equations for discontinuous motions\n)\n.\nThe presentation has the clarity that is a characteristic of French texts in this field; vector and tensor equations are used wherever this is advantageous.\nIn\n1966\nCabannes published the collection of exercises\nProblèmes de mécanique générale\nⓉ\n(\nGeneral mechanical problems\n)\nand in the same year published a second edition of\nCours de mécanique générale\nⓉ\n(\nGeneral mechanics course.\n)\n.\nHe spent\n3\nmonths as a Visiting Professor at Brown University, Providence, U.S.A. in\n1967\nand\n3\nmonths as a Visiting Professor at the University of California at Berkeley, U.S.A. in\n1968\n. Cabannes was appointed as Professor of General Mechanics at the Pierre and Marie Curie University\n(\nParis\n6)\nin\n1969\n. He continued in this role until he retired in\n1990\n. He also served as Director of the Theoretical Mechanics Laboratory\n(1975\n-\n79)\n.\nCabannes made a second trip to the University of California at Berkeley in\n1980\nand delivered a set of lectures on the discrete Boltzmann equation as part of a graduate course in the Mechanical Engineering Department. These were later published as\nThe discrete Boltzmann equation\n(\ntheory and applications\n)\n.\nEvariste Sanchez-Palencia gives the following summary of Cabannes' mathematical contributions\n[\n4\n]\n:-\nThe scientific work of Henri Cabannes revolved around various topics. Each theme occupied him exhaustively for periods of five to ten years, where personally he worked hard, while increasing contacts and collaborations in France and abroad, and supervising young researchers, who often pursued the area once he had opened the next.\nTopics:\n1\n. Aerodynamics. Shockwaves attached and detached from obstacles.\n2\n. Magnetodynamics of fluids.\n3\n. Kinetic theory of gases. Determination of viscosity and conductivity from particle kinetics.\n4\n. Discrete kinetic theory. Existence of solutions.\n5\n. Vibrating ropes with obstacle or solid friction. Periodic and near-periodic solutions.\nThroughout his career, Cabannes received many honours. For example, he was awarded the Montyon prize for mechanics by the\nAcadémie des sciences\nin\n1960\n, He became a Corresponding Member of the\nAcadémie des Sciences\nin\n1983\nand a full member in\n1991\n. He was awarded the Agostinelli Prize by the\nAccademia Nazionale dei Lincei\nin\n1993\nand became a laureate of the Alexander von Humboldt Foundation in\n1995\n. For his efforts during World War II, he was made Chevalier de la Légion d'honneur, Officier de l'Ordre National du Mérite, Commandeur des Palmes Académiques, and holder of the Médaille des Évadés.\nIn\n2002\nCabannes was interviewed by the Romanian \"Magazin Istoric\" and asked \"At present, what do you recommend to young Europeans?\". For his reply, see\nTHIS LINK\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}