{
  "nome_completo": "Henry Coley",
  "nome_curto": "Henry Coley",
  "ano_nascimento": "1633",
  "ano_morte": "1704",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coley/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "London, England",
  "biografia": "Henry Coley\nwas the son of an Oxford joiner. John Aubrey writes\n[\n6\n]\n:-\nMy friend Mr Henry Coley was born in Magdalen parish in the city of Oxford,\n18\nOctober\n1633\n. His father was a joiner over against the Theatre.\nWe have modernised the English spelling in Aubrey's quote but kept other details as in the original. This means that his date of birth is that given by the Julian calendar which was used in England at this time. If we correct his date of birth to the present Gregorian calendar, it is\n28\nOctober\n1633\n.\nBefore we go any further with Coley's biography, let us record that he became a famous astrologer. Astrology is the belief that the positions of the stars and planets influences the lives of people. There are different aspects: natal astrology produces a horoscope based on a person's precise moment of birth; horary astrology tells people the best time make personal decisions; and world astrology studies how celestial positions relate to the fate of nations. There is, of course, no evidence to support this quite false belief so one might ask why an astrologer merits an entry in our collection of biographies of mathematicians. The answer is that astrology played a part in the development of both mathematics and astronomy. Astrologers had to have considerable mathematical skills to carry out their trade, so many also taught mathematics, but it was a lucrative job with kings, nobles and important people willing to pay astrologers handsomely, so it provided a way of funding those with mathematical abilities. Although not entirely a good comparison, military research today leads to mathematical progress and, being supported financially in a big way by governments, provides an indirect way to support mathematics. Many mathematicians and astronomers from the fifteenth, sixteenth and seventeenth centuries were interested in astrology, including\nJohn Napier\n,\nJohn Dee\n,\nThomas Fincke\n,\nIsaac Newton\n, and\nJohannes Kepler\n.\nWe know only a little about Coley's life. Some of what is known was recorded by Coley himself as astrological accidents. These include the fact that he suffered from smallpox when he was nine years old, then in the following year,\n1643\n, he nearly died as the result of an epidemic. The background to this was the civil war with the King and Royalist troops based in Oxford and the Parliamentarian forces in London. An epidemic hit both armies and after some fighting and a siege of Oxford, the disease became the cause of more deaths than the fighting. The epidemic spread quickly to the people around Oxford, and Coley was one of the many who contracted the disease. He recovered although many others died. When he was fourteen years old he suffered from ague, a malaria type of illness with severe fever and shivering. Again he recovered and, once back to health in\n1648\n, he joined the Parliamentarian forces, not as a soldier but rather taking on administrative duties as a clerk. Although we have no record of his education, it is clear that in taking on clerical duties at the age of fourteen he must by this time have received a fairly solid basic education. His duties as a clerk were essentially those of personal secretary to 'a Person of Military Command' in the Parliamentarian forces.\nAfter four years as a clerk, he decided that he would seek more satisfactory employment and became a tailor. On\n1\nApril\n1654\nhe moved from Oxford to London where he set up business as a ladies tailor in Gray's Inn Lane. He continued in this trade but began teaching himself mathematics, astrology, Latin and French. Although we would give no credence to a horoscope written as a prediction, we have no reason to doubt the correctness of the facts concerning his life recorded in the horoscope\n[\n2\n]\nwritten well after his death:-\nIt will be noticed that Mars is in the house of wedlock, and the aphorism. \"Mars in the seventh either causes discordance in marriage, or early death of the partner,\" is well borne out in this case, for he married his first wife on\n1\nst May\n1656\n...\nIt was not a very happy marriage, they had a son in\n1657\nbut his wife died soon after this. He remarried on\n24\nApril\n1660\n(\nthe date is given in\n[\n2\n]\n)\nand this, according to Kendal\n[\n10\n]\n, was a \"reasonably happy\" marriage although again there was a tragedy when their son, born in September\n1661\n, died when six days old. Coley's studies of mathematics and astrology led to his first major publication\n[\n5\n]\n:-\n... in\n1669\nhe published the fruits of his astrological studies asÂ 'Clavis astrologiae, or, A Key to the Whole Art of Astrology'.Â Its second part,Â 'Genethliaca',Â has a separate title-page and carries the date\n1668\n. Though described as merely an introduction, the work is a thorough and systematic account of nativities and the practice of horary astrology, explaining for the first time, for English readers, the innovations of\nKepler\nin this branch of astrology. It was very well received. A massively expanded second edition followed in\n1676\n, with\n750\npages of text and a further hundred pages of astronomical data drawn from\nKepler\nand\nJean-Baptiste Morin\n. It was dedicated to Elias Ashmole and carried a glowing tribute by William Lilly, who hailed it as complementing and completing his ownÂ 'Christian Astrology'Â\n(1\nst edn,\n1647)\n.\nIn\n1663\nColey moved to a house in Baldwin's Gardens, Baldwin's Court, off Gray's Inn Lane, where he taught mathematics and astrology. He even provided boarding for some of his pupils and also offered his services there to those who wished to make use of his mathematical or astrological skills. He began to advertise himself as a mathematics teacher in his annual almanac which he began to publish in\n1672\n:\nArts and Sciences Mathematical Professed and Taught by the Author\nHENRY COLEY, Philomath., at his House in Baldwins Court over against the Old Hole in the Wall, in Baldwins-Gardens, near Grays-Inn-Lane.\nArithmetick.\nIn Whole Numbers and Vulgar Fractions. Decimals and by Logarithms.\nGeometry.\nThe Rudiments thereof; also the Demonstration and Practice, according to the best Authors.\nAstronomy.\nThe Use of the Globes, Celestial and Terrestrial.\nTo Project the Sphere in Plano to Any Latitude several ways. To Calculate the Longitude and Latitude of the Planets, with their Declination and Ascension. Also the true Time, Quantity, and Duration of Eclipses of the Luminaries for any time past or to come.\nTrigonometry.\nWith the Application of the several Cases thereof in the most useful Questions in Geometry, Astronomy, Geography, Navigation, Dialling, &c.\nNavigation.\nIn either of three principal kinds of Sailing, viz. by the Plain and Mercator's Chart. Great Circle.\nDialling.\n1\n. Geometrically\n2\n. Instrumentally\n3\n. Arithmetically by The Sector, and other convenient Scales. The Logarithms, Sines, and Tangents.\nSurveying.\nSeveral ready ways to measure a plot, and divide Land, &c. also the taking of Altitudes, Profundities, Distances, &c. together with the Mensuration of all manner of Superficies, as Boards, Glass and Pavement; also all Solids; viz. Timber, Stone, &c. Regular and Irregular.\nGauging.\nTo find the just quantity of Liquor in any Cask, whether full or partly empty. Also the content or solidity of Brewers Vessels, &c Tuns, Coppers, Backs, Coolers, &c.\nAstrology.\nIn all its parts, and according to the best Authors, with several varieties therein, not known to every Professor.\nThe author of the horoscope\n[\n2\n]\nwrites:-\nI believe him to have been a smart mathematician, quick at figures, and a good teacher\n(\nhe was by profession a schoolmaster, I believe\n)\n...\nColey's mathematical skills were well known and he was consulted by many including\nEdmond Halley\nwho asked Coley to assist him in calculating the moon's parallax. He also assisted his friend Joseph Moxon\n(1627\n-\n1691)\nwho acknowledged Coley's contributions to his book\nMathematicks made easy, or, A mathematical dictionary explaining the terms of art and difficult phrases used in arithmetick, geometry, astronomy, astrology, and other mathematical sciences wherein the true meaning of the word is rendered, the nature of things signified discussed, and\n(\nwhere need requires\n)\nillustrated with apt figures and diagrams: with an appendix exactly containing the quantities of all sorts of weights and measures, the characters and meaning of the marks, symbols, or abbreviations commonly used in algebra and sundry other observables\n(1679)\n.\nWe noted above that Coley began publishing an annual almanac in\n1672\n. Later editions contains interesting material:-\nHis almanac for\n1687\ncontained mathematical calculations by Sir\nJonas Moore\n, and the\n1691\nedition featured a brief discussion of gravitation, referring readers to\nIsaac Newton\nfor further information.\nWe certainly learn much about Coley's character from these almanacs and in\n[\n5\n]\nsome of his most interesting remarks are noted:-\nColey took a warm interest in the reform of astrology, a lively issue in the second half of the century, arguing that it must be founded on experiments like other sciences. His own interests lay mainly in the refinement of nativities and of horary astrology. On judicial astrology, especially concerning politics, he was more cautious than many of the other leading practitioners of his time. His almanacs offered mostly vague and innocuous prophecies for England and western Europe, though he was happy to promise 'vast slaughter' of Turks and Tartars in\n1684\n. More typically he remarked that Whig astrologers were rash to predict the death of Louis XIV, 'for Kings and Princes have long Arms, and can reach a person when he least expects it'. At home his almanacs preached obedience to the government of the day, with varying degrees of enthusiasm. The\n1685\nedition gave full details of the Popish Plot, but he had no difficulty in hailing 'Great James' the following year and remained obedient to the very end of James's reign. The edition for\n1690\n, however, took a strongly protestant, patriotic line, and by\n1692\nhe was hailing William III as 'Our King by Miracle, as well as Right', and predicting that he would lead his victorious armies to the very heart of popish France. In the late\n1690\ns Coley drew attention to the still bolder predictions of his former pupil John Holwell and others that a millennial age was at hand: a messianic emperor arising in the north would crush France and bring about the ruin of Rome and conversion of the Turks and Jews. Characteristically Coley remained noncommittal, observing cautiously, 'let our own Experience confirm or contradict'.\nAn astrologer who gained considerable fame a few years before Coley was William Lilly\n(1602\n-\n1681)\n. Catherine Blackledge writes\n[\n3\n]\n:-\nComing from a humble farming family, he\n[\nLilly\n]\nrose by his own efforts to become the most famous man in England - more acclaimed than Charles I or Oliver Cromwell. He was a publishing sensation and the nation's first ever media darling\n(\ncelebrated in print and song\n)\n, thanks to his bestselling pamphlets containing uncannily accurate forecasts about events of national importance. During the Civil War, he was a key figure consulted at the highest level by the King and Parliament, as well as by the radical sects. His astrological intelligence on the timing of critical battles helped win the war for Parliament.\nLilly and Coley had great respect or each other and, when Lilly became ill, Coley assisted him\n[\n11\n]\n:-\nThe\n7\nth of November\n1675\n, he\n[\nLilly\n]\nwas taken with a violent fit of vomiting for some hours, to which a fever succeeded, that continued four months: this brought his body exceeding low, together with a dimness in his eyes,Â which after occasioned him to make use of Mr Henry Coley, as his amanuensis, to transcribe\n(\nfrom his dictates\n)\nhis astrological judgments for the year\n1677\n; but the monthly observations for that year, were written with his own hand some time before, though by this time he was grown very dim-sighted. His judgments and observations for the succeeding years, till his death,\n(\nso also for the year\n1682\n,\n)\nwere all composed by his directions, Mr Coley coming to Hersham the beginning of every summer, and stayed there, till, by conference with him, he had dispatched them for the press; to whom, at these opportunities, he communicated his way of judgment, and other astrological arcanas.\nLilly wrote \"To the reader\" for the second edition of Coley's\nClavis astrologiae\n(1676)\n:-\nI am now near seventy four years of age complete, and after much sickness and indisposition of body in my old age\n(\nespecially these two years last past\n)\nI am now by the blessing of God upon the means used, reasonably well recovered again; and it was all along my intention\n(\nfor the benefit of all honest and grateful Sons of Urania\n)\nwhat many years since I promised in my Introduction to Christian Astrology: but this Author\n(\nbeing the only public person that I have hopes of\n)\nhath now with no small pains and industry, saved me that labour, in presenting the world with this most complete piece of astrology, which\n(\nnot improperly\n)\n, he entitles A KEY to the whole ART, wherein, in my judgment, he hath showed himself an ARTIST, and very much obliged all the younger students therein, who may hereafter\n(\nGod willing\n)\nreceive much more benefit by his studies.\nAubrey writes about Coley in\n[\n6\n]\n:-\nHe is a man of admirable parts, and more to be expected from him every day: and as good a natured man as can be. And comes by his learning merely by the strong impulse of his genius. He understands Latin and French: yet never learned out his grammar.\nAs to his death let us record that Coley's notebook still exists in the Bodleian Library, Oxford, containing material which is\n[\n1\n]\n:-\n... partly astrological and mathematical, partly miscellaneous\n(\ndates of deaths, pieces of poetry, proverbs, philosophy, and the like\n)\n. The writer's name is at fol.\n72\n, and dates between\n1690\nand\n1695\noccur.\nPerhaps because nothing is dated later than\n1695\nin the notebook, some give\n1695\n(\nfor example\n[\n1\n]\n)\nor\n1695\n?\n(\nfor example\n[\n8\n]\n)\nas the date of his death. The reference\n[\n4\n]\n, however, gives\n1704\nwhile Bernard Capp\n[\n5\n]\ngives an exact date\n30\nApril\n1704\nwithout giving a source. Despite the lack of a source, we have accepted Capp's date.",
  "math_areas": [
    "Algebra"
  ]
}