{
  "nome_completo": "Henry Scheffé",
  "nome_curto": "Henry Scheffé",
  "ano_nascimento": "1907",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scheffe/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Henry Scheffé\n's parents were Henry and Minnie Scheffé. They were both German, born to German parents, they were both originally from Alsace, but had emigrated to the United States in\n1901\nand\n1902\nrespectively. Henry Sr. had been born around\n1870\nwhile his wife Minnie was about ten years younger than her husband. The family lived in New York and Henry, the subject of this biography, had a brother Walter who was about six years younger born on\n19\nSeptember\n1913\nin New York City. Walter became an electrical engineer, a Coast Guard veteran and a ham radio operator. He died on\n12\nDecember\n2005\nat the age of\n92\n. Henry's father, Henry Scheffé Sr., was a baker by trade but lost his job during the depression and he was forced to sell apples on the street corner to save the family from starvation. It was a time of great suffering and\n[\n1\n]\n:-\n... the memory of this injustice and of his father's suffering remained with Scheffé throughout his life.\nWhen he was three years old Henry suffered a broken nose; it affected his appearance throughout his life. He attended elementary school in the Bronx, New York, where the family were still living at the time of the\n1920\nUS Census but shortly after this the family moved to Islip Town, Suffolk county, Long Island, New York where Henry attended High School. Mathematics was not the first area to interest Scheffé and, after graduating in\n1924\n, he began studying electrical engineering by attending night classes at the Cooper Union Free Night School for the Advancement of Science and Art. After a year of studying at night school, he entered the Polytechnic Institute of Brooklyn in\n1925\n[\n6\n]\n:-\nThere his grades were all A's except for a D in mechanical engineering which, on re-examination, was changed to an E! During this time he also worked as a technical assistant at the Bell Telephone Laboratories and took a training course there.\nHowever, in\n1928\n, he decided to go to university to study mathematics and took courses in pure mathematics at the University of Wisconsin-Madison, receiving his BA in\n1931\n. During the three years as an undergraduate at Wisconsin-Madison he took only one statistics course, namely 'Theory of probability and method of least squares' given by\nWarren Weaver\n. Despite his mild nature, he was an intercollegiate wrestler during his time at Wisconsin. He remained at Wisconsin-Madison for graduate studies and was awarded a Master's Degree in\n1933\n. He undertook research for his doctorate advised by Rudolph Ernest Langer\n(1894\n-\n1968)\n. He submitted his doctoral thesis\nThe Asymptotic Solutions of Certain Linear Differential Equations in which the Coefficient of the Parameter May Have a Zero\nto Wisconsin-Madison and was awarded his PhD in\n1935\n. Before completing his doctoral studies he married Miriam Knott in Madison in\n1934\n. They would have one daughter, named Miriam, and one son named Michael. His daughter Miriam became a mathematician while his son Michael became a commercial artist and designer.\nImmediately after completing his doctorate, Scheffé began a career as a university teacher and, having trained as a pure mathematician, it was naturally that subject which he taught. He was on the Faculty at the University of Wisconsin from\n1935\nto\n1937\nas an Instructor in Mathematics, then spent three of the next four years, also as an Instructor, at Oregon State University with the year\n1939\n-\n40\nspent at Reed College as a Fellow in Mathematics. While at Oregon State University, Scheffé discovered that some of the results he had included in his thesis, believing them to be new, had actually been proved by\nGauss\n. This made him realise that research in pure mathematics was difficult because of the many brilliant pure mathematicians who had worked on the topic, so he decided that he would be more successful in an area where little had been done. He chose to work on statistics and while still at Oregon State he wrote his first statistics paper\nAn inverse problem in correlation theory\n. Scheffé went to Berkeley to meet with\nJerzy Neyman\nand discussed possible statistical problems that he might work on.\nIn\n1941\n, Scheffé's interests having moved from pure mathematics to statistics, he joined\nSamuel Wilks\nat Princeton where a statistics team had grown up. Having retrained as a statistician, he began a second career as a university teacher, but this time he taught statistics rather than mathematics. At Princeton, he was an Instructor from\n1941\nto\n1943\n, then promoted to Lecturer for the academic year\n1943\n-\n44\n. During these years he worked with many of the statisticians at Princeton, particularly with\nJohn Tukey\nwith whom he wrote two joint papers, namely\nA formula for sample sizes for population tolerance limits\n(1944)\nand\nNon-parametric estimation, I Validation of order statistics\n(1945)\n. These were not his first statistics papers written while at Princeton, the first of these being\nOn the theory of testing composite hypotheses with one constraint\n(1942)\nfollowed by four others before his first joint paper with\nTukey\n. His papers at this time were all concerned with hypothesis testing and nonparametric inference. In\nStatistical inference in the nonparametric case\n(1943)\nhe wrote:-\nOnly a very small fraction of the extensive literature of mathematical statistics is devoted to the nonparametric case, and most of this is of the last decade. We may expect this branch to be rapidly explored however: The prospects of a theory freed from specific assumptions about the form of the population distribution should excite both the theoretician and the practitioner since such a theory might combine elegance of structure with wide applicability.\nOf course we are now looking at his career through the years of World War II and from\n1943\nto\n1946\nhe did war work as a consultant and as a Senior Mathematics Officer with the Office of Scientific Research and Development. This work was done as part of a contract between the Office of Scientific Research and Princeton University. The work he did for the Office was written up in a number of reports but these were classified and never published. All that is known of this work is that it fell under the general heading of \"Effects of impact and explosion\".\nHe taught statistics at Syracuse University in session\n1944\n-\n45\nwhere he was an Assistant Professor of Mathematics, and then at University of California at Los Angeles from\n1946\nuntil\n1948\nwhere he was appointed as an Associate Professor of Engineering. He was a Guggenheim Fellow in\n1946\nin the field of statistics and spent some time at Berkeley where he wrote the joint paper\nOn the problem of similar regions\nwith Erich Lehmann. In fact the articles\n[\n1\n]\n,\n[\n2\n]\n,\n[\n12\n]\nand\n[\n13\n]\nin the references were written by Lehmann. We quote from Lehmann's article\n[\n2\n]\n:-\nThe first time I met Henry Scheffé was in\n1946\nwhen he spent a year in Berkeley with a Guggenheim Fellowship, on leave from the College of Engineering at the University of California - Los Angeles. His name was of course well known to me, since my thesis had been based partly on his work. It was exciting now to meet him in person. ... We quickly took a liking to each other and on long walks discussed statistical issues as well as literature, music, and the state of the world. ... Our statistical conversations led us to discuss a unifying concept that tied together many different situations we had been considering, which we called completeness. For models possessing this property, it turns out that both testing and estimation become particularly simple. ... We published a preliminary report in\n1947\nin the 'Proceedings of the National Academy', but a full exploration of the concept took us several years. Eventually, we gave a comprehensive account in two long papers in\n1950\nand\n1955\n. ... By the time Henry left Berkeley at the end of his Guggenheim year, the outline of the work was clear, and it was possible to elaborate the details by correspondence and occasional visits back and forth.\nImmediately after leaving Los Angeles Schffé was appointed as an Associate Professor of Mathematical Statistics at Columbia University where he became chair of the Mathematical Statistics department from\n1951\nto\n1953\n. It was during these years at Columbia that he published his first papers addressed directly to users of statistics:\nOperating characteristics of average and range charts\n, 'Industrial  Quality Control'\n(1949)\n;\nTheoretical backgrounds of the statistical methods\n, 'Industrial and Engineering Chemistry'\n(1951)\n; and\nAn analysis of variance for paired comparisons\n, 'J. Amer. Stat. Assoc.'\n(1952)\n. In\n1953\nthe paper considered by many to be his most important appeared, namely\nA method for judging all contrasts in the analysis of variance\n.\nAfter five years at Columbia, Scheffé went to Berkeley in\n1953\nas Professor of Statistics and Assistant Director of the Statistical Laboratory\n[\n3\n]\n:-\nThe first courses he taught there were, \"Statistical problems in experimentation\" and \"Statistical problems of mass production and control of quality\", topics that occupied his work continually.\nThere were, however, problems and things did not quite work out as\nJerzy Neyman\n, who appointed him, had hoped. His appointment as Assistant Director of the Statistical Laboratory had been made by Neyman with the expectation that Scheffé, who had shown much interest in applications, would contribute substantially to the running of the Laboratory. This did not happen, however, and after a year this part of his job was quietly removed. He was to remain at Berkeley for the rest of his life, retiring from his chair in\n1974\n. He was chairman of department at Berkeley,\n1965\n-\n1968\n, as he had been at Columbia University. The\n1960\ns was a time of student unrest and Berkeley, like many other universities, had to deal with student protest. In particular, students at Berkeley protested about American involvement in the war in Vietnam. Scheffé earned much respect for his fair-minded approach to these student problems.\nScheffé, perhaps not surprisingly given his route into statistics, was interested in the more mathematical areas of statistics. He was particularly interested in optimal properties and he extended the\nNeyman\n-\nPearson\ntheory of best similar test. His research was influenced by certain consultancy positions he held, such as one mentioned above at the Office of Scientific Research and Development from\n1943\nto\n1946\n. Later consultancy appointments were with the Consumer's Union and with Standard Oil. After\n1950\nScheffé's research was concerned with aspects of linear models, particularly the analysis of variance. One of his most important papers appeared in\n1953\non the\nS\nS\nS\n-method of simultaneous confidence intervals for estimable functions in a subspace of the parameter space. Although he did not show the optimality of the\nS\nS\nS\n-method, this was proved by R A Wijsman in the late\n1970\ns.\nHe also studied other aspects of analysis of variance such as paired comparisons which he studied in\n1952\n, then mixed models studied two years later. In\n1958\nand again in\n1963\nhe published on experiments on mixtures and in\n1973\nhe wrote on calibration methods. His mixture designs were of fundamental importance and led to a major theory of mixtures being built later on Scheffé's work.\nA complete list of Scheffé's publications is given in\n[\n6\n]\n. Many consider that his most important work was a comprehensive review of nonparametric statistics in\n1943\nand his book\nThe Analysis of Variance\n(1959)\n. Lehmann, who worked jointly with Scheffé on a general theory of similar tests, describes the book\nThe Analysis of Variance\nin\n[\n1\n]\n:-\nIts careful exposition of the different principal models, their analyses, and the performance of the procedures when the model assumptions do not hold is exemplary, and the book continues to be a standard text and reference.\nFor extracts from the Preface, from the Introduction, and from some reviews, see\nTHIS LINK\n.\nScheffé was in the middle of revising this book for a new edition when he died. He had retired from Berkeley and, following retirement, spent three years at Indiana University continuing his research work. Then, only a few weeks after his post at Indiana University had ended and he had returned to Berkeley, he was involved in a bicycle accident which resulted in his death.\nScheffé was elected to many statistical societies. He became a fellow of the Institute of Mathematical Statistics in\n1944\n, the\nAmerican Statistical Association\nin\n1952\nand the International Statistical Institute in\n1964\n. He achieved high office in these organisations, being elected as president of the International Statistical Institute and vice president of the\nAmerican Statistical Association\n.\nIn\n[\n1\n]\nScheffé's interests outside mathematics and statistics are described:-\nThroughout his life Scheffé enjoyed reading, music\n(\nas an adult he learned to play the recorder\n)\n, and travelling. He was also physically active. At Wisconsin he was an intercollegiate wrestler, and he liked to cycle, swim, and backpack with his family.\nIn\n[\n2\n]\nLehmann gives further details that allow us to see his character:-\nI was impressed by his hatred of prejudice. He once told me that when he heard an anti-Semitic remark he tried to silence the speaker by stating that he was Jewish\n(\nwhich was not the case\n)\n.\nThe authors of\n[\n13\n]\nwrite:-\nAlong with his teaching and research, Scheffé managed a schedule of daily bicycling and swimming, and he engaged in frequent summer snorkelling and backpacking. He was a dedicated tourist, especially to Mexico and France, who often returned with small works of art chosen with a sure and strongly individual taste. He was sensitive to the beauties of nature and had a particular enthusiasm for desert country. He loved music and as an adult learned to play the recorder and treasured the opportunity this brought of playing chamber music with friends. A few months before his death, he had just finished reading all of Trollope's novels.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Statistics"
  ]
}