{
  "nome_completo": "Henry Abel Dye",
  "nome_curto": "Henry Dye",
  "ano_nascimento": "1926",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dye/",
  "lugar_nascimento": "Dunkirk, New York, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Henry Dye\nattended Rensselaer Polytechnic Institute, a private institution of higher education in Troy, New York. From there he moved to the University of Chicago where he was awarded his M.S. in\n1947\n. He continued research at Chicago under the supervision of\nIrving E Segal\nand he received his Ph.D. in\n1950\nfor his thesis\nRadon- Nikodym Theorems for Operator Algebra\n.\nAfter the award of his doctorate, Dye was appointed as a Bateman Fellow at the California Institute of Technology. He held the fellowship for two years, then he was appointed as an Instructor in Mathematics. He spent session\n1952\n-\n1953\nat the Institute for Advanced Study in Princeton, following which he was appointed as an Assistant Professor of Mathematics at the University of Iowa. In\n1956\nhe moved to the University of Southern California as an Associate Professor of Mathematics, and then in\n1959\nhe returned to the University of Iowa. He was only one year back at Iowa before he was appointed Professor of Mathematics at the University of California at Los Angeles in\n1960\n. He held this post for the rest of his life.\nDye served the university in many ways, the most important being his tenure of the Chair of the Mathematics Department from\n1975\nto\n1978\n. He also served on many university committees such as the Committee on Privilege and Tenure, and he was a member of the Council on Academic Personnel from\n1978\nto\n1979\nand for a second term from\n1982\nto\n1985\n.\nDye's first paper was\nThe\nRadon\n-Nikodym theorem for finite rings of operators\nwhich was published in the\nTransactions of the American Mathematical Society\nin\n1952\n. His main aim in this paper was to study how absolute continuity could be generalised of to the non-commutative case. One of the main results of the paper is a non-commutative analogue of the\nRadon\n-\nNikodym\ntheorem which\n[\n1\n]\n:-\n... is certainly one of his most beautiful achievements.\nThe results which Dye proved in this paper led to marked progress in the theory of von Neumann algebras. In\n1953\nDye published\nThe unitary structure in finite rings of operators\n. In this paper he proved that if a\nW\n∗\nW^{*}\nW\n∗\n-algebra has no minimal projections, then the weak closure of the group of unitary operators is the entire unit sphere of the\nW\n∗\nW^{*}\nW\n∗\n-algebra.\nIn\n1959\nDye published\nOn groups of measure preserving transformation I\nin the\nAmerican Journal of Mathematics\n. This important paper studies the classification of automorphism groups of a finite non-atomic measure algebra. It begins his important exploration of the relationship between operator algebras and\nergodic theory\nand in many ways was so far ahead of its time that it required a decade before full significance of its results were recognised. In the paper Dye promised a second paper giving a detailed discussion of certain parts of his theory, and indeed this second instalment appeared in the same journal in\n1963\n. Varadarajan writes\n[\n1\n]\n:-\nHis uncompromising high standards did not allow him to publish much; however not many mathematicians have exerted as much influence through their work as he did, publishing only as much as he did.\nDye married Anne Garvey and they had a son John who became a professor of mathematics, and a daughter Constance. He later married Eugenie. In\n1981\nHenry and Eugenie Dye visited the University of Warwick in England when Dye was a Senior Visiting Fellow of the U.K. Science research Council. William Arveson, Robert Blattner, and Masamichi Takesaki have written an obituary of their colleague Dye in which they describe his lecturing style:-\nAs a teacher of graduate students, Henry was superb. His lectures were lucid and elegant, and he spoke without benefit of notes. Henry's research students learned a lot from him about mathematical culture. He would not tolerate superficiality or pretentiousness. If a student were to produce some mathematics that was wrong or trivial, he would let that student down quite firmly, but would always be careful to leave the student's self-esteem intact. His opinions were usually punctuated with hilarious quips, or with outrageous puns delivered deadpan. Indeed, this addiction to puns came out in everything he did, even in the most solemn of University committees.\nDye's health deteriorated after he passed fifty years of age and for quite a few years he continued to work hard for UCLA despite being in poor health. He suffered a heart attack when leaving the university after completing a full day's work, so despite the years of ill health his death was very sudden and unexpected. A memorial service was held for Dye at which Klaus Schmidt gave an address\n[\n1\n]\n:-\n[\nDye\n]\nwas a man of great humour and generosity, and he never allowed the high standards he set himself as a person and mathematician to interfere with his genuine warmth and kindness towards others. With himself he was much less kind: although I cannot claim to have known him all that well I always had the feeling that he drove himself quite relentlessly, and that he could never forgive himself for not having been able to prove some of the later and quite spectacular results in the subject. On those rare occasions, when he allowed himself to relax completely, he was wonderful company. I still remember with great fondness Genie's and Henry's visit to Warwick and Henry's epic battles with the British plumbing system, or the wonderful day in\n1983\nwhen Genie and Henry showed me the Californian poppies in the desert. Henry was a nice man, and I shall miss both him and his mathematics.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Topology"
  ]
}