{
  "nome_completo": "Herbert Federer",
  "nome_curto": "Herbert Federer",
  "ano_nascimento": "1920",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Federer/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Providence, Rhode Island, USA",
  "biografia": "Herbert Federer\nwas brought up in Vienna, Austria, where he had his primary and secondary education. He immigrated to the United States in\n1938\nand there he began his university studies\n[\n3\n]\n:-\nHe chose never to travel to Europe, and his domestic travel was also quite limited.\nFederer began his undergraduate education at Santa Barbara and then transferred to the University of California, Berkeley, receiving the degree of B.A. in mathematics and physics in\n1942\n. At this stage, Federer was unsure whether he had the right abilities to become a research mathematician so he asked one of his professors, Anthony Perry Morse\n(1911\n-\n1984)\n, to give him a problem to test whether he was capable of research. Morse had been awarded a Ph.D. from Brown University in\n1937\nand worked for most of his career at the University of California, Berkeley. He made important contributions to both measure theory and to the foundations of mathematics. The problem that Morse gave Federer set his research direction for the next few years and his work on the problem clearly showed his research potential. Federer and Morse wrote up the solution to the problem as the  joint paper\nSome properties of measurable functions\nwhich was published in\n1943\n.\nWilliam P Ziemer explains in\n[\n3\n]\nthe background to the type of problems that Anthony Morse had posed to Federer and which would become the topic of his Ph.D. thesis which Morse directed:-\nThe problem of what should constitute the area of a surface confounded researchers for many years. In\n1914\nCarathéodory\ndefined a k-dimensional measure in\nR\nn\n\\mathbb{R}^{n}\nR\nn\nin which he proved that the length of a rectifiable curve coincides with its one-dimensional measure. In\n1919\nHausdorff\n, developing\nCarathéodory\n's ideas, constructed a continuous scale of measures. After this, it became obvious that area should be regarded as a two-dimensional measure and should establish the well-known integral formulas associated with area. Later\nLebesgue\n's definition, somewhat modified by\nFréchet\n, of the area as being the lower limit of areas of approximating polyhedra became the dominant one. It became dominant partly because of its successful application in the solution of the classical\nPlateau\nproblem. It had the notable feature of lower semicontinuity, which is crucial in the calculus of variations.\nFederer's next two papers, published before he submitted his doctoral thesis, were\nSurface area\nI\n(1944)\nand\nSurface area\nII\n(1944)\n. These papers contain the first contributions that Federer made to the study of Lebesgue area. He was building on work by\nLamberto Cesari\nwho had studied surfaces given by parametric equations, in particular the\nLebesgue\narea of such a surface, while at Pisa from\n1938\nto\n1942\n. The other mathematician who had made significant contributions to the Lebesgue area of a surface was\nTibor Radó\n. After World War II ended in\n1945\n,\nTibor Radó\nwas invited to be the\nAmerican Mathematical Society\nColloquium Lecturer, and he gave a series of talks on his major contributions on surface area. In the second of his\n1944\npapers on surface area, Federer considers the fundamental problem that had already been attacked by others\n[\n3\n]\n:-\nIt asks for the type of multiplicity function that, when integrated over the range of f with respect to\nHausdorff\nmeasure, will yield the\nLebesgue\narea of f. In this paper his results imply that if all the partial derivatives of f exist everywhere in a region T, then the\nLebesgue\narea can be represented as the integral of the crude multiplicity function N\n(\nf, T, y\n)\n, which denotes the number of times in T that f takes the value y.\nHe submitted his thesis\nSurface area\nto the University of California, Berkeley, and was awarded a Ph.D. in mathematics in\n1944\n. In the same year, he became a naturalised US citizen. Of course, the hostilities of World War II were still taking place when he completed his doctorate so, during\n1944\nand\n1945\n, he undertook military service in the U.S. Army at the Ballistic Research Laboratory in Aberdeen, Maryland. Beginning in\n1945\n, he was a member of the mathematics department at Brown University in Providence, Rhode Island. Federer married Leila and they had three children, Andrew, Wayne, and Leslie Jane. He spent his whole career at Brown University, becoming a full professor in\n1951\n, and Florence Pirce Grant University Professor in\n1966\n. He retired in\n1985\nand was made professor emeritus at that time. Federer's daughter, Leslie Jane, now Leslie Jane Vaaler, studied mathematics at the Massachusetts Institute of Technology and was awarded a Ph.D. from Princeton for her thesis\np-adic L-functions, Regulators, and Iwasawa Modules\n(1982)\n. She is currently a Senior Lecturer in the Department of Mathematics at University of Texas at Austin. Leslie Vaaler writes about her father in\n[\n3\n]\n:-\nHerbert Federer taught me about life, scholarship, and the world of mathematics; he was my father. When I was a little girl, my father and I would go on walks and he would talk to me. As I remember this communication, he always respected my ability to understand adult topics, so long as they were presented with careful explanation. He spoke deliberately, taking the time to choose words he felt conveyed just what he was trying to say.\n(\nThose who knew Herbert Federer will recognize this precision with language.\n)\nOn our walks, my father was pleased to be asked questions and encouraged further queries by treating them as intelligent responses. In this manner, he gave me the roots of intellectual self-confidence. My father wanted me to understand his world, and so he talked to me about teaching, about the Brown University mathematics department, about mathematicians he admired, and about the joys and frustration of being a mathematician. ... He shared with me thoughts about mathematicians being familiar with areas of mathematics other than just their own.\nIn\n1948\nFederer produced mimeographed notes for the course\nAn Introduction to Differential Geometry\nthat he was giving at Brown University.\nNorman Steenrod\nwrites in a review:-\nThe subject matter is not that usually implied by the title. It is not concerned with metric\ndifferential geometry\nbut rather with the more primitive notions of differential forms, their integrals,\nde Rham\n's theorem and related matters. The author has performed a sizable task by presenting, for the first time, an organised account of material so widely distributed in the literature. ... The most striking feature of the book to the casual reader is the notation. The author adopts the view that certain familiar notations are misleading, and obscure the meanings of definitions and theorems. He replaces them by more elaborate notations based on the roots in set theory of the concepts represented\n(\ne.g., the polynomial x becomes the sequence of its coefficients\n[\n0\n,\n1])\n. A few such changes would not be worthy of comment; but he has carried out the prodigious task of applying the same stern standards to every phase of the work. The result can be described by saying that a resemblance to any notation, living or dead, is purely coincidental.\nIn\n1961\n, in collaboration with Bjarni Jonsson, Federer published the undergraduate text\nAnalytic Geometry and Calculus\n. Archie Lytle writes in\n[\n2\n]\n:-\nThis text presents beginning calculus using a set theoretic approach and strongly emphasizes the theory of the calculus. Included in 'Analytic Geometry and Calculus' are the ordered pairs definition of relation and function; in equalities; absolute values; and the epsilon delta approach to limits and the wrapping function in trigonometry. These topics should suggest that this book uses the terminology now being urged in mathematics. The book presents a semi-rigorous approach to the calculus but this does not mean that the intuitive basis has been neglected. A mating of rigorous proofs and precise definitions, which are motivated by an intuitive approach to the topic under development, has been successfully used.\nLawrence Wahlstrom, reviewing the same book, writes\n[\n4\n]\n:-\nOne of the outstanding features of this textbook is the adherence to the framework of set theory throughout the book. For students with a background of high school mathematics similar to that developed by the School Mathematics Study Group, this text would be a natural at the college and university level. Although the authors claim that the reader needs only \"the usual background of high school algebra and geometry, not necessarily including trigonometry,\" the generally sophisticated treatment of the classical topics in analytic geometry, logarithms, and trigonometry would not be wasting a student's time who happened to have, say, four years of mathematics in high school.\nFederer is most famous, however, for his book\nGeometric measure theory\n(1969)\n. He writes in the Preface:-\nDuring the last three decades the subject of geometric measure theory has developed from a collection of isolated special results into a cohesive body of basic knowledge with an ample natural structure of its own, and with strong ties to many other parts of mathematics. These advances have given us deeper perception of the analytic and topological foundations of geometry, and have provided new direction to the calculus of variations. Recently the methods of geometric measure theory have led to very substantial progress in the study of quite general elliptic variational problems, including the multidimensional problem of least area. This book aims to fill the need for a comprehensive treatise on geometric measure theory. It contains a detailed exposition leading from the foundations of the theory to the most recent discoveries, including many results not previously published. It is intended both as a reference book for mature mathematicians and as a text-book for able students. The material of Chapter\n2\ncan be covered in a first year graduate course on real analysis. Study of the later chapters is suitable preparation for research. Some knowledge of elementary set theory, topology, linear algebra and commutative ring theory is prerequisite for reading this book, but the treatment is self-contained with regard to all those topics in multilinear algebra, analysis, differential geometry and\nalgebraic topology\nwhich occur. ... A systematic attempt has been made to identify, at the beginning of each chapter, the original sources of all relatively new and important material presented in the text.\nCasper Goffman reviews the book in\n[\n1\n]\n:-\n'Geometric measure theory' is a great book which should have a profound influence on the development of mathematics in the next few decades. The subject requires an interplay of various disciplines. It has depth and beauty of its own, but its greatest worth should be in its effect on other areas of mathematics, e.g., differential geometry, differential topology, partial differential equations, algebraic geometry, potential theory. The subject is hard, and the book is not easy reading. However, it is all there, and readable. ... We shall be grateful to Federer for so diligently and carefully performing the immense task of organizing into a magnificent whole this vast body of previously scattered and not easily accessible material. No one else could have written this book. Federer is surely one of the bright mathematical stars of our era.\nA review in the\nBulletin\nof the London Mathematical Society is also very enthusiastic about the book:-\nFederer's timely and beautiful book indeed fills the need for a comprehensive treatise on geometric measure theory, and his detailed exposition leads from the foundations of the theory to the most recent discoveries. ... The author writes with a distinctive style which is both natural and powerfully economical in treating a complicated subject. This book is a major treatise in mathematics and is essential in the working library of the modern analyst.\nRobert Hardt writes in\n[\n3\n]\nabout the book over\n40\nyears after it was published:-\nFederer was a real stickler for precision, organization, and referencing. His notation was logical, even if it wasn't always common. All these characteristics are evident in his seminal book 'Geometric Measure Theory'. Its appearance in\n1969\nwas timely, as it brought together earlier studies of geometric\nHausdorff\n-type measures, work on rectifiability of sets and measures of general dimension, and the fast developing theory of geometric higher-dimensional calculus of variations. All of the arguments in his text exhibited exceptional completeness. That said, this book is not for the casual reader because his writing tends to be particularly concise. Forty years after the book's publication, the richness of its ideas continue to make it both a profound and indispensable work.\nIn\n1976\nFederer explained his approach to mathematics\n(\nsee, for example,\n[\n3\n]\n)\n:-\nI have worked hard to transform this subject from a collection of isolated results into a cohesive body of knowledge. However, my main effort has been directed towards a deeper understanding of concepts significantly related to some classical properties in other parts of mathematics. These interests also led me to write two papers on group theory and homotopy theory.\nHe advised a number of Ph.D. students at Brown University, several of whom became university professors. The best known of his students is\nFrederick Justin Almgren\n.\nFor his remarkable contributions to mathematics, Federer was elected a fellow of the\nAmerican Academy of Arts and Sciences\n(1962)\nand a member of the\nNational Academy of Sciences\n(1975)\n. In\n1987\nthe\nAmerican Mathematical Society\nawarded Herbert Federer and Wendell Fleming the Leroy P Steele prize:-\n... for their pioneering paper \"Normal and integral currents\".\nFrank Morgan, was a graduate student at Princeton when he met Federer at a conference at Park City, Utah, in\n1977\n. Federer was kind and helpful to the young graduate student and they became friends. Morgan writes:-\nAfter Herb Federer retired, I enjoyed visiting him and his wife Leila in the retirement home they designed just outside Providence. Everything was meticulously planned, from the lovely paths around the property to the way that Federer's file cabinet fitted perfectly into his bedroom closet. They loved their home, each other, their daughter Leslie, and their grandchildren, and it always made me happy just to visit them.\nFollowing Federer's death, a memorial conference was organised at Brown University, Providence, Rhode Island. The one-day conference, held on\n16\nApril\n2011\n, featured six lectures relevant to the work of Herbert Federer.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}