{
  "nome_completo": "Herbert Westren Turnbull",
  "nome_curto": "Herbert Turnbull",
  "ano_nascimento": "1885",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Turnbull/",
  "lugar_nascimento": "Tettenhall, Wolverhampton, England",
  "lugar_morte": "Grasmere, Westmoreland, England",
  "biografia": "Herbert Turnbull\n's father, William Peveril Turnbull\n(\nborn in Hackness, Yorkshire  about\n1842)\n, was an H M Inspector of Schools. His mother was Fanny Turnbull\n(\nborn Wolverhampton, Staffordshire about\n1854)\n. Herbert Turnbull had four younger brothers Edwin\n(\nborn about\n1888)\n, Peveril\n(\nborn about\n1889)\n, Derwent\n(\nborn about\n1891)\nand Allan\n(\nborn about\n1894)\n. He also had a sister Margaret\n(\nborn about\n1899)\n.\nTurnbull's father was interested in mathematics and transmitted his enthusiasm for the subject to his young son Herbert. In the Preface to\nThe Mathematical Discoveries of Newton\n(1945)\nTurnbull thanks his father for a quotation which:-\n... is taken from a lecture on\nNewton\nwhich he gave to a group of Nottinghamshire miners seventy years ago.\nThis means that Turnbull's father gave the lecture on\nNewton\nin the\n1870\ns. Turnbull also dates his own interest in the history of mathematics to his childhood, in particular writing in the same Preface:-\nMy own interest in\nNewton\ndates from childhood: his mathematical prowess was as well known at the family breakfast table as the batsmanship of W G Grace.\nHerbert was educated at Sheffield Grammar School. He went up to Trinity College, Cambridge where he had a career of great distinction being placed Second\nWrangler\nin the Mathematical Tripos\n(\nmeaning that he was ranked second among those being awarded a First Class degree\n)\nand, in\n1909\n, he was the winner of the Smith's Prize.\nAfter graduating, Turnbull taught at St Catharine's College, Cambridge\n(1909)\n, and then at the University of Liverpool\n(1910)\n. He writes in\n[\n5\n]\nin a letter offering a first appointment at St Andrews to\nLedermann\n:-\nI naturally look back on my start at lecturing in thinking of your present position. My first post outside Cambridge\n(\nwhere I gave one course a term\n)\nwas at Liverpool and involved at least three sets of new lectures to be prepared, and in one term four sets.\nTurnbull married Ella Drummond Williamson in\n1911\n. She was the daughter of Canon H D Williamson. Herbert and Ella Turnbull had one child.\nAfter his year as a lecturer at the University of Liverpool, Turnbull taught at the Hong Kong University, becoming master at St Stephen's College in Hong Kong in\n1911\n, and warden of the University Hostel two years later. The University Hostel was run by the Church Missionary Society as part of Hong Kong University. The Society, founded by Evangelical clergy of the Church of England in\n1799\n, stressed biblical faith, personal conversion, and piety. Turnbull had duties as a mathematics lecturer at the University in addition to being warden of the hostel. He held his posts in Hong Kong University until\n1915\n.\nOn his return to England, Turnbull worked as a school teacher for three years in the leading independent school at Repton in the county of Derbyshire in the north of England. He taught at the famous boys' school of Repton which had a long history, being founded in\n1556\nin buildings which included a restored Augustinian priory established in\n1172\n. Following this Turnbull became an a Schools Inspector, entering at this stage the same profession as that of his father. From\n1919\nto\n1926\nhe was a fellow at St John's College, Oxford holding the Fereday Fellowship during this period.\nAs an undergraduate at Cambridge Turnbull had become fascinated by the topic of\ninvariant theory\n. He published two papers on classical algebra problems in\n1910\nand\n1911\n, then a further paper in\n1916\nafter his return to England. In\n1919\nhe published two more papers but his involvement in mathematical research had been necessarily limited by the jobs that he had held over these years.\nTurnbull was appointed Regius Professor of Mathematics in the United College of St Salvator and St Leonard at the University of St Andrews in\n1921\n. He only had five papers published before being appointed to this chair but his quality was evident to all concerned. He held the Regius Chair until he retired in\n1950\nwhen he was succeeded as Regius Professor of Mathematics by\nCopson\n. In\n[\n3\n]\nLedermann\ndescribes an interesting incident which occurred soon after he arrived in St Andrews in\n1934\n.\nLedermann\nwrites\n[\n3\n]\n:-\n[\nTurnbull\n]\nwas very kind and most patient when our communications were hindered by my poor command of English. Before he was appointed to the Regius Chair of Mathematics at St Andrews Professor Turnbull had been a missionary in China. He had picked up some of the local language there. One day he said to me: \"Walter, I see you have some difficulty expressing yourself. Would it help you if I spoke to you in Chinese?\" I thanked him for his offer, but asked him, with apologies, to persevere with English.\nTurnbull was interested in algebra, particularly invariant theory building on work of\nGordan\nand\nClebsch\n. As\nLedermann\nwrites in\n[\n2\n]\n:-\nIt was unfortunate for him that already in the\n1920\n's the fashion in algebraical research had drastically changed, and his original work on invariants did not receive the recognition which it would have found two decades earlier.\nAs to Turnbull's approach to mathematics it was\n[\n2\n]\n:-\n... concrete and formal in the sense that he sought to solve problems by an effective formalism rather than by a conceptual analysis of the underlying structures. His topics were algebraical, but he was fond of presenting them against a geometrical background.\nTurnbull was also interested in the history of mathematics. He explains in the Preface to his little book\nThe Great Mathematicians\nhis attitude towards historical study in mathematics. We quote it here for two reasons. Firstly it tells us something of Turnbull's character and attitude towards mathematics. Secondly we relate it because this web archive is run from a server which we have named after Turnbull and in this archive of the history of mathematics we have tried to follow Turnbull's thinking on the subject:-\nThe usefulness of mathematics in furthering the sciences is commonly acknowledged: but outside the ranks of the experts there is little inquiry into its nature and purpose as a deliberate human activity. Doubtless this is due to the inevitable drawback that mathematical study is saturated with technicalities from beginning to end. Fully conscious of the difficulties in the undertaking, I have written this little book in the hope that it will help to reveal something of the spirit of mathematics, without unduly burdening the reader with intricate symbolism. ... I have tried to show how a mathematician thinks, how his imagination, as well as his reason, leads him to new aspects of the truth.\nTurnbull published his own historical research into mathematics in the\nJames Gregory\nTercentenary Volume\n(1939)\n. In our library in St Andrews the copy of this volume is inscribed in Turnbull's own hand:-\nD. E. Rutherford\n   with very best wishes\n      from\n         H. W. Turnbull\n            Oct.\n1939\nIn the Preface to this work Turnbull describes how he discovered letters from\nCollins\nto\nJames Gregory\n:-\n... in a bundle of remarkable original documents in the Library of the University of St Andrews ... I first examined the documents at St Andrews in\n1932\n, when it was discovered that\nGregory\n, the original recipient of the letters, had used their blank spaces for recording his own mathematical thoughts. As a result of careful scrutiny it has been established that\nGregory\nmade several remarkable and unsuspected discoveries, particularly in the calculus and the theory of numbers, which he never published. He was, for example, employing\nTaylor\nand\nMaclaurin\nexpansions more than forty years in advance of anyone else.\nTurnbull's major beautifully written works include\nThe Theory of\nDeterminants\n,\nMatrices\n, and Invariants\n(1928)\n,\nThe Great Mathematicians\n(1929)\n,\nTheory of Equations\n(1939)\n,\nThe Mathematical Discoveries of Newton\n(1945)\n, and\nAn Introduction to the Theory of Canonical Matrices\n(1945)\n, which was jointly written with\nAitken\n.\nThe Mathematical Discoveries of Newton\narose from two lectures which Turnbull gave on\nNewton\n. The first was given at a meeting of the\nEdinburgh Mathematical Society\nin December\n1942\nto commemorate the\n300\nth\nanniversary of\nNewton\n's birth. The second was given at a meeting of Edinburgh University's Mathematical and Physical Society. Turnbull writes:-\nWithout going into too much detail I have tried to explain - as far as the work of geniuses can be explained - what led\nNewton\nto these discoveries. The positive interest afforded by contemplating the wonderful range covered by his early mathematical work provides an adequate theme for this short study, and makes unnecessary an attempt to deal with the controversies which clouded his later years.\nIt is so typical of Turnbull that he chose to emphasise the extraordinarily positive aspects of\nNewton\n's life and work.\nAfter he retired in\n1950\nTurnbull, at the request of the\nRoyal Society\n, began to work on the\nCorrespondence of Isaac Newton\n. Two volumes of this important work were published before his death.\nTurnbull received many honours for his work, the most major being his election as a Fellow of the\nRoyal Society\nin\n1932\n. He was also elected to the\nRoyal Society of Edinburgh\n, receiving their Keith Medal and Gunning Victoria Jubilee Prize.\nOutside mathematics Turnbull had several major interests. One of these was music, where he was an excellent pianist, playing in a chamber orchestra. Another of his loves was mountaineering and as a member of the Alpine Club he made many ascents without the help of a guide.\nLedermann\nwrites in\n[\n2\n]\n:-\nNearer his home opportunities for practice were provided on the cliffs of St Andrews bay. He discovered fourteen ways up \"The Maiden Rock\". The mastery of the \"Rock and Spindle\" was not exactly part of the mathematical syllabus, but many a student experienced on this striking formation his first thrill of rock climbing under the guidance of his professor of mathematics.\n\"The Maiden Rock\" and the \"Rock and Spindle\" are volcanic stacks which have survived as the sea has washed away the surrounding material. They are close to the cliffs on the south side of St Andrews bay.\nLedermann\n[\n4\n]\nwrites of Turnbull's:-\n... kindness and caring - he was a lovely man.\nIn\n[\n2\n]\nhe writes how Professor and Mrs Turnbull:-\n... extended hospitality to countless students and friends. At these gatherings Mrs Turnbull was a gracious and lively hostess. The inevitable shyness of the younger guests was overcome by drawing room games, but the highlight of the evening, for those who could appreciate it, was the performance on two pianos by Professor and Mrs Turnbull. Their playing, highly musical and exquisitely blended, was a beautiful expression of a harmonious partnership.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus"
  ]
}