{
  "nome_completo": "Hermann Kober",
  "nome_curto": "Hermann Kober",
  "ano_nascimento": "1888",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kober/",
  "lugar_nascimento": "Beuthen (now Bytom), Upper Silesia (now Poland)",
  "lugar_morte": "Birmingham, England",
  "biografia": "Hermann Kober\n's father was a tailor in Beuthen, one of the oldest cities of Upper Silesia which had become part of Germany in\n1871\n. Hermann was born into a successful Jewish family, his father having made a fine reputation for himself. The family was a large one, with Hermann having four older brothers. When he was still young the family moved to Breslau\n(\nnow Wrocław\n)\n, so making a move from Upper Silesia to Lower Silesia. Breslau was the sixth largest city of Germany and, in that thriving industrial city, Kober attended school. He then entered the University of Breslau but like most German students of that time, he spent part of his university studies at another university. Kober chose to study at Göttingen, famed as a centre for mathematics, where he was one of\nLandau\n's first students. His doctorate, awarded by the University of Breslau in\n1911\n, was directed by\nAdolf Kneser\n. He received the degree for his thesis\nKonjugierte kinetische Brennpunkte\nⓉ\n(\nConjugated kinetic foci\n)\nwhich made important contributions to the\ncalculus of variations\n.\nBecoming a university teacher was difficult since entering this profession required an initial period with very limited income. He was therefore happy to accept a position as a teacher of mathematics at the Johannes\nGymnasium\nin Breslau. When World War I broke out in\n1914\n, Kober undertook military service and was wounded in action. After his military service he returned to his teaching post at Breslau but in the\n1920\ns he decided to study law on a part-time basis. After a long period of hard study he received a Doctor of Laws degree in\n1930\n. It is a little unclear why he decided to go in that direction. Fuchs writes\n[2]\n:-\nHe told me that he undertook this arduous study to find out whether he was still capable of intellectual work; once he had proved this to his own satisfaction, he could return to mathematical research.\nThis does appear to be rather strange since if what he really wanted was to do mathematical research one cannot help feeling that trying to do research might be the best way to find out if he was still capable of the task. It would seem that he must have had, at least in part, the idea that he might further his career by moving into administration, for a law degree would then stand him in good stead. Whatever was in his mind during the very many hours he spent studying law, he returned to mathematical research in the early\n1930\ns. He had only published one paper up to that point, that being in\n1911\nwhen he had published a paper in\nCrelle's Journal\nwhich basically was a part of his doctoral thesis. In\n1932\n, over twenty years later, he published his second paper which again was related to ideas which he had developed in his doctoral thesis.\nWhen Hitler became Chancellor of Germany in\n1933\n, he immediately announced legal actions against Germany's Jews. On\n7\nth\nApril\n1933\n, Hitler introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. Breslau had a large Jewish community with around\n10\n,\n000\nliving in the city at the time Hitler came to power. Kober should not have been affected by the \"Restoration of the civil service\" law since he had served in World War I, but the Nazis did not apply the letter of the law and most Jewish teachers were forced from their posts. Hitler very much targeted education for on\n25\nth\nApril\n1933\na law restricting the size of German schools and universities\n(\nGesetz gegen die Überfullung deutscher Schulen und Hochschulen\nⓉ\n(\nLaw against overcrowding in German schools and universities\n)\n)\nwas passed. This law ensured that the proportion of newly matriculated non-Aryan students was to be no larger than\n1\n.\n5\n%. Kober was forced out of his teaching post in\n1934\nbut he continued with his teaching career, now at a Jewish school in Breslau.\nSuddenly Kober's research career went into overdrive. He now became interested in\nspecial functions\nand he published five papers on the topic in\n1935\nand\n1936\n. In the midst of this high level of mathematical activity he married Kate Silberberg in\n1936\n. She was herself a mathematician and played a large role in Kober's mathematical research taking off. It is difficult for a school teacher to find the time for research, but still more difficult is finding some way to engage in discussions with other research mathematicians. Kober's wife provided him with the sort of back-up which allowed him to make lengthy visits to Cambridge in England, for she simply took over teaching his classes in Breslau while he spent time at Cambridge doing research. He became interested in\nfunctional analysis\nand linear operators and, from\n1937\nto\n1939\nhe published numerous papers in German but in British mathematical journals.\nHardy\nhelped him obtain a research grant at Birmingham University and he and his family emigrated to England in\n1939\njust before the outbreak of World War II. From that time on his papers were all written in English.\nBirmingham awarded Kober an M.Sc. in\n1940\nand a D.Sc. in\n1943\n. The British Admiralty approached Kober during World War II and asked him to produce a dictionary of conformal mappings which might be useful in war related research. His\nDictionary of conformal representations\nappeared in five separate volumes between\n1944\nand\n1948\n. In\n1952\nit was published by\nDover Publications\nas a single volume. Z Nehari writes in a review:-\n... it should be of considerable help to those concerned with the use of conformal maps in various branches of applied mathematics. The conformal mappings described in the book are by and large arranged according to the analytic functions giving rise to them, the author having found that this permits a more systematic classification than an arrangement according to geometric properties of domains.\nHe was appointed as a mathematics teacher at a grammar school in Birmingham run by the King Edward the Sixth Foundation in\n1943\n. By\n1943\nKober had published\n30\nmathematical papers and he continued to undertake mathematical research for the rest of his life. He retired from school teaching in\n1962\nwhen he was\n74\nyears old.\nKober was a highly productive mathematician working on special functions, functional analysis\n(\nin this area Kober's Theorem which appeared\nA theorem on Banach spaces\n(1939)\nis named after him\n)\n, approximation theory and the theory of functions of a real variable. To give an illustration of his work, we note that he published four papers in\n1940\n:\nOn Dirichlet's singular integral; On some generalisations of Laguerre polynomials; On fractional integrals and derivatives\n; and\nSome remarks on Hankel transforms\n(\nwith\nArthur Erdélyi\n)\n. Again, by way of example of his work, in\n1943\nhe published four papers;\nA note on approximation by rational functions\n;\nOn the approximation to integrable functions by integral functions\n; and two papers with the title\nA note on Hilbert transforms\n. In the\n1970\ns, although by that time in his\n80\ns, Kober published:\nNew properties of the Weyl extended integral\n(1970)\n;\nSome new properties of the Poisson operator\n(1971)\n; and\nThe infinite strip in the complex plane and Poisson's operator\n(1972)\n.\nFuchs writes in\n[\n1\n]\nabout Kober's skills as a teacher:-\nAs a teacher he was most effective. In explaining a theorem he divided the proof into a large number of tiny steps and then he let the class take these steps by patient and suggestive questioning. He would not accept an answer which made two of these steps at a time and he was not content until he was sure that even the most slow-witted pupil had grasped what was going on.\nAs to his interests outside mathematics\n[\n1\n]\n:-\nHermann Kober had a very wide variety of interests outside mathematics and a rich personality. He was deeply religious, and worked in the Zionist movement from his student days. He had a great love of music, and wrote a play \"Dance of the Devils\", an analysis of Hitler and the Third Reich. His hobbies included wide reading, gardening, skiing, rowing and riding.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}