{
  "nome_completo": "Hildegard Rothe-Ille",
  "nome_curto": "Hildegard Ille",
  "ano_nascimento": "1899",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rothe-Ille/",
  "lugar_nascimento": "Bibra, Saxony, Germany",
  "lugar_morte": "Iowa, USA",
  "biografia": "Hildegard Ille\n's parents were Otto Friedrich Carl Ille and Agnes Clara Bertha Thurm. Otto Ille had been born in Berlin on\n3\nMay\n1870\nand had become a medical doctor. He married Bertha Thurm on\n6\nDecember\n1898\nin Berlin. Bertha Thurm had been born on\n15\nAugust\n1875\nin Berlin. Their only child Hildegard Ille, the subject of this biography, was born in Bibra on\n4\nSeptember\n1899\n. Bibra is roughly half way between Leipzig and Frankfurt. Her father, Otto, died in Halle on\n30\nApril\n1900\nso Hildegard never knew her father.\nShe attended the Chamisso school in Berlin-Schöneberg, which was named after the famous poet and botanist Adelbert von Chamisso. She graduated from this\nRealgymnasium\n, being awarded her\nAbitur\n(\nmatriculation examination\n)\nin\n1918\n. In the same year that she graduated, she entered the Friedrich-Wilhelms University of Berlin. This famous university had been founded in\n1810\nand since\n1949\nhas been known as the Humboldt University of Berlin. There she studied mathematics, physics and philosophy. The ordinary professors of mathematics at the University were\nFriedrich Schottky\nand\nErhard Schmidt\n, and\nIssai Schur\nwas an extraordinary professor. In\n1920\n, when Ille was a student at the Friedrich-Wilhelms University of Berlin, she was living at Akazienstrasse\n15\n, Schöneberg, Berlin.\nIn March\n1923\nshe sat the State Examination to qualify as a secondary school teacher. She was already undertaking research for her doctorate, advised by\nIssai Schur\n, and she submitted her thesis\nZur Irreduzibilität der Kugelfunktionen\nⓉ\n(\nOn irreducibility of spherical harmonics\n)\nto the University of Berlin. She was awarded a doctorate in\n1924\n. Alexander Soifer writes that, after proving a\nRamsey\ntype conjecture\n[\n4\n]\n:-\n...\nVan der Waerden\nwalked away from Ramseyan prehistory.\nIssai Schur\n, on the other hand, continued to produce Ramseyan mathematics, and moreover directed and inspired his PhD students\nRichard Rado\n, Hildegard Ille and\nAlfred Brauer\nto do the same.\nFrom\n1\nApril\n1925\n, she held a one year scholarship at the Kaiser Wilhelm Institute for Physics, which was founded in\n1917\nand headed by\nAlbert Einstein\nuntil he was forced to emigrate in\n1933\n[\n1\n]\n:-\nNow the Kaiser Wilhelm Institute for Physics only existed as an institution - without buildings and employees - but the annual budget was used to award scholarships to young scientists and associates\n(\nincluding female associates\n)\n.\nUnlike some others who were awarded similar scholarships, for Ille the scholarship was her only means of support. Five other scientists received a grant from the Kaiser Wilhelm Institute of Physics in the academic year\n1925\n-\n26\n. She was the only woman and, very unusually at this time, she received a higher scholarship than her male counterparts. This decision had been taken by Max von Laue\n(1879\n-\n1960)\nwho, as a deputy of\nAlbert Einstein\n, had been entrusted with this affairs of the Institute. It is also interesting to see that the physicists at the Kaiser Wilhelm Institute for Physics were looking to collaborate with a mathematician.\nAfter holding the scholarship for a year, Ille began her teacher training as a student teacher at her former school, the Chamisso school in Berlin-Schöneberg. She taught there from\n1926\nuntil\n1928\nwhen she married\nErich Rothe\n.\nErich Rothe\nhad studied at the University of Berlin at the same time as Ille. Although\nRothe\nwas four years older, he had served in the military in World War I so was older than the typical student when making his university studies. He took the State Examination to qualify as a secondary school teacher in March\n1923\n, at the same examination diet as Ille.\nRothe\nhad worked at the Institute of Applied Mathematics at the University of Berlin in\n1926\n-\n27\nbefore being appointed to the Engineering School in Breslau in\n1927\nand habilitating there in\n1928\n. In addition to his position at the Engineering School, he was appointed as a\ndocent\nat the University of Breslau in\n1931\nafter a second\nhabilitation\nthere. After\nErich\nand Hildegard Rothe married on\n20\nMarch\n1928\n, they had a son, Erhard William Rothe, who was born in Breslau on\n15\nApril\n1931\n.\nIlle had submitted the paper\nEinige Bemerkungen zu einem von G Pólya herrührenden Irreduzibilitätskriterium\nⓉ\n(\nSome remarks on an originating from G Polya's irreducibility criterion\n)\non\n15\nMay\n1924\nand it was published in\n1926\n. After she married, however, by the German laws of the time she was not entitled to undertake paid work. She did not give up mathematics but reviewed\n40\npapers which had been published between\n1926\nand\n1928\n, under the name Hildegard Rothe, and reviewed\n129\npapers which had been published between\n1930\nand\n1937\n, under the name Hildegard Rothe-Ille. Looking at these reviews, mostly of number theory papers, something struck me\n[\nEFR\n]\nas remarkable. The papers that ille-Rothe reviewed were written in German, English, French, Italian, Russian and Japanese.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nclause three of the Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired, with exemptions for participants in World War I and pre-war officials.\nErich Rothe\nhad served in World War I so was exempt but it quickly became clear that the exemption would be ignored. Because of his Jewish background,\nErich Rothe\nwas dismissed from his positions in\n1935\n. He eventually managed to escape with his wife and child and they went to Zurich. Wilfred Kaplan writes\n[\n3\n]\n:-\nIt was in the spring of\n1937\nthat I first came to know\nErich Rothe\n. I was spending a year in Zurich as a graduate student. I had come to Zurich mainly because of\nHeinz Hopf\n, and it was to his friend and former classmate\nHopf\nthat\nErich Rothe\nhad come as a refugee from Nazi Germany. With him were his wife and child, and all were warmly welcomed by the Hopfs.\nIn\n1937\n,\nErich Rothe\ntravelled to the United States to take up the position of Instructor in Mathematics at William Penn College, Oskaloosa, Iowa. He travelled from Zurich to England, then sailed from Southampton on the ship\nGeorgic\n, arriving in New York on\n18\nSeptember\n1937\n. Rothe-Ille and her son Erhard remained in Zurich for a year, then in the summer vacation of\n1938\n,\nErich Rothe\nreturned to Europe to meet up with his family and returned with them to the United States. Again they first went to England, sailing from Liverpool to New York on the\nScythia\n, and arrived on\n2\nSeptember\n1938\n. Details were taken went they arrived in New York:\nErich H Rothe\n(\nage\n44)\n, Hildegard B Rothe\n(\nage\n38)\nand Erhard O W Rothe\n(\nage\n7)\n. Hildegard B Rothe is described as being\n5\nfoot\n6\ninches tall, having a fair complexion, with dark hair and grey eyes. Her son Erhard O W Rothe is described as being\n4\nfoot\n2\ninches tall, having a fair complexion, with blond hair and grey eyes.\nWe obtain a snapshot of the family from the\n1940\nUS Census. Rothe-Ille is a part-time teacher of German at William Penn College, Oskaloosa. She had worked for\n36\nweeks in\n1939\nand in the week before the census she had worked for seven hours. She had begun the process of applying for American Citizenship but died before that process could be completed.\nRothe-Ille died from cancer in Mercy Hospital Oskaloosa on\n28\nOctober\n1942\n. Her funeral was held on\n31\nOctober\n1942\nwhen she was buried in the Forest Cemetery, Oskaloosa.\nAlexander Soifer, in\n[\n4\n]\n, relates an interesting connection between Hildegard Rothe-Ille and\nPaul Erdős\n:-\nIn his first-ever open-ended problem paper,\nPaul Erdős\nindicates that before him and\nTurán\n,\nIssai Schur\ncalled on studying longest arithmetic-progression-free opening segments of positive integers.\nErdős\nwrites: \"The problem itself seems to be much older\n(\nit seems likely that\nSchur\ngave it to Hildegard Ille, in the\n1920\ns\n)\n.\"\nErdős\nreturns to\nIssai Schur\n's contribution in his\n1961\nsecond open-problem paper... : \"The problem may be older but I can not definitely trace it.\nSchur\ngave it to Hildegard Ille around\n1930\n.\" Paul told me that he \"met\nIssai Schur\nonce in mid\n1930\ns,\" more precisely in\n1936\nin Berlin ... Undoubtedly, they discussed prime numbers, but likely not arithmetic progressions.\nErdős\nlearned about\nSchur\n's interest in arithmetic progressions and early\nRamsey\n-like conjectures and results from Hildegard Ille\n(1899\n-\n1942)\n. Now this requires a bit of explanation, because they probably had never met! ...\nErich Rothe\nwas\nPaul Erdős\n's source of reliable information on problems and conjectures in number theory that\nIssai Schur\nshared with\nRothe\n's wife Hildegard\n(\nIlle\n)\nRothe. From\nRothe\n,\nErdős\nlearned about\nSchur\n's authorship of the arithmetic progressions conjecture, proven by\nVan der Waerden\n. From\nRothe\n,\nErdős\nlearned that\nIssai Schur\nyet again contributed to number theory and\nRamsey\ntheory when he asked his graduate student Hildegard to investigate arithmetic progression-free arrays of positive integers. ...\n[\nThe\n]\nErdős\n-\nRothe\nconversations took place after Hildegard's passing in\n1942\n.\nLet us end this article by giving some details of Erhard William Rothe's career. Born in Breslau, he was seven years old when the family arrived in the United States. At the time of the\n1940\nCensus, he was in the\n3\nrd grade at school in Oskaloosa, Ohio. After secondary education he went to the University Michigan, was awarded a B.Sc. in Chemistry in\n1953\nand a Ph.D. in Chemistry in\n1959\n. From\n1959\nhe worked for General Dynamics in their Convair Division which manufactured aircraft. After ten years with General Dynamics, he became a Professor of Engineering at Wayne State University, Detroit. He worked at the\nMax Planck\nInstitute, Göttingen, each summer beginning in\n1980\nand became a Humboldt-\nPlanck\nfellow of the Humboldt Foundation, Bonn, in\n1990\n. His:-\n... achievements include co-discovery of the merging beams technique of atomic scattering, of the glory effect in molecular collisions, of the electron-hydrogen atom scattering technique, of the three-laser experiment to photodissociate isolated state-selected molecules, and of laser-based diagnostic techniques.",
  "math_areas": [
    "Applied Mathematics",
    "Number Theory"
  ]
}