{
  "nome_completo": "Honoré Fabri",
  "nome_curto": "Honoré Fabri",
  "ano_nascimento": "1608",
  "ano_morte": "1688",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fabri/",
  "lugar_nascimento": "Le Grand Abergement, Ain, France",
  "lugar_morte": "Rome (now Italy)",
  "biografia": "Honoré Fabri\n's name sometime appears with the spelling Fabry, and sometimes in the Latin form Honoratus Fabrius. The first thing we must discuss is his date and place of his birth, since there appears to be considerable disagreement on this among historians. In\n[\n9\n]\nLukens provides documents to support the date of Fabri's birth as\n8\nApril\n1608\nand also the fact that he was born in Le Grand Abergement, a small town about\n80\nkm northeast of Lyon. However other dates and places are commonly given, such as \"Belley, near Lyon in\n1607\n\" in\n[\n12\n]\n, and the most common \"\n5\nApril\n1607\nin Virieu-le-Grand, Dauphiné\" given, for example, in\n[\n1\n]\nand\n[\n6\n]\n. In fact Jules Duhem writes in\n[\n6\n]\nthat Fabri was born near the beautiful park where Honoré d'Urfé  wrote his novel Astrée, which is consistent with his claim that Fabri was born in Virieu-le-Grand. Lukens comments that he \"cannot explain these discrepancies.\" Wherever Fabri was born, certainly Honoré d'Urfé was his godfather. Fabri's family were judges in the Valromey region, related to the Vaugelas family, and the most likely cause for the confusion over Fabri's place of birth is that he lived in Virieu-le-Grand when he was a child. He attended the Institute in Belley where he developed a love for science and showed himself quick-witted and resolute.\nHe entered the Jesuit Order on\n18\nOctober\n1626\nspending two years at Avignon. In the autumn of\n1628\nhe entered the famous Collège de la Trinité in Lyon where he spent two years studying Scholastic Philosophy under Claude Boniel\n(1585\n-\n1666)\n. Boniel had entered the Jesuit Order in\n1604\nand, after studying philosophy and theology at Avignon, taught there between\n1615\nand\n1625\n. After teaching Fabri for two years in Lyon, Boniel returned to Avignon where he was appointed as Rector of the College. After completing his studies of Scholastic Philosophy at Lyon, Fabri taught grammar for two years\n(1630\n-\n32)\nat the College in Roanne. He was then sent to Rome where he began a theology course at the Collegio Romano before returning to Lyon to continue his study of theology, completing his studies in\n1636\n. He had been ordained in\n1635\n.\nHis first position was in a newly-opened Jesuit college, namely as professor of philosophy at the College in Arles, where he taught from\n1636\nto\n1638\n. He made a brilliant start to his career, teaching logic, philosophy and natural philosophy in Arles. In his lectures he taught about the circulation of blood round the body, a discovery he had made independently of William Harvey who had published his findings\nDe Motu Cordis\nⓉ\n(\nThe movement of cords\n(\nand blood in animals\n)\n)\nin\n1628\n. However, later in life Fabri wrote\n(\nsee\n[\n7\n]\n)\n:-\n... at no time did I ever say that the circulation of the blood had been first discovered by me.\nAfter leaving Arles, Fabri continued teaching in Jesuit colleges. He was professor of logic in Aix-en-Provence for a year from\n1638\nduring which time he became the leader of a group of scientists and became a life-long friend of\nPierre Gassendi\n. For six years from\n1640\n, Fabri was professor of logic and mathematics at the Collège de la Trinité in Lyon. There he taught logic, mathematics, natural philosophy, metaphysics and astronomy\n[\n1\n]\n:-\nThis period was the most brilliant and fruitful of his life; several books that he published later were developed from lectures delivered during this time. Fabri was the first of many famous professors produced by the Collège de la Trinité: his students included Pierre Mousnier, who later edited many of his teacher's lectures; the mathematician François de Raynaud, who became famous through his friendship with\nNewton\n;\nJean-Dominique Cassini\n; and\nPhilippe de La Hire\n.\nClaude Dechales\nand the astronomer and mathematician Berthet were also members of this circle. Among these scholars and the two Huygenses\n(\nfather and son\n)\n,\nLeibniz\n,\nDescartes\n,\nMersenne\n, and others an active correspondence developed.\nThe logic lectures he gave in Lyon were published by his student Pierre Mousnier in\n1646\nas\nPhilosophiae tomus primus\nⓉ\n(\nA first philosophy book\n)\n, and the lectures he gave on natural philosophy were published in the same year as\nTractatus physicus de motu locali\nⓉ\n(\nA physical treatise on local motion\n)\n. In this latter work he uses the parallelogram law for forces, correctly applying it to deduce the law of reflection and the motion of a body acted on simultaneously by two forces. In his philosophy book he included a section\nMethodus meditationis\nⓉ\n(\nA method of meditation\n)\nwhich contains a list of twenty study tips which are discussed in\n[\n18\n]\n. Peter Dear writes:-\nMost are instructions of some kind, usually just a short sentence. The most common phrases in them are of this sort: \"Examine diligently,\" \"Interrogate yourself,\" \"Deliberate,\" \"Consider attentively,\" ... The most interesting of these precepts on meditating, however, come at the end of the list: \"Seventeenth. You learn to separate in your mind all causes, to segregate each one from the others, to consider them all separately; that is, so that everything, as if stripped of its coverings, appears more distinctly.\" \"Eighteenth. Consider attentively whatever you take as a supposition, since it commonly happens, that from a mistaken supposition not having been anticipated, every error arises; in this regard, it will be of benefit to examine each supposition separately. ...\" \"Twentieth. ... to philosophise is to meditate rightly: moreover, indeed, to have without interruption the abstracted and estranged mind of a sleeper.\"\nThese works did not find favour within the Jesuit Order so he was removed from teaching and sent in\n1646\nto a Jesuit residence at Fréjus, Var. Later that year, on\n12\nSeptember, he was sent to Rome to take up an administrative position. Gabriel Thibaut wrote to his fellow Minim brother\nMarin Mersenne\nin June\n1648\nsaying that the Jesuit Fathers were doing everything they could to expel Fabri from the Jesuit Order, having unsuccessfully tried to prevent publication of his lectures. In\n1648\n, however, Pierre Mousnier was able to publish Fabri's metaphysical lectures which he had given at Lyon, under the title\nMetaphysica demonstrativa\n. It is reasonable to ask why his writings were seen to be 'dangerous' by Fabri's superiors. The main reasons appear to be Fabri's rejection of\nAristotle\n's physics and his belief that space and time were composed of indivisibles. Carla Palmerino gives an example one of Fabri's non-Aristotelian views\n[\n32\n]\n:-\nFabri was convinced of the superiority of mathematics over all other sciences and went so far as to postulate that it was necessary to apply the axiomatic method not only to physico-mathematical disciplines, but to all of philosophy.\nAlthough when Fabri was sent to Rome it was intended to be a temporary measure, he was soon assigned to St Peter's Penitentiary College which is better known as the Inquisition. In Rome Fabri met\nMichelangelo Ricci\nand this was to prove helpful to him. Despite being a member of the Inquisition, Fabri was unable to avoid religious problems himself and he was accused of believing the philosophy of\nDescartes\n. After spending a year back in Virieu-le-Grand in France in\n1668\n/\n69\n, where he went to recover his health, he returned to Rome and was put in prison. His crime seems to have arisen from his study of Saturn's rings in\n1660\n, a topic on which he became involved in a dispute with\nHuygens\nwhich ran for five years. In\nEustachii de divinis septempedani brevis annotatio in systema Saturnium Christiani Hugenii\nⓉ\n(\nFruitfulness of the divine system in the work of Christian Huygens on the Saturn system\n)\n(1660)\n(\nwritten anonymously\n)\nFabri wrote:-\nAs long as no strict proof for the motion of the earth has been found, the Church is competent to decide the issue. If the proof, however, is found, then there should be no difficulty in explaining that the relevant passages in the Bible must be interpreted in a more symbolic sense.\nThis does not seem an extreme statement but it resulted in his prison sentence. Through\nMichelangelo Ricci\n, he had made the acquaintance of the Grand Duke Leopold II and the Grand Duke saw that Fabri was released from prison after serving\n50\ndays.\nWe have seen that Fabri worked on astronomy, physics and mathematics and, in particular, we have mentioned his dispute with\nHuygens\nover Saturn's rings. Fabri did not believe that Saturn had a ring system but rather he postulated in his\n1660\nwork that Saturn had two massive but dark satellites close to the planet and two small but bright satellites farther out. After five years of argument with\nHuygens\n, he admitted his error, apologised to\nHuygens\n, and adopted\nHuygens\n' theory. Fabri also originally had an incorrect theory concerning the satellites of Jupiter which he believed moved so as to always be behind the planet, arguing that if they crossed in front of the planet, then they should be seen against the disk and also a shadow cast by the satellite should be visible on the surface of the planet. He was forced to abandon his theory when shadows were observed. Another significant contribution to astronomy is his discovery of the Andromeda nebula.\nFabri developed a theory of tides which was based on the action of the moon. He also studied magnetism, optics and calculus. In calculus he was closer to\nNewton\nthan to\nCavalieri\nbut his notation was cumbersome. His work on the calculus appeared in his major mathematical publication\nOpusculum geometricum de linea sinuum et cycloide\nⓉ\n(\nA small geometrical work on the sine curve and the cycloid\n)\n(1659)\n. He wrote this work under the pseudonym ' Antimus Farbius'  because of the controversy about the cycloid which arose following\nPascal\n's challenge. In this work Fabri computed\n∫\nx\nn\nsin\n⁡\nx\nd\nx\n\\int  x^{n}\\sin x dx\n∫\nx\nn\nsin\nx\nd\nx\n, and\n∫\nsin\n⁡\nn\nx\nd\nx\n\\int  \\sin^{n}x dx\n∫\nsin\nn\nx\nd\nx\nand other integrals. His other mathematical writings include\nSynopsis geometrica\nⓉ\n(\nSynopsis of geometry\n)\n(1669)\nand its appendix\nDe maximis et minimis in infinitum propositionumcenturia\nⓉ\n(\nOn maxima and minima in infinite propositional calculus\n)\n, written ten years earlier. Fabri had a major influence on the development of the calculus through\nLeibniz\n. The two agreed over much of their mathematical and physical ideas, although they disagreed over theological matters. For example\nLeibniz\ncriticised Fabri's\nSummula theologica in quâ quaestiones omnes alicujus momenti, quae Scholasticus agitari solent, breviter discutiuntur ac definiuntur\nⓉ\n(\nA theological treatise in which questions of any importance, which are subject to scholastic debate, are defined and briefly explained\n)\n(1669)\nwriting\n(\nsee\n[\n4\n]\n)\n:-\nI have been surprised by seeing one day in Father Honoré Fabri's\n(\none of the ablest members of his order\n)\n'Summula theologica' that he denied\n(\nas still do some theologians\n)\n, regarding divine matters, the great principle that states: two things that are equal to a third are equal to each other.\nFabri certainly proposed that one had to treat theological matters differently from physical ones, particularly when dealing with Christian ideas such as the Trinity.\nViews of Fabri's importance have varied considerably over time. He was viewed as a leading scientist by his contemporaries and elected to the Accademia del Cimento in\n1657\n, the year the Academy was founded. John Heilbron writes\n[\n26\n]\n:-\nLeibniz\nplaced him with\nGalileo\n,\nTorricelli\n, Steno and\nBorelli\nfor his work on elasticity and the theory of vibrations, and alone with\nGalileo\nfor his efforts to 'rationalise experimental kinematics'. ...\nMersenne\nrated him 'a veritable giant in science' ... the Accademia del Cimento esteemed Fabri, whose 'candor makes his learning additionally agreeable'. ...' I think the keenness of this priest's mind is truly admirable,'\n[\nJ A Borelli\n]\nwrote to Leopold, 'as well as the great learning, frankness, and conviction with which he treats innumerable difficult and recondite matters'.\nHowever, over the years historians have tended to be critical of Fabri's contributions, seeing him as a defender of traditional theories rather than an advocate for the new physics which was flowering in his time. One must, of course, understand the difficult position that Fabri was in, for his views, which are seen as too traditional by many historians, were sufficiently daring to see him continually in trouble with the Church. As Knowles Middleton writes in\n[\n27\n]\nconcerning Fabri's\nDialogi physici, in quibus de motu terrae  disputatur, marini aestus nova causa proponitur, necnon aquarum et mercurii supra libellam elevatio examinatur\nⓉ\n(\nPhysical dialogues:  in which the motion of the earth is debated,  a new cause of heat is displayed, as well as level of water or mercury under change of height\n)\n(1665)\n:-\nThe book gives the distinct impression that its author was really highly sympathetic to the new cosmology, and it may be that his position as a Papal Penitentiary influenced him to appear to fight a rearguard action in defence of the old theories.\nAgain Domenico Meli writes in\n[\n29\n]\n:-\n... it appears that Fabri was highly unpopular both among the most conservative Jesuits, who saw him as dangerously close to novelties, and among the neoterics and especially Borelli, who saw him as a champion of the old philosophy trying to contrast them on their own ground.\nMichael Elazar had recently done much to restore Fabri's reputation. For example, he discusses Fabri's theory of impetus in\n[\n7\n]\n. This is an area where previously historians, such as Alexandre Koyré in\nÉtudes Galiléennes\n(1939)\n, have tended to be highly critical of Fabri:-\n[\nFabri's\n]\nconcept of impetus should not be seen as a backward device serving to fight the New Science, but should rather be deemed a sophisticated tool for assimilating it. In particular, regarding Fabri's concept of impetus as alien to inertia is simply wrong; for Fabri carefully redefined the concept of impetus, as well as the causal connection between impetus and motion, so as to be able to smoothly assimilate the basic idea behind \"inertia\", i.e. the tendency of a moving and unhindered object to continue its motion with uniform velocity and along a straight line ad infinitum. Fabri, eager to adopt linear conservation of motion - officially and explicitly published only in\nDescartes\n' 'Principia'\n(1644)\n- achieved this by defining\n(\nin\n1646)\nimpetus as a formal\n(\nrather than efficient\n)\ncause of motion, thus evading the argument Koyré would raise\n(\nthree centuries after Fabri\n)\nagainst the compatibility of impetus and inertia. In order to ensure the linearity of the motion conserved, Fabri followed\nGiovanni Battista Benedetti\n, against the medieval impetus tradition, in limiting the action of impetus to straight lines. Moreover, although Fabri - unlike\nDescartes\nbefore him and Newton after him - did not define linear conservation of motion as a law of nature, nevertheless it was an integral part of what could be described as his \"inertial framework\", which was expressed also by the analysis of natural phenomena in vacuum, by support for\nGalileo\n's claim concerning the universal velocity of fall in the void, and by the abstraction of air resistance from the analysis of motion. Fabri actually used linear conservation of motion within the discrete analysis he developed as a \"mirror image\" of Galileo's\n(\ncontinuous\n)\ntreatment of free fall, and took pains to prove that this discrete analysis - a product of the seventeenth, not the fourteenth, century - converges\n(\nassuming infinitesimal instants\n)\nto\nGalileo\n's famous \"odd numbers\" law. Fabri is indeed far from being an opponent of vacuum, and contrary to Buridan and many of his contemporaries never denies motion devoid of any resistance, i.e. motion in the void. Rather, Fabri claims that the\n(\nfull\n)\nuniverse is immersed in an infinite vacuum, and passionately defends the scientific validity of the concept of void, both by sharply attacking the \"paradoxes\" formulated by\nAristotle\nto prove the \"absurdity\" of the concept of void, and by severely criticizing Descartes' anti-vacuist reduction of matter to extension.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}