{
  "nome_completo": "Horst Sachs",
  "nome_curto": "Horst Sachs",
  "ano_nascimento": "1927",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sachs/",
  "lugar_nascimento": "Magdeburg, Germany",
  "lugar_morte": "Ilmenau, Germany",
  "biografia": "Horst Sachs\nwas the son of Erich Sachs and Ema Griebsch. Horst was twelve years old when World War II started and at that time was studying at school in Magdeburg. Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them and at this stage a relatively normal life was still possible for the young boy. However, on\n22\nJune\n1941\nGermany broke the non-aggression pact and invaded the Soviet Union. All appeared very positive as Germany swept all before it but the situation changed in February\n1943\nwhen the German army, which had been attacking Stalingrad since August\n1942\n, surrendered to the Russians. For the first time the German government publicly announced to its people a failure in its war effort. On\n18\nFebruary\n1943\nJoseph Goebbels made a speech telling Germans that they had to accept \"total war\". When Sachs was fifteen years old he had been made a gunner operating an anti-aircraft gun, then at age sixteen he was, for a short time, in the Reich Labour Service. This was set up to militarise the German workforce and to promote Nazi ideology. Six months in the Reich Labour Service was compulsory before military training.\nSachs' military training began in the autumn of\n1944\nin the infantry. He said\n[\n6\n]\n:-\nMy basic training took place in the Vorharz near the town of Halberstadt, where there were underground works in which parts of the aircraft, probably also parts of the V-weapons, were produced. We recruits had to watch as concentration camp inmates\n(\nfrom the Langenstein-Zwieberge camp\n)\nworking in these factories were mistreated until they collapsed - but our officers were silent. At the beginning of\n1945\nI was transferred to the training area at Bergen, in the immediate vicinity of which was the Belsen concentration camp. Every day we saw people - men and women, haggard and clothed in rags - brutally kneaded together for no reason. We saw the crematoria and knew that there were mass graves under the surrounding hills - but our officers were silent.\nIn April\n1945\nBritish troops were advancing towards the Ibbenbüren Ridge which was defended by young German soldiers and their instructors. Sachs was one of the defenders and, when the Germans were defeated, after inflicting heavy casualties on the British, he was taken prisoner. He was taken first to Belgium and held in a prisoner of war camp where the conditions were very poor indeed. Treatment by the guards was bad and the prisoners were given very little food. The camps in Belgium were then closed down and all the prisoners were transferred to Britain by late July\n1946\n. Sachs was actually transferred in June\n1946\n. He was assigned to the Royal Air Force and given the highly dangerous task of defusing bombs and breaking them down into their components. In July\n1947\nhe was able to return to his parents in Magdeburg.\nBack in Magdeburg he was able to attend courses designed for those whose education had been disrupted by the war. He passed his\nAbitur\nin May\n1948\nbut entering university at this time was not easy. Sachs was one of a great many young men who had served in the military at a time when they should have been attending high school, so he received his Abitur at the same time as a great many others who wanted to continue their interrupted studies or wanted to apply to begin a university course. Sachs was helped by the fact that his grades had been excellent but, nevertheless, he had to give up the idea of studying languages because of the numbers of applicants, and chose instead to apply to the University of Halle to study mathematics. He began his studies in the autumn of\n1948\n. He said\n[\n6\n]\n:-\nI studied in Halle for five years. At that time, the relationships between professors and students were a little different to what they are today: we regarded our professors as more or less \"higher beings\" - which some of them probably liked. I soon realized that the professor among all the professors who claimed to be the greatest authority was by no means the leading mathematician. But I must point out that all my teachers were basically kind people to whom I owe respect and thanks.\nSachs' favourite professor was Herbert Grötzsch\n(1902\n-\n1993)\n, an expert on graph theory who had been a student of\nPaul Koebe\n. He found Grötzsch's lectures particularly clear, but he also found him to be very friendly and helpful. Because of his excellent performance, Sachs was awarded a scholarship. Although it did not pay much, he did not have many needs and he still wore the acid green \"battle dress\" which he had been given as a British prisoner of war.\nAt the end of World War II, in\n1945\n, Halle and other areas of east Germany were occupied by Soviet troops. The Soviet authorities began handing over power to German Communists in\n1948\n. In\n1949\n, while Sachs was a student at the University of Halle, the German Democratic Republic\n(\nGDR\n)\nwas established. In\n[\n6\n]\nhe explained that this had relatively little impact on students at that time:-\nWe students did not much notice the founding of the GDR. There was no striking difference between the old Soviet occupation zone and the young GDR. Of course, the authorities were no longer under the authority of the Soviet Military Administration ... I watched closely\n(\nas far as possible\n)\nwhat was going on politically, but I also knew how little scope there was for politics. Stalin died in\n1953\n, and the first decisions of the new Soviet leadership\n(\nrehabilitation of Stalin victims\n)\nlooked very promising. So I said to myself: now you cannot stand apart anymore. In June\n1953\nI became a candidate of the SED, and after a two-year candidacy I became a member. In principle, I had no problems with the party, in particular, however, many proved worthy of criticism. There were honest dogmatists, and there were also many whose methods were quite questionable.\nIn\n1953\nSachs was awarded his Diploma in mathematics from the Martin Luther University of Halle. After graduating, Sachs became an Aspirant. This was a position set up by the authorities to allow graduates to further their education. The only duties were giving two hours of lectures a week, otherwise Sachs could concentrate on his research. His thesis advisor was Herbert Grötzsch. After eighteen months he became an assistant which had the benefit of having stronger links with his thesis advisor. He married Barbara Nowak on\n10\nOctober\n1956\n.\nSachs was awarded his doctorate in\n1958\nfor his thesis\nBeiträge zur Theorie gewisser isoperimetrischer Probleme\nⓉ\n(\nContributions to the theory of certain isoperimetric problems\n)\n. By the time he received his doctorate he had already published the\n37\n-page paper\nUntersuchungen über das Problem der eigentlichen Teiler\nⓉ\n(\nStudies on the problem of the actual divider\n)\n. Remarkably he published eight papers in\n1958\n-\n59\n. These were:\nÜber eine Klasse isoperimetrischer Probleme\n. I\nⓉ\n(\nOn a class of isoperimetric problems. I\n)\n;\nÜber eine Klasse isoperimetrischer Probleme\n. II\nⓉ\n(\nOn a class of isoperimetric problems. II\n)\n;\nÜber eine Klasse isoperimetrischer Probleme\n. III\nⓉ\n(\nOn a class of isoperimetric problems. III\n)\n;\nÜber eine Klasse isoperimetrischer Probleme\n. IV\nⓉ\n(\nOn a class of isoperimetric problems. IV\n)\n;\nZur Theorie gewisser geometrischer Funktionale und zugehöriger isoperimetrischer Probleme\nⓉ\n(\nTheory of certain geometric functionals and related isoperimetric Problems\n)\n;\nÜber Verallgemeinerungen der Steinerschen Symmetrisierung\n. I\nⓉ\n(\nOn generalizations of Steiner symmetrization. I\n)\n;\nÜber Verallgemeinerungen der Steinerschen Symmetrisierung\n. II\nⓉ\n(\nOn generalizations of Steiner symmetrization. II\n)\n;\nÜber Verallgemeinerungen der Steinerschen Symmetrisierung\n. III\nⓉ\n(\nOn generalizations of Steiner symmetrization. III\n)\n.\nAfter the award of his doctorate, Sachs worked towards submitting an\nhabilitation\nthesis. He explained how he came to work in this area\n[\n6\n]\n:-\n... with my choice of Habilitation topic I went into graph theory. I was looking for the area myself, that was a condition for the habilitation. I had previously - who did not do that - played with the four-colour-theorem. I must give Grötzsch a large share in my decision, because he, whom I value as a mathematician\n(\nhis great achievements are in the field of conformal mapping\n)\n, was intensively involved with such questions. Others said: that's not proper mathematics, leave that, nothing will come out of it. I thought: that's not true, anyone who does not consider the four-colour conjecture as a central mathematical problem, can not have a profound relationship with mathematics. Grötzsch, in the correct understanding of the developing trend, had already predicted in the fifties a \"renaissance of the mathematics of discrete configurations\" and contributed strongly to it\n(\na three-colour theorem for triangular planar graphs bears his name today\n)\n.\nIn\n1959\nSachs spent eight weeks in Budapest on a research visit. At that time he was able to have discussions with many leading mathematicians, many working on topics related to the work he was undertaking for his habilitation thesis. He met, and had discussions with,\nPaul Erdős\n,\nRosa Péter\n,\nPaul Turán\n,\nAlfred Rényi\n,\nLászló Rédei\n, György Hajós\n(1912\n-\n1972)\n, Béla Szökefalvi-Nagy\n(1913\n-\n1998)\nand Tibor Gallai\n(1912\n-\n1992)\n. Gallai, who had been a student of\nDénes Konig\n, worked on combinatorics and graph theory. He was a particularly strong influence on Sachs. Of his visit to Budapest, Sachs wrote\n[\n6\n]\n:-\nI came as a young, unknown assistant, and got in touch with everyone quickly. We sat in a cafe and started mathematical discussions. I had never experienced such open-mindedness towards a young man. In Budapest, I received significant impetus. It was a short period of time, but when I came back, I knew which direction my habilitation thesis should take. From Gallai I had received many suggestions, his way of thinking fitted in with mine.\nSachs habilitated at the Martin Luther University of Halle in the spring of\n1963\nand, immediately, was offered a professorship at the Technical University of Ilmenau. He said\n[\n6\n]\n:-\nI did not originally intend to stay in Ilmenau. So far, my studies and my professional life, had moved on every five years. In\n1968\n-\n69\nI also got offers from Berlin, Dresden and Halle - I rejected them all. Something had gone wrong with Halle before that: Grötzsch had insisted on me being offered his chair in\n1967\nwhen he retired, but then people who I do not know put a stop to it. I was not really angry: Halle had such a chemical-polluted atmosphere, and here in Ilmenau there was such wonderfully pure air that I did not want to go back to Halle: my wife and I were happy to have the forest and the mountains around us.\nA summary of his mathematical works is given in\n[\n2\n]\n:-\nThe 'Zentralblatt' lists\n105\nscientific publications,\n62\nof them single authored, constituting Sachs' excellent reputation as a mathematician. Many of his papers deal with algebraic properties of graphs like for example the spectrum of their adjacency matrices; in fact, the best known one is perhaps the monograph 'Spectra of Graphs'\n(1980)\nwith D M Cvetkovi and M Doob. His textbook 'Einführung in die Theorie der endlichen Graphen' in two volumes\n(1970)\nwas one of the very few comprehensive presentations of the state of the art in graph theory those days and a valuable source of inspiration for many researchers. Apart from pure mathematics, Sachs successfully cooperated with chemists\n(\nwhere he worked out interesting connections to graph theory\n)\nand physicists, and was interested in the history of mathematics.\nIn the review\n[\n3\n]\nof the first of the books mentioned in the above quote, Ron Graham writes:-\nThe field of graph theory\n(\nand, more generally, combinatorics\n)\nis currently undergoing a remarkable period of growth and development. This is no doubt owing in large part to the increased awareness of the wide applicability of the concepts, techniques, and results of graph theory, not only to traditional areas of mathematics but also to other scientific disciplines such as chemistry, physics, the social sciences, and especially computer science. As a mark of this maturation, it will be essential that graph theory develop a closer symbiosis with more classical areas of mathematics. This volume is an excellent compendium of this kind of development, focusing on the rich interplay between graph theory and linear algebra. ... The authors are to be commended for having produced this scholarly and timely book.\nWilly Moser\n, reviewing the second mentioned two-volume textbook writes in a review:-\nThe choice of material from introductory to substantial and current ensures that this book will appeal to a large class of mathematicians and students. Indeed, these two volumes may well be the text and reference book for many years in those areas of finite graph theory that the author has chosen to illuminate with his considerable expository skills.\nThese are not Sachs' only books. There is\nEbene isotrope Geometrie\nⓉ\n(\nPlane isotropic geometry\n)\n(1987)\n. Oswald Giering begins a review with the following sentence:-\nThe book, derived from lectures of the author, addresses interested students at the university and high school level. In the framework of the Erlangen program it discusses the plane isotropic geometry of several transformation groups\n(\nparticularly the isotropic geometry of motions\n)\n, using the methods of analytic geometry and elementary differential geometry.\nThree years later, in\n1990\n, Sachs published\nIsotrope Geometrie des Raumes\nⓉ\n(\nIsotropic geometry of space\n)\n. Again Oswald Giering reviewed the work, beginning the review with the sentence:-\nIn the framework of\nCayley\n-\nKlein\ngeometries, the author treats for the first time three-dimensional simply isotropic geometry in a textbook manner.\nFor the contents of these books, see  ...\nThe article\n[\n6\n]\ngive a fascinating account of Sachs' political views, particularly those towards the German Democratic Republic. The following is modified from the introduction to\n[\n6\n]\n:-\nTo live as a scientist in the GDR\n(\nformer East Germany or DDR\n)\nalso meant to lead a political life. One choice was to live in opposition to the system, and the other was to come to terms with it. Some found this difficult to do, others did not. Professor Horst Sachs\n(70)\nfrom Ilmenau, who settled down in the GDR, looks back with gratitude, even nostalgia on this state, and who claims that even today socialism cannot be dismissed that easily. The septuagenarian Sachs, who retired in\n1992\n, views the Change as an annexation by the Federal Republic and as the victory of money.\nFor further extracts from\n[\n6\n]\nrelating to Sachs' political views, see\nTHIS LINK\n.\nSachs was a fellow of the Institute of Combinatorics and its Applications and was awarded its\nEuler\nMedal in\n2000\n. He was also an honorary member of the International Academy of Mathematical Chemistry.\nAfter retiring in\n1992\nhe continued to undertake research and regularly visited the Institute at Ilmenau. His last paper,\nThe asymptotic covering density of generalized Petersen graphs\n, written jointly with Peter E John, was published in\n2011\n.\nLet us end this biography with this quote from\n[\n2\n]\n:-\nHe always made high demands on scientific quality as well as on clarity. Whereas most of us would enjoy a beautiful proof but consider a problem to be solved if there is just any correct proof, Sachs took a step further and considered a problem to be finally settled only if it comes with a beautiful solution, in terms of transparency and precision\n(\nand other, more subjective measures\n)\n.",
  "math_areas": [
    "Algebra",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}