{
  "nome_completo": "Hsien Chung Wang",
  "nome_curto": "Hsien C Wang",
  "ano_nascimento": "1918",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wang/",
  "lugar_nascimento": "Peking (now Beijing), China",
  "lugar_morte": "New York, USA",
  "biografia": "Hsien Chung Wang\nstudied at Nankai High School in Tientsin. He began his university studies at Tsing Hua University in Peking in\n1936\n. His original intention was to take a degree in physics so he began his studies taking courses which would lead to this degree.\nOn\n7\nJuly\n1937\nJapanese and Chinese troops clashed near Peking. In late July further fighting broke out and the Japanese quickly captured Peking and Tientsin. Tsing Hua University was moved to Southwest China where it was amalgamated with Nankai and Peking universities. Wang had to journey to the new site of his university and begin his studies again. Perhaps the political events had a positive effect as far as mathematics was concerned since Wang changed his studies to mathematics when he took them up again at the re-established university.\nWang graduated in\n1941\nand began to study under\nS S Chern\n. He was awarded a master's degree in\n1944\nand began teaching in a school. However, after one year, he was awarded a British Council Scholarship to continue his studies in England. After a while at Sheffield he studied under\nNewman\nat Manchester and received a Ph.D. in\n1948\n.\nOn his return to China, Wang took up a research post at the Chinese National Academy of Sciences. However political events were again to play a major part in Wang's career. Between early November\n1948\nand early January\n1949\nthe Communists and Nationalists fought for control. The National Government re-established itself on Taiwan where it had withdrawn early in\n1949\n. The Chinese National Academy of Sciences was set up on Taiwan and Wang followed the Academy there.\nFrom\n1949\nWang lived in the United States. This was not an easy time to obtain a mathematics post in the United States and Wang, although he had an impressive reputation as a mathematician by this time, could only manage a succession of temporary posts. First he taught at Louisiana State, then for two years at Baton Rouge before he spent his first year at Princeton in\n1951\n-\n52\n. Again he held temporary posts, this time for two years at Alabama Polytechnic, then\n1954\n-\n55\nat Princeton again,\n1955\n-\n57\nat the University of Washington in Seattle followed by a time at Columbia in New York. Wang married during his time in Seattle.\nThe year\n1957\nsaw Wang receive an offer of a permanent post for the first time. This was at Northwestern University where he remained, having further spells at Princeton during this time, until\n1966\nwhen he was appointed to Cornell.\nWang worked on\nalgebraic topology\nand discovered the 'Wang sequence', an exact sequence involving\nhomology groups\nassociated with fibre bundles over spheres. These discoveries were made while he worked with\nNewman\nin Manchester. Wang also solved, at that time, an important open problem in determining the closed\nsubgroups\nof maximal rank in a compact\nLie group\n.\nWang's most important work was on discrete subgroups of Lie groups, a topic on which he continued to work. He published\nTwo-point homogeneous spaces\nin\n1952\nwhich dealt with a homogeneous space of a compact Lie group. In\n1960\nhe studied transformation groups of\nn\nn\nn\n-spheres and wrote the highly original paper\nCompact transformation groups of\nS\nn\nS^{n}\nS\nn\nwith an\n(\nn\n−\n1\n)\n(n-1)\n(\nn\n−\n1\n)\n-dimensional orbit\n.\nThe latter part of Wang's life is described in\n[\n1\n]\nas follows:-\nWang's last paper was published in\n1973\n, after which his research was much curtailed because of anxiety for his wife, who had developed cancer. His teaching and other mathematical and administrative activities continued unabated, however, and he played an important role in the department at Cornell. He was very much liked there, as everywhere, for his modesty, generosity, kindness and curtsey. He was a fine teacher and lecturer. ... He enjoyed excellent health until he was suddenly stricken with leukaemia in June\n1978\n. He succumbed within weeks, to be survived for only a few months by his wife.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Topology"
  ]
}