{
  "nome_completo": "Hubert Stanley Wall",
  "nome_curto": "Hubert Wall",
  "ano_nascimento": "1902",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wall_Hubert/",
  "lugar_nascimento": "Rockwell City, Calhoun County, Iowa, USA",
  "lugar_morte": "Austin, Travis County, Texas, USA",
  "biografia": "Hubert Wall\n's parents were Samuel Hubert Wall\n(\nborn in Elliott, Montgomery County, Iowa on\n20\nNovember\n1875\n- died in Lytton, Calhoun County, Iowa on\n19\nMay\n1954)\nand Gratia A Wright\n(\nborn in Center, Calhoun County, Iowa in February\n1879\n- died Lytton, Calhoun County, Iowa in\n1939)\n. Samuel and Gratia were married on\n26\nFebruary\n1902\nand had three sons, Hubert\n(\nthe subject of this biography\n)\n, Louis\n(1905\n-\n1905)\nwho died when three weeks old, and Harold\n(1906\n-\n1989)\n. Hubert began his education in his home town of Rockwell City, attending the High School there. He graduated from the Rockwell City High School in June\n1920\nand, later that year, began his studies at Cornell College, Mount Vernon, Iowa.\nAt Cornell College, Wall studied a wide range of subjects, including languages, physics, chemistry and mathematics. However, it was his mathematics lecturer who had the greatest influence on the young man. Elmer Earl Moots\n(1882\n-\n1970)\ntaught Engineering and Mathematics at Cornell College and he inspired Wall to study mathematics at university. Moots had a reputation for advising his best students to undertake graduate work at the University of Wisconsin, Madison, so it is not surprising that he gave this advice to Wall who indeed entered that University in\n1924\n. At the University of Wisconsin Wall's thesis advisor was\nEdward Van Vleck\nand Wall was awarded his Ph.D. in\n1927\nfor his thesis\nOn the Padé Approximants Associated with the Continued Fraction and Series of Stieltjes\n. He published a paper with the same name as his thesis in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1929\n. The paper contains the following note:-\nPresented to the Society, April\n16\n,\n1927\n; received by the editors, June\n11\n,\n1928\n. This paper is essentially a thesis prepared at the suggestion of Professor\nE B Van Vleck\nat the University of Wisconsin.\nWall later wrote about his thesis advisor\n(\nsee\n[\n3\n]\n)\n:-\nI was profoundly influenced by the teaching and discoveries of\nVan Vleck\n[\nwho\n]\nloved to explore and survey wide areas, and to teach. In his reading he liked to pick out only the definitions and theorems and then to supply his own proofs.\nAfter submitting his thesis, Wall went to Germany and worked at Göttingen with\nDavid Hilbert\nfor a few months before returning to the United States to take up a position at Northwestern University, Chicago, in the autumn of\n1927\n. Over the following years he produced an excellent series of papers on\ncontinued fractions\nsuch as:\nOn extended Stieltjes series\n(1929)\n;\nOn the Padé approximants associated with a positive definite power series\n(1931)\n;\nConvergence criteria for continued fractions\n(1931)\n;\nGeneral theorems on the convergence of sequences of Padé approximants\n(1932)\n;\nOn the relationship among the diagonal files of a Padé tabl\ne\n(1932)\n;\nOn the expansion of an integral of Stieltjes\n(1932)\nand\nOn the continued fractions which represent meromorphic functions\n(1933)\n. Wall spent the academic year\n1938\n-\n39\nat the Institute for Advanced Study at Princeton. Then in\n1939\nhe was instrumental in bringing\nErnst Hellinger\nto the Northwestern University, a move which saved\nHellinger\n's life.\nHellinger\nhad been arrested by the Nazis and put into the Dachau concentration camp. Wall was able to arrange a temporary position for\nHellinger\nat Northwestern University and he was released from the Dachau camp after six weeks on condition that he emigrate immediately\n[\n3\n]\n:-\nIn anticipation of\nHellinger\n's arrival, Wall started studying differential equations from\nHellinger\n's point of view\n(\nwhich was similar to the point of view of\nHilbert\nand\nCourant\n)\n. As a result, Wall later wrote 'Creative Mathematics' very much in the modern spirit of differential equations in which existence, uniqueness, qualitative study, and numerical computation are emphasized over 'closed form' solutions. Wall worked closely with\nHellinger\nat Northwestern; they published a paper together, and Wall continued to work in the area of what became known as the\nHellinger\nintegral.\nWall's interaction with\nHellinger\nled to them running an analysis seminar in which they adopted the method of teaching where students have to work out the proofs themselves given only brief hints. We note that, as we mentioned above, Wall had observed\nVan Vleck\nadopting this approach when reading papers. Walter T Scott said\n[\n4\n]\n:-\nThe origin of that seminar was a non-credit course, really, designed originally just to read papers in which people were interested. It had one great attraction, though. Following the regular seminar there was a delayed seminar where everyone adjourned to have a beer or two, and this was a traditional Wednesday evening affair.\nWall explained his ideas on teaching in the Preface to\nCreative Mathematics\n(1963)\n. You can read a version of the Preface of this book at\nTHIS LINK\n.\nIn\n1944\nWall left Northwestern University and spent two years at the Illinois Institute of Technology. After he had been at the Institute for a year he wrote an article for the 'Illinois Institute of Technology Newspaper':-\nAs my first year at the Institute draws to a close , I look forward with a pleasant sense of anticipation to future years here. I feel that there is a spirit of progress which is not satisfied to develop just average engineers, but which seeks rather to find and develop superior scientists. . . . Uppermost in the minds of\n[\nprofessors\n]\nis the desire to help the student develop the ability to set up and solve problems, and to make free use of mathematics. I believe progress can be made in that direction. Perhaps the fault lies in the prevalent idea that mathematics is a kit of tools all arranged in little packages. Over the years this has come to be reflected in our textbooks, which in trying to meet the demand for more and more tools in the kit, have reached the point where one can question whether we are teaching mathematics. To illustrate, I believe it would be quite impossible to find out what an integral is from our present calculus text. We teach the integral as a \"tool\" but fail to teach what the integral is. I wonder if mathematics isn't rather a state of mind, an analytical mind, which can size up a situation, discard the unimportant, fit disorganized facts into a pattern, and know when a problem is solved. If we approach the teaching of mathematics with this as our axiom, it might be that we could make essential progress. For instance, we would no longer apply the old principle of supplying answers to problems! Part of the scientific mind is the critical ability to know when the problem is solved. Rather than being a tool subject, I believe mathematics is an art - the purest form of art, in which the mind is the instrument of expression. This is the art which takes chaos and builds from it a magnificent structure of order and reason.\nHe may have looked \"forward with a pleasant sense of anticipation to future years\" at the Illinois Institute of Technology but after one further year he moved to the University of Texas where he spent the rest of his career. Walter Scott said\n[\n4\n]\n:-\nI remember soon after his arrival in Texas, he gave me a hard time about not making him believe all of those lies I had been telling about Texas! He really felt when he came to Texas, that it was in fact, a homecoming for him.\nAt the University of Texas, Wall continued to further develop his teaching methods\n[\n4\n]\n:-\n... when Wall came to The University of Texas, it was natural for him to utilize the seminar method of instruction even more fully, and this he did. ... in looking at some of the letters, I had a few of them, his enthusiasm for what his students were doing was amazing. He characterized a student as a potential\nHardy\nor a potential\nF Riesz\non the basis of his proofs of a theorem or two in seminar, and this enthusiasm certainly had an effect on his students - there's no doubt.\nThe article\n[\n6\n]\nlists\n51\npapers by Wall, the first\n40\nof them written before he moved to the University of Texas. One of his first publications after going to Texas was his book\nAnalytic Theory of Continued Fractions\n(1948)\n. You can read Wall's Preface at\nTHIS LINK\n.\nR C Buck writes in a review of Wall's book:-\nAs indicated in the title, the author restricts himself to the study of continued fractions with complex terms from the viewpoint of analytic function theory; no attempt is made to treat the arithmetic aspects of continued fractions or their connections with the theory of numbers. This, together with the large body of new results obtained in recent years, permits the overlap of the present book with that of\nPerron\n[\nDie Lehre von den Kettenbrüchen,\n2\nnd\nedition,\n1929]\nto be relatively slight. Generally speaking, only the work of the author and his students is fully represented; however, the bibliography and references to recent literature are more than adequate, the former filling nine pages.\nW J Thron writes in the review\n[\n7\n]\n:-\nThis is the first volume to appear in \"The University Series in Higher Mathematics\" which is planned to be a collection of \"advanced text and reference books in pure and applied mathematics.\" In order to make the book suitable as a text book the author gives detailed proofs and includes material which might be unfamiliar to \"a student of rather modest preparation.\" Into this category fall such topics as: the\nStieltjes\n-\nVitali\ntheorem,\nSchwarz\n's inequalities, matrix calculus, elementary properties of the\nStieltjes\nintegral, and basic concepts and formulae of the theory of continued fractions. To increase its usefulness as a text the book is provided with\n131\nexercises, grouped together at the end of each chapter. The material covered in this book is of such a nature that it or parts of it would make very attractive subject matter for graduate seminars. It is to be hoped that the book will thus contribute to spreading knowledge of and interest in the analytic theory of continued fractions among a larger group of people. Numerous and important additions have been made to the analytic theory of continued fractions since the appearance of\nPerron\n's 'Die Lehre von den Kettenbrüchen'  in\n1913\n. Only a few of these results were incorporated into the second edition of\nPerron\n's book in\n1929\n. It is thus clear that the publication of the present book which brings so much, though unfortunately not all, of this material together in a single volume was welcomed by workers in this and in related fields.\nAs to his research contributions, let us extract some comments by Walter Scott from his speech\n[\n4\n]\n:-\nWall's interest was primarily continued fractions and continued fraction-related concepts. ... His research contributions are substantial ... What Wall did to the theory of continued fractions was to synthesize a large part of it. The major item, I would say, was the theory of positive, definite-continued fractions, including J-fractions. ... In another area, there were the convergence results for continued fractions. ... A third area in which Wall made a very substantial contribution was the characterization of\nHausdorff\nMoments by means of continued fractions, and also some continued fraction transformations which enabled him to obtain inclusion relations for\nHausdorff\nSummability Methods. A fourth area was the area of Harmonic Matrices and the continued fraction integral\n(\nor continuous continued fraction\n)\n, and in this he reworked and generalized results that correspond to the differential analogue of the linear equations that go into the Jacobi matrix. A fifth area is one in which he didn't publish anything and yet in which he had a substantial research interest, and that is the\nHellinger\nIntegral.\nWe have referred to Wall's book\nCreative Mathematics\nseveral times above. In it Wall explained what 'mathematics' meant to him:-\nMathematics is a creation of the mind. To begin with, there is a collection of things, which exist only in the mind, assumed to be distinguishable from one another; and then there is a collection of statements about these things, which are taken for granted. Starting with the assumed statements concerning these invented or imagined things, the mathematician discovers other statements, called theorems, and proves them as necessary consequences. This, in brief, is the pattern of mathematics. The mathematician is an artist whose medium is the mind and whose creations are ideas.\nTom Schulte reviewed the book in\n[\n5\n]\n. He writes:-\n[\nWall\n]\ndeveloped this book over those years of working with students at the University of Texas. Applying the 'Moore Method'\n[\nnamed for\nRobert Lee Moore\n]\n, his aim was to lead students to develop their mathematical abilities and intuition. Wall himself called this book \"a sketchbook in which readers try their hands at mathematical discovery.\"  That is a fair and accurate assessment. What it lacks in depth it makes up for in breadth. Over less than two hundred pages the reader travels from elementary number theory to simple graphs, from integrals and surfaces to linear spaces of simple graphs. Requiring little formal mathematical knowledge from the reader, this book is an excellent if breathless tour of a wide swath of basic mathematics. It can also work as an adjunct to more traditional study, whether in a classroom or out. Obviously, these techniques have a proven history in the classroom, but the material on any given specific subject is given too brief a treatment here to support more than a lecture or two. As part of the\nMathematical Association of America\nClassroom Resource Materials series, the book is intended for just that: supplementary classroom material for students with an unusual approach for presenting mathematical ideas.\nWall was an invited principal speaker at the 'International Conference on\nPadé\nApproximants, Continued Fractions and Related Topics' held at the University of Colorado, Boulder, in June\n1972\n. However, he died before the conference took place and the Proceeding of the conference were dedicated to Wall. The editors, William B Jones and W J Thron, write in the Introduction:-\nPadé\napproximants and continued fractions are closely related to many disciplines of pure and applied mathematics, including analytic function theory, the theory of moments, asymptotics and summability of divergent series. ...  These proceedings are dedicated to the late Professor H S Wall, whom we had hoped to have as a principal speaker when we first planned the conference.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}