{
  "nome_completo": "Hugh MacColl",
  "nome_curto": "Hugh MacColl",
  "ano_nascimento": "1837",
  "ano_morte": "1909",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacColl/",
  "lugar_nascimento": "Strontian, Argyllshire, Scotland",
  "lugar_morte": "Boulogne-sur-Mer, France",
  "biografia": "Hugh MacColl\n's parents were John MacColl, a shepherd and farmer, and Martha Macrae. John and Martha were married in February\n1823\nand they had six children, four boys and two girls. Hugh was the youngest in the family. John MacColl was an educated man who taught his older children some Latin, Greek and mathematics. However, Hugh did not benefit from his father's teaching since John MacColl died when Hugh was only three years old. Since Martha MacColl spoke only Gaelic, this meant that Hugh's first language was Gaelic. The family moved first to Letterfearn on Loch Duich, near to Kyle of Lochalsh, where Hugh's grandmother Anne Macrae lived. After a while, Malcolm MacColl, Hugh's elder brother by four years, remained with his grandmother in Letterfearn while Hugh, his mother and the other children moved to Ballachulish, south of Fort William. Only after the move to Ballachulish did Hugh begin to learn English. Malcolm became a schoolteacher, then was ordained as a priest in the Episcopal Church. He supported the education of his younger brother Hugh who had been hoping to study mathematics at Oxford. When Malcolm was dismissed by his Bishop, he was no longer in a position to provide financial support for Hugh who had to give up his ideas about studying at Oxford.\nIn\n1858\nHugh MacColl moved to England where he taught at various schools until\n1865\nwhen he moved to Boulogne-sur-Mer in France. While still in England, he married Mary Elisabeth Johnson, from Loughborough in Leicestershire, and they set up home together in Boulogne where their four girls and one boy were born. This move seems to have been well thought out for, not only was Boulogne a prosperous town with much to offer the well-educated, it also had the advantage of having close links with England so MacColl could in many ways have the best of both worlds\n[\n2\n]\n:-\nMacColl's Boulogne was a vivid French port with a truly British flavour. At this time, English shops and pubs, various Protestant churches, English surgeons and undertakers, local newspapers and regular theatre productions in English were natural facets of a balanced and liberal form of urban life. ... the British inhabitants of Boulogne kept up their genuine forms of interaction and communication. Merridew's English Library and its club-like Reading and Conversation Rooms fully equipped with Britain's major newspapers and reviews, like the 'Westminster' or the 'Edinburgh Review', was a well known institution of Boulogne's cultural life. Apparently, MacColl frequented the place: a letter to Bertrand Russell on the Reading Room's writing paper has been preserved.\nWhen MacColl arrived in Boulogne he began teaching mathematics and English at the Collège Communal in the town. He also took up giving private lessons soon after he arrived in Boulogne and, certainly by\n1870\n, he was no longer teaching at the Collège Communal and supporting himself entirely by giving private tuition. He had published 'a pamphlet on ratios' in\n1861\nbefore moving to France, but once in Boulogne he became much more active in publishing, particularly in the 'Questions, Problems' section and in the 'Solutions' section of the\nEducational Times\n. He studied for a University of London degree, matriculating first in\n1873\nand taking his final B.A. examinations in\n1876\n.\nIn\n1883\nhe wrote to\nC S Peirce\nsaying something about his financial problems\n(\nsee\n[\n2\n]\n)\n:-\nMy income, a very fluctuating and precarious one, is derived entirely from my private teaching.\nAround this time he was placing advertisements for his teaching:-\nHUGH M'COLL, BA\n(\nLONDON UNIVERSITY\n)\nGives Lessons in MATHEMATICS, CLASSICS, ENGLISH, LOGIC, with all the other subjects of the University Course, and prepares Young Gentlemen for the Naval and military Examinations.\nHe also wrote to\nC S Peirce\nabout family health problems:-\nYou will be glad to hear that our little boy is now quite out of danger and appears to be quite well again. I wish I could say the same about my wife; still, she too is much better than she was when I wrote to you last. She went out the day before yesterday in a bath-chair - her first going out for more than eight months. I hope the coming warm weather will do much to set her up again. The beginning of her illness was a severe cold which the doctor who then attended has culpably neglected as of no importance.\nThe illness to MacColl's wife was certainly serious for she died on\n2\nFebruary\n1884\n. MacColl remarried on\n17\nAugust\n1887\n, his second wife being Hortense Lina Marchal.\nMost of MacColl's original contributions to mathematics and logic were through papers, discussions and books after he moved to France. For example\nThe Calculus of Equivalent Statements\nwas a series of eight papers published in the\nProceedings\nof the\nLondon Mathematical Society\nbetween\n1877\nand\n1898\n. He wrote to\nBertrand Russell\nin\n1905\nabout this work\n(\nsee for example\n[\n2\n]\n)\n:-\nWhen ... I discovered my Calculus of Limits, or as I then called it, my 'Calculus of Equivalent Statements and Integration Limits', I regarded it at first as a purely mathematical system restricted to purely mathematical questions ... When I found that my method could be applied to purely logical questions unconnected with the integral calculus or with probability, I sent a second and a third paper to the '\n[\nLondon\n]\nMathematical Society', which were both accepted, and also a paper to 'Mind'\n(\npublished January\n1880)\n. These involved me in a controversy with\nVenn\nand\nJevons\n, of which I soon got tired, as I saw it would lead to no result. I sent a fourth paper\n(\nin\n1884)\nto the '\n[\nLondon\n]\nMathematical Society', on the 'Limits of Multiple Integrals', which was also accepted. This I thought would be my final contribution to logic or mathematics, ...\nHe published a series of nine papers entitled\nSymbolic Logic\nin\nThe Athenaeum\nbetween\n1903\nand\n1904\n, and a series of eight articles\nSymbolic Reasoning\nin\nMind\nbetween\n1880\nand\n1906\n. As to his books, his first was\nAlgebraical Exercises and Problems with Elliptical Solutions\n(1870)\n. His most famous book, however, was\nSymbolic Logic and Its Applications\n(1906)\n. He writes in the Preface:-\nThis little volume may be regarded as the final concentrated outcome of a series of researches begun in\n1872\nand continued\n(\nthough with some long breaks\n)\nuntil today.\nBertrand Russell\nreviewed the work in a five-page article\n[\n12\n]\n. The review begins:-\nReaders of Mr MacColl's papers in 'MIND' and elsewhere will be already familiar with most of the contents of this volume, but they will be glad to have his system in a more connected and accessible form than hitherto. For reaching those who do not follow closely the development of symbolic logic, publication in book form is almost essential; and it is much to be hoped that this book will be widely read. From this point of view, it has the great merit; of being by no means difficult, and of demanding absolutely no previous knowledge of the subject. It appears to be intended to be suitable for beginners, and in this it certainly succeeds.\nRussell\nends his review as follows:-\nThe present work is not quite in line with those of other current writers on symbolic logic; but it has merits which most of their work do not have, and it serves in any case to prevent the subject from getting into a groove. And since one never knows what will be the line of advance, it is always most rash to condemn what is not quite in the fashion of the moment. In this case, the points of difference are small compared to the points of agreement, and the book will be found highly instructive by beginners, and stimulating by all readers.\nMacColl has other interests outside mathematics and logic. He wrote five novels, two of which were published, namely\nMr. Stranger's Sealed Packet\n(1889)\nand\nEdnor Whitlock\n(1891)\n. He also wrote\nMan's Origin, Destiny and Duty\n(1909)\nin which he discusses his\n[\n4\n]\n:-\n... view on the ultimate reality and meaning of human life in the universe\n[\nwhich\n]\nconsists of a set of theological, ethical, metaphysical and anthropological doctrines.\nIn this book, MacColl argues that the Christian religion is the most ethical, yet many do not believe in Christianity because they cannot accept the miracles on which the religion is based\n(\nparticularly the resurrection of Jesus\n)\n. His aim, therefore, is to establish:-\n... the fundamental and essential doctrines of the Christian religion ... on which alone a durable, logical, and satisfactory code of morality can be founded ... independently of and without any appeal to these miracles.\nIn fact, the book can be thought of as MacColl's attempt to put Christianity on a purely scientific basis.\nMacColl continued to teach until\n1908\n, essentially running a boarding school from his home. He retired in\n1908\nand, remaining in Boulogne, he moved to a new home near the centre of the town. He continued to develop his ideas even after he retired and a week before his death he wrote to\nBertrand Russell\ntelling him something of his latest thoughts.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}