{
  "nome_completo": "Humphrey Lloyd",
  "nome_curto": "Humphrey Lloyd",
  "ano_nascimento": "1800",
  "ano_morte": "1881",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lloyd_Humphrey/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "Humphrey Lloyd\n's parents were\nBartholomew Lloyd\nand Eleanor McLaughlin.\nBartholomew Lloyd\nwas a mathematician and has a biography in this archive. Eleanor McLaughlin was a daughter of Patrick McLaughlin of Dublin, Dunsaughlin and Kilmartin. Bartholomew and Eleanor Lloyd were married in July\n1799\n. They had four sons: Humphrey Lloyd, the subject of this biography; Bartholomew Clifford Lloyd\n(\nborn\n1808)\n; Robert Clifford Lloyd\n(\nborn\n1809)\n; and John Frederick Lloyd\n(\nborn\n1810)\n. They also had six daughters: Anne; Eleanor\n(\nborn\n1801)\n; Elizabeth\n(\nborn\n1808)\n; Harriet\n(\nborn\n1803)\n; Margaret; and Maria\n(\nwe have listed these in alphabetical order since we do not know all their dates of birth\n)\n.\nHumphrey was a pupil at the Rev William White's School on South Frederick Street, Dublin. This was an excellent school where many boys were educated who went on to play an important role in Irish public life. He sat the entrance examination to Trinity College, Dublin, in\n1815\nand was placed first from the\n63\npupils who took the examination. We note that this entrance examination was a classics examination with no science or mathematics content. He excelled at Trinity and in\n1818\nhe was awarded a scholarship, the examination again being on classics. However, at Trinity College, Lloyd's main subjects were mathematics and physics. Lloyd was fortunate to benefit from the mathematical reforms that his father had introduced at Trinity a couple of years before he began his studies there.\nBartholomew Lloyd\nhad become professor of mathematics at Trinity in\n1813\nand, taking over a department in which the teaching had been very old-fashioned with no calculus taught, he had quickly introduced the continental approach to calculus teaching from\nLacroix\n's textbook\nTraité élémentaire de calcul differéntiel et du calcul intégral\n, from\nPoisson\n's\nTraité de mécanique\n, and from\nLaplace\n's\nMécanique Céleste\n. Humphrey Lloyd was one of the first students to have the advantages of this new up-to-date curriculum and he graduated with a B.A. in\n1819\nhaving been placed as the top student of his year and winning the gold medal for science. His main subject had been mathematics and he was particularly interested in the applications of that topic to physics.\nLloyd continued to study at Trinity College, Dublin, aiming to gain a fellowship. He sat the fellowship examinations in\n1824\nand was successful, being appointed as a junior fellow. Two years earlier, in\n1822\n, his father had moved from the Chair of Mathematics to the Erasmus Smith Chair of Natural and Experimental Philosophy. Now Lloyd, with a strong background in mathematics and physics, undertook research on optics. However, junior fellows at Trinity College at this time found it hard to find the time to undertake much research since the teaching loads were very high. We can get a good idea of how Lloyd felt about these high teaching loads from the Preface of his book\nA treatise on light and vision\nwhich was published in\n1831\n. Lloyd writes:-\nShould these pages be found of service to those for whose use they are destined, it is the writer's hope that he may be enabled, at some future period, to complete the task which he has undertaken by the publication of a second volume on physical optics. Of the future, however, he is compelled to speak vaguely. The laborious duties of the profession to which he belongs may conspire with other causes, over which he has no control, to withhold him from again appearing before the public; and the delays of various kinds, which the present volume has had to experience in its progress through the press, have deducted largely from the stock of self-reliance with which it commenced.\nIn\n1831\nLloyd's father resigned from the Erasmus Smith Chair of Natural and Experimental Philosophy when he was appointed as Provost of Trinity College. He made immediate changes to the way that chairs were filled so that a senior fellowship and a chair became separate posts, and chairs were to be filled by the most promising junior fellows. There is no suggestion that\nBartholomew Lloyd\nmade these changes to benefit his own son, but there is no doubt that, given the new arrangements, Humphrey Lloyd was the obvious candidate to fill the Erasmus Smith Chair of Natural and Experimental Philosophy. Fellows of Trinity College were required to be celibate. The reader may ask how, with this requirement,\nBartholomew Lloyd\ncould have married and had a son qualified for the chair. The answer is that, although the rule had always been in place it had not been enforced up to\n1811\nand, up to that time, fellows married but did not declare this to the College which had a convention of not asking fellows if they were married. This changed in\n1811\nand from then on the rule was strictly enforced.\nBartholomew Lloyd\ntried to argue for an exemption to the rule for the holder of the Erasmus Smith Chair but, as soon as he saw that this would be strongly opposed by others, he dropped the idea and the appointment of Humphrey Lloyd to the Erasmus Smith Chair of Natural and Experimental Philosophy went through.\nUp to\n1831\nwhen he was appointed to the chair, Humphrey Lloyd was essentially an applied mathematician. However, from that time on he became much more interested in the experimental side of physics. The experiment for which Lloyd is best remembered today was carried out about a year after he was appointed to the chair. The events leading up to this are related in\n[\n8\n]\n:-\nBetween\n1827\nand\n1833\nHamilton\npublished a series of papers in the 'Transactions' of the\nRoyal Irish Academy\n. In this 'Essay on the theory of systems of rays' and in three supplements he developed his general view of optics. In particular, in the 'Third supplement', presented on\n23\nJanuary and on\n22\nOctober\n1832\n, he set out a system of general methods for the solution of optical problems, together with some general results deduced from the fundamental formula and view of optics set out in the main essay. On the latter date he made the first announcement of his theoretical discovery of two new optical phenomena, viz. internal and external conical refraction in biaxial crystals. This 'Third supplement', which like most of\nHamilton\n's writings is characterized by great generality and a high degree of mathematical abstraction, is\n144\nquarto pages long and is divided under thirty-one headings.\nAfter publishing his paper on\n22\nOctober\n1832\n,\nHamilton\nasked Lloyd if he could carry out the necessary experiments to confirm his theoretical prediction. They corresponded frequently over the following weeks. After overcoming some initial problems, Lloyd confirmed that he had observed the conical refraction in his February\n1833\npaper\nOn the phenomena presented by light in its passage along the axes of biaxial crystals\n.\nHamilton\n's theoretical approach was described by Lloyd in his 'Report on the progress and present state of physical optics' which he made to the\nBritish Association for the Advancement of Science\nat its meeting in Edinburgh in\n1834\n. However, Lloyd also contributed to the theoretical work as explained by George Sarton in\n[\n11\n]\n:-\nHumphrey Lloyd was not simply a clever experimentalist, he had a share in the elaboration of the theory. He it was who discovered that all the rays of the cone were polarized in different planes; and who formulated the law of conical polarisation, namely: \"the angle between the planes of polarization of any two rays of the cone is half the angle contained by the planes passing through the rays themselves and its axis\", and showed that that law was but another consequence of\nFresnel\n's principles. It is important to insist upon Lloyd's share in\nHamilton\n's work, because the law of polarization, re-explained by\nHamilton\nin his own language, is found in the latter's memoir supposedly read on October\n22\n,\n1832\n, without reference to Lloyd. This shows once more how distrustful one must be of the date of presentation of a discovery.\nIn the Hilary Term of\n1834\nLloyd delivered his Introductory Lecture\nOn the rise and progress of Mechanical Philosophy\nto the Philosophy School of Trinity College. Lloyd's experimental verification of conical refraction of light was powerful evidence for the wave theory of light and the importance attached to his work can be seen from the fact that he was elected a fellow of the\nRoyal Society of London\nin\n1836\n. Conical refraction was a trivial consequence of results published by\nJames MacCullagh\nbefore\nHamilton\nmade his prediction.\nMacCullagh\nsent an angry note to the\nPhilosophical Magazine\nto which\nHamilton\nreacted strongly. Although\nMacCullagh\nwas only one small step away from making the prediction of conical refraction, he did not take that step. Lloyd, always good as a mediator, was able to calm the two down and peace was restored when\nMacCullagh\npublished a further note apologising for his over-reaction.\nLloyd next turned his attention to the study of the Earth's magnetic field. In\n1832\n,\nCarl Friedrich Gauss\nand\nWilhelm Weber\nbegan investigating the theory of terrestrial magnetism after Alexander von Humboldt attempted to obtain\nGauss\n's assistance in making a grid of magnetic observation points around the Earth.\nGauss\nwas excited by this prospect and wrote three important papers on the subject:\nIntensitas vis magneticae terrestris ad mensuram absolutam revocata\n(1832)\n,\nAllgemeine Theorie des Erdmagnetismu\ns\n(1839)\n, and\nAllgemeine Lehrsätze in Beziehung auf die im verkehrten Verhältnisse des Quadrats der Entfernung wirkenden Anziehungs- und Abstossungskräfte\n(1840)\n. Lloyd had made a magnetic survey of Ireland in\n1834\nand\n1835\nand, near the end of the latter year he contacted\nGauss\nstarting their correspondence on geo-magnetism. The work being carried out in Germany prompted the\nBritish Association\n, together with the\nRoyal Society\n, to set up a committee in\n1838\nconsisting of\nJohn Herschel\n,\nWilliam Whewell\n,\nGeorge Peacock\nand Humphrey Lloyd. The task given to the committee was to establish stations across the world to make simultaneous measurements of geo-magnetism. Lloyd's father,\nBartholomew Lloyd\n, had established a magnetic observatory in Dublin after becoming Provost which was built in\n1837\n-\n38\n. Humphrey Lloyd had taken charge of the observatory and fitted it out with instruments of his own design. The work of the committee set up to establish magnetic observatories was mainly carried out by Lloyd and\n33\nobservatories were set up world-wide modelled on the Dublin observatory and equipped with similar instruments designed by Lloyd\n[\n2\n]\n:-\nThe association of European, Russian, and British observatories represented what Lloyd called \"a spirit unparalleled in the history of science.\" They constituted the first global network devoted to a scientific project.\nIn May\n1840\nthe rule requiring the Trinity College Dublin fellows and professors to be celibate was removed. In the second week of July of that year Lloyd married Dorothea Bulwer, the only daughter of the Rev James Bulwer who was rector of Hunworth-cum-Stody in Norfolk, England. Lloyd and his wife spent their honeymoon travelling through Switzerland and northern Italy where they visited the observatory in Milan and Lloyd attended a meeting of the Italian Physical Society at Turin in September. Continuing through the Tyrol to Bavaria they visited the observatory in Munich travelling on to the Brussels observatory which they reached on\n24\nOctober. In the summer of\n1841\n, Lloyd and his wife were touring again, this time visiting Paris to study the French contributions. He published\nAccount of the Magnetic Observatory of Dublin\nin\n1842\n. In this paper he wrote:-\nThe distinguishing characteristic of this undertaking, - that which gives it unity and greatness, - is, that the same plan of observation is followed out in all these distant stations, by observations strictly simultaneous, made according to the same instrumental methods, and with the same instrumental means. In order to give a still wider extension of the scheme, which was matured under its direction, the\nRoyal Society\nsolicited the cooperation of foreign states. The invitation was responded to in a spirit unparalleled in the history of science. Most of the foreign observatories were reorganised, on a scale of greater completeness; many new ones were added; and thirty-three observatories are now in operation, following out the same plan in all its details. Of these eleven\n(\nincluding Cambridge and Dublin\n)\nare established in Britain and her dependencies; and ten have been founded and equipped by the Russian Government, viz., at Petersburg, Catherineburg, and Kazan, in Russia proper; at Helsingfors, in Finland; at Nicolajeff, in the Crimea; at Tiflis, in Georgia; at Barnaoul and Nertchinsk, in Siberia; at Sitka, in North America, and at Pekin in China. Of the rest, one has been established by the French Government at Algiers; one by the Belgium, at Brussels; two by Austria, at Prague and Milan; one by Prussia at Breslau; one by the Bavarian Government at Munich; and one by the Spanish, at Cadiz; there are two in the United States, at Philadelphia and Cambridge; one at Cairo, founded by the Pasha of Egypt; one at Trevandrum, in India, by the Rajah of Travancore; and one by the King of Oude, at Lucknow. The observatories at Brussels, Breslau, Cadiz, Cambridge, Algiers, Cairo, Trevandrum and Lucknow, are provided with instruments similar to those of Dublin.\nIn\n1843\nLloyd became a senior fellow of Trinity College, Dublin and at that time resigned from the Erasmus Smith Chair of Natural and Experimental Philosophy. In\n1845\nhe was elected as an honorary member of the\nRoyal Society of Edinburgh\nand in the following year he was elected President of the\nRoyal Irish Academy\n, a position he held until\n1851\n. In\n1862\nLloyd became vice-Provost of Trinity College, Dublin, then five years later he became Provost, a position he held for\n14\nyears until his death. Although he did not match his father in the reforms he introduced while holding this position, nevertheless he had made important innovations before taking up this role such as the introduction of the Science Moderatorship in Experimental Physics in\n1850\n. This was basically equivalent to the Cambridge Tripos.\nAs a fellow of Trinity, Lloyd was required to take holy orders and he received his D.D. in\n1840\n. After the\n1861\ncensus which showed that only one-eighth of the Irish population belonged to the established Church of Ireland while four-fifths were Roman Catholic, the Irish Church Act of Disestablishment was passed in\n1869\nand it became law on\n1\nJanuary\n1871\n. Lloyd played a major role in the disestablished Church of Ireland serving on its General Synod, writing articles on religious doctrine and assisting in a revision of the prayer book.\nHe was awarded the Cunningham gold medal by the\nRoyal Irish Academy\nin\n1862\n, and in\n1874\nthe German emperor awarded him the Order of Merit. He was made an honorary member of the American Philosophical Society in\n1839\n. He was also elected to membership of the Royal Society of Sciences at Göttingen, of the Batavian Society of Sciences, of the Society of Sciences of Canton de Vaud, of the Societè de Physique et d'Histoire Naturelle of Geneva, and of several other academies. He received an honorary degree from the University of Oxford in\n1855\n.\nHe died at the age of\n80\nin Provost's House, Trinity College, and was buried in Mount Jerome Cemetery.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}