{
  "nome_completo": "Iossif Vladimirovich Ostrovskii",
  "nome_curto": "Iossif Vladimirovich Ostrovskii",
  "ano_nascimento": "1934",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ostrovskii/",
  "lugar_nascimento": "Dnepropetrovsk, Ukraine",
  "lugar_morte": "Ankara, Turkey",
  "biografia": "Let us first note that\nIossif Vladimirovich Ostrovskii\n's first name sometime appears as Iosif\n(\nas in\n[\n2\n]\nand\n[\n4\n]\n)\n. He studied at a High School in Kramatorsk, Donetsk region\n[\n4\n]\n:-\nHis mathematical talent manifested itself in the seventh grade, when a long illness forced him to stay at home and he took a keen interest in reading mathematics textbooks by\nAndrei Petrovich Kiselev\n. In a month he had studied the whole program for the next two years. Great support in his desire to become a mathematician was given to him by his mathematics teacher in the\n9\nth\nand\n10\nth\ngrades, Mariya Aronovna Fishkina, a former student of Mark Grigorievich Krein.\nHe graduated from the Kramatorsk High School in\n1951\nand entered the Faculty of Physics and Mathematics of Kharkov State University. This was an exceptionally strong Faculty with a host of leading mathematicians teaching there. For example, during Ostrovskii's student years the staff included:\nNaum Il'ich Akhiezer\nwho held the Chair of the Theory of Functions,\nAnton Kazimirovich Suschkevich\n(1889\n-\n1961)\nwho was Head of Algebra and Number theory, Yakov Pavlovich  Blank\n(1903\n-\n1988)\n, Gershon Ikhelevich Drinfeld\n(1908\n-\n2000)\nwho was Head of the Mathematics Department and Deputy Director of the Kharkov Institute of Mathematics\n(\nhis son Vladimir Gershonovich Drinfeld was awarded a Fields Medal in\n1990)\n,\nBoris Yakovlevich Levin\n,\nVladimir Aleksandrovich Marchenko\n,\nAleksandr Yakovlevich Povzner\n, and\nAleksei Vasilevich Pogorelov\n. The teacher who influenced him most was\nBoris Yakovlevich Levin\n.  It was in\n1954\nthat\nLevin\norganised a research seminar on function theory, and Ostrovskii became one of its most active participants.\nOstrovskii graduated from Kharkov State University in\n1956\nand began undertaking research advised by\nLevin\n. He submitted his thesis\nThe relation between the growth of a meromorphic function and the distribution of its values with respect to the arguments\n(\nRussian\n)\nin\n1959\nand was awarded his Master's degree\n(\nequivalent to a Ph.D.\n)\n. He already had a number of published papers:\nA generalization of a theorem of M G Krein\n(\nRussian\n)\n(1957)\n; and\nOn meromorphic functions taking certain values at points lying near a finite system of rays\n(\nRussian\n)\n(1958)\n. In these, and papers which he wrote in the following couple of years, he studied the connection between the growth of a meromorphic function and the distribution of its values by arguments. Some of his work was undertaken jointly with\nLevin\nand they wrote papers such as\nThe dependence of the growth of an\nentire function\non the distribution of zeros of its derivatives\n(\nRussian\n)\n(1960)\n. In this paper they addressed the\nPolya\n-\nWiman\nproblem which relates to necessary and sufficient conditions that the zeros of all derivatives of a real entire function with real zeros lie on the real axis.\nFrom\n1958\nOstrovskii taught at Kharkov University, becoming the head of the Department of Function Theory in\n1963\n. He was awarded a D.Sc. in\n1965\nfor his thesis\nThe asymptotic properties of entire and meromorphic functions and some of their applications\n(\nRussian\n)\n. However, around this time some of his research began to take another direction, in particular he started looking at problems in analytic probability theory. He published papers such as\nSome theorems on decompositions of probability laws\n(\nRussian\n)\n(1965)\n,\nOn factoring the composition of a Gauss and a Poisson distribution\n(\nRussian\n)\n(1965)\n,\nA multi-dimensional analogue of Ju V Linnik's theorem on decompositions of a composition of Gaussian and Poisson laws\n(\nRussian\n)\n(1965)\n, and\nDecomposition of multi-dimensional probabilistic laws\n(\nRussian\n)\n(1966)\n. To obtain these results, Ostrovskii had proved a stronger version of the\nWiman\n-\nValiron\ntheorem on the behaviour of an entire function in a neighbourhood of points where its modulus attains the maximum value on the circle.\nA collaboration between Ostrovskii and\nAnatolii Asirovich Goldberg\nled to important results. This came about since\nLevin\nexamined\nGoldberg\n's Candidate's Thesis\n(\nequivalent to a Ph.D.\n)\nSome Problems of Distribution of Values of Meromorphic Functions\nin\n1955\nat Lviv University. This led to\nGoldberg\ncollaborating with\nLevin\n's colleagues at Kharkov University, in particular with Ostrovskii. Their first joint papers were\nSome theorems on the growth of meromorphic functions\n(\nRussian\n)\n(1961)\nand\nNew investigations on the growth and distribution of values of entire and meromorphic functions of genus zero\n(\nRussian\n)\n(1961)\n. Another joint paper\nApplication of a theorem of W Hayman to a question in the theory of expansions of probabilistic laws\n(\nRussian\n)\n(1967)\nwas followed by the classic joint monograph\nThe distribution of values of meromorphic functions\n(\nRussian\n)\n(1970)\n. Here is a short extract of a review of this book by\nWalter Hayman\n:-\nNevanlinna\ntheory has made considerable progress in the\n50\n's and\n60\n's, progress to which the authors of the present book have made distinguished contributions. Their book is detailed and authoritative, and there is little of importance in the subject of value distribution of functions meromorphic in the plane that is missing from this book and that cannot be found in the earlier books on the subject. The subject matter is illustrated at every stage by subtle and detailed examples -some of which are here published for the first time and some of which are not easily accessible elsewhere. ... All function theorists are indebted to the authors for this comprehensive and scholarly work.\nGoldberg\nand Ostrovskii explain their aims in writing the monograph in a Preface:-\nIn this book ... the main attention is concentrated on the problems internal to the value distribution theory, which include the following problems:\n(\ni\n)\nTo what extent the main inferences of\nNevanlinna\n's theory have final character and cannot be improved further;\n(\nii\n)\nWhat properties of\nPicard\n's exceptional values are preserved for a wider class of exceptional values considered in the value distribution theory;\n(\niii\n)\nWhich are the connections between\nNevanlinna\n's characteristics and other quantities characterizing asymptotic properties of entire and meromorphic functions;\n(\niv\n)\nStudy of asymptotic properties and value distribution of meromorphic functions belonging to some special classes which are on one hand sufficiently narrow to give new information not implied by general theorems, and on the other hand sufficiently wide for being of interest for the general theory;\n(\nv\n)\nStudy of the value distribution with respect to arguments\n(\nnot only with respect to moduli as in classical\nNevanlinna\ntheory\n)\n. We pay great attention to examples of functions with \"exotic\"  properties. Without them the reader will get a restricted image of the theory under consideration. Examples of functions having unusual properties play in the theory a role as important as counterexamples do in real analysis.\nIn\n1972\nOstrovskii published another important monograph, this time in collaboration with\nYuri Vladimirovich Linnik\n. In a review of this book, with title\nDecompositions of random variables and random vectors\n(\nRussian\n)\n, R Cuppens wrote:-\n... this book is absolutely essential for any researcher interested in this field, or more generally by the elementary\nprobability theory\n. It is to be hoped that a translation in a language more accessible appear quickly.\nIndeed, the Russian text was translated into English and published by the\nAmerican Mathematical Society\nin\n1977\nwith the title\nDecomposition of random variables and vectors\n. Ostrovskii's\n1970\nbook with\nGoldberg\nwas also translated into English but this did not appear until\n2008\n. Again the publication was by the\nAmerican Mathematical Society\nand this impressive book had an appendix giving a survey of the results obtained after\n1970\n, with extensive bibliography.\nOstrovskii was appointed to head the Department of Function Theory at the Low Temperature Physics and Technology Institute of the Ukrainian Academy of Sciences in\n1986\n. He did not give up his chair at Kharkov University where he continued to work on a part-time basis. In\n1995\nhe was appointed as a professor in the Department of Mathematics of Bilkent University in Ankara, Turkey. In\n1996\nhe published the book\nComplex Analysis\n. Ostrovskii gives the following description of its contents:-\nThe first part of the volume contains a comprehensive description of the theory of entire and meromorphic functions of one complex variable and its applications. It includes the fundamental notions, methods and results on the growth of entire functions and the distribution of their zeros, the Rolf\nNevanlinna\ntheory of distribution of values of meromorphic functions including the inverse problem, the theory of completely regular growth, the concept of limit sets for entire and subharmonic functions. The authors describe the applications to the interpolation by entire functions, to entire and meromorphic solutions of ordinary differential equations, to the Riemann boundary problem with an infinite index and to the arithmetic of the convolution semigroup of probability distributions. Polyanalytic functions form one of the most natural generalizations of analytic functions and are described in Part II. They emerged for the first time in plane elasticity theory where they found important applications\n(\ndue to Kolossof, Mushelishvili etc.\n)\n. This contribution contains a detailed review of recent investigations concerning the function-theoretical peculiarities of polyanalytic functions\n(\nboundary behaviour, value distributions, degeneration, uniqueness etc.\n)\n. Polyanalytic functions have many points of contact with such fields of analysis as polyharmonic functions,\nNevanlinna\nTheory, meromorphic curves, cluster set theory, functions of several complex variables etc.\nThere are many other areas to which Ostrovskii has made a major contribution. For example in the mid\n1970\ns he collaborated with\nVladimir Aleksandrovich Marchenko\nstudying the spectrum of a Hill operator. In the late\n1970\ns he studied complex-valued\nBorel\nmeasures on the real axis. He continued to work on this topic with his student Alexandr M Ulanovskii and they surveyed their results in this area in the joint paper\nClasses of complex-valued Borel measures than can be uniquely determined by restrictions\n(1989)\n. In the\n1980\ns Ostrovskii wrote a number of papers on the asymptotic behaviour of entire functions that are characteristic functions of probability measures. In the\n1990\ns he published a number of papers on the\nRiemann\nboundary-value problem with an infinite index. In the\n2000\ns he wrote\nOn the zeros of tails of power series\n(2000)\nand\nOn the zero distribution of remainders of entire power series\n(2001)\n.\nThe article\n[\n2\n]\nis written by a number of mathematicians who have been taught by Ostrovskii so are in the best possible position to explain his merits as a teacher and advisor:-\nIosif Vladimirovich combines the gifts of a researcher with the talents of a teacher. He has lectured for over thirty years at Kharkov University. His lectures, distinguished by a careful depth of thought and a thoroughness of material, bear the stamp of the lecturer's character. In them we can easily sense the deep-rooted enthusiasm and keenness of the man. Iosif Vladimirovich has taught many pupils, and three of them have become doctors of science. Under his supervision twenty Ph.D. dissertations have been defended. Iosif Vladimirovich gives a great deal of attention to his students. He generously shares his scientific ideas, and knows how to get on with both the beginner in research and the more advanced researcher. All those who have had dealings with him know well his readiness and ability to help with both advice and action, his attentiveness, sense of duty, and his adherence to principles.\nOutside mathematics, one of Ostrovskii's hobbies involves sailing\n[\n4\n]\n:-\nMany people know Ostrovskii as an irreplaceable captain of numerous trips lasting several days on the rivers Volga, Desna, Sura, Vorona, Yuruzan, and others, and remember how his calm confidence and experience were a great support to wet beginners who had their spirits dampened after a first leak in a boat. However, accidents were seldom.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}