{
  "nome_completo": "Isaac Barrow",
  "nome_curto": "Isaac Barrow",
  "ano_nascimento": "1630",
  "ano_morte": "1677",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barrow/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "Isaac Barrow\n's father, Thomas Barrow, was a linen draper by trade. Thomas married Ann, daughter of William Buggin of North Cray, Kent in\n1624\nand their son Isaac was born in\n1630\n. Ann died in\n1634\nand Thomas sent Isaac to live with his grandfather. Perhaps there is truth in the frequently quoted saying that Isaac's father:-\n... was heard to pray that should God decide to take one of his children, he could best spare Isaac.\nThomas remarried within two years and it is suggested in\n[\n5\n]\nthat this may have been an attempt to get his son back from his father, who was said to be spoiling young Isaac.\nThomas planned for Isaac to become a scholar while still a child. He sent Isaac to Charterhouse and paid twice the regular fee to get special attention for Isaac. However Isaac did not receive this attention and acquired the reputation as a bully while his education suffered. When Thomas heard of this, he transferred Isaac to Felstead, Essex in\n1640\nwhere the headmaster had a reputation for strict discipline. Here Isaac made rapid progress, both in developing his character and in learning. At Felstead Barrow learnt Greek, Latin, Hebrew and logic in preparation for University. After he had been at Felstead for two years, Isaac's father incurred losses of £\n1000\ndue to the Irish rebellion and was unable to pay Isaac's fees. However, the headmaster, realising Isaac's potential, took him in and later appointed him as a tutor to Thomas Fairfax.\nIn\n1643\nBarrow was admitted as a foundation scholar at Peterhouse, Cambridge. His uncle was a Fellow of Peterhouse at the time and when his uncle lost his post due to his Royalist views, Barrow went to Oxford where his brother had become the King's Linen Draper. However there was an uprising against Royalty and Oxford came under siege.\nIn\n1644\nBarrow went to London where he was supported by Thomas Fairfax. However, Fairfax soon ran out of money and left Isaac destitute. Barrow accompanied a former school friend, who promised to support him, to Trinity College, Cambridge. Barrow enrolled in\n1646\nand performed menial duties in return for instruction with poor board and lodging. His friend supported him for six months before he left but, by this time, the siege of Oxford had ended and Barrow made contact with his father who helped support him.\nDuport, the Regius Professor of Greek at Cambridge, tutored Barrow without taking any fees, both due to Barrow's talent and that both were royalists. Under Duport, Barrow studied Greek, Latin, Hebrew, French, Spanish, Italian, literature, chronology, geography and theology. Also at Cambridge at this time it was usual for students to learn some mathematics, either in their second or third year. Barrow studied arithmetic, geometry and optics and, like all students of the time, was encouraged not to specialise in a subject such as mathematics before graduating.\nBarrow graduated in\n1649\nand successfully competed for a college fellowship in the same year. He gave a speech in which he praised the teaching of the classics but criticised the lack of mathematics and science. He started studying mathematics in depth immediately after his graduation. His enthusiasm and willingness to teach enabled him to attract enough people to the subject to help begin to lay the foundations for studying mathematics at Cambridge.\nBarrow was considered to be the ring leader of a group of royalists from\n1648\n. However, in\n1649\n, Barrow declared himself to be\n[\n5\n]\n:-\n... true and faithful to the Commonwealth of England as the same is now established, without a King or House of Lords.\nHowever he soon went back on this declaration but was saved from expulsion by the Master. Two years later Barrow again faced expulsion due to a speech he made on the anniversary of the Gunpowder Plot. The Master again came to his rescue by telling the Fellows who demanded his expulsion\n[\n4\n]\n:-\nBarrow is a better man than any of us.\nIn\n1652\nBarrow graduated with his M.A. In\n1654\nhe defended the University in a speech in which he spoke of the importance of learning Greek, Latin and literature for the purpose of acquiring a firm basis for learning. He also praised the advances the University had made in subjects such as Arabic, modern languages such as French, Spanish and Italian, mathematics and science. He ended his speech requesting\n[\n5\n]\n:-\n... fellow students to persevere in the study and practice of moral philosophy.\nBarrow had taken an oath to study divinity when he was admitted as a fellow, and, after briefly studying medicine, he began studying divinity again. His study of church history led him to astronomy which in turn led him to study geometry. He taught himself geometry, writing a simplified edition of\nEuclid\n's\nElements\nwhich was printed in\n1655\nand remained the standard textbook for half a century.\nDuring this period Barrow was appointed to the college lectureship in Humanity. When the professorship in Greek became available it was expected that Barrow would be appointed to replace Duport who had been forced to leave the chair on political grounds. However Barrow was told that he did not have enough experience in teaching and was not well-travelled enough to receive the position. The real reason was almost certainly Barrow's political views.\nIn\n1655\nBarrow set sail for France, after he had received an award for travelling from the University. The conditions of the award were that he would receive £\n16\nper year for three years, and would have to report by letter to Cambridge on his learning and progress. Barrow spent the first ten months in Paris where he reported that he was rather disappointed in that the University was not nearly as impressive as he had been expecting. Apart from\nRoberval\nthere were few mathematicians from whom he could learn. In February of\n1656\nhe went to Florence, where he remained for eight months. This was longer than he had originally planned but he was unable to visit Rome due to an outbreak of the plague there.\nWhile in Florence Barrow spent much of his time in the Medici Library where there was a great collection of coins. Barrow later used the expertise he had acquired to act as a collector of coins and medals for a London merchant who helped Barrow with much needed finance. While in Florence, Barrow met Carolo Renaldini who was writing a paper on algebra. He also met\nVincenzo Viviani\n,\nGalileo\n's last pupil. Barrow then set sail for Turkey but his ship came under attack from pirates. Barrow landed at Smyrna where he spent seven months. After his stay in Smyrna he went to Constantinople where he remained a year and a half with the English Ambassador. Despite failing to keep in contact with Cambridge, as set out in the conditions of his award, Barrow was granted an extension. While in Constantinople Barrow spent much time studying divinity and in particular the local Greek Church. In some financial difficulty, Barrow began his return journey at the end of\n1658\n. On the journey home the ship docked at Venice where it caught fire and all Barrow's possessions were lost. He then headed back through Germany and Holland, arriving in Cambridge in September\n1659\n.\nWhen he arrived back at Cambridge there had been many political changes due to the restoration of Charles II. The Professor of Greek voluntarily resigned in recognition that there were others who were better suited to the position - one of these people being Barrow himself. Duport was offered the post that he had been forced out of six years earlier, but he declined the offer. This left the way open for Barrow who, with no opposition, was elected to the position that many felt he should have had years before. As Professor he received £\n40\nper year and was not allowed to hold any other positions inside the College or University. He could not receive any income from his College Fellowship which made his financial position very difficult. Barrow campaigned for professors to receive benefits from their College Fellowships, if they held one, and his campaign was successful. In his annual speech after his first year he encouraged students to concentrate on their own private study and not on the lectures\n[\n5\n]\n:-\nContinue to stay at home, if you are wise, and apply yourselves to your private studies. Turn over the choicest books you possess or take shelter in the pleasing shade of the library. Muffle yourselves in your snug blankets or sit by your cosy fireside. Consider your health and study at your own convenience.\nBarrow's interest in mathematics and his small income made the position of Professor of Geometry at Gresham College, London appear very attractive when it became vacant in\n1662\n. He could also hold this chair while continuing as Professor of Greek at Cambridge. He was elected in mid-summer\n1662\non a salary of £\n50\nper year. At Gresham he taught geometry for two hours a week, one hour in English and the other in Latin. Barrow took his duties very seriously. He intended publishing these lectures, but he lent them to a friend who subsequently lost them. Topics covered included 'projection of spheres' and 'perspectives'.\nBarrow became one of\n150\nscientists who were elected a Fellow of the\nRoyal Society\non\n20\nMay\n1663\nat one of the first meetings of the Society. However his contribution to the\nSociety\nwas minimal and this could well have been influenced by the relation of the\nSociety\nto the universities. The\nSociety\ntried to appoint him to the Astronomical and Optical Committee and to the committee responsible for\n[\n4\n]\n:-\n... collecting the phenomena of nature hitherto observed and all experiments made and recorded.\nHowever this did not increase his contribution and, with his dues unpaid, the\nSociety\nconsidered expelling him.\nIn the summer of\n1663\nthe position as Lucasian Professor of Mathematics was created at Cambridge thanks to an endowment left by Henry Lucas. Barrow was an obvious choice for this position and he relinquished the Greek chair for the mathematics because, he explained, of his greater interest in mathematics than Greek, because less work was involved, and that it had always been his intention to hold the Greek chair temporarily.\nIn the spring of\n1664\nBarrow delivered the first six of his mathematics lectures which consisted of basic material. In the autumn he delivered nine more lectures and, in the spring of\n1665\nthe first five of his geometrical lectures. After giving a short course on\nArchimedes\nwhich consisted of four lectures the University had to close due to the plague. When it re-opened in April\n1666\nBarrow delivered another eight lectures but after June there was another outbreak of the plague. The university re-opened for the second time in Easter\n1667\nwhen he gave further geometry lectures before delivering his optics lectures in the\n1668\n-\n9\nsession.\nIsaac Newton\nattended these lectures and had many private discussions with Barrow about the work.\nNewton\ntook much encouragement from these sessions with Barrow and they influenced his work greatly.\nJohn Collins\npublished most of Barrow's lectures:\nLectiones Opticae\nⓉ\n(\nLectures on optics\n)\nwas published in\n1669\n,\nLectiones Geometricae\nⓉ\n(\nLectures on geometry\n)\nin\n1670\nand\nLectiones Mathematicae\nⓉ\n(\nLectures on mathematics\n)\nin\n1683\n. Barrow did not prepare his work for publishing,\nNewton\nand others undertook this task. Most of Barrow's mathematics had been done over the years\n1663\nto\n1669\n. A look at these three books shows the extent of his work.\nLectiones Mathematicae\nwere lectures designed to revive interest in mathematics at Cambridge while trying to point it in a new direction by introducing modern techniques. He tried to classify the different branches of mathematics arguing that algebra is not part of true mathematics and should be considered to be logic while\n[\n5\n]\n:-\nGeometry is the basic mathematical science, for it includes arithmetic, and mathematical numbers are simply the signs of geometrical magnitude.\nIn the later lectures he covered such topics as divisibility, congruence, equality, time and space. The final lectures cover measurement, proportion and ratio.\nThe\nLectiones Geometricae\nprobably represent work which Barrow studied while at Gresham. They contain the important work on\ntangents\nwhich was to form the starting point of\nNewton\n's work on the calculus. Barrow stated the main two aims were\n[\n15\n]\n:-\n... first, to investigate tangents without the trouble or wearisomeness of calculation and, second, to determine the dimensions of many magnitudes quite quickly by means of their tangents ...\nThe\nLectiones Opticae\nwere more theoretical than practical, which was unusual for his time. The content is mainly geometrical optics and he states the main problem which the lectures are aimed at answering\n[\n4\n]\n:-\nTo define the image of a point after any reflection in a plane and spherical surface ...\nIn\n1669\nBarrow resigned from the Lucasian Chair and did no further mathematical work. This allowed\nNewton\nto take over. Barrow was appointed as Royal Chaplain to Charles II at Salisbury in\n1670\n, then, in February\n1673\n, Charles II awarded Barrow the Mastership of Trinity declaring him to be the best scholar in England. While Master of Trinity, Barrow was occupied with two major issues. The first of these was to limit the amount of Royal interventions and secondly the building of the Wren library. On the first of these issues he had some success while on the second he spent much time and effort on generating interest in the project and the necessary funds. However he did not live to see the result of this work. In April of\n1677\nBarrow travelled to London where he contracted malignant fever. He tried to cure it by fasting and taking opium, a formula which had previously worked for him while ill in Constantinople. However he died and was buried a few days later at Westminster Abbey.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}