{
  "nome_completo": "Ivan Ivanovich Privalov",
  "nome_curto": "Ivan Ivanovich Privalov",
  "ano_nascimento": "1891",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Privalov/",
  "lugar_nascimento": "Nizhny Lomov, Penza guberniya (now oblast), Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Ivan Ivanovich Privalov\n's parents were Evdokia Lvovna and Ivan Andreevich Privalov. Ivan Andreevich was a merchant working in Nizhny Lomov but he also owned a foundry in the major city of Nizhny Novgorod about\n180\nkm to the north. Evdokia Lvovna was from a similar background as Ivan Andreevich coming from a family of merchants. Ivan Ivanovich's early education was in Nizhny Lomov after which he attended the\nGymnasium\nin Novgorod from\n1901\nto\n1909\n, graduating with a gold medal. He then entered the mathematics department of the Faculty of Physics and Mathematics of the University of Moscow where he was taught by several world-class mathematicians and physicists including\nK A Andreev\n,\nD F Egorov\n, L K Lakhtin, P P Lazarev, P N Lebedev, B K Mlodzeevskii, and\nN E Zhukovsky\n.\nOf the mathematicians,\nKonstantin Alekseevich Andreev\nwas best known for his work on geometry and was Dean of the Faculty during Privalov's undergraduate years,\nDimitri Fedorovich Egorov\nwas a leading researcher in differential geometry and\nintegral equations\n, Leonid Kuzmich Lakhtin was interested in analysis and probability, and Boleslav Kornelievich Mlodzeevskii had been the first to give lectures at Moscow University on set theory and the theory of functions. Petr Nikolaevich Lebedev was an outstanding physicist and Petr Petrovich Lazarev, also an excellent physicist, was one of his former students.\nNikolai Egorovich Zhukovsky\nwas the world expert on airfoils and the dynamics of flight, and was Head of the Department of Mechanics. Privalov was most attracted by\nEgorov\n's lectures and began to attend his seminar. We should mention that\nNikolai Nikolaevich Luzin\n, although seven years older that Privalov, was a student at the same time. The two became close friends and later collaborated in writing mathematical papers.\nDuring his undergraduate years, Privalov was an active member of the Student Mathematics Circle and served as its President. He was described by a fellow student as \"a tall, handsome, thoughtful youth\". In\n1911\nhe went to the University of Göttingen\n(\nwith his friend\nLuzin\n)\nfor the summer semester and there he attended lectures by\nDavid Hilbert\n,\nFelix Klein\n, and\nEdmund Landau\n. He graduated from the University of Moscow in\n1913\nafter being examined on his paper\nThe reducibility problem in the theory of linear differential equations\n.\nEgorov\nwas very impressed with Privalov's abilities and recommended that he remain at Moscow University to undertake research. He wrote\n(\nsee for example\n[\n9\n]\n)\n:-\nMr Privalov has already distinguished himself during his first years at the University by his interest in science, his erudition in the mathematical literature, and his obvious mathematical talent ... He often gave talks at the student Mathematical Circle and in the current year he gave a lecture at the\nMoscow Mathematical Society\n. In this lecture he gave an extension of the theorems of\nCantor\nand\nFatou\non general expansions by orthogonal functions, and with absolute certitude has already shown his capacity for independent mathematical work ... I am convinced that Mr Privalov will develop into an outstanding scientist.\nThe lecture by Privalov on\n18\nDecember\n1912\nto the\nMoscow Mathematical Society\n, which\nEgorov\nrefers to in this recommendation, was\nProperties of expansions in terms of orthogonal functions\nand it became his first paper appearing in print in\n1914\n. The examinations for his Master's Degree took place in\n1915\nand in February of the following year he gave two lectures as part of the examination. He was allowed to choose the topic for one of these lectures -\nPicard's Theorem\n- while the other -\nSummation of Trigonometrical Series\n- was on a topic set by the Faculty. After these tests he was given the right to teach as a\ndozent\nat the University of Moscow. This was a period of change in the Russian education system and although he was preparing a thesis on the boundary behaviour of analytic functions, the thesis requirement was abolished before he had submitted it. He published the material he had prepared for his thesis as the monograph\nThe Cauchy Integral\nin\n1918\n. This important work built on foundations set up by\nPierre Fatou\n[\n1\n]\n:-\nBecause \"Cauchy Integral\"  appeared at a time when scientific contacts between Russia and other countries were almost nonexistent, it did not attract attention abroad.\nIn\n1917\nPrivalov became professor at Saratov University where he remained for five years, then returned to Moscow\n[\n7\n]\n:-\nIn\n1922\nPrivalov returned to Moscow. He was rather tall, with a pale, interesting, nervous face. His manners and speech usually seemed quiet, but when he was excited he spoke faster, and stammered slightly. Privalov smoked a lot, more as time went on.\nHe was appointed professor and Head of the Department of Function Theory at the Institute of Mathematics and Mechanics of the University of Moscow when the Institute was founded in\n1922\n. He held this post for the rest of his life. He was also appointed as a professor in the Department of Higher Mathematics at the\nZhukovsky\nAir Force Academy and in the Department of Higher Mathematics of the Lomonosov Automechanical Institute. Lazar Aronovich Lyusternik became a research student in the Institute of Mathematics and Mechanics in\n1922\n. In\n[\n7\n]\nhe gives a first hand account of Privalov's life in the Institute:-\nAt Moscow University Privalov began to give, with great enthusiasm, a course on the theory of functions of a complex variable\n(\nbefore him this course had been given by B K Mlodzeevskii\n)\n. On the basis of this course he wrote a famous university text-book on complex function theory. Then\n(\nin his own words\n)\nhe got tired of this course and began to give\n(\nalso with great enthusiasm\n)\na course of analysis, On his arrival Privalov became the oldest scientific worker at the Institute of Mathematics and Mechanics at Moscow University. For the research students of my own and the next generation he regularly conducted examinations\n(\non various topics\n)\n. So you see him at a long table in the professors' room, smoking, silently listening to a student sitting beside him, sometimes making short notes. Privalov was my opponent for my final Ph.D. thesis.\nLyusternik was also able to paint a picture of Privalov's home life\n[\n7\n]\n:-\nTo begin with, Privalov lived in a small house on the site of the Lomonosov Institute in Blagoveshchenskii Lane, and later he moved into a three-roomed flat in a two-story block on the same site. His family consisted of his wife, Anna Ilinichna, a pretty, friendly woman, active and energetic, and a young daughter. The rooms were joined by a number of doors and, according to his friends, Privalov loved to walk to and fro over the whole flat. It was comfortable at the Privalovs\n(\nin contrast to the majority of mathematicians' flats at the time, to say nothing of the bachelors' rooms\n)\n. Privalov was a sociable man, he liked people to come to him, he would meet his guests with a smile, and show them into his study, opening the door with a sweeping gesture. And later the hospitable Anna Ilinichna would invite them for a cup of tea in the dining-room. There a lamp burned cosily under a brown shade. Privalov often accompanied his guests, not only to the tram, but sometimes to their homes.\nPrivalov regularly lectured to the\nMoscow Mathematical Society\nfollowing his appointment in\n1922\n. The titles of his lectures over the years\n1922\n-\n25\nwere:\nA generalization of a theorem of Fatou\n(1922)\n,\nProperties of the coefficients of a Taylor series\n(1923)\n,\nThe uniform convergence of sequences of analytic functions which give a 'schlicht' conformal mapping\n(1923)\n,\nThe uniqueness of an analytic function\n(1923)\n,\nA generalization of Vitali's theorem on sequences of analytic functions\n(1924)\n,\nThe convergence of conjugate trigonometric series\n(1924)\n,\nThe convergence of sequences of analytic functions\n(1924)\n,\nConcerning a condition of Blaschke\n(1925)\n,\nA new definition of a harmonic function\n(1925)\n,\nHarmonic functions\n(1925)\n. Privalov was appointed secretary of the\nMoscow Mathematical Society\nand later served as a vice-president. Lyusternik writes in\n[\n7\n]\n:-\nPrivalov's closest friends were\nV V Stepanov\nand V I Veniaminov. Later Privalov kept up friendly relations with his former pupils, especially M A Kreines and S A Galpern. In the thirties, after a session of the Mathematical Society or a long seminar conducted by Privalov on the theory of functions, the mathematicians would gather in a small restaurant at the end of Tverskoi; Privalov was invariably present, sitting with a glass of brandy, and interjecting brief remarks into the excited mathematical conversation.\nPrivalov, often in collaboration with\nLuzin\n, studied analytic functions in the vicinity of singular points by means of\nmeasure theory\nand\nLebesgue\nintegrals. He also obtained important results on\nconformal mappings\nshowing that angles were preserved on the boundary almost everywhere.  In\n1934\nhe studied subharmonic functions, building on the work of Riesz. He published the monograph\nSubharmonic Functions\nin\n1937\nwhich gave the general theory of these functions and contained many results from his papers published between\n1934\nand\n1937\n. Sergey Ivanovich Vavilov, a leading Russian physicist, wrote about Privalov's research contributions\n(\nsee for example\n[\n9\n]\n)\n:-\nProfessor Privalov is among the most distinguished mathematicians of the Soviet Union. Important research in the theory of functions is due to him. In this domain he has obtained profound results on the theory of trigonometric series, on integrals of\nCauchy\ntype, on boundary value problems, in the study of properties of analytic functions inside domains and on the theory of subharmonic functions.\nSergei Alekseevich Chaplygin\nand\nNikolai Nikolaevich Luzin\nexplained Privalov's approach to research\n(\nsee for example\n[\n9\n]\n)\n:-\nWhen reviewing the scientific activity of I I Privalov one should note above all the wide range of questions in mathematical analysis, including the theory of functions of a complex variable, and also, the strength of his results. Privalov never studied a particular problem for the sake of the problem itself. He always placed the problem in connection with all known methods developed by mathematical analysis, constantly trying to extend the very methods of mathematical analysis, to improve them and to deepen their strength as much as possible. Very characteristic of Privalov, in this connection, is the theory of subharmonic functions, which he created and in which he tried to combine, improve and deepen the most important methods of the theory of functions of a complex variable.\nPavel Sergeevich Aleksandrov\nexplained why Privalov had very few students\n(\nsee for example\n[\n9\n]\n)\n:-\nA universal character in both mathematical and general cultural interests gave exceptional scope and rare breadth to\nHausdorff\n's university lectures. But probably because of this he did not have his own students: he demanded too much of them and he himself knew too much. This characteristic, incidentally, was also possessed by our great Soviet mathematician I I Privalov, who for this reason did not have many students: not everyone could endure his extraordinary exactitude. The knowledge of the scientist himself apparently subdued many beginning young people ... It seemed that it was impossible to imitate him, and students are not able to avoid imitating their teacher to some extent.\nPrivalov wrote a number of research monographs, some of which we have already mentioned above. We must also note the important\nSubharmonic Functions\n(1937)\n, and\nBoundary Properties of Single-Valued Analytic Functions\n(1941)\nFrantišek Wolf\nbegins his review of this\n1941\npublication as follows:-\nThis book of\n336\npages deals with a small and most difficult section of the theory of complex variables to which the author has made very substantial contributions.\nIt was not only as a researcher that Privalov excelled for he also had an outstanding reputation as a teacher. An obituary written in\n1941\ncontained this appreciation of his teaching:-\nAn outstanding scientist, he was also a remarkable teacher. His brilliant lectures, rich in scientific content and remarkable in their presentation, are remembered by his numerous students, by mathematicians and by engineers, now holding important scientific, military, and technical posts.\nHis teaching skills extended beyond his lectures for he wrote many popular textbooks. A course of lectures that he gave in Saratov gave rise to\nAnalytic geometry in the plane\n(1918)\n. He followed this by\nElements of mathematical analysis\n(1924)\nand\nIntroduction to the theory of functions of a complex variable\n(1927)\n. The popularity of this last mentioned text is shown by the fact that a\n12\nth\nedition appeared in\n1977\n.\nR P Boas, Jr\nreviewed the book:-\nThis is a carefully written and detailed textbook which covers all the material customary in an introductory course and goes as far as the strong form of\nCauchy\n's theorem,\nPicard\n's theorem via\nBloch\n's theorem, conformal mapping on the boundary, and classical results on univalent functions.\nHis textbook\nAnalytical geometry\n(1927)\nwas another that proved extremely popular with a\n12\nth\nedition appearing in\n1939\n- editions had appeared at the rate of one per year for twelve years. A\n13\nth\nedition was published in\n1966\n, twenty-five years after Privalov's death. Later textbook were:\nFourier series\n(1930)\n;\nCourse of differential calculus\n(1934)\n;\nCourse of integral calculus\n(1934)\n;\nIntegral equations\n(1935)\n;\nFoundation of the analysis of infinitesimals, textbook for self-education\n(1935)\n; and\nElements of the theory of elliptic functions\n(1939)\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}