{
  "nome_completo": "Ivan Georgievich Petrovsky",
  "nome_curto": "Ivan Georgievich Petrovsky",
  "ano_nascimento": "1901",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petrovsky/",
  "lugar_nascimento": "Sevsk, Orlov guberniya, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Ivan Georgievich Petrovsky\n's name is often written as\nPetrovskii\n. He was born in Sevsk, a small town near Brynsk, in western Russia. His grandfather was a highly respected merchant in Sevsk who had made a major contribution to the building of the school his home town which had been funded entirely by the local inhabitants.\nIvan Georgievich attended this school and his favourite subject was chemistry\n[\n30\n]\n:-\nHe had a small laboratory at home, in a corridor, and performed various experiments there. His father encouraged his scientific interests and supplied him with equipment. Ivan Georgievich loved his father very much, and they were close friends ...\nHis school record was outstanding but at first sight it is surprising that his performance in mathematics, although very good, was weaker than his other subjects. The reason, as happens so often, was due to the quality of his teachers. The chemistry teacher was outstanding while the mathematics teacher, who had trained as an engineer, confessed that he did not really understand the theory. This was bad enough but he received advice which could easily have prevented him from ever following an academic career. He was advised not to study at a university since this could only lead to a career as a school teacher. Ivan Georgievich, however, decided to study science at university. His grandfather was very upset by this decision since he wanted his grandson to become a merchant but he did not put pressure on him. After graduating from the Sevsk high school in\n1917\n, Petrovsky entered Moscow University with the intention of studying biology and chemistry. Events, however, prevented him even beginning his course for the Russian Revolution began and fighting broke out in Moscow in October\n1917\n.\nPetrovsky returned to Sevsk and then in\n1918\nthe whole family moved to Yelizavetgrad in Ukraine\n(\nthe city was renamed Zinovyevsk in\n1924\n, Kirovo in\n1936\n, Kirovograd in\n1939\nand is now Kropyvnytskyi\n)\n. Petrovsky worked for a while as a clerk and then entered the technical school for machine construction. He was keen to do well and happened to find\nNikolai Egorovich Zhukovsky\n's book on theoretical mechanics which he tried to read. He quickly realised, however, that his knowledge of mathematics was insufficient to let him understand\nZhukovsky\n's book so he looked for some books from which he could learn mathematics. The first text he found was\nDirichlet\n's book on the theory of numbers\n[\n30\n]\n:-\nThis book, as Ivan Georgievich related, made a great impression on him by the beauty of facts and reasoning and turned his interest forever towards mathematics.\nWith the ending of the Russian Civil War in November\n1920\nand stability returning, Petrovsky returned to Moscow University in\n1922\nbut by now his interests were so firmly in mathematics that he did not take up the course he had been intending to follow five years earlier, but read for a degree in mathematics. However, he had to find some means of support\n[\n30\n]\n:-\nAs a student Ivan Georgievich had to earn his own living. When in\n1922\nhe came to Moscow, he had no accommodation and no means of living. His first nights were spent at the railway station. Then by chance he saw an announcement that orphanage No.\n4\nneeds a dvornik\n(\na person who takes care of the yard and the pavement in front of the house\n)\nand a stoker. They promised accommodation and food. Arriving at the given address, Ivan Georgievich learned that the position of stoker was already taken by another student. It remained only to work as dvornik. But he really had to work for two. It was hard work: he had to carry wood to high floors, stoke ovens, and carry heavy flour sacks and other food for the orphanage. His health at that time was considerably weakened by serious illnesses he had gone through: malaria and pneumonia. The children from the orphanage loved him very much and called him Vaniusha. He made toys for them, sharpened pencils, helped them to arrange a Christmas tree.\nWorking at the orphanage had one very positive result, however, for while there he met Olga Afanasyevna Kornilaeva who, like Petrovsky, was a student at Moscow University; they later married.  From the beginning of his second year of study he earned money teaching mathematics to students in art courses run by the Ministry of Education. He also taught mathematics at a Moscow school. He did not find attending lectures as useful a way of learning mathematics as reading books so he bought many texts.\nCharles de la Vallée-Poussin\n's text based on his course on mathematical analysis was one of Petrovsky's favourite. From this time he began to build up his collection of books, described by\nP S Aleksandrov\nand\nO A Oleinik\nin\n[\n10\n]\n:-\nFrom his student days onwards, he was always buying books. His personal library contained over thirty thousand books ... It is remarkable that Petrovsky did not have a catalogue but knew his way round the library very well and was able to find his favourite books quickly.\nHe completed the usual five year undergraduate course in\n1927\nbut in the previous year, even before beginning his graduate studies, he had written his first mathematics paper on the\nDirichlet\nProblem.\nKolmogorov\nwrites\n[\n24\n]\n:-\nEven in his student years, Petrovskii was passionately concerned with community action - he was elected a students' representative on the mathematical syllabus commission and threw himself into this task with all the seriousness that was one of his characteristics. I recall how in\n1927\n, as a modest young man in a blue blouse with close-cropped hair, he was entrusted with the duty of greeting the First Conference of Soviet Mathematicians in the name of the students of the University of Moscow.\nPetrovsky spent three years undertaking research\n(1927\n-\n30)\nsupervised by\nDimitri Fedorovich Egorov\n[\n24\n]\n:-\nIt seems no accident that\n[\nPetrovsky\n]\nchose as his supervisor\nD F Egorov\n, a profound and subtle scholar, but a somewhat stern man, an unwearying toiler, avoiding all ostentation.\nHe also attended the seminars of\nAleksandr Yakovlevich Khinchin\nand\nAndrei Nikolaevich Kolmogorov\non\nprobability theory\n. During his years as a research student his first published papers appeared:\nEinige Bemerkungen zu den Arbeiten von Herren\n0\nPerron und L A Lyusternik über das Dirichlet'scbe Problem\nⓉ\n(\nSome remarks on the work of  Perron and Lyusternik about Dirichlet's problem\n)\n(1928)\nand\nSur les fonctions primitives par rapport à une fonction continue arbitraire\nⓉ\n(\nOn primitive functions with respect to an arbitrary continuous function\n)\n(1929)\n. The\n1928\npaper deals with the\nDirichlet\nproblem for\nLaplace's equation\nand in the\n1929\npaper he solved a problem originally posed by\nLebesgue\n.\nPetrovsky taught at Moscow University beginning in\n1929\nand, in\n1933\n, he was appointed as a professor. He was awarded his doctorate\n(\na much higher degree in Russia\n)\nin\n1935\n. It was in\n1933\nthat his third paper appeared in print,\nSur la topologie des courbes réelles et algébriques\nⓉ\n(\nOn the topology of real and algebraic curves\n)\nand in the following year five of his papers appeared. In addition to his roles at Moscow University, from\n1931\nto\n1941\nhe was also Head of the Mathematics Department at the Institute of Mechanical Engineering, where he taught evening courses. From\n1940\nto\n1944\n, Petrovsky was the Dean of Mechanics and Mathematics Faculty of Moscow University\n[\n24\n]\n:-\nHis time as Dean included the difficult war years, when the main body of the University operated in Ashkhabad and later in Sverdlovsk. The whole Faculty recall Petrovskii's constant concern about material resources and his unswerving efforts to maintain a high potential of academic and scientific work.\nFrom\n1943\nhe also taught at the\nSteklov\nInstitute. Despite holding these major roles, he had to live and work under difficult conditions\n[\n30\n]\n:-\nTogether with his wife Olga Afanasyevna he had two small rooms in a communal flat\n(\nflat shared with other families\n)\non\n2\nnd\nTverskaya-Yamskaya street. They lived there up to the autumn of\n1949\n. One room served as I G Petrovskiy's study. This was a basement room, and electrical light had to be on even in daytime. Neighbors always had the radio on, and this hindered work considerably. Ivan Georgievich worked at home. Usually he read and reflected lying on a sofa. He used the desk only to write down the calculations and to finish the work. Ivan Georgievich remembered that this made one of the neighbors say: \"A strange family it is: the wife goes to work every day, and the husband is always at home lying on a sofa.\"\nHe became rector of Moscow University in\n1951\nhaving been Vice-Director of the\nSteklov\nInstitute from\n1947\nto\n1949\n. His approach to the role of rector is described in detail in\n[\n4\n]\nand\n[\n5\n]\nbut we give a quotation from\n[\n30\n]\n:-\nIvan Georgievich had no special reception hours. He tried to speak to everyone coming to him. He was always rector: every moment and under any circumstances he had in mind the necessities and interests of Moscow University. Imagine him speaking with a scientist that came to him. After having discussed the problem the visitor came with comes the avalanche of questions on the visitor's specialty. It seems that I G Petrovsky specially prepared himself for this conversation. He asks about the people working in his domain and having obtained interesting results, about the articles the visitor has recently read, and about the interesting books in the visitor's domain. He also asks: \"What do you think about the level of former Moscow University students working in your domain? What has to be done to raise this level?\" This last question was very important to I G Petrovsky; he was constantly thinking about the improvement of teaching standards in Moscow University. He did his best to assure a good education for undergraduate and postgraduate students, and he wanted all talented young people to have the possibility to develop their talents; he wanted the best scientist to teach in Moscow University, and he wanted the best young students to be admitted.\nP S Aleksandrov\nand\nO A Oleinik\nwrite in\n[\n10\n]\nabout his achievements as rector:-\nIt can be said without exaggeration that among the Rectors of Russian Universities two have a special and prominent place:\n[\nLobachevsky\nand Petrovsky\n]\n. Both of them lived the life of the universities of which they were head, took part in all aspects of this life, and tried to steer it along the best possible path.\nAlso in\n1951\nhe was appointed as Head of the Department of Differential Equations at the University.\nPetrovsky's main mathematical work was on the theory of\npartial differential equations\n, the\ntopology\nof algebraic curves and surfaces, and\nprobability\n. Petrovsky also worked on the\nboundary value problem\nfor the heat equation and this was applied to both probability theory and work of\nKolmogorov\n.\nGårding\n[\n32\n]\nspoke about three of Petrovsky's papers on partial differential equations:-\n... the\n1937\npaper on the\nCauchy\nproblem for hyperbolic systems, the\n1939\npaper on the analyticity of solutions of elliptic systems, and the\n1945\npaper on lacunae for solutions of hyperbolic systems. In all three cases the work contained new definitive results; it took\n20\nyears to understand and re-prove them. The head-on attacks on these problems undertaken by Petrovskii have now been replaced by more humane approaches. To tell the truth, the original proofs of Petrovskii were extraordinarily difficult to understand, although each detail seemed to be plain. Somehow the author managed to hide the magic of his mighty intuition, allowing him to combine \"ice and flames\"; in this case the\nFourier\ntransform and non-linearity. Apparently, Petrovskii was the first to use the\nFourier\ntransform to study higher-order equations with variable coefficients.\nHe published a number of important textbooks:\nLectures on the Theory of Ordinary Differential Equations\n(1939)\n(\nbased on courses of lectures he gave at the universities of Moscow and Saratov\n)\n;\nLektsii po teorii integralnykh uravneny\nⓉ\n(\nLectures on the theory of integral equations\n)\n(1948)\n, translated into German as\nVorlesungen über die Theorie der Integralgleichungen\nⓉ\n(\nLectures on the theory of integral equations\n)\n(1953)\n(\nbased on courses of lectures he gave at the universities of Moscow\n)\n;\nLektsii ob uravneniakh s chastnymi proizvodnymi\nⓉ\n(\nLectures on partial differential equations\n)\n(1948)\n, translated into English as\nLectures in Partial Differential Equations\n(1954)\nand into German as\nVorlesungen über partielle Differential gleichungen\nⓉ\n(\nLectures on partial differential equations\n)\n(1955)\n(\nbased on courses of lectures he gave at the universities of Moscow\n)\n; and\nLectures on Partial Differential Equations\n(1950)\n(\nbased on courses of lectures he gave at the universities of Moscow\n)\n.\nP S Aleksandrov\nand\nO A Oleinik\nsum up his career in\n[\n10\n]\n:-\nPetrovsky is one of the few mathematicians whose work shapes the face of modern mathematics. However, he regarded his rectorship as the most important thing in his life, even more important than his mathematical research.\nIn the same work the breadth of his contributions is emphasised:-\nPetrovsky's knowledge was encyclopaedic. He had a thorough understanding of modern science and all its interconnections, was perspicacious and far-sighted, was able to discern long-term trends, and always emphasised them. He also showed a wide general culture, knowledge of diverse branches of science, a deep understanding of state problems in many outstanding public and state activities.\nAs to his interests outside mathematics, these are described in\n[\n8\n]\n(\nwritten in the present tense since he was sixty years old at the time\n)\n:-\nPetrovskii is a profoundly versatile cultured man with a very wide circle of interests. He passionately loves books on all branches of knowledge. In his home library, comprising many thousand books, all natural and humanitarian sciences are represented in detail, art and fiction\n(\nexcluding detective stories\n)\nin many languages, and he remembers each book he has. Petrovskii is interested not only in the contents of the book, but also in the personality of the writers, about which he owns numerous biographies and memoirs. Petrovskii is intensely fond of nature, especially the beauty of the Mid-Russian belt at all seasons of the year; his favourite form of rest is long walks, during which he often thinks over the next mathematical investigation. In art, as in science, he values depth, simplicity and clarity; in painting he likes Rembrandt, Serov, Nesterov, in music, Bach, Vivaldi, in architecture, simple and severe forms.\nHe received many honours to mark his achievements. He was awarded the title of Hero of Socialist Labour, won the Order of Lenin five times, the Order of the Red Banner of Labour three times, and also many medals. He was elected to the\nAcademy of Sciences of the USSR\nand made an Honorary Member of the\nMoscow Mathematical Society\n. He was awarded an Honorary Doctorate from the University of Bucharest, the University of Prague and from Lund University, Sweden. He was elected an Honorary Member of the\nRomanian Academy of Sciences\n. One of the main streets in Moscow is named after Petrovsky.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}