{
  "nome_completo": "John Watt Butters",
  "nome_curto": "J Watt Butters",
  "ano_nascimento": "1863",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Butters/",
  "lugar_nascimento": "McDowall Street, Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "J Watt Butters\n' parents were John Butters, a tailors' journeyman, and Isabella Watt. He spent three years at the Old High School in Edinburgh, then five years and four months at George Heriot's School in Cowgate Port, Edinburgh, where he was a student teacher. He first matriculated at the University of Edinburgh in October\n1882\nbut as well as studying at the University he also attended courses at the Established Church Training College.\nButters was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy from the University of Edinburgh in\n1894\n, and a B.Sc.\n(\nPure\n)\nin the same year. However he began teaching before completing his degrees. He taught for a short period at Aberystwyth and then at James Gillespie's School, Edinburgh. He became a mathematics teacher at George Heriot's School, Edinburgh, in\n1888\n[\n1\n]\n:-\nThere for eleven years he did splendid work, his teaching being characterised by a most inspiring freshness and clarity.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n6\nApril\n1896\nhaving been proposed by\nPeter Guthrie Tait\n,\nGeorge Chrystal\n, David Fowler Lowe, and\nJohn Sturgeon Mackay\n.\nIn\n1899\nButters left George Heriot's School to take up an appointment as Rector of Ardrossan Academy, Ayrshire\n[\n1\n]\n:-\n... under his guiding hand the Academy soon came to be recognised as one of the leading Secondary Schools in the West of Scotland. During the period of his Rectorship in Ardrossan Mr Butters played a leading part in the Council of the Educational Institute of Scotland, his skill in dealing with the difficult problems affecting such questions as superannuation being widely recognised by his fellow-members.\nHe held this post until he retired in\n1928\n. After retiring he returned to his native city of Edinburgh, living at\n116\nComiston Drive.\nButters joined the\nEdinburgh Mathematical Society\nin December\n1886\n. He served on the Committee during the five years\n1891\n-\n96\n, secretary for the three years\n1896\n-\n99\n, vice-President in session\n1899\n-\n90\n, then President for the session\n1900\n-\n01\n. He also contributed to the mathematical work of the Society, For example at the meeting of the Society on Friday\n11\nJanuary\n1889\n, J Watt Butters discussed the solution of an algebraic equation.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nHis obituary in the Proceedings of the\nRoyal Society of Edinburgh\nis at .\nIn\n[\n1\n]\nButters' friend\nJ B Clark\nwrites:-\nMr Butters was a man of exceptionally wide intellectual interests. He was a keen nature lover, and the fells of the Lake District, the peaks of Arran, and the bens of the Highlands had, for him, an irresistible attraction. He was, too, a most loyal friend, and all of us who were privileged to know him held him in the highest regard.",
  "math_areas": []
}