{
  "nome_completo": "Jack Warga",
  "nome_curto": "Jack Warga",
  "ano_nascimento": "1922",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Warga/",
  "lugar_nascimento": "Warsaw, Poland",
  "lugar_morte": "Boynton Beach, Florida, USA",
  "biografia": "Jack Warga\nwas born into a Jewish family in Warsaw, Poland. He writes:-\nMy family lived for at least\n150\n, and probably several hundred, years in Poland.\nHis given name was originally Yitzhak, and only after he emigrated to the United States did he begin to use the name Jack. His father was a furrier and the family had a nice home on Bielanska Street near the centre of Warsaw. His first language was Polish, not surprising one may say for someone born in Poland, but it is worth commenting that the majority of Jewish families spoke Yiddish at home and their children would have grown up with Yiddish as a first language. He attended a Jewish school that taught Hebrew, Bible, and Jewish history in Hebrew but all the other subjects in Polish. In fact the Polish language was one of Warga's special interests when he was at school and he had a particular interest in Polish literature and poetry. He was also interested in politics and, when in high school, he joined a socialist youth organisation which fostered in him an idealistic view of life which he continued to hold for the rest of his days.\nAlthough Poland, unlike Germany, never introduced anti-Jewish legislation, nevertheless in the\n1930\ns anti-Semitism was rampant. The fifteen year old Warga was attacked and injured by hooligans while walking in Warsaw in a racially motivated attack. His father decided that enough was enough and, in\n1938\n, sent his son to Brussels to continue his education. In fact the choice of Brussels was natural since the family had relatives living there so the young boy had a place to live. Probably this decision saved Warga's life, for most of his family died after the German invasion of Poland in September\n1939\n[\n7\n]\n:-\nHis mother and younger brother perished in the Holocaust, whereas his father survived, hidden in a shelter behind the stove, in the apartment of his Polish friend. The shelter was so well camouflaged, that the German policemen failed to find it, even though they searched the apartment on two occasions.\nIn Brussels, Warga attended high school and, after displaying his academic brilliance, he graduated in\n1939\n. He enrolled in the Polytechnical School in Brussels and began his education there in the autumn of\n1939\n. However, in May\n1940\nthe Germans invaded Belgium and before the end of the month Belgium had surrendered. Warga escaped to France which now was the focus of the advancing Germans and before the end of June a Franco-German Armistice was signed. A pro-German French government moved to Vichy in July\n1940\nand Warga managed to reach Vichy France. However, a Jewish boy was not particularly safe in Vichy France and, after a while, he escaped to Spain which was neutral but suffering badly under Franco's harsh rule. From Spain, Warga managed to get on a ship to Cuba and from there he reached the United States in\n1943\n. Of course, World War II was still raging and the United States had joined the Allies in the fight against Germany and Japan. Warga became an officer in the US Army\n[\n7\n]\n:-\nHe was to visit Europe again, this time as a US soldier, at the end of the war. It was around this time he started to use the name Jack.\nAfter the war ended, Warga was demobbed from the army and only at this stage was he able to resume his education. After undergraduate studies, he undertook research at New York University advised by the number theorist Harold Nathaniel Shapiro and he was awarded a Ph.D. in\n1950\nfor his\n76\n-page thesis\nOn the Representation of Large Integers as Sums of Primes\n. He published a paper with the same title as his thesis, written in collaboration with his advisor Harold Shapiro, which was published in\n1950\n. Warga now left the academic world and he worked for sixteen years as an industrial mathematician and computer scientist. After being employed by several R&D corporations in New York, he moved to California where again he worked for R&D corporations. He then moved to Wilmington, Massachusetts where he was employed as a mathematical analyst in the R&D Division of the aerospace corporation Avco. From\n1957\nto\n1966\nhe was the Manager of the Mathematics Department of the R&D Division of Avco. It was the problems that he encountered in this post that led him to study optimisation and control theory\n[\n7\n]\n:-\nJack recalled that one of the problems he worked on was to determine the angle of satellite re-entry into the atmosphere for a soft landing. His theoretical analysis matched the simulation results obtained by the engineering division, thereby contributing valuable insights into this area of engineering research.\nHis papers\nRelaxed variational problems\n(1962)\nand\nNecessary conditions for minimum in relaxed variational problems\n(1962)\nintroduce the notion of a relaxed control and he applies the method of relaxation to the analysis of optimal control problems. In\n1963\nhe published three papers:\nMinimizing certain convex functions\n;\nA convergent procedure for convex programming\n; and\nA convergent procedure for solving the thermochemical equilibrium problem\n. Over the next few years he published a whole series of papers on these topics. He wrote a book which has become a classic, namely\nOptimal Control of Differential and Functional Equations\n(1972)\n.\nLamberto Cesari\nwrites\n[\n1\n]\n:-\nThis is a scholarly, clear presentation of that aspect of optimal control theory which deals with the existence of usual, generalized\n(\nrelaxed\n)\nand approximate optimal solutions, and necessary conditions for optimality. Along with the unilateral constraints on the state variable, the side conditions extensively investigated in the book are ordinary differential equations with or without delays, functional\nintegral equations\nand functional equations in general\nBanach spaces\n. ... Warga's extensive exposition will be of value to mathematicians interested in functional analysis, calculus of variations, optimal control and systems science.\nNow long before this book was published, Warga had left working as an industrial mathematician and computer scientist having been appointed to the Northeastern University in Boston, Massachusetts, as Professor of Mathematics in\n1966\n. He spent the rest of his career at Northeastern. It was there that he made another highly significant contribution\n[\n3\n]\n:-\nJack's study of nonsmooth control systems led him to the discovery in\n1975\nof a generalized derivative now known as the Warga derivate containers. This concept and its extensions have played a crucial role in nonsmooth and variational analysis as one of the most delicate and effective tools.\nThe mathematical community benefited from Warga's contributions in many ways, one important way being as an editor of the\nSIAM\nJournal on Control and Optimization\n. He served on the editorial board of this journal for\n25\nyears between\n1964\nand\n1989\n. He was the co-managing and managing editor of the journal for eleven years from\n1967\nto\n1978\n. The authors of\n[\n5\n]\nwrite about Warga's generosity towards everyone around him:-\nJack's many friends and colleagues remember him as an exceptional human being. His kindness, generosity, and patience, particularly toward the young researchers he inspired and guided, are legendary. Boris Mordukhovich refers to the many people whom Jack generously helped, not expecting anything in return. He encouraged young mathematicians\n(\nincluding those who were not his students\n)\n, advising them to write papers and publish them. Boris recalls meeting Jack three days after arriving in the United States: \"He helped me enormously by advising me on the preparation of my CV and introducing me to the mathematical community. He even bought me shoes after seeing that I was poorly dressed.\" Helene Frankowska remembers how, in the early\n1980\ns, when she was pursuing her PhD studies at Scuola Internazionale Superiore di Studi Avanzati in Trieste, Italy, separated from her advisers and academically isolated, she had initiated a correspondence with Jack over their shared interests in nonsmooth analysis. Then, and subsequently, he provided valuable comments about her work. He would later invite her to stay at his home in Boston.\nThe authors of\n[\n3\n]\nwrite about his interests outside mathematics:-\nBesides being an outstanding mathematician and extremely deep researcher, Jack also had a wide range of interests in the intellectual pursuit of history, philosophy, poetry, music, and languages. Jack was exceptionally kind and generous, especially towards young mathematicians. Anonymously, Jack also worked extensively for human rights for scientists throughout the world. He will be sorely missed by his students, colleagues, and the mathematical community at large.\nKazimierz Malanowski recalled the emails he exchanged with Warga following the conference organised in celebration of Warga's\n80\nth\nbirthday. This IEEE 'Conference on Decision and Control' was held at The Venetian Hotel, Las Vegas, Nevada, in December\n2002\n[\n7\n]\n:-\nJack was deeply interested in the new development of the Polish language and I sent him some books on the topic, including an etymological dictionary. He wrote to me that he had been studying the dictionary all night. I also sent him the memoirs of Władysław Bartoszewski, a Polish writer and politician, a former prisoner of both Auschwitz and communist prisons, who was active in \"Zegota\" - a Polish underground organization helping Jews during the Holocaust. Just by chance, it happened that both of them, Jack and Mr Bartoszewski, were born in\n1922\nand were living on the same Bielanska Street in Warsaw. Unfortunately, they have never met.\nWarga was married to Faye; they had a son Arthur and a daughter Charna. In September\n2008\n, he went with Faye to the conference \"\n50\nYears of Optimal Control\" organised by the\nBanach\nCentre of Mathematical Studies in Bedlewo, Poland. He was an honoured guest at the conference and delivered the lecture\nTaming functions with unbounded variations in optimal control\n.\nAn abstract of his lecture is given at\nTHIS LINK\nKazimierz Malanowski writes about this conference:-\nIt was a sentimental journey for Jack. He came together with Faye and after the conference they visited Warsaw. I was travelling with them, in the same train compartment and I remember that Jack was reciting some Polish poems. Faye told me that sometimes he used to do so at home, although neither she, nor anybody of the household could understand him. In Warsaw they visited Bielanska Street, which was completely destroyed during the Warsaw Uprising in\n1944\n, and rebuilt afterwards, in a completely new style. The only details that he was able to recognize were some old paving stones and street cart railways, no longer in use. They were more fortunate in the small town of Radzyn Podlaski, where Jack's grandfather had had a house. The house still exists and Jack was happy to visit it and to talk with the present inhabitants. I understand that this was Jack's last foreign trip. I do hope that reconnection with his roots gave him the satisfaction he wanted.\nHis wife Faye became ill shortly after they returned to the United States and died in\n2009\n. Qiji Zhu, who had been one of Warga's doctoral student being awarded his Ph.D. in\n1992\n, visited Warga in his Boynton Beach home shortly after the death of his wife:-\nIt was the same house but felt different now that Faye was gone. Jack showed us Faye's study where one of her unfinished paintings was still on the easel and told us that her memory kept returning to him. I could feel his deep sadness. Several weeks later however, I received a phone call from Jack asking me to help him find two articles on differential equations. 'I am working on a problem that has haunted me for many years', Jack told me and added: 'I have to do math. It keeps me sane'.\nAlthough he was\n88\nyears old in June\n2011\n, Warga did not appear to be that old since he was still in excellent physical and mental shape. In fact he was still actively engaged in mathematical research and looked to have many years in front of him. Sadly, however, he died as the result of an accidental fall. His son Arthur only survived his father by a few weeks and died in August\n2011\nafter a prolonged illness.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Number Theory"
  ]
}