{
  "nome_completo": "Jacob T Schwartz",
  "nome_curto": "Jacob T Schwartz",
  "ano_nascimento": "1930",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwartz_Jacob/",
  "lugar_nascimento": "New York City, USA",
  "lugar_morte": "New York, USA",
  "biografia": "Jacob T Schwartz\nwas known to his friends as Jack and even occasionally wrote papers as Jack Schwartz. His parents were Ignatz and Hedwig Schwartz, and he was born in the Bronx, the northernmost of New York's five boroughs. After attending school in New York City, Schwartz entered the City College of New York. His performance was outstanding and he was awarded a B.S. by the College in\n1948\n, after which he went to undertake postgraduate studies in mathematics at Yale University.  After receiving an M.A. from Yale in\n1949\nhe continued to study there for his doctorate with Nelson Dunford as his thesis advisor. Schwartz submitted his dissertation\nLinear Elliptic Differential Operators\nto Yale in\n1951\nand was awarded a Ph.D. in the following year.\nFrom\n1951\n, Schwartz was employed at Yale as an Instructor in Mathematics. Two years later he was promoted to assistant professor and remained at Yale until\n1957\n. During these years he advised his first postgraduate student, being the thesis advisor for the remarkably talented Gian-Carlo Rota. Schwartz was appointed as an associate professor at New York University in\n1957\n,\nbeing promoted to full professor there in the following year. For\n42\nyears he was professor at the Courant Institute of Mathematical Sciences at New York University.\nMartin Davis\n, professor of computer science and mathematics at the University, gave the following indication of how Schwartz moved from one topic to another during his career\n[\n2\n]\n:-\nJack's style has been to enter a new field, master quickly the existing research literature, add the stamp of his own forceful vision in a series of research contributions, and finally, leave behind an active research group that continues fruitful research for many years along the lines he has laid down.\nA more explicit list of the topics to which Schwartz has made major contributions is given in the article\n[\n1\n]\n:-\nIn his long and distinguished career as a mathematician and computer scientist, Jacob T Schwartz has made very many important contributions to a remarkable variety of different subject areas. His style has been to enter a new field, quickly master the existing research literature, add the stamp of his own forceful vision in a series of research contributions, and finally leave behind an active research group that continues fruitful research for many years, along the lines he has laid down. A brief list of some of the areas to which Schwartz has made major contributions gives some notion of his breadth:\nspectral theory\nof linear operators, von Neumann algebras, macro economics, the mathematics of quantum field theory, parallel computation, computer time-sharing, high-level programming languages, compiler optimization, transformational programming, computational logic, motion planning in robotics, and, most recently, multimedia.\nSchwartz's early work with his thesis advisor Nelson Dunford led to the two of them collaborating on a famous book\nLinear Operators\nwhich quickly became known simply as 'Dunford and Schwartz'. The first of the three volumes of this book\nGeneral Theory\nappeared in\n1958\n.\nE H Rothe\nbegins a review as follows:-\nThis is a comprehensive account of the modern theory of linear operators, mainly in\nBanach spaces\n, and of applications of the theory of such operators to other parts of mathematics.  The present volume I under review contains the\ntopological theory\nof spaces and operators, and the spectral theory of \"arbitrary\" operators and some applications; the second volume will contain the spectral theory of completely reducible operators and further applications, e.g., applications to differential operators and\npartial differential equations\n.\nThe second volume,\nSpectral theory. Self adjoint operators in\nHilbert\nspace\n, was published in\n1963\n. C Foias writes his review of this volume two years after its publication:-\nPart I of the authors' treatise on contemporary analysis has become the standard work for students and specialists in this field. In the two years since its publication, Part II has had a similar success. Its title is indeed modest considering the topics presented, which cover the main achievements in many fields of classical and modern analysis. Many of its chapters are, in fact, monographs, yet the whole work\n(\nincluding the first volume\n)\nhas a great unity in exposition as well as in the choice of relevant facts. Undoubtedly Part II gives one of the most correct pictures of what has been done in our century\n(\nexcepting perhaps the past five years\n)\nin the theory of linear operators in\nHilbert\nspace, and of what has been accomplished in analysis with the aid of this theory.\nThe third and final volume of this impressive book,\nSpectral operators\n, was published in\n1971\n. H R Dowson writes:-\nAs in the preceding two parts, Volume III of this monumental treatise on the theory of linear operators contains a wealth of material.\nThe continuing importance of this classic text can be seen from the fact that all three volumes of 'Dunford and Schwartz' were reprinted in\n1988\n.\nWe indicated above how Schwartz moved between different areas and by the time this third volume was published he had already written books of great significance in totally different areas and his career had also changed tack. He was appointed Professor of Computer Science and Mathematics at New York University and he founded the Computer Science Department there in\n1964\n, becoming chairman of the Department. To illustrate the different areas he worked in we note that he published\nLectures on the mathematical method in analytical economics\n(1961)\n, and two school level textbooks\nMatrices and Vectors for High-Schools and Colleges\n(1961)\nand\nRelativity In Illustrations\nin\n1964\n. This last mentioned work is described by the publisher as follows:-\nThis clear, non-technical treatment makes relativity more accessible than ever before, requiring only a background in high-school geometry.\nOther books during this period include\nW*-algebras\n(1967)\nnext, jointly with Melvin Haisner,\nLie groups; Lie algebras\n(1968)\nand\nNonlinear functional analysis\n(1969)\n. In the Preface to the first of these texts, Schwartz writes:-\nThe present set of notes treats the general theory of von Neumann algebras. I have confined the discussion to algebras acting in separable\nHilbert spaces\nand have systematically emphasized the use of direct integral decompositions.\nOne of Schwartz's first projects in computer science was to design the computer language SETL, based on the mathematical theory of sets. In\n1973\nhe published\nOn programming\nwhich presented the general approach he had followed, while two years later he published\nOn programming: An interim report on the SETL project. Part I: Generalities. Part II: The SETL.\nSchwartz writes in the Preface:-\nThe material presented in the present volume is the second of three expected parts of an overall summary of work during the past several years on SETL, a new programming language drawing its dictions and basic concepts from the mathematical theory of sets.\nWithin computer science, his interests ranged much more broadly than just the development of languages. He became interested in compiler optimization and collaborated on this topic with scientists at I.B.M. during a period working there as a visiting scientist. He also became interested in parallel computing, robotics, computer vision, and computer design. His interest in multimedia led to his founding the New York University Center for Digital Multimedia. He took a break in his career at New York University when he was director of the Information Processing and Techniques Office of Defense Advanced Projects Agency during\n1987\n-\n89\n. During this period he published the article\nThe New Connectionism: Developing Relationships between Neuroscience and Artificial Intelligence\nin\n1988\n. Ten years later he began research in molecular biology having made the following comment in the paper published in\n1988\n:-\nStunning new discoveries can be expected from experimental neuroscience during the coming decade. The astonishing successes of molecular biology constitute one major ground for this optimistic assessment.\nHe was still undertaking research in molecular biology at the time of his death.\nHis marriages to Sandra Weiner and Frances E Allen both ended in divorce. Let us note in passing that Frances Allen was one of the scientists that Schwartz collaborated with on compiler optimization at I.B.M. His third wife was Diana, who reported that died in his sleep of liver cancer at his home in Manhattan.\nSchwartz was honoured with election to the\nNational Academy of Science\nin\n1976\nand the National Academy of Engineering in\n2000\n. He was also honoured with election as vice president of the\nAmerican Mathematical Society\nin\n1984\n. He was awarded the Steele Prize by the\nAmerican Mathematical Society\n, the Wilbur Cross Medal by Yale University, the Townsend Harris Medal by the City University of New York, and the Mayor's Medal for Contributions to Science and Technology by New York City.\nLet us end this biography with a quotation by Schwartz. It is a quotation which both authors of this biography\n[\nJOC and EFR\n]\n, as developers of teaching software, can very much agree with:-\nMany conventional academic skills amount to the ability to select and apply ... procedures rapidly and correctly ....\n[\nComputer\n]\ncourseware can concentrate on one skill at a time, in a manner impossible for a textbook and hardly available to the classroom teacher, namely by asking the student to handle only that part of a procedure on which pedagogical stress is to be laid, while other aspects of the same procedure are handled automatically by the computer. ... This scheme, which combines student interaction with computer assistance, has the merit of focusing attention on the key strategic and conceptual decisions needed to handle a problem ... This should be of significance to both the strong student ... and the weak student.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Topology"
  ]
}