{
  "nome_completo": "Jacques Alexandre Le Tenneur",
  "nome_curto": "Jacques Le Tenneur",
  "ano_nascimento": "1610",
  "ano_morte": "1660",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Tenneur/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "France",
  "biografia": "Little is known of the life of\nJacques Le Tenneur\n(\neven the dates given for his birth and death are uncertain\n)\nexcept that he was a friend of\nMersenne\nand that he corresponded with\nGassendi\n. What little we do know about his life comes from this correspondence.  It is thought that he spent the first\n30\nor so years of his life in Paris where he was almost certainly educated. We know from his letters that he was proud to describe himself as an amateur and a self-educated person. At one point in his correspondence with\nMersenne\n, he firmly denies that he was taught by\nRoberval\n. In this he is countering a comment by\nMersenne\nwho seemed to believe that\nRoberval\nhad been his teacher. Paolo Galluzzi writes\n[\n6\n]\n:-\nHe has carefully studied\nGalileo\n's 'Dialogues' and 'Two new sciences', while he acutely and passionately defends the 'De motu' by\nTorricelli\nfrom\nRoberval\n's objections\n(\nLe Tenneur to\nMersenne\n,\n9\nJuly\n1647)\n. M Le Tenneur appears as a convinced \"Galilean\" full of admiration for\nGassendi\n's atomism. Of\nGassendi\nhe particularly appreciates the insertion of scientific ideas into an organic philosophical background as well as his talent as experimenter. As many others in those years, Le Tenneur was fascinated by\nDescartes\n' physics, but, as he wrote to\nMersenne\n, he admired\nDescartes\n' insightful arguments, but did not find them at all convincing ...\n(\nLe Tenneur to\nMersenne\n,\n9\nJuly\n1647)\n.\nIt is known for certain that by\n1646\nLe Tenneur was in Clermont in the Auvergne region of central France. Clermont was the town that\nPascal\nhad been born in\n23\nyears before. In\n1651\nhe was counsellor to the provincial senate of Guyenne. At this time the Fronde, a civil war in France, was taking place and\n1651\nis the year Louis XIV lifted the siege of Cognac and assured the obedience of Guyenne. It is highly likely that Le Tenneur was involved with the political feuding of the Fronde.\nGalileo\nwrote down his ideas on falling bodied in\nDu Motu\nⓉ\n(\nOn movement\n)\naround\n1590\nbut never published them. In\n1646\nHonoré Fabri\npublished\nTractatus physicus de motu locali\nⓉ\n(\nTreatise on local physical movement\n)\nwhich set out to refute\nGalileo\n's theory of motion of falling bodies and to substitute a theory of his own.\nMersenne\n, clearly aware that Le Tenneur was a firm believer in\nGalileo\n's theory, wrote to him late in\n1646\nasking him to support\nGalileo\n's theory against the attacks by\nFabri\n. In January\n1647\nLe Tenneur corresponded with\nGassendi\nwho also encouraged him to argue the case for\nGalileo\n. Le Tenneur replied with a long letter to\nMersenne\nwritten on\n13\nApril\n1647\n. As\nZeno\n's paradoxes had shown in antiquity, the idea of a mathematical instant led to difficulties.\nFabri\nhad argued that mathematical instants do not exit and hence\nGalileo\n's theory breaks down immediately since he assumes their existence. Le Tenneur. however, spotted that\nFabri\n's own theory, despite his belief to the contrary, also required mathematical instants. Le Tenneur then argues that\nGalileo\n's theory is superior to that of\nFabri\nsince it did not depend of the unit of time used for measurements. He points out the invariance in\nGalileo\n's theory that\n(\nsee for example\n[\n7\n]\n)\n:-\n... the multiplication of times according to any proportion whatsoever always confirms the uniform proportion among the spaces, and it does not happen that you get a larger or a smaller space if the equal times get longer or shorter .... Nor will there be a larger ratio between four spaces and two spaces, than between two spaces and one space; nor will there occur a larger or smaller space. .... But all is found to cohere and agree marvellously.\nAnother part of\nFabri\n's argument was that it was impossible for a body sliding down an inclined plane and another body in free fall to both pass through an infinite number of velocities. This argument really claims that two lines of different lengths cannot both contain an equal number of points. Le Tenneur essentially refutes this by showing that in a right-angled triangle every point on one of the shorter sides corresponds to a point on the hypotenuse by drawing a line parallel to the other short side, and visa-versa. Palmerino writes\n[\n7\n]\n:-\nHe finally declared that he had entered into the controversy on the insistence of a few friends and of\nMersenne\n, and not because he had any faith in the possibility of changing the opinions of his stubborn interlocutors\nMersenne\nsent Le Tenneur's letter to\nFabri\nwithout disclosing its author.\nFabri\nthen wrote to his own pupil Pierre Mousnier in May\n1647\n, saying that the views expressed by the anonymous critic were powerful ones.\nFabri\nasked Mousnier to reply which he did in a letter to\nMersenne\non\n1\nOctober\n1647\n.\nLe Tenneur's letter to\nMersenne\nformed the basis of his most important work\nDe motu naturaliter accelerato tractatus physico-mathematicus\nⓉ\n(\nPhysico-mathematical treatise on naturally accelerated motion\n)\n, published in\n1649\n, where he showed that he understood\nGalileo\n's arguments for free falling objects while\nFabri\nand others did not. Most people at that time believed that the speed of a body in free fall was proportional to the distance it had fallen. There was also a belief that all bodies have an innate speed of a certain determinate degree. Le Tenneur's argument against this is put at follows\n(\nsee for example\n[\n7\n]\n)\n:-\nIt must needs be the case that the first space is to the second space like the two first spaces to the two subsequent ones, as has been shown against Fabri, because we obviously need a principle of uniformity in natural events as these need to proceed in an uninterrupted course. The consequence of this is that heavy bodies have no innate speed, but that in falling, they pass through all degrees of slowness and speed.\nAnother important topic causing much controversy at this time was the vacuum. Around\n1644\n,\nEvangelista Torricelli\nwas the first to conduct experiments with a column of mercury in a tube which he inverted and created a vacuum. Le Tenneur had been present in\n1647\nwhen Florin Périer,\nPascal\n's brother-in-law, repeated\nTorricelli\n's experiment in Clermont. This did not convince some who witnessed the experiment that a vacuum had been created. Someone said that they would only believe in a vacuum if a hole was made in the tube and the mercury seen to fall. Le Tenneur offered a\n100\nto\n1\nbet that it would fall, but attempts to make a small hole in the glass failed. There continued to be much argument and later a suggestion was made to see whether the column of mercury would reach the same height at the top of a mountain as at the foot.\nMersenne\nwrote to Le Tenneur in January\n1648\nsuggesting he carry out such an experiment on the Puy-de-Dôme. Le Tenneur replied on\n18\nJanuary\n(\nsee for example\n[\n3\n]\n)\n:-\nI tell you that I think, along with\nRoberval\n, that it would be entirely useless, and that the same thing found below would be the same high up.\nOf course Le Tenneur was wrong in his belief. However, he had other objections to\nMersenne\n's suggestion, saying that he was no longer living in the Auvergne but had moved to Tours. Also, he wrote:-\n... do you think that carrying a glass tube and\n20\npounds of mercury up a mountain that high is easy?\nIn an earlier letter Le Tenneur had asked\nMersenne\nhow the cost of such an expedition might be met.\nMersenne\nhad suggested he apply for financial assistance to \"a great lady of my acquaintance\". In his letter of\n18\nJanuary\n1648\n, Le Tenneur guesses that\nMersenne\nis referring to:-\n... the fat Marquise d'Effait, who gladly dances with anyone, but would not consider spending a penny for the advancement of science.\nIn fact the Puy-de-Dôme experiment was carried out by Florin Périer in October\n1648\n.\nMersenne\nhad expressed other thoughts about the vacuum in his January\n1648\nletter. He presented an argument, first made by Étienne Noël: the fact that light can pass freely through the glass suggests that other 'subtle matter' might also be able to pass through. Perhaps above the column of mercury there is not a vacuum but this 'subtle matter'. Le Tenneur replies that\n[\n3\n]\n:-\n... he accepts the view common among his contemporaries that light is something corporeal. But since he believes that it is a limited 'horror of vacuum' that holds up the column of mercury, he argues that if light or subtle matter could simply enter and fill the empty space, then the column in the tube would fall.\nLe Tenneur also published\nTraité des quantités incommensurables\nⓉ\n(\nTreatise on irrational quantities\n)\n(1640)\nwhich is a work on the foundations of algebra. The full title of the work is\nTraité des quantites incommensurables ou sont decidees plusieurs belles questions des nombres rationaus et irrationaus, l'erreurs de Stevin refutées, le dizieme livre d'Euclide illustre de nouvelles demonstrations\nⓉ\n(\nTreatise on irrational quantities in which several beautiful questions on rational and irrational numbers are answered, errors of Stevin are  refuted and the tenth book of Euclid is illustrated with new demonstrations\n)\n. Le Tenneur clearly was trying to argue against the notions current at the time on using algebra to study geometry. He wished geometry to be Greek style, not in the style of\nDescartes\nand his followers.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}