{
  "nome_completo": "Jakob Nielsen",
  "nome_curto": "Jakob Nielsen",
  "ano_nascimento": "1890",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nielsen_Jakob/",
  "lugar_nascimento": "Mjels, Als, Schleswig (now Denmark)",
  "lugar_morte": "Elsinore, Denmark",
  "biografia": "Jakob Nielsen\n's mother died when he was three years old. From the age of\n10\nhe lived with his aunt at Rendsborg where he attended a\nRealgymnasium\n. There he studied religion, Latin and modern languages, history and geography, and mathematics and science. His relations with his aunt deteriorated, however, and Nielsen left her home when he was fourteen and he continued at school but earned his living by tutoring. In\n1907\nhe was expelled from school for breaking school rules by founding a pupil's club.\nNielsen did not let this damage his education but continued to study on his own. He entered the University of Kiel in\n1908\n, studying a wide range of subjects. Among the teachers at Kiel who had a profound influence on him was\nLandsberg\nwho suggested the topics which were to form Nielsen's doctoral thesis, although\nLandsberg\ndied before the thesis was completed. Nielsen spent the summer term of\n1910\nat the University of Berlin but returned to Kiel where\nDehn\nwas appointed in\n1911\n.\nDehn\ngreatly influenced Nielsen and introduced him to the newest ideas in\ntopology\nand\ngroup theory\n. In particular it was through\nDehn\nthat he became interested in\nfree groups\nand his paper he published on this topic in\n1921\ncontained ideas which came from his association with\nDehn\nin Kiel.\nAfter completing his doctorate Nielsen served in the German marines, continuing in military service in different parts of the world throughout World War I. In particular he served in Belgium and then Constantinople where he advised the Turkish government on how to defend the entrance to the Black Sea. At the end of the war Nielsen returned from Turkey to Germany through Russia and Poland and he later published an account of his travels from a diary which he had kept.\nNielsen married Carola von Pieverling early in\n1919\n. She was a German medical doctor and the couple had a happy marriage bringing up one son and two daughters. Nielsen spent time in\n1919\nin Göttingen where he met\nHecke\n. When\nHecke\nwas appointed to Hamburg in\n1919\n, Nielsen went as his assistant, but the following year Nielsen was appointed to a chair at Breslau. This allowed Nielsen to become a colleague of\nDehn\nwho was a professor there. Two inaugural lectures which Nielsen gave in Breslau in\n1921\nare published for the first time in\n[\n1\n]\n.\nThe Treaty of Versailles at the end of World War I declared that part of Schleswig should revert to Denmark in keeping with the principle of self-determination. The boundary was determined by a plebiscite in\n1920\n. In\n1921\nNielsen, who was born in Schleswig, elected to became a Danish citizen and he resigned his chair in Breslau and returned to Denmark to teach in Copenhagen. He taught mathematics at the Royal Veterinary and Agricultural University for four years. In\n1925\nhe succeeded\nJuel\nas professor of theoretical mechanics at the Technical University of Copenhagen.\nIn\n1919\nNielsen purchased a house on the island of Als on which he was born. A few years later\nHarald Bohr\nalso purchased a house on the island. Fenchel writes in\n[\n2\n]\n:-\nYear after year, in the summer vacation, young and old, Danish and foreign, gathered about\n[\nNielsen and\nHarald Bohr\n]\n. Apart from normal holiday activities, the study of mathematics was pursued. Not a few advances and discoveries were presented in Bohr's little half-timbered house, in the study remarkable for its blackboard - unforgettable experiences which are remembered with gratitude by all who had the privilege of attending.\nNielsen wrote a new text on theoretical mechanics which was published in two volumes in\n1933\n-\n34\n. Hansen writes in\n[\n6\n]\n:-\nThe book was to a large extent original pedagogical work on an advanced level for its time, and in his exposition, Nielsen made extensive use of mathematical tools such as vectors and matrices, which were then relatively new concepts in textbooks. The text is not very easy, and Jacob Nielsen's lectures were rather demanding on the part of the students. He was, however, well known for his ability to express himself with great clarity and intensity.\nThere were some fears for Nielsen's safety during World War II. Principally there were worries that since he had chosen to leave his post in a German university and take Danish citizenship in\n1921\nthe Nazis might give him a difficult time. These fears were not realised and Nielsen was not targeted by the Nazis. Nielsen taught a course on aerodynamics in\n1941\nand the course formed the basis of a third volume of his theoretical mechanics text published in\n1952\n.\nIn\n1951\nNielsen succeeded\nHarald Bohr\nas professor of mathematics at the University of Copenhagen. However he resigned in\n1955\nand spent the last years of his life in the\nRoyal Danish Academy of Sciences\nresidence. He had been elected to membership of the Academy in\n1926\n.\nIt might seem a strange decision for Nielsen to resign this prestigious chair, but he was sixty-five years of age in\n1955\nand he felt that his international commitments were too much to allow him to do full justice to all his tasks. These international commitments related mostly to UNESCO, the United Nations Educational, Scientific and Cultural Organisation which had been set up in\n1948\n. He had been elected to the executive board of UNESCO in\n1952\n. It was a role he carried out until\n1958\nand he made an outstanding contribution as someone of the highest personal integrity.\nNielsen is well known for work in several areas. His work on group theory is important as he was one of the founders of combinatorial group theory. In particular he proved that a subgroup of a finitely generated free group is free in\n1921\n.\n(\nIn\n1926\nSchreier\nproved that the finitely generated assumption is not necessary.\n)\nHis work on topological transformations is also important. Nielsen studied the mapping class group of a torus in his thesis of\n1913\n. He went on to examine surfaces of genus\n1\nas well as surfaces of higher genus. He also produced work on fixed point theory related to that of\nDehn\nand the theory of discontinuous groups of isometries of the hyperbolic plane.\nBernhard Neumann\n, reviewing Nielsen's collected papers which were published in two volumes in\n1986\n, writes:-\nJakob Nielsen initiated much of the topology of surfaces and of combinatorial group theory, and for this reason alone he occupies an important place in the history of\n20\nth\ncentury mathematics. However, his work is not merely of historical interest, but is still\n(\nor again\n)\nmuch used and quoted today. The publication of his collected mathematical papers is, therefore, timely and very welcome; the more so as the two volumes under review make the papers more readily accessible to today's researchers. Thus, for example, not many mathematicians will in the past have had access to Nielsen's doctoral dissertation, presented to the Universitat Kiel in\n1913\n. Other papers appeared in various Scandinavian periodicals or conference proceedings, many of them in Danish: the majority of them, and also many of Nielsen's papers in German, have for this collection been translated into English. Among them is his fundamental paper, in the Matematisk Tidsskrift in\n1921\n, on free groups, in which the Nielsen-\nSchreier\ntheorem\n(\nor rather Nielsen's part of it\n)\nis proved for the first time: now there is no further excuse for misquoting this paper, as has happened repeatedly in the past.\nThere was however, some work by Nielsen which was not published in his collected works. This was work which he had undertaken with his student and friend Werner Fenchel, the author of the articles\n[\n2\n]\nand\n[\n3\n]\n, and was based on a course of lectures Nielsen gave on the theory of discontinuous groups of isometries of the hyperbolic plane in\n1938\n-\n39\n. In fact Fenchel contributed the final article\n[\n1\n]\non this topic. This piece of mathematics, now known as Fenchel-Nielsen theory, had a rather strange history.\nFenchel and Nielsen decided to write a monograph on the theory but neither were happy with the first draft of the manuscript which they produced. They were working on a revision when Nielsen died in\n1959\nafter an illness lasting about eight months. Matters were certainly not helped by the fact that the original manuscript was stolen from Fenchel's car but he continued to feel that the results were unsatisfactory. Eventually Fenchel wrote a book\nElementary geometry in hyperbolic space\nwhich was intended to put give an approach with would make presentation of Fenchel-Nielsen theory much clearer. Fenchel died in\n1988\nwith the whole project close to completion.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Topology"
  ]
}