{
  "nome_completo": "James Bradley",
  "nome_curto": "James Bradley",
  "ano_nascimento": "1693",
  "ano_morte": "1762",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bradley/",
  "lugar_nascimento": "Sherborne, Gloucestershire, England",
  "lugar_morte": "Chalford, Gloucestershire, England",
  "biografia": "English astronomer and priest,\nJames Bradley\nwas the third son of William Bradley\n(\nborn\n1640)\nand Jane Pound\n(\nborn\n1656)\n, who had married in\n1678\n. Born in March\n1693\nand baptised on\n3\nOctober the same year, both in Sherborne, Gloucestershire, James attended Westwood's Grammar School at Northleach, before attending Balliol College, Oxford, where he was admitted as a commoner, that is a student who does not have a scholarship. He received his BA in October\n1714\nand his MA in June\n1717\n. Following this he began a career in the church.\nHe was ordained deacon on\n24\nMay\n1719\n, and in July of that year, after being ordained a priest, became vicar of Bridstow in Monmouthshire, South-East Wales. However, James's career with the church was not to be long-lived. He resigned as a clergyman on\n31\nOctober\n1721\nwhen he was appointed Savilian Professor of Astronomy in the University of Oxford. He was later offered the chance to return to the church and take over at the parish of Greenwich, but he rejected the offer, opting instead to devote himself to astronomy and continue at the Greenwich observatory, where he was located at the time.\nThe most significant of Bradley's early years, when considering his later career in astronomy, were those spent in contact with his maternal uncle, the Reverend James Pound, a leading astronomical observer in England, who had worked with\nEdmond Halley\nand\nSir Isaac Newton\n. It was through this uncle that James would meet\nHalley\n.\nBy\n1715\n, James Bradley had joined his uncle James Pound in carrying out astronomical observations. Pound provided Bradley with occasional financial assistance, and is credited with influencing Bradley's interests towards astronomy. Despite Pound's death in November\n1724\n, Bradley continued to use his uncle's observatory at Wansted. Though no will was left, Bradley maintained his usage of the same instruments, and residence with Pound's widow.\nHaving previously written to the\nRoyal Society\nin March\n1716\nabout the aurora, two of Bradley's observations were published by Halley in\n1718\nin the\nPhilosophical Transactions\nof the\nRoyal Society\n.\nHalley\npraised Bradley's abilities and, in November\n1718\n, Bradley was elected a fellow of the\nRoyal Society\non\nHalley\n's recommendation.\nAppointed Savilian Professor of Astronomy in the University of Oxford in\n1721\n, giving his inaugural lecture on\n26\nApril\n1722\n, he showed a great interest in the motions of Jupiter's satellites. Comparing his own observations from London of the eclipses of the four main satellites\n(\nthe Galilean moons Io, Europa, Ganymede and Callisto\n)\nwith those made from New York and Lisbon, and observing the differences in the times of disappearance and reappearance of each as it passed behind Jupiter, he was able to deduce the differences in longitude between the three observation locations. In\n1726\n, he reported these results to the\nRoyal Society\n.\nIt was during this programme of observations that he noted the different paths that each satellite followed. He thus set out to improve the tables of the satellites' motions, and to understand these differences in motion. Continuing into the\n1730\ns, he proposed a formula for the relationship between the motions of the four satellites based on their mutual gravitational attraction.\nBradley was best known for two important discoveries in astronomy: the aberration of light\nand the nutation of the Earth's axis. The aberration of light is an astronomical phenomenon which produces an apparent motion of celestial bodies about their true positions, dependent on the velocity of the observer. Nutation is a phenomenon which causes the orientation of the axis of rotation of a spinning astronomical body to vary over time. It is caused by the gravitational forces of nearby bodies acting upon the spinning body. A difference is made between nutation\n(\nshort-term variations in the axis of rotation\n)\nand precession\n(\nlong-term variations\n)\n.\nAs a friend of\nSamuel Molyneux\n, who was interested in measuring the annual parallax of stars, from which it would be possible to calculate the distances to the nearest stars, Bradley was invited by\nMolyneux\nin December\n1725\nto his estate at Kew, a district of London, to assist him in observing the star Gamma Draconis, specifically, attempting to determine its annual parallax.\nGamma Draconis was specifically chosen since it crosses the meridian almost overhead, thus allowing observers to ignore any problems caused by refraction of light through the earth's atmosphere. According to theory, the star would culminate at its most southerly point in December, with its point of culmination shifting northwards every day to its most northerly point in June, returning over the following six months.\nWhat was actually observed however was that after December, Gamma Draconis continued to culminate at more southerly points, reaching its most southerly point in March, rather than December, and its most northerly point in September, rather than in June. The overall change in position over the six months was about a one hundredth of a degree.\nBradley thus, from August\n1727\n, in an attempt to explain the cause of this movement, decided to observe a number of stars over the year. He found that they each displayed a similar motion.\nWhile sailing the Thames, he noticed how a vane atop the mast changed direction as the boat turned, despite the fact that the wind remained blowing in the same direction. Bradley suggested that analogously, the apparent shift in the position observed in the stars was a result of of a combination of the transmission of light at a finite speed from the star and the annual movement of the Earth around the Sun. This is what is known as the aberration of light. The letter from Bradley to\nHalley\nreferencing this phenomenon was read to the\nRoyal Society\nin January\n1729\n.\nFrom his observations, he was able to calculate the speed of light, claiming that light from the Sun took\n8\nminutes\n12\nseconds to reach the Earth\n(\ntoday, we make it\n8\nminutes\n20\nseconds\n)\n. He also concluded that the calculation of the annual parallax that he and\nMolyneux\nhad set out to discover was beyond the accuracy of the instruments available. Thus, the distance to the nearest stars must be even greater than had previously been thought.\nHe took on the added role of lecturer in experimental philosophy at Oxford in\n1729\n, lecturing in the Ashmolean Museum. For over thirty years he gave these lectures to an average audience size of more than fifty students.\nHe worked also on studying Saturn. During a time when Saturn's rings were edge-on to the Earth and thus invisible, he observed the reappearance of the rings in\n1730\n, his record of which are the only ones to have survived from that date.\nThe year\n1732\nsaw Bradley move to Oxford to occupy a house in New College Lane, to which his professorship entitled him. His aunt, widow of James Pound, stayed with him until her death in\n1737\n. Many of the astronomical instruments from Pound's house in Wansted were also moved. A notable exception was the Graham zenith sector, which remained. Bradley made frequent return visits to Wansted to use it. This is where he continued his work that led to the discovery of nutation.\nContinuing his observations at Wansted after he moved to Oxford, Bradley aimed to collect evidence he was observing of the nutation of the Earth's polar axis. By detecting and measuring this, he would be able to calculate the spheroidicity of the Earth, thus settling the dispute between Newtonians and followers of\nJacques Cassini\nabout whether the Earth was flattened or elongated at the poles.\nBradley proved his dedication to the problem by pursuing his observations, despite a major hurdle: the Earth's axis would take more than\n18\nyears to complete a nutational cycle. He worked for the necessary period, returning to Wansted each time an observation was required. This was necessary since all observations had to be made using the same instrument at the same location.\nHe had concluded his programme by\n1747\n, writing a letter that was read to the\nRoyal Society\nin February\n1748\n. In his letter, he was able to confirm the Newtonian model of the Earth, that it was flattened at the poles. This letter gives a wonderful understanding of how Bradley worked and his ways of thinking and we have made available the first part of that letter at\nTHIS LINK\n.\nBy this time, however, there was also separate observational confirmation by French expeditions to Sweden and Peru, but Bradley's work here, and his earlier work on aberration, added to the increasing evidence for a heliocentric solar system. He offered the first observational proof that the Earth revolved around the Sun. Prior to this, the lack of observational evidence of stellar parallax was what was holding back full acceptance of the Copernican solar system model, for\nGalileo\n's attempted 'proof' was seen to be fallacious. It was thus that Bradley was awarded the\nRoyal Society\n's Copley medal in\n1748\n.\nBessel\nwould go on in\n1838\nto measure annual parallax for the star\n61\nCygni, further adding to the Copernican argument.\nBradley served as Astronomer Royal from\n1742\n, the third to occupy the role, succeeding\nHalley\n.\nHe married Susannah Peach of Chalford, Gloucestershire, on\n25\nJune\n1744\n. Their daughter, also called Susannah, was born in\n1746\n. It was she who would inherit the Greenwich observations her father had made over the\n20\nyears prior to his death, the same observations, that for many reasons, were not published for over\n30\nyears after Bradley's death.\nWith his work on, and announcement of, nutation, he began to receive international recognition;\n1746\nsaw him become a member of the\nRoyal Academy of Berlin\n; in July\n1748\nhe was made a foreign associate of the\nAcadémie Royale des Sciences\nin Paris; in\n1750\n, he became a corresponding member of the\nImperial Academy of Sciences in St Petersburg\n, becoming a full member in\n1754\n; in\n1757\nwas when he was elected to become a member of the Academy of Sciences of Bologna Institute. He was also rewarded by the crown, receiving a payment of £\n1000\nto re-equip his observatory\n(\nthis was\n10\ntimes the value of his annual income\n)\n. The state also personally awarded him a pension of £\n250\nper annum\n(\nroughly £\n45\n,\n000\nin today's money\n)\n.\nIt was not until\n1798\nthat any of Bradley's observations were published. Upon his daughter Susannah's coming-of-age, she passed the observations on to a maternal uncle, the Reverend Samuel Peach, who refused to surrender them to the board of longitude upon their request. He left them to his son, John, who was also unwilling to give them up. A legal case was set up by the crown over the ownership of the documents, resulting in their presentation to the chancellor of Oxford University, Lord North, who would give them to the University on the condition that they were to be published by the Clarendon Press. They took, however,\n20\nyears to publish a first volume of the observations.\nA problem with such a delayed publication of astronomical data was that forty years late, they were not overly useful. It was not until\nWilhelm Bessel\nwas encouraged to do so that the complications and complexities created by such a lag were tackled. It took\n10\nyears of\nBessel\n's work, which began with Bradley's observations, resulting in his\nFundamenta astronomia\nⓉ\n(\nFundamental astronomy\n)\n(1818)\n, lauded as one of the most significant works on positional astronomy.\nFor Stephen Peter Rigaud's Preface to\nMiscellaneous works and correspondence of the Rev James Bradley, D.D. F.R.S.\n(\nOxford University Press, Oxford,\n1832)\n, see\nTHIS LINK\n.\nBradley's influence extended into the\n20\nth century, with three volumes of his observations being published between\n1882\nand\n1903\n. It has been suggested that with these, Bradley had laid the foundation of all modern star positions.\nHis influence however, stretched far wider than just over the tracking of the fixed stars. He was very interested in the accurate measurement of time. Bradley collected data sent to him from London and Jamaica, and, allowing for the temperature differences, concluded that the clock used for these experiments slowed by about\n2\nminutes per day when in Jamaica in comparison to when in London. This followed\nNewton\n's theory of gravity for the Earth's oblate shape. Moreover, though not documented, it is believed that Bradley, as Astronomer Royal, had a role in England's adoption of the Gregorian calendar in\n1752\n.\nHis focus on the impact of local phenomena\n(\nthose resulting from the instruments used, the conditions around the observatory and from the motions of the Earth's axis and of its orbit\n)\nallowed him, and later astronomers, to concentrate solely on the objects' characteristics. Though not alone in taking positional astronomy so seriously, he was certainly a leading authority as Astronomer Royal.\nIt was to be his poor health that would force Bradley into retirement in\n1761\n. Prior to this he had attempted an ambitious expedition. In\n1761\na rare transit of Venus was due to take place. With the intention of using observations of this phenomenon to improve the accuracy of the value of solar parallax, he chose Java and St Helena to be the two observation points, since they were sufficiently widely separated in location. Too frail to make the journeys himself, he sent his Greenwich assistant Charles Mason to Java, and the young astronomer\nNevil Maskelyne\nto St Helena. Neither expedition was successful. Mason failed to reach Java in time due to obstruction caused by the Seven Years' War, and\nMaskelyne\n's attempt suffered from poor weather.\nFollowing the death of his wife in\n1757\n, and with his own physical illness, he went to stay with his wife's family in Chalford, Gloucestershire. He died on\n13\nJuly\n1762\nfrom a chronic abdominal inflammation. Buried near his mother and wife in the churchyard of Holy Trinity church, Minchinhampton, Gloucestershire, a brass plate was fixed to an altar tomb in the churchyard. Almost\n70\nyears following his death, a plaque was erected at Kew on the base of the Kew Palace Sundial to mark where he began his observations. It reads:-\nOn This Spot\nIn\n1725\nThe Rev James Bradley\nMade the First Observations\nWhich led to the Great Discoveries\nThe Aberration of Light and\nThe Nutation of the Earth's Axis\nThe Telescope which he used\nHad been erected by Sam. Molyneux Esq.\nIn a House which afterwards became\nA Royal Residence\nAnd was Taken Down in\n1808\n.\nTo Perpetuate the Memory of\nSo Important a Station\nThis Dial was Placed on it in\n1852\nBy Command of\nHis Most Gracious Majesty\nKing William the Fourth.\nThough he published relatively little during his lifetime, his papers on aberration and nutation were key for their discoveries and also for the development of the notion of precision in astronomy.\nAccording to the historian of astronomy, mathematical astronomer and director of the Paris Observatory\nJean Baptist Joseph Delambre\n, in his\n1821\nhistory of astronomy in the\n18\nth century:-\nIt is to\n[\nthe discovery of aberration and nutation ... that we owe the exactness of modern astronomy. ... This double service assures to\n[\nBradley\n]\nthe most distinguished place\n(\nafter\nHipparchus\nand\nKepler\n)\nabove the greatest astronomers of all ages in all countries.\nHighly regarded during his lifetime, and recognised by some of the greats of the day, James Bradley was highly influential in the advancement of astronomical thinking.\nHalley\nhad quickly recognised his talent, and\nNewton\nhad described him as the best astronomer in Europe.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}