{
  "nome_completo": "James Ireland Craig",
  "nome_curto": "James Craig",
  "ano_nascimento": "1868",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Craig_James/",
  "lugar_nascimento": "Buckhaven, Fife, Scotland",
  "lugar_morte": "Cairo, Egypt",
  "biografia": "James Craig\n's father was Captain T M Craig, a pioneer of the development of Borneo. His mother was  Agnes Craig\n(\nborn Buckhaven, Fife about\n1841)\n. He had a younger brother Thomas\n(\nborn about\n1871)\nwho went on to become a chemist.\nJames attended Daniel Stewart's College in Edinburgh, being dux of the school in\n1885\n. He then was an undergraduate at the University of Edinburgh, where he was awarded an M.A., then went to Emmanuel College, Cambridge, where he was a\nWrangler\nin the Mathematical Tripos. In\n1893\nhe was appointed as a Master at Eton, then as a master in Winchester two years later. In\n1896\nhe entered the services of the Egyptian Government. He married Isabella Wilson in\n1897\n.\nHe was employed at the Ministry of Food in London during the last phase of World War I, then he became Food Controller in\n1918\n-\n20\nto the Upper Silesia Plebiscite Commission. He served with the Egyptian Ministry of Finance as Controller General\n1925\n-\n8\n, then as Financial Secretary to the Egyptian Census\n1928\n-\n34\n. He was  UK Government Commissioner of Customs\n1934\n-\n47\n.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n17\nFebruary\n1908\nhaving been proposed by\nGeorge Chrystal\n, William J Macdonald, John Alison, and John Brown Clark. He was a member of the International Statistical Institute and of the Hungarian Statistical Institute. He published\nGeneral Theory of Map Projections\n. In\n1909\nhe invented the Craig retroazimuthal map projection. It is a cylindrical projection preserving the direction from any place to other predetermined place. It is sometimes known as the Mecca projection because Craig invented it while working in Egypt to help Muslims find their\nqibla\n.\nCraig projection centred on Mecca\nCraig was killed when an Egyptian mob set fire to the Turf Club in Cairo.\nHis obituary in the Edinburgh Mathematical Notes is at\nTHIS LINK",
  "math_areas": [
    "Statistics"
  ]
}