{
  "nome_completo": "James Alexander Macdonald",
  "nome_curto": "James Macdonald",
  "ano_nascimento": "1868",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macdonald_James/",
  "lugar_nascimento": "Portsoy, Scotland",
  "lugar_morte": "Peebles, Scotland",
  "biografia": "James Macdonald\nwas educated at Duncan Place School in Leith, spending ten years there from\n1874\nto\n1884\n. At this time his address was\n8\nNoble Place, Leith. He first matriculated at Edinburgh University in October\n1884\n. He graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1895\n, obtaining a B.Sc.\n(\nPure\n)\nin the same year after taking B.Sc. courses in Mathematics, Natural Philosophy, Botany, Zoology, including Comparative Anatomy, Chemistry and Practical Chemistry.\nIt is not entirely clear\n[\nto the writers of this biography\n]\nwhy he graduated eleven years after first matriculating, but given that he became a rector and was made a fellow of the\nRoyal Society of Edinburgh\ntwo years after graduating, it is reasonable to assume that he must have taught in schools during these eleven years. Certainly the record of courses he took at Edinburgh University contains a break between session\n1887\n-\n88\nand session\n1893\n-\n94\nand there is no record of him attending any courses in the five intervening sessions. At Edinburgh he was awarded the Fergusson Scholarship in Mathematics, the Neil Arnott Scholarship in Physics and the Maclaren Scholarship in Mathematics and Natural Philosophy.\nMacdonald was the first Rector of Leith Academy, appointed to the role in\n1897\n. In December\n1899\nhe submitted his thesis\nCertain Properties of the \"C\" Discriminant, a Treatment of the subject from a Kinematical and Analytical Point of View\nfor the degree of D.Sc. at the University of Edinburgh.\nChrystal\nand\nGibson\nexamined the thesis,\nChrystal\nas Internal Examiner and\nGibson\nfrom Glasgow as External Examiner, and rejected it in January\n1900\n. Macdonald did not try again for this degree. In\n1901\nhe became one of His Majesty's Inspectors of Schools. He lived first in Kelvinside, Glasgow, then from\n1903\nin Dingwall. In\n1910\nhe moved to Stewarton, Kilmacolm, and then in the following year to Inverness. In\n1921\nhe became Chief Inspector of Schools for the Highland Division. He retired in\n1930\nand went to live at Rothes, Frankscroft, Peebles.\nIn\n1908\nMacdonald's son, also named James Alexander Macdonald, was born in Dingwall, Ross-shire. This son went on to become a botanist and was Professor of Botany at the University of St Andrews from\n1961\nto\n1977\n. For several years around\n1970\n, he was my\n[\nEFR\n]\ngolfing partner playing for the University of St Andrews staff golf team.\nA member of the\nEdinburgh Mathematical Society\n, Macdonald joined in February\n1896\nwhile teaching in Leith but before his appointment as Headmaster there. He remained in the Society throughout his life. He was elected to the\nRoyal Society of Edinburgh\non\n7\nJune\n1897\n, his proposers being\nGeorge Chrystal\n,\nPeter Guthrie Tait\n, Alexander Crum Brown,\nCargill Gilston Knott\n.\nAn obituary, written anonymously, appears in the\nProceedings\nof the\nRoyal Society of Edinburgh\n, Volume\n57\n(1936\n-\n37)\n,\n436\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nThe Scotsman\npublished an obituary of Macdonald in June\n1937\n:-\nTHE LATE MR JAMES A MACDONALD\nFormer Chief Inspector of Schools in Highlands\nThe death has occurred, at his home at Rothes, Peebles, of Mr James Alexander Macdonald, a well-known figure in Scottish education circles, and formerly His Majesty's Chief Inspector of Schools for the Highland Division.\nMr Macdonald was educated at Edinburgh University, where he graduated with first class honours in Mathematics and Natural Philosophy, and obtained the Fergusson Scholarship in Mathematics, the Neil Arnott Scholarship in Physics and the Maclaren Scholarship in Mathematics and Natural Philosophy. In\n1897\nhe was appointed the first Rector of Leith Academy; in\n1901\nhe was appointed one of His Majesty's Inspectors of Schools; and in\n1921\nwas promoted Chief Inspector of Schools for the Highland Division. He was a native of Portsoy, and took up residence in Peebles in\n1930\n, following his retirement the previous year. He was a keen Churchman and was an elder of St Andrew's Church, Peebles. Mr Macdonald was in his\n71\nst\nyear.",
  "math_areas": []
}