{
  "nome_completo": "James Ivory",
  "nome_curto": "James Ivory",
  "ano_nascimento": "1765",
  "ano_morte": "1842",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ivory/",
  "lugar_nascimento": "Dundee, Scotland",
  "lugar_morte": "London, England",
  "biografia": "James Ivory\n's father was a watchmaker, also named James Ivory, who was an apprentice in London and there married James' mother Jane Brown on\n27\nJanuary\n1761\n. Details of this recent research concerning James' mother are contained in\n[\n4\n]\n. Certainly by the end of\n1762\nJames senior and his wife Jane were living in Dundee where James junior was born. Jane must have died soon after the birth\n(\nalthough no records have come to light\n)\nsince James Ivory senior married Margaret Cook on\n16\nSeptember\n1768\n. James junior was brought up by his father and step-mother who together had three sons and two daughters.\nJames junior, the subject of this biography, was educated at Dundee Academy, then at the University of St Andrews, completing his studies at Edinburgh University. He entered the University of St Andrews at the age of fourteen but at this time the Scottish Universities competed with the schools for the most able pupils, so it is not surprising that he entered university at such a young age. He spent six years in study at St Andrews taking courses so that he might become a Church of Scotland minister. It appears that his step-mother was keen for him to enter the Church since his health was poor and she felt that he would thrive in a profession requiring no physical abilities but one in which he could use of his mental abilities. He excelled in mathematics at St Andrews where he and his fellow student and friend\nJohn Leslie\nwere taught by\nJohn West\n. His time at Edinburgh University was supposed to end in him completing his theological studies leading to his ordination, but he changed his plans after enjoying mathematics, physics and philosophy courses in Edinburgh taught by\nJohn Playfair\n,\nDugald Stewart\nand others.\nAfter his university education Ivory taught mathematics in Dundee Academy. However he did not stay long in the teaching profession and, after studying flax spinning in Darlington, he started up his own flax spinning company at Douglastown near Forfar\n(\nnorth of Dundee\n)\nin\n1789\n. He never made much money from his business, but he struggled on for\n14\nyears until the mill went into receivership. During these years he had spent much of his spare time in studying the works of\nLagrange\nand\nLaplace\non his own. In\n1804\n, strongly supported by\nPlayfair\n, he was appointed professor of mathematics at the Royal Military College, Great Marlow\n(\nwhich became Sandhurst in\n1812)\n, where he joined\nWilliam Wallace\nwho had been appointed in the previous year. It would appear that from the time of this appointment he suffered from depression. He wrote in a letter\n(\nsee for example\n[\n5\n]\n)\n:-\n... on my coming here I was long subject to low spirits, and I put off from day to day what I would do any day, till at last the putting off became habitual and I could not prevail on myself to sit down and write.\nBy\n1815\nIvory's mental state seems to have worsened and he tried to resign his post but was persuaded to withdraw his resignation. In\n1817\nhe suffered a serious breakdown and, for the rest of his life, he lived reclusively in London.\nIvory was elected a Fellow of the\nRoyal Society\nin\n1815\n. His difficult personality led him to quarrel with many of the British scientific establishment. Nevertheless, the\nRoyal Society\nof London awarded him the Copley Medal in\n1814\nfor his work on the orbits of comets, and the Royal Medal twice in\n1826\nand\n1839\n. Between these dates, in\n1838\n, Ivory gave the Bakerian lecture to the\nRoyal Society\n, entitled\nOn the theory of astronomical refractions\n. He was also honoured by many foreign scientific societies such as the\nGöttingen Academy\nin\n1814\n, the\nBerlin Academy\nin\n1826\n, the\nAcademy of Sciences\nin Paris in\n1828\n, the Academy of Modena in\n1829\n, the\nRoyal Society of Edinburgh\nin\n1935\n, and the\nIrish Academy\nin\n1839\n. He received a knighthood in\n1831\nwhich gave him a Civil List pension, and an honorary degree from the University of St Andrews in\n1839\n.\nIvory and\nWallace\nwere early supporters of the work of the French analysts, especially\nLagrange\nand\nLaplace\n. Ivory's critical commentary of\nLaplace\n's\nMécanique céleste\nwas praised by\nLaplace\n. Ivory wrote several articles for encyclopaedias, including the influential\nEquations\nin\nEncyclopaedia Britannica\n. His articles on\nAttraction\nand\nCapillary action\nwere also major contributions to\nEncyclopaedia Britannica\n. These latter two articles concerned his main research area which involved the applications of mathematics. Most notably he made major contributions to the gravitational attraction of ellipsoids, the shape of self-gravitating rotating fluid bodies, the orbits of comets, and atmospheric\nrefraction\n. His work on the ellipsoidal equilibrium configuration of self-gravitating fluids was an extension of that of\nLaplace\n, and it influenced the achievements of\nJacobi\nand\nLiouville\nwhich followed.\nWe mentioned above that Ivory, because of his mental problems, tended to quarrel with his fellow mathematicians. His relations with\nWallace\ndeteriorated with arguments over Ivory's\nAttraction\narticle to\nEncyclopaedia Britannica\n. Ivory's article on\nCapillary action\nfor the same publication led to an argument with\nThomas Young\n. Many other cases were simply caused by Ivory suffering from a quite incorrect belief that he was being persecuted by others. In fact he never joined the\nRoyal Astronomical Society\n, despite his interests in astronomy, since he believed that members of that Society were systematically working against him. As\nDe Morgan\nwrote that Ivory was of\n(\nsee\n[\n4\n]\n)\n:-\n... thoroughly sound judgement in every other respect seemed to be under a complete chain of delusions about the conduct of others to himself. But the paradox is this: - I never could learn that Ivory, passing his life under the impression that secret and unprovoked enemies were at work upon his character, ever originated a charge, imputed a bad motive, or allowed himself an uncourteous expression.",
  "math_areas": []
}