{
  "nome_completo": "James Taylor",
  "nome_curto": "James Taylor",
  "ano_nascimento": "1851",
  "ano_morte": "1910",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taylor_James/",
  "lugar_nascimento": "Keith, Scotland",
  "lugar_morte": "Institution Place, Dollar, Scotland",
  "biografia": "James Taylor\nwas born in Keith which is a small town about\n70\nkm north west of Aberdeen. His father was Robert Taylor. He was educated at Keith Grammar School then sat the Aberdeen University Bursary Competition. This involved compulsory papers on Mathematics, Latin and English. The two compulsory mathematics papers comprised one on Arithmetic and one on Euclid. He also elected to take the two special Mathematics papers, one of which was on\nEuclid\nand one on Algebra. After winning a bursary he studied at Aberdeen University, graduating in\n1874\nwith First Class Honours in Mathematics.\nAfter graduating, Taylor was appointed Mathematics Master at New College, Southsea, Portsmouth. He remained there only for one year, for in\n1875\nhe returned to Scotland when he was appointed to the position of Mathematics Master at Morrison's Academy, an independent school in Crieff. He spent three successful years teaching at Morrison's before being appointed as Mathematics Master at Dollar Institution in\n1878\n.\nJames Taylor married Isabella M Ogilvie\n(\nborn in Fochabers, Morayshire about\n1859)\n. They had several children: William J Taylor, Margaret E Taylor, Robert C Taylor, George C Taylor.\nIn addition to his role as a teacher of mathematics, Taylor took in boys as boarders. Every year he advertised in the national press. Here is a typical such advertisement:-\nDOLLAR INSTITUTION.- James Taylor, M.A.\n(\nHonours\n)\n, Mathematical Master, receives Boys as Boarders, and personally superintends their Home Lessons. Terms, &c. on application.\nROSEMOUNT, Dollar.\nThe article\n[\n1\n]\ncontains two parts. The first is an appreciation of his contributions to the school written by a colleague, the second is an appreciation by a former pupil and is given at\nTHIS LINK\n.\nHere is the appreciation written by a colleague:-\nMr James Taylor, M.A. - familiarly and affectionately known to the Dollar boys as \"Jimmy\" - was a native of Keith, Aberdeenshire, and was educated in his boyhood  at the grammar school there. In his eighteenth year he entered, as a bursar, Aberdeen University, where he graduated in\n1874\n, with first-class honours in Mathematics. This distinction gained for him the Mathematical Mastership of New College, Southsea, Portsmouth, but his stay there was short, as he was chosen, from a large number of candidates, to a similar position in Morison's Academy, Crieff, where he taught with much acceptance until\n1878\n, the year of his appointment to Dollar.\nHis work here was the work of his life; and his memory cannot fail of exciting the warmest sentiments of gratitude among those who were his pupils while the smallest regard for learning subsists among them; and, by those who had the pleasure of his friendship, his name will always be mentioned with honour. From the first he was a favourite with his pupils, and he retained the respect and affection of the members of all his various classes throughout the whole of his thirty-two years as their teacher.\nA former pupil writes: \"The pains he took to make the veriest duffer see through his problems was very great. He was tireless in this respect, and many pupils have to thank him for the grounding they got under his excellent tuition.\"\nAmong his colleagues he was full of geniality, took a frank part in educational controversy, but may have over-rated the value of the study of Mathematics and Science as compared with that of Classics and Modern Languages.\nWhen Mr Taylor took pen in hand, he showed that he possessed the gift of lucid expression, as is illustrated in the series of articles on \"The Transit of Venus\" in\n1882\n, which he contributed to The Dollar Magazine of that year. Other articles of his prove that he had a firm grasp of the subject he was handling, and he was able to unfold his meaning clearly, fully, ad distinctly.\nShort and fragmentary is the account I have been able to give of one who may be said to have died at his post, doing his duty to the last. I wish, particularly in the name of those most nearly related to him, to off all his old pupils grateful acknowledgement of their loyalty, affection, and generous appreciation of him as their teacher and friend.\nThe\nEdinburgh Mathematical Society\nwas founded in February\n1883\nand Taylor was present at the first meeting, becoming a founder member. He remained a member of the Society until around\n1898\n. Somewhat confusingly another James Taylor, who was a Mathematical Master at  Edinburgh Academy, joined the Society in November\n1886\nso for around\n12\nyears the Society had the rather confusing situation of having two members with precisely the same name\n(\nneither appears to have had a middle name\n)\n.\nTaylor died on Monday\n29\nJanuary\n1910\nat Institution Place, Dollar. His funeral took place on Wednesday\n2\nFebruary at Dollar Cemetery.",
  "math_areas": [
    "Analysis",
    "Number Theory"
  ]
}