{
  "nome_completo": "Jan Arnoldus Schouten",
  "nome_curto": "Jan A Schouten",
  "ano_nascimento": "1883",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schouten/",
  "lugar_nascimento": "Nieuwer Amstel (now part of Amsterdam), Netherlands",
  "lugar_morte": "Epe, The Netherlands",
  "biografia": "Jan A Schouten\n's mother was Hulda Ludowica Elwira Deetz who was the daughter of Friedrich Deetz, the director of the hospital in Wezel, and Emilie Friederike Klonne. Hulda, born in Wezel on\n9\nFebruary\n1847\n, married Jan Schouten in\n1882\n. Jan, born in Dordrecht on\n14\nSeptember\n1845\n, was from a leading family of shipbuilders but had trained as a lawyer and was an advocate and attorney. Jan and Hulda lived first in Overtoom but moved to Nieuwer Amstel\n(\nnow part of Amsterdam\n)\nwhere their son, Jan Arnoldus, the subject of this biography, was born. The family moved again in\n1886\n, this time moving to Nijmegen where Jan Arnoldus was brought up. We note at this point that Jan Schouten died in Nijmegen on\n10\nJuly\n1900\nat age\n54\nwhile Hulda Schouten lived to age\n86\ndying in Nijmegen on\n20\nAugust\n1933\n.\nJan Arnoldus attended elementary school, then high school, in Nijmegen. Jan and Hulda's marriage was not a happy one and they separated with Jan Arnoldus living with his mother to whom he was deeply attached. He learnt Dutch and German, becoming fluent in both languages, but his native language was German. He excelled at mathematics at high school and, not having qualifications to enter university, as a consequence entered the Military Academy in Breda. At this time students required a pass in a classical language in their final examination to enter university and Schouten had not studied any classical language. However, in\n1901\nhe entered the Technische Hogeschool in Delft. He studied electrical engineering at the Technische Hogeschool and then for several years he was an electrical engineer. After a year of practical experience at Siemens in Berlin he graduated in\n1908\n. He spent his holidays with his mother in Nijmegen where he was a member of the local rowing and sailing club. Here he met Maria Margaretha Backer, who had been a fellow student with Schouten at the high school, but by this time was a law student in Leiden. Maria had been born in Nijmegen on\n1\nMay\n1887\n; her parents were Jean Paul Frederic Backer, a cigar manufacturer, and Dorothea Cornelia Fik. Jan Arnoldus and Maria married on\n21\nJanuary\n1909\n; they had one son Jan Frederik and two daughters Hilde Margaretha Erica and Petronella Cornelia Maria.\nSoon after the award of his electrical engineering degree from Delft, Schouten became an inspector at the Department of Local Electricity Works in Rotterdam. He made many trips abroad and was a contributor to the electrification of Rotterdam. However he came from a family with substantial amounts of money and when he inherited money in\n1912\n, still having a deep love for mathematics, he gave up his electrical engineering job and went to Delft University to study mathematics. He was encouraged by Johan Antony Barrau\n(1874\n-\n1953)\nwho had been a student of\nDiederik Johannes Korteweg\nand received a doctorate from the University of Amsterdam in\n1907\n. At first Barrau advised Schouten but, after he left Delft for Groningen in\n1913\nto become Schoute's successor as professor of geometry, Jacob Cardinaal became Schouten's advisor. Jacob Cardinaal\n(1848\n-\n1922)\nhad been a student of Jan de Vries and, in September\n1893\n, had been appointed professor at the Polytechnic University in Delft. Cardinaal wrote the first Dutch book on kinematics in\n1914\n. Schouten's doctoral thesis\nGrundlagen der Vektor- und Affinoranalysis\nⓉ\n(\nBasics of vector and affine analysis\n)\n, presented in\n1914\n, was on\ntensor\nanalysis, a topic he worked on all his life. That same year he became professor of mathematics at the Polytechnic University in Delft and held the post for nearly\n30\nyears. He was rector of the University for the year\n1938\n-\n39\n.\nDirk Struik\nbecame Schouten's assistant in\n1917\n. He said\n[\n7\n]\n:-\nProfessor Schouten at the Technical University in Delft was looking for an assistant. Through Ehrenfest, he was told that this fellow\nStruik\nmight be the right person. And he was. In\n1917\n, I accepted an assistantship at Delft and became Schouten's assistant for seven years, from\n1917\nto\n1924\n. There I learned my tensors. Schouten was, as were so many mathematicians at that time, deeply interested in the theory of relativity. I was never so much interested in quantum mechanics as in the theory of relativity, because the Delft is vectors and tensor, and so those things had become very familiar. Schouten was working on his form of what we now call tensor analysis. He called it afinial analysis. By and by, he introduced me to it. Over seven years, I became first, of course, the assistant, but later also the friend and collaborator of Schouten. And we published a good deal.\nAlbert Nijenhuis, who was a student of Schouten's submitting his thesis in\n1952\n, summarises Schouten's life in the following words\n[\n1\n]\n:-\nA descendant of a prominent family of shipbuilders, Schouten grew up in comfortable surroundings. He became not only one of the founders of the \"Ricci calculus\" but also an efficient organiser\n(\nhe was a founder of the Mathematical Centre at Amsterdam in\n1946)\nand an astute investor. A meticulous lecturer and painfully accurate author, he instilled the same standards in his pupils.\nOf course, working on tensor analysis put Schouten in the exciting area of developments associated with the theory of relativity. He produced\n180\npapers and\n6\nbooks on tensor analysis,  applying tensor analysis to\nLie groups\n, general relativity, unified field theory, and\ndifferential equations\n. Influenced by\nWeyl\nand\nEddington\n, Schouten investigated affine, projective and\nconformal mappings\n.\nKlein\n's Erlanger Programm of\n1872\nlooked at geometry as properties invariant under the action of a group. This approach had a large influence on Schouten's approach to his topic.\nIn\n1915\nhe discovered the\nLevi-Civita\nconnection in Riemannian\nmanifolds\nindependently of\nLevi-Civita\nbut since his paper only appeared in\n1919\n, a year later than\nLevi-Civita\n's, he received no credit. This was despite arguing his case for priority explaining that, because of the problems caused by World War I he had not had access to journals to read the current papers.\nL E J Brouwer\ndid not support Schouten and relations between the two were poor for a number of years until Weitzenböck got them to patch up their differences in\n1929\n. Up to the point when he saw\nGregorio Ricci-Curbastro\n's and\nTulio Levi-Civita\n's work, Schouten's notation had been, by his own admission, difficult to understand but, once he saw their notation he accepted it immediately as simpler than his own. He published a monograph\nOn the Determination of the Principle Laws of Statistical Astronomy\nin\n1918\nand his classic work on the Ricci calculus\nDer Ricci-Kalkül : Eine Einführung in die neueren Methoden und Probleme der mehrdimensionalen Differentialgeometrie\nⓉ\n(\nThe Ricci calculus: an Introduction to the newer methods and problems of multi-dimensional differential geometry\n)\nin\n1924\n. It is interesting to note that despite publishing a greatly expanded and updated version in\n1954\n(\nwhich we discuss below\n)\na corrected reprinting of the original\n1924\nedition was published in\n1978\n.\nSchouten certainly did not work in isolation but collaborated and corresponded with other leading workers in the area. He interacted with\nÉlie Cartan\n,\nLudwig Berwald\n,\nOswald Veblen\n,\nAlexander Friedmann\n,\nArthur Eddington\nand\nWolfgang Pauli\nwriting joint papers with some of them. For example in\n1924\nhe published\nÜber die Geometrie der halb-symmetrischen Übertragungen\nⓉ\n(\nOn the geometry of the semi-symmetrical transmissions\n)\njointly with\nAlexander Friedmann\n, and in\n1926\nhe published two papers  written jointly with\nÉlie Cartan\n:\nOn Riemaniann geometries admitting an absolute parallelism\n, and\nOn the Geometry of the Group-manifold of Simple and Semi-simple Groups\n. He also acknowledged the ideas that came about through discussions with others, for example writing in his paper\nÜber die Einordnung der Affingeometrie in die Theorie der höheren Übertragungen\nⓉ\n(\nOn the classification of affine geometry in the theory of higher transfers\n)\n(1923)\n(\nsee for example\n[\n2\n]\n)\n:-\nI owe thanks to Mr\nL Berwald\nin Prague, with whom I had an intensive exchange of ideas from September\n1921\n, and who was so friendly as to give me his manuscripts before they went into print.\nOn a trip to the United States in\n1931\nhe discussed his current work on spinors with\nVeblen\n. He attended the international conference on\ndifferential geometry\norganised by\nBenjamin Fedorovich Kagan\nwhich took place at Moscow University in\n1934\n. In the following year the first of the two volumes of a monograph written in collaboration with\nDirk Struik\n,\nEinführung in die Neuen Methoden der Differentialgeometrie\nⓉ\n(\nIntroduction to new methods of differential geometry\n)\n, appeared. The second volume was published three years later in\n1938\n. Although both authors appear on both volumes\n(\neach dedicated to\nTullio Levi-Civita\n)\n, the first volume is largely the work of Schouten while the second is largely the work of\nStruik\n.\nSchouten, in collaboration with W van der Kulk, published\nPfaff's Problem and Its Generalizations\nin\n1949\n.\nDirk Struik\nwrites:-\nThis is a complete exposition of the classical theory of the Pfaffian equation and of the present results in the theory of systems of Pfaffian equations, to which the authors themselves have substantially contributed. The theme is presented in tensor language, by which a great unity of form and content is achieved. It embraces both the older theories of\nJacobi\nand Mayer and the newer theories of\nCartan\n,\nKähler\nand the authors.\nIn\n1951\nhe published\nTensor Analysis for Physicists\nwhich was reviewed by N Coburn who begins his review:-\nThis text contains an excellent treatment of tensor analysis and applications to linear elasticity theory, dynamics, relativity, and quantum mechanics. Though the text does not assume a prior acquaintanceship with tensor theory, it is desirable that the reader possess some background in the subject. For such a reader as well as for the specialist, this text will furnish a wealth of useful and unified information.\nClive Kilmister\n, reviewing the same work, writes:-\nThe name gives little idea of the exhaustive and exact treatment, including such things as a complete discussion of the various groups involved and the use of non-holonomic co-ordinate systems. Rather it is meant to imply the author's attempt\n(\nlargely successful\n)\nto give the fruits of his long experience of lecturing in the form of physical pictures of the concepts used at each stage.\nWe mentioned above Schouten's\nRicci-calculus. An introduction to tensor analysis and its geometrical applications\n(1954)\n.\nGeoffrey Walker\nwrites:-\nSince the publication of the author's 'Der Ricci-Kalkül'\nⓉ\n(\nThe Ricci calculus\n)\n[1924]\nthe subject of tensor calculus as applied to differential geometry has grown very considerably, and the present edition is more than a mere translation of the first. The author has played an active part in the development of the subject and results originally published in papers have also appeared in books written by the author in collaboration with others. The greater part of the work now appears however in its proper setting, and for the first time we have a comprehensive account of the work to date in certain well-defined fields.\nLet us return to look at the later part of Schouten's career. In\n1943\n, perhaps due to the pressures imposed by World War II, he became ill and underwent severe problems. Albert Nijenhuis wrote:-\nIn\n1943\nSchouten resigned the post, divorced his wife and remarried\n[\nto Hilda Bijlsma\n]\n. From then on, he lived in semiseclusion at Epe.\nFrom\n1948\nuntil\n1953\nSchouten was professor of mathematics at the University of Amsterdam but he did not teach. He was a co-founder of the Mathematical Research Centre at Amsterdam in\n1946\nand was its director from\n1950\nto\n1955\n. Schouten was president of the\n1954\nInternational Congress of Mathematicians at Amsterdam.\nWe end this biography by examining Schouten's role in the journal\nCompositio Mathematica\nbecause it sheds considerable light on his personality. The story of\nCompositio Mathematica\n's difficulties are told in the fascinating paper\n[\n11\n]\nfrom which we take most of the information described below. The journal had been run by\nL E J Brouwer\nand published by the House of Noordhoff, Groningen, but had to cease production in\n1940\nbecause of World War II. When it was proposed that publication restart in\n1945\n, Noordhoff wanted to extend the editorial board and reduce\nBrouwer\n's role\n[\n11\n]\n:-\nIn order to get the journal under way again, Noordhoff and some mathematical colleagues called in the help of Schouten, who was the Dutch mathematician following\nBrouwer\nin seniority. Schouten's reputation as a geometer was beyond question, and he was considered one of the leading Dutch mathematicians. He had in\n1943\nresigned from his Delft chair, and withdrawn himself to a quiet part of the country, but his influence was still considerable and Noordhoff must have seen in him a valuable ally in the attempt to edge out\nBrouwer\n. Although\nBrouwer\nand Schouten had had their differences in the early\n1920\ns\n(\npatched up in\n1929\nafter the mediation of Weitzenböck\n)\n, animosity was certainly not the motivation of Schouten to take Noordhoff's side. Schouten was one of the editors of 'Compositio' of the first hour; it was probably a sincere wish to restore 'Compositio' to its old glory, that made him an actor in the 'Compositio' affair.\nSchouten wanted to keep\nBrouwer\ninvolved with\nCompositio Mathematica\nbut only as one of several editors rather than having overall control. His negotiations with\nBrouwer\nwere not successful however\n[\n11\n]\n:-\nUnfortunately Schouten did not possess the tact needed to handle a mercurial person like\nBrouwer\n. His letters, obviously well-meant, were of the half-patronizing, half-schoolmastering kind that goes against the grain.\nHaving failed to persuade\nBrouwer\nto follow the route he favoured, Schouten tried to convince other members of the Committee of Administration, most of whom sided with\nBrouwer\n, that he was right. He sent a letter to the members:-\nApart from a recounting of the events, the letter contained a list of refutations of\nBrouwer\n's claims or suspicions. Some of Schouten's arguments and claims had a degree of plausibility, but if they contained some truth, certainly not the whole truth. In particular his protestation that he did not attempt to remove\nBrouwer\nseems a bit lame ...\nIt is clear that Schouten's motives were honourable and he wanted to do the best for\nBrouwer\nand the journal. However, like many others he found\nBrouwer\ndifficult to deal with. Taking the initiative he went ahead with proposals to restart the journal without\nBrouwer\n's knowledge in late\n1949\n. His proposals gave\nBrouwer\na position as \"honorary president\" but, when\nBrouwer\nfound out what was going on, threats of court action from\nBrouwer\nfollowed. There are many more twists to the story involving many mathematicians. These are detailed in\n[\n11\n]\n(\nwhich we strongly recommend to the reader\n)\nbut in the end Schouten's scheme triumphed and\nBrouwer\nlost out never accepting the honorary role that was offered.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Statistics",
    "Topology"
  ]
}