{
  "nome_completo": "Jean Picard",
  "nome_curto": "Jean Picard",
  "ano_nascimento": "1620",
  "ano_morte": "1682",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Picard_Jean/",
  "lugar_nascimento": "La Flèche, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean Picard\nwas born in La Flèche, a town on the banks of the Loire. Nothing was known about his family and early life until the research of Olmsted presented in\n[\n8\n]\n. The details we give about Picard's family and early life are taken from this work. Jean Picard's father, also called Jean Picard, was a bookseller in La Flèche while his mother, Marie Rezé, came originally from Le Mans. Jean, the subject of this biography, was one of a fairly large family of which we know details of two younger children; René born in\n1623\nand Charlotte born in\n1625\n.\nJean studied at the Jesuit College at La Flèche. The castle in La Flèche, which had been built by the grandparents of Henry IV, was given by him to the Jesuits in\n1603\nto found a College. It was to be called the Collège Royal Henry-Le-Grand and was given instructions \"to select and train the best minds of the time\". One of the most famous students at the College in the years immediately after its foundation was René Descartes. By the time Picard studied there, the College had the reputation of being one of the best educational establishments in France\n[\n4\n]\n:-\nIt had more than a thousand students in attendance - some as day boys\n(\npresumably Picard's status\n)\nand others as borders - and because of its size, provided as comprehensive an education as could be offered by the Jesuit Order. It must remain a matter of conjecture as to how far Picard's studies were interrupted by the civil unrest which was so prevalent in that part of France in the\n1630\ns and\n1640\ns; and the Jesuit College itself was a highly volatile institution as the breakdown of social order affected the conduct of the students too. There were several problems of indiscipline in the late\n1630\ns and early\n1640\ns\n(\nthe time of the revolt of the Nu-Pieds\n)\n.\nPicard left the Jesuit College at La Flèche around\n1644\nand went to live in Paris.\nPierre Gassendi\nwas appointed as Professor of Mathematics at the Collège Royale in\n1645\nand it is likely that Picard attended his lectures there. At any rate Picard became a disciple of\nGassendi\naround this time and helped him with observations of a solar eclipse on\n21\nAugust\n1645\n. The two would remain in contact from that time on until\nGassendi\n's death in\n1655\n; for example there are records of Picard assisting\nGassendi\nin observations of lunar eclipses in\n1646\nand\n1647\n. He was very much the assistant for these observations, for we know that his responsibility was setting up the equipment and using it under\nGassendi\n's directions. There are a number of puzzles which, despite Olmsted's research, still remain about Picard's life and one should be mentioned at this point. He had gone from the Jesuit College at La Flèche, where he would have learnt some mathematics but not a great deal, to Paris where very soon after he was knowledgeable enough to be an assistant to the leading scientist\nGassendi\n. There is no evidence that he attended any advanced mathematics or astronomy lectures, so it is a reasonable guess to assume that he was largely self-educated in these topics. The fact that his father was a bookseller could be relevant here, for it would have given Picard access to advanced texts which he could have studied on his own.\nWhat is also unclear is how Picard was supporting himself during these years in Paris. Other than the few records of his work with\nGassendi\n, there is no other evidence of his astronomical researches\n(\nor any other for that matter\n)\n. Certainly any work with\nGassendi\nended in\n1648\nfor in that year\nGassendi\nleft Paris and went to Provence for health reasons. In\n1655\nPicard became professor of astronomy at the Collège de France in Paris, following the death of\nGassendi\nin October of that year, but not on the strength of any published work for none had appeared. By this stage he had gained an outstanding reputation and\nHuygens\n, who made his first visit to Paris in\n1655\n, would seek him out to discuss research topics. Picard became a member of the\nAcadémie Royale des Sciences\nin\n1666\n, just after its foundation, and from this time on devoted himself to working for the Académie. Again it is worth noting that he had published nothing before his election to the Academy.\nThere is another puzzle that we need to examine at this point. In his later writings he referred to himself as the 'Abbé of Rillé.' Certainly there is a town of Rillé is in Anjou, not that far from La Flèche, where Picard was born, and it has been assumed that this was where he had worked as a priest and prior. If this is so, then when did he train for the priesthood, and at what point in his life did he actively fill the role of Abbé of Rillé? Sturdy, like a number of other historians, casts doubt on whether Rillé is the place in Anjou, and also suggests\n[\n4\n]\n:-\n... he may simply have been an abbé commendataire i.e. a layman who drew that revenues of a benefice.\nThis would also have given Picard an income and explain other puzzles about Picard's life. Let us now look at his work for the\nAcademy of Sciences\n.\nPicard devised a micrometer to measure the diameters of celestial objects such as the Sun, Moon and planets. In\n1667\nhe added a telescopic sights to the quadrant making it much more useful in observations. Albert van Helden writes\n[\n11\n]\n:-\nThe micrometer and telescopic sights were not Picard's ideas; for these we must go to others - William Gascoigne,\nChristiaan Huygens\n, Adrien Auzout, and\nPierre Petit\n. Jean Picard was a shy and modest abbot who took their innovations and applied them systematically to astronomy, geodesy, and levelling. Picard's passion was precision, and in this area he was unsurpassed; not even\nJohn Flamsteed\ncould match his accuracy. Picard was a tireless worker, often away in the provinces or abroad on some important project while others were in the limelight in Paris.\nPicard greatly increased the accuracy of measurements of the Earth, using\nSnell\n's method of triangulation. He measured the length of the arc of the meridian; the measurements appear in\nMesure de la Terre\nⓉ\n(\nMeasuring the Earth\n)\n(1671)\n. He began by accurately measuring his baseline from Villejuif to Juvisy-sur-Orge then, using thirteen triangles, measured by triangulation one degree of latitude along the Paris Meridian from Malvoisine, in the southern suburbs of Paris, to the clock-tower of Sourdon near Amiens. Finally he measured the altitudes of stars. All the instruments he used to carry out this work were fitted with telescopic sights which gave him values correct to\n10\nseconds of arc\n(\nTycho Brahe\nhad only attained an accuracy of\n4\nminutes of arc\n)\nand he produced a value for the radius of the Earth which was only\n0\n.\n44\n% below the correct result. The use of these techniques meant that Picard was one of the first to apply scientific methods to the making of maps. He produced a map of the Paris region, and then went on to join a project to map France. His data on the Earth was used by\nNewton\nin his gravitational theory. Picard was honoured for these contributions with a pyramid erected at Juvisy-sur-Orge, one end of his baseline, in\n1740\n.\nIn\n1671\nPicard went to\nTycho Brahe\n's observatory at Hven Island in Sweden so that its location could be determined accurately and so Tycho's observations could be directly compared with others. There over a period of several months, working with Ole Rømer, he observed about\n140\neclipses of Jupiter's moon Io, while\nGiovanni Domenico Cassini\nin Paris carried out the same observations. In\n1673\nPicard moved to the Paris Observatory where he collaborated with\nJean Richer\n,\nGiovanni Domenico Cassini\nand, slightly later, with\nLa Hire\n. Rømer also went to the Paris Observatory following the visit to Hven Island and, with Picard, continued to observe the moons of Jupiter. It was from the data that Picard and Rømer collected that Rømer was able to calculate the speed of light by noting the discrepancies in the timings of the eclipses due to the time light takes to travel to the Earth. We should also mention another significant discovery by Picard, namely his discovery of barometric light in\n1675\n. This is the luminous glow which is seen in the vacuum above the mercury in a barometer when the tube is shaken. This discovery prompted\nNewton\nto make studies which led to spectrometry.\nPicard was also involved with the measurement of the length of the second pendulum. Finding that the length was not constant led to the first proof that the Earth was not a perfect sphere but was flattened at the poles. Also at the Paris Observatory, Picard was involved with measuring the parallax of Mars. This was important since an accurate value would give the scale of the solar system. The value Picard, working with\nGiovanni Domenico Cassini\n, and\nJean Richer\n, deduced for the distance from the Earth to the sun underestimates the true value by\n8\n.\n5\n%. Also at the Paris Observatory, Picard tried to measure the parallax of nearby stars and so verify the fact that the Earth orbits the sun. In\n1680\nhe found the first certifiable variation but at this time aberration was not understood, so he cannot be credited with the discovery of the first stellar parallax\n(\nsee\n[\n9\n]\nfor further details\n)\n.\nAmong Picard's other skills were hydraulics, a topic on which he wrote but also one where he put his skills into practice. He solved the problem of supplying the fountains at Versailles with water. Albert van Helden writes\n[\n11\n]\n:-\nThe many ponds and fountains of Versailles needed a copious supply of water, and the palace was not well situated in this respect. Prodigious engineering efforts went into the solutions to this problem, and Picard's new levelling instruments with telescopic sights helped determine routes and avoided costly errors.\nPicard corresponded with many of the leading scientists of his time including\nBartholin\n,\nHevelius\n,\nHudde\nand\nHuygens\n. He published the first\nConnaissance des temps\nⓉ\n(\nKnowledge of time\n)\nfor the year\n1679\nand continued to produce the annual work for the following four years. It has been published continuously since then. However, his astronomical observations were not published in his lifetime. In fact it was\n60\nyears after his death before they were published by Pierre-Charles Le Monnier. Albert van Helden ends his review with this assessment of Picard\n[\n11\n]\n:-\n... it is now evident just how much modern precision measuring owes to this quiet, unassuming man who stayed out of the limelight.",
  "math_areas": [
    "Logic"
  ]
}