{
  "nome_completo": "Jean-François Le Gall",
  "nome_curto": "Jean-François Le Gall",
  "ano_nascimento": "1959",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Gall/",
  "lugar_nascimento": "Morlaix, France",
  "lugar_morte": null,
  "biografia": "Jean-François Le Gall\nwas born in Morlaix, a town in Brittany on the north west coast of France. His father was a teacher in an elementary school, teaching the full range of subjects to young children. His mother stayed at home and looked after the family. Jean-François had an uncle who was a teacher of mathematics and when Jean-François was young he taught him some mathematics taking him beyond the material he was covering at school. This gave him a good understanding of subject as well as a liking for it.\nLe Gall was an outstanding pupil at school, so after taking the baccalaureate examinations he went on to take the two year course designed to prepare the top pupils to take the entrance examinations for the Grandes écoles. He was seventeen years old and did not want to move far from his parents, so he went to Rennes for the preparatory course. At Rennes he had a very good young teacher of mathematics who was a big influence on him. He said in the interview\n[\n29\n]\n:-\nI prepared for the entrance examination to the Écoles Normales Supérieures\n(\nENS\n)\nin Rennes which is not a famous place to prepare for such examinations so, although I was the best student in the class, I wasn't really sure I could compete. But finally I was admitted and I was very happy. I had to work a lot of course during these two years but for me it was not too much - I could stand it. I know that some people find it extremely hard but that was not the case or me. I wasn't admitted with a very good rank - I was\n18\nth, I think.\nWhen he entered the ENS in\n1978\nhe had to choose between mathematics and physics. This, however, was not a difficult choice for him to make\n[\n29\n]\n:-\nI did not have good teachers of physics at school so I did not like physics at all. It was clear to me that I wanted to do mathematics. I didn't like physics experiments but above all I didn't like the lack of rigour in physics. I think my teachers were responsible for that for later I studied physics and finally I like some aspects of it.\nAt the time he entered the ENS, although he knew he wanted to study mathematics there, Le Gall still did not know what career he wanted to follow\n[\n29\n]\n:-\nWhen I entered the Écoles Normales Supérieures, I still didn't know I wanted to make mathematics my profession. I heard there were positions in CNRS for doing research in mathematics. Of course I knew that there were very few such positions, but this was very attractive for me. Before that I didn't really know what I should do to become a mathematician.\nFor Le Gall, the ENS was much preferable to the École Polytechnique. There were no set courses, so he could choose to learn the mathematical topics which interested him. In his first year he took a course given by Robert Azencott\n(\nborn\n1943)\non time series analysis. He enjoyed this applied probability course, which was not theoretical, describing Azencott as \"a brilliant professor.\" Azencott had been awarded a doctorate in\n1969\nby the University of Paris VI for his thesis\nRandom Walks and Harmonic functions on Groups\n. He had been advised by\nJacques Neveu\n. Le Gall said in the interview\n[\n28\n]\n:-\nAfter two years, I passed the agrégation de mathématicque. It was a difficult examination and I had to learn a lot of mathematics - all branches of mathematics - to pass this examination. It was very useful for my research work after that.\nHe also commented in\n[\n29\n]\n:-\nI passed the agrégation which is one examination which gives a ranking of all students, not only from the ENS but all mathematics students in France. I was ranked first and I was very happy with that. It gave me some confidence to continue to do mathematics.\nRemaining at the Écoles Normales Supérieures, Le Gall began to undertake research for his Thèse de troisième cycle\n(\nPhD\n)\non probability theory. He explained in the interview\n[\n29\n]\nwhy he chose to undertake research in probability theory. He explained that there were a number of reasons, one being that at school he had been interested in a problem about numbers which he thought could be more easily attacked using probability theory. Another reason was a completely practical one. He thought about positions he could get after completing his research and realised that, although there were only one or two people who had studied probability getting positions each year at the Le Centre National de la Recherche Scientifique\n(\nCNRS\n)\n, there were not any appointments of pure mathematicians who had studied algebraic geometry. Perhaps the most significant reason, however, was that two of his close friends had decided to undertake research in probability. One of these friends later left mathematics and worked as an administer on the railways, while the other, Jean Picard, now works at the École d'Été de Probabilités de Saint-Flour. Le Gall said\n[\n27\n]\n:-\nOf course, I didn't know probability theory at that point so there was no mathematical reason to choose that. After I began, very quickly I liked it and I wanted to continue.\nHis thesis advisor was Marc Yor\n(1949\n-\n2014)\n. At first Yor had been a researcher at the French Centre National de la Recherche Scientifique, then, from\n1981\n, a professor at the University of Paris VI, also known as the Université Pierre et Marie Curie. In fact, before Le Gall began working with Yor, he tried to work with another advisor who was not doing active research at that time. It was not a success, he could not really work with him, so he began working with Yor. Le Gall said in\n[\n27\n]\n:-\nYor was very active - he always accepted new people. You could go and see him and even if he was very busy he always said, \"Well you can come and work with me - we can discuss things\". At that moment it was very convenient for I could come along each week to discuss with him. Even if I had nothing interesting to say, it was important for me to go and discuss with him.\nLe Gall and Jim Pitman\n(\nson of\nEdwin Pitman\n)\nwrote the obituary\n[\n30\n]\nfor Marc Yor after his death in\n2014\n. They write that Yor:-\n... played an irreplaceable role in welcoming the best mathematics students interested in probability and engaging them in research, advising over\n30\ntheses during his career as university professor. A large number of these students went on to be researchers at the CNRS or professors in France and other countries. Without him, the recent successes of the French probability school, most notably the\nFields\nMedal of his 'grandstudent'\nWendelin Werner\nin\n2006\n, would most likely never have been achieved.\n...\nTwo words which best describe Marc Yor's scientific personality are, without doubt, enthusiasm and generosity. Enthusiasm, because he knew so well how to communicate his taste for research and to share the joy of discovery of new theorems and formulas. Generosity, because he helped so many young researchers, publishing with them numerous research articles which everyone knew he had essentially written himself, but for which he was always happy to share the credit.\nMarc Yor suggested that Le Gall study Brownian motion\n[\n27\n]\n:-\nIt was Marc Yor who, through his infectious enthusiasm, was able to convince me to take an interest in the fascinating mathematical object that is Brownian motion.\nLe Gall gives an intuitive idea of Brownian motion in\n[\n27\n]\n:-\n... mathematical Brownian motion is a curve depending on chance, accounting for the phenomenon studied by great physicists like\nAlbert Einstein\nand Jean Perrin. To give an intuitive idea of what Brownian motion is, we imagine a walker moving in a very large park and taking a step every second in one of the four possible directions, North, South, East or West, chosen randomly every time. If we observe the movement of the walker over a long period of time, say a few hours, and on a suitable scale, we will see a random curve which is close to that of Brownian motion in dimension two. Brownian motion is thus a sort of ideal prototype of a purely random curve. My first research work dealt with various properties of the Brownian motion curve, notably concerning the intersections of this curve with itself: for example, we show that the Brownian motion in the plane passes an infinite number of times at certain points, and my work has enabled us to better understand this phenomenon.\nFor more information about the history of probability, how Brownian motion came into this topic, and Le Gall's own contributions, see the English translation of Le Gall's article\n[\n27\n]\nat\nTHIS LINK\n.\nIn June\n1982\n, Le Gall was awarded his 'Thèse de troisième cycle' by the University of Paris VI for the\n180\n-page thesis\nTemps locaux et équations différentielles stochastiques\nⓉ\n(\nLocal times and stochastic differential equations\n)\n.\nAfter the award of the doctorate, Le Gall did one year\n(1982\n-\n83)\nof compulsory military training. This had been introduced in France at the time of the French Revolution and conscription continued until the end of the\n1990\ns. He had three weeks of army training when he had to work through the night, sleep outside, and do things he found painful. After this short course, however, he was sent to an establishment in Paris run by the French Alternative Energies and Atomic Energy Commission\n(\nCEA\n)\nwhere nuclear research was being undertaken. His work there involved mathematical physics, and he researched mathematical modelling of particles. He said\n[\n29\n]\n:-\nI think I did some non-trivial work there with some simulations. I was not really interested because there were constraints - I had not chosen to work on that. I worked with someone who is still at the establishment and he published a paper including my results. Apparently my name is on the paper but I have never seen it! It is not in MathSciNet since its an internal CAE report. It is more related to numerical analysis. It was not a bad experience for I think I learnt certain things. I didn't have much money but for that year I had a very small apartment in Paris.\nAfter completing his conscription, he was appointed to the CNRS as Chargé de Recherches at the Laboratoire de Probabilités of the University of Paris VI. This is a research only position and he undertook research with the eventual aim of the Thèse de Doctorat d'Etat ès Sciences Mathématiques. When he joined the CNRS his laboratory director was\nJacques Neveu\n, who we mentioned above as having been Robert Azencott's thesis advisor. Le Gall said that\nNeveu\n[\n5\n]\n:-\n... greatly impressed me with the elegance and originality of his work. The few discussions I had with him had a lasting influence on my mathematical career, particularly in the field of random trees.\nLe Gall was awarded the degree of Doctorat d'Etat ès sciences mathématiques in\n1987\nfor the thesis\nQuelques propriétés du mouvement brownien\nⓉ\n(\nSome properties of Brownian motion\n)\n. The thesis has the following Abstract:-\nWe give a presentation of several studies concerning Brownian motion, which can be grouped around two main themes. The first is the study of intersections of Brownian trajectories, and is linked to certain problems which have recently aroused the interest of physicists, particularly in polymer theory. A key role in this study is played by the notion of local intersection time, which allows, in a certain sense, to measure the number of intersections of a Brownian trajectory. The second theme concerns the study of the winding number of Brownian motion and some related questions.\nIn\n1988\nLe Gall was appointed as a Professor at the University of Paris VI. He continued to hold this position until\n2006\nbut, in\n1997\n, he was seconded to the École Normale Supérieure de Paris. During\n2000\n-\n2004\nhe was Director of the Magistère, a post-graduate qualification, for Pure and Applied Mathematics and Computer Science at the ENS and other Parisian universities. From\n2004\nto\n2007\nhe was Director of Mathematical Studies at the ENS in Paris. During this time, however, in\n2006\n, he left his position at the University of Paris VI and took up an appointment as Professor at the University of Paris-Sud. He explained in\n[\n9\n]\nthe reasons behind this move:-\nIt's a little team, where it is easy to talk with mathematicians in other areas. I joined several people there that I appreciate, like my former student\nWendelin Werner\n. There was the desire not to become fossilised, but also to evolve in my research.\nThe Institut universitaire de France promotes the development of high-level research in French universities and aims to strengthen interdisciplinarity. It encourages establishments and teacher-researchers to achieve excellence in research, with the positive consequences that can be expected on teaching, the training of young researchers and more generally the dissemination of knowledge. In\n1991\nLe Gall was made a Junior Member of the Institut Universitaire de France, then was promoted to Senior Member in\n2007\nwith the position being renewed in\n2012\n.\nFrom\n2007\n, Le Gall was co-director of the Master's Degree in probability and statistics at the University of Paris-Sud and, in addition, he became director of the probability and statistics team in the mathematics department of the University of Paris-Sud in\n2013\n.\nLet us quote Le Gall's own description of his work from\n[\n5\n]\n:-\nI am a specialist in probability theory. My first research work focused on mathematical Brownian motion. Simplifying a little, Brownian motion represents the movement of a particle which at each instant will change direction in a completely random manner, and we are interested in the geometric properties of the trajectory thus obtained. Secondly, I worked a lot on models describing a cloud of particles subject to a double phenomenon of Brownian displacement and random reproduction: for example we can imagine that at random times each Brownian particle either dies or splits into two new particles. My motivation for studying these models came in part from deep connections with another area of mathematics, the theory of partial differential equations. At the same time, I was interested in \"continuous random trees\" which describe the genealogy of large populations, and I constructed these models by connecting them to other classic objects of probability,\nLévy\nprocesses. In the last twelve years, my work has focused on a new branch of probability, random geometry. This involves understanding the geometric properties of large graphs drawn randomly in the plane. This leads to the introduction of new fascinating mathematical objects, in particular the \"Brownian map\" which is a random metric space limit of many discrete models and whose existence and uniqueness I contributed to showing. This random geometry has close ties to other parts of mathematics, notably combinatorics, as well as to the physical theory called quantum gravity in two dimensions.\nLe Gall has been awarded many prizes for his outstanding work on probability theory. The award of the Rollo Davidson Prize for\n1986\nwas made to\n[\n33\n]\n:-\n... Jean-Francois Le Gall of the Université Pierre et Marie Curie, Paris, for his use of local-time arguments to obtain uniqueness theorems for stochastic differential equations, and for his work on the multiple points of Brownian motion.\nHe was a Collège de France Cours Peccot lecturer in\n1989\ndelivering the course\nQuelques équations cinétiques et leurs limites fluides\nⓉ\n(\nSome kinetic equations and their fluid limits\n)\n. He was awarded the Loève Prize in\n1997\n, then the Grand Prix\nSophie Germain\nfrom the\nAcadémie des Sciences\nin\n2005\n. Also in\n2005\nhe was awarded the Prix\nFermat\nde Recherche en Mathématiques\n[\n21\n]\n:-\n... for his contributions to the fine analysis of planar Brownian motion and his invention of the Brownian snake and its applications to the study of nonlinear partial differential equations.\nIn\n2009\nhe was awarded the Médaille d'Argent from the Centre National de la Recherche Scientifique\n[\n10\n]\n:-\n... for the originality, quality and importance of his work, recognised both nationally and internationally.\nLe Gall was awarded the highly prestigious Wolf Prize in\n2019\n[\n39\n]\n:-\n... for his profound and elegant works on stochastic processes.\nHe received the BBVA Foundation Frontiers of Knowledge Award in\n2021\n.\nFor more information about all the above awards, see\nTHIS LINK\n.\nLe Gall has published three important books:\nSpatial branching processes, random snakes and partial differential equations\n(1999)\n;\nMouvement brownien, martingales et calcul stochastique\nⓉ\n(\nBrownian motion, martingales and stochastic calculus\n)\n(2013)\n[\nEnglish translation\nBrownian motion, martingales, and stochastic calculus\n(2016)]\n; and\nMeasure theory, probability, and stochastic processes\n(2022)\n. For more information about these books, including extracts from prefaces and reviews, see\nTHIS LINK\n.\nAll of Le Gall's papers and books are beautifully written. He comments on his perfectionist nature in\n[\n5\n]\n:-\nPersonally, I consider each of my articles a bit like an object made by a craftsman who would strive for a long time to make it more beautiful and more elegant before offering it to his clients\n(\nfor me, submitting it to a journal\n)\n. I know that this perfectionist side has been very beneficial for my career.\nAmong many invitations to lecture at conferences, we note that in\n1998\nLe Gall was an invited lecturer at the International Congress of Mathematicians in Berlin and a plenary lecture at the European Congress of Mathematics in Amsterdam in\n2008\n. At the ICM\n1998\nhe delivered the lecture\nBranching Processes, Random Trees and Superprocesses\nand gave the following Abstract:-\nWe present some recent developments concerning the genealogy of branching processes, and their applications to superprocesses. We also discuss connections with partial differential equations, statistical mechanics and interacting particle systems.\nAt the Fifth European Mathematical Congress held in Amsterdam,\n14\n-\n18\nJuly\n2008\n, there were ten plenary lecturers. Le Gall gave the plenary lecture\nLarge random planar maps and their scaling limits.\nIt has the following Abstract:-\nWe discuss scaling limits of random planar maps chosen uniformly at random in a certain class. This leads to a universal limiting space called the Brownian map, which is viewed as a random compact metric space. The Brownian map can be obtained as a quotient of the continuous random tree called the CRT, for an equivalence relation which is defined in terms of Brownian labels assigned to the vertices of the CRT. We discuss the known properties of the Brownian map. In particular, we give a complete description of the geodesics starting from the distinguished point called the root. We also discuss applications to various properties of large random planar maps.\nThe International Congress of Mathematicians was held in Seoul in\n2014\nand Le Gall was a plenary lecturer delivering the lecture\nRandom geometry on the sphere\n. His Abstract is as follows:-\nWe introduce and study a universal model of random geometry in two dimensions. To this end, we start from a discrete graph drawn on the sphere, which is chosen uniformly at random in a certain class of graphs with a given size n, for instance the class of all triangulations of the sphere with n faces. We equip the vertex set of the graph with the usual graph distance rescaled by the factor\nn\n−\n1\n/\n4\nn^{-1/4}\nn\n−\n1\n/\n4\n. We then prove that the resulting random metric space converges in distribution as\nn\n→\n∞\nn \\rightarrow  ∞\nn\n→\n∞\n, in the\nGromov\n-\nHausdorff\nsense, toward a limiting random compact metric space called the Brownian map, which is universal in the sense that it does not depend on the class of graphs chosen initially. The Brownian map is homeomorphic to the sphere, but its\nHausdorff\ndimension is equal to\n4\n. We obtain detailed information about the structure of geodesics in the Brownian map. We also present the infinite-volume variant of the Brownian map called the Brownian plane, which arises as the scaling limit of the uniform infinite planar quadrangulation. Finally, we discuss certain open problems. This study is motivated in part by the use of random geometry in the physical theory of two-dimensional quantum gravity.\nLe Gall was elected a fellow of the Institute of Mathematical Statistics in\n2008\nand a member of the\nAcadémie des Sciences\nin\n2013\n.\nHe has undertaken many editorial duties: Associate editor of the\nAnnales de l'Institut Henri Poincaré Probabilités et Statistiques\nfrom\n1989\nto\n1994\n; Associate editor of\nAstérisque\nfrom\n1991\nto\n1997\n; Associate editor of the\nAnnales Scientifiques de l'Ecole normale supérieure\nfrom\n1991\nto\n1997\n; Managing editor of the\nAnnales de l'Institut Henri Poincaré Probabilités et Statistiques\nfrom\n1994\nto\n2000\n; Associate editor of\nProbability Theory and Related Fields\nfrom\n2000\nto\n2005\n; Associate editor of the\nAnnales de l'Institut Fourier\nfrom\n2003\nto\n2008\n; Managing editor of\nProbability Theory and Related Fields\n(\nwith Jean Bertoin\n)\nfrom\n2005\nto\n2010\n; Associate editor of the\nJournal de l'Institut Mathématique de Jussieu\nfrom\n2007\nto\n2014\n; Associate editor of\nThe Annals of Probability\nfrom\n2012\nto\n2018\n; Associate editor of the\nComptes rendus de l'Académie des sciences\nsince\n2014\n; Associate editor of the\nAnnales de la Faculté des Sciences de Toulouse\nsince\n2020\n; Associate editor of the\nGrundlehren der mathematischen Wissenschaften\nsince\n2020\n.\nLe Gall has\n(\nup to\n2023)\nbeen the Ph.D. thesis advisor for twenty students. The most famous of these is\nWendelin Werner\nwho was awarded a\nFields\nMedal in\n2006\n. As an example of how much Le Gall's students appreciate him, let us quote from the Acknowledgement that Igor Kortchemski gives in his thesis\n[\n22\n]\n:-\nI would like to express my deepest gratitude to Jean-François Le Gall for offering me an exciting thesis subject opening the way to numerous directions of research, for his availability, for the always fruitful mathematical discussions, for his always wise advice, for all the time devoted to the careful reading\n(\nand re\n[\nre\n]\nreading!\n)\nof the articles and finally for the total freedom granted during this thesis.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}