{
  "nome_completo": "Jean Frédéric Auguste Delsarte",
  "nome_curto": "Jean Delsarte",
  "ano_nascimento": "1903",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delsarte/",
  "lugar_nascimento": "Fourmies (Nord), France",
  "lugar_morte": "Nancy, France",
  "biografia": "Jean Delsarte\n's father was the head of a textile factory in Fourmies but in\n1914\nthe German armies advanced on the town and all Jean's family left his home town, except his father, and fled to safety in Rouen. Jean's father bravely remained in Fourmies trying to save the remnants of his destroyed factory. Jean had been a brilliant pupil at primary school in Fourmies where he studied during\n1913\n-\n14\nat the Collège St-Pierre, and later he did outstandingly well in his secondary education at the Lycée Corneille in Rouen. He studied there from\n1915\nto\n1922\nand was awarded the Medal for Science in\n1920\n.\nIn\n1922\nDelsarte entered the École Normale Supérieure in Paris. There he met with many students who would become his friends and play a major role in his life from that point on. In particular he met with mathematics student\nAndré Weil\nand the physicist Yves Rocard who were both in the same year as Delsarte. After one year they were joined by\nHenri Cartan\n, Jean Coulomb who studied mathematical physics,\nPaul Dubreil\n,\nRené de Possel\nand the future philosopher of mathematics Jean Cavaillès. Several entering the École Normale in\n1924\nalso joined the group of Delsarte's friends; these included Marcel Brelot,\nJean Dieudonné\nand\nCharles Ehresmann\n. In the following year\nClaude Chevalley\nand\nJean Leray\nentered the mathematics classes adding to the group of friends and future colleagues who combined their talents in a remarkable collaboration as\nBourbaki\nin\n1935\n. It was a collaboration in which Delsarte took a leading role and, looking at reports of their meetings, one is struck with the humour, the passion, and the self-belief that these young men of the École Normale displayed.\nDelsarte graduated from the École Normale in\n1925\n. After completing his compulsory military training, he wrote a doctoral thesis during the year in which he held a Thiers Foundation research fellowship. He worked during that year at the private mansion of the Foundation, undertaking research for his doctoral thesis and also working on his first two papers\nSur les rotations dans l'espace fonctionnel\nⓉ\n(\nOn the rotations of functional space\n)\nand\nÉtude de certaines équations intégrales qui généralisent celles de Fredholm\nⓉ\n(\nStudy of some integral equations which generalize those of Fredholm\n)\nwhich were published by the\nAcademy of Science\n. In March\n1928\nhe was awarded his doctorate for his thesis\nLes rotations fonctionnelles\nⓉ\n(\nFunctional rotations\n)\non the same topic as the first of the above two papers. However, in November of the previous year, he had been appointed as Chargé de cours at the Faculty of Science in Nancy. In fact Delsarte was to remain on the staff at Nancy for the rest of his career but his first promotion was to Maître de Conférences in October\n1928\n. In the following year Delsarte married Thérèse Sutter, the daughter of a doctor. The two had been friends from childhood and they made their home at\n4\nrue de l'Oratoire in Nancy; there they had two daughters, Chantal and Micheline. In\n1932\nDelsarte's outstanding research was recognised with an invitation to address the International Congress of Mathematicians in Zürich. He lectured to the Congress on\nLe groupe des transformations conformes dans l'espace de Hilbert\nⓉ\n(\nThe group of conformal transformations in Hilbert space\n)\n.\nNot only did Delsarte teach some outstanding mathematics courses at Nancy but he taught a public course on astronomy from\n1929\n, continuing to give this when at Nancy for the rest of his career. In\n1931\nhe gave a course on linear groups of transformations on Hilbert space when invited to give the prestigious Peccot Foundation lectures at the College of France. At Nancy he developed a new course on differential equations in the academic year\n1933\n-\n34\nand in the following year, also at Nancy, he gave a course on\nRiemann\nspaces and relativity. In addition he lectured at the\nHenri Poincaré\nInstitute in Paris on\nHilbert spaces\n. It was during his regular visits to Paris during\n1934\n-\n35\nthat Delsarte became heavily involved in the\nBourbaki\nproject to write a new analysis textbook which expanded into the remarkable\nÉléments de Mathématique\nⓉ\n(\nElements of mathematics\n)\n. In October\n1936\nhe was appointed professor of higher analysis at Nancy.\nDelsarte cooperated with\nAndré Weil\nand\nHenri Cartan\n, both by this time lecturers in Strasbourg, in organising a joint seminar programme between Nancy and Strasbourg. He was able to bring many of his outstanding colleagues to Nancy;\nPaul Dubreil\ntaught there between\n1933\nand\n1937\n,\nJean Leray\nwas apointed part-time lecturer in applied mathematics in\n1936\nbecoming a lecturer in\n1937\n, and then professor of applied mathematics in\n1938\n.\nJean Dieudonné\nwas appointed as a lecturer in Nancy, also in\n1938\n.\nThere was another aspect of Delsarte's work during the\n1930\ns which is quite unusual for a young mathematician, for he involved himself in several major administrative roles. He headed the Entrance Board for the French baccalaureat in Poland during the year\n1928\n-\n29\nduring which time he met and became friends with\nStanislas Zaremba\n. He served on the admissions board of the École Centrale in Paris during the\n1930\ns and also was head of research at the Centre National de la Recherche Scientifique from July\n1932\nto October\n1936\n. He received the Victor Noury Foundation prize from the\nAcademy of Sciences\nin\n1935\nin recognition of his outstanding contributions. His involvement in both teaching and research led him to write three artices which were published in\n1939\ngiving constructive criticism of the way scientific research and higher education were organised in France. These articles were\nL'organisation de la recherche scientifique, De l'enseignement supérieur en France et spécialement des Facultés des Sciences\nⓉ\n(\nThe organization of scientific research in higher education in France and especially in the faculties of science\n)\n, and\nSur un projet de réforme de l'enseignement supérieur\nⓉ\n(\nOn the higher education reform\n[\nroject\n)\n.\nBy\n1939\nhe had shown his talents at research, teaching and administration of mathematics and was having a major impact on mathematics in France with his involvement in a wide range of activities. World War II was to have a major impact on Delsarte's career, as of course it did for so many of his friends. Already trained as an artillery officer during his time at the École Normale Supérieure, Delsarte was put in charge of a unit in September\n1939\nwhich he commanded until August\n1940\n. Under his command the\n8\nth\nBattery was led across the Jura and the Alps, bringing them to Alsace where they saw action before he was demobilized in Nimes. Delsarte now went to the Faculty of Sciences at Grenoble to replace Jean Favard, the professor of mathematics, who had been captured by the Germans and was being held as a prisoner of war in Germany. The safest course for Delsarte would have been to remain in the comparative safety of Grenoble as long as possible, but he did not choose the easy option, returning instead in September\n1941\nto Nancy which was in a dangerous closed area.\nWhile the war slowly ran its painful course, Delsarte continued to undertake duties for French mathematics both in Nancy and in Paris at the Centre National de la Recherche Scientifique where he served on a pure mathematics commission, and also as an examiner for entry to various Écoles. He was awarded the Vailland Prize by the\nAcademy of Sciences\nin\n1944\nand in the same year he became head of mathematics at Nancy. He held this position from that time until his death. Among the other senior posts he held there after the war was the post of Dean of Science which he held during the years\n1945\n-\n48\n.\nBefore the start of World War II, Delsarte had brought a number of leading mathematicians to Nancy. He repeated this after the war ended bringing\nLaurent Schwartz\n(1945\n-\n1952)\n,\nRoger Godement\n(1946\n-\n1955)\n,\nJean-Pierre Serre\n(1954)\n, and\nJacques-Louis Lions\n(1954\n-\n1964)\n. In\n1953\nhe created the\nÉlie Cartan\nInstitute at Nancy which, to a certain extent, was modelled on the\nHenri Poincaré\nInstitute in Paris. Delsarte's involvement with\nBourbaki\n, and the continual appearance of members of\nBourbaki\nat the Institute, led to widespread belief that the\nÉlie Cartan\nInstitute was the\nBourbaki\ngroup. In\n1959\nDelsarte put out a statement clarifying the position:-\nThe Bourbaki Group is completely distinct from the\nÉlie Cartan\nInstitute, which deals only with the administration of the Bourbaki Group. The members of the Élie Cartan Institute are not the members of the Bourbaki Group, but the intersection of these two sets is nonempty.\nLet us look at some of Delsarte's mathematical contributions. A review of\n[\n2\n]\nstates:-\nDelsarte is best known for his work on mean periodic functions and translation operators, but he was an analyst of great power and originality, which he applied to many problems ...\nHe published a series of papers on this topic in\n1934\n-\n35\n:\nLes fonctions moyenne-périodiques\nⓉ\n(\nMean-periodic functions\n)\n(1934)\n;\nApplication de la théorie des fonctions moyenne-périodiques à la résolution de certaines équations intégrales\nⓉ\n(\nApplication of the theory of mean-periodic functions in the resolution of certain integral equations\n)\n(1934)\n;\nApplication de la théorie des fonctions moyenne-périodiques à la résolution des équations de Fredholm-Nörlund\nⓉ\n(\nApplication of the theory of mean-periodic functions in solving  Fredholm-Norlund equations\n)\n(1935)\n; and\nLes fonctions moyenne-périodiques\nⓉ\n(\nMean-periodic functions\n)\n(1935)\n. He also later published\nFonctions moyenne-périodiques sur un groupe abstrait\nⓉ\n(\nMean-periodic functions on an abstract group\n)\n(1937)\nand\nThéorie des fonctions moyenne-périodiques de deux variables\nⓉ\n(\nTheory of mean-periodic functions of two variables\n)\n(1960)\n.\nDelsarte worked in analysis extending work on series expansions due to\nWhittaker\nand\nWatson\n. He was greatly influenced by their text\nA Course of Modern Analysis\nand by\nWatson\n's\nTreatise on the Theory of Bessel Functions\n.\nDieudonné\n, writing in\n[\n1\n]\n, says:-\nThese works had convinced him that a good understanding of the formal properties of\n[\nseries expansions of functions\n]\nwas necessary to a fruitful study of their domains of definition and their mode of convergence. This was the course he followed with remarkable success, opening up new fields of research that are still far from having been thoroughly explored.\nOne of the most surprising of Delsarte's results was a generalisation of a result due to\nGauss\n.\nGauss\nhad shown that if a continuous function\nf\nf\nf\non\nR\nn\n\\mathbb{R}^{n}\nR\nn\nhas at each point\nx\nx\nx\na value equal to its mean value on every sphere of centre\nx\nx\nx\n, then\nf\nf\nf\nis harmonic. Delsarte showed that\nf\nf\nf\nis harmonic under the weaker condition that\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nis the mean value on two spheres centre\nx\nx\nx\n, radius\na\na\na\nand\nb\nb\nb\n, provided\na\nb\n\\Large\\frac{a}{b}\\normalsize\nb\na\n​\ndoes not take one of a particular finite set of values. A proof of this result was first sketched in his paper\nNote sur une propriété nouvelle des fonctions harmoniques\nⓉ\n(\nNote on a new property of harmonic functions\n)\n(1958)\nand is explained in more detail in\nLectures on Topics in Mean Periodic functions and the Two Radius Theorem\npublished in Bombay in\n1961\n.\nOther important work by Delsarte was on transmutation operators. For example he published\nHypergroupes et opérateurs de permutation et de transmutation\nⓉ\n(\nHypergroups and  permutation and transmutation operators\n)\n(1956)\nand two papers with\nJacques-Louis Lions\nboth titled\nTransmutations d'opérateurs différentiels dans le domaine complexe\nⓉ\n(\nTransformations of differential operators in the complex domain\n)\nand published in\n1957\n. Levitan looks at this aspect of Delsarte's work in detail in\n[\n4\n]\n.\nAlthough Delsarte remained permanently on the staff at Nancy all his life, he did lecture in many different universities from\n1947\nonwards, particularly ones in India, North America and South America. He spent four months at the Institute for Advanced Studies at Princeton in the first half of\n1947\n, then in each of the years\n1948\nto\n1951\nhe spent four months each year at São Paulo in Brazil. He spent three months in Mexico in\n1952\n, then three months in the United States and Canada in\n1957\n. Two years later he was back in Mexico for three months and then in\n1962\n-\n65\nhe spent three years in Japan before returning via China and Russia. In fact Delsarte had originally intended to spend four years in Japan but cut short his visit, partly due to health problems, in particular his eyesight was rapidly deteriorating. Back in Nancy he did not let his poor eyesight prevent him from attending several European conferences visiting Cambridge, Liège, Brussels, Louvain, Lausanne, Basel, and Zürich.\nDespite his health problems, Delsarte taught the mechanics course in\n1967\n-\n68\n. However,\n1968\nwas a year of student unrest in France, and the students in Nancy looked for educational reforms. Delsarte had, of course, always advocated educational reforms, but he did not support the extreme methods adopted by some students. However, he wrote on\n20\nMay\n1968\n:-\nThe attitude of the students here is rather correct ...  There is not complete occupation of the Faculty, since the offices of the Professors and the library are free.\nNear the end of September\n1968\nDelsarte suffered a heart attack. He wrote to the Faculty:-\nI must tell you that I am currently a little ill: last Thursday I had, in my office in the Faculty, a rather spectacular heart attack, which I found extremely painful. For the moment I am in bed, and this evening the doctor will give me an electrocardiogram.  I will then know the duration of my disability.  I think that it will not exceed ten days, because I now feel very well.\nHe died after suffering a second heart attack on\n28\nNovember.\nDelsarte received many honours and we have already mentioned some above. After World War II he was awarded a medal from the University of Liège in\n1950\nand another from the University of Mexico in\n1952\n. He was made Chevalier de la Légion d'Honneur in\n1954\n, Commander of the Ordre des Palmes Académique in\n1962\n, and received the Bordin Prize from the\nAcademy of Sciences\nin\n1964\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}