{
  "nome_completo": "James Hardy Wilkinson",
  "nome_curto": "Jim Wilkinson",
  "ano_nascimento": "1919",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilkinson/",
  "lugar_nascimento": "Strood, Kent, England",
  "lugar_morte": "Teddington, Middlesex, England",
  "biografia": "Jim Wilkinson\n's mother was Kathleen Charlotte Hardy and his father was James William Wilkinson who was in the dairy business. The family were not well off but were close and supported each other. There were five children in the family and Jim was the third child, having one brother and three sisters. Jim showed a great ability to carry out complicated arithmetical calculations as a child, and whats more he enjoyed doing so. He won a Foundation Scholarship to Sir Joseph Williamson's Mathematical School, Rochester, at the age of eleven. This was fortunate, for his parent's dairy business collapsed in the\n1930\ns and the family were left extremely poorly off. At the age of sixteen he won a scholarship to Trinity College, Cambridge and matriculated there shortly after his seventeenth birthday. At Cambridge he was taught by\nHardy\n,\nLittlewood\nand\nBesicovitch\n. His final examination results were sent to him by\nBesicovitch\nwho wrote:-\nEasily at the top of the First Class. Heartiest Congratulations.\nAt this stage Wilkinson seemed set to become a classical analyst but the Second World War changed the direction of his research. In\n1940\n, rather than going into the infantry, Wilkinson began war work on the thermodynamics of explosions, ballistics, supersonic flow, and fragmentation of shells. At first he tried to solve analytically the problems he was presented with, which after all was the way he had learnt at university to solve problems, but he soon realised that he would have to use approximate numerical methods if he was to obtain useful results. He began to put his greatest efforts into the numerical solution of hyperbolic partial differential equations, using finite difference methods and the method of characteristics. He carried out the calculations on a mechanical calculating machine which he operated by turning a handle.\nIn\n1945\nWilkinson married Heather Nora Ware, the daughter of a buyer for a drapery warehouse; they had one daughter and one son.\nIn\n[\n9\n]\nWilkinson makes the interesting comment that if the war had only lasted for three years he would almost certainly have returned to Cambridge and resumed his research on classical analysis. However, he spent six years involved with numerical computing and by this time he was completely fascinated by the new area of research. As a child he had been fascinated by calculating, but his course at Cambridge had taken his interests towards analytic techniques. His war work had taken him back to the love of his childhood, namely calculating, and now he wanted to push forward with the development of computational mathematics. He became\nTuring\n's assistant at the National Physical Laboratory in London in May\n1946\n.\nAt the National Physical Laboratory he worked on the ACE\n(\nAutomatic Computing Engine\n)\ncomputer project and, although no computer existed at that time, he wrote subroutines to do floating-point arithmetic. His role at this time was described as follows:-\nTuring\nprovided the blueprint, but could not get on with others. Wilkie\n[\nthe name by which Wilkinson was known at that time\n]\nwas able to cooperate as well as anyone with\nTuring\n, and had the tact and wisdom necessary to get things done. He grasped all the technical details very quickly, shared the lectures on ACE with\nTuring\nand wrote the definitive description of the design.\nIn\n1948\nTuring\nleft the ACE project and Wilkinson\n[\n1\n]\n:-\n... took a leading role in the development of a modified machine, known as Pilot ACE; this proved highly successful from its inception in May\n1950\n.\nPilot ACE was intended to demonstrate the potential of the technology. In\n[\n9\n]\nWilkinson describes the public demonstration of Pilot ACE in\n1950\n, at which the machine, incredibly, ran much better and for much longer than it ever had before. After the successful demonstration, Wilkinson realised for the first time that he would now be expected to do useful work on the Pilot ACE computer, which, until that moment, he had only though of as a means of convincing others that the ACE project had potential and should be continued.\nHe continued work becoming more involved in writing many high quality papers on numerical analysis, particularly numerical linear algebra. Having written subroutines to do floating-point arithmetic before a computer had been built to run them on, he was now in the fortunate position of being able to progress rapidly, gaining experience with floating-point computing. In numerical linear algebra he developed backward error analysis methods. He worked on numerical methods for solving systems of linear equations and\neigenvalue\nproblems. He wrote over\n100\npapers and was best known for his books\nRounding Errors in Algebraic Processes\n(1963)\nand the impressive\nThe Algebraic Eigenvalue Problem\n(1965)\n.\nAs well as the large numbers of papers on his theoretical work on numerical analysis, Wilkinson developed computer software, working on the production of libraries of numerical routines. The NAG\n(\nNumerical Algorithms Group\n)\nbegan work in\n1970\nand much of the linear algebra routines were due to Wilkinson.\nHe received many awards for his outstanding work. He was elected a Fellow of the\nRoyal Society\nin\n1969\n. He received the\nA M Turing\naward from the Association of Computing Machinery and the\nJ von Neumann\naward from the\nSociety for Industrial and Applied Mathematics\nboth in\n1970\n. He was awarded honorary doctorates by Brunel\n(1971)\n, Heriot-Watt\n(1973)\n, Waterloo\n(1978)\n, and Essex\n(1979)\n.\nGeorge Forsythe\nwrote in\n1960\n:-\nIn my opinion Wilkinson is single-handedly responsible for the creation of almost all of the current body of scientific knowledge about the computer solution of the problems of linear algebra.\nHe is described in\n[\n4\n]\nas having extrovert characteristics but being a reserved and private man:-\nDiscussion with him was not always easy because the competitive instinct led him to introduce topics about which he had read and remembered a great deal.\nHe was described by a colleague as:-\n... always optimistic and jovial, very fair and impartial in his evaluations, liked virtually everybody, had a nearly overpowering enthusiasm for many things outside mathematics. ... he was always competitive.\nHis main interest outside mathematics was music, on which he was extremely knowledgeable, and he was also an expert on wines. He died at home from a heart attack.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Number Theory"
  ]
}