{
  "nome_completo": "Johann Gabriel Doppelmayr",
  "nome_curto": "Johann Gabriel Doppelmayr",
  "ano_nascimento": "1677",
  "ano_morte": "1750",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Doppelmayr/",
  "lugar_nascimento": "Nuremberg, Germany",
  "lugar_morte": "Nuremberg, Germany",
  "biografia": "Johann Gabriel Doppelmayr\n's name is sometimes given as Doppelmaier or Doppelmair. His father, Johann Siegmund Doppelmayr, was a merchant but had deep interests in science. Writing about his father later in his life, Doppelmayr explained how his hobby was carrying out experiments in physics. He was the first to introduce a vacuum air pump into Nuremberg.\nJohann Doppelmayr entered the Aegidien\nGymnasium\nin Nuremberg in\n1689\n. The Aegidien Gymnasium had been founded in the\n16\nth\ncentury by the Swiss Protestant reformer Ulrich Zwingli. Doppelmayr was to return to this Gymnasium as a professor later in his career. From Nuremberg, Doppelmayr went to the University of Altdorf in\n1696\nwhere he studied law, mathematics and natural philosophy. In\n1698\nhe completed a dissertation on the sun, then went on to attend lectures on mathematics and natural philosophy by Johann Christoph Sturm who was considered the leading experimental physicist in Germany at the time. Doppelmayr submitted his dissertation\nDe visionis sensu nobilissimo, ex camerae obscurae tenebris illustrato\nⓉ\n(\nOn the most noble visions illustrated with the 'camera obscura'\n)\nin\n1699\n. For a short time in\n1700\nhe studied physics and mathematics at the University of Halle where he also learnt French and Italian, then spent two years travelling in Germany, Holland and England. Until his visit to the University of Halle he had kept his options open of making a career in law or in mathematics and physics, but in\n1700\nhe made the definite decision to give up his study of law and to concentrate on mathematics and science.\nFirst Doppelmayr went to Berlin in September\n1700\nfrom where he moved on to Franeker and Amsterdam in Holland before arriving in Utrecht. There he spent two months, again studying mathematics and physics, but here also improving his language skills by studying English. From Utrecht, he moved on to Leiden in April\n1701\nwhere he was welcomed by Lothar Zumbach von Koesfeld, the professor of astronomy, who invited him to live in his home during his visit. Doppelmayr made good use of his time, as he did in every place he visited, learning instrument making skills in Leiden such as how to make telescopes and how to grind lenses. Having quickly mastered these new skills, he moved on again, going this time to Rotterdam before crossing to England in May\n1701\nwhere he visited Oxford and London. Before the end of\n1701\nhe was back in Holland, returning to Leiden for a five month visit to attend astronomy lectures by Lothar Zumbach von Koesfeld. Leaving Leiden he returned to Nuremberg but took a long route which involved visits to Utrecht, Deventer, Osnabrück, Hannover, Kassel, Marburg, Giessen, Wetzlar and Frankfurt. By August\n1702\nhe was back in Nuremberg having learnt  awide range of mathematical and scientific skills which at that time were not available in Germany.\nHe clearly made a good impression on people during these visits since he was later elected to membership of a number of scientific societies including the\nBerlin Academy\n, the\nGerman Academy of Scientists Leopoldina\n(\nthe Kaiserlich Leopoldinische Akademie der Naturforscher\n)\nin Halle\n(1715)\n, the\nRoyal Society\n(6\nDecember\n1733)\n, and the\nSt Petersburg Academy\n(1740)\n.\nDoppelmayr was appointed professor of mathematics at the Aegidien Gymnasium in Nuremberg in\n1704\nand he remained there for the rest of his life. In February\n1716\nhe married Susanna Maria Kellner who was eighteen years old at the time\n(\nDoppelmayr was\n38\nyears old by this time\n)\n. They had four children, although only one survived beyond infancy, and Susanna died at the age of\n31\nin\n1728\n. Although Doppelmayr was to remain at the Aegidien Gymnasium in Nuremberg for the rest of his life, this was very much his choice since he had opportunities to move to much more prestigious positions. In\n1723\nhe was honoured with the offer of the chair of mechanics at the Academy of St Petersburg. He turned down this offer, however, suggesting instead that\nNicolaus\n(\nII\n)\nBernoulli\nbe offered the post. Indeed\nBernoulli\ndid accept the chair at the Academy of St Petersburg.\nDoppelmayr wrote on astronomy, spherical trigonometry, sundials and mathematical instruments. He used his language skills to translate a number of texts on astronomy, geography and scientific instrument into German or Latin. For example he translated the English text\nAstronomia Carolina: A New Theorie of the Coelestial Motions\nby Thomas Streete into Latin, publishing his translation of the\n1665\noriginal in\n1705\n. The French mathematics text\nTraité de la construction et des principaux usages des instrumens de mathématiques\nⓉ\n(\nTreatise on the making and the main uses of mathematical instruments\n)\nby Nicolas Bion, published in Paris in\n1709\n, was translated in German by Doppelmayr in\n1712\nas\nNeu-eröffnete mathematische Werck-Schule Nicolai Bion\nⓉ\n(\nNew mathematical works of Nicolai Bion.\n)\n. As a final example, Doppelmayr translated the English text\nDiscovery of a new World in the Moon\nby\nJohn Wilkins\n(\nwhich had been published in London in\n1638\nand was a vigorous defence of the ideas of\nCopernicus\n)\ninto German publishing it as\nJohannes Wilkins, des fürtrefflichen Englischen Bischoffs zu Chester Vertheidigter Copernicus, oder Curioser und gründlicher Beweiss der Copernicanischen Grundsätze\nⓉ\n(\nA German translation of the Discovery of a new Worlde in the Moone by John Wilkins.\n)\nin\n1713\n.\nDoppelmayr also wrote a book of tremendous value giving biographical details of\n360\nmathematicians and instrument makers of Nuremberg from the\n15\nth\nto the\n18\nth\ncentury. This had the lengthy title\nHistorische Nachricht von den Nürnbergischen Mathematicis und Künstlern, welche fast von dreyen Seculis her durch ihre Schriften und Kunst-Bemühungen die Mathematic und mehrere Künste in Nürnberg vor andern trefflich befördert und sich um solche sehr wohl verdient gemacht zu einem guten Exempel, und zur weitern rühmlichen Nachahmung\nⓉ\n(\nPast news of the Nuremberg mathematicians and artists ...\n)\nand was published in\n1730\n.\nPerhaps the most famous of all of the works by Doppelmayr is the\nAtlas Coelestis\nⓉ\n(\nAtlas of the heavens\n)\nwhich he published in Nuremberg in\n1742\n. The full Latin title is closer to a summary of the text than to a title so let us quote it in full:\nAtlas Coelestis in quo Mundus Spectabilis et in eodem Stellarum omnium Phoenomena notabilia, circa ipsarum Lumen, Figuram, Faciem, Motum, Eclipses, Occultationes, Transitus, Magnitudines, Distantias, aliaque secundum Nic. Copernici et ex parte Tychonis de Brahe Hipothesin. Nostri intuitu, specialiter, respectu vero ad apparentias planetarum indagatu possibiles e planetis primariis, et e luna habito, generaliter celeberrimorum astronomorum observationibus graphice descripta exhibentur, cum tabulis majoribus XXX\nⓉ\n(\nOf all things  visible in the world of the stars in the Atlas Coelestis, and their notable phenomena, with regard to the shape of their light, the face of a motion, eclipses, occultations, transits, magnitudes, distances, and other, according to Nic. Copernicus and Tycho Brahe. Our view, in particular, with respect to possible appearances of the planets researched from the various planets, and the moon, having been described in general terms by the most celebrated astronomers. Observations are graphically presented, with\n30\nmaps of the stars.\n)\n[\n1\n]\n:-\nBesides star charts and a selenographic map, the Atlas includes diagrams illustrating the planetary systems of\nCopernicus\n,\nTycho Brahe\n, and Riccioli; the elliptic theories of\nKepler\n,\nBoulliau\n, Seth Ward, and\nNicolaus Mercator\n; the lunar theories of\nTycho Brahe\n,\nHorrocks\n, and\nNewton\n; and\nHalley\n's cometary theory.\nWe mentioned above Doppelmayr's translation of a mathematics text. He also wrote several mathematics texts himself, including one on spherical trigonometry and\nSumma geometricae practicae\nⓉ\n(\nSummary of practical geometry\n)\n. He was an enthusiastic experimental physicist and he published\nPhysica experimentis illustrata\nⓉ\n(\nIllustrated physics experiments\n)\nin\n1731\nwhich describes\n700\nexperiments which Doppelmayr had carried out himself.\nCurtis Wilson\n[\n1\n]\nwrites:-\nDoppelmayr's electrical investigations continued until his death, which followed a severe shock suffered while experimenting with one of the newly invented condensers.\nIn this description Wilson follows a number of reports written shortly after his death which made these claims. However this cause of death is not universally accepted by historians and more recent research has led to several making the claim that Doppelmayr's electrical experiments were completed several years before his death so, these sources claim, could not have been the cause of his death.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry"
  ]
}