{
  "nome_completo": "Johannes Hevelius",
  "nome_curto": "Johannes Hevelius",
  "ano_nascimento": "1611",
  "ano_morte": "1687",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hevelius_Johannes/",
  "lugar_nascimento": "Danzig, now Gdańsk, Poland",
  "lugar_morte": "Danzig, now Gdańsk, Poland",
  "biografia": "The first problem that we have to address is the different forms of\nJohannes Hevelius\n's name. Various forms of the family name are found such as Hevel, Hövel, Hewel, Höfelcke, Hewelcke, Höwelcke, Höfelius, Hövelius, Höwelius, and Heweliusz. A German may have addressed him as Johann Hewel or  Johann Howelcke, while a Pole  might have addressed him as Jan Heweliusz. Among all these forms we have not given the one by which he is today known, namely Johannes Hevelius. Certainly the subject of this biography was the first to use this particular Latin form of his name. His father was Abraham Höwelcke\n(1576\n-\n1649)\nand his mother was Cordelia Hecker\n(1576\n-\n1655)\n. Abraham owned a profitable brewery and he was the owner of several houses. Johannes was one of a large family, having three brothers and six sisters. He was the only one of the four brothers to survive beyond early childhood. The family were of German and Czech ethnicity and were German speaking although the city of Danzig was under control of Poland. Polish was spoken in the area and even as a child he would have had some knowledge of that language.\nWhen Johannes was seven years old, he entered the\nGymnasium\nin Danzig, studying there for six years. These were the years of the Thirty Years War but the area around Danzig was largely unaffected. However, by\n1624\nproblems caused the Gymnasium to be temporarily closed and Johannes's parents sent him to a school in the small village of Gondeltsch near Bromberg\n(\nPolish Bydgoszcz\n)\n. This was a Polish speaking area and the idea was that he would become fluent in Polish. In\n1627\nhe returned to the Gymnasium in Danzig where he became fascinated by mathematical topics. The mathematics teacher, Peter Krüger, was inspirational and, having an interest in astronomy, he soon transmitted this interest to the young Hevelius. Wishing to take these studies beyond anything that might reasonably be taught at the Gymnasium, Hevelius took private lesson with Krüger in which he learnt the full range of astronomical learning of the period. Not only did Krüger teach Hevelius theoretical astronomy, but he also taught him to construct astronomical instruments both from wood and from metal.\nAt the age of nineteen, in\n1630\n, Hevelius boarded a ship bound for Holland. He was off to study law at the University of Leyden, but his fascination with astronomy was enhanced when an eclipse of the sun occurred while he was on board the ship. His observations would form part of a publication later in his life. Although he was a conscientious student of jurisprudence at Leyden he still found time to study mathematics, in particular optics and mechanics. After a year he set off from Leyden to undertake further travels, going first to England where he lived for around a year in London. He then moved on, going to France in\n1632\nwhere he sought out leading astronomers such as\nGassendi\nand\nBoulliau\nin Paris. Hevelius's plans to go next to Italy to visit\nGalileo\nhad to be cancelled when he received a message from his parents to return to Danzig, which he did in\n1634\n. Being his parents' only son, they wanted him to be in a position to take over the family brewery business and stop travelling round Europe visiting leading astronomers.\nBack in Danzig he followed his father's wishes, undertaking the necessary studies of the customs and laws of the city so that he was admitted to the Brewer's Guild in\n1636\n. By this time he was a married man, having married Katharina Rebeschke, the daughter of a wealthy citizen of Danzig, in the previous year on\n21\nMarch. He now settled down to a life in business and civic duties. Astronomy, which he had loved so much, was now a thing of the past and his life had fully moved into this new phase. However, his old teacher Krüger was by now nearing the end of his life and Hevelius visited him early in\n1639\n. He encouraged the best pupil he had ever had not to give up astronomy but rather to get back his interests. This half succeeded but the event which sealed things was an eclipse of the sun which occurred on\n1\nJune\n1639\n. His interest had been awoken sufficiently by Krüger that Hevelius observed the eclipse and the old love of astronomy came flooding back. He was again totally hooked and from that time on spent every bit of his leisure time working on astronomy.\nHevelius had a brewery to run which could have taken up much of his time. However, his wife Katharina took over much of the administrative work associated with the brewery so that Hevelius could devote much of his time to constructing astronomical instruments, grinding lens for telescopes, making mounts for quadrants, sextants and other essential tools for a well equipped\n17\nth\ncentury observatory. He also corresponded with most of the leading astronomers of Europe. In\n1641\nhe was elected an alderman of Danzig, an event which meant that despite his wife's efforts running the brewery, Hevelius was again busy with duties which kept him away from astronomy. He also became a magistrate but the added pressure on his time did nothing but make him more determined that his work on astronomy would not suffer. In\n1647\nhe published his famous text\nSelenographia\nⓉ\n(\nLunar mapping\n)\n. This contained\n60\ncarefully executed drawings of the moon's surface, which he had observed using a\n12\nft telescope, as well as his discovery of the moon's libration in longitude. In\n1649\nhis father died and Hevelius had sole responsibility for running the brewery. His determination to devote himself to astronomy meant that, remarkably, he had by now the finest observatory in the world installed at his home in Danzig.\nIn March\n1662\nHevelius's wife Katharina died. In the following year he married\nCatherina Elisabetha Koopman\n, the sixteen year old daughter of a rich Danzig merchant. Unlike his first wife, Elisabetha was deeply interested in astronomy and details of her contributions are included in our biography of\nElisabetha\nin this archive. These include both mathematical calculations and observing with her husband's instruments. Hevelius had no children with his first wife but with his second wife he had a son and three daughters. The son died at the age of one year but the daughters all married and had children of their own. Hevelius continued to increase his reputation across Europe, being awarded a pension by the French in\n1663\nand being elected to the\nRoyal Society of London\nin\n1664\n. In fact Hevelius had been in correspondence with Oldenburg, the secretary of the\nRoyal Society\n, from January\n1663\nand they exchanged around\n80\nletters over the next\n14\nyears\n(\nOldenburg died in\n1677)\n. Hevelius also corresponded with most of the leading astronomers including\nWallis\n,\nFlamsteed\nand\nHalley\nin England, and\nGassendi\nand\nBoulliau\nin France. He was involved in a dispute with\nHooke\nover whether his observations made with instruments without telescopic sights were of any value. This dispute began when\nHooke\nread Hevelius's\nMachina Coelestis\nⓉ\n(\nThe heavenly machine\n)\n(1673)\n. As well as giving details of his observations, Hevelius described his methods of using naked eye observations for positions of celestial objects. Of course\nHooke\nwas right, in that the future of astronomy was to use instruments with telescopic sights, which led to considerably more accurate coordinates. However,\nHooke\nexpressed himself in such a rude manner, Jardine says\n[\n2\n]\n:-\n... an aggressive polemic, combined with a challenge, and a claim that he could produce better results himself ...\nthat one has to have sympathy with Hevelius who at first expressed himself with courtesy in a complaint to the\nRoyal Society\nwho had published\nHooke\n's attack. The result was that\nHalley\nwas sent to visit Hevelius to see which was correct. He arrived in Danzig on\n26\nMay\n1679\nbringing with him a\n2\n-foot quadrant with telescopic sights. Rather surprisingly the tests proved inconclusive as to whether the instrument with telescopic sights was more accurate. This was due partly to the quality of Hevelius's instruments and partly due to his extraordinary skill as an observer.\nThe row continued to rage at the\nRoyal Society\n.\nWallis\n, who took the opportunity to have a go at\nHooke\nwith whom he had fallen out, reviewed Hevelius's letter in the\nPhilosophical Transactions\nof the\nRoyal Society\nof\n1685\n. He noted that Hevelius\n[\n2\n]\n:-\n... wonders that\nMr Hooke\n, who has never yet performed, or so much attempted, anything of this kind, should take it upon himself to censure others. Thinking that it more becomes learned men not to boast of what they can, or will, or mean to do, but rather to let the world know what they have done. And when\nMr Hooke\nhas performed such things so much more accurately, it will then be time to tell the world what they are.\nTwo secretaries of the\nRoyal Society\nresigned over allowing this to appear in the\nPhilosophical Transactions\n. Sadly\nHooke\nhad made himself widely disliked so the fact that he was on the right side scientifically put many of his colleagues in a quandary about whether to support him or Hevelius. For example,\nWilliam Molyneux\nwrote to\nFlamsteed\n:-\nI hear\nDr Wallis\nhas taken up the cudgels and vindicated Hevelius against\nHooke\n.\n[\nIf so\n]\nI should be very glad if the Dr and I have jumped together.\nSeveral years before this, however, misfortune had come Hevelius's way. His home and observatory were destroyed by fire, possibly deliberately started, on the night of\n26\nSeptember\n1679\n.\nYou can read an account of the\nHevelius fire\n.\nHevelius was\n68\nyears old at this time and most men would have given up having lost the instruments they had spent a lifetime building as well as his books and the data he had gathered but not yet published. However, Hevelius showed remarkable determination and, by August\n1681\nhe had rebuilt his observatory, although the new instruments were not of the same quality as those which had been destroyed. In\n1685\nhe published\nAnnus climactericus\nwhich continued the work of the second volume of\nMachina Coelestis\nⓉ\n(\nThe heavenly machine\n)\n(1679)\n. Most copies of the second volume of\nMachina Coelestis\nⓉ\n(\nThe heavenly machine\n)\nhad been destroyed in the fire but he had already sent out a small number of copies, some surviving to this day.\nAnnus climactericus\nⓉ\n(\nThe critical year\n)\ncontains, in addition to the observations he and his wife had made following the fire, his observations of the variable star named by him 'Mira' -- it is still known by that name today.\nAround the beginning of November\n1686\nHevelius became ill and was admitted to hospital. He died on his birthday twelve weeks later. He was buried in St Catherine's Church in Danzig, on\n13\nFebruary\n1687\n. This was not, however, the end of Hevelius's contributions, since three books were published by his widow after his death. Further information about these works can be found in the biography of\nCatherina Elisabetha Koopman Hevelius\n.",
  "math_areas": []
}