{
  "nome_completo": "Johannes Boersma",
  "nome_curto": "Johannes Boersma",
  "ano_nascimento": "1937",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boersma/",
  "lugar_nascimento": "Marrum, The Netherlands",
  "lugar_morte": "Eindhoven, The Netherlands",
  "biografia": "It is difficult to know the best name to give\nJohannes Boersma\nin this article since, from a young age, he was known as Joop. His family, friends and colleagues all called him Joop throughout his life, yet if a colleague from abroad arrived to work with him and asked \"What name would you like to be known by?\" he would have answered \"Call me John.\" We shall simply refer to him as Boersma.\nBoersma was born in Marrum, a village near the north coast of the northern coastal province of Friesland, Times were difficult during World War II but the ending of the war made a strong impression on the eight year old boy. Fifty years later he wrote\n[\n2\n]\n:-\n... on May\n5\nth\n, I plan to go to my  native province of Friesland to attend the commemoration of the liberation in\n1945\n. There will be a long train of allied army trucks and tanks going through the province, and I want to watch them at the same place where I stood\n50\nyears ago.\nHis father was the headmaster of a local junior high school, and Boersma attended his father's school for a while but soon found that he had progressed beyond what was taught in the school. His parents, wanting to see their very able young son stretched in his education sent him to a higher grade school. This school had a curriculum designed to take a pupil to university entrance level by the age of\n18\n, but Boersma was no typical pupil and he had completed the whole syllabus by the age of\n15\n. His teachers reported that they were not competent to teach him any higher studies and advised that, despite his age, he begin his university studies.\nBeing young to enter university, his parents would have liked him to attend a local university. This, however, was impossible since the province of Friesland had no university. The nearest university was the University of Groningen and he began his studies in the Department of Mathematics and Physics there in October\n1952\n. One of the biggest influences on Boersma was a mathematician who was not at the University of Groningen, but rather worked at the Philips Research Laboratories in Eindhoven. In\n1956\nBoersma spent a few months working at the Philips Research Laboratories to gain industrial experience. Christoffel J Bouwkamp was a mathematician, an expert on diffraction theory, who was working at the Laboratories and he became Boersma's advisor. Although he could not be Boersma doctoral supervisor, since he did not have a university position, still he was a large influence on Boersma's research while his official thesis supervisor at Groningen was Adriaan van de Vooren, an expert in fluid mechanics.\nOne of Boersma's interests from an early stage in his university career was the G-function of Cornelis Simon Meijer\n(1904\n-\n1974)\n. Meijer had received a doctorate from Groningen in\n1933\nfor his thesis\nAsymptotische Entwicklungen Besselscher, Hankelscher und verwandter Funktionen\nⓉ\n(\nAsymptotic developments of Bessel, Hankel and related functions\n)\nwritten with Johannes van der Corput as his advisor and, two years later, introduced the\nG\nG\nG\n-function as a generalisation of special functions. He lectured to Boersma at Groningen and inspired him to work on the\nG\nG\nG\n-function. In\n1956\nBoersma wrote an essay\nOn a function, which is a special case of Meijer's G-function\nwhich won a prize from the University of Groningen and began an interest in the G-function which was to last throughout his life. He published this essay as a paper three years later but it was not his first publication. He published\nComputation of Fresnel integrals\n(1960)\nwhich gave a table of coefficients for approximation of Fresnel integrals by finite power series. Also in\n1960\nhe published\nMathematical theory of the two-body problem with one of the masses decreasing with time\n. Here is his own summary of this paper:-\nThe two-body problem with one of the masses decreasing with time down to a certain rest mass is mathematically described and numerically solved by aid of the digital computer ZEBRA. We are particularly interested in the kinematical properties of the system with respect to the original centre of gravity, obtained after the mass decay has stopped. Tables are given for the velocity of the centre of gravity of the two bodies and the major semi-axis in the case of an elliptic relative orbit, while in the case of a hyperbolic relative orbit the absolute velocities at infinity of the two bodies and the angle between their directions are given. These tables are entered for specific values of the rest mass of the decaying body and of the rate of the mass decay.\nIn addition to the publication of his prize-winning essay, the year\n1961\nsaw him publish two further papers\nTwo formulas relating to elliptic integrals of the third kind\nand\n(\nwith W Kamminga\n)\nCalculation of the volume of intersection of a sphere and a cylinder\n. In\n1964\nhe was awarded his doctorate by the University of Groningen for his thesis\nBoundary value problems in diffraction theory and lifting surface theory\n. The thesis was published in the same year and reviewed by R C MacCamy:-\nThis paper contains a comprehensive discussion of some recent results on axially symmetric diffraction problems. The discussion centres around the use of integral\nrepresentation theory\nto reduce such problems to Fredholm\nintegral equations\nwhich are suitable for the study of low frequency oscillations. A lengthy report is given of the work of other authors on this subject, and the paper itself contains still a different version. The author also offers a discussion of two-dimensional diffraction by a slit, using similar methods. These last ideas are new, as far as the reviewer knows. Various problems in lifting surface theory are also discussed in the paper. Again, there is a detailed review of existing results, as well as a new approach exploiting the axially-symmetric integral representation approach. Airfoils of circular and elliptic planform are studied. There is a discussion of oscillating wings in compressible flow. The results of the airfoil analysis are infinite systems of linear equations, from which numerical results can be obtained by truncation.\nAfter the award of his doctorate Boersma went in\n1965\nto the Courant Institute of Mathematical Sciences in New York. He worked as a Research Associate at the Courant Institute in the Division of Electromagnetic Research.\nNow Bouwkamp, as well as his position at Philips Research Laboratories, also held a part-time post at the Eindhoven University of Technology which had been founded in\n1956\n. He recommended Boersma for a professorship there and in\n1967\nhe was appointed a full professor. His inaugural lecture was\nBuiging, een spel van licht en schaduw\n(\nDiffraction, an interplay of light and shadow\n)\n. It was a position he held for the rest of his career, although he spent times abroad as a visiting professor. He taught a wide range of courses at the Eindhoven University of Technology including\n[\n2\n]\n:-\n... Complex Function Theory, Applied Analysis and Partial Differential Equations which provided the interesting combination of mathematical theory applied to physics problems.\nAfter he retired from the Eindhoven University of Technology he requested that there be no farewell festivities as were organised for most retiring staff, as he disliked being the centre of attention. He continued to make regular visits to the university but suffered serious health problems.\nLet us end by quoting from a tribute paid to Boersma by D S Jones\n[\n2\n]\n:-\n[\nBoersma\n]\nwas an applied mathematician of the top rank who solved difficult problems with great skill and ingenuity. His analytical ability was superb and profound so that few of his generation could match his accomplishments. Yet he was a modest man and that modesty kept the international acknowledgement of his successes at a lower level than it should have been. Although his senior by many years, I never considered him my junior. His prowess as a referee for papers submitted to journals was outstanding. His reports were unrivalled for the value of his comments. Often his report was as long as the original and no less informative. An author's theory had to be absolutely meticulous to earn John's approval. He must have pursued every argument in a submission to its logical conclusion, no matter how much time and effort were involved. A truly remarkable man whose contributions were highly appreciated by both authors and editors. The early death of such a brilliant participant is a huge loss to mathematics. Not only has a superior intellect left us, but also the helping hand he held out so willingly to others can assist no longer. Let us admire him while we can.\nBoersma was married to Lolkje, and they had a daughter Ykelien who studied medicine. Finally, we should mention that Boersma was interested in music and played the organ.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}