{
  "nome_completo": "Johann Karl Burckhardt",
  "nome_curto": "Johann Karl Burckhardt",
  "ano_nascimento": "1773",
  "ano_morte": "1825",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burckhardt/",
  "lugar_nascimento": "Leipzig, Saxony, now Germany",
  "lugar_morte": "Paris, France",
  "biografia": "There is some confusion with\nJohann Karl Burckhardt\n's name since he became a naturalised Frenchman later in his life and he adopted the name\nJean Charles Burckhardt\n. He was born into a large family, and since his father was rather poor, it was difficult for him to afford a good quality education for his sons. However, Burckhardt was sent to a high quality Latin school and his talents were soon recognised by the mathematics master who was able to support his pupil's education to a much higher level than would have been possible had he been totally dependent on family financial support. In addition to being enthusiastic about his studies of mathematics, Burckhardt purchased a German translation of\nLalande\n's astronomy text which inspired him to begin to make astronomical observations. He tried to make some astronomical observations but the telescope he had bought was not of sufficient quality to allow him to do anything useful. He then resorted to using old data on eclipses and lunar occultations of stars to compute the longitude of Wittenberg. As well as making astronomical calculations, he taught himself some advanced mathematics by studying\nEuler\n's books. At the\nGymnasium\nin Leipzig Burckhardt had good language tuition and gained expertise in French, English, Spanish, Dutch and Swedish.\nAt Easter\n1792\n, Burckhardt entered the University of Leipzig but his initial intention was not to study mathematics but rather to obtain a law degree. Soon, however, he changed this aim and for a short while began taking medicine courses. His real love had always been for mathematics and, giving up other topics, it was this subject in which he specialised. He was taught mathematics at Leipzig by\nCarl Friedrich Hindenburg\n, who encouraged him to undertake work on\ncontinued fractions\n, it was on this topic that published his first book\nTheorie der Kettenbrüche\nⓉ\n(\nTheory of continued fractions\n)\n(1794)\n. In\n1795\nhe was awarded a scholarship which had been donated by Karl Friedrich Kregel von Sternbach\n(1717\n-\n1789)\nto support the study of mathematics and astronomy.\nHindenburg\nadvised Burckhardt to use the scholarship to study at Gotha under Franz Xaver von Zach. He travelled to Gotha in Thuringia, the seat of Duke Ernst of Saxe-Gotha, in February\n1796\nand for\n22\nmonths worked under the direction of Zach. One of the foremost observatories at this time was the observatory on the Seeberg near Gotha which had been built by Zach, under the patronage of Duke Ernst, and completed in\n1791\n. One of the main aims of the observatory was to make a systematic search for comets and Burckhardt took part in this project. He also took part in a project to observe star transits.\nThe coadjutor of Mainz and of Worms, Karl Theodor Anton Maria von Dalberg, who later Archbishop-Elector of Mainz and Arch-Chancellor of the Empire, visited the Seeberg observatory several times and took a special interest in Burckhardt. On Zach's recommendation Hans Moritz von Brühl, a German diplomat and astronomer who lived for much of his life in London, England, offered Burckhardt a position as director of his observatory in Harefield, near London. But Burckhardt went to France rather than to England, for Zach had also recommended him to his friend\nJoseph-Jérôme Lalande\nin Paris. He made the decision to go to Paris because working for\nLalande\nhe would have as his assistants other competent astronomers who had been pupils of\nLagrange\n,\nLaplace\nand\nLalande\n. Paris became his second home and there he worked at both the Bureau des longitudes and the Observatoire de l'École militaire. Arriving in Paris towards the end of\n1797\n, he took some courses at the Collège de France, his salary being paid by the Duchesse de Gotha. He lived at the Observatory where he undertook a heavy workload\n[\n3\n]\n:-\nAs a linguist, he was eager to study current astronomical publications in their original form. He translated the first two volumes of\nLaplace\n's 'Mécanique céleste'\nⓉ\n(\nCelestial Mechanics\n)\nwhile reading the proofs; he also added some notes and double checked the calculations, made by\nAlexis Bouvard\n. On various occasions\nLalande\npraised Burckhardt for being a tireless observer, rapid calculator, and a translator making French science known in Germany. ... At the observatory of the École militaire, he actively participated in finalizing the catalogue to which Lalande's nephew, Michel Lefrançois and his wife,\nAmélie Harlay\n(\none of the very few women astronomers of the time\n)\n, were already engaged. The observations went up to\n1\nApril\n1801\n. In the same period, Burckhardt established a quick method for calculating the orbit of a comet given limited data, a method applied successfully to the orbit of the first asteroid discovered, by\nGiuseppe Piazzi\n, on\n1\nJanuary\n1801\n.\nIn\n1799\nhe took French nationality and from that time used the name Jean Charles Burckhardt. He was elected to the Institut National des Sciences et des Arts in\n1894\nand, three years later, succeeded\nLalande\nas director of the Observatoire de l'École militaire after the latter's death in\n1807\n.\nBurckhardt published articles in Zach's\nMonatlicher Correspondenz\n, Bode's\nJahrbüchern\nand in the\nAstronomischen Nachrichten\n. His two main works, however, were published in Paris in French:\nTables de la lune\nⓉ\n(\nLunar Tables\n)\n(1812)\nand\nTable des diviseurs pour tous les nombres du premier, second et troisième million\nⓉ\n(\nTable of divisors for all numbers up to four million\n)\n(1817)\n. The lunar table were drawn up using over four thousand observations and presented to the Institut and to the Bureau des Longitudes in December\n1811\n. The Bureau des Longitudes had to chose the best lunar tables for their astronomical almanac, the\nConnaissance des Temps\nⓉ\n(\nUnderstanding time\n)\n, so they appointed a committee consisting of\nLaplace\n,\nDelambre\n,\nBouvard\n,\nArago\nand\nPoisson\nto compare Burckhardt's tables with those of Johann Tobias Bürg, an astronomer working in Vienna, that were the most accurate available at the time. Burckhardt had used, probably for the first time, the method of least squares to find the best approximation from his data. The committee used a sum-of-squares method to compare Burckhardt's and Bürg's tables, coming to the conclusion that Burckhardt's were the most accurate. In fact the tables, published in December\n1812\n, were used for around\n50\nyears before being superseded.\nHis tables of divisors, published in\n1817\n, had been published in three separate parts, the first in\n1814\n, the next in\n1816\nand the final part in\n1817\n. He wrote a letter to the Institut on\n30\nSeptember\n1814\nrequesting funds to enable him to publish parts of his tables\n[\n5\n]\n:-\nDuring the period in which we were so anxious to carry on our scientific pursuits, I worked out the factors of the third and fourth millions. Madame Courcier has offered to print them if the Institut will contribute a thousand francs towards the expenses. This is only\n500\nfrancs for each million, although the second million alone has required a sacrifice of\n1000\nfrancs. I have a little repugnance at proposing this request; nevertheless I shall gain nothing except the uncomfortable labour of correcting the proofs, which probably no one after my death would ever attempt. On the other hand, I have seen in the reports of the past year that\n1500\nfrancs was given for the printing of botanical works, and yet that the mathematical section did not make any expenditure of a similar nature. Madame Courcier has a good opinion of the sale of this work, since the English have bought several copies of the second million; if this hope is not maintained, she will probably increase her demand to such an extent that it would seem perhaps advisable to profit by the offer which she now makes. I have the honour of being, with respect, Monsieur, Votre toute honoré et tout obeissant serviteur.\nIndeed the Institut did contribute the necessary\n1000\nfrancs, authorised by\nDelambre\n, the secretary of the Institut, on\n7\nNovember\n1814\n.\nBurckhardt was a member of various academies including the\nAmerican Academy of Arts and Sciences\nto which he was elected on\n22\nAugust\n1822\n. On the same occasion\nDelambre\n,\nPoisson\nand Bürg were elected to the\nAmerican Academy\n.\nWe have one final aspect of Burckhardt to consider, namely his views on the teaching of mathematics. We know of these since Jean-Denis Barbié Du Bocage, a leading geographer and fellow member of the Institut National des Sciences et des Arts, wrote to Burckhardt asking for his advice on the mathematical education of his son. Burckhardt's reply is reproduced in\n[\n5\n]\n. He wrote:-\nMonday,\n30\nAugust\n1813\nMy celebrated Colleague,\nI have thought a great deal since yesterday about the best thing to do for your son. It seems to me that there are two points which ought to be considered: First, that it is frequently the case that there are taught for long periods many things which are useless from the practical standpoint and for the purpose which I have in mind for your son, the result being that there is not left sufficient time for the necessary features. Second, that the pupil should not be discouraged in his mathematical studies by any difficulties which he may encounter.\nHere, then, is the plan which seems to me the most practicable:\n1\n. The teacher should present only those features of plane geometry which are necessary for the complete understanding of the theorems which form the foundation of surveying. He should therefore omit such non-essentials as the actual computation of the value of the number\n3\n.\n14159\n..., a thing for which your son would have neither the time nor the need.\n2\n.  After this the instructor should teach algebra up to and including equations of the second degree. The first chapters of\nEuler\nform a good model for this kind of work and also include the theory of logarithms. I believe that this study is necessary, if only for the purpose of knowing how to read and use those algebraic formulas which are so necessary in practical mathematics.\n3\n. Plane trigonometry.\n4\n. Spherical trigonometry, which should be preceded by certain necessary theorems of geometry which were not taken up in the earlier course. The treatment which M\nDelambre\nhas given in his 'Abrégé d'astronomie'\n(\nParis,\n1813)\nseems to me to merit preference.\n5\n. I have not mentioned solid geometry, but it is easy to determine a geographic position\n[\nreferring to M Barbié Du Bocage's standing as a leading geographer\n]\neven if ignorant that the cone is a third of a cylinder, &c, &c. The teacher may therefore give whatever the time permits.\nPerhaps the difficulty will lie in finding a teacher who can carry out this idea. The plan requires more work on his part, fewer private lessons and hence a diminished financial return. Perhaps, also, he may hesitate to make himself known through fear that his colleagues will decry him as disloyal to his profession. On the other hand it is quite possible to lead the teacher to see that this work, once done, will serve to assist others, since circumstances will often force parents to demand more expeditious teaching and such as is directed towards practical ends.\nWith respect to the necessary equipment, it should be ordered early, since the makers are often engaged for a long time ahead.\nFinally, on Nov.\n8\nand Nov.\n9\ncertain stars will be in eclipse about\n6\no'clock in the evening. If your son wishes to observe them with me, he may come about\n5\no'clock. If the weather should be unsettled, he would not need to come, for other opportunities will offer themselves.\nWith sentiments of high consideration, I am,\nYour servant and colleague ...",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}