{
  "nome_completo": "Johanna Salome Weber",
  "nome_curto": "Johanna Weber",
  "ano_nascimento": "1910",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weber_Johanna/",
  "lugar_nascimento": "Düsseldorf, Germany",
  "lugar_morte": "Farnham, Surrey, England",
  "biografia": "Johanna Weber\nwas the elder of two daughters in a poor farming family who had been living in Malmedy, Germany but moved to Düsseldorf before she was born. We note that Malmedy had been a mainly French speaking Catholic town but had been forced to become German speaking after the Franco-Prussian war of\n1870\n. Although it was a part of Germany when the Weber family lived there, it became part of Belgium in\n1919\n. Johanna's sister was born in Düsseldorf in\n1912\n, but the life of the family was tragically changed when World War I broke out and Europe was divided into two opposing forces. Johanna's father was called up for German military service and was killed in fighting in November\n1914\n. After the war ended in\n1918\nwith the defeat of Germany, some support was given to children who had lost their father in the war so that they might be able to obtain an education.\nJohanna attended primary school in Düsseldorf where she showed great abilities. Coming from a Catholic family, she was then given financial support to attend a convent school where she received her secondary education. Her teachers were impressed with her abilities and recommended that she continue her studies at university with the aim of becoming a school teacher. In\n1929\nshe began her studies of chemistry, mathematics and physics at the University of Cologne. Cologne is around\n50\nkm from Düsseldorf and there was a good train connection between the two cities taking about\n40\nminutes so Weber was able to live at home and commute to university. She studied at the University of Cologne for one year before deciding that she wanted to concentrate on mathematics. The University of Göttingen had an outstanding reputation for mathematics and Weber moved to Göttingen to continue her studies at the university there.\nIn\n1935\nWeber was awarded the degree of Dr. rer. nat.\n(\nDoctor of Natural Sciences\n)\nand, continuing with the recommendation from her school teachers that she become a secondary school teacher, she spent the next two years on a teacher training course. She qualified as a secondary school teacher in\n1937\n. Germany, however, had become a much changed country during Weber's years at university. Hitler and the Nazi party had come to power in\n1933\nand by the time that Weber qualified for a job as a secondary school teacher there was a condition that all school teachers were required to be members of the Nazi Party. Weber refused to join and so teaching was not open to her. She also felt that she had to help support her mother and sister who were still living in Düsseldorf. Weber's sister was frail and Weber always wanted to give her mother and sister both emotional and financial support so she took a job at the Krupp ammunition and armaments factory in Essen. Essen is only\n35\nkm from Düsseldorf so this put Weber in a position to be able to give her family her full support. The job did not make use of her considerable mathematical abilities, however, for little more than calculating skills were required.\nIn early\n1939\n, before the outbreak of World War II, Weber saw an advertisement for a mathematics position at the Aerodynamische Versuchsanstalt in Göttingen. This Experimental Aerodynamics Institute was headed by Albert Betz\n(1885\n-\n1968)\nand, although she had no knowledge of aerodynamics, she was delighted to be able to begin working there. Betz was an expert in aerodynamics and had taken over as head of the Aerodynamische Versuchsanstalt in\n1936\n, succeeding\nLudwig Prandtl\n. On the day she arrived, Weber was invited to an Institute social evening organised by Dietrich Küchemann\n(1911\n-\n1976)\n. At this event, as well as meeting Küchemann, she met his wife Helga. Küchemann had married Helga Praefcke in\n1936\nand they had three children Christine, Dietmar and Eva-Beate. Weber's friendship with the Küchemann family was important both in a social and professional way for the rest of her life. Weber shared her strong anti-Nazi feelings with both Dietrich and Helga Küchemann\n[\n8\n]\n:-\nSix months into the job, shortly before the outbreak of the Second World War, she had progressed to the point of being asked to give a talk, at one of the Aerodynamische Versuchsanstalt monthly seminars, on the aerodynamic features of vortex rings. She did this somewhat reluctantly - she was essentially a shy person - but after the talk she approached Küchemann and suggested that the work on vortex rings might have some bearing on the work he was doing, in a different group in Aerodynamische Versuchsanstalt, on engine cowlings and jet engine intakes. As a result, they began to work together, Weber not only doing the mathematics but also diversifying into wind tunnel testing and liaison with the workshops. Küchemann meanwhile, in consultation with the manufacturers, developed the research ideas and shaped the direction of their work.\nThroughout the war Weber worked at the Aerodynamische Versuchsanstalt at Göttingen. Along with Küchemann, she published a total of\n30\nreports between\n1940\nand\n1945\nsuch as:\nÜber die Strömung an ringförmigen Verkleidungen\n(\nin twelve parts\n)\n;\nDer Einbau von Kühlern\n;\nKennzahleinfluss bei einer Modelluftschraubenmessung\n; and\nMessungen an schräg angeblasenen ungestaffelten Kühlerblöcken bei parallelem Zu-und Abstrom\n. In\n1951\n-\n52\nthe US National Advisory Committee for Aeronautics published English translations of some of these reports, for example\nConcerning the flow about ring-shaped cowlings\n.\nOn\n9\nApril\n1945\nAmerican troops entered Göttingen and closed both the University and the Aerodynamische Versuchsanstalt. Almost exactly a month later, on\n8\nMay, Germany surrendered unconditionally. By August the Potsdam Conference had divided Germany into four military occupation zones; the Northwest Zone, which contained Göttingen, was controlled by Britain. The British authorities reopened the Aerodynamische Versuchsanstalt, encouraging the leading scientists to return and write reports on the work they had undertaken from\n1939\nto\n1945\n. Weber and Küchemann returned to work and began writing up their research projects.\nThe British wanted to make use of the German aeronautic skills and also were determined not to let the Soviet Union benefit from these skills. They set up Operation Surgeon which offered the scientists six-month contracts at the Royal Aircraft Establishment at Farnborough, England. Neither Weber nor Küchemann were keen to accept, but in October\n1946\nKüchemann changed his mind and accepted a six-month contract in the Aerodynamics Department at Farnborough. After settling in, he encouraged Weber to come to the Royal Aircraft Establishment at Farnborough and in August\n1947\nshe accepted. In\n1948\nHelga Küchemann and the three Küchemann children joined them at Farnborough. Weber was the only woman among the German scientists coming to the Royal Aircraft Establishment and she was given accommodation in the Royal Aircraft Establishment staff hostel. She, like all the other German scientists arriving in Britain, was designated as an \"enemy alien\" but she found the arrangements suited her well. In an interview in\n2000\nshe said:-\n... the English people typically are such a friendly lot to foreigners, certainly the women, ... I was an odd one, but they all wanted to be kind to me. ... They were extremely friendly. I have never heard a bad word in all my life.\nKüchemann had spoken very highly of Weber to the staff at the Royal Aircraft Establishment so they knew she was an outstanding mathematician. She was assigned to the Low Speed Wind Tunnels Division of Aerodynamics Department led by Frances Beatrice Bradfield\n(1895\n-\n1967)\n, who had studied the mathematical tripos at Newnham College, Cambridge, and she began working with John Seddon\n(1915\n-\n1991)\nin the Low Speed Wind Tunnels Division of the Aerodynamics Department.\nThe design of a medium range bomber capable of carrying a nuclear weapon had been proposed by the aeronautics manufacturer Handley Page in May\n1947\nand Küchemann was asked to assess the proposal. He requested Weber's help and in September\n1947\nthey\n[\n8\n]\n:-\n... issued a joint paper\n[\n'Calculation of the velocity distribution at zero lift on the Handley Page crescent wing with suggested modifications to improve this'\n]\nassessing the aerodynamics of the proposed crescent-wing design and suggesting modifications to the wing and fuselage to improve its performance at high speeds. In the full aerodynamic development of the aircraft there were further revisions to the wing design, including its integration with the engine air intakes, using the work that Küchemann and Weber had done in Göttingen during the war.\nIn\n1953\nWeber and Küchemann published the book\nAerodynamics of Propulsion\nand in the Preface they explain both their aims and the work on which the book was based:-\nThe past decade has witnessed notable advancements in the aeronautical sciences. In particular, the greater variety of engines now in use and the requirements of high-speed flight have given rise to many new problems that have considerably widened the field of aerodynamics as applied to the production of propulsive forces . Thus anew branch of aerodynamics has been developed which we call here the aerodynamics of propulsion. It supplements the much older airfoil theory which is concerned with the production of lifting forces.\nIn this book an account is given of some of the work done in this field and problems that have arisen. Since it is a first survey, it cannot be expected to be exhaustive, and it necessarily reflects the authors' preferences. But it is hoped that the subjects selected will fill some gaps in the published material at present available and that they are  treated in a way which is appropriate and profitable both to designers in aircraft and engine firms and to research workers. This does not mean, however, that detailed working charts will be provided or \"recipes\" given; the aim is rather to help toward an understanding of the basic processes and flow phenomena which will enable the aerodynamicist to work out problems himself and to perform his part in the design of a propulsion unit, or its installation, if called upon.\nIt is hoped that the text will also be useful to the student of aeronautics. Just as, hitherto, no serious study of the subject could dispense with a comprehensive treatment of lifting surfaces, so a course in modern aeronautics must also provide a working knowledge of the methods and aerodynamic problems of propulsion. To assist the student and to widen the scope of the book, the treatment assumes no detailed knowledge of general aerodynamics or of higher mathematics, other than differential calculus.\nThe book is based on several monographs which were written at the suggestion of the British Ministry of Supply in\n1945\nto\n1946\nat the former Aerodynamische Versuchsanstalt Göttingen under the general editorship of Prof A Betz. We sincerely hope that the influence of our teachers, L Prandtl and A Betz, is still apparent. It was the persistent and friendly encouragement of the British Resident Officer at that time, Dr R M Goody, that persuaded us to undertake the present revision.\nFrom the time she arrived in England in\n1947\n, Weber had lived in the Royal Aircraft Establishment hostel until\n1953\n. On\n19\nMarch of that year she became a British citizen and soon after that the Küchemann family moved into a newly built house in Echo Barn Lane, Wrecclesham, a village on the southern outskirts of Farnham. The house had a spacious bed-sitting room and small kitchen designed to accommodate Weber. She lived there until\n1961\n.\nIn\n1956\nthe British government set up a committee to examine the possibility of a commercial aircraft capable of supersonic flight. This led to the British-French cooperation to build Concorde which made its first flight in\n1969\n[\n9\n]\n:-\nOne vital element in the success of the Concorde was provided by two émigré German scientists working at the Royal Aircraft Establishment - Johanna Weber, a mathematician ... and Dietrich Küchemann, a fluid dynamicist. What they came up with, in collaboration with Eric Maskell, an Royal Aircraft Establishment dynamicist, was, in the words of the Royal Aircraft Establishment's deputy director of the time, Morien Morgan, \"a heresy\". It was a slender delta, arrow-shaped wing concept which, for the era of supersonic flight, utilised a separated airflow, challenging what had been seen as basic principles of aircraft design. The thinking, set out in a\n1956\npaper, became reality with Concorde. Weber, Küchemann and Maskell provided the shape and the sums, others carried their ideas through.\nAfter working on the design of Concorde, Weber worked on the design of the wings for the first Airbus, the A\n300\nB. The Airbus proved a great commercial success with a remarkably low fuel consumption per passenger compared with its competitors.\nIn\n1961\n,\n34\nEcho Barn Lane, Wrecclesham, the cottage next door to the Küchemanns house, went on the market and Weber purchased it. It is worth noting that she had considerable difficulty obtaining a mortgage since at this time single women seldom were given mortgages. She lived there for nearly\n40\nyears. She retired in\n1975\nand, in the following year her friend and long-time co-author Dietrich Küchemann died unexpectedly. He had been writing the book\nThe Aerodynamic Design of Aircraft\nwith Weber's assistance and he had wanted her to be listed as a co-author but she had declined on the grounds that she did not want the responsibility. After Küchemann's death, she completed work on the book but after it was published in\n1978\nshe said:-\n... when the book came out and came to an end, I said no more aerodynamics, because from a human point of view my life had been in too narrow a channel.\nThe Preface thanks:-\nDr Johanna Weber ... whose contribution extends over a lifetime of collaboration with Professor Küchemann.\nHer last years are described by Dietrich Küchemann's son Dietmar\n(\nsee for example\n[\n8\n]\n)\n:-\nLater in life, and particularly after she had retired\n(1975)\n, and more particularly after my parents had died\n(1976\n,\n1987)\nI saw her somewhat differently. She had become somewhat more outgoing - she had, for example, taken some courses through the 'University of the Third Age' and she had made friends with some neighbours as well as seeing more of some of the local German friends that she had known but not seen much during her working years\n[\nmost of these German women / wives didn't work\n]\n. We found her to be very caring and generous, warm and gently humorous, and full of thoughtful, sound advice. Thus she became a kind of elder to our family\n(\ni.e. to me, my sisters and our children and their children\n)\nand a link to our parents' time in Germany\n[\nshe knew both sets of my grandparents\n]\n. Despite her catholic upbringing, she was not religious. Though she vowed to turn her back on aerodynamics when she retired, she, understandably, talked increasingly about her working life in her last years. I think she was very pleased and somehow very grateful for what she had achieved.\nShe took courses with the University of Surrey, first a psychology course and then a geology one. Her hearing began to become a problem for, although she could hear the lectures, she often found it impossible to hear the discussion which took place afterwards well enough to participate. For this reason she gave up the courses but, in her\n2000\ninterview, she commented:-\nThinking back, I probably gave it up too early but I mean, I didn't expect to live that long.\nIn\n2010\nWeber was\n100\nyears old and her health had become so poor that, as her centenary approached, she decided to move into a nursing home. She moved to the Hill House Nursing & Dementia Home about\n2\nmiles from the centre of Farnham. In\n2021\nshe celebrated her\n102\nnd birthday there\n[\n1\n]\n:-\nOn the\n8\nth August\n2012\none of our residents, Dr Johanna Weber, celebrated her\n102\nnd birthday along with friends and staff at Hill House. ... Everyone at Hill House Nursing Home wished her many happy returns and we hope she enjoyed the day.\nLet us end with this overview of Weber's contribution by John Green\n[\n8\n]\n:-\nJohanna Weber was a mathematician who, over a period of\n36\nyears, in collaboration with her colleague and contemporary, Dietrich Küchemann, laid the foundations for the world-leading position that the UK now enjoys in the aerodynamic design of civil aircraft wings. In turn, this wing design capability has contributed to the rise of Airbus to stand beside Boeing as one of the world's two dominant manufacturers of civil aircraft, with the consequent benefit to the European industry and economy. Many others have played their part in this success but, without the combination of Küchemann's vision and Weber's mathematical prowess, the advances in UK design capability between the\n1940\ns and\n1970\ns would probably not have occurred. Without those advances, the early Airbus aircraft might not have proved commercially successful and the industrial giant that is Airbus might conceivably not have arisen.",
  "math_areas": [
    "Algebra",
    "Calculus"
  ]
}