{
  "nome_completo": "Johann Franz Encke",
  "nome_curto": "Johann Franz Encke",
  "ano_nascimento": "1791",
  "ano_morte": "1865",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Encke/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Spandau, Germany",
  "biografia": "Johann Franz Encke\n's father was Johann Michael Encke\n(1749\n-\n1795)\n, a Lutheran clergyman at the Jacobikirche\n(\nSt James church\n)\nin Hamburg. His grandfather, Georg Friedrich Encke, had also been a pastor, in Altluneberg, near Bremen. His mother Marie Misler\n(1755\n-\n1811)\n, was the daughter of Johann Gottfried Misler, a civil servant, and Maria Schramm. Marie and Johann Michael Encke had nine children together, three daughters and six sons\n(\nthough one son died soon after birth\n)\n. Encke, the subject of this biography, was the second youngest. His youngest brother, August\n(1794\n-\n1860)\n, became Lieutenant General and Inspector of Artillery for the Prussian military.\nEncke's father died when he was still young, shortly after having been made an archdeacon. He managed to continue his studies, however, thanks to a schoolteacher named Hipp, who supported him without accepting any payment. Thanks to his financial support, Encke was able to attend secondary school in Hamburg in the prestigious Academic School of the Johanneum in\n1808\n[\n12\n]\n:-\nAt this College, then under the directorship of Johannes Gurlitt\n(1754\n-\n1827)\n, who enjoyed a high reputation for classical learning, the boy-student rapidly advanced, and in addition to considerable ability in Latin composition, his knowledge of Greek was sufficient to enable him to translate and enjoy the Lyrics of Pindar.\nHe completed the course two years later, standing out as one of the best students in the school. Encke's mother Marie was sick, so he initially wanted to become a doctor. Tragically, his mother died before he could enter university, so, under Hipp's advice, Encke decided to pursue further studies in mathematics.\nOn\n6\nOctober\n1811\n, he enrolled in Göttingen University to study under\nCarl Friedrich Gauss\n.\nGauss\nwas impressed with Encke's talents in astronomical observation and tried to have him work as an assistant in a small observatory in Ofen\n(\nanother name for Buda, not part of Budapest\n)\n. However, war interrupted Encke's studies and, in March\n1813\n, he enlisted to fight against Napoleon. He became a gunner, and eventually reached the rank of sergeant major, in the Hanseatic Legion. He fought in the battle of Göhrde forest\n(18\nSeptember\n1813)\n, which resulted in a defeat for the French forces. Encke was discharged in July\n1814\nand returned to his studies, but he was again interrupted in March\n1816\n, when Napoleon escaped from the island of Elba. This time as a lieutenant of artillery in the Prussian army, he was dispatched to the Netherlands but his unit never participated in Waterloo.\nWhen he came back to Göttingen, the position at Ofen was no longer available, so he instead went to work as an assistant at Seeberg Observatory, near Gotha, in July\n1816\n. Not only did\nGauss\nsupport his application for the position, but Encke had met the director of the observatory, Bernhrd von Lindenau\n(1780\n-\n1854)\n, during his time in military service. In February\n1817\n, when von Lindeau returned to politics, he became director of the observatory in all but name. He obtained the formal title in\n1822\n. Encke dedicated his time to astronomical observations and the computation of orbits of comets and minor planets. This earned him a prize, but also the recognition of both\nGauss\nand\nFriedrich Wilhelm Bessel\n.\nDuring his time in Seeberg, Encke used the records of the transits of Venus\n(\nfrom\n1761\nand\n1769)\nto derive the solar parallax with surprising accuracy. Encke's value of\n8\n.\n571\n\", given in\n1835\n, was accepted for some years but by\n1860\nthe accepted value became\n8\n.\n95\n\". In fact the present value is\n8\n.\n8\n\". He is most famous for giving his name to Encke's comet. The comet was not discovered by himself, but by Jean-Louis Pons in\n1818\n. In fact, Encke always referred to it as Pons's comet. Encke observed it in December\n1818\nand computed its orbit in January\n1819\n. He found it to be elliptical with an extraordinarily short period of about\n3\n.\n6\nyears. Encke identified the comet with the ones observed by\nPierre François-André Méchain\n(1786)\n,\nCaroline Herschel\n(1795)\nand Pons\n(1805)\n. He successfully predicted its return in\n1822\n. For his work on the comet he received his first Gold Medal from the\nRoyal Astronomical Society\nin\n1824\n(\nPons also received a silver medal in the same year\n)\n. Let us note that\nCharles Babbage\nalso received a Gold Medal from the\nRoyal Astronomical Society\nin\n1824\n. Because of the comet's short period, Encke was able to observe it a number of times. He noticed the comet's period suffered a steady decrease of about three hours each time. To explain this phenomenon, he theorised about the existence of a resisting medium, an ether, which filled interplanetary space. When Charles Pritchard wrote Encke's obituary\n[\n12\n]\n, Encke's incorrect explanation for the decrease in period was still accepted.\nIn\n1823\n, he married Amalie Wilhelmine Becker\n(1787\n-\n1879)\n, the daughter of a bookseller, writer and publisher in Gotha named Rudolf Zacharias Becker\n(1759\n-\n1822)\n. They had five children, three sons and two daughters, including Bertha Henriette Encke; Heinrich August Encke; Johann Hermann Encke and Sophie Marie Blase. One of the sons would later become a clergyman, like Encke's father and grandfather had been.\nOn\n11\nOctober\n1825\n, he became the director of the Berlin observatory following a strong recommendation from\nWilhelm Bessel\n. Berlin with the directorship, he was elected a member of the\nBerlin Academy of Sciences\nand received an honorary doctorate from the University of Berlin. This was significant since the war had stopped him from graduating at Göttingen. Considering the observatory in Berlin to be inadequate, Encke decided to move to a new building, equipped with better instruments\n(\nincluding a large Fraunhofer refractor\n)\n. Though Encke had been promised a new observatory when he took office, the promise would have not been realised so soon were it not for Alexander von Humboldt, who in\n1828\nappealed for aid to King Frederick William III. The construction started in\n1832\nand finished three years later. The building would be in use until two generations later, when Hermann Struve\n(1854\n-\n1920)\nmoved the observatory to Babelsberg in\n1913\n, further away\n(25\nkm\n)\nfrom the city centre.\nEncke was in charge of the\nAstronomisches Jahrbuch\n(\nAstronomical Yearbook\n)\n, founded by his predecessor, Johann Elert Bode, who edited it for fifty years. Under Bode, it had contained mostly ephemerides, but also articles and announcements of discoveries. Encke worked to improve the publication: he dropped the announcements, kept the articles\n(\nwriting many of them himself\n)\nand radically improved the ephemerides. The\nAstronomisches Jahrbuch\nwas, under Encke's direction, considered to have the best ephemerides in Europe, and was the cause of many reforms in similar publications like the British\nNautical Almanac\n. The\nRoyal Astronomical Society\nrecognised Encke's efforts and gave him a second Gold Medal in\n1830\n. In the ceremony, the President of the\nRoyal Astronomical Society\n, Sir James South, said:-\n[\nThe Nautical Almanac should\n]\n, rising, like a phoenix, from its ashes, be as much superior to Encke's\n[\nAstronomisches Jahrbuch\n]\nas Encke's is now superior to it.\nThis quote is a little obscure, so we also quote from\n[\n12\n]\nwhere things are clarified:-\nBy astronomers of the present day it is possible that Encke may be most highly estimated for the vast improvements which he introduced into the Berlin Ephemeris. The history of astronomical ephemerides is not a little varied and curious; a concise account of it will be found in the fourth volume of the 'Memoirs' of the\nRoyal Astronomical Society\n, on the occasion of the council of the Society presenting Encke, through their President, with a gold medal, for the part which he had taken in the improvement of the Berlin Ephemeris. Our own 'Nautical Almanac', at that day, viz. in\n1830\n, had fallen or had remained greatly behind the requirements of astronomers; but in speaking of the merits of the foreign Ephemeris, the report of the Council runs as follows: ''A gold medal has been voted to Professor Encke for the superb 'Ephemeris of Berlin'. It would be superfluous to dwell upon the merits of this well-known work, which, far outstripping all rivalry, must be considered as the only Ephemeris on a level with the present wants of the sciences.\" On presenting the medal, Sir James South, the President, adds, \"With the 'Berlin Ephemeris', an observatory scarcely wants a single book; without it, every one.\" It would, however, be disloyal, though in any other aspect it may be needless, not to add that what has just been said of the Berlin Ephemeris of\n1830\n, may with equal truth be predicated of the 'Nautical Almanacs' from\n1834\nto the present date; nevertheless the first impulse came from Encke and Berlin.\nEncke was involved in the discovery of the planet Neptune. He initially opposed the use of the telescope for the search of Neptune, but he eventually gave permission to Johann Gottfried Galle and Heinrich d'Arrest, two of his students, to carry it out, using a chart of the night sky printed by Encke between\n1830\nand\n1859\n. Neptune was found just before midnight on Encke's\n55\nth birthday, in\n1846\n. Encke was taken out of his birthday party to confirm the discovery and became the third person to see Neptune, at least knowing what he was looking at. As Director, Encke communicated the discovery to\nAstronomisches Nachrichten\n(\nAstronomical News\n)\n. Encke did not mention d'Arrest in this notice, something he would come to regret later in life.\nThrough observations, in\n1837\n, he found Encke's division\n(\nor Encke's gap\n)\nin the outer ring of Saturn. In\n1838\n, he became a member of the Board of Studies of the Military College, and in\n1844\n, he earned the title of Professor of Astronomy at the University of Berlin. In\n1846\n, he became a member of a Calendar Commission. Over the years, he was elected to many foreign academies. Encke also derived a method to calculate perturbations on the orbits of minor planets in\n1851\n, which was more convenient than\nGauss\n's previous method.\nFor a look at Encke's character we quote from\n[\n12\n]\n:-\nEncke, during the forty years of his professorship at Berlin, impressed the form and bent of his mind upon many pupils, who have ably contributed their share in the progress of astronomical knowledge. There is no greater proof of the real worth of a teacher, than when his pupils speak well and lovingly of him. They see the man in his weakness and in his strength. So it fared with Encke. They bear strong and uniform testimony to his eminent frankness and truthfulness; his labours, they say, were incessant, his recreations few; he was simple in his manners, and in all his habits temperate. Towards his coadjutors and assistants he showed a severe judgment, but he set them a severer example. A man such as this, absorbed in his work, and shutting himself away from the outer world, was likely to be sometimes abrupt, or laconic, or even incautious, in his utterances; these utterances, from their bluntness or their truthfulness, occasionally gave offence, and involved Encke in trouble. As age, however, grew upon him he became more gentle in his manners, and softer in his address; and in the presence of those whom he knew and trusted, the old man would sometimes review his own life, and urge his favourite pupils to draw from his own experience lessons of moderation and self-restraint, both in passing their judgments on the labours of others, and in the amount of labour which they felt it their duty to exact from themselves.\nIn November\n1859\n, he suffered a stroke. It was minor, but after a second, more serious, one in February\n1863\nhe decided to retire. He moved to Spandau, near Berlin, with one of his daughters and his wife. Wilhelm Julius Foerster succeeded him as director of the Observatory in\n1865\n. Encke died that same year, at the age of seventy-four.\nFor a version of Charles Pritchard's obituary of Encke\n[\n12\n]\n, see\nTHIS LINK\n.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}