{
  "nome_completo": "John Mortimer Brinkley",
  "nome_curto": "John Brinkley",
  "ano_nascimento": "1766",
  "ano_morte": "1835",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brinkley/",
  "lugar_nascimento": "Woodbridge, Suffolk, England",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "John Brinkley\n's mother was Sarah Brinkley, a daughter of the butcher John Brinkley, and his father was John Toler, a wine merchant. Sarah Brinkley and John Toler never married and, on\n18\nOctober\n1770\n, Sarah married Jacob Boulter of Boot Inn, Great Bealings, Suffolk, who was an innkeeper. Great Bealings is about\n4\nkm from Woodbridge, both towns lying north-east of Ipswich. Although John Brinkley was illegitimate, he was brought up by his mother and step-father who supported him financially.\nThere is some confusion concerning John Brinkley's date of birth. He was baptised in Woodbridge, Suffolk, on\n31\nJanuary\n1767\nbut some biographies give this incorrectly as\n1763\n. Brinkley's date of birth of July\n1766\n, which we give above, is a guess based on the following data. His memorial at Trinity College Dublin gives his age at death as\n70\nin September\n1835\nwhile his matriculation record at Gonville and Caius College, Cambridge gives his age as\n17\non\n29\nAugust\n1783\n, the date when he was admitted to the College. No date of birth can be consistent with both of these but July\n1766\nwould agree with the matriculation record and he would be in his\n70\nth\nyear when he died. His memorial tablet in Cloyne Cathedral gives his age at death as\n69\nyears, consistent with our guess. Other biographies give dates of birth from\n1763\nto\n1767\n.\nBrinkley's schooling was for a year with the Rev Mr Dimsdale in his school in Benhall, Suffolk, and for three years he received private tuition by the Rev Mr Black, of Woodbridge, at the Rev Black's home. He showed an excellent ability for mathematics when he was being schooled and that he had an exceptional talent for this topic became clear after he began his university education. He entered Gonville and Caius College, Cambridge as a\nsizar\non\n29\nAugust\n1783\n. As a sizar, Brinkley would have been charged reduced fees and living costs in exchange for working as a waiter for the other students at meal times and performing other duties. His abilities soon allowed him to be relieved of these duties and he matriculated in the Michaelmas Term\n(\nthe first term\n)\nof\n1784\nas a scholar, meaning that he had won a scholarship. During his time as an undergraduate, Brinkley spent two periods at the Royal Greenwich Observatory as an Assistant to the Astronomer Royal,\nNevil Maskelyne\n. The first was for seven weeks from\n23\nJune\n1787\nto\n9\nNovember\n1787\nand the second was for two months from\n27\nJanuary\n1788\nto\n25\nMarch\n1788\n. Brinkley had two reasons to undertake this work; he gained some observing experience and he earned some money to allow him to return to Cambridge to complete his studies. He graduated in\n1788\nas Senior\nWrangler\n, meaning that he was ranked at the top student. We note that Brinkley wrote the answers to the examination questions although the questions themselves were dictated. It was only two years after Brinkley graduated that written questions were produced and\n1790\nis considered the year that the Mathematical Tripos examinations began in Cambridge. Having graduated, Brinkley was one of a small number of students who took a further examination in higher mathematics for the Smith's prize which he was awarded. For four years, from\n1788\nto\n1792\n, Brinkley was a fellow of Caius College, Cambridge. During this time he was awarded an M.A. in\n1791\nand he also entered the Church. He was ordained deacon in Ely Cathedral in\n1790\nand became a priest at Lincoln Cathedral in the following year.\nHenry Ussher\n(1741\n-\n1790)\nwas the first Andrews Professor of Astronomy at Trinity College, Dublin. Following his death in\n1790\n, the Board of Trinity College wrote to the Astronomer Royal,\nNevil Maskelyne\n, asking if he knew of a suitable candidate to fill the position.\nMaskelyne\nhad no hesitation in recommending Brinkley although he was only\n24\nyears old. However, it was far from a foregone conclusion that he would be acceptable to the Board since there was another local candidate. John Stack\n(1760\n-\n1813)\n, had entered Trinity College Dublin in\n1777\n, and was made a fellow in\n1784\n. He served as secretary of the\nRoyal Irish Academy\nfrom\n1789\nto\n1791\nand had written the book\nA short system of optics\n(1787)\n. The Board of Trinity voted on which of the two candidates should be appointed and Stack was the winner by a very clear majority. However, the Provost of Trinity College, Hely Hutchinson\n(1724\n-\n1794)\nhad the power of veto over the Board's decisions and he vetoed their decision to appoint Stack. The reason the Board voted for Stack appears to be mainly because he was Irish and a fellow at Trinity College. The reason that Hely Hutchinson was strongly opposed to Stack was that he had corresponded with\nMaskelyne\nwho had replied that Stack's knowledge of astronomy was not\n(\nsee for example\n[\n9\n]\n)\n:-\n... sufficient to qualify him for the office of Professor.\nUnable to appoint Stack after the veto, the Board had little option but to appoint Brinkley at a meeting on the\n11\nth\nDecember\n1790\n. However, there was strong opposition following the announcement\n[\n1\n]\n:-\nThe national press of the day commented on the preference shown to the young Englishman, Brinkley, over his Irish rival. An animated controversy ensued. The Provost himself condescended to enter the lists and to vindicate his policy by a long letter in the \"Public Register\" or \"Freeman's Journal,\" of\n21\nDecember,\n1790\n. This letter was anonymous, but its authorship is obvious. It gives the correspondence with\nMaskelyne\nand other eminent astronomers, whose advice and guidance had been sought by the Provost. It also contends that \"the transactions of the Board ought not to be canvassed in the newspapers.\"\nIn\n1791\nBrinkley took up his appointment as the second Andrews Professor of Astronomy at Trinity College, Dublin. He also became Royal Astronomer of Ireland from\n1792\n. F E Dixon writes\n[\n9\n]\n:-\nBrinkley must have felt embarrassed, and also very anxious to justify his appointment. The lack of instruments did not deter him. As well as lecturing in astronomy he wrote a text book on the subject which went through at least six editions, with three more incorporating other authors' revisions, the most recent being as late as\n1886\n. He also found time for important mathematical research, and revolutionised astronomical calculations by introducing what is known as the \"method of least squares,\" by which it is possible to estimate accurate results and also the degree of accuracy achieved.\nAbout a year after he arrived in Dublin, Brinkley married Esther Weld, a daughter of Matthew Weld, the Sheriff of Dublin, of Molesworth Street, Dublin and Elizabeth Kane. John and Esther Brinkley had three children, John Brinkley\n(1793\n-\n1847)\n, Matthew Brinkley\n(1797\n-\n1855)\nand Sarah Jane Brinkley\n(1801\n-\n1827)\n.\nWhen Brinkley took up his roles as professor and Royal Astronomer at Dunsink Observatory, the Observatory was lacking in good equipment for observing. In particular Henry Ussher had negotiated with\nJesse Ramsden\n(1735\n-\n1800)\nfor a\n10\n-foot circle and this had been approved by the Board of Trinity. However,\nRamsden\ndiscovered that he had been too ambitious and he had great difficulty in making this very large instrument. When Brinkley was appointed to Dunsink Observatory, the instrument had still not been delivered and, as years went by, it still failed to be delivered.\nRamsden\nreduced the size, first to a\n9\n-foot circle and then, when even this was proving beyond his capabilities, an\n8\n-foot circle. When\nRamsden\ndied in\n1800\nthe\n8\n-foot circle was still not complete but construction continued. The problems with lack of quality instruments at Dunsink Observatory must have been a great frustration to Brinkley but, on the other hand, it led to a number of positive outcomes. It allowed Brinkley the opportunity to engage in mathematical research and to influence the reform of the teaching of mathematics at Trinity College, Dublin. At the time that Brinkley was appointed as Andrews professor of astronomy, Richard Murray was Professor of Mathematics, a post he held until\n1795\nwhen he became Provost. He was influential as a teacher but over the following years the teaching of mathematics at Trinity College did not introduce the latest developments and was very out of date. Brinkley was keen on the latest Continental developments in the calculus and played an important role in setting the scene for the reforms in mathematics teaching introduced by\nBartholomew Lloyd\nafter he became professor of mathematics in\n1813\n[\n12\n]\n:-\n[\nBrinkley\n]\nwas isolated from University life because of his position at Dunsink and it was perhaps because of this that he was able to take the lead in introducing a knowledge of continental mathematics and physics into Dublin without raising a hornet's nest of opposition in the University. He was the first Dublin professor to use the analytic notation early in the new century and this is of great significance in understanding the roots of the advanced analysis in Dublin.\nAs examples of Brinkley's mathematical papers we list the following seven papers\n(\nmany of which have long descriptive titles\n)\n:\nA General Demonstration of the Property of the Circle Discovered by Mr Cotes, Deduced from the Circle Only\n(1800)\n;\nA Method of Expressing, When Possible, the Value of One Variable Quantity in Integral Powers of Another and Constant Quantities, Having Given Equations Expressing the Relation of These Variable Quantities. In Which Is Contained the General Doctrine of Reversion of Series, of Approximating to the Roots of Equations, and of the Solution of Fluxional Equations by Series\n(1800)\n;\nGeneral Demonstrations of the Theorems for the Sines and Cosines of Multiple Circular Arcs, and Also of the Theorems for Expressing the Powers of Sines and Cosines by the Sines and Cosines of Multiple Arcs; to Which Is Added a Theorem by Help Whereof the Same Method May Be Applied to Demonstrate the Properties of Multiple Hyperbolic Areas\n(1800)\n;\nOn Determining Innumerable Portions of a Sphere, the Solidities and Spherical Superficies of Which Portions Are at the Same Time Algebraically Assignable\n(1802)\n;\nA Theorem for Finding the Surface of an Oblique Cylinder, with Its Geometrical Demonstration. Also, an Appendix, Containing Some Observations on the Methods of Finding the Circumference of a very Excentric Ellipse; including a Geometrical Demonstration of the Remarkable Property of Elliptic Arcs Discovered by Count Fagnani\n(1803)\n;\nAn Investigation of the General Term of an Important Series in the Inverse Method of Finite Differences\n(1807)\n;\nObservations Relative to the Form of the Arbitrary Constant Quantities, That Occur in the Integration of Certain Differential Equations; and, Also, in the Integration of a Certain Equation of Finite Differences\n(1818)\n.\nIn\n1813\nBrinkley published his textbook\nThe Elements of Astronomy\n. A second edition was published in\n1819\n. In\n1871\nJohn William Stubbs and Francis Brünnow published\nBrinkley's Astronomy\nwhich was a revised and partly rewritten version of Brinkley's original work. You can read the Preface to the\n1819\nedition and also John W Stubbs' Preface to the\n1871\nedition at\nTHIS LINK\n.\nRamsden\n's\n8\n-foot circle was completed by Matthew Berge after\nRamsden\n's death and was eventually delivered to the Dunsink Observatory in\n1808\n, twenty-three years after it had been ordered. Once the instrument was installed, Brinkley began the major research of his career, namely his attempts to measure the parallax of stars. He chose fifteen bright stars on the assumption that bright stars would be closer to the sun. He then attempted to measure their apparent movement against the faint distant stars using as a base line the diameter of the Earth's orbit round the sun.\n[\nThe Earth moves through the diameter of its orbit every six months.\n]\nOut of his fifteen original choices, Brinkley then chose four on which to concentrate his efforts. For three of these he found a parallax of\n1\narc-second while for the fourth he found a parallax of\n2\n.\n7\narc-seconds. He published several papers on this topic, for example:\nOn the Parallax of Certain Fixed Stars\n(1818)\n; and\nAn Account of Observations Made with the Eight Feet Astronomical Circle, at the Observatory of Trinity College, Dublin, since the Beginning of the Year\n1818\n, for Investigating the Effects of Parallax and Aberration on the Places of Certain Fixed Stars; Also the Comparison of These with Former Observations for Determining the Effects of Lunar Nutation\n(1821)\n. In the Preface to the second edition to his book\nElements of Astronomy\n(1819)\nBrinkley writes:-\nIt was expected that an opportunity might occur of again mentioning the subject of the parallax of the fixed stars. The observations lately made at our Observatory, part of an intended extensive course for re-examining this interesting question, confirm in the strongest manner those heretofore made. No doubt seems to remain that the changes observed are not occasioned by variations of refraction, or by any change in the instrument. They are explained by attributing a visible parallax to certain stars; and observations that have been made elsewhere seem by no means sufficient to overturn this conclusion.\nOther astronomers could not reproduce the results claimed by Brinkley on parallax and a controversy arose which went on for a considerable time. It was John Pond\n(1767\n-\n1836)\n, the Astronomer Royal, who argued with Brinkley from\n1810\nto\n1824\nabout his results. In fact Brinkley was wrong and his false results can be attributed to his\n8\n-foot circle. In fact the parallax of the stars investigated by Brinkley is too small to be discovered with his equipment. However, his work and methods on this topic made an important contribution and led eventually to the measurement of the parallax of\n61\nCygni by\nWilhelm Bessel\nin\n1838\n.\nWalter Scott, the famous author, visited Dunsink Observatory on\n17\nAugust\n1825\nand one of his party recorded the incident writing:-\nWe drove then four or five miles to the Observatory, where Dr Brinkley had a capital haunch of venison and everything suitable, except the company, which was rather insipid.\nAs a professor, Brinkley was not well paid so he sought additional funds from the Church. From\n1806\nto\n1826\n, he was collated to the prebend of Kilgoghlin, Elphin and, from\n1806\nto\n1810\n, to the rectory of Derrybrusk, Clogher. He was appointed vicar at Laracor, Meath, on\n23\nFebruary\n1808\n, but resigned this position in December of\n1808\n. From\n1808\nto\n1826\nhe was Archdeacon of Clogher. Throughout this period he continued to hold his Professorship of Astronomy at Trinity College and his position as Royal Astronomer for Ireland. However, in\n1826\nhe resigned his astronomy positions when he was appointed Bishop of Cloyne. When he was appointed as Bishop, it was said in Ireland that \"he might thank his stars\" for his promotion! It was fitting that after Brinkley resigned his chair and position as Royal Astronomer of Ireland, both positions were filled by\nWilliam Rowan Hamilton\n. It had been Brinkley who had taught\nHamilton\nmathematics and encouraged him when he was a young boy. At that time, there was nobody else except Brinkley at Trinity College who had knowledge of the latest mathematical developments.\nThe first meeting of the Astronomical Society took place in London on\n10\nMarch\n1820\n. This Society later became the\nRoyal Astronomical Society\n. Brinkley attended the meeting held on\n12\nMay\n1820\nwhen he explained that he had not come to the founding meeting due to \"accidental delay in receiving the original circular.\" The Astronomical Society became the\nRoyal Astronomical Society\nin\n1831\nwhen the King signed its new Charter. Brinkley, by this time Bishop of Cloyne, was elected as the first President of the\nRoyal Astronomical Society\nunder its new Charter at its meeting on\n11\nFebruary\n1831\n. This appointment was made under the new Charter but the King did not sign the Charter until\n7\nMarch\n1831\nso Brinkley's appointment was not seen as valid. To ensure that his position was official, he was elected as President for a second time at the meeting of the Society on\n6\nApril\n1831\n. He served as President until\n1833\n, which was the maximum term allowed under the Charter, when Francis Baily took over the presidency.\nBy\n1833\nBrinkley's health was causing him concern. We see a little of this from a letter Brinkley sent to Stephen Peter Rigand\n(1774\n-\n1839)\n, a mathematical historian and Savilian Professor of Astronomy at Oxford. The letter, sent on\n13\nMay\n1833\nfrom Bangor, begins:-\nI shall have much pleasure in reading the sheets of your work if you have an opportunity of sending them to me at Cloyne. Before I left Bath I committed to the care of Mr Duncan your interesting manuscript on Sterling. It was directed to you and Mr Duncan promised to have it conveyed safely. I am returning to Ireland much improved, thank God, in my health and trust I shall be well able to meet all the unpleasant things that are likely to occur there. Happy England if its happiness were properly appreciated. I expect to be in Dublin in two or three days and in Cloyne in about ten days. ...\nBrinkley received many honours both for his mathematical work and for his contributions to astronomy. In\n1803\nhe was elected to the\nRoyal Society of London\n:-\n... as the author both of a practical method of determining longitude and as a mathematician who had contributed a new method of solving equations.\nHe was awarded the Society's Copley medal in\n1824\nfor his work on stellar parallax. At the time of the award, it was not realised that his results were incorrect. Nevertheless, despite the error, it was important work deserving recognition. You can read the speech by Sir Humphry Davy, President of the Royal Society, on the occasion of the award of the Copley Medal to Brinkley at\nTHIS LINK\n.\nHe was elected, in\n1822\n, President of the\nRoyal Irish Academy\nand continued in this position until his death in\n1835\n.\nP A Waymen writes\n[\n16\n]\n:-\nBrinkley had a gentle and peaceable character and his reluctant dispute with Pond was carried through without rancour. His humble origin was, for its time, unusual for a man of his eminence.\nBrinkley died at his home on Leeson Street, Dublin, and was buried in Trinity College Dublin chapel.\nYou can read an obituary of Brinkley, Bishop of Cloyne, taken from the\nClerical and Parochial Records of Cork, Cloyne, and Ross\nat\nTHIS LINK\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}