{
  "nome_completo": "John Trevor Lewis",
  "nome_curto": "John Lewis",
  "ano_nascimento": "1932",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lewis_John/",
  "lugar_nascimento": "Swansea, Wales",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "John Lewis\n's parents were Trevor Lewis, a shipbroker, and his wife Tegwyn. Although born in Swansea, John was brought up in Cardiff where he attended Marlborough Road Elementary School for Boys. One of his teachers at this school was Thomas George Thomas who later became an MP and Speaker of the House of Commons. After studying at the elementary school, John attended Cardiff High School from\n1942\nto\n1948\n. It was at this school that John received excellent teaching in mathematics from Arthur Davies.  Arthur Davies had a son, Brian Davies, who became a mathematician at the University of Oxford and then professor at King's College. London. By a strange coincidence, many years later Lewis wrote a paper with Brian Davies\nAn operational approach to quantum probability\n(1970)\n.\nJohn's mother died when he was young and in\n1948\nthe family moved to Belfast where John continued his secondary education at the Royal Belfast Academical Institution. He studied at this grammar school for boys from\n1948\nto\n1949\n. Then in the autumn of\n1949\n, after winning a Foundation Entrance Scholarship, he entered Queen's University, Belfast where his main subjects were mathematics and physics. He was awarded a B.Sc. degree in\n1952\nwith First Class Honours in Applied Mathematics. For his outstanding performance in the honours applied mathematics classes he was awarded the William Blair Morton Prize in Applied Mathematics. This prize, founded in\n1945\nto commemorate William Blair Morton, Professor of Physics at Queen's University Belfast, was awarded to a student whose work in applied mathematics, particularly essay work, was the most outstanding.\nWhile at Queen's University, Lewis met Maureen MacEntee, who was an organic chemist. They were married in September\n1959\nand had four children: Caitríona, who became a software consultant; Michael, who became a quantity surveyor; Roisín, who became an artist; and Ciarán, who became a barrister. Lewis was a keen rower and during his time at Queen's University he was captain of the boat club, and a very successful captain too for they won the national senior championship for eights in\n1953\n.\nDavid Robert Bates\nhad been appointed as Professor of Applied Mathematics at Queen's University, Belfast, in\n1951\n. Alex Dalgarno\n(1928\n-\n2015)\nhad worked with\nBates\nat University College London before joining him in Belfast. When Lewis began undertaking research at Queen's University, Belfast, in\n1952\nhis official Ph.D. advisor was\nBates\nbut he was greatly assisted by Dalgarno. After two years, Dalgarno became his official Ph.D. advisor for his third year of study. Lewis was awarded his doctorate in\n1955\nfor his thesis\nQuantal Calculations Relating to Certain Rate Processes.\nThe authors of\n[\n1\n]\nwrite:-\nIn the final year of his graduate studies John worked with Alex Dalgarno on the use of variational methods in quantum mechanical perturbation theory. Emerging from their studies was a procedure for the evaluation of infinite summations of matrix elements which is widely applicable. It has come to be known as the Dalgarno-Lewis sum rule or method. They also explored the structure of the series representation of atomic interactions in inverse powers of the interatomic distance and demonstrated that the series were unique and asymptotically divergent.\nLewis's first publication\nInelastic heavy particle collisions involving the crossing of potential energy curves\n, written jointly with\nDavid Bates\n, appeared in\n1955\nand in the same year his first joint publication with Alex Dalgarno was published, namely\nThe exact calculation of long-range forces between atoms by perturbation theory\n. Two further papers by Lewis appeared in\n1955\n, the single authored paper\nIonic configuration interaction in some excited states of the hydrogen molecule\nand the paper\nProperties of the hydrogen molecular ion\nwritten jointly with Martin R C McDowell, and Benno L Moiseiwitsch.\nAfter the award of his doctorate, Lewis went to the University of Oxford where he was a postdoctoral student working with\nCharles Coulson\n, the\nRouse Ball\nProfessor of Mathematics. Lewis and\nCoulson\n, together with A D Buckingham, published\nThe quadrupole moment of a hydrogen atom in a uniform field\n(1956)\n. After a year as a postdoctoral student, Lewis spent sixteen further years at Oxford. The first two of these,\n1957\n-\n59\n, were spent as a Research Lecturer at Christ Church, Oxford, during which time he also held an appointment as a University Junior Lecturer in Mathematics. He continued with his passion for rowing and rowed for Christ Church reaching the final of an event at the Henley Royal Regatta in\n1957\n.\nIn\n1959\nhe moved to Brasenose College, Oxford where he held the position of Hulme Lecturer in Mathematics for one year before being appointed as a fellow of Brasenose College in\n1960\n, a position he continued to hold until\n1972\n. However, in addition to these roles, he was Dean of Brasenose College from\n1964\nto\n1967\nand a University of Oxford Lecturer in Mathematics from\n1966\nto\n1972\n. All four of John and Maureen Lewis's children were born during the years they spent at Oxford. Towards the end of his time in Oxford, Lewis took sabbatical leave, spending\n1969\nat the Institute for Advanced Study in Princeton and\n1970\nas a Visiting Scientist at Rockefeller University In New York. We note that Rockefeller University was only given this name five years before Lewis was a visitor there; before that it was part of the State University of New York. The invitation to Rockefeller University came from\nMark Kac\nwho Lewis had met in Oxford in the spring of\n1969\n.\nDuring the years from\n1956\nto\n1972\nLewis's interests broadened considerably. He became expert in the representation theory of groups and during the academic year\n1966\n-\n67\n, attended a series of lectures on group representations and their applications at Oxford given by\nGeorge Whitelaw Mackey\nwho was George Eastman visiting professor. Lewis then wrote two papers with Christopher Martin Edwards, who was a fellow in mathematics at the Queen's College, Oxford, on\nTwisted group algebras\n. They write:-\nProjective representations of locally compact groups arise naturally in quantum mechanics in several ways. Groups of automorphisms of the algebra of bounded operators on a\nHilbert space\nH give rise to projective representations on H, and so the study of\nsymmetry groups\nacting on the observables leads to a study of their projective representations.\nWeyl\n's form of the canonical commutation relations define a projective representation of the vector space\nR\n2\nn\n\\mathbb{R}^{2n}\nR\n2\nn\n.\nMartin Edwards had been one of Lewis's doctoral students, obtaining his doctorate from Oxford in\n1966\n. Lewis also wrote a paper with David Joseph Judge on the commutation relation in quantum mechanics. While at Rockefeller University Lewis had worked with\nMark Kac\nwho interested him in quantum probability, dissipation in quantum mechanics and\nBose\n-\nEinstein\ncondensation. Their collaboration led to\nKac\nspending further time at Oxford later in\n1970\nafter Lewis's visit to the United States. At Rockefeller University, Lewis had also collaborated with George William Ford\n(\nknown as Bill\n)\n, to whom he had been introduced by\nKac\n. Ford, from the University of Michigan, was also visiting Rockefeller University at that time. Lewis also met Bob O'Connell from Louisiana State University and Ford and O'Connell became long term collaborators with whom Lewis wrote many papers. We have counted\n13\nFord-Lewis-O'Connell three-author papers, and\n5\nfurther papers of Lewis with Ford, some with additional authors.\nIn\n1972\nLewis left Oxford and returned to Ireland where he was appointed to a Senior Professorship in the School of Theoretical Physics of the Dublin Institute for Advanced Studies. He had been a regular speaker at Symposia at that School since\n1962\n. The position had become vacant due to the retirement of\nJohn Lighton Synge\nwho had built the School into a major international one. At the time of Lewis's appointment,\nLochlainn O'Raifeartaigh\nwas the Director of the School of Theoretical Physics. In January\n1975\nLewis was appointed as Director of the School when\nO'Raifeartaigh\nmade an extended visit to the Institut des Hautes Études Scientifiques at Bures-sur-Yyvette near Paris. Lewis continued to be the Director for the rest of his career\n[\n3\n]\n:-\nIt was characteristic of John's generosity that one of his first acts as Director in Dublin Institute for Advanced Studies was to introduce an open access policy to its facilities, enabling scientists from all over Ireland to further their research.\nThe Dublin Institute for Advanced Studies did not give Lewis the opportunity to teach undergraduates, but he offered his services as a teacher to the Department of Mathematics at Trinity College, Dublin\n[\n3\n]\n:-\nJohn was a gifted teacher with a rare ability to present clearly the essential principles of a difficult subject without compromising its complexity. In Dublin, although his position was free of teaching duties, his passion for teaching mathematics led him to offer his talents to the School of Mathematics in Trinity College. For\n24\nyears, he taught statistical mechanics and probability theory to undergraduates. He constantly refined his lectures, striving to present the latest insights from his research.\nIn\n1977\n, he published the monograph\nDilations of Irreversible Evolutions in Algebraic Quantum Theory\nwhich he had written in a collaboration with David E Evans who had come from Oxford to join Lewis at the Dublin Institute for Advanced Studies in\n1975\n.\nRichard Kadison\nreviewed their monograph and wrote\n[\n2\n]\n:-\nThis tract is an extended, somewhat expository account of recent work in the theory of dynamical semigroups, with emphasis on the theoretical foundations of quantum statistical mechanics. It is presented in the C*-algebra framework. Although the authors give brief accounts of material needed from various mathematical disciplines, a potential reader ought to be well versed in the basics of functional analysis.\nIn\n1987\nthe Irish government seriously considered closing the Dublin Institute for Advanced Studies and they reduced the grant to the Institute for\n1988\nby\n35\n%. In March\n1988\na deputation from the Institute, including Lewis, met with the Department of Education. By the end of\n1988\nthe financial position in Ireland had improved somewhat and the government made a normal financial settlement for\n1989\n. However, they refused to allow\nJames McConnell\n's Senior Professorship to be filled; he had retired in December\n1987\n. Lewis and the other School directors made presentations to the Secretary of State making a strong case to continue funding the Institute. By November\n1989\nwhen the Secretary of State visited the Institute, he declared that the government was satisfied with the presentations but told members of the Institute that they would need to continue to justify all further funding. The Institute was saved from closure\n[\n5\n]\n:-\nThere are many people who can claim a share in reversing this decision but John's part was certainly very important and significant.\nLewis was keen to collaborate with other mathematicians as can be clearly seen from his publication list. Only twelve of his\n105\npapers are single authored, and most of these twelve are papers derived from addresses he gave at various conferences around the world in places such as London\n(1974)\n, Kyoto\n(1975)\n, Esztergom\n(1979)\n, Villa Mondragone\n(1982)\n, Swansea\n(1983)\n, Bielefeld\n(1984)\n, Groningen\n(1985)\n, London\n(1987)\n, Swansea\n(1986)\n, Amsterdam\n(1985\n-\n1987)\n, and Leuven\n(1988)\n. He invited many foreign scientists to the Dublin Institute, and he was particularly keen to try to obtain the necessary permissions for scientists from countries in the Eastern block to visit Dublin. In\n1989\nthe\nSteklov\nMathematics Institute invited Lewis to visit Moscow and Kiev as a Guest of the\nUSSR Academy of Sciences\n. In Moscow, Lewis\n[\n3\n]\n:-\n... met leading researchers in the Institute for Problems in Information Transmission. They supported their research in pure mathematics with applications to telecommunications. Inspired by this, he launched a programme investigating the applications of Large Deviation Theory to the Internet. After a revolutionary insight on how to measure Internet traffic, John persuaded visionaries from the Computer Laboratory in Cambridge and the Swedish operator Telia to join him in a three-year research contract funded by the European Commission. Starting in\n1996\n, the project supported nearly a dozen students in pursuit of higher degrees in mathematics.\nAlthough the Moscow visit had given him ideas, there was a practical reason why Lewis moved his research in this direction. We explained above that when the funding for the Dublin Institute for Advanced Studies was agreed in\n1989\nit was on condition that they continued to justify that funding. Noel Lindsay, who was then secretary of the Department of Education, had made it clear when he visited the Institute that continued funding would be dependent on the Institute showing that its work was relevant on a practical scale. Lewis certainly took up this challenge with his new programme as he explained\n[\n6\n]\n:-\nThat's when I began the activity in the school of theoretical physics to find an area in which the skills I had developed in basic research could be applied. This was pre-Internet. At that time, they were developing big computers - called switches - for broadband networks. The switches stored transmitted data in queues, read the addresses and routed it, accordingly. I hit on studying problems associated with queueing and it turned out that the mathematics I had developed for my particular interest - in statistical mechanics - was just what was needed for tackling these problems. Instead of making elaborate models of tele-traffic on broadband and calculating the rate function, I decided to measure it.\nIn\n1999\nthe company Measure Technology Ireland was set up. Lewis explained\n[\n6\n]\n:-\nThe idea of the project is to use mathematics in the way we did in the earlier project - in telecommunications, as before, but also in multi-media computer operating systems and in parallel processing computer systems. In all these areas, there are problems of allocating scarce resources. We will use the statistical properties of these systems to achieve the optimal utilisation of resources. Our aim is to produce a research group which will have an international reputation and train graduates in research in this area.\nLewis always declared that he was self-taught in pure mathematics. He explained his position in relation to pure and applied mathematics which was quoted in\n[\n6\n]\n:-\nI get huge satisfaction from pure mathematics, but I find it enormously satisfying to see some abstract mathematical idea having an application. I will be thrilled if the company\n[\nMeasure Technology Ireland\n]\ndevelops a successful product which embodied the original idea.\nLewis received notable honours for his contributions. He was elected to the\nRoyal Irish Academy\nin\n1977\n, serving on its council from\n1985\nto\n1989\nand again from\n1997\nto\n1999\n. He was Vice President of the Academy from\n1999\nto\n2001\n. In\n1999\nhe was awarded an honorary doctorate by the Dublin Institute of Technology and, in the same year, an honorary professorship at Trinity College, Dublin. He also held honorary professorships at the Universities of Swansea\n(1992\n-\n1995)\nand Cardiff\n(1998\n-\n2004)\n. Lewis retired from his position at the Dublin Institute for Advanced Studies in\n2001\n.\nOutside his family and research interests, Lewis was fond of wine, leading to family holidays visiting vineyards, and fond of reading, particularly biographies. We hope that he enjoyed reading biographies from our MacTutor website.\nLet us end this biography with a quote from the authors of\n[\n1\n]\n:-\nJohn made significant contributions to theoretical chemistry, quantum measurement, quantum stochastic processes, the Ising model, boson condensation and telecommunications. ... John's impressive scientific work is a monument to our memory of him. His friends and collaborators will recall him for his ability, enthusiasm, insight, encouragement and eagerness to help. Many mathematicians would not have considered academic life without John's influence. While considering John's contribution to science, we should not forget the contributions that he made to many of our lives. An old friend of John's from his time at Oxford put it well when he said: \"John was a lovely man and a perfect fit to my ideal of an academic: a man of great learning, lightly worn, and no conceit of himself.\"",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}