{
  "nome_completo": "John Edward Campbell",
  "nome_curto": "John Campbell",
  "ano_nascimento": "1862",
  "ano_morte": "1924",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Campbell/",
  "lugar_nascimento": "Lisburn, Co Antrim, Ireland",
  "lugar_morte": "Oxford, England",
  "biografia": "John Campbell\n's father was also named John Campbell. He was a medical doctor who had a practice in Lisburn. John junior, the subject of this biography, was educated at home when he was young. He then entered the Methodist College in Belfast where he completed his school education before entering Queen's College, Belfast.\nThe Queen's University in Belfast had been established in\n1845\nand Campbell felt great loyalty towards this institution. As\nElliott\nwrites in\n[\n2\n]\n:-\nHe always remained a very loyal Ulsterman, in every sense, and expressed warm gratitude to those under whom he studied in his first university.\nCampbell graduated from the Queen's University in\n1884\nand won a scholarship to study at the University of Oxford in England. He entered Hertford College, at that time a new College which had been founded in Oxford in\n1874\n. He graduated in\n1885\nwinning a Junior Mathematical University Scholarship in that year. He became a fellow of Hertford College in\n1887\n, being awarded a Senior Scholarship in\n1888\n, and was then appointed as a tutor at the College. He later was appointed as a lecturer at University College.\nAs to his success as a lecturer in Oxford\nElliott\n, in\n[\n2\n]\n, gives the following details:-\nOf his devotion to duty in Oxford it is impossible to speak too highly, and the general affection felt for him can hardly be exaggerated. His success with pupils was marked, all the more marked because all saw that he was at home, mathematically, in regions above them, and wondered that he could come down to their modest level. He possessed capacity for administration also, serving his College well as Vice-Principal, with Principal's authority, and as Bursar, at times of special need.\nHe was also a strong advocate of women's education\n[\n1\n]\n:-\nIn the movement for women's education in Oxford he took a keen interest, and for several years recently was treasurer of Lady Margaret Hall.\nCampbell's book\nLie's Theory of Finite\nContinuous Groups\n(1903)\nintroduced\nLie\n's ideas to British mathematicians. However, he is most frequently remembered for the Campbell-\nBaker\n-\nHausdorff\ntheorem which gives a formula for multiplication of exponentials in\nLie algebras\n. His research turned later towards\ndifferential geometry\n.\nBurnside\ngave the following appreciation of his work:-\nMr Campbell's interest in the theory of continuous groups was first shown in two papers on \"A Law of Combination of Operators\" in volumes\n28\nand\n29\nof the Proceedings of the London Mathematical Society. In these papers he deals, from a point of view which is essentially his own, with the formal results which are at the base of\nLie\n's theory. In a paper published two years later \"On the Theory of Simultaneous Partial Differential Equations\" he develops a system of formulas by which it may be determined whether such a system is or is not integrable. His next contribution to the subject was a \"Proof of the Third Fundamental Theorem in Lie's Theory\". The proof given is essentially simpler than\nLie\n's own; and, though it was subsequently criticised by\nEngel\n, it is recognised as being substantially complete. In\n1903\n, not very long after the date of the last paper, Mr Campbell's \"Introductory Treatise on Lie's Theory of Finite Continuous transformation Groups\" was published. By writing this book he put English mathematicians under a lasting debt of gratitude. It gives a wonderfully clear and complete account of a modern theory which, although it already had a literature of its own on the Continent, had, at the time when the book was published, attracted little or no attention in this country. Moreover the book is not, in any sense whatever, a mere compilation from outside sources. It is full of points of view and illustrations which are Mr Campbell's own. The chapters on contact transformations and on differential invariants may be specially referred to. The theory in which Mr Campbell was so specially interested underlies most of his more recent work on differential geometry in general, and on that particular branch of it connected with\nEinstein\n's gravitational theory.\nCampbell was elected a Fellow of the\nRoyal Society\nin\n1905\n. He had married Sarah Hardman, the daughter of a cotton spinner, in\n1889\n. After one of their sons was killed in\n1914\nnear Ypres during the fighting of World War I, Campbell seemed to give up mathematical research.\nHe was President of the\nLondon Mathematical Society\nfrom\n1918\nto\n1920\n. He received an unusual tribute from the University of Cambridge when, shortly before his death, he was invited to examine the Mathematical Tripos at Cambridge, being the first Oxford mathematician to be asked to undertake this duty.\nAs to Campbell's personal character\n[\n2\n]\n:-\nHe was a man of singular personal charm, cheery, unaffected, trust-inspiring. There was no selfishness in him. Differences of opinion, where principle was not at stake, did not worry him. He knew how to be sorry without complaining if misfortune or disappointment came his way.\nHe is described in\n[\n1\n]\nas follows:-\nNaturally modest and rather shy in manner, he was never a very prominent figure in University business or society, but he was greatly liked by his pupils and loved by those who knew him well. ... His high character and unselfishness made him much respected both in the college and in the University.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}