{
  "nome_completo": "John Casey",
  "nome_curto": "John Casey",
  "ano_nascimento": "1820",
  "ano_morte": "1891",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Casey/",
  "lugar_nascimento": "Coolattin, Kilbehenny, Co. Limerick, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "John Casey\n, mathematician and teacher, was born\n12\nMay\n1820\n, in the townland of Coolattin, in the parish of Kilbehenny, Co. Limerick. Tradition has it that he was orphaned at the age of nine and raised by neighbours. He became a teacher under the Board of National Education at a school in Tipperary Town and was then appointed headmaster of the newly-opened Kilkenny District Model School in\n1854\n. While resident in Kilkenny, Casey was introduced to advanced mathematics by a former student of Trinity College, Dublin, who proposed that Casey should study a theorem of\nPoncelet\n, concerning polygons inscribed in a circle of a coaxial system. Casey's short proof of\nPoncelet\n's theorem was communicated to Richard Townsend, Fellow of Trinity College, in\n1858\n, and was published in the\nQuarterly Journal of Mathematics\n5\n(1862)\n,\n43\n-\n53\n. Casey thereafter corresponded with Townsend and\nGeorge Salmon\non geometric problems, and they persuaded him to enter Trinity College as pensioner in\n1858\nto undertake a degree course; he was elected a non-foundation scholar in\n1861\nand graduated in\n1862\n. In early\n1862\n, he became Science Master at Kingstown Schools\n(\nDun Laoghaire\n)\n. He published several research papers on geometry while studying for his degree, and the influence of the group of geometers working at Trinity College, including\nW R Hamilton\n,\nA S Hart\n,\nSalmon\nand Townsend, is apparent in this work. He also served as an editor of the journal\nMessenger of Mathematics\nbetween\n1862\nand\n1868\n.\nCasey applied unsuccessfully in\n1867\nfor the vacant professorship of mathematics at Queen's College, Cork. As there were several well qualified candidates, his failure to be selected cannot be considered unfair, contrary to the opinion of an earlier obituarist. In\n1873\n, he was offered the position of professor of mathematics at the Catholic University in Dublin. A little later, he was offered a specially created professorship in geometry at Trinity College. In a letter to Townsend dated\n5\nNovember\n1873\n, he declined this position, and Townsend explained in a letter to the Registrar of Trinity College, written the following day, that Casey felt obliged to accept the professorship at the Catholic University. As the Catholic University had virtually no students and could not pay regular salaries, Casey supported himself by giving grinds. Between\n1873\nand\n1882\n, he prepared students at the French College, Blackrock, for the Civil Service entrance examination, and he was employed as a professor of mathematics at the Civil Service College, opened as a department of the French College in\n1875\n. Following the establishment of the Royal University in\n1880\nand the reconstitution of the Catholic University premises at St Stephen's Green as University College, Casey was elected to a fellowship of the Royal University in\n1882\n, at a yearly salary of £\n400\n.\nCasey wrote over\n25\nresearch papers but his mathematical reputation rests on the six textbooks he wrote:\nA sequel to the first six books of the Elements of Euclid\n(1881\n;\n8\nth\ned.\n1910)\n;\nA treatise on the analytical geometry of the point, line, circle and conic sections\n(1885\n;\n2\nnd\ned.\n1893)\n;\nA treatise on elementary trigonometry\n(1886)\n;\nA treatise on plane trigonometry\n(1888)\n; A\ntreatise on spherical trigonometry\n(1889)\n. He also published his own edition of\nThe first six books of the Elements of Euclid\n(1882\n;\n17\nth\ned.\n1902)\nwhich is remarkable for its large store of exercises, collected and devised by himself and Richard Townsend, which occasioned the publication of a separate\nKey to the exercises of Casey's Elements of Euclid\n(1885)\nby Casey's son, Joseph. It was in his\nSequel to Euclid\nthat Casey presented for the first time in a textbook those extensions of the theorems of\nEuclid\nthat became known as the newer geometry of the triangle; indeed, he and the French mathematician\nÉmile Lemoine\n(1840\n-\n1912)\nare held to be the founders of the so-called Modern Geometry of the circle and triangle. Casey's work was much appreciated in Belgium and France, and\nProfessor Joseph Neuberg\nof Liège made substantial additions to later editions of\nSequel to Euclid\n.\nHe is known in particular for the theorem at\nTHIS LINK\n.\nCasey married Catherine Ryan in\n1847\n; they had four children, two boys and two girls. From\n1875\n, the family lived at\n86\nSouth Circular Road, Dublin. Casey's daughter Catherine married Patrick Dowling, later Registrar of the Royal College of Science in Dublin, who edited revisions of some of Casey's textbooks. Casey was a member of the\nRoyal Irish Academy\n(1866)\nand fellow of the\nRoyal Society\n(1875)\n, and held honorary doctorates in laws from Trinity College Dublin\n(1869)\nand the Royal University of Ireland\n(1885)\n. He maintained a lifelong love of the Irish language, which he had learned in childhood, and was a member of the Gaelic Union and the Society for the Preservation of the Irish Language.\nFrom\n1874\nor\n1875\nonwards, Casey lived at\n86\nIona Terrace, which is part of the South Circular Road in Dublin and close to Casey's place of work at St Stephen's Green. Casey died of bronchitis on\n3\nJanuary\n1891\nand was buried at Glasnevin Cemetery.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}