{
  "nome_completo": "John James Walker",
  "nome_curto": "John James Walker",
  "ano_nascimento": "1825",
  "ano_morte": "1900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walker_John/",
  "lugar_nascimento": "Kennington, Surrey, England",
  "lugar_morte": "Hampstead, England",
  "biografia": "John James Walker\n's father, John Walker, was the headmaster of various schools. In fact Walker attended London High School, the school at which his father was then headmaster until his father moved to become headmaster of Plymouth New Grammar School. Walker completed his school education at Plymouth New Grammar School before entering Trinity College Dublin as an undergraduate.\nAlthough his father's family were originally from Yorkshire, several generations had lived in Ireland. His mother's family were English but Walker followed his father's family tradition in attending Trinity College Dublin. Walker's grandfather had been a fellow of Trinity and published classical texts as well as elementary mathematics and logic texts.\nThings were not entirely straightforward for Walker at Dublin for his family had ceased to be conformists so he was debarred from holding a scholarship. To add to his problems his father died young and Walker was left having little in the way of funds to see out his education. However he excelled at Trinity College, winning gold medals for both mathematics and physics as well as winning other distinctions.\nAfter Walker graduated he became tutor to the Guinness family, a wealthy Irish family who had made their money from brewing. Arthur Guinness bought a small brewery in Dublin which began brewing a dark beer with a rich head in\n1799\n; this became the national beer of Ireland. Walker became a private tutor to the family in\n1853\n, two years before the death of the founder Arthur Guinness, and he continued as a tutor until\n1862\n.\nWalker returned to England and, from\n1865\n, he worked in London as a lecturer in applied mathematics and physics at University College. In the same year\n1865\nhe joined the newly formed\nLondon Mathematical Society\nand he was the president of the Society in\n1888\n-\n90\n. Walker was honoured with election as a fellow of the\nRoyal Society\nin\n1883\n. However his post at University College ended in\n1888\nand after that he devoted himself to mathematical research without holding any further jobs.\nThe range of Walker's mathematical research was quite impressive. He wrote some articles on theoretical mechanics but his more elaborate papers were on advanced algebra and geometry. Walker was a strong advocate of\nHamilton\n's\nquaternions\nand strongly believed that they had not been given as wide a use as they merited. He applied quaternions to a variety of problems, mostly of an elementary nature.\nThe three most important papers that Walker wrote were on the analysis of plane curves and curved lines. The papers were closely connected and all appeared in the\nProceedings of the London Mathematical Society\n. He wrote further articles on cubic curves and in this area he wrote the memoir\nOn the diameters of cubic curves\nwhich was published in the\nTransactions of the Royal Society\nin\n1889\n.\nWalker's character is described in\n[\n1\n]\nin the following terms:-\nMr Walker was of a reserved temperament, marked by somewhat precise courtesy of manner which seemed to belong to a bygone generation. His real kindness was shown by genial estimates of character and liberal appreciation of the labours of others engaged in kindred studies.\nIt is an interesting thought what someone writing in\n1901\nabout 'courtesy of manner which seemed to belong to a bygone generation' might think of Walker now, almost\n100\nyears later.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}