{
  "nome_completo": "John Pell",
  "nome_curto": "John Pell",
  "ano_nascimento": "1611",
  "ano_morte": "1685",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pell/",
  "lugar_nascimento": "Southwick, Sussex, England",
  "lugar_morte": "Westminster, London, England",
  "biografia": "John Pell\n's father was also named John Pell and his mother was Mary Holland. Mary was from Halden in Kent and her husband was from Southwick where their son John, the subject of this biography, was born. He was the second of his parents two sons but by the time he was six years old he was an orphan, his father dying in\n1616\nand his mother in the following year. John Pell senior had a fine library and this proved valuable to John junior as he grew up. After attending Steyning School in Sussex, which was a free school, he entered Trinity College, Cambridge in\n1624\n. He received his B.A. in\n1628\nand his M.A. in\n1630\n. He was by this time an expert in Latin and Greek and, although we know little of his training in mathematics, we do know that he corresponded with\nBriggs\nabout logarithms in the year in which he graduated with his B.A.\nAfter leaving Cambridge, Pell became a schoolmaster. He worked first in Horsham, as an assistant master at Collyer's School, then in Chichester Academy in Sussex. He married Ithumaria Reginolles on\n3\nJuly\n1632\n; they had four sons and four daughters. Pell spent five years from\n1638\nteaching mathematics in London. He then went abroad becoming Professor of Mathematics at the\nGymnasium\nIllustre in Amsterdam from\n1643\nuntil he took up a similar post at the University of Breda in\n1646\n. In\n1651\nthe English brought in the Navigation Act which aimed to prevent the Dutch taking part in the English sea trade. Tensions between the English and the Dutch rose sharply and there was an incident in May\n1652\nwhen a Dutch force was defeated. Pell realised that war was imminent and that he would be in an extremely difficult position in Breda once war broke out. He returned to England and indeed the First Anglo-Dutch War did break out on\n8\nJuly\n1652\n. After his return, Pell was appointed by Oliver Cromwell to a post teaching mathematics in London.\nPell spent the years\n1654\nto\n1658\nholding a government post in Zürich. He had been sent there by Cromwell on a diplomatic mission. The Peace of Westphalia of\n1648\nthat ended the Thirty Years' War saw the Roman Catholicism\n(\nat this time identified with French rule\n)\nregain some territories which had previously been Lutheran Protestant. Cromwell wanted to split the Protestant cantons of Switzerland off to join a Protestant League, with England at its head. However Pell's negotiations were long drawn out and he returned to England to give his report to Cromwell only shortly before Cromwell's death. He was unable to report as he waited in vain for an audience with Cromwell which could not be arranged. After his return to England Pell was ordained a deacon, then a priest in\n1661\n. He became vicar at Fobbing in Essex, and in\n1663\nhe also became vicar of Laindon and Basildon in Essex. He held these two positions in the church for the last twenty years of his life. His wife Ithumaria died in\n1661\nand some time before\n1669\nhe remarried.\nMalcolm writes in\n[\n7\n]\n:-\nThe mathematician John Pell is a significant figure in the intellectual history of\n17\nth\ncentury England - significant, however, more because of his activities, contacts and correspondence than because of his published work. His few publications are, nevertheless, valuable sources of information about his intellectual biography.\nPell worked on algebra and\nnumber theory\n. He gave a table of factors of all integers up to\n100000\nin\n1668\n. Pell's equation\ny\n2\n=\na\nx\n2\n+\n1\ny^{2} = ax^{2} + 1\ny\n2\n=\na\nx\n2\n+\n1\n, where\na\na\na\nis a non-square integer, was first studied by\nBrahmagupta\nand\nBhaskara II\n. Its complete theory was worked out by\nLagrange\n, not Pell. It is often said that\nEuler\nmistakenly attributed\nBrouncker\n's work on this equation to Pell. However the equation appears in a book by\nRahn\nwhich was certainly written with Pell's help: some say entirely written by Pell. Perhaps\nEuler\nknew what he was doing in naming the equation.\nPell published a number of works, for example\nIdea of Mathematics\n(1638)\nand the two page\nA Refutation of Longomontanus's Pretended Quadrature of the Circle\n(1644)\n(\nreprinted in Latin as\nControversiae de vera circuli mensura\n(1647))\n. M J Klein writes of the\nIdea of Mathematics:-\nPell made a list of tasks that if executed would promote the progress of mathematics in England. His plans included cataloguing all past works, describing the extent of mathematics, selecting the best of the past, describing the advances already made, delineating the methodologies that would prove helpful, and noting the problems that cannot be solved.\nThe\nRefutation\nwas written because of a dispute Pell was involved in over the value of π. Longomontanus\n(\nChristian Severin\n)\nhad published his quadrature of the circle in\n1644\n. In fact Longomontanus died in\n1647\nbut the controversy did not end with his death since others joined in. In\n[\n9\n]\nvan Maanen describes in detail the correspondence between Pell and Charles Cavendish in which Pell is trying to enlist supporters for his side of the argument. Pell also translated\nLansberge\n's tables, which were published in\n1632\n, and worked on astronomy.\nPell was elected to the\nRoyal Society\non\n20\nMay\n1663\n. He served on the committee considering mechanical and optical inventions and was elected vice-president in\n1675\n.\nHe is described in\n[\n2\n]\nas follows:-\nPell was a striking figure, remarkably handsome, with strong, excellent posture, dark hair and eyes, and a good voice. His temperament was sanguine and melancholic.\nWhen in London, Pell lived for a while with\nCollins\n. However in the autumn of\n1664\nan epidemic of the plague began in the poor outskirts of city. The epidemic died down after the winter but spread again in May\n1665\n. The king and court fled from London in June and that summer Pell also left London being invited to Brereton Hall in Cheshire as the guest of William Brereton whom he had tutored while in the Netherlands. Aubrey writes\n[\n3\n]\n:-\nNever was there greater love between master and scholar then between Dr Pell and this scholar of his, whose death on\n17\nMarch\n1680\nhath deprived this worthy doctor of an ingenious companion and a useful friend.\nAfter this Pell lived\n[\n3\n]\n:-\n... in an obscure lodging, three stories high, in Jermyn Street, next to the sign of the Ship, wanting not only books but his proper manuscripts.\nHe was now in debt and put in prison. After his release he lived in a number of different places such as the College of Physicians, the house of one of his grandchildren, and a lodgings in Westminster where he died.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}