{
  "nome_completo": "John Arbuthnot",
  "nome_curto": "John Arbuthnot",
  "ano_nascimento": "1667",
  "ano_morte": "1735",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arbuthnot/",
  "lugar_nascimento": "Inverbervie, Kincardine, Scotland",
  "lugar_morte": "London, England",
  "biografia": "John Arbuthnot\n's parents were Margaret Lammie and Alexander Arbuthnott. Both his parents were associated with the Church, with his father being the minister of Arbuthnott and his mother being the daughter of the minister of Farnell and dean of Brechin. Alexander Arbuthnott was well educated having studied at Marischal College, Aberdeen. He probably gave his son John a good grounding in Latin and Greek. John was the oldest of his parents seven surviving children. He had two younger brothers, Robert born in\n1669\nand Alexander born in\n1675\n, as well as four sisters. After Alexander Arbuthnott's wife Margaret died, he remarried Catherine Ochterlony and they had one son George born in\n1688\n(\nwhen John was\n21\nyears old\n)\n.\nArbuthnot entered Marischal College, Aberdeen, in\n1681\nwhere he studied the standard arts course taken by all students at this time. It contained a reasonable amount of mathematics and natural philosophy\n(\nas physics was called at that time, and in fact it was still so named when I\n[\nEFR\n]\nstudied natural philosophy in St Andrews in the\n1960\ns\n)\n. Arbuthnot graduated in\n1685\nand there is no record of what he did in the next six years. In fact the next few years were dramatic ones in Scotland, and in particular for the Arbuthnot family.\nThe family were Jacobite supporters, meaning they supported the right of the Roman Catholic James II to be King of England and Scotland. In\n1689\nViscount Dundee, known as \"Bonnie Dundee\", led an uprising in support of James. Robert Arbuthnot, who like his brother John was a graduate of Marischal College, joined Bonnie Dundee's army and fought against General Hugh Mackay at the Battle of Killiecrankie. Dundee's forces were completely victorious, but he was killed. In August the Scottish resistance was crushed at the Battle of Dunkeld and Robert Arbuthnot fled to France. Certainly John did not take part in the military campaign and there is some evidence that he was in Edinburgh studying mathematics with\nDavid Gregory\n. In\n1690\n, because of the unrest in Scotland,\nDavid Gregory\nleft Edinburgh and went to Oxford and Arbuthnot may have spent time in Oxford.\nIn September\n1689\nArbuthnot's father, Alexander, refused to sigh an oath to the rulers William and Mary who had been victorious over the Jacobites, and he was dismissed from his parish. He did not go quietly, however, for he took the session book with him. After he died in\n1691\nhis sons were required to return the session book which John Arbuthnot did in order that his father might be buried. However John's request to erect a headstone at his father's grave was only granted with strict conditions as what might be inscribed on the stone and in the circumstances no stone was put up.\nAfter settling his father's affairs, Arbuthnot went to London where he earned his living giving lessons in mathematics. He translated\nHuygens\n' tract\nDe ratiociniis in ludo aleae\nⓉ\n(\nReasoning in  gambling games\n)\non\nprobability\nand extended it by adding to it a few further games of chance such as backgammon, the Royal Oak lottery, raffling, whist, and games with dice. He published it anonymously as\nOf the Laws of Chance\nin\n1692\n. It was the first work on probability published in English and refers to:-\n... the calculation of the quantity of probability.\nThis appears to be the first time the word \"probability\" appears in print.\nArbuthnot then became a private tutor to Jeffrey Jeffreys, the son of an important London man. They went together to Oxford where once more Arbuthnot was with his friend\nDavid Gregory\n. At Oxford Arbuthnot studied medicine privately during\n1694\n-\n96\n, then took a medical degree at the University of St Andrews defending his theses on the day that he enrolled on\n11\nSeptember\n1696\n.\nIn\n1695\nWilliam Woodward published\nEssay towards a natural history of the Earth\nand Arbuthnot responded with publishing\nAn examination of Dr Woodward's account\ntwo years later. He also published a short pamphlet\nEssay on the usefulness of mathematical learning\nwhich appeared in\n1701\n. After Queen Anne came to the throne on\n1702\n, Arbuthnot gained favour being employed in his capacity as a medic at Court. At around this time he married Margaret Wemyss and their first child, George, was born in\n1703\n. He was elected a Fellow of the\nRoyal Society\nin\n1704\n. In the following year he became a member of the committee set up by the\nRoyal Society\nto oversee the publication of\nFlamsteed\n's star catalogue\nHistoria coelestis\nⓉ\n(\nStories of the heavens\n)\n.\nOn\n30\nOctober\n1705\nhe was appointed physician to Queen Anne. He began to take a prominent political role and was particularly involved with the arguments which went on concerning the Act of Union between England and Scotland. A detailed treaty was proposed in the summer of\n1706\nand Arbuthnot published a pamphlet\nA sermon preach'd to the people at the Mercat Cross of Edinburgh on the subject of the union\nwhich made clear that its author was a Scot who believed in the economic benefits of a union. The Scottish Parliament passed the treaty in January\n1707\n, the English Parliament passed it shortly after, royal assent was given on\n6\nMarch and the union came into effect on\n1\nMay\n1707\n.\nArbuthnot continued his scientific work submitting a paper to the\nRoyal Society\nin\n1710\ndiscussing the slight excess of male births over female births in the years from\n1629\nto\n1710\n. This paper, published in the\nPhilosophical Transactions\n, is perhaps the first application of probability to social statistics and includes the first formal test of significance. In this paper Arbuthnot claims to demonstrate that divine providence, not chance, governs the sex ratio at birth. In\n[\n12\n]\nShoesmith explores the controversy which arose from Arbuthnot's paper, looking at the positions taken by\n'sGravesande\nand\nNicolaus\n(\nI\n)\nBernoulli\nin\n1712\nand Nieuwentijt in\n1715\n.\nArbuthnot's main fame, however, rests on his reputation as a wit and on his satirical writings. He became a friend of Jonathan Swift and the two produced satirical political pamphlets. Arbuthnot published five best selling John Bull pamphlets\n[\n3\n]\n:-\nThese burlesque the\n[\nwar of the Spanish succession\n]\nas a whole - its alliances, its purposes, its expense, its futility.\nThe character in these pamphlets, John Bull, became a symbol of the English character. He also published\nA treatise of the art of political lying\nwhich asks a question which still worries politicians:-\n... whether a lie is best contradicted by truth or another lie.\nWith Alexander Pope, Jonathan Swift, John Gay and Thomas Parnell he founded the Scriblerus Club in\n1713\n, whose purpose was to satirise bad poetry and pedantry. The club was short-lived.\nAfter Queen Anne died on\n1\nAugust\n1714\n, despite Arbuthnot attending her in her final illness, he went to France for a while. He then returned to England to become a physician to other important people.\nIn addition to satirical works he also published some serious medical work in his last few years. The first of these was\nAn essay concerning the nature of aliments\nin\n1731\n. Suffering from kidney stones and asthma, and being very overweight through good living, his health began to fail in\n1734\n. Dr Johnson wrote:-\n[\nArbuthnot\n]\nwas a man of great comprehension, skilful in his profession, versed in the sciences, acquainted with ancient literature, and able to animate his mass of knowledge by a bright and active imagination; a scholar with great brilliancy of wit; a wit, who, in the crowd of life, retained and discovered a noble ardour of religious zeal.\nA sign on the A\n90\nin Angus pointing to Arbuthnot's birthplace as well as the village after which the family is named.",
  "math_areas": [
    "Statistics"
  ]
}