{
  "nome_completo": "John Wilkins",
  "nome_curto": "John Wilkins",
  "ano_nascimento": "1614",
  "ano_morte": "1672",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilkins/",
  "lugar_nascimento": "Fawsley (4 km S of Daventry), Northamptonshire, England",
  "lugar_morte": "Chester, England",
  "biografia": "John Wilkins\n's father was Walter Wilkins, a goldsmith from Oxford. In\n[\n6\n]\nAubrey describes Walter Wilkins as:-\n... a very ingenious man with a very mechanical head. He was much for trying of experiments, and his head ran much upon the perpetual motion.\nWalter Wilkins married Jane Dod, the daughter of the Puritan minister John Dod, and John was one of their four children. Walter Wilkins died in\n1625\nwhile John was still a boy and Jane remarried. John's stepfather then became Francis Pope and a son of this marriage, Walter Pope, remained a close friend of John Wilkins throughout his life.\nJohn's early education is described in\n[\n4\n]\nin the following way:-\nHe was taught his Latin and Greek by Edward Sylvester, a noted Grecian, who kept a Private School in the Parish of All Saints in Oxford: His Proficiency was such, that at Thirteen Years of Age he entered a Student in New-Inn, in Easter-Term\n1627\n. He made no long stay there, but was removed to Magdalen Hall, ... and there he took his Degree in Arts in October\n1631\n. He afterwards entered into Orders.\nAfter graduating, he tutored in Oxford, then was appointed Vicar at Fawsley. He was then chaplain to a number of famous men, including William Fiennes, George the Eighth Lord Berkeley, and Charles Louis. Fiennes was a leading opponent of James I and Charles I in the House of Lords and a supporter of Parliament in the English Civil Wars while Louis was the nephew of King Charles I, the son of Frederick V, and the prince elector Palatine. Wilkins is said to have been appointed to this latter post because of his expertise in mathematics \"to which he devoted all his leisure\".\nOn\n13\nApril\n1648\nWilkins was appointed Warden of Wadham College, Oxford. At this time he was still chaplain to the prince elector Charles Louis and was not, therefore, in a position to take the degree of doctor of divinity which was required of a Warden. Because of this he was allowed time to study for the degree which he obtained on\n19\nDecember\n1648\n. That he was able to devote time to take his degree so soon was a consequence of the Peace of Westphalia having been signed on\n24\nOctober\n1648\n. This ended the German phase of the Thirty Years' War and the Rhenish Palatinate was restored to Charles Louis who returned to Heidelberg. Wilkins seems to have travelled to a number of European destinations around this time, probably on returning from Heidelberg where he accompanied Charles Louis.\nWilkins certainly carried out his duties at Oxford with great skill. He sat on various committees which sought to restore the autonomy of the university and its colleges. The university was under attack at this time from various religious factions who attacked both the way it was governed and the curriculum. Wilkins was particularly vigorous in defending the university against these religious attacks. He was in a strong position to do so for he had promoted changes in education moving the university towards practical learning which would benefit mankind. He aimed to\n[\n1\n]\n:-\n... gain acceptance for the new science, to bring the work of\nCopernicus\n,\nKepler\n,\nGalileo\n, Gilbert,\nMersenne\n, and others, to the attention of his countrymen.\nWilkins, in\nA discourse concerning a new planet\n(1640)\n, argued strongly for a new approach to science. That his words sound rather \"obvious\" to us today is a mark of the success of the revolution in seventeenth century thought in which he played a major role. He wrote that we should not be:-\n... so superstitiously devoted to Antiquity as for to take up everything as canonical which drops from the pen of a Father, or was approved by the consent of the Ancients. ... It behoves everyone in search of Truth, always to preserve a philosophical liberty; not to be enslaved to the opinion of any man, as to think whatever he says to be infallible. We must labour to find out what things are in themselves by our own experiences ... not what another says of them. And if in such an impartial enquiry, we chance to light upon a new way, and that which is besides the common road, this is neither our fault, nor our unhappiness.\nIn the same work Wilkins argued against the Holy Scriptures being used to determine facts about the physical world:-\nIt were happy for us if we could exempt Scripture from philosophical controversies. If we could be content to let it be perfect for that end unto which it was intended, for a Rule of our Faith and Obedience, and not to stretch it to be a Judge of such natural truths as are to be found out by our own industry and experience.\nThe arguments used are similar to those of\nGalileo\nbut there is no evidence to suggest that in fact Wilkins had seen the\nLetter to Castelli\nby\nGalileo\nwhich contains these arguments. Rather the reverse, and we have to say that it is almost certain that Wilkins put forward his arguments entirely independently of\nGalileo\n.\nIn\n1656\nWilkins married Robina, a sister of Oliver Cromwell, obtaining special dispensation since the statutes of Wadham College prohibited the Warden from marrying. Although Oliver Cromwell died in\n1658\n, being married to his sister did his career no harm at all! In\n1659\nRichard Cromwell, Oliver Cromwell's son and the Lord Protector of England, appointed Wilkins as Master of Trinity College Cambridge. However Richard Cromwell was forced to abdicate on\n25\nMay\n1659\nand in\n1660\nthe monarchy was restored when Charles II became King. Wilkins was deprived of his post when Henry Ferne claimed that he had been promised the position of Master by Charles I. The fact that Wilkins was married was used as a device to remove him.\nMany at Cambridge regretted Wilkins' departure, particularly Isaac\nBarrow\n. However, in many ways leaving Cambridge allowed Wilkins to influence the foundation of the\nRoyal Society\nit a way that would not have happened had he remained there, and this proved to be one of the finest achievements of his career.\nIn\n1645\n, while living in London, Wilkins had first become associated with a group of men who would eventually form the\nRoyal Society\n. Wallis writes that the beginnings of that\nSociety\nwere:-\n... about the year\n1645\n(\nif not sooner\n)\nwhen Dr Wilkins\n(\nthen Chaplain to the Prince Elector Palatine in London\n)\n[\nand a number of other men including Wallis himself\n]\nmet weekly on a certain day and hour, under a certain penalty, and a weekly contribution for the charge of experiments, with certain rules agreed amongst us, to treat and discourse of such affairs...\nAbout the year\n1648\n-\n49\n, some of our company being removed to Oxford\n(\nfirst Dr Wilkins, then I, and soon after Dr Goddard\n)\nour company divided. Those in London continued to meet there as before\n(\nand we with them, when we had occasion to be there, and those of us at Oxford ... and divers others, continued such meetings in Oxford, and brought those Studies into fashion there\n...\nIn fact while Wilkins was at Wadham he gathered round him a group of:-\n... worthy persons inquisitive into natural philosophy and other parts of human learning.\nThis Oxford group met in Wadham College while Wilkins was Warden there but, after Wilkins moved to Cambridge, they met at Boyle's lodgings. After Wilkins left Cambridge and returned to London he joined with the group which were meeting weekly at Gresham College. The report of the meeting at which the\nRoyal Society\nwas founded reads:-\nMemorandum November\n28\n1660\n. These persons following according to the usual custom of most of them, met together at Gresham College to hear Mr\nWren\n's lecture, viz. The Lord\nBrouncker\n, Mr\nBoyle\n, Mr Bruce, Sir Robert Moray, Sir Paule Neile, Dr Wilkins, Dr Goddard, Dr Petty, Mr Ball, Mr Rooke, Mr\nWren\n, Mr Hill. And after the lecture was ended they did according to the usual manner, withdraw for mutual converse.\nReturning to the account given by\nWallis\nof the founding of the\nRoyal Society\n:-\nAll this while, Dr Wilkins and Dr Goddard, through all these changes, continued those meetings,\n(\nand had a great influence on them\n)\nfrom the first original, till the days of their death ...\nAlthough he had been dismissed from Cambridge on the restoration of the monarchy, Wilkins was soon in favour with Charles II. On\n11\nApril\n1662\nthe King made him vicar of St Lawrence Jewry in London. He was consecrated Bishop of Chester on\n14\nNovember\n1668\n. He then journeyed frequently between Chester and London although he spent most time in Chester. By\n1672\n, however, he was suffering ill health and after his death in November he was burried at St Lawrence Jewry on\n12\nDecember.\nIn\n1638\nWilkins published his first book\nThe Discovery of a World in the Moon\nwhich was in fact appeared anonymously. In\n1640\nhe published, also anonymously,\nA Discourse concerning a New Planet\nand from this time the\nDiscourse\nand the\nDiscovery\nhave been published together as a single work. The work is addressed to the general reader rather than experts in the subject, and its aim is to popularise the view of the universe due to\nCopernicus\n,\nKepler\nand\nGalileo\n. The main argument is that the Moon is not a shining disk but rather it is a world with a landscape like that of the Earth. Of course Wilkins was not the first to put forward such a theory; for example\nGalileo\nhad argued in a similar way. Perhaps more surprisingly, he believed that the Moon is a habitable planet and he predicts that one day travel to the Moon will be possible. Again Wilkins was not the first to come up with this suggestion but it is typical of the way that he thought, allowing his mind to roam through ideas which others would have found too unconventional to consider.\nWilkins worked on codes and ciphers publishing his work\nMercury, or the Secret and Swift Messenger\nin\n1641\n. The book discussed a wide range of ideas associated with communication and language. He looked at the problem of different languages in different parts of the world and looked for a solution to this curse which hindered learning. He touched on the idea of a universal language, a topic that he returned to in his final work.\nWilkins also wrote on mechanical devices, publishing\nMathematical Magick, or the wonders that may be performed by mechanical geometry\nin\n1648\n. It is an account of the fundamental principles of machines and the first part describes the balance, lever, wheel, pulley, wedge and screw. Wilkins then explains how to combine these devices:-\n... to pull up any oak by the roots with a hair, lift it up with a straw, or blow it up with one's breath.\nIt was all rather sensational, particularly the illustrations, but Wilkins imagination was based on good mathematical principles. One device he described was the smokejack, first sketched by\nLeonardo da Vinci\n. This machine consisted of horizontal sails mounted on a vertical shaft and driven by the hot air rising up a chimney. A gearing system was used so that the smokejack could turn a roasting spit.\nWilkins and\nHooke\nworked together on machines for many years and it is reported that:-\n... persons together were not to be found else where in Europe, for parts and ingenuity.\nTwo works were particularly important in influencing Wilkins thinking on machines. These were\nLiber mechanicorum\n(1577)\nby Guidobaldo del\nMonte\nand\nCogitata Physico-Mathematica\n(1644)\nby\nMersenne\n. In fact it is fair to note that Wilkins owed quite a debt to\nMersenne\nin a whole variety of areas for the two shared views closely. In many ways one can look at Wilkins work as popularising the more technical writings of\nMersenne\n.\nWilkins' last work, which had to be rewritten since the original was destroyed in the Great Fire of London in\n1666\n, is on a universal language. It is described in\n[\n1\n]\nin the following way:-\nThe First Part describes the origin of languages and alphabets... . The Second Part is an exhaustive classification of notions in all spheres of thought, P M Roget clearly based his Thesaurus on this work of Wilkins. The Third Part relates to grammar, syntax, orthography, vowels and consonants. The Fourth Part provides the symbols of the proposed new writing and language, and gives examples and instructions for its use.\nLet us illustrate Wilkins' universal language by giving his own explanation of the symbol\n.\nThe generic character\ndoth signify the genus of space. the acute angle on the left side doth denote the first difference, which is Time. The other affix signifies the ninth species under the differences, which is Everness. The Loop at the end of this affix denotes the word is to be used adverbially; so that the sense of it must be the same which we express by the phrase, For Ever and Ever.\nIt may be clever, but it is clear from this one example that learning the language would always present major problems. The difficulty in using Wilkins' new language is nicely summed up by one of his contemporaries who wrote:-\nA Doctor counted very able\nDesigns that all mankind converse shall,\nSpite o' the confusion was at Babell,\nBy a character called universall.\nHow long that character will be learning,\nThat truly passeth my discerning.\nAs to Wilkins' character, Aarsleff writes in\n[\n1\n]\n:-\nThroughout his life, he gained and retained the friendship and respect of men of the most diverse political and religious persuasions. No doubt such personal qualities as charm, ready conversation, and energy played their part in his success, but a deeper reason would seem to lie in his commitment to beliefs that transcended the exclusive interests of any particular faction. From the first to the last, all his writings advocate scientific and religious views that by the time of his death had proved that they represented the temper of the times. The new science had triumphed ...\nHooke\n, who had worked closely with Wilkins, wrote the following fine tribute to him in the Preface to\nMicrographia\n(1665)\n:-\nThere is scarce one invention, which this nation has produced in our age, but it has some way or other been set forward by his assistance. ... He is indeed a man born for the good of mankind, and for the honour of his country. in the sweetness of whose behaviour, in the calmness of his mind, in the unbounded goodness of his heart, we have an evident instance, what the true and primitive unpassionate religion was, before it was soured by particular factions.",
  "math_areas": [
    "Geometry"
  ]
}