{
  "nome_completo": "John Brown Clark",
  "nome_curto": "John Clark",
  "ano_nascimento": "1861",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clark_John/",
  "lugar_nascimento": "West Linton, Peebleshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "John Clark\n's name also appears as\nClerk\nor\nClarke.\nHis father was George Clark from Newbigging, Lanarkshire. John Clark was born in West Linton, a town about\n22\nkm south of the centre of Edinburgh, on the road to Biggar. He attended West Linton Public School, Peeblesshire, and then in\n1877\nwent to Abbeyhill Heriot School, Edinburgh as a pupil-teacher. After four years at Abbeyhill, Clark attended the Established Church Training College, Edinburgh. He spent two years at the College during which time he also attended classes at Edinburgh University. From\n1883\nto\n1835\nhe was an Assistant Master at St Leonard's School, Edinburgh. In\n1835\n[\n1\n]\n:-\n... he resumed attendance at the University with the object of qualifying for an honours degree. At the University he gained medals in natural philosophy and English, and took honours in mathematics, moral philosophy, education, geology, and natural history. He was also awarded the Neil Arnott Scholarship in experimental physics as \"the most distinguished student of the year in the physical laboratory of the University,\" and he assisted the late\nProfessor Tait\nfor one year with the teaching in the laboratory.\nClark graduated M.A. from the University of Edinburgh in July\n1889\nwith Honours. In\n1889\nhe was appointed Mathematics and Physics Master at George Heriot's School, Edinburgh. He held this position until\n1908\nwhen he was appointed Headmaster of the School. He remained Headmaster until he retired in\n1926\n. Clark married Mary Mackay in\n1891\n.\nAmong the honours Clark received was an LL.D. and an C.B.E. in\n1935\n.\nClark was an active participant in a number of organisations. For example he was a member of the Edinburgh University Physical Society and served a term as President. He joined the\nEdinburgh Mathematical Society\nin December\n1885\n. He served on the Committee in\n1890\n, was Secretary of the Society from\n1891\nto\n1896\n, Vice-President for session\n1896\n-\n97\n, and then President for session\n1897\n-\n98\n. He left the Society in\n1922\n. Clark was elected to the\nRoyal Society of Edinburgh\non\n2\nFebruary\n1891\n, his proposers being Sir John Murray, David Fowler Lowe,\nPeter Guthrie Tait\n,\nGeorge Chrystal\n. He served the\nRoyal Society of Edinburgh\nas Councillor from\n1928\nto\n1931\n, and Vice-President from\n1931\nto\n1934\n.",
  "math_areas": []
}