{
  "nome_completo": "John William Mauchly",
  "nome_curto": "John Mauchly",
  "ano_nascimento": "1907",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mauchly/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "Ambler, Pennsylvania, USA",
  "biografia": "John Mauchly\ngrew up in Chevy Chase, Maryland. He went to school in Washington DC where his father was employed as a physicist in the Department of Terrestrial Magnetism at the Carnegie Institute. In\n1925\nJohn was awarded a scholarship by the State of Maryland to allow him to attend Johns Hopkins University in Baltimore, Maryland. He began studying engineering at Johns Hopkins but his interests changed in the course of his studies towards pure science and his first degree was in physics.\nMauchly continued studying physics after taking his first degree and he was awarded his doctorate in\n1932\n. He then taught physics at a number of different colleges and spent some time at the Carnegie Institution in Washington DC undertaking research on analysing the weather. He soon realised that to make weather forecasts it was necessary to reduce large amounts of data very quickly, and he began to look for mechanical help in making such computations.\nBy\n1940\nMauchly was teaching physics at Ursinus College near Philadelphia. While there he became interested in developing electronic computers which combined his interests in physics and engineering. It may seem strange today that someone with an interest in engineering would be drawn towards building computers but at this time a computer was a huge mechanical construction. Also Mauchly's interests were in electrical engineering and he looked for ways to develop electrical circuits for computation.\nWork was going on in the area of producing electrical circuits to do arithmetic and Mauchly, together with some of his students from Ursinus College, visited establishments where such developments were being undertaken. Mauchly began to experiment in constructing electrical circuits for counting while at Ursinus College, aimed at trying out new ideas which he brought to the subject.\nNow\n1941\nwas the time when World War II was strongly affecting the directions of academic research as the USA geared up for research specifically directed towards the war effort. Mauchly took a training course in electronics, designed for defence purposes, at the Moore School of Electrical Engineering at the University of Pennsylvania. Having completed the course Mauchly was offered a position as an instructor on the course.\nResearch at the Moore School of Electrical Engineering was being carried out using early forms of computers. In particular the School used a Bush analyser, designed by Vannevar Bush specifically to integrate systems of ordinary\ndifferential equations\n. The machine consisted of replaceable shafts, gears, wheels, handles, electric motors, and disks and required much manual work to set it up. Mauchly found that\n[\n3\n]\n:-\nWhen large and related problems that could be set on the machine for weeks were to be solved it was in constant use, but when small problems were being dealt with, engineers found it more expedient to solve then mathematically, without taking days to set up the machine.\nMauchly had already developed his own ideas on how to construct a better computer and he tried to interest other members of staff at the Moore School but with little success. One person who was interested in his ideas, however, was\nJohn Eckert\nwho had been one of his instructors at Moore College when Mauchly had been a student on the training course. The two became close friends and discussed their ideas about electronic computers at almost every possible opportunity. Mauchly wrote a report on the design of an electronic computer which would, in his opinion, be far easier to use and allow results to be obtained much more quickly than the Bush analyser.\nThe Ballistic Research Laboratory had been set up at Aberdeen, in Harford county, northeastern Maryland as part of the Aberdeen Proving Ground, a military weapons testing site which had been established in\n1917\nduring World War I. The Ballistic Research Laboratory consisted of staff from the Moore School and staff from the Aberdeen Proving Ground. When a new director was put in charge of the Ballistic Research Laboratory in\n1942\nhe worked both at Aberdeen and at the Moore School. He read Mauchly's report in March\n1943\n, eighteen months after it was written, and was very impressed. Various committees then considered the proposal before money could be assigned to the project of building Mauchly's computer, and in April\n1943\nVeblen\napproved the scheme.\nMauchly and\nJohn Eckert\nthen collaborated in the construction of the Electronic Integrator and Computer\n(\nENIAC\n)\n. The machine was intended to be a general purpose one, but it was also designed for a very specific task, namely compiling tables for the trajectories of bombs and shells. ENIAC is described in\n[\n1\n]\n:-\nCompleted by February\n1946\n, the ENIAC was the first general-purpose electronic digital computer. It contained roughly\n18000\nvacuum tubes and measured about\n2\n.\n5\nmetres in height and\n24\nmetres in length. The machine was more than\n1000\ntimes faster than its electromechanical predecessors and could execute up to\n5000\nadditions per second. Its operation was controlled by a program that was set up externally by wires on plugboards. The ENIAC was the most complex and influential electronic computer of its time ...\nOf course by\n1946\nWorld War II was over but the machine was used intensively, particularly on top secret problems associated with the development of nuclear weapons.\nVon Neumann\nwas working on this project and became involved with the ENIAC computer and used it to solve systems of\npartial differential equations\nwhich were crucial in the work on atomic weapons at Los Almos.\nBoth Mauchly and\nJohn Eckert\nleft the Moore School at the University of Pennsylvania in October\n1946\n. They started up the Electronic Control Company which received an order from Northrop Aircraft Company to build the Binary Automatic Computer\n(\nBINAC\n)\n. One of the major advances of this machine, which was used from August\n1950\n, was that data was stored on magnetic tape rather than on punched cards.\nThe Electronic Control Company become the Eckert-Mauchly Computer Corporation and it received an order from the National Bureau of Standards to build the Universal Automatic Computer\n(\nUNIVAC\n)\n. This was the first computer to be produced commercially in the United States with\n46\nUNIVACs being built. One of the major advances which the UNIVAC introduced was an ability to handle both numerical and alphabetical information with equal success.\nJohn Eckert\nand Mauchly were better at computer design than they were at the economics of running a company. The problem really lay in the fact that this was such a new area that costs of production were extremely hard to estimate. As a consequence the Eckert-Mauchly Computer Corporation soon hit financial difficulties. In\n1950\nthe Remington Rand Corporation acquired the Eckert-Mauchly Computer Corporation and changed its name to the Univac Division of Remington Rand.\nMauchly left the company and formed Mauchly Associates of which he was president from\n1959\nto\n1965\nwhen he became chairman of the board. In\n1966\nMauchly received the Harry M Goode Memorial Award, a medal and $\n2\n,\n000\nawarded by the Computer Society:-\nFor his pioneering contributions to automatic computing by participating in the design and construction of the ENIAC, the world's first all-electronic computer, and of the BINAC and the UNIVAC, and for his pioneering efforts in the application of electronic computers to the solution of scientific and business problems.\nMauchly served as president of Dynatrend Inc. from\n1968\nto his death in\n1980\nand also president of Marketrend Inc. from\n1970\nagain until his death in\n1980\n. He received numerous other awards, some of which are listed in\n[\n2\n]\n. He was elected a life member of the Franklin Institute, of the National Academy of Engineering, and of the Society for the Advancement of Management. The IRE\n(\nlater to become the LEEE\n)\nelected him a fellow in\n1957\nand he was also elected a fellow of the\nAmerican Statistical Association\n. He received honorary degrees from the University of Pennsylvania and from Ursinus College where he had taught physics for eight years. In addition to the Harry M Goode Memorial Award mentioned above, he also received the Philadelphia Award, the Emanual R Pione Award, the Potts Medal, and the Scott Medal.",
  "math_areas": [
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}