{
  "nome_completo": "Joseph Émile Barbier",
  "nome_curto": "Joseph-Émile Barbier",
  "ano_nascimento": "1839",
  "ano_morte": "1889",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barbier/",
  "lugar_nascimento": "St Hilaire-Cottes, Pas-de-Calais, France",
  "lugar_morte": "St Genest, Loire, France",
  "biografia": "Joseph-Émile Barbier\nwas the son of a soldier. He showed great promise at mathematics when he was at primary school and from there he went on to attend the Collège de St Omer for his secondary school education. From this college he entered the special mathematics section of the Lycée Henri IV and, after completing his preparation at this Lycée, he passed the entrance examinations for the École Normale Supérieure.\nBarbier began his studies at the École Normale Supérieure in\n1857\nand there he impressed everyone with his deep understanding of mathematics. Taton writes in\n[\n1\n]\n:-\n... he astonished his fellow students by his acute intelligence and his ability to grasp the deeper meaning of complex problems. He also had a taste for subtlety that led him to detect errors in the most classic demonstrations.\nHaving received his licentiate Barbier proceeded toward his \"agregation\". He passed the necessary examinations in\n1860\nand he obtained his first post as a professor at a lycée. An appointment in Nice might have been attractive but Barbier's keen mind and the subtlety which he saw in even elementary mathematics did not make him a good teacher since the pupils in the Lycée in Nice failed to gain anything from Barbier. In fact seeing deeply into mathematics made his lessons more obscure rather than clearer to average students.\nHis reputation in Paris, however, was such that he had impressed his teachers there with his deep understanding. He was offered a post at the Paris Observatory by\nLe Verrier\nand Barbier left Nice to begin work as an assistant astronomer. For a few years he applied his undoubted genius to problems of astronomy. He proved a skilled observer, a talented calculator and he used his brilliant ideas to devise a new type of thermometer. He made many contributions to astronomy while at the observatory but his talents in mathematics were also to the fore and he looked at problems in a wide range of mathematical topics in addition to his astronomy work.\nHe is known for the result he published in\n1860\nthat every curve of constant width has perimeter π times its width, regardless of its precise shape.\nAs time went by, however, Barbier's behaviour became more and more peculiar. He was clearly becoming unstable and exhibited the fine line between genius and mental problems which are relatively common. He left the Paris Observatory in\n1865\nafter only a few years of working there. He tried to join a religious order but then severed all contacts with his friends and associates. Nothing more was heard of him for the next fifteen years until he was discovered by\nBertrand\nin an asylum in Charenton-St-Maurice in\n1880\n.\nBertrand\ndiscovered that although Barbier was clearly unstable mentally, he was still able to make superb original contributions to mathematics. He encouraged Barbier to return to scientific writing and, although he never recovered his sanity, he wrote many excellent and original mathematical papers.\nBertrand\n, as Secretary to the\nAcadémie des Sciences\n, was able to find a small source of income for Barbier from a foundation which was associated with the\nAcadémie\n. Barbier, although mentally unstable, was a gentle person and it was seen that, with his small income, it was possible for him to live in the community. This was arranged and Barbier spent his last few years in much more pleasant surroundings.\nBarbier's early work, while at the Observatory, consists of over twenty memoirs and reports. These cover topics such as spherical geometry and spherical trigonometry. We mentioned above his work with devising a new type of thermometer and Barbier wrote on this as well as on other aspects of instruments. He also wrote on\nprobability\nand calculus.\nAfter he was encouraged to undertake research in mathematics again by Bertrand, Barbier wrote over ten articles between the years\n1882\nand\n1887\n. These were entirely on mathematical topics and he made worthwhile contributions to the study of polyhedra, integral calculus and\nnumber theory\n.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}