{
  "nome_completo": "Joseph Alphonso Pierce",
  "nome_curto": "Joseph Pierce",
  "ano_nascimento": "1902",
  "ano_morte": "1969",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pierce_Joseph/",
  "lugar_nascimento": "Waycross, Ware County, Georgia, USA",
  "lugar_morte": "San Antonio, Bexar County, Texas, USA",
  "biografia": "Joseph Pierce\nwas the son of the African American Methodist minister William Arthur Pierce\n(\nborn August\n1854)\nand his wife Fannie L McGraw\n(\nborn November\n1876)\n, the daughter of a farmer. William and Fannie Pierce had married on\n27\nSeptember\n1899\nand at the time of the\n1900\ncensus were living in Waycross with two of William Pierce's daughters from a previous marriage, Mary B Pierce\n(\nborn October\n1884)\nand Beatrice A Pierce\n(\nborn January\n1887)\n. William Arthur Pierce died when Joseph was a child and by the time of the\n1910\ncensus he was living in Waycross with his mother and his mother's two brothers Joseph C McGraw\n(\nborn\n1869)\nand William McGraw\n(\nborn\n1871)\nwho were both in the \"bicycle business.\"\nJoseph Pierce's schooling was mostly in Waycross. At the time of the\n1920\nUS census, he was still living with the McGraw family in Waycross but his mother is not living with them - we assume that she has died before\n1920\nbut we have not found the date of her death. In\n1921\nPierce was awarded a diploma from Atlanta University High School and later in this same year he entered Atlanta University and graduated with an A.B. degree in the social sciences in\n1925\n. Atlanta University had opened in\n1869\nwith the aim of developing talented African Americans, providing inspiration and leadership for African American communities, and training teachers. Because of the low level of education for African Americans at this time, the University provided a programme for high school students to bring them up to the standard for university entrance. This was the programme that Pierce studied and gained entrance to the University with his diploma in\n1921\n[\n2\n]\n:-\nAll preparatory males were required to take industrial training classes ... To meet the goal of providing leadership in the community, Atlanta University sponsored the Atlanta Conference each summer so that Atlanta University students met with other educators and community leaders to discuss a specific problem relating to the Black experience such as \"The Negro in Business\" or \"The Negro Artisan.\"\nDuring his time at Atlanta University, Pierce played for the College Football team named the Crimson Hurricane playing in a steel grey and crimson strip. The team was very successful and, in\n1922\n, won all six matches played. In\n1922\nthe\nSavannah Tribune\nargued that the level of sportsmanship of Atlanta University's football team was higher than that of other teams. Pierce wanted to continue his football career and applied for the position of assistant football coach at Texas College in Tyler, Texas. He was appointed to the position but, when he arrived at Texas College he was asked if he had studied any mathematics in his undergraduate degree. When he said he had taken a statistics course, he was asked to teach mathematics at Texas College as an instructor in mathematics in addition to coaching football.\nPierce greatly enjoyed teaching mathematics at Texas College and in\n1927\nhe returned to Atlanta to take up the position of chair of the Department of Mathematics at Booker T Washington High School. This school, the first public high school for African Americans in the state of Georgia, had opened in September\n1924\n. Pierce now worked for a Master's Degree in mathematics from the University of Michigan and he was awarded this degree in\n1930\n. From\n1930\nto\n1938\n, he was a professor of mathematics at Wiley College in Marshall, Texas. This college had been founded in\n1873\nfor African American students and was affiliated with the United Methodist Church\n[\n9\n]\n:-\nTruly a pioneer in the educational arena, Wiley College took the leadership role in reorganising Black schools of higher education and in\n1929\n, renamed itself Wiley College, dropping the use of the word \"University\".  It was at this time the high school and trade school were discontinued.  Wiley College was recognised in\n1933\nas an \"A\" class college by the Association of Colleges and Secondary Schools of the southern states.  This marked the first time any Black school had ever been rated by the same agency and standards as other universities.\nThe head of mathematics at Wiley College was the African American Ralph Asbury Edmondson\n(1890\n-\n1953)\n. Born in Lees, South Carolina, on\n19\nJanuary\n1890\n, Edmondson had been awarded a B.A. from Lincoln University in\n1920\n, and he was awarded an M.A. from Cornell University in\n1931\n. He had been a professor of mathematics at Florida Agricultural and Mechanical College from\n1921\nto\n1924\nbefore becoming Head of the Department of Mathematics at Wiley College in\n1925\n. He collaborated with Pierce and they co-authored two books\nElementary Mathematics and Applications\n(1934)\nand\nIntroductory College Mathematics and Applications\n(1937)\n.\nOn\n15\nOctober\n1933\nPierce married Juanita H George\n(1912\n-\n2003)\nin Marion, Texas. The daughter of the barber Cornelius N George and his wife Pearl L Witherspoon, Juanita had been born on\n12\nOctober\n1912\nin Mitchell County, Texas. She had attended I M Terrell High School, Fort Worth, and graduated cum laude from Fisk University in Nashville in\n1932\n. Joseph and Juanita Pierce had one son, Joseph Alphonso Pierce, Jr. who was born in Marshall, Harrison County, Texas, on\n13\nAugust\n1935\n. Juanita Pierce went on to earn a Master's Degree and a doctorate in Health and Physical Education from New York University. She taught at the universities where her husband was employed, namely Wiley College in Marshall, Texas, Atlanta University in Atlanta, Georgia, and Texas Southern University in Houston, Texas.\nPierce wanted to continue developing his mathematical skills and while working at Wiley College he undertook research for his Ph.D. at the University of Michigan. He was advised by Harry Clyde Carver\n(1890\n-\n1977)\n. Carver, who had been made a full professor at the University of Michigan in\n1936\n, had founded the journal\nAnnals of Mathematical Statistics\nin\n1930\n. Paul Sumner Dwyer\n(1901\n-\n1982)\ntaught at Antioch College but had undertaken research for a Ph.D. during the summers of\n1927\n,\n1930\n,\n1933\nand during session\n1934\n-\n35\nadvised by Carver, and was awarded a Ph.D. by the University of Michigan in\n1936\nfor his thesis\nCombined expansions of products of symmetric power sums and sums of symmetric power products with application to sampling\n. Dwyer was appointed as a research assistant at the University of Michigan in\n1937\n. In his thesis\n(\npublished as\n[\n14\n]\n)\nPierce wrote:-\nMany thanks are due Prof P S Dwyer, to whom the writer is greatly indebted for advice and encouragement.\nPierce was awarded a Ph.D. for his thesis\nA Study of a Universe of n Finite Populations with Application to Moment-Function Adjustments for Grouped Data\nin\n1938\n. He introduces the paper\n[\n14\n]\nwhich contains the results of his thesis as follows:-\nThe object of this paper is to study the case of a universe of n finite populations, considering both the expectations of population moment-functions and the moments of sample moments, and to make applications of the results which may be of interest to mathematical statisticians. The sampling formulas which are derived reduce to the usual infinite or finite sampling formulas, under appropriate assumptions. Also a method is given whereby finite sampling formulas may be transformed into the corresponding infinite sampling formulas.\nHe gives the following conclusions\n[\n14\n]\n:-\n1\n. The derivation of general and specific formulas for the expected values of population moment-functions.\n2\n. The derivation of generalised sampling formulas under the condition that samples of n are formed by selecting one variate from each population.\n3\n. Methods for the transformation of generalised sampling formulas into the corresponding infinite and finite sampling formulas.\n4\n. A method for the transformation of infinite sampling formulas into the corresponding finite sampling formulas.\n5\n. A demonstration of the fact that adjustment formulas for moment-function of grouped data involve central moments of a rectangular distribution.\n6\n. A general formula for the expected value of the ith moment of grouped data.\n7\n. New adjustment formulas for central moments of grouped data.\n8\n. New adjustment formulas for\nThiele\nsemi-invariants of grouped data.\n9\n. A method for the evaluation of the term ..., which appears in the precise adjustment formula for the variance.\nSamuel S Wilks\nwrites\n[\n24\n]\n:-\nIn this paper the author derives general formulas for mean values of sample moments in samples of size n formed by drawing each element from a different finite population. He verifies that under the appropriate conditions these general formulas reduce to various known formulas such as those for repeated sampling from a single finite population, those for sampling from a single infinite population, etc. He then applies his results to the problem of determining the mean values of moments from samples of grouped data, deriving formulas for correcting bias\n(\ndue to grouping\n)\nof central moments and\nThiele\nsemi-invariants.\nWe note that when Pierce was awarded a Ph.D. in mathematics in\n1938\nhe became the sixth African American to be awarded such a degree. The five before him were\nElbert Frank Cox\n(\nCornell University,\n1925)\n,\nDudley Weldon Woodard\n(\nUniversity of Pennsylvania,\n1928)\n,\nWilliam Schieffelin Claytor\n(\nUniversity of Pennsylvania,\n1933)\n,\nWalter Richard Talbot\n(\nUniversity of Pittsburgh,\n1934)\n, and\nReuben Roosevelt McDaniel\n(\nCornell University,\n1938)\n.\nAfter the award of his Ph.D., in\n1938\nPierce returned to Atlanta University where he was appointed professor of mathematics. In\n1939\n, while continuing with his duties as a professor, he was appointed as project supervisor for the National Youth Administration in Georgia. While in Atlanta, Pierce's son attended Oglethorpe Elementary School. Pierce's wife Juanita also taught at Atlanta University. In\n1944\nPierce published\nOn the Summation of Progressions Useful in Time Series Analysis\n. The paper begins\n[\n15\n]\n:-\nIt was pointed out by F A Ross that summations of progressions find useful application \"in time series analysis where straight lines and more complex curves are fitted as secular trends.\" Ross presented formulas for the first six powers of the first t natural numbers and of the first t odd natural numbers. He also gave supplementary formulas to be used in fitting a secular trend when the mean of time is taken midway in the time series. These formulas were derived by elementary algebra methods which require a separate and individual derivation for each formula. The purpose of this paper is to present recursion formulas for sums of progressions which may be used to extend easily the list of formulas given by Ross to include those of higher order.\nIt was during his time at Atlanta University that Pierce did the work for which he is best known today. From\n1\nFebruary\n1944\nto\n1\nFebruary\n1946\n, Atlanta University and the National Urban League conducted a research study of business and business education among African-Americans. It was financed by the General Education Board, and Pierce served as research director of the project. The project was described in a paper by Franklin O Nichols, Southern Regional Director of the National Urban League, and Pierce\n[\n11\n]\n:-\nThe first phase of the study consists of the application of a short schedule, designed to secure basic information from all businesses in each of the seventeen cities. Then, on the basis of the returns of these short forms, a representative sample in each city is to be selected and from these samples extensive information relative to business facilities, practices and problems will be obtained. Concurrently, with these activities schedules for employees and consumers will be applied to samples of these classes. Field investigations are taking place in the following cities: Birmingham; Baltimore Montgomery; Washington; Atlanta; Louisville; Savannah; Philadelphia; Nashville; Cincinnati; Memphis; St Louis; Durham; Houston; Richmond; New Orleans; Hampton area. In each locality the local director has direct responsibility for the local activities. The active cooperation of local labour, trade, business, educational, civic and professional organisations is secured through the formation of a local committee made up of representatives of these organisations. The Local Director obtains assistance, when needed, from this committee on all matters relating to the local study.\nIn\n1944\nPierce addressed a meeting in Atlanta attended by representatives of government, education, the National Negro Business League, and the National Negro Insurance Association. One of the topics he addressed was education:-\nOn the eve of the stock market crash of\n1929\n, there were twelve colleges offering four-year courses leading to bachelors degrees in business studies. Today\n[\nin\n1944]\n, there are twenty-eight colleges offering four-year courses, and twenty-two of these had opened business departments since\n1926\n. ... In their desire to be \"different\" from white colleges, many Negro colleges have made a complete \"mess\" of the cultural side of their business curricula by devoting minimum attention to it. If white colleges are gradually realising the need for broad training by requiring at least two years of liberal education for their business students, there is all the more reason why Negro colleges place even a greater emphasis on this aspect of their curricula. This emphasis is necessary for counterbalancing, so far as it is humanly possible, the defective environmental background of Negro students who are precluded from getting the full benefits of the social heritage of our white compatriots. Such education ... will prove helpful to the student in building up a well-integrated personality. There appears to be no doubt in the minds of educators that specialisation in the early stage of a student's college career is dangerous as it tends to make him narrow and one-track minded.\nPierce published the book\nNegro Business and Business Education\n, containing the results of the study, in\n1947\n. This was a remarkable piece of work which became a classic and was reprinted with an Introduction in\n1995\n. For more information about this work, including extracts from several reviews of the\n1947\nedition, see\nTHIS LINK\n.\nOn\n1948\nPierce was appointed Professor of Mathematics and Chairman of the Department of Mathematics at Texas State University for Negroes. This university had been founded as 'Houston Colored Junior College' in\n1927\n, becoming 'Houston College for Negroes' in\n1934\n, then 'Texas State University for Negroes' in\n1947\n. In\n1951\nit received the name it is known by today, namely 'Texas Southern University'. While continuing to teach mathematics, Pierce became chairman of the Division of Natural Physical Sciences in\n1950\nand Dean of Graduate Studies in\n1952\n[\n26\n]\n:-\nAdmission to graduate programmes had been denied to blacks at southern universities until\n1948\n, when Texas State College for Negroes was granted authority to confer the master's degree. Thus there was a pent-up demand for graduate degrees, particularly in education, and when Pierce took over as dean of graduate studies, he faced burgeoning enrolment and faculty overloads. He was particularly effective in recruiting senior professors from nearby universities to assist with this demand for graduate faculty. Master's degrees conferred by Texas Southern University rose dramatically, from ninety-five in\n1948\nto a peak of\n304\nin\n1955\n. In the first ten years of Pierce's tenure as dean, Texas Southern University conferred a total of\n2\n,\n287\nmaster's degrees and\n3\n,\n663\nbachelor's degrees. In\n1963\n, when the Manned Spacecraft Center was established near Houston, Pierce and B A Turner, Texas Southern University's dean of technology, were released from teaching duties for eighteen months to recruit minority engineers for the National Aeronautics and Space Administration.\nPierce began to suffer poor health but served as President of Texas Southern University in\n1966\n-\n67\n. This was an unfortunate time to be president with student sit-ins and protests, both about civil rights and the Vietnam War, making Pierce's task hard. He retired in\n1967\nbecoming a consultant to the National Aeronautics and Space Administration. Pierce and his wife went to San Antonio to retire, but sadly he did not have long to enjoy retirement. Following his death at the age of\n67\n, he was buried in Paradise North Cemetery, Houston, Harris County, Texas.\nJuanita Pierce died in\n2003\nand was buried beside her husband in Paradise North Cemetery. We give a short extract from the resolution\n[\n20\n]\n:-\nA noted advocate of education for women,\n[\nJuanita George Pierce\n]\nwas the founder and long-time head of Texas Southern University's Women's Department of Health and Physical Education and was a fixture on the Texas Southern University campus for many years; she was a devoted member of St Philip's Episcopal Church and enjoyed spending time with friends and neighbours and playing bridge with the ladies of the Five O'clock Bridge Club. Juanita George Pierce was a woman of integrity, honour, and intelligence, and although she will be missed by all who knew her, her spirit will live on through her legacy of success and through the many individuals whose lives she touched ...\nFinally, let us give a few details about the career of Joseph Alphonso Pierce Jr. He\n[\n18\n]\n:-\n... graduated from Jack Yates High School, in Houston, Texas in\n1952\n. He joined Alpha Phi Alpha Fraternity and Beta Kappa Chi National Scientific Honor Society in\n1955\nat Texas Southern University in Houston, Texas where he received his B.S. degree in chemistry in\n1957\n, and his father Joseph Pierce, Sr. served as dean of the graduate school in\n1952\n; and later, president in\n1967\n. He earned his M.D. degree in medicine in\n1961\nfrom Meharry Medical College of Medicine, in Nashville, Tennessee. Pierce completed his internship at GW Hubbard Hospital of Meharry College of Medicine. Pierce entered the United States Army in\n1962\n. He completed a residency in anesthesiology at Brooke General Hospital/Fort Sam Huston in San Antonio in\n1967\n, where he rose to the rank of lieutenant colonel and he completed a tour of duty in West Germany from\n1967\nto\n1970\n. Then, in\n1970\n, Pierce received his Texas State medical license and entered into private practice with Anesthesia Consultants in San Antonio, and joined the American Medical Association.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Statistics"
  ]
}