{
  "nome_completo": "Joseph Louis François Bertrand",
  "nome_curto": "Joseph Bertrand",
  "ano_nascimento": "1822",
  "ano_morte": "1900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bertrand/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Joseph Bertrand\n's father was Alexandre Jacques François Bertrand and his mother was Marie Caroline Belin. Alexandre had studied at the École Polytechnique where he had become friends with\nJean-Marie Duhamel\nwho later married Alexandre Bertrand's sister. Alexandre was a writer of popular science books but sadly he died young and after this tragic event Joseph, who was nine years old, went to live with\nDuhamel\nand his wife. Of course this sad event did have the beneficial effect that Joseph was guided by\nDuhamel\n. It is worth noting at this stage that Joseph had a sister Louise who married\nHermite\nin\n1848\n.\nJoseph showed remarkable talents as a child and by the age of nine he understood algebra and elementary geometry, as well as being able to speak Latin fluently. Two years later, when he was eleven, he was given permission to attend lectures at the  École Polytechnique although he could not officially enter at this time despite having gained the required academic level. He was awarded his first degree at the age sixteen and in following year he was awarded his doctorate for a thesis on thermodynamics. In\n1839\n, the year he received his doctorate, he officially entered the  École Polytechnique and also published his first paper on the mathematical theory of electricity. After two years of study there he entered the  École des Mines in\n1841\nbeing appointed professor of elementary mathematics at the Lycée Saint-Louis in the same year. He held this post at the Lycée until\n1848\n.\nA dramatic event happened in\n1842\n. Bertrand and his brother were friendly with the Aclocque family who lived in Versailles. They visited them frequently, travelling by train from Paris. On this particular occasion the train crashed on the return journey and Bertrand was badly injured, suffering a crushed nose and facial scars which he retained throughout his life. Bertrand married Louis Celine Aclocque in\n1844\n; their sons Marcel Alexandre\n(\nborn\n2\nJuly\n1847)\n, Joseph Désiré\n(\nborn\n1853)\nand Léon Gratien\n(\nborn\n1858)\nall studied at the  École Polytechnique, and Marcel went on to become a famous geologist.\nIn\n1843\nBertrand published two memoirs on\nSurfaces isothermes orthogonale\nⓉ\n(\nIsothermal orthogonal surfaces\n)\n. He was appointed répétiteur d'analyse at the École Polytechnique in\n1844\n, being made professor there in\n1856\nfollowing the death of\nFrançois Sturm\n. He had been appointed professor of special mathematics at the Lycée Henry IV in\n1852\n, also teaching at the  École Normale Supérieure. In\n1862\n, he became professor of analysis at the Collège de France, succeeding\nBiot\nwho died in February of that year. In\n1878\nBertrand stopped teaching at the Collège de France but, eight years later, he began teaching there again.\nIn\n1845\nBertrand conjectured that there is at least one\nprime\nbetween\nn\nn\nn\nand\n2\nn\n−\n2\n2n - 2\n2\nn\n−\n2\nfor every\nn\n>\n3\nn > 3\nn\n>\n3\n. This conjecture, similar to one stated by\nEuler\none hundred years earlier, was proved by\nChebyshev\nin\n1850\n. He made a major contribution to\ngroup theory\nwith his article\nMémoire sur le nombre de valeurs que peut prendre une fonction quand on y permute les lettres qu'elle renferme\nⓉ\n(\nMemorandum on the number of possible values of a function when one swaps the letters it contains\n)\nwhich he submitted to the\nParis Academy\nin March\n1845\n.\nCauchy\nwas asked to report on the work, which studied subgroups of low index in the symmetric group, and it clearly led him to return to study permutation groups himself. Bertrand's important paper was eventually published in the\nJournal de l'École Polytechnique\n.\nFamed as an author of textbooks, the first two of many published by Bertrand were\nTraité d'arithmetique\nⓉ\n(\nTreatise of arithmetic\n)\n(1849)\nand\nTraité élémentaire d'algèbre\nⓉ\n(\nTreatise of elementary algebra\n)\n(1850)\n. These were aimed at pupils at secondary school, although later texts were aimed at students at more advanced levels, for example the two volume work\nTraité de calcul différentiel et de calcul intégral\nⓉ\n(\nTreatise of calculus and calculus\n)\n(1864\n-\n70)\n,\nThermodynamique\nⓉ\n(\nThermodynamics\n)\n(1887)\n, and\nLeçons sur la théorie mathématique de l'électricité\nⓉ\n(\nLectures on the mathematical theory of electricity\n)\n(1890)\n.\nBertrand published many works on\ndifferential geometry\nand on\nprobability theory\n. He edited an edition of\nLagrange\n's\nMécanique analytique\nwhich was published in\n1853\n. In\n1855\nhe translated\nGauss\n's work on the theory of errors and the method of least squares into French. He wrote a number of notes on the theory of probability and on the reduction of data from observations. He published these notes starting around\n1875\nand, after a short break of three years from\n1884\n, he began publishing further notes on probability.\nHis book\nCalcul des probabilitiés\nⓉ\n(\nCalculation of Probabilities\n)\n(1888)\ncontains a paradox on continuous probabilities now known as\nBertrand's paradox\n. It concerns the probability that an arbitrary chord of a circle is longer than a side of an equilateral triangle inscribed in the circle. The paradox comes about since the word \"arbitrary\" is not properly defined, see\n[\n12\n]\n. General comments on this work and Bertrand's other notes on probability are made in\n[\n4\n]\n:-\nBertrand mentioned some of his predecessors\n(\nDe Moivre\n,\nLaplace\n,\nBienaymé\n)\n, but did not refer to other scholars, notably to\nChebyshev\n.\nBertrand's treatise contains mistakes and misprints. The conditions of many problems are stated carelessly and drawings are completely lacking. Verbal explanations, sometimes given instead of formulas, are irritating\n.\nThe treatise is badly organized\n.\nBertrand uses the term 'valeur probable' on a par with 'espérance mathématique'\n.\nBertrand's literary style is extremely attractive\n.\nIt is worth noting this treatise by Bertrand heavily influenced\nPoincaré\n's treatise also called\nCalcul des probabilitiés\nⓉ\n(\nCalculation of Probabilities\n)\nwhich he published in\n1896\n. Indeed,\nPoincaré\nrefers to almost nobody but Bertrand in his book.\nOf course Bertrand lived through a time of political difficulties in France. The revolution of\n1830\nwas followed by a decade marked by repeated challenges to the King. However from\n1840\nthere was a stable period during which Bertrand was able to begin his career. The year\n1848\n, however, saw the overthrow of the monarchy and during this revolution Bertrand served as a Captain in the National Guard. After years of comparative stability, the Franco-Prussian war broke out in July\n1870\n. The French suffered a military disaster and Paris was under siege from the Prussian armies for four months from September\n1870\n. These were extremely difficult times for Bertrand and his family. Following the French defeat the people of Paris formed the Commune of Paris in March\n1871\n. The repression of the Paris Commune took place towards the end of May during a week of street fighting which saw Bertrand's house burned and many of his manuscripts were lost in the fire including an intended third volume of\nTraité de calcul différentiel et de calcul intégral\nⓉ\n(\nTreatise on differential and integral calculus\n)\nwhich he never rewrote. Bertrand also lost his manuscript of\nThermodynamique\nⓉ\n(\nThermodynamics\n)\nin the fire but he later rewrote the work. With his home destroyed Bertrand moved to Sèvres and later to Viroflay.\nIn fact Bertrand's home was particularly important to him for it provided the centre of a vigorous intellectual grouping. His family grew to include\nÉmile Picard\nwho married a daughter of\nHermite\nand Bertrand's sister Louise. In\n1881\nPaul Appell\nmarried Amelie, a niece of Bertrand and of\nHermite\nand a cousin of\nÉmile Picard\n. Let us return to note other effects of the French military defeat of\n1870\n. It led to considerable soul searching in France and, in particular, it was questioned whether science education, particularly the courses at the École Polytechnique, were responsible.  Bertrand, by this time one of the leading mathematicians in France, had to deal with the consequences as it was questioned whether the mathematics being taught was too theoretical, and so not preparing the leading young Frenchmen for the military.\nBertrand was appointed a member of the Paris\nAcademy of Sciences\nin\n1856\nand he served as its permanent secretary from\n1874\nto the end of his life. He was made a grand-officier of the Légion d'Honneur.\nStruik\n, in\n[\n1\n]\n, sums up Bertrand's place in the development of mathematics:-\nIn\n1895\nhis pupils gave him a medal in commemoration of his fifty years of teaching at the École Polytechnique. The influence of Bertrand's work, however, is hardly comparable to that of several of his contemporaries and pupils. Lest it be judged ephemeral, it must be viewed in the context of nineteenth-century Paris and of Bertrand's brilliant academic career, his exalted social position, and the love and respect given him by his pupils.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}