{
  "nome_completo": "Joseph Wolstenholme",
  "nome_curto": "Joseph Wolstenholme",
  "ano_nascimento": "1829",
  "ano_morte": "1891",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wolstenholme/",
  "lugar_nascimento": "Eccles (near Manchester), England",
  "lugar_morte": "Maida Vale, London, England",
  "biografia": "Joseph Wolstenholme\n's father was a Methodist minister. Joseph studied at Wesley College in Sheffield, then entered St John's College, Cambridge on\n1\nJuly\n1846\nand, four years later, he graduated as Third\nWrangler\n(\nhe was ranked third in the list of first class degrees given in mathematics that year\n)\n. The second wrangler that year was\nHenry Watson\n.\nWolstenholme was awarded a fellowship to St John's College in March\n1852\n. He accepted a fellowship from Christ's College, Cambridge in November of the same year. It appears that men from Lancashire were given preference at this time in the competition for fellowships at Christ's College. The fact that he had been at John's College and not Christ's College did result in a protest being made against his election but it was soon dropped.\nOn four occasions during the years that he held the fellowship at Christ's College Wolstenholme was an examiner for the mathematical tripos\n(1854\n,\n1856\n,\n1863\n,\n1870)\n. One of the conditions of fellowships was that the holder had to be unmarried, so when Wolstenholme wished to marry a Swiss girl on\n27\nJuly\n1869\n, he had to resign his fellowship. However, Wolstenholme continued to take pupils at Cambridge for two years after resigning his fellowship.\nIn\n1871\nWolstenholme was appointed professor of mathematics at the Royal Indian Engineering College at Cooper's Hill, near London. He held this post until he retired in\n1889\n.\nHe married Therese Wolstenholme\n(\nborn in Zürich, Switzerland about\n1851)\nand they had three children: Rowland\n(\nborn about\n1873)\n, Cecil\n(\nborn about\n1874)\nand Aubrey\n(\nborn about\n1877)\n.\nForsyth\nis quoted in\n[\n1\n]\n(\nand a shorter quote in\n[\n2\n]\n)\nregarding Wolstenholme's contributions to mathematics. Gow notes in\n[\n2\n]\nthat\nForsyth\ncampaigned strongly against the syllabus and the style of examinations at Cambridge so is likely to rate Wolstenholme's contribution to the traditional Cambridge system somewhat less than others:-\nWolstenholme was the author of a number of mathematical papers... . They were usually concerned with questions of analytical geometry, and they were marked by a peculiar analytical skill and ingenuity.\nHis greatest contribution towards mathematics was his volume of mathematical problems.\nForsyth\nnotes\n(\n[\n1\n]\nand\n[\n2\n]\n)\n:-\n... Wolstenholme's problems have proved a help and a stimulus to many students. A collection of some three thousand problems naturally varies widely in value, but many of them contain important results, which in other places or at other times would not infrequently have been embodied in original papers. As they stand, they form a curious and almost unique monument of ability and industry, active within a restricted range of investigation.\nGow in\n[\n2\n]\nshows up a rather different side of Wolstenholme's character. Leslie Stephen, the father of the author Virginia Woolf, studied mathematics at Cambridge and held a fellowship at Cambridge from\n1854\ntill\n1864\n. During that period he became friends with Wolstenholme. Several years after Wolstenholme's death, Stephen wrote down details of his own life for his children and in these he refers to Wolstenholme\n(\nsee\n[\n2\n]\n)\n:-\nI think especially of poor old Wolstenholme, called 'the woolly' by you irreverent children, a man whom I had first known as a brilliant mathematician at Cambridge, whose Bohemian tastes and heterodox opinions had made a Cambridge career inadvisable, who tried to become a hermit at Wastdale. He had emerged, married an uncongenial and rather vulgar Swiss girl, and obtained a professorship at Cooper's Hill. His four sons were badly brought up: he was despondent and dissatisfied and consoled himself with mathematics and opium. I liked him or rather was very fond of him, partly from old association and partly because feeble and faulty as he was, he was thoroughly amiable and clung to my friendship pathetically. His friends were few and his home life wretched. ...\n[\nWe\n]\nhad him stay every summer with us in the country. There at least he could be without his wife.\nThere is another side to this friendship between Wolstenholme and Stephen which is the main purpose of the article\n[\n2\n]\n. Stephen's daughter, Virginia Woolf, was a young girl when Wolstenholme shared the family holidays. She later incorporated Wolstenholme into one of her most famous books\nTo the Lighthouse\n. In this book Mr Augustus Carmichael is based on Wolstenholme.",
  "math_areas": []
}