{
  "nome_completo": "Jost Bürgi",
  "nome_curto": "Jost Bürgi",
  "ano_nascimento": "1552",
  "ano_morte": "1632",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burgi/",
  "lugar_nascimento": "Lichtensteig, St Gallen, Switzerland",
  "lugar_morte": "Kassel, Hesse-Kassel (now Germany)",
  "biografia": "Jost Bürgi\n's first name is sometime written as Joost, Jobst or Justus while his second name is sometime written in a Latin form Byrgius. He was born in Lichtensteig, a small village of around\n400\ninhabitants at this time. His grandfather, Lienhard Bürgi, was a locksmith and a leading official of the village which had been divided by the Protestant Reformation. The Bürgi family was Protestant in a village which was equally divided between Protestants and Roman Catholics.\nIt is conjectured that Jost Bürgi decided to leave Lichtensteig, partly because of the religious divide and partly because of the lack of educational opportunities in the small town. Before leaving he had acquired a knowledge of reading and numeracy at elementary school but had not had the opportunity to progress beyond this basic stage. It is clear from the skills that he acquired over the floowing few years, that Bürgi must have served an apprenticeship to a blacksmith, instrument maker and watchmaker but no knowledge exists of the towns in which he served his apprenticeship. The leading cities for watchmaking skills at this time were Nuremberg, Augsburg and Cremona so, given the high level of his craftsmanship, one can guess that he must have worked in one or more of these towns. We are able to say with more certainty that he was in Strasbourg for some time during\n1570\n-\n74\nwhen Josia and Isaac Habrecht were building an astronomical clock for Strasbourg cathedral. The Swiss mathematician Konrad Dasypodius, who was the professor of mathematics at the University of Strasbourg, had designed the astronomical clock and is likely that Bürgi acquired his expertise in mathematics from Dasypodius or his pupils. Although Bürgi never learnt Latin\n(\nthe language of science at this time\n)\n, he was very knowledgeable in mathematics and astronomy with skills compatible with having been immersed in the scientific circle in Strasbourg, but certainly not as part of a university course.\nThe Landgraf of Hesse-Kassel at this time was Wilhelm IV, an excellent mathematician and astronomer, who had maintained connections with Strasbourg where he had undergone his scientific training. Certainly Wilhelm was aware that Bürgi was the most skilful instrument maker of his day for he employed him from\n1579\n. On\n25\nJuly\n1579\nthe Landgraf of Hesse-Kassel Wilhelm IV asked Bürgi to become a watchmaker to the court in Kassel, to develop scientific instruments, and assist in the observation of stars which would confirm the heliocentric model described by\nCopernicus\n. The Landgraf, as we have mentioned, was trained in astronomy and it is often not realised that he was an exceptional astronomer whose observations, particularly those of the fixed stars, were on the whole at least as accurate as those by\nTycho Brahe\n. At Kassel, the Landgraf had built an Observatory, one of the first buildings constructed specifically for astronomical observations. As part of his duties Bürgi made sextants, celestial globes and highly accurate clocks for use in this Observatory. The Landgraf also appointed the mathematician Christoph Rothmann to work in the Observatory in\n1584\n; he worked there for six years. The Landgraf wrote to\nTycho Brahe\non\n14\nApril\n1586\ntelling him about a highly accurate clock which Bürgi had built which, for the first time, had a minute hand, registered seconds and had an error of less than a minute in\n24\nhours. Christoph Rothman wrote about this remarkable new clock\n[\n14\n]\n:-\nThe duration of a second is not very short but resembles the length of the shortest note in a moderately slow song. The balance is not like the current models, but was invented in such a way that each of its beats represents one second.\nA picture of the clock and of its dial is at\nTHIS LINK\n.\nA picture of one of Bürgi's celestial globes is at\nTHIS LINK\n.\nBürgi's clock had an innovative cross-beat escapement with an independent system added to the traditional wheel-train to give a considerably more constant pressure to the escapement so leading to the greater accuracy. For the first time a clock was sufficiently accurate to be used in astronomy with relative positions of stars being calculated by timing their crossing of the sights of a telescope. The Landgraf was delighted with Bürgi's abilities and described him in a letter to\nTycho Brahe\nas:-\n... having the innovative capacity of a second\nArchimedes\n.\nAfter Rothmann left the Kassel Observatory in\n1590\n, Bürgi became official mathematician and astronomer to the Court. Later\nWillebrord Snell\ndescribed Bürgi as\n[\n14\n]\n:-\n... an extraordinary personality, at the same time a brilliant clockmaker, competent astronomer and excellent mathematician - a unique combination in the history of watchmaking.\nIn\n1591\nBürgi became naturalised in the city of Kassel. He had married the daughter of David Bramer, who was a pastor in Felsberg near Kassel, but the marriage was childless. In\n1591\nDavid Bramer died and Bürgi adopted his wife's brother,\nBenjamin Bramer\n, David Bramer's three year old son. Bürgi went on to teach the boy mathematics and astronomy to such a high level that he became one of the leading scientists of his day. The year\n1591\nwas significant for Bürgi in yet another way, for in that year he completed his astronomical clock which was based on\nCopernicus\n's heliocentric system, quite a bold move at a time when the Church was moving against anyone holding heliocentric views. One could reasonably ask how Bürgi, who knew no Latin, could have known the details of the Copernican system and here we can give a clear answer since Nicolaus Reimers worked at the Observatory in Kassel in\n1586\n-\n87\nand made a translation of\nCopernicus\n's\nDe revolutionibus orbium coelestium\nfrom Latin to German for Bürgi to study. A copy of this translation, called the \"Grazer Handschrift\", has survived to this day. By the time Bürgi made his astronomical clock he was using his own version of logarithms, invented for his own use to aid him in his astronomical calculations. It is not clear precisely when he started using logarithms but most historians believe that he invented them around\n1588\n. Even earlier, Bürgi was using the trigonometrical formulas\nsin\n⁡\na\nsin\n⁡\nb\n=\n1\n2\n[\ncos\n⁡\n(\na\n−\nb\n)\n−\ncos\n⁡\n(\na\n+\nb\n)\n]\n\\sin a \\sin b = \\large\\frac{1}{2}\\normalsize [\\cos(a - b) - \\cos(a + b)]\nsin\na\nsin\nb\n=\n2\n1\n​\n[\ncos\n(\na\n−\nb\n)\n−\ncos\n(\na\n+\nb\n)\n]\nand\ncos\n⁡\na\ncos\n⁡\nb\n=\n1\n2\n[\ncos\n⁡\n(\na\n−\nb\n)\n+\ncos\n⁡\n(\na\n+\nb\n)\n]\n\\cos a \\cos b = \\large\\frac{1}{2}\\normalsize [\\cos(a - b) + \\cos(a + b)]\ncos\na\ncos\nb\n=\n2\n1\n​\n[\ncos\n(\na\n−\nb\n)\n+\ncos\n(\na\n+\nb\n)\n]\nto aid in multiplying numbers. To use these formulas, Bürgi computed sine tables called the\nCanon Sinuum\nwhich were never published and now sadly appear to be lost.\nIn February\n1592\nthe Holy Roman Emperor Rudolph II requested a mechanical astronomical globe from Bürgi to be delivered personally. On\n4\nJuly Bürgi had an audience with Rudolph in Prague, delivering the globe. Shortly after he returned to Kassel, the Landgraf of Hesse-Kassel Wilhelm IV died in August\n1592\nand was succeeded by his son Moritz. This had little affect on Bürgi since he had similar terms of employment from Moritz as he had from his father. Also in\n1592\nBürgi obtained a patent for his surveying instrument based on the method of triangulation. In\n1596\n, and again in\n1604\n, Bürgi again travelled to Prague.\nTycho Brahe\nhad been appointed as Imperial Mathematician to the Holy Roman Emperor, Rudolph II, in Prague in\n1599\nwith\nJohannes Kepler\nas his assistant.\nTycho Brahe\ndied in\n1601\nand\nKepler\nbecame Imperial Mathematician in Prague. With Moritz's consent, Bürgi was appointed by the Holy Roman Emperor Rudolph II in December\n1604\nand moved to Prague. He was given a workshop at Hradcany, Prague Castle, with two assistants and also worked with\nKepler\nwho was indebted to Bürgi for his introduction to algebra. There is strong evidence that\nKepler\ngot the idea for his third law of planetary motion from thinking about logarithms, and it must have been through discussions with Bürgi that logarithms were a common topic at Hradcany. The Holy Roman Emperor Rudolph II died in\n1612\n, and Bürgi continued to work for his successor Matthias in Prague.\nKepler\npersuaded Bürgi to write up his original and interesting work on logarithms\n(\nthe manuscript is largely in\nKepler\n's handwriting\n)\n, and it was printed in\n1620\n. Bürgi's method is different from that of\nNapier\nand was clearly invented independently.\nKepler\nwrote about Bürgi's logarithms in the introduction to his\nRudolphine Tables\n(1627)\n:-\n... as aids to calculation Justus Byrgius was led to these very logarithms many years before\nNapier\n's system appeared; but being an indolent man, and very uncommunicative, instead of rearing up his child for the public benefit he deserted it at birth.\nBürgi's first wife died and he married Catharina Braun in\n1611\n; they had no children. During the years that Bürgi worked in Prague, he made several visits back to Kassel. In\n1631\nhe returned to Kassel where he died in January of the following year. His grave no longer exists but a plaque has been erected in the cemetery to commemorate his being buried there. You can see it at\nTHIS LINK\n.\nIt reads:\nIn this cemetery lies buried\nthe Landgrave of Hesse's and\nthe Emperor's watchmaker and mathematician\nJost Bürgi\nborn February\n28\nth\n,\n1552\nin Lichtensteig, Switzerland\ndied January\n31\nst\n,\n1632\nin Kassel\ningenious designer of measuring instruments\nand celestial globes, builder of the\nmost precise clocks of the\n16\nth\ncentury,\ninventor of the logarithms.",
  "math_areas": []
}