{
  "nome_completo": "Julio Rey Pastor",
  "nome_curto": "Julio Rey Pastor",
  "ano_nascimento": "1888",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rey_Pastor/",
  "lugar_nascimento": "Logrono, Spain",
  "lugar_morte": "Buenos Aires, Argentina",
  "biografia": "Julio Rey Pastor\nentered a world of accelerating scientific activity, particularly in Spain. The establishment of La Institución Libre de Enseñanza in\n1876\nhad an enormous impact on the reinstatement of science in Spain. Founded by a group of professors who refused to adjust their methods to the official religious, political or moral dogmas, the aim of the institution was to defend the freedom of education. This idealism obliged them to pursue their goal on the fringes of intellectual society and thus create a private, education establishment.\nAdditionally, the German defeat of France in the Franco-Prussian War of\n1870\n, marked the end of French hegemony in continental Europe and a significant shift from a French-orientated Spanish culture to one of German orientation. This was of great importance since it would transcend to Latin America through mathematicians such as Rey Pastor,\nEsteban Terradas\nand many others.\nWhen Santiago Ramon y Cajal became the first Spaniard to win the Nobel Prize, together with Camillo Golgi in\n1901\nfor their work on the structure of the nervous system, it seemed that the Spanish scientific community had finally awoken from a period of prolonged stagnation. Following this in\n1907\nwas the creation of La Junta Para Ampliación de Estudios, which arose as a result of Spain's cultural self-reflection after losing her final colonies. The key objective of the organisation was: Pedagogic renovation through the provision of grants in order to elevate Spanish culture and bring it to the level of the most advanced countries in Europe, such as Germany. This was to have a direct effect on Julio Rey Pastor.\nEducated at home until the age of twelve, Rey Pastor began studying at his local secondary school, El Instituto Sagasta, in\n1900\n. He had broad interests in his youth and before he became completely occupied with mathematics, he wrote poetry. Having failed the mathematics section of the entrance examination for the Military Academy in Zaragoza, he began studying science at Zaragoza University in\n1904\n. It was here that his true vocation for mathematics was awoken and he published his first paper in\n1905\n, entitled\nSobre los números consecutivos cuyo suma es a la vez cuadrado y cubo perfecto\nⓉ\n(\nConsecutive numbers whose sum is both a square and a perfect cube\n)\n. He graduated with a PhD in algebraic geometry from Madrid University in\n1910\n.\nBetween\n1908\nand\n1910\n, Rey Pastor founded the Real Sociedad Matemática Espanola with the support of José Echegaray and General Benitez. In\n1911\n, Pastor was appointed secretary of the society and, in the same year, he became Professor of Mathematical Analysis at the University of Oviedo. The university, situated in Oviedo in northern Spain, was an ancient one founded in\n1608\n. It was here that he wrote the controversial inaugural address for the academic year\n1913\n-\n1914\n, in which he candidly discussed the lamentable state of Spanish science since the sixteenth century. As a consequence, Rey Pastor was accused of being unpatriotic and his reputation suffered significantly. An example of his frank discourse may be seen his\n1915\nInaugural Discourse, where Rey Pastor discusses the development of science in Spain.\nYou can see\na translation of part of this address\n.\nBetween\n1911\nand\n1916\n, La Junta Para Ampliación de Estudios funded Rey Pastor to carry out a series of visits to Germany. This resulted in two major publications on geometry in\n1912\nand\n1916\n. The\n1916\nmonograph was on synthetic geometry in\nn\nn\nn\n-dimensions and introduced\n[\n1\n]\n:-\n... concepts of great generality\n(\nfor example the definition of the curve\n)\nand developing them in all their consequences.\nIn\n1915\nRey Pastor moved to a chair at Madrid University, where he published the highly acclaimed,\nFundamentos de la geometría proyectiva superior\nⓉ\n(\nFundamentals of higher projective geometry\n)\n. However he was not one to remain fixed in one place for a long time and went to Barcelona in\n1915\nto give a series of lectures at the Institut d'Estudia. His lectures there on\nn\nn\nn\n-dimensional geometry and\nconformal mappings\n, developing the work of\nSchwarz\n, was written up by Esteban Terrades who attended the lectures, and the course was published in Catalan.\nRey Pastor was invited by the Institución Cultura Española to lecture at the University of Buenos Aires in\n1917\n. Although he was still a young man, only\n29\nyears old, he was asked to help promote mathematics in Argentina and a way was found to enable him to do this. A contract was proposed which enabled him to spend six months each year in Argentina and six months in Spain. Rey Pastor was pleased to sign the contract:-\n... to direct the advanced study of the exact sciences in Argentina.\nIt has been asserted that Don Rey Pastor was responsible for the creation of a distinctive Argentinean School of mathematical research and the reconstruction of science in Argentina. When he took up a\n6\n-year contract at Buenos Aires University in\n1921\n, the Science Faculty had only one PhD programme, which had barely progressed since\n1900\n. Between then and Rey Pastor's arrival, there had been some small improvement in the engineering courses, but all the other further mathematics courses were in a severe state of stagnation. Rey Pastor needed to persuade the engineering professors of the importance of mathematics beyond the elementary textbooks, which they had previously been using.\nHe had been invited by the Institución Cultura Espanola, to give a lecture course at the University of Buenos Aires in\n1917\n. This first course, given as a visiting lecturer, was an introduction to\nKlein\n's\nErlangen Programme\n. In this course, Rey Pastor presented his students with the concept of geometry based on group theory, using methods of establishing invariants of each group, with topological methods being the most general. His second course, given in\n1921\n, was a specialised one for engineering students and included the following topics: functions of a complex variable, conformal mapping, advanced geometry\n(\nnon-euclidean\n)\n, mathematical analysis and mathematical methodology. Many of these topics, although commonplace in Europe, were entirely new and revolutionary to Argentinean mathematicians. As a consequence, Rey Pastor succeeded in gaining popularity amongst the students, whilst receiving stern criticism from his contemporary old school professors, who regarded him a foreign usurper.\nRey Pastor focused mainly on teaching engineering, but he recruited many pure mathematics students to his courses since he regarded the engineering courses on the techniques of calculation good preparation for pure mathematicians. He believed it was important to maintain an understanding of both areas of mathematics and it was this characteristic, panoramic vision of his, which allowed his students to appreciate the profundity of the new concepts he was teaching them. By separating mathematics from its purely technical aspect, he attracted a wide audience on both sides of the Atlantic Ocean.\nRey Pastor founded the Sociedad Matemática Argentino  in\n1924\n. In\n1927\n, he was given a permanent appointment at the University of Buenos Aires and held two chairs: one of Mathematical Analysis and the other of Higher Geometry. This was to have a profound and transcending impact on Argentinean mathematics. In\n1928\n, he founded an influential mathematical seminar El semenario Matemático Argentina\n(\nsimilar to the one he had set up in Madrid\n)\n. The seminar published a bulletin, which contained the first modern research in Argentinean mathematics. He also brought important foreign mathematicians to the university to give short courses, including:\nFrederigo Enriques\n(1925)\n,\nFrancesco Severi\n(1930)\n,\nTullio Levi-Civita\n(1937)\n,\nÉmile Borel\n(1928)\nand\nJacques Hadamard\n(1930)\n. In the\n1940\n's, Pastor's best students began gaining international recognition. Amongst them were:\nAlberto González Domínguez\n, who became an important quantum physicist;\nAlberto Calderón\n, who would become the chairman of the Department of Mathematics at Chicago University; and many more who considerably enhanced the collective teaching capacity of the mathematical community.\nIn\n1931\n, Rey Pastor published one of his most elegant works on analysis in the\nRendiconti del Circolo Matematico di Palermo\n, an Italian mathematical journal. It dealt with the study of the method of summation of series. This article by Rey Pastor is framed by a long series of works, begun at the beginning of the twentieth century, on problems of summing series, convergence algorithms, singular integrals and comparative studies of series and integrals. He first presented his work in this area in\n1926\nin his course on \"Series and Integrals\" which he gave at Buenos Aires University. The same course, slightly amplified, was repeated in Madrid in\n1928\n. The same year Rey Pastor presented a summary of his ideas in his paper given to the International Congress of Mathematicians at Bologna, which he attended with a large group of his Argentinean students. He continued working on problems related to the theory of summation of divergent series throughout the\n1930\n's and published much of his work in international journals. The themes which Rey Pastor dealt with in this period had considerable influence on the development of Argentinean mathematics.\nIn\n1952\nhe was expelled from Argentina despite his efforts to remain apolitical. However, he retired with the satisfaction of having initiated the transformation of Argentinean mathematics. He contributed exceptionally to the development of investigation into pure mathematics and trained a new school of Argentinean engineers with a modern outlook. Furthermore, his teaching opened the doors to the study of the history of science and laid the foundations for generations of secondary school teachers with his influential textbooks. In\n1954\nhe returned to Argentina and joined La Academía de Lengua.\nThe history of mathematics had always interested Rey Pastor and late in his career his interests in historical topics extended to cartography. Of course Spain has a reputation for remarkable cartography so his monograph\n(\nwritten jointly with E Garcia Camarero in\n1960)\non the history of Spanish cartography was a particularly useful addition to knowledge of the topic.\nExamining his textbooks gives us insight into Rey Pastor's ideas concerning teaching of mathematics. In the introduction to\nAlgabraic Analysis\n, Rey Pastor comments that rather than follow the general tendency of elevating elemental problems to the point of abstraction, it is his goal to simplify complicated questions whilst maintaining a rigorous approach. He adds that all abstract thought requires a pre-existing knowledge base, which many students lack when they arrive at university and, which they expect to gain over the course of their degree. According to Rey Pastor however, it is a didactic mistake and historically absurd to attempt to approach the concepts of analysis in this contrary manner.\nHe died at his home in Buenos Aires.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Topology"
  ]
}