{
  "nome_completo": "Julius König",
  "nome_curto": "Julius König",
  "ano_nascimento": "1849",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Konig_Julius/",
  "lugar_nascimento": "Györ, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Julius König\n(\nor\nGyula König\n)\nwent to both primary and secondary school in Györ. At first he excelled in literature and it looked at one stage as though this would be the topic that he would study at university. However, after leaving the secondary school in Györ when he was sixteen years old, he went to study medicine in Vienna.\nThe course that König followed in the Medical School of Vienna University included a thorough study of mathematics and the natural sciences. Feeling now that he wanted to follow a course in the natural sciences, although still retaining his medical interests, he went to Heidelberg which had an excellent reputation for science with famous men such as Bunsen,\nKirchhoff\nand\nHelmholtz\non the teaching staff. His first research paper was written on a topic suggested by\nHelmholtz\nand considered a medical topic. The paper was published by the Vienna Academy of Sciences in\n1870\n.\nPerhaps the most significant event which turned König's interests firmly towards mathematics happened in\n1869\nwhen\nKönigsberger\nleft Greifswald to take up the appointment of a chair of mathematics at Heidelberg.\nKönigsberger\nhad been greatly influenced by\nWeierstrass\n's lectures on\nelliptic functions\nand this was the topic which interested him at this time, so he in turn influenced König to also undertake research on elliptic functions. König worked on his doctoral dissertation under\nKönigsberger\n's supervision and submitted his thesis\nZur Theorie der Modulargleichungen der elliptischen Functionen\nⓉ\n(\nOn the theory of modular equations of elliptic functions\n)\nto Heidelberg in\n1870\n. He was awarded his doctorate in June\n1870\n, and his thesis was published in the following year.\nAfter being awarded a doctorate from Heidelberg König went to Berlin where he spent six months attending lectures by\nWeierstrass\nand\nKronecker\n. He then returned to Budapest where he was appointed as a\ndozent\nat the University in\n1871\n. He became a professor at the Teacher's College in Budapest in\n1873\nand, in the following year, was appointed professor at the Technical University of Budapest. This was a period when improvements in Hungary's economic position led to a need for education and consequently a need to train more school teachers. The mathematical level began to rise steadily and the Technical University of Budapest was established in\n1871\nwith the right of issuing diplomas. König joined the University at a time when there were other talented and enthusiastic mathematicians on the staff. König took a lead in a new venture which these mathematicians embarked on, namely the founding of a new mathematical journal\nMüegyetemi Lapok\n. The first issue appeared in\n1876\nand a part was produced each month. Sadly only\n3\nvolumes and\n30\nissues appeared before it was forced to close. The editors wrote in the final issue:-\nWith this issue the Technical University Journal has come to the end of its career. It seems that here in Hungary no mathematical journal can exist without financial support. Of course, if there were only half as many readers of mathematics as there are teachers, things would be quite different.\nIt was with great sadness that König was forced to admit that the venture which he had thought so highly of could not continue after so short a time.\nPerhaps it was to teaching, rather than to research, that König made the most important contributions. He raised the level of mathematics teaching at the Technical University to a high standard, in fact it was a level which the engineers must have found very demanding. Szénássy writes\n[\n2\n]\n:-\nKönig was extremely conscientious and he expected the same of his students. He went into details whatever the subject be and analysed everything thoroughly even for students of the Technical University. He emphasised the importance of the quality rather than the quantity of knowledge, and he tried to get his students to acquire an exact mathematical thinking.\nHe contributed to the Technical University in other roles too. He was on three occasions Dean of the Engineering Faculty and also on three occasions he was Rector of the University.\nKönig worked on a wide range of topics in algebra, number theory, geometry, set theory, and analysis. One of his early ideas was a paper of\n1872\nwhich looked at intuitive ways to prove the consistency of non-Euclidean geometries. He published many research papers in analysis, but his greatest significance in this area comes from the excellent textbooks which he wrote on the topic. His most important work written in\n1903\nis based on a fundamental study by\nKronecker\npublished in\n1892\n. König developed\nKronecker\n's polynomial ideals and presented many results on\ndiscriminants\nof forms, elimination theory and\nDiophantine problems\n. König's work on polynomial ideals influenced\nHilbert\n,\nLasker\n,\nMacaulay\n,\nEmmy Noether\n,\nvan der Waerden\nand Gröbner but they simplified his ideas so König's work is now only of historical interest.\nIn the last eight years of his life König's interests turned towards set theory and he contributed to the\ncontinuum hypothesis\n. In August\n1904\n, at the International Congress of Mathematicians at Heidelberg, he announced that the continuum hypothesis was false\n[\n2\n]\n:-\n... what a sensation the announcement of the title of König's lecture .. stirred among the participants of the Congress. All section meetings were cancelled so that everyone could hear his contribution.\nKönig's proof contains an error in that he applied a theorem due to\nFelix Bernstein\nin a case where it does not hold. It was a little while before\nZermelo\nfound the error in the proof and then in\n1905\nFelix Bernstein\npublished a short note correcting his theorem. König retired from his post at the Technical University in\n1905\nbut he continued to lecture there particularly on topics that he was interested in. Clearly retirement had been undertaken so that he could spend more time on things which he wanted to do - is this not the reason why many academics take early retirement? He spent the last part of his life working on his own approach to set theory, logic and arithmetic, which was published in\n1914\n, the year after his death. He had been working on the final chapter at the time of his death.\nWe should mention König's contribution to mathematics teaching at secondary schools in Hungary. He worked out the algebra part of the syllabus and wrote some fine textbooks to support the teaching. He also contributed to the\nHungarian Academy of Sciences\n, which he was elected to in\n1889\n, serving on the Board for\n19\nyears. As a member of the Board of Directors of the largest publishing house in Hungary he had a wealth of expertise and experience to share with his colleagues.\nKönig married and had two sons;\nDénes\nwas a talented mathematician, while György was an expert on the history of literature. We mentioned at the beginning of this article that in his young days König had a love of literature, so it is easy to see why one of his sons might have followed this career. König retained his love of literature and reading was throughout his life his favourite hobby.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}