{
  "nome_completo": "Karen Keskulla Uhlenbeck",
  "nome_curto": "Karen Uhlenbeck",
  "ano_nascimento": "1942",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Uhlenbeck_Karen/",
  "lugar_nascimento": "Cleveland, Ohio, USA",
  "lugar_morte": null,
  "biografia": "Karen Uhlenbeck\n's father Arnold Keskulla, was an engineer and her mother Carolyn Windeler Keskulla, was an artist. She grew up in the country, the eldest of four children. Many mathematicians know from early age that mathematics will be their life but this was not so with Karen Uhlenbeck. As a child she was interested in books and this led her to an interest in science. She writes\n[\n2\n]\n:-\nAs a child I read a lot, and I read everything. I'd go to the library and then stay up all night reading. I used to read under the desk in school. ... we lived in the country so there wasn't a whole lot to do. I was particularly interested in reading about science. I was about twelve years old when my father began bringing home Fred Hoyle's books on astrophysics. I found them very interesting. I also remember a little paperback book called \"One, Two, Three,\n(\nand, in?\n)\nInfinity\" by George Gamow, and I remember the excitement of understanding this very sophisticated argument that there were two different kinds of infinities.\nUhlenbeck entered the University of Michigan with the intention of studying physics but a combination of studying exciting mathematics courses and finding that physics practicals were not a strong point lead her to change to mathematics. She was awarded a B.S. in mathematics in\n1964\n.\nAfter graduating from the University of Michigan, Uhlenbeck continued her studies at the\nCourant\nInstitute in New York. However at this time she married and decided to follow her husband when he went to Harvard. She entered Brandeis University and was awarded a Master's Degree in\n1966\n. She remained at Brandeis to study for her doctorate under Richard Palais' supervision, and was awarded a Ph.D. in\n1968\n.\nHer first appointment was a one year post in\n1968\n-\n69\nat Massachusetts Institute of Technology. Then another temporary post, this time a two year one as a lecturer at the University of California, Berkeley during\n1989\n-\n71\n. She describes her search for a permanent position\n[\n2\n]\n:-\nI was told, when looking for jobs after my year at MIT and two years at Berkeley, that people did not hire women, that women were supposed to go home and have babies. So the places interested in my husband - MIT, Stanford, and Princeton - were not interested in hiring me. I remember that I was told that there were nepotism rules and that they could not hire me for this reason, although when I called them on this issue years later they did not remember saying these things ... I ended up at the University of Illinois, Champaign-Urbana because they hired me, and my husband came along. In retrospect I realized how remarkably generous he was because he could have been at MIT, Stanford, or Princeton. I hated Champaign-Urbana - I felt out of place mathematically and socially, and it was ugly, bourgeois and flat.\nAfter being on the faculty at Urbana-Champaign from\n1971\nto\n1976\n, she moved to the University of Illinois at Chicago where she was promoted to full professor. At this time she:-\n... became friends with\nS T Yau\n, whom I credit with generously establishing my finally and definitively as a mathematician.\nIn\n1983\nshe was awarded a MacArthur Prize Fellowship and moved to a professorship at the University of Chicago. In\n1988\nUhlenbeck was appointed Professor in the University of Texas at Austin where she also holds the Sid W Richardson Foundation Regents Chair in Mathematics.\nUhlenbeck is a leading expert on\npartial differential equations\nand describes her mathematical interests as follows\n[\n2\n]\n:-\nI work on partial differential equations which were originally derived from the need to describe things like electromagnetism, but have undergone a century of change in which they are used in a much more technical fashion to look at the shapes of space. Mathematicians look at imaginary spaces constructed by scientists examining other problems. I started out my mathematics career by working on Palais' modern formulation of a very useful classical theory, the\ncalculus of variations\n. I decided\nEinstein\n's general relativity was too hard, but managed to learn a lot about geometry of space time. I did some very technical work in partial differential equations, made an unsuccessful pass at shock waves, worked in scale invariant variational problems, made a poor stab at three dimensional\nmanifold\ntopology\n, learned gauge field theory and then some about applications to four dimensional manifolds, and have recently been working\nn\nn\nn\nequations with algebraic infinite symmetries.\nUhlenbeck's work provided analytic tools to use instantons as an effective geometric tool. In\n[\n1\n]\nSimon Donaldson\nreminisces about the work on the applications of instantons that led him to receive a\nFields Medal\nin\n1986\n. He describes the \"bubbling\" phenomenon saying:-\nIn fact the papers of Uhlenbeck which appeared about that time\n[\nin\n1982]\ncontained essentially all the analysis required to put this picture on a firm footing. The papers do not discuss \"bubbling\" explicitly - perhaps the arguments were supposed to be obvious to experts by analogy with the work of Sacks and Uhlenbeck in the harmonic maps case.\nIn\n1988\nUhlenbeck lectured on\nInstantons and Their Relatives\nat the Centennial Celebration of the\nAmerican Mathematical Society\n.\nWitten\n, who gave the next talk on\nGeometry and quantum field theory\nat the symposium said:-\nIn the talk just before mine, Karen Uhlenbeck described some purely mathematical developments that at least roughly might be classified in this area. She described advances in geometry that have been achieved through the study of systems of nonlinear partial differential equations. Among other things, she sketched some aspects of\nSimon Donaldson\n's work on the geometry of four-dimensional manifolds, instantons - solutions, that is, of a certain nonlinear system of partial differential equations, the self-dual Yang-Mills equations, which were originally introduced by physicists in the context of quantum field theory.\nTwo years later, in\n1990\n,\nWitten\nreceived a Fields Medal for his work on topological quantum field theories. At the same International Congress of Mathematicians in Kyoto, Karen Uhlenbeck was a Plenary Speaker.\nAmong the many honours that Uhlenbeck has received for her work one should mention in particular that she was elected a Member of the\nAmerican Academy of Arts and Science\nin\n1985\nand a Member of the\nNational Academy of Sciences\nthe following year.\nShe has also served on the editorial boards of many journals; a complete list to date is\nJournal of\nDifferential Geometry\n(1979\n-\n81)\n,\nIllinois Journal of Mathematics\n(1980\n-\n86)\n,\nCommunications in Partial Differential Equations\n(1983\n-\n)\n,\nJournal of the American Mathematical Society\n(1986\n-\n91)\n,\nErgebnisse der Mathematik\n(1987\n-\n90)\n,\nJournal of Differential Geometry\n(1988\n-\n91)\n,\nJournal of Mathematical Physics\n(1989\n-\n)\n,\nHouston Journal of Mathematics\n(1991\n-\n)\n,\nJournal of\nKnot Theory\n(1991\n-\n)\n,\nCalculus of Variations and Partial Differential Equations\n(1991\n-\n)\n,\nCommunications in Analysis and Geometry\n(1992\n-\n)\n.\nAmong the medals and prizes she has received we mention first the President's National Medal of Science which was awarded to her at an awards ceremony at the National Building Museum, Washington, DC, on Friday,\n1\nDecember\n2000\n:-\nFor her many pioneering contributions to global geometry that resulted in advances in mathematical physics and the theory of partial differential equations. Her research accomplishments are matched by her leadership and passionate involvement in mathematics training and education.\nShe was awarded honorary doctorates by the University of Illinois, Champaign in\n2000\n, by the University of Ohio in\n2001\n, by the University of Michigan in\n2004\n, and by Harvard University in\n2007\n. On Saturday\n6\nJanuary\n2007\nshe received the\nAmerican Mathematical Society\n's Leroy P Steele Prize at the Joint Mathematics Meeting in New Orleans, Louisiana. The award was made\n[\n5\n]\n:-\n... for her foundational contributions in analytic aspects of mathematical gauge theory in the papers \"Removable singularities in Yang-Mills fields\"\n(1982)\nand \"Connections with bounds on curvature\"\n(1982)\n.\nHer reply to the Award began:-\nI thank the\nAmerican Mathematical Society\n, its members and the Steele Prize committee for the honour and the award of the Steele Prize. This honour confirms what I have been suspecting for quite some time. I am becoming an old mathematician, if I am not already there. It gives me cause to look back at my research and teaching. All in all, I have found great delight and pleasure in the pursuit of mathematics. Along the way I have made great friends and worked with a number of creative and interesting people. I have been saved from boredom, dourness and self-absorption. One cannot ask for more.\nLater in her response she said:-\nStarting from my days in Berkeley, the issue of women has never been far from my thoughts. I have undergone wide swings of feeling and opinion on the matter. I remain quite disappointed at the numbers of women doing mathematics and in leadership positions. This is, to my mind, primarily due to the culture of the mathematical community as well as harsh societal pressures from outside. Changing the culture is a momentous task in comparison to the other minor accomplishments I have mentioned.\nIn\n2008\nUhlenbeck was elected an honorary member of the\nLondon Mathematical Society\n. The citation begins:-\nKaren Uhlenbeck is a distinguished mathematician of the highest international stature, specialising in differential geometry, non-linear partial differential equations and mathematical physics. Professor Uhlenbeck is one of the United States' most eminent mathematicians, and perhaps the most distinguished woman mathematician of our time. At the same time, Uhlenbeck's efforts across the educational spectrum, especially her role as a founder of the Park City-IAS Mathematical Institute, have added vitality to the mathematical scene. Professor Uhlenbeck's mentoring is legendary, both formal\n(\nshe co-founded the annual Women in Mathematics programme at the IAS\n)\nand informal, of women mathematicians.\nKaren Uhlenbeck was elected a Fellow of the\nAmerican Mathematical Society\nin\n2012\n. Also in\n2012\nshe was awarded an honorary doctorate by Princeton University. In March\n2019\nshe became the first woman to receive the\nAbel\nPrize:-\n... for her pioneering achievements in geometric partial differential equations, gauge theory and integrable systems, and for the fundamental impact of her work on analysis, geometry and mathematical physics.\nThe full citation\n[\n4\n]\nis rather technical, but we give it for those who have the necessary background knowledge:-\nKaren Keskulla Uhlenbeck is a founder of modern Geometric Analysis. Her perspective has permeated the field and led to some of the most dramatic advances in mathematics in the last\n40\nyears.\nGeometric analysis is a field of mathematics where techniques of analysis and differential equations are interwoven with the study of geometrical and topological problems. Specifically, one studies objects such as curves, surfaces, connections and fields which are critical points of functionals representing geometric quantities such as energy and volume. For example, minimal surfaces are critical points of the area and harmonic maps are critical points of the\nDirichlet\nenergy. Uhlenbeck's major contributions include foundational results on minimal surfaces and harmonic maps, Yang-Mills theory, and integrable systems.\nAn important tool in global analysis, preceding the work of Uhlenbeck, is the Palais-\nSmale\ncompactness condition. This condition, inspired by earlier work of\nMorse\n, guarantees existence of minimisers of geometric functionals and is successful in the case of\n1\n-dimensional domains, such as closed geodesics.\nUhlenbeck realised that the condition of Palais-\nSmale\nfails in the case of surfaces due to topological reasons. The papers of Uhlenbeck, co-authored with Sacks, on the energy functional for maps of surfaces into a Riemannian manifold, have been extremely influential and describe in detail what happens when the Palais-\nSmale\ncondition is violated. A minimising sequence of mappings converges outside a finite set of singular points and by using rescaling arguments, they describe the behaviour near the singularities as bubbles or instantons, which are the standard solutions of the minimising map from the\n2\n-sphere to the target manifold.\nIn higher dimensions, Uhlenbeck in collaboration with\nSchoen\nwrote two foundational papers on minimising harmonic maps. They gave a profound understanding of singularities of solutions of non-linear elliptic partial differential equations. The singular set, which in the case of surfaces consists only of isolated points, is in higher dimensions replaced by a set of codimension\n3\n.\nThe methods used in these revolutionary papers are now in the standard toolbox of every geometer and analyst. They have been applied with great success in many other partial differential equations and geometric contexts. In particular, the bubbling phenomenon appears in many works in partial differential equations, in the study of the\nYamabe\nproblem, in\nGromov\n's work on pseudoholomorphic curves, and also in physical applications of instantons, especially in string theory.\nAfter hearing a talk by\nAtiyah\nin Chicago, Uhlenbeck became interested in gauge theory. She pioneered the study of Yang-Mills equations from a rigorous analytical point of view. Her work formed a base of all subsequent research in the area of gauge theory.\nGauge theory involves an auxiliary vector bundle over a Riemannian manifold. The basic objects of study are connections on this vector bundle. After a choice of a trivialisation\n(\ngauge\n)\n, a connection can be described by a matrix valued\n1\n-form. Yang-Mills connections are critical points of gauge-invariant functionals. Uhlenbeck addressed and solved the fundamental question of expressing Yang-Mills equations as an elliptic system, using the so-called\nCoulomb\ngauge. This was the starting point for both Uhlenbeck's celebrated compactness theorem for connections with curvature bounded in\nL\np\nL^{p}\nL\np\n, and for her later results on removable singularities for Yang-Mills equations defined on punctured\n4\n-dimensional balls. The removable singularity theory for Yang-Mills equations in higher dimensions was carried out much later by Gang Tian and\nTerence Tao\n. Uhlenbeck's compactness theorem was crucial in Non-Abelian\nHodge\nTheory and, in particular, in the proof of the properness of Hitchin's map and Corlette's important result on the existence of equivariant harmonic mappings.\nAnother major result of Uhlenbeck is her joint work with\nYau\non the existence of Hermitian Yang-Mills connections on stable holomorphic vector bundles over complex n-manifolds, generalising an earlier result of\nDonaldson\non complex surfaces. This result of\nDonaldson\n-Uhlenbeck-\nYau\nlinks developments in differential geometry and algebraic geometry, and is a foundational result for applications of heterotic strings to particle physics.\nUhlenbeck's ideas laid the analytic foundations for the application of gauge theory to geometry and topology, to the important work of\nTaubes\non the gluing of self-dual\n4\n-manifolds, to the ground-breaking work of\nDonaldson\non gauge theory and\n4\n-dimensional topology, and many other works in this area. The book written by Uhlenbeck and Dan Freed on \"Instantons and\n4\n-Manifolds\" instructed and inspired a generation of differential geometers. She continued to work in this area, and in particular had an important result with Lesley Sibner and Robert Sibner on non self-dual solutions to the Yang-Mills equations.\nThe study of integrable systems has its roots in\n19\nth century classical mechanics. Using the language of gauge theory, Uhlenbeck and Hitchin realised that harmonic mappings from surfaces to homogeneous spaces come in\n1\n-dimensional parametrised families. Based on this observation, Uhlenbeck described algebraically harmonic mappings from spheres into Grasmannians relating them to an infinite dimensional integrable system and Virasoro actions. This seminal work led to a series of further foundational papers by Uhlenbeck and Chuu-Lian Terng on the subject and the creation of an active and fruitful school.\nThe impact of Uhlenbeck's pivotal work goes beyond geometric analysis. A highly influential early article was devoted to the study of regularity theory of a system of non-linear elliptic equations, relevant to the study of the critical map of higher order energy functionals between Riemannian manifolds. This work extends previous results by\nNash\n,\nDe Giorgi\nand\nJürgen Moser\non regularity of solutions of single non-linear equations to solutions of systems.\nKaren Uhlenbeck's pioneering results have had fundamental impact on contemporary analysis, geometry and mathematical physics, and her ideas and leadership have transformed the mathematical landscape as a whole.\nThe\nAssociation for Women in Mathematics\nincluded her in the\n2020\nclass of AWM Fellows for\n[\n3\n]\n:-\n... her ground-breaking and profound contributions to modern geometric analysis; for establishing a career as one of the greatest mathematicians of our time, despite the considerable challenges facing women when she entered the field; for using her experiences navigating these challenges to create and sustain programs to address them for future generations of women. For a lifetime of breaking barriers; and for being the first woman to win the\nAbel\nPrize.\nShe was elected a Fellow of the\nRoyal Society\nin\n2023\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}