{
  "nome_completo": "Karl Georg Christian von Staudt",
  "nome_curto": "Karl von Staudt",
  "ano_nascimento": "1798",
  "ano_morte": "1867",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Von_Staudt/",
  "lugar_nascimento": "Imperial Free City of Rothenburg (now Rothenburg ob der Tauber, Germany)",
  "lugar_morte": "Erlangen, Bavaria (now Germany)",
  "biografia": "Karl von Staudt\n's parents were Sabine Maria Albrecht\n(1770\n-\n1857)\nand Johann Christian von Staudt\n(1755\n-\n1828)\n. Johann Christian studied at Göttingen returning to Rothenburg where he became the first city archivist. He married Sabine Albrecht in\n1790\nand their son Karl was born in\n1798\n. The family, which contained two brothers older than Karl, lived in a home in the Herrengasse in Rothenburg. When Karl was four years old, in\n1802\n, Rothenburg was annexed to Bavaria and this created a time of major upheaval. Johann Christian became the legal council for the city but major changes to the education system after the annexation saw the creation of the four-year Latin school in Rothenburg\n(\nnow the Reichsstadt\nGymnasium\n)\nwhich Karl attended. Completing his studies there in\n1813\n, since there was no high school in Rothenburg for him to attend, he entered the famous Carolinum-Alexandrinum Gymnasium in Ansbach\n(\nnow the Gymnasium Carolinum\n)\nin the autumn of\n1813\n.\nUp to this time von Staudt had no clear idea of the career he wanted to follow but his family expected him to follow one of the traditional family occupations of merchant or lawyer. However, at the Carolinum-Alexandrinum Gymnasium he was taught mathematics by Karl Heribert Ignatius Buzengeiger\n(1771\n-\n1835)\nand from this time on von Staudt knew that mathematics was the subject he loved. He completed his studies at the Gymnasium in\n1817\nbut did not go to university immediately, remaining in Ansbach where he had private lesson from Buzengeiger. The best mathematician at this time was\nCarl Friedrich Gauss\nin Göttingen and Buzengeiger advised von Staudt that he should go there to Göttingen and study under\nGauss\n. This was not a particularly easy thing for von Staudt to do since there were difficulties put in the way of anyone from Bavaria who wished to study in a university outside the Kingdom. Even von Staudt's father, who himself had studied at Göttingen, tried to persuade his son to attend one of the three Bavarian universities, Munich, Erlangen or Würzburg. Von Staudt, however, followed the advice of Buzengeiger and eventually overcoming the administrative problems, matriculated at the University of Göttingen, in the Kingdom of Hanover, on\n3\nMay\n1819\n.\nHe studied at the University of Göttingen for three years, attending many lecture courses by\nGauss\n.\nGauss\nwas employed in Göttingen as the director of the university observatory so, to work closely with him, von Staudt became involved in work on astronomical calculations. This early research work was on determining the orbit of a comet but his interests at this time were also in geometry. Through Buzengeiger he had come to know\nKarl Feuerbach\nand in\n1820\nsolved one of his problems by calculating the radius of the first \"\nFeuerbach\n's circle\". Despite completing some excellent work in Göttingen, von Staudt was eventually forced to leave the university and return to Bavaria due to family problems which required him to administer family estates. When he said his final farewell to\nGauss\n, his teacher is reported to have said to him \"Staudt, you can now learn nothing more from me\". He now needed a university that would give him a degree and his first choice was the Julius-Maximilians University of Würzburg, the nearest university to his home town of Rothenburg. Professors Andreas Metz\n(1767\n-\n1839)\nand Johann Schön\n(1771\n-\n1839)\nat Würzburg were not prepared to award him a doctorate, however, for he had not studied enough philosophy to fulfil the regulations. Von Staudt then tried the Friedrich-Alexander University of Erlangen where it appears that, based on the work he had done for\nGauss\ntogether with\nGauss\n's recommendation, he received a doctorate in\n1822\n.\nVon Staudt studied the state examinations to teach mathematics and science at a Gymnasium and on\n24\nOctober\n1822\nhe began his teaching practice at the Würzburg Gymnasium. He took the state examinations to become a Gymnasium teacher at Munich in October\n1824\nand was employed as a teacher at the Würzburg Gymnasium. In September\n1824\nhe was also appointed as a\ndozent\nat the Julius-Maximilians University of Würzburg although there was some opposition in the faculty since he did not have a philosophical training. Fortunately Prince Ludwig of Bavaria wanted to modernise the University of Würzburg so von Staudt's appointment was approved subject to the condition that he also remained as a teacher at the Würzburg Gymnasium. He had a reputation as an excellent teacher but having to lecture at the university and teach in the Gymnasium gave him an unacceptably high workload. He also seems to have been unhappy at the University and often quarrelled with other members of the faculty.\nThe Director of the Melanchthon-Gymnasium in Nürnberg was aware of von Staudt's fine reputation as a teacher so he offered him a position at his school. Unhappy with his situation in Würzburg, von Staudt accepted and began his teaching at the Melanchthon-Gymnasium on\n25\nOctober\n1827\n. Although there was no university in Nürnberg, he was also appointed professor of mathematics at the Polytechnic School at Nürnberg. His lectures were well received and soon students were coming from the nearby University of Erlangen to listen to them. His reputation in astronomy was high, largely due to the high opinion that\nGauss\nhad of him, and\nWilhelm Bessel\noffered him a position at the Albertus University of Königsberg in\n1829\n. Von Staudt, however, did not wish to leave Bavaria so did not accept\nBessel\n's offer.\nOn\n28\nOctober\n1832\nvon Staudt married Jeanette Drechsler\n(1809\n-\n1848)\n, the daughter of Ernst Konrad Drechsler who was a judge. This very happy marriage produced two children Eduard\n(1833\n-\n1899)\nand Mathhilde\n(1835\n-\n1885)\n. Von Staudt was appointed to the chair of mathematics at the Friedrich-Alexander University of Erlangen on\n23\nAugust\n1835\nand took up the position on\n1\nOctober. He held the chair in Erlangen for the rest of his life serving as Dean of the Faculty of Arts on two separate occasions,\n1849\n-\n50\nand\n1855\n-\n56\n.\nIn\n1825\nvon Staudt showed how to construct a regular\ninscribed\npolygon of\n17\nsides using only compasses. He turned to\nBernoulli numbers\nand in\nDe numeris Bernoullianis\nⓉ\n(\nOn the Bernoulli numbers\n)\n(1845)\ngave not only a proof of the von Staudt-\nClausen\ntheorem but also provided new significant results about properties of the numerators of Bernoulli numbers, given in form of congruences. An important work on\nprojective geometry\n,\nGeometrie der Lage\nⓉ\n(\nGeometry of Position\n)\nwas published in\n1847\n. It was the first work to completely free projective geometry from any metrical basis. Another of his publications on projective geometry was\nBeiträge zur Geometrie der Lage\nⓉ\n(\nContributions to the geometry of position\n)\n(1856\n-\n60)\n.\nJulian Coolidge\nexplains in\n[\n7\n]\nwhat led von Staudt to undertake this major work:-\nThis deep thinker perceived two essential weaknesses in the synthetic geometry of his predecessors.\n(\na\n)\nThe basis of projective relations was the cross ratio. This is projectively invariant but, as previously given, was based on distances and angles which are not in themselves unalterable.\n(\nb\n)\nWhat are imaginary points anyway? What can be said about them, except that they are imaginary?\nHe developed geometry so as to meet these difficulties. Karin Reich writes about\nGeometrie der Lage\nⓉ\n(\nGeometry of Position\n)\nin\n[\n18\n]\n:-\nIn this book Staudt tries to 'purify' the principles of projective geometry by removing all metrical notions. Thereby he also raised synthetic geometry to a new level. He laid emphasis on involution, with his influential quadrilateral construction. Together with\nPoncelet\n,\nGergonne\nand\nSteiner\n, he belongs to the founders of projective and synthetic geometry.\nGaston Darboux\nwrites\n[\n8\n]\n:-\n... von Staudt endeavoured to construct a geometry free from all metrical relations, and exclusively based upon relations of situation. It is in this spirit that his first work, the 'Geometrie der Lage'\n(1847)\nwas conceived. The author takes as his point of departure the harmonic properties of the complete quadrilateral and those of homologous triangles, proved solely by considerations of geometry of three dimensions, analogous to those of which the school of\nMonge\nhas made so frequent a use. In the first part of his work, von Staudt entirely omitted imaginary relations. It is only in his 'Beiträge', his second work, that, by a very original extension of\nChasles\n's method, he geometrically defined an isolated, imaginary element and distinguished it from its conjugate. This extension, although rigorous, is laborious and very abstract. ... By purely projective methods, von Staudt established a complete method for calculating the anharmonic ratios of the most general imaginary elements. ... the ingenuity which he displayed in arriving at his conclusions must be admired.\nGian-Carlo Rota\nwrites about Staudt's proof of the equivalence of synthetic and analytic projective geometry\n[\n19\n]\n:-\nNo significant progress has been made in simplifying von Staudt's proof. Even today, a full proof of von Staudt's theorem takes no less than twenty pages, including a number of unspeakably dull lemmas. Every geometer is dimly aware of the equivalence of synthetic and analytic projective geometry; however, few geometers have ever bothered to look up the proof, let alone to remember it.\nGarrett Birkhoff\n, in his treatise on lattice theory, a book purporting to deal precisely with this and related topics, gives the statement of von Staudt's theorem, and then gingerly refers the reader to a proof by\nEmil Artin\nthat was privately distributed in mimeographed form in the thirties at the University of Notre Dame. Von Staudt's theorem was so far removed from the mathematical mainstream, that in the thirties\nvon Neumann\nrediscovered it from scratch, with much the same proof as von Staudt's, while developing his theory of continuous geometries\n(\nI have been told by\nStan Ulam\nthat\nvon Neumann\n, upon learning of von Staudt's work done almost a century before him, fell into a fit of depression\n)\n.\nRobin Hartshorne explains how von Staudt's contributions came to be fully appreciated\n[\n13\n]\n:-\nIt seems clear that von Staudt's work was not understood or appreciated when it first appeared.\nMax Noether\n, in his memorial on von Staudt\n(\n[\n3\n]\n)\n, says that at the time of publication of the third part of the 'Beiträge' in\n1860\n, which coincided with the\n25\nth\nanniversary of von Staudt's professorship in Erlangen, his colleagues could not appreciate the value of his path-breaking work, but respected the professor who continued his own rigorous solitary research.\nTheodor Reye\n, whose lectures on von Staudt's approach to projective geometry were first published in\n1866\n, says in his preface that the austere language, the extreme abstractness of presentation, and the lack of diagrams have hindered the well-deserved recognition of von Staudt's work. Perhaps\nReye\n's lectures began to reawaken interest in von Staudt. But it seems to me that it was probably\nFelix Klein\n, with his interest in the foundations of geometry and the so-called non-Euclidean geometries, who focused attention again on von Staudt.\nKlein\nin\n1873\nclaimed there was a gap in von Staudt's proof of a key result\n(\nwhat we now call the Fundamental Theorem of Projective Geometry\n)\n, which could only be filled by an axiom of continuity.\nKlein\n's article drew responses from\nCantor\n,\nLüroth\n, and\nZeuthen\n, which\nKlein\ndescribes in a subsequent article of\n1874\n. This discussion of the fundamental theorem also helped crystallize concepts of continuity, which had only been handled in a confused manner earlier.\nReye\n, in the preface to the second edition of his lectures in\n1877\n, mentions\nKlein\n's objections and says that because of these he has substituted a new proof of the fundamental theorem due to\nThomae\n.\nMax Noether\n(\nsee\n[\n3\n]\n)\nsays that even von Staudt himself did not realise the implications of his work, that it was possible to construct the metric from purely projective-geometric data. It remained for later generations to appreciate the impact of von Staudt's work on the foundations of projective geometry.\nDirk Struik\nwrites about a lecture\nHans Freudenthal\ngave in Erlangen on\n20\nJune\n1967\non the occasion of the centenary of von Staudt's death\n(\nsee\n[\n10\n]\n)\n. Struik explains that in the lecture\nFreudenthal\n:-\n... looks, with modern eyes, at von Staudt's aim to found projective geometry independently of any metric assumptions, an approach closely approximating modern axiomatic form. The conclusion is that von Staudt was the first to raise the question of foundations looking for purity of method in projective geometry, using his definition of projectivities by the invariance of harmonicity. This and his definition of complex imaginary points by involution on oriented lines are \"almost anachronistic examples\" of bold abstraction. By his calculus of 'throws' he gave an outline of the modern algebraisation of axiomatic theory.\nVon Staudt also gave a nice geometric solution to\nquadratic equations\n. We are given the quadratic equation\nx\n2\n−\ng\nx\n+\nh\n=\n0\nx^{2} - gx + h = 0\nx\n2\n−\ng\nx\n+\nh\n=\n0\nwhich we wish to solve geometrically. On the Cartesian plane, plot the points\n(\nh\ng\n,\n0\n)\n(\\Large\\frac{h}{g}\\normalsize , 0)\n(\ng\nh\n​\n,\n0\n)\nand\n(\n4\ng\n,\n2\n)\n(\\Large\\frac{4}{g}\\normalsize , 2)\n(\ng\n4\n​\n,\n2\n)\n, and let the line joining these two points cut the unit circle with centre\n(0\n,\n1)\nin points\nA\nA\nA\nand\nB\nB\nB\n. Project\nA\nA\nA\nand\nB\nB\nB\nfrom the point\n(0\n,\n2)\nonto the\nx\nx\nx\n-axis at the points\n(\na\n,\n0\n)\n(a, 0)\n(\na\n,\n0\n)\nand\n(\nb\n,\n0\n)\n(b, 0)\n(\nb\n,\n0\n)\n, say. Then\na\na\na\nand\nb\nb\nb\nare the roots of the given quadratic equation. It is an interesting exercise for the reader to prove this geometrical method - try it.\nIn\n1863\n, von Staudt was elected a corresponding member of the Bavarian Academy of Sciences. In\n1867\nhe was proposed for full membership of the Academy but he died of a lung disease before the membership was confirmed.\nAn obituary in the Augsburg\nAllgemeine Zeitung\ngives this tribute to von Staudt:-\nBut to all who knew him closely he leaves behind the image of a man hardened by continued mental work of a scientific character, a man striving tirelessly to move ahead yet having deep respect for the status quo, having devotion to duty, a sense of right and strict with himself, having joy in social interactions, giving kindness to others and modestly performing kind deeds.",
  "math_areas": [
    "Calculus",
    "Geometry",
    "Logic"
  ]
}