{
  "nome_completo": "Karl Brandan Mollweide",
  "nome_curto": "Karl Mollweide",
  "ano_nascimento": "1774",
  "ano_morte": "1825",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mollweide/",
  "lugar_nascimento": "Wolfenbüttel, Brunswick, now Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Karl Mollweide\nwas born and brought up in Wolfenbüttel about\n15\nkm south of Brunswick\n(\nwhich today is the city of Braunschweig\n)\n. Unlike most people who become leading mathematicians, Mollweide showed no interest in or talent for the subject while in elementary school. His interest came about very suddenly when he was twelve years old and seems to have occurred when he discovered some old mathematics books in his home and began reading them. From these books he taught himself calculus and then progressed to the study of algebra. When he was fourteen years old he put his new mathematical skills into practice and calculated the occurrence of an eclipse. This made his mathematical skills more widely known, and his teacher at the\ngymnasium\n, Christian Leiste, realised that his pupil was extremely talented.\nWith a love of mathematics and a considerable talent for the subject, it was natural that Mollweide would want to study the subject to a higher level. He entered the University of Helmstedt where he was taught by\nJohann Friedrich Pfaff\n.\nPfaff\nhad much in common with Mollweide for both had studied mathematics largely on their own. Both had, in addition to a deep love of mathematics, an interest in applying it to astronomy. Mollweide entered the University of Helmstedt in\n1793\nand spent three years studying there.\nPfaff\nwas an excellent teacher and at that time was working hard to build up a flourishing mathematics department so Mollweide was happy to be offered a teaching position at the university following his undergraduate studies. However, despite\nPfaff\n's hard work in building up mathematics department, the University of Helmstedt was by this time under threat of closure. This was not the only problem faced by the new lecturer Mollweide for he was suffering severe health problems\n(\nprobably caused by depression\n)\nwhich forced him to give up his position at Helmstedt after about a year and return to his home.\nBack home Mollweide took it easy and spent the next two years essentially taking a prolonged rest. By this time his health improved sufficiently for him to consider accepting an offer of a professorship of mathematics and astronomy at the University of Halle. He decided that his health was now good enough for him to accept the professorship and he took up the position in\n1800\n. He spent eleven years at Halle and it was during this period that he did the two pieces of work for which he is mostly remembered today.\nThe first of these was his invention of the Mollweide projection of the sphere, a map projection which he produced to correct the distortions in the Mercator projection, first used by\nGerardus Mercator\nin\n1569\n. Mollweide announced his projection in\n1805\n. While the Mercator projection is well adapted for sea charts, its very great exaggeration of land areas in high latitudes makes it unsuitable for most other purposes. In the Mercator projection the angles of intersection between the parallels and meridians, and the general configuration of the land, are preserved but as a consequence areas and distances are increasingly exaggerated as one moves away from the equator. To correct these defects, Mollweide drew his elliptical projection; but in preserving the correct relation between the areas he was compelled to sacrifice configuration and angular measurement. Timothy Feeman explains in\n[\n4\n]\nthat the:-\n... construction of an equal area map\n[\nwas\n]\nfirst announced in\n1805\nby Karl Brandan Mollweide\n(1774\n-\n1825)\nand\n[\nis\n]\ncommonly used in atlases today. Aesthetically, Mollweide's map, which represents the whole world in an ellipse whose axes are in a\n2\n:\n1\nratio, reflects the essentially round character of the earth better than rectangular maps. The mathematics involved in the construction requires mainly high school algebra and trigonometry with only a bit of calculus\n(\nwhich can be plausibly avoided if one so desires\n)\n.\nIn fact the Mollweide projection is distortion-free along the parallels\n40\n.\n7\ndegrees North and South. The Mollweide projection is discussed in many articles, see for example\n[\n1\n]\n,\n[\n2\n]\n,\n[\n4\n]\n,\n[\n6\n]\nand\n[\n7\n]\n.\nYou can see the Mollweide projection at\nTHIS LINK\n.\nThe second piece of work to which Mollweide's name is attached today is the Mollweide equations which are sometimes called Mollweide's formulas. These trigonometric identities are\nsin\n⁡\n(\nπ\n(\nA\n−\nB\n)\n)\ncos\n⁡\n(\nπ\nC\n)\n=\na\n−\nb\nc\n\\Large\\frac{\\sin(\\pi(A - B))}{ \\cos(\\pi C)}\\normalsize = \\Large\\frac{a - b}{ c}\nc\no\ns\n(\nπ\nC\n)\ns\ni\nn\n(\nπ\n(\nA\n−\nB\n)\n)\n​\n=\nc\na\n−\nb\n​\n, and\ncos\n⁡\n(\nπ\n(\nA\n−\nB\n)\nsin\n⁡\n(\nπ\nC\n)\n=\na\n+\nb\nc\n\\Large\\frac{\\cos(\\pi(A - B)}{\\sin(\\pi C)}\\normalsize = \\Large\\frac{a + b}{ c}\ns\ni\nn\n(\nπ\nC\n)\nc\no\ns\n(\nπ\n(\nA\n−\nB\n)\n​\n=\nc\na\n+\nb\n​\n,\nwhere\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\nare the three angles of a triangle opposite to sides\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\n, respectively. These trigonometric identities appear in Mollweide's paper\nZusätze zur ebenen und sphärischen Trigonometrie\nⓉ\n(\nAdditions to plane and spherical trigonometry\n)\n(1808)\n. A proof of these identities and an interesting discussion concerning them is given in\n[\n9\n]\n. One of the more puzzling aspects is why these equations should have become known as the Mollweide equations since in the\n1808\npaper in which they appear Mollweide refers the book by Antonio Cagnoli\n(1743\n-\n1816)\nTraité de Trigonométrie Rectiligne et Sphérique, Contenant des Méthodes et des Formules Nouvelles, avec des Applications à la Plupart des Problêmes de l'astronomie\nⓉ\n(\ncontaining methods and new formulas with applications to most astronomical problems\n)\n(1786)\nwhich contains the formulas. However, the formulas go back to\nIsaac Newton\n, or even earlier, but there is no doubt that Mollweide's discovery was made independently of this earlier work.\nIn\n1811\nMollweide left Halle when he was named Professor of Astronomy at the University of Leipzig. He immediately had an important influence of one of the first students he taught at Leipzig, namely\nAugust Möbius\n. At this time\nMöbius\nwas intending to make a career as an astronomer but after being taught by Mollweide he became, like his teacher, equally interested in both mathematics and astronomy. As well as being Professor of Astronomy at Leipzig, Mollweide was also director of the university observatory. However, times were difficult because of wars which affected the district. After Napoleon withdrew his armies from Russia in\n1812\nhe began a new offensive against the German states. However his armies failed in their attempt to capture Berlin and retreated to the west. Napoleon's lines of communication were through Leipzig and the allies concentrated their attacks on that point in October\n1813\n. The resulting Battle of Leipzig took place from\n16\nth\nto\n19\nth\nOctober and saw a major defeat for Napoleon. All this concentration on war had made Mollweide's life extremely difficult for he was forced to concentrate on geographic studies to assist the war effort. On top of this, money had to be diverted to the war effort and so Leipzig Observatory received very little funding and could not carry out a proper astronomical research programme.\nMollweide, always more enthusiastic towards mathematics than astronomy, decided in\n1814\nto move from being Professor of Astronomy to Professor of Mathematics, still at the University of Leipzig. Certainly the problems in carrying out his duties as Professor of Astronomy had been a big factor in his decision. The chair of astronomy at Leipzig which he vacated was filled by\nMöbius\ntwo years later. The year of\n1814\nnot only marked Mollweide's move from astronomy to mathematics, but it was also the year he married. His wife was the widow of the astronomer Meissner, who had worked at Leipzig Observatory. From\n1820\nto\n1823\nMollweide was Dean of the Leipzig University Faculty of Philosophy.\nWe referred above to the two contributions for which Mollweide is best remembered today. However he made many other minor contributions published in the\nMonatliche Correspondenz de Zach\n(1802\n-\n13)\n, in the\nZeitsrchrifte für Astronomie\n(1816\n-\n17)\n, in the\nAnnalen de Gilbert\n(1804\n-\n23)\n, and in the\nAstronomische Nachrichten\n(1824\n-\n25)\n. Among his other works we mention two published while he was working in Halle:\nPrüfung der Farbenlehre des Hernn von Goethe\nⓉ\n(\nAccount of the colour theory of  von Goethe\n)\n(1810)\nwhich studied Goethe's theory of colour, and\nDarstellung der optischen Irrthümer in Herrn von Goethe's Farbenlehre\nⓉ\n(\nShowing the optical errors in von Goethe's colour theory\n)\non a similar topic, which he published in the following year. After moving to Leipzig he published:\nCommentationes mathematico-philologicae tres\nⓉ\n(\nThree mathematical-philological commentaries\n)\n(1813)\n;\nDe Quadratis Magicis Commentatio\nⓉ\n(\nHistory of magic squares\n)\n(1816)\non magic squares\n(\nthe first book on the topic not to contain any mysticism\n)\n; and\nAdversus novissimos chronologiae mysticae auctores et astrologiae patronos\nⓉ\n(\nAgainst the latest chronology of mystical writers and patrons of astrology\n)\n(1821)\n. He was also the editor of\nEuklid's Elemente\n.\nIn\n[\n9\n]\nWu says that Mollweide's health problems were basically caused by depression, making him a hypochondriac, and this made him appear standoffish. However, when one got to know him well, one realised what a kind and considerate man he was:-\nAs a teacher, he tried with his full heart to promote the study of science and mathematics. Anyone who expressed interest in these topics received his support. ... he was loved by those who knew him well; deep down he was truly kind and always wanted only the best for science and mathematics. Mollweide was admired as a lecturer because of his ability to present dry topics in an interesting manner by drawing connections to other topics. He was also known for his penmanship; his ability to draw a \"perfect\" circle freehand amazed his students.\nAmong his other mathematical accomplishments, Wu mentions\n[\n9\n]\n:-\nMollweide demonstrated various talents as a mathematician. He was feared as a proofreader for his ability to easily detect and harshly criticize the smallest flaw in papers. Although he did not discover any completely new mathematical methods, he was admired for thoroughly investigating and extending known methods. Among his mathematical contributions, Mollweide was the first to use the modern congruence symbol in the\n1824\nedition of Lorenz's German translation of 'Euklid's Elemente'. He also took over the work on the mathematical dictionary, 'Mathematisches Wörterbuch'\nⓉ\n(\nMathematical dictionary\n)\n, from\nGeorg Simon Klügel\n, but only published one volume in\n1823\nprior to his death.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Logic"
  ]
}