{
  "nome_completo": "Kathleen Rita McNulty Mauchly Antonelli",
  "nome_curto": "Kathleen McNulty Antonelli",
  "ano_nascimento": "1921",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Antonelli/",
  "lugar_nascimento": "Creeslough, County Donegal, Ireland",
  "lugar_morte": "Wyndmoor, Pennsylvania, USA",
  "biografia": "Before we begin this biography, we should explain the names under which we have listed\nKathleen McNulty\nin this archive. She was given the name Kathleen Rita McNulty but, after she married\nJohn Mauchly\nin\n1948\n, she became Kay Mauchly then, some years after\nJohn Mauchly\n's death in\n1980\n, she married Severo Antonelli.\nKathleen McNulty's parents were James McNulty\n(1890\n-\n1977)\nand Anne Nelis\n(1892\n-\n1966)\n. James McNulty was born in Creeslough in Donegal County, Ireland where his family had owned a large part of the hillside for generations. He was the youngest of his parents' seven children. His father Patrick McNulty died in\n1892\nand his mother Catherine McNulty in\n1902\nso by age eleven he was brought up by his older brothers. He decided to follow one of his older brothers who became an apprentice stonemason in the United States, and sailed from Londonderry to New York arriving on\n9\nMay\n1909\n. In Philadelphia he trained to become a stonemason, but also became involved in Irish politics joining a group which was raising money for guns and ammunition to fight against British rule of Ireland. He returned to Ireland in\n1914\nin order to recover from typhoid fever and served as commandant of the Doe Battalion of the Irish Volunteers. He planned to marry Anne Nelis and they had an American style home built on her brother's farm. They married on\n1\nFebruary\n1917\n. In early\n1919\nJames McNulty was involved in an attempt to seize guns from the home of a protestant JP. James was shot and seriously injured; recovery was a slow affair.\nKathleen, the subject of this biography, had two older brothers Patrick John McNulty\n(1918\n-\n1986)\nand James Joseph McNulty\n(1919\n-\n2001)\n. On\n7\nFebruary\n1921\nKathleen's father was with a group of men who blew up a railway bridge causing a derailment in which fifteen British soldiers were injured. On the night that Kathleen was born,\n12\nFebruary, he was arrested at his home and kept in Derry Jail. In July\n1921\nhe was sentenced to five years penal servitude for \"having alleged seditious documents.\" In December\n1921\nhe was one of about a dozen IRA prisoners who attempted to break out of Derry Jail. Two Royal Irish Constabulary guards were killed in the attempt. On\n12\nJanuary\n1922\nhe was released from prison and all charges were dropped. Three of his fellow prisoners who had been involved in the escape attempt were sentenced to death for the murder of the two guards but they were released in\n1925\n. James decided to emigrate to America and went to prepare the way, leaving his wife and children in Ireland. In August\n1923\nhe sailed from Londonderry to New York on the\nS S California\narriving on\n2\nSeptember. He went to Philadelphia where he built a house in Wyndmoor, a district of Chestnut Hill. He declared his intention to become a naturalised American citizen on\n27\nJune\n1924\n. The family, Annie, Patrick, James, Kathleen and her sister Anna Marie McNulty\n(1923\n-\n2003)\nsailed on the\nS S Columbia\nfrom Londonderry to New York arriving on\n13\nOctober\n1924\n.\nAfter two years in the house at Wyndmoor, the family moved to a larger home at\n48\nHighland Avenue in Chestnut Hill. The\n1930\nUS Census shows the family to have increased with Cecilia Marguerite McNulty\n(1926\n-\n2014)\nand John Joseph McNulty\n(1928\n-\n1992)\nboth being born in Philadelphia. Living with them are John McNulty, the oldest brother of James McNulty and\n14\nyears his elder, and Hugh Nelis, Annie's brother. The first is a labourer in the building trade, the second a labourer in gardening. They also have two lodgers, one an electrician in the building trade, the other a gardener.\nKathleen's education was in Catholic Schools in the United States beginning in\n1927\n. After seven years in her first school, she entered Hallahan High School, an all girls Catholic school. You can read about a summer job she took while at the High School at\nTHIS LINK\n.\nAfter graduating from Hallahan High School in\n1938\nshe began her studies at Chestnut Hill College for Women in Philadelphia where she was offered a scholarship\n[\n1\n]\n:-\nI had taken an academic course in high school. I had taken four years of mathematics, four years of English, four years of Latin, three years of French, and a year each of biology and chemistry. When I got to college and my counsellor asked me what I wanted to major in, I thought that since I was there on a scholarship, I would have to keep my marks up. The easiest way to do that was to take mathematics as a major. I loved it and found it fun and easy to do. I didn't want to teach. I just wanted to do the maths puzzles. I took algebra, differential calculus, integral calculus, differential equations, different kinds of geometry, astronomy, and two years of physics. Originally, I intended to minor in physics. ... I didn't want to teach. I thought that business sounded like a good thing, so I changed my minor to business administration. Then I took courses in business, accounting, money and banking, and anything else that had to do with business.\nShe graduated from Chestnut Hill College in\n1942\n.\nYou can see many more details of McNulty's childhood and education in her own description at\nTHIS LINK\n.\nOf course\n1942\nwas in the middle of World War II and by this time the war was strongly affecting the direction of academic research. The United States was specifically directing its research schools and staff towards the war effort. The University of Pennsylvania's Moore School of Engineering began putting on training courses for electronics and other disciplines as part of this war effort. They also began early research in the use of computers. The Ballistic Research Laboratory had been set up at Aberdeen, in Harford county, northeastern Maryland as part of the Aberdeen Proving Ground, a military weapons testing site which had been established in\n1917\nduring World War I. The Ballistic Research Laboratory consisted of staff from the Moore School and staff from the Aberdeen Proving Ground using their expertise on joint projects.\nAfter graduating Kay McNulty answered an advertisement by the Moore School of Engineering for \"math majors\" and she applied, was interviewed and was employed as a mathematician; she worked on preparing firing tables for guns. McNulty described the work which she did in the following way\n[\n16\n]\n:-\nWe did have desk calculators at that time, mechanical and driven with electric motors, that could do simple arithmetic. You'd do a multiplication and when the answer appeared, you had to write it down to re-enter it into the machine to do the next calculation. We were preparing a firing table for each gun, with maybe\n1\n,\n800\nsimple trajectories. To hand-compute just one of these trajectories took\n30\nor\n40\nhours of sitting at a desk with paper and a calculator. As you can imagine, they were soon running out of young women to do the calculations. Actually, my title working for the ballistics project was \"computer\". The idea was that I not only did arithmetic but also made the decision on what to do next. ENIAC made me, one of the first \"computers\", obsolete.\nThe ENIAC computer\n(\nElectronic Numerical Integrator and Computer\n)\nwhich McNulty refers to in the above quote was being constructed by\nJohn Mauchly\nand\nJohn Eckert\nin the Moore School of Engineering during the war years. It was designed for the specific task of compiling tables for the trajectories of bombs and shells to take over the calculations which McNulty and about\n75\nother women were carrying out. However the war had ended before the machine came into service but it was still used for the numerical solution of differential equations as intended. McNulty was one of six women who became operators of ENIAC making very substantial contributions to computer science, although it took many years before they received the credit which they deserve for their pioneering work. In the interview\n[\n5\n]\nMcNulty spoke about the first problem that ENIAC was given:-\n... the very first day that theÂ ENIACÂ was finally declared it is now ready to work, although it hadn't been fully tested, our test will be the feasibility of the H bomb. It was aÂ tremendous, tremendous problem that had been brought in from Los Alamos. It was Dr\nFermi\nand Dr Teller's problem, and it was the feasibility of the trigger which they had designed. So we put that problem on the ENIAC. Now, someone had asked us aÂ little while ago about the tubes and the reliability of them. ThereÂ wereÂ many tubes that failed, but the ENIAC was built in such aÂ way that aÂ tube did not have to generate aÂ certain amount of power - This is aÂ vacuum tube I'm talking about, which in those days were pretty large. They were about five inches tall, each one, and there wereÂ\n18\n,\n000\nÂ in the ENIAC. Which generated aÂ tremendous amount of heat and everything. These tubes were not operated full power. Any amount of power would turn them on. So they only operated in an on or an off position. If they were on at all, they transmitted the power. If they were off, they didn't. And that was the basicÂ thing. So when we first started to operate the machine, we found out that there were aÂ number of tubes that had actually failed, and another bad solder joints that had gone on and so on. Once those things got ironed out, the machine was really quite reliable and it operated very well. So the problem that came from Los Alamos at that time, we did not program it. The physicists who came from Los Alamos had actually programmed it. They had studied all about the ENIAC because they had Top Secret clearance, and they were able to have access to these wiring diagrams before we did, even. So they were able to program it and we helped them, all of us girls\n(\ngirls we were called in those days\n)\nhelped them program it and help them run it. It took about two and aÂ half months.\nThis first program run on the ENIAC was declared a success and it was announced that it would be demonstrated to the world on\n15\nFebruary\n1946\n.\nLinde Lunney writes\n[\n9\n]\n:-\nThe public launch of the ENIAC machine as the first general-purpose electronic digital computer took place on\n15\nFebruary\n1946\n, causing great excitement in the scientific and business communities, as the potential importance of such machines was already evident. The event, however, relegated the women programmers to the role of hostesses, and official reports and early histories of computing made no mention of female operators. Tellingly, as mid-century America reversed the gains made in wartime by women in employment, science and public engagement, some contemporary observers even regarded the women in the project as 'refrigerator ladies': models employed to stand elegantly in front of machines that they did not understand.\nPetzinger, in\n[\n13\n]\n, describes the way that McNulty used ENIAC to solve differential equations after the construction of the machine was complete in February\n1946\n:-\nThe first task was breaking down complex differential equations into the smallest possible steps. Each of these had to be routed to the proper bank of electronics and performed in sequence - not simply a linear progression but a parallel one, for the ENIAC, amazingly, could conduct many operations simultaneously. Every datum and instruction had to reach the correct location in time for the operation that depended on it, to within\n1\n5000\n\\large\\frac{1}{5000}\\normalsize\n5\n0\n0\n0\n1\nâ\nth of a second.\nOn\n7\nFebruary\n1948\nMcNulty married\nJohn Mauchly\n, one of the two designers of the ENIAC computer. She explained in\n[\n7\n]\nwhy marrying was an emergency:-\n... when IÂ first married John, and that was, he said, aÂ great emergency. His mother was sick, his wife had previously died two years before that, and his mother was not well. His children didn't have anybody much looking after them. And the housekeeper that he had hired to look after the children was about to have aÂ baby and she was going to leave, and oh, he had so many compelling reasons why we should get married. So, anyway, weÂ did.\nHer parents, however, objected to the marriage\n[\n3\n]\n:-\nHer mother objected to the union on the grounds that\nMauchly\nwas not Irish or Catholic, was\n14\nyears her senior, and was a widower with two children. On their honeymoon, he presented Kay with a cookbook, with the words: \"You are our new cook.\" While cooking and raising seven children, Kay continued, uncredited, to programme the new computers that her husband developed.\nIn fact Kathleen's parents refused to attend their daughter's wedding and only after the birth of her first child, Sally, did her mother relent and visit her. Kathleen and John Mauchly had five children, Sally\n(\nborn\n1949)\n, Kathy\n(\nborn\n1951)\n, Bill\n(\nborn\n1953)\n, Gini\n(\nborn\n1954)\nand Eva\n(\nborn\n1958)\n. Sally majored in mathematics for her first degree, was awarded a master's degree in mathematical education and became a teacher. Kathy majored in biology and took a master's degree in biochemistry. Bill became an electrical engineer, Gini studied languages and Eva studied music.\nBy the time of their wedding,\nJohn Mauchly\nhad left the Moore School and soon was designing further computers in partnership with\nJohn Eckert\n. John and Kay Mauchly lived on a farm in Amber, Pennsylvania, and Kay continued to work with her husband on the design of computer programs for the later BINAC and UNIVAC computers. She contributed skills in software design to these projects which complemented her husbands expertise in hardware design.\nAfter\nJohn Mauchly\n's death, Kathleen gave many talks on his work\n[\n1\n]\n:-\nI learned how to construct a talk and began speaking at various functions. UNIVAC hired me to be their representative at various national sales meetings and other places. I gave the keynote address at the celebration of the\n40\nth anniversary of the ENIAC, when we met Kathryn Kleiman. I always spoke as John's widow, not as myself.\nSome years after the death of her husband in\n1980\n, she married the photographer Severo Antonelli and lived in Pennsylvania. She became a celebrity with many invitations to speak. She began to speak for herself, not simply as\nJohn Mauchly\n's widow speaking about him\n[\n1\n]\n:-\nAll the years I gave talks about the ENIAC, I always talked about it as\nJohn\n's story, not my story. Although I mentioned that I had been an ENIAC Programmer, it was just in passing. I told of\nJohn\n's part in the development of ENIAC, about BINAC and UNIVAC, and his companies. I wrote a monthly article about\nJohn Mauchly\nfor a little bulletin for some computer club. A member of that club arranged for\nJean Bartik\n, Kathe Jacoby and me to speak at Princeton about our experiences. I think that was the first time that I spoke for myself. ...\nBetty Jean Bartik\nand I have given many, many talks together at universities and companies including IBM and Microsoft. ... I love doing it, but I mainly talk about being there. We even gave the keynote speech for an awards banquet of ACM. I went with\nBetty\nwhen Northwest Missouri University named their computer museum after her.\nThe recognition of the work she and other women did was long in coming but eventually the importance of their work was acknowledged. Kay AntonelliÂ was inducted into the Women in Technology International Hall of Fame in\n1997\n. She was a keynote speaker at the Women In Technology International's East Coast Summit in Boston in\n1998\n. She received an honorary doctorate from Chestnut Hill College. A scholarship in computer science is named in her honour at the Letterkenny Institute of Technology in Ireland. A computer science building was renamed in her honour in Dublin City University in\n2017\n.\nAntonelli died of cancer at Keystone Hospice in Wyndmoor and her funeral was held in St Anthony's Roman Catholic Church, Ambler.\nFor a detailed description of Kathleen Rita McNulty Mauchly Antonelli's life as she herself described it, see\nTHIS LINK\n.\n[\nNote. Anyone wanting to see a different view from Antonelli's about the beginning of electronic computing should read\n[\n2\n]\n.\n]",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}