{
  "nome_completo": "Katherine Coleman Goble Johnson",
  "nome_curto": "Katherine Johnson",
  "ano_nascimento": "1918",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Johnson_Katherine/",
  "lugar_nascimento": "White Sulphur Springs, Greenbrier County, West Virginia, USA",
  "lugar_morte": "Newport News, Virginia, USA",
  "biografia": "Katherine Johnson\nwas given the name Katherine Coleman on her birth. Johnson is her married name\n(\nfrom her second husband\n)\nbut, for the sake of simplicity, we will use the name Katherine up to the point when she married for the second time. Katherine's father was Joshua Mckinley Coleman, born in White Sulphur Springs on\n18\nDecember\n1881\nto Horace Coleman and Margaret Johnson. Joshua worked at various jobs, farming, odd jobs and as a janitor. He married Joylette Roberta Lowe on\n29\nSeptember\n1909\nin Danville, Virginia. Joylette, the daughter of Lee Lowe and Roberta Johnson, was born in\n1887\nin Caswell County, North Carolina and became a school teacher. Katherine had two older brothers, Horace born about\n1912\nand Charles born about\n1915\n. She also had an older sister, Margaret, born about\n1913\n.\nKatherine attended elementary school from the age of five but even at that stage she was advanced for her age and went straight into the second grade. When she was eight years old she should have entered the fifth grade but, being one of the best students, she was put straight into the sixth grade of a newly opened school, having at this stage overtaken her brother Charles who was three years older but now a grade below Katherine. At age ten she was ready to enter high school.\nWhite Sulphur Springs had no high school for black children and the Coleman family were determined that their children would have a quality education so, every autumn, Katherine's mother moved with her children to a rented home in Institute, Kanawha County, West Virginia, so their children could attend high school there. In the summer they would return around\n200\nkm to White Sulphur Springs where Joshua worked as a farmer. Katherine began her studies at West Virginia State High School in\n1928\nand graduated in\n1932\n. At this high school, associated to West Virginia State College, she had excelled in mathematics and was taught geometry by Angie Turner King who did an outstanding job in encouraging her students and giving them a love of their subject. She was a tremendous influence on Katherine both in high school and later in West Virginia State College where she also taught. Katherine said that King was\n[\n14\n]\n:-\n... a wonderful teacher - bright, caring, and very rigorous.\nKatherine also became very interested in astronomy while at the high school. This interest came about since she would walk home each evening with the school principal who pointed out stars and constellations to her. After graduating from Virginia State High School, Katherine made the natural progression to West Virginia State College having been awarded a full scholarship covering her tuition fees, room and board. This College, now West Virginia State University, was a black college, founded in\n1890\nbut only taking the name West Virginia State College in\n1929\n, three years before Katherine began her studies there. She had two years in which to make a decision as to which subject she would major in and she knew it was one of English, French and mathematics. It was a difficult decision for the girl who was talented in all these subjects, so eventually she decided to major in two of these topics.\nAt West Virginia State College she was taught mathematics by James Carmichael Evans\n(1900\n-\n1988)\n. Katherine explained in\n[\n14\n]\nthat Evans, who had a B.S. and an M.S. from the Massachusetts Institute of Technology:-\n... was one of my math teachers in college - his wife had taught me math in the eighth grade - and because they didn't have children at that time, I became a kind of child to them. I was always at their house, and he was the sort of person who was always teaching even at home. To please him I always had to do my very best, and he always knew if it wasn't my very best effort. At that time I was very interested in French and English studies with Professor Matthews, but Professor Evans said, \"I know how good you are in French, but you will also major in mathematics.\"\nLet us note that Professor Matthews, mentioned in the above quote, was John F Matthews who spoke at least seven languages.\nAnother who taught her mathematics at College was\nWilliam Waldron Schieffelin Claytor\nwho quickly spotted her research potential.\nClaytor\nwas an African American mathematician who had been awarded a Ph.D. with a thesis on point-set topology from the University of Pennsylvania in\n1933\n. Katherine acknowledged the effort that\nClaytor\nput in to help her be successful\n[\n3\n]\n:-\nMany professors tell you that you'd be good at this or that, but they don't always help you with that career path. Professor\nClaytor\nmade sure I was prepared to be a research mathematician. ...\nClaytor\nwas a young professor himself, and he would walk into the room, put his hand in his pocket, and take some chalk out, and continue yesterday's lesson. But sometimes I could see that others in the class did not understand what he was teaching. So I would ask questions to help them. He'd tell me that I should know the answer, and I finally had to tell him that I did know the answer, but the other students did not. I could tell.\nBut\nClaytor\ndid far more that simply encourage, he made sure she took all the right courses and when he realised that she would need a background in analytic geometry that the College did not offer, he simply put on a course just for Katherine. She was fortunate to have\nClaytor\nas a teacher for he only taught at West Virginia State College from\n1934\nto\n1937\n. Katherine graduated with a B.S. 'summa cum laude' in\n1937\nmajoring in both mathematics and French.\nAfter graduating, Katherine took a job as a teacher in an elementary school in Marion, Virginia. She was told that she could have the job if she could teach mathematics and French, and play the piano. She travelled to this school by bus and experienced racism which was all too common at that time\n[\n7\n]\n:-\nKatherine felt that the racism in West Virginia was less blatant than that in Virginia. As such, she was surprised when on crossing into Virginia from West Virginia the bus came to a halt and all black people were told to move to the back. When the driver said all the coloured people were to be put into taxis, Katherine refused until he asked politely. A stand indicative of a lifetime refusal to be thought of as less than equal.\nShe taught in a number of schools in Virginia and West Virginia over the next two years but left teaching in\n1939\nwhen she married James Francis Goble. The two had met when students at West Virginia State College and went on to have three daughters, Constance, Joylette, and Katherine. All three daughters became mathematicians and teachers. Now, although she had given up teaching when she married, Katherine was asked by West Virginia State University to join their graduate mathematics programme in\n1940\n. She felt that the University was reacting to the Supreme Court decision in\n1938\nwhich declared that States had to provide the same educational opportunities for black Americans as for white, either by creating separate institutions or allowing them to attend the same institution. Nevertheless, she was keen to take up the opportunity of graduate study. Sadly, she had to give up her studies since her husband became ill and Katherine had to return to teaching to support her family.\nIn\n1952\nKatherine visited her relatives in Newport News, Virginia and was told that the National Advisory Committee for Aeronautics\n(\nNACA\n)\n(\nlater to become NASA\n)\nhired black women mathematicians. In fact they had hired women to act as \"computers\" since\n1935\nand, with shortages of manpower during World War II, had begun to take on African-American women. Katherine felt that this was an opportunity that she had to grasp so she moved her family to Newport News. Once there she worked as a substitute mathematics school teacher and applied for a position at NACA. In fact, she received both an offer of a permanent teaching post and of a position as NACA in\n1953\nand she had no hesitation in accepting the position at NACA. Her husband's health deteriorated and, in\n1956\n, he died from a brain tumour which, sadly, had been inoperable.\nWhen she began working at NACA Katherine was assigned to the office which housed the black \"computers\" who were loaned to whichever Division required assistance. She was loaned to the Flight Research Division and her work there was so outstanding that this Division became her permanent place of work. Let us quote her own words\n(\nsee\n[\n14\n]\n)\n:-\nWe were pioneers of the space era. We worked in secret for about three years, often without knowing exactly what the total thrust of our work was. ... You had to read 'Aviation Week' to find out what you'd done. The Russians were already attempting to move into space at that point, so our efforts were militarily strategic.\nIn\n1958\nNACA became NASA and all NACA employees became NASA employees. Katherine explained:-\nEverything was so new - the whole idea of going into space was new and daring. There were no textbooks, so we had to write them. We wrote the first textbook, starting from scratch. People would call us and ask, \"what makes you think that this or that is possible?\" and we would try to tell them. We created the equations needed to track a vehicle in space. I was lucky that I was working with the division that worked out all the original trajectories, because I guess that is what I am remembered for.\nUp to\n1958\nblack workers in NACA were segregated. They had to eat separately and had restrooms which were separate from their white colleagues. However, after the change to NASA, this segregation ended. However, there was still discrimination against women and they were not allowed to attend briefings:-\nThese were such intelligent men, they knew so much, and I always loved intelligence, and so I'd ask what had gone on in the briefings - I'd listen and listen and ask questions. Then, of course, I'd ask why I couldn't go myself, and eventually they just got tired of answering all my questions and just let me in to the briefings.\nThis was not the only way that there was discrimination against women. They were not allowed to put their names on their research reports:-\nWe needed to be assertive as women in those days - assertive and aggressive - and the degree to which we had to be that way depended on where you were. I had to be. In the early days of NASA women were not allowed to put their names on the reports -  no woman in my division had had her name on a report. I was working with Ted Skopinski and he wanted to leave and go to Houston ... but Henry Pearson, our supervisor - he was not a fan of women - kept pushing him to finish the report we were working on. Finally, Ted told him, \"Katherine should finish the report, she's done most of the work anyway.\" So Ted left Pearson with no choice; I finished the report and my name went on it, and that was the first time a woman in our division had her name on something.\nThis was not any old report. It was\nDetermination of Azimuth Angle at Burnout for Placing a Satellite over a Selected Earth Position\n. It contained the theory necessary for launching, tracking and returning space vehicles and was used for the famous space flight by Alan Shepard in May\n1961\nand the flight of John Glenn in February\n1962\n. This paper was the first of\n21\npapers co-authored by Katherine while working for NASA.\nIn\n1959\nKatherine married James A Johnson. He had been commissioned in\n1951\nas a Second Lieutenant in the United States Army and was a veteran of the Korean War. They were introduced by the minister at Carver Memorial Presbyterian Church in Newport News, Virginia, where Katherine sang in the choir.\nLet us quote from a NASA website\n[\n3\n]\n:-\nJohnson worked at the agency until\n1986\n, when she retired after\n33\nyears of service. During her tenure at NASA, Johnson received many prestigious awards. Among them were the NASA Lunar Orbiter Award and three NASA Special Achievement Awards. She was named Mathematician of the Year in\n1997\nby the National Technical Association. In addition to these NASA awards, Johnson has been honoured with an honorary Doctor of Law degree from the State University of New York and honorary Doctor of Science degrees from Capitol College in Maryland and Old Dominion University in Virginia.\nAs mentioned in this quote, the State University of New York at Farmingdale awarded Johnson an honorary doctorate on\n4\nJune\n1998\n. The citation reads:-\nYou have lifted our hearts and minds to the stars. Your genius in mathematics and physics helped obliterate physical barriers and greatly contributed to placing the first American astronaut in space. You confronted the obstacles imposed by the forces of Nature and helped launch our country into the space frontier. For your contribution as a pioneer in aerospace technology and your continuing pursuit of excellence in education, the State University of New York at Farmingdale proudly confers on you, Katherine Johnson, the prestigious Doctor of Laws degree, 'honoris causa'.\nJohnson retired in\n1986\nand, as well as her leisure activities of playing bridge, solving puzzles and watching sport, she has enjoyed travelling and speaking about her career to encourage students to achieve their potential.\nJohnson was named West Virginia State College Outstanding Alumnus of the Year in\n1999\n. On\n16\nNovember\n2015\n, she received the Presidential Medal of Freedom from President Barack Obama. On\n5\nMay\n2016\n, NASA named one of the buildings at the Langley Research Center in Hampton, Virginia the 'Katherine G Johnson Computational Research Facility'. The deputy director of the Research Center, Clayton Turner, said in his dedication speech\n[\n9\n]\n:-\nMillions of people around the world watched Shepard's flight, but what they didn't know at the time was that the calculations that got him into space and safely home were done by today's guest of honour, Katherine Johnson.\nIn\n2017\nJohnson became even better known when a movie about Johnson's life called\nHidden Figures\nwas released.",
  "math_areas": [
    "Geometry",
    "Topology"
  ]
}