{
  "nome_completo": "Kazimierz Wladyslaw Bartel",
  "nome_curto": "Kazimierz Bartel",
  "ano_nascimento": "1882",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bartel/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Lwów, Poland (now Lviv, Ukraine)",
  "biografia": "Kazimierz Bartel\nwas born in Lwów which is the Polish name for the city which was also known as Lemberg in German, Lvov in Russian, and today is known as Lviv in Ukraine. One of the reasons for the many variants of the city's name is a long history in which it had been part of different countries at different periods in its history. In fact it became part of Austria when Poland was partitioned in\n1772\nand it was still a part of that country when Bartel was born there - so officially he was born in Lemberg. However, he spent his young years in Stryj, a town about\n60\nkm south of Lemberg, on one of the main railway lines through Lemberg. Kazimierz's father was a railway engineer and, after Kazimierz had spent a short time in primary education at the Stryj Primary School, his father placed him with a friend to train as an apprentice fitter. Kazimierz was lucky for this family friend taught at the Lemberg State Industrial School and, as well as training him to be a fitter, he encouraged the young boy to attend classes at this school but he also worked in the Stryj railway workshops as a locksmith. After qualifying from the Industrial School as a master locksmith, in\n1901\nhe was able to enrol as an external student in the Mechanical Engineering Department of Lemberg Polytechnic.\nDuring his time as a student, Bartel became actively involved in politics. However, he also showed great academic abilities and, in\n1907\n, he graduated from Lemberg Polytechnic with distinction. Following his graduation, he was appointed as an assistant in descriptive geometry to Placyd Zdzisław Dziwinski\n(1851\n-\n1936)\n, the professor of geometry, at Lemberg Polytechnic, but he also enrolled as a student at the University of Lemberg. He was awarded a travel grant which allowed him to spend some time at the Ludwig-Maximilians University of Munich attending lectures there. In particular, he attended mathematics lectures by Aurel Edmund Voss\n(1845\n-\n1931)\nand\nAlfred Pringsheim\n. His interests were, however, broader than mathematics, and he took a course on the history of art given by Karl Dochlemann, the author of\nProjective geometry\n(1898)\n[\n2\n]\n:-\nDochlemann impressed him greatly and imbued him with an aesthetic interest in art and with a desire to understand works of art in a precise, mathematical manner.\nBartel was awarded his doctorate in\n1911\nand, three years later, he was made a professor at the Lemberg Polytechnic. Of course, this was a period of conflict across much of Europe and it began with an Austrian declaration of war on Serbia on\n28\nJuly\n1914\n. Russia supported Serbia, mobilising its army on\n30\nJuly, and Germany then declared war on Russia on\n1\nAugust, and two days later on France as well. Bartel was conscripted into the Austro-Hungarian army for the duration of World War I. For Bartel, as for many Poles, the war was seen as a positive step which could lead to Poland regaining its sovereignty.\nAfter the war ended with the surrender of the Central Powers, Poland proclaimed itself independent on\n11\nNovember\n1918\n. Bartel returned to his professorship at what was now called Lwów Polytechnic and in fact his book\nDescriptive geometry\n(\nPolish\n)\nwas published around this time. We will say more about this text later in this biography but for the moment let us continue to describe the dramatic events which took place in Poland in general, and Lwów in particular. The first of these was a short-lived western Ukrainian republic which arose in Lviv\n(\nto give it its Ukrainian name\n)\nin late\n1918\n. The Poles, however, drove Ukrainian troops out of the city and regained control. Bartel took a very active part in this defence of Lwów, commanding the railway troops in their battles with the Ukrainian army.\nAt this stage Poland was an independent state by its declaration of\n1918\n, but its borders had not been agreed. In\n1919\nBartel gave up his professorship of mathematics at Lwów Polytechnic to assist in reforming Poland with a democratic constitution. He served as Minister of Railways from\n1919\nuntil\n1922\n. A move was made towards settling the Polish borders with the Treaty of Versailles in\n1919\n, but Poland attempted to recover its\n1772\nborders by military action in the Lithuanian Vilnius territory. As Polish troops advanced on Kiev in March\n1920\nthere was a Soviet response which began the Polish-Soviet war. This ended with the Treaty of Riga on\n18\nMarch\n1921\nfollowing a rather remarkable Polish victory in the Battle of Warsaw\n(\nknown as the \"Miracle on the Vistula\"\n)\n. The boundaries of the Polish state were then set.\nBartel became a member of Poland's Sejm, its parliament, in\n1922\n. Jozef Pilsudski, who had been head of the military department of the Polish council of state during World War I, had initially been in control of Poland at the end of hostilities and had arranged for the German troops to leave the country. He had then taken a back seat while the Polish government began its task of running an independent Poland. However, by\n1926\nPoland was suffering an economic depression and Pilsudski became disillusioned with the way that the system of government was working. On\n12\nMay\n1926\n, at the head of a few regiments, he marched on Warsaw and took control in a military coup. Two days later the whole Polish government resigned and the Polish parliament elected Pilsudski as President. However, he refused this role and one of his friends, Ignacy Moscicki, was elected President. Pilsudski became Minister of Defence and Bartel was made Prime Minister of Poland.\nFrom\n1926\nuntil\n1930\n, Bartel was Prime Minister of Poland on five separate occasions. Two of these lasted only a few days while the other three were:\n15\nMay\n1926\n-\n30\nSeptember\n1926\n;\n27\nJune\n1928\n-\n14\nApril\n1929\n; and\n29\nDecember\n1929\n-\n17\nMarch\n1930\n. He carried out his duties as Prime Minister despite severe heath difficulties; he had kidney problems and suffered almost constant pain. However, he was a cheerful and pleasant man who was liked by both his political friends and enemies. As a politician he was ideologically centrist and, when he became Prime Minister in May\n1926\n, he made a speech calling:-\n... for calm, hard work and dedication to the country. At the same time he promised to remove incompetent and corrupt people from positions of public and political life.\nAn interesting indication of the way that he ran the government is that he demanded that every minister, before taking office, would give him a signed but undated letter of resignation. The Prime Minister could, at any time, enter the date and \"accept\" the request for the minister's resignation. As Prime Minister, Bartel was also keen to protect minorities in Poland. For example, he tried to improve the position of Polish Jews by removing various laws, dating back to the days when Poland was part of the Russian Empire, which had been specifically directed against Jews. This was one of the reasons that led to his murder by the Germans during World War II.\nAfter these periods as Prime Minister, saddened by the constant political arguments, he decided to retire from politics and return to his professorship of mathematics at Lwów Polytechnic. He was elected rector of the Polytechnic and, also in\n1930\n, he was elected as President of the\nPolish Mathematical Society\n. He took over from\nWacław Sierpiński\n, and he held the presidency until\n1932\nwhen\nStefan Mazurkiewicz\nbecame President. He was also honoured by Lwów Polytechnic in\n1930\nwhen they awarded him an honorary doctorate. During these years when Bartel was again an academic, he applied his knowledge and skills in geometry to a historical study of perspective in European painting. He lectured on this topic and his lecture series was published as\nPerspektywa malarska\nⓉ\n(\nPerspectives in painting\n)\n(1928)\n.\nEdward Ince\n, reviewing a\n1934\nGerman translation of volume\n1\nof this Polish text, writes:-\nThe first of two volumes on the art of graphical or applied perspective deals mainly with linear perspective. But perspective, as known to geometers, is a comparatively recent development in the history of art. Then are the paintings which survive at Pompeii, is early Christian art to be considered as non-perspective, or can there be two or more different species of perspective? Within what province does the artist's perspective lie - that of the geometer, that of the physiologist or that of the psychologist? These are among the many questions which the author proposes to answer by studying the development of perspective in graphical art from the earliest ages down to the present day. Circumstances have unfortunately delayed the production of the second volume, and judgment on the full value of the work must be reserved. The first volume is largely a gathering together of evidence; the reasoning out of the case will follow in the second. But judged on its own merits, the present volume deserves the highest praise. The very fact that it is designed to fit into a larger scheme lends it a fascination in striking contrast to the aridity of the usual self-contained treatises on perspective. The reader will find a geometrical diagram, complete with lines, planes and vanishing point, facing the reproduction of a\nDürer\nengraving. He will see the elliptic projection of a circle illustrated by a photograph of the circus at Warsaw with its ring and tiers of seats. He will realise that everything that is artistically best, and most evidently a manifestation of genius, whether best by reason of its pleasing the eye, or best by reason of its suitability to its purpose, in short the essence of pictorial or constructive art, depends in some essential point upon a strict and perhaps toilsome obedience to geometrical laws. Conversely, he will deplore the modern demand for results without effort, for \"stunts\", for short cuts, and its cult of brilliance without basis. That particularly stupid protest: \"But what can Science, what in particular can Mathematics, have to do with Art\", is countered by the words of\nLeonardo da Vinci\n: \"Those who devote themselves to Practice without Theory are as mariners who go to sea in ships without rudder or compass\".\nLet us return to make some comments on his book\nDescriptive geometry\n(\nPolish\n)\n. The first edition was published in\n1918\n, as we mentioned above, and a second edition appeared in\n1922\n.\nEdward Ince\n, reviewing a\n1933\nGerman translation of the second edition of the Polish text, writes:-\nHere is an excellent introduction to a most attractive branch of descriptive geometry. Except in its applications to civil and mining engineering it has been so neglected in this country that little of its terminology has been standardised. The Figured Plan and Topographical Projection are our nearest equivalents to the title. Because of this lack of training in the principles and methods of topographical projection, practical men find it necessary, in dealing with problems properly belonging to this field. to convert them into problems in biorthoconal projection, and thus to surrender them to the other main branch of descriptive geometry. There is no advantage in doing this; it may introduce unnecessary complications, and certainly means the loss of much of the beauty and simplicity which are peculiar to the topographical method. In fact, at least one great continental school places the topographical method, both in time and in importance, ahead of the method of\nMonge\n. This text of Bartel's is admirably straightforward in its methods.\nAfter Bartel's death, a third edition was prepared by Antoni Plamitzer who only made minor changes to the text of the third edition. In\n1958\na fourth edition was published, being simply a reprint of the third edition. N A Court writes in a review of the fourth edition:-\nThe book is a comprehensive course in descriptive geometry, including what is called engineering drawing and concluding with the theory of shadows\n(\npp.\n382\n-\n422)\n. The introductory chapter reminds the reader of the basic theorems\n(\nand their proofs\n)\nof solid geometry that will be made use of in the text. Throughout the book care is taken to present the theoretical foundations on which are based the solutions of the problems considered. The methods follow the classical Mongean lines. ... The book includes more than five hundred and fifty drawings, opens with a very detailed table of contents and ends with a good five page index.\nIn\n1937\nBartel returned to politics when he was appointed a Senator of Poland. After the outbreak of World War II, Lwów was seized by the Soviet Union in\n1939\n. In\n1940\nBartel was appointed to Moscow and offered a seat in the Soviet parliament. However, he refused the offer. In June\n1941\nthe Germans attacked their former ally Russia and, on\n1\nJuly they entered the city of Lwów. One day later he was arrested and imprisoned in Lwów\n[\n2\n]\n:-\nOn\n2\nnd\nof July Bartel was unexpectedly arrested whilst at a discussion meeting with his co-workers at the University. During the following night\n36\nother professors, Bartel's colleagues, were likewise arrested. This group ... included several internationally acclaimed academics such as the surgeon Tadeusz Ostrowski and a petroleum specialist Pillat. ... Of those arrested only Franciszek Groer was released after being brutally treated, perhaps because he was an internationally known specialist in children's diseases and was especially highly regarded in the USA, and the USA were still precariously neutral. The remaining\n35\nwere summarily and immediately shot. Bartel was not murdered with them. He was kept in prison without any explanation being given for his imprisonment and his wife was permitted to bring him his mathematical books and papers and was required daily to deliver his food.\nOn\n16\nJuly he wrote to his wife:-\nI assume from talks with officers that I may be in danger because of my former position as Poland's Prime Minister. In Moscow I conferred with Stalin, here I held certain positions, we heard about it even here in Churchill's and Sikorski's speeches. They told me directly, that their aim was to organize co-operation with the Bolsheviks, and who would be better suited for it than me.\nBartel was being held at Pelczynska street, and here it looks as if his treatment was reasonable. However, on\n21\nJuly he was moved to Lacki street and treated very cruelly. He was ordered to clean the boots of a Ukrainian conscript so that it would be known that:-\n... a Polish professor and prime-minister had to polish boots of a Ukrainian stable-boy.\nHe was mocked for having treated Jews and Communists kindly when he was in government but his wife Maria was still allowed to deliver food to him. However:-\n... on the\n26\nth\nJuly however, her delivery of food was not accepted and she was debarred from entering the prison office to find out why. The\n26\nth\nJuly, being Saturday, she had to wait till Monday before she could see the officer in charge of the prison. She was then told that her husband had been shot two days ago.\nHe had been shot by the Germans on\n26\nJuly on the orders of Heinrich Himmler. He was survived by his wife Maria, the author of\n[\n1\n]\n, and their daughter Cecylia.\nBartel received many honours and decorations. These include the Order of the White Eagle\n(9\nNovember\n1932)\nfor outstanding achievements, the Grand Ribbon of the Order of Polonia Restituta\n(11\nNovember\n1936)\n, the French Legion of Honour\n(\nclass I\n)\n, the Cross of Valour, the Cross of Independence, and the Silver Cross of Order of Military Virtue\n(1922)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}