{
  "nome_completo": "Kenneth Ownsworth May",
  "nome_curto": "Kenneth May",
  "ano_nascimento": "1915",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/May/",
  "lugar_nascimento": "Portland, Oregon, USA",
  "lugar_morte": "Toronto, Canada",
  "biografia": "Kenneth May\n's father was Samuel Chester May\n(1887\n-\n1955)\nwho had trained as a lawyer and practised in Portland from\n1913\nto\n1917\n. Samuel May had married Eleanor Ownsworth Parkin in\n1913\nand they had two sons, Kenneth being the younger of the two. During World War I, Samuel May served as a First Lieutenant in the U.S. Army. After the First World War Samuel May studied political science and was appointed as an instructor at Dartmouth College in Hanover, New Hampshire, before being appointed to the political science department at Berkeley in\n1921\n. He set up the Bureau of Public Administration at Berkeley in\n1930\n, the year he became a full professor. He became the Bureau's first director, a position he held until he retired. Eleanor, Kenneth's mother, had been born in England. She was a strong influence on her son but tragically was killed in a gas explosion when he was twenty years of age.\nKenneth attended the Music Education School in Portland, Oregon, before his father was appointed to Berkeley. After the family moved to Berkeley in\n1921\n, Kenneth attended several schools there. These schools were, in the order he attended them, The Williams School, Cragmont School, Garfield Junior High School, and Berkeley High School. He acquired a copy of\nWhitehead\nand\nRussell\n's\nPrincipia Mathematica\nwhich he read while at high school and this turned him on to mathematics so he decided that he would major in mathematics at university. It was not only academic studies that he excelled in at high school, however, for he was also athletic and played tennis, achieving a California junior ranking.\nMay entered the University of California, Berkeley, intending to major in mathematics but also taking a wide range of subjects. He changed from tennis to soccer and played in the university team. He showed himself one of the brightest students at Berkeley gaining top prizes in his first and subsequent years. He took courses on mathematics, science, economics, German and Italian but he majored in mathematics gaining his A.B. in\n1936\n.\nGriffith Evans\nhad been appointed as a professor and chairman of the Mathematics Department at Berkeley in\n1934\nand he was given the task of revitalising and improving the department as well as setting up a programme for graduate studies.\nEvans\nhad many different mathematical interests including\npotential theory\n,\nfunctional analysis\nand\nintegral equations\n. However he had also written papers on mathematical economics, in particular on monopolies, competition and cooperation, taxation, profit, prices, etc.\nEvans\nhad spotted May's talents soon after becoming the Head of Department and encouraged him to think about research in applying statistics to problems of national economic planning. This was an area that interested both\nEvans\nand May, so May studied for his Master's Degree in session\n1936\n-\n37\nwith this in mind, taking courses in mathematics, economics and physics. He was awarded his Master's Degree in\n1937\n.\nA change in his political outlook occurred while he was an undergraduate. He became politically active, arguing strongly against racial discrimination. During his undergraduate days he had joined the Communist Party, something which would have a major impact on his relations with his family and on his career. He began his doctoral studies but, having joined the Institute of Current World Affairs on the recommendation of\nGriffith Evans\n, he now accepted a fellowship from them. His father, who was a professor of political science at Berkeley, approved of May taking up this fellowship. The Institute of Current World Affairs had a stated policy to:-\n... identify areas or issues of the world in need of in depth understanding, and then to select young persons of outstanding character to study and write about those areas or issues.\nMay fitted these criteria well and he was given the task of studying how science and technology was funded and organised in Russia, and what impact science and technology had on the economy and on politics. This would provide an excellent background to the topic that May was intending to research for his doctorate. He prepared for taking up the fellowship by spending the summer of\n1937\nstudying Russian in a seminar at the Institute of Pacific Relations, part of the University of California. He continued his doctoral studies and took the preliminary examination before beginning work on a thesis. This preliminary examination consisted of submitting a report on which he then was examined. His report was entitled 'Galois Theory of Equations' and was a historical essay. This is the first sign that May was becoming interested in the history of mathematics, the topic for which he is best remembered today. Immediately following this examination he started work on the fellowship, visiting various people associated with the Institute of Current World Affairs both in the United States and Canada before sailing to London.\nThe choice of London as the place to begin his work was a good one since there were strong units in that city involved in Russian studies, in statistics and in economic planning. He had hoped to be able to go to Russia as a student but this was refused by the Russian authorities. He therefore chose to study in London and visit Russia as a tourist. In Russia in October\n1937\n, he bought many books which he had shipped back to England. He spent time with\nR A Fisher\n's research group in London and travelled round England observing various aspects of how things were organised. However by the summer of\n1938\nhe felt that his project had no specific aims and he felt that he wanted to undertake work which would lead him to a Ph.D. While in London, he married Ruth McGovney on\n25\nJuly\n1938\n. His father had tried to prevent the marriage and had travelled from Berkeley to London in an attempt to prevent it. The marriage also broke his fellowship agreement with the Institute of Current World Affairs. Ruth McGovney was a school teacher in Oakland, California, and the daughter of Dudley McGovney, the professor of law at Berkeley. The relationship was made more difficult since May's father and Ruth's father had disliked each other for years and also Ruth McGovney was six years older than her husband. May resigned his fellowship but, since his new wife was in Europe for a year on academic leave, they decided to continue to remain in Europe for the duration of her leave.\nKenneth and Ruth May spent the winter of\n1938\n-\n39\nin Paris where May continued his studies of statistics and economics at the Sorbonne. At this stage he was setting out the main ideas that would become his doctoral thesis, although it was seven years before he would submit it. In the summer of\n1939\nthey left Paris on a visit to the Soviet Union and May discussed his ideas with academics in Moscow, Kiev and Kharkov. They returned to London and, shortly afterwards, sailed back to the United States. After returning to Berkeley, May was appointed as an assistant at the University teaching courses on financial mathematics, analytic geometry and calculus. His wife continued with her teaching position at Oakland. His role in the Communist Party at Berkeley increased and he began taking a leading position. By the summer of\n1940\nEurope was engulfed in war with Russia allied to Germany. In September\n1940\nthe United States began conscription. The Communists opposed conscription and held meetings on the Berkeley campus. May's role in the Communist Party led to a bitter dispute with his father. On\n11\nOctober he was dismissed from his teaching position at Berkeley on the grounds that his political views were incompatible with those of the faculty. He could have continued his doctoral studies at Berkeley but he chose to take indefinite leave.\nFor more about May's break with his father and his role in the Communist Party, see\nTHIS LINK\n.\nMay now became fully occupied in Communist activities. The events of\n1941\nhad a huge impact on matters. First, in June of that year, Hitler invaded Russia and then the Japanese attack on Pearl Harbor brought the United States into World War II in December\n1941\n. May tried to enlist but his Communist affiliations made the authorities reluctant to see him serve in the U.S. army. His marriage broke up around this time. He stood as a Communist candidate in the\n1942\nCalifornia state elections. Not surprisingly, he fell a long way short of being elected. Eventually, in November\n1942\nhe was allowed to join the army and, with experience of mountaineering and skiing, he was assigned to the\n87\nth\nMountain Infantry. Serving in the army also led to a reconciliation with his father. On\n19\nMay\n1944\n, while home on leave, he married Jacqueline Bromley whom he had met around\n1940\nwhile working for the Communist Party.\nSent to Italy with the U.S. Army, May served with great bravery and courage. After hostilities ended he taught mathematics in Florence at the Army University Study Center for several months. He returned to Berkeley and submitted his doctoral thesis\nOn the Mathematical Theory of Employment\nin the summer of\n1946\n. He received his Ph.D. on\n2\nAugust of that year and, shortly after this, he was appointed to Carleton College in Northfield, Minnesota. He taught mathematics at Carleton College from\n1946\nto\n1964\nand during these years his mathematical interests changed.\nFrom\n1946\nMay published on mathematical economics with papers such as\nThe aggregation problem for a one-industry model\n(1946)\n,\nProbabilities of certain election results\n(1948)\n,\nEconomics and technology: Production functions\n(1950)\nand\nEconometric models of the national economy\n(1952)\n. However, his interests changed in the\n1950\ntowards mathematical education and, in the\n1960\ns, to the history of mathematics with papers such as\nThe origin of the four-color conjecture\n(1965)\nand biographies of\nPaul Appell\n,\nEric Temple Bell\nand\nÉmile Borel\nin the\nDictionary of Scientific Biography\n. His most important work on the history of mathematics is his article on\nCarl Friedrich Gauss\nfor the\nDictionary of Scientific Biography\n(1972)\n.\nSee extracts from some of his papers at\nTHIS LINK\n.\nSee also reviews of his two undergraduate textbooks\nElementary analysis\n(1952)\nand\nElements of modern mathematics\n(1959)\nat\nTHIS LINK\n.\nIn\n1964\nMay left Carleton College and spent two years at Berkeley where he was appointed as a visiting scholar and research mathematician. Then in\n1966\nhe moved to Toronto when he was appointed to the University of Toronto in two roles, as a historian of mathematics and as a mathematical educationalist. He remained at Toronto for the rest of his life and, in the year he took up his position in Toronto, he took on the role as editor of the book review section of the\nAmerican Mathematical Monthly\n. After four years in this role, he wrote\n[\n11\n]\n:-\nThe experience of examining virtually every English mathematical book published during a four year period has been most enjoyable and instructive. A goodly proportion were undistinguished pot boilers. Some were mathematically and pedagogically unsound, the first most common for the numerous remedial level books, the second too often true of advanced texts and treatises. Nevertheless the general impression is of improving quality. There is a healthy trend away from a show of rigor and toward genuine motivation, clear explanation, and closer links with applications. More books at the elementary level reflect genuine meditation about the problems involved, and more advanced books display scholarship as well as mere technical proficiency. It is to be hoped that these healthy tendencies will continue, since the unquestioning acceptance by the public of anything dished out by mathematicians, including publications and graduates, is likely soon to become a thing of the past. Sources of funds, employers, and students are likely to be increasingly insistent in their questions about the social utility of mathematics and mathematicians.\nWe must now describe what most people consider his greatest contribution, namely the founding of the journal\nHistoria Mathematica\n. In\n1968\nMay attended the International Congress on the History of Science in Paris and discussed with Rene Taton and\nAdolph Pavlovich Yushkevich\nthe need for a specialist journal on the history of mathematics. The three mathematicians felt that the way forward was to set up a commission to work towards founding such a journal. Indeed at the following International Congress on the History of Science in Moscow in\n1971\n, a commission was set up and May was elected as chairman. Returning to Toronto, in November\n1971\nMay sent of the first of five Newsletters containing his aims for the new journal\n(\nsee for example\n[\n4\n]\n)\n:-\nThe journal will be an international journal open to all historians, all points of view, and all approaches to the history of mathematics. It will serve as the professional journal of historians of mathematics, facilitating communication among themselves and with mathematicians, historians of science, teachers, and others interested in their work. It will deal with the history of all aspects of mathematics, including biography, education, philosophy, applications, organizations, institutions, methodology, historiography, relations with other sciences, technology, and general history, but not including the history of related fields such as physics.\nThe fifth of these Newsletters appeared in June\n1973\nwith the first issue of\nHistoria Mathematica\nbeing published in February\n1974\n. May was the editor and, remarkably, his efforts had produced about\n700\nsubscribers to this first issue from\n39\ncountries. The journal rapidly gained further subscribers over the next few years. May wrote the paper\nWhat is good history and who should do it?\nwhich appeared in the second volume of\nHistoria Mathematica\n. In it he gave his personal reasons for studying the history of mathematics\n[\n18\n]\n:-\nWhen it comes to purpose, I can only state my preferences. I believe that history can and should be socially useful, to historians of science, to policy makers, to students and users of mathematics, to the educated layman, and above all to the mathematicians who are its most reliable consumers and the creators of its raw material. The history of mathematics seems to have arrived at a takeoff point for the serious study of the recent developments, and a successful flight requires a collaboration of historians and creative mathematicians for which this workshop is a good omen.\nIn the same year that\nHistoria Mathematica\nwas founded, May founded the Canadian Society for History and Philosophy of Mathematics. This Society adopted\nHistoria Mathematica\nas its official journal.\nSadly, however, May's health took a turn for the worse. He had a heart attack in the autumn of\n1975\nbut, despite regaining much of his former fitness, he felt that he had to cut down on his workload and, as a consequence, decided he had to give up being the editor of\nHistoria Mathematica.\nHe wrote in the editorial of the first issue of\n1976\n:-\nThe distinguished predecessors of 'Historia Mathematica' were associated with their founders and died with them. If 'Historia Mathematica' is to avoid this fate, we must prepare and carry through a prompt transfer of editorial responsibility to younger hands.\nHe also gave up the directorship of the Institute for the History and Philosophy of Science and Technology. Bruce Sinclair writes\n[\n4\n]\n:-\nKen May was the Director of the Institute for the History and Philosophy of Science and Technology from\n1973\nto\n1975\n. The normal term of office for directors of institutes is five years, but in the autumn of his second year, Ken suffered a heart attack. He directed things pretty well even from a hospital bed and was back in the office a few months later, but in the following spring he decided it would be better for his recovery to resign the directorship. Once he made up his mind, Ken rarely looked back, but I believe resigning was a difficult thing for him to do. He had a natural and easy talent for leadership, he liked the job, and he had ideas for the Institute.\nDespite taking these precautions, May died from a heart attack in December\n1977\n. The authors of\n[\n3\n]\nwrite:-\nHe was a person of great integrity, with tremendous energy and a dedication to the history of mathematics that has served the entire community of historians of science. As the founder and editor of 'Historia Mathematica', he was able to bring historians of mathematics together to make this journal a truly international effort, one which reflects the cooperation and friendship of scholars everywhere.\nCharles Jones writes in\n[\n4\n]\n:-\nHis working life-style seemed to be almost obsessed with eliminating excess baggage of any kind. He was stimulated by the challenge to pare down to the basic, minimum essentials in every activity. His research methods were a model of efficiency, as was his administrative style. His conversations and his actions were always direct and forthright. He inspired great affection and devotion from his students.\nDonald Coxeter\nwrites\n[\n4\n]\n:-\nI knew Ken for many years and enjoyed talking with him about the world in general and the history of geometry in particular. I often consulted him, and always found him willing to share his great knowledge of mathematical literature. ... dictionary of mathematics to replace the few unsatisfactory ones that already exist. I hope his colleagues will be able and willing to finish this enormous task. He was warm-hearted and conscientious. We will miss him very much.\nLet us end with May's own reflections on how he lived his life\n(\nsee\n[\n35\n]\n)\n:-\nSince early adolescence I have conditioned myself so that feelings of pleasure and social usefulness are in harmony; and I have organized time and effort to maximize them simultaneously. This has meant a rigorous program of intellectual and physical activity; cooperation with many individuals and organizations; and an effort to be rigorously honest in communication.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Statistics"
  ]
}