{
  "nome_completo": "Kiyoshi Oka",
  "nome_curto": "Kiyoshi Oka",
  "ano_nascimento": "1901",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oka/",
  "lugar_nascimento": "Osaka, Wakayama Prefecture, Japan",
  "lugar_morte": "Nara, Japan",
  "biografia": "Kiyoshi Oka\nentered the Imperial University of Kyoto in\n1922\nto study physics. However in\n1923\nhe changed topic to study mathematics, graduating with a degree in mathematics in\n1925\n.\nIn the same year he was appointed as a lecturer in the Faculty of Science at the Imperial University of Kyoto. In\n1929\nhe was promoted to assistant professor of mathematics. In fact\n1929\nwas a very significant year for Oka for in that year he took sabbatical leave and went to the University of Paris. He became interested in unsolved problems in the theory of functions of several complex variables while working in Paris. The reason that his work took this direction was that in Paris he became acquainted with\nJulia\n.\nOka remained on the staff at the Imperial University of Kyoto while he was on leave in Paris but on his return to Japan in\n1932\nhe accepted a position as assistant professor in the Faculty of Science of Hiroshima University.\nIn\n1938\nOka went to Kimitoge in Wakayama where he studied, presented his doctoral thesis to the University of Kyoto in\n1940\n. After obtaining his doctorate, Oka was a research assistant at Hokkaido University during\n1941\n/\n41\n, then, with the support of the Huju-kai Foundation under the chairmanship of Takagi, he spent the next seven years again at Kimitoge in Wakayama.\nOka was appointed professor at the Nara University for Women in\n1949\n, a post he held until\n1964\n. From\n1969\nuntil his death in\n1978\n, he was professor of mathematics at the Industrial University of Kyoto.\nHis most famous work was published in a\n25\nyear period from\n1936\n, when he solved a number of important problems. He worked on the theory of functions of several complex variables.\nHenri Cartan\ndescribes in\n[\n1\n]\nthe way that Oka came into the subject:-\nThe publication in\n1934\nof a monograph by\nBehnke\n-Thullen marked a crucial stage in the development of the theory of analytic functins of several complex variables. By giving a list of the open problems in the area, this work played an important role in deciding the direction of Oka's research. He set himself the almost super-human task of solving these difficult problems. One could say that he was successful, overcoming one after the other the obstacles he encountered on the way.\nHowever, the technical aspects of his proofs and the way he presents his results make his work difficult to read. It is only with considerable effort that one can appreciate the considerable strength of his results. This is why, even today, it is worth collecting his work as a tribute to its creator, Kiyoshi Oka.\nOka was also interested in Japanese poetry and Zen philosophy.\nOka received a number of important honours. He was awarded the Medal of the\nJapan Academy of Science\nin\n1951\n, the Asahi-bunka-sho Prize of Culture in\n1954\nand the Bunka-kunsho Medal of Culture in\n1960\n.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}