{
  "nome_completo": "Konrad Zuse",
  "nome_curto": "Konrad Zuse",
  "ano_nascimento": "1910",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zuse/",
  "lugar_nascimento": "Berlin-Wilmersdorf, Germany",
  "lugar_morte": "Hünfeld (near Fulda), Germany",
  "biografia": "Konrad Zuse\nwas brought up in Braunsberg, East Prussia where he attended the Humanistisches\nGymnasium\n. He entered the Technische Hochschule of Berlin- Charlottenburg in\n1927\nwhere he took courses in civil engineering. It was these studies in engineering which led Zuse to become interested in developing a mechanical device for calculating around\n1934\n. He found that he had to spend many hours\n[\n4\n]\n:-\n... working through the long statics calculations which are so important in the training of civil engineers...\nAfter graduating Zuse joined the Henschel Aircraft Company where he worked on stress analysis. In particular he studied the stresses caused by vibrations of an aircraft's wing. His work again involved a great deal of calculation and so, to help him perform these calculations, Zuse built his Z\n1\ncomputer in his parents living room. He wrote:-\nI started in\n1934\n, working independently and without knowledge of other developments going on around me. In fact, I hadn't even heard of\nCharles Babbage\nwhen I embarked on my work.\nZuse completed the machine in\n1938\n. It was entirely mechanical, with an arithmetic unit composed of large numbers of mechanical switches, and a memory consisting of layers of metal bars between layers of glass. One of its most innovative features was that it could be programmed by means of a punched tape. The main reason why Zuse succeeded in building his mechanical computer where\nBabbage\nhad failed, was the fact that Zuse's Z\n1\nwas a binary machine with two position switches to represent\n0\nand\n1\n. However, to say that Zuse succeeded with the Z\n1\nis a bit of an exaggeration, for the machine did not work very well. The memory was a successful feature, the way that commands were transmitted through mechanical linkages was not successful.\nZuse's plans to develop a bigger and better computer the Z\n2\ninvolved keeping the same memory system but replacing the mechanical arithmetic unit by electromechanical relays. However the project was interrupted by World War II when Zuse was called up for military service. He was put in the German infantry but persuaded the army to allow him to return to building computers.\nThe Third Reich's Aerodynamic Research Institute funded his work and he completed building the Z\n2\nwhich was still an experimental computer. He then progressed to build the Z\n3\nwhich was the first computer which Zuse built to be used rather than to test out his ideas. The Z\n2\nand Z\n3\ncomputers were electromechanical relay machines and the Z\n3\n, completed in\n1941\n, had an electromechanical memory composed of relays as well as an electromechanical arithmetical unit.\nOf course to make it useful for computation, the Z\n3\nrequired many relays and it indeed it contained about\n2600\n. It was the first operational program-controlled calculating machine and was used by the German aircraft industry to solve systems of simultaneous equations and other mathematical systems which were produced by the problems of dealing with the vibration of airframes put under stress.\nHowever when Zuse proposed a computer based on electronic valves, the proposal was rejected on the grounds that the Germans were so close to winning the War that further research effort was not necessary.\nSome of Zuse's computers were destroyed in bombing raids near the end of the war although the Z\n3\nwas reconstructed in\n1960\nfor display in a museum in Munich. Zuse began work on his Z\n4\ncomputer in\n1942\n, and it was almost complete when, due to continued air raids, it was moved from Berlin to Göttingen. After only a few weeks Göttingen was in danger of being captured by the advancing Russian troops and the Z\n4\nwas moved again, this time to the small village of Hinterstein in Bavaria. The Z\n4\nwas coded the Versuchsmodell\n4\n, or V\n4\n, and hidden in the cellar of a house. Ashurst writes\n[\n4\n]\n:-\nBecause of the association of V\n4\nwith the V\n1\nand V\n2\nflying bombs and rockets, the British and American troops who eventually found it\n(\nit had not been found by the French who entered the village first\n)\nwere most surprised when their multifarious precautions were unnecessary and the fearsome V\n4\nwas just a conglomeration of mechanical bits and pieces.\nFinally the Z\n4\ncomputer was taken to Switzerland where it was installed in the ETH in Zürich in\n1950\n. It remained operational there until\n1955\nwhen it was moved to a French aerodynamical research institute close to Basel where it remained in use until\n1960\n.\nIn fact Zuse designed several computers other than those of his Z series. His S\n1\nand S\n2\ncomputers were used for computing the precise measurements necessary for the production of aircraft. For the S\n2\nthe computer included measuring devices to make measurements of the planes in production and to feed these directly into the calculations. The L\n1\ncomputer which Zuse designed was not for solving arithmetical problems, but rather it was designed to solve logical problems. Only an experimental version was produced, no further work being done on this innovative idea.\nThese developments were entirely independent of those of\nJohn Eckert\n,\nMauchly\nand Howard\nAiken\nin the USA, and\nTuring\nin England. Zuse later wrote:-\nAfter the War was finally over, news of the University of Pennsylvania ENIAC machine went all round the world - \"\n18\n,\n000\ntubes!\". We could only shake our heads. What on earth were all the tubes for? ... The English development known as COLOSSUS was unheard of outside the circle of those working on it. It was only much later that the wraps came off this very interesting project.\nZuse set up his own computing company in\n1950\nand it was taken over by the Siemens electronics firm in\n1967\n. In\n1965\nhe had received the Harry M Goode Memorial Award, a medal and $\n2\n,\n000\nawarded by the Computer Society:-\nFor his contributions to, and pioneering efforts in, automatic computing; for independently proposing the use of the binary system and floating-point arithmetic; and for designing the first program-controlled computer in Germany - one of the earliest in the world.\nBy\n1958\nhe had reached the Z\n22\ncomputer, which was one of the first to be designed with transistors. Zuse continued to undertake research on computers and acted as a consultant to Siemens after the firm took over complete control of Zuse's computer company in\n1969\n.\nAs well as his hardware developments Zuse was also interested in software and he developed the first algorithmic programming language known as \"Plankalkül\" in\n1945\n. He used the language to design a chess playing program. Although the language was not widely used it formed the basis for the next generation language ALGOL which, of course, became a widely used language world-wide.",
  "math_areas": [
    "Logic",
    "Number Theory"
  ]
}