{
  "nome_completo": "Kurt Hensel",
  "nome_curto": "Kurt Hensel",
  "ano_nascimento": "1861",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hensel/",
  "lugar_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Marburg, Germany",
  "biografia": "Kurt Hensel\nwas born in East Prussia, in the city then called Königsberg. His father was Sebastian Hensel who was a landowner at the time that Kurt was born, but later moved to Berlin becoming a director of a construction firm. Kurt's mother was Julie von Adelson, the daughter of the businessman Jacob Ludwig von Adelson. It was a family containing many outstanding artists, musicians and scientists. Perhaps the most famous members of the family were Fanny and Felix Mendelssohn. Fanny was the eldest sister of the famous composer Felix Mendelssohn, and she married the Prussian court painter Wilhelm Hensel in\n1829\n. Fanny was herself a famous pianist and composer who wrote about\n500\nmusical compositions in all, including about\n120\npieces for piano. Sebastian Hensel, the son of Fanny and Wilhelm Hensel, was born in\n1830\n. Sebastian, who was Kurt's father, wrote a biography of the Mendelssohn family based partly on Fanny's diaries and letters, which provide a great deal of information about her brother Felix. Fanny and Felix Mendelssohn were children of Abraham Mendelssohn who was the son of the Jewish-German philosopher Moses Mendelssohn. While we are looking at this fascinating family, let us note that the youngest son of Moses Mendelssohn was Nathan Mendelssohn who was a  maker of mathematical instruments. Nathan had a daughter Ottilie Ernestine who married\nKummer\n. One of\nKummer\n's daughters married\nHermann Schwarz\n.\nWhile the family lived in Königsberg, Hensel did not attend school but was taught at home by his parents up to the age of nine. After the family moved to Berlin, Hensel attended the Friedrich-Wilhelm\nGymnasium\nand there he was taught mathematics by K H Schellbach. Schellbach was an outstanding teacher of mathematics and with such a talented pupil he was soon able to give Hensel a deep love of the subject in addition to a sound technical knowledge. There was certainly no doubt in his mind when he left the high school that the subject he wanted to study at university was mathematics. German students of this time did not choose a single university at which to study, but rather moved around to sample the courses in several different institutions. Hensel's studies were in Berlin and Bonn. Among his teachers were\nLipschitz\n,\nWeierstrass\n,\nBorchardt\n,\nKirchhoff\n,\nHelmholtz\nand\nKronecker\n.  It was\nKronecker\nwho was the greatest influence on Hensel and supervised his doctoral studies at the University of Berlin. Hensel submitted his thesis\nArithmetische Untersuchungen über Diskriminaten und ihre ausserwesentlichen Teiler\nⓉ\n(\nArithmetic research on discriminants and their non-essential factors\n)\nto Berlin in\n1884\nand he continued to work there, submitting his\nhabilitation\nthesis and becoming a\nprivatdozent\nin\n1886\n.\nHensel married Gertrud Hahn in Berlin in\n1887\n. Gertrud, who was born in\n1866\n, was the daughter of the industrialist Albert Hahn and aunt of the educationalist Kurt Hahn. Kurt Hahn is known in Scotland as the founder\n(\nin\n1934)\nof the internationally famous Gordonstoun School, near Elgin in the north east of the country, and known in Germany for his school at Salem. Gertrud and Kurt Hensel had one son and three daughters, including Albert, Ruth and Charlotte. Hensel was appointed to a full professorship at the University of Marburg in\n1901\n. He spent the rest of his career there, retiring in\n1930\nbut remaining in Marburg.\nHe devoted many years to the editing of\nKronecker\n's collected works. In fact he published five volumes of\nKronecker\n's works between the years\n1895\nand\n1930\n. Note that, remarkably, these dates span Hensel's career almost exactly, with the first volume appearing in the year between his doctorate and his habilitation, and the last volume appearing in the year he retired. Two other major volumes edited by Hensel were also devoted to\nKronecker\n's works. These are\nVorlesungen über Zahlentheorie\nⓉ\n(\nLectures on number theory\n)\n(1901)\n, and\nVorlesungen über die Theorie der Determinanten\nⓉ\n(\nLectures on the theory of determinants\n)\n(1903)\n. In addition Hensel wrote a eulogy for\nKummer\nGedächtnissrede auf Ernst Eduard Kummer\nⓉ\n(\nMemorial address on Ernst Kummer\n)\nand we noted above that in fact\nKummer\nwas a distant relation.\nHensel's work followed that of his doctoral supervisor\nKronecker\nin the development of arithmetic in\nalgebraic number fields\n. In\n1897\nthe\nWeierstrass\nmethod of power-series development for algebraic functions led him to the invention of the\np\np\np\n-adic numbers. Hensel was interested in the exact power of a prime which divides the\ndiscriminant\nof an\nalgebraic number field\n. The\np\np\np\n-adic numbers can be regarded as a completion of the rational numbers in a different way from the usual completion which leads to the real numbers. Ullrich writes in\n[\n5\n]\n:-\nDuring the last decade of the\n19\nth\ncentury Kurt Hensel started his investigations on p-adic numbers ... . He was motivated by the analogies of the number field case and the function field case, e.g., by the observation that prime numbers p and linear factors z-c play similar roles in these theories. This fact had already been pointed out in articles of\nKronecker\n(\nwho supervised Hensel's doctorate\n)\nand of\nDedekind\nand\nHeinrich Weber\n, which had been published in\n1881\nand\n1882\n, respectively, the paper of\nKronecker\nbased on a then unpublished manuscript from the year\n1858\n.\nHensel's invention led to the development of the concept of a field with valuation which has had a great influence on later mathematics. He was able to use his methods to prove many results in the theory of\nquadratic forms\nand number theory. Papers he published include\nZur Theorie der algebraischen Functionen einer Veränderlichen und der Abel'schen Integrale\nⓉ\n(\nOn the theory of algebraic functions of one variable and Abelian integrals\n)\n(1901)\n,\nÜber die Entwickelung der algebraischen Zahlen in Potenzreihen\nⓉ\n(\nOn the expansion of algebraic numbers into power series\n)\n(1901)\n,\nEine neue Theorie der algebraischen Zahlen\nⓉ\n(\nA new theory of algebraic numbers\n)\n(1918)\n, and\nNeue Begründung der arithmetischen Theorie der algebraischen Funktionen einer Variablen\nⓉ\n(\nNew basis for the arithmetic theory of algebraic functions of one variable\n)\n(1919)\n.\nIt was not until\n1921\nthat the full potential of the\np\np\np\n-adic numbers was demonstrated by\nHasse\nwhen he formulated the local-global principle. He showed, at least for\nquadratic forms\n, that an equation has a rational solution if and only if it has a solution in the\np\np\np\n-adic numbers for each prime\np\np\np\nand a solution in the reals. It was extremely fortunate for both\nHasse\nand for Hensel that that they came to work together. In\n[\n3\n]\nHasse\ndescribes how he came to work under Hensel in Marburg:-\n[\nAfter\nHecke\nleft Göttingen\n]\nI decided to continue my studies under Kurt Hensel in Marburg .,. What prompted my decision was this. In\n1913\nHensel published a book on\nnumber theory\n. I found a copy of this book at an antiquarian's in Göttingen and bought it. I found his completely new methods fascinating and worthy of thorough study. ...\nThe first book that Hensel wrote was a joint collaboration with\nGeorg Landsberg\n. Entitled\nTheorie der algebraischen Funktionen einer Variablen und ihre Anwendung auf algebraische Kurven und Abelsche Integrale\nⓉ\n(\nTheory of algebraic functions of one variable and its application to algebraic curves and Abelian integrals\n)\nit was published by Teubner in Leipzig in\n1902\n. It was reprinted by the Chelsea Publishing Company of New York in\n1965\n. Another book of major importance was Hensel's\nTheorie der algebraischen Zahlen\nⓉ\n(\nTheory of algebraic numbers\n)\npublished in\n1908\n. It was in this book that he developed his great idea of\np\np\np\n-adic numbers into a systematic theory. He continued to develop his theory in another book\nZahlentheorie\nⓉ\n(\nNumber theory\n)\npublished in\n1913\n, the book which was mentioned in Hasse's quote above and the one which led to him becoming Hensel's student. In these two books he showed the power of applying\np\np\np\n-adic methods to he theory of divisibility in algebraic number fields. Not only is the term\np\np\np\n-adic integer due to Hensel but also in\nZahlentheorie\nhe uses the description \"Fermat's Little Theorem\" for the first time:-\nThere is a fundamental theorem holding in every finite group, usually called Fermat's Little Theorem because\nFermat\nwas the first to have proved a very special part of it.\nFrom\n1901\nHensel was editor of the prestigious and influential\nCrelle\n's Journal. He was honoured in\n1931\nwith the award of an honorary doctorate from the university of Oslo.\nHensel died in the summer of\n1941\n, in the middle of World War II. A year later his daughter-in-law sold over one hundred items from his mathematical library to the Reichs-Universitat Strassburg.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}