{
  "nome_completo": "Kurt Werner Friedrich Reidemeister",
  "nome_curto": "Kurt Reidemeister",
  "ano_nascimento": "1893",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reidemeister/",
  "lugar_nascimento": "Brunswick, Germany",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Kurt Reidemeister\n's parents were Hans Reidemeister\n(1864\n-\n1936)\nand Sophie Langerfeldt\n(1872\n-\n1954)\n. Hans Reidemeister, a senior government official in the Brunswick government, married Sophie on\n17\nNovember\n1892\nin Helmsted. Hans and Sophie Reidemeister had three children, all born in Brunswick: Kurt Werner Friedrich Reidemeister\n(\nthe subject of this biography, born\n1893)\n, Hellmuth Gustav Otto Reidemeister\n(\nborn\n1895)\n, and Marie Sophie Luise Reidemeister\n(\nborn\n1898)\n.\nRichard Dedekind\nwas a family friend and, although he retired a few months after Kurt was born, he lived an active life for the first\n22\nyears of Kurt's upbringing.\nDedekind\n, who Kurt called \"uncle\", gave him excellent advice throughout his school and early university years. Kurt was certainly interested in mathematics when at the\nGymnasium\nin Brunswick, but he had other broad interests, particularly in philosophy and in art history.\nReidemeister graduated from the Brunswick Gymnasium in\n1911\nand entered the Albert-Ludwig University in Freiburg im Breisgau, one of the oldest universities in Germany founded in\n1457\n. He studied a broad range of courses including mathematics, philosophy, physics, chemistry and geology. In particular he attended a philosophy course given by Edmund Husserl\n(1859\n-\n1938)\n, the famous philosopher, who, in addition to studying philosophy, had taken courses by\nKarl Weierstrass\nand\nLeo Königsberger\n. Reidemeister also attended lectures by the philosopher Heinrich Rickert\n(1863\n-\n1936)\nat Freiburg. As was the custom with German students of this period, Reidemeister attended several different universities, moving to Marburg and the Göttingen after his studies at Freiburg. At Göttingen he attended lectures by\nEdmund Landau\n. However, Reidemeister was still a university student when World War I broke out in\n1914\n. He was called up for military service and served for four years, the full duration of the war, reaching the rank of Lieutenant. After being released from military duties he returned to his studies at Göttingen. In\n1920\n, he took the\nStaatsexamen\nto qualify as a Gymnasium teacher in mathematics, philosophy, physics, chemistry and geology, and was examined in mathematics by\nEdmund Landau\n[\n3\n]\n(\nsee also\n[\n5\n]\n)\n:-\nEdmund Landau\n, not known as an easy examiner, was his mathematics examiner and dismissed him after only\n30\nminutes with the grade of \"distinction\".\nHowever, Reidemeister did not become a Gymnasium teacher for, in October\n1920\n, he went to Hamburg to take up the position of assistant to\nErich Hecke\n. This was a particularly difficult period in Germany with the Allied powers imposing harsh reparations on the country in the Treaty of Versailles. Against this background of hunger and poverty, Reidemeister studied\nalgebraic number theory\nworking on his doctorate advised by\nHecke\n. His doctoral thesis was on algebraic number theory, the particular problem having been suggested by\nHecke\n, and the resulting publication\nRelativklassenzahl gewisser relativquadratischer Zahlköper\nⓉ\n(\nRelative class number of certain relatively quadratic number fields\n)\nappeared in\n1921\n. In\n[\n8\n]\nit is noted that:-\nOf all of the\n71\npapers listed in Reidemeister's obituary by\nArtzy\n(\n[\n4\n]\n)\n, this is the only one which deals with\nnumber theory\n. It rarely happens that a highly productive mathematician deserts the field of his PhD thesis so consistently later on.\nImmediately he had written his doctoral thesis, Reidemeister became interested in geometry. It was\nWilhelm Blaschke\nwho came up with the particular problems in\ndifferential geometry\non which Reidemeister began to work\n[\n3\n]\n:-\nIn Hamburg, he met\nWilhelm Blaschke\nwho turned him toward an interest in geometry, and\nBlaschke\nentrusted the brilliant student with cooperation on the second volume of his 'Differential Geometry'. Indeed, just a few months after receiving his doctorate, Reidemeister gave a plenary lecture on this subject, quite different from that of his dissertation, at the annual meeting of the\nGerman Mathematical Society\n[\nin Jena in September\n1921]\n.\nThe perspective and ideas that\nBlaschke\npresented, Reidemeister found absolutely fascinating and, quite unexpectedly, he completely changed the topics he was researching. His publications at this time included:\nÜber die singulären Randpunkte eines konvexen Körpers\nⓉ\n(\nOn the singular edge points of a convex body\n)\n(1921)\n;\nÜber Körper konstanten Durchmessers\nⓉ\n(\nOn a body of constant diameter\n)\n(1921)\n;\nÜber affine Geometrie. XXXI: Beständig elliptisch oder hyperbolisch gekrümmte Eilinien\nⓉ\n(\nOn affine geometry. XXXI: Resistant elliptically or hyperbolically curved space\n)\n(1921)\n; and\nDie Differentialgleichung der Schiebflächen\nⓉ\n(\nThe differential equation of  sliding surfaces\n)\n(1922)\n. However, he continued to be interested in philosophy and history, and he was also fascinated to read the book\nDer Untergang des Abendlandes\nⓉ\n(\nThe decline of the West\n)\nby the historian and philosopher of history Oswald Spengler\n(1880\n-\n1936)\n. The first volume of the book appeared in\n1918\nwith the second volume coming out in\n1922\n. The book, which had a large section on mathematics, was controversial and prompted much discussion and argument. Reidemeister gave a lecture on Spengler's book but he also wrote short stories and poems, publishing regularly in the leading Hamburg newspaper. He published many reviews both of mathematics texts and texts on philosophy. For example his reviews of\nPrinciples of Geometry\nby\nHenry Baker\nand\nGrundzüge der mehrdimensionalen Differentialgeometrie\nⓉ\n(\nGeneral multidimensional differential geometry\n)\nby\nDirk Struik\nappeared in\n1923\n. He was also planning to\nhabilitate\nin Hamburg but, while his thesis was still in the planning stage, he received a call to a chair.\nOn\nHans Hahn\n's recommendation, despite having never habilitated, Reidemeister was appointed as associate professor of geometry at the University of Vienna in October\n1923\n. Here he became a colleague of\nHans Hahn\n,\nWilhelm Wirtinger\nand\nPhilipp Furtwängler\n. Two brilliant students were also about to complete their doctorates,\nOtto Schreier\nand\nKarl Menger\n. It was\nWirtinger\nwho interested Reidemeister in\nknot theory\n, the topic for which he is best remembered today. In particular\nWirtinger\nshowed Reidemeister how to compute the\nfundamental group\nof a knot from its projection. This method, originally due to\nWirtinger\n, appears in work of\nArtin\nwhich was published in\n1925\n. In Vienna, he met Elisabeth Wagner who was a professional photographer and the daughter of a Protestant minister from Riga; they married in\n1924\n. In fact this move to Austria was very beneficial for Reidemeister since it allowed him to escape from the misery of hyper-inflation in Germany with the strikes and unrest which resulted. While in Vienna, Reidemeister came across the\nTractatus\nby\nWittgenstein\nand joined the Vienna Circle of Logical Positivists. Led by Reidemeister, the group of mathematicians at Vienna spent a year studying the deep ideas on logic and mathematics in the\nTractatus\n.\nIn\n1925\nReidemeister was offered the chair in Königsberg which had been left vacant when\nWilhelm Meyer\nretired, which he accepted. There he worked with several young mathematicians including\nRuth Moufang\n,\nRichard Brauer\n, Werner Burau, and\nRafael Artzy\n(\nthe author of\n[\n4\n]\n)\n. He continued to publish reviews, for example his reviews of\nFormalismus und Intuitionismus in der Mathematik\nⓉ\n(\nFormalism and intuitionism in mathematics\n)\nby Richard Baldus,\nBegriffsbildung\nⓉ\n(\nConceptualization\n)\nby Karl Boehm, and\nSystematische Axiomatik der Euklidischen Geometrie\nⓉ\n(\nSystematic axioms of Euclidean geometry\n)\nby Moritz Geiger appeared in\n1926\n. In\n1930\nthe German Mathematical Congress met in Königsberg and Reidemeister organised the first international conference on the philosophy of mathematics to be a part of the larger Congress. Reidemeister worked on the foundations of geometry and he wrote an important book on knot theory\nKnoten und Gruppen\nⓉ\n(\nKnots and groups\n)\n(1926)\n. He established a geometry and\ntopology\nbased on\ngroup theory\nwithout the concept of a limit. He published other important books while at Königsberg:\nVorlesungen über Grundlagen der Geometrie\nⓉ\n(\nLectures on the foundations of geometry\n)\n(1930)\n,\nEinführung in die kombinatorische Topologie\nⓉ\n(\nIntroduction to Combinatorial Topology\n)\n(1932)\nand\nKnotentheorie\nⓉ\n(\nKnot theory\n)\n(1932)\n. The authors of\n[\n8\n]\ncomment on this\n1932\ntext on combinatorial topology:-\nAlthough Reidemeister ... was, above all, a geometer, his book on 'combinatorial topology' contains hardly any drawings. Abstraction and rigor were very much in fashion.\nHis knot theory book of\n1932\nwas short, being only\n74\npages long, but was highly significant. It was reprinted in\n1974\nand translated into English in\n1983\n. After an Introduction, the book contained the following chapters: Knots and their projections; Knots and matrices; Knots and groups; and Tables of knots. Reidemeister's\nGrundlagen der Geometrie\nⓉ\n(\nFoundations of Geometry\n)\nwas reviewed by Robin Robinson who writes\n[\n16\n]\n:-\nReidemeister's work is restricted almost entirely to the plane, and his chief aim seems to be the setting up of an axiomatic basis for the study of affine and projective geometries. Two distinct approaches to this task are considered - the analytic and the axiomatic, and they motivate the division of the book into two parts. In the first part Reidemeister discusses the foundations of algebra, and bases affine and projective geometries on them. In the second part, a purely axiomatic development of geometry is based on the concept of a\n3\n-web, and its completeness and consistency are demonstrated by forming from it a number system satisfying the postulates embodied in the first part. ... Both as an original composition and for its collection of interesting developments, this work is a distinct addition to geometrical literature, and should appeal strongly to anyone deeply interested in the logical foundations of geometry.\nAlthough academically he was achieving great things in Königsberg, life there for him and his wife was not easy, and they found it impossible to maintain the wide-ranging cultural life they had previously enjoyed. He was forced to leave his chair in Königsberg in\n1933\nby the Nazis, whom he strongly opposed, who classed him as 'politically unsound'\n[\n3\n]\n:-\nIn January\n1933\n, shortly before Hitler's accession to power, National Socialist students at Königsberg fomented a disturbance directed against the university Rektor. Reidemeister devoted a whole mathematics lecture to explaining why the behaviour of these students was totally unsupportable and not compatible with rational thinking.\nHe only learnt that he had been dismissed when he read it in the local newspaper. He was shattered by this treatment\n[\n5\n]\n:-\nThe experience of Königsberg left serious wounds in him that never quite healed. The aging Reidemeister always had an attitude of being easily prone to moral outrage, an attitude which had its root here.\nBlaschke\nimmediately tried to help his colleague and collected signatures on a petition seeking to reinstate Reidemeister. After being suspended from his chair, Reidemeister went to Rome where he continued to undertake research. Perhaps due to\nBlaschke\n's efforts, he was appointed to\nKurt Hensel\n's chair in Marburg at what was considered a smaller and less prestigious university. He took up the position in the autumn of\n1934\n. The next years were difficult ones for him living under Nazi rule and then living through the horrors of World War II. Of course he had to keep his views from becoming public since he had learned the consequences when in Königsberg. However, he had a small circle of friends in Marburg whom he could trust and with whom he could express his views. In\n1938\nhe published the book\nTopologie der Polyeder und kombinatorische Topologie der Komplexe\nⓉ\n(\nTopology of polyhedra and combinatorial topology of complexes\n)\n. The review\n[\n15\n]\nbegins by putting this work in context:-\nThe first systematic exposition of combinatory topology was made by\nDehn\nand\nHeegaard\nin a section of the \"Enzyklopadie der mathematischen Wissenschaften\", in which the exact concepts involved are only developed as far as the third dimension. The extension of the theory to complexes of higher dimensions was fraught with considerable difficulties; and it was due to the work of\nM A H Newman\nthat the gap was finally bridged. In the section of the encyclopaedia referred to above, he showed that combinatory topology was one of the most primitive branches of geometry, in which the concept of limiting values had as yet no place. In fact, as Professor Reidemeister describes in detail in the present treatise, combinatory topology turns out to be a well-defined partial domain of the theory of polyhedra - a fact well calculated to demonstrate the elementary character of the subject and to justify Professor Reidemeister in providing a new and systematic presentation of it.\nReidemeister had an important influence on group theory, partly through his work on knots and groups, partly through his influence on\nOtto Schreier\n. Talking of this influence on group theory, Chandler and\nMagnus\nwrite in\n[\n8\n]\n:-\nReidemeister was ... essentially a geometer. His influence on combinatorial group theory is largely that of a pioneer. His ideas were stimulating and had, at least in some cases, a long-lasting effect.\nAfter he went to Marburg, Reidemeister's interests became almost exclusively philosophy, the foundations of mathematics and the history of mathematics. For example he published\nDie Arithmetik der Griechen\nⓉ\n(\nThe arithmetic of the Greeks\n)\n(1940)\n,\nMathematik und Logik bei Plato\nⓉ\n(\nMathematics and logic in Plato\n)\n(1942)\n, and\nDas System des Aristoteles\nⓉ\n(\nThe system of Aristotle\n)\n(1943)\n. He published two volumes of his essays and poems:\nFiguren\nⓉ\n(\nFigures\n)\n(1946)\nand\nVon dem Schönen\nⓉ\n(\nFrom the beautiful\n)\n(1947)\n. He translated poems by the French poet and critic Stéphane Mallarmé which he published in\n1948\nas the book\nDichtungen\nⓉ\n(\nPoetry\n)\n. Reidemeister spent the two years\n1948\n-\n50\nat the Institute for Advanced Study at Princeton in the United States. There he enjoyed talking to\nOswald Veblen\n,\nCarl Siegel\nand\nHermann Weyl\n. His interest in\nalgebraic topology\nwas renewed and he gave the specially invited plenary address\nComplexes and homotopy chains\nto the Philadelphia Meeting of the\nAmerican Mathematical Society\non\n30\nApril\n1949\n. It was later published in the\nBulletin\nof the Society.\nReturning to Marburg, he published books\nDas exakte Denken der Griechen\nⓉ\n(\nThe exact thinking of the Greeks\n)\n(1949)\n,\nGeist und Wirklichkeit, Kritische Essays\nⓉ\n(\nMind and reality, Critical Essays\n)\n(1953)\n, and\nDie Unsachlichkeit der Existenzphilosophie\nⓉ\n(\nThe lack of objectivity of existentialism\n)\n(1954)\n. In\n1955\nReidemeister left Marburg when he was appointed to the University of Göttingen. His most important publication while at Göttingen was\nRaum und Zahl\nⓉ\n(\nSpace and number\n)\n(1957)\n.\nDonald Coxeter\nreviewed this work in\n[\n9\n]\n:-\nThis book introduces several branches of mathematics, not only for their intrinsic interest but as background for philosophical discussions. The first chapter, on the origin of geometrical thought, contains a set of axioms for the affine plane, a description of some theorems of closure, and a well-chosen quotation from\nPlato\n's 'Menon', where Socrates is teaching his slave that the square on the diagonal of a given square has twice the area of the given square. This is followed by a delightful chapter on linkages, instruments for trisecting a given angle and for drawing ellipses and other special curves. The chapter on analytic geometry shows how translations, rotations and dilatations are represented by linear transformations of a complex variable, and how the scope is extended by considering linear fractional transformations. The fourth chapter gives a system of axioms for Euclidean geometry, using distance as a primitive concept. ... The fifth chapter describes some classical paradoxes and introduces the theory of transfinite ordinals and combinatorial topology. The sixth\n(\non geometry and logic\n)\nbegins with Hjelmslev's idea of representing the points and lines of the Euclidean\n(\nor non-Euclidean\n)\nplane by involutory transformations that leave them invariant ... This is followed by remarks about\nRussell\n's paradox and about affine geometry over an arbitrary field. The seventh chapter clarifies some prevalent obscurities in the foundations of differential and integral calculus. The eighth is a tribute to\nGauss\n. The ninth\n(\non geometry and number theory\n)\ndevelops the theory of algebraic numbers, leading to rigorous proofs of the impossibility, by Euclidean constructions, of\nduplicating the cube\nand trisecting an angle of\n600\n. The tenth and last chapter\n(\nProlegomena to a critical philosophy\n)\nis the text of a lecture to the \"Kongress des Internationalen Forums\"\n(\nZürich,\n1954)\n.\nIn Göttingen, both Reidemeister's own health and that of his wife began to deteriorate. He was unhappy at his fading abilities and isolated himself more and more. His friends tried to help him but they reached a stage when they could do no more  and he spent his last years in loneliness. He retired and reached the age of seventy without any celebration. His final scholarly contribution was his work as editor of\nHilbert-Gedenkband\nⓉ\n(\nHilbert commemorative volume\n)\n(1971)\n.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}