{
  "nome_completo": "Lai-Sang Young",
  "nome_curto": "Lai-Sang Young",
  "ano_nascimento": "1952",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young_Lai-Sang/",
  "lugar_nascimento": "Hong Kong, now China",
  "lugar_morte": null,
  "biografia": "Lai-Sang Young\nreceived her primary and secondary school education in Hong Kong. Her teaching there was partly in Cantonese and partly in English. She emigrated to the United States where she began her higher education.\nEntering the University of Wisconsin, Madison, Young received her B.A. in\n1973\n. She then moved to the University of California at Berkeley where she was awarded an M.A. in\n1976\nand a Ph.D. in\n1978\n. After the award of her doctorate Young taught at Northwestern University for a year beginning in\n1978\n. We mention below the time she spent at the University of Warwick, England, and following this, in\n1980\n, she also taught at Michigan State University.\nFollowing this she held a position at the University of Arizona, and concurrently she worked at the University of California at Los Angeles where she became Professor of Mathematics. During\n1983\n-\n84\nshe held a visiting position at the Mathematical Sciences Research Institute at Berkeley. Following this she was awarded an Alfred P Sloan Fellowship for\n1985\n-\n86\nwhich enabled her to spend this year at the University of Bielefeld in Germany. In\n1989\nshe held another visiting position, this time at the Institute for Advanced Study at Princeton.\nYoung's first paper was published in\n1977\nand gives results which she proved at the beginning of her graduate studies. The paper\nEntropy of continuous flows on compact\n2\n-manifolds\nwas published in\nTopology\nand shows that a continuous one-dimensional flow on a\n2\n-dimensional manifold has zero topological entropy. In each of\n1979\n,\n1980\nand\n1981\none of Young's papers appeared, these being:\nA closing lemma on the interval; Non absolutely continuous foliations for an Anosov diffeomorphism\n; and\nOn the prevalence of horseshoes\n.\nIn\n1979\n-\n80\na symposium was held at the University of Warwick in England on\nDynamical systems and turbulence\n. Young attended this and was one of the two editors, the other being David Rand, of the\nProceedings of the Symposium\nwhich was published in\n1981\n. Having mentioned all this work by Young on\ndynamical systems\nperhaps it is time to say briefly what a dynamical system is. It would be best for us give Young's own description of the area of dynamical systems as she describes it at the beginning of her clearly written article\nDevelopments in chaotic dynamics\nwhich appeared in the\nNotices of the American Mathematical Society\nin\n1998\n:-\nDynamical systems as a mathematical discipline goes back to\nPoincaré\n, who developed a qualitative approach to problems that arose from celestial mechanics. The subject has expanded considerably in scope and has undergone some fundamental changes in the last three decades. Today it stands at the crossroads of several areas of mathematics, including analysis, geometry, topology, probability, and mathematical physics. It is generally regarded as a study of the iteration of maps, of time evolution of differential equations, and of group actions on manifolds.\nIn\n1993\nYoung was honoured with the award of the Ruth Lyttle Satter Prize. The citation for this prize reads:-\nYoung has played a leading role in the investigation of the statistical\n(\nor ergodic\n)\nproperties of dynamical systems and has developed important and difficult techniques which have done much to clarify the subject. In one major paper she established the exponential decay of correlations for a certain class of quadratic maps, which are one of the simplest kinds of nonuniformly hyperbolic systems. this implies that the limit theorems of probability hold in this case. Although similar results were known for\n[\nsystems which have uniform hyperbolicity\n]\n, nothing was known in the nonuniform case, and the numerical evidence was contradictory. Thus, her result was both unexpected and deep.\nA second outstanding piece of work is her joint paper with Benedicks, in which they study the statistical properties of the Hénon attractor. They show that orbits from a subset of the basin of attraction of positive measure have a common distribution in the limit ... This explains why we \"see\" the attractor on the computer.\nThe joint paper referred to here is one Young wrote with Michael Benedicks which they published in the\nErgodic Theory of Dynamical Systems\nin\n1992\n.\nYoung's response to the presentation of the Ruth Lyttle Satter Prize was to thank\nJoan Birman\nfor creating the prize and the committee who selected her which was chaired by the previous winner Dusa\nMcDuff\n. She then continued:-\nI ... want to take this opportunity to express my gratitude to my teachers and friends for their support and guidence over the years.\nI would like to tell you a little about my work. For the last ten years one of my projects has been to study the dynamics of strange attractors. Numerically it has been observed time and time again that if we randomly pick a point near an attractor and plot the first\nn\nn\nn\npoints of its orbit, then the same picture emerges independently of the initial condition. This suggests the existence of a natural invariant measure, one that governs the asymptotic distribution of almost all points in the basin of attraction.\nAfter giving details of how this measure was discovered, and her own contributions, she explained that there had been an embarrassing lack of examples. Her work with Benedicks mentioned in the citation gave important examples. She continued:-\nThese are of course only the first examples. We have a long way to go before we understand the\nergodic theory\nof strange attractors.\nYoung then spoke about women in mathematics:-\nThere is no doubt that our situation has improved; life in academia for women is easier for my generation than the generation before. I feel that more institutional support is still needed for women who try to juggle career and family, and a conscious effort on our part is necessary if we are to rid ourselves of the cultural prejudices that have existed for so long.\nYoung has published several excellent surveys of her area and her own contributions to it. In\n1993\n, the same year that she received the Ruth Lyttle Satter Prize, Young lectured at the Real and complex dynamical systems meeting in Hillerod, Denmark. Her contribution\nErgodic theory of differentiable dynamical systems\nappeared in the resulting\n1995\npublication presents:-\nA comprehensive self-contained survey of the results on ergodic theory of differentiable dynamical systems achieved in the last two decades...\nMore recent surveys include her invited lecture to the International Congress of Mathematicians in\n1994\n. An article based on her lecture\nErgodic theory of attractors\nwas published in the Proceedings. It surveys:-\n... recent developments in the study of the ergodic properties of attractors of certain dissipative surface diffeomorphisms. The motivating prototype is the Henon family of plane diffeomorphisms ...\nYoung had been an invited plenary speaker at further meetings over the last few years including: the International Congress of Mathematical Physics\n(1997)\n; the\nAmerican Mathematical Society\nAnnual Meeting\n(1998)\n; and the\nSociety for Industrial and Applied Mathematics\nAnnual Meeting\n(1999)\n. At the first of these she lectured on the\nErgodic theory of chaotic dynamical systems\n.\nYoung gives the following list of her current research interests:\nmeasurements of dynamical complexity, including entropy,\nLyapunov\nexponents and fractal dimension;\nanalysis of strange attractors;\ncumulative effects of small random perturbations\n(\nor \"noise\"\n)\non the long term behaviour of dynamical systems;\ncorrelation decay and other probabilistic laws for chaotic systems.\nFinally we should mention two further prestigious awards which Young has received. She received a Faculty Award for Women in Science and Engineering from the National Science Foundation for\n1991\n-\n1996\n, and a Guggenheim Fellowship for\n1997\n-\n98\n.\nYoung, who is currently Henry & Lucy Moses Professor of Science at New York University's Courant Institute of Mathematical Sciences, was elected as a Fellow of the\nAmerican Academy of Arts and Sciences\nin\n2004\n. In the following year she was the\nAssociation for Women in Mathematics\n'\nNoether\nLecturer at the Joint Mathematics Meetings in Atlanta, Georgia. In\n2007\nthe Association for Women in Mathematics and the Society for Industrial and Applied Mathematics selected Young to give the\nSonia Kovalevsky\nLecture at the\n2007\nSIAM Conference on Applications of Dynamical Systems held at the end of May in Snowbird, Utah. The Press Release states:-\nThe\nKovalevsky\nLecture recognizes her fundamental contributions in the field of ergodic theory and dynamical systems. Her pioneering research has had a significant impact in the investigation of dynamical complexity, strange attractors and probabilistic laws of chaotic systems. Her interests include theory, applications and deep connections to mathematical physics and probability. She is an inspiration to the entire mathematics community, especially to the women's mathematics community.\nBarbara Keyfitz, Past President of the Association for Women in Mathematics, said that:-\n... with the choice of Lai-Sang Young to give the\nKovalevsky\nlecture within two years of her\nNoether\nlecture, two independent selection committees have recognized the importance of Young's work.\nCathy Kessel, President of the\nAssociation for Women in Mathematics\n, commented that:-\n... the award is especially appropriate - Young is a very distinguished mathematician and her research extends the field in which\nKovalevsky\ndid her most significant work.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}