{
  "nome_completo": "Lajos Dávid",
  "nome_curto": "Lajos Dávid",
  "ano_nascimento": "1881",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/David_Lajos/",
  "lugar_nascimento": "Kolozsvár, Hungary (now Cluj-Napoca, Romania)",
  "lugar_morte": "Leányfalu, near Budapest, Hungary",
  "biografia": "Lajos Dávid\n's father was Antal Pákéi Dávid, a business manager and landowner, and his mother was Anna Huszti Sárossy. The Dávid family came from Transylvania which is now part of Romania. Lajos Dávid himself was educated at Kolozsvár, attending first the elementary school of the Reformed College. He graduated in\n1889\n, and then studied at the Mathematics and Science Faculty of the University of Kolozsvár. He attended mathematics courses by Gyula Farkas, Lajos Schlesinger and later took a course by Frigyes Riesz who was only one year older than Dávid.\nHe undertook research at the university for his doctorate advised by\nLajos Schlesinger\nand submitted his thesis\nThe Gauss-type medium arithmetico-geometricum\nin\n1903\n. For this work he received his doctoral degree and, in addition, in\n1904\nhe was awarded a secondary school teaching certificate in mathematics and physics. Between\n1903\nand\n1904\nhe worked as a trainee teacher, then as a substitute at the National College in Kolozsvár. In\n1904\n-\n1905\nhe undertook his military service.\nBetween\n1905\nand\n1906\nDávid studied in Göttingen, attending courses by\nDavid Hilbert\nand\nFelix Klein\n, and then in Paris. Returning to Hungary, he first became an associate teacher at the Unitary College of Kolozsvár\n(1906\n-\n1907)\n, and was later appointed to be a teacher at the Reformed College of Székelyudvarhely\n(1908\n-\n1912)\n. He\nhabilitated\nat the University of Kolozsvár in\n1910\n, with his thesis\nAbout the Theory of Algebraic Numbers and Functions.\nTo give lectures at the university, he had to commute between Székelyudvarhely and Kolozsvár, thus he desired to become a teacher in a university town, which he only achieved somewhat later. In\n1911\nLajos Schlesinger\nleft Kolozsvár when he was appointed as a Professor at the University of Giessen in Germany.\nSchlesinger\ninvited Dávid to take part in writing commentaries on the works of\nGauss\nfor the Mathematics Seminars in Göttingen and Giessen. In\n1914\n, he filled a vacancy which had occurred for a substitute teacher at the Higher Vocational School of the\n8\nth District of Budapest, so he moved to the Hungarian capital.\nHe was known to be accurate, scrupulous and ambitious in his work. He possessed professional skills and was a devoted teacher. His work was highly efficient and he was held in high esteem both by his colleagues and his pupils. He gave several lectures at the sessions of the Society of Mathematics and Physics.\nIn\n1916\n, on the recommendation of\nLipót Fejér\nand Manó Beke\n(1862\n-\n1946)\n, the University of Budapest supported his habilitation as private professor in analysis. In\n1918\n, he was the first to give lectures at the university on the history of mathematics, focusing on the history of analysis. Between\n1919\nand\n1929\nhe worked as a professor of the so-called \"Paedagogium\", the Teacher Training College of state civil schools in Budapest. He became engaged in the study of different issues of education and dealt with educational reforms. It was during this time that he had his interest awakened in research into\nFarkas Bolyai\nand\nJános Bolyai\n.\nToday Dávid he is best known for his work as a devoted\nBolyai\nresearcher. His most significant book, entitled\nA két Bolyai élete és munkássága\nⓉ\n(\nThe life and work of the two Bolyais\n)\nwas published in\n1923\n. Based on this book, he had several articles about the two Bolyais, which he intended to be distributed abroad. As early as\n1924\n, Lajos Dávid pointed out that the work of\nJános Bolyai\ncontained the seeds of the theory of relativity. Besides, the writing of Lajos Dávid is an important source-book because of the accuracy of its data. A second edition of this book was published in\n1979\n.\nDávid was a dedicated professional in teacher training. From\n1925\non, he worked as a lecturer in mathematics at the University of Debrecen, where he became a public associate professor in\n1929\n, and a full professor in\n1933\n(\nuntil\n1940)\n. His focus again shifted to the study of arithmetic and geometric means, the history of mathematics, the\nBolyai\nresearch, and the popularization of mathematics.\nIn Debrecen, Hungary, he was entrusted with organizing a Mathematics Seminar at the Institute, launching an institute library, and training the next generation of researchers with academic degrees. The first research group in the history of mathematics in Hungary was established under his guidance. It is to his merit that the book series titled\nKözlemények a debreceni Egyetem Matematikai Szemináriumából\nⓉ\n(\nScientific Bulletin of the Mathematics Seminar of Debrecen University\n)\n(1927\n-\n1940)\n, containing\n15\ndoctoral theses, started to appear. Many of the topics concerned related to Dávid's projects, to the research of the Bolyais and to the\nGauss\n-type 'medium arithmetico-geometricum'.\nThere were only a few to assist him at the Mathematics Seminar, so Lajos Dávid himself held lectures on a very wide variety of topics: descriptive geometry, infinite series, infinitesimal calculus and geometry, analysis, the practical solution of equations, the theory of differential equations, surface theory, probability theory, and practical mathematics. To help effective learning, he wrote course books, e.g. Practical Differential Geometry I, and Plane Curves. In addition to this heavy teaching load, he also held lectures for medical students.\nHe was very well liked by his students. He delivered his entertaining lectures in a vivid and familiar style. He assigned significance to mathematical applications, both the mechanical and economic aspects. Also when there was no teaching at the university, he kept in touch with his students and accompanied them on trips, or received them at his home and replied to their letters during the summer vacations.\nIn addition, he dealt with the didactics of mathematics on an academic level, and he delivered lectures at the Teacher Training Institute of the University, as well. He was of the belief that \"a professor should not only be convinced in what he professes, but, at the same time, he should also be able to make his students be convinced of that too, that is, a professor should be a real teaching master.\"\nHe was a member of the teachers' commission of enquiry, and was also a government delegate on the occasion of secondary-school graduation exams. He wrote some essays on reforms concerning teaching in secondary schools, emphasizing the close affinity of people to what is concrete as a natural guiding principle in the process of forming secondary-school education.\nBetween\n1940\nand\n1944\n, he worked as a professor and director of the Institute of Mathematics at the University of Kolozsvár, Transylvania. During this time, he wrote his book entitled\nBolyai-geometria az Appendix alapján\nⓉ\n(\nBolyai Geometry on the Basis of the Appendix\n)\n, a good many copies of which were later pulped, and only a few copies have survived. In\n1944\n, he returned to Hungary, but after this he became neglected, did not get any respected position, nor the qualification consonant with his scientific reputation. He was not awarded the Degree of Doctor of Science. He worked at the Institute of Geophysics, then at the National Museum. In\n1950\nhe was forced into retirement. On the\n150\nth Anniversary of the birth of\nJános Bolyai\nhis books were not exhibited. He went on with studying his favourite subject, the\nBolyai\nresearch, with the help of his godson\nLászlo Kalmár\n, but at the Mathematics Congress in\n1960\nhe only participated as a member of the audience.\nHe published\n55\nbooks, and left behind\n10\nmore, unpublished. A list of his publications is given at\nTHIS LINK\n.\nA list of his doctoral students, together with the titles of their theses are given at\nTHIS LINK\n.\nLet us list here what are considered to be his six major works:\nTheorie des Gauss'schen verallgemeinerten und speziellen arithmetisch-geometrischen Mittels,\nMat. und Naturwiss. Ber. aus Ungarn\n25\n(1907)\n,\n152\n-\n171\n.\nAz algebrai iteráció elméletéhez,\nMat. és Termtud. Ért\n26\n(1908)\n,\n230\n-\n240\n.\nA két Bolyai élete és munkássága\n, Bp.\n(1923)\n, pp.\n202\n;\n2\nnd Enhanced Edition, Gondolat\n(1979)\n, pp.\n335\n.\nBolyai geometria az Appendix alapján\n(\nMinerva, Kolozsvár,\n1944)\n, pp.\n188\n; Reprint, Bolyai János Katonai Muszaki Foiskola, Bp.\n(1992)\n.\nDebreceni régi matematikusok,\nA debreceni Tisza István Tud. Társaság II. Oszt. Munkái\n2\n(1927)\n4\n.,\n35\n-\n54\n.\nGauss,\nKöMal\n3\n(1927)\n,\n133\n-\n148\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Statistics"
  ]
}