{
  "nome_completo": "Laurent Lafforgue",
  "nome_curto": "Laurent Lafforgue",
  "ano_nascimento": "1966",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lafforgue/",
  "lugar_nascimento": "Antony, Hauts-de-Seine, France",
  "lugar_morte": null,
  "biografia": "Laurent Lafforgue\nwas born in Antony, on the southern outskirts of Paris. He entered the primary school Jules Ferry in Antony in\n1972\n, moving to the Lycée Descartes in the same town in\n1977\n. In an interview\n[\n4\n]\nhe spoke of his own schooling:-\nI'm very fond of the school I attended since my earliest years. My grandparents began working when they were twelve, but they always respected school very much and passed on this respect to their children and grandchildren.\nHe received his Baccalauréat\n(\nwith distinction\n)\nin\n1984\n, and received the First Prize in mathematics in the Concours général. By this time he was already achieving international fame for he had won a silver medal at the International Mathematical Olympiad competition in\n1984\nand he won a second silver medal at the competition in\n1985\n. After spending the two years\n1984\n-\n86\nat the lycée Louis-le-Grand in Paris preparing for his university studies, he entered the École Normale Supérieure in Paris in\n1986\n. He was awarded his\nAgrégation de Mathématiques\nin\n1988\n. He then began research in\nalgebraic geometry\nand the theory of Arakelov under the direction of Christophe Soulé.\nLafforgue became\nchargé de recherche\nat the Centre National de la Recherche Scientifique\n(\nCNRS\n)\nin\n1990\nand worked in the Arithmetic and Algebraic Geometry team at the Université Paris-Sud at Orsay. During\n1991\n-\n92\nhe undertook military service at the École Spéciale Militaire De Saint-cyr, the French national military academy at Coëtquida. After this year he returned to his position at Université Paris-Sud at Orsay where he received his doctorate in\n1994\nfor his dissertation\nD-stukas de Drinfeld\nwritten with Gérard Laumon as his thesis advisor. For this exceptional piece of work he was awarded the Peccot Prize from the Collège de France and was invited to give the Cours Peccot. He continued to work at the Centre National de la Recherche Scientifique and in\n1998\nhe was invited to address the \"Groups and Lie algebras\" section at the International Congress of Mathematicians in Berlin. In the same year he was awarded the Bronze Medal of the CNRS.\nIn\n2000\nLafforgue was promoted to\ndirecteur de recherche\nof the CNRS working in the Mathematics Department of the Université Paris-Sud. Shortly after this he was named as Professor at the Institut des Hautes Études Scientifiques in Bures-sur-Yvette, France. In fact the year\n2000\nwas significant for Lafforgue in another way too, for on\n24\nMay, at the Paris Millennium Meeting at the Collège de France, he received the\n2000\nClay Research Award. At the meeting,\nAndrew Wiles\nannounced the award to Lafforgue and Lavinia Clay presented him with the Ferguson sculpture. In\n[\n9\n]\ndetails of Lafforgue's achievements and their background are given:-\nLaurent Lafforgue established the\nLanglands\nCorrespondences for a much wider class of cases than previously known. These correspondences connect arithmetic properties to analytic properties of some special group representations called automorphic representations. It was formulated by\nRobert Langlands\nat the end of the\n1960\n's. In rank\n1\n, this conjecture is nothing other than the now traditional \"class field theory\" of\nEmil Artin\n. In rank\n2\nand for number fields, the first great confirmations of this conjecture were the proof of the conjecture of\nRamanujan\nby\nPierre Deligne\nand the proof by\nLanglands\nhimself of the conjecture of\nArtin\nexcept for a case. At the beginning of the seventies,\nVladimir Drinfeld\nattacked the conjectures in a more general algebraic context. For that purpose, he built varieties similar to modular curves and showed certain cases of the conjecture of\nLanglands\nin rank\n2\n. Then, as these varieties did not make it possible to reach all desired representations,\nDrinfeld\nintroduced the \"chtoucas\", a step which enabled him to prove the conjecture of\nLanglands\nin rank\n2\n. This turned out to make the general case accessible, after formidable technical difficulties were surmounted. The crucial contribution by Laurent Lafforgue to solve this question is the construction of compactifications of certain varieties of modules. The proof, which is monumental, is the result of more than six years of concentrated efforts.\nLafforgue soon received further major prizes for his remarkable mathematical achievements. He received the\nJacques Herbrand\nPrize from the\nAcademy of Sciences\nin\n2001\nand then, in the following year, he received what is considered the greatest honour for any mathematician, namely a\nFields\nMedal. He received the Medal at the opening ceremonies of the International Congress of Mathematicians in Beijing, China on\n20\nAugust\n2002\n. Michael Rapoport writes\n[\n6\n]\n(\nor\n[\n5\n]\n)\n:-\nLaurent Lafforgue was awarded the\nFields Medal\nfor his proof of the\nLanglands\ncorrespondence for the general linear groups\nG\nL\nr\nGL_{r}\nG\nL\nr\n​\nover function fields of positive characteristic. His approach to this problem follows the basic strategy introduced twenty-five years ago by\nV Drinfeld\nin his proof for\nG\nL\n2\nGL_{2}\nG\nL\n2\n​\n. Already\nDrinfeld\n's proof is extremely difficult. Lafforgue's proof is a real tour de force, taking up as it does several hundred pages of highly condensed reasoning. By his achievement Lafforgue has proved himself a mathematician of remarkable strength and perseverance.\nAllyn Jackson writes\n[\n7\n]\n:-\nLaurent Lafforgue has made an enormous advance in the Langlands Program by proving the global\nLanglands\ncorrespondence for function fields. The\nLanglands\nProgram, formulated by\nRobert Langlands\nin the\n1960\ns, proposes a web of relationships connecting\nGalois\nrepresentations and automorphic forms. The influence of the\nLanglands\nProgram has grown over the years, with each new advance hailed as an important achievement. The roots of the\nLanglands\nprogram are found in one of the deepest results in number theory, the Law of Quadratic Reciprocity, which was first proved by\nCarl Friedrich Gauss\nin\n1801\n. This law allows one to describe, for any positive integer d, the primes p for which the congruence\nx\n2\n=\nd\nm\no\nd\np\nx^{2} = d mod p\nx\n2\n=\nd\nm\no\nd\np\nhas a solution. Despite many proofs of this law\n(\nGauss\nhimself produced six different proofs\n)\n, it remains one of the most mysterious facts in number theory. The search for generalizations of the Law of Quadratic Reciprocity stimulated a great deal of research in number theory in the nineteenth century. Landmark work by\nEmil Artin\nin the\n1920\ns produced the most general reciprocity law known up to that time. One of the original motivations behind the\nLanglands\nProgram was to provide a complete understanding of reciprocity laws.\nThe global\nLanglands\ncorrespondence for\nG\nL\nn\nGL_{n}\nG\nL\nn\n​\nproved by Lafforgue provides a complete understanding of reciprocity laws for function fields. Lafforgue established, for any given function field, a precise link between the representations of its\nGalois\ngroups and the automorphic forms associated with the field. He built on work of\n1990\nFields\nMedalist\nVladimir Drinfeld\n, who in the\n1970\ns proved the global\nLanglands\ncorrespondence for\nG\nL\n2\nGL_{2}\nG\nL\n2\n​\n.\nIn\n2003\nLafforgue became Chevalier de la Légion d'Honneur and was elected to the Paris\nAcadémie des Sciences\n. Also in\n2003\nhis major text\nChirurgie des grassmanniennes\n(\nSurgery on Grassmannians\n)\nwas published by the\nAmerican Mathematical Society\n. However, a new chapter in his life was about begin, namely his passionate involvement in the problem of education\n[\n4\n]\n:-\nMy specific interest in the topic of education began a few years ago when I signed a petition defending Greek and Latin as academic subjects, as they were in grave danger. Struck by this dramatic situation, denounced by just a handful of teachers, I began inquiring more into it, reading books by people of different ideological orientations, joined by their seriousness about the work, and by their passion for school and the future of young people. This reading shook me profoundly - Latin and Greek are just the tip of the iceberg! In France, even the teaching of the French language itself was at risk. The new French school no longer had anything to do with the one I had known only twenty-five years ago.\nOn\n15\nMay\n2004\n, Lafforgue gave the address\nA mathematician and the classics\nto a conference organised to support the teaching of Latin and Greek in secondary schools. From that time on he became highly involved in educational issues. On Tuesday,\n8\nNovember\n2005\n, the Haut Conseil de l'Education\n(\nHigh Committee for Education\n)\nwas set up, replacing several other educational bodies. Its remit included defining the contents of the knowledge and skills that all children in France will need to have acquired by the age of\n16\n.  It also has a remit to define the specifications for the University Institutes for Teachers. Jacques Chirac, President of the French Republic, nominated Laurent Lafforgue to the High Committee for Education which held its first meeting on Thursday,\n17\nNovember\n2005\n. The day after Lafforgue was asked to resign from the Committee because he had questioned the need to take advice from the so-called\n\"experts of the Ministry of National Education\"\n. In a letter to the President of the High Committee for Education, Lafforgue had asked\n[\n1\n]\n:-\nDoes\n[\nthe Committee\n]\nwish to \"entrust the same experts whose policies have led to the present disaster of our schools with the task of elaborating the future policies\", or will it have the salutary will to \"radically break the ties with all the present educrats\" and \"work\n[\n...\n]\non developing policy advice that the government may use to save our educational system from a complete and definite destruction?\"\nWe should end this biography by giving some details of Lafforgue's views on education. We encourage the reader to look at the article\n[\n11\n]\nin detail for it gives an excellent account of these views. We quote from the article a paragraph in which he identifies the problems with schools in France:-\nStudents, all the students, are the primary victims of the destruction of the school. This destruction has resulted from educational policies of all the governments of the last few decades. It is not the teachers who are responsible for it, for they are victims themselves: firstly in that they have been prevented from teaching correctly, by the publication of national curricula which are increasingly disorganized, incoherent and emptied of content; then because the knowledge gaps accumulated by their students over the course of years have made the conditions of teaching ever more difficult, and have exposed them to incidents of increasing incivility and violence on the part of adolescents who have never been taught either the elementary understandings, the habits of work, or the self-control which are indispensable to the progress of their studies; and finally because the younger generation of teachers has suffered from an already degraded educational program, so that their own understanding is less certain than that of their elders, and, with the exception of some well tempered characters, has been disoriented by the absurd training so prodigally distributed by the teachers colleges.\nFinally, quoting from the same article, let us see how Lafforgue believes mathematics should be taught in schools:-\nLet us take the example of the four operations: addition, subtraction, multiplication and division. Their teaching has been considerably retarded and neglected in recent decades, to where the majority of middle school children do not know the multiplication tables and many high school students are unable to add two fractions. These operations have been neglected because of the emergence of calculators, and the belief that an operation carried out by a machine can be the same thing as an operation carried out by a human spirit. It is the same thing as to result - supposing that one has calculated correctly and not made an error of fingering, and with the reservation that there are, just the same, many occasions where the calculator doesn't replace a mental calculation: I recently received a letter from a grandfather whose granddaughter had been fired after several hours as a salesgirl in a market because she was unable to make change. But above all, a calculator which one has programmed to perform certain operations knows only those operations for which it has been programmed. Whereas those same operations acquired and mastered by a student becomes nourishment for his spirit, empowers him, is digested by him, is made his own, enlarges and awakens his mathematical faculties and power. A familiarity with numbers, and similarly as to geometric objects, that permits the life that has been given him to enter, little by little, into the world of mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}