{
  "nome_completo": "Lee Aaron Segel",
  "nome_curto": "Lee Segel",
  "ano_nascimento": "1932",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Segel/",
  "lugar_nascimento": "Boston, Massachusetts, USA",
  "lugar_morte": "Rehovot, Israel",
  "biografia": "Lee Segel\n's parent were Louis Harry Segel\n(1900\n-\n1983)\nand Minna M Margolis\n(1900\n-\n2000)\n. Both Louis and Minna were born in the United States to Jewish parents who has emigrated from Lithuania to the United States at the end of the\n19\nth century. Louis Segel was a tailor, being a partner in the firm Oppenheim-Segel. He had intellectual interests with a fine art collection in his house at\n77\nKenilworth Street, Newton, Massachusetts. Minna was an art teacher.\nLee Segel attended Newton High School, graduating in\n1949\n, giving his address as\n77\nKenilworth Street, Newton, Massachusetts. He had many interests at school, being in the Ski team, the Boys' Chorus, the Glee Club and the Chemistry Club, of which he was the Vice-President. He took part in the school production of the Pirates of Penzance. His school record quotes his pet quotation:-\nA word to the wise is superfluous.\nAfter graduating from Newton High School he entered Harvard University where he majored in mathematics. He graduated in\n1953\nand his record at this time displayed his interests: Basketball, Swimming, Mathematics, Physics, Vocal, and Dramatics. Segel went from Harvard to the Massachusetts Institute of Technology where he originally thought he would study computer science but changed to applied mathematics for his graduate studies. He undertook research for his Ph.D. advised by Chia-Chiao Lin. Originally from China, Lin left China in\n1940\n, arriving in Canada where he obtained an M.Sc. from the University of Toronto before studying at the California Institute of Technology for his Ph.D. supervised by\nTheodore von Kármán\n. Segel was awarded a Ph.D. from the Massachusetts Institute of Technology in\n1959\nfor his thesis\nApplications of Conformal Mapping to Boundary Perturbation Problems\n.\nSegel married the lawyer Ruth Maureen Galinski in London, England, on\n30\nAugust\n1958\n. Ruth, born on\n6\nOctober\n1932\nin London, England, had flown from London to Boston on\n17\nApril\n1958\nby this time using the name Ruth Gale. After marrying in London the couple spent the first two years of their married life in that city before returning to the United States in\n1960\nwhen Segel was appointed to the Department of Applied Mathematics at Rensselaer Polytechnic Institute. This Institute, founded in Troy, New York, in\n1824\n, is a private research university which had as its founding aim \"application of science to the common purposes of life.\" The Segels lived in Troy, New York, at\n40\nB Ahern Avenue. They had four children, Joel\n(\nborn\n1961)\n, Susan\n(\nborn\n1962)\n, Daniel\n(\nborn\n1964)\nand Michael\n(\nborn\n1966)\n.\nThe first publications by Segel were\nApplication of conformal mapping to viscous flow between moving circular cylinders\n(1960)\n,\nA uniformly-valid asymptotic expansion of the solution to an unsteady boundary-layer problem\n(1960)\n, and\nApplication of conformal mapping to boundary perturbation problems for the membrane equation\n(1961)\n.\nSegel was on leave in the academic year\n1963\n-\n64\n, at the Massachusetts Institute of Technology, where he was partially supported by the National Science Foundation. In\n1966\nhe published the article\n[\n13\n]\n, namely\nThe Importance of Asymptotic Analysis in Applied Mathematics\n. We give a few paragraphs from this article to allow the reader to gain some feeling for Segel's attitude towards this topic at\nTHIS LINK\n.\nAt Rensselaer Polytechnic Institute, Segel took over teaching the course Foundations of Applied Mathematics which had been introduced by George H Handelman\n(1921\n-\n2008)\n. Handelman joined the Rensselaer Polytechnic Institute in\n1955\nand rose from professor of applied mathematics to chairman of the mathematics department and Eliza Ricketts professor. Segel's course ran through two semesters and he set out to write a book for the course. The book for the first semester course was\nMathematics applied to deterministic problems in the natural sciences\nwhich he wrote in collaboration with his former Ph.D. advisor C C Lin. The book also incorporated material on elasticity written by Handelman. It was first published in\n1974\n. The book for the second semester course was\nMathematics applied to continuum mechanics\nwritten solely by Segel but also incorporating material on elasticity by Handelman. It was published in\n1977\n. Segel writes in the Preface:-\nThe author was partially supported in\n1968\n-\n69\nby a Leave of Absence Grant from Rensselaer. Further support was received during\n1971\n-\n72\nfrom the National Science Foundation Grant GP\n33679\nX to Rensselaer and from a John Simon Guggenheim Foundation Fellowship. That year was spent as a visitor to the Department of Applied Mathematics, the Weizmann Institute of Science, Rehovot, Israel; the author joined this department in September\n1973\n, but he retains an association with the Rensselaer Polytechnic Institute. He is thus formally indebted to both institutions for support during years of on-and-off writing; the support was always generously given and the acknowledgement is correspondingly warm.\nFor more information about these two texts and other books by Segel, see\nTHIS LINK\n.\nAs we learnt from the above quote, Segel moved to Israel in September\n1973\nto take up an appointment at the Weizmann Institute of Science, Rehovot. At Weizmann he became the chairman of the Applied Mathematics Department, and later dean of the Faculty of Mathematical Sciences. He also became the chair of the Scientific Council. His move to the Weizmann Institute of Science was, at least in part, because his interests had moved in the late\n1960\ns towards applications of mathematics to biology and Weizmann was a world-leading Institute in experimental biology. The fact that this move was to Israel was a very important factor to him since he had deep roots in Judaism, as did his wife. We quote from\n[\n8\n]\nregarding Segel's move towards applying mathematics to biology:-\nBy the late\n1960\ns, realising how rich a treasure trove biology represented for mathematicians, Lee had begun to work seriously on problems in the field. He spent an important sabbatical at Cornell Medical School and the Sloan-Kettering Institute, where Sol Rubinow had created a superb unit in biomathematics, and where such mathematicians as Joe Keller and Hirsh Cohen were frequent visitors. Lee's two great early contributions, both with Evelyn Fox Keller, created frameworks for modelling bacterial chemotaxis, and for understanding related problems in the development of the cellular slime mould, a model system for studying development, multicellularity, and social biology. Lee quickly earned the respect of the leading experimentalists and theoreticians in these subjects, in particular John Bonner and Ted Cox at Princeton, and Howard Berg, then at Colorado. More than thirty years later, the Keller-Segel models remain the gold standards in these fields.\nThe two papers with Evelyn Fox Keller mentioned in the above quote are\nInitiation of slime mold aggregation viewed as an instability\n(1970)\nand\nModel for chemotaxis\n(1971)\nboth published in the\nJournal of Theoretical Biology\n. Hillen and Painter write about the model given in the second of these papers\n[\n5\n]\n:-\n... its success ... a consequence of its intuitive simplicity, analytical tractability and capacity to replicate key behaviour of chemotactic populations. One such property, the ability to display 'auto-aggregation,' has led to its prominence as a mechanism for self-organisation of biological systems. This phenomenon has been shown to lead to finite-time blow-up under certain formulations of the model, and a large body of work has been devoted to determining when blow-up occurs or whether globally existing solutions exist.\nIn\n1980\nthe book\nMathematical Models in Molecular and Cellular Biology\nwas published, edited by Segel. Stephen Childress writes\n[\n2\n]\n:-\nIn the spring of\n1978\na course on \"Mathematical models in biology\" was offered at the Weizmann Institute of Science, with support from the Institute as well as the European Molecular Biology association. L A Segel has performed a singular service to all interested scientists in the preparation of the present volume, which records the contributions of the twenty-one authors of the course notes. The result is, however, much more than a \"proceedings\"; careful editing and presumably some elaboration of the material have produced a valuable reference work with\n(\nexcluding one or two topics\n)\na remarkably balanced organisation and scope. The course was aimed at the experimental biologist with a background in basic calculus ...\nFor extracts from reviews of this book and of other books written by Segel, see\nTHIS LINK\n.\nFrom the time he arrived at the Weizmann Institute of Science, Segel taught a one semester course to first-year graduate students in the biological sciences about techniques of mathematical modelling. These lectures eventually became Segel's book\nModeling dynamic phenomena in molecular and cellular biology\npublished in\n1984\nwhich, he claims in the Preface, is designed for \"students of biology who have studied calculus for one year.\" Howard Berg states in the review\n[\n1\n]\nthat the book's:-\n... intent is cross-cultural: to impress on biologists the usefulness of mathematical modelling, chiefly in molecular and cellular biology, and to expose mathematicians to applications in biological dynamics. ... The strength of this book is that it provides examples of problems in a sufficiently broad range of biological scenarios, with enough mathematical rigour and depth that a biologist can judge for himself whether the effort required to acquire the technology, or to collaborate effectively with one who is more deeply versed, is likely to prove rewarding.\nTo understand something of Segel's character and achievements, let us quote from\n[\n8\n]\n:-\nHis collaborators were legion, and anyone who ever worked with him will remember mainly how much fun it was. Lee laced every interaction with humour, and no pun was beneath him; many were subtle enough to make their way past editors into his published papers. Lee had a tremendous sense of responsibility to family, students, and community. As editor of the 'Bulletin of Mathematical Biology', he transformed it from a marginal journal into one of the leading vehicles for new results. He was a central figure in the Gordon Research Conference in Theoretical Biology for decades, and played a key role in the development of the field. At Los Alamos National Laboratory, he was a summer consultant to the theoretical biology group from\n1984\nto\n1999\n, and he was named\nUlam\nVisiting Scholar for\n1992\n-\n93\n; he also became a fixture at the Santa Fe Institute. No single individual is more clearly identified with the face of theoretical and mathematical biology today. He was a dynamic and inspiring lecturer, and a brilliantly clear expositor. Although he was opposed to publishing \"every sneeze,\" his publication record is equally daunting and inspiring. His expository style, indeed, made each of his papers a joy to read.\nSegel died in\n2005\nand the publisher Springer, in conjunction with the Society for Mathematical Biology established prizes in his memory. The Society for Mathematical Biology gives the following information:-\nThe Lee Segel Prizes were established in memory of Lee Segel, who made great contributions to the 'Bulletin of Mathematical Biology' and the field of mathematical biology as a whole. The prizes honour outstanding contributions to the field of mathematical biology and will help to promote and advance important research findings in this scientific area. There is a Best Paper Prize\n(\n$\n5000)\n, as well as a Best Student Paper Prize\n(\n$\n3000)\n. Other prizes may be awarded as deemed appropriate by the Awards Committee, Editors-in-Chief of the Bulletin of Mathematical Biology, and the Society for Mathematical Biology. The Lee Segel Prizes are awarded every two years, starting in\n2008\n.\nSegel's final book\nA primer on mathematical models in biology\nwas published in\n2013\n, eight years after Segel's death. It was written by Leah Edelstein-Keshet, based on Segel's course at the Weizmann Institute and on the sequel to\nModeling Dynamic Phenomena in Molecular and Cellular Biology\nwhich Segel was working on at the time of his death. The publisher's description is as follows:-\nThis textbook introduces differential equations, biological applications, and simulations and emphasises molecular events\n(\nbiochemistry and enzyme kinetics\n)\n, excitable systems\n(\nneural signals\n)\n, and small protein and genetic circuits. A primer on mathematical models in biology will appeal to readers because it\n(\ni\n)\nrepresents the unique perspective developed by the popular and highly respected applied mathematician Lee Segel in a course he taught at the Weizmann Institute of Science;\n(\nii\n)\ncombines clear and useful mathematical methods with applications that illustrate the power of such tools; and\n(\niii\n)\nincludes many exercises in reasoning, modelling, and simulations. This book is intended for upper-level undergraduates in mathematics, graduate students in biology, and lower-level graduate students in mathematics who would like exposure to biological applications.\nLet us end this biography by quoting Alex Mogilner who was a student of one of Segel's students:-\nI met\n[\nLee Segel\n]\nin\n1994\n, in the middle of my Ph.D. studies in Canada, when I spent a few months in the Weizmann Institute ... Since then, I met quite a few famous scientists who inspired awe, but Lee was one of few who were not only breathtakingly smart and successful, but also unbelievably kind and unselfish. ... Three things impressed me most about Lee - the first one was the clarity of his science: unlike most of us, he never used mathematical complexity to disguise incomplete understanding, and always found the shortest, straightest, and by default the most beautiful way to solve the problem. The second one was his scientific taste, his ability to pick out interesting biological problems with inner mathematical beauty. And the third one was his love of life. I did not meet him as often as I would have liked to, but each time I remember fondly: from eating my first artichoke at his home in Rehovot to having a long walk in the Utah hills. He savoured everything - elegant scientific argument, success of his students, crisp mountain air, fresh orange juice, even being a janitor for difficult-for-Israel days, when all younger men were fighting.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}