{
  "nome_completo": "Leo Moser",
  "nome_curto": "Leo Moser",
  "ano_nascimento": "1921",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moser_Leo/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Edmonton, Alberta, Canada",
  "biografia": "Leo Moser\n's parents were Laura Feurstein and Robert Moser. Although he was born in Austria, his parents emigrated to Canada when he was a child. Sadly, however, he suffered from a serious heart condition which meant that his life was plagued by poor health. Leo attended primary school in Winnipeg, where his parents had set up home, and continued his secondary education there. His younger brother\nWilly Moser\nalso went on the become a mathematician and has his biography in this archive. Remaining in Winnipeg, Leo then entered the University of Manitoba to study mathematics. He graduated with a B.Sc. in\n1944\nand then moved to the University of Toronto where he studied for his Master's degree. He was awarded his M.A. in\n1945\n. Moser married Eva on\n10\nSeptember\n1946\n; they had four children, Barbara, Melanie, David, and Sheryl.\nFor his doctoral studies, Moser went to the University of North Carolina at Chapel Hill. There he undertook research, advised by\nAlfred Brauer\n. R H Hudson and T L Markham, in Alfred T Brauer as a mathematician and teacher, indicate the quality of Moser's Ph.D. supervisor:-\n... beginning in\n1942\n,\nAlfred Brauer\ntaught with a dedication that honours the teaching profession at the University of North Carolina, Chapel Hill. His extra-help sessions and incredibly long hours working with students in his office helped make him a truly beloved teacher.\nAlfred Brauer\n's interests were in number theory and so this was the area in which Moser began his research. Even before he had submitted his dissertation, Moser had several papers published. These include\nOn the sum of digits of powers\n(1947)\n,\nSome equations involving Euler's totient\n(1949)\n,\nLinked rods and continued fractions\n(1949)\n,\nOn the danger of induction\n(1949)\nand\nA theorem on the distribution of primes\n(1949)\n. This last mentioned paper appeared in the\nAmerican Mathematical Monthly\nand in its two pages Moser gives a short elementary proof that for any positive integer\nr\nr\nr\nthere is a prime\np\np\np\nsatisfying\n3\n×\n2\n2\nr\n−\n1\n<\np\n<\n3\n×\n2\n2\nr\n.\n3 \\times  2^{2r-1}  < p < 3 \\times  2^{2r}.\n3\n×\n2\n2\nr\n−\n1\n<\np\n<\n3\n×\n2\n2\nr\n.\nHe also indicates how the proof can be modified to give a proof of\nBertrand\n's theorem. Further papers such as\nA prime representing function\n(1950)\n,\nPalindromic primes\n(1950)\n, and\nOn the distribution of digits in powers\n(1950)\nwere all published before he submitted his thesis\nOn Sets of Integers which Contain No Three in Arithmetical Progression and on Sets of Distances Determined by Finite Point Sets\n.\nMoser was appointed at Texas Technical College, but shortly after this he was offered a position in the University of Alberta, and he moved back to Canada to take up the job in\n1951\n. Sharma, in\n[\n3\n]\n, describes visiting Moser in Edmonton. He was:-\n... a simple, courteous and soft spoken person full of anecdotes, humour and problems. Although the department was small and had no separate building to itself, Leo Moser was the centre of activity discussing problems with any one who cared to listen. He had a photographic memory and was an excellent chess player. I learned that he could play chess against teams of\n20\nor\n30\nstudents from different schools at the same time and would win against all of them. In the faculty lounge in the department, he would discuss problems or tell anecdotes to his students. Anyone who came in and wanted to listen was welcome. ...  he had started a book of problems in which visitors and anyone who has a problem could put his problem in black and while. ... Professor Moser was very hospitable and the evening parties at his home were always a treat.\nMoser loved the problem based type of mathematical questions. It was number theory problems which first attracted his attention but later he also fell in love with combinatorial problems and problems in graph theory. He published over\n100\npapers, many of them in journals devoted to mathematics teaching. Here are a small selection of his papers\n(\nsome co-authored with Joachim Lambek, some with Max Wyman, some single author papers\n)\n:\nOn the different distances determined by n points\n(1952)\n,\nNote on a combinatorial formula of Mendelsohn\n(1953)\n,\nOn the distribution of Pythagorean triangles\n(1955)\n,\nAn asymptotic formula for the Bell numbers\n(1955)\n, and\nRational analogues of the logarithm function\n(1956)\n. Later papers include\nAn extremal problem in matrix theory\n(1966)\n,\nSome packing and covering theorems\n(1967)\n(\nboth with J W Moon\n)\n,\nOn packing of squares and cubes\n(1968)\n(\nwith A Meir\n)\nand\nAn extremal problem in graph theory\n(1970)\n(\nwith\nPaul Erdős\n)\n.\nWyman writes in\n[\n5\n]\n:-\nLeo Moser had mathematical talents that were unique among the many mathematicians I have known personally or through their published work. Foremost among these talents were intuition, simplicity, ingenuity, and clarity. Above all he demonstrated an amazing ability to analyse the most complex of mathematical problems, and by intuitive heuristic arguments outline ways in which they might be attacked ... He was a warm person with a well developed sense of humour. He had an infinite stock of amusing stories, and a huge storehouse of simple puzzles of both a mathematical and a non-mathematical nature. To spend time with him was doubly pleasant in that one always had the sense of learning and, at the same time, of being quietly entertained.\nWe mention above the heart problems which afflicted Moser all his life. However, few around him were aware of his poor health. In\n1967\ndoctors gave him two months to live unless he underwent a major heart operation. The operation was partially successful in that it gave him three more years of life, but his death at\n48\nyears of age robbed his family and the world of mathematics of someone who had so much more to give.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}