{
  "nome_completo": "Leonard Gillman",
  "nome_curto": "Leonard Gillman",
  "ano_nascimento": "1917",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gillman/",
  "lugar_nascimento": "Cleveland, Ohio, USA",
  "lugar_morte": "Austin, Texas, USA",
  "biografia": "Leonard Gillman\n's parents were Joseph Moses Gillman\n(1888\n-\n1968)\nand Etta Cohen\n(1891\n-\n1980)\n. Joseph Gillman had come to the United States at the age of eighteen, having spent the years of his life up to that time in Ukraine. He spoke only Yiddish at that time but learnt English at Hiram College near Cleveland before studying philosophy at Western Reserve University in Cleveland. Leonard's mother Etta was born in Cleveland to parents who were immigrants from Poland. Etta also attended Western Reserve University. Leonard had a younger brother, Robert David Gillman, known as Bobby, who was born in Cleveland in\n1918\n. In\n1922\n, when Leonard was five, the family moved to Pittsburgh where his father Joseph taught at the university while working on his Ph.D. thesis in economics \"Rent Levels in Pittsburgh\". In the autumn of\n1923\nLeonard, extremely talented musically, began taking piano lessons. He also spent a year at a Kindergarten school before moving to a very small private school run by a group of parents including his own parents.\nIn\n1926\n, when Leonard was nine, the family moved to New York where he spent two years in a state school. He also began studying piano under the outstanding pianist Louis Kantorovsky who was awarded a Frederick Steinway scholarship in\n1927\n. Louis\n[\n1\n]\n:-\n... and his wife were much younger than my parents but the two couples became best friends. We were living in Queens, and the Kantorovskys lived in the Bronx; every Sunday afternoon my parents would take their two boys on the long subway ride to Manhattan, then transfer to the train to the Bronx, where Bobby and I had our piano lessons, after which the Kantorovskys served dinner.\nLeonard's parents both took degrees from Columbia University, his mother Etta being awarded a Master's Degree in psychology while his father Joseph was awarded a Ph.D. in economics. After two years at the state school, Leonard entered The Walden School, a small progressive school on West\n68\nth\nStreet in Manhattan. He began his studies at High School in\n1929\n. He was in the same class as Reba Marcus, whom he married nine years later, and\nEllis Kolchin\nwho, like Gillman, became a mathematics professor. Gillman had always loved mathematics in addition to his passion for music. He had enjoyed spotting patterns with numbers from a very young age but, even at high school, there was little in the way of mathematics in the curriculum other than elementary algebra and geometry. Gillman and\nKolchin\n, who were close friends, approached their teacher in their final year at High School\n(1932\n-\n33)\nand told him they wanted to study more mathematics than the school was offering. He gave them a copy of\nRaymond Brink\n's\nPlane Trigonometry\n(1928)\n. This book \"aims to gain the interest of the students through its practical values, believing this interest will carry over into a more analytical and critical study of the background of the subject.\" Their teacher\n[\n1\n]\n:-\n... suggested we work through all the problems on identities. That was first-class advice, and working the identities was fun. Of course we also had to learn how to interpolate in trigonometric and logarithmic tables, then slog through the requisite number of problems.\n(\nNot so much fun.\n)\nStill wanting to learn more mathematics, the two young students took a day off school to visit the New York Public Library where they read articles on\nmagic squares\n. Back in school they experimented with constructing magic squares.\nAfter graduating from High School in\n1933\n, Gillman sat the scholarship examination for the Graduate School of the Juilliard School of Music in New York. He won a scholarship as a piano student and began his studies there. The training at this music school was all geared to producing concert performers. In the spring of\n1934\n, in addition to his studies at the Juilliard School, Gillman began to take courses at Columbia University. He took courses in French and Analytic Geometry to start with but, in his second year took Differential Calculus and another French course. Next he took courses on Integral Calculus, Matrix Theory, and Differential Equations. It was not only mathematics that Gillman studied at Columbia, for he also took more French courses, as well as courses on Psychology, German, English Composition and History. In May\n1938\nhe was awarded his Diploma in piano from the Juilliard Graduate School, and also in May was the soloist in the Liszt A major concerto at a performance of the Juilliard Orchestra. Later that summer he took the same role in a production conducted by Edgar Schenkman, the younger brother of the group theorist Eugene Schenkman.\nIn December\n1938\nGillman married Reba Marcus who had graduated from Bennington College where she had majored in music. At first they made their home with Gillman's parents but soon were able to move into an apartment of their own near Columbia University. He gave some piano lessons and enrolled at Columbia for some advanced music courses. He thought about graduating from Columbia majoring in music but, following a suggestion made by his mother in September\n1940\n, decided instead to take the necessary courses to major in mathematics. Outstanding results led, in January\n1941\n, to his professors suggesting that he might like to continue to a Ph.D. after taking his first degree. A couple of months later he was offered an assistantship and began teaching a course on trigonometry. In\n1942\nhe graduated with a B.S. in mathematics. He was advised to take graduate statistics courses since\nHarold Hotelling\ncontrolled the fellowship money. He took courses by\nHotelling\n,\nAbraham Wald\nand Henry Mann, and he was awarded a Carnegie Corporation fellowship. Leonard\nand Reba Gillman's first child, Jonathan, was born in the autumn of\n1942\n. In the spring of\n1943\nHotelling\nand\nWald\nrecommended him for position with the Tufts College Navy Project. After being interviewed, he was offered the position and was happy to accept.\nAt Tufts he worked on military applications, in particular\n[\n1\n]\n:-\n... an analysis of ordinary and generalized pursuit curves and of countermeasures that a target ship can take to defend itself from an incoming homing torpedo.\nThis work was eventually written up as a report entitled\nMathematical Analysis of Ordinary and Deviated Pursuit Paths\n. He had already completed all the necessary course work at Columbia for a Master's Degree and he wrote up the theoretical part of his work on pursuit curves and submitted that to Columbia as his thesis. He was awarded a Master's Degree from Columbia University in\n1945\n. In the summer of that year his daughter Miki was born and, with the ending of World War II shortly after that, the project at Tufts College came to an end. He was offered a job by the Operations Research Group in Washington and began working there in December\n1945\n. This work was in addition to working on his Ph.D. dissertation, having a family life with his wife and two children, and trying to keep up his piano playing. In\n[\n1\n]\nhe gave an example of the type of problem that he worked on for the Operations Research Group:-\n... find the best strategy for a target submarine to follow when faced with traversing a hostile channel. ... Enemy searchers are lined along the two shores; from each point, the probability of detecting the submarine if on the surface is assumed known\n(\ne.g., it is low where the channel is wide, high when narrow\n)\n; a submerged submarine is assumed undetectable, but the submarine's batteries can maintain it under water for only a limited total distance\n(\nalso assumed known\n)\n. What is the distribution of points at which the sub should choose to be under water?\nHe began applying game theory to solve problems of this type. Eventually he realised that there was no way that he was going to be able to write a Ph.D. thesis given all the other pressures on him. He was offered a sabbatical year in which he could undertake research but the condition was that he spend it at the Massachusetts Institute of Technology. Although at first he was reluctant to spend the year at MIT, he eventually decided to take this opportunity. He also had to decide on the topic of his thesis and his friends advised him to write a thesis on game theory since he had already spent a lot of time working on this topic. However, he wanted to write a thesis on set theory and he gave himself a self-imposed limit of six months to get into the set theory research and, if things were not going well after this time, then to change to game theory.\nHe began to get some results on set theory and wrote to\nAlfred Tarski\n, who was at Berkeley, asking him if these results were new. Tarski replied quickly giving him ideas how he could extend the results he had already proved.\nTarski\n[\n1\n]\n:-\n... suggested additional reading, which led me to some additional results. Still, he lived up to his reputation by detailing just who had sent which result to whom at which time. My quip was that I was in residence at MIT, on leave from a job in Washington, writing a dissertation for Columbia, with a thesis advisor in Berkeley.\nHe wrote to Columbia telling them that he was writing a thesis on set theory and received a reply that nobody at Columbia was an expert on set theory but\nRay Lorch\nhad agreed to satisfy the university regulations by going down on the form as his official thesis advisor. Returning to Washington at the end of his sabbatical year, he did not feel like returning to the work he was doing with the Operations Research Group and handed in his resignation a couple of weeks later. In November\n1950\nhe submitted his paper\nOn intervals of ordered sets\nfor publication. He revised it in the following October and it appeared in print in\n1952\n. The paper contains the following acknowledgement:-\nSubmitted in partial fulfilment of the requirements for the degree of Doctor of Philosophy, in the Faculty of Pure Science, Columbia University. This paper was written under the supervision of Professor\nE R Lorch\n; thanks are also due Dr R L Taylor for a number of suggestions. Special thanks are due Professor\nAlfred Tarski\n(\nUniversity of California, Berkeley\n)\nfor his encouraging interest and generous advice.\nIn\n1953\nhe published, in collaboration with John M Danskin, a paper on game theory entitled\nA game over function space\n. Harold W Kuhn writes:-\nThis paper is concerned with the solution of an example of a zero-sum two-person game with essentially bounded measurable functions on\n(0\n, ∞\n)\nas pure strategies. The existence of a saddle-point is established by the fixed-point statement of Glicksberg and the unique optimal strategies are characterized.\nIn the autumn of\n1952\nhe took up a position as an instructor at Purdue University and submitted his Ph.D. thesis to Columbia around the same time. Early in\n1953\nhe defended his thesis and was awarded a Ph.D. by Columbia. Over the next couple of years he published:\nConcerning rings of continuous functions\n(1954)\nwith Melvin Henriksen;\nOn a theorem of Gelfand and Kolmogoroff concerning maximal ideals in rings of continuous functions\n(1954)\nwith Melvin Henriksen and Meyer Jerison; and\nAn isomorphism theorem for real-closed fields\n(1955)\nwith Melvin Henriksen and\nPaul Erdős\n. Gillman recalled\n[\n2\n]\n:-\nIn the late\n1980\ns, I encountered\nErdős\nat an\nMathematical Association of America\nSection meeting, at dinner, eating his soup. An enthusiastic host asked, \"\nErdős\n, do you remember Gillman?\" Continuing to eat his soup, without looking up,\nErdős\nreplied in a somewhat bored voice, \"Yes, we wrote a joint paper in\n1955\n.\"\nHe remained at Purdue until\n1960\nbeing promoted to Assistant Professor in\n1953\nand to Associate Professor in\n1956\n. While he was there he continued his musical career performing chamber music, playing with the Lafayette Symphony Orchestra, and playing with the student orchestra. On one occasion he was asked by the President's wife\n[\n2\n]\n:-\n\"How do you resolve your music and your mathematics?\" I looked her straight in the eye and replied, \"Sometimes I respond to a piece of music by thinking 'That's as exquisite as a beautiful theorem.' And sometimes when I contemplate a particularly artistic proof, I say to myself, 'That's as elegant as a Bach fugue.\" In a mellifluous voice and with a melting smile, she replied, \"You love your work, don't you?\"\nHe spent\n1958\n-\n59\nat the Institute for Advanced Study at Princeton, supported by a Guggenheim fellowship. While there he completed writing his book\nRings of continuous functions\ncoauthored with Meyer Jerison. The book was published in\n1960\nand reviewed by\nJean Dieudonné\nwho writes:-\nModern \"abstract\" mathematical techniques\n(\nalgebra, topology, order structures\n)\nwere created as new ways to attack the problems of classical mathematics, and have amply demonstrated their fertility with spectacular success, especially in recent years. But these theories have also become for some mathematicians \"ends in themselves\" and have been developed without any concern for application to other issues, and this has naturally led to a host of new problems, often very difficult, and some of which have not been resolved at the cost of long and ingenious efforts. The work of Gillman and Jerison relates to this trend: the single point of contact they may have with other parts of analysis is the theory of normed algebras and\nGelfand\ntransformations; but these issues are absolutely not mentioned by the authors ... This book will certainly be a reference work for a long time, containing virtually all currently known results on these issues, including numerous examples and counterexamples. The style is excellent in its clarity and conciseness. ... It is obviously true that the authors do not write for mathematicians in search of tools and eager to reach the goal as quickly as possible, but for real \"aficionados\" of the theory, willing to devote all their time and to whom three different proofs of the same theorem will triple the delight they find there.\nGillman spent a second year\n(1959\n-\n60)\nat the Institute for Advanced Study at Princeton supported by an NSF Senior Post-Doctoral Fellowship. Then he went to the University of Rochester where he was appointed as Professor and department chair. In\n1969\nhe moved to the University of Texas at Austin where he was Professor and departmental chairman\n1969\n-\n73\n. He remained at Austin until he retired in\n1987\nwhen he was made Professor Emeritus. During his years in Austin, he worked in several different capacities for the\nMathematical Association of America\n. He was treasurer of the Association from\n1973\nto\n1986\nand on the board of governors from\n1973\nto\n1995\n. He was President of the Association in\n1987\n-\n1988\n. The\nMathematical Association of America\npublished Gillman's booklet\nYou'll Need Math\n(1967)\n, aimed at high school students, and his booklet\nWriting mathematics well: a manual for authors\n(1987)\n. This gave a good outline of the fundamentals, covering the basics of organisation, presentation and preparation of manuscripts.\nDuring his career, Gillman received several honours for his contributions. We particularly mention the two\nLester R Ford\nAwards he received from the\nMathematical Association of America\n. The first in\n1994\nwas for his article\nAn Axiomatic Approach to the Integral\n(1993)\nwhile the second was for his paper\nTwo Classical Surprises Concerning the Axiom of Choice and the Continuum Hypothesis\n(2003)\n. He also received the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service to Mathematics from the\nMathematical Association of America\nin\n1999\n. He continued his musical career throughout his life, performing with the Gilbert & Sullivan Society of Austin and well as being the pianist at four national AMS-MAA meetings, two with Louis Rowen, cello -\n1976\n(\nBach, Brahms, Beethoven, Chopin\n)\nand\n1980\n(\nBach, Franck, Beethoven, Rachmaninoff, Chopin\n)\n- and two with William Browder, flute -\n1989\n(\nBach, Poulenc, Schubert, Gluck\n)\nand\n1992\n(\nBach, Schubert, Franck, Mozart\n)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}