{
  "nome_completo": "Li Zhi",
  "nome_curto": "Li Zhi",
  "ano_nascimento": "1192",
  "ano_morte": "1279",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Li_Zhi/",
  "lugar_nascimento": "Ta-hsing (now Beijing), China",
  "lugar_morte": "Hopeh province, China",
  "biografia": "Li Zhi\nis also known as\nLi Chih\nor\nLi Ye, Li Yeh.\nUsually Chinese names have a number of different spellings, each trying in a different way to match the pronunciation of the original. However this is not the reason that Li Zhi is also known as Li Yeh. Rather it is because he was known as a young man as Li Zhi, but since this was the same name as the third T'ang emperor, he later changed his name to Li Yeh.\nLi Zhi's father was named Li Yu and he was the secretary to a Jurchen officer by the name of Hu Shahu. The Jurchen empire, formed by the Jurchen tribes of Manchuria, covered much of Inner Asia and all of North China. The capital of the empire became Ta-hsing\n(\nsometimes written Daxing and now called Peking\n)\nin\n1192\nand it was in this capital city that Li Yu's son Li Zhi was born. Between\n1207\nand\n1215\nthe armies of the Mongol leader Genghis Khan pushed into North China and in\n1215\nthey sacked the capital Ta-hsing\n(\nnow Peking\n)\nof the Jurchen empire. Genghis Khan then withdrew but left a general with an army which continued to weaken the Jurchens. Li Yu's home was in Luan-ch'eng, in the Hopeh province which included Ta-hsing, and he sent his family back to his home but not Li Zhi who went alone to the Yuan-shih district of Hopeh province for his education.\nLi Zhi took the civil service examinations in Lo-yang, a city in the northwestern Honan province in\n1230\n. This, however, was a troubled time with many wars. After the death of Genghis Khan, one of his sons Ogodei became the Great Khan in\n1229\n. He expanded the Mongol empire sending armies to complete the defeat of the Jurchens. After successfully completing his examinations, Li Zhi was appointed registrar of the district of Kaoling but the advancing Mongol armies prevented him taking up the appointment. Instead he became governor of the Jun prefecture of Honan province. This, however, was an appointment which he could not hold for long since the Mongols continued their advance, massacring the Jurchens. Li Zhi only escaped being massacred himself thanks to the intervention of one of the Jurchen officials who had gone over to the side of the Mongols. By\n1234\nthe Mongols had completed the destruction of the Jurchen empire and turned their attention to the south.\nFor over\n15\nyears Li Zhi lived in poverty as a hermit in the Shansi province. This is a mountainous region with Hopeh province to the east and Honan province to the south and southeast. It was here, in\n1248\n, that he completed his most famous work the\nCe yuan hai jing\n(\nSea mirror of circle measurements\n)\n. We look at the contents of this remarkable treatise below. Three years after completing his masterpiece, Li Zhi's financial position improved somewhat and he returned to Hopeh province where he made is home near Feng Lung mountain in the Yuan municipality. He lived here until\n1257\nwhen Kublai, a grandson of the Mongol leader Genghis Khan who was leading further Mongol advances, sent for Li Zhi to ask his advice on governing the state and on civil service examinations. Knowing that Li Zhi was a great expert on scientific matters, Kublai also asked him to explain the reasons for earthquakes. Li Zhi continued to work on mathematics and completed another important text\nYi gu yan duan\n(\nNew steps in computation\n)\nin\n1259\n.\nOn\n5\nMay\n1260\nKublai was elected Khan at his residence in Shang-tu. In\n1261\nKublai Khan offered Li Zhi a government position but by now he was\n69\nyears old and\n[\n1\n]\n:-\n... politely declined with the plea of ill health and old age.\nKublai Khan made another attempt to get Li Zhi's services in\n1264\nwhen he set up his Academy. This time Li Zhi felt that he had no option but to join the Academy, but after a short while he resigned, again saying that he was too ill and too old for the task. He returned to his home near Feng Lung mountain but he did not spend his final years quietly since many pupils came to study under him.\nWe are lucky to have any works by Li Zhi other than the\nSea mirror of circle measurements\nfor he told his son to burn all his books except the\nSea mirror of circle measurements\non his death since this was the only work of which he was proud. It is not recorded whether his son carried out his father's instructions but certainly more texts, others being non-mathematical, have survived. We now look at some of the very remarkable contributions which Li Zhi made to mathematics.\nFirst let us look briefly at the \"tian yuan\" or \"coefficient array method\" or \"method of the celestial unknown\". This was a notation for an equation and, although the work of Li Zhi is the earliest source of the method, it must have been invented before his time. Li Zhi placed the coefficients in an array as in the following example.\nWe have given the example using numerals which are natural with the language that we write this archive but, of course, Li Zhi would have used Chinese characters. Here the numbers which in our notation correspond to the coefficients of the equation are placed above each other so that the coefficient of\nx\nx\nx\nis placed above the constant, the coefficient of\nx\n2\nx^{2}\nx\n2\nis placed above the coefficient of\nx\nx\nx\netc. Notice that negatives were allowed and so were decimal fractions. Perhaps even more surprisingly, negative powers of\nx\nx\nx\nwere placed in descending order below the constant term. Martzloff writes:-\nUnlike most western algebraists, Li Zhi never explains how to solve equations, but only how to construct them. But he does not limit his reflections to equations of degree two or three; for him, the fact that polynomial equations of arbitrarily high degree are involved is of little importance. Moreover, he never explains what he understands by an equation, an unknown, a negative number, etc., but only describes the manipulations which should be carried out in specific problems, without worrying about arranging his text in terms of definitions, rules and theorems. In other words, like many other algebraists, Chinese or not, he demonstrates algebra by using it ...\nTo solve the above equation Li Zhi would bring the leading coefficient to -\n1\nand then give the solution; in this case\n20\n. The type of problem which worried mathematicians in Islamic countries, and in Europe, concerning the solution of cubic, quartic, and higher order equations did not seem to arise in China. Li Zhi seems happy with equations of any degree and, although methods to solve equations do not appear explicitly, one has to assume that he used methods similar to those\nRuffini\nand\nHorner\ndiscovered over\n600\nyears later.\nBy any standards the\nSea mirror of circle measurements\nis a most remarkable work. It begins with a preface, then the following geometrical figure is given.\nIn the diagram\nO\nO\nO\nis the centre of the circle inscribed in the square\nE\nD\nC\nF\nEDCF\nE\nD\nC\nF\n.\nA\nB\nAB\nA\nB\nis the hypotenuse of the triangle\nA\nC\nB\nACB\nA\nC\nB\nwhich meets the square at\nG\nG\nG\nand\nH\nH\nH\n. The figure represents a circular town and follows the Chinese convention of having north at the bottom, south at the top, east on the left, and west on the right.\nThis is the only figure in the book and every one of the\n170\nproblems which make up Chapters\n2\nto\n12\nconcern this figure. We should emphasise that it is not a geometry book which is why relating each problem to a single figure is possible. Chapter\n1\ncontains three sections, the first giving the names of the constituents, the second section lists all the values of the lengths of the segments, so in essence contains all the answers to the problems, while the third section comprises of\n692\nformulae for areas of triangles and lengths of segments. As one sees this is nothing like any mathematics book of today!\nHere are some sample problems taken from\n[\n1\n]\n.\nProblem\n2\n.\n2\n: Two persons A and B start from the west gate. B walks a distance of\n256\npu eastwards. Then A walks a distance of\n480\npu south before he can see B. Find the diameter of the town.\nProblem\n3\n.\n4\n: Person A leaves the west gate and walks south for\n480\npu. B leaves the east gate and walks straight ahead a distance of\n16\npu, when he just sees A. Find the diameter of the town.\nIf we examine Li Zhi's solution closely we see a remarkable depth of understanding of equations. The problem leads to a quartic equation with a factor\nx\n+\n16\nx + 16\nx\n+\n1\n6\n. Knowing that the solution cannot be a negative number\n(\nx\n=\n−\n16\nx = -16\nx\n=\n−\n1\n6\n)\n, Li Zhi works with the cubic factor and solves that to find the solution.\nTry some of these problems, they are fun. Here is another, namely Problem\n11\n.\n18\n.\n135\npu directly out of the south gate is a tree. If one walks\n15\npu out of the north gate and then turns east for a distance of\n208\npu, the tree comes into sight. Find the diameter of the town\n.\nLi Zhi goes through the detailed, and quite hard, argument which leads to the quartic equation\n−\n4\nx\n4\n−\n600\nx\n3\n−\n22500\nx\n2\n+\n11681280\nx\n+\n788486400\n=\n0\n-4x^{4} - 600x^{3} - 22500x^{2} + 11681280x + 788486400 = 0\n−\n4\nx\n4\n−\n6\n0\n0\nx\n3\n−\n2\n2\n5\n0\n0\nx\n2\n+\n1\n1\n6\n8\n1\n2\n8\n0\nx\n+\n7\n8\n8\n4\n8\n6\n4\n0\n0\n=\n0\nwhich he solves without comment to get\n120\npu.\nLi Zhi's\nNew steps in computation\nalthough written much later, is a more elementary work. It is thought by many historians to have been written because people found understanding the\nSea mirror of circle measurements\nwas beyond them. The\nNew steps in computation\nis based on an earlier book which it is said was written by Chaing Chou of P'ing-yang\n(\nalthough nothing else is known of the author, nor is there any knowledge of the date of this earlier work\n)\n. Li Zhi's book contains\n64\nproblems, of which he says that\n21\nare from the earlier text. The central theme is the construction and formulation of quadratic equations. Some of these equations are solved by the \"coefficient array method\" described above, but some are formulated using the tiao duan or \"method of sections\". This older geometric style method of solving equations was used by Chinese mathematicians before Li Zhi and so the\nNew steps in computation\ngives historians a unique opportunity to see the new coefficient array method beside the older method of sections. A fascinating comparison of the methods is described in\n[\n7\n]\n.\nLet us finish this biography by giving the first problem of\nNew steps in computation\n.\nA square farm has a circular pond in the centre. The land area is\n13\nmou and\n7\n1\n2\n7\\large\\frac{1}{2}\\normalsize\n7\n2\n1\n​\ntenths of a mou. The pond is\n20\npu from the edge. Find the length of the side of the farm and the diameter of the pond.\nFirst note that the land area is\n13\n.\n75\nmou and so\n(\nsince\n1\nmou is\n240\nsquare pu\n)\nthe land area is\n3300\nsquare pu. Next we need to know that Li Zhi takes =\n3\nin this problem.\nArea of square is\n(\nx\n+\n40\n)\n2\n(x + 40)^{2}\n(\nx\n+\n4\n0\n)\n2\n. Area of pond\n0.75\nx\n2\n0.75x^{2}\n0\n.\n7\n5\nx\n2\n.\nLand area\n(\nx\n+\n40\n)\n2\n−\n0.75\nx\n2\n=\n0.25\nx\n2\n+\n80\nx\n+\n1600\n(x + 40)^{2} - 0.75x^{2} = 0.25x^{2} + 80x + 1600\n(\nx\n+\n4\n0\n)\n2\n−\n0\n.\n7\n5\nx\n2\n=\n0\n.\n2\n5\nx\n2\n+\n8\n0\nx\n+\n1\n6\n0\n0\n.\nBut land area is\n3300\nso\n−\n0.25\nx\n2\n−\n80\nx\n+\n1700\n=\n0\n-0.25x^{2} - 80x + 1700 = 0\n−\n0\n.\n2\n5\nx\n2\n−\n8\n0\nx\n+\n1\n7\n0\n0\n=\n0\nThis is the\nquadratic equation\nwe wrote in Li Zhi's coefficient array method above. He gives the solution\n20\npu which is the diameter of the pond. The side of the square farm is then\n60\npu.\nOne final comment on Li Zhi's use of π =\n3\nin this problem. He does discuss using the values π =\n3\n,\nπ\n=\n22\n7\n\\pi = \\large\\frac{22}{7}\\normalsize\nπ\n=\n7\n2\n2\n​\nand π =\n3\n.\n14\nin his work. When he takes\nπ\n=\n3\n\\pi = 3\nπ\n=\n3\nit is not because he is obtaining the best approximate answer that he can, rather it is the method of solving the problem which is important and he is better able to illustrate this with \"nice\" numbers. That dictates his choice of\nπ\n=\n3\n\\pi = 3\nπ\n=\n3\nin this problem.",
  "math_areas": [
    "Algebra",
    "Calculus",
    "Geometry"
  ]
}