{
  "nome_completo": "Linards Eduardovich Reiziņš",
  "nome_curto": "Linards Reiziņš",
  "ano_nascimento": "1924",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reizins/",
  "lugar_nascimento": "Riga, Latvia",
  "lugar_morte": "Riga, Latvia",
  "biografia": "Linards Reiziņš\nfamily, including his father Eduard Reiziņš, were teachers. He attended elementary school in Riga and from there he Second Gymnasium of Riga but World War II began before these were completed.\nLatvia had been dominated by Russia from the end of the\n18\nth\ncentury until World War I. During\n1917\nthis domination ended and, after a brief period of German invasion, the country became independent in a proclamation made on\n18\nNovember\n1918\n. It was into this independent Latvia that Reiziņš was born and brought up, but that independence ended while he was still at high school. The German-Soviet Nonaggression Pact was signed in August\n1939\nand Latvia's fate was out of its own hands. On\n17\nJune\n1940\nthe Red Army invaded Latvia and only three days later a new government of Soviet supporters was announced. They voted on\n21\nJuly for Latvia to become a part of the USSR and on\n5\nAugust this became official. The Soviet occupation saw around\n35\n,\n000\nLatvians deported to Russia within a year. During this extremely difficult period Reiziņš continued his studies at the\nGymnasium\nin Riga. However, the German army invaded Latvia in July\n1941\n.\nReiziņš had been attending a sport camp at Burtnieki Lake in the north of the country when the German armies entered Riga. The roads to the capital were blocked so Reiziņš, together with other young men from the Second Gymnasium who had been at the camp, went first to Valmiera about\n40\nkm south of Burtnieki, then they decided to head north towards Estonia. Crossing the border they continued to head north until they reached Paide which is over half way to Tallin from the Latvian-Estonian border. In Paide they were caught by the German armies continuing to advance rapidly across Estonia. The group of young men scattered in their attempt to avoid being detained by the Germans, but Reiziņš was taken prisoner and returned to Riga which was now under German control.\nIn the Spring of\n1942\nthe Germans released Reiziņš and allowed him to complete the final high school examinations which he had been unable to take previously. However he desperately wanted to avoid being drafted into the German army so he looked for the right sort of job. He worked in the countryside in the summer, trained to be a physical education teacher and had a job with a telephone company, but, despite this, near the end of the war he was forced into hiding to avoid being drafted.\nIn\n1944\nthe Soviet army marched into Latvia and a renewed period of Soviet domination began. Reiziņš was now able to enter the University of Latvia in Riga where he studied mathematics. He was highly successful in his mathematical studies and also took a full part in university life, including sport which he greatly enjoyed. He graduated in\n1948\nwith distinction and became a member of the Department of Mathematical Analysis at the University while he undertook research on differential equations under Arvids Lusis.\nIf Reiziņš had fared badly under the German occupation of Latvia, he did not fare much better under the Soviet domination, for in\n1949\nhe lost his position at the University. The regime aimed to transform the country into a typical Soviet one, and many native Latvians were deported and Russians brought in to help achieve this. Reiziņš was forced to take a job as a secondary school teacher. For ten years he was employed at Riga Secondary School No\n7\nwhere he taught mathematics and became the assistant headmaster. However, he continued to undertake research in mathematics and in\n1951\nhis first paper\nThe behaviour of the integral curves of a system of three differential equations in the neighbourhood of a singular point\nwas published by the\nLatvian Academy of Sciences\n. An English translation was published by the\nAmerican Mathematical Society\nin\n1955\n.\nIn\n1958\nReiziņš was able to take up the lectureship in mathematics at the University of Latvia which he had been dismissed from in\n1948\n. In the following year he defended his thesis\nThe behaviour of trajectories in the neighbourhood of a stationary point in the three-dimensional space\nat Tartu State University. In this\n[\n1\n]\n:-\n... thesis he studied the qualitative behaviour of homogeneous differential equations and obtained results that were highly regarded by specialists.\nReiziņš was promoted to associate professor at the University of Latvia in\n1969\nand ten years later to full professor. He also worked at the\nLatvian Academy of Sciences\n, being appointed as a junior research fellow at the Astronomy Department in\n1957\n. He was promoted to Scientific Secretary in the following year, then years later to Senior Research Fellow. In\n1963\nhe became Head of the Department of Mathematics at the Institute of Physics of the\nLatvian Academy of Sciences\n. The Academy had no Institute of Mathematics and Reiziņš campaigned for years for the establishment of such an Institute.\nOf the many other important contributions made by Reiziņš we should mention in particular his work on\nPfaff\n's equations and his contributions to the history of mathematics. In particular he edited the\nComplete Works\nof\nPiers Bohl\nwhich was published in\n1974\n. Other important historical papers include\nMathematics in University of Latvia\n1919\n-\n1969\n(1975\n, joint with E Riekstins\n)\nand\nFrom the History of the General Theory of Ordinary Differential Equations\n(1977)\n.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}