{
  "nome_completo": "Louis Joel Mordell",
  "nome_curto": "Louis Mordell",
  "ano_nascimento": "1888",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mordell/",
  "lugar_nascimento": "Philadelphia, Pennsylvania, USA",
  "lugar_morte": "Cambridge, England",
  "biografia": "Louis Mordell\n's father was Phineas Mordell, a Hebrew scholar, and his mother was Annie Feller. Both Phineas and Annie were Jewish and had been born in Lithuania. Phineas had emigrated to Philadelphia in the United States in\n1881\nand there he had worked very hard, having jobs such as a nightwatchman during the night and as a teacher during the day, while he earned the necessary money to bring his sisters and Annie, his wife to be, to the United States. Phineas and Annie had four sons and four daughters; their son Louis being their third child.\nLouis became fascinated by mathematics while at grammar school. However he was essentially self-taught in the subject, buying second-hand mathematics books from a bookstore in Philadelphia for five or ten cents when he was about\n13\nyears old. These books presented many examples taken from the Cambridge Tripos examinations and Louis soon came to look on Cambridge University in England as the place of highest mathematical learning. It became his ambition to study mathematics at Cambridge.\nWhen we wrote that Louis was \"essentially self-taught\" in mathematics we certainly did not wish to imply that he did not receive a good schooling, just that this schooling did little to introduce him to anything beyond elementary mathematics. He entered primary school at the age of\n6\nwhere he studied until he entered grammar school at the age of\n12\n. Then, at age\n14\n, he entered the Central High School in Philadelphia but he was already at an advanced level in mathematics even before he began to study at this school which was, in fact, the oldest high school in the United States outside New England.\nThe mathematics course at the Central High School should have taken four years to complete but Mordell took only two since his teachers quickly recognised his remarkable talent. It was not only the teachers at the High School who recognised his fascination with mathematics, however, for\nCassels\nnotes in\n[\n3\n]\nthat Mordell was given the nickname \"X, Y, Z\" by his fellow pupils.\nCertainly Mordell would have not learnt enough mathematics at the Central High School to allow him to compete with the best students at Cambridge, but he was ambitious enough to want to do exactly this. The second-hand texts came to his aid, however, and he mastered\nHorner\n's edition of\nEuler\n's algebra as well as a number of American algebra books. Rather remarkably, Mordell's future research interests were determined by these books, and his love of indeterminate equations came from this period.\nIn December\n1906\nMordell travelled to England in order to take the Cambridge University Scholarship examinations. As he later wrote\n(\nsee for example\n[\n12\n]\n)\n:-\nI conceived what I can only describe as a thoroughly mad and crazy idea of going to Cambridge and trying for a scholarship ... I had no idea of the necessary standards, I was self-taught mathematically and had never participated in a competitive examination. ...\n[\nIt was an undertaking\n]\nmost arduous and hazardous, and justified only by its success.\nMordell had to earn the money for his passage to England, and this he did, with some help from his parents, mainly by tutoring his fellow pupils for seven hours a day to earn enough to pay for his passage. Had he failed to win a scholarship to Cambridge he would have had to find work in England to earn enough to pay for his passage back to the United States. Mordell's gamble paid off handsomely, however, for he was placed first in the Cambridge Scholarship Examination and entered St John's College. He could only afford a one word telegram back to his father after the result was announced; it read simply \"Hurrah\".\nAmong the fellow students in his year at Cambridge were a number of outstanding mathematicians including\nWilliam Berwick\n,\nP J Daniell\n, and\nE H Neville\n. His Director of Studies was\nHenry Baker\nwhile his coach was\nT J I'A Bromwich\n. Mordell later wrote that he had found\nBaker\nunsympathetic and he felt that he would have done better with\nG H Hardy\nat Trinity. Mordell graduated as Third\nWrangler\nin the Mathematical Tripos\n(\nranked third in the list of First Class students\n)\nand this may at least partly be explained by the fact that his coach\nBromwich\ndid not have the success of R A Herman who coached both the First and Second Wranglers. On the other hand we should note that in many years the Second or Third Wrangler went on to greater mathematical achievements than the First Wrangler. Mordell blamed himself, however, for his third place, writing:-\nI blotted my copy-book and was only Third Wrangler. I think I could have done better.\nThere was no doctoral degree at Cambridge at this time, unlike the German universities, but Mordell remained at Cambridge to undertake research in\nnumber theory\n. For his Smith's Prize essay Mordell studied solutions of\ny\n2\n=\nx\n3\n+\nk\ny^{2} = x^{3} + k\ny\n2\n=\nx\n3\n+\nk\n, an equation which had been considered by\nFermat\n.\nThue\nhad already proved a result which, combined with Mordell's work showed that this equation had only finitely many solutions but Mordell only learned about\nThue\n's work at a later date. At the time he wrote the essay Mordell believed that for some\nk\nk\nk\nthere may be infinitely many solutions. However he solved the equation for many values of\nk\nk\nk\n, giving complete solutions for some values. Mordell was awarded the second Smith's Prize with his essay, and he went on to publish a long paper on this equation, now sometimes called Mordell's equation, in the\nProceedings of the London Mathematical Society\n.\nMordell submitted his subsequent work on indeterminate equations of the third and fourth degree when he became a candidate for a Fellowship at St John's College, but he was not successful. His paper on this topic was rejected for publication by the\nLondon Mathematical Society\nbut accepted by the\nQuarterly Journal\n. Mordell was bitterly disappointed at the way his paper had been received. He wrote at the time on an offprint of the paper:-\nThis paper was originally sent for publication to the L.M.S. in\n1913\n. It was rejected ... Indeterminate equations have never been very popular in England\n(\nexcept perhaps in the\n17\nth\nand\n18\nth\ncenturies\n)\n; though they have been the subject of many papers by most of the greatest mathematicians in the world: and hosts of lesser ones ...\nSuch results as\n[\nthose in the paper\n]\n... marks the greatest advance in the theory of indeterminate equations of the\n3\nrd\nand\n4\nth\ndegrees since the time of\nFermat\n; and it is all the more remarkable that it can be proved by quite elementary methods. ... We trust that the author may be pardoned for speaking thus of his results. But the history of this paper has shown him that in his estimation, it has not been properly appreciated by English mathematicians.\nIn\n1913\nMordell was offered a post at Birkbeck College, London, and one in Nova Scotia. He accepted the appointment as a lecturer at Birkbeck College, which was particularly involved with students who studied part-time, despite it having the poorer salary. He told his father that England offered him greater potential to develop as a mathematician than did Nova Scotia.\nWorld War I broke out in the following year and, in\n1916\n, Mordell undertook war work on statistics with the Ministry of Munitions. In the same year he married Mabel Elizabeth Cambridge, the daughter of a farmer. He continued working for the Ministry of Munitions after the war ended in\n1918\nand it was only in the following year that Mordell was able to return to his academic post at Birkbeck College. Although his life was disrupted by the war he still made remarkable mathematical advances during this time. His work on modular functions and their applications to number theory led to his famous proof in\n1917\nof\nRamanujan\n's conjecture on the tau-function. This work, later rediscovered and extended by\nHecke\n, is now fundamental in the theory of what is today called the\nHecke\noperator.\nBy\n1920\nMordell:-\n... decided that a change of scene would be welcome...\nand he achieved this when moved to Manchester to an appointment in the Manchester College of Technology where he lectured from\n1920\nto\n1922\n. During this time he discovered the result for which he is best known, namely the finite basis theorem, which proved a conjecture of\nPoincaré\n. This theorem, concerning the finite generation of the group of rational points on an elliptic curve, is beautifully surveyed in\n[\n5\n]\n. In Mordell's paper in which his finite basis theorem appeared he conjectured that there are only finitely many rational points on any curve of genus greater than one. This became known as the Mordell conjecture and it is discussed in detail in\n[\n7\n]\n. In\n1983\nFaltings\nproved the Mordell conjecture to be true.\nIn\n1922\nMordell went to Manchester University as a Reader. He was appointed to the Fielden Chair of Pure Mathematics in the following year and remained at Manchester University until he succeeded\nHardy\nat Cambridge in\n1945\n.\nTogether with\nDavenport\nand\nMahler\n, Mordell initiated great advances in the geometry of numbers while he held the Chair of Pure Mathematics at Manchester. Other important work from this period was on the estimation of trigonometric and character sums, a problem which\nDavenport\nhad proposed to him. He also extended his earlier work on cubic curves when he made detailed studies of cubic surfaces and hypersurfaces.\nMordell was elected a Fellow of the\nRoyal Society\nin\n1924\n, although at this stage he was still an American citizen; he became a British subject in\n1929\n. He received the\nSylvester\nMedal of the\nRoyal Society\nin\n1949\n:-\n... for his distinguished researches in pure mathematics, especially for his discoveries in the theory of numbers.\nHe was elected President of the\nLondon Mathematical Society\nin\n1943\n, holding the post until\n1945\n. He had already won the\nDe Morgan\nMedal of the Society in\n1941\nand had received its Senior Berwick Prize in\n1946\n.\nAfter he returned to Cambridge in\n1945\n, Mordell held the Sadleirian Chair and a fellowship at his old College of St John's where he had failed to be elected to a fellowship over thirty years before. He emphasised the fact that he was returning to Cambridge where he began his career by taking the equation\ny\n2\n=\nx\n3\n+\nk\ny^{2} = x^{3} + k\ny\n2\n=\nx\n3\n+\nk\nas the topic for his inaugural lecture to the Sadleirian Chair. At Cambridge he quickly built a large active group of research students around him.\nIn\n1953\nMordell retired from the Sadleirian Chair but he most certainly did not retire from mathematics; almost half of Mordell's\n270\npublications appeared after his retirement. Nor did retirement mean that he lived a quiet life at his home in Cambridge. On the contrary he delighted in accepting appointments as Visiting Professor\n(\nin places such as Toronto, Ghana, Nigeria, Mount Allison, Colorado, Notre Dame and Arizona\n)\n, delighted in adding yet another university to the list of places at which he had been invited to speak\n(\nwith a final total of around\n190)\n, and delighted in sharing his enjoyment of mathematics with as many young people as he could.\nDavenport\nwrote\n[\n6\n]\n:-\nThere can be few who have done so much in recent years to spread a love of mathematics in the world at large by their personal influence, and it is safe to say that Mordell's zest for his subject, and his love for learning in general, will have served as an inspiration to many young people, especially those in places that are remote from important scientific centres.\nBy\n1971\n, although by now well into his eighties, Mordell was still travelling enthusiastically. He attended a number theory conference in Moscow in September of that year, went on an Asian tour following the conference, then received an invitation from\nLinnik\nto lecture in Leningrad before returning home. Only a few months later he was taken ill while in his home in Cambridge and died a few days later.\nAs well as the honours from the\nRoyal Society\nand the\nLondon Mathematical Society\nwhich we mentioned above, Mordell also received honorary degrees from several universities\n(\nGlasgow, Mount Allison and Waterloo\n)\nand was elected a member of the Academies of Oslo, Uppsala and Bologna.\nRankin\n, at a memorial meeting of the\nLondon Mathematical Society\nin Mordell's honour, recalled Mordell's hobbies:-\n... Mordell was an enthusiastic mountaineer and swimmer and I knew him in both capacities. His favourite footgear for mountain walking was gymshoes. I remember Mordell joining Dennis Babbage and myself on an excursion to the top of Fairfield in the Lake District in\n1949\n. Babbage and I had a very brief dip of a few seconds in the icy water of Grisedale Tarn, which is nearly\n1800\nfeet above sea level, but Louis spent nearly ten minutes splashing about in the water and gave no sign of finding it at all cold.\nHe knew the mountains of North Wales, the Lake District and Scotland well and had climbed them in his younger days together with colleagues ...\nOne reason for his incredible physical toughness, whether shown in climbing, swimming or dancing, may have been his great capacity for sleep. It was no use him taking a run in a car to admire the local scenery; he just fell asleep and didn't see anything, except in the brief intervals when the car stopped, when he might open his eyes to identify some landmark known to him.\nDavenport\nin\n[\n6\n]\nsums up Mordell's character:-\nAmong his leading qualities are a simplicity of outlook, and an absolute honesty of thought and purpose, which have made it easy for him to give advice and guidance to others without impinging on their freedom or dominating them in any way. He is very much an individualist himself\n(\nonly one of his papers is a joint paper\n)\n, and as such he has an innate respect for the individuality of others, which shows itself in an intense appreciation of the achievements of others - whether they are students, colleagues, or strangers to him.\nThe fact that he was an individualist did not stop him showing great mathematical generosity as is pointed out in\n[\n2\n]\n:-\nNo one could have been more generous than he was in the appreciation of the work of his younger colleagues, or indeed of complete strangers; and this generosity reflected his single-minded devotion to the advancement of knowledge.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}