{
  "nome_completo": "Louis Nirenberg",
  "nome_curto": "Louis Nirenberg",
  "ano_nascimento": "1925",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nirenberg/",
  "lugar_nascimento": "Hamilton, Ontario, Canada",
  "lugar_morte": "Manhattan, New York, USA",
  "biografia": "Louis Nirenberg\n's father was a teacher of Hebrew. Louis went to a Hebrew school but he did not want to learn Hebrew. His father tried to teach him but, meeting resistance, thought that a friend might have more success giving him private lessons. This friend loved mathematical puzzles and so most of the lessons were spent solving puzzles rather than learning Hebrew. Louis attended Baron Byng High School in Montreal where he had excellent teachers. At this stage, primarily because of an outstanding physics teacher, he thought he would like to become a physicist. After graduating from the school, he entered McGill University where he majored in both mathematics and physics. He graduated from McGill with a B.S. in\n1945\n.\nAfter he graduated Nirenberg thought that he would carry on to graduate studies in theoretical physics. However, after graduating he took a summer job at the National Research Council of Canada in Montreal. At that time their research was on the atomic bomb project and one of the scientists there was Ernst Courant,\nRichard Courant\n's eldest son. Ernst Courant had married a girl from Montreal who Nirenberg knew, so he asked her if, when she next visited him, she could ask\nRichard Courant\nfor advice on the best place to study theoretical physics. The advice came back that Nirenberg should first do a Master's Degree in mathematics at New York University, and then go on to study physics. Nirenberg went for an interview with\nCourant\nand\nFriedrichs\nin New York and they offered him an assistantship.\nAfter the award of a Master's Degree by New York University in\n1947\n, Nirenberg remained there working for his doctorate. His official supervisor was Jim Stoker but he was greatly influenced by\nKurt Friedrichs\n. He was awarded a Ph.D. in\n1949\nfor his thesis\nThe Determination of a Closed Convex Surface Having Given Line Elements\n. In this he examined a question first asked, and partially solved, by\nHermann Weyl\naround\n1916\n:\nGiven a Riemannian metric on the unit sphere, with positive\nGauss\ncurvature, can you embed this\n2\n-sphere isometrically into\n3\n-space as a convex surface?\nHe used ideas due to Charles Morrey in giving a positive answer to this question. He published the results of his thesis in\n1953\nin the paper\nThe\nWeyl\nand\nMinkowski\nproblems in differential geometry in the large\n. Also in\n1953\n, the first year in which his publications appear, he published three further papers:\nA strong maximum principle for parabolic equations\n;\nA maximum principle for a class of hyperbolic equations and applications to equations of mixed elliptic-hyperbolic type\n; and\nOn nonlinear elliptic partial differential equations and\nHölder\ncontinuity\n.\nAfter completing his doctorate in\n1949\n, Nirenberg was appointed as a Research Assistant at New York University, becoming one of the early members of the Institute of Mathematical Sciences and Mechanics\n(\nit was renamed the\nCourant\nInstitute in\n1964)\n. After being promoted from Research Assistant to Research Associate, he was made an Assistant Professor in\n1951\n. He spent\n1951\n-\n52\nin Europe, visiting Zürich and Göttingen. In Zürich he attended a lecture course by\nHeinz Hopf\non geometry, a course by\nBartel van der Waerden\non Riemann surface theory, and lectures by\nRolf Nevanlinna\nand\nWolfgang Pauli\n. He returned to New York and was promoted to Associate Professor before becoming a full professor at the\nCourant\nInstitute in\n1957\n. He was a Sloan Fellow during\n1958\n-\n60\n, and a Guggenheim Fellow in\n1966\n-\n67\nand again in\n1975\n-\n76\n.\nWe give an overview of Nirenberg's mathematical contributions by quoting from the citation for the Steele Prize for Lifetime Achievement which he received from the\nAmerican Mathematical Society\nin\n1994\n[\n1\n]\n:-\nNirenberg is a master of the art and science of obtaining and applying a priori estimates in all fields of analysis. A minor such gem is the useful set of Garliardo-Nirenberg inequalities. A high point is his joint research with\n[\nShmuel\n]\nAgmon and\n[\nAvron\n]\nDouglis on a priori estimates for general linear elliptic systems, one of the most widely quoted results in analysis. Another is his fundamental paper with\nFritz John\non functions of bounded mean oscillation which was crucial for the later work of\n[\nCharles\n]\nFefferman\non this function space. Nirenberg has been the centre of many major developments. His theorem with his student, Newlander, on almost complex structures has become a classic. In a paper building on earlier estimates of\n[\nAlberto\n]\nCalderón\nand\n[\nAntoni\n]\nZygmund\n, he and\n[\nJoseph\n]\nKohn introduced the notion of a pseudo-differential operator which helped to generate an enormous amount of later work. His research with\n[\nFrançois\n]\nTrèves was an important contribution to the solvability of general linear PDEs. Some other highlights are his research on the regularity of free boundary problems with\n[\nDavid\n]\nKinderlehrer and\n[\nJoel\n]\nSpuck, existence of smooth solutions of equations of\nMonge\n-\nAmpère\ntype with\n[\nLuis\n]\nCaffarelli\nand Spuck, and singular sets for the\nNavier\n-\nStokes\nequations with\nCaffarelli\nand\n[\nRobert\n]\nKohn. His study of symmetric solutions of non-linear elliptic equations using moving plane methods with\n[\nBasilis\n]\nGidas and\n[\nWei Ming\n]\nNi and later with\n[\nHenri\n]\nBerestycki, is an ingenious application of the maximum principle.\nInequalities, mentioned near the beginning of this quote, have a special part in Nirenberg's life. He is quoted as saying\n[\n5\n]\n:-\nFriedrichs\nwas a great lover of inequalities and that affected me very much. The point of view was that the inequalities are more interesting than the equalities.\nAgain he said\n[\n4\n]\n:-\nI love inequalities. So if somebody shows me a new inequality, I say: \"Oh, that's beautiful, let me think about it,\" and I may have some ideas connected to it.\nThe many publications by Nirenberg\n(\nMathSciNet lists\n185)\ninclude only one book. This is\nTopics in non-linear functional analysis\n(1974)\nwhich is a record by Ralph A Artino of a lecture course given by Nirenberg at the\nCourant\nInstitute in\n1973\n-\n74\n[\n2\n]\n:-\nThe lecture course was aimed at students with a good grounding in linear operators and some familiarity with\ndifferential geometry\n, but limited knowledge of topology. The first two chapters are devoted to topological degree approaches, first in finite-dimensional spaces and then in\nBanach\nspace. The next chapter on bifurcation theory is followed by one co-written by J Ize, which introduces further topological methods such as cobordism and cohomotopy. Chapter five is devoted to a brief foray into the theory of monotone operators.\nJerrold Marsden begins a review of the book as follows:-\nFor students and researchers in nonlinear analysis this volume of lecture notes is the most useful introduction to the subject currently available. It is short, concise and to the point, and the proofs are unusually elegant, always with a geometric flavour and the best available. Much of the flavour of the notes centres on the use of degree theory. The introduction of the notion of degree and the development of its basic properties in the span of some fifty pages is a triumph in itself. This is used in Chapters III and IV in the discussion of bifurcation theory\n(\nthe highlight being a complete proof of Rabinowitz' global bifurcation theorem\n)\nand the solution of nonlinear partial differential equations\n(\nthe highlight being the global theorem of Landesman and Lazer\n)\n.\nA revised reprint of this book on nonlinear problems was published in\n2001\n. We should note Nirenberg's special love of nonlinear problems and give two quotes from him on this topic. Here is the first\n[\n5\n]\n:-\nMost results for nonlinear problems are still obtained via linear ones, i.e. despite the fact that the problems are nonlinear not because of it.\nThe second quote related to an author's results he was describing\n[\n5\n]\n:-\nThe nonlinear character of the equations is used in an essential way, indeed he obtains results because of the nonlinearity not despite it.\nNirenberg has been awarded many prizes and given many honours in a distinguished career.  He received the\nBôcher\nPrize from the\nAmerican Mathematical Society\nin\n1959\n:-\n... for his work in partial differential equations.\nHe was a plenary speaker at the International Congress of Mathematicians held in Stockholm in August\n1962\n, giving the lecture\nSome Aspects of Linear and Nonlinear Partial Differential Equations\n. In this lecture he gave a survey of some recent developments in existence and regularity theory for nonlinear boundary value problems, especially elliptic problems. He was also a plenary speaker at the British Mathematical Colloquium in Aberdeen, Scotland, in\n1983\nwhen he gave the lecture\nComments on non-linear problems\n.\nNirenberg has served the\nAmerican Mathematical Society\nin several roles. He was a member of the Council during\n1963\n-\n65\n, gave the\nAmerican Mathematical Society\nColloquium Lectures in\n1974\n, and was Vice-President of the Society in\n1976\n-\n77\n. The Crafoord Prize was awarded to Nirenberg at a ceremony at the\nRoyal Swedish Academy of Sciences\non Wednesday,\n29\nSeptember\n1982\n. He shared the Prize of\n350000\nSwedish crowns with\nVladimir Igorevich Arnold\nfor their achievements in the field of non-linear differential equations. They were the first mathematicians to receive the Crafoord Prize. The Press Release contains the following:-\nNewton\n's ideas were used to describe many different systems in physics and in geometry, which may depend on several variables simultaneously. The equations are then called partial differential equations and again the most interesting ones are non-linear. Nirenberg has treated a great number of problems of this nature. As an example from geometry one can mention the problem to find a surface with given curvature and from physics studies of the equations for viscose fluids and concerning existence of free streamlines. Nirenberg's work ranges over a variety of problems and has been of basic importance for the development of the field.\nHe received the Jeffery-Williams Prize of the\nCanadian Mathematical Society\nin\n1987\n. We have already mentioned above the Steele Prize for Lifetime Achievement which he received from the\nAmerican Mathematical Society\nin\n1994\n. Most recently, he received the National Medal of Science on\n18\nOctober\n1995\n. At the time of this most prestigious award, David W McLaughlin, the director of the\nCourant\nInstitute, said\n[\n3\n]\n:-\nNirenberg's influence is not limited to the many original and fundamental contributions he has made to the subject. He has not only played a major role in the development of mathematical analysis worldwide but has had significant influence on the development of young mathematicians, as indicated by his direction of over forty Ph.D. students. As a past director of\nCourant\n, he has demonstrated leadership and vision for the mathematical sciences community. The clarity of his writing, his lectures, and numerous expository articles continue to inspire generations of mathematicians.\nIn the article\n[\n3\n]\ntwo of Nirenberg's collaborators,\nLuis Caffarelli\nand Joseph Kohn, describe his mathematical contributions.\nCaffarelli\nwrites\n[\n3\n]\n:-\nThe work of Louis Nirenberg has enormously influenced all areas of mathematics linked one way or another with partial differential equations: real and complex analysis, calculus of variations, differential geometry, continuum and fluid mechanics.\nCaffarelli\nmentions Nirenberg's areas of interest in partial differential equations: Regularity and solvability of elliptic equations of order\n2\nn\n; the\nMinkowski\nproblem and fully nonlinear equations; the theory of higher regularity for free boundary problems; and symmetry properties of solutions to invariant equations.\nJoseph Kohn describes Nirenberg's contributions to complex analysis. He begins with this overview of Nirenberg's contributions\n[\n3\n]\n:-\nLouis Nirenberg is recognized throughout the world for his many important research contributions to mathematics, his marvellous lectures, and his lucid expository writing. His range of interest is very broad: differential equations, harmonic analysis, differential geometry,\nfunctional analysis\n, complex analysis, etc. ... Nirenberg's career has been an inspiration; his numerous students, collaborators, and colleagues have learned a great deal from him. Aside from mathematics, Nirenberg has taught all of us the enjoyment of travel, movies, and gastronomy. An appreciation of Nirenberg also must include his ever-present sense of humour. His humour is irrepressible, so that on occasion it makes its way to the printed page.\nNirenberg has been elected to the\nNational Academy of Sciences\n, the American Philosophical Society, the\nAmerican Academy of Arts and Sciences\n, the\nAccademia dei Lincei\n, the French\nAcadémie des Sciences\n, the Accademia Mediterranea della Scienze, the Istituto Lombardo, the Accademia Scienze e Lettere, and the\nUkrainian Academy of Sciences\n. He has received honorary degree from McGill University\n(1986)\n, the University of Pisa\n(1990)\n, and Université de Paris IX Paris-Dauphine\n(1990)\n.\nFinally we mention that a conference dedicated to Louis Nirenberg was held in Trento, Italy in September\n1990\nto mark his\n65\nth\nbirthday. A conference was held in Venice in June\n1996\nand another was held in Florence in July\n1996\n, both to honour Nirenberg's\n70\nth\nbirthday. A conference was held in Hsinchu in September\n2000\nto honour Nirenberg's\n75\nth\nbirthday, and another conference was held at the Universidad de Castilla-La Mancha, Toledo in June\n2006\nin honour of Nirenberg's\n80\nth\nbirthday.\nNirenberg and\nJohn Nash\nwere awarded the Abel prize in\n2015\nfor:-\n... striking and seminal contributions to the theory of nonlinear partial differential equations and its applications to geometric analysis.\nLet us end with a quote from Nirenberg\n[\n4\n]\n:-\nI wrote one paper with Philip Hartman that was elementary but enormous fun to do. That's the thing I try to get across to people who don't know anything about mathematics, what fun it is! One of the wonders of mathematics is you go somewhere in the world and you meet other mathematicians, and it's like one big family. This large family is a wonderful joy.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}