{
  "nome_completo": "Louis Victor Pierre Raymond duc de Broglie",
  "nome_curto": "Louis de Broglie",
  "ano_nascimento": "1892",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Broglie/",
  "lugar_nascimento": "Dieppe, France",
  "lugar_morte": "Paris, France",
  "biografia": "Louis de Broglie\n's father was Victor, Duc de Broglie, and his mother was Pauline d'Armaillé. Louis studied at the Lycée Janson de Sailly in Paris completing his secondary school education in\n1909\n. At this stage he did not envisage a career in science, but was interested in taking literary studies at university. He entered the Sorbonne in Paris taking a course in history, intending to make for himself a career in the diplomatic service. At the age of\n18\nhe graduated with an arts degree but he was already becoming interested in mathematics and physics. After being assigned a research topic in history he chose, after worrying greatly about the decision, to study for a degree in theoretical physics.\nIn\n1913\nde Broglie was awarded his Licence ès Sciences but before his career had progressed much further World War I broke out. During the War de Broglie served in the army. He was attached to the wireless telegraphy section for the whole of the war and served in the station at the Eiffel Tower. During these war years all his spare time was spent thinking about technical problems. He explained how he was attracted to mathematical physics after the War\n(\nsee for example\n[\n9\n]\n)\n:-\nWhen in\n1920\nI resumed my studies ... what attracted me ... to theoretical physics was ... the mystery in which the structure of matter and of radiation was becoming more and more enveloped as the strange concept of the\nquantum\n, introduced by\nPlanck\nin\n1900\nin his researches into black-body radiation, daily penetrated further into the whole of physics.\nTaking up research in mathematical physics, de Broglie nevertheless maintained an interest in experimental physics. His brother Maurice de Broglie was at that time carrying out experimental work on X-rays and this proved a considerable interest to de Broglie during the first few years of the\n1920\ns during which he worked for his doctorate. De Broglie's doctoral thesis\nRecherches sur la théorie des quanta\nⓉ\n(\nResearches on the quantum theory\n)\nof\n1924\nput forward this theory of electron waves, based on the work of\nEinstein\nand\nPlanck\n. It proposed the theory for which he is best known, namely the particle-wave duality theory that matter has the properties of both particles and waves.\nIn a lecture de Broglie gave on the occasion when he received the Nobel Prize in\n1929\nhe explained the background to the ideas contained in his doctoral thesis\n(\nsee for example\n[\n9\n]\n)\n:-\nThirty years ago, physics was divided into two camps: ... the physics of matter, based on the concepts of particles and atoms which were supposed to obey the laws of classical Newtonian mechanics, and the physics of radiation, based on the idea of wave propagation in a hypothetical continuous medium, the luminous and electromagnetic ether. But these two systems of physics could not remain detached from each other: they had to be united by the formulation of a theory of exchanges of energy between matter and radiation. ... In the attempt to bring the two systems of physics together, conclusions were in fact reached which were neither correct nor even admissible when applied to the energy equilibrium between matter and radiation ...\nPlanck\n... assumed ... that a light source ... emits its radiation in equal and finite quantities - in quanta. The success of\nPlanck\n's ideas has been accompanied by serious consequences. if light is emitted in quanta, must it not, once emitted, possess a corpuscular structure? ...\nJeans\nand\nPoincaré\n[\nshowed\n]\nthat if the motion of the material particles in a source of light took place according to the laws of classical mechanics, then the correct law of black-body radiation,\nPlanck\n's law, could not be obtained.\nDuring an interview in\n1963\nde Broglie described how, given the above background, his discoveries came about:-\nAs in my conversations with my brother we always arrived at the conclusion that in the case of X-rays one had both waves and corpuscles, thus suddenly - ... it was certain in the course of summer\n1923\n- I got the idea that one had to extend this duality to material particles, especially to electrons. And I realised that, on the one hand, the\nHamilton\n-\nJacobi\ntheory pointed somewhat in that direction, for it can be applied to particles and, in addition, it represents a geometrical optics; on the other hand, in quantum phenomena one obtains quantum numbers, which are rarely found in mechanics but occur very frequently in wave phenomena and in all problems dealing with wave motion.\nThe wave nature of the electron was experimentally confirmed in\n1927\nby C J Davisson, C H Kunsman and L H Germer in the United States and by G P Thomson\n(\nthe son of J J Thomson\n)\nin Aberdeen, Scotland. De Broglie's theory of electron matter waves was later used by\nSchrödinger\n,\nDirac\nand others to develop wave mechanics.\nAfter his doctorate, de Broglie remained at the Sorbonne where he taught for two years, becoming professor of theoretical physics at the\nHenri Poincaré\nInstitute in\n1928\n. From\n1932\nhe was also professor of theoretical physics at the Faculté des Sciences at the Sorbonne. De Broglie taught there until he retired in\n1962\n. From\n1944\nhe was a member of the Bureau des Longitudes. In\n1945\nhe became an adviser to the French Atomic Energy Commissariat.\nHis greatest honour was being awarded the Nobel Prize in\n1929\n. We have quoted above from his lecture given at the award ceremony. Let us quote further from the lecture\n(\nsee for example\n[\n9\n]\n)\n:-\nThus I arrived at the following general idea which has guided my researches: for matter, just as much as for radiation, in particular light, we must introduce at one and the same time the corpuscle concept and the wave concept. In other words, in both cases we must assume the existence of corpuscles accompanied by waves. But corpuscles and waves cannot be independent, since, according to Bohr, they are complementary to each other; consequently it must be possible to establish a certain parallelism between the motion of a corpuscle and the propagation of the wave which is associated with it.\nAfter receiving the Nobel Prize in\n1929\nDe Broglie worked on extensions of wave mechanics. Among publications on many topics he published work on Dirac's theory of the electron, on the new theory of light, on\nUhlenbeck\n's theory of spin, and on applications of wave mechanics to nuclear physics. He wrote at least twenty-five books including\nOndes et mouvements\nⓉ\n(\nWaves and motions\n)\n(1926)\n,\nLa mécanique ondulatoire\nⓉ\n(\nWave mechanics\n)\n(1928)\n,\nUne tentative d'interprétation causale et non linéaire de la mécanique ondulatoire: la théorie de la double solution\nⓉ\n(\nAn causal interpretation of  nonlinear  wave mechanics: the theory of the double solution\n)\n(1956)\n,\nIntroduction à la nouvelle théorie des particules de M Jean-Pierre Vigier et de ses collaborateurs\nⓉ\n(\nIntroduction to the new theory of particle of Jean-Pierre Vigier and his collaborators\n)\n(1961)\n,\nÉtude critique des bases de l'interprétation actuelle de la mécanique ondulatoire\nⓉ\n(\nCritical study of the bases of the current interpretation of wave mechanics\n)\n(1963)\n. The last three mentioned books were published in English translations as\nNon-linear Wave Mechanics: A Causal Interpretation\n(1960)\n,\nIntroduction to the Vigier Theory of elementary particles\n(1963)\n, and\nThe Current Interpretation of Wave Mechanics: A Critical Study\n(1964)\n.\nHe wrote many popular works which demonstrate his interest in the philosophical implications of modern physics, including\nMatter and Light: The New Physics\n(1939)\n;\nThe Revolution in Physics\n(1953)\n;\nPhysics and Microphysics\n(1960)\n; and\nNew Perspectives in Physics\n(1962)\n.\nIn\n1933\nde Broglie was elected to the\nAcadémie des Sciences\nbecoming Permanent Secretary for the mathematical sciences in\n1942\n. The\nAcadémie\nawarded him its\nHenri Poincaré\nMedal in\n1929\nand the Albert I of Monaco Prize in\n1932\n. Other honours which he received included the Kalinga Prize which was awarded to him by UNESCO in\n1952\nfor his efforts towards the understanding of modern physics by the general public. The French National Scientific Research Centre awarded him its gold medal in\n1956\n. Further honours included the awarding of the Grand Cross of the Légion d'Honneur and Belgium made him an Officer of the Order of Leopold. He received honorary doctorates from the Universities of Warsaw, Bucharest, Athens, Lausanne, Quebec, and Brussels. He was elected to honorary membership of eighteen academies and learned societies in Europe, India, and the United States.\nDe Broglie described himself as:-\n... having much more the state of mind of a pure theoretician than that of an experimenter or engineer, loving especially the general and philosophical view ... .\nThe central question in de Broglie's life was whether the statistical nature of atomic physics reflects an ignorance of the underlying theory or whether statistics is all that can be known. For most of his life he believed the former although as a young researcher he had at first believed that the statistics hide our ignorance. Perhaps surprisingly, he returned to this view late in his life stating that:-\n... the statistical theories hide a completely determined and ascertainable reality behind variables which elude our experimental techniques.\nLet us end our biography with the tribute paid to de Broglie by C W Oseen, Chairman of the Nobel Committee for Physics of the\nRoyal Swedish Academy of Sciences\n:-\nWhen quite young you threw yourself into the controversy raging round the most profound problem in physics. You had the boldness to assert, without the support of any known fact, that matter had not only a corpuscular nature, but also a wave nature. Experiment came later and established the correctness of your view. You have covered in fresh glory a name already crowned for centuries with honour.",
  "math_areas": [
    "Applied Mathematics",
    "Statistics"
  ]
}