{
  "nome_completo": "Luca Valerio",
  "nome_curto": "Luca Valerio",
  "ano_nascimento": "1552",
  "ano_morte": "1618",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Valerio/",
  "lugar_nascimento": "Naples, Kingdom of Naples (now Italy)",
  "lugar_morte": "Rome, Papal States (now Italy)",
  "biografia": "Luca Valerio\n(\nor\nValeri\nas the name is sometimes written\n)\nwas born in Naples. His father was Giovanni Valeri who came from Ferrara, and his mother was Giovanna Rodomano who was of Greek extraction. In fact Luca was brought up in Greece, to be precise on the island of Corfu where his mother's family were members of the nobility. However, for his education he returned to Italy and studied at the Collegio Romano in Rome. His interests were in philosophy and theology but the subject he loved most was mathematics. He had one of the leading mathematicians of the day as a teacher, namely\nChristopher Clavius\n. When we say that\nClavius\nwas a leading mathematician we should stress that he produced little original mathematics but was a gifted teacher and writer of textbooks. His skill as a teacher was amply repaid by the remarkable mathematical achievements of his pupil Valerio who remained at Collegio Romano after taking his first degree and was awarded a doctorate in philosophy and theology.\nAfter taking his doctorate, Valerio continued to live in Rome teaching both private pupils and having public teaching appointments. At first he taught\nrhetoric\nand Greek at the Collegio Greco. On a visit to Pisa in\n1590\nhe met\nGalileo\nbut it was not  until around twenty years later that they entered into a correspondence. After his return to Rome he began teaching rhetoric and philosophy at the University of Sapienza. Sapienza was the name of the building which the University of Rome occupied at this time and it gave its name to the University. From about\n1600\nValerio, still at Sapienza, began to teach mathematics which he continued to do for the rest of his life. In addition to these teaching positions, Valerio was also corrector of Greek at the Vatican library for many years.\nTwo of his private pupils must be mentioned for they played an important part in his life. His pupil Ippolito Aldobrandini held numerous church offices, then was made cardinal in\n1585\nby Pope Sixtus V and elected pope as Clement VIII on\n30\nJanuary\n1592\n. He certainly played a role in Valerio's appointment to Sapienza in\n1591\nand Valerio thanked him with a dedication in his work of\n1604\n. In the same work he thanked Clement VIII's nephew Cardinal Petro Aldobrandini for his support. Clearly he was closely connected with the top people in the Roman Catholic Church. The second of his pupils whom we must mention was Margherita Sarrocchi. She was a poet and by all accounts a flamboyant extrovert. This was in distinct contrast to Valerio who was described as a shy, very withdrawn and isolated person. The two became lovers but Margherita Sarrocchi totally dominated the relationship, being possessive and jealous of anything in Valerio's life that did not involve her.\nValerio's\nDe centro gravitatis solidorum\nⓉ\n(\nOn the centre of gravity of solids\n)\n, written in\n1603\n, applied methods of Archimedes to find volumes and centres of gravity of solid bodies, in particular solids of rotation and their segments. He used interesting early ideas concerning the quotient of limits showing that, if\nlim\n⁡\nx\n=\na\n,\nlim\n⁡\ny\n=\nb\n\\lim x =a, \\lim y = b\nlim\nx\n=\na\n,\nlim\ny\n=\nb\nand if\nx\ny\n=\nc\n\\large\\frac{x}{y}\\normalsize   = c\ny\nx\n​\n=\nc\n= constant, then\na\nb\n=\nlim\n⁡\nx\nlim\n⁡\ny\n=\nx\ny\n=\nc\n\\large\\frac a b \\normalsize = \\large\\frac {\\lim x}{\\lim y} \\normalsize =\\large\\frac x y \\normalsize = c\nb\na\n​\n=\nl\ni\nm\ny\nl\ni\nm\nx\n​\n=\ny\nx\n​\n=\nc\nThis is now known as '\nCavalieri\n's principle' although Valerio's work long predates that of\nBonaventura Cavalieri\n. J L Berggren, reviewing\n[\n10\n]\nwrites:-\nWhen Luca Valerio published his 'De centro gravitatis' in\n1603\n, he claimed he was opening up what he called a 'royal road' to the investigation of centres of gravity of solid figures. Although the topic had been treated earlier by his immediate predecessors,\nCommandino\nand\nMaurolico\n, Valerio felt, and the authors of this study agree, that his work marked an innovation in its investigation of all solids known at the time. One part of this innovation was his conception of a general class of objects\n(\nin this case, solids satisfying certain symmetry conditions\n)\n, as opposed to more specific objects, such as conic sections. And the other was the development of a considerable body of theorems applicable to that class, including the 'invention'\n(\nitalics in original\n)\nof the method of exhaustion, an invention usually ascribed to\nEudoxus\n.\n(\nThe authors mean this claim in the sense that Valerio was the first to systematize this ancient device, in the first three theorems of 'De centro'.\n)\nIn applying these general theorems to the solution of a wide class of problems, Valerio thus advanced beyond his ancient Renaissance predecessors.\nThe article\n[\n7\n]\nby Divizia aims to show how, in\nDe centro gravitatis\nⓉ\n(\nOn the centre of gravity of solids\n)\n, Valerio anticipated the concept of limit and the methods of the integral calculus to calculate areas and volumes. Book I of\nDe centro gravitatis\nⓉ\n(\nOn the centre of gravity of solids\n)\nfollows\nEuclid\nin beginning with statements of the definitions and axioms. Divizia claims that the germ of the concept of limit can be found in Proposition\n1\nof Book II.\nGalileo\nwas highly impressed by this work and, much later in\n1638\n, described Valerio as \"the greatest geometer, the new Archimedes of our age\". Their mutual admiration following the publication of Valerio's book led to a renewal of their friendship begun in Pisa fourteen years earlier.\nAmong Valerio's other works was\nQuadratura parabolae\nⓉ\n(\nQuadrature of a parabola\n)\n(1606)\n. In this work he used his ideas of the quotient of limits to find the centre of gravity of a segment of a\nparabola\n, deducing it from the known centre of gravity of a hemisphere.\nFrom\n1609\nuntil\n1616\nValerio corresponded with\nGalileo\n, each showing great respect for the mathematical ability of the other. On\n7\nJune\n1612\nValerio was elected to the\nAccademia dei Lincei\n. It was\nGalileo\nwho proposed Valerio to Federico Cesi who founded the Academy. Freedberg writes\n[\n3\n]\n:-\nValerio was the Lincean to whom the overall editorship of academic publications was assigned. He was given charge of the publication of one of the most critical documents for the history of the Linceans, the 'Lynceographum', the massive outline of the rules, regulations, aims, and ideals of the society. ... Valerio also played a crucial role in the publication of\nGalileo\n's 'Letters on the sunspots' of\n1613\n. ... He\n[\nwas\n]\none of\nGalileo\n's most constant supporters and advisors.\nGalileo\nmuch admired him for his mathematical work.\nCardinal Robert Bellarmine, the chief theologian of the Roman Catholic Church, issued a decree on\n5\nMarch\n1616\nwhich declared Copernicanism false and erroneous. Valerio appeared to take fright at this, ending his correspondence with\nGalileo\n, and resigning from the\nAccademia dei Lincei\nwhich he had been deeply involved with over the previous four years\n[\n3\n]\n:-\nNothing was less expected than Valerio's abandonment of the views of his closest friend. The fact that the Jesuits of the Collegio Romano, who five years earlier had so lauded\nGalileo\n, were now silent was one thing: but from Valerio the Linceans expected greater consistency, to say the least. He had now aligned himself with the most blinkered and fanatical of\nGalileo\n's opponents. His astonished colleagues refused his resignation\n(\nfor that was against their oath of loyalty\n)\n; and in order to deal with this matter, as well as with the general crisis now facing them, they convoked what would turn out to be the most difficult meeting they ever had.\nThis meeting of the\nAccademia dei Lincei\ntook place on\n24\nMarch\n1616\nbut, given the rules of the Academy, there was no doubt what the decision had to be:-\nThey censured him for having betrayed his oath of loyalty and for having, by his conduct, offended both\nGalileo\nhimself and the fundamental Lincean principle of mutual solidarity, or Lyncealitas as they called it. Reiterating their complete solidarity with\nGalileo\n, they deprived Valerio of his voting rights and forbade him from ever again participating in the sessions of their society. Bitterly they noted that by expressing the wish to resign, Valerio had implied that the Academy itself had committed a crime or a grave error in supporting the view of the movement of the earth; and that in accusing his old friend\nGalileo\nof this same \"error\", he had overlooked the fact that\nGalileo\nhad only held the movement of the earth to be a hypothesis.\nNow let us try to understand why Valerio behaved in the way that he did. It makes no sense to think that he might have changed his mind about the heliocentric theory for scientific reasons. He resigned immediately following the decree from the Vatican, and nothing in that decree would lead to a change of mind for scientific reasons. The most obvious reasons seem to relate to his two famous pupils that we mentioned above. His friendship with pope Clement VIII, and his resulting closeness to the Vatican, must be considered as being at least part of the reason. Clement VIII had expanded the Index of Forbidden Books\n(\nIndex Librorum Prohibitorum\n)\nand intensified the activity and scope of the Inquisition. However, Clement VIII had died in\n1605\nand, after Pope Leo XI died after less than a month in office, Paul V had become pope. Although Paul V placed\nCopernicus\n's treatise on the Index of Forbidden Books, he was surprisingly undogmatic in doctrinal matters. It is possible that Valerio's closeness to the Vatican meant that he was aware that the Church was going to move more firmly against\nGalileo\n, yet his behaviour in resigning was out of character. The most likely explanation for Valerio's resignation relates to the poet Margherita Sarrocchi. She was undoubtedly jealous of Valerio's close association with the\nAccademia dei Lincei\nand it would appear that Valerio, being totally under her influence, had been pushed to act out of character to please Sarrocchi. Certainly if Valerio thought that his actions would prevent him from losing respect, he was totally wrong, for his spent the remaining two years of his life in obscurity and disgrace.\nBaldini sums up Valerio's contribution as follows\n[\n3\n]\n:-\nLuca Valerio may without a doubt be considered one of the most important figures produced by the renaissance in mathematics and mechanics that took place in Italy in the\n16\nth\ncentury. In fact, his work represents, at least for the Archimedean tradition, the apex of that intellectual movement, in the sense that with it a series of themes that had appeared throughout the mathematics of the Cinquecento were brought to maturity, a level to which subsequent research would necessarily have to raise the framework of Renaissance mathematics, which was oriented especially toward rediscovery and translation of, and commentary on, classical texts.\nAs to his influence on the mathematicians who came after him, Stromholm writes\n[\n1\n]\n:-\nAmong the mathematicians who studied him and spoke highly of him were\nCavalieri\n,\nTorricelli\nand\nJ C de la Faille\n. He also had a direct influence on\nGuldin\n,\nGregorius Saint Vincent\n, and\nTacquet\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}