{
  "nome_completo": "Ludwig Berwald",
  "nome_curto": "Ludwig Berwald",
  "ano_nascimento": "1883",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Berwald/",
  "lugar_nascimento": "Prague, Bohemia (now Czech Republic)",
  "lugar_morte": "Łódź, Poland",
  "biografia": "Ludwig Berwald\n's parents were Max Berwald and Friedericke Fischel. Max ran Andre's Bookshop, one of the most famous bookshops in Prague situated in the centre of the city in the Pulvertum area. Max and Friedericke had there children; Ludwig had one brother and one sister. The family were Jewish with Max coming from East Prussia and his wife being a native of Prague. They were German speaking.\nLudwig entered the Graben\nGymnasium\n, previously called the Imperial Royal State High School of Prague, in\n1893\n. He studied there for six years and his mathematics teacher, first Josef Guckla and later Prokop Knothe, taught the young boy well and gave him a love of the subject. Around\n1900\nMax Berwald sold his bookshop in Prague and moved with his family to Munich. There Ludwig continued his education at the Luitpold Gymnasium, completing his school education in\n1902\n. He entered the Royal Ludwig-Maximilian University in Munich in the Fall of\n1892\n, where he pursued his studies in mathematics and physics. Among his lecturers were\nLindemann\n,\nPringsheim\n, and Röntgen.  In December of\n1908\n, he was awarded his doctorate, after studying under professor Auriel Voss, with his dissertation\nÜber die Krümmungseigenschaften der Brennflachen eines geradlinigen Strahlsystems und der in ihm enthaltenen Regelflächen\nⓉ\n(\nOn the curvature properties of the internal surfaces of a straight optical system and usually surfaces contained therein\n)\n.\nAfter the award of the doctorate, Berwald was appointed as assistant to\nHeinrich Burkhardt\n. This should have presented Berwald with the opportunity to work on his\nhabilitation\nthesis so that he could become a\nprivatdozent\nin Munich, but sadly he had rather severe health problems. For the next three years he spent most of the time in a sanatorium being treated for a lung problem. He did manage to do a little private tutoring but he was unable to undertake research for his habilitation. On\n12\nSeptember\n1915\nBerwald married Hedwig Adler, the daughter of Friedericke and Emanuel Adler, who had also been born in Prague; she was eight years older than her husband. After that Berwald and his wife made many trips to Prague, and there he got to know two mathematics lecturers Gerhard Kowalewski and\nGeorg Pick\n. With their support, Berwald became a lecturer at the German University in Prague.  He was promoted to an extraordinary professorship on\n24\nMarch\n1922\n, and became a full professor in\n1924\n. After\nPick\nretired in\n1929\n, Berwald became Head of the Mathematics Department. Pinl\n[\n2\n]\nmet Berwald for the first time in\n1926\n. He writes that Berwald\n[\n1\n]\n:-\n... was primarily known as a typical scholar, pointedly reserved, choosing his words carefully and precisely, always serious and cautious, of somewhat sceptical outlook, but convincing and determined if need be. On close acquaintance one discovered behind the scientist a sensitive, artistic personality, exceptionally musical and, on rare occasions, even poetically inclined. Berwald was tall and slender in statue. Because of his nearsightedness he usually wore glasses. As a result of his early serious illness Berwald was very prone to colds. ... Berwald was an excellent pianist and also played chamber music with a certain well-ordered regularity that enabled him to study a broad range of musical literature together with his fellow musicians, among them\nProfessor Pick\nwho played the violin. ... One could make Berwald very happy if one turned the conversation to his Dalmatian trips - how he loved the hot sun of this stony country. How he loved to describe his travelling experiences and show his numerous pictures that he had collected.\nBerwald's scientific work was mainly in the area of\ndifferential geometry\n. He wrote\n54\npapers up to the time of his deportation. A portion of his work set up the basic theory of\nFinsler\ngeometry and Spray geometry\n(\ni.e., differential geometry of path spaces\n)\n. Many people working in\nFinsler\ngeometry consider that Ludwig Berwald is the founder of\nFinsler\ngeometry. Berwald and\nE Cartan\ndeveloped a general theory of two-dimensional\nFinsler\nspaces. Berwald wrote a series of major papers\nOn Finsler and Cartan geometries\n.\nJesse Douglas\n, reviewing the third of these, writes:-\nThe principal problem\n(\ndue to P Funk\n)\nsolved in this paper is that of characterising in an invariant manner all two-dimensional\nFinsler\nspaces which can be mapped geodesically on a Euclidean plane\n(\n\"Finsler spaces with rectilinear extremals\"\n)\n. In the case where the\nFinsler\nspace is Riemannian, this problem reduces to the classic one of\nBeltrami\nsolved by surfaces of constant curvature.\nOn\n22\nOctober\n1941\n, Berwald's scientific work came to a close.  The Berwalds were deported to the Ghetto in Łódź, Poland, by order of the German Secret Police as part of the third transportation of Jews\n[\n1\n]\n:-\nThe Berwalds were placed in an incomplete one storey schoolhouse ... There were no beds ... people simply lay down next to each other on the bare floor. ... Naturally, everybody slept in their day-time clothes. ... Fifty-five people slept in one room which was approximately twenty feet by twenty feet.\nHedwig Berwald died on\n27\nMarch\n1942\n; the cause of death was given as blocked arteries. Ludwig Berwald died a few weeks later on\n20\nApril; the cause of death was given as intestinal catarrh and heart failure.",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}