{
  "nome_completo": "Ludwig Schläfli",
  "nome_curto": "Ludwig Schläfli",
  "ano_nascimento": "1814",
  "ano_morte": "1895",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schlafli/",
  "lugar_nascimento": "Grasswil, Bern, Switzerland",
  "lugar_morte": "Berne, Switzerland",
  "biografia": "Ludwig Schläfli\n's parents were Johann Ludwig Schläfli and Magdalena Aebi. Ludwig was born in Grasswil, his mother's home town, but the family soon moved to Burgdorf where Johann Schläfli worked as a tradesman. Ludwig's father wanted him to become a tradesman and follow in his footsteps but it was clear when Ludwig was at the primary school in Burgdorf that he had great talent for mathematics but was not at all skilled with his hands. He did so well in the primary school that he was awarded a scholarship to pay for him to study at the\nGymnasium\nin Bern which he entered in\n1829\n.\nAlthough he was only fifteen years old when he entered the Gymnasium, Schläfli was already studying the differential calculus using\nKästner\n's famous book\nMathematische Anfangsgründe der Analysis des Unendlichen\nⓉ\n(\nMathematical foundations of infinite analysis\n)\n. In\n1831\n, at the age of\n17\n, he left the Gymnasium and began to study theology at the Academy in Bern. In\n1834\nthe University of Bern was founded and it incorporated the Theological School which was an old institution founded in\n1528\n, so at this stage Schläfli automatically became a university student. After graduating with a degree in theology in\n1836\n, Schläfli decided to become a school teacher since he had already decided not to pursue an ecclesiastical career. He was appointed as a teacher of mathematics and science at the Burgerschule in Thun.\nSchläfli worked for ten years as a school teacher in Thun. During this period he studied advanced mathematics in his spare time but also travelled to Bern to attend the University there on one day each week. Schläfli was an expert linguist speaking many languages including Sanskritt and Rigveda but it was his fluency in French and Italian which proved important as this stage. Perhaps surprisingly, this expertise led him to a significant turning point in his life. In Bern in\n1843\nSchläfli met\nSteiner\nwho was impressed with his language skills and also with his mathematical knowledge. Later that year\nSteiner\n,\nJacobi\nand\nDirichlet\ntravelled to Rome and took Schläfli with them as an interpreter.\nMoritz Cantor\nwrites in\n[\n7\n]\n:-\n...\nSteiner\nrecommended the new travel companion to his Berlin friends saying that Schläfli was a provincial mathematician working near Bern, not very practical but that he learned languages like child's play, and that they should take him with them as a translator.\nSchläfli gained greatly from discussions with these leading mathematicians, in particular having a daily lesson in number theory from\nDirichlet\n. The visit lasted for six months and during that time Schläfli translated some of his companions works into Italian.\nAfter six months in Italy, Schläfli returned to his teaching post in Thun but he continued to correspond with\nSteiner\ntill\n1856\n. He applied to become a\nPrivatdozent\nat the University of Bern in\n1847\nand took up the position in the following year. However, he certainly did not find it easy to survive on the salary he received and he wrote:-\nI was confined to a stipend of Fr\n400\nand, in the literal sense of the word, had to do without.\nHe survived on this very low salary for five years until\n1853\nwhen he was promoted to extraordinary professor. One might have hoped that such a position would have at least freed him from financial worries, but in fact he was only a little better off and still had a hard struggle to make ends meet. In\n1868\n, at the age of\n54\n, he was appointed as an ordinary professor of mathematics at Bern and at this stage his salary became sufficient for him to live for the first time in\n20\nyears without financial worries.\nAfter taking up his appointment at the University of Bern, Schläfli worked on two major investigations. One of these was his study of elimination theory which he published in\nÜber die resultante eines Systems mehrerer algebraischer Gleichungen\n.\nⓉ\n(\nOn the resultant of a system of several more algebraic equations.\n)\nIn one of his letters to\nSteiner\nhe described the main idea:-\nFor a given system of\nn\nn\nn\nequations of higher degree with\nn\nn\nn\nunknowns, I take a linear equation with undetermined coefficients\na\n,\nb\n,\nc\n,\n.\n.\n.\na, b, c, ...\na\n,\nb\n,\nc\n,\n.\n.\n.\nand show how one can thus obtain true resultants without burdening the calculation with extraneous factors. If everything else is given numerically, then the resultant must he decomposable into factors all of which are linear with respect to\na\n,\nb\n,\nc\n,\n.\n.\n.\na, b, c, ...\na\n,\nb\n,\nc\n,\n.\n.\n.\n. In the case of each of these linear polynomials the coefficients\na\n,\nb\n,\nc\n,\n.\n.\n.\na, b, c, ...\na\n,\nb\n,\nc\n,\n.\n.\n.\nare then values of the unknowns belonging to a single solution.\nBurckhardt writes in\n[\n1\n]\n:-\nDrawing on the works of\nHesse\n,\nJacobi\n, and\nCayley\n, Schläfli presented applications to special cases. He then developed the fundamental theorem on class and degree of an algebraic\nmanifold\n, theorems that attracted the interest of the Italian school of geometers. The work concluded with an examination of the class equation of third degree curves.\nThe second topic that he worked on shortly after his appointment as a Privatdozent was his major work\nTheorie der vielfachen Kontinuität\nⓉ\n(\nTheory of multiple continuity\n)\n. Having written the work between\n1850\nand\n1852\n, he submitted his masterpiece to the\nAustrian Academy of Sciences\nwhich had only been founded a few years earlier. The work begins:-\nThis treatise, which I have the honour of presenting to the\nImperial Academy of Science\n, is an attempt to found and to develop a new branch of analysis that would, as it were, be a geometry of\nn\nn\nn\ndimensions, containing the geometry of the plane and space as special cases for\nn\n=\n2\n,\n3\nn = 2, 3\nn\n=\n2\n,\n3\n.  I call this the \"theory of multiple continuity\" in the same sense in which one can call the geometry of space that of three-fold continuity. As in that theory, a 'group' of values of coordinates determines a point, so in this one a 'group' of given values of the\nn\nn\nn\nvariables will determine a solution.\nThe treatise was a long one and it was rejected by the\nAustrian Academy of Sciences\n, so Schläfli submitted it to the\nBerlin Academy of Science\n. Again it was rejected and over the next years only parts of it appeared in print in various journals. The complete treatise was published in\n1901\n, after his death, and only then did its importance become fully appreciated.\nP H Schoute\n, reviewing the work about\n50\nyears after it was written, wrote:-\nThis treatise surpasses in scientific value a good portion of everything that has been published up to the present day in the field of multidimensional geometry. The author experienced the sad misfortune of those who are ahead of their time: the fruits of his most mature studies cannot bring him fame. And in this case the success of the success of the division of the cubic surfaces was only a small compensation; for, in my opinion, this achievement, however valuable it might be, is far from conveying the genius expressed in the theory of manifold continuity.\nIn this work Schläfli introduced polytopes\n(\nalthough he uses the word polyschemes\n)\nwhich he defines to be higher dimensional analogues of polygons and polyhedra. Schläfli introduced what is today aclled the Schläfli symbol. It is defined inductively.\n{\nn\n}\n\\{n\\}\n{\nn\n}\nis a regular\nn\nn\nn\n-gon, so {\n4\n} is a square. There {\n4\n,\n3\n} is the cube, since it is a regular polyhedron with\n3\nsquares {\n4\n} meeting at each vertex. Then the\n4\ndimensional hypercube is denoted as {\n4\n,\n3\n,\n3\n}, having three cubes {\n4\n,\n3\n} meeting at each vertex.\nEuclid\n, in the\nElements\n, proves that there are exactly five regular solids in three dimensions. Schläfli proves that there are exactly six regular solids in four dimensions {\n3\n,\n3\n,\n3\n}, {\n4\n,\n3\n,\n3\n}, {\n3\n,\n3\n,\n4\n}, {\n3\n,\n4\n,\n3\n}, {\n5\n,\n3\n,\n3\n}, and {\n3\n,\n3\n,\n5\n}, but only three in dimension\nn\nn\nn\nwhere\nn\n≥\n5\nn ≥ 5\nn\n≥\n5\n, namely {\n3\n,\n3\n, ...,\n3\n}, {\n4\n,\n3\n,\n3\n, ....,\n3\n}, and {\n3\n,\n3\n, ...,\n3\n,\n4\n}.\nMost of Schläfli's work was in geometry, arithmetic and function theory. He gave the integral representation of the\nBessel function\nand of the\ngamma function\n. His eight papers on\nBessel\nfunctions played an important role in the preparation of\nG N Watson\n's major text\nTreatise on the theory of Bessel functions\n(1944)\n.\nSchläfli made an important contribution to non-Euclidean\n(\nelliptic\n)\ngeometry when he proposed that spherical three-dimensional space could be regarded as the surface of a hypersphere in Euclidean four-dimensional space. Schläfli knew how to find the volume of a tetrahedron not only in spherical space but also in hyperbolic space, although when he undertook this work in\n1852\nhe was almost certainly unaware of\nLobachevsky\n's work. Other papers which he published investigate a variety of topics such as partial differential equations, the motion of a pendulum, the general quintic equation, elliptic modular functions, orthogonal systems of surfaces, Riemannian geometry, the general cubic surface, multiply periodic functions, and the conformal mapping of a polygon on a half-plane.\nHe received the\nSteiner\nPrize from the\nBerlin Academy\nin\n1870\nfor his discovery of the\n27\nlines and the\n36\ndouble six on the general cubic surface. He was led to this discovery when\nSteiner\ntold him about\nCayley\n's discovery of the\n27\nstraight lines on the cubic surface. Schläfli published the first complete description of the configuration in\nAn attempt to determine the twenty-seven lines upon a surface of the third order, and to divide such surfaces into species in reference to the reality of the lines upon the surface\n.\nSchläfli also made significant contributions to celestial mechanics, for example publishing a note on the acceleration of a planet in an elliptic orbit. Among his unpublished documents is his discovery of the domain of discontinuity of the modular group ten years before\nDedekind\n, and class invariants twenty years before\nHeinrich Weber\n.\nAlthough Schläfli never received full credit for his remarkable achievements during his lifetime, he was elected to the Istituto Lombardo di Scienze e Lettere in Milan\n(1868)\n, the\nGöttingen Academy of Sciences\n(\nKönigliche Gesellschaft der Wissenschaften\n)\n(1871)\n, and the\nAccademia dei Lincei\n(1883)\n. He was awarded an honorary doctorate by the University of Bern in\n1863\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}