{
  "nome_completo": "Ludwig Schlesinger",
  "nome_curto": "Ludwig Schlesinger",
  "ano_nascimento": "1864",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schlesinger/",
  "lugar_nascimento": "Nagyszombat, Hungary (now Trnava, Slovakia)",
  "lugar_morte": "Giessen, Germany",
  "biografia": "Ludwig Schlesinger\nstarted elementary school in Trnava and, moving to high school, he attended the Realschule in Presburg, now Bratislava\n(\nSlovakia\n)\n. He then studied mathematics and physics at the universities of Heidelberg and Berlin between\n1896\nand\n1887\n, and he received a doctorate from the University of Berlin in\n1887\nfor a thesis on differential equations entitled:\nÜber lineare homogene Differentialgleichungen vierter Ordnung, zwischen deren Integralen homogene Relationen höheren als ersten Grades bestehen\nⓉ\n(\nOn linear homogeneous differential equations of the fourth order, between the integrals homogeneous relations higher than first degree\n)\n. His thesis advisors were\nLazarus Immanuel Fuchs\nand\nLeopold Kronecker\n.\nIn\n1889\nSchlesinger became an associate professor at the University of Berlin; in\n1897\n, invited professor at the University of Bonn, and in the same year he was appointed professor of mathematics at the University of Kolozsvár, Hungary\n(\nnow Cluj, Romania\n)\n. He served as head of the department of higher mathematics and, in\n1906\n-\n07\n, he was the dean of the Faculty of Mathematics and Sciences. In\n1911\nhe left Kolozsvár and moved to the University of Giessen, Germany, where he continued to teach until he retired in\n1930\n.\nIn\n1902\nSchlesinger was elected as a corresponding member of the\nHungarian Academy of Sciences\n, and in\n1909\nhe was honoured with the award of the\nLobachevsky\nPrize.\nLudwig Schlesinger wrote many papers for scientific periodicals and journals. Papers such as\nSur la détermination des fonctions algébriques uniformes sur une surface de Riemann donnée\nⓉ\n(\nOn the determination of uniform algebraic functions on a given Riemann surface\n)\n(1903)\n,\nÜber isoliertwertige Funktionen\nⓉ\n(\nOn valent isolated functions\n)\n(1905)\n,\nÜber asymptotische Darstellungen der Lösungen linearer Differentialsysteme als Funktionen eines Parameters\nⓉ\n(\nOn asymptotic representations of the solutions of linear differential systems as functions of a parameter\n)\n(1907)\nare examples of his publications in the frst decade of the\n20\nth\ncentury. Near the end of his career he published articles such as\nParallelverschiebung und Krümmungstensor\nⓉ\n(\nParallel shift and curvature\n)\n(1928)\n,\nÜber die hypergeometrischen Differentialsysteme\nⓉ\n(\nOn  hypergeometric differential systems\n)\n(1928)\n,\nNeue Grundlagen für einen Infinitesimalkalkul der Matrizen\nⓉ\n(\nNew bases for a infinitesimal calculus of matrices\n)\n(1931)\n, and\nWeitere Beiträge zum Infinitesimalkalkul der Matrizen\nⓉ\n(\nRelated articles on infinitesimal calculus of matrices\n)\n(1932)\n. Perhaps his most important work, as far as current mathematical research is concerned, was\nÜber eine Klasse von Differentialsystemen beliebiger Ordnung mit festen kritischen Punkten\nⓉ\n(\nOn a class of differential systems of arbitrary order with fixed critical points\n)\nwhich he published in\nCrelle's Journal\nin\n1912\n.  In this paper Schlesinger formulated the problem of isomonodromy deformations for a certain matrix Fuchsian equation. The problem which he was tackling was a special case of\nHilbert\n's\n23\nrd\nproblem, namely:-\nProve the existence of linear differential equations having a prescribed monodromic group.\nSchlesinger solved a particular case of the problem using\nPoincaré\n's theory of the Fuchsian zeta-functions. The paper introduces what today are known as the Schlesinger transformations and Schlesinger equations which have an important role in differential geometry.\nSchlesinger is the author of\nHandbuch der Theorie der Linearen Differentialgleichungen\nⓉ\n(\nHandbook of the theory of linear differential equations\n)\n(\nB G Teubner, Leipzig; Vol\n1\n,\n1895\n; Vol\n2\nPart\n1\n,\n1897\n; Vol. II, Part\n2\n,\n1898)\n. This was reprinted by the Johnson Reprint Corporation, New York-London, in\n1968\n. He also published\nEinführung in die Theorie der gewöhnlichen Differentialgleichungen auf funktionentheoretischer Grundlage\nⓉ\n(\nIntroduction to the theory of ordinary differential equations on a functional theoretical basis\n)\n(\nthird edition, Leipzig,\n1922)\n. In\n1920\nhe published\nRaum, zeit und relativitätstheorie; gemeinverständliche vorträge\nⓉ\n(\nSpace, time and relativity; generally comprehensible lectures\n)\nand four years later he publised the important monograph on automorphic functions\nAutomorphe Funktionen\nⓉ\n(\nAutomorphic functions\n)\n(\nW de Gruyter & Co, Berlin,\n1924)\n. In\n1926\nSchlesinger published a book on\nLebesgue\nintegration and\nFourier\nseries in collaboration with\nAbraham Plessner\n. The work studies trigonometric series and the boundary behaviour of analytic functions.\nAnother of Schlesinger's interests was the history of mathematics and he made a number of important contributions to this topic. He translated\nDescartes\n'\nGeometrie\ninto German and this was published by Mayer and Müller, Berlin, in\n1894\n. A second edition was published in\n1923\nand reprinted by Wissenschaftliche Buchgesellschaft, Darmstadt,\n1969\n. He was an admirer of\nGauss\nand he wrote related essays, like\nÜber Gauss' Arbeiten zur Funktionentheorie\nⓉ\n(\nOn Gauss's work on complex analysis\n)\n222\nS Berlin, J Springer\n(\nC F\nGauss\n. Werke Bd. X,\n2)\n. published in\n1933\nor\nC F Gauss: Fragmente zur Theorie des arithmetisch- geometrischen Mittels aus den Jahren\n1797\n-\n1799\nⓉ\n(\nC F Gauss: Fragments on the theory of the arithmetic-geometric mean from the years\n1797\nto\n1799\n)\nin\nGöttinger Nachrichten\npublished in\n1912\n.\nAfter reading\nZoárd Geöcze\n's papers during his stay at the University of Kolozsvár, Ludwig Schlesinger suggested to him that he write down his ideas and submit them to\nComptes Rendus\nfor publication.\nAt the Franz Joseph University he was one of the most dedicated organisers of the centenary festivities dedicated to the hundredth anniversary of\nJános Bolyai\n. He identified the house in which\nJános Bolyai\nwas born and he held an excellent conference on the centenary festivity:\nLibellus post saeculum quam Ioannes Bolyai de Bolya anno MDCCCII a. d. XVIII kalendas Ianuarias Claudiopoli natus est ad celebrandam memoriam eius immortalem ex consilio ordinis mathematicorum et naturae scrutatorum Regiae LitterarumUniversitatis Hungaricae Francisco- Josephinae Claudiopolitanae editus\n[\nred. Ludovicus Schlesinger\n]\n.\nHe collected, in three volumes, the most important work of his advisor,\nLazarus Fuchs\n, who was also his father-in-law. During his stay in Kolozsvár\n(\nCluj\n)\n, Schlesinger contributed significantly to the advancement of mathematics in the city. He,\nGyula Farkas\nand\nGyula Vályi\n, had a decisive role in the establishment of an excellent mathematics library within the university.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}