{
  "nome_completo": "Ludwig Georg Elias Moses Bieberbach",
  "nome_curto": "Ludwig Bieberbach",
  "ano_nascimento": "1886",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bieberbach/",
  "lugar_nascimento": "Goddelau, Darmstadt in Hessen, Germany",
  "lugar_morte": "Oberaudorf in Oberbayern, Germany",
  "biografia": "Ludwig Bieberbach\n's father was Eberhard Sebastian Bieberbach\n(1848\n-\n1943)\n, who was a medical doctor, and his mother was Karoline\n(\nLina\n)\nLudwig, the daughter of Georg Ludwig who was also a medical doctor. Georg Ludwig was the director of the mental hospital in Heppenheim, founded in\n1866\n, and in\n1897\nhis son-in-law Eberhard Bieberbach took over from him as director of the mental hospital. The Bieberbach family was well-off and, up to the age of eleven, Ludwig was taught by private tutors. In\n1905\nhe entered the Humanistic\nGymnasium\nin Bensheim, a town very close to Heppenheim. Ludwig became interested in mathematics when studying at this Gymnasium, inspired by an excellent mathematics teacher. After completing his studies at the Gymnasium in\n1905\nand being awarded a certificate for university entrance, he undertook military service for a year\n(1905\n-\n06)\nstationed in Heidelberg. While he was on his military service, he attended a course of lectures on the theory of functions given by\nLeo Königsberger\nat the University of Heidelberg and was enthused both by the material and by the high quality of\nKönigsberger\n's lecturing. Bieberbach decided to look at the list of announcements of mathematics courses given in different universities which appeared in the Jahresbericht der\nDeutschen Mathematiker-Vereinigung\nand, after studying the possibilities, decided that\nHermann Minkowski\n's course on 'Invariant theory' at the University of Göttingen looked the most attractive. Although Göttingen was the leading centre for mathematics at this time, that was not the reason Bieberbach chose to go there, for he was totally unaware of its reputation when he made his decision.\nAt Göttingen there was an enthusiastic atmosphere for research which had a great influence on Bieberbach. He attended the algebra course by\nMinkowski\nwhich had brought him there, but he was influenced even more strongly by\nFelix Klein\nand his lectures on\nelliptic functions\n. Another strong influence on the direction of Bieberbach's mathematical interests came from\nPaul Koebe\nwho was only four years older than Bieberbach.\nKoebe\n, an expert on complex function theory, become a\ndozent\nat Göttingen in\n1907\nand also encouraged Bieberbach towards analysis. It was under\nKlein\n's direction that Bieberbach researched into automorphic functions for his doctorate which was awarded in\n1910\nfor his thesis\nZur Theorie der automorphen Funktionen\nⓉ\n(\nOn the theory of automorphic functions\n)\n. Another of the dozents at Göttingen was\nErnst Zermelo\nand in\n1910\nhe was chosen to fill the professorship at Zürich left vacant when\nErhard Schmidt\nmoved to Erlangen. He was allowed to appoint a young mathematician to assist him, and he asked Bieberbach if he would go to Zürich with him. Already Bieberbach had gained a reputation for his contribution to one of\nHilbert\n's problems.\nThe first part of\nHilbert\n's eighteenth problem asks whether there are only finitely many essentially different space groups in\nn\nn\nn\n-dimensional Euclidean space.\nArthur Schönflies\nhad been asked by\nKlein\nin the late\n1880\ns to investigate the crystallographic space groups and he had classified those in dimensions\n2\nand\n3\nin\n1891\n. In\n1908\n, while Bieberbach was\nKlein\n's research student, he had been asked by\nKlein\nto give lectures on\nSchönflies\n's results. From that time on he became interested in answering the first part of\nHilbert\n's eighteenth problem, namely generalising\nSchönflies\n's results to\nn\nn\nn\ndimensions,\nn\n≥\n4.\nn ≥ 4.\nn\n≥\n4\n.\nHe succeeded in\n1910\nand in that year announced his result with a sketch of the proof. Soon after he arrived in Zürich, Bieberbach left to go to the University of Königsberg where\nSchönflies\n, who was the professor there, had arranged a teaching position for him. There he worked out the details of his solution to the first part of\nHilbert\n's eighteenth problem publishing them in two papers\nÜber die Bewegungsgruppen der Euklidischen Räume\nⓉ\n(\nThe groups of movements of Euclidean spaces\n)\n(1911\n,\n1912)\n. He submitted this work to Zürich as his\nhabilitation\nthesis in\n1911\n. Answering a question from\nHilbert\n's famous collection certainly gave the young Bieberbach an international reputation.\nBieberbach was appointed professor of mathematics in Basel in Switzerland in\n1913\nand gave an inaugural address\nÜber die Grundlagen der modernen Mathematik\nⓉ\n(\nOn the foundations of modern mathematics\n)\non the foundations of mathematics. In the following year, on\n25\nMarch, he married Johanna\n(\nHannah\n)\nFriederike Stoermer\n(1882\n-\n1955)\n; they had four sons, Georg Ludwig\n(\nborn\n1915)\n, Joachim\n(\nborn\n1916)\n, Ulrich\n(\nborn\n1918)\nand Ruprecht\n(\nborn\n1922)\n. By the time their first son Georg Ludwig was born, on\n29\nOctober, Bieberbach had moved to Frankfurt am Main where he had been appointed to the second chair at the new university.\nSchönflies\nwho had been appointed to the first chair of mathematics at Frankfurt am Main in\n1914\n, the year that the university opened, strongly supported Bieberbach for the second chair. He had also been supported by\nGeorg Frobenius\nwho described him as\n[\n1\n]\n:-\n... someone who attacks, with his unusual mathematical acuity, always the deepest and most difficult problems, and might be the most sharp-witted and penetrating thinker of his generation.\nOne has to add that\nFrobenius\nhad a very close knowledge of Bieberbach's work for he too had studied the first part of\nHilbert\n's eighteenth problem, had simplified Bieberbach's first paper on the topic, and had produced ideas which had led Bieberbach to further results. Prior to his appointment, in\n1914\nBieberbach had studied the polynomials that are now named after him, which approximate a function that conformally maps a given simply-connected domain onto a disc. Of course World War I began in July of\n1914\nbut, although Bieberbach had done military training ten years earlier, he was not called for military service being unfit on health grounds. It was while Bieberbach was at Frankfurt that he produced the\nBieberbach Conjecture\nfor which he is best known today. The Conjecture, which appears as a footnote in his\n1916\npaper\nÜber die Koeffizienten derjenigen Potenzreihen, welche eine schlichte Abbildung des Einheitskreises vermitteln\nⓉ\n(\nOn the coefficients of those power series which represent a simple mapping of the unit circle\n)\nstates a necessary condition on a\nholomorphic\nfunction to map the open unit disk of the complex plane injectively to the complex plane. More precisely, he conjectured that if\nf\n(\nz\n)\n=\na\n0\n+\na\n1\nz\n+\na\n2\nz\n2\n+\n.\n.\n.\nf (z) = a_{0} + a_{1}z + a_{2}z^{2} + ...\nf\n(\nz\n)\n=\na\n0\n​\n+\na\n1\n​\nz\n+\na\n2\n​\nz\n2\n+\n.\n.\n.\nis a\nconformal mapping\nof a unit disk on any domain and\na\n0\n=\n0\n,\na\n1\n=\n1\na_{0} = 0, a_{1} = 1\na\n0\n​\n=\n0\n,\na\n1\n​\n=\n1\n, then\n∣\na\nn\n∣\n≤\nn\n|a_{n}|  ≤ n\n∣\na\nn\n​\n∣\n≤\nn\n. In the\n1916\npaper Bieberbach showed that\n∣\na\n2\n∣\n≤\n2\n|a_{2}| ≤ 2\n∣\na\n2\n​\n∣\n≤\n2\n, and\nCharles Loewner\nshowed\n∣\na\n3\n∣\n≤\n3\n|a_{3}| ≤ 3\n∣\na\n3\n​\n∣\n≤\n3\nin\n1923\n. When\nLoewner\ndid this Bieberbach told him he had joined the \"realm of the immortals\". After many years of slow but steady progress, the Conjecture was finally proved by\nLouis de Branges\nin\n1985\n. Certainly around the time he made his conjecture, there is considerable evidence that Bieberbach was not greatly liked as a person since he thought so highly of himself. A nice comment in a letter\nAlbert Einstein\nwrote to\nMax Born\nin\n1919\nsays\n[\n8\n]\n:-\nHerr Bieberbach's love and admiration for himself and his muse is most delightful.\nHowever, he continued to increase his influence in German mathematics, becoming secretary of the\nDeutschen Mathematiker-Vereinigung\n(\nGerman Mathematical Society\n)\nin\n1920\nand having his article\nNew investigations concerning Functions of a Complex Variable\npublished in the\nEncyklopädie der Mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\n.\nFrobenius\ndied in\n1917\nfollowing which his chair at the University of Berlin was filled by\nConstantin Carathéodory\n. However,\nCarathéodory\nleft in\n1919\nand again the chair became vacant. The first four mathematicians to be offered the chair\n(\nBrouwer\n,\nWeyl\n,\nHerglotz\nand\nHecke\n)\nall turned it down. A new attempt to fill the chair produced two leading contenders,\nWilhelm Blaschke\nand Bieberbach, although the Faculty's strong support for Bieberbach also showed slight doubts\n[\n1\n]\n:-\nIf also his exposition now and then shows lack of desirable care, this is far outweighed by the liveliness of his scientific initiative and the large-scale range of his investigations.\nOn\n2\nJanuary\n1921\nBieberbach accepted the Berlin professorship, delighted to hold a chair held by\nFrobenius\nfor many years. He took up this eminent chair of geometry on\n1\nApril\n1921\n. After this appointment Bieberbach's research contribution was somewhat reduced, with perhaps his most significant being joint work with\nIssai Schur\n, published in\n1928\n,\nÜber die Minkowskische Reduktiontheorie der positiven quadratischen Formen\nⓉ\n(\nOn the Minkowski reduction theory of positive quadratic forms\n)\n. At Berlin he acquired a reputation as an inspiring but rather disorganised teacher, perhaps reflecting the doubt already expressed by the Faculty.\nThe conversion of Bieberbach to the Nazi cause seems to have been quite sudden. On\n30\nJanuary\n1933\nHitler came to power and on\n1\nApril there was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter the university. Hirsch writes in\n[\n4\n]\n:-\nEveryone who was there had to make a little speech about the rejuvenation of Germany etc. And Bieberbach did this quite nicely and then he said \"A drop of remorse falls into my joy because my dear friend and colleague\nSchur\nis not allowed to be with us today.\"\nHowever, soon after this Bieberbach was converted to the views of the Nazis and energetically persecuted his Jewish colleagues. On\n7\nApril\n1933\nthe Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Bieberbach, together with his four sons, showed their support for the Nazi cause by taking part in an SA march from Potsdam to Berlin. By November\n1933\n, when he acted as one of\nWalter Ledermann\n's examiners, Bieberbach was wearing Nazi uniform when conducting the examination. Also at this time he was teaching a course entitled\nGreat German mathematicians, a race-theoretic approach\nand these lectures formed the basis for three papers he published on the topic. Bieberbach developed the notion of a 'German' synthetic style mathematics as opposed to the abstract 'Jewish' analytic style. He founded a journal\nDeutsche Mathematik\nto encourage this German style in mathematics but, happily, the journal failed in\n1943\n. His behaviour from\n1933\nonwards was to make political criteria completely override his mathematical judgement. For example\n[\n8\n]\n:-\nIt also seems characteristic of Bieberbach's handling of things that a number of very talented young mathematicians - like\nCollatz\n,\nGrunsky\n, Rinow, and Wielandt - were not given regular positions at the Institute.\nIn\n1934\nEdmund Landau\nwas dismissed from his post at Göttingen. By this time Bieberbach was strongly in favour of such actions against Jewish mathematicians. He wrote\n[\n7\n]\n:-\nA few months ago differences with the Göttingen student body ended the teaching activities of Herr\nLandau\n. ... This should be seen as a prime example of the fact that representatives of overly different races do not mix as students and teachers. ... The instincts of the Göttingen students felt that\nLandau\nwas a type who handled things in an un-German manner.\nBieberbach was managing editor of the Jahresbericht der\nDeutschen Mathematiker-Vereinigung\nin\n1934\nand he published an \"open letter\" in the journal which was highly critical of\nHarald Bohr\nbecause he had attacked Bieberbach's racist views. Since the letter had been published by Bieberbach without him having obtained approval from the other editors, the\nDeutschen Mathematiker-Vereinigung\nwas critical of his actions and Bieberbach was forced to resign his editorial position.\nOn\n7\nApril\n1938\nSchur\nwas forced to resign from the Commissions of the\nBerlin Academy of Sciences\nafter Bieberbach had written\n(\non\n29\nMarch\n)\n:-\nI find it surprising that Jews are still members of academic commissions.\nHelmut Grunsky\n, who was a doctoral student of Bieberbach's in\n1932\n, became editor of the\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nin the mid-\n1930\ns. He resisted pressure put on him by Bieberbach not to use Jewish referees. At the beginning of\n1938\nBieberbach wrote to\nGrunsky\n:-\nAbove all, may you finally dismiss the Jews from your staff in the New Year. ... I emphasise again that your staff of referees must be in accordance with the regulations which have been obligatory to all Germans since\n30\nJanuary\n1933\n. ... You see how your conduct harms the good reputation of the Academy.\nBieberbach wrote many papers expressing his racist views.\nGrunsky\nwrote the obituary\n[\n2\n]\nof Bieberbach, yet in this article he does not mention Bieberbach's ideological papers at all. Many mathematicians feel that Bieberbach could not have honestly held the views he did, rather the feeling is that he was ambitious to become the leader of German mathematics and followed a route which he thought would make him successful in this. Schappacher writes\n[\n8\n]\n:-\n... three basic conflicts merged ... the question of how much openness to international mathematical relations was adequate for German mathematicians after years of postwar isolation and ill feelings; the longstanding rivalry between Berlin and Göttingen, and the debate about intuitionism vs. formalism ... In this perspective, Bieberbach's sudden conversion to Nazism appears as the attempt to replay the old battle, taking advantage of the new distribution of power in Germany.\nAfter the end of World War II in\n1945\nBieberbach lost all his positions because of his political involvement, being dismissed and arrested. Despite this\nAlexander Ostrowski\ninvited him to lecture at Basel University in\n1949\n.\nOstrowski\nrespected Bieberbach's contribution as a mathematician, and considered his political views were irrelevant to his remarkable contributions to mathematics. Many were critical of\nOstrowski\nfor making this invitation to Bieberbach. Perhaps there is an irony in the fact that\nde Branges\nbecame the first winner of the\nOstrowski\nPrize for solving the\nBieberbach conjecture\n. In\n1951\nBieberbach and Friedrich Wilhelm Levi were on a list to fill the second chair in Berlin. Both were in their\n60\ns but had very different wartime experiences, Levi having been dismissed from the University of Leipzig in\n1935\nbecause he was Jewish, and Bieberbach having been the leading Nazi mathematician. Perhaps only one outcome was possible in the circumstances - Friedrich Levi was appointed.\nIn\n[\n3\n]\nGrunsky\ngives a list of\n137\npapers and books by Bieberbach, and a list of\n17\nstudents whose doctorates he supervised before his dismissal in\n1945\nincluding\nWilhelm Süss\n(1920)\nand\nHelmut Grunsky\n(1932)\n. The books have been particularly influential and we should indicate the range of topics they cover. His first book was\nEinführung in die konforme Abbildung\nⓉ\n(\nIntroduction to conformal mapping\n)\n(1915)\nwhich went through many editions\n(\nfourth edition\n1949\n, English translation as 'Conformal mapping' in\n1953\n, new updated German edition\n1967)\n. This work was followed by\nDifferentialrechnung\nⓉ\n(\nDifferential calculus\n)\n(1917)\n,\nIntegralrechnung\nⓉ\n(\nIntegral calculus\n)\n(1918)\n,\nLehrbuch der Funktionentheorie. I. Elemente der Funktionentheorie\nⓉ\n(\nTextbook of complex analysis. I. Elements of complex analysis\n)\n(1921)\n,\nFunktionentheorie\nⓉ\n(\nComplex analysis\n)\n(1922)\n,\nTheorie der Differentialgleichungen\nⓉ\n(\nTheory of differential equations\n)\n(1923)\n,\nLehrbuch der Funktionentheorie. II. Moderne Funktionentheorie\nⓉ\n(\nTextbook of complex analysis. II. Modern complex analysis\n)\n(1926)\n,\nVorlesungen über Algebra\nⓉ\n(\nLectures on Algebra\n)\n(1928)\n,\nAnalytische Geometrie\nⓉ\n(\nAnalytical Geometry\n)\n(1930)\n,\nProjektive Geometrie\nⓉ\n(\nProjective geometry\n)\n(1931)\n,\nDifferentialgeometrie\nⓉ\n(\nDifferential geometry\n)\n(1932)\n,\nEinleitung in die höhere Geometrie\nⓉ\n(\nIntroduction to higher geometry\n)\n(1933)\n,\nCarl Friedrich Gauss. Ein deutsches Gelehrtenleben\nⓉ\n(\nCarl Friedrich Gauss: a life of a German scholar\n)\n(1938)\n, and\nGalilei und die Inquisition\nⓉ\n(\nGalileo and the inquisition\n)\n(1938)\n. All these works went through several editions in which Bieberbach added further material.\nAfter Bieberbach was dismissed following the end of World War II, he continued to produce excellent books such as\nTheorie der geometrischen Konstruktionen\nⓉ\n(\nTheory of geometric constructions\n)\n(1952)\n\"The style is clear and lively\",\nTheorie der gewöhnlichen Differentialgleichungen auf funktionentheoretischer Grundlage dargestellt\nⓉ\n(\nTheory of ordinary differential equations on functional theoretical basis\n)\n(1953)\n\"written in the author's well-known lively\n(\nand sometimes snappy\n)\nstyle, and it makes good reading. Considerable care has been devoted to the simplification of known proofs and to the detailed discussion of phenomena which usually are given but casual attention\",\nAnalytische Fortsetzung\nⓉ\n(\nAnalytical continuation\n)\n(1955)\n\"No mathematician who is interested in the\nTaylor series\n, in interpolatory theory, or in the study of the singularities of analytic functions, can afford to be without it\", and\nEinführung in die Theorie der Differentialgleichungen im reellen Gebiet\nⓉ\n(\nIntroduction to the theory of differential equations in the real area\n)\n(1956)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}