{
  "nome_completo": "Luigi Brusotti",
  "nome_curto": "Luigi Brusotti",
  "ano_nascimento": "1877",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brusotti/",
  "lugar_nascimento": "Pavia, Italy",
  "lugar_morte": "Padua, Italy",
  "biografia": "Luigi Brusotti\n's parents were Ferdinando Luigi Carlo Magno Brusotti and Camilla Maria Antonia Lucia Franchi. Ferdinando Brusotti, born in Rosasco on\n5\nNovember\n1839\n, studied engineering at Turin to please his family although he had wanted to study physics. Graduating in\n1864\nhe was appointed to the University of Pavia in the following year. Except for a short time when he lectured in Rome, he spent the rest of his career at Pavia. Ferdinando and Camilla Brusotti were married in\n1874\nand had two children, Marina born in\n1875\nand Luigi, the subject of this biography, born in\n1877\n. Marina\n(1875\n-\n1967)\nmarried Vittorio Gallo. Ferdinando, Luigi's father, retired in\n1895\nand died on\n29\nDecember\n1899\n. He is most famed as an inventor, laying a telephone line from Pavia to Lomello in\n1874\n, and inventing the electric light bulb in\n1877\n, two years before Thomas Edison. When he learnt of Edison's work on the light bulb he abandoned his project in\n1879\n. He published\nLa velocità molecolare dei gas e la corrispondente velocità del suono\nⓉ\n(\nThe molecular velocity of the gases and the corresponding speed of sound\n)\nin\n1877\n. Luigi was, therefore, born into a family where research, inventions and physics were part of life\n[\n2\n]\n:-\nLuigi Brusotti did not lack reasons to attract him towards difficult mathematics, which, in the wide circle of his relatives, he, although young, could feel the powerful influence emanating from the impressive figure of\nFelice Casorati\n.\nFelice Casorati\nwas professor of mathematics at Pavia when Luigi Brusotti was born and continued until his death in\n1890\n. At the 'Ugo Foscolo' high school in Pavia Brusotti was taught mathematics by Pilo Predella and\nLuigi Berzolari\n. The High School was named for Ugo Foscolo\n(1778\n-\n1827)\na famous Italian writer and poet. It specialised in a classical education and indeed Brusotti proved an exceptional student of classical studies. However, he was strongly influenced by his mathematics teachers, particularly\nBerzolari\nwho, in addition to teaching at the school, lectured at the University of Pavia. Seeing that his young pupil was talented in mathematics,\nBerzolari\nstrongly encouraged him and introduced him to advanced topics.\nAfter graduating from the 'Ugo Foscolo' high school, Brusotti enrolled at the University of Pavia. In his final year he worked on a geometry dissertation advised by Ferdinando Aschieri\n(1844\n-\n1907)\n. Aschieri had been born in Modena and graduated from the University of Pisa in\n1867\nhaving been a pupil of\nEugenio Beltrami\n. He taught at the Liceo in Parma and the Technical Institute of Pavia, before being appointed to the University of Pavia in\n1875\n. He was promoted to full professor on\n1884\n. At Pavia he taught descriptive geometry, projective geometry and higher geometry. Brusotti's dissertation, supervised by Aschieri, was of high quality but it did not result in publications since the results had been independently discovered and published by others. In addition to attending courses delivered by Ferdinando Aschieri, Brusotti had attended courses by\nLuigi Berzolari\nand\nErnesto Pascal\n.\nBrusotti graduated from the University of Pavia on\n10\nJuly\n1899\nwith honours in pure mathematics. He spent the following academic year,\n1999\n-\n1900\nin Pisa where he attended courses, both at the University and at the Scuola Normale Superiore, delivered by\nUlisse Dini\n,\nEugenio Bertini\nand\nLuigi Bianchi\n. After his year at Pisa, Brusotti returned to Pavia where he was an assistant to\nLuigi Berzolari\n, Carlo Formenti\n(1841\n-\n1918)\nand Ferdinando Aschieri. Formenti, a member of the Istituto Lombardo, was professor of rational mechanics at the University of Pavia. During the years\n1900\n-\n01\nand\n1901\n-\n02\nBrusotti was a voluntary assistant involved in exercise classes in algebraic analysis and analytical geometry. In\n1902\n-\n03\nhe was supported by a scholarship and taught rational mechanics. He continued to work as an assistant in\n1903\n-\n04\nand\n1904\n-\n05\nteaching algebraic analysis and analytical geometry as well as drawing in projective geometry and descriptive geometry. It was during these years when he was working as an assistant that Brusotti began publishing the results of his research.\nHis first papers were\nSopra alcune relazioni fra covarianti di terzo e quarto grado nei coefficienti di una forma binaria\nⓉ\n(\nOn some relationships between covariants of third and fourth degree in the coefficients of a binary form\n)\n(1902)\n,\nDimostrazione di un teorema di calcolo combinatorio\nⓉ\n(\nDemonstration of a combinatorial theorem\n)\n(1903)\n, and\nSulla curva razionale normale dello spazio a quattro dimensioni\nⓉ\n(\nOn  normal rational curves of the four-dimensional space\n)\n(1904)\n. For a list of\n91\nof Brusotti's publications see\nTHIS LINK\n.\nEugenio Togliatti\nwrites that the papers he published between\n1902\nand\n1909\n[\n3\n]\n:-\n... in line with the scientific orientation of his teacher\nL Berzolari\n, concern the invariant theory of algebraic forms, especially binary forms, with their geometric applications, a field of study very much cultivated at the time and to which he brought considerable and comprehensive contributions.\nIn\n1906\nBrusotti left university teaching and, for a twenty years, he taught mathematics in secondary schools. He taught in the high schools of Foggia, Como, Sondrio, the \"Berchet\" high school in Milan and at the Technical Institute in Pavia. In Brusotti these institutions\n[\n2\n]\n:-\n... had a high-prestige teacher, a zealous and loving teacher, a very effective educator everywhere, but especially in Sondrio, at the \"Berchet\" in Milan and at the Technical Institute of Pavia, where he remained longer. He left a very grateful persistent memory. Nor did he miss out on official acknowledgments, since he enjoyed two career advancements for distinguished merit, won three special competitions, had inspection duties in middle schools, and was enrolled in the role of honour.\nOn\n6\nMay\n1910\nBrusotti returned to the University of Pavia when he was appointed as a Lecturer teaching analytical geometry. He continued in this role then later in some years he taught higher geometry while in others it was complementary mathematics or analytical geometry. During this period, as well as his university duties he continued to teach at the Technical Institute in Pavia. On\n1\nMarch\n1926\nhe won a contest to become ordinary tenured professor of descriptive geometry at the University of Cagliari, becoming a full professor in the following year. He then changed to become professor of analytic and projective geometry. After two years at Cagliari, he succeeded\nLuigi Bianchi\n, who died in June\n1928\n, when he was appointed to the chair of analytic geometry at the University of Pisa. He remained at Pisa for three years before returning to his home town of Pavia when he was appointed as Professor of Projective and Descriptive Geometry with Drawing. In\n1937\nhe moved to the chair of Higher Geometry. In\n1947\nhe reached the age of\n70\nbut continued to teach at Pavia as a non-tenured professor. In\n1952\nhe reached the age of\n75\nand he retired being appointed as professor emeritus at this time. The following paragraph is based on\n[\n3\n]\nbut we have added a few further details:-\nHis great talent as a scientist, as a teacher and as a man had noteworthy recognitions: he was director of the Mathematical Institute of Pavia from\n1931\nto\n1953\n; president of the Italian Society of Physical and Mathematical Sciences \"Mathesis\" from\n1954\nto\n1957\n; a corresponding member of the Istituto Lombardo di Scienze e Lettere from\n1932\nto\n1940\nwhen he became a full member; a corresponding member of the\nAccademia dei Lincei\nfrom\n1954\nand of the Società delle scienze di Liège from\n1954\n; a member of the Italian Commission for the teaching of mathematics\n(1936\n-\n38)\n; and awarded the Gold Medal for Merit in Education, Culture and Arts in\n1958\n. At the University of Pavia he is remembered with a commemorative plaque at the Institute of Mathematics.\nRegarding his mathematical research, we follow\n[\n3\n]\nwhich is Andrea Mariani's translation of\n[\n4\n]\n:-\nFrom\n1910\nonwards, his scientific activity was predominantly directed towards the so-called \"questions of reality\" of algebraic geometry in the projective orientation. The algebraic entities were much studied at the time in the complex field, but, even though their consideration from the real point of view was not neglected, there were a lot of open questions with no easy solutions. In this area of work Brusotti has, in almost fifty years of activity, brought an impressive contribution of new results, consisting of a true body of theory, hinged on the so-called \"method of small variation,\" which has brought him fame in Italy and abroad.\nHis papers on this topic include\nSulle curve piane algebriche reali prive di punti reali\nⓉ\n(\nOn real algebraic plane curves without real points\n)\n(1919)\n,\nSui centri critici di un fascio reale di curve algebriche\nⓉ\n(\nOn the critical centers of a real bundle of algebraic curves\n)\n(1921)\n,\nSulla curva completa intersezione di due superficie algebriche reali\nⓉ\n(\nOn the complete intersection curve of two real algebraic surfaces\n)\n(1928)\n, and\nFasci reali di curve algebriche sopra una quadrica reale\nⓉ\n(\nReal bundles of algebraic curves over a real quadrice\n)\n(1938\n-\n39)\n. For a list with many more of these publications, see\nTHIS LINK\n.\nBut Brusotti wrote on other topics in addition to the main thrust of his research which we mentioned above\n[\n3\n]\n:-\nOther writings are dedicated to questions of analysis, of projective differential geometry; others have a historical and critical character or didactic and methodological; still others are commemorations and reviews; finally three fine articles in the \"Enciclopedia delle matematiche elementari\"\nⓉ\n(\nEncyclopaedia of elementary mathematics\n)\ndeserve a special mention. These are on \"measure theory\"\n(\nII, p.\n119\n-\n174)\n, \"polygons and polyhedrons\"\n(\nII, p.\n255\n-\n322)\n, \"didactic questions\"\n(\nIII, p.\n885\n-\n973)\n, also noteworthy for both the quantity and the precision of their bibliographic information.\nBrusotti died in\n1959\nand, following his death, his sister Marina Gallo decided to donate Brusotti's personal library to the Institute of Mathematics of the University of Pavia. The Faculty was delighted to accept the gift, considering its remarkable value and the relevance of both the books and the archival material. The official acceptance took place in November\n1959\n. The complete donation includes the entire private holdings of Brusotti:\n4\nbookcases containing about\n600\nbooks, of which about\n130\nare antique works, and some furnishings that allow the original arrangement of the private library to be maintained. The collection includes texts on mathematics and engineering, natural and agricultural sciences, literary classics, historical editions of the Bible, as well as numerous volumes of periodicals, mostly from the early decades of the twentieth century, and a substantial archive\n(\nnot yet catalogued\n)\nwhich includes photographs, letters, portraits, etc., several handwritten notebooks of Brusotti when a student\n(\nwhich include very accurate notes of courses he followed\n)\nand notebooks containing the lectures he gave as a professor, as well as manuscripts of his father Ferdinando and other Italian mathematicians.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Combinatorics",
    "Geometry",
    "Logic"
  ]
}