{
  "nome_completo": "Luigi Bianchi",
  "nome_curto": "Luigi Bianchi",
  "ano_nascimento": "1856",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bianchi/",
  "lugar_nascimento": "Parma (now Italy)",
  "lugar_morte": "Pisa, Italy",
  "biografia": "Luigi Bianchi\n's father was Francesco Saverio Bianchi who had been born on\n24\nNovember\n1827\nat Piacenza. Saverio Bianchi had studied law at the University of Parma, graduating in July\n1848\n. His eldest son, Ferdinando, had been born at Parma on\n6\nAugust\n1854\n. In January\n1856\nhis second son, Luigi\n(\nthe subject of this biography\n)\nwas born at Parma and later in the same year Saverio was appointed Professor of Civil Law at the University of Parma. Ferdinando and Luigi grew up in one of the leading families of the city of Parma for Saverio not only held important positions in the University\n(\nfor example Dean of the Faculty of Law from\n1868\nto\n1873)\nbut he also held many public positions. He was elected city councilor and then mayor of Parma in\n1869\nand was for many years chairman of the Provincial Council and president of the Civic Hospice.\nLuigi Bianchi was educated at a school in Parma as was his elder brother Ferdinando who followed his father into the legal profession studying civil law. Luigi, however, was attracted to mathematics and he took the competitive entrance examinations for the Scuola Normale Superiore of Pisa in November\n1873\n. In fact not only did Luigi leave Parma in\n1873\n, but so did his father who was named to the chair of Civil Law at the University of Siena in this year. At the University of Pisa, Luigi Bianchi studied under\nEnrico Betti\nand\nUlisse Dini\nand graduated with the highest distinction from Pisa on\n30\nNovember\n1877\n. He completed a doctoral dissertation on applicable surfaces. He then continued his research at a number of universities throughout Europe, first at Pisa where he remained until\n1879\n, then at Munich and finally at Göttingen where he studied with\nFelix Klein\n[\n17\n]\n:-\nIn\n1879\nappeared a paper on the centro-surface of a helicoid in the Giornale di Matematiche; and from that time onwards until shortly before his death a series of papers of first-rate merit appeared each year from his prolific pen in spite of the many distractions caused by domestic troubles, the duties of his professorship, and his labours as an editor.\nAfter his return to Italy in\n1881\n, Bianchi was appointed to a professorship at the Scuola Normale Superiore at Pisa. He taught\ndifferential geometry\nat the University of Pisa where he was promoted a number of times, first to extraordinary professor in differential geometry, then after a competitive examination to extraordinary professor in\nprojective geometry\nin\n1886\n. Also in\n1886\nhe married; the Bianchi's had five sons. In the same year he was also appointed as extraordinary professor of analytic geometry, becoming a full professor of analytic geometry in\n1890\n. We note that his father Saverio Bianchi left the academic world in\n1880\nwhen he moved to the judiciary as an advisor of the Court of Cassation of Turin, a position he held until\n1882\nafter which he became an advisor of the Court of Cassation in Rome. When Saverio Bianchi resigned his chair at Siena in\n1880\n, Luigi's brother Ferdinando was appointed as his successor.\nLuigi Bianchi made important contributions to differential geometry. He discovered all the geometries of\nRiemann\nthat allow a continuous\ngroup\nof transformations. His work on\nnon-euclidean\ngeometries was used by\nEinstein\nin his general theory of relativity.\nDirk Struik\ngives the following overview of Bianchi's mathematical contributions\n[\n18\n]\n:-\nBianchi's productive career begins with the applicability of surfaces\n(1878)\nand in rapid succession follow papes on surfaces of constant curvature, orthogonal surfaces,\nWeingarten\nsurfaces, minimal surfaces, and congruences. Bianchi also turns to non-Euclidean geometry, taking up the ideas of\nBeltrami\n; the surfaces of curvature zero in such geometry draw his special attention. Following Bäcklund he invents transformations to pass from one set of surfaces of special character to another. In the work of ... Bianchi partial differential equations play an important role. ... The principal fame of\nDarboux\nand Bianchi lies in their beautiful textbooks, in which they combine their on results with those of their predecessors. Bianchi's 'Lezioni di geometria differenziale'\nⓉ\n(\nLectures on differential geometry\n)\n(1893)\n, a new edition of autographed lectures published in\n1886\n, is a systematic treatise of the theory of curves and surfaces, with special attention paid to more-dimensional geometry. It became known in wider circles through the German translation of M Lukat\n(1899)\n.\nBianchi's mathematical contributions are also described by Hilton in\n[\n17\n]\n. He writes:-\nThe greater part of\n[\nhis early\n]\nwork is on the properties of surfaces. His methods were based on the theory of the two fundamental differential\nquadratic form\nof\nGauss\n. ... he never published anything which did not contain a real contribution to knowledge. Other subjects which attracted him at time were\nLie\n's theory of continuous groups and the theory of groups of substitutions of the type x' =\n(\nax + b\n)\n/\n(\ncx + d\n)\n. But even while he was writing on these topics, papers on surfaces were still appearing, and differential geometry absorbed nearly all his attention for the last twelve years or so of his life.\nPerhaps Bianchi's most famous paper was the\n92\n-page\nOn the three-dimensional spaces which admit a continuous group of motions\npublished in\n1897\n. This importance of this paper can be judged from the fact that an English translation was published as recently as\n2002\n. The original paper was reviewed several times. Here is the review written by\nGino Loria\n:-\nAn\nn\nn\nn\n-dimensional space\nR\nn\n\\mathbb{R}^{n}\nR\nn\nis completely defined by the square of its line element\nd\ns\n2\n=\n.\n.\n.\nds^{2}  = ...\nd\ns\n2\n=\n.\n.\n.\n. In particular, with the help of this line element, one can solve all applicability problems of\nR\nn\n\\mathbb{R}^{n}\nR\nn\nonto itself, i.e., the problem of motions in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n. The author restricts himself to the spaces possessing continuous motions. Such motions form a group depending on the finite number r of parameters. This group contains a continuous group\nG\nr\nG_{r}\nG\nr\n​\ndefined by r infinitesimal transformations\nX\n1\nf\n,\n.\n.\n.\n,\nX\nr\nf\nX_{1}f, ... , X_{r} f\nX\n1\n​\nf\n,\n.\n.\n.\n,\nX\nr\n​\nf\n. The problem of finding spaces possessing a continuous group of motions is identical to the problem of finding all possible\nd\ns\n2\nds^{2}\nd\ns\n2\nadmitting a group\nG\nr\n=\n[\nX\n1\nf\n,\n.\n.\n.\n,\nX\nr\nf\n]\nG_{r} = [X_{1} f, ... , X_{r} f]\nG\nr\n​\n=\n[\nX\n1\n​\nf\n,\n.\n.\n.\n,\nX\nr\n​\nf\n]\nof transformations. Although the formulas for solving this problem were essentially given already by\nW Killing\n(1892)\n, and\nLie\n, it was still not completely solved. As preparation for the general solution, the author applies the\nLie\n-\nKilling\nmethods for finding all three-dimensional spaces in which the motions of figures with given degrees of freedom are possible - this is enough to outline the goal and the general train of thought of Bianchi's work. The importance of his results is known to every reader who is familiar with the awards of the Royal Jablonowski Society for\n1901\n; their citation states that the strength of the methods and the elegance of the solutions need not be pointed out when we are talking about a paper whose author is Bianchi.\nBianchi wrote a number of influential treatises which\n[\n17\n]\n:-\n... show him to be not only a scientific genius but also a master of clear and attractive style.\nIn particular he wrote:\nLezioni di geometria differenziale\nⓉ\n(\nLectures on differential geometry\n)\n(1886)\n;\nLezioni sulla teoria dei gruppi di sostituzioni e delle equazioni algebriche secondo Galois\nⓉ\n(\nLectures on the theory of groups of substitutions of algebraic equations according to Galois\n)\n(1900)\n;\nLezioni sulla teoria aritmetica delle forme quadratiche binarie e ternarie\nⓉ\n(\nLectures on the arithmetic theory of binary and ternary quadratic forms\n)\n(1912)\n;\nLezionidi geometria analitica\nⓉ\n(\nLectures on analytic geometry\n)\n(1915)\n;\nLezioni sulla teoria delle funzioni di variabile complessa e delle funzioni ellittiche\nⓉ\n(\nLectures on the theory of complex variable functions and elliptic functions\n)\n(1916)\n;\nLezioni sulla teoria dei gruppi continui finiti di trasformazioni\nⓉ\n(\nLectures on the theory of finite continuous groups of transformations\n)\n(1918)\n; and\nLezioni sulla teoria dei numeri algebrici e principii di geometria analitica\nⓉ\n(\nLectures on the theory of algebraic numbers and analytic geometry principles\n)\n(1923)\n. Hilton writes\n[\n17\n]\n:-\nFor so prolific a writer the standard was extraordinarily high; he never published anything which did not contain a real contribution to knowledge.\nWe should also mention his editorial duties as an editor of\nAnnali di Matematica pura ed applicata\n. During his time as editor other mathematicians who shared the editorial duties with him include\nLuigi Cremona\n,\nUlisse Dini\n,\nCorrado Segre\n,\nSalvatore Pincherle\n,\nTullio Levi-Civita\nand\nFrancesco Severi\n.\nBianchi received many honours including being made a corresponding member of the\nAccademia dei Lincei\nin\n1887\nand a fellow of the Academy in\n1893\n. He became Senator of the Kingdom of Italy in\n1924\n. He was elected an honorary member of the\nLondon Mathematical Society\nand he was similarly honoured by many other Societies.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}