{
  "nome_completo": "Lyudmila Vsevolodovna Keldysh",
  "nome_curto": "Lyudmila Vsevolodovna Keldysh",
  "ano_nascimento": "1904",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keldysh_Lyudmila/",
  "lugar_nascimento": "Orenburg, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Lyudmila Vsevolodovna Keldysh\nwas born in Orenburg, a city in western Russia on the Ural River. Her father, Vsevolod Mikhailovich Keldysh\n(1878\n-\n1965)\n, was a military construction engineer who had graduated from the Polytechnic Institute in Riga. Vsevolod Mikhailovich married Mariya Aleksandrovna Skvortsova\n(1879\n-\n1953)\nin Riga. She devoted herself to bringing up their children. It is worth recording that, going back one more generation, Mariya Aleksandrovna's father was an artillery general, the son of a general, and so from the nobility. Vsevolod Mikhailovich's father was an army doctor with the rank of general so also from the nobility. This noble background presented some problems in post-Revolution Russia. The family were quite well off and, because of the nature of Vsevolod Mikhailovich's work, he travelled between many different towns. He lectured at several Technical Institutes and later was involved in the design and construction of the Moscow Metro and the Moscow-Volga canal. Lyudmila Vsevolodovna was the oldest of her parents seven children. All the children were taught German and French by their mother who also gave them a love of music. Of Lyudmila Vsevolodovna's six younger brothers and sisters we mention in particular\nMstislav Vsevolodovich Keldysh\n, born in Riga in\n1911\n, who became a famous mathematician and has a biography in this archive, and Yurii Vsevolodovich Keldysh who became a musicologist.\nLyudmila Vsevolodovna spent time in several different cities as the family moved around. They were in Helsinki in\n1905\nand St Petersburg in\n1907\n. By\n1909\nthey were in Riga where Vsevolod Mikhailovich lectured at the Polytechnic Institute. In\n1915\nthe German army invaded Latvia and the staff at the Riga Polytechnic Institute were evacuated to Moscow. The Keldysh family had no relations to help them in Moscow and they suffered considerable hardship. For several years they lived in Losinoostrovskaya, just outside the city, but since the parents loved classical music they often attended concerts in the city. After these concerts, they had no alternative but to make their way home on foot, a journey of several miles. Lyudmila recalled the difficult times in Losinoostrovskaya, remembering one day when her mother fed the whole family just fried onions, having no other food. She completed her school education in Ivanovo-Voznesensk, a city about\n250\nkm northeast of Moscow. The family had moved there towards the end of\n1918\nwhen Vsevolod Mikhailovich began teaching at the Polytechnic Institute - this Institute was joined to the Riga Polytechnic Institute. However, he often returned to Moscow to work on engineering projects.\nNikolai Nikolaevich Luzin\ngave a lecture in Ivanovo-Voznesensk which Lyudmila Keldysh and other high school pupils attended. This lecture firmly established in Keldysh's mind that she wanted to study mathematics and, if possible, become a professional mathematician like\nLuzin\n. He had been appointed as Professor of Pure Mathematics at Moscow State University in\n1917\nand, by the time he gave the lecture, had built an impressive research group with students\nP S Aleksandrov\n,\nM Ya Suslin\n,\nD E Menshov\nand\nA Ya Khinchin\n. Keldysh enrolled in the Physics and Mathematics Department at Moscow State University and graduated in\n1925\n. She had joined\nLuzin\n's research seminar in\n1923\n, the same year as\nPetr Sergeevich Novikov\njoined the research group. The authors of\n[\n4\n]\ndescribe Keldysh in the family's Moscow apartment\n(\nwhere they moved in\n1923)\n:-\nYoung people often gathered at the father's family home. They were mainly friends of the oldest daughter, Lyudmila, students and postdoctoral fellows, mathematicians, among whom were\nP S Novikov\n(\nher future husband\n)\n,\nP S Aleksandrov\n,\nA N Kolmogorov\n, I V Arnol'd\n(\nwho would become a known mathematician and the father of a future member of the Academy of Sciences\n)\nand others. There were also musicians, friends of the son Yurii. There were games, laughter, and serious conversations. The strong personality of Lyudmila Keldysh influenced the people around her. Her brother Mstislav, a future president of the Academy, followed her advice when he chose mathematics against the desire of his father that he should become a construction engineer, like his father.\nHer first important mathematical result did not appear in one of her own publications\n[\n11\n]\n:-\nHer name became known after her initial result, which was first published in\n1930\nin\nLuzin\n's lecture notes\n[\nLeçons sur les ensembles analytiques et leurs applications\nⓉ\n(\nLectures on analytic sets and their applications\n)\n(1930)]\n. This was a construction of an arithmetic example\n(\nusing\ncontinued fractions\n)\nof a set belonging to the fourth\nBorel\nclass. It was the first significant advance in the study of the\nBorel\nclassification since the first non-trivial example of a third-class set was given by\nBaire\nin\n1905\n.\nFrom\n1930\nto\n1934\nLyudmila Keldysh taught at the Moscow Aviation Institute. Her first son Leonid Veniaminovich Keldysh, from a first marriage, was born in April\n1931\n- he became a famous physicist and member of the\nUSSR Academy of Sciences\n. She continued working in\nLuzin\n's research group and also began working at the\nV A Steklov\nMathematical Institute of the\nUSSR Academy of Sciences\nas soon as it moved from St Petersburg to Moscow around\n1934\n. It was in\n1934\nthat her first papers were published:\nOn the Homeomorphism of Canonical Elements of the\n3\nrd\nClass\n;\nOn Simple Functions of Class a\n; and\nOn the Structure of B Measurable Functions of Class a\n. She married\nP S Novikov\n, her second marriage, in\n1935\nbut these were difficult years. Joseph Stalin had begun his attacks on the peasants in\n1928\nbut in\n1934\nhe launched an even more terrifying purge of party members whom he considered his rivals. Several members of Keldysh's family became victims - an uncle on her mother's side and his son were murdered. Her mother was arrested and her father was held for questioning in\n1935\nbut both were released. However, for a long time after this the family lived in fear, terrified if their doorbell rang in the evening. Over the next few years Keldysh and Novikov had two sons, Andrei Petrovich and Sergei Petrovich\n(\nborn\n1938)\n. Both became famous mathematicians but Andrei Petrovich, who was an expert in\nalgebraic number theory\n, died at a young age.\nSergei Petrovich Novikov\nwon a\nFields Medal\nand, naturally, has a biography in this archive.\nKeldysh continued to undertake research on the structure of\nBorel\nsets and in\n1941\nshe defended her doctoral thesis\nStructure of B-Sets\n(\nRussian\n)\n. This\n76\n-page thesis was published in\n1945\n, the delay being due to German invasion of Russia during World War II. Although World War II started in September\n1939\nwith the German invasion of Poland, this had little effect in Moscow. However, on\n22\nJune\n1941\nthe German armies invaded their former allies pushing rapidly east into Soviet lands. At first their main advance was aimed towards Moscow and evacuations took place. We give a fairly long quote from\n[\n4\n]\nwhere Keldysh's struggle over the next few years is vividly described:-\nOn the critical day of\n16\nOctober\n1941\n, she had to leave Moscow with her three sons. The oldest, Leonid ..., was ten years old and the youngest, Sergei, three. It was the last possibility to get on the train going eastward from Moscow\n(\nalthough nobody could tell to what town\n)\n. Only with the help of\nKolmogorov\n, who presented them as members of his own family, did they succeed at the last moment in finding room on the train carrying away the academic institutes. First they appeared in Gorkii, then several days later they arrived in Kazan on the Volga river. Here the evacuated institutes of the Academy of Sciences were settled. However, Keldysh and her children did not have the status of evacuees but only of refugees. They were without belongings, without warm clothes for the winter, without the guarantee of lodging, practically without any means to exist. They eventually found a roof over their heads: they were put up in the large gym of Kazan University together with several hundred similar refugees. A month later Novikov arrived in Kazan; he was ill and in grave condition. They were given a room in the hall of the student dormitory. Surgery was recommended for Novikov; the doctors were not sure about its outcome. Keldysh spent the next several months of the cold and hungry winter of\n1941\nand spring of\n1942\nbetween the room in the dormitory, where the children were awaiting her, and the hospital, where she nursed her husband. The distance was approximately\n10\nkm and there was no transportation in this district of Kazan. The daily ration per person was then\n300\ngrams of bread and a teaspoon of granulated sugar. The money in the family was only enough to buy a sack of coarse-ground rye flour at the market once a month. This flour, cooked in water and called zatirka, became the main meal of the family for the next two years. After they returned to Moscow, life got better little by little.\nAfter returning to Moscow, two daughters were born. The elder daughter was Nina, the younger being Elena who went on to study humanities and taught French and Portuguese at the Moscow State Institute of International Relations. The end of World War II marks a time of change of topic for Keldysh who moved from her research in set theory to look at more topological topics. First she published the paper\nSur la structure des ensembles mesurables B\nⓉ\n(\nOn the structure of measurable sets B\n)\n(1944)\nwhich summarised her very considerable contributions to the structure of sets of higher\nBorel\nclass. A Russian monograph published in\n1945\nalso gave a detailed description of the results she had obtained over several years concerning the classification of\nBorel\nsets in the space of irrational numbers lying in\n(0\n,\n1)\n. Then she published the paper\nOpen mappings of A-sets\n(\nRussian\n)\nin\n1945\nwhich in some sense bridges the gap between her set theoretical work and her topological research. Over the next few years she published papers such as\nContinuous Mappings of a Zero-Dimensional Compact Set\n(1947)\nand\nContinuous Mappings of a Segment onto an\nn\nn\nn\n-Dimensional Cube\n(1949)\n. This research, looking at\nPeano\ncurves, was motivated by a conjecture by\nPavel Sergeevich Aleksandrov\n, the head of the Moscow topology seminar.\nSergei Adian\nwrites in\n[\n2\n]\nabout Keldysh at this time:-\nAt home Lyudmila Vsevolodovna was a real homemaker. She successfully combined domestic concerns with her fruitful scientific work. There was a rare mutual understanding between them in all questions, scientific or worldly.\n[\nShe and her husband\nPetr Sergeevich Novikov\n]\nhad a very simple lifestyle in the family, no excesses, simple furniture, only interesting pictures on the walls, and warm human relations. Petr Sergeevich and Lyudmila Vsevolodovna were enthusiastic about literature, both Russian and foreign. After lunch or after supper, a relaxed discussion of new publications usually sprang up, often with the participation of guests.\nIn the late\n1950\ns Keldysh organised her famous seminar on geometric topology, concentrating in particular on topological embeddings, at the\nV A Steklov\nMathematical Institute. In\n1964\nshe was appointed as a professor at Moscow State University. She published the book\nTopological imbeddings into Euclidean space\n(\nRussian\n)\nin\n1966\nwhich she wrote to help her research students gain the necessary background to enable them to read current papers on the topics discussed in her seminar. In the same year she published the paper\nTopological embeddings in Euclidean space\nwriting in the Introduction:-\nHere we give an account of the work on geometric topology which has been carried out in our seminar at the\nSteklov\nInstitute\n(\nMoscow\n)\n. It can be divided into three parts: structure of the homeomorphism group of\nR\nn\n\\mathbb{R}^{n}\nR\nn\nand locally flat embeddings of manifolds in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n; topological embeddings of manifolds, polyhedra and compacta in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n; monotone mappings of manifolds.\nIndeed her seminar proved very important in the development of mathematics in Russia and it continued until\n1974\n. One of her students, A V Chernavskii, who was the author or joint author of nine of the articles referenced below, wrote about the L V Keldysh seminar when he joined it in the early\n1970\ns:-\n... we began to organize our workshops systematically in various parts of the Moscow countryside, combining topology, football or skiing depending on the season, anecdotes, serious conversations about life, and so on.\nIn\n1974\none of Keldysh's students was expelled from the Institute and, as a protest, Keldysh left the\nSteklov\nMathematical Institute. By this time, however,\nPetr Sergeevich Novikov\nwas seriously ill and the strain of the two years leading up to his death in January\n1975\nundermined Keldysh's formerly robust health. She died a year later and was buried with her husband in the Novodevich cemetery. It is fitting that the stone over their grave displays the same simplicity as they showed in their lives. It reads:\nPetr Sergeevich Novikov\nMathematician\nLyudmila Vsevolodovna Keldysh\nMathematician\nLet us note her interests outside mathematics\n[\n7\n]\nby giving a quote from the article that honoured her\n70\nth\nbirthday:-\nShe is a person of the most various interests. She makes a point of not missing the exhibits of artists who interest her. She can climb up a rickety wooden staircase to the top of a Gothic cathedral. She loves to spend her holidays at tourist centres, she loves old architecture, and she loves nature.\nAmong the honours that Keldysh received we mention the Red Banner of Labour, the medal \"Maternal Glory\", and the Prize of the Presidium of the USSR in\n1958\n. In August\n2004\nthe conference\nGeometric Topology, Discrete Geometry and Set Theory\nwas held in Moscow to mark the centenary of her birth.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}