{
  "nome_completo": "Manava",
  "nome_curto": "Manava",
  "ano_nascimento": "750 BC",
  "ano_morte": "690 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Manava/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Manava\nwas the author of one of the Sulbasutras. The Manava Sulbasutra is not the oldest\n(\nthe one by\nBaudhayana\nis older\n)\nnor is it one of the most important, there being at least three Sulbasutras which are considered more important. We do not know Manava's dates accurately enough to even guess at a life span for him, which is why we have given the same approximate birth year as death year. Historians disagree on\n750\nBC, and some would put this Sulbasutra later by one hundred or more years.\nManava would have not have been a mathematician in the sense that we would understand it today. Nor was he a scribe who simply copied manuscripts like\nAhmes\n. He would certainly have been a man of very considerable learning but probably not interested in mathematics for its own sake, merely interested in using it for religious purposes. Undoubtedly he wrote the Sulbasutra to provide rules for religious rites and it would appear an almost certainty that Manava himself would be a Vedic priest.\nThe mathematics given in the Sulbasutras is there to enable accurate construction of altars needed for sacrifices. It is clear from the writing that Manava, as well as being a priest, must have been a skilled craftsman.\nManava's Sulbasutra, like all the Sulbasutras, contained approximate constructions of circles from rectangles, and squares from circles, which can be thought of as giving approximate values of π. There appear therefore different values of π throughout the Sulbasutra, essentially every construction involving circles leads to a different such approximation. The paper\n[\n1\n]\nis concerned with an interpretation of verses\n11\n.\n14\nand\n11\n.\n15\nof Manava's work which give\nπ\n=\n25\n8\n=\n3.125\n\\pi = \\large\\frac{25}{8}\\normalsize  = 3.125\nπ\n=\n8\n2\n5\n​\n=\n3\n.\n1\n2\n5\n.\nSee the article\nIndian Sulbasutras\nfor more information on the Sulbasutras in general and the mathematical results which they contain.",
  "math_areas": []
}