{
  "nome_completo": "Manuel Valdivia Urena",
  "nome_curto": "Manuel Valdivia",
  "ano_nascimento": "1928",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Valdivia/",
  "lugar_nascimento": "Martos, Jaén, Spain",
  "lugar_morte": "Valencia, Spain",
  "biografia": "Manuel Valdivia\ngrew up in Martos, a city in south Spain which was very prosperous due to its leading production of olive oil. As he grew up he loved mathematics but had an even greater passion for philosophy, literature and especially for poetry. While studying at the college in his home town, Valdivia read\nCharles Hermite\n's proof that e, the base of natural logarithms, is transcendental. He read, at about the same time, the collection of poems\nSombra del Paraiso\nⓉ\n(\nShadow of Paradise\n)\nby Vicente Aleixandre. He loved both and that left him in a complete quandary as to whether to study poetry or mathematics. He sat the State examination at the University of Granada and was awarded a Bachelor's degree.\nPerhaps his next move was one of the most surprising things he did, for he now enrolled for a law degree in the Faculty of Law of Madrid University. Since his passions were mathematics and poetry, it is not hard to understand that the law course went badly for Valdivia. He gave up and decided to enter the School of Agronomist Engineers at Polytechnic University of Madrid. This was not quite so strange a move as the law degree, for he realised that, with the mathematical skills he already had, he was able to solve problems in the entry examination which others who had spent years preparing to take this examination were unable to solve. This time he successfully completed the degree course and graduated with an Agronomist Engineering degree in\n1958\n. He was awarded a scholarship to undertake research in agronomy and was appointed as an adjunct professor of mathematics in the School of Agronomist Engineers at Polytechnic University of Madrid. He now undertook two studies in parallel. He undertook research for a doctorate in Agronomist Engineering and was awarded this degree in\n1961\n. At the same time he studied as an undergraduate for a degree in mathematical science at the Complutense University of Madrid and was awarded the degree also in\n1961\n.\nValdivia met Dario Maravall Casesnoves\n(1923\n-\n2016)\nwho had been awarded a doctorate in mathematical sciences from the Complutense University of Madrid in\n1956\nand a doctorate in agronomist engineering from the School of Agronomist Engineers at the Polytechnic University of Madrid in\n1958\n. Dario Maravall helped Valdivia continue his move towards pure mathematics by introducing him to Ricardo San Juan Llosá who had studied for his doctorate under\nJulio Rey Pastor\n. Ricardo San Juan became his thesis advisor and quickly realised that Valdivia had extraordinary talents for mathematics. Valdivia was awarded his doctorate in\n1963\nfor his thesis\nSucesiones de aplicaciones continuas, absolutamente continuas y sumables con diversos tipos de convergencia\nⓉ\n(\nSequences of continuous functions, absolutely continuous and summable for various types of convergence\n)\n. This thesis was devoted to different concepts of convergence of sequences of functions in a metric space.\nFollowing the award of his mathematics doctorate, Valdivia was awarded a fellowship by the \"Juan March\" Foundation for Research in Mathematics in\n1963\n. Two years later he competed for the position of Professor of Mathematical Analysis II and III in the Faculty of Sciences of the University of Valencia and was successful. In the same year of\n1965\nhe published two papers:\nAlgunos criterios de convergencia en la teoria de la integración\nⓉ\n(\nSome convergence criteria in the theory of integration\n)\nand\nDesarrollos asintóticos y familias compactas de funciones holomorfas\nⓉ\n(\nAsymptotic growth and compact families of holomorphic functions\n)\n. In\n1967\nhis research interests changed after reading the work of Gottfried Köthe and Helmut H Schaefer on topological vector spaces. This was clear from his next two publications which appeared in\n1968\n:\nEl teorema general de la gráfica cerrada en los espacios vectoriales topológicos localmente convexos\nⓉ\n(\nThe general closed graph theorem in locally convex topological vector spaces\n)\nand\nEl teorema general de la applicación abierta en los espacios vectoriales topológicos localmente convexos\nⓉ\n(\nThe general open mapping theorem in locally convex topological vector spaces\n)\n.\nIn\n1969\nValdivia was appointed to the Chair of Algebra and Infinitesimal Calculus at the Escuela Técnica Superior de Ingenieros Agrónomos of the Polytechnic University of Valencia. An overview of his contributions are given in\n[\n12\n]\n:-\nAlthough Valdivia's academic activity has developed in Valencia, his influence has been considerable in the landscape of mathematical analysis in Spain, and especially in the establishment of functional analysis as one of the main research areas. The pioneering aspect of Valdivia's mathematical research must also be emphasized, since when he began research in the early sixties mathematical research in Spain was practically nonexistent, at least according to international standards, which he immediately attained with multiple functional analysis results. For example, as an eloquent illustration, he solved some open issues raised in\n1954\nby none other than\nAlexander Grothendieck\n(\nFields\nMedal\n1966)\n, which in turn had originated within the framework of the theory of distributions of\nLaurent Schwartz\n(\nFields\nMedal\n1950\nand director of\nGrothendieck\n's doctoral thesis\n)\n. Investigations by Valdivia have focused on a surprising variety of topics: analysis and topology, geometry of\nBanach\nspaces,\nFréchet\nspaces and locally convex spaces, compact spaces, real analytic functions,\nSchwartz\ndistributions, polynomials, multilinear forms, ... . We highlight, also as an illustration, his interest in weak compactness in\nBanach\nspaces, the study of which led him to define the notion of compact space that has been fertile for many researchers and is now known as the compact space of Valdivia.\nFor example, his papers on weak compactness include\nSome criteria for weak compactness\n(1972)\n,\nOn weak compactness\n(1973)\nand\nSome new results on weak compactness\n(1977)\n. The last mentioned paper begins:-\nIn this paper we prove that if E is a quasi-complete locally convex space and A is a subset of E such that every weakly continuous real-valued function on E is bounded in A, then A is weakly relatively compact. As consequence, a\nBanach\nspace E is reflexive if and only if every weakly continuous real valued function on E is bounded in the closed unit ball.\nThree problems posed by\nAlexander Grothendieck\nwere solved by Valdivia in the papers\nSolution of a problem of Grothendieck\n(1979)\n,\nOn quasi-normable echelon spaces\n(1981)\nand\nA characterization of totally reflexive Fréchet spaces\n(1989)\n.\nIn the citation delivered by Manuel López Pellicer on the occasion that Manuel Valdivia was given an Honorary Doctorate by the Polytechnic University of Valencia on\n27\nSeptember\n1993\n, his qualities as a teacher were described\n[\n11\n]\n:-\nIn addition to being an excellent researcher, Valdivia is a magnificent teacher of great clarity who always conveys enthusiasm in all the subjects he explains, uniting a great depth and a very varied knowledge of the different branches of mathematics. It was said of the French mathematician Hermite that those who had had the joy of being his pupils could not forget the feeling of beauty and clarity that he made run through his audience. These words can be applied to Professor Valdivia. And that's why he has put in enormous work to train teachers and researchers, as well as his support to other researchers, both in the two Universities of Valencia, as well as in other Spanish and foreign universities. He has directed more than thirty doctoral theses and there are many articles with thank-you notes to Professor Valdivia.\nOn that same occasion López Pellicer also described aspects of Valdivia's character\n[\n11\n]\n:-\nRegarding the human aspect of this great mathematician in his love for philosophy, poetry and music, I will try to describe some facet through ideas he has written or I have heard. Some years ago he told me that what he asked of life when he was old was to be able to continue doing mathematics. In another way he returned to describing this idea in the speech he gave at the opening lecture of the\n1986\n-\n87\ncourse at the University of Valencia when he told us that he felt he identified with the philosophical spirit of the Latin poet Virgil when faced with the attempt of his friends to dissuade him from studying Greek in the last years of his life responded bluntly: \"You have to work, you have to study as if you are never going to die.\" In that same lecture another facet of his spirit could be seen when he stated that in difficult moments, or when the means to work that were within his reach were meagre, he had never allowed the sadness of prevent him using all possibilities, quoting the phrase of the Bengali poet Rabindranath Tagore: \"If you cry at night because you can not see the sun, tears will prevent you from looking at the stars.\"\nFor a version of Valdivia's reply on the occasion of being given an Honorary Doctorate by the Polytechnic University of Valencia, see\nTHIS LINK\n.\nValdivia was also awarded an honorary doctorate by Alicante University on\n2\nMay\n2000\n. In reply he made the speech \"Aesthetic and intellectual aspects of mathematics\", a version of which we give at\nTHIS LINK\n.\nValdivia was also awarded an honorary doctorate by the Jaume I University in Castelló de la Plana, Spain, in\n2001\n. In reply he delivered the address \"Infinity in mathematics\", a version of which we give at\nTHIS LINK\n.\nIn\n1982\nValdivia published the\n510\n-page monograph\nTopics in locally convex spaces\n.\nNigel J Kalton\nwrote in a review:-\nThis is a study of certain aspects of current developments in the area of locally convex linear topological spaces by one of the most active researchers in the field. The selection of topics, is, as the author admits, heavily influenced by his research interests. There are three chapters\n(\neach of around\n150\npages\n)\nwhich are further subdivided into sections. In Chapter I, many different types of locally convex spaces are introduced and studied. ... The second chapter concerns sequence spaces. ... The third chapter is concerned with function spaces. ... The selection of material is clearly guided throughout by the author's own research. Occasionally it is difficult to see the underlying theme because of the way in which the material has been selected. It is clearly the author's intention to present in book form those aspects of the theory of locally convex spaces which interest him, without attempting a coherent overview. There is a wealth of information here, some of which is not readily accessible anywhere else. It will obviously be extremely valuable to anyone working in this area.\nWe have already mentioned some honorary degrees that Valdivia was awarded. Let us list here the main honours which were bestowed on him: elected to the\nReal Academia de Ciencias Exactas, Fisicas y Naturales\n(1975)\n; awarded the Great Cross of Alfonso X the Wise for Teaching Merit\n(1981)\n; elected to the Academia de Ciencias y Artes de Barcelona\n(1985)\n; elected to the Société Royale des Sciences de Liège\n(1990)\n; awarded an honorary doctorate by the Universidad Politécnica de Valencia\n(1993)\n; awarded an honorary doctorate by the University Jaume I\n(1993)\n; awarded an honorary doctorate by the University of Liège\n(1994)\n; elected to the Real Academia de Ingenieria\n(1995)\n; elected to the Academia Canaria de las Ciencias\n(1999)\n; Confederación Espanola de Organizaciones Empresariales prize\n(1999)\n; awarded an honorary doctorate by the Universidad de Alicante\n(2000)\n; awarded an honorary doctorate by the Universidad de Jaén\n(2001)\n; awarded the first gold medal of the Consell Valencià de Cultura\n(2001)\n; elected an honorary member of the Real Academia de Medicina i Ciències Afins de la Comunitat Valenciana\n(2003)\n; appointed Honorary Professor of the University of Valencia\n(2008)\n.\nFrom\n3\nto\n7\nJuly\n2000\nthe Functional Analysis Valencia\n2000\nconference was held in Valencia. This International Functional Analysis Meeting in Valencia, held to celebrate the\n70\nth Birthday of Manuel Valdivia, was a Satellite Conference to the Third European Congress of Mathematics held in Barcelona. Organized jointly by the Polytechnic University of Valencia and the University of Valencia, it had organizers from the Universities of Kent\n(\nUSA\n)\n, Paderborn\n(\nGermany\n)\n, Barcelona\n(\nSpain\n)\n, Zürich\n(\nSwitzerland\n)\nand Liège\n(\nBelgium\n)\n. With more than\n300\nattendees and\n250\nlectures and presentations, it was the largest functional analysis conference held in the year\n2000\n, the World Year of Mathematics.\nLet us end this biography by quoting the following summary of Valdivia's contributions\n[\n5\n]\n:-\nManuel Valdivia was an excellent mathematician, a great scientist and a deep intellectual, who loved literature and especially poetry. He conceived his mathematical creation, for which he had an extraordinary talent, as something similar to artistic creation and appreciated both beauty in mathematics and art. He worked in a wide variety of subjects, always with a passion and perseverance, which he knew how to convey to his students. He made essential contributions to many areas of functional analysis, solved very difficult problems proposed, inter alia, by\nSchwartz\nand\nGrothendieck\nabout\n1950\n, which had remained unresolved for many years. He obtained many profound results, opened new directions of investigation and always opted for quality in his research. His numerous works were published in the best mathematics journals, had a great impact and influence and received many citations. The great success of mathematical research and functional analysis in Spain would be inconceivable without the pioneering work of Manuel Valdivia.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}