{
  "nome_completo": "Marguerite Josephine Straus Frank",
  "nome_curto": "Marguerite Straus Frank",
  "ano_nascimento": "1927",
  "ano_morte": "2025",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frank_Marguerite/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Marguerite Straus Frank\nwas given the name\nMarguerite Josephine Straus\nwhen she was born and only became\nMarguerite Josephine Straus Frank\nwhen she married Joseph Frank\n(1918\n-\n2013)\nin\n1953\n.\nMarguerite Straus's parents were Julius Salomone Straus\n(\nknown as Jules\n)\n(1886\n-\n1946)\nand Paula Straus\n(1899\n-?\n)\n. Jules Straus was born in Wiesbaden, Germany, on\n17\nSeptember\n1886\n. He was in The Hague, Holland in\n1913\nand later gave his nationality as Dutch. He worked as a jewel merchant. Paula Straus was born in Pinsk, Poland on\n2\nFebruary\n1899\n. She also later gave her nationality as Dutch. Jules and Paula Straus moved to Paris where their two daughters were born; Doris Marianne Straus born\n1923\nand Marguerite Straus, the subject of this biography, born\n8\nSeptember\n1927\n. One official record gives\n8\nSeptember for Doris's day of birth but is hard to believe that both sisters shared the same birthday and we feel this is much more likely to be an error filling in the forms.\nMarguerite sent the early years of her life in Paris where she began her education at a private school. She immediately showed her outstanding abilities and soon was in a class two years above that for her age. Jules Straus had became ill in\n1924\nwhen he contracted encephalitis lethargica during an epidemic. Although he recovered from this serious brain disease, it meant his health was very poor for the rest of his life. Paula Straus made visits to New York, where she stayed in the Barbizon Plaza Hotel, and to Canada in the years\n1935\n,\n1936\nand\n1937\n. She gave her business as 'sweets'. The family were living at\n23\nrue Chauchat, Paris but, particularly since they were Jewish, they began to fear for their safety as Hitler implemented extreme anti-Semitic policies in Germany and put the country on a war footing. They decided to emigrate and in May\n1939\nthey sailed on the ship\nPilsudski\nfrom Copenhagen to New York. The ship arrived in New York on\n16\nMay\n1939\nand the family completed forms to enter the United States. They gave their nearest relative in France as a cousin, G Clemenceau, living at\n22\nRue de l'Elysee, Paris. Heading to Canada, they state they are in transit to the Westminster Hotel, Toronto. Both parents give their nationality as Dutch. Marguerite at this time is eleven years old,\n4\nft\n8\nins tall with brown hair and brown eyes. The family established their home in Toronto at\n11\nMaple Avenue.\nMarguerite Straus attended the Jarvis Collegiate Institute, a high school in Toronto named after Jarvis Street where it is located. She was known there as Giugite Straus and the first reference to her in\nThe Magnet\n, the Jarvis Collegiate Yearbook, is in\nThe Magnet\n1941\nwhere there is the comment\n[\n5\n]\n:-\nWill Giugite Straus kindly make her algebra more comprehensible, so that\n3\nA can do last night's homework, please.\nThe Magnet\n1942\nshows Straus to be the treasurer of 'The Girls' Club' and there is the statement\n[\n4\n]\n:-\nAcademically we're tops with Giugite Straus in the vicinity of\n86\n%.\nThe Magnet\n1943\n[\n3\n]\nrecords that Giugite Straus was awarded the\n1942\nCentenary Academic Award, was a Doubles Tennis Finalist, and that \"\n5\nA: Giugite Straus brilliant at Maths.\"\nThe Magnet\n1944\nrecords that Straus has been awarded the Maurice Hutton Alumni Scholarship and a Carter Scholarship and that\n[\n2\n]\n:-\nGiugite is from Paris, France, and is now at University College studying Mathematics and Physics.\nEntering the University of Toronto in\n1943\n, she studied as many mathematics courses as possible enjoying courses given by\nDonald Coxeter\nand\nLeopold Infeld\n. She was, however, particularly influenced by\nRichard Brauer\nwho quickly saw the potential in his young student. Straus quickly became enthusiastic about the algebra she was learning in his classes. While she was studying at the University of Toronto, Straus's father Jules died on\n29\nSeptember\n1946\n. His death certificate states that he died of pneumonia due to encephalitis lethargica contracted in\n1924\n. He was buried at Dwight Union Cemetery, Toronto. Straus graduated with a B.A. from the University of Toronto in\n1947\nand won a fellowship to attend graduate school at Harvard University. This fellowship required her to teach at Radcliffe College which was, at that time, the women's college operating alongside the Harvard University with only male undergraduates. This was a demanding task\n[\n1\n]\n:-\nThe girl who had just emerged from her teens found the notion of teaching at such a prestigious institution a tad overwhelming.\nRichard Brauer\nhad given Straus a love of algebra but at Harvard she was assigned to\nOscar Zariski\nwho was working on algebraic geometry. In fact\nZariski\nhad been appointed to the chair of mathematics at Harvard in\n1947\n, the year in which Straus began her graduate studies there. He was a leading researcher who at Harvard\n[\n1\n]\n:-\n... acquired a god-like stature and gained a reputation as an intimidating figure.\nAlthough when she arrived at Harvard, Straus had been expecting to study first for a Master's degree, then proceed to a Ph.D., in fact she somewhat lost confidence in herself in the highly charged competitive environment. Nancy Albert explains in\n[\n1\n]\nwhere Straus's difficulties lay:-\nAs one of only two women graduate students at Harvard's Mathematics Department, Marguerite felt heightened pressure to measure up. She was among the best of the best and the competition was stiff. It was not enough to be brilliant when her classmates, as brilliant as she, were competing feverishly in an unrelenting effort to outdo each other. She could not muster up the will to compete head to head with these strivers. The young woman was not yet prepared to focus on mathematics to the exclusion of all else.\nA doctoral student's relationship with his or her supervisor may make or break a budding career. The chemistry between\nZariski\nand his student was not going well. She found him to be brilliant, but aloof and inaccessible. It was not so much what he said, but it was what he did not say. It was not so much his words, but his demeanour. Marguerite sensed a grudging tolerance and disparagement in his glance, and she seemed to freeze in his presence. She completed a Master's Dissertation and received her Master's Degree from Harvard, but felt stymied after three years in Cambridge.\nStraus's mother Paula Straus had visited the United States at the end of October\n1946\n. She describes her occupation at that time as \"Manager Real Estate\", giving her nearest relative in Canada as her mother Ann Laurie living at her home on Maple Avenue, Toronto. She was going to visit her daughter Doris who was a student at Bryn Mawr College, Pennsylvania. She had made a visit to France, by air in August\n1949\n. After Marguerite Straus graduated with a Master's Degree from Harvard, her mother Paula advised her to take a break from her studies of mathematics at Harvard and take the opportunity to reassess the area in which she might wish to make her career. Marguerite arranged to take classes in history and philosophy in Paris, France, back where she had spent the first eleven years of her life. Marguerite and her mother Paula sailed on the\nIle de France\nfrom New York to Le Havre, France departing\n28\nSeptember\n1950\n. Over the next few years Marguerite returned to Canada for the summer. For example, she sailed from Le Havre on the\nLiberté\n, arriving in New York on\n2\nJuly\n1951\n, returning to Paris sailing on the\nIle de France\nfrom New York to Le Havre departing\n4\nOctober\n1951\n.\nWhile she was in Paris, Straus met Joseph Nathaniel Frank when both attended discussion groups at the Collège Philosophique. Joseph Frank had been born in New York City in\n1918\nand given the name Joseph Nathaniel Glassman but, after his father's death and his mother remarrying, he adopted his mother's new surname of Frank. Throughout the\n1940\ns, he published essays and criticism in literary journals and had gone to Paris on a Fulbright scholarship in\n1950\nto study further at the Sorbonne. He was a Special Researcher, American Embassy in Paris\n1951\n-\n52\n. In\n1952\nhe was accepted to study for his Ph.D. by the Committee on Social Thought at the University of Chicago. By this time Marguerite and Joseph were close and they decided that the would return together to Chicago. Her studies in Paris earned her a diploma in the History of Mathematics with the philosopher and historian of science Alexandre Koyré\n(1892\n-\n1964)\n.\nLet us now quote at length from Nancy Albert's account of how Straus returned in a very successful way to mathematics after meeting Nancy's father\nA Adrian Albert\n. In Chicago, Straus\n[\n1\n]\n:-\n... found herself at loose ends on campus with no definite plans for her own studies. Although she considered herself a \"failure\" at mathematics, her affinity for the science remained. She found herself reading several of\nEmmy Noether\n's papers on ring theory and jotting down notes about them.\nBelieving that her work might have some value, she decided to speak to someone in Chicago's Mathematics Department about it. A cursory glance at the University Directory produced the familiar name,\nAdrian Albert\n. Marguerite felt sure he would understand both\nNoether\n's work and her own. She phoned for an appointment with Professor\nAlbert\nand he agreed to meet with the timid young woman.\nWhen she arrived in his office, Professor\nAlbert\nsat at his desk, smoking his pipe. To him, the student with a French accent was a nobody who had dropped in out of the blue. Marguerite introduced herself, but glossed over her previous education. The professor did not press for more information. He glanced at her notes, scarcely looking at her while remaining focussed on his pipe. He was not impressed with the work but did not appear dismissive either. \"At least he's neutral,\" she thought, feeling somewhat relieved.\nMarguerite was struck with the contrast with her former supervisor. Professor\nAlbert\nimpressed her as approachable, gentle, nonaggressive, and not at all authoritarian. Not wishing to raise expectations by letting him know that\nBrauer\nconsidered her a 'wunderkind', she was content to leave the subject of her past academic accomplishments alone. There was nothing to pique his interest in the student, but he was kind and generous by nature. He handed her a stack of reprints and volunteered, \"Well, why don't you take a look at some of my recent papers and come back and see me in a month?\"\nMarguerite read over the papers and took to them as a duck takes to water. She was intrigued by\nAdrian\n's work in nonconventional structures. The absentee Harvard student returned in a month feeling a sense of weightlessness and armed with a determination to seek him as her doctoral thesis advisor.\nThe pipe-smoking professor appeared rather surprised to learn that the young nobody had fully understood his work. He insisted that she at least register with the University as a \"reader\" in the Mathematics Department if she wished to work with him. Then he assigned a problem for her dissertation - finding the derivation algebra of one of the noncommutative algebras he had defined.\nIt was clear he did not take her seriously. One day, Marguerite appeared in his office and announced that her name was no longer Straus, as she had just married a man with the surname, Frank.\nAdrian\nlooked at her in disbelief until she withdrew her hand from the pocket of her raincoat and displayed her wedding ring.\nMarguerite Straus and Joseph Frank were married in Chicago on\n6\nMay\n1953\n. Let us note at this point that they had two daughters, Claudine P Frank\n(\nborn\n17\nMarch\n1957)\nand Isabelle Jennifer Frank\n(\nborn\n2\nMay\n1959)\n. Isabelle received a bachelor's degree\nsumma cum laude\nin art and archaeology from Princeton University and a doctorate in the history of art and architecture from Harvard University. She is a leading expert in art history, the author of many books. Let us return to Nancy Albert's account\n[\n1\n]\n:-\nMarguerite dispatched her dissertation problem within a matter of weeks. ... Marguerite wrote out the solution in longhand and brought it to Professor\nAlbert\n's office.\nAdrian\ntook her paper and read it over. He suddenly looked up from his pipe and gazed at the petite personage in front of him as if seeing her for the first time. Marguerite had discovered a brand new class of simple\nLie\nalgebras. Prior to her result, only one infinite class of simple\nLie\nalgebras was known, the class discovered in\n1937\nby\nEmmy Noether\n's former doctoral student,\nErnst Witt\n. Professor\nAlbert\ncould barely contain his excitement about her discovery.\nFor the first time, he quizzed the young woman about her previous education. Once he learned that Marguerite had studied under\nBrauer\nand\nZariski\n, her achievement made sense to him. He was so impressed with her findings, he immediately arranged for her work to be published in the prestigious 'Proceedings' of the\nNational Academy of Sciences\n.\nThis paper by Marguerite Frank was\nA new class of simple Lie algebras\n(1954)\n. The paper was communicated to the\nNational Academy of Sciences\nby\nA A Albert\non\n30\nApril\n1954\n. The paper contains the following Acknowledgement:-\nThe author wishes to acknowledge her debt to\nA A Albert\nfor suggestions leading to the fairly simple proofs presented here.\nMarguerite Frank and\nAdrian Albert\nworked on the ideas that Marguerite Frank had developed and discovered further infinite classes of simple\nLie\nalgebras. They published the joint paper\nSimple Lie algebras of characteristic p\n(1954\n/\n55)\n. William G Lister writes in a review of the paper:-\nThe authors reveal several new infinite classes of simple\nLie\nalgebras of characteristic\np\n>\n2\np > 2\np\n>\n2\nwhich appear as subalgebras of the\nWitt\nalgebras of derivations of certain polynomial algebras, and they also develop a general multiplication table method for constructing\nLie\nalgebras of characteristic\np\np\np\nout of\np\np\np\n-groups, linear, and bilinear functions. The latter algebras or, in certain cases, homomorphic images or subalgebras of homomorphic images of them turn out to be simple.\nThe new simple derivation algebras, in addition to the\nWitt\nalgebras and the class recently described by the second author, comprise two infinite classes of algebras with dimensions\n(\nn\n−\n1\n)\np\nn\n(n - 1)p^{n}\n(\nn\n−\n1\n)\np\nn\nand\np\n2\nn\n−\n2\np^{2n} - 2\np\n2\nn\n−\n2\n. The new simple algebras which are specified by basis products fall into three infinite classes of dimensions\np\nn\n,\np\nn\n−\n1\n,\np\nn\n−\n2\np^{n}, p^{n} - 1, p^{n} - 2\np\nn\n,\np\nn\n−\n1\n,\np\nn\n−\n2\n.\nWhile in Chicago, Marguerite Frank wrote up her Ph.D. thesis entitled\nNew simple Lie algebras\nwhich was submitted to Harvard University where she was still registered as a graduate student. Marguerite's husband Joseph Frank gave the Gauss Lecture at Princeton University beginning in\n1955\nand\nAdrian Albert\nrecommended Marguerite Frank to\nAlbert W Tucker\n, who was Albert Baldwin Dod Professor of Mathematics at Princeton and chairmen of the mathematics department there. Marguerite Frank joined the optimisation group at Princeton run by\nAlbert Tucker\nwho was collaborating with Harold Kuhn\n(1925\n-\n2014)\n. Philip Wolfe\n(1927\n-\n2016)\nwas an Instructor at Princeton and a member of the optimisation group. Marguerite started to find out about linear programming, the simplex method of\nGeorge Dantzig\n, and game theory. She was assigned to work with Philip Wolfe and, to understand his work, she studied\nLagrange\nmultipliers and the method of Kuhn-\nTucker\nmultipliers which is a variation on\nLagrange\nmultipliers. She explained\n[\n6\n]\n:-\nI talked about attempting to progress from linear programming to concave programming with Philip Wolfe. He had an office, but I was working at home and remember regularly coming in to see Phil saying \"This should work.\" One time Harold Kuhn came by and Phil Wolfe said to him \"I think Marguerite has solved the Quadratic Problem.\" Then he said, \"but you didn't prove that your method converges.\" He then promptly showed that it did converge and then we wrote the paper.\nThe paper they wrote was\nAn algorithm for quadratic programming\n(1956)\n. For a version of the Introduction to the paper, see\nTHIS LINK\n.\nThe following information comes from the notes attached to the video\n[\n6\n]\n:-\nThe\n1956\npaper introduced the famous Frank-Wolfe algorithm\n(\nalso known as conditional gradient\n)\n, and was the very first method for general constrained convex optimisation. The importance of the method can hardly be emphasised enough, as it marks a historical tipping point enabling the departure from linear programming, going to more general convex optimisation. The paper is still of great significance today, as it paved the way for various currently important and broadly used optimisation algorithms, in particular sparse methods in signal processing and machine learning\n(\nincluding matching pursuit, Lasso and related techniques\n)\n.\nMarguerite Frank explained in the interview\n[\n6\n]\nthat in fact working on optimisation helped her get work while also being a wife and mother:-\nAfter that I really didn't give up, I went back to Lie algebras but it did help me professionally in the sense that I was a wife and a mother and the question of jobs is very problematic for women as we all know because of full time work etc. The optimisation helped me get jobs because it was easier to be employed in business schools or engineering schools with the claim that I knew something about optimising. This is what happened. I worked in transportation. I have a few articles in transportation science which is all based on equilibriums.\nLet us fill in a few details relating to this quote. Her further\nLie\nalgebra papers were:\nTwo new classes of simple Lie algebras\n(1964)\n;\nA new simple Lie algebra of characteristic three\n(1973)\n; and\nRestrictedness and simplicity in Lie algebras of characteristic p\n(1973)\n. She also had the\n100\n-page report\nProgress Report on a Theory Relating Matric Lie Algebras of Characteristic p and Subalgebras of the Jacobson-Witt Algebra: With Applications Leading to the Definition of New Simple Lie Algebras\npublished by the University of Minnesota, Institute of Technology in\n1960\n. Her papers on transportation theory include:\nThe Braess paradox\n(1981)\n;\nThe equilibrium worth of a network link\n(1989)\n;\nObtaining Network Cost\n(\ns\n)\nfrom One Link's Output\n(1992)\n; and\nComputer generation of network cost from one link's equilibrium data\n(1993)\n. Her reports on transportation theory include:\n(\nwith Harold Kuhn\n)\nAggregation in network models for transportation planning\n(\nUS Transportation Systems Center, Cambridge, Massachusetts,\n1978)\n,\nCost Deceptive Links on Transportation Networks\n(\nSystems Optimization Laboratory, Department of Operations Research, Stanford University,\n1983)\n; and\nUser-optimized Network Cost and Link Equilibrium Flow\n(\nSystems Optimization Laboratory, Department of Operations Research, Stanford University,\n1984)\n. She was an adjunct associate professor at Rider University\n(1977\n-\n1985)\nand a visiting professor at Stanford University\n(1985\n-\n90)\n. We note that Rider University in Lawrenceville is only\n12\nkm from Princeton where Marguerite Frank's husband was working at the time, and in\n1985\nhe moved to Stanford University for the rest of his career.\nFor an article\nThe History of the Frank-Wolfe Algorithm\nwritten by Marguerite Frank following the interview\n[\n6\n]\n, see\nTHIS LINK\n.\nJoseph Frank, a world leading expert on the Russian novelist Fyodor Dostoevsky, died in Palo Alto, California, on\n27\nFebruary\n2013\n. In his book\nDostoevsky: A writer in his time\n(\nPrinceton University Press,\n2009)\n, Joseph Frank writes in the Acknowledgements:-\nMy wife, Marguerite Frank, a professional and published mathematician and a discerning and avid critic of literature as well, has been a sharp and discerning critic of all of my volumes. Through these many years she has helped me to maintain them as close as possible to the highest intellectual and literary standards. In this instance she was dissatisfied with my treatment of perhaps the most complex of all the female characters in Dostoevsky's novels, the beautiful and ill-fated Nastasya Filippovna of 'The Idiot'. In the past, I had always used her comments to guide my own revisions. But now she so much altered and enriched my own initial view that I asked her to express them herself; and the pages devoted to Nastasya Filippovna in the present book thus come from her pen. Let me conclude by citing what I wrote in the Preface to my fifth volume: \"Nothing I can say will adequately express what every one of my books owes to her participation.\"\nWe note that Marguerite Frank was a visitor at the Institute for Advanced Study at Princeton from September\n1969\nto April\n1970\n. She was honoured with election to the\nNew York Academy of Sciences\nin\n1981\n.\nLet us end this biography with a quote from Marguerite Frank\n[\n6\n]\n:-\nIts good to have people working from different fields, its nice to have a general culture in mathematics and know about other fields.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Logic"
  ]
}