{
  "nome_completo": "Margaret Eva Rayner",
  "nome_curto": "Margaret Rayner",
  "ano_nascimento": "1929",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rayner/",
  "lugar_nascimento": "Tamworth, Stafordshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Margaret Rayner\nwas the daughter of Ridgway Rayner\n(1887\n-\n1977)\nand his wife Fanny Kate Winnall\n(1898\n-\n1955)\n. Margaret was born into a farming family with her parents, and almost all her relations, being farmers. The one exception was an aunt who was the headmistress of a village school and she was very supportive of Margaret having a high quality education. This was more important than it might look at first since farming was so much of a family tradition that all other members of the family expected Margaret to become a farmer. Margaret was brought up on Six Bells Farm, a dairy farm, at Alcester, Warwickshire, where Ridgway and Fanny were assisted by Ridgway's brother Henry and sister Lizzie.\nMargaret attended the King's High School for Girls in Warwick. This school, founded in\n1879\n, had been at the forefront of the expansion of education for girls begun in the Victorian period. Eleanor Doorly was Headmistress\n1922\n-\n1944\nand she brought charismatic leadership and many reforms which were ahead of their time. Doorly wrote children's books with biographies of famous scientists such as Marie Curie. She was near the end of her career when Rayner entered the school but, nevertheless, she was an important influence. Rayner was a Prefect at the King's High School for Girls in\n1947\n, the year she graduated.\nAfter completing her secondary schooling, Rayner entered Westfield College, University of London, wishing to specialise in studying mathematics. Westfield College was founded in\n1882\nas a women's college and, although always associated with the University of London, it only officially became a college of the University of London in\n1928\n. When Rayner studied there it was still exclusively for women but it became coeducational in\n1964\nand merged with Queen Mary College in\n1989\n. When she entered Westfield, she intended to became a school teacher of mathematics.\nRayner remained at Westfield College after graduating with a first degree, undertaking a Master's degree by research. Mary Stocks, later Baroness Stocks, had been appointed Principal of Westfield College in\n1939\nand held this position through the years of World War II when the College was relocated to Oxford. She was still Principal when Rayner began her studies there but Stocks retired in\n1951\n. Kathleen Chesney, a modern language scholar, was appointed to the position of Principal of Westfield College in\n1951\n. Chesney had been appointed as a tutor in Modern Languages at St Hilda's College in\n1923\n, where she was later appointed Vice-Principal. She advised Rayner to apply for a temporary part-time lectureship in mathematics at St Hilda's College, Oxford. Rayner, by this time, had decided to aim for teaching at a higher level than schools but, nevertheless, she continued to involve herself in school education throughout her life. Her application to St Hilda's College was successful and she was appointed to the position in\n1953\n. In addition she had to a joint appointment to St Anne's College.\nRayner wrote about the Oxford women tutors in the\n1940\ns and\n1950\ns in the article\n[\n8\n]\n. She writes about her own appointment in this article and you can read a version at\nTHIS LINK\n.\nThe job involved much tutoring of students but Rayner found the time to undertake research for a doctorate and, in\n1960\n, she was awarded a DPhil by the University of Oxford for her thesis\nSome problems in unsteady heat flow\n. In\n1960\nshe became a Fellow and Tutor at St Hilda's College, a role she continued to hold until she retired in\n1989\nhaving reached the age of\n60\n.\nIrene Ault writes\n[\n2\n]\n:-\nShe became a central figure in College life, particularly during the eight years she served as Vice-Principal. Not just within the College but more widely in the University, she was valued for her calmness, her willingness to take on extra burdens, her staunch common sense, elegant drafting, and ability to keep objectives clearly in mind.\nIn\n1965\nshe was able to make a research visit to the United States where she spent time at the University of Maryland and Cornell University. At Cornell University she met Lawrence Edward Payne\n(1923\n-\n2011)\n, known as Larry. Payne had moved from the Institute of Fluid Dynamics and Applied Mathematics at the University of Maryland to take up the appointment of Professor of Mathematics at Cornell University in\n1965\n. They undertook joint work on isoperimetric inequalities and Larry Payne published the paper\nIsoperimetric inequalities and their applications\n(1967)\nfor which he received the Leroy P Steele Prize from the\nAmerican Mathematical Society\nin\n1972\n. In the year that he received the prize, Payne and Rayner published a joint paper\nAn isoperimetric inequality for the first eigenfunction in the fixed membrane problem\n. Irene Ault writes that this paper\n[\n2\n]\n:-\n... introduced the Payne-Rayner inequality, an isoperimetric inequality for the first eigenfunction of the Laplacian. More specifically, it gives an exact lower bound of the first eigenvalue by means of some integral norms of the first eigenfunction, and also says that the first eigenfunction satisfies a reverse\nHölder\ninequality. This paper and a second which extended the result to higher dimensions stimulated further advances in isoperimetric problems by others.\nPayne and Rayner give the following Abstract:-\nAn isoperimetric inequality is obtained which relates the\nL\n1\nL_{1}\nL\n1\n​\nand\nL\n2\nL_{2}\nL\n2\n​\n-integrals of the first eigenfunction in the problem of the vibrating clamped membrane.\nThe second joint paper by Payne and Rayner, which Ault mentions in the above quote, was\nSome isoperimetric norm bounds for solutions of the Helmholtz equation\n(1973)\n. Payne and Rayner give the following Abstract:-\nPrevious results of the authors\n[\n2\n]\nrelating the\nL\n1\nL_{1}\nL\n1\n​\nand\nL\n2\nL_{2}\nL\n2\n​\nintegrals of the first eigenfunction in the two dimensional fixed membrane problem are here extended to the analogous problem in higher dimensions.\nRayner published the paper\nVectors and Relative Velocity\nin\nThe Mathematical Gazette\nin\n1969\n. The Abstract reads:-\nIn many books on elementary mechanics, it is assumed that velocity is a vector quantity on the grounds that it has magnitude and direction. It is, however, very far from obvious that these are sufficient reasons and a rather more thorough investigation of the nature of velocity may provide not only a clearer idea of what velocity is but may also clear up some of the difficulties associated with \"relative\" velocity.\nGraeme C Wake was an applied mathematician working at Victoria University, Wellington, New Zealand when he visited Alan Breach Tayler\n(1931\n-\n1995)\nat the University of Oxford in\n1971\n. Tayler suggested that Wake had research interests similar to those of Rayner and he introduced the two. Wake wrote:-\nAlan quite correctly believed our common research interests would ensure joint work would eventuate. That worked exceedingly well of course. Our joint paper and best work on 'Variational Methods for Nonlinear Eigenvalue Problems associated with Thermal Ignition' was, in a strange way, an early forerunner of the now common path-following techniques for such problems. It led me, with others, to develop algorithms to characterise, and estimate, thresholds for self-ignition. Margaret was also a wonderful teacher and mentor.\nRayner and Wake submitted their joint paper '\nVariational Methods for nonlinear eigenvalue problems associated with thermal ignition'\nto the\nJournal of Differential Equations\non\n11\nNovember\n1971\nand it was published in\n1973\n.\nPauline Curtis began her study of mathematics at the University of Oxford in\n1970\n. She writes\n[\n3\n]\n:-\nI went to Oxford for interview. St Hilda's College was my first choice College and Oxford was my first choice University, so I was very worried that I might not be accepted. I very much wanted to make a good impression. St Hilda's College had two mathematics tutors, Margaret Rayner and Irene Moore. They were called Miss Rayner and Miss Moore, although they both had doctorates. Miss Rayner was tutor in Applied Mathematics and was the more senior. ... Lectures at the Mathematical Institute in St Giles' did not require me to wear my gown, but individual tutorials, with either Miss Rayner or Miss Moore at St Hilda's College did. ... Tutorials with Miss Rayner\n[\nwere\n]\na fearsome intellectual experience, taken in pairs, where the work of the preceding week was taken apart and new challenges were attacked.\n[\nAfter the results of the final examinations were announced\n]\nI had a nice letter from Miss Rayner congratulating me. She said that I had done well, except for one paper, and was at the lower end of the Firsts.\nAt the Fourth International Congress on Mathematical Education held in Berkeley, California, USA,\n10\n-\n16\nAugust\n1980\n, Rayner gave the presentation\nIs calculus essential?\nThe Congress was attended by about\n1800\nfull members and\n500\nassociate members from about\n90\ncountries. For a version of\nIs calculus essential?\nsee\nTHIS LINK\n.\nIn\n1993\nRayner wrote a description of her career which, slightly surprisingly, she wrote in the third person:-\nAlthough she modified her earliest ambition to teach in a school, she never lost her interest in school education. One of her first University committees was at the Department of Educational Studies and she had her first training in chairing a large meeting in connection with teacher training in the Area Training Organisation. Her concern with school education was kept alive by work with the\nMathematical Association\nand by membership of a number of governing bodies of schools, both independent and state maintained. For many years she was chief examiner in mathematics for the International Baccalaureate and so became aware of developments in curricula and in assessment in Europe and North America. She found this an exciting task, drawing up syllabuses that would be acceptable to universities all over the world. It was an experience of the greatest value when she later joined the Secondary Examinations Council\n(\nand even later the School Examinations and Assessment Council\n)\nand took part in approving syllabuses for GCSE and A-level.\nRayner was an active participant in the work of the\nMathematical Association\nserving on various of its committees including the Schools and Industry Committee, and the Finance and General Purposes Committee. She served as President of the\nMathematical Association\nin\n1987\nand, in\n1988\ngave her Presidential Address\nOn examinations\n. You can read a version of her address at\nTHIS LINK\n.\nHer interest in examinations also showed itself in her work for the International Baccalaureate being its Chief Examiner for many years. In this role she\n[\n1\n]\n:-\n... became aware of developments in curricula and in assessment in Europe and North America. It was an experience of the greatest value when she later joined the Secondary Examinations Council and, later still, the Schools Examination and Assessment Council concerned with curriculum development.\nIt was not only College administration that she took part in with enthusiasm but also wider University administration. She chaired both the University Staff Committee and the University Accommodation Committee. In\n1981\nRayner became Vice-Principal of St Hilda's College and she continued in that role until\n1988\n. In the following year,\n1989\n, she retired. In the year after she retired, she was awarded a CBE in the Queen's Birthday Honours\n[\n7\n]\n:-\n1990\nBirthday Honours. Commander of the Order of the British Empire\n(\nCBE\n)\n, Miss Margaret Eva Rayner, lately Vice-Chairman, Schools Examination and Assessment Council; Vice-Principal, St Hilda's College.\nIn\n1984\n, when Rayner was Vice-Principal of St Hilda's College, she was interviewed for the article\n[\n10\n]\nin the\nThe Oxford Times\n. We give a version of that article at\nTHIS LINK\n.\nIn many ways Rayner embarked on a new career after she retired when she effectively became a historian. There was the book\nCentenary History of St. Hilda's College\n(1993)\nwhich has nine chapters:\n1\n. St Hilda's, Cheltenham;\n2\n. St Hilda's, Oxford;\n3\n. The Burrows' Years;\n4\n. From Hall to College;\n5\n. College Life between the Wars;\n6\n. The Second World War;\n7\n. A College within The University;\n8\n. Finance and the Building Programme,\n1945\n-\n92\n;\n9\n. Academic and Social Life in the Second Half Century.\nAnother important historical work was her contribution of Chapter\n14\n.\nThe\n20\nth Century\nto the book\nOxford Figures: Eight Centuries of the Mathematical Sciences\n(2013)\nedited by John Fauvel, Raymond Flood, and Robin Wilson. Here is the Abstract for her chapter:-\nThis chapter opens with a summary of the state of Oxford mathematics at the beginning of the\n20\nth century, with Professors Esson,\nElliott\n, and\nLove\noccupying the mathematical Chairs. A wind of change blew across the University with the appointment of the Cambridge mathematician\nG H Hardy\n, who held the Savilian Chair of Geometry for eleven years. The chapter concludes with a description of the major rise in mathematical activity following the Second World War.\nRayner died on\n31\nMay\n2019\nand a memorial celebration was held for her on Sunday\n6\nOctober\n2019\nin the Jacqueline du Pré Music Building, followed by a buffet lunch in the Brian Duke Foyer. Following her wishes a Dr Margaret Rayner Memorial Fund has been set up to support the provision of undergraduate student accommodation at St Hilda's College.\nLet us end this biography by quoting the tributes to Rayner in various announcements of her death. St Hilda's College writes\n[\n4\n]\n:-\nDr Rayner was an admired mathematician and a much-loved tutor. In retirement, she turned historian and was the author of the College's centenary history. She will be missed greatly by her former colleagues, students, and friends at St Hilda's.\nThe St Hilda's College Chronicle writes\n[\n5\n]\n:-\nWe are very sad to announce the death of Emeritus Fellow and former Chronicle Editor Dr Margaret Rayner, who continued to be a wonderful source of knowledge and advice after handing over her Editor's red pen to us three years ago. We will ... remember her as an inspiring educator, a dear friend, and a St Hilda's woman to the core.\nIrene Ault writes\n[\n2\n]\n:-\nMargaret Rayner, who has died at the age of\n89\n, was a respected mathematician and much loved tutor, a highly valued member of both St Hilda's College as well as the wider academic community in Oxford, who was known nationally and internationally for her work on school examinations. ... The characteristics that come to mind most immediately when thinking about Margaret are her intellectual curiosity, her energy, her capacity for making friends and her generous hospitality. She cared about people and, in return, they cared about her and were fond of her. She will be much missed.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}