{
  "nome_completo": "Marius Lacombe",
  "nome_curto": "Marius Lacombe",
  "ano_nascimento": "1862",
  "ano_morte": "1938",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lacombe/",
  "lugar_nascimento": "Lausanne, Switzerland",
  "lugar_morte": "Chexbres, Vaud canton, Switzerland",
  "biografia": "Marius Lacombe\n's place of origin was Begnins\n(\ncanton Vaud\n)\nand it seems that he grew up there. Lacombe studied mathematics at the Polytechnic's Engineering Department and became a professor at the University of Lausanne in\n1892\n. In\n1894\nhe was appointed to a professorship at the Polytechnic in Zürich: Lacombe filled the newly created chair of descriptive geometry in French. Before that,\nFranel\nwas the only mathematician at the Polytechnic who taught in French. The second professorship was established due to 'popular demand'\n[\n3\n]\n; and the Swiss government hoped that German-speaking students too would attend Lacombe's lectures.\nLacombe stayed in Zürich for\n14\nyears. In\n1908\nhe moved back to Lausanne, apparently because of family reasons, as the Swiss government put it in a notice in\n[\n4\n]\n:-\nLike us, many will indeed be sorry that this teacher, who is so popular among his colleagues and in particular also among his students, leaves our university in order to return to his native region due to family matters.\nLacombe stayed in Lausanne for the rest of his life. He taught descriptive, projective and analytic geometry at the Engineering School of the University of Lausanne until he retired in\n1927\n. He served as the school's Director from\n1911\n-\n1918\n. In his last year in office, he founded the university's Laboratory of Materials Testing, which still exists today.\nLacombe was more teacher than research mathematician. The only publications listed in the Swiss libraries' union catalogue concern mathematical education:\nL'enseignement des mathématiques élémentaires dans le Ct. de Vaud\nⓉ\n(\nThe teaching of elementary mathematics in the Vaud Canton\n)\n(1893)\nand\nL'enseignement mathématique à l'École d'Ingénieurs de Lausanne\nⓉ\n(\nMathematical teaching at the School of Engineering in Lausanne\n)\n(1911\n, with\nGraf\n)\n. Lacombe believed that his students, all future engineers, should know how to use mathematics to solve technical problems, rather than be taught pure mathematics\n[\n2\n]\n:-\nEven though he is not an engineer, Mr Lacombe is very well informed about everything that concerns technical education. He is not one of those who consider mathematics to be simple gymnastics or an adornment of the mind. He knows that it is a means and not a goal, and he wants his students to know how to apply the tool that he gives to them in practice. The problems and exercises -- particularly in descriptive geometry -- that he poses his students are always applications of real-life cases that every engineer will face in his career. In his lectures at the Engineering School he chooses to ignore problems that are only of a purely theoretical or virtuosic interest.\nHe was one of the first in Switzerland to introduce his students to new techniques used in industry, such as photogrammetry.   In\n1905\n, on the occasion of the Polytechnic's\n50\nth\nanniversary, he was awarded honorary citizenship of the town Zürich, alongside his colleagues\nFranel\nand\nHerzog\n. Lacombe also received an honorary doctorate from the University of Lausanne.\nLacombe joined the enlarged organising committee of the first International Congress of Mathematicians in December\n1896\n. He was one of the members of the finance committee and also organised a special breakfast for the congress participants on the last congress day. At the congress itself he chaired section III: Geometry.",
  "math_areas": [
    "Geometry"
  ]
}