{
  "nome_completo": "Mario Israel Wschebor Wonsever",
  "nome_curto": "Mario Wschebor",
  "ano_nascimento": "1939",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wschebor/",
  "lugar_nascimento": "Montevideo, Uruguay",
  "lugar_morte": "Montevideo, Uruguay",
  "biografia": "Mario Wschebor\nwas the son of David Wschebor and Luba Wonsever. David and Luba were Jewish and had arrived in Uruguay as small children. Mario had an uncle Israel Wonsever, born\n1918\nin Poland, who became a professor of economics at the University of the Republic in Montevideo. He said:-\nWe came to this neighbourhood, Villa Muñoz, when I was\n10\nyears old. We came from Poland; Jewish-Polish who did not speak a word of Spanish.\nMario Wschebor was brought up and educated in Montevideo, where he attended high school. He became well known at the high school, both as an outstanding student, and also for being active and passionate about political and social issues.\nHe entered the Faculty of Engineering at the University of the Republic in Montevideo in\n1957\nto study electromechanical engineering and quickly showed himself to be a brilliant student. He was elected as a student representative on the Council and was soon highly involved with the major university issue of the time, the Organic Law. This law regulated the functioning of the University of the Republic. It defines the university as a public legal body, which will function as an Autonomous Entity, in accordance with the pertinent provisions of the Constitution and other laws. It defines the Purpose of the University, Freedom of Opinion, the Structure of the University\n(\nSenate, Deans, Faculty Councils etc.\n)\nand many other issues. Wschebor, as a student representative played a major role in drafting the teaching aspects of the\n1958\nOrganic Law. Another achievement of Wschebor's as student representative was achieving Rafael Laguardia's reappointment. Enrique Cabaña writes\n[\n4\n]\n:-\nEngineers Julio Ricaldoni and Oscar Maggiolo led a progressive group of teachers, for many years a minority. Mario Wschebor, shortly after entering the Faculty, along with Luis Osin, several years older than him, were student representatives on one of those councils made up of a professional majority. On one occasion there was strong questioning the renewal of the position of Rafael Laguardia, whose tireless dedication to the training of mathematicians was not well appreciated by that majority. The fiery defence of Luis and Mario, together with the teaching minority, finally achieved victory after a long process and that is probably one of the milestones in Mario's career as a representative of Students of the Faculty.\nOn the mathematical side, Wschebor became an active participant in the Seminar on Probability at the Institute of Mathematics and Statistics.\nWschebor began teaching Financial and Actuarial Mathematics in\n1962\n, a year before he graduated with his Engineering Degree. He applied for a UNESCO scholarship to undertake postgraduate studies at the Hungarian Academy of Sciences in Budapest. He worked with István Vincze\n(1912\n-\n1999)\nwho was an expert in theoretical and applied statistics, and with the scientific associate Pál Révész\n(\nborn\n1934)\nwho worked on probability theory and stochastic processes. Wschebor's first publication was a joint paper\nOn the Statistical Properties of the Walsh Functions\n(1965)\nwith Révész. Wschebor  was awarded a Postgraduate Diploma in Probability Theory, Mathematical Statistics and its Applications, in\n1964\n.\nReturning to Montevideo, Wschebor continued to work in the Faculty of Economic Sciences and Administration teaching Mathematics I and then, in\n1965\n, became Associate Professor of Mathematics II. He was appointed as an Assistant in the Institute of Mathematics and Statistics of the Faculty of Engineering in\n1967\n, and promoted to Adjunct Professor in\n1969\n. He continued to undertake research on probability and his next publication\nOn the Barrier Problem for Stationary Gaussian Processes\nwas joint work with Enrique Cabaña\n(\nborn\n1937)\n. He also continued his passion for political issues and in\n1970\npublished the book\nImperialismo y universidades en América Latina\nⓉ\n(\nImperialism and universities in Latin America\n)\n. Gustavo Garcia writes in a review\n[\n10\n]\n:-\nThe subjugation of the universities of both the United States and Latin America to purposes specifically linked to the military or economic expansion or preservation of the empire, even though it dates back two or three decades, has only been addressed very recently, particularly as a result of the latest cases of foreign intervention in the life of underdeveloped countries. Wschebor's essay, despite its brevity, manages to accurately place the imperialist cultural tactic of the United States in its general environment. Institutionalised education is only one aspect of the general programme for the formation of people's consciences and, in the capitalist world, propaganda has become a first-class instrument to determine uses and customs, and fix a perception of reality that favours the ruling classes. The problem stems from the growing militarisation of science in the United States. The author gives a significant figure: in\n1962\n,\n90\npercent of Washington government spending on science was for military purposes ...\nIn the late\n1960\ns, Wschebor married the historian Adela Pellegrino. Adela had been born in Montevideo on\n16\nOctober\n1942\n; her father was from an Italian family. Let us quote from the interview\n[\n5\n]\nby Adela Pellegrino:-\nI met Mario Wschebor and we got married, we went to live in the most beautiful square in Montevideo, in Parra del Riego. Mario was a militant, half his life was militant, and he studied, and after going away and coming back, we decided to leave ... we were worried about the political situation, which was not that bad yet ... Mario entered a competition at the Centre for Mathematics in the Engineering Faculty when the opportunity arose to have a scholarship in France.\nLaguardia\n, that wonderful man who directed the Mathematics Centre at that time, had obtained scholarships to study in France for mathematicians. Mario had the opportunity to present himself and he won. ... I didn't have a scholarship at first; I went to France by ship and Mario on a plane together with other colleagues. Mario's scholarship was small, so we lived very frugally.\nThey arrived in Paris in\n1970\nwhere Wschebor studied at the University of Paris XI advised by\nJean-Pierre Kahane\n. In\n1971\nhe was awarded a Diplôme d'Études Approfondies for his thesis\nAlgèbres Uniforme\nⓉ\n(\nUniform algebras\n)\nthen continued to undertake research for his doctorate again advised by\nJean-Pierre Kahane\n. Wschebor was awarded a doctorate in\n1972\nfor his thesis\nRecouvrements Aléatoires du Cercle\nⓉ\n(\nRandom circle covers\n)\n. The main results from the thesis were published in\nSur le recouvrement du cercle par des ensembles placés au hasard\nⓉ\n(\nOn the covering of the circle by sets placed at random\n)\n(1973)\n. In this paper Wschebor writes\n[\n26\n]\n:-\nI thank\nJ-P Kahane\nfor his guidance and his remarks during my work.\nThe Abstract reads\n[\n26\n]\n:-\nIf T is the unit circle and\nB\nn\nB_{n}\nB\nn\n​\na given sequence of subsets of T, we consider the problem of covering T with random independent uniform translates of\nB\nn\nB_{n}\nB\nn\n​\n. The technique used is based on a theorem on rearrangements of functions.\nWschebor returned to Montevideo with his wife Adela Pellegrino in\n1972\n. Let us quote again from her account\n[\n5\n]\n:-\nThe decision to return was difficult, because the situation\n[\nin Uruguay\n]\nwas horrible, there were many friends in prison. Everyone told us not to come back ... . But we felt terrible guilt about abandoning our country and as soon as we could we returned. ... We took a ship from Nice, I remember some large trunks of things we had bought, always afraid, but nothing happened on arrival. And well, then we tried to organise our life here. ...\nThe political situation in Uruguay deteriorated in February\n1973\nwith a conflict between the president, the General Assembly, and the armed forces. On\n27\nJune\n1973\nthe General Assembly was dissolved and a military dictatorship took over. On\n24\nJuly\n1973\n, as the situation got worse, Nicolás, the Wschebor's first child, was born. We note here that Nicolás became a theoretical physicist and a professor in the Faculty of Engineering of the Universidad de la República, Montevideo. The University continued to operate until\n27\nOctober\n1973\nwhen an explosion occurred in the building of the Faculty of Engineering and a student was killed. The military government believed the explosion was caused by the student constructing a bomb and on\n28\nOctober the security forces entered the university. Wschebor's wife related what happened\n[\n5\n]\n:-\nI went back to work at the Architecture Department until the military intervention\n[\nof\n28\nOctober\n]\n, then everything went to hell. They started looking for Mario, they went to look for him in an apartment that we had sold ... things got worse and worse. ... Mario was imprisoned, but only for\n24\nhours. And there were so many people who were taken away in those days ... We went to Buenos Aires and spent fifteen days thinking about what to do, friends told us not to come back, the coup in Chile was coming, they wanted us to go to the Venezuelan Embassy ... But finally we came back to Uruguay, very frightened, and well, we dedicated ourselves to not talking much and to being half hidden. Mario was left without a job, the Institute of Mathematics closed. ... We decided to go to Buenos Aires, and right away our second child Margarita Maria was born.\nWe note here that Margarita Maria Wschebor studied medicine and became a professor in the Psychiatric Clinic of the Faculty of Medicine, Universidad de la República, Montevideo.\nWschebor and several others who had fled from the Institute of Mathematics and Statistics in Montevideo in\n1973\n, including\nGonzalo Pérez Iribarren\n, got positions in the Faculty of Engineering of the National University of Luján in Buenos Aires and began work there in February\n1974\n. Wschebor began teaching mathematics to large first year classes and advised the local staff, who had been rather poorly trained, in how to improve their teaching skills. It proved to be a short appointment, however, since in September\n1974\nthe university authorities decided to only employ Argentine staff and Wschebor, together with the other Uruguayan mathematicians, were all fired. Wschebor tried to continue his family life, living in a quiet residential area of Buenos Aires away from the centre of the city and together with\nGonzalo Pérez Iribarren\nhe worked for a while as a consultant, working in the Electronic Division of FATE, a large tyre manufacturing company established in\n1940\n. He also was employed as an advisor to Servicios Eléctricas del Gran Buenos Aires\n(\nSEGBA\n)\n, an Argentine public company in charge of the generation, transmission, and distribution of electricity in Buenos Aires and the surrounding area.\nAttempts to continuing living in Buenos Aires came to an end in May\n1976\n. Zelmar Michelini\n(1924\n-\n1976)\nwas a Uruguayan politician and journalist who had served as Minister for Industry in the centrist Uruguayan government but had joined left-wing parties in\n1970\nas political difficulties increased. He was assassinated in Buenos Aires on\n20\nMay\n1976\nalong with three other Uruguayans; all had been tortured. Wschebor's wife had a sister in Chile and wanted to study demography at the Latin American and Caribbean Demographic Centre in Chile. Wschebor had a contact at the Latin American and Caribbean Demographic Centre so the family moved to Chile. Shortly after arriving, however, Wschebor was offered a position in the Department of Mathematics and Computer Science of the Simón Bolívar University of Caracas, Venezuela. Adela Pellegrino was unhappy with the move since she would have wanted to stay in Chile, but despite this the family moved to Caracas. Their third child, Isabel Wschebor Pellegrino was born in Venezuela in\n1978\n. We note that she became a writer, historian and specialist in audiovisual archives.\nIn Venezuela, in addition to working at the Simón Bolívar University of Caracas, Wschebor also worked at the School of Mathematics and Physics in the Faculty of Sciences of the Central University of Venezuela. Wschebor organised a Probability and Statistics Seminar as a joint project of these two institutions and also with the Venezuelan Institute of Scientific Research. Through the difficult years following\n1973\n, Wschebor continued to publish papers, one in\n1975\n, one in\n1977\nand one in\n1979\n. From\n1980\nonwards, however, his publication rate increased as his positions became more stable. Three papers where published in\n1980\n, two in\n1981\nand two in\n1982\n. Five of the papers between\n1979\nand\n1982\nwere joint works with his friend Enrique Cabaña. During his time in Caracas, Wschebor made a visit to France, going to the Laboratory of Complex Analysis and Geometry of the University of Paris VI in April-May\n1982\n. He spent a sabbatical year in France in\n1983\n-\n84\n, working as a Visiting Professor in the Mathematics Department of the Faculty of Sciences of Orsay, University of Paris-Sud. He went to Paris with his family and during that year his wife took an intensive course in historical demography which allowed her to complete a Ph.D. thesis after returning to Caracas. Wschebor continued to have close ties with his French colleagues and with institutions in that country and made many visits in the late\n1980\ns and the\n1990\ns.\nUruguay returned to democracy in March\n1985\n. Wschebor did not return immediately but continued to work in Venezuela until\n1987\n. He was reinstated at the University of the Republic in\n1987\nand made a full professor in the following year. Gonzalo Perera, who was an undergraduate in\n1987\n, writes\n[\n19\n]\n:-\nIn the middle of the first semester of\n1987\nWschebor took over a course in Probability and Statistics. Attending his classes was a real treat. An extremely profound knowledge, accompanied by the most absolute clarity and prolixity when speaking and writing, with such enthusiasm for what he taught that every now and then he was won over by passion, his eyes shone with intensity, he gesticulated, raising his left hand as if he were holding some imaginary object to emphasise the relevance of a concept. When Mario taught a course he did not teach Mathematics: he lived it and recreated it, his story took you to the very sources of the various concepts and made you feel part of that gigantic collective construction.\nPerera went on to complete his Bachelor's Degree with Wschebor as his tutor, then was advised by Wschebor for his Master's Degree and Ph.D. Writing about Wschebor as a doctoral advisor he writes\n[\n19\n]\n:-\nHe never made me study \"his problems\", those that were part of or had fallen by the wayside in his agenda as a researcher, which is what many advisors do. No, he wanted me to follow my own ideas as much as possible. At the time I didn't fully understand it and even at times it bothered me. Over the years, again, I realised his generosity. He didn't want me to be his appendix, but rather for me to have an academic personality of my own. The attitude of a genuine teacher.\nWe quote the description of Wschebor's research activities given in\n[\n2\n]\n:-\nHis research activity falls within the area of probability and statistics. Beginning with\nFourier\nseries and circle covering problems with random intervals\n(\nhis doctoral thesis topic\n)\n, he made important contributions to the problem of the distribution of the supremum of a random process, both in the one-dimensional and multidimensional cases, among which stands out a series of works on problems of crosses and level sets, together with Enrique Cabaña, for which he received an award from the Consejo Nacional de Investigaciones Científicas y Tecnológicas\n(\nCONICIT\n)\nof Venezuela in\n1981\n. In these investigations he used and generalized Rice's formula. He was also interested in the properties of regularity of the trajectories of stochastic processes, the local time of the processes, the key problem of the observation of an irregular process and the mathematical models of trajectory regularisation, and local time approximation, as well as related process problems in statistics. More recently, inspired by problems posed by\nStephen Smale\n, he became interested in the solutions of random systems of equations and the complexity associated with determining them, for which he again used Rice's formula. His most recent works fall in this direction, especially those co-authored with Jean-Marc Azaïz and Felipe Cucker. Rice's method of Azaïs and Wschebor for the study of the distribution of the maximum of a random process is presented in the book \"Level sets and extreme of random processes and fields\", in collaboration with Azaïs, edited in\n2009\nby Wiley.\nAnna Amirdjanova reviewed this\n2009\nbook and we give an extract from\n[\n1\n]\n:-\nThe book is a very valuable addition to the literature on Gaussian processes, random fields and extreme value theory. It is well written and self-contained and presents a significant number of detailed and original applications to genomics, oceanography, the study of systems of random equations and condition numbers of random matrices. In comparison with another recent book\n[\nR J Adler and J E Taylor\n(2007)]\n, this book has a distinct analytic rather than geometric flavour, making it more accessible to audiences with no background in differential geometry ... . Since the approaches adopted in these two books are very different and there is generally little overlap in the material, the two books complement each other well. Another valuable feature of the book under review, both from the self-study point of view and for its use as a textbook in graduate classes, is the inclusion of end-of-chapter exercises. The latter not only reinforce the material presented but also expose readers to a variety of new topics and ideas.\nBut, as we have seen, Mario Wschebor was active politically from his young days and he continued to put great effort into improving university education throughout the country. He was in a particularly strong position to influence the direction of the University of the Republic when he served as dean of his faculty from\n1990\nto\n1998\n. In particular he, together with three other deans, produced the 'Document of the four Deans' which argued for improvements in the quality of education and the form of university government as well as arguing for updating the stated aims of university education. Gustavo Penades said, addressing the Eastern Republic of Uruguay Chamber of Senators, that this document\n[\n18\n]\n:-\n... dared to say things that not everyone understood and that many tried to hide under from the carpet, hide them or shut them up; however, they had the courage to keep saying them. What's more, many times they said things that their own colleagues and co-religionists did not understand, did not see or did not want to see, about the reality of the university of our country.\nWschebor was around\n70\nyears old when he became ill and died at age\n71\n. Alberto Couriel, addressing the Eastern Republic of Uruguay Chamber of Senators, said\n[\n7\n]\n:-\nFor me, Mario was always a top-level reference in educational matters, especially in university studies. He would say that we felt a mutual affection and, therefore, a few months ago I called him on the phone, among other things, to apologise because I had not gone to see him due to his illness. He answered by roaring with laughter and making countless jokes to me - I still hear him laugh - so that I would calm down and not feel guilty for not having gone to visit him. A few weeks ago, Clara, my wife, met our dear friend Adela Pellegrino and told me: \"You have to go see him.\" Precisely, that he was about to leave us and, in truth, I did not think that he was going to die so quickly. I couldn't get to see him, and I was very sorry when another friend called me on Friday,\n16\nSeptember, Diana Reches - also known as Diane Denoir - who asked me in an anguished, hard and firm tone: \"Do you know? Did you hear? You knew it?\" She later told me: \"Mario died.\" As moved as I am to say it right now, I was moved to hear it, because I didn't expect him to pass away so soon, even though I knew he wasn't well.\nAlberto Couriel had known Wschebor for many years, yet was unaware of his eminence as a mathematician\n[\n7\n]\n:-\nAnother thing that deeply caught my attention was his Curriculum Vitae, which I had the opportunity to read when we decided to pay this tribute. I realised that there was a Mario Wschebor that I did not know, because the truth is that it is an impressive résumé. I have been a parliamentarian for almost twenty-two years and I have paid many tributes to different personalities in the country, but I have never found a résumé with the level, depth and characteristics of Mario Wschebor's. Surely I didn't know because Mario never talked about these issues. He was such a simple person, that I had not realised that I had a friend who was really a world-class scientist, both for his studies - recognised in the diplomas, prizes and distinctions he obtained -, and for his teaching work, which he practiced in countless countries around the world, and for the number of scientific publications he had made. I would say that Mario Wschebor was a scientist, an intellectual, a fighter and a militant for causes, which he defended with conviction, with great passion and great tenacity.\nWe should give some information about the prizes mentioned in this quote. He won the first prize in the Marcha Newspaper Library Literary Contest in the Essay category in\n1970\n, awarded for the publication of the book\nImperialismo y universidades en América Latina\nⓉ\n(\nImperialism and universities in Latin America\n)\n. In Venezuela in\n1981\nhe was awarded the \"Annual Prize for the best scientific work in the area of Mathematics\", in collaboration with Enrique Cabaña, awarded by the National Council for Scientific and Technological Research. For his cooperation with France he received in\n1991\nthe title of \"Knight of the Order of Merit\" from the Government of France. He was elected as a Member of the\nAcademy of Sciences of Latin America\nin\n2003\n. He received the \"Uruguayan Culture Award\", Morosoli de Oro, awarded by the Lolita Rubial Foundation, Minas, Uruguay, in\n2007\n. In\n2011\nhe was appointed by the Ministry of Education and Culture as one of the first fifteen full members of the\nNational Academy of Sciences of Uruguay\n.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}