{
  "nome_completo": "Martin Ohm",
  "nome_curto": "Martin Ohm",
  "ano_nascimento": "1792",
  "ano_morte": "1872",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ohm_Martin/",
  "lugar_nascimento": "Erlangen, Bavaria (now Germany)",
  "lugar_morte": "Berlin, Prussia, German Empire",
  "biografia": "Martin Ohm\n's parents were Maria Elizabetha Beckin\n(1763\n-\n1799)\nand Johann Wolfgang Ohm\n(1753\n-\n1822)\n. The Ohm family were, by tradition, a family of locksmiths. Johann Wolfgang's father, Johann Vincentius Ohm was a locksmith who married Anna Fuchs in Cadolzburg, Bavaria, before moving to Erlangen in\n1764\n. Johann and Anna's eldest son was Johann Wolfgang who served his apprenticeship as a locksmith before returning to Erlangen in\n1785\nwhere he became a master locksmith. He married Maria Elizabetha Beckin\n(\nsome records give her name as Beck\n)\n, the daughter of a tailor, on\n24\nJanuary\n1786\n. They had seven children, only three of whom survived to adulthood. Their eldest child was\nGeorg Simon Ohm\n, who has a biography in this archive and is well-known through the electrical unit named after him. When Martin was eight years old, in the late summer of\n1799\n, his mother died and Martin, as well as his brother Georg Simon and sister Elisabeth Barbara\n(\nborn\n1794)\n, were brought up by their father.\nJohann Wolfgang had not benefited from a university education, nevertheless he had educated himself to a high level and was able to give his sons an excellent education by acting as their teacher. He was ambitious for his sons to attain the best possible education and, despite their somewhat disappointing schooling, brought them to a high standard in mathematics, physics, chemistry and philosophy. The mathematical ability of Martin\n(\nand his brother Georg\n)\nwas recognized at an early age by Karl Christian von Langsdorff, the professor of mathematics at Erlangen, who gave him advice and encouragement. Von Langsdorff told people that the Ohm brothers were a latter-day version of the Bernoulli brothers and they became known locally as budding geniuses. Martin attended the\nGymnasium\nattached to the Friedrich-Alexander University of Erlangen and he entered the university to study mathematics. He received his doctorate in\n1811\nfor his thesis\nDe elevatione serierum infinitarum secundi ordinis ad potestatem exponentis indeterminati\nⓉ\n(\nOn the elevation of the power of the exponent of the second order to an infinite number of series of undetermined terms\n)\n, written with Karl Christian von Langsdorf as his supervisor. In\n1815\nhe published\nDie reine Elementar-Mathematik\nⓉ\n(\nElementary pure mathematics\n)\nwhich is famed for containing the name \"golden section\" for the first time\n(\nat least this is the first known occurrence of the term\n)\n. He taught at the university until\n1817\nwhen he was appointed as a mathematics teacher at the Gymnasium in Thorn.\nOhm was to spend the whole of his career from\n1821\nonwards in Berlin; first he was appointed as a\nprivatdozent\nat the Friedrich Wilhelm University of Berlin\n(\nfounded in\n1809\nand renamed the Humbolt University of Berlin in\n1949)\n, promoted to extraordinary professor in\n1824\nand finally to full professor in\n1839\n. He also taught at other Berlin institutions; for example at the Building Academy, the Military Academy, and the Artillery and Engineer's School. After settling in Berlin, Ohm married Sophie von Alten\n(1786\n-\n1852)\n; they had a daughter Elisa Ohm who was born in Berlin in\n1826\n.\nIt is quite difficult to assess the importance of Ohm's mathematical contributions. The first thing to say is that they certainly were not as important as he himself thought. He had a very high opinion of himself as the following quotation indicates.\nNiels Abel\nwrote to Christopher Hansteen, the professor of astronomy at the University of Christiania, while he was on a visit to Berlin in\n1826\n:-\nThere is at\n[\nAugust Crelle\n's\n]\nhouse some kind of meeting where music is mainly discussed, of which unfortunately I do not understand much. I enjoy it all the same since I always meet there some young mathematicians with whom I talk. At\nCrelle\n's house, there used to be a meeting of mathematicians, but he had to suspend it because of a certain Martin Ohm with whom nobody could get along due to his terrible arrogance.\nThere were basically two sides to Ohm's contributions. Martin Ohm made a distinction between writing for mathematicians and writing for students, a distinction that many of his contemporaries, including\nHermann Grassmann\n, did not consider appropriate. His colleagues\nSteiner\nand\nKummer\nalso ridiculed him for not following Alexander von Humboldt's firm belief in the unity of teaching and research. In\n1822\nOhm published the first two of nine volumes of\nVersuch eines vollkommen consequenten Systems der Mathematik\nⓉ\n(\nAttempt at a completely consequential system of mathematics\n)\n. He continued to publish volumes until\n1852\n. Martin Zerner writes\n[\n4\n]\n:-\nOhm's book has been, as far as I know, the first attempt since\nEuclid\nto write down a logical exposition of everything that was more or less basic in contemporary mathematics, starting from scratch. Moreover, Ohm has a completely formalist conception which contributed a good deal to misunderstandings with research mathematicians of his time. ... Ohm found that a systematic exposition of mathematics was necessary to solve the difficulties that the teaching of mathematics met in early\n19\nth\ncentury Germany.\nHe also published his ideas in books intended for beginners in the subject. For example he published the\n3\n-volume work\nLehrbuch der Elementar-Mathmatik\nⓉ\n(\nTextbook of elementary mathmatics\n)\nfor beginners and also the even more elementary\nLehrbuch für den gesammten mathematischen Elementar-Unterricht\nⓉ\n(\nTextbook of elementary lessons for the whole of mathematics\n)\n. In\n1839\nhe published the more comprehensive\nInstruction book in the whole of higher mathematics\nin two volumes. In order to get a better understanding of why Ohm spent so much of his life on this project we quote from the English translation\nThe Spirit of Mathematical Analysis and its Relation to a Logical System\n(1843\n, German original\n1842)\n:-\nIt is a remarkable fact that complaints of the want of clearness and rigour in that part of Mathematics which respects calculation, - whether it be called 'Arithmetic', Universal Arithmetic', 'Mathematical Analysis', or aught else, - recur from time to time, now uttered by subordinate writers, now repeated by the most distinguished of the learned. One finds contradictions of the theory of \"opposed magnitudes;\" - another is merely disquieted by \"imaginary quantities;\" - a third finally meets difficulties in \"infinite series,\" either because\nEuler\nand other distinguished mathematicians have applied them with success in a divergent form, while the complainant thinks himself convinced that their convergence is a fundamental condition, - or because in general investigations general series occur, which, precisely because they are general, can be neither accounted divergent nor convergent. ... The ... question: how may the paradoxes of calculation be most securely avoided? - obliges us to submit to a very exact examination of the subject of mathematical analysis, its first and simplest ideas, as also the methods of reasoning which are applied to it.\nOhm goes on the explain that this is what he:-\n... zealously did from\n1811\nto\n1821\n, and he published the commencement of his investigations in\n1816\n, and only six years afterwards, a very happy result of them in the first edition\n(1822)\nof the first two volumes of his 'Attempt at a completely consequential system of mathematics'.\nThe approach that Ohm took in that work certainly did not find favour with many as he himself explains that:-\n... he can very well recollect the time when on its first appearance he hardly escaped being declared \"insane\" by several mathematicians on account of his views; when he was even designated in official papers as a 'dangerous' innovator on account of these 'revolutionary' ideas of science, and most persons contented themselves either with a silent shrug of the shoulders, or with publicly accusing him of \"presumption.\" This public resistance only drove the author to test and retest his views continually, and if possible more rigorously, whereby his works have received a better finish ...\nOhm believed that having put mathematics on a firm basis with his books, what was then necessary was to teach the teachers. In\n1832\nhe proposed that a \"Bavarian Institute for the Training of Future Professors of Mathematics and Physics\" be set up. However, the Bavarian Academy, after considering his proposal, concluded that teachers were already given sufficient training. One member of the Academy declared that if any teacher considered he did not receive proper training then he could always be sent to Ohm in Berlin. Ohm's contemporaries all accepted that he was a highly successful teacher but they were starkly divided as to whether this was because of the quality and approach of his books or whether he was such an inspiring teacher that he was successful despite what he put forward in his books.\nLet us note that Ohm tried to put mathematics on a sound basis with a highly abstract approach in the same spirit as\nBourbaki\ndid many years later. His opponents took the same dislike to his approach, for the same reasons, as did the opponents of\nBourbaki\n100\nyears later. The \"new maths\" which became such a popular approach to teaching in the\n1980\ns also developed along lines not dissimilar to those Ohm wanted to follow. What is perhaps surprising is that Martin Ohm has received little recognition for his innovative ideas but perhaps this is because Ohm was unknown to\nBourbaki\nand those who supported the \"new maths\". Even so, the ideas he put forward are worth deep thought since, if for no other reason, the teaching of mathematics is such an important process. Of course teaching mathematics in the\n21\nst\ncentury must, because of the vastly different context, be very different from teaching the subject in the\n19\nth\ncentury. Yet lessons from history must always inform us and make us think. As Martin Zerner writes\n[\n4\n]\n:-\nStudying Martin Ohm can help us think about problems which are indeed very much those of today.\nOther books by Martin Ohm have had an impact, as least for a short while. His treatise\nThe theory of maxima and minima\n(1825)\nmay be regarded as a successor to\nDirksen\n's treatise on the calculus of variations published in\n1823\n.\nTodhunter\nwrites\n[\n2\n]\n:-\n... Ohm gives frequent references to\nDirksen\n, and corrects some of his errors. Ohm's book is very correctly printed, but from the highly condensed notation which he adopts, and from the want of illustrative problems, it is rather a difficult work for a student. The first\n84\npages contain an Introduction, in which the author collects the propositions in algebra and the differential and integral calculus, which are especially used in the ordinary theory of maxima and minima, and in the calculus of variations. ... The portion of the book extending over pages\n87\n-\n127\nis called Calculus of Variations. Ohm's view of a variation is similar to that of\nEuler\nand\nLagrange\n. ... The pages\n131\n-\n208\ncontain the theory of maxima and minima, which is given in ordinary treatises on the Differential Calculus. Ohm endeavours to present this part of the subject under a novel aspect, but it does not appear that there is any real extension or improvement of the common methods.\nTodhunter\ngoes on to look at the more advanced work in the treatise and concludes:-\n... at the time of publication this surpassed all preceding treatises on the subject. It is however at present only of historical interest, as it is completely surpassed by the extensive treatise of Strauch. Strauch in fact may be considered as the successor of Ohm ...\nWe have already mentioned that Ohm was a fine teacher and a number of doctoral students at the University of Berlin benefited from this. In particular we mention three mathematicians who have a biography in this archive who received advice from Ohm while undertaking research;\nPaul Bachmann\n,\nEduard Heine\nand\nRudolf Lipschitz\n. In\n1858\nOhm, together with\nKummer\n, examined\nLazarus Fuchs\n's doctoral dissertation. By\n1864\nOhm was one of only two full professors of mathematics at the University of Berlin\n(\nthe other being\nKummer\n)\n. This presented the university with problems since only full professors could act as examiners of theses yet by this time Ohm was almost blind and could not read a thesis. At this stage the university promoted\nKarl Weierstrass\nwho had been teaching at the University since\n1856\n.\nFinally we note that from\n1849\nto\n1852\nOhm was a member of the Prussian House of Representatives and that Ohmstrasse in Berlin-Mitte is named after Martin Ohm rather than after his now more famous brother. Finally let us quote from Alexander John Ellis who translated\nThe Spirit of Mathematical Analysis and its Relation to a Logical System\nfrom German to English:-\nThe great clearness and precision manifested in these writings, and their extreme simplicity and logical accuracy, made a forcible impression on the mind of the Translator while pursuing his own mathematical studies as few years ago, and he could not help contrasting these Treatises with the vague, half-elaborated works in his own language. Few persons have indeed pursued the study of Mathematical Analysis with the same anxiety and power to improve the foundations upon which it rests, as Professor Ohm. A life continually spent in instructing other has enabled him to test and retest his views by the best touchstones - the mind of the learner.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}