{
  "nome_completo": "Maryna Sergiivna Viazovska",
  "nome_curto": "Maryna Viazovska",
  "ano_nascimento": "1984",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Viazovska/",
  "lugar_nascimento": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "lugar_morte": null,
  "biografia": "Maryna Viazovska\nwas born in Kiev, a city also known as Kyiv. She excelled at mathematics at school in Kiev so, in\n1998\n, she entered the Kiev Natural Science Lyceum no.\n145\n. This Lyceum in the Pechersk district of Kiev was founded in\n1962\nas a specialised mathematics, physics, and computer science school. It is highly selective and only the most outstanding pupils are admitted. The programmes in mathematics and physics were developed for the Lyceum in cooperation with the faculty of the Kiev National University. At this school Viazovska was influenced, in particular, by Andrii Knyazyuk\n(1960\n-\n2013)\n.\nKnyazyuk had himself graduated from the Kiev Natural Science Lyceum no.\n145\nand was awarded a doctorate by the Institute of Mathematics of\nNational Academy of Sciences of Ukraine\nin\n1985\nfor his thesis\nBoundary values of solutions of evolution equations in Banach spaces\n. He worked at the Institute of Mathematics of the Academy of Sciences Ukrainian SSR in Kiev during the\n1980\ns publishing around\n10\npapers on operator-differential equations and related topics. He left his career at the\nUkrainian Academy of Sciences\nto become a teacher at the Kiev Natural Science Lyceum no.\n145\n. Viazovska said in the interview\n[\n3\n]\n:-\nUnfortunately, he has died. He was a professional mathematician, but left science and went to work at the Lyceum. He knew a lot more than he had to teach in the programme, so learning from him was extremely interesting.\nIn\n2001\nViazovska graduated from the Kiev Natural Science Lyceum no.\n145\nand entered the Taras Shevchenko National University of Kiev to study mathematics\n[\n16\n]\n:-\nThe Faculty of Mechanics and Mathematics of the Kiev National University Taras Shevchenko is the best place to study mathematics. This is what my teacher convinced me when it was time to go to university. Then this option suited me perfectly: I wanted to study in Kiev and I was not interested in anything but mathematics.\nWhile studying at the Taras Shevchenko National University of Kiev, Viazovska competed in the Mathematical Olympiad Competition in\n2002\n,\n2003\n,\n2004\nand\n2005\nand won the top award in\n2002\nand\n2005\n. She said\n[\n16\n]\n:-\nI liked Mathematical Olympiads. I remember taking part - and loving mathematics even more.\nIn\n2005\nshe was awarded a Bachelor's Degree in mathematics from the University of Kiev. While at the Taras Shevchenko National University of Kiev, Viazovska began working with Andriy Bondarenko and they published the paper\nBernstein type inequality in monotone rational approximation\n.\nAfter the award of her first degree from the Taras Shevchenko National University of Kiev, Viazovska went to Germany to study for a Master's Degree at the Kaiserslautern University of Technology. She said in the interview\n[\n16\n]\n:-\nI had to choose: stay in Kiev and look for a job or continue my studies abroad. I went and got my master's degree in the German city of Kaiserslautern. On the one hand, it was difficult for me: what is it like to live alone without parents? But on the other hand, I was lucky: I entered a university that cared for foreign students. In addition, I was paid a scholarship. I think that in Ukraine, both in schools and in the initial courses of Mathematics at the University, they teach better than in Germany. But somewhere in the fourth year in Ukraine, most students start to get a job - I mean not only the Faculty of Mechanics and Mathematics of the Kiev National University, but other faculties of any other university. In Germany, students spend more time studying, they do not have to look for work, pushing their studies to the background. In Ukraine, unfortunately, the university is gradually becoming a hobby in the life of an undergraduate.\nIn\n2007\nViazovska graduated with a Master's Degree from Kaiserslautern and in May\n2010\n, she defended her Candidate's thesis at the Institute of Mathematics of the\nNational Academy of Sciences of Ukraine\non the topic \"Inequalities for polynomials and rational functions and quadrature formulas in the sphere\". Here is her Abstract of her thesis:-\nMonotone rational approximation and trigonometric polynomial approximation are investigated, quadrature formulas on the sphere are constructed. A direct analogue of the\nBernstein\ninequality is established for monotonic rational functions. The significance of the exponential dependence of the constant in the right part on the degree of rational function is proved. An exact constant in this inequality is obtained for the case of odd monotone rational functions. An explicit formula for the normalizing factor of the generalized\nJackson\nkernel is found and an asymptotically accurate estimate of its values is obtained. The question of the minimum number of points in a spherical design is considered. An explicit method of constructing spherical designs using quadrature formulas has been developed, and a method using a uniform partition of a sphere has been proposed. It is proved that these constructions can significantly improve the known asymptotic estimates from above of the minimum number of spherical design points in all dimensions of more than two.\nDuring the time she was working on her Candidate's thesis she published two joint papers with Andriy Bondarenko, namely\nNew asymptotic estimates for spherical designs\n(2008)\nand\nSpherical designs via Brouwer fixed point theorem\n(2010)\nas well as the single authored paper\nEstimation of the norm of the derivative of a monotone rational function in the spaces\nL\np\nL_{p}\nL\np\n​\n(2009)\n.\nAfter her Candidate's degree, she went to the\nMax Planck\nInstitute for Mathematics at the Rheinische Friedrich-Wilhelms-Universität Bonn. There she worked towards her Dr. rer. Nat.\n(\nequivalent to a Ph.D.\n)\nadvised by Don Zagier. Zagier, born\n29\nJune\n1951\nin Heidelberg, Germany, studied at MIT, Oxford University, and\nhabilitated\nat the University of Bonn in\n1975\n. After working at the University of Maryland, USA, and the University of Utrecht, he became Director of the Max Planck Institute for Mathematics in\n1995\n. He worked on analytic number theory and modular forms. Viazovska was awarded her Dr. rer. Nat. in\n2013\nfor her thesis\nModular Functions and Special Cycles\n. In fact her collaborator Andriy Bondarenko had received the Seventh Vasil A Popov Prize awarded on\n8\nApril\n2013\nduring the Fourteenth International Conference on Approximation Theory held in San Antonio, Texas, USA. His joint work with Viazovska was part of the work which gained him the award:-\nAndriy Bondarenko was recognized for his outstanding contributions to Approximation Theory. He along, with Radchenko and Viazovska, solved the spherical t-design conjecture by Korevaar and Meyers concerning optimal approximation of integrals over the sphere by arithmetic means of values of the integrand. This result beautifully illustrates the power of the fixed-point method to approximation problems. Andriy Bondarenko has also advanced powerful new ideas in other areas of Approximation Theory, in particular, in monotone rational approximation, one of Vasil A Popov's favourite research areas.\nAfter a time as a postdoctoral researcher at the Institut des Hautes Études Scientifiques in France, Viazovska moved to Berlin in\n2014\nwhere she was a postdoctoral researcher at the Berlin Mathematical School and the Humboldt University of Berlin. In the spring of\n2016\nshe announced she had made an amazing mathematical breakthrough by solving a long standing packing problem. In\n[\n3\n]\nshe gave the background to the problem:-\nThe question is: how many eight-dimensional balls can fit in an eight-dimensional space? That is, at what density can they be packed there? Of course, there are infinitely many of them there, but the weight depends on the density. There have been some assumptions about the configuration of this stacking for a long time, but the tasks of such a problem are difficult to solve. In dimension \"one\" it is a trivial question, because the ball in it is just a segment, and this segment can fit everything\n100\n%. This is not a very difficult issue in the plane either, it was solved at the turn of the\n19\nth and\n20\nth centuries. A sphere on a plane - just a disk, for example, coins of the same size - how many can we put here? In the order of the honeycomb, more than\n90\n% of the plane can be filled.\nIn dimension three, this is a famous\nKepler\nproblem formulated as early as\n1611\n. It was only solved at the end of the twentieth century by computers. There are countless three-dimensional variants of placement of balls, even on a computer it is impossible to check all, but the idea was how to reduce it to a certain finite calculation, though still a very long and complicated one. It is quite a dramatic story. One mathematician announced the solution, but then found many holes in it. In the early\n1990\ns, another scientist from China made a similar statement, but he also found a lot of flaws, and only Tom Hales, after spending several years, recorded the correct answer in\n1998\n. There has been a very meticulous attention to this work, it has been reviewed for a very long time, it has been peer-reviewed for five years, and it has been debated whether it should be considered as a mathematical solution because it relies heavily on computer calculations. But they decided that everything was correct. And recently, Hales also wrote down a formal solution that can be tested using a computer program, which, in fact, is designed to validate just such evidence. It turns out that there is a kind of shortcut in eight-dimensional space, so we can go the easier way. In\n2003\n, there were developments that indicated that this could be proven. I managed to finish this argument logically. Then, working with colleagues, we solved the problem in dimension\n24\n.\nIn\n[\n16\n]\nshe gave more details of how she came to work on this problem:-\nMy discovery is not illumination or chance. I knew about such a task for a long time. The scientific paper, which proposed the method of optimization of this\n8\n-dimensional lattice, was written in\n2003\n. Four years ago\n(\nin\n2012)\n, Kiev mathematician Andriy Bondarenko inspired me to do this. He told me at this time that this task is for me, and I have the necessary knowledge to solve it. I hesitated a long time and two years ago\n(2014)\n, when I moved to Berlin, I started working on it. After I wrote the function for dimension\n8\n, it became clear that the function for dimension\n24\nwould be similar. Henry Cohn, one of the two co-authors of the same work, written in\n2003\n, suggested to me, my colleagues, Stephen Miller, Abinave Kumar, and in Kiev Daniel Radchenko, to work on a\n24\n-dimensional case. With Daniel, we had earlier started working on the same task, but the approaches we applied did not work. So he switched to other problems, and I continued to \"fight\" over the\n8\n-dimensional package. After a week of intensive computing, we checked the assumptions on the computer - and it was confirmed. Of course, there were some nuances, but in general we can say that the same method worked twice.\nViazovska's solution to the\n8\n-dimensional case was published in the paper\nThe sphere packing problem in dimension\n8\n(2017)\n. Her Abstract to the paper is short and precise:-\nIn this paper we prove that no packing of unit balls in Euclidean space\nR\n8\n\\mathbb{R}^{8}\nR\n8\nhas density greater than that of the\nE\n8\nE_{8}\nE\n8\n​\nlattice packing.\nRainer Schulze-Pillot writes in a review:-\nThe author proves in this article that the\nE\n8\nE_{8}\nE\n8\n​\nlattice gives the densest sphere packing in dimension\n8\n. This long-standing problem was reduced by H L Cohn and N D Elkies to the problem of finding a function\nf\nf\nf\non\nR\n8\n\\mathbb{R}^{8}\nR\n8\nfor which both\nf\nf\nf\nand its\nFourier\ntransform satisfy certain conditions ... The author constructs such a function explicitly, using integral transforms of some carefully chosen quotients of modular forms.\nThe\n24\ndimension case was also published in\n2017\nin the paper\nThe sphere packing problem in dimension\n24\nwritten by Henry Cohn, Abhinav Kumar, Stephen D Miller, Danylo Radchenko and Maryna Viazovska. Martib Henk writes in a review:-\nThis is another breakthrough result in sphere packing. After the recent spectacular solution of the sphere packing problem in dimension\n8\nby M S Viazovska, the paper under review solves the problem in dimension\n24\n. The authors show that the maximum sphere packing density in dimension\n24\nis achieved by the\nLeech\nlattice packing and, up to scaling and isometries, it is the only periodic packing of this density. The proof follows the eight-dimensional approach of Viazovska.\nViazovska received major awards for her remarkable achievements, the first award being made even before the papers appeared in print\n[\n15\n]\n:-\nThe\nSalem\nPrize\n2016\nhas been awarded to Maryna Viazovska of Berlin Mathematical School and Humboldt University of Berlin for her breakthrough work on densest sphere packings in dimensions\n8\nand\n24\nusing methods of modular forms. The prize, in memory of\nRaphael Salem\n, is awarded yearly to young researchers for outstanding contributions to the field of analysis.\nShe received more prizes in\n2017\n, the year in which she was appointed to the Swiss Federal Institute of Technology, Lausanne, Switzerland. There was the European Prize in Combinatorics\n[\n4\n]\n:-\nThe European Prize of Combinatorics\n2017\nwas awarded to ... Maryna Viazovska\n(\nEPFL\n)\nfor her deep contributions to spherical designs and particularly for the solution of the sphere packing problem in dimensions\n8\nand\n24\n. The prize ceremony took place at the TU Wien at the Opening of the Eurocomb\n2017\nconference on\n28\nAugust\n2017\n.\n[\nShe\n]\ngave a prize lecture on\n30\nAugust as part of the Eurocomb conference.\nAlso in\n2017\nthere was the Clay Research Award\n[\n2\n]\n:-\nA Clay Research Award is made to Maryna Viazovska\n(\nPrinceton University and École Polytechnique Fédérale de Lausanne\n)\nin recognition of her groundbreaking work on sphere-packing problems in eight and twenty-four dimensions. In particular, her innovative use of modular and quasimodular forms, which enabled her to prove that the\nE\n8\nE_{8}\nE\n8\n​\nlattice is an optimal solution in eight dimensions. The award will be presented at the\n2017\nClay Research Conference and Workshops Sunday,\n24\nSeptember\n2017\nto Friday,\n29\nSeptember\n2017\n.\nIn December\n2017\nshe received the\n2017\nShanmugha Arts, Science, Technology & Research Academy\n(\nSASTRA\n)\nRamanujan\nPrize\n[\n14\n]\n:-\nMaryna Viazovska of Swiss Federal Institute of Technology, Lausanne, Switzerland, will receive\n2017\nSASTRA\nRamanujan\nPrize for her contribution to number theory. ... The prize will be awarded during\n21\n-\n22\nDecember\n2017\nat the International Conference on Number Theory at SASTRA University in Kumbakonam\n(\nRamanujan's hometown\n)\nwhere the prize has been given annually.\nIn January\n2018\nshe was promoted to full professor at the École Polytechnique Fédérale de Lausanne and later that year she received the\n2018\nNew Horizons in Mathematics Prize\n[\n10\n]\n:-\nFor remarkable application of the theory of modular forms to the sphere packing problem in special dimensions.\nHere is her reply to receiving this award\n[\n10\n]\n:-\nScience is a collaborative effort, and quick progress is possible when people openly share their knowledge and ideas. I would like to thank my teachers, colleagues, and co-authors, as without them none of my research would be possible. I am grateful to my teachers Andriy Knyaziuk, Sergiy Ovsienko, Gerhard Pfister, Igor Shevchuk, and Don Zagier for their guidance, enthusiasm, and great patience. I thank Andriy Bondarenko, Henry Cohn, Abhinav Kumar, Steven Miller, Danylo Radchenko, and Daniil Yevtushynsky for the projects we have done together and for everything they have taught me. Also, I thank my family for their love and support.\nViazovska was an invited speaker in the Combinatorics and Number Theory Section of the\n2018\nInternational Congress of Mathematicians in Rio de Janeiro. She gave a talk about her research on sharp sphere packings.\nLate in\n2018\nit was announced that she would receive the\n2019\nRuth Lyttle Satter Prize in Mathematics\n[\n11\n]\n:-\nThe\n2019\nRuth Lyttle Satter Prize in Mathematics will be awarded to Maryna Viazovska, École Polytechnique Fédérale de Lausanne\n(\nSwitzerland\n)\n, for her groundbreaking work in discrete geometry and her spectacular solution to the sphere-packing problem in dimension eight. ... Maryna Viazovska's work has been described as \"simply magical,\" \"very beautiful\" and \"extremely unexpected.\" Her solution to the sphere-packing problem in dimension eight, while conceptually simple, has a deep structure based on certain functions that she explicitly constructs in terms of modular forms. It establishes a new, unanticipated connection between modular forms and discrete geometry.\nViazovska has continued to make further breakthroughs. Erica Klarreich writes in May\n2019\n[\n7\n]\n:-\nThree years ago, Maryna Viazovska, of the Swiss Federal Institute of Technology in Lausanne, dazzled mathematicians by identifying the densest way to pack equal-sized spheres in eight- and\n24\n-dimensional space\n(\nthe second of these in collaboration with four co-authors\n)\n. Now, she and her co-authors have proved something even more remarkable: The configurations that solve the sphere-packing problem in those two dimensions also solve an infinite number of other problems about the best arrangement for points that are trying to avoid each other. The points could be an infinite collection of electrons, for example, repelling each other and trying to settle into the lowest-energy configuration. Or the points could represent the centres of long, twisty polymers in a solution, trying to position themselves so they won't bump into their neighbours. There's a host of different such problems, and it's not obvious why they should all have the same solution. In most dimensions, mathematicians don't believe this is remotely likely to be true. But dimensions eight and\n24\neach contain a special, highly symmetric point configuration that, we now know, simultaneously solves all these different problems. In the language of mathematics, these two configurations are \"universally optimal.\"\nLet us end this biography with Viazovska's aims for the future\n[\n5\n]\n:-\nViazovska's work has potential reverberations in several other fields, including energy minimization, free interpolation formulas, and signal processing. But, she is not sure where her research might apply. \"I'm a theoretical mathematician, so I don't know that much about practical problems,\" she joked. The Ukrainian mathematician hopes for an even bigger breakthrough and dreams of winning the\n2022\nFields\nMedal: \"I'm\n33\n, so I have one more chance,\" she said. Solving a mathematical problem that has been around for centuries is no small feat, but Viazovska has bigger ambitions. \"The most incredible results come from ideas about problems that no one had before. Questions that no one even thought to ask,\" she said. \"I hope to do something like that. I can't tell you much about it, because I haven't thought of it yet.\"\nIn\n2022\nshe did indeed win a\nFields\nMedal\n[\n22\n]\n:-\nFor the proof that the\nE\n8\nE_{8}\nE\n8\n​\nlattice provides the densest packing of identical spheres in\n8\ndimensions, and further contributions to related extremal problems and interpolation problems in Fourier analysis.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}