{
  "nome_completo": "Max Born",
  "nome_curto": "Max Born",
  "ano_nascimento": "1882",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Born/",
  "lugar_nascimento": "Breslau, Germany (now Wrocław, Poland)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Max Born\nwas born into a Jewish family. His father, Gustav Born, was a distinguished medical professor of embryology at the University of Breslau. Max's mother, Margarete Kaufmann, came from a Breslau family who were in the textile industry. It was from his mother that Max inherited his love of music, but sadly she died when he was four years old. Gustav then appointed governesses to look after Max and his younger sister over the next four years until\n1890\nwhen he married again. The family provided a cultured and academic background for Max as he grew up but, although Max's new mother looked after the family well, neither Max nor his sister formed a particularly loving relationship with her.\nMax attended the König Wilhelm\nGymnasium\nin Breslau, studying a wide range of subjects such as mathematics, physics, history, modern languages, Latin, Greek, and German. He showed little promise at school and in particular he showed more interest in the humanities than in the sciences. Entering the University of Breslau in\n1901\nhe took a wide range of science subjects, mainly to go along with his father's wishes\n(\nhis father had died shortly before Max left school\n)\n. The list of courses he took in session\n1901\n-\n02\nwas certainly impressive, including mathematics, astronomy, physics, chemistry, logic, philosophy, and zoology.\nMax's favourite subjects from the ones he studied were mathematics and astronomy and he thought of specialising in astronomy. Students in Germany at this time moved from university to university and Born was no exception spending\n1902\nin Heidelberg, then\n1903\nat Zürich. In Zürich he attended his first course on advanced mathematics, a course by\nHurwitz\non\nelliptic functions\n.\nBack in Breslau he talked to his fellow students\nToeplitz\nand\nHellinger\nwho told him of the great teachers of mathematics,\nKlein\n,\nHilbert\nand\nMinkowski\n, at the University of Göttingen. Born was soon in Göttingen attending lectures by\nHilbert\nand\nMinkowski\n. He became\nHilbert\n's assistant in\n1905\n, continuing to attend lectures by\nKlein\nand\nRunge\non elasticity and a seminar by\nHilbert\nand\nMinkowski\non electrodynamics. Perhaps the most benefit he derived from his famous teachers was during walks he would make in the woods with\nHilbert\nand\nMinkowski\nwhere all manner of fascinating subjects were discussed in addition to mathematics, such as problems of philosophy, problems of politics, and social problems. However he annoyed\nKlein\nby only making irregular attendances at his lectures, so Born decided to substitute astronomy for geometry as one of his doctoral subjects. He attended\nSchwarzschild\n's astronomy lectures and successfully obtained his doctorate in\n1907\nfor a thesis on elastic stability.\nIn addition to the mathematicians mentioned above, Born was in contact with\nCourant\n,\nSchmidt\nand\nCarathéodory\naround this period. After the award of his doctorate, Born undertook compulsory military service, but because he suffered from asthma he served for much less than the standard period of one year. It was enough to make him loath all things military, however. After this he visited Caius College, Cambridge, for six months but made less of\nLarmor\n's lectures than he might because he had difficulty with\nLarmor\n's Irish accent.\nLeaving Cambridge, Born returned to Breslau. Around this time Born read\nEinstein\n's\n1905\npapers on relativity and was immediately captivated. His work on combining ideas of\nEinstein\nand\nMinkowski\nled to an invitation to Göttingen in\n1909\nand he began a collaboration with\nMinkowski\nwho died only weeks after the collaboration had begun\n[\n8\n]\n:-\nBorn relates how cast down he was by what he felt was the ruin of his hopes, how he again fell foul of\nKlein\n, but managed through the good offices of\nRunge\nto convince\nHilbert\nof the soundness of his ideas.\nIn\n1912\nBorn was offered a post in Göttingen and, once on the teaching staff, he began a research project with von\nKármán\n. This work was on lattice dynamics where they identified the degrees of freedom of a crystal with the normal modes of vibration of the whole body. Their work uses three dimensional\nFourier analysis\nand periodic\nboundary conditions\n. Born married Hedwig Ehrenberg, the daughter of a Professor of Law at Göttingen, in\n1913\n. They had one son and two daughters.\nIn\n1914\nBorn was offered a chair at Berlin where he became a colleague of\nPlanck\n. Of course this coincided with the start of World War I and, although Born had already developed a loathing for the military, he had little choice but to contribute to the war effort. His first contribution was as a radio operator in the German air force, but soon he was involved in research in sound ranging in the artillery. This took him away from active duty, and he continued to request that his former colleagues and students who were serving on the front join him so that they likewise could avoid active duty. The war years were ones of exceptional difficulty for Born, eased by his friendship with\nEinstein\n. They shared a love of music and they would play violin sonatas together,\nEinstein\non the violin and Born on piano.\nIn April\n1919\nhe moved to a chair in Frankfurt-am-Main also becoming Director of the Institute of Theoretical Physics there. Two years later Born was back in Göttingen as Director of the Physical Institute. In\n1921\n, the year he became Professor at Göttingen, he reformulated the First Law of Thermodynamics. Beginning in\n1926\n, Born collaborated with\nPauli\nand\nHeisenberg\n, who was a student of Born's, on\nquantum mechanics\n(\nthe term \"quantum mechanics\" is due to Born\n)\n. He recognised\nHeisenberg\n's approach to quantum mechanics as being\nmatrix\nalgebra.\nBorn produced work of fundamental importance in quantum mechanics beginning with this collaboration. His treatment replaced the original quantum theory, which regarded electrons as particles, with a mathematical description representing their observed behaviour more accurately.\nHowever, as a Jew, Born was forced to flee Germany in\n1933\nand, after a short while in the north of Italy, he accepted an offer to became\nStokes\nlecturer at Cambridge\n[\n3\n]\n:-\nHe later spoke very warmly of the way in which he had been received and made welcome in\n[\nBritain\n]\n. For the next few years he and his wife devoted much effort to giving help and advice to others from Germany and Austria who had to emigrate.\nAfter a short time in India, in\n1936\nhe became\nTait\nprofessor of applied mathematics at the University of Edinburgh in Scotland. There he introduced a continental style research group comprising mostly of refugees from Europe. One of his research students described Born's days in Edinburgh:-\nWhen Born arrived in the morning he first used to make the round of his research students, asking them whether they had any progress to report, and giving them advice, sometimes presenting them with sheets of elaborate calculations concerning their problems which he had himself done the day before. ... The rest of the morning was spent by Born in delivering his lectures to undergraduate honours students, attending to departmental business, and doing research work of his own. Most of the latter, however he used to carry out at home in the afternoons and evenings.\nAfter he retired in\n1953\nBorn returned Germany making his home in Bad Pyrmont, near Göttingen. Soon after he received his greatest honour when he was awarded the\n1954\nNobel Prize for his statistical studies of wave functions. During this period he became interested in the philosophy of science as well as the impact of science on human affairs\n[\n3\n]\n:-\nHe was deeply concerned about the danger to the world from future war and mass destruction, and took the initiative in\n1955\nto get a statement on this subject signed by a gathering of Nobel Laureates.\nBorn received many honours, far too numerous to name more than a few: he was elected a fellow of the\nRoyal Society\nin\n1939\nand awarded its Hughes Medal in\n1950\n:-\n... for his contributions to theoretical physics an general and to the development of quantum mechanics in particular.\nHe received the\nStokes\nMedal from the University of Cambridge, two German schools were named after him and he was made an honorary member of academies in Russia, India, Romania, Peru, Ireland, Scotland, Denmark, Sweden and the USA.\nBorn wrote many textbooks and monographs, mostly for students or experts in the subjects but some are excellent popular accounts of science. His publication list includes at least\n360\nitems.\nIn\n[\n3\n]\nthe following tribute is paid to Born:-\nHe was respected and honoured for many important contributions to his subject and for his wisdom and success as a teacher. He was widely known for his exposition of the ideas of physics to the layman, and he was held in affection by his many colleagues and pupils for the warmth and simple directness of his personality.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Statistics"
  ]
}