{
  "nome_completo": "Menahem Max Schiffer",
  "nome_curto": "Menahem Schiffer",
  "ano_nascimento": "1911",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schiffer/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Menahem Schiffer\nwas born into a Jewish family in Berlin. He attended a\nGymnasium\nin Berlin which placed particular emphasis on science and mathematics. He graduated in\n1930\nand, in the same year, he entered the Friedrich-Wilhelm University of Berlin with the intention of specialising in physics. He was taught physics by Max von Laue, Walter Nernst and\nErwin Schrödinger\n. He also studied mathematics attending lectures by\nLudwig Bieberbach\n,\nErhard Schmidt\nand\nIssai Schur\n. As mathematics became at least equal to physics as Schiffer's main interest,\nSchrödinger\nfelt that his young pupil had to make a decision to specialise in one or the other. He pushed Schiffer into choosing and, after some considerable thought on the matter, Schiffer decided that he would concentrate on mathematics.\nThe year\n1933\nwas a major turning point in German politics and, as a consequence, German education suffered a dramatic blow. When Hitler became Chancellor of Germany in\n1933\n, he immediately announced legal actions against Germany's Jews. On\n7\nth\nApril\n1933\n, Hitler introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. Nernst was forced to retire, von Laue showed great courage in speaking out against the Nazis and helping Jewish colleagues, while\nSchrödinger\ndecided that he could not live in a country which persecuted Jews and he had left Germany before the end of\n1933\n. By this time Schiffer was specialising in mathematics and his mathematics teachers followed rather different courses from those who had taught him physics.\nBieberbach\nwas a strong supporter of the Nazi cause and\nSchmidt\ninitially welcomed Hitler and the Nazis although he was always supportive of all his students. Despite his support for nationalism, Schiffer described\nSchmidt\nas\n[\n4\n]\n:-\n... a great scientist, a decent man, and a loyal friend.\nSchiffer was undertaking research advised by\nIssai Schur\nbut, since both were Jewish, they suffered increasing difficulties.\nSchur\nhad held an appointment before World War I which should have qualified him to remain as a civil servant, but the facts were not allowed to get in the way, and he was 'retired'. Schiffer wrote\n[\n4\n]\n:-\nWhen\nSchur\n's lectures were cancelled there was an outcry among the students and professors, for\nSchur\nwas respected and very well liked. The next day\nErhard Schmidt\nstarted his lecture with a protest against this dismissal and even\nBieberbach\n, who later made himself a shameful reputation as a Nazi, came out in\nSchur\n's defence.\nSchur\nwent on quietly with his work on algebra at home.\nBy the time Schiffer's first paper\nEin neuer Beweis des Endlichkeitssatzes für Orthogonalinvarianten\nⓉ\n(\nA new proof of the Compactness theorem for orthogonal invariants\n)\non invariant theory was published in\nMathematische Zeitschrift\nin\n1934\n, he had left Germany and settled in Palestine.\nSchur\nremained in Germany so Schiffer had to find a new doctoral advisor at the Hebrew University of Jerusalem. However, his research undertaken in Germany and published in his\n1946\npaper was accepted for a Master's Degree at the Hebrew University and Schiffer was awarded this degree in\n1934\n. He undertook research, advised by\nMichael Fekete\nwho had emigrated from Hungary in\n1928\nand was a professor at the Hebrew University and Director of the University's\nEinstein\nInstitute of Mathematics. Schiffer's area was now quite different from that which he had studied with\nSchur\n, and he was awarded his doctorate in\n1938\nfor his thesis\nConformal Representation and Univalent Functions\n. The authors of\n[\n1\n]\nwrite:-\nHis thesis introduced what was later to be known universally as the \"Schiffer variation\", actually one of two important variational methods that he initiated and developed.\nWhile Schiffer was undertaking research in Jerusalem he married Fanya Rabinivics in\n1937\n; they had a daughter Dinah\n(\nnow Dinah S Singer, Head of the Molecular Regulation Section, Experimental Immunology Branch, National Cancer Institute, U.S. National Institutes of Health\n)\n. After the award of his doctorate, Schiffer remained on the staff at the Hebrew University until\n1946\n. He was a Senior Assistant from\n1938\nto\n1943\nand then a Lecturer until he moved to the United States in\n1946\n. During these years he did excellent research on the Calculus of Variations. The authors of\n[\n2\n]\ngive an overview:-\nThe 'Calculus of Variations' - formulating and solving problems in terms of a quantity to be maximized or minimized and analysing the properties of such extremal solutions - had already been and remains an established, highly developed, and highly effective area of mathematical analysis and its applications. It was Schiffer's work that opened up the possibility of applying variational methods in a systematic way to geometric problems in complex analysis. His results provided new, powerful, and flexible tools for studying classical problems, and they moved the subject in exciting new directions. He had great success in applying his methods to many fundamental questions, and anyone working in the field has to be familiar with the techniques he crafted.\nHe published papers such as:\nSur la variation de la fonction de Green de domaines plan quelconques\nⓉ\n(\nOn the change of the Green function of any plane domain\n)\n(1939)\n;\nSur la variation du diamètre transfini\nⓉ\n(\nOn the change in transfinite diameter\n)\n(1940)\n;\nVariation of the Green function and theory of the p-valued functions\n(1943)\n; and\nBounded functions of two complex variables\n(1944)\n.\nIn\n1946\nSchiffer moved to the United States when he was appointed as a Research Lecturer at Harvard University. He spent the academic year\n1949\n-\n50\nas a Visiting Professor at Princeton University before returning to the Hebrew University where he was appointed Professor of Mathematics. Before leaving the United States, he was an invited speaker at the International Congress of Mathematicians held in Cambridge, Massachusetts, from\n30\nAugust to\n6\nSeptember\n1950\n. He gave the talk\nVariational methods in the theory of conformal mapping\n. After a year in Israel, Schiffer was back in the United States in\n1951\nworking at Stanford University in Palo Alto, California. At this time\nGeorge Pólya\nand\nGábor Szegő\nwere on the faculty at Stanford but\nPólya\nwas about to retire.\nSzegő\nwrote\n(\nsee, for example,\n[\n2\n]\n)\n:-\nAt the end of the academic year\n1951\n-\n52\n, Professor\nGeorge Pólya\nof the Mathematics Department will retire. The department has the conviction, shared by Professor\nPólya\nhimself, that there would not be a better replacement for him than Schiffer.\nSchiffer was appointed as Professor of Mathematics at Stanford on\n1\nSeptember\n1952\n. He served as Chair of the Mathematics Department from\n1954\nto\n1959\n.\nWhile he was a young faculty member at the Hebrew University, Schiffer began a collaboration with\nStefan Bergman\nand they continued to collaborate through the years that they spent together at Harvard during the second half of the\n1940\ns. Their first joint paper\nBounded functions of two complex variables\nwas published in\n1944\nand over the years they published eleven joint papers before\nBergman\nwas appointed to Stanford University in\n1952\nand they were again at the same institution. They wrote the monograph\nKernel functions and elliptic differential equations in mathematical physics\n(1953)\ntying together their joint work. Paul Garabedian begins a review of the book as follows:-\nIn this book the authors collect their researches of the last few years on elliptic partial differential equations. The first part of the book is devoted largely to background material on heat conduction, fluid dynamics, electrostatics, and elasticity, together with the more formal applications of variational formulas and the kernel function. The second part lays more stress on rigour, and treats fundamental solutions, reduction of boundary value problems to\nintegral equations\n, orthonormal systems and kernel functions, eigenvalue problems associated with the kernels, variational theory of domain functions, comparison domains, basic existence theorems, and dependence of solutions on the boundary data or on the coefficients of the differential equation. The presentation is in an easy flowing style, and the material should prove to be a most useful guide to those interested in the more advanced theory of linear elliptic partial differential equations.\nIn addition to\nBergman\n, another with whom Schiffer collaborated over many years was\nDonald C Spencer\n. Their joint publications began in\n1949\nand included papers such as\nThe coefficient regions of schlicht functions\n(1949)\n(\nwhich also had A C Schaeffer as a co-author\n)\n,\nThe coefficient problem for multiply-connected domains\n(1950)\n,\nA variational calculus for Riemann surfaces\n(1951)\nand\nSome remarks on variational methods applicable to multiply connected domains\n(1952)\n. Schiffer and\nSpencer\npublished the monograph\nFunctionals of finite Riemann surfaces\n(1954)\n. Maurice Heins begins a review writing:-\nPrior investigations of the authors and their collaborators have been concerned with aspects of the theory of the conformal mapping of plane regions in which domain functions, variational methods, and the problem of coefficient domains are central considerations. The object of the present monograph is to give a systematic account of functionals of finite\nRiemann\nsurfaces and to apply the methods developed to investigations which include as special cases some of the earlier work of the authors.\nSchiffer was invited at give a plenary lecture at the International Congress of Mathematicians held in Edinburgh, Scotland, in August\n1958\n. His lecture entitled\nExtremum problems and variational methods in conformal mapping\nwas published in the Proceedings and reviewed by Zeev Nehari who writes:-\nThis is a very readable exposition of the author's variational method and some of its applications to the theory of conformal mapping. Although the method yields in all cases first-order differential equations for the analytic arcs bounding the extremal domains, these equations will contain - except in some of the simpler problems - accessory parameters which are not known a priori and which have to be determined by additional considerations using the special features of the problem on hand. This is illustrated by a number of examples in which these parameters are found - and thus the corresponding extremal problem is solved - in various ingenious ways. Considerable space is devoted to the coefficient problem for analytic functions univalent in the unit disk. The paper concludes with a description of the author's method for obtaining a lower bound for the first eigenvalue of the\nPoincaré\n-\nFredholm\nintegral equation in the case of a simply-connected domain bounded by an analytic curve.\nWhen he had been an undergraduate, Schiffer had found it difficult to choose between mathematics and physics. Although he decided to make a career in mathematics, he certainly never lost his interest in physical applications. He was keen to apply his complex analysis results to mathematical physics, particularly making important contributions to the partial differential equations of hydrodynamics. As well as teaching pure mathematics courses at Stanford, he also taught graduate courses in applied mathematics and mathematical physics\n[\n2\n]\n:-\nStudents from all departments flocked to them, and so did many faculty. Each lecture was a perfect set piece - no pauses, no slips, and no notes.\nTeaching these courses led to him being a joint author of the textbook\nIntroduction to general relativity\n(1965)\nwritten jointly with Ronald Adler and Maurice Bazin. Schiffer was appointed to the Robert Grimmett Professorship of Mathematics in\n1967\n, holding this endowed chair until he retired in\n1977\n. He continued to undertake research after he retired, publishing his final research paper\n(\nwith Peter Duren\n)\nRobin functions and distortion of capacity under conformal mapping\nin\n1993\n. Also during his retirement he co-authored the book\nThe role of mathematics in science\n(1984)\nwith Leon Bowden. Schiffer and Bowden write:-\nOur primary aim is to illustrate the power and elegance of mathematical reasoning in science; our secondary aim, to show also that science engenders mathematics. We start with\nArchimedes\nwork on the lever, which, based on our common experience of carrying ladders, confirms our bone borne intuition. We finish with the work of\nEinstein\n, which, as we have no experience of \" unaccustomed dimensions\"  such as intergalactic travel at nearly the speed of light, disconcertingly discomforts us with situations beyond our intuitive grasp. Here mathematics comes into its own; to give brain borne counsel where bone borne guidance fails; to give such comforting assurance that scientists justifiably call it a sixth sense. Our ultimate aim is to help develop this sixth sense in as wide a readership as possible; we have restricted technical mathematics to minimum, just algebra and some calculus. therefore let none be deterred!\nGerald Heuer certainly feels that these aims are achieved:-\nBy a skilful use of symmetry, common experience and intuition, thought experiments and reference to key physical experiments in the history of science, the authors lead the reader through a development of the mathematical expression of several laws of science. The principal science topics covered are the lever and inclined plane, population growth, geometric optics and special relativity. Matrices and the associated linear transformations of the plane are introduced, enabling the authors to take advantage of these tools in the discussion of relativity theory, which occupies the last third of the book. All of the famous equations associated with that theory are derived here. The discussion is clear, thorough and well motivated, and the reader is encouraged to participate through occasional exercises. Students and teachers at both high school and college level will be pleased, perhaps surprised, at how readily they may follow this development with the aid of only a modest background in differential calculus.\nSchiffer received many honours including being elected to the\nAmerican Academy of Arts and Sciences\nin\n1968\nand to the\nNational Academy of Sciences\nin\n1970\n. In\n1976\nhe was chosen as one of the first recipients of the Dean's Award for Teaching in Stanford University's School of Humanities and Sciences. In the same year the\nJournal d'Analyse Mathématique\npublished a special volume dedicated to Schiffer on the occasion of his\n65\nth\nbirthday.\nThe authors of\n[\n1\n]\nwrite:-\nMenahem Schiffer's passing marked the end of an era, in which celebrated names from the \"old world\", including\nBergman\n,\nLoewner\n,\nPólya\n, Schiffer, and\nSzegő\n, created at Stanford University one of the great world centres for classical analysis.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}