{
  "nome_completo": "Menaechmus",
  "nome_curto": "Menaechmus",
  "ano_nascimento": "380 BC",
  "ano_morte": "320 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Menaechmus/",
  "lugar_nascimento": "Alopeconnesus, Asia Minor (now Turkey)",
  "lugar_morte": null,
  "biografia": "Menaechmus\nis mentioned by\nProclus\nwho tells us that he was a pupil of\nEudoxus\nin the following quote\n(\nsee for example\n[\n3\n]\n)\n:-\nAmyclas of Heraclea, one of the associates of\nPlato\n, and Menaechmus, a pupil of\nEudoxus\nwho had studied with\nPlato\n, and his brother\nDinostratus\nmade the whole of geometry still more perfect.\nThere is another reference in the\nSuda Lexicon\n(\na work of a\n10\nth\ncentury Greek lexicographer\n)\nwhich states that Menaechmus was\n(\nsee for example\n[\n1\n]\n)\n:-\n... a Platonic philosopher of Alopeconnesus, or according to some of Proconnesus, who wrote works of philosophy and three books on\nPlato\n's Republic...\nAlopeconnesus and Proconnesus are quite close, the first in Thrace and the second in the sea of Marmara, and both are not far from Cyzicus where Menaechmus's teacher\nEudoxus\nworked. The dates for Menaechmus are consistent with his being a pupil of\nEudoxus\nbut also they are consistent with an anecdote told by\nStobaeus\nwriting in the\n5\nth\ncentury AD. Stobaeus tells the rather familiar story which has also been told of other mathematicians such as\nEuclid\n, saying that\nAlexander the Great\nasked Menaechmus to show him an easy way to learn geometry to which Menaechmus replied\n(\nsee for example\n[\n1\n]\n)\n:-\nO king, for travelling through the country there are private roads and royal roads, but in geometry there is one road for all.\nSome have inferred from this\n(\nsee for example\n[\n4\n]\n)\nthat Menaechmus acted as a tutor to Alexander the Great, and indeed this is not impossible to imagine since as Allman suggests\nAristotle\nmay have provided the link between the two. There is also an implication in the writings of\nProclus\nthat Menaechmus was the head of a School and this is argued convincingly by Allman in\n[\n4\n]\n. If indeed this is the case Allman argues that the School in question was the one on Cyzicus where\nEudoxus\nhad taught before him.\nMenaechmus is famed for his discovery of the\nconic sections\nand he was the first to show that\nellipses\n,\nparabolas\n, and\nhyperbolas\nare obtained by cutting a cone in a plane not parallel to the base. It has generally been thought that Menaechmus did not invent the words 'parabola' and 'hyperbola', but that these were invented by Apollonius later. However recent evidence in\nDiocles\n'\nOn burning mirrors\ndiscovered in Arabic translation in the\n1970\ns, led G J Toomer to claim that both the names 'parabola' and 'hyperbola' are older than Apollonius.\nMenaechmus made his discoveries on conic sections while he was attempting to solve the problem of\nduplicating the cube\n. In fact the specific problem which he set out to solve was to find two mean proportionals between two straight lines. This he achieved and therefore solved the problem of the duplicating the cube using these conic sections. Menaechmus's solution is described by\nEutocius\nin his commentary to\nArchimedes\n'\nOn the sphere and cylinder\n.\nSuppose that we are given\na\n,\nb\na, b\na\n,\nb\nand we want to find two mean proportionals\nx\n,\ny\nx, y\nx\n,\ny\nbetween them. Then\na\n:\nx\n=\nx\n:\ny\n=\ny\n:\nb\na : x = x : y = y : b\na\n:\nx\n=\nx\n:\ny\n=\ny\n:\nb\nso, doing a piece of modern mathematics,\na\nx\n=\nx\ny\n\\Large\\frac{a}{x}\\normalsize  = \\Large\\frac{x}{y}\nx\na\n​\n=\ny\nx\n​\nso\nx\n2\n=\na\ny\nx^{2} = ay\nx\n2\n=\na\ny\n, and\na\nx\n=\ny\nb\n\\Large\\frac{a}{x}\\normalsize  = \\Large\\frac{y}{b}\nx\na\n​\n=\nb\ny\n​\nso\nx\ny\n=\na\nb\nxy = ab\nx\ny\n=\na\nb\n.\nWe now see that the values of\nx\nx\nx\nand\ny\ny\ny\nare found from the intersection of the parabola\nx\n2\n=\na\ny\nx^{2}= ay\nx\n2\n=\na\ny\nand the rectangular hyperbola\nx\ny\n=\na\nb\nxy = ab\nx\ny\n=\na\nb\n. Of course we must emphasis that this in no way indicates the way that Menaechmus solved the problem but it does show in modern terms how the parabola and hyperbola enter into the solution to the problem.\nImmediately following this solution,\nEutocius\ngives a second solution. Again a piece of modern mathematics illustrates it:\na\nx\n=\nx\ny\n\\Large\\frac{a}{x}\\normalsize  = \\Large\\frac{x}{y}\nx\na\n​\n=\ny\nx\n​\nso\nx\n2\n=\na\ny\nx^{2} = ay\nx\n2\n=\na\ny\n, and\nx\ny\n=\ny\nb\n\\Large\\frac{x}{y}\\normalsize  = \\Large\\frac{y}{b}\ny\nx\n​\n=\nb\ny\n​\nso\ny\n2\n=\nb\nx\ny^{2} = bx\ny\n2\n=\nb\nx\n.\nWe now see that the values of\nx\nx\nx\nand\ny\ny\ny\nare found from the intersection of the two parabolas\nx\n2\n=\na\ny\nx^{2} = ay\nx\n2\n=\na\ny\nand\ny\n2\n=\nb\nx\ny^{2} = bx\ny\n2\n=\nb\nx\n.\n[\n1\n]\n,\n[\n3\n]\nand\n[\n4\n]\nall consider a problem associated with these solutions.\nPlutarch\nsays that\nPlato\ndisapproved of Menaechmus's solution using mechanical devices which, he believed, debased the study of geometry which he regarded as the highest achievement of the human mind. However, the solution described above which follows\nEutocius\ndoes not seem to involve mechanical devices. Experts have discussed whether Menaechmus might have used a mechanical device to draw his curves.\nAllman\n[\n4\n]\nsuggests that Menaechmus might have drawn the curves by finding many points on them and that this might be considered as a mechanical device. The solution proposed to this question in\n[\n1\n]\n, however, seems particularly attractive. What has come to be known as\nPlato\n's solution to the problem of duplicating the cube is widely recognised as not due to\nPlato\nsince it involves a mechanical instrument.\nHeath\n[\n3\n]\nwrites:-\n... it seems probable that someone who had Menaechmus's second solution before him worked to show how the same representation of the four straight lines could be got by a mechanical construction as an alternative to the use of conics.\nThe suggestion made in\n[\n1\n]\nis that the 'someone' of this quote was Menaechmus himself.\nOther references to Menaechmus include one by\nTheon of Smyrna\nwho suggests that he was a supporter of\nEudoxus\n's theory of the heavenly bodies based on\nconcentric spheres\n. In fact\nTheon of Smyrna\nclaims that Menaechmus developed the theory further by adding further spheres. There have been conjectures made as to where this information was written down by Menaechmus so that it was available to\nTheon of Smyrna\n. One conjecture is that it appeared in Menaechmus's commentaries on\nPlato\n's\nRepublic\nreferred to in the quote above from the\nSuda Lexicon\n.\nProclus\nwrites about Menaechmus saying that he studied the structure of mathematics\n[\n4\n]\n:-\n... he discussed for instance the difference between the broader meaning of the word element\n(\nin which any proposition leading to another may be said to be an element of it\n)\nand the stricter meaning of something simple and fundamental standing to consequences drawn from it in the relation of a principle, which is capable of being universally applied and enters into the proof of all manner of propositions.\nAnother matter relating to the structure of mathematics which Menaechmus discussed was the distinction between theorems and problems. Although many had claimed that the two were different, Menaechmus on the other hand claimed that there was no fundamental distinction. Both are problems, he claimed, but in the usage of the terms they are directed towards different objects.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}