{
  "nome_completo": "Michio Suzuki",
  "nome_curto": "Michio Suzuki",
  "ano_nascimento": "1926",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suzuki_Michio/",
  "lugar_nascimento": "Chiba, Japan",
  "lugar_morte": "Mitaka, Japan",
  "biografia": "Michio Suzuki\nhad two brothers Tatsuzo Suzuki and Sadao Suzuki. Michio Suzuki studied at the Third High School of Japan in Kyoto, entering the school in April\n1942\n. This followed the practice in Japan at this time to send exceptionally talented boys to one of a small number of senior high schools before entering university. There were a number of pupils at the Third High School who went on to make major contributions to mathematics, for example Noboro Ito and\nHidehiko Yamabe\nwere a class above Suzuki, being slightly older than him. Of course all of Suzuki's time at high school coincided with World War II and so his education was quite seriously disrupted. Quite often classes could not be held regularly and Suzuki had to go to work in the fields and factories with his classmates. The war was reaching its climax in April\n1945\nwhen Suzuki entered the University of Tokyo to study mathematics. Tokyo was often bombed and on those occasions Suzuki and his fellow students had to escape into the countryside.\nAfter his undergraduate studies, Suzuki began research in the University of Tokyo's graduate School in April\n1948\n. His supervisor was Shokichi Iyanaga but the person who influenced him most at this time was\nKenkichi Iwasawa\n. His studies were financed with a special graduate fellowship which he received from the government of Japan from\n1948\nto\n1951\n. In April\n1951\n, while still working on his dissertation, Suzuki was appointed as a lecturer at Tokyo University of Education. He held this lectureship until January\n1952\nwhen he went to the United States having been awarded a graduate fellowship from the University of Illinois at Urbana-Champaign. He received his doctorate from the University of Tokyo in May\n1952\nalthough he was not present at the graduation ceremony. In the summer of\n1952\nhe went to the University of Michigan for two months. This was very profitable since\nRichard Brauer\nwas the professor there and\nWalter Feit\nwas a graduate student.\nBrauer\n's influence on Suzuki was highly significant and led him towards the most important areas.\nIn September\n1952\nSuzuki was awarded a post-doctoral fellowship to undertake research at the University of Illinois at Urbana-Champaign and in November he married Naoko Akizuki, the daughter of a professor at Kyoto University; they had a daughter, Kazuko Suzuki. He continued to undertake research at Urbana-Champaign, holding a research associateship until he was appointed as an assistant professor in September\n1955\n. During this period he published a series of excellent papers:\nThe lattice of subgroups of a finite group\n(\nin Japanese\n)\n(1950)\n;\nOn the finite group with a complete partition\n(1950)\n;\nOn the lattice of subgroups of finite groups\n(1951)\n;\nOn the L-homomorphisms of finite groups\n(1951)\n; and\nA characterization of simple groups\nLF\n(2\n,p\n)\n(1951)\n. The last of these is described by\nRichard Brauer\n:-\nAs usual, we denote by LF\n(2\n,p\n)\nthe simple group of order p\n(\np-\n1)(\np+\n1)\n/\n2\n,\n(\np >\n3\na prime number\n)\n. All proper subgroups of LF\n(2\n,p\n)\nare of one of the following four types: metacyclic groups\n(\ni.e. groups with a cyclic normal subgroup such that the factor group is cyclic\n)\n, tetrahedral, octahedral, icosahedral groups. The author proves the converse. If all proper subgroups of a non-cyclic simple group G are of one of these four types, then G is isomorphic to a group LF\n(2\n,p\n)\n. ... The proof is ingenious but long and difficult.\nAfter spending academic year\n1956\n-\n57\nat Harvard University, Suzuki returned to the University of Illinois where he was promoted to associate professor in\n1958\nand full professor in\n1959\n. Then in\n1960\nhe discovered a new class of finite simple groups, something which stunned the world of mathematics. Let us explain a little about the area in which Suzuki was working. A simple group is one which has no normal subgroups other than the identity subgroup and the group itself. Simple groups are the building blocks from which any group is made up. Cyclic groups of prime order are simple, but the interesting problem with simple groups is investigating non-abelian finite simple groups.\nBurnside\nhad conjectured that there did not exist non-abelian finite simple groups of odd order.\nBrauer\n, speaking at the International Congress of Mathematicians at Nice in\n1970\n, said:-\nUp to the early\n1960\ns, really nothing of real interest was known about general simple groups of finite order.\nRegarding the above conjecture of\nBurnside\n,\nBrauer\nsaid:-\nNobody ever did anything about it, simply because nobody had any idea how even to get started.\nIn\n1957\nSuzuki made a major breakthrough. In his paper\nThe nonexistence of a certain type of simple groups of odd order\nhe showed exactly what the title indicates. For those who know some group theory, we note that Suzuki proved that a finite group of odd order cannot be simple if the centraliser of every non-identity element is abelian.\nSuzuki's discovery of a new class of finite simple groups in\n1960\nshook mathematics. No new finite simple groups had been discovered since\nÉmile Mathieu\ndiscovered five such groups in\n1860\nand\n1873\n. In\n1967\nSuzuki discovered another new finite simple group. His work was a major factor in inspiring the remarkable combined effort by a large number of outstanding mathematicians on the classification of finite simple groups which many regard as the most important mathematical achievement of the\n20\nth\ncentury.\nLet us return to our sketch of Suzuki's career. He held a visiting appointment at the University of Chicago during\n1960\n-\n61\nand at the Institute for Advanced Study at Princeton in\n1962\n-\n63\n. He was a visiting professor at the University of Tokyo in the spring of\n1971\n. In\n1980\nhe was a visiting professor at the University of Hokkaido, the University of Osaka and the University of Tokyo. He was a visiting professor at the University of Padua in Italy in the summer of\n1994\n.\nThe editors of\n[\n1\n]\nwrite in the Preface:-\nProfessor Michio Suzuki had a great influence in group theory over the last\n50\nyears. We believe that his work in the\n1950\n's ignited work on the classification of finite simple groups, and in the\n1960\n's and\n70\n's he led its development. The classification was completed in the early\n1980\n's by Aschbacher,\nGorenstein\n,\nThompson\nand many others. ... Although Professor Suzuki was affiliated with the University of Illinois from\n1952\nuntil his death, he had a profound influence on the development of group theory\n(\nand subsequently of algebraic combinatorics\n)\nin Japan. Through him, word of recent developments in group theory often reached Japan, in particular through his regular summer visits. His recommendations gave many of us opportunities to visit abroad for research and to help us find jobs. We believe it is fair to say that much of the respect given to group theory in Japan as a whole derives from that given to Professor Michio Suzuki as one of the top mathematicians in the world\n(\nof course, many other Japanese group theorists deserve credit: nonetheless, the influence of Professor Suzuki was extraordinary\n)\n.\nMichio Suzuki received many honours for his contributions to group theory. He was a Guggenheim Fellow in\n1962\n-\n63\nand gave an invited lecture at the International Congress of Mathematicians in Stockholm in\n1962\nand at the International Congress of Mathematicians in Nice in\n1970\n. In\n1974\nSuzuki was awarded the Academy Prize from the\nJapan Academy\n. He was awarded an honorary degree from the University of Kiel, Germany, in\n1991\n:-\n... for his achievements in the domain of group theory, above all in recognition of his path-breaking works on the classification of finite simple groups as well as for his fundamental work on lattices of subgroups and his contributions to the theory of permutation groups.\nHarada writes very movingly in\n[\n3\n]\nabout Suzuki's last few months. After liver cancer was diagnosed, he returned to Japan. Although he had published little after\n1980\n, he was working on a major new line of research in the months before the cancer was discovered. He continued to work on this final paper during his final days in Japan and the paper\nOn the prime graph of a finite simple group - an application of the method of\nFeit\n-Thompson-Bender-Glauberman\nwas published in\n[\n1\n]\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}