{
  "nome_completo": "Michael Faraday",
  "nome_curto": "Michael Faraday",
  "ano_nascimento": "1791",
  "ano_morte": "1867",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faraday/",
  "lugar_nascimento": "Newington Butts, Surrey (now London) England",
  "lugar_morte": "Hampton Court, Middlesex, England",
  "biografia": "Michael Faraday\ndid not directly contribute to mathematics so should not really qualify to have his biography in this archive. However he was such a major figure and his science had such a large impact on the work of those developing mathematical theories that it is proper that he is included. We say more about this below.\nFaraday's father, James Faraday, was a blacksmith who came from Yorkshire in the north of England while his mother Margaret Hastwell, also from the north of England, was the daughter of a farmer. Early in\n1791\nJames and Margaret moved to Newington Butts, which was then a village outside London, where James hoped that work was more plentiful. They already had two children, a boy Robert and a girl, before they moved to Newington Butts and Michael was born only a few months after their move.\nWork was not easy to find and the family moved again, remaining in or around London. By\n1795\n, when Michael was around five years, the family were living in Jacob's Wells Mews in London. They had rooms over a coachhouse and, by this time, a second daughter had been born. Times were hard particularly since Michael's father had poor health and was not able to provide much for his family.\nThe family were held closely together by a strong religious faith, being members of the Sandemanians, a form of the Protestant Church which had split from the Church of Scotland. The Sandemanians believed in the literal truth of the Bible and tried to recreate the sense of love and community which had characterised the early Christian Church. The religious influence was important for Faraday since the theories he developed later in his life were strongly influenced by a belief in a unity of the world.\nMichael attended a day school where he learnt to read, write and count. When Faraday was thirteen years old he had to find work to help the family finances and he was employed running errands for George Riebau who had a bookselling business. In\n1805\n, after a year as an errand-boy, Faraday was taken on by Riebau as an apprentice bookbinder. He spent seven years serving his apprenticeship with Riebau. Not only did he bind books but he also read them. Riebau wrote a letter in\n1813\nin which he described how Faraday spent his days as an apprentice\n(\nsee for example\n[\n4\n]\n)\n:-\nAfter the regular hours of business, he was chiefly employed in drawing and copying from the Artist's Repository, a work published in numbers which he took in weekly. ... Dr Watts's Improvements of the mind was then read and frequently took in his pocket, when he went an early walk in the morning, visiting some other works of art or searching for some mineral or vegetable curiosity. ... His mind ever engaged, besides attending to bookbinding which he executed in a proper manner.\nHis mode of living temperate, seldom drinking any other than pure water, and when done his day's work, would set himself down in the workshop ... If I had any curious book from my customers to bind, with plates, he would copy such as he thought singular or clever\n...\nFaraday himself wrote of this time in his life:-\nWhilst an apprentice, I loved to read the scientific books which were under my hands ...\nFrom\n1810\nFaraday attended lectures at John Tatum's house. He attended lectures on many different topics but he was particularly interested in those on electricity, galvanism and mechanics. At Tatum's house he made two special friends, J Huxtable who was a medical student, and Benjamin Abbott who was a clerk. In\n1812\nFaraday attended lectures by Humphry Davy at the Royal Institution and made careful copies of the notes he had taken. In fact these lectures would become Faraday's passport to a scientific career.\nIn\n1812\n, intent on improving his literary skills, he carried out a correspondence with Abbott. He had already tried to leave bookbinding and the route he tried was certainly an ambitious one. He had written to Sir Joseph Banks, the President of the\nRoyal Society\n, asking how he could become involved in scientific work. Perhaps not surprisingly he had received no reply. When his apprenticeship ended in October\n1812\n, Faraday got a job as a bookbinder but still he attempted to get into science and again he took a somewhat ambitious route for a young man with little formal education. He wrote to Humphry Davy, who had been his hero since he attended his chemistry lectures, sending him copies of the notes he had taken at Davy's lectures. Davy, unlike Banks, replied to Faraday and arranged a meeting. He advised Faraday to keep working as a bookbinder, saying:-\nScience\n[\nis\n]\na harsh mistress, and in a pecuniary point of view but poorly rewarding those who devote themselves to her service.\nShortly after the interview Davy's assistant had to be sacked for fighting and Davy sent for Faraday and invited him to fill the empty post. In\n1813\nFaraday took up the position at the Royal Institution.\nIn October\n1813\nDavy set out on a scientific tour of Europe and he took Faraday with him as his assistant and secretary. Faraday met\nAmpère\nand other scientists in Paris. They travelled on towards Italy where they spent time in Genoa, Florence, Rome and Naples. Heading north again they visited Milan where Faraday met Volta. The trip was an important one for Faraday\n[\n4\n]\n:-\nThese eighteen months abroad had taken the place, in Faraday's life, of the years spent at university by other men. He gained a working knowledge of French and Italian; he had added considerably to his scientific attainments, and had met and talked with many of the leading foreign men of science; but, above all, the tour had been what was most valuable to him at that time, a broadening influence.\nOn his return to London, Faraday was re-engaged at the Royal Institution as an assistant. His work there was mainly involved with chemical experiments in the laboratory. He also began lecturing on chemistry topics at the Philosophical Society. He published his first paper in\n1816\non caustic lime from Tuscany.\nIn\n1821\nFaraday married Sarah Barnard whom he had met when attending the Sandemanian church. Faraday was made Superintendent of the House and Laboratory at the Royal Institution and given additional rooms to make his marriage possible.\nThe year\n1821\nmarked another important time in Faraday's researches. He had worked almost entirely on chemistry topics yet one of his interests from his days as a bookbinder had been electricity. In\n1820\nseveral scientists in Paris including\nArago\nand\nAmpère\nmade significant advances in establishing a relation between electricity and magnetism. Davy became interested and this gave Faraday the opportunity to work on the topic. He published\nOn some new electro-magnetical motions, and on the theory of magnetism\nin the\nQuarterly Journal of Science\nin October\n1821\n. Pearce Williams writes\n[\n1\n]\n:-\nIt records the first conversion of electrical into mechanical energy. It also contained the first notion of the line of force.\nIt is Faraday's work on electricity which has prompted us to add him to this archive. However we must note that Faraday was in no sense a mathematician and almost all his biographers describe him as \"mathematically illiterate\". He never learnt any mathematics and his contributions to electricity were purely that of an experimentalist. Why then include him in an archive of mathematicians? Well, it was Faraday's work which led to deep mathematical theories of electricity and magnetism. In particular the remarkable mathematical theories on the topic developed by\nMaxwell\nwould not have been possible without Faraday's discovery of various laws. This is a point which\nMaxwell\nhimself stressed on a number of occasions.\nIn the ten years from\n1821\nto\n1831\nFaraday again undertook research on chemistry. His two most important pieces of work on chemistry during that period was liquefying chlorine in\n1823\nand isolating benzene in\n1825\n. Between these dates, in\n1824\n, he was elected a fellow of the\nRoyal Society\n. This was a difficult time for Faraday since Davy was at this time President of the\nRoyal Society\nand could not see the man whom he still thought of as his assistant as becoming a Fellow. Although Davy opposed his election, he was over-ruled by the other Fellows. Faraday never held the incident against Davy, always holding him in the highest regard.\nFaraday introduced a series of six Christmas lectures for children at the Royal Institution in\n1826\n. In\n1831\nFaraday returned to his work on electricity and made what is arguably his most important discovery, namely that of electro-magnetic induction. This discovery was the opposite of that which he had made ten years earlier. He showed that a magnet could induce an electrical current in a wire. Thus he was able to convert mechanical energy into electrical energy and discover the first dynamo. Again he made lines of force central to his thinking. He published his first paper in what was to become a series on\nExperimental researches on electricity\nin\n1831\n. He read the paper before the\nRoyal Society\non\n24\nNovember of that year.\nIn\n1832\nFaraday began to receive honours for his major contributions to science. In that year he received an honorary degree from the University of Oxford. In February\n1833\nhe became Fullerian Professor of Chemistry at the Royal Institution. Further honours such as the Royal Medal and the Copley Medal, both from the Royal Society, were to follow. In\n1836\nhe was made a Member of the Senate of the University of London, which was a Crown appointment.\nDuring this period, beginning in\n1833\n, Faraday made important discoveries in electrochemistry. He went on to work on electrostatics and by\n1838\nhe\n[\n1\n]\n:-\n... was in a position to put all the pieces together into a coherent theory of electricity.\nThe extremely high workload eventually told on Faraday's health and in\n1839\nhe suffered a nervous breakdown. He did recover his health and by\n1845\nhe began intense research activity again. The work which he undertook at this time was the result of mathematical developments in the subject. Faraday's ideas on lines of force had received a mathematical treatment from\nWilliam Thomson\n. He wrote to Faraday on\n6\nAugust\n1845\ntelling him of his mathematical predictions that a magnetic field should affect the plane of polarised light. Faraday had attempted to detect this experimentally many years earlier but without success. Now, with the idea reinforced by\nThomson\n, he tried again and on\n13\nSeptember\n1845\nhe was successful in showing that a strong magnetic field could rotate the plane of polarisation, and moreover that the angle of rotation was proportional to the strength of the magnetic field. Faraday wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nThat which is magnetic in the forces of matter has been affected, and in turn has affected that which is truly magnetic in the force of light.\nHe followed his line of experiments which led him to discover diamagnetism.\nBy the mid\n1850\ns Faraday's mental abilities began to decline. At around the same time\nMaxwell\nwas building on the foundations Faraday had created developing a mathematical theory which would always have been out of reach for Faraday. However Faraday continued to lecture at the Royal Institution but declined the offer of the Presidency of the Royal Society in\n1857\n.\nHe continued to give the children's Christmas lectures. In\n1859\n-\n60\nhe gave the Christmas lectures on the various forces of matter. At the following Christmas he gave the children's lectures on the chemical history of the candle. These two final series of lectures by Faraday were published and have become classics. The Christmas lectures at the Royal Institution, begun by Faraday, continue today but now reach a much greater audience since they are televised. I\n[\nEFR\n]\nhave watched these lectures with great interest over many years. They are a joy for anyone interested as I am in the \"public understanding of science\". I particularly remember lectures by Carl Sagan on \"the planets\" and mathematics lectures by\nChris Zeeman\nand Ian Stewart.\nThe Royal Institution literature states:-\n[\nFaraday's\n]\nmagnetic laboratory, where many of his most important discoveries were made, was restored in\n1972\nto the form it was known to have had in\n1854\n. A museum, adjacent to the laboratory, houses a unique collection of original apparatus arranged to illustrate the most important aspects of Faraday's immense contribution to the advancement of science in his fifty years at the Royal Institution.\nMartin, in\n[\n4\n]\n, gives this indication of Faraday's character:-\nHe was by any sense and by any standard a good man; and yet his goodness was not of the kind that make others uncomfortable in his presence. His strong personal sense of duty did not take the gaiety out of his life. ... his virtues were those of action, not of mere abstention ...",
  "math_areas": [
    "Analysis"
  ]
}