{
  "nome_completo": "Mikhail Vasilevich Ostrogradski",
  "nome_curto": "Mikhail Vasilevich Ostrogradski",
  "ano_nascimento": "1801",
  "ano_morte": "1862",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ostrogradski/",
  "lugar_nascimento": "Pashennaya (now Poltava oblast), Ukraine",
  "lugar_morte": "Poltava (now Ukraine)",
  "biografia": "Mikhail Vasilevich Ostrogradski\n's father Vasili Ivanovich Ostrogradski, was a landowner but, although the family had leading citizens as relations, they were poor. Mikhail's mother was Irina Andreevna Sakhno-Ustimovich. Both the Ostrogradski and the Sakhno-Ustimovich family were Cossacks with a long tradition of serving in the military. Let us record at this point the fact that Ostrogradski's name is often given in one of the three forms: Ostrogradski, Ostrogradskii, or Ostrogradsky.\nVasili Ivanovich and Irina Andreevna had five children; Mikhail had two brothers Osip and Andrei, and two sisters Elena and Maria. He was born in a thatched hut on his father's land. As most children do, he showed great curiosity in the world around him but, unlike most, he derived great pleasure from measuring objects. Not only did he measure the dimensions of his toys but he also measured the depth of wells and lengths of fields. He always carried a stone in his pocket which had a long piece of string tied round it so that he could measure the depth of any well he came across. He was also fascinated by mills, sitting for long periods watching the sails rotate, the water wheel turning, and the mill stone rotating to grind the grain.\nHe attended the Poltava\nGymnasium\nsecondary school, beginning his education there in\n1809\n. He boarded in a house which offered accommodation for the \"education of children of impoverished nobles\". His tutor was Ivan Petrovych Kotlyarevsky\n(1769\n-\n1838)\n, who made a name for himself as a writer, poet and social activist. Ostrogradski did not shine in his academic subjects at the Gymnasium. When the time came for him to leave, Ostrogradski expressed a wish to have a military career. Almost certainly Kotlyarevsky influenced him in this decision since he had served in the Imperial Russian Army, fighting in the Russo-Turkish war. However Ostrogradski's family was not wealthy and, despite their military traditions, it was felt that a soldier's pay was not good enough. Eventually it was decided that he should take up a career in the civil service and in order to obtain a high ranking position a university education was necessary. However, he did not have the necessary background to begin university studies so he attended lectures and studied on his own to gain the necessary expertise.\nOstrogradski entered the University of Kharkov in\n1816\nand, after a preparatory year, began to study physics and mathematics in\n1817\n. Initially, he had not been particularly keen on studying at university and approached his studies with considerable reluctance. However, Andrei Fedorovich Pavlovsky\n(1789\n-\n1875)\nwas one of his teachers and he noticed the extraordinary ability of the young man and was able to awaken in him an interest in science. Another who influenced Ostrogradski at this time was\nTimofei Fedorovic Osipovsky\nwho was both a professor of mathematics and the rector of the University of Kharkov. In\n1820\nOstrogradski took and passed the exams necessary for his degree but the minister of religious affairs and national education refused to confirm the decision and required him to retake the examinations. The problem appears to have been his mathematics professor\nOsipovsky\n, in the year\n1820\n, was suspended from his post on religious grounds. The officials who made this decision made\nOsipovsky\n's pupil suffer too. Let us give some further details of this episode. In\n1816\nPrince Aleksandr Nikolaevich Golitsyn\n(1773\n-\n1844)\nwas appointed Minister of Education and Minister of Religious Affairs. He carried out a religious crusade against \"ungodly and revolutionary tendencies\", requiring that science be taught from Christian principles. Kharkov, like other universities, received instructions on how to teach from a Christian viewpoint, demonstrating God's omniscience. In\n1820\n, following Golitsyn's lead,\nOsipovsky\nwas dismissed by the Curator of Kharkov University, Zakharii Iakovlevich Karneev\n(1747\n-\n1828)\n, because of an alleged lack of fervour when saying \"God lives\" during an oral examination of a graduate student. This had a rather serious consequence for Ostrogradski who had been examined by\nOsipovsky\nin\n1820\n, for, following\nOsipovsky\n's dismissal, the Ministry of Education refused to confirm the award of Ostrogradski's doctorate. They required him to retake the examinations\n(\nofficially on the grounds that he had not attended lectures on philosophy and theology\n)\n, but, knowing that the real reason was that he had been examined by\nOsipovsky\n, he refused to retake the examinations and never received the degree.\nThe leading mathematical centre in the world at this time was Paris and Ostrogradski made the bold decision to study there, arriving in May\n1822\n. It had been a hard decision since his family did not approve and he had financial difficulties. To make matters even worse, he was robbed on the journey. Between\n1822\nand\n1827\n, he attended lectures at the École Polytechnique, the Sorbonne, and the Collège de France, on mathematics, physics, mechanics, and astronomy. These were delivered by\nLouis Poinsot\n,\nPierre-Simon Laplace\n,\nJoseph Fourier\n,\nAdrien-Marie Legendre\n,\nSiméon-Denis Poisson\n,\nJacques Binet\nand\nAugustin-Louis Cauchy\n. Becoming friendly with these leading mathematicians, he made rapid progress and soon began to publish papers in the\nParis Academy of Sciences\n. The first of these is\nMemoir on wave propagation in a cylindrical vessel\n(1826)\n. His papers at this time show the influence of the mathematicians in Paris and he wrote on physics and the integral calculus. For example, he submitted his paper\nDémonstration d'un théorème du calcul intégral\nⓉ\n(\nDemonstration of a theorem of the calculus\n)\nto the\nParis Academy of Sciences\non\n13\nFebruary\n1826\n. In this paper Ostrogradski states and proves the general divergence theorem.\nGauss\n, nor knowing about Ostrogradski's paper, proved special cases of the divergence theorem in\n1833\nand\n1839\nand the theorem is now often named after\nGauss\n. Victor Katz writes\n[\n19\n]\n:-\nOstrogradski presented this theorem again in a paper in Paris on\n6\nAugust\n1827\n, and finally in St Petersburg on\n5\nNovember\n1828\n. The latter presentation was the only one published by Ostrogradski, appearing in\n1831\nin 'Note sur la Théorie de la Chaleur\nⓉ\n(\nNote on the theory of heat\n)\n(1831)\n.' The two earlier presentations have survived only in manuscript form, though they have been published in Russian translation.\nIn fact many of Ostrogradski's papers which he wrote in Paris were later incorporated in a major work on hydrodynamics with he published in Paris in\n1832\n. Other results which he obtained at this time on residue theory appeared in\nCauchy\n's works. His time in Paris, however, did have its problems. Ostrogradski's father, unhappy that his son was spending so long abroad, stopped sending him money. Ostrogradski, unable to pay the bills for his accommodation, ended up badly in debt. He was taken to court for non-payment, but\nCauchy\n, hearing of Ostrogradski's difficulties, paid off all his debts.\nCauchy\nthen managed to get Ostrogradski a position teaching at the Collège Henri IV\n(\ntoday called Lycée Henri-IV\n)\nso he could continue living in Paris. Kenneth May, reviewing\n[\n30\n]\n, explains that the paper:-\n... describes four manuscripts dating from Ostrogradski's Paris residence\n(1822\n-\n1827)\nand discovered by\nYushkevich\nin the French Academy archives in\n1963\n. The first two of those manuscripts\n(1824)\nare on definite integrals and document Ostrogradski's role in the development of\nCauchy\n's method of residues. ... the third and fourth manuscripts\n(1826\nand\n1827)\n[\nhave been\n]\ntranslated .... They include a special case of\nGreen\n's theorem, a general development\n(\nthe first such, according to\nYushkevich\n)\nof the method of separation of variables, and the first solution of the problem of heat diffusion in a triangular prism.\nOstrogradski left France and went to St Petersburg, arriving in the spring of\n1828\n. Although he came to St Petersburg full of enthusiasm looking to create a research environment like he had experienced in Paris, nevertheless he was looked at with  suspicion and distrust by the local police who put him under surveillance. However, he was greeted with enthusiasm by the St Petersburg mathematicians. He was appointed as a lecturer at the Naval Academy\n(\nactually called the Naval Corps at this time\n)\nin\n1828\n. Later he gained additional teaching positions, at the Institute of Means of Communication beginning in\n1830\nand, two years later, he began teaching at the General Pedagogical Institute. He had a second visit to Paris in May\n1830\nbeing in the city at the time when there were street disorders and barricades were erected. This was the July revolution of\n1830\nand Ostrogradski seriously damaged one of his eyes towards the end of his visit. It appears that this was not as a result of any disturbances but rather that he was careless with a phosphorous match. He became blind in his right eye. He married Maria in\n1831\n; they had three children, two daughters and a son. Ostrogradski loved to play with his children, jumping and running with them in a childlike way.\nIn St Petersburg, he presented three important papers on the theory of heat, double integrals and\npotential theory\nto the\nImperial\n(\nSt Petersburg\n)\nAcademy of Sciences\n. Largely on the strength of these papers he was elected an academician in the applied mathematics section of the Academy. He was elected a junior academician in December\n1828\n, promoted to associate academician in\n1830\n, and finally became a full academician in\n1832\n. Ostrogradski aimed high in his research and his objective was to provide a combined theory of hydrodynamics, elasticity, heat and electricity. He submitted a report to the\nImperial Academy of Sciences\nin\n1830\nwhich contains the following remarkably ambitious aim\n(\nsee\n[\n17\n]\n)\n:-\nThe followers of\nNewton\ndeveloped the great law of universal gravitation in detail and applied mathematical analysis to numerous important problems in general physics and physics of weightless substances. The collection of their works about the system of the universe forms the immortal folios of 'Celestial mechanics,' from which astronomers will take the elements for their tables for a long time. However, physical and mathematical theories are still not unified; they are distributed over numerous collections of academic memoirs and are investigated by different methods, often very doubtful and imperfect; moreover, there are theories developed but never presented. I set it as my aim to combine these theories, present them by using a uniform method, and indicate their most important applications. I already collected the necessary materials on the motion and equilibrium of elastic bodies, propagation of waves on the surface of incompressible liquids, and propagation of heat inside solid bodies and, in particular, inside the globe. However, these theories will constitute only a necessary part of the entire work, which will also embrace the distribution of electricity and magnetism in bodies capable of being electrified or magnetized through electrodynamic influence, motion of electric fluids, motion and equilibrium of liquids, capillarity action, distribution of heat in liquids, and\nprobability theory\n; in this last part, I will dwell upon several issues in which the famous author of 'Celestial Mechanics' was apparently wrong.\nOf course this was far beyond what could be achieved by any one man but, by aiming at a grand scheme, he made major developments in a wide range of areas. He submitted\nMémoire sur le Calcul des Variations des Integrales Multiples\nⓉ\n(\nMemoir on the calculus of cariations of multiple integrals\n)\nto the\nSt Petersburg Academy of Sciences\non\n24\nJanuary\n1834\n. This is an important work in the theory of\npartial differential equations\nand was reprinted in\nCrelle\n's\nJournal\nin\n1836\nand an English translation was made by\nTodhunter\nand published in\n1861\n. In\n1840\nhe wrote on ballistics introducing the topic to Russia. His important work on\nordinary differential equations\nconsidered methods of solution of non-linear equations which involved power series expansions in a parameter alpha.\nLiouville\nhad produced similar results. Also some of his results on heat were similar to results produced by\nLamé\nand by\nDuhamel\n. He must be considered as the founder of the Russian school of theoretical mechanics. In addition to his important contributions to partial differential equations, he made significant advances to the theory of elasticity and to algebra publishing over\n80\nreports and giving lectures. His work on algebra was an extension of\nAbel\n's work on algebraic functions and their integrals.\nFrom\n1847\nhe was chief inspector for the teaching of mathematical sciences in military schools. He wrote many fine textbooks and established the conditions which allowed\nChebyshev\n's school to flourish in St Petersburg. However, this huge contribution took up much of his time which he might otherwise have been able to devote to making further major progress in mathematical physics.\nChebyshev\nwrote the following about Ostrogradski\n(\nsee\n[\n17\n]\n)\n:-\nA man, without doubt, of brilliant mind, he did not accomplish even half of what he could have done if he were not \"bogged down\" with tiresome permanent pedagogic work.\nVictor Katz write in\n[\n18\n]\n:-\nUnfortunately, some of\n[\nOstrogradski's\n]\nmost important discoveries appear to have been totally ignored, at least in Western Europe. Not only did he give the first generalization of the change-of-variable theorem to\nn\nn\nn\nvariables, but he also first proved and later generalized the divergence theorem, wrote integrals of\nn\nn\nn\n-forms over\nn\nn\nn\n-dimensional \"hypersurfaces,\" and ... gave the first proof of the change-of-variable theorem for double integrals using infinitesimal concepts. All of these results were eventually repeated by other mathematicians with no credit to Ostrogradski.\nOstrogradski was a big tall man with a loud voice. He appearance was quite formidable, especially with the loss of his right eye, but had a cheerful character and an exceptionally sharp mind. He passionately loved his native land, its people, and its culture. He loved classical French and Russian literature although his language of choice when at home was always Ukrainian. He loved to recite the monologues of Molière and Corneille but his favourite writer was Taras Hryhorovych Shevchenko, the Ukrainian poet and writer. Ostrogradski knew many of Shevchenko's works by heart and often recited them. Ostrogradski met Shevchenko in\n1858\nwhen the poet came to stay with him. In fact Shevchenko records in his diary\n(\nsee\n[\n23\n]\n)\n:-\n... we went together with Semen to M V Ostrogradski's. A great mathematician, he greeted me with open arms as a countryman and, apparently, a long-lost relative. Bless him. Ostrogradski with his family goes to Malorossia\n[\nUkraine\n]\nin summer. He says he would invite Semen to come with him, but fears that in the whole of the Poltava Guberniia there would not be enough bacon for his needs.\nSemen, who is mentioned in this quote, is Semen Hulak-Artemovski\n1813\n-\n1873)\n, a famous Ukrainian composer and opera singer.\nFinally let us mention the remarkable work that Ostrogradski did on insurance towards the end of his life. The circumstances are interesting and were described by\nAleksei Nikolaevich Krylov\n(\nsee\n[\n12\n]\n)\n:-\nIn\n1856\n, in accord with the Paris treatise, Russia was deprived of the right to have a fleet on the Black Sea. A large number of office workers had to be fired, and, to improve their circumstances, it was decided to establish a retirement fund at the Naval Department, and to begin paying pensions in\n1859\n. Life insurance was then a novelty, and calculations connected with the work of the retirement funds, or with determining the amount of pensions in accord with the pertinent deductions from wages were known still less. For this reason, both mathematicians who were members of the\nSt Petersburg Academy of Sciences\n, Ostrogradski and\nBunyakovsky\n, were included in the committee charged with drawing up a charter of the fund. They have indeed made all the necessary calculations and provided their theoretical justification. The transactions of the committee were published without delay; they contain a remarkable note by Ostrogradski ...\nWe note that the Treaty of Paris of\n1856\nended the Crimean war which Russia fought against Turkey supported by Britain and France. It was a war renowned for the incompetence of both sides. It must have pained Ostrogradski greatly to see Russia and France on opposing sides.\nAlways a Ukrainian at heart, Ostrogradski specified in his will that he should be buried in his home village of Pashennaya. In the summer of\n1861\n, when he was bathing, it was noticed that he had an abscess on his back. He was operated on and the abscess was removed but his health rapidly deteriorated and he died in the January of the following year. We note that some sources give his date of death as\n1861\n, rather than\n1862\n, since the old style calendar date was\n20\nDecember\n1861\n. His wishes were carried out and he was buried in the family vault at Pashennaya.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}