{
  "nome_completo": "Mohammed Reda Madwar",
  "nome_curto": "Mohammed Reda Madwar",
  "ano_nascimento": "1893",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Madwar/",
  "lugar_nascimento": "Alexandria, Egypt",
  "lugar_morte": "Egypt",
  "biografia": "Mohammed Reda Madwar\nattended French School in both Egypt and Paris and received the \"French baccalaureat\". This exempted him from sitting the Preliminary Examination for the University of Edinburgh in Scotland and his first matriculation there was in October\n1914\n. On his matriculation form he gave his home address as Custom House, Alexandria, Egypt, and his Edinburgh address as Rosehill, Corstorphine. He entered the Department of Engineering to study for a degree in Applied Science.\nMadwar's university studies at the University of Edinburgh included courses in Chemistry\n(\ntaught by Dr Dobbin\n)\n, Natural Philosophy\n(\ntaught by Dr\nCarse\nand Dr\nBarkla\n)\n, and Mathematics\n(\ntaught by Dr\nHorsburgh\n)\nin session\n1914\n-\n15\n. In the following year he studied Applied Mathematics\n(\ntaught by Dr\nKnott\n)\n, Geology, Junior Drawing, Heat engines, and Engineering. He was awarded the degree of Bachelor of Science with Honours in Civil Engineering on\n11\nJuly\n1917\n. He won two medals during his studies at Edinburgh. He then continued to live in Edinburgh, working for the year\n1918\n-\n19\nas an assistant engineer for Lesly Co. After a further year in Great Britain as a scientific assistant at the Royal Aviation Inst., Madwar returned to Egypt in\n1919\n.\nBack in Egypt, Madwar worked as an Irrigation Engineer at the Ministry of Public Works for three years, then spent one further year as a scientific assistant in the Physical Department of the Ministry of Public Works. He was then awarded a scholarship which enabled him to return to Scotland to study for his doctorate at the University of Edinburgh. He joined the\nEdinburgh Mathematical Society\nin December\n1925\n. After three years undertaking research in astronomy, Madwar was awarded his Ph.D. by Edinburgh University in\n1926\n. Following the award of his doctorate, Madwar returned to Egypt where he was appointed as Permanent Observer at the Royal Helwan Observatory. He held this post until\n1934\nwhere he became the first Egyptian Director of Helwan Observatory. Two years later, in\n1936\n, in addition to his directorship of the Observatory, he was appointed as Professor of Astronomy at Cairo University. In\n1953\nhe retired from his position at the Royal Helwan Observatory and at the same time became Professor Emeritus of Astronomy at Faculty of Science, Cairo University.\nMadwar's achievements in his roles at the university and the observatory are substantial. He installed the Transit Telescope at Helwan Observatory for the determination of Astronomical times, he participated on behalf of Helwan Observatory in the Discovery of Pluto in\n1930\n, he established the Astronomy Department in the Faculty of Science at Cairo University in\n1936\n, and he headed the Egyptian mission of the Total Solar Eclipse at Khartoum in\n1952\n:-\nIn the late forties, the ex-king of Egypt, Farouk, visited Helwan observatory. He acknowledged the efforts of Professor Madwar and his research work in discovering the Planet Pluto and some galaxies using the\n30\n\" reflector of Helwan Observatory. He asked Professor Madwar to prepare himself for the ministry in the next change. Professor Madwar apologized gently, and instead he asked the king for funds to build a bigger telescope. The king agreed immediately and Cairo University gave about half a million Egyptian pounds for this project\n(\nat that time the Astronomy Department and Helwan Observatory belonged to Cairo University as a single entity, the \"Institute of Astronomy\"\n)\n. Professor Madwar started the site testing and signed the agreement with an English company to build the\n74\n\" reflector telescope for the Kottamia Observatory.\nHe prepared the feasibility study for establishing Kottamia Observatory and singed the agreement with the Grupp-Parsons Corporation to install the\n74\ninch telescope.\nHe received many honours for his contributions. In\n1926\nhe became an Associate member of the Royal Civil Engineering Society and in the following year was elected to the\nRoyal Society of London\nand the\nRoyal Society of Edinburgh\n. He was elected to the RSE on\n14\nMarch\n1927\nhaving been proposed by Ralph Allan Sampson, Sir Thomas Hudson Beare,\nCharles Glover Barkla\n, and\nSir Edmund T Whittaker\n. He was awarded the State Prize of Appreciation\n(1966)\nand the State Medal\n(\nFirst Class Honour\n)\n(1968)\n. He became a member of the Egyptian Scientific Compound\n(1940)\n, a member of the International Astronomical Union, chairman of the International Union of Geodesy and Geophysics, president of the Egyptian Academy of Sciences, and chairman of the Egyptian Mathematical and Physical Society.",
  "math_areas": [
    "Applied Mathematics"
  ]
}