{
  "nome_completo": "Morgan William Crofton",
  "nome_curto": "Morgan Crofton",
  "ano_nascimento": "1826",
  "ano_morte": "1915",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Crofton/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Brighton, Sussex, England",
  "biografia": "Morgan Crofton\n's father was the Reverend William Crofton\n(1795\n-\n1851)\nwho was the Protestant minister of the parish of Skreen in County Sligo. In fact there is a remarkable coincidence here, for the Reverend William Crofton succeeded the Reverend Gabriel Stokes, father of\nGeorge Stokes\n, as rector of Skreen. Of course as the son of a Protestant minister, Morgan was brought up as a Protestant, but later in life he converted to Roman Catholicism which had some effect on his career.\nMorgan Crofton's mother was  Melesina Woodward\n(1803\n-\n1881)\n. He was the eldest of his parents' eleven children. His younger siblings were: Henry\n(\nborn\n1827)\n, Melesina\n(\nborn\n1828)\n, Mary\n(\nborn\n1832)\n, Isabella\n(\nborn\n1836)\n, Harman\n(\nborn\n1836)\n, Helen\n(\nborn\n1837)\n, Francis\n(\nborn\n1842)\n, Albina\n(\nborn\n1846)\n, Georgina\n(\nborn\n1846)\nand Louisa\n(\nborn\n1846)\n.\nCrofton entered Trinity College, Dublin where he studied mathematics. He obtained his degree in\n1847\nbeing in first place in the Senior Moderators in Mathematics\n(\nin other words, topping the list of First Class students\n)\n. At this time Trinity College, Dublin restricted its degrees, fellowships, and scholarships to Anglicans. It was some time after this, in\n1873\n, that all religious requirements were removed from the university. One would not expect this to be a problem for Crofton, who was an Anglican, but it seems that by this time he was considering changing from being an Anglican to being a Roman Catholic. In order to take up the Fellowship that Trinity offered him in\n1848\nhe was required to take holy orders in the Church of Ireland and this, it appears, he was not prepared to do. He therefore received a prize in the Trinity College Fellowship Examination but could not take up a Fellowship.\nIn\n1849\nCrofton was appointed as Professor of Natural Philosophy at Queen's College, Galway, five years after it was founded\n(\nit later became University College, Galway\n)\n. He only held the chair for three years, resigning in\n1853\n. It appears that his move towards Catholicism was the main reason that he only held the chair for a few years. Certainly his conversion to the Catholic Church was closely connected with John Henry Newman and so, to understand Crofton's actions, we should say a few words about Newman. Like Crofton, Newman began as an Anglican but he had held a leading role in the Oxford Movement in the Church of England. Newman resigned as an Anglican priest in\n1843\n, about the time Crofton was beginning his undergraduate career at Trinity College, Dublin, and was received into the Roman Catholic Church in\n1845\n. In\n1848\nNewman went to Rome where he was ordained to the priesthood, then founded the Oratory at Birmingham in\n1848\n. Newman went to the Catholic University of Ireland when it opened on St Stephen's Green in\n1853\n. This university was run by the Jesuits but it did not have official recognition. Newman was not very successful in establishing the new university although one would have to say that it was an almost impossible task for him. Newman left the university in\n1857\nand after this it went into a serious decline, only being revived again in\n1882\nas the University College, Dublin.\nMorgan Crofton married Julia Agnes Cecilia Kernan\n(\nborn in Monaghan, Ireland, about\n1827)\non\n31\nAugust\n1857\n. They had five children William\n(\nborn\n1858)\n, Mary\n(\nborn\n1860)\n, Adrienne\n(\nborn\n1862)\n, John\n(\nborn\n1863)\n, and Henry\n(\nborn\n1865)\n. Morgan Crofton later married Catherine Charlotte Taylor\n(1854\n-\n1945)\nin\n1892\nat Paddington, London.\nIn\n[\n3\n]\nCrofton's son, who became a Roman Catholic priest, describes his father's entry into the Catholic Church:-\n... my father was not with Newman in Dublin, but he was instructed and received into the Church by Newman himself in the early 'fifties at Birmingham.\nCrofton's entry into the Catholic Church must have come at around the time that he resigned his Chair of Natural Philosophy at University College, Galway. After this Crofton went to France where he taught at a number of different educational institutions run by the Jesuits. It is not entirely clear when he returned to England, but, after he did so, he became friendly with\nSylvester\nwho by that time held the chair in mathematics at the Royal Military Academy at Woolwich. Clearly\nSylvester\nwas impressed with Crofton's mathematical talents for he recommended him for an appointment as an instructor at the Royal Military Academy.\nIn\n1869\nSylvester\nreached the age of\n55\nwhich was the retiring age in the Army and, teaching at a military establishment,\nSylvester\nhad the same retiring age as other Army personnel. Crofton was appointed to fill the vacancy in\n1870\nand he held the position of Professor of Mathematics at the Royal Military Academy at Woolwich until\n1884\n. The army required applied mathematics to be taught in its courses at Woolwich to provide the necessary skills for the army personnel and Crofton taught there courses on mechanics and engineering mathematics. He wrote a textbook as a consequence of the lecture courses he taught, publishing\nLectures on the elements of applied mechanics\nin\n1877\n. He also collaborated with E Kensington on a second textbook\nTracts on mechanics\n.\nAs we mentioned above, after Newman left the Catholic University of Ireland in\n1857\nit went into a serious decline, being revived again in\n1882\nas the University College, Dublin. At this time University College, Dublin and three other Roman Catholic colleges in Ireland were joined together as the Royal University of Ireland. This was an exciting new venture and Crofton joined the mathematics staff of University College, Dublin after he retired in\n1884\nbut, since he continued to live in London, he cannot have taught courses at the newly revived establishment. He certainly worked for the university as an examiner and would go on regular visits to Dublin. He did discuss mathematical questions there with\nJohn Casey\n, for when\nCasey\npublished his book\nA treatise on the analytic geometry of the point, line, circle and conic section\nhe both acknowledged Crofton's help with the work and also included a number of exercises which he explicitly acknowledged were due to Crofton. It is possible that these were examination questions which Crofton composed and that his collaboration with\nCasey\nwas closely related to his role in examinations.\nOne might imagine that someone who held the chair of Natural Philosophy at Galway and then taught applied mechanics at the Royal Military Academy at Woolwich would be interested in research in applied mathematics. However this was not really the case. Crofton wrote most of his papers on pure mathematics, publishing on geometry and the operator calculus. Among his contributions was an extension of the theory of\nMaxwell\non frameworks\n(\nsee\n[\n4\n]\n)\n. He is perhaps best known, however, for his contributions to geometric probability, integral geometry and Crofton's formula\n(\nsee for example\n[\n9\n]\nand\n[\n10\n]\n)\n. In\n[\n1\n]\nCrofton's work on the hypothesis of elementary errors is discussed.\nWe know from comments by\nSylvester\nthat he and Crofton discussed\nBuffon\n's needle in the\n1860\ns at Woolwich. Crofton wrote\nOn the theory of local probability\nin\n1868\nwhich he discussed\nBuffon\n's needle. Perhaps his most famous work on probability, however, was the article that he wrote on that topic for the ninth edition of\nEncyclopaedia Britannica\n. This ninth edition of Encyclopaedia Britannica was edited by T S Baynes, Professor of Logic and Metaphysics at the University of St Andrews. It was a work in\n24\nvolumes with one index volume being published one volume after the other between\n1875\nand\n1889\n. Crofton's lengthy article\nProbability\nwhich appeared in\n1885\nis still worth reading and is one of many outstanding articles in what many consider to be the greatest encyclopaedia ever produced.\nIn\n1895\nCrofton retired from his position at University College, Dublin. He was honoured with the award of an honorary doctorate from Trinity College Dublin in\n1898\n.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}