{
  "nome_completo": "Muriel Kennett Wales",
  "nome_curto": "Muriel Wales",
  "ano_nascimento": "1913",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wales/",
  "lugar_nascimento": "Belfast, Ireland",
  "lugar_morte": "Vancouver, Canada",
  "biografia": "Muriel Wales\n' parents were William Kennett and Alice Girvan. Her father is believed to have died shortly before or after her birth and her mother later remarried George Wales in Canada, Muriel being brought up with his last name. Muriel's mother Alice Girvan was born in Belfast on\n6\nFebruary\n1889\nto James Girvan and Jennie Mclean. Alice married William Kennett, also from Belfast, in the second half of\n1910\n(\nthe wedding was registered in the final three months of\n1910)\nin Belfast.  Alice Kennett sailed to Canada with her one year old daughter arriving on\n26\nSeptember\n1914\n. The ship manifesto says Alice was going to British Columbia to see her sister who was resident there.\nOn\n19\nOctober\n1916\n, Alice Kennett married George Frederick Wales in Vancouver, Canada. One assumes that from that time on George and Alice Wales called their daughter Muriel Wales. George Frederick Wales, who worked in a shipping company, was not a Canadian, for he was born in Margate in England. A baby boy was born to George and Alice Wales in\n1917\nbut he died within a couple of days. They had no further children.\nMuriel Wales studied at the University of British Columbia and was awarded a B.A. in\n1934\nand an M.A. three years later. Her M.A. thesis at the University of British Columbia was the\n40\n-page 'Determination of Bases for Certain Quartic Number Fields'. She was an assistant in the Mathematics Department at the University of British Columbia in session\n1937\n-\n38\n. She then went to the University of Toronto where she undertook research advised by\nSamuel Beatty\n. At the time that Wales undertook research in Toronto,\nBeatty\nwas Head of the Mathematics Department and also Dean of the Faculty of Arts. Wales was awarded a Ph.D. by the University of Toronto in\n1941\nfor her\n80\n-page thesis\nTheory of algebraic functions based on the use of cycles\n. In\n1944\nshe, together with\nSamuel Beatty\n, published the paper\nTheory of algebraic functions based on the use of cycles\nbased on the work of her thesis.\nAfter the award of her doctorate, Wales was engaged in government research work in Toronto. She then worked on the atomic bomb at the Montreal Laboratory from\n1944\nto\n1949\n. In fact she was one of a number of women who became members of a group of scientists working on this project in Montreal. While undertaking research at the Montreal Laboratory she wrote the paper 'Fast fission in tubes' in collaboration with M Goldstein and A S Lodge. In\n1949\nshe returned to live with her parents at\n1622\nGrant Street, Vancouver. She donated to the University of British Columbia funds in\n1950\n. Her occupation from\n1950\nto\n1968\nwas listed in registered voters lists a \"claims agent\" and it is certainly probable that this was a position in her step-father's shipping company. George Wales died in\n1959\nand Alice Wales died in\n1979\n. Muriel Wales had retired by\n1972\nand she continued to live at\n1622\nGrant Street, Vancouver.\nFinally let us comment that we would like to know more about Muriel Wales and would encourage anyone with further information to contact us. She was certainly one of the first women born in Ireland to be awarded a Ph.D. in mathematics so more details would be very welcome.",
  "math_areas": [
    "Analysis"
  ]
}