{
  "nome_completo": "Myron Mathisson",
  "nome_curto": "Myron Mathisson",
  "ano_nascimento": "1897",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mathisson/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Cambridge, England",
  "biografia": "Myron Mathisson\nattended high school at a\nGymnasium\nin Warsaw, obtaining a gold medal when he completed his studies in\n1915\n. Later in the same year he was admitted to the Polytechnic School at the Faculty of Civil Engineering in Warsaw. He confided in a letter\n[\n2\n]\nto\nEinstein\nwritten in\n1930\nthat he chose that particular course of studies because there were biographies of all the mathematicians who were contemporaries of Fresnel in the Faculty Library. He attended the course on technical studies, successfully completing it in six semesters. In\n1917\nhe began the three compulsory semesters of Experimental Physics and was admitted to the Physical Laboratory of the University as an external researcher. Mathisson, in his letter to\nEinstein\n, underlined the fact that during this period Wacław Michal Dziewulski was highly appreciative of his contributions mainly because of his work in the Physical Laboratory. There was no way that Mathisson would have been able to support himself financially during that time without earning a salary, so in addition to his other duties he was employed as a technical draftsman.\nIn\n1918\nthe war between Poland and Russia broke out and Mathisson undertook military service for two years. At the end of the war he returned to continue his work at the University of Warsaw, also undertaking research at the Universities of Kazan and Cracow. However the death of his father forced him to take a break from his studies and researches. At the end of\n1925\nProfessor Czeslan Bialobrzeski approved his paper\nSur le movement d'un corps tournant dans un champ de gravitation\nⓉ\n(\nOn the movement of a rotating body in a gravitational field\n)\nas his PhD Thesis.\nHe spoke Hebrew, Polish, Russian, French, German and English and for many years his only profits were got by his translations from Hebrew and by making technical calculations for those working with reinforced concrete. Mathisson went to Cracow in\n1937\nwhere he collaborated with Professor Weyssenhoff, who held the chair of theoretical physics in the Jagellonian University, working on the theory of spin particles. He remained there for two years before he went to Cambridge in England in\n1939\n. There he developed his more important studies but sadly he died in Cambridge at the early age of forty-three only a year later.\nMathisson studied general dynamical laws governing the motion of a particle, with possibly a spin or an angular momentum, in a gravitational or electromagnetic field, and developed a powerful method for passing from field equations to particle equations. The subject was of particular interest at that time, as it had become clear that quantum mechanics cannot solve the difficulties that had arisen in connection with the interaction of point particles with fields, and a deeper classical analysis of the problem was needed.\nDirac\nwrote that the death of Mathisson:-\n... has cut short an interesting line of research.\nIn fact, he died at the early age of forty-three before the relations between his method and those of other researchers on the subject had been completely elucidated.\nThe synthesis of his method was published in\n1940\n[\nMathisson,\n1940]\n. Mathisson proved that the variational equation can be solved when it has been defined so that the equations to be imposed upon the characteristic tensor will be compatible with the variations allowed in the fields. The transition from the characteristic tensor to the dynamical variables is conveyed by an analysis of the physical meaning of the constituents. The ideas in this paper were developed further in a second part\n[\nMathisson,\n1942]\n, which was edited by\nP A M Dirac\nafter Mathisson's death, who wrote in a footnote to the introduction:-\nThis work was found in an unfinished state among the papers left by Dr Myron Mathisson, who died on\n13\nSeptember\n1940\n. I have edited and have added a summary. There was also some works to show that the condition of integrability of the magnitude of the angular momentum requires the electric momentum to vanish\n(\nand not merely to be parallel to the magnetic moment\n)\n, but I was not able to follow the argument and have omitted this part.\nIn this last paper Mathisson applied his general variational method to the case of a particle for which second moments are important but third and higher moments are negligible. He obtained the equations of motion for the angular momentum and for the centre of mass with arbitrary external forces. Then he calculated the angular forces for a charged particle with electric and magnetic moments moving in a general electromagnetic field. Finally, he calculated the linear forces for the case of no electric moment, leading to the equations for linear motion. He obtained the result that, in order that the mass may be integrable, the ratio of the magnetic moment to the angular momentum must be constant.\nHere is a list of Mathisson's publications:\nM Mathisson, Die Beharrungsgesetze in der allgemeinen Relativitätstheorie\nⓉ\n(\nThe steady laws in general relativity\n)\n,\nZ. f. Physik\n67\n(1931)\n,\n270\n-\n277\n.\nM Mathisson, Die Mechanik des Materieteilchens in der allgemeinen Relativitätstheorie\nⓉ\n(\nThe mechanics of matter in general relativity\n)\n,\nZ. f. Physik\n67\n(1931)\n,\n826\n-\n844\n.\nM Mathisson, Bewegungsproblem der Feldphysik und Elektronenkonstanten.\nⓉ\n(\nMotion problem of field physics and electron constants.\n)\n,\nZ. f. Physik\n69\n(1931)\n,\n389\n-\n408\n.\nM Mathisson, Eine neue Lösungsmethode für Differentialgleichungen von normalem hyperbolischem Typus\nⓉ\n(\nA new method for solving differential equations of normal hyperbolic type\n)\n,\nMath. Ann\n.\n107\n(1932)\n,\n400\n-\n419\n.\nM Mathisson, Metoda parametrysy w zastosowaniu de hiperbolicznych ukladöw röwuafi\nⓉ\n(\nThe parametric method applied to hyperbolic systems\n)\n,\nPrace matematyczno-fizyczne\n41\n(1934)\n,\n177\n-\n185\n.\nM Mathisson, Neue Mechanik materieller systemes\nⓉ\n(\nNew mechanics  of material systems\n)\n,\nActa Physica Polonica\n6\n(1937)\n,\n163\n-\n200\n.\nM Mathisson, Das Zitternde Elektron und seine Dynamik\nⓉ\n(\nThe vibrating electron and its dynamics\n)\n,\nActa Physica Polonica\n6\n(1937)\n,\n218\n-\n227\n.\nM Mathisson, Le problème de M. Hadamard relatif à la diffusion des ondes\nⓉ\n(\nThe problem of Hadamard on wave diffusion\n)\n,\nActa Math\n.\n71\n(1939)\n,\n249\n-\n282\n.\nM Mathisson, The variational equation of relativistic dynamics,\nProc. Cambridge Philos. Soc\n.\n36\n(1940)\n,\n331\n-\n350\n.\nM Mathisson, Relativistic dynamics of a spinning magnetic particle,\nProc. Cambridge Philos. Soc\n.\n38\n(1942)\n,\n40\n-\n60\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus"
  ]
}