{
  "nome_completo": "Nathan Saul Mendelsohn",
  "nome_curto": "Nathan Mendelsohn",
  "ano_nascimento": "1917",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mendelsohn/",
  "lugar_nascimento": "Brooklyn, New York, USA",
  "lugar_morte": "Toronto, Canada",
  "biografia": "Nathan Mendelsohn\n's father was Sam Mendelsohn who was an ironworker. Nathan was born into a modern Orthodox Jewish family at a time when there was considerable anti-Semitism in the United States.There was an upsurge of anti-Jewish feeling as part of a general wave of resentment of minority groups, especially in New York, around the time he was born. The family home in a tenement in Brooklyn was burned as part of anti-Semitic protests, and in\n1918\nhis father decided to move with his family of four children to Toronto where some relatives already lived. They settled in\nEuclid\nAvenue, a particularly appropriate place for the future mathematician Nathan! As a high school student, he quickly understood his own mathematical abilities when he realised he knew far more mathematics than his teacher. He also became aware of his own exceptional memory.\nWith a four-year scholarship, Mendelsohn entered the University of Toronto to study mathematics. He showed his great potential at this stage, being on the winning team of the first William Lowell Putnam competition in\n1938\n. See\nTHIS LINK\n. Teams consisting of three students took part in this mathematical contest between universities from the USA and Canada. Another member of the winning team from the University of Toronto was\nIrving Kaplansky\n. Also while he was a student he became interested in magic and he became extremely good as can be seen from the fact that he took second prize at an International Brotherhood of Magicians contest. It was an interest he continued throughout his life. After completing his first degree, Mendelsohn remained in Toronto to study for a Master's Degree. He then undertook research for his doctorate under\nG de B Robinson\n's supervision and submitted his doctoral thesis\nA Group Theoretic Characterization Of The General Projective Collineation Group\nto the University of Toronto in\n1941\n.\nRobinson\n, in a report, wrote:-\n... an abstract group G is defined by means of certain axioms which determine the subgroup structure of G; each element of G is defined to be a projective collineation and the subgroups concerned are called points and lines. It is proved that the group G and the group of projective collineations of the points and lines of G\n(\nthat is, its group of inner automorphisms\n)\nare isomorphic. A consideration of the complete group of automorphisms of G is now relatively easy.\nAfter completing his doctorate Mendelsohn undertook war work. This involved both code breaking and artillery simulations during World War II. After the war ended he was given a temporary appointment at Queen's University in Kingston, Ontario. His son, Eric Mendelsohn, wrote:-\nHe understood that, as a Jew, he would never get a permanent position. Queen's already had a Jewish professor in the department.\nAfter teaching mathematics at Queen's University for three years he was appointed in\n1948\nto the University of Manitoba in Winnipeg. Csillag writes\n[\n1\n]\n:-\n... he settled in Winnipeg, where the University of Manitoba welcomed any and all to build its fledgling math department, and where Prof Mendelsohn became deeply involved in the city's vibrant Jewish community. ... But with a salary of about $\n3\n000\na year, he was forced to work during the summers, driving to Quebec City with his family for teaching jobs.\nHe wrote papers on a wide variety of combinatorial problems, for example:\nSymbolic solution of card matching problems\n(1946)\n,\nApplications of combinatorial formulae to generalizations of Wilson's theorem\n(1949)\n,\nRepresentations of positive real numbers by infinite sequences of integers\n(1952)\n,\nA problem in combinatorial analysis\n(1953)\n,\nThe asymptotic series for a certain class of permutation problems\n(1956)\n, and\nSome elementary properties of ill conditioned matrices and linear equations\n(1956)\n.\nIn\n1961\nhe published, with Diane M Johnson and A L Dulmage, the paper\nOrthomorphisms of groups and orthogonal latin squares\n. This paper is particularly singled out when Mendelsohn was awarded the Henry Marshall Tory Medal of the\nRoyal Society of Canada\nin\n1979\n. In the paper:-\n... he constructed five pairwise orthogonal\n12\n×\n12\nlatin squares. This paper is important as it is the closest anyone has yet come to constructing a projective plan of composite order and as it made clever use of algebra to attack a difficult combinatorial problem.\nWe quote further from this\n1979\ndescription of his outstanding research contributions:-\nFrom this point on, his research became increasingly concerned with quasigroups and block designs and their relationship to algebra\n(\nmostly from a universal algebra point of view\n)\n. What makes this work so significant is the number of mathematicians attracted to it. Over the past fifteen years or so, he has turned out a steady stream of extraordinarily innovative papers on Steiner systems and generalizations, orthogonal and perpendicular latin squares, all sorts of block designs, and varieties of groupoids and quasigroups. These papers have attracted so much attention, and so many mathematicians have become interested in the types of combinatorics in them, that it is safe to say that they are the genesis of the branch of combinatorics known today as combinatorial universal algebra\n(\nor combinatorial algebra\n)\n.\nHowever there was much more to say about Mendelsohn's contributions to mathematics, particularly in Canada, beyond research contributions. Again note that we quote from a\n1979\ndocument:-\nNot the least of Mendelsohn's accomplishments has been the establishment at the University of Manitoba of one of the leading groups of algebraists\n(\nin lattice theory and universal algebra\n)\nin North America and beyond. Also, in view of the widespread influence he has had in mathematical circles in Canada and the many positions he has held in professional societies, one might say that he is due a major share of the credit for the leading role of Canadian mathematicians in research in various areas of combinatorial mathematics today.\nMendelsohn's interests outside mathematics were, like his mathematical interests, varied. We have already mentioned his interest in magic and he was often seen performing tricks. Other interests included making his own furniture, his son said:-\nHe'd make four or five pieces of furniture and then stop ...\nHe also made jewellery and wine.\nMendelsohn married Helen and they had two sons Eric and Alan. Eric Mendelsohn obtained his doctorate in mathematics from McGill University in\n1968\nand is currently Professor of Mathematics at the University of Toronto. Like his father his research interests are in combinatorics.\nAllow me\n[\nEFR\n]\na personal note regarding Nathan Mendelsohn. In around\n1970\nI became interested in combinatorial and computational group theory. Three great heroes of mine were\nDonald Coxeter\n,\nWillie Moser\nand Nathan Mendelsohn who all had made stunning contributions to producing algorithms to study groups given by generators and relations. Two of Mendelsohn's papers\nAn algorithmic solution for a word problem in group theory\n(1964)\nand\n(\nwith Clark T Benson\n)\nA calculus for a certain class of word problems in groups\n(1966)\nwere particularly important in launching this strand of my own research career - thank you Nathan!\nLet us end this biography by quoting Mendelsohn's own words about mathematics\n(\nsee for example\n[\n1\n]\n)\n:-\nMathematics is my vocation, my avocation, my hobby, my playground. I do other things for relaxation - I enjoy them - but my greatest pleasure is working with mathematical concepts.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}