{
  "nome_completo": "Naum Il'ich Feldman",
  "nome_curto": "Naum Il'ich Feldman",
  "ano_nascimento": "1918",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Feldman/",
  "lugar_nascimento": "Melitopol, Zaporozhye oblast, Ukraine",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Naum Il'ich Feldman\ngraduated from middle school in\n1936\nand entered the Faculty of Mathematics and Mechanics at the University of Leningrad. His studies, specialising in number theory and supervised by R O Kuz'min, were completed by\n1941\nwhen he graduated from Leningrad. However by this time World War II had been taking place for around\n18\nmonths and soon events would see Feldman involved in the war.\nAt the start of World War II Russia had been an ally of Germany but Hitler, after highly successful military campaigns in the west, turned his attention to attacking Russia. He conceived Operation Barbarossa and began to build up army divisions to carry out the attack. Barbarossa was launched on\n22\nJune\n1941\nand the German armies rapidly moved east with the aim of reaching Moscow in eight weeks. Feldman was called up to serve in the Russian army in June and by October\n1941\nhe was totally involved in the battle against the advancing German troops. By December\n1941\nthe Germans ringed Moscow but now, partly due to the severe winter weather, their advance was halted. The Russians began to counter-attack the German armies around Moscow and Feldman saw action for the first time in this bitter fighting. He was later awarded a medal \"For the Defence of Moscow\".\nGiven the high Russian casualties during World War II, it is quite remarkable that Feldman survived the war. He saw action in many parts and near the end of the war he was involved in the two-month siege of Königsberg which ended in April\n1945\nwith the city virtually destroyed. For his part in this siege Feldman was awarded a medal \"For the Taking of Königsberg\". He received many other decorations for his war service, including the order of the \"Red Star\", and \"The Fatherland War\". He also received medals \"For War Service\" and \"For Victory over Germany\".\nAt the end the war Feldman was with the Russian armies in East Prussia. Once he was demobbed from the army he returned to Moscow where, in\n1946\n, he registered as a research student in the Institute of Mathematics of Moscow University. His Ph.D. studies were supervised by\nAleksandr O Gelfond\nand his thesis was submitted in\n1949\n. Since so much of Feldman's later work was based on the work he undertook for this thesis we give a brief overview of its main results at this point. In\n1873\nHermite\npublished the first proof that\ne\ne\ne\nis a transcendental number. This result was strengthened by\nBorel\nin\n1899\nwhen he proved a lower bound for\nP\n(\ne\n)\nP(e)\nP\n(\ne\n)\n, where\nP\nP\nP\nis a polynomial with integer coefficients, depending on the maximum modulus of the integer coefficients of\nP\nP\nP\n.\nGelfond\n, Feldman's supervisor, had extended\nBorel\n's result to numbers of the form\nα\nβ\n\\alpha^{\\beta}\nα\nβ\n, where\nα\n,\nβ\n\\alpha, \\beta\nα\n,\nβ\nare algebraic numbers. Feldman proved in his thesis\nBorel\ntype results\n(\ncalled the measure of transcendence\n)\nfor logarithms of algebraic numbers, obtaining estimates for the lower bound depending\n(\nas did\nGelfond\n)\non both the degree of\nP\nP\nP\nand the maximum modulus of its coefficients.\nAfter the award of his Ph.D., Feldman was sent to the Ufimskii Oil Institute where he was appointed as Head of the Department of Mathematics. He worked there for four years from\n1950\nthen he went to the Moscow Institute of Geological Prospecting, teaching there from\n1954\nto\n1961\n. He then went to Moscow State University where he was appointed as a Reader in the Department of Mathematical Analysis. He was awarded a D.Sc in\n1974\nand was promoted to Professor in\n1980\n.\nIn addition to his work on the measure of transcendence of numbers, Feldman also produced many results strengthening\nLiouville\n's theorem on the rational approximation of algebraic numbers. The power of Feldman's results in this area lie in the fact that he was able to give effective constants rather than just prove the existence of such constants. In\nAn effective power sharpening of a theorem of Liouville\nin\n1971\nhe proved the following theorem:-\nLet\nα\n\\alpha\nα\nbe an algebraic number of degree\nn\n≥\n3\nn ≥ 3\nn\n≥\n3\n; then there exist effective positive constants\na\na\na\nand\nC\nC\nC\n, depending only on\nα\n\\alpha\nα\n, such that\n∣\nα\n−\np\nq\n∣\n>\nC\nq\na\n−\nn\n|\\alpha - \\large\\frac{p}{q}\\normalsize | > Cq^{a-n}\n∣\nα\n−\nq\np\n​\n∣\n>\nC\nq\na\n−\nn\nfor all rational integers\np\n,\nq\np, q\np\n,\nq\nwith\nq\n>\n0\nq > 0\nq\n>\n0\n.\nThese two themes are, of course, closely connected. For example in\n1960\nFeldman published two papers\nThe measure of transcendency of the number π\nand\nApproximation by algebraic numbers to logarithms of algebraic numbers\nwhich were reviewed together by\nMahler\n:-\nIn these two important papers, which are closely connected, measures of transcendency for\nπ\n\\pi\nπ\nand\nlog\n⁡\nα\n\\log \\alpha\nlo\ng\nα\n(\nα\n\\alpha\nα\nalgebraic\n)\nare found which are far better than any obtained before. ... The proofs in both papers use similar ideas. They are based on\nDirichlet\n's Schubfachprinzip\nⓉ\n(\nThe pigeonhole principle\n)\nand on two interpolation formulae ...\nIn\n1982\nFeldman published a\n312\npage text\nHilbert's seventh problem\n.\nHilbert\n's seventh problem asked for a proof of the transcendence of a to the power b when a is an algebraic number and b is an irrational algebraic number. Loxton writes in a review of this book:-\nThis book is a leisurely account of the mathematics which has grown out of the attempts to solve\n[\nHilbert\n's seventh problem\n]\n. The first chapter deals with the early history and the work of\nHermite\nand\nLindemann\non the exponential function. Then follows a treatment of the methods of\nGelfond\nand\nSchneider\nwhich led to the solution of\nHilbert\n's seventh problem. Further applications of these methods to the arithmetic properties of elliptic functions, transcendence measures and algebraic independence are also given. The last part of the book describes\nAlan Baker\n's work on linear forms in the logarithms of algebraic numbers and its applications to\nDiophantine equations\nand to the determination of imaginary quadratic fields with class number\n1\nor\n2\n. Most of this material might now be called \"classical\". However, the author includes frequent remarks on recent work in transcendence theory ....\nIn\n[\n2\n]\nthe authors write of Feldman as a teacher:-\nNaum Il'ich was a gifted teacher and stood out for his great teaching skill. He loved to give lectures, to run seminars, to work with both undergraduate and postgraduate students. Many students did their coursework and diploma work under his supervision, and sic of them completed their Ph.D.s. He lectured uninterruptedly for\n45\nyear, until his last day, to students of mathematics, devoting great power to his teaching.\nNaum Il'ich stood out by his great integrity, high principles, goodness and benevolence. He was highly respected by his undergraduate and postgraduate students, his colleagues in the department and faculty, and many mathematicians, who will always remember him as a well-known teacher, an outstanding lecturer, and a remarkable person.",
  "math_areas": [
    "Applied Mathematics",
    "Logic",
    "Number Theory"
  ]
}