{
  "nome_completo": "Neil Sidney Trudinger",
  "nome_curto": "Neil Trudinger",
  "ano_nascimento": "1942",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Trudinger/",
  "lugar_nascimento": "Ballarat, Victoria, Australia",
  "lugar_morte": null,
  "biografia": "Neil Trudinger\nwas the son of Air Vice-Marshal L Trudinger. He was educated at Richmond High School, New South Wales, then was an undergraduate at the University of New England in Armidale, New South Wales, Australia. He was awarded a B.Sc. in\n1962\nand then went to the United States to undertake graduate work at Stanford University.\nFirst he proceeded to a Master's degree and the a doctorate under the supervision of\nDavid Gilbarg\n. He was awarded a Ph.D. in\n1966\nfor his thesis\nQuasilinear Elliptical Partial Differential Equations in n Variables\n. Several papers, based on the work of his dissertation, appeared in\n1967\n. First there is the paper\nOn the Dirichlet problem for quasilinear uniformly elliptic equations in n variables\nin which he extended previous work by his supervisor\nDavid Gilbarg\n,\nOlga Ladyzhenskaya\nand others on the solvability of the classical\nDirichlet\nproblem in bounded domains for certain second order quasilinear uniformly elliptic equations. Secondly, in the paper\nThe Dirichlet problem for nonuniformly elliptic equation\nhe exploited the maximum principle to formulate general conditions for solvability of the\nDirichlet\nproblem for certain nonlinear elliptic equations. In another\n1967\npaper\nOn Harnack type inequalities and their application to quasilinear elliptic equations\nTrudinger examines weak solutions, subsolutions and supersolutions of certain quasilinear second order differential equations. In our list of his\n1967\npapers we mention finally\nOn imbeddings into Orlicz spaces and some applications\n.\nAfter the award of his doctorate from Stanford University, Trudinger became a\nCourant\nInstructor at the\nCourant\nInstitute of Mathematical Sciences of New York University during the academic year\n1966\n-\n67\n. He then returned to Australia where he was appointed as a lecturer at Macquarie University in\n1967\n. He was promoted to Senior Lecturer before moving, in\n1970\n, to the University of Queensland where he was first appointed as a Reader, then promoted to Professor. In\n1973\nhe moved to the Australian National University where he was Head of the Department of Pure Mathematics until\n1979\n. In\n1977\nTrudinger published an important book in collaboration with\nDavid Gilbarg\n.\nThe book Elliptic partial differential equations of second order\naimed to present\n(\nin the words of the authors\n)\n:-\n... the systematic development of the general theory of second order quasilinear elliptic equations and of the linear theory required in the process.\nO John gives an overview of the book as part of his review:-\nThe book is divided into two parts. The first ... is devoted to the linear theory, the second ... to the theory of quasilinear partial differential equations. These\n14\nchapters are preceded by an Introduction ... which expounds the main ideas and can serve as a guide to the book. The authors restrict themselves mainly to the theory of the\nDirichlet\nproblem. With the exception of the prerequisites of basic real analysis and linear algebra the material of this book is almost entirely self-contained. Almost every chapter is concluded by \"Notes\"\n(\nhistorical and bibliographical remarks, further results\n)\nand \"Problems\". The authors have succeeded admirably in their aims; the book is a real pleasure to read.\nA second edition of this wonderful book appeared in\n1983\n. It had two new chapters one of which examined strong solutions of linear elliptic equations, and the other was on fully nonlinear elliptic equations. A further edition appeared in\n1998\n. In this the authors write:-\nThe theory of nonlinear elliptic second order equations has continued to flourish during the last fifteen years and, in a brief epilogue to this volume, we signal some of the major advances. Although a proper treatment would necessitate at least another monograph, it is our hope that this book, most of whose text is now more than twenty years old, can continue to serve as background for these and future developments.\nSince our first edition we have become indebted to numerous colleagues, all over the globe. It was particularly pleasant in recent years to make and renew friendships with our Russian colleagues,\nOlga Ladyzhenskaya\n, ... who have contributed so much to this area. Sadly, we mourn the passing away in\n1996\nof\nEnnio De Giorgi\n, whose brilliant discovery forty years ago opened the door to higher-dimensional nonlinear theory.\nThis\n1998\nedition was reprinted in the \"Classics in Mathematics\" series by Springer-Verlag in\n2001\n.\nIn following the editions of the famous text by\nGilbarg\nand Trudinger we have become side-tracked from presenting details of Trudinger's career. In\n1981\nhe was honoured by the\nAustralian Mathematical Society\nwhen he became the first recipient of their\nAustralian Mathematical Society\nMedal:-\n... awarded to a member of the Society under the age of\n40\nyears for distinguished research in the mathematical sciences. A significant portion of the research work should have been carried out in Australia.\nIn\n1982\nhe became Director of the Centre for Mathematical Analysis at ANU, holding this position until\n1990\n. After a short time away from ANU, he returned as Director of the Centre for Mathematics and its Applications in\n1991\n. In\n1992\nhe became Dean of the School of Mathematical Sciences. Trudinger was elected a fellow of the\nAustralian Academy of Science\nin\n1978\nand was awarded their Hannan Medal in\n1996\n. He was also honoured with election as a fellow of the\nRoyal Society of London\nin\n1997\n. On\n24\nNovember\n1995\nthree prizes were awarded by the Institut\nHenri Poincaré\nand the publisher Gauthier-Villars, with the support of the Centre National de la Recherche Scientifique. Each prize:-\n... carries an award of\n10\n000\nFF,\n[\nand\n]\nrecognizes outstanding articles appearing in each of the three sections of the journal Annales de l'Institut\nHenri Poincaré\n. In the nonlinear analysis section, the prize goes to N S Trudinger of the Australian National University for the paper \"Isoperimetric inequalities for quermassintegrals\".\nToday Trudinger coordinates the Applied and Nonlinear Analysis programme at the Australian National University. We end this biography by quoting the \"Highlights\" from the web page of the programme:-\nIn recent years, members of the programme have solved major open problems in curvature flow, affine geometry and optimal transportation, using techniques from nonlinear partial differential equations. The first complete proof, for more than two dimensions, of the famous\n200\nyear old\nMonge\nproblem of mass transfer was found by programme members in\n2001\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}