{
  "nome_completo": "Nicolaus Mercator",
  "nome_curto": "Nicolaus Mercator",
  "ano_nascimento": "1620",
  "ano_morte": "1687",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mercator_Nicolaus/",
  "lugar_nascimento": "Eutin, Holstein, Holy Roman Empire (now Germany)",
  "lugar_morte": "Paris, France",
  "biografia": "Nicolaus Mercator\nwas actually called Niklaus Kauffman. He later changed his family name, which was a common thing to do at this time, to Mercator which was the Latin form of 'merchant'. Nicolaus's father was Martin Kauffman who was a school master at Oldenburg in Holstein from\n1623\nuntil his death in\n1638\n. Although we have no evidence to prove that Nicolaus attended his father's school, it is impossible to believe that he would attend any other than the one in Oldenburg where his father taught.\nHe entered the University of Rostock in\n1632\n, received a degree in\n1641\n, then went to Leiden for a short period. After his return to Rostock in\n1642\nhe was appointed to a post in the Faculty of Philosophy at the University. In\n1648\nMercator moved to the University of Copenhagen. While he was working there, he published a number of textbooks on spherical trigonometry, geography and astronomy\n[\n1\n]\n:-\n... if not markedly original, they show his firm grasp of essentials.\nThree texts were published in\n1651\n, namely\nTrigonometria sphaericorum logarithmica\nⓉ\n(\nSpherical trigonometry and logarithms\n)\n,\nCosmographia\nⓉ\n(\nCosmography\n)\n, and\nAstronomica sphaerica\nⓉ\n(\nSpherical astronomy\n)\n. The first tabulates logarithms of the sine, cosine, tangent and cotangent functions at\n1\n° intervals and shows how to solve triangles using logarithmic functions. The second of these texts deals with physical geography, while the third is a text on spherical astronomy. Further publications followed:\nRationes mathematicae subductae\nⓉ\n(\nMathematical reasons explained\n)\n(1653)\nsets out to distinguish between rational and\nirrational\nnumbers pointing out that in music rational ratios lead to harmony while irrational leads to dissonance. Again he gives an astronomical example where rational ratios corresponds to\nKepler\n's structure of the planetary system given in terms of regular polyhedra, while irrational ratios correspond to the observed motions. Probably in the same year Mercator published a text\nDe emendatione annua diatribae duae\nⓉ\n(\nCorrection to the distribution of days in the year\n)\nin which he argues for a new version of the calendar in which there are\n12\nmonths with\n29\n,\n29\n,\n30\n,\n30\n,\n31\n,\n31\n,\n32\n,\n31\n,\n31\n,\n31\n,\n30\n,\n30\ndays respectively.\nAfter working at the University of Copenhagen for six years, Mercator had to leave when the university was closed due to the plague. From this time on things were not too good for him. He published nothing for ten years but we do know that he maintained his interests in astronomy. The paper\n[\n2\n]\nlooks at three letters between\nBoulliau\nand Mercator in\n1659\nand early\n1660\n:-\nIsmael Boulliau\n, Nicolaus Mercator,\nJeremiah Horrocks\n: this rare conjunction of post-Keplerian astronomers occurs in a brief exchange of letters in\n1659\nand early\n1660\n. Three letters exchanged between\nBoulliau\nand Mercator, concerning the famous transit observation of\nHorrocks\n, symbolically link three distinct phases of post-Keplerian thought. Each astronomer made significant, but distinctive, contributions to the acceptance, modification, and transmission of Keplerian planetary theory. ...\nBoulliau\n, although rejecting\nKepler\n's area rule and his vision of a celestial dynamics, became known in the middle decades of the seventeenth century as the leading proponent of elliptical orbits; whereas his younger correspondent, Mercator, author of several mathematical and astronomical texts, argued the superiority of the Keplerian ellipse and area rule over rival elliptical hypotheses in the latter half of the century.\nMercator went to England some time before\n1660\n, almost certainly in an attempt to improve his fortunes. We do know that Cromwell was aware of Mercator proposals for changing the calendar and some historians suggest that Cromwell may have invited Mercator to England. There is no direct evidence for this hypothesis, however. Certainly Mercator would have liked to have received a university appointment but, unable to find such a position, he did private tutoring in London. He was soon recognised in England, however, as a fine mathematician and he began to exchange ideas with\nOughtred\n,\nPell\nand\nCollins\n. His first publication in over ten years, and his first in England, was\nHypothesis astronomica nova\n(\npublished in London in\n1664)\nin which he combined\nKepler\n's theory of elliptical orbits with other ideas of his own. It was probably through reading this text that\nNewton\nlearned about\nKepler\n's claim that the orbits of the planets were ellipses.\nOne of the big problems of the day was being able to determine the longitude at sea. A known theoretical solution was to devise a clock which would keep accurate time at sea. Mercator invented such a marine chronometer, a pendulum clock, and on the strength of this invention he was elected a Fellow of the\nRoyal Society\nin November\n1666\n. He also made measurements of air pressure for the\nRoyal Society\nand got to know\nHooke\nwith whom he shared many common interests.\nMercator discovered the well known series, sometimes called\nMercator's series\n,\nln\n⁡\n(\n1\n+\nx\n)\n=\nx\n−\n1\n2\nx\n2\n+\n1\n3\nx\n3\n−\n1\n4\nx\n4\n+\n.\n.\n.\n\\ln(1 + x) = x - \\large\\frac{1}{2}\\normalsize x^{2} + \\large\\frac{1}{3}\\normalsize x^{3} - \\large\\frac{1}{4}\\normalsize x^{4} + ...\nln\n(\n1\n+\nx\n)\n=\nx\n−\n2\n1\n​\nx\n2\n+\n3\n1\n​\nx\n3\n−\n4\n1\n​\nx\n4\n+\n.\n.\n.\nHe published this in\nLogarithmotechnia\n1668\n. This series was also investigated by\nMengoli\n.\nIn the following year of\n1669\n, at the request of\nCollins\nand Seth Ward, Mercator translated the Dutch text\nAlgebra ofte Stel-konst\nⓉ\n(\nAlgebra of sets and numbers\n)\nby Kinckhuysen into Latin. This brought Mercator into contact with\nNewton\nand the two men exchanged letters, discussing among other things the motion of the moon. Mercator published a further two volume work in astronomy\nInstitutiones astronomicae\nⓉ\n(\nAstronomical institutions\n)\nin\n1676\n. These were well written texts covering the latest knowledge on the subject.\nNewton\nread these works and in fact\nNewton\n's copy containing the notes he made as he read it still exists.\nOne might have thought that Mercator's reputation was sufficient that he would have been able to acquire a good post but it seems that he could not. In\n1676\nHooke\nproposed Mercator for the post of Mathematical Master at Christ's Hospital, but he was not appointed. Saddened by his inability to get a teaching position, in\n1682\nhe moved to France, this time to fill a specific position, namely to design the waterworks at Versailles. Jean-Baptiste Colbert, founder of the\nAcadémie des Sciences\nin Paris in\n1666\nand controller general of finance in France, had invited Mercator to undertake the project. Unfortunately Mercator fell out with Colbert so this project was not a success.\nThere is some reason to confuse Nicolaus Mercator with\nGerardus Mercator\nsince Nicolaus also worked on\nGerardus\n's map projection.",
  "math_areas": [
    "Algebra",
    "Analysis"
  ]
}