{
  "nome_completo": "Nicolas Vilant",
  "nome_curto": "Nicolas Vilant",
  "ano_nascimento": "1737",
  "ano_morte": "1807",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vilant/",
  "lugar_nascimento": "Ferryport-on-Tay, now Tayport, Scotland",
  "lugar_morte": "St Andrews, Scotland",
  "biografia": "Nicolas Vilant\nwas Regius Professor of Mathematics at St Andrews University in Scotland during\n1765\n-\n1807\n. Plagued by ill-health, he was unable to teach for much of this time, and employed a series of assistants. Well-versed in the British analytical tradition, he was, like his contemporaries, largely unaware of developments in the rest of Europe. However, he was a mathematician of some skill, and his textbook\nThe Elements of Mathematical Analysis, abridged\n,\nfor the use of students\nis of considerable interest. Though unable to complete for publication a more comprehensive work, many manuscripts survive in St Andrews University Library. The only known likeness of Nicolas Vilant is a small drawing by his colleague Professor John Cook, who often avoided the difficulty of faces by drawing rear views - perhaps appropriately in Vilant's case.\nThe Vilant family, originally from France, had long associations with St Andrews University and with the surrounding neighbourhood, where several members held academic and church positions. Nicolas Vilant's parents were William Vilant, the minister at Ferryport-on-Tay\n(\nnow Tayport\n)\nand his second wife Jean Wilson. The date we have given above as his date of birth, is actually the date on which he was baptised. He first matriculated at St Andrews in\n1752\n, studying mathematics under David\n(\nII\n)\nGregory.\nHe graduated M.A. in\n1756\nand worked for a time as a mathematical teacher at Watts' Academy in London. He returned to St Andrews to succeed David Gregory in\n1765\n, the same year that\nJohn Playfair\ngraduated M.A. He held the mathematics chair until his death, but for much of the time he was unable to teach owing to severe rheumatic pains, probably rheumatoid arthritis, that set in when he was in his mid-thirties. As a private arrangement, he employed a series of assistants to teach in his stead; but he gave occasional lectures, supervised the work of his assistants and took an interest in the best students. Among his assistants were the former St Andrews students\nJames Glenie\n,\nJohn West\n, James Brown, Thomas Duncan and Thomas Chalmers; and other students of this time include\nJames Ivory\n,\nJohn Leslie\nand Adam Anderson. Though Vilant's colleagues complained of his inability to perform his duties, the historian David Masson\n[\nMasson,\n1911\n;\n45]\nlater drew attention to \"a tradition of unusual mathematical excellence and ardour\" dating from the time that \"the nominal incumbent of the mathematical chair, Professor Vilant, finding himself disqualified by ill-health, had committed the duties ... to well-chosen assistants.\" Indeed, it is reasonable to claim that a considerable portion of the mathematical and physical activity in late eighteenth-century and early nineteenth-century Britain emanated, at least indirectly, from St Andrews.\nVilant's\nThe Elements of Mathematical Analysis, abridged. For the Use of Students\nis perhaps the first book in English to use the phrase \"Mathematical Analysis\" in its title. A large part was first printed in\n1777\nand then used as a textbook from\n1783\n. The Preface begins:-\nIn this small Treatise on Mathematical Analysis, the most general Propositions only are given; and in Notes at the bottom of the pages, are pointed out the principal authors to be consulted by students. The whole up to page\n129\n, was printed in\n1777\n; but owing to the Author's bad health, etc it was not until\n1783\n, that the same with the addition of the quarter sheet from page\n129\nto page\n133\nwas used here as a Text Book.\nBut most extant copies of the book were published in\n1798\nwith additional Notes and a separately-paginated\n28\n-page\nSynopsis of Book V. of Euclid's\nElements\n(\nprinted in St Andrews in\n1797)\n. Though much briefer than other contemporary texts, it nevertheless covers a great deal of ground; but it often lacks clarity and is written in an already old-fashioned style. Those parts for which some originality may be claimed are:\n(\na\n)\na method for finding the cube root of binomials of form\nR\n±\n√\nS\nR ± √S\nR\n±\n√\nS\n, where\nS\nS\nS\nmay be positive or negative, and\n(\nb\n)\na method for finding\nrational\nand whole-number solutions of indeterminate problems involving linear, quadratic and cubic equations.\nVilant states in his preface that he \"proposes hereafter to publish a complete System of the Elements of Mathematical Analysis demonstrated\", but this would have to wait until \"his health will allow him to arrange properly what he hath prepared on this subject.\" His health did not allow this, but thirteen volumes of manuscripts on this theme, and some other subjects, are preserved in St Andrews University Library.\nVilant was an able synthesiser and summariser; perhaps the\nlast\nanalyst steeped in the British tradition that followed\nIsaac Newton\n, but largely ignorant of important developments elsewhere in Europe.\nAround\n1770\nhe married Elizabeth Brand; two of their sons later matriculated at the University of St Andrews.\nThe picture of Vilant is from\nCook Drawings\n[\nc.\n1797]\n. Rear view of Nicolas Vilant, drawn by Professor John Cook. Cook-\n25\n-\n3\n,  St Andrews University Library Special Collections.",
  "math_areas": [
    "Analysis"
  ]
}