{
  "nome_completo": "Nicolas Malebranche",
  "nome_curto": "Nicolas Malebranche",
  "ano_nascimento": "1638",
  "ano_morte": "1715",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Malebranche/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Nicolas Malebranche\n's father\n(\nalso called Nicolas Malebranche\n)\nwas a secretary to the king, while his mother, Catherine de Lauzon, was a very gifted lady. It is probable that Malebranche's great literary style came from his mother's tuition. Malebranche was the youngest of a large number of children, but his life was much influenced by illness. He was crippled all his life with a deformed spine and this meant that he did not attend school in the usual way but was educated at home to the age of sixteen.\nMalebranche studied philosophy and theology at the Collège de la Marche from\n1654\nto\n1656\nand graduated Master of Arts. P André writes in\n[\n2\n]\nthat he found theology:-\n... neither great nor true, full of vain subtleties, perpetual equivocation, lacking in taste and Christian spirit.\nMalebranche went to the Sorbonne in Paris until\n1659\n, again intending to make theology his life's work but he found it no more to his liking than he had before. He considered it\n[\n2\n]\n:-\n... only a confused mass of human opinions, frivolous discussions and hair-splitting subtleties, without any order or principle or rational interconnection.\nRefusing to accept a canonry at Notre Dame, he joined the Congregation of the Oratory in\n1660\n. The Congregation of the Oratory of Jesus and Mary Immaculate, also called the Bérulliens, was founded by Pierre de Bérulle in\n1611\n. Its chief aim was, and still is, training candidates for the priesthood. De Bérulle was a friend of\nDescartes\nand by the time Malebranche studied at the Oratory its teaching were strongly based on\nDescartes\n' philosophy. In\n1664\nMalebranche was ordained a priest having studied ecclesiastical history, Hebrew and Biblical criticism.\nMalebranche read\nDescartes\n'\nTraité de l'homme\nⓉ\n(\nTreatise on Man\n)\nand this turned him towards a study of mathematics and physics. In\n[\n2\n]\nhis reaction to\nDescartes\n' book is recounted:-\nThe joy of becoming acquainted with so large a number of discoveries caused him such palpitations of the heart that he was obliged to stop reading in order to recover his breath.\nMalebranche himself said that\nDescartes\nhad:-\n... in thirty years discovered more truths than all the other philosophers put together.\nMalebranche was also influenced by\nLeibniz\nwho visited Paris in\n1672\n. The two had many meetings when they discussed ideas both of philosophy and of mathematics and, in particular,\nLeibniz\nconveyed many of his ideas about his new calculus to Malebranche.\nMalebranche became professor of mathematics at the Congregation of the Oratory from\n1674\n. He had a large influence on the development of mathematics and science, principally through the group which he built up in Paris which was seen as the leading one in France. Mathematicians such as\nVarignon\n,\nde L'Hôpital\n, Guisnée and\nReyneau\nall became part of this circle at the Oratory.\nAlthough Malebranche made no outstanding mathematical discoveries, he is of major importance in the development of mathematics since through him the work of\nLeibniz\nand\nDescartes\nin mathematics was spread and developed. One of Malebranche's direct contributions to mathematics was his editorial role in the publication of\nde L'Hôpital\n's\nAnalyse des infiniment petits pour l'intelligence des lignes courbes\nⓉ\n(\nAnalysis of infinitesimals for the intelligence of curved lines\n)\n. Malebranche also had a strong influence through his teaching, in particular he taught mathematics and physics to\nPrivat de Molières\nand\nReyneau\n. Others were not so much his disciples as his opponents, for example he was in dispute with\nArnauld\nfor many years.\nMalebranche is a major philosopher and follower of\nDescartes\n. His\nmetaphysics\nis his belief that\nwe see all things in God\n. Human knowledge of the world is only possible through a relation between man and God. He developed\nDescartes\n' ideas to bring them more in line with standard Roman Catholic orthodox belief.\nAt first Malebranche's ideas of the physical world followed closely those of\nDescartes\nand were based on a belief in a rational geometrical world. He based his laws of motion on the abstract laws of collisions between idealised solid objects. However\nLeibniz\ntried, with some success, to persuade Malebranche that the laws of motion were not entirely mathematical laws but were the consequence of God's creation.\nWhen it came to an understanding of force, Malebranche found great difficulties with the ideas of his fellow scientists. He wrote:-\nIt seems to me that people make very great errors and even very dangerous ones regarding force which gives movement and which transports bodies.\nHow did Malebranche explain force? He did not believe in\nDescartes\n' idea of a \"clockwork universe' which God set in motion and then it ran itself, only determined by completely general laws of mathematics. Malebranche needed to have a more active role for God in his universe and he did this through his concept of force. He basically believed that if two spheres collided then there was no force which changed the direction of their motion. Rather he saw the collision as an occasion for God to act and since a perfect God would act in the simplest way then the result would always result in the same change in motion.\nMalebranche's most important work is the three volumes of\nDe la recherche de la vérité\nⓉ\n(\nOn the search for truth\n)\n(1674\n-\n75)\n. The work received much acclaim from many and was translated into many languages. Criticism of his work, in particular by\nArnauld\n, led to Malebranche's publication of\nTraité de la nature et de la grâce\nⓉ\n(\nTreatise on Nature and Grace\n)\n(1680)\n, which was banned by the Roman Catholic Church ten years later. Another important work is\nEntretiens sur la métaphysique et sur la religion\nⓉ\n(\nTalks on Metaphysics and Religion\n)\n(1688)\nin which Malebranche sets out in the clearest way his metaphysics and philosophy.\nMalebranche's other work includes research into the nature of light and colour, studies in the\ninfinitesimal\ncalculus and work on vision. This mathematical and scientific work was published in\nRéflexions sur la lumière, les couleurs et la génération du feu\nⓉ\n(\nReflections on light, colors and the generation of fire\n)\nin\n1699\n. He was elected to the\nAcadémie des Sciences\nin the same year of\n1699\nmainly as a result of his work\nTraité des lois de la communication du mouvement\nⓉ\n(\nTreatise on the Laws of Communication of Motion\n)\n.\nWhat was the opinion of contemporary and later writers on Malebranche and his ideas?\nFontenelle\nconsidered him a great mathematician and physicist and also a great writer:-\nHis diction is pure and chaste, and has all the dignity which the subject requires and all the grace of which it admits.\nD'Alembert\nalso praises his writing but not his philosophy:-\nI think that he is in all respects very inferior to Bayle and\nGassendi\nas a philosopher; it even seems to me that he was less a great philosopher than an excellent writer on philosophy ... I see him as a good demolisher but a bad architect.\nAll\nd'Alembert\ncan find in the way of praise of Malebranche's\nDe la recherche de la vérité\nⓉ\n(\nOn the search for truth\n)\nis to say it contained:-\n... a few useful truths concealed as it were stifled beneath a heap of systems which have long since been forgotten.\nHowever\nd'Alembert\nfinds that Malebranche writes in:-\n... the most suitable language for philosophy, the only one worthy of it, methodical without dryness, thoroughly developed but without verbiage, interesting and sensible without false warmth, great without effort, and noble without turgidity.\nVoltaire echoed the same thoughts when he compared Locke and Malebranche saying:-\nA single page of Locke contains more truths than all the volumes of Malebranche; but a single line of Malebranche reveals more subtlety, imagination, finesse, and genius, perhaps, than all of Locke's enormous book.\nMalebranche was to have a strong influence on many who visited Paris while he and his disciples exerted a strong influence there. One who was strongly influenced was\nBerkeley\nwho visited Paris in\n1713\nand met with Malebranche.\nMalebranche was taken ill in\n1715\nwhile staying at the house of a friend at Villeneuve- Saint- Georges. He was taken back to the Oratory in Paris and died four months later after great suffering.\nFontenelle\nwrites that his illness:-\n... adapted itself to his philosophy. The body, which he so much despised, was reduced to nothing; but like the mind, accustomed to supremacy, continued sane and sound. He remained throughout a calm spectator of his own long death, the last moment of which was such that it was believed he was merely resting.",
  "math_areas": [
    "Analysis",
    "Calculus"
  ]
}