{
  "nome_completo": "Nigel John Kalton",
  "nome_curto": "Nigel Kalton",
  "ano_nascimento": "1946",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kalton/",
  "lugar_nascimento": "Bromley, Kent, England",
  "lugar_morte": "Columbia, Missouri, USA",
  "biografia": "Nigel Kalton\n's parents were Gordon Edelbert Kalton\n(1903\n-\n1971)\nand Stella Maude Hester Florence Vickery\n(1911\n-\n1981)\n. Kalton is not the name that appears on Nigel's birth certificate, rather it is the surname Kaltenbach. In fact Nigel's grandfather was Gordon Edelbert Kaltenbach\n(1879\n-\n1955)\n, a photographic dealer living in Birmingham. He changed his name by deed poll from the Germanic Kaltenbach to the British Kalton in March\n1938\n. Given the international situation of the time, it is easy to understand why someone who was born in England would want to change their Germanic name for one which sounded British. Other members of the family also adopted the name Kalton. Gordon and Stella Kalton were married in Surrey, England in June\n1932\n. Nigel had an older sister Stella Pamela\n(1933\n-\n1973)\nand an older brother Gordon G W\n(\nborn\n1936)\n.\nIt was while he studied at Dulwich College, a prestigious independent boy's school in south London, that his ability in mathematics and in chess became apparent. However, before he became fascinated by mathematics, he had a great love for history which he would have rated as his favourite subject up to the age of fifteen. However, he always knew that mathematics was the subject to which he was going to devote his life. He said\n[\n8\n]\n:-\nFrom a young age, I was good at mental arithmetic, and somehow mathematics was my subject. I never really thought to do anything else.\nOne of his fellow pupils at Dulwich College was Ray Keene, who became only the second British chess player to become a chess grandmaster. Keene was about\n18\nmonths younger than Kalton and the two were both on the Dulwich College chess team. In the College championships, Kalton once beat Keene but, although Kalton was one of the top players in Britain, he usually lost to Keene. Kalton was in the Dulwich College team that came second in the\n1964\nUK Schools Team Championship. After graduating from Dulwich College, Kalton entered Trinity College Cambridge in\n1964\n, having won a prestigious scholarship, where he studied mathematics. However, he continued to play chess to the highest level, representing Trinity in the college league. He twice came second in the University of Cambridge championship but he had strong competition since Ray Keene also studied at Trinity College. Kalton played in the annual Oxford v Cambridge chess match which gained him a half-Blue He won the major open section of the British Chess Championships in\n1970\n, this being a qualifying competition for the\n1971\nBritish Chess Championship.\nKalton graduated in\n1968\nwith his first degree, having won a senior scholarship and the G F A Osbourn Prize awarded to the most distinguished Second Year Mathematician at Trinity College. He then began undertaking research with Ben Garling as his thesis advisor. Garling spent the year\n1969\n-\n70\nat Lehigh University in Bethlehem, Pennsylvania, USA and Kalton went to Lehigh for the year as a visiting lecturer. He said\n[\n8\n]\n:-\nGoing to Lehigh was an eye-opener. At Cambridge, I was used to a competitive atmosphere. It was as if people were constantly trying to prove that they rightfully belonged there. At Lehigh during a talk, people would chime in with no airs about them. Questions were asked and discussed. No one tried to score off a speaker, and ultimately people had fun talking mathematics.\nAt Cambridge, Kalton had met Jennifer. They married in\n1969\nand had two children Neil and Helen. In\n1970\nKalton was awarded a doctorate for his thesis\nSchauder decompositions in locally convex spaces\nand he was awarded the Rayleigh Prize for the high quality of this work. He began publishing papers before submitting his thesis: the five papers\nSchauder decompositions and completeness\n,\nSchauder decompositions in locally convex spaces\n,\nA barrelled space without a basis\n,\nUnconditional and normalised bases\n, and\nSchauder bases and reflexivity\nall being published in\n1970\n. We note at this point that he continued this remarkable publication record throughout his life and MathSciNet lists a total of\n275\nitems authored by him. After returning from the United States, Kalton was appointed as a Science Research Council Fellow at the Warwick University in England. He spent the year\n1970\n-\n71\nat Warwick University in Coventry before moving to Swansea in Wales where he was appointed as a lecturer at the University College of Swansea, part of the University of Wales, in\n1971\n. He held this position for eight years and it was in Swansea that his children grew up. Kalton\n[\n9\n]\n:-\n... spent much of his time with his children. \"He was one of those get-on-the-floor-and-roll-around kind of fathers,\" Kalton's daughter, Helen Kurtz, said. \"I remember hanging onto his leg and having him drag me around the house.\"\nAlthough Kalton loved Swansea as a place, he found himself rather isolated there mathematically. This mathematical isolation made him change areas for he felt that his original area of\nBanach space\ntheory was so much the topic of the moment that he would be at a serious disadvantage by not necessarily knowing about the latest advances. He therefore chose to work on non-locally convex spaces since he thought that this was on the sidelines of what people considered a really important area, so was much less likely to see dramatic advances of which he might be unaware. He also found that his salary as a lecturer was hardly enough to pay the monthly bills and he had no access to funds to allow him to travel to conferences. However, he was an invited participant at the meeting on 'Geometry of\nBanach\nspaces' held at the Mathematisches Forschungsinstitut in Oberwolfach in November\n1973\nand he was an invited principal speaker at the  N.A.T.O. Advanced Study meeting on 'Applications of differential games' held at Warwick University in July\n1974\n. The story of how Kalton became an expert on differential games is an interesting one that says much about his character and ability. It is told by Joe Diestel in\n[\n1\n]\n:-\nHe went to Northwestern on sabbatical\n[\nin\n1972]\nto study and work with Alexandra Ionescu-Tulcea\n[\nnow Alexandra Bellow\n]\nwithout checking. As luck would have it, Professor Tulcea was away the term Nigel came. ... Nigel's plans had to be adapted to the situation, so he sat around the lounge talking to various mathematicians and came to the belief that his most enjoyable mathematical conversations were with Professors Elliot and Friedman; hence he worked with them for a term. The end result: a Memoir of the\nAmerican Mathematical Society\nand a half dozen papers. Not bad work for a novice.\nThe\nMemoir\nof the\nAmerican Mathematical Society\nwas\nThe existence of value in differential games\n(1972)\nwritten jointly with Robert Elliot. In it they are primarily concerned with existence theorems. James Howard Case writes:-\nThe authors were first to prove a theorem asserting the existence of value in games wherein the so-called \"Isaacs condition\" is not satisfied.\nKalton managed to arrange a visit to the United States in\n1977\nand was a Visiting Associate Professor at the University of Illinois, Urbana at the invitation of N Tenney Peck\n(1937\n-\n1996)\n. He was a Visiting Associate Professor at Michigan State University, East Lansing in\n1978\nwhere he worked with Joel Harold Shapiro who was an associate professor there at the time. While in the United States, Kalton was an invited speaker at the special session on 'Geometry of\nBanach\nspaces' at the\nAmerican Mathematical Society\nregional meeting held at Ohio State University, Columbus, Ohio in April\n1978\n.\nSeveral universities in the United States were interested in offering Kalton a position but the first to do so was Dennis Sentilles from the University of Missouri-Columbia. Kalton said\n[\n7\n]\n:-\nI jumped at the chance of a job at\n[\nMissouri-Columbia\n]\nbecause the conditions were so much better and allowed me to pursue my research without impediment.\nHe described the contrast between Swansea and Missouri-Columbia in\n[\n8\n]\n:-\nWith\n28\nor\n29\nfaculty at the time, the department was splintered into many ill-defined research groups. Sustaining a seminar was difficult since there were so few persons per area. The first year I was\n[\nat Missouri-Columbia\n]\n, I had the only NSF grant. ... The contrast with Swansea was that there things were more static. Here change is possible. The States are more dynamic. There is turn-over. Things do not stay the same, and one has the optimism that a less-than-desirable situation can be altered.\nKalton remained at the University of Missouri-Columbia for the rest of his career being named  Luther M Defoe Professor of Mathematics in\n1984\n, Mahala and Rose Houchins Professor of Mathematics in\n1985\nand  Curators Professor in\n1995\n.  His remarkable mathematical abilities are described by Peter Casazza in\n[\n1\n]\n:-\nNigel Kalton was at the very top of his field in productivity, creativity, depth and breadth of knowledge, as well as research support, invited addresses, citations, and the view of his peers. There are a number of fundamental results in mathematics that carry his name, including Kalton spaces, Kalton operators, and much more. Nigel was very broad in his research, proving fundamental results in a dozen different areas of research. ... People from our department would come into his office and ask for help with their research, even in areas in which Nigel had never worked. He would tell them to put the definitions and the problem on the board. Invariably, in a few days he would have a solution for them. One time Jerry Lange of our department came to Nigel with a problem in\ncontinued fractions\nhe had been working on for fifteen years. Nigel solved it in forty-eight hours, and later this solution was used to answer a problem of\nRamanujan\n. Another time,\nGilles Pisier\ngave a talk on an approach by Le Merdy to an open problem due to the Russian mathematician Vladimir Peller. Kalton was in the audience and quickly resolved the problem in a joint publication with Le Merdy in\n2002\n. ... We used to call Kalton the bulldozer, since given just one new idea, he could plow his way through an entire field in a matter of weeks to solve a famous problem. He was a towering figure in mathematics but maintained a humble attitude towards others. He was always ready to help anyone who wanted to learn mathematics. He was a man of complete honesty in an area which was not always known for its honesty. He was a man of integrity in an area not always known for its integrity. He was a man of courage who spoke up against injustice when others were afraid to speak up.\nWe mentioned above Kalton's\n1972\nbook on differential games. Other books he published were\n(\nwith James W Roberts\n)\nAn F-space sampler\n(1984)\n, and\n(\nwith Fernando Albiac\n)\nTopics in Banach space theory\n(2006)\n. Reviewing the first of these Klaus-Dieter Bierstedt writes:-\n... in general, the authors succeed very well in their aim to \"present some aspects of the theory of F-spaces which we hope the reader will find attractive\". Indeed, they demonstrate that \"with the aid of fresh techniques one can develop a rich and fulfilling theory\". The book is reasonably self-contained, a good source for research mathematicians and graduate students in functional analysis and a welcome addition to the literature.\nReviewing the\n2006\ntext, Gilles Godefroy writes:-\nThe authors of the book under review succeeded admirably in creating a very helpful text, which contains essential topics with optimal proofs, while being reader friendly. ... strongly recommend to every graduate student who wants to get acquainted with this exciting part of\nfunctional analysis\nthe instructive and pleasant reading of this book, which is also designed as the basis for a two-semester graduate course.\nKalton was awarded a number of prizes for his outstanding work, the most prestigious of which was the\nBanach\nmedal of the\nPolish Academy of Sciences\nwhich he was awarded in\n2004\n. He was the fourth recipient of this award which was given for his remarkable contributions to\nBanach\nspaces. The University of Missouri-Columbia honoured him with their Chancellor's Award for Outstanding Research in the Physical and Mathematical Sciences\n(1984)\n, their Weldon Springs Presidential Award for Research and Creativity\n(1987)\n, their Gold Chalk Award for outstanding mentorship and contributions to graduate education\n(1996)\n, and the Faculty-Alumni Award\n(2005)\n. He was also honoured by having the conference '\nBanach\nSpaces and their Applications in Analysis' organised at the University of Miami in May\n2006\nto celebrate his\n60\nth\nbirthday. The Preface to the conference proceedings\n(\npublished in\n2007)\n, begins as follows:-\nStefan Banach\nonce said: \"A mathematician is a person who can find analogies between theorems; a better mathematician is one who can see analogies between proofs; and the best mathematician can notice analogies between theories. One can imagine that the ultimate mathematician is one who can see analogies between analogies.\" According to this definition, Nigel Kalton is one of the ultimate mathematicians. In his work, Kalton finds underlying connections between seemingly unrelated areas of mathematics. He has been immensely successful in applying\nBanach\nspace methods to numerous problems in analysis. Thus we honour him on the occasion of his\n60\nth\nbirthday in\n2006\n.\nGilles Godefroy paints a nice picture of Kalton in\n[\n1\n]\n:-\nNigel's mind was constantly in gear, but this did not prevent him from being good company. He was a family man, Jenny's husband for forty-one years and a proud father and grandfather. Sharing time with him was both pleasant and instructive, since besides mathematics he was also a man of culture, with a definite interest in historical matters, and a man of taste who knew how to enjoy good food and good wine ...\nKalton died peacefully at University Hospital after suffering a stroke. After a private family cremation, a celebration of his life was held on Friday,\n1\nOctober\n2006\n, at the Reynolds Alumni Center on the University of Missouri campus.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}