{
  "nome_completo": "Nikolai Egorovich Zhukovsky",
  "nome_curto": "Nikolai Egorovich Zhukovskii",
  "ano_nascimento": "1847",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zhukovsky/",
  "lugar_nascimento": "Orekhovo, Vladimir gubernia, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Nikolai Egorovich Zhukovskii\n(\nor\nZhukovsky\nor\nJoukowski\n)\nwas the son of Egor Zhukovskii who was a communications engineer. Nikolai Egorovich attended the Fourth\nGymnasium\nfor Men in Moscow, completing his secondary education there in\n1864\n. He then entered the Faculty of Physics and Mathematics at Moscow University where he studied applied mathematics. He graduated in\n1868\nand from\n1870\nhe taught at the Second Gymnasium for Women in Moscow.\nAfter two years teaching at the Gymnasium, Zhukovskii received an invitation to teach mathematics at Moscow Technical School then, from\n1874\n, he also taught theoretical mechanics there. While he was teaching these courses, Zhukovskii was also studying for his Master's Degree and in\n1876\nhe was awarded this degree for a thesis on the kinematics of a liquid. It is worth pointing out that the Russian Master's Degree is essentially the equivalent of a British/American Ph.D. today while the Russian doctorate at this time was essentially the equivalent of the German\nHabilitation\n. After being awarded his Master's Degree, a special chair of mechanics was created for Zhukovskii at Moscow Technical School.\nZhukovskii obtained a doctorate from Moscow University in\n1882\nfor a dissertation on the stability of motion. He worked at the university, becoming the Head of the Department of Mechanics in\n1886\n. By this time he had begun to receive awards for his outstanding work, having been awarded the\nN D Brashman\nprize for theoretical work in fluid dynamics in\n1885\n.\nOver his career Zhukovskii had a remarkable publications record producing over\n200\npublications on mechanics. In\n1886\nhe wrote a\n[\n13\n]\n:-\n... memoir dealing with the motion of bodies filled with a homogeneous incompressible fluid. ... the advantages of Zhukovskii's geometrical and sound mechanical approach to the problem,\n[\nmeans that\n]\nhis memoir still remains quite up to date.\nPerhaps Zhukovskii is most famous, however, as the founder of the Russian schools of hydromechanics and aeromechanics. For his work in these areas he became known as the\nFather of Russian Aviation\n. Zhukovskii\n[\n1\n]\n:-\n... became interested in the late\n1880\ns in flight in heavier-than-air machines, a basic problem of which was lift.\nDuring\n1890\n-\n91\nhe experimented with disks placed in currents of air and, in\n1891\n, he began to study the dynamics of flight. In\n1895\nhe visited Lilienthal in Berlin. Lilienthal was selling gliders produced in his factory in Berlin. Zhukovskii\n[\n2\n]\n:-\n... observed several of Lilienthal's flights and was most impressed. After returning to Moscow, he spoke before the Society of Friends of the Natural Sciences: \"The most important invention of recent years in the area of aviation is the flying machine of the German engineer Otto Lilienthal.\nZhukovskii purchased one of the eight gliders which Lilienthal sold to members of the public. In\n1906\nZhukovskii published two papers in which he gave a mathematical expression for the lift on an airfoil. Today it is known as the\nKutta\n-Joukowski theorem, since\nKutta\npointed out that the equation also appears in his\n1902\ndissertation.\nIn\n1911\nZhukovskii wrote:-\nThe field of hydrodynamic phenomena which can be explored with exact analysis is more and more increasing.\nZhukovskii was concerned both with theoretical and with experimental aspects of the subject. His theoretical work concentrated on lift, high-speed aerodynamics, vortex theory, longitudinal and cross stability but he complemented this work with appropriate experimental observations in every case. With this twin approach he became the Russian pioneer on both aspects of aviation. He went on to establish an aerodynamics laboratory and to teach courses on his theories of aerodynamics\n[\n1\n]\n:-\nHis lectures at the Moscow Technical School on the theoretical basis of aeronautics\n(1911\n-\n12)\nwere the world's first systematic course in aviation theory and were based largely on his own theoretical research and on experiments conducted in laboratories that he had established.\nIn mathematics today the\nconformal mapping\nof the complex plane\nz\n↦\nz\n+\n1\nz\nz \\mapsto  z + \\Large\\frac{1}{z}\\normalsize\nz\n↦\nz\n+\nz\n1\n​\nis called the Joukowski transformation. This gave Zhukovskii\n[\n2\n]\n:-\n... a means of designing aerofoils using conformal mappings and the techniques of complex variables. Those Joukowski aerofoils were actually used on some aircraft, and today these techniques provide a mathematically rigorous reference solution to which modern approaches to aerofoil design can be compared for validation.\nSee\nTHIS LINK\nfor more about the aerofoils.\nDuring World War I Zhukovskii taught a special course for pilots and he was the first person in Russia to study the theory of bombing from aeroplanes in\n1915\n.\nIn\n1918\nhe organised the Central Aerohydrodynamic Institute and became its first head. The Institute was renamed the N E Zhukovskii Academy of Military and Aeronautical Engineering in\n1922\nfollowing Zhukovskii's death.\nZhukovsky also worked on hydrodynamics and hydraulics, in particular shock waves in water pipes. In particular he solved problems concerning the bursting of pipes with his studies of hydraulic shock. Other problems he considered were the formation of river beds and the construction of dams, where again his expertise was invaluable in constructing power stations.\nZhukovskii's works were published in\n25\nvolumes from\n1935\nto\n1950\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}