{
  "nome_completo": "Nikolai Grigor'evich Chudakov",
  "nome_curto": "Nikolai Grigor'evich Chudakov",
  "ano_nascimento": "1904",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chudakov/",
  "lugar_nascimento": "Lysovsk, Novo-Burassk, Saratov, Russia",
  "lugar_morte": "Saratov, Russia",
  "biografia": "Nikolai Grigor'evich Chudakov\n's father worked as a medical assistant in the village of Lysovsk in western Russia. Nikolai showed great interest in mathematics while at school and, after completing his school education, he entered the Physics and Mathematics Faculty of the relatively new Saratov University. This university had been was founded in\n1909\nand the level of the mathematics he studied there was not at the cutting edge of research. He soon decided that he had better move to Moscow for his education and he transferred to Moscow University from where he graduated in\n1927\n.\nFrom\n1927\nto\n1930\nChudakov undertook postgraduate studies at Moscow State University, then, in\n1930\n, he returned to Saratov University where he was appointed as Head of the Department of Higher Mathematics. During the following years he worked towards his D.Sc. degree in the Mathematical and Physical Sciences which was awarded by the\nSteklov\nMathematical Institute in\n1936\n. After the award of his D.Sc., Chudakov returned to the University of Moscow where he worked until\n1940\n. In that year he returned once again to Saratov University, this time to become Head of the Department of Algebra and Number Theory which had just been set up. He held this post until his death but he spent ten years, from\n1962\nto\n1972\n, working in Leningrad in the Mathematical Institute of the Academy of Sciences there, at the invitation of\nLinnik\n.\nChudakov established a number of important results in number theory. He gave an estimate for the bounds of the zeta-function in the critical strip using techniques which had been introduced a few years earlier by\nVinogradov\n. As a consequence of this work he was able to give a substantially improved remainder term in the asymptotic formula for the number of primes less than a fixed number\nN\nN\nN\n. Also, by these method, he improved the estimate for the difference between two consecutive primes. In his later work he extended these results to apply to arbitrary arithmetic progressions. In\n1947\nChudakov published\nOn Goldbach-Vinogradov's theorem\nin the\nAnnals of Mathematics\n. In this paper he proves\nVinogradov\n's theorem that every large odd integer is representable as a sum of three odd primes. The proof is similar to one which\nLinnik\ngave.\nIn\n1742\n, in a letter to\nEuler\n,\nGoldbach\nmade what has come to be called the\nGoldbach conjecture\nthat every even integer greater than\n2\ncan be represented as the sum of two primes. This problem has, from that time on, been one of the major unsolved problems of number theory. Chudakov made a substantial contribution to the solution when he proved that all, except possibly a finite number, of even integers greater than\n2\ncan be represented as the sum of two primes.\nChudakov is also famed as the author of the classic monograph\nIntroduction to the theory of Dirichlet L-functions\n(1947)\nwhich was widely used by number theory experts. The text assumes only that the reader is familiar with the elements of number theory and complex variable theory, and goes on to develop the theory of characters and\nDirichlet\nL\nL\nL\n-functions. It studies the zeros of\nL\nL\nL\n-functions, primes in arithmetic progressions and, as its high point, proves the three-prime theorem of\nGoldbach\nand\nVinogradov\n.\nIn\n[\n1\n]\nthe authors sum up Chudakov's contributions to teaching:-\nDuring his many years of academic and pedagogical work at Saratov University, Chudakov introduced more than one generation of mathematicians to research work in number theory and algebra. His lecture courses were always interesting and introduced his students to real problems in science. His wide erudition and deep intuition was invaluable to workers under his supervision and to undergraduate and postgraduate students. He never refused the smallest request, he was able to spend hours acquainting staff with important trends and problems, and give his opinion n perspectives in the development of one or other of them, but postgraduate students had the possibility of choosing and solving their own problems independently, using their supervisor's help only in difficult parts when required.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}