{
  "nome_completo": "Nikolai Nikolaevich Luzin",
  "nome_curto": "Nikolai Luzin",
  "ano_nascimento": "1883",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Luzin/",
  "lugar_nascimento": "Irkutsk, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Nikolai Nikolaevich Luzin\nwas born in Irkutsk, and his birthplace was not, as is incorrectly stated in a number of sources, Tomsk. Nikolai's father was a businessman, half Russian and half Buryat. Nikolai was the only son of his parents and the family moved to Tomsk when he was about eleven years old so that he could attend the\nGymnasium\nthere.\nOne might expect that Nikolai would have shown a special talent for mathematics at the Gymnasium, but this was far from the case\n(\n[\n15\n]\nand\n[\n16\n]\n)\n:-\nThis was because the system of instruction ... was based on mechanical memory: it was required to learn the theorems by heart and to reproduce their proofs exactly. For Luzin this was torture. His progress in mathematics at the Gymnasium became worse and worse, so that his father was obliged to engage a tutor ...\nFortunately the tutor was a talented young man who quickly discovered that, despite Luzin's poor performance in mathematics, he could solve hard problems but often using a novel method that the tutor had never seen before. Soon the tutor had shown Luzin that mathematics was not a subject where one had to learn long lists of facts, but a topic where creativity and imagination played a major role.\nIn\n1901\nLuzin left the Gymnasium and at this time his father sold his business and the family moved to Moscow. There Luzin entered the Faculty of Physics and Mathematics at Moscow University intending to train to become an engineer. At first Luzin lived in the new family home in Moscow, but Luzin's father began to gamble on the stock exchange with the money he had made from the sale of his business. The family soon hit hard times as Luzin's father lost all their savings and the family had to leave their home. Luzin, together with a friend, moved into a room owned by the widow of a doctor. His friend soon became involved with the Revolution and was forced into hiding. Luzin stayed on by himself in the room but he clearly got on well with the owners since he later, in\n1908\n, married the widow's daughter.\nAt Moscow University Luzin studied under\nBugaev\n, learning from him the theory of functions which was to influence greatly the direction his research would eventually take. However he was only an average student who seemed to show little flair for mathematics. However, although Luzin appeared to lack talent in mathematics, one of his teachers\nEgorov\nspotted his great talent, invited him to his home, and began to set him hard problems.\nThere was a mathematics student at the university, Pavel Florensky, who experienced a crisis after graduating and turned to religion and the study of theology. This had a major effect on Luzin, who was a close friend of Florensky, as we shall describe below.\nAfter graduating in the autumn of\n1905\nLuzin seemed unsure whether to devote himself to mathematics. In fact Luzin's crisis had hit him in the spring of\n1905\nand, on\n1\nMay\n1906\n, Luzin wrote to Florensky from Paris where\nEgorov\nhad sent him five months earlier in an attempt to get him through the crisis\n(\nsee\n[\n9\n]\n)\n:-\nYou found me a mere child at the University, knowing nothing. I don't know how it happened, but I cannot be satisfied any more with analytic functions and\nTaylor\nseries ... it happened about a year ago. ... To see the misery of people, to see the torment of life, to wend my way home from a mathematical meeting ... where, shivering in the cold, some women stand waiting in vain for dinner purchased with horror - this is an unbearable sight. It is unbearable, having seen this, to calmly study\n(\nin fact to enjoy\n)\nscience. After that I could not study only mathematics, and I wanted to transfer to the medical school. ... I have been here about five months, but have only recently begun to study.\nLuzin was not only upset by seeing the prostitutes, he also says in the letter how he had been affected by the 'terrible days' of the\n1905\nRevolution. There are letters from\nEgorov\nat this time pleading with Luzin not to give up mathematics. After returning to Russia, Luzin studied medicine and theology as well as mathematics. However in April\n1908\nhe wrote of the joy he was finding in\nnumber theory\n(\nsee\n[\n9\n]\n)\n:-\nIt is a mysterious area that envelops me deeper and deeper.\nIn the same letter he says that he has just married and:-\n... my wife is also very interested and shares my commitment to the search for the profound truths of life.\nLargely Luzin's crisis seems to have been solved by Florensky to whom Luzin wrote in July\n1908\n:-\nTwo times I was very close to suicide - then I came ... looking to talk with you, and both times I felt as if I had leaned on a pillar and with this feeling of support I returned home ... I owe my interest in life to you...\nHis interest in mathematics slowly returned but it was not until\n1909\nthat Luzin seems to have finally committed himself completely to mathematics. Under\nEgorov\n's supervision he worked on his master's thesis. In\n1910\nhe was appointed as assistant lecturer in Pure Mathematics at Moscow University. He worked for a year with\nEgorov\nand they went on to publish joint papers on function theory which mark the beginnings of the Moscow school of function theory.\nIn\n1910\nLuzin travelled abroad visiting Göttingen where he was influenced by\nEdmund Landau\n. He returned to Moscow in\n1914\nand he completed his thesis\nThe integral and trigonometric series\nwhich he submitted in\n1915\n. After his oral examination he was awarded a doctorate, despite having submitted his thesis for the Master's Degree.\nEgorov\nwas extraordinarily impressed by the work and had pressed for the award of the doctorate, but it was written in a style quite different from the accepted Russian style of the time. Some of the results were not rigorously proved but were justified using phrases such as 'it seems to me' and 'I am convinced'. Other mathematicians were not so impressed at the time, for example\nSteklov\nwrote comments in the margin such as 'it seems to him, but it doesn't seem to me' and 'Göttingen chatter'.\nHowever, the work was of fundamental importance as is stated in\n[\n15\n]\nand\n[\n16\n]\n:-\nThe influence of Luzin's dissertation on the future development of the theory of functions cannot be overestimated. Its fundamental results, deep methods of investigation and fundamental statements of problems put it into the ranks of works with which it is difficult to compare any dissertation or monograph of the time.\nIn\n1914\nLuzin and his wife separated for a short time and again Florensky seems to have helped them through the difficult time. He wrote to Luzin's wife\n(\nsee\n[\n9\n]\n)\n:-\nNikolai Nikolaevich is a very sweet and fine person; but in personal relationships he is not at all mature, especially in intuitively perceiving the hidden currents of life. ... You will have to take the relationship in hand and create a family tone, simplicity. Instead, as I perceive it ... you have established the tone of an acquaintanceship rather than a family.\nFlorensky seems to have given good advice since Luzin and his wife returned to a successful marriage.\nIn\n1917\nLuzin was appointed as Professor of Pure Mathematics at Moscow University just before the Revolution. The Revolution caused Luzin to rethink some of the same thoughts as he had done at the time of his crisis and again he exchanged letters with Florensky. By this stage, however, his mathematical career was extremely successful and the second crisis did not materialise.\nOver the next ten years Luzin and\nEgorov\nbuilt up an impressive research group at the University of Moscow which the students called 'Luzitania'. The first students included\nP S Aleksandrov\n,\nM Ya Suslin\n,\nD E Menshov\nand\nA Ya Khinchin\n. The next students included\nP S Urysohn\n,\nA N Kolmogorov\n,\nN K Bari\n, L A Lusternik and\nN G Shnirelman\n. In\n1923\nP S Novikov\nand\nL V Keldysh\njoined the group.\nAnother of the members of the Luzitania research group at this time was\nLavrent'ev\n. In fact\nLavrent'ev\ndraws the following picture of the group:-\nWhereas\nEgorov\nwas reserved and formal, Luzin was extroverted and theatrical, inspiring real devotion among these students and young colleagues. ... There was intense camaraderie ... inspired by Luzin.\nLuzin's main contributions are in the area of foundations of mathematics and\nmeasure theory\n. He also made significant contributions to descriptive set\ntopology\n. In the theory of boundary properties of analytic functions he proved an important result in\n1919\non the invariance of sets of boundary points under\nconformal mappings\n. He also studied, together with\nPrivalov\n, boundary uniqueness properties of analytic functions.\nFrom\n1917\nonwards, Luzin studied descriptive set theory. He stated the fundamental problem\n(\n[\n15\n]\nand\n[\n16\n]\n)\n:-\nThe aim of set theory is a question of great importance: can we regard a line atomistically as a set of points: incidentally this question is not new, but goes back to the Greeks.\nMuch of Luzin's work on set theory involved the study of effective sets, that is sets which can be constructed without the\naxiom of choice\n.\nKeldysh\ndescribes this work in\n[\n12\n]\nand\n[\n13\n]\n:-\n... Luzin proceeded from the point of view of the French school\n(\nBorel\n,\nLebesgue\n)\n, which greatly influenced him. But whereas the French had analysed set-theoretical constructions carried out with the help of the Axiom of Choice, Luzin went considerably further and considered difficulties arising within the theory of effective sets. The study of effective sets that he embarked upon was pursued intensively for more than two decades and led to the solution of many important problems of set theory ...\nLuzin's school was at its peak during the years\n1922\nto\n1926\n, but then Luzin concentrated on writing his second monograph on the theory of functions and spent less time with the young mathematicians in the school. Many of these mathematicians turned to other topics such as topology,\ndifferential equations\n, and functions of a complex variable.\nIn\n1927\nLuzin was elected as a member of the\nUSSR Academy of Sciences\n. Two years later he became a full member of first the Department of Philosophy, then to the Department of Pure Mathematics. He worked from this time until his death in the\nUSSR Academy of Sciences\n. From\n1935\nhe headed the Department of the Theory of Functions of Real Variables at the\nSteklov\nInstitute.\nIn\n1931\nLuzin himself turned to a new area when he began to study differential equations and their application to geometry and to\ncontrol theory\n. His work in this area led him to study the bending of surfaces which is described in\n[\n15\n]\nand\n[\n16\n]\n:-\nThe bending of a surface on a principal base is a continuous bending of a surface under which the conjugacy of the net of certain curves on the surface is preserved. ... Finikov had derived differential equations that determine all principal on a given surface, and Byushgens had obtained differential equations that determine surfaces which have a given linear element and admit a bending on a principal base. However, the question of solubility of these equations, in general, remained unclear. ... no example was found in which the equations ... were insoluble ... up to\n1938\n, when Luzin, by means of a subtle analysis of these equations, established that the existence of a principal base is rather rare.\nIt has been drawn to our attention by\n[\n19\n]\n, that in\n1936\n, Luzin was the victim of a violent political campaign organized by the Soviet authorities through the newspaper\nPravda\n. He was accused of anti-Soviet propaganda and sabotage by publishing all his important results abroad and only minor papers in Soviet journals. The aim was obviously to get rid of Luzin as a representative of the old pre-Soviet mathematical school of Moscow: his master,\nEgorov\n, had been himself the victim of such a campaign in\n1930\n(\nbased on his religious sympathies\n)\nand died shortly after in\n1931\nin despair and misery. A contemporary record of the \"Luzin affair\" has been miraculously preserved and recently edited in Moscow by Demidov and Levchin\n[\n3\n]\n,\n[\n23\n]\n. It shows that Luzin had had a narrow escape from a tragic fate as the Soviet authorities may have feared the international consequences of a too strong attack on a scientist so famous abroad. The main visible consequence of the Luzin affair was that, from this precise moment, Soviet mathematicians began to publish almost exclusively in Soviet journals and in Russian.\nLuzin always had an interest in the history of mathematics and late in his career he wrote important articles on\nNewton\nand on\nEuler\n.\nAs a teacher his remarkable talents are described by Kuznetsov\n(\n[\n15\n]\nor\n[\n16\n]\n)\n:-\nHis presentation was always very elegant and at first sight apparently unnecessarily simple - the result of his great pedagogic talent. The solution of the large problems that he undertook is distinguished by their subtlety, elegance, and simplicity of presentation.\nKeldysh and\nNovikov\nwrote in\n[\n14\n]\n:-\nThanks to his exceptional intuition and his ability to see deeply into the heart of a question, Luzin frequently predicted mathematical facts whose proof turned out to be possible only after many years and required the creation of completely new mathematical methods. He was one of the outstanding mathematicians and thinkers of our time ...",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}