{
  "nome_completo": "Noel Bryan Slater",
  "nome_curto": "Noel Slater",
  "ano_nascimento": "1912",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slater/",
  "lugar_nascimento": "Blackburn, Lancashire, England",
  "lugar_morte": "Hull, England",
  "biografia": "Noel Slater\n's parents were Doctor Albert Slater and Minnie Jane Bryan. The unsuspecting reader would be forgiven for believing that Albert Slater was either a doctor of medicine or had a Ph.D. In fact neither was the case, for he was given the first name of Doctor by his parents since he was the seventh son of a seventh son\n(\nand so by a Lancashire ancient superstition was believed to have magical powers\n)\n. Not surprisingly, Albert Slater was somewhat embarrassed by this and used the name D Albert Slater. He taught music and was a Fellow of the Royal College of Organists. His son Noel inherited his father's musical talent and became an extraordinarily talented pianist.\nSlater was brought up in Blackburn where, after attending elementary school, he attended Blackburn Grammar School. However, in the middle of his high-school education his family moved to Fordyce, a village in Banffshire to the west of Banff in Scotland. There he completed his secondary education at Fordyce Academy, a small school in the village, about\n3\nkm from the coast. He graduated from the Academy in\n1929\nand began his university studies at the University of Edinburgh\n[\n1\n]\n:-\nHe clearly benefited by and often commented with satisfaction upon the breadth of his Edinburgh studies, and these were attended by marked success; he was elected both Arnott Scholar in Experimental Physics, and Maclaren and Ferguson Scholar in Mathematics, and he was a medallist in Mathematics and Natural Philosophy.\nAs many students who attended Scottish universities had done over a long period, after completing his first degree in Scotland in\n1933\nhe went to Cambridge to study the mathematical tripos. He matriculated at Gonville and Caius College having won a\nGeorge Green\nScholarship. He performed well in his undergraduate studies being a\nWrangler\n(\nFirst Class student\n)\nand winning the Mayhew Prize. He continued to study at Cambridge, undertaking research for his doctorate supervised by\nRalph Fowler\n. He was awarded his doctorate in\n1941\nfor his dissertation\nA Theory Of The Rates Of Unimolecular Reactions In Gases\n.\nIn fact although he did not obtain his doctorate until\n1941\n, Slater had been appointed as an Observer at the Solar Physics Observatory in Cambridge in\n1939\n. Of course the outbreak of World War II in September\n1939\nmeant that his career had to be essentially put on hold while he contributed to the war effort. He joined a team of mathematicians and physicists developing rocket technology and the leader of the team praised Slater's\n[\n1\n]\n:-\n... combination of mathematical expertise and physical insight, ... the meticulous patience and persistence shown in his work, and ... his choice of problems which showed a bold and adventurous mind ...\nHe spent these war years in Wales and entered fully into the local life\n[\n1\n]\n:-\nHe led bathing expeditions to almost inaccessible pools on the rugged Pembrokeshire coast\n(\none of these could only be reached by descending the cliff-face on a chain, no doubt long since rusted away\n)\n; he played an active role in a Christian study group sparked off by the publication of\n[\nC S Lewis's\n]\n'The Screwtape Letters'; most importantly he won the hearts of many of the inhabitants of a small Welsh borough by entering to the full into their musical life, and is still warmly remembered there for his playing of the piano accompaniment in an amateur performance of Handel's 'Messiah'. ... He once got into trouble at a Welsh pub because he insisted on playing his kind of music, which was not the kind the hearty drinkers at the bar wanted to hear. He refused to stop, and was asked not to come again.\nAfter the War ended in\n1945\n, Slater took up his career again when he was appointed as a Lecturer in Applied Mathematics at the University of Leeds. He spent sixteen years at Leeds where he was promoted first to Senior Lecturer and then to Reader. In\n1961\nhe moved to Hull when he was appointed to the Chair of Mathematics at the University of Hull. This meant that he was the Chainman of the Department of Mathematics at Hull, a position he retained until his early death in\n1973\nat the age of sixty years.\nSlater continued to develop the work he undertook for his doctorate which led him to study a mathematical model for chemical reactions for many years. He wrote papers on this topic such as:\n(\nwith\nR H Fowler\n)\nCollision numbers in solutions\n(1938)\n,\nThe rates of unimolecular reactions in gases\n(1939)\n,\nAspects of a theory of unimolecular reaction rates\n(1948)\n, and\nGaseous unimolecular reactions: theory of the effects of pressure and of vibrational degeneracy\n(1953)\n. If this makes him look more like a chemist than a mathematician then others realised this too for when he was a visiting professor at Cornell he was Professor of Chemistry.\nDavid Kendall\nwrites\n[\n1\n]\n:-\nThis work was carried out by Slater almost single-handedly over a number of years. It represented a new outlook on certain types of chemical reaction; it fell short of reality because, although the model was on the right lines, it involved neglecting certain features that are important.\nSlater summarised his finding in this area in the monograph\nTheory of unimolecular reactions\nwhich was published in\n1959\n. In fact Slater's work in this area had interesting connections\n[\n1\n]\n:-\nWhen\nMark Kac\nfirst went from Poland to the United States he was interested, as a\n(\nthen\n)\npure mathematician, in some problems related to the theory of almost-periodic functions, and one such was the distribution of the values of a superposition of vibrations with linearly independent frequencies. This is obviously closely linked to Slater's problem, but in fact it arose in an astronomical context, namely the \"mean motion problem\" of celestial mechanics. In\n1943\nKac\npublished two papers giving a formula for the frequency\n(\nin the probability sense\n)\nwith which such a superposition of vibrations with linearly independent frequencies would cross a prescribed level \"from below\". To his surprise and pleasure he received a letter from Slater telling him that his formula, which\nKac\nthought was \"entirely useless\", had opened the door to a new attack on an important chemical problem. This was the commencement of a long friendship.\nOther papers by Slater were of a statistical nature such as\nThe distribution of the integers N for which\n{\nθ\nN\n}\n<\nϕ\n\\{\\theta N\\} < \\phi\n{\nθ\nN\n}\n<\nϕ\n(1950)\nand\n(\nwith T C T Kotiah\n)\nThe steady state of multi-server mixed queue\n(1973)\n. R P Milch writes in a review of the second of these papers:-\nSteady state results are presented for a multi-server queueing system with several types of customers. Each customer type has its own\nPoisson\narrival rate and exponential service rate not dependent on the particular desk\n(\nserver\n)\nproviding the service. First, formulas for the mean desk occupation and the mean number waiting are presented, valid for general service time distributions. A general technique based on probability generating functions and an associated eigenvalue problem is outlined to determine all state probabilities of less than\nN\nN\nN\n(\nthe number of desks in the system\n)\ncustomers. From that all probabilities of more than\nN\nN\nN\ncustomers may be shown to be the sum of geometric probabilities. The case of two desks is treated in detail.\nAlso in\n1973\n, in another joint work with T C T Kotiah, Slater published\nOn two-server Poisson queues with two types of customers\n. Other mathematical papers by Slater include\nSome formulae of P Stein and others concerning trigonometrical sum\ns\n(1954)\nand\nGeneral forms of Nielsen's Bessel-function identity\n(1962)\n.\nIt remains for us to comment on one remaining, but important, aspect of Slater's contributions. This is his book\nThe development and meaning of Eddington's 'Fundamental Theory'\nwhich was published by Cambridge University Press in\n1957\n. When\nEddington\ndied in\n1944\nhis\nFundamental Theory\nwas still unpublished.\nEdmund Whittaker\ndid the necessary editorial work to see Eddington's\nFundamental Theory\npublished in\n1946\n. However, there were five or six different manuscript versions of the book left by\nEddington\nand it was totally unclear whether\nWhittaker\nhad published the latest draft of the text\n[\n1\n]\n:-\nSlater realised the importance of urgent action, and took steps to ensure that a veritable mountain of manuscript in\nEddington\n's study should not be disturbed or so much as dusted until he had had time to go to Cambridge and sort it. When he got there he found odd bundles of sheets from numerous different drafts heaped up in a towering pile, sometimes one way up and sometimes the other, and with little to indicate their interrelationship. After the war Slater devoted himself to the separation of these into variant versions of sections of the book, representing different and competing strands in\nEddington\n's thought, and finally, in his own book\n[\nThe development and meaning of\nEddington\n's 'Fundamental Theory'\n]\n, Slater published a sort of variorum edition modelled quite consciously on the similar activities of New Testament scholars. No one was sure about the scientific status of 'Fundamental Theory' at that time, and one is even less sure now. What is important in the long term about Slater's own achievement is that it provides us with an authentic snapshot of the competing concepts simultaneously present and wrestling for expression in the mind of a great creative genius.\nSlater explained in the Preface that:-\nMany have tried to read\n[\nEddington\n's\n]\nbook; but all have found it difficult.\nHe explained that he had used all six manuscripts by\nEddington\nand reproduced in his book:-\n... all passages which\n(\na\n)\ncontribute materially to the understanding of the final version or\n(\nb\n)\ncontain developments which were later discarded but are of intrinsic interest.\nIn fact a detailed study of the scientific status of\nEddington\n's theory has now been made by Ian T Durham in his University of St Andrews doctoral thesis.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Number Theory",
    "Statistics"
  ]
}