{
  "nome_completo": "Norman Macleod Ferrers",
  "nome_curto": "Norman Ferrers",
  "ano_nascimento": "1829",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferrers/",
  "lugar_nascimento": "Prinknash Park, Upton St Leonards, Gloucestershire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Norman Ferrers\n' parents were Lavinia Macleod  and Thomas Bromfield Ferrers. Thomas Ferrers was a stockbroker who came from London, his wife Lavinia being from Harris, part of the Hebrides islands off the west coast of Scotland. Norman was his parents' only child. The family was well off and Norman had a privileged education attending Eton College from\n1844\nto\n1846\n, then finishing his pre-university education by spending a year living in the home of the mathematician Harvey Goodwin, vicar of St Edward's, Cambridge, who gave him private coaching.\nFerrers entered Gonville and Caius College, Cambridge, on\n6\nMarch\n1847\nand, over the next four years, studied the Mathematical Tripos. He was an outstanding student and was Senior\nWrangler\nin\n1851\n(\nmeaning that he was ranked first in the list of those being awarded First Class degrees\n)\n. He was also the first Smith's prizeman in\n1851\nand, in the following year, was elected a fellow of Gonville and Caius College. However, as\nCayley\nhad done a few years earlier, Ferrers went to London to study law and was called to the bar in\n1855\n. Unlike Cayley he did not practice law but returned to Cambridge were he studied for the priesthood. He was ordained deacon in\n1859\nand priest in\n1860\n.\nNow although Ferrers was studying for the priesthood, soon after he returned to Cambridge he was offered the post of lecturer in mathematics which had resulted from changes in the tutorial staff at Caius College.\nVenn\nwrites that\n[\n3\n]\n:-\n... the Master, Dr Edwin Guest, invited Ferrers, who was by far the best mathematician amongst the fellows, to supply the place. His career was thus determined for the rest of his life. For many years head mathematical lecturer, he was one of the two tutors of the college from\n1865\n. As lecturer he was extremely successful. Besides great natural powers in mathematics, he possessed an unusual capacity for vivid exposition. He was probably the best lecturer, in his subject, in the university of his day.\nFerrers married Emily Lamb, the daughter of the dean of Bristol and master of Corpus Christi College, Cambridge, on\n3\nApril\n1866\n. Norman and Emily Ferrers had four sons and a daughter. McConnell writes in\n[\n2\n]\n:-\nIn his early days Ferrers was a keen university reformer, within the limits of the time. For more than twenty years he was a member of the council of the senate at Cambridge: first elected in\n1865\n, he was dropped the following year because his liberal ideas on admission of nonconformists to fellowships displeased the majority of electors. When the passing of the Test Act closed this controversy he was re-elected in\n1872\n, and served continuously to\n1892\n, when increasing infirmity obliged him to stand down. In the mathematical tripos he acted as moderator or examiner more often, it is believed, than any one else hitherto.\nWhen Dr Edwin Guest resigned as Master of Gonville and Caius College, Ferrers was appointed to succeed him on\n17\nOctober\n1880\n. He served as vice-chancellor of the University of Cambridge in\n1884\n-\n5\n.\nVenn\ndescribes Ferrers' mathematical contributions in\n[\n3\n]\n:-\nIt was as a mathematician that Ferrers acquired fame outside the university. He made many contributions of importance to mathematical literature. His first book was \"Solutions of the Cambridge Senate House Problems,\n1848\n-\n51\n\". In\n1861\nhe published a treatise on \"Trilinear Co-ordinates,\" of which subsequent editions appeared in\n1866\nand\n1876\n. One of his early memoirs was on\nSylvester\n's development of\nPoinsot\n's representation of the motion of a rigid body about a fixed point. The paper was read before the\nRoyal Society\nin\n1869\n, and published in their Transactions. In\n1871\nhe edited at the request of the college the \"Mathematical Writings of George Green\" ... Ferrers's treatise on \"Spherical Harmonics,\" published in\n1877\n, presented many original features. His contributions to the \"Quarterly Journal of Mathematics,\" of which he was an editor from\n1855\nto\n1891\n, were numerous ... They range over such subjects as quadriplanar co-ordinates,\nLagrange\n's equations and hydrodynamics. In\n1881\nhe applied himself to study\nKelvin\n's investigation of the law of distribution of electricity in equilibrium on an uninfluenced spherical bowl. In this he made the important addition of finding the potential at any point of space in zonal harmonics\n(1881)\n.\nReaders who are familiar with the concept of Ferrers graphs will wonder which of these works contains this interesting idea. The answer, rather surprisingly, is that none of them do. Are the 'Ferrers graphs' then misnamed? No - not at all - for indeed the idea was due to Ferrers but we know this through the work of\nSylvester\n. The details we now present are based on the interesting paper\n[\n4\n]\n. In\n1853\nSylvester\npublished\nOn Mr Cayley's impromptu demonstration of the rule for determining at sight the degree of any symmetrical function of the roots of an equation expressed in terms of the coefficients\nin the\nPhilosophical Magazine\n. In this article he wrote:-\nThe number of modes of partitioning\n(\nn\n)\ninto\n(\nm\n)\nparts is equal to the number of modes of partitioning\n(\nn\n)\ninto parts, one of which is always m, and the others\n(\nm\n)\nor less than\n(\nm\n)\n. This proposition was mentioned to me by Mr N M Ferrers, whose demonstration of it ... is so simple and instructive, that I am sure every logician will be delighted to meet with it here or elsewhere.\nSylvester\nadded the note:-\nI learn from Mr Ferrers that this theorem was brought under his cognizance through a Cambridge examination paper set by Mr\nAdams\nof Neptune notability.\nThe problem to which Ferrers refers was set by\nAdams\nand appeared in a paper taken by students on\n7\nJanuary\n1847\n. The problem is as follows:-\nProve that the number of ways in which any number\nx\nx\nx\ncan be composed of\nn\nn\nn\nnumbers\n(\nnot necessarily different from each other\n)\n, is equal to the number of ways in which\nx\nx\nx\ncan be composed of\nn\nn\nn\nand numbers not exceeding\nn\nn\nn\n, the order in which the numbers occur not being considered.\nOne could then ask if Ferrers graphs should be named \"Adams Graphs\". Not at all - Ferrers contribution was the method of solution. Let us explain this method by means of an example. Consider the partition\n15\n=\n6\n+\n4\n+\n3\n+\n2\n.\n* * * * * *\n* * * *\n* * *\n* *\nReflect in the diagonal through the top left corner to get the conjugate partition\n* * * *\n* * * *\n* * *\n* *\n*\n*\nnamely\n15\n=\n4\n+\n4\n+\n3\n+\n2\n+\n1\n+\n1\nWe see that there is a\n1\n-\n1\ncorrespondence between a partition and its conjugate and this\n1\n-\n1\ncorrespondence provides the solution to the problem stated by\nSylvester\n(\nand stated by\nAdams\nin the Tripos paper of\n1847)\n.\nIn\n1882\nSylvester\npublished\nA construction theory of partitions\n. In this work he writes:-\nThe above proof of the theorem of reciprocity is due to Dr Ferrers, the present head of Gonville and Caius College, Cambridge. It possesses the double merit of having set the first example of graphical construction and of putting into salient relief the principle of correspondence, applied to the theory of partitions. It was never made public by its author, but first promulgated by myself in ...\n1853\n.\nFerrers wrote to\nSylvester\nin\n1883\n:-\nMy dear\nSylvester\n,\nI have never myself published the demonstration to which you refer. You were yourself, however, kind enough to give it publicity in\n1853\n. I am glad to hear that the lucky hit which I made more than thirty years ago has given rise to so interesting a theory as you describe ...\nFerrers received several honours, the most notable being election as a fellow of the\nRoyal Society\nin\n1877\n. He was also awarded an honorary LL.D. by the University of Glasgow in\n1883\n. By the time that he wrote to\nSylvester\nin\n1883\n, Ferrers had already been suffering from rheumatoid arthritis for over three years. His health steadily deteriorated and he died in the Gonville and Caius College Lodge.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}