{
  "nome_completo": "Olaus Magnus Friedrich Erdmann Henrici",
  "nome_curto": "Olaus Henrici",
  "ano_nascimento": "1840",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Henrici/",
  "lugar_nascimento": "Meldorf, Holstein (now Germany)",
  "lugar_morte": "Chandler's Ford, Hampshire, England",
  "biografia": "Olaus Henrici\n's father was Theodor Henrici. Olaus entered the\ngymnasium\nat Meldorf in\n1852\nand studied there until\n1856\n. He then worked as an engineering apprentice at Flensburg for three years. While training for this occupation, Henrici's talents were recognised by\nClebsch\nand he entered the Polytechnicum at Karlsruhe in\n1859\nto study mathematics.\nClebsch\npersuaded\nHesse\nto take Henrici on as a Ph.D. student at Heidelberg in\n1862\n. Henrici then went to Berlin and studied under\nWeierstrass\nand\nKronecker\n. After being appointed a\ndozent\nat Kiel University he found it impossible to make sufficient money to live on, so he came to England in\n1865\nwith\n(\nperhaps overoptimistic\n)\nhope that life would be easier. In England he was barely able to make sufficient money to live on by teaching school level mathematics which at least, he later remarked, greatly helped him in becoming a good teacher.\nHesse\nintroduced him to\nSylvester\nwho in turn introduced him to\nHirst\n, at that time the professor of mathematics at University College, London.\nHirst\nhad been appointed to the post to succeed\nDe Morgan\n, but was finding the duties very demanding. Employing Henrici as an assistant seemed like a good way of reducing his workload so that is precisely what\nHirst\ndid.\nIn\n1869\nHenrici was appointed professor of mathematics at Bedford College for Women. Whether the loss of his assistant was a contributory fact to\nHirst\ntaking ill around Easter of\n1870\nis unclear, but being unable to perform his teaching duties he asked Henrici to take over. Wishing more time to undertake research,\nHirst\ndecided to take on a less demanding position and resigned his chair at University College around the summer of\n1870\n. Henrici, who at this stage was doing the teaching anyway, was appointed professor of mathematics at University College. He married Helen Stodart Kennedy, the daughter of a Congregational minister, on\n15\nAugust\n1877\n. Their son, Ernst Olaf Henrici, became a major in the Royal Engineers but was a fine mathematician who collaborated with his father on a paper in\n1912\n.\nIn\n1879\nClifford\n, who had been professor of applied mathematics and mechanics at University College, died, and Henrici was asked to take over his teaching duties. Clearly the duties of the two chairs were too much for one person so in\n1880\nHenrici was formally installed as professor of applied mathematics and mechanics and resigned his chair of mathematics. In\n1884\nhe moved from University College to take up the chair of mechanics and mathematics at the new Central Technical College. This College joined with the Royal College of Science and the Royal School of Mines to become Imperial College of Science and Technology in\n1907\nand then, in the following year, became part of the University of London.\nHenrici made many innovations as a teacher, for example he\n[\n1\n]\n:-\n... introduced projective geometry, vector analysis, and graphical statics into the University College mathematics syllabus - a radical departure from the analytically biased Cambridge-style course previously taught.\nHe also introduced graphical statics into the Bedford College syllabus and at the Central Technical College he set up a mechanics laboratory. He was interested in mathematical instruments and constructed a harmonic analyser along the lines suggested by\nWilliam Thomson\n(\nLord Kelvin\n)\n. This mathematical instrument could compute\nFourier\ncoefficients. Henrici wrote some excellent little books to introduce undergraduates to mathematical ideas such as projective geometry in\nCongruent Figures\n(1878)\n, and vector methods in\nVectors and Rotors\n(1903)\n. This latter work he intended as the introduction to a much large treatise which he never completed. He was also a major contributor to the eleventh edition of\nEncyclopaedia Britannica\n(\npublished in\n1910\nand\n1911)\ncontributing articles on 'calculating machines', 'Euclidean geometry', 'projective geometry', 'projection', 'descriptive geometry', and 'perspective'.\nHenrici was elected a fellow of the\nRoyal Society\nin\n1874\nand was a member of its Council during\n1882\n-\n83\n. In\n1882\n, in addition to serving on the Council of the\nRoyal Society\n, he was elected President of the\nLondon Mathematical Society\n, holding this position from\n1882\nto\n1884\n. He was awarded an honorary degree by the University of St Andrews in\n1884\n. He retired from his chair at Imperial College in\n1911\nand moved to Hampshire.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry"
  ]
}