{
  "nome_completo": "Olli Erkki Lehto",
  "nome_curto": "Olli Lehto",
  "ano_nascimento": "1925",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lehto/",
  "lugar_nascimento": "Helsinki, Finland",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Olli Lehto\nwas educated in Helsinki and, as he grew up, he was pulled in different directions as to the subjects in which he should specialise. He was very fond of geography, and considered this might be the topic for him, but he also had a great passion for butterflies - this was his schoolboy hobby. However, there were other influences on the young boy\n[\n4\n]\n:-\nI also considered going into the field of law. My uncle was a professor at Helsinki University of Technology and tried to lure me into the field of technology, but I knew all along that it wasn't for me. My father had a Master's degree in mathematics. I figured that the field would offer me an enormous range of possibilities after graduation.\nBecause World War II broke out, Lehto never took his matriculation examination and had to sit behind an artillery gun on Finland's eastern border. However, we need to look at some Finnish history in order to understand the events that took place during World War II. Finland had taken the opportunity of declaring its independence in December\n1917\nwhen Russia was occupied with its own internal affairs of the Russian Revolution. Nevertheless, the country continued to see its security threatened by the Soviet Union and, after a failed attempt to create an alliance with Estonia, Latvia, and Poland in the\n1920\ns, Finland signed a non-aggression treaty with the Soviet Union in\n1932\n. At the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack - the Germans from the west and the Russians from the east - quickly defeated the Polish army. The Soviet Union clearly did not trust their German allies, for they demanded territory from Finland to improve the security of Leningrad. When the Finns refused, the Soviet Union attacked Finland on\n30\nNovember\n1939\n. The Finns put up a remarkably good defence against their massive neighbour but, after initial Finnish victories, they were forced to sign the Treaty of Moscow in March\n1940\nwhich leased large parts of south east Finland to the Soviet Union. Finland now saw Germany as a possible ally against the Soviet threat and, although no formal agreement was signed, German troops entered Finland. When Germany attacked their former ally, the Soviet Union, on\n22\nJune\n1941\n, Finland moved their forces to retake the land given up to the Soviet Union in the Treaty of Moscow.\nDespite not having taken the matriculation examinations, Lehto was able to enter the University of Helsinki in\n1943\n. He said\n[\n4\n]\n:-\n1943\nwas the last year you could still 'sneak' into the university, without passing the matriculation examination\n.\nHowever, he was better prepared than this quote might suggest, for he spent the summer before beginning his university studies reading on his own the materials for the first year courses.\nGerman defeats, however, eventually led to the Soviet Union again taking land from Finland in June\n1944\nand in September of that year they agreed again to the terms of the Treaty of Moscow. This required German troops to leave Finland but they refused to do so. Finland now attacked the\n200\n,\n000\nGerman troops stationed in Lapland. This \"War of Lapland\" dragged on until\n27\nApril\n1945\n. Lehto was a soldier in the Finnish army training at the Riihimäki Artillery Training Academy in Riihimäki, about\n70\nkm north of Helsinki. As well as fighting the Soviets on Finland's eastern border, he was also involved in the \"War of Lapland\" in the north where he fought against the Germans\n[\n5\n]\n:-\nPrivately, he likes to point out that in World War II he had the rare luxury to take a few shots at \"both the Communists and at the Nazis\".\nIt was only after World War II that Lehto became committed to mathematics. He writes in\n[\n1\n]\n:-\nMathematics hit me like a tsunami when I was almost exactly\n20\nyears old, when I was able to get over the war years during which I had suppressed my desire to learn new things.\nFrom that time on he was an outstanding student but his chance of an international education came through a piece of good fortune. During World War II,\nRolf Nevanlinna\nhad been rector of the University of Helsinki but, after the defeat of Germany in\n1945\n, the authorities at Helsinki University felt that it would be inappropriate to have a rector who was known to have German sympathies so he was asked to resign from that role. He retained his chair at Helsinki, however, but in October\n1946\nhe visited Zürich. This marks the beginning of a fifteen year period during which he was a guest lecturer in Zürich.\nNevanlinna\nplayed an important role in Lehto's career beginning from the time that he was an examiner of Lehto's Master's thesis. Impressed with Lehto's work,\nNevanlinna\narranged for him to receive a scholarship to study with him at Zürich\n[\n3\n]\n:-\nWithout his help, I'd have had no possibility to go abroad. It was quite rare at that time.\nHis studies in Zürich proved particularly significant\n[\n4\n]\n:-\nIn Zürich, I was able to focus on my doctoral thesis and participate in the research seminar led by\nNevanlinna\n. That was the moment when I noticed how inspirational teaching can be.\nLehto had been awarded his Master's degree in\n1947\n, and he received his doctorate from the University of Helsinki two years later for his thesis\nAnwendung orthogonaler Systeme auf gewisse funktionentheoretische Extremal- und Abbildungsprobleme\nⓉ\n(\nApplication of orthogonal systems on certain functional theory and extremal and Imaging problems\n)\n. A review of the\n51\n-page thesis by Z Nehari indicates the areas that it covered:-\nIn Chapters\n1\n-\n3\nof this thesis, the author largely restates earlier results, due mainly to\nBergman\nand\nSchiffer\n, concerning the application of complete sets of complex orthonormal functions to the theory of conformal mapping. Despite its great intrinsic elegance and its adaptability for numerical computations, the theory of complex orthonormal functions\n(\ncentring about the concept of the\nBergman\nkernel function\n)\nhad the drawback of being a mere representation theory; the fundamental existence theorems had to be borrowed from other fields. In Chapter\n4\nthe author fills this gap in one important instance by giving an existence proof for the parallel slit mappings\n(\nin the case of simply-connected domains this is identical with the\nRiemann\nmapping theorem\n)\nwithin the framework of the orthonormal function theory. Over and above its role in filling this gap, this proof is significant for being constructive and not\n(\nlike the classical proofs\n)\na mere \"existence proof.\" The mapping function is first constructed in terms of a complete orthonormal set, and it is then shown that the obtained function has indeed the desired mapping properties.\nLehto published many works in the years following the award of his doctorate. For example,\nOn the existence of analytic functions with a finite Dirichlet integral\n(1949)\n,\nOn Hilbert spaces with a kernel function\n(1950)\n,\nSome remarks on the kernel function in Hilbert function space\n(1952)\n,\nOn the distortion of conformal mappings with bounded boundary rotation\n(1952)\n,\nA majorant principle in the theory of functions\n(1953)\n,\nOn an extension of the concept of deficiency in the theory of\nmeromorphic\nfunctions\n(1953)\n, and\nValue distribution and boundary behaviour of a function of bounded characteristic and the Riemann surface of its inverse function\n(1954)\n.\nDuring the early part of his career, Lehto had two jobs, one as a mathematician at the cable company Suomen Kaapelitehdas Oy, a predecessor of Nokia, where he worked from\n1947\nto\n1962\n. His other job was at Helsinki University where he was a\ndocent\nfrom\n1951\nto\n1956\nand an associate professor from\n1956\nto\n1961\nwhen he was promoted to full professor. He held this position as professor until\n1988\n. He served in a number of important roles during these years: he was Dean of Science from\n1978\nto\n1983\n, Rector of the University from\n1983\nto\n1988\nand Chancellor from\n1988\nto\n1993\n. In addition, he had various roles outside the University of Helsinki. For example he was\nRolf Nevanlinna\n's assistant at the\nFinnish Academy of Science and Letters\nfrom\n1953\nto\n1956\n. He was also a research professor at the\nFinnish Academy of Science\nfrom\n1970\nto\n1975\n.\nThere are a number of different aspects of Lehto's career that we must emphasise. First there is his job with the cable company in the early part of his career. He described it as:-\nA gainful job that I did with my left hand.\nBut, as is stated in\n[\n3\n]\n:-\n... he ended up as the leading figure in the electronics department that was established by the company; that is, he contributed to building the foundation for Finnish computer science. Finland's first professors of the subject were trained at the cable company.\nWe have already indicated something of his contributions to function theory. A particular aspect that interested him was the theory of quasiconformal mappings. We illustrate this by quoting from a review by\nLars Ahlfors\nof Lehto's text, written in collaboration with K I Virtanen,\nQuasikonforme Abbildungen\nⓉ\n(\nQuasi conformal mapping\n)\n(1965)\n:-\nFrom a seed planted by H Grötzsch in\n1928\n, the theory of quasiconformal mappings has developed a healthy life of its own that could not easily have been foreseen. Originally not much more than a curiosity, its notions began to pervade the theory of elliptic differential equations in two variables\n(\nLavrent'ev\n, Morrey\n)\n, and\nTeichmüller\nsaw it not merely as an efficient tool in geometric function theory, but as a gateway to new problems of unmistakably classical flavour. It led in due time to a simple solution of the geometric problem of moduli, and there are encouraging signs of a fruitful theory in several dimensions. Quasiconformal mappings derive much of their fascination from the constant interplay between geometric and analytic methods. This is the leading point of view in this book, to the extent that the authors ignore all applications and even the higher-dimensional analogues. The book is thus intended for readers who are already convinced of the importance of quasiconformal mappings as an independent theory. It is written with a great deal of enthusiasm that will appeal to experts and non-initiates alike. The authors have a very fresh approach, and in almost all instances they improve on existing proofs. In this sense the book contains much original work.\nPerhaps at this point we should also look at Lehto's monograph\nUnivalent functions and Teichmüller spaces\n(1987)\n. William Abikoff ends a wonderful review, which puts\nTeichmüller\nspaces into their historical context, as follows:-\nThe complex analytic structure is discussed\n(\nfor the first time in over twenty years\n)\n. In fact the whole structure of the basic theory is laid out for the first time. I really like this book. I think it is a wonderful place for someone who likes complex analysis to start learning the central ideas of the subject. Additionally, there are plenty of interesting analytic problems posed within the text. The writing is a model of clarity - we have come to expect no less from Lehto.\nAlthough Lehto had permanent positions in Helsinki, from\n1948\nto\n1983\nhe spent a total of ten years as a visiting professor abroad at institutions in the United States, India, Israel, and Japan. He relates a nice story in\n[\n1\n]\nabout one of his early trips. On an international visit he was making in\n1949\nhe was presented with a tea bag while on the flight. He had never seen a tea bag before and wondered whether to make a hole in it! In fact\n[\n1\n]\ncontains fascinating information about Lehto's trips abroad when he met with leading mathematicians - he relates where he was sitting and what was eaten at these meetings.\nThere are other important contributions that Lehto has made to mathematics. One of these is his outstanding service to the\nInternational Mathematical Union\n. He organised the International Congress of Mathematicians held in Helsinki in August\n1978\n. Following this, he was secretary of the\nInternational Mathematical Union\nfrom\n1983\nto\n1988\n. In particular, he was Secretary when the Warsaw Congress, which was plagued with political problems, was held in\n1983\n.\nLehto's speech at the closing session of the Warsaw Congress is at\nTHIS LINK\n.\nHe spoke about the advantages of taking on that role\n[\n4\n]\n:-\nMy role as Secretary for the\nInternational Mathematical Union\nprovided me with a brilliant view on the international world of mathematics. It opened up a whole network of new contacts and possibilities for me.\nIt also led to him publishing\nMathematics Without Borders: A History of the International Mathematical Union\n(1998)\n. The publisher writes:-\nThe history of international mathematical co-operation over the last hundred years - from the first international congress in\n1897\nto plans for the World Mathematical Year\n2000\n- is a surprisingly compelling story. For reflected in the history of the\nInternational Mathematical Union\nis all the strife among world powers, as well as aspirations for cooperation among nations in an increasingly interdependent world. Yet throughout, the\nInternational Mathematical Union\nhas sponsored international congresses around the world, and Professor Lehto's gripping story is one of individuals, among them many of the great mathematicians of our century, united in the common purpose of advancing their science, told against the backdrop of world events\n.\n...\nLehto has written other important historical works such as: his autobiography\nEi yliopiston voittanutta\nⓉ\n(\nThe University is not winning\n)\n(1999)\n; a biography of\nRolf Nevanlinna\n,\nKorkeat maailmat\nⓉ\n(\nHigh worlds\n)\n(2001)\n, translated into German as\nErhabene Welten: Das Leben Rolf Nevanlinnas\nⓉ\n(\nBlessed worlds: The life of Rolf Nevanlinna\n)\n(2008)\n; a book about the brothers Vilho, Yrjö and Kalle Väisälä,\nOman tiensä kulkijat\nⓉ\n(\nGoing their own way\n)\n(2004)\n; and the book\nTieteen aatelia\nⓉ\n(\nScience nobility\n)\n(2008)\nabout\nErnst Lindelöf\nand his father, Lorenz Lindelöf, the founder of the\nFinnish Mathematical Society\n. Let us note that Lehto served as Chairman of the\nFinnish Mathematical Society\nfrom\n1962\nto\n1985\n.\nThroughout his career, Lehto has received honours and prizes which recognise his outstanding contributions. He has received honorary degrees from several universities, the Finnish Cultural Foundation Merit Award\n(1979)\n, the\nFinnish Academy of Science\nMerit Award\n(1996)\n, and he was one of eight people to receive a Public Information Lifetime Achievement Award from the Finnish Ministry of Education in\n2009\n. The citation for this last mentioned award reads:-\nThe lifetime achievement award was presented to Academician Olli Lehto for his wide-ranging lifetime work in the fields of scientific research and public information. Lehto is one of the most internationally renowned mathematicians in Finland and an active writer on the topic of the history of science.\nFinally, let us return to something we mentioned near the beginning of this biography, namely Lehto's love of butterflies. In fact\n[\n1\n]\ncontains many details of how Lehto searched out butterflies in all the many locations he visited world-wide. Also he has published a book\n[\n2\n]\nwhich explains just how much the love of butterflies has dominated his life. We end with a quotation from\n[\n1\n]\nrelating to his love of butterflies:-\nA human artist has the potential to create beautiful shapes and colours, but nature never makes a mistake. When God colours and decorates the butterfly's wings, without exception the result appears to a human eye as extremely sophisticated and stylish. What supernatural power is it that controls this artistic design?",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}