{
  "nome_completo": "Omar Khayyam",
  "nome_curto": "Omar Khayyam",
  "ano_nascimento": "1048",
  "ano_morte": "1131",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Khayyam/",
  "lugar_nascimento": "Nishapur, Persia (now Iran)",
  "lugar_morte": "Nishapur, Persia (now Iran)",
  "biografia": "Omar Khayyam\n's full name was Ghiyath al-Din Abu'l-Fath Umar ibn Ibrahim Al-Nisaburi\nal-Khayyami.\nA literal translation of the name al-Khayyami\n(\nor\nal-Khayyam\n)\nmeans 'tent maker' and this may have been the trade of Ibrahim his father. Khayyam played on the meaning of his own name when he wrote:-\nKhayyam, who stitched the tents of science,\nHas fallen in grief's furnace and been suddenly burned,\nThe shears of Fate have cut the tent ropes of his life,\nAnd the broker of Hope has sold him for nothing!\nThe political events of the\n11\nth\nCentury played a major role in the course of Khayyam's life. The Seljuq Turks were tribes that invaded southwestern Asia in the\n11\nth\nCentury and eventually founded an empire that included Mesopotamia, Syria, Palestine, and most of Iran. The Seljuq occupied the grazing grounds of Khorasan and then, between\n1038\nand\n1040\n, they conquered all of north-eastern Iran. The Seljuq ruler Toghrïl Beg proclaimed himself sultan at Nishapur in\n1038\nand entered Baghdad in\n1055\n. It was in this difficult unstable military empire, which also had religious problems as it attempted to establish an orthodox Muslim state, that Khayyam grew up.\nKhayyam studied philosophy at Naishapur and one of his fellow students wrote that he was:-\n... endowed with sharpness of wit and the highest natural powers ...\nHowever, this was not an empire in which those of learning, even those as learned as Khayyam, found life easy unless they had the support of a ruler at one of the many courts. Even such patronage would not provide too much stability since local politics and the fortunes of the local military regime decided who at any one time held power. Khayyam himself described the difficulties for men of learning during this period in the introduction to his\nTreatise on Demonstration of Problems of Algebra\n(\nsee for example\n[\n1\n]\n)\n:-\nI was unable to devote myself to the learning of this algebra and the continued concentration upon it, because of obstacles in the vagaries of time which hindered me; for we have been deprived of all the people of knowledge save for a group, small in number, with many troubles, whose concern in life is to snatch the opportunity, when time is asleep, to devote themselves meanwhile to the investigation and perfection of a science; for the majority of people who imitate philosophers confuse the true with the false, and they do nothing but deceive and pretend knowledge, and they do not use what they know of the sciences except for base and material purposes; and if they see a certain person seeking for the right and preferring the truth, doing his best to refute the false and untrue and leaving aside hypocrisy and deceit, they make a fool of him and mock him.\nHowever Khayyam was an outstanding mathematician and astronomer and, despite the difficulties which he described in this quote, he did write several works including\nProblems of Arithmetic,\na book on music and one on algebra before he was\n25\nyears old. In\n1070\nhe moved to Samarkand in Uzbekistan which is one of the oldest cities of Central Asia. There Khayyam was supported by Abu Tahir, a prominent jurist of Samarkand, and this allowed him to write his most famous algebra work,\nTreatise on Demonstration of Problems of Algebra\nfrom which we gave the quote above. We shall describe the mathematical contents of this work later in this biography.\nToghril Beg, the founder of the Seljuq dynasty, had made Esfahan the capital of his domains and his grandson Malik-Shah was the ruler of that city from\n1073\n. An invitation was sent to Khayyam from Malik-Shah and from his vizier Nizam al-Mulk asking Khayyam to go to Esfahan to set up an Observatory there. Other leading astronomers were also brought to the Observatory in Esfahan and for\n18\nyears Khayyam led the scientists and produced work of outstanding quality. It was a period of peace during which the political situation allowed Khayyam the opportunity to devote himself entirely to his scholarly work.\nDuring this time Khayyam led work on compiling astronomical tables and he also contributed to calendar reform in\n1079\n. Cowell quotes The Calcutta Review No\n59\n:-\nWhen the Malik Shah determined to reform the calendar, Omar was one of the eight learned men employed to do it, the result was the Jalali era\n(\nso called from Jalal-ud-din, one of the king's names\n)\n- 'a computation of time,' says Gibbon, 'which surpasses the Julian, and approaches the accuracy of the Gregorian style.'\nKhayyam measured the length of the year as\n365\n.\n24219858156\ndays. Two comments on this result. Firstly it shows an incredible confidence to attempt to give the result to this degree of accuracy. We know now that the length of the year is changing in the sixth decimal place over a person's lifetime. Secondly it is outstandingly accurate. For comparison the length of the year at the end of the\n19\nth\ncentury was\n365\n.\n242196\ndays, while today it is\n365\n.\n242190\ndays.\nIn\n1092\npolitical events ended Khayyam's period of peaceful existence. Malik-Shah died in November of that year, a month after his vizier Nizam al-Mulk had been murdered on the road from Esfahan to Baghdad by the terrorist movement called the Assassins. Malik-Shah's second wife took over as ruler for two years but she had argued with Nizam al-Mulk so now those whom he had supported found that support withdrawn. Funding to run the Observatory ceased and Khayyam's calendar reform was put on hold. Khayyam also came under attack from the orthodox Muslims who felt that Khayyam's questioning mind did not conform to the faith. He wrote in his poem the\nRubaiyat\n:-\nIndeed, the Idols I have loved so long\nHave done my Credit in Men's Eye much Wrong:\nHave drowned my Honour in a shallow cup,\nAnd sold my reputation for a Song.\nDespite being out of favour on all sides, Khayyam remained at the Court and tried to regain favour. He wrote a work in which he described former rulers in Iran as men of great honour who had supported public works, science and scholarship.\nMalik-Shah's third son Sanjar, who was governor of Khorasan, became the overall ruler of the Seljuq empire in\n1118\n. Sometime after this Khayyam left Esfahan and travelled to Merv\n(\nnow Mary, Turkmenistan\n)\nwhich Sanjar had made the capital of the Seljuq empire. Sanjar created a great centre of Islamic learning in Merv where Khayyam wrote further works on mathematics.\nThe paper\n[\n18\n]\nby Khayyam is an early work on algebra written before his famous algebra text. In it he considers the problem:-\nFind a point on a quadrant of a circle in such manner that when a\nnormal\nis dropped from the point to one of the bounding radii, the ratio of the normal's length to that of the radius equals the ratio of the segments determined by the foot of the normal.\nKhayyam shows that this problem is equivalent to solving a second problem:-\nFind a right triangle having the property that the\nhypotenuse\nequals the sum of one leg plus the altitude on the hypotenuse.\nThis problem in turn led Khayyam to solve the\ncubic equation\nx\n3\n+\n200\nx\n=\n20\nx\n2\n+\n2000\nx^{3} + 200x = 20x^{2} + 2000\nx\n3\n+\n2\n0\n0\nx\n=\n2\n0\nx\n2\n+\n2\n0\n0\n0\nand he found a positive root of this cubic by considering the intersection of a rectangular\nhyperbola\nand a circle.\nSee\nTHIS LINK\nfor a picture of the construction.\nAn approximate numerical solution was then found by interpolation in trigonometric tables. Perhaps even more remarkable is the fact that Khayyam states that the solution of this cubic requires the use of\nconic sections\nand that it cannot be solved by\nruler and compass\nmethods, a result which would not be proved for another\n750\nyears. Khayyam also wrote that he hoped to give a full description of the solution of cubic equations in a later work\n[\n18\n]\n:-\nIf the opportunity arises and I can succeed, I shall give all these fourteen forms with all their branches and cases, and how to distinguish whatever is possible or impossible so that a paper, containing elements which are greatly useful in this art will be prepared.\nIndeed Khayyam did produce such a work, the\nTreatise on Demonstration of Problems of Algebra\nwhich contained a complete classification of cubic equations with geometric solutions found by means of intersecting conic sections. In fact Khayyam gives an interesting historical account in which he claims that the Greeks had left nothing on the theory of cubic equations. Indeed, as Khayyam writes, the contributions by earlier writers such as\nal-Mahani\nand\nal-Khazin\nwere to translate geometric problems into algebraic equations\n(\nsomething which was essentially impossible before the work of\nal-Khwarizmi\n)\n. However, Khayyam himself seems to have been the first to conceive a general theory of cubic equations. Khayyam wrote\n(\nsee for example\n[\n9\n]\nor\n[\n10\n]\n)\n:-\nIn the science of algebra one encounters problems dependent on certain types of extremely difficult preliminary theorems, whose solution was unsuccessful for most of those who attempted it. As for the Ancients, no work from them dealing with the subject has come down to us; perhaps after having looked for solutions and having examined them, they were unable to fathom their difficulties; or perhaps their investigations did not require such an examination; or finally, their works on this subject, if they existed, have not been translated into our language.\nAnother achievement in the algebra text is Khayyam's realisation that a cubic equation can have more than one solution. He demonstrated the existence of equations having two solutions, but unfortunately he does not appear to have found that a cubic can have three solutions. He did hope that \"arithmetic solutions\" might be found one day when he wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nPerhaps someone else who comes after us may find it out in the case, when there are not only the first three classes of known powers, namely the number, the thing and the square.\nThe \"someone else who comes after us\" were in fact del\nFerro\n,\nTartaglia\nand\nFerrari\nin the\n16\nth\ncentury. Also in his algebra book, Khayyam refers to another work of his which is now lost. In the lost work Khayyam discusses the\nPascal triangle\nbut he was not the first to do so since\nal-Karaji\ndiscussed the Pascal triangle before this date. In fact we can be fairly sure that Khayyam used a method of finding nth roots based on the\nbinomial expansion\n, and therefore on the\nbinomial coefficients\n. This follows from the following passage in his algebra book\n(\nsee for example\n[\n1\n]\n,\n[\n9\n]\nor\n[\n10\n]\n)\n:-\nThe Indians possess methods for finding the sides of squares and cubes based on such knowledge of the squares of nine figures, that is the square of\n1\n,\n2\n,\n3\n, etc. and also the products formed by multiplying them by each other, i.e. the products of\n2\n,\n3\netc. I have composed a work to demonstrate the accuracy of these methods, and have proved that they do lead to the sought aim. I have moreover increased the species, that is I have shown how to find the sides of the square-square, quatro-cube, cubo-cube, etc. to any length, which has not been made before now. the proofs I gave on this occasion are only arithmetic proofs based on the arithmetical parts of\nEuclid\n's \"Elements\".\nIn\nCommentaries on the difficult postulates of Euclid's book\nKhayyam made a contribution to\nnon-euclidean geometry\n, although this was not his intention. In trying to prove the parallels postulate he accidentally proved properties of figures in non-euclidean geometries. Khayyam also gave important results on ratios in this book, extending\nEuclid\n's work to include the multiplication of ratios. The importance of Khayyam's contribution is that he examined both\nEuclid\n's definition of equality of ratios\n(\nwhich was that first proposed by\nEudoxus\n)\nand the definition of equality of ratios as proposed by earlier Islamic mathematicians such as\nal-Mahani\nwhich was based on\ncontinued fractions\n. Khayyam proved that the two definitions are equivalent. He also posed the question of whether a ratio can be regarded as a number but leaves the question unanswered.\nOutside the world of mathematics, Khayyam is best known as a result of Edward Fitzgerald's popular translation in\n1859\nof nearly\n600\nshort four line poems the\nRubaiyat.\nKhayyam's fame as a poet has caused some to forget his scientific achievements which were much more substantial. Versions of the forms and verses used in the\nRubaiyat\nexisted in Persian literature before Khayyam, and only about\n120\nof the verses can be attributed to him with certainty. Of all the verses, the best known is the following:-\nThe Moving Finger writes, and, having writ,\nMoves on: nor all thy Piety nor Wit\nShall lure it back to cancel half a Line,\nNor all thy Tears wash out a Word of it.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}