{
  "nome_completo": "Oscar Zariski",
  "nome_curto": "Oscar Zariski",
  "ano_nascimento": "1899",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zariski/",
  "lugar_nascimento": "Kobrin, Russian Empire (now Belarus)",
  "lugar_morte": "Brookline, Massachusetts, USA",
  "biografia": "Oscar Zariski\n's father was Bezalel Zaritsky and his mother Hannah Zaritsky. Oscar, born into this Jewish family, was named Ascher Zaritsky by his parents. We will comment below on how his name came to be changed to the now familiar version of Oscar Zariski.\nOscar's mother was the one who ensured that her young son had a good education. A tutor was provided for Oscar from the time he was seven years old and Oscar, under the guidance of the tutor, showed remarkable aptitude for the Russian language and for arithmetic. When the fighting associated with World War I reached Belarus, Oscar's family fled to Chernigov in Ukraine. It was the first of several moves forced on him by political problems.\nUnable to enter the faculty of mathematics at the University of Kiev as all the places were full, he chose philosophy instead. He was a student of philosophy at Kiev from\n1918\nto\n1920\n. However he was able to pursue his mathematical interests and studied algebra and\nnumber theory\nin addition to philosophy. However Zariski had carried out his studies through a period of turmoil in Kiev.\nIn January\n1918\nUkraine had become an independent state with Kiev as its capital. In the following month minor uprisings by workers in Kiev were suppressed but Red Army troops entered Kiev to give support to the workers. Kiev was then occupied by the Germans, but with the end of the war in November\n1918\n, an independent Ukraine was declared again in Kiev. In November\n1919\nKiev was briefly taken by the White armies, soon after to be replaced by the Red Army. There then followed the Russian-Polish War and, in May\n1920\n, the Polish army captured Kiev but were forced out in a counterattack. Life for Zariski was just too difficult in this city so devastated by war, so he decided to go to Italy to continue his studies.\nIn Rome Zariski came under the influence of the great algebraic geometers\nCastelnuovo\n,\nEnriques\nand\nSeveri\n. He obtained a doctorate from Rome in\n1924\nfor a doctoral thesis on a topic related to\nGalois theory\nwhich was proposed to him by\nCastelnuovo\n. Zariski married in\n1924\n; having met his future wife Yole Cagli in Rome they returned to Zariski's home town of Kobin to marry. Returning to Rome he remained there as a fellow of the International Education Board until\n1927\n.\nIt was while Zariski was in Rome that\nEnriques\nsuggested that Ascher Zaritsky, as he was then called, change his name to the Italian sounding Oscar Zariski. This was the name which he used on his first publication which was a joint paper with\nEnriques\n. Zariski wrote in\n[\n2\n]\nof how his mathematical interests differed from those of his supervisors\nCastelnuovo\nand\nEnriques\n:-\nHowever, even during my Rome period, my algebraic tendencies were showing and were clearly perceived by\nCastelnuovo\nwho once told me: \"You are here with us but are not one of us.\" This was said not in reproach but good naturedly, for\nCastelnuovo\nhimself told me time and time again that the methods of the Italian geometric school had done all they could do, had reached a dead end, and were inadequate for further progress in the field of\nalgebraic geometry\n.\nZariski had gone to Italy to escape the problems in Belarus and Ukraine. However, the political situation in Italy began to deteriorate rapidly. In October\n1922\nMussolini organized the Fascist \"March on Rome\" and he was asked to form a government. For\n18\nmonths he ran the country in reasonably democratic way but, during the years\n1925\nto\n1927\n, he removed the right of free speech, and removed opposition parties and trade unions. The Fascist hatred of Jews made life for Zariski, because of his Jewish background, particularly difficult.\nHelped by\nLefschetz\n, he escaped from the political problems of Italy in\n1927\nand went to the United States. There he taught at Johns Hopkins University, being a Johnston Scholar until\n1929\nwhen he joined the Faculty. He became a full professor at Johns Hopkins in\n1937\n.\nCastelnuovo\nand\nSeveri\nhad encouraged Zariski to view\nLefschetz\n's\ntopological\nmethods as being the road ahead for algebraic geometry, so between\n1927\nand\n1937\nZariski frequently visited\nLefschetz\nat Princeton. Zariski wrote\n[\n2\n]\n:-\nI owe a great deal to\n[\nLefschetz\n]\nfor his inspiring guidance and encouragement.\nDuring this period Zariski wrote\nAlgebraic Surfaces\nwhich was published in\n1935\n. He explains in\n[\n2\n]\nhow writing this monograph changed the direction of his work:-\nAt that time\n(1935)\nmodern algebra had already come to life\n(\nthrough the work of\nEmmy Noether\nand the important treatise of\nB L van der Waerden\n)\n, but while it was being applied to some aspects of the foundations of algebraic geometry by\nvan der Waerden\n... the deeper aspects of birational algebraic geometry ... were largely, or even entirely, virgin territory as far as algebraic exploration was concerned. In\n[\nAlgebraic Surfaces\n]\nI tried my best to present the underlying ideas of the ingenious geometric methods and proofs with which the Italian geometers were handling these deeper aspects of the whole theory of surfaces ... I began to feel distinctly unhappy about the rigour of the original proofs\n(\nwithout losing in the least my admiration for the imaginative geometric spirit that permeated these proofs\n)\n; I became convinced that the whole structure must be done over again by purely algebraic methods.\nAt Johns Hopkins University between\n1939\nand\n1940\nZariski carried out his project of applying modern algebra to the foundations of algebraic geometry. He worked on the theory of normal varieties, local uniformisation and the reduction of singularities of algebraic varieties.\nAn important year for Zariski was\n1945\nwhich he spent in São Paolo. There he gave a lecture course three days each week which was attended by\nAndré Weil\nand nobody else. Both Zariski and\nWeil\nlearnt much in discussions, often arguments, about the material that Zariski was presenting. After spending the year\n1946\n-\n47\nat the University of Illinois, Zariski was appointed to a chair at Harvard where he was to remain until he retired in\n1969\n. From the late\n1970\ns he suffered from Alzheimer's disease and his last few years were difficult ones as his health failed.\nIn\n1981\nZariski was awarded the Steele Prize by the\nAmerican Mathematical Society\nfor the cumulative influence of his total mathematical research. The citation for the prize summarised Zariski's contributions to mathematics throughout his life\n[\n2\n]\n:-\nAfter beginning his work in Italy in\n1924\nvery much in the style of \"Italian algebraic geometry,\" Zariski realised that the whole subject needed proper foundations. Thus in the period\n1927\nto\n1937\nhe turned first to topological questions and then in\n1937\nhe began to lay the commutative algebraic foundations of his subject. His topological work concentrated mainly on the\nfundamental group\n; many of the ideas he pioneered were innovations in topology as well as algebraic geometry and have developed independently in the two fields since then.\nIn\n1937\nZariski completely reoriented his research and began to introduce ideas from abstract algebra into algebraic geometry. Indeed, together with B L\nvan der Waerden\nand\nAndré Weil\n, he completely reworked the foundations of the subject without the use of topological or analytic methods. His use of the notions of integral independence, valuation rings, and regular local rings, in algebraic geometry proved particularly fruitful and led him to such high points as the resolution of singularities for threefolds in characteristic\n0\nin\n1944\n, the clarification of the notion of simple point in\n1947\n, and the theory of holomorphic functions on algebraic varieties over arbitrary ground fields. The theory of equisingularity and saturation begun by Zariski in\n1965\nhas also been of great influence and importance.\nAll of Zariski's work has served as a basis for the present flowering of algebraic geometry and the current school uses his work and ideas in the modern development of the subject.\nZariski's most famous book is\nCommutative Algebra\n, a two volume work written jointly with\nP Samuel\n. The first volume appeared in\n1958\n, the second in\n1960\n.\nThe\nAmerican Mathematical Society\nplayed a large role in Zariski's life and he contributed greatly to the Society over many years. He was vice president of the Society between\n1960\nand\n1961\nand president of the Society from\n1969\nto\n1970\n.\nZariski played an important role in mathematical publishing after his appointment as a full professor. He was an editor of the\nAmerican Mathematical Journal\nfrom\n1937\nto\n1941\n, served as a member of the editorial committee of the\nTransactions of the American Mathematical Society\nfrom\n1941\nto\n1947\n, and also served on the editorial boards of the\nAnnals of Mathematics\nand the\nAmerican Journal of Mathematics\n.\nAfter going to the United States in\n1927\nZariski spent considerable periods lecturing at other universities both in the United States and in other countries. We have already mentioned that he was a visiting professor at São Paulo in\n1945\nand a visiting professor at the University of Illinois in\n1946\n-\n47\n. Before that, in\n1936\n, he had lectured at the University of Moscow. Later, he lectured at Kyoto\n(1956)\n, the Institut des Hautes Études Scientifiques\n(1961\nand again\n1967)\n, and the University of Cambridge\n(1972)\n.\nHe was awarded many honours for his work in addition to the Steele Prize described above. He was awarded the\nCole\nPrize in Algebra from the\nAmerican Mathematical Society\nin\n1944\nfor four papers on algebraic varieties, two published in the\nAmerican Journal of Mathematics\nin\n1939\nand\n1940\n, and the other two in the\nAnnals of Mathematics\nalso one in\n1939\nand the second in\n1940\n. He was awarded the National Medal of Science in\n1965\n.\nMany academies and societies have honoured him by electing him to membership, including the U.S.\nNational Academy of Sciences\n(1944)\n, the\nAmerican Academy of Arts and Sciences\n(1948)\n, the American Philosophical Society\n(1951)\n, the\nBrazilian Academy of Sciences\n(1958)\n, and the\nAccademia dei Lincei\n(1958)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}