{
  "nome_completo": "Osip Ivanovich Somov",
  "nome_curto": "Osip Somov",
  "ano_nascimento": "1815",
  "ano_morte": "1876",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Somov/",
  "lugar_nascimento": "Otrada, Moscow gubernia (now oblast), Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Osip Somov\n's father was Ivan Somov. Osip attended secondary school in Moscow and then entered Moscow University to study mathematics and physics in the famous Faculty of Physics and Mathematics. He graduated in\n1835\nand continued to work on his Master's thesis\n(\nessentially equivalent to a doctorate\n)\n. During this time he wrote his first mathematical work on algebraic equations\nTheory of determinate algebraic equations of higher degree\nwhich was published in\n1838\n[\n1\n]\n. In this paper he demonstrated:-\n... not only deep knowledge but also extraordinary skill in presenting the newest achievements of algebraic analysis.\nFrom\n1839\nhe taught at Moscow Commercial College. In\n1841\nSomov was invited to teach at the University of St Petersburg, and he accepted this invitation and spent the rest of his life living in St Petersburg. With advice from Nikolai\nBrashman\n, he continued to work towards his doctorate which was essentially equivalent to the German\nhabilitation\nin that it provided the route to a professorship. After the award of his doctorate, he was appointed professor of applied mathematics at the University of St Petersburg where he continued to work for the next\n25\nyears. Somov was elected as an associate of the\nSt Petersburg Academy of Sciences\nin\n1857\n, becoming an academician in\n1862\non the death of\nMikhail Ostrogradski\n.\nSomov was the first in Russia to develop a geometrical approach to theoretical mechanics. He studied the rotation of a solid body about a point, studying examples arising from the work of\nEuler\n,\nPoinsot\n,\nLagrange\nand\nPoisson\n. Other topics Somov studied included\nelliptic functions\nand their application to mechanics. Grigorian writes in\n[\n1\n]\n:-\nTurning his attention to problems of theoretical mechanics, Somov applied results obtained in analytical mechanics to specifically geometric problems. He is rightfully considered the originator of the geometrical trend in theoretical mechanics in Russia during the second half of the nineteenth century. In the theory of elliptical functions and their application to mechanics, he completed the solution of the problem concerning the rotation of a solid body around an immobile point in the Euler-Poinsot and Lagrange-Poisson examples.\nThe first in Russia to deal with the solution of kinematic problems, Somov included a chapter on this topic in his textbook on theoretical mechanics. His other kinematic works include studies of a point in curvilinear coordinates. Somov's theory of higher-order accelerations of a point, and of an unchanging system of points, was a significant contribution. His works were the first special studies in Russia of nth -order accelerations of both absolute and relative motions of points. His studies of small oscillations of a system around the position of equilibrium are also important.\nAmong his works\n(\nall written in Russian\n)\nwere\nAnalytic theory of the undulatory motion of the ether\n(1847)\n,\nFoundations of the theory of elliptical functions\n(1850)\n,\nCourse in differential calculus\n(1852)\n,\nAnalytic geometry\n(1857)\n,\nElementary algebra\n(1860)\n,\nDescriptive geometry\n(1862)\nand the two volume treatise\nRational mechanics\n(1872\n-\n74)\n.\nSomov had a son Pavel Osipovich Somov who was born in\n1852\nand who went on to become a famous mathematician. Pavel Somov created the Russian school of the theory of mechanics of machines. He was the author of important works in the field of theoretical mechanics, theory of hinged mechanisms, synthesis of mechanisms, and screw and vectorial calculus.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}