{
  "nome_completo": "Oskar Perron",
  "nome_curto": "Oskar Perron",
  "ano_nascimento": "1880",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Perron/",
  "lugar_nascimento": "Frankenthal, Pfalz, Germany",
  "lugar_morte": "Munich, Germany",
  "biografia": "Oskar Perron\n's father was the merchant and banker Jakob Heinrich August Perron\n(1850\n-\n1925)\n, born on\n30\nMay\n1850\nin Frankenthal. Heinrich, the son of leather trader Valentin Perron\n(1807\n-\n1888)\nand Katharina Schaaff\n(1818\n-\n1865)\n, married Auguste Leinenweber\n(1857\n-\n1924)\nfrom Pirmasens on\n30\nMay\n1876\n. Auguste was the daughter of tanner Ludwig Leinenweber\n(1826\n-\n1870)\nand Katharina Von Gerickten\n(1835\n-\n1878)\n.\nOskar began his schooling at the Volksschule in\n1886\nbefore moving to the Latin School in the autumn of\n1889\n. The Latin school should have provided five years of schooling but in\n1893\nit was extended to six years of study. He then spent two and a half years studying mainly classics at the Humanist Gymnasium in Worms and, despite his father wishing him to continue in the family business, he studied mathematics in his spare time. In\n1898\nPerron was awarded his Abitur and later that year he began his studies of mathematics and physics at the University of Munich. In keeping with the custom of the time to spend semesters at different universities, he also studied at the University of Berlin. He undertook research for his doctorate at Munich advised by\nFerdinand von Lindemann\nand in\n1902\nhe was awarded the degree by the Ludwig-Maximilian University of Munich for his\n43\n-page thesis\nÜber die Drehung eines starren Körpers um seinen Schwerpunkt bei Wirkung äusserer Kräfte\nⓉ\n(\nOn the rotation of a rigid body about its center of gravity by the action of external forces\n)\n.\nAfter the award of his doctorate, Perron studied at Tübingen University and Göttingen University, where he worked with\nDavid Hilbert\n. He published\nNote über die Konvergenz von Kettenbrüchen mit positiven Gliedern\nⓉ\n(\nNote on the convergence of continued fractions with positive terms\n)\nin\n1905\n. It had been lectures at Munich by\nAlfred Pringsheim\non\ncontinued fractions\nthat had been a major influence on Perron and this\n1905\npaper on continued fractions continued\nPringsheim\n's work on the topic. In\n1898\nPringsheim\nhad introduced the term 'unconditional convergence' of a continued fraction and had also given what is now known as the\nPringsheim\ncriterion which insures the convergence of a continued fraction. Perron also published\nÜber eine Anwendung der Idealtheorie auf die Frage nach der Irreduzibilität algebraischer Gleichungen\nⓉ\n(\nOn an application of ideal theory to the question of the irreducibility of algebraic equations\n)\nin\n1905\n. Perron went on to complete his\nhabilitation\nat Munich and was appointed a lecturer there in\n1906\n. On\n28\nJuly\n1906\n, he married Hermione Perron, who was related to him via a number of different routes. From this marriage there were three daughters, Hertha, Erika and Hedwig.\nPerron's work on continued fractions led to him publishing the book\nDie Lehre von den Kettenbrüchen\nⓉ\n(\nThe law of continued fractions\n)\nin\n1913\n. For extracts of reviews of this work see\nTHIS LINK\n.\nIn\n1910\nPerron accepted the offer of a post as extraordinary professor at Tübingen and then, on\n13\nDecember\n1913\n, he became an ordinary professor at Heidelberg, taking up the appointment in\n1914\n. However World War I disrupted his career and, in\n1915\n, he undertook war work which was to earn him the Iron Cross. His first military service was in the Landsturm, a third-line reserve force consisting of older men. They saw active service on the eastern front. Later he served as a lieutenant in a survey unit until\n1918\n. At the end of the war he returned to Heidelberg where he taught until\n30\nSeptember\n1922\nwhen he was appointed to a chair at Ludwig-Maximilian-University of Munich. This chair had become vacant due to\nAlfred Pringsheim\nretiring. He became a colleague of\nConstantin Carathéodory\nand\nHeinrich Tietze\nand the three professors became known as the \"Munich mathematical triumvirate\".\nIn\n[\n5\n]\n218\npublications by Perron are listed in a bibliography which he compiled himself. These publications cover a wide range of mathematical topics. His work in analysis is certainly remembered through the Perron integral. However he also worked on\ndifferential equations\n, matrices and other topics in algebra, continued fractions, geometry and\nnumber theory\n. Perron published a number of important texts. In addition to the work on continued fractions mentioned above, which in fact ran to three editions the last being a two volume version in\n1954\n/\n57\n, he published an important text on\nirrational\nnumbers in\n1921\n. This text was designed to require only school level mathematics as a prerequisite and the topic was skilfully developed in a beautiful self-contained way. Again this was a text which ran to several editions and Perron revised the text in\n1960\nwhen he was aged\n80\n.\nFor extracts from reviews of various editions of Perron's\nIrrationalzahlen\nⓉ\n(\nIrrational numbers\n)\nsee\nTHIS LINK\n.\nOne of the things he is best-known for is the\nPerron paradox\nwhich highlights the danger of assuming that a solution to a problem exists. He introduced this as part of the discussion of\nSteiner\n's attempted proof of an isoperimetric problem. The paradox runs as follows:\nSuppose the largest natural number is\nN\nN\nN\n. Then if\nN\n>\n1\nN > 1\nN\n>\n1\nwe have\nN\n2\n>\nN\nN^{2} > N\nN\n2\n>\nN\ncontradicting the definition. Hence\n(\n!\n)\nN\n=\n1\nN = 1\nN\n=\n1\n.\nA two volume work on algebra first appeared in\n1927\nwith the third revised edition being published in\n1951\n. For extracts from reviews of various editions of Perron's\nAlgebra\nsee\nTHIS LINK\n.\nHitler's Nazi party came to power in early\n1933\n. Perron later wrote:-\nWhen\n[\nthe Nazis\n]\nwere not at the helm and with the Communists were developing the roughness, I thought it was actually the same whoever won the next election. For both would endeavour to pretend to the world that they were the true bearers of culture, and consequently science would not go badly. But I deceived myself. The Nazis were serious about their reforms and began the destruction of the universities on the first day.\nOn\n1\nApril\n1933\nthere was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter the university. On\n7\nApril\n1933\nthe Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired but there were exemptions for those who had fought for Germany in World War I. Perron was invited to lecture at Göttingen University in the summer of\n1933\n. He later wrote:-\nIn the summer of\n1933\nI was invited to a lecture in Göttingen, the stronghold of mathematics. The professors were already packing their suitcases, and a student mob dominated the field. And then came the most painful disappointment of my life. What I had imagined was quite impossible, happened. A whole series of outstanding scientists, not just opportunists who thought they could get rid of their competition, rushed to be Hitler's mouthpiece, did not hesitate to speak of the good Aryan and the bad \"foreign\" Jewish physics and mathematics, and thus ridicule their German fatherland to all foreign countries. I had a lot of fighting with them, and my wife was often afraid that with my mouth I would destroy myself.\nThe first \"fighting\" came in\n1934\nwhen Perron was president of the\nGerman Mathematical Society\n. In that year\nLudwig Bieberbach\ngave a lecture on racial mathematics.\nBieberbach\nalso published an open letter in the journal of the\nGerman Mathematical Society\nattacking\nHarald Bohr\n. Perron, as president of the\nGerman Mathematical Society\n, wrote to\nHarald Bohr\nin May\n1934\n(\nsee\n[\n1\n]\n)\n:-\nI completely understand your excitement over\nBieberbach\n's talk. I am myself horrified, must however, for today, confine myself to telling you that in any case, the\nGerman Mathematical Society\n, which has at all times reckoned the large number of foreign members to its honour, stands completely apart from these views.\nCertainly at this time Perron seemed unable to understand that\nBieberbach\ncould really believe the things he was saying about race.\nPerron, together with\nHelmut Hasse\nand\nKonrad Knopp\n, decided to make a public declaration that\nBieberbach\n's open letter had been published in the Society's journal against the wishes of the other editors. Fearing that if they published this in the Society's journal,\nBieberbach\nas an editor might be able to delete it, they decided to produce a separate page, printed at their own cost, and circulate this to members of the Society. However, without the agreement of the Society's Board\n(\nwhich\nBieberbach\nwas on\n)\n, the publisher refused to circulate the declaration. The September\n1934\nmeeting of the\nGerman Mathematical Society\nat Bad Pyrmont was a difficult one for many of the members but particularly for Perron as President.\nBieberbach\n, as the Society's secretary, invited a number of students to the meeting. Perron, as president, was in the chair and, following the constitution, asked non-members to leave.\nBieberbach\n's secretarial report introduced the topic of his open letter to\nHarald Bohr\n. Perron wanted to keep the discussion to the fact that\nBieberbach\nhad published the letter in the Society's Journal without discussing it with the other editors. However, he failed to keep the discussion on this point and the discussion became political. It was a very difficult meeting for Perron and, as a consequence, there was a move by the Reich Ministry to remove Perron from his post, but it seems to have been dropped. Perron later wrote:-\nBut I made it, and never came into conflict with the Gestapo, except once with a miserable block guard, who wanted to ban the Frankfurter Zeitung, which I of course let go. The local colleges were naturally on my side in the fight against the Nazis. There was no DC switch. Commands were bypassed or ignored. Never before were so many Jewish authors recommended in the lecture as after the ban.\nHolidays in Switzerland gave Perron the opportunity to see what the rest of the world was reporting about the Nazis. He later wrote:-\nIn the\n1930\ns, I regularly visited Switzerland, partly to stroll around on the four-thousand metre mountains, but to a large extent also to read foreign newspapers and talk with colleagues about Nazi atrocities. But also the Swiss too, if they wanted to speak openly, were just as anxious as we were. People were afraid of Nazis and there were abductions.\nTo see how much he risked in attacking the Nazi racial views we need only look at the Preface he wrote for the second edition of\nIrrationalzahlen\nⓉ\n(\nIrrational numbers\n)\nwhich was published in\n1939\n.\nOlive Hazlett\nwrites in\n[\n6\n]\n:-\nThe preface of this new edition seemed in some ways the most interesting part, on account of the reason that the author gives for presenting\nDedekind\n's theory of irrational numbers rather than the theory of\nCantor\nand\nMéray\n. In\n1921\n, he did not seem to think it necessary to give any reason for basing his treatment on Dedekind's work; but in\n1939\n, he devotes most of the preface to justify his giving\nDedekind\n's rather than\nCantor\n's theory. He refers to an article by\nBieberbach\nand the famous one by\nHardy\nin \"Nature\" on the J-type and S-type of mathematicians. One could easily wonder just what lies behind these careful justifications. However that may be, we wish him well, for Perron has done yeoman service in writing textbooks for universities and technische Hochschulen.\nAlso in\n1939\nhe wrote a letter to the rector of Munich University, Philipp Broemser\n(1886\n-\n1940)\n, which made absolutely clear his views on the Reich:-\nMagnificence!\nI cannot participate in the celebration of the Lecturers' Union Academy organized by the Reich Leader of University Teachers, Professor Dr Walter Schultze.\nReason:\nSince I am neither a member of the Lecturer's Academy nor a lecturer's union at all, my participation can only be thought of as a scientific honour. Now, however, I am a member of a number of German scientific academies, and, against these institutions and their members, the Reich Leader of University Teachers has expressed his contempt by stating that the German academies have not done anything scientifically since Leibniz and are now only societies of calcified scientific veterans.\nTwo things are possible. Either the Reich Leader of University Teachers is right with this low opinion or is not right. In the first case, it cannot be a pleasure for the Reich Leader of University Teachers to see among his honourable guests such inferior scientific personalities; I would at least spare him this sight as far as my person is concerned. In the second case, however, I cannot be expected to be honoured by a man who has wrongfully denigrated the academies and their members, and probably I would have to listen defencelessly, if the honourable guests are condemned in the same way.\nHeil Hitler!\nO Perron\nLet us note that Walter Schultze\n(1894\n-\n1979)\nwas a physician and World War I aviator who had joined the Nazi party when it was founded in\n1919\nand became Reich Leader of University Teachers in\n1935\n. In that role he implemented Nazi racial policies in the German universities. We also note that Perron had been honoured with election to the\nHeidelberg Academy of Sciences\nin\n1917\n, the\nGerman Academy of Scientists Leopoldina\nin\n1919\n, the Bavarian Academy of Sciences in\n1924\n, and the\nGöttingen Academy of Sciences\nin\n1928\n.\nBy\n1941\nthere was a report on Perron by the Nazi party in response to a request he had made which stated\n(\nsee\n[\n11\n]\nor\n[\n12\n]\n)\n:-\nAlthough a legal attitude is to be expected from him, it can be said on the other hand that Perron is not a very faithful follower of the movement.\nThe Dean of Science at Munich during the years of World War II was Wilhelm Carl Gottlieb Müller\n(1880\n-\n1968)\nwho had studied physics, mathematics and philosophy. Müller had been appointed in\n1939\nto succeed\nArnold Sommerfeld\nas Professor of Theoretical Physics at Munich but many felt it was for political rather than scientific reasons. He argued in favour of \"German physics\" and had many disagreements with Perron. Much later Perron wrote:-\n... after the final victory by the Americans, mathematics here has remained completely intact both at the university and at the Technische Hochschule, while, for example, a representative of theoretical physics\n[\nWilhelm Müller\n]\nwho had pushed towards the Ministry, who often tried to frighten us with his good relations with the Führer headquarters, had to disappear immediately.\nIndeed Müller was dismissed in\n1945\n.\nAlthough Perron formally retired in\n1951\n, he continued to teach certain courses at Munich until\n1960\n. However even when he ended his teaching at the age of\n80\nhe was still able to continue with a vigorous research program, publishing\n18\npapers between\n1964\nand\n1973\n. Perhaps most remarkable of all Perron's books was his text on\nnon-euclidean geometry\nwhich he published at the age of\n82\n. Frank, in\n[\n5\n]\n, writes:-\nThis work won the approval of the entire mathematical world due to its great worth and masterful presentation. It is of interest not only to students of mathematics and physics but also especially to teachers of mathematics.\nFor an extract from a review by Hans Schwerdtfeger see\nTHIS LINK\n.\nDespite the large amount of mathematics which Perron produced over a long career, he also had other interests. These are described in\n[\n5\n]\nand included:-\n... his love of the mountains of his surroundings. No vacation would have been complete without the mountains. As well as higher mountains, he climbed the\n2200\nmeter Totenkirchl in the Wilder Kaiser more than twenty times, the last time when he was\n74\n.\nAs well as the honours Perron received through election to the academies mentioned above, he was also awarded an Honorary doctorate from the University of Tübingen in\n1956\n, an Honorary doctorate from the University of Mainz in\n1960\nand the Bavarian Order of Merit in\n1959\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}