{
  "nome_completo": "Otto Stolz",
  "nome_curto": "Otto Stolz",
  "ano_nascimento": "1842",
  "ano_morte": "1905",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stolz/",
  "lugar_nascimento": "Hall (now Solbad Hall in Tirol), Austria",
  "lugar_morte": "Innsbruck, Austria",
  "biografia": "Otto Stolz\nwas born in Hall in Tirol which is a picturesque ancient town, famed for its brine baths,\n10\nkm east of Innsbruck. His father was a doctor who later became quite well-known as a leading psychiatrist. After attending the\nGymnasium\nin Innsbruck, Stolz studied at the University of Innsbruck before moving to the University of Vienna where he undertook research for his doctorate. He was awarded his Ph.D. in\n1864\nfor a thesis on geometry.\nAfter the award of his doctorate, Stolz\nhabilitated\nat the University of Vienna and worked there as a\nPrivatdozent\nuntil\n1869\n. He obtained a scholarship to allow him to study in Germany from\n1869\nto\n1871\n. He went first to Berlin where he attended lectures by the three great mathematicians\nWeierstrass\n,\nKummer\nand\nKronecker\n. He then studied at Göttingen, attending lectures by\nKlein\nand\nClebsch\nbefore returning to Austria. His period of study in Germany marked the addition of a new topic to his research interests. He was charmed by\nWeierstrass\n's approach to analysis and began to investigate problems in that area; these have proved to be his most significant contributions. He also struck up a friendship with\nKlein\nat this time and after returning to Innsbruck the two began to correspond. We briefly mention some topics in their correspondence below.\nIn July\n1872\nStolz was appointed an extraordinary professor in his home town of Innsbruck. He was appointed to an ordinary professorship at the University of Innsbruck in July\n1876\nand in the same year he married. Despite many attempts to get him to accept a chair in Vienna, he remained in his home town building up a strong reputation despite low funding and only a few students but attracting colleagues like\nGegenbauer\n.\nWe mentioned the Stolz-\nKlein\ncorrespondence above. In\n[\n3\n]\n,\n32\nfrom Stolz to\nKlein\n, found in the archives at Göttingen, and\n25\nfrom\nKlein\nto Stolz from the archives at Innsbruck, are described and a summary of the contents of the mathematically interesting letters is given. Topics covered are those of interest to\nKlein\nand to Stolz and include\nKlein\n's Erlangen program, nowhere differentiable continuous functions, geometry, and the topology of the line.\nHis topics of research were wide ranging as Robinson points out in\n[\n1\n]\n:-\nStolz's earliest papers were concerned with analytic or\nalgebraic geometry\n, including spherical trigonometry. He later dedicated an increasing part of his research to real analysis, in particular to convergence problems in the theory of series, including double series; to the discussion of the limits of indeterminate ratios; and to integration.\nExamples of his early papers are\nDie geometrische Bedeutung der complexen Elemente in der analytischen Geometrie\nⓉ\n(\nThe geometric meaning of the complex elements in analytic geometry\n)\n(1871)\n,\nBeweis einiger Sätze über Potenzeihen\nⓉ\n(\nEvidence of some sentences about power series\n)\n(1875)\n,\nÜber die singulären Punkte der algebraischen Functionen und Curven\nⓉ\n(\nOn the singular points of algebraic functions and curves\n)\n(1875)\n,\nAllgemeine Theorie der Asymptoten der algebraischen Curven\nⓉ\n(\nGeneral theory of asymptotes of algebraic curves\n)\n(1877)\n, and\nDie Multiplicität der Schnittpunkte zweier algebraischen Curven\nⓉ\n(\nThe multiplicity of the intersection of two algebraic curves\n)\n(1879)\n. In the\n1870\ns\nWeierstrass\n's ε, δ approach to analysis became to standard approach and, in\nB Bolzano's Bedeutung in der Geschichte der Infinitesimalrechnung\nⓉ\n(\nBolzano's importance in the history of calculus\n)\n(1881)\n, Stolz pointed out that\nBolzano\nhad suggested a similar approach even before\nCauchy\nhad attempted his own way of making analysis more rigorous.\nArchimedes\n' axiom states that given two magnitudes\na\na\na\nand\nb\nb\nb\none can find a multiple of\na\na\na\nwhich exceed\nb\nb\nb\nand also a multiple of\nb\nb\nb\nwhich exceeds\na\na\na\n. This can actually be traced back to\nEudoxus\nbut the term 'Archimedes' axiom' used today was coined by Stolz in\n1882\nin\nZur Geometrie der Alten, insbesondere über ein Axiom des Archimedes\nⓉ\n(\nOn ancient geometry, in particular on an axiom of Archimedes\n)\n. On the same topic he also wrote\nZur Geometrie der Alten, insbesondere über ein Axiom des Archimedes\nⓉ\n(\nOn ancient geometry, in particular on an axiom of Archimedes\n)\n(1883)\nand\nÜber das Axiom des Archimedes\nⓉ\n(\nOn the axiom of Archimedes\n)\n(1891)\n. He also returned to\ninfinitesimals\nof the sort considered by\nNewton\nand attempted to make this approach rigorous. Balanzat points out in\n[\n2\n]\nthat the first correct definition of differential in two variables to Stolz in\nGrundzüge der Differential und Integralrechnung\n, I\nⓉ\n(\nGeneral differential and integral calculus, I\n)\n(1893)\n.\nIn\n1885\nthe first part of\nVorlesungen über Allgemeine Arithmetik\nⓉ\n(\nLectures on general arithmetic\n)\nwas published on\nAllgemeines und Arithhmetik der Reelen Zahlen\nⓉ\n(\nGeneral arithmetic of the real numbers\n)\n, with the second part on\nArithhmetik der Complexen Zahlen\nⓉ\n(\nArithmetic of complex numbers\n)\nappearing two years later. This two volume work, like all  Stolz's books, was very well written; it became a classic. Another book, published in\n1891\nwas\nGrössen und Zahlen\nⓉ\n(\nSizes and numbers\n)\n. He published a series of books under the title\nLeçons nouvelles sur l'analyse infinitésimale et ses applications géométriques\nⓉ\n(\nNew Lessons on infinitesimal analysis and geometric applications\n)\n. The first part\nPrincipes généraux\nⓉ\n(\nGeneral principles\n)\nappeared in\n1894\nfollowed by\nétude monographique des principales fonctions d'une seule variable\nⓉ\n(\nMonographic on the principle functions of one variable\n)\n(1895)\n, and two further volumes. In\n1902\n, in collaboration with his student J A Gmeiner, he published the two volume work\nTheoretische Arithmetik\nⓉ\n(\nTheoretical Arithmetic\n)\n. A second edition was published in\n1915\n, ten years after Stolz's death.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory",
    "Topology"
  ]
}