{
  "nome_completo": "Paolo Ruffini",
  "nome_curto": "Paolo Ruffini",
  "ano_nascimento": "1765",
  "ano_morte": "1822",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ruffini/",
  "lugar_nascimento": "Valentano, Papal States (now Italy)",
  "lugar_morte": "Modena, Duchy of Modena (now Italy)",
  "biografia": "Paolo Ruffini\n's father, Basilio Ruffini, was a medical doctor in Valentano. As a young child Paolo was\n[\n4\n]\n:-\n... of a mystical temperament and appeared to be destined for the priesthood...\nThe family moved to Reggio, near Modena in the Emilia-Romagna region of northern Italy, when Paolo was a teenager. He entered the University of Modena in\n1783\nwhere he studied mathematics, medicine, philosophy and literature. Among his teachers of mathematics at Modena were Luigi Fantini, who taught Ruffini geometry, and Paolo Cassiani, who taught him calculus.\nThe Este family ruled Modena and, in\n1787\n, Cassiani was appointed as a councillor for the Este estates. Cassiani's course at Modena on the foundations of analysis was taken over by Ruffini in\n1787\n-\n88\nalthough he was still a student at this time. On\n9\nJune\n1788\nRuffini graduated with a degree in philosophy, medicine and surgery. Soon after this he graduated with a mathematics degree.\nRuffini must have made a good job of the foundations of analysis course he took over from Cassiani for, on\n15\nOctober\n1788\n, he was appointed professor of the foundations of analysis. Fantini, who had taught Ruffini geometry when he was an undergraduate, found his eyesight deteriorating and in\n1791\nhe had to resign his post at Modena. Ruffini was appointed to fill the position of Professor of the Elements of Mathematics in\n1791\n. However, Ruffini was not only a mathematician. He had trained in medicine and, also in\n1791\n, he was granted a licence to practise medicine by the Collegiate Medical Court of Modena.\nThis was a time of wars following the French Revolution. By early\n1795\nFrance had won victories on every front. In northern Italy the French army threatened Austrian-Sardinian positions, but its commander failed to take the initiative. In March\n1796\nhe was replaced by Napoleon Bonaparte who executed a brilliant campaign of manoeuvres. Taking the offensive on\n12\nApril and successively defeated and separated the Austrian and the Sardinian armies and then marched on Turin. The King of Sardinia asked for an armistice and Nice and Savoy were annexed to France. Bonaparte continued the war against the Austrians and occupied Milan but was held up at Mantua. Before Mantua fell to his armies he signed armistices with the duke of Parma and the duke of Modena. Napoleon's troops occupied Modena and, much against his wishes, Ruffini found himself in the middle of the political upheaval.\nNapoleon set up the Cisalpine Republic consisting of Lombardy, Emilia, Modena and Bologna. Although not wishing to get involved, Ruffini found himself appointed as a representative to the Junior Council of the Cisalpine Republic. However, he soon left this position and, in early\n1798\n, he returned to his scientific work at the University of Modena. He was required to swear an oath of allegiance to the republic and this Ruffini found he could not bring himself to do on religious grounds. By failing to swear the oath he lost his professorship and was barred from teaching.\nRuffini did not seem greatly disturbed by the loss of his chair, in fact he was a very calm man who took all the dramatic events around him in his stride. The fact that he could not teach mathematics meant that he had more time to practise medicine and therefore help his patients to whom he was extremely devoted. On the other hand it gave him the chance to work on what was one of the most original of projects, namely to prove that the\nquintic equation\ncannot be solved by\nradicals\n.\nTo solve a polynomial equation by radicals meant finding a formula for its roots in terms of the coefficients so that the formula only involves the operations of addition, subtraction, multiplication, division and taking roots.\nQuadratic equations\n(\nof degree\n2)\nhad been known to be\nsoluble by radicals\nfrom the time of the Babylonians. The\ncubic equation\nhad been solved by radicals by del\nFerro\n,\nTartaglia\nand\nCardan\n.\nFerrari\nhad solved the\nquartic\nby radicals in\n1540\nand so\n250\nyears had passed without anyone being able to solve the quintic by radicals despite the attempts of many mathematicians. Among those who had made serious attempts to understand the problem were\nTschirnhaus\n,\nEuler\n,\nBézout\n,\nVandermonde\n,\nWaring\nand\nLagrange\n.\nIt appears that nobody before Ruffini really believed that the quintic could not be solved by radicals. Certainly no mathematician has published such a claim and even\nLagrange\nin his famous paper\nReflections on the resolution of algebraic equations\nsays he will return to the question of the solution of the quintic and, clearly, he still hoped to solve it by radicals. In\n1799\nRuffini published a book on the theory of equations with his claim that quintics could not be solved by radicals as the title shows:\nGeneral theory of equations in which it is shown that the algebraic solution of the general equation of degree greater than four is impossible\n. The introduction to the book begins:-\nThe algebraic solution of general equations of degree greater than four is always impossible. Behold a very important theorem which I believe I am able to assert\n(\nif I do not err\n)\n: to present the proof of it is the main reason for publishing this volume. The immortal\nLagrange\n, with his sublime reflections, has provided the basis of my proof.\nRuffini used\ngroup theory\nin his work but he had to invent the subject for himself.\nLagrange\nhad used\npermutations\nand one can argue that groups appear in\nLagrange\n's work but since\nLagrange\nnever composed permutations it is rather with hindsight that we now see the beginnings of group theory in his paper. Ruffini is the first to introduce the notion of the order of an element, conjugacy, the cycle decomposition of elements of\npermutation groups\nand the notions of primitive and imprimitive. He proved some remarkable theorems\n(\nnot of course with the modern terminology quoted below\n)\n:-\nThe order of a permutation is the least common multiple of the lengths in the decomposition into disjoint cycles.\nAn element of\nS\n5\nS_{5}\nS\n5\n​\nof order\n5\nis a\n5\n-cycle.\nIf\nG\n<\nS\n5\nG < S_{5}\nG\n<\nS\n5\n​\nhas order divisible by\n5\nthen\nG\nG\nG\nhas an element of order\n5\n.\nS\n5\nS_{5}\nS\n5\n​\nhas no subgroups of index\n3\n,\n4\nor\n8\n.\nIt is remarkable work and, except for one gap, proves the theorem as Ruffini claimed. The proof is given in modern notation in\n[\n4\n]\n. However there was a strange lack of response to Ruffini's work from mathematicians. In\n1801\nRuffini sent a copy of his book to\nLagrange\n. He received no response and so he sent a second copy with a covering letter\n[\n4\n]\n:-\nBecause of the uncertainty that you may have received my book, I send you another copy. If I have erred in any proof, or if I have said something which I believed new, and which is in reality not new, finally if I have written a useless book, I pray you point it out to me sincerely.\nAgain Ruffini received no reply and he wrote yet again in\n1802\n:-\nNo one has more right ... to receive the book which I take the liberty of sending you. ... In writing this book, I had principally in mind to give a proof of the impossibility of solving equations of degree higher than four.\nSome mathematicians accepted Ruffini's proof although one would have to say that\nPietro Paoli\n, the professor at Pisa, was influenced by patriotic motives when he wrote in\n1799\n[\n4\n]\n:-\nI read with much pleasure your book ... and recommend greatly the most important theorem which excludes the possibility of solving equations of degree greater than four. I rejoice exceedingly with you and with our Italy, which has seen a theory born and perfected and to which other nations have contributed little...\nTo understand this quotation one has to realise that\nLagrange\nwas born in Turin which was part of Italy at the time. This patriotic reaction apart, the world of mathematics seemed to almost ignore Ruffini's great result. So how did Ruffini react? He published a second proof in\n1803\nwhich he hoped might be more easily understood, writing in the introduction:-\nIn the present memoir, I shall try to prove the same proposition\n[\ninsolubility of the quintic\n]\nwith, I hope, less abstruse reasoning and with complete rigour.\nAt least Ruffini received comments from\nMalfatti\nconcerning this paper, but unfortunately\nMalfatti\nhad not understood Ruffini's arguments and raised a fallacious objection. Ruffini published further proofs in\n1808\nand\n1813\n. Of this last proof Ayoub writes in\n[\n4\n]\n:-\nCan anything be more elegant? This proof is essentially what was later called the\nWantzel\nmodification of\nAbel\n's proof and was published in\n1845\n. It is no surprise that it should resemble Ruffini's proof, since\nWantzel\nsays in his paper ...\"using works of\nAbel\nand Ruffini...\".\nRuffini did not stop trying to have his work recognised by the mathematical community. When\nDelambre\nwrote in a report on the state of mathematics since\n1789\n:-\nRuffini proposes to prove that it is impossible ...,\nRuffini replied:-\n... I not only proposed to prove but in reality did prove ... .\nOne has to feel desperately sorry for Ruffini. If some mathematician had written to him showing him there was an error or even a gap in the proof, then at least Ruffini would have had the chance to correct it. However, it seemed that nobody really wanted to know that quintics could not be solved by radicals. Ruffini asked the Institute in Paris to pronounce on the correctness of his proof and\nLagrange\n,\nLegendre\nand\nLacroix\nwere appointed to examine it. Again they produced a report which was highly unsatisfactory as far as Ruffini was concerned:-\n... if a thing is not of importance, no notice is taken of it and\nLagrange\nhimself, \"with his coolness\" found little in it worthy of attention.\nThe\nRoyal Society\nwere also asked to pronounce on the correctness and Ruffini received a somewhat kinder reply which said that although they did not give approval of particular pieces of work they were quite sure that it proved what was claimed. The one person who did acknowledge the importance and correctness was\nCauchy\n. This is all the more surprising since\nCauchy\nwas one of the worst of all mathematicians at giving credit to others. He wrote to Ruffini in\n1821\n, less than a year before Ruffini's death\n[\n1\n]\n:-\n... your memoir on the general resolution of equations is a work which has always seemed to me worthy of the attention of mathematicians and which, in my judgement, proves completely the impossibility of solving algebraically equations of higher than the fourth degree.\nIn fact\nCauchy\nhad written a major work on permutation groups between\n1813\nand\n1815\nand in it he generalised some of Ruffini's results. He had certainly been greatly influenced by Ruffini's ideas. This influence through\nCauchy\nis perhaps the only way in which Ruffini's work was to make an impact on the development of mathematics.\nWe left the story of Ruffini's career around\n1799\nwhen he began his publications on the quintic. He left the University of Modena to spend\n7\nyears teaching applied mathematics in the military school in Modena. He continued to practise medicine and tend to patients from the poorest to the richest in society. After the fall of Napoleon, Ruffini became rector of the University of Modena in\n1814\n. The political situation was still extremely complex and despite his personal skills, the great respect in which he was held, and his reputation for honesty, his time as rector must have been a very difficult one.\nAs well as the rectorship, Ruffini held a chair of applied mathematics, a chair of practical medicine and a chair of clinical medicine in the University of Modena. In\n1817\nthere was a typhus epidemic and Ruffini continued to treat his patients until he caught the disease himself. Although he made a partial recovery, he never fully regained his health and in\n1819\nhe gave up his chair of clinical medicine. He did not give up his scientific work, however, and in\n1820\nhe published a scientific article on typhus based on his own experience with the disease.\nThere are further aspects of Ruffini's work which should be mentioned. He wrote several works on philosophy, one of which argues against some of\nLaplace\n's philosophical ideas. He also wrote on\nprobability\nand the application of probability to evidence in court cases.\nGiven the information in this article about the insolubility of the quintic, it is reasonable to ask why\nAbel\nhas been credited with proving the theorem while Ruffini has not. Ayoub suggests that\n[\n4\n]\n:-\n... the mathematical community was not ready to accept so revolutionary an idea: that a polynomial could not be solved in radicals. Then, too, the method of permutations was too exotic and, it must be conceeded, Ruffini's early account is not easy to follow. ... between\n1800\nand\n1820\nsay, the mood of the mathematical community ... changed from one attempting to solve the quintic to one proving its impossibility...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}