{
  "nome_completo": "Paramesvara",
  "nome_curto": "Paramesvara",
  "ano_nascimento": "1370",
  "ano_morte": "1460",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Paramesvara/",
  "lugar_nascimento": "Alattur, Kerala, India",
  "lugar_morte": "India",
  "biografia": "Paramesvara\nwas an Indian astronomer and mathematician who wrote many commentaries on earlier works as well as making many observations. Although his father has not been identified, we know that Paramesvara was born into a Namputiri Brahmana family who were astrologers and astronomers. The family home was Vatasseri\n(\nsometimes called Vatasreni\n)\nin the village of Alattur. This village was in Kerala and Paramesvara himself gives its coordinates with respect to Ujjain. This puts it at latitude\n10\n°\n51\n' north. It is on the north bank of the river Nila at its mouth.\nFrom Paramesvara's writing we know that Rudra was his teacher, and\nNilakantha\n, who knew Paramesvara personally, tells us that Paramesvara's teachers included\nMadhava\nand\nNarayana\n. We can be fairly confident that the dates we have given for Paramesvara are roughly correct since he made eclipe observations over a period of\n55\nyears. We will say a little more about these observations below. He played an important part in the remarkable developments in mathematics which took place in Kerala in the late\n14\nth\nand early part of the\n15\nth\ncentury.\nThe commentaries by Paramesvara on a number of works have been published. For example the\nKarmadipika\nis a commentary on the\nMahabhaskariyam\nⓉ\n(\nThe big book of Bhaskara\n)\n, an astronomical and mathematical work by\nBhaskara I\n, and its text is given in\n[\n3\n]\n. In\n[\n2\n]\nthe text of Paramesvara's commentary on the\nLaghubhaskariyam\nⓉ\n(\nThe small book of Bhaskara\n)\nof\nBhaskara I\nis given. Munjala wrote the astronomical work\nLaghumanasam\nin the year\n932\nand Paramesvara wrote a commentary\n(\nsee\n[\n4\n]\n)\n. It is a work containing typical topics for Indian mathematical astronomy works of this period: the mean motions of the heavenly bodies; the true motions of the heavenly bodies; miscellaneous mathematical rules; the systems of coordinates, direction, place and time; eclipses of the sun and the moon; and the operation for apparent longitude.\nAryabhata\ngave a rule for determining the height of a pole from the lengths of its shadows in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n. Paramesvara gave several illustrative examples of the method in his commentary on the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\n.\nLike many mathematicians from Kerala,\nMadhava\nclearly had a very strong influence on Paramesvara. One can see throughout his work that it is teachings by\nMadhava\nwhich direct much of Paramesvara's mathematical ideas. One of Paramesvara's most remarkable mathematical discoveries, no doubt influenced by\nMadhava\n, was a version of the mean value theorem. He states the theorem in his commentary\nLilavati Bhasya\non\nBhaskara II\n's\nLilavati\n. There are other examples of versions of the mean value theorem in Paramesvara's work which we now consider.\nThe\nSiddhantadipika\nby Paramesvara is a commentary on the commentary of\nGovindasvami\non\nBhaskara I\n's\nMahabhaskariya\nⓉ\n(\nThe big book of Bhaskara\n)\n. Paramesvara gives some of his eclipse observations in this work including one made at Navaksetra in\n1422\nand two made at Gokarna in\n1425\nand\n1430\n. This work also contains a mean value type formula for inverse interpolation of the sine. It presents a one-point iterative technique for calculating the sine of a given angle. In the\nSiddhantadipika\nParamesvara also gives a more efficient approximation that works using a two-point iterative algorithm which turns out to be essentially the same as the modern secant method. See\n[\n8\n]\nand\n[\n9\n]\nfor further details.\nThe expression for the radius of the circle in which a cyclic quadrilateral is inscribed, given in terms of the sides of the quadrilateral, is usually attributed to\nLhuilier\nin\n1782\n. However Paramesvara described the rule\n350\nyears earlier. If the sides of the cyclic quadrilateral are\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nand\nd\nd\nd\nthen the radius\nr\nr\nr\nof the circumscribed circle was given by Paramesvara as:\nr\n2\n=\nx\ny\nr^{2} = \\Large\\frac{x}{y}\\normalsize\nr\n2\n=\ny\nx\n​\nwhere\nx\n=\n(\na\nb\n+\nc\nd\n)\n(\na\nc\n+\nb\nd\n)\n(\na\nd\n+\nb\nc\n)\nx = (ab + cd) (ac + bd) (ad + bc)\nx\n=\n(\na\nb\n+\nc\nd\n)\n(\na\nc\n+\nb\nd\n)\n(\na\nd\n+\nb\nc\n)\nand\ny\n=\n(\na\n+\nb\n+\nc\n−\nd\n)\n(\nb\n+\nc\n+\nd\n−\na\n)\n(\nc\n+\nd\n+\na\n−\nb\n)\n(\nd\n+\na\n+\nb\n−\nc\n)\ny = (a + b + c - d) (b + c + d - a) (c + d + a - b) (d + a + b - c)\ny\n=\n(\na\n+\nb\n+\nc\n−\nd\n)\n(\nb\n+\nc\n+\nd\n−\na\n)\n(\nc\n+\nd\n+\na\n−\nb\n)\n(\nd\n+\na\n+\nb\n−\nc\n)\n.\nThe original text by Paramesvara describing the rule is given in\n[\n7\n]\n.\nParamesvara made a series of eclipse observations between\n1393\nand\n1432\nwhich we have referred to above. The last observation which we know he made was in\n1445\nbut\nNilakantha\nquotes a verse by Paramesvara in which he claims to have made observations spanning\n55\nyears. The known observatons by Paramesvara do not quite square with this statement, there being a discrepancy of three years. Although we do not know when Paramesvara died we do know, again from\nNilakantha\n, that the two knew each other personally. Since we have a definite date for\nNilakantha\n's birth of\n1444\nit is hard to believe that Paramesvara died before\n1460\n.\nUsing his observations, Paramesvara made revisions of the planetary parameters and, like many other Indian astronomers, he constantly attempted to compare the theoretically computed positions of the planets with those which he actually observed. He was keen to improve the theoretical model to bring it into as close an agreement with observations as possible.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}