{
  "nome_completo": "Paul Isaac Bernays",
  "nome_curto": "Paul Bernays",
  "ano_nascimento": "1888",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernays/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Paul Bernays\n's father was Julius Bernays\n(1862\n-\n1916)\n, a businessman, and his mother was Sarah Brecher\n(1867\n-\n1953)\n. Julius Bernays\n(\nknown as Jules\n)\nhad Swiss nationality and married Sarah Brecher in\n1887\n. In fact Julius and Sarah were quite closely related as both were descended from Paul's great-grandfather Isaac Bernays. Gregory Moore looks at Paul's ancestors in\n[\n1\n]\n:-\nBernays came from a distinguished German-Jewish family of scholars and businessmen. His great-grandfather, Isaac ben Jacob Bernays\n(1792\n-\n1849)\n, chief rabbi of Hamburg, was known for both strict Orthodox views and modern educational ideas. His grandfather, Louis Bernays, a merchant, travelled widely before helping to found the Jewish community in Zürich, while his great-uncle, Jacob Bernays, was a Privatdozent at the University of Bonn.\nLouis Bernays\n(1830\n-?\n)\n, whose mother was Sara Lea Behrend\n(1804\n-\n1858)\n, married but the name of his wife is not known. Jacob Bernays\n(1824\n-\n1881)\n, also the son of Isaac Bernays, was a writer on philosophy who became an extraordinary professor and chief librarian at the University of Bonn.\nPaul was the oldest of his parents' five children having a younger brother, Adolphe\n(1890\n-\n1957)\n, and three younger sisters. After a short time in London, during which Paul was born, his family moved to Paris. Let us make clear at this point that Bernays, in a CV that he wrote later in life, says that he was of the Jewish faith and a citizen of Switzerland. From Paris the family moved to Berlin where Paul attended the Köllnisches\nGymnasium\nfrom\n1895\nto\n1907\n. In later life Bernays was to speak of the happy childhood he had during these years. At the Gymnasium he had a strong interest in music, became a highly proficient pianist, then put his talent in this area into composing. Slightly later came a love for ancient languages and mathematics. As his school days drew to an end he had to make the difficult decision between music and mathematics.\nE Specker\nwrites\n[\n18\n]\n:-\nHe seems to have been quite happy at school, a gifted, well adapted child accepting the prevailing cultural values in literature as well as in music. It was indeed his musical talent that first attracted attention; he tried his hand at composing, but being never quite satisfied with what he achieved, he decided a scientific career.\nBernays's decision was to take up engineering and he entered the Technische Hoschule in Charlottenburg where he began his studies in\n1907\n. However, despite his parents' wish that he put his mathematical talents to practical use, Bernays decided after one semester\n(\nthe\n1907\nsummer semester\n)\nthat he must make the change from engineering to pure mathematics. He began his pure mathematics studies at the University of Berlin where he was taught mathematics by\nIssai Schur\n,\nEdmund Landau\n,\nGeorg Frobenius\nand\nFriedrich Schottky\n. He also studied physics with\nMax Planck\n, and philosophy with Alois Riehl, Carl Stumpf and Ernst Cassirer. From\n1910\nuntil\n1912\nhe studied at Göttingen where he attended mathematics lectures by\nDavid Hilbert\n,\nEdmund Landau\n(\nwho moved to Göttingen at the same time as Bernays\n)\n,\nHermann Weyl\nand\nFelix Klein\n, physics lectures by Woldemar Voight and\nMax Born\n, and he studied philosophy with Leonard Nelson\n(1882\n-\n1927)\n. In fact he was much influenced by Nelson's philosophy school and his first publication was in that area, namely\nDas Moralprinzip bei Sidgwick und bei Kant\nⓉ\n(\nThe moral precept in Sidgwick and Kant\n)\n(1910)\n. It was at Göttingen that he obtained his doctorate in the spring of\n1912\n, working with\nEdmund Landau\non analytic number theory and binary quadratic forms. The title of his thesis was\nÜber die Darstellung von positiven, ganzen Zahlen durch die primitiven, binären quadratischen Formen einer nicht-quadratischen Diskriminante\nⓉ\n(\nOn the representation of positive integers by the primitive binary quadratic forms of a non-quadratic discriminant\n)\n. He submitted his\nhabilitation\nthesis on modular elliptic functions entitled\nZur elementaren Theorie der Landauschen Funktion\nϕ\n(\na\n)\n\\phi(a)\nϕ\n(\na\n)\nⓉ\n(\nOn elementary theory of Landau's function φ\n)\nto the University of Zürich towards the end of\n1912\n.\nAt the University of Zürich, Bernays was appointed as a\nprivatdocent\nand an assistant to\nErnst Zermelo\n. He worked there until\n1917\nbut this was not a productive period for him. He published two further papers, namely\nÜber den transzendentalen Idealismus\nⓉ\n(\nOn transcendental idealism\n)\nand\nÜber die Bedenklichkeiten der neueren Relativitätstheorie\nⓉ\n(\nOn doubts about the more recent theory of relativity\n)\n, both in\n1913\nbut these were consequences of his work with Nelson in Göttingen. He wrote later\n(\nsee\n[\n18\n]\n)\n:-\nAt the beginning of the First World War, I worked on a reply to a critique by Alfred Kastil of the Fries philosophy. This reply was not published - by the time there was an opportunity to have it published I no longer agreed with all of it.\nIn fact he submitted the paper with title\nBeiträge zur axiomatischen Behandlung des Logikkalküls\nⓉ\n(\nContributions to the axiomatic treatment of logic calculus\n)\nin\n1918\nbut it was not published. He explained this when he wrote:-\nTo be sure, the paper was of definite mathematical character, but investigations inspired by mathematical logic were not taken quite seriously - they were thought of as amusing, half-way part of recreational mathematics. I myself had this tendency, and therefore did not take pains to publish it in time. It has appeared only much later, and strictly speaking not quite complete, only certain parts. Many things I had in the paper have therefore not been recorded accordingly in descriptions of the development of mathematical logic.\nIn\n1916\nZermelo left Zürich, partly for health reasons, partly because of a dispute with the university administration. Bernays took over\nZermelo\n's lecture courses after he left. In many ways Zürich was a good time for Bernays for he became friends with\nGeorg Pólya\n, made several visits to\nAlbert Einstein\nand enjoyed frequent social occasions at\nHermann Weyl\n's. In\n1917\nHilbert\nvisited Zürich to lecture and offered Bernays a post as his assistant at Göttingen. Constance Reid writes in\n[\n5\n]\n:-\nIn the spring of\n1917\n, on a visit to Zürich,\nHilbert\narranged for two of the young mathematicians in the circle around\nHurwitz\nto accompany him on a walk. One of these was\nWeyl\n's friend\nPolya\n. The other was a reserved, shy and somewhat nervous man named Paul Bernays. To the surprise of\nPolya\nand Bernays the subject of conversation on the walk to the top of the Zürichberg was not mathematics but philosophy. Neither of them had specialised in that field. Bernays, however, had studied some philosophy and, during his student days at Göttingen, had been close to Leonard Nelson. In fact, his first publication had been in Nelson's philosophical journal. Now, in spite of his quietness, Bernays had much more to say than the usually voluble\nPolya\n. At the end of the walk\nHilbert\nasked Bernays to come to Göttingen as his assistant. Bernays accepted.\nWe should point out that there is a small error in this account. The walk took place, as Reid writes, when\nHilbert\nvisited Zürich in the spring of\n1917\nbut Bernays only received the offer to become\nHilbert\n's assistant when\nHilbert\nreturned to Zürich in September\n1917\n. At Göttingen, Bernays worked on the lecture notes to\nHilbert\n's course 'Prinzipien der Mathematik'. These lecture notes were later edited by\nWilhelm Ackermann\nand published as\nGrundzüge der theoretischen Logik\nⓉ\n(\nOutlines of theoretical logic\n)\n. Bernays wrote a second habilitation in which he established the completeness of propositional logic; this was in fact a study of\nRussell\nand\nWhitehead\n's\nPrincipia Mathematica\n, and uses ideas from\nSchröder\n. Constance Reid writes about Bernays' collaboration with\nHilbert\nin\n[\n5\n]\n:-\nHilbert\n's real collaborator during these days, however, was Bernays. To some people it seemed that he was even exploiting his logic assistant. Bernays was no young student but a man in his middle thirties, a mature mathematician. As\nHilbert\n's assistant, he received a salary and, having habilitated shortly after his arrival in Göttingen, also received fees from the students who attended his lectures. He could live on what he received, but certainly he could not marry. ... In addition to preparing his own lectures, Bernays helped\nHilbert\nprepare his lectures, accompanied him to class and often took over the teaching for part of the hour, supervised\nHilbert\n's students who were working for the doctoral degree, studied and digested the literature necessary for their work, and did a great deal of writing on their joint book, which was entitled 'Grundlagen der Mathematik'. In Bernays,\nHilbert\nhad found someone as interested in the foundations of mathematics as he was. He had no compunction about working his assistant as hard as he worked himself. ... The two men sometimes, however, got into rather violent arguments over the subject of foundations. Bernays attributes the emotional quality of these arguments to a fundamental \"opposition\" in\nHilbert\n's feelings about mathematics. ... Bernays did not always agree with\nHilbert\nabout their programme, but he appreciated the fact that, passionate though\nHilbert\nwas in their disputation, he never held it against his assistant personally when he took the opposite side. After their work was finished,\nHilbert\nand Bernays often argued about politics. ... Music often brought peace after the arguments, logical or political. Bernays loved music and had played \"four hands\" with\nHurwitz\nwhen he was in Zürich.\nIn\n1922\nHilbert\nrecommended Bernays for an extraordinary professorship at Göttingen. In his letter of recommendation\nHilbert\nwrote\n(\ngiven in the original German and in an English translation in\n[\n3\n]\n)\n:-\nPaul Bernays' extend over the most diverse fields of mathematical science: the representation of positive integers by binary quadratic forms\n(\ndissertation supervised by landau\n)\n, elementary theory of\nLandau\n's function of\nPicard\n's theorem\n(\nhabilitation thesis in Zürich\n)\n,\nLegendre\n's condition in the calculus of variations, one-dimensional gas as an example of an ergodic system, axiomatic treatment of\nRussell\n's propositional calculus\n(\nhabilitation thesis, Göttingen, not printed\n)\n. Several papers on philosophical topics, in 'Abhandlungen der Friesschen Schule'. All this scientific work is characterised by thoroughness and reliability. Often it focuses on a specific fundamental question requiring elucidation, which is analysed with astuteness and foresight, or on an existing important difficulty that is then overcome with great skill. Bernays' knowledge is extraordinarily broad and deep, and it extends into the domains of philosophy, physics and biology. He is characterised by a loving dedication to science; beyond that he is a noble-minded person of reliable character, highly esteemed everywhere. In all problems concerning the foundations of science, above all those of mathematical science, he is the most knowledgeable expert, and in particular, the most valued and most successful member of my staff.\nBernays was appointed as an extraordinary professor without tenure. He continued to attend lectures, particularly those of\nEmmy Noether\n,\nBartel van der Waerden\nand\nGustav Herglotz\n. He found that he learnt new ideas more easily by listening to lectures than from reading books. Every vacation he returned to Berlin and lived with his family.\nWhen the Nazi regime made its directive against Jews in\n1933\n, Bernays lost his post at Göttingen. He was told to stop teaching in April\n1933\npending a final decision, and in August his appointment as an assistant was terminated. His right to teach was formally withdrawn in September.\nHilbert\nkept him on as his private assistant for six months but soon he was forced to leave Germany. He was still a Swiss citizen so a move to Zürich was not too difficult. In Zürich he worked at the Eidgenössische Technische Hochschule\n(\nETH: the Swiss Federal Institute of Technology\n)\nin a temporary post from\n1934\n. He visited Princeton in session\n1935\n-\n36\nand gave courses on mathematical logic and set theory. In\n1939\nthe ETH granted him the right to teach, but only for four years. It was extended in\n1943\nwhen the four year term was up. He obtained a half-time permanent post at the ETH from\n1945\nbut there has been criticism of the ETH for not treating a distinguished academic like Bernays in a more honourable way. However Bernays never saw it that way and he was extremely grateful to the ETH for coming to his rescue at a time of great difficulty. He held this part-time post until\n1959\nwhen he retired and was made professor emeritus.\nToday Bernays is best known for his joint two volume work\nGrundlagen der Mathematik\nⓉ\n(\nFoundations of mathematics\n)\n(1934\n-\n39)\nwith\nHilbert\n. Although the book was a joint publication, the two authors made very different contributions with all the text being written by Bernays and much of the content being Bernays' working out answers to, often rather vague, questions from\nHilbert\n. The work attempted to build mathematics from symbolic logic. Akihiro Kanamori writes about this famous book\n[\n8\n]\n:-\nGoing into many reprintings and an eventual second edition thirty years later, this monumental work provided a magisterial exposition of the work of the\nHilbert\nschool in the formalization of first-order logic and in proof theory and the work of\nGödel\non incompleteness and its surround, including the first complete proof of the Second Incompleteness Theorem. Recent re-evaluation of Bernays' role actually places him at the centre of the development of mathematical logic and\nHilbert\n's program.\nIn\n1899\nHilbert\nhad written\nGrundlagen der Geometrie\nⓉ\n(\nFoundations of geometry\n)\nand, in\n1956\n, Bernays revised this work on the foundations of geometry. Bernays, influenced by\nHilbert\n's thinking, believed that the whole structure of mathematics could be unified as a single coherent entity. In order to start this process it was necessary to devise a set of axioms on which such a complete theory could be based. He therefore attempted to put set theory on an axiomatic basis to avoid the paradoxes. Between\n1937\nand\n1954\nBernays wrote a whole series of articles in the\nJournal of Symbolic Logic\nwhich attempted to achieve this goal. He attempted to modify\nvon Neumann\n's axiom system to include features from\nZermelo\n's. He formulated the principle of dependent choices, a form of the axiom of choice independently studied by\nTarski\nlater. He used number theoretic models similar to those used by\nAckermann\nto show the independence of his axioms. In\n1958\nBernays published\nAxiomatic Set Theory\nin which he brought together all his work on the axiomatisation of set theory.\nNow Bernays' work in Zürich was influenced by his colleague Ferdinand Gonseth\n(1890\n-\n1975)\n. He wrote\n(\nsee\n[\n4\n]\n)\n:-\nI had come close to the views of Ferdinand Gonseth on the basis of the engagement of my thinking with the philosophy of Kant, Fries, and Nelson, and so I attached myself to his philosophical school.\nLet us give an example of Bernays' ideas by quoting from\nDie Mathematik als ein zugleich Vertrautes und Unbekanntes\nⓉ\n(\nMathematics both familiar and unfamiliar\n)\nwhere he is arguing that our conception of natural numbers had to have come about through a process of trial and error:-\nFirst we are conscious of the freedom we have to advance from one position arrived at in the process of counting to the next one. But then we take the step of a connection, through which a function that associates a successor with each and every number is posited. Here a 'progressus in infinitum' replaces the 'progressus in indefinitum'. But it is not immediately obvious that this idea of the infinite number series can be realised; the intellectual experience of its successful realisation is then essential for developing a feeling of familiarity, even of obviousness, as acquired evidence.\nBernays' work on an axiomatic basis for mathematics was taken further by\nKurt Gödel\n.\nLet us now quote some of Charles Parsons' concluding remarks about Bernays' achievements\n[\n4\n]\n:-\nBernays' virtues as a writer on philosophy of mathematics are evident: contact with actual mathematics, especially mathematical logic, combined with a familiarity with the issues that concern philosophers and sensitivity to the difficulties that philosophical positions are prone to. Probably the last is the most difficult for a mathematician to achieve. ... one can discern some philosophical contributions that have proved enduring: his stratification of mathematical conceptions in \"Sur le platonisme,\" the observation in that paper that points to a distinction between finitism and\nintuitionism\non one side and \"strict finitism\" on the other ..., possibly the \"quasi-combinatorial\" description of the conception of arbitrary subset of an infinite set.\nAs we have already indicated, Bernays held relatively minor posts considering the magnitude of his achievements. One might say that the reason for this was a consequence of the anti-Semitic Nazi policies but, even before the Nazis came to power, he had been\nHilbert\n's assistant for sixteen years. Similarly, he didn't receive as many honours for his achievements as one might expect. However, he was elected a corresponding member of the\nRoyal Belgium Academy of Science\nand of the\nNorwegian Academy of Science and Letters\n. The University of Munich awarded him an honorary doctorate in\n1976\n. He was also elected president of the International Academy of the Philosophy of Science, and made an honorary chair of the German Society for Mathematical Logic and Foundational Research in the Exact Sciences. He was on the editorial board of several journals,\nDialectica\n, the\nJournal of Symbolic Logic\n, and the\nArchiv für mathematische Logik und Grundlagenforschung\nⓉ\n(\nArchives of mathematical logic and basic research\n)\n.\nFinally, we give details of his personality as given in\n[\n18\n]\n:-\nAs his immense correspondence, his friendliness to visitors, his acceptance of invitations to congresses until the last years of his life, clearly show, he liked the contact with other human beings. He was extremely benevolent, helping many an author with his papers - from\nHilbert\nto a high-school teacher having made some small discovery. On the other hand, he lived in an aura of detachment. He was unique in his refusal to judge other people; he never spoke badly of anybody there is every reason to assume that he did not even think badly of others. When, once, reference was made to a statesman almost universally recognized as one of the villains of this century, in order to induce him to a negative judgment, he replied: \"My situation is so different from his, that it is not for me to pass judgment\". There is no doubt that his gift of seeing everywhere the best and refraining from judgment where he could not see anything good, helped a great deal to free foundational studies from the situation where different schools are expected to fight one another.\nBernays never married but after he moved to Zürich he lived with his mother and two unmarried sisters. After his mother died in\n1953\n, he continued to live with his sisters. He remained research active well into his\n80\ns. He died of a heart condition after a short illness, one sister having died a few years earlier. He was survived by his sister Martha.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}