{
  "nome_completo": "Paul Richard Halmos",
  "nome_curto": "Paul Halmos",
  "ano_nascimento": "1916",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Halmos/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Los Gatos, California, USA",
  "biografia": "Paul Halmos\n's parents were Sándor Halmos\n(\nborn\n19\nJanuary\n1881)\nand Paula Rosenberg\n(1888\n-\n1916)\n. Sándor and Paula were married in\n1903\nand they had three children, George\n(\nborn about\n1909)\n, John\n(\nborn about\n1911)\nand Paul\n(\nthe subject of this biography\n)\n. Paul's mother, Paula, died when Paul was six months old. Paul's father was a successful physician in Budapest who had the rather remarkable foresight to realise the problems that were going to befall Europe. So in\n1924\nPaul's father emigrated to the United States, leaving Paul and his two elder brothers in Budapest. There they were looked after by the physician who took over his father's practice. In the United States, Sándor Halmos worked for a year as an intern in a hospital in Omaha before moving to Chicago where he set up his own practice.\nAfter five years in the United States, Paul's father, known in America as Alexander Charles Halmos, became a naturalised American citizen and, at that time, brought Paul from Hungary to join him in Chicago. The information that Paul came to the United States in\n1929\nafter his father became an American citizen comes from his own account of his life but the\n1930\nCensus states that Paul Halmos emigrated to the United States in\n1924\n. This must be an error in filling in the Census form. Somewhat more puzzling is the fact that the\n1930\nCensus form gives N/A\n(\nnot available\n)\nfor the year in which Paul's two older brothers entered the United States. According to Paul they came to join their father before he did. Once Alexander Halmos had established himself in Chicago he had remarried. His second wife, Irene, was a widow with two daughters Alice Reich\n(\nborn in Illinois around\n1917)\nand Jean Reich\n(\nborn in Illinois around\n1920)\n. Irene had been born in Hungary in about\n1897\nand had first married at the age of\n16\n. At the time of the\n1930\nCensus, the family was living in Fullerton Avenue, Chicago, Cook, Illinois in a house that Alexander Halmos owned. They had two servants, Paul Tschampel, born in Germany around\n1898\n, and his wife Tillie Tschampel, born around\n1902\nin what later became Czechoslovakia.\nPaul Halmos attended school in Budapest up to the age of thirteen. He said\n[\n3\n]\n:-\nIn mathematics classes, I usually was above average. I was bored when class was going on, and I did things like take logarithms of very large numbers for fun.\nAfter reaching the United States, he attended high school in Chicago but rather remarkably he missed out four years schooling in the process. Halmos says that there was some confusion since in Hungary four years of primary schooling were followed by eight years of secondary schooling. He had completed seven of these twelve years but Halmos said\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nI hinted to the school authorities that I had completed three years of secondary school, and I was believed. ... a year and a half later, at the age of fifteen, I graduated from high school.\nHe did remarkably well to cope with the move since when he arrived in Chicago he spoke Hungarian and German but no English. On his first day he managed to work out where to go by exchanging a few words with a teacher in Latin and French. After six months he understood English well and could speak \"rapid, incorrect, ungrammatical, colloquial English.\"\nWhile still fifteen years old he entered the University of Illinois to study chemical engineering. He had considered other options such as studying law at a law school but opted for chemistry. His age was not a problem, he said\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nI was tall for my age and cocky. I pretended to be older and got along fine.\nAfter one year he became disappointed with chemistry, saying he got his hands dirty, so he changed to mathematics and philosophy but did not particularly shine at mathematics\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nI was a routine calculus student - I think I got B's. I did not understand about limits. I doubt that they taught it. ... But I was good at integrating and differentiating things in a mechanical sense. Somehow I like it. I kept fooling around with it.\nDespite being so young when he entered his undergraduate course and despite changing from chemical engineering to mathematics and philosophy he still completed the four year degree in three years graduating in\n1934\n. He began graduate studies at the University of Illinois at Urbana-Champaign, still with philosophy as his main subject, and mathematics as his minor subject.\nIt was not until the end of the academic year\n1935\n-\n36\nthat Halmos made the move from philosophy to mathematics. This came about mainly because he had preformed poorly in the oral comprehensive examination for the Masters' Degree in philosophy. It was in September\n1935\nthat he taught his first course, namely freshman algebra\n[\n36\n]\n:-\n... its purpose was to reveal the secrets of quadratic equations\n(\nfor which there was a formula\n)\nand parentheses\n(\nwhich were abominable entities and had to be eliminated at the drop of a hat\n)\n. The course met at\n8\n:\n00\nin the morning, five days a week - yes, five days, Monday through Friday, inclusive; my pay was $\n45\n.\n00\na month. Incidentally, I was living at the time in an old-fashioned, comfortable, large,\n5\n-room apartment, within five minutes walk of the campus; the rent was $\n45\n.\n00\na month.\nAfter thinking that algebra was the right mathematical topic for him, he quickly changed to analysis and studied for his Ph.D. under\nJoseph Leo Doob\n. This was awarded in\n1938\nfor his thesis on measure-theoretic probability\nInvariants of Certain Stochastic Transformation: The Mathematical Theory of Gambling Systems\n. This topic led to him becoming involved in a debate about gambling which was going on in Urbana-Champaign at the time and, after he was interviewed by a local newspaper, they ran the headline \"You Can't Win, Says P R Halmos.\"\nJobs were not so easy to come by\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nI typed\n120\nletters of application, mailed them out, and got two answers, both \"no.\" The University of Illinois took pity on me and kept me on as an instructor. So in\n1938\n-\n39\nI had a job, but I kept applying.\nIn February\n1939\nHalmos was successful in obtaining a post at Reed College in Oregon. He accepted the position but in April his friend Warren Ambrose was offered a scholarship at the Institute for Advanced Study in Princeton. Halmos wrote\n(\n[\n1\n]\nor\n[\n3\n]\n)\n:-\nThat made me mad. I wanted to go, too! I resigned my job, making the department head, whom I had never met, very unhappy, of course. I ... went to my father and asked to borrow a thousand dollars ... I wrote to\nVeblen\nand asked if I could become a member of the Institute for Advanced Study even though I had no fellowship. ... I moved to Princeton.\nAfter six months Halmos was offered a fellowship, and in his second year at Princeton he became\nvon Neumann\n's assistant. Ambrose writes in\n[\n1\n]\n:-\nThis was wonderful for Paul because he ... idolised\nvon Neumann\n... This seemed to have been the first time in Paul's career when he received what he deserved and I think it must have been one of the happiest times in his life.\nHalmos said of\nvon Neumann\n[\n2\n]\n:-\n... his speed, plus depth, plus insight, plus inspiration turned me on.\nThey wrote one joint paper while Halmos was his assistant. Halmos explains in\n[\n35\n]\n:-\nAfter the thinking and the talking were finished, it became my job to do the writing. I did it, and I submitted to him a typescript of about\n12\npages. He read it, criticized it mercilessly, crossed out half, and rewrote the rest; the result was about\n18\npages. I removed some of the Germanisms, changed a few spellings, and compressed it into\n16\npages. He was far from satisfied, and made basic changes again; the result was\n20\npages. The almost divergent process continued\n(\nfour innings on each side as I now recall it\n)\n; the final outcome was about\n30\ntypescript pages\n(\nwhich came to\n19\nin print\n)\n.\nA debt that Halmos owes to\nvon Neumann\nis that one of his lecture courses inspired Halmos's first book. In\n1942\nHalmos published\nFinite Dimensional Vector Spaces\nwhich was to bring him instant fame as an outstanding writer of mathematics. For extracts from reviews of this book and several others of Halmos's books see\nTHIS LINK\n.\nAfter leaving the Institute for Advanced Study, Halmos was appointed to Syracuse University, New York. While in Syracuse he took part in teaching soldiers in the Army's Specialized Training Program. In\n1945\nhe married Virginia Templeton Pritchett. Virginia had been born on\n21\nDecember\n1915\nin Omaha, Nebraska and had studied at Vassar College followed by graduate study in logic and the foundations of mathematics at Brown University.\nAt the end of World War II Halmos decided it was time for a change and, in\n1946\n, he became an assistant professor at the University of Chicago. In the summer of\n1955\nthe University of Chicago held a\nfunctional analysis\nmeeting with\nGeorge Mackey\n,\nIrving Segal\n,\nIrving Kaplansky\nand Paul Halmos as lecturers. Lawrence Wallen was in the audience and describes Halmos's lectures in\n[\n60\n]\n:-\nMany words and phrases were clipped, others almost drawled and the timbre was pleasantly resonant. In fact, the total effect was rather musical. The vestigial Hungarian accent Paul bemoans was so slight as to seem just a mannerism ... The lectures proceeded at a no-nonsense but unhurried pace.\nLate in the summer of\n1955\n, Wallen\n[\n60\n]\n:-\n... met Virginia\n(\nGinger\n)\nHalmos, a striking woman I recall thinking. Any picture of Paul that omits Ginger is grossly incomplete. In the first place, she's crucial to keeping the entropy of the Halmos household improbably small and in keeping Paul and the cats hale and hearty. This, of course, doesn't define Ginger. She's a woman of remarkable intelligence with a fine wit that not everyone is privy to. She's the ecological Halmos who fishes floundering lizards from the pool and worries about wetlands. She still can be seen riding her bike in the perilous environs of San Jose and not infrequently sports a Band Aid from a minor contretemps. Paul frequently, and not without cause, frets about her safety.\nIn\n1961\nHalmos moved to the University of Michigan\n[\n60\n]\n:-\nMichigan seemed an idyllic situation for Paul. There were good friends, good colleagues, good students. There was an active social life, a fine home, and a terrific Old English sheep dog\n(\nBertrand Russell\nby name\n)\n. There was good walking and there was even that miserable climate\n(\ndamp cold winters and damp hot summers\n)\non which he seemed to thrive best.\nIn\n1965\nHalmos was one of three plenary speakers at the British Mathematical Colloquium in Dundee, Scotland\n(\nthe other two were\nClaude Chevalley\nand\nArthur Erdélyi\n)\n. Halmos gave the lecture\nSome recent progress in Hilbert space.\nHe was introduced by\nFrank Bonsall\nas follows\n(\nsee\n[\n2\n]\n)\n:-\nProfessor Halmos may look like one mathematician, but in reality be is an equivalence class and has worked in several fields including algebraic logic and ergodic theory; this afternoon his representative from\nHilbert space\nwill speak to us.\nIn\n1968\n-\n69\nhe served for one year as chairman of the mathematics department of the University of Hawaii. At the end of the year he accepted a professorship at Indiana University\n[\n26\n]\n:-\nWhen he was at Indiana, he organized a seminar for mathematicians from Urbana, Lafayette, Bloomington, and all points in between. It continues to this day as the 'Wabash Extramural Functional Analysis Seminar'.\nHe remained at Indiana until\n1985\nwhen he moved to Santa Clara. G L Alexanderson writes in\n[\n1\n]\n:-\nIn early\n1984\nI received a telephone call from Paul Halmos ... during which he said, among other things, that he would like to be someplace with more sunny days. The Bloomington winter seemed long. ... I responded that ... I would think about it. When I had, I called him and asked him whether he might consider Santa Clara... I raised the question of his joining us at Santa Clara with some hesitation because, though we may have good weather, Santa Clara is not the kind of institution at which Paul had spent his career.\nHalmos is known for both his outstanding contributions to operator theory,\nergodic theory\n, functional analysis, in particular Hilbert spaces, and for his series of exceptionally well written textbooks. These include\nFinite dimensional vector spaces\n(1942)\n,\nMeasure theory\n(1950)\n,\nIntroduction to Hilbert space and theory of spectral multiplicity\n(1951)\n,\nLectures on ergodic theory\n(1956)\n,\nEntropy in ergodic theory\n(1959)\n,\nNaive set theory\n,\nAlgebraic logic\n(1962)\n,\nA Hilbert space problem book\n(1967)\nand\nLectures on Boolean algebras\n(1974)\n. For some extracts from reviews of some of Halmos's books see\nTHIS LINK\n,  and\nTHIS LINK\n.\nIn\n1983\nhe received the Steele Prize for exposition from the\nAmerican Mathematical Society\n. The citation read:-\nThe award for a book or substantial survey or research-expository paper is made to Paul R Halmos for his many graduate texts in mathematics, dealing with finite dimensional vector spaces,\nmeasure theory\n, ergodic theory and Hilbert space. Many of these books were the first systematic presentations of their subjects in English. Their felicitous style and content has had a vast influence on the teaching of mathematics in North America. His articles on how to write, talk and publish mathematics have helped all mathematicians to communicate their ideas and results more effectively.\nHalmos has received many other awards for his writing and teaching. For example, in\n1993\n, he received a Distinguished Teacher award from the\nMathematical Association of America\n. In fact he received the\nChauvenet\nprize, the\nPolya\nprize, and two\nLester R Ford\nawards from the\nMathematical Association of America\n. For extracts from some of Halmos's \"popular\" papers on writing mathematics, teaching, the nature of mathematics etc, see\nTHIS LINK\n.\nJ B Conway writes in\n[\n1\n]\nabout Halmos's contributions to operator theory:-\n... Paul has a number of papers and theorems that anyone would be proud to call his own. But the thing that has always struck me about his work is the extraordinary number of topics and problems that are dominant themes in the current research of today and that have their origin in his work. Over the years Paul has demonstrated an uncanny ability to extract crucial properties from a given mathematical entity and lay it open before his colleagues in such a manner that there is a universal inclination to look and explore further.\nHalmos was a frequent visitor to Scotland. He attended regularly the four-yearly St Andrews Colloquium. We first met him at the\n1972\nSt Andrews Colloquium and fully agree with Alastair Gillespie's comments in\n[\n1\n]\n:-\nThese Colloquia are just the sort of things that Halmos relishes in - a happy mixture of expository mathematics and recreation - a mathematical holiday, in fact.\nHalmos spent part of his\n1973\nsabbatical leave in Edinburgh and was elected a Fellow of the\nRoyal Society of Edinburgh\n. He has also been awarded an honorary D.Sc. from the University of St Andrews.\nTogether with his wife, Halmos contributed $\n4\n,\n000\n,\n000\nfor the rebuilding of the Carriage House Conference Center in Washington D.C. in\n2002\n. He also funded\nMathematical Association of America\nprogrammes at the Carriage Center. He donated funds to support the\nMathematical Association of America\n's\nEuler\nPrize and its Halmos-Ford Prize for expository writing. Paul and Virginia Halmos also donated funds to the\nAmerican Mathematical Society\nto set up a\nJ L Doob\nPrize for outstanding expository mathematical writing.\nHalmos died in Los Gatos, California at the age of ninety after contracting pneumonia. His wife Virginia continued to live in Los Gatos where she died, aged\n99\n, on\n19\nJanuary\n2015\n. Gerald L Alexanderson writes:-\nIn her last weeks she was still listening to drafts of an upcoming book on\nG H Hardy\nand reminiscing about\nJ E Littlewood\n(\nwhom, she was proud to say, she had been seated next to at high table at Trinity\n)\n,\nFrank Smithies\nand others of\nHardy\n's era.\nLet us end this biography by quoting Halmos's reply when asked what mathematics meant to him:-\nIt is security. Certainty. Truth. Beauty. Insight. Structure. Architecture. I see mathematics, the part of human knowledge that I call mathematics, as one thing - one great, glorious thing.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}