{
  "nome_completo": "Pavel Krejčí",
  "nome_curto": "Pavel Krejčí",
  "ano_nascimento": "1954",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krejci/",
  "lugar_nascimento": "Decin, Czechoslovakia (now Czech Republic)",
  "lugar_morte": null,
  "biografia": "Pavel Krejčí\nstudied at the Lyée Alphonse Daudet, Nîmes, France, from\n1970\nto\n1973\n. This school had educated a number of leading mathematicians over the years including\nGaston Darboux\nin the\n19\nth\ncentury and\nJean-Pierre Serre\nin the\n20\nth\ncentury. He then entered the Faculty of Mathematics and Physics of the Charles University of Prague, where he studied until\n1978\n. He was awarded his RNDr. in\n1978\n. This degree, although having the same initials as doctorates awarded in many European countries, was a degree as Master's level in Czechoslovakia\n(\nand later in the Czech Republic\n)\n.\nAfter the award of his Master's degree, Krejčí became a computer programmer at the Poldi Steel Company, Kladno, Czechoslovakia. He held this position for less than a year, taking up the appointment in September\n1978\nand leaving in June\n1979\n. In the following month he returned to the academic world when he was appointed as a Researcher at the Institute for Fluid Dynamics of the\nCzechoslovak Academy of Sciences\n. He worked there until December\n1981\nwhen he became a Researcher at the Institute for Mathematics of the\nCzechoslovak Academy of Sciences\n. In\n1982\nhe published\nNormalization of relational data model\n. We give the following extract from Krejčí's own summary:-\nWe discuss a new approach to normalization of a relational data model. In the first part we define the concepts of dependency and multidependency among domains of attributes. We explain the kinds of update anomalies that can occur if there are undesirable dependencies or multidependencies in relations. We review the definition of the third normal form, i.e. a relation which does not express undesirable dependencies, and define a new form of relation, third multinormal form, which does not express undesirable multidependencies. Advantages and disadvantages of these definitions are discussed. We distinguish the two aspects of normalization - normalization with regard to values of domains and normalization concerning dependencies - and define a new normal form which is based on new concepts. In the second part we describe some approaches to normalizing relations ...\nHis next papers were\nOn solvability of equations of the\n4\nth\norder with jumping nonlinearities\n(1983)\n,\nHard implicit function theorem and small periodic solutions to partial differential equations\n(1984)\nand\nPeriodic solutions of a class of abstract nonlinear equations of the second order\n(1985)\n. He was awarded a Candidate's degree, the CSc.\n(\nequivalent to a Ph.D.\n)\n, in June\n1984\nfor his thesis\nPeriodic vibrations of the electromagnetic field in ferromagnetic media\n(\nCzech\n)\n. In this thesis he investigated the existence of periodic solutions of\nMaxwell\n's equations in nonlinear media in the\nSobolev\nspaces of divergence-free vector functions in three dimensions.\nKrejčí continued to work at the Institute of Mathematics in Prague until December\n1996\nbut during these years spent part of his time visiting other institutions. He was a visiting professor at the University of Wisconsin at Milwaukee, USA, for the last four months of\n1990\n. He held a highly prestigious Alexander von Humboldt fellowship, awarded by the German Humboldt Foundation, at the University of Kaiserslautern\n(\nOctober\n1991\n- April\n1992)\n, also at the Technische Hochschule Munich\n(\nMay\n1992\n-September\n1992)\nand again at the University of Kaiserslautern\n(\nJanuary\n1993\n-June\n1993)\n. From March to June of\n1995\nhe was a visiting professor at the  Université de Technologie de Compiègne in France. His next visit was to the\nWeierstrass\nInstitute for Applied Analysis and Stochastics  in Berlin from April to June\n1996\n. This was highly significant for in the following year he became a researcher at that Institute. He returned to Prague in January\n2001\nand spent three years there as leader of the 'Evolution equations' research group and Head of the Department of Evolution Differential Equations. He was back in the\nWeierstrass\nInstitute for Applied Analysis and Stochastics in Berlin in January\n2004\nand, in the following year, he became the deputy leader of the 'Thermodynamic Modelling and Analysis of Phase Transitions' Research group. He returned to the Institute of Mathematics of the\nCzech Academy of Sciences\n, Prague, in\n2009\nwhere he became the director of the Institute. He continued in this role until\n2014\n. Jürgen Sprekels writes\n[\n5\n]\n:-\nLooking from the outside, and having for understandable reasons a certain tendency to appreciate the accomplishments of directors, the present author does not entertain any doubt that Pavel Krejci. must have done a wonderful job indeed: the positive development of this institute in the last years is a truly outstanding piece of achievement. Today, the Institute for Mathematics of the\nCzech Academy of Sciences\nis an internationally highly recognized institution that enjoys the reputation of being a worldwide leading center of excellence in mathematics.\nIn February\n2015\n, MathSciNet lists\n120\npublications by Krejčí. Most of these papers discuss problems associated with hysteresis, for example early examples of such papers are\nHysteresis and periodic solutions of semilinear and quasilinear wave equations\n(1986)\nand\nPeriodic solutions of partial differential equations with hysteresis\n(1986)\n. Let us quote an explanation of hysteresis from\n[\n1\n]\n:-\nHysteresis is an exciting and mathematically challenging phenomenon that occurs in rather different situations: it, can be a byproduct of fundamental physical mechanisms\n(\nsuch as phase transitions\n)\nor the consequence of a degradation or imperfection\n(\nlike the play in a mechanical system\n)\n, or it is built deliberately into a system in order to monitor its behaviour, as in the case of the heat control via thermostats. The delicate interplay between memory effects and the occurrence of hysteresis loops has the effect that hysteresis is a genuinely nonlinear phenomenon which is usually non-smooth and thus not easy to treat mathematically. Hence it was only in the early seventies that the group of Russian scientists around M A Krasnoselskii initiated a systematic mathematical investigation of the phenomenon of hysteresis\nRather surprisingly, in addition to this impressive collection of publications, Krejčí has been awarded\n(\njointly with two colleagues\n)\nthe patent 'Verfahren und Vorrichtung zur Online-Kompensation von Nicht-linearitäten im Übertragungsverhalten von Stellgliedern' by the German Patent Office\n[\n5\n]\n:-\nThis patent witnesses his special ability and steady readiness to cooperate successfully with engineers and researchers from other fields of science.\nHe has also published an important book,\nHysteresis, convexity and dissipation in hyperbolic equations\n(1996)\n. We give Krejčí's Preface and a list of contents of this book at\nTHIS LINK\n.\nHe was the Principal Investigator for the project 'Mathematical modelling of processes in hysteresis materials' which ran for five years beginning in January\n2010\n. Here is Krejčí's description of this project\n(\nsee\n[\n3\n]\n)\n:-\nHysteresis, i.e., nonlinear relations exhibiting a complicated input-output behavior in form of nested loops that cannot be described by functions or graphs, occurs in many fields of science, e.g., in ferromagnetism, micromagnetics, solid-solid phase transitions, and elastoplasticity. Hysteretic systems carry a memory of their former states, which renders their input-output mapping both nondifferentiable and nonlocal in time, so that conventional weak convergence techniques for solving evolution systems fail. Therefore, dynamical elastoplastic processes with hysteresis are found in the mathematical literature much less frequently than quasistatic ones, and a substantial progress in this direction is necessary. In a recent breakthrough, it was shown that the three-dimensional single-yield\nvon Mises\nconstitutive law leads, after a dimensional reduction to beams or plates, to a multi-yield\nPrandtl\n-Ishlinskii hysteresis operator. It is in fact quite natural that the lower dimensional observer does not see any sharp transition from the purely elastic to the purely plastic regime as in the\nvon Mises\nmodel: if a plate is bent then small plasticized zones start forming first near the boundary and then propagate to the interior, which still preserves a partial elasticity. This gradual plasticizing is reflected by the\nPrandtl\n-Ishlinskii superposition of single-yield elements that are successively activated. This new groundbreaking theory will be expanded to more complex structures like Mindlin-Reissner plates, and curved rods and shells. Temperature and material fatigue effects will be included. A thermodynamically consistent theory of temperature and fatigue dependent\nPrandtl\n-Ishlinskii operators will be developed, along with efficient and reliable numerical methods. Questions of theoretical and numerical stability, and the long time behavior of the system of energy and momentum balance laws are central objectives.\nKrejčí has received prestigious awards such as the Research Award of the Minister of Education of the Czech Republic\n(2001)\n, the\nJohn von Neumann\nGuest professorship at Munich\n(2010)\n, and the\nBernard Bolzano\nHonorary Medal for Merit in Mathematical Sciences from the\nCzech Academy of Sciences\n(2014)\n. The Laudatio for the\nBernard Bolzano\nHonorary Medal states\n[\n4\n]\n:-\nPavel Krejčí made important contributions to variational inequalities, to phase transition models, and to rate-independent problems in general. But from the very beginning of his career, he established himself as one of the world leaders in the development and the application of the theory of hysteresis operators in science. Many fundamental concepts in hysteresis theory go back to him. ... beyond any doubt, Pavel Krejcci is worthy of this honour, and the\nCzech Academy of Sciences\ncan only be congratulated for the wise decision to bestow on him the\nBernard Bolzano\nHonorary Medal for Merit in Mathematical Sciences.\nLet us end with this assessment of his character by Jürgen Sprekels\n[\n5\n]\n:-\nLet us add a few words on his personality, since it is an important part of his success and definitely worth stressing: sincerity, truthfulness, integrity, fairness, reliability, sense of responsibility, tolerance, courage and steadfastness, and, last but not least, his wonderful sense of humor and self-mockery are parts of his character. No wonder that he is respected and liked everywhere.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}