{
  "nome_completo": "Percival Frost",
  "nome_curto": "Percival Frost",
  "ano_nascimento": "1817",
  "ano_morte": "1898",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frost/",
  "lugar_nascimento": "Sculcoates, Kingston upon Hull, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Percival Frost\nwas the son of Charles Frost\n(1782\n-\n1862)\nand Jane Hollingworth\n(1795\n-\n1887)\n. Charles Frost had a sister Elizabeth Frost, one year younger than he was, who wrote novels and historical romances. She married John Byron and began publishing under the name Elizabeth Byron, but he died aged\n25\n, and eight years later she married the artist Jacob George Strutt. She is probably best known today for her novels and travel guides published under the name Elizabeth Strutt.\nCharles, an\n[\n11\n]\n:-\n... antiquary, born at Kingston upon Hull, Yorkshire, and baptised there on\n3\nJanuary\n1782\n, was the son of Thomas Frost, a solicitor in that town, and his wife, Elizabeth. He followed his father's profession, and succeeded him as solicitor to the Hull Dock Company, an appointment that he held for over thirty-three years. From his father he acquired a taste for genealogical and historical research, and while still articled he gained a reputation as an expert black-letter lawyer.\nCharles married Jane Hollingworth in Holy Trinity Church, Hull, on\n22\nAugust\n1814\n. Jane, the daughter of the merchant and mayor Andrew Hollingworth and his wife Isabella Bromby, was born in Kingston upon Hull on\n19\nJanuary\n1795\n. Charles and Jane Frost had four children: Thomas Frost\n(1815\n-\n1848)\n, Isabella Frost\n(1816\n-\n1884)\n, Percival Frost\n(1817\n-\n1898)\n, the subject of this biography, and Andrew Hollingworth Frost\n(1819\n-\n1907)\n. Charles Frost was at one time Vice-President of the British Association and several times President of the Hull Literary and Philosophical Society. Percival Frost, born\n1\nSeptember\n1817\n, was baptised on\n22\nSeptember\n1817\nat All Saints Church, Sculcoates, Hull.\nPercival Frost attended Beverley School in Beverley, a town about\n12\nkm north west of the centre of Hull. Beverley School is probably the oldest State School in England. He attended this school until\n1833\nwhen he moved to Oakham School in Oakham School in Rutland. This famous school, founded in\n1584\n, had John Doncaster as headmaster at this time. Doncaster had been a pupil at Oakham School before\n[\n17\n]\n:-\n... he went up to Trinity College, Cambridge, as\nsizar\n, but migrated to Christ's College with a scholarship in\n1791\n, taking his degree three years later as\n13\nth\nWrangler\nin the mathematical tripos and first Chancellor's Medallist, becoming a Fellow of his college in\n1796\nand a Doctor of Divinity in\n1816\n.\nLet us note at this time that Frost's younger brother, Andrew Hollingworth Frost\n(\nborn in Hull on\n26\nApril\n1819)\nwas also educated at Oakham School. He studied the Mathematical Tripos at Cambridge and was\n11\nth Wrangler in\n1842\n. Andrew Frost was appointed Mathematical Master in the Manchester Free Grammar School. He joined the Church and, after serving as a curate at Burton on Trent and at Meltham Mills, Huddersfield, he became Church Missionary Society's missionary at Nasik, Bombay\n1853\n-\n69\n. Let us note here that he contributed papers to the\nQuarterly Journal of Mathematics\non \"Nasik Cubes\", a type of magic cube, and other subjects. In\n1866\nhe constructed and published the first known perfect cube\n(\nit is\n7\n×\n7\n×\n7)\n.\nPercival Frost thrived at Oakham School under John Doncaster and began his studies of the Mathematical Tripos at Gonville and Caius College, Cambridge on\n4\nApril\n1835\n. He transferred to St John's College, Cambridge on\n14\nOctober\n1835\nwhere he held a scholarship. At this time\nCharles Babbage\nwas Lucasian Professor of Mathematics and\nGeorge Peacock\nwas appointed Lowndean professor of astronomy and geometry at Cambridge in\n1836\n. His tutor at St John's College was\nJohn Hymers\nwho was, like many at Cambridge at that time, combining a career in mathematics with ordination to the Church.\nHymers\nhad been appointed a fellow of St John's College in\n1827\nand, in\n1832\n, became a tutor at the College. He was Moderator of the mathematical tripos in the years\n1833\nand\n1834\n, but was also studying divinity. He was ordained priest in\n1834\n, was awarded a B.D. in\n1836\n, became a senior fellow of St John's College in\n1838\nand in the same year was elected a fellow of the\nRoyal Society of London\n.\nThere were a number of excellent undergraduate mathematicians at St John's College in the same year as Frost. In\n1839\nhe graduated with a B.A. being ranked Second Wrangler\n(\nWrangler equals First Class degree\n)\n. In fact the top four Wranglers in the Mathematical Tripos were all students of St John's College: Senior Wrangler, Benjamin Morgan Cowie; Second Wrangler, Percival Frost; Third Wrangler, Charles Colson; and Fourth Wrangler, George Fearns Reyner. Before continuing to describe Frost's career, let us say a little about the careers of the other three Wranglers just mentioned.\nBenjamin Morgan Cowie\n(1816\n-\n1900)\nbecame a fellow of St John's College,\n1839\n-\n43\n, and was ordained a priest in\n1842\n. He was Professor of Geometry in Gresham College, then one of H.M. Inspectors of Schools,\n1857\n-\n72\n, and Dean of Manchester,\n1872\n-\n83\n. He was much involved in educational causes when in Manchester, serving as a governor of Manchester grammar school, a member of council of Owens College, and a supporter of the founding of Manchester High School for Girls. Charles Colson\n(1818\n-\n1901)\nentered the Church being ordained in\n1841\nand was vicar of Great Hormead, Hertfordshire from\n1842\nto\n1874\n. George Fearns Reyner\n(1817\n-\n1892)\nbecame a fellow and Senior Bursar of St John's College and then Rector of Staplehurst for sixteen years.\nAlthough Cowie was Senior Wrangler, it was Frost who was chosen as First Smith's Prizeman in\n1839\n. He was elected a fellow of the St John's College on\n19\nMarch\n1839\n. His tutor\nJohn Hymers\nadvised him to study law and indeed he took this advice and began his studies being admitted to the Inner Temple on\n12\nNovember\n1839\n. During the\n1840\nsummer vacation, he returned to Cambridge and coached private pupils for the Mathematical Tripos and, enjoying teaching mathematics far more than studying law, he took up full time tutoring.\nOn\n2\nJune\n1841\nFrost married Jennett Louisa Dixon, the daughter of Richard Routh Dixon and Jennett Baillie of Oak Lodge, Finchley. The wedding was in St Mary Church, Finchley, and the witnesses included Percival Frost's father Charles Frost, his brother Andrew Hollingworth Frost, his sister Isabella Frost, and the bride's father Richard Dixon. Percival and Jennett Frost had one son, Charles Frost\n(1842\n-\n1906)\nwho, from\n1876\n, called himself Charles Frost Foster. At the time of Percival Frost's marriage, the rules did not allow college fellows to be married, so Frost had to resign his fellowship at St John's College. He joined the Church, being ordained deacon at Ely in\n1841\nand ordained a priest in the following year.\nHe was a Mathematical Lecturer, first at Jesus College, Cambridge, from\n1847\nto\n1849\nand afterwards at King's College, Cambridge, from\n1860\nto\n1890\n. He was elected a Fellow of the\nRoyal Society\non\n7\nJune\n1883\nhaving been proposed by\nJ C Adams\n;\nA Cayley\n;\nN M Ferrers\n; W H Besant;\nRayleigh\n;\nI Todhunter\n;\nE J Routh\n;\nJ W L Glaisher\n; Charles C Badington; and R B Clifton. The citation for his election is as follows\n[\n10\n]\n:-\nCitation for the Revd Percival Frost. Author of the following separate Works, viz Newton's Principia, Sections I, II, III. with Notes & Illustrations.\n3\nrd Edn; Solid Geometry.\n2\nnd Edn.\n1875\n; An elementary Treatise on Curve Tracing.\n1872\n; and of numerous original papers on subjects in Pure and Applied Mathematics, published in the Cambridge and in the Cambridge & Dublin Mathematical Journal, and in the Quarterly Journal of Mathematics, including papers in Algebra, Theory of Curves, Solid Geometry, Lunar & Planetary Theories, Potentials & Attraction of Ellipsoids, Electro-Dynamics &c, &c. He is distinguished for his knowledge of Mathematical Science.\nHe was elected a Fellow of King's College, Cambridge, also in\n1883\n. In\n1882\nCambridge had introduced the degree of Sc.D., Doctor of Science, and Frost was awarded the degree in\n1883\n. Throughout his career, he privately tutored students for the Mathematical Tripos and in this he was very successful. His most famous pupil was\nWilliam Kingdon Clifford\nwho, like Frost himself, was a Second Wrangler\n[\n27\n]\n:-\nEarly in\n[\nClifford\n's\n]\ncareer at the University he read such portions of the Tripos subjects as possessed any interest for him, and soon turned his attention to the study of the original writings of\nSylvester\n,\nCayley\n,\nSalmon\n, and some of the great Continental masters. In vain did his private tutor, the Rev Percival Frost, who always had the highest admiration for him, and was anxious that he should attain his proper place in the Mathematical Tripos, urge him to devote a little more attention to examination subjects; his mind could tolerate no such restraint; nothing but the fresh and original thoughts of the greatest mathematical writers could satisfy his wants. His neglect of the examination subjects was such that it is said he only once wrote out a paper of bookwork questions, and that under the impression that he was solving problems; many also, well qualified to judge, were agreeably surprised when he obtained the position of second Wrangler in the Mathematical Tripos of\n1867\n, while his success in obtaining the second Smith's prize was doubtless anticipated from the wider scope for his talents by that examination.\nAmong the many other students Frost tutored let us mention John Rigby\n(1834\n-\n1903)\nwho studied the Mathematical Tripos at Trinity College, Cambridge, graduating as Second Wrangler in\n1856\nand also placed Second Smith's Prizeman in that year. Rigby was called to the Bar at Lincoln's Inn in\n1860\nand became a Queen's Counsel in\n1881\n. He was elected as a Liberal Member of Parliament, sitting in the House of Commons\n1885\n-\n86\nand\n1892\n-\n94\n. He resigned in\n1894\nwhen he was appointed a Lord Justice of Appeal. Frost was also the tutor of\nJoseph Wolstenholme\nwho has a biography in the MacTutor Archive.\nWolstenholme\nstudied the Mathematical Tripos at Corpus Christi College and was Third Wrangler in\n1850\n. The First Wrangler in that year was William Henry Besant\n(1828\n-\n1917)\n, who became a lecturer at Cambridge teaching\nWilliam Burnside\nand\nGeorge Ballard Mathews\n, and the Second Wrangler was Henry William Watson. Frost was also tutor to the Senior Wrangler Augustus Vaughton Hadley of\n1856\n. Hadley became a clergyman and H.M. Inspector of Schools but died aged\n33\nin\n1867\n.\nIt is, perhaps, as an author of textbooks that Frost is best remembered today. He published three mathematics books, all of which have run to several editions. These were mentioned in the citation for his election to the\nRoyal Society of London\n(\nsee above\n)\n. The first editions of these are:\nNewton's Principia, Sections\nI, II, III\nwith Notes and Illustrations also A collection of problems principally intended as examples of Newton's methods\n(1854)\n;\n(\nwith\nJoseph Wolstenholme\n)\nA Treatise of Solid Geometry\n(1863)\n; and\nAn Elementary Treatise on Curve Tracing\n(1872)\n. The first of these,\nNewton's Principia\n, ran to three editions, the second being in\n1863\nand the third in\n1880\n. Changes in these editions are minimal. He writes in the Preface to the Third Edition of\n1880\n:-\nIn this edition I have introduced some notes on the geometrical solution of some problems relating to maxima and minima, and I have placed the investigations of the properties of the curves, which, after the conic sections, are the best examples for illustrating geometrical methods, in a more prominent position, at the end of the first section.\nIt was republished by\nForgotten Books\nin\n2018\nand, remarkably, the\nAmazon\nwebsite still\n(\nin\n2024)\nclaims to sell new copies of the\n1863\nedition. You can read the Preface to the first two editions at\nTHIS LINK\n.\nFrost co-authored\nA Treatise of Solid Geometry\nwith\nJoseph Wolstenholme\nand the joint work was published in\n1863\n. The Second Edition of\n1875\nis, however, a single authored work by Frost. He explains the reason in the Preface:-\nIt was with a feeling of great discouragement that I began the preparation of another Edition of this work, deprived, as I was, of the valuable assistance of my friend Mr\nWolstenholme\n, in working with whom I had had so much pleasure while writing the First Edition. Mr\nWolstenholme\n, who is now Professor of Mathematics in the Royal Indian Engineering College at Cooper's Hill, thought that there would be great difficulty in carrying on this work satisfactorily by correspondence, even if the important duties in which he is engaged did not fully occupy his time; I was, therefore, reluctantly obliged to undertake the whole labour of remodelling our original work.\nThis edition was republished by\nBiblioBazaar\nin\n2009\nand new copies, both hardback and paperback, are still available today\n(2024)\nat\nAmazon\n. For the Preface of the\n1863\n, the\n1875\nand the\n1886\neditions, see\nTHIS LINK\n.\nWe should note that Frost published\nHints for the Solution of Problems in the Third Edition of Solid Geometry\nin\n1887\n. He writes in the Preface:-\nThe fulfilment of my promise to give an appendix, containing solutions or hints for the solution of all the problems given in my Third Edition of Solid Geometry, has entailed much labour; but this labour will not have been thrown away if it should in any degree have added to the usefulness of the book; at all events it has enabled me to detect many errors and omissions in the statement of the problems which might have given trouble to the student.\nThe third book by Frost which we mentioned above is\nAn Elementary Treatise on Curve Tracing.\nA second edition was published by Frost in\n1892\n. In\n1918\na Fourth Edition was published, revised by the Scottish mathematician\nRobert John Tainsh Bell\n. Harold Hilton writes in the review\n[\n13\n]\n:-\nDoubtless many will welcome this new edition of an old friend of\n1872\n, to which has been added an index and classified list of curves. But perhaps the reviewer may be forgiven for a wish that Dr\nBell\nhad undertaken the bolder task of entirely reconstructing Dr Frost's material and bringing the whole up to date. It seems that the book was originally intended to provide interest and exercise for the student before he enters on the study of the calculus, mechanics, and the field of the Physical Sciences. Such a suggestion now appears to emanate from another world, and the dodges employed by Dr Frost to avoid the use of the calculus are fortunately quite obsolete.\nA fifth edition of this book was published by the\nChelsea Publishing Company\nin\n1960\n, almost a hundred years after it was written. In\n2012\nRareBooksClub reprinted the\n1892\nedition. You can read the Preface to the\n1872\nedition at\nTHIS LINK\n.\nHenry Arthur Morgan recalls in\n[\n15\n]\nand\n[\n16\n]\nother aspects of Frost's interests and abilities:-\nBut it was not only in Mathematics that Dr Frost's talents lay. On the contrary he was a many sided man. He found pleasure in music and painting, and had read widely. I remember when at Heidelberg he said he was ready to challenge any German there to a match in playing Bach's music at sight. His pretty water colour sketching was also an unceasing source of delight in his vacations spent on the Continent and elsewhere. He was also a very skilful billiard player with a thorough knowledge of the science of the game, an accomplished chess player, and before he was troubled by lameness brought on by sciatica, the result probably of sitting on damp ground, he took much active exercise and was proficient as a tennis player, in cricket, in running and swimming.\nThe following account is given in\n[\n21\n]\nabout Frost and cricket:-\n\"While at Cambridge,\" says Mr McCormick, \"I was one day playing on Parker's Piece, and Percival Frost, the celebrated mathematician, was in with me. I hit a very  fast bowler hard to leg and ran\n9\nfor it. It took three men to throw the ball up. Visiting Cambridge only a few months before Frost's death, he said at a dinner-party, \"I remember one of your hits, when you nearly killed me with running! That was the hit for\n9\n.\"\nJohn Robert Lunn\n(1831\n-\n1899)\nwas Fourth Wrangler in the Mathematical Tripos in\n1853\n. He was ordained a deacon in\n1855\nand a priest in the following year. He was elected a fellow of St John's College and was Sadleirian Lecturer of Pure Mathematics\n1857\n-\n1864\n. Lunn was a remarkably talented musician and, during the years that he was at St John's College, Frost would often visit his rooms and the two would enjoy sharing music and conversation. Lunn's obituary\n[\n24\n]\ncontains the following:-\nIt is acknowledged that he and the late Mr Percival Frost were the first amateur Bach performers in England ...\nIn\n1891\nFrost and his wife celebrated their golden wedding. The\nHull Daily Mail\ncontained a report which begins as follows\n[\n1\n]\n:-\nThe Fellows' Gardens of King's College were the scene of no less an auspicious and almost unique event than the celebrating of the golden wedding of Dr Frost\n(\nthe Senior Fellow of King's\n)\nand Mrs Frost, whose popularity has won for them a large circle of friends, in both town and University. Some\n350\nladies and gentlemen, including several of the masters of the College, as well as gentry of the neighbourhood, attended the festivities, and were well received by the happy and favoured couple in a marquee, handsomely furnished in drawing room style. Many were the token of congratulation tendered to Dr and Mrs Frost, and the more valuable presents consisted of a pair of gold candlesticks, gold cup, a gold chain and truss, and a gold workbox. The pleasant proceedings were brought to an ultimate termination by a heavy rain shortly after\n5\n.\n30\n, which necessitated a hasty retreat to some substantial shelter.\nFor the whole of this report and four obituaries of Frost, see\nTHIS LINK\n.\nFrost died at Cambridge on\n5\nJune\n1898\n, in his house at\n15\nFitzwilliam Street, and was buried on\n10\nJune in the Mill Road cemetery. His grave lies in the parish area of St Mary the Less and is located on the north side of the path leading from the centre circle to the east path. The inscription on his grave reads\n[\n14\n]\n:-\nTo the dear memory of the Rev Dr Percival Frost F.R.S. Fellow of King's College Cambridge born Sept\n1\n1817\ndied Trinity Sunday June\n5\n1898\n. \"The souls of the righteous are in the hand of God and there shall no torment touch them. Wisdom\n[3\n.\n1]\n\"\nHis wife Jennett Louise Frost died on Epiphany Sunday,\n6\nJanuary\n1901\n, aged\n82\n. She is buried in the same grave as her husband.\nLet us end by clearing up some confusion.\nThe Online Books Page\ngives publications by Percival Frost but the list gives books by two different authors with the same name. The confusion is totally understandable since both wrote under the name \"Rev Percival Frost, M.A., Late Fellow of St John's College.\" The mathematics texts are, of course, by the subject of this biography, but those involving translation from Greek and Latin are by a different Percival Frost. This Percival Frost\n(1825\n-\n1877)\nwas born in Hull on\n15\nOctober\n1825\n, the son of the master mariner Samuel Frost. He studied classics at St John's College, was awarded a B.A. in\n1848\n, and was ordained a priest in\n1849\n. The confusion is increased by the fact that, in\n1850\n, he married Fanny Dixon, the younger sister of Jennett, the wife of the mathematician Percival Frost.",
  "math_areas": [
    "Calculus",
    "Geometry"
  ]
}