{
  "nome_completo": "Peter David Lax",
  "nome_curto": "Peter Lax",
  "ano_nascimento": "1926",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lax_Peter/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": null,
  "biografia": "Peter Lax\nwas born into a Jewish family in Budapest. His mother was Klara Kornfeld and his father was Henry Lax who was a medical doctor. In Peter's high school studies, mathematical problem solving was specifically encouraged and it certainly stimulated his interest as it did for many other talented Hungarian students at this time.\nDenes König\n, who was professor at the Technical University of Budapest, did a great deal to help talented youngsters like Peter Lax. He and\nRózsa Péter\nacted as mentors to the young boy. Before we continue, however, we should try to understand the political events which led to the Lax family emigrating to the United States in\n1941\n.\nHungary had been aligned with Germany through World War I and after the country surrendered in\n1918\nthey went on to sign the Treaty of Trianon which reduced Hungary to a third of its previous size. Three million Hungarians suddenly found themselves citizens of another country. It was largely a desire to recover these territories that pushed Hungary towards the German-Italian alliance around\n1936\n. Anti-Semitism was already widespread in Hungary but closer ties with the extreme anti-Semitic Nazis made the situation much worse for Hungarian Jews like the Lax family. Jewish Laws were passed, partly to please Hitler, and Hungary seemed to be achieving its territorial objectives with the Vienna Awards of\n1938\nand\n1940\nwhich returned some of its lands. World War II began in\n1939\nbut Hungary remained out of the conflict until\n1941\nwhen it entered the war against Russia on the side of Germany.\nIn one way the Lax family were lucky. Henry Lax, Peter's father, was a doctor who had the American consul in Budapest as one of his patients, and perhaps more importantly the two were good friends. The road that Hungary was taking was clear to the Lax family so Henry and Klara arranged through the American consul to emigrate to the United States. They left Budapest in late November of\n1941\ntogether with Peter and his brother\n[\n6\n]\n:-\n... we went by train across Europe, through Germany in train compartments filled with Wehrmacht troops. We sailed for America from Lisbon on\n5\nDecember\n1941\n. While we were on the high seas, the war broke out. So we left as immigrants and arrived in New York as enemy aliens\n.\nIndeed Japan attacked Pearl Harbour on\n7\nDecember, Britain declared war on Hungary, and Hungary declared war on the United States. Arriving in the United States, Lax was soon visited in his home by\nvon Neumann\nwho had been told by\nDenes König\nthat this really outstanding young Hungarian mathematician was coming. Despite being an 'enemy alien' Lax was able to continue his education\n[\n6\n]\n:-\nWithin a month, my brother and I were in high school. I went to Stuyvesant. I didn't take any mathematics courses at Stuyvesant. I knew more than most of the teachers. But I had to take English and American history, and I quickly fell in love with America.\nThree years later, in\n1944\n, he was drafted into the United States Army and spent six very pleasant months at Texas A&M at an Army training programme in engineering then, instead of being shipped overseas to fight, he was sent to Los Alamos in\n1945\nto participate in the Manhattan Project building the first atomic bomb. Of course, it seems strange that a young immigrant from a country at war with the United States would participate in this top-secret project. However, there were not enough highly trained American scientists and so many recent immigrants were needed to fill the gap.\nLax was involved in the Los Alamos Scientific Laboratory Manhattan Project during\n1945\n-\n46\n. He then took a summer course with\nPólya\nin the summer of\n1946\nbefore obtaining his first degree from New York University in\n1947\n. While studying for his doctorate, Lax married Anneli Cahn in\n1948\n. He received his PhD in\n1949\n, also from New York University, for his thesis\nNonlinear System of Hyperbolic Partial Differential Equations in Two Independent Variables\n.\nKurt Friedrichs\nhad been his thesis advisor. Lax then returned to Los Alamos to spend\n1950\nworking at the Scientific Laboratory as a Staff Member on the Manhattan Project\n(\n[\n9\n]\nand\n[\n10\n]\n)\n:-\nThe first time I spent in Los Alamos, and especially the later exposure, shaped my mathematical thinking. First of all, it was the experience of being part of a scientific team - not just of mathematicians, but people with different outlooks - with the aim being not a theorem, but a product. One cannot learn that from books, one must be a participant ... Secondly, it was there - that was in the\n1950\ns - that I became imbued with the utter importance of computing for science and mathematics. Los Alamos, under the influence of\nvon Neumann\n, was for a while in the\n1950\ns and the early\n1960\ns the undisputed leader in computational science.\nLax was appointed as an Assistant Professor at New York University\n1951\n. His wife Anneli was also a mathematician and she studied at New York University where her doctorate was supervised by\nCourant\n. She was awarded a PhD in\n1955\nfor her thesis\nCauchy's Problem for a Partial Differential Equation with Real Multiple Characteristics\n. In\n1958\nLax was a Fulbright Lecturer in Germany and in the same year he was promoted to full professor at New York University.\nLax had made remarkable contributions early in his career and he continued to produce research which changed the direction of many areas of mathematics. In\n1957\nhe published an extremely important paper\nAsymptotic solutions of oscillating initial value problems\nwhere the beginnings of the theory of\nFourier\nintegral operators appears. Asked what was so novel about the viewpoint that made the ideas able to enjoy such wide application, Lax replied\n(\n[\n9\n]\nand\n[\n10\n]\n)\n:-\nIt is a micro-local description of what is going on. It combines looking at the problem in the large and in the small. It combines both aspects, and that gives it its strengths. The numerical implementation of the micro-local point of view is by wavelets and similar approaches, which are very powerful numerically.\nWhen\nCourant\nnominated Lax for membership of the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1962\nhe described him as:-\n... embodying, as few others do, the unity of abstract mathematical analysis with the most concrete power in solving individual problems.\nLax thrived in the\nCourant\nInstitute of Mathematical Sciences New York University where applied mathematics was studied alongside relevant pure mathematics in an exciting mix of ideas which led to great progress. He was appointed director of the Institute in\n1972\n, continuing in this role until\n1980\n. It was a particularly difficult time to take on this role since New York University had just closed down their School of Engineering, moving the mathematicians from that School into the\nCourant\nInstitute. This produced friction when these people wanted to set up their own computing department while a new Computer Science Department had just been founded. Lax succeeded in ensuring that there were not two rival departments in the Institute, but the politics involved was difficult.\nIn\n2005\nLax was awarded the highly prestigious\nAbel\nPrize. The Prize was awarded to Lax:-\n... for his groundbreaking contributions to the theory and application of partial differential equations and to the computation of their solutions.\nHowever, a much fuller description of his quite outstanding achievements was given in the citation and we quote from this as it gives a particularly good summary of his work. We should remark that the difficulty in giving a description of Lax's contributions is that they are so numerous and important that in an article of this length it is impossible to do them justice. The\nAbel\nPrize citation which we quote, while still only covering a part of his work, still gives a good indication:-\nThe equations that arise in such fields as aerodynamics, meteorology and elasticity are nonlinear and much more complex: their solutions can develop singularities. Think of the shock waves that appear when an airplane breaks the sound barrier. In the\n1950\ns and\n1960\ns, Lax laid the foundations for the modern theory of nonlinear equations of this type\n(\nhyperbolic systems\n)\n. He constructed explicit solutions, identified classes of especially well-behaved systems, introduced an important notion of entropy, and, with Glimm, made a penetrating study of how solutions behave over a long period of time. In addition, he introduced the widely used Lax-Friedrichs and Lax-Wendroff numerical schemes for computing solutions. His work in this area was important for the further theoretical developments. It has also been extraordinarily fruitful for practical applications, from weather prediction to airplane design. Another important cornerstone of modern numerical analysis is the 'Lax Equivalence Theorem'. Inspired by Richtmyer, Lax established with this theorem the conditions under which a numerical implementation gives a valid approximation to the solution of a differential equation. This result brought enormous clarity to the subject. ... Integrable systems have been studied since the\n19\nth\ncentury and are important in pure as well as applied mathematics. In the late\n1960\ns a revolution occurred when\nKruskal\nand co-workers discovered a new family of examples, which have \"soliton\" solutions: single-crested waves that maintain their shape as they travel. Lax became fascinated by these mysterious solutions and found a unifying concept for understanding them, rewriting the equations in terms of what are now called \"Lax pairs\". This developed into an essential tool for the whole field, leading to new constructions of integrable systems and facilitating their study. Scattering theory is concerned with the change in a wave as it goes around an obstacle. This phenomenon occurs not only for fluids, but also, for instance, in atomic physics\n(\nSchrödinger\nequation\n)\n. Together with Phillips, Lax developed a broad theory of scattering and described the long-term behaviour of solutions\n(\nspecifically, the decay of energy\n)\n. Their work also turned out to be important in fields of mathematics apparently very distant from differential equations, such as number theory. This is an unusual and very beautiful example of a framework built for applied mathematics leading to new insights within pure mathematics.\nLet us now look briefly at some books which Lax wrote. He collaborated with Ralph S Phillips in writing\nScattering theory\npublished in\n1967\n. Teruo Ikebe wrote in a review:-\nThis is a well-organized treatment of scattering theory for the time evolution of systems of hyperbolic type. The presentation is clear and instructive.\nA second edition appeared in\n1989\nand the following extract is taken from the authors Preface:-\nIn this monograph, written more than twenty years ago, we based our scattering theory on the wave equation rather than the\nSchrödinger\nequation. That choice seemed eccentric then but appears much more natural today, as does our preference for the translation representation over the spectral representation. This change was brought about by a wealth of new results discovered in the intervening years ... An entirely new set of problems originated in the work of\nFaddeev\nand Pavlov. Following up on a hint in\nGelfand\n's address to the\n1962\nStockholm International Congress, they showed that the Lax-Phillips scattering theory, applied to the wave equation appropriate to hyperbolic space, is a natural tool in the theory of automorphic functions.\nIn fact the use of scattering theory for automorphic functions was studied by Lax and Phillips in\nScattering theory for automorphic functions\n(1976)\n. However, Lax published other books between these two texts on scattering theory. In\n1970\nLax and Glimm published\nDecay of solutions of systems of nonlinear hyperbolic conservation laws\n, a difficult work which requires familiarity with earlier work of both authors. In\n1972\nLax, together with his wife Annelli Lax and Samuel Burstein, wrote\nCalculus with applications and computing\n. A reviewer wrote:-\nThe calculus material in this book is fairly standard\n(\nexcept that it is oriented towards applications\n)\nbut the computing flavour is unorthodox, successful and highly recommended.\nHowever, this undergraduate text was not a great commercial success. Lax himself said\n(\n[\n9\n]\nand\n[\n10\n]\n)\n:-\n[\nAnneli and my\n]\ncalculus book was enormously unsuccessful, in spite of containing many excellent ideas. Part of the reason was that certain materials were not presented in a fashion that students could absorb. A calculus book has to be fine-tuned, and I didn't have the patience for it. Anneli would have had it, but I bullied her too much, I am afraid. Sometimes I dream of redoing it because the ideas that were in there, and that I have had since, are still valid.\nSIAM\npublished Lax's\nHyperbolic systems of conservation laws and the mathematical theory of shock waves\nin their Conference Series in Applied Mathematics in\n1973\n. Lax wrote\nLinear algebra\nin\n1997\n. The Preface to this book tells us much about Lax's thinking and his approach to mathematics so we quote fully his own words:-\nThis book is based on a lecture course designed for entering graduate students and given over a number of years at the\nCourant\nInstitute of New York University. Fifty years ago, linear algebra was on its way out as a subject for research. Yet during the past five decades there has been an unprecedented outburst of new ideas about how to solve linear equations, carry out least square procedures, tackle systems of linear inequalities, and find eigenvalues of matrices. This outburst came in response to the opportunity created by the availability of ever faster computers with ever larger memories. Thus, linear algebra was thrust centre stage in numerical mathematics. This had a profound effect, partly good, partly bad, on how the subject is taught today.\nThe presentation of new numerical methods brought fresh and exciting material, as well as realistic new applications, to the classroom. Many students, after all, are in a linear algebra class only for the applications. On the other hand, bringing applications and algorithms to the foreground has obscured the structure of linear algebra - a trend I deplore; it does students a great disservice to exclude them from the paradise created by\nEmmy Noether\nand\nEmil Artin\n. One of the aims of this book is to redress this imbalance.\nMy second aim in writing this book is to present a rich selection of analytical results and some of their applications: matrix inequalities, estimates for eigenvalues and\ndeterminants\n, and so on. This beautiful aspect of linear algebra, so useful for working analysts and physicists, is often neglected in texts.\nI strove to choose proofs that are revealing, elegant, and short. When there are two different ways of viewing a problem, I like to present both.\nA fairly recent book by Lax is\nFunctional analysis\n(2002)\nwhich, like the linear algebra text, grew out of graduate lectures that Lax gave at the\nCourant\nInstitute over many years.\nTo list all the honours that have been given to Lax takes up quite a bit of space. However we shall try to make it fairly complete.\nHe was elected to :\nthe\nAcademy of Sciences\n(\nParis\n)\n(1982)\n,\nthe\nNational Academy of Sciences\n(\nUnited States\n)\n(1982)\n,\nthe\nAmerican Academy of Arts and Sciences\n(1982)\n,\nthe\nNew York Academy of Sciences\n(1982)\n,\nthe\nRussian Academy of Sciences\n(1989)\n,\nthe\nHungarian Academy of Sciences\n(1993)\n,\nthe\nAcademia Sinica\n, Beijing\n(1993)\n,\nthe\nMoscow Mathematical Society\n(1995)\n,\nthe\nLondon Mathematical Society\n.\nHe was awarded:\nthe Lester R Ford Award\n(1966\nand\n1973)\n,\nthe\nChauvenet\nPrize\n(\nMathematical Association of America\n,\n1974)\n,\nthe\nNorbert Wiener\nPrize\n(\nAmerican Mathematical Society\nand\nSociety of Industrial and Applied Mathematics\n,\n1975)\n,\nthe\nNational Academy of Sciences\n(\nUnited States\n)\nAward in Applied Mathematics and Numerical Sciences\n(1983)\n,\nthe National Medal of Science\n(1986)\n,\nthe Wolf Prize\n(\nThe Wolf Foundation,\n1987)\n,\nthe Leroy Steele Prize\n(\nAmerican Mathematical Society\n,\n1992)\n,\nthe\nAbel\nPrize\n(\nNorway,\n2005)\n.\nHe was awarded honorary degrees by:\nKent State University\n(1975)\n,\nthe University of Paris\n(1979)\n,\nRWTH Aachen\n(1988)\n,\nHeriot-Watt University\n(1990)\n,\nTel Aviv University\n(1992)\n,\nthe University of Maryland, Baltimore\n(1993)\n,\nBrown University\n(1993)\n,\nBeijing University\n(1993)\n,\nTexas A&M University\n(2000)\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}