{
  "nome_completo": "Philip Edward Bertrand Jourdain",
  "nome_curto": "Philip Jourdain",
  "ano_nascimento": "1879",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jourdain/",
  "lugar_nascimento": "Ashbourne, Derbyshire, England",
  "lugar_morte": "Crookham, Hampshire, England",
  "biografia": "Philip Jourdain\n's mother was Emily Clay and his father was Francis Jourdain, who was the vicar of Ashbourne in Derbyshire. Philip was born into a large family in the vicarage at Ashbourne. He suffered from severe disabilities all his life caused by Friedreich's ataxia. As a young boy he showed a marked aptitude for both mathematics and mechanical inventions. He attended Cheltenham College where he was already finding it difficult to walk and was essentially a cripple by the time he went up to Cambridge in\n1898\n. It was clear that he would struggle to cope with life at university with this illness which was progressive but only slowly so. His undergraduate years were very difficult and he had great successes and great disappointments. One of the highlights was a course on mathematical logic given by\nRussell\nwhich strongly influenced Jourdain. However, he did very poorly in his degree and, unable to take part two of the Mathematical Tripos due to illness, had to settle for only a pass degree. However he received an honourable mention in the competition for the Smith's prizes and he was awarded the Allen studentship for research in\n1904\n.\nInspired by\nRussell\n, Jourdain worked mainly in mathematical logic. He wrote a number of articles, between\n1906\nand\n1913\n, explaining and evaluating\nCantor\n's set theory under the title\nDevelopment of the Theory of Transfinite Numbers\n. In his work he clarified a remark by\nRussell\nand formulated precisely the paradox of the largest ordinal. In\n1913\nJourdain proposed the card paradox. This was a card on one side of which was printed:-\nThe sentence on the other side of this card is TRUE.\nOn the other side of the card the sentence read:-\nThe sentence on the other side of this card is FALSE.\nOther papers which he wrote on mathematical logic and the foundations of set theory include\nOn the question of the existence of transfinite numbers\nwhich was published in the\nProceedings of the London Mathematical Society\nin\n1907\n.\nJourdain also applied logic to physics in papers such as\nOn some Points in the Foundation of Mathematical Physics\nwhich was published in\nThe Monist\nin\n1908\n. In this paper he applied results from his earlier work\nOn the general theory of functions\nto study causality in physics. Other papers relating to physics include\nOn those principles of mechanics which depend upon processes of variation\n(1908)\n,\nThe principle of least action\n(1913)\n, and\nThe influence of\nFourier\n's\ntheory on the conduction of heat on the development of pure mathematics\n(1917)\n.\nWe quote from\n[\n6\n]\na description of Jourdain's many other contributions to mathematics:-\nHis disinterested and efficient work in abstracting mathematical papers for the \"Revue Semestrielle\", and in writing the \"Recent advances\" in Science Progress, are examples of his labours for the advancement of mathematics. His extensive correspondence on mathematical subjects with eminent mathematicians of all nationalities shows that he was in touch with mathematical thought all over the world. The plans which he was lately elaborating for the advancement of science were to ensure the translation of all scientific papers and articles into English and French. As another example of his activities, we may refer to his attempts to republish the works of\nNewton\n. Jourdain was recognised as the leading authority on\nNewton\n, and had done a large amount of research, with a view to publication of a new edition. This is hardly the place to describe in detail his other activities, such as his editorship of \"The Monist\" and the International Journal of Ethics, his many researches into the history of science, and his important work on induction and probability, which was in course of publication in \"Mind\". We must, however, mention that Jourdain had in preparation a large work on \"The History of Mathematical Thought\". It is quite evident that, with his intimate knowledge of foreign languages, and his keen interest in the evolution of abstract ideas, he was the ideal author of such a book.\nJourdain married Laura Insull on\n26\nJune\n1915\n. He continued to work despite his severe disabilities and his wife now acted as a secretary to him. Many sufferers of Friedreich's ataxia do not survive past their twenties so, given his condition, Jourdain did remarkably well to live until he was only days short of his\n40\nth\nbirthday. However he spent his final years in increasing difficult circumstances as the paralysis became increasingly severe. He died at his home in Crookham.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}