{
  "nome_completo": "Philippa Garrett Fawcett",
  "nome_curto": "Philippa Fawcett",
  "ano_nascimento": "1868",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fawcett/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "London, England",
  "biografia": "Philippa Fawcett\n's parents were Henry Fawcett and Millicent Garrett and in many ways they are more famous than their daughter Philippa. Millicent Garrett also had a famous older sister Elizabeth Garrett Anderson, who was a pioneer of women in medicine\n(\nthe first woman to graduate from the University of St Andrews\n)\nand struggled to be allowed to practise as a doctor. Millicent married Henry Fawcett in April\n1867\n. Henry had studied at Cambridge where he had taken Part I of the Mathematical Tripos but after this had moved towards economics and politics. Blinded by his father in a shooting accident in\n1858\n, Henry Fawcett became Professor of Political Economy at Cambridge in\n1863\nand was elected a Member of Parliament for Brighton two years later. After the marriage Millicent helped Henry to carry out his duties despite the fact that he was blind, while Henry supported Millicent's work for women's rights.\nHenry and Millicent had one child Philippa who was born in\n1868\n, the year that Millicent made her first speech on the subject of woman suffrage. Millicent also played a role in founding Newnham College, Cambridge\n(\none of the earliest English university colleges for women\n)\n, which was established in\n1871\nafter two years of planning. Perhaps it is significant that when Millicent Fawcett published her autobiography\nWhat I Remember\nin\n1924\n[\n2\n]\n, she did not mention the birth of her daughter Philippa. However she does mention that the two year old Philippa was present at the meetings which discussed the setting up of Newnham College:-\n... brought in at the tea-drinking stage at the end of the proceedings and to toddle about in her white frock and blue sash amongst the guests.\nPhilippa Fawcett had a fairly unremarkable childhood despite the fact that her parents were leading national figures. She played with dolls, a dog, and a wooden horse on wheels. Education came fairly early, however, provided by Jane Smith a school teacher who studied at Newnham College in\n1872\n. She was a family friend to the Fawcetts and came to their home often to read to Henry. While in the Fawcett's Cambridge home she would teach young Philippa, giving her a solid educational foundation.\nHenry Fawcett lost his parliamentary seat in Brighton but after this he was returned to parliament when elected to represent Hackney in the county of Middlesex, a borough of London. The Fawcetts then had homes both in Cambridge and in London, living in the capital at\n51\nThe Lawn, Lambeth. Philippa's school education was in London where she attended Clapham Middle School and then Clapham High School. Of course with parents who spent part of their time in London and part in Cambridge, some living arrangements had to be made for Philippa since Clapham High School was an Independent Day School. In fact she lived with her parents when they were in London, but lived with a family in Worcester Park when her parents were living in Cambridge. It was not the most convenient of arrangements, for Philippa had to walk two miles from her parents' home to reach Clapham High School.\nAt the age of fifteen Philippa was showing such outstanding ability at mathematics that her parents employed a mathematics tutor. However, in the following year her father Henry Fawcett died. She also began to attend mathematics lectures both at Bedford College, the first British university to grant degrees to women\n(\nwhich was later affiliated to the University of London\n)\n, and at University College London where she studied pure and applied mathematics from\n1885\nto\n1887\n. In fact after the death of her father, her mother began to take an ever increasing political role in the movement for women's suffrage in England. When her daughter's excellent examination results were announced in\n1887\n, Millicent was attending the Bayreuth Music Festival which had been inaugurated in a specially built opera house ten years earlier by the composer Richard Wagner to provide a setting for his operas and music dramas. Philippa Fawcett's outstanding results in algebra and geometry led to her being awarded a Gilchrist scholarship to study mathematics at Newnham College, Cambridge, the women's College that her mother had helped to found.\nAt Newnham Fawcett worked hard on her mathematical studies\n[\n3\n]\n:-\nPhilippa put in a regular day's work of six hours, very rarely exceeded. She was coached by Mr E W\nHobson\nof Christ's ... She also took a keen interest in physics, attending the practicals conducted by J J Thompson, who was then experimenting with the passage of electricity through gases, on the way to discovering the electron.\nHowever, she also had varied interests outside her academic work. She played hockey for the Newnham team and took part in the College debates. Despite showing remarkable mathematical talents, she was in other respects quiet and rather ordinary. Alice Gardner wrote in her\nShort History of Newnham\n:-\nBesides being one to whose brilliant mathematical powers the highest honours were due,\n[\nFawcett\n]\nwas a singularly suitable person for this distinction in that she exemplified so many of the qualities popularly supposed absent from the character of a university woman. She was modest and retiring almost to a fault, trying, though not always successfully, to counteract the impression made by her personality, so as to appear like a very ordinary person.\nFawcett's performance in the Trinity Intercollege Examination which she sat after two years at Cambridge was outstanding and it was clear that she would excel in the Tripos Examinations of\n1890\n. At this time only the men were ranked in the Tripos Examination but women who took the examination were made aware of their place by being told they were placed between the\nn\nn\nn\nth and\n(\nn\n+\n1\n)\n(n+1)\n(\nn\n+\n1\n)\nst man or equal to the\nn\nn\nn\nth man. Expectations were high that Fawcett would perform well and her mother wrote in a letter to a friend\n(\nsee for example\n[\n3\n]\n)\n:-\nI am going to Cambridge tomorrow week and shall have my last sight of\n[\nPhilippa\n]\ntill after the exam. I have made up my mind not to be too anxious about it. There are a great many better things in the world than beating other people in examinations.\nHowever, beat other people is exactly what Fawcett did in the twelve three hour examination papers. The Senior Moderator of the Mathematical Tripos Examinations of\n1890\nwas\nWalter Rouse Ball\nand it was his duty to read the women's list after the men's ranked list had been read. When\nRouse Ball\ncame to read the women's list he read out first:-\nMiss Philippa Garrett Fawcett - above the Senior\nWrangler\n.\nFawcett had become the first woman at Cambridge to come top in the Mathematical Tripos Examinations. A description of the event is recorded in the North Hall Diary of Newnham College:-\nThe great event of the year was Philippa Garrett Fawcet's achievement in the Mathematical Tripos. For the first time a woman has been placed above the Senior Wrangler. The excitement in the Senate House when the lists were read was unparalleled. The deafening cheers of the throng of undergraduates redoubled as Miss Fawcett left the Senate House by the side of the Principal. On her arrival at the College she was enthusiastically greeted by a crowd of fellow-students, and carried in triumph into Clough Hall. Flowers, letters, and telegrams poured in upon her throughout the day. The College was profusely decorated with flags. In the evening the whole College dined in Clough Hall. After dinner toasts were proposed: the healths drunk were those of the Principal, Miss Fawcett, her Coach\n(\nMr\nHobson\n)\nand Senior and Junior Optimes. At\n9\n.\n30\np.m. the College gardens were illuminated, and a bonfire was lighted on the hockey-ground, round which Miss Fawcett was three times carried amid shouts of triumph and strains of \"For she's a jolly good fellow.\"\nMillicent Fawcett, ever conscious of her role supporting women's suffrage, wrote of her daughter's success:-\nThe news on Saturday made me very happy. You will know that I care for it mainly for the sake of women; but of course I also feel blessed in the fact that the thing I care most of all for has been helped on in this way by my own dear child.\nAfter taking Part II of the Mathematical Tripos, when she was placed in the first division of the first class, Fawcett was awarded the Marion Kennedy Scholarship which allowed her to undertake research at Cambridge for one year. She published one research article as a result of her work in that year. It was on the motion of a helical body in a liquid and appeared in the\nQuarterly Journal of Applied Mathematics\n.\nAfter one year of research Fawcett was appointed as a lecturer at Newnham College. One of her students remembered her lectures for the\n[\n3\n]\n:-\n... speed, concentration and her infectious delight in what she was teaching, and also her patience with students who were trying their hardest.\nHowever she looked for more out of life than a career as a mathematics lecturer at Newnham College and she took a break to spend nine months travelling, leaving in November\n1899\nand reaching India and Japan. Two years previously her mother had become president of the National Union of Women's Suffrage Societies. Then, in July\n1901\nat the time of the Boer War, Millicent Fawcett was sent by the British Government to report on the British concentration camps for Boer civilians. Philippa accompanied her mother on the fact finding mission. It was to be a significant event in her life.\nIn South Africa she saw that those in the concentration camps were keen to receive an education. Here she felt was something that she could contribute to, and after returning to Cambridge she applied to South Africa for permission to return to the country to help set up an education system in the Transvaal. Once the permission was granted she resigned her position and Newnham and returned to South Africa in July\n1902\nhaving been appointed as a lecturer in mathematics at the Normal School in Johannesburg. There she trained mathematics teachers. Sir Fabian Ware writes in\n[\n1\n]\n:-\nWhen she returned to South Africa in\n1902\nshe was appointed private secretary to the acting Director of Education. In that capacity she was mainly concerned with the development of a system of farm schools which would meet the demands of the Boer population scattered throughout the veldt. For these schools to command the confidence of those with whom we had very recently been at war it was necessary that all British officials employed in this work should be actuated by a true spirit of conciliation and their personal records were carefully scrutinized. There is no doubt that Philippa Fawcett's dazzling academic honours assured her a large measure of confidence from British sections of the population. Her political ancestry gave her points of contact with the Boers, whose sympathy her very distinguished mother had won. Philippa Fawcett was an ardent worker pursuing her ends along no devious routes and she may be truly regarded as one of the founders of the widespread educational system which continues to afford sure hope of common international effort in South Africa.\nIn\n1905\nMillicent Fawcett discovered that the post of principal assistant to the Director of Education of London County Council was to be filled. She contacted Philippa immediately suggesting that she should apply and, even though she was not in the country to attend an interview, Fawcett was appointed. It was a position she held until her retirement in\n1934\n.\nMiss C L Marson writes\n[\n1\n]\n:-\nAs a friend of Philippa Fawcett for\n65\nyears, I long to say that though she has always been extolled for her exceptional cleverness, it was her rare humility and loving-kindness which enabled her to be such a fine judge of character in her work for the London County Council. Her whole life suggests the thought: \"Character is Destiny.\"",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry"
  ]
}