{
  "nome_completo": "Pia Maria Nalli",
  "nome_curto": "Pia Nalli",
  "ano_nascimento": "1886",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nalli/",
  "lugar_nascimento": "Palermo, Sicily, Italy",
  "lugar_morte": "Catania, Sicily, Italy",
  "biografia": "Pia Nalli\n's parents were Giovanni Nalli, who worked as a clerk, and Carmela Fazello. Pia was the fourth of Giovanni and Carmela Nalli's seven children. Among their other children, we mention at this stage that her brother Vitangelo Nalli\n(1876\n-\n1932)\nentered the medical profession\n(\nbut was well-known as a passionate proponent of the Esperanto language and an author of books on that topic\n)\n, and her brother Paolo Nalli\n(1887\n-\n1967)\nbecame a writer and librarian holding positions as head of some of the main libraries of Italy, for example at Emilia, Lombardy, Naples, and Verona. Pia was educated in Palermo and after graduating from the local school, entered the University of Palermo.\nWhile Nalli was studying at the University of Palermo, Sicily was hit with a\n7\n.\n1\nmagnitude earthquake on\n28\nDecember\n1908\n. The epicentre of the earthquake was close to Messina, around\n200\nkm from Palermo, so the city of Palermo escaped with minor destruction. However, one consequence of the earthquake was that\nGiuseppe Bagnera\n, who was on the staff at Messina at the time, joined the University of Palermo and was advisor to Nalli during the final stages of writing her thesis. She was awarded her laurea on\n10\nJanuary\n1910\nafter submitting a thesis on\nalgebraic geometry\n.\nGiovanni Battista Guccia\nset up the\nMathematical Circle of Palermo\nin\n1884\nmaking Palermo an important mathematical centre. The journal for the new society was the\nRendiconti del Circolo matematico di Palermo\nwhich was edited by\nGuccia\n. Nalli joined the\nMathematical Circle\nin\n1910\n, after graduating from Palermo. She was joining the largest mathematical society in the world with over\n900\nmembers, the majority of whom came from outside Italy. The leading mathematicians of the day were members, for example in the early years of the\n20\nth\ncentury\nHenri Poincaré\n,\nJacques Hadamard\n,\nDavid Hilbert\n,\nVito Volterra\n,\nFederigo Enriques\n,\nGuido Castelnuovo\n,\nCorrado Segre\n,\nGiuseppe Peano\n,\nTullio Levi-Civita\n,\nGregorio Ricci-Curbastro\nand\nLuigi Bianchi\nwere members. At the time when Nalli joined, the Mathematical Circle had, over the preceding few years, published some of the most important mathematical papers in the world in the\nRendiconti\n. Nalli submitted her first paper\nRiduzione di un fascio di curve piane di genere uno, corrispondente a se stesso in una trasformazione birazionale involutoria del piano\nⓉ\n(\nReduction of a bundle of generally planar curves of genus one, corresponding to itself in a birational transformation involution\n)\nto the Mathematical Circle in May\n1910\n. It was read at a meeting of the society on\n14\nAugust\n1910\nand the paper was printed on\n22\nDecember\n1910\n. Her second paper\nSopra una definizione di dominio piano limitato da una curva continua, senza punti multipli\nⓉ\n(\nOn a plane domain definition limited by a continuous curve without multiple points\n)\nwas submitted to the Mathematical Circle in September\n1911\n, read at a meeting of the society on\n12\nNovember\n1911\nand printed on\n25\nNovember\n1911\n.\nNalli was\nGiuseppe Bagnera\n's assistant at the University of Palermo from\n1\nApril\n1911\nto\n16\nNovember\n1911\n. She then taught at a number of secondary schools, first in the girls' school at Avellino, then in Trapani, and from\n16\nNovember\n1912\nin the girls' technical school in Palermo. Despite a very heavy teaching load, Nalli was able to carry out high quality research during her time as a school teacher. She worked on her\nhabilitation\nthesis and, in\n1914\n, she completed an impressive thesis\nEsposizione e confronto critico delle diverse definizioni proposte per l'integrale definito di una funzione limitata o no\nⓉ\n(\nPosition and critical comparison of the different definitions proposed for the definite integral of a bounded or unbounded function\n)\n. In this work she studied the theory of the integral, in particular bringing together recent work on the subject by\nÉmile Borel\n,\nHenri Lebesgue\n,\nCharles de la Vallée Poussin\n,\nGiuseppe Vitali\nand\nArnaud Denjoy\n.\nA function\nf\nf\nf\ncan be expanded as a\nFourier series\nand the coefficients calculated as integrals. If\nf\nf\nf\nis\nRiemann\nintegrable, then\ndu Bois-Reymond\nproved that the\nRiemann\nintegral can be used to calculate the coefficients.\nDe la Vallee Poussin\ngeneralised this by showing that if\nf\nf\nf\nis\nLebesgue\nintegrable, then the\nLebesgue\nintegral can be used to calculate the coefficients. Between\n1915\nand\n1918\n, Nalli concentrated her efforts on extending the theorem of\nde la Vallee Poussin\nto functions\nf\nf\nf\nthat are integrable using the restricted\nDenjoy\nintegral. Here she was working with very new ideas for\nArnaud Denjoy\nhad only announced his integral in two short notes in\n1912\nand gave full details in four long papers published between\n1915\nand\n1917\n. Nalli published\nSulle serie di Fourier delle funzione non assolutamente integrabili\nⓉ\n(\nOn the Fourier series of the  absolutely integrable function\n)\nin\n1915\n. Then, two years later, she proved that if\nf\nf\nf\nis integrable using the restricted\nDenjoy\nintegral then this integral can be used to calculate the coefficients. She also proved uniqueness theorems for the trigonometric series expansion for this class of functions. Progress along these lines came to a stop at that point and Nalli's result was the high point in this area for a long time. Also during\n1915\n-\n1917\n, she focused her attention on the problem of summation of series, with special reference to\nDirichlet\nseries.\nIn the year\n1919\nNalli started to work on issues related to the theory of linear integral equations and the study of integral operators. Her work continued that begun by\nIvar Fredholm\non this topic. She published her results in a series of four notes entitled\nSulle equazioni integrali\nⓉ\n(\nOn an integral equation\n)\nin\n1919\nand the memoir\nGeneralizzazione di alcuni punti della teoria delle equazioni integrali di Fredholm\nⓉ\n(\nGeneralization of some points of the theory of Fredholm integral equations\n)\nin the same year. In\n1922\nshe published another important paper\nSulle operazioni funzionali linear\nⓉ\n(\nOn linear functional operations\n)\non this topic. Already, at this time, Nalli was a university lecturer being appointed as an extraordinary professor of analysis at the University of Cagliari in\n1921\n. She had entered the competition for the chair of infinitesimal analysis at the University of Cagliari, being the only woman among the eight applicants that included\nMauro Picone\nand\nGiuseppe Vitali\n. The panel examining the candidates put\nPicone\nfirst and Nalli second. It is now widely believed that Nalli was actually ranked first but pushed down the list because she was a woman.\nPicone\n, however, who had been appointed as Professor of Analysis at the University of Catania in\n1919\n, may well have been using his application to Cagliari as a way to improve his position at Catania, for he was quickly offered the position as Head of Mathematics at Catania. Cagliari then gave Nalli an extraordinary professorship of analysis.\nAlthough she was a professor at Cagliari, Nalli continued to enter competitions for professorships at other universities. She was ranked third in the competition for the chair of calculus at the University of Modena in\n1922\nbut then ranked first in the competition for the chair of calculus at the University of Pavia in the following year. However, despite being ranked first, Pavia did not appoint Nalli to the chair and she wrote a strong letter of complaint to the rector of the university as well as writing to\nTullio Levi-Civita\ncomplaining bitterly about the injustice. She complained to\nLevi-Civita\nabout\n(\nsee\n[\n4\n]\n)\n:-\n... the shameful persecution to which I have been subjected for a few years, all based on fantastic slander, ridiculous and anonymous\n(\nfor example, that of my lack of educational quality, finally exploded by two great results in two recent competitions\n)\nhas happened again with the usual treatment by the Faculty of Pavia. Other similar events will follow: of that I'm absolutely sure, because there is very little danger in persecuting a woman, who would not be allowed even the slightest verbal outburst, under the sentence of being subjected to gossip. I just call it gossip!\nOther similar events did follow, for she was placed second in the competition for the chair of algebraic analysis at the University of Catania in\n1926\nand second in the competition for the chair of algebraic analysis at the University of Florence in the same year. We do not know what reply she had from\nLevi-Civita\nbut he seems to have given her encouragement since, in February\n1927\n, she was took up an appointment as professor at the University of Catania. However, the greatest indication of the reply Nalli must have received is seen from the fact that at this time she changed her research topic and after this worked on tensor calculus, the topic for which\nLevi-Civita\nis famed. Her first publications on this new topic were\nSul parallelismo di Levi-Civita e sopra certe possibili estensioni\nⓉ\n(\nOn Levi-Civita and parallelism and certain possible extensions\n)\n(1928)\nand\nParallelismo e coordinate geodetiche\nⓉ\n(\nParallelism and geodetic coordinates\n)\n(1929)\n.\nHer move to Catania was, like so much of her career, only made after considerable controversy. When the dean of the faculty of sciences told her the news, he noted that the \"resolution was subject to official participation by the ministry\". The next competition for a mathematics chair was in Florence and she had already entered that competition before hearing from the dean at Catania. Nalli carried on and took part in the competition for the chair at Florence, and she was again ranked second\n(\nas we noted above\n)\nwhile the local candidate, whom the faculty at Florence had been expecting would be appointed, was not ranked at all. The University of Catania claimed that Nalli had not responded quickly enough to their proposal of\n4\nAugust\n1926\nso withdrew their offer to her. Nalli was not going to accept this sort of treatment, so she wrote to the Minister of Education, Pietro Fedele\n(1873\n-\n1943)\n, who was a modern historian at Turin before being made Education Minister in\n1925\n. In her letter she listed all the competitions she had entered, and those she had won, and asked him to intervene with the University of Catania and insist that they had a moral obligation to vote again on their decision. Despite some time having now elapsed, no appointment had been made to the chair at the University of Catania and, after Pietro Fedele intervened, they offered Nalli a permanent chair of analysis starting on\n16\nFebruary\n1927\n.\nThe professorship at Catania did not suit Nalli, partly because she felt that her colleagues resented her being there, having only accepted her at Fedele's insistence, partly because she would have preferred to be in Palermo where she felt much more at home. However, there was resistance from the staff at Palermo to her being appointed there. In particular, Michele La Rosa\n(1880\n-\n1933)\n, who held the chair of physics at Palermo but was also dean of the Faculty of Science before becoming rector of the university, was opposed to her appointment. Nalli wrote in a letter to the Minister of Education on\n12\nMay\n1928\n(\nsee, for example\n[\n4\n]\n)\n:-\nProfessor La Rosa claims that I would not be able to keep discipline, because the pupils of Palermo are large and to keep discipline, according to professor la Rosa, requires a teacher with solid manly qualities. I protest against this assertion: I have always kept discipline, and if anything I can be blamed for being too harsh. To keep discipline there is no need to do battle with the students: you just do not be ridiculous. And I'm not ridiculous either as a woman or as a teacher.\nLet us indicate some of Nalli's publications after she moved to Catania. These include the papers:\n(\nwith Giulio Andreoli\n)\nSui processi integrali di Stieltjes\nⓉ\n(\nOn the integral processes of Stieltjes\n)\n(1929)\n;\nSpazi di Riemann di seconda classe\nⓉ\n(\nRiemann surfaces of the second class\n)\n(1932)\n;\nRisoluzione di due problemi classici per mezzo di una equazione di Volterra\nⓉ\n(\nResolution of two classic problems by means of an equation of Volterra\n)\n(1938)\n;\nSopra un problema relativo ai trasporti rigidi di vettori negli spazi quadrimensionali\nⓉ\n(\nOn a problem  rigid transport of vectors in four dimensional space\n)\n(1947)\n;\nTrasporti rigidi di vettori negli spazi quadridimensionali\nⓉ\n(\nRigid transport of vectors in four-dimensional space\n)\n(1949)\n; and\nEquazioni indipendenti dalla scelta delle variabili e caratterizzazione di varietà metriche\nⓉ\n(\nIndependence of the choice of variables and equations characterising metrical varieties\n)\n(1955)\n. She also published the book\nLezioni de calcolo differenziale assoluto\nⓉ\n(\nLessons on absolute differential calculus\n)\n(1952)\nwhich was material from lecture courses she had given over many years.\nGaetano Fichera\npaints a sad picture of how Nalli was deprived of the recognition she deserved, presumably because she was a woman\n[\n2\n]\n:-\nHer aspiration to teach in her hometown, Palermo, became increasingly frustrated and was for her a source of great bitterness when she saw mathematicians appointed of very different stature from her. Retiring from teaching from the Faculty of Catania, which she had served for thirty years, she was given the recognition of being proposed for the appointment as professor emeritus. But in the national scene, Pia Nalli was left in complete obscurity. No academy ever thought to welcome her among its members, she was never called to judge a university competition, ... and she never had a position of distinction or prestige. On the other hand, she had the respect of the authentic scientific fraternity, which prevented her from begging for recognition and positions. Tired out with the passing of the years, resentful of those who had been hostile, resentful that her exuberant southern temperament had, at times, given its bright tone, become more and more closed in on itself, in a desperately lonely life, not cheered by family affections. But the few who were her friends knew that behind the outward harshness of her character was concealed a soul who was sensitive to the delicate nuances of feeling.\nDespite the lack of honours given to Nalli in her lifetime, we note that she has been honoured with the naming of a street Via Pia Nalli in Rome.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}