{
  "nome_completo": "Pierre-Joseph-Étienne Finck",
  "nome_curto": "Pierre-Joseph-Étienne Finck",
  "ano_nascimento": "1797",
  "ano_morte": "1870",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Finck/",
  "lugar_nascimento": "Lauterbourg, France",
  "lugar_morte": "Strasbourg, France",
  "biografia": "Pierre-Joseph-Étienne Finck\nwas left an orphan in\n1810\n, just under the age of\n13\n, when his father and mother both died within a few months of each other. Finck was then adopted and brought up in the town of Landau in der Pfalz.\nFinck entered the École Polytechnique in\n1815\n, in sixth place in the ranking of students admitted that year. He graduated in\n1817\nand was admitted to the Artillery School, ranked third from\n25\nstudents on entry. The work of the Artillery School did not interest Finck and, in March\n1818\n, he requested that he be allowed to enter the cavalry regiment of the Royal Guard. His request was turned down.\nFinck tried again with his request in July of the same year, this time saying that if he was not allowed the move he would resign. His request was turned down and Finck resigned. However, by March\n1819\nFinck seems to have decided that his actions had been mistaken since he wrote asking to be readmitted to the Artillery School. This request was also turned down: Finck was clearly not very highly regarded at the Artillery School.\nReturning to university, Finck entered the University of Strasbourg in\n1821\nstudying mathematics in the Faculty of Science. He studied for his doctorate, receiving this for a dissertation\nSur les mouvements de l'équateur terrestre\nⓉ\n(\nOn the movements of the Earth's equator\n)\nin\n1829\n.\nBefore completing his doctoral work, Finck began teaching mathematics at the Artillery School of Strasbourg in\n1825\n, which does have a certain irony after his own experiences as a student at Artillery School. He was promoted to Professor of Mathematics there in\n1827\n. He also taught at the Collège de Strasbourg from\n1827\n, becoming a professor there in\n1829\n.\nIn\n1842\nFinck was appointed to the chair of mathematics at the University of Strasbourg. He began to suffer from ill health in\n1862\nand by\n1866\nhe was forced to take sick leave. He did not return from sick leave but retired in\n1868\n.\nFinck wrote over\n20\npapers and seven textbooks on mathematics. His texts include books on algebra, mechanics, geometry and analysis.\nIn\n[\n1\n]\nFinck's work on algorithms is discussed, in particular his work on analysing the\nEuclidean algorithm\n.",
  "math_areas": [
    "Geometry"
  ]
}