{
  "nome_completo": "Pierre Vernier",
  "nome_curto": "Pierre Vernier",
  "ano_nascimento": "1584",
  "ano_morte": "1638",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vernier/",
  "lugar_nascimento": "Ornans, Franche-Comté, Spanish Habsburgs (now France)",
  "lugar_morte": "Ornans, Franche-Comté, Spanish Habsburgs (now France)",
  "biografia": "Pierre Vernier\nwas taught mathematics and science by his father who was a lawyer and engineer who held government office. His father introduced Pierre to the works of\nClavius\nand\nBrahe\n.\nBeing born in Franche-Comté\n(\nFree Country\n)\nmeant that Vernier\n(\nand his father\n)\nwere involved, not with the government of France but with that of Spain. Franche-Comté was a Habsburg possession controlled by the Spanish Habsburgs throughout Vernier's life. In fact the period from\n1598\nto\n1635\nwas one of peace.\nVernier became a government official holding various positions such as military engineer for the Hapsburgs and director general of the treasury in Dole and Besançon, the capital of Franche- Comté. Vernier also held various government posts with the government of Spain and became a Conseiller du Roi.\nHe worked for much of the time as an engineer, working on the fortifications of various cities. In\n1623\nhe was given the title of citizen from the city of Besançon for his work on the defences of the city. In fact the threat of war was never far away and during the last two years of Vernier's life Franche-Comté was frequently invaded by France.\nLike many other mathematicians and scientists of this period, Vernier worked on cartography and on surveying. He collaborated with his father in making a map of the Franche-Comté area. His interest in surveying led to develop instruments for surveying and this prompted the invention for which he is remembered by all scientists.\nHis most famous publication is\nLa Construction, l'usage, et les propriétés du quadrant nouveau de mathématiques\nⓉ\n(\nConstruction, use, and properties of the new mathematical quadrant\n)\n(1631)\n. In this book Vernier gives a table of sines and a method for deriving the angles of a triangle if its sides are known. He also describes his most famous invention, that of the vernier caliper, an instrument for accurately measuring length. It has two graduated scales, a main scale like a ruler and a second scale, the\nvernier\n, that slides parallel to the main scale and enables readings to be made to a fraction of a division on the main scale.",
  "math_areas": []
}