{
  "nome_completo": "Qadi Zada al-Rumi",
  "nome_curto": "Qadi Zada",
  "ano_nascimento": "1364",
  "ano_morte": "1436",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Qadi_Zada/",
  "lugar_nascimento": "Bursa, Turkey",
  "lugar_morte": "Samarkand, Uzbekistan",
  "biografia": "Qadi Zada\nmeans \"son of the judge\" and we must assume that indeed Qadi Zada's father was the judge. Qadi Zada, however, is not his proper name which was Salah al-Din Musa Pasha. While we are commenting on his name we should also note that it is often written as Qadizada. Dilgan points out in\n[\n1\n]\nthat certain historians have made errors regarding Qadi Zada's name. For example\nMontucla\nsays that he was a Greek convert to Islam which Dilgan suggests may come from a misunderstanding of the name al-Rumi\n[\n1\n]\n:-\n... for the peoples who lived in Asia Minor were called Rum, meaning Roman\n(\nnot Greek\n)\n, because Asia Minor was once Roman.\nIt was in his home town of Bursa that Qadi Zada was brought up. He completed his standard education in Basra and then studied geometry and astronomy with al-Fanari. His teacher al-Fanari realised that Qadi Zada was a young man with great abilities in mathematics and astronomy and he advised him to visit the cultural centres of the empire, Khorasan or Transoxania, where he could benefit from coming in contact with the top mathematicians of his time.\nWhen Qadi Zada was a young man, Timur, who is often known as Tamerlane, ruled the empire stretching across present day Iran, Iraq, and eastern Turkey. After Timur's death in\n1405\n, his empire was disputed among his sons. Shah Rukh was the fourth son of Timur and, by\n1407\n, he had gained overall control of most of the empire, including Iran and Turkistan, regaining control of Samarkand. The cultural centres where Qadi Zada would be advised to visit would include Herat in Khorasan\n(\ntoday in western Afghanistan\n)\nand Bukhara and Samarkand in Transoxania.\nIt was not until around\n1407\nthat Qadi Zada set off to visit these cities. It is unclear why he waited so long for by this time he was over forty years of age, not really a young man setting off to begin a career. He had already gained a good reputation as a mathematician and a treatise on arithmetic, which he composed in Bursa in\n1383\n, has survived. It is a work which covers arithmetic, algebra and mensuration.\nAfter visiting a number of cities, Qadi Zada reached Samarkand in about\n1410\n. The previous year Shah Rukh, having gained control of his father Timur's empire, had decided to make Herat in Khorasan his new capital and put his own son\nUlugh Beg\nin control of Samarkand.\nUlugh Beg\nwas only\n17\nyears old when Qadi Zada met him at Samarkand in\n1410\n. He was far more interested in science and culture than in politics or military conquest but he was, nevertheless, deputy ruler of the whole empire and, in particular, sole ruler of the Mawaraunnahr region. Meeting\nUlugh Beg\nwas certainly a turning point for Qadi Zada, for he would spend the rest of his life working in Samarkand. He married in that city and his son Shams al-Din Muhammad was born there.\nQadi Zada wrote a number of commentaries on works on mathematics and astronomy during his first years in Samarkand. These seem to have been written for\nUlugh Beg\nand it would appear that Qadi Zada was producing material as a teacher of the brilliant young mathematician. One commentary on the compendium of the astronomer al-Jaghmini was written by Qadi Zada in\n1412\n-\n13\n, while a second commentary was on a work by\nal-Samarqandi\n. This second commentary is on\nal-Samarqandi\n's famous short work of only\n20\npages in which he discusses thirty-five of\nEuclid\n's propositions. Qadi Zada wrote the work in\n1412\n.\nIn\n1417\n, perhaps encouraged by Qadi Zada,\nUlugh Beg\nbegan building a madrasah which is a centre for higher education. The madrasah, fronting the Rigestan Square in Samarkand, was completed in\n1420\nand\nUlugh Beg\nthen began to appoint the best scientists he could find to teaching positions in his university. In addition to Qadi Zada,\nUlugh Beg\ninvited\nal-Kashi\nto join his madrasah, as well as around sixty other scientists. There is little doubt that\nal-Kashi\n, Qadi Zada and\nUlugh Beg\nhimself, were the leading astronomers and mathematicians at this prestigious establishment in Samarkand.\nConstruction of an observatory in Samarkand began in\n1424\nand, while the observatory was under construction,\nal-Kashi\nwrote to his father, who lived in Kashan, about the scientific life in Samarkand. In the letters\nal-Kashi\npraises the mathematical abilities of\nUlugh Beg\nand Qadi Zada but considers the other scientist second rate compared with them. Scientific meetings were led by\nUlugh Beg\nand in these sessions problems in astronomy were freely discussed. Usually these problems were too difficult for all except\nal-Kashi\nand Qadi Zada.\nQadi Zada's most original work was a computation of sin\n1\n° with remarkable accuracy. He published his methods in his\nTreatise in the sine\nand, although\nal-Kashi\nalso produced a method for solving this problem, the two methods are different and show that two remarkable scientists were both working on the same problems at Samarkand. Qadi Zada computed sin\n1\n° to an accuracy of\n1\n0\n−\n12\n10^{-12}\n1\n0\n−\n1\n2\n(\nif expressed in decimals\n)\n, as did\nal-Kashi\n. The method is fully described in\n[\n1\n]\n(\nsee also\n[\n5\n]\n)\n.\nThe major work undertaken at the Observatory in Samarkand was the production of the\nCatalogue of the stars\n, the first comprehensive stellar catalogue since that of\nPtolemy\n. This star catalogue, the\nZij-i Sultani\n, set the standard for such works up to the seventeenth century. Published in\n1437\n, in the year following Qadi Zada's death, it gives the positions of\n992\nstars. The catalogue was a collaborative effort by a number of scientists working at the Observatory but the principal contributors were certainly\nUlugh Beg\n,\nal-Kashi\n, and Qadi Zada. As well as tables of observations made at the Observatory, the work contained calendar calculations and results in trigonometry.\nA commentary by Qadi Zada which is incomplete, was on the astronomical treatise of Nasir ad-Din\nal-Tusi\n. The contents of this surviving work are described in\n[\n3\n]\n. A treatise by Qadi Zada on the problem of facing Mecca, an important problem which many Muslim astronomers and mathematicians discussed, has also survived.",
  "math_areas": [
    "Algebra",
    "Geometry"
  ]
}