{
  "nome_completo": "Qin Jiushao",
  "nome_curto": "Qin Jiushao",
  "ano_nascimento": "1202",
  "ano_morte": "1261",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Qin_Jiushao/",
  "lugar_nascimento": "Puzhou (Anyue), Szechwan province, China",
  "lugar_morte": "Meizhou (now Meixian), Guangtong province, China",
  "biografia": "Qin Jiushao\n, also known as\nCh'in Chiu-Shao\n, was born at the time of the Nan\n(\nSouthern\n)\nSung dynasty. His ancestors came from Lu-chun in Shantung province and some biographies quote this incorrectly as his birthplace. His father, Qin Jiuyu\n(\nor Ch'in Chiu-yu\n)\n, was a graduate who worked as an official in local administration. In around\n1219\n, when Qin was about seventeen years old, his father was working as a prefect of Bazhou. At this time Qin volunteered for the army, which was putting down a rebellion, and served for a while. Qin's father moved to Hang-chou, the capital of the Nan Sung, in around\n1224\nand Qin went with his father. He wrote in the preface to his famous work\nShushu Jiuzhang\n(\nsee for example\n[\n3\n]\n)\n:-\nIn my youth I was living in the capital, so that I was able to study in the Board of Astronomy; subsequently, I was instructed in mathematics by a recluse scholar.\nWe know that Qin was a rebellious youth, famous for his many love affairs, who disliked authority\n[\n1\n]\n:-\nDuring a banquet given by his father, a commotion was created when a stone suddenly landed among the guests; investigations disclosed that the missile had come from the direction of Qin, who was showing a young girl how to use a bow as a sling to hurl projectiles.\nIn fact Qin did not live in the capital Hang-chou for long since his father was posted to Tongchuan\n(\nnow Santai\n)\nin Szechwan province in\n1226\nand Qin went there with him. Sadly, we do not know which recluse scholar taught Qin mathematics, but we do know that he studied the\nNine Chapters\non the Mathematical Art. By\n1233\nQin was himself the sheriff of a subprefecture in Szechwan province and at this time he was instructed in writing poetry by an official from Chengdu, in central Szechwan province. It is worth noting at this point that as well as being a genius in mathematics and accomplished in poetry, Qin was expert at fencing, archery, riding, music and architecture. However, there was another side to his character. He was described by a contemporary in a letter to the Emperor as\n[\n1\n]\n:-\n... as violent as a tiger, or a wolf, and as poisonous as a viper or a scorpion.\nHis aggressive nature no doubt suited army life and he became a commander defender while serving in Szechwan province. Genghis Khan, the Mongol leader, died in\n1227\nbut the Mongols resumed their attacks on the Han Sung in\n1230\n. Their armies invaded Szechwan province in\n1234\nand Qin was forced to leave. He wrote in the preface of\nShushu Jiuzhang\n(\nsee for example\n[\n3\n]\n)\n:-\nAt the time of the troubles with the barbarians, I spent several years on the remote frontier, without care for my safety among the arrows and stone missiles, I endured danger and unhappiness for ten years.\nWe need not feel too sorry for Qin, however, for he was a dishonest rogue who was quite prepared to poison those whom he disliked. He served as an administrator in Qizhou\n(\nnow Qichun\n)\nin Hupeh province, but his behaviour there was so bad that it cause a military revolt. Then he was appointed governor of Hui-chou\n(\nnow She-hsien\n)\nin Anhwei province but here he undertook illegal dealings in salt which made him rich. He then moved to Wu-hsing in Chekiang province where he settled down to spend his illegally acquired riches. In the middle of\n1244\nhe was posted as a senior administrator to Nanking. After holding this post for three months, his mother died in the September\n1244\nand Qin left his post in Nanking for the mourning period and returned to Hui-chou in Anhwei province where his mother had been living. During his period of mourning in Hui-chou, Qin wrote his famous mathematical treatise\nShushu Jiuzhang\n(\nMathematical Treatise in Nine Sections\n)\nwhich appeared in\n1247\n. This is a remarkable work which led to George Sarton writing that Qin was\n(\nsee\n[\n1\n]\nor\n[\n3\n]\nwhere this is quoted\n)\n:-\n... one of the greatest mathematicians of his race, of his time, and indeed of all times.\nBefore we look at the contents of the\nShushu Jiuzhang\nwe continue our description of Qin's life. He took up his work in the civil service again in\n1254\nin the capital Hang-chou but resigned after a few months. Appointed governor of Qiongzhou in Hainan in\n1259\nhe was dismissed for corruption and exploitation after a hundred days in office and returned home having again acquired immense wealth illegally. One might expect that by this time Qin would be unemployable, given his record of criminal dealings, but he next managed to gain an appointment as an assistant in the district of Yin\n(\nnear Ningpo\n)\nin Zhekiang where his friend Wu Qian had been appointed as a naval officer. Perhaps Wu Qian was as corrupt as his friend Qin, for he was dismissed from Yin and, in\n1260\n, Qin was also sent away to Meizhou\n(\nnow Meixian\n)\n, in Guangtong province where he died.\nWe have seen that Qin was a highly unprincipled character but he was also a mathematical genius with few equals. Before looking at his mathematical achievements, let us recount further stories of his character. It is recorded that Qin cheated his friend Wu Qian so that he became the owner of some of his land, and also that Qin punished a female member of his household by confining her without food.\nThe\nShushu Jiuzhang\n(\nMathematical Treatise in Nine Sections\n)\nis to some extent modelled on the\nNine Chapters on the Mathematical Art\nalthough Qin's treatise is far more sophisticated. Chapter\n1\nis on indeterminate analysis; it contains remarkable work on the Chinese remainder theorem which occurs right at the beginning of the text. We discuss it below. Chapter\n2\nis called\nHeavenly phenomena\nand it deals with questions on the calendar and also questions about rain or snow. For example one problem asks for the height that rainwater would collect on level ground given that it reaches a certain height\nh\nh\nh\nin a vessel with a circular top of diameter\na\na\na\nand circular base of diameter\nb\nb\nb\nwhere\na\n>\nb\na > b\na\n>\nb\n. Chapter\n3\nis called\nBoundaries of fields\nand looks at surveying. There is a remarkable formula given in this Chapter which expresses the area of a figure as the root of an equation of degree\n4\n. The novelty here is that the coefficients are not numbers but are functions of lengths in the figure which are left as unspecified. Another novelty in this chapter is a formula for the area of a triangle given in terms of its sides, essentially\nHeron\n's formula.\nChapter\n4\n, called\nTelemetry\n, looks at problems involving measuring the distance to inaccessible points. Again equations of high degree appear, one problem involving the solution of the equation of degree\n10\n. The problem is:-\nGiven a circular walled city of unknown diameter with four gates, one at each of the four cardinal points. A tree lies three li north of the northern gate. If one turns and walks eastwards for nine li immediately on leaving the southern gate, the tree just comes into view. Find the circumference and the diameter of the city wall.\nQin obtains the equation\n(\nreally an equation of degree\n5\nin\nx\n2\nx^{2}\nx\n2\n, where\nx\n2\nx^{2}\nx\n2\nis the diameter of the city\n)\n:-\nx\n10\n+\n15\nx\n8\n+\n72\nx\n6\n−\n864\nx\n4\n−\n11664\nx\n2\n−\n34992\n=\n0\nx^{10} + 15x^{8} + 72x^{6} - 864x^{4} - 11664x^{2} - 34992 = 0\nx\n1\n0\n+\n1\n5\nx\n8\n+\n7\n2\nx\n6\n−\n8\n6\n4\nx\n4\n−\n1\n1\n6\n6\n4\nx\n2\n−\n3\n4\n9\n9\n2\n=\n0\n[\nSolution:\nx\n=\n3\nx = 3\nx\n=\n3\n, so diameter of city is\nx\n2\n=\n9\nx^{2}= 9\nx\n2\n=\n9\nli\n]\nIn Chapters\n5\nto\n9\nnamed\nTaxes, Money and grain, Fortifications and buildings, Military affairs\n, and\nCommercial affairs\nthe problems require more standard mathematical methods and Qin does not introduce further innovations. Throughout the text, in addition to the tenth degree equation above, Qin also reduces the solution of certain problems to a cubic or quartic equation which he solves by the standard Chinese method\n(\nnamely that which today is called the\nRuffini\n-\nHorner\nmethod\n)\n. For example the following two equations\n4608\nx\n3\n−\n3000000000\n×\n30\n×\n800\n=\n0\n4608x^{3} - 3000000000\\times 30\\times 800 = 0\n4\n6\n0\n8\nx\n3\n−\n3\n0\n0\n0\n0\n0\n0\n0\n0\n0\n×\n3\n0\n×\n8\n0\n0\n=\n0\n[\nAnswer:\nx\n=\n2500\nx = 2500\nx\n=\n2\n5\n0\n0\n]\nand\n−\nx\n4\n+\n1534464\nx\n2\n−\n526727577600\n=\n0\n-x^{4} + 1534464x^{2} - 526727577600 = 0\n−\nx\n4\n+\n1\n5\n3\n4\n4\n6\n4\nx\n2\n−\n5\n2\n6\n7\n2\n7\n5\n7\n7\n6\n0\n0\n=\n0\n[\nAnswer:\nx\n=\n720\nx = 720\nx\n=\n7\n2\n0\n. Note the solution\nx\n=\n1008\nx = 1008\nx\n=\n1\n0\n0\n8\nis not given\n]\nQin also solves linear simultaneous equations, in particular the system\n140\nx\n+\n88\ny\n+\n15\nz\n=\n58800\n792\nx\n+\n566\ny\n+\n815\nz\n=\n392000\n64\nx\n+\n30\ny\n+\n75\nz\n=\n29400\n140x +  88y +  15z = 58800\\newline792x + 566y + 815z = 392000\\newline 64x +  30y +  75z = 29400\n1\n4\n0\nx\n+\n8\n8\ny\n+\n1\n5\nz\n=\n5\n8\n8\n0\n0\n7\n9\n2\nx\n+\n5\n6\n6\ny\n+\n8\n1\n5\nz\n=\n3\n9\n2\n0\n0\n0\n6\n4\nx\n+\n3\n0\ny\n+\n7\n5\nz\n=\n2\n9\n4\n0\n0\nis solved.\n[\nAnswer:\nx\n=\n300\n,\ny\n=\n180\n,\nz\n=\n64\nx = 300, y = 180, z = 64\nx\n=\n3\n0\n0\n,\ny\n=\n1\n8\n0\n,\nz\n=\n6\n4\n]\nOne further remarkable feature of the text is that Qin uses\n0\nfor zero, so not only does he use a symbol for zero, but that symbol is a little circle. He writes about previous uses of zero:-\n... in all old books we find empty places.\nAs we have mentioned, the most remarkable method in the text is the method for solving simultaneous integer congruences, the Chinese Remainder Theorem. Qin considers problems of the type\nx\n≡\nr\nk\n(\nm\no\nd\n \n \nm\nk\n)\n,\nk\n=\n1\n,\n2\n,\n.\n.\n.\n,\nn\nx ≡ r_{k} (\\mod m_{k}), k = 1, 2, ..., n\nx\n≡\nr\nk\n​\n(\nm\no\nd\nm\nk\n​\n)\n,\nk\n=\n1\n,\n2\n,\n.\n.\n.\n,\nn\n.\nToday we start such problems assuming that the\nm\nk\nm_{k}\nm\nk\n​\nare integers. However, Qin is happy to look at problems where the numbers concerned are\nrational\n. His first step is therefore to convert to a situation where the\nm\nm\nm\nare integers.\nAlthough there is no evidence of progress on such problems in China since the work of\nSun Zi\nwhich was\n800\nyears earlier, Qin now shows how to handle the case where the\nm\nk\nm_{k}\nm\nk\n​\nare not pairwise coprime. His next move, therefore, is to make various passes through the\nm\nk\nm_{k}\nm\nk\n​\nmaking replacements in such a way that eventually the new moduli are pairwise coprime but the solution to the original problem remains unchanged by the replacements. He then solves each congruence and finally reassembles the answers to give the solution to the system of simultaneous congruences. Shen discusses Qin's method of solution fully in\n[\n15\n]\n; see also\n[\n3\n]\nand\n[\n4\n]\n. Libbrecht writes\n[\n2\n]\n:-\nWe should not underestimate\n[\nQin's\n]\nrevolutionary advance, because from\n[\nSun Zi\n's\n]\nsingle remainder problem, we come at once to the general procedure for solving the remainder problem, even more advanced than\nGauss\n's method, and there is not the slightest indication of gradual evolution.\nThis is such a brilliant piece of work that we are left with asking how Qin could have achieved it. We certainly know that Qin was a rogue who was happy to steal, so could he have stolen his mathematics? Of course if he stole it then whom did he steal it from? This does not seem likely, for it raises more questions than it solves. Some historians have wondered whether Qin could have really solved such a deep problem, suggesting that perhaps he worked back from the answer. There seems little that is convincing in that suggestion since these problems are not readily worked in reverse and, anyway, Qin really does appear to know what he is doing. Perhaps he learnt of the method through Indian approaches to such problems. Although Qin's use of the symbol\n0\nsuggests possible Indian knowledge, the Indian approach to such congruence problems is sufficiently different to make this highly unlikely. One is left with no conclusion other than accepting that Qin was one of the great mathematical geniuses of all time.\nInterestingly, despite Qin's character, he does not claim this brilliant method as his own. He says that he learn it from the calendar experts when he was studying at the Board of Astronomy in Hang-chou. He states, however, that these calendar experts used the rule without understanding it. There must be something in this for, without a doubt, calculating calendars was an important motivation for studying the theory of first-order congruences. It would appear though that Qin must have taken these ideas much further and be showing a modesty in his mathematical work which was certainly lacking in other aspects of his life.\nHow impressive is this work? Well suffice to say that\nEuler\nfailed to provide a satisfactory solution to these problems and it was left to\nGauss\n,\nLebesgue\nand\nStieltjes\nto rediscovered this method of solving systems of congruences.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}