{
  "nome_completo": "Ralph Duncan James",
  "nome_curto": "Ralph James",
  "ano_nascimento": "1909",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/James_Ralph/",
  "lugar_nascimento": "Liverpool, England",
  "lugar_morte": "Salt Spring Island, British Columbia, Canada",
  "biografia": "Ralph James\n' father was John Herbert James\n(\nborn in Micheldever, Hants about\n1872)\nwho was an elementary school teacher. His mother was Rose Annie Joabel James\n(\nborn in Liverpool about\n1872)\n. He had a sister Nora Kathleen Rose\n(\nborn in\n1910)\n.\nRalph James spent the early years of his life in England, then went to Vancouver in Canada when his parents emigrated. His school education was in Vancouver and after graduating from high school he remained in Vancouver studying mathematics at the University of British Columbia. After the award of his undergraduate degree, James had intended to train to become an actuary, but he was persuaded to continue his studies at the University of British Columbia, completing a Master's Degree in mathematics with Frederick S Nowlan. It was through Nowlan's advice, and also his help, that James then went to the University of Chicago where he studied for his doctorate under\nL E Dickson\n. James was awarded a doctorate from Chicago in\n1932\nfor his thesis\nAnalytical Investigations in Waring's Theorem\non number theory.\nJames was awarded a National Research Council Fellowship to enable him to undertake postdoctoral study working with\nE T Bell\nat the California Institute of Technology during\n1932\n-\n33\nand also for a second year at the University of Cambridge in England working with\nG H Hardy\n. After the year\n1933\n-\n34\nspent in England, James returned to the United States where he was appointed to the University of California at Berkeley. He remained there from\n1934\nto\n1939\n. He moved back to Canada in\n1939\nwhen he accepted the position of Professor and Head of the Department of Mathematics at the University of Saskatchewan. While there he published a number of papers such as\nIntegers which are not represented by certain ternary quadratic forms\n(1939)\n,\nElementary note on prime number problems of Vinogradoff's type\n(1942)\n, and\nOn the sieve method of Viggo Brun\n(1943)\n. In the second of these James applied\nVinogradov\n's method of dealing with the problem of the number of representations of a large number as a sum of three primes to a some quite general problems. In the paper\nOn the sieve method of Viggo Brun\nJames takes the sieve method which had been used by Buchstab in\n1940\nto establish results on prime numbers, and applies it to obtain results about infinite subsets of primes, such as primes in arithmetic progression.\nIn\n1943\nJames was invited to become a Professor of Mathematics at the University of British Columbia. His first paper published after his move to the University of British Columbia was\nA generalized integral\n(1946)\nwritten with Walter H Gage.\nZygmund\nwrites:-\nIn certain problems\n(\nfor example, in the theory of uniqueness of trigonometric series\n)\nit is desirable to define a second integral of a given function  without defining the first integral. In this paper the authors develop the theory of such a second integral which they call a second\nPerron\nintegral.\nIn\n1948\nJames became Head of the Department of Mathematics at the University of British Columbia. He continued his interest in number theory and the Perron integral. He addressed the\nAmerican Mathematical Society\non\nRecent progress in the Goldbach problem\nand his lectures was published in the Bulletin of the American Mathematical Society in\n1949\n. In the talk he described methods which he had used in his\n1942\nand\n1943\npaper we mentioned above. In\n1950\nhe wrote, this time a single author paper,\nA generalized integral. II\n.\nZygmund\n, who was much influenced by these ideas on the second\nPerron\nintegral, wrote:-\nThe main result of the present paper is that the sum of an everywhere convergent trigonometric series is integrable in the proposed sense, and the series itself is the\nFourier series\nof the sum.\nSome later papers continuing this theme were\nGeneralized nth primitives\n(1954)\n,\nIntegrals and summable trigonometric series\n(1955)\n, and\nSummable trigonometric series\n(1956)\n. Papers continuing the number theory theme include\n(\nwith I Niven\n)\nUnique factorization in multiplicative systems\n(1954)\n, and\nThe factors of a square-free integer\n(1968)\n.\nJames contributed in a major way towards the development of mathematics in North America. He was Editor-in-Chief of the\nAmerican Mathematical Monthly\nfrom\n1957\nto\n1962\n. For many years he was on the Editorial Boards of the Canadian Journal of Mathematics and of the Pacific Journal of Mathematics. He also served as President of the\nCanadian Mathematical Society\n(\nthen called the Canadian Mathematical Congress\n)\nfrom\n1961\nto\n1963\n. In fact all the previous presidents had served terms of four years, but James felt that this was too long a period to hold the position so it was reduced to a two year term. He served two terms on the Council of the\nAmerican Mathematical Society\n.\nWhen James died, the Senate of the University of British Columbia made a tribute:-\nIn\n1973\n, Ralph James retired as Head of the Mathematics Department at UBC after holding that position for\n25\nyears, one year before his official retirement as Professor of Mathematics, to coordinate activities for the\n1974\nInternational Mathematics Congress held in Vancouver. He continued to teach at the University of British Columbia for two further years. ... Ralph James served his university very well in many capacities. He was on many important committees, and he was a member of Senate for\n13\nconsecutive years. He represented the Faculty of Graduate Studies from\n1950\nto\n1957\n, and the Faculty of Arts and Sciences from\n1957\nto\n1963\n. He was well known in Faculty meetings where he was an articulate and forceful debater, a telling critic, and an aggressive proponent of his well thought-out views and principles. Underneath the facade, however, he was a humane and human being of gentleness, compassion, sensitivity, intelligence and integrity. Senate extends to his wife, Rose, and to the other members of his family its deepest sympathy.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}