{
  "nome_completo": "René Eugène Gateaux",
  "nome_curto": "René Eugène Gateaux",
  "ano_nascimento": "1889",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gateaux/",
  "lugar_nascimento": "Vitry-le-François, Marne, France",
  "lugar_morte": "Rouvroy, near Lens, France",
  "biografia": "René Eugène Gateaux\nwas born on\n5\nMay\n1889\nin Vitry-le-François in the département of Marne,\n200\nkm east to Paris. Vitry-le-François is the sous-préfecture of this département, a town of some industrial and military importance, as its history testifies. Another very famous mathematician was born\n222\nyears before Gateaux in the same small town,\nAbraham de Moivre\n, who had to leave for London where he spent all his outstanding scientific career. A local historian from Vitry, Gilbert Maheut, has written several short papers concerning his two brilliant mathematician fellow citizens. See in particular\n[\n48\n]\n.\nNot much is known about René's parents. His father Henri Eugène Gerasime was born in\n1860\n. He was a small contractor who owned an enterprise of saddlery and cooperage located in the suburbs of Vitry. The mother was Marie Alexandrine Roblin, a seamstress. The couple had two children; René was the elder, the second one, Georges was born four years later on\n27\nAugust\n1893\n. René's father died young, on\n28\nJuly\n1905\n, aged\n44\n. The precarious situation that may have resulted from this event may have increased the young boy's motivation in his studies.\nWe do not know precise details of the school career of René Gateaux. He was a pupil in Vitry and then in Reims. The only sure information comes from the first of his own written testimonies. On\n24\nFebruary\n1906\n, Gateaux signed a letter to the Ministry of Education to get permission to sit for the examination for admission to the École Normale Supérieure\n(\nscience division\n)\nin\n1906\n, though he had not attained the regular minimum age of\n18\n(\nhe was to be\n17\nin May\n1906)\n.\nIn October\n1907\n, Gateaux entered the École Normale Supérieure, which was in these years the very centre of intellectual life in France. We have a testimony, an obituary written in\n1919\nby two companions of Gateaux in the\n1907\nscience section of the École Normale\n(\n[\n1\n]\n, pp.\n136\nto\n140)\n, Georges Gonthiez and Maurice Janet. They write:-\nHe was one of these good comrades with whom one likes to chat. His benevolence and absolute sincerity were immediately felt; he was among those who knew how to listen and to empathize with the other's thoughts. Maybe others were more assertive of their personality, more inclined to prove the originality of their spirit and character. It is without noise that Gateaux's personality blossomed, following the way he judged to be the best possible, and his personality unceasingly and smoothly strengthened. He had this freshness of spirit of the right natures not yet offended by life. When he arrived at the École, he quietly opened his spirit to new subjects with the natural easiness and the calm of a modest, self-confident and beautiful intelligence. ...  He soon appeared to us as one of the best mathematicians in our group, serious-minded, and quick to focus on the essential. He liked to deal with all kind of philosophical or general questions.\nAt that moment an unexpected event occurred in the life of the young man, certainly important as Gonthiez and Janet devote many lines to it. During his second year at the École Normale, Gateaux became a member of the Roman Catholic Church. He joined the church 'with fervour' write his two fellow companions of the École Normale. A strong Catholic group attended the École Normale in these days\n(\nlet us only mention Pierre Poyet, one of Gateaux's comrades among the\n1907\npupils, who took orders and became a Jesuit\n)\nand Gateaux had certainly the occasion to move in these circles. This conversion, about which we did not find any trace apart from this account in the obituary\n[\n1\n]\n, seems to have played a considerable role in Gateaux's spiritual life. This beautiful childish ingenuousness is what was most impressive in Gateaux and this is probably why he acceded so easily to a religious life.\nIn\n1910\n, Gateaux passed the\nagrégation\nof mathematical sciences. On July\n8\nth\n,\n1912\na ministerial decree appointed Gateaux as Professor of Mathematics at the Lycée of Bar-le-Duc, the main town of the département of Meuse,\n250\nkm east of Paris, and not very distant from his native Vitry-le-François. Nevertheless, before taking up this post, Gateaux had the boring but necessary task to fulfil his military obligations. Since\n23\nMarch\n1905\n(\n[\n44\n]\n)\n, a new law replacing the law of\n16\nJuly\n1889\nfor the organization of the army had been voted by the Parliament, where the length of the active military service had been reduced to\n2\nyears, but there were many more candidates. Gateaux's military dossier\n(\n[\n32\n]\n)\nstipulates that he signed his voluntary engagement in Vitry on\n12\nOctober\n1907\nand asked to be incorporated only at the end of his study time. On October\n10\nth\n,\n1910\nGateaux joined the\n94\nth\nInfantry regiment where he was a basic 'second class' soldier. On\n18\nFebruary\n1911\nhe became 'caporal'\n(\na kind of private first class\n)\n, and finally was declared second lieutenant in the reserve by the President of the Republic on\n17\nSeptember\n1911\n. Then Gateaux had to follow some special training for officers, and the comments made by his superiors on the military dossier indicate that the supposed military training at the École Normale had\n(\nnot surprisingly\n)\nbeen more virtual than real.\nOn\n4\nOctober\n1912\n, Gateaux, freed from the active army, began his lectures at the Lycée of Bar-le-Duc. Meanwhile, he had begun to prepare a thesis in mathematics, on themes closely related to functional analysis\nà la Hadamard\nand its application to potential theory. We did not find precise details about how Gateaux chose this subject for his researches, but it is plausible that he was advised to do so by\nHadamard\nhimself who had just delivered lectures at the Collège de France and entered the\nAcademy of Science\nin\n1912\n. There were good reasons for Gateaux to be attracted by this new and hardly explored domain.\nPaul Lévy\nhad defended his own brilliant thesis about similar questions in\n1911\n. And also, a young French normalien of the year before Gateaux, Joseph Pérès, had in\n1912\n-\n1913\nbenefited from a grant offered by the David Weill foundation to work for a one-year period in Rome with\nVolterra\n.\nVolterra\nhimself, invited by\nBorel\nand\nHadamard\n, came to Paris to give a series of lectures on\nfunctional analysis\n, published in\n1913\n(\n[\n23\n]\n)\nand whose redaction was precisely made by Pérès.\nFor a young doctoral student the natural people to be in contact with in these years were obviously\nHadamard\nin Paris and\nVolterra\nin Rome.\nOn\n18\nApril\n1913\n,\nÉmile Borel\nwrote to\nVolterra\nthat:-\nM Gateaux, presently a teacher at Bar-le-Duc lycée, advised me about his intention to solicit a study grant to continue his research. I recommended to him that he apply for a David Weill grant to go to Rome, if you will welcome him.\nA David Weill grant was awarded to Gateaux for the year\n1913\n-\n1914\n. As he exposed them in a letter to\nVolterra\n, we know precisely what were the mathematical aims of Gateaux when he went to Rome. Gateaux considered two main points of interest for his future researches. The first one is about the extension of the Weierstrass expansion, the equivalence between analyticity and holomorphy and the\nCauchy\nformula to functionals. The second one is about infinite dimensional integration. In a last paragraph, Gateaux mentions the possible applications of such an integration of functionals, such as the residue theorem ...\nAbout Gateaux's stay in Rome, we do not have many details. An interesting document, found among the documents of the Académie des Sciences in Paris, is the draft of a report Gateaux had to write at the end of his visit, probably for the David Weill foundation. He mentioned there that he arrived in Rome in the last days of October, at the precise moment of elections for the Parliament, so that lectures were delayed until the end of November. As Gateaux only mentions that he followed two of\nVolterra\n's lectures in Rome\n(\none of Mathematical Physics, the other about applications of functional calculus to Mechanics\n)\n, it is probable that the delay refers to\nVolterra\n's political involvements as Senator. Gateaux seems to have worked quite actively in Rome. A first note in the\nRendiconti dell'Accademia dei Lincei\nwas published in December\n1913\n(\n[\n34\n]\n)\nin which he extended the results of the previous paper. Moreover, on the postcard sent by\nBorel\nto\nVolterra\non\n1\nJanuary\n1914\nwith his best wishes for the new\n1914\nyear\n(\na sentence which sounds strange to the ears of one knowing what was going to happen soon ...\n)\n,\nBorel\nmentioned how he was glad to learn that\nVolterra\nwas absolutely satisfied with Gateaux in Rome. And indeed, the young man published three more notes during his stay\n(\n[\n35\n]\n,\n[\n36\n]\n,\n[\n37\n]\n)\n, but also began the redaction of more detailed articles - found afterwards among his papers after the war.\nPaul Lévy\n(\nin\n[\n39\n]\n, p.\n70)\nmentioned that two versions of this paper were found, both dated from March\n1914\n.\nOn\n14\nFebruary\n1914\n, Gateaux delivered a lecture at\nVolterra\n's seminar; his lecture notes were kept among his papers. Gateaux mainly dealt with the notion of functional differentiation. He recalled that\nVolterra\nintroduced this notion to study problems including an hereditary phenomenon, but also that it was used by others\n(\nJacques Hadamard\nand\nPaul Lévy\n)\nto study some problems of mathematical physics - such as the equilibrium problem of fitted elastic plates - finding a solution to equations with functional derivatives, or, in other words, by calculating a relation between this functional and its derivative.  Gateaux probably came back to France at the beginning of the summer, in June\n1914\n. He certainly expected to go back soon to Rome as he obtained the Commercy grant he had applied for.\nGateaux seems to have been caught napping by the beginning of the war. The danger of war had in fact been realised only very late in July\n1914\n, and most people received the mobilization announcement on\n2\nAugust with stupor. Gateaux was mobilized in the reserve as lieutenant of the\n269\nth\nInfantry regiment, a member of the\n70\nth\ninfantry division. The quartering of Gateaux's regiment took place in Toul. The first battles were successful for the French, but, after the euphoria of the very beginning of August, the hard reality of the force of the German army obliged the French troops to withdraw day after day. At the end of August, the task of the\n70\nth\nInfantry division was in the first place to defend the south-east sector of Nancy. At the end of September, the French and German headquarters became aware of the impossibility of any further movement on a front line running from the Aisne to Switzerland and so the only hope was to bypass the enemy in the zone, still almost free of soldiers, between the Aisne and the sea. General Joffre decided to withdraw from the eastern part of the front\n(\nprecisely where Gateaux was\n)\na large number of divisions and to send them by rail to places in Picardie, then to Artois, and finally to Flandres, to try to outrun the Germans. The so-called race for the sea lasted two months and was incredibly bloody.\nThe\n70\nth\ndivision was transported between\n28\nSeptember and\n2\nOctober from Nancy to Lens, a distance of almost\n300\nkm! It received the order to defend the east of Lens and Arras. On\n3\nOctober, Gateaux's regiment was in Rouvroy, a small village,\n10\nkm south-east of Lens, and Gateaux was killed at\n1\no'clock in the morning, while trying to prevent the Germans from entering the village. In the general confusion of the bloodshed, corpses were not identified before being collected and hastily buried in improvised cemeteries. Gateaux's body was buried near the St Anne Chapel in Rouvroy, a simple cross without inscription marking the place. Only long after, Gateaux's corpse was exhumed and formally identified, and finally transported to the necropolis of the military cemetery of Bietz-Neuville St Vaast where Gateaux's grave is number\n76\n.\nAs soon as August\n1915\n,\nHadamard\nbegan the necessary steps to obtain the attribution of one of the prizes of the\nAcademy of Science\nto Gateaux. In a letter dated\n5\nAugust\n1915\nand maybe addressed to\nPicard\nas Perpetual Secretary,\nHadamard\nmentions that Gateaux:-\n... has left very advanced researches on functional calculus\n(\nhis thesis was composed to a great extent, and partly exposed in notes to the Academy\n)\n, researches for which M\nVolterra\nand myself have a big consideration.\nAt the meeting of\n18\nDecember\n1916\nthe prix Francoeur was awarded to Gateaux\n(\n[\n42\n]\n, pp.\n791\n-\n792)\n. It is interesting to read in\nHadamard\n's short report the following section:-\n[\nGateaux\n]\nwas on the point of following a much more audacious way, promising to be most fruitful, by extending the notion of integration to the functional domain. Nobody could predict the development and the range that this new series of researches could have attained. This is what events have interrupted.\nIn\n1918\n, the Paris\nAcadémie des Sciences\n, following\nHadamard\n's proposal, decided to call\nPaul Lévy\nfor the Cours Peccot in\n1919\n. On\n3\nJanuary\n1919\n,\nLévy\nwrote to\nVolterra\n:-\nAs I was recently interested in the question of the extension of the integral to functional space, I spoke about the fact to M\nHadamard\nwho mentioned the existence of a R Gateaux note on the theme. But he could not give me the exact reference and I cannot find it. ... Though I am still mobilized, I work on lectures I should read at the Collège de France on the functions of lines and the equations with functional derivatives and at this occasion I would like to develop several chapters of the theory. ... I think that the generalization of the\nDirichlet\nproblem should be more difficult. Up to now, I was not able to extend your results on functions of the first degree and your extension of\nGreen\n's formula. This is precisely due to the fact that I do not possess a convenient expression for the integral.\nOn\n12\nJanuary\nLévy\nsent a new letter to\nVolterra\n:-\nM\nHadamard\nhas just found several unpublished Gateaux papers at the École Normale. I have not seen them yet but maybe I'll find what I am looking for in them.\nVolterra\nanswered both letters on January\n15\nth\n, telling\nLévy\nthat none of Gateaux's publications concerned integration. He nevertheless adds:-\nWe had chatted before he left Rome about his general ideas on the subject, but he did not publish anything. I suppose that in the manuscripts he had left, one may probably find some notes dealing with the problem. I am happy that they are not lost and that you have them in hand. The question in very interesting.\nOn\n6\nJanuary\n1919\nLévy\nwrote to\nFréchet\n:-\nAbout Gateaux's papers, I learnt precisely yesterday that M\nHadamard\nhad put them in security at the École Normale during the war and had just taken them back. Nothing is therefore yet published.\nFrom this sentence, we may infer that it is\nFréchet\nwho firstly wrote to\nLévy\nabout Gateaux's papers, and certainly because he had an idea of what they contained. Maybe this constitutes a proof that it was indeed through\nFréchet\nthat the papers were delivered to\nHadamard\nduring the war, and that\nFréchet\nwas the recipient of the aforementioned letter from the Principal of the Lycée in Bar-le-Duc? On\n12\nFebruary,\nLévy\nbegan to describe to\nFréchet\nthe content of what he had precisely found in Gateaux papers, namely a first theory of harmonic functionals.\nGateaux's interest in infinite dimensional integration originated in the extension of\nCauchy\n's formula. For\nLévy\n, the situation was somewhat different, being in connection with research devoted to potential theory. This theory, directly derived from electromagnetism, has the determination of the electric potential created in one point\nP\nP\nP\nby a repartition of electric charges in a region of the space. The study of these questions in infinite dimensional classical functional spaces leads to the question of integration over these spaces. A central problem arises from the fact that generally, in infinite dimension, a subset has a volume equal to zero or infinity, and this prevents the direct extension of the\nRiemann\nintegral defined through an approximating step-functions sequence.\nGateaux seems to have been the first to propose a natural way to bypass the problem by considering the integral as an asymptotic mean value. In a paper he wrote in\n1924\nat the end of his intense period of activity around these questions\n(\n[\n13\n]\n)\n,\nLévy\ntakes stock of this definition of integral as mean value as a natural definition of the uniform probability in an infinite set. In\n[\n12\n]\n,\nLévy\nhas finally admitted that the right formulation for these problems is in a probabilistic framework, and it is impressive to see how in the book\n(\nand in particular in Chapter VI\n)\n,\nLévy\nmakes use of probability theory to justify the passages to the limit by means of the law of large numbers. Interestingly,\nprobability theory\ndoes not appear in the notes\nLévy\nhad published just after the war about his work on the function of lines. It is only when he wrote his book\n[\n12\n]\nthat he understood this natural framework, at the precise moment when he began to be interested in probability theory because he needed to teach it. In his autobiography\n(\n[\n14\n]\n)\n,\nLévy\nhas observed how in\n[\n12\n]\n, he was close to\nWiener\nmeasure. He was indeed so close that Wiener, when speaking with him in\n1922\n, will immediately see that\nLévy\n's considerations to define the integral over the infinite dimensional sphere are precisely what he could use to define his Differential-space and construct the\nWiener\nmeasure of Brownian motion. Two years earlier, he has had the intention of using the results provided by\nDaniell\n, who, independently from Gateaux, has also defined an integral through a limit of means\n(\n[\n27\n]\n)\n. In\n[\n51\n]\n(\nfootnote *, p.\n67)\n,\nWiener\nmentions that he had just discovered Gateaux's earlier discoveries in\n[\n37\n]\n. In\n1923\n, at the beginning of his epoch-making paper\n[\n52\n]\n(\np.\n56)\n,\nWiener\npays tribute to Gateaux and\nLévy\nfor having provided the most complete investigations about integration in infinitely many dimensions.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}