{
  "nome_completo": "Richard Melvin Schoen",
  "nome_curto": "Richard Schoen",
  "ano_nascimento": "1950",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schoen/",
  "lugar_nascimento": "Celina, Ohio, USA",
  "lugar_morte": null,
  "biografia": "Richard Schoen\nis known to his friends and colleagues as Rick Schoen. His parents were Arnold Peter Schoen\n(1904\n-\n1986)\nand Rosemary Heitkamp\n(1911\n-\n2012)\n. Arnold Schoen\n(\nson of Jacob Schoen and Elizabeth Knapke, born on\n18\nMarch\n1904\nin Mount Sterling, Ohio\n)\nwas a farmer in Allen, Darke County, Ohio. On\n8\nNovember\n1933\nhe married Rosemary Heitkamp\n(\nknown as Rose\n)\n. Rose Heitkamp, a daughter of Bernard John Heitkamp and Catherine Gehle, was born on\n8\nNovember\n1911\nin Saint Henry, Mercer County, Ohio. Arnold and Rose Schoen had thirteen children of which Richard\n(\nthe subject of this biography\n)\nwas the tenth. His older siblings were: Mary C Schoen; Virginia E Schoen; Eileen M Schoen; Janice A Schoen; Harold L Schoen; Patricia A Schoen; James A Schoen; George E Schoen; and Linda C Schoen. Rick\n[\n7\n]\n:-\n... knows well the rigours of farming life, waking up early in the morning to help with farm duties before going to school.\nHubert L Bray and William P Minicozzi II write in\n[\n36\n]\n:-\nHe enjoyed farm work and has described driving a tractor to plough the fields as \"great for thinking.\" His mother encouraged the children in their schooling, and his father was always inventing things. His older brothers, Hal and Jim, were both mathematics majors and inspired him to study mathematics.\nMore from this article is at\nTHIS LINK\n.\nRichard attended Sharpsburg Elementary School in Fort Recovery, then went to Fort Recovery High School. He graduated from the High School in\n1968\nand, later that year, began his studies at the University of Dayton, in Dayton, Ohio. This was the local university for his home town of Fort Recovery being less than\n80\nkm to the south east. He graduated from Dayton with a B.S. in\n1972\n, receiving the University of Dayton's Distinguished Alumnus Award and the Special Achievement Award, and then, in the same year, he entered Stanford University to undertake graduate studies. He was awarded a National Science Foundation Graduate Fellowship to fund his studies from\n1972\nto\n1975\n. He explained how he came to have two thesis advisors in an article he wrote in tribute to\nShing-Tung Yau\n[\n41\n]\n:-\nI first met\nShing-Tung Yau\nin\n1973\nwhen I was a second year Ph.D. student at Stanford University and he was a newly arrived faculty member. We became mathematically involved through a reading course I was doing with\nLeon Simon\non minimal hypersurfaces. This led to a three-way joint work on properties of stable minimal hypersurfaces. I continued to work with both\nYau\nand\nLeon\nwhile I was a student and was officially their joint Ph.D. student. I spent several hours a day working with\n(\nmostly learning from\n)\nYau\nwhen I was a student. He was interested in anything geometric, and he had ideas for approaching a vast range of problems. This was an incredible opportunity for me, and it gave me a great start on my research career. We wrote two more joint papers while I was a student.\nThese two joint papers were\nCurvature estimates for minimal hypersurfaces\n(1975)\n, and\nHarmonic maps and the topology of stable hypersurfaces and manifolds with non-negative Ricci curvature\n(1976)\n. Schoen considered that he was very lucky to have the opportunity to work with\nYau\nin these early days\n[\n41\n]\n:-\nI have vivid memories of\nYau\nfrom the early times: his tremendous dedication to his work\n(\nhe was in his office day and night including weekends\n)\n, his amazing breadth of knowledge and technique, his openness and generosity with his time.\nSchoen left Stanford in\n1976\nto take up the position of Instructor in Mathematics at the University of California, Berkeley. He was awarded his Ph.D. from Stanford University in\n1977\nfor his thesis\nExistence and Regularity Theorems for some Geometric Variational Problems\n. Soon\nYau\nalso arrived in Berkeley and their collaboration continued\n[\n41\n]\n:-\nI left Stanford in\n1976\nto take up a two year instructorship in Berkeley.\nYau\ncame to Berkeley during my second year, and we continued our collaboration. It was in Berkeley that we began our work on scalar curvature and the positive mass theorem.\nYau\nwas equally appreciative of having Schoen as a student, collaborator and friend\n[\n40\n]\n:-\nI've collaborated closely, in particular, with Rick Schoen for about forty-five years and have done some of my best work with him. Although he started out as my student, I'm sure I've learned as much from him as he has from me. I truly value his friendship.\nIt was in Berkeley that Schoen met Doris Helga Fischer-Colbrie. She had been born in Vienna, Austria, on\n12\nJanuary\n1949\nand had been educated at the University of California, Berkeley, receiving a BA in\n1971\nand a Master's degree two years later. She had been a Teaching Assistant at Berkeley while working for her doctorate advised by Blaine Lawson but, when Schoen arrived in Berkeley, she was a Research Assistant. She was awarded a Ph.D. in\n1978\nfor her thesis\nMinimal Varieties: Theorems on Global Comportment and Local Existence\n. Later, on\n29\nOctober\n1983\n, Richard Schoen and Doris Fischer-Colbrie were married; they had two children Alan\n(\nborn\n29\nFebruary\n1984)\nand Lucy\n(\nborn\n25\nApril\n1988)\n. Before they married, they wrote a joint paper\nThe structure of complete stable minimal surfaces in\n3\n-manifolds of nonnegative scalar curvature\nwhich appeared in print in\n1980\n. In it they studied minimal surfaces in three-dimensional manifolds which, on each compact set, minimize area up to second order. In the same year of\n1980\n, Doris published the single-authored paper\nSome rigidity theorems for minimal submanifolds of the sphere\n.\nSchoen spent two years as an Instructor at Berkeley, then in\n1978\nhe took up an appointment as an Assistant professor at New York University. He spent two years in this post and during these years he made major breakthroughs with the work that he and\nShing-Tung Yau\nhad begun at Berkeley\n[\n41\n]\n:-\nWe expanded this work substantially over the next few years, and I remember wonderful times working together at Stanford during the summers of\n1978\nand\n1979\n. During the\n1979\n-\n80\nacademic year\nYau\norganised a special year at the Institute for Advanced Study. This was another formative period in my career since there was so much going on in a wide variety of directions. I learned a lot and did some work that I am still proud of.\nAs indicated by this quote, Schoen was a Visiting Member at the Institute for Advanced Study, Princeton, during\n1979\n-\n80\n, a visit that was funded by a Sloan Postdoctoral Fellowship. Justin Corvino and Daniel Pollack describe the advances made by Schoen at this time\n[\n4\n]\n:-\n[\nA\n]\nwatershed for the mathematical development of relativity is the celebrated work of Rick Schoen and\nS-T Yau\nfrom the late seventies on the 'Positive Mass Theorem'. Not only did their work employ serious tools of geometric analysis, including partial differential equations and geometric measure theory, to resolve a question motivated by gravitational physics, but they also established a link between the positivity of the mass of an isolated gravitational system and the relationship between positive scalar curvature and topology, a topic of interest to a broad range of mathematicians. In the early eighties, Schoen brought the Positive Mass Theorem to bear on the resolution of the famous\nYamabe\nproblem, providing more evidence to support the development of the mathematical theory of the constraint equations, and inspiring many others to do so.\nIn\n1980\nSchoen returned to the University of California, Berkeley, when he was appointed as a Professor. He spent eight years at the University of California, the first four being at Berkeley and the remaining three,\n1984\n-\n87\n, being at San Diego. During these seven years, Schoen was invited to address the International Congress of Mathematicians twice. He give a\n45\nminute invited lecture at the Congress held in Warsaw in\n1983\n, then gave one of the plenary lectures at the Congress held in Berkeley in August\n1986\n. At the Berkeley Congress he gave the lecture\nNew Developments in the Theory of Geometric Partial Differential Equations\n. Dennis DeTurck describes the content of Schoen's lecture\n[\n42\n]\n:-\nThe author surveys recent work on nonlinear elliptic partial differential equations which arise from geometric sources, concentrating especially on the\nYamabe\nproblem and the theory of harmonic mappings. For the former, an outline is given of the recent solution of\nYamabe\n's conjecture\n(\nthat every metric on a compact manifold is pointwise conformally equivalent to one with constant scalar curvature\n)\n, including the use of the positive mass theorem and a discussion of regularity of weak solutions of\nYamabe\n's equation.\nThe solution of the\nYamabe\nproblem on compact manifolds, which Schoen discussed in this lecture, is one of his greatest achievements. He solved this problem in\n1984\n. He had been awarded a MacArthur Fellowship in August\n1983\n(\ntwo awards went to mathematicians with\nKaren Uhlenbeck\nreceiving one at the same time\n)\nand he held this Fellowship until\n1988\n. He had returned to Stanford University in\n1987\nand continued to work at Stanford as the Anne T and Robert M Bass Professor of Humanities and Sciences. Honours came rapidly: he was elected to the\nAmerican Academy of Arts and Sciences\nin\n1988\n; and he was awarded the\nBôcher\nMemorial Prize by the\nAmerican Mathematical Society\nin\n1989\n[\n2\n]\n:-\n... for his work on the application of partial differential equations to differential geometry, in particular his completion of the solution to the\nYamabe\nProblem in \"Conformal deformation of a Riemannian metric to constant scalar curvature\".\nFurther honours acknowledged his many achievements: he was elected to the\nNational Academy of Sciences\nin\n1991\n, he became a fellow of American Association for Advancement of Science in\n1995\n, and in the following year he was awarded a Guggenheim Fellowship. The Stanford University News described his work in the following terms when they announced his election to the\nNational Academy of Sciences\non\n30\nApril\n1991\n[\n10\n]\n:-\nSchoen,\n40\n, continues his research in differential geometry, nonlinear partial differential equations and the calculus of variations. He constructs and analyses geometric objects that optimise certain physical or geometric energies. For example, he has developed new ways to understand surfaces of least area spanning a curve in three-dimensional space - the mathematical model for soap films. Schoen's ideas have been applied to a wide range of mathematical problems, from general relativity to questions about rigidity for lattice subgroups of algebraic groups.\nWe must not give the impression that Schoen's major research contributions stopped in the\n1990\ns. Far from it and, just to give one example of a later highly significant work, let us note his achievement in\n2007\nwhen, in collaboration with Simon Brendle, he proved the differentiable sphere theorem. This is a fundamental result in the theory of manifolds with positive sectional curvature.\nIn addition to the visiting positions which we mentioned above, Schoen was a Visiting Member of the Institute for Advanced Study, Princeton, in the Spring of\n1984\n, a Visiting Professor at the\nCourant\nInstitute, New York University in academic year\n1989\n-\n90\n, Distinguished Visiting Professor at the Institute for Advanced Study, Princeton, in academic year\n1992\n-\n93\n, a Visiting Professor at Harvard University in the autumn of\n1999\n, and\nEilenberg\nChair at Columbia University in the autumn of\n2009\n.\nSchoen has published two important books, both in collaboration with\nShing-Tung Yau\n, which were based on lecture courses. In\n1994\nthey published\nLectures on differential geometry\n. We give the first and last paragraphs from a review by Man Chun Leung\n[\n9\n]\n:-\nAs the authors note in their introduction, the book under review was written for the lecture series given at Princeton University in\n1983\nand at the University of California, San Diego, in\n1984\nand\n1985\n. The book contains significant results in differential geometry and global analysis; many of them are the works of the authors. The main topics are differential equations on a manifold and the relation between curvature and topology of a Riemannian manifold. There are nine chapters in the book, with the last three chapters more like appendices, which focus on problems concerning different areas of differential geometry.\n...\nThe book under review is very well written. Readers will find comprehensive and detailed discussions of many significant results in geometric analysis. The book is both useful as a reference book for researchers and as a course book for graduate students. With details of proofs and background materials presented in a concise and delightful way, the book provides access to some of the most exciting areas in differential geometry.\nThe second book is\nLectures on harmonic maps\n(1997)\n. We give a short quote from a detailed review by John C Wood\n[\n39\n]\n:-\nThis is a very useful contribution to the literature on harmonic maps. It is not an elementary textbook on harmonic maps ... It is rather a collection of some of the most important topics in, and applications of, harmonic maps, skewed towards the authors' interests. ... this is a book that everyone interested in harmonic maps will benefit from reading.\nOther important contributions to mathematics by Schoen include his editorial work. He served on the editorial boards of: the\nJournal of Differential Geometry\n,\nCommunications in Analysis and Geometry\n,\nCommunications in Partial Differential Equations\n,\nCalculus of Variations and Partial Differential Equations\n, and\nCommunications in Contemporary Mathematics\n. He also does important work for the\nAmerican Mathematical Society\nserving on various committees. For example he served on the Committee to Select the Winner of the\nE H Moore\nResearch Article Prize, the Committee for National Awards and Public Representation, and the Committee to award Steele Prizes.\nFew lecturers receive such praise from their undergraduate students as Schoen does. We give just one short quote from many\n[\n34\n]\n:-\nBest Professor I've had so far at Stanford. His lectures are very lucid and compliment the text.\nWe mentioned above that Schoen lectured twice to the International Congress of Mathematicians in the\n1980\ns. He was also an invited plenary speaker at the International Congress of Mathematicians held in Hyderabad in\n2010\nwhen he gave the lecture\nRiemannian manifolds of positive curvature\n.\nThe book\n[\n3\n]\n,\nSurveys in Geometric Analysis and Relativity,\ncontains\n23\nsurvey articles and is dedicated to Richard Schoen on the occasion of his\n60\nth birthday. You can read the Preface to this volume at\nTHIS LINK\n.\nSchoen continued to be awarded prizes and given honours for his outstanding contributions. He was elected a Fellow of the\nAmerican Mathematical Society\nin\n2012\n, then he received the H&S Dean's Teaching Awards\n2014\n-\n15\nfrom Stanford University\n[\n25\n]\n:-\nThe Dean's Award for Distinguished Teaching recognises the efforts of exceptional teachers in the School of Humanities and Sciences and is given for excellence in graduate education, achievements in teaching, and first years of teaching at Stanford.\nIn\n2015\nhe received an Honorary Doctor of Science from the University of Warwick, England\n[\n38\n]\n:-\nDr Richard Schoen received his PhD from Stanford University in\n1977\n. He held positions at the\nCourant\nInstitute, UC Berkeley, and UC San Diego before returning to Stanford as Professor in\n1987\n. He is currently the Anne T and Robert M Bass Professor of Humanities and Sciences. He was chair of the Stanford mathematics department from\n2001\nuntil\n2004\n. ...\nSchoen received the honorary D.Sc. from the University of Warwick on\n14\nJuly\n2015\n. An oration was written by Mario Micallef, University of Warwick Mathematics Institute, and delivered by Chris Hughes of the Department of Politics and International Studies. For the oration, see\nTHIS LINK\n.\nThe year\n2017\nwas a remarkable one for the awards that Schoen received. In that year he was awarded: the Wolf Prize; the\nHeinz Hopf\nPrize; the\nLobachevsky\nMedal and Prize; and the Rolf Schock Prize. The Wolf Prize was awarded jointly to Richard Schoen and\nCharles Fefferman\n[\n21\n]\n:-\n...for their striking contributions to analysis and geometry.\nThe citation for Richard Schoen reads\n[\n21\n]\n:-\nRichard Schoen is awarded the Wolf Prize for being a pioneer and a driving force in geometric analysis. His work on the regularity of harmonic maps and minimal surfaces had a lasting impact on the field. His solution of the\nYamabe\nproblem is based on the discovery of a deep connection to general relativity. Through his work on geometric analysis, Schoen has contributed greatly to our understanding of the interrelation between partial differential equations and differential geometry. Many of the techniques he developed continue to influence the advance of non-linear analysis.\nThe\n2017\nHeinz Hopf\nPrize was awarded to Schoen\n[\n13\n]\n:-\n... for his outstanding and foundational contributions to differential geometry and geometric analysis.\nHe was presented with the Prize at the award ceremony in ETH Zurich on\n30\nOctober\n2017\n. He delivered two\nHeinz Hopf\nLectures, one on the day of the ceremony and one on the following day.\nThe winner of the\nLobachevsky\nMedal and Prize, Professor Richard Schoen\n[\n24\n]\n:-\n... is a specialist in differential geometry. He proved the positive energy theorem in general relativity, obtained a complete solution to the\nYamabe\nproblem on compact manifolds, and has contributed to the regularity theory of minimal surfaces and harmonic maps.\nThe award ceremony was held on\n1\nDecember\n2017\n, the official celebration of\nNikolai Lobachevsky\n's\n225\nth birthday.\nHe received the\n2017\nRolf Schock Prize in Mathematics for\n[\n43\n]\n:-\n... ground-breaking work in differential geometry and geometric analysis including the proof of the\nYamabe\nconjecture, the positive mass conjecture, and the differentiable sphere theorem.\nThe award ceremony was held at the\nRoyal Swedish Academy of Sciences\non\n14\nNovember\n2017\n.\nWe end this biography by quoting from\n[\n4\n]\nwritten by two mathematicians who received their doctorates with Schoen as advisor:-\nThe mathematical influence of Richard M Schoen can be measured in many ways. His research has fundamentally shaped geometric analysis, and his results form many cornerstones within geometry, partial differential equations and general relativity. Evidence of his influence includes the large number of his students who continue to work in these areas. As two of these students, the authors of this contribution are exceedingly grateful for Rick's mathematical insight and generosity.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}