{
  "nome_completo": "Richard Vincent Kadison",
  "nome_curto": "Richard Kadison",
  "ano_nascimento": "1925",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kadison/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Narberth, Pennsylvania, USA",
  "biografia": "Richard Kadison\nwas known to his friends and colleagues as Dick. His parents were David Edward Kadison\n(29\nMay\n1895\n-\n26\nAugust\n1974)\nand Rae Siegel\n(23\nApril\n1900\n-\n27\nAugust\n1988)\n. David Kadison had been born in New York to parents Jacob L and Sophie Kadushin. He became a salesman and later an architect in the building industry. Rae Siegel was born in Russia to Russian parents Israel Siegel and Lena Weisberg. The Siegel family emigrated to the United States in\n1902\n. David and Rae Kadison were married in the Bronx, New York, on\n22\nSeptember\n1924\n. David Kadison had changed the spelling of his name from Kadushin to Kadison before his marriage; he was still David Kadushin in the\n1920\ncensus.\nRichard Kadison attended the Bronx High School of Science, graduating in\n1942\n. Robert Osserman\n(1926\n-\n2011)\n, who became a professor of mathematics at Stanford University, said in the interview\n[\n7\n]\n:-\nI was very lucky with schools. I grew up in New York City which had some wonderful public high schools, and just at the time I was ready to think about where to go they started two new ones - the first specialty high schools. One was the High School of Music and Art, the other was the Bronx High School of Science. Both of them were free public high schools, but they required an examination to get in and admission was on a competitive basis. I was a member of the first full graduating class of the Bronx High School of Science and I had some wonderful teachers, as well as terrific fellow students. One of my classmates\n(\nwho happened coincidentally to live in the same apartment house in Manhattan that I did\n)\nwas Richard Kadison, who became a well-known mathematician ...\nKadson studied at the City College of New York but, because of World War II, served in the US Navy before completing his education. He served on various vessels, for example he was in France and returned to New York on the Sea Tiger as a junior\n3\nrd mate, arriving on the\n3\nAugust\n1945\n. He was then engaged in Baltimore as a\n3\nrd mate on\n9\nNovember\n1945\nserving on the Henry St George Tucker. His record for the Sea Tiger gives his height as\n5\n'\n8\n\" and his weight as\n162\nlbs\n(\nand\n169\nlbs on the second ship\n)\n. After completing his war service, he returned to his studies undertaking research at the University of Chicago with\nMarshall Harvey Stone\nas his thesis advisor.\nNot only did Kadison excel with his mathematical studies, but he also was a remarkable gymnast, being a member of the University of Chicago gymnastic team. Paul Wilson writes\n[\n9\n]\n:-\nIn the early\n1960\ns, my father told me of a brilliant gymnast at the University of Chicago. My father started at Chicago in\n1948\n, after he returned from the war, and he completed his MBA in\n1955\n. My father was a gymnast, a specialist in the flying rings, and he told me of Dick Kadison, a genius with the still rings.\nKadison graduated with a Ph.D. from the University of Chicago in\n1950\nafter writing his\n108\n-page thesis\nA Unified Representation Theory for Topological Algebra.\nAfter graduating, he was a National Research Fellow at the Institute for Advanced Study at Princeton, being a member from September\n1950\nuntil June\n1952\n. He published five papers in\n1951\nand four in\n1952\n.\nFor a list of publications by Kadison, see\nTHIS LINK\n.\nTwo of the\n1951\npapers are joint works by Kadison and Bent Fuglede who, after graduating with a D.Phil. from the University of Copenhagen in\n1948\n, was at the Institute for Advanced Study from August\n1950\nuntil April\n1951\n.\nKadison was appointed assistant professor at Columbia University, New York, in\n1952\n. He was a Fulbright Research Fellow during\n1954\n-\n55\n, promoted to associate Professor in\n1956\n, an Alfred P Sloan Research Fellow from\n1958\n-\n62\n, and a full professor in\n1960\n. He was a Fulbright Research Fellow in Copenhagen\n(1954\n-\n55)\n. On\n5\nJune\n1956\nhe married Karen M Holm\n(\nborn in Sioux City, Iowa, on\n23\nDecember\n1931)\n; they had one son Lars David Kadison who was born on\n24\nFebruary\n1958\n. Lars Kadison went on to become a mathematician being awarded a Ph.D. from the University of California, Berkeley, in\n1989\nfor his thesis\nCyclic Homology of Extension Algebras with Application to Matrix Algebras, Algebraic K-Theory and Nest Algebras of Operators\n.\nDuring his time at Columbia University, Kadison made trips to Denmark with his family. For example in the summer of\n1960\nKadison, his wife and two-year old son, went to Denmark. They returned on\n12\nSeptember, flying from Copenhagen to New York on flight SK\n903\n.\nAn important aspect of Kadison's work at Columbia was the Ph.D. students he attracted and advised. We should make special mention of Richard Kenneth Lashof\n(\nTopological Group Extensions and Lie Algebras of Locally Compact Groups\n,\n1954)\n; James G Glimm\n(\nOn a Certain Class of Operator Algebras\n,\n1959)\n; Marc Aristide Rieffel\n(\nA Characterization of Commutative Group Algebras and Measure Algebras\n,\n1963)\n; Erling Størmer\n(\nPoint Measures in the Two-Sided Non-Commutative Integration Theory\n,\n1963)\n; and Laurence Terrell Gardner, Jr.\n(\nOn Isomorphisms of C*-Algebras\n,\n1964)\n. These students all became university professors and advised their own Ph.D. students.\nKadison left Columbia University in\n1964\nto take up the Gustave C Kuemmerle chair of mathematics at the University of Pennsylvania.\nThe Columbia Daily Spectator\nreported on\n28\nApril\n1964\n[\n4\n]\n:-\nRichard V Kadison, professor of mathematics, will leave Columbia at the end of the term to assume the Gustave C Kuemmerle chair in mathematics at the University of Pennsylvania, President Gaylord P Harnwell of Pennsylvania has announced. His departure adds to an unusually large turnover in the mathematics department. Professor Kadison,\n38\n, is a leading expert in the field of functional analysis. He became a full professor at Columbia in\n1960\n. Appointed assistant professor in\n1952\n, he was a Fulbright Research Fellow during\n1954\n-\n55\nand an Alfred P. Sloan Research Fellow from\n1958\n-\n62\n. He is in France for the\n1964\nspring semester. Professor\nEllis R Kolchin\n, chairman of the department, expressed some surprise at Professor Kadison's decision to leave. He noted, \"we mustn't pretend that we're not hurt by the departure of Kadison.\"\nThe University of Pennsylvania had gone to great lengths to attract Kadison to come\n[\n6\n]\n:-\n[\nHe\n]\nwas attracted to Penn in\n1964\nas part of the mid-sixties modernization and build-up of Penn's Mathematics Department undertaken by the then Provost David Goddard and the then Chairman Oscar Goldman.  Indeed, Provost Goddard gave up his own chair\n(\nthe Gustave C Kuemmerle Chair\n)\nto help attract Kadison to Penn.  Dick held the Kuemmerle chair for the rest of his life.\nKadison did a remarkable job at the University of Pennsylvania, both in the books and papers he produced, and in the mathematicians and students he attracted\n[\n6\n]\n:-\nAt Penn, he was instrumental in  building a world famous group in his own area of mathematics\n(\nfunctional analysis and operator theory\n)\n; in the seventies, this was a great attraction for people to visit Penn's Math Department.  The area of operator theory is not only pure mathematics, it has deep connections to quantum mechanics and quantum field theory, to probability theory as well as to other areas of mathematics.  Dick worked tirelessly at the subject and its applications, he was known world-wide; he was an international mathematician.\nAlong with\nJohn Ringrose\n, Kadison published the two volume book\nFundamentals of the Theory of Operator Algebras\nwith volume\n1\n, subtitled\nElementary Theory,\nappearing in\n1983\nand volume\n2\n, subtitled\nAdvanced Theory,\nappearing in\n1986\n. This work has become a classic and was reprinted in\n1997\n. The two authors produced a further two volumes, the first being volume\n3\nsubtitled\nSpecial topics. Elementary theory - an exercise approach\npublished in\n1991\nand volume\n4\nsubtitled\nSpecial topics. Advanced theory - an exercise approach\nappearing in\n1992\n. Robert S Doran writes in a review of Volume\n1\n:-\nThe book under review, written by two eminent mathematicians each of whom has made major contributions to the theory of operator algebras, is the first of two volumes devoted to a \"textbook\" treatment of the theory of C*-algebras and\nvon Neumann\nalgebras. The authors' purpose is clearly stated in the first paragraph of the preface: \"\n[\nOur\n]\nprimary goal is to teach the subject and lead the reader to the point where the vast recent literature, both in the subject proper and in its many applications, becomes accessible.\" This point of view is to be contrasted with the many\n(\nexcellent\n)\nexisting books on the subject, which are primarily directed toward the research mathematician, or exist to provide background on operator algebras for applications in theoretical physics. ... Although the material in this first volume is standard and well known to experts, the authors have presented it in a fresh and attractive way which conveys the spirit and beauty of the subject. They are to be commended for writing a beautiful book which, in the reviewer's opinion, fulfils all of the promises made in the preface.\nNick Lord writes in\n[\n5\n]\n:-\nKadison and\nRingrose\n's 'Fundamentals of the theory of operator algebras' was originally published by Academic Press in the\n1980\ns. This two-volume work\n(\nsplit into 'Elementary theory' and 'Advanced theory'\n)\nmet with immediate acclaim from functional analysts as a clear, careful, self-contained introduction to C*- and\nvon Neumann\nalgebra theory - an area in which it is notoriously easy to intimidate rather than initiate graduate students! Experts too relished the fresh gloss that the immensely experienced duo of authors brought to the development of the theory, and lecturers appreciated the large and eclectic set of exercises provided at the end of each chapter which reflected the authors' total familiarity with the literature.\nOver his career, Kadison attended many conferences and published in the conference proceedings. In fact our list of his publications contains sixteen papers published in conference proceedings; see\nTHIS LINK\n.\nHere is Kadison's own description of one such conference\n[\n3\n]\n:-\n[\nI attended a conference at\n]\nUniversity of Newcastle-on-Tyne in England\n[\nin June\n2001]\n. That conference, on\nBanach\nAlgebras, was in honour of\nBarry Johnson\n, an heroic figure in that and allied subjects. There was a sadness about that meeting. Barry had terminal cancer and was near the end of his life. We all knew of Barry's mathematical heroism. On this occasion, we had the unhappy opportunity to note his physical courage as well. He attended a number of lectures, clearly with effort and in some pain, yet attentive and interested. Both he and Bill Arveson were at my lecture - paying close attention. I was speaking about some work I was doing related to the Pythagorean theorem - what is often referred to as the \"converse\"\n(\nif the numbers are right, there is a right triangle with sides of those lengths\n)\n.\nKadison received many honours for his outstanding contributions. For example he was elected to the\nNational Academy of Sciences\n(1996)\n, awarded an honorary degrees from the Université Aix-Marseille\n(1986)\nand the University of Copenhagen\n(1987)\n, elected to the\nRoyal Danish Academy of Sciences and Letters\n(1974)\n, elected one of the Inaugural Class of Fellows of the\nAmerican Mathematical Society\n(2013)\n, and elected to the\nAmerican Academy of Arts and Sciences\n(2018)\n.\nNot only was Kadison a member of the\nNational Academy of Sciences\nbut he was also a strong supporter. This was recognised by listing him in the Charter Society\n(\nthose who have donated $\n1\n‚\n000\nto $\n10\n‚\n000)\n, in the Challenge Society\n(\nthose who have donated $\n2\n,\n500\nto $\n5\n,\n0000)\n, in the Elkan Blout Society of the\nNational Academy of Sciences\n(\nmembers of the\nNational Academy of Sciences\nwho have contributed $\n20\n‚\n000\nto $\n100\n‚\n000)\n, and in the Loyalty Society\n(\nin recognition of members and friends who have made gifts to the\nNational Academy of Sciences\nfor at least\n20\nyears\n)\n.\nIn\n1999\nKadison was awarded the Leroy P Steele Prize for Lifetime Achievement by the\nAmerican Mathematical Society\n. The citation begins\n[\n8\n]\n:-\nThe Leroy P Steele Prize for Lifetime Achievement is awarded to Richard V Kadison, Kuemmerle Professor of Mathematics at the University of Pennsylvania. For almost half a century, Dick Kadison has been one of the world leaders in the subject of operator algebras, and the tremendous flourishing of this subject in the last thirty years is largely due to his efforts. He was a key organizer of two major conferences on operator algebras - in Baton Rouge, Louisiana, in\n1967\n, and in Kingston, Ontario, in\n1980\n- which helped shaped the modern history of the subject. His students have included many world-class mathematicians not only in operator algebras but in other fields as well. And in mathematical exposition, Kadison's papers and his two-volume monograph with\nJohn Ringrose\n, 'Fundamentals of the Theory of Operator Algebras'\n(\noriginally published by Academic Press, now reprinted by the AMS\n)\n, have been models of clarity and precision.\nFor Kadison's response to receiving this award, see\nTHIS LINK\n.\nOn Saturday\n10\nJanuary\n2015\n, as part of their winter meeting, the\nAmerican Mathematical Society\nheld a 'Special Session on Operator Algebras and Their Applications: A Tribute to Richard V Kadison'.\nKadison died in August\n2018\nafter a short illness. The University of Pennsylvania is organising a memorial conference, 'Operator Algebras in the\n21\nst Century; Richard V Kadison Memorial Conference -\n30\n-\n31\nMarch\n2019\n'. The conference website contains the following\n[\n1\n]\n:-\nStarting in the middle\n1960\ns the University of Pennsylvania was known as a world centre of mathematics connected to the foundations of Quantum Physics, including functional analysis, operator algebras,\nvon Neumann\nalgebras, and group representation theory. At the centre of this research effort and the very distinguished group of mathematicians who pursued it was Richard V Kadison. Dick was the Gustave C Kuemmerle Professor in the Department of Mathematics from\n1964\nuntil his sudden, and unexpected death this past July. This truly marks the end of a long and distinguished chapter in the history of the Penn Mathematics department, and of the University as a whole, but by no means does it mark the end of Operator Algebras as vital field of Mathematics. Dick's passing provides an occasion for a meeting that will both celebrate his central role in the growth and vitality of this field, and explore its current state and future directions.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics",
    "Topology"
  ]
}