{
  "nome_completo": "Richard Price",
  "nome_curto": "Richard Price",
  "ano_nascimento": "1723",
  "ano_morte": "1791",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Price/",
  "lugar_nascimento": "Tyn-ton, Llangeinor, Glamorgan, Wales",
  "lugar_morte": "Newington Green (near London), England",
  "biografia": "Richard Price\n's father was Rice Price, a Congregational minister. At quite a young age Richard seems to have adopted somewhat different religious opinions from those of his father, being attracted towards more liberal Christian views. He was educated privately then, after the death of his father in\n1739\n, he entered Fund Academy in Tenter Alley, London, one of the Dissenting academies that had been established independently by Nonconformists. We note that his religious views would have made it impossible for him to attend Oxford or Cambridge university, and the Dissenting academy provided an alternative to a university education for those wishing to study in England but who had views at odds with the standard beliefs of the Church of England.\nPrice left Fund Academy in\n1744\nand moved to Stoke Newington where he was family chaplain to George Streatfield. He ministered from time to time to various congregations, one of these posts having him assist Samuel Chandler at the Presbyterian Chapel at Old Jewry. In\n1756\nGeorge Streatfield and an uncle of Price died, and as a result of money left to him Price's financial circumstances improved greatly. By\n1757\nhe was in a strong enough financial position to marry Sarah Blundell, originally of Belgrave in Leicestershire, and in the following year they moved to Newington Green, a small village near Hackney. Price published\nReview of the Principal Questions in Morals\nin\n1757\nwhich contains his theory of ethics. He presented a rational case for moral decisions based on individual conscience and reason. He did not subscribe to the Christian doctrines of original sin and eternal punishment. Price wrote in the introduction:-\nThere are in truth none who are possessed of that cool and dispassionate temper, that freedom from all wrong biases, that habit of attention and patience of thought, and, also, that penetration and sagacity of mind, which are the proper securities against error. How much then do modesty and diffidence become us? How ought we to be to conviction, and candid to those of different sentiments?\nCertainly up to this point nothing we have mentioned about Price would suggest that he should be in this archive, but the reason that we have included him is his contributions to statistics. This seems to have come about through his friendship with\nBayes\n.\nWilliam Morgan\n, in his biography of Price, his uncle, wrote\n[\n2\n]\n:-\nOn the death of his friend\nMr Bayes\nof Tunbridge Wells in the year\n1761\nPrice was requested by the relatives of that truly ingenious man, to examine the papers which he had written on different subjects ...\nSeveral of\nBayes\n's papers were therefore given to Price. A\nNotebook\nwritten by\nBayes\nis still preserved in the muniment room of the Equitable Life Assurance Society and one has to assume that it was deposited there because Price was interested in the work of that Society, and involved with it. Price was responsible for the communication of\nBayes\n's\nEssay towards solving a problem in the doctrine of chances\nto the\nRoyal Society\n. Price wrote in the covering letter:-\nI now send you an essay which I have found among the papers of our deceased friend Mr\nBayes\n, and which, in my opinion, has great merit, and well deserves to be preserved.\nSome of the calculations, particularly in the appendix, no one can make without a good deal of labour. I have taken so much care about them, that I believe there can be no material error in any of them; but should there be any such errors, I am the only person who ought to be considered as answerable for them\n.\nAt times it is hard to tell which contributions Price made to\nBayes\n's work, but it is clear that Price was a modest man who did not seek credit for his contributions. He certainly shows himself to be a highly competent mathematician. In\n[\n4\n]\nZabell notes that Price stated:-\nIf an event has happened\nn\nn\nn\ntimes, there will be an odds of\n2\nn\n+\n1\n−\n1\n2^{n+1} - 1\n2\nn\n+\n1\n−\n1\nto one, for more than an equal chance that it will on further trials.\nZabell\n[\n4\n]\nnotes that:-\nThis is not\nLaplace\n's rule of succession, but rather a calculation of the posterior probability that the unknown chance x of the event exceeds\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n, based on\nBayes\n's assumption that all values of x are a priori equally likely.\nThe\nRoyal Society\nelected Price a fellow in\n1765\non the strength of his contributions to\nprobability\n. D O Thomas suggests that it was his publication of\nBayes\n's papers which started Price's:-\n... increasing involvement in insurance, demography, and financial and political reform.\nIt was in\n1769\n, in a letter to\nBenjamin Franklin\n, that Price commented on the expectation of lives, the increase of mankind, and the population of London. His observations were published in the\nPhilosophical Transactions of the Royal Society\nlater the same year. In May\n1770\nPrice wrote to the\nRoyal Society\nexplaining how to calculate the values of contingent reversions. Price seemed to be well aware that the recently established insurance and benefit societies were basing the calculations of their policies on erroneous theory.\nWe know that Price's scientific interests were very broad. That he was also interested in electricity is demonstrated by the fact that Joseph Priestley thanks him in the introduction to\nHistory and present state of electricity\n:-\n... for the attention\n[\nhe\n]\nhas given to the work, and for the many important services\n[\nhe has\n]\nrendered me with respect to it.\nIn fact Joseph Priestley, the discoverer of oxygen, was a friend of Price. They were both ordained to the Dissenting ministry and Priestley frequently visited Price in Newington Green. Other friends who visited Newington Green included John Howard, John Quincy Adams,\nBenjamin Franklin\nand Adam Smith.\nin\n1776\nPrice published a pamphlet\nObservations on Civil Liberty and the War with America\n. It is said that the\nDeclaration of Independence of the Thirteen Colonies\nmade on\n4\nJuly\n1776\nwas influenced by Price's pamphlet. A second pamphlet in the spring of\n1777\nagain discussed the war with America but also discussed national debts and other financial matters. In the winter of\n1778\nhe was invited by Congress to go to America to assist in financial administration but he declined.\nSarah Price died in\n1786\nand by this time Price's health was deteriorating. However he still had the energy to preach a highly controversial sermon in\n1789\n:-\nOn the forenoon of the\n4\nth\nof November\n[1789]\n, Doctor Richard Price, a non-conforming minister of eminence, preached at the dissenting meeting-house of the Old Jewry, to his club or society, a very extraordinary miscellaneous sermon, in which there are some good moral and religious sentiments, and not ill expressed, mixed up in a sort of porridge of various political opinions and reflections; but the Revolution in France is the grand ingredient in the cauldron.\nThe sermon, which was published, was highly controversial and Edmund Burke wrote a vigorous reply in\nReflections on the Revolution in France\narguing strongly in favour of an inherited monarchy. In the fourth edition of his published sermon Price wrote an introduction:-\nSince the former editions of the following discourse, many animadversions upon it have been published. Under the abuse with which some of them are accompanied, I have been comforted by finding myself joined to the City of Paris, and the National Assembly of France. I cannot think of employing my time in making any replies. Knowing that it has been the labour of my life to promote those interests of liberty, peace, and virtue, which I reckon the best interests of mankind, and believing that I have not laboured quite in vain, I feel a satisfaction that no opposition can take from me, and shall submit myself in silence to the judgment of the public without taking any other notice of the abuse I have met with than by mentioning the following instance of it.\nThe Unitarian Society was established in\n1791\n, shortly before Price's death, and he became a founder member. Price was buried in Bunhill Fields on\n26\nApril\n1791\nand at the service Joseph Priestley gave the funeral sermon. Bunhill Fields was a dissenters' cemetery for those whose beliefs took them outside the Church of England.\nPrice was famous in his day, although his views were highly controversial, and many came to hear him preach. He received the freedom of the City of London and was honoured with the award of the degree of D.D. from Yale College.",
  "math_areas": [
    "Statistics"
  ]
}