{
  "nome_completo": "Richard Askey",
  "nome_curto": "Richard Askey",
  "ano_nascimento": "1933",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Askey/",
  "lugar_nascimento": "St Louis, Missouri, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Richard Askey\n's parents were Philip Edwin Askey and Bessie May Yates. He attended Washington University and graduated with a B.A. in\n1955\n. Already attracted towards analysis by the strong analysis school at Washington University, he then went to Harvard University to study for his Master's degree and in\n1956\nhe received his M.A.\nAfter graduating from Harvard, Askey moved to Princeton University to study for his doctorate. In\n1958\nhe accepted a post of Instructor back at Washington University and he held this position until\n1961\n, the year in which he graduated with his Ph.D. from Princeton University. His next move was to the University of Chicago where he was an Instructor for two years before accepting the post of Assistant Professor of Mathematics at the University of Wisconsin-Madison in\n1963\n. Two years later he was promoted to Associate Professor of Mathematics then, in\n1968\n, he became a full Professor.\nIt is impossible in an article like this to give much in the way of details of the impressive publications by Askey on the harmonic analysis of special functions, orthogonal polynomials and special functions, and special functions related to group theory. To date over\n180\npublications are listed under his name. The first of these publications was\nWeighted quadratic norms and ultraspherical polynomials\nin\n1959\nwhich he wrote jointly with Isidore Hirschman Jr. It appeared in the\nTransactions of the American Mathematical Society\n. This was the first of two papers by Askey and Hirschman which completed a programme of research initiated by Hirschman in\n1955\n. In\n1965\nAskey published\nOn some problems posed by Karlin and\nSzegő\nconcerning orthogonal polynomials\nand by this time his major contributions to special functions and orthogonal polynomials were well under way.\nAskey published an important book\nOrthogonal polynomials and special functions\nin\n1975\n. This work was based on ten lectures that he gave to the National Science Foundation Regional Conference at Virginia Polytechnic Institute and State University in June of\n1974\n. In the book\nhypergeometric functions\n,\nBessel functions\n, the\nJacobi\northogonal polynomials, the Hahn orthogonal polynomials,\nLaguerre\npolynomials,\nHermite\npolynomials, Meixner polynomials, Krawtchouk polynomials and Charlier polynomials all play their part in addition to other orthogonal polynomials and special functions. Askey states clearly in this text why he is interested in special functions:-\nOne studies special functions not for their own sake, but to be able to use them to solve problems.\nG Gasper, in reviewing Askey's book, states:-\nThis is one of the best introductions to special functions for mathematicians, scientists, and engineers that I know of.\nTwenty five years after he gave his series of ten lectures to the National Science Foundation Regional Conference, Askey published another major work on special functions. This\n1999\nbook is co-authored by George E Andrews and Ranjan Roy, and is called simply\nSpecial Functions\n. Published by Cambridge University Press, this new work is six times the length of the earlier one. Bruce C Berndt, reviewing this important book, puts it in context:-\nSpecial functions, which include the trigonometric functions, might be called \"useful\" functions. For some years, the field was somewhat dormant, but in the past three decades, special functions have returned to the forefront of mathematical research. ... fresh new ideas, in large part due to the authors; the many new uses of special functions; and their connections with other branches of mathematics, physics, and other sciences have played leading roles in this revival. ...\nThe book genuinely reflects the authors' vast accumulated insights. Most notably, the authors demonstrate a superb familiarity with the historical roots of their subject. Many of their historical insights and references could have been provided only by them.\nIf one were to single out one paper by Askey of being of particular importance, it must be the one which contained a result which was used by\nLouis de Branges\nin giving his complete proof of the\nBieberbach\nConjecture in\n1984\n.\nAskey is not only known for his mathematical research, however, for he is also a highly respected writer on mathematical education. Perhaps his most famous article on this topic is\nGood Intentions are not Enough\n. He has also served the\nAmerican Mathematical Society\nin many ways since he first became a member in\n1966\n, sitting on numerous committees and being Vice President of the Society in\n1986\n-\n87\n. In particular, his great interest in the history of mathematics is reflected but the fact that he served on the Committee on Mathematical History from\n1987\nto\n1991\n.\nWe have already referred above to his lectures to the National Science Foundation Regional Conference in\n1974\n. He also gave two series of lectures in\n1984\n, namely the University of Illinois Trjitzinsky Lectures and the Pennsylvania State University College of Science Lectures. In\n1992\nhe gave the\nTurán\nMemorial Lectures in Budapest.\nAmong the many honours which have been given to Askey we can mention only a few. He is an Honorary Fellow of\nIndian Academy of Sciences\nand a Fellow of\nAmerican Academy of Arts and Science\n. He received what might be considered his greatest honour in\n1999\nwhen he was elected to the\nNational Academy of Sciences\n.\nAskey has remained at the University of Wisconsin-Madison since his first appointment in\n1963\n, becoming\nGabor Szegő\nProfessor of Mathematics in\n1986\nand John Bascom Professor of Mathematics in\n1995\n.",
  "math_areas": [
    "Analysis",
    "Logic"
  ]
}