{
  "nome_completo": "Robert Hooke",
  "nome_curto": "Robert Hooke",
  "ano_nascimento": "1635",
  "ano_morte": "1703",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hooke/",
  "lugar_nascimento": "Freshwater, Isle of Wight, England",
  "lugar_morte": "London, England",
  "biografia": "Robert Hooke\n's father was John Hooke who was a curate at All Saints Church in Freshwater on the Isle of Wight. Although formally a curate, since the minister was also Dean of Gloucester Cathedral and of Wells, John Hooke was left in charge of All Saints. It was a well off church being in the patronage of St John's College, Cambridge. As well as his duties in the church, John Hooke also ran a small school attached to the church and acted as a private tutor. Robert had a brother named John, the same name as his father, who was five years older.\nRelatively few details of Robert's childhood are known. What we record here is information which he mentioned to his friends later in his life. Robert, like many children of his day, had poor health and was not expected to reach adulthood. His father was from a family in which it was expected that all the boys joined the Church\n(\nJohn Hooke's three brothers were all ministers\n)\nso had Robert enjoyed good health as a child there is no doubt that he would have followed the family tradition. As it was Robert's parents did begin to set up his education with this in mind but he continually suffered from headaches which made studying hard. Lacking confidence that he would reach adulthood, Robert's parents gave up on his education, leaving him much to his own devices.\nRobert's own ideas involved his observational skills and his mechanical skills. He observed the plants, the animals, the farms, the rocks, the cliffs, the sea, and the beaches around him. He was fascinated by mechanical toys and clocks, making many things from wood from a working clock to a model of a fully rigged ship with working guns. Waller, in the Preface to Hooke's\nPosthumous Works\npublished in\n1705\n, dates his belief in mechanics, in particular his belief that nature was a complicated machine, from the time that he let his imagination and his talents run riot at about age ten.\nFrom about the time Robert was ten his father became ill and this contributed to Robert being left to educate himself in the highly practical way that interested him. Not only did Robert show talents at science, but he also showed skills at drawing. There was a portrait painter, John Hoskyns, who was working at Freshwater at this time and Robert used to watch him at work. Soon he was imitating the way that Hoskyns used pen and chalk, and he was making copies of Hoskyns' portraits. His talent was clear and after the death of his father in\n1648\nRobert's family decided that drawing was the best way that he might earn a living. He was left £\n40\nby his father, together with all his father's books\n(\nthe often quoted figure of £\n100\nis a much repeated error\n)\n, and his family sent him to London to become an apprentice to the Peter Lely, a portrait painter.\nLely had studied at Haarlem in Holland and set himself up in London about five years before Hooke was sent to him. Lely quickly gained fame painting portraits of Charles I and James, Duke of York. Influenced by Van Dyck he became the most technically proficient painter in England and Hooke could have learnt much from such a leading expert. However, he soon decided that it would waste his money studying under Lely, and he made the decision that what he really needed was a school education. Hooke enrolled in Westminster School, boarding in the house of the headmaster Richard Busby. Indeed Hooke was fortunate to come under the influence of Busby who was an outstanding teacher who quickly realised that he had a quite remarkable pupil. Hooke had mastered the first six books of Euclid's\nElements\nby the end of his first week at school but Busby seemed to understand that formal learning was not going to be best for Hooke and so encouraged him to study by himself in his library\n[\n10\n]\n:-\nHooke was fortunate in gaining the respect of Dr Busby and being left to follow his own pursuits of knowledge just as he had before attending Westminster School.\nAt Westminster Hooke learnt Latin and Greek but, although he enjoyed speaking Latin, unlike his contemporaries he never wrote in Latin. His rapidly gained understanding of geometry was soon applied to his real love of mechanics and he began to invent possible flying machines. Music was another of his interests and he learnt to play the organ. In\n1653\n, feeling that he had assimilated as much knowledge as Westminster School could offer, he entered Christ Church, Oxford where he won a chorister's place. He began to study at Oxford at a particularly significant time for Thomas Willis, Seth Ward,\nRobert Boyle\n,\nJohn Wilkins\n,\nJohn Wallis\n,\nChristopher Wren\nand William Petty were among those who regularly met as the \"Oxford branch\" of the \"invisible college\" or the \"philosophical college\" which had been set up in\n1648\n-\n49\nwhen some of the scientists meeting in London moved to Oxford.\nIn Oxford Hooke learnt astronomy from Seth Ward and impressed\nWilkins\nwith his knowledge of mechanics.\nWilkins\ngave him a copy of his book\nMathematical Magick, or the wonders that may be performed by mechanical geometry\nwhich he had published five years before Hooke arrived in Oxford. This book encouraged Hooke to continue to try to invent a flying machine and he conducted experiments in the grounds of Wadham College with pulleys. For a while Hooke assisted Willis with his dissection experiments. He was involved with the top English scientists of the day, benefiting greatly by acquiring skills in a wide range of disciplines\n[\n1\n]\n:-\n... Hooke never took a bachelor's degree\n[\nbut\n]\nOxford had given him more than a thousand degrees could match.\nBoyle\nwas looking for an assistant and Willis recommended Hooke to him. From\n1655\nhe was employed by\nBoyle\nand his first project was to construct an air pump. The main area of\nBoyle\n's interests were in chemistry but he had read of experiments conducted by von Guericke with the aid of an air pump and, knowing Hooke's skill with mechanical instruments, asked him if he could build one. A better air pump than that used by von Guericke had been made by Greatorix but Hooke felt that he could improve on the design. Indeed he did so and Hooke designed and built what is essentially the modern air pump.\nHooke was never a person who did one thing at a time, indeed he seemed at his best when his mind was jumping from one idea to another. At the same time that he was working on the air pump he was also thinking about clocks and how they could be used in determining the longitude at sea. Realising the weakness of the pendulum clock in keeping time on a ship which was pitching and tossing, he wondered about the:-\n... use of springs instead of gravity for making a body vibrate in any posture.\nRather than the balance wheel being controlled by a pendulum which in turn operated through gravity, he reasoned that controlling the balance wheel with a spring would have huge advantages for a portable timekeeper that one might carry around or one which would have to continue to keep the correct time on a ship. Beginning his experiments around\n1658\nhe had made two significant steps by\n1660\n, namely the use of a balance controlled by a spiral spring and an improved escapement called the anchor escapement. In\n1660\nhe discovered an instance of Hooke's law while working on designs for the balance springs of clocks. However he only announced the general law of elasticity in his lecture\nOf Spring\ngiven in\n1678\n.\nIn fact\n1660\nwas the year when a rather strange event happened regarding Hooke's spring controlled clocks. In that year he was backed by\nWren\n, Moray and\nBrouncker\nin his design of a spring controlled clock and a patent was drawn up. It could have led to him making a fortune, but when he realised that the patent would allow anyone who improved on his design to receive the royalties, he refused to continue with the patent.\nPolitical circumstances now determined the course of events. After Cromwell's death in\n1658\nhis son took over but was ineffectual. Many of the scientists in Oxford had been appointed because of their Puritan sympathies and they now lost their positions and moved to London. Monck, who had been appointed as governor in Scotland, marched an army on London and restored order in early\n1660\n. Monck called for new elections to Parliament, knowing that the mood of the people would elect Royalists. The improvement in the situation in London, in particular troops which had been stationed in Gresham College now left, allowed the scientists to begin meeting again in the College. On Wednesday\n28\nNovember\n1660\na meeting in Gresham College constituted the Society for the Promoting of Physico-Mathematical Experimental Learning which they declared would promote experimental philosophy.\nHooke's first publication was a pamphlet on capillary action. On\n10\nApril\n1661\nhis paper was read to the Society in which he showed that the narrower the tube, the higher water rose in it. The Society at Gresham had by this time petitioned King Charles II to recognise it and to make a royal grant of incorporation. The Royal Charter, which was passed by the Great Seal on\n15\nJuly\n1662\n, created the\nRoyal Society of London\nand the Royal Charter contained a provision to appoint a Curator of Experiments. The\nSociety\nalready had in mind appointing Hooke to this position and indeed on\n5\nNovember\n1662\nhe was given the position. In many ways it did not look a marvellous deal for he was required to demonstrate three or four experiments at every meeting of the\nSociety\n, something that was quite unrealistic and it is doubtful that anyone other than Hooke could have contemplated being able to provide. Although it was hoped that the\nSociety\nwould eventually be able to provide payment to Hooke, he was required to undertake the work without any recompense until the\nSociety\nwas in a position to do so.\nIn fact Hooke reacted to the impossible task set him by producing a wealth of original ideas over the following\n15\nyears. It would be fair to say that it was through Hooke's flood of ideas that the\nSociety\nprospered, but equally the demands brought out Hooke's genius to the full. Although the demands meant that he never had time to develop his ideas over time as one would expect a leading scientist to do, on the other hand it seemed to suit his nature to have his mind jump for one half thought out idea to the next. He was elected to the\nRoyal Society\non\n3\nJune\n1663\nand, although he was still receiving no payment, at least the\nSociety\nwas prepared to allow him to become a Fellow without paying the annual fees.\nIn\n1664\nthe\nSociety\nagreed to pay Hooke a salary of £\n80\nper year but shortly after this they arranged the position of Cutlerian Lecturer in the Mechanical Arts for him at a salary of £\n50\nper year and then reduced his salary as Curator of Experiments to £\n30\nbut gave him an appointment for life. This did not provide the financial security that Hooke might have hoped for, since the\nSociety\noften did not have sufficient funds to pay him as Curator of Experiments and when he was not paid for his duties as Cutlerian Lecturer in the Mechanical Arts he was forced to go to court to get payment.\nHe did however secure another appointment, namely that of Professor of Geometry at Gresham College, London, being appointed there in\n1665\n. The position gave him rooms at the College and required him to give one lecture each week in term time. The lecture had to be given in Latin and subsequently repeated in English. He was required to be unmarried but was permitted a housekeeper.\nThe year\n1665\nwas the one when Hooke first achieved worldwide scientific fame. His book\nMicrographia\n, published that year, contained beautiful pictures of objects Hooke had studied through a microscope he had made himself. The book also contains a number of fundamental biological discoveries. Pepys wrote in his diary:-\nBefore I went to bed I sat up till two o'clock in my chamber reading Mr Hooke's Microscopical Observations, the most ingenious book that ever I read in my life.\nWestfall writes\n[\n1\n]\n:-\nMicrographia remains one of the masterpieces of seventeenth century science. ...\n[\nit\n]\npresented not a systematic investigation of any one question, but a bouquet of observations with courses from the mineral, animal and vegetable kingdoms. Above all, the book suggested what the microscope could do for biological science.\nHooke invented the conical pendulum and was the first person to build a Gregorian reflecting telescope. He made important astronomical observations including the fact that Jupiter revolves on its axis which he discovered from observing spots. He then invented a helioscope to attempt to measure the rotation of the sun using sunspots. He made drawings of Mars which were later used to determine its period of rotation. He observed several comets and asked a number of important questions about them, including why the tail points away from the sun, and how if the comet is burning it could burn for so long and burn in a place where there is no air. In\n1666\nhe proposed that gravity could be measured using a pendulum.\nIn addition to his post as Professor of Geometry at Gresham College, Hooke held the post of City Surveyor. He was a very competent architect and was chief assistant to\nWren\nin his project to rebuild London after the Great Fire of\n1666\n. Westfall writes\n[\n1\n]\n:-\nWren and Hooke dominated and guided the work, and cemented a friendship that lasted throughout their lives. To Hooke the position of surveyor was a financial boon, more than compensating for the uncertainty of his other income.\nWhen\nNewton\nproduced his theory of light and colour in\n1672\n, Hooke claimed that what was correct in\nNewton\n's theory was stolen from his own ideas about light of\n1665\nand what was original was wrong. This marked the beginning of severe arguments between the two. In\n1672\nHooke attempted to prove that the Earth moves in an\nellipse\nround the Sun and six years later proposed that inverse square law of gravitation to explain planetary motions. Hooke wrote to\nNewton\nin\n1679\nasking for his opinion:-\n... of compounding the celestiall motions of the planetts of a direct motion by the\ntangent\n(\ninertial motion\n)\nand an attractive motion towards the centrall body ... my supposition is that the Attraction always is in a duplicate proportion to the Distance from the Center Reciprocall ...\nHooke, however, seemed unable to give a mathematical proof of his conjectures or perhaps unwilling to devote his time to this type of pursuit. However he claimed priority over the inverse square law and this led to a bitter dispute with\nNewton\nwho, as a consequence, removed all references to Hooke from the\nPrincipia\n.\nFrequent bitter disputes with fellow scientists occurred throughout Hooke's life. On the other hand, we should note that he was on very good terms with some colleagues, particularly\nBoyle\nand\nWren\n. Historians have described Hooke as a difficult and unreasonable man but in many ways this is a harsh judgement. There is no doubt that Hooke genuinely felt that others had stolen ideas which he had been first to put forward. It is easy to see why this happened. Hooke did indeed come up with a vast range of brilliant ideas many of which were claimed by others not because they wished to steal them from him, but rather because Hooke never followed through developing his ideas into building comprehensive theories. He failed to develop major theories from his inspired ideas for the simple reason that he did not really have the technical ability to develop such comprehensive theories as some of his contemporaries like\nNewton\nand\nHuygens\n.\nThe diaries of Hooke are fascinating documents in that they tell us something about his character as well as painting an interesting picture of his times. Here are some examples taken from\n[\n10\n]\n:-\nHe was a brisk walker, and enjoyed walking in the fields north of the City. ... he generally rose early, perhaps to save candles, and to work in daylight and prevent strain to his eyes. ... Sometimes Hooke would work all through the night, and then have a nap after dinner. As well as drinking a variety of waters ... he drank brandy, port, claret, sack, and birch juice wine which he found to be delicious. He also had a barrel of Flanstead's ale and Tillotson's ale. There are a few instances when he recorded that he had been drunk ... He was a gregarious person, who liked to meet people, particularly those who had travelled abroad ...\nAs Hooke grew older he became more cynical and would shut himself away from company. The papers which he wrote in the last few years of his life are filled with bitter comments. In February\n1690\nHooke gave two lectures to the\nRoyal Society\nwhich are reproduced in part in\n[\n26\n]\n. At this time, according to Waller\n[\n11\n]\n, Hooke was:-\n.. often troubled with headaches, giddiness, and fainting, and with a general decay all over, which hindered his philosophical studies, yet he still read some lectures whenever he was able.\nHooke shows how bitter he feels in these lectures. For example, in the second lecture he said:-\n[\nHuygens\n' Preface\n]\nis concerning those properties of gravity which I myself first discovered and showed to this\nSociety\nand years since, which of late Mr\nNewton\nhas done me the favour to print and publish as his own inventions. And particularly that of the oval figure of the Earth which was read by me to this\nSociety\nabout\n27\nyears since upon the occasion of the carrying the pendulum clocks to sea and at two other times since, though I have had the ill fortune not to be heard, and I conceive there are some present that may very well remember and do know that Mr\nNewton\ndid not send up that addition to his book till some weeks after I had read and showed the experiments and demonstration thereof in this place and had answered the reproachful letter of Dr\nWallis\nfrom Oxford. However I am well pleased to find that the truth will at length prevail when men have laid aside their prepossessions and prejudices. And as that hath found approvers in the world and those thinking men too, so I doubt not but that divers other discoveries which I have here first made\n(\nwhen they come to be well considered and examined\n)\nbe found not so unreasonable or extravagant as some would willingly make them.\nAfter his death Waller edited\n[\n11\n]\n, a major publication of previously unpublished works by Hooke. A large portion of this work is devoted to Hooke's lectures on earthquakes. Over a period of thirty years he made major contributions to geology, particularly his investigation of fossil remains which convinced him that major changes had occurred in the Earth's surface which had lifted fossilised shells of marine animals to high points in mountain ranges.\nHooke has been described as a:-\n... lean, bent and ugly man ...\nand so it was believed that he did not sit for a portrait. A possible portrait recently found at the\nRoyal Society\nhas now been established as being of someone else.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry",
    "Logic"
  ]
}