{
  "nome_completo": "Robert Tucker",
  "nome_curto": "Robert Tucker",
  "ano_nascimento": "1832",
  "ano_morte": "1905",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tucker_Robert/",
  "lugar_nascimento": "Walworth, Surrey, England",
  "lugar_morte": "Worthing, England",
  "biografia": "Robert Tucker\nwas the son of Robert Tucker and Fanny Tucker. Fanny's maiden name was Tucker, the same as her married name, Robert and Fanny being second cousins. Robert Tucker Sr. was in the Army, an occupation that many of the Tucker family followed. He served in the Peninsula War\n(1808\n-\n14)\nin Spain and Portugal under Arthur Wellesley, afterward Duke of Wellington, fighting against Napoleon and his allies. However Robert Tucker Sr. died when Robert, the subject of this biography, was still an infant.\nRobert attended school in Newport before going to Woodard School at New Shoreham. The head of this latter school was Henry Jacobs, a cousin of Robert Tucker, who gave him much encouragement and support. Robert was encouraged to sit the examinations to win a\nsizarship\nat St John's College, Cambridge, and although he was unsuccessful at his first attempt, he tried successfully in the following year. He matriculated at St John's College in\n1851\nand began a successful undergraduate career. He won a Foundation Scholarship in\n1854\nand was a\nWrangler\n(\nFirst Class\n)\nin the Mathematical Tripos examinations of\n1855\n(\nalthough quite far down the ranked list\n)\n. Following this, Tucker remained at Cambridge studying Hebrew and Moral Philosophy before taking up an appointment as a mathematics teacher. M J M Hill writes\n[\n1\n]\n:-\n... he took his first mastership under the Rev J R Pears, of Windlesham, Bagshot, who was the Head Master of a preparatory school for Haileybury. After eighteen months spent here, there followed a short period of mastership at a private school\n(\nMr John Ogle's\n)\nin St John's Wood. In February\n1859\n, he took his M.A., and went as a master to the school of the Rev J A Wall at Portarlington. Here he taught, with success, for five years. ... In\n1864\nhe returned to the Isle of Wight for a year's rest. After this he took a mastership at Brighton College, where he had part charge of the Civil and Military Department. In September\n1865\n, University College School had need of a successor to the late George Campbell De Morgan as Mathematical Master. The Head Master of the school, Professor Key, influenced chiefly by the warm support of Mr Tucker's candidature by\nIsaac Todhunter\n, appointed him to the post which he was to fill so well until July\n1899\n.\nIn April\n1866\n, Tucker married Elizabeth Byles, the only daughter of William Byles of Freshwater; they had three daughters. Tucker had already become a member of the\nLondon Mathematical Society\nbefore his marriage. This was not too surprising since by the time the Society was founded in\n1865\n, Tucker was teaching at University College School while the Society held its meetings in University College for the first couple of years after its foundation. Tucker was one of the\n70\nwho joined the Society during\n1865\n, joining in October of that year. He rapidly became involved in the affairs of the new Society and he was appointed Honorary Secretary of the Society in November\n1867\n. He held this position until\n1902\nand, remarkably, served under\n19\ndifferent Presidents:\nJ J Sylvester\n,\nA Cayley\n,\nW Spottiswoode\n,\nT A Hirst\n,\nH J S Smith\n,\nLord Rayleigh\n,\nC W Merrifield\n,\nS Roberts\n,\nO Henrici\n,\nJ W L Glaisher\n,\nJ Cockle\n,\nJ J Walker\n,\nG Greenhill\n,\nA B Kempe\n,\nP A MacMahon\n,\nE B Elliott\n,\nW Thomson\n,\nE W Hobson\n, and\nH Lamb\n. During the\n35\nyears that he was secretary, Tucker only missed three meetings of the Society.\nEdwin Elliott\n, in his presidential address in\n1898\nsaid:-\nNearly all the papers which the Society has ever received have caused\n[\nTucker\n]\ncorrespondence. Sixteen Presidents have, like myself, found their office free from anxiety because of his and his colleagues' assiduity. There has been no limit to the burdens he would willingly take upon himself in his absolutely unselfish devotion to the interests of the Society. Such a use of what might have been the leisure of half a life-time has put mathematical science under an obligation for which no gratitude would be excessive. May he long be good enough, and have the health and strength, to add to this load of obligation!\nThe reason that Tucker had corresponded with the author of almost every paper submitted to the Society until\n1902\nwas that he edited almost all of the first\n30\nvolumes of the\nProceedings\nof the\nLondon Mathematical Society\n. It is worth quoting from Tucker's reply to the testimonial he received after his move away from London in\n1902\nforced his resignation:-\nThere is one man who stands out as a brilliant mathematician and kind friend - I mean\nW K Clifford\n. He and\nH J S Smith\nmade our meetings delightful to look back upon. To the former I was glad to be able to render such service as it was in my power to show. His wish that I should edit his papers was totally unexpected, and would have been impossible of execution had it not been for the promise of aid from others. The resignation of the Secretaryship to which I have devoted half my life will at first exercise a depressing effect upon me; but the rest I shall obtain, and the knowledge that I shall have acquired that my labours, though falling short of what they might have been, have been valued, will cheer me in my retirement. And now I conclude with a quotation which I used in my preface to\nClifford\n's papers: 'If I have done well, it is that which I desired; but, if slenderly and meanly, it is that which I could attain unto.'\nAlready from this quotation the reader will have realised that a major mathematical contribution made by Tucker was his work as editor of\nWilliam Kingdon Clifford\n's papers. Fifty-seven of\nClifford\n's papers were collected and edited by Tucker and published in\n1882\nas\nMathematical Papers\n. Tucker also wrote many biographies including those of\nGauss\n,\nSylvester\n,\nChasles\n,\nSpottiswoode\n, and\nHirst\n, all of which appeared in\nNature\n. But, like a number of schoolmaster's at this time, he also made a contribution to research in geometry. He wrote over\n40\nresearch papers which were published in leading journals such as\n17\npapers in the\nProceedings\nof the\nLondon Mathematical Society\n,\n9\npapers in the\nProceedings\nof the\nEdinburgh Mathematical Society\n,\n10\npapers in the\nMessenger of Mathematics\n, and\n4\npapers in the\nQuarterly Journal of Pure and Applied Mathematics\n. These papers, although sometimes not of the highest quality, do contain a number of interesting ideas. For example in\n[\n1\n]\nHill specially singles out for special mention his work on the Triplicate-Ratio Circle, the group of circles sometimes known as Tucker Circles, and the Harmonic Quadrilateral. The first of these appeared in\nThe Triplicate-Ratio Circle\n(1883)\nand the second in\nA Group of Circles\n(1884)\n, both papers being published in the\nQuarterly Journal of Pure and Applied Mathematics\n. His work on the Harmonic Quadrilateral is in\nSome Properties of a Quadrilateral in a Circle the Rectangles under whose Opposite Sides are Equal\n(1886)\nwhich\nJohn Sturgeon Mackay\ndescribes as follows:-\nThe first systematic study of harmonic quadrilaterals was made by Mr Tucker. ln his article \"Some Properties of a Quadrilateral in a Circle the Rectangles under whose opposite Sides are equal,\" read to the\nLondon Mathematical Society\non\n12\nth\nFebruary,\n1885\n, and printed in 'Mathematical Questions from the Educational Times'\n(1886)\n, he states that in his attempt to extend the properties of the\nBrocard\npoints and circle of a triangle to a quadrilateral, he was brought to a stand at the outset by the fact that the equality of the angles does not involve the similarity of the figures for figures of a higher order than the triangle. Limiting his consideration to quadrilaterals which can be circumscribed by a circle, he arrived at several beautiful results ...\nFinally let us mention one further point of interest concerning Tucker. He was an avid collector of photographs of mathematicians connected with the\nLondon Mathematical Society\nand his collection, now called the 'Tucker Collection', is kept in the archives in\nDe Morgan\nHouse in London. I\n[\nEFR\n]\nhave spent a happy hour looking through this fascinating collection of photographs of Presidents and the early members of the Society, many of which have been reproduced in the\nLondon Mathematical Society\nNewsletter\n.\nHill writes in\n[\n1\n]\nabout Tucker's last years:-\n... when he left London for Worthing in\n1902\n, he was obliged to sell his fine mathematical library, and that the necessity of parting with it affected him deeply. He died at Worthing ... after a long period of illness.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus"
  ]
}