{
  "nome_completo": "Robert Philip",
  "nome_curto": "Robert Philip",
  "ano_nascimento": "1854",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Philip/",
  "lugar_nascimento": "Largo, Fife, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Robert Philip\nwas also known as Philp. His father was Benjamin Philp, who lived for a while in St Andrews, later becoming a corn merchant, then an Inspector of the Poor at Largo about\n15\nkm from St Andrews. Although we do not know Robert's exact date of birth, we do know that he was baptised on\n28\nFebruary\n1854\n.\nPhilip first matriculated at the University of St Andrews in October\n1869\nbeing awarded 'merit' in the bursary competition. In his first year of study he took English Literature, Greek\n1\n, Latin\n1\n, and Mathematics\n1\n. In the following year,\n1870\n-\n71\n, he took Logic, Latin\n2\n, Mathematics\n2\n, Anatomy, Physiology and Hygiene, Natural History and Comparative Anatomy. In session\n1871\n-\n72\nhe studied Moral Philosophy, Political Economy, Greek\n2\n, and Latin\n3\n. After taking Natural Philosophy and Chemistry in\n1872\n-\n73\n, he studied Mathematics\n3\nin the following two sessions. He graduated with an M.A. on\n30\nApril\n1873\n.\nAfter graduating, Philip was an Assistant Mathematics Master at Madras College, St Andrews from\n1873\nto\n1876\n. He then became Principal Mathematics Master of Hutcheson's School, Glasgow from\n1876\nto\n1902\n, becoming headmaster of the school in\n1902\n. The school was an ancient one, founded in\n1643\n. It had moved into a new building in Crown Street, Gorbals in\n1841\n, the location described as 'possessing quietness of situation, good air and a roomy open site'. It remained at that site throughout Philip's time there.\nPhilip joined the\nEdinburgh Mathematical Society\nin February\n1885\n, two years after the Society was founded. At this time he was Mathematical Master, at Hutcheson's Grammar School and was living at Scionbank Cottage, Rutherglen. He remained a member of the Society until the year before his death.",
  "math_areas": []
}