{
  "nome_completo": "Roger Godement",
  "nome_curto": "Roger Godement",
  "ano_nascimento": "1921",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Godement/",
  "lugar_nascimento": "Le Havre, France",
  "lugar_morte": "Paris, France",
  "biografia": "Roger Godement\n's father was employed as a clerk at the port of Le Havre. For the first\n19\nyears of his life Roger lived about\n10\nkm away from the city of Le Havre. He said:-\n... my father was working on the harbour\n[\nat Le Havre\n]\nand when I went there to see it, I always managed to have a look at the transatlantic liners anchored near by. One of my uncles was a cook aboard those ships between World War I and World War II.\nAs he went through school it looked as through his career would be as a school teacher. Had he followed that path, he would almost certainly have studied at the Saint-Cloud school in Lyon which, later, became the École Normale Supérieure de Lyon. However, two things changed his path to a school teaching career. One, he suggested, was his outstanding abilities in mathematics but an even more significant event to set the course of his career happened in\n1936\n. He said:-\nI was saved by mathematics and even more so by a physician who, at my medical examination at the École Normale d'Institutrice of Rouen, in\n1936\n, detected a weakness at the top of my right lung; it has never manifested.\nAs a result, he continued living at home until\n1940\npreparing to enter the École Normale Supérieure in Paris. Once he was a student at the École Normale his main teachers were\nHenri Cartan\nand\nGaston Julia\n. In fact he was fortunate to have\nHenri Cartan\nas a lecturer since he was on the faculty at Strasbourg but after a visit to Paris he could not return to Strasbourg since the Germans controlled the city and the university. Godement graduated with his Agrégé de Mathématiques in\n1943\nand continued to undertake research at the university for his doctorate. His thesis advisor was\nHenri Cartan\n. While still a research student, he began publishing papers, his first being\nSur une généralisation d'un théorème de Stone\nⓉ\n(\nOn a generalization of a theorem of Stone\n)\n(1944)\n. The paper was reviewed by\nMarshall Stone\nwho wrote:-\nThis paper sketches the spectral analysis of a weakly continuous unitary representation in\nHilbert space\n(\nnot necessarily separable\n)\nof a locally compact Abelian group, arriving at results similar to those obtained by\nMark Aronovich Naimark\n(1943)\nand Warren Ambrose\n(1944)\n.\nGodement published three further papers in\n1945\n, namely:\nSur la presque-périodicité des fonctions spectrales\nⓉ\n(\nOn the almost-periodicity of the spectral functions\n)\n;\nSur les fonctions de type positif\nⓉ\n(\nOn the positive type functions\n)\n; and\nSur les propriétés ergodiques des fonctions de type positif\nⓉ\n(\nOn the positive properties of ergodic type functions\n)\n. Let us note that the \"functions of positive type\" that Godement was studying in these papers were members of a special class of functions defined on a\nBanach space\nof bounded, complex-valued continuous functions on a locally compact group. Godement defended his thesis\nLes fonctions de type positif et la théorie des groupes\nⓉ\n(\nThe positive type functions and group theory\n)\nin Paris in July\n1946\n. In this thesis he proved significant results concerning harmonic analysis on locally compact abelian groups.\nFollowing the award of his doctorate, Godement was appointed to the University of Nancy in\n1946\n. While teaching there, during the early\n1950\ns, he became an active member of the\nBourbaki\nteam. He contributed to many of the texts being written under the pseudonym\nNicolas Bourbaki\nat this time. Not only did he believe in\nBourbaki\n's approach to writing texts but he also strongly supported, and used, the\nBourbaki\napproach in university teaching. For instance at the\n1954\nBourbaki\nconference in Murols he showed his ardent support for this method of teaching. He also was a major contributor to the\nBourbaki\nSeminar in Paris. For example, during the\n1950\ns, he contributed the following works to this seminar:\nThéorie des caractères dans les groupes unimodulaires\nⓉ\n(\nTheory of characters in unimodular groups\n)\n(1950\n-\n51)\n;\nLes travaux de Hecke, I\nⓉ\n(\nThe work of Hecke, I\n)\n(1951\n-\n52)\n;\nLes travaux de Hecke, II\nⓉ\n(\nThe work of Hecke, II\n)\n(1951\n-\n52)\n;\nTravaux de Hecke, III\nⓉ\n(\nThe work of Hecke, III\n)\n(1952\n-\n53)\n;\nTravaux de Hecke, IV\nⓉ\n(\nThe work of Hecke, IV\n)\n(1952\n-\n53)\n;\nCohomologie des groupes discontinus\nⓉ\n(\nCohomology of discrete groups\n)\n(1953\n-\n54)\n;\nReprésentations induites des groupes de Lie, d'après Bruhat\nⓉ\n(\nInduced representations of Lie groups, according to Bruhat\n)\n(1955\n-\n56)\n,\nReprésentations induites des groupes semi-simples\nⓉ\n(\nInduced representations of semi-simple groups\n)\n(1955\n-\n56)\n;\nIntroduction aux travaux de A Selberg\nⓉ\n(\nIntroduction to the work of A Selberg\n)\n(1956\n-\n57)\n;\nLes fonctions zêta des algèbres simples, I\nⓉ\n(\nThe zeta functions of simple algebras, I\n)\n(1958\n-\n59)\n; and\nLes fonctions zêta des algèbres simples, II\nⓉ\n(\nThe zeta functions of simple algebras, II\n)\n(1958\n-\n59)\n.\nGodement was married to Sonia who even attended a\nBourbaki\nmeeting. He was on the faculty at the University of Nancy until\n1955\n. In that year he was appointed to the Faculty of Sciences in Paris\n(\nor Paris VII\n)\nwhere he spent the rest of his career until he retired in\n1990\n. During this period he was Visiting Professor at several American universities including Illinois at Urbana, Berkeley and the Institute for Advanced study at Princeton. Many of these trips presented him with difficulties because of his strong ethical view which we now examine.\nMany mathematicians have strong views on ethical and other issues. Few, however, mix these views with their mathematical life and their mathematical writings. Godement is an exception to this, for he took a strong ethical position against the military; in particular he hated to see mathematics being used to develop weapons and other means of war. In\n1965\nhe participated in the Symposium on Algebraic Groups, held\n5\nJuly -\n6\nAugust in Boulder, Colorado, which was partly funded by the Office of Naval Research. He later considered this to be a serious error on his part. When invited to participate in\n1972\nin the international Summer School \"Modular functions of one variable and arithmetical applications\" at Antwerp University he wrote a strong letter explaining that, since the School was a NATO Advanced Study Institute, he would not participate. He wrote that he would not sell himself for any type of military involvement:-\nI see no relationship between modular functions and an institution such as the North Atlantic Treaty Organization. ... I would rather take money from our Parisian pimps - they almost never kill anyone - or the American branch of the Mafia\n(\nsince it wants to enter \"regular business\", it might be interested in funding the theory of modular functions, if only for the prestige ...\n)\n. ... In\n1967\n, I was invited to spend two weeks at Princeton and Philadelphia, but more than half of the money came from the Institute for Defense Analysis, so they had me say to those who invited me that I preferred to settle for half the amount they offered me ... Last year at Princeton, I had to refuse many invitations to lecture at the Institute for Defense Analysis ... I had to decline an invitation to the opening ceremony of the new Mathematics building of the University, at which half a dozen leading mathematicians from all over the free world spoke, because the thing was partly funded by USAF. ...\nGodement had published nine books:\nTopologie Algébrique et théorie des faisceaux\nⓉ\n(\nAlgebraic topology and sheaf theory\n)\n(1958)\n;\nVariétés différentiables. Résumé de leçons\nⓉ\n(\nDifferentiable varieties. Summary of lessons\n)\n(1959)\n;\nCours d'Algèbre\nⓉ\n(\nA course of algebra\n)\n(1963)\n;\n(\nwith Hervé Jacquet\n)\nZeta functions of simple algebras\nⓉ\n(\nZeta functions of single algebras\n)\n(1972)\n;\nIntroduction à la théorie des groupes de Lie\nⓉ\n(\nIntroduction to the theory of Lie groups\n)\n(1982)\n;\nAnalyse Mathématique I. Convergence, fonctions élémentaires\nⓉ\n(\nMathematical Analysis I. Convergence, basic functions\n)\n(1998)\n;\nAnalyse Mathématique II. Calcul différentiel et intégral, séries de Fourier, fonctions holomorphes\nⓉ\n(\nMathematical Analysis II. calculus, Fourier series, holomorphic functions\n)\n(1998)\n;\nAnalyse Mathématique III. Fonctions analytiques, différentielles et variétés, surfaces de Riemann\nⓉ\n(\nMathematical Analysis III. analytic functions, and differential varieties Riemann surfaces\n)\n(2002)\n; and\nAnalyse Mathématique IV. Intégration et théorie spectrale, analyse harmonique, le jardin des délices modulaires\nⓉ\n(\nMathematical Analysis IV. Integration and spectral theory, harmonic analysis, modular garden delights\n)\n(2003)\n.\nFor extracts from reviews of these books see\nTHIS LINK\n.\nThese books show his great teaching skills and also his hatred for the military. For example, in Analysis I, one reads in the Preface\nMy goal is not to help bright young people to arrive among the first few in the entry competition for the French École Polytechnique so as to find themselves thirty years later at the service or at the head of a public or private enterprise producing possibly war planes, missiles, military electronics, or nuclear weapons, or who will devise all kinds of financial stunts to make their company grow beyond what they can control, and who, in both cases, will make at least twenty times as much money as the winner of a\nFields\nMedal does.\nAgain he writes in the Preface:-\nThe innocent reader and many confirmed mathematicians will probably be surprised, possibly even shocked, to find in my book some heavy allusions to extra-mathematical subjects and particularly to the relations between science and weaponry. This is neither politically nor scientifically correct: Science is politically neutral, even when someone lets it fall inadvertently on Hiroshima while the future winner of a Nobel Prize in physics is recording the results in a B-\n29\ntrailing 'Enola Gay'. Nor is it part of the curriculum: a scientist's business is to provide his students or readers, without commentary, the knowledge they will later use, for better or worse, as it suits them. It will be up to them to discover by themselves, possibly years after graduating, that which \"has no place\" in scientific books or lectures and was not told them by older scientists well aware of it, or who should have been.\nAn example of the allusions to weaponry in the text is the following\n(\non pages\n121\n-\n122)\n:-\nOne notes, a curious coincidence, that in\n1673\nLeibniz\nhad presented his calculating machine to the\nRoyal Society of London\nand the\nAcadémie des Sciences\nof Paris. It was inspired by that of\nPascal\nand capable of performing not only additions and subtractions like that one, but also multiplications and divisions;\nLeibniz\ndeveloped it over decades, but it was certainly not yet the central computer of the American Strategic Air Command capable of organizing mathematically an attack leaving\n400\nmillions of corpses on the ground, as well as others uncounted, including, according to an American admiral, the sailors of the Pacific Fleet who would be too busy cleaning themselves from radioactive fallout to have time to chase the Soviet submarines.\nFor a longer extract from the Preface to\nAnalyse Mathématique I. Convergence, fonctions élémentaires\n(1998)\n, where Godement gives many of his ideas about teaching, see\nTHIS LINK\nWhile teaching in Paris, Godement supervised the Ph.D. studies of a dozen students most of whom became lecturers at various universities. Here is a list of eight of the best known of these students together with the date and title of their thesis: Hervé Jacquet\n(\nFonctions de Whittaker associées aux groupes de Chevalley\nⓉ\n(\nWhittaker functions for Chevalley groups\n)\n,\n1967)\n, Gérard Schiffmann\n(\nIntégrales d'entrelacement et fonctions de Whittaker\nⓉ\n(\nInterleaving integrals and Whittaker functions\n)\n,\n1969)\n; Jean-Pierre Labesse\n(\nLa formule des traces de Selberg\nⓉ\n(\nThe Selberg trace formula\n)\n,\n1971)\n; Taoufik Karkar\n(\nLes représentations linéaires des groupes\nG\nL\n(\n2\n,\nq\n)\nGL(2, q)\nG\nL\n(\n2\n,\nq\n)\net\nS\nL\n(\n2\n,\nq\n)\nSL(2, q)\nS\nL\n(\n2\n,\nq\n)\nⓉ\n(\nLinear representations of groups\nG\nL\n(\n2\n,\nq\n)\na\nn\nd\nGL\n(2\n, q\n)\nand\nG\nL\n(\n2\n,\nq\n)\na\nn\nd\nS\nL\n(\n2\n,\nq\n)\nSL\n(2\n, q\n)\nS\nL\n(\n2\n,\nq\n)\n)\n,\n1972)\n; Paul Gérardin\n(\nSur les séries discrètes non ramifiées des groupes réductifs déployés p-adiques\nⓉ\n(\nOn unbranched discrete series of reductive p-adic groups deployed\n)\n,\n1974)\n; Gilles Lachaud\n(\nAnalyse spectrale et prolongement analytique: Séries d'Eisenstein, Fonctions Zâta et nombre de solutions d'équations diophantiennes\nⓉ\n(\nSpectral analysis and analytic continuation: Series of Eisenstein, Zeta functions and number of solutions of Diophantine equations\n)\n,\n1979)\n; François Rodier\n(\nModèles de représentations de groupes réductifs p-adiques\nⓉ\n(\nModels of representations of reductive p-adic groups\n)\n,\n1979)\n; and Christophe Soulé\n(\nK-theorie des anneaux d'entiers de corps de nombres et cohomologie etale\nⓉ\n(\nK-theory of rings of integers of number fields and etale cohomology\n)\n,\n1979)\n.\nThe book\n[\n1\n]\ncontains the paper\nModern Methods and the Future of Applied Mathematics\nby Godement. This is a fascinating paper on the future of mathematics which we encourage the reader to study. We merely quote the introductory paragraph:-\nTo speak of the future of mathematics is a capricious undertaking which cannot be too strongly advised against; strictly speaking, it is absurd. It will therefore be understood that I acknowledge frankly - at the same time while regretting it - my inability to draw up a balance sheet of the state of mathematics in the year\n2000\n; a state which, there is no doubt, will be marvellous if the atomic physicists or some peace conferences do not happen to break the course of progress. To outline the future of mathematics is simply to endeavour to discern in the present the principal currents of thought and to draw in some way the \"tangents\" to them.\nOn\n1\nOctober\n2011\n, Godement celebrated his ninetieth birthday. He wrote\n[\n7\n]\n:-\nA group of thirty former students, friends and colleagues, only letting me know a little in advance, celebrated this event by meeting at Claude Bardos' home on\n2\nOctober. The presence of all these people, some of whom I had not met for years because of my distance from the mathematical community and I did not expect to see, gave me the best feeling of my life. And they presented me with a website in my name containing tens of texts I have written but not always published on the relationship between science, technology and weapons, the arms race and other similar subjects, understanding that it would be for me to add to it or edit it.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}