{
  "nome_completo": "Roman Stanislaw Ingarden",
  "nome_curto": "Roman Ingarden",
  "ano_nascimento": "1920",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ingarden/",
  "lugar_nascimento": "Zakopane, Poland",
  "lugar_morte": "Krakow, Poland",
  "biografia": "Roman Stanisław Ingarden\nwas the son of Roman Witold Ingarden\n(\nKraków\n1893\n- Kraków\n1970)\n. Roman Witold Ingarden studied philosophy and mathematics in Lemberg\n(\nnow Lviv in Ukrain\n)\nand Göttingen, and received a doctorate in\n1918\nwith Edmund Husserl as his advisor. He married Maria Pol\n(1889\n-\n1978)\n, a school doctor, on\n1\nJuly\n1919\n. When Roman Stanisław, the eldest of his parents' three sons, was born his father was a secondary school teacher. He taught mathematics and philosophy at secondary schools in Lublin, Warsaw and Toruń between\n1918\nand\n1924\n; the other children in the family were born during that period, Jerzego Kazimierz\n(\nborn\n1921)\nwho became an architect, and Janusz Stefan\n(\nborn\n1923)\nwho served as a pilot with the RAF during World War II and suffered damage which led to his death in\n1949\n. In\n1924\nRoman Witold\nhabilitated\nat the University of Lwów\n(\nnow Lviv in Ukraine\n)\nand it was in Lviv that his son Roman Stanisław was educated. He entered the Third National\nGymnasium\nin Lviv in\n1930\nwhere he was taught mathematics by\nJuliusz Pawel Schauder\n. Although he had begun teaching at the University of Lviv in\n1928\n,\nSchauder\nhad continued with his position as a secondary school teacher which greatly benefitted the young Ingarden.\nIngarden studied for six years at the Third National Gymnasium, then spent the years\n1936\n-\n38\nat the National Gymnasium. After graduating from the National Gymnasium, he began his studies at the Jan Kazimierz University of Lviv in\n1938\n[\n1\n]\n:-\nIn this period he met - both as a student and on private grounds at his parents' house - the elite of Polish mathematicians, physicists and philosophers, including\nStefan Banach\n,\nHugo Steinhaus\n,\nJuliusz Schauder\n,\nStanisław Saks\n, Wojciech Rubinowicz, Kazimierz Ajdukiewicz and Leon Chwistek. Probably at that time he developed his broad intellectual interests, exceeding his future profession of a theoretical physicist, and including linguistics, epistemology, logic, history of science as well as biology, biophysics and informatics, to name just a few.\nAt the Jan Kazimierz University he was taught mathematics by\nStefan Banach\n,\nHugo Steinhaus\nand\nJuliusz Schauder\nwhile his physics lecturers included Stanisław Loria\n(1883\n-\n1958)\nand Wojciech Sylwester Piotr Rubinowicz\n(1889\n-\n1974)\n. Loria worked on the physiology of vision and had been appointed to the chair of theoretical physics at the Jan Kazimierz University in\n1917\n. Rubinowicz was an expert in quantum mechanics who had taught at the Polytechnic Institute in Lviv from\n1922\nbut he also taught at the Jan Kazimierz University from\n1937\n. Ingarden was only one year into his university studies when World War II began. On\n1\nSeptember\n1939\nGermany invaded Poland from the west and then, on\n17\nSeptember, the Soviets invaded from the east. On\n6\nOctober Poland surrendered and Germany and the Soviet Union divided the country between them. Lviv was in the region occupied by the Soviets who, on\n8\nJanuary\n1940\n, changed the name of the Jan Kazimierz University to the Ivan Franko Lviv State University. The rector had been dismissed and a Ukrainian installed to transform the university into the Ukrainian National University. Education at the university continued but slowly the Polish staff were dismissed and replaced by Russians and Ukrainians. Ingarden continued his studies for a while but soon things changed again for, on\n22\nJune\n1941\n, Germany invaded the Soviet Union. By July\n1941\n, Lviv was under German occupation and the university was closed after the massacre of around\n25\nPolish professors. An underground Polish university operated in Lviv and Ingarden attended lectures there as well as working at the Jan Bujak optical factory in Lviv. In\n1944\nhe began working at the Optical-Mechanical Factory in Lviv. The city was captured by the Soviet forces in July\n1944\nand Poles were encouraged to emigrate to Poland, sometimes after being arrested and forced to agree to leave. Lviv was not returned to Poland but, in August\n1945\n, became part of the Soviet Union. Ingarden left Lviv and went to Gliwice in Poland where the Polish professors from Lviv Polytechnic who had been forced to leave Lviv, founded the Silesian University of Technology. Ingarden was appointed as an assistant in the Department of Physics in\n1944\nbut, in addition, he was able to continue his studies at the Jagiellonian University in Kracow. There he was taught by Jan Weyssenhoff\n(1889\n-\n1967)\nwho had been appointed to the chair of Theoretical Physics in\n1935\nand by the experimental physicist Konstanty Zakrzewski\n(1876\n-\n1948)\n.\nIngarden did not remain for long at the Silesian University of Technology for, on\n20\nAugust\n1945\n, he moved to the Department of Theoretical Physics, University of Wrocław, where he was appointed as an assistant. Wojciech Rubinowicz had moved to Kracow in December\n1945\nwhen forced out of Lviv, but he moved to Warsaw in March\n1946\nto take up a position there. Ingarden obtained a Master's degree from the Jagiellonian University in Kracow in\n1946\nand then worked for his doctorate supervised by Rubinowicz. He was awarded his Ph.D. in\n1949\nby the University of Warsaw for a thesis which\n[\n4\n]\n:-\n... concerned geometrical optics with a pioneering application of differential geometry methods, in particular those of\nFinsler\ngeometry.\nContinuing to work at the University of Wrocław, he was given the title of assistant professor in\n1949\n, associate professor in\n1954\nand, in\n1964\n, he became a full professor. From\n1949\nuntil\n1952\nhe was head of the Department of Theoretical Physics at the University of Wrocław which, after a few years, was renamed the Institute for Theoretical Physics, University of Wrocław. As well as holding these positions at the university, he was also head of the geometrical optics group at the Institute of Mathematical Sciences of the\nPolish Academy of Sciences\nfrom\n1950\nto\n1956\n. He then was appointed as head of the Department of Low Temperature Physics in the Institute of Physics, holding this position from\n1956\nuntil he left Wrocław in\n1966\n. Although his work is in mathematical physics, many of his publications are reviewed in\nMathematical Reviews\n(79\nitems are listed\n)\n. For example his early work includes\nEquations of motion and field equations in five-dimensional unified relativity theory\n(\nRussian\n)\n(1953)\nin which he:-\n... considers a five-dimensional Riemannian space described by means of a coordinate system subject to certain conditions. The gravitational equations of the general relativity theory involving the energy-momentum density tensor of matter are generalized to five dimensions.\nIn\n1954\nhe published\nÜber die Einbettung eines Finslerschen Raumes in einem Minkowskischen Raum\nⓉ\n(\nOn embedding a Finsler space in a Minkowski space\n)\nand\n(\nwith H Ochman\n)\nOptimal optical systems\n. The second of these considers\nLord Rayleigh\n's question as to whether it is possible to improve the quality of the final diffraction image by the matching of non-vanishing aberrations. Other papers by Ingarden around this time include:\nA generalization of the Young-Rubinowicz principle in the theory of diffraction\n(1955)\n;\nOn a new type of relativistically invariant linear local field equations\n(\nRussian\n)\n(1956)\n;\nOn the geometrically absolute optical representation in the electron microscope\n(1957)\n; and\nComposite variational problems\n(1959)\n[\n1\n]\n:-\nIngarden regarded information as a fundamental physical notion which should appear in physical theories in an axiomatic manner. Originally, he mainly had optics in mind, but later on in his papers information theory appeared also in the context of statistical physics, thermodynamics and quantum mechanics. In\n1961\n, together with\nK Urbanik\n, he published a paper on mathematical equivalence of the notions of probability and information, thus showing that information can well be a starting point for statistical theories.\nIngarden discussed with Aleksander Jablonski, the founder of physics research at the\nNicholaus Copernicus\nUniversity at Toruń, a possible move to the\nNicolaus Copernicus\nUniversity. This University, established in the autumn of\n1945\n, is the largest university in northern Poland and Ingarden had a particular love of Toruń since he had lived there as a young child. He was appointed to a professorship in\n1966\n, two years before Jablonski retired. At the\nNicholas Copernicus\nUniversity, Ingarden was director of the Institute of Physics\n(1969\n-\n1986)\n, held the Chair of Thermodynamics and the Theory of Radiation\n(1966\n-\n1969)\nand the Chair of Theoretical Physics\n(1969\n-\n1986)\n. He was head of the Department of Statistical Physics from\n1986\nto\n1991\n. In Toruń, he built a research group of international standing\n[\n1\n]\n:-\nThe research conducted by his Toruń group resulted in a number of important papers on the aforementioned applications of\nFinsler\ngeometry in statistical physics, the dynamics of open quantum systems and the geometry of quantum state spaces, quantum generalisations of entropy, among others.\nIn\n1970\nIngarden founded the journal\nReports on Mathematical Physics\n. He became the first editor-in-chief of the journal and among his greatest achievement is the paper\nQuantum information theory\nwhich he published in that journal in\n1975\n. He shows in the paper that\nClaude Shannon\n's information theory does not generalise in a natural way to the case of quantum information. Then, in the paper, he developed a quantum information theory, being one of the first people to do so. He published a number of textbooks aimed at students at Polish universities as well as monographs\n(\nwe give English titles to these Polish books\n)\n:\n(\nwith Andrzej Jamiolkowski\n)\nClassical Electrodynamics\n(1979)\n;\n(\nwith Andrzej Jamiolkowski\n)\nClassical Mechanics\n(1980)\n;\n(\nwith Lech Górniewicz\n)\nMathematical analysis for physicists\n(1981)\n;\n(\nwith Marian Grabowski\n)\nQuantum mechanics: in a Hilbert space setting\n(1989)\n;\n(\nwith Andrzej Jamiolkowski\n)\nStatistical physics and thermodynamics\n(1990)\n; and\n(\nwith Lech Górniewicz\n)\nAlgebra and Geometry for physicists\n(1993)\n.\nWe must mention Ingarden's fascination with Japan and all things Japanese. He decided to learn the language soon after taking up the position in Toruń. This was not simply a personal hobby, for he became a founder of the Japanese Language and Culture Centre at the\nNicolaus Copernicus\nUniversity of Toruń. His interest in Japan also had a major influence on his research activities. Masanori Ohya's article\n[\n3\n]\ngives interesting technical details of this but let us quote the beginning of the article where Ohya explains how their joint research projects began:-\nI met Professor Ingarden nearly\n30\nyears ago in Tokyo. He was invited by Professor Umegaki to give a talk on quantum information at the Tokyo Institute of Technology. At that time Professor Ingarden was the leading researcher in the fields of quantum information and\nFinsler\ngeometry. I was working on mathematical physics in terms of operator algebras, specifically on quantum irreversible dynamics and quantum entropy. Professor Ingarden gave me a preprint of his book on quantum information and I learned a lot both from his talk and from his book. In particular, I was strongly impressed, even still today, by his idea that the theory of quantum information and quantum probability should be formulated in an infinite-dimensional\nHilbert space\nsetting ... Therefore in the\n1980\n's I tried to formulate quantum information theory and communication processes within a\nC\n∗\nC^{*}\nC\n∗\n-algebraic framework. Since then Professor Ingarden visited Tokyo University of Science several times and we had the opportunity to discuss problems of mutual scientific interest. ... It should be mentioned that Professor Ingarden has very broad scientific interests beyond physics itself, including psychology, biology and even philosophy. Such a broad knowledge helped him in laying the fundamentals of new fields, such as the axiomatic formulation of entropy, namely, entropy without probability, quantum information, multi-temperature thermodynamics and the theory of shape to name just a few. Under the leadership of Professor Ingarden, many outstanding researchers, specializing in mathematical physics and quantum information started their careers in Toruń. Professor Ingarden and I collaborated to launch a new journal on mathematical physics and quantum information, which is named 'Open System and Information Dynamics' and it is now highly recognised among mathematical periodicals.\nIngarden was honoured with the award of an honorary doctorate from the\nNicolaus Copernicus\nUniversity of Toruń in\n1995\n. He received the Polonia Restituta, the second highest honour awarded by the Polish State, and the Medal of the National Education Commission by the Ministry of Education. He was also awarded the Order of the Sacred Treasure by Emperor Akihito of Japan in\n2002\n. His son, Krzysztof Ingarden, was born in Wrocław in\n1957\nand studied at Kraków and also in Japan. He became an architect.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Statistics"
  ]
}