{
  "nome_completo": "Johann Rudolf Wolf",
  "nome_curto": "Rudolf Wolf",
  "ano_nascimento": "1816",
  "ano_morte": "1893",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wolf/",
  "lugar_nascimento": "Fällanden (near Zürich), Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Rudolf Wolf\n's parents were Regula Gossweiler and Johannes Wolf who was a minister in the Church. The family can be traced back\n500\nyears as citizens of Zürich. After studying at the Zürich Industrieschule, Wolf attended the University of Zürich where he was taught by Raabe and\nGräffe\n. He moved to Vienna in\n1836\n, studying there for two years before going to Berlin in\n1838\nwhere he attended lectures by\nEncke\n,\nDirichlet\n, Poggendorf,\nSteiner\nand\nCrelle\n. In\n1838\nhe visited\nGauss\n, then in the following year he became a lecturer in mathematics and physics at the University of Bern. In addition, he became professor of astronomy there in\n1844\n. Wolf became director of the Bern Observatory in\n1847\n.\nIn\n1855\nhe accepted a chair of astronomy at both the University of Zürich and the Eidgenössische Technische Hochschule in Zürich. An observatory was opened at Zürich in\n1864\n, largely due to Wolf's efforts, and he was appointed as director.\nWolf wrote on\nprime number theory\nand geometry, then later on\nprobability\nand statistics - a series of papers discussed\nBuffon\n's needle experiment in which he estimated π by Monte Carlo methods. We shall return to discuss his statistical contributions later in this article. First, however, we discuss Wolf's main contribution which was his study of the\n11\nyear sunspot cycle.\nHeinrich Schwabe was an amateur astronomer in Dessau where he worked as a pharmacist. He observed the Sun because he was trying to find a planet inside the orbit of Mercury. His idea was to detect it when it crossed the disk of the Sun so he began to make a systematic record of the spots on the Sun, every day when visibility allowed, beginning in\n1826\n. By\n1843\nhe had begun to suspect that there was some regularity in the sunspots he was recording and published\nSolar Observations during\n1843\nin which he suggested that sunspots might follow a period of about\n10\nyears. Wolf, who at that time was in Bern, was fascinated and in\n1847\nhe began his own observational record of sunspots. In the following year he devised a system which is now known as 'Wolf's sunspot numbers'. This system, which gave a weighted number of sunspots where groups of sunspots were given a higher weight, is still in use for studying solar activity by counting sunspots and sunspot groups. Of course an\n11\nyear cycle requires considerable data and Wolf collected not only current data, but data from historic records from\n1610\nonwards. From this data Wolf was the first to calculate an accurate length of the cycle, obtaining a value of\n11\n.\n1\nyears. In\n1852\nhe became was the co-discoverer of the connection between the sunspot cycle and geomagnetic activity on Earth. He continued to publish reports on sunspot numbers until his death.\nWolf's findings were not well received by his fellow astronomers who argued strongly against his conclusions. However Wolf was totally convinced of his discoveries and the validity of his methods, and of course we know that he was right to remain so. He argued his case strongly against those who were sceptical and those who questioned his methods. One of the reasons that he was able to be so confident was his understanding of statistics and the statistical analysis of the sunspot data. The article\n[\n5\n]\ngives an excellent account of this interesting episode. The article\n[\n6\n]\ncontains an account of another application of statistics made by Wolf.\nA book\nOne million facts\nwas published in\n1843\nwhich contained an account of\nBuffon\n's needle experiment to estimate π, although the book did not attribute the problem to\nBuffon\n. Wolf read the account, which is as follows\n(\nin the translation given in\n[\n6\n]\n)\n:-\nOn a plane surface draw a sequence of parallel, equally spaced straight lines; take an absolutely cylindrical needle of length a, less than the constant interval d which separates the parallels, and drop it randomly a great number of times on the surface covered by the lines. If one counts the total number q of times the needle has been dropped and notes the number p of time the needle crosses with any one of the parallels, the quantity\n2\na\n.\nq\n:\np\n.\nd\n2 a . q : p . d\n2\na\n.\nq\n:\np\n.\nd\nwill express the ratio π of circumference and diameter all the more precisely the more trials that have been made. The error will be the smallest for a given number of trials if the length a of the needle is equal to one-fourth of the product of the interval length d and the ratio π.\nWolf conducted experiments throwing the needle\n5000\ntimes, obtaining a value of  to be\n3\n.\n1596\n. However, more interestingly, Wolf wanted to show that the method of least squares could be used to estimate the error. He published papers in\n1849\nand\n1850\non experiments to compare the experienced probability and the mathematical probability in\nVersuche zur Vergleichung der Erfahrungswahrscheinlichkeit mit Mathematischen Wahrscheinlichkeit\nⓉ\n(\nTreatise on the  comparison of experienced probability with mathematical probability\n)\n. Riedwyl writes\n[\n6\n]\n:-\nWolf's\n(1850)\npaper, which demonstrates the principle of estimating a parameter in a case where it is not easy to give a mathematical model, was new for his time. In this respect, Wolf's paper can be called a forerunner of the Monte Carlo method.\nHere is an extract from one of Wolf's\n1850\npapers\n(\nwith translation as given in\n[\n6\n]\n)\n. Having stated the problem in the form given above he continues:-\n... I decided to carry out corresponding series of tests, hoping to obtain, not , but at least new proofs about the rules governing a finite number of trials. On a plate of about one square foot I drew a series of parallels at a distance of\n45\nmm, and from a knitting needle I broke a piece of\n36\nmm length - thus getting as close as\n1\n100\n\\large\\frac{1}{100}\\normalsize\n1\n0\n0\n1\n​\nto the ideal ratio according to the instruction above. With this equipment I carried out\n3\n×\n50\ntrials dropping the needle\n100\ntimes each trial and noting each crossing with the parallels. In the first\n50\ntrials I dropped the needle parallel to the parallels on the plate and in the second\n50\nones perpendicular to them, whereas in the third\n50\ntrials I sought to induce all kinds of positions by constantly rotating the plate. By this means I obtained the number of crossings between the needle and the parallels on the plate in\n100\ntosses each.\nThe resulting rule was immediately so strong that I felt entitled to apply the method of least squares to the computation of the means. Thus I obtained in the first series of trials for\n100\ntosses a mean of\n21\n.\n76\n±\n0\n.\n64\ntosses in which the needle intersected the parallels. In the second series of trials I obtained\n71\n.\n34\n±\n1\n.\n25\n. In the third series of trials I obtained\n50\n.\n64\n±\n0\n.\n83\n. If I compare this with the above formula π =\n2\na . q / p . d or p =\n2\na . q / d π. There results for a =\n36\n, q =\n100\n, and d =\n45\n,\np\n=\n2.36.100\n/\n45\nπ\np = 2 . 36 . 100 / 45 \\pi\np\n=\n2\n.\n3\n6\n.\n1\n0\n0\n/\n4\n5\nπ\n,\na number that lies within the error limits of the mean from the third series of trials.\nIt is likely that only after\n1884\nwas Wolf aware of the history of the problem, and that\nBuffon\nwas the first to propose it.\nWolf also made significant contributions to the history of science. He discovered where the correspondence of\nJohann Bernoulli\nand several other of the younger Bernoullis was stored and, as a result, this correspondence was later published. Burckhardt writes\n[\n1\n]\n:-\nUpon the establishment of the Zürich Polytechnikum he was named head librarian; during his tenure he assembled a valuable collection of early printed books on astronomy, mathematics, and other branches of science.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}