{
  "nome_completo": "Ruth Ellen Gentry",
  "nome_curto": "Ruth Gentry",
  "ano_nascimento": "1862",
  "ano_morte": "1917",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gentry/",
  "lugar_nascimento": "Stilesville, Hendricks County, Indiana, USA",
  "lugar_morte": "Indianapolis, Indiana, USA",
  "biografia": "Ruth Gentry\nwas the daughter of Jeremiah Gentry\n(1827\n-\n1906)\n, a farmer and stock trader, and Lucretia Wilcox\n(1830\n-\n1909)\n. Jeremiah Gentry was born in Bullitt county, Kentucky, to Blackstone Gentry and Nancy Hough. When he was five years old his parents moved to Hendricks county, Indiana where he lived the rest of his life. Jeremiah Gentry married Lucretia Wilcox on\n16\nJanuary\n1851\nin Morgan county, Indiana. They had three children, Oliver Gentry\n(1853\n-\n1878)\n, Mary Frances Gentry\n(1860\n-\n1929)\nand the youngest, Ruth Gentry, the subject of this biography. Ruth was brought up on a farm near to Stilesville and her early education was in the small village of Stilesville.\nGentry's secondary education was at the Indiana State Normal School in Terre Haute. This School was first set up in\n1865\nand teaching began in\n1870\n. It had therefore only been in operation for a short time when Gentry began her education there. At the time Indiana State Normal School was a teachers college but did not have the right to award bachelor's degrees; this came later in\n1908\n. The School later became Indiana State University. After graduating in\n1880\nGentry had qualified as a teacher and indeed she did teach for ten years in preparatory schools. In\n1870\nthe University of Michigan had become one the first colleges in the United States to admit women undergraduates so it was a fairly natural choice for Gentry to make when she decided to study for her bachelor's degree. She began to study mathematics at the University of Michigan entering in\n1885\n. After a year she went back to school teaching and spent two years in Deland, Florida in\n1886\n-\n88\n. In the first of these years she was at DeLand Academy and College. She continued teaching in the same establishment but in the second of these two years it had changed its name to DeLand University. In the autumn of\n1888\nshe went back to the University of Michigan to complete her degree and she was awarded her Bachelor's degree, a Ph.B., in\n1890\n.\nWishing to continue her studies to graduate level Gentry entered Bryn Mawr College in Pennsylvania. Again this was a natural choice since the College, which opened in\n1885\n, was the first institution of higher education in the United States to offer graduate training to women. It also had an excellent reputation in mathematics although at the time when Gentry entered the College in\n1890\nvery few women had received a Ph.D. in mathematics in the United States. The Head of the Mathematics Department at Bryn Mawr College was\nCharlotte Scott\n. She had undertaken research at Girton College, University of Cambridge, England, on algebraic geometry under\nArthur Cayley\n's supervision. She was awarded a doctorate in\n1885\nand, on\nCayley\n's recommendation, was appointed the first Head of Mathematics at Bryn Mawr College.\nCharlotte Scott\nsupervised Gentry's graduate studies. After a year at Bryn Mawr, Gentry was awarded the prestigious Association of College Alumnae European Fellowship which would finance her studies in Europe. Gentry was the second recipient of the award and the first mathematician. For more information on this award and, in particular, Gentry's receipt of the award, see\nTHIS LINK\n.\nIn\n1891\nshe left the United States and travelled first to Berlin in Germany. She wrote\n[\n5\n]\n:-\nI came to Germany to see Germany and the Germans, to acquire a needed ease in the use of the German language, to see something of a German University, and to gain acquaintance with German methods of presenting Mathematics.\nBefore leaving the United States she had made serious attempts to find a German university that would accept her\n[\n5\n]\n:-\nIn America, I had heard that a woman was occasionally permitted, as an exceptional favour, to become a sort of supposed-to-be-invisible guest in lectures in some universities of Germany; that in Berlin, however, all effort to secure such exceptional privilege would be utterly useless. Accordingly, from time to time during the summer of\n1891\n, I made inquiries of various prominent Professors of Mathematics elsewhere than in Berlin; result, a collection of letters now treasured as souvenirs, no show of hope for me except in Leipzig, where the work in Mathematics was not exactly suited to  my purpose, and a state of mind well adapted to lead to suicide.\nDespite this she went to Berlin and was interviewed by\nLazarus Fuchs\n. In\n[\n5\n]\nGentry is full of praise for the reception she received from\nFuchs\n:-\nHaving nursed my despair till the University had officially opened, I concluded to seek a long-desired interview with Professor\nFuchs\nand \"view the prospect o'er\" for myself. Professor\nFuchs\ndid not politely \"thank me for the honour, etc., while regretting to be unable to admit a woman to his lectures; \"he did not assure me Mathematics was a difficult subject which women, for the most part, could not comprehend\n(\nas one Professor had written\n)\n; he did not, as the Rector of one University did, advise me to apply to the Ministerium, and accompany his advice with the assurance that my request would not be granted; he did not make me feel that a woman possessed of interest in Mathematics was a sort of natural curiosity, whose existence demanded explanation. He asked me in his quiet, restful way, what I had done in Mathematics and under whose instruction, talked a minute or two about\nBriot\nand\nBouquet\n's 'Théorie des Fonctions Elliptiques', and told me to ask the Rector of the University whether a way could not be found to favour my petition. The Rector requested me to send him a written petition, and expressed a willingness to bring my case before the University Senate. Ten days later he answered my petition, to the effect that, on the strength of Professor\nFuchs\n's warm advocacy of my cause, he had resolved to take upon himself the responsibility of allowing me to attend lectures until the Senate should meet, provided, of course, the men whose lectures I wished to hear should have no objections.\nGentry was able to attend lectures at the University of Berlin by\nLazarus Fuchs\nand by\nLudwig Schlesinger\nfor a semester but was not able to formally enrol so it was impossible for her to read for a degree. After one semester she was unable to continue attending lectures, however, since she was informed that\nFuchs\nand the Rector Foerster had made an error in allowing her to attend. For a full account of Gentry's Berlin experience, see see\nTHIS LINK\n.\nShe wrote to\nFelix Klein\nat the University of Göttingen asking if he would admit her to his lectures but he replied to say this was against the rules. Gentry then went to Paris where she spent a semester attending mathematics lectures at the Sorbonne before returning to Bryn Mawr. She was appointed as a Fellow in Mathematics at Bryn Mawr College for the academic year\n1892\n-\n93\n, and then Fellow by Courtesy in the following year\n1893\n-\n94\n. While a graduate student Gentry joined the\nNew York Mathematical Society\nin\n1894\n; the Society became the\nAmerican Mathematical Society\nshortly after she joined. See\nTHIS LINK\n.\nHer doctoral thesis was supervised by\nCharlotte Scott\n, not surprisingly, on geometry which was Scott's own area of expertise. Gentry passed the examinations required for a Ph.D. in June\n1894\nbut her thesis\nOn the Forms of Plane Quartic Curves\ntook two years to print so her degree from Bryn Mawr only became official\n1896\n. The work of her thesis is best described by quoting her own words from the introduction:-\nMany papers dealing with curves of the fourth order, or Quartic Curves, are to be found in the various mathematical periodicals; but these leave the actual appearance of the curve as a whole so largely to the reader's imagination that it is here proposed to give a complete enumeration of the fundamental forms of Plane Quartic Curves as they appear when projected so as to cut the line at infinity the least possible number of times, together with evidence that the forms presented can exist.\nBefore the award of her Ph.D., Gentry had been appointed to Vassar College in Poughkeepsie, New York, taking up the appointment in\n1896\n. This was a women's college which had been set up to allow women to obtain an education of equivalent standard to that available to men and the appointment of Gentry was important to them for she was the first mathematics faculty member with a Ph.D. She was appointed by the Head of Mathematics at Vassar College, Achsah Mount Ely\n(1846\n-\n1904)\n. Let us quote from the Mathematics entry in the Vassar College catalogue of\n1894\n-\n95\n:-\nThe aim in all courses is to cultivate habits of exact, sustained and independent reasoning, of precision and clearness in the statement of convictions and the reasons upon which they depend; to rely upon insight, originality and judgment rather than on memory. The endeavour is to secure full possession of leading principles and methods rather than of details. From the first, students who show special aptitude are encouraged in the working of subjects, which require more prolonged investigation than the daily exercise of the classroom.\nGentry was promoted to associate professor in\n1900\nand she taught there until\n1902\n. During the years she taught there, Vassar College offered graduate level course, which included \"advanced courses on projective geometry, differential equations, and modern methods of analytics. Seniors studied advanced integral calculus, the\nquaternions\n, and analytic mechanics.\"\nIn\n1902\nGentry left Vassar College to take up a position as Associate Principal of Miss Gleim's Private School in Pittsburgh, Pennsylvania and she also was Head of the Mathematics Department there in\n1904\n-\n05\n. In\n1905\nGentry resigned her position. It seems that she had left Vassar College because her health was deteriorating and almost certainly she left Miss Gleim's Private School because her health no longer allowed her to perform her job satisfactorily. It is somewhat unclear how she spent the following years. In December\n1909\nshe gave her address as Stilesville, so she had returned to her home village. However by December\n1909\nshe was living in Indianapolis and by October of the following year she was still in Indianapolis. At this time she gave her occupation as a volunteer nurse. For a number of years, from\n1911\nto\n1914\n, she travelled both in Europe and in the United States. There is a record of her returning to the United States from Europe in February\n1914\n. In August\n1916\nshe reported that she was living at an address in Indianapolis and, in the following year, it was in that city she died from breast cancer at the age of\n55\n. She was buried in Stilesville Cemetery, Stilesville, Hendricks county, Indiana.",
  "math_areas": [
    "Calculus",
    "Combinatorics",
    "Geometry"
  ]
}