{
  "nome_completo": "Scipione del Ferro",
  "nome_curto": "Scipione del Ferro",
  "ano_nascimento": "1465",
  "ano_morte": "1526",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferro/",
  "lugar_nascimento": "Bologna (now Italy)",
  "lugar_morte": "Bologna, Papal States (now Italy)",
  "biografia": "Scipione del Ferro\nis sometimes known as Ferreo, sometimes as Ferro, and sometimes as dal Ferro. His role in the history of mathematics is an important one and he deserves great credit for solving one of the outstanding ancient problems of mathematics. In one sense he is well known, for his role in solving\ncubic equations\nis explained in almost every general work on the history of mathematics ever written, and yet, surprisingly, his name remains relatively unknown.\nScipione del Ferro's parents were Floriano and Filippa Ferro. Floriano Ferro was employed in paper making which, because of the invention of printing in the\n1450\ns, became an important trade at this time due naturally to a vastly increased demand for paper. Of Scipione del Ferro's education little is known but it is probable that it was at the University of Bologna which was founded in the\n11\nth\ncentury and so was a long established and famous university four hundred years before del Ferro was born.\nWe know that del Ferro was appointed as a lecturer in arithmetic and geometry at the University of Bologna in\n1496\nand that he retained this post for the rest of his life. However he was not only involved in academic activities for records have survived which show that he was involved in business transactions in the latter part of his life.\nNo writings of del Ferro have survived. This must be due, at least in part, to his reluctance to make his results widely known, preferring to communicate them only to a few close friends and students. We do know however that he kept a notebook in which he recorded his most important discoveries. This notebook passed to del Ferro's son-in-law Hannibal Nave when del Ferro died in\n1526\n. Hannibal Nave was also a mathematician and he had married del Ferro's daughter Filippa, who of course was named after del Ferro's mother. Hannibal Nave took over del Ferro's lecturing duties at the University of Bologna in\n1526\nand also his name since he adopted the name of dalla Nave alias dal Ferro. Nave still had the notebook in\n1543\n, for in that year\nCardan\nand\nFerrari\ntravelled to Bologna to see him and his father-in-law's notebook for\nFerrari\nrecords this in his writings. We quote the relevant passage from\nFerrari\nbelow.\nThe outstanding problem which del Ferro solved was to find a formula to solve a cubic equation similar to the formula which had been known since the time of the Babylonians for solving\nquadratic equations\n. Today we write the solutions to\na\nx\n2\n+\nb\nx\n+\nc\n=\n0\nax^{2} + bx + c = 0\na\nx\n2\n+\nb\nx\n+\nc\n=\n0\nas\nx\n=\n−\nb\n+\nb\n2\n−\n4\na\nc\n2\na\nx = \\Large \\frac{-b + \\sqrt{b^{2} - 4ac}}{2a}\nx\n=\n2\na\n−\nb\n+\nb\n2\n−\n4\na\nc\n​\n​\nand\nx\n=\n−\nb\n−\nb\n2\n−\n4\na\nc\n2\na\nx = \\Large \\frac{-b - \\sqrt{b^{2} - 4ac}}{2a}\nx\n=\n2\na\n−\nb\n−\nb\n2\n−\n4\na\nc\n​\n​\n.\nIn del Ferro's time, although such solutions were known, they were not known in this form. Firstly, in the middle of the\n16\nth\ncentury in Europe, zero was not in use; secondly negative numbers were not in use; and thirdly there was no understanding of a quadratic having two roots. Mathematicians in the time of del Ferro knew that the problem of solving the general cubic could be reduced to solving the two cases\nx\n3\n+\nm\nx\n=\nn\nx^{3} + mx = n\nx\n3\n+\nm\nx\n=\nn\nand\nx\n3\n=\nm\nx\n+\nn\nx^{3} = mx + n\nx\n3\n=\nm\nx\n+\nn\n, where\nm\nm\nm\nand\nn\nn\nn\nare positive numbers.\n(\nThe term in\nx\n2\nx^{2}\nx\n2\ncan always be removed by means of a suitable substitution.\n)\nOf course, if negative coefficients had been in use then there would have been only one case.\nThere has been much conjecture as to whether del Ferro came to work on the solution to cubic equations as a result of a visit which\nPacioli\nmade to Bologna.\nPacioli\ntaught at the University of Bologna during\n1501\n-\n02\nand discussed mathematical problems with del Ferro at that time. It is not known whether the two discussed the algebraic solution of cubic equations, but certainly\nPacioli\nhad included this topic in his famous treatise the\nSumma\nwhich he had published seven years earlier. Some time after\nPacioli\n's visit to Bologna, del Ferro solved one of the two cases of this classic problem\n(\nbut as we mention below, he may have solved both cases\n)\n.\nThe subsequent developments in the story of the solution of the cubic, namely the contest in\n1535\nbetween Antonio Maria Fior\n(\na student of del Ferro\n)\nand\nTartaglia\n, then the involvement of\nCardan\n, are told in detail in our biographies of\nTartaglia\nand of\nCardan\n. As far as this biography of del Ferro is concerned we should stress that it was\nCardan\n's discovery that del Ferro had been the first to solve the cubic and not\nTartaglia\nwhich made him feel that he could honour his oath to\nTartaglia\nnot to divulge his method and still publish the solution in\nArs Magna\nⓉ\n(\nThe great art\n)\nfor there\nCardan\nconsidered he is giving del Ferro's method, not that of\nTartaglia\n.\nFerrari\n, a student of\nCardan\n's wrote\n(\non\n1\nApril\n1547)\nabout their earlier trip to see Hannibal della Nave\n(\nsee for example\n[\n3\n]\n)\n:-\nFour years ago when\nCardano\nwas going to Florence and I accompanied him, we saw at Bologna Hannibal della Nave, a clever and humane man who showed us a little book in the hand of Scipione del Ferro, his father-in-law, written a long time ago, in which that discovery\n[\nsolution of cubic equations\n]\nwas elegantly and learnedly presented.\nIn\nArs Magna\nⓉ\n(\nThe great art\n)\nCardan\nwrites with great respect for the achievements of del Ferro\n(\nsee for example\n[\n1\n]\n)\n:-\nScipione Ferro of Bologna, almost thirty years ago, discovered the solution of the cube and things equal to a number\n[\nwhich in today's notation is the case\nx\n3\n+\nm\nx\n=\nn\nx^{3} + mx = n\nx\n3\n+\nm\nx\n=\nn\n]\n, a really beautiful and admirable accomplishment. In distinction this discovery surpasses all mortal ingenuity, and all human subtlety. It is truly a gift from heaven, although at the same time a proof of the power of reason, and so illustrious that whoever attains it may believe himself capable of solving any problem.\nThe story that Fior was the only person to whom del Ferro divulged his solution is common in most histories of mathematics, yet it is false. As we have seen above the solution was written down by del Ferro and certainly was known to Nave. Pompeo Bolognetti, who lectured at the University of Bologna on mathematics from\n1554\nto\n1568\n, also had access to the original solution by del Ferro as well as the solution as given by\nCardan\nin\nArs Magna\nⓉ\n(\nThe great art\n)\nwhich had been published by then.\nBombelli\n, who published his\nAlgebra\nin\n1572\n, also had access to details of del Ferro's work which no longer exists today.\nBombelli\n, like\nCardan\n, expressed wonder at the genius of del Ferro and describes him as:-\n... a man uniquely gifted in this art\n[\nof algebra\n]\n...\nAround\n1925\n, Bortolotti\n(\nsee\n[\n2\n]\n)\nexamined sixteenth century manuscripts reproducing work by Bolognetti,\nCardan\nand\nBombelli\n. One important manuscript is headed:-\nDal Ferro's rule for the solution of cubic equations. From the Cavaliere Bolognetti, who had it from the Bolognese master of former days, Scipione dal Ferro. On unknowns and cubes equal to numbers.\nThe manuscript gives a method of solution which is applied to the equation\n3\nx\n3\n+\n18\nx\n=\n60\n3x^{3} + 18x = 60\n3\nx\n3\n+\n1\n8\nx\n=\n6\n0\n. From research on this and the other manuscripts, Bortolotti concluded that, contrary to the widely held belief that del Ferro only solved one case of the cubic, that indeed he solved both cases. However Crossley in\n[\n3\n]\nbelieves that the evidence from the Bolognetti manuscript adds weight to the belief that del Ferro solved only one case.\nWe know a little about other work by del Ferro. He made an important contribution to\nrationalising\nfractions, extending methods to rationalise fractions which had square roots in the denominator\n(\nwhich were known to\nEuclid\n)\nto fractions whose denominators were the sum of three cube roots. We also know that del Ferro worked on another problem which was popular in his time, namely examining which geometrical problems could be solved with a compass set in a fixed position.\nFerrari\n, in a letter to\nTartaglia\n, states the del Ferro worked on such problems but he did not give any details of del Ferro's results.\nIt is sad that del Ferro's notebook has not survived. Indeed it is probable that he would have attained considerably more fame had we been able to give details of the problems which he solved and wrote down in his notebook.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}