{
  "nome_completo": "Sergei Alekseevich Chaplygin",
  "nome_curto": "Sergei Alekseevich Chaplygin",
  "ano_nascimento": "1869",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chaplygin/",
  "lugar_nascimento": "Ranenburg (now Chaplygin), Russia",
  "lugar_morte": "Novosibirsk, USSR",
  "biografia": "Sergei Alekseevich Chaplygin\n's father, Aleksei Timofeevich Chaplygin, was a shop assistant who died of cholera at the age of\n24\nwhen Chaplygin was only two years of age. This meant that he was brought up in somewhat poor circumstances by his mother Anna Petrovna. However, Anna Petrovna remarried a tradesman from Voronezh and the family left Ranenburg and moved to Voronezh. His mother was keen for Sergei Alekseevich to have an education so, when he was eight years old, she hired a tutor to bring his education up to the standard required for taking the entrance examinations to the preparatory classes. In the autumn of\n1877\nhe took these examinations and began his schooling.\nAs we have indicated, the family were poor so they would have had great difficulty paying Sergei Alekseevich's school fees. However, as soon as he began his schooling it became clear to his teachers that he had exceptional abilities and a remarkable memory. On his teachers' recommendation the Pedagogical Board decided to waive the fee requirement in his case. While attending Voronezh\nGymnasium\n, the parents of his fellow pupils, realising his extraordinary skills, asked him to tutor their sons. He therefore began his teaching career at the early age of fourteen, becoming a popular private tutor. The money he made from private tutoring helped to support his family. He excelled across the whole range of school subjects, being equally good at ancient languages, modern languages, history, and his other subjects. However, it was mathematics that he enjoyed most and he decided that he wanted to make a career with this subject. He graduated from the Gymnasium in\n1886\nwith the gold medal and a prediction by his teacher\nA P Kiselev\nthat:-\n... Sergei Alekseevich has a great future.\nIn the autumn of that year, at age seventeen, Chaplygin packed a small suitcase and, with\n200\nrubles in his pocket, set off from Voronezh to Moscow to begin his university studies of mathematics.\nAt the University of Moscow Chaplygin studied in the Physics and Mathematics Faculty and, for the first two years, he concentrated exclusively on mathematics courses. However, beginning in his third year his interests moved towards specialising in mechanics. He was strongly influenced by\nNikolai Egorovich Zhukovsky\nwho lectured to him on a wide range of topics. After Chaplygin graduated with his first degree in\n1890\n,\nZhukovsky\npersuaded him to continue to study for his university teacher's qualification. His first work was on hydrodynamics, done under\nZhukovsky\n's influence; in particular on the mechanics of liquids and gases, studying jet stream flow in the\n1890\ns. In\n1893\nChaplygin published\nOn certain cases of the motion of a solid body in a fluid\nand the quality of this work was so outstanding that he was awarded the\nN D Brashman\nPrize for this contribution. In\n1897\nhe submitted his master's thesis\n(\nequivalent to a Ph.D.\n)\nwhich was published under the same title in\n1893\n. Grigorian writes that\n[\n1\n]\n:-\nChaplygin gave a geometric interpretation of those cases of the movement of a body in a liquid that had earlier been studied from a purely analytic standpoint by the German scientists\nClebsch\nand\nKirchhoff\n, as well as by the Russian scientist\nSteklov\n. In this regard\nZhukovsky\nhas written that Chaplygin \"demonstrated in his two excellent papers what strength the cleverly conceived geometrical methods of investigation can possess.\"\nThe\nSt Petersburg Academy of Sciences\nawarded him their Gold Medal for this outstanding work.\nChaplygin had begun teaching in Moscow in the year\n1893\n. He taught physics at the Women's Secondary Educational Institution and mechanics at the Moscow Higher Technical School from\n1896\nuntil\n1906\n, and at the Moscow Engineering School. He taught from\n1894\nat Moscow University as an assistant professor, being promoted to professor in\n1903\n. From\n1901\nhe was professor of mechanics at Moscow Women's College and in\n1905\nhe helped organise the Moscow Advanced Course for Women. He served as director of the Advanced Course for Women from\n1905\nto\n1918\nwhen the Advanced Course became the Second Moscow State University. Keldysh writes that\n[\n8\n]\n:-\n... under his leadership the advanced courses developed into a large higher educational institution offering instruction in all branches of knowledge.\nHe became rector of this university for one year\n1918\n-\n19\nuntil the two universities of Moscow were merged. As an indication of Chaplygin's remarkable memory, it is recorded in\n[\n12\n]\nthat during his time as rector he knew every student by name.\nAfter the award of his Master's Degree\n(\nequivalent to a Ph.D.\n)\n, Chaplygin worked on two classic problems of theoretical mechanics. One of these was the study of the motion of a body subjected to nonintegrable constraints while the other was the study of the motion of a heavy body about a fixed point. His paper\nOn the motion of a heavy body of revolution in a horizontal plane\n(1897)\nwas the first to present the general equation of motion of a nonholonomic system. This equation is a generalisation of\nLagrange\n's equation. In the same year he published\nOn a certain possible generalisation of the theorem of areas\n. In\n1899\nhe was awarded the Gold Medal of the\nSt Petersburg Academy of Sciences\n:-\n... for his studies of the theory of the motion of a body in a fluid and the motion of bodies with nonintegrable constraints.\nHe published a famous paper\nOn gas streams\nin\n1902\ngiving exact solutions to many cases of noncontinuous flow of a compressible gas. This paper, which he submitted to Moscow University for his doctorate\n(\nequivalent to the\nhabilitation\nor D.Sc.\n)\n, opened the way for a study of high velocity aeromechanics as Keldysh explains\n[\n8\n]\n:-\n... it gave a method of studying jet flows of a gas at any subsonic speed. At that time the investigation of gas flows at speeds near the speed of sound had no practical application in aviation. Three decades later, however, Chaplygin's dissertation served as a starting point for many studies by aerodynamics specialists and provided the basis for the solution of problems of subsonic flows.\nIn fact Chaplygin wrote his remarkable dissertation while he was on vacation at a resort in the Crimea.\nThe political situation in Russia led to problems in Moscow University that had major consequences for Chaplygin. The University had been founded in\n1863\nbut after a few years of academic freedom, it was restricted in its activities. Nevertheless it continued to operate as an excellent university, providing Chaplygin with a very good education. However, the first Russian Revolution of\n1905\n-\n07\nsaw the students organise themselves into a group seeking the overthrow of the tsar. After this First revolution failed, the tsar took action against Moscow University and it was closed on a number of occasions. Troops were stationed on the campus and action was taken against professors whom the tsar thought had been behind the anti-tsarist movement. In\n1911\naround\n130\nprofessors resigned in protest at the actions that were being taken against the university and its professors. Chaplygin was one of the professors who resigned in\n1911\nalong with a number of his colleagues in mathematics such as Boleslav Kornelievich Mlodzeevskii\n(1858\n-\n1923)\n, who was very active in the\nMoscow Mathematical Society\n.\nIn fact it was the\nMoscow Mathematical Society\nwhich played an important role in keeping Moscow mathematicians in contact with each other during the years after they resigned their university positions.\nZhukovsky\nwas the president of the\nMoscow Mathematical Society\nat this time which gave Chaplygin more reason to maintain a high level of involvement. Chaplygin read papers on mechanics and on approximate methods in analysis to the Society. He had developed methods of approximation for solving\ndifferential equation\nand he presented his first results on that topic to the\nMoscow Mathematical Society\nin\n1905\n. From\n1910\nhe studied the theory of the aeroplane wing, presenting a paper to the Society in February of that year which determined the flow around a wing section. In the same year he published his results in the paper\nOn the pressure exerted by a plane-parallel flow on an obstructing body\n, which gave the lift on a wing section\n[\n1\n]\n:-\nThe postulate concerning the determination of the rate of circulation around a wing was first precisely stated in this paper. This postulate - the so-called Chaplygin-\nZhukovsky\npostulate - gives a complete solution to the problem of the forces exerted by a stream on a body passing through it. This article includes the fundamentals of plane aerodynamics, particularly Chaplygin's celebrated formulas for calculating the pressures exerted by the stream of a fluid on an impeding body. These formulas were applied by Chaplygin to the calculation of the stream pressure on various wing profiles for which he gives the construction.\nKhristianovich writes about this work in\n[\n9\n]\n:-\nThe most notable feature of this study is the statement that if the wing profile has a rounded leading edge and a sharp trailing edge then as it moves uniformly in a fluid, a circulatory flow is established with continuously shedding flow at the sharp trailing edge. In this case a lift proportional to the angle of attack develops.\nChaplygin's important paper\nTheory of cascaded airfoils\n(1914)\npresented the basic theory of circulation round cascades, the theory which is used in the design of propellers, turbines and other hydraulic devices.\nTogether with\nZhukovsky\n, Chaplygin planned for the setting up of an aeronautical research centre in Moscow. Following the Russian October Revolution of\n1917\n, Lenin agreed that such a centre should be set up. The Central Aerohydrodynamic Institute, or TsAGI, was founded in\n1918\nand Chaplygin helped organise the Institute from that time. In fact from the time that TsAGI was founded, he devoted almost all his energies to the project. On the death of\nZhukovsky\nin\n1921\n, Chaplygin became Chairman of the Board, a position he held until\n1930\n. He was Executive Director of the Institute from\n1928\nto\n1931\n, then he became head of the scientific work of the Institute. Under his leadership excellent laboratories were built at TsAGI, including a wind tunnel in\n1925\n.\nLazar Aronovich Lyusternik became a research student in the Moscow Institute of Mathematics and Mechanics in\n1922\nwhere he was taught by Chaplygin. He describes in\n[\n12\n]\nthe extremely high standards that Chaplygin had for the top students:-\nIn my student days, he used to give courses on the mechanics of a particle and of a system, but even at the lectures of this most distinguished scholar there was sometimes only one student present - Minakov\n(\nlater professor of mechanics\n)\n, whom Chaplygin used to 'torture', so the story goes, by making him solve difficult mechanics problems.\nLyusternik also describes Chaplygin's appearance:-\nChaplygin had a distinctive appearance, as if he was made up entirely of angles. He would have been a good model for the then fashionable cubist portraits. I think some portraits that soften this angularity deprive Chaplygin of his individuality.\nHowever, there were political problems in the Soviet Union during the\n1930\ns which made the life of many top scientists extremely difficult. On\n3\nJuly\n1936\n,\nNikolai Nikolaevich Luzin\n, Professor of Pure Mathematics at Moscow University, was the victim of a violent political campaign organized by the Soviet authorities through the newspaper\nPravda\n. In the article\nEnemies under the Mask of a Soviet Citizen\nhe was accused of anti-Soviet propaganda and sabotage by publishing all his important results abroad and only minor papers in Soviet journals. The article claimed that\nLuzin\ncombined:-\n... moral unscrupulousness and scientific dishonesty with deeply concealed enmity and hatred to every bit of the Soviet life.\nA week after the article appeared, Chaplygin wrote to V I Vernadsky explaining how he felt at the attack on his colleague:-\nThe article about\nLuzin\nis completely outrageous: Supposing that he committed the sin of misjudging some applicant for a scientific degree or title, but how is it possible to jump to the conclusion of sabotage from that?! ... As far as the accusations, slipped in throughout the article, of fascism and his enlisting the old reactionary Moscow school of mathematics, I am complete unable to understand these. There remains the critical evaluation of\nLuzin\n's contributions. But in this regard I must say only that this discloses the complete incompetence of the authors which proves their minor and superficial acquaintance with his works and their deliberate distortion of correct evaluation. His authority is incomparable with that of\nKhinchin\nwho is counterpoised to him. But what should be done right away? How can we help N. N.? I did only one thing so far: I sent N. N. a cable whose copy I attach: \"Dumbfounded by absolutely undeserved newspaper attacks against you. Your high world-wide acknowledged scientific authority cannot be shaken. I hope definitely that you will find the inner forces to face this inauthoritative criticism of your contributions calmly. I avoid mentioning the completely groundless accusations of the other sort.\"\nChaplygin received many awards for his outstanding contributions. He was elected a corresponding member of the\nUSSR Academy of Sciences\non\n6\nDecember\n1924\nthen, four years later, he became a full member on\n12\nJanuary\n1929\n. Also in\n1929\nhe received the title of Honoured Scientist. He was awarded the\nN E Zhukovsky\nPrize in\n1925\n. He received two Orders of Lenin, two Orders of the Red Banner of Labour, and was awarded the title Hero of Socialist Labour in\n1941\n. As an indication of Chaplygin's way of thinking, we quote a story told by Lyusternik\n[\n12\n]\n:-\nOne day Sergei Alekseevich pulled from some bag of old papers a manuscript containing the foundations of a theory of the boundary layer, developed as far as Prandtl's work. But Chaplygin had not published this paper, since this theory did not have a mathematical basis.\nAlthough World War II started in September\n1939\nwith the German and Russian invasion of Poland, this had little effect on the Central Aerohydrodynamic Institute in Moscow or on its staff. However, on\n22\nJune\n1941\nthe German armies invaded their former ally pushing rapidly east into Soviet lands. They advanced along a broad front from the Baltic to the Black Sea and, in the autumn of\n1941\n, the Central Aerohydrodynamic Institute was evacuated from Moscow to Kazan and Novosibirsk. Chaplygin took charge of the Novosibirsk branch of the Institute and rapidly organised the building of a wind tunnel and research laboratories. However, the hard work and difficult circumstances told on his health and he died from a brain haemorrhage in October\n1942\n.\nFurther honours were given to Chaplygin following his death. In\n1942\nthe\nUSSR Academy of Sciences\nestablished the S A Chaplygin Prize:-\nFor the best original work in theoretical research in the field of mechanics.\nRanenburg, the town of his birth, was renamed Chaplygin in\n1948\n. His collected papers were published in\n1948\n-\n1950\nin four volumes: Volume\n1\n. Theoretical mechanics and mathematics; Volume\n2\n. Hydromechanics and aerodynamics; Volume\n3\n. Lectures and presentations on mathematics and mechanics; and Volume\n4\n. Lecture courses on theoretical mechanics. Selections of his many papers on mechanics and mathematics were re-published in\n1954\nand\n1976\n. A crater on the moon has been named for Chaplygin.\nFinally let us mention that Chaplygin loved playing chess and spent many hours playing against friends in the staff club.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}