{
  "nome_completo": "Seth Ward",
  "nome_curto": "Seth Ward",
  "ano_nascimento": "1617",
  "ano_morte": "1689",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ward_Seth/",
  "lugar_nascimento": "Aspenden, Hertfordshire, England",
  "lugar_morte": "London, England",
  "biografia": "Seth Ward\n's parents were John Ward, an attorney with a good reputation who was quite poor, and Martha Dalton. John Ward's father had been a rich man with a sizable estate, but had squandered his wealth. Seth was the second of his parents' three sons, there being six children in the family. Pope, who was a close friend of Ward, writes\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nI never heard Ward speak of his father, but that he often spoke fondly and admiringly of his mother, and believed that his character was due to her.\nHe was educated at the grammar school in Buntingford, then at Sidney Sussex College of the University of Cambridge, which he entered on\n1\nOctober\n1632\nas a\nsizar\nsince his family was poor. He was tutored by Samuel Ward, who was not a relation, and lodged in his lodgings. He appears to have been somewhat shy and worked long hours in the library rather than spend time in the city. He showed considerable promise in mathematics and he impressed John Bainbridge, the first Savilian professor of astronomy. After disputing the differences between the Julian and Gregorian calendars, he was awarded his BA in\n1637\n. In\n1640\nhe was elected a fellow of Sidney Sussex College, then three years later he was appointed as a mathematics lecturer at the University of Cambridge. He went to study privately with\nWilliam Oughtred\n, an ordained an Episcopal minister who taught mathematics to students who came to live in his house during their period of instruction in\n1643\n. When he returned to Cambridge, Ward introduced ideas from\nOughtred\n's\nClavis Mathematicae\n(1631)\ninto the syllabus there.\nThe First English Civil War began in\n1642\n, before Ward was appointed to his lectureship. The Parliamentarians opposed the Royalists and the first battle in the war took place at Edgehill in October\n1642\n. Early in\n1643\nRoyalist forces were doing well and the Parliamentarians sought an alliance with the Covenanters in Scotland. This led to a document called the\nSolemn League and Covenant\nwhich promised a reformed religion in England and Scotland in return for military support from the Scots. Early in\n1644\na Scottish army marched south to support the Parliamentarians, and in turn the English Parliament decreed that the Covenant was to be taken by every Englishman over the age of eighteen. It became a prerequisite for everyone holding office under Parliament. Ward opposed the\nSolemn League and Covenant\nand as a result he was removed from his fellowship and lectureship by the Parliamentarian Commissioners in\n1644\n. He left Cambridge, living with friends near London, also spending a period with\nOughtred\nat Albury. He then acted for several years as a tutor to the family of Ralph Freeman in Aspenden.\nCharles I made his own alliance with the Scots in\n1648\nand the\nSolemn League and Covenant\nwas no longer a prerequisite. Ward was able to hold positions again and was now in favour with the Parliamentarians having signed allegiance to the Commonwealth. He was appointed to the Savilian Chair of Astronomy at Oxford in\n1649\n, a post which he held until\n1661\n. The Savilian Chair had become vacant in November of\n1648\nwhen Oxford was visited by representatives of Cromwell's parliamentary party with the purpose of ensuring that the scholars in post there were loyal to Parliament and they dismissed the holder of the chair\nJohn Greaves\n. However,\nGreaves\nwas a friend of Ward and, before leaving office, was able to organise that Ward succeed him. The same Commissioners who dismissed\nGreaves\nappointed\nJohn Wilkins\nas warden of Wadham College, and\nWilkins\ninvited Ward to live in rooms in Wadham.\nWard set up an observatory at Wadham and was the first person at Oxford to teach the Copernican system. He describes his activities in this area in a letter written on\n27\nFebruary\n1652\n(\nsee\n[\n10\n]\nwhere Ward's old-fashioned English is preserved\n)\n:-\nI have spent much of my time\n(\nbeside my readings which excepting Xmas to have been continual since the\n10\nof October\n)\nin building a slight observatory for the matter of my profession and in procuring and fitting Telescopes and other instruments for observation so that the account I can give of those\n2\ndesigns, I mentioned to you, is but small yet somewhat I have done in both of them, and in that which I look on as the chief I have in Xmas time made not only a progress but an alteration to a good advantage.\nHe was a founding fellow of the\nRoyal Society\n, elected in\n1663\n. In fact he was a member of the Oxford Philosophical Society which was a fore-runner of the\nRoyal Society\n. Robinson writes in\n[\n10\n]\n:-\nAt that time Oxford was the home of many illustrious men of science, among whom may be mentioned\nJohn Wilkins\n, the Warden of Wadham;\nRobert Boyle\n; Thomas Willis; Jonathan Coddard; and\nJohn Wallis\n. These men constituted a brilliant intellectual group and they, together with Ward and others, formed the Oxford Philosophical Society. All of the above took an active interest in the formation of the\nRoyal Society\nin\n1660\nand became original Fellows.\nIn the same letter we quoted from above\n(\nwritten on\n27\nFebruary\n1652)\n, Ward describes the activities of the Oxford Philosophical Society\n[\n10\n]\n:-\n... our Club ... consists of about\n30\npersons. We have\n(\nevery one taking a portion\n)\ngone over all or most of the heads of natural philosophy and applied mathematics collecting only a history of the phenomena out of such authors as we have in our library and sometimes trying experiments as we had occasion and opportunity. Our first business is to gather together such things as are already discovered and to make a book with a general index of them ....\nWe have conceived it requisite to examine all the books of our public library\n(\nevery one taking his part\n)\nand to make a catalogue or index of the matters and that very particularly in philosophy, physics, mathematics and indeed in all other faculties, that so that great numbers of books may be serviceable and a man may at once see where he may find whatever is there concerning the argument he is upon, and this is our present business which we hope to dispatch this Lent.\nThe library Ward refers to in this letter is the Bodleian Library which had been founded in\n1598\n. In addition to his work in astronomy, Ward wrote several mathematical works, in particular\nIdea trigonometriae demonstratae\n(1654)\n, but he is perhaps best known for his defence of the teaching at Oxford. In\n1654\nJohn Webster, a chaplain in the army, published\nAcademiarum Examen\nin which he claimed that the universities were blindly devoted to\nAristotle\nbut outside the universities:-\n... some private spirits have made progress, as\nNapier\n,\nBriggs\n,\nOughtred\n. and some others.\n[\nHowever\n]\nit had lain as a fair garden unweeded or cultivated, so little have the Schools done to advance learning or promote sciences.\nWard, in collaboration with\nJohn Wilkins\n, replied to Webster in\nVindiciae Academiarum\n(1654)\n. They pointed out that:-\n... natural science and all new forms of knowledge are welcomed, mathematics has been considerably advanced, chemistry and magnetism are studied, and projects are afoot for establishing a laboratory for chemical, mechanical and optical researches. Those who cry out upon the university exercises in the schools close their eyes to the work done in college halls and in tutors' chambers.\nArithmetic and geometry are sincerely and profoundly taught, analytical algebra, the solution and application of equations, containing the whole mystery of both those sciences, being faithfully expounded in the Schools by the Professor of Geometry, and in several Colleges by particular tutors.\nIt was not only with Webster that Ward disputed. He also disputed with\nHobbes\nfor his attack on mathematics and the universities. His main attack was\nIn Thomae Hobbii philosophiam exercitatio epistolica\n(1656)\nin which he examined\nHobbes\n' philosophy and theology, to which\nHobbes\nreplied in the last of his\nSix Lessons to the Savilian Professors of the Mathematics\n(1656)\n. Pope\n(\n[\n5\n]\nor\n[\n6\n]\n)\nreports that relations between\nHobbes\nand Ward reached such a low point that when\nHobbes\nwas invited to visit a mutual friend he would first check whether Ward was invited before accepting.\nOn the astronomy side Ward disputed with\nIsmael Boulliau\nin what has become known as the\nBoulliau\n-Ward controversy over\nKepler\n's laws. In\n1645\nBoulliau\n, although accepting elliptical orbits for planets, argued strongly against\nKepler\n's laws, claiming that the planets were self-moved and totally dismissed\nKepler\n's mathematics as \"a-geometric\". He called\nKepler\na \"mediocre geometer\". Ward opposed\nBoulliau\n's assumptions, methods and conclusions. The argument was a difficult one where accuracy of prediction, simplicity of hypothesis and physical basis of the hypothesis all played a major role. The hypothesis which gave results most closely matching observations was not necessarily physically correct.\nWard was awarded a divinity degree from Oxford in\n1654\n. In\n1657\nhe was elected to the position of President of Jesus College, Oxford, but Cromwell preferred another and he never took up the post. In\n1659\nhe was elected President of Trinity College, Oxford, and this time he took up the post. However following the Restoration of the monarchy under Charles II in\n1660\n, the previous Royalist President, was reinstated and Ward removed from the post. Already Dean of Exeter, he resigned the Savilian Chair of Astronomy at Oxford in\n1661\nin order to became Bishop of Exeter in the following year.\nWren\nwas Ward's successor as Savilian professor at Oxford. Ward's career in the church is described by Richard John King\n[\n4\n]\n:-\nIn\n1662\n, not long after the Restoration, he succeeded John Gauden to the See of Exeter. He was already Dean of that City. Very severe to Nonconformists, he was a greater benefactor to his Cathedral than any bishop since the Reformation. He first cast out the buyers and sellers who had usurped the cloister and caused the partition in the Cathedral Church to be pulled down. He repaired and beautified the building, the expenses whereof amounted to £\n25\n,\n000\n. He also bought a new \"pair of organs,\" esteemed the best in England, which cost £\n2\n,\n000\n. Bishop Ward was translated to Salisbury in\n1667\nwhere he also set about repairs necessitated by the disorders of the Civil War. The Bishop's Palace, he completely restored, it having fallen into ruin. A survey of the entire Cathedral at Salisbury was made at Bishop Ward's request to Sir\nChristopher Wren\n, principally with a view to the security of the spire. Beside other benefactions to Salisbury, he founded in it a hospital for widows of the clergy of the diocese. Bishop Ward's learning was considerable, his charity and hospitality very great. He was one of the first to assist in the establishment of the Royal Society. He died in Knightsbridge in January\n1688\n, having long since lost his faculties and therefore unaware of the great events of the Glorious Revolution during which king James II lodged in his Episcopal Palace. Bishop Ward was buried in his own Cathedral at Salisbury, where a tablet to his memory exists in the south transept.",
  "math_areas": [
    "Applied Mathematics",
    "Geometry"
  ]
}