{
  "nome_completo": "Shigefumi Mori",
  "nome_curto": "Shigefumi Mori",
  "ano_nascimento": "1951",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mori/",
  "lugar_nascimento": "Nagoya, Japan",
  "lugar_morte": null,
  "biografia": "Shigefumi Mori\nattended Kyoto University and he received his B.A. from there in\n1973\nand his M.A. in\n1975\n. In that year he was appointed as an assistant at Kyoto and studied there for his doctorate under\nMasayoshi Nagata\n's supervision. He was awarded his doctorate in\n1978\nfor a thesis\nThe endomorphism rings of some abelian varieties\n.\nAfter the award of his Ph.D., Mori remained as an assistant at Kyoto until\n1980\nwhen he was appointed as a lecturer in mathematics at the University of Nagoya. He was promoted to assistant professor in\n1982\nand, in\n1988\n, to full professor. In\n1990\nMori returned to a chair at Kyoto University.\nDuring the years from\n1977\nto\n1988\nhe spent much time in the United States despite the positions he held in Japan. He was visiting professor at Harvard during\n1977\n-\n1980\n, the Institute for Advanced Study in\n1981\n-\n82\n, Columbia University\n1985\n-\n87\nand the University of Utah for periods during\n1987\n-\n89\nand again during\n1991\n-\n92\n.\nMori works on\nalgebraic geometry\n. To put his work in perspective we should note that, as in many areas of mathematics, classification is the ultimate aim. As\nHironaka\nwrites in\n[\n4\n]\n:-\n... to classify algebraic varieties has always been a fundamental problem of algebraic geometry and even an ultimate dream of algebraic geometers.\nMajor progress was made on classifying algebraic surfaces during the first part of the\n20\nth\ncentury by the great Italian algebraic geometers led by\nCastelnuovo\n,\nEnriques\nand\nSeveri\n. Progress in this line continued with\nZariski\n's contribution during the\n1950\ns, followed by\nKodaira\n's work in the following decade. Mori's work achieved a remarkable continuation of classification efforts in algebraic geometry and in many ways provides a fitting chapter in the progress of algebraic geometry through the\n20\nth\ncentury.\nMori was awarded a\nFields Medal\nat the\n1990\nInternational Congress which was held in the city in which he had studied as a student, namely Kyoto in Japan. He received this Medal for some remarkable work over a\n12\nyear period. He worked on algebraic\nmanifolds\nwith ample tangent bundles and was the first to prove the Hartshorne conjecture in\n1978\n. This conjecture, posed in\n1970\n, claimed that projective spaces are the only smooth complete algebraic varieties with ample tangent bundles.\nIn\n1981\nMori completed the classification of\nFano\n3\n-folds and worked on the minimal model programme.\nHironaka\n, speaking of Mori's work which led to the award of the Fields Medal said\n[\n4\n]\n:-\nThe most profound and exciting development in algebraic geometry during the last decade or so was the Minimal Model Program or Mori's Program in connection with th classification problems of algebraic varieties of dimension three. Shigefumi Mori initiated the program with a decisively new and powerful technique, guided the general research direction with some good collaborators along the way, and finally finished up the program by himself overcoming the last difficulty.\nMori has received many other awards for his outstanding work. Before receiving the Fields Medal in\n1990\nhe had already been awarded the\nJapan Mathematical Society\n's Yanaga Prize in\n1983\n, the Chunichi Culture Prize in\n1984\n. In\n1988\n, jointly with Y Kawamata, he received a Prize from the\nJapan Mathematical Society\nfor:-\n...outstanding work in the minimal model theory for algebraic varieties.\nIn\n1989\nhe received the Inoue Prize for:-\n...outstanding work in the theory of higher dimensional algebraic varieties and in particular for the proof of existence of minimal models for\n3\n-dimensional algebraic varieties.\nThe same year as he was awarded the Fields Medal, in\n1990\n, Mori was awarded the\nCole\nPrize in Algebra from the\nAmerican Mathematical Society\n. The citation for the award states\n[\n8\n]\n:-\nThe committee unanimously recommends that the\n1990\nCole\nPrize in Algebra be awarded to Shigefumi Mori for his outstanding work on the classification of algebraic varieties. Mori took the decisive steps over a ten-year period in extending the classical theory of algebraic surfaces to dimension three: prior to Mori's breakthroughs this problem seemed out of reach. Mori's beautiful work also makes major inroads into the problem in higher dimensions.\nIn\n1998\nMori published the monograph\nBirational geometry of algebraic varieties\nwhich he coauthored with János Kollár. Mark Gross writes in a review:-\nThe minimal model program, or Mori's program, was one of the great successes of algebraic geometry in the\n1980\ns. The basic goal was to understand the birational geometry of threefolds in a way analogous to the birational theory of surfaces. This approach got its start with work of Mori ... The book under review, written by two of the leaders in the field, is a comprehensive treatment of the minimal model program. ...\nMori continues to publish important papers such as:\nRational curves on algebraic varieties\n(2000)\n,\n(\nwith O Fujino\n)\nA canonical bundle formula\n(2000)\n,\nSemistable extremal neighborhoods\n(2002)\n,\n(\nwith V Alexeev\n)\nBounding singular surfaces of general type\n(2003)\n, and\n(\nwith\nY Prokhorov\n)\nQ-conic bundles\n(2008)\n.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic",
    "Topology"
  ]
}