{
  "nome_completo": "Shing-Tung Yau",
  "nome_curto": "Shing-Tung Yau",
  "ano_nascimento": "1949",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yau/",
  "lugar_nascimento": "Kwuntung (now Guangdong), China",
  "lugar_morte": null,
  "biografia": "Shing-Tung Yau\nwas the fifth of the eight children of his parents Chen Ying Chiou and Yeuk-Lam Leung Chiou. He has a younger brother Stephen Shing-Toung Yau\n(\nborn\n1952)\nwho is also an exceptional mathematician. His father was an economist and philosopher working in southern China when Yau was born. However, by late\n1949\nthe Communists were in control of almost all of China and Yau's family fled to Hong Kong where his father obtained a position teaching at a College.\n(\nThe College later became a part of the Chinese University of Hong Kong.\n)\nIn the interview\n[\n76\n]\nYau gives more details:-\nMy father went to Japan to study economics, but he came back to help the Chinese defend themselves before the Japanese invaded in\n1937\n. By the end of the war he was distributing food and clothes to the poor for the U.N. After the revolution in\n1949\n, he worried about getting in trouble with the Communists, so he brought the whole family to Hong Kong. We were very poor - at first we were almost starving - but my father had a large group of students constantly at home to talk about philosophy and literature. I was\n10\n,\n11\n,\n12\nyears old, and I grew accustomed to abstract reasoning. My father made us memorise long essays and poems. At the time I didn't understand what they meant, but I remembered them and later made use of it.\nTimes were extremely difficult for the family so Yau's mother knitted goods to sell in order to supplement their low income. Life was tough for Yau living in a village outside Hong Kong city in a house which had no electricity or running water and at this stage of his life he often played truant from school preferring his role as leader of a street gang. Yau's father was a major influence on him, encouraging his interest in philosophy and mathematics. In\n2003\nYau commented\n[\n43\n]\n:-\nIn fact, I felt I could understand my father's conversations better after I learned geometry.\nYau's father was pressured to spy on China but refused and resigned his professorship at the Chinese University of Hong Kong. Sadly, Yau's older sister died in\n1962\n, an elder brother got a brain disease, and when Yau was fourteen years old, his father died. In a tribute to his father, written on his centennial birthday in\n2011\n, Yau writes\n[\n80\n]\n:-\nAn inspiring life of ups and down, vanquished in a moment.\nThough his wisdom of East and West still echoes in my heart.\nI never enjoyed his love enough, which has left me in dismay.\nThe bloom of youth has passed me by, my hair turned to grey.\nYet I oft look back to that fateful time when I was just a careless teen.\nHow sad it was when he left that night, so long ago and faraway.\nWhat might he have told us, I wonder, if only he could have said?\nThough I'll never hear those words, his thoughts are with me, always.\nBy the time he was fourteen, Yau was enjoying his High School education at the school named Pui Ching but he also had to help support the family. He helped out with the family's finances by acting as a tutor. Despite the fact that Pui Ching school had a great reputation, he later felt that physics had not been taught very well there and he had not been given enough intuition for the subject. After leaving school in\n1965\n, he continued his education at Chung Chi College in Hong Kong. This College had been founded in\n1951\nbut, in\n1963\n, was incorporated as one of the three foundation colleges of the Chinese University of Hong Kong. Yau left the College in\n1968\nbefore graduating. By good fortune, one of his lecturers at the College had studied at the University of California, Berkeley, and, seeing Yau's enormous potential, suggested that he go there to study for a doctorate.\nThis lecturer was Stephen Salaff\n(1938\n-\n2012)\nwho was born in Stamford, Connecticut, USA, and had studied at Columbia University before going to England to study for a bachelor's degree in mathematics at the University of London. He had been awarded a Ph.D. in mathematics from the University of California at Berkeley where he met the student Janet Weitzner. They married and since Janet's research required going to China, the couple moved to Hong Kong and Stephen lectured in mathematics at the Chinese University there. Yau has always been extremely grateful for Salaff's support. He said in\n2012\n[\n60\n]\n:-\nWithout Steve's help, I would not be the mathematician I am now.\nYau explained in the interview\n[\n38\n]\nhow Salaff supported him:-\nActually Stephen tried to get me an early undergraduate degree. There was a big fight at the Chinese University of Hong Kong. Of course, they regret it now because I got a\nFields\nMedal. If I was a graduate from the Chinese University it would count as a good point for them.\nSalaff contacted Donald Sarason, an Associate Professor at Berkeley and, probably with\nShiing-shen Chern\n's help, they managed to get Berkeley to waive their entrance requirements and award him one of two International Business Machines Corporation Fellowships to fund him to undertake research at the University of California at Berkeley. Yau said\n[\n38\n]\n:-\nWhen I applied, I didn't know\nChern\n, but after I was admitted\nChern\nwas offered an honorary degree by the Chinese University of Hong Kong. I think in June he came to Hong Kong from America to pick up the degree and I met him in the middle of June. That was after I was admitted. But I'm sure he must have helped somewhat.\nYau asked his friends to lend him some money so he could afford the air fare to America. He flew to San Francisco in September\n1969\nand, meeting up with three others looking for accommodation, they were able to rent a place. Although he received $\n300\na month from his scholarship, he sent half back to his family in Hong Kong, so life was hard. He began by attending courses\n[\n29\n]\n:-\nI enrolled in many classes because I felt I didn't know many different areas of modern mathematics and I started to be interested in geometry. I learned quite a lot of things from different faculties in Berkeley and during the first semester I learned about manifolds. I learned Riemannian geometry, but not enough, it was just elementary.\nHe attended a course on nonlinear partial differential equations given by Charles Bradfield Morrey Jr.\n(1907\n-\n1984)\nwhich he felt was excellent and, unable to afford to return home, spent the Christmas vacation working in the library reading research papers and monographs. Most of all, he enjoyed reading the\nJournal of Differential Geometry\n. In particular, he read a paper by\nJohn Milnor\ndescribing how the fundamental group of a manifold is influenced by curvature. He found\nMilnor\n's paper very well written and easy to understand. It referred to earlier papers which Yau found and read. Although only a few months into his time as a graduate student, he found himself able to generalise some of the results in these papers.\nChern\nhad not been in Berkeley during Yau's first year as a graduate student but when he returned at the beginning of Yau's second year Yau asked\nChern\nif he would be his thesis advisor. He agreed and Yau continued studying at Berkeley with\nChern\nas his supervisor. In\n[\n21\n]\nArthur Fischer describes what Berkeley was like at that time for mathematics graduate students:-\nThe mathematics department at that time, in\n1969\nand\n1970\n, was crammed into Campbell Hall, the Astronomy building, and was not to occupy its current home on the top four floors of Evans Hall until\n1971\n. In this small volume, low entropy state, there was considerable interaction between faculty, lecturers, graduate students, and visiting faculty. The colloquia were often packed with a lively crowd, a hundred people or so in a theatre-like setting, which was a lot of people, at least as compared with the small audiences and tranquil demeanour of the Princeton colloquia. It was in this low entropy state that I first met Yau in the Fall of\n1969\n, when he was just starting out as a first year graduate student. ... I was in the photocopy room of Campbell Hall in the Fall of\n1969\n... and Yau walked in. We vaguely had known of each other's existence, but not much more. Yau was there to photocopy his notes on links between curvature and topology. I was interested. He told me more. I talked about what I was working on, a global formulation of the Hamiltonian structure of general relativity. It was a hit. These might be related. We both got excited.\nOnce he was\nChern\n's student, Yau spent most of his time studying complex manifolds. In particular, he read Eugenio Calabi's papers and became fascinated by the Calabi conjecture. After only two years, he received his Ph.D. in\n1971\nfor his thesis\nOn the Fundamental Group of Compact Manifolds of Non-positive Curvature\n. By this time he had three papers in print,\nOn the fundamental group of manifolds of non-positive curvature\n(1970)\n,\nOn the fundamental group of compact manifolds of non-positive curvature\n(1971)\n, and\nCompact flat Riemannian manifolds\n(1971)\n.\nDuring session\n1971\n-\n72\n, Yau was a member of the Institute for Advanced Study at Princeton. He was appointed assistant professor at the State University of New York at Stony Brook in\n1972\n. In\n1974\nhe was appointed an associate professor at Stanford University.\nJohn Coates\nmet Yau at this time. He writes\n[\n12\n]\n:-\nI first met Yau when he came to Stanford University in\n1974\n, a year after I had arrived at Stanford. I was rapidly struck by two qualities of Yau at this time. Firstly, he had very broad mathematical interests\n(\nfor example, I was amazed that he sat patiently though a rather technical graduate course which I gave on\nIwasawa\ntheory\n)\n. Secondly, he was remarkably hard working. Indeed, I would occasionally come into the Stanford Mathematics Department towards midnight, and on every occasion I remember finding Yau there either doing his own work or talking to the keen group of graduate students which he quickly gathered around him.\nIn\n1976\nYau married the physicist Yu-yun Kuo; they have two sons, Isaac Yau and Michael Yau. He wrote in\n[\n80\n]\n:-\nI was also lucky to have fallen in love with, and eventually married, a woman who shared my view that there is more to life than seeking personal wealth, material possessions, and luxuries - that greater rewards can come from scholarly endeavours. I'm proud to see that our sons have also ventured far along academic paths.\nYau was promoted to full professor at Stanford before returning to the Institute for Advanced Study at Princeton in\n1979\n. In\n1980\nhe was made a professor at the Institute for Advanced Study at Princeton, a position he held until\n1984\nwhen he moved to a chair at the University of California at San Diego. In\n1988\nhe was appointed professor at Harvard University. He was William Caspar Graustein Professor of Mathematics at Harvard but, in April\n2022\n, he retired from Harvard, where he was named William Caspar Graustein Professor of Mathematics Emeritus, to become a professor of mathematics at Tsinghua University in Beijing, China.\nYau was awarded a\nFields\nMedal in\n1982\nfor his contributions to partial differential equations, to the Calabi conjecture in algebraic geometry, to the positive mass conjecture of general relativity theory, and to real and complex\nMonge\n-\nAmpère\nequations. In fact the\n1982\nFields\nMedals were announced at a meeting of the General Assembly of the\nInternational Mathematical Union\nin Warsaw in early August\n1982\n. They were not presented until the International Congress in Warsaw which could not be held in\n1982\nas scheduled and was delayed until the following year.\nNirenberg\ndescribed Yau's work at the International Congress in Warsaw in\n1983\n. Writing in\n[\n49\n]\nafter the\nFields\nMedal awards were announced in\n1982\n,\nNirenberg\nwrote:-\nS-T Yau has done extremely deep and powerful work in differential geometry and partial differential equations. He is an analyst's geometer\n(\nor geometer's analyst\n)\nwith enormous technical power and insight. He has cracked problems on which progress has been stopped for years.\nNirenberg\ndescribes briefly the areas of Yau's work. On the Calabi conjecture, which was made in\n1954\n, he writes that this\n[\n49\n]\n:-\n... comes from algebraic geometry and involves proving the existence of a\nKähler\nmetric, on a compact\nKähler\nmanifold, having a prescribed volume form. The analytic problem is that of proving the existence of a solution of a highly nonlinear\n(\ncomplex\nMonge\n-\nAmpère\n)\ndifferential equation. Yau's solution is classical in spirit, via a priori estimates. His derivation of the estimates is a tour de force and the applications in algebraic geometry are beautiful.\nYau solved the Calabi conjecture in\n1976\n. In\n1997\n, after being awarded the National Medal of Science, he spoke about the difficulties he encountered trying to either prove or disprove the conjecture; see\nTHIS LINK\n.\nAnother conjecture solved by Yau was the positive mass conjecture, which comes from Riemannian geometry. Yau, in joint work, constructed minimal surfaces, studied their stability and made a deep analysis of how they behave in space-time. His work here has applications to the formation of black holes.\nThe\nPlateau\nproblem was studied by\nPlateau\n,\nWeierstrass\n,\nRiemann\nand\nSchwarz\nbut it was finally solved by\nDouglas\nand\nRadó\n. However, there were still questions relating to whether\nDouglas\n's solution, which was known to be a smooth immersed surface, is actually embedded. Yau, working with W H Meeks solved this problem in\n1980\n.\nIn\n1981\nYau was awarded The\nOswald Veblen\nPrize in Geometry\n[\n89\n]\n:-\n...for his work in nonlinear partial differential equations, his contributions to the topology of differentiable manifolds, and for his work on the complex\nMonge\n-\nAmpère\nequation on compact complex manifolds.\nIn the same year be was awarded the John J Carty Award for the Advancement of Science of the\nNational Academy of Sciences\n. This is given:-\n... to recognise noteworthy and distinguished accomplishments in any field of science within the\nNational Academy of Science\n's charter.\nIn joint work of Yau with\nKaren Uhlenbeck\nOn the existence of Hermitian Yang-Mills connections in stable bundles\n(1986)\n, they solved higher dimensional versions of the Hitchin-Kobayashi conjecture. Their work extended that of\nDonaldson\non this topic in\n1985\n.\nThe Crafoord Prize of the\nRoyal Swedish Academy of Sciences\nwas awarded to Yau in\n1994\n[\n75\n]\n:-\n... for his development of non-linear techniques in differential geometry leading to the solution of several outstanding problems.\nG Tian\n[\n74\n]\nsums up Yau's work to date which led to his being awarded the Crafoord Prize:-\nAs a result of Yau's work over the past twenty years, the role and understanding of basic partial differential equations in geometry has changed and expanded enormously within the field of mathematics. His work has had, and will continue to have, a great impact on areas of mathematics and physics as diverse as topology, algebraic geometry, representation theory, and general relativity as well as differential geometry and partial differential equations.\nYou can read extracts from the citation for the award of the Crafoord Prize to Yau at\nTHIS LINK\n.\nYau was elected to the\nNational Academy of Sciences\nin\n1993\n. He was awarded the National Medal of Science in\n1997\n[\n17\n]\n:-\n... for his fundamental contributions in mathematics and physics. Through his work, the understanding of basic geometric differential equations has been changed and he has expanded their role enormously within mathematics.\nYou can read extracts from the citation for the award of the National Medal of Science to Yau at\nTHIS LINK\n.\nIn\n2010\n, Yau was awarded the highly prestigious Wolf Prize\n[\n70\n]\n:-\n... for his work in geometric analysis that has had a profound and dramatic impact on many areas of geometry and physics\nYou can read extracts from the citation for the award of the Wolf Prize to Yau at\nTHIS LINK\n.\nIn\n2023\n, Yau was awarded another very prestigious prize, the Shaw Prize, for his\n[\n69\n]\n:-\n... contributions related to mathematical physics, to arithmetic geometry, to differential geometry and to Kähler geometry.\nYou can read extracts from the citation for the award of the Shaw Prize to Yau at\nTHIS LINK\n.\nHe put a great deal of effort into building Chinese mathematics, visiting China during the Harvard summer vacation, helping top Chinese students go to the United States for doctoral studies, and working hard for the founding of mathematical institutes in Hong Kong, Beijing and Hangzhou. In\n2004\nhe was honoured in the Great Hall of the People, located on the western side of Tiananmen Square in Beijing, for his contributions to Chinese mathematics.\nHe spoke about his work to help build mathematics in China when the Shing-Tung Yau Mathematical Science Centre was Inaugurated at Tsinghua University on\n19\nMarch\n2015\n. Yau made a speech at the Opening Ceremony\n[\n79\n]\n:-\nOver the years, I have established several mathematics centres in various places in China. My goal is simply to see that China could develop a subject as fundamental as mathematics. I am very grateful that most Chinese mathematicians share my convictions. Professor Lo Yang is a good friend ... and for the past several decades, he has given us tremendous support. There are many others from around the world who have helped the development of Chinese mathematics education and research. Starting in the\nChinese Academy of Sciences\n, I have set up research centres and groups at various places in China; I have also trained dozens of Chinese students abroad. Some of them are here today. In fact, I encourage them to return to China so that we might collaborate in improving mathematics in China. We have also received help from many mathematicians within China: there are many like-minded people at Tsinghua University, the\nChinese Academy of Sciences\n, and Zhejiang University providing us with strong support. Together we have selflessly devoted our time and energy to organise and support various mathematics activities.\nYau has written many books, mostly co-authored. We give information about eight of these books, including extracts from Prefaces and reviews, at\nTHIS LINK\n.\nSadly, he was involved in an unfortunate dispute regarding the proof of the\nPoincaré\nconjecture. The Russian mathematician\nGrigory Perelman\nsketched a proof of the conjecture in\n2003\nand several teams began work on giving a full comprehensive proof. Yau's team was one of these and he has been criticised by some for comments which people felt did not give\nPerelman\nfull credit. In particular the\nNew Yorker\narticle\n[\n47\n]\nis highly critical of Yau. Richard S Hamilton, Professor of Mathematics, Columbia University, wrote the open letter\n[\n91\n]\ndefending Yau. It begins:-\nI am very disturbed by the unfair manner in which Yau Shing-Tung has been portrayed in the New Yorker article. I am providing my thoughts below to set the record straight. I authorise you to share this letter with the New Yorker and the public if that will be helpful to Yau.\nRichard Hamilton\nends his letter as follows:-\n[\nWhat\n]\nYau has built is an assembly of talent, not an empire of power, people attracted by his energy, his brilliant ideas, and his unflagging support for first rate mathematics, people whom Yau has brought together to work on the hardest problems. Yau and I have spent innumerable hours over many years working together on the\nRicci\nFlow and other problems, often even late at night. He has always generously shared his suggestions with me, starting with the observation of neck pinches, never asking for credit. In fact just last winter when I finally managed to prove a local version of the\nHarnack\ninequality for the\nRicci\nFlow, a problem we had worked on together for many years, and I said I ought to add his name to the paper, he modestly declined. It is unfortunate that his character has been so badly misrepresented. He has never to my knowledge proposed any percentages of credit, nor that\nPerelman\nshould share credit for the\nPoincaré\nconjecture with anyone but me; which is reasonable, as indeed no one has been more generous in crediting my work than\nPerelman\nhimself. Far from stealing credit for\nPerelman\n's accomplishment, he has praised\nPerelman\n's work and joined me in supporting him for the\nFields\nMedal. And indeed no one is more responsible than Yau for creating the program on\nRicci\nFlow which\nPerelman\nused to win this prize.\nYau has clearly stated that it had only been his intention to say that his team made\nPerelman\n's proof understandable to a much wider range of mathematicians.\nLet us end this biography by quoting Bun Wong and Yat Sun Poon, Professors of Mathematics at the University of California at Riverside\n[\n84\n]\n:-\nYau's achievement in Mathematics is well known within mathematics community. It is equally well known that he has successfully produced nearly\n50\nPhD students in mathematics and has many collaborators across the globe. Perhaps, it is less well known that he has donated personal fund to establish scholarships for mathematics students, has donated tens of thousands of books to educational institutions, has helped raise tens of millions of dollars to promote mathematics education and research, and has raised fund to promote interaction among scientists across subject boundaries and national borders.\nFinally, here is a poem written by Yau in\n2002\n:-\nSPACE/TIME\nTime, time\nwhy does it vanish?\nAll manner of things\nwhat infinite variety.\nThree thousand rivers\nall from one source.\nTime, space\nmind, matter, reciprocal.\nTime, time\nit never returns.\nSpace, space\nhow much can it hold?\nIn constant motion\nalways in flux.\nBlack holes lurking\nmysteries afoot.\nSpace and time\none without bounds.\nInfinite, infinite\nthe secrets of the universe.\nInexhaustible, lovely\nin every detail.\nMeasure time, measure space\nno one can do it.\nWatched through a straw\nwhat's to be learned has no end.\nShing-Tung Yau\nBeijing,\n2002",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}