{
  "nome_completo": "Shokichi Iyanaga",
  "nome_curto": "Shokichi Iyanaga",
  "ano_nascimento": "1906",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iyanaga/",
  "lugar_nascimento": "Tokyo, Japan",
  "lugar_morte": "Tokyo, Japan",
  "biografia": "Shokichi Iyanaga\nentered Tokyo University in\n1926\n. He attended algebra lectures by\nTakagi\nin his first year. He wrote\n(\nsee\n[\n1\n]\n)\n:-\nIt happened to me sometimes that I could not immediately grasp\n[\nthe lecture's\n]\ncontent, but I could always reconstruct it by taking enough time in reviewing my notes and it was the greatest pleasure to do this in the evening of the day I heard the lecture.\nIn his second year of study Iyanaga took further courses by\nTakagi\nwhich developed group theory,\nrepresentation theory\n,\nGalois theory\n, and\nalgebraic number theory\n. Although it was this latter topic which would eventually attract Iyanaga, at this stage of his undergraduate career he was attracted to differential equations. He studied this topic in T Yosiye's course and became interested in conditions under which\nd\ny\nd\nx\n=\nf\n(\nx\n,\ny\n)\n\\Large\\frac{dy}{dx}\\normalsize  = f (x, y)\nd\nx\nd\ny\n​\n=\nf\n(\nx\n,\ny\n)\nhas a unique solution. Yosiye\n[\n1\n]\n:-\n... encouraged the student to do original work and exempted him from undergoing an examination to obtain credit if he presented a good paper. Iyanaga posed the question of finding some intuitive or geometrical reasons why ... conditions assure the uniqueness of solution.\nIyanaga's paper was so good that Yosiye had it published in the\nJapanese Journal of Mathematics\n. Surprisingly Iyanaga wrote a second paper while in his second undergraduate year. This came about through talking to the Departmental Assistant T Shimizu who discussed with him questions about power series. They wrote a joint paper which was published in the\nProceedings of the Imperial Academy of Tokyo\n. Both Iyanaga's two papers appeared in print in\n1928\n.\nIn his third undergraduate year Iyanaga was allowed to take part in\nTakagi\n's seminar on class field theory. He studied\nTakagi\n's famous\n1920\npaper on extensions of\nalgebraic number fields\nand also a paper by\nHasse\nwritten in\n1926\nto give more details of\nTakagi\n's results. A question by\nTakagi\nled Iyanaga to prove a result which further led to his first paper on class field theory\n(\nand his third published paper while he was an undergraduate\n)\n. Graduating in\n1929\n, Iyanaga remained at Tokyo University where he worked under\nTakagi\nfor his doctorate. It was an exciting time with increasing mathematical activity in algebra. For example K\nShoda\n, who was a student of\nTakagi\n, had studied with\nSchur\nin Berlin and with\nEmmy Noether\nin Göttingen, and returned to Japan around the time that Iyanaga began his graduate studies.\nMost of the graduate students from Tokyo went to study in Germany but Iyanaga decided to go to France as well as Germany. He obtained a scholarship from the French government in\n1931\nand in that year he went to Hamburg where he studied with\nArtin\n. He writes\n[\n1\n]\n:-\nI was very lucky to follow\nArtin\n's course on class field theory together with\nChevalley\n.\nThe International Congress of Mathematicians was held in Zürich in\n1932\n.\nTakagi\ncame over to Europe for this Congress\n(\nhe was vice-President\n)\nand met up with Iyanaga who had gone from Hamburg to Zürich for the Congress. He writes:-\nI met\nTakagi\nin Zürich and accompanied him when he visited Hamburg, Berlin, and Paris.\nIyanaga went to Paris in\n1932\nwhere he met up with\nChevalley\nwhom he had got to know well while in Hamburg. He also met\nHenri Cartan\n,\nDieudonné\nand André\nWeil\n, and he finally returned to Tokyo in\n1934\n. He was appointed as Assistant Professor in\n1934\nand began his teaching career. He helped\nTakagi\nwith his calculus course in\n1935\n-\n36\n, the last time\nTakagi\ngave it before he retired. Iyanaga writes\n[\n1\n]\n:-\nI published no research papers in the period\n1935\n-\n39\n. I realise now that I was idle in doing research in these years because of the pressure of teaching and other business to which I was not accustomed.\nIn fact Iyanaga did, for various reasons, little original research from this time on. Perhaps his last important idea which he published in his own field was prompted by an invitation to submit a paper to a collection being assembled to honour\nFurtwängler\n. Iyanaga managed to solve a question of\nArtin\non generalising the principal ideal theorem and this was published in\n1939\n. He wrote\n[\n1\n]\n:-\nI received from Professor\nFurtwängler\na letter thanking me for my contribution, which I cherished but lost together with my house which burned in a bombardment in the Spring of\n1945\n.\nHe did publish a number of papers, however, which arose through the various courses such as algebraic topology,\nfunctional analysis\n, and geometry, which he taught. Iyanaga was promoted to Professor at Tokyo University in\n1942\nbut by this time Japan had entered World War II. He wrote:-\n... towards the end of the War, Tokyo and other Japanese cities were often bombarded and we had to find refuge in the countryside. Everyone was mobilised in one way or another for the War. And just after the War, the whole country was in distress, but on the other hand freed from military oppression, we began to make efforts to rebuild our science and culture in a better form. This kept us busy. I was particularly busy in editing textbooks from primary and secondary schools ... I continued to give courses and organise seminars, in which I used to discuss class field theory with my younger friends.\nIyanaga joined the Science Council of Japan in\n1947\n. He was invited by Stone to join the\nInternational Mathematical Union\nand in\n1952\nhe became a member of the Executive Committee. In this role he helped organise the\n1954\nInternational Congress of Mathematicians in Amsterdam, which he attended. As a member of the Science Council of Japan he was the main organiser of an International Symposium on Algebraic Number Theory held in Japan in\n1955\n.\nIyanaga spent the year\n1961\n-\n62\nin Chicago\n[\n1\n]\n:-\nIn\n1962\nI received an invitation from the University of Chicago to join its Department of Mathematics for\n1961\n-\n62\n. ... I was most happy to accept this invitation which gave me a chance to escape from administrative work which was making one busier every day. I met there\nStone\n,\nMac Lane\n, Schilling,\nAlbert\n, Suzuki, and other old friends.\nIn\n1965\nIyanaga became Dean of the faculty of Science at Tokyo University. He held this post until he retired in\n1967\n. However this was not the end of his career for he was visiting Professor at Nancy in France during\n1967\n-\n68\nand then Professor at Gakushuim University for\n10\nyears from\n1967\nto\n1977\n.\nOne important role which Iyanaga had that we have not yet mentioned was that of President of the International Commission on Mathematical Instruction from\n1975\nto\n1978\n.\nIyanaga received honours such as being awarded the Rising Sun from Japan in\n1976\n, being elected a member of the\nJapan Academy of Science\nin\n1978\n, and receiving the Order of Legion d'Honneur from France in\n1980\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}