{
  "nome_completo": "K C Sreedharan Pillai",
  "nome_curto": "Sree Pillai",
  "ano_nascimento": "1920",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pillai/",
  "lugar_nascimento": "Kerala, India",
  "lugar_morte": "Lafayette, Indiana, USA",
  "biografia": "Sree Pillai\nstudied at the University of Travancore in Trivandrum. In\n1937\n, just after Pillai began his studies there, the University of Travancore changed its name to the University of Kerala. He graduated in\n1941\nand obtained his Master's Degree in\n1945\n.\nPillai was appointed a lecturer at the University of Kerala in\n1945\nand worked there for six years until he went to the United States in\n1951\n. After studying for one year at Princeton, Pillai went to the University of North Carolina where he was awarded a doctorate in statistics in\n1954\n.\nHis first post was as a statistician with the United Nations, a post he held from\n1954\nuntil\n1962\n. Part of his duties in this post involved him founding the Statistical Center of the University of the Philippines. He was a visiting Professor and Advisor to the University over a number of years and supervised graduate students there.\nIn\n1962\nPillai was appointed Professor of Statistics and Mathematics at Purdue University. In\n[\n2\n]\nhis contributions to Purdue as described as follows:-\nIn the\n23\nyears he served Purdue, he directed the research of\n15\nPh.D. students. He was also an active consultant on several projects both within and outside the University. He was a close friend of his students and maintained a correspondence with most of them, some of whom are in remote parts of the world.\nPillai's research was in statistics, in particular in multivariate statistical analysis. In\n[\n2\n]\nhis work is described:-\n... he obtained the\nprobability\ndistributions of statistics relating to several multivariate procedures. Perhaps his best known contribution is the widely used multivariate analysis of variance test which bears his name.\nPillai was honoured by being elected a Fellow of the\nAmerican Statistical Association\nand a Fellow of the Institute of Mathematical Statistics. He was an elected member of the International Statistics Institute.\nAs well as his work at Purdue in developing the graduate programmes these Pillai was a keen golfer. This is described in\n[\n2\n]\n:-\nHis unique and unforgettable style charmed his playing companions and confused his opponents in the Purdue Staff League. His performances in the League matches were legendary.",
  "math_areas": [
    "Analysis",
    "Statistics"
  ]
}