{
  "nome_completo": "Sathamangalam Ranga Iyengar Srinivasa Varadhan",
  "nome_curto": "Srinivasa Varadhan",
  "ano_nascimento": "1940",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varadhan/",
  "lugar_nascimento": "Madras, (now Chennai) India",
  "lugar_morte": null,
  "biografia": "Srinivasa Varadhan\nis known as S R S Varadhan for short and Raghu to his friends and colleagues. His father, Ranga Iyengar, was a science teacher who became the Principal of the Board High School in Ponneri, a small town about\n30\nkm from Madras\n(\nnow called Chennai\n)\n. Varadhan, in\n[\n12\n]\n, thanked his parents for their support as he grew up:-\nEducation always got high priority in our house and I received constant encouragement from both my parents.\nHe explained in\n[\n10\n]\nhow he first became interested in mathematics while at high school:-\nAt high school I had an excellent mathematics teacher who asked some of his better students to come to his house during weekends, Saturday or Sunday, and gave them extra problems to work on. We thought of these problems just as intellectual games that we played, it was not like an exam; it was more for enjoyment. That gave me the idea that mathematics is something that you can enjoy doing like playing chess or solving puzzles. That attitude made mathematics a much more friendly subject, not something to be afraid of, and that played a role in why I got interested in mathematics.\nAfter graduating from high school in\n1955\n, Varadhan entered Presidency College of the University of Madras. There he chose to study for the degree in Statistics rather than in Mathematics. The reason for this was that the Mathematics degree consisted of Pure and Applied Mathematics while the Statistics degree replaced the applied mathematics with statistics but otherwise provided the same pure mathematics courses. At this stage in his career Varadhan thought he would enter industry after graduating and felt that his prospects were much better with the Statistics degree. He was awarded his B.A. with honours in Statistics in\n1959\nand continued for a fifth year to study for his Master's Degree which he received in\n1960\n. He then went to the Indian Statistical Institute at Kolkata\n(\nCalcutta\n)\nalthough at this stage he still had the idea that he would find a job in industry\n[\n10\n]\n:-\nI was told that I should work on statistical quality control, so I spent close to\n6\nor\n8\nmonths studying statistical quality control; in the end, that left me totally unsatisfied. Then I met Varadarajan, Parthasarathy, and Ranga Rao, who worked in probability from a totally mathematical point of view. They convinced me that I was not spending my time usefully, and that I better learn some mathematics if I wanted to do anything at all. I got interested, and I think in the second year I was there, we said to ourselves: Let us work on a problem. We picked a problem concerning probability distributions on groups. That got us started; we eventually solved the problem and in the process also learned the tools that were needed for it.\nAt the Indian Statistical Institute Varadhan's advisor was\nCalyampudi Radhakrishna Rao\nbut this was only a formal arrangement and Varadhan's thesis grew out of interactions with his colleagues. He was awarded his doctorate for his dissertation\nConvolution Properties of Distributions on Topological Groups\nin\n1963\n. In fact\nAndrei Nikolaevich Kolmogorov\nhad spent a month at the Indian Statistical Institute in\n1962\nand was appointed as one the examiners of Varadhan's thesis. He took the thesis back with him to Moscow and sent in his report which said\n[\n10\n]\n:-\nThis is not the work of a student, but of a mature master.\nAfter the award of his doctorate, Varadhan went as a post-doctoral visitor to the\nCourant\nInstitute of Mathematical Sciences at New York University, a position he held for three years\n(1963\n-\n66)\n. Daniel Stroock, who collaborated with him over many years, wrote about Varadhan's arrival\n[\n11\n]\n:-\nVaradhan, whom everyone calls Raghu, came to these shores from his native India in the fall of\n1963\n. He arrived by plane at Idlewild Airport and proceeded to Manhattan by bus .... His destination was that famous institution with the modest name, The\nCourant\nInstitute of Mathematical Sciences, where, at the behest of Monroe Donsker, he had been given a postdoctoral fellowship.\nIn\n1964\nhe married Vasundra, who was born in\n1947\nin Chennai in India but had spent most of the first twelve years of her life in New York. Vasu, like Srinivasa Varadhan, became a professor at New York University. They had two children, Gopal\n(\nborn in\n1969)\nand his younger brother Ashok. Gopal joined Cantor Fitzgerald as the Managing Director of its interest rate derivatives business in the United States in August\n2001\nand died in the north tower of the World Trade Center on September\n11\n,\n2001\n. Returning to our summary of Varadhan's career, we note he was appointed as an assistant professor at New York University in\n1966\n. This followed the recommendation which Louis Nirenberg made in a letter to Monroe Donsker in\n1965\n[\n12\n]\n:-\nI think very highly indeed of Varadhan and predict a great future for him. He is very young, and I think in many ways he might be the best appointment as assistant professor in probability we could make.\nVaradhan was promoted to associate professor in\n1968\nand became a full professor at New York University in\n1972\n.\nAlthough Varadhan's research has ranged widely over different areas of\nprobability theory\nwe single out two main streams of this research. His work in these two areas has been recognised in the citations for the major prizes which Varadhan has been awarded and we give brief details of these areas by quoting from the citations for these awards. In\n1996\nVaradhan won the\nAmerican Mathematical Society\n's Leroy P Steele Prize for fundamental contribution to research along with his collaborator Daniel Stroock. The citation reads\n[\n1\n]\n:-\nTo Daniel Stroock and Srinivasa Varadhan for their four papers 'Diffusion processes with continuous coefficients I and II'\n(1969)\n, 'On the support of diffusion processes with applications to the strong maximum principle\n(1970)\n, Multidimensional diffusion processes\n(1979)\n, in which they introduced the new concept of a martingale solution to a stochastic differential equation, enabling them to prove existence, uniqueness, and other important properties of solutions to equations which could not be treated before by purely analytic methods; their formulation has been widely used to prove convergence of various processes to diffusions.\nOn receiving the award Varadhan spoke about his colleagues and the environment at the\nCourant\nInstitute in the\n1960\ns\n[\n1\n]\n:-\nI am very pleased that my colleagues have chosen to single out some of my work with Dan Stroock in the late sixties as important. The\nCourant\nInstitute, where most of the work was done, provided us with an ideal intellectual environment. We had the active encouragement and support of our senior colleagues, particularly Louis Nirenberg and Monroe Donsker. With the presence of Henry McKean and\nMark Kac\nat Rockefeller, New York was indeed a very exciting place to be for an aspiring probabilist. Dan and I worked closely during this period, and to me it was very exciting and fruitful. I thank him, not just because he was a great person to work with, but for the years of close friendship as well. I am particularly pleased to be sharing this prize with him.\nThe second of the two areas of Varadhan's work which we single out is his remarkable contributions to the theory of large deviations. In\n2007\nhe was awarded the highly prestigious\nAbel\nPrize and the citation for that award gives some details of his work in this area\n[\n12\n]\n:-\nIn his landmark paper 'Asymptotic probabilities and differential equations' in\n1966\nand his surprising solution of the polaron problem of Euclidean quantum field theory in\n1969\n, Varadhan began to shape a general theory of large deviations that was much more than a quantitative improvement of convergence rates. It addresses a fundamental question: what is the qualitative behaviour of a stochastic system if it deviates from the ergodic behaviour predicted by some law of large numbers or if it arises as a small perturbation of a deterministic system? The key to the answer is a powerful variational principle that describes the unexpected behaviour in terms of a new probabilistic model minimizing a suitable entropy distance to the initial probability measure. In a series of joint papers with Monroe D Donsker exploring the hierarchy of large deviations in the context of Markov processes, Varadhan demonstrated the relevance and the power of this new approach. A striking application is their solution of a conjecture of\nMark Kac\nconcerning large time asymptotics of a tubular neighbourhood of the\nBrownian motion\npath, the so-called 'Wiener sausage'. Varadhan's theory of large deviations provides a unifying and efficient method for clarifying a rich variety of phenomena arising in complex stochastic systems, in fields as diverse as quantum field theory, statistical physics, population dynamics, econometrics and finance, and traffic engineering. It has also greatly expanded our ability to use computers to simulate and analyze the occurrence of rare events. Over the last four decades, the theory of large deviations has become a cornerstone of modern probability, both pure and applied.\nVaradhan has been honoured, in addition to the awards mentioned above, with his election to the\nAmerican Academy of Arts and Sciences\n(1988)\n, the Third World Academy of Sciences\n(1988)\n, and the\nNational Academy of Sciences\n(1995)\n. He was elected a Fellow of the Institute of Mathematical Statistics\n(1991)\n, and of the\nRoyal Society of London\n(1998)\n. In\n1994\nhe received the\nGeorge David Birkhoff\nPrize, jointly awarded by the\nAmerican Mathematical Society\nand the\nSociety for Industrial and Applied Mathematics\n:-\n... for important contributions to the\nmartingale\ncharacterization of diffusion processes, to the theory of large deviations for functionals of occupation times of\nMarkov\nprocesses, and to the study of random media ...\nand he received the Margaret and Herman Sokol Award of the Faculty of Arts and Sciences, New York University in\n1995\n.\nVaradhan is Frank J Gould Professor of Science and professor of mathematics at the\nCourant\nInstitute of Mathematical Sciences at New York University. He had served for two terms as director of the Institute, namely\n1980\n-\n84\nand\n1992\n-\n94\n. When Varadhan was awarded the\nAbel\nPrize in\n2007\n, the President of New York University John Sexton said\n[\n9\n]\n:-\nWe are so happy and proud of Raghu. Not only is he an outstanding scholar, he is also a kind and wonderful colleague, a devoted teacher, and an exemplary 'University citizen,' serving with dedication and professionalism as director of the\nCourant\nInstitute and on such bodies as the University Senate. This distinction is a well-deserved honour for a faculty member whose modesty and discretion are almost as great as his scholarly contributions. In the time that Raghu has been at NYU, our University has changed a great deal, but it is the persistent presence of scholars such as he that has enabled us to build NYU into what it is today and to continue to attract top scholars and researchers to our midst.\nIn\n2008\nVaradhan received the Padma award, given by India on the day that the people celebrated their\n59\nth\nRepublic Day. He was one of nine winners in the field of Literature and Education.\nLet us now say a little about some of the books written by Varadhan, many of which have been based on lecture notes of graduate courses he has given at the\nCourant\nInstitute. He published\nStochastic processes\n(1968)\nwhich was reviewed by J R Kinney whose begins his description as follows:-\nThese are lecture notes of a course on stochastic processes given at the\nCourant\nInstitute during\n1967\n-\n68\n. The author intends to give a survey rather than going into special details. ... This set of notes is a very readable survey of material available elsewhere only in very technical form.\nThe book\nMathematical statistics\n(1974)\n, was based on lectures given during the academic year\n1973\n-\n1974\n, but his monograph\n(\nwritten jointly with Daniel Stroock\n)\nMultidimensional diffusion processes\n(1979)\nwas one of the works for which he received the Leroy P Steele Prize. A D Wentzell begins a review as follows:-\nThe book is about the martingale approach to the theory of\nMarkov\nprocesses. The authors demonstrate this approach by treating carefully just one problem rather than showing the reader a great number of widely different examples. This one problem is the construction of diffusion processes for the widest possible class of coefficients along the lines initiated by the authors ...\nVaradhan's book\nLectures on diffusion problems and partial differential equations\n(1980)\nstarts from Brownian motion and leads the students to stochastic differential equations and diffusion theory. François Bronner, reviewing Varadhan's book\nLarge deviations and applications\n(1984)\n, explains that it:-\n... covers a great deal of material not treated anywhere else outside of journal articles. So it is of prime interest to read this text, written in a pleasant and clear style, by a master of the theory of large deviations. In a few pages one can find the setting of the problem, a survey of the fundamental applications including, for example, the Wentzell and Freodlin theory, and a very clearly presented construction of the lower and upper bounds in the\nMarkov\ncase.\nThe\n2001\nbook\nProbability theory\n(2001)\nwas based on a first year graduate course given from\n1996\nto\n1999\nat the\nCourant\nInstitute. The material presented in this highly successful book was continued in\nStochastic processes\n(2007)\n, also based on courses at the\nCourant\nInstitute.\nLet us now look at Varadhan's interests outside mathematics\n[\n10\n]\n:-\nI like to travel. I like the pleasure and experience of visiting new places, seeing new things and having new experiences. In our profession, you get the opportunity to travel, and I always take advantage of it. I like music, both classical Indian and a little bit of classical Western music. I like to go to concerts if I have time; I like the theatre, and New York is a wonderful place for theatre. I like to go to movies. I like reading Tamil literature, which I enjoy. Not many people in the world are familiar with Tamil as a language. It is a language which is\n2\n,\n000\nyears old, almost as old as Sanskrit. It is perhaps the only language which today is not very different from the way it was\n2\n,\n000\nyears ago. So, I can take a book of poetry written\n2\n,\n000\nyears ago, and I will still be able to read it. To the extent I can, I do that.\nWe end this biography by quoting from Daniel Stroock's\n1997\narticle\n[\n11\n]\n:-\nI am not going to claim that Varadhan does not enjoy his success; he does. Nor am I about to say that he is some sort of saint; we could never have become friends if he were. Nonetheless, what distinguishes Varadhan from nearly all the other gifted people whom I have met is the remarkable command he exercises over his own gift. In particular, he has learned how to prevent his unusual intellectual powers from poisoning his relations with lesser intellects. For example, Varadhan can tolerate being wrong, at least occasionally. In addition, he is not one of the many mathematical princes who espouse the notion that all their obligations to humanity can be met through their contributions to mathematical research.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Statistics",
    "Topology"
  ]
}