{
  "nome_completo": "Stanisław Leon Ruziewicz",
  "nome_curto": "Stanisław Leon Ruziewicz",
  "ano_nascimento": "1889",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ruziewicz/",
  "lugar_nascimento": "Kolomea, Galicia, Austrian Empire (now Kolomyia in Ukraine)",
  "lugar_morte": "Lwów, Poland (now Lviv Ukraine)",
  "biografia": "Stanisław Ruziewicz\nwas the son of Franciszek Ruziewicz and his wife Teresa Jasińska. Franciszek Ruziewicz, born in Bolechów, Galicia, in\n1853\n, was a craftsman and builder. Stanisław began his primary school education in\n1896\nand, when he reached the age of eleven in\n1990\n, he began his Gymnasium studies at the\n1\nst Gymnasium in Kołomyja. He quickly showed that he was extremely talented so after a year he transferred to the\n3\nrd Gymnasium in Lwów since this provided a higher quality of education. He attended the\n3\nrd Gymnasium in Lwów from\n1901\nto\n1904\nbut his father died when only\n50\nyears old leaving the family in severe financial difficulties. The only way that Stanisław could complete his secondary schooling was to return to the\n1\nst Gymnasium in Kołomyja and to earn money by giving private lessons. Back in Kołomyja he spent\n1904\n-\n1908\nat the Gymnasium and obtained his secondary school certificate with distinction in\n1908\n.\nGiven the financial position of his family, attending university was always going to be hard for Ruziewicz but he was prepared to earn money giving private lessons and live as cheaply as possible. He entered the Faculty of Philosophy of the University of Lwów in the autumn of\n1908\nwhere he specialised in mathematics. At the University of Lwów, Ruziewicz attended lectures by the professors\nJózef Puzyna\nand\nWacław Sierpiński\n. At this time\nSierpiński\nwas keen to build up a strong mathematics school in Lwów and he quickly saw that Ruziewicz was talented and encouraged him greatly. Ruziewicz worked towards a doctorate advised by\nPuzyna\nand in\n1912\npublished his first paper, namely\nO pewnym zagadnieniu dotyczącym funkcji przemiennych\nⓉ\n(\nOn a problem concerning commutative functions\n)\n. The paper begins as follows:-\nIn the article \"Principles of Iterative Calculus\"\n(1912)\nMr Ł Böttcher proves the theorem that two functions, which are iterations of one and the same third function, are commutative, and adds that the question whether the converse of this theorem is also valid remains open.\nI would like to answer this question negatively by giving a very simple example of two continuous, commutative functions which are not iterations of one and the same function.\nOn\n15\nOctober\n1913\nRuziewicz graduated with a doctorate having submitted the thesis\nO  funkcji  ciągłej,  monotonicznej,  nie  posiadającej  pochodnej  w  nieprzeliczalnej  mnogości  punktów\nⓉ\n(\nOn a continuous, monotonic function that has no derivative in an uncountable of points\n)\n.\nSierpiński\n's aim of building his school of mathematics was going well with\nStefan Mazurkiewicz\nbeing awarded has doctorate from Lwów in February\n1913\nand\nZygmunt Janiszewski\nhabilitated\nat the University of Lwów in\n1913\nhaving spent time abroad. Ruziewicz was also encouraged to study abroad and, with support from\nSierpiński\n, was awarded a scholarship by the Academy of Arts in Kraków which enabled him to go to Göttingen. He was thrilled to be in the group of talented mathematician gathered around\nFelix Klein\nand\nDavid Hilbert\n. But he could not be totally confident that he would be able to become a professor back in Poland so, while in Göttingen, as well as immersing himself in pure mathematics, he also attended\nFelix Bernstein\n's course on insurance mathematics thinking that this would look good if he had to seek employment in an insurance company.\nWorld War I broke out in July\n1914\nwhen Ruziewicz was enjoying his studies at Göttingen and making good progress towards an habilitation thesis. Germany and Austria were part of the Central Powers who opposed the Allies including France, Britain and Russia. Ruziewicz was in Galicia, a part of Poland controlled by Austria. In the early part of the war, Germany attacked France and Russia attacked Galicia. Ruziewicz returned to his homeland and continued to work on his habilitation thesis, but in June\n1915\n, he was conscripted into the Austrian army. In fact Lwów had been captured by the Russians in September\n1914\nbut retaken by the Austrians in June\n1915\n. Ruziewicz was assigned to the\n24\nth Infantry Regiment stationed in Dévaványa in Hungary. Never physically strong, he was quickly seen to be of more use to the army in a clerical role and he was sent to Lwów, now back in Austrian hands, to work in the letter censorship office. Małgorzata Przeniosło describes in\n[\n9\n]\nhow he suffered continuing illnesses during World War I:-\nDue to severe arthritis, in February\n1916\nhe was taken to the local Red Cross hospital in Lwów. After treatment in May he was transferred to Pöstyen\n(\npresent-day Piszczany in Slovakia\n)\n. Due to a recurrence of the disease, he stayed in several more hospitals, and at the end of\n1916\nhe was assigned to the staff of his regiment in Freudenthal\n[\npresent-day Bruntal in the Czech Republic\n]\n. Later, he performed clerical service in nearby Jägerndorf\n[\npresent-day Krnov in the Czech Republic\n]\n, interrupted by stays in hospitals. In January\n1918\n, he went to Bukovina with a review committee. After returning in February, he was assigned to the writers' reserve in Lobnitz\n[\npresent-day Wapienica, a district of Bielsko-Biała\n]\nand soon temporarily sent back to the letter censorship office in Lwów. He did not return to Lobnitz because of the epidemic of typhus there, and at the end of April he was given leave from the army\n(\nat the rank of sergeant\n)\nuntil the end of the year\n1918\n.\nReleased from the army in April\n1918\n, Ruziewicz was appointed as a mathematics teacher at a Gymnasium in Łańcut. He had actually completed his habilitation thesis\nO funkcyach ciągłych, monotonicznych, posiadających pantachiczne przedziały stałości\nⓉ\n(\nOn continuous, monotonic functions having pantachic intervals of constancy\n)\nbefore being conscripted into the army and it had been published in\n1916\nin\nPracy Matematyczno-Fizyczne\nbut he had not been able to carry out the habilitation process at that time. In July\n1918\n, however, he was able to go to Lwów.\nSierpiński\n, who had been in Russia when World War I started, had first been interned in Viatka but then allowed to spend the rest of the war years in Moscow working with\nLuzin\n. By July\n1918\nhe was back in Lwów and, with\nPuzyna\n, he led Ruziewicz's habilitation examination on\n3\nJuly\n1918\n. Ruziewicz was asked six questions and the committee unanimously agreed that he could proceed to give his habilitation lecture on\n6\nJuly. He delivered the lecture on set theory and its role in mathematics and it was unanimously agreed that he could become a\ndocent\nand lecture at the university.\nIn September\n1918\nRuziewicz took up a position as a substitute mathematics teacher at the\n8\nth Gymnasium in Lwów. Now the University of Lwów was going through a difficult time for mathematics since\nWacław Sierpiński\nand\nZygmunt Janiszewski\nboth left to take up positions in Warsaw while\nJózef Puzyna\nbecame ill and was unable to lecture. This left\nHugo Steinhaus\n, who was an assistant at the time, as the only mathematics lecturer left in Lwów. World War I ended with an armistice on\n11\nNovember\n1918\nbut German troops still occupied much of Poland. An uprising broke out in Poland with members of the Polish military fighting for an independent Poland. The Battle of Lwów took place from November\n1918\nto May\n1919\nas Polish troops fought for an independent Poland. Lwów was occupied by Ukrainian soldiers in November\n1918\nand fighting was fierce. It is believed that\n76\nstudents from the University of Lwów died in the fighting. Peace was restored in Lwów in May\n1919\nand in the following month the University of Lwów passed a resolution, called Memorial on Eastern Galicia, which demanded the inclusion of Eastern Galicia as part of a new independent Poland. Ruziewicz was one of the signatories of this resolution. The\n1919\n-\n20\nsession began in September\n1919\nwith lectures in Ukrainian being banned and any students who had fought on the Ukrainian side were banned. On\n22\nNovember\n1919\nthe university received the official name of the Jan Kazimierz University.\nThere were now two vacant mathematics chairs at the University and decisions had to be made about filling them. There were two talented mathematicians teaching there, namely Ruziewicz and\nSteinhaus\n, and they were considered as candidates. Ruziewicz, perhaps reasonably, was considered too inexperienced at this time but\nSteinhaus\n, although more experienced, was controversial. He had a Jewish background and the Jews of Lwów had mostly sided with the Ukrainians in the recent Battle of Lwów. Much argument ensued and appointing someone from outside the university was considered but eventually rejected. Ruziewicz and\nSteinhaus\nhad very different personalities and actually presented themselves as very different. Ruziewicz was rather shy while\nSteinhaus\nwas very much the extrovert. On\n1\nAugust\n1920\nSteinhaus\nwas appointed to the\n2\nnd Chair of Mathematics. Ruziewicz was showing that he was rapidly becoming more experienced having published two excellent papers:\nSur les fonctions qui ont la même dérivée et dont la différence n'est pas constante\nⓉ\n(\nOn functions that have a derivative and no difference is constant\n)\n(1920)\n; and\nO niestosowalności zasadniczego twierdzenia Rachunku całkowego do funkcyj, mających pochodne nieskończone\nⓉ\n(\nOn the inapplicability of the fundamental theorem of integral calculus to functions having infinite derivatives\n)\n(1920)\n. A new\n3\nrd Chair of Mathematics was established and Ruziewicz was appointed to that chair on\n1\nJanuary\n1921\n. In fact the opposition that\nSteinhaus\nsuffered actually helped Ruziewicz since those wishing to oppose\nSteinhaus\n's appointment, but had no valid argument to prevent his appointment, were happy to create a new chair for Ruziewicz.\nSteinhaus\nwrites in\n[\n13\n]\nabout these years in Lwów:-\nIt was\nJaniszewski\nwho had founded a mathematical society in Lwów, later to become a branch of the\nPolish Mathematical Society\n. Its earliest members were\nJaniszewski\n,\nKrygowski\n,\nŻyliński\n, Łomnicki,\nBanach\n, Ruziewicz, and I, with Dziwiński attending quite rarely. Our little mathematical society flourished. It did not take long for\nBanach\nand Ruziewicz to achieve their Habilitation. Although Lwów University was growing scientifically, nonetheless the dominant mood in the town was one of postwar social chaos and bedlam: frenzied dancing and playing games, tripping hither and thither, libertinism with the accompanying temporary liaisons and betrayals - in a word, the release of the steam of freedom that had been bottled up for years, the reward for the wartime years of oppression and greyness. All this was characteristic of the years\n1920\n-\n1923\n.\nSteinhaus\nhad brought\nStefan Banach\nto Lwów in\n1920\n. Although\nBanach\nwas an extraordinarily talented mathematician, his love for mathematics was in proving theorems but he had little interest in writing up his results for publication. He also had little interest in writing letters and when he received letters he seldom replied. Ruziewicz was one of\nBanach\n's colleagues who played an important role in finding ways to publish\nBanach\n's results. Ruziewicz had his assistant make notes when\nBanach\nwas explaining his latest results, then presented\nBanach\nwith a draft of a paper.\nBanach\nwas happy to see his results published and he would correct and improve the paper for publication, happy to find that he did not need to \"waste time\" doing what he considered the boring bits. Similarly, Ruziewicz helped in correspondence with\nSierpiński\nwho was the editor of\nFundamenta Mathematicae\nwhere he published his own papers and helped organise publication of\nBanach\n's papers.\nIn July\n1922\n, Ruziewicz married Teofila Zembrzuska. They had one son Zdzisław Ruziewicz\n(1925\n-\n1997)\nwho was born on\n13\nJune\n1925\nin Lwów. Zdzisław went on to study in Kraków and in Wrocław where he was awarded a doctorate in chemistry and later became a professor of Physical Chemistry at the University of Technology.\nRuziewicz continue to play an increasingly important role in the strong mathematical group which were now at the Jan Kazimierz University of Lwów. For example he published\nSur un ensemble non dénombrable de points, superposable avec les moitiés de sa partie aliquote\nⓉ\n(\nOn an uncountable set of points, superimposable with the halves of its aliquot part\n)\nin the second volume of\nFundamenta Mathematicae\nin\n1921\n. The Abstract reads:-\nThe aim of this note is to demonstrate the existence of an uncountable plane set, superimposable with two of its subsets which have no common points.\nIn the same journal he published\nUne application de l'équation fonctionnelle\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nf(x+ y)= f(x) + f(y)\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nà la décomposition de la droite en ensembles superposables, non mesurables\nⓉ\n(\nAn application of the functional equation f\n(\nx+ y\n)\n= f\n(\nx\n)\n+ f\n(\ny\n)\nto the decomposition of the line into superimposable, unmeasurable sets\n)\nin\n1924\n. The Abstract of this paper reads:-\nThe aim of this note is to prove a very simple property of the function\nf\n(\nx\n)\nf(x)\nf\n(\nx\n)\nsatisfying the functional equation:\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nf(x + y) = f(x) + f(y)\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\n, a property which will allow us to decompose the line into  𝓂 superimposable sets, everywhere dense, disjoint, non-measurable\n(\nL\n)\n, 𝓂 being any cardinal number, satisfying the inequalities\nℵ\n0\n≤\n\\aleph _{0}  ≤\nℵ\n0\n​\n≤\n𝓂\n≤\n2\nℵ\n0\n≤ 2^{\\aleph _{0}}\n≤\n2\nℵ\n0\n​\n.\nIn the\n1925\nVolume\n7\nof\nFundamenta Mathematicae\nRuziewicz published\nContribution à l'étude des ensembles de distances de points\nⓉ\n(\nContribution to the study of sets of distances of points\n)\nwith the Abstract:-\nThe purpose of this note is to answer the following question: Question: What is known about a linear set, such that no point equidistant between any two points of this set does not belong to it?\nHe also published in the journals\nWiadomości Matematyczne\nand\nPrzegląd Matematyczno-Fizyczny\nwith papers dealing with set theory, theory of functions of a real variable, and the theory of functional equations.\nRuziewicz's appointment to the\n3\nrd Chair of Mathematics did not make him a full professor and in November\n1923\nhe applied to the Ministry of Education for an appointment as a full professor at the Jan Kazimierz University of Lwów. His application was accepted and his new status took effect from\n1\nMarch\n1924\n.\nThe First Polish Mathematics Congress was held in Lwów\n7\n-\n10\nSeptember\n1927\n. Ruziewicz was a member of the Organising Committee of the Congress, chaired by\nSierpiński\n, and he was one of the four chairman of Section C: Set Theory and Functions of a Real Variable. The other three chairmen of Section C were\nBanach\n,\nKuratowski\nand\nSaks\n. Ruziewicz was also put on a committee to set up the Polish Society of Teachers of Mathematics. The Proceedings of the Congress contains the short paper\nOn functions satisfying the generalised Lipschitz condition\nby Ruziewicz which announced results that were to appear in two\n1928\npapers by Ruziewicz, namely\nSur les fonctions satisfaisant à la condition de Lipschitz généralisée\nⓉ\n(\nOn functions satisfying the generalised Lipschitz condition\n)\n(1928)\nand\nUn exemple d'une fonction continue croissante ayant presque partout la dérivée nulle\nⓉ\n(\nAn example of an increasing continuous function having almost everywhere the zero derivative\n)\n(1928)\n.\nAs a teacher, Ruziewicz always delivered carefully prepared lectures but, probably through shyness, did not interact much with his students. His students described him as patient and fair\n[\n9\n]\n:-\nRuziewicz mainly taught classes on introduction to mathematical analysis, theory of analytic functions, differential and integral calculus, differential equations, number theory and set theory.\nMark Kac\nbegan his studies at the University of Lwów in\n1931\nand describes in\n[\n6\n]\nattending a course given by Ruziewicz in his first year:-\nThe proseminar had already been in session for a number of weeks when Professor Stanisław Ruziewicz announced the start of his lectures on 'Introduction to Analysis and Differential and Integral Calculus'. I had been especially looking forward to this course because I wanted very badly to learn calculus, after having tried repeatedly and unsuccessfully to learn it by myself. The opening words of the first lecture came as a real shock. \"Gentlemen,\" said the professor, disregarding the female one third of the audience, \"I shall assume that you are familiar with the theory of\nDedekind\ncuts.\" He then proceeded to define the rather subtle concepts of the limit superior and limit inferior of a sequence of real numbers. ... Somehow I was supposed to know this stuff. I came from one of the best schools in Poland and one which emphasised mathematics and science. Yet the most advanced mathematics I had had was a smattering of analytical geometry. ... Ruziewicz himself conducted a once-a-week, two hour problem sessions connected with his course in Analysis I. Usually, problem sessions connected with courses were conducted by assistants but for some reason Analysis I was an exception during my first year. ... Ruziewicz was very shy and he seldom looked at the audience, which may explain his failure to notice women in his classes. He came in and, with hardly a word, wrote a problem on the blackboard and then sat down and waited for someone to volunteer to come to the blackboard and attempt a solution. At first the problems were quite easy and the number of volunteers was sufficient to move things along. But as they became increasingly tougher the number of volunteers dwindled and after a while I was the only one left who had the courage to go to the blackboard. ... A few more words about Ruziewicz. He was a solid, good mathematician and had a number of valuable contributions to his credit. He was not in the class of\nBanach\nor\nSteinhaus\nbut then, few were.\nFrom\n1926\n, Ruziewicz taught at the Lwów Polytechnic as well as at the University.\nEustachy Żyliński\nhad taught at the Jan Kazimierz University from\n1919\nand, in July\n1922\n, became a full professor there. He collaborated with Ruziewicz in writing textbooks and together they published, all in Polish:\nAlgebra: handbook for the higher classes of secondary schools\nPart\n1\n(1926)\n;\nAlgebra: handbook for the higher classes of secondary schools\nPart\n2\n(1926)\n;\nAlgebra: handbook for the higher classes of middle schools\n(1926)\n;\nIntroduction to Mathematics, Elements of Higher Algebra and Number Theory\nI\n(1927)\n; and\nAlgebra: handbook for the higher classes of secondary schools Part\n3\n(1928)\n.\nThe Polish Minister of Education, Janusz Jędrzejewicz, had convened a committee which advised on changes to the Polish education system. The Jędrzejewicz reform was approved for schools on\n11\nMarch\n1932\nand, on\n15\nMarch\n1933\n, the reform was extended to higher education. The reform which gave the state the right to close university chairs and to dismiss professors was highly controversial. In an attempt to pacify objections, the reform was amended so that a professor who lost their job because their chair was closed would have full salary for a year during which time they could be transferred to another chair if it became available. This did nothing to make to reform more acceptable and protests continued but were ignored. In total\n52\nchairs at Polish universities were closed by the state,\n13\nat the Jan Kazimierz University of Lwów and\n7\nat the Lwów Polytechnic. In response to being informed on\n1\nSeptember\n1933\nthat Ruziewicz's chair was to close the Council of the Faculty of Mathematics and Natural Sciences of the University wrote a strong letter to the Minister supporting Ruziewicz. The\n[\n9\n]\n:-\n... very extensive letter defended not only the chair by emphasising the world class achievements of Lwów mathematics and the losses that such closure would cause, but also Stanisław Ruziewicz himself. The Council pointed to his significant scientific and didactic achievements and important character traits of an academic teacher - modesty, diligence, personal culture and fairness towards colleagues and students.\nThe letter was ignored and on\n25\nSeptember\n1933\nRuziewicz's chair was closed. It was claimed that such closures were made for cost-saving reasons but that is hard to believe since someone had to be appointed to do the teaching while the professor continued to receive his salary for a year, and then received a pension. There had for some time been rumours that Ruziewicz held National Democrat beliefs, although there is no evidence that this was true.\nKac\n, who was Jewish, had been aware of the rumours and had been reluctant to ask Ruziewicz for a reference for a fellowship in\n1932\n. Ruziewicz had, however, written\nKac\nan amazingly good reference which got him the fellowship. Certainly Ruziewicz's colleagues believed that the real reason his chair was closed was because of the rumours - we will never know the truth of the rumour.\nAfter Ruziewicz's chair was closed, the Faculty Council continued to give Ruziewicz their strongest support writing many letters to the Minister asking that his chair be reinstated. He was, for a time, allowed to give a few lectures but on\n31\nMay\n1935\nhe was dismissed completely. He was only\n46\nyears old and, with only\n21\nyears of service, did not receive a good pension. From October\n1934\n, he gave commissioned lectures on financial mathematics at the private Higher School of Foreign Trade in Lwów, and in\n1936\nhe was appointed to a regular chair of applied mathematics there. His appointment led to increased prestige for the Higher School of Foreign Trade which changed its name to the Lwów Academy of Foreign Trade. Ruziewicz was elected rector of the Academy in\n1939\n.\nWorld War II began on\n1\nSeptember\n1939\nwhen Germany invaded Poland. Later that month Russian troops invaded Poland and took control of Lwów. The Lwów Academy of Foreign Trade was renamed the Lviv State Institute of Soviet Trade and although Ruziewicz did not retain the position of rector, he was appointed vice-rector with a Russian appointed as rector, and he did retain his chair of applied mathematics. On\n22\nJune\n1941\nGermany broke their non-aggression pact with Moscow and attacked the Soviet Union. On\n30\nJune\n1941\nGerman troops took control of Lviv and on\n3\n-\n4\nJuly they arrested academics at the University and the Polytechnic. Professors working at the Academy of Foreign Trade were not arrested at this time. At about\n5\np.m. on\n11\nJuly, however, a man in civilian clothes, speaking Polish, knocked on the door of Ruziewicz's apartment and announced that he was under arrest. He was led away and never seen again; it is widely believed that he was murdered on the day following his arrest. Ruziewicz's wife and son survived the war but never received any information regarding Ruziewicz's fate.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}