{
  "nome_completo": "Stefan Banach",
  "nome_curto": "Stefan Banach",
  "ano_nascimento": "1892",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Banach/",
  "lugar_nascimento": "Kraków, Austrian Empire (now Poland)",
  "lugar_morte": "Lwów, Poland (now Lviv, Ukraine)",
  "biografia": "Stefan Banach\n's father was Stefan Greczek. The first thing to notice is that Banach was not his father's surname, but Banach was given his father's first name. Stefan Greczek was a tax official who was not married to Banach's mother who vanished from the scene after Stefan was baptised, when he was only four days old, and nothing more is known of her. The name given as Stefan's mother on his birth certificate is Katarzyna Banach. She is thought by some to have been the servant of Stefan's mother, while others claim that she was a laundress who took care of Stefan when he was very young. In later life Banach tried to find out who his mother was but his father refused to say anything except that he had been sworn to secrecy over her identity.\nStefan Greczek was born in a small village called Ostrowsko, some\n50\nkm south of Kraków. It was to Ostrowsko, to his grandmother's home, that Banach was taken after his baptism. However, when Banach's grandmother took ill, Stefan Greczek arranged for his son to be brought up by Franciszka Plowa who lived in Kraków with her daughter Maria. Although Banach never went back to live with his grandmother, he did visit her frequently as he grew up. Maria's guardian was a French intellectual Juliusz Mien and he quickly recognised the talents that Banach had. Mien taught the young boy to speak French and in general gave him an appreciation for education.\nBanach attended primary school in Kraków, leaving the school in\n1902\nto begin his secondary education at the Henryk Sienkiewicz\nGymnasium\nNo\n4\nin Kraków. By a fortunate coincidence, one of the students in Banach's class was\nWitold Wilkosz\nwho himself went on to become a professor of mathematics. The school does not appear to have been a particularly good one and in\n1906\nWilkosz\nleft to move to a better Gymnasium. Banach, however, remained at Henryk Sienkiewicz Gymnasium No\n4\nalthough he maintained contact with\nWilkosz\n.\nDuring his first few years at the Gymnasium Banach achieved first class grades with mathematics and natural sciences being his best subjects. A fellow school pupil recalled Banach at this period in his life\n(\nsee\n[\n3\n]\n)\n:-\n[\nBanach\n]\nwas pleasant in dealings with his colleagues, but outside of mathematics he was not interested in anything. If he spoke at all, he would speak very rapidly, as rapidly as he thought mathematically. ...\nWilkosz\nwas a similar phenomenon. Between the two of them there was no mathematical problem that they could not speedily tackle. Also, while Banach was faster in mathematical problems,\nWilkosz\nwas phenomenally fast in solving problems in physics, which were of no interest to Banach.\nThe excellent grades of his early years gave way to poorer grades as he approached his final school examination. He passed this examination in\n1910\nbut he failed to achieve a pass with distinction, an honour which went to about one quarter of the students. On leaving school Banach and\nWilkosz\nboth wanted to study mathematics, but both felt that nothing new could be discovered in mathematics so each chose to work in a subject other than mathematics. Banach chose to study engineering,\nWilkosz\nchose oriental languages. That two such outstanding future mathematicians could make a decision for this reason must mean that there was nobody to properly advise them.\nBanach's father had never given his son much support, but now once he left school he quite openly told Banach that he was now on his own. Banach left Kraków and went to Lemberg\n(\nnow Lviv in Ukraine\n)\nwhere he enrolled in the Faculty of Engineering at Lemberg Technical University. It is almost certain that Banach, without any financial support, had to support himself by tutoring. This must have occupied quite a lot of his time and when he graduated in\n1914\nhe had taken longer to complete the course than was normal. He had returned to Kraków frequently during the period of his studies in Lemberg from\n1910\nto\n1914\n. It is not entirely clear what Banach's plans were in\n1914\nbut the outbreak of World War I in August, shortly after his graduation, saw Banach leave Lemberg.\nLemberg was, at the time Banach studied there, under Austrian control as it had been from the partition of Poland in\n1772\n. In Banach's youth Poland, in some sense, did not exist and Russia controlled much of the country. Warsaw only had a Russian language university and was situated in what was named \"Vistula Land\". With the outbreak of World War I, the Russian troops occupied the city of Lemberg. Banach was not physically fit for army service, having poor vision in his left eye. During the war he worked building roads but also spent time in Kraków where he earned money by teaching in the local schools. He also attended mathematics lectures at the Jagiellonian University in Kraków and, although this is not completely certain, it is believed that he attended\nZaremba\n's lectures.\nA chance event occurred in the spring of\n1916\nwhich was to have a major impact on Banach's life.\nSteinhaus\n, who had been undertaking military service, was about to take up a post at the Jan Kazimierz University in Lemberg. However he was living in Kraków in the spring of\n1916\n, waiting to take up the appointment. He would walk through the streets of Kraków in the evenings and, as he related in his memoirs:-\nDuring one such walk I overheard the words \"\nLebesgue\nmeasure\". I approached the park bench and introduced myself to the two young apprentices of mathematics. They told me they had another companion by the name of\nWitold Wilkosz\n, whom they extravagantly praised. The youngsters were Stefan Banach and\nOtto Nikodym\n. From then on we would meet on a regular basis, and ... we decided to establish a mathematical society.\nSteinhaus\ntold Banach of a problem which he was working on without success. After a few days Banach had the main idea for the required counterexample and\nSteinhaus\nand Banach wrote a joint paper, which they presented to Zaremba for publication. The war delayed publication but the paper, Banach's first, appeared in the\nBulletin of the Kraków Academy\nin\n1918\n. From the time that he produced these first results with\nSteinhaus\n, Banach started to produce important mathematics papers at a rapid rate. Of course it is impossible to say whether, without the chance meeting with\nSteinhaus\n, Banach would have followed the route of research in mathematics. It was also through\nSteinhaus\nthat Banach met his future wife Lucja Braus. They were married in the mountain resort of Zakopane in\n1920\n.\nOn\nSteinhaus\n's initiative, the\nMathematical Society of Kraków\nwas set up in\n1919\n.\nZaremba\nchaired the inaugural meeting and was elected as the first President of the Society. Banach lectured to the Society twice during\n1919\nand continued to produce top quality research papers. The\nMathematical Society of Kraków\nwent on to became the\nPolish Mathematical Society\nin\n1920\n.\nBanach was offered an assistantship to Lomnicki at Lwów Technical University\n(\nin what is now Lviv in Ukraine\n)\nin\n1920\n. He lectured there in mathematics and submitted a dissertation for his doctorate under Lomnicki's supervision. This was, of course, not the standard route to a doctorate, for Banach had no university mathematics qualifications. However, an exception was made to allow him to submit\nOn Operations on Abstract Sets and their Application to\nIntegral Equations\n. This thesis\n[\n1\n]\n:-\n... is sometimes said to mark the birth of\nfunctional analysis\n.\nIn\n1922\nthe Jan Kazimierz University in Lwów awarded Banach his\nhabilitation\nfor a thesis on\nmeasure theory\n. The University Calendar for\n1921\n-\n22\nreports\n[\n3\n]\n:-\nOn\n7\nApril\n1922\n, by resolution of the Faculty Council, Dr Stefan Banach received his habilitation for a\nDocent\nof Mathematics degree. He was appointed Professor Extraordinary of that subject by decree of the Head of State issued on\n22\nJuly\n1922\n.\nIn\n1924\nBanach was promoted to full professor and he spent the academic year\n1924\n-\n25\nin Paris. The years between the wars were extremely busy one for Banach. As well as continuing to produce a stream of important papers, he wrote arithmetic, geometry and algebra texts for high schools. He also was very much involved with the publication of mathematics. In\n1929\n, together with\nSteinhaus\n, he started a new journal\nStudia Mathematica\nand Banach and\nSteinhaus\nbecame the first editors. The editorial policy was:-\n... to focus on research in functional analysis and related topics.\nAnother important publishing venture, begun in\n1931\n, was a new series of\nMathematical Monographs\n. These were set up under the editorship of Banach and\nSteinhaus\nfrom Lwów and\nKnaster\n,\nKuratowski\n,\nMazurkiewicz\n, and\nSierpiński\nfrom Warsaw. The first volume in the series\nThéorie des Opérations linéaires\nⓉ\n(\nTheory of linear operations\n)\nwas written by Banach and appeared in\n1932\n. It was a French version of a volume he originally published in Polish in\n1931\nand quickly became a classic. In\n1936\nBanach gave a plenary address at the International Congress of Mathematicians in Oslo. In this address he described the work of the whole of the Lwów school, and he also spoke of the plans which they had to develop their ideas further.\nAnother important influence on Banach was the fact that\nKuratowski\nwas appointed to the Lwów Technical University in\n1927\nand worked there until\n1934\n. Banach collaborated with\nKuratowski\nand they wrote some joint papers during this period.\nThe way that Banach worked was unconventional. He liked to do mathematical with his colleagues in the cafés of Lwów.\nUlam\nrecalls in\n[\n4\n]\nfrequent sessions in the Scottish Café:-\nIt was difficult to outlast or outdrink Banach during these sessions. We discussed problems proposed right there, often with no solution evident even after several hours of thinking. The next day Banach was likely to appear with several small sheets of paper containing outlines of proofs he had completed.\nYou can see a picture of the Scottish Café at\nTHIS LINK\n.\nAndrzej Turowicz\n, also a professor of mathematics at the Kazimierz University in Lwów, also described Banach's style of working\n(\nsee\n[\n3\n]\n)\n:-\n[\nBanach\n]\nwould spend most of his days in cafés, not only in the company of others but also by himself. He liked the noise and the music. They did not prevent him from concentrating and thinking. There were cases when, after the cafés closed for the night, he would walk over to the railway station where the cafeteria was open around the clock. There, over a glass of beer, he would think about his problems.\nIn\n1939\n, just before the start of World War II, Banach was elected as President of the\nPolish Mathematical Society\n. At the beginning of the war Soviet troops occupied Lwów. Banach had been on good terms with the Soviet mathematicians before the war started, visiting Moscow several times, and he was treated well by the new Soviet administration. He was allowed to continue to hold his chair at the university and he became the Dean of the Faculty of Science at the university, now renamed the Ivan Franko University. Banach's father came to Lwów fleeing from the German armies advancing towards Kraków. Life at this stage was little changed for Banach who continued his research, his textbook writing, lecturing and sessions in the cafés.\nSobolev\nand\nAleksandrov\nvisited Banach in Lwów in\n1940\n, while Banach attended conferences in the Soviet Union. He was in Kiev when Germany invaded the Soviet Union and he returned immediately to his family in Lwów.\nThe Nazi occupation of Lwów in June\n1941\nmeant that Banach lived under very difficult conditions. He was arrested under suspicion of trafficking in German currency but released after a few weeks. He survived a period when Polish academics were murdered, his doctoral supervisor Lomnicki dying on the tragic night of\n3\nJuly\n1941\nwhen many massacres occurred. Towards the end of\n1941\nBanach worked feeding lice in German institute dealing with infectious diseases. Feeding lice was to be his life during the remainder of the Nazi occupation of Lwów up to July\n1944\n. As soon as the Soviet troops retook Lwów Banach renewed his contacts. He met\nSobolev\noutside Moscow but clearly he was by this time seriously ill.\nSobolev\n, giving an address at a memorial conference for Banach, said of this meeting\n(\nsee for example\n[\n3\n]\n)\n:-\nDespite heavy traces of the war years under German occupation, and despite the grave illness that was undercutting his strength, Banach's eyes were still lively. He remained the same sociable, cheerful, and extraordinarily well-meaning and charming Stefan Banach whom I had seen in Lwów before the war. That is how he remains in my memory: with a great sense of humour, an energetic human being, a beautiful soul, and a great talent.\nBanach planned to go to Kraków after the war to take up the chair of mathematics at the Jagiellonian University but he died in Lwów in\n1945\nof lung cancer.\nBanach founded modern functional analysis and made major contributions to the theory of\ntopological\nvector spaces. In addition, he contributed to measure theory, integration, the theory of sets, and orthogonal series.\nIn his dissertation, written in\n1920\n, he defined axiomatically what today is called a Banach space. The idea was introduced by others at about the same time, for example\nWiener\nintroduced the notion but did not develop the theory. The name 'Banach space' was coined by\nFréchet\n. Banach algebras were also named after him.\nA Banach space is a real or complex normed vector space that is complete as a metric space under the metric\nd\n(\nx\n,\ny\n)\n=\n∣\n∣\nx\n−\ny\n∣\n∣\nd(x, y) = ||x-y||\nd\n(\nx\n,\ny\n)\n=\n∣\n∣\nx\n−\ny\n∣\n∣\ninduced by the norm. The completeness is important as this means that\nCauchy\nsequences in Banach spaces converge.\nA Banach algebra is a Banach space where the norm satisfies\n∣\n∣\nx\ny\n∣\n∣\n≤\n∣\n∣\nx\n∣\n∣\n.\n∣\n∣\ny\n∣\n∣\n||xy|| ≤ ||x||.||y||\n∣\n∣\nx\ny\n∣\n∣\n≤\n∣\n∣\nx\n∣\n∣\n.\n∣\n∣\ny\n∣\n∣\nThe importance of Banach's contribution is that he developed a systematic theory of functional analysis, where before there had only been isolated results which were later seen to fit into the new theory. The theory generalised the contributions made by\nVolterra\n,\nFredholm\nand\nHilbert\non integral equations.\nBanach proved a number of fundamental results on normed linear spaces, and many important theorems are today named after him. There is the\nHahn\n-Banach theorem on the extension of continuous linear functionals, the Banach-\nSteinhaus\ntheorem on bounded families of mappings, the Banach-Alaoglu theorem, the Banach fixed point theorem and the Banach-\nTarski\nparadoxical decomposition of a ball.\nThe Banach-\nTarski\nparadox appeared in a joint paper of the two mathematicians in\n1926\nin\nFundamenta Mathematicae\nentitled\nSur la décomposition des ensembles de points en parties respectivement congruent\nⓉ\n(\nOn the decomposition of sets of points in respectively congruent parts\n)\n. The puzzling paradox shows that a ball can be divided up into subsets which can be fitted together to make two balls each identical to the first. The\naxiom of choice\nis needed to define the decomposition and the fact that it is able to give such a non-intuitive result has made some mathematicians question the use of the axiom. The Banach-Tarski paradox was a major contribution to the work being done on axiomatic set theory around this period.\nBanach's open mapping of\n1929\nalso uses set-theoretic concepts, this time concepts introduced by\nBaire\nin his\n1899\ndissertation.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}