{
  "nome_completo": "Stephen William Hawking",
  "nome_curto": "Stephen Hawking",
  "ano_nascimento": "1942",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hawking/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Stephen Hawking\n's parents lived in London where his father was undertaking research into medicine. However, London was a dangerous place during World War II and Stephen's mother was sent to the safer town of Oxford where Stephen was born. The family were soon back together living in Highgate, north London, where Stephen began his schooling.\nIn\n1950\nStephen's father moved to the Institute for Medical Research in Mill Hill. The family moved to St Albans so that the journey to Mill Hill was easier. Stephen attended St Albans High School for Girls\n(\nwhich took boys up to the age of\n10)\n. When he was older he attended St Albans school but his father wanted him to take the scholarship examination to go to Westminster public school. However Stephen was ill at the time of the examinations and remained at St Albans school which he had attended from the age of\n11\n. Stephen writes in\n[\n2\n]\n:-\nI got an education there that was as good as, if not better than, that I would have had at Westminster. I have never found that my lack of social graces has been a hindrance.\nHawking wanted to specialise in mathematics in his last couple of years at school where his mathematics teacher had inspired him to study the subject. However Hawking's father was strongly against the idea and Hawking was persuaded to make chemistry his main school subject. Part of his father's reasoning was that he wanted Hawking to go to University College, Oxford, the College he himself had attended, and that College had no mathematics fellow.\nIn March\n1959\nHawking took the scholarship examinations with the aim of studying natural sciences at Oxford. He was awarded an exhibition, despite feeling that he had performed badly, and at University College he specialised in physics in his natural sciences degree. He only just made a First Class degree in\n1962\nand in\n[\n1\n]\nhe explains how the attitude of the time worked against him:-\nThe prevailing attitude at Oxford at that time was very anti-work. You were supposed to be brilliant without effort, or accept your limitations and get a fourth-class degree. To work hard to get a better class of degree was regarded as the mark of a grey man - the worst epithet in the Oxford vocabulary.\nFrom Oxford, Hawking moved to Cambridge to take up research in general relativity and\ncosmology\n, a difficult area for someone with only a little mathematical background. Hawking had noticed that he was becoming rather clumsy during his last year at Oxford and, when he returned home for Christmas\n1962\nat the end of his first term at Cambridge, his mother persuaded him to see a doctor.\nIn early\n1963\nhe spent two weeks having tests in hospital and motor neurone disease\n(\nLou Gehrig's disease\n)\nwas diagnosed. His condition deteriorated quickly and the doctors predicted that he would not live long enough to complete his doctorate. However Hawking writes:-\n... although there was a cloud hanging over my future, I found to my surprise that I was enjoying life in the present more than I had before. I began to make progress with my research...\nThe reason that his research progressed was that he met a girl he wanted to marry and realised he had to complete his doctorate to get a job so:-\n... I therefore started working for the first time in my life. To my surprise I found I liked it.\nAfter completing his doctorate in\n1966\nHawking was awarded a fellowship at Gonville and Caius College, Cambridge. At first his position was that of Research Fellow, but later he became a Professorial Fellow at Gonville and Caius College. In\n1973\nhe left the Institute of Astronomy and joined to the Department of Applied Mathematics and Theoretical Physics at Cambridge. He became Professor of Gravitational Physics at Cambridge in\n1977\n. In\n1979\nHawking was appointed Lucasian Professor of Mathematics at Cambridge. The man born\n300\nyears to the day after\nGalileo\ndied now held\nNewton\n's chair at Cambridge.\nBetween\n1965\nand\n1970\nHawking worked on singularities in the theory of general relativity devising new mathematical techniques to study this area of cosmology. Much of his work in this area was done in collaboration with\nRoger Penrose\nwho, at that time, was at Birkbeck College, London. From\n1970\nHawking began to apply his previous ideas to the study of black holes.\nContinuing this work on black holes, Hawking discovered in\n1970\na remarkable property. Using\nquantum theory\nand general relativity he was able to show that black holes can emit radiation. His success with proving this made him work from that time on combining the theory of general relativity with quantum theory. In\n1971\nHawking investigated the creation of the Universe and predicted that, following the big bang, many objects as heavy as\n1\n0\n9\n10^{9}\n1\n0\n9\ntons but only the size of a proton would be created. These mini black holes have large gravitational attraction governed by general relativity, while the laws of quantum mechanics would apply to objects that small.\nAnother remarkable achievement of Hawking's using these techniques was his \"no boundary proposal\" made in\n1983\nwith Jim Hartle of Santa Barbara. Hawking explains that this would mean:-\n... that both time and space are finite in extent, but they don't have any boundary or edge. ... there would be no singularities, and the laws of science would hold everywhere, including at the beginning of the universe.\nIn\n1982\nHawking decided to write a popular book on cosmology. By\n1984\nhe had produced a first draft of\nA Brief History of Time\n. However Hawking was to suffer a further illness:-\nI was in Geneva, at CERN, the big particle accelerator, in the summer of\n1985\n. ... I caught pneumonia and was rushed to hospital. The hospital in Geneva suggested to my wife that it was not worth keeping the life support machine on. But she was having none of that. I was flown back to Addenbrooke's Hospital in Cambridge, where a surgeon called Roger Grey carried out a tracheotomy. That operation saved my life but took away my voice.\nHawking was given a computer system to enable him to have an electronic voice. It was with these difficulties that he revised the draft of\nA Brief History of Time\nwhich was published in\n1988\n. The book broke sales records in a way that it would have been hard to predict. By May\n1995\nit had been in\nThe Sunday Times\nbest-sellers list for\n237\nweeks breaking the previous record of\n184\nweeks. This feat is recorded in the\n1998\nGuinness Book of Records\n. Also recorded there is the fact that the paperback edition was published on\n6\nApril\n1995\nand reached number one in the best sellers in\n3\ndays. By April\n1993\nthere had been\n40\nhardback editions of\nA Brief History of Time\nin the United States and\n39\nhardback editions in the UK.\nIn\n2002\nHawking published\nOn the shoulders of giants. The great works of physics and astronomy\n. This book, which he edited, contains reprints of nearly complete editions of:\nCopernicus\n,\nOn the revolution of the heavenly spheres\n(1543)\n;\nGalileo\n,\nDialogues concerning two new sciences\n(1638)\n;\nKepler\n,\nHarmony of the world\n(\nBook Five\n)\n(1618)\n;\nNewton\n,\nPrincipia\n(1687)\n; and seven papers on relativity by\nEinstein\n. Each work is prefaced with a commentary by Hawking. Also from\n7\nto\n10\nJanuary\n2002\na workshop and symposium was held in Cambridge to celebrate Hawking's\n60\nth\nbirthday. The Proceeding was published in\n2003\nand James T Liu writes in a review:-\nWhile many prominent physicists, cosmologists and astronomers have made important contributions to the study of quantum gravity and cosmology, the impact of Stephen Hawking's contributions to the field truly stand out. Although his work on black hole thermodynamics is perhaps the most well known, Hawking has also made major contributions to the study of singularity theorems in general relativity, black hole uniqueness, quantum fields in curved spacetimes, Euclidean quantum gravity, the wave function of the universe and many other areas as well. In addition to his own work, Hawking has served as advisor and mentor to a remarkable set of students. Furthermore, it would be hard to imagine assembling any list of researchers working in quantum cosmology without including a large number of Hawking's students and close colleagues. Thus the group that gathered at the CMS in Cambridge in honour of his\n60\nth\nbirthday includes some of the leading theorists in the field.\nIn\n2005\nHawking published\nInformation loss in black holes\nin which he proposed a solution to the information loss paradox. In the same year\nBlack holes and the information paradox\nwas published, being the transcript of the famous talk Hawking gave at the\n17\nth\nInternational Conference on General Relativity and Gravitation in Dublin in\n2004\n. In\n2007\nhe published\nGod created the integers. The mathematical breakthroughs that changed history\n. This is another anthology edited by Hawking containing selections from the writings of twenty-one mathematicians. For each mathematician he gives a brief biography and puts the selection into its mathematical context.\nOf course Hawking has received, and continues to receive, a large number of honours for his remarkable achievements. He was elected a Fellow of the\nRoyal Society\nin\n1974\n, being one of its youngest fellows. In\n1975\nhe was awarded the\nEddington\nMedal, in\n1976\nreceived the Hughes Medal from the\nRoyal Society\n, in\n1979\nhe was awarded the\nAlbert Einstein\nMedal, in\n1982\nbe was made a Commander of the British Empire by the Queen, in\n1985\nhe received the Gold Medal of the Royal Astronomical Society, and in\n1986\nhe was elected a Member of the\nPontifical Academy of Sciences\n. He continued to receive major honours such as the prestigious Wolf Prize in Physics in\n1988\n. In the following year he received the Prince of Asturias Awards in Concord and also was made a Companion of Honour. In\n1999\nhe received the Julius Edgar Lilienfeld Prize of the American Physical Society:-\n... for boldness and creativity in gravitational physics, best illustrated by the prediction that black holes should emit black body radiation and evaporate, and for the special gift of making abstract ideas accessible and exciting to experts, generalists, and the public alike.\nIn\n2003\nHawking was awarded the Michelson Morley Award of Case Western Reserve University and in\n2006\nthe Copley Medal of the\nRoyal Society\n. This last award, announced on\n24\nAugust\n2006\n, was presented to Hawking on the\n30\nNovember\n2006\nat the Society's annual Anniversary Day, commemorating the foundation of the Society in\n1660\n. This was the\n275\nth\nanniversary of the Copley Medal and the award to Hawking was marked in a unique way. The medal he received had been carried by the British astronaut Piers Sellers on a Space Shuttle mission to the International Space Station. Martin Rees, President of the Royal Society, said:-\nStephen Hawking has contributed as much as anyone since\nEinstein\nto our understanding of gravity. This medal is a fitting recognition of an astonishing research career spanning more than\n40\nyears.\nPiers Sellers said:-\nStephen Hawking is a definitive hero to all of us involved in exploring the Cosmos. His contribution to science is unique and he serves as a continuous inspiration to every thinking person. It was an honour for the crew of the STS-\n121\nmission to fly his medal into space. We think that this is particularly appropriate as Stephen has dedicated his life to thinking about the larger Universe.\nIn reply Hawking said:-\nThis is a very distinguished medal. It was awarded to Darwin,\nEinstein\nand Crick.  I am honoured to be in their company.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}