{
  "nome_completo": "Subbaramiah Minakshisundaram",
  "nome_curto": "Subbaramiah Minakshisundaram",
  "ano_nascimento": "1913",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Minakshisundaram/",
  "lugar_nascimento": "Trichur (now Trissur), Kerala State, India",
  "lugar_morte": "Visakhapatnam, Andhra Pradesh, India",
  "biografia": "Subbaramiah Minakshisundaram\nwas known as Minakshi by his colleagues and friends. He was called Jeja by his parents, Jeja meaning God, but we chose to use the name Minakshi throughout this biography. His father, from Salem, had a British Raj Government job as a sanitary engineer. His mother married by the age of eight years as a child but her first child, Minakshi the subject of this biography, was not born until she was\n24\nyears old. Minakshi had two younger brothers. His first years were spent in Kerala where he learnt the Malayalam language but the family moved to Madras\n(\nnow Chennai\n)\nbecause of his father's job. From that time the family spoke Tamil.\nMinakshi entered the Calavala Ramanujam Chetty High School in Perambur, Madras in\n1919\n. His two younger brothers, however, attended the Ramakrishna Mutt School, Mambalam, Madras. Minakshi continued his education at the C R C High School, graduating with the Secondary School Leaving Certificate in\n1929\n. At the High School\n[\n2\n]\n:-\n... he had constantly topped in mathematics having shown a marked aptitude for it.\nAfter graduating from the High School, Minakshi attended Pachaiyappa's College, Madras. To read about his time there, and about other events in his life, see\nTHIS LINK\n.\nThis following description by his daughter of his bad start at the College sounds somewhat exaggerated but must contain some truth\n[\n4\n]\n:-\nI remember my father once narrated that his first exam in class I he failed. He obtained zero in mathematics. In the following academic year, innocent child that he was, he went and sat in class II room. The teacher drove him away saying he failed and should go back to class I. The shock and realization was such that from then on he always topped the class. His special attention and effort in mathematics was outstanding. In the British Raj, educational standards were high, especially English which in those days was really tough. My father struggled in the Intermediate level for English. He overcame the difficulties and, of course, his English was excellent and meticulous.\nAfter the Intermediate at Pachaiyappa's College, in\n1931\nMinakshi entered Loyola College, Madras, to study for a B.A.\n(\nHons\n)\nin mathematics. This College had an excellent reputation for producing First Class students in the Madras University examinations and, indeed, Minakshi was awarded First Class honours in mathematics in\n1934\n. He did not want to stop his studies of mathematics at undergraduate level so he began research at Madras University while he earned a little working in the library of the University\n[\n9\n]\n:-\nUnlike many brilliant young men of that time Minakshi desired to study mathematics more deeply and to take it as a career instead of going in for the administrative service which was more lucrative and prestigious. He was initially influenced by Professor K Ananda Rau, and as a research scholar at Madras University, began studying deeply the problems of summability of series. His passion for summability never left him and significantly his first and last papers have been on problems of summability.\nThis first paper was\nTauberian theorems on Dirichlet's series\n(1936)\n. In this paper he generalised a theorem first proved by his advisor Ananda Rau but his result not only generalised Rau's theorem but also improved it by removing some of Rau's restrictions. He followed this with two papers in\n1937\n, namely\nOn the extension of a theorem of Caratheodory in the theory of Fourier series\n, and\nThe Fourier series of a sequence of functions\n. This was around the time that Minakshi was influenced by Father Charles Racine\n(1897\n-\n1976)\n. Racine was born in Tomay-Charente in France, entered the Society of Jesus on\n25\nOctober\n1919\nand was ordained as a priest on\n25\nAugust\n1929\n. After the award of a doctorate in mathematics in\n1934\nfrom the University of Paris, he went to India and worked at St Joseph's College, Trichy, until he became the Head of the Department of Mathematics in Loyola College, Chennai in\n1939\n. Kollagunta Gopalaiyer Ramanathan\n(1920\n-\n1992)\nwrites in\n[\n9\n]\n:-\nIn\n1937\n-\n38\nFr Charles Racine, who had just come to India from Paris, having been trained in the famous French School in analysis, was invited by the Madras University to give a course of 'Extension lectures'. Fr Racine lectured on non-linear partial differential equations and especially on the work of Georges Giraud\n(1889\n-\n1943)\nand Maurice Gevrey\n(1884\n-\n1957)\n. At about the same time Minakshi met Professor Muhammad Raziuddin Siddiqui\n(1908\n-\n1998)\nof the Osmania University, Hyderabad, who had studied with\nLeon Lichtenstein\nin Berlin and had written a thesis on non-linear parabolic and hyperbolic equations.\nMinakshi married Smt M Parvathi on\n10\nMay\n1937\n. She was born in\n1924\n, so was only thirteen years old. They had three children, a son K Ramu\n(\nborn\n1943)\n, a daughter K Girija\n(\nborn\n1945)\n, and a second daughter K Radha.\nObtaining a university position was not easy and you can read about the difficult start to Minakshi's career at\nTHIS LINK\n.\nThe difficult start was, however, worth the wait for in\n1943\nhe was appointed as a Lecturer in the Department of Mathematical Physics of Andhra University. This Department, established in\n1942\n, only a year before Minakshi joined it, was the first in South India to start post graduate and research programmes in Applied Mathematics. It was renamed the Department of Applied Mathematics in\n1966\n.\nAlso in\n1943\nhe became a member of the\nIndian Mathematical Society\n. His publication record was outstanding with three papers being published in\n1942\nand five in\n1943\n. The event which was so important in Minakshi's development as a mathematician was an invitation to the Institute for Advanced Study, Princeton, USA. Minakshi's daughter writes\n[\n4\n]\n:-\nThe Vice Chancellor\n[\nof Andhra University\n]\n, in those days, was a distinguished personality who inculcated and inspired the faculty. Cattamanchi Ramalinga Reddy\n(1880\n-\n1951)\n, an eminent Academician was unaware of the young mathematician in his faculty. He received a letter from the Princeton Institute for Advanced Study in\n1945\n. The letter mentioned that Professor Robert Oppenheimer, Director of the Institute, requested to the Vice Chancellor of Andhra University that this brilliant young Subbramiah Minakshisundaram should be spared and given the opportunity to work in the Research Institute with several eminent mathematicians and physicists such as Professor\nAlbert Einstein\n. Subbramiah Minakshisundaram should be permitted to work at the Institute for Advanced Study for couple of years. C R Reddy was amazed. He did not know who this brilliant young mathematician was. He called for the young Subbramiah Minakshisundaram and this began a beautiful relationship between them. Naturally with great pride C R Reddy helped my father's journey to the United States under the British Raj. My father went to the United States as a British Indian citizen. When he returned in\n1948\n, India was a free Republic.\nMinakshi was at the Institute for Advanced Study from December\n1946\nto May\n1948\n.\nÅke Pleijel\n, a Swedish mathematician who was almost exactly the same age as Minakshi, arrived at the Institute in September\n1947\n.\nPleijel\nand Minakshi collaborated on writing the paper\nSome properties of the eigenfunctions of the Laplace-operator on Riemannian manifolds\n(1949)\n.\nSalomon Bochner\nwrites in a review:-\nThis paper offers an extension of a method of\nCarleman\n's from a Euclidean to a curvilinear setup, and the results of\nCarleman\nhave been both generalized and added to; an important tool of investigation is\nHilbert\n's parametrix.\nIn fact, the paper contains the famous zeta function, now called the Minakshisundaram-\nPleijel\nzeta function, which is a zeta function encoding the eigenvalues of the Laplacian of a compact Riemannian manifold.\nAnother important contact which he made while at the Institute for Advanced Study was\nCarl Ludwig Siegel\n.\nMinakshi was promoted to a Reader in the Department of Mathematical Physics of Andhra University in\n1946\nso when he returned from the United States it was to the readership position. He was back in the United States in\n1950\nwhen he was invited to the Symposium on Spectral Theory and Differential Problems held at the Oklahoma Agricultural and Mathematical College in Stillwater, Oklahoma. He delivered the lecture\nExpansion in eigen-functions of the membrane problem\nand this was published in the\nProceedings\nof the Symposium. While he was in the United States he attended the International Congress of Mathematicians held in Cambridge, Massachusetts, from\n30\nAugust to\n6\nSeptember\n1950\n. He was a member of the Institute for Advanced Study during August and September and renewed his contact with\nCarl Ludwig Siegel\n.\nIn\n1950\nMinakshi became a professor in the Department of Mathematical Physics of Andhra University. In the same year the head of the Department, A Narsinga Rao, retired; he had held this position for four years. In\n1951\nMinakshi was appointed as Head of the Department of Mathematical Physics and, in the same year, he participated in a summer seminar organized at the Tata Institute of Fundamental Research, Bombay. He was invited there by Komaravolu Chandrasekharan\n(1920\n-\n2017)\nwho transformed the School of Mathematics of Tata Institute of Fundamental Research into a world class centre of excellence. This visit led to a collaboration between Minakshi and Chandrasekharan and they co-authored the book\nTypical Means\nwhich was published by Oxford University Press in\n1952\n. They write in the Preface:-\nThis book deals with the theory of 'typical means' and its applications to\nDirichlet\nseries and\nFourier\nseries. More than forty years have now passed since 'typical means' were first introduced by\nM Riesz\nfor the summation of divergent series, and quite an extensive theory has developed during this period. We have attempted here to give a systematic account of this development. Readers of our account will hardly need to be told how much we owe to the Cambridge tract by\nHardy\nand\nRiesz\non the general theory of\nDirichlet\nseries.\nHarold Gordon Eggleston explains in\n[\n3\n]\nwhat 'typical means' are:-\nThe scope of many convergence arguments in analysis can often be extended by an appropriate interpretation of any divergent series\n(\nor integrals\n)\nthat occur. Each such interpretation give rise to a method of summability. Although there re many inter-relations between different methods of summability it is usually the case that there is one method, or one type of method, tht is of outstanding importance in any particular problem. Typical Means or\nRiesz\nMeans are a method devised to handle convergence problems that arise in connection with\nDirichlet\nseries.\nMinakshi had taken up smoking when on the long voyage back to India from the United States. He became a chain smoker and this almost certainly led to him suffering a mild heart attack in the middle of\n1955\n. He was strongly advised by the doctors to give up smoking and rest for six weeks. After a few weeks he returned to work and, sadly, began smoking again\n[\n11\n]\n:-\nHe said he could be off smoking for some days but then he just couldn't think or do mathematics. Withdrawal symptoms from mathematics were more painful to him than those from smoking.\nOn\n13\nAugust\n1958\n, Minakshi was elected to the\nIndian Academy of Science\n. Earlier that year, in July, he had been a visitor at the Institute for Advanced Study while he was in the United States as part of an educational tour as a member of the General Education Team. He returned to India via Great Britain, taking in the International Congress of Mathematicians held in Edinburgh, Scotland, from\n14\nAugust to\n21\nAugust\n1958\n. At the invitation of the organising committee, he gave the\n30\n-minute lecture\nHilbert algebras\nat the Congress, and this was published in the Proceedings. Minakshi began his lecture as follows:-\nSince the publication of the papers 'On Rings of Operators' by F J Murray and\nJ von Neumann\n, there has been an increasing interest among mathematicians in the structure of topological algebras. Today I wish to discuss some properties of a class of algebras called\nHilbert\nalgebras.\nUntil\n1961\nMinakshi continued his role as Head of the Department of Mathematical Physics. He also took on additional roles such as Warden of the University Hostels and Librarian of the University Library. You can read about an incident that occurred while he was Warden at\nTHIS LINK\n.\nMinakshi organized the\nIndian Mathematical Society\nConference at Andhra University in\n1961\n. In\n1966\nhe was appointed a professor at the newly created Institute for Advanced Studies at Simla. He was pleased to accept this position since he felt that his administrative duties at Andhra University were preventing him from having the time to undertake mathematical research, and this was his real love. At Simla he began writing the book\nSpectral Theory of Differential Operators\n. His daughter writes\n[\n4\n]\n:-\nIn the wonderful surroundings, the atmosphere of the foot hills of the Himalayan range, he could work peacefully with verve. The last work of life began. I was a degree student. I saw the joy of his soul as he mused and worked. He cherished this as having great value to the future of mathematics and to mankind. He knew this contribution of his was a major break through. Distinguished scholars from all over India and a few from abroad also were a part of the faculty. The Rashtrapathi Nivas in Simla housed the Institute for Advanced Studies, Simla. This used to be the summer capital of British Raj as the English could not bear the heat of Delhi!\nIn\n1967\n, while he was enjoying his time in Simla, he received a request from the Vice-chancellor of Andhra University to head a Post Graduate Centre in Guntur. The intention was that this Post Graduate Centre would become the Acharya Nagarjuna University in a couple of years time and Minakshi would be Vice-chancellor. His book on spectral theory was nearly complete so he accepted the new position. The heat and work load in Guntur, however, affected his health. Shortly afterwards he received a letter from Maryland University in the United States offering him the position of Head of the Research Programs of Mathematics. He decided to accept feeling that he would again be able to have time to devote to mathematical research and he agreed to take up the position at the start of the academic year\n1967\n-\n68\n. By August he had arranged visas, passports and tickets for the United States. It was not to be, for before he was due to travel he had a massive heart attack.\nAfter treatment at Vellore Christian hospital he lived for a while with his mother, then his brother and then with his daughter K Radha and his grandchildren. Although his health was now extremely delicate, he was desperate to return to his own home in Vizag. His family discouraged him but he was determined to go. At this time he was still employed by Andhra University and receiving his salary. Since he was not well enough to carry out his duties, he decided to resign. The Vice-chancellor of Andhra University tried hard to persuade him not to resign and made an offer of a special car to take him to the university for two hours on two days a week. Minakshi, however, insisted that he resign. At\n10\np.m. on\n13\nAugust\n1968\nhe had another heart attack. His daughter writes\n[\n4\n]\n:-\nI was by his side. My father was looking at me as life passed out of him. He could not speak because of the pain. The expression in his eyes was powerful and he seemed to will something through me.\nG S R Sarma, Minakshi's nephew, writes about his mathematical work in\n[\n11\n]\n:-\nLet me just add a few observations of personal admiration on my uncle's remarkable work and accomplishments. He started off on classical lines during and after his doctoral thesis devising new ideas and techniques on\nFourier\nseries, summability methods for classically divergent series, Tauberian theorems and eigenvalue problems which were all adjudged to be among the best of the times and are still cited and used. They also laid the foundations for his even greater accomplishments at Princeton. His work eventually fertilized fields like Spectral Geometry and Quantum Gravity, frontier areas of research even today.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Topology"
  ]
}