{
  "nome_completo": "Sunday Osarumwense Iyahen",
  "nome_curto": "Sunday Iyahen",
  "ano_nascimento": "1937",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iyahen/",
  "lugar_nascimento": "Benin City, Edo State, Nigeria",
  "lugar_morte": "Benin City, Edo State, Nigeria",
  "biografia": "Sunday Iyahen\n's parents were Solomon Igbinuwen Iyahen and his wife Aiwekhoe. Solomon was from a leading family of Benin being the son of a Palace functionary. Sunday was the eldest of at least seventeen children, having brothers David Iyahen, Emmanuel Iyahen, Vincent Iyahen, Patrick Iyahen, Christopher Iyahen, Osahon Obarogie, Osaretin Iyahen and Ikpomwosa Iyahen, and sisters Roseline Osunde, Rebecca Okhuoya, Patience Iyahen, Ifueko Iyahen, Ayo Obode, Osadebamwen Aburime, Queen Iyahen, and Isoken Emokpae. Sunday Iyahen was given the name 'Sunday' since that was the day on which he was born. We note the coincidence that he also died on a Sunday. He was widely known as 'Sunny'.\nIyahen attended the Saint Matthew's Primary school, Benin City\n(1944\n-\n45)\n, and then the Saint Peter's School, Benin City\n(1945\n-\n51)\n. These two primary schools were run by the Church Mission Society which had been founded in\n1799\nin the City of London, England. One of the founders was William Wilberforce who, like all the founders, was passionately committed to the abolition of the slave trade. Another founder was John Venn, the grandfather of the mathematician\nJohn Venn\n. The Society's mission work spread through Africa, Asia and the Middle East. The Society began work in Benin around\n1900\nand St Matthew's Cathedral opened in\n1902\n. The Saint Matthew's Primary school Day School was associated with the Cathedral and run by the Church Mission Society. After one year, Iyahen moved to Saint Peter's School which had been established later, again by the Church Mission Society, and had an excellent reputation for academic record and discipline.\nIn\n1952\nIyahen entered Edo College, Benin City, which had been established in February\n1937\n. It is the oldest Secondary Grammar School in the Mid-Western Region. He moved to St Patrick's College, Asaba, and took the Cambridge school certificate examination, passing in Division One in\n1956\n. He studied at Government College, Ibadan, for his Cambridge Higher School Certificate in\n1957\n-\n1958\nand then he worked as an Assistant Statistical Officer at the Federal Office of Statistics, Lagos in\n1959\nbefore entering University College, Ibadan later in that year. He was offered admission to study mathematics at the College, but would have loved to have studied engineering which was the preferred career of the majority of his colleagues from Edo College at that time.\nUniversity College, Ibadan, now the University of Ibadan, was established in\n1948\nas a College of the University of London, England; it was the first university to be established in Nigeria. It became an independent university in\n1962\nafter the country gained its independence from Britain. At the university he was taught by\nChike Obi\nand\nJames Ezeilo\n, two of the three first Nigerian professors of mathematics. He graduated B.Sc. Hons.\n(\nLond.\n)\nfrom University College, Ibadan in\n1963\n, having been awarded First Class Honours in Mathematics. He was awarded the departmental prize for mathematics. For his postgraduate studies he went to Scotland, matriculating at the University of Glasgow in\n1964\n.\nAt the University of Glasgow, Iyahen was advised by Alexander Provan Robertson\n(1925\n-\n1995)\nwho had been born and brought up in Glasgow. After obtaining an M.A. at the University of Glasgow, Robertson had studied at the University of Cambridge for a Ph.D. before returning onto the staff at Glasgow. He was appointed as Professor of Mathematics at the University of Keele taking up the appointment in\n1965\n. Previously a College, Keele had achieved university status in\n1962\n. Ibadan moved to Keele when his advisor took up the chair of mathematics there. His pattern of working was to put in many hours during both the day and the night, and then retire to his room for siesta after lunch. His school friend William Entiemwomwan Eguagie was also undertaking research in England, in fact at Imperial College, London, and the two were guests of Mr and Mrs H A Aigbekaen in Leeds during the vacations. Iyahen was awarded a Ph.D. from the University of Keele in\n1967\nfor his thesis\nOn certain classes of linear topological spaces\n.\nIyahen's first publication was\nSome remarks on countably barrelled and countably quasibarrelled spaces\nwhich was published in the\n1966\n-\n67\nvolume of the\nProceedings\nof the\nEdinburgh Mathematical Society\n. The paper was reviewed by T Husain who wrote:-\nThe notions of countably barrelled and countably quasi-barrelled spaces were introduced by the reviewer\n(1966)\n. These notions generalize the well known concepts of barrelled and quasi-barrelled spaces. In this paper the author gives three examples:\n(\ni\n)\nan example of a countably barrelled space which is not barrelled;\n(\nii\n)\nan example of a countably quasi-barrelled which is not countably barrelled;\n(\niii\n)\nan example of countably barrelled space in which a closed subspace fails to be countably barrelled.\nThis paper gives Iyahen's address as the University of Keele but his next paper, which contained results from his thesis,\nOn certain classes of linear topological spaces\n, submitted on\n20\nMarch\n1967\nand published in the\nProceedings\nof the\nLondon Mathematical Society\nin\n1968\n, has his address as Department of Mathematics, University of Ibadan, Nigeria. This paper has the Acknowledgement:-\nThe author wishes to thank Professor A P Robertson for his help and encouragement. He is grateful to I Tweddle and J W Baker for useful discussions, and to the Government of the Republic of Nigeria for financial support.\nAnother of his papers was published in\n1968\n, namely\nSemiconvex spaces\nin the\nGlasgow Mathematics Journal\n. He writes in the introduction to this paper:-\nMany of the techniques and notions used to study various important theorems in locally convex spaces are not effective for general linear topological spaces. In 'On certain classes of linear topological spaces', a study is made of notions in general linear topological spaces which can be used to replace barrelled, bornological, and quasi-barrelled spaces. The present paper contains a parallel study in the context of semiconvex spaces.\nIyahen married Veronica Aigboduwa Osagie\n(\nknown as Vero\n)\non\n25\nSeptember\n1967\n; they had five sons and one daughter, Vbenaye, Osadolor, Ewansiha, Omoruyi, Osamede and Osasumwen.\nBefore returning to Nigeria after the award of his Ph.D., Iyahen made a research visit to the University of Cambridge. He was then appointed as a lecturer at the University of Ibadan and, in\n1969\n, five of his papers appeared, namely\nD\n(\nT\n,\nC\n)\nD(T, C)\nD\n(\nT\n,\nC\n)\n-spaces and the closed-graph theorem\n,\nUltrabarrelled groups and the closed graph theorem\n,\nSubspaces ofÂ\nR\nÏ\n\\mathbb{R}^{\\phi}\nR\nÏ\n,\nSemiconvex spaces. II\n, and\nA note on separable locally bounded spaces\n.\nHis friend William Eguagie writes\n[\n5\n]\n:-\nIt was evident that Professor Iyahen was so overtly immersed in his area of specialization that he frequently talked about Functional analysis, Topology and Vector spaces which I could hardly understand because I am not a mathematician. His books on the subject adorn my library shelves. However, I was totally impressed and overwhelmed by his achievements as a mathematician when in\n1970\nI went with him to University of Ife where he gave a lecture on \"Infinity\" at the invitation of University of Ife Mathematical Association. I was amazed when after intricate analysis of theorems; he derived and defined the concept and essence of the theory of \"Infinity\" only at about five minutes to the end of the one hour lecture with a standing ovation from the audience.\nIn\n1971\nIyahen was promoted to Senior Lecturer at the University of Ibadan but, one year later moved to the University of Benin where he was appointed as an Associate Professor. He was promoted to Professor at the University of Benin in\n1976\nand, in the same year, made Head of the Department of Mathematics. He served as Head until\n1978\nand then two further terms,\n1980\n-\n1981\nand\n1988\n-\n1992\n. In the first break as Head of the Department of Mathematics from\n1978\nto\n1980\n, he was Dean of the Faculty of Science.\nIyahen published around\n30\npapers between\n1967\nand\n1989\n. His contributions to publishing mathematics was not restricted to research level, however, for he was also one of the authors of the six books\nStep by Step Mathematics for Primary Schools\nBooks\n1\n(1988)\nBooks\n2\nto\n5\n(1990)\n. N O Omozusi writes\n[\n1\n]\n:-\nAs a result of his research into theÂ lack of enthusiasm for mathematics among youths, he discovered that such apathy arose out of lack of good foundation for the youths in mathematics even from the primary school level. This his research led to his writing six graduated books on mathematics titled \"Step by Step Mathematics for Primary Schools.\" These books are now being used in many states of the federation. It is his fervent desire that when his effort at the primary school level would have been bearing fruit, many students would be going to the secondary school with love for mathematics and this would in turn make many students available in that field in tertiary education.\nHe served the mathematical community in many ways in addition to his work for the University of Benin\n[\n1\n]\n:-\nHe had served on the Board of West African Examinations Council\n(1973\n-\n1974)\n. He was chosen to represent the University of Benin in this position. As a result of his wealth of experience, he was appointed a member of the Governing CouncilÂ Â of the University of Maiduguri\n(1986\n-\n92)\n. in order to extend the benefit of his experience to all the universities in Nigeria, the Federal government appointed him as a memberÂ of the National Universities Commission and he served in this capacity from\n1993\nto\n1994\n. Â He servedÂ on the visitation Panel to the Rivers State university of Science and Technology, Port Harcourt in\n1989\n. Other universities outside Nigeria also tap from his experience whether academic or administrative. Hence he had served as external examiner to several universities, among which included that of Cape Coast in Ghana, Fourah Bay University in Sierra Leone, Makerere University in Uganda, University of Nairobi in Kenya, National University inÂ Zimbabwe and some Universities in India.\nHe retired from the University of Benin in\n1981\nbut served on contract as Professor of Mathematics at the University of Benin, Benin City, from\n1984\nto\n1992\n. In\n1983\nIyahen made the decision to enter politics. He explained why he was doing this to one of his friends, saying he wanted\n[\n5\n]\n:-\n... to avert the possibility of mediocrity creeping into the political system and our being ruled by those insensitive to the plight of the common man.\nIn\n[\n1\n]\nhis political work is detailed:-\nProfessor lyahen as a lover of his people was not satisfied with their conditions. He believed that he could improve on their condition, if he could become a policymaker. To this end he went into politics. He wasÂ electedÂ a senator, representing the Bendel Central senatorial district, under the platform of the National party ofÂ Nigeria\n(\nN.P.N\n)\nin\n1983\n. He so contributed his quota to the activities of that arm of legislature that he was made the chairman of senate committee on Information and Public Relations. He also served as a member of other committees, which included senate committee on Education, Committee onÂ ScienceÂ and Technology, Committee on Agriculture and Committee on rules and business. Even though the army dissolved the house of legislature within few months of its inception, Professor S O Iyahen was already being noticed both within the house of parliament and by the general Public as a man who knows the meaning of the word Toil. HeÂ and some members were working day and night in order to achieve success but the army did not give them the required chance to succeed. Here of course is no forum to examine why the army is always present in Nigerian government. HisÂ people so trusted him that he was elected again as a senator in the aborted third Republic. This time around, he was made Chairman of Senate Committee on National Planning, he was also member of senate Committee on Agriculture, Committee on Education and Committee on Water Resources. In all these capacities, he performed well. The army again struck and sacked all the legislative arms of Â government in Nigeria in\n1993\n. In this second term, he was elected by the Social Democratic Party of Nigeria\n(\nS.D.P.\n)\nto represent Edo South- West senatorial District.\nHe was appointed Coordinator of Mathematics Program at the National Mathematical Centre, Abuja, from\n1998\nto\n2004\nwhere he rose to become Acting Director and Chief Executive of the Centre. He was appointed by the Federal Government of Nigeria as Chairman, Governing Council, Federal Polytechnic, Idah, Kogi State\n2005\n-\n2009\n. He became Professor of Mathematics and pioneer Head of Department of Mathematics and Computer Science at Benson Idahosa University, Benin City and Pioneer Dean of School of Postgraduate Studies of the same institution from\n2010\n-\n2012\n.\nSunday Iyahen was awarded many honours for his outstanding mathematical contributions. He was elected a member of the\nAfrican Mathematical Union\n(1976)\n; he was a member of the Nigerian Mathematical Society serving as a Member of Council\n(1984\n-\n1988)\n; elected a fellow of the Nigerian Academy of Science\n(1981)\nand serving as Vice President\n(2000\n-\n2001)\n; and elected a fellow of the Mathematical Association of Nigeria\n(1992)\n. He was Editor-in-Chief of the\nAfrika Mathematical\nthe Journal of the\nAfrican Mathematical Union\nfrom\n1986\nto\n1992\n.\nYou can read a tribute by Ray O Elaho at\nTHIS LINK\n.\nLet us end with some short extracts from the tributes\n[\n5\n]\n:-\nFrom Vero\n[\nSunday Iyahen's wife\n]\n:-\nYour life was about peace, love, caring and selflessness. You touched a lot of hearts. You loved and sacrificed your time and joyfully helped people unconditionally. Your selflessness, peaceful nature, heart-warming jokes and humour attracted many.\nFrom Isoken Emokpae\n[\nSunday Iyahen's young brother\n]\n:-\nI didn't grow up in the same household as you, but I knew you were a brother who took the role of a father whenever you visited our late mother. Growing up, I knew you as a brother who always wanted the best for me and all of our siblings. How can I forget your laughter that emanates throughout the whole room as well as your constant humming that alerted everyone of your presence. You were the person everyone wished to have as a father, a brother, an uncle, or a friend. You were a disciplinarian, although you loved us very much. Brother Sunny, you were a man of unity and a man of peace.\nFrom Vbenaye Frank Iyahen\n[\nSunday Iyahen's son\n]\n:-\nDuring your life time, you taught us basic core values which we cherish as a family: Integrity, Hard work, Patience, Discipline, Self-denial and Generosity.\nFrom Patrick E Iyahen\n[\nSunday Iyahen's brother\n]\n:-\nMy dear beloved brother Professor Senator Sunday Osarumwense Iyahen, was the embodiment of simplicity, kindness, fairness and transparency. He was always there for our family and friends, and was always ready to sacrifice his time and pleasure to make sure that others can progress. At a very tender age, he assumed the leadership and piloted the affairs of our family. With his excellent sense of direction, we were all able to accomplish our goals in life. He assumed this leadership willingly because he had a vision for us all. Not only did the immediate family benefited from his guidance and leadership, our extended family and friends also benefited. His innate desire was also carried to the political arena, were others benefited from his admirable qualities. The populace saw and believed that he was an excellent human being, transparent to the core and sincere.\nFrom Lilian Osasumwen Fatunla\n[\nSunday Iyahen's daughter\n]\n:-\nI watched how excited you get when with friends or family and you erupt into your thunderous laughter, excitedly rubbing your palms together, giggling, smiling and a bubbly \"Iye mwen.\" I watched how you constantly greeted everyone \"koyo oh\" just to pep up their day and make them feel better about themselves and what they do.Â I watched how you took on tough issues with bravery, honesty, love and wisdom even when not convenient. I observed how hard of a worker you were, how dedicated and committed you were to everything you did. With that, came resounding celebration of you from all institutions you were a part of. I watched how loving you were to my mum. You thanked her at every opportunity. Whenever my mum prepared your food, you ate with so much appreciation while repeatedly thanking her saying - \"Thank you my dear, thank you my dear\". I watched how honest you were with her and watched how you constantly woke up early to chat with her about your day and plans.\nFollowing his death, the Senate of the Federal Republic of Nigeria passed the following Motion\n[\n2\n]\n:-\nThe Senate contends that late Senator Professor Sunday Osarumwense Iyahen was indeed a great man who served Nigeria with everything he had. He gave his all both in his youth and old age to the service of Nigeria and thus deserves to be accorded the utmost national respect even in death. Accordingly the Senate resolves to:\n(\ni\n)\nobserve a minute silence in his honour;\n(\nii\n)\nsend a delegation of this hallowed chamber to pay a condolence visit on his wife, children, family members, the people and government of Edo State; and\n(\niii\n)\naccord his burial all the official rites due such a national figure who served with diligence.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Statistics",
    "Topology"
  ]
}