{
  "nome_completo": "Sydney Chapman",
  "nome_curto": "Sydney Chapman",
  "ano_nascimento": "1888",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chapman/",
  "lugar_nascimento": "Eccles (near Manchester), England",
  "lugar_morte": "Boulder, Colorado, USA",
  "biografia": "Sydney Chapman\n's mother was Sarah Gray and her father was Joseph Chapman who was the chief cashier with a Manchester textile firm called Rylands. Sydney was his parents' second son and he was brought up in a very strict fashion by his Nonconformist parents.\nHe attended Green Lane school in Patricroft up to the age of\n14\n. This was a good school of its type for there he learnt a little Latin and was introduced to some science subjects such as chemistry and physiology. After Sydney left school, Joseph, his father, took him to see a friend of the family who worked in engineering with the idea that his son should become an apprentice with the firm. The friend advised that he study for two further years at technical school before taking up an engineering apprenticeship.\nFollowing this advice, Chapman entered the Royal Technical Institute, Salford\n(\nwhich is now the University of Salford\n)\n. It was still his intention to enter the engineering industry but he performed so well at the Institute that his teachers encouraged him to sit the Lancashire Scholarship examinations. Again he had been fortunate to have been taught science subjects, although at a very low level, having a particularly good chemistry teacher. After two years at the Institute he sat the county scholarship examinations to Manchester University and was placed fifteenth, the bottom place for the award of a scholarship. He used to say in later life:-\nI sometimes wonder what would have happened if I'd hit one place lower.\nIn\n1904\n, at the age of\n16\n, Sydney entered the University of Manchester and there he studied engineering in the department headed by Osborne\nReynolds\n. In mathematics he was taught by\nLamb\n, the professor of mathematics, and\nJ E Littlewood\nwho arrived from Cambridge in Chapman's final year at Manchester. Graduating with an engineering degree, he had become so fond of mathematics that he stayed on at Manchester for one further year to take a mathematics degree. At\nLamb\n's suggestion Chapman tried for a scholarship to Trinity College, Cambridge and, being successful, entered Trinity in\n1908\n. At first he was a\nsizar\n(\nmeaning that he obtained financial support by acting as a servant to the older boys\n)\nbut from his second year onwards he received a full scholarship. Cambridge stimulated his interest more than anything had done before and perhaps this is not surprising since there he met\nHardy\n,\nWhitehead\nand\nRussell\n[\n5\n]\n:-\nThe beauty of the place and its unspoilt surroundings came on him as a revelation, even though with his background he sometimes felt out of place. He later said that he felt that he first began to live at Cambridge.\nChapman's progress was so remarkable that he was able to start research while still an undergraduate but he was unsure whether to go in the direction of pure or applied mathematics. His first research was on summable series and he wrote two papers on this topic, one of them a joint paper with\nHardy\n. However\nLarmor\nsuggested he look at problems in the kinetic theory of gases and, despite not being very happy with the applied mathematics which\nLamb\nhad taught him, his interest soon turned in this direction.\nAfter Chapman graduated from Cambridge in\n1910\nthe astronomer royal, Frank Dyson, offered him the position of senior assistant at Greenwich Observatory. He accepted and continued to work there until the beginning of World War I. At first he supervised the installation of new instruments to measure magnetism, but was disappointed to find that the scientists were only interested in collecting data and were making no real attempts to interpret it. To counter this trend, Chapman began to analyse data relating to the way that the Sun and Moon influence terrestrial phenomena. His success is measured by the award of the first Smith's prize in\n1913\n, and with this topic he began a research interest that he would continue through the rest of his life.\nChapman, however, was not entirely happy with devoting himself to astronomy as is pointed out in\n[\n5\n]\n:-\n... he did not feel he was a good observer, and he did not want to subordinate all his other interests to astronomy; in particular, he wanted to complete the work he had begun on the kinetic theory of gases. Also he did not relish the prospect of the administrative work which might ultimately have fallen on him at Greenwich.\nHe left the Greenwich observatory and returned to Cambridge as a lecturer in\n1914\n, with a reduced salary, around the time that World War I broke out. His religious principles made him a pacifist so he was exempted from military service and remained at Cambridge. In\n1916\nhe was asked to return to working at the Greenwich observatory in an honorary capacity, which he did until December\n1918\n. Once back at Cambridge after the war ended, however, he was made to feel very unhappy and unwelcome because of his pacifist views and, as a consequence, he suffered depression for a number of years.\nDespite his depression Chapman's research did not suffer. During the war, between\n1915\nand\n1917\n, he completed a series of important papers on thermal diffusion and the fundamentals of gas dynamics. He developed systematic approximations to the\nMaxwell\n-\nBoltzmann\nformulation for the velocity distribution function for interacting particles under general force laws. Between\n1913\nand\n1919\nhe published another important series of papers, this time on terrestrial magnetism which we comment on below.\nIn\n1919\nhe was appointed to the chair at Manchester where he succeeded\nLamb\n. He married Katharine Nora Steinthal, who came from Manchester, in\n1922\nand they had one daughter and three sons. His career continued to go from strength to strength and he was appointed to the chair of mathematics at Imperial College London in\n1924\nsucceeding\nWhitehead\n.\nLong before the start of World War II Chapman had seen the dangers of the Nazi rise to power in Germany. His pacifist views had changed\n(\nwith some considerable influence from Hitler\n)\nso that by the start of World War II he was ready to undertake war service and he worked on military\noperational research\nand incendiary bomb problems.\nIn\n1945\n, at the end of World War II, he returned to his chair in London but was now less happy than he had been, so, in\n1946\n, he readily accepted the offer of the Sedleian Chair of Natural Philosophy at Oxford, also becoming a fellow of Queen's College at this time. The next few years turned out to be the least productive period in Chapman's research career. Science was considered of secondary importance in Oxford at the time, and he worked hard to convince non-scientists of its importance by teaching special lecture courses for non-scientists.\nHe resigned his position in Oxford in\n1953\nat age\n65\n, rather than waiting to retire at age\n70\n, and began to visit many places throughout the world. In particular he took a research post in Alaska in\n1953\nand in addition took on a similar post at the High Altitude Observatory in Boulder, Colorado, two years later. These became his two main bases, but his visits to other places included Michigan and Minnesota in the USA, Istanbul, Ibadan, Cairo, Prague, Tokyo and Russia.\nChapman's main area of research was the Earth's magnetic field and for his work in this area he was elected to the\nRoyal Society\nin\n1919\n, and awarded the Society's Copley Medal in\n1966\n:-\n... in recognition of his theoretical contributions to terrestrial and interplanetary magnetism, the ionosphere and the aurora borealis.\nHe had begun work on geomagnetism in\n1913\nand between then and\n1915\nhad published three papers on the topic. These interpreted magnetic variations using a dynamo theory driven by tidal flows in the ionosphere resulting from the influence of the Sun and Moon. In\n1919\nhe produced the first theory which attempted to explain magnetic storms, but he soon found that it was unsound. He received the\nAdams\nPrize in\n1928\nfor an essay on geomagnetism. Other work which he did around this time was undertaken in collaboration with\nMilne\n.\nBetween\n1928\nand\n1932\nChapman returned to work on gas dynamics, extending the methods he had developed earlier. He also undertook important research on plasmas. In\n1931\nhe gave the\nRoyal Society\nBakerian lecture which was a classic in which he developed the now standard layer theory for the lower ionosphere. He was honoured in\n1957\nby being elected president of the Special Commission of the International Geophysical Year. In fact he played a major role in initiating and guiding the International Geophysical Year which has been the greatest international geophysics cooperation of the twentieth century.\nChapman, when asked shortly before his death which work he had undertaken since retiring he had found most interesting, replied that it was his work on thermal diffusion in highly ionised gases, his work on magnetic storms, his work on instability along magnetic neutral lines, and his work on noctilucent clouds.\nCowling writes in\n[\n5\n]\nabout his lecturing style:-\nHis lecturing style tended to be pedestrian, though workmanlike. ... Thus when I first heard Chapman lecture at the\nBritish Association\nin\n1931\n, I was at first disappointed; not until later did I appreciate how packed with relevant information his talk had been. There was a simple directness about his mode of expression, which often concealed deep thought.\nHis personal characteristics are described in\n[\n5\n]\nas follows:-\nThose who knew Chapman all testify to his kindness, persistence, simplicity and integrity. His kindliness was appreciated by successive generations of research students and junior colleagues, in times of difficulty one could always turn to him for helpful advice.\nHis character and interests are also described in\n[\n3\n]\n:-\nChapman's mild manner veiled a strong will and great determination; his tastes and habits were simple. He was an enthusiastic cyclist, swimmer and walker, and both on his visits to foreign universities or to international conferences, however varied the available modes of transport might be, Chapman could always be relied on to arrive on a bicycle. He rode from Montreal to Washington in\n1939\nto attend the meeting of the International Geophysical Union.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics"
  ]
}