{
  "nome_completo": "Sydney Goldstein",
  "nome_curto": "Sydney Goldstein",
  "ano_nascimento": "1903",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Goldstein/",
  "lugar_nascimento": "Hull, England",
  "lugar_morte": "Brockton, Massachusetts, USA",
  "biografia": "Sydney Goldstein\n's parents were Joseph and Hilda Goldstein. He was an only child but the early death of his mother saw him being brought up in the home of one of his mother's sisters. His father died in\n1916\nand he was left an orphan at the age of thirteen. He was educated in Sunderland, attending the Bede Collegiate Boys' School, completing his studies there in\n1921\n. His favourite subject at Bede's School had been mathematics so, on\n10\nOctober\n1921\n, he matriculated at the University of Leeds and began work towards a B.Sc. degree in mathematics.\nWhen he first arrived in Leeds, Goldstein had not found any student accommodation so, for his first month, he was given accommodation by\nSelig Brodetsky\nwho had, one year earlier, been promoted to Reader in Applied Mathematics.\nBrodetsky\n, who was a Russian Jew, had two great passions in life, mathematics and working for the Jewish community and the Zionist movement. He was to strongly influence Goldstein in both these areas, not only during the month that Goldstein lodged with Mania and\nSelig Brodetsky\nbut also after he found his own accommodation since their friendship continued with frequent meetings. From this time on Goldstein, like\nBrodetsky\n, was to have the twin passions of mathematics and Zionism.\nBrodetsky\nquickly saw that Goldstein had exceptional mathematical talents which could not be fully realised by taking a degree at Leeds. He strongly advised the young student to move to Cambridge, where he himself had studied, and take the Mathematical Tripos.\nAfter one year at Leeds, Goldstein moved to St John's College, Cambridge, graduating in\n1925\n. Based on his very successful undergraduate career, Goldstein was awarded the\nIsaac Newton\nStudentship to continue undertaking research in applied mathematics under\nHarold Jeffreys\n. His years at Cambridge were highly significant not only from the mathematical point of view but also because it was at this time that he met his future wife.\nJames Lighthill\nrelates the circumstances in\n[\n4\n]\n:-\nSydney had been requested by a friend to go to Waterloo Station to meet an arriving South African girl, Rosa Sass\n(\nalso from a Jewish family\n)\n, whom the friend was not himself free to meet on that day. She was due to enter Newnham College for a Ph.D. degree course in Physical Chemistry. Syndey and Rosa were by no means to meet just on this one occasion; they found that they had a great deal in common - including some strong Zionist interests which in the fullness of time were to become even stronger - and their friendship prospered remarkably. They were married on\n23\nMarch\n1926\nand, by the time Rosa attended\n(\nsuccessfully\n)\nher Ph.D. oral in\n1927\n, she was already pregnant with their first child, David John.\nGoldstein won the Smith's Prize in\n1927\nand was awarded his doctorate in\n1928\nfor a thesis on the Mathieu functions\n(\nnamed after\nÉmile Mathieu\n)\nentitled\nThe Theory and Application of Mathieu Functions\n. He was appointed Rockefeller Research Fellow and spent a year working with Ludwig Prandtl in Göttingen. The strong influence of Prandtl on Goldstein is clearly seen by reading\n[\n3\n]\n. In\n1929\nhe was made a fellow of St John's College, Cambridge and, in the same year, he was appointed to a Lectureship in Mathematics at the University of Manchester. He held these two appointments in parallel, dividing his time between the two. By this time he had twelve papers in print, the first two in\n1927\nand then five in each of the following two years. These included\nThe influence of the Earth's magnetic field on electric transmission in the upper atmosphere\n(1928)\n,\nThe forces on a solid body moving through a viscous fluid\n(1929)\n,\nThe steady flow of a viscous fluid past a fixed spherical obstacle at small Reynolds number\n(1929)\n, and\nOn the vortex theory of screw propellers\n(1929)\nwhich were all published in the\nProceedings\nof the\nRoyal Society of London\n.\nManchester had a profound influence on Goldstein. The influence of\nReynolds\nand\nLamb\nin fluid dynamics was still felt there and had a strong effect on him. He also interacted with the Professor of Applied Mathematics,\nDouglas Hartree\n. He moved to Cambridge in\n1931\nand a clear indication of the high quality of his research over the next few years was his election as a fellow of the Royal Society of London in\n1937\n. Leslie Howarth was a student at Manchester, where he was taught by Goldstein during\n1929\n-\n31\n, then he followed Goldstein to Cambridge. Howarth wrote\n(\nsee\n[\n4\n]\n)\n:-\nWhen, after taking the Mathematical Tripos\n(\nplus Schedule B\n)\n, I graduated, he became my research supervisor. He was a most generous supervisor, generous in his always-stimulating suggestions and generous with his time. His home had a ready-open door and there, with Rosa, he had a profound influence on my life as well as on my work.\nHe took over, on\nLamb\n's death, the editorship of\nModern Developments in Fluid Dynamics\n, this important work appearing in\n1938\n. Leslie Howarth comments on his editorial skills\n(\nsee\n[\n4\n]\n)\n:-\nGoldstein's work as editor and part author of 'Modern developments in fluid dynamics' has been universally acclaimed. I was fortunate in seeing this at first hand as a part author and proof reader. Apart from reading and digesting every word, it was an education in itself for me to observe the skill that Sydney Goldstein applied to creating a unified, stimulating and accurate work.\nFrom the outbreak of World War II in\n1939\n, he worked on boundary layer theory at the Aerodynamics Division of the National Physical Laboratory where he was seconded for the duration of the war. By this time there were two children in the family, the younger being Ruth. In\n1940\nthe Goldsteins decided that, because of threats from the Nazis towards Jewish children, Rosa would move to the United States with David John and Ruth. She worked from\n1940\nto\n1944\nfor the British Air Commission in Washington and only in\n1944\ndid they consider it safe enough to again be reunited in England. During the six war years Goldstein worked at the National Physical Laboratory he made excellent use of the computing facilities, advanced electric calculating machines operated by bright girls, and the wind tunnels used for experiments. He showed his outstanding leadership qualities in the exceptionally demanding environment dictated by the day-to-day crises of the wartime situation.\nIn\n1945\n, the University of Manchester made two inspiring appointments to the Department of Mathematics,\nMax Newman\nto the Fielden Chair of Pure Mathematics and Goldstein to the Beyer Chair of Applied Mathematics. The Vice Chancellor of the university, Sir John Stopford, had persuaded the university authorities that these two appointments would \"create at Manchester a dynamic and internationally renowned Department of Mathematics, interacting admirably with other units in the university\".\nHowever in\n1950\n, Goldstein who, as we have already noted, had strong Jewish beliefs, accepted a professorship in Applied Mathematics and the chairmanship of the department of Aeronautical Engineering at Technion in Haifa, Israel. It was his delight in Israel's victory in the\n1948\n-\n50\nWar of Independence that made it almost impossible for him not to accept this honour. However, the death of the President of the university shortly after he arrived there meant that Goldstein came under strong pressure to take over this administrative role. He resisted but eventually accepted the role of Vice President in charge of academic affairs. In a review of the first ten years of Technion, the President wrote:-\nDr Goldstein was the architect who designed the academic framework of the Technion. It was not only that he penned the academic constitution and by-laws, set up the academic and administrative bodies, defined the functions and authority of such bodies and created the tools and broad outlines for the operation of the Technion; he also gave content and spirit to these outlines, drawn from his own experience and from the fine traditions of higher learning in that country where he lived and worked as distinguished professor, scientist and academician. ...\nThe pressure put on him in his role as Vice President of Technion was unbearable, however, so, as a consequence, his stay in Israel was not very long and in\n1955\nhe accepted the Gordon McKay Professorship of Applied Mathematics at Harvard in the United States.\nGoldstein's work in fluid dynamics is of major importance. He is described in\n[\n4\n]\nas:-\n... one of those who most influenced progress in fluid dynamics during the\n20\nth\ncentury.\nHe studied numerical solutions to steady-flow laminar boundary-layer equations in\n1930\n. In\n1935\nhe published work on the turbulent resistance to rotation of a disk in a fluid. His work was important in aerodynamics, a subject in which Goldstein was extremely knowledgeable. The\nAnnual Review of Fluid Mechanics\nbegan publication in\n1969\nand they invited Goldstein to be write an historical survey to be the first article in the new journal. The editors wrote:-\nIt seems particularly appropriate that this first 'Annual Review of Fluid Mechanics' should begin with an historical survey by one of the greatest of the living fluid mechanicists, Professor Sydney Goldstein. For one thing, he is probably uniquely qualified to write on this subject. Moreover, his own editorial efforts in 'Modern Developments in Fluid Dynamics'\n(\nOxford,\n1938)\nsurely establish the standards of accuracy, content, and style for books of this category. By inviting Professor Goldstein to write our opening chapter, we acknowledge our great debt to him.\nThe fascinating article\n[\n3\n]\nwas contributed by Goldstein and we give just one quote from it regarding the ancient nature of the subject:-\nCuriosity about at least two of the branches of fluid mechanics and their applications has a long and distinguished history, for in the Proverbs of Solomon the son of David, king of Israel, it was stated in the words of Agur the son of Jakeh that \"There be three things which are too wonderful for me, yea four which I know not,\" of which two were \"The way of an eagle in the air\" and \"The way of a ship in the midst of the sea,\" which I take to be questions of aerodynamics and naval architecture, questions that concern us still.\nGoldstein retired from his Harvard chair in\n1970\n. His\n70\nth\nbirthday was marked by the International Symposium on Modern Developments in Fluid Dynamics held in his honour at Technion, Haifa in December\n1973\n. At this conference he gave his own thoughts on fluid dynamics and applied mathematics\n[\n1\n]\n:-\nFluid-dynamicists and applied mathematicians should interact with society at large to help in all aspects of technology, e.g. supersonic flight\n(\nand not only its fluid dynamics!\n)\n, physiological flows, surgical tools and aids, such as diagnostic instruments, pumps and artificial organs. There exist enormous social applications, not only in medicine, but also in other areas. We cannot afford to be stand-offish! A complete integration with other subjects, professions and fields, with society at large, is of the utmost importance for the future of our profession; for the future of fluid dynamics and applied mathematics. Needed is not a vague kind of cooperation, but complete scientific and social integration. Scientists should extend into regions of alien specialities. One should welcome people from other Departments and encourage them to explore, and this should extend to collaboration with the social sciences. In doing pure mathematics there is an absence of responsibility; not so in applied mathematics. Let us return to old-fashioned attitudes and training. There is too much to learn now. Instead of spending eight years in the transfer of skills and knowledge, we should try to instil an attitude, a spirit. One should get back to being a whole man, back to an attitude of responsibility. We should be as responsible as engineers and physicians. It is often said that applied mathematicians act as bridges between mathematics and other disciplines. If you want to be a bridge you must be prepared to carry a load.\nDuring his career, Goldstein gave many lectures series, some of which were written up and published. These include \"Linearized theory of supersonic flow\" and \"Statistical theory of turbulence\" both given at the Institute for Fluid Dynamics and Applied Mathematics, University of Maryland in\n1950\n. In this same year he was an invited speaker at the International Congress of Mathematicians, Cambridge, Massachusetts, giving the address\nSelected problems in gas dynamics\n. At the Summer Seminar at Boulder, Colorado in\n1957\nhe gave a series of lectures which were written up as\n300\n-page book. Richard Meyer writes in a review:-\nTo make \"mature mathematicians familiar with fluid dynamics'' in\n12\nlectures is a task on the border, at least, of the possible. With a large minority of the audience composed of distinguished specialists in fluid dynamics, the task is well beyond that border. And the requirement of publication of the lectures cuts off any retreat. These, we may speculate, were some of the reasons for asking the particular author to make the attempt. As would be expected, he shuns resolutely the superficially elegant and the sensational, and the resulting book is an unusual and valuable contribution to the literature.\nFinally let us note that Goldstein also wrote on his other passion, namely Zionism, along with applied mathematics. On\n15\nFebruary\n1972\n, Goldstein gave a lecture at the University of Leeds which was published in the following year as\nViews on the meaning of Zionism and of applied mathematics fifty years ago and now\n(1973)\n.\nGoldstein received many honours in addition to his election to the\nRoyal Society of London\nmentioned above. He was elected to the\nRoyal Netherlands Academy of Sciences and Letters\nin\n1950\nand to the Finnish Scientific Society in\n1975\n. He was awarded an honorary fellowship of St John's College, Cambridge in\n1965\n, by the Weizmann Institute of Science at Rehovot, Israel in\n1971\n, by the Royal Aeronautical Society in\n1971\n, and by the Institute of Mathematics and its Applications in\n1972\n. He was awarded honorary doctorates by Purdue University\n(1967)\n, Case Institute of Technology, Cleveland\n(1967)\n, Technion, Haifa, Israel\n(1969)\nand Leeds University\n(1973)\n. He received the Timoshenko Medal from the American Society of Mechanical Engineers in\n1965\n.\nJames Lighthill\ndescribes Goldstein final years\n[\n4\n]\n:-\nSydney Goldstein spent the years of his retirement almost entirely at Belmont, increasingly incapacitated physically by illness. In the activity of his mind, mathematics and fluid dynamics ceased to play a significant part but his Jewish faith continued to burn brightly to the end.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}