{
  "nome_completo": "Sylvia Winifred Skan",
  "nome_curto": "Sylvia Skan",
  "ano_nascimento": "1897",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Skan/",
  "lugar_nascimento": "Richmond, Surrey, England",
  "lugar_morte": "Twickenham, Middlesex, England",
  "biografia": "Let us say right at the beginning that we have not been able to find any information about\nSylvia Skan\nexcept data from official documents such as the census and from papers she wrote or contributed to. If anyone has further information, please let us know so that we can write a \"proper\" biography.\nSylvia Skan's father was Sidney Alfred Skan\n(30\nAugust\n1870\n-\n19\nDecember\n1939)\n, born in Bickenhill, Warwickshire. He was a botanist who worked at the Royal Gardens at Kew and later as a civil servant for the Board of Agriculture and Fisheries. Sylvia's mother was Jane Alkins, born in Bakamoor, Staffordshire on\n5\nApril\n1873\n. Sylvia was the eldest of her parents' five children. She had a younger brother Douglas Alkins Skan\n(1899\n-\n1978)\nborn on\n13\nDecember\n1899\nin Richmond, Surrey, England. He became a medical doctor and went to Africa where he served in Tanganyika and Nyasaland. A\n1935\nMedical Directory lists him as a Member of the Royal College of Surgeons; a Licentiate of the Royal College of Physicians, London\n1924\n; a Diploma in Tropical Medicine Liverpool\n1925\n; Diploma in Tropical Hygiene\n1925\n; and a Medical Officer in the East African Medical Service. He married Kathleen Edith Royston in\n1926\n.\nSylvia also had two younger sisters, Mabel Irene Skan born\n30\nJune\n1902\nin Richmond, Surrey, England, and Isabel Lilian Skan born\n14\nMay\n1903\nin Kew, Surrey, England. On\n9\nAugust\n1903\nMabel Irene Skan was baptised in Kew, Surrey. At this time her father Sidney Alfred Skan was a botanist at the Royal Gardens. Mabel Skan became an assistant compiler for the Royal Botanical Gardens. Isabel Lilian Skan was baptised in Kew on the same day. Mabel died on\n8\nOctober\n1982\nin Twickenham, Middlesex while Isabel married Leslie Pope in\n1948\nand died in January\n1991\nin Hounslow, London. Sylvia's youngest sibling was her brother Lawrence Gilbert Skan, born\n21\nFeb\n1914\n, and baptised at St Mary the Virgin, Twickenham, England. He became a poultry farmer and died on\n9\nJuly\n1992\n.\nAt the time of the\n1901\ncensus, when Sylvia Skan was three years old, the family were living in Richmond, Surrey, the town of her birth but, ten years later at the time of the\n1911\ncensus, on\n2\nApril, they were living at\n37\nHolmes Road, Twickenham, Middlesex, England. We have not been able to find any information about her education, but she clearly learnt mathematics and physics to a very high level for by\n1923\nshe was working in the Aerodynamics Department of the National Physical Laboratory and published the paper,\nBiplane investigation with R.A.F.\n, written jointly with William Lewis Cowley, A G Gadd and L J Jones. We can deduce that she had no university degree since her co-authors list their degrees on the paper while she does not give any degrees. We note that this does not necessarily mean that she did not attend Oxford University or Cambridge University since women at that time were not formally awarded degrees. Another fact about her education which we can deduce is that she must have learnt several languages for later in life she translated French, German and Russian papers\n(\nsee below\n)\n.\nSkan worked her whole career in the Aerodynamics Department of the National Physical Laboratory. In\n1930\nshe was living with her parents Sidney Alfred Skan and Jane Skan, together with her sisters Mabel Irene Skan and Isabel Lilian Skan at Cole Park Road, Twickenham. But in the following year she was living on her own in a house at\n88\na Wellington Road, Spelthorne, Surrey. In\n1936\nshe was still living at\n88\na Wellington Road but by\n1939\nshe was living on her own at\n20\nWalpole Court, Twickenham, Middlesex, England. She remained at that address for the rest of her life. In this\n1939\nrecord she is listed as an assistant\n(\nMechanical Work and Translation\n)\nin the Aerodynamics Department of the National Physical Laboratory. Let us now look briefly at some of her translating contributions.\nAlthough Skan must have been working on translations at least as early as\n1939\n, the first that we have found is in\n1946\n, in fact we have found three German works which were translated by Skan in that year. These were\nSolution of Possio's integral equation for an aerofoil oscillating harmonically in a compressible medium by reduction to a system of linear equations\nby\nMartin Eichler\nwith Skan's translation from German to English appearing in March\n1946\n. In the same month, Skan's translation from German to English of\nThe numerical solution of Possio's integral equation for an oscillating aerofoil in an two-dimensional subsonic stream\nby Th Schade appeared. We should note the speed of her translations, for\nThe air forces for the harmonically oscillating aerofoil in a compressible medium at subsonic speeds\n(\ntwo-dimensional problem\n)\nby F Dietze was published in German in August\n1946\nwith Skan's English translation being dated December\n1946\n. In\n1948\nSkan's translation of the\n1947\nRussian work\nWing theory in unsteady flow\nby\nAleksandr Ivanovich Nekrasov\nwas published. The French paper\nFlow in the neighbourhood of the apex of a highly swept wing at moderate incidence\nby R Legendré was published in\nLa recherche Aeronautique\nin\n1952\nwith Skan's translation dated\n1953\n. Another French work,\nOn the effect of orifice size on static pressure reading at different Reynolds numbers\nby A K Ray, was published in\n1956\nwith Skan's translation appearing in the same year.\nWe gain a little information about Skan's other contributions from the acknowledgement in W Prichard Jones's paper\nThe Oscillating Aerofoil in Subsonic Flow\n(1953)\nin which he writes:-\nAcknowledgment. - The numerical work required for this report was done by Miss Sylvia W Skan of the Aerodynamics Division, N.P.L.\nW Prichard Jones was a colleague of Skan's in the Aerodynamics Department of the National Physical Laboratory.\nAlthough Skan's contributions here were for the numerical work, her contributions to other papers must have been much more substantial for she was a joint author. In fact we have found\n17\npapers or reports with Skan as a joint author, the first being in in\n1923\nwith the last paper being in\n1960\nwritten jointly with\nNewby Curle\nwho went on to be appointed Professor of Applied Mathematics at the University of St Andrews and a colleague of the authors of this biography\n[\nEFR and JJOC\n]\n. One article which we must single out for comment was\nSome approximate solutions of the boundary layer equations\n(1930)\nwhich Skan co-authored with V M Falkner. This contains what is now known as the 'Falkner-Skan boundary layer'. This boundary layer generalises the Blasius boundary layer and occurs when a flat plate is inserted into a flow, not parallel to the direction of flow. They thus solved the Prandtl problem with a power law pressure gradient with self- similar solutions.\nFor more information about these\n17\npapers and reports, including abstracts or reviews of some of them, see\nTHIS LINK\n.\nThe only single authored work by Skan which we have found is the two volume book\nHandbook for computers\npublished by the National Physical Laboratory, Department of Scientific and Industrial Research, in\n1954\n. The review by Eugene Isaacson states\n[\n2\n]\n:-\nA complete introduction to the elementary mathematics and to some of the techniques of computation that are required of junior computers is clearly presented with many illustrative examples. These chapters would constitute the basis for an on-the-job training program for an audience with limited mathematical background. The mathematical topics range from the solution of quadratic equations to an introduction to the calculus. The numerical techniques that are described range from finding square roots to numerical differentiation and integration of functions. Throughout there is the necessary emphasis on the numerical checks and the arrangement of work sheets which insures accuracy in a computation laboratory.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus"
  ]
}