{
  "nome_completo": "Tadashi Nakayama",
  "nome_curto": "Tadashi Nakayama",
  "ano_nascimento": "1912",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nakayama/",
  "lugar_nascimento": "Tokyo, Japan",
  "lugar_morte": "Nagoya, Japan",
  "biografia": "Tadashi Nakayama\n's father was a leading scholar of Chinese classics. Tadashi was brought up in Tokyo where he first attended primary school and then entered the Musasi High School. His performance at this school was outstanding and, after graduating from the High School, he entered Tokyo Imperial University. There he was taught by\nTeiji Takagi\nwho had done important work on\nalgebraic number theory\n. However, perhaps even more of an influence on Nakayama than\nTakagi\nwas his student\nKenjiro Shoda\nwho had studied in Germany with\nIssai Schur\nin Berlin and with\nEmmy Noether\nin Göttingen. In\n1934\nNakayama had his first three papers published.\nÜber das Produkt zweier Algebrenklassen mit zueinander primen Diskriminanten\nwas written jointly with\nShoda\nwhile the other two,\nEin Satz über p-adischer Schiefkörper\nand\nÜber die Definition der Shodaschen Diskriminante eines normalen einfachen hyperkomplexen Systems\nwere single-authored papers but still influenced by\nShoda\n.\nNakayama graduated with his Rigakushi\n(\ndiploma\n)\nfrom Tokyo Imperial University in\n1935\nand, in the same year, he was appointed as an assistant at Osaka Imperial University\n(\nnow Osaka University\n)\n.\nShoda\nhad been appointed as a professor in the Faculty of Science at Osaka University in\n1933\nso Nakayama's appointment there allowed them to easily continue their work together. In fact Nakayama published the book\nLocal Class Field Theory\nin the year he was appointed to Osaka. He was promoted to assistant professor at Osaka University in\n1937\nhaving by this time twelve papers in print including a second one written in collaboration with\nShoda\n. Experience abroad was important to leading Japanese mathematicians in this period and Nakayama followed this pattern spending time in the United States having been invited to the Institute for Advance Study at Princeton.\nBefore Nakayama left for the United States he had been ill and had contracted tuberculosis. He had to have a medical examination before being allowed to go abroad but he persuaded the doctor who did the examination not to mention tuberculosis in his report.\n[\nAfter Nakayama's early death, many felt that this doctor was to blame for covering up his tuberculosis at a young age.\n]\nIt was in September\n1937\nthat Nakayama arrived in Princeton and there he met a number of leading algebraists such as\nHermann Weyl\n,\nEmil Artin\nwho had just emigrated to the United States, and\nClaude Chevalley\nwho arrived in Princeton in\n1938\n.\nRichard Brauer\nwas by this time a professor at Toronto and he invited Nakayama to make two research visits to Toronto during his time in the United States, When he visited\nBrauer\n, he become inspired to work on group representations, publishing articles such as\nSome studies on regular representations, induced representations and modular representations\n(1938)\nand\nA remark on representations of groups\n(1938)\n. While with\nBrauer\n, he also met Cecil J Nesbitt,\nBrauer\n's first doctoral student in Toronto, and Nakayama and Nesbitt collaborated on the paper\nNote on symmetric algebras\n(1938)\n.\nIn\n1939\nNakayama published the first part of his paper\nOn Frobeniusean Algebras\nin the\nAnnals of Mathematics\n. It was in\n1939\n, after spending two years in North America, that he returned to Osaka University. In\n1941\nhe submitted the two parts of the paper\nOn Frobeniusean Algebras\n(\nthe second part was published in the\nAnnals of Mathematics\nin\n1941)\nfor the degree of\nRigakuhakushi\n(\ndoctorate\n)\nwhich was conferred on him in that year. In\n1942\nhe left Osaka to take up an appointment as an associate professor at the Nagoya Imperial University which had been founded in\n1939\n. He was promoted to a full professor after two years at Nagoya University\n[\n1\n]\n:-\nDuring the difficult times of World War II he continued his pioneering works in mathematics.\nHis second book,\nLattice Theory\n, was published during the war years in\n1944\n. By this time he had nearly\n50\npublications to his name including his first with Goro Azumaya. Together with Azumaya, Nakayama worked on the representation theory of algebras, particularly\nFrobenius\nalgebras. They wrote three joint papers on their work and published the book\nAlgebra. Theory of rings\nin Japanese in\n1954\n.\nMasatoshi Gündüz Ikeda\nwrites in a review:-\nThis book ... is devoted to a systematic presentation of the theory of associative rings, a subject which has developed remarkably since the\n1940\n's. The contents are divided into two parts. The first part, \"general structural theory\", written by the first author\n[\nNakayama\n]\n, consists of chapters\n1\n-\n12\nand is mainly concerned with the theory of rings without finiteness assumptions. The second part \"algebras and\nrepresentation theory\n\", written by the second author\n[\nAzumaya\n]\n, consists of chapters\n13\n-\n17\nand is mainly devoted to the theory of algebras and their representations.\nThe first part of the book, written by Nakayama on the structure of rings, is similar to the famous text by\nNathan Jacobson\n. Although the second part was written by Azumaya, it included much of their joint work on the representation theory of algebras.\nNakayama spent further time on extended research visits. In\n1948\nand\n1949\nhe was in the United States, at the University of Illinois, and, during\n1953\nand\n1955\n, he spent time at Hamburg University in Germany, and spent a second period at the Institute for Advanced Study at Princeton. He received many honours for his achievements. For example, in\n1947\nhe received\n(\nwith his collaborator Goro Azumaya\n)\na Chubu Nippon Bunka Sho in recognition of his research in the theory of infinite dimensional algebras. It was for his research on the theory of rings and representations that the\nJapan Academy of Science\nawarded him a Gakushi-in shou\n(\nJapan Academy\nPrize\n)\nin\n1953\nand, ten years later, he was elected a member of the\nJapan Academy\n.\nThe obituary\n[\n1\n]\nlists six books and\n122\npapers written by Nakayama. This level of productivity is all the more remarkable when one realises that he achieved this despite severe health problems. As the tuberculosis became worse, he refused to give up his work and continued to come to the mathematics department at Nagoya University. He was so short of breath that chairs were placed on each floor so the he could rest while moving around the building. Even when he was eventually confined to bed he did not give up mathematics but read\nGrothendieck\n's work on\nalgebraic geometry\n. He continued to publish research up to the time of his death, his last paper\nClass group of cohomologically trivial modules and cyclotomic ideals\nappearing in the journal\nActa Arithmetica\nin\n1964\n, the year in which he died from tuberculosis.\nGiven these heath problems and the remarkable research achievements that he managed to keep up, it is all the more amazing that he was able to devote time to other matters\n[\n1\n]\n:-\nIn addition to his scientific and educational activities great importance must be attached to the indefatigable labors which he expended for the development of the Mathematical Institute of the Nagoya University. Then he was one of the founders and the editor-in-chief of the 'Nagoya Mathematical Journal'. He was also an always enthusiastic and active member of the Mathematical Society of Japan, under whose auspices he often lectured in many towns of this country. His widespread activity also included his work as the cooperating editor of the 'Proceedings' of the\nMathematical Society of Japan\nand 'Acta Arithmetica', and as a reviewer for the 'Mathematical Reviews' and for the 'Zentralblatt für Mathematik'.\nAs to his character, we quote again from\n[\n1\n]\n:-\nHe was a man of rare nobility of mind and great kindness whose life was consumed in incessant labors. His gracious spirit and his modest sympathetic and self-effacing personality will remain an unforgettable and shining example.\nFinally we mention that his name is well-known today among algebraists for 'Nakayama's lemma' is named after him.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Number Theory"
  ]
}