{
  "nome_completo": "Tadeusz Boleslaw Ślebarski",
  "nome_curto": "Tadeusz Boleslaw Ślebarski",
  "ano_nascimento": "1914",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slebarski/",
  "lugar_nascimento": "Komorowice, Poland",
  "lugar_morte": "Kirkcaldy, Scotland",
  "biografia": "Tadeusz Boleslaw Ślebarski\nwas born on\n14\nAugust\n1914\nin Komorowice, Poland. This village is in Bielsko-Biała in southern Poland. He was the son of Władysław Zygmunt Ślebarski and Helena Zuzanna Gacek. Władysław Ślebarski was born in Brzeszcze, Poland, on\n13\nJuly\n1886\n. He became a school teacher and he married Helena, who was born on\n1\nJune\n1890\nin Komorowice, on\n8\nAugust\n1913\n. Tadeusz was their first son and a second son, Władysław Jan Ślebarski, was born in Komorowice on\n12\nApril\n1916\n. Władysław, Tadeusz's father, had enlisted as a volunteer in the Austrian army in\n1914\nto fight for a free Poland and was sent to the eastern front. At that time the family were living in Malec where Władysław was a temporary teacher. In\n1915\nTadeusz's mother left Malec and, with her young son, returned to the family home in Komorowice where her second son was born. On\n13\nJuly\n1916\nTadeusz's father was killed during the fighting of World War I. Helena was left to bring up her two young boys on her own, an extremely difficult task at that time.\nTadeusz Ślebarski\nwas to become my\n[\nEFR\n]\nfather-in-law so, throughout this biography I will refer to him as Tadeusz.\nTadeusz and his brother Władysław finished their secondary education in the Adama Asnyka High School in Bielsko-Biała. Tadeusz then entered the Jagiellonian University in Kraków where he began his studies in mathematics and astronomy. The professor of astronomy at the Jagiellonian University was\nTadeusz Banachiewicz\n(1882\n-\n1954)\nwho had been appointed to the chair in\n1919\n.\nBanachiewicz\nwas delighted with his young pupil Tadeusz, who was called up for military service in\n1938\nbefore completing his studies. He joined the Polish Army in\n1939\nand the German invasion of Poland in that year ended any chance that he might return to his studies. Tadeusz escaped from Poland while\nBanachiewicz\nwas arrested by the Nazis, along with other members of the Faculty of the Jagiellonian University, on\n6\nNovember\n1939\n.\nBanachiewicz\nwas taken to the Sachsenhausen Concentration Camp near Berlin where he spent three months.\nQuite how Tadeusz managed to escape to France is not known but he was evacuated from France in\n1940\nand arrived in St Andrews with other members of the Polish Army and stationed in the St Andrews area for the remainder of the war. He was, therefore, among the first of the Poles who had escaped after the German invasion of Poland to arrive in St Andrews and they were housed in the University Observatory which had been completed in December\n1939\n. In November\n1943\nTadeusz entered the University of St Andrews and was awarded an M.A. in\n1945\n. He continued to take honours courses in mathematics\n(\nnamely Geometry, Algebra, Analysis and Special Functions\n)\nand astronomy. He was taught mathematics by\nWalter Ledermann\n, a German Jew who had escaped from the Nazis in January\n1934\n,\nDan Rutherford\n, and the Regius Professor of Mathematics\nHerbert Turnbull\n. There were only six mathematics students in his class, and one of his fellow students was\nSandy Green\nwho went on to become one of the leading British mathematicians. Tadeusz was taught astronomy by\nFinlay Freundlich\n, a German with a Jewish wife who had also fled from the Nazis. Tadeusz graduated with an honours degree in\n1947\nafter an outstanding performance in astronomy.\nTadeusz married Giuliana Salvatoré\n(\nborn\n1915\nin Scoonie, Leven, to Vincent Salvatoré\n(\nborn\n1889)\nand Francesca Ferdinando\n(\nborn\n1890))\n. Their daughter Helena Francesca was born on\n12\nJune\n1945\n. I\n[\nEFR\n]\nmarried Helena in\n1970\n.\nAt the beginning of the academic year\n1947\n-\n48\nTadeusz began his studies as a research student in astronomy but six months later, in April\n1948\n, he was appointed as an Assistant in Astronomy after the first assistant, Ian Campbell, resigned to take a position with the Admiralty. In October\n1950\nhe was promoted to Lecturer in Astronomy and in\n1951\nhe was elected a fellow of the\nRoyal Astronomical Society\n. One of his tasks at the Observatory was to monitor each day the two Master Clocks, one of which recorded Greenwich Mean Time and the other Local Sidereal Time, using the Greenwich Time Signal and record how much they deviated from their correct settings.\nJaroslav Cisar\n(1894\n-\n1983)\njoined the Department for a short while in\n1951\nand after that went to the Mills Observatory in Dundee but continued to observe in the St Andrews Observatory. Tadeusz learnt the skills of astronomical photography from Cisar and began his own observing programme in January\n1954\n. Tadeusz observed asteroids, or minor planets.\nFinlay Freundlich\n, by now\nNapier\nProfessor of Astronomy, was forced to retire due to his age in\n1955\nbut continued as Directory of the Observatory and an assistant lecturer for two further years. Walter Stibbs\n(1919\n-\n2010)\nwas appointed as the next\nNapier\nProfessor of Astronomy. A quite difficult situation arose for Tadeusz since he had been very close to\nFreundlich\nand extremely grateful to him for appointing him as an assistant in\n1948\n. Stibbs, worrying that\nFreundlich\nwas still exerting an influence on the Department of Astronomy, insisted that Tadeusz had no further contact with\nFreundlich\n.\nIn\n1962\nStibbs encouraged Tadeusz to apply for a research fellowship at Yale University Observatory in the United States. He was awarded a one year fellowship, extendable for a second year and took up the position at Yale in January\n1963\n. There he continued his work on the orbits of minor planets but family reasons forced him to return home after only eight months in August\n1963\n. He continued the work on computing orbits of minor planets over many years. Although he worked extremely hard on this project and produced outstandingly accurate results, for some reason he never published them or even communicated them to the Minor Planet Center at the Smithsonian Astrophysical Observatory in the USA.\nTadeusz was promoted to Senior Lecturer in October\n1966\nand continued to hold this position until he retired in\n1979\n. He continued to live in St Andrews and died on\n7\nFebruary\n2003\n. Among his hobbies were philosophy, chess and playing the violin.\nNot only did Tadeusz become my\n[\nEFR\n]\nfather-in-law in\n1970\n, but several years before that he taught a course that I attended as an undergraduate in\n1964\n-\n65\n. This was a course on mathematical astronomy where I  learnt spherical trigonometry for the first time. Tadeusz was an extremely clear lecturer with an obvious love for mathematics and its applications to astronomy. His lectures were carefully prepared and he clearly enjoyed teaching and interacting with students. In the same class with me was Fred Watson who became a well-known astronomer and the author of a number of popular astronomy books. Watson writes\n[\n2\n]\n:-\nSlebarski was a well-respected man, gentle in manner and generous in spirit. He was known throughout the university simply as Mr Slebarski, and his lectures were models of clarity because, having a less-than-perfect command of English, he wrote absolutely everything on the blackboard. ... Slebarski has a special place in my own history, because a quarter of a century after his appointment ... he became my research supervisor when I embarked on a Master's degree at St Andrews. We worked ... on asteroid orbits, and I used the\nScott Lang\nTelescope to make my observations. With his customary good nature, Slebarski tolerated the fact that I was far from a model student. I still remember his delight when, years later, I finally submitted my thesis and graduated with the degree.",
  "math_areas": [
    "Analysis"
  ]
}