{
  "nome_completo": "Terence Chi-Shen Tao",
  "nome_curto": "Terence Tao",
  "ano_nascimento": "1975",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tao/",
  "lugar_nascimento": "Adelaide, South Australia, Australia",
  "lugar_morte": null,
  "biografia": "Terence Tao\nis known to his friends and colleagues as Terry Tao. His father, Billy Tao, is a Chinese-born paediatrician who has undertaken research on educating gifted children and on autism. Terry's mother, Grace, was born in Hong Kong and has a university degree in physics and mathematics. Billy and Grace met while they were studying at the University of Hong Kong and they emigrated to Australia in\n1972\n. Grace Tao taught physics, chemistry, science and mathematics in various secondary schools in Hong Kong before she emigrated to Australia and, once in Australia, also taught in secondary schools there. Terry, the subject of this biography, is their eldest child, having two younger brothers Trevor\n(\ntwo years younger than Terry\n)\nand Nigel\n(\nfour years younger than Terry\n)\n.\nBoth Trevor and Nigel are extremely talented, and they went on to be awarded Ph.D.'s and have research careers. Trevor Tao\n(\nborn\n22\nNovember\n1977)\nwas diagnosed from age two as autistic. He studied at the University of Adelaide for a double degree, B.Sc.\n(\nMathematics and Computer Science\n)\nwith B.Mus.\n(\ndouble major in piano performance and composition\n)\n, which he completed in\n2000\n. He is an international chess master, highest chess rating\n2440\n, who also won prizes in mathematics and music\n(\nclassical music composition\n)\nwhen he was a teenager. Nigel was awarded a BSc\n(\nHons\n)\nfrom the Australian National University in Computer Science in\n2000\n. He worked for WhizBang! Labs in Pittsburgh, but they closed in May\n2002\n. In\n2006\nhe began working for Google in Sydney. Let us return to our biography of Terry Tao.\nWhen Terry was two years old his parents realised that he was different from other children. They saw him teaching five year old children to spell and to add numbers and, when they asked him how he had learnt these skills, he replied that he had been watching Sesame Street on television. When he was three and a half years old his parents sent him to a private school but, six weeks later, they realised that he was not ready for schooling and also that the teachers did not know how to teach someone like him. So they removed him from the school and he did not start schooling again until he was, like other children, five years old. The article\n[\n21\n]\ngives an evaluation of Terry's mathematical abilities just before his eighth birthday by which time he was attending Blackwood High School, Adelaide. Ken Clements writes that when he went into his home, Terry was:-\n... sitting in the far corner of a room reading a hardback book with the title 'Calculus'. Terence was small, even for a seven-year-old. After meeting his two brothers, I was accompanied by Terence to his father's study, where, after a brief chat, I began my usual assessment procedure for exceptionally bright primary school-age children.\nClements discovered that Terry knew the definition of a group and could solve graph sketching problems using the differential calculus. He wondered how much his mother was teaching him but found that her role\n[\n21\n]\n:-\n... is more one of guiding and stimulating Terence's development than one of teaching him. She said that Terence likes to read mathematics by himself, and he often spent three or four hours after school reading mathematics textbooks.\nIn\n1984\n, when Tao was nine years old, his father took him on a trip to meet some of the world's top mathematicians. They went to the Institute for Advanced Study at Princeton where Tao was interviewed by\nCharles Fefferman\nand\nEnrico Bombieri\n.\nFefferman\nasked Tao the following question\n[\n8\n]\n:-\nImagine that you are trapped in a room with a hungry lion. Both you and the lion are represented as points in space. Suppose the lion can run faster than you. Suppose you can run faster than the lion. Suppose you and the lion can run at exactly the same speed. How do you avoid being eaten?\nAlthough nobody can now remember Tao's answer,\nFefferman\nsaid\n[\n8\n]\n:-\nI was impressed that a\n9\n-year-old kid could come up with ideas to a maths problem that wasn't a conventional thing he had learned in any class.\nBy the time Terry reached the age of eleven, he was dividing his time between his studies at Blackwood High School, which he attended from\n1983\nto\n1988\n, and taking classes at Flinders University in Adelaide where he was taught by Garth Gaudry\n(1941\n-\n2012)\n. Even earlier, at the age of ten, he began participating in International Mathematical Olympiads. He won a bronze medal in\n1986\n, a silver medal in\n1987\nand a gold medal in\n1988\n, becoming the youngest ever gold medalist in the Mathematical Olympiad. But we should not get the idea that every school subject was easy for Tao. He was brilliant at subjects with precise rules, like mathematics and Latin, but when his English teachers asked the class to write an essay about \"home\", he was totally stumped.\nIn\n1989\n, at the age of fourteen he began full-time university studies at Flinders University and, in\n1990\nwhen a\n15\nyear old schoolboy, wrote his first book\nSolving mathematical problems. A personal perspective\n. In it Tao writes that a solution to a problem:-\n... should be relatively short, understandable, and hopefully have a touch of elegance. It should be fun to discover.\nThe first edition was published in\n1992\nwith a second edition in\n2006\n; you can read the\n1990\nPreface, the Preface written in\n2005\n, and extracts from reviews of the\n2006\nedition at\nTHIS LINK\n.\nHe was awarded a B.Sc. with Honours in December\n1991\n. He said\n[\n109\n]\n:-\nI still remember the realisation in college at Flinders University in Australia that mathematics was not just an abstract game of symbols but could be used as a tool to analyse and understand the modern world.\nHe wrote about this moment of realisation in\n[\n89\n]\n:-\nWhy are some statistics trustworthy and some not? Why are some investment strategies sound, and others risky? How come a computer can search the entire internet for you in a matter of seconds, but cannot read a printed word if it is even just slightly distorted or blurred? How come our modern array of satellites can tell millions of drivers their location with amazing accuracy, but cannot correctly predict the weather a fortnight into the future? Knowledge of mathematics can answer these questions, and make the world comprehensible and orderly rather than mysterious and capricious. Once I saw the power of this knowledge, and the satisfying feeling when everything \"clicks\" and one sees a confusing problem resolve itself into a clear solution, I was hooked for life. I wanted to use mathematics to explore and understand as much of the world as I could.\nNot everything he did as an undergraduate went well, however\n[\n116\n]\n:-\nAt university, I had a Fortran class that I rebelled against, on the grounds that I already knew BASIC; I remember defiantly writing my final assignment code in BASIC instead of Fortran\n(\nand subsequently failing the class\n)\n.\nHe continued to study at Flinders University for a Master's Degree advised by Garth Gaudry. Tao wrote in\n[\n88\n]\n:-\nI knew Garth ever since I was an undergraduate at Flinders University. He was head of school then\n(\na position roughly equivalent to department chair in the US\n)\n, but still was able to spare an hour a week to meet with me to discuss real analysis, as I worked my way through\nWalter Rudin\n's \"Real and complex analysis\" and then\nElias Stein\n's \"Singular integrals\", and then eventually completed a masters thesis under his supervision on\nClifford\n-valued singular integrals.\nTao was awarded the degree in August\n1992\nhaving written the thesis\nConvolution operators generated by right-monogenic and harmonic kernels\n. He was awarded the University Medal by Flinders University and a Fulbright Postgraduate Scholarship to enable him to undertake research in the United States. He explained in\n[\n109\n]\n:-\nI didn't really complete two degrees in four years; I attended Flinders part-time before my formal enrolment, and they decided to count those courses toward my degree.\nTao went to the United States in\n1992\nwhen he was sixteen years old to begin graduate school\n[\n8\n]\n:-\nGraduate school was Tao's first time away from home, and the transition proved difficult. His father stayed with him for the first week of classes to teach his son how to perform such basic tasks as doing laundry and opening a bank account. In his free time, Tao joined the Film Club and played table football, online bridge, and computer games.\nHe began to undertake research at Princeton University advised by\nElias Stein\n. At first things were difficult since Tao had found things so easy up until then that he had not developed any study skills. Scraping through an examination, he resolved to work harder. He writes in\n[\n90\n]\n:-\nMy weekly meetings with\nEli\nwould tend to go something like this: I would report on all the many different things I had tried over the past week, without much success, to solve my current research problem;\nEli\nwould listen patiently to everything I said, concentrate for a moment, and then go over to his filing cabinet and fish out a preprint to hand to me, saying, \"I think the authors in this paper encountered similar problems and resolved it using Method X.\" I would then go back to my office and read the preprint, and indeed they had faced something similar and I could often adapt the techniques there to resolve my immediate obstacles\n(\nonly to encounter further ones for the next week, but that's the way research tends to go, especially as a graduate student\n)\n. Amongst other things, these meetings impressed upon me the value of mathematical experience, by being able to make more key progress on a problem in a handful of minutes than I was able to accomplish in a whole week.\nAt this stage in his career he spent time both in Australia and in the United States. He was an assistant researcher at Flinders Medical Centre\n(1992\n-\n94)\n, working as a computer programmer in his father's research group, and also as an assistant researcher at Princeton University during\n1993\n-\n94\n. In\n1995\nhe was awarded a Sloan Postgraduate Fellowship. He was awarded his doctorate in June\n1996\nfor his thesis\nThree regularity results in harmonic analysis\n. In\n1996\nhis research papers began to appear in print, four papers being published in that year. These are:\nWeak-type endpoint bounds for Riesz means\n;\n(\nwith Andrew C Millard\n)\nOn the structure of projective group representations in quaternionic Hilbert space\n;\nOn the almost everywhere convergence of wavelet summation methods\n; and\nConvolution operators on Lipschitz graphs with harmonic kernels\n.\nFollowing the award of his doctorate, Tao was appointed\nHedrick\nAssistant Professor at the University of California at Los Angeles, a position he held from\n1996\nto\n1998\n. He continued as an assistant professor at the University of California at Los Angeles where, at the age of twenty-four, he was promoted to full professor in\n2000\n. This made him the youngest person ever to be appointed as a full professor at UCLA.\nWhen he began lecturing at UCLA, he taught a class containing a student named Laura who\n[\n114\n]\n:-\n... doesn't remember who instigated the coffee date they went on some time after she started slipping homework under her professor's office door. She liked how relaxed and stable Tao seemed.\nShe went on to graduate as an electrical engineer and worked at NASA's Jet Propulsion Laboratory at the California Institute of Technology. Tao and Laura were married in\n2002\nand they have two children, William Tao and Madeleine Tao. When the article\n[\n114\n]\nwas written\n(\nMarch\n2015)\n, William Tao was eleven years old and Madeleine Tao was three years old. William, at age eleven, was\n[\n114\n]\n:-\n... learning piano, guitar and clarinet. One day he was scouted by a talent agency in a mall - \"We like his face,\" they said - and he has appeared in commercials for Ford and Disney. \"He's different from me in some ways,\" says Tao, who likes to watch Doctor Who with his son. \"He likes maths, he's good at it, but he likes free-form; he likes things that I was never into, like writing. I was never very good at school with ... humanities ... anything which was more a matter of opinion.\"\nIn\n2007\nTao was named the James and Carol Collins Professor at UCLA.\nIt is very difficult to write a biography of someone who is at the height of their creative powers as Tao is. Anything that one writes about his research contributions will be quickly outdated as he continues to contribute major results in a remarkably wide range of different areas. Yet at a young age, he produced a fantastic collection of results, leading to the award of all the top prizes in mathematics, and this outstanding mathematician continues to make major advances in diverse areas of mathematics.\nBefore looking at his contributions we note the prizes and awards he has received\n(\nalthough again this list, compiled in November\n2023\nis bound to become rapidly outdated as he continues to receive awards\n)\n. These include: the\nSalem\nPrize\n(2000)\n; the\nBôcher\nMemorial Prize from the\nAmerican Mathematical Society\n(2002)\n; the Clay Research Award from the Clay Mathematical Institute\n(2003)\n; the Levi L Conant Award from the\nAmerican Mathematical Society\n(2005)\n; the\nAustralian Mathematical Society\nMedal\n(2005)\n; the ISAAC Award from the International Society of Analysis, its Application and Computation\n(2005)\n; the SASTRA\nRamanujan\nPrize\n(2006)\n; the\nFields\nMedal\n(2006)\n; the\nOstrowski\nPrize from the\nOstrowski\nFoundation\n(2007)\n; the Alan T Waterman Award from the National Science Foundation\n(2008)\n; the Onsager Medal\n(2008)\n; the Information Theory Society Paper Award\n(2008)\n; the Convocation Award from Flinders University Alumni Association\n(2008)\n; the King Faisal International Prize\n(\nMathematics\n)\n(2010)\n; the Nemmers Prize in Mathematics from Northwestern University\n(2010)\n; the\nGeorge Polya\nPrize from the\nSociety for Industrial and Applied Mathematics\n(2010)\n; the Crafoord Prize\n(2012)\n; the Breakthrough Prize in Mathematics\n(2014)\n; the Royal Medal for physical sciences from the\nRoyal Society of London\n; the PROSE award in the category of \"Mathematics\"\n(2015)\n; the\nRiemann\nPrize\n(2019)\n; the Princess of Asturias Award for Technical & Scientific Research\n(2020)\n; the\nJanos Bolyai\nInternational Mathematical Prize by the\nHungarian Academy of Sciences\n(2020)\n; the United Sigma Intelligence Association Award for Mathematics\n(2021)\n; the Education and Research Award by Advance Global Australian Awards\n(2022)\n; Global Australian of the Year Award\n(2022)\n, and the Grande Médaille of the\nFrench Academy of Sciences\n(2022)\n.\nFor more information about these awards to Tao, see\nTHIS LINK\n.\nIn addition he has received a Sloan Foundation research Fellowship\n(1999\n-\n2001)\n, a Foundation Fellowship from the David and Lucille Packard Foundation\n(1999\n-\n2006)\n, a MacArthur Fellowship from the MacArthur Foundation\n(2007\n-\n11)\n, and appointed Simons Investigator\n(2012)\n. He has been elected to the\nAustralian Academy of Sciences\n(2006)\n, to a fellowship of the\nRoyal Society\n(2007)\n, to the\nNational Academy of Sciences\n(2008)\n, and to the\nAmerican Academy of Arts and Sciences\n(2009)\n. He was a finalist in Australian of the Year in\n2007\n.\nTo gain some insight into his research contributions, let us first note that he received the\n2006\nFields\nmedal:-\n... for his contributions to partial differential equations, combinatorics, harmonic analysis and additive number theory.\nThe article\n[\n1\n]\n, describing the award of the\nFields\nMedal, gives this overview:-\nTerence Tao is a supreme problem-solver whose spectacular work has had an impact across several mathematical areas. He combines sheer technical power, an other-worldly ingenuity for hitting upon new ideas, and a startlingly natural point of view that leaves other mathematicians wondering, \"Why didn't anyone see that before?\" At\n31\nyears of age, Tao has written over eighty research papers, with over thirty collaborators, and his interests range over a wide swath of mathematics, including harmonic analysis, nonlinear partial differential equations, and combinatorics. \" I work in a number of areas, but I don't view them as being disconnected,\" he said in an interview published in the Clay Mathematics Institute Annual Report. \"I tend to view mathematics as a unified subject and am particularly happy when I get the opportunity to work on a project that involves several fields at once.\"\nLet us note here that he has now greatly exceeded the eighty research papers mentioned in the\n2006\narticle with MathSciNet recording a list of\n353\npublications between\n1996\nand\n2023\n. The Press Release which announced the award of the\nFields\nMedal to Tao listed his accomplishments in a number of areas which had led to the award of this most prestigious mathematical award. First it describes his work with Ben Green on the distribution of prime numbers. They proved the remarkable result that the primes contain arithmetic progressions of any length. He gave the André-Aisenstadt Lecture on\nLong Arithmetic Progressions in the Primes\nat the University of Montreal on Monday\n3\nApril\n2006\n. Here is his abstract\n[\n4\n]\n:-\nA famous and difficult theorem of Szemerédi asserts that every subset of the integers of positive density will contain arbitrarily long arithmetic progressions; this theorem has had four different proofs\n(\ngraph-theoretic, ergodic, Fourier analytic, and hypergraph-theoretic\n)\n, each of which has been enormously influential, important, and deep. It had been conjectured for some time that the same result held for the primes\n(\nwhich of course have zero density\n)\n. I shall discuss recent work with Ben Green obtaining this conjecture, by viewing the primes as a subset of the almost primes\n(\nnumbers with few prime factors\n)\nof positive relative density. The point is that the almost primes are much easier to control than the primes themselves, thanks to sieve theory techniques such as the recent work of Goldston and Yildirim. To \"transfer\"\nSzemerédi\n's theorem to this relative setting requires that one borrow techniques from all four known proofs of\nSzemerédi\n's theorem, and especially from the ergodic theory proof.\nThis fantastic achievement, however, is only one of many, and there is so much more to say. An area to which Tao has made many contributions is that of the Kakeya problem. This problem, originally posed in two dimensions, asked for the minimum area of a shape in which one can rotate a needle through\n180\n°. The answer is rather surprising, in fact you can make the area less than any chosen number. Tao has worked on the\nn\nn\nn\n-dimensional Kakeya problem where again the minimum volume can be made as small as one chooses, but the fractal dimension of the shape is unknown. This problem sounds rather specialised, but on the contrary there are surprising connections to\nFourier\nanalysis and nonlinear waves. Another area in which Tao has worked is solving special cases of the equations of general relativity describing gravity. Imposing cylindrical symmetry on the equations leads to the \"wave maps\" problem where, although it has yet to be solved, Tao's contributions have led to a great resurgence of interest since his ideas seem to have made a solution possible. Yet another area where Tao has introduced novel ideas, giving the subject a whole new look, is the theory of the nonlinear\nSchrödinger\nequations. These equations have considerable practical applications and again Tao's insights have shed considerable light on the behaviour of a particular\nSchrödinger\nequation.\nLet us mention briefly some other remarkable contributions by Tao. In\n2015\nhe solved the\nErdős\ndiscrepancy problem, proving the conjecture made by\nErdős\nin\n1932\n. In\n2016\nhe produced a new approach to the\nNavier\n-\nStokes\nequations which describe fluid flow. There are important questions regarding these equations which figure in the Clay Mathematics Institute's seven Millennium Problems. Tao has continued working on these equations making further major progress in\n2019\n. Also in\n2019\n, Tao made progress in solving the\nCollatz\nconjecture. Given any integer\nn\ni\nn_{i}\nn\ni\n​\n, then if\nn\ni\nn_{i}\nn\ni\n​\nis even, define\nn\ni\n+\n1\n=\n1\n2\nn\ni\nn_{i+1} = \\large\\frac{1}{2}\\normalsize n_{i}\nn\ni\n+\n1\n​\n=\n2\n1\n​\nn\ni\n​\n, if\nn\ni\nn_i\nn\ni\n​\nis odd, define\nn\ni\n+\n1\n=\n3\nn\ni\n+\n1\nn_{i+1} = 3n_{i} + 1\nn\ni\n+\n1\n​\n=\n3\nn\ni\n​\n+\n1\n. The\nCollatz\nconjecture, made by\nLothar Collatz\nin\n1937\n, states that given any integer\nn\n0\nn_{0}\nn\n0\n​\nthe sequence given by the above procedure always reaches\n1\nin a finite number of steps\n[\n36\n]\n:-\nMathematicians regard the\nCollatz\nconjecture as a quagmire and warn each other to stay away. But now Terence Tao has made more progress than anyone in decades.\nDespite Tao's partial result, the conjecture remains open.\nIn\n2022\n, Tao, together with Rachel Greenfeld, found a counterexample to a tiling conjecture. In\n2016\nSiddhartha Bhattacharya proved that a single tile cannot tile the plane aperiodically but not periodically if only translations of the tile are allowed. It was conjectured that this would be true in higher dimensions, but Tao and Greenfeld found a single tile, full of twists and holes, which lives in a very high dimensional space\n(\nperhaps of dimension greater than\n2\n10\n0\n100\n2^{100^{100}}\n2\n1\n0\n0\n1\n0\n0\n)\nwhich tiles that space aperiodically but not periodically.\nA recent\n(2023)\npaper by Tao, in collaboration with Tamar Ziegler, proves the following theorem\n[\n91\n]\n:-\n... there exist infinite sets\nA\n=\n{\na\n1\n,\na\n2\n,\n.\n.\n.\n}\nA = \\{ a_{1}, a_{2}, ... \\}\nA\n=\n{\na\n1\n​\n,\na\n2\n​\n,\n.\n.\n.\n}\nand\nB\n=\n{\nb\n1\n,\nb\n2\n,\n.\n.\n.\n}\nB = \\{b_{1}, b_{2}, ... \\}\nB\n=\n{\nb\n1\n​\n,\nb\n2\n​\n,\n.\n.\n.\n}\nof natural numbers such that\na\ni\n+\nb\nj\na_{i} + b_{j}\na\ni\n​\n+\nb\nj\n​\nis prime whenever\n1\n≤\ni\n<\nj\n1 ≤ i < j\n1\n≤\ni\n<\nj\n.\nOne might imagine that with his remarkable output of research papers, Tao would not find time to write books. However, this would be entirely wrong since he has produced both research monographs and undergraduate texts. Let us now look at these. In\n2006\nTao published\nSolving mathematical problems\nwhich we mentioned above. In the same year he published a\n2\n-volume textbook\nAnalysis\n.\nFor more information about this book, see\nTHIS LINK\n.\nAlso in\n2006\n, Tao published\nNonlinear dispersive equations\n, but, amazingly, this still does not complete the list of Tao's\n2006\nbooks for in that year, in collaboration with Van Vu, he published\nAdditive combinatorics\n.\nFor more information about these two books, see\nTHIS LINK\n.\nIt will come as no surprise to learn that Tao, who is such an innovator in everything he does, has created a new style of book. The textbook and research monographs described above are innovative in their approach but are traditional types of books. In\n2008\nTao published the book\nStructure and randomness. Pages from year one of a mathematical blog\nand, in\n2009\n, two similar books\nPoincaré's legacies, pages from year two of a mathematical blog\nPart I and Part II. You can read Tao's own thought on these blogs in the extracts from the Prefaces given at\nTHIS LINK\n.\nIn\n2010\nthe next in Tao's series was published\nAn epsilon of room, I: real analysis. Pages from year three of a mathematical blog\n. When we wrote the first version of Tao's biography in\n2011\nwe anticipated a long and fascinating series of books that would appear over the next years. Indeed, we were correct! He published\nAn introduction to measure theory\n(2011)\n,\nTopics in random matrix theory\n(2012)\n,\nHigher order Fourier analysis\n(2012)\n,\nCompactness and contradiction\n(2013)\n,\nHilbert's fifth problem and related topics\n(2014)\n, and\nExpansion in finite simple groups of Lie type\n(2015)\n. We note that\nHilbert's fifth problem and related topics\nwas awarded the\n2015\nProse Award for Best Mathematics Book. There is detailed information about these books, including Tao's Prefaces and extracts from reviews, at\nTHIS LINK\n.\nWhen asked about hobbies in the interview\n[\n116\n]\n, he replied:-\nWith work and family there isn't as much time for fun these days - pretty much restricted now to activities that can be done on my phone in a few minutes. For instance in recent years I spend a few minutes each day learning a language\n(\ncurrently Hebrew\n)\nthrough an app. ... I play a little piano, although at this point I think both my kids surpass me in this.\nLet us end with a quote from\n[\n8\n]\n:-\nTao says that his insights arrive, when they do, after much hard work. He gets ideas from reading, from other mathematicians, from taking long walks. Sometimes, one idea reminds him of a similar problem he saw somewhere else that might prove useful now. Most paths lead nowhere, but he learns something even in the cul de sacs. \"Once you solve a problem,\" he continues, \"you tend to remember only the short path that got you from A to B. You forget all the dead ends. It's a bit of a shame. It gives the wrong impression that people who are good at mathematics only choose the right steps. But there is a lot of trial and error and really terribly embarrassing ideas. Sometimes there is a 'eureka' moment, but it's more of a hitting-your-head moment: 'Of course, why was I so dense?'",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Combinatorics",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}