{
  "nome_completo": "Thales of Miletus",
  "nome_curto": "Thales of Miletus",
  "ano_nascimento": "624 BC",
  "ano_morte": "547 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thales/",
  "lugar_nascimento": "Miletus, Asia Minor (now Turkey)",
  "lugar_morte": "Miletus, Asia Minor (now Turkey)",
  "biografia": "Thales of Miletus\nwas the son of Examyes and Cleobuline. His parents are said by some to be from Miletus but others report that they were Phoenicians. J Longrigg writes in\n[\n1\n]\n:-\nBut the majority opinion considered him a true Milesian by descent, and of a distinguished family.\nThales seems to be the first known Greek philosopher, scientist and mathematician although his occupation was that of an engineer. He is believed to have been the teacher of\nAnaximander\n(611\nBC -\n545\nBC\n)\nand he was the first natural philosopher in the Milesian School. However, none of his writing survives so it is difficult to determine his views or to be certain about his mathematical discoveries. Indeed it is unclear whether he wrote any works at all and if he did they were certainly lost by the time of\nAristotle\nwho did not have access to any writings of Thales. On the other hand there are claims that he wrote a book on navigation but these are based on little evidence. In the book on navigation it is suggested that he used the constellation Ursa Minor, which he defined, as an important feature in his navigation techniques. Even if the book is fictitious, it is quite probable that Thales did indeed define the constellation Ursa Minor.\nProclus\n, the last major Greek philosopher, who lived around\n450\nAD, wrote:-\n[\nThales\n]\nfirst went to Egypt and thence introduced this study\n[\ngeometry\n]\ninto Greece. He discovered many propositions himself, and instructed his successors in the principles underlying many others, his method of attacking problems had greater generality in some cases and was more in the nature of simple inspection and observation in other cases.\nThere is a difficulty in writing about Thales and others from a similar period. Although there are numerous references to Thales which would enable us to reconstruct quite a number of details, the sources must be treated with care since it was the habit of the time to credit famous men with discoveries they did not make. Partly this was as a result of the legendary status that men like Thales achieved, and partly it was the result of scientists with relatively little history behind their subjects trying to increase the status of their topic with giving it an historical background.\nCertainly Thales was a figure of enormous prestige, being the only philosopher before\nSocrates\nto be among the Seven Sages.\nPlutarch\n, writing of these Seven Sages, says that\n(\nsee\n[\n8\n]\n)\n:-\n[\nThales\n]\nwas apparently the only one of these whose wisdom stepped, in speculation, beyond the limits of practical utility, the rest acquired the reputation of wisdom in politics.\nThis comment by Plutarch should not be seen as saying that Thales did not function as a politician. Indeed he did. He persuaded the separate states of Ionia to form a federation with a capital at Teos. He dissuaded his compatriots from accepting an alliance with Croesus and, as a result, saved the city.\nIt is reported that Thales predicted an eclipse of the Sun in\n585\nBC. The cycle of about\n19\nyears for eclipses of the Moon was well known at this time but the cycle for eclipses of the Sun was harder to spot since eclipses were visible at different places on Earth. Thales's prediction of the\n585\nBC eclipse was probably a guess based on the knowledge that an eclipse around that time was possible. The claims that Thales used the Babylonian saros, a cycle of length\n18\nyears\n10\ndays\n8\nhours, to predict the eclipse has been shown by\nNeugebauer\nto be highly unlikely since\nNeugebauer\nshows in\n[\n11\n]\nthat the saros was an invention of\nHalley\n.\nNeugebauer\nwrote\n[\n11\n]\n:-\n... there exists no cycle for solar eclipses visible at a given place: all modern cycles concern the earth as a whole. No Babylonian theory for predicting a solar eclipse existed at\n600\nBC, as one can see from the very unsatisfactory situation\n400\nyears later, nor did the Babylonians ever develop any theory which took the influence of geographical latitude into account.\nAfter the eclipse on\n28\nMay,\n585\nBC\nHerodotus\nwrote:-\n... day was all of a sudden changed into night. This event had been foretold by Thales, the Milesian, who forewarned the Ionians of it, fixing for it the very year in which it took place. The Medes and Lydians, when they observed the change, ceased fighting, and were alike anxious to have terms of peace agreed on.\nLongrigg in\n[\n1\n]\neven doubts that Thales predicted the eclipse by guessing, writing:-\n... a more likely explanation seems to be simply that Thales happened to be the savant around at the time when this striking astronomical phenomenon occurred and the assumption was made that as a savant he must have been able to predict it.\nThere are several accounts of how Thales measured the height of pyramids.\nDiogenes Laertius\nwriting in the second century AD quotes Hieronymus, a pupil of\nAristotle\n[\n6\n]\n(\nor see\n[\n8\n]\n)\n:-\nHieronymus says that\n[\nThales\n]\neven succeeded in measuring the pyramids by observation of the length of their shadow at the moment when our shadows are equal to our own height.\nThis appears to contain no subtle geometrical knowledge, merely an empirical observation that at the instant when the length of the shadow of one object coincides with its height, then the same will be true for all other objects. A similar statement is made by\nPliny\n(\nsee\n[\n8\n]\n)\n:-\nThales discovered how to obtain the height of pyramids and all other similar objects, namely, by measuring the shadow of the object at the time when a body and its shadow are equal in length.\nPlutarch however recounts the story in a form which, if accurate, would mean that Thales was getting close to the idea of similar triangles:-\n... without trouble or the assistance of any instrument\n[\nhe\n]\nmerely set up a stick at the extremity of the shadow cast by the pyramid and, having thus made two triangles by the impact of the sun's rays, ... showed that the pyramid has to the stick the same ratio which the shadow\n[\nof the pyramid\n]\nhas to the shadow\n[\nof the stick\n]\nOf course Thales could have used these geometrical methods for solving practical problems, having merely observed the properties and having no appreciation of what it means to prove a geometrical theorem. This is in line with the views of\nRussell\nwho writes of Thales contributions to mathematics in\n[\n12\n]\n:-\nThales is said to have travelled in Egypt, and to have thence brought to the Greeks the science of geometry. What Egyptians knew of geometry was mainly rules of thumb, and there is no reason to believe that Thales arrived at deductive proofs, such as later Greeks discovered.\nOn the other hand\nB L van der Waerden\n[\n16\n]\nclaims that Thales put geometry on a logical footing and was well aware of the notion of proving a geometrical theorem. However, although there is much evidence to suggest that Thales made some fundamental contributions to geometry, it is easy to interpret his contributions in the light of our own knowledge, thereby believing that Thales had a fuller appreciation of geometry than he could possibly have achieved. In many textbooks on the history of mathematics Thales is credited with five theorems of elementary geometry:-\nA circle is bisected by any diameter\n.\nThe base angles of an isosceles triangle are equal\n.\nThe angles between two intersecting straight lines are equal\n.\nTwo triangles are congruent if they have two angles and one side equal\n.\nAn angle in a semicircle is a right angle\n.\nWhat is the basis for these claims?\nProclus\n, writing around\n450\nAD, is the basis for the first four of these claims, in the third and fourth cases quoting the work\nHistory of Geometry\nby\nEudemus of Rhodes\n, who was a pupil of\nAristotle\n, as his source. The\nHistory of Geometry\nby\nEudemus\nis now lost but there is no reason to doubt\nProclus\n. The fifth theorem is believed to be due to Thales because of a passage from Diogenes Laertius book\nLives of eminent philosophers\nwritten in the second century AD\n[\n6\n]\n:-\nPamphile says that Thales, who learnt geometry from the Egyptians, was the first to describe on a circle a triangle which shall be right-angled, and that he sacrificed an ox\n(\non the strength of the discovery\n)\n. Others, however, including\nApollodorus\nthe calculator, say that it was\nPythagoras\n.\nA deeper examination of the sources, however, shows that, even if they are accurate, we may be crediting Thales with too much. For example\nProclus\nuses a word meaning something closer to 'similar' rather than 'equal- in describing\n(\nii\n)\n. It is quite likely that Thales did not even have a way of measuring angles so 'equal- angles would have not been a concept he would have understood precisely. He may have claimed no more than \"The base angles of an isosceles triangle look similar\". The theorem\n(\niv\n)\nwas attributed to Thales by\nEudemus\nfor less than completely convincing reasons.\nProclus\nwrites\n(\nsee\n[\n8\n]\n)\n:-\n[\nEudemus\n]\nsays that the method by which Thales showed how to find the distances of ships from the shore necessarily involves the use of this theorem.\nHeath\nin\n[\n8\n]\ngives three different methods which Thales might have used to calculate the distance to a ship at sea. The method which he thinks it most likely that Thales used was to have an instrument consisting of two sticks nailed into a cross so that they could be rotated about the nail. An observer then went to the top of a tower, positioned one stick vertically\n(\nusing say a plumb line\n)\nand then rotating the second stick about the nail until it points at the ship. Then the observer rotates the instrument, keeping it fixed and vertical, until the movable stick points at a suitable point on the land. The distance of this point from the base of the tower is equal to the distance to the ship.\nAlthough theorem\n(\niv\n)\nunderlies this application, it would have been quite possible for Thales to devise such a method without appreciating anything of 'congruent triangles'.\nAs a final comment on these five theorems, there are conflicting stories regarding theorem\n(\niv\n)\nas Diogenes Laertius himself is aware. Also even Pamphile cannot be taken as an authority since she lived in the first century AD, long after the time of Thales. Others have attributed the story about the sacrifice of an ox to\nPythagoras\non discovering\nPythagoras\n's theorem. Certainly there is much confusion, and little certainty.\nOur knowledge of the philosophy of Thales is due to\nAristotle\nwho wrote in his\nMetaphysics\n:-\nThales of Miletus taught that 'all things are water'.\nThis, as Brumbaugh writes\n[\n5\n]\n:-\n...may seem an unpromising beginning for science and philosophy as we know them today; but, against the background of mythology from which it arose, it was revolutionary.\nSambursky writes in\n[\n15\n]\n:-\nIt was Thales who first conceived the principle of explaining the multitude of phenomena by a small number of hypotheses for all the various manifestations of matter.\nThales believed that the Earth floats on water and all things come to be from water. For him the Earth was a flat disc floating on an infinite ocean. It has also been claimed that Thales explained earthquakes from the fact that the Earth floats on water. Again the importance of Thales' idea is that he is the first recorded person who tried to explain such phenomena by rational rather than by supernatural means.\nIt is interesting that Thales has both stories told about his great practical skills and also about him being an unworldly dreamer.\nAristotle\n, for example, relates a story of how Thales used his skills to deduce that the next season's olive crop would be a very large one. He therefore bought all the olive presses and then was able to make a fortune when the bumper olive crop did indeed arrive. On the other hand\nPlato\ntells a story of how one night Thales was gazing at the sky as he walked and fell into a ditch. A pretty servant girl lifted him out and said to him \"How do you expect to understand what is going on up in the sky if you do not even see what is at your feet\". As Brumbaugh says, perhaps this is the first absent-minded professor joke in the West!\nThe bust of Thales shown above is in the Capitoline Museum in Rome, but is not contemporary with Thales and is unlikely to bear any resemblance to him.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic"
  ]
}