{
  "nome_completo": "Theodosius of Bithynia",
  "nome_curto": "Theodosius",
  "ano_nascimento": "160 BC",
  "ano_morte": "90 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theodosius/",
  "lugar_nascimento": "Bithynia, Anatolia (now Turkey)",
  "lugar_morte": null,
  "biografia": "Theodosius of Bithynia\nwas for a long time thought to have been born in Tripolis. The reason for this comes from an error in the\nSuda Lexicon\n(\na work of a\n10\nth\ncentury Greek lexicographer\n)\nwhich states that Theodosius was a\n(\nsee for example\n[\n1\n]\n)\n:-\n... philosopher\n[\nwho\n]\nwrote \"Sphaerics\" in three books, a commentary on the chapter of Theudas, two books \"On Days and Nights\", a commentary on the \"Method of\nArchimedes\n\", Descriptions of Houses in three books, \"Skeptical Chapters\", \"Astrological works\", \"On Habitations\". Theodosius wrote verses on the spring and other types of works. He was from Tripolis.\nWe are indeed interested in this article in the Theodosius who wrote\nSphaerics\nin three books. He must have lived close to\n100\nBC. Yet Theudas who is next referred to in the\nSuda\nwas a\nsceptic\nphilosopher of the second century AD so we see immediately that there is an error. It would now appear that, apart from the work on Theudas and\nSkeptical Chapters\nwhich was almost certainly written by the same person\n(\none assumes another author by the name of Theodosius\n)\n, the rest of the entry is correct except for the final two sentences \"Theodosius wrote verses on the spring and other types of works. He was from Tripolis.\" which must refer to what one has to assume is yet a third author called Theodosius.\nSo Theodosius was the author of\nSphaerics\n, a book on the geometry of the sphere, written to provide a mathematical background for astronomy. It is thought that\nSphaerics\nis based on some pre-Euclidean textbook which is now lost. It is conjectured, on rather little evidence one would have to say, that\nEudoxus\nwrote this earlier text. There seems to be no way in which the speculation on this point can ever be settled.\nSphaerics\ncontains no trigonometry although it is likely that\nHipparchus\nintroduced spherical trigonometry before\nSphaerics\nwas written\n(\nalthough, one has to assume, after the book on which\nSphaerics\nis based, which would certainly be the case if this earlier book was written by\nEudoxus\n)\n.\nSphaerics\nwas written to supplement\nEuclid\n's\nElements\nin particular to make up for the lack of results on the geometry of the sphere in\nEuclid\n's work.\nTheodosius defines a sphere to be a solid figure with the property that any point on its surface is at a constant distance from a fixed point\n(\nthe centre of the sphere\n)\n. He gives theorems which generalise those given by\nEuclid\nin Book III of the\nElements\nfor the circle. The second book of Theodosius's work considers touching circles on a sphere. It then goes on to consider geometry results which are relevant to astronomy and these continue to be studied through Book III.\nHeath\nwrites\n[\n2\n]\n:-\nIt is evident that Theodosius was simply a laborious compiler, and that there was practically nothing original in his work.\nPerhaps it is worth remarking that despite our comment above that the work contains no trigonometry, there are some results which we could easily interpret in trigonometrical terms. For example Theodosius proves that for a spherical triangle with angles\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\n(\nC\nC\nC\na right angle\n)\nand sides\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nwhere side\na\na\na\nis opposite angle\nA\nA\nA\n, etc. then\ntan\n⁡\na\n=\nsin\n⁡\nb\ntan\n⁡\nA\n\\tan a = \\sin b \\tan A\ntan\na\n=\nsin\nb\ntan\nA\n.\nNeugebauer\n, in\n[\n3\n]\n, is highly critical of the\nSphaerics\ncalling it dull and pedantic only surviving because it was used as a textbook. More specifically\nNeugebauer\nwrites:-\nTheodosius comes nowhere near recognising the fundamental importance of the great-circle triangle and his theorems rarely go beyond the geometrically obvious in the relations between a few special\ngreat circles\nand their parallels, without ever mentioning that one is dealing with configurations of interest to astronomy.\nTwo other works by Theodosius have survived in the original Greek. These are\nOn habitations\ncontaining\n12\ntheorems and\nOn days and nights\n. The first of these explains the views of the universe due to the rotation of the Earth and, in particular, it considers how the view is affected by the different places on the Earth in which people live.\nTheodosius considers the length of the night and day at various points on the earth and claims that the day lasts for seven months at the north pole and the night for five months. On moving south one reaches the circle where at the summer\nsolstice\nthe day is\n30\ndays long. Of course this is very strange and partly explained by Theodosius's definition of night as period of darkness and day as a period of light. Theodosius considered that it was 'day' if the sun was less than\n15\n° below the horizon for then no stars were visible and he seemed to fail to understand that in the polar regions the sun can move almost parallel to the horizon.\nThe other work\nOn days and nights\nis in two books, the first of which has\n13\npropositions, the second\n19\npropositions, which give conditions on the lengths of the night and day depending on the location of the observer. Theodosius also considers the two possibilities, that the length of the year is a\nrational\nmultiple of the length of the day and that it is an\nirrational\nmultiple.\nNeugebauer\n[\n3\n]\nmakes some interesting comments on the diagrams in ancient texts and how they may have been totally changed by both early editors and even by modern editors. Referring to Theodosius's\nOn days and nights\nhe says that:-\n... errors occur in diagrams. Letters are easily misplaced or sometimes an arc may be missing but by and large figures are well drawn. In many cases the extant diagrams show an axial symmetry which is not wrong but which is not required by the theorem or proof in question. Such symmetries detract ... from the general validity of the proposition. It is impossible to tell if such symmetrisations, caused either by the greater simplicity of construction or its aesthetic appeal, belong to the archetype or are copyist or editorial \"improvements\".\nOf the other works mentioned in the\nSuda\nwe have no reason to doubt that Theodosius wrote a commentary on the\nMethod\nby\nArchimedes\nbut there is no other evidence to prove whether this is correct or not.\nTheodosius is also reported to have invented a sundial\nsuitable for all regions\nbut nothing is known about it.",
  "math_areas": [
    "Geometry",
    "Logic"
  ]
}