{
  "nome_completo": "Thomas Gerald Room",
  "nome_curto": "Thomas Room",
  "ano_nascimento": "1902",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Room/",
  "lugar_nascimento": "Camberwell, London, England",
  "lugar_morte": "St Ives, Sydney, Australia",
  "biografia": "Thomas Room\nwas the second son of Ernest William Room\n(1871\n-\n1955)\n, the works manager of the Lime Works, Camberwell, and Emma Eliza Henry\n(\nborn\n1875)\n, a school teacher. Ernest Room was involved in local politics, being chairmen of the local Conservative Party, and serving as mayor of Camberwell in\n1923\n-\n24\n. Ernest Room and Emma Henry were married on\n11\nJuly\n1899\n. Thomas had two brothers, Leslie Ernest Room\n(\nborn\n1900)\nand Richard Geoffrey Room\n(\nborn\n1905)\n, and one sister Margaret Alethea Room\n(\nborn\n1911)\n. A fifth child died while a baby. Thomas was brought up in various homes around London, in Camberwell, East Dulwich and Dulwich Village. Ernest Room was also Chairman of the local Boy Scout Association and Thomas and his younger brother Richard soon became founding members of a Wolf Cub Pack.\nAfter attending elementary school in Dulwich, Thomas studied at Alleyn's School, an independent boys' school in Dulwich which had been established in\n1882\n[\n3\n]\n:-\nSchool reports at the age of\n13\nspeak of him as 'brilliant' and 'of the first order in capacity' in mathematics. A later report refers to his 'great powers of application' and predicts that 'great things in the learned world may be expected from this boy'. His school days were clearly a happy time. He entered wholeheartedly into school activities, worked hard at his studies and was rewarded with outstanding success.\nMusic played a special part in Room's life and while he was at Alleyn's School he sang in the school choir.\nHe entered St John's College, Cambridge, in\n1920\nto study the Mathematical Tripos having been awarded an Exhibition. Here he was greatly influenced by the geometer\nHenry Frederick Baker\nand his school. He graduated as a\nWrangler\nin\n1923\nand, having been awarded the Philip Baylis Research Studentship, he remained at St John's College undertaking research in geometry. His essay 'Varieties generated by collinear stars in higher space' won him the Smith's Prize in\n1925\n. In the same year he was elected as a fellow of St John's College but decided not to take this up at that time but accepted an Assistant Lectureship in Pure Mathematics at the University of Liverpool. While studying at Cambridge, Room had continued his interest in music, singing in the chapel choir, and in scouting\n[\n3\n]\n:-\nHe loved hiking and being in the open air, and delighted in exploring the countryside. These activities provided him, too, with complete relaxation from the hours of concentrated thought on mathematics. But scouting meant much more than this to him: it demanded leadership, organization and a willingness to help others. This side of scouting he took very seriously. Notebooks of his are extant in which instructions for his Troop are set forth with careful diagrams and in minute detail.\nHe taught at the University of Liverpool from\n1925\nuntil September\n1927\nwhen he returned to Cambridge to take up his fellowship. His first publication appeared while he was at Liverpool, namely the paper\nA general configuration in space of any number of dimensions analogous to the double-six of lines in ordinary space\n(1926)\nfollowed by his second\nConfigurations in ten dimensions\n(1927)\n. The first of these presented a higher-dimensional analogue of\nLudwig Schläfli\n's famous double-six of lines in\n3\n-space.\nReturning to Cambridge in\n1927\nsaw Room take up his fellowship at St John's College but in\n1928\nhe was appointed as a University Lecturer. This followed the University of Cambridge moving the bulk of its teaching from College lecturers to University lecturers. He loved participating in\nBaker\n's school which, around this time, contained\nWilliam Edge\n,\nJohn Todd\n,\nPatrick du Val\nand, a little later,\nDonald Coxeter\n[\n3\n]\n:-\nThe regular 'tea-party' held each Saturday afternoon in term time was a distinctive feature of the\nBaker\nschool. After tea there was always a talk, followed by lively discussion. All members were expected to attend and it was a somewhat formal occasion. One distinguished participant recalls of Room that 'On such occasions most of us were properly dressed, but he often used to rush in, rather later, with shorts revealing bare knees because he, as a Scout-master, had been out with his boys'.\nAlthough Room held his fellowship and lectureship for a year, in\n1929\nhe gave up the fellowship to concentrate totally on the University lectureship. He held this until\n1935\nwhen he was appointed as professor of mathematics at the University of Sydney, Australia, where he succeeded\nHoratio Scott Carslaw\nwho retired from the Chair of Mathematics in February\n1935\n. The mathematician Richard Jenkins Lyons played a role in this move for he was on the staff at the University of Sydney having studied with\nH F Baker\nat St John's College, Cambridge. Lyons took sabbatical leave in\n1933\nwhich he spent at Cambridge working with\nH F Baker\nand at this time he became acquainted with Room.\nRoom took charge of the small department at Sydney in which he had only five others to help him, with two of these being temporary. Despite the small Department he quickly moved to extend the three year course to a fourth honours year, raising the level of the mathematics taught in the first three years to support the honours courses.\nOn\n6\nNovember\n1937\nRoom married the schoolteacher Jessie Bannerman at Wesley College Chapel, University of Sydney. He had met Jessie through the Sydney University Settlement and the Student Christian Movement. Thomas and Jessie Room had a son, Robin, followed by two daughters, Rosemary and Geraldine. Shortly after his marriage, Room published the book\nThe Geometry of Determinantal Loci\n(1938)\nwhich he had been working on for fifteen years. He wrote in the Introduction:-\n... it appears that practically all the loci about the projective properties of which anything is known either are included in the class of Determinantal Loci, or are closely connected with it.\nThe book owed a great deal to\nHenry Baker\nand his geometry school at Cambridge but in the Introduction Room also notes that Richard Lyons had made a major contribution in the preparation of the book. It contained much that Room had published in papers during the\n1930\ns such as:\nThe freedoms of determinantal manifolds\n(1933)\n;\nNotes on determinantal manifolds\n(\nI\n)\n: pairs of determinantal manifolds of which one is a projection of the other\n(1934)\n;\nNotes on the determinantal manifolds\n(\nII\n)\n: the normal spaces of the manifolds represented by the vanishing of minors of highest order, and of order\n2\nin a matrix of linear forms\n(1935)\n;\nNotes on determinantal manifolds\n(\nIII\n)\n: the genera of curves and surfaces represented by the vanishing of minors of highest order and of order\n2\nin a matrix of linear forms\n(1935)\n; and\nNotes on determinantal manifolds\n(\nIV\n)\n: the numerical genus of the manifold represented by the vanishing of minors of highest order in a matrix of linear forms\n(1936)\n.\nWorld War II began in September\n1939\nwith Australian troops involved but the situation changed somewhat when in September\n1940\nJapan signed a Tripartite pact with Germany and Italy. It appears, however, that a small cypher section at Sydney University began working in January\n1940\nwith Room and Lyons being the first two to become involved. Although it has not been confirmed, it is thought that\nGordon Welchman\nmay have played a role in the formation of this group for he knew Room, both of them being in\nH F Baker\n's group at Cambridge in the\n1930\ns. As one of the first to be recruited to Bletchley Park where the codebreaking operations were being conducted,\nWelchman\nplayed important roles in recruiting fellow mathematicians to Bletchley but may well have recruited Room to set up the University of Sydney group. The codebreakers in Sydney, led by Room, worked on decoding Japanese messages. The Australian Special Intelligence Section requested that Room, Lyons and two other members of the Sydney group move to Melbourne\n[\n1\n]\n:-\nSome negotiation over the proper rank and pay for Room eventually led to an agreement whereby Room retained civilian status, the title of Professor, and his professorial level pay.\n(\nHe became the sole civilian member of the ultimately\n4\n,\n000\nstrong Brisbane-based Central Bureau!\n)\nHe and Lyons took up duty in mid-August\n1941\n. ... by late August\n1941\n, Australia had in Melbourne a viable nucleus for a cryptography group, led by Commander Nave. Within a few weeks, Room and Lieutenant Jamieson were sent to Bandung\n(\nJava\n)\nto study the techniques used by the Dutch and to Singapore to study the work of the British at the Far Eastern Combined Bureau. This was an arm of the London-based Government Code and Cipher School, as was Bletchley Park.\nIn March\n1942\nthe Americans and Australians cooperated in a joint intelligence section in Brisbane called the Central Bureau and Room moved there where he worked on breaking Japanese codes until the end of the war. See\n[\n1\n]\nand\n[\n2\n]\nfor details of Room's work at the Central Bureau which developed into the Australian version of Bletchley Park.\nWhen the war ended Room returned to the University of Sydney where life became difficult because there was a large number of students. These students, in addition to the expected eighteen year olds, included a large number of service men who had been denied a university education through the years of the war. In March\n1946\nthe University decided to appoint Keith Bullen to a Chair of Applied Mathematics and Room was pleased that a second professor was to be appointed. Some time later, however, the University split the Department of Mathematics into two departments, the Department of Pure Mathematics and the Department of Applied Mathematics. Room became head of Pure Mathematics and Keith Bullen became head of Applied Mathematics. Room was bitterly opposed to the splitting of the Department of Mathematics, believing strongly that mathematics was a unified subject. Bullen, however, had argued vigorously for the split and relations between Room and Bullen remained cool for the rest of their careers. In\n[\n3\n]\nwe are given a clear picture of Room's personality:-\nRoom's personality powerfully influenced the Pure Mathematics Department and many of his students and colleagues will have retained vivid impressions of him. A brisk and energetic figure, frequently clad in a short white coat to keep off the chalk dust, he might be glimpsed hurrying on his way to a lecture or seen in a more relaxed mood at departmental morning-tea, enjoying the exchange of opinions. As Head of Department he held the reins firmly but was universally respected for his fairness and intellectual integrity. In arriving at a decision he was always willing to listen to and consider someone else's point of view, and he was not ashamed to change his mind in the face of new evidence. He was unfailingly courteous and considerate. He would put his own point of view with clarity and good humour, seeking to persuade by reason. To browbeat or bully an opponent was completely foreign to him. By nature Room was a rather private person, who rarely showed his inner feelings in public. Relations with his staff, though invariably friendly, therefore remained a little formal. But there were occasions when the other side of him was seen. To members of staff at times of personal crisis or misfortune he showed the greatest kindness, sympathy and understanding. This was always done quietly and unobtrusively, that most people remained unaware of it, but on those involved it made a deep impression.\nRoom served as Dean of the Faculty of Science from\n1952\nto\n1956\nand again from\n1960\nto\n1965\n. He also spent time making research visits abroad. He was at the University of Washington in\n1948\nand at this time was able to write up results he had concerning\nClifford\nmatrices, for example\nQuadrics associated with the Clifford matrices\n(1950)\nand\nA synthesis of the Clifford matrices and its generalization\n(1952)\n. From September\n1957\nuntil June\n1958\nhe was at the Institute for Advanced Study at Princeton working with\nAlbert Tucker\nand\nOswald Veblen\n. He continued work on\nClifford\nmatrices and spinor groups while at Princeton. One other achievement for which he is known today by many is his introduction of \"Room squares\" in the paper\nA new type of magic square\n(1955)\n. We quote from the paper:-\nThe problem is to arrange the\nn\n(\n2\nn\n−\n1\n)\nn(2n - 1)\nn\n(\n2\nn\n−\n1\n)\nsymbols\nr\ns\nrs\nr\ns\n(\nwhich is the same as\ns\nr\nsr\ns\nr\n)\nformed from all pairs of\n2\nn\n2n\n2\nn\ndifferent digits in a square of\n2\nn\n−\n1\n2n - 1\n2\nn\n−\n1\nrows and columns, such that in each row and column there appear\nn\nn\nn\nsymbols\n(\nand\nn\n−\n1\nn - 1\nn\n−\n1\nblanks\n)\n, which among them contain all\n2\nn\n2n\n2\nn\ndigits.\nRoom showed that there is no Room square for\nn\n=\n3\nn = 3\nn\n=\n3\nand\nn\n=\n5\nn = 5\nn\n=\n5\nand he gave a Room square for\nn\n=\n4\nn = 4\nn\n=\n4\n. Here is the Room square for\nn\n=\n4\nn = 4\nn\n=\n4\nthat he gives in his paper:\n12   .    34   .    56   .    78\n.    37   25   .    .    48   16\n47   15   .    .    38   26   .\n.    .    .    68   14   57   23\n58   .    67   24   .    13   .\n.    46   18   35   27   .    .\n36   28   .    17   .    .    45\nIt was not until\n1973\nthat it was proved that Room squares exist for all\nn\n≥\n6\nn  ≥  6\nn\n≥\n6\n. In fact\nRobert Richard Anstice\nhad constructed an infinite number of Room squares a hundred years before Room wrote his paper. For many years it was thought that the squares first appeared in Room's paper so they were named for him.\nIn\n1941\nRoom was awarded the Thomas Ranken Lyle Medal by the Australian National Research Council and in the same year he was elected a fellow of the\nRoyal Society of London\n. He became a founding fellow of the\nAustralian Academy of Science\nwhen it was founded in\n1954\n. He served as president of the\nAustralian Mathematical Society\nfrom\n1960\nto\n1962\n, and he later became the first editor of the\nJournal of the Australian Mathematical Society\n.\nIn\n1968\nRoom retired from his professorship at the University of Sydney. He returned to London, England, in\n1969\nand spent time at Westfield College, London, working on projective planes. Jointly with his student Philip B Kirkpatrick, he published the book\nMiniquaternion geometry. An introduction to the study projective planes\nin\n1971\n. After the Open University was founded in\n1971\nhe worked as a Staff Tutor in the North West Region for a year. Then he spent two years at the headquarters of the Open University in Milton Keynes writing material for the university's mathematics courses. During this time, he continued to undertake research on projective planes. He returned to Australia in\n1974\nand lived quietly. In\n1982\na conference was held at the University of Sydney to honour his eightieth birthday.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Geometry",
    "Topology"
  ]
}