{
  "nome_completo": "Thomas Clausen",
  "nome_curto": "Thomas Clausen",
  "ano_nascimento": "1801",
  "ano_morte": "1885",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clausen/",
  "lugar_nascimento": "Snogbaek, Denmark",
  "lugar_morte": "Dorpat, Russia (now Tartu, Estonia)",
  "biografia": "Thomas Clausen\nwas born in Snogbaek, a small town in Nordschleswig, northwest of Sonderborg and about\n30\nkm northeast of Flensburg. His parents were Claus Clausen\n(1772\n-\n1851)\n, the son of Johan Clausen and Sille Jacobsdatter, and Cecilia Rasmusten\n(1781\n-\n1862)\n, the daughter of Thomas Rasmussen and Marike Peters. The family were poor farmers and Thomas worked on the farm from a young age. He was the oldest of his parents' eight children but did not attend school so he did not learn to read or write. When he was twelve years old, Thomas began working for the priest in the neighbouring parish, Georg Holst. Thomas was employed to look after cattle, but Holst quickly realised that he was very intelligent so while still working with the cattle, Thomas also attended the local school. Despite being unable to read or write when he started his lessons, Thomas quickly progressed showing a remarkable aptitude for mathematics. Holst was an amateur astronomer and mathematician and was able to teach Clausen these subjects as well as Latin and Greek. Clausen also studied several languages on his own, in particular French, English and Italian. He performed so well in his final school examinations that Holst recommended him to Heinrich Christian Schumacher, the professor as astronomy at the University of Copenhagen.\nNow Schumacher began a project triangulating the district of Holstein in\n1817\nand a couple of years later extended it to a complete geodetic survey of Denmark. To aid this project, an observatory had been set up at Altona and Schumacher resided there as the director. He had got to know Holst since his surveying work had taken him to the district where Holst, the local astronomy expert, lived. In around\n1819\nClausen began working for Schumacher at the observatory in Altona. At first he was employed as a clerk, but soon he was learning more advanced mathematics and helping Schumacher with the scientific work. Peter Andreas Hansen began working for Schumacher in\n1821\nand he played a role in increasing Clausen's mathematical knowledge. Clausen published his first paper\nBerechnung der Sternbedeckungen vom Monde zur Bestimmung der geographischen Länge\nⓉ\n(\nCalculating occultations by the moon to determine longitude\n)\nin\n1824\n. This paper, which presented a method of calculating longitude using stellar occultations by the moon, appeared in Volume\n2\nof\nAstronomische Nachrichten\n, a journal founded by Schumacher in\n1821\n.\nClausen became an assistant at Altona Observatory in\n1824\nand in October of that year he met\nCarl Friedrich Gauss\n, who was conducting geodesic measurements nearby, for the first time. They became friendly and\nGauss\nwas impressed with the young man. Things were not going well between Schumacher and Clausen, however, and when Clausen broke an expensive barometer this was the last straw - Schumacher told Clausen to leave just before Christmas\n1824\n. Now Clausen was in considerable difficulty but, remembering how well he had got on with\nGauss\n, he travelled to Göttingen to see him. After explaining what had happened in Altona, he asked\nGauss\nto write a letter to Schumacher supporting him. This\nGauss\ndid gladly and, with some reluctance, Schumacher reinstated him. The reluctance seems to have been on account of Clausen lacking breeding rather than on account of his work. After his first paper, mentioned above, Clausen published two further papers in Volume\n2\nof\nAstronomische Nachrichten\nin\n1824\n:\nMondssterne in Altona beobachtet\nⓉ\n(\nObservations of  the moon and stars made in Altona\n)\n, and\nAnzeige von Druckfehlern\nⓉ\n(\nDisplay of misprints\n)\n. Three further papers appeared in\n1825\n:\nLängendifferenzen aus Mondsculminationen\nⓉ\n(\nCalculating distances from lunar observations\n)\n;\nAuszug aus einem Briefe des Herrn Thomas Clausen an den Herausgeber\nⓉ\n(\nExtract from a letter of Thomas Clausen to the editor\n)\n; and\nResultate der Mondssterne beobachtungen\nⓉ\n(\nResults observations of the moon and stars\n)\n. There were, however, distractions for Clausen since his father became ill, their farm was being sold, and three of his siblings were still too young to support themselves.\nRelations between Schumacher and Clausen went from bad to worse when Clausen fell in love with Schumacher's niece who lived in the same house as her uncle\n(\nand Clausen\n)\n. There was no way that Schumacher would allow his niece to marry someone of Clausen's lowly class so he tried to get him to leave Altona by arranging another position for him. In October\n1826\nSchumacher visited Munich where, following the death of Fraunhofer earlier that year, the Munich Optical Institute was in need of a good theoretical astronomer. Schumacher suggested Clausen for the position, and the offer was accepted. Clausen was delighted when informed of the job offer and wrote a letter of acceptance on\n3\nNovember. He signed a contract to begin work in Munich in May\n1827\n. However,\nWilhelm Bessel\nnow suggested to the Munich Optical Institute that they employ his former student Carl August von Steinheil. Although von Steinheil was weaker than Clausen as a mathematician, he had the advantage of being rich and astronomers always need lots of money to carry out their research. Clausen's appointment was delayed, putting him in an extremely difficult position since he had resigned from Altona although he was given some money to compensate for the fact that he had a signed contract. Having resigned from Altona, he again pressed Schumacher's niece to marry him but was turned down again. The difficulty over his appointment was solved at last with both Clausen and von Steinheil being employed at the Munich Optical Institute. Clausen started work in December\n1828\n. He did not carry out any observational duties in this post and was left on his own to undertake research into mathematics and astronomy. He began sending papers on pure mathematics to\nAugust Crelle\n's\nJournal für die reine und angewandte Mathematik\nwhich did not please the director of the Munich Institute. Towards the end of\n1832\nClausen suffered a severe disappointment when he learnt that he would never succeed Fraunhofer.\nClausen's work was recognised by many of the top scientists of the day including Olbers,\nGauss\n,\nBessel\n, Hansen,\nCrelle\n, von Humboldt and\nArago\n. However he began to suffer from mental illness in\n1833\n. He suffered this illness for seven years, then in\n1840\nhe left Munich, returning to Altona - he walked the whole way. Back in Altona he spent two years on his own doing some of the best science of his life. In\n1840\nhe published a theorem on the Bernoulli numbers which had been proved around the same time by\nKarl von Staudt\n- today it is called the\nvon Staudt\n-Clausen theorem. Also\n1840\nhe published a paper on the quadrature of four cases of the lunes of\nHippocrates of Chios\n. In\n1842\nhe published a treatise on the comet discovered by Charles Messier in June\n1770\n. In this treatise he computed the orbit of the comet and for this work was awarded a prize by the\nRoyal Danish Academy of Sciences and Letters\n.\nBessel\ndescribed this work in the following terms\n[\n1\n]\n:-\nWhat a magnificent, or rather, masterful work! It is an achievement of our time which our descendants will not fail to credit him with.\nOn\n10\nAugust\n1842\n, Schumacher wrote to\nGauss\nsaying that Clausen had proved the nonexistence of orthogonal Latin squares of order\n6\nby dividing such Latin squares into\n17\nfamilies. Sadly details of Clausen's proof have never been found although the remarkable combinatorial abilities he displayed leads one to believe that he did have a proof. He was also engaged in an argument with\nJacobi\n. John McCleary writes\n[\n12\n]\n:-\nOne of the prettiest results in the global theory of curves is a theorem of\nJacobi\n(1842)\n: The spherical image of the normal directions along a closed differentiable curve in space divides the unit sphere into regions of equal area. The statement of this theorem is an afterthought to a paper in which\nJacobi\nresponds to the published correction by Thomas Clausen\n(1842)\nof an earlier paper by\nJacobi\n(1836)\n.\nAs soon as Clausen had arrived back in Altona at the beginning of\n1840\n, Schumacher had tried to arrange a position for him at the Observatory in Tartu, at that time part of the Russian Empire and known as Derpt\n(\nsimilar to the earlier German name of Dorpat\n)\n. Johann Heinrich Mädler, the director of the Observatory, would have preferred to employ Johann Gottfried Galle who, unlike Clausen, had an exceptional reputation as an observer. Galle did not want to go to Tartu and there followed a lengthy correspondence between Mädler, Schumacher and\nGauss\nas to Clausen's suitability.  In February\n1842\nhe was appointed to the observatory in Tartu as Professor of Astronomy and began work there in the October of that year\n[\n17\n]\n:-\n... Schumacher and\nBessel\nworried about how Clausen and Mädler would get along. But they worried in vain since these men made friends very quickly.\nTwo years later Clausen received an honorary doctorate from the University of Königsberg. He had been put forward for this honour by\nBessel\n, who thought very highly of Clausen's extraordinary talents. If Clausen had struggled to get positions earlier, this was no longer the case for he received an offer to go to the Observatory in Pulkowa, the leading Russian observatory. Despite being a tempting offer, he decided to stay in Tartu. In\n1866\nhe was appointed to replace Mädler as director of the Tartu Observatory, a post he held until he retired in\n1872\n. Clausen never married and, after moving to Tartu, appears to have had no further contacts with his family back in Denmark.\nHe received many honours during the years he spent in Tartu, in addition to the honorary doctorate just mentioned. He was elected to the\nRoyal Astronomical Society\nof London in\n1848\n, the\nGöttingen Academy of Sciences\n(\nat that time called Königliche Gesellschaft der Wissenschaften zu Göttingen\n)\nin\n1854\n, and the\nSt Petersburg Academy of Sciences\nin\n1856\n. He received two prizes from the\nGöttingen Academy of Sciences\nfor his outstanding work.\nClausen wrote over\n150\npapers on pure mathematics, applied mathematics, astronomy and geophysics. Among his work in pure mathematics, he factored the\n6\nth\nFermat\nnumber\n2\nn\n+\n1\n2^{n} + 1\n2\nn\n+\n1\nwhere\nn\n=\n2\n6\nn = 2^{6}\nn\n=\n2\n6\nin\n1854\nshowing it was not\nprime\n. Since\n2\n64\n+\n1\n=\n67280421310721\n×\n274177\n2^{64} + 1 = 67280421310721 \\times  274177\n2\n6\n4\n+\n1\n=\n6\n7\n2\n8\n0\n4\n2\n1\n3\n1\n0\n7\n2\n1\n×\n2\n7\n4\n1\n7\n7\none can only marvel at how Clausen achieved this result. The first to show that not all the\nFermat\nnumbers were prime was\nEuler\nin\n1732\nwhen he showed that\n2\nn\n+\n1\n2^{n} + 1\n2\nn\n+\n1\nwhere\nn\n=\n2\n5\nn = 2^{5}\nn\n=\n2\n5\nwas not prime. Clausen also gave a new method of factorising numbers. He computed π to\n247\nplaces which he published in\n1847\n. He used the formula\nπ\n4\n=\n2\narctan\n⁡\n(\n1\n3\n)\n+\narctan\n⁡\n(\n1\n7\n)\n\\Large\\frac{\\pi}{4}\\normalsize  = 2 \\arctan(\\large\\frac{1}{3}\\normalsize ) + \\arctan(\\large\\frac{1}{7}\\normalsize )\n4\nπ\n​\n=\n2\narctan\n(\n3\n1\n​\n)\n+\narctan\n(\n7\n1\n​\n)\n.\nK-R Biermann, in\n[\n3\n]\n, writes:-\nHe possessed an enormous facility for calculation, a critical eye, and perseverance and inventiveness in his methodology.\nClausen's first love was mathematics, particularly\nnumber theory\n, although he had never received a formal mathematical training. He wrote in a letter in\n1826\n[\n13\n]\n:-\n... theoretical study of mathematics has always been the greatest interest to me.\nOne can only guess what he might have achieved had the educational system in his time been able to give this remarkable man from a lowly background, the education he deserved.",
  "math_areas": [
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}