{
  "nome_completo": "Thomas Muirhead Flett",
  "nome_curto": "Thomas Flett",
  "ano_nascimento": "1923",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flett/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Sheffield, England",
  "biografia": "Thomas Flett\n's parents were James Flett and Margaret Muirhead. James and Margaret Flett were married in Kirkintilloch, Dumbarton, Scotland in\n1916\nand moved to London shortly before the birth of their son Thomas. Tom had a younger sister Jean. He attended primary school in London and, at the age of eleven, he won a County of Middlesex scholarship to the University College School in Hampstead, London. This school had been founded in\n1830\nas part of University College in Gower Street but moved to Hampstead in\n1907\n. This school:-\n... was founded to be different from other schools ...\n[\nIts\n]\napproach to education is founded on a dual emphasis on liberal academic scholarship and on being a community of individuals ...\nIt was at University College School that Flett became fascinated by mathematics, and he always claimed that it was through the excellent and inspiring teaching of Mr Marsden that he became a mathematician\n[\n13\n]\n:-\nHis school reports from the last two years at University College School make interesting reading, for they accurately describe the qualities which shaped his life. Even at this stage he was obviously aware of his own ability without becoming objectionable due to arrogance. His family used to tease him about the comment, \"He should, however, realise that the methods of others, even if they appear not so good as his own, may still have merit worthy of notice\".\nWhen Flett graduated from University College School in\n1940\n, Britain had been involved in World War II for about a year. He did his war work, first at the Post Office Research Station at Dollis Hill in London. This research branch of the Post Office consisted of several different groups including a telegraph group, a switching group and a physics group. These groups all were involved in one way or another with the coding work that was going on at Bletchley Park, particularly in the construction of computing equipment proposed by\nAlan Turing\n. Other contributions made by the Post Office Research Station at this time included constructing listening devices to eavesdrop on German prisoners, so it was, in many different ways, providing a vital contribution to the war effort. Flett spent three years working at Dollis Hill and during this time he was able to continue his education by enrolling as a part-time student at Acton Technical College. This College trained their students to take the University of London degree examinations and Flett was awarded first class Honours in the London University B.Sc. General Degree in Mathematics and Physics.\nIn\n1943\nFlett left the Post Office Research Station at Dollis Hill and spent two years working at the Simmonds Aerocessories Company at Brentford, London. This Company was owned by Sir Oliver Edwin Simmonds, a pioneer aircraft designer who contributed to the design of the Spitfire plane. Flett was employed as a research physicist and again this was working for a company who were heavily involved in contributing to the war effort. While working at the Simmonds Aerocessories Company, Flett continued his higher education at Chelsea Polytechnic and, in\n1945\n, he was awarded first class Honours in the B.Sc. Special Degree Examinations in Mathematics. The end of World War II in\n1945\nallowed Flett to leave the Simmonds Aerocessories Company and accept the position of Assistant Lecturer in Mathematics at Chelsea Polytechnic. He spent the two years\n1945\n-\n47\nin this post but not only did he do an exceptional job in teaching mathematics but he also continued his studies at Chelsea Polytechnic taking further examinations there in\n1946\nbefore being awarded an M.Sc. in Mathematics by the University of London in\n1947\n. Chelsea Polytechnic, which had evolved out of the South-Western Polytechnic Institute in\n1922\n, had eight departments, namely art, chemistry, domestic science, mathematics, music, natural science, physics and physical training. Dr A E Ludlam was the Head of the College's Mathematics Department at the time when Flett studied there.\nOne of his duties at Chelsea Polytechnic in\n1946\n-\n47\nwas to teach a course on Analysis to a class consisting of just two students, namely\nRex Tims\nand Joseph Dunnage.\nRex Tims\n, who has a biography in this archive, went on to have an outstanding career as a mathematician and he learnt much from Flett. Joseph Dunnage also became a mathematician, obtaining a Ph.D. from the University of London with his thesis\nThe Zeros of Random Trigonometric Polynomials and of Random Integral Functions of Infinite Order.\nHis advisor was\nCyril Offord\nand he went on to teach at Chelsea College, where he became a Reader in Mathematical Analysis. Both Tims and Dunnage acknowledged that Flett's\n1946\n-\n47\nAnalysis course had been an inspiration. Dunnage wrote:-\nTom was a brilliant lecturer, and the hour with him was the highlight of my week. He made 'epsilonology' seem so easy and natural that he must have been the prime influence in turning Rex and myself into analysts. His course was completely worked out and his blackboard technique impeccable. When I started lecturing myself in\n1947\nat Battersea Polytechnic, I quite deliberately modelled myself on him, and I do not think that any more formal training could have been better.\nRex Tims\n' skill as a teacher was acknowledged in Professor Scott's obituary and I think that a lot of the credit must go to Tom.\nIn\n1947\nFlett was awarded a University of London Sherbrooke Studentship which meant that he could undertake research at the University of Cambridge. At Cambridge Flett's advisor was\nJ E Littlewood\nand he was awarded a Ph.D. from Cambridge in\n1950\nfor his thesis\nSome applications of estimates of exponential sums to the theory of functions\n. At Cambridge one of Flett's tasks was working on rewriting\nJ E Littlewood\n's\nLectures on the theory of functions\n(1944)\n. This was a major task which was never completed but\n[\n13\n]\n:-\n... much of Tom's research was to grow out of problems which became clear as he worked on the revision.\nWhile undertaking research at Cambridge, Flett married Joan F Ayers. They had known each other from the time they were at primary school together but their common interest in Scottish Country Dancing brought them together later in life and they married in\n1948\n. Tom and Joan Flett became well-known as authors of papers and books on dancing and we shall refer below to this second of Flett's passions. Let us also note that in\n1948\n, while he was undertaking research at Cambridge, Flett was offered a permanent lectureship in mathematics at Chelsea Polytechnic. This was very tempting to the young man who had just married. Choosing to continue his research at Cambridge, and so have an uncertain future regarding employment, must have been difficult but Flett's passion for mathematics meant that he had to pursue his research.\nAfter completing his Ph.D., Flett did indeed get a good position for he was appointed as an Assistant Lecturer in Pure Mathematics at the University of Liverpool in\n1950\n. Of course, this paid considerably less than what he might have earned had he taken the Chelsea Polytechnic position, but Flett never regretted his decision. Indeed he was quickly promoted at Liverpool, to Lecturer in Mathematics and later to Senior Lecturer in Mathematics and, in\n1963\n, to Reader in Mathematics.The Head of Mathematics at Liverpool during his time there was\nGeoffrey Walker\nand he wrote about Flett's contributions:-\nIn my opinion Flett was the most useful assistant any Head of Department could have. He did not push his own ideas but would produce them when invited, he was willing to undertake responsibility, and could always be safely left to do a job efficiently and with complete mastery over details. His unfussy but accurate attention to detail in everything he did was perhaps one of his most outstanding personal characteristics and he eventually took charge of all organisational jobs in the department under my general direction. One particularly onerous responsibility he undertook concerned the new building opened in\n1962\n- when he was responsible during several years of planning for liaison with the architects - to see that plans included what the department wanted, and for preparing the detailed schedule of equipment. He was largely responsible for the design of ornamental panels on mathematical topics that decorate the entrance hall. When Flett came to Liverpool in\n1950\nhe was already an established teacher with well considered views on syllabuses and teaching methods in analysis at all levels. He played an important part in the change to modern syllabuses in analysis: his book\n[\n'Mathematical analysis'\n(1966)]\nwas the outcome of his work at that time and reflects the polish of his first and second year courses to prospective honours students. The best known of Flett's research students is U Kuran who came from Turkey to work with Flett for a Ph.D. He later joined the staff and is now a Reader in the department, with a solid reputation in Analysis.\nIn\n[\n13\n]\nFlett's mathematical contributions are described in detail under the headings\n(\ni\n)\nFourier series\nand power series\n(11\npublications\n)\n,\n(\nii\n)\nSummability\n(10\npublications\n)\n,\n(\niii\n)\nFunction theoretic identities and inequalities\n(16\npublications\n)\n,\n(\niv\n)\nGeometric analysis\n(7\npublications\n)\n,\n(\nv\n)\nComplex analysis, harmonic functions\n(7\npublications\n)\n, and\n(\nvi\n)\nMiscellaneous\n(10\npublications\n)\n. Over\n200\npapers listed in\nMathematical Reviews\ncontain a review or a title that refers to Flett, often referring to 'Flett's mean value theorem', 'Flett potentials' or 'Flett's function'. It is Flett's mean value theorem which receives the most references and this is quite surprising given Flett's\n1958\npaper\n[\n1\n]\nappeared in\nThe Mathematical Gazette\n. The paper\n[\n4\n]\nFlett's mean value theorem: a survey\ngives, as the title indicates, a survey of work which has developed from Flett's original ideas. The authors write:-\nThis paper reviews the current state of the art of the mean value theorem due to Thomas M Flett. Mean value theorems of differential and integral calculus provide a relatively simple, but very powerful tool of mathematical analysis suitable for solving many diverse problems.\nDuring his time at Liverpool, Flett spent a term as Visiting Professor at the Middle East Technical University in Ankara, Turkey, in\n1964\n, and he spent the academic year\n1966\n-\n67\nin the United States as Visiting Professor at the University of Washington in Seattle. After this year in Seattle, he was appointed as Professor of Pure Mathematics at the University of Sheffield, a position he held from\n1967\nuntil his death in\n1976\n. Samuel James Taylor writes\n[\n13\n]\n:-\nOn going to Sheffield he made an immediate impact on the work of his department and on its relationships with other departments in the mathematical sciences. He was largely responsible for a new degree structure which has worked well. His precise mind combined with a willingness to consider administrative problems of great complexity made him a valuable member of any committee, and he made notable contributions to the work of the Faculty of Pure Sciences as well as the Senate of Sheffield University. Among his diverse responsibilities was the Committee for Halls of Residence and the Body advising the local Colleges of Education on both the content and standards of mathematical training for teachers.\nFlett wrote a number of books and, perhaps rather surprisingly, they are not all on mathematics. Those on mathematics are\nMathematical analysis\n(1966)\nand\nDifferential analysis\n(1980)\n. The second of these\n[\n3\n]\n:-\n... was left in an almost complete form by the author on his early death in\n1976\n, and completed by Professor Pym in what was clearly a labour of love. It deals with the general differential properties of functions from one vector space into another.\nFor extracts from reviews of these books see\nTHIS LINK\n.\nThe obituary\n[\n13\n]\nlists\n53\nmathematics papers by Flett. However he also wrote papers on dance, particularly Scottish dance, in collaboration with his wife. These include\nSome Hebridean Folk Dances\n(1953)\nand\nDramatic Jigs in Scotland\n(1956)\n. Flett also wrote\nAn Early Nineteenth Century Arithmetic Exercise Book\n(1961)\nwhich describes an exercise book written by Edward Winder, a schoolboy in Wyresdale, a little valley some seven miles south-east of Lancaster, around\n1827\n. This is a fascinating paper describing an Arithmetic Exercise Book quite similar to that of William Braid which we describe at\nBraid's Arithmetic\n.\nA second paper, written jointly by Flett and his wife Joan F Flett,\nSome Notes in an Old Wyresdale Exercise Book\n(1960)\n, describes various cures inserted by Winder in blank spaces in his arithmetic exercise book. Again this has a parallel with William Braid's arithmetic exercise book.\nReturning to the interest that Flett and his wife had in dance we note that they had published the jointly-authored books\nTraditional Dancing in Scotland\n(1964\n, re-issued\n1985)\n,\nTraditional Step-Dancing in Lakeland\n(1979)\nand\nTraditional Step-Dancing in Scotland\n(1996)\n. These last two books were published after Flett died:-\nProfessor and Mrs Flett spent over twenty years, until Professor Flett's early death, at the age of fifty two, in\n1976\n, studying the literature and oral history of the social and solo dances of Scotland and the North West of England. Their book \"Traditional Dancing in Scotland,\" published in\n1964\nby Routledge and Kegan Paul and re-issued in\n1985\nin paperback, is the definitive study of traditional social dancing. After Professor Flett's death their research into the step-dancing of Cumbria was published by the English Folk Dance and Song Society in \"Traditional Step-Dancing in Lakeland\" in\n1979\n. A book on the solo dances of Scotland was completed by Mrs Flett and was published as \"Traditional Step-Dancing in Scotland\" in\n1996\n.\nFor extracts from reviews of these books on dancing see\nTHIS LINK\n.\nWe have already mentioned Flett's early death\n[\n13\n]\n:-\nFlett was in the prime of life when a rare form of cancer struck him: he died after about a year of ill health on February\n13\n,\n1976\n, though doctors claimed he must have suffered from the disease for about fifteen years before anyone knew. ... Tom's work as a mathematician will live on: it will continue to affect those who read it and build on it. However those of us who knew Tom Flett personally have a double sense of loss - we have not only lost a colleague with good judgement who was contributing actively in many ways, but we have lost a personal friend who was both caring and kind.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}