{
  "nome_completo": "Thomas Arnot Lumsden",
  "nome_curto": "Thomas Lumsden",
  "ano_nascimento": "1895",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lumsden/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edgbaston, Birmingham, England",
  "biografia": "Thomas Lumsden\n's father was  William Lumsden\n(\nborn in Penicuik in\n1858)\nwho was a wood turner. His mother was  Mary Scott Arnott\n(\nborn in Glasgow in\n1857)\n. He had two older siblings Janet\n(1889\n-\n1935)\nand Andrew\n(\nborn\n1898)\n.\nThomas Lumsden attended Public Schools from\n1901\nto\n1906\n, then George Heriot's, Edinburgh, from\n1906\nto\n1912\n. He passed the Leaving Certificate and Edinburgh University Preliminary Examinations in Latin at Lower level and English at Higher level in April\n1911\n, then Mathematics at Higher level in April\n1912\n, passing Dynamics, and Science\n(\nalso at Higher level\n)\nin September of that year. After having passed the Preliminary Examination for Edinburgh University, he first matriculated in October\n1912\n.\nDuring his first session at university, Lumsden studied Mathematics, Natural Philosophy\t, and Chemistry. He then took Political Economy before beginning Honours courses in Mathematics and Natural Philosophy in session\n1914\n-\n15\n. He was ranked second top student and awared a First Class Certificate in the Advanced Honours Class in Mathematics in June\n1915\n. At this point World War I was taking place and Lumsden had to take a break in his studies to undertake war service. He returned to Edinburgh University to take a course in Honours Natural Philosophy in\n1918\n-\n19\n. He graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in July\n1919\n.\nAfter graduating Lumsden was appointed as an Assistant in Natural Philosophy at the University of Edinburgh\n(\nunder the Nichol Foundation\n)\nfor session\n1919\n-\n20\n.\nRobert T Dunbar\nwas a fellow assistant in Natural Philosophy during this year. Lumsden then went to the University of Birmingham where he was appointed as a Lecturer in Mathematics in the following year.\nThomas Arnot Lumsden married Florence Milne Falconer in Abernyte, Perthshire on\n4\nAugust\n1924\n.\nLumsden served his country during World War II and was killed in action. The following notice of his death appeared in the newspapers:-\nOn\n17\nAug\n1944\nThomas Arnot Lumsden died on active service. He was aged\n48\nand the husband of Florence of\n22\nHallewell Road, Birmingham.",
  "math_areas": []
}