{
  "nome_completo": "Thomas Jan Stieltjes",
  "nome_curto": "Thomas Stieltjes",
  "ano_nascimento": "1856",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stieltjes/",
  "lugar_nascimento": "Zwolle, Overijssel, The Netherlands",
  "lugar_morte": "Toulouse, France",
  "biografia": "Thomas Stieltjes\n' father, also named Thomas Stieltjes, had been awarded a doctorate from Leiden University. He became well-known both as a civil engineer and also as a member of the parliament. As an engineer he is famed for the construction of harbours in Rotterdam and is remembered today through a statue, erected by his friends, which stands on the Noordereiland, at the Burgemeester Hoffman Plein, in Rotterdam. In fact the dictionary of biography of famous people from the Netherlands which I\n[\nEFR\n]\nconsulted before writing this biography contained a two page entry concerning Thomas Stieltjes, the father, while there was only a single paragraph on his son, Thomas Stieltjes the mathematician. Thomas Stieltjes senior had seven children and Thomas Stieltjes junior had two brothers and four sisters.\nStieltjes started his studies at the Polytechnical School of Delft in\n1873\nbut spent his student years reading\nGauss\nand\nJacobi\nin the library rather than attending lectures. It may have been enjoyable to Stieltjes to read the works of these great mathematicians rather than study the coursework but the consequence was that he failed his examinations. Two further failures in\n1875\nand\n1876\nhad his father in despair, but having a friend H G van de Sande-Bakhuyzen as director of Leiden Observatory, Thomas's father was able to put in a good word for his son.\nStieltjes became assistant at Leiden Observatory in April\n1877\nbut his father, who had done so much to help his son, was not to live long after helping his son to obtain this position for he died in Rotterdam on\n23\nJune\n1878\n. Perhaps the most significant event in Stieltjes' life, as far as mathematics was concerned, occurred on\n8\nNovember\n1882\nwhen he began a correspondence with\nHermite\nwhich was to last the rest of his life\n(\nwhich would only be\n12\nmore years during which time they exchanged\n432\nletters\n)\n. The original reason that Stieltjes wrote to Hermite concerned his work on celestial mechanics. However the correspondence turned quickly to mathematics and Stieltjes began to devote all his spare time to mathematical research.\nIt is a great credit to van de Sande-Bakhuyzen, the director of Leiden Observatory, that he responded quickly to Stieltjes' request on\n1\nJanuary\n1883\nto stop his observational work to allow him to work more on mathematical topics. The year\n1883\nwas eventful for Stieltjes for he married Elizabeth Intveld in May. Although clearly an important event in Stieltjes' personal life, this was also an important event for Stieltjes as a mathematician for his wife strongly encouraged him to move from astronomical work to mathematics. In September Stieltjes was asked to substitute at the University of Delft for F J van den Berg who had taken ill. From September to December\n1883\nStieltjes lectured on analytical geometry and on descriptive geometry. This confirmed what must have been becoming increasing clear in Stieltjes' mind, that mathematics was the only p\n[\nossible career for him. He completed the move on\n1\nDecember\n1883\nwhen he resigned his post at the observatory.\nStieltjes applied for a chair in Groningen and on\n15\nJanuary\n1884\nhe wrote to\nHermite\n:-\nI have been offered, some days ago, a professorship in analysis\n(\ndifferential and integral calculus\n)\nat the University of Groningen. I have accepted this offer and I believe that this position will permit me to become more useful. I owe much, for this position, to the extreme kindness of my old boss Mr Bakhuyzen, the director of the observatory. One of these days, my nomination will become definite.\nHe was to be disappointed, however, for although he was placed first for a chair at Groningen he was not appointed because of his lack of qualifications. He wrote to\nHermite\non\n13\nMarch\n1884\nsaying:-\nThe Groningen Faculty has indeed put me in first place for the vacancy, but the Minister has named one of the others. Probably the reason will have been that I had no chance of following the standard path, for I have not received any degree from the University.\nAlthough this gives the complete facts that Stieltjes was aware of, the events surrounding this appointment were a little more complex than he realised. In fact the appointing committee had drawn up a list of three names in order of preference in\n1883\n. Top of the list had been Korteweg with Stieltjes in second place and indeed the position was offered to Korteweg who was a professor at the University of Amsterdam. After considering the offer Korteweg decided that he did not wish to leave Amsterdam and move to Groningen so he turned the offer down.\nAt this stage the appointing committee at Groningen drew up a new list putting Stieltjes in first place with Floris de Boer second. However, despite Stieltjes accepting the position at this stage, a Royal Decree was issued on\n12\nMarch\n1884\nappointing de Boer to the chair. As one might imagine\nHermite\nwas very disturbed to learn that Stieltjes had been ruled out after an offer had been made to him because of his lack of a degree.\nIn May\n1884\nHermite\nattended celebrations at the University of Edinburgh in Scotland to celebrate the three hundredth aniversary of the founding of the university. There he talked to Bierens de Haan, a professor of mathematics from the Netherlands, and they devised a plan to help Stieltjes by having him proposed for an honorary degree at Leiden University. After de Haan returned, he and van de Sande-Bakhuyzen proposed Stieltjes for an honorary degree in mathematics and astronomy. On\n27\nMay the Senate of Leiden University recorded the following minute:-\nThe Rector reported that a request has been received from the Faculty of Mathematics and Physics to confer the degree of doctor honoris causa in Mathematics and Astronomy upon Mr T J Stieltjes, a former employee of Leiden Observatory. On behalf of the Faculty, Mr Lorentz explained the merits of Mr Stieltjes and indicated the reasons which led to the proposal. It was decided to reach a conclusion in the next meeting of the Senate.\nThe Senate wrote to Stieltjes regarding the award of the honorary degree but somehow it failed to reach him in time. Stieltjes, on\n19\nJune\n1884\n, replied:-\nTo the Senate of Leiden University.\nThe undersigned wishes to thank you for the honourable distinction, conferred upon him by Your College, and to assure you that the distinction is highly appreciated. Due to a regrettable misunderstanding he was not aware of the intention of a public ceremony on last Tuesday June\n17\nat\n3\no'clock.\nLeiden, June\n19\n,\n1884\nT J Stieltjes\nStieltjes went with his family to Paris in April\n1885\nand in the same year he was elected to the Royal Academy of Sciences in Amsterdam. He received his doctorate of science in\n1886\nfor a thesis on asymptotic series. In the same year Stieltjes was appointed to the University of Toulouse, being appointed to a chair of differential and integral calculus in Toulouse in\n1889\n.\nStieltjes worked on almost all branches of analysis,\ncontinued fractions\nand\nnumber theory\n. He is often called \"the father of the analytic theory of continued fractions\" for his work in this area. On\n18\nJune\n1894\nhe published\nRecherches sur les fractions continues\nⓉ\n(\nResearch on continued fractions\n)\nin\nComptes Rendus de l'Académie des Sciences\n. A fuller version of this work appeared in the\nAnnales de la Faculté des Sciences de Toulouse\n. It is a beautifully written work of major importance described in\n[\n1\n]\nas:-\n... clear, self-contained, almost lyric in style.\nStieltjes studied the continued fraction:\n1\na\n1\nz\n+\n1\na\n2\n+\n1\na\n3\nz\n+\n1\na\n4\n+\n1\na\n5\nz\n+\n.\n.\n.\n\\Large\\frac{1}{a_1 z +\\Large\\frac{1}{a_2 + \\Large\\frac{1}{a_3 z + \\Large\\frac{1}{a_4 + \\Large\\frac{1}{a_5 z + ...}}}}}\na\n1\n​\nz\n+\na\n2\n​\n+\na\n3\n​\nz\n+\na\n4\n​\n+\na\n5\n​\nz\n+\n.\n.\n.\n1\n​\n1\n​\n1\n​\n1\n​\n1\n​\nusually written\n1\na\n1\nz\n+\n1\na\n2\n+\n1\na\n3\nz\n+\n1\na\n4\n+\n1\na\n5\nz\n+\n.\n.\n.\n\\Large{\\frac{1}{a_1 z +} \\frac{1}{a_2 +} \\frac{1}{a_3 z +} \\frac{1}{a_4 +} \\frac{1}{a_5 z + ...}}\na\n1\n​\nz\n+\n1\n​\na\n2\n​\n+\n1\n​\na\n3\n​\nz\n+\n1\n​\na\n4\n​\n+\n1\n​\na\n5\n​\nz\n+\n.\n.\n.\n1\n​\nIf we consider the first\nn\nn\nn\nterms of this continued fraction then we obtain the rational function\nP\nn\n(\nz\n)\n/\nQ\nn\n(\nz\n)\nP_{n}(z)/Q_{n}(z)\nP\nn\n​\n(\nz\n)\n/\nQ\nn\n​\n(\nz\n)\n. Stieltjes examined the sequence of\nrational functions\nP\nn\n(\nz\n)\n/\nQ\nn\n(\nz\n)\nP_{n}(z)/Q_{n}(z)\nP\nn\n​\n(\nz\n)\n/\nQ\nn\n​\n(\nz\n)\nand the connections between the roots of the polynomials\nP\nn\n(\nz\n)\nP_{n}(z)\nP\nn\n​\n(\nz\n)\nand\nQ\nn\n(\nz\n)\nQ_{n}(z)\nQ\nn\n​\n(\nz\n)\n.\nHe is best remembered for the Stieltjes integral which he introduced in\nRecherches sur les fractions continues\nⓉ\n(\nResearch on continued fractions\n)\nwhile solving the moment problem, that is, given the moments of all orders of a body, find the distribution of its mass. This problem arose in the study of two functions arising as the limits of the sequences\nP\n2\nn\n(\nz\n)\n/\nQ\n2\nn\n(\nz\n)\nP_{2n}(z)/Q_{2n}(z)\nP\n2\nn\n​\n(\nz\n)\n/\nQ\n2\nn\n​\n(\nz\n)\nand\nP\n2\nn\n+\n1\n(\nz\n)\n/\nQ\n2\nn\n+\n1\n(\nz\n)\nP_{2n+1}(z)/Q_{2n+1}(z)\nP\n2\nn\n+\n1\n​\n(\nz\n)\n/\nQ\n2\nn\n+\n1\n​\n(\nz\n)\n.\nThe first part of Stieltjes' article in the\nAnnales de la Faculté des Sciences de Toulouse\ncovers\n120\npages and appeared in\n1894\n. The second part is a forty page article which appeared after Stieltjes' death in\n1895\n. His work on continued fractions had already been awarded the Ormoy Prize of the\nAcadémie des Sciences\nin\n1893\n.\nRecherches sur les fractions continues\nⓉ\n(\nResearch on continued fractions\n)\nis described in\n[\n1\n]\nas:-\n... a mathematical milestone. The work represents the first general treatment of continued fractions as part of complex analytic function theory; previously, only special cases had been considered.\nStieltjes' work is also seen as an important first step towards the theory of\nHilbert spaces\n. Also important is his work on divergent series and discontinuous functions. Stieltjes also contributed to ordinary and\npartial differential equations\n, the\ngamma function\n, interpolation, and\nelliptic functions\n.\nStieltjes died on\n31\nDecember\n1894\nand was buried in the cemetery of Terre Cabade in Toulouse on\n2\nJanuary\n1895\n. His grave has recently been restored.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}