{
  "nome_completo": "Thomas Macfarland Cherry",
  "nome_curto": "Thomas Cherry",
  "ano_nascimento": "1898",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cherry/",
  "lugar_nascimento": "Glen Iris, Melbourne, Australia",
  "lugar_morte": "Melbourne, Australia",
  "biografia": "Thomas Cherry\n's mother, Edith Sarah Gladman, was a graduate in classics who had been born in England. Thomas Cherry's father, also named Thomas Cherry, was born in Gisborne, Victoria, Australia, although his father, Edward Cherry, had been born in England and had emigrated to Australia in\n1855\n. Thomas Cherry Senior was a Bacteriologist and Agricultural scientist and employed giving a bacteriological service to doctors and hospitals in Melbourne at the time that his second Thomas, the subject of this biography, was born. Thomas\n(\nor Tom as he was known to his family and friends\n)\nhad an older brother John Howard Cherry, and two younger brothers Henry Lister Cherry and Richard Ormond Cherry and a sister Margaret Lilias Cherry. Thomas was brought up in Glen Iris on the outskirts of Melbourne which at that time was almost in the country.\nAn indication of the rural nature of Glen Iris is that Thomas had to walk over\n6\nkm each day to attend primary school. He then attended Scotch College where his talents for mathematics and science were quickly recognised. He was dux of the College in\n1914\nand entered Ormond College of the University of Melbourne. He graduated with a B.A. in\n1918\nhaving won the Dixson scholarship for pure and applied mathematics, the Professor Wilson prize for mathematics and natural philosophy, and the Wyselaskie scholarship in mathematics. After he graduated, with World War I still being fought, he enlisted in the Australian Imperial Force. He was assigned to the Australian Flying Corps where, by his own account, he\n(\nsee\n[\n1\n]\nor\n[\n4\n]\n)\n:-\n... learnt telegraphy and solo whist.\nHis service with the Flying Corps was short\n(\nfrom\n25\nJuly\n1918\nto\n24\nDecember\n1918)\n, and he then began to study medicine at the University of Melbourne. However, his real love was mathematics and his godfather, Sir John MacFarland the Chancellor of the University of Melbourne, offered to lend him sufficient funds to study mathematics at the University of Cambridge in England. He jumped at the chance and entered Trinity College, Cambridge. The high quality of his work led to him receiving a Senior Scholarship and an Isaac Newton studentship. He graduated with a B.A. in\n1922\nand a doctorate in\n1924\n. His Ph.D. thesis\nDifferential Equations Of Dynamics\nwas written under guidance from\nHenry Baker\nand\nRalph Fowler\n. His first papers\nOn the form of the solution of the equations of dynamics, On Poincaré's theorem of 'the non-existence of uniform integrals of dynamical equations'\n, and\nNote on the employment of angular variables in celestial mechanics\nwere all published in\n1924\nand\nSome examples of trajectories defined by differential equations of a generalised dynamical type\nin the following year. Of these four papers, the third appeared in the\nMonthly Notices of the Royal Astronomical Society\nwhile the other three were published by the\nCambridge Philosophical Society\n.\nIn\n1924\nCherry won the Smith prize for applied mathematics and was elected a fellow of Trinity College. He undertook research on ordinary differential equations, particularly those arising from dynamics and celestial mechanics, for four years. Although based at Cambridge, he had two periods away. The first was the academic year\n1924\n-\n25\nwhich he spent at the University of Manchester teaching courses which had been taught by\nChapman\nwho had resigned as Professor of Applied Mathematics\n(\nMilne\nwas appointed to fill the chair from\n1925)\n. Cherry also spent one term teaching at the University of Edinburgh in\n1927\nsubstituting for Charles Galton Darwin\n(\nson of\nGeorge Howard Darwin\n)\n.\nDuring his time as a fellow of Trinity College, Cherry spent time with his two main hobbies, mountaineering and scouting. As well as climbing many mountains in Britain, he also climbed the Matterhorn in Switzerland and mountains in the French Pyrenees. As a scoutmaster in Cambridge he met Olive Ellen Wright who was a Girl Guide leader. Although Cherry returned to Australia in\n1929\n, he came back to England to marry Olive on\n24\nJanuary\n1931\nin Holy Trinity parish church, Cambridge; they had one daughter Jill. In fact Cherry had returned to Australia in March\n1929\nto take up a professorship at the University of Melbourne. His chair was titled 'Mathematics, Pure and Mixed'\n(\n'Pure and Mixed' would be 'Pure and Applied' in today's terminology\n)\n. He held this chair until\n1952\nwhen the University of Melbourne decided to create separate chairs of 'Pure Mathematics' and 'Applied Mathematics'. He could have chosen either, and he certainly did not find it an easy decision to make, but eventually chose 'Applied Mathematics'. He held this chair until he retired in\n1963\n. A note which he wrote explains the reason why a decision between the chairs of pure or applied mathematics was so difficult for him. He wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nWhile I am interested in the facts of Nature, I am much more interested in scientific theories, and particularly in fundamental questions, e.g. whether the classical principles of dynamics form a sufficient foundation for Statistical Mechanics. When such questions are formulated mathematically, they become problems in pure mathematics, and it is really to this subject that most of my work belongs. On the fundamental questions themselves I have perhaps arrived at understanding, but have found nothing sufficiently interesting to publish.\nCherry explains his attitude towards leading the Mathematics Department at the University of Melbourne, and in particular he describes his love of teaching\n(\nsee for example\n[\n1\n]\n)\n:-\nFor over\n20\nyears I was responsible for the whole mathematical syllabus, pure and applied, and I have always regarded the associated teaching as my chief responsibility. For over a decade the stint was four courses of lectures per term. Since I am really attached to teaching this was no burden. At one time or another I have taught every subject in the curriculum, at all levels.\nLet us look more closely at a few of Cherry's papers to give at least an indication of the topics on which he undertook research. In\n1937\nhe published\nTopological Properties of the Solutions of Ordinary Differential Equations\nand in\n1947\nhe published the first part of\nFlow of a compressible fluid about a cylinder\n.\nA Gelbart\nwrites in a review:-\nThe author states that he has solved the problem of finding the exact solution of a two-dimensional uniform flow of a compressible perfect fluid about a cylinder. He assumes that the circulation is zero and the speed at large distances from the cylinder is subsonic, though this need not be so in the neighbourhood of the cylinder. The solution contains an infinite number of parameters which theoretically can be fixed to determine the shape of the cylinder .... Since the author uses the solutions of\nChaplygin\n, in the form of an infinite series of hypergeometric functions, of the linear second order partial differential equation in the hodograph variables of the potential function, this series diverges for values of the velocity whose speeds exceed the speed at infinity. The essential part of the paper is to overcome this difficulty by successfully continuing \"analytically\" the solutions into the region of higher speeds.\nIn the second part of the paper, published two years later, Cherry extended his results to cover the case where circulation is not zero. Also in\n1949\nhe published\nNumerical solutions for transonic flow\nwhich:-\n... presents the flow patterns past a cylinder, produced by superposition of a cosine-term solution and a sine-term solution to that generated from an incompressible flow past a cylinder without circulation.\nIn\nOn expansions in eigenfunctions, particularly in Bessel functions\n(1949)\nCherry gives a form of the integral theorems of\nFourier\n,\nHankel\nand\nHeinrich Weber\nwhich is applicable to functions which are exponentially large at infinity.\nIn his own notes, Cherry gives us a good insight into his personality and approach to research\n(\nsee for example\n[\n1\n]\n)\n:-\nBy taste, or upbringing, I have preferred always the \"do it yourself\" method. This began when, at the age of seven, my attendance at school involved a walk of nearly four miles every day. With the help of prizes and scholarships, whose attainment involved little effort for me, I have been practically self-supporting since the age of\n17\n. I have \"directed\" the initial research efforts of a fair number of students, but by force of circumstances, reinforced by inclination, I have not tried to form a \"research school\".\nHe related these comments on his personality to his hobbies:-\nMy love of camping and mountaineering connects in one direction with 'do it yourself' and in another direction - via the shapes of hills - with geometry and mathematics.\nIn early\n1965\nCherry suffered a heart attack after a particularly difficult incident during his climbing. He made a quick recovery and continued to work at his usual strenuous pace, spending the academic year\n1965\n-\n66\nat the University of Washington in Seattle. However he died following a second heart attack in November\n1966\n.\nCherry received many distinctions for his contributions to mathematics. he was awarded the Lyle medal by the Australian National Research Council in\n1951\n, he became a Foundation Fellow of the\nAustralian Academy of Science\nin\n1954\n, and was elected a fellow of the\nRoyal Society of London\nin\n1954\n. He received honorary degrees from the Australian National University and the University of Western Australia in\n1963\n. He was made a Knight Bachelor in\n1965\n.  He served as president of the Mathematics Association of Victoria during\n1929\n-\n34\nand again during\n1946\n-\n48\n, he was foundation president of the\nAustralian Mathematical Society\nduring\n1956\n-\n58\n, and also foundation president of the Victorian Computer Society during\n1961\n-\n63\n. During\n1961\n-\n64\nhe was president of the\nAustralian Academy of Science\n, being the third president of the Academy.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}