{
  "nome_completo": "Udo Hugo Helmuth Wegner",
  "nome_curto": "Udo Wegner",
  "ano_nascimento": "1902",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wegner/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Heidelberg, Germany",
  "biografia": "Udo Wegner\n's parents were Hugo Wegner, a businessman, and Luise Cliemé. After attending school in Berlin, Udo Wegner began his university studies at the Friedrich-Wilhelm-University of Berlin in the summer semester of\n1921\n. He attended a wide range of courses on mathematics, physics, chemistry, and astronomy. He graduated in\n1925\nand, from October\n1925\nto October\n1931\n, Wegner was first an assistant at the Astronomisches Rechen-Institut\n(\n\"Astronomical Calculation Institute\"\n)\nat Berlin-Dahlem, which at that time was part of the University of Berlin. During his time there he published\nEin weiterer Beitrag zur Integralgleichung des Strahlungsgleichgewichtes und deren Verallgemeinerung\nⓉ\n(\nA further contribution to the integral equation of radiative equilibrium and its generalization\n)\n(1927)\nand\nÜber die Integralgleichung des Strahlungsgleichgewichtes und deren Verallgemeinerung\nⓉ\n(\nOn the integral equation of radiative equilibrium and its generalization\n)\n(1927)\n. In\n1928\nWegner, in collaboration with\nFindlay Freundlich\nand\nEberhard Hopf\n, published\nOn the integral equation for radiative equilibrium\nin the\nMonthly Notices\nof the\nRoyal Astronomical Society\n. Also in the same year he published\nVergleich zwischen dem vorläufig verbesserten neuen Fundamentalkatalog von Auwers und den Fundamentalkatalogen von Boss und Eichelberger für\n1925\nⓉ\n(\nA comparison between the provisional improved new fundamental catalog of Auwers and the fundamental catalogs of Boss and Eichelberger for\n1925\n)\n.\nWegner also spent a period as an assistant at the University of Bonn, and finally at the University of Göttingen. It was at Göttingen that he undertook research for his doctorate, advised by\nIssai Schur\n, and on\n12\nOctober\n1928\nhe was awarded his doctorate for his\n28\n-page thesis\nÜber die ganzzahligen Polynome, die für unendlich viele Primzahlmoduln Permutationen liefern\nⓉ\n(\nOn the integer polynomials that provide the permutations of an infinite number of prime moduli\n)\n. The second examiner at the oral examination had been\nLudwig Bieberbach\n. In\n1929\nhe\nhabilitated\nat the University of Göttingen for Pure Mathematics, Applied Mathematics and Theoretical Astronomy. The following four papers, all published in\n1931\n, were submitted from Göttingen:\nEin Satz über auflösbare Polynome vom Primzahlgrad\n;\nⓉ\n(\nA theorem on solvable polynomials of prime degree\n)\nCharakterisierung der binomischen Körper vom Primzahlgrad\n;\nⓉ\n(\nCharacterizing the binomial group of prime degree;\n)\nZur Arithmetik der Polynome; and Zum Vielkörperproblem\nⓉ\n(\nOn the arithmetic of polynomials; and the many-body problem\n)\n. During the years\n1929\n-\n31\nat Göttingen, Wegner was\nRichard Courant\n's assistant. On\n6\nApril\n1931\nhe was appointed as an ordinary professor at the Technische Hochschule in Darmstadt. The authors of\n[\n6\n]\nclaim:-\nWegner's appointment to Darmstadt was partially based on false information from him about an alleged position as assistant to the Berlin mathematician Georg Wilhelm Scheffers\n(1866\n-\n1945)\n. What was known in\n1931\nled to some turmoil, but Wegner's appointment was not prevented.\nShortly after his appointment, he submitted three further papers all of which appeared in\n1931\n:\nÜber ein algebraisches Problem\n;\nⓉ\n(\nOn an algebraic problem;\n)\nZur Theorie der linearen Differentialgleichungen\n;\nⓉ\n(\nOn the theory of linear differential equations;\n)\nand\nÜber einen Satz von Dickson\nⓉ\n(\nOn a theorem of Dickson\n)\n. In January\n1932\nhe submitted the paper\nZur Theorie der auflösbaren Gleichungen von Primzahlgrad. I\nⓉ\n(\nOn the theory of resolvable equations of prime degree. I\n)\n, which he dedicated to \"his revered teacher and friend\nG Herglotz\nfor his birthday\". We note that\nGustav Herglotz\nheld the chair of Applied Mathematics at Göttingen and was\n50\nyears old on\n2\nFebruary\n1931\n.\nUp to this point we have not mentioned Wegner's political views but we must do so now since they play an important role in the events which took place over the next few years. In\n1933\nthe National Socialist party came to power in Germany. Wegner had been a supporter of this party before this and so for him this promised to help him in his career. Wegner joined the SA\n(\nthe\nSturmabteilung\nwhich functioned as the original paramilitary wing of the Nazi Party\n)\nin\n1933\n, but there is no evidence he took an active part in SA activities. On\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities.\nRichard Courant\nwas forced out of Göttingen in May\n1933\nand his chair had to be filled.\nHelmut Hasse\nwas appointed in April\n1934\nbut the authorities, unsure if\nHasse\nwas committed to National Socialist policies, tried to appoint someone to a second chair at Göttingen who was a firm Nazi supporter. Wegner was a strong candidate but in the end it was decided that, despite his strong support of the National Socialists, his mathematical ability was not suitable for a chair at Göttingen. Erhard Tornier\n(1894\n-\n1982)\n, an ardent Nazi, was appointed to the second Göttingen chair.\nArthur Rosenthal had been promoted to ordinary professor of mathematics at the University of Heidelberg in\n1930\nand in\n1933\nhe was also dean in the faculty of mathematics and natural sciences. Because he was Jewish he was forced out by the Nazis and in\n1936\nhe moved to the Netherlands before emigrating to the United States in\n1939\n. The University of Heidelberg sought to fill the vacant chair. First it was offered to\nEberhard Hopf\n, but he turned it down, preferring to go to Leipzig. The chair was then offered to Wegner who accepted it on\n19\nNovember\n1936\n. However, the appointment was controversial. The chemist Karl Freudenberg is quoted in\n[\n5\n]\n:-\n[\nWegner's\n]\nappointment to Rosenthal's chair went through without the knowledge of a portion, and indeed a non-National Socialist portion, of the faculty. ... In a normal appointment process, as was customary prior to National Socialism, Wegner would certainly not have been appointed at Heidelberg.\nIt is true that the Baden Ministry of Culture was particularly keen on appointing Wegner, certainly because of his political views.\nHerbert Seifert\nwho was also a mathematics professor at Heidelberg, stated in\n1947\nthat Wegner would have had little chance of being appointed to Heidelberg in a properly conducted appointment process.\nWilhelm Süss\n, in a letter written in November\n1944\n, stated that \"The scientific achievements of Udo Wegner are highly controversial.\" These statements seem a harsh judgement on Wegner's mathematical achievements and are no doubt coloured to some extent by his political views. However, they must also be seen in the light of the comments made by\nWilhelm Süss\nabout Wegner's character.\nSüss\nclaimed that Wegner was a pathological liar who was mistrusted and shunned by his colleagues. This is supported by statements in\n[\n5\n]\n:-\nHe pursued the habilitation of the mathematician Helmut Joachim Fischer, a keen National Socialist, and indeed in opposition to the recommendation of his colleague\nHerbert Seifert\n. Wegner declared that a decree existed according to which inadequate academic performance could be compensated for by political service. ... In the faculty he built his position of power ever more recklessly according to the \"Führerprinzip.\" The operation of the Führerprinzip went so far that he, as it later appeared, misused the authority of his office in that he undertook the granting of doctorates which in every way went against the proper procedures for doctorates and were kept secret from the faculty.\nThe dispute between Wegner and\nSeifert\nover Helmut Joachim Fischer's habilitation thesis was the first of several arguments between the two. The next confrontation came in\n1938\nwhen Wegner invited\nLudwig Bieberbach\nto lecture in Heidelberg.\nBieberbach\n's lecture,\nThe ethnic roots of science. Types of mathematical creativity\n, was not on a mathematical topic but on his anti-Semitic \"German mathematics\" theme. The invitation to\nBieberbach\nto give this lecture was typed above the signatures of Wegner and\nSeifert\n. However,\nSeifert\nhad not signed the invitation and only saw the invitation with his forged signature after the lecture was announced to the Institute in Heidelberg and to neighbouring universities.\nSeifert\ndid not welcome\nBieberbach\nto Heidelberg, nor did he attend his lecture. Another argument arose over the habilitation of Friedrich Ringleb\n(1900\n-\n1966)\n. Ringleb had been awarded a doctorate by Jena but had made a number of unsuccessful attempts to habilitate at Jena in the\n1930\ns. He published a book 'Mathematical Methods in Biology, especially on genetics and racial research' in\n1936\n. Ringleb then attempted to habilitate at Heidelberg but was rejected by\nSeifert\n. However, in January\n1940\nSeifert\nmade a visit to Braunschweig and, while he was absent, Wegner approved Ringleb's habilitation. Wegner claimed that his approval was given using a law that stated that a lack of scientific achievements could be offset by political merits.\nWegner had written an article in Volume\n2\nof\nDeutsche Mathematik\nin\n1937\nwhich was in support of\nBieberbach\n's ideas concerning mathematics and race\n[\n4\n]\n:-\nWegner stressed that mathematics has epistemological value and is not just playing with symbols. Mathematics is linked to art and music as equal expressions of 'völkisch' qualities. German thought is linked to Greek thought in mathematics, as is the German relationship to \"nature\". Citations range from\nPlato\nand Xenophon to the famous French historian Hippolyte Taine, and on to the \"classic\" racist writer Houston Stewart Chamberlin, and the contemporaries Vahlen and Lenard.\nBieberbach\nhas clearly been a source, though he is not explicitly cited.\nThrough the years leading up to World War II and during the war years, there were very few students at the University of Heidelberg. Wegner tried hard to improve the situation arguing that Heidelberg, the oldest German university, should not fall behind universities like Frankfurt and Tübingen. On\n21\nJanuary\n1941\nhe was appointed Dean of the Natural Sciences and Mathematics Faculty; a short time later he was promoted to be the deputy to the rector Paul Schmitthenner. He continued to hold both these roles until the end of the war.\nWegner tried to create an aeronautical research institute at Heidelberg in\n1943\nbut despite drawing up ambitious plans nothing came of the idea. Wegner himself was working on applications of function theoretical methods to fluid dynamics, looking at applications of conformal mappings to aeronautical research. Up until\n1943\nWegner worked on this on his own but after this time others were added to his team doing work considered important for the war effort. Despite the difficulties and staff shortages, Wegner was able to maintain the range of lectures offered to the mathematics students at Heidelberg. By\n1943\nGermany was suffering badly through bombing by the Allies but Heidelberg escaped.\nWilhelm Blaschke\nwas the professor at Hamburg but, while he was on holiday in the Tyrol with his wife, his house in Hamburg was completely destroyed in a bombing raid. Wegner invited\nBlaschke\nto Heidelberg saying he was sorely needed there and could participate in military research.\nBlaschke\nwas keen to accept but he was forced to return to Hamburg.\nOn\n30\nMarch\n1945\nHeidelberg was occupied by American troops; the university was closed on the following day. Wegner was arrested at his home on\n4\nApril\n1945\nand detained, but released in May\n1945\nbecause of serious illness. The charges against Wegner were listed, he was charged with criminal acts and held under house arrest. His dismissal from the University of Heidelberg took place on\n19\nNovember\n1945\n. After settlement of the charges through the denazification proceedings, Wegner went to France. From\n1946\nto\n1949\nhe worked at the Office National d'Études et de Recherches Aéronautiques in Paris. He worked as a\nGymnasium\nteacher at the English Institute from\n1949\nto\n1956\n. Wegner wrote two letters to\nRichard Courant\nin\n1949\n(\nquoted in\n[\n4\n]\n)\n:-\nI allow myself to ask this question, because I know that you, dear Herr\nCourant\n, always have good advice, for you have helped me in all life situations in the most touching way. ...\nWegner wanted to obtain money to expand a school which:-\n... aims not only to impart information, but also to stimulate creative thinking and to educate cosmopolitan, well-reared, self-secure, and free-thinking people ... aims at the overcoming of nationalistic narrowness through education to European thinking.\nAs Sanford Segal writes\n[\n4\n]\n:-\nThese words were written in\n1949\nby a man who fifteen years previously had been esteemed as having served the Nazi cause long before\n30\nJanuary\n1933\n, and were addressed to a forced emigré!\nCourant\nreplied saying he could not be of any help to Wegner, adding:-\nI was interested in learning that you had left your position in France. As a matter of fact, I heard some rumours here that you were considering going even further away.\nIn\n1957\n, when\nCourant\nwas asked for a reference for Wegner to join an aeronautical institute in Brazil, he highly praised his mathematical abilities and added:-\nUndoubtedly you know that he belonged to the over-naive and maybe slightly opportunistic people who joined the Nazis. As a consequence my contacts with him have been discontinued. But I feel that he has amply suffered for his mistake and that his talents and other qualities should be used as much as possible.\nIn\n1951\nWegner lectured at the Technische Hochschule in Darmstadt and in\n1952\nat the Technische Hochschule in Karlsruhe. Only in\n1956\ndid Wegner get a permanent academic position when he was appointed as an Ordinary Professor and Director of the Institute of Applied Mechanics at the University of Saarbrücken. He spent\n1965\n-\n1966\nas a visiting professor at the Technische Hochschule in Aachen, then from\n1\nOctober\n1966\nto\n30\nSeptember\n1970\nhe was an Ordinary Professor and Director of Institute for Mechanics at the University of Stuttgart. He retired at the end of September\n1970\nand returned to Heidelberg.\nWegner was elected to the\nHeidelberg Academy of Sciences\nin\n1941\n. He remained in the Academy until\n1953\n. He was honoured with the award of an honorary degree from the Technische Hochschule in Karlsruhe in\n1964\n. In\n1972\n, to celebrate his\n70\nth\nbirthday,\nBeiträge zur Mechanik\n(\nFestschrift Udo Wegner\n)\nⓉ\n(\nContributions to mechanics\n(\nFestschrift for Wegner\n)\n)\nwas published by the University of Stuttgart. This contains dedications and eleven articles dedicated to Wegner on his\n70\nth\nbirthday.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Logic",
    "Number Theory"
  ]
}