{
  "nome_completo": "Vera Martha Winitzky de Spinadel",
  "nome_curto": "Vera Spinadel",
  "ano_nascimento": "1929",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Spinadel/",
  "lugar_nascimento": "Buenos Aires, Argentina",
  "lugar_morte": "Buenos Aires, Argentina",
  "biografia": "Vera Spinadel\nwas given the name\nVera Martha Winitzky\nand only became known as\nVera Spinadel\n,\nVera de Spinadel\nor\nVera W de Spinadel\nafter her marriage to Erico Spinadel. She was the daughter of Alejandro Winitzky and Rosa Schajnovidze. Vera attended both primary and secondary school in Buenos Aires before entering the Faculty of Exact and Natural Sciences of the University of Buenos Aires in\n1947\n.\nWhen Vera began her studies of mathematics at the University of Buenos Aires,\nJulio Rey Pastor\nwas head of mathematics and\nAlberto González Domínguez\n(1904\n-\n1982)\nwas a full professor. Vera was taught by\nGonzález Domínguez\nwho had strong links to a broad range of leading mathematicians throughout the world. He worked on mathematical analysis, in particular on the theory of probability, the theory of distributions and applications to quantum physics. Vera's mathematical interests were broad and she studied applications of mathematics to architecture, economics and engineering. While an undergraduate, in\n1949\nshe attended lectures on meteorology at the Servicio Meteorológico Nacional. From\n1949\nto\n1952\nshe undertook research on seismology in the Department of Geophysics, Servicio Meteorológico Nacional, under the direction of Otto Schneider. In July\n1952\nVera graduated with the degree of Bachelor of Physical-Mathematical Sciences.\nAfter the award of her Bachelor's degree, Vera was appointed as a Special Mathematics Teaching Assistant in the Faculty of Economic Sciences at the University of Buenos Aires. There, in\n1952\n, she took part in two mathematics seminars directed by\nAlberto González Domínguez\non\nDivisors of Zero in the Algebra D\nand\nFundamentals of Mikusinski's Operational Calculus\n[\n3\n]\n:-\nVera reported that she felt insecure thinking about how much she still needed to learn to work as a teacher, but she ended up accepting\n[\nthe position\n]\nand started teaching classes in mathematics and architecture. Passionate about mathematics, she decided to deepen her studies by studying for a doctorate in Mathematical Sciences at the same university where she had studied and was working.\nIn July\n1954\nshe was a delegate from the University of Buenos Aires to the Colloquium \"Some Mathematical Problems that are being studied in Latin America\", which was held in Villavicencio, Mendoza.\nTwo people now played a large part in her life, Erico Spinadel\n(1929\n-\n2020)\nand Emilio Oscar Roxin. We should look briefly at this.\nErico Spinadel\n(1929\n-\n2020)\nwas an Austrian, born in Vienna on\n6\nMay\n1929\n. He moved to Argentina in\n1938\nand studied at the Escuela Industrial de la Nación Otto Krause in Buenos Aires from\n1943\nto\n1948\n. He then entered the University of Buenos Aires and was in the same classes as Vera for some of the mathematics courses he took as part of his engineering degree. Both Vera and Erico graduated in\n1952\nand Erico then worked from\n1952\nto\n1955\nfor a firm that manufactured centrifugal and deep well pumps. Vera and Enrico married on\n30\nJune\n1955\n. They had four children: Laura Patricia Spinadel\n(\nborn\n7\nJuly\n1958)\n, who became a leading architect and university professor; Pablo Spinadel, who became an electronic engineer with a Ph.D. in flexible automation from the University of Vienna; Irene Spinadel, who studied psychology, worked as a psychotherapist but from\n2002\nhas had a literary career in Spain; and Andrea Gisela Spinadel, who became an artistic director.\nEmilio Oscar Roxin undertook research at the University of Buenos Aires with Alberto González Domínguez as his thesis advisor.\nGonzález Domínguez\nwas appointed as a member of the board of directors of the National Atomic Energy Commission of Argentina in October\n1955\n. Vera Spinadel attended a course on Nuclear Reactors at the Comisión Nacional de Energía Atómica in San Carlos de Bariloche in\n1955\nand for the following few years undertook research on nuclear reactors advised by Fidel Alsina Fuertes. For this research she collaborated with Emilio Roxin and they published two joint works in the Internal Publications Series of the Comisión Nacional de Energía Atómica, namely\nCálculo del Factor de Utilización Térmica\nⓉ\n(\nCalculation of the thermal utilization factor\n)\n(1956)\nand\nSobre un Problema de Cinética de Reactores\nⓉ\n(\nOn a reactor kinetics problem\n)\n(1957)\n. The Argentine Atomic Energy Commission was planning for the start of construction of the RA-\n1\nreactor, the first reactor to start up in all of Latin America and the southern hemisphere, and, in\n1956\n, Spinadel worked on the calculation of the critical mass of the RA-\n1\nReactor. Construction of the reactor began in April\n1957\n. Beginning in\n1956\nSpinadel participated in a seminar on Non-Linear Differential Equations, directed by Emilio Roxin.\nIn May\n1958\nSpinadel submitted her thesis\nTeoría de las Zonas Alcanzables en Sistemas Bidimensionales\nⓉ\n(\nTheory of reachable areas in two-dimensional systems\n)\nand was awarded the degree of Ph.D. in September of that year. With this she became the first woman to obtain a doctorate in mathematics from the University of Buenos Aires. You can read a translation of the Introduction to her thesis at\nTHIS LINK\n.\nSeveral references give Spinadel's thesis advisor as Emilio Roxin but this seems to be an error. In her thesis Spinadel does not acknowledge help from any thesis advisor but she does reference her joint paper with Emilio Roxin, namely\nSobre un Problema de Sistemas de Ecuaciones Diferenciales Lineales\nⓉ\n(\nOn a problem of systems of linear differential equations\n)\n, as \"to appear\". It was published later in\n1958\n. Emilio Roxin submitted his thesis\nPuntos y zonas alcanzables en sistemas autónomos perturbados en forma arbitraria\nⓉ\n(\nReachable points and areas in arbitrarily perturbed autonomous systems\n)\nto the University of Buenos Aires in April\n1958\n, one month before Spinadel submitted her thesis. In it he expresses his thanks to Vera Spinadel and to\nAlberto González Domínguez\nand also references his joint paper with Spinadel as \"to appear\".\nIn\n1957\nSpinadel was appointed as Acting Adjunct Professor, Chair of Mathematics II, Faculty of Architecture and Urbanism. She was promoted to Regular Associate Professor in the same chair in\n1962\n. In addition, she later held professorships in the Faculty of Exact Sciences and in the Faculty of Economic Sciences.\nIn\n1985\nthe Faculty of Architecture and Urbanism set up five new courses concerning design. Spinadel discussed the content of these new courses with her students and realised that since there was only a very basic mathematical content, students were exposed to no in-depth mathematical studies. She decided that the design courses required content which explored the mathematical-scientific side so that students could develop more creative processes. It was important, she believed, to emphasise that nature was non-linear and could not be modelled by a linear approach. She had also read\nBenoit Mandelbrot\n's book\nThe fractal geometry of nature\n published in\n1982\nand wanted to introduce graphic representation and the use of fractals into teaching design. She published papers on teaching graph theory, for example\nLas redes y sus aplicaciones\nⓉ\n(\nNetworks and their applications\n)\n(1989)\n, and the paper\nDivisibility and Cellular Automata\nin the journal\nChaos, Solitons and Fractals\nin\n1995\n. In\n1995\nshe was appointed Director of the Centre for Mathematics and Design in the Faculty of Architecture, Design and Urbanism.\nSpinadel began publishing work on \"Metallic Numbers\" in\n1997\n. The paper\n[\n6\n]\nintroduces these concepts and has the following Abstract:-\nThe objective of this work is to introduce a new family of quadratic irrational numbers. The family is called Metallic Numbers and its most conspicuous member is the Golden Number. Other members of the family are the Silver Number, the Bronze Number, the Copper Number, the Nickel Number, etc. All of them have interesting common mathematical properties, which are analysed in detail.\nThe main results obtained in this research work are:\n1)\nthe members of the family are closely related to the quasi-periodic behaviour in non-linear dynamics, thus being of great help in the search for universal paths that lead from \"order\" to \"chaos\";\n2)\nthe sequences based on the members of this family have many additive properties and are simultaneously geometric sequences, which is why they have been the basis of various systems of proportions in Design.\nThese two facts indicate the existence of a promising bridge that unites the most recent discoveries in technology with art, through the analysis of fundamental relationships between Mathematics and Design.\nThe reader has almost certainly heard of the Golden Number but may wonder about \"the Silver Number, the Bronze Number, the Copper Number, the Nickel Number, etc.\" Spinadel's Metallic Numbers belong to her \"metallic means family\"\n(\nMMF\n)\nand are positive solutions of the equation\nx\n2\n−\np\nx\n−\nq\n=\n0\nx^{2} - px - q = 0\nx\n2\n−\np\nx\n−\nq\n=\n0\nfor different values of\np\np\np\nand\nq\nq\nq\n, namely\nσ\np\n,\nq\n=\n1\n2\n(\np\n+\n√\n(\np\n2\n+\n4\nq\n)\n)\n\\sigma_{p,q} = \\large\\frac{1}{2}\\normalsize (p + √(p^{2}+ 4q))\nσ\np\n,\nq\n​\n=\n2\n1\n​\n(\np\n+\n√\n(\np\n2\n+\n4\nq\n)\n)\n.\nFor\np\n=\n1\n,\nq\n=\n1\np = 1, q = 1\np\n=\n1\n,\nq\n=\n1\nwe get the\nGolden Number\nσ\n1\n,\n1\n=\n1\n2\n(\n1\n+\n√\n5\n)\n\\sigma_{1,1} = \\large\\frac{1}{2}\\normalsize (1+ √5)\nσ\n1\n,\n1\n​\n=\n2\n1\n​\n(\n1\n+\n√\n5\n)\nwhich is the limit of the ratio of two consecutive\nFibonacci\nnumbers.\nFor\np\n=\n2\n,\nq\n=\n1\np = 2, q = 1\np\n=\n2\n,\nq\n=\n1\nwe get the\nSilver Number\nσ\n2\n,\n1\n=\n1\n+\n√\n2\n\\sigma_{2,1} = 1+ √2\nσ\n2\n,\n1\n​\n=\n1\n+\n√\n2\nwhich is the limit of the ratio of two consecutive\nPell\nnumbers.\nFor\np\n=\n3\n,\nq\n=\n1\np = 3, q = 1\np\n=\n3\n,\nq\n=\n1\nwe get the\nBronze Number\nσ\n3\n,\n1\n=\n1\n2\n(\n3\n+\n√\n13\n)\n\\sigma_{3,1} = \\large\\frac{1}{2}\\normalsize (3 + √13)\nσ\n3\n,\n1\n​\n=\n2\n1\n​\n(\n3\n+\n√\n1\n3\n)\nwhich plays an important role in the study of dynamical systems and quasicrystals.\nFor\np\n=\n1\n,\nq\n=\n2\np = 1, q = 2\np\n=\n1\n,\nq\n=\n2\nwe get the\nCopper Number\nσ\n1\n,\n2\n=\n2\n\\sigma_{1,2} = 2\nσ\n1\n,\n2\n​\n=\n2\n.\nFor\np\n=\n1\n,\nq\n=\n3\np = 1, q = 3\np\n=\n1\n,\nq\n=\n3\nwe get the\nNickel Number\nσ\n1\n,\n3\n=\n1\n2\n(\n1\n+\n√\n13\n)\n\\sigma_{1,3} = \\large\\frac{1}{2}\\normalsize (1 + √13)\nσ\n1\n,\n3\n​\n=\n2\n1\n​\n(\n1\n+\n√\n1\n3\n)\n.\nHere are Spinadel's Conclusions in the paper\n[\n10\n]\n:-\nIn analysing, from a mathematical point of view, the similarities as well as the differences among the members of the MMF, it is obvious that these characteristics are strongly linked with the transition from periodic to quasi-periodic dynamics. But simultaneously, from the beginning of humanity, there have been philosophical, natural and aesthetic considerations that have given them primacy in the establishment of geometrical proportions based on some members of this family. Such a broad range of applications opens the road to new multi-disciplinary investigations that undoubtedly will contribute to clarifying the relations between art and technology, building a bridge that should join rational scientific thinking with aesthetical emotion. Hopefully, this new perspective could help us to confer on technology, from which we depend every day more and more for our survival, a more human character.\nFor information about other publications by Spinadel on the metallic means family, see\nTHIS LINK\n.\nIn an interview Spinadel gave\n(\nsee\n[\n2\n]\n)\nshe explained about the Golden Number:-\nI know it's a bit difficult to explain these mathematical things, but what matters is that the Greeks, who knew everything, wrote that number in public places in Athens with golden characters, hence the name golden number. The figure represented the order of each of the\n19\nyears in which the new moons occur again on the same days. What does it have to do with architecture? Everything! Because the Greeks themselves said that the harmony of forms depended on the golden number and, let me explain to you, the Parthenon is completely designed with that divine proportion. Wherever you look at it, the number\n1\n.\n61803398\nappears. Be careful, the Greeks did not invent it, there is data that civilisations as old as Babylon and Assyria used that number four thousand years ago.\nIn the same interview she explained that other numbers had been used by architects:-\nThis is not a condition exclusive to the golden number: there are other systems of proportions - such as the Cordovés - resulting from the research of a Spanish architect, Rafael de La Hoz, who was commissioned\n[\nin\n1973]\nto study the domes of the churches of the Córdova region of Spain. He assumed that there he would find the Golden Ratio, which arises from the pentagon, but what he found was a different ratio, which arises from the octagon. Thus he discovered a number that was used for the design of these domes and is called the Cordovan number. Here, in the province of Córdoba, it was also applied, of course, in the churches.\nLet us note that the Cordovan number is\n1\n(\n2\n−\n2\n)\n\\Large\\frac 1 {\\sqrt{}(2-\\sqrt{}2)}\n​\n(\n2\n−\n​\n2\n)\n1\n​\n. It is the ratio between the radius of a regular octagon and the length of its side.\nSpinadel was an organiser of the First International Conference on Mathematics and Design held in\n1995\nand of the Second International Conference on Mathematics and Design held in San Sebastian, Spain in June\n1998\n. She was one of the organisers of the Third International Conference on Mathematics and Design held in Melbourne, Australia in\n2001\n. She edited the Proceedings of the Fourth International Conference on Mathematics and Design which was held in Buenos Aires. The\n9\nth International Congress on Mathematical Education was held in the convention centre in Makuhari outside Tokyo, Japan, from\n31\nJuly  to\n6\nAugust\n2000\n. Spinadel attended the Congress having been invited to organise the Study Group on Art and Mathematics Education. In\n2001\nshe served on the Board of the 'International Society for Mathematical and Computational Aesthetics'.\nIn April\n2005\n, Spinadel founded the Mathematics and Design Laboratory of the University of Buenos Aires. Three years later she was elected president of the International Mathematics and Design Association, which organises international congresses and publishes the\nJournal of Mathematics and Design\n. She served on the editorial board of the\nSmarandache Notions Journal\nand of the journal\nNonlinear Dynamics and Systems Theory\n.\nIn\n2010\nSpinadel retired and, in September of that year, was made Professor Emeritus in the Faculty of Architecture, Design and Urbanism.\nLet us end by quoting Spinadel's own description of her work\n[\n1\n]\n:-\nThe main objective of my work is to bring together mathematicians, architects, engineers and designers interested in the interaction between mathematics and design. I use the word design in its broadest sense, that is, a design is a planning resource that constitutes a basic element in interdisciplinary communication between human beings, whether architectural, graphic, visual or sound, as well as any other simple or combined interaction.\nIn\n2018\nthe Vera W de Spinadel Award was set up. It invites students from any part of the world to discover and interpret new applications to the design of the proportions of Spinadel's Family of Metallic Numbers.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}