{
  "nome_completo": "Victor Alexandre Puiseux",
  "nome_curto": "Victor Puiseux",
  "ano_nascimento": "1820",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puiseux/",
  "lugar_nascimento": "Argenteuil, Val-d'Oise, France",
  "lugar_morte": "Frontenay, Jura, France",
  "biografia": "Victor Puiseux\n's parents were Louis Victor Puiseux\n(1783\n-\n1858)\nand Louise Neveux\n(1792\n-\n1835)\n. Louis Victor Puiseux was born in Paris on\n23\nJune\n1783\nand became a tax collector. Let us explain what this job entailed. In France at this time there were indirect taxes on leather, tallow, starch, gold and silver items, and iron items. Louis Victor was an accountant whose job was to collect the taxes on these goods. He married Louise Neveux at Thiancourt on\n12\nMay\n1813\n. Louise, the daughter of Jean-Nicolas Neveux, a doctor in Pont-à-Mousson who had died in the\n1790\ns, and Thérèse Husson, was born on\n6\nFebruary\n1792\n. Louis-Victor and Louise had three children, François Léon Puiseux born on\n8\nApril\n1814\nin Jumilhac, Aquitaine, Victor Alexandre Puiseux the subject of this biography, and a daughter born in\n1832\nwho died within a year. François Léon Puiseux studied at the colleges of Pont-à-Mousson, Metz and Henri IV in Paris, and entered the École Normale in Paris in\n1834\n. He became an historian and a professor at the Lycée in Caen.\nThe Puiseux family moved to Longwy in Lorraine when Victor was only three years old, his father Louis-Victor being posted there to collect taxes. When Victor was four years old his mother tried to teach him to read but at first he refused to learn. His mother read him only the first half of various stories so that he had to learn to read to discover the way the plot ended. After some time when he continued to refuse to learn, saying he preferred to imagine the end, suddenly his attitude changed and he quickly learnt. From this time on was enthusiastic about learning. In\n1826\nLouis Victor Puiseux was posted to Pont-à-Mousson and his son Victor was brought up in that region of France. He attended the Collège de Pont-à-Mousson and while he was there his brother, who had completed his schooling in Paris and had just been accepted for admission to the École Normale, persuaded Victor also to complete his schooling in Paris.\nIn\n1834\nVictor went to Paris and became a boarder at the Collège Rollin. This college was founded as the collège Sainte-Barbe in\n1821\nand renamed the Collège Rollin in\n1830\n; it is now the Collège-Lycée Jacques-Decour on the Avenue Trudaine. At the Collège Rollin, Puiseux attended lecture courses by\nCharles Sturm\non special mathematics. He worked very hard, his only recreation being long walks that he loved. He was also visited frequently by his brother who was by this time studying at the École Normale. While he was in Paris, he received news that his mother had died. She died on\n17\nFebruary\n1835\n, a few days after her\n43\nrd birthday, from a chest infection. Puiseux's father asked his widowed sister-in-law Elizabeth if she would keep house for him and she agreed. They married two years later.\nShortly after his mother's death Puiseux decided to stop boarding at the Collège Rollin but to continue studying there as an external student. He took a small room on the Rue Saint-Jacques. In\n1836\nPuiseux sat the Concours général, the most prestigious academic competition for high school students in France. He received the First Prize in physics in this competition and the Second Prize in mathematics. He was ranked fourth in the entrance examinations for the Naval College but turned down the offer of a place and sat the entrance examinations for the École Normale Supérieure. He performed outstandingly in these examinations but, being only\n16\nyears old, he was not allowed to enter the École so had to spend another year in Paris. At this stage he was on his own in Paris since his brother had completed his studies and left the city.\nIn the autumn of\n1837\n, he was admitted to the École Normale Supérieure, ranked as the top student in the entrance examinations. He became friends with the moral philosopher Ernest Bersot\n(1816\n-\n1880)\nwho had entered the École in\n1836\n. He also became friends with the mathematicians\nCharles Briot\n, who entered the École in\n1838\n, and with\nJean-Claude Bouquet\nwho entered the École in\n1839\n. Although passionately interested in science, Puiseux also spent much time in philosophical and religious discussions with his fellow students. William Fox writes\n[\n4\n]\n:-\nWhile a student at the normal school he took part in the religious discussions of the day, displaying strong convictions and a keen intelligence. He seconded the efforts of his friend and comrade in the school, Pierre Olivaint, founding with him a Society of St Vincent de Paul among the students and devoting a large part of his vacations to works of charity. His kindness, his charity, and above all his simple, unaffected modesty overshadowed even his talents.\nWe note that Pierre Olivaint\n(1816\n-\n1871)\nentered the École Normale Supérieure in\n1836\nwhere he studied history. He later entered the Jesuit order.\nIn\n1840\nPuiseux was placed first in his final examination at the École Normale Supérieure and spent another year studying in Paris. He took advantage of it to complete his mathematical training advised by world class mathematicians. He was asked at the same time to lecture to pupils of the École Normale Supérieure who had been his fellow students a few months earlier. They, for the most part, were older that him. He showed admirable qualities as a teacher at this time, displaying the talents he was to develop later in teaching courses at the Sorbonne. His thesis,\nSur l'invariabilité des grands axes des orbites des planètes, thèse d'astronomie présentée à la Faculté des sciences de Paris, le\n21\naoût\n1841\nⓉ\n(\nOn the invariability of the major axes of the orbits of the planets, thesis of astronomy presented at the Faculty of Sciences of Paris, August\n21\n,\n1841\n)\n, was on celestial mechanics and the stability of the solar system. In it he investigated questions which had been examined earlier by\nLaplace\n,\nLagrange\nand\nPoisson\n. On\n21\nAugust\n1841\nhe defended his thesis and was awarded his doctorate.\nFrom\n1841\nuntil\n1845\nPuiseux taught at the Collège Royal in Rennes. He had lots of free time and spent much of it walking in the countryside, enjoying nature but also thinking deeply about mathematics and mathematical astronomy. He appears to have been very sociable when in company but also enjoyed spending much time on his own. He remained at Rennes until\n1845\nwhen he was appointed professor of mathematics in the newly created Faculty of Science in Besançon. Another scientist appointed at the same time was the chemist Henri Étienne Sainte-Claire Deville\n(1818\n-\n1881)\nand Puiseux quickly became friends with his colleague Deville. It was at this time that he developed a passion for climbing, spending the summer vacations in the Alps mountaineering without a guide. During this period Puiseux published a series of more than ten papers in\nLiouville\n's\nJournal\n. He wrote on geometry, where he discovered new properties of\nevolutes\nand\ninvolutes\nand, mechanics where he studied the conical pendulum, the\ntautochrone\nand similar topics.\nOn\n2\nOctober\n1849\nhe married Laure Louise Fébronie Jannet at Versailles. Laure had been born at Valenciennes, Nord-Pas-de-Calais on\n29\nApril\n1830\n, the daughter of Jean-Louis François Jannet\n(1795\n-\n1861)\n, head of the Lycée of Versailles, and Sophie Fébronie Joseph Wallon\n(1811\n-\n1892)\n. Victor and Laure Puiseux had six children: Paul Louis Puiseux\n(\nborn\n18\nFebruary\n1851\n, died aged\n14\non\n6\nJanuary\n1866)\n; Louise Marie Laure Puiseux\n(\nborn\n28\nDecember\n1852\n, died aged\n21\non\n11\nMay\n1874)\n; Marie Fébronie Puiseux\n(\nborn\n20\nJuly\n1853\n, died aged\n18\non\n31\nMarch\n1872)\n;\nPierre Henri Puiseux\n(\nborn\n20\nJuly\n1855\n, became a mathematicians and astronomer with a biography in this archive, died\n28\nSeptember\n1928)\n; André Victor Puiseux\n(\nborn\n11\nSeptember\n1857\n, died aged\n3\nweeks later on\n1\nOctober\n1857)\n; and André Paul Puiseux\n(\nborn\n22\nNovember\n1858\n, died in\n1931)\n. We note that Puiseux's wife Laure died on\n2\nDecember\n1858\n, aged\n28\n, as a result of child birth. At this time the family lived at\n64\nrue de l'Ouest. Sophie Jannet, Laure's mother, became a widow in\n1861\nand, having no other family, she helped out looking after Puiseux and his children.\nPuiseux was appointed to the École Normale Supérieure as an assistant lecturer in differential calculus in\n1849\n, replacing\nJean-Marie Duhamel\n. He worked at the École Normale Supérieure during the years\n1849\nto\n1855\nand again between\n1862\nand\n1868\n. His task consisted of supplementing the lectures of the professors, such as\nDuhamel\n,\nLiouville\n, and\nCauchy\n, set exercises for students, correct them, explained them, and show where the ideas lead. He, with the other assistant lecturers, was also responsible for the entrance examinations at the École. At the same time, of course, he had to carry out his own researches. Writing about his time teaching at the École Normale,\nFelix Tisserand\nwrites\n[\n7\n]\n:-\nAll admired the elegance, the clarity, the rigour, and the sobriety of his lectures. A difficult proof made by him on the blackboard was presented with such naturalness and simplicity that the good students wondered if they could not have found it themselves.\nJules Tannery\nwas one of Puiseux's students at the École Normale. He describes being in Puiseux's lectures in\n[\n6\n]\n:-\nHis physical appearance was strange: a brush of red hair, dishevelled around the large forehead of a thinker, blue eyes extraordinarily sharp and brilliant ..., his appearance a little stooped, a certain embarrassment of his own person, an intimidating modesty; a voice a little shrill with a mellow lustre. He required respect from all: everyone always spoke to him with deference, did anyone ever dare to think otherwise of him? ... His patience and politeness were admirable. At that time, the pupils sometimes responded with absurdities when they were questioned about something they understood wrongly: Puiseux contented himself with saying in a very gentle tone: \"I do not know if I have heard correctly, or if I am wrong, but it seems to me that what you have said is not entirely accurate.\"\nIn\n1850\nhe published his thesis\nSur l'invariabilité des grands axes des orbites des planètes\nⓉ\n(\nOn the invariability of the major axes of the orbits of the planets\n)\n, written ten years before. Also in\n1850\nhe published, in the\nJournal de mathématiques pures et appliquées\n, the paper\nRecherches sur les fonctions algébriques\nⓉ\n(\nResearch on algebraic functions\n)\nand, in the following year in the same journal,\nNouvelles recherches sur les fonctions algébriques\nⓉ\n(\nNew research on algebraic functions\n)\n.\nIn\n1853\n-\n54\nhe was acted as a substitute for\nJacques Binet\nin astronomy at the Collège de France. From\n1855\nto\n1859\nhe worked at the Paris Observatory where he was director of the Bureau des calculs. He replaced\nCauchy\n, who was ill, giving the lecture course on celestial mechanics at the Faculty of Science in Paris in\n1856\n-\n57\n. In\n1857\nhe was appointed professor of mathematical astronomy at the Faculty of Science, having earlier taught courses there for\nLe Verrier\nafter he succeeded to\nCauchy\n's position. He also taught at the Sorbonne where he substituted for\nCharles Sturm\nand for\nLe Verrier\n. From\n1868\nto\n1872\nPuiseux held a post at the Bureau de Longitudes.\nIn the\n1860\ns every summer Puiseux took his five children on vacation to the French mountains where they all enjoyed very long walks. Some years they went to the Alps, some years to the Pyrenees. While on these holidays, Puiseux would write to Sophie Jannet, Laure's mother, and these letters show how grateful he was for her support for his family. Paul Puiseux died of typhoid fever in January\n1866\nwhile the family were living at\n64\nRue de l'Ouest.\nJules Tannery\nwrites in\n[\n6\n]\nabout Puiseux's reaction to the tragic death of his son:-\nHis conscience was excessive; it was said that, struck by the singularly cruel mourning, he had come to the École, at the usual hour, in spite of everything, to fulfil what he regarded as his duty, and he had to turn away to hide his tears. Those who saw the tears of this man always in control of himself, so hard on himself, have retained this memory full of anguish.\nSoon after, the family moved to\n81\nBoulevard Saint-Michel, where Sophie Jannet also took an apartment. She died at the age of\n93\nin\n1874\n. In\n1867\n, now with four children, Puiseux went for the summer holiday to Switzerland, to the small village of Engelberg, in the Bernese Alps. In\n1870\n, without André, they took their holiday in the Pyrenees and on their return in September they stopped at Lectoure, where Augustin Boutan\n(1820\n-\n1900)\n, professor of physics and Headmaster of the Lycée Saint-Louis where\nPierre\nand André were studying, had a holiday home. The French army had suffered defeats in the Franco-Prussian war and Prussian troops were approaching. Puiseux returned to Paris with his two daughters, leaving\nPierre\nwith the wife of Augustin Boutan in Lectoure. However, Paris came under siege by the Prussians on\n19\nSeptember\n1870\nand conditions became very difficult. Puiseux, despite being\n50\nyears old, was given a role in defending the city. His daughters suffered greatly during the siege and conditions continued to be very difficult after the armistice at the end of January\n1871\n. Puiseux's daughter Marie became ill during the Paris siege and died from tuberculosis in March\n1872\n. Around this time his other daughter Louise also became ill. She died in May\n1874\n.\nPuiseux had attended courses by\nCauchy\nearly in his career and he soon became interested in research in the topics\nCauchy\nwas studying. He further developed\nCauchy\n's work on functions of a complex variable, being the first to distinguish poles, essential points and branch points. He examined series expansions and looked at series with fractional powers. Although his work in this area was exceptionally good it became rather redundant after\nRiemann\nintroduced the concept of a\nRiemann\nsurface.\nLaplace\n's theory of the Moon, presented in\n1787\n, had been shown to be inadequate by\nAdams\nin\n1853\n. Puiseux contributed to the problem of the acceleration of the mean motion of the Moon with his major paper\nSur les principales integalites du mouvement de la lune\nⓉ\n(\nOn the main integrals of the movement of the moon\n)\n(1864)\n. René Taton writes\n[\n1\n]\n:-\nAfter extensive calculations, Puiseux established in\n1870\nthat the secular displacement of the ecliptic had no significant influence on the acceleration. Although a purely negative conclusion, Puiseux's finding led to a better delimitation of the problem, which was investigated by\nG Hill\nin\n1877\n.\nVictor's son,\nPierre Puiseux\nalso studied the motion of the moon. He went on to become professor of astronomy at the University of Paris. More details of the Puiseux family can be found in our biography of\nPierre Puiseux\n.\nVictor Puiseux also worked on\nelliptic functions\nand studied computational methods which were used to reduce astronomical data. He was elected to the mathematics section of the\nAcademy of Sciences\nin\n1871\nwhere he succeeded\nGabriel Lamé\n.\nJoseph Bertrand\nsays of his election\n[\n2\n]\n:-\nThe election was due to his merit, but its unanimity, to his character.\nWe have already noted that Puiseux was a keen mountaineer but we should record that he was the first to scale an Alpine peak which is now named after him. He continued climbing, often with his sons, until\n1879\nwhen he realised that he was no longer able to keep up. As a last wish he requested that no discourse should be held over his body. His profound faith helped him to bear with resignation the death of his mother when he was only\n14\nyears old, his devoted wife when she was\n28\nyears old, and of four of his six children who all died before the age of\n21\n. During the winter of\n1882\n-\n83\nhe struggled to lecture because of his health, having to take a break for a while. He went to Nice to stay with his son André who was a deputy astronomer there. He returned to Paris, then left for Frontenay in August, staying with the family of his son\nPierre\n's wife. He died there in the following month.\nBertrand\nwrites\n[\n3\n]\n:-\nWithout meddling with anything, he meditated on everything. His mind resembled one of those powerful machines which, without straining or restraining itself, silently triumphed over any obstacle.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}