{
  "nome_completo": "Vincenzo Flauti",
  "nome_curto": "Vincenzo Flauti",
  "ano_nascimento": "1782",
  "ano_morte": "1863",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flauti/",
  "lugar_nascimento": "Naples, Kingdom of Naples (now Italy)",
  "lugar_morte": "Naples, Italy",
  "biografia": "Vincenzo Flauti\nwas brought up in Naples during a difficult period as different countries tried to establish control over the city and the surrounding region. Before looking at Flauti's life let us understand a little of the background.\nFerdinand IV had become King of Naples in\n1759\n, so that it was essentially under Austrian control. The French entered Naples in\n1799\nand there followed what was essentially a civil war. After the short lived Parthenopean Republic, Ferdinand IV regained control in\n1800\n. However, the French-Austrian war, which broke out in\n1805\n, saw Naples come under French control when French troops occupied the city in\n1806\n. Napoleon Bonaparte installed his brother Joseph as King of Naples. Ferdinand IV was reinstalled as King of Naples in\n1815\nfollowing the Neapolitan War when the Austrian Empire defeated the French controlled Kingdom of Naples. This Austrian victory was resented in Italy and was one of the factors leading to the Unification of Italy. In December of\n1816\nthe Kingdom of Naples and the Kingdom of Sicily combined to form the Kingdom of the Two Sicilies. We have to look at Flauti's life and work against this background.\nFlauti was educated in Naples and greatly benefited from the educational institutions of that city, the schools and the university. This was a period when mathematical education in Naples was particularly strong due in large part to the remarkable contributions of\nNicola Fergola\n, but also due to Macello Cecere, the first professor of mathematics at the University of Naples.\nIn\n1767\nthe Jesuits\n(\nthe Society of Jesus\n)\nwas suppressed in the Kingdom of Naples\n(\nand in many other countries\n)\n. The Jesuit school in Naples was closed at this time and, in\n1768\n, King Ferdinand IV founded a new Institute, the Casa del Salvatore, in the premises left vacant by the Jesuits.\nNicola Fergola\nbegan teaching philosophy at this school, which was later called the Liceo del Salvatore, in around\n1770\n. He also founded his own private school in Naples in\n1771\n. This school quickly acquired a high reputation and many of the brightest boys were sent to be educated at Fergola's boarding school. He taught advanced mathematics at his school. Flauti was educated at\nFergola\n's school along with other fellow students, Giuseppe Scorza\n(1781\n-\n1843)\nand Ferdinando De Luca\n(1783\n-\n1869)\n, all of whom as well as being\nFergola\n's students would become his followers. Giuseppe Scorza was born in a small town in Calabria in\n1781\nand so was a year older that Flauti. He moved to Naples for his education and he and Flauti studied philosophy with Giuseppe Caposale, and elementary geometry with Macello Cecere. However, the greatest influence on Flauti and his two contemporaries, was\nNicola Fergola\nwho taught mathematics in the rigorous style of the ancient Greek geometers. He taught rigorous mathematics with a tenderness and passion which determined how Flauti would approach both research and teaching mathematics for the rest of his life. In fact Flauti had started to study medicine but largely due to\nFergola\n's influence, he turned to mathematics.\nWith the French capture of Naples in\n1799\nFergola\n, who was a staunch royalist, fled from Naples and lived quietly in the countryside. On Ferdinand IV being restored as King of Naples in\n1800\n, Fergola returned to take up his position again and, in recognition for his loyal support for the King, he and his pupils were given the leading chairs at the University of Naples as well as in the military and naval academies. In\n1801\n, Flauti took over the management, together with Felice Giannattasio\n(1759\n-\n1849)\n, of the private high school that\nFergola\nhad founded about thirty years earlier but had been closed during the fighting of\n1799\n. Felice Giannattasio, although only six years younger than\nFergola\n, was also a student and follower. The son of Donato Giannattasio and Angela Garzilli, Giannattasio had become a priest, philosopher and mathematician. He had been a pupil of Luca Giordano and went on to occupy the chair of mathematics at the Military College of Naples and a Chair of Philosophy at the University of Naples.\nShortly after taking over management of the school, Flauti began his career at the University of Naples, benefiting from the favours bestowed by Ferdinand IV to his loyal supporters after his restoration. From\n1803\nhe held the Chair of Geometry, and in\n1806\nhe became a lecturer of analysis of the finite and of descriptive geometry. He succeeded\nFergola\nto the Chair of Analysis at the University of Naples in\n1812\n.\nHe published a number of important books, some being based on lectures delivered by\nFergola\n. The book\nGeometria Descrittiva\nⓉ\n(\nDescriptive geometry\n)\nwas published in\n1807\nbut later editions were given the new title\nGeometria di sito sul piano, e nello spazio\nⓉ\n(\nGeometry of position on the plane, and in space\n)\nwhen they were published in\n1815\n,\n1821\nand\n1842\n. His\nCorso di Geometria Elementare e Sublime\n, first published\n1810\n, was remarkable in that it ran to\n24\neditions. He published\nCorso di Analisi Algebrica Elementare e Sublime\nⓉ\n(\nCourse in elementary and sublime algebraic analysis\n)\nwith the first edition appearing in\n1819\nwith later editions in\n1824\n,\n1830\n,\n1835\nand\n1844\n.\nDelle Sezioni Coniche Analitiche e de' Loro Luoghi Geometrici\nⓉ\n(\nOn analytical conical sections and of their geometric places\n)\nwas first published\n1814\n, with a second edition in\n1818\n.\nThe Preface of Flauti's\nCorso di Analisi Algebrica Elementare e Sublime\nⓉ\n(\nCourse in elementary and sublime algebraic analysis\n)\nbegins as follows:-\nThe continuous reprints that I had to make of my 'Elementary and Sublime Geometry Course', from\n1810\nonwards; the other works so far published by me from that period; and more than anything else the many tasks of my profession, and the tasks set for me by the Government, have, up till now, delayed me from publishing my 'Course of Elementary and Sublime Analysis' which was earlier promised by me. And this Course should also be distributed in four volumes, in the same way as the Geometric Course; and the first of these which is now published contains the entire Analysis of the Finite; the second will include the application of this same topic to Geometry; the third gives a careful introduction to the Analysis of the Infinite; and the final fourth one presents the Analysis of the Infinite itself. Since it is not my purpose to be known as a writer of books; but rather to free once and for all  my country from the servitude of resorting to foreign courses, often patching them together, so that it was not possible to avail oneself of those of a single author, so I have never sought, nor will I ever seek, to replace the course of Mathematics our distinguished\nFergola\nhas already made, who therefore finds himself having composed the aforementioned two last volumes, and subsequently perfected them in making them available; so that now they can see the light in public with the advantage of mathematical youth; I will make all my efforts with such a worthy subject, since I am so pleased that he allowed them to be printed by me, which he has often promised me. I would not have decided to undertake this task had it not been that after publishing the first two volumes, the poor health of Mr\nFergola\nmade it right for him to abandon the thought of publishing them when he did. Without describing here in detail the content of each volume, and the method by which it will be treated, which will be best done at the beginning of each of them; I will limit myself for now only to account for the first which is now in the public domain. It is divided into three parts: the first of which includes the Algebraic Algorithm, or the calculation of algebraic quantities; the second, the determinate analysis; and the third is the indeterminate one.\nThe Preface of Flauti's\nGeometria di sito sul piano, e nello spazio\nⓉ\n(\nGeometry of position on the plane, and in space\n)\nbegins as follows:-\nAlthough sometimes, Illustrious\nFergola\n, I have the opportunity to meditate on the originals of the Greek geometers, it is my strength that I remain more convinced, that their inventions in Geometry greatly outweigh the discoveries of this kind made in our times. And it seems to me, that as long as we do not possess with our methods as many different doctrines about geometrical loci, as many as the ancients have invented in abundance; that the most wise books of the porisms of sage\nEuclid\nwill not be returned as the culmination of the modern analysis\n(\nvery difficult work\n)\n; and that in addition we will not discover alternative methods to solve problems beyond the fourth degree, it is a fact that we recognize far less than the ancients. Abandoning therefore their guide, as is mostly done nowadays, and keep a little of their precepts, and their works do not make perfect sense, for those who want to embark on the arduous career of geometric invention, giving themselves entirely to modern analysis, it is the same, as a learned Italian used to say, to enter without a thread into a dark labyrinth.\nDescartes\n,\nFermat\n, Ugenio,\nNewton\n,\nLeibniz\n, the Bernoullis,\nEuler\n, and many others who lived in times not far from us cultivated with great ardent love the works of the ancients, and they studied them deeply; and new important discoveries, and new methods were still seen to derive from their considerations: nor did the last century after them, if truth be told, add much to their inventions. We must treat therefore that branch of Geometry which belongs to the ancients, as something to be praised, to do otherwise is a fault.\nWe now follow\n[\n1\n]\nfor a description of the main contributions made by Flauti. We will give the complete text even though in places it repeats what we have already written above.\nThe teachings of Flauti should not lead one into thinking that, on his side, he inclines towards analytical methods. He had open debates against the supporters of such methods: in fact, he can well be regarded as one of the principal exponents of the Neapolitan school of mathematics of the eighteen hundreds, which supported traditional Euclidean geometry, surely a brilliant school, but that could by now consider itself obsolete. In\n1806\n, the commission established by the government to choose the texts to be adopted in Neapolitan schools approved\nFergola\n's proposal to assign to Flauti the task of dictating which criteria a course of mathematics should follow.\nThe criteria inspiring Flauti's work are described by him in\nDel metodo in matematiche, della maniera d'ordinare gli elementi di queste scienze e dell'insegnamento dei medesimi con un'esposizione del corso di matematiche del professor Flauti, dissertazioni lette alla Reale Accademia delle scienze di Napoli l'anno\n1821\ne che ora si pubblicano per la seconda volta\nⓉ\n(\nOn the method in mathematics, of the way of ordering the elements of these sciences and of their teaching with an exposition of the course of mathematics by Professor Flauti, dissertations read to the Royal Academy of Sciences of Naples in\n1821\nand which now are published for the second time\n)\n, Naples\n1822\n. First of all, he was comparing the ancient method of geometry, the Cartesian method and the method of\nJoseph-Louis Lagrange\n. The latter, towards which he was particularly hostile, going as far as stating that all it consisted of was simply establishing the \"equations of condition\", relative to what one wanted to treat, and to make use of them by combining them conveniently.\nThe ideal course of mathematics - according to Flauti - should have geometry as a starting point and should propose in an historical sequence a sort of anthology that, starting from\nEuclid\n's\nElements\nand passing through conic sections, would arrive at\nArchimedes\nand\nPappus\nand finally at trigonometry. Algebra too, according to Flauti, should be taught using the Euclidean method, that is, by clearly expressing the theorems. Only a small number of school texts, however, complied with what he was indicating.\nIn reality, the programme put forward by Flauti provided such an incoherent and schematic exposition of the main topics to be covered in the course that it is reasonable to suppose that the work was to be written up by multiple authors. Indeed, in the successive\nProspetto ragionato delle opere componenti un Corso di studi matematici per l'istruzione in tali scienze, l'invenzione e il perfezionamento\n(\nNaples,\n1841)\nⓉ\n(\nReasoned Prospect of the Works Compose a Course of Mathematical Studies for the Teaching, the Invention, and the improvement of such sciences\n)\n, the name of the exponent of the Neapolitan school that had studied a particular topic, was appearing together with an indication that his book was to be used as textbook.\nFlauti edited editions of\nEuclid\n(\nThe first six books and the eleventh and twelfth of Euclid\n, Naples,\n1810)\nas well as a treatise on trigonometry and one on algebra, both with a long historical introduction. Moreover, in\n1815\nhe wrote a treatise on descriptive geometry\n(\nGeometria di sito sul piano e nello spazio\nⓉ\n(\nGeometry of position on the plane and in space\n)\n, ibid.\n)\n, which collected his\n(\nre-elaborated\n)\nlectures. Flauti supported the idea that descriptive geometry was a complement of ancient geometry. Indeed, many of the problems that he solved were solved with such a method.\nFergola\nhad previously published several of these problems in the\nOpuscoli matematici della scuola del sig. N. Fergola\nⓉ\n(\nMathematical booklets of the school of N Fergola\n)\n(\nNaples,\n1811)\n. The eighth booklet, edited by Flauti, dealt with the problem of the\nWallis\ncylindroid, which was treated again in\nLa misura del cilindroide wallisiano\nⓉ\n(\nThe measure of the Wallis cylindroid\n)\n, in\nAtti della Reale Accademia delle scienze\nⓉ\n(\nProceedings of the Royal Academy of Sciences\n)\n, IV\n(1839)\n, p.\n1\n-\n11\n, in which the author wanted to prove with synthetic procedures the volume of the round one-sheet hyperboloid; that is, he proved some propositions related mostly to a\nWallis\ncylindroid, a ruled-surface that is obtained by rotation around a squashed spheroid.\nAround\n1850\n, Flauti contributed to differential geometry with some observations on the theory of envelopes\n(\nObservations on the methods proposed by the illustrious Lagrange for the envelope curves with other alike researches\n, in\nMemoirs of mathematics and physics of the Italian society of sciences residing in Modena\n,\n(1850)\n, p.\n251\n-\n264)\n. In this field he much appreciated the work of\nLagrange\n, even if he did not miss the occasion to attempt to demonstrate\n(\nwithout much success in this case\n)\nthe superiority of synthetic geometry. A fundamental intent of Flauti was that of claiming the role that\nFergola\n's school had in reviving the spirit of scientific inquiry\n(\nOn geometric invention, posthumous work of Nicola Fergola ordered and containing important notes of prof. V. Flauti\n, Naples\n1842)\n. The second book also contained some of his personal researches, in particular those on geometrical loci.\nIn a successive writings, published posthumously\n(\nSu due libri di Apollonio Pergeo detti delle inclinazioni e sulle diverse restituzioni di essi\nⓉ\n(\nOn two books by Apollonius of Perga called the inclinations and on the different returns of them\n)\n, in\nEssays of mathematics and physics of the Italian society of sciences residing in Modena\n, XXV,\n(1862)\n, I, p.\n223\n-\n236)\n, dedicated to the history of the divination of the lost books of\nApollonius\non the intentions and the exposition of the results obtained by him and by his pupil R Minervini, Flauti was again aiming to praise the booklets of\nFergola\n's school published around\n1810\n.\nIn\n1860\nthe Kingdom of the Two Sicilies was conquered by Giuseppe Garibaldi and was incorporated into the Kingdom of Italy. Flauti had been a supporter of the defeated Bourbons and so was excluded from the Academy of Sciences of Naples when it was reconstituted as an academy within the Kingdom of Italy. Flauti had been elected to the Academy of Sciences of Naples on\n17\nJuly\n1854\nand had been a secretary of the Academy. His exclusion on political grounds near the end of his life must have been very hurtful.\nLet us make one final comment. As well as his mathematical texts, Flauti also published\nTeoria dei miracoli\nⓉ\n(\nTheory of miracles\n)\n, a mathematical demonstration of the existence of God.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry"
  ]
}