{
  "nome_completo": "Walter Andrew Shewhart",
  "nome_curto": "Walter Shewhart",
  "ano_nascimento": "1891",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shewhart/",
  "lugar_nascimento": "New Canton Illinois, USA",
  "lugar_morte": "Troy Hills, New Jersey, USA",
  "biografia": "Walter Shewhart\n's parents were Esta Barney and Anton Shewhart. He attended the University of Illinois receiving an A.B. in\n1913\n, then an A.M. degree in\n1914\n. On\n4\nAugust\n1914\n, he married Edna Hart. He moved to the University of California at Berkeley to undertake research in physics, and while there was a Whiting fellow during\n1915\n-\n16\n. He was awarded his doctorate from the University of California in\n1917\n. He taught at the universities of Illinois and California and, for a short time, was Head of Physics at the Wisconsin Normal School in La Crosse. This School opened in\n1909\n, was renamed La Crosse State Teachers College in\n1927\n, and then was again renamed to Wisconsin State University - La Crosse in\n1964\n. Shewhart joined the Western Electric Company in\n1918\n, the company being the manufacturer of hardware for the Bell Telephone Company.\nIt was the Inspection Engineering Department of the Western Electric Company at Hawthorne that Shewhart joined in\n1918\n. He worked there on statistical tools to examine when a corrective action must be applied to a process. His writings were on statistical control of industrial processes and applications to measurement processes in science. The control chart techniques which he developed have been widely adopted. His contributions are explained in more detail in\n[\n8\n]\n:-\nBy the turn of the century, Western Electric had trained individuals as inspectors to assure specification and quality standards, in order to avoid sending bad products to the customer. In the\n1920\n's, Western Electric's Dr Walter Shewhart took manufacturing quality to the next level - employing statistical techniques to control processes to minimize defective output. When Dr Shewhart joined the Inspection Engineering Department at Hawthorne in\n1918\n, industrial quality was limited to inspecting finished products and removing defective items. That all changed in May\n1924\n. Dr Shewhart's boss, George Edwards, recalled:\n\"Dr Shewhart prepared a little memorandum only about a page in length. About a third of that page was given over to a simple diagram which we would all recognize today as a schematic control chart. That diagram, and the short text which preceded and followed it, set forth all of the essential principles and considerations which are involved in what we know today as process quality control.\"\nMr Edwards had observed the birth of the modern scientific study of process control. That same year, Dr Shewhart created the first statistical control charts of manufacturing processes, which involved statistical sampling procedures. Shewhart published his findings in a\n1931\nbook, Economic Control of Quality of Manufactured Product.\nThe Bell Telephone Laboratories were founded in\n1925\nand Shewhart moved to them when the Laboratories opened and worked there until his retirement in\n1956\n. He expanded his interests to a broader use of statistics over this period. During this period he published many articles papers in the\nBell System Technical Journal\n. In addition, he published\nRandom sampling\nin the\nAmerican Mathematical Monthly\nin\n1931\n. In\n1939\nhe published the important book\nStatistical Method from the Viewpoint of Quality Control\n. It is interesting to read the publisher's description of the book:-\nThe application of statistical methods in mass production makes possible the most efficient use of raw materials and manufacturing processes, economical production, and the highest standards of quality for manufactured goods. In this classic volume, based on a series of ground-breaking lectures given to the Graduate School of the Department of Agriculture in\n1938\n, Dr Shewhart illuminates the fundamental principles and techniques basic to the efficient use of statistical method in attaining statistical control, establishing tolerance limits, presenting data, and specifying accuracy and precision.\nIn the first chapter, devoted to statistical control, the author broadly defines the three steps in quality control: specification, production and inspection; he then outlines the historical background of quality control. This is followed by a rigorous discussion of the physical and mathematical states of statistical control, statistical control as an operation, the significance of statistical control and the future of statistics in mass production.\nChapter II offers a thought-provoking treatment of the problem of establishing limits of variability, including the meaning of tolerance limits, establishing tolerance limits in the simplest cases and in practical cases, and standard methods of measuring. Chapter III explores the presentation of measurements of physical properties and constants. Among the topics considered are measurements presented as original data, characteristics of original data, summarizing original data\n(\nboth by symmetric functions and by\nChebyshev\n's theorem\n)\n, measurement presented as meaningful predictions, and measurement presented as knowledge.\nFinally, Dr Shewhart deals with the problem of specifying accuracy and precision - the meaning of accuracy and precision, operational meaning, verifiable procedures, minimum quantity of evidence needed for forming a judgment and more.\nIn this book Shewhart asks:-\nWhat can statistical practice, and science in general, learn from the experience of industrial quality control?\nHe wrote in this book:-\nThe definition of random in terms of a physical operation is notoriously without effect on the mathematical operations of statistical theory because so far as these mathematical operations are concerned random is purely and simply an undefined term. The formal and abstract mathematical theory has an independent and sometimes lonely existence of its own. But when an undefined mathematical term such as random is given a definite operational meaning in physical terms, it takes on empirical and practical significance. Every mathematical theorem involving this mathematically undefined concept can then be given the following predictive form: If you do so and so, then such and such will happen.\nAlthough working in industry for the whole of his career, Shewhart kept links with academic institutions being a lecturer in applied statistics at the Stevens Institute of Technology in Holboken in\n1930\n, lecturing at the University of London in\n1932\nand at the United States Agricultural Graduate School in\n1938\n. He was an honorary professor at Rutgers University in\n1954\nand a member of the advisory committee of the Princeton mathematics department during\n1941\n-\n48\n. During\n1944\n-\n46\nhe served on the National Research Council and for over\n20\nyears he served as editor of the\nMathematical Statistics Series\nof John Wiley and Sons.\nShewhart received many honours for his important contributions. He was a founder of the Institute of Mathematical Statistics, being elected a fellow and serving a term as vice-president in\n1936\nand president from\n1936\nto\n1944\n. He was also a founder of the American Society for Quality Control. The Society made him their first honorary member in\n1947\nand also made him the first to receive their Shewhart Medal. The citation reads:-\nThe act of awarding the medal focuses the spotlight of public attention on the recipient, revealing in clear light the qualities that have won for him the esteem of his peers. What are the qualities that lead us to so honour a man as to give him a medal? First of all, he must have intellectual ability, enabling him to clear away a little of the dark cloud of ignorance that always surrounds us. Second, he must have the generosity of spirit that leads him to so express and restate his pioneering ideas that other members of his profession may benefit from them. And finally, he must have that warmth of human feeling that marks the true educator, endearing him to his students or disciples, even those who learn from him only remotely. All of these qualities are eminently personified in Dr Walter Shewhart.\nHe was elected to a fellowship of the\nAmerican Statistical Association\n, of the International Statistical Institute, and of the\nRoyal Statistical Society\n. He was also elected to the American Association for the Advancement of Science\n(\nserving on the council during\n1942\n-\n49)\n, the Econometric Society, and the\nNew York Academy of Science\n. He served a term as president of the\nAmerican Statistical Association\nin\n1945\n, and was awarded the Holley medal of the American Society of Mechanical Engineers in\n1954\n. The Indian Statistical Institute in Calcutta awarded him an honorary doctorate.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}