{
  "nome_completo": "Walter Kurt Hayman",
  "nome_curto": "Walter Hayman",
  "ano_nascimento": "1926",
  "ano_morte": "2020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hayman/",
  "lugar_nascimento": "Cologne, Germany",
  "lugar_morte": "London England",
  "biografia": "Walter Hayman\n's parents were Franz Karl Abraham Samuel Haymann\n(\nthe double 'n' is not a misprint\n)\nand Ruth Therese Hensel. Ruth Hensel was the daughter of the famous mathematician\nKurt Hensel\nand his wife Gertrud Hahn. In\n1933\n, Kurt Martin Hahn, Gertrud's nephew, was forced to leave Germany because he was Jewish and he went to Scotland where in the following year he founded the internationally famous Gordonstoun School near Elgin in the north east of Scotland. Walter is therefore related to famous mathematicians, famous educationalists, famous philosophers, and to the brilliant composers Fanny and Felix Mendelssohn\n(\nsee\nKurt Hensel\n's biography\n)\n. Franz Haymann\n(1874\n-\n1947)\nwas Professor of Law at the University of Cologne when Walter was born. However, being Jewish, he was forced to retire from his chair in September\n1935\nby the Nazi government. He emigrated to Britain in\n1938\n, and it will come as no surprise to learn that his son Walter was sent to Scotland to be educated at Gordonstoun School.\nAfter graduating from Gordonstoun School, Hayman studied at St John's College, Cambridge. There he was particularly influenced by his lecturers\nMary Cartwright\nand\nJ E Littlewood\n, and he went on to undertake research supervised by\nMary Cartwright\n. In\n1947\nhe was appointed as a lecturer in King's College, Newcastle and in the same year he became a fellow of St John's College, Cambridge. Later in\n1947\nhe was appointed as a Lecturer in Mathematics at the University of Exeter. His first mathematics paper\nSome remarks on\nSchottky\n's theorem\nwas published in the\nProceedings of the Cambridge Philosophical Society\nin\n1947\n. It calculates numerical estimates in\nSchottky\n's theorem, based on a detailed discussion of the elliptic modular function by geometric methods. This paper was followed by\nRemarks on\nAhlfors\n' distortion theorem\n(1948)\nand\nSome inequalities in the theory of functions\n(1948)\n.\nLars Ahlfors\n, discussing the second of these papers, explains that \"The results seem very accurate, but their formulation is extremely complicated.\" He also talks of Hayman's \"skillful handling of technical points\". At Cambridge, Hayman was awarded the\n1\nst\nSmith's Prize in\n1948\nand in the following year he shared the\nAdams\nPrize with\nJohn Charles Burkill\n,\nSubrahmanyan Chandrasekhar\nand\nJohn MacNaughton Whittaker\n.\nHayman's fellowship at St John's College, Cambridge continued until\n1950\nand he was a Visiting Lecturer at Brown University in Providence, Rhode Island during\n1949\n-\n50\n. Hayman spent the summer of\n1950\nat Stanford University in California. While there he wrote the Technical Report for a Navy Contract on\nSymmetrization in the theory of functions\n. W Seidel writes:-\nThe author investigates a large number of applications to the theory of functions of two methods of symmetrization: the\nSteiner\nmethod, recently treated by\nPólya\nand\nSzegő\n, and circular symmetrization, introduced by\nPólya\n.\nAt the University of Exeter, Hayman was promoted to Reader in Mathematics in\n1953\n. His work was attracting much interest and he was an Invited Speaker at the International Congress of Mathematicians held in Amsterdam in September\n1954\n. In\n1955\nhe gave a proof of the asymptotic\nBieberbach\nconjecture and was awarded the Junior Berwick Prize by the\nLondon Mathematical Society\n. Again he spent the summer of\n1955\nvisiting Stanford University. He left Exeter in\n1956\nwhen he was appointed as the first Professor of Pure Mathematics at Imperial College, London\n[\n5\n]\n:-\nFor over\n30\nyears there he ran a school of renown in Complex Analysis, attracting mathematicians from all over the world.\nAlso in\n1956\nHayman was elected a fellow of the\nRoyal Society\n. However, before we continue to describe his career we should return for a moment to\n1947\nfor that was the year in which he married Margaret Riley Crann, the daughter of Thomas Crann of New Earswick, York. Margaret had studied mathematics at Cambridge and been awarded an M.A. She became a mathematics teacher at the Putney High School for Girls and has become famous for her work with the most mathematically gifted pupils. In\n1966\nWalter Hayman visited Moscow and when he returned, together with his wife, he founded the British Mathematical Olympiad. The Haymans set and marked the questions for the British Olympiad Competition. Their efforts\n[\n3\n]\n:-\n... led to the United Kingdom becoming one of the first western countries to send a team to the International Mathematical Olympiad\n[\nin\n1967]\n(\nwhich was, in its earliest days, the preserve of the communist states\n)\n.\n[\nMargaret Hayman\n]\nwaged a long battle for sponsorship funding for the British team, and worked hard to foster appreciation of the potential value of mathematics competitions within the Council and the membership of the\nMathematical Association\n.\nWalter and Margaret had three daughters. One of these was Anne Carolyn Hayman, born on\n23\nApril\n1951\n, who was educated at Putney High School for Girls and then went on to obtain a B.A. in Classics and Philosophy. She received an OBE in\n2003\nand, since\n2004\n, has been Chief Executive of Peace Direct. Another daughter is Shiela Hayman who is a film-maker and novelist and who has written about Walter and her family in pieces for\nThe Guardian\n.\nWhile at Imperial College, Hayman published many deep research articles and also superb monographs skilfully written so that only undergraduate mathematics is required as a prerequisite. In\n1958\nhe published the\n151\n-page\nMultivalent functions\n. W C Royster begins a review as follows:-\nThis book deals with that part of the theory of univalent and multivalent functions which is closest to the researches of the author. The majority of the results obtained throughout the book are of the classical inequality type. However, it is not to be inferred that only elementary methods are used in obtaining these results. For those with an introductory course in complex variables this book is self-contained, which is remarkable considering the length of the tract and the level reached.\nHayman's next monograph was\nMeromorphic functions\n(1964)\n. W H J Fuchs writes:-\nThis attractively written monograph gives a rather complete account of the\nNevanlinna\ntheory of\nmeromorphic functions\n. It also treats the\nAhlfors\ntheory of covering surfaces and the theory of invariant normal families. The book can be understood by a reader familiar with basic function theory and with the elements of\nLebesgue\ntheory. A very nice feature of the book is the way in which routine discussions of standard results are interspersed with non-standard applications.\nThe text\nResearch problems in function theory\npublished in\n1967\nwas somewhat different in nature. Ch Pommerenke writes about the\n56\n-page booklet:-\nThis little book originated in a conference on classical function theory held in London in\n1964\n. It contains more than\n140\nopen problems from the theory of functions of one complex variable and related subjects such as subharmonic functions. Most problems are connected with quantitative questions, for instance about the growth of a function and about estimates for some interesting constants. A few of the problems are classical and some were known before, but many of them are new. The background of most of the problems is sketched and the present state of knowledge indicated. ... This booklet is highly recommended to all interested in function theory. Not only does it give a wealth of research problems but also some impression of the present state of a large part of function theory.\nOf all the books which Hayman wrote during his thirty years at Imperial College, the most significant was almost certainly the first volume of\nSubharmonic functions\n(1976)\n. The project to write the text was a joint one by Hayman and\nPatrick Brendan Kennedy\n, but sadly\nKennedy\ndied in\n1967\n. Hayman continued working on the book on his own but still published it under the joint authorship:-\nThis book gives a clear and attractive account of the theory of subharmonic functions in domains of Euclidean spaces\nR\nm\n\\mathbb{R}^{m}\nR\nm\n(\nm ≥\n2)\nand illuminates the connections and analogies with classical complex variable theory particularly well.\nHayman promised a second volume on the theory of subharmonic functions in the plane and he did keep his promise but it took\n13\nyears to complete. The second volume, published in\n1989\n, was:-\n... welcomed as the definitive work on some of the most actively pursued research topics in the theory of subharmonic functions.\nPerhaps the fact that during these thirteen years he was dean of the Royal College of Science from\n1978\nto\n1981\n, and vice-president of the London Mathematical Society from\n1982\nto\n1984\nis relevant here. He retired from his chair at Imperial College in\n1985\nand was appointed as Professor of Pure Mathematics at the University of York, this being a part-time position. He held this post until he reached the age of\n67\nin\n1993\n. Then, two years later, he became a Senior Research Fellow back at Imperial College in London. Margaret Hayman died in\n1994\nand in the following year he married the mathematician Dr Waficka al-Katifi who had published\nOn the Asymptotic Values and Paths of Certain Integral and Meromorphic Functions\nin the\nProceedings\nof the\nLondon Mathematical Society\nin\n1966\n. She died in\n2001\n.\nOne further important text by Hayman that we should mention is the second edition of\nMultivalent functions\npublished in\n1994\n. W C Royster, who reviewed the first edition\n35\nyears earlier, also reviewed the second edition:-\nThe first edition of this book dealt with the growth of univalent and multivalent functions to obtain bounds for the modulus and coefficients and related quantities. After\n35\nyears of rapid development in this area the author expands the first edition to include primarily new results that are more closely related to topics in the first edition. ... the material is developed in a very interesting and structured manner. The addition of examples and exercises adds greatly to its utility for graduate students and researchers in the theory of multivalent and univalent functions.\nWe have already mentioned some of the honours that Hayman has received. In addition to the invitation to lecture at the International Congress of Mathematicians held in Amsterdam, which we mentioned above, he was also invited to lecture at the International Congress of Mathematicians held in Nice in\n1970\n. He has been invited to address the British Mathematical Colloquium on four occasions, being one of a very small number of mathematicians to have that many invitations. He gave the lectures\nThe growth of integral functions\nat Greenwich in\n1952\n,\nThe modern approach to Riemann surfaces\nin St Andrews in\n1956\n,\nSome Tauberian theorems for multivalent functions\nin York in\n1970\n, and\nValue distribution of functions meromorphic in an angle\nin Sheffield in\n1980\n. He was awarded the Senior Berwick Prize by the\nLondon Mathematical Society\nin\n1964\n, and the\nDe Morgan\nMedal by the Society in\n1995\n. The citation for this Medal reads\n[\n1\n]\n:-\nProfessor Hayman is awarded the\nDe Morgan\nMedal for his contributions to complex analysis and potential theory. Following the tradition established by\nHardy\nand\nLittlewood\n, he became the undisputed leading international authority in classical complex analysis, through work contained in more than one hundred research papers and several monographs. His natural creative talent for solving problems led in particular to very deep results in the theory of functions on the unit disc, integral and Schlicht functions, and subharmonic functions in several variables. As an international figure, Professor Hayman has influenced researchers of all nations and of all ages during his periods at both Imperial College and the University of York. He has also been much involved with the role of mathematics and science in society, and in supporting the human rights of individual mathematicians. Few have been as dedicated to their chosen area of mathematics as Walter Hayman, or promoted it in the world in such a dedicated fashion.\nHe has been elected to several academies. We mentioned his election to the\nRoyal Society\nin\n1956\nbut we should also record that he served on the Council of that Society in\n1962\n-\n63\n. He was elected to the\nFinnish Academy of Science and Letters\n(1978)\n, the Bavarian Academy\n(1982)\n, and the\nAccademia dei Lincei\nof Rome\n(1985)\n. He has received honorary degrees from the University of Exeter\n(1981)\n, the University of Birmingham\n(1985)\n, Uppsala University, Sweden\n(1992)\n, Giessen University, Germany\n(1992)\n, and the National University of Ireland, Dublin\n(1997)\n. Another honour we must mention is the special\n2008\nvolume of\nComputational Methods and Function Theory\ndedicated to Hayman on the occasion of his\n80\nth\nbirthday. We quote from the Preface\n[\n5\n]\n:-\nWalter has written over\n200\npapers touching and enriching all areas of complex analysis. He is best known, perhaps for his work on the minimum modulus of large entire functions, for his proof of the asymptotic\nBieberbach\nconjecture and for the so-called \"Hayman Alternative\" in value distribution theory. In addition he has written three books, \"Multivalent Functions\", \"Meromorphic Functions\" and \"Subharmonic functions Vols.\n1\nand\n2\n\"\n(\nthe first volume jointly with\nP B Kennedy\n)\nwhich have been extremely influential. He now lives in the country, in Bisley, Gloucestershire but still maintains an active scientific and academic life in London. The present volume is dedicated to Walter by his many students, friends and admirers.\nFinally we note that Hayman gives \"music, travel, television\" as his hobbies.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}