{
  "nome_completo": "Walter Warwick Sawyer",
  "nome_curto": "Warwick Sawyer",
  "ano_nascimento": "1911",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sawyer/",
  "lugar_nascimento": "St Ives, Huntingdonshire, (now Cambridgeshire) England",
  "lugar_morte": "Toronto, Ontario, Canada",
  "biografia": "Warwick Sawyer\n(\nalso known as\nW W Sawyer\n)\nwas born in Osborne Cottage, East Street, St Ives, Huntingdonshire, but let us note that since\n1972\nSt Ives has been in Cambridgeshire. His father was Walter Percy Sawyer\n(1881\n-\n1948)\n, a Surveyor of Taxes, and his mother was Elizabeth Whettnall Stevens\n(1884\n-\n1941)\n. Walter Percy Sawyer, born\n25\nJune\n1881\n, lived at Ranelagh House, Bounds Green Road, Wood Green, Tottenham, the son of Edward and Lavina Sawyer. The middle child of five, having four sisters, he had been a student at the University of London, matriculating in June\n1900\n. Elizabeth Whettnall Stevens, the daughter of the local tax collector Whettnall Stevens and Betsey Osborne, was born\n(8\nJune\n1884)\nand brought up in Osborne Cottage, East Street, St Ives, Huntingdonshire. She married Walter Percy Sawyer in\n1909\nand they lived in Wood Green, Tottenham. When their first child was due to be born, Elizabeth went to stay with her mother\n(\nwho by this time was widowed\n)\nand elder sister Madeleine at Osborne Cottage, St Ives. It was there that W W Sawyer, the subject of this biography, was born. His father remained at this time at Ranelagh House, Wood Green, with his widowed mother Lavina and three of his unmarried sisters. On\n23\nMay\n1912\n, W W Sawyer's sister, Mary Sawyer, was born, also in Osborne Cottage, East Street, St Ives. She became an Hospital Almoner in Public Health and died in\n1994\n.\nWalter Warwick Sawyer did not spend his childhood in St Ives but rather in Tottenham, London, from\n1911\nto\n1914\n, then at Harrow on the Hill, near London, from\n1914\nto\n1918\nafter his family moved there. In\n1918\nthe family moved again, this time to Sunderland, County Durham in the north of England where they lived at \"St Ives\" Hillside, Sunderland. Warwick was already passionate about mathematics\n[\n22\n]\n:-\nAt the age of\n8\n, mathematics already had an intense aura of romance for me. I used to go round second-hand bookshops looking for mathematical textbooks that I could afford.\nSawyer began his education in Sunderland as he explained in\n[\n40\n]\n:-\nI went to a rather unusual school in Sunderland, where we studied all the academic subjects at full force from the age of eight on. Mathematics was already a subject of immense appeal to me; French I did badly at and saw no purpose in. If I had had a teacher of genius, who told me about, or even better, given me, a book on mathematics in French that was not available in English, my whole attitude to the subject would have been reversed. It was not that I consciously tried to neglect French; it was rather that the deep drive from the unconscious was lacking.\nHe won a scholarship to Highgate School in London in\n1923\n, beginning his studies there in the following year. This famous school, founded in\n1565\nas Sir Roger Cholmeley's School at Highgate, is an independent school with a high reputation. There is a description of one of Sawyer's teachers in\n[\n40\n]\nwhich may refer to his final year in Sunderland, or his first year at Highgate School:-\nI remember conclusions I reached from observing my form master when I was eleven years old. He was a tall, gaunt man with a slightly unusual background, being a Canon in the Church of England and having at one time been in the Canadian Mounted Police. I remember him quoting something which I later discovered was from Ian Hay's 'The Lighter Side of School Life'. \"In nine cases out of ten a schoolmaster's task is not to bring light to the path of an eager, groping disciple, but to drag the reluctant and refractory young animal up the slopes of Parnassus by the scruff of his neck.\" The implication seemed to be that we had a moral duty to work hard and that we were neglecting this. Whether children have such a duty is open to question, but one thing is certain - they do not feel they have. It is futile appealing to feelings pupils ought to have but do not. Again, still mourning our deficiencies, he used to say, \"You can take a horse to the water but you cannot make him drink.\" At the time I thought, perhaps you could give him something that would make him thirsty.\nWhile at Highgate School, in December\n1928\n, Sawyer was awarded the major scholarship, the Baylis Scholarship, by St John's College, Cambridge\n(\nsee\n[\n10\n]\n)\n. This Scholarship was awarded for the encouragement of study in mathematics using funds bequeathed to the College in the wills of Philip Baylis and of his sister Charlotte Elizabeth Baylis. He matriculated at St John's College, Cambridge in\n1930\nand quickly showed his outstanding abilities. He was awarded the Prize for the Mathematics in Part I of the Mathematical Tripos in the Michaelmas Term of\n1931(\nsee\n[\n11\n]\n)\n.\nSawyer was an active member of The\nAdams\nSociety, the mathematical society at St John's College, named after\nJohn Couch Adams\n. At the meeting of The\nAdams\nSociety held on\n18\nMay\n1932\n, Sawyer was elected Treasure of the Society\n(\nsee\n[\n12\n]\n)\n. In\n[\n13\n]\nwe learn more about his activities in The\nAdams\nSociety:-\nWith a view to stimulating discussion of Mathematical problems amongst members, a series of papers by gentlemen in statu pupillari have been arranged. On\n16\nNovember\n1932\n, W W Sawyer traced the development of Wave Mechanics and the\nHamilton\n-\nJacobi\nTheory, and many interesting points, some quite original, were raised.\nThe\nAdams\nSociety was not the only society Sawyer took an active part in, another being the Chess Club. He was elected Vice-President Chess Club in Michaelmas Term\n1932\n[\n13\n]\n. He continued his high level of performance in mathematics being awarded the Intercollegiate Mathematics Prize in the same term. He continued to hold these positions in the two societies until the Michaelmas Term\n1933\n[\n14\n]\n, when he was elected President of The\nAdams\nSociety\n[\n15\n]\n. Outstanding academic performance led to him being awarded the\nAdams\nMemorial Prize and the Hockin Prize. He graduated with a B.A. in\n1933\nhaving been awarded the Wright's Prize in the Mathematics Tripos Part II. At this time his Scholarship was prolonged so that he could continue to undertake research at St John's College.\nSawyer completed his term as President of The\nAdams\nSociety in the Easter Term\n1934\n[\n16\n]\n:-\nAt the last meeting of the academical year, the retiring president of the\nAdams\nSociety, W W Sawyer, gave us a most enjoyable paper on a subject which was most important for all present: \"Learning Mathematics with the Minimum of Energy.\"\nHe gave another lecture continuing to develop his ideas\n[\n17\n]\n:-\nOn\n1\nNovember\n1934\n, W W Sawyer gave a lecture on \"The Aims and Methods of Mathematicians.\" Describing his lecture as an analytic continuation of the one he had given in the previous Easter term, he dealt with the problems of the mathematical research student.\nIn the Easter Term\n1935\nhe was awarded a Baylis Studentship and gave a lecture to The Natural Science Club\n[\n18\n]\n:-\nAt the fifth meeting held during the Lent term the toast of \"The Natural Science Club\" was drunk in beer, provided to celebrate the holding of the fiftieth meeting, which took place during the term. Papers were then read by ... and W W Sawyer, B.A., on \"Some Remarks on Biology, Physics and Philosophy.\"\nSawyer's research was on quantum theory and relativity, advised by\nRalph Fowler\n. We note that\nPaul Dirac\nwas Lucasian professor of mathematics at the University of Cambridge, appointed in the year before Sawyer began to undertake research. Sawyer published\nNote on a paper of Bell and Wolfenden on electrolytic separation of diplogen\nin\n1935\n. The paper begins:-\nBell and Wolfenden have published a theory of diplogen concentration by electrolysis, which, to a considerable extent, explained the empirical result, that the efficiency of diplogen separation is constant. This theory depends on the assumption that a quantity, Î³, introduced by Gurney is constant. In a later paper Bell writes that this assumption would \"probably not be justified in a strict examination of the problem\", but he gives no quantitative estimate.\nIn the paper Sawyer confirms that Î³ is independent of the mass of the isotope with a more accurate calculation.\nIn October\n1935\nSawyer was appointed as an assistant to\nE T Copson\n, the Professor of Mathematics at University College, Dundee. At this time University College, Dundee, was a college of the University of St Andrews, so Sawyer was at this time on the staff of the University of St Andrews. The Mathematics department in Dundee that he joined was small with Copson as the professor,\nFrederick Bath\nas a lecturer, and two assistants, Sawyer and Cecil Gilbert. When\nBath\nresigned in\n1936\n,\nWalter Ledermann\nwas appointed as a lecture in mathematics:-\nThe department at that time had a family atmosphere, decisions were taken during morning coffee, there were few official meetings, no teaching aids, no secretarial assistance, classes were small but teachers knew their students personally. Every member of the small staff might be called upon to lecture in any branch of mathematics, and\nCopson\nwith his wide interests in mathematics was admirably suited to such an environment.\nCopson\nwas generous in the help and advice he gave to new members of staff yet they were free to develop their interests both in teaching and research.\nAfter two years in Dundee, Sawyer moved to the University of Manchester in\n1937\n, taking up an appointment of Assistant Lecturer in Mathematics of Engineering and Physics. At Manchester,\nLouis Mordell\nheld the Fielden Chair of Pure Mathematics while\nHarold Davenport\n,\nKurt Mahler\nand\nPaul ErdÅs\nwere on the staff.\nDouglas Hartree\nwas the professor of applied mathematics and\nBertha Swirles\nwas a lecturer in applied mathematics.\nOn\n30\nMay\n1940\nSawyer married Hilda Elizabeth Crowther\n(1920\n-\n2003)\n, known as Betty, after, it is claimed, a ten day courtship. Betty was born in Manchester on\n16\nNovember\n1920\nand, before her marriage was a biscuit packer. Warwick and Betty Sawyer had one child, a daughter Anne Elizabeth Sawyer. She married Pedro R Leon, who became a professor in the Department of Spanish and Portuguese of the University of Toronto.\nWhile Sawyer was at Manchester he published his first book, namely\nMathematician's Delight\n(1943)\n. Even from his days as a student at the University of Cambridge, we saw from the talks he gave, mentioned above, that he was interested in teaching mathematics at all levels. This book marks the first of many on teaching mathematics. It was exceptionally successful with many editions and reprints over the following\n70\nyears. It has been translated into ten languages and sold over\n500\n,\n000\ncopies\n[\n36\n]\n.\nFor extracts from prefaces and reviews of many of Sawyer's books, see\nTHIS LINK\n.\nHis interests by now were such that he wanted to become involved in teaching young children and in\n1943\n-\n4\nhe taught a class of\n24\neleven-year-old boys in a B-stream class in a Secondary Modern school for one afternoon a week.\nSawyer remained in Manchester until\n1944\n, the year he published his second paper\nA property of certain differential equations\n. His own review stated:-\nOn the differential equation whose solutions are the nth derivatives of the solutions of a given differential equation.\nHere is a fuller review:-\nThe successive derivatives of the solutions of a second order linear differential equation with polynomial coefficients are the solutions of other analogous equations in which the degree of the coefficients is generally increasing. It follows that the n-th derivative equation in general presents apparent singularities. The following two theorems are established.\n(1)\nIf the degree of the first coefficient is the same for all n, the equation has at most\n3\neffective singularities, one of which can be at infinity.\n(2)\nThe apparent singularities are the roots of an equation whose coefficients are polynomials in n of the same degree as their weight.\nIn\n1944\nSawyer moved to the Leicester College of Technology where he lived at\n12\nMilligan Road, Leicester. We learn something of his work there from his article\nTwo Avenues to Advance in Mathematical Education\n(\nsee\n[\n22\n]\nor the July\n1980\nÂ\nBulletin\nÂ of the\nInstitute of Mathematics and its Applications\n)\n:-\nW Howard Joint, head of the mathematics department in Leicester College of Technology, had come to the conclusion that we were trying to teach mathematics to engineering apprentices in a foreign language. Mathematics appeared in words and symbols, but the apprentices thought, so to speak, with their hands, by appreciating the sizes and shapes of actual objects. He began introducing physical objects into mathematics lessons. ... Shortly afterwards, I took over the department and together with some excellent colleagues carried the development to the stage where we could present almost every topic of the Ordinary National Certificate course by relating it to actual objects.\nIn the same article, he recounted another interesting episode which took place while he was at Leicester College of Technology:-\nWhen I was at Leicester, a decision was taken by an industry that employed extremely unskilled workers to send their youngest workers to the College for one day each week. We believed that most of the boys and girls concerned had been very glad to escape from school and would not at all welcome a return to classrooms. On the first day of the new scheme, two of my colleagues were ill with influenza, so I had to take three classes of boys in a large room for the entire afternoon. In these circumstances I saw no prospect of teaching much arithmetic. I felt I would have done my duty to the College if I made sure they did not burn the place down, so I opted unashamedly for an activity period. I collected all the things I could find that would keep them busy and interested. Their reaction to this was so striking that when things returned to normal and I had only my own class to deal with, I had not the heart to return to chalk-and-talk.\nThese experiences had a large impact on Sawyer's ideas about teaching and several of his later books, for example\nSearch for Pattern\nand\nDesign and Making\n, are clearly motivated by them.\nIn\n1948\nSawyer was appointed Lecturer in Mathematics at University College of the Gold Coast\n(\nnew Ghana\n)\n[\n20\n]\n, where he became head of mathematics. This College had been founded in the British colony of the Gold Coast as an affiliate college of the University of London. He wrote in the Preface of his book\nPrelude to Mathematics\n(1955)\n:-\nThe present book was worked out in a country where a great educational change was taking place. In\n1948\n, the University College of the Gold Coast was founded. The students were keen and of first-rate ability. So far as inborn intelligence went, they were capable of becoming, within ten or twenty years, research workers in mathematics, university lecturers, professors. But of course there was no mathematical tradition in the country. That had to be created. It was therefore necessary to obtain a sort of essence of mathematics; to examine the life of a budding mathematician in one of the older mathematical centres; to study all the influences that helped him to grow; the atmosphere of school and college, countless hints, allusions, suggestions from older mathematicians and from books. From all of this to try to form some clear idea of what we were trying to do, what the qualities of a mathematician were, how they were to be stimulated.\nIn\n1950\nSawyer moved to Canterbury College, Christchurch, New Zealand where he taught until\n1956\n. Leaving from the Gold Coast, he sailed with his family on the\nDavid Livingstone\nfrom Calabar, Nigeria, to Liverpool, England arriving on\n28\nJuly\n1950\n, then from Southampton, England to New Zealand departing on\n29\nSeptember\n1950\non the\nS S Tamaroa\n. One of his pupils at Canterbury College, who went on to become a professor of mathematics at the University of Canterbury, was\nRoy Kerr\n. The information about Sawyer in\nSearch for Pattern\nstates:-\nFor five years from\n1951\nhe was at Canterbury College, New Zealand. He founded a mathematical society for high-school students, and this led to a significant increase in the supply of mathematics teachers in Canterbury province.\nIn\n1957\nhe was appointed as an associate professor at the University of Illinois in the United States. He explains in\nA Teaching Experience in U.S.A.\n(\nsee\n[\n22\n]\n)\nhow his views differed from those of the people who had offered him the job:-\nIn\n1957\nI came to the United States on the invitation of some mathematicians who were launching the \"Modern Math\" campaign. They thought my book \"Prelude to Mathematics\" was a useful expression of the spirit of modern mathematics. Max Beberman was working on a series of textbooks expounding the approach of \"Modern Math\". These books were rather behind schedule and it was thought that as a writer I might help them to catch up by writing some books in the series. This was of course an illusion. I was appalled by their approach, which was the exact opposite of my idea of good mathematics teaching. ... It had been arranged that I should teach calculus to a class of first year students at Illinois University. There they accepted students who had graduated from high school. Sometimes this was not sufficient to ensure a successful college career and the first year to some extent served the purpose of an entrance examination. ... My assignment was to cover the first ten chapters of a particular calculus textbook. I imagine the normal procedure was to go straight through the book, giving tests in which students would receive grades A, B or C for partial understanding. I did not follow this procedure.\nAfter a year at the University of Illinois, Sawyer was appointed as professor of mathematics at Wesleyan University. A report in\nThe Progress Index\ntells us something about his activities at the time\n[\n31\n]\n:-\nLexington - Dr W Warwick Sawyer, Wesleyan University professor of mathematics, will lecture at Virginia Military Institute Wednesday evening in a program sponsored by the University Center in Virginia and Virginia Military Institute. Dr Sawyer will speak at\n7\n:\n30\np.m. in room\n111\nof Mallory Hall on the topic, \"A Pictorial Approach to Advanced Calculus.\" The lecture is open to the public. A native of England, Dr Sawyer joined the faculty at Wesleyan in Middletown, Conn., in\n1958\n. Previously he had taught at the University of Illinois, Canterbury College in New Zealand, University College of the Gold Coast in Africa, and College of Technology Leicester, England. He is the author of a number of books on mathematics and from\n1958\nto\n1961\nedited the \"Mathematics Student Journal\" published by the National Council of Teachers of Mathematics. Dr Sawyer is a member of both the\nAmerican Mathematical Society\nand the\nMathematical Association of America\n. His lecture at Virginia Military Institute will be one of six at area colleges. On Tuesday\n(30\nOctober\n)\nhe will speak at Randolph-Macon College in the morning and at Longwood College that afternoon. Prior to his Virginia Military Institute engagement, he will lecture at Virginia Union University, and Thursday at Madison College and Randolph-Macon Woman's College.\nIn\n1965\nhe moved to Toronto in Canada when he was appointed to the University of Toronto, holding a joint appointment in the Department of Mathematics and the College of Education\n[\n34\n]\n:-\nHe moved to the University of Toronto in\n1965\nand remained until his retirement in\n1976\n, when he moved to Cambridge\n[\nEngland\n]\n. For the next twenty years, he met regularly with about five or six students aged about fourteen on Saturday mornings.  He eventually returned to Toronto to be near his daughter, and died on February\n15\n,\n2008\nat the age of ninety-six.\nHe was an Honorary Life member of the\nBritish Mathematical Association\n, a Fellow of the\nInstitute for Mathematics and its Applications\n, and a member of the\nEdinburgh Mathematical Society\n, Cambridge Philosophical Society,\nCanadian Mathematical Society\nand the Ontario Association for Mathematics Education.\nWarwick Sawyer was an extraordinary individual who was very much his own master. He was an independent thinker who was not part of any school of thought and who avoided bureaucratic entanglements, preferring to make his influence felt through the students he encountered, the books he published and the colleagues who respected him. In his dissemination of mathematics, he sought to make it intelligible to both the general public, as well as to students, who too often tended to take a formulaic view of the discipline. Long before it became common to do so, he produced books to this end that have stood the test of time and are still popular, witness the many translations.\nAs well as his books, Sawyer wrote many papers on mathematics education. At least half were written in the years he spent in retirement in Cambridge, England. You can read extracts from some of these at\nTHIS LINK\n.\nWe note that Sawyer did not write exclusively on mathematical education during his retirement, publishing the papers\nConjectures related to the Hilbert matrix\n(1986)\nand\nQuotients of moment functions\n(1993)\n.\nAfter the death of his wife in\n2003\n, Sawyer moved to Toronto to live with his daughter and her husband. Eventually he had to move to a nearby nursing home.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}