{
  "nome_completo": "Wenceslaus Johann Gustav Karsten",
  "nome_curto": "Wenceslaus Johann Gustav Karsten",
  "ano_nascimento": "1732",
  "ano_morte": "1787",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Karsten/",
  "lugar_nascimento": "Neubrandenburg, Mecklenburg-Strelitz, Germany",
  "lugar_morte": "Halle, Germany",
  "biografia": "Wenceslaus Johann Gustav Karsten\n's father, Johann Christopher Karsten, was a pharmacist while his mother, Magdalena Sophia Thiel, was the daughter of a pharmacist from Güstrow. Johann Gustav was the eldest of his parents eight children.  In\n1735\n, when the young boy was four years old, his parents' house in Neubrandenburg was destroyed by fire. Having lost their home and all their possessions, the Karsten's moved to accommodation in Burg Stargard, just south of Neubrandenburg. A short while later it was decided to send the young boy to Güstrow to live with his grandfather Gustav Thiel. Johann Christopher then tried to rebuild the pharmacy in Neubrandenburg but in\n1741\nhe too went to live in Güstrow where he became a notary and ran a small farm.\nAlthough Karsten received his education in Güstrow, certainly at first at the Fürstliche cathedral school, it was a schooling which aimed to teach languages and very little attention was given to mathematics or natural science. Later however, beginning in\n1748\n, when he showed great mathematical potential, Karsten was given private instruction in mathematics. Karsten then studied theology and philosophy at Rostock from\n1750\nto\n1752\nwhere he was taught by\nAepinus\nand his brother, and at Jena from\n1752\nto\n1754\n. It was mathematics, however, which was his real passion, and he studied this on his own.\nAt Rostock the professor of mathematics, Petrus Becker, died in\n1753\nand\nAepinus\nwas appointed to Berlin in\n1754\n, planning to take up his appointment in the following year. Karsten went to Rostock to study for his doctorate which was awarded in February\n1755\nfor his thesis\nAlgebra ejosque differentia ab Arithmetica Respondente\nⓉ\n(\nAlgebra of differences from an arithmetical point of view\n)\n, and he was appointed there as a\nprivatdozent\nat Easter.\nAepinus\nhad not yet left Rostock when Karsten took up his post and was able to advise him about teaching. He also introduced Karsten to\nEuler\nand the two exchanged a series of letters\n(38\nin all, of which\n23\nwere written by Karsten\n)\nbetween\n1758\nand\n1765\n. Karsten began publishing work at Rostock:\nDe affectionibus, quae omnis generis functionum, praecipue si tres vel adeo quatour involvant variabiles, differentialibus competunt, si eorum integrale sit possibile\nⓉ\n(\nAffecting  functions of every kind, especially if they involve two, or even three variables, their differentials if they exist, if it is possible for them to be integrated\n)\n(1756)\n,\nElementa matheseos universalis\nⓉ\n(\nElements of universal mathematics\n)\n(1756)\n,\nBeweis, dass der Algorithmus speciosus keine widersinnigen Rechnungsregeln enthalte\nⓉ\n(\nProof that the false-position algorithm contains no incorrect calculating rules\n)\n(1757)\n, and\nPraelectiones matheseos theoreticae elementaris\nⓉ\n(\nReadings in elementary theoretical mathematics\n)\n(1758)\n.\nRealising that his chances of a professorial appointment at Rostock were small, Karsten applied for various positions. In\n1756\nhe applied to the\nGymnasium\nin Hamburg and in the following year to the Königlichen Gymnasium in Stettin. His financial situation at this time was extremely difficult. However his luck changed when the professor of logic at Rostock died leaving a professorial vacancy. Karsten was appointed as professor at the University of Rostock in\n1758\nbut the university suffered problems a couple of years later as a result of a dispute between the city of Rostock and Duke Friedrich of Mecklenburg. The Duke split the university into two parts, one to remain in Rostock, the other to be set up in Bützow, about\n25\nkm south of Rostock, and named the Friedrichs University of Bützow. Karsten was transferred to Bützow where he was rector of the university for a semester in\n1765\nand again in\n1768\n-\n69\n. This was a difficult period in Mecklenburg since the Seven Years' War, which involved all the major powers of Europe, had been fought from\n1756\nto\n1763\nand it had left the region very impoverished. This meant that Karsten had to teach in a university in which, certainly at first, there was no library and not even lecture rooms. Karsten had to teach classes of students in his own home. In\n1765\nKarsten was involved in the publication of\nEuler\n's\nTheoria motus corporum rigidorum\nⓉ\n(\nTheory of the motion of rigid bodies\n)\n. He wrote an important article in\n1768\nVon den Logarithmen vermeinter Grössen\nⓉ\n(\nOn the logarithms of supposed sizes\n)\nin which he discussed logarithms of negative and imaginary numbers, giving a geometric interpretation of logarithms of complex numbers as hyperbolic sectors, based on the similarity of the equations of the circle and of the equilateral hyperbola. This work is discussed in\n[\n1\n]\nwhere Dobrzycki suggests that Karsten's contributions have been underrated. Let us hope that this article will go some way to towards the wish expressed in\n[\n1\n]\nthat Karsten be mentioned in histories of mathematics.\nKarsten was appointed to the University of Halle in\n1778\nto fill the chair which was left vacant on the death of\nSegner\nin October of the previous year. Karsten filled this position until his death in\n1787\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic"
  ]
}