{
  "nome_completo": "Wendelin Werner",
  "nome_curto": "Wendelin Werner",
  "ano_nascimento": "1968",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Werner_Wendelin/",
  "lugar_nascimento": "Cologne, Germany",
  "lugar_morte": null,
  "biografia": "Wendelin Werner\n's parents were living in Germany when he was born but moved to France when he was one year old. They settled in France and Wendelin was brought up there. He has an older brother, Benjamin Werner, who was born in Munich in June\n1966\n. Benjamin Werner, an outstanding researcher in computer science, was, of course, also brought up in France. Wendelin took French nationality at the age of nine. He studied at the Lycée Franco-Allemand of Buc, lying south-west of Paris and close to Versailles. This school, with a reputation for academic excellence, had operated in the Lycée Hoche in Versailles until\n1981\nwhen it moved into its own premises. After leaving the Lycée Franco-Allemand, it was to the Lycée Hoche, close to the Palace of Versailles, that Werner went to prepare for his university studies. He matriculated at the École Normale Supérieure in\n1987\nand graduated with a degree in mathematics in\n1991\nhaving become especially interested in\nprobability theory\n. Remaining in Paris, he undertook research for his doctorate at the Université Pierre-et-Marie-Curie, Université Paris VI, with Jean-Francois Le Gall as his thesis advisor.\nIn\n1993\nWerner was appointed as a permanent researcher at the Centre National de la Recherche Scientifique\n(\nCNRS\n)\njust before he defended his thesis on planar\nBrownian Motion\nfor which he was awarded his doctorate. He worked at the CNRS until\n1997\nwhen he was named as professor of mathematics at the Université Paris-Sud\n11\n. He continued to undertake research at the Laboratoire de mathématiques of the Orsay Faculty of Science, a laboratory jointly run by the Université Paris-Sud and CNRS. In addition, in\n2005\nhe was appointed as Professor of Mathematics at the École Normale Supérieure.\nWerner's remarkable mathematical contributions have led to him receiving many highly prestigious prizes. In\n1998\nhe was awarded the Rollo Davidson Prize at the University of Cambridge which is awarded annually to early-career researchers in probability by the Rollo Davidson trustees. In\n1999\nWerner was awarded the Doisteau-Émile Blutet prize from the Academy of Sciences in Paris and was honoured with an invitation to give the Cours Peccot at the Collège de France. In July\n2000\nhe received the\nEuropean Mathematical Society\nprize at the European Congress of Mathematics in Barcelona. This prize recognizes excellent mathematical contributions by young researchers not older than\n32\nyears. He was awarded the\nFermat\nprize in\n2001\nby the Institute of Mathematics of Toulouse:-\n... for his works on the intersection exponents of Brownian motion and their impact in theoretical physics.\nHis work continued to be recognised by further awards and, in\n2003\n, he received another award from the Academy of Sciences in Paris, namely their Jacques Herbrand prize. He received the Line and Michel Loeve International Prize in Probability at the University of California, Berkeley, in\n2005\n. This prize, awarded every second year, recognises outstanding contributions by researchers in probability who are under\n45\nyears old. The\nSociety for Industrial and Applied Mathematics\n'\nGeorge Polya\nPrize for\n2006\nwas awarded jointly to Werner and his collaborators Greg Lawler of Cornell University and Oded Schramm of the Microsoft Corporation:-\nLawler, Schramm and Werner received the prize for their groundbreaking work on the development and application of stochastic\nLoewner\nevolution\n(\nSLE\n)\n. Of particular note is the rigorous establishment of the existence and conformal invariance of critical scaling limits of a number of\n2\nD lattice models arising in statistical physics.\nAlso in\n2006\nWerner received the most prestigious award that a mathematician can receive, namely a\nFields\nMedal. The citation states that the Medal was awarded:-\n... for his contributions to the development of stochastic\nLoewner\nevolution, the geometry of two-dimensional Brownian motion, and conformal field theory.\nIn an interview after being awarded the\nFields Medal\n, Werner was asked if he could explain, in simple terms, one of the problems he worked on. Here is his reply:-\nTake scissors and cut completely at random a shape in a piece of paper. What can you say about this shape? Part of the question is to make sense of notion \"completely at random\" because there are infinitely many possibilities. One motivation to study this type of question comes from physics: If you consider a physical system and raise its temperature, then at certain values of the temperature, there occurs sudden change of its macroscopic behaviour: Liquid becomes vapour, iron looses its spontaneous magnetisation etc. It has been observed empirically that when a system is exactly at such a \"critical\" temperature, it can exhibit random macroscopic features. For instance, if the system is planar, then the two phases may coexist and the lines separating the regions corresponding to each of the phases are then random loops, just as those cut out by scissors.\nThe first major prize we mentioned was the Rollo Davidson prize which is associated with the University of Cambridge. In\n2001\nWerner was invited to deliver the Second Rollo Davidson Lecture in Churchill College, Cambridge. He gave the lecture\nRandom planar curves and conformal invariance\nand his abstract for this talk gives an excellent feel for one of the research projects he was involved in at this time:-\nUnderstanding the behaviour of certain natural very long random curves in the plane is a seemingly simple question that has turned out to raise deep questions, some of which remain unsolved. For instance, theoretical physicists have predicted\n(\nand this is still an open problem\n)\nthat the number\na\n(\nN\n)\na(N)\na\n(\nN\n)\nof self-avoiding curves of length\nN\nN\nN\non the square lattice\nZ\n×\nZ\n\\mathbb{Z} \\times  \\mathbb{Z}\nZ\n×\nZ\ngrows asymptotically like\nC\nN\nN\n11\n/\n32\nC^{N} N^{11/32}\nC\nN\nN\n1\n1\n/\n3\n2\nfor some constant C. More generally, theoretical physicists ... have made predictions concerning the existence and values of critical exponents for various two-dimensional systems in statistical physics\n(\nsuch as self-avoiding walks, critical percolation, intersections of simple random walk\n)\nusing considerations related to several branches of mathematics\n(\nprobability theory, complex variables, representation theory of infinite-dimensional\nLie\nalgebras\n)\n.\nIn April\n2005\nWerner delivered the\n4\nth\nThomas Wolff Memorial Lectures in Mathematics at the California Institute of Technology. The title for his series of talks was\nTwo-dimensional continuous random systems\nand again the abstract for these talks gives good insight into topics on which he was making a remarkable impact in collaboration with Greg Lawler and Oded Schramm:-\nProbability theory and statistical mechanics often focus on the behaviour of a functional of a large random system, with microscopic random inputs that sometimes interact with each other. In many cases, the output is close to being deterministic when the system is very large. In \"critical cases,\" the outcome can however be random at any scale. The microscopic randomness then gives rise to a macroscopic continuous randomness and it is natural to try to understand it mathematically. This turns out to be rather difficult in general, but in some cases, it is possible thanks to an additional mathematical structure, and relates these random structures to other parts of mathematics.\nAn example is given by the scaling limit of critical two-dimensional particle systems, where particles interact locally. The understanding of these phenomena is related to complex analysis and to\nrepresentation theory\n, as predicted by theoretical physicists. Mathematical progress has been made towards a better rigorous understanding of these models during the last years.\nWerner has been invited to give several other named lectures, in addition to those mentioned above, such as the\nMark Kac\nseminar in Utrecht, the James and Marylin Simons lectures at the Massachusetts Institute of Technology, the Levy lecture in Barcelona, and the Goran Gustafsson lectures in Stockholm. He has given plenary lectures at many international conferences including ones in Bangalore, India, and Rio de Janeiro, Brazil.\nFinally we quote from the introduction to the lecture Charles M Newman gave at the International Congress of Mathematicians in Madrid describing Werner's contributions which had led to him receiving the\nFields\nMedal at this Congress\n[\n3\n]\n:-\nThere are a number of aspects of Werner's work that add to my pleasure in this event. One is that he was trained as a probabilist, receiving his Ph.D. in\n1993\nunder the supervision of Jean-François Le Gall in Paris with a dissertation concerning planar Brownian Motion ... Until now, Probability Theory had not been represented among\nFields\nMedals and so I am enormously pleased to be here to witness a change in that history. ... Werner's work, together with his collaborators such as Greg Lawler, Oded Schramm and Stas Smirnov, involves applications of Probablity and Conformal Mapping Theory to fundamental issues in Statistical Physics ... A second source of pleasure is my belief that this, together with other work of recent years, represents a watershed in the interaction between Mathematics and Physics generally. Namely, mathematicians such as Werner are not only providing rigorous proofs of already existing claims in the Physics literature, but beyond that are providing quite new conceptual understanding of basic phenomena - in this case, a direct geometric picture of the intrinsically random structure of physical systems at their critical points\n(\nat least in two dimensions\n)\n. One simple but important example is percolation ... Yet a third source of pleasure concerns the collaborative nature of much of Werner's work. Beautiful and productive mathematics can be the result of many different personal work styles. But the highly interactive style, of which Werner, together with Lawler, Schramm and his other collaborators, is a leading exemplar, appeals to many of us as simultaneously good for the soul while leading to work stronger than the sum of its parts. It is a promising sign to see\nFields\nMedals awarded for this style of work.\nOf course Werner has continued to receive honours following the award of the\nFields\nMedal. For example, in\n2008\nhe was elected to the French\nAcademy of Sciences\nand, in January of the same year, he was the\nAmerican Mathematical Society\nColloquium Lecturer, giving his series of lectures on\nRandom conformally invariant pictures\nat San Diego Convention Center.\nWe must not end this biography without mentioning that Werner has had a, perhaps surprising, life outside mathematics as an actor playing a role in the\n1982\nfilm\nLa Passante du Sans-Souci\nⓉ\n(\nThe Passerby\n)\n. He has also involved himself with political issues, publishing an open letter to President Nicolas Sarkozy of France in February\n2009\n. The letter criticises policies of Sarkozy's government which have, in Werner's opinion, led to a breakdown in trust between government and researchers.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}