{
  "nome_completo": "Werner Karl Heisenberg",
  "nome_curto": "Werner Heisenberg",
  "ano_nascimento": "1901",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heisenberg/",
  "lugar_nascimento": "Würzburg, Germany",
  "lugar_morte": "Munich, Germany",
  "biografia": "Werner Heisenberg\n's father was August Heisenberg and his mother was Anna Wecklein. At the time that Werner was born his father was about to progress from being a school teacher of classical languages to being appointed as a\nPrivatdozent\nat the University of Würzburg. Anna's father, Nikolaus Wecklein, was the headmaster of the Maximilians\nGymnasium\nin Munich and it was while August Heisenberg was a trainee teacher at that school that he had met Anna. August and Anna were married in May\n1899\n. Werner had an older brother Erwin, born in March\n1900\n, who was therefore nearly two years older than the subject of this biography.\nAugust Heisenberg was\n[\n3\n]\n:-\n... a rather stiff, tightly controlled, authoritarian figure.\nHe was an Evangelical Lutheran and his wife Anna had converted from being a Roman Catholic to make sure there were no religious problems with their marriage. August and Anna, however, were only religious for the sake of convention. A Christian belief was expected of people of their status so for them it was a social necessity. In private, however, they expressed their lack of religious beliefs, and in particular they brought up their children to follow Christian ethics but showed total disbelief in the historical side of Christianity.\nIn September\n1906\n, shortly before his fifth birthday, Werner enrolled in a primary school in Würzburg. He spent three years at that school but then in\n1909\nhis father was appointed Professor of Middle and Modern Greek at the University of Munich. In June\n1910\n, a few months after his father took up the professorship, Werner and the rest of the family moved to Munich. There he attended the Elisabethenschule from September, spending only one year at this school before entering the Maximilians Gymnasium in Munich. This of course was the school where his grandfather was the headmaster.\nIn\n1914\nWorld War I began and the Gymnasium was occupied by troops. Lessons were arranged in different buildings and as a result of the disruption Heisenberg undertook much independent study which probably had a beneficial effect on his education. His best subjects were mathematics, physics and religion but his record throughout his school career was excellent all round. In fact his mathematical abilities were such that in\n1917\nhe tutored a family friend who was at university in calculus. During this period he belonged to a paramilitary organisation which operated in the Gymnasium with the intention of preparing the young men for later military service.\nHeisenberg also worked on farms as his contribution to another voluntary organisation which sent the boys to help in the fields in spring and summer. This work took him away from home for the first time in\n1918\nwhen he was sent to work on a dairy farm in Upper Bavaria. It was a time of great hardship with long hours of labour made worse since there was insufficient food. He spent his spare time playing chess, which he did to a very high standard, and also read mathematics texts he had taken with him. In fact by this time he had become interested in number theory and he read\nKronecker\n's work and tried to find a proof of\nFermat's Last Theorem\n.\nAfter the war ended in\n1918\nthe situation in Germany became unstable with different factions trying to take power by force. Heisenberg took part in the military suppression of the Bavarian Soviet forces but, although it was a very serious business, the young men probably treated it almost as a game. He later wrote\n[\n4\n]\n:-\nI was a boy of\n17\nand I considered it a kind of adventure. It was like playing cops and robbers ...\nIn the Gymnasium Heisenberg led a youth movement and he later led a movement within the Young Bavarian League. In\n1920\nhe took his Abitur examination and was one of two pupils entered from the Maximilians Gymnasium for a Bavarian wide competition for a scholarship from the Maximilianeum Foundation. Eleven scholarships were available and Heisenberg just made it by coming in eleventh place. His examination results in mathematics and physics were classed as extraordinary, but his essay on \"tragedy as poetic art\" was much less impressive. He declined the offer of free accommodation from the Foundation, preferring to live with his parents.\nIn the period between taking his\nAbitur\nexamination and entering the University of Munich, Heisenberg went off hiking with his youth group. He nearly died of typhoid which he contracted after spending the night in a castle which had been used as a military hospital. He recovered, despite the problems of obtaining suitable food, in time to begin his university studies. During the summer of\n1920\nHeisenberg was, as he had been for some time, intending to study pure mathematics at university. He had read\nWeyl\nand also\nBachmann\n's text which gave a complete survey of number theory and this was to be his intended research topic for his doctorate. He approached\nFerdinand von Lindemann\nto see if he would be his research supervisor.\nHad the interview with\nLindemann\nbeen a success then Heisenberg might today be known as an outstanding number theorist. However, the interview did not go well, almost certainly since\nLindemann\nwas only two years off retiring and had only agreed to see Heisenberg as a favour to his father who was a friend and colleague. Following this Heisenberg had an interview with\nSommerfeld\nwho happily accepted him as a student.\nWith his fellow student\nPauli\n, Heisenberg began to study theoretical physics under\nSommerfeld\nin October\n1920\n. At first he was cautious, taking mostly mathematics classes and making sure that he could revert to mathematics if the theoretical physics went badly. He avoided courses by\nLindemann\n, however, so his mathematical interests moved from number theory to geometry. Soon his confidence in theoretical physics was such that by the second semester he was taking all of\nSommerfeld\n's courses. He also took courses in experimental physics, which were compulsory, and he began to plan to undertake research in relativity. However\nPauli\n, who was at that time working on his major survey of the theory of relativity, advised him against doing research in that topic. On atomic structure, however,\nPauli\nexplained, much needed to be done since theory and experiment did not agree.\nIn\n[\n6\n]\nHeisenberg wrote of his early days at university:-\nMy first two years at Munich University were spent in two quite different worlds: among my friends of the youth movement and in the abstract realm of theoretical physics. Both worlds were so filled with intense activity that I was often in a state of great agitation, the more so as I found it rather difficult to shuttle between the two.\nIn June\n1922\nhe attended lectures by\nNiels Bohr\nin Göttingen. Returning to Munich,\nSommerfeld\ngave him a problem in hydrodynamics to keep him busy while he\n(\nSommerfeld\n)\nspent session\n1922\n-\n23\nin the United States. Heisenberg presented preliminary results on the problem on turbulence at a conference in Innsbruck before going again to Göttingen to study with\nBorn\n, Franck, and\nHilbert\nwhile his supervisor was away. There he worked with\nBorn\non atomic theory, writing a joint paper with him on helium. His doctoral dissertation, presented to Munich in\n1923\n, was on turbulence in fluid streams.\nAfter taking his doctorate Heisenberg went on a trip to Finland then, in October\n1923\n, he returned to Göttingen as\nBorn\n's assistant. In March\n1924\nhe visited\nNiels Bohr\nat the Institute for Theoretical Physics in Copenhagen where he met\nEinstein\nfor the first time. Returning again to Göttingen he delivered his\nhabilitation\nlecture on\n28\nJuly\n1924\nand qualified to teach in German universities.\nHeisenberg later wrote:-\nI learned optimism from\nSommerfeld\n, mathematics at Göttingen, and physics from\nBohr\n.\nFrom September\n1924\nuntil May\n1925\nhe worked, with the support of a Rockefeller grant, with\nNiels Bohr\nat the University of Copenhagen, returning for the summer of\n1925\nto Göttingen. Heisenberg invented\nmatrix\nmechanics, the first version of\nquantum mechanics\n, in\n1925\n. He did not invent these concepts as a matrix algebra, however, rather he focused attention on a set of quantised probability amplitudes. These amplitudes formed a non-commutative algebra. It was\nMax Born\nand\nPascual Jordan\nin Göttingen who recognised this non-commutative algebra to be a matrix algebra.\nMatrix mechanics was further developed in a three author paper by Heisenberg,\nBorn\nand\nJordan\npublished in\n1926\n. In May\n1926\nHeisenberg was appointed Lecturer in Theoretical Physics in Copenhagen where he worked with\nNiels Bohr\n. In\n1927\nHeisenberg was appointed to a chair at the University of Leipzig and he delivered his inaugural lecture on\n1\nFebruary\n1928\n. He was to hold this post until, in\n1941\n, he was made director of the Kaiser Wilhelm Institute for Physics in Berlin.\nIn\n1932\nhe was awarded the Nobel Prize in physics for:-\nThe creation of quantum mechanics, the application of which has led, among other things, to the discovery of the allotropic forms of hydrogen.\nIn the presentation speech H Pleijel said:-\nHeisenberg ... viewed his problem, from the very beginning, from so broad an angle that it took care of systems of electrons, atoms, and molecules. According to Heisenberg one must start from such physical quantities as permit of direct observation, and the task consists of finding the laws which link these quantities together. The quantities first of all to be considered are the frequencies and intensities of the lines in the spectra of atoms and molecules. Heisenberg now considered the combination of all the oscillations of such a spectrum as one system, for the mathematical handling of which, he set out certain symbolical rules of calculation. It had formerly been determined already that certain kinds of motions within the atom must be viewed as independent from one another to a certain degree, in the same way that a specific difference is made in classical mechanics between parallel motion and rotational motion. It should be mentioned in this connection that in order to explain the properties of a spectrum it had been necessary to assume self-rotation of the positive nuclei and the electrons. These different kinds of motion for atoms and molecules produce different systems in Heisenberg's quantum mechanics. As the fundamental factor of Heisenberg's theory can be put forward the rule set out by him with reference to the relationship between the position coordinate and the velocity of an electron, by which rule\nPlanck\n's constant is introduced into the quantum-mechanics calculations as a determining factor. ...\nHeisenberg's quantum mechanics has been applied by himself and others to the study of the properties of the spectra of atoms and molecules, and has yielded results which agree with experimental research. It can be said that Heisenberg's quantum mechanics has made possible a systemization of spectra of atoms. It should also be mentioned that Heisenberg, when he applied his theory to molecules consisting of two similar atoms, found among other things that the hydrogen molecule must exist in two different forms which should appear in some given ratio to each other. This prediction of Heisenberg's was later also experimentally confirmed.\nHeisenberg is perhaps best known for the\nUncertainty Principle\n, discovered in\n1927\n, which states that determining the position and momentum of a particle necessarily contains errors the product of which cannot be less than the quantum constant ℏ. These errors are negligible in general but become critical when studying the very small such as the atom. It was in\n1927\nthat Heisenberg attended the Solvay Conference in Brussels. He wrote in\n1969\n:-\nTo those of us who participated in the development of atomic theory, the five years following the Solvay Conference in Brussels in\n1927\nlooked so wonderful that we often spoke of them as the golden age of atomic physics. The great obstacles that had occupied all our efforts in the preceding years had been cleared out of the way, the gate to an entirely new field, the quantum mechanics of the atomic shells stood wide open, and fresh fruits seemed ready for the picking.\nHeisenberg published\nThe Physical Principles of Quantum Theory\nin\n1928\n. In\n1929\nhe went on a lecture tour to the United States, Japan, and India. In the\n1930\ns Heisenberg and\nPauli\nused a quantised realisation of space in their lattice calculations. Heisenberg hoped this mathematical property would lead to a fundamental property of nature with a 'fundamental length' as one of the constants of nature.\nIn\n1932\nHeisenberg wrote a three part paper which describes the modern picture of the nucleus of an atom. He treated the structure of the various nuclear components discussing their binding energies and their stability. These papers opened the way for others to apply quantum theory to the atomic nucleus.\nIn\n1935\nthe Nazis brought in a law whereby professors over\n65\nhad to retire.\nSommerfeld\nwas\n66\nand he had already indicated that he wanted Heisenberg to succeed him. It was an appointment which Heisenberg badly wanted and in\n1935\nSommerfeld\nagain indicated that he wanted Heisenberg to fill his chair. However this was the period when the Nazis wanted \"German mathematics\" to replace \"Jewish mathematics\" and \"German physics\" to replace \"Jewish physics\". Relativity and quantum theory were classed as \"Jewish\" and as a consequence Heisenberg's appointment to Munich was blocked. Although he was in no way Jewish, Heisenberg was subjected to frequent attacks in the press describing him to be of \"Jewish style\".\nIn\n1937\nHeisenberg married Elisabeth Schumacher. He met her through his music which was important to him throughout his life. An excellent pianist, Heisenberg met Elisabeth Schumacher at a concert in which he was performing at the house of a friend. Elizabeth was only\n22\nwhen they met, Heisenberg was\n35\n. They were married on\n29\nApril\n1937\n, less than three months after they first met. Heisenberg had been asked to take up the appointment at Munich in March but had asked for the date to be delayed until August because of his wedding. It was agreed that he should take up the appointment on\n1\nAugust. He and his wife arrived in Munich in July but his appointment was blocked by the Nazis.\nDuring the Second World War Heisenberg headed the unsuccessful German nuclear weapons project Uranverein. He worked with Otto Hahn, one of the discoverers of nuclear fission, on the development of a nuclear reactor but failed to develop an effective program for nuclear weapons. Whether this was because of lack of resources or a lack of a desire to put nuclear weapons in the hands of the Nazis, it is unclear.\nAfter the war he was arrested by Alsos, a secret mission that followed the advancing Allied forces in Europe to determine the progress of Germany's atomic bomb project. He was interned at Farm Hall in Godmanchester, Huntingdonshire, England, with other leading German scientists. However he returned to Germany in\n1946\nwhen he was appointed director of the Max\nPlanck\nInstitute for Physics and Astrophysics at Göttingen. In the winter of\n1955\n-\n1956\nhe gave the Gifford Lectures \"On physics and philosophy\" at the University of St Andrews. When the Max\nPlanck\nInstitute moved to Munich in\n1958\nHeisenberg continued as its director. He held this post until he resigned in\n1970\n.\nHe was also interested in the philosophy of physics and wrote\nPhysics and Philosophy\n(1962)\nand\nPhysics and Beyond\n(1971)\n.\nHeisenberg received many honours for his remarkable contributions in addition to the Nobel Prize for Physics. He was elected a Fellow of the\nRoyal Society of London\n, and was a member of the academies of\nGöttingen\n, Bavaria, Saxony,\nPrussia\n,\nSweden\n,\nRomania\n,\nNorway\n,\nSpain\n,\nThe Netherlands\n, the\nAkademie der Naturforscher Leopoldina\n, the\nAccademia dei Lincei\n, and the\nAmerican Academy of Arts and Sciences\n. Among the prizes he received was the\nCopernicus\nprize.",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}