{
  "nome_completo": "Wilhelm Carl Werner Otto Fritz  Franz Wien",
  "nome_curto": "Wilhelm Wien",
  "ano_nascimento": "1864",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wien/",
  "lugar_nascimento": "Gaffken, near Fischhausen, East Prussia (now Primorsk Kaliningrad Oblast Russia)",
  "lugar_morte": "Munich, Germany",
  "biografia": "Wilhelm Wien\nwas the only child of Carl Wien and Caroline Gertz who were both of noble Prussian birth. It was his parents' sense of social propriety that made them give their son six given names. In later life, Wilhelm Wien was known as 'Willy' to his friends and colleagues. Carl Wien was a gentleman farmer and landowner, and Wilhelm was born on the family farm at Gaffken near Fischhausen. Carl took his family to a farm at Drachenstein, near Rastenburg in East Prussia, when Wilhelm was two years old since the one at Gaffken could no longer support them. Today Rastenburg is known as Ketrzyn and it is in northeast Poland. In the same year that Carl and Caroline Wien moved to Drachstein, Wilhelm's cousin Max Carl Wien was born on Christmas day in Königsberg. Max Carl Wien also became a physicist and worked on high-frequency waves and the behaviour of electrolytes at high electric field strengths.\nWilhelm grew up learning about the running of the farm\n[\n1\n]\n:-\nHe frequently rode through the fields with his father, who was confined to a wagon because of a spinal ailment, and thus Wien early learned about agriculture - in which his mother assumed the bulk of the responsibilities.\nCertainly it was an upbringing which did not help him to overcome his shyness and difficulty with others\n[\n1\n]\n:-\nWien was especially close to his mother, whose excellent knowledge of history and literature stimulated his interests in the subjects. An introvert, like his father, he made no friends during his early childhood. He learned to ride, swim and skate; and, as was customary, a woman was engaged to give him private lessons in French, which he spoke before he could write his native language.\nGiven his shy personality and lack of childhood friends, school was always going to prove difficult and this indeed was the case. Wilhelm Wien attended the\nGymnasium\nin Rastenburg beginning in\n1875\nbut showed little enthusiasm for academic work. He preferred to be outside rather than in a classroom and often went off to wander in the surrounding fields. He had not been well prepared for study at the Gymnasium and he was particularly poorly prepared for the mathematics courses. After attending for five years, his parents felt that he was making little progress so he left the Gymnasium to return home in\n1880\nto learn to become a farmer. However, his mother in particular was keen for him to gain some academic skills so his parents arranged private tutors. His mathematics tutor Switalski was outstanding and Wien made good progress. He was then sent to study at the Königsberg Altstädtisches Gymnasium which was an excellent school.\nArnold Sommerfeld\nand\nHermann Minkowski\nwere both pupils at this Gymnasium at the time and, perhaps for the first time in his life, Wien made good academic progress. He graduated from the high school in\n1882\n.\nWien's mother encouraged him to continue his education with study at university. He enrolled in\n1882\nat the University of Göttingen where he studied mathematics and natural sciences but became bored with the courses\n[\n1\n]\n:-\n... being of an independent spirit, he found the lavish life of the student societies distasteful and left the university after only one semester to travel through the Rhineland and Thüringen.\nAfter these travels he returned to his parents' farm with the intention of learning to run the farm so that he could take over from his parents. His good intentions, however, soon were competing with a feeling of discontentment as he realised that he would have to undergo much training to learn skills which he did not find pleasing. He decided to try university again and in\n1883\nhe moved to Berlin where he continued his education at the university. Things certainly changed for Wien in the winter of\n1883\n-\n84\nwhen he began studying in the laboratory of\nHermann von Helmholtz\n. He later said at that time he:-\n... really came in contact with physics for the first time.\nMost German students of this period would move between different universities and Wien followed this tradition by spending the summer semester of\n1884\nat the University of Heidelberg. Here he learnt much taking a course from Georg Hermann Quincke, an excellent physicist who had done good work on the reflection of light from metallic surfaces and on electric forces. After this semester at Heidelberg, Wien returned to study with\nHelmholtz\nin Berlin and was given the topic of 'diffraction of light when it strikes a grating' as the subject for his doctoral dissertation. Wien was awarded his doctorate from Berlin in\n1886\nbut his performance is the final examination was poor and he was given a very mediocre grade. He returned to his parents' farm at Drachenstein in the summer of\n1886\nsince there had been a serious fire at the farm which had destroyed many of the farm buildings. He was able to help with rebuilding and again he felt that he should make farming his life. One might have expected his professors at Berlin to try to persuade him to continue working in physics but they did not do so, adding to Wien's feeling that perhaps he was not cut out to be a physicist\n[\n1\n]\n:-\nAugust Kundt, who in\n1888\nbecame\nHelmholtz\n's successor at the University of Berlin, and\nHelmholtz\nhimself, who at the same time had been appointed the first president of the newly founded Physikalisch-Technische Reichsanstalt, reinforced Wien's doubts about physics, maintaining that as an only son he should take over his parents' property; if he wished, he could always pursue scientific research as a hobby.\nPoor Wien was in a difficult position, unsure of his abilities in physics, but always very sure of his lack of skill for taking over running the farm. He found communicating with the farm workers difficult and he did not have the required bartering skill to even make a good purchase of a horse. Despite this he took his professors' advice and for over three years he worked as a farmer, doing research in physics as a hobby. He did manage to spend one semester with\nHelmholtz\nin Berlin but except for this he was a full-time farmer. However, fate intervened and stopped Wien spending the rest of his life as an unhappy incompetent farmer. This was in the form of a major drought in\n1890\nwhich led to Wien's parents, now quite old and in poor health, selling their farm. By the spring of\n1890\nWien was working as\nHelmholtz\n's assistant at the Physikalisch-Technische Reichsanstalt in Berlin-Charlottenburg. His parents moved to Berlin-Westend, but his mother took seriously ill and his father, seriously ill for many years, died in the following year. In\n1890\nBismarck was dismissed as Emperor and Wien really felt that a new era had opened up for him. Over the next few years he carried out work of exceptional quality which led to the award of a Nobel Prize in physics but in\n1890\nhis first priority was to work on an\nhabilitation\nthesis\n[\n3\n]\n:-\nWien wrote to\nHeinrich Hertz\nin\n1890\nto ask his opinion of research he had undertaken into the question of the localisation of energy. He told\nHertz\nthat, like Poynting and Lodge, he wanted to endow energy with properties analogous to those of matter. His guiding idea was that the individual parts of energy have a traceable motion; his teacher\nHelmholtz\ndid not like the idea, and Wien now tried it out on\nHertz\n.\nHeinrich Hertz\nwas, like\nHelmholtz\n, not particularly enthusiastic about Wien's ideas but his work on the localisation of energy led to his habilitation in Berlin in\n1892\n. However, returning to\n1890\n, Wien reported on the current state of the theory of energy to the physics section of the German Association. Details of his report are given in\n[\n3\n]\n.\nWien's\n1890\nreport is at\nTHIS LINK\n.\nIn his habilitation dissertation of\n1892\n[\n1\n]\n:-\nWien linked, very generally, J H Poynting's 'energy flux' of electric currents with the concept of the entropy of radiation. Further, by analogy with the continuous change of position of matter in motion, he also established the motion of the energy of electrodynamic radiation, pursuing the question raised by\nHertz\nof whether this energy can be localised at all during movement.\nThe localisation of energy was not the only topic that Wien worked on in his first years at the Physikalisch-Technische Reichsanstalt. He conducted an unsuccessful series of experiments, using platinum foil, trying to establish a new unit of light\n[\n1\n]\n:-\nIn this dual concern with theory and experiment lay the seed of Wien's development into the rare physicist who possesses equally good knowledge of both areas.\nIn\n1893\nWien stated his displacement law of blackbody radiation spectra at different temperatures. His method is described in\n[\n2\n]\n:-\nIt was\n[\nWien's\n]\nidea to use as a good approximation for the ideal blackbody an oven with a small hole. Any radiation that enters the small hole is scattered and reflected from the inner walls of the oven so often that nearly all incoming radiation is absorbed and the chance of some of it finding its way out of the hole again can be made exceedingly small. The radiation coming out of this hole is then very close to the equilibrium blackbody electromagnetic radiation corresponding to the oven temperature.\nNext Wien derived a distribution law of radiation which he published in June\n1896\n.\nMax Planck\n, who was a colleague of Wien's when he was carrying out this work, later, in\n1900\n, based\nquantum theory\non the fact that Wien's law, while valid at high frequencies, broke down completely at low frequencies.\nPlanck\nsuggested a more complicated version of Wien's law in\n1900\n. Wien received the\n1911\nNobel Prize for his work on heat radiation. In his Nobel lecture he explained his 'thought experiment' approach which has proved so fruitful in physics research\n[\n12\n]\n:-\nUsing known physical laws it was possible to derive a general law of radiation theory which has, under the name of the displacement law, been acclaimed by fellow workers. In applying thermodynamics to the theory of radiation, we make use of the ideal processes which have been found so fruitful elsewhere. These are mental experiments whose realization is frequently impracticable and which nevertheless lead to reliable results. Such deliberations can only be undertaken if all the processes on which, governed by laws, the mental experiments are based, are known, so that the effect of any change can be stated accurately and completely. Further, to be allowed to idealize, we must neglect all non-essential secondary phenomena, while considering only everything indissolubly connected with the processes under examination. In the application of mechanical heat theory, this method has proved to be extremely fruitful.\nIn\n1892\nWien had been promoted to a lecturer in Berlin and he was happy working at the Physikalisch-Technische Reichsanstalt but in\n1894\nHelmholtz\ndied and Friedrich Kohlrausch was appointed to succeed him. Kohlrausch had very definite ideas about how he should run the Physikalisch-Technische Reichsanstalt, drawing up very specific and rigid research plans. This certainly did not fit in with Wien's approach determined by his extremely independent nature. When, therefore, he received an offer in\n1896\nof a professorship at the Rhenish-Westphalian Technical University of Aachen\n(\nRWTH Aachen\n)\nhe was delighted to accept the position. In Aachen, Wien met Luise Mehler; they married in\n1898\nand had two sons, Waltraut and Karl, and two daughters, Gerda and Hildegard. Wien had been appointed to fill the chair previously held by Philipp Eduard Anton Lenard who had left Aachen to take up the chair at Heidelberg. Lenard had been undertaking research on cathode rays in Aachen and the equipment he had been using proved extremely useful to Wien who had begun to undertake research into cathode rays while in Berlin. In fact Lenard was awarded the\n1905\nNobel Prize for Physics for his research on cathode rays and his discovery of many of their properties.\nWhile studying streams of ionized gas in\n1898\n, Wien identified a positive particle equal in mass to the hydrogen atom. Wien invented the first mass-spectrograph and, with this work, laid the foundation of mass spectroscopy. However, there were difficulties in reconciling the results from Wien's mass-spectrograph with the theories of atoms and electrons. J J Thomson refined Wien's apparatus and conducted further experiments in\n1913\nthen, after work by E Rutherford in\n1919\n, Wien's particle was accepted and named the proton. His studies on the diffraction of x-rays by crystals was the earliest work in this area, coming five years before the discoveries made by Max von Laue.\nAfter three years in Aachen, Wien moved to the University of Giessen in\n1899\nwhere he was appointed as a full professor. However, he spent only six months in Giessen before accepting a full professorship at the University of Würzburg where he spent the next twenty years. The chair had become vacant due to Wilhelm Conrad Röntgen moving to a chair at Munich. Wien was now an internationally acclaimed physicist and received many invitations to lecture throughout the world. Among the countries he visited were Norway, Spain, Italy and England in\n1904\n, Greece in\n1912\nand the Baltic region in\n1918\nwhere he gave several lectures. In spring\n1913\nhe visited the United States, lecturing at Columbia University and also visiting Harvard and Yale. He took the opportunity to visit Arthur Day, also a physicist and Friedrich Kohlrausch's son-in-law, in Washington. At Würzburg, Wien allowed himself the time to indulge in other interests besides physics. He spent time studying history, foreign literature and fine arts, subjects that he had loved from the time that his mother had enthused him.\nIn\n[\n8\n]\na letter from\nEinstein\nto Wien is described in which he asks Wien to conduct an experimental proof of the principle of equivalence which\nEinstein\nhad proposed from purely theoretical considerations in\n1907\n:-\nIn\n1912\n[\nEinstein\n]\nturned by letter to W Wien with the request to measure the difference between the periods of oscillation of pendulums made of uranium and lead, as well as the proportionality of inertial and gravitational masses of a uranium and a lead weight, respectively, namely with a torsion balance. The letter testifies that\nEinstein\nwas not aware of the\nEötvös\nexperiment when he formulated the principle of equivalence ...\nIn\n1914\nWien published\nZiele und Methoden der theoetische Physik\nⓉ\n(\nAims and methods of theoretical physics\n)\n. In this work he gave his views on the difference between mathematical physics and theoretical physics. Mathematical physics, he wrote\n[\n1\n]\n:-\n... should furnish the mathematical tools - just as mathematics establishes exact relationships between numerical quantities. ...\n[\nTheoretical physics\n]\nshould seek to determine quantitative laws, for which it must develop hypotheses; it can, however, attain only approximate exactness.\nHe also claimed in this work that the laws of nature are simpler than scientists realise for they only can see the infinite variety of the effects of the laws\n[\n1\n]\n:-\nOnly quantitative verification through comparison with observed data can protect the theoretician - who generally does not feel bound by experiments - from the many unsuitable ideas he generates. This quantitatively controlled interaction between theory and experiment excludes possible carelessness in the use of mathematical expressions.\nWorld War I greatly affected Wien, but the events which followed the end of the war disturbed him even more. The blockade of Germany was not lifted, food and fuel were in very short supply, soldiers returning from the front were left hungry, without jobs, and bitter about their situation. The Bolsheviks in the Communist Party of Germany, encouraged by Soviet Russia, took advantage of the discontent and pushed for a revolution. They encouraged demonstrations in December\n1918\nthat led to an attempted revolution in Berlin in January\n1919\n. It failed, but the struggle against the Bolsheviks provided a situation which left Wien deeply unhappy. During the\n1920\ns there were different problems which resulted in Wien's continuing sadness about his native land. In a letter to\nSchrödinger\nwritten on\n1\nMay\n1927\nhe feared:-\n... the encroaching Americanisation of all of life that is now taking place in Europe.\nAfter\n20\nyears in Würzburg, Wien accepted an offer of a chair from the University of Munich in\n1920\n. There he had a new physics institute built and played a major role in the university, being appointed rector in\n1925\n-\n26\n.\nBetween\n1905\nand\n1918\nWien and\nPlanck\nedited the\nAnnalen der Physik\n. They had to adopt a policy towards the new discoveries of relativity which were changing the face of physics so they sought to publish papers that illuminated the physical meaning or concepts of relativity; they left manuscripts that stressed mathematical interpretations to their mathematician colleagues in Göttingen. Wien continued as an editor of\nAnnalen der Physik\nuntil his death. He was also a joint editor, with F Harms, of the\nHandbuch der Experimental Physik\n.\nWien was honoured with election to the\nBerlin Academy of Science\n, the\nGöttingen Academy of Sciences\n, the\nAustrian Academy of Sciences\n, the\nSwedish Academy of Sciences\n, the\nNorwegian Academy of Science and Letters\n, and the\nNational Academy of Sciences\nin Washington, and he was also made an honorary member of the Physical Society of Frankfurt-on-Main\nMax Planck\n, who was a colleague of Wien's, wrote:-\nThere are probably only very few physicists who are equally expert in both the experimental and theoretical sides of their own particular field as Willy Wien, and in the future it will become more and more rare for one scientist to make discoveries of such a varied nature as that of the law for the displacement of thermal radiation and the one on the nature of canal rays.\nCanal rays were produced by cathode ray tubes and, as we explained above, were shown by Wien to consist of positively charged particles with the same mass as hydrogen atoms. Today these particles are called protons.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}