{
  "nome_completo": "Wilhelm Winkler",
  "nome_curto": "Wilhelm Winkler",
  "ano_nascimento": "1884",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Winkler/",
  "lugar_nascimento": "Prague, Bohemia, Austro-Hungarian Empire (now Czech Republic)",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Wilhelm Winkler\n's father, Julius Winkler, was a music teacher in Prague and his mother was Anne Winkler. He came from a large German speaking family of eight children, Wilhelm being the fourth child. The size of the family naturally stretched Julius and Anne's finances so Wilhelm had to work to augment the income from the time he was\n13\nyears old. He attended the Kleinseitner\nGymnasium\nand then entered the German language Karl Friedrich University in Prague to study law. It was a time of financial hardship and difficulty for Winkler.\nAfter graduating, Winkler practised law for a short time before volunteering to serve for a year in the Austrian army. After a year in the army he returned to civilian life obtaining a post in the Bohemian State Statistical Bureau in\n1909\n. He now began to study statistics and mathematics seriously, attending statistics seminars at the university and advanced mathematics courses at the Technische Hochschule of Prague. This was a period in which\n[\n3\n]\n:-\n... his interest in application of methods of mathematical statistics in social and economic matters continued to grow.\nHowever Winkler was not happy with the status of statistics in central Europe. He wrote in his memoirs\n(\nsee for example\n[\n5\n]\n)\n:-\nI soon found out that the German statistical literature did not offer too many ideas. New life came into statistics from England and Russia.\nWith the outbreak of World War I in\n1914\n, Winkler enlisted in the Austrian army. He was awarded two medals for bravery before being wounded in November\n1915\n. He was taken to a hospital in Prague where he took six months to regain his health. During this time he met one of his former teachers who was in the Ministry of War in Vienna. He invited Winkler to join the scientific committee which the Ministry had set up on war economy and, in June\n1916\nWinkler began work with the committee in Vienna.\nWhen the war ended in\n1918\nWinkler became Secretary of State for Military Affairs, but his progressive ideas meant that this was an unpopular appointment as far as certain traditionally minded colleagues were concerned. In this role Winkler attended the Versailles Peace Conference in\n1919\nas a member of the Austrian delegation. From\n1921\nWinkler began what is effectively two careers. He had been appointed to the Austrian Central Statistics Office in\n1920\nand from\n1921\nhe also taught at the University of Vienna at a\nPrivatdozent\n. Winkler also was by now a married man, having married Clara Deutch in\n1918\n.\nBoth Winkler's careers progressed in parallel. He was promoted to Head of the Division of Population Statistics in\n1925\nand at the university he became an extraordinary professor in\n1929\n. As the authors of\n[\n3\n]\nwrite:-\nWinkler's career is a remarkable conjunction of activity in two main spheres - the practical needs of government and the intellectual austerity of scientific research.\nWinkler's work in statistics achieved international recognition for him at this time. However things were to change rather dramatically. The Munich Agreement of\n1938\nsaw large parts of the Czechoslovak republic surrendered to Germany. German troops along with Hitler himself entered Austria on\n12\nMarch\n1938\n, and a Nazi government had been set up there. Political pressure was put on Winkler' who was forced to resign from both his government post and his university professorship.\nThere followed an extremely difficult period for Winkler through the years of World War II. Despite the hardship he and his family suffered, Winkler worked on a book\nBasic Course in Demography\nwhich was eventually published in\n1956\n. It was only after the war ended in\n1945\nthat Winkler was reinstated to his university post when he was appointed to a chair in the University of Vienna. He retired from his chair in\n1949\nbut continued to serve in various capacities such as Dean of the Faculty of Law until\n1955\n.\nSchmetterer writes in\n[\n5\n]\n:-\nWinkler published\n20\nbooks and about\n200\npapers covering a wide field of theoretical and applied statistics. He was widely recognised as a statistician of high reputation and received many Austrian and foreign distinctions and honours.\nAmong these honours was election to the International Statistical Institute in\n1927\n, being made an honorary member in\n1965\n, and also serving as President of the Institute. He was also elected to the\nAustrian Academy of Sciences\n(1952)\nand the\nRoyal Statistical Society\n(1961)\n. The universities of Munich and Vienna awarded him honorary degrees.",
  "math_areas": [
    "Statistics"
  ]
}