{
  "nome_completo": "Wilhelm Paul Albert Klingenberg",
  "nome_curto": "Wilhelm Klingenberg",
  "ano_nascimento": "1924",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Klingenberg/",
  "lugar_nascimento": "Rostock, Mecklenburg, Germany",
  "lugar_morte": "Röttgen, Bonn, Germany",
  "biografia": "Wilhelm Klingenberg\n's parents were Paul Klingenberg, a Protestant Minister, and Henny Dunker. Wilhelm was the oldest of his parents' six children. The family moved to Berlin in\n1934\n, partly because there were better schools in Berlin and partly because Paul Klingenberg had joined the Bekennende Kirche, an organisation set up to oppose the Nazi Party's efforts to Nazify the Protestant Church. Wilhelm attended schools in Berlin where he learnt Latin, Greek and French but he had to study mathematics on his own. He entered the Joachimsthalsces\nGymnasium\nin\n1937\nand received his school diploma in\n1941\n. He applied to enter the University of Berlin but this was not permitted and he had to serve in the army. He writes in\n[\n1\n]\n:-\nWhen the end of the war finally gave me my freedom, I changed my handwriting and started looking for a place to study. The devastated and Soviet occupied city of Berlin was out of the question, Göttingen and Hamburg were filled up, so I went to Kiel University.\nKlingenberg obtained a doctorate in\n1950\nwith a thesis on affine\ndifferential geometry\n. from\n1950\nto\n1952\nhe was a research assistant at Kiel where F Bachmann interested him in the foundations of geometry. At this time he solved a problem on equivalences of configurations in an affine plane which\nRuth Moufang\nhad worked on.\nBlaschke\nadvised him regarding trips to Italy and he spent time in\n1952\n/\n53\nat the University of Rome where he was strongly influenced by\nF Severi\n,\nE Bompiani\nand\nBeniamino Segre\n.\nAfter returning to Germany he completed his\nhabilitation\nthesis at Hamburg and then obtained a permanent position at Göttingen working with\nReidemeister\n. He wrote in\n[\n1\n]\n:-\nI have fond memories of our years there -\nReidemeister\nhad a brilliant mind and a wide range of interests, his wife Elisabeth was a renowned photographer.\nKlingenberg spent\n1954\n/\n55\nat Bloomington in the United States visiting Morse at Princeton during his time at Bloomington. His interests had turned away from affine and projective differential geometry and turned towards Riemannian geometry. Although he remained on the staff at Göttingen until\n1963\n, Klingenberg spent\n1956\n/\n57\nand\n1957\n/\n58\nat the Institute for Advanced Study at Princeton. He also spent\n1962\nat the University of California at Berkeley at the invitation of\nS S Chern\n. Klingenberg wrote in\n[\n1\n]\n:-\nI had met him in Hamburg in\n1953\nwhen he visited his former teacher\nBlaschke\n, and since that time he had actively helped my career whenever he had a chance to do so.\nWhile at Berkeley, Klingenberg received offers of chairs at Würzburg and Mainz - he chose Mainz. Three years later, in\n1966\n, he was offered chairs at Zürich and at Bonn. He chose, not without some difficulty, to accept the offer from Bonn. However Bonn grew rapidly with additional staff and students:-\n... and some of the intimate charm of a close-knit group thereby went down the drain. Not without some pain and struggle, I finally accepted the change and concentrated my activities on my own differential geometry group.\nKlingenberg worked during his years at Bonn on closed geodesics. He retired in\n1989\n. His major books include\nA course in differential geometry\n(1978)\n,\nLectures on closed geodesics\n(1978)\nand\nRiemannian geometry\n(1982)\n. Of this last work Klingenberg comments:-\nIt was the first book on this subject since the monograph of\nL P Eisenhart\nin\n1926\n.\nIn\n1953\nKlingenberg married Christine Kob, they have two sons and a daughter.\nAmong the honours he has received, we mention his election to the Academy of Sciences and Literature in Mainz, and the award of an honorary doctorate by the University of Leipzig. He gives his hobbies as: piano, horse-back riding, Chinese art and the art of\nAlbrecht Dürer\n. His interest in Chinese art led to him making trips to China and Tibet. This in turn led to his publication of the book\nTibet - Erfahrungen auf dem Dach der Welt\nⓉ\n(\nTibet - experiences on the roof of the world\n)\npublished first in\n1997\nand in a paperback version in\n2001\n:-\nWilhelm Klingenberg knows Tibet like no other. Every year he travels to this mysterious country, visits famous monasteries and holy mountains, inaccessible meditation caves and lakes. He goes by the old pilgrim routes and knows the life of the yak herders. With each trip he became more and more under the spell of this unique civilization where the great edifice of Lamaism was built. ...\n[\nThe book provides\n]\nan unusual blend of practical information and personal travel log ...",
  "math_areas": [
    "Geometry"
  ]
}