{
  "nome_completo": "Wilhelm Otto Ludwig Specht",
  "nome_curto": "Wilhelm Specht",
  "ano_nascimento": "1907",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Specht/",
  "lugar_nascimento": "Rastatt, Baden, Germany",
  "lugar_morte": "Herrsching, Bavaria, Germany",
  "biografia": "Wilhelm Specht\n's parents were Benno Mafia Specht and Anna Naegele. Benno Specht, who was an engineering graduate, and his wife Anna both were born in Berlin into families with long traditions. Wilhelm was the eldest of his parents' three children. The family lived in Rastatt until Wilhelm was nine years old when his father Benno Specht got a job as director of a factory making trucks in Berlin so the family moved to that city. It was in Berlin that Wilhelm attended school. In Berlin he spent a happy childhood, free from financial worries despite the difficult times that Germany went through during World War I followed by years of economic hardship caused by hyperinflation. He was an excellent swimmer, whose achievements were reported in the press, he rowed, loved literature and loved music. He was an exceptionally talented pianist and loved to play Bach on the piano. He found mathematics really easy and he was able to tutor students studying in more advanced classes. He completed his school studies at the Fichte\nGymnasium\nin Berlin in\n1925\n.\nSpecht loved both music and mathematics, and he had a real talent for both. After he graduated from the Fichte Gymnasium he was still undecided which of these he should make his career. He briefly thought that music was right for him but, before the start of the\n1925\n-\n26\nacademic year, he had changed his mind and he matriculated at the University of Munich in autumn\n1925\nbeginning his studies of mathematics, physics and philosophy. One of the reasons that he started his university career in Munich was that his grandparents lived there and Specht was able to board with them. He was a confident young man who, even at this stage, was certain that he would make his career as a university professor. Not only did he believe in his own abilities but he also knew that, despite the desperate financial times Germany had gone through, his family would be able to support him financially. He spent the two years\n1925\n-\n27\n, consisting of four semesters, in Munich where he attended lectures by, among others,\nConstantin Carathéodory\n,\nOskar Perron\nand\nArnold Sommerfeld\n.\nAs was typical of German students at this time, Specht did not spend his whole university career at a single university. In\n1927\nhe returned to Berlin where he continued his studies at the Friedrich-Wilhelm University. At this time Berlin had many world-leading mathematicians and physicists on the staff and Specht benefited greatly from these impressive professors. He took physics courses given by\nAlbert Einstein\n, by Max von Laue, and by\nErwin Schrödinger\nand a chemistry course from Walter Nernst. Specht's main love, however, was mathematics where he was taught by\nErhard Schmidt\nand\nlssai Schur\n. He asked whether\nSchur\nwould be his thesis advisor and\nSchur\nwas pleased to agree. Specht then began to mix with the group of mathematicians at Berlin including\nAlfred Brauer\n,\nRichard Brauer\n,\nKurt Hirsch\n,\nBernhard Neumann\n,\nRobert Remak\n,\nHans Rohrbach\n,\nHanna von Caemmerer\n, and\nJohn von Neumann\n. Specht's closest friend was\nBernhard Neumann\n, with whom he often played a board game invented by the chess champion\nEduard Lasker\n. They discussed mathematics for hours, often continuing at night when they would telephone each other with ideas.\nSpecht submitted his doctoral thesis\nEine Verallgemeinerung der symmetrischen Gruppe\nⓉ\n(\nA generalization of the symmetric group\n)\nto the University of Berlin in April\n1931\n. The thesis was examined by\nSchur\n, with\nErhard Schmidt\nappointed as the second examiner, on\n9\nMay\n1932\nand was he awarded his doctorate. He published a paper based on his thesis\nEine Verallgemeinerung der Permutationsgruppen\nⓉ\n(\nA generalization of permutation groups\n)\nin\n1933\n. Before this, in November\n1931\n, he had been appointed as a research assistant in mathematics at the university. Also at this time he was an editorial assistant to\nGeorg Feigl\nwho had been managing editor of the reviewing journal\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nsince\n1925\n. He continued to undertake these tasks until March\n1934\nwhile he sought a permanent university position. With a strong reference for\nSchur\n, in April\n1934\nSpecht was appointed as an assistant to\nGabor Szegő\nin the Mathematics and Physics Department of the University of Königsberg. This, of course, was a very difficult time in many mathematics departments due to the Nazi government.\nOn\n30\nJanuary\n1933\nHitler had came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course removing those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired.\nKurt Reidemeister\nhad held a chair at Königsberg from\n1927\nbut he had been forced to resign in\n1933\nbecause he was considered \"politically unsound\" by the Nazis. In fact he was dismissed even before Jewish colleagues. Nazi students at Königsberg created a protest at the Rector in January\n1933\nbefore Hitler came to power.\nReidemeister\ndevoted a lecturer to explaining why the students' behaviour was unacceptable and for this he was dismissed. A successor had been appointed but the mathematics department in Königsberg was a place where tensions were running high before Specht was appointed. Certainly Specht did not improve the situation by making anti-Nazi comments. For example, when the picture of\nGauss\nhanging in the departmental library was replaced by a picture of Hitler, Specht said, \"Why do we need to? He's not a mathematician.\" When he went to Königsberg Specht had been intending to\nhabilitate\nthere but after\nGabor Szegő\n,\nRichard Brauer\nand\nWerner Rogosinski\nwere forced to leave, he realised that there was no way he could succeed in Königsberg. We note that\nGabor Szegő\n,\nRichard Brauer\nand\nWerner Rogosinski\n, as Jews, had been forced to resign from Königsberg. Although the university atmosphere in Königsberg was difficult, in another way his period there was important to him in a personal way since he met Ursula Dannenberg; they later married.\nWhen he had been at Berlin, Specht had assisted\nGeorg Feigl\nin his editorial duties.\nFeigl\nhad been extraordinary professor at Berlin when Specht left Berlin for Königsberg but\nFeigl\nhad been appointed to the Chair of Mathematics at the University of Breslau in\n1935\nwhere he was head of the Department. In Breslau,\nFeigl\nbecame a colleague of\nJohann Radon\nwho had held a chair there since\n1928\n.\nFeigl\nand\nRadon\nwere keen to have Specht join them in Breslau, and he took up a position there in March\n1936\n. One year later, in the spring of\n1937\n, Specht habilitated at Breslau. He had published a number of papers on the\nrepresentation theory\nof groups, such as\nDie irreduziblen Darstellungen der symmetrischen Gruppe\nⓉ\n(\nThe irreducible representations of the symmetric group\n)\n(1935)\n,\nDarstellungstheorie der Hyperoktaedergruppe\nⓉ\n(\nRepresentation theory of the hyper octahedral group\n)\n(1937)\n,\nZur Darstellungstheorie der symmetrischen Gruppe\nⓉ\n(\nto representation theory of the symmetric group\n)\n(1937)\n,\nDarstellungstheorie der affinen Gruppe\nⓉ\n(\nRepresentation theory of the affine group\n)\n(1938)\n, and\nDarstellungstheorie der alternierenden Gruppe\nⓉ\n(\nRepresentation theory of the alternating group\n)\n(1938)\n. It is in the first of these papers, published in\n1935\n, that the representation that today is known as a 'Specht module' appears. Over a field of characteristic\n0\n, the Specht modules provide a complete set of irreducible representations of symmetric groups.\nHis expertise on the representation theory of groups had been exactly what he needed to solve a problem posed by a physicist and its solution formed the basis for Specht's habilitation thesis. He had also published the papers\nEbene hyperbolische Geometrie\nⓉ\n(\nPlane hyperbolic geometry\n)\n(1935)\n,\nZur Theorie der Matrizen\nⓉ\n(\nOn the theory of matrices\n)\n(1936)\n, and\nZur Theorie der Gruppen linearer Substitutionen\nⓉ\n(\nOn the theory of groups of linear substitutions\n)\n(1937)\n. His first attempt to gain a position as\ndocent\nwas rejected by the Nazi Ministry of Education which considered Specht's political position unsatisfactory. However, he was successful at his second attempt and, in September\n1938\n, he became a docent at the University of Breslau. This allowed him to marry Ursula Dannenberg and the marriage took place in September\n1938\n.\nThe mathematics department at Breslau, headed by\nFeigl\nand\nRadon\n, had a pleasant atmosphere unlike that at Königsberg. There were also a number of more junior colleagues who worked with Specht at Breslau over the following years including Hans-Joachim Kanold, Georg Tautz\n(1901\n-\n1983)\nand Hans-Heinrich Ostmann\n(1913\n-\n1959)\n. The whole department enjoyed a good social life in addition to profitable mathematical collaborations. We note that Tautz and Ostmann had both been students at Breslau having\nRadon\nas their thesis advisor and awarded their doctorates in\n1930\nand\n1938\nrespectively. Kanold had also been a student at Breslau with both\nFeigl\nand\nRadon\nas advisors and was awarded his doctorate in\n1941\n. Specht would meet with his colleague Tautz at\nRadon\n's home for a musical evening where Specht played the piano,\nRadon\nplayed the violin and Tautz sang tenor.\nFeigl\nappreciated Specht both as a mathematical collaborator and as a table tennis partner. In fact Specht got to the stage of disliking the telephone since it would ring so frequently with\nFeigl\nlooking for Specht's assistance. Later in life, he had no telephone in his home.\nSpecht was much appreciated by both his students and by his younger colleagues. He was always happy to talk to students and to help them with any difficulties that they were encountering. Younger colleagues appreciated him as an imaginative mathematician who showed them open problems and encouraged them to carry out their own research. Specht's home became a popular meeting place where students or colleagues came to discuss mathematics, to chat or just to warm up a little when their own supply of fuel had run out. He continued to publish significant papers such as\nZur Theorie der Gruppen linearer Substitutionen\nII\nⓉ\n(\nOn the theory of groups of linear substitutions II\n)\n(1940)\n,\nWurzelabschätzungen bei algebraischen Gleichungen\nⓉ\n(\nRoot assessments of algebraic equations\n)\n(1940)\n,\nZur Theorie der Matrizen\nII\nⓉ\n(\nOn the theory of matrices II\n)\n(1940)\n,\nKlassifikation der halblinearen Transformationen\nⓉ\n(\nClassification of semi-linear transformations\n)\n(1940)\n, and\nDarstellungstheorie der endlichen Gruppen\nⓉ\n(\nRepresentation theory of finite groups\n)\n(1940)\n.\nThis happy and productive time at Breslau came to an abrupt end in August\n1940\nwhen Specht was called up for military service. After a year's service in the Air Force, he did war work as a meteorologist in the Weather Service. Here he applied mathematics to weather problems and, for the rest of his teaching career, he would use examples from this experience. The war, however, saw tragedy for Specht. His younger brother, who was training to become a teacher of sport and biology, was killed in\n1944\n. Specht's wife, who had served as a Red Cross nurse, was taken prisoner by the Russians and suffered unspeakable hardships before she was eventually able to return to her husband in\n1954\n. When the war ended in\n1945\n, the university in Breslau had been destroyed, his home had been destroyed, all his books were lost and his friends were scattered in different parts of the world. All Specht had left was a small suitcase with scientific papers, which he always carried with him throughout the war. Taken prisoner by the Americans, he was held in captivity in Bad Kreuznach until June\n1945\nwhen he was released and able to go to Herrsching, where his parents owned a small holiday home.\nFor two years Specht worked at an American airfield. Although he had no academic position, this job gave him ample free time to pursue his own research and, although he was not able to publish anything, he did collect together material which he was able to publish in the\n1950\ns.\nOtto Haupt\nwas head of mathematics at Erlangen and he was looking to built up his department. He spoke to\nvan der Waerden\nasking if he knew of promising people to appoint and, without hesitation,\nvan der Waerden\nstrongly recommended Specht.\nHaupt\nand Specht agreed to meet following a meeting of the Bavarian Academy of Sciences in Munich and\nHaupt\nwas so impressed that he immediately asked him to join the department of mathematics at Erlangen. Specht was appointed as an assistant at Erlangen in December\n1947\nand, after another habilitation, became a docent there in the summer of\n1948\n. He was, at the same time, given a temporary appointment as head of the newly established Department of Applied Mathematics. In March\n1950\nthis temporary appointment was made permanent and he became an ordinary professor.\nSpecht was very successful in his two roles at Erlangen. For many years he was the only algebraist and the only applied mathematician. Of course his training had been very much as an algebraist but his wartime experiences had given him a practical basis in applied mathematics to add to the theoretical work from his undergraduate years. Also it is clear that Specht was always very willing and able to teach himself any topics that he needed to extend his knowledge. The research he had carried out before the war on matrices also gave him a basis for new ideas in applied mathematics. In particular he lectured on numerical methods and was keen to be at the forefront of using electronic computers.\nAt Erlangen, Specht supervised the doctoral studies of\n19\nstudents and you can see their names and thesis titles at\nTHIS LINK\n.\nIn the\n1950\ns, he published three books:\nGruppentheorie\nⓉ\n(\nGroup theory\n)\n(1956)\n;\nElementare Beweise der Primzahlsätze\nⓉ\n(\nElementary proofs of the prime number theorem\n)\n(1956)\n; and\nAlgebraische Gleichungen mit reellen oder komplexen Koeffizienten\nⓉ\n(\nAlgebraic equations with real or complex coefficients\n)\n(1958)\n. For extracts from reviews of the first and third of these see\nTHIS LINK\n.\nWe have indicated above that Specht had two positions at Erlangen, one in algebra and the other in applied mathematics. This, together with staff shortages, led to him having an extremely high workload. In some semesters the courses he offered meant that he was teaching\n22\nhours per week. However, he took on duties in addition to his research, teaching and administration within mathematics. For example, he was Dean, vice-Dean and for five years Financial Officer of the faculty. He also played a large role in the design of the new building of the Mathematical Institute and he also pressed for the construction of the Computer Centre of the University of Erlangen.\nThe authors of\n[\n3\n]\nwrite:-\nWith an elegant ease he managed his extensive responsibilities, often mastering critical situations with his excellent Berliner humour. Always cheerful, he came to the institute not too early in the morning. Everything about him was elegant: his clothes, his writing, his reasoning, his car\n(\nalways a little common Coupé\n)\n. He remained, however, basically a humble person. Having to show superiority was for him downright embarrassing. Staff and students he met with paternal goodness, making necessary criticism at best with a fine humorous remark. Even students with excellent performances could learn from him much kindness and human warmth. ... His home was an oasis of tranquillity where he lived without a telephone, lovingly cared for by Mrs Specht. It was here that he undertook research. He worked as a hobby and never saw it as a workload, although he regularly sat at his desk until late into the night or even into the early hours of the  morning.\nSpecht was an editor of\nZentralblatt für Mathematik\nfrom\n1962\n. He retired from his positions at Erlangen in the summer semester of\n1972\n. He did not come to the Mathematics Institute after he retired and he spent most of his retirement back in his home town of Berlin. Here he did further work on his manuscripts, but apparently he had no intention of publishing anything further. In fact, because of his heavy teaching and administrative commitments, he published nothing after\n1963\n. However in\n1987\n, two years after Specht's death, Hermann Heineken completed and submitted for publication their joint paper\nGruppen mit endlicher Komponentenzahl fastgleicher Untergruppen\nⓉ\n(\nGroups with a finite number of components almost equal subgroups\n)\n. This paper looks at pairs of subgroups that are commensurable, that is the intersection of the two subgroups has intersection has finite index in both of them.\nIn\n1977\nSpecht began to suffer neuralgia which increasingly restricted both his physical and mental capabilities. His physical problems eventually led to a fall in February\n1985\nfrom which he died. He was buried in Herrsching, surrounded by his relatives and closest friends. A Colloquium was held in the Mathematical Institute of the University of Erlangen-Nuremberg on\n4\nJune\n1985\nin his memory.\nSpecht published\n50\npapers, mostly on group theory or polynomials. However, he did publish two papers on radiation which were the result of questions he was asked during the two years following the war when he did not have a university position. These papers were\n(\nwith H A Bomke\n)\nDer Einfluss von endlicher Präparat- und Ionisationskammergrösse auf die Dosismessung in unmittelbarer Nähe von Radiumpräparaten\nⓉ\n(\nThe influence of finite specimen features and gamma ray ionisation of the dose measurement in the immediate vicinity of radium\n)\n(1950)\nand\nEine mathematische Frage zur Strahlentherapie\nⓉ\n(\nA mathematical question to radiotherapy\n)\n(1953)\n. However, it was a consequence of his nature that he did not publish more. Following his death a variety of manuscripts were found among his papers of different degrees of completeness. He demanded perfection of his papers so often he would continue to revise them, perfecting the language, the terminology and the symbolism, for many years, even decades, before he submitted them for publication. Taking this approach, particularly when he was working on ideas in many different areas of algebra, number theory and analysis of polynomials, naturally meant that many of his ideas were never published. Papers found after his death show that, as well as topics already mentioned, he worked on non-euclidean geometry, optimal airplane landing strategies, theory of planning, biological balance and many others.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Number Theory"
  ]
}