{
  "nome_completo": "William Prager",
  "nome_curto": "William Prager",
  "ano_nascimento": "1903",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Prager/",
  "lugar_nascimento": "Karlsruhe, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "William Prager\n's parents were Helen Kimmel and Willy Prager. He studied at the Technical University of Darmstadt and was awarded his Dipl. Ing. degree in\n1925\n. In the same year he married Ann Heyer, and he remained at Darmstadt where he undertook research, being awarded his doctorate in engineering in\n1926\n. During the next three years he remained in Darmstadt where he had been appointed as an instructor. Then in\n1929\n, when he was only\n26\nyears old, Prager was appointed to act as Director of the Institute of Applied Mathematics at Göttingen.\nIn\n1932\nPrager was appointed as Professor of Technical Mechanics at Karlsruhe. As indication of just how rapid his success had been, we note that his appointment in Karlsruhe made him the youngest professor in Germany. It was certainly due to the leading international reputation he had already achieved, with over thirty papers and a book already showing the depth of his contributions to applied mathematics. However, life in Germany was about to change for on\n30\nJanuary\n1933\nHitler came to power. The Nazi regime forced Prager out of the professorship and in\n1934\nhe left Germany to go to Turkey where he was appointed as Professor of Theoretical Mechanics at the University of Istanbul. But Prager did not accept his treatment by the Nazis without protest. He fought his dismissal through the German courts and, perhaps surprisingly, won his case. He accepted the back pay which the court awarded him to cover what his salary would have been if he had remained in post. He was also given permission to return to his professorship in Germany but he declined.\nIn Turkey Prager continued to output research at the highest level, publishing articles in German, Turkish, French and English. He also wrote textbooks in Turkish for his students, one on descriptive geometry and another on elementary mechanics. The outbreak of war in\n1939\nwas distressing to Prager and the German advances by\n1940\nmade him decide that he would be best placed if he could emigrate to the United States. This, however, was not easy at this difficult time, even for a scientist with the high international reputation enjoyed by Prager. Brown University, in Providence Rhode Island, took the opportunity to expand its graduate programme by offering Prager the position of Director of Advanced Instruction and Research in Mechanics. Prager had to remain in Turkey until October\n1941\n, and then the journey from Istanbul to Providence, Rhode Island, took him and his family about six weeks. Travelling at this time was extremely difficult and they had to go by a very indirect route.\nPrager\n[\n2\n]\n:-\n... established the Division of Applied Mathematics at Brown in\n1946\n, served as its first Chairmen, and guided its research and teaching by gathering round him younger people in a wide variety of fields of applied mechanics, applied mathematics, physics and engineering. His own research during this period covered an enormous diversity of topics in the mechanics of continua of all types, problems of traffic flow, and applications of computers to problems in economics and engineering.\nJ L Synge\nwas visiting professor at Brown University in\n1941\nwhen Prager arrived there. They soon began collaborating and publishing papers in the\nQuarterly of Applied Mathematics\nwhich Prager founded in April\n1943\nand edited for over\n20\nyears. For example their method of the hypercircle appears in a joint paper in that journal in\n1947\n. In the Walker-Ames Lectures, Prager developed the hypercircle method applying it to statically indeterminate structures and to the equilibrium of elastic solids. The Lectures were published as\nThe extremum principles of the mathematical theory of elasticity and their use in stress analysis\nin\n1950\n. An important monograph, which Prager wrote jointly with P G Hodge, was\nTheory of perfectly plastic solids\n(1951)\n. The main topics covered in the text are: basic concepts of stress, strain, and stress-strain relations; trusses and beams; torsion of cylindrical or prismatic bars; plane strain including problems with axial symmetry, general theory, specific problems, contained plastic deformations, limit analysis; and finally, general extremum principles.\nIn November and December\n1954\nPrager gave a series of lectures at the Polytechnic Institute in Zürich. These were published in the following year as\nProbleme der Plastizitätstheorie\nⓉ\n(\nProblems in plasticity theory\n)\n.  E T Onat reviewing the book writes:-\nThe book constitutes a clear and penetrating exposition of the concepts and applications of the theory of plasticity. The author is one of the principal contributors in the field and his book provides the reader with indications of the impending developments of the theory.\nPrager further developed the material given in these lectures and presented it in an English version in\nAn introduction to plasticity\npublished in\n1959\n. A review of this book, this time by J Heyman, again gives Prager high praise:-\nThere are no spare lines and there is no padding; the author has considered every word, and thought deeply on every aspect of plastic theory. ... the author is completely master of this, his main field of study, and he communicates this sense of mastery to the reader.\nIn\n1961\nPrager published a German and an English version of the same work. The German version is titled\nEinführung in die Kontinuumsmechanik\nⓉ\n(\nIntroduction to continuum mechanics\n)\nwhile the English one is\nIntroduction to mechanics of continua\n. In this work Prager aimed to provide students with the common fundamentals of the various areas of hydrodynamics, elasticity, plasticity, etc., that constitute continuum mechanics. A great expert in the use of computers, Prager published\nIntroduction to basic FORTRAN programming and numerical methods\nin\n1965\n.\nHamming\ndescribes the work as follows:-\nThe basic aspects of FORTRAN are very well described, and many useful remarks are given to aid the student and point out common pitfalls of the beginner. The numerical methods aspect also shows the hand of a master and covers all the material that is usually given in a one term course, including ordinary differential equations, in a reasonably rigorous and at the same time practical manner. ... All in all it is a remarkable book and one wonders how the author managed to cover so much, so smoothly and unhurriedly as he has.\nPrager retired from Brown University in\n1973\nand moved to Savignon, Switzerland, where he continued to undertake research, write books, give lecture tours, and edit journals. In particular he gave six lectures at the International Centre for Mechanical Sciences in Udine in\n1974\nwhich he wrote up and published as\nIntroduction to structural optimization\n(1974)\n. His first three lectures considered the derivation of necessary and sufficient conditions for global optimality from extremum principles, while the final three lectures looked at the optimisation of the structural layout.\nHis outstanding contributions to applied mathematics led to Prager receiving many honours and awards. He was elected to the National Academy of Engineering, the\nNational Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, the\nPolish Academy of Sciences\n, the French\nAcadémie des Sciences\n. He received the Worcester Reed Warner medal and the Timoshenko medal from the American Society of Mechanical Engineers and the\nvon Kármán\nmedal from the American Society of Civil Engineers. Many universities awarded him honorary degrees including Liege, Poitiers, Milan, Waterloo, Stuttgart, Hannover, Brown, Manchester and Brussels.\nAs to his interests outside mathematics, Drucker writes\n[\n1\n]\n:-\nAmong his broad range of interests outside of his work was classical music, to which he listened early in the morning before each busy day of research, teaching, and service to society.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}