{
  "nome_completo": "William Proctor Milne",
  "nome_curto": "William Milne",
  "ano_nascimento": "1881",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Milne_William/",
  "lugar_nascimento": "Longside, Aberdeenshire, Scotland",
  "lugar_morte": "Glack, Aberdeenshire, Scotland",
  "biografia": "William Milne\n's father was  Andrew Milne\n(\nborn in Peterhead, Aberdeenshire about\n1838)\nwho was a farmer. His mother was  Jessie Proctor\n(\nborn in Tarbat, Rossshire about\n1848)\n. He had a younger brother John\n(\nborn about\n1883)\nand a younger sister Elizabeth\n(\nborn about\n1885)\n.\nWilliam Milne was educated at Peterhead Academy and Aberdeen Grammar School before going up to Aberdeen University. He took all the available prizes in mathematics and natural philosophy and a Ferguson Scholarship\n(\nthat year all five scholarships, open to students in all the ancient Scottish universities, went to Aberdeen\n)\nallowed him to continue his studies at Cambridge where he also too first-class honours.\nHe married Mary Deas Burnett in\n1910\n. She was born in Echt, Aberdeenshire about\n1883\n.\nHe taught mathematics at Clifton College from\n1907\nto\n1919\n, when he was appointed to the Chair of Mathematics at Leeds University. He held this appointment until\n1946\n. During his tenure of the chair he was appointed Pro Vice Chancellor. Aberdeen honoured him was an honorary Doctorate of Laws on\n4\nMay\n1946\nand Leeds University honoured him in the same way in\n1955\n.\nAlmost ten years after he retired, Milne published\nEppie Elrick\n, described at the time as a new doric classic. It is a full-scale historical romance in the dialect he sought to foster as an enthusiastic member of the Buchan Field Club. He was president of this Club in\n1947\nwhen the Club renewed its activities after a period of abeyance during World War II. The first field day of the revived Club took place in August\n1948\n.\nMilne's life is described in the extract from\n[\n1\n]\nwhich is given at\nTHIS LINK\nHere we mention a few of Milne's research papers such as the following which were published in the\nProceedings\nor the\nJournal\nof the\nLondon Mathematical Society\n:\nThe construction of co-apolar triads on a cubic curve\n(1916)\n;\nDeterminantal Systems of Co-Apolar Triads on a Cubic Curve\n(1920)\n;\nThe Significance of Apolar Triangles In Elliptic Function Theory\n(1920)\n;\nThe Harmonic and the Equianharmonic Envelopes of a Cubic Surface\n(1926)\n; and\n7\n-Tangent Quadrics of the Same System of the C\n7\n5\n^{5}_{7}\n7\n5\n​\n.\nHowever, Milne was also interested in mathematical education and published a series of papers and mathematical notes in the\nMathematical Gazette\n. These included:\nThe geometrical meaning of the triad of points\n(1910)\n;\nA property of the complete quadrangle\n(1911)\n;\nThe teaching of limits and convergence to scholarship candidates\n(1911)\n;\nThe teaching of limits and convergence to scholarship candidates\n(1912)\n;\nThe teaching of limits and convergence to scholarship candidates\n(1913)\n;\nAnother proof and generalisation of the theorem given in note\n339\n(1913)\n;\nThe teaching of modern analysis in secondary schools\n(1915)\n;\nThe graphical treatment of power series\n(1918)\n;\nThe uses and functions of a school mathematical library\n(1918)\n;\nMathematics and the pivotal industries\n(1919)\n;\nThe training of the mathematical teacher\n(1920)\n; and\nNoether's canonical curves\n(1920)\n.\nMilne joined the\nEdinburgh Mathematical Society\nin December\n1910\n. Even before he was formally through the procedure of membership, his papers were being read to the Society;\nTriangles Triply in Perspective\nby Charles McLeod and William P Milne, was communicated to the meeting on Friday\n10\nJune\n1910\nby\nA D Russell\n. At the meeting at which his membership was confirmed, on Friday\n9\nDecember\n1910\n, Milne read the paper\nA harmonic property of cubic curves\n. Further papers read by Milne to the Society include:\nThe Focal Circles of Circular Cubics\non\n10\nFebruary\n1911\n;\nThe system of cubic curves circumscribing two triangles and a polar to them\n(\ncommunicated by\nNeil McArthur\nto the meeting of\n10\nNovember\n1911)\n;\nAn easy geometrical representation of the Sextic Covariant of a Binary Quartic\n(\ncommunicated by\nNeil McArthur\nto the meeting of\n10\nNovember\n1911)\n;\nInvestigations on Circular Cubics and Bi-circular Quartics\non\n10\nMay\n1912\n;\nNonagons nonuply in perspective\n(\ncommunicated by\nN McArthur\non\n9\nMay\n1913)\n;\nEasy Proof of von Staudt's Theorem\n(\ncommunicated by\nP Comrie\non\n15\nJanuary\n1915)\n;\nThe apolar locus of two tetrads of points\n(\ncommunicated by\nP Ramsay\non\n12\nJanuary\n1917)\n; and\nThe co-apolars of a cubic curve\n(\ncommunicated by\nArchibald Milne\non\n9\nFebruary\n1917)\n.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic"
  ]
}