{
  "nome_completo": "William Richard Maximilian Hugo Threlfall",
  "nome_curto": "William Threlfall",
  "ano_nascimento": "1888",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Threlfall/",
  "lugar_nascimento": "Dresden, Germany",
  "lugar_morte": "Oberwolfach, Schwarzwald, Germany",
  "biografia": "William Threlfall\n's parents were Helene Elizabeth Clara Koch and William Threlfall\n(1863\n-\n1888)\n. William Senior was a son of Richard Threlfall of Hollowforth, near Preston in Lancashire, England. He was a botanist at the University of Cambridge and had married Helene Koch from Dresden. Sadly William, the subject of this biography, never knew his father who drowned in the Diala river in India in March\n1888\nwhile on a research expedition. Helene Threlfall returned to her home town of Dresden where her son was born and there she lived with her two unmarried brothers, Hugo and Max Koch. William was brought up in Dresden and he attended the Humanistischen Königlichen\nGymnasium\nin Dresden-Neustadt, graduating with his\nAbitur\nin\n1907\n.\nAfter graduating from the high school, Threlfall entered the University of Jena where his main interest was in chemistry but he also studied mathematics courses. He graduated with a degree in chemistry in\n1910\nand then went to the University of Göttingen to study mathematics in the year\n1911\n-\n12\n. However, with the outbreak of World War I in\n1914\n, Threlfall was interned because of his British citizenship. He was released and served in the German army in\n1915\n. After military service, from\n1916\nhe lived on his uncle's estate near Dresden. There he lived as a gentleman farmer but mainly occuppied himself in mathematical studies. During the academic year\n1921\n-\n22\nhe attended courses at the University of Leipzig and he was awarded his doctorate on\n3\nFebruary\n1926\nfor his thesis\nÜber regelmässige Flächenteilung\nⓉ\n(\nabout routine Area Division\n)\n. His thesis advisors at the University of Leipzig had been Friedrich Wilhelm Daniel Levi\n(1888\n-\n1966)\nand\nOtto Ludwig Hölder\n.\nIn\n1927\nThrelfall submitted his\nhabilitation\nthesis to the Technische Hochschule in Dresden and began lecturing there as a\nPrivatdocent\n, particularly on his research topic of topology. The first course he gave in\n1927\nwas attended by the young student\nHerbert Seifert\n. Not only did Threlfall turn\nSeifert\ninto an enthusiastic student of topology, but far more than that, they became firm friends and mathematical collaborators. We should note in passing the considerable age difference between the two with Threlfall being twenty years older than his friend and student. Threlfall's topology course, attended by\nSeifert\nas a student, became the basis of their famous book\nLehrbuch der Topologie\nⓉ\n(\nTextbook of Topology\n)\n(1934)\n. We give more details about this book below but, at this point, let us quote a sentence originally written by Threlfall for the Preface:-\nThis textbook arose from a course which one of us gave to the other at the Technische Hochschule in Dresden. But soon the student contributed new ideas to such an extent and changed the presentation so fundamentally that it would be more justifiable to omit on the title page the name of the original author than his.\nHowever,\nSeifert\nwas unhappy to receive this much credit so, after some discussion, the two friends settled on the following compromise which appears in the Preface of the published work:-\nThe first step towards writing this textbook was a course which one of us\n(\nThrelfall\n)\ntaught at the Technische Hochschule in Dresden. But only part of the course was included in the book. The main part of its contents originated later from daily discussions between the two authors.\nThrelfall was appointed as an assistant in the Institute of Engineering Mechanics of the Technical University of Dresden in\n1929\n. In January\n1930\nSeifert\nmoved into the spacious house in Nordstrasse where Threlfall was still living with his mother and two uncles. They began keeping a diary which is discussed in\n[\n3\n]\nand continued to do so until Threlfall's death, by which time they had filled twenty-two volumes. On\n6\nJune\n1933\n, he was appointed as an untenured extraordinary professor at the University of Halle-Wittenberg. He was promoted to a tenured extraordinary professor of analytical geometry, calculus of variations, analysis and function theory on\n1\nApril\n1936\n. From\n1\nJanuary\n1938\nhe was appointed as a full professor at the University of Frankfurt, also becoming Director of Mathematical Seminars there in October. His appointment to Frankfurt was to fill the chair left vacant when\nCarl Siegel\nresigned in\n1937\nand accepted a chair at Göttingen. Frankfurt had been severely affected by the anti-Jewish legislation brought in by the Nazis\n(\nthis was one of the reasons that\nSiegel\nleft\n)\nand when Threlfall arrived there were several leading mathematicians, such as\nPaul Epstein\n,\nErnst Hellinger\nand\nMax Dehn\n, who were still in Frankfurt but not allowed to teach.\nLet us now look at some of Threlfall's publications. He published the book\nGruppenbilder\nⓉ\n(\nGroup pictures\n)\nin\n1932\nwhich was reviewed by\nDonald Coxeter\nin\n[\n1\n]\n:-\nMost of these group-pictures consist of partitions of a multiply-connected surface into polygons. The operations of a group are represented as automorphisms of a suitably chosen surface; each polygon, or pair of polygons\n(\none \"white\" and one \"black\"\n)\n, is a fundamental region. The case considered most thoroughly is when the polygons are triangles, which combine in sets to form the faces of a \"regular polyhedron\". ... The treatment is clear and systematic.\nMuch of Threlfall's best-known work was done in collaboration with\nHerbert Seifert\n. The most famous is their classic topology book\nLehrbuch der Topologie\nⓉ\n(\nTextbook of Topology\n)\n(1934)\nwhich we have already mentioned above.\nHenry Whitehead\nreviewed the book in\n[\n4\n]\nand it is interesting to note that topology was such a new topic at the time that he felt it necessary to begin his review by explaining what the subject was:-\nIn our conception of space a simple-minded idea of continuity comes before everything else. Ideas of distance, angle, straightness and so on are much more elaborate. Topology is the mathematical expression of the former. If a map were drawn on a rubber membrane its topological character would not be affected however drastically the membrane were distorted. Two islands would still be recognisable as such, but not square or circular countries.\nWhen\nHenry Whitehead\nbegins to comment on the book itself he is full of praise\n[\n4\n]\n:-\nThis book opens with a chapter on the intuitive background of the subject. It is eminently successful in showing the extent to which topological problems pervade mathematics and how fascinating they are. There is no branch of mathematics which is more tantalizing to the imagination.\nHe ends his review as follows\n[\n4\n]\n:-\nIn all, the material is presented clearly enough and with sufficient imagination to provide a first-class introduction to the subject. Moreover, the scope of the book is such that research workers will find it a stimulus and to many of them it will be a source of new knowledge\nRoss Geoghegan, reviewing the English translation which was published in\n1980\n, writes:-\nThe great strength of this book is the geometric insight it has given to generations of readers.\nIn\n1938\nSeifert\nand Threlfall published the book\nVariationsrechnung im grossen\n(\nMorsesche Theorie\n)\nⓉ\n(\nThe calculus of variations in the large\n(\nMorse theory\n)\n)\n. Again this book was reviewed by\nHenry Whitehead\nwho writes\n[\n5\n]\n:-\nThis book is a first-class introduction to the topological part of\nMarston Morse\n's book, 'The Calculus of Variations in the Large' ... the book contains a self-contained account of critical values of a function, whose argument may be a curve in a given manifold, their type numbers and their relation to the topology of the space over which the function is defined. This theory is applied in detail to the study of a typical problem in the calculus of variations in the large. The exposition is brilliantly clear and the book is altogether pleasing.\nThere is a story we should recount about this book but, before doing so we should note that\nSeifert\nwas appointed to the University of Heidelberg in\n1935\n. Threlfall continued to collaborate with\nSeifert\nby correspondence and they spent holidays together working on mathematics. Both were unhappy about Nazi policies and they put a Latin epigraph by\nJohannes Kepler\ninto\nVariationsrechnung im grossen\nⓉ\n(\nThe calculus of variations in the large\n(\nMorse theory\n)\n)\nwhich, in translation, reads:-\nToday it is very hard to write mathematical books.\nThe book was accepted by\nWilhelm Blaschke\nfor the Hamburg monograph series but, since\nBlaschke\nwent along with the Nazi ideas, he objected to the\nKepler\nquote on the grounds that it looked like a political statement - of course this is exactly what it was meant to be. It is remarkable that Threlfall and\nSeifert\nrisked their positions by insisting that the epigram remain. They won their case and the epigram appeared in the book when published.\nBlaschke\nexpressed fury that the quote had not been deleted.\nDuring the war, both\nSeifert\nand Threlfall worked at the Institut für Gasdynamik in Braunschweig, a research centre attached to the German Air Force. While Threlfall undertook war work there, he was given leave of absence from Frankfurt where Wolfgang Franz took over his lecturing duties. Certainly Threlfall had his problems during these years. For example, on\n26\nNovember\n1942\nhe was ordered to the State Police Office in Braunschweig where he was accused of an offence under the \"Treachery Act\". On\n10\nFebruary\n1943\n, following an investigation, it was recorded by the Secret Police that no proof of \"subversive utterances of a criminal nature\" could be found.\nThrelfall and\nSeifert\nhad made efforts to obtain jobs at the same university from the time that they were separated in\n1935\n. Except for the time they spent at the Institut für Gasdynamik, they did not achieve this until\n1946\nwhen Threlfall, supported by\nSeifert\n, was appointed to a professorship at the University of Heidelberg on\n4\nMay. However, towards the end of the war a mathematics research centre had been established at Oberwolfach, in the Black Forest, under the directorship of\nWilhelm Süss\n. Mathematicians from military establishments were sent there, including Threlfall and\nSeifert\n. They remained there, suffering considerable hardship, until the war ended. Threlfall was at Mathematics Research Centre at Oberwolfach when he died and he was buried at Oberwolfach. However, in\n1980\nSeifert\nhad Threlfall's body exhumed and transferred to Heidelberg. Threlfall's body is now buried in the Bergfriedhof in Heidelberg next to the graves of\nSeifert\nand his wife.\nFinally, let us mention some of Threlfall's last publications. He published the paper\nStationäre Punkte auf geschlossenen Mannigfaltigkeiten\nⓉ\n(\nStationary points on closed manifolds\n)\nin\n1941\n, which is based on a lecture he gave on the theory of critical points on closed manifolds. In\n1942\nhe published\nLe calcul des variations global\nⓉ\n(\nGlobal calculus of variations\n)\nwhich describes in an elementary manner the ideas behind the theory of critical points of functions in the large. After a joint paper\nTopologie\n(1948)\nwritten with\nSeifert\n, he published the single-authored paper\nKnotengruppe und Homologieinvarianten\nⓉ\n(\nKnot groups and Homology invariants\n)\nin\n1949\n. After Threlfall's death, another joint paper with\nSeifert\nentitled\nOld and new results on knots\n(1950)\nwas published.\nRalph Fox\nwrites in a review:-\nA carefully reasoned development of the central part of knot theory\n(\nthe group of a knot, the Alexander polynomial, the homology groups and linking invariants of the cyclic coverings\n)\ntogether with explanation of new results by Graeub, Schubert,\nSeifert\nand Threlfall, this survey should furnish an excellent guide to the non-specialist.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}