{
  "nome_completo": "William Jones",
  "nome_curto": "William Jones",
  "ano_nascimento": "1675",
  "ano_morte": "1749",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jones/",
  "lugar_nascimento": "Llanfihangel Tre'r Beirdd, Anglesey, Wales",
  "lugar_morte": "London, England",
  "biografia": "William Jones\n' father was Siôn Siôr. An obvious question would be: why was his father not named 'Jones'? The answer is simple, he was named Jones since this is the English version of the Welsh Siôn. William's mother was Elizabeth Rowland who was from Llanddeusant in the island of Anglesey. William was born on a farm in Anglesey and the family moved to Llanbabo on Anglesey, then moved again after the death of William's father. The family were poor and William attended a charity school at Llanfechell about\n3\nkm from the north coast of Anglesey. There his mathematical talents were spotted by the local landowner who arranged for him to be given a job in London working in a merchant's counting-house.\nThis job saw Jones serving at sea on a voyage to the West Indies, and he taught mathematics and navigation on board ships between\n1695\nand\n1702\n. He was serving on a navy vessel which was part of the British-Dutch fleet under Sir George Rooke and James Butler, Duke of Ormonde, which destroyed a Franco-Spanish fleet in Vigo bay off northwestern Spain in\n1702\n. Navigation was a topic which greatly interested Jones and his first published work was\nA New Compendium of the Whole Art of Navigation\npublished in\n1702\n. In this work he applied mathematics to navigation, studying methods to calculate position at sea.\nAfter the battle of Vigo, Jones left the navy and became a teacher of mathematics in the coffee houses of London. This may seems strange but in fact at this time coffee houses were sometimes called the Penny Universities because of the cheap education they provided. They would charge an entrance fee of one penny and then while customers drank coffee they could listen to lectures. Different coffee houses catered to specific interests such as art, business, law and mathematics. Jones was able to make a living lecturing in coffee houses such as Child's Coffee House in St Paul's Churchyard.\nSoon he was employed to tutor Philip Yorke, who was later to become Baron Hardwicke of Hardwicke. This was an important position for Jones since Yorke, after a legal career, entered parliament becoming solicitor general\n(1720)\n, attorney general\n(1724)\n, lord chief justice\n(1733)\n, and lord chancellor\n(1737)\n. Jones tutored Yorke for about three years. He published\nSynopsis palmariorum mathesios\nⓉ\n(\nSynopsis of elementary mathematics\n)\nin\n1706\n, a book based on his teaching notes intended for beginners. It included the differential calculus, infinite series, and is also famed since the symbol π is used in it with its modern meaning. In\n1709\nhe applied for the position of master of Christ's Hospital Mathematical School and supplied references written by\nNewton\nand\nHalley\n. He failed to obtain the position so continued lecturing in the coffee houses of London.\nAlthough of little importance as a research mathematician, William Jones is well known to historians of mathematics since he corresponded with many\n17\nth\ncentury mathematicians, including\nNewton\n. He was, however, elected a Fellow of the\nRoyal Society\nin\n1711\n. Jones then served on the\nRoyal Society\ncommittee set up in\n1712\nto decide who had invented the\ninfinitesimal\ncalculus,\nNewton\nor\nLeibniz\n. We should now describe how Jones came to be considered an important\nNewton\nsupporter in the dispute.\n(\nThe\nRoyal Society\nmade sure that only strong\nNewton\nsupporters served on their committee!\n)\nThrough lecturing in the coffee houses, Jones came in contact with leading scientists of the day such as\nBrook Taylor\nand\nRoger Cotes\n.\nJohn Collins\n, famed for his correspondence with a wide range of scientists, had died in\n1683\nand in\n1708\nJones acquired his mathematical papers. These included transcripts of\nNewton\n's manuscripts, letters and results obtained with the method of infinite series which\nNewton\nhad discovered in about\n1664\n.\nNewton\nhad written up these results in\nDe analysi\nⓉ\n(\nOn analysis\n)\nbut they had not been published. With assistance from\nNewton\nhimself, Jones produced\nAnalysis per quantitatum series, fluxiones, ac differentia\nⓉ\n(\nAnalysis for quantitative series, fluxions and differentiation\n)\nin\n1711\nalthough it should be noted that this first edition of\n1711\ndid not record either\nNewton\n's name nor that of Jones. As an appendix to this work Jones added\nNewton\n's\nTractatus de quadratura curvarum\nⓉ\n(\nTreatise on the quadrature of curves\n)\nwhich was a shortened version of the work on analytical calculus which\nNewton\nhad written in\n1691\n. The second edition of\nAnalysis per quantitatum\nⓉ\n(\nAnalysis of the quantities\n)\npublished in\n1723\ndid contain a preface written by Jones. Another contribution made by Jones towards publishing\nNewton\n's work relates to the\nMethods fluxionum\nⓉ\n(\nMethods of fluxions\n)\n, written by\nNewton\nin\n1671\n.\nNewton\nhad tried to get it printed over a period of five years but finally gave up in\n1676\nwhen Cambridge University Press rejected it. Jones made a copy of the original Latin, giving it the title\nArtis analyticae specimina sive geometria analytic\nⓉ\n(\nThe analytical art of models or analytic geometry\n)\nand it was this version which was eventually published. In\n1731\nJones published\nDiscourses of the Natural Philosophy of the Elements\n.\nWe left our description of the events in Jones' life after he was unsuccessful in obtaining the mastership of Christ's Hospital Mathematical School. He had, before this, married the widow of his employer in the merchant's counting-house. In addition to his coffee house role he also acted as a tutor to George Parker, son of the future earl of Macclesfield, a position he obtained since his former pupil Philip Yorke was a friend of George Parker's father. Jones was long associated with the Parker family and lived for long spells at their castle at Shirburn. He was greatly helped by his friendship of Philip Yorke and George Parker, particularly after he lost all his money when the bank in which his money was invested collapsed. His two former pupils were by this time men of great influence and were able to obtain various positions for Jones which provided him with an income without requiring any real work.\nJones' first wife died and he remarried several years later to Mary Nix on\n17\nApril\n1731\n. She was\n25\nyears old and Jones was\n56\nat the time of their marriage. They had three children, two of whom survived to adulthood: Mary born in\n1736\nand William born\n10\nyears later. On his death Jones left a large collection of manuscripts and correspondence which it appears he had intended to publish as a major piece of work. There are many notes and copied parts of original manuscripts to which he had access.\nWallis\nwrites in\n[\n2\n]\n:-\nHis collection of some\n15\n,\n000\nbooks was considered to be the most valuable mathematical library in England and was bequeathed to George Parker, the second earl of Macclesfield. His papers were not in the bequest; nevertheless many are at Shirburn, where they have remained\n(1995)\nwith access extremely restricted. Almost the only permitted publication has been those papers contained in the two-volume Rigaud Correspondence. Among Jones's manuscripts was another projected mathematical book, which his son, Sir William, had intended, but failed, to publish.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry"
  ]
}