{
  "nome_completo": "William Parry",
  "nome_curto": "William Parry",
  "ano_nascimento": "1934",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Parry/",
  "lugar_nascimento": "Coventry, England",
  "lugar_morte": "Coventry, England",
  "biografia": "William Parry\n's parents were Richard and Violet Irene Parry. William was always known as Bill. He was born into a large family, being the sixth of his parents' seven children. His father Richard Parry, a sheet-metal worker, and brothers were active trade unionists with fairly left-wing views. Some of his family were members of the Communist Party, so Bill grew up in a family strongly committed to left-wing politics. Bill's three brothers followed their father in becoming sheet-metal workers while only one of his three sisters went on to higher education\n(\nand that was as a mature student\n)\n.\nAt the end of primary education an examination had been introduced in England in order to determine the type of secondary education that a young person should continue with. Called the\n11\n-plus examination\n(\nsince it was taken after the age of\n11)\n, it began to be used in this way only a year or so before Parry sat it. He did not achieve the standard set for those pupils to go on to grammar school, the route to a university education, and was directed instead into a school teaching technical subjects. Parry attended a school which specialised in woodwork and metalwork but his mathematical abilities were spotted by a teacher who persuaded him not to leave school early. Most pupils attending such technical schools would leave at a young age and take on an apprenticeship with a firm. Continuing with school education in such a technical school was a problem, however, for there were no classes for Parry to attend in mathematics and arrangements had to be made for him to attend mathematics classes at Birmingham Technical College.\nAfter passing the examinations at Birmingham Technical College, Parry was allowed to enter University College, London, to study mathematics. He had certainly not been prepared at school for a university education but he did well and was encouraged by his lecturers, including Hyman Kestelman. Parry was active in student politics during his undergraduate years and at this time he joined the Communist Party. He sold the Daily Worker and lost money at poker, missing lectures which did not interest him.  He graduated in\n1955\nand went to Liverpool University to study for a Master's Degree in mathematics. There he came into contact with the Socialist Labour League and he joined them, a move which he later regretted. During his one year course at Liverpool, Parry applied to Imperial College, London, to study there for his doctorate in mathematics. Entering in\n1956\nhis research was supervised by Yael Dowker. During his time as a research student there were protests across the country against atomic weapons and in\n1958\nthe Aldermaston March took place to protest against atomic-weapons research and development at Aldermaston, Berkshire. Parry, and many fellow students, took part on the march and it was there he met Benita Teper who had recently arrived from South Africa, They married in\n1958\n, the year they met, and had a daughter Rachel\n(\nborn\n1967)\n. After being awarded his doctorate by Imperial College, London, Parry was appointed as a lecturer at Birmingham University in\n1960\n.\nParry's first paper\nOn the b-expansions of real numbers\nwas published in\n1960\n. There followed a number of papers on ergodic theory. In\nErgodic properties of some permutation processes\n(1962)\nParry considered two modifications of a process of\nMaurice Kendall\nmade by H E Daniels, showing that the first modification and the one-dimensional second modification are ergodic. In\n1963\nhe published\nAn ergodic theorem of information theory without invariant measure\ngeneralising the individual version of McMillan's ergodic theorem of information theory without the hypothesis of an invariant probability function. Particularly important in Parry's development as a research mathematician was the year\n1962\n-\n63\nduring which he worked at Yale University in the United States with a group of other young mathematicians interested in\nergodic theory\n. Back in Birmingham after his year abroad, his research output moved up to an even higher standard and level of output. He published\n4\npapers in\n1964\n,\n2\npapers in\n1965\nand\n5\npapers in\n1966\n.\nIntrinsic Markov chains\n(1964)\ncame out of his visit to Yale and was published in the\nTransactions of the American Mathematical Society\n. H P Edmundson begins his review of the paper writing:-\nThe author investigates the structure of finite-state stochastic processes that are called intrinsically Markovian since they behave like Markov chains because \"possible\" sequences of the processes are determined by a chain rule. Necessary and sufficient conditions are established for a stochastic process to be intrinsically Markovian.\nIn\nOn Rohlin's formula for entropy\n(1964)\n, Parry gives a formula for computing the entropy of an ergodic stationary non-atomic stochastic process with a finite number of states.\nIn\n1965\nParry left Birmingham and moved to the new Sussex University where he was appointed as a Senior Lecturer in Mathematics\n[2]\n:-\nThere he worked on entropy theory showing, amongst other things, that each aperiodic measure-preserving transformation could be viewed as the shift on the realisation space of a stationary, countable state, stochastic process indexed by the integers or the natural numbers.\nPete Walters, the author of the obituary\n[2]\n, was a doctoral student of Parry at Sussex University graduating in\n1967\n.\nThe University of Warwick, in the city of Coventry, opened to undergraduates in\n1965\n.\nE C Zeeman\ncreated a vigorous mathematics department from the day it opened, and by\n1968\nit had become one of the leading mathematics research schools in Britain. Parry was back working in his home city of Coventry when he was appointed to the University of Warwick as a Reader in\n1968\n. He chose to live in the village of Marton, half-way between Leamington Spa and Rugby. Two years later he was promoted to Professor. The greatest honour given to him was in\n1984\nwhen he was elected a fellow of the\nRoyal Society of London\n.\nParry published over\n80\npapers and a number of fine books. These books included\nEntropy and generators in ergodic theory\n(1969)\n,\nTopics in ergodic theory\n(1981)\n, and\n(\nwith Selim Tuncel\n)\nClassification problems in ergodic theory\n(1982)\n. W L Reddy writes about the first of these:-\nIn the preface the author states that his main purpose is to develop the abstract aspects of the subject. This purpose is admirably realized. This book is an attractive and clear introduction to entropy and generators in ergodic theory which allows the reader who is not an expert in ergodic theory to gain an appreciation of the flavour of the subject and an understanding of the important theorems.\nParry retired in\n1999\nand was appointed Professor Emeritus. He continued to teach an advanced course for the next three years and continued to attend seminars. His death was as a result of cancer, exacerbated by MRSA. The University of Warwick paid him the following tribute:-\nBill was the first appointment in analysis at Warwick. He played a key role in the department, and was Chair of the Department for\n2\nyears. The rapid rise of the Warwick Mathematics Department's international reputation was due to many, among whom Bill featured prominently. His great mathematical achievements were recognized by his early election to the Royal Society. He attracted a number of outstanding Ph.D. students.\nBill Parry listed his hobbies as theatre, concerts, and walking.",
  "math_areas": [
    "Analysis",
    "Logic",
    "Number Theory",
    "Statistics"
  ]
}