{
  "nome_completo": "William Burnside",
  "nome_curto": "William Burnside",
  "ano_nascimento": "1852",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burnside/",
  "lugar_nascimento": "Paddington, London, England",
  "lugar_morte": "Cotleigh, West Wickham, Kent, England",
  "biografia": "William Burnside\n's parents were Emma Knight and William Burnside. William Burnside Senior was of Scottish ancestry, his grandfather having moved from Scotland to London where he was a partner in the booksellers Seeley and Burnside. William Burnside Senior was a merchant who lived at\n7\nHowley Place, Paddington, where William, the elder of his parents two sons, was born. However, by the age of six Willian was an orphan\n[\n1\n]\n:-\nBurnside was educated at Christ's Hospital - then situated in Newgate Street - and achieved distinction in both the grammar school and the mathematical school.\nChrist's Hospital was a school which took in boys whose parents were unable to pay the fees for a boarding school, so it was particularly appropriate for an orphan like Burnside. He entered St John's College, Cambridge in October\n1871\nhaving won a scholarship. In\n1873\nhe moved from St John's College to Pembroke College, not for academic reasons but rather because St John's had such an excellent rowing team that Burnside was not good enough to make their first boat. He could make the first boat for Pembroke so he moved there, graduating in\n1875\nas second\nwrangler\n, bracketed with\nGeorge Chrystal\n. Burnside was, however, considered to have the most elegant mathematical style. Among his teachers at Cambridge were\nStokes\n,\nAdams\nand\nMaxwell\nin applied mathematics and\nCayley\nin pure mathematics. They were to influence greatly the direction that Burnside's research was to take. He was first Smith's Prizeman and\n1875\n, was awarded a fellowship at Pembroke College which he held from\n1875\nto\n1886\n, and became a College lecturer. In fact Pembroke had an applied mathematics tradition, so a decision taken because of rowing was largely responsible for the direction that Burnside took in his mathematical teaching and research.\nHe lectured on hydrodynamics but his first paper, published in\n1883\n, considered\nelliptic functions\n. After\n1885\n, the year he was appointed professor of mathematics at the Royal Naval College at Greenwich, his research too turned towards hydrodynamics. Much of Burnside's work on hydrodynamics involved the use of complex variable and in papers of\n1891\nand\n1892\nhe considered the\ngroup\nof linear fractional transformations of a complex variable. His work quickly turned to the study of groups and from\n1894\nonwards he was to be occupied almost entirely with the study of group theory.\nWe mentioned that Burnside was an excellent oarsman, a '\n7\n' who captained Pembroke, but he was considered too light to make the University Boat so never earned a rowing blue. However, he retained an interest in rowing and later in fishing. He always had a love for Scotland and continued to take fishing holidays there throughout his life. He married Alexandrina Urquhart on\n25\nDecember\n1886\nsoon after he took up the Chair at Greenwich. Alexandrina was the daughter of a crofter Poolewe in the county of Ross, Scotland. They had two sons and three daughters. Looking at Burnside's career perhaps the greatest surprise is that he turned down an offer from Pembroke to return to his old College, preferring to remain at Greenwich. In fact he turned down two offers from Pembroke for after\nStokes\ndied in\n1903\n, the College invited Burnside to take up the post of Master of the College. Again he chose to turn down this prestigious offer.\nBurnside was elected a Fellow of the\nRoyal Society\nin\n1893\nfor his work on hydrodynamics and complex function theory. However it was in\n1893\nthat he published his first paper on finite simple groups, showing that the alternating group\nA\n5\nA_{5}\nA\n5\n​\nis the only finite simple group whose order is the product of four\n(\nnot necessarily distinct\n)\nprimes. This paper was the first of a series which Burnside described himself as follows\n(\nsee for example\n[\n3\n]\n)\n:-\nThey are concerned chiefly with the proof of certain tests that may be applied in particular cases to determine whether it is possible for a simple group of a given order to exist.\nFor example he proved in a paper published in\n1895\nthat if a group of even order has a cyclic\nSylow\n2\n-subgroup then the group cannot be simple. His work on group theory quickly progressed and in\n1897\nhe published\nThe Theory of Groups of Finite Order\n, the first treatise on group theory in English. He wrote in the Introduction:-\nThe present treatise is intended to introduce to the reader the main outlines of the theory of groups of finite order apart from any applications. The subject is one which has hitherto attracted but little attention in this country; it will afford me much satisfaction if, by means of this book, I shall succeed in arousing interest among English mathematicians in a branch of pure mathematics which becomes the more fascinating the more it is studied.\nThis book was to have a major influence in the development of group theory. In\n1899\nBurnside was elected to the Council of the\nLondon Mathematical Society\nand in the same year the Society awarded him the\nDe Morgan\nmedal. He was to be President of the Society from\n1906\nto\n1908\nand continued to serve on the Council until\n1917\n. He gave his presidential address at the end of his term of office in\n1908\non finite groups but still felt that there was little interest among British mathematicians:-\nIt has been suggested to me that I should take advantage of the present occasion to give an account of the recent progress of the theory of groups of finite order. ... But ... any attempt on my part to give, on the present occasion, an account of the recent advance in the theory ... would certainly be uninteresting to a considerable number of my audience. It is undoubtedly the fact that the theory of groups of finite order has failed, so far, to arouse the interest of any but a very small number of English mathematicians; and this want of interest in England, as compared with the amount of attention devoted to the subject both on the Continent and in America, appears to me very remarkable. I propose to devote my address to a consideration of the marked difference in the amount of attention devoted to the subject here and elsewhere, and to some attempt to account for this difference.\nLet us now examine some more of Burnside's contributions to group theory.\nFrobenius\nstarted his development of the\nrepresentation theory\nof groups and\ncharacter theory\nin\n1896\n. Burnside quickly recognised the importance of\nFrobenius\n's methods and he began to use character theory. One of his most important results, namely that groups of order\np\nm\nq\nn\np^{m}q^{n}\np\nm\nq\nn\nare soluble, appeared in\n1904\n. Special cases of this result had been proved by\nSylow\n(\nthe case\nn\n=\n0\nn = 0\nn\n=\n0\nin\n1872)\n,\nFrobenius\n(\nthe case\nn\n=\n1\nn = 1\nn\n=\n1\nin\n1895)\nand\nJordan\n(\nthe case\nn\n=\n2\nn = 2\nn\n=\n2\nin\n1898)\n. Burnside conjectured that every finite group of odd order is\nsoluble\nand it is not surprising that he failed to prove this result as it was not proved until\n1962\nwhen\nW Feit\nand\nJ C Thompson\nproved the result in a\n300\npage paper.\nMuch of group theory today still moves in directions set by Burnside. His famous '\nBurnside Problem\n' on the finiteness of groups when the elements have fixed finite orders is still a major area of group theory research today. In fact a\n1994\nFields Medallist\nE Zelmanov\nwas awarded his medal for work related to the Burnside problem.\nIf the first edition of\nThe Theory of Groups of Finite Order\nwas important, the second edition published in\n1911\nwhich contains a systematic development of the subject including\nFrobenius\n's character theory and Burnside's work using these methods, was a classic which is still widely read today. He wrote in the Preface:-\nVery considerable advances in the theory of groups of finite order have been made since the appearance of the first edition of this book. In particular the theory of groups of linear substitutions has been the subject of numerous and important investigations by several writers; and the reason given in the original preface for omitting any account of it no longer holds good. in fact it is now true to say that for further advances in the abstract theory one must look largely to the representation of a group as a group of linear substitutions.\nDuring his life Burnside was to publish around\n150\npapers of which about\n50\nwere on group theory. In fact in the latter years of his life he turned to\nprobability theory\nand his first paper on the subject appeared in\n1918\n. He left a complete manuscript of a book on probability which was published as\nThe Theory of Probability\nin the year after his death.\nOn\n22\nDecember\n1925\nBurnside had a slight stroke as he explained in a letter to Baker on\n19\nJanuary of the following year:-\nI had a slight stroke on\n22\nDecember and though I have gone on very well I am by no means out of the doctor's hands yet. Among other things he forbids is an interest in mathematics.\nBurnside did get back to his mathematics, publishing\nOn a group of order\n25920\nand the projective transformations of a cubic surface\nlater that year, but he died in\n1927\n. Before he died he replied to\nPhilip Hall\nwho wrote to him asking for suggestions for the most profitable group theory problems to study.\nHall\nwas to prove a very worthy successor to Burnside as the promoter of group theory in England.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Logic",
    "Statistics"
  ]
}