{
  "nome_completo": "William Brouncker",
  "nome_curto": "William Brouncker",
  "ano_nascimento": "1620",
  "ano_morte": "1684",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brouncker/",
  "lugar_nascimento": "Castlelyons (N of Cork), Ireland",
  "lugar_morte": "Westminster. London, England",
  "biografia": "William Brouncker\nwas the elder son of Sir William Brouncker, a man of high importance who was closely associated with the kings of England and had fought against the Scots in\n1639\n. He served Charles I as one of his privy chamber and acted as vice-chamberlain to his son Charles, Prince of Wales. William Brouncker's mother was Winifred Leigh who came from Newenhan in Warwickshire. In a time in England when King and Parliament would fight the Civil War, the Brouncker family were staunch Royalist supporters.\nWe know little of Brouncker's early life. We have given\n1620\nas his date of birth but this is a guess made by historians rather than coming from any specific evidence. His place of birth is also a guess. Whether he was born in Ireland or England is even a matter of debate with no firm evidence to support either hypothesis. About the first we know for certain of Brouncker is that he entered Oxford University when he was sixteen years old and there he studied mathematics, languages and medicine. It is doubtful whether Brouncker learned more than arithmetic at Oxford, for\nWallis\n, giving the status of mathematics at this time, wrote:-\n... mathematics, at that time with us, were scarce looked on as academical studies, but rather mechanical - as the business of traders, merchants, seamen, carpenters, surveyors of lands and the like.\nThis was a difficult time for Brouncker for the political situation in England was in turmoil. When his father fought against the Scots in\n1639\nCharles I had been ruling for ten years without a Parliament. Charles I, running low on funds with which to continue to fight the Scots, summoned Parliament in\n1640\nto try to raise money. The English Civil War broke out in\n1642\n, the Scots joined the Parliament forces and Charles I suffered a series of defeats. Brouncker and his father were Royalists and were very definitely on the losing side.\nOn\n12\nSeptember\n1645\nBrouncker's father became Viscount Brouncker of Castle Lyons. He had bought himself into the Irish peerage and according to Samuel Pepys, the diarist\n(\nsee for example\n[\n4\n]\n)\n:-\n... he gave\n1200\npounds to be made an Irish lord, and swore the same day that he had not\n12\npence left to pay for his dinner.\nThe First Viscount Brouncker of Castle Lyons did not live long to enjoy the peerage he bought for he died two months later. At this time William Brouncker, his mathematician son, succeeded him to the title becoming the Second Viscount Brouncker of Castle Lyons. Six months later the King finally lost the Civil War and surrendered. It was a time for Royalists to keep their heads down if they wanted to survive and that is exactly what Brouncker did.\nHe received the degree of Doctor of Medicine from Oxford University on\n23\nFebruary\n1647\n(\nin fact February at this time was\n1646\nsince the new year began in April but we will give\n1647\nwhich is consistent with our present calendar\n)\n. Charles I was beheaded in January\n1649\nand in May of that year Brouncker's mother died. The authors of\n[\n4\n]\nwrite:-\nBrouncker was one of the Royalists who remained quietly in the country pursuing his studies.\nThese studies were mathematics and music, two topics which Brouncker loved. It was during this time that he worked on a publication which would in fact be his only book.\nDescartes\nhad written a paper on music in\n1618\nbut it had never been published. Only after\nDescartes\n' death in\n1650\ndid a Dutch publisher print it as a\n58\npage pamphlet with the title\nRenati Descartes Musicae Compendium\nⓉ\n(\nDescartes' musical compendium\n)\n. In\n1653\nBrouncker published his English translation of\nDescartes\n' work but he added notes of his own which doubled the size of the work.\nMersenne\nhad proposed a scale of\n12\nequal semitones after\nDescartes\n' manuscript had been written and in his notes Brouncker proposed a variation of\nMersenne\n's ideas but he divided the scale into\n17\nequal semitones. One should not be surprised that all these mathematicians were contributing to musical theory and indeed Brouncker's notes are highly mathematical using algebra and logarithms. One might wonder why Brouncker chose\n17\nequal semitones and again the reason was a mathematical one for he derived this from taking ratios based on the golden section.\nEngland had became a republic in\n1649\nwhen Charles I was beheaded. In\n1653\nCromwell had become Protector and he held this role until his death in\n1658\n. The years of the Protectorate were the most productive years for Brouncker in terms of mathematics. He had to keep out of the limelight to avoid paying for his Royalist views so he worked away corresponding with\nWallis\nand solving some difficult mathematical problems which we look at below. Through\nWallis\n, and others with whom he was corresponding, he became involved with a group of scientists who met in Gresham College London. Although we do not know exactly when he first became an active member of this group, we do know that he was taking part in meetings in Gresham College in\n1657\n.\nAfter Cromwell's death in\n1658\nhis son took over but was ineffectual. The situation deteriorated with troops being stationed in Gresham College preventing the scientist continuing their weekly meetings. Monck, who had been appointed as governor in Scotland, marched an army on London and restored order in early\n1660\n. Brouncker was one of those who signed a Declaration acknowledging Monck's rights. Monck called for new elections to Parliament, knowing that the mood of the people would elect Royalists. Brouncker stood in the new parliamentary elections and was elected as Member for Westbury in\n1660\n. The improvement in the situation in London, in particular the troops who had been stationed in Gresham College having left, allowed the scientists to begin meeting again in the College. On Wednesday\n28\nNovember\n1660\nBrouncker was one of a dozen scientists at a meeting in Gresham College which constituted their Society for the Promoting of Physico-Mathematical Experimental Learning which they declared would promote experimental philosophy.\nThe Convention Parliament, of which Brouncker was a Member, voted to restore the monarchy and Charles II, the son of the executed Charles I, came to the throne in\n1660\n. Brouncker's father had been vice-chamberlain to Charles when he was Prince of Wales and so Brouncker was well known to the new King who soon repaid him for his loyal support. In\n1662\nthe King appointed Brouncker as Chancellor to Queen Catherine\n(\nof Braganza\n)\nand Keeper of the Great Seal.\nThe Society at Gresham petitioned King Charles II to recognise it and make a royal grant of incorporation. Brouncker worked hard for the Society ensuring that it was active. In particular he carried out many experiments including some on ballistics, some on the pendulum and a study of the variation of the magnetic needle. The first of these topics he published as\nRecoil of guns\n. The Royal Charter which was passed by the Great Seal on\n15\nJuly\n1662\ncreated the\nRoyal Society of London\nand the Royal Charter nominated Brouncker as its first President. Given the quality of the founder members of the\nSociety\n, it might be considered slightly strange that Brouncker, certainly not the most eminent academically, was made President. Well certainly Brouncker was on the best terms with the King and this must have been a major factor, but there were other reasons. Brouncker was a man of independent means, and he was also unmarried, so he had time to devote to the\nSociety\nwhich most others would not have had. Again nobody could have been more enthusiastic in promoting the aims of the\nSociety\nthan Brouncker so he was a good choice.\nAs President, he continued his experimental work. Birch in his\nHistory of the Royal Society\npublished in\n1667\nwrites:-\nThe Lord Viscount Brouncker moved, that the experiments concerning the measure of the first velocity of bodies might be presented, that is what force is required to raise, for instance, one pound weight, one yard high in one second of time. His Lordship was desired to be curator of that experiment.\nBrouncker now took on a number of roles. He was president of Gresham College, London, from\n1664\nto\n1667\n. One of Brouncker's interests was in ships and he built, to his own design, a yacht for King Charles II. This interest in the sea made him an obvious choice to be appointed as a Commissioner to the Navy Board in\n1664\nand, as with his work for the Royal Society, he took on his duties with great enthusiasm. The diarist Pepys, who was Clerk to the Navy Board, records that he considered Brouncker:-\n... a very able person.\nIn\n1668\nBrouncker was appointed as Controller of the Navy Accounts. Pepys wrote:-\nThe truth is\n[\nBrouncker\n]\nis the best man of them all, and I would be glad, next myself, to serve him ...\nThings began to go less well for Brouncker from around\n1675\n. He fell out with\nHooke\nover comments which he had made to Charles II advising against a patent for\nHooke\n's spring-regulated watch.\nHooke\nand others in the\nRoyal Society\nbegan to feel that the time had come for a change of President. The yearly elections of\n1675\nand\n1676\nwere thought by\nHooke\nto be unfair, and the fact that\nHooke\nwas not elected to the Council in\n1676\nmade him all the more determined to reform the election process. Brouncker seems to have only infrequent attended the Society in\n1677\nbut he still seems to have wanted to continue as President.\nHooke\nrecords that on\n18\nOctober\n1677\nBrouncker was in the chair when a proposal was put forward to elect the Council by a vote:-\nLord Brouncker in great passion, raved and went out.\nBrouncker was not present at the November meeting which elected Sir Joseph Williamson to succeed him as President.\nBrouncker's mathematical achievements includes work on\ncontinued fractions\nand calculating logarithms by infinite series. In\n1655\nhe gave a continued fraction expansion of\n4\nπ\n\\Large\\frac{4}{\\pi}\nπ\n4\n​\n4\nπ\n=\n1\n+\n1\n2\n2\n+\n3\n2\n2\n+\n5\n2\n2\n+\n.\n.\n.\n\\Large\\frac {4} {\\pi} \\normalsize = 1 + \\Large \\frac {1^2}{2+ \\Large\\frac{3^2}{2 + \\Large\\frac {5^2}{2+...}}}\nπ\n4\n​\n=\n1\n+\n2\n+\n2\n+\n2\n+\n.\n.\n.\n5\n2\n​\n3\n2\n​\n1\n2\n​\nThis result, written up in around ten pages, was added by\nWallis\nto his treatise\nArithmetica Infinitorum\nand probably first discovered by Brouncker in\n1654\n.\nWallis\ntold\nHuygens\nof this result and\nHuygens\nexpressed strong doubts that it was true. However after Brouncker correctly computed the first\n10\nplaces in the decimal expansion of π using his continued fraction expansion,\nHuygens\naccepted the result.\nProbably also in\n1654\nBrouncker computed the quadrature of the hyperbola although he did not publish this result until\n1668\n. It appeared in a paper published by Brouncker in the\nPhilosophical Transactions of the Royal Society\nof\n1668\nbut he clearly states that this result is the one referred to by\nWallis\nin\n1665\n. Although not given in this form, what Brouncker proved is equivalent to showing that the integral of\n1\n1\n+\nx\n\\Large\\frac{1}{1+x}\n1\n+\nx\n1\n​\nbetween\n0\nand\n1\nwas\n1\n1\n×\n2\n+\n1\n3\n×\n4\n+\n1\n5\n×\n6\n+\n.\n.\n.\n\\Large\\frac{1}{1\\times 2}\\normalsize  + \\Large\\frac{1}{3\\times 4}\\normalsize  + \\Large\\frac{1}{5\\times 6}\\normalsize  + ...\n1\n×\n2\n1\n​\n+\n3\n×\n4\n1\n​\n+\n5\n×\n6\n1\n​\n+\n.\n.\n.\nor\n1\n−\n1\n2\n+\n1\n3\n−\n1\n4\n+\n1\n5\n−\n1\n6\n+\n.\n.\n.\n1 - \\Large\\frac{1}{2}\\normalsize  + \\Large\\frac{1}{3}\\normalsize  - \\Large\\frac{1}{4}\\normalsize  + \\Large\\frac{1}{5}\\normalsize  - \\Large\\frac{1}{6}\\normalsize  + ...\n1\n−\n2\n1\n​\n+\n3\n1\n​\n−\n4\n1\n​\n+\n5\n1\n​\n−\n6\n1\n​\n+\n.\n.\n.\nBrouncker gave a method of solving the\ndiophantine equation\nn\nx\n2\n+\n1\n=\ny\n2\nnx^{2} + 1 = y^{2}\nn\nx\n2\n+\n1\n=\ny\n2\nwhich evolved during an exchange of letters in\n1657\n-\n58\ndiscussing a challenge problem posed by\nFermat\n. See our article\nPell's equation\nfor more details. It is believed that\nEuler\nmade an error in naming the equation '\nPell\n's equation', and that he was intending to acknowledge the outstanding contribution made by Brouncker. It is interesting to think that if\nEuler\nhad not made this error then Brouncker, instead of being relatively unknown as a mathematician, would be universally known through 'Brouncker's equation'.\nIn\n1659\nBrouncker's improvement of\nNeile\n's computation of the arc length of the semicubical parabola\na\ny\n2\n=\nx\n3\nay^{2} = x^{3}\na\ny\n2\n=\nx\n3\nappeared in\nWallis\n's work\nDe Cycloide et de Corporibus inde Genitis\n.\nBrouncker has gained a somewhat unfortunate reputation. Pepys, who as we have seen was a good friend of Brouncker, thought that he had treated Mrs Turner, one of his lady friends, badly and wrote in his diary:-\nI perceive he is a rotten-hearted, false man as any I know ... and, therefore, I must beware of him accordingly, and I hope I shall.\nThere are other negative comments regarding his character which are believed to be unfair in that the writer has confused Brouncker with his brother Henry Brouncker. Henry was:-\n.. ever noted for a hard, covetous, vicious man; but for his worldly craft and skill in gaming few exceeded him.\nIt seems a cruel twist that two misidentifications, mistaking him for\nPell\nand also for his brother Henry, has led to Brouncker receiving less than his just deserts.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Number Theory"
  ]
}