{
  "nome_completo": "William Chauvenet",
  "nome_curto": "William Chauvenet",
  "ano_nascimento": "1820",
  "ano_morte": "1870",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chauvenet/",
  "lugar_nascimento": "Milford, Pennsylvania, USA",
  "lugar_morte": "St Paul, Minnesota, USA",
  "biografia": "William Chauvenet\n's parents were Mary Kerr and William Marc Chauvenet. William Chauvenet senior was a farmer but later became a businessman. The family were relatively well off and able to send their son to a private school in Philadelphia. The school was run by Dr Samuel Jones who was so impressed with the abilities of William, the subject of this biography, that he persuaded his father to give up the idea that his son would become a businessman and allow him to obtain a university education at Yale university.\nAlthough William was extremely good at mathematics and this was the natural subject for him to study at university, he had to also be knowledgeable in Latin and Greek in order to be accepted onto a degree course. He did not find this too much trouble and after one year of study he was proficient at Latin and Greek when he entered Yale University in\n1836\n. One might imagine that getting up to scratch in Latin to meet the entrance requirement would have been difficult enough, but he achieved far more than just the minimum level for he studied classics at Yale as well as mathematics and was awarded first prize for Latin composition at the end of his first year of study. He graduated with distinction in\n1940\n.\nAfter graduating Chauvenet was appointed as assistant to Alexander D Bache at Girard College in Philadelphia. Girard College had been founded by the American financier and philanthropist Stephen Girard in\n1833\nand Chauvenet worked there making observations of the terrestrial magnetic field. He also worked on astronomy at Philadelphia High School. In\n1841\nhe was appointed as professor of mathematics in the U.S. Navy. This proved the most important post for Chauvenet for it led him to be involved in the founding of the U.S. Naval Academy at Annapolis, Maryland. His initial work with the U.S. Navy consisted of teaching on the USS Mississippi. This did not reach the levels that Chauvenet thought were required so in\n1842\nhe moved to the Naval Asylum school in Philadelphia where he set up an eight month course. It had been established to educate midshipmen and junior officers but was poorly equipped when Chauvenet arrived. He soon established a more rigorous course and obtained new instruments for the students. Also in\n1842\nhe married Catherine Hemple; they had five children, one daughter and four sons. One son, Regis Chauvenet, who was born in Philadelphia on\n7\nOctober\n1842\n, went on to became a professor of chemistry.\nZund writes\n[\n3\n]\n:-\nFinding the eight-month study program inadequate, Chauvenet proposed a four-year course of study and began lobbying for the creation of a separate naval school devoted solely to academic studies.\nA Naval School was founded at Fort Severn, Annapolis, Maryland on\n10\nOctober\n1845\n, by George Bancroft, historian, educator, and secretary of the Navy, with the aim of meeting the needs which Chauvenet had set out. Annapolis was chosen, rather than Philadelphia, so that the students were not subject to:-\n... the temptations and distractions that are necessarily connected with a large and populous city.\nThe course was a five year one, but only the first and fifth years were spent at the school, the other three years being spent on board ships which were on active service. Chauvenet, who is considered to be one of the founders, moved to Annapolis when the Naval School opened in\n1845\nbeing appointed as professor of mathematics and astronomy and also as head of department.\nBancroft sent a letter which was read to the students on the morning the School opened:-\nThe Government in affording you the opportunity of acquiring an education, so important to the accomplishment of a naval officer, has bestowed upon you all an incalculable benefit. The regulations of the Navy require you to pass through a severe ordeal before you can be promoted; you must undergo an examination on all the branches taught at the Naval School before you are eligible for a Lieutenancy; your morals and general character are strictly inquired into. It is therefore expected that you will improve every leisure moment in the acquirement of knowledge of your profession; and you will recollect that a good moral character is essential to your promotion and high standing in the Navy.\nChauvenet continued to press for a four year academic course, and the Naval School was reorganized in\n1850\n-\n1851\nas the U.S. Naval Academy, with a course of study of four consecutive years. The three years that the students had spent training on board ship under the previous course now became an intensive summer training between each of the academic years.\nChauvenet held his mathematics position at the Academy until\n1853\nwhen he became professor of astronomy, navigation and surveying there. Yale offered him a professorship in mathematics in\n1855\nbut he declined, then again in\n1859\nthey offered him the chair of astronomy and natural philosophy and again he declined. However, in the same year he accepted a post of professor of mathematics at Washington University, St Louis, which was founded in\n1853\nas Eliot Seminary but had changed its name to Washington University in\n1857\n. The first chancellor of Washington University was Joseph Hoyt, but after his death in\n1862\nChauvenet was appointed chancellor to succeed him. He held this post until\n1869\nwhen he retired because of ill health.\nWhat, we should ask, was Chauvenet's main contributions to mathematics. He made two important contributions, one as a fine writer of textbooks and the other as a leading figure in the development of mathematics in America. He will, however, be remembered by many for his important role in founding the U.S. Naval Academy, especially given the immense influence this has had on the American military success. As a textbook writer we mention Chauvenet's\nA treatise on plane and spherical trigonometry\n(1850)\n,\nSpherical astronomy\n(1863)\n,\nTheory and use of astronomical instruments : Method of least squares\n(1863)\n, and\nA treatise of elementary geometry\n(1870)\n. Zund writes\n[\n3\n]\n:-\nChauvenet's books were noted for their clarity and simplicity both for use in the classroom and for self-study. While they contained little in the way of original discoveries, their improved methodology and fresh new presentations were real pedagogical contributions.\nAs a leader of American mathematics during his lifetime we note that he was an original member of the American Association for the Advancement of Science. It was founded in\n1847\nin Boston, Massachusetts, and held its first meeting in Philadelphia, Pennsylvania, in\n1848\n. Its goals were to further the work of scientists, particularly by assisting them to cooperate, to improve the use of science for the benefit of mankind, and to increase public understanding of science. Chauvenet was the general secretary of the American Association for the Advancement of Science in\n1859\nand became its president in\n1870\n. He was also an energetic worker for the\nNational Academy of Sciences\n(\nUnited States\n)\nwhich was established on\n3\nMarch\n1863\nto advise the U.S. government on scientific matters. He was involved with it from the time it was established, and in\n1868\nhe was elected as vice-president. He continued to serve in this role until his death.\nChauvenet is particularly remembered by mathematicians since the\nMathematical Association of America\ncreated the Chauvenet Prize in\n1925\nto be awarded for mathematical exposition.\nCoolidge\n, then president of the MAA, presented funds to establish the prize.\nYou can see a list of winners of the\nChauvenet Prize\n.\nIn\n1969\nChauvenet Hall was dedicated at the U.S. Naval Academy in Annapolis. It contains the Department of Mathematics. The USNS Chauvenet built by Upper Clyde Shipbuilders in Glasgow, Scotland, in\n1970\nwas the first ship specially designed for the U.S. Navy to conduct coastal hydrographic surveys.",
  "math_areas": [
    "Geometry"
  ]
}