{
  "nome_completo": "William Thomson",
  "nome_curto": "William Thomson",
  "ano_nascimento": "1856",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thomson_William/",
  "lugar_nascimento": "Kirkton of Mailer, Perthshire, Scotland",
  "lugar_morte": "Dunedin, Glencairn, Simonstown, South Africa",
  "biografia": "William Thomson\nwas educated at Perth Academy and then at the University of Edinburgh. He graduated with an M.A. and B.Sc. in\n1878\n. In the same year he was appointed as an Assistant in Mathematics at Edinburgh University, a position he held until\n1883\n. During his time in Edinburgh Thomson was an assistant to the professor who was, at that time,\nGeorge Chrystal\n. When Thomson left Edinburgh in\n1883\n,\nAllardice\nsucceeded him as\nChrystal\n's assistant.\nIn\n1883\nThomson was appointed as Professor of Mathematics at Victoria College, Stellenbosch\n(\nlater incorporated with the University of Stellenbosch\n)\n. In\n1895\nThomson moved out of the academic side of the university to become Registrar of the University of the Cape of Good Hope, Cape Colony. After\n23\nyears in this post he moved to the University of South Africa, in Pretoria, again as Registrar. He remained in this position from his appointment in\n1918\nfor four years until he retired in\n1922\n. This was not the end of his career, however, for he served as Principal of Witwatersrand University, Johannesburg, from\n1924\nto\n1928\n.\nThomson was an assistant at Edinburgh University when the\nEdinburgh Mathematical Society\nwas founded in\n1883\nbut he did not join the Society at this time, rather he joined in December\n1888\nwhen he was Professor of Mathematics at Stellenbosch, Cape Colony. He remained a member throughout his career. He was elected to the\nRoyal Society of Edinburgh\non\n6\nMarch\n1882\n, his proposers being\nGeorge Chrystal\n,\nPeter Guthrie Tait\n, Alexander Crum Brown, Sir William Turner.\nAn obituary, written by J M Watt, appears in the\nRoyal Society of Edinburgh\nYear Book\n1948\n/\n1949\n, pages\n48\n-\n49\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nWilliam Thomson married Annie C van der Riet in\n1884\n, a year after moving to South Africa. Annie was a daughter of F J van der Riet, a magistrate of Simonstown.",
  "math_areas": []
}