{
  "nome_completo": "Wolfgang Doeblin",
  "nome_curto": "Wolfgang Doeblin",
  "ano_nascimento": "1915",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Doeblin/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Housseras, France",
  "biografia": "Wolfgang Doeblin\nis arguably one of the four major contributors to probability theory in the first half of the\n20\nth\ncentury up to World War II\n(\nthe other three are\nKhinchin\n,\nKolmogorov\nand\nLévy\n)\n. His work contains several profound results, and his importance is also due to his innovativeness and introduction of new methods. He laid many of the cornerstones of the modern theory for\nMarkov\nchains and processes, to be developed after the war by others. The article in\nMathematical Reviews\non the historical paper by\nPaul Lévy\n[\n8\n]\nfrom\n1955\nabout Doeblin's work states that:-\nIt is a pity that this tribute to Doeblin's genius was written without reference to later developments of his work. After all there can be no greater testimony to a man's work than its influence on others. Fortunately, for Doeblin, this influence has been visible and is still continuing. On limit theorems his work has been complemented and completed by\nGnedenko\nand other Russian authors. On\nMarkov\nprocesses it has been carried out mostly in the United States by\nDoob\n, T E Harris and the reviewer. Here his mine of ideas and techniques is still being explored.\nConsidering Doeblin's short career, it is remarkable that he published\n13\npapers and\n13\ncontributions to\nComptes Rendus\n; for bibliographies, cf.\nPaul Lévy\n[\n8\n]\nor Lindvall\n[\n9\n]\n. In his work on the theory of\nMarkov\nchains and processes, his main field, we notice major contributions to:\nMarkov\nchains with general state spaces, Jump\nMarkov\nprocesses, the coupling method\n(\ninnovation\n)\n, and diffusions. The importance of these is to a large extent due to Doeblin's emphasis on path methods rather than analytical ones; much of what is standard approaches today stem from him. The book by\nDoob\n[\n3\n]\nfrom\n1953\nhas been crucial for the development of\nprobability theory\n; for a large part of its contents on\nMarkov\nchains and processes, Doeblin's work is the base.\nConcerning\nMarkov\nchains with general state space, Orey\n[\n5\n]\nfrom\n1971\nstates that:-\nIt is essentially Doblin's theory as completed during the quarter of a century following the publication of his papers that is presented here.\nIn Doeblin's mine of ideas, the coupling method was paid attention to by very few until the early\n1970\ns; then the time was ripe to explore it, and the method is now a major tool in probability theory, with applications ranging from elementary theory to front research.\nThe term \"diffusion\" was not coined until the\n1950\ns. Nevertheless, the first steps were taken in the\n1930\ns. This type of process were the main interest in the last phase of Doeblin's mathematical career, interrupted by World War II; the spare time he had as a soldier was spent on this. The results presented\n(\nwithout proofs\n)\nin\nComptes Rendus\nare remarkable, and so are the contents of the file that was sealed in February\n1940\nand not opened until May\n2000\n. It contains pieces of what we now call stochastic calculus, including a version of\nIto\n's formula.\nOn Doeblin's work concerning sums of independent random variables,\nFeller\n[\n4\n]\nwrites:-\nThe interest in the theory was stimulated by W. Doblin's masterful analysis of the domain of attraction\n(1939)\n. His criteria were the first to to involve regularly varying functions. The modern theory still carries the imprint...\n[\nThis concerns weak convergence in arrays\n]\n. The last result was obtained by Doblin in a masterful study in\n1940\n, following previous work by\nKhinchin\n(1937)\n.\n[\nThis concerns the so called Doeblin's universal law.\n]\nDoeblin also contributed to the theory of random chains with complete connection, some of which was used in a paper by him on ergodic properties of continued fractions.\nDoeblin's life and fate are remarkable and gripping. His father was Alfred Döblin, a medical doctor but best known as author; the novel\nBerlin Alexanderplatz\n(1929)\nstands out among his many books. Wolfgang was born in Berlin, but he spent his first three years behind the German front in World War I, in Saargemünd where his father volunteered as an army doctor. At the peace in\n1918\n, the family moved back to Berlin, where the reputation of the father, as author and left-wing participant in political and cultural debates, started to rise.\nWarned by friends, Alfred Döblin left Berlin for Zürich the day after the Reichstag-fire in February\n1933\n. He was on the black list of the Nazis: a Jew, controversial for his political views. Wolfgang stayed until May to finish school. The sojourn in Zürich lasted for the summer\n1933\nonly; the family settled in Paris after that.\nDoeblin immediately made a strong impression in Paris;\nFréchet\nwas his adviser, but Doeblin also got in touch with\nPaul Lévy\n, with whom he wrote his first note. He received his PhD from the Sorbonne in\n1938\n, but at that time he was far into topics beyond or not related to those of his thesis. He was enrolled in the French army in November\n1938\nfor military training, and called up for front service in September\n1939\n. This means that his mathematical career comprised only five years of concentrated work.\nIn February\n1940\n, the Nazi invasion was expected to come in the spring to follow, and Doeblin decided to file his work on diffusions at the\nAcadémie des Sciences\nin Paris. The part of Lorraine where he was stationed fell in June. With the Nazi troops just minutes away from the little village Housseras, he decided to take his own life there rather than giving himself up as a prisoner of war.\nHousseras is located some\n100\nkilometres from Sarreguemines\n(\nFrench after World War I\n)\n, the place where Doeblin had spent the first three years of his life.\nThe reader is referred to\n[\n1\n]\n,\n[\n6\n]\n,\n[\n7\n]\n,\n[\n9\n]\n,\n[\n10\n]\nfor biographical texts on Doeblin.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}