{
  "nome_completo": "Yakov Grigorevich Sinai",
  "nome_curto": "Yakov Grigorevich Sinai",
  "ano_nascimento": "1935",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sinai/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": null,
  "biografia": "Both of\nYakov Grigorevich Sinai\n's parents, Grigory Sinai and Nadezda Veniaminovna Kagan, were microbiologists with research careers. Yakov's mother Nadezda died when he was three years old having been infected by viral encephalitis while working in her own laboratory on making a vaccine. The family had strong mathematical connections since Yakov Grigorevich's grandfather\n(\nNadezda Kagan's father\n)\nwas\nBenjamin Fedorovich Kagan\n, the Head of the Department of Differential Geometry at Moscow State University where he founded an important School of Differential Geometry. It is also worth recording that the family was Jewish, and\nKagan\nhad a long struggle against anti-Semitism. It was, however, a family which had, over several generations, taken a leading role in Russian scientific and cultural life.\nKagan\nhad a large influence on his grandson. He retired from his chair at Moscow State University in\n1952\n, the year in which his grandson Yakov Grigorevich entered the Faculty of Mechanics and Mathematics. There is one other member of the family we should mention, namely Grigory Isaakovich Barenblatt\n(1927\n-\n2018)\n. He was the son of Isaak Grigorievich Barenblatt and Nadezda Veniaminovna Kagan, so was Yakov Sinai's half brother. He studied under Boris Moiseevich Levitan\n(1914\n-\n2004)\nand\nAndrei Nikolaevich Kolmogorov\nin the Department of Mechanics and Mathematics of Moscow State University and graduated in\n1950\n. Two years later he married Iraida Nikolaevna Kochina, one of the two daughters of\nNikolai Evgrafovich Kochin\nand\nPelageia Polubarinova Kochina\n.\nTalking about his school years, Sinai said\n[\n17\n]\n:-\nI participated in many olympiads in mathematics during my school years but never had any success and never won any awards. I say this to young people who have never won in olympiads; there may be compensation in the future. At this time, my grandfather was of a great age and he did not have the energy to push me into mathematics. And I also have a half-brother, G I Barrenblatt, who worked at Moscow State University and who was convinced that I should pursue a career in mathematics.\nGerman armies invaded the Soviet Union in May\n1941\nand came close to Moscow by October of that year. By this time Yakov Grigorevich was six years old and had started school but an evacuation of Moscow began. It was\n1943\nbefore the Sinai family could return to Moscow. Sinai said\n[\n17\n]\n:-\nI entered school in\n1943\nafter my family returned from the evacuation of Moscow. At that time boys and girls studied separately; at the end of each year, we had about ten exams. Before the evacuation, life was different. It was forbidden to leave windows open in the apartments in Moscow because it had to be dark. In\n1943\nwindows were allowed to be open again. In Moscow there were no clear signs of war, but life was hard because of the time of Stalin.\nBy the time he was sixteen years old, he was fortunate to have an excellent mathematics teacher when he was at high school in Moscow\n[\n18\n]\n:-\nWe had a very good teacher in mathematics at our high school. His name was Vasily Alekseevich Efremov and he was a great old-style schoolteacher. He always brought us his problems in accurate handwriting on a piece of paper which he distributed among the students. Because of the well-organised and inspiring work, mathematics was very popular among us. We discussed and tried to solve his problems. At this time I was not among the best in the class. There were definitely other students who were much better than I.\nGetting into university was not easy for Sinai since he was Jewish. At this time certain Soviet universities had a deliberate discriminatory policy to prevent Jews entering. Since Sinai was Jewish, when he took the entrance examination to Moscow State University, he was failed. Only the intervention of his grandfather,\nBenjamin Fedorovich Kagan\n, and that of the President of Moscow State University,\nIvan Georgievich Petrovsky\n, saw the decision reversed and Sinai was allowed to begin his university studies.\nSinai took an analysis course from\nMikhail Alekseevich Lavrentev\n, a classical mechanics course from Nikolai Guryevich Chetaev, and an algebra course from\nEugene Borisovich Dynkin\n. His first advisor at Moscow State University was Chetaev who was an expert on analytical mechanics, particularly on stability of motion. Sinai quickly became interested in the dynamical systems on which Chetaev worked. However, he changed advisors and began to work with\nDynkin\n. The problem which\nDynkin\nsuggested that Sinai work on, led to his first paper\nOn the distribution of the first positive sum for a sequence of independent random variables\n(\nRussian\n)\n(1957)\n. In\n1957\nSinai was awarded his first degree from Moscow State University and he began to undertake research for his Master's Degree\n(\nequivalent to a Ph.D.\n)\nworking with\nAndrei Nikolaevich Kolmogorov\n. His entry into the graduate school was not straightforward, however, since again he had to take entrance examinations. He was required to take an examination on the History of the Communist Party and, being a topic in which he had no interest, he failed.\nPavel Sergeevich Aleksandrov\nwas head of mathematics and he, together with\nKolmogorov\n, went to see the Head of the History of the Party Department and asked that Sinai be allowed to resit. He took another History of the Communist Party examination and passed with grade B. It was deemed marginally good enough to let him begin graduate studies.\nHe was awarded a Master's Degree in\n1960\nand, in the same year, was appointed as a Scientific Researcher at the Laboratory of Probabilistic and Statistical Methods at Moscow State University. He continued to work towards his doctorate\n(\nequivalent to the German\nhabilitation\n)\nunder\nKolmogorov\n. Other members of staff had a major influence on him at this time, particularly\nIsrail Moiseevic Gelfand\nand\nVladimir Abramovich Rokhlin\nwho led the seminar on the metric theory of dynamical systems. Sinai's papers published around the time he was working for his Master's Degree include:\nOn the concept of entropy for a dynamic system\n(\nRussian\n)\n(1959)\n;\nFlows with finite entropy\n(1959)\n(\nRussian\n)\n;\nThe central limit theorem for geodesic flows on manifolds of constant negative curvature\n(1960)\n(\nRussian\n)\n; and\nDynamical systems and stationary Markov processes\n(1960)\n(\nRussian\n)\n.\nAlready, in the first of these\n1959\npapers, Sinai gives theorems which make it possible to calculate the entropy for a large variety of dynamical systems. The term '\nKolmogorov\n-Sinai entropy' was quickly established\n[\n20\n]\n:-\nSinai's work deals with measuring dynamical systems, or systems that change over time, such as weather, the motion of planets and economic systems. These systems can be accurately measured in the short term\n(\nshort term being relative to the issue at hand\n)\n; but when analysed in the long term, the systems are difficult to understand and predict. Sinai was the first to come up with a mathematical foundation for determining the number that defines the complexity of a given dynamical system. His mathematical system is called\nKolmogorov\n-Sinai entropy.\nThe high quality and importance of Sinai's papers led to him being invited to lecture at the International Congress of Mathematicians in Stockholm in\n1962\n.\nDynkin\nand\nGelfand\nwere both invited plenary speakers but did not attend.\nKolmogorov\ndid attend the Congress and read\nDynkin\n's lecture. Sinai delivered the half-hour address\nProbabilistic ideas in ergodic theory\non the invitation of the Organising Committee. He also read\nDmitrii Viktorovich Anosov\n's Short Address,\nThe roughness of geodesic currents in compact Riemannian manifolds of negative curvature\n.\nIn\n1971\n, following\nSergei Petrovich Novikov\n's advice, Sinai accepted a position as Senior Researcher at the\nL D Landau\nInstitute of Theoretical Physics of the\nUSSR Academy of Sciences\n.\nNovikov\nhad just been appointed as head of the Mathematics Division at the Institute. Sinai continued to teach at Moscow State University but he did not become a professor there until\n1981\n. The authors of\n[\n12\n]\nexplain the reasons:-\nHis signing\n(\ntogether with many other mathematicians\n)\nin\n1968\nof the well-known letter in defence of A S Esenin-Vol'pin was for a long time a barrier preventing his becoming a Professor\n(\nhe became a Professor only in\n1981\n,\n17\nyears after submitting his Ph.D. thesis\n)\n.\nAlexander Sergeyevich Esenin-Volpin was both a poet and a mathematician who led a human rights movement in the Soviet Union. Beginning in\n1949\n, Volpin spent many years in prison for anti-Soviet poetry or in exile as a socially dangerous person. Sinai suffered much for his support of Volpin. For example in\n1970\nhe was invited to lecture at the International Congress of Mathematicians in Nice. However, he was not allowed to go to Nice by the Soviet authorities. Many others were also prevented from attending the Nice Congress including\nDynkin\n,\nGelfand\n,\nLinnik\n,\nManin\n,\nShafarevich\nand\nSergei Novikov\nwho should have received a\nFields\nMedal at the Congress. Sinai, however, was able to accept the invitation to deliver one of the plenary lectures at the International Congress of Mathematicians in Kyoto in\n1990\n; he spoke on\nHyperbolic Billiards\n. Continuing with his contributions to the International Congress of Mathematicians, we note that in\n2001\nhe was appointed Chairman of the\nFields\nMedal Committee of\nInternational Mathematical Union\nwhich decided on the awards of the\nFields\nMedals at the Congress in Beijing in the following year.\nIn\n1993\nhe was appointed Professor in the Department of Mathematics at Princeton University. He continued with his appointment at the\nL D Landau\nInstitute of Theoretical Physics but gave up his position at Moscow State University. During\n1997\n-\n1998\nhe was Thomas Jones Professor of Princeton University and in\n2005\nhe was Moore Distinguished Scholar at the California Institute of Technology at Pasadena, California. He continued to hold his professorship at Princeton University until\n2023\nwhen he became professor emeritus. He continues\n(\nin\n2023)\nto hold a professorship at the\nL D Landau\nInstitute of Theoretical Physics in Moscow.\nWe have already looked at the deep contribution which was made by Sinai early in his career. Perhaps the best summary of his achievements up to the start of the\n1990\ns is given in\n[\n5\n]\n:-\nSinai has done foundational, deep and highly influential work in the fields of ergodic theory, dynamical systems and statistical mechanics. Already in the sixties he had a deep understanding of the principles of what is now called chaos, and was among the first to recognise the significance of this phenomenon for dynamics. He has also done fundamental work in statistical mechanics. Besides his many major contributions to these subjects, he has had a very wide influence through a number of well-known expository texts and through his many research students.\nSinai's work centres round the grand aim of deriving the basic physical laws which describe the behaviour of many particle systems as a direct consequence of simple rules governing the interaction of individual particles. In this he has had some remarkable successes. In ergodic theory his work on hyperbolic systems, on billiards and the hard sphere gas has laid the foundation of many of the techniques presently used for proving that such systems are ergodic and for studying the finer statistical properties of their behaviour. He has influenced the general trend of ergodic theory away from the study of rather artificially constructed examples back to the problem which originally motivated the subject, namely the substantiation of\nBoltzmann\n's ergodic hypothesis.\nThe idea of applying the\nKolmogorov\ntheory of entropy to smooth dynamical systems was Sinai's. Previous work of the Russian school had studied entropy, as introduced by\nKolmogorov\n, entirely in the context of probabilistic systems. His results in this direction were new and unexpected. He investigated the class of dynamical systems with transversal foliations, now known as stable and unstable manifolds, and proved that all systems in this class were ergodic, mixing and K. Subsequently he introduced the idea of\nMarkov\npartitions and constructed such partitions for hyperbolic systems.\nSinai laid the foundations of the theory of billiards, for which he has more recently also constructed\nMarkov\npartitions, and of the motion of a hard sphere gas. He has made many contributions to statistical mechanics, in particular to the theory of phase transition. His book on this topic is well known. In recent years, Sinai has made important contributions to KAM theory using renormalisation methods. He is currently developing some entirely new and very interesting ideas in quantum chaos.\nIt is remarkable, given the depth and originality of Sinai's papers that he has been so productive. In\n[\n29\n]\nthere are\n386\npapers listed with Sinai as author or co-author. Yet Sinai finds writing papers the least interesting part of doing research. He considers it boring since he has already achieved his aim of solving the problem which he may have thought about for several years and spent periods in which everything else had to be put out of his mind.\nSinai has received many major awards, prizes and honours for his remarkable contributions. For example he has received the following medals and prizes: the\nBoltzmann\nGold Medal from the Commission on Statistical Physics of the International Union of Pure and Applied Physics\n(1986)\n; the Heineman Prize from the American Physical Society\n(1989)\n; the\nMarkov\nPrize from the\nUSSR Academy of Sciences\n(1990)\n; the\nDirac\nMedal from the Abdus Salam International Centre for Theoretical Physics in Trieste\n(1992)\n; the Wolf Prize in Mathematics\n(1997)\n; the Brazilian Award of Merits in Sciences\n(2000)\n; the Moser Prize from the Society for Industrial and Applied Mathematics\n(2001)\n; the Frederic Esser Nemmers Prize in Mathematics\n(2002)\n; the\nKolmogorov\nLecture and Medal, University of London\n(2007)\n; the\nLagrange\nPrize from the Institute for Scientific Interchange, Torino, Italy\n(2008)\n; the\nHenri Poincaré\nPrize from the International Association of Mathematical Physics\n(2009)\n; the Dobrushin International Prize from the Institute of Information Transmission of the\nUSSR Academy of Sciences\n(2009)\n, the Leroy P Steele Prize\n(2013)\n, the\nAbel\nPrize\n(2014)\n, and the\nMarcel Grossmann\nAward\n(2015)\n.\nHere are some extracts from the citations for these awards. The Wolf Prize\n(1997)\n[\n7\n]\n:-\nSinai received the prize for \"his fundamental contributions to mathematically rigorous methods in statistical mechanics and the ergodic theory of dynamical systems and their applications in physics.\" Sinai brings to bear on the problems of mathematical physics the powerful tools of dynamical systems and probability theory, often developing new tools for this purpose. He is generally recognized as the world leader in the mathematics of statistical physics. Working in the tradition of the\nKolmogorov\nschool, he first formulated the rigorous definition of the invariant entropy for an arbitrary measure-preserving map. His subsequent work covers areas from the ergodicity of the motion of billiards to spectral properties of quasi-periodic\nSchrödinger\noperators. Statistical mechanics is one of the most active and rewarding areas of modern mathematics, and Yakov Sinai is its recognised leader today.\nThe\n2002\nFrederic Esser Nemmers Prize in Mathematics\n[\n20\n]\n:-\nHis work has revolutionised the study of dynamical systems and influenced statistical mechanics, probability theory and statistical physics.\nThe\nHenri Poincaré\nPrize\n(2009)\nwas awarded to Sinai:-\n... for his ground-breaking works concerning dynamical entropy, ergodic theory, chaotic dynamical systems, microscopic theory of phase transitions, and time evolution in statistical mechanics.\nThe Leroy P Steele Prize for Lifetime Achievement was presented to Sinai on Thursday,\n10\nJanuary\n2013\n, at the joint meeting of the\nAmerican Mathematical Society\nand the\nMathematical Association of America\nheld in San Diego. The Prize was awarded to Sinai for\n[\n26\n]\n:-\n... his pivotal role in shaping the theory of dynamical systems and for his ground-breaking contributions to ergodic theory, probability theory, statistical mechanics, and mathematical physics.\nThe Citation states:-\nSinai's research exhibits a unique combination of brilliant analytic technique, outstanding geometric intuition, and profound understanding of underlying physical phenomena. His work highlights deep and unexpected connections between dynamical systems and statistical mechanics. ... In the past fifteen years Sinai has brought novel tools and insights from dynamical systems and mathematical physics to statistical hydrodynamics, obtaining new results for the\nNavier\n-\nStokes\nsystems. Specifically, along with D Li, Sinai devised a new renormalisation scheme which allows the proof of existence of finite time singularities for complex solutions of the\nNavier\n-\nStokes\nsystem in dimension three. Sinai's mathematical influence is overwhelming. During the past half-century he has written more than\n250\nresearch papers and a number of books. Sinai's famous monograph, 'Ergodic Theory'\n(\nwith Cornfeld and Fomin\n)\n, has been an introduction to the subject for several generations, and it remains a classic.\nIn\n2014\nSinai was awarded, what many would say is the most prestigious mathematical prize of all, namely the\nAbel\nPrize for his\n[\n1\n]\n:-\n... fundamental contributions to dynamical systems, ergodic theory, and mathematical physics.\nThe citation for the award ends with the words\n[\n28\n]\n:-\nSinai has trained and influenced a generation of leading specialists in his research fields. Much of his research has become a standard toolbox for mathematical physicists. His works had and continue to have a broad and profound impact on mathematics and physics, as well as on the ever-fruitful interaction of these two fields.\nStein Arne Nistad gives an interesting description of the award ceremony\n[\n32\n]\n:-\nWhen Yakov Sinai entered the university Aula in Oslo to receive this year's\nAbel\nPrize, an award as rare and prestigious as a Nobel Prize in physics or medicine, the gathering of dignitaries and great minds was one of the smartest likely to attend an event in the Norwegian capital this year. On the walls, eleven monumental murals by Norwegian artist Edvard Munch illuminated the vast hall with images of northern light and the ages of man. The audience included academics from home and abroad, national and international press, and a broad selection of people all with an above-average interest in the field of mathematics. The musicians entered the scene and the youthful Crown Prince Haakon, representing his father, handed over the beautiful and weighty\nAbel\nprize almost deferentially to the slightly stooped, academic giant.\nAs part of the\nAbel\nPrize presentation, Arne B Sletsjøe wrote four elementary articles which illustrate ideas introduced by Yakov Sinai, which you can see at\nTHIS LINK\n.\nIn\n2015\nSinai received the\nMarcel Grossmann\nAward\n[\n10\n]\n:-\n... for applying the mathematics of chaotic systems to physics and cosmology.\nThe Citation stresses his contributions relevant to the relativistic astrophysics community\n[\n10\n]\n:-\nParticularly noteworthy for the general relativity community are his fundamental results on the stochastic nature of early cosmology obtained in his pioneering\n1983\npaper in collaboration with\nE M Lifshitz\n, I M Khalatnikov, K M Khanin, and L N Shchur.\nLandau\nhad designated the problem of the initial cosmological singularity as one of the three fundamental problems of theoretical physics and the members of his school V Belinski, I Khalatnikov and\nE Lifshitz\nthen found the general cosmological solution near a big bang or big crunch singularity in a series of papers from\n1969\ninto the\n1970\ns. This \"BKL solution\" gives rise to a chaotic dynamical system characterised by a positive\nKolmogorov\n-Sinai entropy. The chaotic behaviour of the higher-dimensional analogues of the BKL solution has also been deciphered by T Damour, M Henneaux and H Nicolai. The results of the\nKolmogorov\n-Sinai school have thus illuminated the stochastic nature of the BKL cosmological solution.\nLev Shchur, a leading computational physics researcher at the\nLandau\nInstitute, explained Sinai's involvement in this\n1983\npaper came about\n[\n33\n]\n:-\nOnce we were working on a problem in the now fashionable field of cosmology, and in the process of solving it a strong suspicion arose that the answer could be obtained precisely, and not just a numerical approximation. We called Sinai and shared our guesses. He thought for two minutes and said: \"if it can be solved, then only in this way.\" Two hours later the solution was ready. Among other things, this shows how well he can work in a team. When a young scientist approaches him at a seminar and talks about something, Sinai can easily answer: \"Are you doing this? I have ideas here too, let's do it together.\"\nMany mathematical societies and academies have elected Sinai to membership or honorary membership: the\nAmerican Academy of Arts and Sciences\n(1983)\n; the\nUSSR Academy of Sciences\n(1991)\n; the\nLondon Mathematical Society\n(1992)\n; the\nHungarian Academy of Sciences\n(1993)\n; the\nUnited States National Academy of Sciences\n(1999)\n; the\nBrazilian Academy of Sciences\n(2000)\n; the Academia Europaea\n(2008)\n; the\nRoyal Society of London\n(2009)\n;\nAmerican Mathematical Society\n, Fellow\n(2013)\n; and the\nNorwegian Academy of Science and Letters\n(2014)\n. He has received honorary degrees from: Warsaw University\n(1993)\n; Budapest University of Science and Technology\n(2002)\n; the Hebrew University in Jerusalem\n(2005)\n; and Warwick University\n(2010)\n.\nSinai has also been invited to give many prestigious lectures or lecture courses including: Loeb Lecturer, Harvard University\n(1978)\n; Plenary Speaker at the International Congress on Mathematical Physics in Berlin\n(1981)\n; Plenary Speaker at the International Congress on Mathematical Physics in Marseilles\n(1986)\n; Distinguished Lecturer, Israel\n(1989)\n;\nSolomon Lefschetz\nLectures, Mexico\n(1990)\n; Plenary Speaker at the International Congress of Mathematicians, Kyoto\n(1990)\n;\nLandau\nLectures, Hebrew University of Jerusalem\n(1993)\n; Plenary Speaker at the First Latin American Congress in Mathematics\n(2000)\n; Plenary Speaker at the\nAmerican Mathematical Society\nMeeting \"Challenges in Mathematics\"\n(2000)\n; Andreevski Lectures, Berlin, Germany\n(2001)\n; Bowen Lectures, University of California at Berkeley\n(2001)\n; Leonidas Alaoglu Memorial Lecture, California Institute of Technology\n(2002)\n;\nJoseph Fels Ritt\nLectures, Columbia University\n(2004)\n;\nLeonardo da Vinci\nLecture, Milan, Italy\n(2006)\n;\nGalileo\nChair, Pisa, Italy\n(2006)\n; John T Lewis Lecture Series, Dublin Institute for Advanced Studies and the\nHamilton\nMathematics Institute, Trinity College, Dublin, Ireland\n(2007)\n; and Milton Brockett Porter Lecture Series, Rice University, Houston, Texas\n(2007)\n.\nFor his seventieth birthday in\n2005\na special issue of the\nMoscow Mathematical Journal\nwas dedicated to Sinai:-\nYakov Grigorievich Sinai is one of the greatest mathematician of our days. The list of international prizes awarded to him as a sign of recognition of his scientific contributions is extremely long, the list of his fundamental results being even longer. His permanent interest in mathematics and his exceptional scientific enthusiasm inspires several generations of scientists all over the world. His mere presence at a seminar or at a conference makes scientific life brighter and more exciting.\nIn\n1956\nYakov Grigorievich Sinai married his fellow student Elena Bentsionovna Vul, daughter of the famous physicist Bentsion Moiseevich Vul\n(1903\n-\n1985)\nwho made a major contribution to the physics of semiconductors and dielectrics. Elena is a mathematician and physicist who has written a number of joint papers with her husband; seven are listed in\n[\n29\n]\n. They have one son.\nWhat are Sinai's interests outside mathematics? As a young boy, he was good at chess but preferred football and volleyball. Later he liked both downhill and cross-country skiing. He loved the outdoors and often went hiking and mountaineering.\nLet us end with some quotes from those who know him best. David Gabai, the Hughes-Rogers Professor of Mathematics at Princeton University, said after Sinai was awarded the\nAbel\nPrize\n[\n8\n]\n:-\nI believe Sinai is definitely one of the great mathematicians of the\n20\nth and\n21\nst centuries and certainly one of the most influential mathematicians. He's also been a tremendous influence to the young people who have worked underneath him. For\n50\nyears he's been producing\nstellar students.\nThe Dean for Research at Princeton University, Pablo Debenedetti, said\n[\n8\n]\n:-\nHe's widely considered to be one of the most influential mathematicians of the\n20\nth century and this prize is unquestionably one of the most prestigious in mathematics. It's a wonderful recognition of a wonderful career.\nTel Aviv University professor and\nErdős\nPrize winner Leonid Polterovich said\n[\n31\n]\n:-\nI was not very surprised\n[\nSinai received the\nAbel\nPrize\n]\nbecause I always knew that he was on the top level. ... Like all professors at Moscow State University, Sinai did not have a personal office, but shared a small room with about ten other mathematicians. I would meet in Sinai's office with Sinai and the rest of his advisees; topics discussed by Sinai ranged from mathematical physics to geometry. Students got the opportunity to learn about each others' projects, which was pretty important because Sinai was a very broad scientist. ... Sinai's seminar served for us as a door into the scientific world. ... He was a handsome man in an excellent physical shape, so he was doing some sports, had impeccable manners and highly developed social skills. These features were combined with a kind, friendly and human approach to people.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}