{
  "nome_completo": "Israel Nathan Herstein",
  "nome_curto": "Yitz Herstein",
  "ano_nascimento": "1923",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herstein/",
  "lugar_nascimento": "Lublin, Poland",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Yitz Herstein\nwas named Yitzchak but known as 'Yitz' by his friends. This seems to contradict the name we have given above, namely Israel Nathan Herstein, and the fact that he appears as I N Herstein on all his publications. Yitzchak is the Hebrew version of Isaac but when he was in primary school his teachers called him Israel and he was known by that name ever since. His father, Jacob Herstein, was working in his native Poland as a leather cutter in a factory at the time when Yitz was born. However, he was a scholarly man who wanted a good education for his sons and, in\n1926\nhe emigrated to Canada where he settled in Winnipeg. Yitz's mother was Mindel Lichstein and he had a brother Chaim who was nine years his elder. In fact, like Yitz, Chaim was later not known by that name but called Harvey. Mindel and the two sons remained in Poland for two years after Jacob had emigrated, then the family were reunited in Winnipeg. Yitz had a younger sister, born in\n1930\n, but sadly she died aged two.\nJacob had emigrated to be able to give his family a better life, and most of all a better education. However, things were not easy for them in Canada and he grew up in the years of the Great Depression which began in\n1929\n. In fact Canada suffered badly through ten years of the Depression and Yitz grew up in a poor rough area of Winnipeg\n[\n3\n]\n:-\n... his later comment was that in that neighbourhood you either became a gangster or a college professor.\nHe studied at the University of Manitoba, receiving his B.A. in\n1945\n, then went to Toronto where he was awarded an M.A. from the University of Toronto in the following year. After his marriage to Marianne Deson, Herstein moved to Indiana University and received a Ph.D. in\n1948\nfor a thesis\nDivisor Algebras\nwritten under\nMax Zorn\n's supervision. He published a\n22\npage paper in the\nAmerican Journal of Mathematics\nin the following year with the same title as his thesis. He begins the paper with these words:-\nThe object of this paper is to characterise the divisor algebras of algebraic function fields of degree of transcendence one over algebraically-closed constant fields by a \"natural\" system of axioms.\nHerstein worked at the University of Kansas for two years as an Instructor, then at Ohio State University for a year before being appointed to Chicago in\n1951\n[\n3\n]\n:-\nBoth he and his wife found Chicago a very congenial city and determined that this is where they would settle.\nBefore being appointed to Chicago he had published papers such as\nA proof of a conjecture of Vandiver\n(1950)\n,\nOn a conjecture on simple groups\n(1950)\n, and\nGroup-rings as *-algebras\n(1950)\n. The first of these papers generalised the theorem of\nWedderburn\nthat shows that every finite division ring is commutative. The second paper proves a conjecture that the solubility of\ngroups\nof odd order is equivalent to a condition on the group ring of a group, while the third paper takes methods from the study of\nBanach\nrings and topological groups to prove results about group rings over the complex numbers.\nIn Chicago, Herstein was influenced by\nAbraham Albert\n. During this time he worked on a topic which was to be one of the main themes of his work, namely on conditions on a ring which imply commutativity. For example he worked on conditions of the type\nx\nn\n=\nx\nx^{n} = x\nx\nn\n=\nx\nfirst studied by\nNathan Jacobson\nin\n1945\n. His first paper on this topic was\nA generalization of a theorem of Jacobson\n(1951)\nin which he proved the following theorem:-\nIf\nR\nR\nR\nis a ring with centre\nC\nC\nC\n, and if\nx\nn\n−\nx\nx^{n} - x\nx\nn\n−\nx\nis in\nC\nC\nC\nfor all\nx\nx\nx\nin\nR\n,\nn\nR, n\nR\n,\nn\na fixed integer larger than\n1\n, then\nR\nR\nR\nis commutative.\nHis appointment as Assistant Professor at Chicago was in Mathematics and Economics and Herstein published some papers relating to economics while holding the post. From example\nComments on Solow's \"Structure of linear models\"\n(1952)\nand\nSome mathematical methods and techniques in economics\n(1953)\n. Kuhn, reviewing this\n1953\npaper, writes:-\nThis paper performs the useful service of presenting some aspects of pure mathematics being applied currently to problems in economics. Among the methods and problems discussed in some detail are a derivation of the\nSlutsky\nequation via the calculus, a problem in Welfare Economics treated by the theory of convex sets, matrix theory as applied to international trade, and a game-theoretical approach to the personnel assignment problem. Many other subjects are touched lightly and cited in an interesting bibliography.\nHe was appointed to the University of Pennsylvania in\n1953\n[\n3\n]\n:-\n... at that time grants were scarce, so with two of his colleagues he organised a team to appear on a radio quiz show. Each win brought in $\n25\nand a long string of wins enabled them to build up a fund to pay for seminar speakers.\nHe left Pennsylvania in\n1957\nwhen appointed to Cornell where he was promoted to Professor in\n1958\n. Awarded a Guggenheim Fellowship in\n1960\n, he spent a year in Rome. He returned to Chicago in\n1962\nand remained there for the rest of his life.\nA A Albert\nwas chairman of the Mathematics Department at Chicago and had been desperate to bring Herstein back there.  Nancy Albert writes\n[\n2\n]\n:-\nIn June\n1961\n[\nAlbert\n]\nsought to secure the outstanding algebraist I N Herstein to fill the vacancy of Otto Schilling, who was leaving for an appointment at Purdue University. Adrian wrote a letter to \"Dear Colleagues\". In it, he described two letters that he was preparing to send the Dean. \"In one I have recorded the vote for Herstein's appointment as unanimous and recommending his appointment ... The other is my letter of resignation as Chairman of the Department. ... It is up to you to decide which letter I will send\". Adrian's strategy succeeded. The faculty approved Herstein's appointment.\nIn addition to work on rings and algebras Herstein also worked on groups and fields. In particular he examined finite subgroups of a division ring. In\n[\n3\n]\n115\npublications on these topics are listed.\nHerstein is perhaps best known for his beautifully written algebra texts, especially the undergraduate text\nTopics in algebra\n(1964)\n. Other algebra books included a more advanced ring theory book\nNoncommutative rings\n(1968)\nand\nTopics in ring theory\n(1969)\n. At a more elementary level he published\nMatters mathematical\nwith\nIrving Kaplansky\nin\n1978\n. A book which he worked on in the last two years of his life was\nAbstract algebra\n(1986)\n. Much of his own research is put into context in his book\nRings with involution\n(1976)\n. Let us now record some comments on these famous texts. Allow me\n[\nEFR\n]\nto make a personal comment on\nTopics in algebra\n. I purchased the book in the year in which it was published. It was such a joy to read the book: the ideas are so clearly laid out, and the author's enthusiasm coming through throughout. Frederick Hoffman writes twenty years after the book was first published:-\n\"Topics in algebra\" is a beautiful book, which captured a large market, and became the text for almost everyone's ideal undergraduate course, in addition to making its author's name an adjective for graduate qualifying-exam-level algebra at many institutions. If one approached \"Topics in algebra\" in a manner consistent with its author's approach to the undergraduate course, that is, that the precise material covered, and the amount of it, was not as important as the way it was covered, then the book could be used almost anywhere, with the number of pages covered and percent of problems done a function of the audience and the instructor. The charm of the writing, and the wonderful exercises help it retain its position with many of us.\nYou can see Herstein's Preface to\nTopics in algebra\nat\nTHIS LINK\n.\nNoncommutative rings\nappeared in\nThe Carus Mathematical Monographs\nseries published by\nThe Mathematical Association of America\n. W S Martindale, III, reviewing the book, first explains the background to the book:-\nThis colourful and informative book on noncommutative ring theory is based on a series of expository lectures given by the author in the summer of\n1965\nat Bowdoin College before an audience of teachers from colleges and small universities. These lectures were in turn based to a large extent on the author's\n1961\nand\n1965\nUniversity of Chicago notes on ring theory.\nHe ends his review by writing:-\nThe spirit of the Carus Monograph series is clearly embodied in this moving and excellently written account of important aspects of classical and modern ring theory. The book will undoubtedly be a popular one for a wide class of mathematicians and students.\nTopics in Ring Theory\nwas based on lectures Herstein gave at the University of Chicago and first published in the University of Chicago Mathematics Lecture Notes series. The book largely concerns Herstein's work on\nLie\nand\nJordan\nstructure of simple associative rings which he published in various papers in the early\n1950\ns.\nMatters mathematical\nby Herstein and\nKaplansky\nis an interesting book, based on a course designed to introduce students who were not specialising in mathematics. However, they expanded the material so as to produce a book designed as an introduction to mathematics students, especially for future teachers. B Artmann writes that:-\n... the reviewer wishes to stress that he thinks that the authors have succeeded very well in creating an adequate picture of mathematics for their audience, and that the topics chosen are optimal for their intentions.\nHerstein supervised\n30\nresearch students. One said of him:-\nHe was someone of great warmth who took an intense personal interest in his students and had a knack of getting them to believe in themselves.\nIn\n[\n1\n]\n, Faith makes some interesting comments about Herstein:-\nIsrael Nathan Herstein preferred to be called Yitz. While at Purdue I met Yitz at the frequent mathematical meetings that took place at the University of Chicago. Often Yitz would take us to Mama Luigi's for a late dinner, where we talked for hours. He had a love for Italian food and Italy - we always managed to end up Italian: Dimaggio's in San Francisco, Valerio's in Cincinnati, Otello in Rome, Sardis or Manganaro's in New York, the \"Annex\" in Princeton.\n(\nYitz kept an automobile in storage in Rome for his frequent visits there - but he was equally at home in all of the world's great cities.\n)\n... Like many, many, mathematicians, I fell under the spell of his brilliance ...",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Topology"
  ]
}