{
  "nome_completo": "Zdzisław Jan Ewangeli Antoni Krygowski",
  "nome_curto": "Zdzisław Krygowski",
  "ano_nascimento": "1872",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krygowski/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Poznań, Poland",
  "biografia": "Zdzisław Krygowski\nwas the son of Antoni Kacper Krygowski\n(1824\n-\n1904)\nand Henryka Maciulska\n(1838\n-\n1901)\n. Antoni was born on\n5\nMay\n1824\nin Harta near Błażowa and became a professor of mathematics and physics teaching at Gymnasiums in Tarnopol, Tarnów and Lwów after which he became director of the Gymnasium in Wadowice from\n1876\nto\n1887\n. He married Henryka Maciulska and they had four sons: Tadeusz Stanisław Henryk Krygowski\n(1860\n-\n1915)\n; Kazimierz Maria Krygowski\n(1862\n-\n1918)\n; Stanisław Kostka Włodzimierz Krygowski\n(1868\n-\n1944)\n; and Zdzisław Jan Ewangeli Antoni Krygowski\n(1872\n-\n1955)\n, the subject of this biography. Before continuing with the biography of Zdzisław, let us look briefly at his three older brothers.\nTadeusz Krygowski was born in Zbaraż, near Tarnopol on\n3\nSeptember\n1860\n. He became a medical doctor with a medical practice in Lwów. Interestingly, he was an expert on Polish carpets and published the article\nPolenteppiche\nwhich appeared in\nOrientalisches Archiv\n3\n(1911\n-\n1912)\n. Kazimierz Krygowski was born on\n8\nSeptember\n1862\nin Tarnopol. He studied law in Lwów and became a leading attorney. Stanisław Krygowski was born on\n21\nNovember\n1868\nin Tarnów and became an attorney in Kraków. His son, Władysław Maria Antoni Krygowski\n(1906\n-\n1998)\nmarried the mathematician\nZofia Czarkowska\nwho has a biography in this archive. Let us now return to Zdzisław Krygowski's biography.\nZdzisław began his secondary schooling at the gymnasium in Wadowice, where his father was the principal, studying there from\n1882\nto\n1887\n. He attended this gymnasium for four years, then went to Kraków where he attended the Jan III Sobieski Gymnasium from\n1887\nto\n1890\n. This school had been founded in\n1883\nto celebrate the bicentenary of King Jan III Sobieski's victory over the Ottoman forces at the Battle of Vienna. Zdzisław passed his matriculation examination in\n1890\nand later that year entered the Faculty of Philosophy of the Jagiellonian University of Kraków.\nAt the Jagiellonian University, Krygowski studied mathematics, physics and astronomy. He was taught mathematics by Marian Alexander Baraniecki\n(1848\n-\n1895)\n, Ludwik Antoni Birkenmajer\n(1855\n-\n1929)\nand Franciszek Michał Karliński\n(1830\n-\n1906)\n. Marian Baraniecki had graduated from the University of Warsaw, then studied at the Jagiellonian University, Leipzig University, and then in St Petersburg and Moscow before being appointed to the Jagiellonian University in\n1885\n. He taught the theory of determinants, algebraic equations, geometry and number theory. Michał Karliński had been appointed to the Chair of Astronomy and Mathematics at the Jagiellonian University in\n1862\n. He gave mathematics lectures on classical calculus, the calculus of variation, probability and mathematical geography. Ludwik Birkenmajer gave lectures on the history of mathematics. Krygowski was taught physics by Karol Stanisław Olszewski\n(1846\n-\n1915)\n, August Wiktor Witkowski\n(1854\n-\n1913)\nand Władysław Natanson\n(1864\n-\n1937)\n. Olszewski had studied at the Jagiellonian University and at Heidelberg University where he was awarded a doctorate in\n1872\n. He was the first scientist to liquify oxygen and nitrogen in\n1883\n. August Witkowski had studied mathematics and physics at Lwów University\n(\nnow Lviv\n)\nbefore continuing his studies under\nGustav Kirchhoff\nand then\nLord Kelvin\n. He had been appointed to the Department of Physics at the Jagiellonian University in\n1888\n. Władysław Natanson had studied at St Petersburg, Cambridge and Glasgow before obtaining a doctorate from Dorpat University. He was appointed to Theoretical Physics at the Jagiellonian University in\n1891\n.\nKrygowski had been awarded a scholarship to study astronomy at the Jagiellonian University so for the years\n1890\n-\n1893\nhe worked under the supervision of Michał Karliński at the Astronomical Observatory in Kraków. He took a full part in student life\n[\n13\n]\n:-\nOn\n3\nDecember\n1893\n, the so-called Preliminary Assembly of the students of mathematics and physics at the Faculty of Philosophy of the Jagiellonian University took place. Twenty students took part in this assembly. Among others, there were: Z Krygowski, T Łopuszański, W Zajączkowski and Tobiczyk. At this assembly, its participants decided to establish the Mathematics and Physics Circle of Students of the Jagiellonian University. ... Z Krygowski, T Łopuszański and probably Tobiczyk had been members of the committee convening the Preliminary Assembly. ... At the beginning, Z Krygowski read the agenda of the assembly prepared by the Committee Convening the Preliminary Assembly. ... After reading the agenda, T Łopuszański called on the gathered students to elect the chairman of the meeting. Tobiczyk proposed the candidacy of Z Krygowski with a motion to accept this candidacy by acclamation. Tobiczyk's motion was accepted and Krygowski took over the chairmanship of the meeting.\nDuring this meeting Krygowski was elected chairman of the Circle. Ordinary meetings were held on Sundays, at least once every two weeks. Lectures at these meeting were given mainly by students but some professors also give lectures. Krygowski gave the lecture\nIntroduction to the theory of equilibrium figures\nto the first ordinary meeting and he was the most frequent speaker over the first years. He was also the main driving force of the Circle's activity over these years.\nWhile he was still an undergraduate, Krygowski published his first paper\nOn some class of transcendental functions and their expansions in Fourier series\n(\nPolish\n)\nin the journal\nPrace matematyczno-fizyczne\nin\n1894\n. In\n1895\nKrygowski passed the examinations to become a secondary school teacher of mathematics and physics. Later that year, on\n13\nNovember\n1895\n, he was awarded his doctorate having submitted the thesis\nOn the theory of Green's general theorems\n.\nIn December\n1895\nthe Senate of the Jagiellonian University awarded Krygowski a scholarship so that he could continue his studies abroad. He went first to Germany where he spent a semester at the University of Berlin attending lectures and seminars with\nLazarus Immanuel Fuchs\nand\nHermann Amandus Schwarz\nwho officially supervised his studies. He then spent four semesters in\n1896\n-\n1898\nat the Faculté des Sciences in Paris where his studies were supervised by\nPaul Émile Appell\nand\nÉmile Picard\n. In fact\nÉmile Picard\nbecame a close friend and collaborator over many years. Of course, during the time that Krygowski spent in Paris there were many world leading mathematicians lecturing there and, in addition to lectures by\nPaul Appell\nand\nÉmile Picard\n, he attended lectures by, among others,\nÉmile Borel\n,\nGaston Darboux\n,\nCharles Hermite\n,\nCamille Jordan\nand\nHenri Poincaré\n. The authors of\n[\n11\n]\nwrite:-\nThe contacts with these excellent mathematicians of that time determined Krygowski's research interests: analytic functions, including elliptic and hyperelliptic functions in particular.\nWhile studying in Paris, Krygowski published the paper\nSur les fonctions à espaces lacunaires\nⓉ\n(\nOn functions on lacunar spaces\n)\nin the\nBulletin\nof the French Mathematical Society in\n1897\n. The paper begins:-\nLet us consider a countable set P of points, all located in a domain D of the complex variable z. This set P must be everywhere condensed in D and can be formed by the rational, algebraic points of this domain, or even by means of the countable and everywhere condensed sets of algebraic and transcendental points. To obtain the expression of a uniform and continuous function, for which the domain D is a lacunar space, it is first necessary to know the general expression of such a set for the domain D and then to proceed, as indicated by M\nPoincaré\nin his Memoir: On functions with lacunar spaces.\nReturning to Kraków, Krygowski was appointed as a teacher of mathematics and physics at the Higher Real School in August\n1898\n. During the years\n1899\n-\n1901\nhe was a teacher of mathematics and physics at the Imperial-Royal Gymnasium No\n1\nin Przemyśl about\n240\nkm east of Kraków and\n90\nkm west of Lwów. During this time while teaching in schools, he published two further papers, both in Polish,\nOn the theory of analytic functions\n(1899)\nand\nOn some application of the theta function\n(1900)\n. In\n1901\nhe left Przemyśl and moved to Lwów where he was appointed associate professor of higher mathematics at the Faculty of Chemistry and Architecture of the Technical University of Lwów and had a second position as a teacher of mathematics and physics at the Lwów Higher Real School. He arranged leave from these posts in\n1906\n-\n07\nwhen he went to Paris to work on his\nhabilitation\nthesis. Returning to Lwów, he habilitated with the thesis\nSur le développement des fonctions hyperelliptiques en séries trigonométriques\nⓉ\n(\nOn the development of hyperelliptic functions in trigonometric series\n)\nin\n1908\nand was appointed as an associate professor of mathematics at the Polytechnic University of Lwów on\n31\nOctober\n1908\n.\nStanisław Kępiński\n(1867\n-\n1908)\nhad obtained his habilitation at the Jagiellonian University having submitted the dissertation \"On integrals of the solution of ordinary linear homogeneous differential equations of the second order\" and was appointed as an assistant professor of mathematics in\n1892\n. In\n1899\nhe took over the chair of mathematics at the Lwów Polytechnic following the death of professor Władysław Zajączkowski. Kępiński served as dean of the Faculty of Engineering of the Polytechnic in the years\n1902\n-\n03\n,\n1905\n-\n06\n, and\n1907\n-\n08\nand as rector of the Lwów Polytechnic in\n1903\n-\n04\n. His heath was poor and he went to Zakopane in an attempt to recover but committed suicide there on\n25\nMarch\n1908\n. Two months after being appointed as an associate professor of mathematics at the Polytechnic University, Krygowski was appointed to the chair of the Department of Mathematics on\n13\nDecember\n1908\n, filling the position which had become vacant on the death of Kępiński. On\n1\nDecember\n1909\nhe was made a full professor.\nThe International Congress of Mathematicians was held in Cambridge, England from\n22\nAugust to\n28\nAugust\n1912\n. Krygowski was one of the\n574\nfull members of the Congress and had accommodation in King's College, Cambridge. We learn a little of what he did after the Congress from the article\nNewtoniana: Woolsthorpe i Grantham\nⓉ\n(\nNewtoniana: Woolsthorpe and Grantham\n)\nwhich he published in\nWiadomości matematycznych\nin\n1913\n. An English translation of the beginning of the article follows:-\nAlready last year,\n1912\n, after the closing of the Mathematical Congress at Cambridge, I decided to visit two places closely associated with\nNewton\n, namely Woolsthorpe and Grantham. The former is\nNewton\n's birth place, and the latter is where the young Newton attended high school. Both these places, Grantham and Woolsthorpe, are situated in the county of Lincoln, the former on the London-York line, the latter seven and a half miles south-west of Grantham. On my journey north I stopped twice there and back at Grantham; unfortunately, owing to the lack of a railway connection with Woolsthorpe and the incessant rain, my intention of visiting Woolsthorpe last year came to nothing. This year, taking my leave of another stay in England, I went to Grantham in early September; then, on foot, I made a trip to the village of Colterworth and its hamlet of Woolsthorpe, where\nNewton\n's family home still stands. I would like to share my impressions from this trip to Grantham and Woolsthorpe with the readers of \"Wiadomości matematycznych\".\nAfter a two-hour express train ride from King's Cross Station in London, we arrive in the old town of Grantham. Even from a distance, the towering,\n285\n-foot-high tower of the parish church, the centre of the entire town, attracts attention. This church, dating back to the thirteenth century, and the grammar school next door, known as King Edward VI School, or King's School for short, are certainly the most interesting monuments; it is also toward them that the tourist is most often drawn, especially when it comes to\nNewton\n. From the station, we get to London Road and St Peter's Hill Square in front of the Guildhall, where the monument to Sir\nIsaac Newton\nstands.\nKrygowski married the English girl Rose New\n(1875\n-\n1949)\nin\n1913\n. She was born in Christchurch, Hampshire, England on\n24\nJuly\n1875\n, the daughter of the lawyer Joseph New and his wife Jane. We conjecture that Krygowski met Rose, who was working as a shop assistant in Southampton in\n1911\n, during his\n1912\nvisit to England. She must have been the reason he returned to England in\n1913\n, for they married in Fulham, London, in the summer of that year. Zdzisław and Rose had a daughter Eileen Alina Krygowska, born\n4\nMay\n1914\n. Her birth was registered in Christchurch, Hampshire, England. Eileen studied philology at the University of Poznań and, having received a scholarship from the Culture Fund, she went to study at the University of London. In the years\n1938\n-\n1939\nshe was a student of the Department of English Literature but when World War II broke out she took British citizenship and worked for the Polish Government in London. She married Jerzy Korczyński, a doctor of law and economics of the Jagiellonian University in Kraków, in Harrow, England in\n1948\n. They both worked at Radio Free Europe and Eileen Korczyńska was the personal secretary of the director of Radio Free Europe from\n1952\nto\n1973\n.\nDuring World War I, Lwów was occupied by the Russians in September\n1914\nbut was retaken by Austria-Hungary in June\n1915\n. Krygowski worked at Lwów Polytechnic during the war serving as dean during\n1913\n-\n15\nand as rector of the Polytechnic during\n1917\n-\n18\n. After World War I ended, Poland became an independent country in November\n1918\n. Poznań had a Jesuit College from the\n16\nth Century which had university status. It had no university during the years of partition, but following Poland regaining its independence, the University of Poznań was established on\n7\nMay\n1919\n. Krygowski was offered a full professorship and a chair of mathematics in the newly founded university which he accepted\n[\n11\n]\n:-\nProfessor Zdzisław Krygowski determined the development of mathematics at the University of Poznań from\n1919\nto\n1938\n. He was also appointed to important posts: he was elected Deputy Rector of the University of Poznań in\n1919\n-\n20\nand\n1934\n-\n1936\n, and Dean of the Faculty of Philosophy in\n1921\n-\n22\n. In the interwar period, Professor Zdzisław Krygowski was a well-known Polish mathematician, he headed the\nPolish Mathematical Society\nin\n1926\n, he was also the Head of the Lwów Branch and the long-term Head of the Poznań Branch of this Society. In\n1919\n, he was appointed Vice-Chairman of the first National Examination Committee for Candidates to Secondary School Teachers in Poznań. He acted as the Vice-Chairman of this Committee for many years.\nKrygowski had a reputation as an inspiring lecturer who was greatly respected by the students. Helena Smoluchowska Majchrowiczowa was one of his students from\n1920\nto\n1925\nand she wrote\n[\n27\n]\n:-\nWhen I studied, the lectures in mathematics were conducted by: Professor Zdzisław Krygowski\n(\nfunction theory, differential and integral calculus, differential equations, integral equations, selected topics in analysis\n)\n... Professor Krygowski was the most important lecturer. ... his lectures were wonderful, clear and very interesting to listen to. They were easy to understand thanks to clear writing on large boards in the seminar room and excellent hand-made pictures. ... The Professor was both respected and feared by students. Some students were shaking when they were asked to write something on the blackboard and the Professor hated unclear handwriting.\nPerhaps the lectures for which Krygowski is most famous were given during a cryptology course which led to three of his students,\nJerzy Witold Rozycki\n,\nMarian Adam Rejewski\nand\nHenryk Michal Zygalski\nbreaking the German Enigma code. Let us give some details.\nPoland had monitored German and Russian radio messages from at least\n1918\nonwards. The importance of decoding these messages was clear since it allowed them to be aware of secret German rearmament and joint German-Russian military cooperation. The Germans had begun to develop the Enigma machine from around\n1919\nand it became the coding method for the German navy from\n1926\n. The Poles began intercepting German army radio messages in this new cipher from July\n1928\nand immediately the Polish General Staff, who ran Section II\n(\nthe Intelligence Section\n)\n, decided that new ideas were required to beak these codes. They decided to collaborate with Krygowski in putting on a cryptology course for selected students at Poznań University. This university was chosen as the place to put on the course since there were good quality students there and, a vital requirement, many had been educated in German speaking schools so were equally fluent in both German and Polish. Students had to be German speaking but loyal citizens of the Polish state. Only mathematics students were to take the course but they also had to possess qualities such as intuition, meticulousness, patience, and orderliness. The course was not put on in the university building but it was held in the evenings, twice a week, at the newly set up Cipher Bureau in a near-by military facility. Krygowski taught twenty selected students combinatorics and probability theory as well as techniques of cryptanalysis. The three most successful students,\nJerzy Rozycki\n,\nMarian Rejewski\nand\nHenryk Zygalski\nwere transferred to Warsaw where they did extremely valuable work decoding Enigma.\nRejewski\nwrote many years later\n[\n21\n]\n:-\nThere seems to be a lot of fuss around our breaking of the Enigma. Yet, we did not do anything but applied the knowledge which as first year students, we had learned from Krygowski and\nAbramowicz\n.\nWhile in Poznań, Krygowski did outstanding work in building up mathematics at the university, with his teaching, his research and increasing both the numbers and quality of the students. Not only, however, did he have a passion for mathematics but he was also passionate about art and music. He played the piano to a high standard and he became a leading expert on both the life and music of the Polish composer Chopin. He wrote articles about Chopin which he published in the\nKurier Poznański\n, a Polish daily news and political newspaper founded in Poznań in\n1872\n. For example he wrote\n(\nin Polish\n)\n:\nDispute on Chopin's origin\n(1926)\n;\nDiscovery of Chopin's Ancestors\n(1926)\n;\nFurther information about Chopin's family\n(1927)\n;\nEdward Ganche and his collection of Chopin memorabilia\n(1927)\n;\nThe Chopin Museum on the Island of Mallorca\n(1928)\n; and\nChopin in Majorca\n(1928)\n.\nIn\n1937\nWładysław Orlicz\nwas appointed as a professor at Poznań and, in the following year, Krygowski retired having reached the age of\n65\n. He had received many awards for his outstanding contributions, such as the French Palmes Académiques with class Officier d'Académie\n(1923)\n; the Polish Medal\n10\nth anniversary of regaining independence\n(1929)\n; the Order of Polonia Restituta, Commander's Cross with Star\n(1936)\n; the French Ordre National de la Légion d'Honneur\n(\ngrade d'officier\n)\n(1936)\n.\nBut for World War II, Krygowski would surely have spent a quiet retirement in Poznań, continuing to undertake research and involve himself in mathematics in that city.\nJózef Marcinkiewicz\nwas to become his successor in the Chair of Mathematics at Poznań but this did not happen since the outbreak of war closed the university and\nMarcinkiewicz\nwas murdered by the occupying German forces. In December\n1939\nall Krygowski's property in Poznań was destroyed including his library of around\n3000\nbooks. He moved to Kraków where he spent the war years in very difficult circumstances, forced to give private lessons to earn enough to live. When the war ended in\n1945\nhe began teaching at Kraków Polytechnic.\nOrlicz\nhad also been forced to leave Poznań in\n1939\nand had spent the war in Lwów. He returned to Poznań when the university there reopened in\n1945\n. He brought some staff with him from Lwów but he did not have enough staff to offer a full mathematics programme and he asked Krygowski, who was\n73\nat the time, if he would return to Poznań and teach some courses. He did return to Poznań and taught courses on higher algebra, differential geometry and the theory of analytic functions. Julian Musielak, who became his assistant in\n1949\n, wrote\n[\n11\n]\n:-\nKrygowski did not give regular lectures involving presentation of topics included in the syllabus. Students were to read about these topics individually. Krygowski focused on individual issues, describing them in much detail and focusing on motivation and on the significance of particular issues to the field of mathematics and its applications. Students were much impressed by his wide knowledge, not only related to mathematics, and digressions about the lives of scientists.\nKrygowski's wife Rose died in\n1949\nand he continued to live in Poznań in university accommodation. He worked almost to the end of his life in\n1955\n, taking a holiday in Zakopane each summer when his health was sufficiently good. Following his death on\n10\nAugust\n1955\n, he was buried on\n13\nAugust in the Sołacki Cemetery in Poznań.\nLet us end with a quote from\n[\n28\n]\n:-\nMathematics was created in Poznań, just as grain grows in the field. Zdzisław Krygowski was a ploughman, and the soil, although fallow, was well cultivated by him. After him came\nWładysław Orlicz\n, who sowed the soil, and the grain he sowed was good.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}