{
  "nome_completo": "Abram Samoilovitch Besicovitch",
  "nome_curto": "Abram Samoilovitch Besicovitch",
  "ano_nascimento": "1891",
  "ano_morte": "1970",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Besicovitch/",
  "lugar_nascimento": "Berdyansk, Russian Empire (now Ukraine)",
  "lugar_morte": "Cambridge, England",
  "biografia": "Abram Samoilovitch Besicovitch\n's parents were Samuel and Eva Besicovitch who were Karaims both by race and religion. Samuel Besicovitch had been a jeweller but his jeweller's shop had hit hard times through theft and he gave up the business and became a cashier. It was a somewhat unusual family, Samuel being forty years of age and Eva being fifteen when they were married, but it was a close knit family who strongly supported each other. All the six children, four boys and two girls, were highly talented, with Abram Samoilovitch as the fourth in this family of six who would all excel in their studies at the University of St Petersburg. Eva Besicovitch married so young that she never had the opportunity of a proper education, but the children always felt that their mathematical talents came through her.\nBesicovitch showed remarkable mathematical talents at a young age and his father strongly encouraged him by demanding that he push himself to the limit in solving mathematical problems. He was taught by\nMarkov\nat the University of St Petersburg where he originally intended to work in mathematical logic but he changed topics to study analysis since the library was not good enough in the logic area. He graduated from St Petersburg in\n1912\nand, influenced by\nMarkov\n, published his first paper on\nprobability theory\n.\nIn\n1916\nBesicovitch married Valentina Vietalievna who was herself a mathematician and somewhat older than Besicovitch. This in itself presented problems since, as Valentina Vietalievna was of the Orthodox faith and Besicovitch was a Karaim, they were not allowed to marry. Besicovitch was accepted into the Russian Orthodox Church so that the marriage could take place.\nThe University of Perm opened in\n1916\nas a branch of the University of St Petersburg but political events in the country soon began to dominate all else. The Revolution of October\n1917\nbecame inevitable when Alexander Kerensky, the prime minister, sent troops to close down two Bolshevik newspapers. Lenin, who had been in hiding, made a public appearance telling the Bolsheviks to overthrow the Government. On the morning of October\n26\n, after hardly any bloodshed, Lenin proclaimed that the Soviets were in power. In\n1917\nthe University of Perm became an independent institution and in that year Besicovitch was appointed professor of mathematics there. Soon after this the Russian nation was plunged into civil war. The Red Army was formed in February\n1918\nwith Trotsky as its leader. The Reds opposed the White Army formed of anticommunists led by former imperial officers.\nFriedmann\n, who was one of Besicovitch's colleagues at the University of Perm, wrote on\n27\nApril\n1918\n:-\nPerm is surprisingly calm, and everything is done in the city in family fashion, in a good way, even the training of the Red army, which is\n30\n-\n40\nstrong.\nHowever, by\n20\nDecember\n1918\nthe situation had deteriorated:-\nPerm has come under an unlucky star. There is a rapid, overall and fairly chaotic evacuation. The University is in the second line of evacuation, but no transport or packing materials have been supplied so far, and the evacuation is at a standstill. ... I personally am not inclined to leave the city ...\nA week later the White Army occupied Perm. They controlled the town until August\n1919\nwhen the Red Army took control again. As the Red Army had approached, all the staff except Besicovitch had left the University.\nFriedmann\nwrote:-\nThe only person who kept his head and saved the remaining property was Besicovitch, who is apparently A A\nMarkov\n's disciple not only in mathematics but also with regard to resolute, precise definite actions.\nPerm suffered badly in the troubles of\n1919\ndespite the best efforts of Besicovitch to protect the books and other university property. In the following year, with the Civil war still raging, he accepted a chair at Petrograd University\n(\nSt Petersburg changed its name to Petrograd in\n1914\nand then to Leningrad in\n1924)\n. However, it was not easy for anyone teaching in the universities because of government policies. Besicovitch had to teach people without any educational background and he was very unhappy. He tried to find ways to leave.\nBesicovitch left Petrograd for Copenhagen in\n1924\nand there worked with\nHarald Bohr\n. He had been awarded a Rockefeller Fellowship but his applications for permission to work abroad had been refused. He escaped across the border with a colleague\nJ D Tamarkin\nunder the cover of darkness. He managed to reach Copenhagen where he was supported financially for a year with the Rockefeller Fellowship. His interest in almost periodic functions came about through this year spent working with\nHarald Bohr\n.\nAfter he visited Oxford in\n1925\nHardy\n, who quickly saw the mathematical genius in Besicovitch, found a post for him in Liverpool. He taught there during the session\n1926\n-\n27\nthen he moved to Cambridge. Besicovitch's wife had remained in Russia when he had escaped in\n1924\nand the marriage was dissolved in\n1928\n. Two years later Bessy, as he was known, married Valentina Alexandrovna, the sixteen year old daughter of a family he had befriended during the difficult time in Perm.\nAt Cambridge Besicovitch lectured on analysis in most years but he also gave an advanced course on a topic which was directly connected with his research interests such as almost periodic functions, Hausdorff measure, or the geometry of plane sets. One feature of his teaching is certainly worthy of mention, namely the weekly problem competition which he ran. This provided both enjoyment for the undergraduates but it also gave the better undergraduates the opportunity to improve their research skills by getting to grips with difficult problems. As\nBurkill\nwrites in\n[\n4\n]\n(\nsee also\n[\n7\n]\n)\n:-\nThe solutions submitted were carefully read and annotated by Besicovitch and the announcement \"Perfect solutions of Problem\n12\nwere sent in by M and N\" spurred several young mathematicians on to develop their analytic powers.\nIn\n1950\nhe succeeded\nLittlewood\nto the\nRouse Ball\nChair of mathematics at Cambridge. He held this chair until he retired in\n1958\n. For eight successive years following his retirement he visited different universities in the United States. He then returned to Trinity College, Cambridge, where he spent in total over\n40\nyears of his life.\nBefore looking at some of the highly original contributions which Besicovitch made to mathematics, we give S J Taylor's overview of his contributions\n[\n7\n]\n. It is worth noting that S J Taylor was one of Besicovitch's research students:-\nBesicovitch was an exceptionally open-minded mathematician, and it was this readiness to consider all possible alternatives which made his contributions to mathematics characteristically surprising. When solving a problem most mathematicians need to make a commitment as to the nature of the solution long before the solution has been found, and this commitment interposes a psychological barrier to the consideration of other possibilities. Besicovitch never seems to have been troubled in this way. He could exercise the whole of his powerful mathematical intellect on the investigation of unlikely options and in the process illuminated the diversity of mathematical knowledge and obtained results which were astounding to his contemporaries and are surprising today.\nHis work on sets of non-integer dimension was an early contribution to fractal geometry.\nHausdorff\n, in\n1918\n, had extended\nCarathéodory\n's theory of measure to sets having finite measure of non-integral order. Besicovitch, around\n1930\n, extended his density properties of sets to those of finite Hausdorff measure. Domb writes in\n[\n5\n]\n:-\n...\nHausdorff\nand Besicovitch\n[\nwere\n]\nthe two mathematical pioneers on whose work\nMandelbrot\n's development of fractals is based.\nKenneth Falconer, one of the leading experts on fractal geometry, seeing me\n[\nEFR\n]\nwriting this article commented:-\nBesicovitch was my inspiration!\nBesicovitch was famous for his work on almost periodic functions, his interest in which, as we mentioned above, came from his time in Copenhagen with\nHarald Bohr\n. In\n1932\nhe wrote an influential text\nAlmost periodic functions\ncovering his work in this area.\nOne of the achievements, with which he will always be associated, was his solution of the Kakeya problem on minimising areas. The problem had been posed in\n1917\nby a Japanese mathematician S Kakeya and asked what was the smallest area in which a line segment of unit length could be rotated through\n2\np\n2p\n2\np\n. Besicovitch proved in\n1925\nthat given any\nϵ\n\\epsilon\nϵ\n, an area of less than\nϵ\n\\epsilon\nϵ\ncould be found in which the rotation was possible. The figures that resulted from Besicovitch's construction were highly complicated, unbounded figures.\nOther areas on which Besicovitch worked included geometric measure theory, Hausdorff measure, real function theory, and complex function theory. In addition to this work on deep mathematical theories, Besicovitch loved problems, particularly those which could be stated in elementary terms but which proved resistant to attack. Often he showed that the \"obvious solution\" to certain problems is false. An example of such a problem is the Lion and the Man problem posed by\nRichard Rado\nin the mid\n1920\ns. The problem is:-\nA lion and a man in a closed arena have equal maximum speeds. What tactics should the lion employ to be sure of his meal?\nOf course, despite the colourful description, this problem was to be interpreted mathematically in the sense that the lion and the man were points in a circle. The solution generally accepted for this problem by around\n1950\nwas that however the man moved, the lion first aimed to get onto the line joining the man to the centre of the arena\n(\nwhich it could always achieve\n)\nand then keeping on this radius however the man moved, it would end up catching the man. Besicovitch showed that this was false and that the man had a path which meant that the lion would never catch him, although he would come arbitrarily close.\nIn\n[\n4\n]\nBurkill\ndescribes Besicovitch's work in these terms:-\nAt one time or another he shed new light on many aspects of the classical theory of real functions. He was more likely than anyone else to solve a problem which had seemed intractable, commonly the solution needed, by way of proof or counter-example, an ingenious and intricate construction. This work was more congenial to him than the abstract developments of, for example,\nfunctional analysis\n.\nBesicovitch received many honours for his work. He received the\nAdams\nPrize from the University of Cambridge in\n1930\nfor his work on almost periodic functions. He was elected a fellow of the\nRoyal Society\nin\n1934\n, and in\n1952\nreceived the\nSylvester\nMedal from that Society:-\n... in recognition of his outstanding work on almost-periodic functions, the theory of measure and integration and many other topics of the theory of functions.\nIn\n1950\nhe was awarded the\nDe Morgan\nMedal from the\nLondon Mathematical Society\n.\nBurkill\ndescribes his personal characteristics in\n[\n4\n]\nsaying:-\nHis intellectual gifts were matched by his generous sympathy which endeared him to pupils, colleagues and a wide circle of friends.\nIn\n[\n2\n]\nthis charming picture is drawn:-\nBesicovitch spoke tolerably good English in his first years in Britain in the\n1920\ns, but, perhaps on account of his marriage in\n1928\nto a Russian wife, his English remained that of a Russian. The definite article was superfluous for him, as in his dictum \"mathematician reputation rests on number of his bad proofs\" ... He was an enthusiastic teacher both of graduates and undergraduates, and was a \"character\" particularly in his later years, winning the affection both of mathematicians and of a wider circle."
}