{
  "nome_completo": "Abraham de Moivre",
  "nome_curto": "Abraham de Moivre",
  "ano_nascimento": "1667",
  "ano_morte": "1754",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Moivre/",
  "lugar_nascimento": "Vitry-le-François, Champagne, France",
  "lugar_morte": "London, England",
  "biografia": "Abraham de Moivre\nwas born in Vitry-le-François, which is about halfway between Paris and Nancy, where his father worked as a surgeon. The family was certainly not well off financially, but a steady income meant that they could not be described as poor. De Moivre's parents were Protestants but he first attended the Catholic school of the Christian Brothers in Vitry which was a tolerant school, particularly so given the religious tensions in France at this time. When he was eleven years old his parents sent him to the Protestant Academy at Sedan where he spent four years studying Greek under Du Rondel.\nThe Edict of Nantes had guaranteed freedom of worship in France since\n1598\nbut, although it made any extension of Protestant worship in France legally possible, it was much resented by the Roman Catholic clergy and by the local French parliaments. Despite the Edict, the Protestant Academy at Sedan was suppressed in\n1682\nand de Moivre, forced to move, then studied logic at Saumur until\n1684\n. Although mathematics was not a part of the course that he was studying, de Moivre read mathematics texts in his own time. In particular he read\nHuygens\n' treatise on games of chance\nDe ratiociniis in ludo aleae\nⓉ\n(\nReasoning in  gambling games\n)\n. By this time de Moivre's parents had gone to live in Paris so it was natural for him to go there. He continued his studies at the Collège de Harcourt where he took courses in physics and for the first time had formal mathematics training, taking private lessons from\nOzanam\n.\nReligious persecution of Protestants became very serious after Louis XIV revoked the Edict of Nantes in\n1685\n, leading to the expulsion of the Huguenots. At this time de Moivre was imprisoned for his religious beliefs in the priory of St Martin. It is unclear how long he was kept there, since Roman Catholic biographers indicate that soon after this he emigrated to England while his Protestant biographers say that he was imprisoned until\n27\nApril\n1688\nafter which he travelled to England. After arriving in London he became a private tutor of mathematics, visiting the pupils whom he taught and also teaching in the coffee houses of London.\nBy the time he arrived in London de Moivre was a competent mathematician with a good knowledge of many of the standard texts. However after he made a visit to the Earl of Devonshire, carrying with him a letter of introduction, he was shown\nNewton\n's\nPrincipia\n. He realised instantly that this was a work far deeper than those which he had studied and decided that he would have to read and understand this masterpiece. He purchased a copy, cut up the pages so that he could carry a few with him at all times, and as he travelled from one pupil to the next he read them. Although this was not the ideal environment in which to study the\nPrincipia\n, it is a mark of de Moivre's abilities that he was quickly able to master the difficult work. De Moivre had hoped for a chair of mathematics, but foreigners were at a disadvantage in England so although he now was free from religious discrimination, he still suffered discrimination as a Frenchman in England. We describe below some attempts to procure a chair for him.\nBy\n1692\nde Moivre had got to know\nHalley\n, who was at this time assistant secretary of the\nRoyal Society\n, and soon after that he met\nNewton\nand became friendly with him. His first mathematics paper arose from his study of fluxions in the\nPrincipia\nand in March\n1695\nHalley\ncommunicated this first paper\nMethod of fluxions\nto the\nRoyal Society\n. In\n1697\nhe was elected a fellow of the\nRoyal Society\n.\nIn\n1710\nde Moivre was appointed to the Commission set up by the\nRoyal Society\nto review the rival claims of\nNewton\nand\nLeibniz\nto be the discovers of the calculus. His appointment to this Commission was due to his friendship with\nNewton\n. The\nRoyal Society\nknew the answer it wanted! It is also interesting that de Moivre should be given this important position despite finding it impossible to gain a university post.\nDe Moivre pioneered the development of analytic geometry and the\ntheory of probability\n. He published\nThe Doctrine of Chances: A method of calculating the probability of events in play\nin\n1718\nalthough a Latin version had been presented to the\nRoyal Society\nand published in the\nPhilosophical Transactions\nin\n1711\n. In fact it was Francis Robartes, who later became the Earl of Radnor, who suggested to de Moivre that he present a broader picture of the principles of probability theory than those which had been presented by\nMontmort\nin\nEssay d'analyse sur les jeux de hazard\nⓉ\n(\nEssay on the analysis of games of chance\n)\n(1708)\n. Clearly this work by\nMontmort\nand that by\nHuygens\nwhich de Moivre had read while at Saumur, contained the problems which de Moivre attacked in his work and this led\nMontmort\nto enter into a dispute with de Moivre concerning originality and priority. Unlike the\nNewton\n-\nLeibniz\ndispute which de Moivre had judged, the argument with\nMontmort\nappears to have been settled amicably. The definition of statistical independence appears in this book together with many problems with dice and other games.\nIn fact\nThe Doctrine of Chances\nappeared in new expanded editions in\n1718\n,\n1738\nand\n1756\n. For example in\n[\n5\n]\nDupont looks at the \"jeu de rencontre\" first put forward by\nMontmort\nand generalised by de Moivre in Problems XXXIV and XXXV of the\n1738\nedition. Problem XXXIV reads as follows:-\nAny number of letters a, b, c, d, e, f, etc., all of them different, being taken promiscuously as it happens: to find the probability that some of them shall be found in their places according to the rank they obtain in the alphabet; and that others of them shall at the same time be displaced.\nProblem XXXV generalises Problem XXXIV by allowing each of the letters\na\n,\nb\n,\nc\n,\n.\n.\n.\na, b, c, ...\na\n,\nb\n,\nc\n,\n.\n.\n.\nto be repeated a certain number of times. The \"gamblers' ruin\" problem appears as Problem LXV in the\n1756\nedition. Dupont looks at this problem, and\nTodhunter\n's solution, in\n[\n6\n]\n. In fact in\nA history of the mathematical theory of probability\n(\nLondon,\n1865)\n,\nTodhunter\nsays that probability:-\n... owes more to\n[\nde Moivre\n]\nthan any other mathematician, with the single exception of\nLaplace\n.\nThe\n1756\nedition of\nThe Doctrine of Chances\ncontained what is probably de Moivre's most significant contribution to this area, namely the approximation to the binomial distribution by the normal distribution in the case of a large number of trials. De Moivre first published this result in a Latin pamphlet dated\n13\nNovember\n1733\n(\nsee\n[\n4\n]\nfor an interesting discussion\n)\naiming to improve on\nJacob Bernoulli\n's law of large numbers. The work contains\n[\n1\n]\n:-\n... the first occurrence of the normal probability integral. He even appears to have perceived, although he did not name, the parameter now called the standard deviation ...\nDe Moivre also investigated mortality statistics and the foundation of the theory of annuities. An innovative piece of work by\nHalley\nhad been the production of mortality tables, based on five years of data, for the city of Breslau which he published in\n1693\n. It was one of the earliest works to relate mortality and age in a population and was highly influential in the production of actuarial tables in life insurance. It is almost certain that de Moivre's friendship with\nHalley\nled to his interest in annuities and he published\nAnnuities on lives\nin\n1724\n. Later editions appeared in\n1743\n,\n1750\n,\n1752\nand\n1756\n. His contribution, based mostly on\nHalley\n's data, is important because of his\n[\n1\n]\n:-\n... derivation of formulas for annuities based on a postulated law of mortality and constant rates of interest on money. Here one finds the treatment of joint annuities on several lives, the inheritance of annuities, problems about the fair division of the costs of a tontine, and other contracts in which both age and interest on capital are relevant.\nIn\nMiscellanea Analytica\n(1730)\nappears\nStirling's formula\n(\nwrongly attributed to\nStirling\n)\nwhich de Moivre used in\n1733\nto derive the normal curve as an approximation to the binomial. In the second edition of the book in\n1738\nde Moivre gives credit to\nStirling\nfor an improvement to the formula. De Moivre wrote:-\nI desisted in proceeding farther till my worthy and learned friend Mr\nJames Stirling\n, who had applied after me to that inquiry,\n[\ndiscovered that c = √\n(2\nπ\n)]\n.\nDe Moivre is also remembered for his formula for\n(\ncos\n⁡\nx\n+\ni\nsin\n⁡\nx\n)\nn\n(\\cos x + i \\sin x)^{n}\n(\ncos\nx\n+\ni\nsin\nx\n)\nn\nwhich took trigonometry into analysis, and was important in the early development of the theory of complex numbers. It appears in this form in a paper which de Moivre published in\n1722\n, but a closely related formula had appeared in an earlier paper which de Moivre published in\n1707\n.\nDespite de Moivre's scientific eminence his main income was as a private tutor of mathematics and he died in poverty. Desperate to get a chair in Cambridge he begged\nJohann Bernoulli\nto persuade\nLeibniz\nto write supporting him. He did so in\n1710\nexplaining to\nLeibniz\nthat de Moivre was living a miserable life of poverty. Indeed\nLeibniz\nhad met de Moivre when he had been in London in\n1673\nand tried to obtain a professorship for de Moivre in Germany, but with no success. Even his influential English friends like\nNewton\nand\nHalley\ncould not help him obtain a university post. De Moivre\n[\n3\n]\n:-\n... was the intimate friend of\nNewton\n, who used to fetch him each evening, for philosophical discourse at his own house, from the coffee-house\n(\nprobably Slaughter's\n)\n, where he spent most of his time.\nIndeed de Moivre revised the Latin translation of\nNewton\n's\nOptics\nand dedicated\nThe Doctrine of Chances\nto him.\nNewton\nreturned the compliment by saying to those who questioned him on the\nPrincipia\n[\n1\n]\n:-\nGo to Mr De Moivre; he knows these things better than I do.\nClerke writes of his character in\n[\n3\n]\n:-\nHe was unmarried, and spent his closing years in peaceful study. Literature, ancient and modern, furnished his recreation; he once said that he would rather have been Molière than\nNewton\n; and he knew his works and those of Rabelais almost by heart. He continued all his life a steadfast Christian. After sight and hearing had successively failed, he was still capable of rapturous delight at his election as a foreign associate of the Paris\nAcademy of Sciences\non\n27\nJune\n1754\n.\nDe Moivre, like\nCardan\n, is famed for predicting the day of his own death. He found that he was sleeping\n15\nminutes longer each night and summing the\narithmetic progression\n, calculated that he would die on the day that he slept for\n24\nhours. He was right!"
}