{
  "nome_completo": "Abraham Markham Gelbart",
  "nome_curto": "Abraham Gelbart",
  "ano_nascimento": "1911",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gelbart/",
  "lugar_nascimento": "Paterson, New Jersey, USA",
  "lugar_morte": "Manhattan, New York, USA",
  "biografia": "Abraham Gelbart\nwas known to his friends and colleagues as Abe. In fact he wrote his mathematical papers under the name Abe Gelbart. His parents were Wolf and Pauline Gelbart, both of whom were born in Poland. Abe had a sister Frances, known as Fanny, who was also born in Paterson, New Jersey, two years before her brother. In the\n1940\ncensus, Abe's father is described as a weaver in a textile mill and his sister Fanny as a salesgirl in a Retail Department Store. He showed an interest in mathematics as he was growing up\n[\n3\n]\n:-\nGelbart showed an interest in mathematics and science from an early age, when his father read him newspaper accounts about\nEinstein\nand the theory of relativity.\nHowever, the family were quite poor so, in order to help out, Gelbart left high school at the age of\n14\nand took a job in New York. This did not dampen his interest in mathematics and he continued to study the subject on his own by reading mathematics books in the New York Public Library. While in the Public Library, he met\nJekutiel Ginsburg\n, who was chairman of the Mathematics Department at Yeshiva College. Yeshiva\nis a private university in New York City, founded in\n1886\n.\nGinsburg\n, who had been born in Russia and had come to the United States in\n1912\n, had been an assistant of the mathematics historian\nDavid E Smith\nbefore being appointed to Yeshiva College. He had founded\nScripta Mathematica\nwhich looked to publish on:-\n... the philosophy, history, and expository treatment of mathematics. ... the pages of the periodical will therefore be devoted chiefly to the history an philosophy of mathematics.\nGinsburg\n, who had an enthusiasm for teaching mathematics which few can have surpassed, was the ideal person to inspire the young man Gelbart who had no real formal mathematical education yet had a passion for the subject. In\n1934\nthe following problem appeared in the\nAmerican Mathematical Monthly\n:-\nA given ellipse moves in a plane so that it is always tangent to a fixed straight line at a given point. derive the equation of the locus of its centre.\nIn\n1935\na solution to this problem by Abe Gelbart, Student, Central High School, Paterson, New Jersey was published.\n[\nNote that Paterson Central High School was later renamed Dr Martin Luther King Jr School.\n]\nHe also proposed a problem of his own in the following volume:-\nOf all the lines through vertex A of triangle ABC, there is just one which meets BC in the point D such that the incircles of triangles ABD and ACD are equal. Show that this line AD may be constructed by ruler and compasses.\nNow, advised by\nGinsburg\n, Gelbart tried to gain admission to a university to study mathematics. His application was rejected by every American university that he tried on the grounds that he had no high school diploma. However, he had more luck with Canadian universities and he was offered a place to study for a Bachelor's Degree by Dalhousie University in Halifax, Nova Scotia. He was\n23\nyears old when he matriculated at Dalhousie, and nine years had passed since he left high school. He was awarded a Bachelor's Degree by Dalhousie in\n1938\nand was accepted for doctoral studies at the Massachusetts Institute of Technology.\nAt MIT, Gelbart undertook research advised by\nNorbert Wiener\n. He was awarded a Ph.D. in\n1940\nfor his\n26\n-page thesis\nOn the Growth Properties of a Function of Two Complex Variables Given by its Power Series Expansion.\nHe published the main results of his thesis in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1941\n. His introduction to this paper begins as follows:-\nOne of the most fundamental formulas in the theory of functions of one complex variable is the\nCauchy\nintegral formula. It is of particular value in the\nWeierstrass\n-\nHadamard\napproach, i.e., in obtaining properties of a function from the coefficients of its power series expansion. A similar formula cannot be obtained for functions of two complex variables for an arbitrary four-dimensional domain, as is obtained, for instance, for the bicylinder, where the integration is taken over a two-dimensional surface on the boundary.\nBergman\n(1934\n,\n1936)\nhas shown, however, that for certain domains far more general than those previously considered, i.e., domains bounded by a finite number of analytic hypersurfaces, an analogous formula does exist, the double integral being taken essentially over the two-dimensional surface common to two or more of the analytic bounding hypersurfaces.\nIn this paper we shall obtain growth properties in terms of the coefficients of the power series expansion of a function\nf\n(\nz\n1\n,\nz\n2\n)\nf (z_{1}, z_{2})\nf\n(\nz\n1\n​\n,\nz\n2\n​\n)\nof two complex variables analytic in special domains of the type mentioned above; first, with the aid of\nBergman\n's integral formula, along the two-dimensional surfaces common to the bounding hypersurfaces, and then, along a class of two-dimensional surfaces lying in only one of the bounding hypersurfaces and having a line of contact with another bounding hypersurface. We also obtain a mapping theorem which determines from the coefficients a convex region in the\nf\n1\nf\n2\nf_{1} f_{2}\nf\n1\n​\nf\n2\n​\n-plane,\nf\n(\nz\n1\n,\nz\n2\n)\n=\nf\n1\n+\ni\nf\n2\nf (z_{1}, z_{2}) = f_{1} + if_{2}\nf\n(\nz\n1\n​\n,\nz\n2\n​\n)\n=\nf\n1\n​\n+\ni\nf\n2\n​\nwhich must be contained in the smallest convex region of the mapping on the ½-plane of the surfaces considered.\nAfter the award of his doctorate, Gelbart had temporary positions in North Carolina State College\n(1940\n-\n42)\n, Brown University\n(1942)\nand NASA's Langley Field Research Center\n(1942\n-\n1943)\n. It was while at Brown University that he started joint work with\nLipman Bers\non\nS\nS\nS\n-monogenic functions, which later developed into the theory of pseudoanalytic functions\n[\n3\n]\n:-\nThe basic idea was to construct a theory similar to complex function theory for the solutions of a system of generalized\nCauchy\n-\nRiemann\nequations arising in the mechanics of continua.\nThey published two joint papers on\nS\nS\nS\n-monogenic functions, namely\nOn a class of differential equations in mechanics of continua\n(1943)\nand\nOn a class of functions defined by partial differential equations\n(1944)\n. In a note on the second of these they write:-\nThe results of this paper were obtained while the authors participated in the program of Advanced Instruction and Research in Mechanics at Brown University, Summer,\n1942\n. The authors wish to express their appreciation to Professor\nPrager\nfor the many profitable discussions they had with him and for his constant encouragement.\nThe reference to 'Professor\nPrager\n' is to\nWilliam Prager\nwho, after being forced to leave the Institute of Applied Mathematics at the University of Göttingen by the Nazis in\n1933\n, eventually became director of the programme on Advanced Instruction and Research in Mechanics at Brown University in\n1941\n.\nAfter these three years of temporary positions, Gelbart was appointed to Syracuse University in\n1943\nand worked there for fifteen years. Gelbart married Sara; their twins, William and Stephen Gelbart were born on\n12\nJune\n1946\n. Stephen Gelbart studied mathematics at Cornell and Princeton and went on to become a leading researcher making highly significant contributions to the\nLanglands\nprogram. He holds the Nicki and J Ira Harris Professorship at the Weizmann Institute of Science in Israel.\nWe mentioned above that Gelbart's joint work with\nLipman Bers\non S-monogenic functions developed into important work on the theory of pseudoanalytic functions. This appears in their joint paper\nOn generalized Laplace transformations\n(1947)\n. Both authors were at Syracuse University when this paper was published for Gelbart was instrumental in bringing\nLipman Bers\nto Syracuse University in\n1945\n. He also brought\nCharles Loewner\n, who had been\nBers\n's research supervisor at the Charles University of Prague, to Syracuse University in\n1946\n.\nAbe Gelbart was a member of the Institute for Advanced Study at Princeton during the academic year\n1947\n-\n1948\n. He took family movies at that time which, as well as showing his wife Sara and twin baby sons Bill and Steve, include shots of\nAlbert Einstein\n,\nPaul Dirac\n,\nKurt Gödel\n,\nPaul Erdős\n,\nHermann Weyl\n,\nAtle Selberg\n, and\nHarish-Chandra\n(\nsee\n[\n3\n]\n)\n. At this time he had become friendly with\nAtle Selberg\nand, in\n1948\n, brought him to Syracuse. The head of the department at Syracuse was William T Martin\n(1911\n-\n2004)\n(\nknown as Ted\n)\nwhen Gelbart arrived. Martin left in\n1946\nand was replaced as head of department by the topologist Stewart S Cairns\n(1904\n-\n1982)\n. Cairns held that post for two years but left in\n1948\nto become chairman at the University of Illinois. There was some difficulty in making a new appointment of chairman - Gelbart was offered the job but he declined. The department was run by a committee, with Donald Kibbey as acting chair from\n1948\nto\n1952\n. There are two, rather different, recollections of the problems from this period. First let us relate what Donald Kibbey writes\n[\n4\n]\n:-\nGelbart and Arthur Milgram\n(1912\n-\n1961)\nhad a fight about whether Gelbart had a proof to an analog of the\nRiemann\nMapping Theorem for sigma monogenic functions. Gelbart said he had, and Milgram said he didn't. Gelbart threw Milgram out of his office and the department was supposed to choose up sides. It was hard because some people ... tried to remain on the fence. You know, they wanted no part of it, including\nLoewner\n, who tried valiantly to remain on the fence. But there were very strong efforts to make everyone commit himself one way or another, and one day Professor Rosenbloom took it upon himself to go to the Dean's office and say that unless something or other happened ... he and a great many others were going to leave, and the Dean said he was sorry if that was the case and that was the way he felt, but that was the way things were. ... When we had this problem here in\n1948\n-\n51\n, as a result of that, eventually, not all at once, but eventually,\nLoewner\nleft,\nBers\nleft, a good deal later, but still left, Gelbart ...\nErik Hemmingsen in\n[\n2\n]\nblames the appointment of Donald Kibbey as chairman for the department's problems:-\nA search for a new chairman was begun ... but no satisfactory appointment seemed possible. ... The problem, in large part, was that very sharp dissension had split the department several ways. Kibbey was an obvious candidate for the job and it was he who carried out the day-to-day administration of the department as soon as Cairns left. Exner, Gilbert, and Morgan supported Kibbey in the matter. The senior members of the Department\n(\nBers\n,\nLoewner\n, Gelbart and Milgram\n)\nwanted a well-known mathematician of some sort to have the job, so that they rejected Kibbey strongly. ... At the end of that spring semester\n[1950]\nthe dean appointed Kibbey as the department chairman. By the end of the following year\nBers\n, Milgram, Protter, Rosenbloom and\nLoewner\nhad left. That year I had several job offers, none of which seemed really attractive. Staying at Syracuse as a member of the defeated opposition to Kibbey's appointment was not particularly attractive ...\nGelbart soon found himself in difficulties for other reasons. Let us follow Erik Hemmingsen's account in\n[\n2\n]\n:-\nDuring the academic year\n1952\n-\n53\nthe House Committee on Un-American affairs interviewed \"Ted\" Martin who had been department chairman at Syracuse before Stewart Cairns. Martin stated that he had been a member of the Communist Party during the beginning of the time he was in Syracuse. In response to questions from the Committee, Martin named several people in the Syracuse area who had also been party members. This list included Abe Gelbart. Dean Faigle ... told me that the University intended to do what it could to help Gelbart. I was told that Gelbart had always done his job carefully, competently, and with great consideration for his students. His private opinions, if he had any, had not affected his work as a professor and he was not to be persecuted for them. ... The university found Gelbart a lawyer who had been an assistant secretary of state under President Coolidge. What happened when Gelbart came before the committee I do not know, except that \"Ted\" Martin eventually said that he could have been mistaken about Gelbart. The experience was a very bad one for Gelbart. He and I never talked about mathematics afterwards. He was not in the mood.\nIn\n1958\nGelbart left Syracuse University when he was appointed director of mathematics at Yeshiva University. This position meant a lot to Gelbart since it was the position that his teacher\nJekutiel Ginsburg\nhad held until his death in\n1957\n. Not only did Gelbart take over\nGinsburg\n's position at Yeshiva, but he also took over the role of editor of\nScripta Mathematica\n. While at Yeshiva, he also\n[\n3\n]\n:-\n... introduced a government-sponsored program to improve the background and motivation of high school science and mathematics teachers in the New York City area. Gelbart also made efforts to convince government bodies and the general public about the need for basic research and for support of mathematics.\nIn\n1959\nhe was founding dean of the Belfer Graduate School of Science at Yeshiva University. He retired from Yeshiva University in\n1979\nand, in the same year, he was made Distinguished Professor at Bard College. This College, founded in\n1860\nas St Stephen's College, is a private liberal arts college in Annandale-on-Hudson, New York. The Distinguished Scientist Lecture Series at Bard College originated in\n1979\nwhen Nobel laureate physicist\nPaul Dirac\naccepted an invitation from Abe Gelbart and The Bard Center to deliver a lecture titled \"The Discovery of Antimatter.\" The talk presented a view of science rarely seen by the general public - as a record of personal achievement as well as a body of facts and theories. Gelbart was awarded the Bard Medal in\n1981\n. Gelbart's wife Sara died in\n1988\n. Bard College has, in her memory, the Sara Gelbart Prize in Mathematics:-\nA prize honoring a woman whose life was devoted to the encouragement of science and scholarship and given annually to the student who shows the most promise and produces outstanding work in mathematics.\nAs well as serving at Bard College, he served as a trustee of Bar-Ilan University, Ramat Gan, Israel, from\n1982\n. His son, Stephen Gelbart, delivered the lecture\nAn elementary introduction to the Langlands program\nat the Conference dedicating the Professor Abraham Gelbart Chair in Mathematics at Bar-Ilan University in January\n1983\n. In addition to the honours described above, Gelbart received an honorary degree from Dalhousie University in\n1972\nand an honorary degree from Bar-Ilan University in\n1985\n. Bar-Ilan University named its Research Institute for Mathematical Sciences after Gelbart in\n1990\nin recognition of his highly successful efforts to obtain external funding for mathematical research at Bar-Ilan.\nGelbart died from complications following cardiovascular surgery. He was survived by his second wife Mona and his two sons."
}