{
  "nome_completo": "Aderemi Oluyomi Kuku",
  "nome_curto": "Aderemi Kuku",
  "ano_nascimento": "1941",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuku/",
  "lugar_nascimento": "Ijebu-Ode, Ogun State, Nigeria",
  "lugar_morte": null,
  "biografia": "Aderemi Kuku\nwwas the son of Busari Adeoye Kuku, a photographer, and Abusatu Oriaran Baruwa, a trader. His background is given in\n[\n1\n]\n:-\nBorn in Ijebu-Ode to the famous Kuku family of Ijebu-Ode, Otunba\n(\nProfessor\n)\nAderemi Oluyomi KukuÂ is a descendant of Oba Ofiran. His father, Busari Adeoye Kuku's mother\n(\nBarikisu Kuku\n)\nwas a great grand daughter of Oba Ofiran and he, OtunbaÂ\n(\nProfessor\n)\nKuku belongs to Adetuyo Ruling House of Owa of Okun-Owa.\nBusari Adeoye Kuku believed in education for his children and they all went to school. Aderemi had two older brothers; the eldest became an expert in telecommunications, the second eldest became an electrical technician, while his younger brother became a professor of Electronics.\nAderemi Kuku's first school was Bishop Oluwole Memorial School, Agege, Lagos State. He then attended St James School Anglican primary school, Oke-Odan, Ogun State coming first in the first school leaving certificate. He then moved to the Eko Boys High School, Lagos, Nigeria which he attended from\n1955\nto\n1959\n. In his final year of study,\n1959\n, he was Head Boy of the High School. This school had been founded in\n1913\nand when it celebrated its centenary on\n13\nJanuary\n2013\n, Kuku was honoured with a special award for distinguished accomplishments during the centenary dinner held at the Banquet Hall of the Nigerian Law School, Victoria Island, Lagos, Nigeria. After graduating from Eko Boys High School, he went to Abeokuta Grammar School where he obtained the Higher School Certificate in Mathematics, Further Mathematics and Physics.\nAt this stage Kuku had options. He was awarded a scholarship from the African Scholarship Program of American Universities. These were for highly qualified African secondary school students to go to the United States to study for a first degree. This program was administered by the United States Agency for International Development which also had a program to take Nigerian students to Makerere University College in Kampala, Uganda, to study for a first degree. This was part of the University of East Africa which at this time was an independent external college of the University of London, England. Kuku was advised that a British degree was more highly valued in Nigeria than one from the United States, so he chose to study at Makerere University College\n(\nwhich became the independent Makerere University in\n1970)\n.\nA University of London degree was highly valued, but it was difficult to achieve. This was because a student sat the same examination papers at the end of the three year course as did students studying in London, yet the teaching at Makerere was not of the quality of that in London. Kuku entered Makerere University College in\n1962\nand, in\n1965\n, was awarded a B.Sc. with Special Honours in Mathematics. He only achieved the Special Honours degree by doing a lot of studying on his own, in addition to the material taught in the courses. After graduating, Kuku was appointed as an Assistant Lecturer at the University of Ife in Ile-Ife, Osun State, Nigeria. This university was founded in\n1961\nand teaching began in October of the following year. We note that it was renamed Obafemi Awolowo University in\n1987\n, the name by which it is known today. Despite having a university position, Kuku was certainly not going to end his qualifications at the B.Sc. level and he registered at the University of Ibadan to study for a Master's Degree. This University had been established in\n1948\nas a College of the University of London, being the first university to be established in Nigeria. It became an independent university in\n1962\nafter the country gained its independence from Britain.\nKuku's M.Sc. was supervised at the University of Ibadan by Joshua Leslie who had studied at the University of Chicago then had undertaken research for a doctorate at the University of Paris. Leslie had just returned from a research visit to the Institute for Advanced Study at Princeton in the United States. Although Leslie was not an expert in algebra, the area that interested Kuku, he had met\nHyman Bass\nat Princeton and realised that there were important new developments in the subject taking place at Princeton. Kuku went to the library and began to study the papers that were being produced in this new area. This was somewhat of a challenge since he had a supervisor who was not in a position to be much help and, in addition, Kuku had to teach courses at the University of Ife. He submitted an M.Sc. thesis\nA survey of Algebraic K-theory\nwhich was examined by\nHyman Bass\nas the external examiner. Kuku was awarded an M.Sc. by the University of Ibadan in\n1968\n. In\n1967\nhe had been promoted to Lecturer II at the University of Ife.\nIn\n1968\nKuku left the University of Ife, and accepted the position of Lecturer II in Mathematics at the University of Ibadan. The position had become vacant since Joshua Leslie had left to take up a position at the North Western University in the United States. Kuku married Felicia Osifunke Kalesanwo on\n28\nDecember\n1968\n; they have four children Dolapo Kuku, Solape Kuku, Yemisi Kuku and Kemi Kuku. The\n1999\nOgun State Annual\nstates that Felicia\n[\n2\n]\n:-\n... born in Lagos on\n6\nMarch\n1944\n, hails from theÂ Ogun Waterside Local Government AreaÂ of Ogun State. She was the only female member of the State Executive Council under the leadership of Navy Captain Mohammed Lawal. She was Commissioner for Education. Dr\n(\nMrs\n)\nKuku was at various times President, Nigerian Association of University Women\n(\nIbadan Branch\n)\n, a member of Zonta International, Ibadan and member of National Council of Women Societies\n(\nIbadan\n)\n. She also belongs to several learned societies such as Nigerian Society for Plant Protection, Science Association of Nigeria, Nigerian Institute of Food Science and Technology and she is a life member of University of Ibadan Alumni. A Christian of the Baptist denomination ...\nAfter receiving an invitation from\nHyman Bass\nto undertake research at Columbia University, New York City, and, after arranging leave from the University of Ibadan, Kuku spent the year\n1970\n-\n71\nat Columbia University. During this year\nHyman Bass\nacted as a thesis advisor to Kuku who returned to the University of Ibadan and submitted his thesis\nOn the Whitehead group of p-adic integral group-rings of finite p-groups\n. He was awarded a Ph.D. in\n1971\nby the University of Ibadan.\nKuku's first three papers were\n(\ni\n)\nSome algebraic K-theoretic applications of the LF and NF functors\n(1973)\n,\n(\nii\n)\nWhitehead group of orders in p-adic semi-simple algebras\n(1973)\nand\n(\niii\n)\nSome finiteness theorems in the K-theory of orders in p-adic algebras\n(1976)\n. The authors of\n[\n7\n]\nwrite:-\nHis initial work contributed to the understanding of the LF and NF functors with applications to the computation of\nPicard\ngroup of Algebraic Geometry, see\n(\ni\n)\n. Moreover, he also contributed to the understanding of\nWhitehead\ngroups of group-rings of finite group over the ring of integers in algebraic number fields and p-adic fields as well as\nWhitehead\ngroups of orders in algebras over such fields. He proved several finiteness results in this direction\n(\nsee\n(\nii\n)\nand\n(\niii\n))\n.\nKuku was promoted to Senior Lecturer in Mathematics in\n1976\n, to Reader in Mathematics in\n1980\nand, in\n1982\n, to Professor of Mathematics at the University of Ibadan.\nFor Kuku's own description of his background and education, see his interview at\nTHIS LINK\n.\nIn\n[\n5\n]\nthere is information about Kuku's teaching. Here is a slightly modified version:-\nAderemi Kuku has over\n40\nyears of teaching and research experience. He has taught courses on Calculus, Real and Complex Analysis, Algebra\n(\nLinear algebra and Abstract algebra\n)\n, Topology, and Geometry, at undergraduate and beginning graduate levels. He has written a book 'Abstract Algebra'\n(1980)\n, suitable for undergraduate and beginning graduate levels. He has also taught graduate courses on various topics including Homological algebra, Algebraic Topology, Algebraic Number theory, Representation Theory, Algebraic K-theory, Category theory, Algebraic Geometry, and Non-commutative Geometry. In the United States he has taught undergraduate and graduate courses at Columbia University, New York; University of Illinois at Urbana-Champaign; Cornell University Ithaca, New York; the University of Iowa, Iowa City; Howard University Washington, DC; Miami University, Oxford, Ohio. At Grambling State University, he has taught Pre-Calculus, Calculus III, Modern Algebra I, Modern Algebra II, Introduction to Topology, and Topics in Mathematics I.\nIn\n1995\nKuku went to Italy when he was appointed as Professor of Mathematics at the International Centre for Theoretical Physics, Trieste. He remained there until\n2003\n. He was the William W S Claytor Endowed Professor of Mathematics, Grambling State University, Louisiana, USA and then Distinguished Professor of Mathematics at the National Mathematical Centre, Abuja, Nigeria.\nWe mentioned above Kuku's first book\nAbstract algebra\n(1980)\n. He has also published\n(\nwith E Thoma and J H Rawnsley\n)\nGroup Representations and its Applications\n(1985)\nas well as\nBasic commutative algebra\n(1997)\n,\nTopics in algebraic K-theory\n(1997)\n, and\nRepresentation theory and higher algebraic K-theory\n(2007)\n.\nFor full information on this\n2007\nbook, see\nTHIS LINK\n.\nIt is not only technical mathematical works that Kuku has published for he has contributed many papers on education, science and technology, often with emphasis on the particular problems in Africa or, more specifically, in Nigeria. We list the titles of these works, many of which are the written form of lectures he has given in various countries worldwide:\nMathematics as a service subject - The African Experience\n(1988)\n;\nMobilisation and production of basic scientists for the development of Africa\n(1988)\n;\nToward a more comprehensive Franco-African cooperation in mathematics\n(1988)\n;\nMathematical Sciences and African Development\n(1988)\n;\nNetworks in the context of new European relationships and North-South CO-development\n(1990)\n;\nMathematical Sciences and the development of Nigeria\n(1991)\n;\nCapacity Building and Human Resources for accelerated development of Science and technology in Africa in Science in Africa\n(1993)\n;\nMathematical Research and Education in Africa. Problems and Prospects\n(1993)\n;\nMathematics as a universal language\n(1994)\n;\nSome perspectives on World Mathematics Year-WMY\n2\n,\n000\n(1994)\n;\nAfrican mathematical Union\n(\nAMU\n)\nand the challenges of developing mathematical sciences in Africa\n(1994)\n;\nMathematical Education in Africa in relation to other continents\n(1995)\n;\nMathematics in AFRICA - an Appraisal\n(1996)\n;\nScience and Technology Literacy\n(\nSLT\n)\nand Numeracy: Meanings and Rationales\n(1997)\n;\nMathematics and the Development of Africa - The way forward\n(2001)\n;\nMathematical Sciences and other Sciences\n(2002)\n;\nThe Role of Mathematical Sciences in the Scientific, Technological, Social and Economic Development of Nigeria\n(2004)\n;\nMathematical Sciences and the development of Africa\n(2005)\n;\nAfrican Solutions to African Problems through Science and Technology\n(2006)\n;\nThe role of Mathematics in the Scientific, Technological Development and Innovation in Africa\n(2010)\n;\nRegional and International co-operation to strengthen basic sciences in Africa\n(2010)\n;\nMathematics as a time-tested resource for scientific, technological, socio-economic and intellectual development\n(2013)\n;\nHigher Education in Mathematics, Science and Technology for Development\n(2018)\n;\nTowards radical improvement in the health an well-being of Nigerians\n(2018)\n;\nScience, Technology and Innovation\n(\nSTI\n)\nin the age of globalization\n(2019)\n;\nScience and Technology in the next one hundred years\n(2019)\n.\nKuku has received many awards and honours for his outstanding contributions. These include:\nFellow of the African Academy of Sciences\n(\nelected\n1986\n; President\n2014\n-\n2017)\n;\nMember of the European Academy of Arts Science and Humanities\n(\nfrom\n1986)\n;\nMember of the\nAfrican Mathematical Union\n(\nPresident,\n1986\n-\n95\n; Honorary President for life from\n1995)\n;\nFellow, Mathematical Association of Nigeria\n(1987)\n;\nPresented with a Special Merit Award by Ogun State of Nigeria in\n1987\n;\nFellow of the Nigerian Academy of Science\n(\nelected\n1989)\n;\nFellow of The World Academy of Sciences\n(\nelected\n1989)\n;\nPresented with the Distinguished Achievement Award from the USA National Association of Mathematicians in\n1993\n;\nAwarded the\nAfrican Mathematical Union\nMedal in\n2000\n;\nForeign Fellow, Mongolian Academy of Sciences\n(\nelected\n2005)\n;\nOfficer of the Order of the Niger, a Nigerian National Honour, awarded by the President of Nigeria,\n2008\n;\nFellow of the African Science Institute\n(\nelected\n2009)\n;\nAwarded the Nigerian National Order of Merit\n(\nthe Highest Academic Honour in Nigeria awarded by the President of Nigeria\n)\nin\n2009\n, it was presented by the President of Nigeria, His Excellency Dr Goodluck Jonathan at the presidential Villa in Abuja on\n2\nDecember\n2010\n;\nInternational Conference on Algebraic K-theory and It's Applications in honour of the\n70\nth birthday of Professor Kuku held at Nanjing University China\n17\nMarch\n2011\n-\n21\nMarch\n2011\n;\nFoundation Fellow of the\nAmerican Mathematical Society\n(\nelected\n2012)\n;\nDuring the\nAfrican Mathematical Union\nPan-African Congress of Mathematicians held at Abuja, Nigeria, a Special Reception/Dinner was hosted by the National Mathematical Centre, Abuja, in honour of Kuku on Saturday,\n6\nJuly\n2013\nto mark his election an inaugural Fellow of the\nAmerican Mathematical Society\n;\nA special issue of the Journal of K-theory was published in honour of Kuku by the Cambridge University Press\n(2014)\n;\nFoundation Fellow of the Nigerian Mathematical Society\n(\nelected\n2015)\n;\nand Life-time Achievement Award by the University of Ibadan on\n16\nNovember\n2018\nat the\n70\nth Anniversary celebrations of the Founding of the University.\nLet us end this biography with Kuku's other interests. These included ballroom dancing, chess, and table tennis."
}