{
  "nome_completo": "Adolf Lindenbaum",
  "nome_curto": "Adolf Lindenbaum",
  "ano_nascimento": "1904",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lindenbaum/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Ponary (now Paneriai), (near Vilnius),  Lithuania",
  "biografia": "Adolf Lindenbaum\n's parents were Mowsza Henoch Lindenbaum and Emilja Krykus. Mowsza Lindenbaum owned several companies and made a movie in\n1931\nbut no further details of the family seem to be known except that they were Jewish. There are no records of Adolf's early years although we can assume that he was brought up in Warsaw. Again it is not known whether he attended a primary school or whether he was educated at home for his first years. The first definite information that is known is September\n1914\nwhen, at the age of ten, he entered the Rocha Kowalskiego\nGymnasium\n. After one year at this school, he transferred to the Jana Kreczmara Gymnasium\n(\nsometimes known as the Michała Kreczmara Gymnasium. The Jana Kreczmara Gymnasium was a private school founded in\n1907\nin Miodowa Street in Warsaw but moved to Śniadeckich Street. It is unclear exactly why he moved school after a year, but it is possible that he was living in Śniadeckich Street at this time. Since the Jana Kreczmara and Rocha Kowalskiego Gymnasiums are far apart, it is quite possible that his parents moved homes. Certainly, from\n1915\nto\n1922\nhe attended the Jana Kreczmara Gymnasium and passed his matriculation examination on\n27\nMay\n1922\nhaving been exempted from the oral part of the examination because he \"showed good progress.\"\nOf course, World War I began in\n1914\n, in the year that Lindenbaum began his schooling. At the time that Lindenbaum was born, Poland did not exist as an independent country but had been partitioned between Austria-Hungary, Prussia and Russia. Warsaw was in the Russian sector and was, therefore, part of the Russian Empire. Attacked by German forces, the Russian sector of Poland was, by the end of\n1915\n, captured by German troops so Warsaw came under German control. After the war ended in\n1918\n, Poland was reestablished as an independent country and its borders set by the Treaty of Versailles in\n1919\n. Conflict did not end there, however, for in\n1919\nthe Polish-Russian war began. In the summer of\n1920\nRussian troops invaded Poland and advanced towards Warsaw. A huge war effort was required by the Poles and young men were enlisted to help. Lindenbaum, who was sixteen at the time, enlisted in an organisation set up by the Polish White Cross to help the soldiers. He ran errands for the organisation for four months until the peace treaty was signed in October\n1920\n.\nWe should mention one of Lindenbaum's classmates at the Jana Kreczmara Gymnasium. This was Mojżesz David Kirszbraun\n(1903\nor\n1904\n-\n1942)\nwho, like Lindenbaum, showed outstanding mathematical abilities at the school. He graduated at the same time as Lindenbaum and the two entered the University of Warsaw to study mathematics together. Today Kirszbraun is remembered for the Kirszbraun Theorem concerning extensions of\nLipschitz\nmaps between\nHilbert\nspaces. Lindenbaum and Kirszbraun were close friends and undertook joint research projects while at university.\nOn\n14\nSeptember\n1922\nLindenbaum applied for admission to the Mathematics department in the Faculty of Philosophy of Warsaw University. He gave his address as Apartment\n4\nat\n45\nZłota Street. He wrote in his application\n(\nsee, for example,\n[\n11\n]\n)\n:-\nAlways loving mathematics, I did not hesitate for a moment what to choose among the different advanced studies, having decided to apply for admission to that faculty where I will be able to study this science.\nFive days later his application was accepted and on\n2\nOctober\n1922\nhe began his university studies. During the five years of his university course, Lindenbaum was taught by some outstanding academics. Among his mathematics lecturers were\nKazimierz Kuratowski\n,\nStefan Mazurkiewicz\nand\nWacław Sierpiński\nwhile\nStanisław Leśniewski\nand\nJan Łukasiewicz\nlectured to him on logic.\nAlfred Tarski\ntaught at the Polish Pedagogical Institute in Warsaw from\n1922\nto\n1925\nbut began teaching at the University of Warsaw in session\n1925\n-\n26\nwhen he taught on cardinal numbers, a course which Lindenbaum attended. Since Lindenbaum also attended\nTarski\n's elementary mathematics\n(\nplane geometry\n)\ncourse in\n1926\n-\n27\nit looks likely that he was attending courses by a friend to give him support rather than to learn new mathematics. Lindenbaum also attended a logic course by Tadeusz Kotarbiński\n(1886\n-\n1981)\n. Kotarbiński had studied mathematics in Kraków before studying under\nŁukasiewicz\nat Lwów\n(\nnow Lviv in Ukraine\n)\n. He had been appointed as a lecturer in philosophy at the University of Warsaw in\n1918\n. Lindenbaum also attended a course on the history of philosophy given by Władysław Tatarkiewicz\n(1886\n-\n1880)\nwho had taught in Wilno and Poznań before taking up an appointment in Warsaw in\n1923\n. Tatarkiewicz was also an expert on aesthetics and the history of art, and taught a course on French art which Lindenbaum attended. He also attended a course on psychology given by Władysław Witwicki\n(1878\n-\n1948)\n, a course on linguistics by Karol Appel\n(1857\n-\n1930)\n, and a course on the history and culture of Palestine given by Moses Schorr\n(1874\n-\n1941)\n. Schorr was a rabbi who preached at the Great Synagogue of Warsaw from\n1923\nand lectured at the University from\n1926\n.\nIn fact Lindenbaum's student career ended in a slightly strange way. He was undertaking research on point set topology for his doctorate advised by\nWacław Sierpiński\n. In October\n1926\nhe applied for exemption from the course requirement of session\n1926\n-\n27\nto give him time to complete his dissertation. He had already published two papers, namely\nContributions à l'étude de l'espace métrique\nⓉ\n(\nContributions to the study of metric space\n)\n(1926)\nand\n(\nwith\nAlfred Tarski\n)\nCommunication sur les recherches de la théorie des ensembles\nⓉ\n(\nCommunication on set theory research\n)\n(1926)\n. His request was refused and he continued to attend courses in\n1926\n-\n27\n.\nLet us say a little about these papers. The first examines isometric mappings of point sets between metric spaces. These results would eventually become part of his doctoral thesis. The second, written jointly with\nTarski\n, is a\n2\n-page paper which lists a large number of theorems which they had proved, the majority being on cardinal numbers, but the paper gives no proofs.\nHe submitted his thesis\nOn metric properties of point sets\n(\nPolish\n)\nin the autumn of\n1926\nbut in order to remain registered as a student and therefore avoiding military service, he applied in September\n1927\nto become a student of psychology and pedagogy. This was accepted so in\n1927\n-\n28\nhe was again a first year student but he only attended two courses, one being on the Polish poet Adama Mickiewicz given by Józef Ujejski\n(1883\n-\n1937)\n. The oral examination on his thesis was on\n22\nJune\n1928\nand, being successful, he became a Doctor of Philosophy. He remained enrolled as a student until June\n1929\n.\nFrom\n1929\nto\n1934\nLindenbaum worked on his\nhabilitation\nthesis. During these years he had no employment so one can only assume that his parents continued to provide him with financial support. In fact the habilitation thesis was a collection of papers that he had published over these years. After the two papers listed above, Lindenbaum published the following papers between\n1928\nand\n1934\n:\nSur quelques propriétés des fonctions de variable réelle\nⓉ\n(\nOn some properties of functions of a real variable\n)\n(1928)\n;\nRemarques sur une question de la méthode axiomatique\nⓉ\n(\nNotes on a question of the axiomatic method\n)\n(1930)\n;\n(\nwith A Kozniewski\n)\nSur les opérations d'addition et de multiplication dans les classes d'ensemble\nⓉ\n(\nOn the operations of addition and multiplication in the general classes\n)\n(1930)\n;\nSur les ensembles ordonnés\nⓉ\n(\nOn ordered sets\n)\n(1931)\n;\nBemerkung zu den vorhergehenden \"Bemerkungen ...\" des Herrn J. v. Neumann\nⓉ\n(\nNote on the previous 'remarks ...' of  J von Neumann\n)\n(1931)\n;\nSur les constructions non-effectives dans l'arithmétique élémentaire\nⓉ\n(\nOn non-effective constructions in elementary arithmetic\n)\n(1932)\n;\nSur les figures convexes\nⓉ\n(\nOn convex figures\n)\n(1932)\n;\nLa projection comme transformation continue la plus générale\nⓉ\n(\nThe projection as the most general continuous transformation\n)\n(1932)\n;\nSur un ensemble linéaire extrêmement non homogène par rapport aux transformations continues et sur le nombre des invariants de ces transformations\nⓉ\n(\nOn a linear set extremely inhomogeneous with respect to the continuous transformations and on the number of the invariants of these transformations\n)\n(1932)\n;\nSur les ensembles localement dénombrables dans l'espace métrique\nⓉ\n(\nOn locally countable sets in a metric space\n)\n(1933)\n;\nSur les superpositions des fonctions représentables analytiquement\nⓉ\n(\nOn the superpositions of functions representable analytically\n)\n(1933)\n;\nSur les ensembles dans lesquels toutes les équations d'une famille donnée ont un nombre de solutions fixé d'avance\nⓉ\n(\nOn sets in which all the equations of a given family have a number of solutions fixed in advance\n)\n(1933)\n;\nSur la théorie de l'ordre multiple\nⓉ\n(\nOn the theory of the multiple order\n)\n(1934)\n;\nSur les superpositions des fonctions représentables analytiquement\nⓉ\n(\nOn the superpositions of functions representable analytically\n)\n(1934)\n.\nAfter presenting his habilitation thesis, Lindenbaum became a\ndocent\nin the Faculty of Mathematics and Natural Sciences. He taught in the faculty for two semesters before being appointed as an assistant professor in the Philosophical Seminar run by\nŁukasiewicz\n. This Seminar was a unit in the Faculty of Mathematics and Natural Sciences. Courses taught by Lindenbaum were on set theory, measure theory, algebra, actuarial mathematics and the foundations of mathematics. In addition to the research that he was publishing, Lindenbaum and\nTarski\ncollaborated on writing the book\nTheorie der eineinendeutigen Abbildungen\nⓉ\n(\nTheory of unambiguous illustrations\n)\n. They must have essentially completed this work since a publication date in\n1938\nwas announced. This, however, never happened since events leading up to the outbreak of war in\n1939\ndisrupted life in Poland.\nAs one might imagine, being Jewish, Lindenbaum had problems. In\n1935\nPolish universities adopted an anti-Semitic policy which meant that Lindenbaum had little chance of being promoted beyond docent. However, he believed in left-wing policies and he was certainly a member of the Polish Communist Party by\n1935\n, and he may have joined earlier than that. This party came under suspicion and was accused of having agents of the Polish Regime among its members. Many of its leaders were taken to Moscow, tried and murdered during the period of political repression in the Soviet Union in\n1936\n-\n39\n. The Polish Communist Party was dissolved by Stalin in\n1938\n.\nLindenbaum had married his fellow logician Janina Hosiasson\n(1899\n-\n1942)\nwho was also a Jew. The marriage took place either late in\n1935\nor early in\n1936\n. The couple had known each other from the time they were both studying at Warsaw University. Janina had received a doctorate from Warsaw in\n1926\nadvised by Tadeusz Kotarbiński who had also taught Lindenbaum. Both she and Lindenbaum had delivered papers at the First Congress of Mathematicians from Slavic Countries held in Warsaw in September\n1929\n. She was an active researcher who published around\n20\npapers. After their marriage they lived at apartment\n34\nin\n16\nKrasińskiego Street. Lindenbaum did other things which would later put his life in danger. In\n1936\nhe had signed a petition demanding that the journalist and pacifist Carl von Ossietzky, who had been imprisoned by the Nazis, be allowed to travel to Oslo to received the Nobel Peace Prize which had been awarded to him. He also signed a letter protesting at the massacre in April\n1936\nin Lwów when nineteen people were killed by the Polish police during the funeral of Władysław Kozak who had been killed by the police on\n14\nApril during a protest by the unemployed.\nOn\n1\nSeptember\n1939\nGerman troops entered Poland and the German Luftwaffe began bombing all strategically important sites. By\n4\nSeptember they were within\n60\nkm of Warsaw which they encircled with two pincer movements coming from the north and south, one to the east of Warsaw the other to the west. Lindenbaum realised the danger he was in both as a Jew and as a known Communist. He knew that the Germans had lists of names of Polish Communists and other critics of Hitler's regime which, particularly because of the petitions and letters he had signed, terrified Lindenbaum. On\n6\nSeptember, he and his wife went to Vilna\n(\nnow known as Vilnius\n)\nwhere she took up residence but Lindenbaum continued on to Białystok. He could have escaped to the West or, perhaps more likely because of his left-wing views, gone to Moscow. He chose to do neither since he hoped to help build a Socialist Poland after the war. On\n22\nSeptember, Russian troops entered Poland occupying Białystok and five days later Warsaw fell to the Germans and, following the Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union, Poland was partitioned between these two powers. Białystok, however, now became part of Byelorussian Soviet Socialist Republic. The Soviets set up the Białystok Pedagogical Institute and Lindenbaum was appointed as a docent at the Institute. He was offered a position in Moscow but turned it down.\nThings changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. German armies advanced on Białystok and the battle for the city and surrounding area lasted until\n3\nJuly when the Germans took control. Lindenbaum does not appear to have made any efforts to escape which is slightly strange given that he was fully aware of the danger he was in from the Germans. He may have felt that all options were equally dangerous. In September\n1941\nhe was arrested by the Gestapo and taken to Vilnius. Lindenbaum's wife Janina, who was in Vilnius, was also arrested by the Gestapo in September\n1941\n. It appears that by this time the two were separated, for earlier that year Janina had written to\nTarski\nsaying that they had separated at the beginning of World War II. After seven months imprisonment, Janina was taken to Ponary\n(\nnow known as Paneriai\n)\njust outside Vilnius, and shot near the railway station. The site was chosen by the Germans to carry out executions since the Soviets had begun to construct oil storage facilities which the Germans used to dispose of the bodies. It is not known exactly when Lindenbaum was executed but it is believed that he too was murdered at Ponary soon after his arrest.\nJan Woleński writes in\n[\n8\n]\n:-\nLindenbaum's brilliant personality, charming style of life and powerful mathematical skills fascinated the Warsaw scientific community. Not surprisingly, he was commonly considered one of the most gifted Polish mathematicians of his generation.\nTarski\n... described Lindenbaum as \"a man of unusual intelligence\".\nMostowski\nonce called Lindenbaum the most lucid mind in the foundations of mathematics. Legendary stories told by Lindenbaum's friends and colleagues document many cases of theorems discovered by him but proved by someone else, as he had no time to complete his ideas. Yet the list of his scientific contributions is quite long; it comprises more than\n40\npapers, abstracts and reviews ..., mostly published in German and French.\nAfter his early work on topology, he moved towards logic and the foundations of mathematics. He did important work on set theory, studied axioms equivalent to the axiom of choice and proved that the axiom of choice was independent of the other axioms of\nZermelo\n-\nFraenkel\nset theory. Fraenkel had claimed to prove this but Lindenbaum and\nMostowski\nin a\n1938\npaper, claim that there are errors and obscurities in\nFraenkel\n's proof which they correct. Lindenbaum also worked on the propositional calculus and its connection to logical matrices. Two other significant achievements are what is today called the Lindenbaum algebra and the maximalisation theorem sometimes today called Lindenbaum's Lemma.\nLindenbaum was a member of the\nPolish Mathematical Society\nfrom\n1926\n, becoming treasurer of the Warsaw branch of that Society in\n1938\n. He was elected as secretary at the foundational meeting of the Polish Logical Society in\n1936\n. At the same meeting\nJan Łukasiewicz\nwas elected chairman and\nAlfred Tarski\nas vice-chairman."
}