{
  "nome_completo": "Adolf Hurwitz",
  "nome_curto": "Adolf Hurwitz",
  "ano_nascimento": "1859",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hurwitz/",
  "lugar_nascimento": "Hildesheim, Lower Saxony, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Adolf Hurwitz\nwas born into a Jewish family. His father, Salomon Hurwitz, was in the manufacturing business but was not particularly well off.  Salomon had three sons, Max, Julius and Adolf, but their daughter Jenny died at the age of one. Sadly, Adolf's mother Elise Wertheimer died when he was only three years old. Salomon Hurwitz offered his sons a good education, encouraging them to engage in music, gymnastics, Jewish traditions and smoking, \"as he could scarcely imagine a proper gentleman without a cigar or even better a pipe\"\n[\n6\n]\n. The three brothers all had a particular talent for mathematics.\nHurwitz entered the\nRealgymnasium\nAndreanum in Hildesheim in\n1868\n. He was taught mathematics there by\nSchubert\n[\n2\n]\n:-\nSchubert gave up part of every Sunday to working at geometry with the schoolboy Hurwitz, and the first of the latter's papers, written when he was still at the Andreanum, was a joint paper. It was also\nSchubert\nwho persuaded Hurwitz's father to allow him to go to university and who sent him with warm recommendations to\nKlein\nat Munich.\nWe note that this first paper by Hurwitz, written jointly with\nSchubert\n, was on\nChasles\n's theorem. Salomon Hurwitz could not afford to send his son to university but his friend, Mr Edwards, agreed to help out financially, so making a university career for Hurwitz possible. He entered the University of Munich in\n1877\n, before he was eighteen years old, and spent a year there attending lectures by\nKlein\n. Although he was greatly influenced by\nKlein\nand had already begun to undertake advanced work with him, he went for academic year\n1877\n-\n78\nto continue his studies at the University of Berlin where he attended classes by\nKummer\n,\nWeierstrass\nand\nKronecker\n. In particular he attended the one semester course by\nWeierstrass\nIntroduction to the theory of analytic functions\nand the notes taken by Hurwitz at this time are reproduced as the book\n[\n2\n]\n. The lectures contained\nWeierstrass\n's version of the arithmetisation of analysis including his \"construction\" of the real numbers, the ε, δ approach to analysis and his theory of complex functions based on power series.\nWhile at Berlin Hurwitz continued to keep in contact with\nKlein\nand assisted him with a paper on elliptic modular functions which he was writing. After three semesters at the University of Berlin, Hurwitz returned to the University of Munich in\n1879\nto continue working with\nKlein\n, so when\nKlein\nmoved to the University of Leipzig in October\n1880\n, Hurwitz went with him. His Ph. D. was supervised by\nKlein\nand he received the degree in\n1881\nfor his dissertation on elliptic modular functions\nGrundlagen einer independenten Theorie der elliptischen Modulfunktionen und Theorie der Multiplikatorgleichungen erster Stufe\nⓉ\n(\nBasic principles of an independent theory of elliptic modular functions and theory of multiplier qquations of the first degree\n)\n.\nIt would have been natural for Hurwitz to become a\nPrivatdozent\nat the University of Leipzig since he was a student of\nKlein\n, the professor of mathematics there. However there was a difficulty -- Hurwitz did not have sufficient knowledge of Greek to satisfy the Faculty requirements! Luckily Göttingen had no such requirement and Hurwitz became a Privatdozent at the University of Göttingen after submitting his\nhabilitation\nthesis there in\n1882\n. Hurwitz had not been at Munich during\n1881\n-\n82\n, rather he had returned to Berlin where he attended further courses of lectures by\nWeierstrass\nand\nKronecker\n.\nIn\n1884\nHurwitz accepted an invitation from\nLindemann\nto become an extraordinary Professor at Königsberg and he was to remain there for eight years. Here he taught\nHilbert\nand\nMinkowski\n, becoming a life long friend of\nHilbert\n. Even after\nMinkowski\nleft the University of Königsberg and went to Bonn, he still returned to Königsberg for every vacation and joined Hurwitz and\nHilbert\nin their almost daily walks\n[\n4\n]\n:-\nDuring these walks, continued over the whole of the eight year period of Hurwitz's residence in Königsberg, well nigh every corner of the then known mathematical world was explored.\nIn Königsberg Hurwitz met Ida Samuel, the daughter a professor in the faculty of medicine, and they married. The couple had three children: Lisbeth\n(\nborn\n1894)\n,\nEva\n(\nborn\n1896)\nand Otto\n(\nborn\n1898)\n. Eva began studying mathematics at the ETH in Zürich in\n1915\n, but she dropped out a few years later and turned to 'extreme-revolutionary' politics, much to her parents' dismay. Lisbeth pursued a career as a social welfare worker and Otto studied chemistry.\nIn\n1892\nFrobenius\nleft his chair at Eidgenössische Polytechnikum Zürich to return to Berlin and Hurwitz was appointed to the vacant chair at Zürich. Hurwitz remained at Zürich for the rest of his life, unfortunately continually suffering from ill health. His health problems had begun when he contracted typhoid in Munich when he was a student there. The disease was widely spread though the city at that time. In fact he twice contracted typhoid and from then on suffered badly from migraine headaches.\nAlthough, as we have pointed out, Hurwitz remained at Zürich for the rest of his life, that was not because he had not been offered in chair in Germany.\nSchwarz\n, who was professor at Göttingen, succeeded\nWeierstrass\nby accepting his professorship in Berlin in\n1892\n. Göttingen approached Hurwitz and offered him the vacant chair only weeks after he had accepted the Zürich chair, but he turned down the offer. This must have been a remarkably hard decision for Hurwitz since at that time a chair at a leading German university such as Göttingen would have been much more prestigious to any German than a chair in Switzerland. However Hurwitz was an extremely loyal person, and having given his word that he would accept the Zürich position he would not renege on his promise.\nMuch of Hurwitz's mathematics can be seen as being strongly influenced by\nKlein\n(\nand also by\nRiemann\nwhose ideas where transmitted to Hurwitz via\nKlein\n)\n. In fact Hurwitz and\nKlein\ncomplemented each other extremely well for the reasons that\nYoung\nindicates in\n[\n4\n]\n:-\nKlein\n's strength ... was sometimes regarded as consisting still more in the fertility and the\n[\ngenius\n]\nof his ideas than in the power of developing them.\nHere then was Hurwitz's strength -- in developing\nKlein\n's ideas\n[\n1\n]\n:-\nKlein\n's new view on modular functions, uniting geometrical aspects such as the fundamental domain with group theory tools such as the congruence subgroups and with topological notions such as the genus of the\nRiemann\nsurface, was fully exploited by Hurwitz.\nHurwitz studied the genus of the\nRiemann\nsurface. He worked on how to derive class number relations from modular equations. He investigated the automorphic groups of algebraic\nRiemann\nsurfaces of genus greater than\n1\n, showing that they were finite. He also studied invariant integrals for\nS\nO\n(\nn\n,\nR\n)\nSO(n, \\mathbb{R})\nS\nO\n(\nn\n,\nR\n)\nand\nS\nL\n(\nn\n,\nR\n)\nSL(n, \\mathbb{R})\nS\nL\n(\nn\n,\nR\n)\nand Slodowy describes in\n[\n12\n]\nhow this work, together with\nSchur\n's work on orthogonality relations and the character formula for the orthogonal groups, led to\nWeyl\n's papers on the\nrepresentation theory\nof semisimple\nLie groups\n.\nFurther topics studied by Hurwitz include complex function theory, the roots of\nBessel\nfunctions, and difference equations. He also wrote several papers on\nFourier series\n. Soon after he went to Zürich he was asked a question by Aurel Stodola, one of his colleagues, concerning when an\nn\nn\nn\nth-degree polynomial with real coefficients\nf\n(\nx\n)\n=\na\n0\nx\nn\n+\na\n1\nx\nn\n−\n1\n+\n.\n.\n.\n+\na\nn\nf (x) = a_{0}x^{n} + a_{1}x^{n-1} + ... + a_{n}\nf\n(\nx\n)\n=\na\n0\n​\nx\nn\n+\na\n1\n​\nx\nn\n−\n1\n+\n.\n.\n.\n+\na\nn\n​\nwith positive leading coefficient\na\n0\n>\n0\na_{0} > 0\na\n0\n​\n>\n0\nhas only roots with negative real parts. Hurwitz solved this problem completely showing that the condition held if and only if a certain sequence of determinants are all positive. He published this in\n1895\nin the paper\nÜber die Bedingungen, unter welchen eine Gleichung nur Wurzeln mit negativen reellen Theilen besitzt\nⓉ\n(\nOn the conditions under which an equation has only roots with negative real parts\n)\nwhich appeared in\nMathematische Annalen\nin\n1895\n. This remarkably influential paper was reprinted\n100\nyears later in the proceedings of the Hurwitz Symposium on Stability theory in Ascona in\n1995\n. The excellent review\n[\n7\n]\nappears in the proceedings of the same symposium, and in the paper\n[\n5\n]\nthe genesis of Hurwitz's version of the well-known stability criterion is described in detail.\nHurwitz did excellent work in\nalgebraic number theory\n. For example he published a paper on a factorisation theory for integer\nquaternions\nin\n1896\nand applied it to the problem of representing an integer as the sum of four squares. A full proof of Hurwitz's ideas appears in a booklet published in the year of his death. This involves studying the ring of integer quaternions in which there are\n24\nunits. He shows that one-sided ideals are principal and introduces prime and primary quaternions.\nThe paper\n[\n10\n]\nby Lindström shows another aspect of Hurwitz's work. Here is part of Lindström's summary:-\nIn\n1893\nthe Swedish actuary and mathematics historian Gustaf Eneström published a theorem on the complex roots of certain polynomials with real coefficients in a paper on pension insurance\n(\nin Swedish\n)\n. This result is now often called the Eneström-Kakeya theorem, since S Kakeya published a similar result in\n1912\n-\n1913\n. But Kakeya's theorem contained a mistake, which was corrected by A Hurwitz in\n1913\n. Hurwitz informed\nE Landau\nabout Kakeya's result\n(\ncorrected\n)\n;\nLandau\nneeded the result in a proof of a theorem on infinite power series. ... We mention a generalization of Eneström's theorem and give an application to a similar result by Hurwitz.\nThe first International Congress of Mathematicians was held in Zürich in\n1897\n.\n[\n6\n]\nHurwitz joined the organising committee at the initial meeting in July\n1896\nand became one of the main organisers of the congress. He was president of the reception committee, which was responsible for organising the social part of the congress together with the amusement committee, and for providing all congress publications\n(\ninvitations, programmes, regulations, resolutions, posters, badges etc.\n)\nin both German and French.\nThe reception committee seems to have had the highest workload out of the four sub-committees, and Hurwitz suggested that a publications committee be set up in order to relieve his committee of some of its duties. In the end, the organising committee opted for Rudio's suggestion of enlarging the existing reception committee. Together with\nGeiser\nand\nMinkowski\n, Hurwitz was responsible for choosing the plenary speakers\n(\non\nRudio\n's suggestion\n)\n. He also asked\nKlein\nto contribute to the preparations. Furthermore, Hurwitz wrote up the attendance list, which was given to every congress participant. He also reviewed the musical entertainment during the steamboat excursion.\nOn\n8\nth\nAugust, Hurwitz spent the entire day 'at the train station, welcoming the arriving mathematicians, handing out the congress cards and organising accommodation for the arrivals if desired'. In the evening, at the collation in the Tonhalle, he gave a welcome speech, in which he stressed the importance of personal relations between mathematicians of different countries.\nAt the congress itself, he chaired section II: Theory of Functions and Analysis. More importantly, he was one of the four plenary speakers, and the only one of them representing Switzerland. He gave his talk\nEntwicklung der allgemeinen Theorie der analytischen Funktionen in neuerer Zeit\nⓉ\n(\nDevelopment of the general theory of analytic functions in recent times\n)\n(\nDevelopment of the General Theory of Analytic Functions in Recent Times\n)\n, which\nHilbert\ndescribes as \"exemplary due to the clear and concise style as well as the successful selection of this so extensive topic\", in the first general meeting on\n9\nth\nAugust.\nMigraine was not the extent of Hurwitz's health problems which became increasingly severe. His kidneys became diseased and he had one removed in\n1905\n. With only one kidney, and that one not functioning properly, the quality of his life was very poor. Young\n[\n2\n]\nwrites that:-\n... his life\n[\nwas\n]\none long struggle with a wasting disease. That this struggle was waged with comparative success for so many years appears almost incredible, and can only be accounted for by the constant care and devotion of\n[\nhis\n]\nwife.\nIn\n[\n1\n]\nHilbert\n's comments on Hurwitz as a person are recorded:-\nHilbert depicted him as a harmonious spirit; a wise philosopher; a modest, unambitious man; a lover of music and amateur pianist; a friendly unassuming man whose vivid eyes revealed his spirit."
}