{
  "nome_completo": "Adolf Weiler",
  "nome_curto": "Adolf Weiler",
  "ano_nascimento": "1851",
  "ano_morte": "1916",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weiler/",
  "lugar_nascimento": "Winterthur, Zürich canton, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Adolf Weiler\nwas born in Winterthur\n(\ncanton Zürich\n)\n. After having completed his primary and secondary school education in his native town he matriculated at the Department for Mathematics Teachers at the Polytechnic in\n1868\n, graduating in\n1871\n. He worked as a private tutor for a year before studying in Germany, first at the University of Göttingen and then at the Friedrich-Alexander-University in Erlangen, where he obtained a doctorate in\n1873\n. His supervisor was\nKlein\n, and his thesis was entitled\nÜber die verschiedenen Gattungen der Komplexe\n2\n. Grades\n(\nOn the Different Classes of Complexes of Second Order\n)\n.\nUpon his return to Switzerland, Weiler first worked as a mathematics lecturer at the Ryffel Institute in Stäfa\n(\ncanton Zürich\n)\n. In\n1878\nhe was appointed to a teaching post for mathematics at the women teachers' college in Zürich. Weiler also\nhabilitated\nas\nPrivatdozent\nat both the Polytechnic and the University of Zürich. He stayed at the Polytechnic, where he was also\nWilhelm Fiedler\n's assistant, from\n1875\n-\n1901\nand started his job at the University in\n1891\n. There he taught analytic and descriptive geometry, later on he also lectured on map projection. In\n1899\nhe became a Titularprofessor for geometry at the university. At the beginning of the\n20\nth\ncentury Weiler supervised five doctoral students in total, but none of them became influential mathematicians.\nWeiler's research interests lay in\nSteiner\ngeometry; in particular, he was interested in complexes and congruencies of rays. He published a range of papers on problems in descriptive geometry, axonometry and map projections. Two examples of his papers are\nNeue Behandlung der Parallelprojektionen und der Axonometrie\nⓉ\n(\nNew treatment of parallel projections and axonometry\n)\n(1889)\nand\nGeometrisches über einige Abbildungen der Kugel in der Kartenprojektion\nⓉ\n(\nGeometric of some pictures of the sphere in the map projection\n)\n(1903)\n.\nWeiler joined the organising committee of the first International Congress of Mathematicians in December\n1896\n, but he did not have a specific position and is not mentioned in the committee minutes\n(\nexcept for the attendance records\n)\n."
}