{
  "nome_completo": "Adrien-Marie Legendre",
  "nome_curto": "Adrien-Marie Legendre",
  "ano_nascimento": "1752",
  "ano_morte": "1833",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Legendre/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Adrien-Marie Legendre\nwould perhaps have disliked the fact that this article contains details of his life for\nPoisson\nwrote of him in\n[\n12\n]\n:-\nOur colleague has often expressed the desire that, in speaking of him, it would only be the matter of his works, which are, in fact, his entire life.\nIt is not surprising that, given these views of Legendre, there are few details of his early life. We have given his place of birth as Paris, as given in\n[\n1\n]\nand\n[\n2\n]\n, but there is some evidence to suggest that he was born in Toulouse and the family moved to Paris when he was very young. He certainly came from a wealthy family and he was given a top quality education in mathematics and physics at the Collège Mazarin in Paris.\nIn\n1770\n, at the age of\n18\n, Legendre defended his thesis in mathematics and physics at the Collège Mazarin but this was not quite as grand an achievement as it sounds to us today, for this consisted more of a plan of research rather than a completed thesis. In the thesis he listed the literature that he would study and the results that he would be aiming to prove. With no need for employment to support himself, Legendre lived in Paris and concentrated on research.\nFrom\n1775\nto\n1780\nhe taught with\nLaplace\nat École Militaire where his appointment was made on the advice of\nd'Alembert\n. He then decided to enter for the\n1782\nprize on projectiles offered by the\nBerlin Academy\n. The actual task was stated as follows:-\nDetermine the curve described by cannonballs and bombs, taking into consideration the resistance of the air; give rules for obtaining the ranges corresponding to different initial velocities and to different angles of projection.\nHis essay\nRecherches sur la trajectoire des projectiles dans les milieux résistants\nⓉ\n(\nResearch on the trajectories of projectiles in a resistant medium\n)\nwon the prize and launched Legendre on his research career. In\n1782\nLagrange\nwas Director of Mathematics at the Academy in Berlin and this brought Legendre to his attention. He wrote to\nLaplace\nasking for more information about the prize winning young mathematician.\nLegendre next studied the attraction of ellipsoids. He gave a proof of a result due to\nMaclaurin\n, that the attractions at an external point lying on the principal axis of two confocal ellipsoids was proportional to their masses. He then introduced what we call today the Legendre functions and used these to determine, using power series, the attraction of an ellipsoid at any exterior point. Legendre submitted his results to the\nAcadémie des Sciences\nin Paris in January\n1783\nand these were highly praised by\nLaplace\nin his report delivered to the\nAcadémie\nin March. Within a few days, on\n30\nMarch, Legendre was appointed an adjoint in the\nAcadémie des Sciences\nfilling the place which had become vacant when\nLaplace\nwas promoted from adjoint to associé earlier that year.\nOver the next few years Legendre published work in a number of areas. In particular he published on celestial mechanics with papers such as\nRecherches sur la figure des planètes\nⓉ\n(\nResearch on the shape of planets\n)\nin\n1784\nwhich contains the Legendre polynomials;\nnumber theory\nwith, for example,\nRecherches d'analyse indéterminée\nⓉ\n(\nResearch on indefinite analysis\n)\nin\n1785\n; and the theory of\nelliptic functions\nwith papers on integrations by elliptic arcs in\n1786\n.\nThe\n1785\npaper on number theory contains a number of important results such as the law of\nquadratic reciprocity\nfor residues and the results that every arithmetic series with the first term\ncoprime\nto the common difference contains an infinite number of\nprimes\n. Of course today we attribute the law of quadratic reciprocity to\nGauss\nand the theorem concerning primes in an\narithmetic progression\nto\nDirichlet\n. This is fair since Legendre's proof of quadratic reciprocity was unsatisfactory, while he offered no proof of the theorem on primes in an arithmetic progression. However, these two results are of great importance and credit should go to Legendre for his work on them, although he was not the first to state the law of quadratic reciprocity since it occurs in\nEuler\n's work of\n1751\nand also of\n1783\n(\nsee\n[\n15\n]\n)\n.\nLegendre's career in the\nAcadémie des Sciences\nprogressed in a satisfactory manner. He became an associé in\n1785\nand then in\n1787\nhe was a member of the team whose task it was to work with the Royal Observatory at Greenwich in London on measurements of the Earth involving a triangulation survey between the Paris and Greenwich observatories. This work resulted in his election to the\nRoyal Society of London\nin\n1787\nand also to an important publication\nMémoire sur les opérations trigonométriques dont les résultats dépendent de la figure de la terre\nwhich contains Legendre's theorem on spherical triangles.\nOn\n13\nMay\n1791\nLegendre became a member of the committee of the\nAcadémie des Sciences\nwith the task to standardise weights and measures. The committee worked on the metric system and undertook the necessary astronomical observations and triangulations necessary to compute the length of the metre. At this time Legendre was also working on his major text\nEléments de géométrie\nwhich he had been encouraged to write by\nCondorcet\n. However the\nAcadémie des Sciences\nwas closed due to the Revolution in\n1793\nand Legendre had special difficulties since he lost the capital which provided him with a comfortable income. He later wrote to\nJacobi\nexplaining his personal circumstances around this time\n(\nsee\n[\n1\n]\n)\n:-\nI married following a bloody revolution that had destroyed my small fortune; we had great problems and some very difficult moments, but my wife staunchly helped me to put my affairs in order little by little and gave me the tranquillity necessary for my customary work and for writing new works which have steadily increased my reputation.\nFollowing the work of the committee on the decimal system on which Legendre had served,\nde Prony\nin\n1792\nbegan a major task of producing logarithmic and trigonometric tables, the Cadastre. Legendre and\nde Prony\nheaded the mathematical section of this project along with\nCarnot\nand other mathematicians. They had between\n70\nto\n80\nassistants and the work was undertaken over a period of years, being completed in\n1801\n.\nIn\n1794\nLegendre published\nEléments de géométrie\nⓉ\n(\nElements of geometry\n)\nwhich was the leading elementary text on the topic for around\n100\nyears. The work is described in\n[\n2\n]\n:-\nIn his \"Eléments\" Legendre greatly rearranged and simplified many of the propositions from\nEuclid\n's \"Elements\" to create a more effective textbook. Legendre's work replaced\nEuclid\n's \"Elements\" as a textbook in most of Europe and, in succeeding translations, in the United States and became the prototype of later geometry texts. In \"Eléments\" Legendre gave a simple proof that π is\nirrational\n, as well as the first proof that\nπ\n2\n\\pi^{2}\nπ\n2\nis irrational, and conjectured that π is not the root of any algebraic equation of finite degree with\nrational\ncoefficients.\nIn\n1795\nthe\nAcadémie des Sciences\nwas reopened as the Institut National des Sciences et des Arts and from then until\n1806\nit met in the Louvre. Each section of the Institut contained six places, and Legendre was one of the six in the mathematics section. In\n1803\nNapoleon reorganised the Institut and a geometry section was created and Legendre was put into this section.\nLegendre published a book on determining the orbits of comets in\n1806\n. In this he wrote:-\nI have thought that what there was better to do in the problem of comets was to start out from the immediate data of observation, and to use all means to simplify as much as possible the formulas and the equations which serve to determine the elements of the orbit.\nHis method involved three observations taken at equal intervals and he assumed that the comet followed a parabolic path so that he ended up with more equations than there were unknowns. He applied his methods to the data known for two comets. In an appendix Legendre gave the least squares method of fitting a curve to the data available. However,\nGauss\npublished his version of the least squares method in\n1809\nand, while acknowledging that it appeared in Legendre's book, Gauss still claimed priority for himself. This greatly hurt Legendre who fought for many years to have his priority recognised.\nIn\n1808\nLegendre published a second edition of his\nThéorie des nombres\nⓉ\n(\nNumber theory\n)\nwhich was a considerable improvement on the first edition of\n1798\n. For example\nGauss\nhad proved the law of quadratic reciprocity in\n1801\nafter making critical remarks about Legendre's proof of\n1785\nand Legendre's much improved proof of\n1798\nin the first edition of\nThéorie des nombres\nⓉ\n(\nNumber theory\n)\n.\nGauss\nwas correct, but one could understand how hurtful Legendre must have found an attack on the rigour of his results by such a young man. Of course\nGauss\ndid not state that he was improving Legendre's result but rather claimed the result for himself since his was the first completely rigorous proof. Legendre later wrote\n(\nsee\n[\n20\n]\n)\n:-\nThis excessive impudence is unbelievable in a man who has sufficient personal merit not to have need of appropriating the discoveries of others.\nTo his credit Legendre used\nGauss\n's proof of quadratic reciprocity in the\n1808\nedition of\nThéorie des nombres\nⓉ\n(\nNumber theory\n)\ngiving proper credit to\nGauss\n. The\n1808\nedition of\nThéorie des nombres\nⓉ\n(\nNumber theory\n)\nalso contained Legendre's estimate for\nπ\n(\nn\n)\n\\pi(n)\nπ\n(\nn\n)\nthe number of primes ≤\nn\nn\nn\nof\nπ\n(\nn\n)\n=\nn\n/\n(\nlog\n⁡\n(\nn\n)\n−\n1.08366\n)\n\\pi(n) = n/(\\log(n) - 1.08366)\nπ\n(\nn\n)\n=\nn\n/\n(\nlo\ng\n(\nn\n)\n−\n1\n.\n0\n8\n3\n6\n6\n)\n. Again\nGauss\nwould claim that he had obtained the law for the asymptotic distribution of primes before Legendre, but certainly it was Legendre who first brought these ideas to the attention of mathematicians.\nMore information about Legendre's estimate for\nπ\n(\nn\n)\n\\pi(n)\nπ\n(\nn\n)\nis at\nTHIS LINK\n.\nYou can see a graph of the eror in Legendre's estimate at\nTHIS LINK\nand a comparison of Legendre's estimate to that of Gauss at\nTHIS LINK\n.\nLegendre's major work on elliptic functions in\nExercices du Calcul Intégral\nⓉ\n(\nExercises in integral calculus\n)\nappeared in three volumes in\n1811\n,\n1817\n, and\n1819\n. In the first volume Legendre introduced basic properties of elliptic integrals and also of\nbeta\nand\ngamma functions\n. More results on beta and gamma functions appeared in the second volume together with applications of his results to mechanics, the rotation of the Earth, the attraction of ellipsoids and other problems. The third volume was largely devoted to tables of elliptic integrals.\nIn November\n1824\nhe decided to reprint a new edition but he was not happy with this work by September\n1825\npublication began of his new work\nTraité des Fonctions Elliptiques\nⓉ\n(\nTreatise on elliptic functions\n)\nagain in three volumes of\n1825\n,\n1826\n, and\n1830\n. This new work covered similar material to the original but the material was completely reorganised. However, despite spending\n40\nyears working on elliptic functions, Legendre never gained the insight of\nJacobi\nand\nAbel\nand the independent work of these two mathematicians was making Legendre's new three volume work obsolete almost as soon as it was published.\nLegendre's attempt to prove the\nparallel postulate\nextended over\n30\nyears. However as stated in\n[\n1\n]\nhis attempts:-\n... all failed because he always relied, in the last analysis, on propositions that were \"evident\" from the Euclidean point of view.\nIn\n1832\n(\nthe year\nBolyai\npublished his work on\nnon-euclidean geometry\n)\nLegendre confirmed his absolute belief in Euclidean space when he wrote:-\nIt is nevertheless certain that the theorem on the sum of the three angles of the triangle should be considered one of those fundamental truths that are impossible to contest and that are an enduring example of mathematical certitude.\nIn\n1824\nLegendre refused to vote for the government's candidate for the Institut National.\nAbel\nwrote in October\n1826\n:-\nLegendre is an extremely amiable man, but unfortunately as old as the stones.\nAs a result of Legendre's refusal to vote for the government's candidate in\n1824\nhis pension was stopped and he died in poverty."
}