{
  "nome_completo": "Agnes Ermina Wells",
  "nome_curto": "Agnes Wells",
  "ano_nascimento": "1876",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wells/",
  "lugar_nascimento": "Saginaw, Michigan, USA",
  "lugar_morte": "Saginaw, Michigan, USA",
  "biografia": "Agnes Wells\nwas the daughter of Edgar Sylvanus Wells\n(1837\n-\n1913)\nand Julia Hartness Comstock\n(1843\n-\n1926)\n. Edgar Wells is listed as a mill owner in the\n1870\ncensus, but he appears as a clerk in the\n1880\ncensus. Edgar married Julia on\n18\nMay\n1868\nin Wabasha, Minnesota; they had four children: William Chester Wells\n(1873\n-\n1873)\nwho died when\n8\ndays old; Agnes Ermina Wells\n(1876\n-\n1959)\n, the subject of this biography; Benjamin Warren Wells\n(1878\n-\n1966)\nwho became a dentist; and Florence Eugenia Wells\n(1880\n-\n1968)\nwho became a High School teacher. We note that\n[\n20\n]\nstates that Agnes Wells:-\n... was descended from Nicholas Wadham, who with his wife, Dorothy, founded Wadham College at Oxford, England, in\n1610\n.\nThis is a little misleading since Nicholas Wadham and his wife Dorothy had no children. Agnes Wells is, however, related to the Wadham family. Her grandfather Benjamin Wells\n(1802\n-\n1889)\nmarried Jane Ann Wadhams\n(1804\n-\n1885)\n. The Wadham family seem to have added an \"s\" to their name when in America. Details of how Benjamin Wells and Jane Ann Wadhams fit into the Wadham family are given in\n[\n29\n]\n.\nAgnes attended the West Side Saginaw High School. This school became the Arthur Hill High School around the beginning of the\n20\nth century, named for the lumbering and shipping owner, Arthur Hill who gave money to support Saginaw schools and the University of Michigan. Agnes graduated from the High School in\n1894\n, then spent the year\n1895\n-\n96\nat the Saginaw County Training School for Teachers. On\n22\nSeptember\n1896\n, Wells made an application for a passport so that she could spend a year abroad. On the passport application she gives the following personal details: Occupation: Teacher. Age:\n20\nyears old. Height:\n5\nft\n2\nin. Forehead: High. Eyes: Blue. Nose: Regular. Mouth: Regular. Chin: Broad. Hair: Light Brown. Complexion: Fair. She then travelled to Dresden, Germany, where she studied the German language and music.\nBack in the United States, Wells undertook private study before entering the University of Michigan in\n1899\nwhere she majored in mathematics with physics as a minor subject. She spent the year\n1901\n-\n02\nat Bryn Mawr College where she took courses on mathematics and physics. After the year at Bryn Mawr, she returned to the University of Michigan where she graduated in\n1903\nwith a Bachelor of Arts degree. After graduating, she was appointed in\n1903\nas the Principal of Crystal Falls High School in Crystal Falls, Michigan, and a Teacher of Mathematics in that school where she also taught physics and biology\n[\n17\n]\n:-\nThe history of basketball in Crystal Falls High School dates back to the year\n1904\n. This was the year in which Miss Agnes Wells, then Principal of the school, started basketball using girls' rules. Although there were no records kept for that year, a game was played with Norway High School at the Opera House in Crystal Falls.\nWells was only two years at Crystal Falls High School before becoming a Teacher of Mathematics in the Central High School, Duluth, Minnesota in\n1905\n. Duluth is a city on the western tip of Lake Superior. There she met the teacher Lydia Dudley Woodbridge\n(1875\n-\n1946)\nand the two became good friends. Woodbridge, the daughter of William Starkweather Woodbridge\n(\nborn June\n1845)\nand Frances Angelina Poole\n(\nborn November\n1840)\n, had graduated from Mount Holyoke College in\n1897\nand became a teacher at Central High School, Duluth.\nThere are two reports concerning Wells in June\n1908\nin\nThe Duluth Evening Herald\n. The first, on\n1\nJune, states\n[\n10\n]\n:-\nThe Zenith, the annual publication of the Duluth Central High School, was issued today ... it is a decidedly fine piece of work and reflects credit on the student staff. The Zenith is dedicated to Miss Agnes Wells of the high school faculty.\nThe second report, two days later, states\n[\n26\n]\n:-\nMiss Agnes Wells will go to Saginaw Friday afternoon for a few days visit before leaving for her European trip.\nIn Duluth, Wells lived at\n4811\nMcCulloch Street but at the time of the\n1910\ncensus she was in her parents' house in Madison Street, Saginaw. She became the Head of the Mathematics Department of the Central High School, Duluth in\n1912\n; she was also a Teacher of Sex Hygiene for Girls,\n1913\n-\n14\n. It was in June\n1914\nthat Wells left Central High School, Duluth and, after the summer, began teaching at Carleton College where she also studied for a Master's Degree. Before leaving Duluth, a dinner was held in her honour in May\n1914\n[\n27\n]\n:-\nThe Thalian society of Central high school will give a dinner this evening at\n6\no'clock in the lunch room of the school in honour of Miss Agnes Wells of the mathematics department, who will teach next year at Carleton college.\nOn the following day they reported\n[\n12\n]\n:-\nThe Thalian society held a farewell banquet in honour of Miss Agnes Wells on Friday evening at the Washington building. Miss Wells will complete her work at Central in June and will go to Carleton college in the fall to continue her professional work as an instructor of mathematics.\nAt Carleton College, Wells studied for a Master's Degree in Astronomy advised by Herbert Couper Wilson\n(1858\n-\n1940)\n, the Professor of Astronomy and Director of the Goodsell Observatory. Wells wrote\n[\n30\n]\n:-\nA study of the positions and proper motions of one hundred and fifty stars of the Pleiades group measured on photographic plates taken at the Goodsell Observatory was undertaken in order to determine the positions of many of the faint stars up to the fifteenth magnitude near Merope and between Merope and Alcyone; and to compare the results for stars up to the ninth magnitude with those for forty six stars, whose positions had been well determined at Königsberg, Ya\n1\ne, Columbia, Paris and Oxford. The work was begun at Goodsell Observatory, Carleton College, Northfield, Minnesota, in\n1915\n. Two photographic plates were taken in December\n1915\nand were measured and reduced during the spring of\n1916\n.\nThis work would later continue as part of her Ph.D. studies. She was awarded a Master's Degree in\n1916\nand, in that year, accepted the position as Social Director of the Helen Newberry Residence at the University of Michigan in Ann Arbor. She was also Acting Dean of Women at University of Michigan during the summers of\n1917\nand\n1918\n(\nsee\n[\n4\n]\n)\n.\nIn\n1918\nWells was appointed Dean of Women and Professor of Mathematics at Indiana University. In the same year her friend Lydia Woodbridge was also appointed to Indiana University and they lived together at\n715\nEast\n8\nth Street, Bloomington, Monroe, Indiana. In the\n1920\nU.S. census, Agnes E Wells is listed as \"Head of House\" and Lydia Woodbridge gives her relation to Wells as \"Partner\". They continued to live together until Lydia died in\n1946\n. On the\n1930\nand\n1940\ncensus, Wells is listed as \"Head of House\" and Lydia gives her relation to Wells as \"Roomer\" in\n1930\nand \"Partner\" in\n1940\n. Let us note at this point that shortly after Lydia Woodbridge died in July\n1946\n, Wells wrote to a friend telling her of the death of Lydia who had been her \"friend of\n41\nyears and house-companion for\n28\nyears.\"\nReturning to Wells' career after she joined Indiana University, we note that in addition to being Dean of Women and Professor of Mathematics, she also continued research for a Ph.D. from the University of Michigan. Her research was supervised by Ralph Hamilton Curtiss\n(1880\n-\n1929)\n, the professor of astrophysics at the University of Michigan and by William Hussey\n(1862\n-\n1926)\n, the director of the Observatory of the University of Michigan. Wells was awarded a Ph.D. in\n1924\nfor her thesis\nA study of the relative proper motions and radial velocities of stars in the Pleiades group\n.\nYou can see extracts from this thesis at\nTHIS LINK\n.\nOne of her early important contributions was her efforts in founding Mortar Board, an American national honour society for college seniors. She added her support at the first national convention on\n15\nFebruary\n1918\n[\n1\n]\n:-\nAt the University of Michigan in\n1918\nDean Wells helped to found Mortar Board when representatives of women's honoraries at Swarthmore College, Cornell University, Ohio State University and the University of Michigan met at Syracuse, New York, to form a national honorary for senior women. At Indiana University she helped to found the chapter of Mortar Board there in\n1921\nand served as an adviser until her retirement.\nThis was a time when a woman in a leadership role faced many difficulties. Wells certainly did not mind being controversial as various contributors to an Indiana University remembrance noted. One mentions that she\n[\n28\n]\n:-\n... faced criticism for her strong views. In the late\n1920\ns, she caused quite a controversy after implementing a 'no bloomers, no classes' rule that required women to wear bloomers under their skirts and dresses at all times. Though faced with ardent backlash from students and newspapers across the state, Wells continued to enforce the rule.\nThis was not just a little local event, for it led to the following piece in\nTime\nmagazine of Monday,\n23\nJanuary\n1928\n[\n8\n]\n:-\nKnees\n\"All co-eds must wear bloomers reaching to the tops of their hose at all times,\" decreed Dean Agnes Ermina Wells, Indiana University. It all started when a pretty co-ed crossed her legs in the library. An admiring student wrote a note, mentioned knees, and asked for a date.\nAfter being awarded her Ph.D. in\n1924\nWells was elected to the Indiana Academy of Science. Although from that time on she appears to have done no further research, nevertheless she was a very effective teacher of both mathematics and astronomy. The importance of her contributions to Indiana University was made clear by the President of the University, Herman B Wells\n(1902\n-\n2000)\n, in a speech made when Agnes Wells retired in\n1944\n[\n1\n]\n:-\nFor\n20\nyears Miss Wells has been more than Dean of Women. Not only has she discharged the routine duties of her office with extraordinary skill and great success, but she has worked diligently to further the program of education here and elsewhere. The beginning of our dormitory system is generally attributed to her farsighted and energetic leadership. Throughout all her administration she has maintained standards of scholarship and character of very high order.\nThe National Society Daughters of the American Revolution\n(\nD.A.R.\n)\nis an organisation whose members are descendants of soldiers who fought for the independence of the United States. Wells became an active member of this organisation, serving as Regent of the Bloomington Chapter in\n1945\n-\n46\n. She was a descendant of a soldier in the Revolutionary War through a Wadham's link. Her grandmother Jane Ann Wadhams, mentioned above, was the daughter of Luman Wadhams\n(1781\n-\n1832)\nand Lucy Bostwick\n(1772\n-\n1857)\n. Luman Wadhams was the son of Abraham Wadhams\n(1756\n-\n1834)\n, who was born and died in Goshen, Litchfield, Connecticut. Abraham Wadhams' name appears among those who enlisted from Goshen, Torrington and Warren at Litchfield, on\n21\nJanuary\n1776\n. He served in a regiment commanded by Colonel Andrew Ward, Jr., under Major General Lee, then in Captain Stephen Goodwin's company, Colonel Fisher Gay's Connecticut regiment, to re-enforce George Washington's army at New York.\nAgnes Wells did outstanding work in fighting for equal status of women. Her work in this area is described in several of the biographies quoted in the reference to this article. We choose to give a long quote from\n[\n20\n]\nwhere a good account of her contributions is given:-\nA woman of vision and great resolve, she was an active leader in many professional and women's organisations. She founded a $\n1\nmillion fellowship fund for the American Association of University Women and also campaigned for world government.\nShe belonged to Daughters of the American Revolution, the National Society of the Daughters of\n1812\n, Business and Professional Women, the American Association of Deans of Women and the American Association of University Professors. She held life memberships in the Michigan Alumni and Alumnae Association. Other organisations to which she belonged included Phi Beta Kappa, national scholastic honorary; Gamma Phi Beta, social sorority; Sigma Xi, national scientific organisation; the National Education Association, Indiana University Alumnae Association, Indiana Academy of Science and the YWCA.\nIn\n1949\n, she became chairman of the National Women's Party. She always stated her objectives and hopes for women's equality in a clear, straightforward manner. Dr Wells lamented at the legal restrictions and discrimination once operative against women. Dr Wells used to point out that it not only was tasks that women couldn't do well which were made inaccessible to them through legislation but also positions for which they had the capacity and skill. She felt this kept many women from administrative positions. She used to say that those who argue about the woman's place being in the home often overlook the unmarried woman, who unless she has wealth, must go out and earn her own living.\nThe National Women's Party has a militant past: connected with the passage of the woman's suffrage constitutional amendment, picketing the White House when Woodrow Wilson was President, imprisonment for disturbing the peace, hunger strikes, and forced feeding. As president of the National Women's party, Dr Wells carried on an effective but less militant spirit for the \"equal rights for women\" amendment.\nDr Wells once commented on a newspaper editorial which advised women to look at the\n14\nth amendment to the constitution which doesn't mention sex but which does say that all persons born or naturalised in the United States are citizens, that their privileges cannot be denied or abridged and that they shall be equal before the law. Dr Wells asked the question: \"Women are persons, aren't they?\"\n\"World government is the only key to world peace,\" she once said. \"Until we achieve that we should not stop worrying. World union may look like an immense task, but so did national union appear to the\n13\nAmerican colonies who put as much stock in their states' rights as we do by national sovereignty.\"\nShe was the national first vice president of the American Association of University Women and was the second state president of the AAUW Indiana Chapter.\nWells retired from Indiana University in two stages. In\n1938\nshe retired in her role as Dean of Women but she continued to lecture on topics in mathematics and astronomy until\n1944\nwhen she reached the age of\n68\n. She continued to live in Bloomington, Indiana with her partner Lydia Woodbridge until Lydia's death on\n28\nJuly\n1946\n. Later Wells returned to the city of her birth, Saginaw, Michigan, where she lived with her sister Florence Eugenia Wells. She died on\n6\nJuly\n1959\nand was buried in Oakwood Cemetery, Saginaw.\nIndiana University named the Agnes E Wells quadrangle in Wells' honour; it is surrounded by Morrison Hall, Sycamore Hall, Memorial Hall, and Goodbody Hall. Morrison Hall houses the Kinsey Institute, founded in\n1938\nand named after the pioneer of human sexuality research Alfred Kinsey. Goodbody and Memorial Hall were rededicated as student housing in August\n2017\nin Wells' honour.\nThe obituary to Wells in the\nProceedings\nof the Indiana Academy of Science ends with this tribute\n[\n1\n]\n:-\nAgnes E Wells was a most talented woman with considerable scientific ability. However, she devoted most of her professional life to the guidance of college women students and the improvement of women's status in our complex American civilisation. A woman of great integrity and deep sincerity, she left a lasting influence for good in the lives of the many thousands of humans with whom she worked."
}