{
  "nome_completo": "Agnes Sime Baxter",
  "nome_curto": "Agnes Baxter",
  "ano_nascimento": "1870",
  "ano_morte": "1917",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baxter/",
  "lugar_nascimento": "Halifax, Nova Scotia, Canada",
  "lugar_morte": "Columbia, Missouri, USA",
  "biografia": "Agnes Baxter\nwas the daughter of Robert Baxter and Janet Methven\n(\nin later years she seems to have used the spelling Jennet rather than Janet\n)\n. Robert Baxter was born on\n9\nFebruary\n1844\nin Kirkcaldy, Fife, Scotland to Robert Baxter and Elizabeth Grieve, and died in\n1918\n. Agnes' mother, Janet Methven, was born on\n13\nJuly\n1846\nin Scoonie, Fife, Scotland to Colville Methven and Helen Syme, and died in\n1936\n. Robert and Janet Baxter were married in Cults, Fife, Scotland in\n1869\nand emigrated to Canada in that year. Robert Baxter and his wife had both been brought up in Scotland where Robert had been the manager of an electric light company before emigrating to Nova Scotia. The family settled in Halifax and in that city Robert was employed by the Halifax Gas Light Company, first as a foreman and later as manager. Robert and Janet Baxter had four children: Agnes Sime Baxter\n(1870\n-\n1917)\n, the subject of this biography, Robert Colin Baxter\n(1872\n-\n1879)\nwho died aged\n6\nor\n7\n, Elizabeth Campbell Baxter\n(1883\n-\n1932)\nand Norman McLeod Baxter\n(1883\n-\n1937)\n. Elizabeth and Norman were twins, born on\n27\nJune\n1883\n. Let us quote at this point the obituary of Norman Baxter\n[\n9\n]\n:-\nNorman McLeod Baxter transmission engineer, Ohio Public Service Company, Elyria, died\n24\nJune\n1937\n. Mr Baxter was born at Halifax, Nova Scotia,\n27\nJune\n1883\n, and attended University Dalhousie\n(\nNova Scotia\n)\nand the University of Nebraska. In\n1905\nhe became affiliated with the Lincoln\n(\nNebraska\n)\nGas and Electric Light Company as a draftsman, but later was placed in charge of construction and eventually became superintendent of gas and electric distribution before transferring to The Lorain County Electric Company, which later became a part of the Ohio Public Service Company, as general superintendent in\n1916\n. From\n1919\nto\n1922\nMr Baxter was associated briefly with a public utility company in Connecticut and with the engineering department of The Toledo\n(\nOhio\n)\nEdison Company. In\n1922\nhe returned to the employ of the Ohio Edison Company as transmission engineer, and served continuously in that capacity for almost\n15\nyears.\nThe only details that we have found for Agnes' sister Elizabeth Campbell Baxter are from Border Crossing records when she visited Agnes in Columbia in the United States\n(\nfor example in\n1915)\nand from Canadian censuses. Known widely as Lizzie, she became a stenographer and continued to live with her parents in Franklin Street, Halifax, Canada. After the death of her father in\n1918\nshe continued to live with her widowed mother in Halifax. At the time of the\n1921\ncensus they were living at\n13\n1\n2\n13\\large\\frac{1}{2}\\normalsize\n1\n3\n2\n1\n​\nMitchell Street, Halifax City.\nLittle is known of Agnes's childhood and pre-university education, other than the few details given in the Canadian censuses of\n1871\nand\n1881\n. These give her religion as Church of Scotland and at the time of the\n1881\nshe is eleven years old and attending school in Halifax. We do know that her family, who, when she was young lived at\n2\nGas Lane, Halifax, were comparatively well off and she must have had good schooling;\n[\n1\n]\nrefers to her \"long and careful preparation\" for university study. We know that in\n1887\nshe entered Dalhousie University and, after studying mathematics and other science subjects, she graduated with a B.A. with first class honours in Mathematics and Mathematical Physics in\n1891\n.\nBaxter had been taught mathematics at Dalhousie University by Charles Macdonald\n(1828\n-\n1901)\nand mathematical physics by James Gordon MacGregor\n(1852\n-\n1913)\n. Charles Macdonald had been born and brought up in Aberdeen, Scotland. After graduating from King's College, Aberdeen, he taught mathematics at Aberdeen Grammar School before becoming Chair of Mathematics at Dalhousie College, Halifax, Canada in\n1863\n. He had the reputation of being an enthusiastic and inspiring lecturer who gave his students a firm basis for their mathematical knowledge. Gordon MacGregor had been born in Halifax and had studied at Dalhousie where he was taught by Charles Macdonald, then at the University of Edinburgh in Scotland, where he worked with\nPeter Guthrie Tait\n. He continued undertaking research in Leipzig in Germany and finally in the University of London before returning to Dalhousie as a lecturer in\n1877\n. He became Professor of Physics at Dalhousie in\n1879\n. He was an enthusiastic researcher and returned to Scotland to succeed\nTait\nin the Edinburgh chair in\n1901\n.\nIt must have been a difficult time for a woman such as Baxter taking what were considered at that time to be men's subjects. Although few women studied mathematics, Baxter was not the only one studying mathematics at Dalhousie; for example there were two other women in the class of\n24\nthat studied second level mathematics with her. Her performance at university was outstanding and she was awarded a distinction and received the Sir William Young Gold Medal. With the award of her B.A. degree Baxter became the first ever woman to graduate with honours from Dalhousie University. But more than this, she had been clearly the best student in both mathematics and mathematical physics.\nBaxter remained at Dalhousie University to take a Master's Degree in Mathematics, which she received in\n1892\n[\n1\n]\n:-\nAbout the time of her graduation, the old M.A. Course was changed for the better. Indeed, it was revolutionised. Like most Canadian colleges of the time, Dalhousie gave the Master's Degree for a thesis, after the candidate had held the Bachelor's Degree for several years. The degree was easy to get, and there were few applicants. As soon as it was made hard to get by requiring a full year of study, it became popular. Miss Baxter spent another year in the study of Mathematics and Mathematical Physics and was awarded the degree of M.A. in\n1892\n.\nShe studied for her doctorate at Cornell University being awarded the 'Erastus Brooks Fellowship\n(\nDalhousie College\n)\nMathematics' in her final year\n1894\n-\n95\n. There her doctoral studies were supervised by James Edward Oliver\n(1829\n-\n1895)\n. Laurent Saloff-Coste writes\n[\n14\n]\n:-\nIn my opinion, the most important character in the entire history of Mathematics at Cornell is James Edward Oliver, the second Chair of the Department, who served as chair for\n21\nyears from\n1874\nto his death in\n1895\n. Although there is no remaining traces of his mathematics activities, he was considered a mathematics genius in the context of the American scientific community of his time\n(\nhe was a Fellow of the\nAmerican Academy of Arts and Sciences\nand a member of the\nNational Academy of Science\n)\n. He devoted his professional life to establishing an ambitious research oriented mathematics department and graduate program at Cornell. The department Colloquium, which he created as a mathematical club in\n1891\n, has been named after him since\n1898\n.\nIn fact the first three women to be awarded a Ph.D. in mathematics from Cornell University,\nIda Metcalf\n(\nPh.D. thesis\nGeometric Duality in Space\n,\n1893)\n,\nAnnie MacKinnon\n(\nPh.D. thesis\nConcomitant Binary Forms in Terms of the Roots\n,\n1894)\nand Agnes Baxter\n(\nPh.D.\n1895)\nwere all advised by James Oliver.\nWhen she graduated in\n1895\n, Baxter became only the second Canadian woman to be awarded Ph.D. in Mathematics. On a wider scale, she was only the fourth woman to receive such a degree in the whole of North America. The degree was awarded for her thesis\nOn Abelian Integrals, a Resume of Neumann's Abelsche Integral with Comments and Applications\n. Her main subject was pure mathematics but she also had mathematical physics as her first minor subject and physics as her second minor subject.\nJames Oliver died in the year that Baxter was awarded her Ph.D. and his mathematical notes were edited by Baxter for publication. Despite serious attempts to locate this publication, we have been unable to trace it and can only assume that it has never been published.\nAlbert Ross Hill had graduated from Dalhousie University in the same year as Baxter and had also studied for a doctorate at Cornell but his topic was philosophy, not mathematics. Ross Hill was appointed professor of psychology and education at the State Normal School in Oshkosh, Wisconsin. In\n1896\n, the year after Ross Hill and Baxter were awarded their doctorates from Cornell, they married in Halifax, Nova Scotia, Canada on\n20\nAugust and moved to Lincoln, Nebraska where Ross Hill became a professor of philosophy at the University of Nebraska. Baxter decided to give up her promising mathematics career in order to support her husband's academic career. Their first child, Jessie Methven Hill, was born in Lincoln Nebraska on\n13\nDecember\n1897\n. Their second child, Esther Davidson Hill, was born in Nebraska on\n19\nMarch\n1903\n. In\n1903\nRoss Hill became Professor and Dean of the School of Education at the University of Missouri. We note that in\n[\n16\n]\nit is recorded that in\n1905\nAgnes was elected as a graduate student member of the Missouri Chapter. It also records that in\n1894\nshe became a Charter member of the Cornell Chapter.\nThe family returned to Cornell for the academic year\n1907\n-\n08\nwhen Ross Hill was appointed Professor, Director of the School of Education, and Dean of the College of Arts and Sciences. In\n1908\n, however, they were once more back at the University of Missouri where Ross Hill became the President.\nThroughout Ross Hill's career, his wife supported him strongly despite her increasing health problems\n[\n1\n]\n:-\nA gentle, quiet, reserved nature, she took her place beside her husband in a great state university with dignity and wielded a great influence. For years she was tortured by a cruel disease. At last it yielded to treatment and she was able to look forward to years of usefulness and happiness, though her strength could never be the same again. Then a sickness came which her constitution was too weak to resist and she passed away, after only a few days.\nHer death certificate states the cause of death to be \"hypostatic pneumonia following influenza.\"\nShe was buried on\n11\nMarch\n1917\nin Columbia Cemetery in Columbia, Boone County, Missouri. A simple rectangular stone engraved with \"Agnes B Hill, March\n18\n,\n1870\n. March\n9\n,\n1917\n.\" marks the place.\nAfter her death at the age of\n46\n,\nThe Dalhousie Gazette\ncalled her one of the university's\n[\n3\n]\n:-\n... outstanding graduates, remarkable alike for her intellectual attainment and for her gentle, quite and reserved character.\nThe 'In Memoriam' notice in\nThe Dalhousie Gazette\nbegins\n[\n1\n]\n:-\nA community like a university has in its being the element of permanence. Teachers come and go. A few years pass and the old staff has disappeared. New faces, new methods take their place; but the institution lives on. Generation after generation of students from various reasons elect to attend a certain college or university rather than another. They come; they submit to the discipline of the scholastic life for several years, they receive, for the most part, a certain impress, acquire a certain point of view. Then they go their way and their lives henceforward take a turn which they would not have taken except for the period spent at college. It is a privilege to be enrolled in a distinguished community, to be recognised as a member of an honourable society, whose roots are in the past and whose future cannot be foreseen. Each new student should feel that honour and always remember that he can add his own contribution to the tradition and renown of his college. A graduate who did a notable part in that regard has just passed away - Agnes Baxter\n(\nMrs A Ross Hill\n)\n...\nRoss Hill wanted his wife's memory to be preserved and on her death he donated $\n1000\nto purchase a collection of books at Dalhousie University\n[\n10\n]\n:-\n... to perpetuate the memory of one of its loyal graduates, who gave her life to assist in my educational work instead of making an independent record for herself.\nDalhousie University has, however, gone further in recognising Agnes Baxter. On\n15\nMarch\n1988\nthe Agnes Baxter Reading Room in the Department of Mathematics, Statistics and Computing Science at Dalhousie University was dedicated in a ceremony. The Sir William Young Gold Medal which Baxter won in\n1891\nwas gifted to the Department of Mathematics, Statistics and Computing Science is on show forming part of a display in her memory.\nFinally, let us note that Agnes' elder daughter Jessie Methven Hill married the Professor of English Ralph Allan McCanse\n(1893\n-\n1971)\non\n9\nSeptember\n1933\nin Missouri. Jessie McCanse died in Madison Wisconsin on\n23\nJuly\n1996\n. Agnes' younger daughter, Esther Davidson Hill, married Registrar and Secretary of the Princeton Divinity Faculty, Rev Edward Howell Roberts\n(1895\n-\n1954)\n, on\n22\nDecember\n1928\nin Jackson, Kansas City, Missouri. Esther Roberts died in Princeton on\n10\nFebruary\n1986\n."
}