{
  "nome_completo": "al-Abbas ibn Said Al-Jawhari",
  "nome_curto": "al-Jawhari",
  "ano_nascimento": "800",
  "ano_morte": "860",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Jawhari/",
  "lugar_nascimento": "possibly Baghdad, Iraq",
  "lugar_morte": "possibly Baghdad, Iraq",
  "biografia": "We know little of\nal-Jawhari\n's life except that he was associated with the remarkable House of Wisdom that was set up in Baghdad by the Caliph al-Ma'mun. It is worth looking at the events which led up to the founding of this important centre for learning.\nHarun al-Rashid became the fifth Caliph of the Abbasid dynasty on\n14\nSeptember\n786\n, and ruled from his court in the capital city of Baghdad over the Islam empire which stretched from the Mediterranean to India. He brought culture to his court and tried to establish the intellectual disciplines which at that time were not flourishing in the Arabic world. He had two sons, the eldest was al-Amin while the younger was al-Ma'mun. Harun died in\n809\nand there was an armed conflict between the brothers.\nAl-Ma'mun won the armed struggle and al-Amin was defeated and killed in\n813\n. Following this, al-Ma'mun became Caliph and ruled the empire from Baghdad. He continued the patronage of learning started by his father and founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. He also built up a library of manuscripts, the first major library to be set up since that at Alexandria, collecting important works from Byzantium. In addition to the House of Wisdom, al-Ma'mun set up observatories in which Muslim astronomers could build on the knowledge acquired by earlier peoples.\nAl-Jawhari was employed in the service of al-Ma'mun in Baghdad, although we do not know exactly when he began his work there. Mathematicians such as\nal-Kindi\n,\nal-Khwarizmi\n,\nHunayn ibn Ishaq\n,\nThabit ibn Qurra\nand the\nBanu Musa brothers\nwere also appointed by al-Ma'mun to the House of Wisdom, so a truly remarkable collection of scholars worked there. There are very few instances in the history of mathematics when a larger number of world class mathematicians gathered together and took part in research. Al-Jawhari, although best known as a geometer, made observations in Baghdad from\n829\nto\n830\nwhile working for al-Ma'mun. He left Baghdad before the death of al-Ma'mun in\n833\n, for he was observing in Damascus in\n832\n-\n33\n.\nThe main work by al-Jawhari was\nCommentary on Euclid's Elements\nwhich is listed in the\nFihrist\n(\nIndex\n)\n, a work compiled by the bookseller Ibn an-Nadim in\n988\n.\nCommentary on Euclid's Elements\nis almost the same work described by Nasir al-din\nal-Tusi\n(\nalthough\nal-Tusi\ngives a slightly different title for al-Jawhari's work:\nEmendation of the Elements\n)\n. This work contained nearly fifty propositions additional to those given by\nEuclid\nand included an attempt by al-Jawhari to prove the\nparallel postulate\n. The proof followed similar lines to that attempted by\nSimplicius\nbut it is certainly not a copy of\nSimplicius\n's proof, containing several original ideas.\nAl-Tusi\nquotes six of the nearly fifty propositions which together form what al-Jawhari believed was a proof of the parallel postulate. This means that, as far as we are aware, al-Jawhari was the first Arabic mathematician to attempt such a proof. The fact that the proof fails was certainly noted by\nal-Tusi\n.\nThe paper\n[\n3\n]\ndiscusses a thirteenth century commentary on a short treatise by al-Jawhari. In the short treatise al-Jawhari presents three additions to Book V of\nEuclid\n's\nElements\n, which are meant prove Definition\n5\nwhich defines equal ratio, and Definition\n7\nwhich defines greater ratio. Al-Jawhari's \"proofs\" are examples of early attempts by Muslim mathematicians to understand the difficult concepts in\nEuclid\n's\nElements\n. Berggren, reviewing\n[\n3\n]\n, expresses surprise, not at al-Jawhari's fallacious arguments, but rather the fact that they were still being repeated\n400\nyears later:-\nOne can only wonder, however, at the survival of such ill-conceived alterations of\nEuclid\n's \"Elements\" and their incorporation, so many centuries later, in an Arabic edition of the \"Elements\" composed late in the thirteenth century."
}