{
  "nome_completo": "Shams al-Din Abu Abdallah Al-Khalili",
  "nome_curto": "Al-Khalili",
  "ano_nascimento": "1320",
  "ano_morte": "1380",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Khalili/",
  "lugar_nascimento": "possibly Damascus, Syria",
  "lugar_morte": "possibly Damascus, Syria",
  "biografia": "Al-Khalili\n's full name is Shams al-din Abu Abdallah Muhammad ibn Muhammad al-Khalili. As can be seen from the list of references, much of the study of the work of al-Khalili has been done by David A King, who also wrote the article in\n[\n1\n]\n. Note that the articles\n[\n3\n]\n,\n[\n4\n]\nand\n[\n5\n]\nare reprinted in\n[\n2\n]\n. King writes:-\nAl-Khalili was an astronomer associated with the Umayyad Mosque in Damascus in the latter half of the fourteenth century, who compiled an extensive corpus of tables for timekeeping by the sun and regulating the astronomically defined time of Muslim prayer ...\nOf course, giving tables for timekeeping using astronomical events, requires a thorough understanding of geometry on the sphere and the work by al-Khalili can be seen as the end-product of the work of the Arabs on this mathematical topic. Of course, it is interesting to realise that Muslim mathematicians had to solve this type of problem for religious reasons, and the religious requirements made them delve much more deeply into this area of mathematics than was necessary to solve the much less critical problems of the agricultural calendar.\nThe tables, which were not really studied by historians of mathematics until King worked on them in the\n1970\ns, were used for many centuries in Damascus, Cairo and Istanbul. They consist of\n[\n1\n]\n:-\n... tables for reckoning time by the sun, for the latitude of Damascus; tables for regulating the time of Muslim prayer, for the latitude of Damascus; tables of auxiliary mathematical functions for timekeeping by the sun for all latitudes; tables of auxiliary mathematical functions for solving the problems of spherical astronomy for all latitudes; a table for displaying ... the direction of Mecca, as a function of terrestrial latitude and longitude; and tables for converting lunar\necliptic coordinates\nto\nequatorial coordinates\n.\nOf course, al-Khalili did not do all this work without basing some of it on the work of earlier mathematicians, to see the magnitude of his task note that one table alone contains over\n13000\nentries. Tables for reckoning time by the sun and tables for regulating the time of Muslim prayer, computed for the latitude of Cairo, had been earlier computed by ibn\nYunus\n. The astronomer al-Mizzi spent his early life in Egypt, then moved to Damascus where he converted ibn\nYunus\n's table for use there. Al-Mizzi died around\n1350\nand the first two of al-Khalili's tables were improved versions of the ones produced by al-Mizzi, where al-Khalili had taken more accurate values for the terrestrial coordinates of Damascus.\nAl-Khalili's tables for solving the problems of spherical astronomy can be seen to be tables which solve spherical triangles using a method similar to the modern cosine rule. The tables are remarkable for their accuracy and Van Brummelen in\n[\n6\n]\nuses:-\n.... computer-based tests to determine, if possible, the methods of computation used by al-Khalili in the construction of his auxiliary tables.\nThis paper suggests a possible interpolation scheme used by al-Khalili and shows up a deep understanding that al-Khalili must have had regarding errors in his calculations which show\n[\n6\n]\n:-\n... a curious lack of concern for accuracy at an early stage of the calculation, followed by a careful computation at a later stage where the calculation is sensitive to error.\nThe calculation of the direction of Mecca, as a function of terrestrial latitude and longitude, was one of the hardest of all problems of spherical trigonometry for which Islam required a solution. There is a puzzle which has not yet been explained. The tables produced by al-Khalili for the direction of Mecca must have been calculated using his own auxiliary tables\n(\nwhich would be the most accurate available\n)\n. However, the tables giving the direction of Mecca are remarkable for their accuracy having errors of around\n0\n.\n1\n°. This is a greater degree of accuracy than would result if al-Khalili used his auxiliary tables in their present form. One possible solution is that al-Khalili had computed more accurate auxiliary tables before calculating his tables for the direction of Mecca but these are now lost."
}