{
  "nome_completo": "Ghiyath al-Din Jamshid Mas'ud al-Kashi",
  "nome_curto": "al-Kashi",
  "ano_nascimento": "1390",
  "ano_morte": "1450",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Kashi/",
  "lugar_nascimento": "Kashan, Iran",
  "lugar_morte": "Samarkand, Transoxania (now Uzbek)",
  "biografia": "Details of\nJamshid al-Kashi\n's life and works are better known than many others from this period although details of his life are sketchy. One of the reasons we is that he dated many of his works with the exact date on which they were completed, another reason is that a number of letters which he wrote to his father have survived and give fascinating information.\nAl-Kashi was born in Kashan which lies in a desert at the eastern foot of the Central Iranian Range. At the time that al-Kashi was growing up Timur\n(\noften known as Tamburlaine\n)\nwas conquering large regions. He had proclaimed himself sovereign and restorer of the Mongol empire at Samarkand in\n1370\nand, in\n1383\n, Timur began his conquests in Persia with the capture of Herat. Timur died in\n1405\nand his empire was divided between his two sons, one of whom was Shah Rokh.\nWhile Timur was undertaking his military campaigns, conditions were very difficult with widespread poverty. al-Kashi lived in poverty, like so many others at this time, and devoted himself to astronomy and mathematics while moving from town to town. Conditions improved markedly when Shah Rokh took over after his father's death. He brought economic prosperity to the region and strongly supported artistic and intellectual life. With the changing atmosphere, al-Kashi's life also improved markedly. The first event in al-Kashi's life which we can date accurately is his observation of an eclipse of the moon which he made in Kashan on\n2\nJune\n1406\n.\nIt is reasonable to assume that al-Kashi remained in Kashan where he worked on astronomical texts. He was certainly in his home town on\n1\nMarch\n1407\nwhen he completed\nSullam Al-sama\nthe text of which has survived. The full title of the work means\nThe Stairway of Heaven, on Resolution of Difficulties Met by Predecessors in the Determination of Distances and Sizes\n(\nof the heavenly bodies\n)\n. At this time it was necessary for scientists to obtain patronage from their kings, princes or rulers. Al-Kashi played this card to his advantage and brought himself into favour in the new era where patronage of the arts and sciences became popular. His\nCompendium of the Science of Astronomy\nwritten during\n1410\n-\n11\nwas dedicated to one of the descendants of the ruling Timurid dynasty.\nSamarkand, in Uzbekistan, is one of the oldest cities of Central Asia. The city became the capital of Timur's empire and Shah Rokh made his own son,\nUlugh Beg\n, ruler of the city.\nUlugh Beg\n, himself a great scientist, began to build the city into a great cultural centre. It was to\nUlugh Beg\nthat Al-Kashi dedicated his important book of astronomical tables\nKhaqani Zij\nwhich was based on the tables of\nNasir al-Tusi\n. In the introduction al-Kashi says that without the support of\nUlugh Beg\nhe could not have been able to complete it. In this work there are trigonometric tables giving values of the sine function to four\nsexagesimal\ndigits for each degree of argument with differences to be added for each minute. There are also tables which give transformations between different coordinate systems on the\ncelestial sphere\n, in particular allowing\necliptic coordinates\nto be transformed into\nequatorial coordinates\n. See\n[\n14\n]\nfor a detailed discussion of this work.\nThe\nKhaqani Zij\nalso contains\n[\n1\n]\n:-\n... detailed tables of the longitudinal motion of the sun, the moon, and the planets. Al-Kashi also gives the tables of the longitudinal and latitudinal\nparallaxes\nfor certain geographical latitudes, tables of eclipses, and tables of the visibility of the moon.\nAl-Kashi had certainly found the right patron in\nUlugh Beg\nsince he founded a university for the study of theology and science at Samarkand in about\n1420\nand he sought out the best scientists to help with his project.\nUlugh Beg\ninvited Al-Kashi to join him at this school of learning in Samarkand, as well as around sixty other scientists including\nQadi Zada\n. There is little doubt that al-Kashi was the leading astronomer and mathematician at Samarkand and he was called the second\nPtolemy\nby an historian writing later in the same century.\nLetters which al-Kashi wrote in Persian to his father, who lived in Kashan, have survived. These were written from Samarkand and give a wonderful description of the scientific life there. In\n1424\nUlugh Beg\nbegan the construction of an observatory in Samarkand and, although the letters by al-Kashi are undated they were written at a time when construction of the observatory had begun. The contents of one of these letters has only recently been published, see\n[\n8\n]\n.\nIn the letters al-Kashi praises the mathematical abilities of\nUlugh Beg\nbut of the other scientists in Samarkand, only\nQadi Zada\nearned his respect.\nUlugh Beg\nled scientific meetings where problems in astronomy were freely discussed. Usually these problems were too difficult for all except al-Kashi and\nQadi Zada\nand on a couple of occasions only al-Kashi succeeded. It is clear that al-Kashi was the best scientist and closest collaborator of\nUlugh Beg\nat Samarkand and, despite al-Kashi's ignorance of the correct court behaviour and lack of polished manners, he was highly respected by\nUlugh Beg\n. After Al-Kashi's death,\nUlugh Beg\ndescribed him as\n(\nsee for example\n[\n1\n]\n)\n:-\n... a remarkable scientist, one of the most famous in the world, who had a perfect command of the science of the ancients, who contributed to its development, and who could solve the most difficult problems.\nAlthough al-Kashi had done some fine work before joining\nUlugh Beg\nat Samarkand, his best work was done while in that city. He produced his\nTreatise on the Circumference\nin July\n1424\n, a work in which he calculated\n2\nπ to nine sexagesimal places and translated this into sixteen decimal places. This was an achievement far beyond anything which had been obtained before, either by the ancient Greeks or by the Chinese\n(\nwho achieved six decimal places in the\n5\nth\ncentury\n)\n. It would be almost\n200\nyears before\nvan Ceulen\nsurpassed Al-Kashi's accuracy with\n20\ndecimal places.\nAl-Kashi's most impressive mathematical work was, however,\nThe Key to Arithmetic\nwhich he completed on\n2\nMarch\n1427\n. The work is a major text intended to be used in teaching students in Samarkand, in particular al-Kashi tries to give the necessary mathematics for those studying astronomy, surveying, architecture, accounting and trading. The authors of\n[\n1\n]\ndescribe the work as follows:-\nIn the richness of its contents and in the application of arithmetical and algebraic methods to the solution of various problems, including several geometric ones, and in the clarity and elegance of exposition, this voluminous textbook is one of the best in the whole of medieval literature; it attests to both the author's erudition and his pedagogical ability.\nDold-Samplonius has discussed several aspects of al-Kashi's\nKey to Arithmetic\nin\n[\n11\n]\n,\n[\n12\n]\n, and\n[\n13\n]\n.\n(\nsee also\n[\n3\n]\n)\n. For example the measurement of the\nmuqarnas\nrefers to a type of decoration used to hide the edges and joints in buildings such as mosques and palaces. The decoration resembles a stalactite and consists of three-dimensional polygons, some with plane surfaces, and some with curved surfaces. Al-Kashi uses decimal fractions in calculating the total surface area of types of muqarnas. The\nqubba\nis the dome of a funerary monument for a famous person. Al-Kashi finds good methods to approximate the surface area and the volume of the shell forming the dome of the qubba.\nWe mentioned above al-Kashi's use of decimal fractions and it is through his use of these that he has attained considerable fame. The generally held view that\nStevin\nhad been the first to introduce decimal fractions was shown to be false in\n1948\nwhen P Luckey\n(\nsee\n[\n4\n]\n)\nshowed that in the\nKey to Arithmetic\nal-Kashi gives as clear a description of decimal fractions as\nStevin\ndoes. However, to claim that al-Kashi is the inventor of decimal fractions, as was done by many mathematicians following the work of Luckey, would be far from the truth since the idea had been present in the work of several mathematicians of\nal-Karaji\n's school, in particular\nal-Samawal\n.\nRashed\n(\nsee\n[\n5\n]\nor\n[\n6\n]\n)\nputs al-Kashi's important contribution into perspective. He shows that the main advances brought in by al-Kashi are:-\n(1)\nThe analogy between both systems of fractions; the sexagesimal and the decimal systems\n.\n(2)\nThe usage of decimal fractions no longer for approaching algebraic real numbers, but for real numbers such as π\n.\nRashed also writes\n(\nsee\n[\n5\n]\nor\n[\n6\n]\n)\n:-\n... Al-Kashi can no longer be considered as the inventor of decimal fractions; it remains nonetheless, that in his exposition the mathematician, far from being a simple compiler, went one step beyond\nal-Samawal\nand represents an important dimension in the history of decimal fractions.\nThere are other major results in the work of al-Kashi which were pointed out by Luckey. He found that al-Kashi had an algorithm for calculating\nn\nn\nn\nth roots which was a special case of the methods given many centuries later by\nRuffini\nand\nHorner\n. In later work Rashed shows\n(\nsee for example\n[\n5\n]\nor\n[\n6\n]\n)\nthat Al-Kashi was again describing methods which were present in the work of mathematicians of\nal-Karaji\n's school, in particular\nal-Samawal\n.\nThe last work by al-Kashi was\nThe Treatise on the Chord and Sine\nwhich may have been unfinished at the time of his death and then completed by\nQadi Zada\n. In this work al-Kashi computed sin\n1\n° to the same accuracy as he had computed π in his earlier work. He also considered the equation associated with the problem of\ntrisecting an angle\n, namely a\ncubic equation\n. He was not the first to look at approximate solutions to this equation since\nal-Biruni\nhad worked on it earlier. However, the iterative method proposed by al-Kashi was\n[\n1\n]\n:-\n... one of the best achievements in medieval algebra. ... But all these discoveries of al-Kashi's were long unknown in Europe and were studied only in the nineteenth and twentieth centuries by ... historians of science....\nLet us end with one final comment on the al-Kashi's work in astronomy. We mentioned earlier the astronomical tables\nKhaqani Zij\nproduced by al-Kashi. It is worth noting that\nUlugh Beg\nalso produced astronomical tables and sine tables, and it is almost certain that these tables were based on al-Kashi's tables and almost certainly produced with al-Kashi's help."
}