{
  "nome_completo": "Abu'l Hasan Ahmad ibn Ibrahim Al-Uqlidisi",
  "nome_curto": "Al-Uqlidisi",
  "ano_nascimento": "920",
  "ano_morte": "980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Uqlidisi/",
  "lugar_nascimento": "possibly Damascus, Syria",
  "lugar_morte": "possibly Damascus, Syria",
  "biografia": "Al-Uqlidisi\nis a mathematician who is only known to us through two manuscripts on arithmetic,\nKitab al-fusul fi al-hisab al-Hindi\nand\nKitab al-hajari fi al-hisab\n. Despite this he is a figure of some importance and has prompted an interesting scholarly argument among historians of science.\nThe manuscript of the\nKitab al-fusul fi al-hisab al-Hindi\nwhich has survived is a copy of the original which was made in\n1157\n. An English translation of this work has been published by Saidan\n[\n4\n]\n. The manuscript gives al-Uqlidisi's full name on the front page as well as the information that he composed the text in Damascus in\n952\n-\n53\n. In the introduction al-Uqlidisi writes that he travelled widely and learnt from all the mathematicians he met on his travels. He also claimed to have read all the available texts on arithmetic. Other than being able to deduce a little of al-Uqlidisi's character from his writing, we have no other information on his life.\nThe\nKitab al-fusul fi al-hisab al-Hindi\nof al-Uqlidisi is the earliest surviving book that presents the Hindu system. In it al-Uqlidisi argues that the system is of practical value\n[\n4\n]\n:-\nMost arithmeticians are obliged to use it in their work: since it is easy and immediate, requires little memorisation, provides quick answers, demands little thought ... Therefore, we say that it is a science and practice that requires a tool, such as a writer, an artisan, a knight needs to conduct their affairs; since if the artisan has difficulty in finding what he needs for his trade, he will never succeed; to grasp it there is no difficulty, impossibility or preparation.\nThis treatise on arithmetic is in four parts. The aim of the first part is to introduce the Hindu numerals, to explain a place value system and to describe addition, multiplication and other arithmetic operations on integers and fractions in both decimal and\nsexagesimal\nnotation. The part second collects arithmetical methods given by earlier mathematicians and converts them in the Indian system. For example the method of casting out nines is described.\nThe third part of the treatise tries to answer to the standard type of questions that are asked by students: why do it this way ... ?, how can I ... ?, etc. There is plenty of evidence here that al-Uqlidisi must have been a teacher, for only a teacher would know understand the type of problem that a beginning student would encounter.\nThe fourth part has considerable interest for it claims that up to this work by al-Uqlidisi the Indian methods had been used with a dust board. A dust board was used because the methods required the moving of numbers around in the calculation and rubbing some out as the calculation proceeded. The dust board allowed this in the same sort of way that one can use a blackboard, chalk and a blackboard eraser. However, al-Uqlidisi showed how to modify the methods for pen and paper use.\nAl-Uqlidisi's work is historically important as it is the earliest known text offering a direct treatment of decimal fractions. It is here that the scholarly argument referred to above arises. At one time it was thought that\nStevin\nwas the first to propose decimal fractions. Further research showed that decimal fractions appeared in the work of\nal-Kashi\n, who was then credited with this extremely important contribution. When Saidan studied al-Uqlidisi's\nKitab al-fusul fi al-hisab al-Hindi\nin detail he wrote\n[\n6\n]\n:-\nThe most remarkable idea in this work is that of decimal fraction. Al-Uqlidisi uses decimal fractions as such, appreciates the importance of a decimal sign, and suggests a good one. Not\nal-Kashi\n(\nd.\n1436\n/\n7)\nwho treated decimal fractions in his \"Miftah al-Hisab\", but al-Uqlidisi, who lived five centuries earlier, is the first Muslim mathematician so far known to write about decimal fractions.\nFollowing Saidan's paper, some historians went even further in attributing to al-Uqlidisi the complete credit for giving the first complete description and applications of decimal fractions. Rashed, however, although he does not wish to minimise the importance of al-Uqlidisi's contribution to decimal fractions, sees it as\n[\n2\n]\n:-\n... preliminary to its history, whereas\nal-Samawal\n's text already constitutes the first chapter.\nThe argument depends on how one interprets the following passage in al-Uqlidisi's treatise. He explains how to raise a number by one tenth five times\n[\n4\n]\n:-\n... we want to raise a number by its tenth five times. We write down this number as usual; write it down again below moved one place to the right; we therefore know its tenth, which we add to it. So was have added its tenth to this number. We put the resulting fraction in front of this number and we move it to the unit place after marking it\n[\nwith the ' sign he uses for the decimal point\n]\nthus. We add its tenth and so on five times.\nSaidan\n(\nwriting in\n[\n1\n]\n)\nsees in this passage that al-Uqlidisi has fully understood the idea of decimal fractions, saying that earlier authors:-\n... rather mechanically transformed the decimal fraction obtained into the sexagesimal system, without showing any sign of comprehension of the decimal idea. ... In all operations where powers of ten are involved in the numerator or the denominator,\n[\nal-Uqlidisi\n]\nis well at home.\nOn the other hand Rashed sees this passage rather differently\n[\n2\n]\n:-\n... unlike\nal-Samawal\n, al-Uqlidisi never formulates the idea of completing the sequence of powers of ten by that of their inverse after having defined the zero power. That said, in the passage just quoted, three basic ideas emerge whose intuitive resonance may have misled historians; what they thought was a theoretical exposition was merely understood implicitly, and, as a result, they have overestimated the author's contribution to decimal fractions.\nThe two points of view are almost impossible to decide between since what we are looking at is the development of the idea of decimal fractions by different mathematicians, each contributing to its understanding. To take a particular text as the one where the idea appears for the first time in its entirety must always be a somewhat arbitrary decision. There is no disagreement on the fact that al-Uqlidisi made a major step forward."
}