{
  "nome_completo": "Abu Ishaq Ibrahim ibn Yahya al-Zarqali",
  "nome_curto": "al-Zarqali",
  "ano_nascimento": "1029",
  "ano_morte": "1100",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Zarqali/",
  "lugar_nascimento": "Córdoba, Spain",
  "lugar_morte": "Córdoba, Spain",
  "biografia": "We note that there are several versions of\nal-Zarqali\n's name. There are variants such as\nal-Zarqalluh\n,\nal-Zarqallah\nand\naz-Zarqal\nbut perhaps the most common is the Latin version of his name,\nAzarquiel\n. He was born in Qurtuba, the Arabic name for the city of Córdoba in Spain. The date of his birth is uncertain and, until recently, the date of his death was given as about\n1087\n. Recent research, however, has determined that he died on\n15\nOctober\n1100\n. He was born into a family of craftsmen who worked in Córdoba. The family had a reputation as skilled makers of instruments, in fact al-Zarqali was also given the name 'al-Nekkach' which means 'the engraver', and al-Zarqali learnt these family skills as he grew up in Córdoba.\nBefore we give some details of al-Zarqali's life, we need to give some background to al-Andalus, Muslim Spain, in which he grew up. A small Muslim army landed in Gibraltar in\n711\nand over the next few years much of the Iberian peninsular, including part of southern France, came under Muslim rule. The Caliphate of Córdoba, ruled by the Umayyad dynasty from\n929\nto\n1031\n, became the peak of European civilisation, admired for its buildings, its public baths, libraries and the academic excellence of its scholars. The unity of al-Andalus had come to an end around\n1010\n, however, and the various independent Muslim states on the Iberian peninsular began to fight each other. This gave the Christians to the north the opportunity to put pressure on the Muslim area, often by encouraging one of the independent Muslim states to fight against another.\nAstronomy was an important subject for Muslims and this is explained by Orhan Golbasi\n[\n10\n]\n:-\nReligious duties of Islam, which are compulsory for all Muslims, necessitate the use of complex calendar and clock mechanisms. Determination of the times of the \"Namaz\"\n(\nthe ritual of worship centred in prayer five times a day\n)\ndepends on the rise of the Sun to a specific altitude above the horizon. Obviously, these times are different for each coordinate. Another complexity with Namaz is that one has to find and turn to face the direction of Mecca in order to perform the prayer. On the other hand, a lunar calendar is used for setting the dates of the religious festivals and determining the times of the months according to the Muslim calendar. In the early ages, and even still today, it is fairly difficult to fix the first day of the Moon. Therefore, it can be argued that the complexity and difficulty of the problems that Muslim scholars of the Middle Ages faced contributed to their notable success in astronomy.\nIt was in Córdoba that al-Zarqali grew up. He was educated there, in particular becoming an expert metalsmith and instrument maker. He moved to Toledo where he was employed by the ruler Qadi ibn Said to construct astronomical instruments for the group of astronomers who were working there under the patronage of ibn Said. Certainly by\n1048\n-\n49\nhe was making instruments in Toledo and some time before\n1055\nhe began making solar observations. It was realised that al-Zarqali was not only expert as an instrument maker, but he was also highly intelligent. When asked about his education, he claimed that he had never studied any science nor had he ever read a book. With the support of his patron Qadi ibn Said, he was given books to study by the astronomers at Toledo which allowed him to learn mathematics and astronomy, beginning with the basics of these subjects and extending to the latest research works. In two years he had mastered the subjects and, in\n1062\n, he joined Qadi ibn Said's Toledo group of astronomers. Stephen Blake writes\n[\n3\n]\n:-\n... he became a member of the Toledan school of astronomers and soon was appointed its head. He remained in the city for over twenty years - constructing astronomical instruments, recording observations of the sun, moon, planets, and stars, and composing treatises on astronomy and astrology.\nWe should now look at some of al-Zarqali's accomplishments. He invented a type of universal astrolabe known as an azafea. Kennedy writes about the azafea and how it differs from the standard astrolabe in\n[\n12\n]\n:-\nThe standard planispheric astrolabe includes a set of thin brass plates, one for each terrestrial latitude contemplated, each plate being ruled with the horizon coordinate net for its latitude. On top of the outermost plate is an openwork rete containing the map of the graduated ecliptic and pointers for prominent fixed stars. The mapping of the celestial sphere being stereographic from the South Pole, the centre of the instrument is the map of the celestial North Pole. So rotation of the rete simulates quantitatively the daily rotation of the heavens, and for a particular time the horizon coordinates of a star or an ecliptic point may be read directly from the plate underneath. The Spanish Arab Ibrahim ibn Yahya al-Zarqali\n(\nAzarquiel\n)\ninvented a type of astrolabe known in Europe as the azafea\n(\nfrom Arabic al-safiha, plate\n)\n... It also is based on stereographic mapping, but the centre of projection is one of the equinoctial points, not the North Pole. Hence, although the daily path of a celestial object still maps as a circle, it is no longer concentric with the centre of the instrument. As a consequence, although the standard problems of spherical astronomy may be solved with either instrument, manipulations with the azafea tend to be more difficult than with the earlier type of astrolabe. On the other hand, the azafea is universal, requiring no special latitude plates.\nThe azafea became known as the Saphea Arzachelis and was widely used in medieval Europe.\nPerhaps he is even more famous for the\nToledan Tables\n. These tables contained much copied from earlier tables such as those by\nal-Khwarizmi\n,\nal-Battani\nand\nPtolemy\n, but they also contained the observations of al-Zarqali and the other members of Qadi ibn Said's large astronomy group which consisted of both Muslim and Jewish scholars. The\nTables\ncontained data from observations of the sun, the moon and the planets over many years. In fact it is claimed that al-Zarqali observed the sun for twenty-five years and the moon for thirty years. Other data in the\nTables\nincludes data about parallax, eclipses, the setting of planets, tables of stellar positions, and trigonometrical tables. The\nToledan Tables\nwere written in Arabic but no copy in this language has survived. We do, however, have two versions of copies of the\nTables\nwhich were translated into Latin by\nGherard of Cremona\nin the\n12\nth century.\nIt is interesting to compare work being carried out in Toledo by al-Zarqali and his group with that being carried out in Esfahan by the group set up there by\nOmar Khayyam\nwho was about twenty years younger than al-Zarqali. The Toledo group was funded by Qadi ibn Said while that in Esfahan was funded by the ruler Malik-Shah, the grandson of Toghril Beg, the founder of the Seljuq dynasty. Malik-Shah ruled a much larger and wealthier principality than Qadi ibn Said and so was able to devote considerably more funds to his project with better instrumentation. The tables produced in Esfahan were more accurate than the\nToledan Table\ns but it was the\nToledan Tables\nthat were widely used in Europe until the production of the\nAlphonsine Tables\naround\n1270\n.\nLet us look at some other of al-Zarqali's achievements. He invented a famous water clock which is described in detail in\n[\n29\n]\n. We quote the description by the authors of\n[\n29\n]\nas presented in\n[\n5\n]\n:-\nThe clocks consisted of two basins, which filled with water or emptied according to the increasing or waning of the moon. At the moment when the new moon appeared on the horizon, water would begin to flow into the basins by means of subterranean pipes, so that there would be at day-break the fourth of a seventh part, and at the end of the day half a seventh part, of the water required to fill the basins. In this proportion the water would continue to flow until seven days and as many nights of the month had elapsed, by which time both basins would be half filled. The same process during the following seven days and nights would make the two basins quite full, at the same time that the moon was at its full. However, on the fifteenth night of the month, when the moon would begin to wane, the basins would also begin to lose every day and night half a seventh part of their water, until by the twenty-first of the month they would be half empty, and when the moon reached her twenty-ninth night not a drop of water would remain in them.\nHe also wrote a book, of which no copy survives, probably called\nOn the solar year\n. We know from references in other sources that in this book al-Zarqali details the motion of the solar apogee, giving it a motion of\n1\n° in\n279\nyears. The work contained his solar model which influenced later astronomers. He also produced an\nAlmanac\n which has survived in both Arabic and in a Latin translation. This is based on an earlier work of the\n3\nrd or\n4\nth century, but has modified data from the observations of al-Zarqali and his colleagues in Toledo. It has been corrected for use in the year\n1089\n. The work was widely used throughout the Middle Ages, and was adapted for the year\n1301\nby the Jew\nJacob ben Tibbon\n. Al-Zarqali wrote one work on astrology, the main interest in this work being the magic squares which he used to make talismans. Two Arabic and one Latin version of this text survives.\nIrfan Shahid writes\n[\n27\n]\n:-\nHe determined the longitude of the Regulus; presented improved trigonometrical tables of sines, cosines, versed sines, secants and tangents; calculated the obliquity of the ecliptic at between\n13\n.\n13\n\" and\n13\n.\n5\n\"; presented the stereographic projection of the sphere on a plane etc.\nOne of the many things attributed to him is being the first to suggest that planetary orbits are oval. He, like his contemporaries from that time, followed\nPtolemy\n's planetary theory of having the planets following epicycles which followed a circular path round the equant, a point displaced from the earth. This theory can be made to fit observations fairly closely, but Mercury provides the greatest difficulty. It was here that al-Zarqali suggested that the centre of Mercury's epicycle followed an oval shaped path which he described as 'like a pine nut' in his book on the motion of the seven planets written about\n1081\n. Some have gone too far with interpreting what is presented in this work, for example look at title of Afifa Thabet's article\n[\n28\n]\n, namely \"He Discovered That Planets Move in an Elliptical Orbit\n500\nYears Before Kepler Did!\" This having been said, the fact that al-Zarqali appears to be the first to give any indication that planetary orbits may not be composed of circles, is a step forward.\nWe have mentioned at the beginning of this article how the division of the Iberian peninsular into independent Muslim states led to Christian troops moving south conquering various Muslim states, often with the help of another Muslim state. Toledo is pretty much in the middle of Spain and was not among the first to fall. Barbastro, not far south of the Pyrenees, fell to the Christians in\n1063\nso the process was going on throughout the time that al-Zarqali led the astronomers of Toledo. It was in\n1085\nthat Toledo fell to the Christian Alfonso VI of Castile, who was helped by al-Mutamid of Seville. At this time al-Zarqali fled from Toledo and returned to his home town of Córdoba which was further south and still under Muslim control. Córdoba was controlled by al-Mutamid of Seville who supported al-Zarqali for a few years and he was able to continue his observations with the help of one of his students. With the assistance of the Almoravids of Morocco, al-Mutamid repulsed the Christians in the Battle of Sagrajas in\n1086\n. In\n1091\n, however, al-Mutamid was taken prisoner by the Almoravids and exiled to Morocco. By that time al-Zarqali was no longer supported and it is unlikely that he did any scholarly work during the final ten years of his life. Until recently the year of his death has been given as\n1087\nand certainly no work by him appeared after that time. It has been shown recently, however, that he died in Córdoba in\n1100\nat the age of seventy-one.\nA look at the references to this article shows at once that al-Zarqali's name and achievements have continued to be kept alive. There is the Azarquiel School of Astronomy which continues to hold conferences, and the crater Arzachel on the Moon is named for him. This was named by\nGiovanni Battista Riccioli\nin his ten volume work\nAlmagestum novum\n(1651)\n.\nThe author of\n[\n9\n]\nwrites:-\nHis works inspired a generation of Islamic astronomers in Andalusia."
}