{
  "nome_completo": "Carlo Alberto Castigliano",
  "nome_curto": "Alberto Castigliano",
  "ano_nascimento": "1847",
  "ano_morte": "1884",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Castigliano/",
  "lugar_nascimento": "Asti, Piemonte (now Italy)",
  "lugar_morte": "Milan, Italy",
  "biografia": "Alberto Castigliano\nmoved from the region of his birth, Piedmont in northwestern Italy, to the Technical Institute of Terni in\n1866\n. After four years in Terni, in Umbria, Castigliano moved north again, this time to become a student at the Polytechnic of Turin. After three years of study in Turin he wrote a dissertation in\n1873\nIntorno ai sistemi elastici\nⓉ\n(\nOn elastic systems\n)\nfor which he is famous.\nAfter graduating from the Polytechnic of Turin, Castigliano was employed by the Northern Italian Railways. He headed the office responsible for artwork, maintenance and service and worked there until his death at an early age.\nIn his dissertation there appears a theorem which is now named after Castigliano. This is stated in\n[\n1\n]\nas:-\n... the partial derivative of the strain energy, considered as a function of the applied forces acting on a linearly elastic structure, with respect to one of these forces, is equal to the displacement in the direction of the force of its point of application.\nCastigliano's results contain the principle of least work as a special case and this was to lead to a dispute with\nMenabrea\nin which Castigliano came off less well than he had hoped. As B A Boley writes in\n[\n1\n]\n:-\nIt is clear that\nMenabrea\n's principle may be considered to be included in Castigliano's theorems; furthermore,\nMenabrea\n's proofs were not satisfactory and were in fact repeatedly modified by him.\nCertainly when\nMenabrea\nattempted another proof of his principle in\n1875\nhe used Castigliano's results but his only reference to Castigliano was in a footnote. Castigliano did not find this satisfactory and objected to the lack of recognition given to him by\nMenabrea\n.\nCremona\nchaired a special meeting of the\nAccademia dei Lincei\nwhich was asked to judge whether\nMenabrea\nhad indeed acted unfairly towards Castigliano.\nCremona\ndid not find in favour of Castigliano, stating the decision of the committee:-\nMr Castigliano can have the honour of having done a good piece of work: no one will be able to take away from Member\nMenabrea\nthe merit of having made popular and of common use a general principle, which is certainly destined to receive ever more extensive application.\nAlthough\nCremona\nmay well have been right in saying that the credit for the principle should go to\nMenabrea\n, his claims that\nMenabrea\nhas the merit of making them popular is less certain. As B A Boley says in\n[\n1\n]\nwhen he summarises Castigliano's contribution:-\nTo assess the importance of his contribution, however, it is important to note that, although there is some validity in\nCremona\n's attribution of the popularisation of energy methods to\nMenabrea\n, it is precisely in this respect that Castigliano excels. He solved an amazing number of structural problems by his methods."
}