{
  "nome_completo": "Alexander Wilson",
  "nome_curto": "Alexander Wilson",
  "ano_nascimento": "1714",
  "ano_morte": "1786",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilson_Alexander/",
  "lugar_nascimento": "St Andrews, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Alexander Wilson\n's parents were Clara Fairfoul\n(1675\n-?\n)\nand Patrick Wilson\n(1669\n-\n1724)\nwho were married in Monimail, Fife, Scotland, on\n10\nApril\n1706\n. Let us note that the maiden name of Alexander's mother sometimes appears in the records as Fairfull, and his father's name sometimes is given as Wilsone. Clara, the daughter of Robert Fairfull and Elspeth Adamson, had been baptised on\n18\nJuly\n1675\nat Newburn, Fife, Scotland. Patrick Wilson was born in St Andrews, the son of John Wilson and Margaret Carstairs. Alexander had older siblings Patrick, Catherine\n(1707\n-\n1771)\nand Clara.\nWhen Alexander was born, his father Patrick was town clerk of St Andrews but, sadly, Patrick Wilson died on\n22\nJanuary\n1724\nwhen his son was nine years of age and he was brought up by his mother. Daniel Defoe, the famous author of\nRobinson Crusoe\n, visited St Andrews in\n1727\n, when Wilson must have been about twelve years old, and gave this description:-\n... a most august monument of the splendour of the Scots Episcopal Church in former times; remarkable for a fine situation, surrounded by extensive corn-fields, and the pleasant downs, the Links, lying on the sea-side towards the north. The famous physician\nCardan\nesteemed it the healthiest town he ever lived in, having occasion to experience it some months, when he came over from Italy at the request of the Pope to prescribe to Archbishop John Hamilton.\nAlthough Archbishop John Hamilton\n(1512\n-\n1571)\nwas Archbishop of St Andrews, we believe that he was residing in Edinburgh when\nCardan\nvisited him. Defoe may, of course, be correct but we have never seen any evidence that\nCardan\nspent 'some months' in St Andrews. Others around this time paint a less pleasant picture of the town. A visitor to the town in\n1728\nwrote that out of\n945\nhouses,\n159\nwere uninhabitable while others, being in need of repair, were let at very low rents. Many of the inhabitants were \"idle and half-staved, there being neither trade or manufacturers in the town.\" The University was also at a low point at this time. John Macky, a Scottish spy, wrote in\nA journey through Scotland\n(1723)\nthat St Salvator's chapel and cloisters were 'entirely neglected' and he saw:-\n... very good apartments for the masters and scholars, all built of free-stone, but unaccountably out of repair, they being hardly at the pains of keeping out the rain or mending the windows.\nPatrick Wilson, Alexander Wilson's son, writes about Alexander's childhood in\n[\n12\n]\n:-\nFrom his earliest years he discovered a strong propensity to several ingenious arts, among which may be mentioned drawing, modelling of figures, and engraving upon copperplate. Even when a boy, he often devoted his leisure to such employments, and though in all of them he was almost entirely self-directed and self-taught, yet, from time to time, he produced specimens of ingenuity which drew upon him a general attention, and which, by real judges, were considered as indications of uncommon natural talents.\nFor a version of the whole of Patrick Wilson's article, see\nTHIS LINK\n.\nAlexander attended several local St Andrews schools before being educated at the University of St Andrews. The university records show that he graduated with an MA on\n8\nMay\n1733\n. His favourite subject had been natural philosophy, known today as physics, and he was particularly interested in optics and astronomy. After graduating, however, he was an apprentice to a surgeon in St Andrews and at this stage he thought of this as the career that he would follow. Clearly he showed considerable skills and two prominent men of the town took an interest in his progress. One was Thomas Simson\n(1696\n-\n1764)\nwho was the professor of medicine at the university. The first Duke of Chandos had given the University of St Andrews funds to set up a Chair of Medicine and Anatomy in\n1721\n, and Thomas Simson was the first Chandos Professor of Medicine. An interesting connection is that Thomas Simson was a brother of the mathematician\nRobert Simson\n. Wilson became friendly with Thomas Simson, who treated him with great kindness.\nThe second of the prominent men of St Andrews who became important in developing Wilson's career was Dr George Martine\n(1700\n-\n1741)\n. Martine had been a student at St Andrews, Edinburgh and Leyden, before setting up a medical practice in St Andrews. He was interested in natural philosophy and was involved in a controversy with\nColin Maclaurin\nover\nIsaac Newton\n's assertion concerning the existence of the vacuum. Martine had undertaken theoretical work on heat and on thermometers but wanted to have more accurate thermometers constructed and available for general use. Wilson had never worked with glass but, encouraged by Martine, he began to experiment and teach himself the necessary skills. This led to him constructing optical instruments, in particular using the rays of the sun to magnify objects with projection in a dark room. He discovered how to use mirrors to focus sunlight and set fire to objects.\nIn\n1737\nhe moved to London to continue his apprenticeship in the medical profession\n[\n12\n]\n:-\nSoon after his arrival there, he engaged himself, with a French refugee, a surgeon and apothecary of good character, who received him into his family, giving him the charge of his shop, and of some of his patients, with a small annual salary.\nHe had been in London about a year when David Gregory, then the Regius Professor of Mathematics at St Andrews, visited London and met with Wilson. David Gregory\n(1712\n-\n1765)\nwas the son of Charles Gregory\n(1681\n-\n1754)\nthe nephew of\nJames Gregory\nand Regius Professor of Mathematics at St Andrews from\n1707\nto\n1734\n. Charles Gregory, who had taught Wilson, had resigned the chair in\n1734\nand his son David Gregory had been appointed. Through David Gregory, Wilson was introduced to Archibald Campbell, the brother of John, the Duke of Argyll. Archibald Campbell, known as Lord Isla, was a patron of brilliant men and a promotor of discoveries. He owned high quality astronomical and physical apparatus which he kept in his London home\n(\non the site now occupied by the London Palladium\n)\n. This was a time when Wilson had the opportunity to construct thermometers for Lord Isla, be allowed to use his scientific instruments, and meet with others with interests in science.\nWilson's life changed completely after, accompanying a friend, he visited the William Caslon's type-foundry in Chiswell Street, London, where metal type was being made for printing. The workers there showed him how they made the metal type and, thinking about what he had seen over the following few days, he decided that he could devise a better way to make the type. This was a lucrative business in these times and Wilson discussed with John Baine\n(\na St Andrews man then in London\n)\nthe possibility of setting up a business to put his ideas into practice. In\n1739\nhe returned to St Andrews and, in the following year, on\n20\nAugust\n1740\n, he married Jean Sharp, the daughter of the St Andrews merchant William Sharp and his wife Jean Walker. Jean\n(\nbaptised on\n13\nJanuary\n1718\nat St Andrews\n)\nand Alexander Wilson had two sons, Andrew Wilson\n(\nborn\n5\nAugust\n1741)\n, Patrick Wilson\n(16\nJanuary\n1743\n-\n1811)\n, and a daughter Jean Wilson\n(\nbaptised\n13\nJanuary\n1745)\n. The sons eventually joined their father in the type-foundry business. Wilson's wife Jean, however, died young and Wilson remarried in\n1752\n.\nIn\n1742\n, Wilson, in partnership with his friend John Baine, set up a type foundry in St Andrews. Two years later Wilson and Baine moved their type foundry to larger premises in Camlachie close to Glasgow but in\n1747\nBaine moved to Dublin. Soon after this Baine quit the partnership leaving Wilson the sole owner of the type foundry.\nYou can see more about the St Andrews type foundry at\nTHIS LINK\n.\nThe quality of the type produced by the foundry was outstanding and the finest of all was a Greek type. The Foulis Press in Glasgow, run by the two brothers Robert and Andrew Foulis, used Wilson's type and produced some of the finest and most beautiful books which no other press could match. Despite his other scholarly activities which we will examine below, the firm run by Wilson in partnership with his sons continued to operate throughout his life. He published\nA Specimen of some of the Printing Types Cast in the Foundry of Alexander Wilson and Sons\nin\n1772\nwhich provides a fine example of the capabilities of the firm. In fact Alexander Wilson and Sons continued to be a thriving business after the death of its founder, a branch was set up in Edinburgh in\n1832\nand the headquarters moved from Glasgow to London in\n1834\n. It went bankrupt in\n1845\nand was sold by auction in\n1850\n.\nWhat were Wilson's 'other scholarly activities' we referred to above? He was an excellent physicist with special interests in astronomy and, while running his type foundry in Camlachie, he constructed reflecting telescopes. His skill as an instrument maker meant than these were of exceptionally high quality. Around\n1748\nhe met a Glasgow divinity student Thomas Melvill\n(1726\n-\n1753)\nwho was passionate about natural philosophy\n[\n13\n]\n:-\nDuring the summers of\n1749\nand\n1750\nWilson and Melvill took measurements of the temperature of the Earth's atmosphere by attaching thermometers to kites, which the pair flew in a field adjacent to Wilson's home.\nMelvill died in Geneva in\n1753\nat twenty-seven years of age and Wilson did not continue with the experiments on which they had collaborated. In fact Wilson had moved his family from Camlachie to Glasgow in\n1752\n. He became involved with the Glasgow Literary Society which had been founded in\n1753\nwhich met every Thursday between November of May for discussions and debates. He addressed the Society in\n1757\non hydrostatical glass-bubbles which he had invented for determining the strength of liquids, particularly spirits. In the following year he addressed the Society on pendulums, having invented a spring clock which experiments showed was accurate to one second in a trial of\n40\nhours.\nFor more details about these and other inventions/experiments that he conducted around this time, see\nTHIS LINK\n.\nIn\n1760\n, Wilson was appointed to the chair of astronomy in Glasgow University, holding the post until he resigned in\n1784\n. This did not mean that he took charge of a university department with teaching duties. Rather he was in charge of the University Observatory at Dowanhill which had been newly built by Glasgow University and operated as a research establishment. The Observatory had been built to house the collection of astronomical instruments bequeathed to the University by Alexander Macfarlane, a merchant in Jamaica\n[\n9\n]\n:-\nThese instruments were said to be of a similar quality as those in the Royal Observatory in Greenwich and initiated the construction of the Macfarlane Observatory in\n1757\n.\n[\nWe note that the University of Glasgow, in a recent survey of benefits to the University from slavery, listed the Alexander Macfarlane bequest.\n]\nWilson made many observations of sunspots discovering the Wilson effect in\n1769\n. Using a geometric argument, he showed that sunspots were depressions in the Sun, publishing his results in papers of\n1774\n[\n10\n]\nand\n1783\n[\n11\n]\nin the\nPhilosophical Transactions of the Royal Society of London\n. A similar theory had been proposed by\nPhilippe de la Hire\nand by\nGiovanni Cassini\nbut\nJérôme Lalande\nargued that sunspots were the tops of mountains showing above a liquid surface. The model of the Sun proposed by Wilson was of a dark body surrounded by a shell of highly luminous material. This model was accepted as true for\n100\nyears and Wilson's theory that sunspots were depressions was 'proved' in\n1861\nwhen the first stereoscopic photographs of the sun were taken. Only after\n1900\nwas Wilson's claim shown to be inaccurate, and one is certainly not looking at a dark body through a luminous shell with holes. The reason for the appearance of depressions was that strong magnetic fields, discovered by Hale in\n1908\n, inhibit convection of hot gas which is increasing the temperature of the surrounding areas.\nYou can see more about the Wilson Depression at\nTHIS LINK\n.\nYou can read two short extracts about Wilson's observation of sun spots, the first from a late\n19\nth century book, the second from a\n21\nst century book, at\nTHIS LINK\n.\nWilson also published\nThoughts on General Gravitation, and views thence arising as to the state of the universe\n(1777)\n, in which he attempted to answer\nNewton\n's question:-\nWhat hinders the fixed stars from falling upon one another?\nThe Preface to the book begins:-\nThe following thoughts took their rise in the course of a philosophical conversation, about the beginning of the present year. Early in the month of February, the authors read the paper to several friends well known in the literary world, and transmitted copies of it to others, as opportunities offered of so doing. They now submit it to the impartial public in its original very imperfect state\n(\nnothing but the Notes being now added\n)\n, in order to avoid all interference with views which may hereafter appear upon the same subject.\nWilson's answer, that the entire universe rotates about a centre, is of course incorrect. It was, however, a quite logical attempt to answer this most perplexing question.\nEinstein\nattempted to answer the same question by introducing the 'cosmological constant' into the theory of general relativity. This he later believed was his greatest mistake when\nHubble\ndiscovered the expansion of the universe. The question, of course, is still of major importance since recent results show that the expansion of the universe is speeding up. If, however, we are to be fair to Wilson, it is true that in his day the universe was of nothing other than the Milky Way galaxy and here his answer is absolutely correct. His conclusion that the solar system itself must therefore be in motion is also correct.\nWe noted above that Wilson resigned his chair of astronomy at Glasgow in\n1784\n. Not only did the type business pass to his sons, but so also did the chair of astronomy which was filled by Patrick Wilson, Alexander Wilson's second son.\nWilson was awarded an honorary degree by the University of St Andrews on\n6\nAugust\n1763\nand was a founding member of the\nRoyal Society of Edinburgh\nin\n1783\n. He was awarded the gold medal of the\nRoyal Danish Academy\nof Copenhagen in\n1771\nfor his discovery of the Wilson effect.\nPatrick Wilson writes\n[\n12\n]\n:-\nIn March and April\n1786\n, when he had nearly completed his seventy-second year, it became apparent to his family and friends, that his constitution and strength were fast declining. After a gradual and easy decay, which lasted throughout the whole of that summer and autumn, and which he bore with the utmost composure and resignation, amidst the tender solicitudes of his surrounding family, he at last expired in their arms, on the\n16\nth day of October.\nThe private character of Dr Wilson was amiable to an uncommon degree. From his early youth to venerable age, he was actuated by a rational and steadfast piety, enlivened by those gracious assurances which carry our hopes and prospects beyond the grave, and sweeten the lot of human life. The cast of his temper, though uniformly cheerful and serene, was yet meek and humble, and his affections flowed in the warmest current immediately from the heart. His looks, as well as his conversation and demeanour, constantly indicated a soul full of innocence and benignity, in harmony with itself, and aspiring to be so with all around it."
}