{
  "nome_completo": "Alexandre-Théophile Vandermonde",
  "nome_curto": "Alexandre-Theophile Vandermonde",
  "ano_nascimento": "1735",
  "ano_morte": "1796",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vandermonde/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Alexandre-Theophile Vandermonde\n's father was a medical doctor who was originally from Landrices but had spent\n12\nyears in the Orient. He had set up a medical practice in Paris and was working there as a doctor when his son Alexandre-Théophile was born. He did not encourage his son to follow a medical profession but rather encouraged him to take up a career in music. Certainly he was not interested in mathematics when he was young. Alexandre-Théophile was awarded his bachelier on\n7\nSeptember\n1755\nand his licencie on\n7\nSeptember\n1757\n.\nHis first love was music and his instrument was the violin. He pursued a music career and he only turned to mathematics when he was\n35\nyears old. It was\nFontaine des Bertins\nwhose enthusiasm for mathematics rubbed off on Vandermonde. Perhaps surprisingly he was elected to the\nAcadémie des Sciences\nin\n1771\nwith little evidence of his mathematical genius other than his first paper which, although he was not a member at the time, was read to the Academy in November\n1770\n. However, he did make quite a remarkable contribution to mathematics in this paper and three further papers which he presented to the Academy between\n1771\nand\n1772\n. These four papers represent his total mathematical output and we will discuss their content below together with the views of a number of historians of mathematics on his contribution.\nVandermonde's election to the\nAcadémie des Sciences\ndid motivate him to work hard for the Academy and to publish other works on science and music. In\n1777\nhe published the results of experiments he had carried out with\nBézout\nand the chemist Lavoisier on low temperatures, in particular investigating the effects of a very severe frost which had occurred in\n1776\n. Ten years later he published two papers on manufacturing steel, this time joint work with\nMonge\nand Bertholet. The aim of this research was to improve the steel used for bayonets but experimenting with different mixtures of iron and carbon. That he work closely with\nMonge\nreflected the fact that the two were very close friends; in fact, so close, that he was known as\nfemme de Monge\n.\nIn\n1778\nVandermonde presented the first of a two part work on the theory of music to the\nAcadémie des Sciences\n. The second part was presented two years later. This work\nSystème d'harmonie applicable à l'état actuel de la musique\nⓉ\n(\nA harmony system applicable to the current state of music\n)\ndid not propose a mathematical theory of music as one might have expected from someone who was an expert in both fields. On the contrary the aim of the work was to put forward the idea that musicians should ignore all theory of music and rely solely on their trained ears when judging music. As one might expect this proved a controversial work with musicians being sharply divided as to whether they agreed with Vandermonde or not. Despite the opposition of many musicians at first, the ideas put forward by Vandermonde gained favour over the years and by the beginning of the nineteenth century the\nAcadémie des Sciences\nhad moved music from the mathematical area to the arts area. It is worth repeating that it is strange that a mathematician of the highest rank should have argued against music as a mathematical art, a position it had held since the days of ancient Greece.\nPositions which Vandermonde held include director of the Conservatoire des Arts et Métiers in\n1782\nand chief of the Bureau de l'Habillement des Armées in\n1792\n. In the same year of\n1792\nhe sat with\nLagrange\non a committee of the\nAcadémie des Sciences\nwhich had to examine the violon harmonique, a newly invented musical instrument. He was involved with the École Normale, which was founded in October\n1794\n, and was on the team designing a course in political economy. His friend\nMonge\nwas also involved with the École Normale as were\nLagrange\nand\nLaplace\n. However the establishment only operated for six months after it opened in the Muséum d'Histoire Naturelle in January\n1795\nbefore being closed down.\nLike\nMonge\n, Vandermonde was a strong supporter of the Revolution which began with the storming of the Bastille on\n14\nJuly\n1789\n. The politics of Revolution in France long before this event had been so exciting for Vandermonde that it diverted him from a possible longer mathematical and scientific career. However the truth of the matter is that he suffered from poor health all his life and, but for this, he might well have been able to be highly involved in politics yet continue with mathematical and scientific activities.\nPerhaps the name of Vandermonde is best known today for the Vandermonde\ndeterminant\n. While it is certainly true that he made a major contribution to the theory of determinants, yet nowhere in his four mathematical papers does this determinant appear. It is rather strange, therefore, that this determinant should be named after him and several authors have puzzled over the fact for some time.\nLebesgue\n's conjecture in\n[\n3\n]\n(\nfirst published in\n1940)\nthat it resulted for someone misreading Vandermonde's notation, and therefore believing that this determinant was in his work, seems the most likely.\nVandermonde's four mathematical papers, with their dates of publication by the\nAcadémie des Sciences\n, were\nMémoire sur la résolution des équations\nⓉ\n(\nMemoir on solving equations\n)\n(1771)\n,\nRemarques sur des problèmes de situation\nⓉ\n(\nNotes on problems of location\n)\n(1771)\n,\nMémoire sur des irrationnelles de différents ordres avec une application au cercle\nⓉ\n(\nMemoir on various irrational orders with an application to the circle\n)\n(1772)\n, and\nMémoire sur l'élimination\nⓉ\n(\nMemoir on elimination\n)\n(1772)\n.\nThe first of these four papers presented a formula for the sum of the\nm\nm\nm\nth powers of the roots of an equation. It also presented a formula for the sum of the symmetric functions of the powers of such roots. Neither of these were new having appeared in\nWaring\n's work shortly before but, although he was aware of this Vandermonde claimed, rightly in my\n[\nEFR\n]\nopinion, that his approach was sufficiently different to make publication of these results for a second time worthwhile. The paper also shows that if\nn\nn\nn\nis a prime less than\n10\nthe equation\nx\nn\n−\n1\n=\n0\nx^{n} - 1 = 0\nx\nn\n−\n1\n=\n0\ncan be solved in radicals. Jones writes in\n[\n1\n]\n:-\n... Vandermonde's real and unrecognised claim to fame was lodged in his first paper, in which he approached the general problem of the solubility of algebraic equations through a study of functions invariant under permutations of the roots of the equation.\nKronecker\nclaimed in\n1888\nthat the study of modern algebra began with this first paper of Vandermonde.\nCauchy\nstates quite clearly that Vandermonde had priority over\nLagrange\nfor this remarkable idea which eventually led to the study of group theory.\nIn his second paper Vandermonde considered the problem of the knight's tour on the chess board. This paper is an early example of the study of topological ideas. Vandermonde considers the intertwining of the curves generated by the moving knight and his work in this area marks the beginning of ideas which would be extended first by\nGauss\nand then by\nMaxwell\nin the context of electrical circuits.\nIn his third paper Vandermonde studied combinatorial ideas. He defined the symbol\n[\np\n]\nn\n=\np\n(\np\n−\n1\n)\n(\np\n−\n2\n)\n(\np\n−\n3\n)\n.\n.\n.\n(\np\n−\nn\n+\n1\n)\n[p]^{n} = p(p - 1)(p - 2)(p - 3) ... (p - n + 1)\n[\np\n]\nn\n=\np\n(\np\n−\n1\n)\n(\np\n−\n2\n)\n(\np\n−\n3\n)\n.\n.\n.\n(\np\n−\nn\n+\n1\n)\nand\n[\np\n]\n−\nn\n=\n1\n(\np\n+\n1\n)\n(\np\n+\n2\n)\n(\np\n+\n3\n)\n.\n.\n.\n(\np\n+\nn\n)\n.\n[p]^{-n} = \\Large\\frac{1}{(p+1)(p+2)(p+3)...(p+n)}\\normalsize .\n[\np\n]\n−\nn\n=\n(\np\n+\n1\n)\n(\np\n+\n2\n)\n(\np\n+\n3\n)\n.\n.\n.\n(\np\n+\nn\n)\n1\n​\n.\nHe gave an identity for the expansion of\n[\nx\n+\ny\n]\nn\n[x + y]^{n}\n[\nx\n+\ny\n]\nn\nand also proved that\nπ\nπ\n=\n[\nπ\n]\nπ\n.\n[\n−\nπ\n]\n−\nπ\n\\pi \\pi = [\\pi]^{\\pi}. [-\\pi]^{-\\pi}\nπ\nπ\n=\n[\nπ\n]\nπ\n.\n[\n−\nπ\n]\n−\nπ\nIt is interesting to note that at this time no notation existed for\nn\n!\nn!\nn\n!\nyet with his notation Vandermonde had defined something more general. Clearly\n[\nn\n]\nn\n=\nn\n!\n[n]^{n} = n!\n[\nn\n]\nn\n=\nn\n!\nThe final of Vandermonde's four papers studied the theory of determinants.\nMuir\n[\n4\n]\nclaims that because of this paper Vandermonde was:-\nThe only one fit to be viewed as the founder of the theory of determinants.\nThe reason for this strong claim by\nMuir\nis that, although mathematicians such as\nLeibniz\nhad studied determinants earlier than Vandermonde, all earlier work had simply used the determinant as a tool to solve linear equations. Vandermonde, however, thought of the determinant as a function and gave properties of the determinant function. He showed the effect of interchanging two rows and of interchanging two columns. From this he deduced that a determinant with two identical rows or two identical columns is zero. Finally he gave a remarkably clever notation for determinants which has not survived."
}