{
  "nome_completo": "Alexander Wilhelm von Brill",
  "nome_curto": "Alexander von Brill",
  "ano_nascimento": "1842",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brill/",
  "lugar_nascimento": "Darmstadt, Germany",
  "lugar_morte": "Tübingen, Germany",
  "biografia": "Alexander von Brill\nwas given the name Alexander Wilhelm Brill, the \"von\" only being added in\n1897\n. His father, Heinrich Konrad Brill\n(1808\n-\n1891)\n, was a the owner of a bookshop and printing business. Heinrich was born in Darmstadt on\n21\nOctober\n1808\n, the son of Karl Friederich Brill and Marie Luise Mallinkrott. He married Julie Henriette Simonetta Wiener\n(1820\n-\n1903)\nand, in\n1866\n, was a co-founder of the Association of German Printers. Julie Henriette Simonetta Wiener was the sister of\nChristian Wiener\nwho has a biography in this archive. Alexander was the eldest of his parents' six children, having siblings Ludwig Carl Wilhelm Brill\n(1844\n-\n1932)\n, Karl August Christian Brill\n(1846\n-\n1846)\n, Sophie Louise Brill\n(1847\n-\n1935)\n, Adolph Georg Brill\n(\nborn\n1850)\n, and Carl Friedrich Brill\n(1857\n-\n1892)\n. Alexander Brill's school education was in Darmstadt where he attended elementary school and then a\nGymnasium\n.\nIn\n1860\nBrill entered the Technische Hochschule in Karlsruhe where he studied architecture and engineering science. He was taught mathematics by his uncle\nChristian Wiener\n, attending his course on descriptive geometry, and by\nAlfred Clebsch\nwho taught the course on mechanics.\nClebsch\nhad been appointed to Karlsruhe in\n1858\nbut, in\n1863\n, he moved from Karlsruhe to the University of Giessen. Brill also moved to Giessen and was again taught by\nClebsch\n. He graduated from Giessen in\n1864\nwith a degree in architecture and gained his qualification to teach mathematics at Gymnasiums. Brill needed to find ways to support himself financially during his studies at both Karlsruhe and Giessen and he did this by taking on duties as a substitute teacher and also by tutoring private pupils. He was awarded his doctorate having written the dissertation\nÜber diejenigen Curven, deren Coordinaten sich als hyperelliptische Functionen eines Parameters darstellen lassen\nⓉ\n(\nOn those curves, whose coordinates can be represented as hyperelliptic functions of a parameter\n)\nwith\nClebsch\nas his advisor. Remaining in Giessen after his graduation to undertake research, Brill submitted his\nhabilitation\nthesis in\n1867\n. After the thesis was accepted Brill was appointed a\nprivatdozent\nin Giessen, a post he held for two years.\nClebsch left Giessen in\n1868\nwhen he was appointed to fill the chair at Göttingen that had been held by\nBernhard Riemann\nwho had died in\n1866\n. This changed the research environment at Giessen since Clebsch took his entourage of students with him. However,\nPaul Gordan\nremained at Giessen and his interests were similar to those of Brill. In\n1869\nBrill left Giessen to take up an appointment as a full professor at the Technische Hochschule in Darmstadt\n[\n7\n]\n:-\nIn\n1874\nhe brought out a series of paper models of second order surfaces. These models were inspired by a model of an elliptic paraboloid made from half-circles which the German-educated mathematician\nOlaus Henrici\nof London had sent to a meeting of mathematicians in Göttingen. Brill's models, which represented surfaces by delicately interlaced circles or quadrilaterals, were not as sturdy as wooden or even plaster models, but cost considerably less.\nThese cardboard models were described by Brill in\nCarton-Modelle von Flächen zweiter Ordnung, construirt nach Angabe\nⓉ\n(\nCardboard models of surfaces of the second order, constructed as specified\n)\n(1874)\n. Also in\n1874\nhe published\nÜber die algebraische Functionen und ihre Anwendung in der Geometrie\nⓉ\n(\nOn the algebraic functions and their applications in geometry\n)\n, a joint work with\nMax Noether\non properties of algebraic functions which are invariant under birational transformations. Brill had met\nMax Noether\n, who was two years younger, when the two were both working at Giessen and they had become good friends. They collaborated in producing an algebraic-geometric approach to the theory of\nRiemann\nsurfaces. Their joint work was the first systematic use of algebraic techniques, which today form part of commutative algebra, in the study of geometry.\nOn\n15\nMay\n1875\n, Brill married Anna Johannette Christiane Schleiermacher\n(\nborn\n1848)\nin Darmstadt. Anna was the daughter of Heinrich August Schleiermacher\n(1816\n-\n1892)\n, the Minister of Finance to the Grand Duke of Hesse, and his wife Johanna Philippina Katharina Auguste Schenck\n(1820\n-\n1859)\n. Alexander and Anna Brill had three sons, Alexander Brill, Eduard Brill\n(1877\n-\n1968)\nand August Brill. Alexander became President of the Imperial Pay Board, Eduard became an architect, craftsman and Director of a Craft School, and August became a manufacturer. Alexander and Anna Brill also had a daughter Julia who was born in\n1883\n.\nBrill held the position in Darmstadt until\n1875\nwhen he was appointed as the professor of mathematics at the Technische Hochschule in Munich. There he was joined by\nFelix Klein\nin\n1875\nand the two taught advanced courses to large numbers of excellent students. Brill and\nKlein\nboth had a great interest in teaching and Brill, like\nKlein\n, participated in the movement to reform the teaching of mathematics. It is clear that Brill was much influenced by being a colleague of\nKlein\n's for five years and the influence would show up in many different ways throughout Brill's career. Brill taught a remarkably talented collection of students while at the Technische Hochschule in Munich including, for example,\nAdolf Hurwitz\n,\nWalther von Dyck\n,\nKarl Rohn\n,\nCarl Runge\n,\nMax Planck\n,\nLuigi Bianchi\nand\nGregorio Ricci-Curbastro\n. In particular, as he had in Darmstadt, in Munich Brill\n[\n1\n]\n:-\n... was an initiator of the use of models of geometric figures in teaching; many such models were prepared under his guidance.\nAt Munich a laboratory for the design, production, and pedagogical application of models was set up by Brill and\nKlein\n. The construction of mathematical models became part of the work of the mathematical seminar and many students contributed to this work making models in connection with their dissertations. Brill published\nMathematische Modelle angefertigt im mathematischen Institut des Königlichen Polytechnikums zu München\nⓉ\n(\nMathematical models made in the mathematics department of the Royal Polytechnic of Munich\n)\n(1880)\nand looked for a way to make his production of mathematical models more commercial. To do this he enlisted the help of his elder brother Ludwig Brill who was now running the family printing business in Darmstadt. Ludwig Brill had taken over his father's business in\n1877\n.\nVon Dyck\nassisted\nKlein\nand Brill in the construction of models such as the tractrix of revolution, geodetic lines on an ellipsoid of revolution,\nKummer\n's surface,\nDupin\n's cyclide, the spherical catenary and twisted cubics. These mathematical models, constructed of silk threads in brass frames, became a major feature of Ludwig Brill's business. By\n1890\nhe was selling\n16\nseries of models, seven of which were the original ones constructed at the Technische Hochschule in Munich under the direction of Brill,\nKlein\nand\nvon Dyck\n. Around this time the firm was taken over by Martin Schilling of Leipzig and by\n1911\ntheir catalogue contained about\n400\nmathematical models inspired by Brill's early work in this area.\nThe production of mathematical models was part of Brill's efforts in teaching but he also published impressive research papers and books. For example, while at Munich he published\nHöhere Kurven\nⓉ\n(\nHigher curves\n)\n(1880)\n,\nZur Theorie der geodätischen Linie und des geodätischen Dreiecks\nⓉ\n(\nOn the theory of geodesic and geodesic triangle\n)\n(1883)\n, and\nBestimmung der optischen Wellenfläche aus einem ebenen Centralschnitte derselben\nⓉ\n(\nDetermination of the optical wave front of a plane central section\n)\n(1883)\n. Although\nKlein\nleft Munich in\n1880\n, Brill was to remain there for a few more years, taking up the chair of mathematics in the University of Tübingen in\n1884\n. Brill held this chair until he retired in\n1918\nat the age of\n76\n, but continued to live and do mathematics in Tübingen after his retirement until his death at age\n92\n.\nHe contributed to the study of\nalgebraic geometry\n, trying to bring the rigour of algebra into the study of curves. His work allowed the notion of genus of a curve, introduced by\nClebsch\n, to be extended to singular and non-singular curves. In\n1894\nhe wrote, again in collaboration with\nMax Noether\n,\nDie Entwickelung der Theorie der algebraischen Functionen in älterer und neuerer Zeit\nⓉ\n(\nThe development of the theory of algebraic functions in older and more recent times\n)\nwhich presents an extremely important survey of the development of the theory of algebraic functions. Pogrebyssky, in\n[\n1\n]\n, also notes the importance of:-\n... his papers on three-dimensional algebraic curves\n(1907)\nand on pseudospherical three-dimensional space\n(1885)\n, where the impossibility of putting such a space into Euclidean four-dimensional space and the possibility of its being placed in a Euclidean five-dimensional space are proved.\nBrill also wrote on determinants, elliptic functions, special curves and surfaces. He wrote articles on the methodology of mathematics and on theoretical mechanics. In\n1911\nhe published the book\nVorlesungen zur Entführung in die Mechanik raumerfullender Massen\nⓉ\n(\nIntroductory lectures on the mechanics of a continuous medium\n)\n. It is reviewed in\n[\n10\n]\n:-\nThis book has a twofold design, to serve as an introduction to the mathematical treatment of the mechanics of a continuous medium, and to employ for that purpose the ideas set forth by\nHeinrich Hertz\nin his 'Mechanics'. Much interest has always been felt in various \"economic\" statements of the laws of nature, and some day an interesting monograph will doubtless fill up the outline sketched by Mach, tracing back the principle that \"Nature always acts by the simplest and most perfect means\" to the schoolmen if not to\nAristotle\n, setting forth the first triumph of the principle in suggesting to\nFermat\nthe famous law of swiftest propagation of light, and not omitting\nMaupertuis\nand the \"principle of least action.\" ... Professor Brill sets out the Hertzian system, and illustrates it by examples. It is curious to note that the example chosen of non-holonomous systems, in which the constraints are expressible by a differential equation unintegrable per se, is as simply dealt with by direct application of\nNewton\n's second law, which avoids what Professor Brill terms the \"delicate considerations and special precautions\" necessary in applying\nLagrange\n's equations. The book is divided into four sections, dealing with material particles and rigid bodies, the mechanics of fluids, of elastic solids, and with the electro-magnetic theory of light. It possesses high interest as indicating a sequence in the branches of mathematical physics discussed, for the co-ordination of a student's progress in the working of mathematical machinery, with his progress in familiarity with the physical problems to be treated, is a matter which is far from invariably being well regulated.\nIn\n1912\nBrill published\nDas Relativitätsprinzip. Eine Einführung in die Theorie\nⓉ\n(\nThe principle of relativity. An introduction to the theory\n)\nin\nJahresbericht der deutschen Mathematiker-Vereinigung\n.\nEdwin Bidwell Wilson\nwrites in a review\n[\n12\n]\n:-\nThe treatment is mathematical and didactic, without pretense of originality, and directed toward giving a brief account of the kinematics and dynamics of a particle from the point of view of relativity; electromagnetic phenomena and the theory of radiant energy are omitted.\nIn\n1925\nhe published his lectures on algebraic curves in the book\nVorlesungen über ebene algebraische Kurven una algebraische Funktion\nⓉ\n(\nLectures on algebraic plane curves una algebraic function\n)\n. Arnold Emch writes in a review\n[\n5\n]\n:-\nThe book under review embodies in final form the course of lectures which, for many years, Brill has given at the University of Tübingen. As is well known Brill together with\nMax Noether\nare the twin-stars of German geometricians who did the important pioneer work concerning the geometry on algebraic curves. One may therefore expect that a treatise on the subject by such a man should contain much that is of value and of fundamental importance for the student of geometry and, in a wider sense, for the mathematician in general. It is true that the lectures are intended for the beginner, i.e., in American terminology, for the first and possibly second year graduate student. In other words, the student will have a fairly good start in algebraic geometry after he has mastered Brill's lectures. ... Brill states that in former years he put more stress upon the projective point of view, while in later years he returned more and more to the standpoint of the first discoverers in this field, of\nDescartes\n,\nNewton\n,\nCramer\n,\nEuler\n, in so far as the graphical or geometric form relations are concerned. What Brill presents is, as one might expect, very penetrating and illuminating. ... Brill, one of the remaining representatives of an important period of geometric development, has given enough of an algebraic, function theoretic treatment of algebraic geometry to stimulate the student for further reading and research in this direction. In this sense the book will be found very profitable and may be highly recommended.\nIn\n1928\nBrill published his lectures on theoretical mechanics in the book\nVorlesungen über Allgemeine Mechanik\nⓉ\n(\nLectures on general mechanics\n)\n.\nHoward Percy Robertson\nwrites in the review\n[\n11\n]\n:-\nThis treatment of the dynamics of a particle, rigid bodies, and systems of particles is an outgrowth of Professor Brill's lectures on theoretical mechanics in the Technische Hochschule in Munich and the University of Tübingen. The statics of rigid bodies is discussed only incidentally, and for the mechanics of deformable bodies, with the exception of two sections on the elastic rod, the reader is referred to the author's 'Einführung in die Mechanik raumerfüllender Massen'\nⓉ\n(\nIntroduction to the mechanics of a a continuous medium\n)\n(1909)\n. The subject proper, the dynamics of particles and rigid bodies, is built up from first principles in a manner which commends the book to the beginning student of mechanics who has mastered mathematics through advanced calculus. ... Professor Brill's work is to be recommended as an exceptionally well written introduction to dynamics. It is particularly to be commended for the fine balance which it maintains between general principles on the one side and applications to physics, astronomy, and engineering on the other.\nIn\n1930\n, at age\n87\nhe wrote a book on\nKepler\n's astronomy,\nÜber Kepler's Astronomia nova\nⓉ\n(\nOn Kepler's 'Astronomia nova'\n)\n.\nFinally let us comment on Brill's personality. Gerhard Betsch writes in his article in\n[\n3\n]\n:-\nAll tributes praise Brill's extensive education, his modest elegant style, his goodness and his kindness. He was a strict teacher who demanded much of his students. His major life's work demonstrates a high degree of persistence, energy and discipline. He benefitted from a good physique, but also his strong will and a very regular, modest lifestyle helped to keep him amazingly spry and mentally fit to the last. He followed the professional and scientific careers of his students with a lively sympathy. He was pleased with the numerous signs of kind sentiments and devotion that have been bestowed on him.\nAmong the honours given to Brill throughout his long life we mention his election to the\nReale Accademia dei Lincei\n, the Bavarian Academy of Sciences, the\nGerman Academy of Scientists Leopoldina\n, the Reale Istituto Lombardo di Scienze e Lettere, and the\nGöttingen Academy of Sciences\n. He was president of the\nGerman Mathematical Society\nin\n1907\nand elected an honorary member of the Society in\n1927\n. He was awarded the Cross of Honour of the Order of the Crown\n(\nWürttemberg\n)\nin\n1897\n. He was chairman of the Württemberg Society for the Advancement of Science from\n1920\nto\n1925\n.\nBrill gave his last public lecture on\n4\nMarch\n1930\nwhen he spoke to the Tübingen Dienstagsgesellschaft about his work on\nKepler\n. He was present at an Academic Ceremony held on\n28\nJuly\n1932\nto celebrate his\n90\nth\nbirthday."
}