{
  "nome_completo": "Alexander Fairley Buchan",
  "nome_curto": "Alexander Buchan",
  "ano_nascimento": "1904",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Buchan/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Alexander Buchan\n's father was John R Buchan. Alexander attended Sciennes School, Edinburgh, in\n1916\n, then George Heriot's School, Edinburgh, from\n1916\n-\n1922\n. In September\n1922\nhe obtained passes at Higher level in the Scottish Leaving Certificate examinations in English, Mathematics, German, Science, and Dynamics.\nAfter completing his studies at George Heriot's, Buchan entered the University of Edinburgh, matriculating in October\n1922\nwhen he entered the Faculty of Pure Science. He was awarded a B.Sc.\n(\nPure\n)\nwith First Class Honours from Edinburgh on\n20\nJuly\n1926\nand became a mathematics teacher at Gillespie's School, Edinburgh.\nAfter working between\n1930\nto\n1935\nas a teacher at the Royal High School, Edinburgh, Buchan then became Principal Teacher of Mathematics at James Gillespie's High School for Girls, Edinburgh. He continued to have strong research interests in mathematics and, in\n1939\n, he submitted his thesis\nLinear Combination of Data with Least Error of Differences\nto the University of Edinburgh and was awarded a Ph.D. on\n30\nJune of that year. His thesis advisor at Edinburgh was\nAlexander Aitken\n.\nDuring World War II Buchan was Squadron Leader and Commandant in the Air Training Corps in Scotland. His final appointment was as Principal Lecturer in Mathematics at Moray House College of Education, Edinburgh. He represented Scotland in the Emergency Scheme for the Training of Teachers in India. For his services he was awarded the M.B.E.\nAlexander Buchan was a member of the\nEdinburgh Mathematical Society\n, joining in February\n1927\n. He was elected to the\nRoyal Society of Edinburgh\non\n4\nMarch\n1940\n, his proposers being\nSir Edmund T Whittaker\n,\nAlexander Craig Aitken\n,\nDavid Gibb\n,\nRobert Schlapp\n.\nAn obituary, written by Douglas M Mcintosh, appears in the\nRoyal Society of Edinburgh\nYear Book\n1977\n, pages\n27\n-\n28\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nFinally we note Buchan's association with Scottish Freemasonry. He was Grand Secretary of the Grand Lodge of Scotland from\n1948\nto\n1971\n. The report of his appointment contains a few more details of his life:\nSCOTTISH FREEMASONS\nNew Grand Secretary Elected\nDR ALEXANDER F BUCHAN\nAt a quarterly meeting of the Grand Lodge of Scotland held in Freemasons' Hall, Edinburgh, yesterday\n(\nThursday\n5\nFebruary\n1948)\n- the Grand Master Mason, the Earl of Galloway, presiding - Mr Alexander Fairley Buchan, M.B.E., B.Sc. Ph.D., F.R.S.E.. was elected Grand Secretary in succession to Dr W King Gillies, who was appointed in\n1941\nto serve for the period of the war and whose resignation was accepted with regret last year.\nDr Buchan, who is\n42\nyears of age, was formerly principal master of mathematics in James Gillespie's High School, and since then principal lecturer in mathematics and Master of Method in Moray House Training College, Edinburgh. During the recent war he was first employed in connection with the Children's Overseas Reception Board and supervised and accompanied\n100\nchildren to Canada in\n1940\n. He served in the Royal Air Force for three years, with the rank of Squadron Leader. As Senior Administrative Staff Officer to the A.T.C. Commandant in Scotland he was responsible for the administration and training of all units in Scotland. The Scottish Education Department sent him to India to represent Scotland under the Emergency Scheme for the training of teachers.\nThe Grand Secretaryship to which Dr Buchan has been elected is a full-time salaried appointment. At the present time Dr Buchan is Master of one of the oldest Lodges in existence, Canongate Kilwinning No.\n2\n, Edinburgh.\nImmediately following his election. Dr Buchan was installed in office by the Grand Master Mason."
}