{
  "nome_completo": "Alfred North Whitehead",
  "nome_curto": "Alfred North Whitehead",
  "ano_nascimento": "1861",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whitehead/",
  "lugar_nascimento": "Ramsgate, Isle of Thanet, Kent, England",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Alfred North Whitehead\n's father, also named Alfred Whitehead, was an Anglican clergyman from Ramsgate. He is said to have been an upright man with countless friends and Alfred North Whitehead's son, North Whitehead, wrote of his grandfather:-\nHe never asked a favour of anyone and never shirked what he considered to be a duty, but it cannot be said that he spent more time absorbing the lessons of the New Testament than was necessitated by his calling.\nCanon Alfred Whitehead, the mathematician's father, married Maria Sarah Buckmaster, who came from London, on\n20\nDecember\n1851\n. She is described as\n(\nsee\n[\n6\n]\n)\n:-\n... an unimaginative, small minded woman with some wit but no sense of humour.\nAlfred and Maria Whitehead had four children, with Alfred North Whitehead as the youngest of the family. He had two brother who were seven and eight years older than he was, and a sister who was two years older. Whitehead was always treated by his parents as the baby of the family and, rather surprisingly, they considered him a sickly and frail child when it appears that this was not the case. Whitehead was not sent to primary school because his parents thought that he was too delicate, so he was taught at home by his father until he was\n14\n. Other than the usual childhood illnesses he was, despite his parents views, a healthy child. He received much affection from his father and brothers\n(\nbut sadly little from his mother\n)\nand he seems to have had a childhood which was not unhappy, even though he was on his own a great deal and must have been somewhat lonely.\nWhitehead's father taught him Latin from the age of ten and Greek from the age of twelve. His ability in these subjects could certainly be classed as competent but it was certainly not outstanding; there was no sign of the genius that he showed later in life. He did learn a little mathematics from his father but quite how he developed an interest in the subject is a mystery. In September\n1875\nhe left his father's vicarage and entered Sherbourne Independent School. His oldest brother became a teacher at the school in\n1876\nwhen Whitehead was entering his second year of study.\nThe course he followed at Sherbourne was a fairly standard one for the time. There was little choice of subjects and all the boys studied as their major subjects Latin, Greek and English, with the minor subjects of mathematics, physical sciences, history, geography and modern languages receiving less attention. Whitehead showed a special gift for mathematics and was allowed to devote extra time to that subject in his final school year, dropping composition and reading of Latin poetry to make way for the extra mathematics.\nIn\n1879\nWhitehead took the entrance examinations for Trinity College, Cambridge, and he won a scholarship. Following this he spent his final year at Sherbourne as Head Boy and Captain of Games before he entered university in October\n1880\n. As the holder of a scholarship, Whitehead lived in College. He attended only mathematics lectures and was taught by\nJ W L Glaisher\n, H M Taylor, and\nW D Niven\n. He also attended lectures by\nStokes\nand\nCayley\nwhile his coach was the famous\nE J Routh\n. Among his close friends at Cambridge was\nD'Arcy Thompson\n.\nWhitehead won a second scholarship, a College Foundation, and so by the time he entered his second year of study he was quite well off. He took the Mathematical Tripos examinations in\n1883\nand was placed Fourth\nWrangler\n; the Senior Wrangler that year was G B\nMathews\n(\nthe Senior Wrangler was ranked first, the Fourth Wrangler ranked fourth in the list of students awarded a First Class degree\n)\n. In the following year he was also placed in the First Class of Part III of the Mathematical Tripos. He presented a dissertation on\nMaxwell\n's theory of electricity and magnetism in the competition for a Fellowship in\n1884\n.\nThomson\nand\nForsyth\nwere appointed to examine Whitehead and, much to his surprise, he won one of the five scholarships available that year.\nAfter winning the Fellowship, Whitehead was appointed to an assistant lectureship. He taught mostly applied mathematics but, surprisingly, he published no papers during the first five years of his tenure of the Fellowship. It is not known if he worked on mathematical research over this period. Certainly he was very much of a loner and did not talk much with the other mathematicians. In the twelve years following taking up the teaching position at Cambridge he published only two papers, both in\n1889\non the motion of viscous fluids. The reason that the topic interested him was almost certainly because he had attended lectures by\nStokes\non viscous fluids.\nDespite his poor publication record, Whitehead was promoted to a Lectureship at Cambridge in\n1888\n. He took up additional teaching duties by accepting a teaching position at Girton College. All the signs at this time would point to him having decided that his strength was in teaching and not in publishing. A rather remarkable change came, however, when he married Evelyn Wade in London on\n16\nDecember\n1890\n[\n6\n]\n:-\nWhereas he was quiet and restrained, she was active and outgoing.\nHe had become interested in pure mathematics and he started work on\nTreatise on Universal Algebra\nin January\n1891\n, just weeks after his marriage. The work would take him seven years to complete, not finally being published until\n1898\n. Whitehead's wife, Evelyn Wade, was the daughter of Captain A Wade, and they had three children, two sons and a daughter. The younger of the two sons, Eric Alfred Whitehead, became a second Lieutenant in the Royal Flying Corps\n(\nwhich was set up in\n1912\nand later became part of the Royal Air Force\n)\nand died while on a flying patrol in France in\n1918\n.\nOther changes in Whitehead's life took place around the time of his marriage. We have already indicated that Whitehead's father was an Anglican vicar and, of course, Whitehead was brought up as an Anglican. However around\n1889\n-\n90\nhe began to move towards the Roman Catholic Church. He debated with himself for seven years whether to remain an Anglican or join the Roman Catholic Church. In the end he chose neither and became an agnostic around the mid\n1890\ns. He himself stated that the biggest factor in his becoming an agnostic was the rapid developments in science; particularly his view that\nNewton\n's physics was false. It may seem surprising to many that the correctness of\nNewton\n's physics could be a major factor in deciding anyone's religious views. However one has to understand the complex person that Whitehead was, and in particular the interest which he was developing in philosophy and\nmetaphysics\n.\nWe should return to the story of the\nTreatise on Universal Algebra\nwhich Whitehead worked on for much of the\n1890\ns. Perhaps the first comment we should make is that the work is not on the modern topic of universal algebra for the term 'universal algebra' had quite a different meaning to Whitehead. In fact the name was taken from a paper published by\nSylvester\nfourteen years earlier. In the Preface to the treatise he writes that his aim is:-\n... to present a thorough investigation of the various systems of symbolic reasoning allied to ordinary algebra ... . The chief examples of such systems are\nHamilton\n's Quaternions,\nGrassmann\n's Calculus of Extension, and\nBoole\n's Symbolic Algebra.\nAlso in the Preface Whitehead also gives his views on the nature on mathematics and the philosophy of mathematics:-\nMathematics in its widest signification is the development of all types of formal, necessary, deductive reasoning. The reasoning is formal in the sense that the meaning of propositions forms no part of the investigation. The sole concern of mathematics is the inference of proposition from proposition. ... The ideal of mathematics should be to erect a calculus to facilitate reasoning in connection with every providence of thought, or external experience, in which the succession of thoughts, or of events can be definitely ascertained and precisely stated. So that all serious thought which is not philosophy, or inductive reasoning, or imaginative literature, shall be mathematics developed by means of a calculus.\nAlthough Whitehead became very productive after his marriage, he never considered himself a creator of new areas of mathematics, but rather as a developer of ideas introduced by others. This does not mean that his contribution should be considered any less important because of this but certainly Cambridge seems to have undervalued his contribution. In\n1894\nWhitehead became an examiner for the Mathematical Tripos. In\n1903\nhe was promoted to Senior Lecturer, a position which had only just been established at Cambridge.\nWhitehead is perhaps best known for his collaboration with\nBertrand Russell\n. We shall give details of this collaboration below, but first we shall complete the details of Whitehead's career. He remained at Cambridge until\n1910\nbut, in some sense, having not made the grade in mathematics and, having little prospects of a mathematics chair at Cambridge, he moved to the University of London. This explanation of his move is almost certainly basically correct and this indeed was the motivation behind Whitehead's thinking; on the face of it, however, rather different and dramatic events ended his association with Cambridge.\nIn\n1910\nAndrew\nForsyth\n, who had been a close friend of Whitehead's since his student days, had a love affair with Marion Amelia Boys, the wife of\nC V Boys\n, and the scandal forced him to resign his chair at Cambridge. Whitehead did everything he could to ensure that\nForsyth\nkept his Fellowship. The decision as to whether he could keep the Fellowship was taken by the Council of Trinity and Whitehead, as a member of that Council, argued strongly that\nForsyth\nshould be allowed to remain a Fellow of Trinity. Whitehead was outvoted on the Council, however, and shortly after this he resigned his Senior Lectureship and his Fellowship.\nThe Council then voted that Whitehead had served as a Lecturer for over\n25\nyears\n(\nthe maximum period\n)\nso must leave his post. Whitehead's appointment as Senior Lecturer still had three years to run but he did not stay to argue his case. He moved to London in the summer of\n1910\nwith no job to go to. In\n1914\n, after four years without a proper position, he became Professor of Applied Mathematics at the Imperial College of Science and Technology in London. He accepted a chair in philosophy at Harvard University in\n1924\n, and he taught at Harvard until his retirement in\n1937\n.\nBertrand Russell\nentered Cambridge in\n1890\nand immediately Whitehead, as examiner for the entrance examinations, spotted\nRussell\n's brilliance in his examination papers. Whitehead argued that\nRussell\nshould be awarded a more prestigious scholarship than his marks would have merited and indeed this was agreed. When\nRussell\nwas in his second year as an undergraduate he was taught by Whitehead. Their collaboration on\nPrincipia Mathematica\nappears to have begun near the end of\n1900\n, although both men failed to remember the exact time their collaboration began when interviewed late in their lives. In fact they had attended the International Congress of Mathematicians in Paris in\n1900\nand there they had learnt about\nPeano\n's work on the foundations of mathematics. This led to them study\nPeano\n's papers and this must have been a major factor in getting their collaboration started.\nAt the time they began collaborating, Whitehead was working on his article\nMemoir on the algebra of symbolic logic\nwhile\nRussell\nwas close to finishing the first draft of his\nPrinciples of mathematics\n. Whitehead was planning a second volume of\nTreatise on Universal Algebra\nbut both their plans were somewhat disrupted in\n1901\nwhen\nRussell\ndiscovered his famous set theory paradox. After the initial worry over the paradox they joined forces on Volume\n2\nof\nRussell\n's work so, by\n1903\n, Whitehead was working simultaneously on two different second volumes. Realising that this was not the optimal course for him he abandoned the second volume of his own work to concentrate on his collaboration with\nRussell\n. Their joint work attempted to construct the foundations of mathematics on a rigorous logical basis and it was carried out with\nRussell\nas the philosopher on the project and Whitehead as the mathematician.\nWorking with\nRussell\ndid not occupy Whitehead completely for he continued to produce work of his own. In\n1906\nhe published\nThe axioms of projective geometry\nand, in the following year,\nThe axioms of descriptive geometry\n. The first volume of\nPrincipia Mathematica\nwas published in\n1910\n, the second in\n1912\n, and the third in\n1913\n. He also wrote the popular mathematics book\nAn introduction to mathematics\nwhich was published in\n1911\n, between Volumes\n1\nand\n2\nof the\nPrincipia\n.\nAs the\nPrincipia Mathematica\nneared completion, Whitehead turned his attention to the philosophy of science. This interest arose out of the attempt to explain the relation of formal mathematical theories in physics to their basis in experience, and was sparked by the revolution brought on by\nEinstein\n's general theory of relativity. In\nThe Principle of Relativity\n(1922)\n, Whitehead presented an alternative to\nEinstein\n's views.\nScience and the Modern World\n(1925)\n, a series of lectures given in the United States, served as an introduction to his later metaphysics. Whitehead's most important book,\nProcess and Reality\n(1929)\n, took this theory to a level of even greater generality.\nWhitehead received many honours throughout his career. Elected to the\nRoyal Society\nin\n1903\n, he was awarded the Society's Sylvester Medal in\n1925\nbecause of his work on the foundations of mathematics and his studies of physical concepts. The\nRoyal Society of Edinburgh\nawarded him their James Scott Prize in\n1922\n(\nhe was the first recipient\n)\n. Columbia university awarded him their Butler Medal in\n1930\nand in the following year he was elected to the British Academy. He was awarded the Order of Merit in\n1945\n. Many universities awarded him an honorary degree including Manchester, St Andrews, Wisconsin, Harvard, Yale and Montreal."
}