{
  "nome_completo": "Alfred William Goldie",
  "nome_curto": "Alfred Goldie",
  "ano_nascimento": "1920",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Goldie_Alfred/",
  "lugar_nascimento": "Coseley, Staffordshire, England",
  "lugar_morte": "Barrow in Furness, Cumbria, England",
  "biografia": "Alfred Goldie\n's father\n[\n1\n]\n:-\n... worked as a skilled fitter at Austin Motors, the car manufacturers. The factory employed\n1\n500\nskilled workers serving\n15\n000\nunskilled labourers. The former were responsible for preparing the brass templates used for the accurate positioning of the holes for the screws that held together the various parts of the car. Templates were prepared for new models every two years, and had to be accurate to one thousandth of an inch. The skilled workers often had little work to do, as the actual drilling was done by the unskilled employees.\nAlfred attended Wolverhampton Grammar School where he won a scholarship to St John's College, Cambridge. He entered Cambridge in\n1939\njust days after World War II began. His scholarship allowed him to complete the usual three year degree in only two years and, indeed, he obtained a First in Part II of the mathematical tripos in\n1941\n. During these two years at Cambridge he was in the Officers Training Corps, and he also took an interest in politics taking a left wing Communist position.\nBecause of the war, Goldie did not continue to Part III of the tripos but instead was interviewed for a military position by C P Snow, the novelist, who was acting as scientific adviser to the British Government. Snow realised that, despite Goldie's training in the Officers Training Corps, he would make a more valuable contribution to the war effort using his mathematical skills in Ballistic Research. He was sent to work under C A Clemmow in Cambridge, but soon the Ballistic Research team moved to Shrewsbury. He also spent time at a military base near Glasgow, then towards the end of the war he was sent to the Woolwich Arsenal in London. In October\n1944\nhe married Mary Kenyon; they had one son and two daughters. As the war drew to a close he began to think about restarting his mathematical education\n[\n1\n]\n:-\n[\nHe\n]\nmet\nG E H Reuter\n, who was at the time a research student working in Cambridge under\nHardy\nand\nLittlewood\n. They discussed the possibility of Goldie's going back to Cambridge to finish his education by doing Part III of the Mathematical Tripos. However ...\nReuter\nwarned him that as a married man Goldie would not be able to afford another year as a student.\nGoldie requested that he be allowed to begin studies for a Ph.D. at London University, and he was allowed to take some time off from his work at Woolwich Arsenal to undertake mathematical research. As part of his return to mathematics he began attending meetings of the\nLondon Mathematical Society\n. There he learnt that\nPhilip Hall\nwho, after undertaking work on codes at Bletchley Park, had returned to Cambridge. Since he wanted to undertake research in algebra, Goldie was advised to write to\nHall\nseeking advice. This was readily given, and\nHall\nsuggested that Goldie read\nvan der Waerden\n's\nModerne Algebra\n, a difficult task for someone who did not speak German, but with the help of a dictionary Goldie soon mastered this fundamental text largely based on\nEmmy Noether\n's revolutionary contributions to algebra. Goldie exchanged letters with\nHall\n, and also met\nHall\non some weekends when he was at his mother's home in Hampstead.\nWorld War II ended in\n1945\nwith Germany surrendering in May and Japan in August. Goldie continued to work at Woolwich Arsenal for another year, only leaving in September\n1946\nwhen he was appointed Assistant Lecturer in Mathematics at Nottingham University. At this stage he had not completed his Ph.D. at London University, but he decided that now he was in an academic position there was no need for him to continue with his doctoral studies. Alfred and Mary's first child, a son, was born a few weeks after they moved to Nottingham. He continued to write to\nHall\nfor advice regarding his research, and\nHall\nsuggested that he read the recently published first volume of\nAlgebra\nby\nBourbaki\n. This led Goldie to the results in universal algebra which he published in\nThe Jordan-Hölder theorem for general abstract algebras\n(1950)\nand\nThe scope of the Jordan-Hölder theorem in abstract algebra\n(1952)\n.\nA heavy lecture load and difficult living conditions for Goldie and his family, made his two years in Nottingham quite difficult. When he received an offer of a Lectureship at Newcastle University he did not hesitate but happily made the move. It made sense for several different reasons; he was able to afford much better housing for his family, and it was an exciting time there mathematically. Newcastle was building up a strong mathematics department guided by the professor,\nW Rogosinski\n.\nKurt Hirsch\nwas appointed to a Readership while\nFrank Bonsall\nand Alfred Goldie were appointed to Lectureships.\nHirsch\nadvised Goldie to concentrate on an area of algebra other than universal algebra, so he decided that ring theory would provide a good area which would complement the active UK research area of group theory which was led by\nPhilip Hall\n. However,\nBonsall\nwas working on normed rings and this led to the two collaborating on the papers\nAlgebras which represent their linear functionals\n(1953)\nand\nAnnihilator algebras\n(1954)\n. Deciding that he needed to carve out an area of his own if he was to make a success of the academic profession, Goldie started to undertake research on his own in ring theory\n[\n1\n]\n:-\nOne of the most characteristic features of ring theory in the late\n1940\ns and early\n1950\ns was the search for a structure theory for general rings. The most successful approach to this problem was that of\nN Jacobson\n. Thus it is not really surprising that Goldie's early work in ring theory was influenced by\nJacobson\n's papers and books.\nJacobson\nand Goldie had met at the International Congress of Mathematicians in Amsterdam in\n1954\nand at that time\nJacobson\nsuggested that Goldie work on problems in Notherian rings. In fact Goldie's first paper in this area\nDecompositions of semi-simple rings\n(1956)\nmade an immediate impact since\nJacobson\nincluded one of Goldie's theorems in his classic monograph\nStructure of Rings\nof\n1956\n, acknowledging that it had been communicated by Goldie. Over the next few years Goldie's work on non-commutative Notherian rings would totally revolutionise the subject. He was able to prove totally unexpected structure theorems. Even his first steps towards these results were startling as the following story, recounted in\n[\n1\n]\n, tells us:-\nAfter the war, whenever\nBrauer\nvisited England he would go to Newcastle and stay with the Rogosinskis. On one of these occasions, Goldie showed\nBrauer\nhis result on Noetherian domains. All\nBrauer\nsaid was: \"Oh my God!\" Goldie then explained that he now needed to \"do the matrix case\";\nBrauer\nreplied \"my boy, you are on your own.\"\nThe breakthrough which allowed him to complete his structure theorem for Noetherian prime rings came after a family holiday to Sedberg in the Yorkshire Dales National Park was abandoned early due to persistent rain\n[\n1\n]\n:-\nAfter five days they decided to give up, and returned to Newcastle on a Thursday. The break must have given Goldie's subconscious time to catch up, for between Friday and Monday he\n[\nmade the breakthrough\n]\n.\nGoldie published his results, now known as \"Goldie's Theorem,\" in\nThe structure of prime rings with maximum conditions\n(1958)\nand\nThe structure of prime rings under ascending chain conditions\n(1958)\n. A generalisation appears in\nSemi-prime rings with maximum condition\n(1960)\n. Robson explains in\n[\n2\n]\n:-\nThis result came as a huge surprise, since it had been unsuspected, and it was hailed as a most considerable advance. It led to invitations to work in other institutions, including Yale University, the Institut des Hautes Études Scientifiques in Paris and Tulane University in New Orleans. The developments since his discovery have only served to demonstrate just how seminal it was. It remains a major tool in the subject and in surrounding areas. It is pertinent to note that a\n1987\ngraduate text which aimed to describe the result and to survey some of its consequences\n(\n\"Noncommutative Noetherian Rings\" by J C McConnell and J C Robson\n)\nuses about\n50\npages to establish Goldie's Theorem and over\n500\npages to outline consequences.\nGoldie had been promoted to Senior Lecturer at Newcastle, then in\n1963\nhe was appointed Professor of Pure Mathematics at Leeds University. His mission at Leeds was to build a strong research group there. Indeed he was very successful in this and built a school of algebra at the University of Leeds that has had great influence on algebra for many years. Small writes\n[\n3\n]\n:-\nAt Leeds he continued his work in algebra, building a \"school\" in ring theory, hosting many visitors, and organizing memorable conferences. Goldie visited the U.S. many times, with extended stays at Yale, Tulane, and the University of California at San Diego.\nHe retired in\n1986\nbut continued with his research, living in Bowness-on-Windermere. During his retirement he published papers such as\n(\nwith Günter Krause\n)\nAssociated series and regular elements of Noetherian rings\n(1987)\n,\nRings with an additive rank function\n(1990)\n, and\n(\nwith Günter Krause\n)\nEmbedding rings with\nKrull\ndimension in Artinian rings\n(1996)\n. His wife Mary died in\n1995\nand Goldie married Margaret Turner in\n2002\n. His death was the result of a heart attack following surgery a few days earlier.\nAmong the honours Goldie received for his outstanding contributions, we mention the Senior Berwick Prize from the\nLondon Mathematical Society\nin\n1970\n. He served on the Council of the\nLondon Mathematical Society\nand was Vice-President during\n1978\n-\n80\n. He was Chairman of the\nBritish Mathematical Colloquium\nat Leeds in\n1968\n, and lectured at the Colloquium of\n1972\nin Glasgow when he spoke on\nSome infinite dimensional algebras\n.\nAs to his character we quote from\n[\n2\n]\n:-\nHe was a vivid personality with an individual mind, full of opinions and strongly argued positions on mathematics but also on the wider world, including politics, where his views moved rightwards over the years - starting with Communism whilst a student at Cambridge, and ending well within traditional Conservatism. ... Alfred Goldie was a very practical man, particularly enjoying working with wood. He also had a love of the outdoors, which he shared with his first wife, Mary, a geographer. Despite somewhat incompatible personalities, they still managed to give their three children a stable and happy upbringing.\nAlso we quote from\n[\n3\n]\n:-\nAlfred Goldie approached his work with optimism and with no fear of the really hard problems."
}