{
  "nome_completo": "Alfred Leon Foster",
  "nome_curto": "Alfred Foster",
  "ano_nascimento": "1904",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Foster/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Alfred Foster\nattended the California Institute of Technology, graduating with a B.S. in mathematics in\n1926\n. After spending a further year at Caltech to study for his master's degree, Foster went to Princeton where he studied for his doctorate under the supervision of\nAlonzo Church\n. At Caltech his interests had been in mathematical physics and algebra, and it was his algebra professor\nBell\nwho had recommended that he study at Princeton for his doctorate. It was also\nBell\nwho supported his application for a scholarship from Princeton to fund his doctoral studies there. Foster went to Princeton with the intention of researching in algebra but:-\n... at that time group theory was perhaps a household word, and I saw an opportunity to introduce some group theory into mathematical logic.\nIn fact\nChurch\nwas only one year older than Foster, who became his first Ph.D. student, and he had begun to supervise Foster in the same year that he was awarded his own doctorate. There is some confusion in the literature as to whether\nChurch\nor\nVeblen\nsupervised Foster, but he explained the precise position in an interview:-\n... I officially was working with\nChurch\n, but\nVeblen\nwas more insistent on guiding me through than\nChurch\nwas.\nFoster submitted his Ph.D. thesis\nFormal Logic in Finite Terms\nto Princeton University in\n1930\nand the degree was awarded in the following year. He wrote a paper\nFormal logic in finite terms\n, based on his thesis, which was published in\n1931\nin the\nAnnals of Mathematics\n.\nFoster married Else Wagner in\n1930\nafter submitting his thesis. They travelled to Germany where Foster undertook a year of postdoctoral study at Göttingen. It was a year in which he fell in love with the style of teaching and research undertaken there, and it would influence him throughout the rest of his career. The Great Depression began in\n1929\nwhile Foster was working for his doctorate and by\n1932\n, after he finished his studies in Germany, one quarter of the workers in the United States were unemployed. However Foster had been fortunate in these extremely difficult times:-\n... at Princeton at that time, Joel Hildebrandt was scouting for the department at Berkeley, which was not very strong in the beginning years. Hildebrandt went scouting all over the country. When he was at Princeton he interviewed me along with some others. ...\nEisenhart\ngave me a strong recommendation to Hildebrandt, and sometime later I got an offer from Berkeley.\nOn their return to the United States the Fosters travelled by car across the country to Berkeley where Alfred continued his studies and also undertook some teaching.\nGriffith Evans\nwas appointed to the University of California at Berkeley in\n1933\nand was given the explicit mandate to revitalise and improve the mathematics department and set up a programme for graduate studies. In the summer of\n1934\nEvans began his task at Berkeley as chairman of the mathematics department, and one of his first acts was to appoint Foster to the Faculty. Except for several periods of study leave, mainly in Freiburg and Tubingen, Foster continued to work at Berkeley until he retired in\n1971\n. Alfred and Else Foster brought up their two sons and two daughters in Berkeley.\nFoster, as a student of\nChurch\n, naturally began his research career working in mathematical logic. However through a natural interest in Boolean algebra and Boolean rings, he moved more towards an interest in algebraic structures. For example in\n1941\nhe published\nNatural systems : the structure of abstract monotone sequences\n. In this paper he defines a \"natural system, with unit\", to be an abstract system\n(\nN\n,\n∘\nN, \\circ\nN\n,\n∘\n)\n, where\nN\nN\nN\nis a denumerable set and\n∘\n\\circ\n∘\na binary operation\n(\nproduct\n)\n, such that the product of two elements of\nN\nN\nN\nis unique and in\nN\nN\nN\n, the associative and commutative laws hold, there is a single unit, there is at least one prime, and unique factorisation into primes holds. In\n1944\n, together with his colleague Benjamin Bernstein, he published\nSymmetric approach to commutative rings, with duality theorem : Boolean duality as special case\nin the\nDuke Mathematical Journal\n. Also in\n1944\nFoster published\nNatural orderings\nwhich, in his own words, was written:-\n... to study\n[\nthe\n]\narithmetic\n[\nof positive integers\n]\nso as to make multiplication ... basic\n[\ninstead of addition\n]\nand only sparingly ... admit new operations ... until it is definable.\nHis work on generalising Boolean rings culminated in his classic paper\nThe theory of Boolean-like rings\nwhich he published in the\nTransactions of the American Mathematical Society\nin\n1946\n.\nDieudonné\nexplains what Foster means by a Boolean-like ring:-\nA \"Boolean-like\" ring is a commutative ring\nH\nH\nH\nwith unit element such that\na\n+\na\n=\n0\na + a = 0\na\n+\na\n=\n0\nfor all\na\na\na\nin\nH\nH\nH\nand\na\nb\n(\na\n+\nb\n+\na\nb\n)\n=\na\nb\nab(a + b + ab) = ab\na\nb\n(\na\n+\nb\n+\na\nb\n)\n=\na\nb\nfor any two elements\na\n,\nb\na, b\na\n,\nb\nof\nH\nH\nH\n. The main properties of such rings are\na\n4\n=\na\n2\na^{4} = a^{2}\na\n4\n=\na\n2\n, for all\na\na\na\nin\nH\nH\nH\n;\nthe nilpotent elements of\nH\nH\nH\nform an ideal\nN\nN\nN\nsuch that the product of two elements of\nN\nN\nN\nis\n0\n;\nthe idempotent elements of H form a Boolean subring\nJ\nJ\nJ\nof\nH\nH\nH\nand every element of\nH\nH\nH\ncan be expressed in one and only one way as a sum of an idempotent and of a nilpotent element.\nFoster went on to define the concept of a primal algebra generalising a Boolean algebra within the theory of varieties of universal algebras. In\n1953\nshowed that the variety generated by a primal algebra has the same essential structure as the variety of Boolean algebras. He continued devoting his efforts to the structure theory of algebras that are generalizations of Boolean algebras and, more than ten years down the line in\n1966\n, he published\nFamilies of algebras with unique\n(\nsub-\n)\ndirect factorization. Equational characterization of factorization\nin\nMathematische Annalen\n. Another paper\nAutomorphisms and functional completeness in universal algebras. I. General automorphisms, structure theory and characterization\nwhich appeared in the same journal in\n1989\n:-\n... is a continuation of a long series of articles by\n[\nFoster\n]\nand his students which investigates unique factorization in certain classes of abstract algebras. As\n[\nFoster\n]\nremarks, previous articles have all considered algebras with trivial automorphism groups; this paper begins investigation of algebras with larger groups of automorphisms.\nLeon Henkin,\nJohn Kelley\nand Alden Pixley have given an excellent sketch of Foster's character and interests:-\nAlfred Foster, though somewhat formal and socially shy, will be remembered as warm-hearted, good-humoured, and unconditionally generous, by all who knew him. Several of his former students, in recalling him, have pointedly used the word \"gentleman\" in describing his character. His teaching style was rather old-fashioned, in a very good sense, and was probably influenced by his admiration for the universities of Germany, which developed during his visits there. His former students were often surprised and flattered that he remembered them years after classroom contact, and that he had a continuing interest in their lives. ... Music and politics were of particular interest to him, and in the latter field he held deep and morally grounded convictions. On the other hand, and consistent with his personality, he did not engage in highly visible political action. Along with mathematics, Foster took the current great issues of science and human culture very seriously indeed. An important key to his character was that he never took himself nearly so seriously.\nFoster underwent surgery in the spring of\n1994\n. By this time he was close to\n90\nyears old and he never fully recovered. His wishes were that he be cremated and his ashes scattered at sea as indeed they were on\n5\nJanuary\n1995\n."
}