{
  "nome_completo": "Alfred Rosenblatt",
  "nome_curto": "Alfred Rosenblatt",
  "ano_nascimento": "1880",
  "ano_morte": "1947",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rosenblatt/",
  "lugar_nascimento": "Kraków, Austro-Hungarian Empire (now Poland)",
  "lugar_morte": "Lima, Peru",
  "biografia": "Alfred Rosenblatt\nwas the son of Józef Michał Rosenblatt\n(1853\n-\n1917)\nand Klara Koppelmann\n(1858\n-?\n)\n. Józef Rosenblatt had been born on\n21\nMarch\n1853\nin Bochnia, Lesser Poland Voivodeship, Austro-Hungarian Empire. He followed the long-standing family legal tradition becoming a barrister, went on to become a highly qualified specialist in the criminal law of Austria-Hungary and professor of law at the Jagiellonian University in Kraków. He also became a member of the Kraków city council. On\n12\nAugust\n1879\n(24\nAugust by the current calendar\n)\n, he married Klara Koppelmann who had been born on\n20\nMarch\n1858\nin Odesa, Ukraine. The marriage took place in Odesa. Alfred was the eldest of his parents five children, having four sisters: Joanna Eugenia Rosenblatt\n(\nborn\n12\nNovember\n1882)\n, Paulina Rosenblatt\n(\nborn\n30\nMay\n1884)\n, Karola Rosenblatt\n(\nborn\n12\nJune\n1891)\nand Helena Rosenblatt\n(\nborn\n6\nMarch\n1899)\n. Alfred's three youngest sisters all died at a young age\n(10\n,\n15\nand\n8\nrespectively\n)\n.\nAfter his primary education in Kraków, Alfred Rosenblatt began his secondary education at the Imperial and Royal St Anne's Gymnasium in Kraków in\n1890\n. This school, one of the oldest in Poland, was founded in\n1558\nto educate boys to a level to enter the Jagiellonian University. It had become known as the Collegium Nowodworskiego after it was endowed by Bartłomiej Nowodworski, was renamed St Anne's Lyceum in\n1818\n, and then given the name Imperial and Royal St Anne's Gymnasium in\n1850\n. Alfred's father, Józef Rosenblatt, had also studied at this school. On\n7\nJune\n1898\n, Alfred obtained a merit pass in the matura examinations and later that year went to Vienna to begin studying for an engineering degree at the Technische Hochschule. This had been founded by Francis I of Austria in\n1815\nas the Imperial-Royal Polytechnic Institute, it was renamed the Technische Hochschule in\n1872\nand is now named the Vienna University of Technology. Rosenblatt's studies at the Technische Hochschule did not go very well, almost certainly because he disliked the practical side of the engineering courses. The mathematics and physics he studied were much more to his liking and in\n1902\nhe left the Technische Hochschule in Vienna without completing the work necessary for the award of the engineering degree.\nRosenblatt returned to Kraków and in\n1903\n, in fact the summer term of the\n1902\n-\n03\nacademic year, he began his studies in the Philosophy Faculty of the Jagiellonian University in Kraków. Forced to take the year\n1904\n-\n05\naway from the university because of health problems, he completed work on his Ph.D. in\n1908\nadvised by\nStanisław Zaremba\n. He submitted his thesis\nOn transcendental entire functions\n(\nwritten in Polish\n)\nwhich was examined by\nStanisław Zaremba\nand\nKazimierz Żorawski\n; they found it satisfied the conditions required for the doctorate. More was required, however, before the doctorate could be awarded. On\n27\nFebruary he was examined on mathematics and astronomy while on\n28\nMarch he was examined on philosophy. These were successful and he was awarded his doctorate but he wanted to qualify to become a secondary school teacher so required to take further study.\nIn\n1908\n-\n09\n, Rosenblatt studied at the University of Göttingen where he attended lectures by\nFelix Klein\n,\nDavid Hilbert\nand\nEdmund Landau\n. Before he left for Göttingen, Rosenblatt completed writing the paper\nÜber Reihenentwicklungen der Integrale der Differentialgleichungen erster Ordnung in der Umgebung einer wesentlich singulären Stelle\nⓉ\n(\nOn series expansions of integrals of first-order differential equations in the vicinity of an essentially singular point\n)\nin August\n1908\n. It was published in\n1909\nas was his next paper\nÜber die Existenz von Integralen gewöhnlicher Differentialgleichungen\nⓉ\n(\nOn the existence of integrals of ordinary differential equations\n)\n. In this paper he extended the main theorem of the theory of differential equations of real variables. His results provided a generalisation of the usual conditions for the existence of integrals of a system of two differential equations by modifying the\nPicard\nmethod. His papers\nÜber das Fundamentallemma der Variationsrechnung\nⓉ\n(\nOn the fundamental lemma of the calculus of variations\n)\nand\nÜber die notwendigen Bedingungen des Extremums eines einfachen Integrales in gewöhnlicher Darstellung\nⓉ\n(\nOn the necessary conditions of the extremum of a simple integral in the usual representation\n)\nwere also published in\n1909\n.\nWhile in Göttingen he wrote several papers which were published in\n1910\n.\nÜber zwei Fragen der Theorie des Extremums eines einfachen Integrals\nⓉ\n(\nOn two questions of the theory of the extremum of a simple integral\n)\nwas written in Göttingen in June\n1909\n. It has the following introduction:-\nIt is well known that there is a fundamental difference between the ordinary and the parametric representation regarding the question of the necessary and sufficient conditions for a strong extremum of a simple integral. While in the latter case\nZermelo\nproves in his dissertation that the\nLegendre\n,\nJacobi\nand\nWeierstrass\nconditions, apart from exceptional cases, are sufficient for a strong extremum if they are fulfilled along an extremal, in the case of the ordinary representation one has only Lindeberg's theorem that for curves \"with gradient restriction\" the three classical conditions are sufficient just as before.\nÜber das allgemeine thermoelastische problem\nⓉ\n(\nOn the general thermoelastic problem\n)\nwas written in Göttingen, dated\n6\nNovember\n1909\n. It begins as follows:-\nThe general equations for determining the displacement components and the temperature of elastic isotropic bodies subjected to mechanical and thermal effects were formulated by\nDuhamel\nand\nFranz Neumann\nand brought into line with the principles of thermodynamics by Voigt. Their integration includes, as special cases, the integration of the elastic and the heat conduction equations; however, while the equilibrium problem is immediately reduced to the two problems mentioned above, the oscillation problem is of a completely different difficulty. It is in fact equivalent to the investigation of the eigenvalues ​​and eigenfunctions of an integral equation with a non-symmetric kernel of complicated shape.\nRosenblatt was also writing papers in Polish at this time, and\nReguła Lagrange'a w zagadnieniu izoperymetrycznem dla całek pojedyńczych\nⓉ\n(\nThe Lagrange rule in isoperimetry for the calculus of the first order\n)\nwas also published in\n1910\n.\nBack at the Jagiellonian University in Kraków, Rosenblatt continued to work on fulfilling the conditions to become a secondary school teacher of mathematics and physics. In April\n1910\nhe submitted supervised works in mathematics and physics which were given an \"excellent\" grade in mathematics and a \"good\" grade in physics. On\n4\nJune\n1910\nhe was given two oral examinations, one in mathematics and one in physics, both being awarded an \"excellent\" grade. After this lengthy and demanding process he was qualified to teach mathematics and physics in secondary schools. Although he had not yet been awarded an habilitation, he began working as an assistant at the Jagiellonian University in\n1911\n.\nThe International Congress of Mathematicians was held in Cambridge, England,\n22\n-\n28\nAugust\n1912\n. Rosenblatt attended the Congress giving his permanent address as Basteistrasse\n19\n, Kraków. While in Cambridge, he had accommodation in Emmanuel College.\nCargill Knott\nalso had accommodation in Emmanuel College while attending this Congress. He had been one of the founders of the\nEdinburgh Mathematical Society\nand at the time of the Congress was General Secretary of the Society. He must have encouraged Rosenblatt to join the\nEdinburgh Mathematical Society\nfor he was proposed for membership at the\nEdinburgh Mathematical Society\nmeeting in Edinburgh on Friday\n14\nNovember\n1913\nand elected a member at the meeting in Glasgow on Friday\n12\nDecember\n1913\n.\nIn\n1912\nRosenblatt had published his\n100\n-page\nhabilitation\nthesis in Polish, namely\nBadania nad pewnymi klasami powierzchni algebraicznych nieregularnych i nad biracjonalnymi przekształceniami nie zmieniajacymi tych powierzchni\nⓉ\n(\nTheory of non-regular algebraic classes and biaxially constants of non-regular algebraic classes\n)\n. It had been presented to the Kraków Academy by\nKazimierz Żorawski\n. Rosenblatt begins the thesis with an historical description which has the following first paragraph:-\nThe theory of algebraic curves owes to\nH Schwarz\nand\nF Klein\nimportant theorems on the groups of birational transformations which transform these curves into themselves.\nSchwarz\nshowed that only curves of genus zero and one possess continuous groups\n(\nin the\nLie\nsense\n)\nof birational transformations.\nKlein\nstated without proof that curves of genus greater than one cannot possess infinitely many birational transformations. The theorems of\nSchwarz\nand\nKlein\nwere subsequently studied by many mathematicians. Simple and elegant proofs of these theorems were given by\nPicard\n.\nPicard\nwas the first to develop an analogous theory of birational transformations of algebraic surfaces. Algebraic surfaces, having continuous groups of birational transformations, either have rational or irrational bundles of rational curves, or of elliptic curves, having the same modulus, or the coordinates of the surface can be expressed as hyperelliptic functions of two variables, or as degenerations of these functions. In the same paper\nPicard\nponders the question when an algebraic surface admits of an infinite number of birational transformations, without however admitting of a continuous group of birational transformations. If the geometric genus of the surface is greater than two, then, since the canonical curves of the surface pass through birational transformations into canonical curves, therefore, if the canonical curves pass into other canonical curves, the transformations of the surface correspond to transformations of certain algebraic forms of several variables; from this it is possible to deduce the impossibility of the existence of infinitely many birational transformations, which do not belong to the continuous group of transformations.\nAlso in the same year of\n1912\nhe published a shortened form of the thesis in French as\nSur certaines classes de surfaces algébriques irrégulières et sur les transformations birationnelles de ces surfaces en elles-memes\nⓉ\n(\nOn certain classes de surfaces algébriques irrégulières et sur les transformations birationnelles de ces surfaces en elles-memes\n)\n. The French version was still\n50\npages long. In addition to presenting the Polish version of his thesis for his habilitation, Rosenblatt had to give an habilitation lecture. He gave the lecture\nO całkach periodycznych problemu trzech ciał\nⓉ\n(\nOn the periodic integrals of the three-body problem\n)\non\n3\nMarch\n1913\n.\nWorld War I broke out in\n1914\nand Rosenblatt was drafted for active service. The Jagiellonian University, however, made a request that he be released from military service since his work was vital for the university. This was accepted and he was released from military service. Life was difficult in Kraków during the years of the war,\n1914\n-\n18\n, but the mathematicians would meet on a regular basis beginning around\n1916\nand by\n1917\nthey considered themselves as an informal mathematical society. Rosenblatt was part of the informal society which, after Poland became an independent country at the end of the war, sixteen mathematicians met on\n2\nApril\n1919\nto formally establish the Kraków Mathematical Society. Rosenblatt was one of these sixteen and he was invited to lecture to the second meeting of the Society on\n30\nApril\n1919\n. He gave the lecture\nZ rachunku warjacyjnego\nⓉ\n(\nFrom the calculus of variations\n)\n. Soon after this mathematicians from Warsaw joined and it became the\nPolish Mathematical Society\n.\nOn\n9\nSeptember\n1920\nRosenblatt was appointed as an extraordinary professor of mathematics at the Jagiellonian University. This allowed him to use the title of \"professor\" but it did not provide a salary so his income remained as it had been when he was a docent. Rosenblatt applied for a number of full professorships but, even when ranked first, was not appointed.\nRosenblatt married Paula Perl Unger\n(1885\n-\n1959)\non\n29\nJune\n1924\nin Wieliczka; they had no children. Paula was the sister of Gerard Unger\n(1903\n-\n1957)\n, an engineer and expert on thermodynamics.\nIn\n1928\nRosenblatt attended the International Congress of Mathematicians in Bologna. He was President of Section III-B, Mathematical Physics, on\n4\nSeptember and again on\n8\nSeptember. He gave two talks\nVarietà algebriche a tre e più dimension\nⓉ\n(\nAlgebraic varieties of three and more dimensions\n)\nand\nSopra le varietà algebriche a tre dimensioni fra i cui caratteri intercedono certe disuguaglianze\nⓉ\n(\nOn the algebraic varieties of three dimensions among which the characteristics intersect, certainly dissimilar\n)\nin Section II-A, Geometry. In Section III-B he gave the talk\nSopra certi moti permanenti dei liquidi viscosi incompressibili\nⓉ\n(\nOn certain permanent patterns of incompressible viscous liquids\n)\n.\nUnhappy with his failure to obtain a full professorship in Poland, in\n1930\nhe was appointed to a full professorship at the University of La Plata, Argentina. He wrote in a letter of\n23\nMay\n(\nsee\n[\n9\n]\n)\n:-\nI received a letter from professor\nJ Rey Pastor\nfrom Buenos Aires in which he reports on my appointment in La Plata\n(\nArgentina, near Buenos Aires\n)\n. We will soon receive an official notification of the terms, etc. I am getting the chair of mathematics there with the help of\nEnriques\n,\nSeveri\n,\nLevi-Civita\n, and\nEinstein\n, to whom, in the last instance, the dean from La Plata turned for an opinion about me. ... I enjoy the recognition that I have abroad, an evidence of which, moreover, I just had in Liege and Paris.\nEinstein\nalso told me: \"I am surprised that Poland allows so many to go, they have so few people.\"\nHe was to begin teaching in La Plata in the academic year\n1930\n-\n31\n, arranged leave from the Jagiellonian University, and made travel arrangement for himself and his wife including passports. On\n6\nSeptember\n1930\n, a few days before Rosenblatt was due to travel, there was a military coup in Argentina. Travel to Argentina became impossible and Rosenblatt lost the opportunity of the full professorship.\nIn\n1932\nthe International Congress of Mathematicians was held in Zurich. Rosenblatt attended and gave the talk\nSur les ondes de gravité\nⓉ\n(\nOn gravity waves\n)\nin Section VIb, Mechanics and Mathematical Physics. At this Congress he met Godofredo García whom he already knew from their meeting at earlier conference in Poland. García\n(1888\n-\n1970)\nwas a Peruvian mathematician and engineer who had studied at the University of San Marcos in Peru, had been on the staff there from\n1919\n, and was Dean of the Faculty of Exact Sciences from\n1928\n. They kept in contact after the Congress ended.\nRosenblatt was, as we indicated above, unhappy that he had not been able to obtain a full professorship. He felt, with justification, that he had a strong reputation outside Poland. In addition to the International Congresses, he had been invited to lecture in Rome in\n1926\n, Stockholm in\n1930\n, Liege in\n1930\n, and Paris in\n1931\n. He had been invited to the Institut de Mécanique des Fluides de l'Université de Paris where he gave three lectures on hydrodynamics. He was invited there again by the director Henri Villat in\n1933\nand it was at Villat's suggestion that Rosenblatt published the two monographs\nSur certains mouvements des liquides visqueux incompressibles\nⓉ\n(\nOn certain motions of incompressible viscous liquids\n)\n(1933)\nand\nSolutions exactes des équations du mouvement des liquides visqueux\nⓉ\n(\nExact solutions of the equations of motion of viscous liquids\n)\n(1935)\n. His international reputation is emphasised in\n[\n21\n]\n:-\nHe gave a series of lectures in Sofia and Belgrade. His work in the field of particle equations brought him recognition - and he was awarded the academic palm of an officer d'Instruction Publique by the French government. He became a member of the Academic Society in Liège and the\nAcademy of Athens\n. He was a member of the\nPolish Mathematical Society\nin Kraków, the\nCircolo Matematico di Palermo\n, the\nSociété Mathématique de France\nin Paris, the\nAmerican Mathematical Society\nin New York, the\nDeutsche Mathematiker Vereinigung\nand others.\nThe authors of\n[\n9\n]\nwrite:-\nIt is a pity that a research centre in the field of hydrodynamics was not created in Kraków, since Rosenblatt's work and his recognition abroad offered a good reason for a chair, which could be opened at the Jagiellonian University.\nThe Jewish community in Poland suffered from anti-Semitism during the\n1920\ns and\n1930\ns. Rosenblatt's family were Jewish and he himself had been married in Wieliczka by a rabbi from Kraków. He felt he was being discriminated against. In December\n1925\nhe wrote to\nLevi-Civita\n[\n14\n]\n:-\nI am oppressed by the political situation in which the Jews of my country find themselves. You certainly know the Steiger trial in Lvov, a new page in this martyrdom. It is good that I have somewhere to escape in the domain of this clear and profound thought, in the domain of the ideas of the scholars of this radiant country that is Italy.\nTwo years later he wrote again to\nLevi-Civita\n[\n14\n]\n:-\nWe do not massacre the Jews in Poland, as in Romania and now in Lithuania, but we deprive them of the means to live, and we force them either to convert or to leave the country. This occurs in the first place in the universities, which are here, as in all of Eastern Europe, the centres of anti-Semitism.\nIn the mid\n1930\ns, he wrote to his friend García in Peru, explaining the risks he felt for himself and his fellow Jewish Poles. He had come to the point, he wrote, where he feared for the safety of himself and his family. García replied offering Rosenblatt a one year,\n1936\n-\n37\n, lecturing position at the University of San Marcos in Lima. Rosenblatt accepted and, following the death in March\n1936\nof José Roberto Gálvez, who had been the Chair of Astronomy and Geodesy, Rosenblatt was also offered that Chair for the two years\n1936\n-\n38\n. He arranged for unpaid leave of absence from the Jagiellonian University and, together with his wife, he arrived in Lima on\n19\nAugust\n1936\n.\nOn\n17\nSeptember\n1936\nhe wrote to\nOswald Veblen\n(\nsee\n[\n9\n]\n)\n:-\nI am here in Lima invited by the University for two years to lecture on mathematical astronomy. I am lecturing about Celestial Mechanics. It would be for this reason very agreeable to me, if I could study your last important paper on the tensorial calculus. You have been so kind to send to me in Kraków your published previously important papers.\nIt is certainly surprising that, although Rosenblatt had a PhD from the Jagiellonian University, this was not recognised by the University of San Marcos. He submitted his paper\nSobre la representación conforme de dominios planos limitados variables\nⓉ\n(\nOn the conformal representation of variable limited plane domains\n)\nas a doctoral thesis and he was awarded a doctorate by the University of San Marcos in a ceremony on\n21\nDecember\n1936\n. Together with Godofredo García, Rosenblatt was the founder of the Academia Nacional de Ciencias Exactas, Físicas y Naturales de Lima which was formally set up on\n6\nAugust\n1938\n. In\n1939\nit was recognised by the Government of Peru by a Supreme Decree and in\n1966\n, with another Supreme Decree, its name was changed to \"Academia Nacional de Ciencias\". The Academy published its journal\nActas de la Academia Nacional de Ciencias Exactas, Físicas y Naturales de Lima\nbeginning in\n1938\nwith volume\n1\nwhich contained Rosenblatt's paper\nNouvelles recherches sur les coefficients des séries univalentes\nⓉ\n(\nNew research on the coefficients of univalent series\n)\n. In volume\n2\n, dated\n1939\n, there are two papers by Rosenblatt:\nSur la théorie mathématique de la lubrification\nⓉ\n(\nOn the mathematical theory of lubrication\n)\n; and\nSur les points singuliers des équations différentielles\nⓉ\n(\nOn the singular points of differential equations\n)\n. Volume\n3\ncontains\n7\npapers by Rosenblatt, volume\n4\ncontains\n4\nof his papers, volume\n5\ncontains\n2\n, volume\n6\ncontains\n6\n, etc. Thanks to Rosenblatt,\nLevi-Civita\n,\nFubini\n,\nTerracini\n, and\nBeppo Levi\njoined the Academy of Sciences of Lima and published in its \"Actas.\"\nHe wrote to the vice-chancellor of the Jagiellonian University on\n12\nAugust\n1938\n(\nsee\n[\n21\n]\n)\n:-\nI am far away abroad but I was called there as a member of the Jagiellonian University, while the University of San Marcos in Lima constantly emphasises how proud it is of the contact made with Kraków University, and my modest academic achievements in Peru are not to be accredited to my efforts but are the achievements of the Jagiellonian University to which I belong.\nAlthough he had gone to Peru on a two year contract, he arranged with the Jagiellonian University to extend that for one further year. They agreed, so Rosenblatt, although in Peru, was still employed by the Jagiellonian University when the German armies invaded Poland on\n1\nSeptember\n1939\n. He then took Peruvian nationality and decided to spend the rest of his career at the University of San Marcos.\nOrtiz writes in\n[\n18\n]\nabout Rosenblatt coming to Peru:-\nThe arrival of Rosenblatt was crucial for the development of mathematics in Peru. From that moment on a new stage in the history of mathematics in our country began. He introduced new teaching methods of modern mathematics and as a professor at the University of San Marcos\n(\nthe only university in the country then having Pure Mathematics as a subject of study\n)\nnew courses, where complex variables, complex analysis, topology, differential equations, algebra, modern differential geometry and many other subjects were taught. He also conducted seminars and shaped a new generation of mathematicians, which, although sparse, was enough to open new horizons for further conquests and goals.\nHe was awarded a research fellowship from the Institute for Advanced Study at Princeton to spend from January to June\n1947\nas a Member of the School of Mathematics of the Institute for Advanced Study at Princeton. During this time, he lectured at Princeton University, Harvard University, the University of Chicago, the University of Philadelphia, and the University of Illinois. His health deteriorated, however, and he had to turn down invitations to lecture at Columbia University in New York, Brown University in Providence, and the University of Toronto. He returned earlier than he had intended to Lima on\n15\nApril\n1947\nand was admitted to the Delgado de Miraflores Hospital where he died on\n8\nJuly\n1947\n. He was buried in the Jewish Cemetery of Lima. His wife Paula Rosenblatt wrote to\nOswald Veblen\non\n20\nJuly\n1947\n:-\nI feel the sad duty to inform you about the death of my husband Alfred Rosenblatt, which occurred on\n8\nJuly. Since his return from the United States he could not recover from pneumonia and in spite of the efforts of the best physicians he suffered a relapse, which caused his death. I wish to express my deep gratitude to you for your thoughtfulness and assistance when he was ill in the USA.\nFor more information about Alfred Rosenblatt, see\nTHIS LINK\n."
}