{
  "nome_completo": "Andrew Gray",
  "nome_curto": "Andrew Gray",
  "ano_nascimento": "1847",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gray_Andrew/",
  "lugar_nascimento": "Lochgelly, Fife, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Andrew Gray\n's parents were Margaret Wilson and John Gray, who was a farmer at Lochgelly. Gray attended the Subscription School in Lochgelly where the practical nature of mathematics was stressed in a rather unusual way. His schoolmaster\n[\n2\n]\n:-\n... showed them how to measure the distance of conspicuous objects out of doors by means of a measured baseline. In this way Gray, when a boy, measured the distance of Nelson's monument on the Calton Hill, the lighthouse on the island of Inchkeith, the Martello tower at Leith Harbour, North Berwick Law, and other objects that can be seen from Burntisland. The practical nature of the teaching intensely interested the boys. In later life Gray always tried to make sure the problems he set the students as practical and as humanly interesting as possible.\nGray then received private tuition in Edinburgh before entering the University of Glasgow in\n1872\n. Notice that he was\n25\nyears of age before beginning his university studies. He graduated M.A. in\n1876\n, with First Class Honours in Mathematics and Natural Philosophy. His undergraduate years had been highly successful ones and he won prizes in natural philosophy in session\n1874\n-\n5\n, and in mathematics in session\n1875\n-\n6\n. However he had a hard time as a student for he was required to help with the farm back in Lochgelly and had to leave his studies at certain points to do so\n[\n2\n]\n:-\nGray ever put duty before personal ambition, and did not seem to mind.\nIn\n1874\n, while he was still an undergraduate, Gray was appointed private assistant and secretary to\nSir William Thomson\n(\nlater Lord Kelvin\n)\n, who was Professor of Natural Philosophy at Glasgow. In\n1880\nhe became\nKelvin\n's official assistant\n[\n2\n]\n:-\nGray took a leading part in the testing of dynamos ... and in the testing of accumulators and of electric lamps.\nGray assisted by marking the examination papers for\nKelvin\n's Senior Honours Natural Philosophy class. When the scripts were returned to the students they discovered\n[\n2\n]\n:-\n... that not only had he written out the solutions of those questions which had been answered incorrectly, but he had also written out complete solutions of all those which he had not attempted.\nIn\n1884\nGray became the foundation professor of physics in the University College of North Wales, Bangor\n[\n2\n]\n:-\nWhile in Wales, he championed the cause of the higher education of women, and took a leading part in the foundation of the County School for Girls in Bangor. At this time he was also an enthusiastic mountaineer, and made weekly excursions with some of his colleagues into the Welsh hills. He was a strong swimmer, and rarely missed his morning bathe in the Menai Straits.\nGray succeeded\nKelvin\nas Professor of Natural Philosophy at Glasgow in\n1899\n, winning the chair against strong competition.  He held this chair for twenty-four years, stepping down in\n1923\n, shortly before his death. Whitehead writes\n[\n1\n]\n:-\nGray's principal achievements were as an indefatigable teacher, including extension teaching, and university administrator. Where\nKelvin\nmight easily have fallen foul of modern teaching quality assessments, Gray's attention to detail, his advice and guidance to students, kindness, and pastoral care would have seen him through with flying colours. As a result the number of students taking the various natural philosophy classes in the university increased enormously, though few of them were inspired to greatness as many were by\nKelvin\n's exciting but, for the ordinary student, execrable lectures. Gray reorganized the obsolete department he inherited at Glasgow, and founded the Natural Philosophy Institute in\n1906\n, the largest building devoted to physics in Britain; by\n1923\nmore than\n600\nstudents a year took laboratory courses there.\nGray married Annie Gordon; they had four sons and four daughters. One of their sons,\nJames Gray\n, has a biography in this archive.\nOn\n5\nMarch\n1883\n, Gray was elected a fellow of the\nRoyal Society of Edinburgh\n. He was proposed by\nWilliam Thomson\n(\nLord Kelvin\n)\n, James Thomson Bottomley, James Thomson, and James Gray McKendrick. He served the Society as a Councillor during\n1903\n-\n6\n, then as Vice-President\n1906\n-\n9\n. Gray was also elected to the\nRoyal Society of London\n, becoming a fellow in\n1896\n.\nGray wrote a number of excellent books and published many papers in the\nProceedings\nof the\nRoyal Society of Edinburgh\nand of the\nRoyal Society of London\n. Among his books are\nAbsolute Measurements in Electricity and Magnetism\n(1883)\n,\nTheory and Practice of Absolute Measurements in Electricity and Magnetism\n(\nVol.\n1\n,\n1888\n, Vol.\n2\n,\n1893)\n,\nMagnetism and Electricity\n(1898)\n, which\n[\n3\n]\n:-\n... did much to make experimental electricity an exact science ...\nand\nDynamics and Properties of Matter\n(1901)\n. Gray published two important books written in collaboration with others, the first being\nTreatise on Bessel functions\n(1895)\nwritten with\nG B Mathews\n, then in\n1911\nhe published\nDynamics\nwritten jointly with his son\nJames Gray\n. The first of these was revised by\nGray\nin\n1922\nin collaboration with\nMacRobert\n. Gray's final major work was\nTreatise on Gyrostatics and Rotational Motion\n(1919)\n. He published\nThe Scientific Work of Lord Kelvin\nin\n1908\n, the year following\nKelvin\n's death, which was expanded from an oration he delivered in\n1907\non the death of\nKelvin\n.\nTowards the end of his life, Gray spent his holidays in the Perthshire mountains enjoying this as much as he had the Welsh hills during his period in Bangor. Also during this latter period of his life he joined the\nEdinburgh Mathematical Society\nin June\n1922\n.\nWhitehead writes\n[\n1\n]\n:-\nHis organizational exertions on numerous committees during the First World War, the death of a son in\n1915\n, and the demands of vastly increased student numbers after the war undermined Gray's already uncertain health and he resigned his chair in\n1923\n. He died on\n10\nOctober\n1925\nat\n15\nVictoria Circus, Glasgow. He was survived by his wife\n[\nthree sons and four daughters\n]\n. It was a source of satisfaction to him that James Gordon Gray, his second son, had renounced the engineering profession for physics and been appointed professor of applied physics at Glasgow."
}