{
  "nome_completo": "Andrzej Bernard Turowicz",
  "nome_curto": "Andrzej Turowicz",
  "ano_nascimento": "1904",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Turowicz/",
  "lugar_nascimento": "Przeworsk, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Tyniec, Kraków, Poland",
  "biografia": "Andrzej Turowicz\ntook the name Bernard when he entered the Benedictine Order in\n1945\nand is often known as\nAndrzej Bernard Turowicz\n. He was the son of August Turowicz\n(1875\n-\n1960)\nand Klotylda Turnau\n(1881\n-\n1979)\n. August Turowicz was a judge, a legal advisor of \"Ilustrowany Kurier Codzienny\", and an activist of Catholic Action. He married Klotylda in\n1903\nand they had eight children: Andrzej Turowicz\n(1904\n-\n1989)\n, the subject of this biography; Juliusz Turowicz\n(1906\n-\n1995)\n; Anna Turowicz\n(1909\n-\n2004)\n; August Turowicz\n(1910\n-?\n)\n; Jerzy Turowicz\n(1912\n-\n1999)\n; Olawia Turowicz\n(1916\n-\n2001)\n; and Krystyna Turowicz\n(1920\n-\n2007)\n. Let us note that Juliusz Turowicz became a Roman Catholic priest, a doctor of theology, and a professor at the Pontifical Academy of Theology in Kraków. Jerzy Turowicz became a leading Roman Catholic journalist and editor of the Catholic weekly magazine\nTygodnik Powszechny\nfrom\n1945\n.\nAndrzej Turowicz began his education by being home schooled. He then became a pupil at the King Jan III Sobieski\n2\nnd Gymnasium in Kraków. The school had been founded in\n1883\nas a tribute to King Jan III Sobieski on\n200\nth anniversary of his victory over the Ottomans at the Battle of Vienna. At this school Turowicz excelled in all his subjects but for him mathematics was special and, after taking his 'matura' examination in\n1922\n, later that year he began his studies of mathematics in the Philosophy Faculty of the Jagiellonian University in Kraków. At the University he attended lectures given by\nIvan Śleszyński\n,\nWitold Wilkosz\n,\nStanisław Zaremba\n,\nAntoni Hoborski\n, and\nAlfred Rosenblatt\n.\nRosenblatt\nhad been born in Kraków and was awarded a Ph.D. by the Jagiellonian University in\n1908\n. He became an expert in algebraic geometry and, after further study at Göttingen, was appointed as a\ndocent\nat the Jagiellonian University; he was promoted to become a lecturer in\n1920\n.\nIn\n1928\nTurowicz was awarded a Master's Degree. He said\n[\n15\n]\n:-\nI was the first in Kraków to get the master's diploma. When I enrolled at the university, one could pursue the old course, pre-master. I decided to do the master's degree. The second master in mathematics in Kraków was Stanisław Turski. He was two years younger than I.\nZofia Czarkowska\n(\ncurrently Mrs Krygowska\n)\nwas at the university along with me. I had a gifted classmate, Stefan Rosental, who however later became a physicist and finished his career as a vice-director of the\nBohr\nInstitute in Copenhagen.\nAfter the award of the Master's Degree, Turowicz remained in Kraków where he studied for his qualification to teach in secondary schools. In addition to his studies, he served as an assistant to the Chair of Mathematics at the Academy of Mining in Kraków in\n1929\n-\n30\n. This position had been held by\nStanisław Gołąb\nbut became free when\nGołąb\nreceived a scholarship to study under\nJan A Schouten\nat Delft in Holland. Turowicz was awarded the teaching qualification in\n1931\nand taught at schools in Kraków and Mielec which is about\n130\nkm east of Kraków. In\n1937\nhe was appointed as an assistant to Antoni Łomnicki at Lwów Polytechnic. He explained how this appointment came about\n[\n15\n]\n:-\nAfter the Jędrzejewicz Brothers reform\n[\nintroduced in\n1932]\n, Antoni Łomnicki submitted a geometry textbook for high schools. The Ministry gave me this text for refereeing, as I taught in high schools in Kraków. I did a very detailed report; I went over all the problems, I wrote which ones were too difficult. The author was anonymous, but I guessed it was Łomnicki. I remembered his geometry and trigonometry textbooks from Austrian times. However, the referees' names were made known to the author. When he read my report, Łomnicki sent me an offer to become an adjunct. He wanted to bring me where he was because of this report.\nDuring his time in Lwów, Turowicz was influenced by\nStefan Banach\n,\nHugo Steinhaus\n, Antoni Łomnicki and\nStanisław Mazur\n.\nBanach\nspoke about Łomnicki\n(\nsee\n[\n7\n]\n)\n:-\nA native of Lwów, Łomnicki worked for over twenty years as a mathematics professor at the Lwów University of Technology. He prepared hundreds of engineers for their profession. I was his assistant. He was the first to instil in me the importance and responsibility of a professor's task. He was an unrivalled educator, one of the best I ever knew.\nTurowicz, like\nBanach\n, learnt much from Łomnicki. He also joined\nMazur\nin a research project\n[\n3\n]\n:-\nI even worked with\nMazur\n. We wrote one paper together, which was never published. It was in spring\n1939\n. When we finished it I asked\nMazur\nto give me the manuscript and suggested that I would translate it into French for publication. He answered that perhaps we would have some better ideas and kept the paper.\nWiesław Zelazko writes in\n[\n17\n]\n:-\nMazur\ninvited Turowicz for ... a collaboration in\nBanach\nalgebras. The collaboration started in the fall of\n1938\nand by April\n1939\nthey obtained several\n(\nover\n20)\nresults, one of them now known as the\nStone\n-\nWeierstrass\ntheorem. A suitable paper was written by Turowicz and handed to\nMazur\nfor publication, but it was never published. The author has heard a rumour that\nMazur\nand Turowicz had the\nStone\n-\nWeierstrass\ntheorem before\nStone\n, and asked Turowicz about it. In response he obtained a long letter, asking not to publish it before Turowicz's death.\nAfter Turowicz's death his long letter was published in Polish as\n[\n13\n]\n. Here are some excerpts:-\nThe discussion was useless in view of\nMazur\n's habit of not publishing the results immediately. ... In\n1940\nI learned that the next volume of Studia Mathematica will appear, the only one published during the war. I asked\nMazur\nwhether we could include our paper there, but he answered that the volume was already closed and there was no more space. In\n1941\n, after taking up Lwów by Germans, I left for Kraków and lost contact with\nMazur\n.\nAlso in Lwów at this time was\nWładysław Orlicz\nand\nJuliusz Schauder\n. Turowicz began working with\nOrlicz\non a problem that they hoped to solve but the start of World War II in\n1939\nput an end to their collaboration. Turowicz spoke about\nJuliusz Schauder\nin\n[\n3\n]\n:-\nSchauder\nwas there, too. We talked together; he was a brilliant mathematician, but I think it was very difficult to work with him.\nWhen World War II began with the German invasion of Poland on\n1\nSeptember\n1939\n, Polish troops prepared to defend Lwów. After heavy fighting between the Germans and the Poles, Soviet troops also began to attack the city. Hitler ordered the German troops to withdraw and let the Soviets occupy Lwów. On\n22\nSeptember the Poles surrendered to the Soviets and the Soviet occupation began. The Soviet occupiers reorganised the polytechnics and made Ukrainian the language of instruction. Turowicz remained in Lwów and taught mathematics, first at the Faculty of Architecture and then at the Faculty of Mechanics. In\n1941\nhe left Lwów when it was occupied by German troops and returned to Kraków.\nKraków had been occupied by the Germans in\n1939\n. They had closed all high schools and higher education establishments. Back in Kraków, Turowicz worked as a clerk in the Chamber of Industry and Commerce until the Red Army occupied the city in January\n1945\n. In addition to this official work, he took part in the underground university which secretly educated Poles. He taught analytic geometry to these students, often in private houses. This was an extremely risky thing to do and it is remarkable that Turowicz and so many other academics were prepared to risk their lives in clandestine teaching. The\nPolish Mathematical Society\nwas unable to operate during the war, but members of the Society would continue to meet in secret. Turowicz took part in the secret meetings of the Society in Kraków.\nThe Red Army occupied Kraków on\n18\nJanuary\n1945\nand, on the following day, Turowicz went to the Benedictine Abbey in Tyniec on the outskirts of Kraków. He explained in\n[\n3\n]\nwhy he decided to take holy orders:-\nI was always a believing Christian and a practising Catholic, but before the war I never thought about taking the holy orders and becoming a priest. My decision was made because during the war I witnessed hellish wickedness and dreadful crimes. My reaction was the decision to become a friar and a priest. During the war nothing bad happened to me, so it was not a reaction to anything that had hurt me personally. I definitively made up my mind in autumn\n1941\n. In\n1942\nI turned up at the monastery, but because of some technical problems I could not be accepted before the Germans left Kraków in January\n1945\n. Then I was sure that my connections with mathematics had ended.\nOn\n29\nJanuary\n1945\nTurowicz entered the Benedictine order and took the name Bernard. He studied theology in\n1946\n-\n50\nand was ordained as a priest in\n1949\n. While he was studying to become a priest, however, he was teaching mathematics at the University in Kraków. He explained how this came about despite the fact that he had thought in\n1945\nhe would never be involved with mathematics again\n[\n3\n]\n:-\n... in spring\n1946\n,\nTadeusz Ważewski\ncame to the monastery and said that he desperately needed a lecturer at the Jagiellonian University and he wanted me. I answered that I did not have anything to say, the person who decided about everything here was our Father Superior. So he spoke to the prior and the prior told me: \"If they need you, you have no right to refuse.\" Thus I started lecturing at the university again. The Benedictines are obliged to work, but nothing is said about what kind of work it must be. I became a mathematician from the beginning, I was publishing, so I was not engaged in priesthood. I was saying mass here, reciting my breviary, and I had other duties, but I had no parish. This is what it was like: I was a friar, a priest, and a mathematician simultaneously ...\nWażewski\ninsisted that Turowicz submit a thesis for a Ph.D. Already in the spring of\n1939\nTurowicz had answered a question that had been posed by\nBanach\nand lectured on it at a meeting of the\nPolish Mathematical Society\n. To see how\nBanach\nreacted to this talk, see\nTHIS LINK\n.\nAfter he returned to mathematics in\n1946\n, Turowicz finished the work and presented\nOn continuous and multiplicative functionals\nas his Ph.D. thesis.\nWażewski\n, who was his official advisor, wrote in his report:-\nTurowicz's thesis shows evidence of deep mathematical culture and revealed the rare philosophical sense of its author in treating a problem.\nHe published his thesis as the paper\nSur les fonctionnelles continues et multiplicatives\nⓉ\n(\nOn continuous and multiplicative functions\n)\n(1948)\n.\nCzesław Olech\n, when a first year student, attended Turowicz's lectures on algebra in\n1949\n. He wrote\n[\n9\n]\n:-\nHe commuted for our lectures from the monastery in Tyniec near Kraków, where he resided. He almost dashed into the lecture room, made the sign of the cross and filled the blackboard with legible text. If someone could take exact notes of it - and there were women in the class who could - then we had a 'textbook' for the exam.\nTurowicz's joint paper with\nMazur\nwhich had never been published surfaced in the early\n1950\ns\n[\n13\n]\n:-\nAt the beginning of the fifties\nMazur\ntold\nWażewski\nthat he had found our manuscript, and\nWażewski\nrepeated the news to me. Then I wrote to\nMazur\n, suggesting that some of our results could still be published, and asked him to send me the manuscript, so that I could see which results are not yet published and prepare a suitable publication. Of course, I knew that the priority with respect to the generalisation of the\nWeierstrass\ntheorem belongs now to\nStone\n.\nMazur\nnever answered my letter; I was not surprised knowing that he had a habit of not answering letters. I regret not having published the \"\nWeierstrass\n-\nStone\n\" theorem, but what can be done about it, it's lost. I know that after the war,\nOrlicz\n, when collaborating with\nMazur\n, made notes and published a joint paper without asking\nMazur\nfor permission. Unfortunately I did not know that I should have done the same.\nFollowing the war, Poland became a communist country, was known as the Polish People's Republic, and was run by a government established by the Soviet Union. The director of the Department of Technical and Economic Studies of the Ministry of Education was Stanisław Antoni Turski\n(1906\n-\n1986)\n, a mathematician who had studied at Kraków with Turowicz. He signed the papers which let Turowicz teach at the University despite the difficult position priests found themselves in a communist country. This eventually proved impossible, however, and so he taught mathematics at the Catholic University of Lublin from\n1952\nto\n1956\n. Conditions became easier in\n1956\nwhen Nikita Khrushchev denounced Stalin and set up a less repressive Soviet era. Turowicz's application to become a professor took a long time to be considered and eventually was denied in\n1957\n. In\n1961\nTurowicz obtained a research position at the Mathematical Institute of the\nPolish Academy of Sciences\n. This posed much less of a problem for the communist authorities, whose aim was to limit the influence of the Catholic church, since he did not teach undergraduates.\nEventually, in\n1963\nTurowicz obtained his\nhabilitation\nafter being examined in Warsaw. Before the examination he asked\nWażewski\nwhat to expect from such an examination. He replied\n[\n3\n]\n:-\nIn the worst case you will become a martyr, and there's nothing you could desire more, is there?\nIn\n1969\nhe became an extraordinary professor and he taught in the doctoral programme in the Academy of Mining and Metallurgy. He also taught candidates for holy orders at Tyniec Abbey, giving lectures there on the history of monasticism. He retired from academic teaching in\n1974\nbut was president of the Kraków branch of the\nPolish Mathematical Society\nin\n1973\n-\n75\n. Having been a member of the Society from\n1926\n, he was made an honorary member in\n1975\n. Although retired from teaching, Turowicz continued his connection with mathematics by working with the Committee for History of Mathematics, set up by the\nPolish Mathematical Society\n.\nIn the interview\n[\n3\n]\nTurowicz was asked:-\n... the list of the subjects you have worked on is impressive. You are the author of papers on differential equations, numerical analysis, game theory, logic, control theory, functional analysis, probability ... Few mathematicians could boast such a scope of interests ...\nHe replied:-\nBut is it something to boast of? This was possible in the\n18\nth century, now it is rather unreasonable. In my opinion, my best paper - maybe the only valuable one - was the one about continuous, multiplicative functionals.\n[\nHis Ph.D. thesis published as\n[\n14\n]\n]\nI think it was the first paper in this subject; later on the Americans generalised my results. But I moved from Lvov and in Kraków nobody was working on it. I made friends with Professor Górecki from the Academy of Mining and Metallurgy in Kraków and we published many papers about control theory together. I wrote one paper about probability, however, I didn't work on this theory.\nWażewski\nasked me about the proof of the theorem about the normal Gaussian distribution. I answered that\nStirling\n's formula is used. He said \"This is so important a theorem, that there must exist a simpler proof, without such tricks.\" He kept nagging me to prove it for so long that I started thinking it over and once, during a tram ride, I got an idea.\nLet us end by quoting from the authors of\n[\n3\n]\nabout interviewing Turowicz in Tyniec Abbey when he was\n83\nyears old:-\nThe\n83\n-year-old priest leaves the monastery two or three times a year on special occasions. Any meeting he attends attracts many mathematicians who want to hear his stories. It is said that Professor Turowicz knew all the famous Polish mathematicians from the pre-war period. His excellent stories about mathematics and mathematicians of this time, coloured by interesting anecdotes, are listened to with bated breath."
}