{
  "nome_completo": "Andrzej Sołtysiak",
  "nome_curto": "Andrzej Sołtysiak",
  "ano_nascimento": "1950",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Soltysiak/",
  "lugar_nascimento": "Giżycko, Poland",
  "lugar_morte": null,
  "biografia": "Andrzej Sołtysiak\n's father was a military officer, and consequently, his family moved frequently. Andrzej completed his elementary education in Wrocław, where he also enrolled in high school, but he took his final exams in Koszalin in\n1968\n.\nHe graduated with a degree in mathematics in\n1973\nfrom the Adam Mickiewicz University in Poznań, where he began working the same year. In\n1974\n, he began his PhD studies. His scientific supervisor was originally Professor Andrzej Alexiewicz\n(1917\n–\n1995)\n, a former PhD student of professor\nOrlicz\nin Lwów.\nBy his own decision, Sołtysiak commuted regularly to Warsaw to the Institute of Mathematics of the\nPolish Academy of Sciences\nto attend seminars by Professor Wiesław Żelazko, who later became his scientific supervisor. In\n1977\n, he successfully defended his doctoral dissertation on functional analysis. His thesis was entitled\nOn Algebraic and Quasi-Algebraic Elements, and Capacity of Joint Spectra in Banach Algebras\n.\nIn\n1989\n, he received his postdoctoral degree for his thesis\nOn Algebraic and Quasi-Algebraic Elements, and Capacity of Joint Spectra in Banach Algebras\n. Sołtysiak became an associate professor at the Faculty of Mathematics and Computer Science of AMU in Poznań in\n1996\n. He has been a member of the\nPolish Mathematical Society\nsince\n1981\n.\nHe now works in the Department of Mathematical Analysis\n(\nhe was the head of this Department from\n2014\n–\n2019)\n. Sołtysiak was the supervisor of\n45\nmaster's theses and two doctoral theses\n(\nof Michał Jasiczak,\n2004\n, and Maciej Łuczak,\n2006)\n. Additionally, he led the University of Adam Mickiewicz in Koszalin's Postgraduate Mathematics for Teachers Program. He specialises in functional analysis\n(\nBanach algebra, algebraic topology, spectral theory, especially of linear operators on Banach spaces\n)\n. He has written or co-written\n36\npapers. Furthermore, he has published in well-known journals such as 'Studia Mathematica,' 'Colloquium Mathematicum,' 'Proceedings of the AMS,' 'Mathematical Analysis and its Applications,' and others.\nHe is the author of outstanding textbooks:\nMathematical Analysis\n,\nLinear Algebra\n, and\nIntroduction to Spectral Theory\n. As a co-organiser of two major international conferences, he became the co-editor of two volumes in the Banach Centre Publications series.\nYou can see a list of his papers at\nTHIS LINK\n.\nIn\n2015\nhe received the Medal of the National Education Commission for his scientific and educational work. His interest in functional analysis as a field of study emerged from Professor Wiesław Żelazko's seminar at the Institute of Mathematics of the\nPolish Academy of Sciences\n.\nYou can see a transcript of an interview with Andrzej Sołtysiak at\nTHIS LINK\n."
}