{
  "nome_completo": "Andrew Jeffrey Gunion Barclay",
  "nome_curto": "Andrew Jeffrey Gunion Barclay",
  "ano_nascimento": "1849",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barclay/",
  "lugar_nascimento": "Hawick, Roxburghshire, Scotland",
  "lugar_morte": "London, England",
  "biografia": "Andrew Jeffrey Gunion Barclay\n's father was George Barclay\n(\nborn in Dumfrieshire about\n1808)\nwho was a toll-keeper, farmer and baker. His mother was Jane Barclay\n(\nborn in Dumfrieshire about\n1809)\n. He had five older siblings: Janet\n(\nborn about\n1834)\n, Francis\n(\nborn about\n1837)\n, John\n(\nborn about\n1839)\n, David\n(\nborn about\n1841)\nand Margaret\n(\nborn about\n1844)\n. He  married Janet Barclay from Shotts, Lanarkshire. They had a son George Barclay who was born about\n1878\n.\nAndrew Barclay was for many years well known in the teaching profession in Scotland. Barclay was a pupil at Hawick Parish School for nine years before matriculating as a student at the University of Edinburgh in\n1871\n. He was awarded an M.A. in\n1880\n. He specialised in mathematics and, after graduating, taught for a period in George Watson's College, Edinburgh. During this period he was elected fellow of the\nRoyal Society of Edinburgh\non\n4\nJanuary\n1886\n. He was proposed for the fellowship by Alexander Crum Brown,\nJohn Sturgeon Mackay\n,\nGeorge Chrystal\n, and\nSir Thomas Muir\n. He moved from Edinburgh to Glasgow in\n1892\nwhen he was appointed to the teaching staff of Glasgow High School.\nBarclay was prominent in the Glasgow and West of Scotland Branch of the Teachers' Guild and, for example, in December\n1899\nhe chaired a meeting of the Guild in the Christian Institute, Bothwell Street, Glasgow. He retired from the post of head mathematical master in\n1914\nshortly before the start of World War I, and was made a Justice of the Peace for Glasgow in November of that year. Later he went to reside with a son, a chartered accountant, who lived in London. In\n1936\nthe Council of the\nRoyal Society of Edinburgh\nsent him their felicitations on his continuous membership of the Society for fifty years.\nThe\nEdinburgh Mathematical Society\nwas founded in February\n1883\nand it was Barclay together with\nAlexander Yule Fraser\n, also a mathematics master at George Watson's College at the time, together with\nCargill Gilston Knott\n, an Assistant to the Professor of Natural Philosophy in Edinburgh University, who issued a circular\n'to gentlemen in Edinburgh, in Cambridge and throughout Scotland generally whom they deemed likely to take an interest in such a Society'\ncalling for a Mathematical Society to be set up. The circular read as follows:-\nEDINBURGH UNIVERSITY,\nJANUARY\n23\n,\n1883\n.\nDear Sir,\nWe, the undersigned, beg to call your attention to the following proposal, in the hope that you will find it in your power to give it your support:-\nIt is proposed to establish, primarily in connection with the University, a Society for the mutual improvement of its members in the Mathematical Sciences, pure and applied.\nAmongst the methods by which this object might be attained may be mentioned: Reviews of works both British and Foreign, historical notes, discussion of new problems or new solutions, and comparison of the various systems of teaching in different countries, or any other means tending to the promotion of mathematical Education.\nIt is suggested that the Society be formed, in the first instance, of all those who shall give in their names on or before February\n2\n,\n1883\n, and who are\n(1)\npresent or former students in either of the Advanced Mathematical Classes of Edinburgh University,\n(2)\nHonours Graduates in any of the British Universities, or\n(3)\nrecognised Teachers of Mathematics; and that, after the above mentioned date, members be nominated and elected by ballot in the usual manner.\nIt may be added that Professors\nTait\nand\nChrystal\nhave expressed themselves as highly favourable to the project, as one that may lead to important results.\nIf there are any of your friends who might take an interest in the Society, kindly inform them of its objects, and invite them to attend the Preliminary Meeting, to be held in the MATHEMATICAL CLASS ROOM here, on Friday, February\n2\n,\n1883\n, at Eight p.m., at which meeting your presence is respectively requested.\nWe are,\nYours faithfully,\nCARGILL G. KNOTT, D.Sc.\n(\nEdin.\n)\n, F.R.S.E.\nA. J. G. BARCLAY, M.A.\n(\nEdin.\n)\n.\nA. Y. FRASER, M.A.\n(\nAberdeen\n)\n.\nBarclay became a founder member of the Society and was the third President of the Society in\n1884\n.\nHe died on Wednesday\n15\nSeptember\n1943\nin his\n95\nth\nyear. The following announcement of his death appeared in the Press:-\nBarclay.\nAt\n14\nAlvanley Court, Finchley Road, LONDON, N.W\n.\n3\n, on\n15\nth September\n1945\n. ANDREW JEFFREY GUNION BARCLAY, late of Watson's College, Edinburgh, and Glasgow High School, in his\n95\nth year. Funeral at Thorpeness, Suffolk, today\n(\nFriday\n)\n,\n17\nth September, at\n2\n.\n30\n. Friends please accept this\n(\nthe only\n)\nintimation\n.\nThe following obituary was published by\nThe Scotsman:-\nEducational News\nDeath of Former Watson's College Teacher\nThe death occurred in London on Wednesday of Mr Andrew Jeffrey Gunion Barclay, who was for many years well known in the teaching profession in Scotland. Mr Barclay, who specialised in mathematics, taught for a period in George Watson's College, Edinburgh, and afterwards, from\n1892\n, in Glasgow High School, retiring from the post of head mathematical master shortly before the last war, when he went to reside with a son, a chartered accountant, in London. He was in his\n95\nth year. A keen golfer, he was a former captain of Western Gailes club\n."
}