{
  "nome_completo": "Andrei Mikhailovich Razmadze",
  "nome_curto": "Andrei Razmadze",
  "ano_nascimento": "1889",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Razmadze/",
  "lugar_nascimento": "Chkhenisi, Russia (now Samtredia, Georgia)",
  "lugar_morte": "Tbilisi, USSR",
  "biografia": "Andrei Razmadze\n's father was Mikhail Gavrilovich Razmadze, who was employed on the railways, while his mother was Nino Georgievna Nodia. Andrei attended secondary school in Kutaisi, completing his studies there in\n1906\n, and in the same year he entered Moscow University.\nGraduating with a degree in mathematics in\n1910\n, Razmadze taught mathematics in secondary schools while he continued to work for his Master's degree. He was awarded this degree in\n1917\n, taught at Moscow University for a few months, then returned to Georgia near the end of the year\n1917\n.\nRazmadze was one of the founders of Tbilisi University and he taught at this university from the time that it opened in\n1918\n. He held a chair in the Physics and Mathematics Faculty in Tbilisi for the rest of his life. Chrelashvili describes some of his work and achievements there in\n[\n3\n]\n:-\nAs one of the founders of Tbilisi University, he\n(\njointly with\nN I Muskhelishvili\n)\ndirected the training of specialists in mathematics at the university. As a result, within a short period of time all the higher educational establishments of Georgia were supplied with teaching and scientific personnel in mathematics. Mathematics teachers for most secondary schools of Georgia were also trained here.\nRazmadze wrote the first textbooks in Georgian on analysis and integral calculus. In\n[\n2\n]\nRazmadze's\nIntroduction to differential calculus\na little-known textbook published in Russian in\n1923\nis described.\nHis work was on the\ncalculus of variations\n, continuing work by\nWeierstrass\nand\nHilbert\n. The fundamental lemma of the calculus of variations is named after him. He also did important work on discontinuous solutions.\nYushkevich\nwrites\n[\n1\n]\n:-\n[\nRazmadze\n]\npresented a report on his research to the International Congress of Mathematicians at Toronto in\n1924\n, and for that paper he received the doctorate in mathematics from the Sorbonne.\nChrelashvili also notes in\n[\n3\n]\nhow Razmadze's work had been recognised by the international mathematical community. He writes that:-\nFollowing Razmadze's death ..., the outstanding French mathematician\nJacques Hadamard\nsent a telegram of condolence to Tbilisi University, saying that he, together with all the mathematicians of France and the world, was profoundly grieved at the death of Razmadze. This is undoubtedly another expression of the international recognition of Razmadze's scientific contribution and his talent."
}