{
  "nome_completo": "András Rapcsák",
  "nome_curto": "András Rapcsák",
  "ano_nascimento": "1914",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rapcsak/",
  "lugar_nascimento": "Hódmezövásárhely, Hungary",
  "lugar_morte": "Debrecen, Hungary",
  "biografia": "András Rapcsák\n's parents were Péter Rapcsák, who was an inn keeper, and Mária Bereczki who ran a small grocer's shop. András had two brothers: Péter Rapcsák who was three years older than András and became a Calvinist priest; and István Rapcsák who became a radiologist. András attended both primary and secondary schools in his home town of Hódmezövásárhely which is about\n20\nkm north east of Szeged. Between\n1925\nand\n1933\nhe attended the Bethlen Gábor Calvinist\nGymnasium\nin Hódmezövásárhely. This school had a long tradition having been founded in\n1723\nbut it was only given the name Bethlen Gábor in\n1930\n, during the time that Rapcsák studied there. In fact\n1930\nwas the year that Rapcsák's brother Péter graduated from the same school. In\n1993\nRapcsák recalled his school years\n(\nsee\n[\n1\n]\n)\n:-\nI started secondary school at the age of eleven, and I went there for eight long years. When I first entered through its immense gate with oak panels, I immediately caught sight of the inscription carved in the floor: \"Blessing on all the stones of this house.\" My teachers taught me everything in this spirit. It was here that I learnt how to hold out in life and to complete my duties. I learnt here that I must devote my life to beauty and truth and that I must live with dignity. Furthermore, my passion for mathematics and poetry also began here.\nAt this school Rapcsák was in the same class as Márton Sain\n(1915\n-\n1997)\nwho went on to become a well-known historian of mathematics and a gymnasium teacher. Although Rapcsák did not excel at school, in his final year at the Bethlen Gábor Calvinist Gymnasium he took part in a national mathematics competition. This did result in him learning about the great Hungarian mathematicians\nFarkas Bolyai\nand his son\nJanos Bolyai\n. Learning about non-Euclidean geometry made Rapcsák think deeply about the nature of space and he gave a talk on this topic to the Literary Society of the Gymnasium.\nGraduating from the Bethlen Gábor Calvinist Gymnasium in\n1933\n, later that year he entered the Ferenc József University of Szeged taking courses in mathematics and physics. He was taught by several famous mathematicians such as\nFrigyes Riesz\n,\nAlfréd Haar\n,\nLászló Kalmár\n,\nBéla Kerékjártó\n, and István Lipka\n(1899\n-\n1990)\n. His mathematics tutor was\nLászló Kalmár\n. However, he continued his interest in poetry and he joined the Szeged Society of Young Artists which at this time had fifteen members. There he became friends with the poet Miklós Radnóti\n(1909\n-\n1944)\nwho was studying for a doctorate in the Humanities Faculty. Radnóti was Jewish and died in the Holocaust ten years later. In the Art Society, Rapcsák also became friends with Gábor Tolnai\n(1910\n-\n1990)\n, an art historian who had graduated from the University of Szeged in\n1933\n.\nRapcsák showed his talents for mathematics, winning prizes for two of his essays, but his undergraduate years were made exceptionally difficult due to a serious illness which was diagnosed when he was nineteen years old. This illness was osteosarcoma, cancer of the bones, which most commonly affects the leg bones of teenagers. In Rapcsák's case he suffered constant pain in his legs and the cancer was diagnosed. He was treated using radiotherapy which halted the progression of the cancer. This, however, was not a cure and for many years he could only walk with great difficulty using two sticks. This illness caused him to miss three years of his university studies. But this was not the only problem he faced for, by this time, his parents were in financial difficulties and so, in parallel with his studies, he worked as a tutor in a student hostel in Hódmezövásárhely from\n1937\nto\n1942\nto help support his parents. Other events in Europe were making life difficult too. World War II began in\n1939\n, in November\n1940\nHungary signed a pact with Germany and by\n1941\nit was involved in military action. During these years Rapcsák was completing him university studies and he graduated in\n1942\n, nine years after his first matriculation.\nAfter graduating, Rapcsák began a career as a school teacher. His first position was at the Lutheran School in Rozsnyó\n(\nnow Roznava in Slovakia\n)\n. He was only there for a short time but it proved very important for him since at that school he met Jolán Baranyai\n(\nborn\n1911)\n, a teacher of geography and history, whom he later married. They had three children: András Rapcsák, born\n14\nJuly\n1943\nin Debrecen; Tamás Rapcsák, born\n18\nMarch\n1947\nin Debrecen; and Marianna Rapcsák, born\n1948\n. Let us give some details of these children before continuing our biography. András's school education was in in Debrecen, he was an undergraduate in Budapest and took a higher degree in electrical engineering in Debrecen. After working as an electrical engineer, he became a politician. He died in\n2002\n. Tamás became a mathematician and worked on\noperational research\n. He became Head of the Department of Operations Research and Decision Systems in the Computer and Automation Research Institute of the Hungarian Academy of Sciences. He died on\n24\nMarch\n2008\n. Marianna became a biologist and worked in the Department of Physiology of the University of Debrecen. She died in\n2014\n.\nLet us return now to the subject of this biography. After the short spell in Rozsnyó, Rapcsák taught in the Calvinist Reformed Gymnasium in Debrecen which prepared pupils for college, in the Unified Boys' Gymnasium in Debrecen, as well as in two Primary Schools in Debrecen. Teaching started in the Unified Boys' Gymnasium in December\n1944\nin the buildings of the Reformed School after the Soviet army had left. It was not possible to open the five Gymnasiums in Debrecen due to war damage so this one unified school was opened. In\n[\n1\n]\nhis contributions as a teacher are discussed:-\nHe was a real scholar teacher. As a secondary school teacher he undertook didactics research work, and he wrote schoolbooks for the students of technical secondary schools with coauthors\n(\nL Gyarmathi, I Csánk, S Török\n)\n. These books were very popular and they ran to\n10\n-\n19\neditions. The figures were drawn by his fellow teacher J Erdösi. With his college L Magyari he also wrote a schoolbook, but it could not appear in printed form at the time of World War II. He wrote a supplement for the students of the technical secondary schools entitled 'Complex Numbers'\n(1953)\n. He was open minded to problems of teaching mathematics. In his article 'The treatment of geometry in secondary schools' he investigated the problem of teaching geometry by the help of axioms.\nHowever, in addition to his school teaching, from\n1945\nRapcsák also taught at the University of Debrecen and at the Teacher Training College. The professor in the Institute of Mathematics was\nOttó Varga\n(1909\n-\n1969)\nwho founded the Hungarian school of differential geometry. His assistant at the time was\nBéla Gyires\n. It was coming in contact with\nVarga\nthat changed Rapcsák's career for\nVarga\nsaw that he had great mathematical talents and persuaded him to undertake research for a doctorate. Now\nVarga\n's main interests were in differential geometry so it was natural that he should direct Rapcsák in that direction. Continuing with his teaching career, Rapcsák undertook research on differential geometry advised by\nVarga\nand submitted his thesis\nThe theory of surfaces in Minkowski space\n(\nHungarian\n)\nin\n1947\n. In\n1949\nhe published\nKurven auf Hyperflächen im Finslerschen Raume\nⓉ\n(\nCurves on hypersurfaces in Finsler space\n)\nwhich was described as follows in a review by Akitsugu Kawaguchi:-\nConsider an arbitrary curve on a hypersurface in an\nn\nn\nn\n-dimensional\nFinsler\nspace; then the curve has\nn\n−\n1\nn-1\nn\n−\n1\ninvariants\n(\ni.e., curvatures\n)\nas a space curve but\nn\n−\n2\nn-2\nn\n−\n2\ninvariants as a curve on the hypersurface. The paper finds the relations between these systems of invariants. These relations contain formulas which can be regarded as generalization of the\nDarboux\nrelations for the motion of the moving trihedra of a surface. It should be remarked that the author uses as the absolute differential on the hypersurface the one induced orthogonally from the absolute differential in the space, following\nOttó Varga\n[1941]\n.\nThe Eszterházy Károly Lyceum in Eger was founded in\n1774\nbut the government decision to have only one university in Hungary which was made three years later meant that the Lyceum could not teach university level courses. It continued as an educational establishment and was the Archdiocesan Teachers' Training College from\n1852\nto\n1948\n. The Hungarian Parliament transferred the Pedagogical Institute from Debrecen to Eger in\n1948\nand, from\n1949\n, the Lyceum became the Eger Teachers' Training College. Now Rapcsák had taught at the Pedagogical Institute in Debrecen and, when it was transferred to Eger he was made Head of the Department of Mathematics there in\n1949\n. From\n1949\nto\n1951\nRapcsák taught in Eger but it was no easy role he had to fill for, in his own words:-\nI had to be a professor, an associate professor, a senior lecturer and an assistant lecturer all in one person.\nHowever, he achieved this multi-role job with great success. Béla Pelle, who was a student at Eger and went on to become a professor there said\n(\nsee\n[\n1\n]\n)\n:-\nA few of us in Eger did our Ph.D. under Rapcsák's supervision. He was one of the reviewers of my geometry textbook. He played an important role in saving the Department of Physics in Eger. He talked to the government official until he succeeded in persuading him not to close the Department. He also gave demonstration classes at the teacher training school. When he entered the classroom, he already knew the names of every one of the pupils. His classes were marvellous.\nRapcsák himself spoke about his time at the Lyceum in Eger:-\nI emphasized that success in mathematics depends upon understanding things. Cramming formulae results in a hate of mathematics, because students are drowning in the flood of data, and without a lifebelt they will never reach the shore of spirit. A teacher must have a profound knowledge, and instead of brooding on what he should teach, he should rather concentrate on how he can reach his aim. Students are the most terrible, but at the same time the fairest judges as well. A teacher cannot conceal his ignorance before them. On the other hand, young people esteem openness and knowledge very much. Do not try to deceive them, otherwise you will be completely discredited. Young minds must always be polished with humanity.\nToday the Lyceum in Eger is the Eszterházy Károly University of Applied Sciences and, in addition to the\n18\nth\ncentury buildings in the centre of the city\n(\nwhich includes a camera obscura dating from\n1776)\nthere are now new buildings on the edge of the city where the mathematics department is housed.\nIn\n1951\nRapcsák returned to Debrecen when he was appointed as an associate professor at the University of Debrecen. He became a candidate of science in\n1955\nand, in the same year published two papers:\n(\ni\n)\nTheorie der Bahnen in Linienelementmannigfaltigkeiten und eine Verallgemeinerung ihrer affinen Theorie\nⓉ\n(\nTheory of webs in line element manifolds and a generalization of their affinity theory\n)\nwhich generalises the geometry of paths as developed by\nJesse Douglas\nin\n1928\n; and\n(\nii\n)\nInvariante Taylorsche Reihe in einem Finslerschen Raum\nⓉ\n(\nInvariant Taylor series in a Finsler space\n)\nwhich was reviewed by\nLouis Auslander\n:-\nHarold S Ruse\n(1931)\nderives an invariant\nTaylor\nexpansion for tensors on a\nRiemann\nmanifold. His method depends essentially on the use of normal coordinates. Now Herbert Busemann\n(1950)\nhas shown that the normal coordinates of Riemannian geometry are not in general valid in a\nFinsler\nspace. The author, however, using the new normal coordinates introduced by\nOttó Varga\n(1950\n,\n1952)\nsucceeds in generalizing the calculations of\nHarold S Ruse\nto\nFinsler\nspace.\nIn Hanno Rund's book\nThe Differential Geometry of Finsler Spaces\n(1959)\nthere are references to results by Rapcsák contained in the following of his papers:\nKurven auf Hyperflächen im Finslerschen Raume\nⓉ\n(\nCurves on hypersurfaces in Finsler space\n)\n(1949)\n;\nInvariante Taylorsche Reihe in einem Finslerschen Raum\nⓉ\n(\nInvariant Taylor series in a Finsler space\n)\n(1955)\n;\nEine neue Definition der Normalkoordinaten im Finslerschen Raum\nⓉ\n(\nA new definition of normal coordinates in Finsler space\n)\n(\nHungarian\n)\n(1954)\n;\nEine neue Charakterisierung Finslerscher Raume skalarer und konstanter Krümmung, und projektiv-ebene Raume\nⓉ\n(\nA new characterization scalar and constant curvature  Finsler spaces, and projective plane space\n)\n(1957)\n. In this last mentioned paper, Rapcsák generalises well-known theorems on Riemannian spaces of constant curvature to\nFinsler\nspaces. Hanno Rund also reviewed Rapcsák's paper\nMetrische Charakterisierung der Finslerschen Räume mit verschwindender projektiver Krümmung\nⓉ\n(\nMetric characterization of Finsler spaces with vanishing curvature projective\n)\n(1957)\nwriting:-\nFinsler\nspaces of constant and of scalar curvature were defined by\nBerwald\n[(1947)]\n, who also introduced the notion of spaces of vanishing projective curvature, the latter being more general than the former. In the present paper the author introduces certain hypersurfaces by means of which the above-mentioned special types of\nFinsler\nspaces may be characterised. In the treatment of these hypersurfaces the element of support is taken in the direction of the unique transversal to the hypersurfaces. Hyperplanes are defined by the condition that the unit transversal vectors should be parallel\n(\nwith respect to the metric of the imbedding space\n)\n. Necessary and sufficient conditions for the existence of such hyperplanes are found; these conditions may then be used to distinguish between spaces of zero projective curvature and spaces of constant curvature. Conditions that the metric of the hyperplanes be Riemannian and of constant curvature are also derived.\nRapcsák had a great love for teaching his students and put much effort into preparing his lectures. He liked to experiment with different ways of teaching a topic, especially the differential and integral calculus, to see which would be the most effective.\nIn\n1960\nRapcsák was awarded a D.Sc. and was made a full professor in the following year. He headed the Department of Analysis at Debrecen University from\n1965\nto\n1968\n. From\n1977\nto\n1980\nhe was the Director of the Institute of Mathematics and, from\n1984\nto\n1985\n, he headed the Department of Probability and Applied Mathematics. He also took on roles such as vice dean of the Faculty of Sciences\n(1954\n-\n1955)\n, vice rector of the university\n(1955\n-\n1957\nand\n1959\n-\n1963)\n, dean of the Faculty of Sciences\n(1965\n-\n1966)\n, and he was the rector of the university between\n1966\nand\n1973\n.\nThe illness which he had suffered as an undergraduate had never been cured, the treatment preventing its further development. Certainly the treatment was effective since Rapcsák lived to his late\n70\ns, but eventually he died as a result of a recurrence of the cancer.\nHe received the following honours\n[\n1\n]\n:-\nSilver grade of the Medal of People's Republic of Hungary\n(1952)\n, Eminent Pedagogue\n(1955)\n, Silver grade of the Order of Labour\n(1965)\n, Honorary doctor of Taras Shevchenko University of Kiev\n(1968)\n, Golden grade of the Sport Medal\n(1969)\n, Golden grade of the Order of Labour\n(1974)\n, The freedom of Debrecen city\n(1974)\n, Commemorative plaque on the\n25\nth\nanniversary of the Faculty of Sciences\n(1975)\n, Pro Universitate Award\n(1977)\n, Order 'for the Socialist Hungary'\n(1984)\n, Commemorative plaque\n(1985)\n, Doctor honoris causa of Lajos Kossuth University\n(1988)\n."
}