{
  "nome_completo": "Andreas Floer",
  "nome_curto": "Andreas Floer",
  "ano_nascimento": "1956",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Floer/",
  "lugar_nascimento": "Duisburg, Germany",
  "lugar_morte": "Bochum, Germany",
  "biografia": "Andreas Floer\nstudied at the Ruhr University in Bochum, a new university founded in\n1965\n. He received the degree Diplom-Mathematiker in\n1982\nafter studying with R Stöcker and E Zehnder. His main interests were in\nalgebraic topology\nand, in the autumn of\n1982\n, he went to the University of California at Berkeley to continue his research. There he worked for his doctorate with\nClifford Taubes\non gauge theory and with Alan Weinstein on symplectic geometry but, before completing his thesis with\nTaubes\non monopoles on\n3\n-manifolds, he returned to Germany in the summer of\n1984\nto undertake military service.\nBack in Germany he returned to the Ruhr University at Bochum where, supervised by Zehnder, he undertook research on V I Arnol'd's fixed-point conjecture for symplectic maps. He quickly wrote a dissertation and by December\n1984\nhe had received his doctorate. Together with Zehnder, he published\nFixed point results for symplectic maps related to the Arnol'd conjecture\nin the Proceedings of the conference\nDynamical systems and bifurcations\nheld in Groningen in\n1984\n. The authors state in their introduction:-\nOur aim is to present some recent results and open questions concerning the fixed point problem of symplectic maps related to the Arnol'd conjecture.\nFloer was appointed as a research assistant at the University of California at Berkeley and he returned to the United States in early\n1985\nto take up the appointment. Back in Berkeley he began to develop a fundamental theory which is now named Floer homology. Floer obtained a postdoctoral fellowship in mathematical physics at the State University of New York at Stony Brook where he worked for a year before being appointed\nCourant\nInstructor at New York University where he spent the following two years. In\n1988\nhe returned to Berkeley as an Assistant Professor and he was promoted to full Professor in\n1990\n.\nJohn Addison, Andrew Casson, and Alan Weinstein in an obituary of Floer describe his fundamental observation:-\n... Floer developed a new method for \"counting\" the solutions of maximum-minimum problems arising in geometry. A certain quantity called the \"index\" traditionally used to classify solutions was infinite, and therefore unhelpful, in many important but apparently intractable problems. Andreas realized that the difference between the indices of any two solutions could still be defined and could be used where the index itself was useless. Combining this observation with detailed, careful analysis, and using work of many other mathematicians as well as his own, Andreas developed a theory that led to the solution of a number of outstanding problems. The value of his work was grasped immediately by specialists in differential geometry, topology, and mathematical physics, for whom \"Floer homology\" has become an essential part of their problem-solving toolkit.\nIn\n1987\nFloer published\nMorse theory for fixed points of symplectic diffeomorphisms\nin the\nBulletin of the American Mathematical Society\n. In this paper he proves a special case of Arnol'd's conjecture on the number of fixed points of an exact deformation of a compact symplectic manifold. He was soon in demand as a speaker in conferences throughout the world. He accepted invitations to speak in Moscow, Oxford, Paris, and Zürich. The most prestigious invitation of all was the invitation to present a plenary address at the International Congress of Mathematicians held in Kyoto in August\n1990\n. He addressed the conference on\nElliptic methods in variational problems\nin which he spoke of his work on Morse theory for infinite-dimensional manifolds. After reviewing Morse theory in finite dimensions, Floer went on to outline applications to symplectic geometry, working on the loop space on a symplectic manifold. He then outlined the applications to gauge theory on a\n3\n-manifold via the\nChern\n-Simons function on the space of connections in a bundle over the manifold.\nDonaldson\ndiscusses Floer's work in\n[\n2\n]\n. In particular he looks there at Floer's progress on the Arnol'd conjecture and instanton homology, and at Floer's instanton homology and\n4\n-dimensional cobordisms.\nHis promotion to full Professor at Berkeley came at a time when he was considering a number of offers of chairs from different universities. One offer came from Bochum and he obtained leave from Berkeley to take up the professorship at the Ruhr-Universität Bochum for session\n1990\n-\n91\n.\nFloer's attitude to teaching is discussed by John Addison, Andrew Casson, and Alan Weinstein:-\nAlthough Andreas's fame came from his research, he had an intense personal concern with questions of teaching. Thanks in part to his German education, he was dissatisfied with the traditional American \"by the book\" approach to undergraduate courses. While teaching a course in real analysis, he had taken the material apart from top to bottom, reanalysing standard concepts and theorems in order to prepare his students for mathematics as it is done today.\nThey end with this tribute:-\nAndreas is survived by his mother, Marlies Floer, and his brothers, Detlef and Rainer Floer. ... The death of such a brilliant young mathematician at the height of his creative powers is a special tragedy: we rejoice and marvel at the deep and seminal insights he had already had, but mourn the loss to science and mankind of the further beautiful and important discoveries he would have made.\nH Hofer, A Weinstein and E Zehnder write in\n[\n4\n]\n:-\nAndreas Floer's life was tragically interrupted, but his mathematical visions and striking contributions have provided powerful methods which are being applied to problems which seemed to be intractable only a few years ago."
}