{
  "nome_completo": "Andrew Mattei Gleason",
  "nome_curto": "Andrew Gleason",
  "ano_nascimento": "1921",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gleason/",
  "lugar_nascimento": "Fresno, California, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Andrew Gleason\n's parents were Eleanor Theodalinda Mattei and Henry Allan Gleason. Andrew attended the Berkeley, California, High School then later was a student at the Roosevelt High School in Yonkers, New York. He entered Yale University in\n1938\nwith the intention of taking mathematics as his major subject. Already in his second year of study he had attended two graduate courses in addition to all the required courses, obtaining the top grade in all courses to took. His third year of study saw him take three further mathematics courses and one theoretical physics course; again he obtained the top grade in them all. At this point he had fulfilled all the requirements for a Bachelor's Degree but he declined accepting it at this stage saying he wished to remain at Yale for another year so that he could:-\n... do some honours work, finish off a graduate course in mathematics he had apparently overlooked earlier, polish up his French, and devote some time to other minor sports, such as chess and rifle practice.\nGraduating from Yale in\n1942\nGleason joined the US Navy as a code breaker. He was one of the team responsible for breaking Japanese codes. After undertaking this war service, he was appointed as a Junior Fellow at Harvard in\n1946\n. A consequence of this is that he never wrote a doctoral thesis - given the Junior Fellowship there was no need for him to do so\n[\n2\n]\n:-\nIn\n1946\n, a young Andrew Gleason joined the Society of Fellows as a Junior Fellow, spending the next four years auditing lots of mathematics courses and focusing his attention on the famous mathematics problem, \"\nHilbert\n's Fifth.\"\nGiven his experience in the US Navy, it was natural for him to return to serve during the Korean War and he took a two year break from Harvard to serve during the war which lasted from the middle of\n1950\nto the middle of\n1953\n. Gleason was steadily promoted at Harvard, becoming a full professor in\n1957\n. He married Jean Berko, a psychologist, on\n26\nJanuary\n1959\n; they had three daughters, Katherine Anne, Pamela, and Cynthia. Jean Gleason became Professor of Psychology at Boston University. In\n1969\n, he was named the Hollis Professor of Mathematicks and Natural Philosophy, the  oldest endowed scientific professorship in the United States. Gleason retired in\n1992\n. Benedict Gross, after attending Gleason's last lecture in\n1992\n, wrote:-\nIn attending his last lecture, I was struck by the care he took with the basic definitions, the simplicity of his presentation, and the time he had taken in preparing careful notes for the students. ... Andy has always been a terrific inspiration to students.\nPollak writes in\n[\n1\n]\n:-\nIn thinking about, and admiring, Andy Gleason's career, your natural reference is the total profession of a mathematician: designing and teaching courses, advising on education at all levels, doing research, consulting for the users of mathematics, acting as a leader of the profession, cultivating mathematical talent, and serving one's institution. Andy Gleason is that rare individual who has done all of these superbly.\nAs a research mathematician Gleason is best known for his contributions to\nHilbert\n's Fifth Problem:-\nA connected locally compact group G is a projective limit of a sequence of\nLie\ngroups; and, if G has no small subgroups, then it is a\nLie\ngroup.\nHe made a major contribution with his\n1949\npapers:\nSquare roots in locally Euclidean groups; On the structure of locally compact groups\n; and\nA note on locally compact groups\n. He gave an address\nOne-parameter subgroups and Hilbert's fifth problem\nat the International Congress of Mathematicians in Cambridge, Massachusetts, in\n1950\n. In his talk he sketched a possible approach to the solution of\nHilbert\n's fifth problem, emphasizing the importance of one-parameter\n(\nlocal\n)\nsubgroups in a locally Euclidean group\nG\nG\nG\n. In\nCompact subgroups\n(1951)\nhe proved that every connected compact subgroup of a locally compact group is contained in a maximal connected compact subgroup. Then, in\n1952\n, Gleason's paper\nGroups without small subgroups\ntaken together with the results of\nMontgomery\nand\nZippin\n, and\nYamabe\n, gave a complete solution to\nHilbert\n's problem. Gleason won the Newcomb Cleveland Prize from the American Association for the Advancement of Science for his contribution to the solution of the problem. It was, as was stated when the prize was presented to him:-\n... an outstanding contribution to science.\nLet us also mention his papers\nMeasures on the closed subspaces of a Hilbert space\n(1957)\nand\nProjective topological spaces\n(1958)\nas further important contributions. Gleason was also interested in combinatorial and finite mathematics. In this area he produced papers such as\n(\nwith R E Greenwood\n)\nCombinatorial relations and chromatic graphs\n(1955)\n,\nFinite Fano planes\n(1956)\n,\nA search problem in the n-cube\n(1960)\n, and\n(\nwith E D Bolker\n)\nCounting permutations\n(1980)\n.\nIn\n1966\nGleason published\nFundamentals of abstract analysis\n.\nJean Dieudonné\nreviewed the book and it is worth quoting a large part of his review for it says much about Gleason's approach to mathematics and to the teaching of mathematics:-\nThis is a most unusual book, as will immediately be apparent from the perusal of its table of contents. Chapters I to VI cover elementary logic and set theory; Chapters VII to X deal with the various \"number systems\" from the natural integers to the complex numbers; Chapter XI briefly returns to set theory\n(\ncountable sets, cardinal numbers and the axiom of choice\n)\n; finally, the last four chapters deal, respectively, with limits of complex sequences, infinite series and products, metric spaces, and the elementary theory of\nholomorphic\nfunctions of one variable\n(\nCauchy\nintegral excluded, but the logarithmic function is defined and studied\n)\n. The motivation behind this selection is explained in the introduction, where the author expresses his belief that \"set-theoretic mathematics\" is essentially different from mathematics as a science with \"a real content which transcends the inadequacies of our efforts to formalize it\", a distinction which he feels has widened the gap between pure and applied mathematics; his goal is therefore to try to convey to students\n(\naround their fourth year in the university\n)\nthe close relationship between \"formalized\" and \"real\" mathematics.\nEvery working mathematician of course knows the difference between a lifeless chain of formalized propositions and the \"feeling\" one has\n(\nor tries to get\n)\nof a mathematical theory, and will probably agree that helping the student to reach that \"inside\" view is the ultimate goal of mathematical education; but he will usually give up any attempt at successfully doing this except through oral teaching. The originality of the author is that he has tried to attain that goal in a textbook, and in the reviewer's opinion, he has succeeded remarkably well in this all but impossible task. Most readers will probably be delighted\n(\nas the reviewer has been\n)\nto find, page after page, painstaking discussions and explanations of standard mathematical and logical procedures, always written in the most felicitous style, which spares no effort to achieve the utmost clarity without falling into the vulgarity which so often mars such attempts.\nIn\n1980\nGleason, together with R E Greenwood and L M Kelly, published\nThe William Lowell Putnam Mathematical Competition\nwhich gave all the problems and their solutions from the beginning of the competition in\n1938\nup to\n1964\n.\nGleason has received many honours for his outstanding contributions to teaching, research, and mathematics in general. In addition to the Newcomb Cleveland Prize mentioned above, he was awarded the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service to Mathematics, the\nMathematical Association of America\n's most prestigious award, in\n1996\n. He also had the honour of being the\nMathematical Association of America\n's\nEarle Raymond Hedrick\nLecturer at the Summer Meeting of the Association in Vancouver in\n1962\n.\nGleason died from complications following surgery at Mount Auburn Hospital in Cambridge,\nMassachusetts. Shing-Tung Yau, chair of the Mathematics Department at Harvard gave this tribute:-\nAndrew was a great mathematician who solved many important problems in mathematics. He also provided a great service to the University as chairman of the Society of Fellows and as chairman of the department for a period of time. One-time president of the\nAmerican Mathematics Society\n, he was a leader of the world's math community. He trained countless graduate students, and proved an inspiration to them and others."
}