{
  "nome_completo": "Anna Adelaide Stafford Henriques",
  "nome_curto": "Anna Adelaide Stafford Henriques",
  "ano_nascimento": "1905",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Henriques/",
  "lugar_nascimento": "Chicago, Illinois, USA",
  "lugar_morte": "Baileys Crossroads, Virginia, USA",
  "biografia": "Anna Adelaide Stafford Henriques\nis now usually known by her married name of\nAnna Henriques\nbut her maiden name was\nAnna Stafford\n. Her parents were Richard Walter II Stafford\n(1881\n-\n1919)\n, the manager of a pickle factory, and Caroline Augusta Fleuchaus\n(1883\n-\n1919\n?\n)\n. Richard's father was Irish, his mother American, while both Caroline's parents were born in Germany. Caroline and Richard were married in Chicago in\n1904\n. Anna had two younger brothers\n(\na third died in infancy\n)\nand two younger sisters. These were her brother Richard Walter III Stafford\n(\nborn\n1907\nin Barnum, Minnesota\n)\n, sister Mabel Stafford\n(\nborn\n1910\nin Chicago, Illinois\n)\n, sister Marcia Frances Stafford\n(\nborn\n1912\nin Marshfield, Wisconsin\n)\nand brother Wirt Stafford\n(\nborn\n1915\nin Barnum, Minnesota\n)\n. After the five children were orphaned in\n1919\n, they went to live with their father's sister in St Louis, Missouri. This sister, Price Stafford, had married Wirt Wright who was the president of a bank. At the time of the\n1920\ncensus, the children were all in St Louis, Missouri. Anna, as the eldest in the family, was much involved in helping to bring up her younger siblings. Katherine Wright, the daughter of Wirt and Price Wright, was one year younger than Anna and was also living with the family. At the time of the\n1920\ncensus the family had two servants Bertha Mahon and Corrine Mahon.\nAnna began her schooling in Chicago but the family moved to Marshfield, Wisconsin, where she continued to attend school. Then, after the family moved again, she was at a school in Barnum, Minnesota. She soon realised that mathematics meant a lot to her\n(\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nAnna shared her mother's love of mathematics, and knew by the time she was fourteen that her future would include a career either in the field itself or in something closely related to it. Perhaps, she thought then, she might become an astronomer.\nIn\n1981\n, when Anna was asked why she had become a mathematician replied\n(\nsee\n[\n1\n]\n)\n:-\nWell, I guess it was my mother's fault. ... She didn't mind that I couldn't do arithmetic. But ... when I only got\n92\n% in algebra she was heartbroken. When I got to geometry I knew that was it. So I always told people I was going to be an architect because that was acceptable. I really intended to be an astronomer but that wasn't much of a field. So I stayed in mathematics.\nAfter the death of her parents, she went to live in St Louis, Missouri where she attended the Frank Louis Soldan High School. This school, which opened in\n1909\n, was in Union Boulevard and Anna graduated from the school in\n1922\n. She was awarded a four year scholarship and also a scholarship from the St Louis branch of the American Association of University Women which allowed her to enter the Western College for Women in Oxford, Ohio in\n1922\n. An advertisement for the College from a few years earlier reads:-\nWestern College for Women\nRanks with Leading Eastern Colleges.\nA Center of stimulating life for thoughtful students. Definite religious influence. Comprehensive Curriculum. Music, Art, Domestic Science.\n350\nacres in campus, farm and gardens. New Gymnasium and Swimming Pool.\nAt this College, Stafford's\n[\n5\n]\n:-\n... majors were mathematics and Greek and her minor was French. She was in the Classical Club, the French Club, and the Mathematics Club; she participated in theatre; and she was on the baseball, hockey, basketball, and swimming teams.\nAfter graduating from the Western College for Women in\n1926\nshe became a teacher of mathematics and science. She taught at a number of different schools over the next few years. For two years she taught at the St John Baptist School in New York. In session\n1928\n-\n29\nshe taught at the Darlington Seminary in West Chester, Pennsylvania and in\n1929\n-\n31\nat the St John Baptist School for Girls in Mendham, New Jersey. However, Stafford was keen to continue her mathematical education in addition to her job as a high school teacher so, every summer between\n1927\nand\n1931\nshe attended graduate school at the University of Chicago. She was awarded a Master's Degree from Chicago in December\n1931\nbut at this stage she wanted to continue her studies for a doctorate which required residence in Chicago. Her thesis advisor at Chicago was Mayme Irwin Logsdon\n(1881\n-\n1967)\n. Logsdon had been advised by L E Dickson and awarded a Ph.D. from Chicago in\n1921\nfor her thesis\nEquivalence and Reduction of Pairs of Hermitian Forms\n. While studying for her Master's Degree Stafford had attended a topology lecture given by\nRaymond Wilder\nand realised that this was the topic that interested her. Mayme Logsdon knew little about topology but she had agreed to advise Stafford so the two studied topology together using a handwritten Italian topology text. Stafford was not unhappy to see that the notes were in Italian since her ability with languages was high and she simply learnt Italian before reading the notes. She graduated with a Ph.D. in\n1933\nwith her\n29\n-page thesis\nKnotted Varieties.\nThe first few chapters in her thesis are:\nIntroduction\n1\n. Definitions and Transformations\n2\n. Dimensionality and Linking in\nS\n3\nS^{3}\nS\n3\nand\nS\n4\nS^{4}\nS\n4\n3\n. The Knotted Variety\n4\n. Dimension of\nK\nn\nK_{n}\nK\nn\n​\n5\n. Existence of the Knotted Variety\n6\n. The group of\nK\nn\nK_{n}\nK\nn\n​\nin\nS\n2\nn\n+\n1\nS^{2n+1}\nS\n2\nn\n+\n1\n7\n. Construction of\nK\nn\nK_{n}\nK\nn\n​\nby Empirical Methods\n8\n.\nAlexander\n's Polynomial Invariants\nBefore completing her doctoral studies, Stafford decided that she wanted to study topology further and the only American experts in topology that she had heard of were\nJames Alexander\nand\nOswald Veblen\n. She had read\nVeblen\n's famous\n1922\nbook\nAnalysis Situs\n. Both\nAlexander\nand\nVeblen\nwere at Princeton University so she wrote to Princeton University explaining that she wanted to continue her study of topology. She simply received a postcard in reply which stated \"We don't take girls.\"\nThe Institute for Advanced Study at Princeton was founded in\n1930\nwhen building began. The first school at the Institute was the School of Mathematics, created in the autumn of\n1932\n. An article in 'The New York Times' about the Institute for Advanced Study on\n11\nOctober\n1932\nannounced that\nEinstein\nand\nVeblen\nhad been appointed to the Institute. The first founding principle of the Institute was that:-\n... individuals who work at the Institute should be selected on the basis of their abilities alone and with no regard to race, creed, or gender.\nStafford wrote to\nVeblen\non\n6\nMarch\n1933\n(\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nI feel that my mathematical career is still too near its beginnings for me to begin work that is not done under competent direction such as I hope to find at the Institute for Advanced Study ... I think I have laid good foundations for the sort of work which in Combinatorial Topology can scarcely be carried out anywhere so well as at Princeton, and which I believe is just the sort of training the Institute plans to furnish. I hope that by some means I shall be able to continue my work there in the not too distant future. I am eagerly anticipating your visit to Chicago in April, when I hope plans for next year will be more complete.\nShe was able to talk to\nVeblen\nwhen he visited Chicago and she was accepted by the Institute for Advanced Study on condition that she obtained her Ph.D. Soon she arranged a morning teaching position at the St John Baptist School in Princeton so she would be able to attend seminars in the Institute in the afternoons. After the award of her Ph.D. in August\n1933\n, Stafford was formally accepted by the Institute for Advanced Study and spent two years there.\nIn\n1935\nshe decided that she would prefer to teach mathematics rather than undertake research and she was appointed as an instructor in mathematics at the University of Nebraska. She attended the International Congress of Mathematicians in Oslo, Norway, from\n13\nto\n18\nJuly\n1936\n. There, in addition to a talk by\nVeblen\non\nSpinors and Projective Geometry,\nthere was also a talk by\nJakob Nielsen\non\nTopologie der Flächenabbildungen\nⓉ\n(\nTopology of the surface images.\n)\n.\nAfter two years at Nebraska, she moved to Salt Lake City when appointed as an instructor in mathematics at the University of Utah in\n1937\n. She was always keen to help young people so she became a Girl Scout troop leader and she also helped young people at the Episcopal mission in Bluff, Utah.\nWhile singing in a local choir in Salt Lake City, she met Douglas Emmanuel Henriques. Douglas, the son of Hoyt Emanuel and Charlotte Henriques, was born on\n10\nMay\n1910\n, in Battle Mountain, Lander, Nevada, USA. Previously he had married Magdalene Marwedel in\n1929\nand they had one son who was born in\n1930\n. Douglas, who was an administrative law judge for the US Department of the Interior, married Anna on\n9\nDecember\n1942\n. At the time of her marriage, Douglas's son was twelve years old. The family adopted a girl from the Navajo Nation whom Henriques had got to know at the Episcopal mission in Bluff, and they helped to raise another young Navajo girl who attended the mission. They had no children of their own.\nTom Apostol\nwas a student at the University of Utah in the early\n1940\ns. He said in an interview in\n1997\n[\n2\n]\n:-\nI attended\n[\nthe University of Utah\n]\nfor two years. My best mathematics teacher was Anna Henriques, who taught me college algebra and analytic geometry. She's in her nineties now and lives in a retirement complex in Virginia. I telephoned her recently, and she remembers me very well.\nIn\n1941\n, before her marriage, Stafford had been promoted to assistant professor. The Mathematics Club at the University of Utah had ceased to function so, in\n1946\n, Henriques brought the club back to life. In the following year she was promoted to associate professor and she continued in this position until\n1956\n. While in Utah she had undertaken several different roles in the American Association of University Women, the organisation that had supported her through university with a scholarship. She also gave much time to the Utah Council of Teachers of Mathematics, serving as editor of their bulletin, their programme director and, for a while, as their president.\nDouglas Henriques had worked in Utah for around twenty years but, in\n1956\n, his work for the US Department of the Interior meant that he had to move to New Mexico. Anna Henriques resigned her position at the University of Utah and moved with the family to New Mexico. Once there she accepted a position as a lecturer in mathematics at St Michael's College, Santa Fe. This College, founded in\n1859\nby the De La Salle Christian Brothers, had received its charter for higher education in\n1874\n. In\n1958\n, in addition to her position at St Michael's College, Henriques took on a second position as a lecturer in mathematics at the University of New Mexico in Albuquerque. In\n1962\nHenriques was promoted to professor at St Michael's College and, at that time, resigned from her second position at the University of New Mexico. Four years later, in\n1966\n, the Christian Brothers changed the name of St Michael's College to the College of Santa Fe\n(\nsince\n2010\nit has been the Santa Fe University\n)\n. Henriques taught there until she retired in\n1971\n.\nThe Henriques family did not remain in New Mexico but moved to Falls Church, Virginia. Douglas and Anna Henriques, both being retired, now had the freedom to travel widely around every continent and they made full use of the opportunity. Douglas died in November\n1987\n. When in her\n90\ns, Henriques was living in the Goodwin House retirement home in Bailey's Crossroads in Virginia. She continued to give talks on mathematics to other residents of Goodwin House when in her middle nineties. She loved bowling which she did three times a week up to the age of\n93\n. She died of congestive heart failure only a few months short of her\n100\nth birthday.\nIn addition to her love of mathematics and astronomy, and for bowling and travelling which we have already mentioned, Henriques loved to climb mountains and go hiking. She was also fond of music, particularly opera, and the theatre was another of the pleasures in her life. She was a strong supporter of the\nMathematical Association of America\nand was generous in giving to the Institute for Advanced Study."
}