{
  "nome_completo": "Anne Lucy Bosworth Focke",
  "nome_curto": "Anne Bosworth",
  "ano_nascimento": "1868",
  "ano_morte": "1907",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bosworth/",
  "lugar_nascimento": "Woonsocket, Rhode Island, USA",
  "lugar_morte": "Cleveland, Ohio, USA",
  "biografia": "Anne Bosworth\n's parents were Alfred Bosworth\n(25\nAugust\n1845\n-\n4\nMay\n1872)\nand his wife Ellen Metcalf\n(1842\n-\n1929)\n, the daughter of Lewis Metcalf\n(1805\n-\n1876)\nand Lucy Daniels\n(1810\n-\n1894)\n. Alfred Bosworth married Ellen on\n9\nOctober\n1867\nand their first child Anne Lucy, the subject of this biography, was born about a year later. Their second child Ellen died aged\n10\nmonths but Alfred Bosworth had died in\n1872\neven before his daughter Ellen's death. Anne's mother Ellen Bosworth worked as a librarian at the Harris Institute Library in Woonsocket. Anne and her mother Ellen went to live with Ellen's mother Lucy Metcalf who was widowed in\n1876\n. Ellen's sister, Anna Metcalf\n(1840\n-\n1925)\n, also lived with the other members of the family in Lucy Metcalf's home.\nLet us note that Woonsocket, the town in which Anne was born, was only established one year before her birth when three villages combined to form the town. This rapidly expanding town added three further villages to grow bigger in\n1871\n.  It was in her home town of Woonsocket that Anne Bosworth attended school. She graduated from Woonsocket High School in\n1886\nand later in the same year she began her studies at Wellesley College. She graduated with a B.S. in\n1890\nand, later that year, she was appointed as First Assistant at the Amesbury High School in Massachusetts. She taught there until March\n1892\n. On\n23\nMarch\n1892\nshe took up a one year appointment as an Instructor in Mathematics at Rhode Island College of Agriculture and Mechanic Arts situated in Kingston, Rhode Island. This institution, which had only received its charter in\n1888\n, changed its name to Rhode Island State College in\n1909\nand today is known as the University of Rhode Island. The year in which Bosworth joined the College was the first in which it had begun to teach courses beyond the secondary school level. Bosworth's one year appointment was changed to an appointment as Rhode Island College's first Professor of Mathematics and Physics by April\n1892\n[\n8\n]\n:-\nImmediately upon her arrival at the College, Bosworth rolled up her sleeves: She developed a multi-disciplinary curriculum, began the mathematics book collection, and taught courses in algebra, geometry, calculus, various courses in physics, and \"this still mysterious force\" electricity.\nThese activities are detailed in the\n1892\nAnnual Report of Rhode Island College. Bosworth's department consisted of just herself in\n1892\nbut, in\n1893\n, William Elisha Drake was appointed as Professor of Mechanical Engineering. The Department continued to grow with Arthur Curtis Scott being appointed as Instructor in Physics in\n1895\nand promoted to Assistant Professor two years later. Bosworth wanted to study more advanced mathematics and, in the summer of\n1894\nand of\n1896\n, she studied with\nEliakim Hastings Moore\nand\nOskar Bolza\nfor a Master's Degree at the University of Chicago. She was awarded a Master's Degree in\n1896\n.\nTo see how the Department of Mathematics at Rhode Island College of Agriculture and Mechanic Arts developed during her first years as Professor of Mathematics, see an extract from the\n1896\nAnnual Report of the College\n[\n2\n]\nat\nTHIS LINK\n.\nThe respect that she won from her students at Rhode Island College is clear from the College's student yearbook,\nThe Grist\n1898\n, published in June\n1897\n, which contains a picture of Lucy Bosworth and the Dedication\n[\n6\n]\n:-\nTo Miss Bosworth, our professor and classmate, we, who honour her ability and value her friendship, respectfully dedicate this volume.\nIn April\n1898\n, Bosworth was granted leave of absence so that she might attend lectures at the University of Göttingen in Germany. She travelled there with her mother Ellen Bosworth. In Göttingen she attended lectures by\nFelix Klein\non Mechanics as well as lectures by\nArthur Schönflies\n,\nIssai Schur\nand Woldemar Voigt. In the winter semester of\n1898\n-\n99\nshe attended\nDavid Hilbert\n's lectures on Geometry\n[\n4\n]\n:-\nIn spring\n1899\nBosworth \"was summoned\" to tea with\nHilbert\n, whose lectures on non-Euclidean geometry she had attended, and was asked when she would take her doctoral exams. She said she had not any such intention, had not even thought of a dissertation topic.\nHilbert\nsaid, \"But your dissertation is finished\"! It appears that she had done a special exercise for him, and it was considered an entirely original approach and acceptable as a thesis. So instead of spending the summer travelling in Italy, Greece, etc. she remained in Göttingen and took her examinations and passed with honour.\nBosworth submitted her\n57\n-page thesis\nBegründung einer vom Parallelenaxiome unabhängigen Streckenrechnung\nto the University of Göttingen and her oral examination took place on\n31\nJuly\n1899\n.\nHilbert\n, as an examiner, wrote that her thesis was\n[\n5\n]\n:-\n... a sound and independent achievement of scientific value.\nShe returned to the United States with her mother in August\n1899\nand, once the thesis was published in\n1900\n, she was awarded a doctorate. In\n[\n7\n]\nGeorge Bruce Halsted\nwrites:-\nProfessor Anne Bosworth, of Rhode Island, has followed this up by actually constructing in her doctor's dissertation at Göttingen\n(1900)\n, under\nHilbert\n, a sect-calculus independent of the parallel-axiom. This is a beautiful piece of non-Euclidean geometry, and is, so far as I know, the first feminine contribution to our fascinating subject.\nBack at Rhode Island College of Agriculture and Mechanic Arts, Bosworth again took up her role as Professor of Mathematics. She lived with her mother in Kingston. However, her life would take a very different turn because of someone she had met while studying at Göttingen.\nTheodore Moses Focke\n(1871\n-\n1949)\nwas born in Massillon, Ohio, and had studied civil engineering at Case Institute of Technology in Cleveland, graduating in\n1892\n. After a year as an Instructor in Mathematics at Case and three years as a tutor of physics and chemistry at Oberlin College in Oberlin, Ohio, he went to Göttingen to undertake research. He was awarded a doctorate in\n1898\nfor a thesis, written in German, on the thermal conductivity of various kinds of glass. While in Göttingen he and Bosworth had met. After his studies at Göttingen, Focke returned to the United States and joined the mathematics department at Case Institute of Technology. Bosworth and Focke married on\n7\nAugust\n1901\nin Kingston, Rhode Island. The Fourteenth Annual Report of the Rhode Island College of Agriculture and Mechanic Arts in\n1902\nreported Bosworth's resignation\n[\n3\n]\n:-\nAnne L Bosworth, Ph.D., who had been professor of mathematics since the establishment of the department in\n1892\n, sent in her resignation, to go into effect in June of this college year. It is with regret that the institution loses Miss Bosworth from the faculty. Her conscientious work has been, from the beginning, highly appreciated by every member of the institution. Laurence I Hewes, Ph.D.\n(\nYale\n)\n, was appointed professor of mathematics to succeed her.\nAnne Bosworth Focke joined her husband in Cleveland. They had three children, a son and two daughters. Their first child Helen Metcalfe Focke was born on\n10\nJune\n1902\nand became a professor at the School of Library Science of Western Cape University. Helen died on\n20\nOctober\n1997\nin Los Angeles. Theodore Brown Focke was born on\n16\nSeptember\n1904\n. He was awarded a B.S. from Case Institute of Technology in\n1926\nand a doctorate in engineering from the University of Nancy in France, in\n1928\n. Alfred Bosworth Focke was born on\n30\nSeptember\n1906\n. He was awarded a B.S. from Case School of Applied Science in\n1928\n, became an assistant in physics at the California Institute of Technology and later professor and chairman of the Physics Department at Harvey Mudd College, Claremont, California. Helen Focke wrote in\n1978\n[\n5\n]\n:-\nAfter their marriage, Mother did not teach again but worked with Father grading papers, being a good faculty wife and having three children of whom I am the oldest.\nAnne Focke contacted pneumonia and died at the age of thirty-eight. She was buried in Massillon, Ohio. In\n1910\n, three years after her death, her mother Ellen and her aunt Anna were both living with Theodore Focke in Cleveland."
}