{
  "nome_completo": "Annie Dale Biddle Andrews",
  "nome_curto": "Annie Dale Andrews",
  "ano_nascimento": "1885",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Andrews_Annie/",
  "lugar_nascimento": "Hanford, California, USA",
  "lugar_morte": "Oakland, Berkeley, California, USA",
  "biografia": "Annie Dale Andrews\nwas given the name\nAnnie Dale Biddle\nand only after her marriage to William Samuel Andrews in\n1912\ndid she take the name Andrews. We note, however, that later in life she used the name\nAnne\nrather than Annie. She was the daughter of Samuel Edward Biddle\n(1845\n-\n1908)\nand Achsah Anna McQuiddy\n(1848\n-\n1921)\n. Samuel E Biddle was born in Normandie, Bedford county, Tennessee on\n15\nSeptember\n1845\n. He attended schools in Normandie but enlisted into the Confederate army at the age of fifteen. He married Achsah Anna McQuiddy in Normandie on\n6\nJanuary\n1870\nand they moved to California in\n1874\n. Samuel became a miller, then a farmer and finally a very successful banker. Achsah Andrews was the daughter of Thomas Jefferson McQuiddy\n(1828\n-\n1915)\n.\nFor more details of Annie Dale's parents, see\nTHIS LINK\n.\nAnnie Dale Biddle was the youngest of William and Achsah Biddle's seven children. These were: Tolbert Vance Biddle\n(1871\n-\n1954)\n, who worked in a cigar store and later was a bookkeeper at a meat market; Eliza Jane Biddle\n(1874\n-\n1957)\n, who married the merchant Julius Taylor; Samuel Edward Jr Biddle\n(1876\n-\n1946)\n, who became a banker; Reta Hyde Biddle\n(1880\n-\n1972)\n, who married Robert H Crawford, an auditor in the Railroad; Wallace Jefferson Biddle\n(1882\n-\n1961)\n, who became a farm labourer; Kate Justina Biddle\n(1884\n-\n1984)\n, who married Dallas Hurd Gray, a fruit grower; and Annie Dale Biddle\n(1885\n-\n1940)\n, the subject of this biography.\nAnnie Biddle attended both the grammar and high schools in Hanford. The Hanford High School had been established in\n1892\nwith one teacher, W S Cranmer, and graduated its first students in\n1895\n. It began its existence in a room in the Hanford Bank, then moved to a house on Elm Street before its own building was constructed. Biddle graduated from the High School and entered the University of California in Berkeley. We learn something of her activities at Berkeley from the report in the\nOakland Tribune\nof\n16\nApril\n1907\n[\n23\n]\n:-\nMiss Annie Biddle chosen President of Associated Students.\nBerkeley,\n16\nApril\n1907\n.\nBy the narrow margin of six votes, Miss Annie Biddle was yesterday elected over Miss Elsie Cole to the presidency of the Associated Women Students of the university. The count showed the vote to be\n182\nto\n176\n. ... Miss Biddle, the president elect, made Phi Beta Kappa this last year and is a member of the Prytanean Society. She is one of the managing editors of the\n1908\nBlue and Gold and is a member of the committee for the Women's Dormitory Fund.\nWe note that the Prytanean Women's Honor Society is the oldest collegiate women's honour society in the United States. It seeks to recognise and honour the scholastic achievement of undergraduate women, provide community service to the University and community, define positive roles, and encourage fellowship and leadership for women. As managing editor of the\n1908\nBlue and Gold, Biddle was editor of the University of California Berkeley Yearbook of\n1908\n, which covered events, issues and trends within the student community.\nThe mathematics department in which Biddle studied at Berkeley had been built up by\nIrving Stringham\nwho had been appointed as head in\n1882\n. In\n1890\nMellen Woodman Haskell\n(1863\n-\n1948)\nwas appointed to Berkeley. He had been an undergraduate at Harvard and then had undertaken research for his doctorate supervised by\nFelix Klein\nat Leipzig and Göttingen. He had been awarded his doctorate on\n18\nJune\n1889\nand appointed as an Instructor in Mathematics at Berkeley. He was promoted to assistant professor at Berkeley in June of the following year. This was the first new professorial appointment in mathematics following the appointment of\nStringham\n. They were joined by\nDerrick Norman Lehmer\nwho was appointed as an instructor in mathematics in\n1900\n. Also teaching mathematics at Berkeley when Biddle was a students was George Cunningham Edwards. He was born at Spencer, Indian Territory, on\n18\nJune\n1852\n. At the age of ten years Edwards went overland with his parents to San Francisco. After studying at the McClure Military Academy in Oakland and the College of California, he received the degree Ph.B. from the University of California in\n1873\n. He was the third student to register at the University of California after it opened and from that time on was connected with the university as student, professor, and professor emeritus until his death on\n19\nNovember\n1930\n. He was awarded the honorary degree of LL.D. by Berkeley in\n1923\n. His life work was teaching mathematics at the University of California.\nCalvin C Moore writes about the beginnings of the Department of Mathematics in Berkeley in\n[\n17\n]\n:-\nThe emphasis was on teaching, with some attention to research but not very much ... The first PhD degree granted by the department was in\n1901\n. There was a gap until\n1909\n, after which there were about two a year on average until the\n1930\ns.\nBiddle was awarded an A.B. by Berkeley in\n1908\nand continued to study there for her PhD advised by\nDerrick Norman Lehmer\nand Mellen Woodman Haskell. Judy Green and Jeanne LaDuke give details of courses she took in\n[\n14\n]\n:-\nAs a student of pure mathematics she took courses in Synthetic Projective Geometry, the area of her research, with\nD N Lehmer\n; Theory of Functions\n(\nof a real variable, of a complex variable, and elliptic\n)\n; Theory of Equations; Logic of Mathematics; Theory of Substitutions and Groups of Polyhedra; Theory of Invariants; Differential Geometry; and the Theory of Numbers.\nSamuel E Biddle, Annie's father, died on\n7\nMay\n1908\nat the St Helena Sanatorium at Hanford. This, of course, had a major effect on the Biddle family. We see that at the\n1900\nCensus Annie Biddle was at school and living with her parents, two older brothers and two older sisters, at\n406\nCentral Avenue Hanford. After the death of her father, however, by the time of the\n1910\nCensus she is at university, still living in the same house but now with her mother and three boarders.\nIn\n1911\n, Biddle was awarded the W C T U Essay Prize, presented by the Women's Christian Temperance Union. This is recorded in\n[\n21\n]\nas being awarded to \"Annie Dale Biddle A.B., candidate Ph.D., College of Letters.\"\nBiddle submitted her PhD thesis\nConstructive theory of the unicursal plane quartic by synthetic methods\nin\n1911\n. She was examined, with mathematics as a major subject and English literature as a minor subject, by a committee consisting of two mathematicians and one faculty member who was an expert on English literature. She was awarded the PhD in\n1911\nmaking her the first woman to be awarded a PhD in mathematics by Berkeley. Several sources state that there were only two Berkeley PhDs in mathematics at Berkeley before Biddle, namely: Frank Elmore Ross with thesis\nOn Differential Equations Belonging to a Ternary Linearoid Group\n(1901)\nand advisor\nWashington Irving Stringham\n; and\nHenry Walter Stager\nwith thesis\nOn numbers which contain no factors of the form\np\n(\nk\np\n+\n1\n)\np(kp+1)\np\n(\nk\np\n+\n1\n)\n(1909)\nand advisor\nDerrick Norman Lehmer\n. There were, however, two or three other Berkeley PhDs between\n1901\nand\n1911\nwhich might count as mathematics but look more like physics.\nBiddle's thesis was published in\n1912\n; the Introduction begins as follows:-\nIn the following discussion the unicursal quartic is regarded from two points of view. Chapter I treats of the curve in its correspondence to a conic section through a quadratic reciprocal transformation. This leads to an interesting classification of unicursal quartics and affords a convenient and ready method for determining the form of the curve. Incidentally, it brings to light a geometrical application of the well known \"Group of Four.\" In Chapter II the curve is defined as the locus of intersection of corresponding rays of two projective pencils of the second order. This develops properties of the curve not readily obtained in the other treatment. The discussion shows that the two definitions are not independent, but that each is supplementary to the other.\nAfter the award of her PhD, Biddle was employed as an instructor in mathematics at the University of Washington in Seattle for the academic year\n1911\n-\n12\n. While studying at Berkeley she had become friends with William Samuel Andrews\n(1883\n-\n1952)\nwho was awarded an LLB the University of California in\n1906\n. After teaching for a year in Seattle, Biddle returned to the Berkeley area and married William S Andrews in Hanford on\n7\nOctober\n1912\n. The\nHanford Morning Journal\nof Saturday,\n12\nOctober\n1912\n, reported on the wedding\n[\n18\n]\n:-\nThe most elaborate wedding to be celebrated in Hanford since the late spring, was the marriage on Monday evening,\n7\nOctober, of Miss Annie Dale Biddle of this city and William Samuel Andrews, a promising young attorney of San Francisco, the event being consummated in the Church of the Saviour, the Rev G R E MacDonald of Fresno officiating, with the Rev Ray O Miller as his assistant. ... The happy couple left on the Angel for the south, after a gay shower of rice, and from there will go by boat to San Francisco, being at home to their friends in Berkeley about\n1\nNovember. ...  Mrs Andrews is a most gifted and popular young woman, and her hosts of friends in this city are tendering congratulations to the lucky groom upon his good fortune in winning her for a wife. The groom is a San Francisco attorney, connected with the firm of Charles H Wheeler, and is the only son of Mrs Mary Andrews of Berkeley.\nFor a full description of the wedding, see\nTHIS LINK\n.\nAnnie Dale and William Samuel Andrews had two children: a daughter, Wilhelmina Dale Andrews, born on\n4\nSeptember\n1913\n; and a son, William Samuel Andrews Jr., born six years later on\n20\nJuly\n1919\n. We note that William Samuel Jr was Valedictorian of his Berkeley High School class, graduated from Berkeley in\n1940\n, served as Naval Commander in World War II and after graduating from Boult Law School in\n1948\nhad a distinguished law career. He married Camilla Waterman Austin on\n29\nJune\n1946\nand died on\n5\nJune\n1991\n. Wilhelmina Dale Andrews gives her name on the\n1940\nCensus as W Dale Andrews and her occupation as medical social worker at the county clinic.\nBetween the births of her two children, Annie Dale Andrews was employed by the Department of Mathematics in Berkeley.\nThe\nUniversity of California Chronicle\nof\n1914\nlists \"Teaching Fellows: Annie Dale Biddle Andrews, Mathematics,\" see\n[\n20\n]\n. She held the Teaching Fellow position in\n1914\n-\n16\n, then was an Assistant in Mathematics\n1916\n-\n17\n. At the\n1920\nCensus the family are living at\n2816\nDerby Street, Alameda, California and Annie Andrews does not give any occupation. After the birth of her second child in\n1919\n, Andrews returned to teach at Berkeley being appointed as an Associate in Mathematics during\n1920\n-\n23\n, and an Instructor in Mathematics during\n1924\n-\n33\n. As an example of the courses she taught, we note that during\n1922\n-\n23\nshe taught: Mathematical Theory of Investment; Plane Analytic Geometry and Differential Calculus; Solid Analytic Geometry, Integral Calculus, and Infinite Series; College Algebra; and Introduction to Projective Geometry. At the time of the\n1930\nCensus, the Andrews family are living in Avalon Avenue, Berkeley, Alameda, California, and Annie Andrews gives her occupation as \"Assistant Professor of Mathematics at the University.\"\nIn\n1923\nWilliam and Annie Andrews made an extended visit to Europe. They sailed from Montreal on\n6\nJuly\n1923\non the\nMt Rose\narriving in Glasgow, Scotland. They visited several places in Great Britain, Ireland, France, Italy, Germany, Switzerland, Holland and Belgium. They returned sailing from Cherbourg, France on the\nPresident Van Buren\n, arriving in New York on\n4\nDecember\n1923\n. The trip was in part a holiday and in part a business trip for William Andrews.\nBeginning in\n1932\nthe Department of Mathematics at Berkeley came under pressure to become more research oriented. Calvin C Moore writes in\n[\n17\n]\n:-\nHaskell was scheduled to retire in\n1933\n. But a year earlier, in\n1932\n, some chairs of other science departments, notably chemistry, physics, and astronomy, together with President Spoul, his provost, and the campus Budget Committee, were all persuaded that the mathematics department needed to be seriously reconstituted and reorganised. It had fallen far behind these other departments in its research standing and intellectual distinction. A campus committee to review the department proposed the dismissal of a number of junior faculty not oriented towards research and that a distinguished leader from outside be brought in to remake the department. This proposal was unusual, coming in the depths of the Great Depression during a virtual hiring freeze. The decision was imposed from above by campus leadership and without consultation with the department, an action that produced some unhappiness.\nThe three hundred and fourth meeting of the\nAmerican Mathematical Society\nwas held at Stanford University on Saturday\n18\nMarch\n1933\n. There was a morning and an afternoon session attended by\n26\nmembers of the Society including Annie Andrews and\nDerrick Norman Lehmer\n, who presided at both sessions. Andrews gave the paper\nThe space quartic of the second kind by synthetic methods\nand its Abstract, sent to the Society on\n18\nFebruary\n1933\n, was published in the\nBulletin\nof the\nAmerican Mathematical Society\n. It reads:-\nOne set of rulings of a quadric surface\nκ\n\\kappa\nκ\nand the tangent planes to a quadric cone K are put into projective one to one correspondence by means of a pencil of planes\nΣ\nA\n\\Sigma _{A}\nΣ\nA\n​\nof the first order. The locus Q of points of intersection of corresponding elements is a space quartic of the second kind. To each point A of Q corresponds a\nΣ\nA\n\\Sigma _{A}\nΣ\nA\n​\n, the locus of whose axes is a quadric cone\nΣ\n\\Sigma\nΣ\n. The various relations between K, Q, and\nΣ\n\\Sigma\nΣ\nare developed.\nNow up to this time Andrews had published no research papers while on the staff at Berkeley other than her PhD thesis. It is reasonable to assume that this paper, read to a meeting of the\nAmerican Mathematical Society\nwas a reaction to the pressure being put on the mathematics department at Berkeley to become more research oriented. It did not save her from dismissal, however, for her faculty position was terminated on\n1\nJuly\n1933\n. The decision was made, apparently, on the grounds that dismissing other junior members of the department would cause them hardship while Andrews, married to a well-off lawyer, would not experience any hardship.\nThe authors of\n[\n14\n]\nwrite:-\nWhile she was on the faculty, Andrews was involved with the Women's Faculty Club, Torch and Shield, and Town and Gown. Her husband noted soon after her death that \"during the last few years of her life in addition to running her home and doing mathematical research she took an active interest in public affairs and charitable work.\"\nAfter two years of ill health, Annie Andrews died on\n14\nApril\n1940\n. At the time of the\n1940\nCensus she was still at home at\n200\nStonewall Road, Oakland, Alameda, California but, in addition to her husband, son and daughter, there was a cook and a nurse living in the house. The notice of her death published in the\nOakland Tribune\non\n15\nApril\n1940\nreads\n[\n3\n]\n:-\nIn Oakland, April\n14\n,\n1940\n. Anne Biddle, beloved wife of William S Andrews, loving mother of Wilhelmine Dale and William S Andrews Jr., sister of Mrs Dallas H Gray, Mrs L C Taylor, S E, T Vance and W J Biddle; a native of California. Friends are invited to attend the services Tuesday afternoon, April\n16\n,  at\n3\no'clock, at the Mausoleum Chapel of Mountain View Cemetery, Oakland."
}