{
  "nome_completo": "Anthony James Merrill Spencer",
  "nome_curto": "Anthony Spencer",
  "ano_nascimento": "1929",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Spencer_Tony/",
  "lugar_nascimento": "Birmingham, England",
  "lugar_morte": "Nottingham, England",
  "biografia": "Anthony Spencer\nwas known to his friends and colleagues as Tony. His paternal grandfather was a miner in Beighton, Derbyshire, while his maternal grandfather was a shopkeeper in Swallownest, near Sheffield. Tony's father, James Lawrence Spencer, was a chemistry graduate, having studied at Sheffield University, but during the years of the Depression in the\n1920\ns played professional football\n(\nsoccer\n)\nfor West Bromwich Albion. James Spencer married Gladys, and Tony was one of their two children; he had a sister Rosemary. He was ten years old when World War II began so the six years of the war\n(1939\n-\n45)\ncovered much of his years at high school. This school was Queen Mary's Grammar School in Walsall, and the war had a major affect on his education since many of the regular teachers at the school were fighting in the forces or contributing in other ways to the war effort. The staff who remained were overworked but Spencer was lucky to have an excellent mathematics teacher, William A Burns, whose war service was in the Home Guard so he still taught at the school. He instilled a love of mathematics in Spencer.\nSpencer graduated from Queen Mary's Grammar School in\n1947\nand was faced with a choice of doing National Service before entering university, or postponing the military service until his education was completed. Another factor for him to consider in making this choice was that if he went straight to university then he would study at Birmingham University, but if he chose to undertake military service first he would receive a scholarship to study at Cambridge. He chose to join the West Yorkshire Regiment serving for most the time in Austria with an infantry battalion as a signaler. Released after twenty months, instead of the usual two years, he entered Queens' College Cambridge in\n1949\n. Among his lecturers at Cambridge we mention\nGeorge Batchelor\n,\nHermann Bondi\n,\nJohn Burkill\n,\nFred Hoyle\n, Raymond Lyttleton and\nRobert Rankin\n. After graduating from Cambridge, Spencer began studying at Birmingham University for his Ph.D. working on the brittle fracture of elastic-plastic materials with Frank Nabarro as his supervisor. However, Nabarro left Birmingham only ten months after Spencer began his studies. He then transferred to work under\nIan Sneddon\nwho had just left the Department of Physics at Glasgow University to take up the chair of mathematics at the University College of North Staffordshire\n(\nwhich later became Keele University\n)\n[\n2\n]\n:-\n...\nSneddon\nremembers Tony's arrival in Keele, with his own problem, which he considered too tough to solve analytically and advised him to tackle it numerically; his abiding memory of Tony at Keele is of the long hours he spent working away with an electric desk calculator.\nIn\n1955\nSpencer was awarded his doctorate and married Margaret Bosker; they had three sons. He had been awarded a Fulbright Travel Grant to study at Brown University in Providence, Rhode Island, in the United States\n[\n2\n]\n:-\nWith Ronald Rivlin and Albert Green, Tony Spencer embarked on his remarkable studies into the application of the theory of invariants and its role in the development of constitutive laws in continuum mechanics. These studies have now become a milestone in the history of the development of continuum mechanics. References to the collaborative work of Tony Spencer, Ronald Rivlin and Albert Green are standard citations in treatises in modern continuum mechanics. As Tony himself once remarked: 'My debt to Rivlin in particular is huge, and I also owe a great deal to Albert Green, from whom I learned much'.\nIndeed many of Spencer's early publications were with Ronald Rivlin, Albert Green or both. For example he published\n(\nwith Ronald Rivlin\n)\nThe theory of matrix polynomials and its application to the mechanics of isotropic continua\n(1958)\n,\n(\nwith Ronald Rivlin\n)\nFinite integrity bases for five or fewer symmetric\n3\n×\n3\nmatrices\n(1958)\n,\n(\nwith Albert Green\n)\nThe stability of a circular cylinder under finite extension and torsion\n(1959)\n, and\n(\nwith Albert Green and Ronald Rivlin\n)\nThe mechanics of non-linear materials with memory II\n(1959)\n. J A Todd, reviewing the first of these writes:-\nThe authors determine a basis for the invariants, under the orthogonal group, of a set of symmetric\n3\n×\n3\nmatrices. The ideas which underlie the necessarily elaborate computations are the following. By means of the Cayley-Hamilton theorem it is shown that any product of symmetric\n3\n×\n3\nmatrices can be expressed as a linear combination of matrix products of limited total degree, and of certain explicitly determined types, with coefficients expressible in terms of the traces of matrix products. From this result it is shown that a basis for the orthogonal invariants of five or fewer symmetric\n3\n×\n3\nmatrices is given by the traces of an explicitly stated set of matrix products. The basis for the orthogonal invariants of a larger number of matrices is then deduced by using Peano's theorem.\nThe paper written jointly with Albert Green was reviewed by C E Pearson who wrote:-\nThe non-linear elasticity problem of the finite extension and torsion of a solid circular cylinder of incompressible isotropic material has been solved by Rivilin; the present paper applies the perturbation method of Green, Rivlin, and Shield to consider the effects of a small deformation superposed on the finite deformation. Specifically, instability is analyzed by finding the loading conditions for which an adjacent equilibrium position exists. A particular strain energy function\n(\nNeo-Hookean\n)\nis chosen, and the condition for existence of an adjacent equilibrium position is obtained in the form of a transcendental equation, which is solved numerically for two loading conditions. The reduction to the linear elasticity case is also checked. The labour is considerable, and the results form a useful addition to the literature on non-linear elastic stability theory. The authors use general tensors associated with a curvilinear coordinate system moving with the body.\nAfter spending two years at Brown University, Spencer returned to England to take up the post of Senior Scientific Officer at the Atomic Weapons Research Establishment at Aldermaston\n[\n2\n]\n:-\n... where he was chiefly engaged in the effects and detection of underground explosions.\nIn\n1960\nhe was appointed as a Lecturer in the newly founded Department of Theoretical Mechanics at the University of Nottingham. Promotion came quickly for Spencer who was promoted to a Reader in\n1963\nthen, following the death of John Adkins the Professor of Theoretical Mechanics, he became Professor of Theoretical Mechanics and Head of Department on\n1\nApril\n1965\n. He delivered an inaugural lecture entitled\nMechanics, Mathematics and Materials\n.\nHis first book was\nDeformation of Fibre-Reinforced Materials\npublished in\n1973\n. In\n1980\nhe published the classic text\nContinuum mechanics\n. It was reprinted in\n1985\n,\n1988\n,\n1990\n,\n1992\nand\n2004\n. Here is part of the publisher's summary:-\nContinuum mechanics comprises the mechanics of fluids and the mechanics of solids: two major branches of physics and applied mathematics which also provide the basis of civil and mechanical engineering. The modern trend, followed in this book, is to adopt a unified approach to the teaching of these two branches---emphasizing the general mechanical principles which apply to all materials. Once familiar with the underlying principles, the student can specialise in any of the different branches of continuum mechanics. After introductory chapters on matrix algebra, vectors and Cartesian tensors, and an analysis of deformation and stress, the author examines the mathematical statements of the laws of conservation of mass, momentum and energy and the formulation of the mechanical constitutive equations for various classes of fluids and solids. The book includes a number of worked examples and a graded selection of problems\n(\nwith answers where appropriate\n)\n. It is written as a textbook for second- and third-year undergraduate students of applied mathematics but will also be valuable to physicists and engineers.\nSpencer spent time as a visiting professor in a number of other institutions. He was visiting professor at Brown University in\n1966\nand again in\n1971\n. Other universities at which he had visiting appointments were Lehigh University in\n1978\n, and the University of Queensland in\n1982\n. In\n1994\nSpencer retired from his chair at the University of Nottingham, having reached the age of\n65\n, and was made Professor Emeritus. However he remained remarkably active, both in research and world-wide travel. The authors of\n[\n4\n]\nwrite:-\nHe travelled extensively throughout the world to collaborate with numerous colleagues, attending conferences to give keynote presentations and generally supporting the research enterprise in continuum mechanics.  His research productivity showed no signs of diminishing.  In fact, to the contrary, since relinquishing his departmental responsibilities, he was possibly even more productive than ever. At a stage in life when many of his contemporaries, and even some of his much younger colleagues, were fading under the frustrations of 'modernity', Tony 'pressed on regardless'.  In this way he was an inspiration to all, just as he inspired those around him when he headed the talented group of academics associated with the Department at Nottingham.\nHe was Erskine Fellow at the University of Canterbury in\n1995\n, then Leverhulm Emeritus Professor\n1995\n-\n97\n. As an example of his continued research activity, let us quote his own summary of his paper\nExact solutions for a thick elastic plate with a thin elastic surface layer\npublished in\n2005\n:-\nA procedure has been developed in previous papers for constructing exact solutions of the equations of linear elasticity in a plate\n(\nnot necessarily thin\n)\nof inhomogeneous isotropic linearly elastic material in which the elastic moduli depend in any specified manner on a coordinate normal to the plane of the plate. The essential idea is that any solution of the classical equations for a hypothetical thin plate or laminate\n(\nwhich are two-dimensional theories\n)\ngenerates, by straightforward substitutions, a solution of the three-dimensional elasticity equations for the inhomogeneous material. In this paper we consider a thick plate of isotropic elastic material with a thin surface layer of different isotropic elastic material. It is shown that the interface tractions and in-plane stress discontinuities are determined only by the initial two-dimensional solution, without recourse to the three-dimensional elasticity theory. Two illustrative examples are described.\nSpencer received many honours for his outstanding contributions. He was elected a fellow of the\nRoyal Society of London\nin\n1987\nand the\nAmerican Academy of Arts and Sciences\nin\n2004\n. In October\n2007\nthe University of Nottingham established the Spencer Institute of Theoretical and Computational Mechanics, named in his honour. On\n24\nJanuary\n2008\n, two days before his death, he learnt that he had been awarded the Society of Engineering Science's Medal for\n2008\n. He immediately replied indicating that he would be delighted to receive the Medal during the\n45\nth\nAnnual Meeting of the Society of Engineering Science to be held\n12\n-\n15\nOctober\n2008\nat the University of Illinois, Urbana-Champaign. He also accepted the invitation to deliver a plenary lecture at this meeting. However, he died before he could attend the meeting and the award was made posthumously. The International Journal of Engineering Science, of which Spencer was an editor from\n1968\nto\n1995\n, issued a Special Issue as a Memorial to him. This Special Issue was originally planned to honour him on his\n80\nth\nbirthday.\nAs to his interests outside mathematics we quote from\n[\n1\n]\n:-\nTony Spencer was keenly interested in football, a member of the Nottinghamshire County Cricket Club, and followed the fortunes of the Boston Red Sox baseball team. He enjoyed walking and in his younger days was a keen cyclist."
}