{
  "nome_completo": "Antonio Maria Bordoni",
  "nome_curto": "Antonio Bordoni",
  "ano_nascimento": "1789",
  "ano_morte": "1860",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bordoni/",
  "lugar_nascimento": "Mezzana Corti, now Cava Manara, Savoy,",
  "lugar_morte": "Pavia, Italy",
  "biografia": "Antonio Bordoni\nwas born in Mezzana Corti, in the Province of Pavia, about\n7\nkm from the city of Pavia in Lombardy. It was an independent town until\n1838\nwhen it joined Gerrechiozzo which in turn joined Cava Manara in\n1871\n. At the time Bordoni was born the town belonged to Savoy. He attended the University of Pavia where he studied mathematics. He graduated on\n7\nJune\n1807\nand then, in August of that year, he was appointed as a Lecturer in Mathematics and Physics at the Military School in Pavia.\nNapoleon had led the French army into the north part of Italy in\n1796\nand won military victories against the Austrian army. In the following year, he had reorganized the northern Italian republics and, in particular, founded the Military School in Pavia. During his time at the military school Bordoni published a number of mathematical works including:\nMemorie matematiche:\n1\n, sopra le trasformazioni delle equazioni: Sopra l'integrazione delle equazioni a differenze finite e parziali delle funzioni a piu variabili\nⓉ\n(\nMathematical Memoirs:\n1\n, the transformation of the equation: On the integration of equations in finite differences and partial of the more variable functions\n)\n(1808)\n;\nNuovo rapporto tra la teoria del centro di gravita e quella della composizione delle forze\nⓉ\n(\nNew relationship between the theory of the centre of gravity and the composition of forces\n)\n(1810)\n;\nMemoria matematica dedicata al sig. dottor Vincenzo Brunacci\n...\nⓉ\n(\nMathematical memoir dedicated to Dr. Vincenzo Brunacci ...\n)\n(1810)\n;\nSopra l'equilibrio di un poligono qualunque\nⓉ\n(\nAbout the balance of a general polygon\n)\n(1814)\n;\nNuovi teoremi di meccanica elementare\nⓉ\n(\nNew elementary theorems in mechanics\n)\n(1815)\n;\nDell'ombra del toro, dell'ovolo dello spaccato di una volta emisferica e della scozia\nⓉ\n(\nProjection of the torus, the cross section once hemispheric and Scotland ??\n)\n(1815)\n; and\nDe' contorni delle ombre ordinarie\nⓉ\n(\nOn the contours of the ordinary shadows ??\n)\n(1816)\n.\nIn\n1815\n, following the defeat of Napoleon, Francis I founded of the Kingdom of Lombardy-Venetia, a strange region consisting of two separated areas of land. Control was taken away from Milan and given to Venice and the administrative system set up by Napoleon was dismantled. There was widespread discontent, and severe measures were imposed to keep control. These political events led to the closing of the military school in Pavia in\n1816\nand Bordoni was out of a job. However, this situation did not last long for, on\n1\nNovember\n1817\n, he was appointed Professor of Elementary Pure Mathematics at the University of Pavia. In the following year he was appointed to the Chair of Higher Calculus, Geodesy and Hydrometrics. We note that Higher Calculus\n(\nactually called Sublime Calculus\n)\nessentially meant Mathematical Analysis. At Pavia, Bordoni joined the other Chairs in Mathematics, namely Marchesi in Architecture, Lotteri in Preliminary Calculus, and Gratognini in Mechanics, Statics, Hydrodynamics, Hydraulics\n(\nApplied Mathematics\n)\n. Four new mathematics courses were established in\n1819\n, namely Descriptive Geometry, Static and Hydraulic Architecture, and Hydrometry and Drawing.\nBordoni began to study differential geometry as early as the\n1820\ns. When he became acquainted with the work of\nLiouville\nand the ideas of\nGauss\n, he encouraged his colleagues and students at the University of Pavia to develop them. His works published during the\n1820\ns include:\nDegli argini di terra\nⓉ\n(\nOf the earthen levees\n)\n(1820)\n;\nSull'equilibrio delle curve a doppia curvatura rigide ovvero completamente o solo in parte elastiche\nⓉ\n(\nOn the equilibrium of rigid curves in double curvature which are wholly or partially elastic\n)\n(1820)\n;\nSull'equilibrio astratto delle volte\nⓉ\n(\nAbstract balance times ??\n)\n(1821)\n;\nAnnotazioni agli elementi di meccanica e d'idraulica del prof. Giuseppe Venturoli\nⓉ\n(\nRemarks to the mechanical elements and the hydraulics of Giuseppe Venturoli\n)\n(1821)\n;\nSui sistemi di due forze equivalenti fra loro e ad un qualsivoglia\nⓉ\n(\nSui of two equivalent systems forces between them and to a any\n)\n(1821)\n;\nDe' contorni delle penombre ordinarie\nⓉ\n(\nOn the contours of the ordinary shadows\n)\n(1822)\n;\nDella distanza delle linee e delle superficie cha hanno le normali comuni\nⓉ\n(\nOf the distance of the lines and surfaces which have a common normal\n)\n(1822)\n;\nSopra de' momenti ordinarj\nⓉ\n(\nAbove de ordinary moments\n)\n(1822)\n;\nProposizioni di geodesia elementare\nⓉ\n(\nPropositions in elementary geodesy\n)\n(1823)\n;\nSulla stereometria\nⓉ\n(\nOn stereometry\n)\n(1824)\n;\nTrattato di geodesia elementare\nⓉ\n(\nTreatise on elementary geodesy\n)\n(1825)\n;\nNota di stereotomia sopra i cunei dei ponti in isbieco\nⓉ\n(\nNote of stereotomy over bias bridges wedges ??\n)\n(1826)\n; and\nSul teorema guldiniano\nⓉ\n(\nOn the theorem of Paul Guldin\n)\n(1827)\n. Not only was he working hard within Mathematics but he also took a major role in running the University and, in\n1827\nand\n1828\n, he served as rector of the University.\nWhen Bordoni was appointed to the University of Pavia, Mathematics was part of the Faculty of Philosophy. Major changes in the Mathematical Sciences course structure were introduced in\n1827\nand further changes made in\n1838\n. The article\n[\n1\n]\ndescribes these in detail. In\n1847\nthe Faculty of Mathematics was granted autonomy and, two years later, Bordoni put forward proposals to reorganise Mathematical Studies\n[\n1\n]\n:-\n... in which he hoped that practical courses in engineering would be organized and specializations in architecture as well as in rural, mechanical, mining, hydraulic and civil, military engineering would be provided for.\nHis proposals were, however, largely ignored. In\n1854\nBordoni was elected Director of Mathematical Studies and, in\n1859\n, he tried again to make major changes to the structure of Mathematics, in particular emphasising the further development of advanced courses in Civil Engineering. He put forward proposals for a four-year course leading to the degree of Doctor in the Studies of Civil Engineering and Architecture. In addition he made proposals as to how the material should be examined. However, his proposals went further\n[\n1\n]\n:-\nIn order to be qualified to practise the profession a three-year apprenticeship would be compulsorily required, the first year to be spent at the same University under the direction of two professors, while the others would be under the direction of an Engineer practicing the profession. After this training, a very severe examination should be taken \"from any board of Public Constructions\".\nAgain his proposals were not adopted. In February\n1860\n, Bordoni was appointed as a senator but died one month later. Among the publications from the latter part of his career we mention the texts\nLezioni di calcolo sublime\nⓉ\n(\nLessons on higher calculation\n)\n(1831)\n,\nSopra gli scolastici\nⓉ\n(\nAbove the scolastics\n)\n(1837)\nand\nTrattato di geodesia elementare\nⓉ\n(\nTreatise on elementary geodesy\n)\n(1843)\n. He was honoured with election to various academies, including the Accademia dei XL\n(\nnow the\nNational Academy of Sciences of Italy\n)\n. He was also honoured more than twenty years after his death when the Istituto Tecnico Bordoni, established in Pavia in\n1861\n, was named after Bordoni in\n1882\n.\nAmong Bordoni's students at Pavia were\nFelice Casorati\n, who became his assistant after graduating in\n1856\n. Earlier\nFrancesco Brioschi\nhad been Bordini's student graduating\n1845\nhaving written a thesis under Bordini's supervision.\nBrioschi\nwas appointed professor of applied mathematics at the University of Pavia in\n1852\n, becoming Bordoni's colleague.\nLuigi Cremona\nwas also taught by Bordoni when a student of Civil Engineering at Pavia beginning in\n1849\n. He was awarded his doctorate from Pavia in\n1853\n."
}