{
  "nome_completo": "Archibald Goldie",
  "nome_curto": "Archibald Goldie",
  "ano_nascimento": "1888",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Goldie/",
  "lugar_nascimento": "Armadale, West Lothian, Scotland",
  "lugar_morte": "London, England",
  "biografia": "Archibald Goldie\n's father was  Rev Andrew Goldie\n(\nborn Bishopbrigs, Lanarkshire about\n1855)\nwho was the Minister of the Free Church in Glenisla. His mother was  Isabella Goldie\n(\nborn Old Monkland, Lanarkshire about\n1859)\n. He had three younger sisters Margaret\n(\nborn about\n1890)\n, Nettie\n(\nborn about\n1892)\nand Ella\n(\nborn about\n1896)\n.\nArchibald attended Harris Academy, Dundee, Angus, and then the University of St Andrews before going to Cambridge to study the Mathematical Tripos. Goldie graduated as a\nwrangler\n(\nfirst class student\n)\nin August\n1913\n.\nAfter graduating Goldie was appointed to the Meteorological Office and initially sent for further training in the Forecast Division. Following this training he was sent to work at Falmouth Observatory. However the start of World War I in\n1914\nmeant that his career took a temporary change of direction. He was sent to Eskdalemuir Observatory where he became\nL F Richardson\n's senior assistant in computational weather forecasting. He was commissioned in the Meteorological Section, R. E. and served at St Omar, then in Meteorological Service for the British Army with the\n4\nth\nArmy, and in the last year of the war he set up the Meteorological Organisation for the British Forces in Italy.\nAfter the war ended he was appointed in\n1919\nas Superintendent of the Meteorological Office and worked in London until October\n1924\n. At this time he returned to Scotland as Superintendent of the Edinburgh Office which was responsible for running three Meteorological and Magnetic Observatories at Aberdeen, Eskdalemuir and Lerwick. In\n1938\nhe was appointed Assistant Director of the London, Meteorological Office, a position he retained until he retired in\n1953\n. He was honoured with the award of a C.B.E. in\n1951\nfor his contributions to the Meteorological Office.\nGoldie was a member of the\nEdinburgh Mathematical Society\n, joining the Society in December\n1926\nwhile he was working in Edinburgh. In fact he was only a member of a couple of years. He was elected to the\nRoyal Society of Edinburgh\non\n9\nMarch\n1925\n, his proposers being Thomas James Jehu, Ralph Allan Sampson, Sir James Walker, Sir Ernest Maclagan Wedderburn.\nAn obituary, written by W A Harwood, appears in the\nRoyal Society of Edinburgh\nYear Book\n1965\n, pages\n18\n-\n20\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nIn\n1928\nGoldie married Marion Nairne Wilson. Four years after her death in\n1948\nhe remarried to Helen Carruthers."
}