{
  "nome_completo": "Aristarchus of Samos",
  "nome_curto": "Aristarchus",
  "ano_nascimento": "310 BC",
  "ano_morte": "230 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aristarchus/",
  "lugar_nascimento": "Samos, Greece",
  "lugar_morte": "Greece",
  "biografia": "Aristarchus of Samos\ndoes not seem to have had the attention from historians of mathematics which he deserved until recent times. For example\nHeath\nbegins Volume II of his history of Greek mathematics with the words\n[\n5\n]\n:-\nHistorians of mathematics have, as a rule, given too little attention to Aristarchus of Samos. The reason is no doubt that he was an astronomer, and therefore it might be supposed that his work would have no sufficient interest for the mathematician. The Greeks knew better; they called him 'Aristarchus the mathematician'.\nHowever the fact that he was known as an astronomer rather than a mathematician is rather countered by\nNeugebauer\n's claim that his work\n[\n6\n]\n:-\n... is a purely mathematical exercise which has ... little to do with practical astronomy ...\nZhitomirskii, in\n[\n14\n]\n, states:-\nAristarchus of Samos is a little-known but often cited precursor of\nCopernicus\n. All information about him derives from a handful of scattered references in Classical writers, plus a short treatise of his which does not mention heliocentrism. Accordingly historians often mention him, cite one or two facts and move on to another subject - after providing a few words of explanation that reveal much about the historians' biases.\nThe paper\n[\n14\n]\nthen makes a serious attempt to remedy what the author considers to be the shortcomings of other historians. Let us try in this article to do more than 'mention one or two facts' and to indicate both the magnitude and originality of Aristarchus's achievements and also his role in the development of mathematical astronomy.\nAristarchus was certainly both a mathematician and astronomer and he is most celebrated as the first to propose a sun-centred universe. He is also famed for his pioneering attempt to determine the sizes and distances of the sun and moon. We shall look at these two achievements below.\nAristarchus was a student of Strato of Lampsacus, who was head of\nAristotle\n's Lyceum. However, it is not thought that Aristarchus studied with Strato in Athens but rather that he studied with him in Alexandria. Strato became head of the Lyceum at Alexandria in\n287\nBC and it is thought that Aristarchus studied with him there starting his studies shortly after that date.\nAristarchus is mentioned by\nVitruvius\n(1\nst\ncentury BC\n)\nwho was famous as a Roman architect and engineer.\nVitruvius\nwas the author of the important treatise\nDe architectura\n(\nOn Architecture\n)\nand in this work he lists men who have been knowledgeable across all branches of science\n(\nsee for example\n[\n3\n]\n,\n[\n4\n]\n, or\n[\n5\n]\n)\n:-\nMen of this type are rare, men such as were, in past times, Aristarchus of Samos,\nPhilolaus\nand\nArchytas\nof Tarentum,\nApollonius\nof Perga,\nEratosthenes\nof Cyrene,\nArchimedes\nand Scopinas of Syracuse, who left to posterity many mechanical and gnomonic appliances which they invented and explained on mathematical principles.\nOf course there is the immediate question of what Aristarchus invented, and\nVitruvius\nexplains that he invented a sundial in the shape of a hemispherical bowl with a pointer to cast shadows placed in the middle of the bowl.\nThere is little existing evidence concerning the origin of Aristarchus's belief in a\nheliocentric system\n. We know of no earlier hypothesis of this type but in fact the theory was not accepted by the Greeks so apparently never had any popularity. We only know of Aristarchus's theory because of a summary statement made in\nArchimedes\n'\nThe Sand-Reckoner\nand a similar reference by\nPlutarch\n.\nArchimedes\nwrote\n(\nsee for example\n[\n3\n]\n,\n[\n4\n]\n, or\n[\n5\n]\n, or see\n[\n1\n]\nfor a shorter quote\n)\n:-\nYou King Gelon are aware the 'universe' is the name given by most astronomers to the sphere the centre of which is the centre of the earth, while its radius is equal to the straight line between the centre of the sun and the centre of the earth. This is the common account as you have heard from astronomers. But Aristarchus has brought out a book consisting of certain hypotheses, wherein it appears, as a consequence of the assumptions made, that the universe is many times greater than the 'universe' just mentioned. His hypotheses are that the fixed stars and the sun remain unmoved, that the earth revolves about the sun on the circumference of a circle, the sun lying in the middle of the orbit, and that the sphere of fixed stars, situated about the same centre as the sun, is so great that the circle in which he supposes the earth to revolve bears such a proportion to the distance of the fixed stars as the centre of the sphere bears to its surface.\nArchimedes\nhaving reported the views of Aristarchus, criticised those views as giving mathematically meaningless proportions. In fact the way that Aristarchus expresses his proportions is, according to\nHeath\n, similar to other expressions which occur in Greek writings and indicated that Aristarchus considered that the radius of the sphere of the fixed stars was infinitely large compared with the orbit of the earth. Of course, Aristarchus had to make some such assumption, for otherwise\nparallax\neffects would be visible.\nPlutarch gives us a little extra information, for he reports that Aristarchus followed\nHeraclides\nof Pontus in believing that the apparent daily rotation of the fixed stars was due to the rotation of the earth on its axis.\nThe only surviving work of Aristarchus,\nOn the Sizes and Distances of the Sun and Moon\n, is not based on the sun centred theory and unfortunately his work on that sun centred theory referred to by\nArchimedes\nhas been lost.\nOn the Sizes and Distances of the Sun and Moon\nprovides the details of his remarkable geometric argument, based on observation, whereby he determined that the Sun was about\n20\ntimes as distant from the Earth as the Moon, and\n20\ntimes the Moon's size. Both these estimates were an order of magnitude too small, but the fault was in Aristarchus's lack of accurate instruments rather than in his correct method of reasoning.\nThe diagram shows an argument used by Aristarchus. He knew that the moon shines by reflected sunlight, so he argued, if one measured the angle between the moon and sun when the moon is exactly half illuminated then one could compute the ratio of their distances. Aristarchus estimated that the angle at the time of half illumination was\n87\n° so the ratio of the distances is sin\n3\n°. Of course, we have translated this into modern notation for Aristarchus did not use degrees nor had trigonometry been invented so he did not have the sine function at his disposal. However this is in effect the calculation he made, correct in principle yet almost impossibly difficult to observe in practice since determining the moment at which half illumination of the moon occurs can only be very inaccurately found.\nAristarchus was then faced with calculating an approximation for what is in our notation sin\n3\n°. He obtained the inequality\n1\n18\n>\nsin\n⁡\n3\n°\n>\n1\n20\n\\large\\frac{1}{18}\\normalsize  > \\sin 3° > \\large\\frac{1}{20}\\normalsize\n1\n8\n1\n​\n>\nsin\n3\n°\n>\n2\n0\n1\n​\nand deduced that the sun was between\n18\nto\n20\ntimes as far away as the moon. In fact at the moment of half illumination the angle between the moon and the sun is actually\n89\n°\n50\n' and the sun is actually about\n400\ntimes further away than the moon.\nRather strangely Aristarchus uses values for the angle subtended by the sun and moon to be\n2\n°. This figure is quite inaccurate as it is four times too large. He correctly uses the evidence of eclipses to state that the sun and moon subtend the same angle. However,\nArchimedes\nquotes a value of\n1\n2\n°\n\\large\\frac{1}{2}\\normalsize °\n2\n1\n​\n°\nfor the angle subtended by the sun and attributes this figure to Aristarchus. We can only assume that Aristarchus wrote\nOn the Sizes and Distances of the Sun and Moon\nearly in his career, then later on he adopted his hypothesis of a sun centred universe and computed a much more accurate value of the angle subtended by the sun. One has to assume Aristarchus was able to develop instruments to make accurate astronomical measurements later in his career.\nNeugebauer\nargues in\n[\n6\n]\nthat Aristarchus was not interested in accurate astronomical data\n(\nsince he could have easily done very much better had he been interested\n)\n. Rather\nNeugebauer\nsuggests, Aristarchus was only interested in the mathematical theory behind finding the distances and diameters. He was showing that such measurements could be made and, since he succeeds in showing this, his work is of major importance. As\nNeugebauer\nwrites in\n[\n6\n]\n:-\n... the power of the mathematical approach to astronomical problems has been drastically demonstrated, in the same sense as\nEudoxus\n, a century earlier, constructed cinematic models which could be related to planetary motions without solving a single specific problem.\nThere are one or two other references to work of Aristarchus which have been investigated recently. For example in\n[\n7\n]\nthe authors interpret:-\n... a difficult passage in an anonymous commentary written in Greek during the\n2\nnd\ncentury AD on Book\n20\nof\nHomer\n's Odyssey. ... the\n[\nanonymous\n]\nauthor quotes Aristarchus of Samos citing\nThales\nand Heraclitus in order to support his thesis\n[\nof\n]\nsolar eclipses ...\n[\nHis\n]\nthesis concerning the times when solar eclipses may occur rests on an analysis of Greek and Egyptian calendrical conventions, rather than on an appeal to observation of solar eclipses."
}