{
  "nome_completo": "Aryabhata II",
  "nome_curto": "Aryabhata II",
  "ano_nascimento": "920",
  "ano_morte": "1000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aryabhata_II/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Essentially nothing is known of the life of\nAryabhata II\n. Historians have argued about his date and have come up with many different theories. In\n[\n1\n]\nPingree gives the date for his main publications as being between\n950\nand\n1100\n. This is deduced from the usual arguments such as which authors Aryabhata II refers to and which refer to him. G R Kaye argued in\n1910\nthat Aryabhata II lived before\nal-Biruni\nbut Datta\n[\n2\n]\nin\n1926\nshowed that these dates were too early.\nThe article\n[\n3\n]\nargues for a date of about\n950\nfor Aryabhata II's main work, the\nMahasiddhanta\n, but R Billiard has proposed a date for Aryabhata II in the sixteenth century. Most modern historians, however, consider the most likely dates for his main work as around\n950\nand we have given very approximate dates for his birth and death based on this hypothesis. See\n[\n7\n]\nfor a fairly recent discussion of this topic.\nThe most famous work by Aryabhata II is the\nMahasiddhanta\nwhich consists of eighteen chapters. The treatise is written in Sanskrit verse and the first twelve chapters form a treatise on mathematical astronomy covering the usual topics that Indian mathematicians worked on during this period. The topics included in these twelve chapters are: the longitudes of the planets, eclipses of the sun and moon, the projection of eclipses, the lunar crescent, the rising and setting of the planets, conjunctions of the planets with each other and with the stars.\nThe remaining six chapters of the\nMahasiddhanta\nform a separate part entitled\nOn the sphere\n. It discusses topics such as geometry, geography and algebra with applications to the longitudes of the planets.\nIn\nMahasiddhanta\nAryabhata II gives in about twenty verses detailed rules to solve the indeterminate equation:\nb\ny\n=\na\nx\n+\nc\nby = ax + c\nb\ny\n=\na\nx\n+\nc\n. The rules apply in a number of different cases such as when\nc\nc\nc\nis positive, when\nc\nc\nc\nis negative, when the number of the quotients of the mutual divisions is even, when this number of quotients is odd, etc. Details of Aryabhata II's method are given in\n[\n6\n]\n.\nAryabhata II also gave a method to calculate the cube root of a number, but his method was not new, being based on that given many years earlier by\nAryabhata I\n, see for example\n[\n5\n]\n.\nAryabhata II constructed a sine table correct up to five decimal places when measured in decimal parts of the radius, see\n[\n4\n]\n. Indian mathematicians were very interested in giving accurate sine tables since they were used to calculate the planetary positions as accurately as possible."
}