{
  "nome_completo": "Louis Victoire Athanase Dupré",
  "nome_curto": "Athanase Dupré",
  "ano_nascimento": "1808",
  "ano_morte": "1869",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dupre/",
  "lugar_nascimento": "Cerisiers, France",
  "lugar_morte": "Rennes, France",
  "biografia": "Athanase Dupré\n's father was Jean Louis Dupré\n(1775\n-\n1850)\n, a printer, who had married Marie Marguerite Victoire Salmon\n(1776\n-?\n)\non\n8\nFebruary\n1796\n. They had at least seven children, Pierre Louis\n(\nborn\n1797)\n, Marie Anne Victoire\n(\nborn\n1800)\n, Louise Constance Aline\n(\nborn\n1807)\n, the subject of this biography Louis Victoire Athanase\n(\nborn\n1808)\n, Louise Delphine Eugénie\n(\nborn\n1810)\nand Antoine Ferdinand Palimon\n(\nborn\n1817)\n. A seventh child, Paul, is referred to by Athanase Dupré in a footnote in his book\nThéorie mécanique de la chaleur\nⓉ\n(\nMechanical Theory of Heat\n)\nwhere he thanks his \"brother Paul\" for a helpful suggestion. We have not found a date of birth for Paul Dupré. The Dupré family was Roman Catholic and brought their children up in that faith; Athanase Dupré remained a staunch Catholic throughout his life. He spent his childhood in Cerisiers, in the Yonne department in Burgundy, where he began his education. After completing his school studies at the Collège in Auxerre, the capital of the Yonne department, he entered the École Normale Supérieure in Paris in\n1826\n. He was placed first in his class when he graduated in\n1829\nhaving published\nSur l'explication des phénomènes de la chaleur, de la lumière et de l'électricité\nⓉ\n(\nExplanations of the phenomena of heat, light and electricity\n)\n,\n(1828)\n. After the award of his degree, Dupré was appointed to the Collège Royal in Rennes. He taught mathematics and physics there until\n1847\n, beginning by teaching elementary mathematics and proceeding on to teach physics. He published his first major textbook, namely the two-volume\nTraité élémentaire de physique\nⓉ\n(\nElementary treatise on physics\n)\n(1831)\n, soon after taking up the position at the Collège Royal.\nIn\n1838\nDupré married Louise Euphrasie Rousseau, born in\n1804\nin Villeneuve-la-Guyard in the Yonne department, and they lived on the rue de Paris in Rennes. They had several children. Édouard Louis Athanase, born\n11\nJuly\n1839\nin Rennes, became professor at the Lycée in Cherbourg and become a Knight of the Légion d'Honneur. Pierre Louis Athanase, born\n24\nFebruary\n1842\nin Rennes, became a captain in the navy and an Officer of the Légion d'Honneur. Raphaël Athanase, born\n22\nSeptember\n1843\nin Rennes, studied at the École Polytechnique, became director of marine engineering and also became an Officer of the Légion d'Honneur. A fourth son, Paul Louis Athanase Dupré, was born in Rennes, studied at the École Polytechnique and went on to undertake joint work with his father. We say a little more about Paul Louis below.\nIn\n1847\nDupré was appointed to the chair of applied mathematics in the Faculty of Science at Rennes. This Faculty of Science had been set up in\n1840\nwith Felix Dujardin, the professor of zoology, as Dean. The Faculty had twin aims, to train students for their first degree and to popularise science. When Dupré was appointed, the Faculty was housed on the first floor of the north wing in the Rennes City Hall, but new buildings were planned and these were completed in\n1855\n. In\n1866\nDupré was appointed dean of the Faculty after the previous dean, the chemist Faustino Malaguti\n(1802\n-\n1878)\n, had been appointed rector of Rennes Academy.\nFor the first part of his career, from\n1826\nuntil\n1859\n, Dupré contributed to a number of different areas in mathematics and physics. He published two papers on\nnumber theory\nin the\nJournal de Mathématiques Pures et Appliquées\n, the first\nSur le nombre des divisions à effectuer pour obtenir le plus grand commun diviseur entre deux nombres entiers\nⓉ\n(\nOn the number of divisions required to obtain the greatest common divisor of two integers\n)\nin\n1846\nand the second\nSur le nombre de divisions à effectuer pour trouver le plus grand commun diviseur entre deux nombres complexes de la forme a + b\n√-\n1\noù a et b sont entiers\nⓉ\n(\nOn the number of divisions to be performed to find the greatest common divisor between two complex numbers of the form a +  b√-\n1\na and b are integers\n)\nin\n1848\n. In the second of these papers Dupré discussed calculating the greatest common divisor of two Gaussian integers. He won an honourable mention for the\n1858\nGrand Prix of the\nAcademy of Sciences\nwith his paper\nExamen d'une proposition de Legendre relative à la Théorie des nombres\nⓉ\n(\nConsideration of a proposal concerning Legendre's number theory\n)\non\nLegendre\n's theory of numbers. He was awarded one half of the\n3000\nfranc prize.\nIt looks as if Dupré was somewhat unhappy with the reaction to his work in number theory. He certainly undertook no further work in number theory following the prize announcement and, for the last ten years of his career, he studied the mechanical theory of heat. He published\n40\npapers on this topic in the\nAcademy of Sciences\nand made the concepts of thermodynamics well known in France. His work had a major influence on François Jacques Dominique Massieu\n(1832\n-\n1896)\n, a French engineer known for introducing 'free entropy' in\n1869\n, who was a colleague of Dupré's in Rennes during the\n1860\ns. Massieu in turn influenced the work of\nWillard Gibbs\n.\nDuring the\n1860\ns Dupré published a series of memoirs on the mechanical theory of heat in the\nAnnales de Chimie et de Physique\n. Dupré's son, Paul Dupré, who became well-known for experimental work in physics particularly involving capillary forces and surface tension in liquids, undertook some joint work with his father which was reported on in some of these memoirs. In his fifth, sixth and seventh memoirs on the mechanical theory of heat Athanase Dupré applied the principles of thermodynamics to capillary action. His son Paul had devised some ingenious experiments to find how surface tension affected capillary action and these played an important role in Dupré's memoirs. In\n1866\nAthanase and Paul Dupré jointly published the article\nOn the law of the union of simple substances, and on attractions at small distances\n. They begin this paper as follows:-\nThe use of weighings in measuring work and molecular forces leads to a precision which has not been hitherto attained. It has become possible to commence the study of attractions at small distances; and there is reason to hope for an early and considerable progress in those branches of the physical sciences which are more directly connected with molecular mechanics.\nAt a meeting of the\nAcademy of Sciences\n, held on Monday\n19\nNovember\n1866\n, a report on Dupré's sixth memoir was recorded:-\nM Athanase Dupré addressed to the Academy a sixth memoir on the mechanical theory of heat and molecular mechanics, written in collaboration, for the experimental part, with M Paul Dupré, his son. We admire more and more the perseverance, the fertility and the ability of the great learned professor, and we regret not being able to publish soon what he has offered to the Academy, the statements at least of the many propositions that he has established, with the description of new and often curious experiments with which he confirmed his theories.\nSome of Dupré's contributions in the\n1860\ns certainly made a very considerable impact. For example, Alexandre Sauzay writes\n[\n6\n]\n:-\n... to conclude the marvels of the microscope, we cannot do better than mention a rather new discovery which is inserted in a memoir read at the '\nAcadémie des Sciences\n'\n(1866)\n, by M Athanase Dupré. Would you know, dear reader, how many molecules there may be in a drop of water? M Dupré has proved that a cube of water, visible only with a powerful microscope, contains more than a hundred and twenty-five thousand millions of molecules. The consequence of this enormous figure is, that in a cube of\n1\n25\n\\large\\frac{1}{25}\\normalsize\n2\n5\n1\n​\nof an inch, there would be found more than a hundred and twenty-five quintillions.\nSauzay was not the only one amazed by the result Dupré's. The\nJournal of the Franklin Institute\nfor\n1866\nreported\n[\n5\n]\n:-\nM Athanase Dupré calculates, for the\nAcademy of Sciences\nof Paris, that a cube of water, having a side equal to one thousandth of a millimetre,\n(\nor about six one hundred billionths of a cubic inch,\n)\ncontains more than\n125\n,\n000\n,\n000\n,\n000\n,\n000\n,\n000\n,\n000\nmolecules of that valuable compound. If any one doubts this conclusion let him show it to be false by a fair count.\nHere is another example of the impact of Dupré's work: Jacob Bikerman writes in\n[\n4\n]\nthat:-\n... the ideas of Athanase Dupré ... greatly influenced later scientists. Thus,\nLord Rayleigh\nstated: \"we cannot do better than follow the method of Dupré\". Dupré popularised the notion of surface tension which he called 'force contractile'.\nWe have mentioned above the influence that Dupré had on\nWillard Gibbs\nwho was interested in Dupré's work on surface tension as well as many other parts of his work on thermodynamics.\nGibbs\nwrote a paper in\n1878\n, published in the\nTransactions of the Connecticut Academy of Arts and Sciences\n, in which he shows his fascination with Dupré's results on surface tension:-\nAthanase Dupré has determined the surface tensions of solutions of soap by different methods. A statistical method gives for one part of common soap in\n5000\nof water a surface tension about one-half as great as for pure water, but if the tension be measured on a jet close to the orifice, the value\n(\nfor the same solution\n)\nis sensibly identical with that of pure water. He explains these different values of the surface tension of the same solution as well as the great effect on the surface tension which a very small quantity of soap or other trifling impurity may produce, by the tendency of the soap or other substance to form a film on the surface of the liquid.\nDupré entered for the\nAcademy of Sciences\n' Bordin prize for\n1866\nwith the same 'half success' as his entry on number theory. Again he was awarded one half of the prize with an honourable mention. However, he wrote a highly successful advanced textbook\nThéorie mécanique de la chaleur\nⓉ\n(\nMechanical Theory of Heat\n)\n(1869)\n, which incorporated the memoirs on the topic he had published during the\n1860\ns. Paul Dupré's experimental contributions were highlighted by his father on the title page of\nThéorie mécanique de la chaleur\nⓉ\n(\nMechanical Theory of Heat\n)\n. Athanase Dupré explains in the Preface why he wrote the treatise and also explained something of his philosophy of how mathematics and physics complement each other:-\nSince the end of the year\n1859\nI have presented to the Academy a series of memoirs on the 'Théorie mécanique de la chaleur' almost all of which were published in the 'Annales de Chimie et de Physique'. The time seems ripe to correct them, to put them in order, to fill the gaps, and to give my work a form that makes it more useful; this is a work intended to be used for teaching. ... In my opinion, the great utility of mathematical deductions is unquestionable, specific only to deliver in a rigorous manner the consequences of facts or laws provided by observation, or those assumptions that we are sometimes forced to make. We may thus be led to reject these hypotheses or accept such principles after numerous and varied checks leave us no longer in doubt.\nThe quality of this book was noted by\nMaxwell\nin a paper of\n20\nMay\n1876\n, in which he describes Dupré's book as \"very ingenious memoirs\".\nDupré's work on thermodynamics was also taken up by philosophers who saw that it said something fundamental about the universe. For example, Elme Marie Caro, the professor of philosophy in Paris, was influenced by Dupré's work. Helge Kragh explains this philosophical impact in\n[\n3\n]\n:-\nAs far as thermodynamics was concerned, Caro relied on the works of Athanase Dupré, dean of the Faculty of Science at the Collège Royal in Rennes and a recognised expert in the new mechanical theory of heat. In\n1866\nDupré had pointed out that although the first law of thermodynamics might seem to lead to an indefinite duration of the present order of nature, this was not the case if the second law was taken into account. 'Thus, in the future, the present order cannot, except for certain modifications, continue for ever. In the past, it is certain that there has been a beginning ... .' Dupré argued that the second law can have operated only in a finite span of time, and Caro adopted his argument. Neither Dupré nor Caro concluded that the world must therefore have been created by God, but it is clear from Caro's exposition that he considered the entropic argument as a welcome support for a divinely created universe.\nDupré received relatively little in the way of honours for his mathematical work in view of its importance and its quality. For example he was never elected to the\nAcademy of Sciences\n. However he did become a Knight of the Légion d'Honneur on\n14\nAugust\n1863\n. Paul Dupré continued to make physics experiments after the death of his father. A report on one of these contributions states:-\nIn\n1872\nM Paul Dupré, son of Athanase Dupré, made a disc move through air thick with smoke, being traversed by a ray of sun: he drew the streaks obtained, and found they are more elongated at the back of the disc."
}