{
  "nome_completo": "Balthasar van der Pol",
  "nome_curto": "Balthasar van der Pol",
  "ano_nascimento": "1889",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_der_Pol/",
  "lugar_nascimento": "Utrecht, The Netherlands",
  "lugar_morte": "Wassenaar, The Netherlands",
  "biografia": "Balthasar van der Pol\nwas known as Balth. His father, also named Balthazar van der Pol, was a rich tea merchant with broad cultural interests and he provided his son with ample opportunity to develop his many talents. His mother was Gerhardina Clasina Steffens. Balth attended the HBS\n(\nhogere burgerschool\n)\nin Utrecht and graduated from the\ngymnasium\nin\n1911\n. He then entered the University of Utrecht where he studied physics and mathematics until\n1916\nwhen he graduated with a degree in Physics for which he was awarded the highest distinction.\nIn\n1916\nvan der Pol went to study with John Ambrose Fleming, an English electrical engineer and physicist who was Pender Professor at University College London. Fleming was the first professor of Electrical Engineering at University College, and is well known for inventing a diode, the first thermionic valve, in\n1904\n. On\n2\nJune\n1917\nvan der Pol married Pietronetta Posthuma in London; they had a son and two daughters. After a year working with Fleming, van der Pol remained in England, but went to Cambridge to work with John Joseph Thomson at the Cavendish Laboratory. Thomson had announced his discovery of the electron in\n1897\n, a discovery which came out of his study of cathode rays. He was President of the\nRoyal Society\nduring the years that van der Pol worked with him. During his time at the Cavendish Laboratory between\n1917\nand\n1919\n, van der Pol met and became friends with Edward Appleton who, thirty years later in\n1947\n, was awarded the Nobel Prize of Physics for his contributions to understanding the ionosphere. Appleton explained the work on which van der Pol was engaged during these two years in the Cavendish Laboratory\n[\n4\n]\n:-\nVan der Pol's radio work was begun at Cambridge and was under two heads, experimental and theoretical. We can say that\nHeaviside\nhad 'invented' the ionosphere to explain Marconi's remarkable transmission by radio over the Atlantic in\n1901\n. In his theoretical work van der Pol gave a quantitative proof that, if one neglected the influence of a reflecting layer, experiment and theory were in flagrant disagreement in the case of long-distance propagation. To do this van der Pol familiarised himself with the theoretical work on the diffraction of radio waves round a conducting earth and used this to make a direct comparison between\n(\na\n)\nsignal strength predicted and\n(\nb\n)\nsignal strength received, in a practical case of radio transmission. The paper in question is in the Phil. Mag. Sept.\n1919\nand is worth consulting. ... In this work van der Pol showed great experimental skill. He made his own apparatus, as was customary in those days of J J Thomson. His triode oscillator gave him waves of about\n3\nmetres, which was about as short as anyone else had produced in those days. All this work on the dielectric constant of ionised air formed the basis of his Doctor's thesis. It was round about this same period that van der Pol and I collaborated in the study of non-linear phenomena using triode circuits to cheek our theories. Together we worked at\n(\na\n)\noscillation hysteresis and\n(\nb\n)\nforced vibrations in a non-linear system. Van der Pol's work on relaxation oscillations was, of course, entirely his own.\nAlthough most of the work for van der Pol's doctoral thesis was undertaken at Cambridge, his thesis supervisor was Willem Henri Julius, director of the Physics Laboratory of the University of Utrecht, described by\nEinstein\nas 'one of the most original exponents of solar physics'. On returning to the Netherlands in\n1919\n, van der Pol was appointed to the Teylers Museum in Haarlem named after Pieter Teyler van der Hulst, a wealthy\n18\nth\ncentury cloth merchant. An Amsterdam banker of Scottish descent, Teyler had bequeathed his fortune for the advancement of art and science.\nHendrik Lorentz\nhad been appointed director of research at Teylers in\n1910\nand under his leadership Teylers Museum conducted research in optics, electromagnetism, radio waves and atomic physics. It was an ideal environment for van der Pol who completed his doctoral thesis\nDe invloed van een geioniseerd gas op het voortschrijden van electromagnetische golven en toepassingen daarvan op het gebied der draadlooze telegraphie en bij metingen van glimlichtontladingen\nⓉ\n(\nThe effect of an ionised gas on electro-magnetic wave propagation and its application to radio, as demonstrated by glow-discharge measurement\n)\nand submitted it to the University of Utrecht. He was awarded the degree of doctor of science\n(\nwith distinction\n)\nby the University of Utrecht on\n27\nApril\n1920\n.\nIn\n1922\nvan der Pol left Teylers Museum to take up an appointment as Head Physicist at Philips Physical Laboratory in Eindhoven. The company was established in Eindhoven in\n1891\nmaking carbon-filament lamps. The physics research laboratory to which van der Pol was appointed had been founded in\n1914\n. By\n1922\nit was involved in many diverse projects from X-ray radiation to radio reception. Van der Pol later became Director of Scientific Radio Research. In\n1927\nhe was made a Knight of the Order of Oranje Nassau for establishing the first radio-telephonic communication between the Netherlands and the Dutch East Indies. He continued to work at Philips until\n1949\nbut during part of this time, from\n1938\nto\n1949\n, he held the Chair of Theoretical Electricity at the Technical University of Delft.\nLet us look at some of van der Pol's scientific contributions.\nMorris Kline\nwrites:-\nThe scientific work of Balthasar van der Pol covered pure mathematics, applied mathematics, radio, and electrical engineering. ... even in mathematics, his papers covered number theory, special functions, operational calculus and nonlinear differential equations. In this last field he was a pioneer.\nH Bremmer in\n[\n2\n]\nlists van der Pol's main contributions under the headings: propagation of radio waves; non-linear circuits: relaxation oscillations; transient phenomena, and operational calculus. Let us look first at the last of these topics on which Bremmer and van der Pol collaborated in writing the classic text\nOperational Calculus: Based on the Two-Sided Laplace Integral\n.\nArthur Erdélyi\n, reviewing the first edition published in\n1950\n, writes:-\nThis book is intended as a treatise on the application of the operational calculus in its modern form to mathematics, physics, and engineering. The authors have adopted a rather attractive and unique mode of presentation to cater to the needs of applied mathematicians and engineers. They seem to feel that on the one hand modern applications of the operational calculus require theorems under rather general conditions, and on the other hand the readers they have in mind are not interested in, or not able to follow, proofs under such general conditions. ... The book is very well written, and may be read with profit by both mathematicians and engineers. The mathematical treatment is more advanced than in most other books devoted primarily to applications, and on this account the work is not suitable as a text-book except for a graduate course for engineers or physicists of unusually strong mathematical background ...\nThis\n1950\nbook was not the first joint work of van der Pol and Bremmer on the operational calculus, for example they published two papers with the title\nModern operational calculus based on the two-sided Laplace integral\nin\n1948\n. A second edition of their text was published in\n1955\n, then a third edition in\n1987\n.\nOf course, to most mathematicians the name of van der Pol is associated with the differential equation which now bears his name. This equation first appeared in his article\nOn relaxation oscillation\npublished in the\nPhilosophical Magazine\nin\n1926\n. Details are given in several of the references\n(\nsee for example\n[\n4\n]\n,\n[\n9\n]\n,\n[\n10\n]\nand\n[\n11\n]\n)\n. Besterenko in\n[\n10\n]\nwrites:-\nWe consider the first attempts at solving nonlinear problems of the theory of oscillations. The first observation of the inapplicability of the linear theory to problems of this type was made in radio-engineering by van der Pol. We explain the history of the development of the equation carrying his name, and also the origins of the method of finding the first approximation to the solution of this equation\n(\nthe method of slowly varying coefficients\n)\n.\nWe mentioned above that van der Pol was interested in number theory.\nRobert Rankin\nsurveys his work in this area in\n[\n4\n]\n. We give an extract:-\nOf van der Pol's papers on the theory of numbers\n[\nAn electro-mechanical investigation of the\nRiemann\nZeta function in the critical strip\n(1947)]\nis perhaps the best known. In it he combined his knowledge of radio technology and number theory to advantage. In order to investigate the behaviour of the\nRiemann\nzeta-function\nζ\n(\ns\n)\n\\zeta(s)\nζ\n(\ns\n)\non the line\nR\ne\ns\n=\n1\n2\nRe s = \\large\\frac{1}{2}\\normalsize\nR\ne\ns\n=\n2\n1\n​\nhe derives a formula ... the saw-tooth\n[\npart of which\n]\nwas cut on the circumference of a paper disk and a beam of light was projected past the teeth on to a photocell. The electric current so produced eventually yielded a record, rather like an anemometer trace, of the modulus of\nζ\n(\n1\n2\n+\ni\nt\n)\n\\zeta(\\large\\frac{1}{2}\\normalsize  +it)\nζ\n(\n2\n1\n​\n+\ni\nt\n)\n, from which the first\n73\nzeros could be read off with decreasing accuracy for increasing values of t. The branch of number theory, however, which lay closest to his heart was the theory and applications of theta-functions. His published work on this subject is contained in four papers; mention should also be made of his highly individual 'Lectures on a modern unified approach to\nelliptic functions\nand elliptic integrals'\n(\nmimeographed notes\n)\ngiven at Cornell University in\n1958\n.\nAs another example of his work on number theory we mention the paper\nThe primes in\nk\n(\np\n)\nk(p)\nk\n(\np\n)\n(1951)\n.\nD H Lehmer\nwrites:-\nThis paper presents, in graphical representation, a list of primes in the quadratic field defined by a primitive cube root of unity. The diagram is based on regular hexagons and gives all primes whose norms do not exceed\n10000\n. The symmetry of the diagram produces a strikingly beautiful effect.\nMary Cartwright\ngives a full list in\n[\n4\n]\nof the honours which were give to van der Pol:-\nFrom\n1945\nto\n1946\nhe was in addition\n[\nto his other pasts\n]\nPresident of the Temporary University at Eindhoven which was founded to replace other Netherlands universities in occupied territories, and for his work as president he was made a Knight of the Order of the Netherlands Lion in\n1946\n. ... He was an outstanding figure in the various societies established to promote the study of radio. He became a member and then fellow and life member of the Institute of Radio Engineers\n(\nU.S.A.\n)\nin\n1920\n; he was Vice-President of it in\n1934\n, and was awarded its Medal of Honour in\n1935\nfor contributions to circuit theory. He was a Founder-member of the Nederlandsch Radiogenootschap, for a time its President, and later an honorary member. From\n1934\nto\n1952\nhe was Vice-President of the Union Radio Scientifique Internationale\n(\nU.R.S.I.\n)\nand from\n1957\nto\n1959\nhe represented it on the Executive Board of the International Council of Scientific Unions. He travelled widely in connection with his work, attending plenary sessions of the U.R.S.I. or telecommunications' conferences nearly every year in various foreign countries. He was an honorary member of the Institute of Radio Engineers of Australia. Many foreign academies and universities also honoured him; the Danish Academy of Technical Sciences awarded him the Valdemar Poulsen Gold Medal in\n1953\nfor outstanding contributions to radiotechnics and particularly for research in the field of electro-magnetic oscillations and wave-propagation and for international scientific cooperation and organization of technical questions relating to radio communication; the Technical University of Warsaw gave him an honorary degree in\n1956\n, and the University of Geneva in\n1959\n, and the\nFrench Academy of Sciences\nmade him a Corresponding Member in\n1957\n.\nMary Cartwright\n, who knew van der Pol personally, also writes\n[\n4\n]\n:-\nVan der Pol did much to popularize his subject; he was an engaging lecturer, and often took the opportunity of bringing together phenomena over a wide field of science which could be elucidated by a single mathematical relation such as the equation for relaxation oscillations. His summary\n[\n'The non-linear theory of electric oscillations'\n(1934)]\nof work on non-linear oscillations up to\n1934\nwas a quite masterly account of the theory up to that time. It gives many references, including some to Russian work ...\nIn fact van der Pol corresponded with\nNikolai Mitrofanovich Krylov\nabout the theory of nonlinear oscillations; a letter sent by van der Pol to\nKrylov\nis published in\n[\n9\n]\n.\nAfter his retirement in\n1949\nhe became Director of the Comité Consultatif International des Radiocommunications in Geneva. He continued in this position until\n1956\nafter which he settled to Wassenaar. However, he held a temporary professorship at the University of California, Berkeley, for the year\n1957\nand then was the Victor Emanuel Professorship at Cornell in Ithaca, New York, in\n1958\n."
}