{
  "nome_completo": "Benjamin Gompertz",
  "nome_curto": "Benjamin Gompertz",
  "ano_nascimento": "1779",
  "ano_morte": "1865",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gompertz/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "Benjamin Gompertz\ncame from a family of merchants who left Holland and settled in England. He was one of three sons born in England to a Dutch family which, although from Holland, was Jewish. His mother, Leah Cohen, was the second wife of the diamond merchant Solomon Barent Gompertz. Benjamin was self educated, learning mathematics by reading\nNewton\nand\nMaclaurin\n. He had to take this route because he was denied admission to universities since he was Jewish. In fact he was greatly helped in his mathematical education by the\nSpitalfields Mathematical Society\nwhich was later to become the\nLondon Mathematical Society\n. Gompertz, writing to\nDe Morgan\n, explained how he came to be a member of the Society\n[\n6\n]\n:-\nAs to the Mathematical Society, of which I was a member when only\n18\nyears of age, having been, contrary to the rules, elected under the age of\n21\n. How I came to be a member of that Society - and continued so until it joined the\nRoyal Astronomical Society\n, and then was the President - was: I happened to pass a bookseller's small shop of second hand books, kept by a poor taylor, but a good mathematician, John Griffiths. I was very pleased to meet a mathematician, and I asked him if he would give me some lessons; and his reply was that I was more capable to teach him, but he belonged to a society of mathematicians, and he would introduce me. I accepted the offer, and I was elected, and had many scholars then to teach, as one of the rules was, if a member asked for information, and applied to one who could give it, he was obliged to give it, or be fined one penny.\nOn\n10\nOctober\n1810\nGompertz married Abigail Montefiore, who came from a wealthy Jewish family with strong links with the stock exchange, at the Hambro Synagogue, London. They had three children, a daughter Justina Lydia born in\n1811\n, a son Joseph born in\n1814\n, and a second daughter Juliana born one year later. Gompertz himself joined the stock exchange in\n1810\nand he became a Fellow of the\nRoyal Society\nin\n1819\n. The following year he read a paper to the Society which applied the differential calculus to the calculation of life expectancy. In\n1824\n, the year his\n10\nyear old son died, Gompertz was appointed as actuary and head clerk of the Alliance Assurance Company. This company had been set up by Sir Moses Montefiore, the brother of Gompertz's wife, at least in part to put Gompertz's mathematical and actuarial skills to good use.\nGompertz applied the calculus to actuarial questions and he is best remembered for\nGompertz's Law of Mortality\n. Gompertz, in\n1825\n, showed that the mortality rate increases in a\ngeometric progression\n(\nsee\n[\n10\n]\n)\n. Hence, when death rates are plotted on a logarithmic scale, a straight line known as the Gompertz function is obtained. It is the most informative actuarial function for investigating the ageing process. The slope of the Gompertz function line indicates the rate of actuarial ageing. The differences in longevity between species are the result primarily of differences in the rate of ageing and are therefore expressed in differences in slope of the Gompertz function. His expertise on life tables was recognised at the highest level\n[\n2\n]\n:-\nHis expertise in this area led to his being consulted by government, including giving evidence to the select parliamentary committees on friendly societies in\n1825\nand\n1827\n, and he did important computational work for the army medical board. His insights have remained central to the study of human mortality.\nHowever, Tropp writes in\n[\n1\n]\n:-\n[\nGompertz's\n]\nrigid adherence to\nNewton\n's fluxional notation prevented wide recognition of his accomplishment, but he must be rated as a pioneer in actuarial science and one of the great amateur scholars of his day.\nGompertz also wrote about scientific instruments, writing\nTheory of astronomical instruments\n(1822)\n,\nA new instrument called the differential sextant\n(1825)\nand\nOn the converted pendulum\n(1829)\n. He was an early member of the\nRoyal Astronomical Society\nand served on its Council from\n1821\nto\n1829\n. In particular he assisted Francis Baily in producing a catalogue of fixed stars. This venture began at a Council meeting on\n30\nNovember\n1820\nin Baily's house when a request for accurate tables was put forward to which the Council agreed to do their best. Gompertz assisted Baily in calculating positions of stars which was eventually published as Baily's Catalogue giving the constants for\n3000\nfixed stars.\nGompertz was a founder member of the\nRoyal Statistical Society\nin\n1834\n. He retired from his positions in\n1848\nbut he took this as simply an opportunity to throw himself more vigorously into his mathematical studies. He published the mathematical work\nHints on Porisms\nin\n1850\nand contributed a paper on the topic for which he is most famed, namely human mortality, to the International Statistical Congress of\n1860\n. Although\n86\nyears old at the time that the\nLondon Mathematical Society\nwas proposed in November\n1864\n, he was enthusiastic about the project which he joined after it was properly established at its first meeting on\n16\nJanuary\n1865\n. It was decided at this meeting that the Society would publish a journal, the\nProceedings of the London Mathematical Society\n, and Gompertz began work on a paper which he intended to submit for publication. Sadly he died of a paralytic seizure at his home before he could complete the paper.\nThe quality of Gompertz's contributions is rightly praised by Miller in\n[\n2\n]\n:-\nGompertz's capacity for sustained, complex computation underlay all his work in whatever field. Tables of lives and tables of stars were generated by the same qualities and both represented a rationalizing spirit which informed the social philosophy of Gompertz and his friends ..."
}