{
  "nome_completo": "Benjamin Fedorovich Kagan",
  "nome_curto": "Benjamin Fedorovich Kagan",
  "ano_nascimento": "1869",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kagan/",
  "lugar_nascimento": "Shavli, Kovno (now Kaunas, Lithuania)",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Benjamin Fedorovich Kagan\n's father Fedor Kagan was a clerk. Kagan entered Novorossysky University in Odessa in\n1887\n. He was expelled in\n1889\nfor participating in the Democratic Students Movement. He was sent to Ekaterinoslav in south-central Ukraine. The Soviets renamed Ekaterinoslav in\n1926\ncalling it Dnepropetrovsk.\nIn\n1892\nKagan received a degree from Kiev University, then in\n1895\nhe was awarded a Master's Degree by St Petersburg University.\nHe taught at Novorossysky from\n1897\nuntil\n1922\n, becoming a professor there in\n1917\n. However this was not his only post during this period for he taught higher education classes for women and also taught at the local Jewish school. As if this was not enough, Kagan also edited the\nJournal of Experimental Physics and Elementary Mathematics\nfrom\n1902\nuntil\n1917\nand he was the director of a large publisher of scientific materials Mathesis.\nIn\n1922\nhe went to Moscow when the Department of\nDifferential Geometry\nwas founded at Moscow State University. Kagan was the first Head of Department and he founded an important School of Differential Geometry. He retained his interest in publishing, however, and he was the director of the science department of a state publisher for ten years. He also directed the department of mathematics and natural sciences of the\nGreat Soviet Encyclopaedia\n.\nIn\n1927\n, Kagan organised a seminar on vector and tensor analysis. He founded a publication associated with this seminar\nTransactions of the seminar on Vector and Tensor Analysis with its applications to Geometry, Mechanics and Physics\nin\n1933\n. In\n1934\nKagan and other members of his School organised an International conference on differential geometry which took place at Moscow University.\nKagan worked on the foundations of geometry and his first work was on\nLobachevsky\n's geometry. In\n1902\nhe proposed axioms and definitions very different from\nHilbert\n. Kagan studied\ntensor\ndifferential geometry after going to Moscow because of an interest in relativity.\nKagan wrote a history of\nnon-euclidean\ngeometry and also a detailed biography of\nLobachevsky\n. He edited\nLobachevsky\n's complete works which appeared in five volumes between\n1946\nand\n1951\n."
}