{
  "nome_completo": "Benjamin Bramer",
  "nome_curto": "Benjamin Bramer",
  "ano_nascimento": "1588",
  "ano_morte": "1652",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bramer/",
  "lugar_nascimento": "Felsberg, Germany",
  "lugar_morte": "Ziegenhain, Germany",
  "biografia": "Benjamin Bramer\n's father was a minister in the Protestant Church but he sadly died when his son Benjamin was three years old. Benjamin had a much older sister who was married, and this sister and her husband, who was the mathematician and instrument maker\nBürgi\n, became Benjamin's foster parents on the death of his father. Benjamin was taken to their home in Kassel and there he was brought up. Although, of course, nothing could compensate for the death of his father, nevertheless Benjamin was very fortunate, for in\nBürgi\nhe had one of the most skilful private tutors that any young boy of the time could have had.\nBürgi\ntutored Bramer in a wide range of subjects but it was mathematics that he loved and he passed this love on to Bramer. As he grew older Bramer became interested in combining his skills in mathematics with architecture as we explain below.\nThe Holy Roman Emperor Rudolf II was trying to establish a science centre in Prague and had learnt of\nBürgi\n's exceptional skills as an instrument maker.\nBürgi\nwas appointed to the imperial court in Prague and Bramer went with him to Prague when he was\n16\nyears old, remaining there for about five years. The move in no way disrupted Bramer's education for he had none other than the instruction he received from his foster father\n(\nwho was also of course his brother-in-law\n)\n. Bramer left Prague in\n1609\nand returned to Kassel. He was soon in demand for his skills in architecture, particularly in fortifications, but before we give some details of the various projects he worked on it is useful to examine the political background.\nIn\n1567\n, on the death of Philip the Magnanimous,  Hesse was partitioned into four landgraviates, with Marburg as the centre of the independent Hesse-Marburg landgraviate with William IV \"The Wise\" as Landgrave. In\n1604\n, the year Bramer left Kassel for Prague, parts this landgraviate was added to the landgraviate of Hesse-Kassel under the control of the Landgrave Moritz \"The Learned\", with Kassel as the capital of the landgraviate. Moritz turned Protestant in\n1605\n, so it was to the landgraviate of Hesse-Kassel that Bramer returned in\n1609\nwith tensions rising between a Protestant Landgrave and the Roman Catholic Church. The Landgrave Moritz saw the potential in the skilful young man Bramer who was soon employed by him in directing the constructions of fortifications and castles within the landgraviate of Hesse-Kassel. He was appointed as master builder to the court in Marburg by the Landgrave Moritz in\n1612\n.\nIn\n1618\nBramer advised Count Christian von Waldeck on building a new church in the city of Widungen\n[\n1\n]\n:-\n... it is of special importance because it is one of the earliest plans to introduce central church construction into Protestant German church architecture.\nThe church, however, was never built for\n1618\nwas the year in which the King of Bohemia attempted to impose the Roman Catholic religion on all his territories and the Protestant Landgraves fought to preserve their religious beliefs. With the outbreak of war there were more important building projects for Bramer to undertake than building churches. He switched to working on the construction of fortifications of Marburg castle and the town of Marburg. On\n16\nFebruary\n1625\nBramer became a naturalised citizen of Marburg and later that year he became consultant to the Count of Solms on improving the fortress at Rheinfels. This fortress, on the Rhine near St Goar, was one of the largest on the Rhine and its foundations had been laid nearly\n400\nyears before Bramer was called to advise on improvements. It had been the subject of one of\nDürer\n's paintings more than\n100\nyears earlier.\nA modern picture of the ruins of the fortress of Rheinfels is at\nTHIS LINK\n.\nThe war which had begun in\n1618\nended five years later with victory for the Roman Catholic side but this was certainly not an end to conflict in the region. Denmark saw an opportunity to gain territory and another conflict began in\n1625\nwhich lasted until\n1629\nwhen Denmark was defeated. Sweden, which was anti-Catholic, then invaded and many of the Protestant Landgraves supported the invading armies. Bramer was in charge of the fortifications of Kassel from\n1630\nto\n1634\n. One must not think that the fighting was a simple conflict between Protestant and Roman Catholic forces. It was much more complicated with Roman Catholicism, Lutheranism, and Calvinism all attempting to gain the upper hand. Kassel became a centre of Calvinist Protestantism in Germany and strong fortifications had to be built to protect it against all its enemies. After working on the Kassel fortifications, Bramer switched in November\n1635\nto become master builder and treasurer to the fortress of Ziegenhain south of Kassel. Bramer remained at Ziegenhain for the rest of his life. It was not a peaceful time, however, and it was only after the Treaty of Westphalia in\n1648\nthat peace returned. This must have given Bramer some satisfaction coming near the end of his life, for it give full sovereignty to the states of the Holy Roman Empire and ended the domination of the Roman Catholic Church.\nLet us now look at Bramer's scientific achievements. His first publication in\n1617\nwas\nProblema wie aus bekannt gegebenem sinu eines Grades, Minuten oder Sekunden alle folgenden sinus aufs leichtests zu finden und der canon sinuum zu absolvieren sei\nⓉ\n(\nProblem as announced about the sine of a degree, minutes or seconds ...\n)\non the calculation of sines. He also published on the vacuum\nKurze Meldung vom Vacuo oder leerem Orte, neben anderen wunderbaren und subtilen Quaestionen, desgleichen Nic Cusani Dialogus von Waag und Gewicht\nⓉ\n(\nShort Message about vacua or empty space, in addition to other wonderful and subtle questions, ...\n)\n[\n1\n]\n:-\nThe problem of empty space, which had been under active investigation since classical times, was of special topical interest in the seventeenth century. On this matter Bramer held the views of Tommaso Campanella, the contemporary and follower of\nGalileo\n.\nBramer followed\nAlberti\n(1435)\n,\nDürer\n(1525)\nand\nBürgi\n(1604)\nwhen in\n1630\nhe constructed a device that enabled one to draw accurate geometric perspective. The instrument had been described in a\n1617\npublication\nTrigonometrica planorum mechanica oder Unterricht und Beschreibung eines neuen und sehr bequemen geometrischen Instrumentes zu allerhand Abmessung\nⓉ\n(\nTrigonometrical plane mechanics, or instruction and description of a new and very convenient geometrical instrument for all sorts of dimensions.\n)\n. Bramer designed several other mathematical instruments, for example a description of the pantograph appears in the same\n1617\npublication. The instrument is designed to copy a geometric shape and reproduce it at a reduced or enlarged scale. It consists of an assemblage of rigid bars adjustably joined by pin joints; as the point of one bar is moved over the outline to be duplicated, the motion is translated to a point on another bar, which makes the desired copy according to the predetermined scale. Bramer has not been recognised as the inventor of the pantograph, this distinction going to the Jesuit Christoph Scheiner who describes a similar instrument in his\n1631\npublication\nPantographice seu acre delineandi res quaslibet by parallelogrammum linear seu cavum mechanicum, mobile\nⓉ\n(\nThe Pantograph: or area delineated by an extraordinary parallelogram linear or hollow mobile mechanical device\n)\n. Although Scheiner's publication did much to spread knowledge of the pantograph, the instrument he describes is technically inferior to the earlier instrument as described by Bramer."
}