{
  "nome_completo": "Benjamin Peirce",
  "nome_curto": "Benjamin Peirce",
  "ano_nascimento": "1809",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peirce_Benjamin/",
  "lugar_nascimento": "Salem, Massachusetts, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Benjamin Peirce\n's parents were Lydia Ropes Nichols and Benjamin Peirce. Benjamin, the subject of this biography, therefore had the same name as his father who was both a state legislator in Massachusetts and also a librarian at Harvard College.  We note that this surname is pronounced \"Purse\". Although Harvard had been established for around\n170\nyears at the time of Benjamin's birth, it was still under fairly tight political control and was not an institution of true national standing. This would change through Peirce's life long association with Harvard as its influence steadily increased. Benjamin was a pupil at Salem Private Grammar School and there he became friends with Henry Ingersoll Bowditch who was one of the eight children of\nNathaniel Bowditch\nand his wife Mary Ingersoll.\nPeirce entered Harvard College in\n1825\nand graduated four years later. During these years he assisted his friend Ingersoll Bowditch's father.\nBowditch\n's translation of the first four volumes of\nLaplace\n's\nTraite de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\nhad been completed by\n1818\nbut he had still not published it during the years that Peirce was an undergraduate. Almost certainly the cost of publication caused the delay, but\nBowditch\nhad not put the work on one side after\n1818\n, still continuing to improve it over the succeeding years. While he was an undergraduate, Peirce became involved in\nBowditch\n's project and worked through the text doing proof-reading and suggesting improvements.\nPeirce taught at George Bancroft's Round Hill School in Northampton, Massachusetts, from\n1829\nto\n1831\n, and then was appointed as a tutor at Harvard College in\n1831\n, two years after graduating. He was awarded a Master's Degree by Harvard in\n1833\nand in the same year he married Sarah Hunt Mills, the daughter of Senator Elijah Hunt Mills. Benjamin and Sarah Peirce had four sons and one daughter, among them\nCharles Peirce\n(\nwho also has a biography in this archive\n)\nand James Mills Peirce who taught in the Mathematics Department at Harvard, and then from\n1890\nto\n1895\nserved as Dean of the Graduate School at Harvard and, after that, as Dean of the Faculty of Arts and Sciences. Their other two sons also enjoyed successful careers, Benjamin Mills Peirce as a mining engineer and Herbert Henry Davis Peirce as a diplomat.\nIt was at Harvard that Peirce spent the whole of his career from\n1831\n. Appointed professor of Mathematics and Natural Philosophy there in\n1833\nhe held this position for nine years until the professorship of Mathematics and Astronomy became vacant when he was moved to that chair. His first chair was not endowed, but the chair he was appointed to in\n1842\nwas the endowed Perkins Professorship and he went on to hold this until his death.\nIn the early part of his career Peirce published a number of textbooks. For example\nAn Elementary Treatise on Plane Trigonometry\n(1835)\n,\nFirst Part of an Elementary Treatise on Spherical Trigonometry\n(1836)\n,\nAn Elementary Treatise on Sound\n(1836)\n,\nAn Elementary Treatise on Algebra : To which are added Exponential Equations and Logarithms\n(1837)\n,\nAn Elementary Treatise on Plane and Solid Geometry\n(1837)\n,\nAn Elementary Treatise on Plane and Spherical Trigonometry\n(1840)\n, and\nAn Elementary Treatise on Curves, Functions, and Forces\nVol\n1\n(1841)\n, Vol\n2\n(1846)\n. These books were original and mathematically elegant but were rather too demanding for the American students of the time. The students found them too concise and all but the very best students also found his lecturing style very difficult\n[\n7\n]\n:-\nHe lectured without stopping for questions and filled the blackboard with a mass of scribblings. The best students, however, were able to appreciate his quirks and were inspired by his enthusiasm for mathematics.\nIn\n[\n3\n]\nArchibald quotes the opinion of Lawrence Lowell, one of the best students that Peirce taught:-\nAs soon as he had finished the problem or filled the blackboard he would rub everything out and begin again. He was impatient of detail, and sometimes the result would not come out right; but instead of going over his work to find the error, he would rub it out, saying that he had made a mistake in a sign somewhere, and that we should find it when we went over our notes. Described in this way it may seem strange that such a method of teaching should be inspiring; yet to us it was so to the highest degree. We were carried along by the rush of his thought, by the ease and grasp of his intellectual movement.\nIf the average student could not cope with the mathematics that Peirce was presenting them with, then he decided it was better he saw only the more talented and dedicated students continue with mathematics beyond their first year. He proposed three different tracks from which the students could make a choice. One option was a one year practical course, the second was a one year theoretical course designed primarily for school teachers, and the third option was a three year course which would train mathematicians of the future. After the Lawrence Scientific School was founded at Harvard in\n1847\n, Peirce was able to teach graduate level mathematics for the first time in the United States. The course he set up was impressive, including the study of works of\nLacroix\n,\nCauchy\n,\nMonge\n,\nBiot\n,\nHamilton\n,\nLaplace\n,\nPoisson\n,\nGauss\n,\nLe Verrier\n,\nBessel\n,\nAdams\n,\nAiry\n,\nMacCullagh\nand\nFranz Neumann\n. It was a truly ambition course but it was somewhat ahead of its time and he taught it to only about two students per year.\nPeirce undertook research on a wide range of mathematical topics from celestial mechanics and geodesy on the applied side to linear associative algebra and\nnumber theory\non the pure side. In an early number theory paper he proved that there is no odd\nperfect number\nwith fewer than four distinct\nprime\nfactors. He also revised and wrote a commentary on\nBowditch\n's translation of the first four volumes of\nLaplace\n's\nTraité de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\nwhich he had himself had proof-read as an undergraduate student. Only three of these volumes appeared in\nBowditch\n's lifetime, and Peirce himself completed editing the fourth volume and saw it through publishing.\nPeirce helped determine the orbit of Neptune\n(\ndiscovered in\n1846)\nand calculated the perturbations produced by Neptune on the orbit of Uranus and on the other planets. In fact he held controversial views on this topic for he claimed that the predictions for the position of the planet perturbing Uranus as made by\nLe Verrier\nand\nAdams\ndid not coincide with the planet Neptune which Galle discovered. He also claimed that Neptune was not following the orbit predicted by\nLe Verrier\nand\nAdams\n.\nIn\n1852\n, Peirce introduced methods into the theory of errors applied to observations which would allow faulty observations to be discarded. There was an interesting consequence of this, namely that he was called as an expert witness in a court case in\n1856\n(\nsee\n[\n14\n]\n)\n. The case concerned the forging of the signature of Sylvia Ann Howland on a contested will. Peirce examined the thirty downward lines in the signature and measured the angle of each. He then claimed that the comparison of these angles with those of another of Sylvia Ann Howland's signatures was so great that the alleged forged signature must indeed be a forgery and must have been traced. To support his claims he did a statistical analysis of the angles of the downstrokes in\n42\ngenuine Sylvia Ann Howland signatures. There are weaknesses in Peirce's statistical arguments which are pointed out in\n[\n14\n]\n, particularly concerning the independence of the probabilities he considered. Perhaps it was fortunate that the case was decided on the basis of a legal formality and Peirce's evidence was not crucial in determining the outcome of the case. One of the nice things about\n[\n14\n]\nis that the authors give all the signatures that Peirce worked with, so we can all play at being expert witnesses ourselves!\nIn\n1870\nPeirce published, at his own expense,\nLinear Associative Algebra\na classification of all complex associative algebras of dimension less than seven. He used the, now familiar, tools of\nidempotent\nand\nnilpotent\nelements\n(\nterms invented by Peirce\n)\nto establish the foundations of a general theory of linear associative algebra and he presented multiplication tables for over\n150\nnew algebras in the book. He had been much influenced by\nHamilton\n's work on the\nquaternions\nto develop this particular line of algebraic thinking. Pycior discusses this work in\n[\n19\n]\nwhere she claims:-\nBenjamin Peirce deserves recognition, not only as a founding father of American mathematics, but also as a founding father of modern abstract algebra.\nPeirce read the text before the National Academy of Sciences in Washington in\n1870\nbefore circulating\n100\nlithographed copies\n[\n10\n]\n:-\nPeirce had presented some of his results from\n1867\nonwards to the National Academy of Sciences, of which he had been appointed a founder member four years earlier; but they could not afford to print it. Thus, in an initiative taken by Coast Survey staff, a lady without mathematical training but possessing a fine hand was found who could both read his ghastly script and write out the entire text\n12\npages at a time on lithograph stones.\nHis son\nCharles Peirce\nlater edited the work for publication in the\nAmerican Journal of Mathematics\nin\n1881\n.\nThere is another side to Peirce's career which we still have to mention. He was involved in a major way in the United States Coast Survey, as director of the longitude determinations in\n1852\nthen he as made director of the United States Coast Survey in\n1867\non the death of the then director Alexander Dallas Bache. He continued as director until\n1874\nand as well as overseeing the production of a map of the United States, he organised expeditions by the Survey to Sicily, Nagasaki, the Chatham Islands, and Alaska to observe astronomical events. He said in his address as the end of his presidency of the American Association for the Year\n1853\n[\n17\n]\n:-\nIn astronomy ... it must be conceded that Saturn and Jupiter, Mars and Venus, are yet subject to unexplained irregularities of motion; that the theory of the asteroids has not advanced beyond the earliest stage of arithmetic; that the rings of Saturn are connected with their primary by a\n[\nmysterious\n]\n... force; and the laws under which the tides obey the attractions of the sun and moon are quite undeveloped. The remarkable researches upon this subject made in the Coast Survey, have established that here still remains another world to be conquered ...\nIn\n[\n17\n]\nPeirce shows that he strongly believes in mathematics:-\n... it is the great master-key, which unlocks every door of knowledge, and without which no discovery - no discovery which deserves the name, which is law and not isolated fact - has been or ever can be made.\nHowever, he warns against pure mathematics for its own sake:-\nFascinated by its symmetry, the geometer may, at times, have been too exclusively engrossed with his science, forgetful of its applications; he may have exalted it into his idol, and worshipped it; he may have degraded it into his toy, and childishly amused himself with the singular shapes which it would assume, when he should have been hard at work with it, using it for the benefit of mankind ...\nGiven this statement it is slightly strange that Peirce has been called the \"Father of pure mathematics\" in America\n(\nsee for example\n[\n4\n]\n)\n.\nBenjamin Peirce received many honours for his outstanding contributions to American mathematics. He worked for the establishment of the American Association for the Advancement of Science\n(\nfounded\n1847)\nand the\nNational Academy of Sciences\n(\nUnited States\n)\n(\nfounded\n1863)\n. Peirce was one of a committee of five set up by the\nAmerican Academy of Arts and Sciences\nin\n1847\nto organise the Smithsonian Institution. He was also appointed to a scientific council of three who organised the Dudley Observatory at Albany, New York, from\n1955\nto\n1858\n. Peirce was elected to the American Philosophical Society\n(1842)\n, the\nRoyal Astronomical Society\n(1850)\n, and the\nRoyal Society\n(1852)\n.\nLet us finally note that Peirce was a devout Christian and saw\n[\n10\n]\n:-\n... mathematics as study of God's work by God's creatures.\nPeirce expands on this at length in\n[\n17\n]\n. We give a short quote:-\nThere is proof enough furnished by every science, but by none more than geometry, that the world to which we have been allotted is peculiarly adapted to our minds, and admirably fitted to promote our intellectual progress. There can be no reasonable doubt that it was part of the Creator's plan. How easily might the whole order have been transposed! How readily might we have been assigned to some complicated system which our feeble and finite powers could not have unravelled!"
}