{
  "nome_completo": "Georg Friedrich Bernhard Riemann",
  "nome_curto": "Bernhard Riemann",
  "ano_nascimento": "1826",
  "ano_morte": "1866",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Riemann/",
  "lugar_nascimento": "Breselenz, Hanover (now Germany)",
  "lugar_morte": "Selasca, Italy",
  "biografia": "Bernhard Riemann\n's father, Friedrich Bernhard Riemann, was a Lutheran minister. Friedrich Riemann married Charlotte Ebell when he was in his middle age. Bernhard was the second of their six children, two boys and four girls. Friedrich Riemann acted as teacher to his children and he taught Bernhard until he was ten years old. At this time a teacher from a local school named Schulz assisted in Bernhard's education.\nIn\n1840\nBernhard entered directly into the third class at the Lyceum in Hannover. While at the Lyceum he lived with his grandmother but, in\n1842\n, his grandmother died and Bernhard moved to the Johanneum\nGymnasium\nin Lüneburg. Bernhard seems to have been a good, but not outstanding, pupil who worked hard at the classical subjects such as Hebrew and theology. He showed a particular interest in mathematics and the director of the Gymnasium allowed Bernhard to study mathematics texts from his own library. On one occasion he lent Bernhard\nLegendre\n's book on the theory of numbers and Bernhard read the\n900\npage book in six days.\nIn the spring of\n1846\nRiemann enrolled at the University of Göttingen. His father had encouraged him to study theology and so he entered the theology faculty. However he attended some mathematics lectures and asked his father if he could transfer to the faculty of philosophy so that he could study mathematics. Riemann was always very close to his family and he would never have changed courses without his father's permission. This was granted, however, and Riemann then took courses in mathematics from Moritz Stern and\nGauss\n.\nIt may be thought that Riemann was in just the right place to study mathematics at Göttingen, but at this time the University of Göttingen was a rather poor place for mathematics.\nGauss\ndid lecture to Riemann but he was only giving elementary courses and there is no evidence that at this time he recognised Riemann's genius. Stern, however, certainly did realise that he had a remarkable student and later described Riemann at this time saying that he:-\n... already sang like a canary.\nRiemann moved from Göttingen to Berlin University in the spring of\n1847\nto study under\nSteiner\n,\nJacobi\n,\nDirichlet\nand\nEisenstein\n. This was an important time for Riemann. He learnt much from\nEisenstein\nand discussed using complex variables in\nelliptic function\ntheory. The main person to influence Riemann at this time, however, was\nDirichlet\n.\nKlein\nwrites in\n[\n4\n]\n:-\nRiemann was bound to\nDirichlet\nby the strong inner sympathy of a like mode of thought.\nDirichlet\nloved to make things clear to himself in an intuitive substrate; along with this he would give acute, logical analyses of foundational questions and would avoid long computations as much as possible. His manner suited Riemann, who adopted it and worked according to\nDirichlet\n's methods.\nRiemann's work always was based on intuitive reasoning which fell a little below the rigour required to make the conclusions watertight. However, the brilliant ideas which his works contain are so much clearer because his work is not overly filled with lengthy computations. It was during his time at the University of Berlin that Riemann worked out his general theory of complex variables that formed the basis of some of his most important work.\nIn\n1849\nhe returned to Göttingen and his Ph.D. thesis, supervised by\nGauss\n, was submitted in\n1851\n. However it was not only\nGauss\nwho strongly influenced Riemann at this time.\nWeber\nhad returned to a chair of physics at Göttingen from Leipzig during the time that Riemann was in Berlin, and Riemann was his assistant for\n18\nmonths. Also\nListing\nhad been appointed as a professor of physics in Göttingen in\n1849\n. Through\nWeber\nand\nListing\n, Riemann gained a strong background in theoretical physics and, from\nListing\n, important ideas in\ntopology\nwhich were to influence his ground breaking research.\nRiemann's thesis studied the theory of complex variables and, in particular, what we now call Riemann surfaces. It therefore introduced topological methods into complex function theory. The work builds on\nCauchy\n's foundations of the theory of complex variables built up over many years and also on\nPuiseux\n's ideas of branch points. However, Riemann's thesis is a strikingly original piece of work which examined geometric properties of analytic functions,\nconformal mappings\nand the connectivity of surfaces.\nIn proving some of the results in his thesis Riemann used a variational principle which he was later to call the\nDirichlet\nPrinciple since he had learnt it from\nDirichlet\n's lectures in Berlin. The\nDirichlet\nPrinciple did not originate with\nDirichlet\n, however, as\nGauss\n,\nGreen\nand\nThomson\nhad all made use if it. Riemann's thesis, one of the most remarkable pieces of original work to appear in a doctoral thesis, was examined on\n16\nDecember\n1851\n. In his report on the thesis\nGauss\ndescribed Riemann as having:-\n... a gloriously fertile originality.\nOn\nGauss\n's recommendation Riemann was appointed to a post in Göttingen and he worked for his\nHabilitation\n, the degree which would allow him to become a lecturer. He spent thirty months working on his Habilitation dissertation which was on the representability of functions by trigonometric series. He gave the conditions of a function to have an integral, what we now call the condition of Riemann integrability. In the second part of the dissertation he examined the problem which he described in these words:-\nWhile preceding papers have shown that if a function possesses such and such a property, then it can be represented by a\nFourier series\n, we pose the reverse question: if a function can be represented by a trigonometric series, what can one say about its behaviour.\nTo complete his Habilitation Riemann had to give a lecture. He prepared three lectures, two on electricity and one on geometry.\nGauss\nhad to choose one of the three for Riemann to deliver and, against Riemann's expectations,\nGauss\nchose the lecture on geometry. Riemann's lecture\nÜber die Hypothesen welche der Geometrie zu Grunde liegen\nⓉ\n(\nOn the hypotheses at the foundations of geometry\n)\n, delivered on\n10\nJune\n1854\n, became a classic of mathematics.\nThere were two parts to Riemann's lecture. In the first part he posed the problem of how to define an\nn\nn\nn\n-dimensional space and ended up giving a definition of what today we call a Riemannian space.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nIt possesses shortest lines, now called geodesics, which resemble ordinary straight lines. In fact, at first approximation in a geodesic coordinate system such a metric is flat Euclidean, in the same way that a curved surface up to higher-order terms looks like its\ntangent\nplane. Beings living on the surface may discover the curvature of their world and compute it at any point as a consequence of observed deviations from\nPythagoras\n's theorem.\nIn fact the main point of this part of Riemann's lecture was the definition of the curvature\ntensor\n. The second part of Riemann's lecture posed deep questions about the relationship of geometry to the world we live in. He asked what the dimension of real space was and what geometry described real space. The lecture was too far ahead of its time to be appreciated by most scientists of that time. Monastyrsky writes in\n[\n6\n]\n:-\nAmong Riemann's audience, only\nGauss\nwas able to appreciate the depth of Riemann's thoughts. ... The lecture exceeded all his expectations and greatly surprised him. Returning to the faculty meeting, he spoke with the greatest praise and rare enthusiasm to Wilhelm\nWeber\nabout the depth of the thoughts that Riemann had presented.\nIt was not fully understood until sixty years later.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nThe general theory of relativity splendidly justified his work. In the mathematical apparatus developed from Riemann's address,\nEinstein\nfound the frame to fit his physical ideas, his\ncosmology\n, and\ncosmogony\n: and the spirit of Riemann's address was just what physics needed: the metric structure determined by data.\nSo this brilliant work entitled Riemann to begin to lecture. However\n[\n6\n]\n:-\nNot long before, in September, he read a report \"On the Laws of the Distribution of Static Electricity\" at a session of the Göttingen Society of Scientific researchers and Physicians. In a letter to his father, Riemann recalled, among other things, \"the fact that I spoke at a scientific meeting was useful for my lectures\". In October he set to work on his lectures on\npartial differential equations\n. Riemann's letters to his dearly-loved father were full of recollections about the difficulties he encountered. Although only eight students attended the lectures, Riemann was completely happy. Gradually he overcame his natural shyness and established a rapport with his audience.\nGauss\n's chair at Göttingen was filled by\nDirichlet\nin\n1855\n. At this time there was an attempt to get Riemann a personal chair but this failed. Two years later, however, he was appointed as professor and in the same year,\n1857\n, another of his masterpieces was published. The paper\nTheory of\nabelian functions\nwas the result of work carried out over several years and contained in a lecture course he gave to three people in\n1855\n-\n56\n. One of the three was\nDedekind\nwho was able to make the beauty of Riemann's lectures available by publishing the material after Riemann's early death.\nThe abelian functions paper continued where his doctoral dissertation had left off and developed further the idea of Riemann surfaces and their topological properties. He examined multi-valued functions as single valued over a special Riemann surface and solved general inversion problems which had been solved for elliptic integrals by\nAbel\nand\nJacobi\n. However Riemann was not the only mathematician working on such ideas.\nKlein\nwrites in\n[\n4\n]\n:-\n... when\nWeierstrass\nsubmitted a first treatment of general abelian functions to the\nBerlin Academy\nin\n1857\n, Riemann's paper on the same theme appeared in\nCrelle\n's Journal, Volume\n54\n. It contained so many unexpected, new concepts that\nWeierstrass\nwithdrew his paper and in fact published no more.\nThe\nDirichlet\nPrinciple which Riemann had used in his doctoral thesis was used by him again for the results of this\n1857\npaper.\nWeierstrass\n, however, showed that there was a problem with the\nDirichlet\nPrinciple.\nKlein\nwrites\n[\n4\n]\n:-\nThe majority of mathematicians turned away from Riemann ... Riemann had quite a different opinion. He fully recognised the justice and correctness of\nWeierstrass\n's critique, but he said, as Weierstrass once told me, that he appealed to\nDirichlet\n's Principle only as a convenient tool that was right at hand, and that his existence theorems are still correct.\nWe return at the end of this article to indicate how the problem of the use of\nDirichlet\n's Principle in Riemann's work was sorted out.\nIn\n1858\nBetti\n,\nCasorati\nand\nBrioschi\nvisited Göttingen and Riemann discussed with them his ideas in topology. This gave Riemann particular pleasure and perhaps\nBetti\nin particular profited from his contacts with Riemann. These contacts were renewed when Riemann visited\nBetti\nin Italy in\n1863\n. In\n[\n16\n]\ntwo letter from\nBetti\n, showing the topological ideas that he learnt from Riemann, are reproduced.\nIn\n1859\nDirichlet\ndied and Riemann was appointed to the chair of mathematics at Göttingen on\n30\nJuly. A few days later he was elected to the\nBerlin Academy of Sciences\n. He had been proposed by three of the Berlin mathematicians,\nKummer\n,\nBorchardt\nand\nWeierstrass\n. Their proposal read\n[\n6\n]\n:-\nPrior to the appearance of his most recent work\n[\nTheory of abelian functions\n]\n, Riemann was almost unknown to mathematicians. This circumstance excuses somewhat the necessity of a more detailed examination of his works as a basis of our presentation. We considered it our duty to turn the attention of the Academy to our colleague whom we recommend not as a young talent which gives great hope, but rather as a fully mature and independent investigator in our area of science, whose progress he in significant measure has promoted.\nA newly elected member of the\nBerlin Academy of Sciences\nhad to report on their most recent research and Riemann sent a report on\nOn the number of\nprimes\nless than a given magnitude\nanother of his great masterpieces which were to change the direction of mathematical research in a most significant way. In it Riemann examined the\nzeta function\nζ\n(\ns\n)\n=\n∑\n1\nn\ns\n=\n∏\n1\n1\n−\np\n−\ns\n\\zeta(s) = \\sum  \\Large\\frac 1 {n^{s}}\\normalsize = \\prod \\Large\\frac 1 {1- p^{-s}}\nζ\n(\ns\n)\n=\n∑\nn\ns\n1\n​\n=\n∏\n1\n−\np\n−\ns\n1\n​\nwhich had already been considered by\nEuler\n. Here the sum is over all natural numbers\nn\nn\nn\nwhile the product is over all prime numbers. Riemann considered a very different question to the one\nEuler\nhad considered, for he looked at the zeta function as a complex function rather than a real one. Except for a few trivial exceptions, the roots of\nζ\n(\ns\n)\n\\zeta(s)\nζ\n(\ns\n)\nall lie between\n0\nand\n1\n. In the paper he stated that the zeta function had infinitely many nontrivial roots and that it seemed probable that they all have real part\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n. This is the famous\nRiemann hypothesis\nwhich remains today one of the most important of the unsolved problems of mathematics.\nRiemann studied the convergence of the series representation of the zeta function and found a functional equation for the zeta function. The main purpose of the paper was to give estimates for the number of primes less than a given number. Many of the results which Riemann obtained were later proved by\nHadamard\nand de la\nVallée Poussin\n.\nIn June\n1862\nRiemann married Elise Koch who was a friend of his sister. They had one daughter. In the autumn of the year of his marriage Riemann caught a heavy cold which turned to tuberculosis. He had never had good health all his life and in fact his serious heath problems probably go back much further than this cold he caught. In fact his mother had died when Riemann was\n20\nwhile his brother and three sisters all died young. Riemann tried to fight the illness by going to the warmer climate of Italy.\nThe winter of\n1862\n-\n63\nwas spent in Sicily and he then travelled through Italy, spending time with\nBetti\nand other Italian mathematicians who had visited Göttingen. He returned to Göttingen in June\n1863\nbut his health soon deteriorated and once again he returned to Italy. Having spent from August\n1864\nto October\n1865\nin northern Italy, Riemann returned to Göttingen for the winter of\n1865\n-\n66\n, then returned to Selasca on the shores of Lake Maggiore on\n16\nJune\n1866\n.\nDedekind\nwrites in\n[\n3\n]\n:-\nHis strength declined rapidly, and he himself felt that his end was near. But still, the day before his death, resting under a fig tree, his soul filled with joy at the glorious landscape, he worked on his final work which unfortunately, was left unfinished.\nFinally let us return to\nWeierstrass\n's criticism of Riemann's use of the\nDirichlet\n's Principle.\nWeierstrass\nhad shown that a minimising function was not guaranteed by the\nDirichlet\nPrinciple. This had the effect of making people doubt Riemann's methods.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nAll used Riemann's material but his method was entirely neglected. ... During the rest of the century Riemann's results exerted a tremendous influence: his way of thinking but little.\nWeierstrass\nfirmly believed Riemann's results, despite his own discovery of the problem with the\nDirichlet\nPrinciple. He asked his student Hermann\nSchwarz\nto try to find other proofs of Riemann's existence theorems which did not use the\nDirichlet\nPrinciple. He managed to do this during\n1869\n-\n70\n.\nKlein\n, however, was fascinated by Riemann's geometric approach and he wrote a book in\n1892\ngiving his version of Riemann's work yet written very much in the spirit of Riemann.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nIt is a beautiful book, and it would be interesting to know how it was received. Probably many took offence at its lack of rigour:\nKlein\nwas too much in Riemann's image to be convincing to people who would not believe the latter.\nIn\n1901\nHilbert\nmended Riemann's approach by giving the correct form of\nDirichlet\n's Principle needed to make Riemann's proofs rigorous. The search for a rigorous proof had not been a waste of time, however, since many important algebraic ideas were discovered by\nClebsch\n,\nGordan\n,\nBrill\nand\nMax Noether\nwhile they tried to prove Riemann's results. Monastyrsky writes in\n[\n6\n]\n:-\nIt is difficult to recall another example in the history of nineteenth-century mathematics when a struggle for a rigorous proof led to such productive results."
}