{
  "nome_completo": "Bhaskara",
  "nome_curto": "Bhaskara II",
  "ano_nascimento": "1114",
  "ano_morte": "1185",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bhaskara_II/",
  "lugar_nascimento": "Vijayapura, India",
  "lugar_morte": "Ujjain, India",
  "biografia": "Bhaskara\nis also known as\nBhaskara II\nor as\nBhaskaracharya\n, this latter name meaning \"Bhaskara the Teacher\". Since he is known in India as Bhaskaracharya we will refer to him throughout this article by that name. Bhaskaracharya's father was a Brahman named Mahesvara. Mahesvara himself was famed as an astrologer. This happened frequently in Indian society with generations of a family being excellent mathematicians and often acting as teachers to other family members.\nBhaskaracharya became head of the astronomical observatory at Ujjain, the leading mathematical centre in India at that time. Outstanding mathematicians such as\nVarahamihira\nand\nBrahmagupta\nhad worked there and built up a strong school of mathematical astronomy.\nIn many ways Bhaskaracharya represents the peak of mathematical knowledge in the\n12\nth\ncentury. He reached an understanding of the number systems and solving equations which was not to be achieved in Europe for several centuries.\nSix works by Bhaskaracharya are known but a seventh work, which is claimed to be by him, is thought by many historians to be a late forgery. The six works are:\nLilavati\n(\nThe Beautiful\n)\nwhich is on mathematics;\nBijaganita\n(\nSeed Counting or Root Extraction\n)\nwhich is on algebra; the\nSiddhantasiromani\nwhich is in two parts, the first on mathematical astronomy with the second part on the sphere; the\nVasanabhasya\nof\nMitaksara\nwhich is Bhaskaracharya's own commentary on the\nSiddhantasiromani\n; the\nKaranakutuhala\n(\nCalculation of Astronomical Wonders\n)\nor\nBrahmatulya\nwhich is a simplified version of the\nSiddhantasiromani\n; and the\nVivarana\nwhich is a commentary on the\nShishyadhividdhidatantra\nof\nLalla\n. It is the first three of these works which are the most interesting, certainly from the point of view of mathematics, and we will concentrate on the contents of these.\nGiven that he was building on the knowledge and understanding of\nBrahmagupta\nit is not surprising that Bhaskaracharya understood about zero and negative numbers. However his understanding went further even than that of\nBrahmagupta\n. To give some examples before we examine his work in a little more detail we note that he knew that\nx\n2\n=\n9\nx^{2} = 9\nx\n2\n=\n9\nhad two solutions. He also gave the formula\na\nÂ±\nb\n=\na\n+\na\n2\nâ\nb\n2\nÂ±\na\nâ\na\n2\nâ\nb\n2\n\\sqrt{a \\pm \\sqrt{b}}=\\sqrt \\frac{a+\\sqrt{a^{2}-b}}{2} \\pm \\sqrt \\frac{a-\\sqrt{a^{2}-b}}{2}\na\nÂ±\nb\nâ\nâ\n=\n2\na\n+\na\n2\nâ\nb\nâ\nâ\nâ\nÂ±\n2\na\nâ\na\n2\nâ\nb\nâ\nâ\nâ\nBhaskaracharya studied\nPell\n's equation\np\nx\n2\n+\n1\n=\ny\n2\npx^{2} + 1 = y^{2}\np\nx\n2\n+\n1\n=\ny\n2\nfor\np\np\np\n=\n8\n,\n11\n,\n32\n,\n61\nand\n67\n. When\np\n=\n61\np = 61\np\n=\n6\n1\nhe found the solutions\nx\n=\n226153980\n,\ny\n=\n1776319049\nx = 226153980, y = 1776319049\nx\n=\n2\n2\n6\n1\n5\n3\n9\n8\n0\n,\ny\n=\n1\n7\n7\n6\n3\n1\n9\n0\n4\n9\n. When\np\n=\n67\np = 67\np\n=\n6\n7\nhe found the solutions\nx\n=\n5967\n,\ny\n=\n48842\nx = 5967, y = 48842\nx\n=\n5\n9\n6\n7\n,\ny\n=\n4\n8\n8\n4\n2\n. He studied many\nDiophantine problems\n.\nLet us first examine the\nLilavati\n. First it is worth repeating the story told by Fyzi who translated this work into Persian in\n1587\n. We give the story as given by Joseph in\n[\n5\n]\n:-\nLilavati was the name of Bhaskaracharya's daughter. From casting her horoscope, he discovered that the auspicious time for her wedding would be a particular hour on a certain day. He placed a cup with a small hole at the bottom of the vessel filled with water, arranged so that the cup would sink at the beginning of the propitious hour. When everything was ready and the cup was placed in the vessel, Lilavati suddenly out of curiosity bent over the vessel and a pearl from her dress fell into the cup and blocked the hole in it. The lucky hour passed without the cup sinking. Bhaskaracharya believed that the way to console his dejected daughter, who now would never get married, was to write her a manual of mathematics!\nThis is a charming story but it is hard to see that there is any evidence for it being true. It is not even certain that Lilavati was Bhaskaracharya's daughter. There is also a theory that Lilavati was Bhaskaracharya's wife. The topics covered in the thirteen chapters of the book are: definitions; arithmetical terms; interest; arithmetical and geometrical progressions; plane geometry; solid geometry; the shadow of the gnomon; the kuttaka; combinations.\nIn dealing with numbers Bhaskaracharya, like\nBrahmagupta\nbefore him, handled efficiently arithmetic involving negative numbers. He is sound in addition, subtraction and multiplication involving zero but realised that there were problems with\nBrahmagupta\n's ideas of dividing by zero. Madhukar Mallayya in\n[\n14\n]\nargues that the zero used by Bhaskaracharya in his rule\n(\na\n.\n0\n)\n/\n0\n=\na\n(a.0)/0 = a\n(\na\n.\n0\n)\n/\n0\n=\na\n, given in\nLilavati\n, is equivalent to the modern concept of a non-zero \"infinitesimal\". Although this claim is not without foundation, perhaps it is seeing ideas beyond what Bhaskaracharya intended.\nBhaskaracharya gave two methods of multiplication in his\nLilavati\n. We follow Ifrah who explains these two methods due to Bhaskaracharya in\n[\n4\n]\n. To multiply\n325\nby\n243\nBhaskaracharya writes the numbers thus:\n243 243 243\n 3 2 5\n-------------------\nNow working with the rightmost of the three sums he computed\n5\ntimes\n3\nthen\n5\ntimes\n2\nmissing out the\n5\ntimes\n4\nwhich he did last and wrote beneath the others one place to the left. Note that this avoids making the \"carry\" in ones head.\n243 243 243\n 3 2 5\n-------------------\n 1015\n 20\n-------------------\nNow add the\n1015\nand\n20\nso positioned and write the answer under the second line below the sum next to the left.\n243 243 243\n 3 2 5\n-------------------\n 1015\n 20\n-------------------\n 1215\nWork out the middle sum as the right-hand one, again avoiding the \"carry\", and add them writing the answer below the\n1215\nbut displaced one place to the left.\n243 243 243\n 3 2 5\n-------------------\n 4 6 1015\n 8 20\n-------------------\n 1215\n 486\nFinally work out the left most sum in the same way and again place the resulting addition one place to the left under the\n486\n.\n243 243 243\n 3 2 5\n-------------------\n 6 9 4 6 1015\n 12 8 20\n-------------------\n 1215\n 486\n 729\n-------------------\nFinally add the three numbers below the second line to obtain the answer\n78975\n.\n243 243 243\n 3 2 5\n-------------------\n 6 9 4 6 1015\n 12 8 20\n-------------------\n 1215\n 486\n 729\n-------------------\n 78975\nDespite avoiding the \"carry\" in the first stages, of course one is still faced with the \"carry\" in this final addition.\nThe second of Bhaskaracharya's methods proceeds as follows:\n325\n 243\n--------\nMultiply the bottom number by the top number starting with the left-most digit and proceeding towards the right. Displace each row one place to start one place further right than the previous line. First step\n325\n 243\n--------\n 729\nSecond step\n325\n 243\n--------\n 729\n 486\nThird step, then add\n325\n 243\n--------\n 729\n 486\n 1215\n--------\n 78975\nBhaskaracharya, like many of the Indian mathematicians, considered squaring of numbers as special cases of multiplication which deserved special methods. He gave four such methods of squaring in\nLilavati\n.\nHere is an example of explanation of inverse proportion taken from Chapter\n3\nof the\nLilavati\n. Bhaskaracharya writes:-\nIn the inverse method, the operation is reversed. That is the fruit to be multiplied by the augment and divided by the demand. When fruit increases or decreases, as the demand is augmented or diminished, the direct rule is used. Else the inverse.\nRule of three inverse: If the fruit diminish as the requisition increases, or augment as that decreases, they, who are skilled in accounts, consider the rule of three to be inverted. When there is a diminution of fruit, if there be increase of requisition, and increase of fruit if there be diminution of requisition, then the inverse rule of three is employed.\nAs well as the rule of three, Bhaskaracharya discusses examples to illustrate rules of compound proportions, such as the rule of five\n(\nPancarasika\n)\n, the rule of seven\n(\nSaptarasika\n)\n, the rule of nine\n(\nNavarasika\n)\n, etc. Bhaskaracharya's examples of using these rules are discussed in\n[\n15\n]\n.\nAn example from Chapter\n5\non arithmetical and geometrical progressions is the following:-\nExample: On an expedition to seize his enemy's elephants, a king marched two yojanas the first day. Say, intelligent calculator, with what increasing rate of daily march did he proceed, since he reached his foe's city, a distance of eighty yojanas, in a week?\nBhaskaracharya shows that each day he must travel\n22\n7\n\\large\\frac{22}{7}\\normalsize\n7\n2\n2\nâ\nyojanas further than the previous day to reach his foe's city in\n7\ndays.\nAn example from Chapter\n12\non the kuttaka method of solving indeterminate equations is the following:-\nExample: Say quickly, mathematician, what is that multiplier, by which two hundred and twenty-one being multiplied, and sixty-five added to the product, the sum divided by a hundred and ninety-five becomes exhausted.\nBhaskaracharya is finding integer solution to\n195\nx\n=\n221\ny\n+\n65\n195x = 221y + 65\n1\n9\n5\nx\n=\n2\n2\n1\ny\n+\n6\n5\n. He obtains the solutions\n(\nx\n,\ny\n)\n=\n(\n6\n,\n5\n)\n(x, y) = (6, 5)\n(\nx\n,\ny\n)\n=\n(\n6\n,\n5\n)\nor\n(23\n,\n20)\nor\n(40\n,\n35)\nand so on.\nIn the final chapter on combinations Bhaskaracharya considers the following problem. Let an\nn\nn\nn\n-digit number be represented in the usual decimal form as\nd\n1\nd\n2\n.\n.\n.\nd\nn\nd_{1}d_{2}... d_{n}\nd\n1\nâ\nd\n2\nâ\n.\n.\n.\nd\nn\nâ\nÂ Â Â Â\n(\n*\n)\nwhere each digit satisfies\n1\nâ¤\nd\nj\nâ¤\n9\n,\nj\n=\n1\n,\n2\n,\n.\n.\n.\n,\nn\n1 â¤ d_{j} â¤ 9, j = 1, 2, ... , n\n1\nâ¤\nd\nj\nâ\nâ¤\n9\n,\nj\n=\n1\n,\n2\n,\n.\n.\n.\n,\nn\n. Then Bhaskaracharya's problem is to find the total number of numbers of the form\n(\n*\n)\nthat satisfy\nd\n1\n+\nd\n2\n+\n.\n.\n.\n+\nd\nn\n=\nS\nd_{1} + d_{2} + ... + d_{n} = S\nd\n1\nâ\n+\nd\n2\nâ\n+\n.\n.\n.\n+\nd\nn\nâ\n=\nS\n.\nIn his conclusion to\nLilavati\nBhaskaracharya writes:-\nJoy and happiness is indeed ever increasing in this world for those who have Lilavati clasped to their throats, decorated as the members are with neat reduction of fractions, multiplication and involution, pure and perfect as are the solutions, and tasteful as is the speech which is exemplified.\nThe\nBijaganita\nis a work in twelve chapters. The topics are: positive and negative numbers; zero; the unknown; surds; the kuttaka; indeterminate quadratic equations; simple equations; quadratic equations; equations with more than one unknown; quadratic equations with more than one unknown; operations with products of several unknowns; and the author and his work.\nHaving explained how to do arithmetic with negative numbers, Bhaskaracharya gives problems to test the abilities of the reader on calculating with negative and affirmative quantities:-\nExample: Tell quickly the result of the numbers three and four, negative or affirmative, taken together; that is, affirmative and negative, or both negative or both affirmative, as separate instances; if thou know the addition of affirmative and negative quantities.\nNegative numbers are denoted by placing a dot above them:-\nThe characters, denoting the quantities known and unknown, should be first written to indicate them generally; and those, which become negative should be then marked with a dot over them.\nExample: Subtracting two from three, affirmative from affirmative, and negative from negative, or the contrary, tell me quickly the result ...\nIn\nBijaganita\nBhaskaracharya attempted to improve on\nBrahmagupta\n's attempt to divide by zero\n(\nand his own description in\nLilavati\n)\nwhen he wrote:-\nA quantity divided by zero becomes a fraction the denominator of which is zero. This fraction is termed an infinite quantity. In this quantity consisting of that which has zero for its divisor, there is no alteration, though many may be inserted or extracted; as no change takes place in the infinite and immutable God when worlds are created or destroyed, though numerous orders of beings are absorbed or put forth.\nSo Bhaskaracharya tried to solve the problem by writing\nn\nn\nn\n/\n0\n= â. At first sight we might be tempted to believe that Bhaskaracharya has it correct, but of course he does not. If this were true then\n0\ntimes â must be equal to every number\nn\nn\nn\n, so all numbers are equal. The Indian mathematicians could not bring themselves to the point of admitting that one could not divide by zero.\nEquations leading to more than one solution are given by Bhaskaracharya:-\nExample: Inside a forest, a number of apes equal to the square of one-eighth of the total apes in the pack are playing noisy games. The remaining twelve apes, who are of a more serious disposition, are on a nearby hill and irritated by the shrieks coming from the forest. What is the total number of apes in the pack?\nThe problem leads to a quadratic equation and Bhaskaracharya says that the two solutions, namely\n16\nand\n48\n, are equally admissible.\nThe kuttaka method to solve indeterminate equations is applied to equations with three unknowns. The problem is to find integer solutions to an equation of the form\na\nx\n+\nb\ny\n+\nc\nz\n=\nd\nax + by + cz = d\na\nx\n+\nb\ny\n+\nc\nz\n=\nd\n. An example he gives is:-\nExample: The horses belonging to four men are\n5\n,\n3\n,\n6\nand\n8\n. The camels belonging to the same men are\n2\n,\n7\n,\n4\nand\n1\n. The mules belonging to them are\n8\n,\n2\n,\n1\nand\n3\nand the oxen are\n7\n,\n1\n,\n2\nand\n1\n. all four men have equal fortunes. Tell me quickly the price of each horse, camel, mule and ox.\nOf course such problems do not have a unique solution as Bhaskaracharya is fully aware. He finds one solution, which is the minimum, namely horses\n85\n, camels\n76\n, mules\n31\nand oxen\n4\n.\nBhaskaracharya's conclusion to the\nBijaganita\nis fascinating for the insight it gives us into the mind of this great mathematician:-\nA morsel of tuition conveys knowledge to a comprehensive mind; and having reached it, expands of its own impulse, as oil poured upon water, as a secret entrusted to the vile, as alms bestowed upon the worthy, however little, so does knowledge infused into a wise mind spread by intrinsic force.\nIt is apparent to men of clear understanding, that the rule of three terms constitutes arithmetic and sagacity constitutes algebra. Accordingly I have said ... The rule of three terms is arithmetic; spotless understanding is algebra. What is there unknown to the intelligent? Therefore for the dull alone it is set forth.\nThe\nSiddhantasiromani\nis a mathematical astronomy text similar in layout to many other Indian astronomy texts of this and earlier periods. The twelve chapters of the first part cover topics such as: mean longitudes of the planets; true longitudes of the planets; the three problems of diurnal rotation; syzygies; lunar eclipses; solar eclipses; latitudes of the planets; risings and settings; the moon's crescent; conjunctions of the planets with each other; conjunctions of the planets with the fixed stars; and the patas of the sun and moon.\nThe second part contains thirteen chapters on the sphere. It covers topics such as: praise of study of the sphere; nature of the sphere; cosmography and geography; planetary mean motion; eccentric epicyclic model of the planets; the armillary sphere; spherical trigonometry; ellipse calculations; first visibilities of the planets; calculating the lunar crescent; astronomical instruments; the seasons; and problems of astronomical calculations.\nThere are interesting results on trigonometry in this work. In particular Bhaskaracharya seems more interested in trigonometry for its own sake than his predecessors who saw it only as a tool for calculation. Among the many interesting results given by Bhaskaracharya are:\nsin\nâ¡\n(\na\n+\nb\n)\n=\nsin\nâ¡\na\ncos\nâ¡\nb\n+\ncos\nâ¡\na\nsin\nâ¡\nb\n\\sin(a + b) = \\sin a \\cos b + \\cos a \\sin b\nsin\n(\na\n+\nb\n)\n=\nsin\na\ncos\nb\n+\ncos\na\nsin\nb\nand\nsin\nâ¡\n(\na\nâ\nb\n)\n=\nsin\nâ¡\na\ncos\nâ¡\nb\nâ\ncos\nâ¡\na\nsin\nâ¡\nb\n\\sin(a - b) = \\sin a \\cos b - \\cos a \\sin b\nsin\n(\na\nâ\nb\n)\n=\nsin\na\ncos\nb\nâ\ncos\na\nsin\nb\n.\nBhaskaracharya rightly achieved an outstanding reputation for his remarkable contribution. In\n1207\nan educational institution was set up to study Bhaskaracharya's works. A medieval inscription in an Indian temple reads:-\nTriumphant is the illustrious Bhaskaracharya whose feats are revered by both the wise and the learned. A poet endowed with fame and religious merit, he is like the crest on a peacock.\nIt is from this quotation that the title of Joseph's book\n[\n5\n]\ncomes."
}