{
  "nome_completo": "William Paul Thurston",
  "nome_curto": "Bill Thurston",
  "ano_nascimento": "1946",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thurston/",
  "lugar_nascimento": "Washington, D.C., USA",
  "lugar_morte": "Rochester, New York, USA",
  "biografia": "Bill Thurston\nstudied at New College, Sarasota, Florida. He received his B.S. from there in\n1967\nand moved to the University of California at Berkeley to undertake research under Morris Hirsch's and\nStephen Smale\n's supervision. He was awarded his doctorate in\n1972\nfor a thesis entitled\nFoliations of\n3\n-\nmanifolds\nwhich are circle bundles\n. This work showed the existence of compact leaves in foliations of\n3\n-dimensional manifolds.\nAfter completing his Ph.D., Thurston spent the academic year\n1972\n-\n73\nat the Institute for Advanced Study at Princeton. Then, in\n1973\n, he was appointed an assistant professor of mathematics at Massachusetts Institute of Technology. In\n1974\nhe was appointed professor of mathematics at Princeton University.\nThroughout this period Thurston worked on foliations. Lawson\n(\n[\n5\n]\n)\nsums up this work:-\nIt is evident that Thurston's contributions to the field of foliations are of considerable depth. However, what sets them apart is their marvellous originality. This is also true of his subsequent work on\nTeichmüller\nspace and the theory of\n3\n-manifolds.\nIn\n[\n8\n]\nWall\ndescribes Thurston's contributions which led to him being awarded a\nFields Medal\nin\n1982\n. In fact the\n1982\nFields Medals were announced at a meeting of the General Assembly of the\nInternational Mathematical Union\nin Warsaw in early August\n1982\n. They were not presented until the International Congress in Warsaw which could not be held in\n1982\nas scheduled and was delayed until the following year. Lectures on the work of Thurston which led to his receiving the Medal were made at the\n1983\nInternational Congress.\nWall\n, giving that address, said:-\nThurston has fantastic geometric insight and vision: his ideas have completely revolutionised the study of\ntopology\nin\n2\nand\n3\ndimensions, and brought about a new and fruitful interplay between analysis, topology and geometry.\nWall\n[\n8\n]\ngoes on to describe Thurston's work in more detail:-\nThe central new idea is that a very large class of closed\n3\n-manifolds should carry a hyperbolic structure - be the quotient of hyperbolic space by a discrete group of isometries, or equivalently, carry a metric of constant negative curvature. Although this is a natural analogue of the situation for\n2\n-manifolds, where such a result is given by\nRiemann\n's uniformisation theorem, it is much less plausible - even counter-intuitive - in the\n3\n-dimensional situation.\nKleinian groups, which are discrete isometry groups of hyperbolic\n3\n-space, were first studied by\nPoincaré\nand a fundamental finiteness theorem was proved by\nAhlfors\n. Thurston's work on Kleinian groups yielded many new results and established a well known conjecture.\nSullivan\ndescribes this geometrical work in\n[\n6\n]\n, giving the following summary:-\nThurston's results are surprising and beautiful. The method is a new level of geometrical analysis - in the sense of powerful geometrical estimation on the one hand, and spatial visualisation and imagination on the other, which are truly remarkable.\nThurston's work is summarised by Wall\n[\n8\n]\n:-\nThurston's work has had an enormous influence on\n3\n-dimensional topology. This area has a strong tradition of 'bare hands' techniques and relatively little interaction with other subjects. Direct arguments remain essential, but\n3\n-dimensional topology has now firmly rejoined the main stream of mathematics.\nThurston has received many honours in addition to the Fields Medal. He held a Alfred P Sloan Foundation Fellowship in\n1974\n-\n75\n. In\n1976\nhis work on foliations led to his being awarded the\nOswald Veblen\nGeometry Prize of the\nAmerican Mathematical Society\n. In\n1979\nhe was awarded the Alan T Waterman Award, being the second mathematician to receive such an award\n(\nthe first being\nFefferman\nin\n1976)\n.\nIn\n1991\n, Thurston left Princeton University and returned to the University of California at Berkeley as Professor of Mathematics. In\n1993\nhe was appointed Director of the Mathematical Sciences Research Institute at Berkeley. In\n1996\n, while remaining at the University of California, he moved from Berkeley to Davis. Then, in\n2003\n, he was appointed Professor of Mathematics and Computer Science at Cornell University.\nIn\n1997\nhe published\nThree-dimensional geometry and topology. Vol.\n1\n. The history of this remarkable book is explained by Athanase Papadopoulos in a review:-\nIn\n1978\n, W Thurston gave a course at Princeton University, whose subject was the geometry and topology of three-dimensional manifolds. He wrote notes for that course, and the notes immediately circulated all over the world. It is probably the opinion of all the people working in low-dimensional topology that the ideas contained in these notes have been the most important and influential ideas ever written on the subject. These notes created a new circle of ideas, and the expression \"Thurston type geometry\" has become very common. The\n1978\nPrinceton lecture notes, although written in an informal style, are self-contained and accessible to graduate students in topology or geometry. At some places the proofs are only sketched, but for most of the important new results, the arguments in the proofs are given completely. Besides the fact that many of these ideas are completely new, the notes present the subject matter in a great coherent expository\n(\nalthough special\n)\nstyle. Thurston's style of exposition is special in that it asks the reader to participate actively in what's going on by providing room for mental images, and this is one of the reasons why it is easy to get stuck if one tries to read these notes in a linear manner. For many years, Thurston was asked by many people\n(\nand it was probably also his own intention\n)\nto write a more detailed version of these notes.\n(\nDetails of some sections have already been worked out and published by different individuals and groups of people.\n)\nThe book under review grew out of the author's effort to organize and expand the notes, and to make them more accessible, both in form and in content. This book contains developments for only part of the original Princeton lecture notes, and since the title of the book refers to \"Part I\", there will hopefully be a sequel. The net result that we have here is a book which is, fortunately, still written in Thurston's style, demanding the participation of the reader's imagination, but with many more details than the chapters of the Princeton\n1978\nnotes from which it grew.\nHe ends his enthusiastic review saying:-\nThere is a lot of beautiful mathematics here.\nOn\n6\nJanuary\n2005\n, at the Joint Mathematics Meetings in Atlanta, Georgia, Thurston was awarded the\nAmerican Mathematical Society\nBook Prize for\nThree-dimensional geometry and topology\n. The citation for the award states:-\nThis is exciting and vital mathematics. Thurston's book is nearly unique in the intuitive grasp of subtle geometric ideas that it provides. It has been enormously influential, both for graduate students and seasoned researchers alike. Certainly the army of people who are working on the geometrization program regard this book as 'the touchstone' for their work. A book that has played such an important and dynamic role in modern mathematics is eminently deserving of the AMS Book Prize."
}