{
  "nome_completo": "William Leonard Ferrar",
  "nome_curto": "Bill Ferrar",
  "ano_nascimento": "1893",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferrar/",
  "lugar_nascimento": "Bristol, England",
  "lugar_morte": "Oxford, England",
  "biografia": "William Ferrar\nwas known as Bill and we will, at times, call him Bill Ferrar in this biography. His father was George William Parsons Ferrar, the son of a journeyman baker George Ferrar, who was born in St Pauls, Bristol in\n1869\n, and died in Yarmouth, Norfolk on\n31\nOctober\n1918\n. George William was a lamplighter, working for Bristol Corporation lighting, maintaining the city's street gas lamps. Bill's mother was Maria Susannah Dale, who was also born in St Pauls, Bristol in\n1869\n, and died in Bristol on\n30\nJanuary\n1965\n. Maria was a daughter of the labourer Leonard Marchand Dale. George and Maria Ferrar were married on\n24\nOctober\n1892\nat St Matthias, Bristol. Bill Ferrar, the subject of this biography, was the eldest of their three children, all boys. He had younger brothers Herbert Hugh Ferrar\n(1896\n-\n1990)\n, born\n20\nJanuary, and Arthur Marchant Ferrar\n(1904\n-\n1979)\n, born\n24\nOctober. Herbert became a lamplighter, while Arthur's occupation is given as Hosiery Interlock Knitting Machine. The Ferrar family were not well off and Bill's good education was only possible as a result of winning scholarships.\nBill Ferrar began his schooling in Ashley Down Infant School, and progressed to Queen Elizabeth's Hospital School, Brandon Hill. He completed his school education at Bristol Grammar School where he was taught mathematics by George John Biles Westcott, the senior mathematics master at the Grammar School and author of\nA first course in Calculus Parts I and II\n, and\nThe elements of calculus\n, both co-authored with\nWilliam P Milne\n. Westcott inspired in Ferrar\n[\n16\n]\n:-\n... a great love of pure mathematics but failed to inspire a similar feeling towards applied mathematics.\nFerrar entered Queen's College Oxford in\n1912\nafter winning a scholarship to the College in the examinations of December\n1911\n. He had wanted to study at Balliol College and was disappointed not to win a scholarship to that College. It did, however, mean that he was determined that he would beat those at Balliol in the examinations at the end of the first year. The fees were £\n150\nper year and the scholarship, as well as having a very high prestige value, came with £\n80\ntowards the fees. The difference of £\n70\nwas made up by the Bristol Municipal Charities. In the examinations at the end of his first year he did not beat the best mathematics scholar at Balioll, but the two were well clear of all the other students. Ferrar's tutor at the Queen's College was C H Thompson and he was very impressed with his young student. He sent Ferrar to Cambridge for six weeks in the summer vacation of\n1913\nto study with\nG Neville Watson\n.\nWatson\narranged for Ferrar to study infinite series and, in particular, theorems relating to their convergence. This was a very important time for Ferrar since it set him up for the Junior Mathematical Scholarship examinations and also gave him an introduction to the topic on which he spent much time on research for the rest of his life.\nIn January\n1914\nhe won the Junior Mathematical Scholarship, beating his Balliol rival who came second. His studies were interrupted by World War I, however, which broke out with declarations of war between European countries in July and August of that year. Immediately Ferrar volunteered for service in the army. He served as a telephonist in an artillery unit, which comprised of horse-drawn guns, and spent around two years on the battlefields of the Somme. He used a field telephone which could transmit and receive coded Morse signals but the telephone lines were continually damaged by enemy fire. During these two years Ferrar learnt French and, to make use of his skills, he was transferred\n(\na little unwillingly\n)\nto an intelligence unit in the Pas de Calais region of France\n[\n16\n]\n:-\nThere his job was amongst civilians, and he became fluent also in the dialect of Picardy. He was allocated a motor-cycle to travel around his region but he was never happy with it, and at one point, roused to passion by finding himself the target of a German airborne gunner, vowed never to have anything more to do with the internal combustion engine for the rest of his life - a vow which he later described as 'one of the most stupid oaths of my career', but which he nevertheless kept.\nOn\n31\nOctober\n1918\n, Ferrar's father died and he was given a few days compassionate leave and was in Bristol on\n11\nNovember\n1918\nwhen the war ended. He returned to France and was demobilised in the spring of\n1919\n.\nHe returned to Oxford for the summer term of\n1919\n, where he applied himself to his studies in the same vigorous way that he had done before the war. He graduated in June\n1920\nwith the best First Class degree, and in September of that year took up a post as an assistant lecturer in the University College of North Wales at Bangor which he had been offered before he took his finals. Between graduating and taking up the post in Bangor he spent six weeks as a school master. He held the post in Bangor for four years, and although happy there, he was keen enough to move to a more research oriented place that he made several applications. At Bangor, he was one of three members of the Mathematics Department, which comprised of a professor, George Hartley Bryan, a lecturer and an assistant lecturer. With a heavy teaching load, his research time was limited but during these four years he was able to write a dissertation which won for him the Oxford Senior Mathematical Scholarship in\n1922\nand he published it, in modified form, as his first paper\nDeterminants whose elements are determinants\n(1923)\n. It was at Bangor\n[\n16\n]\n:-\n... that he established the style of lecturing for which he is clearly remembered. Firmness and the control of his audience were never in doubt, and his material was meticulously prepared.\nPromoted to a lecturer at Bangor in\n1922\n, he felt his prospects were secure enough to allow him to marry Edna O'Hara\n(1898\n-\n1986)\n, whom he had known for four years. Edna had been born in Nottingham on\n15\nOctober\n1898\nand it had been in Nottingham that Ferrar had met her when he visited his uncle's widow.\n[\nHis uncle had been killed in World War I.\n]\nThey married in September\n1923\nand had one child, Michael Ferrar\n(\nborn\n1927)\n.\nGiven a considerably more research oriented environment at the University of Edinburgh, he was delighted to accept\nEdmund Whittaker\n's invitation of a senior lectureship in Edinburgh where, in addition to\nWhittaker\n, his colleagues were\nEdward Copson\nand\nAlex Aitken\n. Although he was happy to be in Edinburgh and expected to stay there for many years, in fact he was only there for one academic year,\n1924\n-\n25\n. The death of\nJ E Campbell\nleft a vacant fellowship at Hertford College, Oxford, which Ferrar was invited to fill and he took it up in September\n1925\n. At Oxford, although his main aim was to be heavily involved in research, he had to spend much time teaching and examining. His salary was such that he really had to supplement it to provide enough to support his family and he did this by setting and marking school examination papers. He had an\n[\n16\n]\n:-\n... appointment with the Oxford and Cambridge Joint Examinations Board marking mathematics scripts for school-leaving examinations\n(\nat first School Certificate and Higher Certificate, later General Certificate of Education at Ordinary and Advanced levels\n)\n.  He soon became an awarder, which meant taking part in the setting of questions, marking sometimes as many as a thousand scripts, and taking part in the awarding of passes and grades. For fifty years examining was an integral part of his mathematical life, and for many of those years he and\nE A Maxwell\nof Cambridge dominated the Oxford and Cambridge higher mathematics examinations for schools.\nAt the Annual Meeting of the\nMathematical Association\non\n3\nJanuary\n1939\n, Ferrar gave the talk\nAlgebra in the Higher School Certificate\n. Delivered from his position as an examiner, part of this interesting talk can be read at\nTHIS LINK\n.\nFerrar wrote many research papers which deal with the convergence of series, an interest which came from working with\nG N Watson\nat Cambridge during a summer vacation while an undergraduate. He worked on interpolation theory, a topic which was suggested to him by\nEdmund Whittaker\n. From about\n1930\nhis interests turned towards number theory and he examined the convergence of series and the evaluation of singular integrals. These come from a study of\nBessel\nfunctions which arise from applying summation formulae.\nYou can see a list of Ferrar's publications at\nTHIS LINK\n.\nFerrar attended the International Congress of Mathematicians in Oslo in July\n1936\n.\nG H Hardy\nhad been influential in setting up the\nQuarterly Journal of Mathematics\nat Oxford and Ferrar served as its editor from\n1930\nto\n1933\n[\n16\n]\n:-\n... receiving manuscripts, getting them refereed, preparing accepted papers for press and reading the proofs; he remained on the editorial board from\n1934\nuntil\n1947\n.\nIn addition Ferrar published many papers in the\nQuarterly Journal of Mathematics\nduring his period as editor. He moved towards administration with the post of Senior Tutor at his College in\n1934\nand then, in\n1937\n, he became Bursar of Hertford College, Oxford. He held this post for\n22\nyears. Norman Perrin writes in\n[\n19\n]\nof Ferrar at Hertford in the late\n1940\ns:-\nIt was only after I arrived in Oxford for Michaelmas Term\n1948\nthat I found that the Principal's name was Dr N R Murphy ... And then there was my Ration Book which caused the Bursar, Dr W L Ferrar, some anxiety, being blue rather than the standard buff colour. Reassured that it would be exchanged for the grown up version in a few weeks' time when I had reached the age of\n18\n, he asked what benefits accrued. This culminated a week or two later in being singled out for a special dessert at dinner; a solitary banana was borne in on a silver charger.\nOne feature of my first year now reading for a maths and science course was that the major part of that year's entry seemed to be either returning from War Service or at least having completed the two years National Service. As it was the first time I had ever\n(\nthe exam weeks apart\n)\nbeen that far into the deep south of England it was all rather strange, but thankfully very welcoming, and I soon felt totally at home.\n[\nI had\n]\nthe rather quirky situation that none of my tutorials in three years in Oxford was held by a Hertford based tutor. Dear Dr Ferrar was much absorbed in post-grad studies, writing his excellent maths text books and his bursar-ship.\nThe\nLondon Mathematical Society\nwas also important for Ferrar who served on the Council from\n1933\nto\n1942\n. He served as one of the two secretaries to the Society from\n1934\n, succeeding\nG N Watson\n, working with F P White\n(\nCambridge\n)\n[\n16\n]\n:-\nIn those days, the job of the secretaries was not merely to run the society, but also to run its publications. Although decisions about acceptance and rejection of manuscripts were taken by Council in full session\n(\na practice that survived until\n1968)\n, the two secretaries were effectively the Editors of the  Proceedings  and the  Journal.  After he finished his period as secretary, Ferrar served a further four years on Council, two of them as Vice-President.\nFerrar is also famed for his ten outstanding textbooks including\nA textbook of convergence\n(1938)\n,\nAlgebra: a textbook of determinants, matrices and quadratic forms\n(1941)\n, and\nFinite matrices\n(1951)\n. You can see how popular these books were by the number of times they were reprinted. For example,\nA textbook of convergence\n(1938)\nwas reprinted in\n1945\n,\n1947\n,\n1951\n,\n1956\n,\n1959\n,\n1963\n,\n1969\n, and\n1980\n.\nYou can read extracts from some reviews of all of Ferrar's books at\nTHIS LINK\n.\nPerhaps because of the disruption of his undergraduate course by World War I, Ferrar never obtained a doctorate.\nCopson\n, who was a friend and collaborator, suggested that he obtain a doctorate. In\n1947\nFerrar submitted\n35\npapers and\n2\nbooks for the degree of Doctor of Science at Oxford and made many of his colleagues, who had begun to think of him as solely an administrator, realise what an outstanding research record he had.\nIn\n1959\nhe gave up the position of Bursar, hoping for a quiet couple of years before he retired, but he was invited to become Principal of Hertford College so the last years of his career were anything but quiet. He continued to write textbooks and help with school examinations in his retirement. He published\nMathematics for science\n(1965)\n,\nCalculus for beginners\n(1967)\nand\nAdvanced mathematics for science\n(1969)\nall when over the age of\n70\n.\nSee extracts from reviews of these books at\nTHIS LINK\n.\nIn a personal communication, Michael Ferrar, Bill Ferrar's son, comments on his father's interest in lecturing:-\nIn a letter to his Uncle at University College Nottingham my father was very critical of the standard of lecturing at Oxford in\n1912\n.\nIt was perhaps in Edinburgh that the foundations were laid of his own high reputation as a lecturer. In those days many Edinburgh undergraduates had little money to buy textbooks and so were very dependent on lectures. If a lecturer overran his time they walked out because they had to get to their next lecture. If the lecture was good they applauded. My father was particularly proud of an occasion when he overran by several minutes and his audience stayed both to listen and to applaud.\nEdna Ferrar died in\n1986\nand was buried in Wolvercote Cemetery, Oxford. Bill Ferrar died in\n1990\nand was buried with his wife. The inscription on the tombstone reads, \"Edna Ferrar\n1898\n-\n1986\nand her Husband William Leonard Ferrar M.A. D.Sc.\n1893\n-\n1990\nFellow and Tutor, Bursar\n1937\n-\n59\n, and Principal\n1959\n-\n1964\n, Hertford College, Pro Vice-Chancellor Oxford University.\"\nFinally we note that a room in Hertford College is named the Ferrar Room. There is a memorial plaque in that room and also one in the Hertford Chapel. There is also an annual Ferrar dinner described by Alan Lauder\n[\n11\n]\n:-\nA social highlight of the year for us has become the now annual Ferrar dinner, named in memory of a past Fellow in Mathematics.\n(\nBill Ferrar, I believe, retired in the early\n1960\ns and so none of us actually have any memory of him\n)\nFor one night only the mathematical tutors and students let their hair down together, and engage in an increasingly riotous round of something called 'sconcing', a form of toasting which has the merits of embarrassing one reveller while at the same time inducing half the others to drink. Exactly whether all this improves the quality of mathematical teaching and learning in the college is not yet clear to me."
}