{
  "nome_completo": "Blagoj Sazdov Popov",
  "nome_curto": "Blagoj Popov",
  "ano_nascimento": "1923",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Popov/",
  "lugar_nascimento": "Kochani, Serbia (now North Macedonia)",
  "lugar_morte": "Skopje, Macedonia",
  "biografia": "Blagoj Popov\nattended secondary school in Šhtip, which is about\n25\nkm south west of Kochani. He graduated from the high school in Šhtip in\n1940\nand he went to Belgrade where he entered the Technical Department of the Electro-Engineering Division of the University to begin his study of mathematics. In April\n1941\n, however, German troops invaded Yugoslavia and occupied the whole country. The University of Belgrade was closed so Popov, together with other Macedonian mathematics students who had been studying in Belgrade, went to Bulgaria where they entered the Department of Physics and Mathematics in Sofia University in\n1942\n. By\n1944\nMacedonian military units were forming and becoming part of the People's Liberation Army of Macedonia. Popov left his studies in Belgrade and joined the new Macedonian army where he continued to serve until he was demobbed at the end of World War II. In November\n1945\nhe returned to his studies in Belgrade where the university had been reopened by the new Communist government and he now studied as part of the Mathematics Group in the Philosophical Faculty. The University, having been a centre for democratic ideas between the two world wars, was put under strict political controls. Popov graduated from the University of Belgrade in June\n1946\n. In\n1946\nand\n1947\n, he continued studying in the Electro-technical Faculty in Belgrade.\nIn January\n1948\n, Popov moved to the new Faculty of Philosophy in Skopje, as an assistant in mathematics. The University of Skopje was opened November\n1946\nwith one faculty, namely the Faculty of Philosophy which consisted of two departments, the Department of History and Philology and the Department of Mathematics. Popov, at this stage, only had a first degree in mathematics from Belgrade so, in addition to his appointment as an assistant in the Department of Mathematics, he was also a Ph.D. student. His advisor was Dragoslav S Mitrinovič who had founded the Department of Mathematics in the University of Skopje. Let us say a little about Mitrinovič.\nDragoslav S Mitrinovič\n(1908\n-\n1995)\nwas a Serbian who graduated with a Ph.D. from the University of Belgrade in\n1933\n. His thesis was on\ndifferential equations\n. He worked as a secondary school teacher for over\n10\nyears before going to Paris in\n1946\nHe founded the Department of Mathematics at the newly created University of Skopje in\n1946\nand worked there until\n1951\nwhen he returned to the University of Belgrade\n[\n4\n]\n:-\nMitrinovič started his university career in Skopje, Macedonia, as an Associate Professor at the Philosophical Faculty. It took him only five years\n(1946\n-\n1951)\nto found the Skopje School of Mathematics, including two mathematical journals. His persistent work\n[\nin Skopje\n]\nresulted in the foundation of a rich professional mathematical library there and in a wide exchange of scientific publications with foreign countries. Thanks to his scientific contribution he was elected a member of the\nMacedonian Academy of Sciences and Arts\n.\nIt is clear that Popov was fortunate both in having Mitrinovič as his Ph.D. advisor and also in arriving at a new department which was put so rapidly on a firm footing by Mitrinovič. In\n1949\n, after one year as an assistant, Popov was promoted to lecturer. Although he still had not submitted material for a doctoral thesis, Popov began publishing high quality papers in several languages. Those published in\n1949\n-\n51\nincluded:\nSur la condition d'intégrabilité de Karamata de l'équation de la balistique extérieure\nⓉ\n(\nOn Karamata's Integrability condition of the outer ballistic equation\n)\n(\nSerbian\n)\n(1949)\n;\nContribution à la géométrie du triangle\nⓉ\n(\nContribution to the geometry of the triangle\n)\n(\nMacedonian\n)\n(1949)\n;\nSur une condition d'intégrabilité de d'Alembert relative à l'équation différentielle de la balistique\nⓉ\n(\nOn a d'Alembert integrability condition relating to the differential equation of ballistics\n)\n(\nMacedonian\n)\n(1950)\n;\nSur une équation algébrique proposée par Pitoiset\nⓉ\n(\nOn an algebraic equation proposed by Pitoiset\n)\n(1951)\n;\nSur une équation algébrique\nⓉ\n(\nOn an algebraic equation\n)\n(\nMacedonian\n)\n(1951)\n;\nOn a property of the derivatives of orthogonal polynomials\n(1951)\n;\nFactorization of an operator\n(\nMacedonian\n)\n(1951)\n; and\nRemarque sur l'équation de Riccati\nⓉ\n(\nNote on the Riccati equation\n)\n(\nMacedonian\n)\n(1951)\n. In\n1952\nhe submitted his thesis\nFormation des critériums de réductibilité des équations différentielles linéaires ayant des formes données à l'avance\nⓉ\n(\nFormation of reducibility criteria for linear differential equations having given forms\n)\n(\nMacedonian\n)\nand he was awarded the degree in\n1953\n. His\n68\n-page thesis was published by the Faculty of Philosophy of the University of Skopje in a\n1952\npublication which, however, only appeared in print in\n1954\n.\nWhen Dragoslav Mitrinovič left the University of Skopje in\n1951\n, Popov became head of the Department of Mathematics. Promoted to Assistant Professor in\n1953\nafter the award of his doctorate, and then to associate professor in\n1958\n, he became a full professor in\n1963\n. He was dean of the Faculty of Natural Sciences and Mathematics in Skopje from\n1958\nto\n1963\nand again from\n1985\nto\n1987\n, and Dean of the Faculty of Mathematics from\n1976\nto\n1978\n. From\n1967\nto\n1969\nhe was rector of the University of Skopje.\nPopov was a member of the\nMacedonian Academy of Sciences and Arts\nsince its formation, being one of the fourteen members elected on\n18\nAugust\n1967\nin the National Museum of Ohrid. In fact he was the only mathematician among these fourteen founding members. From\n1976\nto\n1979\nhe was secretary of the\nAcademy\n, from\n1980\nto\n1983\nhe was vice president, and from\n1985\nto\n1991\nhe was secretary of the\nAcademy\n's Department of Natural and Mathematical and Technical Sciences.\nSeveral research visits abroad by Popov should be mentioned. In\n1955\n-\n1956\nhe visited Paris and in\n1963\n-\n1964\nhe visited Hamburg. In the summer of\n1970\nhe visited West Virginia University in Morgantown in the United States and a report of this visit appeared in the\nRaleigh Register\nwhich we present\n[\n5\n]\n:-\nDr Blagoj S Popov, head of the department of Mathematics at the University of Skopje in Yugoslavia, is visiting West Virginia University this summer. His visit is being sponsored by the\nAmerican Academy of Arts and Sciences\nand the Yugoslav Council of Academies under an exchange program between the two countries. During his visit, which will end July\n20\n, Dr Popov will do research on special mathematical functions. \"At the moment I am interested in the problem of linearization of the product of orthogonal functions and the summation of certain series,\" Dr Popov said. \"It will be of interest to me to become acquainted with methods of present research\n(\nin America\n)\nand an exchange of ideas.\" Dr Popov is the author of\n35\npublications on special functions and differential equations and has published a textbook on calculus. He received his doctorate from the University of Skopje and has taught there since. He did postdoctoral work at the University of Paris and the University of Hamburg. Dr Popov will give a seminar talk on his research at a time to be announced, according to Professor Henry W Gould of the West Virginia University Department of Mathematics who is acting as host for the\nNational Academy of Sciences\n.\nPopov retired in\n1987\nat the age of sixty-four. The mathematical conference \"\n85\nYears of Professor Blagoj Popov's Life\", held in his honour, was organized by the Institute of Mathematics and Institute of Informatics of the Faculty of Natural Sciences and Mathematics of Saints Cyril and Methodius University of Skopje, Republic of Macedonia. The conference took place\n4\n-\n7\nSeptember\n2008\n, at Saints Cyril and Methodius University Congress Centre, Ohrid, on the shores of the Ohrid lake. There were about\n60\nparticipants from Macedonia and countries such as Austria, Bulgaria, Croatia, France, Netherlands, Romania, Serbia, Turkey, and the United States. Virginia Kiryakova writes in a publication arising from this conference about Popov's importance to Macedonian mathematics\n[\n3\n]\n:-\nThe Macedonian mathematicians faithfully recognize Professor Blagoj Popov as a founder, together with Professor Dragoslav Mitrinovič\n(\nhis Ph.D. adviser\n)\n, of Mathematical Analysis in Macedonia. His research interests and numerous publications\n(\nmore than\n70)\nare in the areas such as functions of complex variables and algebraic calculus, and, in particular, in the field of differential equations and special functions related to them. He had the chance to specialize and develop himself as a scientist, and to play his pioneering role in Macedonia at the time when this field became particularly important for the applications of mathematics to Engineering and Physics; the time of the first electrotechniques\n(\nrelated to systems of linear differential equations\n)\n, rocket techniques\n(\ndifferential equation with variable mass\n)\n, nuclear energy problems\n(\nspecial functions\nand differential equations of mathematical physics\n)\n, control theory, etc. Nowadays, looking back at the list of his publications, it appears that there is no kind of differential equation or special function that has not been studied by him! He had investigated: the equation of ballistics, the hypergeometric,\nRiccati\n,\nLegendre\n, confluent hypergeometric,\nBessel\n, Weber,\nHermite\n,\nDarboux\n,\nWhittaker\n, and\nLaplace\ndifferential equations; orthogonal polynomials,\nLegendre\n,\nGegenbauer\n,\nJacobi\n,\nHermite\n,\nLaguerre\n,\nBernoulli\n,\nBessel\n, and\nChebyshev\npolynomials, the associate spherical\nLegendre\nfunctions, the ultraspherical polynomials, the generalized\nLegendre\nand q-\nAppell\npolynomials.\nVirginia Kiryakova also writes about Popov's importance to Bulgarian mathematics\n[\n3\n]\n:-\nFor the Bulgarian mathematical audience, it is a great honour that Academician Blagoj Popov had been introduced to mathematical sciences during his studies in Sofia University, by our classical mathematicians, then being his lecturers in the Department of Physics and Mathematics. In the post-war years which saw the establishment and development of a new era for mathematical sciences in Balkan countries, Academician Blagoj Popov was in close collaboration with our older Bulgarian teachers and colleagues, both officially in the context of the Balkan Mathematical Union as well as on the basis of personal friendship. After a period of inactivity for the Balkan Mathematical Union, lasting more than a decade, after the political and structural changes since\n1989\nthe Mathematical Societies of the Balkan countries decided to revive the activities of the Balkan Mathematical Union and to establish a new organization, called \"Mathematical Society of South-Eastern Europe.\" In September\n2003\nin the Bulgarian winter resort Borovets, the first Congress of the Mathematical Society of South-Eastern Europe was held. At this Congress, Academician Blagoj Popov was honoured with the title of Foreign Fellow of the\nUnion of Bulgarian Mathematicians\n, and during the Ohrid conference, on the occasion of his\n85\nth anniversary, I had the pleasure to hand him another Bulgarian distinction, namely an Honorary Medal with a ribbon of the\nUnion of Bulgarian Mathematicians\n, for his essential contribution to the development and collaboration between the mathematical societies of the countries in South-Eastern Europe.\nPopov received other honours such as on the occasion of the\n40\nth anniversary of the\nMacedonian Academy of Sciences and Arts\nin November\n2007\n, he was decorated with the Order of Merit of the Republic of Macedonia for his \"rich scientific and research work.\"\nFollowing Popov's death on\n30\nOctober\n2014\n, a joint commemorative session of the\nMacedonian Academy of Sciences and Arts\nand the Faculty of Natural Sciences and Mathematics of the Saints Cyril and Methodius University of Skopje was be held on Tuesday\n4\nNovember\n2014\nfollowed by his burial in the City Cemetery \"Butel\", the largest cemetery in Skopje."
}