{
  "nome_completo": "Boris Grigorievich Galerkin",
  "nome_curto": "Boris G Galerkin",
  "ano_nascimento": "1871",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Galerkin/",
  "lugar_nascimento": "Polotsk, Belarus",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Boris Grigorievich Galerkin\ncame from a poor family and this was to mean that he had a harder time through his years of education than would otherwise have been the case. He attended secondary school in Minsk, then in\n1893\nhe entered the Petersburg Technological Institute. Here he studied mathematics and engineering but he needed to make money to survive so at first he took on private tutoring, then from\n1896\nhe worked as a designer.\nAfter graduating from the Technological Institute in\n1899\nhe got a job at the Kharkov Locomotive Plant. In\n1903\nGalerkin went to St Petersburg and there he became engineering manager at the Northern Mechanical and Boiler Plant.\nFrom\n1909\nGalerkin began to study building sites and construction works throughout Europe. In the same year he began teaching at the Petersburg Technological Institute. His first publication on longitudinal curvature also appeared in\n1909\n, work which carried on from beginnings which had been laid by\nEuler\n. This paper was highly relevant to his study of construction sites since the results were applied to the construction of bridges and frames for buildings.\nHis visits around European construction sites ended around\n1914\nbut his academic work then turned to the area for which he is today best known, namely the method of approximate integration of\ndifferential equations\nknown as the Galerkin method. He published his finite element method in\n1915\n.\nIn\n1920\nGalerkin was promoted to Head of Structural Mechanics at the Petersburg Technological Institute. By this time he also held two chairs, one in elasticity at the Leningrad Institute of Communications Engineers and one in structural mechanics at Leningrad University.\nIn\n1921\nthe\nSt Petersburg Mathematical Society\nwas reopened\n(\nit had closed in\n1917\ndue to the Russian Revolution\n)\nas the\nPetrograd Physical and Mathematical Society\n. Galerkin played a major role in the Society along with\nSteklov\n,\nSergei Bernstein\n,\nFriedmann\nand others.\nOther work for which Galerkin is famous is his work on thin elastic plates. His major monograph on this topic Thin Elastic Plates was published in\n1937\n. From\n1940\nuntil his death, Galerkin was head of the Institute of Mechanics of the\nSoviet Academy of Sciences\n.\nA T Grigorian, writing in\n[\n1\n]\n, describes other work:-\nGalerkin's scientific research in the theory of casing\n(1934\n-\n45)\nrevealed its broad application in industrial construction. His works in the field constitute a new direction in this important area. Galerkin was a consultant in the planning and building of many of the Soviet Union's largest hydrostations. In\n1929\n, in connection with the building of the Dnepr dam and hydroelectric station, Galerkin investigated stress in dams and breast walls with trapezoidal profile. His results were used in planning the dam.\nGalerkin's important work on the finite element method is described in\n[\n2\n]\nand\n[\n3\n]\n."
}