{
  "nome_completo": "Boris Vladimirovich Gnedenko",
  "nome_curto": "Boris Vladimirovich Gnedenko",
  "ano_nascimento": "1912",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gnedenko/",
  "lugar_nascimento": "Simbirsk (now Ulyanovskaya), Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Boris Vladimirovich Gnedenko\nwas born in Simbirsk but his family, who were of Ukrainian origin, moved to Kazan when he was only three years old and it was in Kazan that he received his school education. He was a brilliant school pupil. In\n1927\n, when he was only fifteen years old, Gnedenko tried to enter the University of Saratov. However, he was too young to meet the official entry requirements and only after he kept arguing his case did Lunacharskii, the Soviet Minister of Education, personally recommend that he be allowed to enter university.\nGnedenko himself wrote of his reasons for studying mathematics at university. Most mathematicians study the subject because they develop such a deep love of the topic. Gnedenko, however, studied mathematics because\n[\n11\n]\n:-\n... as an abstract science\n[\nit\n]\nwas beyond the understanding of the Communist Party functionaries, thus remaining out of their control. He therefore selected mathematics as his life study.\nIt is worth noting at this stage that Gnedenko's choice of mathematics did not save him from having the most severe problems with the Soviet authorities later in his life, as we describe below. It is also worth commenting that, even if he did not choose mathematics through a love of the subject when he was young, he certainly showed throughout his career that he deeply loved the topic. He graduated in\n1930\nafter only three years of university study. This was because the normal five year course was shortened to three years on account of a decision by the government. They also introduced a strange method of examining students, namely to divide them into groups and have only the group leader sit the examinations for the whole group. Gnedenko, as might be expected, was one of the group leaders who took the examinations and his whole group were awarded the high grades which he scored. He did not feel satisfaction, however, rather a feeling of humiliation at the whole procedure.\nFrom\n1930\nGnedenko taught at the Textile Institute in Ivanovo. This town, east of Moscow, was a centre for the textile industry and it had figures highly in the history of mathematics with people such at\nLuzin\nand\nKhinchin\nteaching at the polytechnic there. It was during this period that Gnedenko published his first papers on probability and statistics. These resulted from problems he studied concerning the reliability of the machines used in textile manufacture and his first papers were published in\n1933\n. He became deeply interested in probability theory after attending seminars by\nKolmogorov\nand\nKhinchin\n.\nIn\n1934\nGnedenko decided to resume his university studies at postgraduate level. He was awarded a scholarship which allowed him to undertake research at the Institute of Mathematics at Moscow State University. There he studied under\nKolmogorov\nand\nKhinchin\n. Kalashnikov writes in\n[\n11\n]\nthat Gnedenko :-\n... cared for them dearly and held them in the highest affection all his life. ...\nKolmogorov\nwas a connoisseur of art, and\n[\nGnedenko and\nKolmogorov\n]\ntalked at length about ancient Russian icons and architecture, poetry and history.\nGnedenko made other friendships at this time, becoming a close friend of\nSlutsky\nand other mathematicians, and his enthusiasm for his studies was not spoilt by the extremely difficult conditions\n[\n19\n]\n:-\n... during his first year he and eleven friends shared a room that was so bitterly cold that water left in a glass overnight froze solid.\nAlthough\nKhinchin\nsupervised Gnedenko's studies initially, he left in\n1935\nto spend two years at Saratov University, and\nKolmogorov\nthen took over as Gnedenko's supervisor. In June\n1937\nGnedenko was examined on his doctoral dissertation on the theory of infinitely divisible distributions. After the award of his doctorate he was appointed as an assistant researcher in the Mathematics Institute of Moscow State University.\nDuring the summer of\n1937\nGnedenko went on a hiking expedition to the Caucasus along with some fellow researchers. Although\nKolmogorov\ndid not spend as long as the others on the trip, he did take part for a while. It was a period when the researchers were able to talk about their mathematical ideas and profit greatly. However, they talked about many subjects and in the discussions on politics Gnedenko showed that he had little liking for the Soviet policies. This was to have the most severe consequences for him.\nAfter taking up his post as a research assistant in November\n1937\n, Gnedenko was conscripted into the Red Army on\n1\nDecember. He was sent to Bryansk but on\n5\nDecember he was arrested. He had been denounced by one of the members of the Mathematics Department who had been with him on the summer trip. Gnedenko was imprisoned with\n120\nother prisoners in a cell built for six people and was constantly interrogated about statements he had made on the summer trip. His interrogators demanded that he\n[\n24\n]\n:-\n... confirm that\nKolmogorov\nwas the ringleader of a group of \"enemies of the people\" centred in the mathematics department. Though interrogated daily over a six-month period, held in grim condition, and promised his release if he cooperated, he refused to admit even the possibility of such an interpretation, knowing that there could be no hard evidence, and that the fate of all, himself included, depended on his resolution.\nWithout warning he was released after six months and managed to return to his parent's home. After a great deal of difficulty, with strong support from\nKolmogorov\nand\nKhinchin\n(\nwhich of course was a brave move by these two who could have paid dearly for giving such support\n)\n, he was reinstated to his post of Research Assistant in\n1938\n. He retained a \"black mark\" on his record indicating that he was not to be trusted and, because of this, he was not allowed to join the Soviet army in\n1941\nwhen the German forces attacked. In other respects, however, he was able to live a normal life despite this terrifying start to his career.\nFrom\n1938\nGnedenko lectured at Moscow State University. He married Natalia Konstantinova in\n1939\nand they had two sons. He submitted his doctoral dissertation in\n1941\nand was awarded the doctorate in\n1942\n. Of course this was during World War II and for most of the war years he undertook military related research. There was a period when he was evacuated from Moscow and worked further east in the Soviet Union.\nIn\n1945\n, on the recommendation of\nKolmogorov\n, Gnedenko was elected to the\nUkrainian Academy of Sciences\n. He left Moscow and, after a brief spell in Kiev, he became professor at Lvov University. There he met\nBanach\nand\n[\n11\n]\n:-\n... he retained strong impressions of this meeting all his life.\nIn\n1949\nGnedenko was appointed as Head of the Physics, Mathematics and Chemistry Section of the\nUkrainian Academy of Sciences\nin Kiev and he became Director of the Kiev Institute of Mathematics. He held these posts until\n1960\nwhen he returned to Moscow University, becoming Head of the Department of\nProbability Theory\nin\n1966\n. He held this post for thirty years until his death.\nGnedenko produced a remarkable number of papers and books during his lifetime. Certainly there are over\n200\nitems in his list of publications, but this number increases substantially if further editions of books, translations into different languages etc. are taken into account. In fact he wrote several important books which we shall say a little about.\nIn\n1949\nhe published a work, jointly with\nKolmogorov\n,\nLimit Distributions for Sums of Independent Random Variables\nwhich contains a description of much of his early research. The book is based on courses given by Gnedenko and\nKolmogorov\nat Moscow and Lvov universities. It has three parts, the first part consisting of three introductory chapters while the second part is on general limit theorems. Included in this second part are sections on: general limit theorems for sums with independent summands; the concept of infinitely small summands; conditions necessary and sufficient that their sums have a given limiting distribution; convergence to the normal,\nPoisson\n, and unit distributions; and limit theorems for cumulative sums. The third part of the work is on summands with a common distribution function and includes discussion of principal limit theorems and convergence to the normal law.\nOne of Gnedenko's most famous books is\nCourse in the Theory of Probability\nwhich first appeared in Ukranian in\n1949\n. Written in a clear and concise manner, the book was very successful in providing a first introduction to probability and statistics. It has gone through eight Russian editions and has been translated into Chinese, English, French, German, Hungarian, Italian, Japanese, Polish, Vietnamese and Arabic. In\n1966\n, along with I V Kovalenko, he published\nIntroduction to queuing theory\n. A reviewer described the work as follows:-\nThis is an attractively written systematic exposition of the basic probabilistic methods of congestion theory. At the same time the book has the unusual merit of going far enough into explicit computations to be of practical interest to the applied operations analyst. The book is written on a mature level, but little probability theory beyond very elementary concepts or very intuitive ones is presupposed.\nIn his early work Gnedenko had been interested in probability as an abstract topic. However, in his later work his interests turned more towards applications to areas such as reliability and quality control. He wrote an important text\nMathematical methods of reliability\nin\n1965\nwith Belyaev and Solov'yev.\nGnedenko was not only interested in research into mathematical topics, but he was also interested in the teaching of these topics. For example, with Solov'yev, he wrote the elementary work\nMathematics and reliability theory\nin\n1982\nwhich aimed to give a popular account of the mathematical theory of reliability. In an elementary way the book describes the basic notions of reliability, lifetime distributions, redundant systems, renewal and maintenance theory, inclusion-exclusion principle, and the estimation of reliability.\nAnother work, this time aimed at secondary school pupils, was\nAn introduction to the speciality of mathematics\npublished in\n1991\n. The book was written for pupils who love mathematics and want to become mathematicians. The topics covered in this book are interesting in themselves and also, in the present context, because they tell us a good deal about Gnedenko's approach to mathematics. The topics include: the role of mathematics in science, technology, and life; a definition of \"mathematics\"; the abstract nature of the subject; mathematics as the language of science; interesting problems from various mathematical sciences; mathematical models; mathematical education; the history of mathematics including an appendix on Moscow University.\nGnedenko's interest in the history of mathematics extended well beyond his text aimed at secondary school pupils. He published much on this topic\n(\nwe list at least twelve articles in the References sections of the archive authored by Gnedenko\n)\nincluding the important\nOutline of the History of Mathematics in Russia\nwhich was not published until\n1946\nalthough he wrote it before the start of World War II. It is a fascinating book which looks at the history of mathematics in Russia in its cultural background. For example in discussing the pre-eighteenth century, Gnedenko considers the cultural influence of the medieval church and the role of the calendar. He discusses the founding of the\nSt Petersburg Academy of Sciences\n, paying particular attention to the life and work of\nEuler\n. The work of many famous mathematicians is discussed in detail such as that of\nLobachevsky\n,\nBunyakovsky\n,\nOstrogradski\n,\nChebyshev\n,\nMarkov\n,\nLyapunov\n, and\nKovalevskaya\n. Perhaps given Gnedenko's treatment in prison just before he wrote the book, it is not surprising that he makes every effort to be \"politically correct\" and plays down contributions by western mathematicians. For example he even manages to discuss non-euclidean geometry and\nLobachevsky\n's contributions without even mentioning\nBolyai\n.\nTo complete our account of Gnedenko we should give a feeling for his personality. For this we quote from\n[\n11\n]\n(\nwhich is itself quoted in\n[\n24\n]\n)\n. Gnedenko's favourite topics of conversation were:-\n... the inter-relationship of mathematics and its fields of application, problems of education, history, books, poetry, art, and many others. Speaking on any topic, Gnedenko did not insist on his insights although he did not hide them. He knew many interesting stories and told them with a deep sense of humour. Gnedenko enjoyed classical music, and had a large collection of records. Sometimes, when he was especially proud of some new purchase, he would propose that you listen to it. His taste in music was traditional, and he was not afraid to confess that he could not understand some modern composers. On other occasions, he would ask you to look through a new album of painting of old masters. This was, in fact, the method of communication typical of the older generation of Russian intellectuals."
}