{
  "nome_completo": "Boris Yakovlevic Bukreev",
  "nome_curto": "Boris Yakovlevic Bukreev",
  "ano_nascimento": "1859",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bukreev/",
  "lugar_nascimento": "Lgov, Kursk gubernia, Russia",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Boris Yakovlevic Bukreev\n's father was a graduate of Kharkov University and had become a school teacher in Lgov. The city is in western Russia in the province of Kursk, about\n65\nkm west of the provincial capital Kursk. The family had a tradition of school teaching, with Boris Yakovlevic's paternal grandfather also being a teacher. His early education was at home, after which he attended the classical Kursk\nGymnasium\n. From the second grade onwards he received a scholarship of\n16\nrubles per month. He showed great mathematical ability when at the Gymnasium as well as a great love of mathematics. In the summer of\n1878\nhe graduated from the Gymnasium having been awarded the silver medal in his final year.\nIn the autumn of\n1878\nBukreev entered the Faculty of Physics and Mathematics of Kiev University. The university had been founded in\n1834\nand had, from its foundation, a strong school of mathematics. In particular Vasilii Petrovich Ermakov\n(1845\n-\n1922)\n, who was especially interested in the pedagogy of mathematics, taught Bukreev. Ermakov was the first to show that some nonlinear\ndifferential equations\nof second order are simply related with linear differential equations of second order. His method became known as the 'Method of Ermakov'. Among all Bukreev's lecturers, Ermakov was the one who exerted the greatest influence on him as an undergraduate. But other outstanding lecturers in the Department of Mathematics also taught Bukreev including\nMikhail Egorovich Vashchenko-Zakharchenko\nand P E Romer. In addition to mathematics, he studied physics and among his teachers on this topic special mention should be made of M P Avenarius and N Schiller, the latter having worked with\nHelmholtz\nin Berlin before coming to Kiev. Other topics which Bukreev studied include: mechanics where be was taught by Ivan Ivanovich Rakhmaninov\n(1826\n-\n1897)\nfrom the Department of Mechanics; astronomy taught by Mitrofan Fedorovich Handrikov\n(1837\n-\n1915)\n, the Professor of astronomy; and chemistry taught by A Bazarov.\nIn\n1880\nBukreev showed he was one of the best students in the Faculty of Physics and Mathematics when he was awarded the Faculty's gold medal. He completed his first degree in\n1882\nand remained at the University of Kiev to train to become a university professor. His interests at this time were focussed on\nWeierstrass\n's theory of\nelliptic functions\nand this was the topic which he chose as the subject of his Master's Thesis\n(\nequivalent to an American/British Ph.D.\n)\n. This thesis was entitled\nOn the expansion of transcendental functions in partial fractions\nand as well as containing an impressive collection of new results, it also contained an historical introduction describing developments from\nGauss\nto\nMittag-Leffler\n. The authors of\n[\n2\n]\nwrite:-\nPublication of this thesis represented a significant contribution to Russian mathematical literature.\nBefore his thesis was published, Bukreev had published several articles such as\nOn some applications of a theorem of Mittag-Leffler\nand, around the time his thesis was published, another two articles appeared. Both were on\nevolutes\n, one being simply titled\nA note on evolutes\n.\nAfter completing his Master's thesis, Bukreev went on a research visit abroad. He visited Berlin where he heard lectures on the theory of hyperelliptic functions by\nKarl Weierstrass\n, lectures on the theory of Abelian functions and linear differential equations by\nLazarus Fuchs\n, and lectures on the theory of numbers from\nLeopold Kronecker\n. Bukreev undertook research on Fuchsian functions and, guided by\nFuchs\n, he had completed the work by the end of\n1888\n. The results of this research were submitted as his doctoral thesis\nOn the Fuchsian functions of rank zero\n. He defended his thesis in May\n1889\n. Fuchsian functions had been studied earlier by\nPoincaré\nbut his approach had been geometrical, while Bukreev's approach was entirely analytical. Bukreev determined the conditions for continuity of Fuchsian groups and constructed differential equations corresponding to each of the discontinuous groups.\nHe became an extraordinary professor of mathematics at the University of Kiev from\n1889\n, later being made an ordinary professor.\nVashchenko-Zakharchenko\nwas teaching at Kiev when Bukreev was appointed and he had a considerable influence on the direction of Bukreev's research. During the\n1890\ns Bukreev produced a series of high quality papers including:\nOn the theory of gamma functions\n;\nOn some formulas in the theory of elliptic functions of Weierstrass\n;\nOn the distribution of the roots of a class of entire transcendental functions\n; and\nTheorems for elliptic functions of Weierstrass\n. By the end of the\n1890\ns Bukreev's research interests had moved somewhat and he began to undertake research into\ndifferential geometry\n; in\n1900\nhe published\nA Course on Applications of Differential and Integral Calculus to Geometry\n. Although at this time his main position was in the University of Kiev, he also taught at the Women's College from\n1896\nand at the Kiev Polytechnic Institute from\n1898\n. He continued to teach at the Polytechnic Institute until\n1926\n.\nBukreev's work was broad and in addition to the areas of complex functions, differential equations, the theory and application of Fuchsian functions of rank zero, and geometry, he published papers on algebra such as\nOn the composition of groups\n(1900)\n. After\n1900\nhe became interested in the theory of series, publishing papers such as\nNotes on the theory of series\nand he also worked on the\nCalculus of Variations\n. His vigorous research activity did not prevent him from devoting time to teaching of the highest quality\n[\n2\n]\n:-\nHis scientific and pedagogical activities are inextricably linked together harmoniously and complement each other.\nBukreev incorporated into his lectures new mathematical ideas that he had developed himself and also the latest research which he had read about in current journals. He taught courses on analysis, differential and integral calculus and their applications to geometry, the theory of integration of differential equations, the theory of series, algebra, and other topics. He was the first to introduce a course entirely devoted to the theory of surfaces, beginning in\n1897\n. The way that he taught was greatly influenced by the style of teaching he had encountered from\nWeierstrass\n,\nKronecker\nand\nDedekind\n[\n2\n]\n:-\nDue to his teaching of the foundations of mathematical analysis in the\n1890\ns and\n1900\ns, the level at the University of Kiev was raised to new heights.\nThe basic principles Bukreev adopted as a teacher included ensuring completeness of coverage of the topic under discussion, accuracy and clarity of presentation, and presenting his material in simple language.\nThe Russian tsar was deposed in\n1917\nand the Bolsheviks, under the leadership of Lenin, came to power in the October Revolution of\n1917\n. The Communist government introduced major changes to the education system which greatly affected all university staff. This was a period in Ukraine when new organizational forms and new methods of teaching at secondary and tertiary levels were introduced. Kiev National University was transformed first into the Higher Institute of Education, then into the Institute of Education, then into the Physics, Chemistry and Mathematics Institute. Bukreev worked in all these different versions of the university. In\n1933\nthe University of Kiev was restored and at this time a Department of Geometry was created in the Mechanics and Mathematics Faculty; the first head of this Department was Bukreev.\nBukreev published a number of books which proved influential. For example:\nIntroduction to the theory of series\n;\nElements of the theory of determinants\n;\nCourse on definite integrals\n(1903)\n; and\nElements of algebraic analysis\n(1912)\n. The authors of\n[\n2\n]\nwrite:-\nThese books are written at a high scientific level, yet in simple and clear language. In many places, he provides historical information as well as literary references for those wishing to deepen their knowledge in a particular matter.\nIn\n1934\n, he published\nAn Introduction to the Calculus of Variations\n. In the Introduction he explains how important he sees the practical applications of his mathematics:-\nThe Calculus of Variations is central to the physical and mathematical sciences. All the rays coming from a number of subjects: geometry, mechanics, physics, engineering ... converges in that topic. One who is studying the Calculus of Variations not only repeats and learns infinitesimal analysis, but also understands that this analysis is a powerful tool to address the many issues that are of a purely practical nature.\nHe was interested in both projective and\nnon-Euclidean geometry\n, publishing about fifteen articles on this latter topic including\nEquidistant lines of constant geodesic curvature in the planimetry of Lobachevsky\n(1955)\nand\nLobachevskian geometry\n(1957)\n. Note that, remarkably, Bukreev was ninety-eight years old when this last mentioned paper was published. His most important book on non-Euclidean geometry was\nNon-Euclidean Planimetry in Analytic Terms\nwhich he published in\n1951\n. The book contains nine chapters: I. The geodesics as solutions of the\nEuler\nequation,\nGauss\ncurvature, geodesic curvature; II. Formula for the parallel angle; III. Equidistant curves and limit circles; IV. Motions; V. Geodesic triangles, concurrence of altitudes, medians, etc.; VI. Hyperbolic trigonometry; VII.\nLambert\nquadrilaterals; VIII. Area of triangles and circles, length of circles; IX. Realisation as geometry on the pseudosphere. H Busemann, in a review of the work, is not entirely complimentary:-\nThe book develops hyperbolic geometry from the point of view of differential geometry. It is very elementary and reliable, but without zest and elegance.\nBukreev also made many contributions to the history of mathematics writing biographies on the life and work of a number of mathematicians including Vasilii Petrovich Ermakov,\nMikhail Egorovich Vashchenko-Zakharchenko\n, and\nGaspard Monge\n. Having seen many events in the history of Russian mathematics and the history of the University of Kiev, Bukreev was able to recount many interesting episodes from his personal experience. In\n1956\nBukreev spoke at the special ceremonial meeting of the Academic Council of the Faculty of Mechanics and Mathematics of Kiev University on the topic\nA hundred years from the death of N I Lobachevsky\n. We note that\nLobachevsky\ndied only three years before Bukreev was born, yet he was able to give the address at the celebrations for the centenary of his birth.\nBukreev also contributed to high school education showing a keen interest in the teaching of elementary mathematics. From\n1907\nto\n1917\n, he gave the annual reviews of the written examinations in mathematics in high schools in the Kiev district. He also played a major role in university affairs serving as Chairman of the Finance Committee and Vice Dean of the Faculty of Natural Sciences. In\n1922\nhe was elected a member of the Central Committee of the USSR Union of Educators, and was elected as chairman of the Qualification Commission. In\n1925\n, Bukreev travelled to Leningrad, as a delegate from the Kiev Polytechnic Institute, to deliver his address on\n200\nth\nanniversary of the founding of the\nRussian Academy of Sciences\n.\nThe authors of\n[\n4\n]\nwrite:-\nFor\n60\nyears, Boris Yakovlevic was the Head of Department at the University of Kiev, first in the chair of general mathematics, and then in the chair geometry. He directed the preparation of scientific workers and graduate students, helping young teachers just coming from school to master the skill of teaching. Due to his personal charm, Boris Yakovlevic was to his students not only a teacher but an older friend. His paternal attitude to students and young teachers whom he cared about, and his faithful performance of duty as a teacher and educator, served as an example to many of his young colleagues.\nIn\n1939\n, when World War II broke out, Bukreev was eighty years old. This proved an extremely difficult time for him. The German invasion in\n1941\nbrought severe suffering and destruction to Kiev. After a fierce\n80\n-day battle, German forces entered it on the\n19\nth\nSeptember\n1941\n. In\n1943\n, after bitter fighting, Soviet troops liberated Kiev on\n6\nNovember. The city itself had suffered great destruction but Bukreev was one of the first to return to the university. He found that the mathematical library and the mathematical models he had made had been destroyed by the occupying troops. Despite his advanced age, he began to rebuild the department, lecturing in half unheated lecture theatres during severe frosts in January\n1944\n. Bukreev had joined the\nMoscow Mathematical Society\nin\n1893\nand the fiftieth anniversary of his joining fell in the middle of the war. However, in\n1946\nthe\nMoscow Mathematical Society\nhonoured his achievement, making him an honorary member.\nWhen he reached his\n100\nth\nbirthday he was greatly honoured. The authors of\n[\n4\n]\nwrite this summary of his contributions:-\nThe work of Boris Yakovlevic Bukreev shows the closely intertwined aspirations of the teacher and scholar. Boris Yakovlevic worked on the theory of functions of a complex variable, on mathematical analysis, on algebra, on the calculus of variations, and on differential geometry. Recently, he has focused on the geometry of\nLobachevsky\n, promoting and developing the eternal ideas of the great Russian geometer. Boris Yakovlevic educated generations of mathematicians. Many of his students later became outstanding scientists. His lectures inspired generations of listeners. He aimed to kindle in them a spark of independent creative thought and carefully fostered the development of their scientific interests. In many parts of the Soviet Union, even in its most remote corners, there are people who know Boris Yakovlevic and remember him with love. There were many telegrams and letters for him on the day of his anniversary. Boris Yakovlevic did not always personally know the authors of these letters, but they all considered themselves his disciples by reading his books from which they learned to love mathematics."
}