{
  "nome_completo": "Calogero Vinti",
  "nome_curto": "Calogero Vinti",
  "ano_nascimento": "1926",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vinti/",
  "lugar_nascimento": "Agrigento, Sicily, Italy",
  "lugar_morte": "Perugia, Italy",
  "biografia": "Calogero Vinti\nwas brought up in his home town of Agrigento, close to the southern coast of Sicily. An important influence in Calogero's early education was an uncle who was a canon in the Cathedral San Gerlando in Agrigento. Calogero's education was disrupted by the events of World War II, particularly the allied invasion of Sicily in July\n1943\n. However, once the war had ended, he was able to begin his university education at the University of Palermo. There he studied under\nMichele Cipolla\nwho was a leading researcher in algebraic analysis, Benedetto Pettineo\n(1922\n-\n1989)\n, a student of\nCipolla\n's who had obtained his Laurea in\n1944\nand was publishing fundamental work in analysis, and\nEmilio Baiada\n(1914\n-\n1984)\nwho had been a student of\nLeonida Tonelli\n.\nIn\n1949\nVinti graduated from Palermo with his Laurea. His official advisor had been Pettineo but it was\nBaiada\nwho was the strongest influence on him. He remained at Palermo undertaking research on partial differential equations and when\nBaiada\nreturned from three years studying in the United States in\n1952\n, the two began a close collaboration. They jointly published the\n45\n-page paper\nUn teorema d'esistenza della soluzione per un'equazione alle derivate parziali del\n1\n° ordine\nⓉ\n(\nAn existence theorem of solution to a partial differential equation of\n1\nst order\n)\nin\n1955\nand also\nUn'applicazione della definizione di integrale per stabilire un passaggio al limite sotto il segno\nⓉ\n(\nAn application of the full definition to determine a passage to the limit under the sign\n)\nin the same year. The first of these papers gives an existence theorem for the equation\nz\nx\n=\nf\n(\nx\n,\ny\n,\nz\n,\nz\ny\n)\nz_{x} = f (x, y, z, z_{y})\nz\nx\n​\n=\nf\n(\nx\n,\ny\n,\nz\n,\nz\ny\n​\n)\nusing methods which had been developed by\nBaiada\na couple of years earlier in solving a simpler equation. The next two publications by Vinti,\nUna ripartizione del continuo ed una osservazione sulle funzioni continue rispetto ad una e non misurabili rispetto ad un'altra variabile\nⓉ\n(\nA division of continuous and an observation on continuous functions with respect to a measurable and not compared to another variable\n)\n(1957)\nand\nL'integrale di Weierstrass\nⓉ\n(\nThe integral of Weierstrass\n)\n(1957)\nwere single-authored but still greatly influenced by\nBaiada\n.\nVinti, who continued to work in Palermo, was very active in research over the next few years becoming a lecturer in analysis in\n1960\n. As well as many significant papers continuing the themes of his earlier work, he did important work with\nBaiada\non perimeters of sets. They presented some of their results on this topic in the paper\nGeneralizzazione non markoviana della definizione di perimetro\nⓉ\n(\nGeneralization of non-Markov perimeter definition\n)\ngiven at the Celebrazioni Archimedee del Sec. XX in Syracuse  in\n1961\n.\nBaiada\nleft Palermo and moved to Modena when he was appointed Professor of Mathematical Analysis at the University of Modena. He was keen for Vinti to join him and, in\n1962\n, Vinti joined the faculty at the University of Modena.\nHe remained there until\n1970\nwhen he was named Professor of Analysis at the University of Perugia. At Perugia he gave the Department of Mathematics an international reputation with many leading researchers visiting his large research group. Among his most important publications during his years in Perugia, we mention\nOn the Weierstrass integrals of the calculus of variations over BV varieties: recent results of the mathematical seminar in Perugia\n(1989)\nand\nProblems associated with the theory of finitely additive measures: some recent results of the Scuola Matematica Perugina\n(1990)\n. He also established the Mathematical Summer Courses at Perugia, where lecturers from many countries gave courses on their speciality to the most talented young mathematicians. Let me add as a personal note that I\n[\nEFR\n]\ngave\n25\nlectures on Group Theory to this Summer School in\n1986\n. The five weeks of the Summer School was an unforgettable experience, teaching enthusiastic bright students in the stunningly beautiful city of Perugia. One of the important developments that Vinti undertook at Perugia was founding the Faculty of Engineering. He was made dean of the Faculty on its foundation in\n1986\nand served in this capacity until\n1995\n.\nVinti was married to Marisa whom he first met when they were both students checking their examination results in Rome. Their eldest son Stefano became a lawyer and Professor in Rome while their son Gianluca became a mathematician with interests in approximation theory similar to those of his father. We have mentioned some of Vinti's research contributions, but the range of his work is best seen from the publication\n[\n1\n]\ncontaining a selection of his papers. The Introduction explains this broad range:-\nThe scientific interests of Calogero Vinti covered several areas of Mathematical Analysis, from Calculus of Variations to Differential Equations, from Approximation Theory to Real Analysis and\nMeasure Theory\n. This volume collects the most important contributions in these different topics. ... Beyond the mere scientific interest and the depth of the many original results, this collection has also a strong historical value, since it demonstrates the wide variety of his interests and emphasizes mostly the evolution of his research and the connections among the different themes, that were never seen as separated topics, but were always naturally treated in an interdisciplinary fashion.\nIn addition to writing papers, Vinti also wrote some textbooks on mathematical analysis. He published two volumes of\nLezioni di Analisi matematica\nⓉ\n(\nMathematical analysis Lessons\n)\nand, with his colleague Carlo Bardaro, the book of exercises\nComplementi ed Esercizi di Analisi Matematica\nⓉ\n(\nAdditions and exercises of mathematics analysis\n)\n.\nLet us now quote from some of the references to get a feeling for Vinti's character. Julian Musielak writes\n[\n8\n]\n:-\nIt was May\n1993\n, as I met the first time Professor Calogero Vinti, on the occasion of my first visit to the Università degli Studi di Perugia. ... Later we met many times during my consecutive visits to the Dipartimento di Matematica e Informatica of the University of Perugia, and to international conferences held in Italy. We met on the occasion of lectures, mathematical discussions, social events. I was many times a guest in his home, together with my wife Helena. There were the Professor and his wife Marisa, his son Gianluca, Professor Carlo Bardaro with his wife, my scientific collaborators, and usually some other friends. The more I knew him, the more I admired his personality. ... A professor caring for his students ... But also a man of great culture, a true son of the Italian soil, where one can find more pieces of art in a small town, than in a whole country elsewhere. A wise man, untouched by the totalitarian ideologies of the last century, friendly to the people, clear in logical thinking.\nPaul Butzer\nexpresses in\n[\n5\n]\nhis:-\n... deep appreciation and thanks to a man who not only influenced the science of mathematics, but whose kindness and sincerity made a tremendous impact on the people who knew him.\nButzer\nwas invited by Vinti to lecture at a conference in Capri in\n1990\n[\n5\n]\n:-\nDuring my visit to Capri, I was also the thankful recipient of one of Calogero's most memorable acts of generosity to me: the unique hotel suite overlooking the beautiful Island of Capri that had been reserved for him and his spouse, Marisa.\nVinti received many honours for his mathematical contributions. For example, his\n70\nth\nbirthday was marked by the 'Conferenze in Onore di Calogero Vinti' at the University of Perugia in September\n1996\n. In the same year his achievements were recognised by the award of one of the most prestigious prizes in Italian universities, the Diploma di Medaglia d'Oro ai Benemeriti della Scienza, dell'Arte e della Cultura. After his death, the\nItalian Mathematical Union\nset up the \"Calogero Vinti Prize\" in\n1998\nto be awarded to a young mathematician who had made significant contributions to one of the fields in which Vinti had worked. Also in\n1998\n, on the first anniversary of his death, the Engineering Faculty at Perugia had a memorial day on which they dedicated a plaque to his honour. This reads\n(\nin translation\n)\n:-\nCalogero Vinti, distinguished Master, Founder and first Dean of this Faculty, in memory of his fruitful work for the development of the Atheneum.\nHis final paper was\nA survey on recent results of the mathematical seminar in Perugia, inspired by the work of Professor P L Butzer\n(1998)\n.\nButzer\nwrites that this last paper\n[\n5\n]\n:-\n... appeared in the Birkhauser international journal 'Results in Mathematics'; written in extreme pain, a witness to his perseverance, his passionate love for research and his willingness to continue transmitting his scientific knowledge to the end. This showed once again his great generosity, and the love which he related to his students."
}