{
  "nome_completo": "Carl Schoy",
  "nome_curto": "Carl Schoy",
  "ano_nascimento": "1877",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schoy/",
  "lugar_nascimento": "Bittelschiess, near Messkirch, Germany",
  "lugar_morte": "Frankfurt am Main, Germany",
  "biografia": "Carl Schoy\n's name often appears as\nKarl Schoy\n(\nin fact the reader will see that about half the references give his name as Carl and half give Karl\n)\n. His father was a school teacher and he was born in a village in a rural environment in the south of Germany, north of the Bodensee. Carl grew up in a Roman Catholic family along with his two brothers and his sister. Since his father was a teacher, there were lots of books in his home and, as Carl grew up, he would read the books, study an atlas, and try to understand the printed music. Of course, living in the countryside he became fascinated by the wildlife and flowers that he saw around him. He began to make his own maps and, from gazing at the clear starry sky, he developed an interest in geography and in astronomy that would remain throughout his life.\nAs for many young boys of that time, there was a built in assumption that he would follow his father and so Carl was expected to become a school teacher. This meant that Carl and his two brothers all attended the teachers' training college in Meersburg on the Bodensee. Schoy did not perform particularly well at the college. He had so enjoyed the freedom of the environment where he grew up that he did not enjoy the restrictions that a boarding school imposed on him. His best subject was geography following on from the interests he had developed while at home. He showed considerable talents at music, which he deeply loved, but his mathematical talents were still not, at this stage, brought to the fore. However, he began to realise that being an elementary school teacher was not the career for him. He had already begun to feel the urge to undertake research so he decided that he would try for a university education. It was during his final year in Meersburg that he became interested in mathematics and he prepared to sit his final secondary school examinations in\n1901\nat the high school in Karlsruhe so that he might gain admission to a university. In the autumn of\n1901\nhe matriculated at the University of Munich where he studied until Easter\n1905\n. Like many German students of this time, Schoy spent a semester at a different university and he chose to spend the winter semester of\n1904\nat the University of Heidelberg. Schoy had a remarkable desire to study the widest range of subjects but his main effort was put into courses in mathematics and astronomy.\nAt the University of Munich he attended courses by Siegmund Günther\n(1848\n-\n1923)\n, who taught geography, natural sciences and the history of mathematics. He was also taught by Anton von Braunmühl\n(1853\n-\n1908)\n, a mathematician who, among other topics, was interested in the history of mathematics. As well as teaching Schoy mathematics and science, these two professors gave him a deep interest in the history of mathematics. Hugo von Seeliger\n(1849\n-\n1924)\nwas the Professor of Astronomy and Director of the Observatory at the University of Munich and he had an outstanding reputation both as an astronomer and as a teacher.\nGustav Herglotz\nand\nKarl Schwarzschild\nhad been among Seeliger's students. Seeliger saw that Schoy was a bright young man and gave him excellent advice as well as teaching him the methods of modern astronomy. He also arranged for Schoy to give private tuition at the Observatory and so enabled him to gain sufficient funds to carry on with his studies. Schoy would have liked to have made a career in an observatory or in a geographical institute after his university studies but the situation in the country meant that such an appointment looked almost impossible. He therefore decided to become a secondary school teacher.\nIn\n1906\nhe received, from the University of Munich, his qualification to teach mathematics at\ngymnasiums\nin Prussia. His first teaching positions were temporary ones in Baden-Baden and Mannheim. With little prospects of a permanent position in Baden, he moved north where he was employed as an assistant teacher of science at Mülheim an der Ruhr in\n1908\n, moving to Essen where he began teaching mathematics as a senior teacher on\n1\nApril\n1909\n. Frieda Ettwig\n(1889\n-\n1962)\n, who had entered the Realgymnasium in Essen in\n1907\n, was one of Schoy's pupils. They became friends and were married in\n1912\n. We give more details of Frieda below.\nSchoy worked as a teacher in the Realgymnasium in Essen over the following years but also continued research for his doctorate. His thesis advisors were Siegmund Günther and Sebastian Finsterwalder\n(1862\n-\n1951)\nat the Department of Analytical Geometry, Differential and Integral Calculus at the Technical University of Munich. Finsterwalder, known as \"the father of glacier photogrammetry\", had studied for his doctorate at the University of Tübingen advised by\nAlexander von Brill\n. Schoy was awarded his doctorate, a Dr. Ing., in\n1911\nfor his thesis\nDie geschichtliche Entwicklung der Polhöhenbestimmungen bei den älteren Völkern\nⓉ\n(\nThe historical development of pole altitude rules among older people\n)\n. He had already published the paper\nBeiträge zur konstruktiven Lösung sphärisch-astronomischer Aufgaben\nⓉ\n(\nContributions to the constructive solution spherically-astronomical objects\n)\n(1910)\n. He submitted his thesis\nArabische Gnomonik\nⓉ\n(\nArabic gnomons\n)\nfor a doctorate in natural philosophy to the University of Heidelberg in\n1913\n. In the same year he published\nVermischte Aufgaben der mathematischen Geographie und sphärischen Astronomie mit vollständigen Lösungen\nⓉ\n(\nMixed problems of mathematical geography and spherical astronomy with complete solutions\n)\n. His next work was\nÜber die Anwendung der Geometrie auf elementare Aufgaben der mathematischen Geographie\nⓉ\n(\nOn the application of geometry to elementary tasks of mathematical geography\n)\n(1914)\n.\nThe years of World War I\n(1914\n-\n1918)\nwere very difficult ones for Carl and Frieda Schoy. Between\n1915\nand\n1918\nFrieda studied at the Essen School of Applied Arts training to become a bookbinder. However, there were food shortages, and Schoy's health problems, which had begun when he was still in Munich, continued to get worse. He had stomach and kidney disease which became more severe due to the harsh wartime conditions. In the summer vacations the Schoys would travel south and spend some time in much more pleasant surroundings. However, even this involved travelling considerable distances which was not easy in wartime Germany. In the summer of\n1917\nSchoy took the opportunity to increase his expertise in the Arabic language. He could already read Arabic having taught himself, but he gained much in studying with Christian Friedrich Seybold\n(1859\n-\n1921)\n, an orientalist at the University of Tübingen, over the summer of\n1917\n. In\n1919\nhe left Essen and\nhabilitated\nin the History of mathematics and astronomy at the University of Bonn. However following the defeat of Germany in World War I the Treaty of Versailles meant that Bonn was occupied first by British and Canadian troops and then from\n1920\nto\n1926\nby French troops. Teaching at the university in the occupied city was almost impossible so Schoy still could not fulfil his dream of teaching university students. However, his research contributions over this period were remarkable. The following list of some of his publications over these years is taken from\n[\n9\n]\n:\nDas\n20\n. Capitel der grossen Hakimitischen Tafeln des Ibn Junis: Über die Berechnunig des Azimuts aus der Höhe und der Höhe aus dem Azimut\nⓉ\n(\nThe\n20\nth chapter of the great Hakimi tables of Ibn Yunis: Calculating the azimuth of the altitude and the altitude of the azimuth\n)\n(1920)\n;\nAbhandlung des Hasan ibn al-Husain ibn al-Haitam: Ueber eine Methode, die Polhöhe mit grösster Genauigkeit zu bestimmen\nⓉ\n(\nTreatise of Hasan ibn al-Husayn ibn al-Haytham: How to find the pole altitude with the greatest accuracy\n)\n(1920)\n;\nÜber eine arabische Methode die geographische Breite aus der Höhe im\n1\n. Vertical\n(\nHöhe ohne Azimut\n)\nzu bestimmen\nⓉ\n(\nOn an Arabic method to determine the latitude from the vertical altitude\n(\naltitude and azimuth\n)\n)\n(1921)\n;\nAbhandlungen des al-Hasan ibn al-Hasan ibn al-Haitam\n(\nAlhazen\n)\nüber die Bestimmung der Richtung der Qibla\nⓉ\n(\nTreatises of al-Hasan ibn al-Hasan ibn al-Haytham\n(\nAlhazen\n)\non the determination of the direction of the Qibla\n(\nthe direction of Mecca\n)\n)\n(1922)\n;\nAbhandlung von al-Fadl ibn Hâtim an-Nairîzî: Über die Richtung der Qibla\nⓉ\n(\nTreatise of al-Fadl ibn Hatim at-Nairizi: On the direction of the Qibla\n(\nthe direction of Mecca\n)\n)\n(1922)\n;\nDie Bestimmung der geographischen Breite eines Ortes durch Beobachtung der Meridianhöhe der Sonne oder mittels der Kenntnis\n2\ner anderer Sonnenhöhen und den zugehörigen Azimuten, nach dem arabischen Text der Hakimitischen Tafeln des Ibn Yunus\nⓉ\n(\nThe determination of the latitude of a place by observing the meridian altitude of the sun or by the knowledge of\n2\nother sunrises and the associated azimuths from the Arabic text of Hakimi tables of Ibn Yunus\n)\n(1922)\n;\nAbhandlung über die Ziehung der Mittagslinie dem Buche über das Analemma entnommen, samt dem Beweis dazu, von Abu Sa'id ad-Darlr\nⓉ\n(\nTreatise on the contraction of the meridian line of the book taken from the analemma, together with the evidence to Abu Sa'id ad-Darlr\n)\n(1922)\n;\nAus der astronomischen Geographie der Araber: Originalstudien nach al-Qänun al-Mas'udi des Al-Birûni\nⓉ\n(\nOn the astronomical geography of the Arabs: Original studies by al-al-Qänun Mas'udi of Al-Biruni\n)\n(1922)\n;\nGnomonik der Araber\nⓉ\n(\nGnomons of the Arabs\n)\n(1923)\n;\nBeiträge zur arabischen Trigonometrie\nⓉ\n(\nContributions to Arabic trigonometry\n)\n(1923)\n;\nÜber den Gnomonschatten und die Schattentafeln der arabischen Astronomie\nⓉ\n(\nOn the gnomon shadows and shade tables of Arabic astronomy\n)\n(1923)\n;\nSonnenuhren der spätarabischen Astronomie\nⓉ\n(\nSundials of the late Arab astronomy\n)\n(1924)\n;\nThe geography of the Moslems of the Middle Ages\n(1924)\n;\nDie Bestimmung der geographischen Breite der Stadt Gazna mittels Beobachtungen im Meridian, durch den arabischen Astronomen und Geographen al-Birûni\nⓉ\n(\nThe determination of the latitude of the city of Ghazni\n(\nAfganistan\n)\nby observations in the meridian, by the Arab astronomer and geographer al-Biruni\n)\n(1925)\n;\nDrei planimetrische Aufgaben des arabischen Mathematikers Abû'l-Jûd Muhammed ibn al-Lith\nⓉ\n(\nThree planimetric tasks of the Arab mathematician Abu'l-Jud Muhammad ibn al-Lith\n)\n(1925)\n;\nAbhandlung des Schaichs Ibn Ali al-Hasan ibn al-Hasan ibn al-Haitham: Über die Natur der Spuren\n(\nFlecken\n)\n, die man auf der Oberfläche des Mondes sieht\nⓉ\n(\nTreatise of Sheikh Ibn Ali al-Hasan ibn al-Hasan ibn al-Haitham: On the nature of the tracks\n(\npatches\n)\nthat can be seen on the surface of the moon\n)\n(1925)\n;\nDie trigonometrischen Lehren des Muhammed ibn Ahmad, Abû'l-Rihân al-Birûni\nⓉ\n(\nThe trigonometric teachings of Muhammad ibn Ahmad, Abu'l-Rihan al-Biruni\n)\n(1925)\n.\nReviewing the second last of these works, a\n33\n-page booklet, A R Guest writes\n[\n4\n]\n:-\nThe truth as to the merits of the mediaeval Arab writers on science will not appear until a more thorough examination of their works has been made. Dr Schoy, who has already done a good deal in this direction for Arab mathematics, points out in the preface to his translation what can be gathered from this modest little treatise.\nIbn al-Haytham\n, the author, a well-known mathematician and scientist, many of whose works have been preserved, lived at Cairo in the beginning of the eleventh century of our era. In discussing the nature of the spots on the moon, he examines a number of erroneous theories prevalent and refutes them one by one; he then arrives at conclusions quite near those of science of today, and one may well marvel at what he accomplishes with no means other than those of his own unaided vision. He achieves his discovery not only by careful reasoning, but as it seems also by much accurate personal observation. Students of the history of science should read the book.\nDavid E Smith\n, considering the papers, pamphlets and monographs by Schoy listed above, writes\n[\n9\n]\n:-\nAny such an array of monographs, each based upon a study of original manuscripts, would be impressive merely on the score of number, but in this case the product is even more so in respect to scholarship. To give, as in his article on the \"Geography of the Moslems of the Middle Ages,\" the first translation of the method of\nIbn Yûnus\nfor finding longitude by observing solar eclipses; to show by means of a translation from Sibt al-Mâridinî that the Egyptians of the Middle Ages were the first to use a sundial directed towards the world pole; to be the first to give us a translation of Ibn Ali al-Hasan's work on the interpretation of the irregularities of the lunar surface; and to make more clearly known, by accurate translations, the nature of the umbra recta and umbra versa in the leading Arabic works on trigonometry, - these\n(\nto mention only a few instances\n)\nare gratifying promises of future contributions of great moment.\nSmith\n's final comment is somewhat ironical given the following note he attached to his paper:-\nThe day after reading the proof of the above article word was received of the sudden death of Dr Schoy, on December\n6\n,\n1925\n, as the result of an apoplectic stroke. He was forty-eight years of age and had not been in good health for some time, as his latest letter to me showed. His funeral took place at Frankfurt am Main on December\n9\n. Thus passes away a brilliant scholar and an indefatigable worker. Not until he was about forty years of age did he find his real life work, but in the few years that followed he made remarkable progress.\nLet us give a little more information about the last years of Schoy's life. In\n1923\nhe was admitted to hospital for major stomach surgery. In an attempt to restore his health, Schoy and his wife went for a trip to the French Riviera in April and May\n1924\n. He delighted to enjoy days in the sun, by the sea, surrounded by plants and flowers, and listening to the French accents that he heard around him. On\n1\nOctober\n1925\n, Schoy achieved his life long ambition when he took up an appointment as \"Lehrauftrag fur Geschichte der exacten Naturwissenschaften im Orient\" in the University of Frankfurt am Main. He collapsed after five weeks teaching and died from a stroke. George Sarton, reviewing one of Schoy's books published after his death, writes\n[\n8\n]\n:-\nThe premature death of our friend Carl Schoy was peculiarly tragical. Very few persons will ever be qualified to advance our knowledge of Muslim mathematics, for such qualification involves a very rare combination of qualities. One needs to be a mathematician and astronomer, have a good knowledge of Arabic or Persian or both, historical sense, palaeographical experience, and be ready, as for any worthwhile achievement, to spend one's time and energy without counting. Schoy combined all these qualities, that is, he had gradually combined them at the cost of long studies and in spite of ill health and increasing discomfort. His first study on Arabic astronomy appeared in\n1911\nand during the following fifteen years he had produced a good many valuable papers. It is hardly necessary to insist upon this, as many of these papers appeared in Isis, both before and after his death. He left behind a large number of manuscripts, some ready for publication, others in various stages of completion. We all felt that Schoy, if he had been granted to live ten or twenty years longer, would have increased considerably our understanding of oriental mathematics and astronomy. Valuable as his early studies were, his knowledge and experience were continually increasing, and we felt that the very best that he could give us was still to come. But it was not to be!\nR B McClenon, reviewing the same work, writes in his review\n[\n5\n]\n:-\nWith the death of Carl Schoy on December\n6\n,\n1925\n, scholarship in the field of history of exact science suffered a severe and irreparable loss. In his short life time, Schoy had done much very valuable work in uncovering the buried treasures of Arabian mathematics, including in particular many on astronomical and geographical subjects. In his earlier years handicapped by poverty, and later by an insidious and incurable disease, Schoy's career compels our admiration for his never-failing courage and indomitable will, no less than for his scientific achievements. The book under review was finished and prepared for the press by the author in\n1924\n, but was not published until after his death, when it was seen through the press by J Ruska and H Wieleitner. Although it is the most extensive published work of the author, he had designed it to be only a small section in a history of Arabian mathematics which he was planning to write. ... This book is a very valuable addition to the primary sources of information about Arabian mathematics, and emphasizes the greatness of the loss which its author's premature death has caused."
}