{
  "nome_completo": "Johann Carl Friedrich Gauss",
  "nome_curto": "Carl Friedrich Gauss",
  "ano_nascimento": "1777",
  "ano_morte": "1855",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gauss/",
  "lugar_nascimento": "Brunswick, Duchy of Brunswick (now Germany)",
  "lugar_morte": "Göttingen, Hanover (now Germany)",
  "biografia": "At the age of seven,\nCarl Friedrich Gauss\nstarted elementary school, and his potential was noticed almost immediately. His teacher, Büttner, and his assistant,\nMartin Bartels\n, were amazed when Gauss summed the integers from\n1\nto\n100\ninstantly by spotting that the sum was\n50\npairs of numbers each pair summing to\n101\n.\nIn\n1788\nGauss began his education at the\nGymnasium\nwith the help of Büttner and\nBartels\n, where he learnt High German and Latin. After receiving a stipend from the Duke of Brunswick- Wolfenbüttel, Gauss entered Brunswick Collegium Carolinum in\n1792\n. At the academy Gauss independently discovered Bode's law, the\nbinomial theorem\nand the arithmetic- geometric mean, as well as the law of\nquadratic reciprocity\nand the\nprime number theorem\n.\nIn\n1795\nGauss left Brunswick to study at Göttingen University. Gauss's teacher there was\nKästner\n, whom Gauss often ridiculed. His only known friend amongst the students was\nFarkas Bolyai\n. They met in\n1799\nand corresponded with each other for many years.\nGauss left Göttingen in\n1798\nwithout a diploma, but by this time he had made one of his most important discoveries - the construction of a regular\n17\n-gon by\nruler and compasses\nThis was the most major advance in this field since the time of Greek mathematics and was published as Section VII of Gauss's famous work,\nDisquisitiones Arithmeticae\nⓉ\n(\nInvestigations in arithmetic\n)\n.\nGauss returned to Brunswick where he received a degree in\n1799\n. After the Duke of Brunswick had agreed to continue Gauss's stipend, he requested that Gauss submit a doctoral dissertation to the University of Helmstedt. He already knew\nPfaff\n, who was chosen to be his advisor. Gauss's dissertation was a discussion of the\nfundamental theorem of algebra\n.\nWith his stipend to support him, Gauss did not need to find a job so devoted himself to research. He published the book\nDisquisitiones Arithmeticae\nⓉ\n(\nInvestigations in arithmetic\n)\nin the summer of\n1801\n. There were seven sections, all but the last section, referred to above, being devoted to\nnumber theory\n.\nIn June\n1801\n, Zach, an astronomer whom Gauss had come to know two or three years previously, published the orbital positions of Ceres, a new \"small planet\" which was discovered by\nG Piazzi\n, an Italian astronomer on\n1\nJanuary,\n1801\n. Unfortunately,\nPiazzi\nhad only been able to observe\n9\ndegrees of its orbit before it disappeared behind the Sun. Zach published several predictions of its position, including one by Gauss which differed greatly from the others. When Ceres was rediscovered by Zach on\n7\nDecember\n1801\nit was almost exactly where Gauss had predicted. Although he did not disclose his methods at the time, Gauss had used his least squares approximation method.\nIn June\n1802\nGauss visited Olbers who had discovered Pallas in March of that year and Gauss investigated its orbit. Olbers requested that Gauss be made director of the proposed new observatory in Göttingen, but no action was taken. Gauss began corresponding with\nBessel\n, whom he did not meet until\n1825\n, and with\nSophie Germain\n.\nGauss married Johanna Ostoff on\n9\nOctober,\n1805\n. Despite having a happy personal life for the first time, his benefactor, the Duke of Brunswick, was killed fighting for the Prussian army. In\n1807\nGauss left Brunswick to take up the position of director of the Göttingen observatory.\nGauss arrived in Göttingen in late\n1807\n. In\n1808\nhis father died, and a year later Gauss's wife Johanna died after giving birth to their second son, who was to die soon after her. Gauss was shattered and wrote to Olbers asking him to give him a home for a few weeks,\nto gather new strength in the arms of your friendship - strength for a life which is only valuable because it belongs to my three small children.\nGauss was married for a second time the next year, to Minna the best friend of Johanna, and although they had three children, this marriage seemed to be one of convenience for Gauss.\nGauss's work never seemed to suffer from his personal tragedy. He published his second book,\nTheoria motus corporum coelestium in sectionibus conicis Solem ambientium\nⓉ\n(\nTheory of the motion of the heavenly bodies surrounding the sun in conic sections\n)\n,  in\n1809\n, a major two volume treatise on the motion of celestial bodies. In the first volume he discussed\ndifferential equations\n,\nconic sections\nand elliptic orbits, while in the second volume, the main part of the work, he showed how to estimate and then to refine the estimation of a planet's orbit. Gauss's contributions to theoretical astronomy stopped after\n1817\n, although he went on making observations until the age of\n70\n.\nMuch of Gauss's time was spent on a new observatory, completed in\n1816\n, but he still found the time to work on other subjects. His publications during this time include\nDisquisitiones generales circa seriem infinitam\nⓉ\n(\nGeneral investigations of an infinite series\n)\n, a rigorous treatment of series and an introduction of the\nhypergeometric function\n,\nMethodus nova integralium valores per approximationem inveniendi\nⓉ\n(\nOn a new method for finding the values of integrals\n)\n, a practical essay on approximate integration,\nBestimmung der Genauigkeit der Beobachtungen\nⓉ\n(\nDetermining the accuracy of the observations\n)\n, a discussion of statistical estimators, and\nTheoria attractionis corporum sphaeroidicorum ellipticorum homogeneorum methodus nova tractata\nⓉ\n(\nTheory of a new method of attraction of the homogeneous parts of a elliptical spheroidal body\n)\n. The latter work was inspired by geodesic problems and was principally concerned with\npotential theory\n. In fact, Gauss found himself more and more interested in geodesy in the\n1820\ns.\nGauss had been asked in\n1818\nto carry out a geodesic survey of the state of Hanover to link up with the existing Danish grid. Gauss was pleased to accept and took personal charge of the survey, making measurements during the day and reducing them at night, using his extraordinary mental capacity for calculations. He regularly wrote to Schumacher, Olbers and\nBessel\n, reporting on his progress and discussing problems.\nBecause of the survey, Gauss invented the heliotrope which worked by reflecting the Sun's rays using a design of mirrors and a small telescope. However, inaccurate base lines were used for the survey and an unsatisfactory network of triangles. Gauss often wondered if he would have been better advised to have pursued some other occupation but he published over\n70\npapers between\n1820\nand\n1830\n.\nIn\n1822\nGauss won the Copenhagen University Prize with\nTheoria attractionis\nⓉ\n(\nTheory of attraction\n)\n... together with the idea of mapping one surface onto another so that the two\nare similar in their smallest parts\n. This paper was published in\n1825\nand led to the much later publication of\nUntersuchungen über Gegenstände der Höheren Geodäsie\nⓉ\n(\nStudies on subjects of higher geodesy\n)\n(1843\nand\n1846)\n. The paper\nTheoria combinationis observationum erroribus minimis obnoxiae\nⓉ\n(\nOn the theory of errors in combinations of observations\n)\n(1823)\n, with its supplement\n(1828)\n, was devoted to mathematical statistics, in particular to the least squares method.\nFrom the early\n1800\ns Gauss had an interest in the question of the possible existence of a\nnon-Euclidean geometry\n. He discussed this topic at length with\nFarkas Bolyai\nand in his correspondence with Gerling and Schumacher. In a book review in\n1816\nhe discussed proofs which deduced the axiom of parallels from the other Euclidean axioms, suggesting that he believed in the existence of non-Euclidean geometry, although he was rather vague.\n... the vain effort to conceal with an untenable tissue of pseudo proofs the gap which one cannot fill out.\nGauss confided in Schumacher, telling him that he believed his reputation would suffer if he admitted in public that he believed in the existence of such a geometry.\nIn\n1831\nFarkas Bolyai\nsent to Gauss his son\nJános Bolyai\n's work on the subject. Gauss replied\nto praise it would mean to praise myself .\nAgain, a decade later, when he was informed of\nLobachevsky\n's work on the subject, he praised its \"genuinely geometric\" character, while in a letter to Schumacher in\n1846\n, states that he\nhad the same convictions for\n54\nyears\nindicating that he had known of the existence of a non-Euclidean geometry since he was\n15\nyears of age\n(\nthis seems unlikely\n)\n.\nGauss had a major interest in\ndifferential geometry\n, and published many papers on the subject.\nDisquisitiones generales circa superficies curva\nⓉ\n(\nGeneral investigations of curved surfaces\n)\n(1828)\nwas his most renowned work in this field. In fact, this paper rose from his geodesic interests, but it contained such geometrical ideas as Gaussian curvature. The paper also includes Gauss's famous\ntheorema egregium\nⓉ\n(\nThe important theorem\n)\n:-\nIf an area in\nR\n3\n\\mathbb{R}^{3}\nR\n3\ncan be developed\n(\ni.e. mapped isometrically\n)\ninto another area of\nR\n3\n\\mathbb{R}^{3}\nR\n3\n, the values of the Gaussian curvatures are identical in corresponding points.\nThe period\n1817\n-\n1832\nwas a particularly distressing time for Gauss. He took in his sick mother in\n1817\n, who stayed until her death in\n1839\n, while he was arguing with his wife and her family about whether they should go to Berlin. He had been offered a position at Berlin University and Minna and her family were keen to move there. Gauss, however, never liked change and decided to stay in Göttingen. In\n1831\nGauss's second wife died after a long illness.\nIn\n1831\n,\nWilhelm Weber\narrived in Göttingen as physics professor filling\nTobias Mayer\n's chair. Gauss had known\nWeber\nsince\n1828\nand supported his appointment. Gauss had worked on physics before\n1831\n, publishing\nÜber ein neues allgemeines Grundgesetz der Mechanik\nⓉ\n(\nOn a new general fundamental law of mechanics\n)\n, which contained the principle of least constraint, and\nPrincipia generalia theoriae figurae fluidorum in statu aequilibrii\nⓉ\n(\nGeneral principles of the theory of the shape of fluids in a state of equilibrium\n)\nwhich discussed forces of attraction. These papers were based on Gauss's potential theory, which proved of great importance in his work on physics. He later came to believe his potential theory and his method of least squares provided vital links between science and nature.\nIn\n1832\n, Gauss and\nWeber\nbegan investigating the theory of terrestrial magnetism after Alexander von Humboldt attempted to obtain Gauss's assistance in making a grid of magnetic observation points around the Earth. Gauss was excited by this prospect and by\n1840\nhe had written three important papers on the subject:\nIntensitas vis magneticae terrestris ad mensuram absolutam revocata\nⓉ\n(\nMeasurement of the absoute intensity of terrestrial magnetic force revisited\n)\n(1832)\n,\nAllgemeine Theorie des Erdmagnetismus\nⓉ\n(\nGeneral theory of geomagnetism\n)\n(1839)\nand\nAllgemeine Lehrsätze in Beziehung auf die im verkehrten Verhältnisse des Quadrats der Entfernung wirkenden Anziehungs- und Abstossungskräfte\nⓉ\n(\nGeneral theorems in relation to the acting in perverse circumstances of the square of the distance of attraction and repulsion\n)\n(1840)\n. These papers all dealt with the current theories on terrestrial magnetism, including\nPoisson\n's ideas, absolute measure for magnetic force and an empirical definition of terrestrial magnetism.\nDirichlet\n's principle was mentioned without proof.\nAllgemeine Theorie\nⓉ\n(\nGeneral Theory\n)\n... showed that there can only be two poles in the globe and went on to prove an important theorem, which concerned the determination of the intensity of the horizontal component of the magnetic force along with the angle of inclination. Gauss used the\nLaplace\nequation to aid him with his calculations, and ended up specifying a location for the magnetic South pole.\nHumboldt had devised a calendar for observations of\nmagnetic declination\n. However, once Gauss's new magnetic observatory\n(\ncompleted in\n1833\n- free of all magnetic metals\n)\nhad been built, he proceeded to alter many of Humboldt's procedures, not pleasing Humboldt greatly. However, Gauss's changes obtained more accurate results with less effort.\nGauss and\nWeber\nachieved much in their six years together. They discovered\nKirchhoff\n's laws, as well as building a primitive telegraph device which could send messages over a distance of\n5000\nft. However, this was just an enjoyable pastime for Gauss. He was more interested in the task of establishing a world-wide net of magnetic observation points. This occupation produced many concrete results. The\nMagnetischer Verein\nⓉ\n(\nMagnetic Society\n)\nand its journal were founded, and the atlas of geomagnetism was published, while Gauss and\nWeber\n's own journal in which their results were published ran from\n1836\nto\n1841\n.\nIn\n1837\n,\nWeber\nwas forced to leave Göttingen when he became involved in a political dispute and, from this time, Gauss's activity gradually decreased. He still produced letters in response to fellow scientists' discoveries usually remarking that he had known the methods for years but had never felt the need to publish. Sometimes he seemed extremely pleased with advances made by other mathematicians, particularly that of\nEisenstein\nand of\nLobachevsky\n.\nGauss spent the years from\n1845\nto\n1851\nupdating the Göttingen University widow's fund. This work gave him practical experience in financial matters, and he went on to make his fortune through shrewd investments in bonds issued by private companies.\nTwo of Gauss's last doctoral students were\nMoritz Cantor\nand\nDedekind\n.\nDedekind\nwrote a fine description of his supervisor:-\n... usually he sat in a comfortable attitude, looking down, slightly stooped, with hands folded above his lap. He spoke quite freely, very clearly, simply and plainly: but when he wanted to emphasise a new viewpoint ... then he lifted his head, turned to one of those sitting next to him, and gazed at him with his beautiful, penetrating blue eyes during the emphatic speech. ... If he proceeded from an explanation of principles to the development of mathematical formulas, then he got up, and in a stately very upright posture he wrote on a blackboard beside him in his peculiarly beautiful handwriting: he always succeeded through economy and deliberate arrangement in making do with a rather small space. For numerical examples, on whose careful completion he placed special value, he brought along the requisite data on little slips of paper.\nGauss presented his golden jubilee lecture in\n1849\n, fifty years after his diploma had been granted by Helmstedt University. It was appropriately a variation on his dissertation of\n1799\n. From the mathematical community only\nJacobi\nand\nDirichlet\nwere present, but Gauss received many messages and honours.\nFrom\n1850\nonwards Gauss's work was again nearly all of a practical nature although he did approve\nRiemann\n's doctoral thesis and heard his probationary lecture. His last known scientific exchange was with Gerling. He discussed a modified Foucault pendulum in\n1854\n. He was also able to attend the opening of the new railway link between Hanover and Göttingen, but this proved to be his last outing. His health deteriorated slowly, and Gauss died in his sleep early in the morning of\n23\nFebruary,\n1855\n."
}