{
  "nome_completo": "Fredrik Carl Mulertz Størmer",
  "nome_curto": "Carl Størmer",
  "ano_nascimento": "1874",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stormer/",
  "lugar_nascimento": "Skien, Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Carl Størmer\n's parents were Henrietta Mülertz and Georg Ludvig Stormer. Georg Stormer was a dispensing chemist working in Skien at the time that his son was born but later the family moved to Oslo. Carl was his parents' only child\n[\n2\n]\n:-\nFrom his childhood he showed a deep interest in the natural sciences, astronomy, physics, chemistry, meteorology, geology and in particular botany. At the age of about sixteen his interest turned exclusively to pure mathematics.\nStørmer entered the University of Christiana\n(\nas Oslo was then called\n)\nin\n1892\n. He studied there until\n1897\nand in the following year he obtained the candidates degree\n(\nabout equivalent to a doctorate but without the accompanying title\n)\n. In\n1899\nhe was awarded a five year fellowship which enabled him to continue his studies abroad for, by this time, he was in Paris. He spent two academic years, from\n1898\nto\n1900\n, at the Sorbonne studying with\nÉmile Picard\n,\nHenri Poincaré\n,\nPaul Painlevé\n,\nCamille Jordan\n,\nGaston Darboux\n, and\nÉdouard Goursat\n. After returning to Olso, he went abroad again to spend\n1902\nat Göttingen in Germany. He married Ada Clauson in\n1900\n; they had five children, three boys and two girls.\nIt is unusual for anyone to publish a paper in the year they enter university as an undergraduate, but this is exactly what Størmer did with a paper on the summation of trigonometric series. By\n1896\n, still a year before the award of his candidates degree, he had not only written seven mathematical papers but they were already in print by this time. Even more unusual is the fact that by this time he had also published a number of short notes on botany. His output of mathematical papers continued with twelve papers on series, number theory, and the theory of functions between\n1896\nand\n1902\n. He worked with\nSylow\nand Holst to produce two volumes to celebrate the centenary of\nAbel\n's birth in\n1902\n. One volume was in Norwegian, the other a translation into French. In the same year he also published papers by\nAbel\nwhich he had left unpublished at his death, giving both Norwegian and French versions. Yet another work which came out in\n1902\nwas a posthumous paper of\nSophus Lie\n, edited by Størmer and Guldberg.\nGiven this remarkable output of important mathematical works, it is no surprise that in\n1903\nhe was appointed as professor of pure mathematics at the University of Oslo. It was a post that Størmer held until\n1946\nyet, although he did continue to publish the occasional pure mathematics paper during this period, his interests were diverted by a different topic. Before looking at his new interest, however, we should comment briefly on his other work in pure mathematics. After his appointment as professor, he published, as he had earlier, a number of historical documents and some historical articles. He also published some elegant papers on number theory which were highly praised by\nMordell\n.\nBirkeland, one of Størmer's colleagues, had put forward a theory in\n1896\nthat auroras were caused by electrons emitted by the sun which interacted with the earth's magnetic field.\nPoincaré\nhad, in the same year, solved the differential equations resulting from the motion of a charged particle in the field of a single pole. This, of course, was not the situation for an aurora since the magnetic field of the earth is a dipole. This then was the problem that Stormer attacked\n[\n2\n]\n:-\nOver many years\n[\nStørmer\n]\nmade or organised such calculations, finding a great variety of orbits. His papers on this subject constitute a major part of his life's work; they number at least\n48\n. Many are short, and in several cases he published brief accounts of the same work in different languages and journals. But many of the papers are very substantial in length and content.\nA summary of all of this work appeared in Størmer's book\nThe polar aurora\npublished in\n1955\n. However, this is not simply a theoretical investigation. As Størmer explained in the Preface to the work, he\n[\n2\n]\n:-\n... found it necessary to obtain more facts about the auora in order to compare theory and observation. A photographic method designed to determine, among other things, the height and position of aurora was therefore developed and successfully applied. The chief results obtained from the analysis of a vast number of parallactic photographs are discussed in this book.\nCertainly Størmer was not the first to photograph an aurora. This was first achieved in\n1892\n. However he was the first to undertake a systematic scientific photographic investigation which he began in\n1909\nand continued throughout his career. It was not his interest in aurora which led him towards photography, rather his interest in photography came from his youth. As he wrote in the Preface we just quoted from:-\nIt might be a source of interest to many to observe, in the development of my photographic work, what may result when a pure mathematician happens to be an enthusiastic amateur photographer.\nStørmer's interest in photography went much further\n[\n2\n]\n:-\n... he applied his skill in photography\n(\nunsuspected by the subject\n)\nto obtain pictures ... of many celebrities of Oslo of those days. Long afterwards, when he was nearing the age of\n70\n, these photographs formed the subject of an exhibition in Oslo.\nHe also published two works in\n1942\nand\n1943\ngiving an illustrated account of his 'snapshots of famous people of the last fifty years'.\nChapman\n, who knew Størmer for nearly\n40\nyears, describes him in\n[\n2\n]\nas:-\n... a rather large and bulky slow-moving man. ... He liked the pleasures of the table, good food and wine; he liked the theatre and the opera, and took with him opera glasses the better to observe the action and the danseuses.\nStørmer was honoured in many ways: he was elected to several Scandinavian academies, the\nRoyal Society of London\nand the\nParis Academy of Sciences\n. He was given honorary degrees by the universities of Oxford, Copenhagen and the Sorbonne. The\nParis Academy of Sciences\nawarded him their Janssen Medal in\n1922\n. He was invited to give a one-hour lecture on\nModern Norwegian Researches on the Aurora Borealis\nto the International Congresses of Mathematicians in Toronto in\n1924\nand he was president of the International Congresses of Mathematicians in Oslo in\n1936\n."
}