{
  "nome_completo": "Caroline Lucretia Herschel",
  "nome_curto": "Caroline Herschel",
  "ano_nascimento": "1750",
  "ano_morte": "1848",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herschel_Caroline/",
  "lugar_nascimento": "Hannover, Hanover (now Germany)",
  "lugar_morte": "Hannover, Hanover (now Germany)",
  "biografia": "Caroline Herschel\nwas the daughter of Isaac Herschel and Anna Ilse Moritzen. She was sister of\nWilliam Herschel\nand the aunt of\nJohn Herschel\n. Caroline's father Isaac was an oboist in the Hanovarian Foot Guards and rose to become the bandmaster. Although a man with no formal education, he tried hard to give his four sons and two daughters a good education. His interests in music, philosophy and astronomy led to lively conversations in their home but Caroline's mother disapproved of learning in general and although she reluctantly accepted that her four sons should have some education, she strongly opposed her daughters doing anything other than the household chores.\nCaroline Herschel's four brothers were all brought up to be musicians while Caroline showed an enthusiasm for knowledge which her father tried to satisfy despite all her mother's efforts to ensure that she did nothing but household tasks. Caroline recalled that her father took her\n[\n4\n]\n:-\n... on a clear frosty night into the street, to make me acquainted with several of the beautiful constellations, after we had been gazing at a comet which was then visible.\nCaroline could never have thought in her wildest dreams that one day she would make a major contribution to the study of comets.\nAfter the French occupation of Hanover in\n1757\n, Isaac was occupied fighting the French and so was not at home.\nWilliam\nescaped to England, where he became a music teacher, and Caroline was left under the control of her mother who sent her to learn to knit and otherwise kept her fully occupied with household chores. In\n1760\nIsaac returned home in poor health and Caroline essentially lived the life of a servant until he died in\n1767\n. The death of her father seems to have made Caroline realise that she had to take some control of her own life and she took lessons in dressmaking and studied to qualify as a governess. However, fitting in the studies while her mother demanded so much work from her proved a great strain.\nIn\n1766\nWilliam\nbecame an organist in Bath and, in\n1772\n, Caroline joined him there. She made this move despite strong protests from her mother who was very unhappy at effectively losing a servant. Caroline had always been very close to her brother\nWilliam\nand, after arriving in Bath, she trained as a singer receiving lessons from her brother.\nWilliam\ntaught Caroline more than musical skills. He had studied mathematics and astronomy in his spare time at the end of a long day after many hours teaching music, reading works such as\nMaclaurin\n's\nFluxions\n. Now he began to teach Caroline English and mathematics while he himself became more and more involved with astronomy.\nCaroline began giving successful singing performances\n[\n6\n]\n:-\nAs first treble in the Messiah, Judas Macabaeus, etc., she sang at Bath or Bristol sometimes five nights in the week, but declined an engagement for the Birmingham festival, having resolved to appear only where her brother conducted.\nIn addition to her singing, Caroline helped\nWilliam\nwith his musical activities and looked after him while he spent many hours with his new hobby of constructing telescopes. Slowly Caroline turned more and more towards helping\nWilliam\nwith his astronomical activities while he continued to teach her algebra, geometry and trigonometry. In particular Caroline studied spherical trigonometry which would be important for reducing astronomical observations. However, she was not interested in mathematics for its own sake, finding only those parts which were useful in applications worth studying.\nAlmost inevitably Caroline's role changed from looking after\nWilliam\nto helping him with his scientific activities which soon occupied every available moment. Caroline wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nEvery leisure moment was eagerly snatched at for resuming some work which was in progress, without taking time or changing dress, and many a lace ruffle ... was torn or bespattered by molten pitch. ... I was even obliged to feed him by putting the vitals by bits into his mouth; - this was once the case when at the finishing of a\n7\nfoot mirror he had not left his hands from it for\n16\nhours ...\nAstronomy changed from a hobby for\nWilliam\nin\n1781\nwhen he achieved fame by discovering the planet now named Uranus. King George III gave\nWilliam\na £\n200\nper year salary which was less than generous but sufficient to allow him to become a full-time astronomer. Giving up their musical activities the Herschels moved to Datchet in August\n1782\nwhere they remained until June\n1785\nwhen they moved again, this time into Clay Hall, near Windsor. It was certainly not without many regrets that Caroline abandoned music and began to take an active part in astronomy.\nWilliam\ngave her a telescope with which she began to make observations, in particular searching for comets making methodical sweeps of the sky.\nCaroline found much less time than she expected to make her own observations as she became fully involved helping\nWilliam\nwith his astronomical projects. By day Caroline would work on the results obtained by\nWilliam\nwhile observing on the previous night. She carried out the lengthy calculations necessary to reduce William's data with remarkable accuracy. In fact only when\nWilliam\nwas away from home was Caroline able to spend much time with her own program of research. In April\n1786\nWilliam\nand Caroline moved to a new home they called Observatory House which was in Slough and there, on\n1\nAugust\n1786\n, Caroline discovered her first comet which was described by some as the \"first lady's comet\". This discovery brought Caroline a certain degree of fame and articles were written about her. In one such article she is described as\n(\nsee\n[\n6\n]\n)\n:-\n... very little, very gentle, very modest, and very ingenuous...\nwhile another describes her as:-\n... a most excellent, kind-hearted creature...\nIn\n1787\nKing George III gave Caroline a £\n50\nper year salary as assistant to William. In the following year\nWilliam\nmarried Mary Pitt and Caroline's life changed markedly\n[\n9\n]\n:-\nInitially Caroline was deeply affected by the marriage, and moved out to lodgings at Upton. She continued to support her brother's work and in making the daily walk to Observatory House, became a well-known figure. Often, with\nWilliam\nresting after a long night of observation, the house was kept as quiet as possible during the day. Eventually the relationship between the two ladies - Mary and Caroline - warmed ...\nCaroline kept a diary into which she had recorded her thoughts, in particular she had recorded her great distress at the change in relationship with her brother and she also recorded her bitterness towards his wife. However, as the relationship between the two ladies improved, Caroline regretted her bitter comments against Mary and she destroyed every page of her diary over this time in her life.\nIn total Caroline discovered eight comets between\n1786\nand\n1797\nand she then embarked on a new project of cross-referencing and correcting the star catalogue which had been produced by\nFlamsteed\n. In\n1798\nCaroline submitted to the\nRoyal Society\nan\nIndex to\nFlamsteed\n's Observations of the Fixed Stars\ntogether with a list of\n560\nstars which had been omitted. This publication marked the temporary end of her own researches which she would not begin again until\n25\nyears later after William's death.\nThis period of\n25\nyears was not one which lacked interest for Caroline. She became involved with the education of\nJohn Herschel\n,\nWilliam\nand Mary Herschel's son who was born in\n1792\n.\nJohn Herschel\nspent long periods with his aunt during the vacations and was greatly influenced by Caroline. She saw him educated at Cambridge, make a name for himself as a mathematician, become elected to the\nRoyal Society\n, join his father in research in astronomy and be awarded the Copley Medal of the\nRoyal Society\nfor his achievements. Caroline continued to assist\nWilliam\nwith his observations but her status had greatly improved from the housekeeper she had been in her young days. She was the guest of\nMaskelyne\nat the Royal Observatory in\n1799\nand a guest of members of the Royal Family at various times in\n1816\n,\n1817\nand\n1818\n.\nCaroline returned to Hanover after\nWilliam\n's death in\n1822\n. In many ways it was a bad decision, made too quickly, which she soon regretted but she was always one to keep a promise whatever the personal consequences so she would never return to England. All her energies had been directed towards helping her brother in his astronomical work during his lifetime but now she turned to help his son\nJohn Herschel\n. Certainly this help was not given in the same way as a personal assistant, but rather now as independent researcher producing a catalogue of nebulae to assist John in his astronomical work. She completed her catalogue of\n2500\nnebulae and, in\n1828\n, the\nRoyal Astronomical Society\nawarded her its gold medal for this work.\nAlthough Caroline regretted spending her last\n25\nyears in Hanover there were many compensations. She was now a celebrity in the world of science and she was visited by many scientists including\nGauss\n. Her nephew\nJohn Herschel\n, visiting Caroline in June\n1832\nwhen she was\n83\nyears old, wrote of her\n(\nsee for example\n[\n6\n]\n)\n:-\nShe runs about the town with me, and skips up her two flights of stairs. In the morning, till eleven or twelve, she is dull and weary, but as the day advances she gains life, and is quite 'fresh and funny' at ten p.m., and sings old rhymes, nay, even dances.\nCaroline Herschel received many honours for her scientific achievements. Together with\nMary Somerville\n, she was elected to honorary membership of the\nRoyal Astronomical Society\nin\n1835\n. They were the first honorary women members. She was also elected a member of the\nRoyal Irish Academy\nin\n1838\nand then on her\n96\nth\nbirthday she received a letter\n[\n3\n]\n:-\nHis Majesty the King of Prussia, in recognition of the valuable service rendered to astronomy by you, as the fellow worker of your immortal brother, wishes to convey to you in his name the Large Gold Medal for science.\nOn her\n97\nth\nbirthday Caroline\n[\n6\n]\n:-\n... entertained the crown prince and princess with great animation for two hours, even singing to them a composition of her brother\nWilliam\n.\nA minor planet was named Lucretia in\n1889\nin Caroline Lucretia Herschel's honour, a fitting tribute to one who had contributed so much, yet had so little personal ambition that she disliked praise directed towards her lest it detract from her brother\nWilliam\n."
}