{
  "nome_completo": "Carolyn Eisele",
  "nome_curto": "Carolyn Eisele",
  "ano_nascimento": "1902",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eisele/",
  "lugar_nascimento": "The Bronx, New York City, USA",
  "lugar_morte": "Manhattan, New York City, USA",
  "biografia": "Carolyn Eisele\nwas the daughter of Rudolph Eisele\n(1879\n-\n1936)\nand Caroline Wüst\n(1880\n-\n1942)\n. Rudolph Eisele, born in New York on\n1\nNovember\n1879\nto a German father and an American mother, was a fireman working for the New York City Fire Department. He married Caroline Wüst on\n1\nSeptember\n1901\nin Saints Peter and Paul's Roman Catholic Church in the Bronx, New York. Caroline had been born in New York on\n15\nJuly\n1880\nto a German father from Wurtemburg, who was a blacksmith, and an American mother. Rudolph and Caroline Eisele only had one child, Carolyn Eisele, the subject of this biography.\nCarolyn Eisele entered Hunter College High School which had been founded in\n1869\nas the \"The Female Normal and High School\" but had changed its name in\n1914\n, while Eisele was a pupil there, to \"Hunter College High School for Intellectually Gifted Young Ladies\". She graduated in\n1919\nand wished to continue her studies to degree level at Hunter College. Her parents, however, did not consider this was the right thing for a girl, and wanted her look after them until she married and had a husband and children to look after. Eisele was not easily diverted from her chosen course, however, and she entered Hunter College in\n1919\n[\n16\n]\n:-\nHunter College ... served women in the New York City area, was tuition-free, and by\n1916\nwas the largest women's college in the country. Hunter's mathematics department was large, with seven regular faculty members in\n1916\n; all were women and none had a doctorate.\nEisele's preference would have been to major in physics but at this time Hunter College did not offer this option. Instead she decided to major in mathematics, also taking physics and chemistry courses. Her broad scientific education would stand her in good stead in her later research career. She graduated with honours in\n1923\nand was offered a position teaching mathematics at Hunter College. In addition, she continued her studies taking graduate courses at Columbia University.\nAt Columbia University, Eisele took mathematics courses leading to the award of an M.A. in\n1925\n. Her particular interest was the history of mathematics and she took the famous course that\nDavid Eugene Smith\nwas offering at this time. She also took courses from Cassius Jackson Keyser\n(1862\n-\n1947)\nwho proved an important influence since he was interested in the foundations of mathematics and philosophy. This time at Columbia University was important for Eisele's subsequent research interests for she became fascinated with the history though\nD E Smith\n, and Keyser introduced her to the ideas of\nCharles Sanders Peirce\n. It was not possible for her to continue studying for a Ph.D. at Columbia University for at that time women were not admitted to their Ph.D. course. She was teaching at Hunter College during term times but it was possible for her to enrol at the University of Chicago and undertake research there during the summer vacations. At Chicago she studied differential geometry but a family tragedy forced her to give up working on her Ph.D.\nThe family tragedy concerned her father Rudolph Eisele who was by this time a Captain in the New York Fire Service.\nThe New York Times\nof\n21\nJuly\n1929\nreported the incident\n[\n11\n]\n:-\nFIRE CAPTAIN SHOT BY ONE OF HIS MEN. Captain Popular With Men.\nCaptain Rudolph Eisele,\n50\nyears old, of Engine Company\n41\n, a veteran of twenty-four years' service in the Fire Department, was shot and probably mortally wounded last night as he stood in the door of his firehouse at\n330\nEast\n150\nth Street, the Bronx, by Fireman William Devin, a member of his company. ... Fireman Devin, seized by comrades, says he could not control an insane impulse to kill ...\nTwo days later,\nThe New York Times\nreported\n[\n12\n]\n:-\nFire Captain's Condition Grave.\nCaptain Rudolph Eisele of Engine Company\n41\n, who was shot in the head Saturday night by one of his firemen, was reported in a critical condition late last night in Lincoln Hospital. William Devin, the fireman who shot his superior when \"something snapped in his brain,\" is being held without bail for hearing today in Morrisania Court on a charge of felonious assault.\nRudolph Eisele survived the shooting but committed suicide seven years later\n[\n25\n]\n:-\nEX-FIRE CAPTAIN HERE ENDS LIFE UP-STATE; Rudolph Eisele Found Hanged in Poughkeepsie - Was Shot by Fireman in\n1929\n.\nPOUGHKEEPSIE, N.Y., November\n27\n. - Rudolph Eisele, formerly a captain in the New York City Fire Department, was found hanging from a beam in the garage of his home at\n34\nSouth Randolph Avenue this morning by his wife, Mrs Caroline Eisele. Dr Howard P Carpenter, medical examiner, pronounced him dead and gave a preliminary verdict of suicide.\nThese tragic family events were the main cause for Carolyn Eisele giving up her Ph.D. In fact she turned more towards another of her passions, namely music\n[\n14\n]\n:-\nMusic was also a major part of her life, and at one point she seriously considered a career in opera. She spent the summer of\n1931\nstudying voice with Madame Jeanne Fourestier in Paris. A few years later, in New York, the Polish- American Wagnerian soprano Elsa Alsen recommended her own voice coach in Los Angeles, Morris Halpern, with whom Eisele studied\n(\nas did Kitty Carlisle Hart\n)\n. Eisele spent\n1934\nin Los Angeles, where she continued her studies with Halpern while taking courses in mathematics at the University of Southern California.\nHalpern and Eisele became friends\n[\n22\n]\n:-\nMorris Halpern\n(1878\n-\n1963)\nemigrated from Russia to the United States in\n1891\nat the age of\n13\n. He supported himself through a variety of odd jobs including selling newspapers, polishing guitars and working in factories where he later became a labour organiser and social worker. Despite a lack of formal education Halpern's intellectual ability gained him admittance into Columbia University in\n1906\n. He was awarded a MA in\n1909\nand a Ph.D. in\n1911\n. In the\n1920\ns Morris and Vera Halpern\n[\nVera Gladstone, née Rocklin,\n(1868\n-\n1948)\n, his common law wife\n]\nleft New York and moved to Los Angeles where they opened a millinery shop named Madame Vera. Financial difficulties and Vera's sojourn in a sanatorium in\n1927\nforced the closure of the shop in\n1928\n/\n29\n. Halpern then served as music director for KHJ, a Los Angeles radio station, where he selected the music and wrote the scripts for the weekly \"To the Ladies\" classical music program hosted by Globe Mills. After the loss of this position Halpern began teaching voice. Among his students were Elsa Alsen, Kitty Carlisle and Carolyn Eisele.\nAlsen introduced Eisele to Halpern in June\n1934\nand he became her voice teacher. After she left Los Angeles in\n1935\nthey exchanged love letters, then Halpern moved to New York to be with Eisele in August\n1936\n. In\n1942\nEisele sent Halpern letters telling him about her mother's illness and subsequent committal to a sanatorium. Caroline Eisele died in Manhattan State Hospital on\n9\nDecember\n1942\n. Morris Halpern and Carolyn Eisele were married on\n24\nJune\n1943\n.\nThe reader who is aware of the fact that at this time many women were forced to leave their employment when they married may wonder how Eisele could marry and continued working at Hunter College\n[\n16\n]\n:-\nOne reason this situation was possible was the inauguration in\n1929\nof an enlightened president. At that time few of the women on the Hunter faculty were married and ... it was not unusual to insist on the resignation of a woman upon marriage. The new president, James M Kieran, replied to the question \"Should a woman member of the staff resign when she got married?\" by saying that \"the only thing such a person had to do was to file her married name for payroll purposes.\"\nIt is not clear if Eisele did file her married name - certainly she published papers under the name Carolyn Eisele but on some travel documents her name appears as Carolyn Eisele-Halpern or Carolyn E Halpern.\nShortly after the end of World War II, Eisele was asked to teach a history of mathematics course at Hunter College. She had a good background in the subject having attended\nDavid Eugene Smith\ncourse at Columbia University and having been taught there by Cassius Jackson Keyser. Keyser, who had known\nCharles Sanders Peirce\n, had written papers\nA glance at some of the ideas of Charles Sanders Peirce\n(1935)\nand\nCharles Sanders Peirce as a pioneer\n(1941)\n. He had also written about\nC S Peirce\nin\nPortraits of famous philosophers who were also mathematicians\n(1939)\n. Eisele had known Keyser well\n(\nhe died on\n8\nMay\n1947))\nand, obtaining a semester's sabbatical in\n1947\nto prepare for her history of mathematics course, she began undertaking research in Columbia University's archives. In the library she found a letter from\nC S Peirce\nto the publisher George Plimpton\n[\n20\n]\n:-\nShe was inspecting the Plimpton Collection at Columbia University and came across what was then a surprising letter from\nPeirce\nto Plimpton, the latter having hired the former as a consultant to his project of acquiring a magnificent collection of early mathematical publications. This letter, and others, clearly showed that\nPeirce\nwas a master of the history of science as well as the history of mathematics. While she had known about\nPeirce\n, she had not realised the extent and depth of his activities as a mathematician or scientist. She showed copies of her discoveries to a close friend who remarked, \"I think you have discovered gold.\"\nEisele published the paper\nThe Liber Abaci Through the Eyes of Charles S Peirce\n(1951)\n. It begins:-\nThe legal codes are crowded with definitions of many forms of crime, but one of the most deplorable crimes - the waste of human genius by social conventions - is never even mentioned. I am led to this reflection by an accidental discovery of two manuscript letters written by\nC S Peirce\n.\nAlthough appreciation of the work of\nCharles S Peirce\nhas been growing rapidly in the academic world during the last twenty-five years, some of the younger readers who are not working directly in the field of philosophy or logic may wonder who he was and why his name should be associated with genius. A short sketch of his attainments may assist them in the evaluation of the discovered manuscripts.\nAlthough this publication began a remarkable collection of papers by Eisele about\nCharles S Peirce\n, it was not her first publication. This was\nLao Genevra Simons\n(1950)\n, an obituary of\nSimons who was chair of the Hunter College Mathematics Department from\n1927\nuntil she retired in\n1940\n. Simons had been awarded degrees from Columbia University; a Bachelor of Science degree in\n1908\n, a Master's degree in\n1912\nand a Ph.D. in\n1924\n. The reader might wonder how Simons could obtain a Ph.D. from Columbia when Eisele could not. The reason is that Simons was awarded a degree in mathematical education, not in mathematics, for her thesis\nIntroduction of algebra into American schools in the eighteenth century\n.\nOther trips to libraries led Eisele to make further interesting discoveries. For example in\n1957\nshe published\nThe Charles S Peirce-Simon Newcomb Correspondence\n. She explains in the introduction to the paper how she came across the material:-\nCarefully tucked away in the files of the Manuscript Division of the Library of Congress and in the archives of Widener Library and Houghton Library at Harvard University are the two ends of a correspondence that stirs the imagination and quickens the pulse of the scientist or historian interested in scientific Americana of the late nineteenth century. The correspondents are two of the greatest intellects ever produced in America and their exchange of opinion regarding matters scientific and personal serves as an interesting personalised documentation of the scientific thought of their period. The renowned astronomer,\nSimon Newcomb\n, considered the sheaf of letters from\nCharles S Peirce\nimportant enough to file away with those of other important men in science whom he knew.\nPeirce\n, America's belatedly recognised giant in logic and philosophy, preserved a number of\nNewcomb\n's letters as well as the drafts of some of his letters to\nNewcomb\nof which we have no other record. The correspondence is being published herein for the first time. The correspondence was discovered by the writer while doing research for a book on the activities of\nCharles S Peirce\nas a historian of science under a grant from the American Philosophical Society.\nWe list eleven of Carolyn Eisele's papers, including this last mentioned one, and give extracts from them at\nTHIS LINK\n.\nIn addition to writing papers, Eisele edited and published editions of\nCharles S Peirce\n's writings, for example\nThe New Elements of Mathematics\n(4\nvolumes\n)\n(1976)\n. A collection of thirty essays and papers by Carolyn Eisele was published as the book\nStudies in the Scientific and Mathematical Philosophy of Charles S Peirce: Essays by Carolyn Eisele\n(1979)\n, edited by Richard M Martin. For extracts from reviews of these and two other books involving Eisele which we chose to highlight the reviewers' comments about Eisele herself, see\nTHIS LINK\n.\nIn\n1953\nEisele was one of the founders of the Metropolitan New York Section of the History of Science Society\n[\n14\n]\n:-\nWithin a year of its founding, the group had become what she fondly described as \"a Pythagorean Brotherhood.\" Acknowledging the roster of eminent speakers at the meetings, she reminisced that \"the big guns were coming to us to deliver lectures just as readily as going to the national meeting.\"\nShe served as Treasurer of the Metropolitan New York Section of the History of Science Society after its founding and then as president of the Section from\n1959\nto\n1963\n. It was not only with the Section that Eisele contributed much to the Society, for she also served on the Council of the main History of Science Society and on its Nominating Committee from\n1959\nto\n1962\n.\nMorris Halpern, Eisele's husband, died of a stroke in March\n1963\n. Eisele continued to teach at Hunter College where she was made a full professor in\n1965\n. Having reached the age of\n70\n, she retired from Hunter College in\n1972\nand she was honoured by the College with election to their Hunter Hall of Fame. Remarkably, however, the majority of Eisele's research contributions came after her retirement. For example after her retirement she published eight of the twelve papers that we give information about at\nTHIS LINK\n.\nAlso after her retirement she published all of the four books that we give information about at\nTHIS LINK\n.\nShe had joined the\nCharles S Peirce\nSociety in\n1952\n. This Society had been founded in February\n1946\nat an AGM of the American Philosophical Association in Sarah Lawrence College, Bronxville, New York. She was elected Vice-President of the Society in\n1972\n, then as President from\n1973\nto\n1975\n. In\n1972\nshe became a consulting member of the Centro Superiore di Logica e Scienze Comparate at the University of Bologna.\nEisele received many honours\n[\n2\n]\n:-\nIn\n1980\n, she was awarded a Doctor of Humanities degree by Texas Tech University and two years later received an honorary Doctorate of Science from Lehigh University. In\n1985\n, the\nNew York Academy of Sciences\nrecognised Eisele for her seminal contributions to the history and philosophy of science through her publication of Peirce's mathematical and philosophical works.\nThe Hunter Colloquium on\nCharles S Peirce\nwas held in honour of Carolyn Eisele at Hunter College in May\n1981\n. The papers, including one from Eisele herself, were published by\nHistoria Mathematica\nin\n1982\nand also marked a celebration of Eisele's\n80\nth birthday. You can read an extract from Joseph Dauben's review at\nTHIS LINK\n.\nIn\n1982\n, she became a member of the Board of Advisors for the\nPeirce Edition Project\nat Indiana University-Purdue University in Indianapolis. Established in\n1975\n, the\nPeirce Edition Project\nhad the long-term aim of producing a\n30\n-volume print edition of\nC S Peirce\n's writings as well as an electronic edition. Ten years after she joined the\nPeirce Edition Project\n, in\n1992\n, Eisele suffered a severe stroke which left her almost totally incapacitated. Cornelis de Waal writes about her final years and the donation of her papers, books and miscellaneous writings to the\nPeirce Edition Project\n[\n5\n]\n:-\nShe spent the last eight years of her life in bed in her small apartment surrounded by her books and papers, almost entirely unable to communicate, and under the constant care of a professional nurse.\nThe stiff Manhattan rents forced a quick evacuation of the apartment. So, at the request of the executor of her estate, Arthur Kaufman, Nathan Houser and I left for New York City to collect her library and papers, which had been given to the Peirce Edition Project.\nCarolyn Eisele lived in a one-bedroom apartment on the\n27\nth floor of an apartment building in midtown Manhattan. What the apartment lacked in size was amply compensated for by its location and its most magnificent view of the Manhattan skyline, especially at night. The apartment was literally filled with books and papers. She must never have thrown anything away. Books and journals were found everywhere, as were the remnants of her extensive travels, and the hall closets were filled more than knee-high with shopping bags stuffed with correspondence. Her complete financial records, including all check stubs, tax returns, phone bills, etc. had also been preserved. Even the kitchen did not escape, as there was an old shopping cart filled with mathematics books blocking one of its two entryways. With the help of Ralph Müller from Fordham University and five of his students, we carried away well over a hundred boxes, quite a few of which had already been packed eight years earlier to make room for a hospital bed."
}