{
  "nome_completo": "Charles Auguste Briot",
  "nome_curto": "Charles Briot",
  "ano_nascimento": "1817",
  "ano_morte": "1882",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Briot/",
  "lugar_nascimento": "St Hippolyte, Doubs, Franche-Comté, France",
  "lugar_morte": "Bourg-d'Ault, France",
  "biografia": "Charles Briot\n's father was Auguste Briot and he was merchant in the town of St Hippolyte. It was in this town in Doubs, Franche-Comté near the border with Switzerland that Charles, the oldest child of his parents large family, was born. His father Auguste was a well respected citizen of St Hippolyte where he was involved in the tanning trade as part of the production and manufacture of leather.\nCharles was left with a stiff arm after a childhood accident and so he needed to train for an occupation where his disability would not hamper him too badly. At school he realised that mathematics was the subject for him so his first intention was to become a mathematics school teacher. He made friends at school with another young man who was equally keen on mathematics, namely Claude\nBouquet\n. Briot was two years ahead of\nBouquet\nat school and after leaving in\n1837\nhe taught for a year. He sat the entrance examinations for the École Normale Supérieure in Paris and was placed second in these highly competitive entrance examinations. He went to Paris in\n1838\nand entered the École Normale Supérieure now one year ahead of his school friend Claude\nBouquet\nwho joined him there the following year.\nIn\n1841\nBriot completed the course for the\nagrégation\nin mathematics and he had improved on his position as the second best student which he achieved when he entered, for now he was placed first. He obtained his doctorate in March\n1842\nfor a dissertation on the orbit of a solid body around a fixed point. At this stage his friend\nBouquet\nhad caught up with him, for he graduated in the same year with a doctoral thesis on variation of double integrals. Despite his marked academic success in research, Briot still wanted to follow his chosen career as a teacher and it was as a teacher of mathematics in a Lycée that he began his career.\nHe was first appointed as Professor at the Orléans Lycée, where he worked for a while before obtaining a post at the University of Lyon. While there he met again his school friend\nBouquet\nwho had followed a similar career path but had been at a Lycée in Marseilles before his appointment to the University of Lyon. From this time on the two school friends began a collaboration on analysis which was to last throughout their careers and result in many joint publications.\nIn\n1851\nBriot returned to Paris where he taught at various Lycées. The first was the Lycée Bonaparte which would later be renamed the Lycée\nCondorcet\n. At this Lycée, Briot taught the special mathematics course designed to prepare pupils to take the entrance examinations for the École Normale Supérieure and the École Polytechnique. When Briot moved to the Lycée Saint-Louis he continued to teach the same special mathematics courses there. His teaching was not restricted to the Lycées, however, for he also acted as substitute for various courses at the École Polytechnique and at the Faculté des Sciences. He taught engineering and surveying in the year he moved back to Paris, then he taught a calculus course in\n1853\nand, two years later, courses on mechanics and astronomy. From\n1864\nhe was a professor at the Sorbonne and also at the École Normale Supérieure.\nBriot undertook research on analysis, heat, light and electricity. His first major work on analysis was\nRecherches sur la théorie des fonctions\nⓉ\n(\nResearch on the theory of functions\n)\nwhich he published in the Journal of the École Polytechnique in\n1859\n, and he also published this work as a treatise in the same year. His researches on heat, light and electricity was all based on his theories of the aether. He was strongly influenced in developing these theories by Louis Pasteur, the famous chemist. Of course Pasteur was a great scientist, but Briot had an additional reason to hold him in high esteem for, like himself and his friend\nBouquet\n, Pasteur was brought up in the Doubs region of France.\nPasteur had presented a paper to the\nAcadémie des Sciences\nin Paris in\n1848\non his discovery that certain chemical compounds could exist in dual forms having both a right hand version and a left hand version, one being the mirror image of the other. The way that these two versions had been discovered was fascinating to Briot, for Pasteur had investigated acid crystals showing that there were two forms, one of which rotated plane polarised light in a certain direction while the other rotated plane polarised light to the same degree but in the opposite direction. Then Briot applied these properties of crystals discovered by Pasteur to the aether which he believed was a crystalline substance. Briot, however, developed a sophisticated mathematical theory to study these properties, and although his work has no great importance to physics, the analysis he had to develop during his working out of the theory led to significant results in the integral calculus and also in the theory of elliptic and abelian functions. Much of these mathematical consequences he worked out in collaboration with his friend\nBouquet\n.\nIn\n1859\nBriot and\nBouquet\npublished their important two volume treatise on doubly periodic functions. They published another joint effort in\n1875\nwhen their treatise on\nelliptic functions\nappeared. In this same year they published a second edition to their two volume work of\n1859\n. In\n1879\nBriot, this time in a single author work, produced his treatise on\nabelian functions\n. The physical motivation for the mathematical theories which gave rise to this work in analysis was published by Briot in\n1864\nwhen he published his work on light,\nEssai sur la théorie mathématique de la lumière\nⓉ\n(\nEssay on the mathematical theory of light\n)\nand five years later when he published his work on heat,\nThéorie mécanique de la chaleur\nⓉ\n(\nMechanical theory of heat\n)\n.\nWe noted above that Briot was a dedicated teacher and as such he wrote a great number of textbooks for his students. This was certainly a tradition in France at this time and it was natural for a teacher of Briot's quality to write up his courses as textbooks. He wrote textbooks which covered most of the topics from a mathematics course: arithmetic, algebra, calculus, geometry, analytic geometry, and mechanics. For his outstanding contributions to mathematics the\nAcadémie des Sciences\nin Paris awarded Briot their\nPoncelet\nPrize in\n1882\nshortly before he died."
}