{
  "nome_completo": "Charles Chree",
  "nome_curto": "Charles Chree",
  "ano_nascimento": "1860",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chree/",
  "lugar_nascimento": "Lintrathen, Angus, Scotland",
  "lugar_morte": "Worthing, Sussex, England",
  "biografia": "Charles Chree\n's parents were Rev Charles Chree and Agnes Scarth Bain. He was their second son. He attended the Grammar School in Old Aberdeen, and then matriculated at the University of Aberdeen. There he took a wide range of courses, not specialising in science, and when he graduated in\n1879\nhe was awarded the gold medal for the best arts student graduating in that year.\nChree then went to Cambridge where he took both the Mathematical Tripos and the Natural Sciences Tripos. He graduated in\n1883\nbeing placed in the top division in Part II of both Tripos examinations. In\n1885\nhe was elected to a fellowship at King's College, Cambridge and from then until\n1893\nundertaking research in mathematical physics. His first paper\nOn certain forms of vibration\nwas presented to the\nEdinburgh Mathematical Society\nin session\n1885\n-\n86\n. During the eight years that he held the fellowship at Cambridge Chree published around\n30\npapers on the mathematical theory of elasticity. In\n1893\nhe was appointed as Superintendent of the Kew Observatory and began a new phase in his research career working there mainly on terrestrial magnetism. Chree became F.R.S. in\n1897\n; essentially for the outstanding results he had obtained on elasticity.\nIn\n[\n1\n]\nChree's work on magnetism is discussed. Here is the abstract of Chapman's paper:-\nAfter having gained distinction as an authority on the mathematical theory of elasticity, Charles Chree's interests were turned to the study of geomagnetism by his appointment, at the age of\n33\n, as Superintendent of the Kew Observatory. There he gained an enduring place in the list of distinguished British contributors to geomagnetism. His work is briefly reviewed, particularly in its relation to that of his contemporary fellow-workers in the subject. He did outstanding service, in addition to maintaining the regular activities of his observatory at a high level, in discussing the data obtained there and on four Antarctic expeditions. Though critical of current physical theories of the geomagnetic variations, and though he himself refrained from speculation on the physical causes of geomagnetic disturbance, his examination of the theoretical views of Maunder and Arrhenius, by the discussion of the magnetic data, led him to his finest achievements.\nFull details of Chree's research achievements are given in his Royal Society obituary\n[\n2\n]\n. You can read the article at\nTHIS LINK\n.\nRather than repeat in this biography details from this obituary, we rather give two quotations from Chree's work which illustrate very clearly what he considered to be the relationship between his mathematical results and the physical problems that he modelled:-\nI should be sorry if anyone supposed I profess to have actually solved the exact problems presented by nature. The lay reader is so much at the mercy of the mathematician that I think the latter is taking a most unfair advantage of his position if he avoid taking a reasonable care to prevent the general public from regarding his hypothetical problems as actual facts.\nIn the second quote he addresses specifically the assumptions that he makes in modelling, showing a remarkable honesty:-\nVortices on the earth do not extend to infinity; their cross-section is often not small compared to their distance apart; their diameter is often not very small compared to the earth's radius; they are often not approximately circular in section; there are vertical currents, and the horizontal velocity is not the same either in magnitude or direction at all points in the same vertical line; air, moist or dry, is not wholly destitute of viscosity, etc. etc.; there are thus enormous obvious differences between the simple mathematical problems of my papers and the actual state of matters on the earth; and if there is any resemblance between the results in the papers and actualities, it may quite as likely be a pure accident as not.\nChree was awarded the James Watt medal by the Institution of Civil Engineers in\n1905\nand the Hughes medal of the Royal Society in\n1919\n. He served as President of the Physical Society from\n1908\nto\n1910\nand he also served as President of the Royal Meteorological Society. In\n1939\n, eleven years after his death, the Charles Chree Medal and Prize was instituted in his memory by his sister:-\nThe award is given for distinguished research in environmental physics, terrestrial magnetism, atmospheric electricity and related subjects, such as other aspects of geophysics comprising the Earth, oceans, atmosphere and solar-terrestrial problems. The medal is silver and accompanied by a certificate and prize of £\n1000\n.\nWe mentioned above Chree's association with the\nEdinburgh Mathematical Society\n. He joined it in April\n1885\n, not long after the Society was founded. A number of papers written by Chree were read at meetings of the Society. For example at the meeting on Friday\n14\nMay\n1886\n,\nA Y Fraser\nsubmitted a paper by Charles Chree on the vibrations of a spherical or cylindrical body surrounded by or containing fluid. Again at the meeting on\n11\nFebruary\n1887\n,\nA Y Fraser\nsubmitted his paper on vortices by Chree who was at Cambridge. Chree remained a member of the Society for the rest of his life."
}