{
  "nome_completo": "Charles Ehresmann",
  "nome_curto": "Charles Ehresmann",
  "ano_nascimento": "1905",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ehresmann/",
  "lugar_nascimento": "Straßburg, Germany (now Strasbourg, France)",
  "lugar_morte": "Amiens France",
  "biografia": "Charles Ehresmann\ncame from a poor family in Alsace. His father was a gardener and the family spoke Alsatian which is related to the Germanic languages. Alsace, which was originally French, had came under German rule in\n1871\nbut by\n1902\nhad effective self-government. After\n1911\nit had its own constitution and progress was made toward Germanisation in the region. Certainly Charles began his schooling entirely in German up to the end of World War I in\n1918\n. He attended the Lycée Kléber in Strasbourg but, after\n1919\nAlsace was returned to France and French language schools were set up. This met with resistance from the German speaking population but their attempts at autonomy within the French Republic were unsuccessful. Charles, however, was from that time on taught in French.\nIn\n1924\nEhresmann entered the École Normale Supérieure in Paris. He graduated in\n1927\n, spent a year doing military service, then taught mathematics at the French speaking Lycée in Rabat, the national capital of Morocco. After spending the years\n1928\n-\n29\nin Rabat, Ehresmann continued his education going to Göttingen to undertake research. During his time in Göttingen in the years\n1930\nand\n1931\nit was the leading centre for mathematical research in the world although, of course, shortly after this the rise to power of the Nazis would change the mathematical world significantly.\nFrom\n1932\nto\n1934\nEhresmann studied at Princeton in the United States. Having left the leading centre of Göttingen, he had gone to the place which in many ways would replace it as the leading mathematical centre as the Jewish mathematicians left Germany after the Nazis passed their anti-Jewish legislation in\n1933\n.\nEhresmann's doctorate was awarded by Paris in\n1934\n. In his doctoral dissertation, and during the time from\n1934\nto\n1939\nwhen he was carrying out research in the Centre Nationale de la Recherche Scientifique, he studied topological properties of\ndifferential manifolds\n. In particular he described\n[\n1\n]\n:-\n... the homology of classical types of homogeneous manifolds, such as Grassmannians, flag manifolds, Stiefel manifolds, and classical groups.\nHe became a lecturer in the University of Strasbourg in\n1939\nbut shortly after this he was back in the middle of the France/Germany conflict of his youth but this time on a quite different scale as the Germans invaded Alsace in\n1940\n. During the German occupation of World War II, the University of Strasbourg's faculties were moved to Clermont Ferrand University in central France, then back to Strasbourg in\n1945\n. Ehresmann followed the moves of the university then, in\n1955\n, a chair of topology was specially created for him in the University of Paris. He held this chair until he retired in\n1975\n.\nAlthough he was\n70\nyears old when he retired, Ehresmann did not give up lecturing for at this time he moved to Amiens, where his second wife was a professor of mathematics, and he taught there.\nEhresmann was one of the creators of differential topology. Beginning in\n1941\n, Ehresmann made major contributions toward establishing the current view of fibre spaces,\nmanifolds\n, foliations and jets. His work in the creation and development of fibre spaces followed on from the study of a special case made earlier by\nSeifert\nand\nWhitney\n.\nAfter\n1957\nEhresmann became a leader in category theory and he worked in this area for\n20\nyears. His principal achievements in this area concern local categories and structures defined by atlases, and germs of categories. The article\n[\n3\n]\ncontains a list of\n139\narticles written by Ehresmann during his productive career as well as listing several volumes which he edited.\nBetween\n1980\nand\n1983\nAndrée Charles Ehresmann, his wife, edited his complete works. These appeared in seven volumes:\nCharles Ehresmann: Oeuvres complètes et commentées\nⓉ\n(\nCharles Ehresmann: Complete Works and commentaries\n)\nas supplements to the Journal\nCahiers de Topologie et Géometrie Différentielle Categoriques\nwhich Charles Ehresmann created in\n1957\n.\nIn\n[\n1\n]\nDieudonné\ndescribes Ehresmann's personality as:-\n... distinguished by forthrightness, simplicity, and total absence of conceit or careerism. As a teacher he was outstanding, not so much for the brilliance of his lectures as for the inspiration and tireless guidance he generously gave to his research students ..."
}