{
  "nome_completo": "Charles Galton Darwin",
  "nome_curto": "Charles Galton Darwin",
  "ano_nascimento": "1887",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Darwin_C_G/",
  "lugar_nascimento": "Newnham Grange, Cambridge, England",
  "lugar_morte": "Newnham Grange, Cambridge, England",
  "biografia": "Charles Galton Darwin\n's parents were Maud du Puy and\nSir George Howard Darwin\n. Charles was a grandson of Charles Robert Darwin the author of\nOn the origin of the species\nand the godson of\nFrancis Galton\n. He attended Marlborough College, Wiltshire, England from\n1901\nto\n1906\nwhen he entered Trinity College, Cambridge. He was Fourth\nWrangler\nin the Mathematical Tripos of\n1909\n.\nDarwin was appointed as Reader in Mathematical Physics, Manchester University in\n1910\n. During World War I, from\n1914\nto\n1918\n, Dalton served in the Royal Engineers and the Royal Flying Corps. Then in\n1919\nhe became a Lecturer in Mathematics at Christ's College, Cambridge. After five years at Cambridge, Darwin was appointed Tait Professor of Natural Philosophy at the University of Edinburgh in\n1924\n. Before taking up the post he joined the Edinburgh Mathematical Society in December\n1923\n.\nBefore he took up the appointment in Edinburgh, Darwin had been elected a fellow of the\nRoyal Society\nin\n1922\n. He was awarded the Society's Royal Medal in\n1935\n. The announcement read as follows:-\nThe Royal Medal of the Royal Society has been awarded to Professor C G Darwin, F.R.S., of the Tate Chair of Natural Philosophy in Edinburgh University, for his researches in mathematical physics, especially in quantum mechanics.\nOn\n3\nMarch\n1924\nhe was made a fellow of the\nRoyal Society of Edinburgh\n, having been proposed by Sir James Alfred Ewing,\nCharles Glover Barkla\n, William Archer Tait, and\nSir Edmund T Whittaker\n. He was on the Council of the Society from\n1925\nto\n1928\n, Secretary to Ordinary Meetings\n1928\n-\n1933\n, and Vice-President\n1933\n-\n1936\n. He was awarded the Gunning Victoria Jubilee Prize\n1932\n-\n6\nof the\nRoyal Society of Edinburgh\n. He married Katharine Pember in\n1925\n, they had four sons and one daughter.\nIn\n1936\nDarwin left Edinburgh to take up the position of Master of Christ's College, Cambridge. He held this post for two years, the became Director of the National Physical Laboratory. He continued in this position until he retired in\n1949\n.\nFor more details of his life and work see his Royal Astronomical Society obituary at\nTHIS LINK\n.\nDarwin received many honours for his outstanding work in mathematical physics. He was awarded honorary degrees by the universities of Bristol, California, Chicago, Edinburgh, Delhi, Dublin, Manchester, and St Andrews. He was knighted in\n1942\n.\nSome details of Darwin's work in mathematical physics are given in\n[\n2\n]\n, the paper can be read by clicking on the above link. We end this short biography by quoting the Introduction to\n[\n1\n]\nwhere his contributions to eugenics are detailed:-\nCharles Galton Darwin was singularly well qualified to cut a dash in the history of eugenics. His name alone strikes a unique resonance. He was a grandson of the Charles Darwin. He was a godson of the childless Francis Galton, who in formulating the principles of eugenics had been much inspired by the work of the grandfather Darwin, Galton's cousin. By heredity and upbringing, C G Darwin was himself a prime example of good breeding: like many of his illustrious forebears, he achieved intellectual eminence and was a striking demonstration that 'like begets like'. He was a committed eugenist, involved with the Eugenics Society for over thirty years, and its president for six years. Yet despite these credentials, he appears to be almost completely neglected in the historiography of the British eugenics movement. Thus one purpose of this essay is to draw out Darwin's perspectives on eugenics, and some of the factors that helped shape them.\nDarwin's chronology paralleled that of the British eugenics movement. His eugenic beliefs appear to have been largely formed in times and circumstances that were relatively optimistic for eugenists. However, by the time he came to a leading position in the eugenics movement, the signs of the movement's final decline were increasingly evident. Darwin was openly torn between two beliefs - that eugenic measures were a crucial necessity as natural selection became largely suspended for much of mankind; and the desperate conclusion that all attempts to create a eugenically-determined world were almost certainly doomed to failure. In the\n1950\ns, when Darwin was most active in the Eugenics Society, the latter was facing a similar crisis of confidence. Thus the second aim here is to demonstrate how Darwin's views in part exemplified, but often ran ahead of, the increasingly frustrated state of the British eugenics movement in its latter days. For within a year of Darwin's death, the Society took on charitable status which essentially ended its propagandising role, while in\n1968\n, the Society's journal, \"Eugenics Review\", ceased publication.\nWe mentioned above that Darwin was a member of the Edinburgh Mathematical Society. He lectured on\nThe Wave Mechanics\nat the Society's St Andrews Colloquium in July\n1930\n."
}