{
  "nome_completo": "Charles Bossut",
  "nome_curto": "Charles Bossut",
  "ano_nascimento": "1730",
  "ano_morte": "1814",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bossut/",
  "lugar_nascimento": "Tartaras (near Rive de Gier), Rhône-et-Loire, France",
  "lugar_morte": "Paris, France",
  "biografia": "Charles Bossut\n's father was Barthélemy Bossut and his mother was Jeanne Thonnerine. Charles never knew his father for his died when he was only six months old. The arrangement which allowed him to be brought up in a reasonably affluent home was that his father's brother took over the role of his father and Charles was brought up in his home. He was educated at the Jesuit College of Lyon which he entered at the age of fourteen. There he was taught mathematics by Père Béraud who had already taught\nMontucla\nand inspired him to study mathematical physics.\nMontucla\nwas five years older than Bossut and completed his studies at the Jesuit College of Lyon about the time that Bossut entered. Another famous mathematician also studied under Père Béraud at the College, namely\nJérôme Lalande\nwho was two years younger than Bossut so the two overlapped at the College.\nAlthough his main interests were in mathematics, and particularly in mathematical education, Bossut continued in the Church after his studies at the Jesuit college, and took holy orders becoming an abbé. He was then properly addressed as the Abbé Charles Bossut. He was encouraged in his mathematical researches by\nd'Alembert\n,\nClairaut\nand\nCamus\n. He became a student of\nd'Alembert\nand in that capacity was admitted to the\nAcademy of Sciences\nas a 'correspondant' on\n12\nMay\n1753\n. Before this in\n1752\n, at the age of\n21\n, Bossut had been appointed professor of mathematics at the École du Génie at Mézières, the first school of military engineering which had been established at Mézières in\n1748\n.\n(\nLazare\nCarnot\n, himself a graduate of Mézières who studied there after Bossut had left, moved the school to Metz in\n1794\nwhere it was renamed the École Polytechnique\n)\n. While at Mézières, Bossut transformed the quality and content of the courses. Among his students at Mézières were\nBorda\nand\nCoulomb\n. He also did fine research and won Academy prizes for his work on mechanics applied to ships and on resistance to planetary motion. It was a memoir of\n1762\nwhich won Bossut the Grand Prix of the\nAcademy of Sciences\nfor work on the resistance of fluids to the motion of planets. He also won the Grand Prix\n(\nor shared it\n)\nin\n1761\nand\n1765\n.\nThen in\n1765\nMonge\nwas appointed to the École du Génie as a draftsman. Of course, in this post\nMonge\nwas undertaking tasks that were not entirely to his liking, for he aspired to a position in life which made far more use of his mathematical talents. However the École du Génie brought\nMonge\ninto contact with\nBossut\nwho encouraged him to develop his ideas on geometry. After\nBossut\nleft the chair of mathematics at the École du Génie at Mézières in\n1768\n,\nMonge\nwas appointed to succeed him in January\n1769\n. C B Boyer writes:-\nOn\n22\nJanuary\n1769\nMonge\nwrote to his former mentor, the Abbé Charles Bossut, that he was composing a memoir on the\nevolutes\nof curves of double curvature, and he asked the abbé for an opinion on the originality and usefulness of the work. Bossut's reply has not survived; but the judgment evidently was encouraging, for in June of the same year there appeared in the J Encyclopédique a \"Lettre de M Monge\" containing a summary of his results. The theory of evolutes for plane curves had been presented by\nHuygens\nabout a century earlier in connection with the study of pendulum clocks. The \"Lettre\" of\nMonge\nnot only generalized the conclusions of\nHuygens\nto space curves, but added further discoveries, including the significant fact that the surface containing the centres of curvature of a gauche curve is developable.\nThe letter is published in\n[\n5\n]\n.\nBossut is famed for his textbooks which were widely used throughout France. He wrote his first textbook\nTraité élémentaire de méchanique et de dinamique appliqué principalement aux mouvements des machines\nⓉ\n(\nElementary Treatise on mechanics and dynamics applied mainly to machine motion\n)\n(1763)\nwhile at the École du Génie. He also published the more famous\nCours complet de mathematiques\nⓉ\n(\nA complete course in mathematics\n)\nin\n1765\n. Although, as we indicated above, he left the chair of mathematics at Mézières in\n1768\n, he remained as an examiner at the School until the it moved to Metz in\n1794\n. He then essentially continued his role, becoming an examiner at the École Polytechnique.\nThe economist Turgot, Baron De L'Aulne, was appointed 'comptroller general' of France by Louis XVI on\n24\nAugust\n1774\n. Among his first actions was the creation of a chair of hydrodynamics at the Louvre, where he himself had studied. Turgot's friend the\nMarquis de Condorcet\n, whom he had appointed as Inspector General of the Mint, may well have influenced him to create the chair. Since\nCondorcet\nand Bossut were close collaborators it may have essentially been created for Bossut who certainly was appointed and filled it until\n1780\n. In\n1775\nBossut participated with\nd'Alembert\nand\nCondorcet\nin experiments on fluid resistance. Also during this period he was editing an edition of the works of\nPascal\nwhich was published in five volumes in\n1779\n.\nHe was later to collaborate with\nd'Alembert\non the mathematical part of Diderot's\nEncyclopédie méthodique\nⓉ\n(\nThe Methodical Encyclopedia\n)\n. Also later in his career he wrote\nMéchanique en général\nⓉ\n(\nMechanics in general\n)\n(1792)\nand his treatise on the history of mathematics in two volumes\nEssai sur l'histoire générale des mathématique\nⓉ\n(\nEssay on the general history of mathematics\n)\n(1802)\n.\nBossut became somewhat of a recluse during the last years of his life. He had never married and had no close family. Although he seems to have come to dislike the company of people, he had been honoured for his work by many scientific academies. The academies of Lyon and Toulouse awarded him prizes, and he was elected to the\nSt Petersburg Academy of Sciences\nas well as the academies at Turin and Bologna."
}