{
  "nome_completo": "Christian Andreas Doppler",
  "nome_curto": "Christian Doppler",
  "ano_nascimento": "1803",
  "ano_morte": "1853",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Doppler/",
  "lugar_nascimento": "Salzburg, Austria",
  "lugar_morte": "Venice (now Italy)",
  "biografia": "Christian Doppler\n's family were stonemason's who had a successful business in Salzburg, Austria from\n1674\n. The prospering business led to the building of a fine house in the Hannibal Platz\n[\nnow named Makart Platz\n]\nin Salzburg, near to the river. Christian Doppler was born in this family house and, of course, the family tradition would have had him grow up to take over the stonemason's business. However his health was never very good and he was quite frail so he could not follow in the family tradition.\nDoppler attended primary school in Salzburg and then attended secondary school in Linz. His parents were unsure of his academic potential and consulted the professor of mathematics at the Salzburg Lyceum who recommended that Doppler should study mathematics at the Vienna Polytechnic Institute. The Polytechnic Institute had only been founded in\n1815\n, so it was still a new establishment when Doppler began his studies there in\n1822\n. He excelled in his mathematical and other studies and graduated in\n1825\n. After this he returned to Salzburg, attended philosophy lectures at the Salzburg Lyceum, then went to the University of Vienna where he studied higher mathematics, mechanics and astronomy.\nAt the end of his studies at the University of Vienna in\n1829\n, Doppler was appointed as assistant to the professor of higher mathematics and mechanics at the University, Professor A Burg. He published four mathematics papers during his four years as Burg's assistant, his first being\nA contribution to the theory of parallels\n. This assistantship was only a temporary post and Doppler, rather older than most others, began to seek a permanent post at the age of\n30\n. In\n[\n12\n]\nSeidlerova explains how applications worked at that time in Austria:-\nFrom\n1825\nall vacant professorships at Austrian universities and polytechnics were filled by public competition. It actually meant admission examination, where the questions were determined ... The applicants at various schools of the monarchy had to answer them in written form, which could take up to twelve hours. Part of the examination was also a short probationary lecture on an arbitrary topic in front of the appointed commission. The sealed answers, together with an evaluation of the lecture, were then sent to the school where the competition had been announced.\nThe final decisions were taken by the commission in Vienna but the applicants were only selected on their teaching ability, any sign of higher levels of knowledge would be treated as telling against the candidate. Doppler submitted himself to a number of these competitions, both for school and university places. He applied to schools in Linz, Salzburg, Gorizia and Ljubljana and for the chair of higher mathematics at Vienna Polytechnic and on\n23\nMarch\n1833\nfor the professorship of arithmetic, algebra, theoretical geometry and accountancy at the Technical Secondary School in Prague.\nWhile this was going on Doppler had to earn his living and he spent\n18\nmonths as a bookkeeper at a cotton spinning factory. This was a period of sadness and great difficulty for Doppler and it is not surprising that he decided to give up the unequal struggle and emigrate to America. He began to sell his possessions and visited the American Consul in Munich to make the necessary arrangements. However, when he was close to making the final decision he received an offer of the post at the Technical Secondary School in Prague. It had taken a long time for the process of appointing to reach its conclusion and Doppler took up his post in March\n1835\n, almost exactly two years after entering the competition.\nDoppler was ambitious and teaching elementary mathematics at the Technical School was not greatly to his liking. He tried for a post of professor of higher mathematics at the Polytechnic in Prague but without success. However, during\n1836\n-\n38\nhe was able to teach higher mathematics for four hours a week at the Polytechnic. This brought in extra money which he certainly needed since he married in\n1836\n.\nDoppler did get another chance of a post at the Polytechnic, however, and at the end of\n1837\nthe professorship in practical geometry and elementary mathematics became vacant. Doppler assumed the duties of the post but things were not that straightforward. Despite the fact that he was carrying out the duties, a competition for the post was held on\n3\nOctober\n1839\n. Doppler did not have to take part in the competition but was hurt by the fact that it was held at all. He was formally appointed to the post in March\n1841\n.\nDoppler did not have an easy time teaching at the Polytechnic. Seidlerova writes in\n[\n12\n]\n:-\nThe examinations were very stressful. The terms of both oral and written exams had to be reported in advance to the Land Committee which also nominated the examination commissioner. For example, in January and February\n1843\nDoppler had to examine\n256\nstudents in\n17\ndays, both in writing and orally, in arithmetic and algebra. The examinations took a minimum of six hours daily. The same number of students sat for the examination in \"theoretical geometry\" in June and July of the same year in a twelve day examination. Additionally in July and August it was necessary to examine\n145\nstudents in geodesy in eight days. ... In July\n1847\nDoppler orally examined\n526\nstudents in mathematics and\n289\nin geodesy.\nBy\n1844\nDoppler's health, always less than good, failed under the strain. He had to give up teaching and requested sick leave. He had support from\nBolzano\nwho wrote\n[\n14\n]\n:-\nIt is hard to believe how fruitful a genius Austria has in this man. I have written to ... many people who can save Doppler for science and not let him die under the yoke. Unfortunately I fear the worst.\nThe situation was made worse by Doppler's students complaining that he was too harsh in his examining. Doppler was investigated and reprimanded while the students were allowed to retake their examinations. Doppler considered himself totally innocent and demanded that the reprimand be withdrawn. Eventually the reprimand was reluctantly withdrawn by the end of\n1844\nbut Doppler was not well enough to return to his duties until\n1846\n.\nWith such a difficult time in Prague, it is no surprise that Doppler wanted to move and he was offered the professorship of mathematics, physics and mechanics at the Academy of Mines and Forests in Banska Stiavnica. Stoll writes\n[\n14\n]\n:-\nWhen Doppler left Prague for Banska Stiavnica, he did not suspect that his stay in this city would be so short. The stormy year\n1848\nshook all parts of the monarchy and revolution broke out in Prague, Vienna and Budapest. Due to political unrest the situation in Banska Stiavnica became complicated and Doppler was once again seeking refuge.\nHe was now a figure of some importance so a move was now able to be made with less difficulty. He was appointed to Vienna Polytechnic, then on\n17\nJanuary\n1850\nhe was appointed as the first director of the new Institute of Physics at Vienna University. Doppler had reached the high point of his career.\nWhat qualities had carried Doppler through the struggles of his early experiences to this important position? It was not, it seems, his great mathematical abilities, for despite his career as a mathematician he was always short of the topmost level when it came to mathematical research. In fact his grasp of mathematics may have been even less good than this for he wrote an elementary text\nArithmetic and algebra\npublished in Prague in\n1843\n. Seidlerova, describing this work in\n[\n12\n]\nwrites:-\nDoppler's explanations were conducted in a very unfortunate way and demonstrated that in the basic questions of mathematics he groped more than his eminent contemporaries.\nHowever, despite this Doppler did have genius within him. It was a genius that\nBolzano\nsaw from the very first.\nBolzano\nreviewed the first paper which Doppler submitted to the Royal Bohemian Society of Sciences in\n1837\n. After recommending Doppler's paper on applied analysis for publication,\nBolzano\ncommented about Doppler himself. Dated Prague\n25\nSeptember\n1839\n, the report reads\n[\n14\n]\n:-\nMr Doppler has already demonstrated his very promising abilities to the scientific community through his numerous published works in mathematics and physics. The expectations raised by his hitherto published works would multiply when one enters into personal acquaintance with him. You are not only struck by how many highly interesting and fruitful ideas, in many areas of knowledge, that so young a scientist is able to produce, but you also convince yourself with the greatest pleasure that this exceptional spiritual power combines with an amiable character, genuine unaffected determination and with that pure love of science and truth ...\nSo\nBolzano\n, himself a great mathematical innovator, could see the genius in Doppler. Not everyone could see it however.\nKulik\n, who was professor of mathematics at the Charles University of Prague while Doppler worked at the Polytechnic,\n[\n14\n]\n:-\n... did not have much understanding of Doppler's originality or of his intuitive ways of thinking.\nBolzano\nmoved to Prague in\n1842\nand became secretary to the mathematical section of the Royal Bohemian Society of Sciences. He was then in closer contact with Doppler and\nBolzano\nwrote in\n1844\n[\n14\n]\n:-\nProfessor Doppler over several weeks has excited me with his ideas, the one more brilliant than the other. I must think about them day and night.\nHowever two years before\nBolzano\nwrote this, Doppler had presented his most famous brilliant idea to the Royal Bohemian Society. On the\n25\nMay\n1842\nDoppler presented the paper\nOn the coloured light of the double stars and certain other stars of the heavens\n. The minutes of the meeting reported on Doppler's lecture\n[\n11\n]\n:-\nMr Doppler talked about a wonderful phenomenon of the coloured light of the double stars and some other stars in the heavens. He sought the explanation of this striking phenomenon in formulating a new general theory, which included in itself as an integral part the theory of\nBradley\n.\nThe paper presented for the first time the Doppler principle which relates the frequency of a source to its velocity relative to an observer. Doppler derived the principle in a few lines treating both light and sound as longitudinal waves in the ether and matter, respectively. Doppler was incorrect regarding light being a longitudinal wave. In fact\nFresnel\nhad already published his theory that light was a transverse wave but, although Doppler had read\nFresnel\n's work, he did not accept it. However the error does not really affect the result of Doppler's principle. Doppler also was wrong when he tried to illustrate his theory with an application to the colours of double stars. Although Doppler was correct in saying that his principle would change the colours of double stars, depending on which star was approaching or receding from the Earth, the effect is too small to be significant.\nDoppler does, however, make a remarkable prediction in his paper:-\nIt is almost to be accepted with certainty that this will in the not too distant future offer astronomers a welcome means to determine the movements and distances of such stars which, because of their unmeasurable distances from us and the consequent smallness of the parallactic angles, until this moment hardly presented the hope of such measurements and determinations.\nAlthough changes in colours were impossible to observe with the instruments of the time, the situation with sound was rather different. As early as\n1845\nexperiments were conducted with musicians on railway trains playing instruments and other trained musicians writing down the apparent note as the train approached them and receded from them. In\n1846\nDoppler published a better version of his principle where he considered both the motion of the source and the motion of the observer.\nNot everyone of course was immedately convinced by Doppler's theory. His most vigorous opponent was\nPetzval\n, by this time professor of mathematics at the University of Vienna. Their dispute was based on a misunderstanding, in some sense both were correct but they could not see that they were arguing about different things.\nNo other work by Doppler came anywhere close in matching the importance of his publications on the Doppler principle. He did publish on electricity and magnetism, the variation of\nmagnetic declination\nwith time as well as several publications on optics and astronomical topics. His mind would continually come up with new ideas and so he was led to invent many instruments, particularly optical instruments, and improve existing ones. Most of his ideas are quite revolutionary, he was certainly a very original thinker, but on the down side most would just not work in practice. However one can often see the germ of some important future discovery there, even though the idea as presented by Doppler is basically incorrect.\nDoppler had some difficulty becoming a member of the Royal Bohemian Society despite very strong support from\nBolzano\nand his good relations with the Society. In\n1837\n, when he reviewed the first paper that Doppler submitted to the Society,\nBolzano\nrequested in his report that Doppler be elected to the Society. This was not acted on but, in the following year, Doppler was proposed again and not elected in a ballot.\nOn\n28\nJune\n1840\nDoppler was elected an associate member of the Royal Bohemian Society after a close ballot of\n7\nfor and\n5\nagainst. It does appear that after his\n1842\npaper he gained more favour for he was elected as an ordinary member of the Society on\n5\nNovember\n1843\nwith\n9\nvotes in his favour and only one against. In\n1847\nhe was elected deputy secretary of the Society and became one of the leaders of the Society who showed, according to\nBolzano\n's words\n[\n11\n]\n:-\n... pure love of science and truth which rises high above narrowminded party-spirit as well as conceited inflexibility.\nOther honours which came Doppler's way in\n1848\nwere election to ordinary membership of the\nImperial Academy of Sciences\nin Vienna and an honorary doctorate from the University of Prague.\nDoppler's time as the first Director of the Institute of Physics at Vienna University was a short one. He was appointed by Imperial Decree on\n17\nJanuary\n1850\n. His health continued to deteriorate with severe chest problems and, in November\n1852\n, he travelled to Venice in the hope that the warmer climate would bring about some improvement. It was not to be, however, and by March\n1853\nit was clear that he was sinking fast. Doppler's wife, who had given him staunch support throughout their marriage, had remained in Vienna with their three sons and two daughters awaiting his return but, on realising that his end was near, she made the journey to Venice and was with Doppler when he died."
}