{
  "nome_completo": "Erik Christopher Zeeman",
  "nome_curto": "Chris Zeeman",
  "ano_nascimento": "1925",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zeeman/",
  "lugar_nascimento": "Yokohama, Japan",
  "lugar_morte": "Woodstock, Oxfordshire, England",
  "biografia": "Chris Zeeman\n's father Christian Zeeman was from Aarhus in Eastern Jutland, Denmark, while his mother was Christine Bushell. He spent the first year of his life in Japan before his parents returned to England. His first memory of being fascinated by mathematics was when his mother showed him how to solve a problem when he was seven years old. The problem was: given a rectangle\n3\nby\n4\n, what would be the dimensions of a rectangle inside the given one which was half the area and left an equal width border all round. Chris still remembers his mother explaining how to solve it by introducing\nx\nx\nx\nfor twice the width of the border\n[\n3\n]\n:-\n... it was a revelation to me.\nIt was the one and only time he remembers discussing mathematics with his mother. Zeeman was educated at Christ's Hospital School in Horsham, West Sussex, England which he did not enjoy, feeling that it was a prison in which he lost his self-esteem. He served as a Flying Officer with the Royal Air Force from\n1943\nto\n1947\n[\n3\n]\n:-\nI was a navigator on bombers, trained for the Japanese theatre, but that was cancelled because they dropped the atomic bomb a week before we were due to fly out. Since the death rate was\n60\n% in that theatre it probably saved my life, but at the time I was disappointed not to see action, although relieved not to have to bomb Japan, the land of my birth.\nZeeman's university studies were at Christ's College Cambridge and at first he had to contend with the fact that he had forgotten much of his school mathematics while serving in the Royal Air Force. He received his B.A. from Cambridge and remained there to study for his doctorate under\nShaun Wylie\n. He was awarded his Ph.D. in\n1953\nfor his thesis\nDihomology\nbut he spent the first year as a research student trying unsuccessfully to solve the\n3\n-dimensional\nPoincaré\nConjecture. Zeeman was then awarded a fellowship by Gonville and Cais College Cambridge in\n1953\n. After being awarded a Commonwealth Scholarship he spent the year\n1954\n-\n55\npartly at the University of Chicago and partly at Princeton. Back at Cambridge, he was appointed a College Lecturer in\n1955\n. In\n1960\nhe married Rosemary Gledhill; they had three sons and two daughters. One of the daughters is a mathematician who has collaborated with her father.\nDuring\n1962\n-\n63\nZeeman was a member of the Institut des Hautes Études Scientifiques. Then in\n1964\nhe made the biggest move of his life when he went to the new University of Warwick in Coventry. Warwick's first Vice-Chancellor Jack Butterworth invited him to become the Foundation Professor of Mathematics in\n1963\n. Zeeman explained\n[\n1\n]\n:-\nAt first I said \"no\"; then changed my mind after a sleepless night. ... I had always thought that Cambridge was the centre of things, but I grew as a mathematician at Warwick.\nAt Warwick he led the setting up of the Department of Mathematics and the Mathematics Research Centre. He decided that the first six appointments he made would be topologists, then the next appointments would be algebraists. Those he initially invited, he encouraged  to accept by telling them that the others had all accepted. When the University took in its first undergraduates in October\n1965\n, it seemed as though mathematics at Warwick was already established with an international reputation. This was largely due to Zeeman's remarkable leadership.\nZeeman's style of leadership at Warwick was a very informal one. It produced an atmosphere in which mathematical research flourished. From\n1964\nZeeman remained at Warwick until\n1988\n, although he did spend\n1966\n-\n67\nas a visiting professor at the University of California at Berkeley. His research took a different turn as he explained\n[\n3\n]\n:-\nDuring\n1968\n-\n69\nI learnt about\ndynamical systems\nduring the Warwick Symposium we ran on the topic, when many of the world leaders including\nSmale\nand\nThom\nspent time at Warwick. In the following year I spend a sabbatical with\nThom\nat the Institut des Hautes Études Scientifiques in Paris, where I learnt all about catastrophe theory. So I was very fortunate to get in on the ground floor of such beautiful new subjects.\nFrom\n1976\ntill\n1981\nhe held a senior SERC fellowship which enabled him to concentrate on research. He also held a visiting fellowship at Oxford during\n1985\n-\n86\n.\nIn\n1988\nZeeman left Warwick, although he was made an honorary professor there on leaving. At this point he became Principal of Hertford College, Oxford, and Gresham professor of geometry at Gresham College London. He retired from this post at Gresham College in\n1994\nand from his position of Principal of Hertford College in\n1995\n.\nZeeman has held important roles within UK mathematics. He served on the SERC Mathematics Committee from\n1982\nto\n1985\nand, in\n1990\n, he chaired the committee which set up the\nIsaac Newton\nInstitute in Cambridge. He continues to serve on the Steering Committee for the\nIsaac Newton\nInstitute.\nZeeman's research has been in a variety of areas such as\ntopology\n, in particular PL topology, dynamical systems and mathematical applications to biology and the social sciences. His initial research was in topology and one of his theorems was the\nunknotting\nof spheres in five dimensions. Certainly his work in topology would make him one of the leading topologists of all time but he may be known principally for other work.\nPerhaps he is best known for his work on catastrophe theory for, although this theory was due initially to\nRené Thom\n, it was Zeeman who brought it before the general public giving widespread publicity to applications of what was before that time thought of as pure mathematics. In particular Zeeman pioneered the applications of catastrophe theory in the biological and behavioural sciences, as well as the physical sciences. He invented the Zeeman Catastrophe machine which was a mechanical device to illustrate how a small perturbation can give rise to a discontinuous consequence.\nAmong the books which Zeeman has published are the texts\nCatastrophe theory\n(1977)\n,\nGeometry and perspective\n(1987)\nand\nGyroscopes and boomerangs\n(1989)\n. One of his many memorable quotes, from his\nCatastrophe theory\ntext, says much about mathematical philosophy:-\nTechnical skill is mastery of complexity while creativity is mastery of simplicity.\nA shorter introduction to catastrophe theory than his\n1977\nbook was given by Zeeman in his beautifully written survey article\nBifurcation and catastrophe theory\n[\nContemp. Math.\n(1981)]\n.  The article introduces catastrophe theory in a unified way giving both elementary and non-elementary aspects. There is an elementary discussion of the cusp and the pitchfork and a statement of the classification theorem for elementary catastrophes. Asked what were the highlights of his own research he explained:-\nI suppose I am particularly fond of having unknotted spheres in\n5\n-dimensions, of spinning lovely examples of knots in\n4\n-dimensions, of proving\nPoincaré\n's Conjecture in\n5\n-dimensions, of showing that special relativity can be based solely on the notion of causality, and of classifying dynamical systems by using the Focke-Plank equation. And amongst my applications of catastrophe theory I particularly liked buckling, capsizing, embryology, evolution, psychology, anorexia, animal behaviour, ideologies, committee behaviour, economics and drama.\nIn\n1978\n, Zeeman gave the Christmas Lectures at the Royal Institution, out of which grew the Mathematics Master classes for\n13\n-year old children that now flourishes in forty centres in the United Kingdom. He was the\n63\nrd\nPresident of the\nLondon Mathematical Society\nin\n1986\n-\n88\nand delivered the Presidential Address to the Society on\n18\nNovember\n1988\nOn the classification of dynamical systems\n.\nHe was awarded the Senior\nWhitehead\nPrize of the\nLondon Mathematical Society\nin\n1982\n. During his period as president of the Society, he became the Society's first Forder lecturer in\n1987\n. Elected to the\nRoyal Society of London\nin\n1975\n, he was awarded the Societie's\nFaraday\nMedal in\n1988\n.\nZeeman was knighted in\n1991\nand he has received many honours in addition to those mentioned above. He has been awarded honorary degrees from many universities including Strasbourg\n(1974)\n, Hull\n(1984)\n, Warwick\n(1988)\n, York\n(1988)\n, Leeds\n(1990)\n, Durham\n(1990)\nand Hartford\n(1992)\n.\nI\n[\nEFR\n]\nfirst met Chris Zeeman in\n1965\nwhen I went to Warwick as a postgraduate student. He leapt out of his office to greet the new postgraduates with \"Hi, I'm Chris\". He is an exceptional lecturer with a remarkable ability to convince his audience that they understand the deep concepts that he is explaining, either in a research seminar of talking to non-mathematicians.\nThe first year that Warwick opened for undergraduates, all the undergraduates and postgraduates could get into one lecture theatre. There was a course covering all aspects of study including arts, science and mathematics. Chris Zeeman gave the mathematics lectures and explained to an audience, most of whom had no more than a low level school mathematics qualification, knotting and unknotting spheres in high dimensions. The remarkable thing was that everyone said they understood what he was talking about!\nLet us end by giving Zeeman's views on a few topics. First when asked about the value of mathematical education he replied that:-\n... vocational apprenticeship to the profession of mathematical teaching needs discipline if the student is to master the necessary techniques. And such discipline needs to be taught, needs specialists to teach it, and needs to be supported by research on curriculum reform and the analysis of learning techniques.\nWhen asked whether he regards mathematics as an art or a science, he replied\n[\n1\n]\n:-\nBoth. Sometimes you invent it; sometimes you discover it. You have to invent maths to get a solution to a problem but, in the process, I often discover a whole lot more which I didn't expect.\nDid he consider himself a mathematician or a scientist:-\nI ... occupied a position halfway between mathematics and science. I wanted to get my hands dirty, and make predictions, and get the experimentalists to test them, because I knew that the scientific community would never take a theory seriously unless it was capable of being tested experimentally. And I was gratified that several of my predictions were confirmed. Some were refuted, and others remain to be tested.\nIn\n[\n1\n]\nArnot writes about Zeeman's interests outside mathematics:-\nFine wines are among his pleasures. Fine music and fine art, too. Classical CD collections occupy the few shelves not crammed with tomes on Catastrophe Theory and other pet subjects. Works by Vermeer and Velasquez share a window ledge with a spherical jigsaw, above which dangles a chain made up by nine pairs of spectacles.\nOn\n2\nOctober\n2006\nthe\nLondon Mathematical Society\nand the Institute of Mathematics and its Applications announced that the\n2006\nDavid Crighton Medal for services to Mathematics and to the Mathematics Community was to be awarded to Professor Sir Christopher Zeeman, F.R.S.:-\n... in recognition of his long and distinguished service to mathematics and to the mathematical community in all areas - in research, to mathematics in higher education, to the mathematical societies, and in outreach activities with schools and the public.\nThe announcement contained a more detailed summary of the reasons that the award was being made. It begins by describing his research contributions in a similar way to what we have written above, and goes on to explain his brilliant achievement setting up mathematics at the University of Warwick. The announcement continues:-\nAs chair of the Mathematics Committee of SERC he created the Nonlinear Systems Initiative which went on to become the Applied Nonlinear Systems Initiative. He created HoDoMS - the committee that represents mathematics departments. He chaired the inaugural Scientific Committee of the Newton Institute that oversaw its creation and chose the programmes during its first ten years. He is a past-President of the London Mathematical Society\n(1986\n-\n88)\nand received the Senior\nWhitehead\nPrize of the Society in\n1982\n.\nHe was a pioneer in the area of public engagement with mathematics, and has a strong involvement with school mathematics. As early as\n1967\nhe was speaking on\n(\nthe then\n)\nBBC Third Programme on topics such as topology. He delivered the\n1978\nRoyal Institution Christmas Lectures on BBC television - the first time in the\n150\n-year history of these lectures, founded by\nMichael Faraday\n, that the topic was mathematics. These lectures led Sir Christopher to start the Royal Institution Mathematics Masterclasses for talented young people. He was Gresham Professor of Geometry from\n1988\nto\n1994\n, delivering an annual series of public lectures. For his work in the public understanding of science he received the prestigious\nRoyal Society\nFaraday\nMedal in\n1988\n. He served as the President of the\nMathematical Association\nin\n2003\n-\n04\n, a post to which he brought his customary enthusiasm and ideas, ensuring that the power and beauty of mathematics is at the heart of mathematics education, and that the wider public should have inspirational opportunities to experience this for themselves.\nOn\n24\nApril\n2007\nZeeman delivered his David Crighton Award lecture\nWhat's wrong with Euclid Book V\nto an audience at the\nRoyal Statistical Society\n. The\nLondon Mathematical Society\nand the Institute of Mathematics and its Applications further honoured Zeeman by creating the Christopher Zeeman Medal:-\n... to recognise and acknowledge the contributions of mathematicians involved in promoting mathematics to the public and engaging with the public in mathematics in the UK, and demonstrate that such activities are valued by the societies and the mathematical community at large and are a part of a mathematician's roles and responsibilities.\nSee\nTHIS LINK\n.\nNaming the award for Zeeman was particularly appropriate for a number of reasons: he was first mathematician to deliver the Royal Institution's Christmas Lectures; and his 'Mathematics into Pictures' series is recognised as significantly influencing to young mathematicians. The first award was made in\n2008\nwhen Zeeman presented the Christopher Zeeman Medal to Professor Ian Stewart, FRS."
}