{
  "nome_completo": "Christoph Gudermann",
  "nome_curto": "Christoph Gudermann",
  "ano_nascimento": "1798",
  "ano_morte": "1852",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gudermann/",
  "lugar_nascimento": "Vienenburg (near Hildesheim), Germany",
  "lugar_morte": "Münster, Germany",
  "biografia": "Christoph Gudermann\n's father was a school teacher. Christoph was academically able in his schooling so, as many able boys at this time did, it was intended that he should train to became a priest. He attended the University of Göttingen but there, among the whole range of subjects he studied, he became interested in mathematics.\nGudermann then followed in his father's footsteps by becoming a school teacher. He obtained a post as a teacher of mathematics in a secondary school in Kleve in\n1823\nand taught there until\n1832\nwhen he was appointed to the Theological and Philosophical Academy in Münster. His first appointment in the Academy in Münster was as an extraordinary professor, but later he was promoted to ordinary professor of mathematics there.\nGudermann worked almost exclusively on spherical geometry and\nspecial functions\nbut he is not remembered for any original mathematical results in these areas. This is not to say that he did not do useful original research but just that he suffered the fate that many mathematicians have suffered, namely that a comprehensive theory was developed later which meant that his contributions fused into the theory. His own contributions tended to be a whole series of special cases\n(\nalthough this could not have been obvious at the time\n)\nwhich were forgotten later when the general results which included them were found. He did write a book on spherical geometry and\n[\n1\n]\n:-\nIn the introduction he pointed out that a plane was a special case of a spherical surface, that is a sphere with infinite radius. For this reason and because of its constant curvature there exist many similarities between spherical geometry and plane geometry; yet at the same time Gudermann considered more interesting the study of cases where the similarity no longer holds.\nIn his more extensive work on the theory of special functions Gudermann published several papers beginning in\n1830\nwhich extended work which was developed by\nEuler\n,\nLanden\n,\nLegendre\n,\nAbel\nand\nJacobi\n. He summarised his contributions in two monographs published in\n1833\nand\n1844\n. A third monograph, which he promised to write on the topic, was not written because of his early death.\nGudermann is best known, however, as the teacher of\nWeierstrass\nbetween\n1839\nand\n1841\nwhile\nWeierstrass\nworked for his secondary school teacher's certificate. Gudermann, at this time, was particularly interested in the theory of\nelliptic functions\nand in the expansion of functions by power series. In particular his use of power series in the study of the hyperbolic functions is of importance. This was to influence later developments in the subject. He introduced the notation\nsn\n,\ncn\nand\ndn\nwhich became standard for the hyperbolic functions.\nNot only did Gudermann undertake research in the theory of elliptic functions but he was one of the first to teach the topic.\nWeierstrass\nspent the academic year\n1839\n-\n1840\ntaking Gudermann's course on elliptic functions. Much of the article\n[\n3\n]\nis devoted to studying Gudermann's work and how it influenced the direction that\nWeierstrass\n's research would take, in particular it played an important role in\nWeierstrass\n's\nhabilitation\nthesis. Manning writes in\n[\n3\n]\n:-\nThe concepts on which\nWeierstrass\nbased his theory of functions of a complex variable in later years after\n1857\nare found explicitly in his unpublished works written in Münster from\n1841\nthrough\n1842\n, while still under the influence of Gudermann. The transformation of his conception of an analytic function from a differentiable function to a function expandable into a convergent power series was made during this early period of\nWeierstrass\n's mathematical activity."
}