{
  "nome_completo": "Chrysippus of Soli",
  "nome_curto": "Chrysippus",
  "ano_nascimento": "280 BC",
  "ano_morte": "206 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chrysippus/",
  "lugar_nascimento": "Soli, Cilicia, Asia Minor (now Soloi, Turkey)",
  "lugar_morte": "Athens, Greece",
  "biografia": "Chrysippus\nwas of Phoenician roots. He came to Athens to study philosophy at the\nAcademy\nwith\nArcesilaus\n. After a while he left the\nAcademy\nand moved to the\nStoa Poikile Academy\nin Athens where he was a pupil at the School founded by\nZeno of Citium\n.\nBy the time Chrysippus joined the Stoa Poikile Academy, Cleanthes of Assos had become the second head following the death of Zeno. Chrysippus studied under Cleanthes, but he had also been influenced by the teachings of\nPlato\n. In\n232\nBC Chrysippus became the third head of the Stoa Poikile following the death of Cleanthes. He was to continue to hold this position until his own death.\nThere is evidence from the writings of Chrysippus that he was poor throughout his life. Certainly he stated that for a philosopher to become wealthy he might serve a king\n(\nor even, said Chrysippus, become a king himself\n)\n. It is clear however that he did not adopt this route to a steady income. Otherwise, Chrysippus writes, the philosopher must rely on his friends and on teaching in order to live, and it would appear that this is the means by which he made his small income.\nAnother piece of information, which again is not surprising, is that Chrysippus wrote Greek with very poor style. This seems to have been a characteristic of people from Soli, and this is preserved today in the expression 'solecism'. Despite his Greek prose being awkward, he was a prolific writer who is said to have written\n705\nrolls of papyri, none of which are remains today.\nTogether with Zeno of Citium, Chrysippus is considered the cofounder of\nStoicism\n. Stoicism takes its name from the Stoa Poikile Academy which in turn means \"Painted Colonnade\", the place where the founder of the academy usually lectured.\nChrysippus was one of the first to organise propositional logic as an intellectual discipline. Unanalysed propositions joined by connectives were studied. This allowed the Stoics to make major advances in mathematics and science. The logical term \"disjunction\" is certainly due to the Stoics and it is thought to have originated with Chrysippus.\nDiogenes Laertius\nin\n[\n3\n]\nlists\n118\nworks on logic by Chrysippus, and of these\n118\nthere are seven books occupying\n15\nrolls of papyri concerning the Liar Paradox.\nOne claim which Chrysippus made in the area of logic was to reject that the impossible does not follow from the possible. His arguments regarding this are presented in\n[\n8\n]\nwhich also examines more generally his views on modal logic.\nIn physics Chrysippus made distinctions between \"whole\" and \"all\" or \"universe\". He argued that the \"whole\" is the world while the \"all\" is the external void together with the world. He believed that logic and physics are necessary to differentiate between good and evil. For Chrysippus a knowledge of physics is necessary before\nethics\ncan be formulated. To him the value of physics and logic is mainly for this purpose.\nRussell\nin\n[\n4\n]\nsays:-\nChrysippus ... had an elaborate theory of knowledge, in the main empirical and based on perception, though\n[\nhe\n]\nallowed certain ideas and principles, which were held to be established by ... the agreement of mankind.\nOne of the contributions of Chrysippus to mathematics is his claim that 'one' is a number. It may seem strange to us to realise that 'one' was ever not considered as a number but of course a little thought makes it clear that indeed there is no need for a number to describe a single object. In fact 'one' was considered as that by which things are measured.\nAristotle\n, in\nMetaphysics\nwrites\n(\nsee for example\n[\n5\n]\n)\n:-\n... a measure is not the things measured, but the measure or the One is the beginning of number.\nChrysippus said 'one' was 'multitude one' and should be regarded as a number but this was not immediately accepted,\nIamblichus\nwriting that 'multitude one' was a contradiction in terms.\nPlutarch\nin\nCommon notions against the Stoics\nreports on a dilemma proposed by\nDemocritus\nas reported by Chrysippus about a cone cut by a plane parallel to its base. Chrysippus argues against the interpretation of the dilemma claiming that it is based on the assumption that mathematical lines have an\natomic structure\nand are not therefore infinitely divisible. However\nHeath\n[\n5\n]\ndoes not believe, as Chrysippus does, that\nDemocritus\nregards mathematical lines as having an atomic structure. This aspect of Chrysippus's ideas are discussed in the interesting article\n[\n7\n]\n.\nThere is a very old saying says of Chrysippus, that:-\n... he alone is the sage, the others only act as shadows.\nThere is another saying\n(\nsee for example\n[\n6\n]\n)\n:-\nIf there had been no Chrysippus, there would have been no Stoicism\nwhich certainly does not greatly overstate his importance.\nThere are a number of versions of how Chrysippus died, one of which says he drank some over proof wine while another says that he died of laughter. Consult\n[\n3\n]\nfor more\n(\nprobably fictitious\n)\ndetails of his life."
}