{
  "nome_completo": "Clement Vavasor Durell",
  "nome_curto": "Clement Durell",
  "ano_nascimento": "1882",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Durell/",
  "lugar_nascimento": "Fulbourn, near Cambridge, England",
  "lugar_morte": "South Africa",
  "biografia": "Clement Durell\n's mother was Ellen Annie Carlyon and his father was John Vavasor Durell who was rector of the church at Fulbourn. Clement was born in the rectory at Fulbourn, the fifth of his parents sons. He seems to have found having four older brothers rather daunting, and as a result he grew up to be a rather shy person.\nDurell was educated at Felsted School and, while still at school, he published his first note in the\nMathematical Gazette\n, the journal of the\nMathematical Association\n. The note was\nA geometrical method of trisecting any angle with the aid of a rectangular hyperbola\nwritten jointly with W F Beard. Durell joined the\nMathematical Association\nin\n1900\n, the year in which he entered Clare College, Cambridge, to study mathematics. He was a First Class student in the Mathematical Tripos examinations, graduating in\n1904\n. He was appointed as a mathematics teacher at Gresham's School immediately after graduating, and in the following year of\n1905\nhe moved to take up the post of mathematics master at Winchester College.\nSoon after taking up this post Durell's first textbook\nElementary Problem Papers\n(1906)\nwas published. He was promoted to senior mathematics master at Winchester College in\n1910\nand began publishing a series of articles in the\nMathematical Gazette\n. Before the outbreak of World War I, Durell published\nThe arithmetic syllabus in secondary schools\n(1911)\nand\nAnalysis and projective geometry\n(1911)\nin the\nMathematical Gazette\n. During World War I, Durell served in the Royal Garrison Artillery as a lieutenant. After the end of the war he returned to Winchester College and began publishing a series of articles in the\nMathematical Gazette\nand a remarkable series of textbooks which would make him the best known writer of English school mathematics texts.\nAs well as writing articles for the\nMathematical Gazette\nsuch as\nThe use of limits in elementary geometry\n(1925)\nand\nThe teaching of loci in the elementary geometry course to school certificate stage\n(1936)\n, he was also actively involved with the committee work of the\nMathematical Association\nand its report production. He wrote reports\nThe teaching of geometry in schools\n(1925)\n,\nMemo from the Girls' Schools' Committee: Mathematics for girls\n(1926)\n, and\nQuestionnaire on the teaching of mathematics in evening continuation schools\n(1926)\n. Among the books he wrote around this time were:\nReadable relativity\n(1926)\n,\nA Concise Geometry\n(1928)\n,\nMatriculation Algebra\n(1929)\n,\nArithmetic\n(1929)\n,\nAdvanced Trigonometry\n(1930)\n,\nA shorter geometry\n(1931)\n,\nThe Teaching of Elementary Algebra\n(1931)\n,\nElementary Calculus\n(1934)\n,\nA School Mechanics\n(1935)\n, and\nGeneral Arithmetic\n(1936)\n. In a catalogue produced by the\nMathematical Association\n's publishers G Bell & Sons in\n1934\n, they listed\n20\ntextbooks by Durell and write:-\nThere can indeed be few secondary schools in the English-speaking world in which some at least of Mr Durell's books are not now employed in the teaching of mathematics.\nRather than list all the many works that Durell produced, we prefer to take a closer look at two of them. First let us look more closely at\nReadable Relativity. A Book For Non-Specialists\nwhich Durell first published with G Bell & Sons in\n1926\n. It is worth noting that the first text in English on relativity was by\nEddington\nin\n1923\nso Durell's text came very early. The publisher described Durell's book as follows:-\nPrecise, brief, and practical, this text is the work of a highly respected teacher with years of classroom experience, who sketches the mathematical background essential to a clear understanding of the fundamentals of relativity theory. Each subject - including the velocity of light, the measurement of time and distance, and the properties of mass and momentum - is illustrated with diagrams, formulas, and examples. All chapters conclude with a series of exercises, with solutions at the end of the book. Readers possessing a minor degree of mathematical capacity and a willingness to work out a few numerical examples will find that this text puts\nEinstein\n's view of the universe well within their grasp.\nIn\n1960\nan American edition of the book was published by Harper & Brothers, New York. This edition of the book contains a Preface written by\nFreeman J Dyson\nwho was a former pupil of Durell.\nDyson\n, who describes Durell's great abilities as a teacher and writer, says of the book:-\nThe best layman's introduction to relativity that has ever been written by anybody.\nRecently, in\n2003\n, this\n1960\nedition has been reprinted by Dover Publications.\nFor the second of our more detailed looks at one of Durell's texts let us consider\nAdvanced Trigonometry\nwhich was also originally published by G Bell & Sons. This work was a collaboration of Durell and Alan Robson who taught at Marlborough College and was a major figure in the\nMathematical Association\n. The publisher writes:-\nThis volume will provide a welcome resource for teachers seeking an undergraduate text on advanced trigonometry, when few are readily available. Ideal for self-study, this text offers a clear, logical presentation of topics and an extensive selection of problems with answers. Contents include the properties of the triangle and the quadrilateral; equations, sub-multiple angles, and inverse functions; hyperbolic, logarithmic, and exponential functions; and expansions in power-series. Further topics encompass the special hyperbolic functions; projection and finite series; complex numbers;\nde Moivre\n's theorem and its applications; one- and many-valued functions of a complex variable; and roots of equations.\nWe left describing Durell's career with him back at Winchester College after World War I as senior mathematics master. In\n1920\nbe became, in addition, a housemaster at Chernocke House and retained this position for seven years. In contrast to his great success as a teacher and as a textbook writer, Durell did not excel in the role of housemaster. He was not good at personal relationships and his natural shyness with people meant that he did not make much of a success of this position. His relations with the\nMathematical Association\nalso became rather cool after he openly criticised one of their reports of\n1923\nas being elitist and impractical. He kept in contact with the Association, however, and returned to contributing articles to the\nMathematical Gazette\nin\n1936\nafter a break of ten years from publishing in the journal. He contributed\nThe teaching of loci in the elementary geometry course to school certificate stage\n(1936)\n,\nOn differentials\n(1936)\n,\nDifferentials\n(1937)\n,\nA theorem in solid geometry\n(1941)\n,\nThe transition from school to university mathematics\n(1948)\n, and\nThe nature of main-school geometry\n(1949)\n. He also contributed a number of letters and an obituary of Alan Robson in\n1952\n.\nNot only did Durell resume writing articles for the journal of the\nMathematical Association\nbut he also began to take an active part its work. As secretary to the committee reporting in\n1953\non the teaching of geometry in schools, he is described in\n[\n3\n]\nas:-\n... an indefatigable worker, producing numerous drafts, and a courteous though persistent critic of anything he thought loose or inconsistent in the efforts of others.\nPrice writes\n[\n1\n]\n:-\nOn his retirement from Winchester College, Durell moved to\n73\nNorth Lane, East Preston, Sussex, where he was accompanied by a housekeeper, a gardener, and large dogs. Golf was, at one time, a chief recreation, and, in his old age, he escaped from English winters to the climates of Madeira and, latterly, South Africa ..."
}