{
  "nome_completo": "Constantin Carathéodory",
  "nome_curto": "Constantin Carathéodory",
  "ano_nascimento": "1873",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Caratheodory/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Munich, Germany",
  "biografia": "Constantin Carathéodory\n's father, Stephanos Carathéodory, was an Ottoman Greek who had studied law in Berlin and then served as secretary in the Ottoman embassies in Berlin, Stockholm and Vienna. Stephanos had married Despina Petrocochino, who came from a Greek family of businessmen who had settled in Marseille. At the time of Constantin's birth, the family were in Berlin since Stephanos had been appointed there two years earlier as First Secretary to the Ottoman Legation.\nThe Carathéodory family spent\n1874\n-\n75\nin Constantinople, where Constantin's paternal grandfather lived, while Stephanos was on leave. Then in\n1875\nthey went to Brussels when Stephanos was appointed there as Ottoman Ambassador. In Brussels, Constantin's younger sister Loulia was born. The year\n1895\nwas a tragic one for the family since Constantin's paternal grandfather died in that year, but much more tragically, Constantin's mother Despina died of pneumonia in Cannes. Constantin's maternal grandmother took on the task of bringing up Constantin and Loulia in his father's home in Belgium. They employed a German maid who taught the children to speak German. Constantin was already bilingual in French and Greek by this time.\nConstantin began his formal schooling at a private school in Vanderstock in\n1881\n. He left after two years and then spent time with his father on a visit to Berlin, and also spent the winters of\n1883\n-\n84\nand\n1884\n-\n85\non the Italian Riviera. Back in Brussels in\n1885\nhe attended a grammar school for a year where he first began to become interested in mathematics. In\n1886\nhe entered the high school Athénée Royal d'Ixelles and studied there until his graduation in\n1891\n. Twice during his time at this school Constantin won a prize as the best mathematics student in Belgium.\nAt this stage Carathéodory began training as a military engineer. He attended the École Militaire de Belgique from October\n1891\nto May\n1895\nand he also studied at the É d'Application from\n1893\nto\n1896\n. In\n1897\na war broke out between Turkey and Greece. This put Carathéodory in a difficult position since he sided with the Greeks, yet his father served the government of the Ottoman Empire. Since he was a trained engineer he was offered a job in the British colonial service. This job took him to Egypt where he worked on the construction of the Assiut dam until April\n1900\n. During periods when construction work had to stop due to floods, he studied mathematics from some textbooks he had with him, such as\nJordan\n's\nCours d'Analyse\nⓉ\n(\nCourse of analysis\n)\nand\nSalmon\n's text on the analytic geometry of conic sections. He also visited the Cheops pyramid and made measurements which he wrote up and published in\n1901\n. He also published a book\nEgypt\nin the same year which contained a wealth of information on the history and geography of the country.\nCarathéodory entered the University of Berlin in May\n1900\nwhere\nFrobenius\nand\nSchwarz\nwere professors. He attended\nFrobenius\n's lectures but benefited most from a twice monthly colloquium run by\nSchwarz\nwho was lecturing on his collected works. He also became close friends with\nFejér\nwhile at Berlin. After hearing excellent reports of mathematics research at Göttingen, he decided to continue his studies there and enrolled for the summer semester of\n1902\n. Carathéodory was indeed impressed with Göttingen, describing it as the\n[\n3\n]\n:-\n... seat of an international congress of mathematicians permanently in session.\nHe worked on the\ncalculus of variations\nand was much influenced by both\nHilbert\nand\nKlein\n. He received his doctorate in\n1904\nfrom Göttingen University for his thesis\nÜber die diskontinuierlichen Lösungen in der Variationsrechnung\nⓉ\n(\nOn discontinuous solutions in the calculus of variations\n)\nwhich he submitted to Hermann\nMinkowski\n. His oral examination was held on\n13\nJuly when he was also examined in his subsidiary subjects of applied mathematics and astronomy by\nKlein\nand\nSchwarzschild\n. He remained at Göttingen to write his\nhabilitation\nthesis\nÜber die starken Maxima und Minima bei einfachen Integralen\nⓉ\n(\nOn strong maxima and minima in simple integrals\n)\nwhich he submitted on\n5\nMarch\n1905\n. He then lectured as a\nPrivatdozent\nat Göttingen until\n1908\n.\nCarathéodory had spent time in Brussels with his father Stephanos over the summer of\n1907\n. After a few months of deteriorating health Stephanos died in late\n1907\n.\nStudy\n, at Bonn, had proposed Carathéodory as\nFurtwängler\n's successor and, after serious thought as to whether he should leave Göttingen, Carathéodory went to Bonn where he became a Provatdozent on\n1\nApril\n1908\n. At Bonn he collaborated with\nStudy\non isoperimetric problems. On\n5\nFebruary\n1909\nhe married Euphrosyne Carathéodory in Constantinople. In marrying Euphrosyne, who was his aunt and eleven years his junior, Carathéodory was following a family tradition of marrying close relatives.\nAfter a year at Bonn, Carathéodory was appointed as Professor of higher Mathematics at the Technical University of Hanover, so becoming\nStäckel\n's successor. Again it was not long before he moved on and on\n1\nOctober\n1910\nhe was appointed to the Chair of Higher Mathematics at the Technical University of Breslau. This time he held the chair for two and a half years before being appointed professor at Göttingen from\n1\nApril\n1913\n. The years of World War I were difficult ones for Carathéodory and his family. Most of his colleagues and students served in the military and he was isolated in Göttingen. The famine of\n1917\nhit hard but Carathéodory continued to give lecture courses at the university.\nAfter five years Göttingen he was appointed to the University of Berlin in\n1918\nbut after he had been there for a year, at the request of the Greek government, he ended his contract with Berlin on\n31\nDecember\n1919\nand travelled to Greece to undertake a new venture. By this time Constantin and Euphrosyne had two children, Stephanos born in Hanover on\n7\nNovember\n1909\nand Despina born on\n13\nOctober\n1912\n. Carathéodory had also accepted editorial positions on the boards of two major mathematics journals, the\nRendiconti del Circolo Matematico di Palermo\nfrom\n1909\nand the\nMathematische Annalen\nfrom\n1914\n.\nThe Greek government had asked Carathéodory to establish a second university in Smyrna. However, he also required a university post so he was appointed as Professor of Analytical and Higher Geometry at the University of Athens on\n2\nJune\n1920\n. On\n14\nJuly the Greek government published a bill setting up a Greek University in Smyrna and soon others were appointed at assist Carathéodory. On\n28\nJuly Carathéodory was officially appointed as organiser of the Ionian University in Smyrna and also Professor of Mathematics at the new university. In the second half of\n1921\nhe travelled widely through Europe purchasing books and equipment for the new university. The Turks attacked Smyrna in September\n1922\nand so the planned opening of the university in October of that year became impossible. Carathéodory was able to save the university library, which he had worked so hard to establish, and most of the equipment which he had been purchased for the science departments, and escaped to Athens on a Greek battleship. He taught at Athens at the National University and the National Technical University until\n1924\nwhen he moved to Munich to fill the chair left vacant when Lindemann retired.\nIn\n1928\nCarathéodory became the first visiting lecturer of the\nAmerican Mathematical Society\n. He sailed to the United States with his wife in January and after a lecture tour and time spent as a visiting professor at Harvard, returned to Munich in September. In the following year he received an offer of a post from Stanford university and was in fact appointed there in September\n1929\n. However, he seems to have only been using this offer as a means of getting better salary and conditions from Munich, which indeed he managed to do.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany\n[\n3\n]\n:-\nCarathéodory could hardly conceive how this could happen in a country with the cultural traditions of Germany. He initially tended to view the Hitler regime with a somewhat overconfident contempt, whereas later, when Hitler gained absolute power, he was incapable of resistance. His behaviour in the Nazi era was, in fact, identical with that of the ... educated bourgeois who, despite their humanistic background, in their overwhelming majority abstained from any opposition against Hitler's dictatorship, and especially Hitler's war, and thus dramatically failed to exercise their historic responsibility towards both Germany and humanity as a whole.\nCarathéodory continued to hold his position in Munich until he retired in August\n1938\n. However he certainly undertook many duties which took him to other places. In particular he continued to work on reorganising the Greek universities, particularly during\n1930\n-\n32\n, with the aim of integrating Greece academically into Europe. In\n1936\n-\n37\nhe made another visit to the United States, giving a lecture at the\nAmerican Mathematical Society\nmeeting to commemorate the tercentenary of Harvard University on\n31\nAugust\n1936\n, then spending the winter semester at the University of Wisconsin as Carl Schurz Memorial Professor.\nThe World War II was a difficult time for Carathéodory. Georgiadou writes\n[\n3\n]\n:-\n... during World War II he took part in the procedures of the Bavarian Academy of Sciences. He did not get involved in the movement for national socialism, but he did have connections with Nazi party members\n[\nparticularly\nHasse\n,\nBlaschke\nand\nSüss\n]\n. He never openly mentioned the holocaust or the Nazi crimes against Greece. ... kept silent in the face of crimes that violated any idea of human decency, accepted the authority of an illegal state, made his compromises and submitted to the expulsion of Jews from scientific institutions ... However, he took great pains to re-establish mathematics as an academic discipline in Germany after the war and thus to contribute to the reintegration of this country into the community of civilised nations.\nCarathéodory made significant contributions to the calculus of variations, the theory of point set measure, and the theory of functions of a real variable. He added important results to the relationship between first order\npartial differential equations\nand the calculus of variations. He contributed important results to the theory of functions of several variables. He examined\nconformal representations\nof simply connected regions and he developed a theory of boundary correspondence. He also made contributions in thermodynamics, the special theory of relativity, mechanics, and geometrical optics.\nCarathéodory wrote many fine books including\nLectures on Real Functions\n(1918)\n,\nConformal representation\n(1932)\n,\nCalculus of Variations and Partial Differential Equations\n(1935)\n,\nGeometric Optics\n(1937)\n,\nReal functions Vol.\n1\n: Numbers, Point sets, Functions\n(1939)\n, and\nFunktionentheorie\n, a\n2\nvolume work published in\n1950\n.\nOne might wonder why there is no\nReal functions Vol.\n2\nin this list. In fact Carathéodory did write the second volume of this work but it was destroyed while at the publisher Teubner during the bombing of Leipzig in\n1943\n.\nPerron\n, writing in\n1952\n, remarks that Carathéodory\n[\n8\n]\n:-\n... had not published many of his ideas; they result in others works, especially in those of the numerous students who were introduced by him to the spirit and ways of scientific research and who partly themselves occupy university chairs today.\nHe supervised two doctoral students at Göttingen\n(\nHans Rademacher\nand\nPaul Finsler\n)\n, one at Berlin, and\n17\nat Munich."
}