{
  "nome_completo": "Cora Susana Sadosky",
  "nome_curto": "Cora Sadosky",
  "ano_nascimento": "1940",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sadosky/",
  "lugar_nascimento": "Buenos Aires, Argentina",
  "lugar_morte": "Long Beach, California, USA",
  "biografia": "Cora Sadosky\n's parents were\nManuel Sadosky\nand\nCorina Eloisa Ratto de Sadosky\n. We have listed her as Cora Susana Sadosky but, after her marriage to Daniel Goldstein her name became Cora Susana Sadosky de Goldstein. In fact, although she was known as Cora, the name on her birth certificate is \"Corina\". She was, however, known as 'Corita' by those who had known her from her youth. Before giving details of Cora Sadosky's education and career, we look briefly at her parents, who were both mathematicians, and also see some of the problems that were encountered by academics in Argentina.\nAlthough\nManuel Sadosky\nwas born in Buenos Aires, Argentina, his parents, Natalio Sadosky and Maria Steingart, were Jewish Russian immigrants who had fled Russia because of continued violence against Jews. At the time his daughter was born he was completing his doctorate in physics and mathematics at the University of Buenos Aires. After post-doctoral studies at the\nHenri Poincaré\nInstitute in Paris, advised by\nGeorges Darmois\nand\nMaurice Fréchet\n, supported by a scholarship from the government of France, he spent a year in Italy working with\nMauro Picone\nat the Istituto per l'Applicazioni del Calcolo in Rome. He returned to Argentina in\n1949\nbut, because of his opposition to Perón, his life was difficult. From\n1949\nto\n1952\nhe worked in the Radiotécnico Institute of the University of Buenos Aires but he was dismissed for political reasons in\n1952\nand did not return to university teaching until Perón was removed from power in\n1955\n. After that he was appointed as a professor at the University of Buenos Aires and he went on to lead the way in the development of computer studies in Argentina.\nCorina Eloisa Ratto\n, the daughter of Lino Ratto and Francisca Butta, was sometimes known as Cora, but she used the name \"Corina\" more that her daughter. From a family of Italian immigrants to Argentina, she studied mathematics at the University of Buenos Aires then married\nManuel Sadosky\nin\n1937\n. She travelled to Paris with her husband in\n1945\nand undertook research for a doctorate advised by\nMaurice Fréchet\n. However, she did not complete her doctorate at this time since the family left Paris and went to Italy. Back in Argentina she worked to support the family through difficult times since they were strongly opposed to Perón. After Perón was removed from power in\n1955\nshe was able to continue her doctoral studies advised by\nMischa Cotlar\n, receiving the degree in\n1959\nfor her thesis\nConditions of Continuity of Generalized Potential Operators with Hyperbolic metric\n. She was appointed as an Associate Professor of Mathematics at the University of Buenos Aires, serving in this role from\n1958\nto\n1966\n. Throughout her life she spent much of her time fighting for human rights, fighting against the Nazis and all forms of racism, and against the oppression which various dictators who gained control in Argentina imposed on the people.\nFor a newspaper article which gives details of the problems that the Sadosky family experienced in\n1966\n, see\nTHIS LINK\nand also\nTHIS LINK\n.\nCora Sadosky, the subject of this biography, spent the first five years of her life in Argentina before the family went to France. Leaving from Buenos Aires they arrived in Rio de Janeiro, Brazil, on\n14\nNovember\n1945\non their way to Paris in France. Cora attended elementary school in Paris until January\n1948\nwhen the family moved to Rome in Italy. Cora attended school for a year in Rome before the family returned to Argentina in\n1949\n. In\n1952\nher father was dismissed from the university for political reasons and the whole family left Argentina arriving in Rio de Janeiro, Brazil, on\n19\nDecember. We assume that at this time they visited Europe, but we have been unable to verify this. On returning to Argentina in\n1949\nCora continued her schooling and\n[\n8\n]\n:-\n... ended her secondary schooling by studying at home in Buenos Aires, attending a total of eleven different schools in three different countries along the way.\nIn\n1955\n, at the age of fifteen, Cora Sadosky entered the School of Science of the University of Buenos Aires with the intention of taking physics as her major subject. She had been taught at high school by Mario Bunge\n(\nborn\n1919)\n, at that time a physicist who was a close friend of the Sadosky family who later became a famous philosopher. His excellent teaching had inspired Sadosky to study physics at university but she soon found that mathematics, especially algebra, was so fascinating that after one semester she changed to take mathematics as her major subject. While in her junior year she attended lectures by\nAntoni Zygmund\nwho was based at the University of Chicago but made periodic visits to Argentina. His first visit had been in\n1949\non a Fulbright scholarship when he had discovered two exceptional students,\nMischa Cotlar\nand\nAlberto Calderón\n, and arranged for them to study at Chicago for Ph.D.s advised by him.\nCora Sadosky was awarded the degree of Licenciatura en Matemáticas\n(\nequivalent to a Master's Degree\n)\nin\n1960\n.\nZygmund\noffered her a research assistantship at the University of Chicago where she would be able to undertake research for a Ph.D. On\n28\nDecember\n1961\nshe flew from Buenos Aires to New York on her way to the University of Chicago. She gave her permanent address at that time as Paraguay\n1949\n, Buenos Aires, Argentina\n[\n8\n]\n:-\n... in spite of the rough weather, she felt intensely happy to attend such a fine university and meet such brilliant mathematicians. She was, however, quite surprised to be the only woman in the Ph.D. program\n(\nin all the sciences, not only in mathematics\n)\nbut she wrote it off as \"American savagery.\" She certainly did not think that being a woman was at all detrimental to her studies. \"It never crossed my mind. I always felt equal to the boys.\"\nHer Ph.D. main advisor at Chicago was\nAlberto Calderón\nwith\nAntoni Zygmund\nas her second advisor. She must have spent the summer of\n1962\nin France since, on\n3\nOctober\n1962\nshe flew, with a visa obtained in France, from London, England, to New York returning to the University of Chicago. She gave her United States address as\n5728\nS. Blackstone Avenue, Chicago\n37\n, Illinois, and her permanent address as Paraguay\n1949\n, Buenos Aires, Argentina. Describing her time as a research students, she said that\n[\n4\n]\n:-\n...\nAntoni Zygmund\ntaught her to judge mathematicians by their theorems; that when someone spoke highly of a mathematician,\nZygmund\nwould always like to see the theorems such mathematician had proved.\nWhile studying at Chicago she met Daniel Goldstein, an Argentinean who was at that time studying at Yale University. Daniel Jaime Goldstein\n(1939\n-\n2014)\n, born on\n5\nOctober\n1939\n, was the son of Salvador Goldstein and Natalia Olschansky. Guadalupe Nogués, one of his students, write:-\nDaniel Goldstein was a researcher, a professor in Biology, a popularizer of science and many other things. He was also a very passionate guy, committed to what he believed with conviction ...\nSadosky spoke about the ideas and concepts on which her research was based\n[\n2\n]\n(\nsee also\n[\n14\n]\n)\n:-\nI was obsessed with parabolic singular integrals, which seemed the natural object to study after\nCalderón\n's success with elliptic and hyperbolic PDEs.\nCalderón\nencouraged me in that interest, and, as the problem was in the air, very soon afterwards a first paper on the subject appeared by B Frank Jones. This did not discourage me, since I came up with a notion of principal value for the integral through a nonisotropic distance, an idea which\nCalderón\nthought was the right one. ... through C-Z correspondence, we found out that\nZygmund\nhad assigned one of his students, Eugene Fabes, a problem close to mine and that we had both proved the pointwise convergence of parabolic singular integrals\n(\nby different methods\n)\n! Panic struck;\nCalderón\ndefended my priority on the problem, but all was solved amicably, and upon my return Gene Fabes and I wrote our first result as a joint paper.\nShe submitted her thesis\nOn Class Preservation and Pointwise Convergence for Parabolic Singular Integral Operators\nto the University of Chicago in early\n1965\nand was awarded her Ph.D. Immediately after this she returned to Buenos Aires and married Daniel Goldstein. She was appointed as an assistant professor of mathematics at the University of Buenos Aires and began publishing papers based on work she had undertaken for her Ph.D. There was\nA note on parabolic fractional and singular integrals\n(1965\n/\n66)\n,\nOn some properties of a class of singular integrals\n(1966)\n,\n(\nwith E B Fabes\n)\nPointwise convergence for parabolic singular integrals\n(1966)\n, and\n(\nwith\nMischa Cotlar\n)\nOn quasi-homogeneous Bessel potential operators\n(1967)\n. This last mentioned paper was delivered to the conference\nSingular integrals\nheld in Chicago in\n1966\n.\nArturo Illia had become President of Argentina following elections in June\n1963\n. He tried to split the Perónists, who controlled the unions, from their exiled leader Perón. The Perónists reacted by supporting a coup against President Arturo Illia in June\n1966\nand General Juan Carlos Onganía, the commander in chief of the army, took control of the country. Following the military takeover, the University of Buenos Aires was attacked by police in August\n1966\n. For a newspaper article which gives details of the problems that the Sadosky family experienced in\n1966\n, see\nTHIS LINK\n.\nBoth Sadosky and her mother resigned their positions at the university in protest. They were not alone, for around\n400\nfaculty members resigned in protest at the police brutality directed at the university staff. Sadosky, like many other academics, went to Uruguay and she taught there for one semester. Her husband, however, had gone to Johns Hopkins University to take up a postdoctoral position and Sadosky joined him there. She was appointed as an assistant professor of mathematics at Johns Hopkins University and\n[\n8\n]\n:-\n... there she realized for the first time a striking fact about being a woman in mathematics: her salary was two-thirds that of her male counterparts.\nIn\n1968\nSadosky returned to Buenos Aires but with the military still ruling the country, she was unable to make progress in her career. Not only was she unable to get an academic position but she was not even able to attend seminars or consult journals in the mathematics library. She undertook work, translating, editing and proof reading. On\n12\nNovember\n1971\nher daughter Cora Sol Goldstein was born. Sadosky's mother was keen that her daughter should keep in touch with her academic work and to help out she paid for childcare for Cora Sol to allow Sadosky to go to public libraries and study. In\n1973\nMischa Cotlar\nreturned to Buenos Aires and began a mathematical collaboration with Sadosky. The situation in Argentina, however, soon made it impossible for them to continue working there.\nArgentina was ruled by the military until elections were held in March\n1973\n. Héctor J Cámpora became president and began to work towards having the exiled Perón return. He did so in June\n1973\nwhich caused violent fighting but he became president in October\n1973\n. Opposition increased and the police, paramilitaries and intelligence branches of the administration, began to crack down on political, student, and union leaders. Human rights activists were particularly targeted.\nMischa Cotlar\nleft and was appointed to the Central University of Venezuela in Caracas. He invited Sadosky to join him and they resumed their mathematical collaboration. Cristina Pereyra writes\n[\n4\n]\n:-\n... in\n1974\n, when Corita, her husband Daniel, young daughter Cora Sol and her parents came as political refugees to Venezuela, we all lived in the same building\n(\nSan Bartolomé, in Caracas every building has a name instead of a number\n)\n. We were in the\n12\nth floor of one tower,\nCora Ratto\nand\nManuel\non the first floor of the same tower, Corita, Daniel and Cora Sol in the\n11\nth floor of the other tower, with magnificent views to El Avila the mountains that separates Caracas from the Caribbean Sea. This was no coincidence, my mother must have arranged things for her dear friends.\nSadosky wrote\n[\n12\n]\n:-\nIn Caracas,\nMischa\nand I began to collaborate in earnest and together we established an ambitious research program. Mathematically, our Caracas exile was extraordinarily productive. Although Mischa was part of the\nZygmund\nschool, he had an astonishing intellectual affinity with the Ukrainian school of Mathematics lead by Professors Krein and Gohberg, the leaders of the extraordinarily original and fertile school of operator theory. In spite of my analytic upbringing, I could not resist\nMischa\n's daring approaches to operator theory.\nAfter a gap in her publication record for the reasons we have explained, Sadosky began publishing again with three papers written jointly with\nMischa Cotlar\n, namely\nA moment theory approach to the Riesz theorem on the conjugate function with general measures\n(1975)\nand\nTransformée de Hilbert, théorème de Bochner et le problème des moments\nⓉ\n(\nHilbert Transform, Bochner's Theorem and the Problem of Moments\n)\n(1977)\n. Also while in Caracas, she worked on her book\nInterpolation of Operators and Singular Integrals: An Introduction to Harmonic Analysis\nwhich was published in\n1979\n. Umberto Neri writes\n[\n9\n]\n:-\nThis clear and skilful introduction to harmonic analysis on Euclidean spaces is suitable for graduate students at the second-year level, and it offers to the careful reader a prized reward: the mastery of many basic ideas and methods of real and harmonic analysis. This goal is achieved through an elegant presentation of the interpolation theory of operators in\nL\np\nL^{p}\nL\np\nspaces, the maximal theory and the space BMO, and the\nCalderón\n-\nZygmund\ntheory of singular integrals. Even the introductory material is treated with originality.\nSadosky spent the academic year\n1978\n-\n79\nas a member-in-residence at the Institute for Advanced Study at Princeton. She was appointed as associate professor of mathematics at Howard University, Washington, D.C., in\n1980\n. The award of a visiting professorship for women in science from the National Science Foundation allowed her to spend another year, namely\n1983\n-\n84\n, at the Institute for Advanced Study at Princeton. In\n1985\nshe was promoted to full professor at Howard University. Another award from the National Science Foundation, this time a Career Advancement Award, allowed her to spend\n1987\n-\n88\nat the Classical Analysis Program at the Mathematical Sciences Research Institute in Berkeley, California. A second award of a visiting professorship for women in science from the National Science Foundation allowed her to spend\n1995\nat the University of California at Berkeley. Other research visits she made during her time at Howard University were to the University of Buenos Aires\n(1984\n-\n85)\nand to the Institut d'Hautes Études Scientifiques in France.\nThroughout her career, Sadosky played an important role in promoting the role of women in mathematics. She served as President of the\nAssociation for Women in Mathematics\nin\n1993\n-\n95\n. In\n[\n13\n]\nthe authors describe some of the initiatives from her time as President:-\nCora Sadosky, President\n1993\n-\n95\n, organized the move of the Association for Women in Mathematics headquarters to the University of Maryland and the concurrent staff changes. She increased the\nAssociation for Women in Mathematics\n' international connections and involvement in science policy, in particular initiating\n(\nin coordination with other organizations\n)\nthe first\nEmmy Noether\nLecture at an International Congress of Mathematicians in Zürich in\n1994\nand representing the\nAssociation for Women in Mathematics\nat the International Congress of Mathematics Education in\n1993\n.\nSadosky was a fellow of the American Association for the Advancement of Science\n(\nelected\n1997)\nand was twice elected to the Council of the\nAmerican Mathematical Society\n(1987\n-\n88\n,\n1995\n-\n98)\n. She also served as a member of the\nAmerican Mathematical Society\nCommittee on Cooperation with Latin American Mathematicians\n(1990\n-\n1992)\n, the\nAmerican Mathematical Society\nCommittee on Human Rights of Mathematicians\n(1990\n-\n1996)\n, the\nAmerican Mathematical Society\nCommittee on Science Policy\n(1996\n-\n1998)\nand a member of the Human Rights Advisory Committee of the Mathematical Sciences Research Institute, Berkeley\n(2002\n-\n2005)\n.\nAfter she retired from Howard University, Sadosky and her husband went to live in California to be close to their daughter Cora Sol, son-in-law Tom, and granddaughter Sasha. Her last residence was\n90803\nLong Beach, Los Angeles, California.\nThe\nAssociation for Women in Mathematics\nestablished the\nSadosky Prize\nin Analysis in\n2012\n. The first presentation was made in\n2014\n, and is made in even years to a woman early in her career who has published exceptional research in analysis. The website of the\nAssociation for Women in Mathematics\nstates\n[\n1\n]\n:-\nThe\nAssociation for Women in Mathematics\nSadosky Research Prize in Analysis serves to highlight to the community outstanding contributions by women in the field and to advance the careers of the prize recipients. The award is named for Cora Sadosky, a former president of\nAssociation for Women in Mathematics\nand made possible by generous contributions from Cora's husband Daniel J Goldstein, daughter Cora Sol Goldstein, friends Judy and Paul S Green and Concepción Ballester.\nA list of winners of the Sadosky prize is at\nTHIS LINK\n.\nLet us end this biography with a quotation from the President's Report Sadosky wrote following her year as President of the\nAssociation for Women in Mathematics\n[\n10\n]\n:-\nStrange as it may seem at the end of this long report, I started out with the impression I had little to say. That impression stemmed from my doing something it may be unwise for a current\nAssociation for Women in Mathematics\npresident to do: I plunged into mathematics head on for three full weeks. I came out of that stint dazed, vaguely guilty and deeply happy. It is very clear that I enjoy like crazy doing mathematics!  But what remains with me is the sense of elation. I did not prove the\nRiemann\nConjecture. My work was modest, but it gave me so much pleasure to do it! Thus I close this conversation with a wish to each of you for this summer: do some of the mathematics you want to do and do it with great pleasure!"
}