{
  "nome_completo": "Corrado Segre",
  "nome_curto": "Corrado Segre",
  "ano_nascimento": "1863",
  "ano_morte": "1924",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Segre_Corrado/",
  "lugar_nascimento": "Saluzzo, Italy",
  "lugar_morte": "Turin, Italy",
  "biografia": "Corrado Segre\nparents were Abramo Segre and Estella De Benedetti. He had a brother, Arturo  Segre. The young Corrado\ncompleted his secondary education at the Sommeiller Technical Institute in Turin where he had\nGiuseppe Bruno\nas a mathematics teacher. At this time\nGiuseppe Bruno\nwas also teaching descriptive geometry at the University of Turin and he gave the young Segre a great love of geometry. Segre, only\n16\nyears old, was awarded his diploma and received a prize of\n300\nlire from the Chamber of Commerce for being ranked first in his class at the Technical Institute. Although Abramo Segre, Corrado's father, wanted him to train to be an engineer, his experiences of learning mathematics from\nGiuseppe Bruno\nmade him very keen to study mathematics at university.\nHe entered the University of Turin in\n1879\nand there studied for his laurea in mathematics. He has some outstanding teachers,\nEnrico D'Ovidio\ntaught him geometry while\nAngelo Genocchi\nand\nFrancesco Faà di Bruno\ntaught him analysis.\nFaà di Bruno\nwas particularly important as a teacher for he had studied in Paris under\nCauchy\nand so brought a wider European breadth to his teaching.\nGino Loria\n, who was to write famous texts on the history of mathematics, was a fellow student of Segre's and they remained friends throughout their lives. In\n1881\n-\n82\nD'Ovidio\nproposed as the topic of his course on higher geometry, the geometry of ruled spaces and Segre, just eighteen, was inspired to make a personal elaboration of\nBattaglini\n's theory of line complexes, adding new properties which he presented in a lecture at the school of Education\n[\n1\n]\n:-\nD'Ovidio\nstarted from the ideas of\nPlücker\n, which had been taken up and developed by\nFelix Klein\n. According to these ideas, the geometry of ruled space is equivalent to the study of a quadratic variety of four dimensions imbedded in a linear space of five dimensions. In his lectures\nD'Ovidio\nexamined the works of\nVeronese\non the projective geometry of hyperspaces and those of\nWeierstrass\non bilinear and quadratic forms.\nIn his fourth and final year of study\n(1882\n-\n83)\n, in addition to the compulsory courses on Higher Mechanics, Astronomy and Mathematical Physics, Segre again followed the course of higher geometry given by\nD'Ovidio\nand the analysis course by\nFaà di Bruno\n. Segre fully understood the importance of mastering both the geometrical methods as well as those of analysis. However this fourth and final year proved to be a very difficult one for him as his brother Arturo related\n(\nsee\n[\n2\n]\nand also\n[\n21\n]\n)\n:-\nThe fourth year of university\n(1882\n-\n83)\nwas especially difficult for him, a year that was exceedingly painful, during which my family went through economic collapse and the sad end of my poor father's life. He composed his thesis in that terrible predicament, and took his degree in July\n1883\nwith honours.\nThe degree was awarded for his thesis\nStudio sulle quadriche in uno spazio lineare ad n dimensioni ed applicazioni alla geometria della retta e specialmente delle sue serie quadratiche\nⓉ\n(\nStudy on quadrics in a linear space of n dimensions and applications to the geometry of the line, and especially of its quadratic series\n)\nwhich he wrote while being advised by\nD'Ovidio\n. It was in two parts, one on\nquadrics\nin higher dimensional spaces with the other part on the geometry of the right line and of its quadratic series. The thesis received high praise and he published it as two papers in Volume\n36\nof the Memoirs of the\nTurin Academy of Sciences\n.\nGuido Castelnuovo\nwrites in\n[\n8\n]\n, forty years after Segre wrote his thesis:-\nStill today those who read ... the two closely connected works remain surprised by the confidence and breadth of vision and mathematical means with which this young man, Corrado Segre, deals with this broad topic. The dissertation appears to be the work, not of a beginner, but of an experienced and skilled mathematician.\nEven before he had completed his thesis, Segre had sent the paper\nSur les différentes espèces de complexes du\n2\ndegré des droites qui coupent hamoniquement deux surfaces du second ordre\nⓉ\n(\nOn the various complex kinds of degree\n2\nof lines that intersect hamonically two surfaces of the second order\n)\nto\nFelix Klein\nfor publication in\nMathematische Annalen\n. It was one of fifteen papers he published in the two years\n1883\nand\n1884\n. The paper appeared in\n1883\nand it started a correspondence between Segre and\nKlein\nwhich they actively pursued for many years. In fact in\n1921\n, when both he and\nKlein\nwere nearing the ends of their lives, he wrote, \"\n[\nKlein\n]\nwas my teacher, although we were at this distance!\" For the academic year\n1883\n-\n84\n, Segre was appointed as an assistant to\nD'Ovidio\n, the professor of algebra and analytic geometry at Turin. However, he was drafted to undertake military duties in November\n1883\nwhich did not please him. However, although occupied with his duties during the day, in the evenings he was still able to undertake research and read the latest papers published in the areas that interested him. He also continued to correspond with\nKlein\ntelling him how impatient he was for the day when his military duties would end. The following academic year he was able to return to his duties as\nD'Ovidio\n's assistant and gain a teaching qualification in higher geometry.\nD'Ovidio\nwas very pleased with his young assistant writing\n(\nsee\n[\n22\n]\n)\n:-\n... he has a keen intellect, is industrious, painstaking, and able to successfully treat the most difficult geometrical problems and solve them with clarity and elegance. As a teacher he has already proved his worth during the year as my assistant, being successful, clear, accurate and effective.\nAnother young mathematician at Turin, five years older than Segre, was\nGiuseppe Peano\n. He had been\nD'Ovidio\n's assistant and then became an assistant to\nAngelo Genocchi\n. The authors of\n[\n4\n]\nmake an interesting comment about\nPeano\nand Segre at this time:-\n... in the mid\n1880\n's, these two very young researchers, Segre and\nPeano\n, both of them only just past twenty and both working at the University of Turin, were developing very advanced points of view on fundamental geometrical issues. Although their positions were quite different from one another, they were in some way more complementary than opposed. So it must come as no surprise that Turin was the cradle of some of the most interesting studies on such issues.\nIn\n1885\nSegre was appointed as assistant to\nGiuseppe Bruno\nwho held the chair of projective and descriptive geometry. During the two years\n1886\n-\n88\nhe gave a course on the theory of plane algebraic curves. In\n1887\nhe wrote to\nKlein\n(\nsee\n[\n28\n]\n)\n:-\nWhat you tell me about the effect on you made by the synthetic reasoning about the geometry of\nn\nn\nn\ndimensions does not surprise me; it is only by living in\nS\nn\nS^{n}\nS\nn\n, by thinking about it always, that you become familiar with these arguments.\nBy now his reputation was very high and he was offered a chair at the University of Naples. However, he preferred to remain in Turin and the university there was keen to keep him. As a consequence, the university asked the Minister of Education to split\nGiuseppe Bruno\n's chair of projective and descriptive geometry into two chairs. The request was refused so a new chair of higher geometry was created. Appointments to chairs were by competition and, in\n1888\n, Segre entered the competition for the new chair of higher geometry in Turin. He was appointed and continued to hold this professorship for the next\n36\nyears until his death. However, he didn't just teach university courses for he also taught at the teacher training college, the Scuola di Magistero, which was attached to the university. In fact, in\n1916\nhe became the director of the teacher training college.\nThe interaction between Segre and\nKlein\nsaw Segre become enthusiastic for\nKlein\n's 'Erlangen Programme'. Thomas Hawkins writes about this in\n[\n3\n]\n:-\nShortly after\n[\nSegre\n]\nassumed the chair of projective geometry in Turin in\n1888\n, he decided it would be worthwhile to have an Italian translation of the 'Erlangen Programme' because he felt its contents were not well enough known among young Italian geometers. ... Segre convinced one of the students at Turin,\nGino Fano\n, to make a translation which was published in 'Annali di Mathematische' in\n1890\n.\nFano\n's translation thus became the first of many translations of the 'Erlangen Programme'.\nIn\n1891\nSegre went on an extended tour of Germany visiting the mathematical centres of Göttingen, Frankfurt, Nuremberg, Leipzig and Munich. He met many of the leading mathematicians, including\nLeopold Kronecker\n,\nKarl Weierstrass\n,\nMax Noether\n,\nTheodor Reye\n,\nRudolf Sturm\nand\nMoritz Cantor\n. In Göttingen he met\nFelix Klein\nin person for the first time, although as we noted above they had corresponded since\n1883\n. Segre wrote from Göttingen to\nGuido Castelnuovo\nin June\n1891\n:-\nNo one who has never been here can imagine what kind of man\nKlein\nis, and what kind of organisation he was able, with a skill that no one else could have, to impose on the mathematical studies in this university: it is something that has made an extraordinary impression on me. And I have already been most vividly impressed by the scientists that I have met on this journey!\nAlso in\n1891\n, Segre wrote the article\nSu alcuni indirizzi nelle investigazioni geometriche\nⓉ\n(\nOn some directions in geometric investigations\n)\nwhich was translated into English and published by the\nAmerican Mathematical Society\nas\nOn some tendencies in geometrical investigations\n. It is an article advising young students how to go about research in geometry. It is a fascinating article, both for the advice it gives young people and also for the insight it gives us into Segre's thinking about geometrical research.\nCoolidge\nwrites:-\nThe point which Segre enforces most strongly is that at all costs the beginner must learn to choose really significant subjects. To acquire the instinct to do this, he should study the mathematical classics. He must especially avoid trivial questions and perfectly obvious extensions or generalizations. The young geometer should also be familiar with the leading methods and results of modern analysis, and welcome help from every quarter, regardless of whether his own preference is for synthetic, algebraic, arithmetical or transcendental methods. With regard to rigour, Segre recommends the geometer to be as rigorous as he can, and to own up like a man when he makes use of methods of doubtful parentage.\nIn\n1893\nSegre married Olga Michelli; they had two daughters, Elena and Adriana.\nLater in his career, Segre took on administrative positions in the university. For example he was director of the Biblioteca speciale di Matematica from\n1907\nuntil his death. Also he was dean of the Faculty of Science for two spells, the first being\n1909\n-\n10\nand the second\n1915\n-\n16\n.\nThe papers that Segre published in the\n1880\ns are studied in detail in\n[\n18\n]\nwhere the authors see this work as beginning a path that eventually led to the theory of vector bundles on an algebraic curve. They write:-\nTo appreciate the innovative character of the ideas put forward by the very young Segre, it is convenient to recall that in those years it was harshly debated upon the usefulness of studying hyperspace geometry. Some authors maintained that addressing the geometry of the hyperspace was an unfruitful intellectual game not certainly helpful to understand the \"real\" geometry in two or three dimensions. On the other side,\nVeronese\nand\nBertini\nat first, and then Corrado Segre were perfectly aware that not only the geometry of hyperspaces would shed new light on the geometry of curves and surfaces of ordinary space, but also that these latter could be viewed - and this is certainly innovative - as points\n(\ndefined by a number of parameters\n)\nbelonging to new algebraic varieties that could not be placed in ordinary space.\nSegre worked on geometric properties invariant under linear transformations, algebraic curves and ruled surfaces studying transformations already considered by\nAlexander von Brill\n,\nAlfred Clebsch\n,\nPaul Gordan\nand\nMax Noether\n. In\n[\n1\n]\nPierre Speziali says that through this work of Segre's:-\n... it thus became possible to reduce the classification of surfaces to that of curves. The insufficiencies of the earlier theories proposed by\nA Möbius\n,\nGrassmann\n,\nCayley\nand\nCremona\nwere thus soon revealed.\nUsing the methods which he had introduced, Segre was able to study\nKummer\n's surface in a much simpler way. This surface, which had been discovered by\nKummer\nin\n1864\n, is a fourth order surface with sixteen double points. In a paper published in\n1896\n, Segre found an invariant of surfaces under birational transformations which had appeared in a different form in a\n1871\narticle by\nZeuthen\n: this invariant is now called the\nZeuthen\n-Segre invariant. In\n1890\nSegre looked at properties of the\nRiemann\nsphere and was led to a new area of representing complex points in geometry. He introduced bicomplex points into geometry. Motivated by the works of\nvon Staudt\n, Segre considered a different type of complex geometry in\n1912\n. Among other important work which Segre produced was an extension of ideas of\nDarboux\non surfaces defined by certain differential equations.\nSegre was one of only four invited plenary speakers at the International Congress of Mathematicians held in Heidelberg in August\n1904\n. He gave the address\nLa geometria d'oggidi e i suoi legami coll'analisi\nⓉ\n(\nThe geometry of the present day and its connections with analysis\n)\n. In his talk he claimed that\n[\n10\n]\n:-\n... geometry and analysis deal with what is essentially the same subject matter, but with different emphasis, terminology and aesthetic aim ... He lays special stress on various branches of\nalgebraic geometry\n, particularly those properties of figures which are unaltered by birational transformation.\nFor the remarkable number of papers published by Segre, see\nTHIS LINK\n.\nThe reader might be surprised to learn that he had problems which limited the amount of work he could do later in his career.\nJulian Coolidge\nwrites\n[\n10\n]\n:-\nAt some period during the early part of his career, he had a severe attack of brain fever brought on by overwork. He complained sadly that his capacity for labour was never the same thereafter. When one reflects that the number of his published titles is\n128\n, it fatigues the imagination to speculate as to what he might have accomplished had he retained his early strength.\nIn\n[\n1\n]\nhis clarity of writing is mentioned and illustrated with these comments:-\nSegre wrote a long article on hyperspaces for the 'Encyklopädie der mathematischen Wissenschaften', containing all that was then known about such spaces. A model article, it is notable for its clarity and elegance.\nThis clarity is also emphasised by\nHenry Baker\n[\n5\n]\n:-\nAs a man, one thinks of him as always mainly led by his devotion to his subject; as a writer, as concerned above all things to conduct his reader to an eminence from which may be seen spread out, each in fitting place, all the details of a theory hitherto believed to be incapable of oversight. This is achieved, repeatedly, by the use of higher space, and his power of communicating his own intense sense of the reality of this.\nNext we quote the summary of Segre's importance as described in the\n[\n1\n]\narticle:-\nThrough his teaching and publications, Segre played an important role in reviving an interest in geometry in Italy. His reputation and the new ideas he presented in his courses attracted many Italian and foreign students to Turin. Segre's contribution to the knowledge of space assures him a place after\nCremona\nin the ranks of the most illustrious members of the new Italian school of geometry.\nSegre received many honours and we mention some of them. In\n1889\nhe was elected to the Academy of Sciences in Turin, in\n1898\nhe shared the\nAccademia dei Lincei\n's Royal Prize with\nVito Volterra\n, and in\n1901\nhe was elected to the\nAccademia dei Lincei\n. His achievements have been recognised recently with the conference 'Homage to Corrado Segre\n(1863\n-\n1924)\n' which was held in Turin in November\n2013\nto celebrate his\n150\nth\nbirthday. The conference announcement stated:-\nCorrado Segre is widely recognized as one of the founders of the Italian School of Algebraic Geometry, where he counted\nG Castelnuovo\nas an assistant,\nF Enriques\nas a postdoc,\nF Severi\nas a student,\nG Fano\nand\nA Terracini\nas students and colleagues. Moreover Corrado Segre is regarded as a crucial figure in the scientific evolution and in the history of Algebraic Geometry.\nFinally, we give several accounts of Segre as a teacher.\nGino Fano\nwrites in\n[\n12\n]\n:-\nHe considered it a true mission to direct his students towards the upper levels of mathematics, and especially of geometry, encouraging them whenever possible to produce original work ... He lavished infinite care and treasures of knowledge on his\n36\ncourses of advanced geometry, the subjects of which he himself expounded in writing, in his clear, distinct hand, in little books which his old and recent students were very familiar with, always very precisely worded and with numerous bibliographical quotations, with complements which gradually occurred to him, often with original ideas and opinions, with indications of topics for further research, from which he drew the subjects he suggested for degree dissertations.\nFrancesco Severi\nwrites in\n[\n32\n]\n:-\nHe was one of the most careful in the preparation of his Lectures, that I have ever known. In fact they were written in advance word for word and in definitive form in little booklets, which he took with him to his lectures, so that he could give bibliographical indications from them, always exact and exhaustive.\nBeniamino Segre\nwrites in\n[\n30\n]\nthat Segre's lectures were:-\n... of a highly skilful, elegant, stimulating interweaving of synthetic considerations and algebraic developments, the latter being kept to a minimum and carried out in such a way that they make entirely clear the geometric content of the results, at times even of the individual stages, and supply appropriate checks on the most delicate points.\nHere is\nJulian Coolidge\n's account of Segre as teacher and friend\n[\n10\n]\n:-\nBehind Segre the geometer and the expositor, there remained always Segre the teacher and friend. An interesting figure he was in the lecture room. Of medium height and frail, half seated on the end of the table, gesticulating rapidly with his left hand, while his right whirled his watch chain about with astonishing angular velocity, his whole being was thrown into the task of driving home the essentials of what he had in mind. The subject matter of his course was new every year. There was no limit to the amount of care and patience which he would bestow on one of his pupils. ... He had a sympathetic, sensitive nature, a spiritual quality, which impressed all who had the privilege of his friendship."
}