{
  "nome_completo": "Cristoforo Vincenzo Francesco Alasia",
  "nome_curto": "Cristoforo Alasia",
  "ano_nascimento": "1864",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alasia/",
  "lugar_nascimento": "Sassari, Sardinia, Italy",
  "lugar_morte": "Albenga, Savona, Italy",
  "biografia": "Cristoforo Alasia\n's father was the noble Lieutenant Francesco Alasia-Aluffi from Felizzano in Piemonte, the son of Vincenzo Alasia and Celestina Aluffi. Francesco married Giovanna Francesca de Quesada\n(1842\n-\n1922)\nfrom Sassari-Sardegna, daughter of Cristoforo and Speranza Cugia Paliacio on\n28\nJanuary\n1864\n. Vincenzo and Giovanna had three sons, Cristoforo\n(\nthe subject of this biography\n)\n, Tommaso, who became a magistrate, and Enrico, born\n1866\n, who became a doctor.\nLet us note that there are problems with Cristoforo Alasia's year of birth. Almost all biographies give\n1869\nas the year of his birth, but his baptismal certificate gives\n1864\n. The date\n1864\nis also more consistent with his undergraduate university career. The source of the\n1869\ndate appears to be\nGeorge Halsted\n[\n3\n]\n.\nHalsted\nwrote his article during Alasia's lifetime and indeed had corresponded with Alasia before writing the article. If, as we believe, the\n1864\ndate is correct, we suggest the error occurred by\nHalsted\nmisreading Alasia's handwriting. However, we have not been able to make a definite decision about which date is in error.\nCristoforo Alasia studied at the universities of Cagliari, Turin and Rome. The name \"Alasia Cristoforo\", appears in the yearbook of the University of Turin as matriculated in the first year of the course for the Diploma in Mathematical, Physical and Natural Sciences in the academic year\n1883\n-\n1884\n. In Turin he was a pupil of\nEnrico D'Ovidio\nand\nGiuseppe Peano\n, while at the Polytechnic School of Engineering in Rome he studied with\nLuigi Cremona\nand Valentino Cerruti\n(1850\n-\n1909)\n. There he took Cerruti's famous course on rational mechanics. In\n1891\nhe published the\n160\n-page work\nElementi della teoria generale delle equazioni ed in particolare delle equazioni di terzo e quarto grado e delle equazioni indeterminate\nⓉ\n(\nElements of the general theory of equations and in particular the third and fourth degree equations and indeterminate equations\n)\n.\nDue to his father's sudden death he had to return to Sardinia and dedicate himself to teaching. In\n1893\nhe was appointed as a teacher of mathematics and natural sciences at the Gymnasium in his home town of Sassari, having won this position in a competition. Later, he taught at the Royal High School of Tempio Pausania, at the Royal High Schools of Oristano and of Ozieri in Sardinia, at Brindisi in Puglia, and finally at the Royal High School of Albegna, Liguria. He married Maria Vittoria Guglielmo of Tempio Pausania; they had two daughters, Caterina\n(\nknown as Tina\n)\nand Giannetta.\nThroughout his life he remained in contact with the mathematical community of the time, in particular with his teachers and with\nHenri Poincaré\n. Despite being a school teacher, he was the author of around\n150\npublications that presented his research on a variety of subjects such as astronomy, geometry, rational mechanics, history of mathematics etc. that gave him a high reputation both nationally and internationally. Perhaps his most famous work was his paper on the geometry of the triangle\nLa recente geometria del triangolo\nⓉ\n(\nRecent triangle geometry\n)\n(1900)\n. You can see a list of around\n80\nof Alasia'a publications at\nTHIS LINK\n.\nHis surname is linked to the theory of Alasia and, in particular, with being the founder and the first editor of the magazine\nLe Matematiche Pure ed Applicate, Periodico mensile di matematiche pure ed applicate, superiori ed elementari, ad uso dell'istruzione media e superiore\nⓉ\n(\nPure and Applied Mathematics, Monthly Periodical of Elementary and Advanced Pure and Applied Mathematics, for the use of intermediate and advanced education\n)\n, to which important mathematicians such as\nCharles Hermite\ncontributed. This journal was first published in February\n1901\nwith Scipione Lapi as its editor. Lapi was an excellent choice since he had a high reputation for his abilities. The  journal was typeset in Città di Castello in Umbria. Alasia was pleased with the initial response to his journal and he wrote to\nErnesto Cesàro\non\n22\nNovember\n1900\n:-\n... We are interested that a short list of collaborators, whose names are ones of the most distinguished scientists, give a clear sign of the scientific value of the periodical. Some have already joined and volunteered communications ...\nHe gives a list of twenty-four names which includes\nPaul Appell\n,\nHenri Brocard\n,\nCesare Burali-Forti\n,\nErnesto Cesàro\n,\nGeorge Halsted\n,\nÉmile Lemoine\n,\nGiuseppe Peano\n,\nMario Pieri\n, and\nHenri Poincaré\n.\nThe first volume not only contains a paper by\nCharles Hermite\n, but also an obituary of\nHermite\nsince he died in\n1901\n. This obituary was translated into English by\nGeorge Halsted\nand published in the\nAmerican Mathematical Monthly\n. As well as papers, the journal contained reports of work published in other journals, reviews of books, some reviews by Alasia himself, and problems with solutions to them given in a later part.\nGeorge Bruce Halsted\npublished the article \"Cristoforo Alasia\" in the\nAmerican Mathematical Monthly\nin\n1902\n(\nsee\n[\n3\n]\n)\n.\nHalsted\nwrites:-\nWhen a new star comes out in the skies, thither turns the observing eye. \"Le Matematiche\" is a new luminary among scientific periodicals, though sailing safely now far into its second year. Its director, its creator, Professor Alasia, has won the confidence and is attracting the attention of the mathematical world. ... The monthly journal of pure and applied mathematics founded by Professor Alasia, \"Le Matematiche,\" has had an extraordinary success. The last thing ever written by the great\nHermite\nwas for it. Professor Alasia has been able to win the support and friendship of many of the most illustrious of living mathematicians, for example,\nPoincaré\n.\nAlasia returned the compliment with an appreciation of\nHalsted\non the occasion of his appointment as President of the Mathematics and Astronomy Section of the American Society for the Advancement of Science. Alasia's\n5\n-page article \"George Bruce Halsted\" came with a portrait and appeared in the second volume of\nLe Matematiche Pure ed Applicate\nⓉ\n(\nPure and Applied Mathematics\n)\n.\nInitially parts of the journal were published rapidly. The first part of the first volume appeared in February\n1901\n, the second part in March and the third in April. However, in the first part of the\n1903\nvolume which was published in January of that year, Alasia announced a temporary halt to publications because of excessive commitments of the typesetter who was working on publishing the proceedings of the Third International Congress of Historical Sciences, which took place in Rome in the first week of April\n1903\n. In fact the publisher died in September\n1903\nand publication of\nLe Matematiche Pure ed Applicate\nⓉ\n(\nPure and Applied Mathematics\n)\nnever resumed.\nHalsted\nwrites in\n[\n3\n]\nin the year\n1902\n:-\nHis love of science did not however prevent him from also occupying himself with the fine arts; he has won two prizes at expositions of dilettanti in painting. Professor Alasia is a gifted linguist. He has an elegant Italian style, writes the purest French, and at present is engaged with Professor Dionisio Gambioli in translating into Italian\nCajori\n's 'History of Physics'. They will enlarge the work by two additional chapters and copious notes. It is expected to appear at the end of this year. In his Essay on the nomenclature\n(\nbibliographic\n)\nof the New Geometry of the triangle, our author proposes to give the most complete possible list of the terms which have entered the domain of geometry in these latter years, to give their veritable signification, to investigate what geometer has first used them, upon what occasion, etc. In addition, when it is a question of a point or a straight, he has given its representation according to the method of\nGrassmann\n; and for circles and conics he has given the equation in barycentric or normal coordinates. His is a charming figure in the new renaissance of creative productivity in Italy. His fine judgment and powers of assimilation are illustrated in his 'Poligeometrognomia generale e la Geometria Non-Euclidea del Chrystal', a translation of\nChrystal\n's 'Non-Euclidean Geometry', preceded by a general resume, historic and bibliographic, in exposition of the foundations of geometry, remarkable in erudition and breadth of insight.\nIn\n1911\nhe received a gold medal from the\nRoyal Irish Academy\nof Dublin for a work in astronomy. The medal was awarded for a memoir by Alasia on the determination of the parabolic orbit of a comet published in\nL'amateur\n(\nMilan,\n1906)\n,\n259\n-\n264\n.\nIn his article\n[\n3\n]\nHalsted\nexhibits Alasia's \"splendid fertility\" by giving a list of his other writings additional to those mentioned in his article. We have removed from this list those works that appear in our own list at\nTHIS LINK\n.\nHere is\nHalsted\n's list with items from our list removed:-\nElementi della Teoria delle equagioni, ecc. - Napoli,\n1893\n, B. Pellermo, ed.\nSulla deviazione dei gravi, - lettera alla Societa Astronomica d'Francia.\nSu di alcune proprietà dei numeri e delle congruenze, ecc. Civitanova - Marche,\n1898\n. C'est le vol. VI, sect. Science, de la Collection d'Audes italiane qui a été publiée par l'éditeur D. Natalucei.\nSu di alcune proprietà delle linee geodetiche, - Sassari,\n1898\n.\n566\nRelazioni metriche e trigonometriche fra gli elementi d'un triangolo piano, -ibid.\n1900\n.\nSu di alcuni teoremi di Le Paige e Deruits, Madrid,\n1899\n.\nProducto de una serie cualqueira por la exponencial\ne\n−\nx\ne^{-x}\ne\n−\nx\n.\n(\nEstrait du Progreso Matemático de Zaragoza, ser.\n2\n'. An. II, no.\n10\n,\n1900)\n.\nUne méthode élémentaire de recherche del maxima et minima.\n(\nExtr. de la Gazeta Matematica. An. VII, no.\n9\n, Mai\n1902\n, Buçuresti, -\n(\nRumania\n)\n.\nAlcune asservazioni sui pendoli e sui cronometri\n(\nExtr. de la Rassegua Tecnica Italiana, An. II, ni.\n4\ne\n5\n, Messina,\n1902)\n.\nElementi di Trigonometria Piana e Sferica, traduction, avec notej et adjointes du Traité de M. l'Abbe H. Gelin, de Huy.\nTrattáto d Aritmetica, en collaboration de M. Gelin, à Huy.\nAlcune formule della Teoria delle Superficie\n(\nExtr. de la Revista simestral de Matemática, An. II, no.\n6\n, Zaragoza,\n1902)\n."
}