{
  "nome_completo": "Curtis Tracy McMullen",
  "nome_curto": "Curtis McMullen",
  "ano_nascimento": "1958",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McMullen/",
  "lugar_nascimento": "Berkeley, California, USA",
  "lugar_morte": null,
  "biografia": "Curtis McMullen\n(\nknown as Curt\n)\nmoved around the United States a bit as he was growing up, but he basically grew up in Charlotte, Vermont. He first attended Windermere Elementary School in Upper Arlington, near Columbus, Ohio, then Charlotte Central School in Charlotte, Vermont, before studying at Champlain Valley Union High School in Hinesburg, Vermont, only about\n12\nkm from Charlotte. He entered Williams College, Williamstown, Western Massachusetts, in\n1976\n. He said that during his undergraduate years at Williams College\n[\n6\n]\n:-\n... I went to Stanford for a year and took a great real analysis course from Benjamin Weiss who was a visiting professor from Jerusalem. And that really got me excited about analysis. Then I went back to Williams and I worked closely with Bill Oliver. He was very influential in my mathematical education; it was from him that I first learned this idea of using dictionaries in mathematics to use as a sort of analogy between different fields or different theoretical developments to try to guide my work.\nHe graduated from Williams College with a B.A. in\n1980\nas a Valedictorian, Summa Cum Laude, with Highest Honours in Mathematics and an additional concentration in Physics. He was awarded a Herchel Smith fellowship to study at the University of Cambridge in England and he spent the academic year\n1980\n-\n81\nat Emmanuel College, Cambridge. He was placed first in Part II of the Mathematical Tripos. He then returned to the United States to begin research in\n1981\nat Harvard University. He explains in\n[\n6\n]\nhow he managed to obtain a Ph.D. from Harvard with\nDennis Sullivan\nas his thesis advisor, although\nSullivan\ndid not work at Harvard:-\nI had been doing some computer work with\nDavid Mumford\non Kleinian groups before I graduated, and I got interested in that subject. But I actually ended up writing my thesis with\nDennis Sullivan\n, who at that time was a professor at City University in New York and the Institut des Hautes Études Scientiques at France. So I was very lucky that\nDavid Mumford\nintroduced me to him in the last year of my graduate career, at which point I had no advisor and no thesis topic. And I went to France and worked with\nSullivan\nat Institut des Hautes Études Scientiques for a semester, and I met\nSteve Smale\nthere who gave me this nice thesis problem on solving polynomial equations by iteration.\nDuring each of the summers from\n1980\nto\n1985\nMcMullen undertook combinatorial research and computer programming at the IBM Watson Research Center, Yorktown Heights, New York. His work there involved VLSI design problems: graph theory, logic synthesis, boolean minimization, and sparse matrix processing. At Yorktown Heights\n[\n6\n]\n:-\n...\nMandelbrot\nand\nMumford\nwere almost collaborating;\nMandelbrot\nwas furnishing access to computers at Yorktown Heights to\nMumford\n, who was drawing these beautiful pictures of limit sets of Kleinian groups. As somebody who was conversant with the computer world at Yorktown, I started working for him as his computer programmer, helping him draw these pictures and so forth.\nAs he mentions in the above quote, McMullen spent the autumn of\n1984\nas a visitor at the Institut des Hautes Études Scientiques, Bures-sur-Yvette near Paris. His first paper\nThe Hausdorff dimension of general Sierpinski carpets\nwas published in\n1984\nbefore he submitted his thesis. In the academic year\n1984\n-\n85\nhe held an Alfred P Sloan Doctoral Dissertation Fellowship. He submitted his thesis\nFamilies of Rational Maps and Iterative Root-Finding Algorithms\nto Harvard University and was awarded his doctorate in June\n1985\n.\nThe problems which McMullen considered in his thesis had long been important. Once a proper understanding  was achieved of which polynomial equations could be solved by radicals, there remained the problem of finding the roots of a polynomial equation by an iterative procedure for those for which no formula existed.\nNewton\nhad produced such a method and his iterative procedure generally converged for all quadratic polynomials and initial points, but this was not the case for polynomial equations of degree three.\nStephen Smale\nhad asked whether, for each\nn\nn\nn\n, there existed an iterative procedure which generally converged for all initial points. In his thesis McMullen produced such a procedure for polynomials of degree three, but showed that for degree greater than three no such iterative procedure existed.\nAfter completing his doctorate, McMullen spent the academic year\n1985\n-\n86\nat the Massachusetts Institute of Technology having been appointed a C L E Moore Instructor in Mathematics. He submitted further papers for publication and\nArea and\nHausdorff\ndimension of\nJulia\nsets of entire functions\nwas published in\n1987\n. A paper with the same title as his thesis also appeared in\n1987\n. He spent the year\n1986\n-\n87\nas a member of the Institute for Advanced Study at Princeton, then in\n1987\nhe was appointed as an Assistant Professor at Princeton University and awarded a NSF Postdoctoral Fellowship. This fellowship ran until\n1990\nbut he also held an Alfred P Sloan Fellowship in\n1988\nand was a Presidental Young Investigator from\n1988\nto\n1993\n. In\n1990\nhe was promoted to full professor at Princeton but, in the same year, accepted a full professorship at the University of California, Berkeley.\nThe\nSalem\nPrize, founded by the widow of\nRaphael Salem\n, is awarded every year to a young mathematician judged to have done outstanding work in\nSalem\n's field of interest, namely analysis. McMullen explains that\n[\n6\n]\n:-\n... in\n1991\n, I won the\nSalem\nPrize, which is a prize in Analysis; I was pleased to be recognized that way because I really love the field - it was my first, as a mathematician. In fact, I had written my minor thesis as a graduate student on Salem numbers, and this prize is in honour of\nRaphael Salem\n, so it has personal meaning for me. I had never expected to get any recognition of that kind ...\nIn\n1994\nhe was named Miller Professor at Berkeley and held a Chancellor's Professorship at Berkeley during\n1996\n-\n1998\n. He left Berkeley in\n1998\nwhen appointed to a professorship at Harvard University. In\n2001\nhe was named Maria Moors Cabot Professor at Harvard, a position he continues to hold. In each of the summers from\n2001\nto\n2007\nhe held a visiting position at the\nMax-Planck\n-Institute für Mathematik in Bonn.\nLet us mention two monographs written by McMullen.\nComplex dynamics and renormalization\n(1994)\nwas reviewed by Gregery T Buzzard who begins his review as follows:-\nThis book provides a very clear and readable presentation of many of the main ideas and techniques used in the study of complex dynamics in one variable.\nAfter giving details of the contents of each chapter, he ends his review:-\nThis book presents a great many ideas very clearly and should prove to be a valuable addition to the complex dynamics literature.\nIn\n1996\nMcMullen published\nRenormalization and\n3\n-manifolds which fiber over the circle\nwhich was reviewed by Athanase Papadopoulos:-\nIn this monograph, the author presents a comprehensive study of a theory which brings into parallel two recent and very deep theorems, involving geometry and dynamics. These are Thurston's theorem on the existence of hyperbolic metrics on three-manifolds which fiber over the circle with pseudo-\nAnosov\nmonodromy, and\nSullivan\n's theorem on the convergence of the renormalization map for real quadratic mappings. The proofs that are given here are new and use different arguments than\nThurston\n's and respectively\nSullivan\n's original proofs. The relation between the two theorems is difficult to state in a concise form, but one thing that can be said at least is that both theorems can be thought of as fixed-point theorems.\nIn\n1998\nMcMullen received a\nFields\nMedal at the International Congress of Mathematicians in Berlin. In addition to the work in his thesis which we have described above, the citation mentions his work on the\nMandelbrot\nset\n[\n2\n]\n:-\nThis set describes dynamic systems which can be used to model complicated natural phenomena such as weather or fluid flow. The point of interest is where a system drifts apart and which points move towards centres of equilibrium. The border between these two extremes is the so-called\nJulia\nset, named after the French mathematician\nGaston Julia\n, who laid the foundations for the theory of dynamic systems early in the twentieth century. The\nMandelbrot\nset shows the parameters for which the\nJulia\nset is connected, i.e. is mathematically attractive. This description is very crude, but a better characteristic of the boundary set was not available. Curtis T McMullen made a major advance, however, when he showed that it is possible to decide in part on the basis of the\nMandelbrot\nset which associated dynamic system is \"hyperbolic\" and can therefore be described in more detail. For these systems a well-developed theory is available. McMullen's results were suspected already in the sixties, but nobody had previously been able to prove this exact characterization of the\nJulia\nset.\nIn\n[\n6\n]\nhe tells a nice story about the\nFields Medal\n:-\nI have a story about when I was coming back from Berlin. The security guard in the airport running the metal detector stopped me when my backpack went through the machine. She said, \"Excuse me, what do you have in your backpack here?\" I said, \"It's a gold medal.\" She said, a little dubiously, \"Mmm hmm.\" So I took it out of my pack. A little chagrined, she said \"Oh, very nice; is it yours?\" I said \"Mmm hmm!\"\nThe paper\n[\n1\n]\nlist the areas of McMullen's contributions:-\nHe has made important contributions to various branches of the theory of dynamical systems, such as the algorithmic study of polynomial equations, the study of the distribution of the points of a lattice of a\nLie\ngroup, hyperbolic geometry, holomorphic dynamics and the renormalization of maps of the interval.\nIn addition to the\nSalem\nPrize in\n1991\nand the\nFields\nMedal he was awarded in\n1998\n, McMullen had received a large number of other distinctions for his outstanding contributions. Among these we note that he was elected a Fellow of the\nAmerican Academy of Arts and Sciences\nin\n1998\n, was given an Honorary Doctor of Science Degree by Williams College in\n1999\n, and was elected a Member of the\nNational Academy of Sciences\nin\n2007\n. He has also been invited to give special lectures such as\n(\nsince\n2000)\n:\nNevanlinna\nColloquium, Helsinki\n(2000)\n;\nAmerican Mathematical Society\nColloquium Lectures, Washington DC\n(2000)\n; Distinguished Lecture Series, Brown University\n(2001)\n;\nAmerican Mathematical Society\nRoss Lecture, Boston\n(2002)\n; Namboodiri Lectures, University of Chicago\n(2003)\n; Alaoglu Lecture, California Institute of Technology, Pasadena\n(2003)\n; Mathematische Arbeitstagung,\nMax-Planck\n-Institut, Bonn\n(2003)\n;\nBowen\nLectures, University of California, Berkeley\n(2004)\n;\nKolchin\nLecture, Columbia University, New York\n(2005)\n;\nHopf\nLectures, Eidgenossische Technische Hochschule, Zürich\n(2005)\n; Mathematische Arbeitstagung,\nMax-Planck\n-Institut, Bonn\n(2007)\n; Ziwet Lectures, University of Michigan, Ann Arbor\n(2008)\nand Nielsen Lecture, CTQM, Aarhus, Denmark\n(2008)\n.\nDespite his stunning contributions to the latest mathematical research, McMullen has given excellent lectures to school children as for example the Arnold Ross Lecture he gave in\n2002\non\nFrom Triangles to Infinity\n. Here is a report of the lecture:-\nMcMullen motivated the talk by asking the audience what path a lion should take to capture a human, if both are in an enclosed ring. A little later in the talk, he asked students in the audience to assemble polyhedra using interlocking triangles, given the constraint that a fixed number of triangles have to meet at each vertex. As the title of the talk suggests, there were many different areas of mathematics touched on by McMullen, including:\nFermat\n's Last Theorem,\nZeno\n's Paradoxes, hyperbolic and spherical geometry, the harmonic series, and tiling. Near the end of his talk, McMullen showed a path that a human could take to elude the lion and used results about infinite series to demonstrate the path's effectiveness. The teachers and students who filled the Boston Museum of Science auditorium thoroughly enjoyed the subject of the talk and the manner in which it was delivered. Many students sought out McMullen after his talk to ask questions, and some even asked for his autograph.\nMore recently he gave a lecture\nThe Geometry of\n3\n-Manifolds\nto the annual meeting of the American Association for the Advancement of Science in Boston in February\n2008\n:-\nIn this topical lecture, McMullen gave a wonderful description of the\nPoincaré\nconjecture ... McMullen explained many topological ideas in the conjecture, how it relates to the shape of the universe, and gave an overview of\nGrigori Perelman\n's proof of the conjecture.\nLet us end this biography by quoting\nStephen Smale\n's words from\n[\n10\n]\n:-\nI ... would like to emphasise that\n[\nMcMullen's\n]\nwork has encompassed a large realm of the kind of mathematics that lies at the cross-section of many paths of our rich culture. McMullen is not a dynamicist, not an analyst nor a geometer. He is a mathematician."
}