{
  "nome_completo": "Dénes König",
  "nome_curto": "Dénes König",
  "ano_nascimento": "1884",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Konig_Denes/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Dénes König\nwas the son of the famous Hungarian mathematician\nGyula\n(\nJulius\n)\nKönig\nand Eliz Oppenheim\n(1853\n-\n1916)\n. There were two boys in the family; Dénes had a brother György. Dénes received an excellent education in Budapest, attending one of the best schools, a\nGymnasium\n, in the city. This Gymnasium, known as 'Minta', became the model for a new style of Hungarian high school. Of course, having an eminent mathematician as a father, Dénes was taught a lot of mathematics by his father, but he also had two excellent mathematics teachers at the Gymnasium, namely Manó Beke\n(1862\n-\n1946)\n, who had studied under\nFelix Klein\nat Göttingen in\n1892\n-\n93\n, and Miklós Szijártó, who had been a pupil of\nLoránd Eötvös\n. Dénes König had a most remarkable high school career for he achieved things that are basically unheard of for a school pupil. He had his first paper\nElementary discussion of two maximum-minimum problems\n(\nHungarian\n)\npublished in\n1899\nwhile he was still at school and not yet fifteen years old. This is quite remarkable but a few others have achieved a similar feat. Perhaps even more remarkable is the fact that while he was at school he wrote a\n61\n-page book,\nMathematical Recreations\n(\nHungarian\n)\n. This was published in\n1902\n, a year after he graduated from the Budapest 'Minta' Gymnasium, and a second volume was published in\n1905\nwhile he was still a university student. The Preface to the\n1902\nvolume was written by Manó Beke who stressed the importance of mathematical recreation problems in complementing the school curriculum. He also pointed out that König included not only elementary problems but also included more advanced material. Beke writes:-\nIt was my great joy that my young friend, who is one of my dearest students, undertook to edit a booklet entitled \"Mathematical entertainments\". He has somewhat of a talent for this work. He undertook also to arouse an interest in mathematical problems in the school as well as out of school and an interest of readers in the general public, letting them deal with many mathematical questions exceeding the subjects to be taught in high-school. There are already a great many books in such an orientation; publications from abroad have the most remarkable collections in this genre. The author chose his subjects from those collections, and readers can find the sources listed at the end of the booklet. Even if a collection in the Hungarian language exists, it is much more elementary than the work here, and only includes rather commonplace arithmetic and geometry puzzles. This booklet includes not only such things, but also something beyond the elementary problems. It includes not only popular puzzling arithmetic problems including riddles which usually can be solved with linear equations, but also more remarkable works which were printed in foreign countries as mentioned above, and which lead us into the wonderful world of the numbers. ...\nBoth Beke and Szijártó were strong advocates of reforming mathematical education and this book by König was clearly seen as part of that project. After taking his baccalaureate examinations in\n1902\n, he won first place in the\nLoránd Eötvös\nhigh school mathematics competition.\nLater in\n1902\n, König entered the University of Budapest where he spent four semesters. He then moved to Germany where he studied at the University of Göttingen for five semesters, returning to Budapest at Christmas\n1906\n. While in Göttingen, he attended\nHermann Minkowski\n's lectures on topology\n(\ncalled Analysis Situs at this time\n)\nin session\n1904\n-\n05\n. Back in Budapest, he was advised by\nJózsef Kürschák\n. He obtained his doctorate in\n1907\nfrom the Technical University of Budapest for his thesis\nElementary Discussion of Rotations and Finite Rotation Group of a Space of Many Dimensions\n(\nHungarian\n)\n[\n2\n]\n:-\nAlthough König's dissertation treated geometrical problems, his supervisor\nKürschák\nwas also interested in mathematical recreations and graph theory.\nKürschák\n's works are cited in two places in König's books on mathematical recreations published in\n1902\nand\n1905\n.\nAfter the award of his doctorate, König joined the staff of the Technische Hochschule in Budapest, where his father was professor. His initial appointment was as a demonstrator but in\n1908\nhe became an assistant to the professor of mathematics. He published two joint papers with\nAlfred Haar\nin\n1911\n, the paper\nOn simply ordered sets\n(\nHungarian\n)\nand its German translation as\nÜber einfach geordnete Mengen\nⓉ\n(\nOnsimply ordered sets\n)\n. By\n1910\nhe was ranked as the first assistant and in the following year became a\ndocent\n. This meant that he could present his own lecture courses and he delivered the course Analysis Situs. Over the following years when he worked as a docent, König gave courses on Analysis Situs, Nomography, Real Numbers, Set Theory, Real Numbers and Functions, and Graph Theory. Although he did not give a course entitled Graph Theory until session\n1927\n-\n28\n, nevertheless he had included chapters on graph theory in his Analysis Situs courses from\n1911\nonwards. From\n1913\n-\n14\nuntil\n1927\n, in addition to teaching mathematics students, König also taught mathematics to students of Architecture and Chemical Engineering. He remained at the Technische Hochschule in Budapest until his death, becoming a full professor in\n1935\n.\nIn the years\n1918\nand\n1920\nKönig published important books. The first was The\nElements of Analysis Situs which\nappeared in\n1918\n[\n6\n]\n:-\nHe treats the topology of orientable\n2\n-manifolds in a way accessible to beginners. This book was the first on this topic not only in domestic, but in the international mathematical literature as well. Prior to it there were neither textbooks nor monographs in this area\n(\nthe only available literature was on\nRiemann\nsurfaces\n)\n. .... Several Hungarian mathematicians learned the topology of surfaces from König's book. Out of consideration for the beginner, König uses an intuitive approach. The book proves the main classification theorem and describes the various normal forms. The presentation is very careful. He often finds new approaches to concepts and proofs; in particular, he gives a simplified version of the reduction to normal form. For several proofs he also filled the gaps that existed in the literature.\nThe second book, which appeared in\n1920\n, was\nMathematics. Lectures at the Polytechnical University of Budapest for Students in Architecture and Chemical Engineering\n.\nAt Göttingen, König had been influenced by Minkowski's lectures on the four colour problem in the\n1904\n-\n05\nsession\n[\n6\n]\n:-\nIn these, in addition to the characterisation of the topological properties of two-dimensional surfaces and the generation of various normal types,\nMinkowski\nintended to present a proof, given by Wemicke, of the four-colour conjecture. Only during the presentation of preliminary steps of the proof did it turn out that the proof was erroneous, and so only the proof of the five-colour theorem was presented.\nThese lectures contributed to König's growing interest in graph theory, but there were other reasons for his interest in the topic. He had studied the work of\nDavid Hilbert\nand\nPaul Gordan\non invariant theory and they had referred to\nJulius Petersen\n's paper\nDie Theorie der regulären Graphs\nⓉ\n(\nTheory of regular graphs\n)\n(1879)\n. König saw that the use of graph theory had greatly helped visualise problems and help to solve them. He decided that he would try to make graph theory into a respectable mathematical discipline. Up till this time, the use of graphs was seen as an amusing way to present ideas to children rather than as a tool in solving deep problems. His first publications on graph theory, where he began his mission, were two papers published in Hungarian in\n1911\n, namely\nGraphs on Two-sided Surfaces\nand\nThe Genus of Graphs\n. In\n1914\nhe attended the\nCongrès de philosophie mathématique\nin Paris where he gave a lecture in which he presented a graph theory result known today as the 'Theorem of König'. It is the first result in a topic which today is called matching theory. Because of the outbreak of World War I, the proceedings of this conference, containing König's paper, were not published until\n1923\n. However, he published the 'Theorem of König' in a Hungarian paper of\n1916\nand also in a German paper\nÜber Graphen und ihre Anwendung auf Determinantentheorie und Mengenlehre\nⓉ\n(\nOn graphs and their application to the theory of determinants and set theory\n)\nin the same year. This work on the factorisation of bipartite graphs relates closely to the marriage problem of\nPhilip Hall\n. König's use of graphs to give a simpler proof of a\ndeterminant\nresult of\nGeorg Frobenius\nseems to have led to some hostility between the two men.\nFrobenius\n's reducible determinant theorem was published in\n1912\nwhile König's simpler proof, in terms of the perfect matchings of a certain bipartite graph, appeared in\n1915\nin his paper\nLine systems and determinants\n(\nHungarian\n)\n.\nKönig's father,\nGyula König\n, died in\n1913\n. He had spent the last eight years of his life working on set theory, in particular on the\ncontinuum hypothesis\n. When Gyula died, a book he had been writing on set theory was almost, but not quite, complete. Dénes König completed the book\nNeue Grundlagen der Logik, Arithmetik und Mengenlehre\nⓉ\n(\nA new basis forlogic, arithmetic and set theory\n)\nadding a note to the Foreword already written by his father, saying that his father:-\n... had worked for eight years\n[\non the book\n]\n, until the last day of his life. Only a few pages more were lacking.\nAfter thanking\nJózsef Kürschák\nfor his help in finalising his father's manuscript, König writes:-\nI also address my sincere thanks to Professor\nF Hausdorff\n. By undertaking the painful and unrewarding work of proofreading with me the whole book, he has fulfilled one of the last wishes of my father.\nIt was not only\nGyula König\nwho was interested in set theory, however, for Dénes König also made some important contributions to the topic. His interest in the topic began around\n1908\nwhen he attempted to give proofs of two of\nFelix Bernstein\n's theorems on the equivalence of sets without assuming the well-ordering principle. However, his interest in set theory was not unrelated to his interest in graph theory for he often translated his set theory results into graph theoretical terms. His work on\nFelix Bernstein\n's theorems led him to give several different versions of what today is called 'König's infinity lemma', namely that:-\n...  if there is no finite upper bound to the length of paths in a finitary tree, then there is at least one infinite path in the tree.\nForms of this lemma appear in König's papers of\n1926\nand one of\n1927\n, namely\nÜber eine Schlussweise aus dem Endlichen ins Unendliche\nⓉ\n(\nOn an inference from the finite to infinity\n)\nwhich is entirely devoted to the infinity lemma. Miriam Franchella writes\n[\n4\n]\n:-\n... to König's great credit, he had been able to isolate the lemma and to understand its wide applicability.\nKönig's book,\nTheorie der endlichen und unendlichen Graphen\nⓉ\n(\nTheory of finite and infinite graphs\n)\n, was published in\n1936\n, and was a major factor in the growth of interest in graph theory worldwide. It was eventually translated into English under the title\nTheory of finite and infinite graphs\n(\ntranslated by R McCoart\n)\n, Birkhauser,\n1990\n. Keith Lloyd reviews the English translation in\n[\n10\n]\n:-\nDénes König's 'Theorie der endlichen und unendlichen Graphen'\nⓉ\n(\nTheory of finite and infinite graphs\n)\nwas originally published in Leipzig in\n1936\nand it was the first textbook on graph theory. It was reprinted by Chelsea in\n1950\nand even though many texts on the subject have appeared since then, König's book remains one which is still frequently cited. It is surprising, therefore, that it has taken more than half a century for an English edition to appear. The bulk of the present book consists of a translation by Richard McCoart of the whole of the original German text. ... Many of the topics dealt with by König are to be found in almost any text on the subject, for example,\nEuler\ntrails, Hamiltonian cycles, mazes, trees, directed graphs and factorisations, but unlike many later authors, König considers infinite as well as finite graphs. As well as the translation, the English edition contains a\n43\n-page Commentary by\nW S Tutte\nand a Biographical sketch of König by Tibor Gallai. In the former, Tutte summarises, chapter by chapter, the material treated by König and also discusses later developments, so providing an historical perspective on König's work.\nWe give the following quote from the Introduction to the\n1936\nbook:-\nPerhaps even more than to the interaction between mankind and nature, graph theory is based on the interaction of human beings with each other.\nIn the Preface to his\n1936\nbook, König discusses whether graph theory is a branch of topology or a branch of combinatorics. He argues that it is the latter:-\n... mainly because we attribute to the elements of a graph - vertices and edges - no geometrical content at all: the vertices are arbitrary distinguishable elements, and an edge is nothing other than a unification of its two endpoints. This abstract point of view - which Sylvester emphasized in\n1873\n- will be strictly maintained in our representation, with the exception of some examples and applications.\nAs to König's personality, we quote from\n[\n6\n]\n:-\nHe was a cheerful, sparkling man. He loved company; he enjoyed telling anecdotes. With his sarcastic humour he could entertain his company superbly. He liked his colleagues and was an indispensable participant in the coffee-house meetings of mathematicians.\nHe will always be thought of as one of the main originators of graph theory. He often began a lecture with the words:-\nGraph theory is one of the most interesting of mathematical disciplines.\nPaul Erdős\nwrote a 'Welcome' in the first issue of the\nJournal of Graph Theory\nin\n1977\n. He wrote:-\nI am very glad that the new 'Journal of Graph Theory' is born - but I cannot help feeling sorry that Dénes König did not live to see the present flowering of graph theory to which he contributed so much. I myself got interested in graph theory when I was in high school and saw a paper by König published in the mathematical magazine for high school students. When I was a freshman, T Gallai, G Grünwald and I took König's course on graph theory. All three of us very rapidly began to \"prove and conjecture\" independently. It is curious how little graph theory and combinatorial analysis was appreciated in those dark days. A friend of my parents, a statistician, once said about Dénes König: \"He is great in his art but his art is so small\". Ten years later\nJ H C Whitehead\n, the great English topologist, said about a graph theorist: \"He works in the slums of topology\". When I first got to Princeton in\n1938\n, I was surprised how many of the topologists looked down upon the four colour problem and considered it an unimportant side issue.\n[\nToday we have a\n]\n\"combinatorial explosion\". ... more and more mathematicians realise that there are very many beautiful and unexpected theorems and theories to be discovered in this field ...\nSadly König did not live to see this explosion of interest in graph theory which, at least in part, was motivated by his contributions. To understand his death we must look at some history of Hungary. Hungary, under pressure from Germany, signed a pact with Germany in\n1940\n. From July\n1941\n, Hungary handed many Jews over to the German forces. König, however, although Jewish, was brought up a Christian and so was not in danger from this particular persecution of Hungarian Jews. In fact König worked to help persecuted mathematicians. In September\n1944\n, Soviet troops crossed into Hungary and the government signed an armistice with the Soviet Union. Angered by this, Germany invaded Hungary on\n15\nOctober and installed their own puppet government composed of members of the Hungarian National Socialist Party. This government moved immediately against all Hungarian Jews, and suddenly König's protection through his Christianity vanished overnight. A reign of terror was launched against the Jews of Budapest and, rather than suffer the horrors that faced him, König took his own life."
}