{
  "nome_completo": "Daniel Joseph Kelly O'Connell",
  "nome_curto": "Daniel O'Connell",
  "ano_nascimento": "1896",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/OConnell/",
  "lugar_nascimento": "Rugby, England",
  "lugar_morte": "Rome, Italy",
  "biografia": "Daniel O'Connell\n's parents were Daniel O'Connell, an Inland Revenue officer who had been born in Ireland, and his English wife Rosa Susannah Helena Kelly. Daniel's father died in\n1905\nand his mother died two years later leaving him an orphan at the age of eleven. Soon after this he was sent to Clongowes Wood College near Clane in County Kildare, Ireland, about\n35\nkm from Dublin. This boarding school was run by the Society of Jesus\n(\nJesuits\n)\nand was the first school set up by that Society in\n1814\n. O'Connell moved from Clongowes Wood College to Tullabeg, Rahan, the second school to be opened by the Society of Jesus and, in\n1913\n, when he was seventeen years old, O'Connell entered the Society of Jesus at Tullabeg.\nThe Society of Jesus had bought Rathfarnham Castle in\n1913\nas a place where studies could take place. This castle was one that had been built in the\n16\nth century to protect Dublin from attack. The Juniors of the Society of Jesus studied there following a routine of study and prayer with time for debating, performing plays and playing football. One of the tasks of the Juniors was to take readings on a seismograph which was being designed and built by Father William O'Leary\n(1869\n-\n1939)\nat Rathfarnham Castle in\n1915\n, the year O'Connell began his studies there. In fact O'Leary asked O'Connell to help him and the two worked together building the seismograph. From this time on O'Connell was interested in seismology and did important work in that area. With World War I taking place at this time, all radios had been confiscated so, in\n1915\n, O'Connell purchased a transit instrument so that he could compute accurate time for his work with the seismograph. This was a beginning of his observing although he had already an interest in astronomy.\nHe entered the University College Dublin where he studied mathematics and physics. He was taught mathematics by\nArthur Conway\n, the Professor of Mathematical Physics, who also lectured to him on relativity and on mathematical astronomy. It is interesting to note that\nArthur Conway\nwas a member of the\nPontifical Academy of Sciences\n, in fact the first Irish scientist so honoured. O'Connell would eventually become President of this Academy. O'Connell's other mathematics lecturers were Michael Egan and Henry McWeeney, a graduate of University College Dublin, who had been appointed Professor of Mathematics in\n1891\n. He was taught physics by John McClelland who had been appointed Professor of Experimental Physics in\n1900\n. O'Connell was awarded a B.Sc. in\n1919\n. He continued his study of pure mathematics at University College Dublin and was awarded an M.Sc. for his pure mathematics dissertation in\n1920\n. It had been his intention to continue to undertake research at the University of Cambridge and he was awarded a travelling scholarship to work there to undertake research advised by\nArthur Eddington\n. His health was poor, however, having a worrying lung condition, so he was advised by his doctors to move away from Britain to a warmer climate, especially in the winter. He turned down the travelling scholarship and planned to go to Australia to benefit from a warmer climate, but first he went to the Netherlands.\nO'Connell continued his studies at St Ignatius's College at Valkenburg in the Netherlands. This College had been opened by the Society of Jesus when the Society had been banned from Germany by Bismark. At this College, O'Connell studied philosophy but began making telescopic observations of variable stars, especially eclipsing binaries that were to become the main topic of his astronomical research. In\n1922\nhe sailed to Australia where he undertook his regency at St Ignatius's College, Riverview near Sydney. The regency is a period of two or three years during which candidates to the Society of Jesus undertake work that fully involves them in the community life of the Society. St Ignatius's College, Riverview, was a boarding school for boys near Sydney established by the Society of Jesus in\n1880\n. O'Connell taught mathematics and physics at this College for a year and then, in\n1923\n, became assistant-director at the college's observatory. The Riverview Observatory was built in\n1909\nand did excellent work run by the Irish born Jesuit astronomer and seismologist Edward Francis Pigot\n(1858\n-\n1929)\n. O'Connell worked as an assistant to Pigot until\n1926\n, primarily working on seismology but also undertaking work in astronomy.\nIn\n1926\nO'Connell returned to Ireland where he completed his theological studies at Milltown Park, Dublin, and was ordained on\n31\nJuly\n1928\n. He then had to undergo the tertianship, the final part in entering the Society of Jesus. He did this final part at St Bueno's College near St Asaph in Wales. Then, in\n1931\n, he went to the Harvard College Observatory, in Cambridge, Massachusetts, USA, where he studied astronomy with\nHarlow Shapley\n. He had been advised to go to Harvard College Observatory by Johan Stein\n(1871\n-\n1951)\n, a member of the Society of Jesus who had taught mathematics and science at St Ignatius's College at Valkenburg for\n20\nyears, being there when O'Connell studied at St Ignatius's College in\n1920\n-\n22\n. Stein was an excellent astronomer and had left at St Ignatius's College when he was appointed as Director of the Vatican Observatory in\n1930\n.\nThe first person O'Connell met when arriving at Harvard College Observatory was Eric Mervyn Lindsay\n(1907\n-\n1974)\nwho had been born in Northern Ireland and studied at Queen's University, Belfast. Lindsay was at Harvard University undertaking research for his doctorate which he was awarded in\n1934\n. The two became friends for life. O'Connell attended lectures by Fred Wipple\n(1906\n-\n2004)\non photographic photometry. The greatest influence on O'Connell, however, was\nHarlow Shapley\nbut he was also influenced by\nCecilia Payne\nwho was working on variable stars and by Bart Bok\n(1906\n-\n1983)\nwho was undertaking research for his Ph.D. when O'Connell arrived. O'Connell attended the International Astronomical Union meeting in Harvard in\n1932\nand was fascinated by the discussion between\nArthur Eddington\nand\nGeorges Lemaître\non\nLemaître\n's expanding universe theory which\nEddington\ndid not like.\nO'Connell's health was still rather poor so his superiors at the Society of Jesus decided that they would have him return to Australia rather than assign him to a position in the British Isles. So O'Connell returned to the Riverview Observatory in\n1933\nwhere William O'Leary, whom he had worked with at Rathfarnham Castle, was now the director. On\n11\nJanuary\n1935\nO'Connell was elected a fellow of the Royal Astronomical Society. He succeed O'Leary as director of the Riverview Observatory in\n1938\n[\n1\n]\n:-\nFather O'Connell's years in Australia were very happy ones and led to many close friendships including that with Sir Richard Woolley who came to Australia in\n1939\nas Commonwealth Astronomer from Cambridge and who was to return to England in\n1956\nas Astronomer Royal at the Greenwich Observatory at Herstmonceux Castle. From then onwards Father O'Connell regularly stayed at the castle as a guest of the Astronomer Royal whenever he visited Britain.\nWhile in Australia O'Connell presented several radio talks, including a series of three talks with the title 'According to\nHoyle\n' on the Australian Broadcasting Commission station\n2\nBL-\n2\nNC, broadcast in March and April\n1952\n. Later that year, on\n26\nJuly, he left Australia when he was appointed as director of the Vatican Observatory. This was fortunate timing for it meant that he arrived in Rome in time to attend the meeting of the International Astronomical Union. He had managed to attend the first post-war meeting of the International Astronomical Union four years earlier in Zürich in\n1948\n.\nAt the Vatican Observatory O'Connell was able to install a\n24\n/\n36\n-inch Schmidt telescope in the Barberini Gardens in Castel Gandolfo, making this the largest of the Observatory's telescopes. With this telescope O'Connell and his assistants were able to make high quality direct observations and spectroscopic observations. His own research on eclipsing binaries and variable stars led to a long series of research papers. This work was of such high standard that he was elected as President of the Commission on Double Stars of the International Astronomical Union. He also made many outstanding contributions to the\nPontifical Academy of Sciences\n.\nO'Connell was nominated to the Council of the\nPontifical Academy of Sciences\nand on\n15\nJanuary\n1968\nhe became President of the Academy. He succeeded\nGeorges Lemaître\nas President and in\n[\n3\n]\nhe spoke about\nLemaître\n:-\n... he was a professor at the University of Louvain and a very good mathematician. Mathematics was his specialty, of course. He approached astronomy from the mathematical side. Then, some years ago, he became president of the\nPontifical Academy of Sciences\n. An international academy, purely international academy. And he was my predecessor, I succeeded him as president when he died.\nO'Connell organised two Study Weeks at the\nPontifical Academy\non astronomy. The first, in May\n1957\n, was on\nStellar Populations\n. Pope Pius XII delivered an address on 'Astronomy' on\n20\nMay\n1957\nwhen inaugurating the Study Week on 'Stellar Populations' supported by the\nPontifical Academy of Sciences\nand the Vatican Observatory.  O'Connell was close to the Pope but he was a leading scientist who approached his research in a purely scientific way. Given his position, he had to find a balance here. When the Pope was criticised for trying to teach astronomy to astronomers with addresses such as the one he gave on\n20\nMay\n1957\n, O'Connell explained the Pope's position:-\nI can, however, say something about his discourses on scientific topics. Here again he has been criticized for going into too much technical detail in these addresses, as if he were trying to teach the experts their own business. That was certainly not his aim. He wished his listeners to feel that he was interested in their problems and sympathized with their difficulties. Then he invariably used this technical introduction to lead up to religious and moral considerations appropriate to the subject and to the audience. In parenthesis it might be well to correct certain misapprehensions. Many have wondered how the Pope could speak so learnedly on such a great variety of topics. Some indeed have asserted that he prepared all his addresses himself, alone and unaided; others have even gone so far as to suggest that all this knowledge was infused by special divine inspiration. Both notions are incorrect. Pope Pius XII was indeed an ardent student all his life\n(\nhe had, for instance, a life-long interest in astronomy\n)\n, but he was far too conscientious and too intelligent to attempt to pose as an authority 'de omni re scibili', He was fully conscious of the obligation, imposed on him by his high position, of weighing his every word. This reinforced his natural passion for exactness and precision, so that he took every care to avoid making any kind of incorrect statement. Thus, when necessary, he called to his aid an expert\n(\nsometimes more than one\n)\nin the field he intended to discuss. He studied very carefully the technical material presented to him and made it his own, and moulded it so as to drive home the religious or ethical considerations he wished to put before his audience.\nThere was so much interest from leading astronomers in this Study Week, both in the meeting itself and in the Proceedings which O'Connell edited, that he was persuaded to hold another similar meeting. Although it was not a topic that O'Connell specialised in, nevertheless when it was suggested that\nNuclei of Galaxies\nwould be a timely topic, he agreed to organise a Study Week on that topic in\n1970\n. Again he edited the Proceedings which became a very important book.\nIn\n1970\nO'Connell retired from his position at the Vatican Observatory. At this time Eric Lindsay, his lifelong friend, invited him to become a Research Fellow at the Armagh Observatory in Northern Ireland. Although he greatly appreciated this offer from his friend, nevertheless, he still had obligations in Rome for he remained President of the\nPontifical Academy of Sciences\nuntil\n1972\n. Although he did no further observing, after this he continued his deep interest in astronomy and attended international conferences such as the International Astronomical Union meeting in Grenoble, France, in August\n1976\nwhen he gave the interview\n[\n3\n]\n.\nLet us end with this tribute paid by\nH A Brück\n[\n1\n]\n:-\nIn the case of people in authority acclaim is all too often tempered by critique. One of the rare exceptions to this rule is provided by the late Father Daniel O'Connell ... The reason for the exceptional standing of Father O'Connell in the annals of astronomy is the fact that he was not only an astronomer of high repute, but also a remarkably charming and good man with a genuine interest in others rather than himself which made him one of the best known and most like members of the international astronomical community of his time."
}