{
  "nome_completo": "Daniel Friedrich Hecht",
  "nome_curto": "Daniel Hecht",
  "ano_nascimento": "1777",
  "ano_morte": "1833",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hecht/",
  "lugar_nascimento": "Sosa (near Eibenstock), Saxony (now Germany)",
  "lugar_morte": "Freiberg, Saxony (now Germany)",
  "biografia": "Little is known of\nHecht\nbefore the age of\n26\nwhen he enrolled at the Bergakademie at Freiberg, Saxony. However we do know that Hecht was born in Sosa, near Eibenstock, in the Erzgebirge range of hills which run along the German-Czech border. The name Erzgebirge means Ore Mountains and this reflects the tradition of mineral wealth, worked by generations of small groups of craftsmen. In this area gold and silver, lead and copper, tungsten and pitchblende were mined for generations. It is no surprise to learn then, that Hecht was influenced by the mining tradition of the area and it is reasonable to assume that before he entered the Bergakademie at Freiberg, Hecht had worked in the mining industry in some capacity. Freiberg is situated at the northeastern foot of the Erzgebirge, southwest of Dresden, and was a centre for the support infrastructure of the mining industry. Hecht entered the academy with the idea that he would study the topics which were necessary to make him a mining expert. After his studies Hecht took up the position of a mine manager, then he became a teacher at the Freiberger Berschule.\nHecht was appointed second professor of mathematics at the Freiberg Bergakademie in\n1816\n. At first he taught elementary pure and applied mathematics, a course which had been previously given by the first professor at the Freiberg Bergakademie F G von Busse, but later Hecht taught only mechanics and mining machinery. When von Busse retired in\n1826\nit was a natural promotion for Hecht to assume the first mathematics chair at the Freiberg Bergakademie and this was indeed the position.\nKoch writes in\n[\n1\n]\nof Hecht's role at the Freiberg Bergakademie:-\nHecht was not a leading figure at the Freiberg Bergakademie, but through his great industry and his strict conscientiousness in carrying out his duties he was of great help to his students. His lectures were designed less for the gifted students than for those who needed extra assistance and an external stimulus in their studies. For this and for his friendly sincere manner Hecht won many friends.\nHe is best known for the high school texts which he wrote. These widely used school texts were on  mathematics, geometry and surveying. He understood that the mathematical and engineering skills necessary for those who were to be mining experts came together in mechanics and he developed the course material in this way. His books, written for his students and others who needed the same understanding of mechanics, were popular. For example he published\nLehrbuch der Arithmetik und Geometrie\nⓉ\n(\nTextbook of arithmetic and geometry\n)\n, a work in two volumes first published in\n1812\n,\n1814\n, with a second edition being published in\n1826\n.  His next text was\nTafeln zur Berechnung der Seigerteufen und Sohlen für die Länge der schwachen Schnur\nⓉ\n(\nTables for calculating the vertical depth and soles for the length of a light cord\n)\n(1814)\nwith perhaps his most famous work\nErste Gründe der mechanischen Wissenschaften\nⓉ\n(\nFirst course in mechanical sciences\n)\nbeing published in\n1819\nwith a second edition appearing in\n1843\n, ten years after Hecht's death. His later texts covered topics such as quadratic and cubic equations, differential and integral calculus, and arithmetic and geometry."
}