{
  "nome_completo": "David Hilbert",
  "nome_curto": "David Hilbert",
  "ano_nascimento": "1862",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hilbert/",
  "lugar_nascimento": "Wehlau, near Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "David Hilbert\n's father, Otto Hilbert, was the son of a judge who was a high ranking Privy Councillor. Otto was a county judge who had married Maria Therese Erdtmann, the daughter of Karl Erdtmann, a Königsberg merchant. Maria was fascinated by philosophy, astronomy and prime numbers. Otto Hilbert had a brother who was a lawyer and another who was the director of a\nGymnasium\n. After Otto was promoted to become a senior judge, he and Maria moved to\n13\nKirchenstrasse in Königsberg and this was the home in which David spent much of his childhood. He had a strict upbringing by his father who was a man who lived his life to a standard pattern, always walking the same way every day and only leaving Königsberg once a year for the annual family holiday. David was his parents' first child and only son. He was six years old when his sister Elsie was born.\nThe usual age for someone to begin schooling was six but David did not enter his first school, the Royal Friedrichskolleg, until he was eight years old. It is almost certain that his mother taught him at home until he was eight. The Friedrichskolleg, also known as the Collegium Fridericianum, had a junior section which David attended for two years before entering the gymnasium of the Friedrichskolleg in\n1872\n. Although this was reputed to be the best school in Königsberg, the emphasis was on Latin and Greek with mathematics considered as less important. Science was not taught at all in the Friedrichskolleg. The main approach to learning was having pupils memorise large amounts of material, something David was not particularly good at. Perhaps surprisingly for someone who was to make a gigantic impact on mathematics, he did not shine at school. In later life he described himself as a \"dull and silly\" boy at the Friedrichskolleg. Although doubtless there is modesty in these words, nevertheless they probably reflect Hilbert's own feeling about his school days. In September\n1879\nhe transferred from the Friedrichskolleg to the Wilhelm Gymnasium where he spent his final year of schooling. Here there was more emphasis on mathematics and the teachers encouraged original thinking in a way that had not happened at the Friedrichskolleg. Hilbert was much happier and his performance in all his subjects improved. He received the top grade for mathematics and his final report stated:-\nFor mathematics he always showed a very lively interest and a penetrating understanding: he mastered all the material taught in the school in a very pleasing manner and was able to apply it with sureness and ingenuity.\nAfter graduating from the Wilhelm Gymnasium, he entered the University of Königsberg in the autumn of\n1880\n. In his first semester he took courses on integral calculus, the theory of determinants and the curvature of surfaces. Then following the tradition in Germany at this time, in the second semester he went to Heidelberg where he attended lectures by\nLazarus Fuchs\n. Returning to Königsberg for the start of session\n1881\n-\n82\n, Hilbert attended lectures on\nnumber theory\nand the theory of functions by\nHeinrich Weber\n. In the spring of\n1882\n,\nHermann Minkowski\nreturned to Königsberg after studying in Berlin. Hilbert and\nMinkowski\n, who was also a doctoral student, soon became close friends and they were to strongly influence each others mathematical progress.\nFerdinand von Lindemann\nwas appointed to Königsberg to succeed\nHeinrich Weber\nin\n1883\nand\nAdolf Hurwitz\nwas appointed as an extraordinary professor there in the spring of\n1884\n.\nHurwitz\nand Hilbert became close friends, another friendship which was important factor in Hilbert's mathematical development, while\nLindemann\nbecame Hilbert's thesis advisor. He received his oral examination on\n11\nDecember\n1884\nfor his thesis entitled\nÜber invariante Eigenschaften specieller binärer Formen, insbesondere der Kugelfunctionen\nⓉ\n(\nOn invariant properties more specially binary forms, especially the spherical harmonics\n)\n.\nLindemann\nhad suggested that Hilbert study invariant properties of certain algebraic forms and Hilbert showed great originality in devising an approach that\nLindemann\nhad not envisaged.\nMinkowski\n, after reading the thesis, wrote to Hilbert\n(\nsee\n[\n8\n]\n)\n:-\nI studied your work with great interest and rejoiced over all the processes which the poor invariants had to pass through before they manage to disappear. I would not have supposed that such a good mathematical theorem could have been obtained in Königsberg.\nOn\n7\nFebruary\n1885\nhe defended two propositions in a public disputation. One of Hilbert's chosen propositions was on physics, the other on philosophy. This was the final stage of his doctorate, which was then duly awarded. He spent the month following the award of his doctorate taking, and passing, the\nStaatsexamen\nso that he was qualified to teach in a Gymnasium, and he also attended\nLindemann\n's geometry course on\nPlücker\n's line geometry and\nLie\n's sphere geometry, and he also attended\nHurwitz\n's lectures on modular functions.\nHurwitz\nsuggested that Hilbert make a research visit to Leipzig to speak with\nFelix Klein\n. Taking this advice, he went to Leipzig and attended\nKlein\n's lectures. He also got to know\nGeorg Pick\nand\nEduard Study\n.\nKlein\nsuggested that both Hilbert and\nStudy\nshould visit Erlangen and discuss their research with\nPaul Gordan\nwho was the leading expert on\ninvariant theory\n. However, the visit did not take place at that time.\nKlein\nthen told both\nStudy\nand Hilbert that they should visit Paris. They both went in early\n1886\n, Hilbert at the end of March.\nKlein\nhad given them instructions as to which of the Paris mathematicians they should visit and they did as he told them, alternately writing to\nKlein\nabout their experiences. One of the first mathematicians they visited was\nHenri Poincaré\nwho returned their visit a few days later. The two young visitors read their letters to\nKlein\nout loud to each other so that they would not both tell him the same things. He replied to each in turn, making clear that he was treating them equally. In Paris,\nCamille Jordan\ngave a dinner for Hilbert and\nStudy\nto which\nGeorge-Henri Halphen\n,\nAmédée Mannheim\nand\nGaston Darboux\nwere invited. On this occasion the French mathematicians all spoke German out of politeness to their German guests who complained to\nKlein\nafterwards that the mathematical conversation had been very superficial. They were also disappointed with their meeting with\nPierre Bonnet\nwhom they felt was too old for mathematical discussions. The mathematician with whom they seemed to get on best was\nCharles Hermite\n. Although they considered him very old\n(\nhe was\n64)\n, he was \"extraordinarily friendly and hospitable\" and discussed the big problems of invariant theory. Since they had found their visit especially useful, they returned to\nHermite\n's home for a second visit a few days later. It is clear that Hilbert's thoughts were entirely on mathematics during his time in Paris and he wrote nothing of any sightseeing. Towards the end of his visit he suffered an illness and was probably homesick. Certainly by the spring of\n1886\nhe was in good spirits as he returned to Germany. On his way back to Königsberg he visited Göttingen, where\nKlein\nwas about to take up the chair, where he met\nHermann Amandus Schwarz\n. Telling\nSchwarz\nthat he was next going to Berlin, Hilbert was advised to expect a cold reception by\nLeopold Kronecker\n. However, Hilbert described his welcome in Berlin as very friendly.\nFrom Berlin, Hilbert continued back to Königsberg where he prepared to submit his\nhabilitation\npaper on invariant theory. He also had to give an inaugural lecture in the main auditorium of the Albertina and, from the two options offered by Hilbert, he was asked to deliver the lecture\nThe most general periodic functions\n.\nKlein\nhad told Hilbert that Königsberg may not be a good place for him to\nhabilitate\nbut Hilbert was happy to do so. He wrote to\nKlein\n(\nsee for example\n[\n8\n]\n)\n:-\nI am content and full of joy to have decided myself for Königsberg. The constant association with Professor\nLindemann\nand, above all, with\nHurwitz\nis not less interesting than it is advantageous to myself and stimulating. The bad part about Königsberg being so far away from things I hope I will be able to overcome by making some trips again next year, and perhaps then I will get to meet Herr\nGordan\n.\nHe was a member of staff at Königsberg from\n1886\nto\n1895\n, being a\nPrivatdozent\nuntil\n1892\n, then as Extraordinary Professor for one year before being appointed a full professor in\n1893\n. The tour that he spoke about after habilitating at Königsberg happened in\n1888\n[\n126\n]\n:-\n... he set off in March\n1888\non a tour of several leading mathematical centres in Germany, including Berlin, Leipzig, and Göttingen. During the course of a month, he spoke with some twenty mathematicians from whom he gained a stimulating overview of current research interests throughout the country.\nIn Berlin he met\nKronecker\nand\nWeierstrass\nwho presented the young Hilbert with two rather different views of the future. Next, in Leipzig, he finally met\nPaul Gordan\n[\n126\n]\n:-\n... the two hit it off splendidly, as both loved nothing more than to talk about mathematics.\nHilbert spent eight days in Göttingen before returning to Königsberg. He married his second cousin, Käthe Jerosch, on\n12\nOctober\n1892\n; they had one son Franz Hilbert born on\n11\nAugust\n1893\n.\nIn\n1892\nSchwarz\nmoved from Göttingen to Berlin to occupy\nWeierstrass\n's chair and\nKlein\nwanted to offer Hilbert the vacant Göttingen chair. However\nKlein\nfailed to persuade his colleagues and\nHeinrich Weber\nwas appointed to the chair.\nKlein\nwas probably not too unhappy when\nWeber\nmoved to a chair at Strasbourg three years later since on this occasion he was successful in his aim of appointing Hilbert. So, in\n1895\n, Hilbert was appointed to the chair of mathematics at the University of Göttingen, where he continued to teach for the rest of his career.\nHilbert's eminent position in the world of mathematics after\n1900\nmeant that other institutions would have liked to tempt him to leave Göttingen and, in\n1902\n, the University of Berlin offered Hilbert\nFuchs\n's chair. Hilbert turned down the Berlin chair, but only after he had used the offer to bargain with Göttingen and persuade them to set up a new chair to bring his friend\nMinkowski\nto Göttingen.\nAs we saw above, Hilbert's first work was on invariant theory and, in\n1888\n, he proved his famous Basis Theorem. Twenty years earlier\nGordan\nhad proved the finite basis theorem for binary forms using a highly computational approach. Attempts to generalise\nGordan\n's work to systems with more than two variables failed since the computational difficulties were too great. Hilbert himself tried at first to follow\nGordan\n's approach but soon realised that a new line of attack was necessary. He discovered a completely new approach which proved the finite basis theorem for any number of variables but in an entirely abstract way. Although he proved that a finite basis existed his methods did not construct such a basis.\nHilbert submitted a paper proving the finite basis theorem to\nMathematische Annalen\n. However\nGordan\nwas the expert on invariant theory for\nMathematische Annalen\nand he found Hilbert's revolutionary approach difficult to appreciate. He refereed the paper and sent his comments to\nKlein\n:-\nThe problem lies not with the form ... but rather much deeper. Hilbert has scorned to present his thoughts following formal rules, he thinks it suffices that no one contradict his proof ... he is content to think that the importance and correctness of his propositions suffice. ... for a comprehensive work for the 'Annalen' this is insufficient.\nHowever, Hilbert had learnt through his friend\nHurwitz\nabout\nGordan\n's letter to\nKlein\nand Hilbert wrote himself to\nKlein\nin forceful terms:-\n... I am not prepared to alter or delete anything, and regarding this paper, I say with all modesty, that this is my last word so long as no definite and irrefutable objection against my reasoning is raised.\nAt the time\nKlein\nreceived these two letters from Hilbert and\nGordan\n, Hilbert was an assistant lecturer while\nGordan\nwas the recognised leading world expert on invariant theory and also a close friend of\nKlein\n's. However\nKlein\nrecognised the importance of Hilbert's work and assured him that it would appear in the\nAnnalen\nwithout any changes whatsoever, as indeed it did.\nHilbert expanded on his methods in a later paper, again submitted to the\nMathematische Annalen\nand\nKlein\n, after reading the manuscript, wrote to Hilbert saying:-\nI do not doubt that this is the most important work on general algebra that the 'Annalen' has ever published.\nIn\n1893\nwhile still at Königsberg Hilbert began a work\nZahlbericht\nⓉ\n(\nA number theory report\n)\non\nalgebraic number theory\n. The\nGerman Mathematical Society\nrequested this major report three years after the Society was created in\n1890\n. The\nZahlbericht\n(1897)\nis a brilliant synthesis of the work of\nKummer\n,\nKronecker\nand\nDedekind\nbut also contains a wealth of Hilbert's own ideas. The ideas of the present day subject of 'Class field theory' are all contained in this work. Rowe, in\n[\n124\n]\n, describes this work as:-\n... not really a Bericht in the conventional sense of the word, but rather a piece of original research revealing that Hilbert was no mere specialist, however gifted. ... he not only synthesized the results of prior investigations ... but also fashioned new concepts that shaped the course of research on algebraic number theory for many years to come.\nAn extract from Hilbert's Preface to\nZahlbericht\nis quote\n7\nin our collection\nQuotes by and about Hilbert\nat\nTHIS LINK\n.\nHilbert's work in geometry had the greatest influence in that area after\nEuclid\n. A systematic study of the axioms of Euclidean geometry led Hilbert to propose\n21\nsuch axioms and he analysed their significance. He published\nGrundlagen der Geometrie\nin\n1899\nputting geometry in a formal axiomatic setting. The book continued to appear in new editions and was a major influence in promoting the axiomatic approach to mathematics which has been one of the major characteristics of the subject throughout the\n20\nth\ncentury.\nReviews of\nGrundlagen der Geometrie\nand other of Hilbert's books are at\nTHIS LINK\n.\nMore about\nGrundlagen der Mathematik\nis at\nTHIS LINK\n.\nHilbert's famous\n23\nParis problems challenged\n(\nand still today challenge\n)\nmathematicians to solve fundamental questions. Hilbert's famous speech The Problems of Mathematics was delivered to the Second International Congress of Mathematicians in Paris. It was a speech full of optimism for mathematics in the coming century and he felt that open problems were the sign of vitality in the subject:-\nThe great importance of definite problems for the progress of mathematical science in general ... is undeniable. ...\n[\nfor\n]\nas long as a branch of knowledge supplies a surplus of such problems, it maintains its vitality. ... every mathematician certainly shares ..the conviction that every mathematical problem is necessarily capable of strict resolution ... we hear within ourselves the constant cry: There is the problem, seek the solution. You can find it through pure thought...\nHilbert's problems included the continuum hypothesis, the well ordering of the reals,\nGoldbach's conjecture\n, the transcendence of powers of algebraic numbers, the\nRiemann\nhypothesis, the extension of\nDirichlet\n's principle and many more. Many of the problems were solved during this century, and each time one of the problems was solved it was a major event for mathematics.\nFor more information about Hilbert's problems see\nTHIS LINK\n.\nToday Hilbert's name is often best remembered through the concept of\nHilbert space\n.\nIrving Kaplansky\n, writing in\n[\n2\n]\n, explains Hilbert's work which led to this concept:-\nHilbert's work in\nintegral equations\nin about\n1909\nled directly to\n20\nth\n-century research in functional analysis\n(\nthe branch of mathematics in which functions are studied collectively\n)\n. This work also established the basis for his work on infinite-dimensional space, later called Hilbert space, a concept that is useful in mathematical analysis and quantum mechanics. Making use of his results on integral equations, Hilbert contributed to the development of mathematical physics by his important memoirs on kinetic gas theory and the theory of radiations.\nMany have claimed that in\n1915\nHilbert discovered the correct field equations for general relativity before Einstein but never claimed priority. The article\n[\n54\n]\nhowever, shows that this view is in error. In this paper the authors show convincingly that Hilbert submitted his article on\n20\nNovember\n1915\n, five days before\nEinstein\nsubmitted his article containing the correct field equations.\nEinstein\n's article appeared on\n2\nDecember\n1915\nbut the proofs of Hilbert's paper\n(\ndated\n6\nDecember\n1915)\ndo not contain the field equations.\nAs the authors of\n[\n54\n]\nwrite:-\nIn the printed version of his paper, Hilbert added a reference to\nEinstein\n's conclusive paper and a concession to the latter's priority: \"The differential equations of gravitation that result are, as it seems to me, in agreement with the magnificent theory of general relativity established by\nEinstein\nin his later papers\". If Hilbert had only altered the dateline to read \"submitted on\n20\nNovember\n1915\n, revised on\n[\nany date after\n2\nDecember\n1915\n, the date of\nEinstein\n's conclusive paper\n]\n,\" no later priority question would have arisen.\nIn\n1934\nand\n1939\ntwo volumes of\nGrundlagen der Mathematik\nⓉ\n(\nFoundations of Mathematics\n)\nwere published which were intended to lead to a 'proof theory', a direct check for the consistency of mathematics.\nGödel\n's paper of\n1931\nshowed that this aim is impossible.\nSee\nTHIS LINK\n.\nHilbert contributed to many branches of mathematics, including invariants, algebraic number fields,\nfunctional analysis\n, integral equations, mathematical physics, and the calculus of variations. His mathematical abilities were nicely summed up by\nOtto Blumenthal\n, his first student\n[\n30\n]\n:-\nIn the analysis of mathematical talent one has to differentiate between the ability to create new concepts that generate new types of thought structures and the gift for sensing deeper connections and underlying unity. In Hilbert's case, his greatness lies in an immensely powerful insight that penetrates into the depths of a question. All of his works contain examples from far-flung fields in which only he was able to discern an interrelatedness and connection with the problem at hand. From these, the synthesis, his work of art, was ultimately created. Insofar as the creation of new ideas is concerned, I would place\nMinkowski\nhigher, and of the classical great ones,\nGauss\n,\nGalois\n, and\nRiemann\n. But when it comes to penetrating insight, only a few of the very greatest were the equal of Hilbert.\nAmong Hilbert's students were\nHermann Weyl\n, the famous world chess champion\nEmanuel Lasker\n, and\nErnst Zermelo\n. But the list includes many other famour names including\nWilhelm Ackermann\n,\nFelix Bernstein\n,\nOtto Blumenthal\n,\nRichard Courant\n,\nHaskell Curry\n,\nMax Dehn\n,\nRudolf Fueter\n,\nAlfred Haar\n,\nGeorg Hamel\n,\nErich Hecke\n,\nEarle Hedrick\n,\nErnst Hellinger\n,\nEdward Kasner\n,\nOliver Kellogg\n,\nHellmuth Kneser\n,\nOtto Neugebauer\n,\nErhard Schmidt\n,\nHugo Steinhaus\n, and\nTeiji Takagi\n.\nIn\n1930\nHilbert retired but only a few years later, in\n1933\n, life in Göttingen changed completely when the Nazis came to power and Jewish lecturers were dismissed. By the autumn of\n1933\nmost had left or were dismissed. Hilbert, although retired, had still been giving a few lectures. In the winter semester of\n1933\n-\n34\nhe gave one lecture a week on the foundations of geometry. After he finished giving this course he never set foot in the Institute again. In early\n1942\nhe fell and broke his arm while walking in Göttingen. This made him totally inactive and this seems to have been a major factor in his death a year after the accident.\nHilbert received many honours. In\n1905\nthe\nHungarian Academy of Sciences\ngave a special citation for Hilbert. He was awarded the\nBolyai\nPrize in\n1910\nand elected a fellow of the\nRoyal Society of London\nin\n1928\n. In\n1930\nHilbert retired and the city of Königsberg made him an honorary citizen of the city. He gave an address which ended with six famous words showing his enthusiasm for mathematics and his life devoted to solving mathematical problems:-\nWir müssen wissen, wir werden wissen - We must know, we shall know.\nSee quote\n3\nat\nTHIS LINK\n.\nIn\n1939\nhe was awarded the\nMittag-Leffler\nprize by the\nSwedish Academy of Sciences\n. He shared this Prize with\nÉmile Picard\n. Hilbert was elected an honorary member of the\nLondon Mathematical Society\nin\n1901\nand of the\nGerman Mathematical Society\nin\n1942\n.\nFor quotes which describe Hilbert's personality and hobbies see\n5\nand\n10\nat\nTHIS LINK\n."
}