{
  "nome_completo": "David Allan Spence",
  "nome_curto": "David Spence",
  "ano_nascimento": "1926",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Spence_David/",
  "lugar_nascimento": "Auckland, New Zealand",
  "lugar_morte": "Headington, Oxford, England",
  "biografia": "David Spence\n's father was a lawyer. David grew up, attended school, and did his undergraduate work in New Zealand. He attended King's College, Auckland, followed by the University of Auckland. He then moved to England where he undertook research in engineering at Clare College, Cambridge, being awarded his doctorate in\n1952\n.\nSpence did not enter the academic world after his doctorate but went to the Royal Aircraft Establishment at Farnborough. Here he began research on boundary layer problems of fluid flow which was of great significance in the design of aircraft wings. He described some of his analysis of the potential flow about a body representing the airfoil plus its boundary layer and viscous wake in the paper\nPrediction of the characteristics of two dimensional airfoils\nwhich appeared in\n1954\n.\nHe presented his most significant work from this period in the paper\nThe lift coefficient of a thin, jet-flapped wing\nwhich appeared in the\nProceedings of the Royal Society\nin\n1956\n. Spence studied a two-dimensional airfoil placed in an inviscid, incompressible, steady fluid flow, in particular a thin jet coming from its trailing edge of the airfoil. Obtaining equations under special conditions, Spence found numerical results for lift, pitching moment, and jet shape, which he compared with experimental results obtained from a wind tunnel. Two further papers in\n1958\nextended the results of this paper. One was\nThe lift on a thin aerofoil with a jet-augmented flap\nwhere he studied an airfoil with deflected flap such that the jet coming from the flap hinge prevents boundary-layer separation on the flap. Results were obtained using an early electronic computer. The second extension appeared in his paper\nSome simple results for two-dimensional jet-flap aerofoils\nwhich was also published in\n1958\n.\nIn\n1964\nSpence left the Royal Aircraft Establishment to enter the academic world. He was appointed to the engineering department of the University of Oxford and remained there for around\n20\nyears. He extended considerably the range of topics to which he applied his mathematical techniques. One\n1977\npaper\nThe Boussinesq problem for a material with different moduli in tension and compression\nis summarised in his own words as follows:-\nWe consider the infinitesimal displacements in the problem of point loading of an unbounded elastic solid which has different behaviour in tension and compression, using constitutive relations that depend on the signs of the principal strains. By similarity considerations, the displacements are expressed in terms of the solution of a pair of nonlinear ordinary differential equations satisfying two-point boundary conditions. These are found by an iterative technique giving numerical results for typical values of the elastic constants over a range of values of the ratio of E\n(\ncompressive\n)\nto E\n(\ntensile\n)\nlying between\n0\n.\n5\nand\n2\n.\nSpence applied his results on compression of solids to obtain a better understanding of geophysical problems. In particular he studied magma flow beneath the Earth's surface to obtain a better understanding of volcanic eruptions when magma flows through fractures in the Earth's surface.\nHe spent the final years of his career as Professor of Mathematics at Imperial College, London. He had special responsibilities in this post for teaching mathematics to engineering students, an aspect for which he was exceptionally well qualified. He continued to produce papers of outstanding quality. For example\nA class of biharmonic end-strip problems arising in elasticity and\nStokes\nflow\nappeared in\n1983\n. Spence's summary of the reslts of this paper begins:-\nWe consider boundary value problems for the biharmonic equation in the open rectangle x >\n0\n, -\n1\n< y <\n1\n, with homogeneous boundary conditions on the free edges y = ±\n1\n, and data on the end x =\n0\nof a type arising both in elasticity and in Stokes flow of a viscous fluid, in which either two stresses or two displacements are prescribed. For such 'noncanonical' data, coefficients in the eigenfunction expansion can be found only from the solution of infinite sets of linear equations, for which a variety of methods of formulation have been proposed.\nOther papers from this period include\nFrictional contact with transverse shear\n(1986)\nand\nThe line contact problem of elastohydrodynamic lubrication\n(1989)\n. He applied his theory to study the effects of injecting water into an oil well to allow greater recovery of oil. The understanding obtained from such studies allows more oil to be recovered from North Sea wells than might otherwise be possible.\nSpence retired from his chair at Imperial College, London, in\n1991\nwhen he reached the age of\n65\n. He continued his mathematical work but this became increasingly difficult due to a long illness. He had a number of interests outside mathematics, particularly in political history and law. He was described in an obituary\n[\n1\n]\nas:-\n... a quiet, thoughtful and kindly man with a great love for and pride in his family. In his younger days he was keen on golf and on strenuous walking in mountainous regions."
}