{
  "nome_completo": "David Eugene Smith",
  "nome_curto": "David Eugene Smith",
  "ano_nascimento": "1860",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smith_David/",
  "lugar_nascimento": "Cortland, New York, USA",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "David Eugene Smith\n's parents were Abram P Smith\n(\nborn\n9\nApril\n1831\nin Virgil, Cortland County - died\n4\nJuly\n1897)\nand Mary Elizabeth Bronson\n(1837\n-\n1871)\n. The Smith family were originally from Germany and were descended from Henry Smith who was born in Germany in\n1748\nand died in Virgil, Cortland, New York, in October\n1829\n. Abram P Smith, the son of Nathan Smith and Lucy Mallery, attended Homer Academy and the State Normal School at Albany, intending to become a school teacher. However, after teaching for two years at Marathon, New York, he decided to read law and was admitted to the bar in\n1856\n, becoming an eminent lawyer. In\n1868\nhe became surrogate judge of Cortland County. Mary Bronson, the daughter of Dr Horace Bronson and Polly Ball, had been taught classical languages, science and natural sciences by her father. David Smith had a sister Clara who married Alden March Jewett and lived in Cortland.\nMary Elizabeth Smith taught her son David Latin, Greek and other topics so that he had a superb education in addition to his elementary schooling in Cortland\n[\n11\n]\n:-\n... he could speak both Latin and Greek as a boy, and much preferred studying the Classics to weeding the garden or other chores assigned him by his father.\nShe took her son on many excursions round the Great Lakes where they studied nature, visited historic sites and viewed art exhibitions and museums. David began studying at Cortland Normal School, located off Church Street in Cortland, New York, in\n1869\n. This was a new school which had been authorised by the New York State Legislature in the previous year and, after the Board of Trustees had been appointed and the school organised, Smith began his studies as soon as classes began. We note that the original campus was destroyed by fire in\n1919\nand the new campus, opened four years later, is now the State University of New York College at Cortland.\nHis mother died in\n1871\nwhen David was eleven and his father remarried on\n30\nDecember\n1873\n, his second wife being Ellen Prince Steadman, the daughter of Czar Prince. Smith completed his intermediate studies in\n1876\nand moved to the academic department of the Normal School. In\n1877\nhe entered Syracuse University, situated in Syracuse, New York. This was a comparatively new university when Smith began his studies there for the state of New York had granted its charter in\n1870\nand it had opened in September\n1871\n. The university grew quickly, offering courses in physical sciences and modern languages when it opened, adding architecture in\n1873\nand, in the following year, created a bachelor of fine arts degree. Smith studied a wide range of courses at Syracuse University in the arts and humanities. He studied Latin, Greek, Hebrew and took courses such as elocution and rhetoric\n[\n11\n]\n:-\n... he could read the Bible in its original language, and he once expressed the opinion, \"If you want to find the beauty of the Bible, read it in the Hebrew tongue, especially the Book of David.\"\nHe made his first trip abroad in the summer of\n1879\n, in the middle of his undergraduate studies, going to Europe where he continued his passion for collecting objects such as money, shells and antiques. Back at Syracuse he completed his undergraduate studies and was awarded the degree of Bachelor of Philosophy in July\n1881\n. After this, he followed the route that he had planned for some time and began to prepare for admission to the bar. While doing this he also served as an apprentice at his father's law office.\nSmith was now following a surprising number of different paths for, in addition to his law studies, he went twice a week to Syracuse University where he was undertaking graduate studies in history, modern languages and mathematics. He also continued his love for travelling making visits to both Central America and to South America. His father, Abram Smith, had been elected as a judge of Cortland County in\n1867\nand served in this role for\n16\nyears. After retiring from the bench in\n1883\nhe set up with his son as A P & D E Smith.  We note that at Abram Smith's his funeral it was said: \"No attorney in the history of this county ever worked harder or more successfully for clients without expectation of reward than he did.\" In\n1884\nDavid Smith was admitted to the bar and was also awarded the degree of Master of Philosophy by Syracuse University.\nNow with a Master's degree and setting out on a promising career in law, Smith received a request by the Cortland Normal School to help them out by teaching some mathematics courses, standing in for an absent teacher. This he did and discovered not only a love for mathematics but also a love for teaching. When the Principal of Cortland Normal School, delighted with Smith's performance, offered him a permanent position, he was happy to accept. Not only did he teach but over the next couple of years he continued to undertake certain tasks as a lawyer in his father's firm. However, remarkably, he also continued with his graduate studies at Syracuse University. He received a doctorate in the history of fine arts in\n1887\nfor his thesis\nPolygnotos Ethographos, Polygnotos the Painter of Character\n, gave up his work as a lawyer and, at Cortland Normal School, added the teaching of the history of mathematics to his teaching of arithmetic, algebra, plane geometry, solid geometry, and trigonometry. On\n19\nJanuary\n1887\nhe married Fanny Taylor\n(12\nFebruary\n1865\n-\n11\nJanuary\n1928)\nwho had been born in Cortland, New York, the daughter of Charles Culver Taylor and his wife Sarah Stickles.\nBy\n1891\n, having taught for seven years at Cortland Normal School, he was given leave of absence for a year to go to Göttingen, Germany, to study advanced mathematics with\nFelix Klein\n. Before setting out for Germany, however, he received an offer of the chair of mathematics at the Michigan State Normal School at Ypsilanti, which was affiliated to Michigan University. He decided that he would accept this offer and not take the year at Göttingen. At Ypsilanti he began to develop the ideas on mathematical education for which he became famous. He began writing textbooks with W W Beman, their first being\nPlane and Solid Geometry\n(1895)\nand the next being\nHigher Arithmetic\n(1897)\n. He also began publishing papers such as:\nNote on Mr Ellwood's remarks on division\n(1894)\n;\nQuestion on the origin of the symbol %\n(1894)\n;\nThe recent progress of standard time\n(1895)\n;\nSex in mathematics\n(1895)\n;\nSources for study of the trisection problem\n(1895)\n;\nEmile-Michel-Hyacinthe Lemoine\n(1896)\n;\nThe evolution of method in arithmetic\n(1896)\n;\nHistory of modern mathematics\n(1896)\n;\nArithmetic in rural and village schools\n(1897)\n;\nThe Michigan state normal school\n(1897)\n, and\nOn the course in the history of mathematics in the Michigan state normal college\n(1898)\n. We see from this list that Smith was publishing on both mathematical education and on the history of mathematics. At Ypsilanti, in addition to reorganising the department and the teacher training courses, he also built up a mathematics library of over\n700\nitems. Smith himself wrote in the \"Michigan State Normal College Yearbook,\n1897\n-\n1898\n\" that:-\n... the library facilities in the line of pedagogy of elementary mathematics are now the best in the country.\nSmith left Ypsilanti in\n1898\nwhen he moved back to New York to take up the position of principal of Brockport Normal School. However, he only held this position for three years, tempted to leave through his love of books after meeting George Arthur Plimpton\n(1855\n-\n1936)\n[\n5\n]\n:-\nAs Plimpton later recalled\n[\nin a letter to Smith written on\n19\nJanuary\n1933]\n, Smith's introduction to his textbook collection occurred when Smith was principal of Brockport Normal School. During a visit to New York, he visited Plimpton's home, then on Thirty-Third Street, and what he saw must have enticed him to consider relocating to New York. From their first meeting, Plimpton recognized Smith's expertise and appreciated his resourcefulness. When Dean James Earl Russell sought out Smith at a professional meeting in\n1901\nto offer him the chair in mathematics at Teachers College of Columbia University, he quickly accepted and moved to New York for the fall semester.\nOnce Smith and his wife were living in New York, Plimpton frequently invited them to dine with him and Smith was thrilled to be able to inspect Plimpton's collection of mathematical books and manuscripts. He wrote to Plimpton on\n9\nDecember\n1901\n:-\nYour books kept me awake half the night after our pleasant evening with you. But it was a delightful insomnia.\nOne aspect of Smith's teaching was to allow his students to make use of his remarkable mathematical library. Sophia R Refior was one of his students and she wrote the article\n[\n13\n]\nabout Smith's library:-\nThe students in the seminary in the History of Mathematics under Dr David Eugene Smith have been privileged at various times to visit the unique private library of their instructor and to use such manuscripts as were necessary in their field of re search. The inspiration derived from examining these price less objects has stimulated one of the pupils to write the following account. ... This library of historical, mathematical material is one of the most interesting of its kind in the world, not only because of its size, but because of the very rare volumes upon its shelves. Books of all periods of history and of all countries are found there. Early historic tablets, original manuscripts, autographed letters, presentation copies and first editions as well as rare translations are included in this excellent library. Dr Smith has personally collected these rarities during his numerous travels in Europe, Asia, Africa and South America and has spent much time and money as well as care in selecting them. He has received them from friends or bought them in bookshops, but more often he has ingeniously gathered them from remote and obscure places, with the view in mind of pre serving them for his students. The collection is more than a collection - it is an expression of the interest and personality of Dr David Eugene Smith.\nSmith donated his library to Columbia University in\n1931\n. Five years later he wrote in\n[\n17\n]\n:-\nA few years ago I gave to the university my library on the history of mathematics, consisting of upwards of\n20\n,\n000\nitems-bound volumes, manuscripts, portraits of mathematicians\n(\nabout\n2\n,\n700\nengravings and\n160\nmedals\n)\n, catalogued monographs\n(2\n,\n000)\nand\n4\n,\n000\nletters, including such leaders as\nNewton\n,\nDescartes\n,\nLeibniz\nand the Bernoullis.\nIn\n1936\nhe donated his collection of mathematical instruments to Columbia University\n[\n17\n]\n:-\nFor use in my lectures I had, over a period of more than\n40\nyears, collected more than\n275\ninstruments of early and medieval times for purposes of calculating, measuring\n(\nlengths, areas, volumes, weight and time\n)\nand astronomy\n(\nnavigation, astrology, and the calendar\n)\n. It therefore seemed appropriate that this historical-mathematical material should be placed alongside the books, many of which describe and illustrate the instruments themselves.\nSmith published a remarkable number of papers and books. See\nTHIS LINK\nfor an Overview of his publications and links to the other material in this archive related to these publications. You can also click on the links at the end of this article.\nIn February\n1926\n, at the age of\n66\n, Smith retired from his chair at the Teachers College of Columbia University. The May\n1926\npart of\nThe Mathematics Teacher\nhonoured Smith\n[\n7\n]\n:-\nIn February of this year Professor David Eugene Smith retired from active service at Teachers College. At this time his students and colleagues arranged for presenting to the College a portrait of Professor Smith and, at a dinner in his honour, they endeavoured to express to him their appreciation of the uniqueness of his work and their regard for him as a friend and teacher. Doctor Smith's influence on the teaching of mathematics is such that it seems appropriate that the interpretations of his contributions as given on these occasions be made known.\nThe article\n[\n20\n]\nin this part of\nThe Mathematics Teacher\ncontains the speeches made at the dinner held in Smith's honour.\nRetiring for Smith certainly did not mean that he led a quiet life and he continued his love for travel\n(\nin fact during his life he made eighty Atlantic crossings\n)\n. For example he spent four months in winter\n1932\n/spring\n1933\nin Persia\n(\nnow Iran\n)\n, Iraq and Syria. He was able to obtain about\n150\nmanuscripts during these months in Persian, Arabic and Hebrew which were either translations by the Arabic scholars of Greek texts or were works by mathematicians such as\nOmar Khayyam\n.\nOn\n19\nJanuary\n1933\n, Plimpton sent greetings to Smith for his\n73\nrd\nbirthday. He wrote\n(\nsee for example\n[\n5\n]\n)\n:-\nIn due course of time you became not only a famous teacher in the United States but, internationally, a historian of mathematics, respected, loved, and honoured by mathematicians from one end of the world to the other. I cannot let this birthday go by without telling you how much I appreciate what you have contributed to the happiness of my life and to that of Mrs Plimpton. I want to assure you that you have my best wishes ... for I everlastingly believe in you, what you have stood for, and what you have accomplished\n.\nEver your sincere friend, George A Plimpton\n.\nLater in\n1933\nSmith gave an address as retiring president of the International Commission on the Teaching of Mathematics. He described the work of the Commission over twenty-five years and ended his address by looking to the future. He said\n[\n18\n]\n:-\nAs to the subject of investigation, I suggest as very important \"The Present Trend in the Teaching of Mathematics in the Several Types of Schools in the Various Countries of the World.\" I therefore offer the following resolution - \"Resolved that we proceed at the meeting of this Section two days hence to elect a new International Commission on the Teaching of Mathematics, said Commission to report at the Congress to be held at Oslo in\n1936\n; and that this Commission arrange for national committees according to its best judgment.\" If, as I anticipate, this shall bring younger men and women into the Commission, while retaining older members where this is thought advisable, and if it shall result in the vigorous prosecution of some such study as the one which I have suggested, it is my hope that this method of procedure will be continued in future Congresses. The teaching of mathematics should never be static; it should be a dynamic force which should result in continued study and in informational quadrennial reports to the Congresses of the future.\nWe have already noted that Smith's wife Mary died in\n1928\n. He remarried in\n1940\nwhen eighty years old to Eva May Luse who had been one of his co-authors on\nWalks and talks in Numberland\n(1929)\n,\nThe problem and practice arithmetics\n(1929)\nand\nJunior arithmetic\n(1930)\n. Eva May Luse\n(\nborn\n15\nSeptember\n1877\nin Oxford, Iowa - died\n25\nSeptember\n1969\nin Los Angeles, California\n)\nserved on the faculty of the University of Northern Iowa from\n1906\nto\n1941\nwhere for over\n20\nyears she was head of the teaching department.\nIn\n[\n11\n]\nW D Reeve gives this tribute to David Eugene Smith:-\nHis wealth of knowledge was gleaned in many countries and in many languages. A scholar and a great teacher, he was loved and revered by all who had the good fortune to know him.\nLet us end by giving Smth's own assessment of what is required from a historian of mathematics. This passage was written as an introduction to an obituary of\nThomas Little Heath\n, but applies equally to Smith himself\n[\n19\n]\n:-\nOne who would aspire to marked success in any branch of the history of mathematics must be possessed of certain abilities rarely combined in a single individual. He must know much more of mathematics than what he proposes to include in his study - the offshoots from these branches and their relation to the science as it has developed since the period of their inception. He must possess a working knowledge of the classical and the principal modern languages, the former for his source material and the latter for the interpretation of this material by later writers. He must be able to express himself with precision and with a degree of elegance that will command the respect and the attention of those who will probably read his works. He must be erudite but not bookish, philosophic but not pedantic, profound but not dull.\nFinally let us note Smith's many contributions to the\nAmerican Mathematical Society\n, the History of Science Society and the\nMathematical Association of America\n. Smith was vice-president of the\nAmerican Mathematical Society\nin\n1922\n, was associate editor of the\nBulletin\nof the\nAmerican Mathematical Society\nfrom\n1902\nto\n1920\n, and the Society's Librarian\n(1902\n-\n20)\n. He served as president of the\nMathematical Association of America\nin\n1920\n-\n21\n. He was the founder of the History of Science Society and founded the journal\nScripta Mathematica\n."
}