{
  "nome_completo": "David van Dantzig",
  "nome_curto": "David van Dantzig",
  "ano_nascimento": "1900",
  "ano_morte": "1959",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dantzig/",
  "lugar_nascimento": "Amsterdam, Netherlands",
  "lugar_morte": "Amsterdam, Netherlands",
  "biografia": "David van Dantzig\n's parents were Abraham van Dantzig\n(1872\n-\n1944)\nand Bertha de Kadt. Both Abraham and Bertha were Jewish. Abraham van Dantzig, an entrepreneur, was the son of David van Dantzig and Sophia Graveur. Bertha de Kadt was the daughter of Israel de Kadt and Maria van Leeuwen. Abraham and Bertha van Dantzig were married on Thursday,\n24\nAugust,\n1899\nin Rotterdam. At the time of their marriage, Abraham was\n27\nyears old while Bertha was\n30\nyears old. David van Dantzig, the subject of this biography, was the eldest of their children having the younger siblings Siegfried van Dantzig, Marijn van Dantzig, and Anne Marie van Dantzig. The van Dantzig family were not well off and not in a position to give their children a good education.\nDavid van Dantzig was at secondary school when he wrote his first mathematics paper and, remarkably, he was only thirteen years old at the time. However, his main interest in secondary school was not mathematics, rather it was chemistry. After leaving school he continued with his studies of chemistry at the University of Amsterdam, but he did not enjoy chemistry and when he was forced to give up his academic studies to help support his family van Dantzig took on a number of jobs purely to make money. This brief time at the University of Amsterdam would, however, influence his whole career for, while he was a chemistry student, he began attending Gerrit Mannoury's course on analytic geometry at the university in October\n1917\n. After the second lecture he wrote a long letter to Mannoury which began a life-long master and pupil relationship.\nBy now van Dantzig knew that mathematics was the subject which he really wanted to study but he was not in a position to do so, both because he had to earn money and also because he did not have the necessary school qualifications. He put in hours of work on mathematics in the evenings after finishing his money earning tasks for the day. These tasks included writing newspaper articles including being a music critic, writing children's stories, composing puzzles and writing popular science articles. He took the state mathematics and mechanics examinations in\n1921\n, at a higher level in the following year and again in\n1923\nhe passed at a still higher level. Entering the University of Amsterdam to study mathematics he soon passed examinations which took him essentially to Master's Degree level.\nVan Dantzig attended a seminar at the University of Amsterdam in\n1925\nwhich was led by\nL E J Brouwer\nbut also had\nPavel Sergeevich Aleksandrov\n,\nKarl Menger\n,\nLeopold Vietoris\nand\nWitold Hurewicz\nas participants. At this seminar he heard these outstanding mathematicians talking about work on topological groups, rings and fields and he decided that he would try to unify these concepts. This became the topic of his doctoral thesis. Van Dantzig became an assistant to\nJan Schouten\nin\n1927\nat Delft Technical University. Two years later he married Elisabeth Mathilde Stumpfrock; they had three children. For a short time, beginning in\n1929\n, he taught in Rotterdam at the Kweekschool voor Onderwijzers, a teacher training institution\n[\n12\n]\n:-\nAlthough he did not consider his short career as a schoolteacher a downright success, it nevertheless opened his eyes for the problems concerning the teaching of mathematics.\nHe returned to Delft as a lecturer in\n1932\n. This was the year in which he received his doctorate from Gröningen for a thesis which he submitted in\n1931\nStudiën over topologische Algebra\nⓉ\n(\nStudies on topological algebra\n)\n. In this work he coined the now familiar term topological algebra but the thesis is memorable in other ways too. It\n[\n1\n]\n:-\n... is a fine example of mathematical style: it consists of a concise string of definitions and theorems organised in such a way that in this context each theorem is obvious and none needs a proof.\nHe was promoted to extraordinary professor at Delft in\n1938\nand then an ordinary professor in\n1940\n. His most important work at this time was in topological algebra and in addition to his doctoral thesis, he wrote a whole series of papers on this topic. He studied metrisation of groups, rings and fields. One paper classified fields with a locally compact topology. This was not the only area which interested him, however, and he also studied differential geometry and its application to physics. His work in this area was, largely, in collaboration with\nJan A Schouten\n. For example in the paper\n[\n22\n]\npublished in\n1933\n, van Dantzig and\nSchouten\nwrite in the introduction:-\nIn three previous papers we have given a short account of a new physical theory, the \"general field theory\" which intends to give a unification of general relativity not only with\nMaxwell\n's electromagnetical theory but also with\nSchrödinger\n's and\nDirac\n's theory of material waves. The principal point of this theory is, that it is not founded on a metrical or an affine connection but on a projective one. Hence it is closely related to the theory of\nVeblen\nand Hoffmann which depends on a projective connection as well, and to the theory of\nEinstein\nand Mayer which can be brought into a projective form as we have proved in a previous paper. But in contrast with these theories the geometrical conditions in our theory are reduced to a smaller number, in order to obtain the possibility of adapting the projective connexion most closely to the conditions arising from physical considerations. The method used in this paper to handle the projective connexion is the one developed by D van Dantzig, based on the introduction of homogeneous coordinates. The method used to handle spin quantities is the one developed by\nJ A Schouten\n.\nFor further ideas of van Dantzig on Space and Time see\n[\n17\n]\nwhich is the published version of the talk 'Some speculations on the future development of the notions of space and time' which he gave at the\n1938\nCambridge Congress on 'Scientific Language'.\nThere was still another topic that interested van Dantzig during the\n1920\ns and\n1930\ns, namely significs. It is the science of meaning and communication which combines philosophical, linguistic, logical and psychological aspects. Mannoury and\nBrouwer\nwere part of a group in Amsterdam which van Dantzig joined whose aim was to:-\n... tackle the lack of understanding, the misinterpretations and ambiguities of language and communication in society, especially in scientific communication ...\nThe article\n[\n13\n]\nlooks at van Dantzig's contributions to significs. It begins as follows:-\nDuring the time, in the early twenties, when David van Dantzig studied mathematics under Mannoury and\nBrouwer\nat the University of Amsterdam, he became acquainted with significs; especially to Gerrit Mannoury, the study of the foundations of mathematics was a signific study of those foundations themselves, which according to him are erroneously called the philosophy of mathematics.\nAs an example of van Dantzig's ideas in this area we quote from a review article he wrote in\n1923\n:-\nIf we ask a mathematician to define the aim and the use of teaching mathematics, he would probably answer: the aim is the furtherance of logical thinking and the use is the application of mathematics to technics and physics. Properly speaking, this answer is an evasion, an effort to justify. It does not however apply to the teaching of mathematics, as it is done in our schools. That is aimless and useless.\nThen van Dantzig goes on to argue that mathematics is not a type of knowledge but is a way of thinking which can be applied to any process of thought.\nWorld War II would cause a change of direction in van Dantzig's research topics although his approach to research . The Dutch had tried to remain neutral when World War II broke out in\n1939\nbut in the spring of\n1940\nGerman troops, in a strategic move on their way to attack France, entered Holland and the Dutch were defeated in a week. As he was Jewish, van Dantzig was dismissed from his chair in Delft when the Germans occupied Holland and he was forced to move with his family from the Hague to Amsterdam. During the war years he began to work on\nprobability\nand published\nMathematical and empirical foundations of probability theory\n(\nDutch\n)\nin\n1941\n.\nAfter the war ended, he was appointed professor at the University of Amsterdam in\n1946\n. The cruelty he had witnessed during the war had a major impression on him and he tried to address these issues using the skills and ideas which he had developed. In a UNESCO report, 'Enquiry into current Ideological Conflicts', he wrote:-\nPolitical terms are vague, because they express fluctuating emotions rather than steady observations, ideals rather than actual situations and vague\n(\noften even subconscious\n)\ndesires rather than precise volitions ...\nHe explained how synthetic definitions differed in their scientific usage and in their political usage. He defines an analytic definition as one which describes the way a term is actually used in communicating with the reader or listener. A synthetic definition describes how the author intends to use the term and, in science, this is accepted by the reader or listener. However, in the UNESCO report he writes:-\nIn politics, however, this is only the case with respect to the speaker's followers. Here the introduction of a definite way of using words is usually meant to result in a definite type of political behaviour. Therefore, the volitive element which is always present in the acceptance of a proposal here becomes of the greatest importance: whether such a proposal will be accepted or not becomes mainly dependent upon whether the listener's purposes are in accordance with or contrary to the speaker's. Hence in political science the distinction between analytic and synthetic definitions changes, in a large number of cases, into one between analytical and political definitions.\nWe see here how he is using his interest and studies of significs in attempting to clarify how ideological conflicts arise.\nIn Amsterdam he was the cofounder, with J G van der Corput and J F Koksma, of the research and service institution, the Mathematisch Centrum, in February\n1946\n. He played a major role in both this Mathematical Centre and in the University of Amsterdam where he continued to hold his chair until his death. At the Centre he was head of the Department of Mathematical Statistics while at the University he held the chair of the Theory of Collective Phenomena. This chair had been specially created for van Dantzig. He was extremely busy in these two roles both on the academic side delivering courses, attending congresses and supervising student's work, and on the administrative side where he sat on many committees and boards.\nAfter the Second World War, van Dantzig undertook research mainly on probability and statistics. Hemelrijk writes in\n[\n8\n]\n:-\nVan Dantzig published a large number of papers on probability and statistics, concerning its foundations, distribution-free methods, characteristic functions and applications. As regards fundamental concepts, he was a \"frequentist\"\n(\nalthough not quite content with the frequency interpretation of probability as it stands today\n)\n. His sharp and critical way of thinking expressed itself in his use of exact notation, his preference for distribution-free methods and in many other ways.\nHis most two important contributions are:\nHis theory of collective marks\n. He describes this in\nSur la méthode des fonctions génératrices\nⓉ\n(\nOn the method of generating functions\n)\n(1949)\n,\n(\nwith C Scheffer\n)\nOn arbitary hereditary time-discrete stochastic processes, considered as stationary Markov chains, and the corresponding general form of Wald's fundamental identity\n(1954)\nand\nChaînes de Markov dans les ensembles abstraits et applications aux processus avec régions absorbantes et au problème des boucles\nⓉ\n(\nMarkov chains in abstract sets and applications to processes with absorptive regions and to the loops problem\n)\n(1955)\n.\nApplication to rank correlation.\nThis is contained in the mimeographed notes\nLes fonctions génératrices liées à quelque tests nonparamétriques\nⓉ\n(\nThe generating functions related to some nonparametric tests\n)\n.\nAs might be expected given his demand for precision of language and work on foundations, van Dantzig found weaknesses in the work of others. For example\n[\n20\n]\nis a review of Rudolf Carnap's\n1950\nbook\nLogical foundations of probability\n. Van Dantzig make many detailed objections to parts of this book but we give only a few sentences to give a flavour:-\nIt is a priori clear for anyone who knows this author that the book contains numerous interesting and striking remarks, careful analyses of work by other authors\n(\ne.g.\nKeynes\n, Von Kries, Hempel\n)\nand that it is based on an extensive knowledge, a profound power of analysis and an astonishing patience. The more painful it is for a reviewer, if he feels obliged to state that he is not altogether satisfied with the result of so laborious an enterprise. In the first place the logical exactitude is not always such as would be expected in a book in which so much use is made of symbolic logic. ... Also among the philosophical rather than logical statements several occur which in many books by less important and less influential authors might be tolerated, but which on the high level of Carnap's work may not be overlooked.\nAfter World War II, probability and statistics were certainly not van Dantzig's only interest for he continued to think about significes. Of course, as we have seen above, these interests overlapped markedly. Some of his papers in the area of significes are\nMathematics, logic, and empirical science\n(\nDutch\n)\n(1946)\n,\nGeneral Procedures of Empirical Science\n(1947)\n,\nSignifies, and its relations\n(1949)\n,\nSome Informal Information on \"Information\"\n(1953\n-\n55)\n, and\nMannoury's Impact on Philosophy and Significs\n(1956\n-\n58)\n. He begins the\n1947\npaper as follows:-\nSome philosophers define the term \"Science\" as a system of words and symbols, delimitated by certain formal conditions\n(\nformal attitude\n)\n. Instead of this, we prefer to use the term \"science\" for a system of human activities delimitated from other human activities by careful observation of the cases where the term is actually used in current language\n(\nsignifical attitude\n)\n.\nFor someone who trained in Amsterdam alongside\nBrouwer\n, it is not surprising that van Dantzig was interested in intuitionistic mathematics. For example he published papers on this topic such as:\nA remark and a problem concerning the intuitionistic form of Cantor's intersection theorem\n(1942)\n,\nOn the principles of intuitionistic and affirmative mathematics\n(1947)\n, and\nMathématique stable et mathematique affirmative\nⓉ\n(\nStable mathematics and affirmative mathematics\n)\n(1951)\n.\nWe have still to look at the last project that van Dantzig worked on which was an application of mathematics to a very important problem, namely that of flooding. The paper\n[\n21\n]\nexplains why the problem became important:-\nOn February\n1\n,\n1953\nthe Southwestern part of the Netherlands, and, to a smaller extent, parts of England and Belgium, were struck by a disastrous flood the height of which exceeded by far the highest which hitherto was known in the history of our country. According to the data given by A G Maris, there was a loss of over\n1\n,\n800\nhuman lives, over\n150\n,\n000\nhectares of land were flooded, about\n9\n,\n000\nbuildings were demolished and\n38\n,\n000\ndamaged, there were\n67\nbreaks of dikes, and hundreds of kilometers of dikes were heavily damaged. ... The government rapidly appointed a committee, consisting of prominent hydraulic engineers under the chairmanship of A G Maris, in order to design measures for preventing similar disasters in the future.\nThis committee looked for advice from several scientific institutions, one of these being van Dantzig's Mathematical Centre at Amsterdam. He writes\n[\n21\n]\n:-\nThe mathematical problems raised by the flood fall into three categories:\n(1)\nstatistical problems,\n(2)\nhydrodynamic problems, and\n(3)\neconomic decision problems. The hydrodynamic problems, which concern the height of sea level that a storm of a given type can cause, are here left completely out of account. I shall also not go far into the statistical problems, although something must be said about them in order for one to understand the economic problems, concerning the heightening of existing dikes, which form the subject matter of this article.\nThe paper\n[\n21\n]\nlooks at the areas that would benefit from a mathematical treatment. Van Dantzig had already addressed the International Congress of Mathematicians held in Amsterdam in September\n1954\nwhen he gave the plenary address\nMathematical Problems Raised by the Flood Disaster\n1953\n. The report produced by the Mathematical Centre certainly looked at all three categories of problems that he mentions in the above quote and it was still being checked over by van Dantzig at the time of his death. Papers by van Dantzig and H A Lauwerier published after his death resulting from this major investigation were\nThe North Sea problem. I. General considerations concerning the hydrodynamical problem of the motion of the North Sea\n(1960)\nand\nThe North Sea problem. IV. Free oscillations of a rotating rectangular sea\n(1960)\n."
}