{
  "nome_completo": "Deane Montgomery",
  "nome_curto": "Deane Montgomery",
  "ano_nascimento": "1909",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montgomery/",
  "lugar_nascimento": "Weaver, Minnesota, USA",
  "lugar_morte": "Chapel Hill, North Carolina, USA",
  "biografia": "Deane Montgomery\n's parents were Richard Montgomery and Florence Hitchcock. He was brought up on a farm. He studied at Hamline University, Saint Paul, Minnesota. This was the first institution of higher education in Minnesota, founded by Methodists. He was awarded a B.S. in\n1929\nand then went to the University of Iowa where he was awarded a Master's Degree in\n1930\nand his doctorate in\n1933\n. His thesis advisor at Iowa was Edward W Chittenden and his thesis was on point-set topology. His first few papers reflect the material of his thesis:\nSections of point sets\n(1933)\n; and\nProperties of Plane Sets and Functions of Two Variables\n(1934)\n.\nOn\n14\nJuly\n1933\nMontgomery married Katharine Fulton. In\n1933\n-\n34\nhe was National Research Council Fellow at Harvard. He said in an interview with\nAlbert Tucker\n:-\nWe had a private study group consisting of\nNorman Steenrod\n, myself,\nGarrett Birkhoff\n, and M R Hestenes. Just about that group.\nSolomon Lefschetz\n's book was in existence, and we thought of reading that, but we found it was too hard for us. So we began with\nOswald Veblen\n's Analysis Situs. We read all of that, and we read some other things too.\nIn\n1934\n-\n35\nMontgomery was National Research Council Fellow at Princeton having decided to make a change from Harvard:-\nThe Institute had started the year before, and all the mathematics of the Institute was combined with that of the University in Fine Hall. It was a little crowded, but I found the whole thing an extremely pleasant experience ... At that time my main interest was in a form of set theory. I was especially interested in\nBorel\nsets, analytic sets, and projective sets ...\nIn\n1935\nhe was appointed as an assistant professor at Smith College being promoted to associate professor in\n1938\nand then full professor in\n1941\n. In fact he was offered an assistant professorship at Harvard in\n1938\nbut he chose to remain at Smith College. He was a Guggenheim fellow at the Institute for Advanced Study during\n1941\n-\n42\n. After returning to Smith College in\n1942\n, he was back at Princeton in\n1943\nto teach Army students. He undertook other war work at that time working with\nvon Neumann\non numerical analysis:-\nI never worked very hard on that; by that I mean that I tried to do it in a conscientious way, but in my spare time I always thought about something else. In general, my experience with war work was like that: I didn't really want to think about it much, but I tried to be, conscientious about it even while I tried to keep on with what I was really interested in.\nIn\n1946\nMontgomery left Smith College and accepted an appointment as an associate professor at Yale University. He was at Yale for two years but the atmosphere there was not particularly good:-\nWhen I was at Yale it was emerging from quite an old period. There were some good mathematicians there, certainly, but there wasn't an overwhelming number. There was a great feud going on at Yale, which had gone way back in history before many of the participants then were there even. I was the only one on speaking terms with everyone in the department when I was there.\nMontgomery returned to the Institute for Advanced Study in\n1948\nas a permanent member, becoming a professor in\n1951\n. He remained at the Institute until he retired in\n1980\n. He and his wife Kay\n(\nKatharine\n)\nhad one daughter Mary and one son Richard. In\n1988\nDeane and Kay Montgomery moved to Chapel Hill to be near to their daughter Mary Heck and their two granddaughters.\nHis research interests included algebraic and geometric topology and he made major advances to transformation groups. For many years he was at the centre of activity in topology at the Institute for Advanced Study. His interests turned from point-set topology to transformation groups quite early in his career and he published a series of papers on the topic in collaboration with\nLeo Zippin\n. These include:\nPeriodic one-parameter groups in three-space\n(1936)\n;\nTranslation Groups of Three-Space\n(1937)\n;\nCompact Abelian transformation groups\n(1938)\n;\nNon-Abelian Compact Connected Transformation Groups of Three-Space\n(1939)\n;\nA theorem on the rotation group of the two-sphere\n(1940)\n;\nTopological group foundations of rigid space geometry\n(1940)\n;\nTopological transformation groups. I\n(1940)\n; and\nA theorem on Lie groups\n(1942)\n.\nThe problem which interested them was\nHilbert\n's Fifth Problem:-\nA connected locally compact group G is a projective limit of a sequence of\nLie\ngroups; and, if G has no small subgroups, then it is a\nLie\ngroup.\nThis problem had been investigated by many mathematicians such as\nChevalley\n,\nGleason\n,\nIwasawa\n, Kuranishi,\nPontryagin\n,\nvon Neumann\nand\nYamabe\n. Montgomery solved\nHilbert\n's Fifth Problem in dimension three in\n1948\n. By\n1952\nMontgomery had solved\nHilbert\n's Fifth Problem with the assumption of finite dimensionality and this restriction was finally removed by\nYamabe\nwho began working as Montgomery's assistant in\n1952\n. In\n1955\n, in collaboration with\nLeo Zippin\n, Montgomery published the monograph\nTopological transformation groups\n.\nIwasawa\n, himself a contributor to the solution of\nHilbert\n's Fifth Problem, wrote in a review:-\nAlmost two decades have passed since publication of the first edition of\nPontryagin\n's \"Topological groups\" which has been since considered as one of the standard reference books in the field. In the meantime, the theory of topological groups has made outstanding progress, culminating in the solution of\nHilbert\n's fifth problem by\nGleason\nand by the authors of the present book. The authors give here a detailed account of those important results on locally compact topological groups obtained in this period, suggesting at the same time further future developments in the theory. The book is divided roughly into three parts; in the first two chapters, the authors give those results on topological groups which were obtained in what they call the classical period\n(\nending around\n1935)\n, thus preparing for the succeeding chapters. The next two chapters are devoted to the study of the structure of locally compact groups which leads to a solution of\nHilbert\n's problem. In the last two chapters, the authors discuss the properties of transformation groups acting on various spaces. Here the results are not yet as conclusive as those of the preceding chapters, but even so, the reader may find there fundamental theorems on transformation groups which the reader himself may use as a basis for further investigation of this yet unexploited territory in mathematics.\nIn\n[\n3\n]\nFintushel comments on important work which Montgomery undertook later in his career:-\nIn a long series of papers written in the late\n1960\ns and early\n1970\ns,\n[\nMontgomery and C T Yang\n]\nused the study of group actions on homotopy\n7\n-spheres to showcase and test the growing new techniques of differential topology, especially index theory and surgery theory. At a time when much work in topology consisted in building these machines, their papers demonstrated the beauty of applying this theory to unfurl complexities of symmetry and structure.\nMontgomery received many honours for his contributions. He was awarded honorary doctorates from Hamline University\n(1954)\n, Yeshiva University\n(1961)\n, Tulane University\n(1967)\n, the University of Illinois\n(1977)\n, and the University of Michigan\n(1986)\n. He served the\nAmerican Mathematical Society\nas Vice-President\n(1952\n-\n53)\nand President\n(1961\n-\n62)\n. He was awarded the Leroy P Steele Prize for Lifetime Achievement by the\nAmerican Mathematical Society\nin\n1988\nfor his lasting impact on mathematics, particularly mathematics in America. He also served as President of the\nInternational Mathematical Union\n(1974\n-\n78)\n. Montgomery was elected a member of the\nNational Academy of Sciences\nof the United States in\n1955\nand the\nAmerican Academy of Arts and Sciences\nin\n1958\n.\nAs to Mongomery's character, and the influence he had on his students and colleagues, we quote from Fintushel\n[\n3\n]\n:-\nHe was justly famous for his efforts in helping young topologists and, more generally, making all visitors feel welcome at the Institute. He was especially ardent at searching for students like myself from smaller, less prestigious graduate programs and encouraging their careers. In\n1979\n-\n1981\n, I was fortunate to serve as Deane Montgomery's assistant. ... During our weekly sessions I learned much about this remarkable man. ... there are certain basic aspects of these conversations that I will never forget - Deane's love of mathematics and his joy at the success of others, his gentleness and personal humility, his abhorrence of pretence in any form, his pride in the Institute and conviction to uphold its standards. Most of all, he absolutely never gave false praise.\nArmand Borel\nexpresses similar views in\n[\n2\n]\n:-\nHe was always seeking out and encouraging young mathematicians. He and his wife Kay would regularly and very warmly receive the visiting members at their home. Maybe remembering his own beginnings in an out of the way place, he had a special interest, and talent, in finding out people with considerable potential among some applicants from rather isolated places about whom not much was available."
}