{
  "nome_completo": "Democritus of Abdera",
  "nome_curto": "Democritus",
  "ano_nascimento": "460 BC",
  "ano_morte": "370 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Democritus/",
  "lugar_nascimento": "Abdera, Thrace, Greece",
  "lugar_morte": null,
  "biografia": "Democritus of Abdera\nis best known for his\natomic theory\nbut he was also an excellent geometer. Very little is known of his life but we know that\nLeucippus\nwas his teacher.\nDemocritus certainly visited Athens when he was a young man, principally to visit\nAnaxagoras\n, but Democritus complained how little he was known there. He said, according to\nDiogenes Laertius\nwriting in the second century AD\n[\n5\n]\n:-\nI came to Athens and no one knew me.\nDemocritus was disappointed by his trip to Athens because\nAnaxagoras\n, then an old man, had refused to see him.\nAs Brumbaugh points out in\n[\n3\n]\n:-\nHow different he would find the trip today, where the main approach to the city from the northeast runs past the impressive \"Democritus Nuclear Research Laboratory\".\nCertainly Democritus made many journeys other than the one to Athens.\nRussell\nin\n[\n9\n]\nwrites:-\nHe travelled widely in southern and eastern lands in search of knowledge, he perhaps spent a considerable time in Egypt, and he certainly visited Persia. He then returned to Abdera, where he remained.\nDemocritus himself wrote\n(\nbut some historians dispute that the quote is authentic\n)\n(\nsee\n[\n5\n]\n)\n:-\nOf all my contemporaries I have covered the most ground in my travels, making the most exhaustive inquiries the while; I have seen the most climates and countries and listened to the greatest number of learned men.\nHis travels certainly took him to Egypt and Persia, as\nRussell\nsuggests, but he almost certainly also travelled to Babylon, and some claim he travelled to India and Ethiopia. Certainly he was a man of great learning. As\nHeath\nwrites in\n[\n7\n]\n:-\n... there was no subject to which he did not notably contribute, from mathematics and physics on the one hand to\nethics\nand poetics on the other; he even went by the name of 'wisdom'.\nAlthough little is known of his life, quite a lot is known of his physics and philosophy. There are two main sources for our knowledge of his of physical and philosophical theories. Firstly\nAristotle\ndiscusses Democritus's ideas thoroughly because he strongly disagreed with his ideas of atomism. The second source is in the work of\nEpicurus\nbut, in contrast to\nAristotle\n, Epicurus is a strong believer in Democritus's atomic theory. This work of Epicurus is preserved by Diogenes Laertius in his second century AD book\n[\n5\n]\n.\nCertainly Democritus was not the first to propose an atomic theory. His teacher\nLeucippus\nhad proposed an atomic system, as had\nAnaxagoras\nof Clazomenae. In fact traces of an atomic theory go back further than this, perhaps to the Pythagorean notion of the regular solids playing a fundamental role in the makeup of the universe. However Democritus produced a much more elaborate and systematic view of the physical world than had any of his predecessors. His view is summarised in\n[\n2\n]\n:-\nDemocritus asserted that space, or the Void, had an equal right with reality, or Being, to be considered existent. He conceived of the Void as a vacuum, an infinite space in which moved an infinite number of atoms that made up Being\n(\ni.e. the physical world\n)\n. These atoms are eternal and invisible; absolutely small, so small that their size cannot be diminished\n(\nhence the name atomon, or \"indivisible\"\n)\n; absolutely full and incompressible, as they are without pores and entirely fill the space they occupy; and homogeneous, differing only in shape, arrangement, position, and magnitude.\nWith this as a basis to the physical world, Democritus could explain all changes in the world as changes in motion of the atoms, or changes in the way that they were packed together. This was a remarkable theory which attempted to explain the whole of physics based on a small number of ideas and also brought mathematics into a fundamental physical role since the whole of the structure proposed by Democritus was quantitative and subject to mathematical laws. Another fundamental idea in Democritus's theory is that nature behaves like a machine, it is nothing more than a highly complex mechanism.\nThere are then questions for Democritus to answer. Where do qualities such as warmth, colour, and taste fit into the atomic theory? To Democritus atoms differ only in quantity, and all qualitative differences are only apparent and result from impressions of an observer caused by differing configurations of atoms. The properties of warmth, colour, taste are only by convention - the only things that actually exist are atoms and the Void.\nDemocritus's philosophy contains an early form of the conservation of energy. In his theory atoms are eternal and so is motion. Democritus explained the origin of the universe through atoms moving randomly and colliding to form larger bodies and worlds. There was no place in his theory for divine intervention. Instead he postulated a world which had always existed, and would always exist, and was filled with atoms moving randomly. Vortex motions occurred due to collisions of the atoms and in resulting vortex motion created differentiation of the atoms into different levels due only to their differing mass. This was not a world which came about through the design or purpose of some supernatural being, but rather it was a world which came about through necessity, that is from the nature of the atoms themselves.\nDemocritus built an ethical theory on top of his atomist philosophy. His system was purely deterministic so he could not admit freedom of choice to individuals. To Democritus freedom of choice was an illusion since we are unaware of all the causes for a decision. Democritus believed that\n[\n3\n]\n:-\n... the soul will either be disturbed, so that its motion affects the body in a violent way, or it will be at rest in which case it regulates thoughts and actions harmoniously. Freedom from disturbance is the condition that causes human happiness, and this is the ethical goal.\nDemocritus describes the ultimate good, which he identifies with cheerfulness, as:-\n... a state in which the soul lives peacefully and tranquilly, undisturbed by fear or superstition or any other feeling.\nHe wanted to remove the belief in gods which were, he believed, only introduced to explain phenomena for which no scientific explanation was then available.\nVery little is known for certainty about Democritus's contributions to mathematics. As stated in the Oxford Classical Dictionary :-\nLittle is known\n(\nalthough much is written\n)\nabout the mathematics of Democritus.\nWe do know that Democritus wrote many mathematical works. Diogenes Laertius\n(\nsee\n[\n5\n]\n)\nlists his works and gives Thrasyllus as the source of this information. He wrote\nOn numbers, On geometry, On tangencies, On mappings, On\nirrationals\nbut none of these works survive. However we do know a little from other references.\nHeath\n[\n7\n]\nwrites:-\nIn the Method of\nArchimedes\n, happily discovered in\n1906\n, we are told that Democritus was the first to state the important propositions that the volume of a cone is one third of that of a cylinder having the same base and equal height, and that the volume of a pyramid is one third of that of a prism having the same base and equal height; that is to say, Democritus enunciated these propositions some fifty years or more before they were first scientifically proved by\nEudoxus\n.\nThere is another intriguing piece of information about Democritus which is given by\nPlutarch\nin his\nCommon notions against the\nStoics\nwhere he reports on a dilemma proposed by Democritus as reported by the Stoic\nChrysippus\n(\nsee\n[\n7\n]\n,\n[\n10\n]\nor\n[\n11\n]\n)\n.\nIf a cone were cut by a plane parallel to the base\n[\nby which he means a plane indefinitely close to the base\n]\n, what must we think of the surfaces forming the sections? Are they equal or unequal? For, if they are unequal, they will make the cone irregular as having many indentations, like steps, and unevennesses; but, if they are equal, the sections will be equal, and the cone will appear to have the property of the cylinder and to be made up of equal, not unequal, circles, which is very absurd.\nThere are important ideas in this dilemma. Firstly notice, as\nHeath\npoints out in\n[\n7\n]\n, that Democritus has the idea of a solid being the sum of infinitely many parallel planes and he may have used this idea to find the volumes of the cone and pyramid as reported by\nArchimedes\n. This idea of Democritus may have led\nArchimedes\nlater to apply the same idea to great effect. This idea would eventually lead to theories of integration.\nThere is much discussion in\n[\n7\n]\n,\n[\n8\n]\n,\n[\n10\n]\nand\n[\n11\n]\nas to whether Democritus distinguished between the geometrical continuum and the physical discrete of his atomic system.\nHeath\npoints out that if Democritus carried over his atomic theory to geometrical lines then there is no dilemma for him since his cone is indeed stepped with atom sized steps.\nHeath\ncertainly believed that to Democritus lines were infinitely divisible. Others, see for example\n[\n10\n]\n, have come to the opposite conclusion, believing that Democritus made contributions to problems of applied mathematics but, because of his atomic theory, he could not deal with the\ninfinitesimal\nquestions arising."
}