{
  "nome_completo": "Derek Arthur Waller",
  "nome_curto": "Derek Waller",
  "ano_nascimento": "1941",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Waller/",
  "lugar_nascimento": "Dinnington, near Sheffield, South Yorkshire, England",
  "lugar_morte": "Swansea, Wales",
  "biografia": "Derek Waller\nattended Dinnington Primary School, in his home town of Dinnington. This town, about\n20\nkm from Sheffield and\n16\nkm from Rotherham, had a population of about\n7\n,\n500\nwhen Waller was born there. After completing his primary education, he went to Maltby Grammar School which had opened in\n1932\n. Its first headmaster was Gerald Rush and he was still the headmaster when Waller studied there.\n(\nMaltby is about\n7\nkm from Dinnington.\n)\nHe graduated from Maltby Grammar School in\n1959\nand in the October of that year he began his study of mathematics at the University of Liverpool. There he was a resident of Rathbone Hall.\nGeoffrey Walker\nhad been appointed as Professor of Pure Mathematics at the University of Liverpool in\n1952\n. He taught Waller during his undergraduate years at Liverpool and, although Waller did not shine in the B.Sc. degree examinations, nevertheless\nWalker\nwas convinced that Waller had the potential to produce good research work in mathematics. Ronnie Brown had studied at Oxford University and had been appointed as an assistant lecturer at the University of Liverpool while still working for his doctorate at Oxford. When Ronnie Brown was awarded his Ph.D. with his thesis\nSome Problems in Algebraic Topology: Function Spaces and FD Complexes\nin\n1962\nhe was promoted to a lecturer at Liverpool.\nWalker\nsuggested that Brown might take Waller on as his first Ph.D. student and so, after the award of his B.Sc., Waller began research at Liverpool for his doctorate. His research was in Brown's area of interest, namely\nalgebraic topology\n.\nIn\n1965\n, after completing three years as a research student, Waller was appointed to the University College of Swansea\n(\nsince\n2007\nit has adopted the name Swansea University\n)\n. Waller had married Susan and they set up home in Swansea. Their original plan was to stay in Swansea for two years but the many attractions that city had to offer meant that they found it impossible to leave. Susan taught at Gowerton Girls' Grammar school until the birth of their three children. Waller's first appointment was as an assistant lecturer but in\n1967\nhe was promoted to lecturer. During his two years as an assistant lecturer, Waller continued to work on his Ph.D. thesis\nThe Topology of Homotopy Bundles\nwhich he submitted to the University of Liverpool in June\n1967\n. Some corrections were required by the examiners and he resubmitted the thesis in December\n1968\n, graduating with his Ph.D. in the following year. He submitted his paper\nOn the Weak Covering Homotopy Property\nto\nMathematische Zeitschrift\nin November\n1971\n. This paper, based material from his thesis, was published in\n1972\n. Waller gives the following acknowledgement:-\nThe author is indebted to Professor R Brown for his advice during the work involved.\nNorman Biggs writes in\n[\n1\n]\n:-\nDerek Waller was a lively and respected member of the Department of Pure Mathematics at Swansea. His administrative talents were soon recognised and put to good use, and, more significantly, he began to develop as a mathematician in his own right. In\n1969\n/\n70\nhe played a major part in a seminar on category theory and was coauthor of a set of lecture notes entitled 'An introduction to categories and the representation of functors'. Around this time he also became interested in the applications of linear algebra in graph theory. Thus, beginning in\n1973\n, he produced a steady stream of publications in which ideas from category theory, algebra and graph theory are intermingled. He lectured at conferences in Rome, Amsterdam and Paris, and at the British Combinatorial Conferences held in Aberystwyth\n(1973)\n, Aberdeen\n(1975)\nand Royal Holloway College\n(1977)\n. Because of the neatness of his work, and his attractive style of presentation, his talks were always among the highlights of these occasions.\nWaller's talk at the British Combinatorial Conferences held in Aberystwyth in\n1973\nwas written up as\nEigenvalues of graphs and operations\nand published in the conference proceedings. It became his first publication on graph theory. In this paper he found expressions for the eigenvalues of certain graphs constructed using graphical operations. The most important of these is the join of\nn\nn\nn\nregular graphs. In the above quote by Norman Biggs, there is a reference to Waller lecturing in Rome. This was at the 'Colloquio Internazionale sulle Teorie Combinatorie' held in Rome in\n1973\n. At this conference Waller gave the lecture\nRegular eigenvalues of graphs and enumeration of spanning trees\nand we give now his own introduction:-\nThe theory of eigenvalues of graphs assigns to each finite graph an isomorphism invariant, viz., the spectrum\n(\ni.e., set of eigenvalues\n)\nof the adjacency matrix of the graph. Besides its intrinsic interest, this theory has applications to other aspects of graph theory, especially in the case of regular graphs. Our object is to introduce an isomorphism invariant for a graph, which we call its regular spectrum\n(\nof regular eigenvalues\n)\n, which provides many advantages over the usual theory of eigenvalues. Geometrical relations between graphs\n(\ne.g., complementation, join, cone\n)\nare reflected in the properties of the regular spectrum\n(\nbut not the 'usual' spectrum, except in the case of regular graphs\n)\n. In short, the regular spectrum extends to irregular graphs some of the pleasant algebra enjoyed by regular graphs. Moreover, computer investigations suggest that the regular spectrum is 'more discriminating' than the usual spectrum.\nHis next paper,\nDouble covers of graphs\n, was published in\n1976\n. Waller writes:-\nIn this paper a category-theoretical approach to graphs is used to define and study such double cover projections.\nNorman Biggs, in a review of the paper, writes:-\nThe author uses the terminology of category theory to discuss double coverings of graphs. For example, he shows that for each\nn\nn\nn\nthere is a universal double cover projection\np\nU\np_{U}\np\nU\n​\nsuch that any double covering of an\nn\nn\nn\n-colourable graph can be expressed as a pull-back of\np\nU\np_{U}\np\nU\n​\n. The interesting question of the number of distinct\n(\nnon-isomorphic\n)\ndouble coverings of a given graph is raised, and some preliminary results are obtained.\nHe continued to study pullbacks and gave a lecture on his results at the British Combinatorial Conferences held in Aberdeen in\n1975\n. The talk was written up for the conference proceedings as\nPullbacks in the category of graphs\n. Ernest Gene Manes writes in a review:-\nThe author shows that, in the category of finite undirected graphs, decomposability into a disjoint union is stable under finite products and pulling back under double cover projection.\nIn\n[\n1\n]\nNorman Biggs explains the direction that his graph theory research led him:-\nIn his last years he became interested in applications of graph theory, particularly in chemistry\n[\n'Eigenvalue methods for irregular graphs with application to spanning tree enumeration in molecular graphs'\n(1976)\n, 'Covering projections of chemical reaction graphs'\n(1978)\n, 'On the quest for an isomorphism invariant which characterises finite chemical graphs'\n(1978)]\nand electrical engineering\n[\n'Products of graph projections as a model for multistage communication networks'\n(1976)\n, 'General solution to the spanning tree enumeration problem in arbitrary multigraph joins'\n(1976)\n, 'A graph-theoretical model for telecommunications networks'\n(1978)]\n. His earlier work was ripe for application in these fields. One important problem which concerned him was the estimation of the reliability of the large networks used in telecommunications systems. It seems that it is not possible to give a theoretical analysis in general, but that the problem might be amenable if the networks were constructed by the kind of product operation dealt with in his 'categorical' work. By his training and by his nature, he was attracted to such problems ...\nLet us quote Waller's own summary of his paper\nProducts of graph projections as a model for multistage communication networks\n(1976)\n:-\nThe multistage graph provides an underlying structure for conventional telephone networks. A systematic analysis in terms of channel graphs and terminal graphs is carried out using products of graph projections. A unified theory emerges and facilitates the synthesis and study of multistage switched networks of high connectivity.\nOne of his last papers was\nGraph-theoretical models with products and projections\n(1978)\nand again we give here his own summary:-\nMost of the well-known applications of graph theory in operations research involve the use of one graph at a time, portraying combinatorial aspects of some problem. The object of this paper is to propose graph-theoretic models which permit the study of two or more features of a problem simultaneously. Attention is drawn to the appropriate 'product' concept for combining a number of graphs, and 'projections' which can facilitate the analysis of a large graph by relating it to a smaller one. Examples are given in which this type of graph theory has already proved to be applicable.\nDerek Waller died from leukaemia in June\n1978\n, four days after his\n37\nth\nbirthday.\nAfter Waller's death, his wife Susan continued to teach at what was the West Glamorgan Institute and at Gorseinon College. She married Alan D Thomas who was appointed to the Mathematics Department at Swansea in\n1971\n. Alan Thomas had published the paper\nEmbeddings of covering projections of graphs\n(1980)\ncoauthored with Derek Waller and Francis W Clarke. Let us note that Susan was Lord Mayor of Swansea in\n2007\n."
}