{
  "nome_completo": "Donald Watts Davies",
  "nome_curto": "Donald Davies",
  "ano_nascimento": "1924",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davies_Donald/",
  "lugar_nascimento": "Treorchy, Rhondda Valley, Wales",
  "lugar_morte": "Esher, Surrey, England",
  "biografia": "Donald Davies\nwas the son of John Watts Davies\n(1899\n-\n1925)\n, a colliery pay clerk, and Hilda Stebbens\n(1900\n-\n1988)\n. John and Hilda were married in July\n1923\nat Portsmouth, Hampshire. We give Donald Davies' own description of his background and early years, adding a few details\n(\nsee for example\n[\n18\n]\n)\n:-\nI was born in Treorchy, in the Rhondda valley in Wales on the\n7\nth of June\n1924\n, together with a twin sister, Marion Ivey, who became a classics scholar and teacher. Our Welsh grandmother\n(\nor Mamgu\n)\n[\nMargaret Ann Davies née Evans\n(1865\n-\n1948)]\ntold me that I was born in bad shape and the doctor put me on one side, saying that 'one was enough'; that she saw me move and was determined that I should survive, which evidently I did. Knowing Mamgu's character this is probably an accurate account.\nOur mother came from Portsmouth. Her family, called Stebbens, descended from fishermen at Maldon in Essex and was probably named after the village of Stebbing. They moved first to south-east London\n[\nBermondsey\n]\n, then on to Portsmouth, working as shipwrights. Maternal grandfather\n[\nDick Stebbens\n(1874\n-\n1907)]\nfell into a dock and was drowned in\n1907\n.\nOur Welsh grandfather\n(\nor Dadcu\n)\n[\nGriffith Davies\n(1864\n-\n1944)]\nwas a coalminer and father was a clerk at a coal mine. In July\n1925\nhe died\n[\nfrom gastro-enteritis\n]\nand soon afterwards our mother with her small twins moved back to Portsmouth to live with her mother\n[\nBessie Stebbens\n]\nand sister.\nMy first memories are of a small street house\n[\n158\nTalbot Road\n]\nwith trams passing by. The trams waited at a crossing place in the middle of the street before going on to Bradford Junction, where several tram lines met. Their clanking and squealing was a familiar and homely sound. Other early memories are of train journeys to Newport, a small village in Pembrokeshire, south west Wales. Mamgu and Dadcu had retired there, living near the smallholding close to Newport Castle which was farmed by their daughter and son-in-law. There was a working water mill, grinding flour, which had large wooden gears. Staying on the farm was a great thrill for us and the foreign language\n(\nWelsh\n)\nthat was spoken around there made it an exotic place.\nWe were Baptists and, I suppose, somewhat strict because any work on Sunday was sinful - I secretly mended a lawnmower on a Sunday and felt very sinful. But I must have demanded rational explanations at an early age. Before going to sleep one night I was wondering whether the existence of God was verifiable, through some phenomenon that required a God, such as real miracles. I could think of one good example: before a couple could have babies they had to be married in Church. This piece of experimental evidence rather pleased me.\nIn Portsmouth, Donald's mother worked for the Post Office and this gave him an early interest in telephone networks. As a young boy, he even designed relay circuits although there was no way he could build them.\nAfter primary school, Davies attended the Southern Grammar School for Boys in Portsmouth which had been founded in\n1888\n. On\n1\nSeptember\n1939\n, anticipating the outbreak of war, the schoolboys went by train to Salisbury, then by coach to Brockenhurst, where the County School at Brockenhurst had agreed to host their evacuation. Before they even reached Brockenhurst, they were told the war had started. While at Brockenhurst, he sat scholarship examinations but was not entirely confident of success\n[\n18\n]\n:-\nAs insurance he also took the exam for apprenticeship in Portsmouth dockyard and passed it despite having to note on the paper that the reason it was so dirty was the dust coming out of his hair - the previous night a parachute bomb had exploded very near his house. He did not need the insurance; in fact he had a choice of universities, and went to Imperial College in London to read physics.\nIn\n1943\nDavies was awarded a B.Sc. with First Class Honours in Physics from Imperial College London. World War II meant that after graduating he had to undertake National Service and was sent to Birmingham to work on the atomic bomb with a group led by\nRudolf E Peierls\n[\n1\n]\n:-\n... at the time you were immediately drafted to a wartime project. It was Sloane who was the chairman of the committee who did this allocation, and I was sent off to Birmingham University to work on a \"Tube Alloys\" project. Now that was interesting in a way because it involved a lot of numerical calculations and I spent most of my time supervising groups of computers, who were people with Brunsvigas and electric calculators. So obviously the need for more rapid and efficient calculation was ground into me during that time.\nHis work was supervised by\nKlaus Fuchs\nand part of his duties were in Billingham working on uranium separation at Imperial Chemical Industries. He was appalled at the conditions in Billingham writing:-\nIn the factory,\nN\nO\n2\nNO_{2}\nN\nO\n2\n​\ngas and steam combined to rain nitric acid in some areas. The workers' clothes had faded and rotting shoulders could be seen on the clothes of some. An awful explosion happened and frequent loss of life attended this work. A small gang of painters was struck down and killed by ammonia gas, for example. A man dropped into an unprotected manhole and went through a pump one night.\nAfter the war ended in\n1945\n, Davies was able to return to Imperial College, having one remaining year of his State Scholarship, and now study for a degree in mathematics. In\n1947\nhe was awarded a B.Sc. with First Class Honours in Mathematics from Imperial College. He was awarded the Lubbock memorial prize as the leading mathematician of his year at London University\n[\n1\n]\n:-\nI went back to Imperial College after the war to take a degree in mathematics, which you could do with comparatively little extra effort. It was an applied mathematics type of degree. That's also significant in that\nHyman Levy\ntaught numerical analysis and inspired people with a real interest in numerical analysis which was not much studied before the war in universities - it was treated as a rather ordinary sort of subject. He was really very interesting and so I had some further involvement in numerical work at that time. During that time\nNorbert Weiner\ncame to lecture there and I went to his lecture and was very inspired by it.\nWhile he was reading for his mathematics degree at Imperial College,\nJohn Womersley\nwho was the Superintendent of the Mathematics Division at the National Physical Laboratory\n(\nNPL\n)\n, gave a lecture at Imperial College\n[\n1\n]\n:-\nA lot of things certainly inspired me to take an interest\n[\nin calculating machines\n]\n, but also the head of the maths division at NPL,\nJohn Womersley\n, came down and gave a talk. After the talk I realised that there was an opportunity to get into this very interesting business, and went up to him at the lecture and said \"Well, how can I get to NPL?\", and I came down here and was interviewed and so on, and that's how I got to NPL.\nArriving at the National Physical Laboratory in Teddington in September\n1947\n, Davies worked on the ACE Pilot Model which was being built following plans set out by\nAlan Turing\n. Davies worked in\nTuring\n's group and, although he had great admiration for\nTuring\n, he also found him difficult to work with. He writes:-\nMy few contacts with\nTuring\nwere not encouraging. I wanted to talk to him about the remarkable results of his paper 'On computable numbers'. Reading this paper I had found numerous errors in the formal specification of the universal computer. Some were trivial but others were quite subtle and I was not sure that my solutions were correct. When I came to this point,\nTuring\nbecame more and more agitated, until I could see that no sensible discussion was possible. Clearly he felt the errors to be irrelevant and my drawing attention to them rather foolish.\nTuring\nleft the NPL in\n1948\nbut Davies continued to work with a group of mathematicians and engineers on the ACE Pilot Model led by Francis M Colebrook\n(\nborn\n1893)\n. Quite soon, Davies became quite a celebrity. He explains how this came about\n(\nsee\n[\n18\n]\n)\n:-\nA by-product of my electromechanical work was to finalise my quest for a machine to play noughts and crosses. In the evenings I built a machine using Post Office relays. NPL put it forward as an exhibit at the\nRoyal Society\nSoirée in\n1949\n. Its clicking noise and nice display attracted people, so it received more attention than it deserved. I felt rather bad for the other exhibitors with real scientific achievements to show. Next day I was on the 'Daily Express' front page and much more publicity followed. I appeared on TV with Richard Dimbleby at NPL and then at Alexandra Palace, I was interviewed on a children's TV programme with it. This came full circle from the radio children's hour which started off my quest. It was even used as a 'prop' in a popular magic show at Lime Grove Studios. This machine did not use the whole strategy, so I built a second model which was partly electronic, with a wire threaded through magnetic cores to represent each rule. This machine was a regular feature of the NPL children's party. Forty years later I heard that it was being revived\n(\nagain\n)\nfor this party.\nFrancis Colebrook supported Davies for a Harkness Fellowship in\n1954\nwriting\n(\nsee, for example,\n[\n13\n]\nor\n[\n27\n]\n)\n:-\nD W Davies is one of the most brilliant young men I have ever met; outstanding not only in intellectual power but also in the range of his scientific, technical and general knowledge. He is equally unusual in his ability to apply this knowledge to mechanical and electrical design and even to the actual construction of complex equipment. He is, for example, one of the very small number of persons who could draw up a complete logical design of an electronic computer, realise this design in actual circuitry, assemble it himself\n(\nwith a high probability that it would work as designed\n)\nand then programme it and use it for the solution of computational problems.\nWith the Harkness Fellowship, Davies went to the Massachusetts Institute of Technology but this proved an error since all work done there on computers was classified and could not be discussed with foreigners. During this year he was asked to go to India to investigate a request from the Indian Statistical Institute to purchase Russian equipment. He returned to England without spending a full year in the United States since he had promised to marry Diane Lucy Erita Burton. Sailing from New York to Southampton on the\nQueen Mary\n, he arrived on\n21\nMarch\n1955\nand married Diane on\n17\nMay\n1955\n. Donald and Diane Davies lived in Sunbury-on-Thames where they had two sons and a daughter.\nDavies' most significant contribution was to the concept of 'packet switching', a fundamental idea in the development of the Internet. In the interview\n[\n20\n]\nDavies explains how the idea came to him:-\nWe held a two-day seminar, November\n2\nnd and\n3\nrd of\n1965\n. ... We were talking not so much about communications, but about the concept of timesharing and how it affects the way you do computing and that sort of thing. The communications aspects had interested me, because I had a history of interest in telephone switching and things like that. Nothing very much in detail was said at that meeting about solutions to the problem, but several people said how difficult it was; how you could get hour-long telephone calls in which not very much data was transmitted; what you could do about making data communication more efficient and so on. During the meeting, I went home and thought about this, and it seemed to me that since the actual data rate was very variable, which is to say a few bits would pass over and then there'd be a long pause and so on. And I thought rather than opening a bandwidth for the whole time, it was sensible to treat the information in terms of short messages and simply transmit these by store and forward methods from one place to another. I simply sat down and did a few samples on the back of an envelope, literally, to see how this would work out. My first thought was that if you had to store messages and transmit them, there must be a delay, and this might defeat the whole purpose of the thing, which was to have rapid communications. It soon became obvious that this wasn't so, and that if you chose fairly high data rates, by the standards of the day, and fairly short messages, the storage time was so short that it didn't really affect your message delay. Simple idea. I began to work this out.\nThe authors of\n[\n23\n]\ngive details of how the idea progressed:-\nDavies ... was interested in interactive time-sharing systems, which were limited by inadequate data communications. He knew of message switching in the telegraph system and proposed dividing messages into standard sized packets and having a network of small computers to route packets based on information carried in packet headers. This technique, which he called packet switching, was expected to bring down costs. Following public presentation of his ideas, in late\n1965\nand early\n1966\n, Davies became aware of Paul Baran's work ...\n[\nBaran worked at RAND in the United States\n]\n.\nIn December\n1965\n, Davies proposed that the British Post Office Telecommunications should build a prototype network; but NPL, which only had resources to build a small prototype network called the Mark\n1\n... This prototype network was built between\n1966\nand\n1969\n, providing internal services\n[\ncovering\n]\nthe NPL site ... . Its development was described at a\n1968\nconference, two years before similar progress on ARPANET, the precursor to the Internet, was demonstrated ...\nDavies would learn of parallel work going on under the US Department of Defense, funded Advanced Research Project Agency\n(\nARPA\n)\nbanner at a UK symposium and in\n1967\n. By the end of the\n1960\ns, ARPA had funded a variety of time-sharing computers located at universities and other research sites across the US, which ARPANET was to connect. Larry Roberts, who managed the ARPANET project, learned of Mark\n1\nat a\n1967\nsymposium in Gatlinburg in the USA. He adopted Davies' term packet switching and some aspects of the NPL design, when considering the development of ARPANET.\nIn an interview he gave in\n1972\n, Davies explained what he saw as the problem at that time\n(\nsee, for example,\n[\n10\n]\n)\n:-\nIn my view the communication and computer people haven't yet really begun a proper dialogue. They are not yet speaking the same language. The thoughts of the communication people are still rooted in the technology of the telephone network. I think it is necessary, very necessary, for computer people in the future to learn more about the problems of how these networks run so they can really join in this dialogue and in this way we can get the kind of data network that we need.\nDavies authored, or co-authored, four books:\nDigital techniques\n(1963)\n;\n(\nwith D L A Barber\n)\nCommunication networks for computers\n(1973)\n;\n(\nwith D L A Barber, W L Price and C M Solomonides\n)\nComputer networks and their protocols\n(1979)\n; and\n(\nwith W L Price\n)\nSecurity for computer networks\n(1984)\n. The second of these,\nCommunication networks for computers\n, was co-authored with Derek Barber and essentially is a written version of nine three hour lectures he gave on packet switching in Japan in\n1969\n. The last of these books,\nSecurity for computer networks\n, marked the change in Davies' interests where he became interested in applying cryptography to computer security. The publisher of the book writes:-\nThe introduction of information technology into business inevitably leads to its misuse for crime, which data security aims to prevent. This book is concerned with the basic principles of security, including chapters on Open Systems Interconnection, key management and electronic funds transfer.\nDavies retired in\n1984\nbut continued to advise firms on matters of internet security\n[\n18\n]\n:-\nDavies himself lists no less than\n84\nprojects undertaken between\n1984\nand\n1998\n. They range from proposing and documenting a network security policy for a major bank to acting as an expert witness for the defence in a case of alleged conspiracy to defraud a bank using its access network to SWIFT. Davies must have had a very full and busy time.\nThere were, of course, many pleasures associated with his consulting work, one of which was that it gave him the opportunity to travel to many countries. In addition to his love of travel, he loved music especially classical music. His other interests are clear from the Open University courses he studied after his retirement including astronomy, human biology, oceanography, and the history of art.\nAmong the many honours Davies was awarded we mention the John Player Award from the British Computer Society in\n1974\n, a C.B.E. in\n1983\n, the\nJohn von Neumann\nAward from the Hungarian Computer Society in\n1985\n, and his election as a fellow of the\nRoyal Society\nin\n1987\n. Following his death, he shared the inaugural IEEE Internet Award in\n2000\n, he was inducted into the US National Inventors Hall of Fame in\n2007\nand into the Internet Hall of Fame by the Internet Society in\n2012\n. A plaque commemorating his achievements was unveiled in Treorchy on\n25\nJuly\n2013\nand a speech was made by Donald Rhodri Johns\n(\nsee\n[\n13\n]\n)\n. The National Physical Laboratory sent the message:-\nNPL is proud of its legacy in computer science and the role that people like Donald Davies, played in making the United Kingdom a technological world leader and it is a special honour for his birthplace in Treorchy to be recognised with this blue plaque.\nDavies was diagnosed with malignant melanoma and died in the Princess Alice Hospice, Esher, Surrey. Following his death on\n28\nMay\n2000\n, he was cremated on\n6\nJune.\nLet us end this biography with a quote from James Gillies and Robert Cailliau\n[\n9\n]\n:-\nWe learned just before this book went to press that cancer had claimed the life of\n[\none\n]\nof its major characters. Donald Davies was a man who never sought the limelight but who deserves as much as anyone to be thought of as the father of computer communication. An unassuming computer scientist working at the UK National Physical Laboratory, Donald's invention of packet switching is what made the Internet, and ultimately the world wide web, possible."
}