{
  "nome_completo": "Dorothea Beale",
  "nome_curto": "Dorothea Beale",
  "ano_nascimento": "1831",
  "ano_morte": "1906",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beale/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Cheltenham, England",
  "biografia": "Dorothea Beale\n's father was Miles Beale\n(\ndied\n2\nFebruary\n1863)\nwho married Dorothea Margaret Complin\n(\nborn\n5\nMay\n1800)\non\n6\nApril\n1824\nin St Helens, Bishopsgate, London. She was the daughter of Edward Complin, a surgeon, and Elizabeth Harris. Miles Beale, originally from Gloucestershire, was a surgeon who moved to St Helen's parish, Bishopsgate, London in\n1830\n[\n2\n]\n:-\nMiles Beale was a scholar and a practical man of affairs, serious and earnest, a depository of sound wisdom and advice.\nMiles Beale was enthusiastic about English literature, particularly Shakespeare, and he even delivered lectures on Shakespeare in Chelsea. He was also a devout high church Christian bringing up his children to be religious. Miles Beale's wife, Dorothea, had relatives who had a strong influence of the education of the children. Her aunt, Mary Cornwallis, wrote devotional books and Mary's daughter, Caroline Frances Cornwallis\n(1786\n-\n1858)\n, was a student of Latin, Greek and Hebrew who wrote several books on Christianity, education and law.\nMiles and Dorothea Margaret Beale had eleven children, six boys and five girls. Dorothea, the subject of this biography, had two older sisters and one older brother. She was baptised in St Helen's on\n10\nJune\n1831\n. Until the age of seven, Dorothea had lessons with her mother, then with a governess and, when this lady married, her father became her teacher. Dorothea was fortunate as her mother had been brought up in an educated household and was able to assess the quality of a new governess. However, her mother had great difficulties in finding a suitable governess in the early\n1840\ns; upon inspection of the children's exercise books she found so many uncorrected faults that multiple governesses had to be dismissed, with another search often resulting in the same outcome. Up to the age of thirteen, Dorothea was partly educated at home but she also attended a boarding school in Stratford, Essex. She was unimpressed by the teaching at this school writing\n[\n4\n]\n:-\n... the rules of arithmetic were taught, but the principles were never explained.\nAnother aspect of this school to which she objected was the fact that the pupils had to speak French all the time\n[\n2\n]\n:-\nOur thinking power was hindered from developing by intercourse with one another, because we were required to speak in a tongue in which we could indeed talk, but in which conversation was impossible; and the language we spoke was one peculiar to English boarding-schools.\nFor the background to\n19\nth Century women mathematics teachers, and, in particular, the environment in which Beale became a teacher, see\nTHIS LINK\n.\nFrom age thirteen to sixteen Beale educated herself at home. Although Beale's father considered arithmetic to be a waste of time, Beale's parents did not actively prevent her from learning mathematics. So, during her three years of self-education, Beale taught herself arithmetic with Bishop Colenso's\nArithmetic Exercises with Answers\n(1843)\n.\nShe was fortunate in that she had access to two large libraries, the London Institution and Crosby Hall, and she spent much of her time working alone there, making some progress with algebra, and even calculating the distance to the moon. She commented\n[\n4\n]\n:-\nI borrowed a\nEuclid\n, and without any help read the first six books, carefully working through the whole of the fifth, as I did not know what was usually done. It did not occur to ask my father for lessons in such subjects.\nBeale also attended the lectures by the Gresham Professor of Astronomy, Joseph Pullen, at Crosby Hall. These lectures had a substantial impact on her, inspiring a passionate desire to know more about mathematics and the processes described in the lectures.\nBeale's younger brothers attended Merchant Taylor's School, where the education was no better or worse than the other public schools of the time. However the boys\n[\n4\n]\n:-\n... suffered much from the unintelligent teaching prevalent in the boys' school of that day, and received help in their Latin and Mathematics from their clever elder sister.\nAt the age of\n16\n, Beale and her two older sisters were sent to a school for English girls in Paris which was run by Mlle Bray. Despite being considered as offering the best education at the time in both English and French, Beale found the rote learning boring and uninspiring. She found the methods cramping\n[\n2\n]\n:-\nImagine our disgust at being required to read English history in Mrs Trimmer, to learn by heart all Murray's grammar, to learn even lists of prepositions by heart, in order that we might parse without the trouble of thinking. I learned them with such anger that the list was burnt into my brain, and I can say it now . ... I felt oppressed with the routine life; I, who had been able to moon, grub, alone for hours, to live in a world of dreams and thoughts of my own, was now put into a cage and had to walk round and round like a squirrel. I felt thought was killed.\nShe was brought home after the outbreak of the\n1848\nRevolution in France but her experiences at Mlle Bray's school had shaped the teacher that she would become. When Beale returned to England, she began studying at Queen's College, London. It offered formal training for teaching and was important as the first attempt to provide higher education to women. The professors of King's College, London, lectured at Queen's College and certificates of proficiency were given to those women who passed the relevant examinations. Mathematics was Beale's subject of predilection; she received first-class teaching in mathematics from Thomas Astley Cock\n(\napprox\n1811\n-\n1885)\n. In November\n1850\n, Beale received her certificate in Arithmetic, Algebra, Geometry and Trigonometry; her tutor commented that she showed\n[\n2\n]\n:-\n... considerable ingenuity in the application of them to examples and problems.\nShe also qualified to teach English, Latin, French, German and Geography. While at Queen's College\n[\n5\n]\n:-\n... she read, privately, Trigonometry, Conic Sections and Differential Calculus. Soon after she was asked to teach Mathematics and became the first lady Mathematical tutor.\nLater she also taught Latin and was appointed as head teacher of the school attached to the College.\nAt first she was very happy with the teaching at Queen's College but as time went on she became unhappy on two counts. First she felt that there was too great a control from the top giving the women tutors very little authority. Secondly she worried about the policy of allowing students to enter who were poorly qualified. The College appeared to lower the entrance standard required over the years she worked there. In the summer of\n1856\nshe visited schools in Switzerland and Germany seeking to see the methods that were being employed there. On returning to London she discovered that Queen's College had introduced regulations which further curtailed the powers of the women tutors. She resigned her post, but this was not accepted without question and she was asked to give reasons for her resignation. She wrote\n(\nsee for example\n[\n2\n]\n)\n:-\n... by withdrawing pupils from the school, compelling them without my consent and contrary to the wishes of the parents to attend College classes, although they are unable spell correctly and are ignorant of the first principals of grammar; classes in which ... it is impossible to give the individual attention required by children of twelve, who ... are singularly deficient in mental training, and require to be obliged in extra time to do work given them; to be trained, watched, educated by ladies\n(\nwho alone can understand, and therefore educate girls\n)\n. My pupils in the school are not removed by competent professors who understand the subjects there taught. The instruction is in itself good, and if given four or five years later would be beneficial, but has been rendered useless.\nShe then became Head Teacher at Casterton School in Kirkby Lonsdale, beginning work there in January of\n1857\n, where she taught\n15\nsubjects including mathematics and arithmetic. She was an inspirational teacher and many pupils appreciated\n[\n4\n]\n:-\n... the enormous pains she took to make the lessons intelligible to the dullest; never content to let them merely accept a given fact or explanation, but leading them on step by step to see and comprehend.\nIn\n1858\n, Beale left Casterton due to disagreements with the all male board of governors whom she was required to answer to\n[\n9\n]\n:-\n... she found the philosophical atmosphere to be very rigid and even the architecture of the building itself seemed to her to be unpleasant and unwelcoming. In addition, she was given strict guidelines on what she could teach. She was required to provide lessons in the Bible and Church history, ancient and modern history, physical and political geography, grammar and composition, English literature, Latin, French, German, and Italian. Beale had many ideas for reforms at the school, and she felt that her position of authority there should give her words some weight. She approached school authorities with the ultimatum that if her changes were not accepted, she would quit. Instead of giving in to her demands, the school fired her, and Beale left in defeat.\nIn the summer of\n1858\n, along with\n50\nother applicants, Beale applied for the position of Principal of Cheltenham Ladies' College. She was successful and with her appointment the school rose to fame.\nCheltenham Ladies' College was one of the first girls' schools in England established in\n1854\nwith\n82\npupils who had passed entrance examinations. The founders had based the education at the College on the idea that a girls' role was in the home rather than the professions. However, Beale was of a different opinion, motivated by an ethic of service, she was determined to challenge the perception that girls were biologically incapable of academic study and provide them with the necessary education that would lead to employment. At Cheltenham, women dominated the teaching staff, working without male interference and acting as role models to their pupils. These teachers were middle-class women working in a profession. This would have had a significant impact, as the young girls at Cheltenham would have seen working middle-class women as the norm. Beale strongly believed that women were not destined solely for marriage and domesticity; for women as for men she felt it a sin to bury the talents that God had given them. She immediately imposed herself on the school\n[\n9\n]\n:-\nBeale was an imposing figure on the campus of Cheltenham, invariably appearing in a black wool dress adorned with only a white scarf. An energetic, authoritative woman, she expected her teachers and students to share in her vision of education as a sacred duty and gift. She engaged in both teaching and administrative duties at the school, which at the time of her arrival was suffering from low enrolment and insufficient funding. Beginning with only\n69\nstudents, Beale managed to double that number within four years and secure adequate financial support for the school.\nWhen Beale arrived at Cheltenham in\n1858\n, despite music and drawing being included for all pupils, neither mathematics nor science were taught. Although she wished to introduce geometry in order to teach the girls how to form clear ideas, she recognised that many of the remaining pupils would have been frightened away, as they were constantly hearing that girls would be turned into boys by studying the same subjects. Beale recalled in an\n1888\narticle:-\nI began my innovations with the introduction of scientific teaching, and under the name physical geography I was able to teach a good deal. This subject was unobjectionable, as few boys learnt geography.\nShe was very patient, recognising the importance of teaching mathematics but also of keeping the parents on side, especially in her early days at Cheltenham. After six years she was able to introduce some of the subjects which were considered unsafe for young women, for example mathematics. However, opposition still remained and parents were horrified by the thought that their daughters were being taught mathematics and advanced arithmetic. Since, at this time, mathematics was considered an inappropriate subject for girls, many of the girls starting at Cheltenham, although aged fifteen or sixteen, had received no prior mathematical teaching except a slight knowledge of arithmetical processes. Beale had her work cut out bringing these girls up to standard in mathematics.\nIn the\n19\nth Century, mathematics was split up into three main parts, arithmetic, algebra and geometry. What we would now consider as mechanics was also taught under 'natural philosophy'. In Beale's book,\nWork and Play in Girls' Schools,\nshe stated:-\n... let us give girls a solid teaching in language and mathematics and science, which are found to strengthen the powers of boys, and prepare them to do good work of many kinds.\nShe also suggests that girls aged sixteen to eighteen should study advanced pure and applied mathematics, which is quite different to the simple arithmetic previously thought acceptable. In terms of teaching she recommended that teachers teach from the concrete to the abstract, using physical objects to represent figures whenever possible. She wanted pupils to associate doing and knowing, being able to put their own thoughts into words. She believed that:-\n... a lesson in mathematics should also be a lesson in the proper use of English, and in orderly habits of mind and body, in clear and accurate thinking, and in the love of the truth.\nBeale was also an advocate of sending the girls down the path of discovery that had been pursued by the original investigators. She used this method when teaching logarithms and found that it increased the interest of the pupils. This had been a large part of Beale's own mathematical education; she had read mathematics books, attended lectures she was interested in, and solved problems on her own. Beale's method of teaching mathematics was to interest the class in a mathematical problem, leave the minds of the children at the end of the class impressed and roused but still unclear about the solution. Then, in the next lesson, the explanation to which she had been leading would be presented, much like a flash to the puzzling brain.\nFor details about the mathematics examinations at Cheltenham Ladies' College, see\nTHIS LINK\n.\nUnder Beale's leadership Cheltenham Ladies' College flourished. There were only\n69\npupils at the school when she took over but a rapid increase in pupil numbers saw the College move into new building in\n1873\n. Three years later the buildings were extended since by this time the number of pupils had risen to over\n300\n. Expansion in numbers continued with\n500\npupils by\n1880\n. Continual additions to the buildings were necessary to accommodate these numbers. By the time of Beale's death in\n1906\nthere were nearly\n1000\npupils at the school.\nIn\n1864\nthe Schools' Inquiry Commission was set up to inquire into the condition of post-elementary education in the country and Beale was summoned to give evidence before the Commission on\n19\nApril\n1866\n. For details of her evidence see\nTHIS LINK\n.\nCheltenham Ladies' College was one of the first colleges to establish courses to train secondary teachers and in\n1885\nBeale opened St Hilda's College, Cheltenham. Beale was convinced of the need for proper training of teachers of all levels, therefore the Training Department offered three courses. There was a one year course for the training of secondary school mistresses, a three year course for the training of elementary school mistresses ,and a course extending over two years and a term for the training of Kindergarten and Junior Mistresses. The secondary course was shorter as it focused on one subject and pedagogy whereas the other two courses involved the study of many subjects including Geography, English and Music. The training was offered in partnership with four practising schools, Cheltenham Ladies' College, the Ladies' College School, St Stephen's Primary School and Kindergarten, and a public Elementary School. The trainee teachers had the opportunity to observe and learn from accomplished teachers.\nIn\n1893\nBeale provided funds to establish St Hilda's Hall, Oxford, so that those training to be teachers could spend a year in Oxford. However, although she maintained financial control over the Oxford Hall, she had little involvement otherwise. Twenty years earlier, she had been a founder member of the Association of Head Mistresses in\n1874\nand she served as its president from\n1895\nto\n1897\n. She had set up The Cheltenham Ladies' College Magazine in\n1880\nand she edited it for\n26\nyears from\n1880\nuntil her death.\nBeale received a number of honours for her contributions including being invited to give evidence before the royal commission on secondary education\n(\nthe Bryce commission\n)\nin\n1894\n, being given the freedom of the borough of Cheltenham on\n21\nOctober\n1901\n, and awarded an honorary doctorate from the University of Edinburgh on\n11\nApril\n1902\n.\nAs to Beale's character, Jacqueline Beaumont writes in\n[\n7\n]\n:-\nPersonally reserved, austere, small in stature, and dignified, she was in later life often likened to Queen Victoria. But despite her shyness, she developed some strong friendships with former pupils and in times of trouble could always be relied on for practical or spiritual help and much kindness.\nHer health deteriorated towards the end of her life and she became deaf. However, she continued to work up to a few weeks before her death following an operation for cancer. She was cremated at Perry Barr, Birmingham and her ashes were interred in the Lady Chapel of Gloucester Cathedral and, a week later, a memorial service was held in St Paul's Cathedral."
}