{
  "nome_completo": "Dougald Black McQuistan",
  "nome_curto": "Dougald Mcquistan",
  "ano_nascimento": "1879",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McQuistan/",
  "lugar_nascimento": "Inverkip, Renfrew, Scotland",
  "lugar_morte": "Burnside, Rutherglen, Lanarkshire, Scotland",
  "biografia": "Dougald McQuistan\n's father was  Alexander McQuistan\n(\nborn in Greenock about\n1840)\nwho was a baker. His mother was  Agnes Leitch\n(\nborn in Rothesay about\n1843)\n. He had several siblings: Archibald\n(\nborn about\n1869)\n, Agnes\n(\nborn about\n1873)\n, Elizabeth\n(\nborn about\n1878)\n, Alexandra\n(\nborn about\n1886)\n, and Alexander\n(\nborn about\n1888)\n.\nDougald McQuistan was educated at Whitehill School, Glasgow, completing his secondary education there in\n1896\n. On\n11\nDecember\n1895\nit was announced in\nThe Scotsman:-\nDougald McQuistan and\nPeter Ramsay\n, two students of the secondary department of Whitehill Public School, Glasgow, have been awarded by the Science and Art Department \"Queen's Prizes\" to mathematics.\nAfter winning a Marshall Bursary, he entered the University of Glasgow in the same year and, after obtaining honours in Greek and Latin in April\n1899\n, he graduated M.A. with First Class Honours in Mathematics and Natural Philosophy two years later. He continued his studies being awarded a B.Sc. with Special Distinction in Mathematics, Natural Philosophy, and Astronomy in\n1903\n. He then went to Cambridge where he undertook research in the Cavendish Laboratory for three years\n1904\n-\n06\n. During this period he held a Carnegie Research Fellowship.\nReturning to Glasgow, McQuistan was appointed to the Natural Philosophy Department of the Royal Technical College from\n1906\nto\n1912\n. He then taught mathematics at schools in Glasgow, first Whitehill School, then Allen Glen's School, and finally The High School. In\n1925\nhe was appointed Associate Professor of Natural Philosophy at the Royal Technical College, Glasgow. He was promoted to Professor in\n1938\n, holding the position until he retired in\n1942\n.\nMcQuistan was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1908\n. He was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\n, his proposers being\nAndrew Gray\n,\nGeorge Alexander Gibson\n,\nJames Gordon Gray\n, Robert Alexander Houstoun.\nAn obituary, written by R O Street, appears in the\nRoyal Society of Edinburgh\nYear Book\n1947\n, pages\n23\n-\n24\n.\nWe give a version of this obituary at\nTHIS LINK\n."
}