{
  "nome_completo": "Ebenezer Cunningham",
  "nome_curto": "Ebenezer Cunningham",
  "ano_nascimento": "1881",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cunningham/",
  "lugar_nascimento": "Hackney, London, England",
  "lugar_morte": "Corbridge Northumberland, England",
  "biografia": "Ebenezer Cunningham\n's father was George Cunningham\n(\nborn in Bethnal Green, London about\n1846)\nwho was a cabinet maker, and his mother was Fanny C Cunningham\n(\nborn in Dalston, London about\n1848)\n. Ebenezer had an older brother George\n(\nborn about\n1879)\nand a younger brother Charles\n(\nborn about\n1884)\n.\nEbenezer Cunningham was educated at Owen's School Islington and from there he won an open mathematical scholarship to St John's College, Cambridge, which he entered in\n1899\n. His lecturers at Cambridge included\nBaker\n,\nLarmor\n, J G Leathem and R Pendlebury.\nBaker\nwas his director of studies. At Cambridge his main interests outside mathematics were choral music and rowing. He became a pacifist while at Cambridge through the Boer War years\n1899\nto\n1902\n[\n1\n]\n:-\nThe Boer War, which coincided with his undergraduate days, determined once and for all his attitude towards war; he was an uncompromising pacifist and, as such, his position during the First World War made him unpopular in many quarters, but his moderating influence with like-minded but hasty young men was highly beneficial, and his friends stuck to him.\nAfter graduating as Senior\nWrangler\nin\n1902\nhe worked for a Smith's prize. Results similar to those he obtained were, unfortunately, published in a French journal before he had submitted. He started work on a new topic submitting a winning entry on\nmatrices\nfor the Smith's prize of\n1904\n.\nIn\n1904\nnot only was he elected to a Fellowship at St John's College but he also became a lecturer at Liverpool University. While at Liverpool he collaborated with\nBateman\n.\nUntil\n1907\nhe worked both in Liverpool and in Cambridge. Then he moved to University College London where he worked under\nPearson\n. He wrote on linear\ndifferential equations\n, prompted by\nPearson\n's work and other work related to statistics.\nAlthough Cunningham's early papers were on analysis, he was soon to change topic. While at Cambridge, he had read\nLarmor\n's famous book\nAether and Matter\nand then, in\n1905\n, after reading\nEinstein\n's paper on special relativity, he began to work on that topic. Cunningham published\nThe Principle of Relativity\nin\n1914\n, the first English book on the topic. Many papers on relativity followed.\nIn fact Cunningham had returned to St John's College Cambridge in\n1911\n, at the invitation of\nBaker\n. His work in Cambridge was interrupted by World War I when he worked on the land rather than join the army. Of course during this period he found it hard to keep in touch with developments in relativity theory which took place in Germany. After this he never returned to major research projects and spent the rest of his career as an enthusiastic teacher of mathematics at Cambridge. Cunningham himself blamed the administrative work for his lack of research, saying that it:-\n... for some years came between me and any freedom to follow up and keep abreast of the extremely rapid advance of science.\nCunningham's pacifist views were connected to his strong religious views\n[\n1\n]\n:-\nA keenly religious man, Cunningham devoted a large amount of energy to affairs of Emmanuel Congregational Church, of which he was an office-bearer. He was chairman of the Congregational Union of England and Wales for\n1953\n-\n54\n.\nWe have already mentioned his pacifist views during World War I but\n[\n1\n]\n:-\nLater he became attracted by the Oxford Group movement, though never by its extravagances.\nAs to his interests outside mathematics\n[\n1\n]\n:-\nMusic played a great part in his life, and on at least one occasion he electrified and humanized a somewhat solemn gathering at his house by sitting down at his piano and singing a comic song.\nThe obituary\n[\n1\n]\ncontains the following tribute:-\nHe was a man of patent sincerity and great kindness who served his college and university well."
}