{
  "nome_completo": "Edmond Halley",
  "nome_curto": "Edmond Halley",
  "ano_nascimento": "1656",
  "ano_morte": "1742",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Halley/",
  "lugar_nascimento": "Haggerston, Shoreditch (near London), England",
  "lugar_morte": "Greenwich (near London), England",
  "biografia": "Edmond\n(\nor Edmund\n)\nHalley\n's father was also called Edmond\n(\nor Edmund\n)\nHalley. He came from a Derbyshire family and was a wealthy soap-maker in London at a time when the use of soap was spreading throughout Europe. There is some confusion over both the date and year of Halley's birth. The confusion over the date is simply due to the change in calendar\n(29\nOctober by the calendar of his time\n)\n. The confusion over the year is less easy to decide, but we give\n1656\nwhich Halley himself claimed as the year of his birth.\nHalley's father lost much in the great fire of London, which was in the year in which Halley was ten years old. His father still could afford a good education for his son and Halley was tutored privately at home before being sent to St Paul's School. It was at St Paul's School that Halley showed his talents to the full, being\n[\n16\n]\n:-\n... equally distinguished in classics and mathematics,\n[\nhe\n]\nrose to be captain of the school at fifteen, constructed dials, observed the change in the\nvariation of the compass\n, and studied the heavens so closely that it was remarked by Moxon the globe maker 'that if a star were displaced in the globe he would presently find it out'.\nSo Halley entered Queen's College Oxford in\n1673\n, when he was seventeen years old, already an expert astronomer with a fine collection of instruments purchased for him by his father. He began working with\nFlamsteed\nin\n1675\n, the Astronomer Royal, assisting him with observations both at Oxford and at Greenwich.\nFlamsteed\n, in a paper of\n1675\npublished in the\nPhilosophical Transactions of the Royal Society\n, remarked:-\nEdmond Halley, a talented young man of Oxford, was present at these observations and assisted carefully with many of them.\nHalley made important observations at Oxford, including an\noccultation\nof Mars by the Moon on\n11\nJune\n1676\n, which he published in the\nPhilosophical Transactions of the Royal Society\n. It is a little unclear what happened to Halley's undergraduate career, but what is certain is that he gave up his studies in\n1676\nand sailed to St Helena in the southern hemisphere in November of that year. The most likely explanation is that with the opening of the Royal Observatory at Greenwich in\n1675\n,\nFlamsteed\nundertook the task of mapping the northern hemisphere stars and Halley decided to complement this programme with undertaking a similar task for the southern hemisphere.\nSuch a task could not be undertaken without financial support, and indeed Halley obtained such support from his father and from no less person than King Charles II who provided a letter asking the East India Company to take Halley and a colleague to St Helena\n(\nthe southern-most territory under British rule\n)\n. Other important men also supported the venture, including\nBrouncker\nwho was president of the\nRoyal Society\nand\nJonas Moore\nwho had been a major influence in the founding of the Royal Observatory.\nThe weather in St Helena proved less good for astronomical observations than Halley had hoped, but despite this his eighteen month spell on the island resulted in his cataloguing\n341\nsouthern hemisphere stars and discovered a star cluster in Centaurus. During the voyage\n[\n16\n]\n:-\n... he improved the sextant, collected a number of valuable facts relative to the ocean and atmosphere, noted the equatorial retardation of the pendulum, and made on St Helena, on\n7\nNovember\n1677\n, the first complete observation of a\ntransit\nof Mercury.\nHe proposed using transits of Mercury\n(\nand even better of Venus\n)\nto determine the distance of the Sun and therefore the scale of the\nsolar system\nusing\nKepler\n's third law. Halley returned to England in\n1678\nand published his catalogue of southern hemisphere stars. Despite not having graduated from Oxford he found himself with the reputation of one of the leading astronomers. Honours quickly came his way. He became a graduate of the University of Oxford on\n3\nDecember\n1678\nwithout taking the degree examinations, the degree being conferred on the command of King Charles II. He was also elected a member of the\nRoyal Society\non\n30\nNovember\n1678\nbecoming, at the age of\n22\n, one of its youngest ever Fellows.\nIn\n1679\nthe\nRoyal Society\nsent Halley to Danzig to arbitrate in a dispute between\nHooke\nand Hevelius.\nHooke\nclaimed that Hevelius's observations, made without telescopic sights, could not be accurate. Hevelius at this time was\n68\nyears old and must have been somewhat dismayed to find that a\n23\nyear old man had been sent to judge him. However, Halley was\n[\n1\n]\n:-\n... a man of great natural diplomacy...\nand after two months checking the observations Hevelius was making, he declared them to be accurate.\nThe fame and recognition which Halley achieved so quickly did nothing to endear him to\nFlamsteed\nwho, despite his praise for Halley in his student days, soon turned against him. Having the Astronomer Royal as an enemy is not the best recommendation for a young astronomer, even one as famous as Halley, who would soon pay the price.\nHalley did not seek a teaching post at this stage, preferring the freedom to travel and undertake research without commitments. In\n1680\nhe set out on a European tour with a school friend, Robert Nelson. Halley observed a comet while near Calais and travelled to Paris where, together with\nCassini\n, he made further observations in an attempt to determine its orbit. Much of\n1681\nHalley spent in Italy. Back in England in the following year Halley married Mary Tooke, while his father remarried\n(\nHalley's mother having died ten years earlier\n)\n.\nNot only did marriage bring financial responsibilities to Halley, but his father's marriage seems to have been a total disaster and as a consequence of this support from his father soon dried up. Further personal problems followed, for in March\n1684\nhis father vanished and was found dead five weeks later. Halley had to administer his father's personal estate and he became involved in family, property and legal matters which are described fully in\n[\n12\n]\n.\nJust before his father disappeared, Halley had been involved in an exciting piece of research. He had shown that\nKepler\n's third law implied the inverse square law of attraction and presented the results at a meeting of the\nRoyal Society\non\n24\nJanuary\n1684\n.\nWren\n,\nHooke\nand Halley then discussed whether it could be shown that the inverse square law implies elliptical orbits for the planets, but failed to come up with a proof. Halley's work on these problems was disrupted during the following weeks by the difficulties surrounding his father's disappearance and death, but by August\n1682\nHalley was pursuing the problem further by visiting\nNewton\nin Cambridge. There he discovered that\nNewton\nhad already achieved a proof of this and of other highly significant results but did not seem to be going to publish them.\nChapman writes in\n[\n11\n]\n:-\n... Halley ... had the genius to recognise the even greater mathematical genius of\nNewton\n, to urge him to write the Principia Mathematica, and then pay for the costs of publication out of his own pocket because the\nRoyal Society\nwas currently broke ...\nGlaisher\n, in an address delivered in Cambridge in\n1888\n, spoke of the role which Halley played in getting\nNewton\n's\nPrincipia\npublished:-\n... but for Halley the Principia would not have existed. ... He paid all the expenses, he corrected the proofs, he laid aside his own work in order to press forward to the utmost the printing. All his letters show the most intense devotion to the work.\nBy now Halley was certainly not a rich man and although in the end his financial outlay which allowed the\nPrincipia\nto be published was reimbursed from the sales, he now sought an academic post. In\n1691\nhe applied for the vacant Savilian Chair of Astronomy at Oxford. Given his outstanding research in astronomy, one would have expected him to be appointed to this chair but\nFlamsteed\nwas strongly against the appointment.\nFlamsteed\nwas not well disposed towards\nNewton\nparticularly since he felt that\nNewton\nhad not given sufficient credit to observations made by the Royal Observatory in his theory of the moon. Halley's close association with\nNewton\nlowered him still further in\nFlamsteed\n's eyes. However, the argument that\nFlamsteed\nused against Halley was one which he undoubtedly believed in sincerely, writing to Oxford that Halley would\n[\n7\n]\n:-\n... corrupt the youth of the university.\nFlamsteed\nwas quite right in believing that Halley's view of Christianity was at odds with the standard view of that time which required a literal belief in the Bible.\nNewton\nalso complained to Halley about the fact that Halley doubted the scientific correctness of the biblical story of the creation. Despite Halley vigorously claiming that his beliefs were conventional,\nDavid Gregory\nwas appointed to the chair.\nThe lack of an academic post did not hold Halley back in his scientific work. Indeed he worked for the\nRoyal Society\nin various roles, being editor of the\nPhilosophical Transactions\nfrom\n1685\nto\n1693\n. He published frequently important results through the Society's publications. In\n1686\nHalley published a map of the world showing the prevailing winds over the oceans. It has the distinction of being the first meteorological chart to be published. Another innovative piece of work was the mortality tables for the city of Breslau which he published in\n1693\n. It was one of the earliest works to relate mortality and age in a population and was highly influential in the future production of actuarial tables in life insurance.\nFrom around\n1695\nHalley made a careful study of the orbits of comets.\nNewton\nfavoured comets having parabolic orbits, but Halley believed that elliptical orbits might exist. Using his theory of cometary orbits he calculated that the comet of\n1682\n(\nnow called Halley's comet\n)\nwas periodic and was the same object as the comet of\n1531\n, and\n1607\n. He later also identified this comet with one which appeared in\n1305\n,\n1380\n, and\n1456\n. In\n1705\nhe published his prediction that it would return in\n76\nyears, claiming that it would appear in December\n1758\n. It was not an easy calculation for Halley had to take into account the perturbations to the orbit produced by Jupiter. Although Halley had been dead for fifteen years by\n1758\n, he achieved lasting fame when the comet was observed on\n25\nDecember\n1758\n(\nvery slightly later than Halley expected\n)\n.\nNewton\nbecame Warden of the Royal Mint in London in\n1696\nand he used his influence to have Halley appointed as deputy controller of the mint at Chester in the same year. It was a post he held for two years before it was abolished. After leaving the mint at Chester, Halley was given the command of a warship, the Paramore Pink, by William III. This was not as strange as it sounds, for Halley had been working on determining the longitude using variation of the compass and this was the main purpose of the voyage, although he was also required by William III to\n[\n16\n]\n:-\n... attempt the discovery of what land lies to the south of the western ocean.\nHe sailed from Portsmouth in November\n1698\nbut problems with his crew forced him to return, having reached Barbados. In September\n1699\nhe sailed again making a thorough exploration of the Atlantic shores. After his return in September\n1700\n, Halley published charts of the variation of the compass, giving the first charts with lines of equal\ndeclination\nplotted.\nBack on the Paramore Pink in\n1701\n, Halley investigated the tides and coasts of southern England. Further journeys followed, for Queen Anne sent him to inspect the harbours around the Adriatic, and another journey saw him travel to Trieste to advise on fortifications.\nHalley was appointed Savilian professor of geometry at Oxford in\n1704\nfollowing the death of\nWallis\n. This certainly did not please\nFlamsteed\nwho had written\n(\nsee for example\n[\n13\n]\n)\n:-\nDr\nWallis\nis dead - Mr Halley expects his place - who now talks, swears and drinks brandy like a sea captain.\nHalley's inaugural lecture proved a great success. It was described by Thomas Hearne\n(\nsee\n[\n5\n]\n)\n:-\nMr Halley made his inaugural speech on Wednesday May\n24\n, which very much pleased the generality of the University. After some compliments to the university, he proceeded to the original and progress of geometry, and gave an account of the most celebrated of the ancient and modern geometricians. Of those of our English nation he spoke in particular of Sir Henry\nSavile\n; but his greatest encomiums were upon Dr\nWallis\nand Mr\nNewton\n...\nThis lecture is described in\n[\n24\n]\nas:-\n... of abiding interest from the mathematics standpoint.\nIn\n1710\n, using\nPtolemy\n's catalogue, Halley deduced that the stars must have small motions of their own and he believed that he was able to detect this proper motion in three stars. In fact the errors in his data were too large to enable him to do this as\nJacques Cassini\nlater demonstrated\n[26]\n.\nHalley played an active role in the events and controversies of his time. He supported\nNewton\nin his controversy with\nLeibniz\nover who invented the calculus, serving as secretary of a committee set up by the\nRoyal Society\nto resolve the dispute. Halley did much to calm disputes, but also seemed to go out of his way to make his dispute with\nFlamsteed\nworse. In\n1712\nhe arranged with\nNewton\nto publish\nFlamsteed\n's observations long before they were complete. To make matters worse, Halley wrote a preface, without\nFlamsteed\n's knowledge, in which\n[\n11\n]\n:-\n... he attacked\nFlamsteed\nfor sluggishness, secretiveness, and lack of public spirit.\nIn\n1720\nhe succeeded\nFlamsteed\nas Astronomer Royal, a position he was to hold for\n21\nyears despite being\n64\nyears old when appointed.\nFlamsteed\n's widow was so angry that she had all her husband's instruments from the Royal Observatory sold so that Halley would not have the use of them.\nAt the Greenwich Royal Observatory Halley used the first transit instrument and devised a method for determining longitude at sea by means of lunar observations. He observed the Moon through one complete\n18\n-year saros. Earlier observations of the Moon were made only at\nconjunction\nor at\nopposition\nto the Sun and it was these earlier observations on which\nNewton\n's lunar theory had been based. However, Halley has been criticised for his work as Astronomer Royal. Some claim that he made valueless observations which were no more accurate than those of\nFlamsteed\n. It has also been claimed that Halley's observations were carelessly carried out. For example in\n[\n16\n]\n:-\nHalley took no account of fractional parts of seconds of time, and considered\n10\n\" of arc 'as the utmost attainable limit of accuracy'. His clocks were besides ill-regulated, and his system of registration unmethodical.\nIn\n[\n22\n]\n, however, Ronan argues that the criticisms are unfair. He lists in that article Halley's achievements as Astronomer Royal.\nHalley's other activities included studying archaeology, geophysics, the history of astronomy, and the solution of polynomial equations. He was an integral part of the English scientific community at the height of its creativity."
}