{
  "nome_completo": "Heinrich Eduard Heine",
  "nome_curto": "Eduard Heine",
  "ano_nascimento": "1821",
  "ano_morte": "1881",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heine/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Halle, Germany",
  "biografia": "Eduard Heine\n's parents were Karl Heinrich Heine, a banker, and Henriette Maertens. Eduard was the eighth of his parents nine children. He received his early instruction at home, then entered the Friedrichswerdersche\nGymnasium\n. He later changed to study at the Köllnische Gymnasium in Berlin where mathematics and natural sciences were taught. After his\nAbitur\nin the autumn\n1838\n, Heine entered the University of Berlin. After one semester he went to the University of Göttingen where he attended lectures by\nGauss\nand by M A Stern on\nnumber theory\n.\nAfter three semesters at Göttingen, Heine returned to the University of Berlin where he was taught by\nDirichlet\n. He also attended geometry lectures by\nSteiner\n, and astronomy lectures by\nJ F Encke\n, the director of the observatory.  However, he also got to know the other outstanding mathematicians in Berlin:\nWeierstrass\n,\nKummer\n,\nKronecker\n, and\nBorchardt\n.  Throughout his life he maintained his contacts with these mathematicians, making numerous journeys to Berlin.  He remained at Berlin to undertake research which was supervised by\nEnno Dirksen\nand\nMartin Ohm\n. Heine submitted his thesis\nDe aequationibus nonnullis differentialibus\nⓉ\n(\nSome differential equations\n)\nand was awarded the degree on\n30\nApril\n1842\n. The thesis was dedicated to\nDirichlet\n. Following this he spent a year at Königsberg studying with\nJacobi\nand\nFranz Neumann\n. He took part in the Königsberg mathematical semiar which was also attended by\nAronhold\n,\nKirchhoff\n, and\nSeidel\n.\nOn\n20\nJuly\n1844\nHeine\nhabilitated\nat the University of Bonn where he was appointed as a\nprivatdozent\n. There he was promoted to extraordinary professor on\n13\nMay\n1848\nand in\n1850\nhe married Sophie Wolff, the daughter of a merchant from Berlin; they have five children, four daughters and a son. On\n6\nSeptember\n1856\nHeine was promoted to ordinary professor at Halle. Before arriving at Halle, Heine published on partial differential equations and during his first few years teaching at Halle he wrote papers on the theory of heat, summation of series,\ncontinued fractions\nand\nelliptic functions\n.\nAt Halle, Heine taught a variety of courses such as: potential theory and its applications, number theory,\nFourier series\n, trigonometric series, mechanics, and the theory of heat.\nWangerin\n, who was an undergraduate in Halle in\n1862\n, and attended lectures by Heine, wrote:-\nAs academic teacher Heine was greatly liked.  His lectures were distinguished by clarity and were well received.  He always pointed out to his students that it is not sufficient to read text books and manuals, rather it was necessary for them to study the approach in original papers.\nHeine worked on\nLegendre\npolynomials,\nLamé\nfunctions and\nBessel functions\n. He is best remembered for the Heine-\nBorel\ntheorem:-\n... a subset of the reals is compact if and only if it is closed and bounded .\nHeine also formulated the concept of uniform continuity.\nThe paper\n[\n2\n]\nanalyses letters written by Heine and found in\n1988\nin the Institut\nHenri Poincaré\n. The second part of this paper covers the history of the Heine-\nBorel\ntheorem and is summarised in the following review:-\nThe last half of the paper is devoted to a more systematic account of the gradual discovery and formulation of the so-called Heine-Borel theorem. It begins with the implicit use of the theorem in various proofs of the theorem stating that a continuous function on a closed, bounded interval is uniformly continuous. The first proof of this theorem was given by\nDirichlet\nin his lectures of\n1862\n(\npublished\n1904)\nbefore Heine proved it in\n1872\n. Dugac shows that\nDirichlet\nused the idea of a covering and a finite subcovering more explicitly than Heine. This idea was also used by\nWeierstrass\nand\nPincherle\n.\nBorel\nformulated his theorem for countable coverings in\n1895\nand\nSchönflies\nand\nLebesgue\ngeneralized it to any type of covering in\n1900\nand\n1898\n(\npublished\n1904)\n, respectively. Dugac shows that the story is in fact much more complicated and includes names such as Cousin,\nThomae\n, Young, Vieillefond,\nLindelöf\n. The priority questions are nicely illustrated with quotes from the correspondence between\nLebesgue\nand\nBorel\nand other letters."
}