{
  "nome_completo": "Edwin Arthur Maxwell",
  "nome_curto": "Edwin Maxwell",
  "ano_nascimento": "1907",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maxwell_Edwin/",
  "lugar_nascimento": "Aberdeen, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Edwin Arthur Maxwell\nwas the son of Edwin Maxwell\n(1865\n-\n1950)\nand Florence Edith Green\n(1873\n-\n1961)\n. Edwin Maxwell had been born in Nottingham, England, then lived in Maidstone, Kent. At the time of the\n1881\ncensus he was\n15\nyears old and a scholar in the Lincoln Union Workhouse, Lincoln. He married Florence Edith Green on\n27\nJuly\n1899\nin the Church of St Botolph in Lincoln. At the time of the\n1901\ncensus, Edwin and Florence Maxwell are living in Grimsby, and Edwin's occupation is given as fisherman. Florence Edith Green was born in Sheffield to George and Betsy Ann Green. At the time of the\n1891\ncensus she was working as a domestic servant. Edwin and Florence Maxwell moved to Aberdeen, Scotland, where the first of their two children, Edith Annie Maxwell, was born on\n1\nJuly\n1904\nat\n2\nCairnfield Place. Sadly she died on\n2\nFebruary\n1905\n. Edwin Arthur Maxwell, the second of the children and subject of this biography, was born at\n52\nMid Stocket Road, Aberdeen on\n12\nJanuary\n1907\n. Edwin Maxwell Sr was at this time, and at the\n1911\ncensus, listed as a ship's cook in the fishing industry.\nE A Maxwell attended school in Aberdeen, then entered the University of Aberdeen in\n1924\nand was awarded an M.A. in\n1928\n. We should note that at Scottish universities at this time\n(\nand still today\n)\nthe M.A. degree was a first degree, the equivalent of a B.A. at an English university. There had been a tradition for Scottish students to study for a first degree in Scotland before going to Cambridge and studying for a first degree again. This is what Maxwell did, matriculating at Queens' College, Cambridge in\n1928\nwhere he studied the mathematical tripos. He was awarded a B.A. in\n1931\nand then began undertaking research for his doctorate advised by\nHenry Baker\n. He was elected a Fellow of Queens' College, Cambridge in\n1932\nand, in the following year he was appointed as Junior Bursar, assisting with the financial affairs of the College. Also in\n1933\nhe was awarded a Smith's Prize, for an essay on \"The Invariants of Certain Surfaces.\" In addition to these positions, in\n1934\nMaxwell was appointed as a Director of Studies for Mathematics.\nWith his position at Queens' College, Cambridge secure, Maxwell returned to Aberdeen in\n1934\nto marry Greta Louise Sykes\n(1905\n-\n1986)\n. Greta, born in Aberdeen on\n16\nJune\n1905\n, was the daughter of the dental surgeon James Hall Sykes and his wife Mabel Catterall. Greta had studied at the University of Aberdeen at the same time as Maxwell and had been awarded an M.A. in\n1929\n. She then worked as a library assistant in Aberdeen before her marriage. Greta had wide interests in the Church, Scottish dancing, basketry and crafts in general. After their marriage Edwin and Greta Maxwell set up home at\n71\nDe Freville Avenue, Cambridge. Greta founded the Cambridge Scottish Society in\n1936\nand was Treasurer for nearly fifty years. The Society's aims were to stimulate interest in Scottish traditions, life and culture, and to support worthy charities. Maxwell was a member of the Society from the time it was founded for the rest of his life.\nIn\n1934\nMaxwell was awarded a Ph.D. for his thesis entitled 'An examination of particular surfaces with regard to their invariants'. He then began publishing research papers:\nNote on the Formula for the Number of Quadrisecants of a Curve in Space of Three Dimensions\n(1935)\n;\nOn the Geometrical Genus of Certain Surfaces\n(1936)\n;\nRegular canonical surfaces of genus three and four\n(1937)\n;\nNote on the Invariants of the Canonical System of an Algebraic Variety\n(1937)\n;\nOn the theorem of Riemann-Roch\n(1937)\n; and\nOn certain surfaces which have unpostulated singularities\n(1937)\n. In the\n1936\npaper he appended the note:-\nI am indebted for the method employed in this proof to Prof\nBaker\n, who has greatly simplified my own work.\nHe also published the paper\nOn Certain Transformations in Euclidean Spaces\n(1937)\nwhich seems to mark a change in direction for from then on he published mostly articles and books aimed at school pupils or undergraduates. This\n1937\npaper, published in\nThe Mathematical Gazette\n, begins as follows\n[\n20\n]\n:-\nThis paper attempts to illustrate the method of representation which is so powerful a weapon of modern geometry, in terms of elementary Higher Certificate mathematics. The results in their general form are familiar to students of geometry; but the special problem given here has several interesting features of its own.\nNo originality is claimed for this paper, though I do not know of any other account of the work. It seems, however, worth while to give a brief summary, as it covers a great deal of the ground with which schoolboys should be familiar.\nThe results are given for pairs of points and for circles. It will be obvious\n(\nand indeed it forms an interesting exercise\n)\nthat the work can be extended to spheres and to corresponding figures in higher space.\nOn the\n1939\nRegister, Edwin and Greta Maxwell are listed as living with Mabel Sykes, Greta's incapacitated widowed mother. Three of their four children\n(\nthree girls and one boy\n)\nhad been born by this time. In addition to Maxwell's positions which we gave above, he also had duties as an Air Raid Warden for Queens' College. During World War II Maxwell continued his work at the College. After the war ended he is listed as a Praelector, that is someone who presents students during their matriculation and the graduation ceremony, a task he had taken on when he retired as Junior Bursar in\n1946\n. He had also become Keeper of the College Records from\n1946\nand continued as a Lecturer in Mathematics.\nThe first post-war dinner of the Queens' College Club was held on Saturday,\n14\nJune\n1947\n, with about\n110\npeople were present. At the Annual Meeting before the dinner Maxwell was elected as one of the two secretaries of the Club. He had been the Treasure of the Club during the war years when\n402\nnew members had joined. He also informed the Club that Governing Body was to have Dr Venn's portrait painted. The Queens' College Record for\n1947\ntells us that during the war\n[\n42\n]\n:-\nDr Maxwell has written a book on Geometry, while contending as Junior Bursar with almost insuperable difficulties.\nMaxwell became an enthusiastic member of the\nMathematical Association\nfrom the\n1930\ns. During the\n1940\ns and\n1950\ns he contributed over\n30\narticles to\nThe Mathematical Gazette\n, the journal of the\nMathematical Association\n. He was elected President of the\nAssociation\nin\n1960\nand gave the Presidential address\nPastors and masters\nin\n1961\n. We give a fairly long quote from Maxwell's address because it illustrates much of his thinking\n[\n21\n]\n:-\nIt has been my privilege and pleasure to speak at other times before the\nAssociation\nor its Branches, and on those occasions I have tended to deal somewhat light-heartedly with topics of greater or lesser importance. There are, however, many very serious matters which claim our attention at this time, and it is with them that I have judged it more appropriate to occupy this address. Much of what I shall say is not concerned directly with the subject of mathematics, but I hope you will not think it irrelevant for all that. Some of it, indeed, is addressed beyond the teaching profession to what I shall call the non-teaching 'laity'; not many of them may come across my words, but I should like to record them nevertheless, in the hope that perhaps a little may penetrate outside.\nIn most parts of the world today there is a serious shortage of teachers .... This shortage is particularly acute in mathematics, and urgent steps are necessary if the shortage is not to become catastrophic. ...\nI have given to this Address the title, \"Pastors and Masters\" for reasons that are probably obvious ... . I approach the theme by recalling the familiar concept that any proper consideration of the problems of education must be concerned with the whole man and not only with isolated aspects of him. Inevitably, what I say in this context must be coloured by the fact that I myself have grown up in the Christian tradition, which is bound to affect all my ways of thinking; but I believe that what I have to say is unlikely to cause any deep disagreement from those who claim other allegiances.\n...\nIf I have succeeded in making myself clear, the whole of this talk links itself together towards a single theme - the worthwhile-ness of teaching and the proper status of the profession. I have suggested that those of us who belong to what I have called the 'laity' should reform our thinking to give proper attention to the affairs of the mind and the spirit, and I have shown how Associations such as ours can, through their manifold activities, raise the whole standard of teaching in their subjects and therefore serve to inform the 'laity' about what is already being done. I have paid tribute to those who have guided the affairs of our own Association so wisely, and have suggested that we, of the rank and file, should back them up vigorously so that the Association may set its sights higher and higher and grow, as it can, to achieve an influence that will ensure for the teaching of British mathematics a place even more secure than that which it already holds. This is both short-term and long-term policy, but so much has been accomplished that we have ready to hand a foundation on which, I believe, a magnificent structure can be erected.\nOf course it was Maxwell's belief in the importance of teaching which, in many way, explains his whole career. He wanted to improve the teaching of mathematics at all levels though his articles and books so this was where his efforts were concentrated. He wrote around ten books\n(\nwe say \"around\" since it is unclear whether we should count the multi-volume works as one book or several books\n)\n. These books are listed with information about each, including extracts from reviews, at\nTHIS LINK\n.\nLet us give just a few comments by reviewers to illustrate Maxwell's style and achievements. First from Myron F Rosskopf\n[\n36\n]\n:-\nThis reviewer was struck by the author's ability to make intuitively clear a knotty point in calculus and yet to write in such a way that no mathematician could legitimately criticise him.\nEric John Fyfe Primrose writes\n[\n24\n]\n:-\nThere are so many books on plane coordinate geometry that my first reaction was to doubt whether there could be any good reason for writing another. Having read the book I am converted. I cannot remember having read any other book in which the author takes so much trouble to anticipate the difficulties which a beginner may meet.\nThomas Arthur Alan Broadbent\nwrites\n[\n3\n]\n:-\nFrom the text, we may deduce that the author is a humane and experienced examiner, for some of his items have surely been acquired in the course of patient and toilsome efforts to decipher and unravel complications in examination scripts.\nNick Lord writes\n[\n19\n]\n:-\nMaxwell's original aim for this slim volume was that it would 'instruct through entertainment'. As we near the\n50\nth anniversary of its first appearance, I am certain that this re-issue will attract and captivate a new generation of readers.\nAlbert Geoffrey Howson\nwrites\n[\n10\n]\n:-\nThere is, of course, no need to comment on the way in which the work is presented. Every reader must have a favourite group of hotels or chain of stores on which he feels he can rely for good service and value for money, and I hope that Dr Maxwell does not think it too unflattering if I compare his books with such a group. It is possible that there is a better hotel or store in the town and there may be a better book on the subject, but one knows that one will not go far wrong in putting one's faith in a hard-earned reputation.\nFinally, we quote from John V Tyson\n[\n46\n]\n:-\nI have been a fan of Dr Maxwell's books ever since I came across them - and him - in my undergraduate days. I was grateful then for their immensely clear exposition and logical structure; and it has always since been a real pleasure to study from them, or to recommend them to others.\nWork for the\nMathematical Association\nwas not the only contribution that Maxwell made to mathematical education in schools\n[\n32\n]\n:-\nDuring the\n1950\ns, he became involved with educational developments overseas, serving on the Executive Committee of ICMI from\n1952\nto\n1958\nand as its Secretary from\n1971\nto\n1974\n, under the presidency of Sir\nJames Lighthill\n. He was also one of the British delegates to the\n1959\nconference at Royaumont, which resulted in the publication of New thinking in school mathematics\n(1961)\n.\nIf we look at the Queens' College Record for\n1965\n-\n66\n[\n41\n]\nwe get a glimpse of the roles that Maxwell was playing. He was President of the St Margaret Society, the College music society that organises concerts and other musical events. He was also Senior Treasure of \"The Bats\", a dramatics society that puts on Shakespearean plays and a variety of other productions.\nMaxwell retired in\n1974\n. The Record Queens' College announces this in\n[\n44\n]\n:-\nThe end of the present academic year marks the end of Dr Maxwell's tenure as an Official Fellow of the College. Elected in\n1932\n, he has since served the College in many capacities: as Director of Studies in Mathematics, as Senior Bursar, and as Keeper of the Records. Many hundreds of Queens-men will have learnt Mathematics under him and will have come to appreciate the enormous kindness and humanity of the man; and those who knew him very well may have discovered, as his senior colleagues did, the fund of humour and wisdom which lies beneath those alert eyes. Happily, Dr Maxwell will continue to live in Cambridge so that he, and his wife Greta, will share many of our activities in the College long after his retirement.\nMaxwell's wife Greta died on\n20\nJanuary\n1986\n. He then set up a Queens' College fund in her memory\n[\n43\n]\n:-\nDr Edwin Maxwell has endowed a fund in memory of his wife Greta. The fund is intended to support and promote Arts and Crafts among the junior members of the College. These were activities of which Greta Maxwell was particularly fond and which do not receive direct encouragement from any other source.\nFinally let us quote Douglas Quadling\n[\n28\n]\n. He said to describe his life:-\n... the word which springs to mind is \"devotion\": devotion to his family, to his college, to his church, to the\nMathematical Association\n, to mathematics\n(\nespecially geometry\n)\nand to his native Scotland. A happy combination of these was exhibited in his last active appearance at an\nAssociation\nfunction, when he introduced an evening of Scottish country dancing at the Dundee conference with a talk describing the various movements in matrix terms, before leading us on to the floor with Greta in a display of gyrations which paid scant regard to the fact that they had celebrated their golden wedding the year before. Edwin loved teaching, and he had the gift of being able to adapt his approach to a wide range of audiences. He was always ready to take on those service courses which many colleagues would have considered a chore; yet he could delight a course of sixth form teachers with a demonstration of geometrical elegance.\n...\nA more unusual attribute was the pleasure which he derived from examining. Many a candidate for the mathematics examinations of the Cambridge Local Examinations Syndicate has unwitting cause to be grateful to him for the humanity and the professionalism which he brought to this task. In his personal habits Edwin was conservative: he chose to use the train, the blackboard and the fountain pen rather than the plane, the overhead projector and the typewriter. But this resistance to innovation certainly did not extend to his thinking on mathematical education."
}