{
  "nome_completo": "Egor Ivanovich Zolotarev",
  "nome_curto": "Egor Ivanovich Zolotarev",
  "ano_nascimento": "1847",
  "ano_morte": "1878",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zolotarev/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Egor Ivanovich Zolotarev\n's father, Ivan Zolotarev, was a watchmaker. Egor Ivanovich attended the\nGymnasium\nin St Petersburg completing his school education in\n1863\n. It was a school career of great distinction and he received a silver medal when he graduated.\nAfter leaving school Zolotarev enrolled at the Faculty of Physics and Mathematics of St Petersburg University. There he attended lectures by\nChebyshev\nand\nA N Korkin\n, graduating with his first degree in\n1867\n. He then continued his studies at the Faculty of Physics and Mathematics investigating an indeterminate equation of degree three. For this work he was awarded a Master's degree in\n1869\n.\nIt is worth commenting that a Master's degree in Russia at this time was closer in standard to what might be expected of a doctoral dissertation in a British or American university in the present time. The doctoral dissertation that Zolotarev went on to write would be closer to the German\nhabilitation\n. In\n1874\nhe submitted this doctoral dissertation on algebraic integers and was awarded the degree. Two years later Zolotarev was appointed as Professor of Mathematics at St Petersburg Faculty of Physics and Mathematics. He also became an assistant in applied mathematics at the\nSt Petersburg Academy of Sciences\n.\nThen he made two trips abroad, visiting Berlin where he attended lectures by\nKummer\n,\nWeierstrass\nand Paris where he had many mathematical discussions with\nHermite\n. We will indicate below some of Zolotarev's remarkable mathematical achievements some of which were consequences of problems which he discussed with\nKummer\nand\nHermite\nwhile on his trips. All his results were produced over a comparatively short time period for he died two years after being appointed a professor. His career ended when he fell under a train and died shortly after of blood poisoning.\nIn a short eleven year career Zolotarev produced fundamental work in approximation theory,\nquadratic forms\n,\nalgebraic numbers\nand\nelliptic integrals\n. During this tragically short career he published\n28\npapers and books. Let us first comment on his work on algebraic numbers.\nHe studied rings of integers in\nalgebraic number fields\n, giving a divisibility theory for such\nrings\ndeveloping ideas which had been introduced by Kummer. He studied local rings and semilocal rings and proved certain results on principal ideal domains. He also introduced ideas which were essentially what today are called valuations.\nThe paper\n[\n7\n]\nlooks at both the published work of Zolotarev, and also manuscripts preserved in libraries in Moscow and St Petersburg, relating to his work on elliptic functions. Nalbandjan was able to examine Zolotarev's notebooks, including lecture notes he made while a student. Zolotarev emphasised the relationship between elliptic functions and functions of a complex variable. In particular he applied his theory of complex integers to the integration of elliptic differentials. Abel had shown when certain elliptic differentials could be integrated in logarithms but his methods was of little practical use. Zolotarev was able to give a much more effective solution.\nZolotarev worked with\nKorkin\non quadratic forms.\nHermite\nhad posed the problem of finding the minimal values of quadratic forms in\nn\nn\nn\nvariables whose coefficients were real. They were able to give complete solutions in the case of four variables and of five variables.\nZolotarev posed four problems in approximation theory all of which he was able to solve. The first two of the problems he examined attempted to minimize\nm\na\nx\n{\n∣\np\n(\nx\n)\n∣\n:\n−\n1\n≤\nx\n≤\n1\n}\nmax\\{ |p(x)| : -1 ≤ x ≤ 1\\}\nm\na\nx\n{\n∣\np\n(\nx\n)\n∣\n:\n−\n1\n≤\nx\n≤\n1\n}\nover polynomials\np\n(\nx\n)\np(x)\np\n(\nx\n)\nwhose coefficients satisfied a given condition. The third and fourth problems were concerned with optimal approximations of a\nrational function\non a given interval subject to given restrictions elsewhere. He found the\nn\nn\nn\nth degree polynomial with two of its coefficients fixed which is closest to zero. In\n[\n10\n]\nthe best approximation to\n1\n1\n+\nx\n\\Large\\frac{1}{1+x}\\normalsize\n1\n+\nx\n1\n​\non\n[\n0\n,\n1]\nby a quadratic polynomial is given as an example of how Zolotarev's methods can be used."
}