{
  "nome_completo": "Elena Moldovan Popoviciu",
  "nome_curto": "Elena Moldovan Popoviciu",
  "ano_nascimento": "1924",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Popoviciu_Elena/",
  "lugar_nascimento": "Cluj, Romania",
  "lugar_morte": "Cluj, Romania",
  "biografia": "Elena Moldovan\n, the daughter of Ioan Moldovan and of his wife Rozalia, was born in August\n1924\nin Cluj. She married the mathematician\nTiberiu Popoviciu\nin\n1964\nand, from that time on, was known as\nElena Popoviciu\n. She wrote papers both under the name of Elena Moldovan and the name Elena Popoviciu. We will use both the names Elena Moldovan and Elena Popoviciu throughout this biography, trying our best to use the correct name for the time to which we refer. She attended primary and secondary school in Cluj where, in addition to showing an outstanding talent for mathematics, she also showed great talents in painting, music and literature.\nAfter graduating from high school, Elena began her studies at the University of Cluj. In August\n1940\n, after the start of World War II, the north-west part of Romania\n(\nincluding Cluj\n)\nwas surrendered to Hungary in the Vienna Dictate. This was a decision taken in Vienna under severe pressure from the German Third Reich. The Romanian university in Cluj moved to Alba-Iulia, Turda, Sibiu and Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. It was the Babeș University of Cluj that Elena Moldovan entered and she was awarded a bachelor's degree in mathematics in the summer of\n1947\n. After graduating, she was appointed as an instructor in a high school in Cluj.\nElena Moldovan studied for a Ph.D. in Mathematics. She began research advised by the academician\nGrigore Calugăreănu\nbut, after a while, fascinated by the remarkable personality of\nTiberiu Popoviciu\n, her research topic moved to convex function theory and interpolation function theory. From that time on her research was supervised by the academician\nTiberiu Popoviciu\n. She began publishing papers in Romanian, the first being\nObservations on certain generalised processes of interpolation\n(1954)\nin which, for\nFejér\n's interpolation polynomials, which converge for every continuous function, she found a formula for the order of the approximation. Her next papers were, in Romanian,\nOn a generalisation of the notion of convexity\n(1955)\n,\nOn certain theorems about means\n(1956)\n, and\nProperties of generalised convex functions\n(1957)\n. In a long series of articles she studied approximation by interpolatory sets, convexity with respect to them, etc. She was awarded a Ph.D. in\n1960\nafter submitting her thesis entitled\nSets of Interpolating Functions And The Notion of Convex Function\n.\nHer work on generalising the concept of convexity formed the basis of her research over the whole of her career. She introduced the 'allure' or 'behaviour' of a function. As an example of this concept we give one of her own examples. The allure of a function\nf\nf\nf\nis whether the Lagrange interpolating polynomial of degree\nn\nn\nn\nhas leading coefficient greater than zero, or less than zero, or equal to zero. The authors of\n[\n1\n]\ndiscuss this work in detail. We give here their introduction to the Chapter of their book entitled 'Behaviours. Convexity with respect to a behaviour':-\nThe concept of behaviour of an object is largely used in order to make the difference between things. As a mathematical concept, Elena Popoviciu used the term 'behaviour' for the first time in\n1965\n, on the occasion of a conference held at the Babeș-Bolyai University of Cluj, without publishing it. The discussions on this theme have been reconsidered during the meetings of the Interdisciplinary Researches Laboratory of the Babeș-Bolyai University of Cluj between\n1980\n-\n83\n. In this period, she wrote especially about the particular case of behaviours that are shapes of functions, in order to generalise the property of convexity of a function. The main results in this direction are written down in the papers of E Moldovan\n(1955\n,\n1958\n,\n1959)\nand\n[\nunder her married name\n]\nE Popoviciu\n(1969\n,\n1972\n,\n1983)\n.\nThe entire didactical activity of Elena Popoviciu took place at the Faculty of Mathematics of the University of Cluj. The authors of\n[\n5\n]\nwrite about her marriage in\n1964\n:-\nShe married the academician\nTiberiu Popoviciu\nin\n1964\n, whom she helped to build the prestige of the Cluj mathematical school, at the same time offering the academician a pleasant family environment, so much needed for a person involved in the academic creation.\nFrom\n1969\n, Elena Popoviciu was appointed a full professor in the Mathematical Analysis Chair of the Babeș-Bolyai University of Cluj. She taught several courses such as: Mathematical Analysis, Abstract Algebra, Functional Analysis, Linear Programming, Distribution Theory, Approximation Theory, and Operational Calculus.\nStarting with\n1974\n, Elena Popoviciu became a Ph.D. supervisor and, in total throughout her career, she supervised\n23\ndoctoral students. Elena Popoviciu founded, in\n1960\n, the research Seminar on Best Approximation and Mathematical Programming and, in\n1974\n, the Interdisciplinary Research Laboratory. These achievements were highlighted in the announcement of her death put out by the Babeș-Bolyai University Cluj:-\nThe Faculty of Mathematics and Computer Science from the University \"Babeș-Bolyai\" Cluj-Napoca announces, with deep sorrow, the passing of prof. Dr. doc. Elena Popoviciu, a mathematician with broad national and international recognition. Prof. Doc. Elena Popoviciu was one of the main contributors to the school of Mathematical Analysis in Cluj, mentor to many generations of students and PhD coordinator. For many years she directed the Seminar \"Tiberiu Popoviciu\" on Functional Equations, Approximation and Convexity. She founded the Interdisciplinary Research Laboratory. The Romanian School of Mathematics loses today one of its highly valued people.\nElena Popoviciu was also very much involved in the editorial work of the following journals:\nRevue d'Analyse Numérique et de Théorie de l'Approximation\nand\nAnnals of the\nTiberiu Popoviciu\nSeminar of Functional Equations, Approximation and Convexity\n. A conference was held in her honour at Cluj-Napoca on\n15\n-\n16\nOctober\n1999\non the occasion of her\n75\nth\nbirthday. The topics of the conference were analysis, functional equations, approximation and convexity. Wolfgang Breckner contributed the biographical article\n[\n3\n]\nwhile Elena Popoviciu contributed the article\nLes mathématiques sont les plus belles parmi les disciplines scientifiques\nwhich she summarised as follows:-\nThe purpose of the paper is to present some results concerning my theory of allure. This presents a new point of view in the analysis of various convexity properties and their applications.\nThe proceedings of the conference also contains her biographical article\nLife is beautiful if you understand it, if you live it with dignity, if you don't betray it\n(\nRomanian\n)\n. Five years later, on\n30\nSeptember\n2004\n, a Scientific Session was organised at the Babeș-Bolyai University of Cluj-Napoca to celebrate Elena Popoviciu's eightieth birthday. The scientific sessions took place in the\nTiberiu Popoviciu\nAmphitheatre, named after her late husband, and a celebratory dinner was held in the evening in University House.\nElena Popoviciu wrote several articles which give great insight into the research group that she and her husband ran in Cluj. In\n1992\nshe wrote\nHommage à l'occasion d'un important anniversaire\nⓉ\n(\nTribute to an important anniversary\n)\nin which she discussed some results about convexity obtained by\nTiberiu Popoviciu\nand his students. Five years later she wrote\nSur certaines allures remarquables\nⓉ\n(\nOn some remarkable attractions\n)\n(1997)\n. We quote from her introduction:-\nI would like to present some ideas of\nTiberiu Popoviciu\nwhich strongly influenced certain branches of mathematics. It is going mainly into his research on convexity, on approximation theory, and on extensions of these two domains towards\nfunctional analysis\nand other branches of modern mathematics, including e.g., theoretic and practical computing.\nIn\n2002\nshe wrote\nUn important anniversaire pour la science roumaine\nⓉ\n(\nAn important anniversary for  Romanian science\n)\nwhich she summarised as follows:-\nWe commemorate the foundation, in\n1957\n, of the Institute of Numerical Analysis in Cluj-Napoca, by\nTiberiu Popoviciu\n. We underline the research programme of the Institute and the main results obtained here.\nElena Popoviciu died in June\n2009\nat Cluj-Napoca."
}