{
  "nome_completo": "Ann Elizabeth Hammer Fennema",
  "nome_curto": "Elizabeth Fennema",
  "ano_nascimento": "1928",
  "ano_morte": "2021",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fennema/",
  "lugar_nascimento": "Winfield, Kansas, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Elizabeth Fennema\nwas given the name\nElizabeth Hammer\n. She only became Elizabeth Fennema after her marriage. We use the name Elizabeth up to the time of her marriage but, since we also describe something of her husband, we will make every effort to always distinguish the two. About a year after she was born, the United States went into recession which, by the end of\n1929\n, had become markedly worse. In October\n1929\nthe stock market crashed and Elizabeth's father was one of thousands of Americans who lost everything overnight. Unable to take the dramatic situation, Elizabeth's father left home and her mother had the sole responsibility of bringing up Elizabeth and her brother\n[\n3\n]\n:-\nElizabeth's mother had been born in\n1889\nand had overcome familial pressures and extreme poverty, common in the southern United States at that time, to attend Valparaiso University. She taught in one-room schools and in small city schools. However, because in the early\n1930\ns schools and most businesses would not hire married women, she took in sewing in order to earn needed money for family expenses. Elizabeth describes her mother as a strong woman who made her children feel secure by not focusing on the fact that they had little money.\nElizabeth was very talented musically and through her elementary schooling and beyond she had absolutely no doubts that she wanted to be a musician and have a career in music. She attended Winfield High School and her name appears in the\n1944\nand in\n1945\nLagondan Yearbook. At this High School she met Owen Richard Fennema who was born on\n23\nJanuary\n1929\n, in Hinsdale, Illinois, the son of Nicolas Fennema, a dairy plant owner, and Fern First. Both Elizabeth Hammer and Owen Fennema graduated from Winfield High School in\n1946\n. Elizabeth then had a difficult decision to make. She was offered a scholarship to study at the highly rated Eastman School of Music, part of the University of Rochester, New York. This would seem like a dream come true for the young girl who was passionate about music and had dreamed of a musical career since elementary school. However, things were not so simple. Already at this time Elizabeth and Owen Fennema had fallen in love and were intending to marry. After graduating from Winfield High School, Owen was going to study dairy manufacturing at Kansas State College in Manhattan, Kansas and Elizabeth didn't want to be far from him in New York. She had other reasons to change her plans to become a professional musician. At this time orchestras were composed almost exclusively of men and, even if she was successful at joining a professional orchestra, the life-style was not suitable for a married lady. She decided to study at Southwestern College in Winfield, entering in\n1946\n.\nSouthwestern College was a Methodist college and Elizabeth attended it for two years. While there she played in the school orchestra, her instrument being a bass. While she was a member, the Southwestern College Orchestra played a three day tour for the first time, playing in schools and churches around Winfield. The string section of the orchestra played in a Christmas concert and the orchestra gave a formal concert in May. As well as playing in the orchestra, Elizabeth was the orchestra's librarian.\nOn\n22\nAugust\n1948\n, Elizabeth married Owen Fennema at Winfield. In the autumn of that year Elizabeth Fennema entered Kansas State College where she studied psychology for the next two years. In the\n1949\nKansas State College Yearbook, Elizabeth Fennema is recorded as playing the bass in the College Orchestra. In the\n1950\nRoyal Purple Yearbook of the College, Owen is recorded in the School of Agriculture and Elizabeth in the School of Arts and Sciences. Both graduated in\n1950\n, Elizabeth in Psychology and Owen in Dairy Manufacturing; both were Phi Kappa Phi.\nAfter graduating, both Elizabeth and Owen moved to the University of Wisconsin-Madison where Owen spent a year in which he obtained an M.S. degree in Dairy Industry. Elizabeth would have liked to find a graduate position in psychology but these were difficult to come by so she enrolled for a Master's Degree in Education at the University of Wisconsin-Madison. After graduating in\n1951\n, with the Korean War requiring American military, Owen served from\n1951\nto\n1953\nas\n2\nnd Lieutenant Ordinance in the U.S. Army, stationed in Fort Hood, Texas. Elizabeth completed her Master's Degree in Education and graduated in\n1952\n. She moved to Fort Hood, Texas to be with her husband and it was there that their first child, a daughter Linda Gail Fennema, was born on\n3\nSeptember\n1953\n. Owen and Elizabeth moved to Minneapolis, Minnesota, later in\n1953\nwhere Owen worked for Pillsbury, one of the world's largest producers of grain and other foods, in the research department. At this point Elizabeth made her first move into designing an educational course when she opened a private kindergarten in the basement of their home in Minneapolis. While in Minneapolis, the Fennemas second child, another daughter Karen Elizabeth Fennema, was born on\n24\nJune\n1956\n.\nIn\n1957\n, the Fennemas moved to back to Madison where Owen studied for a Ph.D. in food science at the University of Wisconsin-Madison. He was awarded the degree in\n1960\nand employed as a professor in food science at the University of Wisconsin-Madison. Elizabeth, with two young children to look after, did not have many opportunities to work, especially since nepotism rules prevented her working at the university. She had a number of jobs mostly based at her home. On\n13\nApril\n1960\nthe Fennemas third child, a boy Peter S Fennema, was born. Two years later an initiative by Kathryn Frederick Clarenbach\n(1920\n-\n1994)\nchanged Elizabeth's life.\nKathryn Clarenbach had a Ph.D. from the University of Wisconsin-Madison and, like Elizabeth Fennema, had three young children. In\n1961\nshe took up a teaching position at Edgewood College in Madison and, in the following year, she was asked by the University of Wisconsin to devise a programme of continuing education for women. She identified a group of wives of professors at the University who were not employed\n(\nor under-employed\n)\nand\n[\n3\n]\n:-\n... sent out questionnaires asking about their interest in a career. She got a very positive response and began to connect these women with appropriate jobs, advocating for them in the process. As a result of this effort, Fennema was asked to be a supervisor of student teachers. She agreed to do this and was fortunate that her mother moved to Madison to help take care of her children. As a supervisor of student teachers Fennema worked for Vere DeVault, whom she describes as kind and perceptive. He recognised her abilities and encouraged her to pursue a doctorate in education. She began her studies in\n1962\nwith DeVault as her dissertation advisor ...\nVere DeVault\n(1922\n-\n2010)\n, who had a doctorate from Indiana University for his thesis\nTelevision and consultant services as methods of in-service education for elementary school teachers of mathematics\n, was a professor at the University of Wisconsin-Madison. He advised Elizabeth Fennema who worked on children's learning of mathematics\n[\n3\n]\n:-\nIn\n1962\nthe \"new math\" movement was in full swing, which meant that lots of educators and mathematicians were thinking hard about how to get students to understand mathematics more deeply. Fennema was intrigued with the research about children's learning of mathematics. She also recognised that a good education in mathematics is critical for all students. This perception led her to specialise in mathematics as she began to focus on the topic for her dissertation.\nShe was awarded a Ph.D. in\n1969\nfor her thesis\nA study of the relative effectiveness of a meaningful concrete and a meaningful symbolic model in learning a selected mathematical principle\n. After completing the Ph.D. she was given a part-time position by the University of Wisconsin-Madison. At first this was not a tenure-track position but, soon after her appointment, the university created part-time tenure-track positions and Fennema was given one of these. The part-time position suited her well since she was then able to have both a career and look after her children who were still young.\nEncouraged by Joan Roberts, a lecturer at Wisconsin-Madison in the Educational Studies programme, Fennema was persuaded to write about her discipline. Roberts gave the first women's studies course,\nEducation and the status of women\n, at Wisconsin-Madison in\n1970\n. Fennema's first article about gender, a review of extant work on sex difference in mathematics, was published in the\nJournal of Research in Mathematics Education\nin\n1974\n.\nThis was her first paper but it was another project led to a large output of papers. This was the result of a successful application to the National Science Foundation for a grant to carry out a joint project with Julia Sherman who was in the psychology department and had written the important work\nOn the psychology of women\n(1971)\n. They published\nFennema-Sherman Mathematics Attitude Scales: Instruments designed to measure attitudes towards the learning of mathematics by females and males\n(1976)\n,\nSex-related differences in mathematics achievement, spatial visualization, and affective factors\n(1977)\n,\nThe study of mathematics among High School girls and boys: Related factors\n(1977)\nand\nSex-related differences in mathematics achievement and related factors: A further study\n(1978)\n.\nFor information about the results of this study, and many other similar studies, read Fennema's\n2000\nlecture at\nTHIS LINK\n.\nMarjorie L DeVault gives an interesting account of Fennema's course in the early\n1970\ns\n[\n1\n]\n:-\nWith other women in the department of Curriculum and Instruction, I began to explore what feminist scholarship might be. In the early\n1970\ns, I was a member of that department's first graduate course in women's studies, \"Issues in Sex-related Differences in Curriculum and Instruction,\" a seminar offered by Elizabeth Fennema, who had already begun to challenge the prevailing wisdom about girls' mathematical performance. We had a wonderful time, but there were lurking anxieties; it seemed odd and a bit risky, then, to give serious attention to women and girls. Several times, I heard Liz, in the course of telling about the seminar, offer a laughing apology. \"Well,\" she would say, \"these students have to take the blame for all this.\" Smiling, we would correct her: credit, not blame! But I was struck by the sense of vulnerability that produced this kind of nervous joke.\nFennema's paper\nGender and Mathematics: What is Known and What do I Wish was Known?\n(\na version is available at the\nTHIS LINK\n)\nwas delivered in the year\n2000\nand it gives a good overview of Fennema's research and changing views over her career as well as the research of many others in this area. This paper was written several years after she retired from her professorship at the University of Wisconsin-Madison, this being in\n1996\n. At this point she was made Emerita Professor of Curriculum and Instruction and Senior Scientist at the Wisconsin Center for Education Research at the University of Wisconsin-Madison. She certainly didn't stop undertaking research and, more recently, has published several multi-authored papers including\nMathematics, Gender, and Research\n(2002)\n,\nGender Comparisons of Mathematics Attitudes and Affect: A Meta-Analysis\n(2006)\nand the second edition of her book\nChildren's Mathematics: Cognitively Guided Instruction\nappeared in\n2014\n, the first edition appearing in\n1999\n.\nAmong the honours that Fennema received we mention the first Annual Award for Outstanding Contribution to Research on Women and Education from the American Educational Research Association in\n1985\n, and the Dora Helen Skypek Award from the Association for Women and Mathematics Education in\n1986\n. The citation reads:-\nWe are pleased to honour you for your extensive contributions in promoting the mathematics education of girls and women, and in facilitating the awareness of gender inequalities in our classrooms. You have effectively inspired and mentored a new generation of researchers and educators. You, a founding member of the Association for Women and Mathematics Education, will always be a member of our community.\nShe was awarded an honorary degree, Doctor of Humane Letters, from Mount Mary College in\n1994\n.\nOwen Fennema retired in\n1996\n, the same year as Elizabeth. The Fennemas lived half of the year in Middleton, Wisconsin, and the other half in their home in Green Valley, Arizona. Owen died from complications as a result of bladder cancer, surrounded by his family on Wednesday,\n1\nAugust\n2012\n, at Agrace Hospice Care. Following Owen's death there was a move to set up the Owen R Fennema Professorship in Food Chemistry. Elizabeth wrote at this time:-\nWhen I learned about the upcoming drive to establish the Owen Fennema Professorship, I was in tears. As a retired professor also, I know what it means to have a professorship named for him. I have increasingly learned through communications with others, how much Owen contributed to the science of food. His contributions started early and continued throughout his lifetime as many have attested. He also was an amazing father to our three children and a loving husband of\n64\nyears. I miss him. I support the establishment of a professorship completely and think not only that it should be but that it is a way of honouring him indefinitely. He would have scoffed at his worthiness to receive such an honour, but the rest of us know that he deserves such recognition."
}