{
  "nome_completo": "Emil Grosswald",
  "nome_curto": "Emil Grosswald",
  "ano_nascimento": "1912",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grosswald/",
  "lugar_nascimento": "Bucharest, Romania",
  "lugar_morte": "Narberth, Pennsylvania, USA",
  "biografia": "Emil Grosswald\nwas born into a Jewish family in Bucharest. He studied at the University of Bucharest, being awarded his Master's degree in\n1933\n. The rise of anti-Semitism in Romania and the horror of the Nazi policies in Germany towards the Jews made Grosswald decide to France to further his education. He studied in studies in Paris and Montpelier, being in Paris in June\n1940\nwhen the city fell to the advancing German armies. He fled on foot to Orleans, then on to Spain as he sought safety.\nFrom Spain Grosswald found a boat which took him to Cuba. He spent the remaining years of World War II in Havana, then in\n1946\nhe went to Puerto Rico, eventually moving to the United States where he was able to register for doctoral studies at the University of Pennsylvania under the supervision of\nHans Rademacher\n. In\n1950\nhe was awarded his Ph.D. for his thesis\nOn the Structure of Some Subgroups of the Modular Groups\n. He also wrote two papers which were published in\n1950\n, the first being\nOn a simple property of the derivatives of Legendre's polynomials\nwhile the second was\nFunctions of bounded variation\n.\nGrosswald's first post was at the University of Saskatchewan where he taught for a year, then he spent a year at the Institute for Advanced Study at Princeton before returning to a permanent post at the University of Pennsylvania. He remained at the University of Pennsylvania until\n1968\nwhen he was appointed as Professor of Mathematics at Temple University in Philadelphia. In\n1980\nhe retired but spent the academic year\n1980\n-\n81\nat the Technicon in Haifa, Israel. Returning to the United States he spent\n1982\nas a visiting professor at Swarthmore College and\n1984\nat the University of Pennsylvania.\nAn analyst, specializing in analytic number theory, Grosswald also wrote on classical analysis and related topics. He wrote a number of important books:\nTopics from the theory of numbers\n(1966)\n,\nBessel polynomials\n(1978)\n,\nDedekind sums\n(\nwritten jointly with\nHans Rademacher\n)\n(1972)\n, and\nRepresentations of integers as sums of squares\n(1985)\n. Let us look at each in turn.\nFirst we look at\nTopics from the theory of numbers\n. We quote from the Preface Grosswald's own explanation of how he came to write the text:-\nIt was only with considerable doubt that I gave in to the insistence of some of my students and colleagues\n(\nand editors\n)\nand decided to 'polish' my notes in order to write the present volume. Indeed, there existed in English several excellent books on number theory on a comparable level, and I was not convinced that there was a need for still another one, or that I could improve on those previous presentations. However, with the 'finished product' in front of me, it seems that there is rather little overlap with any other text I know of, except of course, for the most fundamental topics which are common to all books in this field. Also the style seems to be different from that of most other books because of both the emphasis given to the historical point of view and the inclusion of references to a large amount of source material\n(\nbooks and papers\n)\nquoted in the text and bibliographies.\nTopics covered include: the fundamental theorem of arithmetic, congruences, the quadratic reciprocity theorem, the standard arithmetical functions, the prime number theorem,\nFermat's last theorem\n, and the theory of partitions. B Gordon, reviewing the text, writes:-\nThe author has certainly planned his book well, chosen material that will be stimulating to its intended audience, and carried the project through in such a way that interest seldom flags.\nFor the second edition of the text published in\n1984\n, Grosswald had added material on\nL\nL\nL\n-functions and primes in arithmetic progressions, the arithmetic of number fields, and\nDiophantine equations\n.\nIn\nBessel polynomials\nGrosswald studies: the relationship between\nBessel functions\nand\nBessel\npolynomials, differential equations and differential recurrence relations satisfied by the generalized\nBessel\npolynomials, recurrence relations satisfied by the generalized\nBessel\npolynomials, orthogonality properties of the generalized\nBessel\npolynomials and the corresponding moment problem, relations of the generalized\nBessel\npolynomials and the classical orthogonal polynomials, generating functions,\nRodrigues\n-type formulas, the generalized\nBessel\npolynomials and continued fractions, the zeros of the\nBessel\npolynomials, algebraic properties of the\nBessel\npolynomials, and the\nGalois\ngroup of the\nBessel\npolynomials.\nThe collaboration between\nRademacher\nand Grosswald on\nDedekind sums\ncame about due to\nRademacher\n's illness. He was to be\nHedrick\nLecturer for the summer meeting of\n1963\nin Boulder, Colorado, and had written up notes for his lectures on\nDedekind\nsums before falling ill. Grosswald was asked to deliver the lectures in his place and\nRademacher\nasked Grosswald to edit the notes with a view to publishing them under their joint names.\nRademacher\ndied in\n1969\nand the joint publication appeared three years later, ten years after the notes were first written.\nThe book\nRepresentations of integers as sums of squares:-\n... presents a deeply meaningful walk through history with the problem of representations by the sum of squares. The author's purpose is to show unity in mathematics not by abstraction but by showing how this problem clarifies and is clarified by successive stages of mathematical evolution.\nWe should mention some other contributions that Grosswald made. He edited\nRademacher\n's\nTopics in Analytic Number Theory\n(1973)\nand\nCollected Papers\n(1974)\n. He was on the Board of Governors of the\nMathematical Association of America\nfrom\n1965\nto\n1968\n. He also served on the Ford Award Committee from\n1970\nto\n1977\n.\nGrosswald's wife, Elizabeth Rosenthal, died exactly one month after her husband. They had two daughters Blanche and Vivian."
}