{
  "nome_completo": "Enno Heeren Dirksen",
  "nome_curto": "Enno Heeren Dirksen",
  "ano_nascimento": "1788",
  "ano_morte": "1850",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dirksen/",
  "lugar_nascimento": "Eilsum, Frisia, Germany",
  "lugar_morte": "Paris, France",
  "biografia": "Enno Heeren Dirksen\n's parents were Dirk Heeren Dirksen and Elisabeth Berends. Dirk had been born in Bedekaspel in\n1737\nbut moved to Eilsum were he was an agricultural worker. He met Elisabeth in Eilsum. She had been born in Visquard in\n1752\nand, when she met Dirk, was working as a maid in Uiterstewehr. Dirk and Elisabeth were married in\n1784\nand only one of their children, Enno Heeren the subject of this biography, survived beyond childhood. Frisia, the area where Enno was born, was divided into Friesland, East Friesland and North Friesland in\n1815\n. We have already mentioned the villages of Bedekaspel, Eilsum, Uiterstewehr and Visquard, all in East Friesland\n(\nor Ostfriesland\n)\nwithin a\n15\nkm radius of Emden, the main city in the district and a seaport on the river Ems.\nIt is possible that Enno lived for a while in Hamswehrum, about\n7\nkm south west of Eilsum\n(\nand still within\n15\nkm of Emden\n)\n, as he was growing up since he had relations there and a number of older biographies incorrectly gave Hamswehrum as his place of birth. Between\n1803\nand\n1807\nDirksen received private lessons in mathematics, physics, astronomy and navigation from Cornelius Voorn who was a teacher at the Emden Navigation School. At this stage Voorn hoped that Dirksen would succeed him as teacher at the Navigation School. After completing this course of private lessons, Dirksen became a teacher in Hatzum, about\n10\nkm south east of Emden. He taught there until\n1815\nwhen he moved to Hinte,\n6\nkm north of Emden, where again he taught in the local school. Soon after he began teaching in Hinte, Jabbo Oltmanns, a mathematician who worked in Emden, suggested that Dirksen should study mathematics at Göttingen University to improve his mathematical skills. On\n22\nApril\n1817\n, he followed Oltmanns' suggestion and matriculated at Göttingen. He spent three years there being taught by\nGauss\nas well as by B F Thibaut, J T Mayer and G F Sartorius. Bernhard Friedrich Thibaut\n(1775\n-\n1832)\nwas the professor of mathematics at Göttingen and renowned as an exceptional teacher. Johann Tobias Mayer\n(1752\n-\n1830)\n, the son of\nTobias Mayer\n, was a physicist who had written well-known mathematics and physics textbooks. Georg Friedrich Sartorius\n(1765\n-\n1828)\nwas the professor of economics and history.\nDirksen studied for his doctorate advised by Mayer and Thibaut, although he also assisted\nGauss\nin calculating the orbits of comets and asteroids. He was awarded his doctorate on\n5\nFebruary\n1820\nfor his thesis\nHistoriae progressuum instrumentorum mensurae angulorum accuratiori interserventium inde a Tob. Meyeri temporibus ad umbratione non de artificio multiplicationis\nⓉ\n(\nHistory of development of instruments to measure angles accurately ...\n)\n. In this work he considered the improvements which had been made to the reflecting circle after it was invented by\nTobias Mayer\n. In October\n1819\nDirksen had requested support from the ministry in Hanover so that he could spend a year in Berlin working at the Academy of Architecture with Johann Albert Eytelwein. This was approved and he went to Berlin early in\n1820\nbut quickly changed his plans and began working for the astronomer Johann Elert Bode\n(1747\n-\n1826)\n, the director of the Berlin Observatory who is famed for 'Bode's law' giving distances of the planets from the sun. Dirksen assisted Bode both in making observations and in doing mathematical computation and he\nhabilitated\nat Berlin University on\n6\nMay\n1820\nas an expert in astronomy in the Mathematics Department. His inaugural lecture was entitled\nÜber eine zweckmässige Methode, die Opposition eines Planeten mit der Sonne zu berechnen\nⓉ\n(\nOn an expedient method to calculate the opposition of a planet with the sun\n)\n. It discussed a method of calculating the opposition of a planet with the sun.\nOn\n26\nAugust\n1820\nthe Prussian Ministry appointed Dirksen as an extraordinary professor in Berlin University and four years later, on\n18\nJune\n1824\n, he was appointed as a full Professor of Mathematics. Two months later Jabbo Oltmanns, a friend whom he had known when in Emden, was appointed as Professor of Applied Mathematics in Berlin University. Dirksen was elected to the\nBerlin Academy of Sciences\non\n9\nJune\n1825\nand over the next twenty plus years he served both the University and the Academy. He married Pauline von Wingene\n(1809\n-\n1858)\nin\n1838\n; they had one son who died as a baby. He retired from teaching at the University in the winter semester of\n1848\n-\n49\nand, already seriously ill, went with his wife to Paris. After his death in Paris he was buried in the Montmartre cemetery.\nWe cannot rate Dirksen highly as a research mathematician but his role in the development of Berlin University as a world-class mathematical centre is substantial. One of the most notable contributions he made was in his role as a thesis advisor. Among around twenty students whom he advised, the most famous are\nCarl Jacobi\n(\ndoctorate in\n1825)\n,\nAdolph Göpel\n(\ndoctorate in\n1835)\n, and\nEduard Heine\n(\ndoctorate in\n1842)\n. We must, however, also mention some of his publications.\nAnalytische Darstellung der Variations-Rechnung, mit Anwendung derselben auf die Bestimmung des Grössten und Kleinsten\nⓉ\n(\nAnalytical representation of the calculus of variations, with its application to the determination of the greatest and smallest\n)\n(1823)\nis one of the earliest comprehensive accounts of the calculus of variations. This work was highly praised in reviews at the time and recommended as necessary reading by anyone wishing to delve deeply into the calculus of variations. He also published\nÜber die Anwendung der Analysis auf die Rectification der Curven, die Quadratur der Flächen und die Cubatur der Körper\nⓉ\n(\nOn the use of analysis on the rectification of the curves, the quadrature of the surfaces and the volume of bodies\n)\n(1835)\nand\nÜber die Darstellbarkeit der Wurzeln einer allgemeinen algebraischen Gleichung mittelst expliceter algebraischer Ausdrücke von den Coëfficienten\nⓉ\n(\nOn the description of the roots of a general algebraic equation with explicit algebraic expressions for the coefficients\n)\n(1836)\n. His final work was the first part of\nOrganon der gesamten transcendenten Analysis\nⓉ\n(\nOrganisation of entire transcendental analysis\n)\n(1845)\nin which he tried to unify many different problems in transcendental\nnumber theory\n. Extensive notes and drafts of further parts of this work were among the manuscripts he left at the time of his death.\nFinally we note that his somewhat old-fashioned approach to mathematics at a time when new techniques were rapidly being developed led to arguments between Dirksen and various colleagues. Perhaps the colleague with whom he argued most frequently was\nMartin Ohm\n. However, it is clear that\nMartin Ohm\nfell out with all his colleagues both because of his views on teaching and the fact that he thought so highly of himself."
}