{
  "nome_completo": "Ernest Julius Wilczynski",
  "nome_curto": "Ernest Wilczynski",
  "ano_nascimento": "1876",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilczynski/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Denver, Colorado, USA",
  "biografia": "Ernest Wilczynski\nparents were Max Wilczynski and Friederike Hurwitz. He attended school in Hamburg for two years. Then his family emigrated to the United States and settled in Chicago. Wilczynski attended schools in Chicago, but rather than take his university education in the United States he returned to Germany to study at the university of Berlin.\nWilczynski was taught at Berlin by some outstanding mathematicians including\nFuchs\n,\nHensel\n,\nPlanck\n,\nPringsheim\n, Schlesinger and\nSchwarz\n. He received his doctorate from the University of Berlin in\n1897\nand returned to the United States. He did not find a university post and decided to take a temporary post in the Office of the Nautical Almanac in Washington D.C. However, in\n1898\n, he was offered a position as instructor at the University of California.\nIn\n1902\nWilczynski was promoted to assistant professor at Berkeley, then in\n1906\nto associate professor. During the years from\n1903\nto\n1905\nWilczynski worked in Europe as associate of the Carnegie Institution. During his time in Verona, Italy he met his future wife and they were married in\n1906\n. Wilczynski moved to the University of Illinois in\n1907\n, then in\n1910\nhe was appointed to Chicago filling a vacancy caused by the death of\nMaschke\nin\n1908\n. Promotion to a full professor came at Chicago in\n1914\nbut by\n1919\nhis health began to fail. He continued to teach and carry out his other duties under increasing difficulties. Lane writes in\n[\n3\n]\n:-\n... in the midst of a lecture\n[\nin\n1923]\nhe finally realised that he could go no further and, with a simple statement to that effect, walked from his classroom never to return, leaving his students amazed by the classic self-restraint with which he accepted his tragic fate. It is characteristic of the man, however, that during the long illness which followed he never lost his interest in geometry and never gave up hope and the belief that he would some day be able to return to his academic duties.\nWilczynski began his research career as a mathematical astronomer. This interest lasted until he was appointed to Berkeley. By that time he had published over a dozen papers in astronomy, but his interests moved towards\ndifferential equations\nwhich arose in his study of the dynamics of astronomical objects. From there his interests became pure mathematical interests in differential equations. However, Wilczynski's main work was in projective\ndifferential geometry\nand ruler surfaces. He extended\nHalphen\n's work, devised new methods and extended the theory of curves to surfaces. Lane\n[\n3\n]\nwrites:-\nIt has often been stated that Wilczynski was the founder, or inventor, of projective differential geometry. This is not quite precise, for\nHalphen\nin the latter part of the nineteenth century was the first ever consciously to undertake and carry to fruition a systematic projective differential investigation. He was primarily interested in curves in the plane and in ordinary space. But Wilczynski was the first ever to appreciate, demonstrate and exploit the utility of completely integrable systems of linear homogeneous differential equations for projective differential geometry.\nWilczynski received many honours for his outstanding research contributions. He was Colloquium lecturer for the\nAmerican Mathematical Society\nin New Haven in\n1906\ntogether with\nMax Mason\nand\nEliakim Moore\n. In addition he served as vice-president of the\nAmerican Mathematical Society\nand as a council member of the\nMathematical Association of America\n. Among the prizes which he won was one awarded by the\nRoyal Belgium Academy of Sciences\nin\n1909\n. He was elected to the\nNational Academy of Sciences\nin\n1919\n, the year illness began to affect him.\nIt is not only as a research mathematician that Wilczynski excelled. He was a talented teacher bringing clarity through his carefully prepared lectures and extremely talented in mathematical exposition whether it was in English or German. He was almost equally at home with French or Italian. He is described by Lane\n[\n3\n]\nas:-\n... gentle, his manner mild. He was unselfish and habitually thoughtful to others."
}