{
  "nome_completo": "Ernest-Paulin-Joseph Vessiot",
  "nome_curto": "Ernest Vessiot",
  "ano_nascimento": "1865",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vessiot/",
  "lugar_nascimento": "Marseilles, France",
  "lugar_morte": "La Bauche, Savoie, France",
  "biografia": "Ernest Vessiot\n's father was Alexandre Vessiot\n(1829\n-\n1908)\nand his mother was Marie Collin. Alexandre Vessiot studied at the École Normale Supérieure and was a professor of rhetoric at the Lycée in Marseilles when his son Ernest was born. In\n1886\nAlexandre was appointed inspector general of primary schools. He wrote several books on education including\nDe l'enseignement à l'école: et dans les classes élémentaires des lycées et collèges\nⓉ\n(\nFrom teaching at school: and in the elementary grades of secondary schools\n)\n(1886)\nand\nDe l'éducation à l'école\nⓉ\n(\nEducation at school\n)\n(1887)\n. Alexandre married Marie and they had eight children, six of whom survived to adulthood: Paul Vessiot\n(1859\n-\n1942)\n, Louise Vessiot\n(1858\n-\n1960)\n, Ernest Vessiot\n(\nthe subject of this biography\n)\n, Henri Vessiot\n(1870\n-\n1946)\n, Marthe Vessiot\n(1872\n-\n1945)\nand Anna Vessiot\n(1874\n-\n1950)\n. The historian Camille Jullian\n(1859\n-\n1933)\nwas a pupil in Alexandre Vessiot's class and wrote about his outstanding qualities as both a teacher and as a person. These qualities meant that Ernest was brought up in an academic environment in which there was a kind and understanding encouragement to hard work.\nErnest's secondary education was at the lycée in Marseilles where his performance was outstanding and he obtained his baccalaureate in\n1883\n. He did not go straight to university but took the special mathematics class in\n1883\n-\n84\nbefore sitting the entrance examination for the École Normale Supérieure and the École Polytechnique in\n1884\n. An outbreak of cholera in Marseilles almost prevented him taking the examinations\n(\nhis family wanted him to leave the city\n)\nbut he persisted. In the entrance examination Vessiot was placed second to\nJacques Hadamard\nand thereafter he studied in the same class as\nHadamard\n. During his university studies, as well at taking classes at the École Normale Supérieure, he also attended courses at the Faculty of Sciences. He took\nJean-Claude Bouquet\n's course on differential and integral calculus. This was the final course that\nBouquet\ngave and he died in September\n1885\n. Vessiot also took\nPaul Appell\n's course on rational mechanics. Appell was appointed to the Chair of Mechanics at the Sorbonne in\n1885\n. Vessiot was awarded his bachelor's degree in mathematics and physics in\n1886\n. He continued to study for his\nAgrégation de mathématiques\n, the qualification needed to teach mathematics in a lycée. He was awarded this degree in\n1887\nand then spent the year\n1887\n-\n88\nin Germany.\nVessiot accepted a teaching post at the Lycée\nAmpère\nin Lyon in\n1887\nand began teaching there after his return from Germany. This school, originally a Jesuit establishment, had been founded in\n1519\nand given several different names before being named the Lycée de Lyon in\n1848\nand then the Lycée\nAmpère\nin the year that Vessiot began teaching there. In his first year at the Lycée he taught elementary mathematics courses but in his second year he was put in charge of the special mathematics class. However, school teaching was only part of Vessiot's work for at the same time he was undertaking research for his doctorate advised by\nÉmile Picard\n. In\n1892\nhe submitted his doctoral dissertation\nSur l'intégration des équations différentielles linéaires\nⓉ\n(\nOn the integration of linear differential equations\n)\n. In this he studied\nLie groups\nof linear transformations, in particular considering the action of these\nLie\ngroups on the independent solutions of a differential equation. He defended his thesis in an oral examination at the University of Paris in June\n1892\n, the jury being chaired by\nCharles Hermite\n. He published his thesis in the\nAnnales Scientifiques de l'École Normale Supérieure\nin\n1892\nand over the following few years published papers such as\nSur une classe d'équations différentielles\nⓉ\n(\nOn a class of differential equations\n)\n(1893)\n,\nSur une méthode de transformation et sur la réduction des singularités d'une courbe algébrique\nⓉ\n(\nOn a method of processing and the reduction of singularities of an algebraic curve\n)\n(1894)\n,\nSur les systèmes d'équations différentielles du premier ordre qui ont des systèmes fondamentaux d'intégrales\nⓉ\n(\nOn systems of differential equations of the first order who have basic systems of integrals\n)\n(1894)\n, and\nSur quelques équations différentielles ordinaires du second ordre\nⓉ\n(\nOn some ordinary differential equations of second order\n)\n(1895)\n.\nAfter the award of his doctorate, Vessiot taught in a number of universities. He was appointed as an assistant lecturer at the Faculty of Science at Lille in\n1892\n, but after one year he moved to the Faculty of Science at Toulouse where he taught as a lecturer for the three years\n1893\n-\n96\nbeing in charge of courses there. Following these years, in\n1896\nhe was appointed to take charge of the course on differential and integral calculus at the Faculty of Science at Lyon where he was promoted to the chair of pure mathematics in the following year. The lectures he gave on Higher Geometry in the academic year\n1905\n-\n06\nwere published as the book\nLeçons de Géométrie Supérieure\nⓉ\n(\nHigher geometry lessons\n)\n(1906)\n. Clarence Lemuel Elisha Moore\n(1876\n-\n1931)\n, a professor at the Massachusetts Institute of Technology specialising in geometry, wrote the review\n[\n5\n]\n. We quote an extract:-\nThese lectures delivered by Vessiot during the year\n1905\n-\n1906\nwere published in the present form at the demand of his students. The author remarks in the preface that he is hopeful that they may be of service to those who are beginning the study of higher geometry and may serve them as a good preparation for the reading of original memoirs and such works as\nDarboux\n's 'Théorie des surfaces'. It is the opinion of the reviewer that the lectures serve these purposes admirably. The attack is direct and the end to be reached is kept clearly before the reader, in fact the whole presentation is such as to lead the beginner to an appreciation of the subject. A glance at the table of contents will convince one that the book will serve as a good introduction to the study of\nDarboux\n. The principal object of the lessons is the study of systems of straight lines but owing to the close relation between lines and spheres it is quite natural that systems of spheres should be studied also. It is assumed at the outset that the student is familiar with the elementary notions of twisted curves and surfaces\n(\ntangent planes, tangent lines, etc.\n)\n, and that he has some acquaintance with the elements of the theory of contact.\nIn fact Vessiot published a second edition in\n1919\n. In the Preface to this edition he explains that the first edition quickly sold out and he was approached by the publisher J Hermann of Paris to produce a second edition. The first edition ran to\n326\npages but with the additions that Vessiot made to the second edition it was\n376\npages. He also made some improvements to the text.\nIt was standard for academics to begin their careers in the provinces and eventually gain an appointment in Paris. Vessiot taught for thirteen years in the Faculty of Science Lyon before gaining an appointment in Paris in\n1910\n. At first he taught differential and integral calculus but, following the death of\nJules Tannery\nin December\n1910\n, he was made an assistant lecturer. He was given charge of the elementary practical mathematics course and assisted\nPaul Painlevé\nin examinations. He also assisted Claude Guichard\n(1861\n-\n1924)\n, the professor of general mathematics at the University of Paris, in delivering his courses. He succeeded Guichard to the chair of general mathematics when Guichard retired in\n1919\n.\nAs we mentioned above, Vessiot applied continuous groups to the study of differential equations. He extended results of\nJules Joseph Drach\n(1902)\nand\nÉlie Cartan\n(1907)\nand also extended\nFredholm\nintegrals to partial differential equations. Jean-François Pommaret writes in\n[\n2\n]\n:-\nIt was Ernest Vessiot who first started to feel that a way to define the\nGalois\ntheory for linear ODEs should come through a better understanding of the group theoretical foundation of the classical\nGalois\ntheory. One must never forget that Vessiot was an unusual Frenchman at that time, perfectly aware of the work of\nLie\nwho, in turn, at the end of his life, considered Vessiot to be his heir. As a consequence, Vessiot knew the theory of\nLie\ngroups and, when he wrote his thesis in\n1892\non what is now called the\nPicard\n-Vessiot theory of linear ODEs, he knew about\nLie\n's latest research on pseudogroups. Hence, in Vessiot's mind, the\nPicard\n-Vessiot theory of linear ODEs could be considered only as an intermediate step towards the achievement of the classical\nGalois\ntheory, namely the\nGalois\ntheory for systems of PDEs ...\nIn fact he had read\nDrach\n's doctoral thesis of\n1898\nand had been unhappy with some of the arguments. A letter that he wrote to\nDrach\non\n3\nOctober\n1898\nis extant and we give an extract from it since it shows much of Vessiot's character; great kindness as well as very careful attention to detail\n(\nsee\n[\n2\n]\n)\n:-\nExcuse me for not having already thanked you for sending me your thesis. Indeed I wanted to read it with care and, while reading it, I had very serious doubts about the third chapter. Consequently, I invited\nÉlie Cartan\nto examine it on his own and he agreed with me. Accordingly, I said a few words to\nJules Tannery\n, bearing in mind that he was the right person to call your attention to certain obscure points. He himself believed that it was better for me to write to you directly - which I am doing - with the hope you could show me that I have only badly interpreted certain sketchy proofs. ... In any case, it seems to me that all the proofs must be given anew. I end there, my dear colleague, this criticism of your work. I hope that you will hold nothing against me and that you will soon be able to show me that my objections are unjustified.\nVessiot was absolutely correct in his worries about\nDrach\n's thesis and\nPaul Painlevé\nwrote to Vessiot on\n17\nOctober\n1898\n(\nsee\n[\n2\n]\n)\n:-\nI just read\nDrach\n's thesis and I agree entirely with you about the inaccuracy of the two fundamental theorems and their proofs. The mistake is so big that I can hardly conceive that it has been overlooked by the author and the jury. It is very sad for poor\nDrach\n. ... I said to\nÉmile Picard\nthat I had received a letter from you about this question; after a few minutes of explanation, he was astonished to have missed this. ... I hope, my Dear Friend, that this year will alleviate your sorrow of the last year, and I beg you to give my kind regards to Madame Vessiot and your family.\nWe should explain\nPaul Painlevé\n's reference to \"sorrow of the last year\". Vessiot married Augustine Naton in Toulouse on\n25\nFebruary\n1893\n. They had a son Alexandre\n(\nborn\n1900)\nand four daughters Marie\n(\nborn\n1893)\n, Louise\n(\nborn\n1894)\n, Madeleine\n(\nborn\n1895)\n, and Simone\n(\nborn\n1895)\n. Marie died very young, and Madeleine died in\n1897\n. This is the \"sorrow of the last year\" to which\nPainlevé\nrefers. However,\nPainlevé\n's hopes for Vessiot's future happiness did not materialise. His wife Augustine died in\n1912\nand his son Alexandre died from tuberculosis in\n1913\nat the age of thirteen. Of his two remaining daughters, Louise married the physicist Jean Cojan\n(1892\n-\n1952)\nbut died in\n1948\nthree years before her father, while the other daughter, Simone, remained unmarried and cared for Vessiot in his old age. However, we have moved ahead and we should return to saying something of Vessiot's career after his appointment to the Faculty of Science in Paris in\n1910\n.\nPainlevé\n, whom we quoted from above, wrote about the superb research contributions by Vessiot, much of which was based on trying to correct the error in\nDrach\n's thesis:-\nWe can characterize the work of Mr Vessiot saying it is distinguished by its depth, perfect rigour and lucid style.\nHowever, Vessiot was also an outstanding lecturer, renowned for the clarity and rigour of his lectures. In fact he was extremely conscientious and devoted so much time to his teaching and writing textbooks over the latter part of his career that he did not find the time to devote himself to the deep research of which he was capable. Vessiot spent the last\n25\nyears of his career in Paris, concentrating on his role as a lecturer and as an examiner. During World War I he undertook war work. He was assigned to ballistics and made important discoveries in this area. He was, successively, professor of General Mathematics, professor of Differential and Integral Calculus, professor of Group Theory and the Calculus of Variations, professor of Theory of Functions and Transformations, and professor of Analytical Mechanics and Celestial Mechanics. He was appointed Deputy Director\n(1920)\nand then, in\n1927\n, to the prestigious post of Director of the École Normale Supérieure in Paris. He was the first scientist to be appointed to this post which he continued to hold until he retired in\n1935\n. In his role of director he supervised the construction of new laboratories for physics, chemistry and natural sciences at the École Normale Supérieure. Vessiot also held other roles in Paris, for example he was an examiner at the Naval Academy and an examiner at the École Polytechnique where he also acted as an analysis tutor. As an examiner he was said to be calm, gentle and caring. He always looked for how much the candidate got right rather than how much was wrong.\nHe retired on\n30\nSeptember\n1935\nand went to live at La Bauche in Savoy, in the family property built by his father. He died from a heart attack following a bout of pneumonia. His final illness lasted three weeks.\nHe was honoured by the award of the Grand Prix des Sciences Mathématiques in\n1904\n. In the essay he submitted for the prize, he proved\n[\n2\n]\n:-\n... that\nGalois theory\nwas nothing other than the study of principal homogeneous spaces for groups.\nHe was elected to the\nAcadémie des Sciences\nin\n1943\n."
}