{
  "nome_completo": "Ernst Max Mohr",
  "nome_curto": "Ernst Mohr",
  "ano_nascimento": "1910",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mohr_Ernst/",
  "lugar_nascimento": "Ebersbach an der Fils, Württemberg, Germany",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Ernst Mohr\nattended school in Göppingen, then studied mathematics and physics at the University of Tübingen and the University of Munich where he was taught by\nCarathéodory\n,\nPerron\nand\nTietze\n. He then went to Göttingen where his doctoral studies were supervised by\nWeyl\n. In\n1933\nhe was awarded his doctorate for his dissertation on group representations\nDie Darstellung der Komplexgruppen und der Charakteristiken der irreduziblen unter diesen\nⓉ\n(\nThe presentation of the complete groups and the characteristics of the irreducible under them\n)\n.\nAfter Mohr was awarded his doctorate he was appointed as assistant to\nFriedrich Karl Schmidt\nat Göttingen in the autumn of\n1933\n.\nWeyl\n, who had been Mohr's supervisor, left Göttingen and in April\n1934\nthe Ministry of Education confirmed the choice of\nHasse\nas\nWeyl\n's successor. Mohr wanted an assistant position under\nHasse\n, but he was aware that his present boss,\nSchmidt\n, did not think very highly of him. Mohr tried to arrange things so that he might become\nHasse\n's assistant and at the same time there were others at Göttingen who objected to\nHasse\n's appointment on political grounds. Certainly\nSchmidt\nbecame upset at Mohr's actions and Mohr now also opposed\nHasse\n's appointment since he feared it would mean that no positions in Göttingen would be open to him.\nHasse\n's appointment was confirmed by the Ministry of Education, and Erherd Tornier, a favourite of the Nazi regime, was appointed to fill\nLandau\n's position. This had become vacant due to\nLandau\nbeing forced to resign after\nTeichmüller\n, as leader of the students, organised a boycott of his lectures since he was Jewish. Mohr asked\nCarathéodory\nin July\n1934\nto write a reference to support his application to become\nHasse\n's assistant but by this stage Tornier had forbidden Mohr from entering the Mathematics Institute at Göttingen. Mohr was forced to look for a post elsewhere and was appointed as a scientific fellow to the Technical University of Breslau on\n1\nNovember\n1934\n.\nAt Breslau Mohr changed areas and began to undertake work in hydrodynamics under the supervision of Johann Nikuradse. From this time on his work was on applied mathematics, mainly fluid dynamics and differential equations, but he also published the occasional paper on polynomials. In\n1939\nhe was promoted to lecturer in mechanics and applied mathematics at the University of Breslau, and also at the Technical University of Breslau, after submitting his\nhabilitation\ndissertation. In\n1940\nMohr published\nÜber die Kräfte und Momente, welche Singularitäten auf eine stationäre Flüssigkeitsströmung übertragen\nⓉ\n(\nOn the forces and moments which transmit singularities for a stationary liquid flow\n)\nconcerned with the problem of the determination of the forces and couples which the stationary flow of an ideal incompressible fluid exerts on rigid bodies placed in its path. In the following year he published\nBemerkungen zu Mises' Behandlung des Nadelproblems von Buffon\nⓉ\n(\nComments on Mises' treatment of the problem of  Buffon's needle\n)\nexamining the distribution associated with\nBuffon\n's needle problem and, in the same year,\nÜber den Navier-Stokesschen Spannungsansatz für zähe Flüssigkeitsströmungen\nⓉ\n(\nOn the Navier-Stokes potential approach for viscous fluid flows\n)\ndiscussing the molecular theory of viscosity in terms of momentum transport.\nIn\n1942\nMohr was appointed to the German Charles University in Prague becoming an extraordinary professor in the following year. He published a joint paper with Johann Nikuradse in\n1943\n,\nZur Theorie des tragenden Flügels\nⓉ\n(\nOn the theory of the supporting wing\n)\n, which considered irrotational flow about an internal boundary in an infinite fluid, and determined the condition for minimum kinetic energy and given\nKelvin\nimpulse. Also in\n1943\nhe published a major paper attempting to explain the experimental evidence that laminar flow satisfies a nonslip condition on solid boundaries whereas turbulent flow does not. In Prague Mohr became friends with his colleagues Herbert Cremer and\nFeigl\n. On\n12\nMay\n1944\nMohr was arrested by the Gestapo while in the Hotel Béranek in Prague.\nIt appears that Mohr was strongly opposed to the National Socialist regime which was in power in Germany but, like most people in a similar position, he was very careful not to say anything that might get back to the authorities. However he did listen to broadcasts by the BBC to try to obtain a more balanced view of how the war was developing, and he was friends with Cremer and\nFeigl\nwho both opposed the Nazi policies. His arrest followed when he was denounced by a female friend of his wife. Both Mohr and his wife were arrested on the charges brought by the \"friend\". On\n24\nOctober\n1944\nMohr's case came before the Volksgerichtshof\n(\nPeople's Court\n)\naccused\n[\n1\n]\n:-\n... of having received a foreign broadcasting station, of having made a parody of Hitler, of having described the war situation as hopeless and the extermination of the Jews as a great mistake, of having considered the representation of Stalin by the German press to be incorrect, of having drawn parallels between national socialism and Bolshevism on the basis of their dictatorial forms, and of having described a soldier at the front, the informer's husband, as \"yet another idiot\".\nMohr admitted only to listening to broadcasts by the BBC and argued in his defence that his research work was extremely valuable to the war effort, particularly to the German air force. Despite this argument he was found guilty and sentenced to death. Mohr's colleagues Johann Nikuradse and\nHans Rohrbach\nargued that Mohr was too valuable to the German war effort to be put to death and his sentence was deferred for six months to allow him to be put, first into the Haftanstalt Meseritz concentration camp\n(\nat Miȩdzyrzecz in Poland\n)\n, then into Plötzensee jail near Berlin, to do mathematical computations for developing the V\n(\nVergeltungs\n)\nweapons programme. He was sent to Plötzensee on\n18\nDecember\n1944\nand there saw executions and bomb attacks. He was freed by the advancing Russian army only days before his death sentence was due to be carried out after the six months deferment.\nOn\n1\nJanuary\n1946\nhe took up the Chair of Pure and Applied Mathematics at the Technical University of Berlin. However there seemed to be a reluctance to accept that he had been a victim of the National Socialist regime and the death penalty continued to hang over him until\n1958\nwhen it was finally revoked, and then this only happened partly by subterfuge and partly by luck\n[\n4\n]\n. Even at this he did not receive compensation for the horrors he had suffered and it was not until\n1963\nthat full compensation was paid. Not surprisingly the events of\n1944\nand\n1945\ncaused a considerable publication gap in Mohr's record, with no publications appearing between\n1944\nand\n1951\n, but he published five papers in\n1951\n. One of these\n1951\npapers looks at the numerical solution of the differential equation\nd\ny\nd\nx\n=\nf\n(\nx\n,\ny\n)\n\\large\\frac{dy}{dx}\\normalsize  = f (x, y)\nd\nx\nd\ny\n​\n=\nf\n(\nx\n,\ny\n)\n.\nFor many years Morr was director of the Mathematics Institute at the Technical University in Berlin, holding the post up to his retirement in\n1978\n. Even after he retired Mohr continued to publish high quality papers. For example in\n1982\nhe published\nEin Beitrag zur Weylschen Theorie vom Grenzpunktfall\nⓉ\n(\nA contribution to the theory of the Weyl limit point case\n)\nwhich he summarised himself as follows:-\nHermann Weyl\n, in two pioneering papers, described a class of differential equations in the limit point case where complete determination of the continuous spectrum is possible. Here, we prove\nWeyl\n's results, especially the arithmetic rule, under substantially weaker assumptions.\nHe continued to examine\nSturm\n-\nLiouville\nproblems, in particular the limit circle case for the\nSturm\n-\nLiouville\nproblem."
}