{
  "nome_completo": "Ernst Sigismund Fischer",
  "nome_curto": "Ernst Fischer",
  "ano_nascimento": "1875",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fischer/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Cologne, Germany",
  "biografia": "Ernst Fischer\n's father was Jacob Fischer who was a composer of music and Professor at the world famous Vienna Academy. His mother was Emma Grädener, the daughter of the musician Karl Grädener. Ernst was educated in Vienna, and he studied at the University of Vienna under\nMertens\nfrom\n1894\n. His doctoral studies were supervised by\nGegenbauer\nand he was awarded his doctorate by the University of Vienna in\n1899\n. He spent\n1899\nat the University of Berlin, then studied at Zürich and Göttingen with\nMinkowski\n. From\n1902\nhe was assistant to E Waelsch at the German Technische Hochschule of Brünn\n(\nnow Brno\n)\n, becoming a\nprivatdozent\nthere in\n1904\n, then an extraordinary professor in\n1910\n.\nFrom\n1911\nuntil\n1920\n, Fischer was professor at the University of Erlangen, appointed to fill the chair left vacant in the previous year when\nPaul Gordan\nretired.\nEmmy Noether\nhad been awarded her doctorate from the University of Erlangen in\n1907\nhaving worked under\nGordan\n's supervision. When Fischer arrived in Erlangen it was natural for\nNoether\nto work with him. After\nNoether\n's death in\n1935\n,\nWeyl\ngave an address at which he spoke of Fischer's influence:-\nFischer's field was algebra ..., in particular the theory of elimination and of invariants. He exerted upon\nEmmy Noether\n, I believe, a more penetrating influence than\nGordan\ndid. Under his direction the transition from\nGordan\n's formal standpoint to the\nHilbert\nmethod of approach was accomplished. She refers in her papers at this time again and again to conversations with Fischer.\nFischer is best known for one of the highpoints of the theory of\nLebesgue\nintegration, called the\nRiesz\n-Fischer Theorem. The theorem is that the space of all square-integrable functions is complete, in the sense that\nHilbert space\nis complete, and the two spaces are isomorphic by means of a mapping based on a complete orthonormal system.\nFischer took part in World War I from\n1915\nto\n1918\n. He married Ellis Strauss, the daughter of Pfarrers Eugen Strauss, in Erlangen in\n1917\n. Fischer was\n42\nyears old, his wife being\n26\n; they had one daughter. From\n1920\nFischer worked at the University of Cologne, remaining there until he retired in\n1938\n.\nLet us note again the major result, the\nRiesz\n-Fischer Theorem, for which he is best known as\nWeyl\nnoted in the above quote. In\n1907\nErnst Fischer studied orthonormal sequences of functions and gave necessary and sufficient conditions for a sequence of constants to be the\nFourier coefficients\nof a square integrable function. His two papers of\n1907\nwere\nSur la convergence en moyenne\nⓉ\n(\nOn convergence in the mean\n)\nand\nApplications d'un théorèm sur la convergence en moyenne\nⓉ\n(\nApplications of a theorem on convergence in the mean\n)\nboth published in\nComptes rendus\nof the\nAcademy of Sciences\nin Paris. This work led to the concept of a\nHilbert\nspace.\nFrigyes Riesz\npublished a similar result in the same year. The theorem, now called the\nRiesz\n-Fischer theorem, is one of the great achievements of the\nLebesgue\ntheory of integration.\nFischer went on to study\nHadamard\ndeterminants\n, publishing his results in\n1908\nin the\nArchiv der Mathematik und Physik\n, and\nSylvester\ndeterminants, publishing a paper in\nCrelle\n's Journal in the following year. He also published in the\nCarathéodory\nProblem and on finite abelian groups."
}