{
  "nome_completo": "Errett Albert Bishop",
  "nome_curto": "Errett Bishop",
  "ano_nascimento": "1928",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bishop/",
  "lugar_nascimento": "Newton, Kansas, USA",
  "lugar_morte": "San Diego, California, USA",
  "biografia": "Errett Bishop\n's parents were Helen and Albert T Bishop. His father graduated from the United States Military Academy at West Point and served in the U.S. army during World War I. After the war he was professor of mathematics at a number of universities before ending his career as Professor of Mathematics at Wichita State University, Wichita, Kansas, where poor health forced him to retire early. He died in\n1933\nwhen his son Errett was five years old. Despite dying before he could personally influence Errett towards mathematics, in fact he did have a very substantial influence since when Errett was a young boy he began to study the mathematics the textbooks which had belonged to his father. The family remained in the same family home in Newton after Albert's death and his books remained to excite young Errett. It is clear that Errett was a child prodigy but it was remarkable that he had a sister, Mary, who was two years younger than he was an was also a mathematical prodigy.\nErrett did not find High School at all challenging and when he was sixteen, wanting to progress with his education in a way that was not happening at school, he applied and was accepted for a special scholarship program at the University of Chicago. Starting his university studies in\n1944\n, Bishop graduated with a B.S. from Chicago in\n1947\nand continued to study for his Master's degree which was awarded in\n1947\n. Bishop was joined in Chicago by his younger sister Mary who, as he had been, was accepted for the special scholarship program at the University of Chicago. Bishop had been taught by\nPaul Halmos\nwhen he was studying for his B.S. and it was\nHalmos\nwho supervised his doctoral studies. However Bishop spent\n1950\n-\n52\nin the U.S. army. After completing his basic army training Bishop was sent to undertake mathematical research at the National Bureau of Standards. He was highly successful and received:-\nCommendation ribbon with pendant for mathematical research in Army Ordnance.\nReturning to Chicago in\n1952\nBishop submitted his doctoral thesis\nSpectral Theory for Operations on Banach Spaces\nin\n1954\n.\nHalmos\nsaid:-\nAs a student he was outstanding and with the writing of his thesis he became spectacular.\nHaving submitted his thesis, Bishop was appointed as an instructor in mathematics at the University of California at Berkeley. He was regularly promoted reaching the rank of full professor. During\n1964\n-\n65\n, while retaining his professorship at the university, he spent the year at the Miller Institute for Basic Research in Berkeley. Then, in\n1965\n, he accepted a professorship at the University of California at San Diego where he remained for the rest of his career. In\n1982\nhe became ill with cancer and he died from the disease in the following year.\nBishop's work is so wide ranging that it is difficult to give an overview in a biography such as this. Let us look at the book\nSelected papers\nwhich was published in\n1986\nand reprints some of Bishop's most significant contributions. The book divided Bishop's papers into five categories:\n(1)\nPolynomial and rational approximation. Examples are extensions of Mergelyan's approximation theorem and the theorem of\nFrigyes Riesz\nand\nMarcel Riesz\nconcerning measures on the unit circle orthogonal to polynomials. Bishop found new methods in dealing with these problems;\n(2)\nThe general theory of function algebras. Here Bishop worked on uniform algebras\n(\ncommutative\nBanach\nalgebras with unit whose norms are the spectral norms\n)\nproving results such as antisymmetric decomposition of a uniform algebra, the Bishop-DeLeeuw theorem, and the proof of existence of Jensen measures. In\n1965\nBishop wrote an excellent survey\nUniform algebras\nexamining the interaction between the theory of uniform algebras and that of several complex variables.\n(3)\nBanach spaces and operator theory. An examples of a paper by Bishop on this topic is\nSpectral theory for operators on a Banach space\n(1957)\n. He introduced the condition now called the Bishop condition which turned out to be very useful in the theory of decomposable operators.\n(4)\nSeveral complex variables. Examples of Bishop's papers in this area are\nAnalyticity in certain Banach spaces\n(1962)\n. He proved important results in this area such as the biholomorphic embedding theorem for a Stein manifold as a closed submanifold in\nC\nn\n\\mathbb{C}^{n}\nC\nn\n, and a new proof of Remmert's proper mapping theorem.\n(5)\nConstructive mathematics. Bishop become interested in foundational issues around\n1964\n, about the time he was at the Miller Institute. He wrote a famous text\nFoundations of constructive analysis\n(1967)\nwhich aimed to show that a constructive treatment of analysis is feasible. B van Rootselaar, reviewing the text, wrote:-\nInspiration has been taken from\nBrouwer\n's ideas modified so as to obtain a smoothly running piece of mathematics which may be considered as constructive and at the same time resembles classical mathematics as much as possible. The reasoning underlying the theory is mainly intuitionistic, avoiding the use of negation. However, a good deal of\nBrouwer\n's intuitionism is rejected, notably his notions of free choice sequences, spreads and the bar theorem. The non-constructive principle of classical reasoning \"Either all elements of A have property P or there exists an element of A with property not P\"\n(\ncalled the principle of omniscience\n)\nhas to be avoided. This is generally done by restricting the notions in such a way that either the principle is trivially satisfied or no appeal to the principle is necessary.\nBishop was working on a revision of this text at the time of his death and this was completed and published as\nConstructive analysis\nin\n1985\nby Douglas Bridges:-\nA striking feature of the revised text is that there are\n93\nentries in the bibliography, as compared to\n17\nin the original. Almost all of these references have appeared since the publication of the original, and most owe their existence to that work.\nMany other areas of mathematics were given the constructive treatment by Bishop. In\n1972\nhe published\nConstructive measure theory\nwritten in collaboration with Henry Cheng. In the following year Bishop published\nSchizophrenia in contemporary mathematics\nwhich gave his principles of constructivism. He listed:\n(\nA\n)\nMathematics is common sense;\n(\nB\n)\nDo not ask whether a statement is true until you know what it means;\n(\nC\n)\nA proof is any completely convincing argument;\n(\nD\n)\nMeaningful distinctions deserve to be preserved.\nLeonard R Haff, Murray Rosenblatt, and\nStefan E Warschawski\nin an obituary of their colleague Bishop write:-\nErrett Bishop will be remembered as one of the outstanding mathematicians in the world. He will be remembered for his sense of justice, for the integrity and dignity of his personal life."
}