{
  "nome_completo": "Esteban Terradas i Illa",
  "nome_curto": "Esteban Terradas",
  "ano_nascimento": "1883",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Terradas/",
  "lugar_nascimento": "Barcelona, Spain",
  "lugar_morte": "Madrid, Spain",
  "biografia": "Esteban Terradas i Illa\n, also known as\nEsteve Terradas\n, was the son of Marcellí Terradas i Domingo, from Barcelona, and Leonor Illa i Navarro, from L'Arboc, a village about\n40\nkm west of Barcelona. Marcellí Terradas, who was a merchant, died when Esteban was two years old and, together with his three brothers, he entered the guardianship of his uncle, Joseph Terradas, a priest, who sent him to complete his primary studies in Charlottenburg, on the outskirts of Berlin. He remained there until he was thirteen years old and, by that time, was fluent in German and French in addition to his native language.\nBack in Barcelona in\n1896\n, Esteban received private tuition to enable him to sit the baccalaureate examinations. These were demanding with fifteen different subjects being examined, but after two years of study he passed them successfully in\n1898\nand later that year began his university studies in the Faculty of Sciences of the University of Barcelona. His aim at this stage was to enter the School of Industrial Engineering and, in order to achieve this, he took preparatory mathematics and science subjects and did not begin his studies of engineering until\n1902\n. By this time he had decided to work for a Bachelor of Science degree which he was awarded in\n1904\n. His performance was outstanding and he was awarded the 'Premio Extraordinario'. Also in\n1904\nhe published his first paper,\nPropiedades de las raíces de la unidad\nⓉ\n(\nProperties of the roots of unity\n)\n, which was published in the\nRevista Trimestral de Matemáticas\nand later in the same year he published, in the same journal,\nEstudiar analíticamente las condiciones de los hilos flexibles, pesados, que suspendidos por sus extremos de dos puntos fijos, realicen catenarias de formas especiales dadas\nⓉ\n(\nAnalytical study of the conditions of flexible, heavy wires, which, suspended at their ends from two fixed points, make catenaries of given special shapes.\n)\n.\nIn order to continue his studies for a doctorate, Terradas went to the Universidad Complutense de Madrid. This was a necessary move since at this time Madrid was the only Spanish university able to award doctorates. In June\n1905\nhe defended two doctoral theses, one in physics and one in mathematics, and was awarded two doctorates. His physics thesis was\nAlgunas propiedades sencillas de la luz absorbida por ciertos cuerpos cristalinos\nⓉ\n(\nSome simple properties of the light absorbed by certain crystalline bodies\n)\nwhile his mathematics thesis was\nCondiciones para que un hilo homogéneo, flexible, inextensible e inelástico, deslice según la curva que forma, esto es, para que todos sus puntos tengan por trayectoria la misma curva que realiza\nⓉ\n(\nConditions for a homogeneous, flexible, inextensible and inelastic wire to slide according to the curve which it forms, that is to say, for all its points to have as their trajectory the same curve which it makes\n)\n. Also in\n1905\nhe published three papers in the\nAnales de la Sociedad Espanola de Física y Química\n, a journal which had only been founded two years earlier in\n1903\n. These papers have the titles:\nEfecto de la luz circulante polarizada al atravesar una lámina absorbente cristalina, no activa\nⓉ\n(\nEffect of circulating polarised light passing through a non-active, crystalline absorbing film\n)\n;\nSobre algunas curvas realizadas por cuerdas en movimiento\nⓉ\n(\nOn some curves made by moving strings\n)\n; and\nSobre el cálculo de las intensidades en una red de conductores lineales\nⓉ\n(\nOn the calculation of currents in a network of linear conductors\n)\n.\nAfter the two doctorates, Terradas was appointed as an assistant professor at the Universidad Complutense de Madrid, then in\n1906\nhe took a competitive examination for the Chair of Rational Mechanics at the University of Zaragoza which he won.\nJulio Rey Pastor\nwas at this time a student at the University of Zaragoza and many years later he recalled\n(\nsee for example\n[\n27\n]\n)\n:-\nI was already a student in Zaragoza in\n1906\n, when the news spread: the new professor of Rational Mechanics has arrived, but he is a boy! A boy, certainly, because of his age, but a great gentleman because of his distinction and his culture; a boy who spoke perfectly all the learned languages and knew the history and literature of all countries, a boy who handled elliptic functions with the same ease as our old professors handled trigonometry.\nTerradas only spent one year at the University of Zaragoza before returning to his hometown of Barcelona in\n1907\nwhen he won, by competitive examination, the Chair of Acoustics and Optics at the University of Barcelona. He published\nFenómenos de polarización en el cuarzo\nⓉ\n(\nPolarisation phenomena in quartz\n)\n(1907)\nand\nTeorías modernas acerca de la emisión de la luz\nⓉ\n(\nModern theories on the emission of light\n)\n(1909)\n. In\n1907\nthe Real Academia de Ciencias y Artes de Barcelona awarded him their Agell Prize for the second of the\n1904\npapers we mentioned above. In\n1909\nhe was elected to the Real Academia de Ciencias y Artes de Barcelona and delivered an inaugural address on the emission of radiation by fixed or moving bodies which he delivered\n[\n27\n]\n:-\n...with true mastery of the various theories about radiation that have been established by\nMaxwell\n,\nJeans\n,\nLorentz\n,\nPlanck\nand other scholars, laying down the principles of Statistical Mechanics, which serves wonderfully to be applied to theories of electromagnetism.\nDespite achieving leading academic positions, Terradas had returned to his original aim, namely to study or a degree in Industrial Engineering. This was a very demanding course which required him to be examined in twenty different subjects which he sat at a single examination diet in\n1909\n.\nHe attended the International Congress of Mathematicians in\n1908\nin Rome and, four years later, the International Congress of Mathematicians in Cambridge, England. At the Cambridge Congress he gave the lecture\nSur le mouvement d'un fil\nⓉ\n(\nOn the movement of a wire\n)\nin which he studied the movement of a wire in the case where all its points describe the same trajectory relatively to axes given a rotational movement. This had been the subject of his\n1904\npaper which won the Agell Prize.\nThe Barcelona Astronomical Society was founded on\n30\nJanuary\n1910\nwith the aim of involving both professional academics and amateurs. Terradas, although he was not an astronomer, had such a high reputation for learning that he was elected as the first president of the Society and delivered his presidential address on\nThe Progress of Astronomy\n. The Society began with\n210\nmembers in\n1910\nand this had grown to\n370\nby\n1912\n.\nTerradas married Maria Lluïsa Vía i Freixas\n(1887\n-\n1977)\nand they had a son, Robert Terradas i Via\n(1916\n-\n1976)\n. Let us record that Robert studied at the Barcelona School of Architecture, obtaining his degree in\n1942\n, and went on to be the director of the Barcelona School of Architecture from\n1960\nto\n1967\n. As an architect his buildings in Barcelona include the Royal Polo Club, the Swiss School, the Barcelona School of Industrial Engineering, the College of Physicians, and the Faculty of Philosophy and Letters.\nIn\n1919\nTerradas founded the Institute of Applied Electricity and Mechanics and was its director; he was also a professor in the electrical engineering section of the Escola del Treball.\nThe\nEnciclopedia universal ilustrada europeo-americana\nⓉ\n(\nEuropean-American Illustrated Universal Encyclopaedia\n)\nis a Spanish encyclopaedia comprising of\n72\nvolumes published between\n1908\nand\n1930\nfollowed by a\n10\n-volume appendix published in\n1933\n-\n35\n. It is believed that Terradas wrote around\n180\narticles for the encyclopaedia which have been described as \"an inexhaustible source, full of treasures.\" As examples of his articles we note the following: Aberration, Acoustics, Aerodynamics, Aerostatics, Algebra, Algebraic functions, Alternators, Asteroids, Astigmatism, Calculus, Calculus of probabilities, Differential Equations, Electricity, Gravity, Heat, Hydrodynamics, Kinematics, Locomotive, Magnetism, Mechanics, Moon, Number, Optics, Plate, Quantum theory,\nRiemann\nsurfaces, Statistical Mechanics, Theory of Relativity, Vibration.\nTerradas was involved in a remarkable number of different projects. In\n1913\nhe was appointed \"technical adviser\" to the Pedagogical Research Council of the Barcelona Provincial Council. Beginning in\n1914\nhe taught automobile technologies at the School of Arts and Crafts of the Provincial Council of Barcelona. He was Director of the Telephony Division of the Commonwealth of Catalonia from\n1916\nto\n1924\n[\n27\n]\n:-\nIt was a position of high technical responsibility, since he had to try to comply with the political will of the Commonwealth to make the telephone reach all corners of Catalan territory. ... During his tenure, the Catalan telephone network notably expanded its services, transforming the telephone map of Catalonia.\nAlthough his interests took him to become involved in so many projects, he did not neglect his academic interests and did much to make those in Spain aware of quantum theory and relativity. He invited to Barcelona leading mathematicians and physicists such as\nJacques Hadamard\n(1921)\n,\nHermann Weyl\n(1921)\n,\nArnold Sommerfeld\n(1922)\n,\nTullio Levi-Civita\n(1922)\n,\nBéla Kerékjártó\n(1923)\nand\nAlbert Einstein\n(1923)\n. We note that after discussions with Terradas,\nEinstein\nsaid\n[\n10\n]\n:-\nI have discovered an extraordinary man: Terradas.\nHe was also Director of the Secondary Railways Department of the Commonwealth of Catalonia from\n1918\nto\n1924\n. Despite the degrees he had already been awarded, he felt that he needed to be as well qualified as others in the Department so he graduated as a Civil Engineer taking two examinations\n(\nJune and September\n1918)\n, for the twenty required subjects. José Manuel Sánchez Ron relates the following episode in\n[\n26\n]\n:-\nTerradas had an extraordinary love of knowledge and erudition, and anecdotes abound of his learning, even while he lived. For example, referring to Terradas' civil engineering examination, the architect Joan Bergós ... related that his friend, who was very knowledgeable about architecture, confided in him that he had \"not dared to study it formally for fear that in the Advanced School he would lose his passion for architecture, the first of the arts. Bergós added that in the architecture examination for the Civil Engineering School, when questioned in regard to 'Byzantine decadence mouldings', Terradas was able to draw these without hesitation, to the total stupefaction of the Examining Board.\nUnder his leadership four lines were started: Reus-Montroig; Lleida-Fraga; Tàrrega-Balaguer; and Tarragona-Ponts. Political events, however, led to this work being abandoned. The cause was the military coup in Spain on\n13\nSeptember\n1923\nled by Miguel Primo de Rivera who established himself as a dictator. Although Primo de Rivera's aim was to modernise Spain, he tried to stamp out Catalan culture and this made for many difficulties. Terradas, however, continued his interest in railways and joined the Metropolitano Transversal de Barcelona in\n1923\nand made an essential contribution to the completion of the Catalonia-La Bordeta section in\n1926\n.\nIn\n1927\nTerradas moved to Madrid and became a university member of Primo de Rivera's National Assembly. A position was arranged for him at the University of Madrid and in\n1928\nhe was appointed to the Chair of Differential Equations. In addition to holding these positions, he became a professor at the Escuela Superior Aerotécnica in\n1929\n. Around the time he moved to Madrid, he spent some time in South America, filling the Chair of Spanish Culture at the Spanish Cultural Institution of Buenos Aires. He gave lecture courses, spoke at conferences and established contacts in Chile, Uruguay and Bolivia. In\n1929\nhe took on yet another role as director of the National Telephone Company of Spain.\nPolitical events, however, led to difficulties for Terradas. King Alfonso XIII of Spain was deposed and on\n14\nApril\n1931\nthe Spanish Republic, usually called the Second Republic, was proclaimed. As a result Terradas left his post with the National Telephone Company in June\n1931\n. In September\n1931\nthe Ministry of Public Instruction decided to removed him from the Chair of Differential Equations. A competition was then held for the Chair which Terradas entered but was unsuccessful. He then held the Chair of Rational Mechanics from\n1932\n-\n33\n. He had been elected to the\nSpanish Royal Academy of Sciences\non\n4\nFebruary\n1931\nand he delivered an inaugural lecture\nPrograma de un curso sobre ecuaciones diferenciales\nⓉ\n(\nSyllabus of a course on differential equations\n)\non\n15\nFebruary\n1933\n. In this lecture he described his approach to teaching differential equations which he had prepared for the competition for the Chair of Differential Equations but which, for political reasons, he had failed to win.\nJulio Rey Pastor\ngave a speech welcoming Terradas to the\nSpanish Royal Academy of Sciences\nand spoke of the difficulties he was encountering:-\nUnder the Catalan Commonwealth, he had the opportunity to carry out his multiple activities in the organisation of the Institut d'Estudis Catalans, and in the construction of the telephone network, of the secondary railways ... And seeing in the call of the first dictatorship the possibility of working for Spain, he sacrificed his personal opinions to work together with other distinguished comrades of ours, within the radius of his possibilities; and the same he would have done under any political regime oriented towards the opposite fundamental view.\nThe left-wing Popular Front won the\n1936\nelection and the situation rapidly deteriorated towards a civil war. Terradas, a Catholic who was labelled a conservative, was out of favour in Republican Barcelona and he realised he had to leave Spain. He left at the end of October\n1936\n, going to Argentina, where he remained until\n1941\n[\n26\n]\n:-\nTerradas was very active in his years in Argentina. At the University of Buenos Aires he gave courses on mathematics and engineering; at the National University of La Plata, he was associated with the Astronomical Observatory and participated in the measurement of a meridian arc extending from the extreme north of Argentine to the south, directing the hydrographical part of the project\n(\nspecifically, the determination of the mean height of the sea along the Atlantic coastline\n)\n. His activities also included aeronautics. At the University of Buenos Aires, in\n1940\n, he gave a course on theoretical aeronautics; at the National University of La Plata, he set up a group to study problems of aviation engineering, and gave courses and seminars on elasticity theory, aerodynamics and technical aviation problems\n(\namong them the construction of landing strips\n)\n. Indeed, one of the few articles that he published in Argentina was on aeronautics. This work, on aircraft propellers, originated in a conference given at the National University of La Plata on the\n24\nth June\n1937\n, and eventually came to form part of his course on aeronautics.\nJuan Vigón had been a supporter of King Alfonso XIII and was in the Spanish army. He resigned in\n1931\nwhen the Second Republic was formed but returned to at the outbreak of the Spanish Civil War becoming a general. After the end of the Civil War in\n1939\nhe became Minister of the Air Force and, towards the end of\n1941\n, he encouraged Terradas to return to Spain to use his expertise in aeronautical research. He returned and was appointed to the Chair of Mathematical Physics at the Faculty of Sciences in Madrid. We should note, however, that his colleagues in Argentina were unhappy that he cancelled plans in that country and left\n[\n11\n]\n:-\nFor a long period of time his friends in Argentina tried to recover him, without success, for what he called \"his second country.\" These efforts involved an influential group of scientists, research technologists and institutions which at the time were at the forefront of Argentina's research movement.\nVigón founded the Instituto Nacional de Técnica Aeronáutica in\n1942\nand Terradas became the first president of its Board of Trustees. After his death in\n1950\nthe National Institute of Aeronautical Technique was renamed Instituto Nacional de Técnica Aeroespacial \"Esteban Terradas\" in his honour. Together with Juan Vigón, he was a member of a working group set up to seek ways of developing a practical use of nuclear energy for Spain. The work of this group led to the setting up of the Nuclear Energy Board in\n1951\n, a year after Terradas died.\nSixto Ríos writes in\n[\n19\n]\nabout Terradas as a teacher:-\nIt is common that professors with extensive knowledge and great erudition in a subject do not know how to limit their exposition and mix major and secondary questions. On the contrary, D Esteban Terradas, who in Statistics, as in any other subject he explained, had a previous preparation in which he had exhausted the bibliographic sources, had not because of this lost the most precious pedagogical conditions of making his disciples clearly see the main paths, distinguishing them from the minor paths, and making them arrive and stop at the plateaus that allow a perfect contemplation of the scientific landscape that he had proposed to capture.\nOn\n24\nJuly\n1985\n, Spain issued a\n12\nSpanish peseta stamp in honour of Esteban Terradas in their 'Famous People' series. See\nTHIS LINK\n.\nLet us end this biography by quoting from a speech that Terradas made on\n11\nMay\n1913\non the occasion when Paulino Castells y Vidal\n(1877\n-\n1956)\nentered the\nSpanish Academy of Sciences\n:-\nWe are today convinced that our principal mission is not teaching in the archaic sense; rather, our fundamental duty is the study and the advance of science. We represent the culture of the homeland, and decorum and duty make it imperative that study becomes our central occupation; the time is long gone when didactic quality was measured in terms of the meticulousness with which a teacher of mathematics made a transformation or progressed from one formula to another. Today ... the quality of teaching is measured according to the ideas of the teachers and how these reflect thinking in the great cultural centres, as also by the nature of the problems that an intelligent student is capable of resolving."
}