{
  "nome_completo": "Eugenio Bertini",
  "nome_curto": "Eugenio Bertini",
  "ano_nascimento": "1846",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bertini/",
  "lugar_nascimento": "Forli (now  Italy)",
  "lugar_morte": "Pisa, Italy",
  "biografia": "Eugenio Bertini\n's mother was Agata Bezzi and his father was Vincenzo Bertini who was a printer. Eugenio was born in Forli which is about\n60\nkm southeast of Bologna and just a little further northeast of Florence. He grew up in a region controlled by Austria but which was striving for its independence. It was natural that in these dramatic times he became, like most of the young men around him, passionately committed to an independent Italian nation and prepared to take up arms to achieve this aim.\nHe went to the University of Bologna in\n1863\n, supported by a scholarship from Forli, with the intention of studying engineering. The University of Bologna was founded in the\n11\nth\ncentury and was at the time Bertini entered it\n(\nand of course still is today\n)\n, one of the most famous and oldest universities in Europe. After a period of decline the university had been reorganized in\n1860\n, only three years before Bertini entered, and had resumed its place among Italy's foremost universities. The city of Bologna and the surrounding area had been controlled by the Austrians from\n1849\nuntil it became part of the Kingdom of Italy in\n1860\n.  When Bertini entered the university in\n1863\ncertain aspects seem from our\n21\nst\ncentury perspective, to have been surprisingly modern. Its faculty of science had been developed in the\n17\nth\ncentury, and since the\n18\nth\ncentury women had been admitted both as students and as teachers. While on his engineering studies, Bertini took a mathematics course given by\nCremona\nand this inspired him to study pure mathematics.\nCremona\nwas an ardent Italian nationalist who, after fighting against the Austrians to help achieve an independent Italy, had been appointed as a professor at Bologna three years before Bertini entered the university. Before Bertini could complete his degree he took a break from his studies to take part in the third war for Italian independence, an action which his teacher\nCremona\nstrongly approved.\nThe Kingdom of Italy came into existence in\n1860\nand was officially proclaimed on\n17\nMarch\n1861\n, by a parliament assembled in Turin. They wanted Rome as the capital of their Kingdom but it was held by the Pope supported by the French. In June\n1866\nwar broke out between Austria and Prussia and this diverted attention from Rome to Venice which the Austrians still controlled. The Italian government sent troops to attack the Austrians in an attempt to drive them out of Venice but they were defeated on\n24\nJune at Custozza. Garibaldi led an almost independent army against the Austrians in the Tirol and Bertini joined his force which won some success near Trento. Although losing the main battles for Venice, the success in the Tirol together with French political pressure, led to Italy gaining Venetia at the Treaty of Vienna signed on the\n3\nOctober\n1866\n. Bertini returned to his studies at Bologna but was advised by\nCremona\nto transfer to the University of Pisa where he obtained a degree in mathematics in\n1867\nin the school of\nBetti\nand\nDini\n.\nIn October\n1867\nCremona\nwas appointed to the Polytechnic Institute of Milan. Bertini followed his teacher there and, during\n1868\n-\n69\n, he studied at Milan attending courses by\nCremona\n,\nBrioschi\nand\nCasorati\non\nAbel\n's integrals. He began his teaching career in\n1870\nin a secondary school in Milan, then two years later he went to Rome, again as a secondary school teacher.\nCremona\nrecommended him to teach descriptive and\nprojective geometry\nas a lecturer at the University of Rome. In\n1875\nhe was appointed professor of geometry at the University of Pisa, accepting the offer of a chair for which he had been proposed by\nBetti\n. From\n1880\nto\n1892\nhe held a chair at the University of Pavia where he was part of what Cinquini describes in\n[\n3\n]\nas the golden decade of Pavian mathematics. The two most important colleagues of Bertini who contributed to this 'golden decade' were\nFelice Casorati\nand\nEugenio Beltrami\n. In\n1892\nBertini returned to Pisa where he worked until he retired at the age of\n75\n.\nHis work in\nalgebraic geometry\nextended\nCremona\n's work. He studied geometrical properties invariant under\nCremona\ntransformations and used the theory to resolve the singularities of a curve. The paper\n[\n4\n]\nby Kleiman studies what the authors calls the two fundamental theorems of Bertini. These two fundamental theorems are among the ones most used in algebraic geometry. The first theorem is a statement about singular points of members of a pencil of hypersurfaces in an algebraic variety. The second theorem is about the irreducibility of a general member of a linear system of hypersurfaces.\nCarruccio writes in\n[\n1\n]\nthat:-\nHis treatises are noteworthy for their order and clarity.\nWe should note that Bertini had a number of outstanding students and their work continued the Italian tradition of outstanding contributions to geometry. We mention L Berzolari, C Rosati,\nG Scorza\n,\nG Fubini\n,\nG Albanese\nand L Campedelli. At Pisa,\nEnriques\nwas his assistant.\nThose who knew Bertini wrote that he kept a youthful enthusiasm for science to the end of his life."
}