{
  "nome_completo": "Eugene Paul Wigner",
  "nome_curto": "Eugene Paul Wigner",
  "ano_nascimento": "1902",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wigner/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "The Hungarian version of\nEugene Paul Wigner\n's name was Jenó Pál Wigner. His father, Antal Wigner, was the director of a leather-tanning factory while his mother, Erzsébet Wigner, looked after the family of three children. Both Antal and Erzsébet were from a Jewish background but they did not practice Judaism. Paul was born in Pest, the eastmost of the two towns which, together with Buda, formed the Hungarian capital of Budapest. He was the middle of his parents three children, having both an older and younger sister.\nFrom the time he was five years old Wigner was given private tuition at home. When he was ten years old he entered an elementary school but about a year after he began his studies at the school he was told that he had tuberculosis. The cure was to be found in sending him to a sanatorium in Breitenstein in Austria and he spent six weeks there before being told that the diagnosis had been wrong and that he had never had tuberculosis. However, one advantage of his six weeks was that he began to think about mathematical problems\n[\n13\n]\n:-\nI had to lie on a deck chair for days on end, and I worked terribly hard on constructing a triangle if the three altitudes are given.\nIn\n1915\nWigner entered the Lutheran High School in Budapest. Here he met\nJohn von Neumann\nwho was in the class below him. However he wrote\n[\n8\n]\n:-\nI never felt I knew\nvon Neumann\nwell at\nGymnasium\n. Perhaps no one did; he always kept a bit apart.\nThe school provided a solid education for Wigner in mathematics, literature, classics and religion. It did provide science teaching, but there was less emphasis on this than on other subjects. He was still at the Gymnasium when the communists took control in Hungary in March\n1919\nand the whole Wigner family fled the country. They lived in Austria until the communists were overthrown in November\n1919\nwhen they returned to Budapest and Wigner completed has school education. When he was in his late teens the whole Wigner family became converts to Lutheranism but it did not mean a great deal to Wigner who in later life described himself as \"only mildly religious\".\nIn\n1920\nWigner left school being one of the top students in his class. Already he knew that mathematics and physics were the topics for him but he realised that\nvon Neumann\n[\n8\n]\n:-\n... was a much better mathematician than I was and a better scientist. But I knew more physics.\nWigner wanted to be a physicist but his father expected him to join the family business and he believed that a degree in chemical engineering would be useful to his son in the family's leather-tanning factory. Wigner followed his father's wishes and took his first degree in chemical engineering spending one year at the Technical Institute in Budapest, then moving to the Technische Hochschule in Berlin. He said\n[\n13\n]\n:-\nI went to practically no classes ... but worked extremely hard in the laboratory. I loved inorganic chemistry.\nDespite working for a degree in chemical engineering, Wigner studied mathematics and physics in his own time. He attended colloquia at the University of Berlin with\nEinstein\n,\nPlanck\n, von Laue, and Nernst. Wigner obtained the degree of Dr. Ing. in\n1925\nfrom the Technische Hochschule in Berlin with a thesis\nBildung und Zerfall von Molekülen\nⓉ\n(\nFormation and decomposition of molecules\n)\nsupervised by Michael Polanyi, who was a fellow countryman also from Budapest. Wigner's thesis contains the first theory of the rates of association and dissociation of molecules. Wigner and Polanyi published a joint paper on this work in\n1925\n.\nHaving completed his doctorate, Wigner returned to Budapest to join his father's tannery firm as planned. However, things did not go too well\n[\n13\n]\n:-\nI did not get along very well in the tannery. ... I did not feel at home there. ... I did not feel that this was my life. ...\n[\nIn\n1926]\nI received a letter from a crystallographer at the Kaiser Wilhelm Institute\n[\nwho\n]\nwanted an assistant ... to find out why the atoms occupy positions in the crystal lattices which correspond to symmetry axes. ... He also told me that this had to do with\ngroup theory\nand that I should read a book on group theory and then work it out and tell him.\nWigner's father supported him taking the post in Berlin. There he read\nHeisenberg\n's papers but in developing his own ideas he realised that the mathematics presented problems. He submitted a paper on the spectrum of atoms with\n3\nelectrons to\nZeitschrift für Physik\non\n12\nNovember\n1926\nextending\nHeisenberg\n's results for\n2\nelectrons. The paper ends with Wigner writing that his methods would be prohibitively complicated for atoms with more than three electrons. However, he asked\nvon Neumann\nfor advice on the mathematical difficulties and was told to read about the theory of group characters in\nSchur\n's papers.\nWigner, because of his interest in crystals, had already read\nHeinrich Weber\n's\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\nand, already having an expertise in matrices from Weber's text, he found\nSchur\n's papers easy to understand. He also studied the\nrepresentation theory\nof the symmetric group due to\nFrobenius\nand\nBurnside\n. The theory, as\nvon Neumann\nsuggested, was exactly what he needed to develop a theory of the spectrum of atoms with\nn\nn\nn\nelectrons. He then began the work for which he is famous, namely applying group theory to\nquantum mechanics\n. His paper on the case of\nn\nn\nn\nelectrons was submitted to the\nZeitschrift für Physik\non\n26\nNovember\n1926\n.\nWigner was invited to Göttingen in\n1927\nto become\nHilbert\n's assistant.\nHilbert\n, already interested in quantum mechanics, felt that he needed a physicist as an assistant to complement his own expertise. This was an important time for Wigner who produced papers of great depth and significance, introducing in his paper\nOn the conservation laws of quantum mechanics\n(1927)\nthe new concept of parity. However his collaboration with\nHilbert\nwas less successful for they only met five times during the year\n[\n8\n]\n:-\nI found him painfully withdrawn. ... His enormous fatigue was plain.\nWigner returned to Berlin after the year in Göttingen where he lectured on quantum mechanics, worked on writing his famous text\nGroup theory and its application to the quantum mechanics of atomic spectra\nand continued his research. In fact Wigner's book on the applications of group theory to quantum mechanics was not the first to appear, since\nWeyl\npublished his a little before Wigner. However, as Mackey writes in\n[\n3\n]\n:-\nWeyl's ideas differed from those of Wigner in that he wanted to apply group representations to get a better understanding of the foundations of quantum mechanics in general and not so much to gain insight into particular problems.\nAn offer to spend a term in Princeton saw him travel to the United States at the end of\n1930\n. From\n1930\nto\n1933\nWigner spent part of the year at Princeton, part at Berlin. His Berlin post vanished under the Nazi rules passed in\n1933\nand from then, except for the years\n1936\n-\n1938\nin Wisconsin, Wigner spent the rest of his career at Princeton. In\n1934\nhis younger sister Margit\n(\nalways known as Manci\n)\njoined her brother in Princeton. There she met\nDirac\n, who was a visitor, and the two married in January\n1937\n.\nThere is slight confusion about the reason that Wigner left Princeton in\n1936\n. In\n[\n8\n]\nhe said:-\nIn\n1936\ncame a shock ... Princeton dismissed me ... they never explained why ... I could not help feeling angry.\nPais points out in\n[\n16\n]\nhowever, that this statement by Wigner is not strictly accurate and he was not dismissed. Rather it appears that he was not receiving the promotion in Princeton which he felt that he deserved and so took leave of absence to accept a position of acting professor in Wisconsin. While in Wisconsin, Wigner became a U.S. citizen. Also while at the University of Wisconsin at Madison he met and married Amelia Frank. She was a physics student there but the happiness was soon replaced by much pain for she fell ill with cancer and died in\n1937\nless than a year after the marriage.\nWhile in Wisconsin Wigner showed the role of the special unitary group SU\n(4)\nin considering nuclear forces and he constructed a class of irreducible unitary representations of the\nLorentz\ngroup. Kim writes in\n[\n12\n]\n:-\nWigner's\n1939\npaper on representations of the inhomogeneous\nLorentz\ngroup\n[\nAnn. of Math.\n(2)\n40\n(1939)\n,\n149\n-\n204]\nis one of the most fundamental papers in physics.\nHe was appointed to the Thomas D Jones Chair of Mathematical Physics at Princeton in\n1938\n. He brought his parents to the United States in\n1939\n. First they lived in Princeton, then they moved to a more country place in New York State. They were never happy in the United States and for that matter Wigner never really felt at home. Near the end of his life he wrote:-\nAfter\n60\nyears in the United States I am still more Hungarian than American. ... much of American culture escapes me.\nHe met Mary Annette Wheeler, a physics teacher from Vassar College, in\n1940\nand they were married on\n4\nJune\n1941\n. They had two children, David Wigner who taught mathematics at the University of California in Berkeley, and Martha who worked on the transportation system in the Chicago area.\nWigner worked on the Manhattan Project at the University of Chicago during World War II, from\n1942\nto\n1945\n. His training as an engineer proved valuable background for his war work on nuclear fission.\nWigner received the Nobel Prize for Physics in\n1963\n. The presentation Speech by I Waller put Wigner's contributions into their context:-\nIn order to be able to calculate the motion of the nucleons it was ... necessary to know also the forces which act between them. A very important step in the investigation of these forces was taken by Wigner in\n1933\nwhen he found, deducing from some experiments, that the force between two nucleons is very weak except when their distance apart is very small but that the force is then a million times stronger than the electric forces between the electrons in the outer part of the atoms. Wigner discovered later other important properties of the nuclear forces.\n... It was ... fundamentally important that Wigner could show that most essential properties of the nuclei follow from generally valid symmetries of the laws of motion. Earlier Wigner had performed pioneering work by studying such symmetries in the laws of motion for the electrons and had made important discoveries by investigating e.g. those symmetries which express the fact that the laws mentioned make no difference between left and right and that backward in time according to them is equivalent to forward in time. These investigations were extended by Wigner to the atomic nuclei at the end of the\n1930\ns and he explored then also the newly discovered symmetry property of the force between two nucleons to be the same whether either of the nucleons is a proton or a neutron. This work by Wigner and his other investigations of the symmetry principles in physics are important far beyond nuclear physics proper. His methods and results have become an indispensable guide for the interpretation of the rich and complicated picture which has emerged from recent years' experimental research on elementary particles. They were also an important preliminary for the deeper penetration into and the partial revision of the earlier concepts concerning the right-left symmetry ...\nWigner has made many other important contributions to nuclear physics. He has given a general theory of nuclear reactions and has made decisive contributions to the practical use of nuclear energy. He has, often in collaboration with younger scientists, broken new paths in many other domains of physics.\nR L Ingraham summarised some of the many contributions made by Wigner. These include his:-\n... epoch-making work on how symmetry is implemented in quantum mechanics, the determination of all the irreducible unitary representations of the\nPoincaré\ngroup, and his work with Bargmann on realizing those irreducible unitary representations as the Hilbert spaces of solutions of relativistic wave equations, ... discrete symmetries and superselection rules in quantum mechanics, symmetry implications for atomic and molecular spectra, natural line-width theory, contrast of microscopic and macroscopic physics and of general relativity and quantum mechanics, explanation of why symmetry yields more information for quantum than for classical mechanics, philosophical questions such as what nature laws should be, limits on causality, and whether quantum mechanics could in principle explain life.\nHis important works include\nNuclear Structure\n(1958)\nwith L Eisenbud,\nThe Physical Theory of Neutron Chain Reactors\n(1958)\nwith A Weinberg,\nDispersion Relations and Their Connection with Causality\n(1964)\n, and\nSymmetries and Reflections\n(1967)\n. His\n1960\npaper on\nThe Unreasonable Effectiveness of Mathematics\nhas provoked a wide debate on the role of mathematics in science.\nWigner received many honours for his outstanding work. He was awarded the United States Medal for Merit in\n1946\n, the\nEnrico Fermi\nPrize in\n1958\n, and the Atoms for Peace Award in\n1960\n, the Medal of the Franklin Society, the\nMax Planck\nMedal of the German Physical Society, the George Washington Award of the American-Hungarian Studies Foundation\n(1964)\n, the Semmelweiss Medal of the American-Hungarian Medical Association\n(1965)\n, and the National Medal of Science\n(1969)\n. The list of universities which awarded him an honorary degree is extensive, University of Wisconsin, Washington University, Case Institute, University of Alberta, University of Chicago, Colby College, University of Pennsylvania, Yeshiva University, Thiel College, Notre Dame University, Technische Universität Berlin, Swarthmore College, Université de Louvain, Université de Liège, University of Illinois, Catholic University, and The Rockefeller University. He was elected a Fellow of the\nRoyal Society of London\nin\n1970\nand other memberships of learned societies included the\nNational Academy of Science\n, the\nAmerican Academy of Arts and Sciences\n, the\nRoyal Netherlands Academy of Sciences and Letters\n, the American Association for the Advancement of Science, the\nAustrian Academy of Sciences\n, and the\nGesellschaft der Wissenschaften\nof Göttingen.\nA J Coleman writes of the:-\n... course by Wigner on advanced quantum mechanics which I had the good fortune to attend at Princeton in\n1940\n. I recall a person with razor-sharp mind and of a kind and gentle spirit.\nMany other references to Wigner's personality leave the feeling that, despite the extensive interviews such as\n[\n8\n]\nand\n[\n13\n]\n, he is still someone who is slightly mysterious. As Pais writes in\n[\n16\n]\n:-\nHe was a very strange man and one of the giants of twentieth-century physics.\nPerhaps we should end with Wigner's own words:-\nThe promise of future science is to furnish a unifying goal to mankind rather than merely the means to an easy life, to provide some of what the human soul needs in addition to bread alone."
}