{
  "nome_completo": "Evgenii Mikhailovich Lifshitz",
  "nome_curto": "Evgenii Mikhailovich Lifshitz",
  "ano_nascimento": "1915",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lifshitz/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Evgenii Mikhailovich Lifshitz\n's father, Mikhail Ilyich Lifshitz, was a doctor and a professor at the Institute of Medicine specialising in gastric diseases. He was a highly educated man who had a reputation throughout the Soviet Union as an outstanding doctor. We have information about Mikhail Ilyich, and also about Evgenii Mikhailovich's childhood, from a letter written by Evgenii Mikhailovich's cousins to his wife after he died\n(\nsee\n[\n24\n]\n)\n. Mikhail Ilyich's abilities as a doctor led to him treating important people, for example he cured Vsevolod Apollonovich Balitski\n(1892\n-\n1937)\n, the Ukraine commissar for internal affairs, and Feliks Edmundovich Dzerzhinskii\n(1877\n-\n1926)\n, a party leader and prominent member the revolutionary movement. He was also called to advise Mikhail Vasilyevich Frunze\n(1885\n-\n1925)\nand other members of the Ukraine government. Evgenii Mikhailovich had a younger brother Ilya Mikhailovich Lifshitz\n(1917\n-\n1982)\nwho also became a famous physicist\n[\n24\n]\n:-\nThe brothers were different kinds of person, but had the greatest affection and regard for each other. Each knew the other's strengths and weaknesses, admiring the former and excusing the latter.\nEvgenii Mikhailovich was educated at home only spending only two years, the sixth and the seventh, in the secondary school in Kharkov. He learnt English and German as foreign languages, but next to Russian he preferred to speak English. He claimed that the German teaching had been relatively poor. As well as enjoying mathematics and science, he also enjoyed music, poetry, literature and history, keeping up these interests throughout his life. We quote from the letter from his cousins given in\n[\n24\n]\n. Lifshitz's father:-\n... often went on missions abroad, taking the family with him. He knew English extremely well. In the family, conversation with the children was in English, and they acquired a good knowledge of it. They had an excellent English teacher, Gordon, from their childhood until\n1937\n. He was an émigré from Britain. The family also had an excellent music teacher, Alisa Nikolaevna Goldenger, who educated their musical taste and gave them\n[\nEvgenii Mikhailovich and his brother Ilya Mikhailovich\n]\na love of music, for which they had more than ordinary talent.\n[\nThe brothers\n]\neven wrote music and thought of becoming musicians. But they were simply talented boys who easily found their way to and appreciated anything they became aware of.\nWe learn more about the young boy Evgenii Mikhailovich from this letter\n[\n24\n]\n:-\n[\nEvgenii\n]\nas a child was somewhat unsociable, wrapped up in himself, but lively and responsive to his friends, either children or, later, adults. He showed them from childhood that he was the person of principle he afterwards remained. He defended his view always to the end, was restrained, but often peremptory, in his judgements.\n[\nHe\n]\ndid not eat much and was a thin boy. As the elder brother, he was the more independent. The two of them had a good collection of books. They played table tennis on the big table in the dining room ...\nThe boys also loved to play charades and played other games such as bowling, croquet and table top games that their father had bought when on his trips abroad. They would go on holiday as a large extended family with the uncles, aunts etc being with them and making up a group of between\n20\nand\n25\npeople. Evgenii Mikhailovich completed his secondary school studies in\n1929\nwhen he was only fourteen years old. He then studied for two years at the chemical college before beginning his university studies in\n1931\nin the physics and mechanics faculty of Kharkov Mechanics and Machine Building Institute. He graduated in\n1933\n, having completed the examinations and had a diploma thesis accepted. In\n1933\nhe began working as a graduate student at the Ukrainian Physicotechnical Institute having been accepted as one of\nLev Landau\n's first Ph.D. students. He explains in\n[\n17\n]\nwhat he had to do to pass\nLandau\n's \"theoretical minimum\":-\n... the first test which\nLandau\ngave to any one who desired to become one of his students was a quiz in mathematics in its \"practical\" calculational aspects. The requirements were: ability to evaluate any indefinite integral\n(\nin terms of elementary functions\n)\nand to solve any ordinary differential equation of the standard type, knowledge of vector analysis and tensor algebra as well as of principles of the theory of functions of complex variable\n(\ntheory of residues,\nLaplace\nmethod\n)\n. The successful applicant could then pass on to the study of the seven successive sections of the programme for the \"theoretical minimum,\" which includes basic knowledge of all the domains of theoretical physics, and subsequently take an appropriate examination.\nHe completed the course and took the Ph.D. examination in\n1934\n. In the same year his father Mikhail Ilyich died and, also his first paper\nOn the production of electrons and positrons by a collision of two particles\n, written jointly with\nLandau\n, appeared in print. Let us note at this point that Evgenii Mikhailovich's mother, Berta Evzorovna, outlived her husband by\n42\nyears, living until\n1976\n. After the award of his Ph.D., Lifshitz worked at the Institute until\n1938\nas a senior research scientist. In\n1935\ntwo further joint papers with\nLandau\nwere published, one being a continuation of their first paper while the second,\nOn the theory of the dispersion of magnetic permeability in ferromagnetic bodies\n, is considered the most significant of his joint research papers with\nLandau\n. The paper\n[\n24\n]\n:-\n... contains the so-called\nLandau\n-Lifshitz equivalent of motion for the magnetisation in ferromagnets. This paper also discusses the domain structure of ferromagnets and the problem of ferromagnetic resonance.\nIn\n1935\nhe began work on his joint project with\nLandau\n, the ten volume\nCourse of Theoretical Physics\n. The first part of the book is based on lecture notes. Lifshitz continued to work on the book after\nLandau\n's death and it was not completed until\n1979\n. The work includes many of the results of\nLandau\nand Lifshitz's research over many years including the results of many jointly written research papers.\nSee extracts from the Prefaces to Landau and Lifshitz:\nCourse of Theoretical Physics\nat\nTHIS LINK\nSee extracts from  Reviews of Landau and Lifshitz:\nCourse of Theoretical Physics\nat\nTHIS LINK\nReading the descriptions of Lifshitz, both as a person and as a scientist, that have been written since his death one is struck with the large variation in them. It becomes clear that, common with many families, there was stresses and strains both in Lifshitz's family and in\nLandau\n's family which has played a large role in colouring the views that have been expressed in the articles. Several things, however, are very clear. Lifshitz and\nLandau\nwere close friends,\nLandau\nwas the brilliant researcher while Lifshitz was the outstanding expositor. Their talents complemented each others extremely well and they made a remarkable team. However, their work was badly disrupted in the late\n1930\ns by the extremely difficult situation that arose because of Joseph Stalin's 'Great Purge'. Beginning in\n1935\n, Stalin began a systematic elimination of his opponents in the 'Great Purge'. Soon it was leading members of his party, of the military, and important people from all walks of life who were being sent to prison, penal camps or work camps. Soon\nLandau\nwas under investigation by the KGB who had received information from informers that he was making anti-government statements. Lifshitz was in Moscow in early\n1938\n, teaching from February of that year at the All-Union Leather Institute. On\n28\nApril\n1938\n,\nLandau\nwas arrested and taken to Lubyanka prison. Lifshitz decided that the safest thing for him to do was to keep out of sight in case he attracted the same attention from the KGB. He remained in Moscow until May, then went with his wife to the Crimea where he lived for three months, during which time he was in continual fear that he would be visited by the KGB. In September\n1938\nhe returned to Kharkov where he taught at the Chemical Technology Institute until June\n1939\n.\nIn\n1939\nLifshitz's thesis for the DSc examination of Leningrad State University was accepted. From September\n1939\nhe worked entirely at the Academy of Sciences Institute of Physical Problems in Moscow. In fact it was Peter Kapitsa, the director of the Institute of Physical Problems, who invited Lifshitz to Moscow and arranged for him to share with\nLandau\na\n5\n-room apartment on two floors.\nLandau\nlived on the upper floor where there were three rooms, and Lifshitz and his wife, Elena Konstantinovna Berezovskaya, lived on the lower floor. It had been largely due to Kapitsa that\nLandau\nhad been released from prison for Kapitsa had written several letters to leading government members arguing forcibly for his release. Lifshitz deeply admired Kapitsa's courage in sending these letters and he treasured copies of the letters which he kept throughout his life. We could note here a comment on Lifshitz's political views. He never liked the Communist way and this meant that his views were very different from those of\nLandau\nwho strongly believed in the Communist principles. After\nLandau\n's arrest and year in prison, although he continued to believe in Communist principles he became strongly opposed to Stalin's leadership and this meant that from that time on\nLandau\nand Lifshitz had more sympathy with each others political views. However, the two friends still loved to argue about many topics, but most of all about the\nCourse of Theoretical Physics\n.\nIn the afternoon, Evgenii Lifshitz would drop by\nLandau\n's place, and from behind the study's closed doors one could hear their loud arguments. After a couple of hours Lifshitz would leave, agitated and red-faced.\nOn\n7\nJanuary\n1962\n,\nLandau\nwas involved in a car accident on the road from Moscow to Dubna. Although he lived for six years after this accident, he was never able to return to scientific work. Lifshitz had to take charge of the production of the final volumes of the\nCourse of Theoretical Physics\nand also take charge of the new editions of the earlier books which were produced regularly. For example, in April\n1966\nwhen he wrote the Preface to the second edition of\nStatistical Physics\n, Lifshitz wrote:-\nTo my profound regret,\nL D Landau\n, my teacher and friend, has been prevented by injuries received in a road accident from personally contributing to the preparation of this new edition.\nSome reviewers claim that volumes written after\nLandau\n's death do not quite come up to the standard of the earlier ones. For example\n[\n11\n]\n:-\nThis volume was written after\nLandau\n's death and unfortunately does not share with its predecessors these unique qualities. Not that there is anything wrong with the presentation - conventional topics of quantum field theory are adequately treated - but there is no personal imprint on the material.\nHowever, others believe that the exceptionally high standard of the texts written with\nLandau\nare maintained in the later volumes where Lifshitz was the main author. After\nLandau\n's death, the further volumes that were written were jointly authored with Lifshitz choosing his co-authors with great care. The authors of\n[\n24\n]\ndescribe his behaviour when he was working in the Institute in Moscow:-\nIf you went into the Institute courtyard on almost any day you would come across Evgenii Mikhailovich. Not in an overcoat, whatever the season, though in winter with a beret and with a scarf around his neck, he would be walking with rapid steps from one building to another, but never, one felt, just because he was a bustler; he was genuinely incapable of wasting time. Knowing his vast work on the 'Course' in its many languages\n(\nfor he made changes and corrections in every new version\n)\n, the time spent on writing further volumes, the demandingness and thoroughness with which the 'Course of Theoretical Physics' was conducted, we all understood that he had no time to waste. This did not mean that, when he crossed the courtyard, he failed to notice people, or avoided meeting them and conversing. far from it; often one could see a group of two or three in conversation and could join in. ... However, when the topic was exhausted, when the matter was settled, or when it became clear that nothing more could be added, the conversation ended, and Evgenii Mikhailovich continued at his rapid pace, until the next person crossed his path.\nFor around thirty years he was been the deputy chief editor of\nJournal of Experimental and Theoretical Physics\n. The chief editor was Kapitza but it was Lifshitz who was in complete charge of the day-to-day running of the\nJournal\n. He would choose referees for the papers submitted to the journal and correspond with the authors with a precision and exactness that characterised all of his work.\nIn\n1966\nLifshitz was elected a corresponding member of the\nUSSR Academy of Sciences\nbeing elected a full member in\n1979\n. In\n1954\nhe was awarded a State Prize, and in\n1962\nthe Lenin Prize jointly with\nLev Landau\nfor their\nCourse of Theoretical Physics\n. The\nUSSR Academy of Sciences\nawarded him the M V Lomonosov Prize in\n1958\nfor his theory of molecular interaction forces between condensed bodies, and the\nLev Landau\nPrize in\n1974\n. This\n1974\nprize was awarded jointly to Lifshitz, V A Belinskii and I M Khalatnikov for their work on the singularities of cosmological solutions of the gravitational equations which was presented in sixteen papers between\n1961\nand\n1985\n. In\n1983\nhe was elected a fellow of the\nRoyal Society of London\nand, two years later, he received an honorary doctorate from Budapest University.\nAlthough Lifshitz was married to Elena Konstantinovna, he became friendly with Zinaida Ivanovna Gorobetc as early as\n1948\nand his relationship with her was quite open. He married Zinaida in\n1978\n. He had a son Mikhail who was born in\n1946\nand became graduated from the Institute of Medicine. In\n1982\nLifshitz's brother Ilya Mikhailovich died. This hit Lifshitz very hard and from this time on his health began to deteriorate.  For most of his life Lifshitz had enjoyed excellent health. His final illness was a heart problem which rapidly became worse. However, Lifshitz was always one to work extremely hard and so he battled to continue to keep up the same high work rate despite his illness. Despite his health problem, he continued to travel to many countries where he lectured at leading institutions. For example, he lectured at Cambridge University in England in\n1985\n. However, he took very badly with the illness, particularly when taken to hospital in Moscow, and continued to the end to arrange for his work on the\nCourse\nto continue. After his death he was buried in Kuntsevo Cemetery in Moscow."
}