{
  "nome_completo": "Evgeny Yakovlevich Remez",
  "nome_curto": "Evgeny Remez",
  "ano_nascimento": "1896",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Remez/",
  "lugar_nascimento": "Mstsislau, Mahiliou gubernia, Belarus",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Evgeny Remez\n's name also appears as\nEvgenii Remez\nor sometimes in the French form\nEugene J Remes\n. He attended the high school in Mstsislau where he excelled across the whole range of school subjects and graduated from the\ngymnasium\nin\n1916\nwith the gold medal. He then went to Kiev\n(\nor Kyiv to give it its modern spelling\n)\nwhere he entered the Institute of Public Education, as Kiev University was called at that time, where he studied mathematics and mathematical physics. The period during which he attended the Institute were difficult ones with major political changes taking place. In\n1917\nthe Russian Empire broke up and Ukraine became independent during\n1918\n-\n19\n, then the USSR was established leading to further changes. Remez graduated in\n1924\nand began to teach both at the Institute of Public Education and at the Mechanical Trade School. He gave courses at these institutions on analysis,\ndifferential equations\nand differential geometry while undertaking research for his doctorate.\nHe obtained his Ph.D. from Kiev State University in\n1929\nwith his thesis\nMethods of Numerical Integration of Differential Equations with an Estimate of Exact Limits of Allowable Errors\n. He continued to undertake research in approximation theory, particularly in the constructive theory of functions, and in numerical analysis for the rest of his career. Remez lived in Kiev, teaching at various institutions there, for most of his life. These institutions included the Pedagogical Institute, the Mining Institute, and the Geological Institute. He was head of the mathematics department at these institutions from\n1930\nonwards. He worked at the Pedagogical Institute from\n1933\nto\n1955\nand he became a professor at Kiev University in\n1935\n. He also worked at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev from\n1935\nuntil his death in\n1975\n. The Institute of Mathematics had only been founded in Kiev shortly before Remez began to work there.\nNow we said above that Remez obtained his Ph.D. in\n1929\n. This was not strictly true, for what he was awarded in\n1929\nwas a 'Kandidat' degree, which is recognised as equivalent to the Ph.D. The Russian 'Doctor of Science' degree was a second stage, somewhat similar to the\nHabilitation\nin Germany. This degree required many years of research experience and the writing of a second dissertation. Professorships were only open to those holding the degree of Doctor of Sciences, so it was important to Remez that he work towards this degree. He submitted his second dissertation in\n1936\nand was awarded the degree of Doctor of Physical and Mathematical Sciences without any further examinations. This now put him in a position to become a professor and indeed two years later the title was confered on him by the Higher Degree Commission. In\n1939\nhe was elected to the\nAcademy of Sciences of the Ukrainian SSR\n.\nHis main work was on the constructive theory of functions and approximation theory. In the mid\n1930\ns, he developed general computational methods of\nChebyshev\napproximation and the Remez algorithm which allows uniform approximation. It constructs, with a prescribed degree of exactness, a polynomial of the best\nChebyshev\napproximation for a given continuous function. A similar algorithm was later developed which allowed rational approximation of continuous functions defined on an interval. Remez generalised\nChebyshev\n-\nMarkov\ncharacterisation theory and used it to obtain approximate solutions of differential equations. He proved results about bounded polynomials and created general operator methods of sequence approximation. He also worked on approximate solutions of differential equations and the history of mathematics.\nToday English has become the main language of mathematics and papers written in Russian or Ukrainian are often translated into English. However, in the years between World War I and World War II, it looked as if French would become the main international mathematical language and many mathematicians from the USSR wrote papers in French with the idea that they would be available to a much wider readership. Remez's papers up to the end of World War II were often written in French and his name appears on these papers as Eugene J Remes. For example in\n1940\nhis publications included\nOn some estimates of best approximation and, in particular, on a fundamental theorem of de la Vallée-Poussin\n(\nRussian\n)\n(1940)\n,\nPrincipe des moindres puissances,\n2\nk-ièmes et principe des moindres carrés dans les problèmes d'approximation\nⓉ\n(\nPrinciple of least\n2\nk-th powers,  and principle of least squares in the approximation problems\n)\n(1940)\n,\nSur certaines classes de fonctionnelles linéaires dans les espaces\nC\np\nC_{p}\nC\np\n​\net sur les termes complémentaires des formules d'analyse approximative\nⓉ\n(\nOn some classes of linear functional in C\np\nspaces and the additional terms of approximate analysis formulas\n)\n(1940)\n, and\nSur les termes complémentaires de certaines formules d'analyse approximative\nⓉ\n(\nOn the additional terms of certain approximate analysis formulas\n)\n(1940)\n. By\n1947\n-\n48\nhis papers were all written either in Russian or Ukrainian. For example\nOn the character of convergence of the Pólya-Jackson process in the general case of continuous polynomials\n(\nRussian\n)\n(1947)\n,\nEstimates of the rapidity of convergence of the Pólya-Jackson process for continuous polynomials with supplementary structural conditions\n(\nRussian\n)\n(1947)\n,\nOn the limiting process of Pólya-Jackson-Julia and certain corresponding interpolation algorithms\n(\nRussian\n)\n(1947)\n,\nOn mean, uniform\n(\nChebyshevian\n)\nand quasiuniform approximations\n(\nRussian\n)\n(1948)\n, and\nDetailed investigations of limiting relations between power-mean and Chebyshev approximations\n(\nUkrainian\n)\n(1948)\n.\nFor some mathematicians, Remez is best known as the author of the book\nGeneral computation methods for Chebyshev approximation. Problems with real parameters entering linearly\n(\nRussian\n)\n(1957)\n.\nAlston Householder\nreviewed the book and begins his review with high praise:-\nThis is the first volume to include between its two covers a fairly complete development of\nChebyshev\napproximation, its theory and its practice. Such a book is long overdue. Techniques are illustrated by a number of special examples worked out in detail, and different methods are applied to the same problem by way of comparison. The elaborate chapter and section headings make the Table of Contents into a detailed outline that facilitates reference. Little is presupposed on the part of the reader except the most basic concepts of algebra and analysis. An appendix sets forth the theory of convex bodies as far as it is required in the main text.\nHowever, he then makes some critical comments:-\nThese are weighty recommendations and there are no others. The language is turgid and often bombastic, the explanations prolix and wearisome. The pages are replete with footnotes, chips off the workbench, generally unnecessary and frequently distracting. The notation is cumbersome and confusing, rather suggestive of\nChebyshev\n's own, to be expected in the early\n19\nth\ncentury but inexcusable in the middle\n20\nth\n. Nevertheless, most of the material is to be found elsewhere only in journals and hence it is an important book for the numerical analyst.\nThe book has two parts: Part I - Properties of the solution of the general\nChebyshev\nproblem; Part II - Finite systems of inconsistent equations and the method of nets in\nChebyshev\napproximation. Of course this was a topic which developed quickly over the following years, much of the development being due to Remez and his students. A new, greatly expanded, edition of the book appeared under the title\nFundamentals of numerical methods of Chebyshev approximation\nin\n1969\n.\nNot only did Remez develop techniques which originated with\nChebyshev\n, but he also became an expert on\nChebyshev\nand his work. On\n8\nJune\n1971\na meeting was held at the Mathematical Institute of the\nUkrainian Academy of Sciences\nto honour the\n150\nth\nanniversary of the birth of\nChebyshev\n, which was on\n16\nMay. Remez lectured at this meeting on\nChebyshev\n's work on approximation theory\n. In\n1974\nRemez published\nSome of the principal divisions of P L Chebyshev's scientific activity\n(\nUkrainian\n)\nwhich discussed\nChebyshev\n's contributions to number theory, the theory of mechanisms, approximation of functions, minimax problems, and cartography.\nAlthough the article\n[\n3\n]\nwas written to honour Remez's eightieth birthday, sadly he died about six months short of reaching that birthday. The authors of that article note:-\nAll of Remez's work is characterised by great skill in applying the subtlest theoretical studies to finding a numerical solution to concrete problems."
}