{
  "nome_completo": "François-Félix Tisserand",
  "nome_curto": "Félix Tisserand",
  "ano_nascimento": "1845",
  "ano_morte": "1896",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tisserand/",
  "lugar_nascimento": "Nuits-St-Georges, Côte-d'Or, France",
  "lugar_morte": "Paris, France",
  "biografia": "Félix Tisserand\nstudied at the École Normale. In his doctoral thesis, written in\n1868\n, Tisserand extended\nDelaunay\n's work on the three-body problem on the orbit of the Moon. This work was an outstanding contribution to mathematical astronomy coming quickly after the publication of the second volume of\nDelaunay\n's work on lunar theory\nLa Théorie du mouvement de la lune\nⓉ\n(\nThe Theory of the movement of the moon\n)\nwhich had been published in\n1867\n. Tisserand was then appointed as an assistant-astronomer at the Paris Observatory.\nThis was an unfortunate time at the Paris Observatory since its Director\nLe Verrier\nhad become very unpopular following his drive for efficiency and attempts were being made to have him removed. In\n1870\nDelaunay\nwas appointed as Director of the Paris Observatory to replace\nLe Verrier\n. Tisserand showed remarkable abilities in his work at the Observatory and it was clear that he would soon achieve an elevated position in the world of astronomy. In\n1873\nTisserand was appointed director of the Toulouse Observatory to succeed Daguin, a post which he held for five years.\nAt the Toulouse Observatory Tisserand appointed two young astronomers, Joseph Perrotin and\nGuillaume Bigourdan\n, to help him in his observational work. Neither were experienced in astronomy but Tisserand had made two good choices for he soon trained the young men to become astronomers of outstanding qualities.\nTisserand did not spend the whole of his five years as director in Toulouse. In\n1874\nhe went to Japan to make observations of the\ntransit\nof Venus which occurred that year. A transit of Venus is when the planet passed in front of the disc of the sun as viewed from the Earth and Tisserand took a year to make the journey to Japan, make his observations, and return to France. In order to keep the Toulouse Observatory operating during this lengthy absence Jules Gruey, a teacher at the Toulouse Faculty of Science was appointed temporary director. The experience stood Gruey in good stead for he went on to became the director of the Besançon Observatory.\nAfter Tisserand returned to France and took over again as director of the Observatory in Toulouse he had a new instrument installed. However the\n83\ncentimetre telescope installed in\n1875\nwas not a great success since the wooden base was not stable enough to allow photography. Having a telescope which could not be used for photography was rather unfortunate since most astronomical work at that time required that facility. Tisserand decided to undertake a programme of measurement of the separation of binary stars, but he discovered that the micrometer used for such measurements did not work. He decided that he could only use the defective telescope for observing the planets and together with his assistants he made observations of the moons of Jupiter and Saturn.\nFrom\n1892\nuntil his death he was director of the Paris Observatory. When he arrived to take up the post of director work was being undertaken at the Observatory on the\nCatalogue photographique de la carte du ciel\n(\nthe Photographic Catalogue of the Map of the Sky\n)\n. Tisserand took over the task of completing this major work and arranged for its publication.\nTisserand is especially remembered for his four volume textbook which is an update of\nLaplace\n's work. He published\nTraité de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\n,  in four volumes which appeared between the years\n1889\nand\n1896\n. Despite being\n100\nyears old this textbook is still sometimes referred to by current writers of celestial mechanics books.\nIn\n1874\nhe was elected to the\nAcademy of Sciences\nas a corresponding member and was elevated to full membership in\n1878\n."
}