{
  "nome_completo": "Felix Earl Browder",
  "nome_curto": "Felix Browder",
  "ano_nascimento": "1927",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Browder_Felix/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Felix Browder\n's parents were Earl Browder and Raissa Berkmann. Felix was the eldest of his parents' three children; the two younger are Andrew Browder and\nWilliam Browder\n. All three boys have become leading mathematicians and so we should begin by giving some details of their parents Earl and Raissa Browder.\nEarl Browder\n(1891\n-\n1973)\n, the eighth of ten children, was educated at home in Wichita by his unemployed schoolteacher father William Browder and from him received his first Socialist teachings. Earl, who joined the Socialist party at age\n16\n, worked as an accountant and took a correspondence school law course. He opposed World War I and was jailed twice between\n1917\nand\n1920\n. The first time was for conspiring to defeat the operation of the draft law\n(\na two year conviction\n)\nand for non-registration\n(\na one-year conviction\n)\n, and the second time for conspiracy. In the\n1920\ns he often visited Russia as a representative of the Communist Trade Unions in the United States. He met Raissa Berkmann at a Soviet social function in Moscow on one of his visits.\nRaissa Berkmann, born in St Petersburg in\n1897\n, graduated with a law degree from the University of St Petersburg in\n1917\n. Since she was Jewish, being admitted to university had not proved easy and it was difficult for anyone Jewish to practise law in Russia. After the Russian Revolution she taught at Moscow University and at the Lenin Institute. Earl Browder had married in\n1911\nbut was separated from his wife. They were divorced in April\n1926\nand Earl and Raissa were married on\n15\nSeptember\n1926\n. The first two of their three children were born in Moscow; Felix\n(\nthe subject of this biography\n)\nin\n1928\nand Andrew in\n1932\n. Earl Browder returned to the United States in\n1929\nbut Raissa remained in Moscow until\n1933\n. She joined her husband in the United States, crossing the Canadian border without a visa. The two boys, having an American father, did not require a visa, but\n[\n8\n]\n:-\nAlthough\n[\nRaissa\n]\njoined her husband and lived in New York permanently thereafter, federal officials did not proceed against her until\n1939\n. For the next sixteen years the Browders waged a legal battle to prevent her deportation.\nIn\n1934\ntheir third son, William Browder, was born in New York. Earl became General Secretary of the Communist Party of the United States in\n1934\n, holding the position for the next eleven years\n[\n8\n]\n:-\n... he provided for his second family \"an urban home of\n[\nculturally\n]\nsuperior circumstances.\" His relationship with his three sons was \"very close.\" Ironically, the children were always fond of the sciences. Although they experienced some discrimination because of their father's beliefs, they all became mathematics professors at major American universities.\nFelix Browder's brother,\nWilliam Browder\n, writes in\n[\n1\n]\nabout the children's upbringing:-\nAll three of us were bookish, surrounded by books of all types and levels. Felix was a child prodigy, reading at a very sophisticated level from the age of four and terrorising all his grade school teachers with his breadth of knowledge and sophistication. ... We all played chess at a reasonable level, and we read the newspapers with eagerness ...\nIn fact Felix is said to have read at least a book a day from the time he was five years old. He attended Yonkers High School, in Rockland Avenue, Yonkers, New York. During his school years, his father had been convicted of passport fraud and sentenced to four years in prison in January\n1940\n. Earl had acknowledged that he had travelled incognito to and from conferences with Soviet leaders in Moscow. These family difficulties seemed to have little effect on Felix's school performance and, at the age of sixteen, he took part in the New York State competition for university scholarships. Being one of the best entrants despite being so young, he was awarded a scholarship in\n1944\n. In the same year he entered the Massachusetts Institute of Technology and, after only two years of study, graduated in\n1946\n. He wrote\n[\n1\n]\n:-\nI was one of the top five contestants in the William Lowell Putnam Competition, a national mathematics contest for undergraduates.\nAfter the award of his first degree, Browder entered Princeton where he undertook research advised by\nSolomon Lefschetz\n. He submitted his doctoral thesis\nThe Topological Fixed Point Theory and Its Applications in Functional Analysis\nto Princeton in\n1948\nand was awarded his Ph.D. at the age of twenty. His thesis was\n[\n1\n]\n:-\n... on nonlinear\nfunctional analysis\nand its applications. This area and partial differential equations have been my focus in the sixty years since, in particular nonlinear monotone operators from a\nBanach space\nto its dual.\nIn\n1948\nBrowder was appointed as a C L E Moore Instructor in Mathematics at the Massachusetts Institute of Technology. He married Eva Tislowitz on\n5\nOctober\n1949\n; they have two children, Thomas and William. This was a difficult period in which to obtain permanent academic positions and, despite being recommended for such a position by the Mathematics Department at MIT, the university would not give him a permanent or long-tern appointment. In\n1951\n, when his term as C L E Moore Instructor ended, Browder was appointed as an Instructor in Mathematics at Boston University. He published\nThe Dirichlet problem for linear elliptic equations of arbitrary even order with variable coefficients\nand\nThe Dirichlet and vibration problems for linear elliptic differential equations of arbitrary order\nin the\nProceedings\nof the\nNational Academy of Sciences\nin\n1952\n, and further papers in the same\nProceedings\nin the following year. In\n1953\nhe was awarded a Guggenheim Fellowship and, in the same year, was drafted into the army. At this time, with the Korean war, heightening Cold War tension and signs of the coming conflict in Vietnam, the United States was operating a system of compulsory military service. However, given Browder's background, problems arose immediately\n[\n1\n]\n:-\nIn the army, I was classified as a security risk and eventually received a trial for this status, for which I was finally acquitted.\nIn April\n1953\nNorman Levinson\ntestified to the Committee on Un-American Activities of the United States House of Representatives concerning Felix Browder. His testimony is interesting, both in describing the remarkable abilities of Browder and in detailing the difficulties he had faced because of his father's role as General Secretary of the Communist Party of the United States\n[\n6\n]\n:-\nI know this boy very well. He came to MIT at the age of\n16\n, with a brilliant record. He got through MIT in\n2\nyears. He is the best student we had ever had in mathematics in MIT in the\n90\nyears of existence of the institution. He had a brilliant career at Princeton. He is about\n25\nor\n26\nnow, and I regard him as one of the most brilliant mathematicians in the world. He is certainly a much better mathematician than I am or Dr Martin, who was here yesterday. On the other hand, it is also true - I have talked with him a lot; I know him very well - he has been anti-Communist. He has opposed criticism of music in the Soviet Union; the genetics business. He regards the group running Russia as a bunch of dictators, unscrupulous men, and so on, and has said so. I know that he's prepared at any time to sign a sworn statement that he isn't and has never been a member of the Communist Party. I believe that a man of his qualifications is a real asset to this country. He is really a great scientist, and I think it's in the American spirit to give a man like that a chance, not to visit the sins of his father on him. Actually, he's had a terrible time getting a position, and some of the great scientists of our country have tried to help him. The schools and universities of this country have a severe public-relations problem. They are not self-supporting. They do a great service. They turn out scientists, physicians and so on ; but it costs more than they take in, in tuition. They are rather frightened of his name, and it's easy to see why they are. They are afraid it will reduce contributions, and so on. So, he has had a very difficult time of it. In spite of this, he is turning out remarkably good work. He is in a field - a field of partial differential equations, which is a field in which the laws of radar, jet propulsion, atomic fission, all the basic laws of physics are expressed. He has made many new discoveries, and I think it would be very nice indeed if we could be American enough to give a fellow like that a chance.\nLeaving the army in\n1955\n, Browder was appointed as an Assistant Professor of Mathematics at Brandeis University. After a year, he was appointed as an Assistant Professor of Mathematics at Yale where he was steadily promoted reaching the rank of Professor by the time he left in\n1963\nto take up the position of Professor of Mathematics at the University of Chicago. He remained at Chicago until he retired in\n1986\n. While at Chicago, he was Louis Block Professor of Mathematics during\n1972\n-\n82\nand, after this, Max Mason Distinguished Service Professor. He was chair of the Mathematics Department at Chicago from\n1971\nto\n1976\nand again from\n1979\nto\n1985\n. After retiring from the University of Chicago, Browder became a professor at Rutgers University where he was also Vice-President for Research from\n1986\nto\n1991\n.\nHis research contributions are explained in detail in\n[\n3\n]\n:-\nLinear functional analysis had its major development in the first half of this century, starting with the spectral theory of\nHilbert\nand\nvon Neumann\nand the work of\nBanach\n. Nonlinear functional analysis, although rooted in the work of\nPoincaré\nin the last century, had its first great upsurge in the work of\nLeray\nand\nSchauder\nin the\n1930\ns. The subject had its origins in the study of nonlinear ordinary and partial differential equations, but it came to encompass a wider range of questions in all branches of analysis and in differential geometry, in theoretical physics, and in economics. Felix Browder has been the dominant figure in this field since the early\n1950\ns. In the theory of linear elliptic partial differential equations, the work of Felix Browder and his school went well beyond the techniques first introduced by Russian analysts in establishing completeness theorems for the eigenfunctions of nonselfadjoint elliptic differential operators. Browder's results on these fundamental issues remain definitive to this day. In nonlinear functional analysis the introduction of monotone and, later, accretive operator theory led to the solution of problems that had heretofore been out of reach. Felix Browder proved a general theorem on monotone operators in reflexive\nBanach\nspaces, stating that a coercive continuous monotone operator from a reflexive\nBanach\nspace to its dual space is subjective. This theorem led to the proof of some deep existence theorems for nonlinear partial differential equations and began a massive development of monotone operator methods and their applications to partial differential equations. It is especially noteworthy that Browder's theory freed us from restrictive compactness assumptions and thereby led to a very substantial enlargement of the range of nonlinear problems to which exact analysis could be applied.\nIn\n[\n5\n]\nhis contributions which led to the award of the\n2000\nNational\nMedal of Science are detailed. In addition to his research contributions, other important aspects of his mathematical contributions are mentioned:-\nBrowder's progressive international view of science made him a leader for his time. It was through his efforts that the French analysts developed the strong interactions with their American counterparts that characterizes present-day research efforts. His supportive efforts to improve undergraduate and graduate education in the mathematical sciences included bringing about the successful AMOCO project at the University of Chicago, a program to engage inner-city youth in science; as well as the Center for Mathematics, Science and Computer Education; and the Outreach Program in Mathematics at Rutgers University. He has sustained over many years, advocacy of the involvement of women and minorities in science and mathematics. At a time when it was not popular within mathematical circles, Browder advocated including applied mathematics at the highest levels into mathematics departments and did so successfully at Rutgers and at the University of Chicago, where he is the Max Mason Distinguished Service Award Professor Emeritus.\nBrowder gave great service to the\nAmerican Mathematical Society\nover many years. He was their Colloquium Lecturer in\n1973\ngiving the lectures\nNonlinear functional analysis and its applications to nonlinear partial differential and integral equations\n. He also served the Society as editor of the\nBulletin\n. Of the many\nAmerican Mathematical Society\ncommittees that he served on, let us mention in particular the Science Policy Committee to which he made important long-lasting contributions. He\n[\n3\n]\n:-\n... organised innumerable special sessions at regional and national meetings and was a principal organizer of the meetings that celebrated the heritage of\nHilbert\n,\nE Cartan\n,\nPoincaré\n, and\nWeyl\n.\nHe was honoured with election as the\n55\nth\nPresident of the\nAmerican Mathematical Society\nin\n1999\n-\n2000\n. His views on many topics related to this position are discussed in the interview\n[\n7\n]\n. Other honours include his election to the\nNational Academy of Science\nin\n1973\n- he served as a member of the Council\n1992\n-\n95\nand the Governing Board of the National Research Council\n1994\n-\n95\n. He was elected a fellow of the\nAmerican Academy of Arts and Sciences\nin\n1959\nand awarded an honorary degree by the University of Paris in\n1990\n.\nFinally, let us quote from\n[\n1\n]\nabout his personal library which contains-\n... thirty-five thousand books. The library has a number of different categories. There is mathematics, physics and science as well as philosophy, literature and history, with a certain number of volumes of contemporary political science and economics. It is a polymath library. I am interested in everything and my library reflects all my interests."
}