{
  "nome_completo": "Flora Philip",
  "nome_curto": "Flora Philip",
  "ano_nascimento": "1865",
  "ano_morte": "1943",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Philip_Flora/",
  "lugar_nascimento": "Tobermory, Isle of Mull, Argyle, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Flora Philip\n's father was William Philip who was a civil engineer. He is described on Flora's birth certificate as \"an Inspector of Decks and Piers\". Flora's mother was Isabella McDougall; William and Flora had been married in Leith in August\n1864\n. Flora's birth certificate also informs us that she was born at five minutes past four in the morning and that her birth was registered on\n31\nMay at Tobermory by Jessie McDougall, Flora's aunt, who was present at her birth.\nFlora was educated in Tain Academy. From her birth in Tobermory on an island off the west coast of Scotland, she had moved to Tain which is on the east coast north of Inverness. In\n1883\nshe moved to Edinburgh where she studied with the Edinburgh Association for the University Education of Women. This Association was providing university level education for over\n300\nwomen at the time when Philip began her studies. The Association organised courses delivered by the lecturers and professors from the University. At a meeting of the Association on Wednesday\n22\nApril\n1885\nat\n15\nShandwick Place, Edinburgh, the Principal of Edinburgh University, Sir William Muir, presented the Edinburgh University Certificate in Arts to Flora Philip. She had taken courses in English Literature, Moral Philosophy, Mathematics, and Physiology. Sir William Muir then gave a speech saying:-\nThe advantages of the Association in leading young ladies to apply themselves to literature and science cannot be overrated. The time that might otherwise be spent in the frivolities of society has been here devoted to the acquisition of sound knowledge and learning. ... We hear a good deal of talk in the University about examinations, and about the passing of examinations being the highest ultimate in all education; and what is applicable to the students in the University is equally applicable to those in this Association.\nThe Countess of Aberdeen, President of the Edinburgh Association for the University Education of Women also gave a speech:-\nSpeaking in this the seventeenth year of our Association, and looking back on its history, I think that all who belong to it may be excused in feeling a pardonable pride when we consider its life and growth, and all that has been accomplished by its means. I know that many a woman throughout the country would bear testimony to the benefits conferred by these classes to which our kind friends the Professors have given so much of their valuable time and thought. ...\n[\nH\n]\nave we not reason to believe that it is in great part owing to the unremitting efforts of our Association, along with other kindred Societies, that we see the new clauses in this year's Universities Bill enabling the Scottish Universities to deal with the graduation of women? Amid many discouragements, this Association has always laid claim to the right of women to be admitted by the Universities to the same classes and the same degree's on the same level as men. And now this seems within our reach.\nFlora Philip's main interests were mathematics and Greek and she was the first woman member of the\nEdinburgh Mathematical Society\n, joining the Society in December\n1886\nthree years after the Society was founded. Throughout her seven years as a member of the Society she was the only woman member. She also belonged to Professor Blackie's Greek Club, which met in rotation in the homes of its members, and in her honour Professor Blackie composed an ode in the Greek language. Philip received further awards from the Edinburgh Association for the University Education of Women on\n18\nApril\n1888\nwhen they presented her with a Diploma for passing seven subjects. She then attended St George's Training College for Women Teachers from whom, in July\n1889\n, she received a Certificate of theoretical and practical efficiency. The written examinations held at the Edinburgh centre had been conducted by Professor Kirkpatrick and the examination in class teaching by Professor Lawrie. Philip was then appointed assistant mistress in St George's High School for Girls in Edinburgh, the founding of which was one of the Association's many enterprises and which was opened in\n1888\nat No.\n3\nMelville Street.\nThe Scottish Universities Act of\n1889\nenabled the Commissioners to admit women to graduation and three years later the Privy Council sanctioned an Ordinance which prescribed the regulations for their instruction and graduation. Eight women received degrees at the Edinburgh University graduation ceremonial on\n13\nApril\n1893\n- the first Edinburgh ceremony at which women were capped. Flora Philip was one of these eight. In\n1893\n, the year of her graduation, Flora Philip married George Stewart, S.S.C. and thereafter her life was that of the mother of a family and the wife of an Edinburgh Solicitor. In the same year she stopped teaching and gave up her membership of the\nEdinburgh Mathematical Society\n.\nAn expression of respect came from the University on the fiftieth anniversary of the graduation of the group of eight women. At the graduation ceremonial in the M'Ewan Hall on the\n2\nJuly\n1943\nthe three surviving members whose homes were in Edinburgh: Mrs George Stewart\n(\nMiss Flora Philip\n)\n,\n41\nLearmonth Grove, Edinburgh; Miss Maude Elizabeth Newbigin,\n2\nChamberlain Road, Edinburgh; and Miss Amelia Hutchison Stirling,\n30\nHoward Place, Edinburgh, were present on the platform by invitation of the Vice-Chancellor, Sir Thomas Holland:-\nThere was one milestone in our history, as in the other Scottish Universities, which marked a definite departure from the old road - the narrow road which was followed before\n1893\n, and that was marked at the summer graduation in that year by the presentation of eight successful women students. ... I am sure that you will all join in congratulating these representatives of the first small group of women graduates who continued their educational activities in the Edinburgh area and are with us on the platform that morning.\nPhilip saw graduate on her Jubilee Day not only a large proportion\n(\nin Arts in fact a large majority since it was wartime\n)\nof \"women in the secular faculties but also two in Divinity - almost, but not quite, the first to penetrate into that last academic citadel of men.\"\nShe died at a nursing home in Edinburgh and was buried at Dean Cemetery."
}