{
  "nome_completo": "Franciszek Leja",
  "nome_curto": "Franciszek Leja",
  "ano_nascimento": "1885",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leja/",
  "lugar_nascimento": "Grodzisk Górny, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Kraków, Poland",
  "biografia": "Franciszek Leja\nwas the son of Jan Leja\n(1851\n-\n1919\n)\nand Elżbieta Majkut\n(1857\n-\n1918)\n. Jan Leja, the son of Piotr Leja and Anna Matuszek, was married twice. He married\n16\n-year-old Katarzyna Matuszek, the daughter of Michał Matuszek and Maria Przeszło, on\n30\nJanuary\n1877\n. They had a son Franciszek Leja born on\n10\nOctober\n1879\nbut he died eight days later on\n18\nOctober\n1879\n. Katarzyna died of pneumonia one day before her son on\n17\nOctober\n1879\n. Jan Leja married his second wife\n23\n-year-old Elżbieta Majkut, daughter of Wojciech Majkut and Katarzyna Kulpa, on\n3\nFebruary\n1880\n. Elżbieta was the widow of Ignacy Leja, Jan Leja's brother. On\n29\nJune\n1881\n, a daughter, Marianna Leja, was born but we believe she died while still a child. They had six other children: Józef Leja\n(1883\n-\n1964)\n; Franciszek Leja\n(1885\n-\n1979)\n, the subject of this biography; Katarzyna Leja\n(1887\n-\n1960)\n; Anna Leja; Aniela Leja; and Agata Leja\n(\nborn\n1890)\n.\nJan and Elżbieta Leja were farmers working on their\n4\n-hectare farm. They lived in a house in the village of Grodzisk Górny, next to the house of Piotr Leja, Franciszek's paternal grandfather. Piotr Leja had six sons, the oldest being Jan Leja, Franciszek's father, and the youngest being Wojtek Leja who was only a little older than Franciszek. When Franciszek grew up on the farm, he had three close friends with whom he spent much time, his brother Józef, his uncle Wojtek, and a friend Jaś Skiba. Let us note at this point that Józef Leja married Aniela Pawlik\n(1891\n-\n1962)\n. They had six children, one being Stanisław Leja\n(1912\n-\n2000)\nwho studied mathematics at the Jan Kazimierz University of Lwów, emigrated to the United States in\n1951\nand worked as an assistant at Cornell University where he was awarded a Ph.D. in\n1958\nfor his thesis\nInversion of a Function with the Kernel\n1\n(\n1\n+\n∣\nx\n−\ny\n∣\n)\n2\n(\nc\n2\n+\n∣\nx\n−\ny\n∣\n2\n)\n\\Large \\frac {1} {(1+|x-y|)^2 (c^2+|x-y|^2)}\n(\n1\n+\n∣\nx\n−\ny\n∣\n)\n2\n(\nc\n2\n+\n∣\nx\n−\ny\n∣\n2\n)\n1\n​\n. He was a professor at West Michigan University, Kalamazoo from\n1962\nuntil he retired in\n1982\n.\nLet us return to Franciszek Leja's biography. Even before he began his schooling, he had many duties to help with both family and farm. Once he was old enough, he had to help with herding cattle, both in the morning and in the evening. Franciszek wrote\n[\n2\n]\n:-\nOther duties of mine and my brother included making sure that the hens did not damage the crops, collecting dry sticks and pine cones in the forests for fuel, and at the same time rocking and entertaining the younger sisters when our parents were in the fields.\nIn\n1892\n, when he was seven years old, Franciszek began his schooling at Grodzisk. The school, which took pupils for three years, had a principal and two other teachers. In the first year he learnt to write with a stylus on a blackboard, then in later years he was taught to write with pen and paper. In addition to reading, writing and arithmetic, he was taught to look after fruit trees and in the spring he had to help with work in the school garden.\nAll children were supposed to have these three years of education, but any further education was optional and expensive. By the time Franciszek was in the\n3\nrd grade, his brother Józef was also in the\n3\nrd grade since he had missed a year. Jan and Elżbieta decided that they could only afford to send one of their boys to a gymnasium and, since Józef seemed the more academically able, they would send him. Before entering the nearest gymnasium in Jarosław,\n34\nkm away, a\n4\nth year of primary education was necessary. The nearest school to provide that was in Leżajsk,\n8\nkm away. Just before Józef was due to start the\n4\nth grade in Leżajsk, he decided that he did not want to leave home and suggested to his parents that they send Franciszek instead. Franciszek was delighted with the idea, his parents agreed so in the autumn of\n1894\nhe went to live with the Leżajsk butcher while he studied at Leżajsk school.\nAfter a year studying\n4\nth grade at Leżajsk, Franciszek was awarded his school certificate and then went with his mother to Jarosław to sit the entrance examination to the gymnasium there. He passed the examination and, in September\n1896\n, he began his secondary school studies at the Lower Gymnasium in Jarosław. His parents organised accommodation for him in a house owned by a widow who ran a small shop in the town. He spent four years at this school. Food was provided in the small school dormitory but was not sufficient to prevent him and the other pupils feeling hungry most of the time. He did small favours for his landlady and she gave him sweets and rolls from her shop. At the end of the year she said that he owed her a large sum for the sweets and rolls. Franciszek begged one of his uncles for money and somehow managed to pay off his debt.\nBy the time he was in the final grade, Franciszek was doing well at the school, particularly in mathematics but less well in subjects requiring memory such as languages ​​and history. He started to earn some money when the parents of one of his friends asked him to tutor their son. The parish priest from his home town of Grodzisk, Father Czesław Kaczorowski, was proud that the young lad was doing well at the gymnasium and arranged for him to receive a monthly stipend from funds donated by the former priest Father Kaczorowski.\nAfter four years of study at the Lower Gymnasium in Jarosław, in\n1900\nLeja progressed to the Higher Gymnasium to continue his studies in the\n5\nth grade. In the following year he joined a society organised for Polish students to acquaint them with the customs and history of Poland. Of course at this time Poland did not exist as a country since it had been divided into three regions for nearly\n100\nyears with the regions being part of Prussia, Russia and Austria. Leja was in the part which was part of Austria, and the Austrian authorities were strongly opposed to Poles seeking to maintain their identity. When Leja was in the\n7\nth grade, the secret Polish Society held a meeting which the Austrian authorities heard about. Leja attended the meeting and, like others attending, was given sixteen hours of \"detention\".\nIn\n1904\nhe sat the final examinations from the gymnasium and qualified to enter university studies. There were now two obstacles to his continuing his education. One was that his father believed that the only use of a university education was to train to become a priest but Leja knew by that time that it was mathematics he wanted to study and not theology. The second obstacle was finance; there was no way that Leja's parents could afford to financially support him through university. Leja told the Grodzisk parish priest about his problems and the priest convinced Leja's father to allow his son to study mathematics. The priest also arranged for Leja to continue to receive the monthly grant from Father Kaczorowski's funds. Although these funds only covered about a quarter of his expanses, Leja decided that he could study at the University of Lwów and earn the additional money required by tutoring.\nIn September\n1904\nLeja enrolled in the Faculty of Philosophy of the University of Lwów to take courses in mathematics, physics and philosophy. He was disappointed with the mathematics that was being taught at the University. There were only two professors,\nJózef Puzyna\nand Jan Rajewski.\nJózef Puzyna\nhad completed his doctorate in Lwów, and had then gone to Germany where he attended lectures given by\nKronecker\nand\nFuchs\n. He had been appointed professor in the University of Lwów in\n1892\n. Jan Rajewski\n(1857\n-\n1906)\nhad also been awarded a doctorate from Lwów and had been appointed as a professor in\n1900\n. Rajewski, however, had severe health problems and, by the time Leja became a student, he was on long-term health leave. There were no assistants and therefore no way that\nPuzyna\ncould deliver a full mathematics course. Leja's studies of theoretical physics were, however, much better being delivered by\nMarian Smoluchowski\n.\nSmoluchowski\nhad studied in Vienna, then at\nKelvin\n's laboratory in Glasgow, in Paris and in Berlin.\nA list of courses he followed at Lwów is at\nTHIS LINK\n.\nLeja had a difficult time in Lwów since he had to undertake work in order to have sufficient money to pay the fees. He made money through giving tuition in private homes but also worked as a surveyor for the Office of Weights and Measures in Lwów. This work required him to travel to breweries to make measurement of their barrels. Other work he undertook was as an accountant for a Lwów weekly newspaper and he also worked for the Catholic Church in Lwów collecting historical material. The work meant that he had much less time for his university studies that he wanted, yet he still had hardly enough money and so lived being hungry and cold. In\n1909\nhe took the examinations to become a teacher of mathematics and physics in gymnasiums and passed with good grades. Despite his good performance, he was totally dissatisfied with his knowledge of mathematics, feeling that he had only scratched the surface of a vast topic. He made a decision to find a position as a mathematics school teacher and continue his study of mathematics at home.\nAt this time all Austrian boys had to do three years military service but for those with a teaching qualification, this was reduced to one year. In the autumn of\n1909\nhe began his military service in the army. Although he was living in a part of Austria, Leja felt Polish and defending Austria was not something that he wanted to do. After three weeks of drill, which Leja did not enjoy, he declared himself to be ill. Sent to the army hospital, he spent several weeks there, then was released from further service in the Austrian army.\nOffered a teaching post in the gymnasium in Drohobych, he turned it down, asking for a post near either Lwów or Kraków so that he might be able to continue his studies of mathematics. The authorities responded positively to his request and in April\n1910\nhe started teaching as a substitute teacher of mathematics and physics at the\n4\nth Gymnasium in Kraków.\nWitold Wilkosz\nand\nStefan Banach\nhad both been pupils at this school with\nBanach\ngraduating from the school in the year that Leja began teaching there. At this school, Leja studied under Kamil Kraf who was the head mathematics teacher. Kamil Kraft\n(1873\n-\n1945)\nwas a physician being a graduate of medicine and a doctor of medical sciences of the Jagiellonian University. He had also studied at the Philosophical Faculty of the Jagiellonian University and obtained the qualifications to teach physics and mathematics in gymnasiums and real schools. Leja felt that he learnt much from Kraft about teaching mathematics.\nAt the end of June\n1911\n, Leja was transferred from the gymnasium in Kraków, to one in Bochnia. At almost exactly the same time the article \"First Principles of Non-Euclidean Geometry\" by Leja was published in the annual report of the\n4\nth Gymnasium in Kraków.\nKazimierz Żorawski\n, a professor of mathematics at the Jagiellonian University of Kraków read Leja's article and was very impressed by it. He offered Leja a one-year scholarship to study abroad which Leja was very pleased to accept. He left the Bochnia gymnasium in June\n1912\nand, in October of that year, he set out for Paris.\nDuring his travels he met with a painter who asked for a loan he would quickly repay. Leja gave him\n150\nfrancs leaving him only\n10\nfrancs to live on until the loan was repaid. Soon after arriving in Paris, however, he realised that the painter had no intention of repaying the loan. He had to ask for the second instalment of his scholarship be sent to him immediately. He survived on one roll a day for eight days until the money reached him. He attended mathematics lectures at the Sorbonne but stunned by the architecture and museums of Paris, he spent much time sightseeing. He met many leading mathematicians at this time, perhaps the one who was most important for his future career was\nHenri Lebesgue\nwith whom he was friends for many years. In the spring of\n1913\nhe visited London where he attended lectures by\nAlfred North Whitehead\n. He was amazed at how few students were studying mathematics in London compared with Kraków or the Sorbonne. After five days in London, he returned to Paris.\nAlthough Leja was at a stage in his career where he might have been undertaking research for a doctorate while in Paris, he was still very conscious that his mathematical background was weak from his studies in Lwów. He treated his time in Paris as an opportunity to broaden his knowledge of mathematics rather than to think about research. He returned to Kraków at the end of his year abroad, travelling via the north of Italy, and was back in Kraków by the end of June\n1913\n. In September\n1913\nhe took up a teaching position at the\n5\nth Gymnasium in Kraków, and a month later, offered a position as a part-time assistant at the Department of Mathematics at the Jagiellonian University by\nKazimierz Żorawski\n, he took on this in addition to his gymnasium duties.\nIn addition to having two jobs, Leja began undertaking research for his doctorate. Life, however, was totally changed when World War I broke out in August\n1914\n. Leja joined the \"Lwów Legion\" which had the aim of liberating Poland from the occupying countries. In the early stages of World War I the Battle of Galicia was fought between Austrian and Russian forces. Russia attacked and occupied Lwów. Leja was with the Lwów Legion which withdrew before the Russians took over the city. The Austrian authorities then demanded that members of the Lwów Legion took an oath of allegiance to Austria. Most did, fearing the consequences if they did not, but Leja refused. Kraków was under threat from the Russian army and schools and offices were closed, so Leja went to Zakopane at the foot of the Tatra Mountains.\nBy March\n1915\nthe Austrian army had pushed the Russians back and Kraków began to operate again with schools and the university open. Leja returned to the city and again took up his gymnasium teaching, his university assistantship, and his research with\nKazimierz Żorawski\nas his thesis advisor. He submitted his thesis\nWłasność niezmiennicza równań różniczkowych zwyczajnych ze względu na przekształcenia stycznościowe\nⓉ\n(\nInvariance Property of Ordinary Differential Equations with Respect to Tangent Transformations\n)\nand he was awarded his doctorate on\n21\nJune\n1916\n. He continued with his various jobs over the next few years while he worked to become a university lecturer. The end of the war and the reestablishment of Poland in\n1919\nbrought him great satisfaction. He wrote the thesis\nO warunkach, aby zwyczajne równanie różniczkowe rzędu pierwszego posiadało całki osobliwe\nⓉ\n(\nOn Conditions for an Ordinary First-Order Differential Equation to Have Singular Integrals\n)\nfor his\nhabilitation\nat the Jagiellonian University in\n1922\n.\nThis was a very positive time as old institutions reopened and new universities were created under the new Polish government. Leja had been involved in an informal mathematical society in Kraków which began in\n1917\nand, in April\n1919\n, he was one of the sixteen mathematicians who officially founded the Society. In addition to Leja, Kraków mathematicians\nStefan Banach\n,\nOtto Nikodym\n,\nStanisław Zaremba\nand\nKazimierz Żorawski\nwere among the sixteen founders. It soon became the\nPolish Mathematical Society\n.\nLeja had shown himself to be a leading mathematician at just the right time and in\n1923\nhe received as offer to become head of mathematics at the new Poznań University. While he was considering that offer be received another from Warsaw University of Technology to become the head of mathematics there. He accepted the offer from Warsaw and in September\n1923\nbecame an associate professor and head of the Department of Mathematics at the Faculty of Chemistry.\nLeja married Janina Mizerska in Kraków on\n10\nOctober\n1924\n. She had worked at an Insurance Company in Kraków. Also in\n1924\nthe University of Warsaw accepted Leja's habilitation and in addition to his chair at the Warsaw Technical University, he lectured at the University of Warsaw. Leja was happy in Warsaw and planned to remain there for the rest of his career. Franciszek and Janina Leja had a son who died as an infant. Józef Leja, Franciszek's brother, had married Aniela Pawlik in\n1908\nand they had six children and were struggling financially to cope. Franciszek and Janina adopted one of Józef's children, Jan Leja\n(1918\n-\n2009)\nin\n1927\n.\nLife in Warsaw was not easy for Leja with difficulties with accommodation and food shortages. Matters improved steadily, however, as Poland recovered from wartime conditions. There were tensions in the Warsaw Technical University with staff forming two groups, one consisting of those educated in Russia, the other group being those who had studied in France, Germany, and Galicia. In\n1934\nLeja was elected dean of the Faculty. A problem arose when two professors wrote a letter claiming to come from the Dean but without Leja's knowledge. The professors were members of the Russian group, as were the majority of the senate and the senate decided to hush up the affair and not support Leja. He continued as dean but now began to consider a move to another university. In\n1936\nStanisław Zaremba\nretired as head of mathematics at the Jagiellonian University in Kraków and Leja was offered the post. He was pleased to accept.\nAs war approached Leja was visited by several leading mathematicians.\nHenri Lebesgue\n, who had been a friend since Leja visited Paris in\n1912\n, came to Kraków where he lectured and invited Leja to lecture in Paris.\nMauro Picone\nmade visits to Kraków and gave mathematical lectures but he also had a political Fascist motive and gave political lectures. We know\nPicone\n's ideas from letters he wrote to\nTadeusz Banachiewicz\nin Kraków. For example, in a January\n1939\nletter he wrote:-\nYou certainly know the anti-Jewish measures taken by our government for universities and academies and it is therefore urgent that scientists of Aryan race collaborate as actively as possible to show how science can equally advance even without Jewish intervention, and this will be all the more effective if such collaboration be international.\nLeja went to Paris with his wife in the first half of\n1939\nand lectured to the\nFrench Mathematical Society\n. By the end of June\n1939\nhe was back in Poland. The German invasion of Poland on\n1\nSeptember\n1939\nbegan World War II. By the first week of September\n1939\nthe German army occupied Kraków. A German commander, SS-Sturmbannführer Bruno Müller, ordered Tadeusz Lehr-Spławiński, the rector of the Jagiellonian University, to convene a meeting of all the University's professors in the Collegium Novum on\n6\nNovember\n1939\n. Müller addressed the meeting saying that the Jagiellonian University had always been a \"source of anti-German attitudes.\" Soldiers entered and arrested\n183\nprofessors and others at the meeting. Leja was one of those at the meeting and following his arrest he was taken to Sachsenhausen concentration camp north of Berlin in December\n1939\n. In May\n1940\nhe was released and returned to Kraków. The University was closed, he had no income to buy food, but he was allowed by the German authorities to go to Grodzisk Górny. There the family were able to grow vegetables and conditions were a little better. While in Grodzisk, realising that when the university reopened after the war, students would not have textbooks, Leja wrote a small textbook entitled\nDifferential and Integral Calculus\nfor first-year mathematics students which was published in\n1947\n. It was a very popular book and ran to many editions.\nAfter the war ended, the Jagiellonian University reopened in Kraków and Leja spent the rest of his career there. He was advisor to nine Ph.D. students between\n1947\nand\n1963\n, seven obtained their degrees from the Jagiellonian University and two from the\nPolish Academy of Sciences\n. Marta Kosek gives this description of Leja in\n[\n9\n]\n:-\nLeja's students after the Second World War had a nickname for him: they called him 'Grandpa'. He was always very elegant and seemed to be working all the time. The exams he gave were really difficult but he always cared for his students and was proud of their achievements.\nLeja made several important contributions to mathematics in\n100\nresearch papers which are listed in\n[\n8\n]\n. Perhaps his most significant contribution was his introduction of the concept of a topological group one year before the same concept appeared in the work of\nOtto Schreier\n. Kleiner's description of Leja's papers in\n[\n8\n]\nbegins as follows:-\nLeja's first attempts in research were made in the field of differential equation analysis by means of continuous groups. He found groups more interesting than the equations themselves - and he was the first to introduce the definition of an abstract topological group. This was done on\n1925\n(\nin a short communication in Ann. de la Soc. Polon. de Math.\n3\n(1925)\n,\n153)\n. Leja seemed to be aware of the value of his conception: he had his paper published in the most significant Polish journal\n[\n'Sur la notion du groupe abstrait topologique'\nⓉ\n(\nOn the notion of topological abstract group\n)\n, Fundamenta Mathematicae\n9\n(1927)\n,\n37\n-\n44]\n. But he had just become deeply interested in analytic functions, and so he did not continue his research in topological groups. He investigated the value distribution of analytic functions of several complex variables\n[\n'Sur la distribution des valeurs des fonctions analytique dans leurs domaines d'existence'\nⓉ\n(\nOn the distribution of values of analytic functions in their existence domains\n)\n(1922)]\n, their singular surfaces\n[\n'Sur les surfaces singulières des fonctions analytique de deux variables complexes'\nⓉ\n(\nOn singular surfaces of analytic functions of two complex variables\n)\n(1922)]\nand, above all, multiple power series. In\n[\n'Sur les séries semi-convergentes'\nⓉ\n(\nOn semi-convergent series\n)\n(1926)]\nand\n[\n'Sur la frontière du domaine de convergence des séries entières doubles'\nⓉ\n(\nOn the boundary of the domain of convergence of double integer series\n)\n(1928)]\nhe obtained fundamental results concerning the shape of the convergence regions of such series by a method of \"hyperbolic curves\". The regions in question turn out to be \"hyperbolically convex\". ...\nWhen in his\n90\ns, Leja was asked, \"What is the secret of your long life.\" He replied that it was probably because he had spent so many years feeling hungry every day. He may well have been right! Although Leja died in Kraków, he was buried in Grodzisk Górny as he requested.\nAn autobiography that Leja wrote when he was more than\n90\nis at\nTHIS LINK\n."
}