{
  "nome_completo": "Franz Daniel Kahn",
  "nome_curto": "Franz Kahn",
  "ano_nascimento": "1926",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kahn/",
  "lugar_nascimento": "Nuremberg, Bayern, Germany",
  "lugar_morte": "Bourne End, Buckinghamshire, England",
  "biografia": "Franz Daniel Kahn\nwas the son of Siegfried Kahn\n(1894\n-\n1967)\nand Gretchen Mann\n(1896\n-\n1980)\n. Siegfried, who had served in the infantry in World War I, married Gretchen Mann on\n20\nJanuary\n1920\nin Nuremberg; they had two children, Charlotte Kahn\n(1921\n-\n1994)\nand Franz Daniel Kahn, the subject of this biography. Siegfried Kahn joined Stephen Bing in setting up a toy company in\n1928\nin Nuremberg and he became the general manager and designer of a new range of toys. In\n1930\nthey launched a range of construction toys under the name Trix and in\n1932\nTrix Ltd was formed in England to make Trix toys available in Britain. They launched an\n00\nscale model railway system called Trix Express in\n1935\nand by\n1936\na British version was being produced. Siegfried Kahn was Jewish and after Hitler had come to power in\n1933\nhis position, and that of the other Jewish members of the company in Nuremberg, looked increasingly uncertain given the anti-Semitic legislation.\nFranz Kahn began his schooling in a Jewish school in Nuremberg in\n1934\n, moving to attend another Jewish school in the neighbouring town of Fürth. In\n1938\nthe Nuremberg company was sold and Franz Kahn, his father, his mother, and elder sister Charlotte came to England. They set up home in London where Trix Ltd already had a branch. Franz began his studies at a preparatory school in Hampstead but, because of the war, was evacuated to Rickmansworth. The\n1939\nRegister gives Siegfried Kahn and his wife living at\n2\nHighfield Court, Hendon, London with their daughter Charlotte, an assistant consulting optician, and two widowed women, Henny Kahn\n(\nborn\n1869\nin Nuremberg\n)\nand Fanny Sara Linz\n(\nborn\n1871\nin Hildesheim\n)\n. The\n1939\nRegister also gives Franz D Kahn at school at\n75\nHigh Street, Rickmansworth, Hertfordshire. The outbreak of World War II meant that all German citizens living in Britain were assessed for internment. On\n21\nDecember\n1939\nSiegfried Kahn was considered. His record gives: Birth,\n6\nJune\n1894\nin Nuremberg; Address,\n2\nHighfield Court, N.W.\n11\n, London; Occupation, Toy maker\n(\nCompany director\n)\n; Employer, Trix Ltd,\n45\nClerkenwell Road, E.C.\n1\n. London; Decision, Exempt from internment until further order.\nAfter a short time at Rickmansworth, Kahn enrolled in the famous independent school of St Paul's which had been founded in\n1509\n. The school had been based in Hammersmith but in September\n1939\nit was evacuated to Easthampstead Park, near Crowthorne in Berkshire. It was boarding only after the evacuation which was organised by Walter Fraser Oakeshott, the headmaster, who was a classics scholar. Kahn became a boarder at the school in\n1940\nand, while at St Paul's, he won the form prize for English, a remarkable achievement for a boy who was a native German speaker and had only been in England for two years at the time. In\n1944\nhe won an Open Scholarship to study mathematics at Queen's College, Oxford.\nIn\n1947\nKahn graduated with First Class Honours in mathematics from the University of Oxford and remained at Queen's College undertaking research for his D.Phil. advised by\nSydney Chapman\n. It was only one year before, in\n1946\n, that\nSydney Chapman\nhad accepted the offer of the Sedleian Chair of Natural Philosophy at the University of Oxford, also becoming a fellow of Queen's College at this time. Kahn was also influenced while undertaking research by Harry Hemley Plaskett\n(1893\n-\n1980)\n. Plaskett was Savilian Professor of Astronomy at the University of Oxford from\n1932\nto\n1960\n. He made major contributions to solar physics, astronomical spectroscopy and spectrophotometry. Kahn moved to Balliol College in\n1948\nwhen he became a Skynner senior student. This was a prestigious role filled by exceptional people from the first Skynner senior student at Balliol, Reginald Victor Jones\n(1911\n-\n1997)\nwho held the Skynner award\n1934\n-\n36\n.\nKahn submitted his first paper,\nAn Investigation into the Possibility of observing Streams of Corpuscles emitted by Solar Flares\nto the\nRoyal Astronomical Society\non\n10\nDecember\n1948\n. The Abstract reads:-\nThis paper discusses\nChapman\n's suggestion that a stream of corpuscles, emitted from the Sun by a flare, should be spectroscopically detectable before and during the magnetic storm which it is thought to cause. After an investigation of the mode of expansion and the state of ionization of such a stream, it is estimated that the particles in it may cause abnormal absorption near the H and K lines of calcium which is detectable soon after the end of the flare. Should this absorption not be observable, however, the failure will not necessarily disprove the corpuscular theory of magnetic storms, as the depth of absorption may lie below the observational limit.\nIt has the following Acknowledgements:-\nI wish to thank Professor\nS Chapman\nfor suggesting this problem to me and for much helpful advice, and also Professor H H Plaskett and Dr M A Ellison, with both of whom I have had most instructive discussions bearing on this paper.\nThis first paper was published in\n1949\nand, in the following year, a second part was published. Kahn gives the following Acknowledgements:-\nThanks are due to Professor\nS Chapman\nand to Professor H H Plaskett for their encouragement and advice while this paper was being prepared. Some of the work was carried out during the tenure of a D.S.I.R. grant and of the Skynner Senior Studentship in Astronomy at Balliol College. The paper forms part of a thesis for which the degree of Doctor of Philosophy was awarded by the University of Oxford.\nAlso in\n1950\nhe published\nOn the Expulsion of Corpuscular Streams by Solar Flares\n. This paper has the abstract:-\nA value is found for the minimum momentum density in a corpuscular stream which has been emitted from a flare and which causes a terrestrial magnetic storm. It is shown that radiation pressure alone will always be insufficient to expel such a stream from the Sun.\nKahn was awarded a D.Phil. from the University of Oxford in\n1950\nfor his thesis\nSome problems concerning the luminosity and other properties of the upper atmosphere\n.\nIn\n1949\nKahn was appointed as an Assistant lecturer in Mathematics at the University of Manchester. There he met the mathematics teacher Carla Vivienne Copeland\n(1928\n-\n1981)\nwho had studied mathematics at Bedford College, London and, five days after they first met, they became engaged. Carla, born\n25\nDecember\n1928\nin Salford, Lancashire, was the daughter of Benjamin Copeland and Lily Goldstone. Franz Kahn married Carla Copeland in the Higher Broughton Synagogue, Salford, Lancashire, on\n22\nMarch\n1951\n; they had two sons and two daughters. One of his sons, Jeremy I Kahn\n(\nborn\n22\nOctober\n1954)\n, is the author of\n[\n9\n]\nand\n[\n10\n]\n. The daughters are Judith N Kahn, born\n26\nFebruary\n1953\nand Deborah Kahn, born on\n10\nDecember\n1959\n.\nManchester was certainly an excellent place for Kahn to get a job. Bernard Lovell\n(1913\n-\n2012)\nhad been appointed to the University of Manchester as an assistant lecturer in physics in\n1936\nand, after undertaking war work during World War II, returned to Manchester as a lecturer in physics in\n1945\n. He set up equipment at Jodrell Bank and began working towards having a radio telescope. His reputation quickly grew and he was appointed a reader in\n1949\nand professor of radio astronomy in\n1951\n. To support this innovative astronomy development, the University of Manchester established a Department of Astronomy in\n1951\nand, following Lovell's advice, appointed Zdenek Kopal\n(1914\n-\n1993)\nas the Professor of Astronomy. Kahn joined the Department of Astronomy the year after it was established\n[\n5\n]\n:-\nAlready, Kahn had moved from the solar-system boundaries of his thesis work and had published papers on emission from radio stars\n[\n'Some possible mechanisms of radio stars'\n]\nand on the origin of interstellar dust\n[\n'On the formation of interstellar dust'\n]\n. It was a natural move for him to transfer to the infant Astronomy Department in\n1952\n, initially as a Turner and Newall Fellow\nKahn wrote Zdenek Kopal's obituary\n[\n8\n]\nwhere he described his professor's background:-\nIn many ways Kopal's life exemplified this century's upheavals, both in politics and in astronomy. He was born in the Austrian Empire, before the foundation of Czechoslovakia, and he was educated at Prague University, before modern astrophysics had taken hold. One of his teachers at Prague was the celebrated astronomer\nE Finlay Freundlich\n, who made it his life's work to verify the predictions of\nEinstein\n's General Relativity, notably the deflection of starlight by the sun. Kopal had the same attitude to scientific questions: take nothing for granted if you cannot verify it. This philosophy stood him in good stead.\nThe International Union of Theoretical and Applied Mechanics and the International Astronomical Union Symposium No\n2\nwas\nGas Dynamics of Cosmic Clouds\nheld at Cambridge, England,\n6\n-\n11\nJuly,\n1953\n.  Kahn presented two papers to the Proceedings of the Symposium, T\nhe heating and cooling of interstellar gas clouds\n, and\nThe collision of two highly ionised clouds\n[\n5\n]\n:-\nThis meeting profoundly influenced his later work and in particular led to several major investigations into the dynamical effects in interstellar gas produced by the radiation fields of hot stars.\nAn important visit was to Leiden where he spent the academic year\n1953\n-\n54\n. Leiden was a leading institution with Jan Oort's astronomy group. While there Kahn wrote the paper\nThe acceleration of interstellar clouds\n(1954)\nwhich became a classic\n[\n4\n]\n:-\nIn\n1954\n, Kahn produced one of contemporary astrophysics' classic papers, laying down the basic theory for the way in which stellar radiation sweeps across interstellar gas, heating it and setting it in motion. This paper is central to an understanding of star formation, the late stages of evolution of intermediate mass stars and phenomena in the nuclei of active galaxies. Recent\nHubble\nphotographs of regions of massive star formation, like the now famous Pillars of Creation in the Eagle Nebula, rely on the basic Kahn theory for their interpretation.\nHere is one of several anecdotes relating to his time in Leiden\n[\n5\n]\n:-\nThere is an amusing anecdote regarding his stay there that he used to relate. Oort gave a seminar after which Kahn made some critical comments\n(\nthis was probably in relation to Oort's championship of the so-called 'rocket-effect' acceleration of interstellar clouds, an effect that Kahn had shown not to work in the manner advocated by Oort\n)\n. Presumably in view of Oort's great standing, heads shook disapprovingly during Kahn's remarks, and the listener next to him explained, 'your criticism is like challenging the Almighty'. On leaving the seminar room, a small group, which included Kahn, went from the building and encountered a sudden weather change. There was a flash of lightning followed by a loud thunderclap. 'Well, I told you', said the Dutchman who had been sitting next to him.\nIn\n1956\nthe German Society of Scientists and Physician offered a prize for the best essay on star formation. Kahn submitted his essay entitled\nThe Formation of Stars through the Condensation of Diffuse Matter\nand was awarded the prestigious prize in\n1958\n. The essay demonstrated\n[\n11\n]\n:-\n... his skill as a synthesiser of ideas matched his physical understanding and his analytical expertise.\nPromotion saw Kahn made a Senior Lecturer in\n1958\n, a Reader in\n1962\n, and Professor of Astronomy in\n1966\n.\nKahn's son Jeremy gives some interesting details of his father's character in\n[\n9\n]\n:-\nMy father, Franz Daniel Kahn\n(\nFDK\n)\nwas an astronomer. Or to be more precise, an astrophysicist. The equipment he needed for work consisted of a pad of paper, a slide rule, and a Bic\n(\nalways\n)\n. When he was younger he worked all the time. He worked on Sundays, and when we were on holiday he'd spend his time working. Work consisted of writing long series of equations and some text around them. Proper theoretical science. The children were not to make noise in the house, which would disturb him. In some ways he was the happiest person you could meet. He was utterly passionate and enthusiastic about astronomy ... FDK's life was punctuated by meals and snacks. He had\n6\nmeals a day. Breakfast, morning coffee, lunch, afternoon tea, supper, and at night coffee\n(\n!\n)\nwith cake. Always. Every day. When my mother, Carla Kahn, was alive, they'd both come home from work at lunchtime. FDK would pop into a delicatessen and buy something special for lunch. I was there a few times\n(\nsomehow being home from school at lunchtime\n)\n. There was a peace there that was absent the rest of the time in a family with\n4\nchildren.\nA consequence of Kahn and his wife Carla visiting Leiden, which they did on several occasions, was that they came across letters that\nAlbert Einstein\nhad written to\nWillem de Sitter\n. Most of these letters had been written during World War I. The discovery came about in\n1974\nwhen archives were moved out of the Leiden Observatory. Franz and Carla Kahn arrived in Leiden for a sabbatical visit and Carla, looking for a task to undertake while her husband was working, offered to index the archives\n[\n5\n]\n:-\n... Very little had been done for the previous\n25\nyears so all the storage boxes had to be searched. Only in the thirtieth box did anything connected to\nEinstein\nappear, but indeed seventeen communications from\nEinstein\nvarying from postcards to long letters were discovered. ... The letters are remarkable in that they cover the period when\nEinstein\ninvented his cosmical repulsion to allow a static universe, and\nde Sitter\ncountered by finding the\nde Sitter\nspace solution.\nAs a result of this discovery, Carla and Franz Kahn published the article\nLetters from Einstein to de Sitter on the Nature of the Universe\nin\nNature\nin\n1975\n.\nTragedy struck the family when Carla Kahn died on\n24\nJanuary\n1981\n. Later that year Zdenek Kopal retired and Kahn edited the book\nInvestigating the Universe\nconsisting of papers presented to Kopal on the occasion of his retirement in September\n1981\n. Kahn writes in in that volume\n[\n7\n]\n:-\nIn presenting this volume to you, Zdenek, we ask you to regard it as a token of the great success achieved by the Department that you founded in the autumn of\n1951\n. May you have a long, happy and active retirement.\nUnder ordinary circumstances I should have broken off here and got on with the astronomy. But circumstances are far from ordinary. In the spring of\n1951\nI married Carla, having got to know her a few months earlier. There followed a union uniquely blessed by love and happiness. We had many children, and even a grandchild, and through our different activities, notably the astronomical ones, we acquired a worldwide circle of very good friends. All seemed set to go on in this way when one morning in January this year Carla suffered a severe stroke, and then died on the evening of the next day.\nIt is a commonplace that life can be cruel. But fortunately fate only very rarely administers so devastating a blow. This paper deals with the first scientific work that I have attempted since Carla's death. I dedicate it to her memory, may she rest in peace.\nKahn became Head of the Department of Astronomy at Manchester in\n1981\nfollowing Kopal's retirement. In\n1993\nhe was elected a fellow of the\nRoyal Society\n. The citation for his election reads:-\nFranz Kahn has made many original contributions to plasma astrophysics, cosmical gas dynamics and the physics of star formation, with significant early papers on the structure of ionisation fronts and collision-free shocks. More recently he has done important work on stellar winds and galactic fountains, on planetary nebulae and on remnants of novae and supernovae. His versatility is shown by papers on the spiral structure of the Galaxy, on the nature of the Local Group and the account\n(\nwith the late Carla Kahn\n)\nof the\nEinstein\n-\nde Sitter\ncorrespondence. Kahn's style is especially noteworthy for his skill in building simple mathematical models which bring out the essence of the physics.\nKahn served on the council of the\nRoyal Astronomical Society\n(1967\n-\n70)\nand served an editor of the\nMonthly Notices\nof the\nRoyal Astronomical Society\n(1993\n-\n98)\n. He was president of the 'Commission on Interstellar Matter' set up by the International Astronomical Union\n(1970\n-\n73)\n. He has been honoured by the International Astronomical Union by them naming the asteroid Kahnia for him.\nFollowing the death of Carla Kahn, Kahn never remarried but he did develop a close friendship with Junis Davis who was an administrator at the Manchester Metropolitan University. Leon Mestel writes\n[\n11\n]\n:-\nFranz Kahn was an engaging companion, both professionally and socially, wearing his erudition lightly. Like all academics, he appreciated recognition, but never let delay in its appearance worry him unduly. He was a happy man, enjoying each stage of his life as it came.\nHe died of a heart attack at a petrol station when visiting his son Jeremy at Bourne End, Buckinghamshire. He was buried in the Jewish Section of the Southern Cemetery, Barlow Moor Road, Chorlton-Cum-Hardy, Manchester.\nIn\n1999\nthe conference 'Astrophysical Dynamics' was held in Évora, Portugal, in Kahn's honour. The Preface by David Berry to the conference Proceedings begins\n[\n1\n]\n:-\nOn a hot, balmy evening in July,\n1998\n, John Dyson, Dieter Breitchwerdt, António da Costa and myself were sitting in the Praça do Giraldo, the main square of the city of Évora, Portugal, discussing the work of Franz Kahn, late Emeritus Professor of Astronomy, Manchester University, and Fellow of the\nRoyal Society\n, who had suddenly passed away some months before. We had all commented on how he had influenced the areas in which we had researched and how he had been instrumental in determining our fundamental approach to that research. After reminiscing for some time, we decided that we should celebrate Franz's work in some special way. The conference, Astrophysical Dynamics, was the result, the major emphasis being on theoretical developments in astrophysical dynamics set out principally by Franz's research career. I had been very fortunate to collaborate with Franz on a number of different projects since his retirement. As such, he had visited Évora on numerous occasions, and became a very welcome visitor to the Department of Physics of the university. It seemed fitting therefore to organise the conference here in Évora. The conference was held in the magnificent and historic Colégio Espirito Santo, the main building of the University of Évora over the three days\n14\nth to\n16\nth April,\n1999\n. It was very well attended with about\n40\nscientists and students from\n11\ndifferent countries from around the world."
}