{
  "nome_completo": "Frances Chick Wood",
  "nome_curto": "Frances Chick Wood",
  "ano_nascimento": "1883",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wood/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "Frances Chick\n's married name was\nFrances Wood\nand she is now known by this name. For simplicity we will refer to her as Frances throughout this biography. Frances was the daughter of Samuel Charles Chick\n(\nborn in Weymouth, Dorset in\n1841\n, died\n1925)\nand Emma Hooley\n(\nborn in Macclesfield, Cheshire in\n1844)\n. In the\n1862\nCensus, Samuel Chick was an apprentice in Cheltenham, while in the\n1871\nCensus he is described as a lace manufacturer in Marylebone. Emma Hooley was the daughter of the grocer and grain merchant James Hooley and his wife Mary. Samuel and Emma Chick had twelve children, ten of whom survived beyond childhood. Seven of the ten children were girls. We have managed to find the names of\n10\nof the twelve children:  Samuel\n(\nborn about\n1868)\n, Edith\n(\nborn\n1870)\n, Edward\n(\nborn\n1871)\n, Mary\n(\nborn\n1873)\n, Harriett\n(\nborn\n1875)\n, Margaret\n(\nborn\n1876)\n, James Hooley Chick\n(\nborn about\n1880)\n, Elsie\n(\nborn\n1882)\n, Frances\n(\nborn\n1883\n, the subject of this biography\n)\n, and Dorothy\n(\nborn about\n1889)\n.\nIn\n[\n1\n]\n, Mary Creese writes about the children's upbringing:-\nThe Chick children were brought up strictly, with no frivolities allowed and regular attendance at family prayers and chapel required. All seven daughters attended Notting Hill High School, a girls' school outstanding for its teaching in the sciences. Subsequently six of these girls went on to take university degrees - for the time most likely a record achievement for a single family.\nWe give below the complete obituary\n[\n2\n]\nof Frances Wood by Major Greenwood\n(1880\n-\n1949)\n. Greenwood had studied with\nKarl Pearson\nand was appointed as a statistician at the Lister Institute in\n1910\n. As well as working with Frances Wood, he also worked with\nUdny Yule\n[\n2\n]\n:-\nFrances, daughter of Samuel Chick, J.P., and Emma Chick, was born in London on December\n25\n,\n1883\n, and received her early education at the Notting Hill High School. She entered University College, London, in\n1904\n, and graduated B.Sc. with honours in chemistry in\n1908\n. The three years following her graduation were devoted to research work in chemistry first under Sir William Ramsay and afterwards under Professor Harden at the Lister Institute. Miss Chick's first publications\n(\nTrans. Chemical Soc.\n,\n1908\nand\n1910)\ndealt with the polymerisation of Keten, a research made in collaboration with Mr Wilsmore, and in\n1912\nshe published in the\nBiochemische Zeitschrift\n, an independent paper on the alleged formation of dioxyacetone in the fermentation of grape sugar, which was her last chemical inquiry. While working in the biochemical department of the Lister Institute, Miss Chick attended a course of lectures on statistical methods and, before her paper on fermentation had appeared, she decided that her future work should be in the field of statistics.\nBefore her marriage, in July,\n1911\n, to Mr Sydney Wood, B.Sc., of the Board of Education, she had begun work in the statistical department, and from October,\n1912\n, when she became Grocers' Research Scholar, she was a regular member of its staff. Her energies were divided between collaboration with me on three papers\n(\nJournal of the Royal Statistical Society\n, lxxvii, p.\n317\n,\nJournal of Hygiene\n, xiv, p.\n83\n,\nProceedings of the Royal Society of Medicine\n, vii, p.\n119\n, sect. of Epidemiology\n)\n, one on a problem of theoretical statistics, the two others on cancer statistics, and an independent study of the wages problem which produced the paper read before the\nRoyal Statistical Society\nin November,\n1913\n, on the Course of Real Wages in London\n(\nJournal\n, lxxvii, p.\n1)\n. The experience gained in these inquiries encouraged Frances Wood to plan an investigation into the important and difficult problem of the correlation between home conditions and the mental development of children in elementary schools. We discussed the proposed research in detail and she matured her plans with the intellectual neatness and thoroughness which characterized her.\nThroughout the winter of\n1913\n-\n14\nand the following spring she was steadily collecting data in the schools and extending her knowledge of statistical methods in the laboratory, where she collaborated in the analysis of some perplexing data collected by the Birth-Rate Commission. By August,\n1914\n, the raw material of the school research was ready for a preliminary assay and she had settled down to the task. After the outbreak of War there seemed a faint chance that it might be possible to carry on some of our research work, but this came to nothing and in December she was called to assist Mr W T Layton at the Board of Trade. From that time until the Armistice, Mrs Wood was continuously engaged in the public service, first at the Board of Trade and afterwards in the Ministry of Munitions, where her statistical abilities soon won recognition. She successfully carried out several difficult inquiries and was gazetted M.B.E. in the first list of June,\n1917\n, being promoted O.B.E. in the following year. In statistical circles Frances Wood made her mark early; although she joined the\nRoyal Statistical Society\nso recently as\n1913\n, she was elected to the Council in\n1915\nand became a member of the Executive Committee in\n1917\n.\nAfter the Armistice Frances Wood did some statistical work for the National Federation of Iron and Steel Manufacturers, but she never forgot her unfinished research. For various reasons resumption of research in the statistical department of the Lister Institute had to be postponed, but all was arranged for the analysis to recommence this winter. 'Dis aliter visum'. October\n12\n,\n1919\n, added another name to the roll of investigators not permitted to enter the promised land and to reap the fruit of their exertions.\nIt is hard to judge equitably those whom one has in affectionate remembrance. A host of trifles, although revealing the elements of human personality, are not pertinent to a judgment of technical achievements, and cloud the narrower issues. It is still harder to judge a pupil and collaborator, for the bias of personal vanity is invincible. Yet I venture the opinion that in Frances Wood we have lost one of the most promising investigators of our time. I will not indulge in a rhetoric she detested and proclaim her to be of the fellowship of Laplace, of Galton or of Farr. The consummate mastery of generalized symbolism which characterizes the great mathematical statistician, or the uncanny sagacity of a Farr or a\nGalton\nwhich interprets as if by intuition the message of inarticulate numbers and classifications, are powers we are not entitled to claim for an investigator whose career ended so soon.\nBut if faith in the statistical method as an intellectual instrument, skill in its manipulation, confidence never degenerating into rashness, patience never hardening into stolidity are the characteristics of a great investigator, Frances Wood was sealed of the tribe.\nI have been brought into close association with many of the ablest of the statisticians of Mrs Wood's generation; several of these had a wider knowledge of mathematical methods, a few were as skilful in the collection and utilisation of data, none had as much sagacity in the adjustment of means to ends and in realising not merely what is abstractly possible but what, in the given conditions of the worker, is concretely possible. The knowledge of one's own limitations in research is usually a late acquirement and in acquiring it there is a loss of keenness to investigate at all ; if we cannot do what we would, we do nothing. To gain self knowledge in early life, in the full tide of intellectual curiosity, is a priceless boon; it was Frances Wood's good fortune. She might, like other investigators, have failed to reach the goal at which she aimed, but she would never have wasted herself on quests she was intellectually unfit to pursue.\nThis is not the place to speak of Mrs Wood's other activities, of her interest in social movements, especially those concerned with the higher education of women; in these columns we are concerned with her as a statistician and, merely as a statistician, she will hold an honourable place in the annals of our\nSociety\n. But it is fitting to add that those who knew her do not need the record of her successes to remind them of how much has been lost. It was not the passing of a great dialectician which made Phaedo wrap his face in his cloak when the cup was drained; \"for it was not for him that I wept, but for my own misfortune in being deprived of such a friend.\"\nLet us record a few further details not given by Greenwood.\nFrances married Sydney Herbert Wood at Honiton, Devon, in July\n1911\n. Sydney Wood\n(1883\n-\n1958)\nwas born in Hertfordshire. Frances wrote a number of papers, some of which are mentioned in Greenwood's article above but we give details of these and others here: The Course of Real Wages in London,\n1900\n-\n12\n,\nJournal of the Royal Statistical Society\n77\n(1)\n(1913)\n,\n1\n-\n68\n; The Construction of Index Numbers to Show Changes in the Price of the Principal Articles of Food for the Working Classes,\nThe Economic Journal\n23\n(92)\n(1913)\n,\n619\n-\n626\n;\n(\nwith M Greenwood\n)\nThe Relation between the Cancer and Diabetes Death-Rates,\nThe Journal of Hygiene\n14\n(1)\n(1914)\n,\n83\n-\n118\n;\n(\nwith J W Brown and M Greenwood\n)\nA Study of Index Correlations,\nJournal of the Royal Statistical Society\n77\n(3)\n(1914)\n,\n317\n-\n346\n;\n(\nwith M Greenwood\n)\nOn Changes in the Recorded Mortality from Cancer and their Possible Interpretation,\nProceedings of the Royal Society of Medicine\n7\n(1914)\n,\n119\n-\n170\n; The Increase in the Cost of Food for Different Classes of Society since the Outbreak of War,\nJournal of the Royal Statistical Society\n79\n(4)\n(1916)\n,\n501\n-\n508\n.\nFollowing the death of Frances Wood in\n1919\n, the\nRoyal Statistical Society\noffered the Frances Wood Memorial Prize. It was first awarded in\n1921\n:-\nThe Council of the\nRoyal Statistical Society\noffer the Frances Wood Memorial Prize, value £\n30\n, for competition in\n1921\n. The Prize is offered for the best investigation, on statistical lines, of any problem affecting the economic or social conditions of the people. Competitors will choose their own subjects, but it is believed that original observation or analysis made in the course of the writer's ordinary work or special research will afford useful material for papers, and some suggestions are contained in a leaflet obtainable from the Society. Theses submitted or intended to be submitted as university exercises, and also published papers, are admissible. Essays\n(\nwhich must be either printed or typed, and accompanied by copies of all statistical tabulations\n)\nmust be sent to the Honorary Secretaries of the\nRoyal Statistical Society\n,\n4\n, Portugal Street, W.C.\n2\n...\nIn\n2011\n, the Memorial Prize fund was used to found the Frances Wood Medal."
}