{
  "nome_completo": "Francis Kofi Ampenyin Allotey",
  "nome_curto": "Francis Allotey",
  "ano_nascimento": "1932",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Allotey/",
  "lugar_nascimento": "Saltpond, Gold Coast (now Ghana)",
  "lugar_morte": "Accra, Ghana",
  "biografia": "Francis Allotey\nwas the son of Joseph Kofi Allotey\n(\nborn\n1894\nin Accra, Ghana\n)\nand Alice Esi Nyena. Joseph Kofi Allotey owned a shop which sold books, musical instruments and fishing equipment. Alice Allotey was a dressmaker. Joseph and Alice Allotey had seven children, three boys and four girls. From the oldest to the youngest they are: Martha Allotey; Francis Allotey, the subject of this biography; Elizabeth Allotey; Augustine K F Allotey, born\n5\nSeptember\n1937\n, who became a student in London living at the same address as Francis in the late\n1950\ns and early\n1960\ns and became a pharmacist; Agatha Allotey; Theresa Allotey; and Michael Allotey. Francis writes\n[\n3\n]\n:-\n... my maternal grandmother was a fishmonger. As a young boy, my mother periodically sent me with provisions for my grandmother to a fishing village called Edumafa, in Ekumfi, a traditional area about six miles East of Saltpond. In those days, there was no motorable road between Edumafa and Saltpond and hence I had to walk. There I assisted my uncles in fishing.\nHis education began in St John the Baptist Roman Catholic Elementary School in Saltpond at the age of nine. His fascination with mathematics and science, however, came about more through helping his father in the bookshop when he returned home from school. It was there, helping his father to repack the books, that he read about mathematics and science in the books that his father was selling, and became curious. He loved reading about the lives and discoveries of famous scientists such as\nArthur Eddington\n,\nAlbert Einstein\n,\nGalileo Galilei\n, George Gamow,\nWilliam R Hamilton\n,\nEdwin Hubble\n,\nJames Jeans\n,\nJames Clerk Maxwell\n, and\nIsaac Newton\n. He said that he wanted to be like them when he grew up, like those he read about in\nE T Bell\n's\nMen of Mathematics\n. He felt that he would like to be a good scientist and also contribute to the understanding of the universe\n[\n10\n]\n:-\nThere was this incredible small pamphlet written by the BBC after the war about the ideas of science. I read it and thought I have to be a scientist so that I can also explain the workings of the universe.\nHe was learning geometry and arithmetic from the books his father was selling, books which he really enjoyed reading. He also studied English, mathematics and science in elementary school before going to secondary school. He says he was fortunate that he was good at the subjects he loved, \"so these two things worked together.\" The school library, which is now named after him, also played an important part of his education.\nAfter elementary school, he went to high school, the Ghana National College at Cape Coast. He entered this school in July\n1948\n, the year it was founded by the President of Ghana, Dr Kwame Nkrumah, to educate eight students who had been expelled from the British run St Augustine's College. He had to argue his case strongly to be admitted and was the only student in the\n1\nst level class at the school. While still attending the Ghana National College he returned to Saltpond where he founded Fante State College. He became the first Principal and he taught General Science, Latin, Mathematics and English. When he was nineteen years old, wanting to travel to England to further his education, he needed to obtain a passport. He travelled on his own to Liberia to obtain a British passport. He sailed from Apapa in Ghana to Liverpool, England, on the\nS S Aureol\n, arriving in Liverpool on\n27\nApril\n1953\n.\nHis first studies in England were at the Borough Polytechnic. This subsequently changed its name to the Polytechnic of the South Bank in\n1970\n, the South Bank Polytechnic in\n1987\n, the South Bank University in\n1992\nand it has been the London South Bank University since\n2003\n. From the Borough Polytechnic, he progressed to the Imperial College of Science and Technology. While studying in London, he met Enid Edoris Chandler who was also a student. She had come to London from the parish of St Lucy in Barbados where she had been brought up. They married and had two children, Francis Kojo Enu Allotey and Joseph Kobina Nyansa Allotey, while living at\n54\nWayford Street, Battersea North, London. Allotey's wife appears to have been known as Enid up till the time of her marriage, but after that she was known as Edoris.\nAt the Imperial College of Science and Technology, Allotey was taught by Abdus Salam\n(1926\n-\n1996)\n, a Pakistani born theoretical physicist who was appointed to a chair at Imperial College in\n1957\nand set up the Theoretical Physics Department. Salam went on to be awarded the Nobel Prize for Physics in\n1979\nfor his contribution to the electroweak unification theory. Allotey was also taught by Patrick Maynard Stuart Blackett\n(1897\n-\n1974)\n, who had been appointed as head of the Physics Department at Imperial College in\n1953\n. He had been awarded the Nobel Prize for physics in\n1948\nfor his investigation of cosmic rays. Allotey's other teachers included Eric Thomas Eady\n(1915\n-\n1966)\n, a meteorologist, and Harry Jones\n(1905\n-\n1986)\n, a theoretical physicist who made important contributions to the study of electrons in metals and who was head of the Mathematics Department at Imperial College from\n1955\n. Allotey said that he got ahead of the others in his class by studying papers published in the previous ten years. Towards the end of his life he spoke about his time at Imperial College\n[\n10\n]\n:-\n... every Tuesday there was a lunchtime music concert, and this was something that gave me an appreciation of classical music. ... we didn't have a library, we had to go to a room and say which book we wanted and sign it out from a professor. ... There were a few professors I became close with. I was interested in cosmology, and my first idea was to try to do that, but cosmology at that time was not well established - it didn't have good experimental backing. So my professor suggested that if I was going to go to Africa I should change to work that has a better programme; that of condensed matter physics. He said if I did that I would become a good physicist. It was good that I took his advice.\nIn\n1960\n, Allotey was awarded the Diploma of Imperial College\n(\nLondon\n)\nand on\n30\nDecember of that year Allotey, together with his wife and two children, left the Port of London on the\nS S Calabar\nheading for the port of Takoradi, Ghana. He then spent the next two years teaching mathematics at Kwame Nkrumah University of Science and Technology in Kumasi, Ghana. This university had been Kumasi College of Technology, but had been awarded university status in\n1961\n, the year Allotey began teaching there. Although he was now well-qualified, Allotey wanted to undertake research for a Ph.D. on a topic he had started researching at Imperial College and was accepted by Princeton University in the United States. He travelled to London, then flew with BOAC from London to New York on\n14\nJuly\n1962\n. None of his family were with him. He gave his USA address as Princeton University, Princeton, New Jersey, USA and he gave his permanent address as Kwame Nkrumah University of Science and Technology, Kumasi, Ghana. He writes\n[\n3\n]\n:-\nIn\n1962\n, I went to Princeton University to study Mathematical Physics for my Ph.D. The Department of Physics at Princeton in the\n1960\n's was a very exciting place. It was full of distinguished professors among whom were\nWigner\n, Wheeler, Dicke, Hopfield, Bargmann and Goldberger. Oppenheimer,\nDirac\nand Yang from the Princeton Institute of Advanced Study regularly visited the Department. During my stay in Princeton, Fitch and his group were working on their Nobel winning experiments on CP violation. Dicke and his collaborators were measuring oblateness of the sun, the cosmic background radiation of the universe and the gravitational constant to the accuracy of one part in\n100\nbillion. As a graduate student, I occasionally assisted in some of the measurements of Dicke's group.\nAllotey says he was the first black student to be admitted to the graduate school, and that was the most exciting moment of his life. He was awarded a Master's Degree from Princeton, then a Ph.D. in Mathematical Physics, also from Princeton, in\n1966\nfor his thesis\nEffect of Electron-Hole Scattering Resonance on X-Ray Emission Spectrum\n(\nEffect of electron hole scattering on soft X ray emission spectra of lithium and sodium\n)\n.\nAfter the award of his Ph.D., he returned to Ghana, taking up his previous held position of Lecturer in Mathematics at the Kwame Nkrumah University of Science and Technology in Kumasi. He decided that there had to be a proper training in computer science in Ghana so he wanted to set up a course in computer science despite criticism from his colleagues. He said\n[\n10\n]\n:-\n... when I returned from Princeton in\n1966\n, I noticed there was no school in Africa that taught computer science. What happened was IBM would sell you a computer, and give you two weeks of lessons, but I thought that is not good enough - let them take it as a proper university course. So on my own, against my colleagues, I created the first department of computer science in Africa. I went to many parts of Africa preaching about not only physics but also the importance of computer science.\nHe had learnt FORTRAN while studying at Princeton and also knew some machine language. He began by setting up a one year course in computer science. He followed it up with a second year course which reached diploma standard. He went on to develop a full degree programme in Computer Science. In\n1974\n, he became the first full professor of Mathematics at the Kwame Nkrumah University of Science and Technology. Between\n1971\nand\n1980\nhe was elected four times to serve as Dean of the Faculty of Science and, between the same years, he was elected five times as a Representative of the Academic Staff. In\n1978\nhe was honoured with being appointed the Pro-Vice Chancellor of the Kwame Nkrumah University of Science and Technology.\nAllotey was awarded the Prince Philip Gold medal of the Ghana Academy of Sciences for his contribution to physical sciences in\n1973\n. In particular, this award was made for his contributions to soft X-ray spectroscopy. It was one of a great many awards that Allotey received. In November\n1981\nAllotey's wife Edoris died. Some years later he met Ruby Asie Mirekuwa Akuamoah, known as Asie, and they married in\n1988\n. Asie had two children from a previous marriage, Cilinnie and Kay, and so Allotey now gained two daughters. He had a great love of children and did much to support the education of children in mathematics and science throughout Africa. He\n[\n8\n]\n:-\n... had a special, soft spot for children, and would often engage any children he encountered in discussions about their performance at school and their biggest dreams and aspirations. He loved his family - both the nuclear and the extended. Despite his busy local and international schedules, and public engagements, he still had time for his family, and made sure the family stayed united. Throughout his life after returning from studies abroad, he found time to visit his mother and siblings at Saltpond and the uncles and aunties at Ekumfi Edumafa, Aboadze, Enyan Owomase, etc. As soon as he arrived, the whole of Appiakwaa where the family house is, would go giddy with excitement. He gave all the households in the area a share of whatever he brought, and his home - C\n53\n, became the centre of action as long as he was around. He always went with a screen projector and showed films like Woodie Wood Pecker, Popeye, Frankenstein and the Wolf Man, the Assassination of John F Kennedy, amongst others.\nIt was the support of his professor at Imperial College, Abdus Salam, that helped Allotey use his skills to promote the study of mathematics and physics at all levels throughout Africa. He said in an interview during a visit to Imperial College London in\n2017\n[\n10\n]\n:-\nI was influenced by Professor Abdus Salam at Imperial, who taught me mathematics and physics. After I went to Princeton, he wrote to me that he had just established the International Centre for Theoretical Physics\n(\nICTP\n)\nin Trieste, Italy, so I should go and see how it is. The aim of the Centre was to help develop mathematics in developing countries, because Salam himself was from Pakistan. Salam also saw that I had this aptitude for leadership, so he also gave me the opportunity to organise activities not only in Ghana but across Africa. That made my interests go further. I was appointed to lead the Africa work on the Scientific Council of the ICTP - I have served on the Council now for\n20\nyears, which is a record!\nThe African Academy of Sciences was established in\n1985\nwith Allotey as one of the founding members. The proposal to set up this Academy had been made at the inaugural meeting of 'The World Academy of Sciences' in Trieste, Italy, in\n1985\n. A committee was set up which presented its recommendations at a meeting held on\n10\nDecember\n1985\n. Participants at the meeting unanimously adopted the recommendations, turning the gathering into a General Assembly and drafting and adopting the Academy's founding constitution. Allotey was one of\n33\nparticipants who attended the General Assembly; they all became founding fellows of the Academy. For Allotey's biography as a fellow of the Academy, which lists many of his positions, honours and awards, see\nTHIS LINK\n.\nAllotey took a leading role in the UN declaring that\n2005\nwould be the International Year of Physics and\n2015\nwould be the International Year of Light. In\n2012\n, after attending a council meeting of the International Centre for Theoretical Physics in Italy, he went to Paris and addressed the executive board of UNESCO, offering to put the diplomatic services of Ghana at their disposal for preparing for the International Year of Light. He was rightly proud of his success and said in\nAfrican Voices\nin\n2015\n[\n5\n]\n:-\n... because of this little nation, this year has been declared the International Year of Light.\nHe had always wanted to found an African Institute of Mathematics in Ghana and he achieved this in\n2012\nwith the establishment of the African Institute for Mathematical Sciences. The first African Institute of Mathematics opened in South Africa in\n2003\nfollowed by a Senegal Institute in\n2011\n, the Ghana one on Allotey's initiative in\n2012\n, then Institutes in Cameroon\n2013\n, in Tanzania\n2014\n, and in Rwanda\n2016\n. The African Institute of Mathematics states:-\nOur vision is to lead the transformation of Africa through innovative scientific training, technical advances and breakthrough discoveries. Our mission is to enable Africa's brightest students to flourish as independent thinkers, problem solvers and innovators capable of propelling Africa's future scientific, educational and economic self-sufficiency.\nAllotey reached the age of\n85\nin excellent health. A UNESCO conference was due to be held on Saturday\n4\nNovember\n2017\nwhich he was planning to attend and at which he would be honoured. A couple of days before, around\n10\na.m. on the Thursday morning, he felt unwell and was taken to the hospital to be checked over. He was discharged later that day and returned home but in the evening he again fell ill and his family rushed him back to the hospital. He died about\n30\nminutes after he was admitted.\nOn Friday\n23\nFebruary\n2018\n, Albert K Fiadjoe, Emeritus Professor of Public Law and a fellow of the Ghana Academy of Arts and Sciences, delivered an eulogy for Allotey at his State Funeral which begins\n[\n13\n]\n:-\nMy association with Prof Allotey began in\n1973\nwhen I served under him as a Chairman of the Ghana Atomic Energy Commission Board. We remained close friends from that time and discussed a multiplicity of issues till he passed on in November\n2017\n. Of course, a great deal will be said and written about his wondrous deeds and accomplishments because he was indeed a famous man. We all know now that though Kofi Allotey was born of ordinary circumstances, he lived an extraordinary and fascinating life as a father, academic and a renowned scholar. From very humble beginnings, Prof Allotey defied all the odds and obstacles that came his way, and indeed there were many of those. As we celebrate his life, we cannot but also reflect on the family environment from whence he came for, together he and his family symbolise so much about what makes this country of ours the wonderful gem that it is. Poor but proud, that family of humble circumstances strove hard and exhibited industry of a very high pedigree.\nJoseph Niemela and John Dudley give this tribute in\nPhysics Today\n[\n26\n]\n:-\nFrancis was, in our opinion, the most recognisable voice for physics in Africa. A kind and highly principled man with a ready smile, he is greatly missed by his friends and family. His work lives on through the organisations and institutes he founded, and he leaves a remarkable human legacy in the thousands of students and colleagues who have been inspired by his example. We will remember him with great fondness."
}