{
  "nome_completo": "Fritz Joseph Ursell",
  "nome_curto": "Fritz Ursell",
  "ano_nascimento": "1923",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ursell/",
  "lugar_nascimento": "Düsseldorf, Germany",
  "lugar_morte": "Manchester, England",
  "biografia": "Fritz Ursell\n's parents were Siegfried Ursell\n(1879\n-\n1947)\nand Leonore Helene Mayer\n(1893\n-\n1988)\n. Siegfried was a paediatrician and, from\n1914\nto\n1918\n, during World War I, he had served as a doctor in the German Army. Leonore had trained as a primary school teacher but, from\n1914\nto\n1918\n, during World War I, she had served as a nurse in a hospital. Both Siegfried and Leonore were Jewish, from Jewish families that had lived in Germany for hundreds of years. Fritz, who had one sister, began his schooling in a kindergarten and all went well until\n1933\nwhen the Ursell family's troubles began.\nAdolf Hitler became Chancellor of the German Reich on\n30\nJanuary\n1933\n. He quickly moved to rid himself of rivals both inside and outside his party. On\n1\nApril\n1933\nthere was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter universities. On\n7\nApril\n1933\nthe 'Civil Service Law' was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. On\n25\nApril\n1933\na Law against 'Overcrowding in German Schools and Universities' was passed under which children who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be banned from attending secondary school but there were exemptions for those whose parents had fought for Germany in World War I. Because Siegfried Ursell had served during World War I, Fritz was allowed to begin his secondary education at the Comenius\nGymnasium\n. This school, founded in\n1908\n, had originally been known as the \"High School for Boys in Upper Cassel\".\nAt the Comenius Gymnasium, Fritz learnt Greek and Latin. It provided a good classical education but the mathematics teaching was poor and Fritz had little interest in this topic. His years at the Gymnasium grew increasingly more difficult with discrimination against Jews becoming ever more severe. By\n1936\nhe was the only Jewish child left at the Gymnasium and his parents realised that they had to act quickly to give him a chance in life, or even the chance of a life. Fritz's mother Leonore had a cousin working as a doctor in London and a friend Jeannette Franklin-Kohn who had left Düsseldorf for England where she had set up an organisation in Bournemouth to help Jewish German children escape from the Nazis. Franklin-Kohn arranged for Fritz to enter Streete Court School, a Preparatory School in Westgate-on-Sea, Kent. He began his studies there in January\n1937\nand quickly mastered English so, by June of that year, he was able to sit the Common Entrance Examination into Clifton College, Bristol.\nUrsell did well at Clifton College partly, he believed, because of his good grounding in Latin gained in Düsseldorf. He performed well in the examination in December\n1938\nbut, if he was to remain at school, he had to specialise at this stage. If he left school, Ursell would have had to return to Germany where his parents were still living. H C Beaven, the Head of Mathematics at Clifton College, advised Ursell's parents to let their son specialise in mathematics since he felt that in this subject Ursell would have a good chance of a university scholarship. Beaven, a Balliol graduate known as \"Fuzzy B\", was described at his funeral in\n1939\nas a \"devoted and unselfish scholar whose whole being becomes part of the school they serve\". Ursell's parents did not like the idea that their son would study a \"useless\" subject like mathematics but, nevertheless, they reluctantly agreed to let him follow Beaven's advice. At least, they thought, studying mathematics would not be as bad as having their son return to Nazi Germany. Ursell entered the Upper Fifth Mathematics class at Clifton College in January\n1939\n.\nThe position of Jews in Germany in\n1939\nwas dire. Ursell's father was no longer allowed to practise as a doctor. The family applied for American visas but while they were waiting, their situation was so difficult that they managed to get permission to come to England to wait until the visa applications came through. However, they never made it to the United States. They were still waiting in England when, on\n1\nSeptember\n1939\n, Germany invaded Poland. Two days later Britain was at war with Germany and the whole Ursell family were enemy aliens. Fritz was doing well at Clifton College where he was studying mathematics, physics, English, Old Testament and German. Rather surprisingly, given the topics on which he would later undertake research, the one subject he disliked was physics. For some months the war seemed to be rather remote to those living in England except for government preparations like moving children out of cities in February\n1940\n. However, in May\n1940\nGerman troops invaded Holland and Belgium, taking Boulogne before the end of the month. Fritz Ursell was told that, as an enemy alien, he could not remain in Bristol since enemy aliens could not live within\n50\nmiles of the coast. This might have ended his hopes of taking the Cambridge scholarship examinations later that year but the headmaster of Clifton College, Bertrand Leslie Hallward\n(1901\n-\n2003)\n, managed to arrange for him to study at Marlborough College, a famous boys' school in the small town of Marlborough in Wiltshire. The police gave permission for him to study there. We note that, after Ursell left Clifton College, on\n2\nDecember\n1940\nbombs hit the school buildings and Clifton College was evacuated to Bude on the Cornish coast. The Head of Mathematics at Marlborough College was the excellent teacher Alan Robson and, guided by him, Ursell gained a distinction in the School Certificate examinations. He wrote\n[\n1\n]\n:-\nThe teaching of mathematics at Marlborough was of high quality, ranked second in England after Winchester College, the famous fourteenth century foundation. The head of mathematics was Mr Alan Robson, a wonderful mathematician. I was at Marlborough from May to December, and I learnt a great deal. By December I was in a stronger position than if I had stayed at Clifton.\nFollowing Robson's advice he took the examinations for a scholarship at Trinity College, Cambridge. Knowing that he had no financial support, but that he had produced an outstanding performance\n(\nparticularly in projective geometry\n)\nin the Cambridge Scholarship Examinations in December, the University augmented the Trinity Scholarship he won to enable him to cover the whole cost of his studies.\nIn January\n1941\n, Ursell matriculated at Trinity College Cambridge. His Director of Studies was\nAbram Samoilovitch Besicovitch\n. He performed well in the Mathematical Tripos and, after obtaining permission to delay war work and take Part III, he began to take that course in October\n1942\n. Only five students were in Ursell's class at this stage, and they included\nFreeman Dyson\nand\nJames Lighthill\n. Ursell, feeling that the other students were much better than he was, approached\nBesicovitch\nwith his worries.\nBesicovitch\nsaid\n[\n2\n]\n:-\nYou will never have to compete, these talented people will not be interested in your problems but in different problems. Also, they may abandon mathematics altogether, like the famous Trinity mathematician\nIsaac Newton\n. And finally, it is not the good mathematicians who do the good mathematics.\nAfter taking courses by\nG H Hardy\non divergent series,\nJ E Littlewood\non complex analysis,\nA E Ingham\non number theory,\nW V D Hodge\non\nRiemann\nsurfaces, and\nP A M Dirac\non quantum mechanics, Ursell graduated with distinction in\n1943\n.\nHaving already delayed undertaking war work in order to complete Part III, Ursell was now keen to make his contribution to the war effort. He was recommended for work at the Royal Aircraft Establishment at Farnborough but they refused to accept an enemy alien. He was then sent to the Admiralty Research Laboratory at Teddington in southwest London. In May\n1944\nhe joined the Wave Group and this was to determine the topics that he would continue to undertake research in for the rest of his life. He became a leading expert in the mathematical modelling of waves. The work done by the Wave Group made a major contribution to the war effort for their data was used to set the strategy for the Allied landings in Normandy and in the Pacific.\nUrsell published a joint paper with Norman Frederick Barber,\nThe Generation and Propagation of Ocean Waves and Swell. I. Wave Periods and Velocities\nin\n1948\n. It appeared in the\nPhilosophical Transactions\nof the\nRoyal Society of London\nand was submitted in May\n1947\nby the authors who were both working at the Admiralty Research Laboratory. Here is the authors own summary:-\nA method is described for measuring and examining ocean waves in a way which allows their amplitude and period to be determined with some precision. Data obtained in this way are compared with meteorological charts of the ocean in an attempt to assess the velocity of propagation of swell over long distances. A critical estimate is only possible when the meteorological conditions are sufficiently simple, but in one selected example it appears that the velocity of propagation is within\n5\n% of the value prescribed by hydrodynamical theory. The evidence in more complicated instances does not disagree with this result, but does not permit of such an exact interpretation. The waves are measured by the fluctuating pressure which they produce upon an instrument laid on the sea bed in shallow water near the coast. The resulting curves are examined by a machine which draws the frequency spectrum of the recorded waves. The information given by these spectra is combined with the information of wind strength given by the meteorological charts to form a 'propagation diagram' whose appearance is a test of the validity of the theoretical group velocity. A suitable theoretical basis is given to the work.\nWe note that Norman Barber played an important role in Ursell's development. He writes\n[\n8\n]\n:-\n[\nNorman Barber\n]\nwas a true physicist, with physical insights which\n(\nas I then discovered\n)\ndiffer greatly from mathematical insights. ... Of all my colleagues he had the most profound influence on me. For me he was the closest approximation to a thesis supervisor, for I never was a graduate student. We remained in touch until his death in\n1992\n.\nIn September\n1947\nUrsell left the Admiralty Research Laboratory and, having been awarded an Imperial Chemical Industries\n3\n-year research fellowship, joined the Department of Applied Mathematics at the University of Manchester. The fellowship, although funded by Imperial Chemical Industries, allowed Ursell to undertake research in any area and he had no commitment to ICI. Before the award of the fellowship he had submitted a thesis to Trinity College, Cambridge for a Fellowship and, shortly after moving to Manchester, he was informed that he had been awarded a\n4\n-year Prize Fellowship by Trinity College, Cambridge. Ursell asked Trinity if he could have leave of absence and was allowed to spend the three years at Manchester before taking up the Trinity Fellowship. Ursell's parents and sister continued to live in Cambridge but his father died on\n4\nDecember\n1947\nat the age\n68\n. Ursell wrote three important papers while at Manchester, namely\nSurface waves on deep water in the presence of a submerged circular cylinder\n. I and II\n(1950)\n, and\nTrapping modes in the theory of surface waves\n(1951)\n.\nIn\n1950\nUrsell returned to Cambridge where, in addition to his Trinity Fellowship, he was appointed to a University Lectureship in Applied Mathematics. He moved in with his mother and sister who were living at\n4\nBelvoir Terrace, Trumpington Road, Cambridge. A visit to the United States in\n1951\nwas important, for at this time he made contact with, among other,\nRichard Courant\nand\nKurt Friedrichs\nin New York, and\nGarrett Birkhoff\nat Harvard. He arrived in New York on\n15\nAugust\n1951\nhaving sailed from Southampton on the ship\nAmerica\n. He also spent the academic year\n1957\n-\n58\nin America, at the Massachusetts Institute of Technology in Cambridge, Massachusetts. In New York he had met Katharina Renate Braude\n(\nknown as Renate\n)\n, whose maiden name was Zander. They were married in Cambridge, England, on\n19\nJune\n1959\n, and had two daughters, Ruth and Susie.\nIn\n1961\nUrsell was offered the Beyer Chair of Applied Mathematics at the University of Manchester. The chair had become vacant when\nJames Lighthill\nhad left Manchester to become director of the Royal Aircraft Establishment at Farnborough. However, this was no easy decision for Ursell since he was unsure whether he wanted to take on the administrative work involved in such a position. Another complication was that the Massachusetts Institute of Technology also offered him a professorship at this time. After lengthy deliberations he accepted the Manchester position and he remained there for the rest of his career.\nWe have already said a little about Ursell's mathematical contributions, but at this point we quote David Abrahams and Paul Martin\n[\n7\n]\n:-\nFritz made seminal contributions to research in the mathematical analysis of linear water waves. This required the development of new techniques for the asymptotic evaluation of integrals, especially uniformly valid approximations. He made numerous contributions to the field, for example, he constructed a family of solutions for edge waves on a sloping beach, extending\nStokes\n's original result; he gave a detailed analysis of the Kelvin ship wave patter; and he was the first to prove the existence of trapped modes in water-wave problems, here for the case of a submerged circular cylinder. His papers, collected and published by World Scientific in\n1994\n, are exceptional for their clarity and precision.\nUrsell was honoured by being elected to the\nRoyal Society of London\nin\n1972\n. When he retired from the University of Manchester in\n1990\n, a two-day conference was held in his honour. He gave the final talk at the conference, namely\nSome unsolved and unfinished problems in the theory of waves\n. When he reached the age of\n85\nin\n2008\n, the University of Manchester held another conference in his honour. In a talk he gave at this meeting, he continued to give his thoughts on the direction that universities were taking\n[\n2\n]\n:-\nFritz was an active participant in university politics, fearful of the progressive intrusion of market and business ideology into the ethos of university life. He strove valiantly to oppose the transition from a collegial to a management style of university government, although he recognized that it was a losing battle. In his\n2008\nlecture, Fritz warned that 'recent university reforms ... have increased the control of government over the research done in universities'. He was tireless in drawing attention to the negative impact of these changes, in speeches to university bodies and in letters to university administrators.\nAs to Ursell's character, we quote from David Evans, one of his students\n[\n3\n]\n:-\nHis lectures, just like his research papers were models of clarity and precision, but again, like his papers, they contained a depth of detail only revealed on closer study. ... As a junior colleague I was very much in awe of him because of his reputation and position and it was many years later before I plucked up the courage to address him as Fritz. In fact I needn't have worried. He was a kind and gentle man, not one to stand on ceremony and wholly supportive of his former students, myself included, throughout their careers. Aside from his consummate skills as a mathematician, Fritz was a true renaissance man, capable of conversing knowledgeably yet modestly, on a wide range of subjects including European history, politics, music, and literature, especially Shakespeare.\nAfter dying peacefully in hospital at age\n89\n, Ursell's funeral took place on Tuesday\n15\nMay\n2012\nat Manchester Crematorium. He was survived by his wife Renate, his daughters Ruth and Susie, and his grandchildren Helen and James."
}