{
  "nome_completo": "Fritz Bützberger",
  "nome_curto": "Fritz (Friedrich) Bützberger",
  "ano_nascimento": "1862",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Butzberger/",
  "lugar_nascimento": "Bleienbach, Bern canton, Switzerland",
  "lugar_morte": "Bern, Switzerland",
  "biografia": "Fritz\n(\nFriedrich\n)\nBützberger\nattended primary school in his native village of Bleienbach and secondary school in Langenthal. He attended the\nGymnasium\nin Burgdorf. In\n1880\nhe began his studies at the Engineering Department of the Polytechnic, but after a year he transferred to the Department for Mathematics and Physics Teachers. He graduated from the Polytechnic in\n1884\nand began working as a mathematics teacher at his former secondary school in Langenthal, after having worked at a school in Solothurn for a few months.\nWhilst teaching in Langenthal he also studied towards a doctorate at the University of Bern. He completed his thesis\nEin mit der Theorie algebraischer Flächen zusammenhängendes planimetrisches Problem\nⓉ\n(\nA problem associated with the planimetric theory of algebraic surfaces\n)\nin\n1888\n. The doctorate was conferred \"summa cum laude\", with highest honours\n[\n8\n]\n. Bützberger was the\n11\nth\nof\nSchläfli\n's\n12\ndoctoral students.\nBützberger became a mathematics teacher at the Kantonsschule in Zürich in\n1896\n. From\n1899\nonwards he taught in the school's technical track only, thus preparing future engineers for their university studies. Furthermore, he also taught mathematics at Zürich's adult education centre. At the University of Zürich he delivered lectures on descriptive geometry to future secondary school teachers. In\n1903\nhe took up a teaching post at the technical school in Burgdorf.\nBützberger was a 'first-rate teacher and author of several much valued textbooks with ample exercises'\n[\n9\n]\n. His textbooks include\nLehrbuch der ebenen Trigonometrie mit vielen Aufgaben und Anwendungen\nⓉ\n(\nTextbook of plane trigonometry with many problems and applications\n)\n(\nZürich,\n4\nth\nedition\n1910)\n,\nLehrbuch der Stereometrie\nⓉ\n(\nTextbook of solid geometry\n)\n(\nZürich,\n3\nrd\nedition\n1916)\n, and\nLehrbuch der Arithmetik und Algebra für Mittelschulen\nⓉ\n(\nTextbook of arithmetic and algebra for middle schools\n)\n(\nZürich,\n2\nnd\nedition\n1920)\n. All of them were reviewed favourably and were reprinted several times. Salkowski calls\nLehrbuch der Stereometrie\nⓉ\n(\nTextbook of solid geometry\n)\nan 'established book'\n[\n10\n]\n, whilst Barneck comments on Bützberger's style in\nLehrbuch der Arithmetik\nⓉ\n(\nTextbook of arithmetic and algebra for middle schools\n)\n...: 'The presentation is broad and comprehensible for pupils'\n[\n5\n]\n. Zacharias commends\nLehrbuch der ebenen Trigonometrie\nⓉ\n(\nTextbook of plane trigonometry\n)\n... for similar reasons\n[\n11\n]\n:-\nThe\n[\nwriting\n]\nis succinct and clear; the definitions and theorems are succinct and easy to learn throughout; historic remarks make for interesting reading; numerous exercises, partly  theoretical, partly practical, are included in the individual sections\n[\n...\n]\nMoreover, Bützberger published several papers, among them\nEiförmige Drehkörper\nⓉ\n(\nEgg-shaped rotating bodies\n)\n(1917)\n, which is aimed at secondary school pupils. In this paper he determines centroids of ovoids, using the Guldinus theorem. As he mentions in the introduction, 'one of my pupils, a keen ornithologist, inspired me to solve\n[\nthe problems treated here\n]\n'\n[\n6\n]\n. Bützberger also wrote a very readable biography of the Bernese mathematician\nGeorg Sidler\n[\n7\n]\n, his friend and former teacher. In\n1912\nhe gave a talk at the annual meeting of the\nSwiss Mathematical Society\n.\nHe had a particular interest in\nJakob Steiner\nand published a couple of biographical papers on the geometer. More importantly, he organised and edited\nSteiner\n's papers from\n1823\n-\n26\non the request of the Bernese Society for Natural Scientists. As Bützberger remarks in\n[\n3\n]\n,\nGraf\ndiscovered\nSteiner\n's handwritten manuscripts covering the period from\n1814\n-\n1826\nin the attic of the Town Library in Bern.\nGraf\nthen passed the documents on to Bützberger 'to put them in order and to good use'\n[\n3\n]\n. The collection of Bützberger's papers is now stored in the ETH Library Archive.\nMore details of Bützberger's work on Steiners papers are at\nTHIS LINK\nBützberger joined the organising committee of the first International Congress of Mathematicians\n(\nor enlarged committee as it is called in the minutes\n)\nin December\n1896\n. At his first committee meeting on\n8\nDecember he joined the reception committee chaired by\nHurwitz\n. At the meeting on\n31\nJuly\n1897\n,\nRudio\nsuggested that a 'correspondence and mail room should be established and a postal service organised'\n[\n4\n]\n; Bützberger accepted this task.\nBützberger was married to Rosa Kohler. The couple had two children: a son, Fritz, and a daughter, Marie. There is little information about Bützberger's personal life in the obituaries and his estate. In a letter to U Hoepli and his wife in\n1920\n[\n2\n]\n, Bützberger mentions his son and daughter. Presumably he would have mentioned any further children. He also refers to his brother Ernst and his brother-in-law Hardmeyer.   Ulrico Hoepli\n(1847\n-\n1935)\nwas a Swiss bookseller who emigrated to Milan. He became one of Italy's most important publishers, specialising in sciences and Italian classics, and an influential art patron."
}