{
  "nome_completo": "Gabriele Manfredi",
  "nome_curto": "Gabriele Manfredi",
  "ano_nascimento": "1681",
  "ano_morte": "1761",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Manfredi_Gabriele/",
  "lugar_nascimento": "Bologna, Papal States (now Italy)",
  "lugar_morte": "Bologna, Papal States (now Italy)",
  "biografia": "Gabriele Manfredi\n's father, Alfonso Manfredi, was a lawyer in Bologna. Alfonso, who came originally from Lugo, which is about\n40\nkm east of Bologna, married Anna Maria Fiorini and they had four sons and two daughters. It was a remarkable family for, in addition to Gabriele, his brothers\nEustachio Manfredi\n(1674\n-\n1739)\n(\nwho also has a biography in the archive\n)\nand Eraclito\n(1682\n-\n1759)\nbecame professors of mathematics and of astronomy. His two sisters, Maddalena\n(1673\n-\n1744)\nand Teresa\n(1679\n-\n1767)\n, did not receive the formal education of the boys, only receiving an elementary school education. However, they learnt from their brothers and became very knowledgeable in astronomy, mathematics and Latin. The girls devoted themselves to supporting the family, partly by undertaking domestic duties but also helping their brothers with their scientific work. They produced literary works aimed at the educated middle-class inhabitants of Bologna. The third brother, Emilio\n(1679\n-\n1742)\n, became a Jesuit priest.\nGabriele's brother,\nEustachio Manfredi\n, was over six years older than he was.\nEustachio\nstarted up the Accademia degli Inquiti, which at first was an informal gathering of friends and fellow students, meeting at the Manfredi home from\n1690\nonwards. Gabriele, showing a precocious talent and a marked predilection for scientific study, joined in the meetings as he was growing up. Gabriele began to study medicine but the anatomy classes he attended frightened him so he decided to change topics and, for a while, studied history, languages, poetry and geography. However, he became interested in mathematics when his brother\nEustachio\nwas learning differential calculus from Giovanni Domenico Guglielmini\n(1655\n-\n1710)\n. Guglielmini had produced important contributions to crystallography beginning in\n1688\nand went on to study hydraulics leading to his major work on rivers,\nDella Natura del Fiumi\nⓉ\n(\nThe nature of rivers\n)\n(1697)\n, which included among other things a description of uniform flow. Gabriele Manfredi also studied with Guglielmini but, after his brother\nEustachio\nturned to astronomy and Guglielmini left Bologna to move to Padua in\n1699\n, Gabriele carried on studying mathematics on his own. He read mathematical works by\nGottfried Leibniz\n,\nJohann Bernoulli\nand\nJacob Bernoulli\nas well as studying\nGuillaume de l'Hôpital\n's differential calculus text\nAnalyse des Infiniment Petits pour l'Intelligence des Lignes Courbes\nⓉ\n(\nAnalysis of the infinitely small for understanding line curves\n)\n(1696)\n.\nIn order to avoid confusion between the brothers, from this point on we shall refer to Gabriele Manfredi, the subject of this biography, simply as 'Manfredi' and if we refer to his brother we shall call him 'Eustachio'. Towards the end of\n1702\n, Manfredi went to Rome to look for a job. His brother\nEustachio\nhad suggested that he contact Francesco Bianchini\n(1662\n-\n1729)\n, the librarian to Cardinal Pietro Ottoboni. Bianchini was a historian, antiquarian and astronomer who, at this time, had been commissioned by Pope Clement XI to construct a sundial and meridian line in Santa Maria degli Angeli in Rome, modelled on one that\nGiovanni Cassini\nhad designed for the Basilica of San Petronio in Bologna. Pope Clement XI had wanted this to be completed by\n1700\nbut, when Manfredi arrived in Rome towards the end of\n1702\nit was still under construction. Manfredi assisted with the construction which was completed in\n1703\n. He then remained in Rome until\n1706\nstudying under a number of leading scholars including the Jesuit Antonio Baldigiani\n(1647\n-\n1711)\n, professor of mathematics and theology at the Collegio Romano, and Domenico Quarteroni\n(1650\n-\n1734)\n, professor of mathematics at La Sapienza, the University of Rome, from\n1696\nto\n1734\n.\nBianchini was involved in another project, namely calendar reform, and he was secretary to a group of scientists working on this problem. Through contacts with members of this group, Manfredi was put in touch with\nPierre Varignon\nwho was working in Paris on applications of the differential and integral calculus. Since\n1701\nManfredi had been corresponding with\nGuido Grandi\nwho had been appointed as professor of philosophy in Pisa in May\n1700\n. This correspondence with\nGrandi\nwas particularly important since it marks the beginning of innovative research on the calculus being undertaken in Italy. While Manfredi was in Rome,\nGrandi\npublished his important work on the differential calculus\nQuadratura circoli et hyperbolae per infinitas hyperbolas et parabolas quadrabiles geometrice exhibita\nⓉ\n(\nQuadrature  of circles, hyperbolas, infinite hyperbolas and parabolic lunes presented geometrically\n)\n(1703)\n. In the spring of\n1706\n, Manfredi left Rome and returned to Bologna where he published his most famous work,\nDe constructione aequationum differentialium primi gradus\nⓉ\n(\nOn the construction of differential equations of the first degree\n)\n(\nBologna\n1707)\n, the first monograph in the world dedicated to the study of differential equations\n[\n4\n]\n:-\nThe work, in six sections, collected and presented in an orderly manner the results on first order differential equations scattered in the mathematical literature .... He first studied equations with algebraic solutions, then those that lead to transcendental curves, then moved on to equations that are solved by means of substitution of variables. The last section was a mixture of problems, some only proposed, such as integration of homogeneous equations.\nA copy of the book was sent to\nLeibniz\nwho wrote a favourable review of it in\nActa eruditorum\nin\n1708\nand again in\nGiornale de' letterati d'Italia\nin\n1710\n.\nManfredi became a chancellor in the Senate of Bologna in\n1708\n, and continued to hold a position in the Senate until his retirement in\n1752\n. He also taught mathematics at the University of Bologna, where he was appointed as a professor in\n1720\n. He continued to produce works on differential equations, publishing\nBreve schediasma geometrico per la costruzione di una gran parte delle equazioni di primo grado\nⓉ\n(\nShort geometric schemes for the construction of a large part of the equations of the first degree\n)\n, in the\nGiornale de' letterati d'Italia\nin\n1714\n. In this work he gave methods to integrate first order homogeneous differential equations. His paper\nSoluzione di un problema appartenente al calcolo integrale\nⓉ\n(\nSolution of a problem in the integral calculus\n)\n, which appeared in the same journal in\n1722\n, was prompted by\nBrook Taylor\n's challenge to \"non-English mathematicians\" to integrate a certain differential. This challenge was issued as part of the ongoing argument over the claims made for the superiority of\nNewton\n's or\nLeibniz\n's approach to the calculus. Between\n1727\nand\n1761\n, Manfredi had fifteen memoirs read to the Bologna Institute of the Accademia delle scienze. Most of these memoirs concern the integration of ordinary differential equations. The last of these was read on\n20\nJune\n1761\n, shortly before his death\nIn\n1742\n, following the death of his brother\nEustachio Manfredi\n, he had been appointed as superintendent of the Bolognese Water Authority, taking on the role that\nEustachio\nhad held for many years. The problem that he faced was that the river Reno, a tributary of the river Po, was causing devastating floods between Bologna and Ferrara.\nEustachio\nhad represented Bologna in the discussions between experts from the States of Mantua and of Venice in attempts to solve this problem. The difficulties in finding a solution were great for there were economic issues, technical issues, political issues and legal issues to overcome. The problem had not been solved up to the time of\nEustachio\n's death and so when Manfredi took over as superintendent of the Bolognese Water Authority he was still faced with this same difficulty. He was no more successful in this role than his brother had been and it was not until many years after Manfredi's death that the flooding problem was finally solved.\nManfredi was married to Teresa Del Sole from the family of the artist Giovan Giuseppe del Sole; they had three children. He died in Bologna and was buried in the family tomb in the church of Santa Maria Maddalena, in Via Zamboni formerly called San Donato Road."
}