{
  "nome_completo": "Gaspard Gustave de Coriolis",
  "nome_curto": "Gaspard-Gustave de Coriolis",
  "ano_nascimento": "1792",
  "ano_morte": "1843",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coriolis/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Gaspard-Gustave de Coriolis\n's father was Jean-Baptiste-Elzéar Coriolis and his mother was Marie-Sophie de Maillet. His father became a sub-lieutenant in the Bourbonnais regiment in\n1773\n, fought in the American campaign in the Rochambeau corps in\n1780\n, and returned to France when he was promoted to captain on\n15\nJuly\n1784\n. He became an officer with Louis XVI in\n1790\nbut this put him in difficulties when the monarchy was in trouble. The King tried to escape and fled Paris on\n21\nJune\n1791\nbut he was caught at Varennes and brought back to the capital. Gaspard-Gustave Coriolis was born in June\n1792\nand on\n21\nSeptember of that year the monarchy was abolished. Coriolis's father fled to Nancy where he became an industrialist. Louis XVI was guillotined in Paris in January\n1793\n.\nCoriolis was brought up in Nancy and attended school there. He sat the entrance examination for the École Polytechnique in\n1808\nand he was placed second of all the students entering that year. On graduating he entered the École des Ponts et Chaussées in Paris. With the engineering corps he worked for several years in the Meurthe-et-Moselle district and the Vosges mountains. After his father died Coriolis had to support the family and, with his health already poor, he decided to accept a post in the École Polytechnique in\n1816\ntutoring analysis. He had been recommended for this position by\nCauchy\n.\nCoriolis became professor of mechanics at the École Centrale des Artes et Manufactures in\n1829\n. In July\n1830\nthere was a revolution and, following this\nCauchy\nleft Paris in September\n1830\n. Political events in France meant that\nCauchy\nwas now required to swear an oath of allegiance to the new regime and when he failed to return to Paris to do so he lost all his positions there. Coriolis was offered\nCauchy\n's position at the École Polytechnique but by this time he was highly involved in his research and decided not to take on any further teaching duties.\nDespite not accepting further duties at the École Polytechnique, Coriolis did take on a position at the École des Ponts and Chaussées in\n1832\n. There he teamed up with Navier teaching applied mechanics. Navier died in\n1836\nand Coriolis was appointed to his chair at the École des Ponts and Chaussées. He was also elected to replace Navier in the mechanics section of the\nAcadémie des Sciences\n. Coriolis continued teaching at the École Polytechnique until\n1838\nwhen he decided to end teaching and take on the role of director of studies. He did this task extremely well but his poor health which had afflicted him since he was a young man became much worse in the spring of\n1843\nand a died a few months later.\nCoriolis studied mechanics and engineering mathematics, in particular friction, hydraulics, machine performance and ergonomics. He introduced the terms 'work' and 'kinetic energy' with their present scientific meaning. Coriolis began developing his ideas in\n1819\nand he showed some papers to\nPoncelet\nin\n1824\n. Both Coriolis and\nPoncelet\npublished in\n1829\n; the paper by Coriolis being\nDu Calcul de l'effet des machines\nⓉ\n(\nCalculation of the effect of machines\n)\n. Despite the two papers appearing in\n1829\nthere was no argument as to who initiated the idea, with\nPoncelet\nacknowledging that the word \"work\" was brought in by Coriolis. The article\n[\n5\n]\nsimplifies this piece of history so much that it could be misleading on this point. The contribution of Coriolis,\nPoncelet\n, and\nNavier\nto the concept of 'work' is examined in detail in\n[\n6\n]\n.\nCoriolis proposed a unit of work, namely the 'dynamode'. The unit represents\n1000\nkilogram-metres and was proposed by Coriolis as a measure which could provide a sensible unit with which to measure the work which a person might do, a horse, or a steam engine. However, although his term 'work' has become standard, the dynamode did not prove popular as the unit of work.\nIt is not the ideas of 'work' for which Coriolis is best remembered, however, rather it is for the Coriolis force which appears in the paper\nSur les équations du mouvement relatif des systèmes de corps\nⓉ\n(\nOn the equations of relative movement of the body's systems\n)\n(1835)\n. He showed that the laws of motion could be used in a rotating frame of reference if an extra force called the Coriolis acceleration is added to the equations of motion.\nIn\n1835\nCoriolis wrote on a mathematical theory of billiards in\nThéorie mathématique des effets du jeu de billiard\nⓉ\n(\nMathematical theory of the properties of the game of billiards\n)\n. He also wrote\nTraité de la mécanique des corps solides\nⓉ\n(\nTreatise on the mechanics of solids\n)\n(1844)\n.\nCostabel sums up his contribution as follows\n[\n1\n]\n:-\nOne application of\n[\nCoriolis force\n]\nis to fluid masses on the earth's surface. Accordingly, in\n1963\n, a French oceanographic research vessel was named for\n[\nCoriolis\n]\n, thus honouring the scientist - and not the engineer - in a fitting tribute to a career characterised by its union of theory and technical application."
}