{
  "nome_completo": "Georg Mohr",
  "nome_curto": "Georg Mohr",
  "ano_nascimento": "1640",
  "ano_morte": "1697",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mohr/",
  "lugar_nascimento": "Copenhagen, Denmark",
  "lugar_morte": "Kieslingswalde (near Görlitz), Germany",
  "biografia": "Georg Mohr\n's father was David Mohrendal. The name sometimes also appears as Mohrenthal but certainly around this period it is quite common for names to appear with different spellings. David Mohrendal was a tradesman who also worked as an inspector of hospitals. Georg was educated by his parents and learnt enough mathematics from them to want to study further. He also learnt reading and writing from his parents.\nHe went to Holland in\n1662\nintending to study mathematics under\nHuygens\n. He also studied in France and England before returning to his native Denmark. Mohr was little known in his own day as a mathematician. His book\nEuclides danicus\nⓉ\n(\nDanish Euclid\n)\n, published in\n1672\n, was forgotten about until it was discovered in a bookstore in\n1928\n. Perhaps no copies were ever sold! J Hjelmslev wrote a forward to\nEuclides danicus\nⓉ\n(\nDanish Euclid\n)\nand republished a German translation in\n1928\n.\nThe book contains a proof that all Euclidean constructions can be carried out with compasses alone.\nSeidenberg\nwrites in\n[\n1\n]\n:-\nThe book is in two parts: the first consists of the constructions of the first six books of\nEuclid\n; the second, of various constructions. The problem of finding the intersection of two lines, which is of some theoretical importance, is solved incidentally in the second part in connection with the construction of a circle through two given points and tangents to a given line. ... In the body of the book Mohr does not state the issue until the very last paragraph ... In the dedication to Christian V, he does say that he believes he has done something new, and on the title page the issue is explicitly stated. Still, it would be easy for an inattentive reader to misjudge the value of the book.\nMascheroni\n, who is credited with proving that all Euclidean constructions can be carried out with compasses alone, did not prove this until\n125\nyears after Mohr's book was published. Mohr proves in the book that a line segment can be divided in golden section with compass alone, and the historical and pedagogical importance of this theorem is discussed by Zühlke in\n[\n8\n]\n.\nMohr spent part of his life in Holland and part in Denmark. He fought in the Dutch-French wars around\n1672\nand became a prisoner of war. Mohr corresponded with a number of mathematicians including\nLeibniz\nwho had received a work written by Mohr on root extraction. It had been sent to him by Oldenburg, the secretary of the\nRoyal Society\nin London, in\n1675\nand\nLeibniz\nreplied to Oldenburg in the following year praising Mohr's skill in geometry and analysis. Mohr was back in Denmark around\n1681\nbut, having decided not to accept a post from King Christian V as supervisor of his shipbuilding, he returned to Holland in\n1687\n. In the same year he married and he had one son who was born around\n1692\n.\nHe corresponded with\nTschirnhaus\nwhom he had met on several occasions in Holland, France and England. In\n1695\nMohr accepted the offer of a job from\nTschirnhaus\nand he went to Kieslingswalde, with his wife and son, to take part in\nTschirnhaus\n's mathematical projects.\nMohr's son claimed that his father had written three books on mathematics and philosophy which were all well received. This has led to a certain amount of interest from historians trying to identify the other two books, one of which has been identified\n(\nsee for example\n[\n3\n]\n,\n[\n5\n]\nand\n[\n6\n]\n)\n. Meyer writes in\n[\n6\n]\n:-\nIn \"Euclides Curiosus\", Georg Mohr in\n1673\ngave an exposition of the fact that it is possible to do all the Euclidean constructions of the first five books with a straight ruler and a compass with one single opening. We present the history about \"Euclides Curiosus\" and give all the necessary constructions.\nThe authors of\n[\n3\n]\nstate some good reasons why the small volume,\nGegenübung auf ein mathematisches Tractätlein Compendium Euclidis Curiosi\nⓉ\n(\nOn exercises on a mathematical tract: Compendium Euclidis Curiosi\n)\n, cannot have been written by Mohr himself\n(\nalthough Mohr is known to be the author of this compendium as we indicated above\n)\n. Therefore they argue that the\nGegenübung\ncannot be the missing third publication."
}