{
  "nome_completo": "George Barker Jeffery",
  "nome_curto": "George Jeffery",
  "ano_nascimento": "1891",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jeffery/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "George Jeffery\nwas the son of George Jeffery, a corresponding confidential clerk and Elizabeth McDonald McKenzie. George Jeffery Sr had been born in Southwark, Surrey, England in about\n1865\n. Elizabeth McKenzie had been born in Kilmaurs, Ayr, Scotland on\n16\nMay\n1866\n. George and Elizabeth married in\n1889\nin St Saviour, Southwark, London. At the time of the\n1891\ncensus the couple were living at\n6\nBrook Street, Lambeth in the same house as David and Elizabeth McKenzie, Elizabeth McDonald McKenzie's parents. At that time David McKenzie, aged\n43\n, is a waterproofers salesman and his wife, Elizabeth McDonald Sellars, is the manageress of a bakery. George Barker Jeffery, the subject of this biography, was born shortly after the\n1891\ncensus. He was the first of his parents' four children, born in Lambeth, London. His siblings were Elizabeth McDonald McKenzie Jeffery\n(\nborn about\n1893)\n, David Leslie Geoffrey Jeffery\n(\nborn about\n1895)\n, and Mary Christina Jeffery\n(\nborn about\n1897)\n. Let us note here that Elizabeth McDonald McKenzie Jeffery, also born in Lambeth, became a clerk for a Mechanical Engineering company while David Leslie Geoffrey Jeffery, again born in Lambeth, became a clerk for a shipping agency. Mary Christina Jeffery was born in Brixton, London. The family were Quakers.\nGeorge Barker Jeffery was educated at Strand School, a boys grammar school in the basement of King's College in London's Strand, and at Wilson's Grammar School, Camberwell. This school has a long history being founded in Camberwell in\n1615\n. It was forced to close, however, as a result of a financial scandal in\n1845\nbut was rebuilt on a different site in Camberwell, opening in\n1883\n. After schooling, Jeffery entered University College London in\n1909\nwithout a scholarship but his work in mathematics was so outstanding that at the end of his first year he was elected to a scholarship. He did one years teacher training at the London Day Training College in\n1911\n, where he was influenced by Thomas Percy Nunn\n(1870\n-\n1944)\n, but he was already undertaking research and his first paper\nOn a form of the solution of Laplace's equation suitable for problems relating to two spheres\nwas read to the\nRoyal Society\nin June\n1912\n. At the London Day Training College, he met Elizabeth Schofield whom he later married\n(\nsee below\n)\n. He returned to University College where, after the award of his B.Sc. in\n1912\n, he became a research student and assistant to\nLouis Napoleon George Filon\n.\nHe continued to undertake research at University College until World War I when\nFilon\nwas called up for active service and Jeffery became head of the Applied Mathematics Department. As a Quaker, however, he became a conscientious objector and was not allowed to continue to teach at the College. In\n1915\nJeffery married Elizabeth Schofield in Blackburn, Lancashire; they had one son and two daughters. He was imprisoned for a short time in\n1916\nfor his views as a conscientious objector but after a while he was released and allowed to undertake 'work of national importance'. After the war ended he continued the war work until\n1919\n, after which he returned to University College again being\nFilon\n's assistant.\nIn\n1922\nhe was appointed Professor of Mathematics at King's College London. He gave the Inaugural Lecture on\n9\nOctober\n1922\nentitled\nEinstein's Theory of Relativity\n. He began his lecture as follows:-\nAs I conceive the office of a professor, it is that he should stand before his students as the living representative of those great men who in the past have laboured in that branch of human knowledge which he has made his own; that by means of a reverent yet unflinching criticism he should strive to reveal the workings of these master minds, to the end that he may impart, not mere knowledge, but that more precious gift - the art of acquiring knowledge, the art of discovery. If we approach our task in this spirit, we shall find the key to the solution of much that is difficult and perplexing in our present knowledge, and the inspiration which will lead us on to further discoveries.\nIt seems natural, therefore, that I should seek to illustrate this theme by means of the subject which throughout my mathematical career has inspired me more than any other branch of mathematics or physics into which my work has led me, and the subject which, as far as one may venture to prophesy as to the future course of scientific thought, seems marked out for great advances in the immediate future.\nFor further details of Jeffery's Inaugural Lecture, see\nTHIS LINK\n.\nJeffery had begun publishing on relativity in\n1920\nwith the paper\nOn the path of a ray of light in the gravitation field of the sun\n, followed by\nThe gravitational field of a particle on Einstein's theory\n(1921)\n, and\nThe identical relations in Einstein's theory\n(1922)\n. In\n1923\n, along with Wilfrid Perrett\n(1873\n-\n1946)\n, he published\nSidelights on Relativity\n, an English translation of the two essays\nEther and Relativity\n(1920)\nand\nGeometry and Experience\n(1921)\nby\nAlbert Einstein\n. In the same year the same two translators published\nThe Principle of Relativity\n, consisting of translations of eleven papers by\nH A Lorentz\n,\nA Einstein\n,\nH Minkowski\nand\nH Weyl\n. Reviewing\nThe Principle of Relativity\n,\nH T H Piaggio\nwrites\n[\n12\n]\n:-\nProf Jeffery and Dr Perrett have rendered a great service to students of the theory of Relativity by giving a translation into English of eleven original papers by\nEinstein\nand others. These papers enable us to trace the origin of the theory and the continual changes during its development.\nNow working on relativity at this time must have caused him some problems since, in Jeffery's own words,\nFilon\nbelieved it rested\n[\n6\n]\n:-\n... on too slender an experimental basis. He regarded it as a kind of pure mathematics that had drifted out of touch with reality.\nIn\n1924\nJeffery published the book\nRelativity for Physics Students\n. This book was aimed at students with a good mathematical background, but was not aimed at experts on relativity. The first chapter was an Introduction consisting of Jeffery's Inaugural Lecture mentioned above.\nYou can read extracts from reviews of this book at\nTHIS LINK\n.\nJefferey only held the professorship at King's College, London for two years since he was appointed Astor Professor of Pure Mathematics at University College in\n1924\n.\nE C Titchmarsh\nwas already an assistant at University College and he became Jeffery's assistant on his appointment to the chair.\nAlthough appointed at a chair of Pure Mathematics, Jeffery's work was on the applications of mathematics, in particular he worked on hydrodynamics, viscous liquids and elasticity. He made effective use of\nWhittaker\n's general solution to\nLaplace\n's equation which\nWhittaker\nhad found in\n1903\n. He introduced special types of harmonic functions for problems about the capacity for two charged conducting spheres. For example, after his first paper of\n1912\nmentioned above, his next five publications appeared in\n1915\n:\nOn the steady rotation of a solid of revolution in a viscous fluid\n;\nOn spheroidal harmonics and allied functions\n;\nThe two-dimensional steady motion of a viscous fluid\n;\nOn self-intersecting lines of force and equipotential surfaces\n; and\nThe equations of motion of a viscous fluid\n. He had a reputation as a fine teacher and a skilled administrator. His chair of pure mathematics was, however, a little unfortunate as Jeffery had to leave many parts of that subject to his assistants. He made little research contribution to pure mathematics after his appointment and his excellent work in applied mathematics also ended rather soon after his appointment to the chair.\nNow when he was appointed as Professor of Pure Mathematics at University College,\nFilon\nwas still the Professor of Applied Mathematics there. One senses a certain difficulty between the two, particularly when Jeffery's obituary of\nFilon\nstates\n[\n6\n]\n:-\n[\nFilon\n]\nwas vigorous and combative and, by reason of the restraint of a certain shyness, his combats usually began with explosive force.\nJeffery was elected to the\nRoyal Society\nin\n1926\n, about the time his research papers dried up.\nE C Titchmarsh\nwrites\n[\n14\n]\n:-\nIt may be that his appointment to a chair of pure mathematics was unfortunate. He was entirely competent to act as a director of the teaching and organisation of a department of pure mathematics. As his Presidential Address to the\nLondon Mathematical Society\nshows, he had thought deeply on the problems of teaching, and on what should be taught in such a department. However at this time graduate students were beginning to come along with problems in pure mathematics with which Jeffery was not able to deal, and he was compelled to leave much of this work to his assistants. It may also be said that though he had been very successful in the rather limited field of exact solutions of physical problems, he never advanced into the wider fields of approximation in which so much has since been achieved. He was also becoming increasingly absorbed in the problems of college and university administration. At any rate he never made any further original contribution to pure mathematics, and even in applied mathematics his original work came to an early end.\nHe was Swarthmore Lecturer to the Society of Friends\n(\nQuakers\n)\nin\n1934\ndelivering the lecture\nChrist, Yesterday And Today\nto the London Yearly Meeting. In\n1935\nhe became a member of the Senate of London University. From\n1935\nto\n1937\nhe was President of the\nLondon Mathematical Society\ndelivering the Presidential Address\nMathematical studies in the modern universities.\nHe began the address as follows:-\nIn addressing the Society at the conclusion of his term of office the President usually has no difficulty in finding in his own contributions to mathematical research some topic of sufficient importance and general interest to provide the theme of his discourse. There is another custom, more prevalent in the early period of the history of the Society but never for very long in abeyance, under which the President speaks on some more general aspect of our common concern for the promotion of mathematical studies in a way that would not be appropriate in an ordinary communication to the Society. It is the latter alternative that I choose, and I will speak more particularly as one who, for a number of years, has been concerned with the conduct and development of a school of pure mathematics outside Oxford and Cambridge.\nFrom\n1937\nto\n1938\n, Jeffery was President of the London Society for the Study of Religion and was a Vice-President of the\nRoyal Society\nfrom\n1938\nto\n1940\n. He was a long time enthusiast for the\nMathematical Association\nand was elected President of the London Branch. In this role he delivered his Presidential Address\nMathematics in School and University\non\n15\nOctober\n1938\n.\nYou can read a version of this address at\nTHIS LINK\n.\nTen years later Jeffery was President of the\nMathematical Association\nand delivered this Presidential Address\nMathematics as an Educational Experience\nin January\n1948\n.\nYou can read a version of this address at\nTHIS LINK\n.\nIn\n1939\nhe became Chairman of the Matriculation and School Examination Council of London University. In\n1948\nhe became Chairman of the South-West Middlesex Hospital Management Committee.\nIt looking at some of the roles that Jeffery filled we have moved from the mid\n1930\ns to the mid\n1940\ns without saying a little about his contribution during World War II. As early as\n1938\nJeffery was involved in discussions with Bangor University to arrange for the evacuation of some students from University College London in the event of war. In\n1939\nJeffery, with around\n200\nstudents and\n17\nteaching staff, arrived in Bangor. He had been appointed pro-provost of the evacuated students and his expertise in diplomacy helped to make the move both happy and profitable\n[\n15\n]\n:-\nIn the\n1940\ns Bangor University was much smaller than it is now, and some university buildings were commandeered for war uses. Finding suitable premises for all of the University College London students was a problem. Initially science students made do with a laboratory bench in a room in the university's main building, but from\n1942\nthere were facilities at\n164\nHigh Street, previously a bicycle shop.\nThe article\n[\n13\n]\nstates:-\nTaking a keen interest in student life,\n[\nJeffery\n]\nlaboured to preserve the traditions of the College and to weld the students into a corporate whole. On returning to London in\n1944\n, he took the lead in instituting student hostels.\nIn\n1945\nJeffery resigned his position as Astor Professor of Pure Mathematics at University College and\nHarold Davenport\nwas appointed to fill the vacancy. Jeffery was appointed as Director of the Institute of Education, University of London. This had been founded in\n1932\nas the successor to the London Day Training College which he had himself attended while an undergraduate.\nTitchmarsh\nwrites in\n[\n14\n]\n:-\nIn\n1945\nthe University of London accepted responsibility for the training of teachers in this area. It submitted a draft scheme as a basis for further discussion, and the task of giving this scheme a definite and practicable form therefore fell largely upon Jeffery. The elaborate shaping of the London Area Scheme was almost entirely his work, and in the reconciling of the many varied interests involved he had a long and formidable task. He had a vision of a more comprehensive Institute of Education in which all the constituent colleges and all the teachers in them should have some responsible share. In getting such a vision on to paper Jeffery was at his best. He saw the need for a definite plan to put before the Senate so that the university might know precisely to what it was committed. He produced the plan in two days of concentrated work, and it has never since needed substantial alteration. His sense of dignity and respect for teaching forbade the casual entry of all these colleges into the ambit of the university. A full scale Inauguration Ceremony was staged. The Chancellor of the University, the Earl of Athlone, presided, and the Minister of Education and many other notables were present. Jeffery made a long speech in which he reviewed the history of all the colleges and expressed his hopes for the future of the whole organization. This must have been one of the proudest days of his life.\nIn his role as Director of the Institute of Education, University of London, he was involved in an effort to improve education in West Africa. He made visits in\n1949\nto Nigeria, the Gold Coast, Sierra Leone and the Gambia meeting groups of teachers and the heads of schools. He wrote a report in March\n1950\nrecommending a proposal for a West African Examination Council. The success of his mission led to him being asked by the Secretary of State to make a second visit of six months to West Africa in\n1951\nas the head of a study group. His report on this mission became part of a broader report entitled\nAfrican education, a study of educational policy and practice in British tropical Africa\n(1953)\n.\nIt was not only to Africa that he made visits in the\n1950\ns, for he was also invited to be part of a group sent to the Soviet Union to study school education and he visited Moscow, Leningrad and Baku.\nJeffery had rather unusual hobbies being an expert cabinet maker and later in life he became and expert silversmith registering his own hall-mark with the Goldsmiths' Company. In\n1952\nhe became Dean of the College of Handicraft and it was while driving home from the College's annual conference in\n1957\nthat he suffered a heart attack and died suddenly."
}