{
  "nome_completo": "Johann Georg Zehfuss",
  "nome_curto": "Georg Zehfuss",
  "ano_nascimento": "1832",
  "ano_morte": "1901",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zehfuss/",
  "lugar_nascimento": "Darmstadt-Bessungen, Darmstadt, Grand Duchy of Hesse, now Germany",
  "lugar_morte": "Frankfurt am Main, Germany",
  "biografia": "Georg Zehfuss\nwas the son of Johann Heinrich Zehfuss, Court Chamber-Registrar, and Susanne Magdalene Noack. He attended the Höhere Gewerbeschule Darmstadt, the higher trade school which was founded in\n1836\n. Günter Kern writes\n[\n2\n]\n:-\nAs Zehfuss himself admits, in his youth he showed more interest in languages and history than mathematics. At the age of fifteen, he entered the Polytechnic in Darmstadt, where he devoted himself to the study of mathematics, mechanics, physics and chemistry, encouraged by his teacher Strecker, but continued to attend classes in Latin, French as well as German history and literature.\nThe Polytechnic which Kern mentions in this quote is actually the Höhere Gewerbeschule Darmstadt which was renamed the Polytechnic School in\n1868\n, many years after Zehfuss had completed his studies there. At the Gewerbeschule, Zehfuss took classes in mathematics, technical drawing, physics and chemistry. He would also have learned practical skills required for the study of engineering topics. Among his teachers at this school we mention Edmund Külp\n(1800\n-\n1862)\nwho had been inspired to study mathematics by\nAdolphe Quetelet\nat the Athenaeum in Brussels. Külp had studied at the University of Heidelberg and was awarded a doctorate by the University of Giessen in\n1824\n. In his first years at the school Zehfuss was taught chemistry by Adolph Strecker\n(1822\n-\n1871)\nbut Strecker left in\n1846\nto take up an appointment at the University of Giessen. Another of Zehfuss's teachers was\nLudwig Christian Wiener\nwho was appointed to the Höhere Gewerbeschule in\n1848\nand taught physics, mechanics, hydraulics and descriptive geometry. Zehfuss graduated \"summa cum laude\" from the Höhere Gewerbeschule Darmstadt in\n1850\nand began his studies of mathematics at the Justus Liebig University of Giessen.\nAt the University of Giessen his main interest was the finite difference calculus, the results of which he summarised in the papers\nEinige Punkte über die Bestimmung der Constanten, welche bei Integration der endlichen Differenzengleichungen eingehen\nⓉ\n(\nSome points about the determination of the constants, which are included in the integration of finite difference equations\n)\n(1856)\nand\nÜber die Auflösung der linearen endlichen Differenzengleichungen mit variabeln Coefficienten\nⓉ\n(\nOn the resolution of linear finite difference equations with variable coefficients\n)\n(1858)\n.\nFor a list of Zehfuss's publications, see\nTHIS LINK\n.\nZehfuss completed his studies in Giessen on\n31\nJanuary\n1853\nwhen he obtained a doctorate and qualified to teach in a\nGymnasium\n. Although he performed well at Giessen, he did not find the university mathematically stimulating. After graduating, he obtained a temporary teaching position at the Gewerbeschule Darmstadt where he assisted his former teacher Edmund Külp teaching mathematics and physics from\n1853\nto\n1858\n.\nIn\n1857\nZehfuss\nhabilitated\nin mathematics and physics at the Ruprecht-Karls University of Heidelberg when he submitted his dissertation\nAbhandlung über einige mathematische Gegenstände. Inauguralschrift\nⓉ\n(\nTreatise on some mathematical objects. Preliminary work\n)\n. This dissertation was examined by\nOtto Hesse\nand\nGustav Kirchhoff\n;\nHesse\nevaluated the three mathematical parts of the dissertation while\nKirchhoff\nevaluated the one part related to physics.\nHesse\nwrote in his report that the dissertation dealt\n[\n2\n]\n:-\n... with difficult parts of the subject that are only accessible to the more advanced mathematicians.\nKirchhoff\nalso praised the physics section which was on the theory of thermodynamics.\nOtto Hesse\nhad been appointed to the chair of mathematics in University of Heidelberg in\n1856\n. He had made investigations into the theory of determinants while undertaking research on invariant theory and he inspired Zehfuss to work on determinant theory. Zehfuss published his first work on this topic in\n1858\nwith three papers appearing in that year, namely:\nÜber die Zeichen der einzelnen Glieder einer Determinanten\nⓉ\n(\nOn the Signs of the Individual Members of a Determinant\n)\n;\nÜber eine gewisse Determinante\nⓉ\n(\nOn a certain determinant\n)\n; and\nKommentar des Buches von Richard Baltzer \"Theorie und Anwendungen der Determinanten mit Beziehung auf die Orginalquellen\"\nⓉ\n(\nCommentary on Richard Baltzer's 'Theory and Applications of Determinants with Relation to the Original Sources'.\n)\n.\nIn the first of these papers Zehfuss proves a rule stated by\nGabriel Cramer\nabout the change in the signs of determinants. In the second of the papers he proves a rule about the tensor product of square matrices. Some authors believe that the tensor product, often called the\nKronecker\nproduct, should be called the 'Zehfuss product'. Note that we have made a subtle change from 'determinant' to 'matrix'. Early work on matrices was given in terms of determinants. See below for quotes about the 'Zehfuss product'. In the third of the papers he gives a detailed analysis of the book by Richard Baltzer. This book contains many illustrative references to the original sources of determinant theory and their applications.\nZehfuss worked as a\ndocent\nat the University of Heidelberg for four years between\n1857\nand\n1861\n. During these years he taught arithmetic, algebra and geometry, differential calculus, theory of definite integrals, elliptic functions, theory of higher equations, analytical geometry of the plane and of\n3\n-space, and analytical mechanics. On\n11\nJuly\n1861\nZehfuss married Louise Stein\n(1838\n-\n1911)\n.\nIn November\n1861\nRichard Dedekind\nleft the Polytechnikum in Zürich after three years there and took up a position in the Brunswick Polytechnikum. Zehfuss applied for the vacant position in Zürich but it was offered to\nRudolf Lipschitz\n. He, however, turned down the position and it was then offered to\nElwin Christoffel\n. Zehfuss, unable to find a permanent position in Germany, accepted the post of high school professor of mathematics and physics in Reval\n(\nnow Tallinn in Estonia\n)\nin September\n1860\n. He taught at the Cathedral School in Reval and while there his son Gustav Heinrich Julius Wilhelm Zehfuss was born on\n20\nAugust\n1862\n. However, Zehfuss was not very happy at the Cathedral School in Reval since he did not feel that this offered him the environment to reach his full potential as a researcher.\nIn February\n1862\nZehfuss applied for a position as a professor in mathematics or physics at the Polytechnic of Riga in Latvia. His application included recommendations from many mathematicians including\nLudwig Christian Wiener\n,\nFerdinand Minding\n,\nOsip Ivanovich Somov\n,\nOskar Schlömilch\n,\nOtto Hesse\n,\nGustav Kirchhoff\nand\nRichard Dedekind\n. Zehfuss was appointed and took up the position as professor of higher mathematics at the Polytechnic of Riga on\n9\nJanuary\n1863\n. This was a new institution and initially it struggled to establish itself. Zehfuss decided to return to Germany when offered a position at the Gewerbeschule in Frankfurt am Main. He took up the position in\n1864\n. At this school he taught algebraic analysis, trigonometry, the theory of higher degree equations, two dimensional analytic geometry, mechanics, differential and integral calculus, and three dimensional analytic geometry. His second child, a daughter Cornelia Charlotte Marie Auguste Mathilde Victoria Zehfuss, was born in Darmstadt on\n16\nSeptember\n1864\n. Zehfuss continued in his position at the Gewerbeschule in Frankfurt am Main for the rest of his career.\nZehfuss died in Frankfurt am Main on\n5\nMay\n1901\n. He was buried in Heidelberg in the mountain cemetery of Heidelberg-Südstadt. Also buried there are his wife Luisa, his daughter Cornelia\n(1864\n-\n1949)\n, and his daughter's husband Georg Anton Karch\n(1856\n-\n1937)\n.\nToday the name of Zehfuss is not known by many but those who are aware of his contributions almost certainly know him through his contribution to the tensor product of matrices. Without offering a definite opinion as to whether the '\nKronecker\nproduct' should be called the 'Zehfuss product' let us simply quote from a number of sources.\nAmy N Langville and William J Stewart write\n[\n6\n]\n:-\nThe operation defined by the symbol\n⊗\n\\otimes\n⊗\nwas first used by Johann Georg Zehfuss in\n1858\n. It has since been called by various names, including the Zehfuss product, the Producttransformation, the conjunction, the tensor product, the direct product and the\nKronecker\nproduct. In the end, the\nKronecker\nproduct stuck as the name for the symbol and operation,\n⊗\n\\otimes\n⊗\n.\nH Zhang and F Ding write\n[\n8\n]\n:-\nThe\nKronecker\nproduct, named after German mathematician\nLeopold Kronecker\n, is very important in the areas of linear algebra and signal processing. In fact, the\nKronecker\nproduct should be called the Zehfuss product because Johann Georg Zehfuss published a paper in\n1858\nwhich contained the well-known determinant conclusion,\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nn\n∣\nB\n∣\nm\n| \\bf{A} \\otimes  \\bf{B} | = | \\bf{A} |^{n} | \\bf{B} |^{m}\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nn\n∣\nB\n∣\nm\nfor square matrices\nA\n\\bf{A}\nA\nand\nB\n\\bf{B}\nB\nwith order\nm\nm\nm\nand\nn\nn\nn\n.\nRoger A Horn and Charles R Johnson write\n[\n1\n]\n:-\nSome historians of mathematics have questioned the association of the\n⊗\nproduct with\nKronecker\n's name on the grounds that there is no known evidence in the literature for\nKronecker\n's priority in its discovery or use. Indeed, Sir\nThomas Muir\n's authoritative history\n[\n3\n]\ncalls\nd\ne\nt\n(\nA\n⊗\nB\n)\ndet (A \\otimes  B)\nd\ne\nt\n(\nA\n⊗\nB\n)\nthe 'Zehfuss determinant' of A and B because the determinant identity\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nn\n∣\nB\n∣\nm\n| A \\otimes  B | = | A |^{n} | B |^{m}\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nn\n∣\nB\n∣\nm\nappears first in an\n1858\npaper of Johann Georg Zehfuss\n(\n\"Über eine gewisse Determinante\nⓉ\n(\nOn a certain determinant\n)\n,\nZeitschrift für Mathematik und Physik\n3\n(1858)\n,\n298\n-\n301\n\"\n)\n. Following\nMuir\n's lead, a few later authors have called A\n⊗\nB the 'Zehfuss matrix' of A and B, for example \"\nD E Rutherford\n,\nOn the Condition that two Zehfuss matrices be equal\n, Bull. Amer. Math. Soc.\n39\n(1933)\n,\n801\n-\n808\n\", and \"\nA C Aitken\n,\nThe normal form of compound and induced matrices\n, Proc. London Math. Soc\n38\n(2)\n(1935)\n,\n354\n-\n376\n\". However, a series of influential texts at and after the turn of the century permanently associated\nKronecker\n's name with the\n⊗\nproduct, and this terminology is nearly universal today. For further discussion\n(\nincluding claims by others to independent discovery of the determinant result\n)\nand numerous references, see \"H V Henderson, F Pukelsheim and S R Searle,\nOn the history of the Kronecker product,\nLinear and Multilinear Algebra\n14\n(2)\n(1983)\n,\n113\n-\n120\n\".\nHarold V Henderson, Friedrich Pukelsheim and Shayle R Searle write\n[\n5\n]\n:-\nOur story begins with one Johann Georg Zehfuss\n(1832\n-\n1901)\nat the University of Heidelberg who, according to biographical notes by Poggendorf\n(1863\n,\n1898)\n, published papers on determinants until at least\n1868\nbefore moving to studies in astronomy. In particular, Zehfuss\n(1858)\ncontains the determinant result\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nb\n∣\nB\n∣\na\n| A \\otimes  B | = | A |^{b} | B |^{a}\n∣\nA\n⊗\nB\n∣\n=\n∣\nA\n∣\nb\n∣\nB\n∣\na\nfor square matrices A and B of order a and b, respectively. Zehfuss wrote in terms of determinants rather than matrices, following the then customary practice of employing the term 'determinant' both for what we now call a square matrix as well as for its determinant. ... Unfortunately, the Zehfuss\n(1858)\ndeterminant result seems to have been overlooked for more than fifty years, until its rediscovery by\nMuir\n(1911\n, reprinted in\n[\n3\n]\n)\nwho claims it for Zehfuss and accordingly calls\n∣\nA\n⊗\nB\n∣\n| A \\otimes  B |\n∣\nA\n⊗\nB\n∣\nthe Zehfuss determinant of A and B. Others, notably\nRutherford\n(1933)\n, and\nAitken\n(1935)\nand his student\nLedermann\n(1936)\n, following\nMuir\n's lead, have gone further and called A\n⊗\n\\otimes\n⊗\nB the Zehfuss matrix of A and B.\nAitken\n's adoption of this name is of interest in light of\nLedermann\n's later\n(1968)\ncomment that\nAitken\n\"was particularly fond of stressing the claims of lesser known mathematicians of former times for discoveries erroneously attributed to their more famous contemporaries. Many of his historical references were gleaned from Sir\nThomas Muir\n's monumental work on determinants, for which\nAitken\nhad a profound admiration.\"\nAlthough Zehfuss is best known for his contributions to determinants, he made other contributions to mathematics in difference equations, differential and integral calculus and combinatorics. Later in his career, however, his attention turned more towards physics and astronomy. He actively participated in the annual meetings of the\nGesellschaft Deutscher Naturforscher und Ärzte\nⓉ\n(\nSociety of German Naturalists and Doctors\n)\n, especially when the meetings were in Frankfurt am Main or in the vicinity of the city. He also participated in meetings of the\nWetterauischen Naturforschenden Gesellschaft zu Hanau\nⓉ\n(\nWetterau Society for the natural history of Hanau\n)\n. He lectured to these societies on determinants, but also showed a model of a Riemann surface and gave a lecture \"On a Possible Cause of the Delay of Earth Rotation.\" In this lecture he showed\n(\nsee\n[\n7\n]\n)\n:-\n... that magnetic forces which the heavenly bodies mutually exert cannot effect this delay, whereas the constant magnetic field in which the planets move can cause a change in precession which could lead to an explanation of the observation.\nOther lectures related to astronomy included \"On meteorites\" delivered in\n1870\nand \"Some explanations of the appearance of the Northern Lights\" in\n1871\n.\nHe wrote the book\nDie Pneumatische Canalisation beleuchtet mit Rücksicht auf Gesundheitspflege, Land- und Volkswirthschaft\nⓉ\n(\nThe Pneumatic sewage system effects on health care, agriculture and economics\n)\nwhich was translated into English by D Coar of Philadelphia, Pennsylvania, USA and appeared as\nThe Pneumatic Sewage System treated with reference to Public Health, Agriculture and National Economy\npublished by Wilhelm Hassel in Cologne in\n1869\n. The book commences with an historical introduction in which Zehfuss refers to sewage systems mentioned in the Bible, those constructed by the Hindus, the ancient Egyptians, the Babylonians, and the Romans in\n600\nB.C. A patent was sought in the United States for the sewage system Zehfuss describes in the book and he received a letter of patent from the United States Patent Office in\n1870\n(\nletter of patent No.\n100\n,\n347)\n.\nFinally, let us note that prior to the appearance of\n[\n7\n]\n, few biographical details concerning Zehfuss were readily available. Much of the biographical information in our biography above comes from Walter Strobl's paper."
}