{
  "nome_completo": "Georgii Yurii Vasilovich Pfeiffer",
  "nome_curto": "Georgii Vasilovich Pfeiffer",
  "ano_nascimento": "1872",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pfeiffer/",
  "lugar_nascimento": "Sokyryntsi, Chernihiv Oblast, Ukraine, Russian Empire",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Georgii Vasilovich Pfeiffer\n's date of birth is certainly in\n1872\nbut there seems to be some uncertainty regarding the month. Some obituaries give the month as October, some give November, while others give December. The uncertainty of the day relates to the calendar in operation at the time so some give the\n11\nth\nday of the month while others give the\n23\nrd\nday or\n24\nth\nday. The date of birth we have given,\n24\nOctober, is the date which is carved on his tombstone. Sokyryntsi, where he was born, is a small village in beautiful surroundings with a lake and parkland. He began his education there but to attend the\nGymnasium\nhe had to go to Pryluka, the regional centre of the Chernihiv region. This town, also known as Pryluky, is about\n28\nkm west of Sokyryntsi and is about\n120\nkm east of Kiev. Pfeiffer entered the Pryluka Gymnasium, a school which had been founded in\n1874\nand was directed by Feodosii Voronoy, the father of the mathematician\nGeorgy Fedoseevich Voronoy\n. In fact, when Pfeiffer entered the Gymnasium\nGeorgy Voronoy\nwas still a pupil there showing his brilliance by publishing a paper while still at the Gymnasium.\nAfter graduating from the Pryluka Gymnasium, Pfeiffer entered the Faculty of Physics and Mathematics of Kiev University. The university had been founded in\n1834\nand had, from its foundation, a strong school of mathematics. Among Pfeiffer's lecturers at Kiev University we mention\nMikhail Egorovich Vashchenko-Zakharchenko\n,\nBoris Yakovlevic Bukreev\nand, in particular, Vasilii Petrovich Ermakov\n(1845\n-\n1922)\n. Pfeiffer graduated from the University of Kiev in\n1896\nand was then appointed as a secondary school mathematics teacher in a Gymnasium in Kiev. He was appointed to the Kiev Polytechnic Institute in\n1899\nand he taught there until\n1909\n. After this he spent two years\n1909\n-\n1911\nteaching at the University for Women in Kiev. He defended his doctoral thesis on problems of the theory of algebraic surfaces in\n1911\n. While holding the appointment at Kiev Polytechnic Institute, he was also appointed as an assistant professor of mathematics at the University of Kiev in\n1900\nand he taught there until his death in\n1946\n. At the University, he was promoted to extraordinary professor in\n1909\nand then to full professor in\n1911\n. In the following year he was made chairman of the Department of Analysis and, also in\n1912\n, he became chairman of the Academic Council of the Faculty of Physics and Mathematics. He continued to hold this latter post until he left Kiev in\n1941\n. In Kiev, Pfeiffer lived in an apartment in a complex of residential buildings on Khmelnitsky Street. The building were built in an Art Nouveau style. He lived at number\n59\n, in apartment number\n5\non the third floor.\nElected to the\nUkrainian Academy of Sciences\nin\n1920\n, Pfeiffer chaired the Commission on Pure Mathematics from that time. Pfeiffer was also attached to the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin Kiev and served as Director during two periods, namely\n1934\nto\n1941\nand again from\n1944\nuntil his death in\n1946\n. The gap in his working in Kiev was a result of World War II. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Kiev and Pfeiffer continued his work there. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. Kiev was soon threatened by the advancing German armies\n(\nthey entered the city on\n19\nSeptember\n1941)\nand the Ukrainian Academy of Sciences was relocated to the city of Ufa. In the three years\n1941\n-\n44\n, Pfeiffer was in Ufa, the capital of the Bashkortostan republic in western Russia. In Ufa, Pfeiffer was Director of the Institute of Mathematics and Physics. By the end of\n1943\nSoviet troops had liberated Kiev and in the following year Pfeiffer returned to the city when the\nUkrainian Academy of Sciences\nreturned. When he returned to Kiev he was made head of the Department of Ordinary Differential Equations at the University.\nPfeiffer's first research was on the problem of solving equations by radicals, and he next looked at\nalgebraic geometry\n. V O Volkova describes Pfeiffer's papers in this area in\n[\n6\n]\nwriting:-\nGeorgii Vasil'evich Pfeiffer\n(1872\n-\n1946)\n, professor at Kiev University, is known as a specialist in the field of integration of differential equations and systems of\npartial differential equations\n. However, at the beginning of his career he was interested in algebraic geometry, especially in the study of singular points of algebraic curves and surfaces. This period of his activity is well known neither to specialists in geometry nor to historians of mathematics.\nAs this quote indicates, however, his most important contributions involve work on partial differential equations following on from the methods developed by\nLie\nand\nLagrange\n. Summarising this area of Pfeiffer's work in\n[\n3\n]\n, Koval'chuk describes:-\n... some work of the Ukrainian mathematician G V Pfeiffer , showing how to find integrals of a general system of partial differential equations by using sequential complete systems instead of passing to Jacobian systems. Pfeiffer also constructed all the\ninfinitesimal\noperators of a system of equations.\nKoval'chuk explains how Pfeiffer's methods greatly expanded the class of integrable systems, but have been neglected over the past half-century as functional-analytic methods have been in fashion. For example, he published three papers in\n1946\n:\nLa réception et l'intégration par la méthode spéciale des équations, systèmes d'équations semi-Jacobiens, des équations, systèmes d'équations semi-Jacobiens généralisés aux dérivées partielles du premier ordre de plusieurs fonctions inconnues\nⓉ\n(\nReception and integration by the special method of equations, semi-Jacobians systems of equations, equations, semi-Jacobians generalized systems of equations with partial derivatives of the first order of several unknown functions\n)\n;\nSur les équations, systèmes d'équations semi-jacobiens, semi-jacobiens généralisés aux dérivées partielles de premier ordre à plusieurs fonctions inconnues\nⓉ\n(\nOn the equations, semi-Jacobian equation systems, semi-Jacobians generalized partial derivatives of the first order with several unknown functions\n)\n; and\nSur les équations, systèmes d'équations semi-mixtes aux dérivées partielles du premier ordre à plusieurs fonctions inconnues\nⓉ\n(\nOn the equations, semi-mixed systems of equations with partial derivatives of the first order with several unknown functions\n)\n. The first of these was reviewed by Morris S Knebelman who writes:-\nAs the title indicates, the paper is concerned with a special method for solving semi-Jacobian systems of partial differential equations. Such a system arises from a linear partial differential equation of the first order containing one or more parameters whose elimination leads to the Jacobian system of equations which are nonlinear. Three illustrative examples are worked out, but the validity of the stated \"rules'' is not clear.\nReviewing the third of these,\nDirk Struik\nwrites:-\nThe author sketches two rules for integration of systems of \"semi-mixed'' partial differential equations of the first order with several unknown functions.\nThe second paper was also reviewed by\nStruik\nwho writes:-\nThe author sketches two ways of applying his method of integration\n[\nfirst published in\n1923]\nto systems of generalized semi-Jacobian equations of the first order with several unknown functions.\nIn total, Pfeiffer published\n250\nscientific papers in several languages including Ukrainian, Russian, French and German. He also published books such as his\n346\n-page\n1937\nbook\nIntegration of differential equations\n. He also used his language skills to translate books such as the\n1891\nFrench text by\nÉdouard Goursat\nLeçons sur l'intégration des équations aux dérivées partielles du premier ordre\nⓉ\n(\nLessons on the integration of partial differential equations of the first order\n)\nwhich appeared in Ukrainian in\n1940\n. He participated in the International Congress of Mathematicians in Rome\n(\nin April\n1908)\n, Bologna\n(\nin September\n1928)\n, and Zürich\n(\nin September\n1932)\n. He also attended a mathematical conference in Moscow\n(1929)\n, the first All Union Congress of Mathematicians in Kharkov\n(\nJuly\n1930)\nand the second All Union Congress of Mathematicians in Leningrad\n(\nJune\n1934)\n.\nPfeiffer was a great connoisseur of mathematical literature in many different areas of mathematics showing himself to be a scholar with deep feelings and high standards in everything he did. After his death he was buried in the Lukyanovsky cemetery in Kiev. In\n2006\n, sixty years after his death, commemorative events were held."
}