{
  "nome_completo": "Georg Wilhelm Scheffers",
  "nome_curto": "Georg Scheffers",
  "ano_nascimento": "1866",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scheffers/",
  "lugar_nascimento": "Altendorf (near Holzminden), Germany",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Georg Scheffers\n' father was a professor at the Academy of Art in Leipzig. Scheffers studied mathematics and physics at the University of Leipzig from\n1884\nto\n1888\n. When Scheffers started his studies at Leipzig he was taught by\nFelix Klein\n, the professor of mathematics, but Klein left to take up a chair in Göttingen in\n1886\n.\nFriedrich Engel\n, who had been a student at Leipzig, returned there as a lecturer in\n1885\nand taught Scheffers.\nSophus Lie\nwas appointed to Leipzig to succeed\nKlein\nand immediately had a strong influence on Scheffers.\nLie\nacted as Scheffers' thesis advisor when he began to undertake research on plane contact transformations in\n1888\n. He was awarded his doctorate in\n1890\nfor his thesis\nBestimmung einer Classe von Berührungstransformationsgruppen des dreifach ausgedehnten Raumes\nⓉ\n(\nDetermining a class of contact transformation groups of triply-extended space\n)\n.\nLie\ncontinued to advise Scheffers as he continued to work on plane contact transformations and complex number systems for his\nHabilitation\nthesis which he submitted to Leipzig in\n1891\n.\nHe lectured at the University of Leipzig from\n1891\nuntil\n1896\nwhen he was appointed to the Technische Hochschule in Darmstadt. Appointed initially as an extraordinary professor in\n1896\n, he taught at Darmstadt for eleven years becoming a full professor there in\n1900\n. In\n1907\nhe was appointed to the Technische Hochschule in Charlottenburg, a town near Berlin named after Sophie Charlotte the wife of Frederick I, King of Prussia. Scheffers, who had succeeded Guido Hauck, held the chair of mathematics there until he retired in\n1935\n. Before this, however, in\n1920\n, Charlottenburg was incorporated into Berlin becoming an area of the city. Burau writes\n[\n1\n]\n:-\nScheffers' favourite field of study was geometry and, more specifically, the\ndifferential geometry\nof intuitive space. In this area he was a master at discovering many properties of particular curves and surfaces and their representations.; he also possessed a gift for giving an easily understandable account of them - although in a much wordier style than is now customary. His exceptional talent for vividly communicating material is also apparent in a later work on the grids used in topographic maps and stellar charts.\nDuring the period that Scheffers worked with\nLie\nin Leipzig he used his skill as a writer to assist in publishing\nLie\n's important contributions. In\n1891\n, he published\nVorlesungenuber Differentialgleichungen mit bekannten infinitesimalen Transformationen\nⓉ\n(\nLectures on differential equations with known infinitesimal transformations\n)\nand, two years later\nVorlesungenuber continuierliche Gruppen mit geometrischen und anderen Anwendungen\nⓉ\n(\nLectures on continuous groups with geometric and other applications\n)\n. These were substantial accounts of\nLie\n's basic ideas in which Scheffers decided that it was more important to explain the ideas in a meaningful way even if this meant that the account lacked absolute rigour as a result. The first volume of an intended two volume collaboration between\nLie\nand Scheffers was published in\n1896\nentitled\nGeometrie der Beruhrungstransformationen\nⓉ\n(\nGeometry of contact transformations\n)\n. However, in the year this volume was published, Scheffers moved to Darmstadt and, although the two authors had done some preparatory work on the second volume, they made no further progress and it was never published. By this time\nLie\n's health was also deteriorating and he left Leipzig for Christiania in\n1898\n, dying early in the following year.\nEven after\nLie\n's death Scheffers produced work which had been clearly strongly influenced by\nLie\n. For example Scheffers' most important work was a paper in\n1903\non\nAbel\n's theorem which still showed\nLie\n's influence.\nLie\nhad discovered and started an investigation of, investigated algebraic translation surfaces that can be generated in four different ways. He had published his results on their general properties and analytic representation. Scheffers gave a historical introduction to this topic in his\n1903\npaper, where he also continued development of the theory. Before this paper appeared, however, Scheffers had published one of his most important textbooks, namely the two volume work\nAnwendung der Differential- und Integralrechnung auf Geometrie\nⓉ\n(\nApplications of differential and integral calculus in geometry\n)\n. The first volume, subtitled\nEinführung in die Theorie der Kurven in der Ebene und im Raume\nⓉ\n(\nIntroduction to the theory of curves in the plane and in space\n)\n, appeared in print in\n1901\n, while the second volume, subtitled\nEinführung in die Theorie der Flachen\nⓉ\n(\nIntroduction to the theory of surfaces\n)\n, appeared in the following year. In\n1908\nand\n1909\n,\nEduard Study\n, the Professor of Mathematics at Bonn, published two papers in which he criticised the standard treatment of differential geometry in general, and Scheffers' treatment in particular. Scheffers reacted very positively to this criticism and incorporated many improvements into his treatment which he published as a second edition in\n1910\nand\n1913\n.\nDirk Struik\n, reviewing the third edition, published in\n1922\n-\n1923\n, writes\n[\n2\n]\n:-\nThis third edition has not many points of departure from the second. Scheffers' book remains one of the best textbooks on the subject; it deals with the material in a very pedagogic way and illustrates it with many interesting examples. Complex values of the coordinates are treated carefully. The point of view of invariants is emphasized ... Scheffers' book contains many historical footnotes. These are sometimes very interesting.\nOne of Scheffers most important textbooks was his revision of\nSerret\n's famous book\nCours de calcul différentiel et intégral\nⓉ\n(\nCourse of differential and integral alculus\n)\npublished in the\n1870\ns. It was not this original edition which Scheffers revised, rather it was the second edition of\n1897\n-\n99\nof the German translation which was first published in\n1884\n. Scheffers' edition, the first volume of which was published in\n1907\n, was almost a new book:-\nThis third edition, by Georg Scheffers, is not only revised, but entirely rewritten and in part rearranged. All the figures have been drawn anew and many new figures added. The theorems have been stated more clearly and more use has been made of italics to make them stand out from the body of the text. Many more references to previous paragraphs have been inserted.\nTo illustrate the changes Scheffers introduced was quote a few examples given in the review:-\nThe articles on number have been remodeled according to\nDedekind\n's theory and the proofs of the theorems on continuous functions and on the convergence of series have thus been given a real backbone. A new chapter on implicit functions, with a thorough discussion of the functional\ndeterminant\nand of the independence of functions and of equations has been inserted. ... The chapter on the complex variable has been entirely rewritten and shortened ...\nAs the reviewer notes:-\nThis calculus is a geometer's calculus. Over three hundred of the twelve hundred pages are devoted to applications to geometry. With the exception of the paragraphs on center of gravity, there are practically no references to mechanics or physics. All the problems given are worked out in detail. In fact, detail is one of the features of the work. The reviser rejoices in saying that as far as possible he has eliminated from the text such phrases as \"the reader will easily see\", \"the proof is left to the student.\"\nTo give another example of one of Scheffers' excellent textbooks, he published\nLehrbuch der Mathematik: Eine Einfuhrung in die Differential-und Integralrechnung und in die Analytische Geometrie\nⓉ\n(\nTextbook of Mathematics: An introduction to the differential and integral calculus in analytic geometry\n)\nin\n1905\n. H Betz, reviewing the\n6\nth\nedition of\n1925\nfor\nThe American Mathematical Monthly\nwrites:-\nIt was written, as\n[\nScheffers\n]\nsays, for students of the natural sciences and engineering, who wish to acquire a sound working knowledge of higher mathematics by themselves. And it may be doubted whether any book could fulfil this avowed purpose more completely, especially if used by students as mature as those usually found in the first semesters of continental universities and technical schools.\nScheffers wrote many other books. For example\nLehrbuch der Mathematik für Studierende der Naturwissenschaften und der Technik\nⓉ\n(\nTextbook of mathematics for students of science and arts\n)\n(1916)\nwhich was in its eighth edition by\n1945\n.\nThe Scientific Monthly\n, reviewing this eighth edition said:-\nThis book provides an unusually complete course in calculus for the sincere student. It is written with great care and clarity and contains many applications to physics and engineering.\nWe should also mention Scheffers' contribution\nBesondere transzendenten Kurven\nⓉ\n(\nSpecial transcendent curves\n)\nwhich appeared in\nEnzyklopädie der mathematischen Wissenschaften\nⓉ\n(\nKlein's Encyclopedia\n)\nin\n1903\n, and another of his books which was\nLehrbuch der Darstellenden Geometrie\nⓉ\n(\nTextbook of Descriptive Geometry\n)\n(1919)\n. There was also\nWie Findet Und Zeichnet Man Gradnetze Von Land- und Sternkarten?\nⓉ\n(\nHow one finds and draws grids for country and star charts?\n)\n, his\n98\npage book on the grids used in topographic maps. A review in\n1935\nin\nThe Geographical Journal\nbegins:-\nIn this little handbook the author sets out, as his title implies, to show how to draw the graticules of the various maps whose projections he considers. He is not therefore concerned with the equations of the projections, and though a certain amount of mathematics is necessary for his purpose, yet he concerns himself as far as possible with the geometrical constructions of the parallels and meridians, rather than with the trigonometrical calculations of their positions and sizes.\nAnother review, this time by B H Brown in\nThe American Mathematical Monthly,\nbegins:-\nScheffers' excellent pamphlet contains an elementary account of the better known methods of map projection, with historical notes, and specific directions for the construction of some twenty types of map pictured therein. The author quotes with approval the dictum of\nJacob Steiner\nto the effect that construction with the tongue is one thing, and construction with the pen quite another. This pamphlet is for those who use the pen."
}