{
  "nome_completo": "George Hartley Bryan",
  "nome_curto": "George Bryan",
  "ano_nascimento": "1864",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bryan/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Bordighera, Italy",
  "biografia": "George Bryan\nwas the only child of Robert Purdie Bryan\n(1840\n-\n1865)\nand Fanny Martell\n(1841\n-\n)\n. Robert Bryan was the son of the physician James Bedingfield Bryan\n(1813\n-\n1889)\nwho, for example, published\nNature and treatment of influenza\nin\nThe Lancet\nin\n1837\n, and Eliza Hartley\n(1811\n-\n1894)\n. Robert matriculated at Merton College, Oxford on\n17\nJune\n1858\nand, while studying there, he married Fanny Martell. He matriculated at Clare College, Cambridge on\n3\nMay\n1860\nas a Fellow-Commoner and studied the Classical tripos. He was admitted at Lincoln's Inn on\n12\nJanuary\n1863\nand was awarded a B.A\n(1\nst Class\n)\nfrom Cambridge in\n1864\n. He died on\n11\nFebruary\n1865\nand was buried Upton Cum Chalvey, Buckingham on\n20\nFebruary\n1865\n. His baby son George Hartley Bryan, the subject of this biography, was baptised at St John, Battersea on\n14\nJune\n1864\nbut he was less that one year old when his father died.\nAfter the death of his father, George was brought up by his mother and his paternal grandparents. They spent much time abroad, in France, Germany and particularly Italy\n[\n5\n]\n:-\n... especially the warmer climes of the Italian and French rivieras. This unusual upbringing gave him an excellent knowledge of languages and a lifelong fascination with the natural world, particularly of the rivieras ...\nWe obtain a snapshot of the family in\n1871\nat the UK Census when they are living in Thicket Road, Penge, Surrey. The head of the household is George's paternal grandfather, James B Bryan\n(\nage\n58)\n, giving his qualifications as M.D. Edinburgh and Member of the Royal Colleges of Physicians, London. Also in the house are James' wife Eliza Bryan\n(\nage\n60)\n, George Bryan\n(\naged\n7)\n, the subject of this biography, and Fanny Bryan, George's mother. The family have three servants, a cook, a housekeeper and someone labelled as \"music\". Presumably the musician entertained the family and taught music to young George who certainly had a great passion of music all his life. There is also Sarah Whittle, who is an assistant, and a visitor David Williams who is a Church of England clergyman.\nTen years later, in\n1881\n, we gain obtain details from the next UK Census when they are living in Fitzwilliam Road, Cambridge. James B Bryan, Eliza Bryan, Fanny Bryan and George Bryan are in the house with one servant, a parlour maid Ann Britton. They have one visitor, Mary D Richmond. On\n10\nApril\n1883\nGeorge Bryan was admitted as a pensioner at Peterhouse, Cambridge and began his study of the mathematical tripos. His upbringing to this stage had been unconventional and its effects are described in\n[\n3\n]\n:-\nHis mother lived to a good old age, and Bryan always spoke of her with the greatest affection. He was brought up by his mother and his grandparents. He was the idol of the household, and being supposed to be delicate he was never allowed to go to school. Even when he went to Peterhouse as an undergraduate he was not given the opportunity of becoming self-reliant, for he still lived at home. The result of such an upbringing, in which discipline was totally absent, was a rather noticeable eccentricity, which did not, however, cover up a remarkable simplicity, honesty, and kindliness of character.\nBryan graduated with a B.A. in\n1886\n, being fifth Wrangler\n(\nranked as the fifth best First Class student\n)\n, and in the following year he was in the First Division of the First Class of Part II of the tripos, having concentrated on hydrodynamics, elasticity and thermodynamics, and, later that year, was bracketed with the Senior Wrangler,\nAlfred Cardew Dixon\n, as one of the two Smith's Prizemen for his dissertation on the stability of a rotating fluid. He had been taught by a number of famous mathematicians at Cambridge, including\nGeorge Howard Darwin\n,\nJames Glaisher\n,\nWalter Rouse Ball\nand\nAndrew Forsyth\n. His opinion of the Cambridge mathematical tripos, however, was pretty negative\n[\n12\n]\n:-\nOne peculiarity of this examination is that the syllabus goes a long way past the dividing point at which the mathematician and the physicist branch off in different directions. Another peculiarity is that it covers a number of subjects each of which, to be properly mastered, would take the whole number of hours that the candidate usually can devote to the entire syllabus. A third peculiarity is that greater importance is attached to the candidates' powers of devising artificial dodges for the solution of tricky problems than to his knowledge of first principles and their direct applications.\nHe submitted his first papers for publication in\n1888\nand, in\n1889\n, he was elected a fellow of Peterhouse.\nBryan published\nThe waves on a rotating liquid spheroid of finite ellipticity\nin\n1889\n. He begins the Introduction as follows:-\nThe hydrodynamical problem of finding the waves or oscillations on a gravitating mass of liquid which, when undisturbed, is rotating as if rigid with finite angular velocity, in the form of an ellipsoid or spheroid, was first successfully attacked by M\nPoincaré\nin\n1885\n. In his important memoir, \"Sur l'Équilibre d'une Masse Fluide animée d'un Mouvement de Rotation,\"\nⓉ\n(\nOn the equilibrium of a fluid mass animated by a rotating motion\n)\nPoincaré\nhas obtained the differential equations for the oscillations of rotating liquid, and shown that, by a transformation of projection, the determination of the oscillations of any particular period is reducible to finding a suitable solution of\nLaplace\n's equation. He then applies\nLamé\n's functions to the case of the ellipsoid, showing that the differential equations are satisfied by a series of\nLamé\n's functions referred to a certain auxiliary ellipsoid, the boundary-conditions, however, involving ellipsoidal harmonics, referred to both the auxiliary and actual fluid ellipsoid. At the same time,\nPoincaré\n's analysis does not appear to admit of any definite conclusions being formed as to the nature and frequencies of the various periodic free waves.\nThe present paper contains an application of\nPoincaré\n's methods to the simpler case when the fluid ellipsoid is one of revolution\n(\nMaclaurin\n's spheroid\n)\n. The solution is effected by the use of the ordinary tesseral or zonal harmonics applicable to the fluid spheroid and to the auxiliary spheroid required in solving the differential equation. The problem is thus freed from the difficulties attending the use of\nLamé\n's functions, and is further simplified by the fact that each independent solution contains harmonics of only one particular degree and rank.\nOver the next few years Bryan undertook a remarkable amount of work, essentially having two parallel careers, both of which on their own have an amazing output. One of these is as a writer of textbooks for the University Correspondence College, the other is as a researcher tackling novel lines of research.\nThe University Correspondence College, founded in London by\nWilliam Briggs\nin\n1887\n, was set up to provide tutorial assistance to students who were studying for external University of London degrees.\nBriggs\nalso set up the University Tutorial College, giving tutorial assistance to students in London, and the University Tutorial Press with its own printing and bookbinding works.\nBriggs\nand Bryan began to collaborate in writing textbooks for the University Correspondence College from about\n1890\n, beginning with\nThe elements of coordinate geometry\n(1891)\n. But as well as writing texts with\nBriggs\n, Bryan was persuaded by\nBriggs\nto collaborate with others writing textbooks. C W C Barlow had been a fellow student of Bryan at Cambridge, being sixth Wrangler in the same tripos examination that Bryan was fifth Wrangler. Bryan and Barlow's first textbook for the University Correspondence College was\nElementary Mathematical Astronomy, with examples and examination papers\n(1892)\n. These books were very popular and so Bryan was not only involved in writing many new textbooks but also bringing out new editions of his previous books.\nFor more information on over twenty textbooks written by Bryan for the University Correspondence College, including extracts from reviews and prefaces, see\nTHIS LINK\n.\nBryan's research output during this period was also exceptional; he published eight papers in\n1889\n-\n90\n:\nThe waves on a rotating liquid spheroid of finite ellipticity\n(1889)\n,\nOn the stability of elastic systems\n(1889)\n,\nApplication of the energy test to the collapse of a long thin pipe under external pressure\n(1889)\n,\nOn the Stability of a Plane Plate under Thrusts in its own Plane, with Applications to the \"Buckling\" of the Sides of a Ship\n(1890)\n,\nOn the beats in the vibrations of a revolving cylinder or bell\n(1890)\n,\nAn application of the method of images to the conduction of heat\n(1890)\n,\nOn the stability of a rotating spheroid of perfect liquid\n(1890)\n, and\nOn the deformation of twisted strips\n(1890)\n.\nHe published even more research papers in\n1891\n, but there is a particularly significant paper he published that year which we should say a little more about. The\nBritish Association for the Advancement of Science\nwas due to hold their\n1891\nmeeting in Cardiff and Bryan was keen to offer the meeting a review of thermodynamics. Bryan had not published on thermodynamics so it is not obvious where his interest came from. The source was\nJoseph Larmor\nwho, after spending five years in Galway, had returned to St John's College, Cambridge in\n1885\nand taught the Part II tripos course that Bryan studied. At any rate, the\nBritish Association\nasked Bryan and\nLarmor\nto jointly report on thermodynamics to their\n1891\nmeeting and they presented the \"\nReport of a committee, consisting of Messrs J Larmor and G H Bryan, on the present state of out knowledge of Thermodynamics, specially with regard to the second law\n\" to the meeting and \"\nPart I. - Researches relating to the connection of the Second Law with Dynamical Principles. Drawn up by G H Bryan\n\" was published in\n1892\nin the proceeding of the meeting. The report praises\nBoltzmann\nand criticises\nClausius\n. For example:-\nBoltzmann\nseems to have been next to take up the subject, but his claim to priority has been disputed by\nClausius\n, whose investigations appeared about five years later.\nBoltzmann\nwas undoubtedly the first to regard the subject from a statistical point of view. ... The methods of proof employed by\nClausius\nin\n[\nhis\n1870]\npaper are very laborious and complicated, while his arguments are artificial and, in places, not very intelligible.\nBoltzmann\nwas delighted with the Report and after attending the Tercentenary Celebrations of Trinity College, Dublin in July\n1892\n, he visited Bryan in Cambridge. This meeting marks the start of a friendship between the two who had much in common in addition to thermodynamics, namely a love of nature, and a love of music, both being gifted musicians. At the\nBritish Association\nmeeting in Oxford in\n1894\n, Bryan presented the second part of the thermodynamics report, this time as the sole author.\nBoltzmann\nattended the meeting and eagerly took part in the discussion after Bryan's lecture. The Proceedings of the meeting contains the paper \"\nPart II. - The Laws of Distribution of Energy and their Limitations\n(\nWith an Appendix by Prof Ludwig Boltzmann.\n)\n\" Bryan had undoubtedly made his presence known to the mathematics and physics world as a leading expert. There was another aspect of the\nBritish Association\nmeeting in Oxford in\n1894\nwhich proved important in Bryan's career, namely discussions between those studying the theoretical possibilities of aeroplanes and the engineers who were actively experimenting with manned flight.\nBoltzmann\nwas enthusiastic about the possibilities and Bryan soon became enthusiastic too.\nBryan's leading role in kinetic theory led to his election as a Fellow of the\nRoyal Society\nin\n1895\n. The\nBritish Association\nheld their\n1896\nmeeting in Liverpool and Bryan, now showing his theoretical interest in flight, presented the paper\nOn the Sailing Flight of Birds\n. While at this meeting, he received the news that he had been appointed as a Temporary Lecturer in Mathematics at the University College of North Wales in Bangor and on\n14\nDecember\n1896\nhe was elected to the Chair of Pure and Applied Mathematics at Bangor. He was now thinking hard about stability of flying machines and delivered lectures and papers on the topic such as\nArtificial flight\nin\nScience Progress\n(1897)\n. Let us emphasise our \"two careers\" point here by noting that, by\n1897\n, he had at least twelve textbooks in print, many of which had already gone through several new editions.\nIt looks at this stage as though Bryan was handling the extremely heavy load that he had chosen to put on himself. This, however, was not the case for the very small mathematics department at Bangor was in difficulties. All teaching and examining mathematics was Bryan's responsibility with only one assistant to help him. We quote James Boyd\n[\n9\n]\n:-\n... having been cocooned at Cambridge for so long, Bryan had no notion of how to go about organising work in a small - very small - department. So with the assistant unwilling and the professor unwitting and at times unwell throughout the\n1897\n-\n1898\nsession, it was small wonder that the very stability of the Mathematics Department was threatened by the near total breakdown in communication between professor and assistant. A Committee of Inquiry was set up. When the committee duly reported in early\n1899\n, Bryan was discomfited to learn that while blame was indeed attributed to his assistant, his own leadership was found wanting. Bryan suffered a nervous breakdown and withdrew to Cambridge for the Summer Term of\n1899\n.\nI\n[\nEFR\n]\nbelieve that Bryan had another problem not mentioned by Boyd, namely that he was suffering from overwork. Given his incredible output in the ten years leading up to these difficulties, surely this must have been a major contributing factor to his problems at Bangor. Perhaps there was an indication that he understood this when he wrote in\nBoltzmann\n's obituary:-\nMathematical research is a dangerous occupation if carried too far, and the consequences that may have been the result of this intense concentration of thought should prove a warning to others not to allow themselves to be too deeply absorbed in any particular investigation. The difficulty of tearing oneself away from a particular line of work till it has been finished constitutes a grave danger ...\nAlso Bryan does not appear to have been the sort to try to avoid confrontation and did not mince his words when handing out criticism. Look, for example, at his criticism of the\nLondon Mathematical Society\nin\n1904\n[\n11\n]\n:-\n... the\nLondon Mathematical Society\nis not taking the place it ought to take among English scientific societies. Its library is stowed away in a dark attic and is practically inaccessible. Its members are not styled \"Fellows.\" It has no lack of contributors to its Proceedings, but it makes no effort to improve the status of mathematicians in this country in the way that is undoubtedly done for other branches of science by the leading societies in Burlington House.\nIn\n1899\nBryan received a major honour when he awarded the\nGauss\nMedal of the\nGerman Mathematical Society\n. He was also invited to write an article on thermodynamics for the\nArnold Sommerfeld\n's\nEncyklopädie der Mathematischen Wissenschaften mit Einschluss ihrer Anwendungen\nⓉ\n(\nEncyclopedia of Mathematical Sciences, including its applications\n)\n. In fact\nSommerfeld\nvisited Bryan in Bangor in September\n1899\nto make the invitation in person. Bryan wrote the\n90\n-page article\nAllgemeine Grundlegung der Thermodynamik\nⓉ\n(\nGeneral foundation of thermodynamics\n)\nwhich was published in the\n1\nst part of the\n5\nth volume of the\nEncyclopaedia\nin\n1903\n. He received a second award in\n1901\nwhen the Institution of Naval Architects awarded him their gold medal for his mathematical theory, published in his paper\nThe steading of ships,\nconcerning the reduction of oscillations of a ship with certain types of keel.\nAlthough there are some signs that he was easing off a little after his nervous breakdown, he was still undertaking a large amount of research and he had become totally committed to working on stability of flying machines.\nOn\n17\nJuly\n1906\n, Bryan married Mabel Grace Williams\n(1870\n-\n1958)\nat the Cathedral Church in Bangor. Mabel, the daughter of the iron merchant Frederick Williams and his wife Frances, was the headmistress of the Bangor primary school; George and Mabel had one child, a daughter, Margaret, born in\n1909\n.\nBryan became President of the\nMathematical Association\nin\n1907\nand he set up the local branch of the Association in North Wales. He was delighted with the way this local branch operated; see his description in his Address as the Retiring President\n[\n12\n]\nat\nTHIS LINK\n.\nIn\n1907\nBryan published the book\nThermodynamics. An introductory treatise dealing mainly with first principles and their direct applications\n. The Preface begins as follows:-\nWhen I accepted an invitation to write the article for the 'Encyklopädie' on the General Foundations of Thermodynamics, it was understood that the article should deal, as far as possible, exclusively with the laws of thermodynamics and consequences immediately deducible from them, and that all properties of particular substances and states which depended partially on experimental knowledge or other hypotheses should be left for another article. I had long felt the want of a book in which thermodynamics was treated by purely deductive methods, and it has been my object in the following pages to develop the subject still more on this line than was possible in an article professing to be to some extent an exposition of the history and actual state of knowledge of the subject.\nFor a longer extract from the Preface see\nTHIS LINK\n.\nIn\n1911\nhe published\nStability in Aviation: An Introduction to Dynamical Stability as Applied to the Motion of Aeroplanes\n. The Preface begins as follows:-\nUp to the present time the problem of stability has received very inadequate attention in connection with aviation. From the point of view of the practical aviator, this is, perhaps, little to be wondered at. It would scarcely be possible for him to devote months of concentrated attention to long and laborious stability investigations when it is no exaggeration to say that very frequently his success or failure depends, above all things, on the names of the towns at which he starts and lands. If a prize is offered for flight from Folkestone to Flushing, it is useless for him to fly from Harwich to the Hook, even on much more stable machine than that used by the winner of the prize.\nFor a longer extract from the Preface, and extracts from two reviews, see\nTHIS LINK\n.\nThe author of\n[\n7\n]\nwrites:-\nBryan took a great delight in the beauties of Nature, in scenery, plants and insects and had a passion for music which led him far. At one period - when piano players first appeared, a considerable amount of his time and energy was spent in developing an invention for their improvement and led him into friendly disputation on the principles involved with musicians and physicists. In his later years Bryan found the ties of his university duties rather irksome and sought an opportunity for unfettered research; this was provided for him in\n1917\nby a three years' grant from the Department of Scientific and Industrial Research, which time he devoted to the dynamics of aeroplane motion and to considering methods of dealing with the motion of compressible fluids.\nWe mentioned above his term as President of the\nMathematical Association\n. In his Address as retiring President he spoke much about his ideas regarding teaching mathematics and the status of mathematics in Britain; see a version of his address at\nTHIS LINK\n.\nHe also served terms as President of the Institute of Aeronautical Engineers, and the Cambridge Entomological Society. He served on the Council of the\nLondon Mathematical Society\nfrom\n1894\nto\n1896\n. He retired from his chair at Bangor in\n1926\nand purchased a villa in Bordighera in his beloved Italy\n[\n10\n]\n:-\nHis two years of retirement at Bordighera were made happy by friendly intercourse with the Italian peasants, whose language he spoke so well, and 'Il Professore' was known and loved in many a mountain village far off the beaten track of the ordinary tourist.\nHe attended the International Congress of Mathematicians in Bologna in September\n1928\nwith both his wife and daughter. He died a month after attending the Congress after a short illness."
}