{
  "nome_completo": "Alfred George Greenhill",
  "nome_curto": "George Greenhill",
  "ano_nascimento": "1847",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Greenhill/",
  "lugar_nascimento": "Twickenham, London, England",
  "lugar_morte": "London, England",
  "biografia": "George Greenhill\n's father was Thomas Greenhill\n(\nborn in Hemel Hempstead, Hertfordshire about\n1811)\nwho was a surveyor. His mother was Louisa Greenhill\n(\nborn in Oxford, Oxfordshire about\n1811)\n. He had two older sisters: Louisa\n(\nborn about\n1844)\nand Mary\n(\nborn about\n1846)\nand two younger brothers Henry\n(\nborn about\n1849)\nand Edmund\n(\nborn about\n1851)\n.\nGeorge Greenhill attended Christ's Hospital School, where he was awarded a Thompson Mathematical Gold Medal, and from there he went up to St John's College, Cambridge in\n1866\n. There he won numerous scholarships being Pitt Club exhibitioner, then Somerset exhibitioner, then foundation scholar, then London University scholar, and finally Whitworth engineering scholar. He was placed Second\nWrangler\nin the final examinations of\n1870\nand shared the Smith's Prize with the First Wrangler, R Pendlebury.\nIn the year of his graduation he was elected to a fellowship at St John's College. After a short time as Professor of Applied Mathematics at the Royal Indian Engineering College, Coopers Hill, Greenhill returned to Cambridge in\n1873\n, becoming a fellow and lecturer at Emmanuel College. It is said that he left the Royal Indian Engineering College since\n[\n1\n]\n:-\n... under the martial regime of Chesney, who was at that time President, Greenhill's independent spirit was ill at ease.\nIn\n1876\nGreenhill was appointed professor of mathematics at the Royal Military Academy at Woolwich. He held the chair there until he retired in\n1908\n.\nGreenhill's work was mainly on\nelliptic functions\n. He was interested in their applications to dynamics, hydrodynamics, elasticity, and electrostatics. As might be imagined given that Greenhill spent most of his life working in a military establishment, his work was often directed towards applications to ballistics and other military applications.\nLove\n, writing in\n[\n2\n]\n, explains applications of the theory of the motion of a solid in a fluid made by Greenhill in\n1879\n:-\nGreenhill applied this theory to give an account of the steadiness of flight conferred upon an elongated projectile by rifling. He determined the least angular velocity about its axis for which steady motion of a solid of revolution can be stable. ... This practical application of what was regarded as a recondite mathematical theory earned for him much renown at Woolwich.\nAn important contribution Greenhill made to the theory of elasticity was his study of the greatest length that a cylinder can have before it bends under its own weight. His applications included computing the maximum height a tree can grow.\nAs well as his original research, Greenhill wrote several excellent texts and encyclopaedia articles. Among these books were\nDifferential in integral calculus\n(1886)\n,\nThe applications of elliptic functions\n(1892)\n,\nTreatise on hydrostatics\n(1894)\n,\nNotes on dynamics\n(1908)\n,\nTheory of stream lines with applications to an aeroplane\n(1910)\n,\nDynamics of mechanical flight\n(1912)\n, and\nGyroscopic theory\n(1914)\n. In\n1922\nhe headed a team preparing a table of elliptic functions.\nGreenhill's approach to mathematics is summed up by\nLove\n[\n2\n]\n:-\nThe chief characteristics of Greenhill's work were a desire for concrete realisation of abstract theories and the direction of investigation to the solution of definite problems. Hence he valued applications of analysis above the analysis itself, and was led to work out minutely the details of multitudes of special cases. He was above all things a problem solver, but, to interest him, a problem had to be a real problem about material things and the ways in which they behave.\nHis rooms at Staple Inn, where he lived towards the end of his life, are described in\n[\n1\n]\n:-\nThere, with his books around him, his tables covered in neat disorder with innumerable scraps of material and apparatus to be used as dynamical models, his walls festooned with every variety of pendulum, simple or compound, contrived from articles purchased below a prescribed limit of cost at the local stores, upon his floor the treasured roll of Turkish carpet from his room of long ago at St John's, and above the mantelpiece the portrait of his beloved teacher, Clerk\nMaxwell\n, smiling approval - with all these and the precious memories they recalled, the scholar was content.\nLove\ndescribes Greenhill's character and interests outside mathematics\n[\n2\n]\n:-\n... he was keenly interested in antiquities, and had a profound knowledge of the antiquities of London. ... he had a considerable knowledge of music, and was a quite respectable performer on the organ and other instruments. He spoke French rather well, and read German easily. ... he was a sociable recluse, delighting especially in the conversation of people with tastes similar to his own.\nIn\n[\n1\n]\nhe is described as follows:-\nThere was in his character a sense of humour, kindliness, and light-heartedness, but it was too often rendered bewildering by his eccentricity. It is related that as far back as the seventies he astonished his two professional companions in a walking tour of Surrey by setting out in silk hat and frock coat, his night attire being carried in a cardboard box. His friends knew that in general conversation it was best to avoid asking him a direct question. Inquiries about his health were responded to either by silence or by an expression of annoyance, real or feigned ... To the question of whether he would take tea or coffee his reply was a simple affirmative ...\nGreenhill received many honours for his work. He was elected a Fellow of the\nRoyal Society\nin\n1888\n, he won the\nDe Morgan\nMedal of the London Mathematical Society in\n1902\nand the Royal Medal of the\nRoyal Society\nin\n1906\n. He served on the Council of the\nRoyal Society\nand as President of the\nLondon Mathematical Society\n. He was knighted in\n1908\non his retirement."
}