{
  "nome_completo": "Germinal Pierre Dandelin",
  "nome_curto": "Germinal Dandelin",
  "ano_nascimento": "1794",
  "ano_morte": "1847",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dandelin/",
  "lugar_nascimento": "Le Bourget, near Paris, France",
  "lugar_morte": "Brussels, Belgium",
  "biografia": "Germinal Dandelin\n's father, Noël-Pierre Dandelin, was an administrator, born in the Burgundy region of France. His mother, Marie-François Botteman, came from Écaussinnes in the Belgium Hainaut region. Germinal was the eldest child in the family having four younger brothers and one younger sister. When he was still a child, his parents moved to Belgium\n(\nwhich was at this time under French control\n)\nwhere his father was attached to the prefecture of the Escaut region. They lived in Ghent and, in\n1807\n, Dandelin entered the lycée there. He excelled in science and, given the military nature of the school, he was given a sergeant-major's stripes in his first year there. His education was, however, interrupted when the British invaded Walcheren island in July\n1809\n. The idea behind the invasion was to give support to the Austrians in their campaign against Napoleon but it was poorly timed since, a few days earlier, the Austrians had suffered a military defeat and were negotiating a peace deal with Napoleon. However, Dandelin volunteered for military service and joined the Escaut National Guard as a sergeant. The British invading troops contracted a severe disease from which many died and they were withdrawn in December\n1809\n. Dandelin returned to the Lycée where he completed his school education being awarded First Prize in Mathematics in August\n1813\n.\nIn November\n1813\nDandelin began his university studies at the École Polytechnique in Paris. However his career was to be very much influenced by the political events of these turbulent times and within weeks of beginning his studies there was an imperial decree requiring students to join with the National Guard in the defence of Paris against the advancing allied armies. In March\n1814\nthe Treaty of Chaumont united Austria, Russia, Prussia and Britain in the aim of defeating Napoleon. When the allied armies arrived near Paris on\n30\nMarch\n1814\n, Dandelin was in the opposing French army defending the walls of the city. He was wounded on that day having been struck by a lance. In order to recover his health, he spent several months living with his parents but returned to the  École Polytechnique in October\n1814\n. Napoleon had abdicated on\n6\nApril\n1814\n, but in the following year he returned for the\n100\ndays. During Napoleon's time back in control of France, Dandelin worked at the Ministry of the Interior under the command of\nLazare Carnot\nwho presented him with the Légion d'Honneur for his bravery in the defence of Paris in the previous year. After Napoleon was defeated at Waterloo, Dandelin returned to Belgium. He became a citizen of the Netherlands on\n4\nApril\n1816\n, his application being supported by Prince Bernhard of Saxe-Weimar-Eisenach who, at that time, was the colonel of a regiment serving the king of the Netherlands. Prince Bernhard, who had noticed how talented Dandelin was, also arranged for him to become second lieutenant in the military engineering corps on\n16\nApril\n1817\n.\nBack in Ghent, Dandelin renewed his friendship with\nAdolphe Quetelet\nwhom he had become friendly with while studying at the Lycée in Ghent. They shared interests in mathematics, literature and music, with Dandelin being an excellent violinist.\nQuetelet\n, who was at this time teaching at the College of Ghent, writes in\n[\n7\n]\nabout their friendship:-\n... I renewed old acquaintances with him, begun during our studies at the Lycée, and soon we became inseparable. This friendship, so strong and so constant, has contributed, especially then, to soften many common sorrows and to prepare each of us for the careers we have followed.\nThe two friends composed a libretto for an opera and after it was successfully performed, collaborated in writing dramas. Being close, they understood each others moods well, as\nQuetelet\nrelates\n[\n7\n]\n:-\n[\nDandelin\n]\nwas quite prone to suffer from toothache and neuralgia, then his mood became very sorrowful, and to make me understand that he wanted to be alone, he would play his violin. For my part, I soon took my hat and we parted the best of friends.\nDandelin continued his military career as an second lieutenant in the engineering corps. He worked on fortifications at Namur which were completed in\n1821\nand, during this period, he wrote a number of important mathematical works. Following the publication of two papers which solved problems in elementary geometry, published in the\nCorrespondance sur l'École Polytechnique\n, he presented the memoir\nSur quelque parties de la géométrie\nⓉ\n(\nOn some parts of geometry\n)\nto the\nRoyal Belgium Academy of Science\nin\n1817\n. At the end of\n1821\nhe went to Liège, taking part in work to construct a fortress between the rivers Lys and Scheldt. He submitted another significant paper,\nMémoire sur quelque propriétés de la focale parabolique\nⓉ\n(\nMemoir on some properties of parabolic foci\n)\n, to the\nRoyal Belgium Academy of Science\nin\n1822\n. In\n1824\nhe was sent to the town of Venlo and, on\n26\nAugust of the same year, promoted to first lieutenant. However he was unhappy in Venlo, pouring his feelings out to his friend\nQuetelet\nin a letter\n[\n7\n]\n:-\n... dear friend, help he to get out of this horrible visit. I feel my powers are wasting away and I am easing off. There is nothing stimulating in the atmosphere around me. One of the greatest privations is the lack of a library. I am completely without books, and I have nobody to converse with, so I find myself very miserable.\nQuetelet\nwas able to talk to the right people so that Dandelin might obtain a university post. From\n1825\nhe spent five years as professor of mining engineering at the University of Liège having been appointed on\n13\nMay\n1825\n. This was not the ideal appointment, for he would have loved to have had a chair of geometry, but it was the best that could be arranged. Work as a mining professor led to him making visits to Germany and later, in\n1827\n, to England. He was assigned the task, in\n1829\n, of examining the potential resources in the iron mines of the forests of Hertogenwald, the largest forest of Belgium situated in the east of the country, and in Grunhaut forest near Welkenraedt. Then, in\n1830\n, he was back in the thick of the Revolution which erupted that year. He was appointed commander of the artillery of the city guard on\n13\nSeptember\n1830\nbut, almost immediately, he was accused of treason. He escaped execution only after the intervention of his friends and the commander-in-chief of the city guard. The provisional government sent him to Ypres on\n12\nOctober where he was licenced as major in the artillery of the army of the two Flanders. He returned to Ghent on\n12\nJune\n1831\nand was made lieutenant colonel. However, again he was in trouble from the Council of War, and he escaped punishment only after\nQuetelet\n's intervention. He was sent to Namur on\n7\nSeptember\n1831\n.\nFrom\n9\nNovember\n1835\nhe was appointed to teach physics and astronomy at the Athénée in Namur although he remained in the army. However, Dandelin had always wanted to have a position in Brussels and made his wishes known to General Buzen who, at the time, was the Minister of War. In\n1841\nhe was put in charge of the engineers in Brussels, Louvain and Vilvoorde but, shortly after this on\n23\nOctober\n1841\n, he was sent to Liège to direct work on fortifications there. On\n1\nAugust\n1843\n, he was promoted to colonel in the Engineers and sent to Brussels where again he directed fortification work. Although after this he did work on other projects outside Brussels, particularly in Antwerp, he was able to continue to live in Brussels. From\n1845\nonwards he was involved in administrative work, sitting on two important committees. One of these looked into the causes for the collapse of a tunnel at Kumtich on the railway line from Louvain to Liège. The committee decided that it was the construction of a second tunnel in\n1844\n, to improve the service by upgrading from single to double track, which had caused the collapse. The second committee that he served on, set up in February\n1846\n, looked at documents relating to geodesic work which had been carried out by Cornelius Krayenhoff between\n1802\nand\n1811\non triangulating Belgium. Although this work had been highly praised shortly after its completion, it was later criticised by\nBessel\n,\nGauss\nand others. However, Dandelin's health rapidly deteriorated and he suffered a painful end to his life at the age of only fifty-two.\nDandelin, having lost out on his university education, received most of his early mathematical influence from\nQuetelet\n, who was two years younger than him, and his early interests were in geometry. Dandelin proved an important theorem on the intersection of a cone and its inscribed sphere with a plane. Now named after him, it was published in\nMémoire sur quelques propriétés remarquables de la focale parabolique\nⓉ\n(\nMemoir on some remarkable properties of the parabolic focus\n)\nwhich we mentioned above. This theorem shows that if a cone is intersected by a plane in a\nconic\n, then the foci of the conic are the points where this plane is touched by the spheres inscribed in the cone. In\n1826\nin\nSur l'hyperboloide de révolution et sur les hexagones de Pascal et de Brianchon\nⓉ\n(\nOn the hyperboloid of revolution and the hexagons of Pascal and Brianchon\n)\nhe generalised his theorem to a hyperboloid of revolution, rather than a cone, relating\nPascal\n's hexagon,\nBrianchon\n's hexagon and the hexagon formed by the generators of the hyperboloid. Dandelin's generalisation gives independent proofs of the theorems of\nPascal\nand\nBrianchon\n. This\n1826\npaper is considered by most to be Dandelin's finest contribution.\nDandelin also worked on\nstereographic projection\nof a sphere on a plane, publishing an important contribution in\nMémoire sur l'emploi des projections stéréographiques en géométrie\nⓉ\n(\nMemoir on the use of stereographic projections in geometry\n)\n(1827)\n. His mathematical contributions were not restricted to geometry, however, and he wrote papers on statics, algebra and\nprobability\n. He gave a method of approximating the roots of an algebraic equation, now named the Dandelin-\nGräffe\nmethod, and published this in\nRecherches sur la résolution des équations numériques\nⓉ\n(\nResearches on solving numerical equations\n)\n(1826)\n. The history of the Dandelin-\nGräffe\nmethod is discussed in\n[\n3\n]\nand\n[\n4\n]\n. Alston Householder explains in\n[\n4\n]\nwhat Dandelin's paper contained:-\n... the main part of the paper discusses\nNewton\n's method, and it is recommended that it be accompanied by 'regula falsi' so that one has always an upper and a lower bound for the root. Dandelin then considers the possibility of accelerating both processes by applying them to the equation whose roots are the squares of those of the original. The method he proposes for doing this is to form the product\nf\n(\nx\n)\nf\n(\n−\nx\n)\nf (x) f (-x)\nf\n(\nx\n)\nf\n(\n−\nx\n)\n, where\nf\n(\nx\n)\n=\n0\nf (x) = 0\nf\n(\nx\n)\n=\n0\nis the original equation\n(\nnote that this is not quite the way one does it now\n)\n. He mentions also another device for accelerating convergence, by use of osculating parabolas instead of tangents and chords. Finally, in the paper proper, he comments that one could equally well take\n4\nth\npowers,\n8\nth\npowers, or whatever, all of which, however, do subordinate the algebraic root squaring to the geometric tangents and chords. However, Dandelin had afterthoughts which he recorded in four appendices, and in the second of these he goes further into the matter of root squaring, making two important observations that are not always to be found in modern treatments. The first is that if the zeros of a polynomial are widely separated into one group of very large modulus, and one of very small modulus, then the equation which remains when final terms are dropped is approximately satisfied by the large zeros. In particular, if there is only one large zero, keep the first two terms; if there are two, keep three. The second observation is that if one considers the power\n2\np\n2^{p}\n2\np\nsufficiently high, then form the power\n1\n+\n2\np\n1 + 2^{p}\n1\n+\n2\np\n, and one gets the zeros themselves as quotients without root extraction.\nAmong the honours which Dandelin received was election to the\nRoyal Belgium Academy of Science\nin Brussels on\n1\nApril\n1822\n. In\n1841\nhe received the Knight's Cross of the Order of Leopold. The Knight's Cross is the highest of five classes of the Order of Leopold which is the highest order of Belgium named in honour of King Leopold I."
}