{
  "nome_completo": "Gilbert Thomas Walker",
  "nome_curto": "Gilbert Walker",
  "ano_nascimento": "1868",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walker_Gilbert/",
  "lugar_nascimento": "Rochdale, Lancashire, England",
  "lugar_morte": "Coulsdon, Surrey, England",
  "biografia": "Gilbert Walker\nwas the son of Thomas Walker\n(1833\n-\n1909)\nand Charlotte Elizabeth Haslehurst\n(1840\n-\n1916)\n. Thomas Walker had been born on\n1\nNovember\n1833\nto John Walker and Mary Haslehurst at Dronfield, Derbyshire. He attended Chesterfield School, was apprentice to John Richardson, Mining Engineer and Surveyor of Chesterfield, before being involved in surveys of waterworks and railways for Messrs Mills and Fletcher of Birkenhead, Liverpool. After a three years with the Mersey Docks and Harbour Board, Thomas married Charlotte Haslehurst in\n1862\n. The fact that the name Haslehurst appears in both sides of the family is not a coincidence for Thomas and Charlotte were first cousins. They had eight children: Jessie Sarah Walker\n(\nborn\n1863)\n; Charlotte Mary Walker\n(\nborn\n1865)\n; Francis Walker\n(\nborn\n1866)\n; Frances F Walker\n(\nborn\n1866)\n; Gilbert Thomas Walker\n(\nthe subject of this biography, born\n1868)\n; Mildred Walker\n(\nborn\n1871)\n; Howard W Walker\n(\nborn\n1874)\n; and John George Walker\n(\nborn\n1875)\n.\nThomas Walker had become Borough Surveyor of Rochdale in\n1865\n, the town where Gilbert was born, but in\n1871\nthe family moved from Rochdale to South Croydon when Thomas was appointed as the Borough Engineer and Surveyor to the Croydon Local Board of Health. On\n11\nSeptember\n1876\nGilbert entered Whitgift School in Croydon, London. The school, named for John Whitgift, Archbishop of Canterbury, first opened in\n1600\nbut had reopened in\n1871\nunder the name Archbishop Whitgift's Middle-Class Day School. The headmaster from\n1871\nto\n1902\nwas Robert Brodie\n(1841\n-\n1926)\nwho said at the reopening on\n4\nMay\n1871\n[\n3\n]\n:-\nThe object ... is to give to every boy who comes here a sound liberal education. By education I mean no mere cramming of facts and theories - no mere teaching of accomplishments. ... By 'liberal' I mean such a training as will develop a boy's powers to the greatest extent of which they are capable, and which will make him able, when he has left school, to master readily and thoroughly any kind of learning or business which he may wish.\nIn\n1881\nWalker won a scholarship to St Paul's School, a private school founded in\n1509\noccupying a site beside St Paul's Cathedral in London at this time. The headmaster at the time was Frederick William Walker\n(1830\n-\n1910)\n, who was not related to Gilbert Walker, and the Senior Mathematical Master was Charles Pendlebury\n(1854\n-\n1941)\nwho had been appointed to this position in\n1877\n. St Paul's School moved to a new site in\n1884\n, a area bordering the river Thames, in the middle of Walker's time at the school. While at St Paul's School, he matriculated at the University of London in July\n1884\nbut continued studying at St Paul's. He was fortunate to have\nFrancis Macaulay\nas a teacher after he arrived at St Paul's in\n1885\n. Walker's interest in mechanics rapidly increased and he won the Smee Prize in\n1885\nfor his essay on gyroscopes. On\n22\nDecember\n1885\nWalker was admitted as a pensioner to Trinity College, Cambridge but he spent his final two years at St Paul's School studying science in preparation for the intermediate University of London B.Sc. degree.\nIn\n1886\n, at the end of Walker's studies at St Paul's School, Charles Pendlebury, the head of mathematics, wrote a report on him which he sent to the headmaster Frederick William Walker\n(\nwho had the title High Master\n)\n[\n2\n]\n:-\nMy dear High Master,\nAs Walker is now leaving school for the University, this is the last time that it will be my duty to report to you on his progress and on the quality of his work. Throughout the time that he has spent with me his work has been so uniformly good, and he has been as persistent and untiring in his devotion to it, that I can scarcely speak too highly of him.\nIt is a matter for special regret that his illness during the examination should have taken from him his last and best opportunity at school of displaying fully his mathematical knowledge and power.\nI have never parted from any of my boys with more respect and confidence that I now do for him and I hope that his health will allow his career at the University to be a harmonious continuation of his career at St Paul's.\nI am very faithfully yours, C Pendlebury.\nThe headmaster added the note:-\nIn all this I fully concur and find it hard to drive from my thoughts the sad intelligence of his serious illness.\nFred W Walker\nWalker matriculated at Trinity College, Cambridge in the Michaelmas term\n(\nOctober\n)\n1886\nwhere he began his study of the mathematical tripos.\nAndrew Forsyth\nwas one of his lecturers and Walker said in a lecture he gave in\n1936\n[\n19\n]\n:-\nI owe my earliest introduction to dynamics - at St Paul's School to Mr Pendlebury ..., and at Trinity College, Cambridge, to Professor\nForsyth\n... The interest that they implanted has survived for half a century; and the applications to sport that I propose to describe are the immediate outcome of that interest.\nAt Cambridge, he was highly successful being awarded the Thomas Barnes Scholarship in\n1887\nand the Sheepshanks Scholarship in\n1888\n. In\n1889\nhe was awarded a B.A. and was Senior\nWrangler\nin the mathematical tripos. The Second Wrangler in that year was Frank Watson Dyson\n(1868\n-\n1939)\nwho went on to become Astronomer Royal for Scotland\n(1905\n-\n1910)\nand then Astronomer Royal at Greenwich\n(1910\n-\n1933)\n. In the late\n1880\ns Walker had visited Australia and become fascinated by boomerangs. He became expert in throwing the boomerang and, back at Trinity College, he spent much time on the Cambridge Backs throwing boomerangs. Not surprisingly, from then on he was known by his friends as \"Boomerang Walker\". For details of papers that Walker wrote about boomerangs, see\nTHIS LINK\n.\nWalker continued his study of applied mathematics at Cambridge\n[\n14\n]\n:-\nDuring the academic year\n1889\n-\n90\nhe studied more advanced branches of applied mathematics under\nG H Darwin\n, J J Thomson and\nJ Larmor\n, and finished his career as a student by heading the list in part II of the Mathematical Tripos. In\n1891\nboth Walker and Dyson were elected Fellows of Trinity.\nWe have already seen in Walker's school report that his health was causing worries at that time and the stress of the mathematical tripos did lead to health problems. In an attempt to improve matters, he spent the winters of\n1891\n,\n1892\nand\n1893\nin Switzerland. He did much ice skating and climbing which helped him to relax and recover from the pressure he had been under. He published two papers during these years,\nOn the motion of elongated projectiles\n(1892)\nand\nRepulsion and rotation produced by alternating electric currents\n(1892)\n. The second of these papers involved a mathematical approach to results of experiments carried out by Elihu Thomson\n(1853\n-\n1937)\n. Thomson had been born in England but spent most of his life in the United States where he became an expert in electrical engineering. Walker begins his paper as follows:-\nIn the 'Electrical World' May,\n1887\nor the 'Electrical Engineer'\n(\nNew York\n)\n, June,\n1887\n, \"Novel Phenomena of Alternating Currents,\" may he seen an account of some experiments by Professor Elihu Thomson on the mechanical force between conductors in which alternating currents are circulating.\nIn the case of a ring of metal in the presence of an electromagnet, in the coils of which an alternating current is passing, a force of repulsion is experienced by the ring, and this may be accounted for in the words of Professor Thomson as follows:- \"It may be stated as certainly true that were the induced currents in the closed conductor unaffected by any self-induction, the only phenomena exhibited would be alternate equal attractions and repulsions, because currents would be induced in opposite directions to that of the primary current when the latter current was I changing from zero to maximum positive or negative current, so producing repulsion; and would be induced in the same direction when changing from maximum positive or negative to zero, so producing attractions.\"\nGeoffrey Taylor writes\n[\n14\n]\n:-\nThis work was a good example of the kind of research which a well-trained mathematician of that time might be expected to carry out. It reveals very considerable mathematical power but does not draw attention to any new physical facts or principles. It expressed in quantitative form ideas which Elihu Thomson had put forward qualitatively. The paper was communicated by J J Thomson who may well have suggested it, for in conversation Walker often commented on the difficulty that applied mathematicians experienced in those days in Cambridge in finding something to work on, owing to the fact that their training did not involve any laboratory work.\nIn\n1895\n, his health now recovered, Walker was appointed as a lecturer in mathematics at Trinity College. His next publications were\nSome formulae for transforming the origin of reference of Bessel's functions\n(1895)\n,\nOn a dynamical top\n(1896)\nand\nOn boomerangs\n(1897)\n. This paper on boomerangs was the first of several on this topic. We give more information on his boomerang papers at\nTHIS LINK\n.\nThe high quality of his work led to him being awarded the\nAdams\nPrize in\n1899\nfor his essay\nAberration and some other problems connected with the electromagnetic field\n. The examiners for the\nAdams\nPrize for\n1899\nhad selected the subject \"The Theory of the Aberration of Light\". Walker begins his preface as follows:-\nThe phenomena of aberration depend upon the relations of the ether and matter and must therefore be intimately associated with many other facts of nature. In the following essay an attempt is made to construct a theory of the electromagnetic field which shall be consistent with the modern interpretation of chemical, optical and magnetic phenomena in terms of electrically charged particles. That a particular case of such a theory would explain aberration was proved by\nH A Lorentz\nin the year\n1892\n.\nWalker shared the\n1899\nAdams\nPrize with\nJoseph Larmor\nwho submitted the essay\nAether and matter; a development of the dynamical relations of the aether to material systems on the basis of the atomic constitution of matter, including a discussion of the influence of the earth's motion on optical phenomena\n.\nFrom about this time Walker began to apply for various positions. One such position was the chair of Natural Philosophy at the University of Edinburgh. This had become vacant in\n1901\nfollowing the death of\nPeter Guthrie Tait\n. Walker applied for the post and was clearly a strong applicant having\nLord Kelvin\nsupporting his application. The Canadian physicist, James Gordon MacGregor\n(1852\n-\n1913)\n, was offered the chair, however, and accepted. Also in\n1901\nthe Indian Meteorological Department, which had been founded in September\n1875\n, was looking to appoint somebody who would become the third Director. The second director was John Eliot and he returned to England and approached the Observatories Committee of the\nRoyal Society\nseeking their advice on a suitable person to succeed him. Eliot explained that he was seeking a person who had a strong mathematical background so, despite Walker having no experience in meteorology, his name was suggested.\nAware of his lack of experience in meteorology and climatology, Walker decided that he had better gain some experience before moving to India. During the years\n1902\n-\n03\nhe made a series of visits to meteorological services in Britain, France, Germany and the United States. In America, as well as visiting the Weather Bureau, where he became a close friend of the Director Cleveland Abbe, he visited several observatories. He charmed many of the scientists he met at these establishments with his expertise on boomerangs. In\n1903\nhe became a special scientific assistant to John Eliot, but spent much of the year continuing to gain experience and make links to other meteorological services and observatories. He arrived in India late in\n1903\nand, on\n1\nJanuary\n1904\nwas appointed Director General of Observatories in India.\nHis publication record certainly has gaps, one from\n1892\nto\n1895\nalmost certainly because of his health problems, and another from\n1904\nto\n1909\nwhile he was converting to become an expert on meteorology and climatology. The quality of his work on applied mathematics, in particular dynamics and electromagnetism, had, however, been outstanding so in\n1904\nhe was elected a fellow of the\nRoyal Society of London\n. Also in\n1904\nhe was awarded an Sc.D. by the University of Cambridge and in\n1905\nhe was elected a fellow of the Royal Meteorological Society.\nOn\n13\nMay\n1908\n, at St James Church, Southampton, England, Walker married May Constance Carter\n(1877\n-\n1955)\n. May was the daughter of the butcher Charles Stephen Carter\n(1839\n-\n1913)\nand Emma Clark\n(1843\n-\n1905)\n. Gilbert and May Walker had a daughter, Verity Micheline Walker\n(1910\n-\n1996)\nwho became a dietitian, and a son Michael Ashley Walker\n(1917\n-\n1983)\nwho became a civil servant.\nIn India Walker worked at the Indian Meteorological Department at Simla where he had the ideal environment in which to develop and enjoy his wider interests. These interests included throwing boomerangs on the playing fields at Annandale, climbing and walking in the hills around Simla, painting water colours which he showed at the Simla Art Exhibition, ice skating and playing the flute. In terms of his work on meteorology there was one major issue affecting the lives of millions in India\n[\n22\n]\n:-\nThe situation in India after the famines of\n1877\nand\n1899\nwas desperate. Millions had died as a result of droughts that were caused by the failure of the monsoons. There was an urgent need to try to better understand the monsoon and the seasonal rains associated with this event. By the last decade of the nineteenth century, the forecasts were often completely incorrect, partly as a result of a lack of rigorous meteorological or statistical basis but also because of a change in the climate system that Eliot had documented in his\n1904\npaper. The scientific merit of any kind of weather forecasting was still a subject of great debate in Europe at the turn of the twentieth century, and the idea of the long-range forecasting of monsoons was thought by many to be an unachievable task. Scientific attempts to forecast the monsoon rains had started approximately twenty-five years before Walker's arrival in India, with official forecasts being issued beginning in\n1886\n.\nWalker's first paper after taking up his post in India was\nCorrelation in seasonal variation of climate\n(1909)\n. He takes the mathematical approach of trying to replace a hard problem by a number of simpler ones. He begins the Introduction as follows:-\nA cursory examination of the seasonal variations of any country will show that some of the departures from average conditions are directly related to other abnormal features, and the method by which the effects are produced is often fairly well known, as is the case when diminution of pressure is due to rise in temperature. Other departures, however, are connected with abnormal features in distant parts of the earth, and difficulties are experienced in ascertaining not only the nature of the results due to any variation, but also the chain of causes and effects by which the results are produced; as examples of the latter may be quoted the favourable influence upon the Indian monsoon rainfall of the conditions which produce high temperature in the interior of Australia or high pressure in the Argentine Republic. Before attempting therefore to investigate the phenomena on physical lines it appears desirable to ascertain by purely empirical methods the character of as many relationships as possible in the hope of being able to pick out rom the results so obtained a number of which the physical explanation is clear.  If we can in this way find the intermediate links in the chain of causes we may replace an intricate problem by a number of simpler ones.\nThis was the first of twenty papers by Walker with this title\n(\nactually he changed the title to\nCorrelation in seasonal variation of weather\npart way through\n)\n. Examples of other papers attacking similar problems are:\nThe liability to drought in India as compared with that in other countries\n(1910)\n;\nOn the meteorological evidence for supposed changes of climate in India\n(1910)\n; and\nA further study of relationships with India monsoon rainfall\n(1914)\n.\nWalker retired from his position at the Indian Meteorological Department and returned to England in\n1924\n. For his work in India he was knighted on his return, becoming Sir Gilbert Walker in\n1924\n. In the same year he was appointed to the chair of Meteorology at the Imperial College of Science and Technology, University of London. One aspect of his work there is described by Charles Normand\n[\n8\n]\n:-\nOne of the subjects to which he turned his own and his pupils' attention was the cellular structure of an unstable fluid. In striking laboratory experiments they obtained a variety of cellular forms - polygons, transverse and longitudinal vortices - by varying the rate of shear in the fluid, and they were able to show that this physical process explained the mode of formation of a wide variety of cloud forms.\nAlthough he continued to publish on many papers on meteorology, he now also published on his other interests, such as the flight of birds and the physics of sport. You can see more information on these publications at\nTHIS LINK\n.\nIn\n1934\nhe retired from Imperial College and went to live in Cambridge. During World War II he undertook research\n[\n9\n]\n:-\n... under the auspices of the Meteorological Committee of the Air Ministry and contributed research papers on long-range forecasting, symmetry points, correlation coefficients between various upper air data, and the relation between European weather and Artic ice.\nHe gave up his home in Cambridge in\n1950\nand after that did not settle in one place but lived mostly in Surrey or Sussex. Let us end with a quote from\n[\n8\n]\n:-\nWalker was a man of wide interests, a highly proficient skater and climber in his younger days, always very fond of music, happy to spend a day out of doors sketching in water colour, ever eminently reasonable, liberal minded and very friendly. In all his posts he demonstrated his great intellectual capacity and served with distinction, deservedly reaping many honours during his long life."
}