{
  "nome_completo": "Giovanni Ricci",
  "nome_curto": "Giovanni Ricci",
  "ano_nascimento": "1904",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ricci_Giovanni/",
  "lugar_nascimento": "Florence, Italy",
  "lugar_morte": "Milan, Italy",
  "biografia": "Giovanni Ricci\nwas brought up in Florence where he underwent his school education. He went to Pisa where he studied mathematics at the Scuola Normale Superiore which is associated with the University of Pisa. He was only\n21\nyears old when he submitted his doctoral thesis\nLe transformazioni de Christoffel e di Darboux per le superficie rotonde,coniche e cilindriche. Alcune generalizioni, per rotolamento del cono e del cilindro di rotazion\nⓉ\n(\nThe transformations of Christoffel and Darboux for spherical, conical and cylindrical  surfaces. Some generalisiations, for rotation of the cone and for the cylinder of rotation\n)\nand was awarded a doctorate on\n15\nDecember\n1925\n.\nAfter graduating, Ricci went to Rome where he was appointed as a lecturer. He returned to Pisa in\n1928\nwhen he was appointed as a professor at the Scuola Normale Superiore\n[\n1\n]\n:-\nThe time he spent at the Scuola Normale Superiore was very fruitful in scientific research and gave birth to some papers which stand out among his publications.\nIn fact Ricci held this position for eight years. During that time he published work on the\nGoldbach conjecture\nwhich concerns writing numbers as the sum of primes, and also on\nHilbert\n's Seventh Problem which asks whether or not aı was transcendental when a and b are algebraic.\nHilbert\nhimself remarked that he expected this Seventh Problem to be harder than the solution of the\nRiemann\nconjecture. However\nRiemann\n's intuition was not too good here for it was solved independently by\nGelfond\nand\nSchneider\nin\n1934\n. As examples of the papers Ricci published during his eight years as a professor in Pisa we mention:\nSulle funzioni simmetriche delle radici dell'unità secondo un modulo composto\nⓉ\n(\nOn symmetric functions of the roots of unity in a  compound form\n)\n(1931)\n,\nSui grandi divisori primi delle coppie di interi in posti corrispondenti di due progressioni aritmetiche. Applicazione del metodo di Brun\nⓉ\n(\nOn large prime divisors of the integer pairs in corresponding positions of two arithmetic progressions. Application of Brun's method\n)\n(1933)\n,\nSulle serie di potenze che rappresentano funzioni razionali a coefficienti razionali e con i poli appartenenti ad una progressione geometrica\nⓉ\n(\nOn power series which represent rational functions with rational coefficients and whose poles belong to a geometric progression\n)\n(1934)\n,\nSu un teorema di Tchebychef-Nagel\nⓉ\n(\nOn a theorem of Tchebychef and Nagel\n)\n(1934)\n, and\nSui teoremi Tauberiani\nⓉ\n(\nOn Tauberian theorems\n)\n(1934)\n. Let us also note that, in\n1951\n, Ricci wrote a paper on the school of mathematics in Pisa\nLa scuola matematica pisana dal\n1848\nal\n1948\nⓉ\n(\nThe mathematics school of Pisa from\n1848\nto\n1948\n)\n. This covered a period of one hundred years, including the time that he both studied there and worked there as a professor.\nIn\n1936\nRicci moved to Milan where he was appointed as Professor of Mathematical Analysis at the University. Of course this was a difficult period in Italy. In\n1935\nthe League of Nations had imposed sanctions against Italy following its invasion of Abyssinia. The following year Mussolini and Hitler declared the Rome-Berlin Axis and in\n1937\nItaly left the League of Nations. Although World War II began September\n1939\n, it was not until June\n1940\nthat Italy declared war on Britain and France. Ricci was unable to continue his research with the vigour that he had in Pisa and was more involved in teaching and administration. Between his taking up the position in Milan and the end of World War II, a period of nine years, he published only two works.\nSull'irrazionalità del rapporto della circonferenza al diametro\nⓉ\n(\nThe irrationality of the ratio of the circumference to the diameter\n)\n(1942)\nwas the published version of a lecture he gave at the Second Italian Mathematical Congress in Bologna in\n1940\n. The other paper\nProblemi secolari e risposte recenti nel campo dell'aritmetica\nⓉ\n(\nAge-old problems and recent responses in the field of arithmetic\n)\n(1945)\nwas again the published version of a lecture. In it Ricci discussed the estimation of exponential sums, the distribution of\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nmod\n1\n,\nWaring\n's problem and\nGoldbach\n's problem.\nRicci held the chair of Mathematical Analysis in Milan for over\n36\nyears. He published many excellent expository and historical articles from\n1948\nonwards, and also did some interesting research on the distribution of primes. However his research never returned to the output of his days in Pisa, either in quantity nor depth. We will look briefly, however, at some of his interesting expository articles:\nFigure, reticoli e computo di nodi\nⓉ\n(\nShapes, patterns and computation of nodes\n)\n(1948)\ndiscussed classical lattice-point problems and puts these in historical perspective;\nLa differenza di numeri primi consecutivi\nⓉ\n(\nThe difference of consecutive primes\n)\n(1952)\nlooks at the the history of the various problems concerned with the difference between consecutive primes; and\nAritmetica additiva: aspetti e problemi\nⓉ\n(\nAdditive arithmetic: aspects and problems\n)\n(1954)\nis an expository account of classical and modern results in the additive theory of numbers.\nWe mentioned Ricci's research on the distribution of primes. In the papers\nSul coefficiente di Viggo Brun\nⓉ\n(\nOn the coefficients of Viggo Brun\n)\n(1953)\nand\nSull'andamento della differenza di numeri primi consecutivi\nⓉ\n(\nThe performance of the difference of consecutive primes\n)\n(1954)\nhe presented many results on the difference between consecutive primes. We should not, however, give the impression that all Ricci's work was in number theory for he also made significant contributions to the theory of functions of a complex variable.\nCugiani, who knew Ricci from\n1937\nonwards, writes in\n[\n1\n]\nabout his abilities as a teacher:-\nHe was a born teacher, partly owing to his mastery of the language, since he came from Toscana, the region where the best Italian is spoken; but, most of all, he was an excellent teacher because of his extreme clarity of mind and his profound intellectual honesty, which forced him to present topics in such a way that their logical connections became absolutely obvious; those who listened to him often thought that what he had explained was a chain of trivial statements\n(\nas he used to say\n)\n. Of great help was also his wide mathematical knowledge, deriving both from the school he had followed and from his continuous interest in research.\nAs to his character and personality, Cugiani writes:-\nHis profound aesthetic sense was quite an important aspect of his personality, and it seemed to be related to his fondness for library organisation, his love of books, which he always regarded as objects of high aesthetic value. He once said to me: \"Opening a book neatly printed on good paper and properly bound is one of the pleasures allowed to man\". To his everyday work, his aesthetic sense brought clarity and a sober and balanced language, both in research and in teaching. Of course it also had other, more evident, manifestations, for instance his love of music, which he often combined with the pleasures of mathematical studies through a subtle transposition of activities which he felt to be very close to each other.\nFinally we mention that Ricci's most famous doctoral student during his time in Milan was\nEnrico Bombieri\n."
}