{
  "nome_completo": "Giuseppe Biancani",
  "nome_curto": "Giuseppe Biancani",
  "ano_nascimento": "1566",
  "ano_morte": "1624",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Biancani/",
  "lugar_nascimento": "Bologna, Papal States (now Italy)",
  "lugar_morte": "Parma, Duchy of Parma and Piacenza (now Italy)",
  "biografia": "Giuseppe Biancani\n's name also appears in its Latin version of Josephus Blancanus; in fact his books were published under this Latin version of his name. He entered the novitiate of the Society of Jesus\n(\nthe Jesuit Order\n)\non\n4\nOctober\n1592\n. He studied mathematics, taught by the famous\nChristopher Clavius\nat the Jesuit Collegio Romano in Rome. Between\n1596\nand\n1599\n, he was studying at the Jesuit College in Padua.\nGalileo\nhad been appointed professor of mathematics at the University of Padua, the university of the Republic of Venice, in\n1592\nand Biancani became acquainted with him during his years in Padua. This friendship was an important one for Biancani, who later found himself in a difficult position pulled between the views of his Jesuit order and the revolutionary new ideas being argued by\nGalileo\n. In a letter he wrote on\n14\nJune\n1611\n, he referred to his friendship with\nGalileo\n:-\nI love and admire\nGalileo\n, not only for his rare learning and invention, but also for the old friendship that I had with him in Padua, where I was overcome by his courtesy and affection, which bound me to him.\nIt is also worth recounting the tensions in Padua during the years that Biancani studied there. The Jesuit College, established in Padua in\n1542\n, had become an important educational establishment by\n1590\noffering a three-year philosophy degree; logic was taught in year one, natural philosophy and physical science in year two, and metaphysics and natural philosophy in year three. However, the university students objected to the Jesuit College and the Venetian Senate became involved in the argument in December\n1591\n. The Jesuit College was accused of being a rival university to the University of Padua, something which was illegal by Venetian law. As a result of the dispute, it was forbidden from teaching students other than Jesuits. Much of the argument, which continued during the years that Biancani studied there, was centred around the teachings of\nAristotle\n; the Jesuit teachers were accused of not teaching directly from\nAristotle\nbut rather using modern texts. Clearly this influenced Biancani who, a few years later in\n1615\n, published a text\nAristotelis loca mathematica ex universis ipsius operibus collecta et explicata\nⓉ\n(\nAristotle's mathematical passages collected and explained from all his works\n)\nin which he treated the mathematical parts of\nAristotle\n's writings. Biancani explained why he wrote the text:-\nI, too, began devoting myself to\nAristotle\n's writings, so that the passages which concern mathematics that are scattered throughout his work have been collected and explained by me, to make them useful, above all, to those students of philosophy who, having renounced the ancient custom without a knowledge of mathematics, dedicate themselves to philosophy to the detriment of their studies.\nIn the early\n1600\ns Biancani, having completed the long training period for the Jesuit order, went to the Jesuit College in Parma where he taught mathematics for his whole career. He also taught at the University of Parma; Paul Grendler in\n[\n1\n]\nlists the professors teaching at the university in session\n1617\n-\n18\nwhich includes 'Giuseppe Biancani of Bologna' lecturing in the afternoon on mathematics as part of \"Arts and Theology\". In this course he taught\nEuclid\n's\nElements\nand astronomy.\nWe have quoted above from Biancani concerning his high regard for\nGalileo\n. However, he did not always agree with\nGalileo\n's views. The first disagreement came in\n1611\nand concerned the mountains on the moon.\nGalileo\nhad observed the surface of the moon through a telescope in\n1609\nand had used certain mathematical techniques to prove that there were lunar mountains. His claim appeared in\nSidereus Nuncius\nⓉ\n(\nSidereal Messenger\n)\npublished in May\n1610\n. In May\n1611\na group of scientists, mostly Jesuits, was brought together by cardinal Ferdinando Gonzaga in Mantua to discuss\nGalileo\n's claims. One of the major points discussed was\nGalileo\n's proof that there were mountains on the moon, and the report from the group came down firmly in favour of the traditional belief that the moon was perfectly smooth.\nGalileo\nsuspected that Biancani was the author of the report and letters were exchanged in which Biancani dissociated himself from any insult towards\nGalileo\nsaying that he was sorry if he had been offended but, nevertheless, pointing out that he did believe that the moon was perfectly smooth. He also disagreed with\nGalileo\nin\n1613\nwhen a dispute broke out between\nGalileo\nand\nChristoph Scheiner\nover sunspots.\nGalileo\nunfairly accused\nScheiner\nof plagiarism but, although\nScheiner\n's discovery of sunspots was certainly independent of any work by\nGalileo\n, his explanation was quite wrong. Biancani, however, defended his fellow Jesuit\nScheiner\n.\nWe noted above that Biancani published\nAristotelis loca mathematica\nⓉ\n(\nAristotelian mathematics\n)\nin\n1615\n. In fact he tried to publish the work in the previous year but, like all publications by Jesuits at this time, it had to be first approved. Giovanni Camerota read the work to see if it was suitable for publication and wrote:-\nIt does not seem to be either proper or useful for the books of our members to contain the ideas of\nGalileo\n, especially when they are contrary to\nAristotle\n.\nBefore the work could be published, Biancani had to remove the description of\nGalileo\n's work on floating bodies, and replace it with a simple reference indicating where\nGalileo\n's theory could be found. Francesco Paolo de Ceglia writes about the contents of\nAristotelis loca mathematica\nⓉ\n(\nAristotelian mathematics\n)\n[\n3\n]\n:-\n... the dedication is followed by an address to the reader wherein Biancani, in a rhetorical tirade, bemoans the wretched state to which mathematics has sunk and calls for its revitalisation. Under sixteen headings, he announces \"Some of the most important things, either new or restored, treated in this exposition.\nBiancani attached to this work his mathematical chronology\nDe Mathematicarum natura dissertatio una cum clarorum mathematicorum chronologia\nⓉ\n(\nA dissertation on the nature of mathematics together with a chronology of famous mathematicians\n)\n. This work, which is unfortunately full of errors, is discussed in\n[\n5\n]\nin which Giulio Cesare Giacobbe shows that:-\nGiuseppe Biancani's treatise, 'De mathematicarum natura disertatio'\n(\nBologna,\n1615)\n... tried ... to assert the inclusion of mathematics into the formal structure of Aristotelian syllogistics ...\nAs to the chronology errors, let us give some examples:\nThabit ibn Qurra\n(836\n-\n901)\nwhom Biancani gives as a\n13\nth\ncentury scholar,\nRoger Bacon\n(1214\n-\n1292)\nwho is given as a\n14\nth\ncentury scholar, and\nLeonardo Pisano\n(\nFibonacci\n)\n(1170\n-\n1250)\nwho is put in the\n15\nth\ncentury.\nIt is not entirely clear where Biancani stood on the question of a geocentric or heliocentric system. He held\nGalileo\nin the highest esteem yet he believed in a stationary earth. Whether this was on scientific grounds, or whether he felt that he had to present this view to stay on the right side of the Church is a little hard to determine. His second major publication\nSphaera mundi, seu cosmographia demonstrativa, ac facili methodo tradita\nⓉ\n(\nSphere of the world, or demonstrative cosmography, and delivered in an easy method\n)\nwas completed in\n1615\n. In it Biancani presented details of the work of\nNicolaus Copernicus\n,\nTycho Brahe\n,\nJohannes Kepler\n, and\nGalileo\n. It also recorded his own observations with a telescope. However, the book again had difficulties with the censor and it was\n1620\nbefore it was finally published. Let us present here what Biancani writes about the geocentric/heliocentric controversy and let the reader judge his real beliefs:-\nThis ancient\n[\nheliocentric\n]\nbelief was brought back to life again in the past century by\nNicolaus Copernicus\n, a man of sharp mind and a great restorer of the science of astronomy. He even defended it against the argument of other men, so that today some mathematicians of high repute, as for example\nJohannes Kepler\n, William Gilbert\n(\nauthor of 'De magnetica philosophia'\n)\n, and others, support the same unfortunate view. Other mathematicians reject this view as absurd.\nCopernicus\nactually added that not only is the earth moved in the ecliptic, but together with the earth, the water and the air and all the 'interlunary' sphere, in just the same proportion as the earth moves, by which hypothesis not only do\nCopernicus\nand his followers seek to save appearances but also believe they easily escape the counter-arguments of their opponents. For all that, however, this opinion is false and must be rejected\n(\neven if supported by better proofs and arguments\n)\n, as is manifest by reasons given formerly and by many opinions of authorities; all the more because it has been forbidden by the ecclesiastical authorities as contrary to Holy Writ.\nHere is Biancani's description of Jupiter's four moons:-\nIt is a remarkable and happy discovery, which has been found by the power of the telescope, that Jupiter is accompanied. And indeed there are always four tiny stars or planets about him, running courses round him ... It is thus that we see them on a clear night through the telescope pointed at Jupiter, and, as we look, we see near to the planet, sometimes one, sometimes two or three, at times even four, of these little stars keeping the planet company, which would be impossible if they were fixed and not moving stars. Sometimes too they appear nearer and sometimes further from the planet, which is only possible if we suppose that they trace circles about Jupiter, just as Mercury and Venus revolve about the sun. ...\nSphaera mundi\nⓉ\n(\nSphere of the world, or demonstrative cosmography, and delivered in an easy method\n)\nwas republished in\n1630\n,\n1635\nand\n1653\n. The last two of these have a posthumous publication of Biancani's attached, namely\nNovum instrumentum ad horologia describenda\nⓉ\n(\nA new instrument for describing horology\n)\n. This describes his method for constructing a sundial.\nDuring his final four years teaching at Parma, from\n1620\nto\n1624\n, Biancani taught\nGiovanni Battista Riccioli\nwho was one of his students.\nRiccioli\nmakes it clear what a strong positive influence Biancani had on him. Finally, we note that Biancani's writings on history, poetry and classical Greek and Latin have not survived. Let us end by recording, from\nMathematicarum natura dissertatio\nⓉ\n(\nDissertation on the nature of mathematics\n)\n, Biancani's view of mathematics:-\nIt absolutely follows that mathematics is superior to all other sciences, in the same way that truth is superior to all opinions."
}