{
  "nome_completo": "Giuseppe Piazzi",
  "nome_curto": "Giuseppe Piazzi",
  "ano_nascimento": "1746",
  "ano_morte": "1826",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Piazzi/",
  "lugar_nascimento": "Ponte in Valtellina, now in Italy",
  "lugar_morte": "Naples, now in Italy",
  "biografia": "We note first that\nGiuseppe Piazzi\nwas given the name\nGioacchino Giuseppe Maria Ubaldo Nicolò Piazzi\nbut was called Giuseppe by his parents, Bernardo Piazzi and Francesca Artaria, to honour Saint Joseph. Since he is now known almost exclusively by the name Giuseppe Piazzi so we follow this standard practice. His parents came from one of the wealthiest families in the Lombardy region where Giuseppe was born, around\n100\nkm north east of Milan. His parents had ten sons, with Giuseppe as the second youngest, but very few of his siblings survived their childhood. In fact Giuseppe was so frail when he was born that his parents feared to would not survive long enough to be baptised in a church so thy baptised him at home. His baptism is recorded in the church of St Maurizio in Milan where it is noted that his home baptism was \"because of impending danger of death.\"\nNothing is known about Piazzi's early education but it is thought he studied at the Piarist monastery in Milan which later, in\n1792\n, became the Calchi Taegi College, and then at the Accademia Scientifico Letteraria in Milan. In\n1764\nat the age of nineteen, he joined the Congregation of Clerics Regular, commonly known as the Theatines Order. He was sent to study philosophy in Turin and while there became interested in mathematics through the teaching of Giambattista Beccaria\n(1716\n-\n1781)\n, who is famed for his scientific study of electricity and for his correspondence with\nBenjamin Franklin\n. Piazzi was then sent to Sant'Andrea della Valle, the Theatines basilica in Rome, to study theology. While in Rome, Piazzi studied under Thomas Le Seur\n(1703\n-\n1770)\nand\nFrançois Jacquier\n(1711\n-\n1788)\nwho were based in the College of Trinità dei Monti.\nJacquier\n, the professor of experimental philosophy at La Sapienza, and Le Seur, the professor of higher mathematics, had worked with\nRoger Boscovich\n. In collaboration with\nJean Louis Calandrini\n, the professor of mathematics in Geneva,\nJacquier\nand Le Seur had edited and annotated an edition of\nNewton\n's\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\npublished in three volumes,\n1739\n,\n1740\nand\n1742\n.\nPiazzi was ordained a priest in\n1769\nand assigned to Genoa to teach philosophy. He soon accepted the chair of mathematics at the University of Malta, taking up the appointment in July\n1770\n, but when the university was briefly suspended in\n1773\nhe was sent to teach philosophy and mathematics, and to direct the College of Santa Caterina, better known as the College of Nobles, in Ravenna. He remained there until\n1777\n. He was in Cremona in\n1778\n, then went to Sant'Andrea della Valle in Rome where he taught theology from\n1779\nto\n1781\n. There he was a colleague of Luigi Barnaba Chiaramonti\n(1740\n-\n1823)\nwho, in\n1800\n, became Pope Pius VII. Piazzi and Chiaramonti were friends for the rest of their lives. In March\n1781\n, Piazzi left Rome to take up an appointment as professor of mathematics at the Accademia de' Regi Studi in Palermo\n(\nwhich became the University of Palermo in\n1806)\n. As a mathematician Piazzi was knowledgeable about the latest developments in the subject and was regarded as an excellent teacher. He does not appear to have undertaken research in the subject and certainly did not publish any mathematics papers.\nIn\n1786\nFrancesco d'Aquino, Prince of Caramanico\n(1738\n-\n1795)\nwas made viceroy of Sicily, replacing Domenico Caracciolo\n(1715\n-\n1789)\n. The Prince of Caramanico made Piazzi professor of astronomy on\n19\nJanuary\n1787\nand put him in charge of a project to build an observatory at Palermo. At this time he had little, if any, experience as an astronomer and, in recognition of this, Piazzi was given a grant to allow him to visit astronomers in France and England. In March\n1787\nPiazzi set off for Paris where he met\nDominique Cassini\nwho had become Director of the Paris Observatory in\n1784\nfollowing the death of his father\nCésar-François Cassini de Thury\n. He also learnt much from\nJérôme Lalande\nwho was professor of astronomy at the Collège Royale. Other useful contacts in Paris were\nPierre Méchain\n, the editor of the astronomical almanac\nConnaissance des temps\nⓉ\n(\nKnowledge of times\n)\n, and his friend and collaborator Charles Messier who is famed for his catalogue of nebulas which he made to assist him in his search for comets. Piazzi then went to England where he met\nNevil Maskelyne\n,\nJesse Ramsden\nand\nWilliam Herschel\n. These three men were all important in Piazzi's future career as an astronomer\n[\n1\n]\n:-\nHe investigated\nHerschel\n's large telescopes\n(\nindeed, he fell and broke his arm while examining one of them that was mounted outdoors\n)\nand, with\nMaskelyne\n, observed at Greenwich the solar eclipse of\n3\nJune\n1788\n. His first astronomical work, a study of the difference in longitude between various observatories, based on that of Greenwich, was published in the 'Philosophical Transactions' of the Royal Society in\n1789\n. The most important result of Piazzi's English visit, however, was the great five-foot vertical circle, a masterpiece of eighteenth-century technology, that he commissioned from\nRamsden\n.\nRamsden\nwas the leading\n18\nth century instrument maker and the\n5\n-foot circle he made was installed in\n1789\nin the Palermo Observatory which was being constructed in the Santa Ninfa tower of the royal palace. There is little doubt that this instrument was considerably more accurate than any other in use at this time. The Palermo Observatory officially opened in\n1790\nwith Piazzi appointed as its director and, encouraged by having the accurate Palermo Circle, he set up an observing programme to take full advantage. He began making observations in May\n1791\nand published his first results in early\n1792\n.\nFrancis Wollaston, a clergyman and amateur astronomer with his own private observatory, had published the catalogue of stars and nebulae\nSpecimen of a general astronomical catalogue arranged in zones of north polar distanc\ne in\n1789\n. This catalogue was used by\nWilliam Herschel\nand it is likely that Piazzi had discussed it with him. The catalogue was known to contain inaccuracies and Piazzi, with his superior instrument, decided to obtain improved data. He wrote\n(\nsee, for example,\n[\n18\n]\n)\n:-\nWhen in\n1792\nI started to study the stars that are in Mr Wollaston's catalogue, I decided to study the stars that are in the area of my telescope and note them.\nOn\n1\nJanuary\n1801\n, Piazzi was working with his assistant Niccolò Cacciatore\n(1770\n-\n1841)\n. Cacciatore had studied mathematics and physics at Palermo and began to assist Piazzi in\n1798\n, officially becoming his assistant in\n1800\n. It was on this first day of\n1801\nthat Ceres was first seen by Piazzi and we give below the account by Captain Basil Hall in\n1841\n, relating the story as told to him by Niccolò Cacciatore, Piazzi's assistant in\n1801\nbut the Director of the Palermo Observatory by the time the meeting with Basil Hall took place\n(\nsee, for example,\n[\n12\n]\n)\n:-\nMost people are aware that the celebrated astronomer Piazzi discovered the small planet Ceres at Palermo in this very observatory, with an instrument of\nRamsden\n's which we had the satisfaction of seeing. It was made on the\n1\nst of January,\n1801\n, at which period the present astronomer, Cacciatore, was Piazzi's assistant in the observatory of which he is now the chief. As Piazzi was at that time engaged in making the noble catalogue of the stars, which has since become so well known, he placed himself at the telescope, and observed the stars as they passed the meridian, while Cacciatore wrote down the times, and the polar distances, as they were read off by his chief. Certain stars passed the wires, and were recorded as usual on the\n1\nst of January,\n1801\n. On the next night, when the same part of the heavens came under review, several of the stars observed the evening before were again looked at, and their places recorded. Of these, however, there was one which did not fit the position assigned to it on the previous night, either in right ascension, or in declination. \"I think,\" said Piazzi to his companion, \"you must, accidentally, have written down the time of that star's passage, and its distance from the pole, incorrectly.\" \"To this,\" said Cacciatore, who told me the story, \"I made no reply, but took especial pains to set down the next evening's observations with great care. On the third night there again occurred a discordance, and again a remark from Piazzi that an erroneous entry had probably been made by me of the place of the star. I was rather piqued at this,\" said Cacciatore, \"and respectfully suggested that possibly the error lay in the observation, not in the record. Under these circumstances, and both parties being fully awakened as to the importance of the result, we watched for the transit of the disputed star with great anxiety on the fourth night. When lo, and behold! it was again wide of the place it had occupied in the heavens on the preceding and all the other nights on which it had been observed. 'Oh, oh!' cried the delighted Piazzi, 'we have found a planet while we thought we were observing a fixed star; let us watch it more attentively?'\" The result soon confirmed this conjecture, and thus was made one of the most interesting, and I may say useful, astronomical discoveries of modern times.\nFor more information on the search for the \"missing planet\", see\nTHIS LINK\n.\nThe way that Piazzi announced his discovery was a little strange. The following notice, dated\n15\nJanuary\n1801\n, appeared in the\nJournal de Paris\nin February\n1801\n:-\nSicily - Palermo, January\n15\n. On the\n1\nst of this month, a new comet in the shoulder of Taurus, near the\n19\nth star of Mayer, was discovered from our observatory. It was observed on\n1\nst,\n2\nnd,\n3\nrd and\n4\nth, as it passed the meridian. Although it is not covered with any kind of nebulous spot, it still cannot be seen with the naked eye. Its movement is retrograde; it goes forward towards the north.\nOne has to assume this was sent by Piazzi\n(\nalthough it is just possible, but unlikely, it was sent by Cacciatore\n)\nbut no name is attached.\nLalande\n, the leading astronomer of the day, learnt of the discovery by reading this notice; Piazzi did not inform him personally. In fact initially Piazzi only sent letters reporting his discovery to two people, Johann Elert Bode and Barnaba Oriani, on\n24\nJanuary. Bode, the director of the Berlin Observatory, received his letter on\n20\nMarch, but Oriani, who worked at the Observatory of Brera in Milan, only received it on\n5\nApril. The delay in the letter reaching Oriani in Milan was due to the occupation by Napoleon. We should note that Oriani was a natural person for Piazzi to write to since the two were long term friends and collaborators. Let us note a rather telling difference in the two letters. To Bode he states that he had discovered a comet but to his friend Oriani he says\n[\n21\n]\n-\nI have announced this star as a comet, but since it shows no nebulosity, and moreover, since it had a slow and rather uniform motion, I surmise that it could be something better than a comet. However, I would not by any means advance publicly this conjecture. As soon as I shall have a larger number of observations, I will try to compute its elements.\nConfusion arose from the\nJournal de Paris\nannouncement since it contains a misprint. Instead of the \"\n19\nth star of Mayer,\" it should have read the \"\n109\nth star of Mayer.\" This refers to the catalogue of stars by\nTobias Mayer\n.\nTwo further \"planets\" with orbits between Mars and Jupiter were discovered in the following years, Pallas in\n1802\nand Juno in\n1804\n. In\n1806\nDelambre\nwrote about these discoveries and praised the way that Piazzi had made his discovery\n[\n21\n]\n:-\nWe further remark that these four planets\n[\nUranus, Ceres, Pallas, and Juno\n]\nwere found while searching for something else, and conclude that the real way to deserve and to encounter such accidents is to be occupied in some grand undertaking, which in itself is of real use, and keeps us constantly on the route to such discoveries; it is, for example, to work, as M Piazzi, to perfect and augment the stellar catalogue, observing each star repeatedly for several days: this method has the double advantage to register in the catalogue only the reliable positions, and to evidence in the long run the planets that could still be confused among the innumerable quantity of very faint stars scattered in the sky.\nFor more information about the naming of Ceres and establishing its orbit, see\nTHIS LINK\n.\nIn\n1803\nPiazzi published his first catalogue of stars\nPraecipuarum stellarum inerrantium positiones mediae ineunte seculo XIX ex observationibus habitis in specula Panormitana ab\n1792\nad annum\n1802\nⓉ\n(\nThe positions of the principal fixed stars of the middle ages at the beginning of the nineteenth century from observations held in the Palermo observatory from\n1792\nto the year\n1802\n)\n. This catalogue contained\n6784\nstars whose positions were computed with great accuracy. The Institut de France awarded Piazzi the\nLalande\nprize for publishing the best astronomical work in\n1803\n. An appendix to this catalogue contained a list of\n225\nstars which Piazzi claimed to have measured proper motions. He had observed these stars over a period of ten years and, given the accuracy of his measurements, firmly believed he had found they exhibited proper motion. He realised, however, that ten years was quite a short period over which to measure proper motion and wrote in a letter to Oriani on\n5\nAugust\n1803\nthat he believed his fellow astronomers\n[\n35\n]\n:-\n... are going to think that I am a fool because I have deduced the proper motions of a few stars on the observations of only ten years, and in some cases less than that.\nIn\n1804\nPiazzi sent the work\nSaggio sui movimenti propri delle fisse\nⓉ\n(\nEssay on the movements of the fixed stars\n)\nto the Istituto Nazionale Italiano which was based in Bologna. The Preface begins as follows\n(\nwe have given the names of the astronomers mentioned by Piazzi in the style commonly used today\n)\n:-\nEdmond Halley\n, towards the beginning of the last century, having compared the longitudes of the stars reported in the 'Almagest' with those observed in his day, was the first to recognise in some of them motions which were fully distinguished from the annual precession.\nJacques Eugène d'Allonville de Louville and\nJacques Cassini\nconfirmed this interesting discovery, and\nTobias Mayer\nextended it and gave further confirmation, comparing his observations with those of Ole Romer. These first steps, however, did not advance beyond a very few stars, and even these were not able to be given with precision. Quite exact and remote observations were lacking, so nothing could be affirmed with certainty. Our age was somewhat less difficult; and through the catalogues of\nJohn Flamsteed\n, and principally of\nNicolas-Louis Lacaille\nand\nTobias Mayer\n, it was possible to assign particular motions to several stars. We owe this to the work of\nMaskelyne\n,\nLalande\n, and others; but above all to that of the Vienna astronomer Franz de Paula Triesneker. Very little has been done up to now, and very much remains to be done. If motions are found, to be well established they need to be verified and confirmed; and I want to examine no less the many other stars registered in the catalogues which are not yet subjected to discussion. For this reason, after the publication of my catalogue, having in\n1803\nre-observed many stars contained therein, I entered into the hope of being able to somewhat promote this still nascent very important part of astronomy. For now I have chosen about three hundred stars among those re-observed in\n1803\n; and I have tried to investigate the variations to which they seem subjected. If this first essay will be so fortunate to obtain the approval of the National Institute, to which I dedicate it, I hope to be able to subsequently give it a continuation regarding all the stars of\nFlamsteed\n,\nLacaille\nand\nMayer\n.\nPiazzi sent his\nSaggio\nⓉ\n(\nEssay on the movements of the fixed stars\n)\nto the Istituto Nazionale in Bologna since they had elected him a fellow in April\n1803\nand, if he had been a citizen of the Cisalpine Republic, he would have received a pension being\n58\nyears of age. He was trying to impress them so that they might make an exception to this \"nationality\" rule. The Istituto Nazionale was going through somewhat difficult times, however, mainly as a result of Napoleon's invasion. When publication was delayed, Piazzi tried to get his\nSaggio\nⓉ\n(\nEssay on the movements of the fixed stars\n)\nreturned to allow him to make corrections and additions. It was never returned to him, however, and appeared in print in\n1806\nin the form which he had submitted it three years earlier. He decided to publish a second list and this appeared as\nLibro sesto del Reale Osservatorio di Palermo\nⓉ\n(\nSixth book of the Royal Observatory of Palermo\n)\nin\n1806\nwith the positions and proper motions of\n220\nstars. He claims that the proper motion of\n60\nof these stars is certain and lists three, μ Cassiopeia,\n61\nCygni and D Eridani, as three stars for which astronomers should attempt parallax measurements because of their large proper motions.\nAt this time distances to the stars were unknown and astronomers, assuming reasonably but wrongly that the brightest stars were closest, tried to measure their parallax. Piazzi's suggestion never seems to have been followed up. In\n1812\nBessel\nsuggested\n61\nCygni as a good candidate for parallax measurement but it was not until\n1838\nthat he succeeded in making the parallax measurement of that star, the first such measurement.\nBessel\nhas received much praise for realising that\n61\nCygni was a good candidate, but Piazzi, being the first to suggest\n61\nCygni, deserves praise too.\nFrom\n1807\nPiazzi's eyesight became very poor and he had to end his days as an observer. He continued to direct the observatory and his assistant Niccolò Cacciatore made the observations. When the second star catalogue was published in\n1814\nit was mostly based on Cacciatore's observations. A review in the\nPhilosophical Magazine\nof\n1827\nreads:-\nUpon the whole, this work reflects great credit on the distinguished astronomer who now conducts the observatory at Palermo. The plan, although nearly the same as was pursued by M Piazzi, and therefore not altogether new, is different from the printed observations of other observatories: and is in many respects worthy of imitation. For, although we would not wish to be considered as discouraging the printing of observations in the order, and in the manner in which they are actually made, yet we are certainly desirous, in common with many others that are fond or astronomy, of seeing the reductions of those observations a little more frequently than we do ...\nIn\n1817\nPiazzi published the two-volume book\nLezioni elementari di astronomia ad uso del Real Osservatorio di Palermo\nⓉ\n(\nElementary astronomy lessons for use by the Royal Observatory of Palermo\n)\n. He begins the Preface as follows:-\nWhen the direction of this Observatory was entrusted to me, and the task of guiding the young students to the knowledge of astronomical things, I devised and arranged those courses of lessons which seemed to me the most suitable for this purpose. In view of the progress which has been made in this science since that time, I have not neglected to insert appropriate additions from time to time, particularly after the publication of the distinguished work 'Astronomie Theorique et Pratique' by\nDelambre\n. In doing this I have never aimed at anything other than private instructions, which I regularly give within the domestic walls of the Observatory itself; nor had it occurred to me to write for the public, writing only for my students. But this book happened thanks to the authority of the Supreme Magistrate of Studies, who graciously welcoming and seconding the attentions of the young scholars, wanted these writings to be printed and brought to light. Here they are therefore as they are, not as I would like them to be; it is my belief that they will be of some benefit to the young, for whom they are only intended.\nOn\n8\nMarch\n1812\n, soon after Joachim Murat became king of Naples, he approved the building of a new observatory on the Miradois hill near the royal palace of Capodimonte. Following the defeat of Napoleon, Ferdinand I became king of the Kingdom of the Two Sicilies in\n1816\nand he asked Piazzi to go to Naples and arrange for the completion of the observatory there. Piazzi was reluctant to accept since he felt he had been treated with such kindness in Palermo. The king, therefore, agreed that Piazzi could be in charge of both observatories and divide his time between the two. He did this and in\n1817\nhis former assistant Niccolò Cacciatore was appointed as director of the Palermo observatory while Piazzi arranged for Carlo Brioschi\n(1782\n-\n1833)\nto become the director of the Naples observatory. Brioschi made the first observations from the completed Capodimonte observatory on\n17\nDecember\n1819\n.\nIn\n1824\nPiazzi, now in very poor health, settled in Naples. He was elected to the Academy of Sciences of Naples and was commissioned by the King to reform the system of weights and measures. His health deteriorated still further and he died in Naples in\n1826\nat the age of eighty.\nIn\n2007\nNASA's Dawn mission launched from Cape Canaveral in Florida on a journey to orbit Vesta and Ceres. On\n6\nMarch\n2015\nDawn was captured by Ceres and began to orbit it. Marc Rayman, mission director and chief engineer for Dawn at NASA's Jet Propulsion Laboratory, Pasadena, California, said\n[\n7\n]\n:-\nWhen Piazzi discovered Ceres, exploring it was beyond imagination. More than two centuries later, NASA dispatched a machine on a cosmic journey of more than\n3\nbillion miles to reach the distant, mysterious world he glimpsed. Our knowledge, our capabilities, our reach and even our ambition all are far beyond what Piazzi could have imagined, and yet it is because of his discovery that we can apply them to learn more, not only about Ceres itself but also about the dawn of the solar system."
}