{
  "nome_completo": "Goro Shimura",
  "nome_curto": "Goro Shimura",
  "ano_nascimento": "1930",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shimura/",
  "lugar_nascimento": "Hamamatsu, Japan",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Goro Shimura\n's father worked for a bank and moved frequently from one branch of the bank to another. Even after Goro's birth, the family moved from one house to another in Hamamatsu, a city about\n240\nkm west of Tokyo. He was the youngest of his parents' five children, having three sisters and a brother. In March\n1933\nthe family moved to Tokyo and, three years later, in April\n1936\n, Goro began his schooling. In\n1938\nthe family moved to a larger home in Tokyo but Goro continued to attend the same elementary school until he had completed the forth grade. After that he attended an elementary school near his home in the Nishi-Ohkubu district, completing the fifth and sixth grades. Shimura began his studies in the Fourth Tokyo Prefectural Middle School in\n1942\nbut there was little to excite him in the mathematics teaching\n[\n1\n]\n:-\nClasses in mathematics were not very interesting. We again learned arithmetical operations of fractions and decimals, which was all right. But we were asked to solve artificial arithmetical problems without using algebra. ... I never found such problems interesting.\nThese were difficult times due to World War II - it meant that life was lived in a strained atmosphere with military training as part of the school curriculum. In November\n1944\nthe school closed and the boys were sent to work in factories located in the countryside. He writes\n[\n1\n]\n:-\nWhile in middle school during the last period of the war, we were forced to work in a factory that made parts for fighter planes, and at that point I knew the meaning of the labour in such a place.\nHis home was destroyed in a bombing raid, but the family survived. When the war ended, the middle school opened again and he continued his education. At this time his parents' home was in Mitaka, west of Shinjuku, and he travelled to school by train. There had been food shortages during the war but, after the war ended, the shortages became worse and Shimura was constantly hungry.\nIn\n1946\nShimura entered the First High School. It was a boarding school and he lived in a dormitory but food shortages meant that after a few weeks everyone was sent home for a holiday. At the High School he studied mathematics, English, German and French but found the mathematics courses rather disappointing. He felt that the course he took on analytical geometry was taught by a teacher who did not fully understand the subject.\nShimura began his studies at the University of Tokyo in\n1949\n. Again he is critical of the material he was taught, however\n[\n1\n]\n:-\nMy wish that I would be able to learn plenty of good mathematics at the university was soon betrayed by reality. For one thing, while in high school, I had acquired a decent amount of mathematical knowledge, and there was not much new in what was being taught in the first year at the university. But more importantly, the professors and associate professors at that time did not give much serious thought to the question of what should be taught. It was the same story as what I experienced in the first year in middle school. They were simply repeating the old stuff, which should have been replaced by better material.\nThe course Shimura enjoyed most was taught by\nKenkichi Iwasawa\n, but again Shimura is critical saying that\nIwasawa\n\"was lecturing for himself, not for the students\". He graduated from the University of Tokyo in\n1952\nand was appointed as an assistant at the College of General Education of the University of Tokyo. His first paper\nOn a certain ideal of the center of a Frobeniusean algebra\nwas published in the year he graduated. It was at this time that he began his career as a mathematician which, he suggests, was sparked by two events. One was the visit of\nClaude Chevalley\nto Japan in\n1953\n.\nChevalley\ngave a lecture course at the University of Tokyo describing his latest results in the theory of algebraic groups. Shimura produced a better proof of one of\nChevalley\n's lemmas and when the lecture notes were published in\n1954\nthey contained Shimura's proof with the comment:-\nThe following proof of this lemma has been communicated to me by Mr Shimura.\nThe second event that Shimura considers began his mathematical career was his attendance at a conference on\nalgebraic geometry\nand number theory in March\n1953\norganised by Yasuo Akizuki at Kyoto University. Akizuki was building a strong School of Algebraic Geometry in Kyoto and he asked Shimura to talk at the conference, which was also attended by\nYutaka Taniyama\n. In\n1954\nShimura was appointed as a lecturer at the University of Tokyo, being promoted to associate professor in\n1957\n. He taught linear algebra and calculus and continued to undertake research publishing articles\nA note on the normalization-theorem of an integral domain\n(1954)\nand\nReduction of algebraic varieties with respect to a discrete valuation of the basic field\n(1955)\n. He had corresponded with\nAndré Weil\nin\n1953\nand met him in\n1955\nat the International Symposium on\nAlgebraic Number Theory\n, Tokyo-Nikko, at which\nWeil\nwas one of the keynote speakers. It was at this International Symposium that the Shamura-\nTaniyama\nconjecture had its genesis. The conjecture claims:-\nEvery elliptic curve defined over the rational field is a factor of the Jacobian of a modular function field.\nThis conjecture had a major influence on the development of mathematics, and in particular proved important in the proof of\nFermat\n's Last Theorem.\n(\nFor more details concerning the Shamura-\nTaniyama\nsee the interesting articles\n[\n4\n]\nand\n[5])\n. Shimura presented his paper\nOn complex multiplications\nto the International Symposium and, probably as a result of meeting\nWeil\n, Shimura received an invitation from him in\n1956\nto spend the academic year\n1957\n-\n58\nin Paris.\nHenri Cartan\narranged a position of 'chargé de recherches' for him at the Centre National de la Recherche Scientifique\n(\nNational Centre for Scientific Research\n)\nin Paris. Before he left for Paris his book\nModern number theory\n(\nJapanese\n)\n, written in collaboration with\nYutaka Taniyama\n, was published. Shimura wrote the Preface which begins:-\nThe progress of algebraic geometry has had a strong influence on number theory. It has been an important problem to establish a higher-dimensional generalization of the classical theory of complex multiplication by\nKronecker\nand to complete the work left by\nHecke\n. By means of the language of algebraic geometry we can now add new knowledge in that direction. We find it difficult to claim that the theory is presented in a completely satisfactory form. In any case, it may be said, we are allowed in the course of progress to climb to a certain height in order to look back at our tracks and then to take a view of our destination.\nThe Paris trip was memorable for Shimura. He wrote\n[\n2\n]\n:-\nIn\n1957\nwhile in Paris I became interested in\n[\nthe Fuchsian group of\nPoincaré\ntype\n]\n. I had just finished my first work on the zeta functions of elliptic modular curves. Though I knew that it needed elaboration, I was more interested in finding other curves whose\nzeta functions\ncould be determined. I was also trying to formulate the theory of complex multiplication in higher dimension in terms of the values of automorphic functions of several variables  -\nSiegel\nmodular functions, for example. It turned out that these two problems were inseparably connected to each other. Also, nobody else was working on such questions.\nHe attended the International Congress of Mathematicians in Edinburgh, Scotland, in August\n1958\n, during the months of the Paris trip, as an official Japanese delegate and presented his paper\nFonctions automorphes et correspondances modulaires\n. In addition to this visit to Scotland, was able to make other trips from Paris, going to Switzerland, Germany and Italy. While he was in Paris he made remarkable mathematical advances on modular function fields and modular correspondences, as well as on the Fuchsian group of\nPoincaré\ntype. This last investigation formed the topic of his lecture at the International Congress in Edinburgh. Also he was able to find 'a completely satisfactory form' for the theory which he had presented in\nModern number theory\n(\nJapanese\n)\n. At the end of his ten-month Paris visit, Shimura spent seven months at the Institute for Advanced Study at Princeton. In fact\nWeil\nhad been appointed as a professor at Princeton so Shimura remained in contact with\nWeil\nduring this visit. He returned to Tokyo in the spring of\n1959\nand, later that year, married Chikako Ishiguro whom he had known for six years. Although his research was going well in Tokyo, he was not enjoying his teaching there. In the spring of\n1961\nhe moved to Osaka University having been persuaded by\nYozo Matsushima\n. His move meant that he moved from associate professor to full professor but his salary remained the same. In fact, due to additional duties in Tokyo which had brought in extra funds, he now had to live on a reduced income. He decided to try to move to the United States.\nThe opportunity arose when\nAndré Weil\nvisited Japan in\n1961\nand Shimura asked him if it would be possible to find a position for him in the United States.\nWeil\narranged a position at Princeton and, in September\n1962\n, Shimura returned to Princeton but this time he was attached to the University, not the Institute for Advanced Study where he had spent time earlier in his career. Let us look at some of the other books he has published. His book\nAutomorphic functions and number theory\n(1968)\nis reviewed by S Chowla:-\nThis is a charming little book. It introduces the reader to one of the most beautiful parts of mathematics.\nIn\n1971\nhe published\nIntroduction to the arithmetic theory of automorphic functions\nstating in the Preface that the two major topics in the monograph are:-\n... complex multiplication of elliptic or elliptic modular functions and applications of the theory of\nHecke\noperators to the zeta-functions of algebraic curves and abelian varieties.\nIn\n1977\nhe was awarded the\nCole\nPrize for Algebra by the\nAmerican Mathematical Society\n:-\n... for his two papers \"Class fields over real quadratic fields and Hecke operators\" and \"On modular forms of half integral weight\".\nIn\n1996\nhe received the Steele Prize for Lifetime Achievement from the\nAmerican Mathematical Society\n. The citation reads:-\nTo Goro Shimura for his important and extensive work on arithmetical geometry and automorphic forms; concepts introduced by him were often seminal, and fertile ground for new developments, as witnessed by the many notations in number theory that carry his name and that have long been familiar to workers in the field.\nHe began his response as follows:-\nI always thought this prize was for an old person, certainly someone older than I, and so it was a surprise to me, if a pleasant one, to learn that I was chosen as a recipient. Though I am not so young, I am not so old either, and besides, I have been successful in making every newly appointed junior member of my department think that I was also a fellow new appointee. This time I failed, and I should be grateful to the selection committee for discovering that I am a person at least old enough to have his lifetime work spoken of. There are many prizes conferred by various kinds of institutions, but in the present case, I view it as something from my friends, which makes me really happy. So let me just say thank you, my friends!\nIndeed Shimura was right to consider that he was \"not so old\" for he continued to produce important monographs. He published\nEuler products and Eisenstein series\n(1997)\nwhich M Ram Murty reviewed - we give the first and last paragraphs of his interesting review:-\nThis monograph focuses on three objectives:\n(\ni\n)\nthe determination of local Euler factors on classical groups, in an explicit rational form;\n(\nii\n)\nEuler\nproducts and\nEisenstein\nseries on a unitary group of an arbitrary signature;\n(\niii\n)\na class number formula for a totally definite Hermitian form. It is written in an expository style, so that it can be viewed as an introduction to the theory of automorphic forms of several variables.\n...\nIn conclusion, this monograph has many didactic features that make it worthy of study by both graduate students and researchers. It is notable that the collection of appendices, as well as the material on algebraic groups and their localizations,\nEisenstein\nseries and their analytic continuations, that was scattered in the research literature, sometimes without proof, and often relegated to the background as \"well-known\", is now gathered together in this volume.\nShimura's next book\nAbelian varieties with complex multiplication and modular functions\n(1998)\nwas an expanded edition of his\n1961\ntext\nComplex multiplication of abelian varieties and its applications to number theory\nco-authored with\nYutaka Taniyama\n. This\n1961\ntext was, in turn, a rewrite of his joint book with\nTaniyama\nModern number theory\n(\nJapanese\n)\n(1957)\n. Since\nTaniyama\nhad died in\n1958\n, even the\n1961\ntext had been largely due to Shimura incorporating the new understanding that he had achieved during his Paris visit. Of course the area had developed markedly between\n1961\nand\n1998\n(\nwith considerable contributions by Shimura\n)\nso it will come as no surprise to learn that he added\n17\nnew sections for the\n1998\nmonograph. In\n2000\nShimura published\nArithmeticity in the theory of automorphic forms\nand then, in\n2004\n,\nArithmetic and analytic theories of quadratic forms and Clifford groups\n. In\n2007\nhe published\nElementary Dirichlet series and modular forms\nand in\n2010\nArithmetic of quadratic forms\n.\nNot all of Shimura's publications are on mathematics, however.\nThe Story of Imari: The Symbols and Mysteries of Antique Japanese Porcelain\nwas published in August\n2008\n. The contents are described as follows:-\nFired in the kilns of Arita, Japan, eight miles south of the seaport town after which it was named, Imari porcelain is distinguished by the beautiful visual effects produced by its blue underglaze and colour overglaze enamels. In \"The Story of Imari\", author Goro Shimura describes the cultural and historical significance of these prized porcelain bowls, plates, vases, teacups, and other wares. Examining the artistry and stories behind specific pieces, Shimura analyses their glazes, patterns, motifs, and functions, weaving in tales of emperors, tea ceremonies, cranes, surfing rabbits, and more. This is Imari in all its colourful glory, from the grandest histories to the smallest details.\nFinally let us mention Shimura's love of shogi, a Japanese form of chess played on a\n9\n×\n9\nboard."
}