{
  "nome_completo": "Grace Brewster Murray Hopper",
  "nome_curto": "Grace Hopper",
  "ano_nascimento": "1906",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hopper/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Arlington, Virginia, USA",
  "biografia": "Grace Hopper\nwas born\nGrace Brewster Murray,\nthe oldest of three children. Her father, Walter Murray, was an insurance broker while her mother, Mary Van Horne, had a love of mathematics which she passed on to her daughter. Both Grace's parents believed that she and her sister should have an education of the same quality as her brother.\nThe book\n[\n2\n]\ncontains a fascinating account of her childhood. It tells of summers spent with her cousins in their cottage on Lake Wentworth in Wolfeboro, New Hampshire and the games they played there such as kick-the-can, hide-and-seek and cops-and-robbers. It also describes her hobbies of needlepoint, reading and playing the piano. There were certainly signs in Grace's childhood of her fascination with machines and in\n[\n2\n]\nthere is a delightful story of how, when she was seven years old, she took her alarm clock to pieces to find out how it worked. Unable to reassemble it, she took to pieces the other seven clocks she found in the house before her mother discovered what was happening.\nGrace was educated at two private schools for girls, namely Graham School and Schoonmakers School both in New York City. Intending to enter Vassar College in\n1923\nshe failed a Latin examination and was required to wait another year. She spent the academic year at Hartridge School in Plainfield, New Jersey then entered Vassar College in\n1924\n. She studied mathematics and physics at Vassar College graduating with a BA in\n1928\n. After graduating she undertook research in mathematics at Yale University.\nIn\n1930\nGrace Murray married Vincent Foster Hopper, an English teacher from New York University. A Vassar College Fellowship allowed her to study at Yale University and, also in\n1930\n, Yale awarded her an MA. In\n1931\nshe began teaching mathematics at Vassar College as an instructor in the Department of Mathematics and she continued on the staff there until\n1943\n, having been promoted by that time to an associate professorship. Hopper was awarded her doctorate by Yale University in\n1934\nfor a thesis\nNew Types of Irreducibility Criteria\nwhich was supervised by\nØystein Ore\n. Hopper attended New York University as a Vassar Faculty Fellow in\n1941\n.\nHopper wanted to join the military as soon as the United States entered World War II. However her at\n34\nshe was too old\n(\nand not heavy enough for her height\n)\nto enlist and anyway as a mathematics professor her job was considered essential to the war effort. However she was determined to join the Navy and, despite being told that she could serve her country best by remaining in her teaching post at Vassar College, she eventually persuaded the Naval Reserve to accept her in\n1943\nand she also persuaded Vassar College to grant her leave.\nAfter initial training at Midshipman's School, after which she was commissioned a Lieutenant, Hopper was assigned to the Bureau of Ordnance Computation Project at the Cruft Laboratories at Harvard University. From\n1944\nshe worked with\nAiken\non the Harvard Mark I computer\n[\n7\n]\n:-\nOn her arrival at Cruft Laboratory she immediately encountered the Mark I computer. For her it was an attractive gadget, similar to the alarm clocks of her youth; she could hardly wait to disassemble it and figure it out. ... Hopper became the third person to program the Mark I.\nAiken\ngave her as a first programming task immediately she arrived at Harvard which was to:-\nCompute the coefficients of the arctan series by next Thursday.\nBy the end of the war, Hopper was working on the Harvard Mark II computer. It was in this machine that the first actual \"computer bug\" was found: a moth which shorted one of the\n17\n000\nrelays in the machine.\nIn\n1946\nHopper ended her active duty with the Navy but remained a duty reservist. She resigned her post at Vassar College so that she could remain at Harvard where she was appointed a Research Fellow in Engineering Sciences and Applied Physics in the Computation Laboratory. She continued to work on the Mark II, then later on the Mark III computer.\nIn\n1949\nHopper joined the Eckert-Mauchly Computer Corporation as a Senior Mathematician and there she worked with\nJohn Eckert\nand\nJohn Mauchly\non the UNIVAC computer. She designed an improved compiler while working for the company and was part of the team which developed Flow-Matic, the first English-language data-processing compiler\n[\n12\n]\n:-\nIn\n1952\nshe had an operational compiler. \"Nobody believed that,\" she said. \"I had a running compiler and nobody would touch it. They told me computers could only do arithmetic.\"\nHopper's reason for designing a compiler was, she wrote later, because she was lazy and hoped that the introduction of compilers would allow the computer programmer to return to being a mathematician. Indeed it may seem obvious to us today that this would be the route forward for computers but it was an extremely far sighted idea from Hopper. In fact thinking about how computers have developed, particularly with systems such as Mathematica and Maple available today, one sees the rather remarkable vision that Hopper had of how computers would become such an important tool for mathematicians.\nIn\n1950\nthe Remington Rand Corporation had acquired the\nEckert\n-\nMauchly\nComputer Corporation and changed its name to the UNIVAC Division of Remington Rand. Hopper became a Systems Engineer and Director of Automatic Programming Development of the UNIVAC Division. She continued her work on compilers, publishing her first paper on that topic in\n1952\n. She then participated in the work to produce specifications for a common business language. Since Flow-Matic was the only existing business language at that time, it was inevitable that it should provide the foundations for the specification of the language COBOL\n(\nCOmmon Business-Oriented Language\n)\nwhich eventually came out in\n1959\n. She had another important aim relating to compilers, namely that there should be standardisation. Her aim was that there should be international standardisation of computer languages and she strongly advocated validation procedures.\nHopper was never one to hold a single job at any one time. She was involved both with the academic world and with the Navy during the time that she held her positions in the Remington Rand Corporation, then from\n1955\nin the Sperry Corporation which had merged in that year with Remington Rand. Her connections with the academic world were many, sometimes visiting positions as in\n1959\nwhen she was a Visiting Lecturer at the Moore School of Electrical Engineering of the University of Pennsylvania. She was a consultant and lecturer for the United States Naval Reserve up to her retirement in December\n1966\n, by which time she had reached the rank of Commander.\nThe Navy and Hopper were not apart for very long for, in August\n1967\n, she was recalled to active duty in the Navy. At this time she took military leave from the Sperry Corporation and did not return to that job, retiring from it in\n1971\nwhen she reached\n65\nyears of age. Her return to the Navy was intended to be for only a six months period\n[\n5\n]\n:-\n... at the request of Norman Ream, then Special Assistant to the Secretary of the Navy for Automatic Data Processing. After the six months were up, her orders were changed to say her services would be needed indefinitely. She was promoted to Captain in\n1973\nby Admiral Elmo Zumwalt, Jr, Chief of Naval Operations. And in\n1977\n, she was appointed special advisor to Commander, Naval Data Automation Command, where she stayed until she retired.\nActive service in the Navy did not prevent Hopper holding academic appointments, and she was a Lecturer in Management Sciences at George Washington University between\n1971\nand\n1978\n.\nWhen Hopper retired from the Navy in August\n1986\n, at\n80\nyears of age, she was the oldest active duty officer in the United States. She had reached the rank of Rear Admiral, being promoted to the rank of Commodore in a White House ceremony in December\n1983\n, then becoming Rear Admiral Hopper in\n1985\n. At a celebration held in Boston on the USS Constitution to celebrate her retirement, Hopper was awarded the Defense Distinguished Service Medal, the highest award possible by the Department of Defense.\nAfter a career which involved many jobs in numerous quite different areas, one might have expected her to look forward to a quiet retirement. However, this was not her style and, remarkably, she was appointed a senior consultant to Digital Equipment Corporation after retiring from the Navy, a position she held until\n1990\n. Her job involved representing\n[\n3\n]\n:-\n... Digital at computer industry forums, making presentations on advanced computing concepts and the value of information and data, and serving as a corporation liaison with educational institutions.\nIn her long career Hopper received so many awards that it would be impossible to note more than a few in this article. She was elected a Fellow of the Institute of Electrical and Electronics Engineers\n(1962)\n, a Fellow of the American Association for the Advancement of Science\n(1963)\n, and received Achievement Awards from the Society of Women Engineers\n(1964)\nand from the Institute of Electrical and Electronics Engineers\n(1968)\n.\nHopper was named the first computer science Man of the Year by the Data Processing Management Association in\n1969\n. In\n1970\nshe received the Harry M Goode Memorial Award, a medal and $\n2\n,\n000\nawarded by the Computer Society:-\nFor her pioneering work and leadership in the development of computer software, and for her impact and influence on the computing profession and her fellow colleagues, and for her pioneering work and leadership in the development of important concepts for mathematical and business compilers, and for her contributions to the development and acceptance of English-language, problem-oriented programming, and for her outstanding work and continued efforts in the education and training of men and women for careers in computer science and data processing.\nShe became the first woman to be elected Distinguished Fellow of the British Computer Society in\n1973\n, being the first American elected to this honour. Also in\n1973\nshe was elected to the National Academy of Engineering and the Legion of Merit. Hopper collected a remarkable number of honorary degrees, receiving at least\n37\nbetween\n1972\nand\n1987\n.\nIn\n1991\nPresident George Bush awarded Hopper the National Medal of Technology. She was\n[\n3\n]\n:-\n... the first woman to receive America's highest technology award as an individual. The award recognises her as a computer pioneer, who spent a half century helping keep America on the leading edge of high technology."
}