{
  "nome_completo": "Graham Higman",
  "nome_curto": "Graham Higman",
  "ano_nascimento": "1917",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Higman/",
  "lugar_nascimento": "Louth, Lincolnshire, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Graham Higman\nwas the son of the Reverend Joseph Higman\n(1876\n-\n1954)\nand Susan Mary Ethel Ellis\n(1885\n-\n1951)\n. Joseph Higman, the son of a farmer born in Roche, Cornwell on\n28\nApril\n1876\n, had left school and was working as the clerk to a mining engineer at age fourteen in\n1891\n. He became a United Methodist Minister in\n1902\nand, in\n1909\n, married Susan Mary Ethel Ellis. Susan, born in St Keverne, Cornwall on\n10\nNovember\n1885\n, was the daughter of a Bible Christian Minister of Religion. We note that the Bible Christian Church was a denomination of the Methodist Church. The first of Joseph and Susan Higman's children, Woodman Francis Higman was born in January\n1911\nbut died in June of that year. Bryan Higman was born in Louth, Lincolnshire on\n18\nNovember\n1914\n, Graham Higman, the subject of this biography, was born on\n19\nJanuary\n1917\nand Graham's younger brother, Noel Higman, was born on\n20\nDecember\n1918\nin West Ham, London. Of course, with the strong family involvement with the Methodist Church, Graham was brought up in the Methodist tradition; the Methodist Church would form a major part of his whole life.\nThe family moved a number of times while Graham was growing up. In\n1918\nthe family moved to West Ham, London where they remained until\n1924\n. In that year they moved to Long Eaton, Derbyshire where they remained until\n1929\n. Graham entered Sutton Secondary School for Boys in Plymouth in\n1929\nwhen the family moved to that city. This school, first opened as the Regent Street Higher Grade School in\n1897\n, had been reorganised under the name Sutton Secondary School for Boys on\n13\nSeptember\n1926\n. The headmaster from\n1926\nto\n1935\nwas Alexander L Strachan. Higman said in the interview\n[\n11\n]\n:-\nI first became interested in mathematics in general when I was in school. In the same way as most school children choose a subject, it was the subject I was best at.\nIn his final year at Sutton Secondary School, in\n1934\nHigman won a natural sciences scholarship to study at Balliol College Oxford. He chose Balliol College because that was the College where his elder brother Bryan had studied but, since his elder brother had read chemistry, Graham decided he had to be different in some respect and so, despite holding a natural sciences scholarship, he chose to read mathematics.\nHigman's tutor was\nHenry Whitehead\nand it took a while before he realised that Higman was a natural pure mathematician since most students on a natural sciences scholarship would only take mathematics courses to support their science studies. Following a suggestion by\nWhitehead\n, Higman was a co-founder the 'Invariant Society'\n(\nan Oxford undergraduate mathematical society to \"promote interest in all branches of Mathematics\"\n)\nin\n1936\n. Higman was in\nWhitehead\n's office when the suggestion was made and, looking at the book shelves, he spotted\nOswald Veblen\n's\nInvariants of Quadratic Differential Forms\n. He immediately proposed the name 'Invariant Society'. The first speaker was\nG H Hardy\nwho addressed the Invariant Society in the Hilary Term of\n1936\non\nRound Numbers\n.\nHardy\ncalled a number 'round' if it is the product of a considerable number of comparatively small factors. Thus\n1200\n=\n2\n4\n.\n3.\n5\n2\n1200 = 2^{4}. 3. 5^{2}\n1\n2\n0\n0\n=\n2\n4\n.\n3\n.\n5\n2\nwould be called round.\nWhile studying as an undergraduate Higman became a fully accredited Methodist Local Preacher in\n1936\n. Marston Conder writes in\n[\n3\n]\n:-\nIt has been reported that Graham's Methodism was far from old-fashioned, and that he welded his faith to an understanding of evolution, and thought deeply about the role of the after-death in religion, which he described as \"one of the murkier areas of Christianity.\"\nAfter taking special topic courses on\ngroup theory\nand\ndifferential geometry\n, Higman received an MA in\n1938\n. After graduating he continued to study for his doctorate at Oxford. His doctoral research was supervised by the topologist\nHenry Whitehead\nand in\n[\n11\n]\nHigman explained how he became a group theorist despite having a topologist as advisor:-\nWhen I was an undergraduate I was interested in several branches of mathematics. When I became a research student under\nHenry Whitehead\n, who was of course a topologist, he put me on to a problem in group theory with the intention that it should be applied later on in\ntopology\n. I got as far as the group theory but I got stuck there so in a way you could say that I am a failed topologist and that's why I'm a group theorist.\nHe was awarded a DPhil. for his thesis\nThe units of group-rings\nin\n1941\n. In this work, among other results, he classified group rings over the rational numbers without non-trivial units. He had submitted the paper\nThe units of group-rings\nto the\nProceedings\nof the\nLondon Mathematical Society\non\n16\nFebruary\n1939\n. In it he writes:-\nI should like to thank Mr\nWhitehead\nfor many helpful suggestions and much good advice that he has given me, both in the investigation of these problems and in the writing of this paper.\nAfter his doctoral studies Higman spent a year at the University of Cambridge where he was strongly influenced by\nPhilip Hall\n. He also met\nMax Newman\nin Cambridge and\nNewman\n's interest in the interaction between group theory and logic had a lasting influence on him. By this time World War II had started and Higman had signed up as a conscientious objector. However he did war service in the Meteorological Office from\n1940\nto\n1946\n. He began this work, which did not involve using any mathematical skills or knowledge, in Lincolnshire, also spending time in Northern Ireland and Gibraltar.\nIn\n1941\nHigman married Ivah May Treleaven in Cockermouth, Cumberland. Ivah was born on the\n2\nMay\n1917\nin Portsmouth to the Methodist Minister Woodman Treleaven and his wife Mabel Helen Cassell. Graham and Ivah Higman had five sons and a daughter.\nAt the end of the war Higman decided to apply for a permanent post in the Meteorological Office but, after being asked at an interview why he had not chosen to enter the academic world, he turned down the offered post and looked for an academic career. The first offer of such a post came from the University of Durham but, preferring to go to Manchester to be with\nMax Newman\n, he turned down Durham before receiving any offer from Manchester. The offer from Manchester did come and, in\n1946\n, Higman was appointed as a lecturer in mathematics at the University of Manchester.\nWhen he first arrived at Manchester Higman worked with\nMax Newman\n. He had not undertaken research on mathematics during the war years and, surprisingly since he claimed to be a \"failed topologist\", his first paper submitted on\n26\nMarch\n1947\nwas a topology paper, namely\nThe compacting of topological spaces\n. His next paper,\nA theorem on linkages\n, submitted on\n27\nSeptember\n1947\n, is also a topology paper. His first group theory paper was\nNote on a theorem of R Baer\n(1949)\nwhich has the following Abstract:-\nIt is trivial that a group all of whose elements except the identity have order two is Abelian; and F Levi and\nB L van der Waerden\nhave shown that a group all of whose elements except the identity have order three has class less than or equal to three. On the other hand,\nR Baer\nhas shown that if the fact that all the elements of a group have orders dividing n implies a limitation on the class of the group, then n is a prime. The object of the present note is to extend this result by showing that if M is a fixed integer there are at most a finite number of prime powers n other than primes, such that the fact that all the elements of a group have orders dividing n implies a limitation on the class of its Mth derived group.\nWalter Ledermann\nwas, like Higman, appointed to Manchester in\n1946\nand then\nBernhard Neumann\narrived in\n1948\n. Higman and\nNeumann\ncollaborated proving a number of very significant results which we comment on below. Despite the large amount of activity in group theory which was going on in Manchester, Higman was ambitious and began to apply for professorships. It is not surprising that at this early stage in his career he was unsuccessful, but\nHenry Whitehead\nencouraged him to return to Oxford rather than to seek a chair at a second rate place. He did so in\n1955\nbeing appointed as a Lecturer in Mathematics in Oxford and then, very soon after, he was promoted to Reader in Mathematics. In\n1958\nhe was honoured with election as a Fellow of the\nRoyal Society of London\nand, in the same year, he became a Senior Research fellow at his old Oxford College, Balliol College.\nHigman was appointed Waynflete Professor of Pure Mathematics at Oxford in October\n1960\nand, at the same time, he was elected a Fellow of Magdalen College Oxford. He held these positions until he retired in\n1984\n. Immediately after he retired from Oxford, Higman went to the United States where he was\nGeorge A Miller\nvisiting professor at the University of Illinois for the two years from\n1984\nto\n1986\n.\nHigman is known for his outstanding work in all aspects of the theory of groups. He published on units in group rings, the subject of his doctoral thesis, in\n1940\nthen there was a break in his publication record during the time he worked in the Meteorological Office. We noted above that his\n1948\npapers are on somewhat different topics, being on topological spaces and linkages. They show the influences of\nHenry Whitehead\nand, to a lesser extent,\nMax Newman\n.\nIn\n1949\nHigman published one of several major pieces of work which stand as a landmark in the development of group theory. His paper\nEmbedding theorems for groups\nwritten jointly with both\nBernhard Neumann\n, who, as we noted, was a colleague of Graham Higman's at Manchester at that time, and with\nHanna Neumann\n, introduces the now standard group construction of HNN extensions\n(\nHigman-Neumann-Neumann extensions\n)\n.\nHigman published further important papers in\n1951\nwhen he gave an example of a finitely presented group which is isomorphic to a proper factor of itself, and Higman's famous example of a finitely generated infinite\nsimple group\n. Other work which he did around this time was on unrestricted free products and\ntopological groups\n.\nTwo further papers written jointly with\nBernhard Neumann\nwere\nGroups as groupoids with one law\nand\nOn two questions of Ito\n. After working on finitely generated\nnilpotent groups\nand infinite simple\npermutation groups\n, Higman, together with\nPhilip Hall\n, produced another of his landmark papers in\n1956\nOn the p-length of p-soluble groups and reduction theorems for Burnside's problem\n. It is this paper which introduced many important ideas but the most significant result was a reduction theorem for the restricted\nBurnside problem\nwhich essentially reduced the problem to looking only at groups of prime power exponent. This result plays a vital part in\nZelmanov\n's positive solution to the restricted\nBurnside\nproblem in the early\n1990\ns. Higman made other contributions to the\nBurnside\nproblem with a paper on groups of exponent\n5\n.\nPerhaps his most surprising result, and one of his most influential, appeared in\nSubgroups of finitely presented groups\npublished in the\nProceedings\nof the\nRoyal Society\nin\n1961\n. There he proved:-\nAny finitely generated group can be embedded in a finitely presented group if and only if it is recursively presented.\nAs a corollary to this theorem Higman proved the existence of a universal finitely presented group containing every finitely presented group as a subgroup. Another application in the paper produced a new example of a finitely presented group with unsolvable word problem.\nHigman also worked on topics such as: varieties of groups; enumerating\np\np\np\n-groups; and\nLie ring\nmethods for finite nilpotent groups. Then in\n1967\nhe became interested in the sporadic finite simple groups being discovered at this time and played an important role in constructing certain of these groups from a knowledge of their\ncharacter tables\n. He published papers on the Higman-\nSims\nsimple group\n(\nnamed after\nD G Higman\nand not Graham Higman\n)\nand on Janko's group of order\n50232960\n. I\n[\nEFR\n]\nattended a lecture course which he gave at Oxford on this topic in the\n1960\ns. It was a very exciting course, presenting results which he had only just proved, and often, it seemed, results he worked out on the blackboard during the lectures. In September\n1969\nhe organised a two-week instructional conference, supported by the\nLondon Mathematical Society\nand NATO, on 'Finite Simple Groups'. You can see a picture of the participants at\nTHIS LINK\n.\nTogether with\nBill Boone\n, Higman worked on the word problem and together they wrote two papers on the algebraic structure of groups with soluble word problem and with soluble order problem.\n[\nA finitely generated group has soluble order problem if given any word in the generators there is an algorithm to determine its order.\n]\nIn the interview\n[\n11\n]\nhe was asked why he thought the study of group theory is important. He gave the following reply:-\nWell, in the first place, like many other research mathematicians, I do what I do, not only because I think it is important but also because I think it's interesting. The problems one has to deal with in group theory are challenging, they are intellectually difficult. When one has got into a problem it's not so much the question of how much it has an application to the real world that concerns you, it's a question of exercising your mind, exercising the control the mind has over the things it understands. Of course it is true that group theory has applications in the sciences. Perhaps we should say for the benefit of most of the people who might be listening to us and have no idea what group theory is, that group theory is in fact the study of symmetry. What a group theorist is concerned with is the possible amounts of symmetry that an object can have, symmetry in the abstract is our study and because everything has some degree of symmetry and because a physical scientist for instance who is studying a problem finds it easier to deal with it if he takes symmetry into account he needs to know what kinds of symmetries there are and therefore needs to know the results of group theory. It is in that way that group theory acts as a servant to other sciences as well as being an interesting subject in its own right.\nMarston Conder, one of Higman's research students in the latter part of the\n1970\ns, writes in\n[\n3\n]\nabout Higman as a thesis advisor:-\nAs Waynflete professor, Graham had numerous doctoral students. His approach to supervision was not unusual for the time, but was certainly different from current expectations. He disliked scheduling regular meetings, and preferred that his students would attend colloquia and advanced classes, not just those he conducted himself, appear for tea in the Mathematical Institute's common room on a regular basis\n(\nto engage in mathematical conversations\n)\n, and come to see him only when they had something important to say or ask; and when that happened, he would put aside his own work in order to help the student, offering many ideas and explanations\n(\nusually sketched on a board\n)\n, and yet he would not seek credit for those ideas, let alone eventual joint authorship. ... Graham's approach helped to develop a large degree of independence and self-reliance in most\n(\nbut not all\n)\nof his students. ... Sadly, a small number of students\n(\nand a few colleagues\n)\nfound him intimidating, possibly because of his high academic standing and reputation, and some needed quite a lot of help, or a change of topic or supervisor.\nMichael Collins writes in\n[\n1\n]\nabout some of Higman's life other than mathematics:-\nRelaxation came from bird-watching, and Higman would often arrive in the morning at the Mathematical Institute in a shabby raincoat, binoculars around his neck, to report on the latest sighting. He remained active in the Wesley Memorial Church in Oxford with a particular love for Wesley's hymns, and he participated in one of its book reading groups until about three years ago. For many years, too, he was involved with the Samaritans.\nI\n[\nEFR\n]\ncan also report on his love of walking. Once when he was coming to St Andrews to give a seminar, we offered to meet his train at Leuchars, about\n5\nmiles from the Mathematical Institute. Thanking us for the offer, he said he preferred to walk\n(\nthere is a cycle path most of the way\n)\n. When he arrived at the Institute he certainly looked the worse for wear with mud all over his trousers. He gave an excellent seminar but I'm sure it was the only seminar I ever attended where the speaker was covered in mud.\nHigman retired in\n1984\nand the Oxford Mathematical Institute named one of their seminar rooms the 'Higman Room' and hung this portrait painted by Norman Blamey.\nClick the picture to see a larger version\nHigman did not like getting his photograph taken and often remarked that he disliked all photos of him but that he really liked the Norman Blamey portrait.\nIvah Higman died in Headington, Oxford, on\n31\nMarch\n1981\n. Higman, the Methodist Local Preacher, gave the funeral address himself. He delivered the address in his usual style, without notes. He continued to undertake research and attend conferences. For example he was at the University of Illinois Urbana-Champaign for around two years in\n1986\n-\n87\n, attended a conference in Singapore in June\n1987\n(\nI\n[\nEFR\n]\nwas at that conference and attended Graham's lecture\nSome countably free groups\n)\n, then he spent three weeks in Pakistan in July\n1987\n. It was at this time that the interview\n[\n11\n]\ntook place. He then spent ten days birdwatching in the highly mountainous Gilgit-Baltistan region of Pakistan before returning to England.\nHe published the book\n(\nco-authored with Elizabeth Scott\n)\nExistentially closed groups\nin\n1988\n. Kenneth Hickin begins his review\n[\n7\n]\nwith the following sentences:-\nThis volume grew out of lectures given by Higman at Oxford in\n1983\nand\n1984\nas recorded and amended by Scott. It is not a comprehensive work on existentially closed groups but rather contains an ample selection of topics written at an easily accessible graduate level. Both algebraic and model-theoretic aspects of existentially closed groups are highlighted.\nLater in the review Hickin explains\n[\n7\n]\n:-\nThe subject of existentially closed groups currently occupies a special place in the model theory and logic of algebraic systems. This is due to a number of convergent factors, not the least of which is that this subject performs a type of wedding between recursion theory\n(\nthe foundation of mathematical logic\n)\non the one hand and group theory\n(\nthe foundation of the analysis of mathematical structure\n)\non the other. In another sense, it and related topics in other systems provide a testing ground for the classificatory concepts of model theory. Existentially closed groups provide an exemplary case in which powerful techniques are available to explore the details and potentials of logical complexity in a class of systems well known for their intrinsic beauty.\nOne of Higman's last papers is\nOn a Certain Infinite Permutation Group\n(1990)\n. The first paragraph is typically Higman and we give it here:-\nThis paper can, I think, best be considered as a sort of five finger exercise. In it we polish the techniques from a corner of group theory by using them to investigate the structure of a particular infinite permutation group. However, the group that we consider though particular is a fairly natural one, and while the results have a familiar general shape they include one detail which to me was quite unexpected. These facts perhaps constitute a challenge to place the results in a more general context; if so I make no attempt to meet it.\nHis final paper was\nTransversals and conjugacy in the group of recursive permutations\nwhich was published in the\nProceedings\nof the 'Third International Conference on the Theory of Groups and Related Topics' held at the Australian National University, Canberra,\n25\n-\n29\nSeptember\n1989\n. His physical health deteriorated, but he remained mentally sharp. He spent the last years of his life in a nursing home but was able to make a brief appearance at the two-day conference\nThe Hall-Higman theorems: fifty years on\nwhich was held at the Oxford Mathematical Institute in January\n2007\n, to mark Higman's\n90\nth birthday\n[\n6\n]\n:-\nParticipants felt themselves privileged when Graham Higman decided only the day before that he would attend both for the opening and for some of the lectures.\nHigman has received many honours for his outstanding work in group theory. He was awarded the Berwick Prize from the\nLondon Mathematical Society\nin\n1962\nand the\nDe Morgan\nMedal from that Society in\n1974\n. He served the\nLondon Mathematical Society\nas its\n52\nnd president from\n1965\nto\n1967\n. In addition to his election as a Fellow of the\nRoyal Society\nin\n1958\n, the\nRoyal Society\nawarded him its\nSylvester\nMedal in\n1979\n. He received a number of honorary degrees.\nFinally let us give brief information about two members of the Higman family. Graham Higman's brother, Bryan Higman\n(1914\n-\n1991)\n, studied chemistry at Balliol College Oxford, served in the air force during World War II teaching ballistics, and became a lecturer in Chemistry, then reader in Computer Science at the University of London, and finally a professor at the University of Lancaster. He published books such as\nApplied Group-theoretic and Matrix Methods\n(1964)\n,\nA Comparative Study of Programming Languages\n(1967)\nand\nFoundation course in computer science\n(1975)\n.\nGraham Higman's son, Roger Higman, works for the Network of Wellbeing and Friends of the Earth\n[\n15\n]\n:-\nRoger joined the Network of Wellbeing team in late\n2014\nto take on a leading role in developing our strategy. Roger has over\n25\nyears' experience of campaigning mainly at Friends of the Earth, including locally, nationally and internationally on issues as diverse as climate change, biodiversity, resource use and economics. Roger is also a Director of the Flameworks Creative Arts Facility in Plymouth, where he lives with his partner, Karen and her three daughters. He is at his happiest exploring the countryside with Karen or working his allotment with his brother, Joe."
}