{
  "nome_completo": "Griffith Conrad Evans",
  "nome_curto": "Griffith Evans",
  "ano_nascimento": "1887",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Evans/",
  "lugar_nascimento": "Boston, Massachusetts, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Griffith Evans\n' father was George William Evans and his mother was Mary Taylor. It was a family in which mathematics played a major role for George Evans was a mathematics teacher at the English and Latin High School in Boston. In fact George Evans had published a number of school level mathematics texts including\nAlgebra for schools\nwhich had given him a good reputation as a teacher of mathematics.\nGriffith attended the school at which his father taught and completed his studies there in\n1903\nat the age of sixteen. He then entered Harvard University and showed outstanding ability. He was awarded his first degree, the A.B., in\n1907\nand he had the good fortune to have been taught by several outstanding mathematicians, including\nOsgood\n,\nCoolidge\nand\nBôcher\n. It was under\nBôcher\n's supervision that Evans began research at Harvard, being awarded his Master's degree in\n1908\nand his doctorate in\n1910\n. His doctoral dissertation\nVolterra's\nintegral equation\nof the second kind with discontinuous kernel\nwas published in the\nTransactions of the American Mathematical Society\nin two parts in\n1910\nand\n1911\n.\nAlready before completing his Ph.D., Evans had been employed as an instructor at Harvard in session\n1909\n-\n10\n. He won a Sheldon Travelling Fellowship from Harvard which enabled him to spend\n1910\nto\n1912\nstudying in Europe. Most of this time Evans spent in Rome studying with\nVolterra\nbut he also had an interest in applied mathematics and so he spent a summer in Berlin studying with\nPlanck\n.\nEvans returned to the United States in\n1912\n. He was now in the happy position of being sought by several of the top universities. In particular the Massachusetts Institute of Technology tried to encourage him to accept an appointment as did the University of California at Berkeley. However he accepted an offer form a third institution, namely the Rice Institute in Houston, Texas. The decision was not made lightly by Evans from which of these institutions to accept a post but he felt that Rice offered him the greatest opportunities.\nAppointed as assistant professor in\n1912\n, Evans was promoted to full professor at Rice in\n1916\n. In\n1917\nhe married Isabel Mary John on\n20\nJune and they had three children, all sons. This, of course, was the period of World War I and Evans was commissioned as a captain in the Air Branch of the U.S. Signal Corps during\n1918\n-\n19\n. Rider writes in\n[\n1\n]\n:-\nHis scientific assignments concerning bomb trajectories and sights, and anti-aircraft defences took him to England, France, and Italy. With the help of\nVolterra\n, Evans facilitated the enrolment of U.S. military personnel in special wartime courses in Italian universities.\nEvans did a fine job of attracting visiting professors to Rice during his time there, including\nMenger\nand\nRado\n. He also made many visits himself including Belgium, France and Italy. During a visit to the University of Minnesota in\n1921\nhe met\nFisher\nwho convinced him of the need to develop statistics in the United States.\nThe University of California at Berkeley continued to try to attract Evans, and he taught there during the summer terms of\n1921\nand\n1928\n. He turned down an attractive offer from them in\n1927\nand he also turned down several offers from Harvard. However, in\n1933\nthe University of California at Berkeley made him an offer which was so attractive that he accepted it.\nBasically he was given the explicit mandate to revitalise and improve the mathematics department and set up a programme for graduate studies. In the summer of\n1934\nEvans left Rice and began his task at Berkeley as chairman of the mathematics department. The article\n[\n3\n]\nshows why and how Evans was successful in building a world class centre there. Although at first he favoured appointing unemployed Americans, he soon changed to reap the benefits from the availability of mathematicians expelled from Europe and also from the changes to American science policy that resulted from World War II. In particular he appointed\nLewy\n,\nNeyman\nand\nTarski\namong fifteen appointments he made from\n1934\nto\n1949\n.\nDuring World War II Evans again undertook work related to the war effort. As well as serving on the Applied Mathematics Panel of the National Defense Research Council, he also acted as a consultant on the design of guns for the Office of the Chief of Ordnance in Aberdeen, Maryland. For his war work he was awarded the Distinguished Assistance Award of the War Department and the Presidential Certificate of Merit.\nEvans was chairmen of the mathematics department at Berkeley for fifteen years, ending his term in\n1949\n. He retired in\n1955\nbut lived to see the new mathematics building at Berkeley named Evans Hall in\n1971\n.\nHis work dealt with\npotential theory\n,\nfunctional analysis\n, integral equations and the problem of minimal surfaces, the\nPlateau\nProblem. It was built on the foundations provided by\nLebesgue\n,\nVolterra\n,\nFréchet\nand\nPoincaré\n. Zund writes in\n[\n4\n]\nof his contributions to potential theory:-\nHe pioneered the use of general notions of integration and\nmeasure theory\nin this area, and his interests lay in application and development of new techniques rather than in deep structural theorems. These include the theories of harmonic and superharmonic functions, the\nPoisson\n-\nStieltjes\nintegral, the logarithmic potential, the discovery of the precursor of\nSobolev\nspaces in\n1920\n..., generalisations of Heni\nPoincaré\n's \"sweeping out\" process, the theory of capacity, and finally an ingenious theory of multiple-valued harmonic functions\n(1947\n,\n1951)\n.\nIn fact the work referred to here on multiple-valued harmonic functions was a generalisation of his own work on the\nproblem of minimal surfaces\nwhich he published on from the\n1920\ns. He had proved, among many other results, that among the surfaces with a fixed boundary, there is a surface of minimal electric capacity.\nEvans also wrote on mathematical economics, in particular on monopolies, competition and cooperation, taxation, profit, prices, etc. Rider writes in\n[\n1\n]\n:-\nEvans formulated a model of the economy as a whole and posed the problem of defining an aggregate variable in terms of microeconomics components. His\n1924\npaper on the dynamics of monopoly, which introduced time derivatives in demand relations, was recognised as the beginning of dynamic theories of economics.\nAmong the important texts he wrote were\nFunctional equations and their applications\n(1918)\n,\nThe logarithmic potential\n(1927)\n, and\nMathematical Introduction to economics\n(1930)\n.\nEvans received many honours for his mathematical contribution. He was vice-president of the\nAmerican Mathematical Society\nin\n1924\n-\n26\nand vice-president of the\nMathematical Association of America\nin\n1932\n. He served as vice-president for mathematics of the American Association for the Advancement of Science in\n1931\n-\n32\nand vice-president for economics of the American Association for the Advancement of Science in\n1936\n-\n37\n. He was elected to the\nNational Academy of Sciences\nin\n1933\nand was president of the\nAmerican Mathematical Society\nin\n1939\n-\n40\n."
}