{
  "nome_completo": "Gustave Alfred Arthur Choquet",
  "nome_curto": "Gustave Choquet",
  "ano_nascimento": "1915",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Choquet/",
  "lugar_nascimento": "Solesmes, near Valenciennes, Nord, France",
  "lugar_morte": "Lyon, France",
  "biografia": "Gustave Choquet\n's father was also named Gustave Choquet and his mother was Marie Fosse. Gustave Choquet Sr was an accountant but had been called up for military duty in July\n1914\nas the hostilities of World War I began. When Gustave, the subject of this biography, was born, his father was at the front. German troops had invaded Belgium in August\n1914\nand quickly entered France close to where Marie Choquet together with Gustave's older sister were living. The family had to endure German troops occupying the Valenciennes region when Gustave was born. Eventually the family were evacuated but had to suffer a long journey, first to Switzerland, then back to Paris, before settling in the Vendée region near the west coast of France. This was a peaceful place, well away from the fighting, and Gustave's earliest memories were of happy times in a tiny village in this region. Gustave Choquet Sr survived the war and a third child, a young sister for Gustave, was born. The family returned to the Valenciennes region when the war ended in\n1918\nliving briefly in the town of Valenciennes itself before they moved to the village of Saultain,\n5\nkm to the southeast of the town. There Gustave Sr was employed as an accountant to a textile firm\n[\n8\n]\n:-\n[\nGustave's\n]\nfather had a sense of duty and seriousness about work which made a lasting impression on his son, but he also took great joy in playing the clarinet in the local band. Encouraged by his father, the young Gustave learned to play the flute, and was able to join in concerts and festivals in the local villages. Another occupation shared with his father was the cultivation of the family garden, from which he derived a lifelong love of gardening. His mother contributed great human warmth to the life of the family. She had a taste for music, flowers, and poetry, and herself wrote short poems.\nGustave attended primary school in Saultain and we know much about his mathematical education from this time on because of his description given in\n[\n2\n]\n. There he was taught by an exceptional teacher, M Flamant and Choquet wrote that he learnt more from M Flamant than he did at the lycée or at university. M Flamant was particularly keen to demonstrate things visually and he demonstrated many scientific experiments to the young children. However, he carried this over to mathematics and illustrated arithmetical calculations by giving geometrical examples. This made a tremendous impression on the young Choquet and M Flamant's approach to learning and teaching would influence his whole life. There were no secondary schools in the village of Saultain, so Choquet had to attend the lycée at Valenciennes. Again he was fortunate to have some exceptional teachers, particularly M Mas, the mathematics teacher. As with M Flamant, M Mas's\n[\n8\n]\n:-\n... mathematical style he found very congenial and who again encouraged the habit of looking for geometrical approaches to mathematical problems. Choquet derived particular satisfaction at school from solving difficult problems in geometry. Another source of great fascination was an elementary calculus book lent by a classmate, which he studied avidly. Looking back, he thought it could well have been at this time that he decided to make mathematics, if possible, a lifelong pursuit.\nWriting of his mathematical studies at the lycée at Valenciennes, Choquet writes\n[\n2\n]\n:-\nA friend had secretly lent me a book 'Analyse de l'École Universelle'\nⓉ\n(\nUniversal school analysis\n)\nwhere the derivative was introduced and applied to the study of planar curves. That tempted me to make many drawings and find their tangents, cusps, curvature, which the given formulas allow me to determine; but the habit that I had of starting to read books from the end and zigzag through them, made me miss the definition of symbols y' and y\". So I began to reconstruct, thanks to the examples treated, the formalism of the calculus; in that way I could quickly formally calculate the derivatives of polynomials and\nrational functions\n. It was a good start in algebra; but unfortunately I quickly understood what a continuous function was, and the charms of analysis were decidedly too large and I definitely swung to that side.\nWhile still studying in Valenciennes, Choquet sat the 'concours général', the nation-wide mathematics competition, in\n1933\nand was ranked in first place beating\nRoger Apéry\nwho was ranked second. He then went to Paris where he studied at the Lycée Saint-Louis, preparing for his university career. He studied\nÉmile Borel\n's\nLeçons sur la théorie des fonctions\nⓉ\n(\nLectures on the theory of functions\n)\nwhich fascinated him. He also studied the works of\nGaston Darboux\n, which he read a little at a time. Later he also read Tannery's works on analysis, finding great pleasure from the\nRiemann\nintegral, the theorem of\nJordan\nand functions of bounded variation. He took the entrance examinations for the École Normale Supérieure and began his studies there in the autumn of\n1934\n.\nAt the École Normale Supérieure, Choquet took\nGeorges Valiron\n's course on analytic functions, and courses by\nGeorges Darmois\nwhich he found inspirational. He attended courses on differential geometry given by René Garnier\n(1887\n-\n1984)\nbut it was two books that he discovered in the library which influenced his future research career more than any of these courses. These two books were\nRené Baire\n's\nLeçons sur les fonctions discontinues\nⓉ\n(\nLessons on discontinuous functions\n)\nand\nGeorg Cantor\n's\nBeiträge zur Begründung der transfiniten Mengenlehre\nⓉ\n(\nContributions to the creation of transfinite set theory\n)\nwhich he read in a French translation. He graduated with the\nagrégation\nin\n1937\nand, following advice from\nGeorges Darmois\n, spent the summer reading\nErnest Hobson\n's\nTheory of functions of a real variable\nand\nConstantin Carathéodory\n's\nVorlesungen über reelle Funktionen\nⓉ\n(\nLectures on real functions\n)\n. Here he gained his first introduction to measure theory and to basic\ngeneral topology\n. Again following\nGeorges Darmois\n's advice, in October\n1937\nhe approached\nArnaud Denjoy\nwho became his advisor. Certainly Choquet and\nDenjoy\ndiscussed their research  but Choquet wanted to follow his own ideas and never asked\nDenjoy\nto suggest a research topic. Choquet's research went well and in\n1938\nhe published his first three papers:\nÉtude des homéomorphies planes\nⓉ\n(\nStudy of plane homeomorphisms\n)\n;\nÉtude de certains réseaux de routes\nⓉ\n(\nStudy of some road networks\n)\n; and\nProlongement d'homéomorphies\nⓉ\n(\nExtension of homeomorphisms\n)\n.\nChoquet obtained a Jane Eliza Proctor fellowship to finance a year at Princeton. The Jane Eliza Proctor fellowship was a Princeton award to students at the École Normale Supérieure who were of:-\n... high character, excellent education and exceptional scholarly promise.\nThe Jane Eliza Proctor fellowship was for two years but, after spending\n1938\n-\n39\nat Princeton, Choquet had to return to France due to the outbreak of World War II\n[\n8\n]\n:-\n... he was called up and sent, in the company of a hundred or so former pupils of the grandes écoles, to a camp at Biscarosse for anti-aircraft instruction. His critical attitude to the proposed means of defence earned him an early posting to a horse artillery unit, the\n7\nth\nR.A.D., and in\n1940\nhe took part in the Battle of France, first in Lorraine, then from the banks of the Aisne to the banks of the Creuse. In August\n1940\nhe was demobilized at Limoges and shortly afterwards returned to Paris with his fiancée. They were married in January\n1941\n. During the war the couple lived frugally in a little two-room apartment in Paris, where their two sons were born. In the years\n1941\n-\n46\nhis research was supported by a C.N.R.S. stipend. The amount was modest, but he was allowed complete freedom to pursue his research as he saw fit, and this proved to be an extremely productive time for him.\nAlthough Choquet had published\n28\npapers by\n1946\n, he had never submitted a thesis for a doctorate. However, when the opportunity of spending two years at the French Institute in Krakov, Poland, came up with the condition that applicants were required to have a doctorate, he set about rectifying this omission. In three months he had written\nApplication des propriétés descriptives de la fonction contingent a la théorie des fonctions de variable réelle et a la géométrie différentielle des variétés cartésiennes.\nⓉ\n(\nApplication of descriptive properties of the contingent function to the theory of real variables and to the differential geometry of Cartesian varieties.\n)\nThis work studies:-\n... the differentiability properties of subsets of Euclidean spaces, and is a pioneering contribution to non-smooth analysis which reveals profound relations between certain differentiable and topological structures.\nNow with a doctorate, his application for the position in Krakov was successful and he went to Poland with his family in\n1946\n. He spent a year during which he made important contacts with Polish mathematicians, in particular\nSierpiński\n,\nKuratowski\n,\nSteinhaus\n, and\nNikodym\non visits to Warsaw and Wrocław. On a visit to Lwów, he added two problems to the\nScottish Book\n. He returned to France in the autumn of\n1947\nto take up a position as Maître de conférences, an assistant lecturership, at Grenoble. His two sons Bernard and Christian had been born in Paris, and now his third child, his daughter Claire, was born at Grenoble. In\n1949\nthe family moved to Paris when Choquet was appointed as Maître de conférences at the University of Paris. In\n1950\nhe was promoted to professor at the University of Paris. He was, in addition, a Professor at the École Polytechnique from\n1960\nto\n1969\n. He retired from his Paris chair in\n1984\n.\nAs to his remarkable mathematics contributions, we first quote David A Edwards\n[\n9\n]\n:-\nHe published more than\n160\nmathematical articles and\n11\nbooks. He made important contributions to a variety of fields: topology,\nmeasure theory\n, descriptive set theory, potential theory, and functional analysis. Two themes deserve particular mention. His monumental\n1953\n/\n4\npaper 'Theory of capacities' contains among many riches his celebrated 'capacitability theorem'. A second great theme is his theory of integral representations in compact convex sets and weakly complete cones, now usually known as 'Choquet theory', which launched a huge development. The work on capacities and that on integral representations have both found many applications in analysis and probability.\nIn\n1988\n, Choquet was elected to Honorary Membership of the\nLondon Mathematical Society\n.\nChris Zeeman\n, President of the Society, read the following citation\n[\n6\n]\n:-\nProfessor Gustave Choquet, who was born in\n1915\n, has made major contributions to a wide range of topics in analysis, potential theory,\nfunctional analysis\n, measure theory and infinite dimensional convexity. His work on integral representations over convex sets was so seminal that this area is now known as 'Choquet theory'. Choquet's work on capacities is also particularly striking. The widespread influence of his research has been enhanced by the warmth of his personality. In recognition of the importance of his work he was elected to the Academie des Sciences in\n1976\n. He has been Professor of Mathematics at the Universites de Paris VI and XI, and at the École Polytechnique, and is a Chevalier de la Legion d'Honneur.\nThe importance of Choquet's work on capacities can be seen from the fact that in\n2008\nthe\nInternational Journal of Approximate Reasoning\nproduced a 'Special Issue on Choquet integration in honour of Gustave Choquet'. Let us quote from the Foreword:-\nWhereas Lebesgue's classical integration theory is based on s-additive measures, there have been made, during the second half of the\n20\nth\ncentury and often independently, many attempts to depart from additivity of the measure, guided by requirements of different applications. One of the earliest and also deepest and most comprehensive of these approaches had been worked out by Gustave Choquet in his\n1953\n/\n54\npaper 'Theory of capacities'. He died November\n14\nlast year in Lyon at the age of\n91\n, so this is a good time and place to appreciate those parts of his scientific work related to this issue and to see why, nowadays and with full justification, the integral w.r.t. a monotone non-additive measure is called Choquet integral. In fact, Choquet's famous paper 'Theory of capacities', comprising\n165\npages, is a monograph rather than an ordinary article. It contains the essentials of non-additive measure theory, especially the theory of infinity-alternating set functions and their dual, totally monotone ones, which later have been called belief functions as well. In this context he investigated, in its dual version, the Möbius transform of a non-additive measure under topological assumptions.\nIn\nLa naissance de la théorie des capacités: réflexion sur une expérience personnelle\nⓉ\n(\nBeginnings of capacity theory: reflection on personal experience\n)\n(1986)\n, Choquet gives an interesting historical account of the development of the theory of capacities.\nChoquet produced a number of important books. His three-volume work\nCours d'analyse\n(1964)\nwas based on his courses at the University of Paris. The three volumes are:\n1\n. Algebra;\n2\n. Topology; and\n3\n. Integration and differential calculus. Another three-volume work\nLectures on analysis\n(1969)\nwas based on Choquet's course in analysis given at Princeton during the autumn term in\n1967\n. The three volumes are:\n1\n. Integration and topological vector spaces;\n2\n. Representation theory; and\n3\n. Infinite dimensional measures and problem solutions. He writes in the Preface to the whole work:-\nModern analysis uses a great variety of basic tools, many of which are common to analysts in several branches. I have tried, during a one semester graduate course at Princeton, to present some of those tools that I found useful in potential theory,\nprobability theory\nand harmonic analysis; they include parts of functional analysis, integration theory and general topology, but I have avoided as much as possible, parts of these theories which, although elegant and interesting in themselves, do not have a large range of applications.\nAnother book, again based on a course given by Choquet, was also published in\n1969\n, namely\nOutils topologiques et métriques de l'analyse mathématique\n.\nWe noted above Choquet's marriage and his three children. This marriage was dissolved and, on\n16\nMay\n1961\n, he married Yvonne Bruhat. She took the name\nYvonne Choquet-Bruhat\nand has a biography in this archive. Yvonne and Gustave Choquet had a son Daniel and a daughter Geneviève.\nWe have already mentioned the fact that Choquet was made an honorary member of the\nLondon Mathematical Society\n. However, he received many other honours such as four prizes from the\nParis Academy of Sciences\n, namely the Houllevigue Prize\n(1945)\n, the Dickson Prize\n(1951)\n, the Carrière Prize\n(1956)\n, and the Grand Prix des sciences mathématiques\n(1968)\n. He was elected a member of the\nParis Academy of Sciences\nin\n1976\n. In\n1966\nhe was made Chevalier of the Légion d'Honneur, later becoming Officier of the Légion d'Honneur. He was also elected to the Bavarian Academy, and received an honorary degree from the Charles University of Prague in\n2002\n.\nAs to his hobbies, we mention his love of gardening, mountain sports, walking and swimming. We end our biography by quoting David Edwards\n[\n8\n]\n:-\nHe will be remembered not only for his fundamental contributions to mathematics, but also as a truly inspiring teacher. His outstanding talents were allied to great kindness and deep humanity, and he won the respect and the warm affection of his many pupils and of scientific colleagues worldwide."
}