{
  "nome_completo": "Gustav Herglotz",
  "nome_curto": "Gustav Herglotz",
  "ano_nascimento": "1881",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herglotz/",
  "lugar_nascimento": "Wallern, Bohemia (now Volary, Czech Republic)",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Gustav Herglotz\nwas born in Wallern but spent most of his childhood in Vienna. His father was Gustav Herglotz, a notary, who died when his son was three years old. His mother was Anna von Elbenbruck. It was in Vienna that he completed his school studies and entered the Technische Hochschule in\n1899\nto study mathematics and astronomy. There he formed a close friendship with three other students of mathematics,\nHeinrich Tietze\n,\nHans Hahn\nand\nPaul Ehrenfest\n. They became known as the 'inseparable four'. Wishing to concentrate more on astronomy, Herglotz decided that he would be able to attend more appropriate courses at the University of Munich and so, after one year at the University of Vienna, he moved to Munich in\n1900\n.\nIn Munich, Herglotz was advised by Hugo von Seeliger and\nLudwig Boltzmann\n. He completed his doctoral studies in\n1902\n, submitting his thesis\nÜber die scheinbaren Helligkeitsverhältnisse eines planetarischen Körpers mit drei ungleichen Hauptträgheitsachsen\nⓉ\n(\nOn the apparent brightness ratios of a planetary body with three unequal principal axes\n)\n. He published in\n1902\n, in Vienna, part of this thesis as a\n60\npage paper with the same title as his thesis. The main motivation for his thesis was the discovery of the asteroid  Eros. This was the first asteroid to be discovered that had an orbit closer to the sun than Mars. It was discovered on\n13\nAugust\n1898\nby Gustav Witt at the Urania Observatory in Berlin. Eros displayed large variations in brightness which we know to be due to its elongated shape. Herglotz, in his doctoral thesis, gave a geometric explanation of the variations in brightness of asteroids such as Eros.\nIn order to teach in universities Herglotz had to write an\nhabilitation\nthesis and after working on it in Göttingen from\n1902\nto\n1904\nunder\nFelix Klein\n, he submitted the thesis to the University of Göttingen. This earned him the right to lecture on mathematics and astronomy. Herglotz was a\nprivatdozent\nat Göttingen from\n1904\nto\n1907\nwhen he was made an extraordinary professor. One problem that Herglotz worked on at this time was a fundamental problem of geophysics, extending\nKelvin\n's theory on the earth's rigidity. He published\nÜber die Elastizität der Erde bei Berücksichtigung ihrer variablen Dichte\nⓉ\n(\nOn the elasticity of the earth in view of its variable density\n)\nin\n1905\n. Other papers he published in this period include\nÜber die analytische Fortsetzung gewisser Dirichletscher Reihen\nⓉ\n(\nOn the analytic continuation of certain Dirichlet series\n)\n(1906)\n,\nÜber die Gestalt der auf algebraischen Kurven nirgends singulären linearen Differentialgleichungen\n2\nter\nOrdnung\nⓉ\n(\nOn the shape of the curves on algebraic nowhere singular linear differential equations of\n2\nnd order\n)\n(1906)\n,\nÜber die Integralgleichungen der Elektronentheorie\nⓉ\n(\nOn the integral equations of the electron theory\n)\n(1907)\n, and\nÜber das Benndorfsche Problem der Fortpflanzungsgeschwindigkeit der Erdbebenstrahlen\nⓉ\n(\nOn the Benndorf problem of propagation velocity of seismic rays\n)\n(1907)\n. In this last paper Herglotz solved\nAbel\n's integral equation which results from the inversion of measured seismic travel times into a velocity-depth function. This was an important result for it allowed models of the earth to be constructed from seismic data.\nIn\n1908\n, one year after being made an extraordinary professor at Göttingen, Herglotz moved to an extraordinary professorship at the University of Vienna. Again Herglotz was to hold a post for only a year, for in\n1909\nhe was offered a full professorship at the University of Leipzig. During his sixteen years in Leipzig, Herglotz supervised the doctoral studies of at least\n25\nstudents including\nEmil Artin\n.\nRunge\nheld the chair of Applied Mathematics at Göttingen from\n1904\nuntil he retired in\n1925\n. Herglotz was appointed to fill the vacant chair which he held until\n1946\nwhen he was forced to resign due to ill health. At Göttingen, Herglotz lectured on a wide variety of topics, showing the breadth of his mathematical expertise. Among his lecture courses we mention\nLie\ngroups, continuum mechanics, geometrical optics, and functions with a positive real part. His lecture course on continuum mechanics was published in\n1985\n, about\n50\nyears after Herglotz gave the lectures. J J Cross writes:-\nIt is difficult to review as new a book published half a century out of its time, and a book which is more notes rather than a fully developed presentation. A reader should not expect to learn the mechanics of continua from this book as it is more in the tradition of\nCarslaw\n,\nLichtenstein\nand even\nCarl Neumann\nrather than\nA E H Love\nor\nHorace Lamb\n: there is more technical mathematics than physical understanding and detailed calculation. There are two sections, one of five chapters on classical theory of the mechanics of continua based on\nHamilton\n's principle and another of four chapters on partial differential equations. ... The author does show his usual clarity and elegance and the richness of his analysis appears in the many areas of application sketched in a paragraph or two, as one does in lectures.\nHerglotz was married to Anna Lederer."
}