{
  "nome_completo": "Erik Gustav Elfving",
  "nome_curto": "Gustav Elfving",
  "ano_nascimento": "1908",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Elfving/",
  "lugar_nascimento": "Helsinki, Finland",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Gustav Elfving\n's parents were Frederik Emil Wolmar Elfving\n(1854\n-\n1942)\n, a professor of botany at the University of Helsinki, and Thyra Ingman\n(1870\n-\n1939)\n. Frederik and Thyra Elfving were married in\n1897\nand Gustav was the youngest of their four children, having one older brother Rabbe Fredrik Elfving\n(1899\n-\n1966)\nand two older sisters Brita Elfving\n(1900\n-\n1917)\nand Astrid Elfving\n(1902\n-\n1982)\n. Frederik Elfving\n[\n10\n]\n:-\n... is considered the grand old man of botany in Finland, who brought new directions of research, including plant physiology, into botany as an academic subject in Finland.\n[\nHe\n]\nhad a widespread reputation for being a very colourful and strong personality as well as an excessively demanding teacher. ...\n[\nHe\n]\nwas also a very dynamic person. Largely due to his determined efforts, a new building was created in\n1903\nfor the Institute of Botanics in the Botanical Garden, in which he both worked and lived with his family.\nIn fact it was in the Botanical Institute that Gustav was brought up, so he spent his childhood in the idyllic surroundings of the Botanic Gardens. His upbringing was somewhat academic but a happy one in which he learnt to express himself well. He studied at the Svenska normallyceum, an excellent Swedish language\nGymnasium\nin Helsinki founded in\n1864\nby the philosopher and statesman Johan Vilhelm Snellman. Elfving graduated from the Gymnasium in the spring of\n1926\nand, later that year, entered the University of Helsinki with the intention of studying astronomy. Of course, aiming at an astronomy degree meant that he took mathematics courses and he quickly fell in love with the subject. This was largely brought about the courses given by\nErnst Lindelöf\nwho, by this time, had given up research to devote himself wholeheartedly to teaching students. Elfving changed from majoring in astronomy to majoring in mathematics and graduated in\n1930\nwith astronomy and physics as minor subjects.\nElfving's undergraduate career saw him achieve top marks and he was awarded the Donner Prize in\n1930\nfor his dissertation\nZur Reduktion von Echolotungen\nⓉ\n(\nOn the reduction of echo soundings\n)\n.\n(\nAnders Donner\n(1854\n-\n1938)\nwas the professor of astronomy at the University of Helsinki observatory between\n1883\nand\n1915\n.\n)\nElfving had worked as an computational assistant at the Helsinki Observatory during the years\n1927\n-\n29\nwhile studying for his first degree. His interest in probability began as a result of the undergraduate course on that topic he took in\n1929\ngiven by Jarl Waldemar Lindeberg\n(1876\n-\n1932)\n. However, he did not find Lindeberg's lectures very exciting, although he realised that they were very precise and he found Lindeberg helpful. Elfving therefore decided to undertake research at the University of Helsinki advised by\nRolf Nevanlinna\n. He was awarded his doctorate in\n1934\nfor his\n60\n-page thesis\nÜber eine Klasse von Riemannschen Flächen und ihre Uniformisierung\nⓉ\n(\nOn a class of Riemann surfaces and their uniformity\n)\n, which studied the uniformization of\nRiemann\nsurfaces, a topic which today is part of\nNevanlinna\ntheory. In\n1934\nhe was awarded another prize, namely the\nErnst Lindelöf\nPrize for the best mathematics thesis. He submitted two papers on complex analysis which were published in\n1935\n, namely\nÜber Riemannsche Flächen und Annäherung von meromorphen Funktionen\nⓉ\n(\nOn Riemann surfaces and approximation of meromorphic functions\n)\n, and\nZur Flächenstruktur und Wertverteilung. Ein Beispiel\nⓉ\n(\nOn surface structure and value distribution. An example\n)\n.\nA tragic event in\n1935\nhad a major affect on Elfving's career. He had become engaged to a Danish girl who died from tuberculosis in\n1935\n. Naturally he was much affected by this event and sought a period away from the world. The parents of the Danish girl suggested that he contact the Danish Geodetic Institute since they knew that the Institute was looking for a mathematician to go on an expedition to Greenland. The aim of the expedition was to map the west of that vast land and Elfving's experience working at the Helsinki Observatory made him an excellent choice. The expedition set off in the summer of\n1935\nbut even summer in Greenland can see bad weather conditions and they had to spend several days in their tents waiting for things to improve. This actually proved extremely beneficial to Elfving who spent the days thinking about least squares. In fact this prompted him to change the direction of his research and move towards studying\nprobability\nand statistics, topics to which he went on to make major contributions.\nAfter the expedition returned, Elfving obtained a position as a lecturer at a Swedish language university, the Abo Akademi in Turku, Finland. He took up the position in the autumn of\n1935\nand, in the following year, he married Irene Emilia Charlotta Aminoff\n(1905\n-\n1979)\n, known as Ira. She was the daughter of the Privy Councillor Björn Alexis Aminoff and his second wife Sofia Boyle. Gustav and Irene Elfving had three sons, Johan Fredrik Elfving\n(\nborn\n1938)\n, Jörn Gustav Elfving\n(\nborn\n1941)\nand Tord Bernhard Elfving\n(\nborn\n1946)\n. In\n1938\nElfving returned to Helsinki where he was appointed as a lecturer at the Helsinki University of Technology. He had published his first paper on probability, which was on\nMarkov\nchains, in\n1937\n. This paper,\nZur Theorie der Markoffschen Ketten\nⓉ\n(\nOn the theory of Markov chains\n)\n[\n8\n]\n:-\n... introduced the difficult problem of the embeddability of a discrete-time Markov chain into a continuous-time one in the finite-state time-homogeneous setting.\nHe published a further paper on the same topic\nÜber die Interpolation von Markoffschen Ketten\nⓉ\n(\nOn the interpolation of Markov chains\n)\nin the following year. In\n1939\nwar broke out when the Soviet Union attacked Finland. Elfving served as a geodesist in the Finnish coast artillery while also managing to continue lecturing at the University of Technology.\nIn\n1945\nLars Ahlfors\nwent to the University of Zürich and, after a year there, went to Harvard in the United States. His chair of mathematics at the University of Helsinki became vacant and was advertised. Elfving applied for the chair but no quick decision was taken and all the applicants were given a year in which to prove their case for being appointed. This interesting way of making an appointment naturally led to productive periods for the applicants. Elfving spent\n1946\n-\n47\nat the University of Stockholm, but also made visits to the United States where he lectured at Princeton University in the autumn of\n1946\nand on his next visit, at Yale in the spring of\n1947\n. The committee set up to make recommendation regarding the appointment to the chair of mathematics at the University of Helsinki consisted of\nLars Ahlfors\n,\nArne Beurling\nand\nHarald Bohr\n. All three referees ranked Elfving in first position and he was appointed to the chair in\n1948\n. He held this chair, which was for Swedish-speakers, for the rest of his career until he retired in\n1975\n.\nAlthough he held the chair at Helsinki from\n1948\nto\n1975\n, Elfving spent much time on research visits to the United States. He was at Cornell for the two academic years\n1949\n-\n51\n, where he had been invited by\nWilliam Feller\n. It was at Cornell that he wrote one of his most important papers\nOptimum allocation in linear regression theory\n(1952)\n. Peter Whittle writes in a review:-\nThe author considers the situation where observations may be taken from a number of distinct information sources, and where each observation is the sum of a known linear function\n(\nparticular to the source\n)\nof unknown parameters, and a random error\n(\nparticular to the observation\n)\n. The problem is to so distribute the observations among the various sources that the resulting parameter estimates have least variance, the total number of observations being fixed. An ingenious geometrical argument is used to show that, for the case of one or two parameters, only two or three of the potential sources of information are required. The same argument gives the optimum allocation among these sources. A general algebraic solution is also given, in which the allocation weights appear as the elements of a certain eigenvector.\nOther long trips to the United States included Columbia University\n(1955)\nand Stanford University\n(1960\nand\n1966)\nwhich were also very useful and led to several publications. Let us look now at some of Elfving's important contributions. Timo Mäkeläinen writes in\n[\n8\n]\n:-\nElfving wrote original papers in Markov chains, point processes, sufficiency and completeness, order statistics, exact distributions and expansions of distributions, quality control, and nonparametric statistics, as a whole a considerable achievement, but he really made his mark in the optimal design of experiments, where the path-breaking paper of\n1952\nearns him a place among the founders of the subject.\nWriting about Elfving's contributions to experimental design, Herman Chernoff explains\n[\n2\n]\n:-\nExperimental design is one of the major keystones of statistical theory and application. Its development is one of\nR A Fisher\n's major contributions to science. The work of Elfving introduced a fundamentally new direction in this field. It provided important insights into the efficiency of good designs and served as a stepping stone for later developments which have exploited computer technology. ... The revolutionary impact of Elfving's contribution was due to the confluence of several factors. The problem he formulated was general in that it applied to much of the known literature, but was not too general. The results had a simple geometric interpretation and were computationally easy before computer technology was highly developed. Finally they were illustrated in terms of two unknown coefficients which made the results easy to comprehend.\nJohann Fellman, who was a student of Elfving, writes in\n[\n6\n]\nabout Elfving's work in optimal design:-\nElfving was a central member of the small group which laid the foundations of the theory of optimal design. This group left their marks on the entire theory of today. Elfving was primarily interested in fundamental ideas. He was less interested in attempts to obtain the utmost generality. He marked the path and the generalizations were left to his successors. Therefore, he was able to carry through his studies with a minimum of mathematical sophistication. Often standard calculus and basic matrix algebra were enough. In consequence, the central ideas in his papers are not obscured by overwhelming outworks of mathematical technicalities. This fact and his personal talent for writing lucid texts make his papers elegant and highly readable.\nIn\n1981\n, Elfving published the book\nThe history of mathematics in Finland,\n1828\n-\n1918\n.\nMorris Kline\nwrote a review:-\nDuring this period all research was conducted by professors and their pupils at what was known during that time as the Imperial Alexander University, which was renamed the University of Helsinki in\n1918\n. The book describes the work of the professors and their pupils. Among those professors who acquired world-wide reputations were\nGösta Mittag-Leffler\n,\nRolf Nevanlinna\nand\nErnst Lindelöf\n. However, the work of many others is also covered as is the relationship of that work to the work of continental mathematicians. Many of the Finnish mathematicians studied in France or Germany or at least established close contact with the continentals. The book is valuable for what it has to say about the work of the latter as much as what it says about the Finnish mathematicians and their work.\nTimo Mäkeläinen writes about this book in\n[\n9\n]\n:-\nReflecting Elfving's depth of interests,\n[\nthe book\n]\nis more than just an account of the mathematical achievements of a few successful scientists. Elfving provides necessary background of past and contemporary research, at home and abroad, but also Finnish culture, society, and politics. His writing is unpretentious, factual, and entertaining, and the treatment of individual scientists, seen as phenomena of their time, characteristically unbiased.\nElfving writes in\n[\n4\n]\nabout his attitude to research:-\nI think my motive for sitting down to read and write instead of doing something else is in the first place a sense of duty towards the institution at which I happen to be working. This sense of duty has, of course, crystallized into a habit. ... I have very little belief in the importance of my research work; however, I have some belief in the perpetuation of a certain tradition of clarity of thought and expression.\nElfving was honoured with election as a fellow of the Institute of Mathematical Statistics, as a member of the International Statistical Institute, and as an honorary member of the\nRoyal Swedish Academy of Sciences\n.\nLet us end this biography by quoting from Kenneth Nordström about Elfving's character\n[\n10\n]\n:-\nGustav Elfving was a dignified gentleman of the old school and an exceptionally civilized and humane individual. In the company of casual acquaintances, he was courteous and soft-spoken but somewhat reserved. ... Colleagues and friends came to see the more personal side of Gustav Elfving: a considerate and warm human being as well as an open-minded man who enjoyed conversation, contributing to it with charm and wit. He was a connoisseur of culture in its broadest sense, with a keen interest in philosophy, history, literature, languages and society at large, as well as a bon vivant , who enjoyed a glass of wine in good company. ... Elfving wrote poems and enjoyed philosophical discussions ...\nElfving died at his home in Helsinki and was buried in the Hietaniemi Cemetery in Helsinki. He had outlived his wife by five years."
}