{
  "nome_completo": "Hans Hahn",
  "nome_curto": "Hans Hahn",
  "ano_nascimento": "1879",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hahn/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Hans Hahn\n's parents were Ludwig Benedikt Hahn and Emma Blümel. Hans was a student at Strasbourg, Munich and Göttingen. He undertook research for his doctorate at the University of Vienna under Gustav Ritter von Escherich. He was awarded a Ph.D. in\n1902\nfor his thesis\nZur Theorie der zweiten Variation einfacher Integrale\nⓉ\n(\nOn the theory of the second variation of simple integrals\n)\n. While in Vienna he formed a close friendship with three other students of mathematics,\nPaul Ehrenfest\n,\nHeinrich Tietze\nand Herglotz. They were known as the 'inseparable four'.\nHahn was appointed to the teaching staff in Vienna as a\nprivatdozent\nin\n1905\nafter submitting his\nhabilitation\nthesis.  In session\n1905\n-\n06\nHahn substituted for\nOtto Stolz\nat Innsbruck. He taught at Czernowitz in Austria-Hungary from\n1909\nto\n1914\nas an extraordinary professor; Czernowitz was renamed Cernauti when it became part of Romania after World War I, and then Chernovtsy after it became part of the USSR in\n1940\n. Hahn served in the Austro-Hungarian army in World War I and was severely wounded. In\n1916\nhe moved to Bonn where he was appointed as an extraordinary professor teaching there until\n1920\nhaving been appointed to a chair in\n1917\n. He returned to a chair in Vienna in\n1921\n. His three most famous students at Vienna were\nKarl Menger\nwho was awarded his doctorate in\n1924\n,\nWitold Hurewicz\nwho was awarded his doctorate in\n1926\n, and\nKurt Gödel\nwho was awarded his doctorate in\n1929\n.\nMenger\nwrites about Hahn's contributions before World War I:-\nHahn's first results were contributions to the classical\ncalculus of variations\n. He then turned to the study of real functions and set functions, especially integrals. He further published a fundamental paper on non-Archimedean systems, and early recognised the significance of\nFréchet\n's abstract spaces. In a paper introducing local connectedness he characterised the sets which a point can traverse in a continuous motion; this is, the continuous images of a time interval or a segment\n(\nnow often called\nPeano\ncontinua\n)\n. The paper is a classic of the early set-theoretical geometry.\nAs Menger explains, Hahn was a pioneer in set theory and\nfunctional analysis\n. However to many mathematicians he is best remembered for the\nHahn-Banach theorem\nwhich we mention again below. He also made important contributions to the calculus of variations, mostly between\n1903\nand\n1913\n, developing ideas of\nWeierstrass\n. He was interested in real analysis, writing on a variety of different topics in that area. He considered properties of the derivative, the representation of functions by definite integrals, semicontinuous functions, and separately continuous functions of several variables. In\n1923\nhe introduced what today is known as the Hahn sequence space. He also wrote two books on real functions,\nTheorie der reellen Funktionen\nⓉ\n(\nTheory of real functions\n)\n(1921)\n, and\nReelle Funktionen\nⓉ\n(\nReal functions\n)\n(1932)\n.\nHahn wrote four papers on functional analysis. These include a report on\nintegral equationS\nhe wrote in\n1911\n, his modification of\nHellinger\n's theory of invariants of quadratic forms, in which he dispensed with the use of the\nHellinger\nintegral, and his work on duality in\nBanach spaces\n, culminating with his proof of the Hahn-\nBanach\ntheorem in\n1927\n. He wrote papers on the theory of curves including one which gave a rigorous proof of the\nJordan\n's theorem for simple closed polygons which he based on\nVeblen\n's geometrical axioms. Other papers in this area characterise topological spaces that are continuous images of a line segment and related to this topic is what is now known as the Hahn-\nMazurkiewicz\ntheorem. He also studied the theory of ordered abelian groups and ordered fields, initiating the theory in\n1907\n(\nsee for example\n[\n6\n]\n)\n.\nAnother area on which Hahn did research was measure theory. In this area he studied a construction of the\nLebesgue\nintegral as a limit of\nRiemann\nsums, an integral proposed by\nBorel\naround\n1910\n, and worked on the theory of abstract measures, in particular product measures.\nFourier analysis\nalso interested Hahn, and he looked at singular integrals and orthogonal expansions investigating the validity of the\nParseval\nrelation in various circumstances. In some papers he looked at generalised harmonic analysis\n(\nindependently of\nNorbert Wiener\n)\n, and he also wrote a short note on\nFejér\nsummability.\nDespite this wealth of deep papers on a wide range of mathematical topics, many people think of Hahn as a mathematical philosopher. During the\n1920\ns Hahn, together with\nPhilipp Frank\n, Otto Neurath, Moritz Schlick, founded the Vienna Circle of Logical Positivists, a discussion group of gifted scientists and philosophers who met regularly in Vienna. Menger writes on Hahn's role in the Vienna Circle in the article\nHahn and the Vienna Circle\n.\nVon Mises\nwas also a member of the Circle:-\n[\nHahn\n]\nmaintains that logic and mathematics are essentially tautological and say nothing about the external world. He admits, however, that the\naxiom of choice\nis not a tautology; whether we accept it or deny it, he says, depends on what we want the word \"set\" to mean. In his essay on the existence of infinity he says that there can be no absolute proof of consistency for an axiomatic system concerned with infinite sets.\nAn example of Hahn's ideas on mathematical intuition are given in extracts we reproduce in the article at\nTHIS LINK\n.\nHowever, Hahn's ideas on mathematical intuition are strongly criticised by\nBenoit Mandelbrot\nin an article he wrote in\n1982\n. He writes that the editor of the English translation of Hahn's lectures\n(\npublished in\n1956)\n:-\n... states that\n[\nHahn\n]\ndiscusses the cherished faculty of intuition, its role in mathematics, the nest of paradoxes it got us into, and how successful we have been in crawling out. My reaction is very different: Fractal geometry demonstrates that Hahn was dead wrong. Intuition is not invariable but can and must be trained to perform new tasks.\nHahn received many honours for his achievements including the Lieban Prize in\n1921\n. He was elected to the\nAustrian Academy of Sciences\n(\nKaiserliche Akademie der Wissenschaften in Wien\n)\n, and was made an honorary member of the Calcutta Mathematical Society.\nAlthough Hahn died in\n1934\n, he still managed to be an author of the book\nSet Functions\nwhich was published in\n1948\n, fourteen years after his death. The book was co-authored by Arthur Rosenthal and continued to develop material which first appeared in\nSaks\n's\nTheory of the Integral\n(1937)\n.\nHalmos\nwrites:-\nThe book is divided into an introduction\n(\ncontaining an exposition of the relevant parts of set theory and point set topology\n)\nand five chapters, entitled\n(\nI\n)\nAdditive and totally additive set functions,\n(\nII\n)\nMeasure,\n(\nIII\n)\nMeasurable functions,\n(\nIV\n)\nIntegration and\n(\nV\n)\nDifferentiation. The authors' treatment is thorough, rigorous and exhaustive; it includes, with minor exceptions, the first four chapters of\nSaks\n's book and differs from those chapters mainly in the wealth of detail. The set functions studied are defined either in a perfectly abstract set, or else in metric spaces\n(\nand, in particular, Euclidean spaces\n)\n; the intermediate cases of locally compact spaces, normal spaces and topological groups are not discussed."
}