{
  "nome_completo": "Hans Frederick Blichfeldt",
  "nome_curto": "Hans Blichfeldt",
  "ano_nascimento": "1873",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blichfeldt/",
  "lugar_nascimento": "Illar, Sønderborg, Denmark",
  "lugar_morte": "Palo Alto, California, USA",
  "biografia": "Hans Blichfeldt\n's father, Erhard Christoffer Laurentius Blichfeldt, was farmer. However this broke with a long tradition in the family who were ministers of the church. Erhard Blichfeldt married Nielsine Maria Scholer and their son Hans soon showed remarkable mathematical ability. Despite the family being poor, they were well educated and Hans's father helped him with his studies. Hans showed a talent for all subjects, but he shone in mathematics.\nAt an early age Hans took the university entrance examinations. He passed with distinction but his parents were too poor to be able to afford to send him to university. Looking for a better life and to escape the poverty which they lived in, Hans's family decided to emigrate to the United States when he was\n15\nyears of age. This was not the immediate solution to all of Hans's problems for once in the United States he spent four years as a labourer working on farms and in sawmills. It was hard work for the young man, so when he became a surveyor travelling round the country, it was a step towards a better life.\nAs a surveyor Blichfeldt had the opportunity to show his mathematical skills. All his colleagues marvelled at his ability to do mental arithmetic calculations of great complexity. Although this is no real sign of mathematical ability, it is usually taken as such by non-mathematicians and in the case of Blichfeldt his fellow surveyors were absolutely correct in persuading him to study mathematics at university.\nStanford University at Stanford, California was founded in\n1885\nby the railroad magnate Leland Stanford and his wife and the university was dedicated to their deceased only child, Leland. The first intake of students to the university was in\n1891\nand three years later in\n1894\nBlichfeldt began his mathematical studies there. He was awarded a B.A. in\n1896\nand the following year Stanford awarded him a Master's Degree. At this time it was the custom for American students wishing to study for a doctorate to go to Europe. It would be fair to say that Germany was the strongest country for mathematical research at this time and indeed most American students studied for their mathematical doctorates there.\nTo study in Europe, however, required money and Blichfeldt was not well off. He would certainly not have been able to find enough money without the generous help of one of his Stanford professors, Rufus L Green, who gave Blichfeldt a loan of the necessary funds. He returned to Europe going to the University of Leipzig where he worked under Sophus\nLie\non transformation\ngroups\n. Within a year Blichfeldt submitted his dissertation\nOn a certain class of groups of transformation in three-dimensional space\nwhich gained him a doctorate with distinction.\nReturning to the United States, Blichfeldt worked as an instructor at Stanford beginning in\n1898\n. By\n1913\nhe had reached the rank of full professor. In\n1927\nhe was appointed as Head of the Department of Mathematics at Stanford and he remained in this post until he retired in\n1938\n. It is a remarkable story of achievement how Blichfeldt started his working life as a labourer and ended his career as head of department of a major university.\nHis research was on group theory and\nnumber theory\n, covering many topics within these areas. Miller writes in\n[\n1\n]\n:-\nHis lifework was devoted to group theory and number theory. Some of the many topics that he covered were diophantine approximations, orders of linear homogeneous groups, theory of geometry of numbers, approximate solutions of the integers of a set of linear equations, low-velocity fire angle, finite collineation groups, and characteristic roots.\nBlichfeldt wrote papers on the geometry of numbers and he has an important book\nFinite Collineation Groups\n. He co-authored\nTheory and Application of Finite Groups\nwith G A\nMiller\nand\nDickson\n.\nIn\n[\n3\n]\nHlawka\nlooks at Blichfeldt's contributions to the geometry of numbers, in particular looking at Blichfeldt's principle. He also comments on what sort of man Blichfeldt was."
}