{
  "nome_completo": "Harald August Bohr",
  "nome_curto": "Harald Bohr",
  "ano_nascimento": "1887",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bohr_Harald/",
  "lugar_nascimento": "Copenhagen, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Harald Bohr\nwas a younger brother of\nNiels Bohr\n. Their father, Christian Bohr, was professor of physiology at the University of Copenhagen. Christian Bohr was famous for his work on the physical and chemical aspects of respiration. Harald and\nNiels Bohr\n's mother, Ellen Adler Bohr, came from a wealthy Jewish family with family members who were important in banking and in politics in Denmark.\nHarald studied mathematics at the University of Copenhagen. He entered the University in\n1904\nand quickly became a well known Danish personality, not for his mathematics but rather for his soccer skills. He was in the Danish soccer team which was placed second in the\n1908\nOlympic games in London. When his doctoral dissertation was examined at the University of Copenhagen, there were more soccer fans wishing to attend this public examination than there were mathematicians!\nMathematics soon became more important to Bohr than soccer and he became professor of mathematics in the Polytechnic Institute in Copenhagen in\n1915\n. Then, in\n1930\n, he was appointed professor of mathematics at the University of Copenhagen. Although he never quite attained the fame of his brother\nNiels\n(\nexcept as a soccer player!\n)\n, he did produce some mathematics of the very highest importance. It is perhaps surprising that Harald and\nNiels\ndid not collaborate more frequently. They only published one joint paper.\nHarald Bohr worked on\nDirichlet\nseries, and applied analysis to the theory of numbers. He collaborated with\nEdmund Landau\n, who was at this time at Göttingen, in studying the\nRiemann\nzeta function\n. In\n1914\nthey proved the Bohr-\nLandau\ntheorem on the distribution of zeros of the zeta function.\nSome of this important work on the zeta function was due to Bohr alone, some came from the collaboration with\nLandau\n. Some of the most impressive from the many striking results which they proved were major steps towards a proof of the\nRiemann hypothesis\n(\nwhich, however, is still unproved\n)\n. Bohr and\nLandau\nproved that all but an infinitesimal proportion of the zeros of the zeta function lie in a small neighbourhood of the line\ns\n=\n1\n2\ns = \\large\\frac{1}{2}\\normalsize\ns\n=\n2\n1\n​\n.\nBohr's interest in which functions could be represented by a\nDirichlet\nseries led him to devise the theory of almost periodic functions. He founded this theory between the years\n1923\nand\n1926\nand it is with this work that his name is now most closely associated. Roughly speaking an almost periodic function is one which, after a period, takes values within e of its values in the previous period. Bohr published three major works on this topic in\nActa Mathematica\nbetween\n1924\nand\n1926\n.\nThe fundamental theorem for almost periodic functions is a generalisation of the\nParseval\nidentity for\nFourier series\n. This result lead Bohr to a result on the uniform approximation to almost periodic functions by exponential functions.\nTitchmarsh\n, writing in\n[\n10\n]\n, sums up his work on almost periodic functions:-\nThe general theory was developed for the case of a real variable, and then, in the light of it, was developed the most beautiful theory of almost periodic functions of a complex variable. ... The creation of the theory of almost periodic functions of a real variable was a performance of extraordinary power, but was not based on the most up-to-date methods, and the main results were soon simplified and improved. However, the theory of almost periodic functions of a complex variable remains up to now in the same perfect form in which it was given by Bohr.\nAfter setting up the theory of almost periodic functions, Bohr's mathematical work became devoted exclusively to furthering the subject. He continued his work until shortly before his death, in fact he attended the International Congress of Mathematicians in Cambridge, Massachusetts four months before his death.\nBesicovitch\nwrites in\n[\n3\n]\n:-\nFor most of his life Bohr was a sick man. He used to suffer from bad headaches and had to avoid all mental effort. Bohr the man was not less remarkable than Bohr the mathematician. He was a man of refined intellect, harmoniously developed in many directions. He was also a most humane person. His help to his pupils, to his colleagues and friends, and to refugees belonging to the academic world was generous indeed. Once he had decided to help he stopped at nothing and he seldom failed. He was very sensitive to literature. His favourite author was Dickens; he had a deep admiration of Dickens' love of the human being and deep appreciation of his humour."
}