{
  "nome_completo": "Haskell Brooks Curry",
  "nome_curto": "Haskell Curry",
  "ano_nascimento": "1900",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Curry/",
  "lugar_nascimento": "Millis, Massachusetts, USA",
  "lugar_morte": "State College, Pennsylvania , USA",
  "biografia": "Haskell Curry\n's mother was Anna Baright and his father was Samuel Silas Curry. Samuel was the president of the School of Expression in Boston and Anna was the Dean of the School. Haskell did not show particular interest in mathematics when at high school and when he graduated in\n1916\nhe fully intended to study medicine. He entered Harvard College, the undergraduate school of Harvard University, and took a mathematics course in his first year of study as part of his studies towards a degree in medicine.\nA major influence on the direction that his studies took was the entry of the United States into World War I in the spring of\n1917\n. Curry wanted to serve his country, and decided that he would be more likely to see action if he had a mathematics training rather than if he continued the pre-medical course he was on. Anyhow he had enjoyed the mathematics course he had taken and had done very well in the course. He changed his major subject to mathematics and then enlisted in the Student Army Training Corps on\n18\nOctober\n1918\n. The war, however, ended shortly after this\n(\nin November\n)\nand on\n9\nDecember\n1918\nCurry left the army. He continued on the mathematics course at Harvard, however, and graduated in\n1920\nwith an A.B. degree.\nCurry now decided that he would look for a career in electrical engineering and he took a job with the General Electric Company which allowed him to study electrical engineering part-time at the Massachusetts Institute of Technology. However he soon discovered that he had a different attitude to the others taking the courses, for he wanted to know why a result was correct when for everyone else it only mattered that it was correct. Realising that he was more suited to pure science than to applied science, he changed course to study physics in\n1922\n. Also Harvard seemed a better place to study pure science so he returned there, having been appointed to a half-post as a research assistant of P W Bridgeman for the session\n1922\n-\n23\n. Curry graduated with a Master's Degree in physics from Harvard in\n1924\nbut by now he realised that the subject for him was not physics but it was mathematics. He began to undertake research for his doctorate in mathematics at Harvard.\nThroughout this period of changing topics Curry had other things to keep him busy. His father had died in\n1921\nand Curry became a trustee of his father's estate. Of course the main part of this estate was the School of Expression in Boston and, three years after the death of Curry's mother in\n1924\n, it became a legal corporation in\n1927\n. Curry acted as treasurer to the Expression Company from the time it was formed, but it was sold in\n1928\n.\nIf one imagines that from\n1924\nwhen Curry embarked on his doctorate in mathematics at Harvard he at last found the topic for him, then one would be mistaken. He was given a topic in the theory of differential equations by\nGeorge Birkhoff\nbut he began reading books on logic which seemed to him far more interesting that his research topic. He asked various faculty members at Harvard, and\nNorbert Wiener\nat MIT, if they thought he might change to undertake research in logic. They were quite unanimous, advising him against it. He was employed as a half-time instructor in mathematics by Harvard during the first semester of\n1926\n-\n27\nand it was around this time that he read the first volume of\nWhitehead\nand\nRussell\n's\nPrincipia Mathematica\nwhich had been published in\n1910\n. This was fundamental in his development, for it was after reading this work that he had the idea to use combinators to analyse the complicated rules of substitution which characterise the first part of the text. He again approached various faculty members at Harvard, and\nNorbert Wiener\nat MIT, asking whether they thought that he might write his doctoral dissertation on logic. He now got a very different response from what he had received earlier.\nWiener\n's reply was typical - avoid logic unless you have something to say, but now you certainly have something to say!\nCurry now made his final change in direction and decided to give up his doctoral studies on differential equations and to write a doctoral dissertation on logic. Before beginning research on this new topic he decided to teach for a year and, with a strong recommendation from\nBirkhoff\n, was appointed as an instructor in mathematics at Princeton for session\n1927\n-\n28\n. There he discussed his research plans with\nVeblen\nand, while looking at papers in\nMathematische Annalen\nin the Princeton library, discovered a\n1924\npaper by M Schönfinkel\nÜber die Bausteine der mathematischen Logik\nwhich used combinators in a similar way to his own ideas.\nVeblen\nassured Curry that this was a positive, rather than negative, discovery and, after\nAlexander\nhad informed him that Schönfinkel was in a mental hospital and therefore not continuing his line of research, Curry sought advice on who would be the best Ph.D. supervisor.\nVeblen\nadvised him that\nBernays\nat Göttingen, in Germany, would be best. In order to improve his chances of financial support, Curry wrote up his ideas on combinators for publication and this became his first paper\nAn analysis of logical substitution\nwhich appeared in the\nAmerican Journal of Mathematics\nin\n1929\n.\nBefore setting off for Göttingen, Curry married Mary Virginia Wheatley whom he had met at the School of Expression when she was a student there. They married on\n3\nJuly\n1928\nand travelled together to Germany. After almost exactly a year\n(\non\n24\nJuly\n1929)\nhe was examined on his thesis entitled\nGrundlagen der kombinatorischen Logik\n. Formally he was supervised by\nHilbert\n, but in fact it was\nBernays\nwho provided day to day support for his work. His dissertation was published in the\nAmerican Journal of Mathematics\nin\n1930\n.\nReturning to the United States, Curry was appointed to State College, Pennsylvania\n(\nnow Pennsylvania State University\n)\nin September\n1929\n. Haskell and Virginia began their family at this time with Anne Wright Curry born on\n27\nJuly\n1930\nand Robert Wheatley Curry born on\n6\nJuly\n1934\n. The Great Depression began in\n1929\nso it was fortunate that Curry obtained his position when he did. Certainly the years of the Great Depression would have been ones when a mathematical logician would hardly have been likely to obtain a post. Although he remained on the faculty at Pennsylvania State until he retired in\n1966\n, he did spend time at other institutions, particularly at the University of Chicago, where he was a National Research Council Fellow during\n1931\n-\n32\n, and the Institute for Advanced Study at Princeton during\n1938\n-\n39\n. Some papers published during the early years of his research include\nThe universal quantifier in combinatory logic\n(1931)\n,\nSome additions to the theory of combinators\n(1932)\n,\nApparent variables from the standpoint of combinatory logic\n(1933)\n, and\nSome properties of equality and implication in combinatory logic\n(1934)\n.\nThe Association for Symbolic Logic was founded in\n1936\nwith Curry as one of the founders. He was vice-president during\n1936\n-\n37\nand then president of the Association in\n1938\n-\n40\n. His retiring presidential address\nThe combinatory foundations of mathematical logic\nwas published in the\nJournal of Symbolic Logic\nin\n1942\n. After giving a very clear exposition of the fundamentals of combinatory logic, showing its close relationship to the λ-calculus developed by\nChurch\n, Curry went on to describe his recent work. He had examined simplified methods of deriving the paradoxes\n(\nsuch as those of Richard and\nRussell\n)\nin systems of logic which are inconsistent, and had also developed a method of introducing into combinatory logic undefined notions of generality, such as quantification or formal implication, in such a way that a consistency theorem like that of\nChurch\nand Rosser could still be derived.\nAs the\n1940\ns began, Curry had reached the position of being one of the leading mathematical logicians in the world. He was asked to give an expository address to mathematicians to explain the fundamental concepts of formalism and to add new suggestions. The paper\nSome aspects of the problem of mathematical rigor\npublished in the\nBulletin of the American Mathematical Society\nin\n1941\nis the text of this address. He presented in his address: a critique of non-formal theories; the notion of a formal system\n(\nillustrated by\nDickson\n's postulates for a group\n)\n; the notion of a calculus; discussion of a metatheory; the definition of mathematics; and acceptability of a formal system, discussing criticisms from intuitionists and formalists. During the\n1940\ns Curry also renewed his association with the School of Expression in Boston, which by this time had been renamed Curry College. He joined the Board of Trustees of the College in\n1940\nand remained on the Board for over a decade.\nDuring World War II Curry undertook research in applied mathematics. He published\nThe Heaviside operational calculus\nin\n1943\n. In it he presented a very simple algebraic approach but was aware of its limitations writing:-\n... this advantage, of course, implies a restriction on the scope of the treatment, because it is limited to the rational aspects such as arise from ordinary linear differential equations with constant coefficients. For the more general cases of partial differential equations, fractional operators, etc., the theory of integral transforms is doubtless unavoidable.\nHe worked at the Frankford Arsenal from May\n1942\nto January\n1944\n, then at the Applied Physics Laboratories at Johns Hopkins University until March\n1945\n. He then went to the Aberdeen Proving Ground, a military weapons testing site in Harford county northeastern Maryland. There he became involved with the ENIAC computer publishing\nA study of inverse interpolation on the ENIAC\nand\nA study of fourth order interpolation on the ENIAC\nboth in\n1946\n. He returned to Pennsylvania State University in September\n1946\nand tried to persuade the University authorities to acquire a computer, but he failed.\nHis major texts include\nCombinatory Logic\n(1958)\n(\nwith Robert Feys\n)\n, and\nFoundations of Mathematical Logic\n(1963)\n. Curry began working on\nCombinatory Logic\nin\n1950\nwhen he was awarded a Fulbright Grant that enabled him to work with Robert Feys at Louvain. They continued collaborating on the book after Curry returned to the United States and completed the text in\n1956\n. E J Cogan, reviewing the book, gives a nice description of combinatory logic:-\nCombinatory logic is concerned with certain basic notions of the foundations of mathematics which are usually used in an intuitive and unanalysed way. Such notions include substitution, usually introduced by the use of variables, and classification of the entities of a system into types, which is usually provided for by rules which are auxiliary to, but not part of, the system. The part of combinatory logic which is concerned with questions of a fundamental nature which, like substitution, involve variables, is called the theory of combinators.\nIn\nFoundations of Mathematical Logic\nCurry develops the topic from an algebraic basis using\nGentzen\n's methods. J Tucker writes:-\nThe most striking effect of this approach is that the finite positive operations of implication, conjunction and alternation are dealt with first, while negation and quantification are brought in later and in separate chapters. The meaning of each fundamental connective is not laid down at the beginning as it is in the classical approach, but is derived by inferential rules.\nIn\n1966\nhe accepted the position of Professor of Logic, History of Logic, and Philosophy of Science at Amsterdam. He held this position for four years after which he returned to live in State College, Pennsylvania.\nThe authors of\n[\n3\n]\nmake some nice comments about Curry and his wife:-\nEveryone who knows the Currys is aware of how friendly and helpful they always are. Haskell has always done more for colleagues and students than be a source of important ideas. He has always been willing to listen to everyone who wanted to talk to him, to discuss their ideas, and to give whatever encouragement that he could. ... His office door has always been open. And this has undoubtedly been an important contribution to the enthusiasm of many of those of us working in combinatory logic. Also well known wherever the Currys have lived has been the hospitality they have shown. There are always many parties and other, less formal gatherings, and we conjecture that Virginia's cooking has also played a role in the growth of interest in combinatory logic."
}