{
  "nome_completo": "Hassler Whitney",
  "nome_curto": "Hassler Whitney",
  "ano_nascimento": "1907",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whitney/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Mount Dents Blanches, Switzerland",
  "biografia": "Hassler Whitney\n's father was Edward Baldwin Whitney, a judge, and his mother was A Josepha Newcomb. Edward's father was William Dwight Whitney who was a linguist and one of the foremost Sanskrit scholars of his time, noted especially for his classic work,\nSanskrit Grammar\n(1879)\n. Josepha's father was\nSimon Newcomb\nwho has a biography in this archive. Certainly Hassler had two very famous grandfathers.\nWhitney attended Yale University where he received his first degree in\n1928\n, then continued to undertake mathematical research at Harvard  University from where his doctorate was awarded in\n1932\n. His doctorate was awarded for a dissertation\nThe Coloring of Graphs\nwritten under\nBirkhoff\n's supervision. Whitney was a keen mountaineer all his life and he made a particularly famous climb while an undergraduate. His grandson James writes:-\n[\nWhitney\n]\nmade the first ascent of the Whitney Gilman ridge on Cannon cliff, New Hampshire in\n1929\nwith his cousin Bradley Gilman. This knife edge ridge is\n700\nfeet high and is one of the most beautiful climbs on the east coast. ... Whitney subscribed to the \"fast and light\" school of mountaineering\n(\nand rock climbing\n)\n. ... Hassler moved quickly with less protection than is considered usual today. On the Whitney Gilman ridge, he climbed without pitons\n(\nor anything else\n)\nfor protection. He did not even protect the belays, instead using a comfortable and secure stance. On some climbs, especially on climbs in the Swiss Alps, he did use pitons for protection and/or belays.\nWhitney married Margaret R Howell on\n30\nMay\n1930\n; they had three children, James Newcomb Whitney, Carol Whitney, and Marian Whitney. He continued to work at Harvard, being appointed an instructor in mathematics from\n1930\nuntil\n1935\n, although the years\n1931\n-\n33\nwere spent as a National Research Council Research Fellow at Harvard and Princeton. From\n1935\nhe was promoted to assistant professor, then from\n1940\nassociate professor. From\n1943\nto\n1945\nhe was a member of the Applied Mathematics Panel of the National Defense Research Committee. John McCleary writes in his article\nHassler Whitney, the Applied Mathematics Panel, and Airborne Weapons Accuracy\n:-\nThe Applied Mathematics Panel was established in late\n1942\nto provide mathematical expertise to the divisions of the National Defense Research Committee. It employed academic mathematicians at several sites. Hassler Whitney, then at Harvard, joined the group at Columbia working on questions concerning fire control systems, that is, systems which control the aiming of weaponry, especially on aircraft and rockets. His involvement was typical of the problems handled by the Applied Mathematics Panel.\nHarvard made Whitney a full professor in\n1946\nand he held this professorship until he accepted an offer from the Institute for Advanced Study at Princeton of a professorship in\n1952\n. After Whitney and his wife were divorced he married Mary Barnett Garfield on\n16\nJanuary\n1955\n; they had two children, Sarah Newcomb Whitney and Emily Baldwin Whitney.\nBanchoff, reviewing\n[\n2\n]\n, writes:-\nIn the collected papers of Hassler Whitney, two things are apparent - the wide range of his interests and innovations and the solitary nature of his research. He worked almost entirely alone, although he kept up with the developments in the fields in which he initiated new ideas. His work contains carefully done and complete details, including descriptions of the key examples that motivated the research.\nHe then goes on to give details of the topics on which Whitney worked:-\nAs impressive as each individual paper is, it is even more impressive to see them grouped together in two volumes, the first including papers in graphs and combinatorics, differentiable functions and singularities, and analytic spaces, and the second containing contributions to\nmanifolds\n, bundles and characteristic classes,\ntopology\nand\nalgebraic topology\n, and geometric integration theory. A final section on other topics includes nine papers on logic, geometry, and the mathematics of physical quantities, for the last of which he received a Lester Ford Award.\nWhitney's doctoral thesis was on graph theory, in particular making a major contribution to the four colour problem. Following this he published a number of papers on graph theory such as\nA theorem on graphs\n(1931)\n,\nNon-separable and planar graphs\n(1932)\n,\nCongruent graphs and the connectivity of graphs\n(1932)\n,\nThe coloring of graphs\n(1932)\n,\nA numerical equivalent of the four color map problem\n(1937)\n.\nHis main work, however, was in topology, particularly in the theory of manifolds. Continuing work started by\nVeblen\nand\nHenry Whitehead\n, Whitney produced fundamental work in\ndifferential topology\nin\n1935\n. In particular he proved theorems about the embedding of an\nn\nn\nn\n-dimensional differentiable manifold in Euclidean space and he discovered characteristic classes at the same time as Stiefel. The term Stiefel-Whitney characteristic classes is often used today. He wrote a survey paper\nTopological properties of differentiable manifolds\nin\n1937\nwhich includes the many of the recent contributions he had made. In\n1939\nhe gave his famous duality and product theorems: the term Whitney duality is now used.\nOther work on algebraic varieties and integration theory was important. He published the book\nGeometric integration theory\nIn\n1957\nwhich describes his work on the interactions between algebraic topology and the theory of integration. After an introduction, the chapters of the book are:-\nGrassmann algebra; Differential forms; Riemann integration theory; Smooth manifolds; Abstract integration theory; Some relations between chains and functions; General properties of chains and cochains; Chains and cochains in open sets; Flat cochains and differential forms; Lipschitz mappings; Chains and additive set functions.\nThis topic had been the subject of the lecture which Whitney gave to the International Congress of Mathematicians, held in Cambridge, Massachusetts in\n1950\n. His second book\nComplex analytic varieties\nwas published in\n1972\n.\nIn addition to research at the frontiers of mathematical research, Whitney was also interested in mathematics teachings in schools. Zund writes\n[\n8\n]\n:-\nWhitney became actively involved in mathematical education at the elementary school level. He gave a number of lectures on this topic, conducted summer courses for teachers, and on one occasion spent four months teaching pre-algebra mathematics to a seventh grade class of students.\nOutside mathematical research and teaching mathematics Whitney contributed in many ways to his subject. He was chairman of the National Science Foundation mathematics panel from\n1953\nuntil\n1956\n. He was editor of the\nAmerican Journal of Mathematics\nfrom\n1944\nto\n1949\n, then editor of\nMathematical Reviews\nfrom\n1949\nuntil\n1954\n. He was honoured by being elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1945\n, and he was also elected to the\nAcademy of Sciences\n(\nParis\n)\nand the\nSwiss Mathematical Society\n. He was American Mathematical Society Colloquium Lecturer in\n1946\nand he was vice-president of the\nAmerican Mathematical Society\nfrom\n1948\nto\n1950\n.\nUlam\nwriting about Whitney said:-\nHe was friendly, but rather taciturn - psychologically of a type one encounters in this country more frequently than in central Europe - with wry humour, shyness but self-assurance, a probity which shines through, and a certain genius for persistent and deep follow-through in mathematics.\nPrinceton was to remain Whitney's base from\n1952\nuntil he retired in\n1977\n. The year before he retired he was awarded the National Medal of Science. Then in\n1983\nhe received the Wolf Prize:-\n... for his fundamental work in algebraic topology,\ndifferential geometry\nand differential topology.\nTwo years later he was awarded the Steele Prize.\nAfter Whitney was divorced from his second wife he married Barbara Floyd Osterman on\n8\nFebruary\n1986\n. He was nearly\n79\nyears old at the time of his third marriage."
}