{
  "nome_completo": "Heinrich Eduard Schröter",
  "nome_curto": "Heinrich Schröter",
  "ano_nascimento": "1829",
  "ano_morte": "1892",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schroeter/",
  "lugar_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Breslau, Germany (now Wrocław, Poland)",
  "biografia": "Heinrich Schröter\n's father was a respected merchant who became head of the College of Commerce in Königsberg. Heinrich was the eldest of his parents three sons. His primary education was at a private school then, when he was eleven years old, he entered the Altstädtischen\nGymnasium\nin Königsberg. There he proved himself a diligent and conscientious pupil and, from the third form onwards, he began reading mathematics books. He was fortunate to have an outstanding teacher of mathematics, Professor Müttrich, several of whose pupils went on to become leading mathematicians. Schröter quickly learnt the foundations of the differential calculus and he decided that he wanted to apply mathematics. With expertise in technical drawing and constructing models, he thought that perhaps an occupation as a surveyor would suit him. He graduated from the Gymnasium in\n1845\nbut, inspired by Müttrich, quickly changed his mind about his future profession and decided to study mathematics and physics at university. In fact Schröter was the first of a number outstanding mathematics pupils at the Königsberg Gymnasium, all influenced by Müttrich;\nRudolf Lipschitz\n,\nCarl Neumann\n, and\nAlfred Clebsch\nwere three to four years behind Schröter.\nReturning to his native city, he entered the University of Königsberg to study mathematics and physics. The University of Königsberg had become a leading centre for mathematics during the years that\nCarl Jacobi\nworked there but he left for Berlin in June\n1844\nshortly before Schröter began his studies. However Königsberg still had excellent mathematicians in Friedrich Richelot and\nOtto Hesse\nwho had both been students of\nJacobi\n. Richelot was a worthy successor to\nJacobi\nand continued to work in his spirit while\nHesse\ncontinued\nJacobi\n's algebraic work making fundamental contributions to the algebraic treatment of analytic geometry. Another outstanding mathematician at Königsberg at this time was\nFranz Neumann\nwho had begun working there three years before Schröter was born but was at the peak of his creativity in the\n1840\ns. Among these inspiring teachers it was Richelot who influenced Schröter most, introducing him to\nJacobi\n's work on function theory.\nSchröter graduated from Königsberg in\n1848\nafter which he spent two years doing voluntary military service in the artillery before he began to undertake research for his doctorate at the University of Berlin. At Berlin he was taught by\nLejeune Dirichlet\nand\nJakob Steiner\n. He attended courses by\nDirichlet\non number theory and on differential equations which influenced Schröter's teaching for the whole of his career but it was\nSteiner\nwho was a major influence on Schröter's research. Partly this influence was through the courses\nSteiner\ndelivered, but his greatest influence on Schröter was through personal contacts. However his doctorate was obtained from Königsberg on\n13\nJuly\n1854\nfor his dissertation on the theory of\nelliptic functions\nDe aequationibus modularibus\nⓉ\n(\nOn modular equations\n)\nwhich was supervised by Richelot. Immediately after graduating, Schröter took the state examinations to become a Gymnasium mathematics teacher but quickly decided on an academic career. He submitted his\nhabilitation\nthesis\nÜber die Entwicklung der Potenzen der elliptischen Transcendenten Q und die Teilung dieser Functionen\nⓉ\n(\nOn the development of the powers of the elliptical transcendentals Q and the division of these functions\n)\nto the University of Breslau in the autumn of\n1855\n.\nAfter lecturing at the University of Breslau as a\ndozent\n, he become an extraordinary professor there in\n1858\n. On\n8\nAugust\n1860\n, he married Clara Rodewald, the daughter of a lawyer from Breslau; they had four children. The chair at Breslau had been held by\nEduard Kummer\nuntil\n1855\nwhen he went to Berlin and, following his departure, the chair was filled by his student\nFerdinand Joachimsthal\n. Schröter was a colleague of\nJoachimsthal\nuntil his death in\n1861\nwhen Schröter succeeded to the Breslau chair. In the following year\nRudolf Lipschitz\nwas appointed as extraordinary professor at Breslau and Schröter,\nLipschitz\nand M Frankenheim jointly founded a seminar in mathematics and mathematical physics\n(\nfor more details, see\n[\n6\n]\n)\n. Schröter remained in Breslau for the rest of his life despite being offered another chair. When\nAlfred Clebsch\nleft Giessen to take up the chair at Göttingen in\n1868\n, Schröter was offered the Giessen chair but he turned it down. His last few years were badly affected by ill health and he suffered from paralysis.\nSchröter created at Breslau the leading centre for synthetic geometry. His career in Breslau showed how strongly he had been influenced by\nSteiner\n. His first paper\nÜber die Erzeugnisse krummer projektivischer Gebilde\nⓉ\n(\nOn the twisted products of projective structure\n)\n(1857)\nbuilt on work by\nSteiner\nin a paper he published in January\n1856\n. His next paper, however,\nÜber die Raumcurven dritter Klasse und dritter Ordnung\nⓉ\n(\nOn space curves of the third-class and third-order\n)\n(1859)\nbuilt on work by\nChasles\nin a paper he published in\n1857\n. In\n1861\nSchröter published\nÜber Modulargleichungen der elliptischen Functionen, Auszug aus einem Schreiben an Herrn L Kronecker\nⓉ\n(\nOn modular equations of elliptic functions: extract from a letter to  Kronecker\n)\n. After\nSteiner\n's death in\n1863\nhe took over the publication of his posthumous manuscripts, particularly those which were related to the application of the theory of conic sections to projective curves.  He edited his transcripts of\nSteiner\n's lectures on synthetic geometry which he interweaved with other material by\nSteiner\n, together with his own improvements, to produce\nJacob Steiner's Vorlesungen über synthetische Geometrie\nⓉ\n(\nJacob Steiner's lectures on synthetic geometry\n)\n(1867)\n. This important work became the textbook for the synthetic geometry of conics with a second edition appearing in\n1876\nand a third edition in\n1898\nafter Schröter's death. Next we mention two papers on third-order curves,\nÜber eine besondere Curve dritter Ordnung und eine einfache Erzeugungsart der allgemeinen Curven dritten Ordnung\nⓉ\n(\nOn a special curve of the third order and a simple type of production of general curves third order\n)\n(1872)\nand\nÜber Curven dritter Ordnung\nⓉ\n(\nOn third-order curves\n)\n(1873)\n. His next major book was\nDie Theorie der Oberflächen zweiter Ordnung und der Raumkurven dritter Ordnung als Erzeugnisse projectivischer Gebilde\nⓉ\n(\nThe theory of second order surfaces and space curves of the third order as products of projective structure\n)\nwhich he published in\n1880\n. This work on the theory of second order surfaces and third order space curves continues\nSteiner\n's work. In\n1888\nSchröter published a book on third-order plane curves\nDie Theorie der ebenen Curven dritter Ordnung, auf synthetische Weise abgeleitet\nⓉ\n(\nThe theory of the flat curves of the third order, derived synthetically\n)\nand in\n1890\nhe published his major study on fourth-order space curves in\nGrundzüge einer rein geometrischen Theorie der Raumcurven vierter Ordnung erster Species\nⓉ\n(\nGeneral purely geometric theory of space curves of the fourth order, first species\n)\n.\nAmong his doctoral students at the University of Breslau were\nRudolf Sturm\n(\ndoctorate awarded in\n1863\nfor the thesis\nDe superficiebus tertii ordinis disquisitiones geometricae\n)\n,\nJakob Rosanes\n(\ndoctorate awarded\n1865)\nand\nMoritz Pasch\n(\ndoctorate awarded in\n1865\nfor the thesis\nDe duarum sectionem conicarum in circulos projectione\n)\n.\nRudolf Sturm\nwrote the biographies\n[\n4\n]\nand\n[\n5\n]\nof Schröter.\nSchröter was honoured for his contributions to synthetic geometry. He received the\nSteiner\nPrize from the\nBerlin Academy of Science\non\n6\nJuly\n1876\nand, on\n6\nJanuary\n1881\nhe was elected to the\nBerlin Academy of Science\n. In\n[\n2\n]\nthe opinions of\nWeierstrass\nand\nKronecker\non Schröter are discussed, these being reports on him as a candidate for election to the Academy. On\n9\nDecember\n1882\nhe was elected a Corresponding Member of the\nGöttingen Academy of Sciences\n.\nFinally we mentions Schröter's interests outside mathematics. He was an excellent musician, playing the violin to a high standard in a local amateur orchestra. He was also keen on gymnastics and for twenty-five years he was the head of the Old Breslau Gymnastics Club."
}