{
  "nome_completo": "Heinrich Wilhelm Ewald Jung",
  "nome_curto": "Heinrich Jung",
  "ano_nascimento": "1876",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jung/",
  "lugar_nascimento": "Essen, Germany",
  "lugar_morte": "Halle, Germany",
  "biografia": "Heinrich Jung\n's father was Wilhelm Jung. Heinrich studied mathematics, physics and chemistry at the University of Marburg and at the University of Berlin from\n1895\nto\n1899\n.  His teachers included the following mathematicians:\nFriedrich Schottky\nwho had moved to Marburg from Zürich in\n1892\n;\nKurt  Hensel\nwho taught Jung at Berlin but later moved to Marburg;\nLazarus Fuchs\nwho had moved to Berlin from Heidelberg in\n1884\n;\nGeorg Frobenius\nwho moved from Zürich to Berlin in\n1892\n; and\nHermann A Schwarz\nwho moved from Göttingen to Berlin in\n1892\n. Jung was also taught in Berlin by the theoretical physicist\nMax Planck\nwho moved from Kiel to Berlin in\n1888\n. Mathematics was Jung's main interest and, from this star-studded collection of teachers, it was\nHensel\nin Berlin and\nSchottky\nin Marburg who were the greatest influence on him. It was\nSchottky\nwho became Jung's doctoral thesis advisor, and he was awarded his doctorate in\n1899\nfrom for his thesis\nÜber die kleinste Kugel, die eine räumliche Figur einschliesst\nⓉ\n(\nOn the smallest sphere that encloses a solid figure\n)\nwhich was published in\nCrelle\n's journal.\nAs well as being awarded his doctorate in\n1899\n, Jung passed the state examinations to allow him to teach in a\ngymnasium\nin the same year. In\n1902\nhe submitted his\nhabilitation\nthesis\nDie Wurzelfunktionen in dem durch die Gleichung\nG\n(\np\n,\nq\n)\n=\n0\nG(p, q) = 0\nG\n(\np\n,\nq\n)\n=\n0\nvom Range\n2\nund durch die Gleichung\nz\n=\nH\n(\np\n,\nq\n)\nz = H(p, q)\nz\n=\nH\n(\np\n,\nq\n)\ndefinierten algebraischen Körper\nK\n(\np\n,\nq\n)\nK(p, q)\nK\n(\np\n,\nq\n)\nⓉ\n(\nThe root functions of the equation G\n(\np, q\n)\n=\n0\nof rank\n2\nand of the equation z = H\n(\np, q\n)\ndefining an algebraic body K\n(\np, q\n)\n)\nto Marburg and he then became a\nprivatdozent\nthere. Jung remained at Marburg until\n1908\nwhen he was appointed as a professor in Kiel. From\n1913\nhe taught as a secondary school teacher in Hamburg. Soon after this World War I broke out and Jung spent a short time undertaking war work. After the war ended he received an appointment at the University of Dorpat in\n1918\n. Two years later he succeeded\nWangerin\nat the University of Halle, where he continued to teach until he retired in\n1948\n. After he retired he taught for a further three years.\nMost of Jung's work involved looking at algebraic functions. Among his publications we give a few examples of those which were early in his career:\nÜber die Transformation algebraischer Körper vom Range\n1\nⓉ\n(\nOn the transformation of algebraic body from the Range\n1\n)\n(1904)\n,\nEin Satz über Thetafunktionen\nⓉ\n(\nA theorem on theta functions\n)\n(1905)\n,\nDarstellung der Funktionen eines algebraischen Körpers zweier unabhängiger Veränderlicher x, y in der Umgebung einer Stelle x = a, y = b\nⓉ\n(\nShowing the functions of an algebraic body of two independent variables x, y around a point x = a, y = b\n)\n(1908)\n,\nPrimteiler algebraischer Funktionen zweier unabhängiger Veränderlichen und ihr Verhalten bei birationalen Transformationen\nⓉ\n(\nPrime divisors of algebraic functions of two independent variables and their behavior under birational transformations\n)\n(1908)\n. Jung published some important books:\nEinführung in die Theorie der algebraischen Funktionen einer Veränderlichen\nⓉ\n(\nIntroduction to the theory of algebraic functions of one variable\n)\n(\nde Gruyter, Berlin and Leipzig,\n1923)\n,\nAlgebraische Flächen\nⓉ\n(\nAlgebraic Surfaces\n)\n(\nHelwingsche Verlagsbuchhandlung, Hannover,\n1925)\n,\nEinführung in die Zahlentheorie\nⓉ\n(\nIntroduction to Number Theory\n)\n(\nJänicke, Leipzig,\n1935)\n,\nEinführung in die Theorie der quadratischen Zahlkörper\nⓉ\n(\nIntroduction to the theory of quadratic number fields\n)\n(\nJänicke, Leipzig,\n1936)\n,\nMatrizen und Determinanten\nⓉ\n(\nMatrices and Determinants\n)\n(\nJänicke, Leipzig,\n1948)\n, and his final publication, which incorporated much that had appeared in his research papers over the years,\nEinführung in die Theorie der algebraischen Funktionen zweier Veränderlicher\nⓉ\n(\nIntroduction to the theory of algebraic functions of two variables\n)\n(\nAkademie-Verlag, Berlin,\n1951)\n. It will help to give a flavour of Jung's work if we look more closely at his final book. Here are some extracts from a review by\nChevalley\nof the book:-\nLet K be a field of algebraic functions of two variables over the field of complex numbers. The geometric approach to the study of K is by means of the points of some algebraic surface, preferably free from singularities, which is a model of the field K. The analytic approach, followed in the present book, uses as fundamental concept that of a place of the field K, a place being an isomorphism of K into the quotient field of the ring of convergent power series in two variables\n(\nthe uniformizing variables at the place\n)\nwith the requirement that distinct couples of values of the variables u, v in these power series sufficiently near to\n(0\n,\n0)\nshould lead to distinct values for some function of the field. ...\nWe now turn to a brief description of the contents of the book. The introduction is concerned with the study of the field of\nrational functions\nof two variables. It contains an exposition of the method of reduction of singularities of a plane curve by quadratic transformations. Part I introduces the main concepts\n(\nplaces and divisors\n)\n... Part II is concerned with proof of the\nRiemann\n-\nRoch\ntheorem. ... Part III is concerned with the \"place transformations\", i.e. the simultaneous consideration of several systems of places for the same field. ... Part IV is concerned with the theory of differentials, which is developed in the Picard style. ... Part V is concerned with the theory of algebraic equivalence of divisors and of the Picard variety. ... Part VI is concerned with the theory of punctual divisors and their equivalence. ... The last and seventh part is concerned with more special problems: a new expression for the\nZeuthen\n-Segre invariant, a detailed study of fields of the form\nC\n(\nx\n,\ny\n,\n(\nW\n(\nx\n,\ny\n)\n)\n1\n/\n2\nC(x,y,(W(x, y))^{1/2}\nC\n(\nx\n,\ny\n,\n(\nW\n(\nx\n,\ny\n)\n)\n1\n/\n2\n, and the study of surfaces with a pencil of rational curves, leading to\nEnriques\n' theorem.\nOn the whole, the book contains a very large mass of information about algebraic surfaces over the field of complex numbers."
}