{
  "nome_completo": "Heinrich Franz Friedrich Tietze",
  "nome_curto": "Heinrich Tietze",
  "ano_nascimento": "1880",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tietze/",
  "lugar_nascimento": "Schleinz (E of Neunkirchen), Austria",
  "lugar_morte": "Munich, Germany",
  "biografia": "Heinrich Tietze\n's father was Emil Tietze, the Director of the Geological Institute at the University of Vienna, and his mother was Rosa von Hauer, who was the daughter of the geologist Franz Ritter von Hauer. Tietze was a student at the Technische Hochschule in Vienna, starting his studies there in\n1898\n. At Vienna he formed a close friendship with three other students of mathematics,\nPaul Ehrenfest\n,\nHans Hahn\nand Gustav Herglotz. They were known as the 'inseparable four'.\nIt was his friend Herglotz who suggested that Tietze spend a year in Munich, and indeed he went there in\n1902\nto continue his studies. Returning to Vienna, Tietze was supervised during his doctoral studies by Gustav von Escherich and he was awarded his doctorate in\n1904\n.\nWirtinger\n, who had himself studied at Vienna, spent ten years at the University of Innsbruck before returning to a chair at the University of Vienna in\n1905\n. He lectured on algebraic functions and their integrals in his first year back in Vienna, and Tietze attended these lectures and because of them formed an instant liking for\ntopological\nnotions which would from that time on be his main research topic.\nTietze submitted his\nhabilitation\nthesis to Vienna in\n1908\nand this was on a topological topic considering topological invariants. From\n1910\nhe was an extraordinary professor of mathematics at Brünn\n(\ntoday called Brno\n)\n, and in\n1913\nhe was promoted to ordinary professor. His career was interrupted, however, in\n1914\nby the outbreak of World War I.\nAt the start of the war Tietze was called up to serve in the Austrian army. He served for the duration of the war, returning to Brünn when hostilities had ended. The following year, in\n1919\n, he accepted the chair of mathematics at the University of Erlangen. After six years in Erlangen, Tietze accepted a chair at the University of Munich. He remained in Munich for the rest of his life, retiring from his chair in\n1950\nbut continuing his mathematical research almost up to the time of his death at age\n83\n. Of course this means that Tietze spent the difficult years of Nazi control of Germany at Munich and this had many unfortunate consequences.\nLitten, in\n[\n3\n]\n, gives details of one such difficulty.\nCaratheodory\nwas a colleague of Tietze's at Munich until he retired in\n1938\n. The quest for a successor took from\n1938\nuntil\n1944\nand resulted in unbelievably complex political considerations. Tietze and his colleagues drew up a short list of three candidates to replace\nCaratheodory\n. These were Herglotz,\nvan der Waerden\nand\nSiegel\n. However, all three were opposed by the Nazi professors at Munich for political reasons. Litten describes the arguments which involved considering the political reliability and the number of Jewish friends of the candidates.\nTietze contributed to the foundations of\ngeneral topology\nand developed important work on subdivisions of cell complexes. The paper\n[\n5\n]\nlists six books and\n104\npapers written by Tietze. The bulk of this work was carried out after he took up the chair at Munich in\n1925\n.\nFundamental groups\nwere introduced by\nPoincaré\nin\n1895\nand, in\n1908\n, Tietze recognised that from the abelianised fundamental group of a space all the earlier invariants could be calculated. In that\n1908\npaper, Tietze produced a finite\npresentation\nfor the fundamental group and invented the now well-known Tietze transformations to show that fundamental groups are topological invariants. The now famous Tietze transformations change one presentation of a finitely presented group to another presentation without changing the group which is defined by the presentation. It is possible to go from any given finite presentation of a group to any other using Tietze transformations.\nIn the same\n1908\npaper Tietze gives the first reference to the isomorphism problem for groups, namely: if two groups are defined by finite presentations, is there an algorithm to decide whether they are isomorphic or not? Of course Tietze gives the problem in the context of fundamental groups of topological spaces.\nIt is probably fair to say that\nvon Dyck\ninitiated the study of combinatorial group theory but then Tietze made the first major step forward. Among the topics in topology which Tietze worked on were\nknot theory\n,\nJordan\ncurves and continuous mappings of areas. Tietze also wrote on\nmap colouring\nand wrote a well known book\nFamous Problems of Mathematics\n. Seebach writes\n[\n1\n]\n:-\nIt shows his gift for representing even difficult mathematical questions in a very clear and impressive manner for interested people.\nTopics outside topology which Tietze worked on included\nruler and compass constructions\n,\ncontinued fractions\n, partitions, the distribution of\nprime numbers\n, and\ndifferential geometry\n.\nTietze received many honours for his contributions. In particular he was elected a member of the Bavarian Academy of Sciences and served two terms\n(1934\n-\n42\nand\n1946\n-\n51)\nas Secretary to the Mathematics and Natural Sciences Division. He was also elected a Fellow of the\nAustrian Academy of Sciences\nin\n1959\n."
}