{
  "nome_completo": "Heisuke Hironaka",
  "nome_curto": "Heisuke Hironaka",
  "ano_nascimento": "1931",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hironaka/",
  "lugar_nascimento": "Yamaguchi, Japan",
  "lugar_morte": null,
  "biografia": "Heisuke Hironaka\n's father ran a textile factory. This was not an occupation he wanted but he was forced into the family business when his father\n(\nHeisuke's paternal grandfather\n)\ndied while he was still a schoolboy. Heisuke's mother was his father's third wife. After his first wife died, he remarried and had four children. However, his second wife then died and he married for the third time, to a younger sister of his second wife who, by this time, was widowed with one child. These five children comprised three boys and two girls. Heisuke's parents then had ten children of their own\n(\nsix boys and four girls\n)\n, so Heisuke grew up in a family of fifteen children. Of his parents' ten children, Heisuke was the second eldest having one older sister.\nTwo of Heisuke's half-brothers were killed, one fighting against the Americans and one fighting against the Chinese. Heisuke's father was devastated and as a consequence sold his textile factory and gave up work. Heisuke attended elementary school and then middle school where he began to develop a liking for mathematics. The town of Yamaguchi is about\n80\nkm from Hiroshima and on Monday,\n6\nAugust\n1945\n, at\n8\n.\n15\nin the morning, Heisuke's father witnessed the dropping of the atomic bomb on Hiroshima. They were fortunate that their area was not affected by the radiation. After middle school, Heisuke attended the boys' junior high school in Yanai. This meant that he had to take a\n30\nminute train journey to school every day. He started to learn to play the piano and became very keen but was advised by his teachers not to think of becoming a professional musician. After a mathematics professor from Hiroshima University gave a lecture at the junior high school, Heisuke became enthusiastic and applied to study mathematics at Hiroshima University. However he did not study for the entrance examination and failed. In the following year he applied to study physics at Kyoto University and was accepted. He was able to live with one of his sisters who had married and was living in Kyoto.\nKyoto University was founded in\n1897\nto train small numbers of selected students as academics. By the time Hironaka entered Kyoto University in\n1949\n, it had been integrated into a mass higher education system but had maintained its prestige. In his first year Hironaka studied physics, chemistry and biology. In his second year, however, he began to realise that he was best suited to mathematics. By his third year as an undergraduate he had moved completely to courses in mathematics. Yasuo Akizuki, a pioneer of modern algebra in Japan, was a major influence on Hironaka during his time at Kyoto. He received his Bachelor of Science in\n1954\nand his Master of Science in\n1956\n, both from Kyoto University. An important event happened in\n1956\nwhen\nOscar Zariski\nvisited Kyoto University\n[\n3\n]\n:-\nWhen Zariski visited, I tried to tell him what I was doing. I have never been good in English! But my colleagues and teachers helped me to explain to him what I was doing. At some point\nZariski\nsaid, \"Maybe you can come to Harvard and study.\" And I said, \"Okay.\"\nHironaka went to the United States in the summer of\n1957\nwhere he continued his studies at Harvard. He undertook research for his doctorate, with\nOscar Zariski\nas his thesis advisor. While at Harvard, Hironaka became friends with\nAlexander Grothendieck\nwho spent the academic year\n1958\n-\n59\nthere. He invited Hironaka to the Institut des Hautes Études Scientifiques in Paris in\n1959\n-\n60\nwhere he found himself the only visiting fellow. He was awarded a Ph.D. from Harvard in\n1960\nfor his thesis\nOn the Theory of Birational Blowing-up\n. He had already published three papers before submitting his thesis,\nOn the arithmetic genera and the effective genera of algebraic curves\n(1957)\n,\nA note on\nalgebraic geometry\nover ground rings. The invariance of Hilbert characteristic functions under the specialization process\n(1958)\n, and\nA generalized theorem of Krull-Seidenberg on parameterized algebras of finite type\n(1960)\n. After completing his studies at Harvard, Hironaka was appointed to the staff at Brandeis University. Also in\n1960\nhe married Wakako who was a Wien International Scholar at Brandeis University during\n1958\n-\n60\n. She obtained an M.A. in Anthropology from Brandeis University Graduate School in\n1964\n. Heisuke and Wakako Hironaka had one son Jo and one daughter Eriko. Wakako wrote several books, essays, translations, and critiques on education, culture, society, and women's issues. She entered Japanese politics being first elected to the House of Councillors in\n1986\n. She has held high positions in the Democratic Party of Japan and in the Hosokawa Cabinet.\nAfter being on the faculty at Brandeis University, Hironaka was appointed to Columbia University, and then to Harvard in\n1968\n. In\n1970\nhe had the distinction of being awarded a\nFields Medal\nat the International Congress at Nice. This was for his work on algebraic varieties which we describe below.\nTwo algebraic varieties are said to be equivalent if there is a one-to-one correspondence between them with both the map and its inverse regular. Two varieties\nU\nand\nV\nare said to be birationally equivalent if they contain open sets\nU'\nand\nV'\nthat are in biregular correspondence. Classical algebraic geometry studies properties of varieties which are invariant under birational transformations. Difficulties that arise as a result of the presence of singularities are avoided by using birational correspondences instead of biregular ones. The main problem in this area is to find a nonsingular algebraic variety\nU\n, that is birationally equivalent to an irreducible algebraic variety\nV\n, such that the mapping\nf\n:\nU\n→\nV\nf : U  \\rightarrow  V\nf\n:\nU\n→\nV\nis regular but not biregular.\nHironaka gave a general solution of this problem in any dimension in\n1964\nin Resolution of singularities of an algebraic variety over a field of characteristic zero. His work generalised that of\nZariski\nwho had proved the theorem concerning the resolution of singularities on an algebraic variety for dimension not exceeding\n3\n. Jackson writes\n[\n3\n]\n:-\nTaking a strikingly original approach, Hironaka created new algebraic tools and adapted existing ones suited to the problem. These tools have proved useful for attacking many other problems quite far removed from the resolution of singularities.\nHironaka talked about his solution in his lecture\nOn resolution of singularities\n(\ncharacteristic zero\n)\nto the International Congress of Mathematicians in Stockholm in\n1962\n.\nIn\n1975\nHironaka returned to Japan where he was appointed a professor in the Research Institute for Mathematical Sciences of Kyoto University. He gave a course on the theory of several complex variables in\n1977\nand his lecture notes were written up and published in the book Introduction to analytic spaces\n(\nJapanese\n)\n. Ikuo Kimura writes:-\nSome fundamental theorems in the theory of several complex variables and of the geometry of complex manifolds are proved in a simple but rigorous form. ... Throughout this book one recognizes again the importance of the preparation theorem, and one finds good introductions to the study of the advanced theory of Stein spaces, the works of A Douady, and the theory of the resolution of singularities, to which Hironaka has contributed deeply.\nHironaka was Director of the Research Institute in Kyoto from\n1983\nto\n1985\n, retiring in\n1991\nwhen he was made Professor Emeritus. However, in\n1996\nhe became president of Yamaguchi University, being inaugurated on\n16\nMay. He held this position until\n2002\n. He then became Academic Director of the University of Creation, a private university in Takasaki, Gunma, Japan.\nWe should also mention two educational projects which Hironaka has established\n(\nsee\n[\n4\n]\nfor details\n)\n. Jackson writes\n[\n3\n]\n:-\nHironaka has contributed much time and effort to encouraging young people interested in mathematics. In\n1980\n, he started a summer seminar for Japanese high school students and later added one for Japanese and American college students; the seminars ran for more than two decades under his direction and continue to this day. To support the seminars he established a philanthropic foundation in\n1984\ncalled the Japan Association for Mathematical Sciences. The association also provides fellowships for Japanese students to pursue doctoral studies abroad.\nAmong the many honours he has received, in addition to the\nFields\nMedal, we mention the\nJapan Academy\nAward in\n1970\nand the Order of Culture from Japan in\n1975\n. He has been elected to the\nJapan Academy\n, the\nAmerican Academy of Arts and Sciences\nand academies in France, Russia, Korea and Spain.\nOn\n4\n-\n5\nMay\n2009\nthe Clay Mathematics Institute held its\n2009\nClay Research Conference in Harvard Science Center. Hironaka was invited to give one of the featured lectures on recent research advances and he spoke on\nResolution of Singularities in Algebraic Geometry\n. The abstract for his talk reads:-\nI will present my way of proving resolution of singularities of an algebraic variety of any dimension over a field of any characteristic. There are some points of general interest, I hope, technically and conceptually more than just the end result. The resolution problem for all arithmetic varieties\n(\nmeaning algebraic schemes of finite type over the ring of integers\n)\nis reduced to the question of how to extend the result from modulo\np\nm\np^{m}\np\nm\nto modulo\np\nm\n+\n1\np^{m+1}\np\nm\n+\n1\nafter a resolution of singularities over\nQ\n\\mathbb{Q}\nQ\n. I want to discuss certain problems which arise in this approach."
}