{
  "nome_completo": "Helmut Wielandt",
  "nome_curto": "Helmut Wielandt",
  "ano_nascimento": "1910",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wielandt/",
  "lugar_nascimento": "Niedereggenen, Lörrach, Germany",
  "lugar_morte": "Schliersee, Bavaria, Germany",
  "biografia": "Helmut Wielandt\nentered the University of Berlin in\n1929\nand there he studied mathematics, physics and philosophy. There he was greatly influenced by\nSchmidt\nand\nSchur\n. In his speech accepting membership of the\nHeidelberg Academy of Sciences\nin\n1960\nhe said:-\nIt is to one of Schur's seminars that I owe the stimulus to work with\npermutation groups\n, my first research area. At that time the theory had nearly died out. It had developed last century, but at about the turn of the century had been so completely superseded by the more generally applicable theory of abstract\ngroups\nthat by\n1930\neven important results were practically forgotten - to my mind unjustly.\nIt was on the topic of permutation groups that Wielandt wrote his doctoral dissertation and he was awarded a doctorate in\n1935\n. From\n1934\nuntil\n1938\nhe worked on the editorial staff of\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nin Berlin. From\n1938\nhe was an assistant at Tübingen where he submitted his\nhabilitation\nthesis in\n1939\n. Wielandt described the contents of his habilitation thesis in the following way:-\nThe work on permutation groups led me inevitably to involvement with the structure theory of finite groups. In the twenties this theory had fallen into neglect ... But\nPhilip Hall\n's fundamental papers had already revitalised it. Where\nHall\nhad started from arithmetical questions and product decompositions, my own work was triggered by a question of Robert Remak of a quite different type: is the group generated by two subgroups that occur in composition series always of the same kind? In my Habilitationsschrift I expanded the discovery that this question can be answered affirmatively to a detailed study of the normal structure of finite groups.\nAlthough Wielandt was formally on the staff at Tübingen until\n1946\n, during World War II he was on leave for military service. He underwent basic training in\n1939\nand artillery training in\n1940\n. Then from\n1941\nhe was engaged in research on meteorology, cryptology and aerodynamics. Then in\n1942\nhe was attached to the Kaiser Wilhelm Institute and the Aerodynamics Research Institute at Göttingen. Describing this work Wielandt said:-\n... I had to work on vibration problems. I am indebted to that time for valuable discoveries: on the one hand the applicability of abstract tools to the solution of concrete problems, on the other hand, the - for a pure mathematician - unexpected difficulty and unaccustomed responsibility of numerical evaluation. It was a matter of estimating\neigenvalues\nof non-self-adjoint\ndifferential equations\nand\nmatrices\n.\nAt the end of World War II Wielandt was appointed associate professor at the University of Mainz. He remained there until\n1951\nwhen he was appointed Ordinary Professor at the University of Tübingen. He remained at Tübingen until he retired in\n1977\nbut during this time he spent two periods at the University of Wisconsin, Madison, one in\n1963\nand the second from\n1965\nto\n1967\n. He also held a number of visiting positions in the United States, at the University of Warwick, England and at the University of Brazil.\nFor\n20\nyears beginning in\n1952\nWielandt was managing editor of\nMathematische Zeitschrift\n.\nWielandt's research work continued on finite groups and on permutation groups. One of the areas which his work took him into was infinite permutation groups. He contributed greatly to linear algebra and matrix theory. Among his contributions was a shorter, elegant proof of the\nPerron\n-\nFrobenius\nTheorem.\nWielandt believed that the axiomatic method had produced major advances:-\nBy turning increasingly towards the abstract, revolutionary unification has been achieved in mathematics. It is as if some areas of mathematics which earlier could hardly be reached on foot are now connected by motorways.\nHowever he was convinced, from his student days onwards, that the axiomatic method had limitations and carried his research forward on with this belief:-\n... I could not share the general opinion that this would henceforth be the only rewarding direction for research. It seemed to me that, like all great deductive systems, it was threatened by the danger that the problems which it could not properly accommodate would be dismissed as uninteresting, whereas on the contrary, these ought to provide a stimulus to broaden the foundation."
}