{
  "nome_completo": "Hendrik Douwe Kloosterman",
  "nome_curto": "Hendrik Kloosterman",
  "ano_nascimento": "1900",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kloosterman/",
  "lugar_nascimento": "Rottevalle, The Netherlands",
  "lugar_morte": "Leiden, The Netherlands",
  "biografia": "Hendrik Kloosterman\nwas the son of Bindert Hendriks Kloosterman\n(1857\n-\n1935)\n, a structural engineer, and Marijke Durks van der Molen\n(1861\n-\n1936)\n. Bindert and Marijke were married at Achtkarspelen on\n1\nJuly\n1899\n. For Marijke it was her second marriage since she had married Pieter Johannes Boetes at Achtkarspelen on\n30\nMay\n1891\n. Pieter Boetes, a farmer and merchant, was\n69\nyears old when he married the\n29\nyear old Marijke. They had a daughter Ebeltje Pieters Boetes born on\n13\nJuly\n1891\n. Pieter Boetes had died in Rottevalle on\n1\nMay\n1897\n. In addition to his elder half-sister Ebeltje, Hendrik had a younger brother Durk Kloosterman.\nHendrik was brought up as a young boy in the village of Rottevalle which is a small farming village. Although he began his schooling in Rottevalle, he completed his studies at a high school in The Hague.\nAfter graduating from the high school in\n1918\n, Kloosterman entered the University of Leiden. Here he studied mathematics and graduated with a bachelor's degree in\n1919\n, after only one year of study, and a Master's degree in\n1922\n. The education he received in the mathematics department was a good one, his lecturers being J C Kluyver and W van der Woude, but the department did not have stars of the quality that worked in Leiden on mathematical physics.\nHendrik Lorentz\n, although officially retired from\n1912\n, continued to lecture at Leiden and his successor\nPaul Ehrenfest\nwas an outstanding theoretical physicist whose friends\nNiels Bohr\nand\nAlbert Einstein\nwere frequent visitors to Leiden. Of Kloosterman's mathematics lecturers, Kluyver and van der Woude, it was mainly the former that had a strong influence on the young student.\nKloosterman continued his studies at Leiden with J C Kluyver as the supervisor of his number theory thesis. Kluyver, who originally undertook research on geometry, had, after his appointment in\n1892\nas Professor of Mathematical Analysis at Leiden, changed his research efforts to this field, and in a relatively short time brought analysis teaching to a level that had not previously been reached in the Netherlands. We are now accustomed to analysis being presented according to very rigorous rules, but before Kluyver's time, analysis in the Netherlands was still almost at the level of the\n18\nth century. After Kloosterman arrived in Leiden, rigorous analysis had been established there, and in a short time he proved himself a true master in this field.\nIt was\nEhrenfest\n, however, who looked after Kloosterman as he would his own students, making sure that he had the opportunity to study with the experts on the subject of his thesis.\nEhrenfest\narranged for Kloosterman to spend some time in Copenhagen working with\nHarald Bohr\n,\nNiels Bohr\n's brother.\nThe topic which Kloosterman was working on for his doctorate was concerned with\nWaring\ntype problems. Kloosterman was examining the number of solutions in integers\nx\ni\nx_{i}\nx\ni\n​\n, to the equation\nm\n=\na\n1\nx\n1\n2\n+\na\n2\nx\n2\n2\n+\n.\n.\n.\n+\na\ns\nx\ns\n2\nm = a_{1}x_{1}^{2} + a_{2}x_{2}^{2}+ ... + a_{s}x_{s}^{2}\nm\n=\na\n1\n​\nx\n1\n2\n​\n+\na\n2\n​\nx\n2\n2\n​\n+\n.\n.\n.\n+\na\ns\n​\nx\ns\n2\n​\n(\n*\n)\nThe method which Kloosterman was using was based on one due to\nLittlewood\nand\nHardy\nso the most natural person to advise Kloosterman was\nG H Hardy\n. Again it was due to\nEhrenfest\nthat Kloosterman was able to visit\nHardy\nin Oxford.\nKloosterman presented his doctoral thesis to the University of Leiden in\n1924\n. He had managed to find, provided\ns\n≥\n5\ns ≥ 5\ns\n≥\n5\nand the\na\nn\na_{n}\na\nn\n​\nsatisfy suitable congruence conditions, an asymptotic formula for the number of solution to the equation\n(\n*\n)\n. Under these conditions\n(1)\nalways has a solution for large values of m. However for\ns\n=\n4\ns = 4\ns\n=\n4\nhis application of the\nLittlewood\n-\nHardy\nmethod failed and Kloosterman noted in his thesis that it is rather strange that this powerful technique fails to show\nLagrange\n's result that every positive integer is the sum of four squares.\nThe case when\ns\n=\n4\ns = 4\ns\n=\n4\nwhich Kloosterman had failed to solve in his thesis gave him the challenge which he attacked once his PhD had been awarded. His solution of this case appeared in his paper\nOn the representation of numbers in the form\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\nax^{2} + by^{2} + cz^{2} + dt^{2}\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\nwhich was published in\nActa Mathematica\nin\n1926\n. He writes:-\nIn the present paper some special cases of the quadratic form\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\nax^{2} + by^{2} + cz^{2} + dt^{2}\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\nwill be treated by\n[\nHardy\n's method based on a theorem from the theory of modular functions, following a method which is in principle due to\nMordell\n]\n. For the sake of simplicity we confine ourselves to the form\nx\n2\n+\ny\n2\n+\nc\nz\n2\n+\nc\nt\n2\nx^{2} + y^{2} + cz^{2} + ct^{2}\nx\n2\n+\ny\n2\n+\nc\nz\n2\n+\nc\nt\n2\n.\nWe shall prove what we shall call \"exact formulae\" for the number of representations\n(\nas opposed to \"asymptotic formulae\"\n)\nfor\nc\n=\n3\n,\n5\n,\n6\n,\n7\nc = 3, 5, 6, 7\nc\n=\n3\n,\n5\n,\n6\n,\n7\n, but the method used is also applicable for\nc\n=\n1\n,\n2\n,\n4\n,\n8\n,\n16\nc = 1, 2, 4, 8, 16\nc\n=\n1\n,\n2\n,\n4\n,\n8\n,\n1\n6\nas well as in a great many other special cases of the form\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\nax^{2} + by^{2} + cz^{2} + dt^{2}\na\nx\n2\n+\nb\ny\n2\n+\nc\nz\n2\n+\nd\nt\n2\n.\nIn this paper Kloosterman introduced what are today called 'Kloosterman sums'. These have proved important in many areas of number theory.\nAfter receiving his doctorate, Kloosterman was required to undertake military service which he did during\n1924\n-\n25\n. It was not a wasted year mathematically for he continued to undertake research whenever military duties allowed. The award of a Rockefeller Scholarship allowed him to spend\n1926\n-\n27\nat the University of Göttingen and\n1927\n-\n28\nat the University of Hamburg. During his visit to Hamburg, Kloosterman applied his idea of 'Kloosterman sums' to obtain estimates for the\nFourier\ncoefficients of modular forms. It was the Göttingen visit, however, which was most significant in his personal life for there he met Margarete Hilda Träger. Margarete had been born in Grosskromsdork to Friedrich Karl Träger and Auguste Karoline Winkler. Hendrik and Margarete Kloosterman were married on\n30\nAugust\n1932\nin Leiden; they had no children.\nAfter this two years of travel, Kloosterman was offered a post at the University of Münster. He accepted this position and remained there for two years before returning to the University of Leiden in\n1930\nto a position equivalent to that of associate professor. Springer writes in\n[\n7\n]\n:-\nThis was mainly a teaching position. Kloosterman turned out to be an exceptional teacher. He was able to expose with great clarity and great economy the essentials of a piece of mathematics, be it elementary or advanced.\nIn fact he taught the first and second year calculus courses for students studying mathematics, physics, astronomy, chemistry, and geology. This was all that he was required to teach but he went further by volunteering to give a different advanced course each year. Among these were courses on\n[\n5\n]\n:-\n... the theory of groups, on analytic and algebraic number theory, ideal theory, Galois theory, on quadratic forms, on linear operators in\nHilbert\nspace, and on mathematical tools in quantum theory.\nIn\n1941\nthe University of Leiden closed during the German occupation of The Netherlands. This in fact presented an opportunity to Kloosterman to undertake research since he had no teaching duties. The university remained closed unto\n1945\nand the outcome of this period was two major publications on the irreducible representations of finite groups.\nThe group he studied was the special linear group of\n2\nby\n2\nmatrices over the ring of integers modulo\np\nn\np^{n}\np\nn\n.\nSchur\nhad solved the problem for the case\nn\n=\n1\nn = 1\nn\n=\n1\n, where the matrices are over a prime field, and the case of\nn\n=\n2\nn = 2\nn\n=\n2\nhad been solved in the\n1930\ns. Kloosterman solved the general case in two papers\nThe behaviour of general theta functions under the modular group and the characters of binary modular congruence groups\nwhich occupy\n130\npages of the\nAnnals of Mathematics\nin\n1946\n.\nWhen the University of Leiden reopened in the middle of\n1945\n, Kloosterman continued to teach an advanced course each year. He taught courses on representation theory, lattice theory, measure theory, modular functions, elliptic functions and on algebraic function fields. Murre attended these courses and tells us in\n[\n5\n]\nthat these:-\n... were exciting lectures and modern for that period. They were carefully planned and prepared, masterly presented, starting elementarily but advancing steadily to a high level. Kloosterman was convinced of the unity of mathematics and in his lectures he stressed the connections between different areas. To the audience a beautiful panorama unfolded, completely natural and harmonic. In fact, to attend a lecture of Kloosterman, elementary or advanced, was always a pleasure, both for mathematicians and non-mathematicians. Those of us present there will remember his very clear style, his skilful use of the blackboard\n(\nalways filled at, but never before, the end of the lecture\n)\n, his fine sense of humour and certainly also his choice of a 'completely arbitrary' number, which invariably was\n37\n.\nHe was promoted to professor at the University of Leiden in\n1947\n, a post he retained until his death. He gave his inaugural lecture on\n3\nMay\n1947\nwith the title\nValue and valuation of mathematics\n(\nDutch\n)\n. The lecture was reprinted in\n1984\nand\nDirk Struik\nreviewed the reprint writing:-\nDifferent definitions of mathematics are discussed\n(\nChapman\n,\nKempe\n,\nBôcher\n,\nC S Peirce\n,\nSchröder\n)\nand found to express the nature of mathematics in an oversimplified manner. Mathematics has not only a logical, axiomatic and deductive element, but also an aesthetic and intuitive one.\n(\nL Kronecker\nclaimed that mathematicians are poets who also provide proofs for their poems. Nor should intuition and economy of thought be forgotten. And Schopenhauer was wrong when he said, \"Where counting begins, understanding stops'', as if mathematics were counting\n(\nRechnen\n)\n. Schopenhauer also criticized\nEuclid\n's method without understanding it. The author then deals with certain objections by Goethe and Lenard, and points out that even the most abstract mathematical structures may find or already have their applications: mathematics never breaks every connection with reality.\nKloosterman did outstanding work building up the Leiden Mathematical Institute and also in expanding mathematics at Leiden by being able to set up several new chairs in pure and applied mathematics.\nHe attended the International Congress of Mathematicians held in Cambridge, Massachusetts in\n1950\nand delivered the lecture\nThe characters of binary modulary congruence groups\nwhich was published in the Proceedings of the Congress.\nRobert Rankin\nwrites in a review:-\nIn two earlier papers the author has considered the problem of determining the characters and representations of the binary modulary congruence groups modulo N by deriving the transformation formulae under modular substitutions of certain multiple theta series. By using binary theta series only he succeeded in determining explicitly the greater part of the characters and irreducible representations and conjectured that the remaining irreducible representations might be determined by considering ternary or higher theta series. ... The author has now discovered that the remaining irreducible representations can be found ... Detailed proofs are to appear elsewhere.\nIn\n1954\nthe International Congress of Mathematicians was held in Amsterdam and Kloosterman was chairman of a small committee with the task to draw up a report on structure and regulations of the Congress. See\nTHIS LINK\n.\nIn the\n1955\n-\n1956\nacademic year, he was in the United States as a visiting professor at the University of Michigan at Ann Arbor, and also spent some time at the University of Notre Dame.\nIn\n[\n7\n]\n, as well as looking at Kloosterman's contributions, Springer looks at further developments of his techniques. He writes:-\nAlthough he was not a prolific writer, his work had a significant impact and is still of considerable interest.\nIn\n[\n5\n]\nMurre quotes P Sarnak on the influence of Kloosterman's work:-\nI am happy to comment on Kloosterman and his influence on modern number theory. His paper in the twenties on quaternary quadratic forms is one of the most influential in analytic number theory. He introduces a refinement of the\nHardy\n-\nLittlewood\ncircle method which has been at the heart of much modern work\n(\nLinnik\n,\nSelberg\n, Iwaniec, Hooley, et cetera\n)\n. It is such an important refinement that some even refer to the circle method as the\nHardy\n-\nLittlewood\n-Kloosterman method. This refinement led him to the Kloosterman sums. Besides introducing these basic objects\n(\nthey are the '\nBessel\nfunctions' of finite fields\n)\nhe derived their basic properties. It was left to\nHasse\nand\nWeil\nto give the well known and deep estimate for these sums. Kloosterman sums find their applications in many proofs of results in automorphic forms, L-functions, quadratic forms ... . He has certainly left his mark on modern number theory\n(\narithmetical and analytic\n)\n.\nIn\n[\n4\n]\nN G de Bruijn\nwrites:-\nKloosterman was a profound mathematician who stood in two worlds. Due to the influence of Kluyver,\nHarald Bohr\nand\nHardy\n, he had become a master of classical \"hard\" analysis. He mastered these, usually difficult, analytical techniques in complete perfection. He was able to perform long and difficult calculations with great patience and incomprehensible accuracy without for a moment losing sight of the goal that had been set. But precisely because his technique was so strong, one must admire the fact that he did not succumbed to the temptation to rest on the laurels that can be obtained with it. In Göttingen and Hamburg he came into contact with modern algebra, which, together with set theory and topology, was to permeate the whole of mathematics. He then set himself the goal of helping to promote its influence. It is in these areas, more than in analytical machinery, that his influence on Dutch mathematical life was strongest. His influence on others was, apart from his profundity and versatility, due to the gift he had to convey his thoughts in word and writing. He also liked it. For example, he was never bored with teaching the first-year students the principles of differentiation and integration. In his lecturing technique, he was strict and yet clear, not a word too many or too few, complete but never boring. Short, dry, humorous remarks occasionally created relaxation. His listeners were at the same time spectators, because he managed to clearly display the entire content of an hour's lecture on one board without ever wiping it out.\nLet us mention two honours given to Kloosterman. He was elected as a member of the\nKoninklijke Nederlandse Akademie van Wetenschappen\n(\nRoyal Dutch Academy of Sciences\n)\nin\n1950\n. In\n1986\nthe Department of Mathematics at the University of Leiden founded the Kloosterman Chair. Every year, beginning in\n1986\n, a distinguished mathematician is appointed as a visiting professor at the Leiden Mathematical Institute. It is usually a two month appointment. The first holder of the Kloosterman Chair was\nMichael Artin\nand the article\n[\n5\n]\nis a slightly modified version of a lecture delivered by J P Murre on\n7\nMay\n1986\nto mark\nMichael Artin\n's visit to Leiden as the first Kloosterman Professor."
}