{
  "nome_completo": "Hendrik Antoon Lorentz",
  "nome_curto": "Hendrik Lorentz",
  "ano_nascimento": "1853",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorentz/",
  "lugar_nascimento": "Arnhem, Netherlands",
  "lugar_morte": "Haarlem, Netherlands",
  "biografia": "Hendrik Lorentz\nattended Mr Timmer's Primary School in Arnhem until he was\n13\nyears of age when he entered the new High School there. He entered the University of Leiden in\n1870\nbut, in\n1872\n, he returned to Arnhem to take up teaching evening classes. He worked for his doctorate while holding the teaching post.\nLorentz refined\nMaxwell\n's electromagnetic theory in his doctoral thesis\nThe theory of the reflection and\nrefraction\nof light\npresented in\n1875\n. He was appointed professor of mathematical physics at Leiden University in\n1878\n. He remained in this post until he retired in\n1912\nwhen\nEhrenfest\nwas appointed to his chair. After retiring from this chair, Lorentz was appointed director of research at the Teyler Institute, Haarlem. However, he retained an honorary position at Leiden, where he continued to lecture.\nBefore the existence of electrons was proved, Lorentz proposed that light waves were due to oscillations of an electric charge in the atom. Lorentz developed his mathematical theory of the electron for which he received the Nobel Prize in\n1902\n. The Nobel prize was awarded jointly to Lorentz and Pieter Zeeman, a student of Lorentz. Zeeman had verified experimentally Lorentz's theoretical work on atomic structure, demonstrating the effect of a strong magnetic field on the oscillations by measuring the change in the wavelength of the light produced.\nLorentz is also famed for his work on the\nFitzGerald\n-Lorentz contraction, which is a contraction in the length of an object at relativistic speeds. Lorentz transformations, which he introduced in\n1904\n, form the basis of\nEinstein\n's special theory of relativity. They describe the increase of mass, the shortening of length, and the time dilation of a body moving at speeds close to the velocity of light.\nLorentz was chairman of the first Solvay Conference held in Brussels in the autumn of\n1911\n. This conference looked at the problems of having two approaches, namely that of classical physics and of\nquantum theory\n. However Lorentz never fully accepted quantum theory and always hoped that it would be possible to incorporate it back into the classical approach. He said in his presidential address at the opening ceremony of the conference:-\nIn this stage of affairs there appeared to us like a wonderful ray of light the beautiful hypothesis of energy elements which was first expounded by\nPlanck\nand then extended by\nEinstein\nand Nernst, and others to many phenomena. It has opened for us unexpected vistas, even those, who consider it with a certain suspicion, must admit its importance and fruitfulness.\nSome of Lorentz's numerous publications are highlighted in\n[\n3\n]\n:-\nIn an early memoir, which became famous, Lorentz applied for the first time considerations relating to discrete molecules to electric propagation in material bodies, and incidentally arrived at a rational reflection-equivalent for each substance independent of its density. In\n1884\nhe began to study the effect which magnetization exerts on the polarization of reflected light. His \"Théorie Electromagnétique de Maxwell et son application auz Corps Mouvants\"\nⓉ\n(\nThe electromagnetic theory of Maxwell and its application to moving bodies\n)\nand his \"Versuch einer Theorie der Elektrischen und Optischen Erscheinungen in bewegten Körpern\"\nⓉ\n(\nTowards of a theory of electrical and optical phenomena in moving bodies\n)\nwere published in\n1892\nand\n1895\nrespectively. They embodied the first systematic appearance of the electrodynamic principle of relativity, and in\n1920\nhe brought out \"The Einstein Theory of Relativity: A Concise Statement\". In\n1909\nhe published his \"Theory of Electrons\", based on a series of lectures at Columbia University, and in\n1916\nhe published in French at Leipzig an account of statistical thermodynamic theories, based on lectures delivered at the Collège de France in\n1912\n. An edition of his University lectures, entitled \"Lessons on Theoretical Physics\", began to appear, under his supervision, in\n1919\n. He was also the author of a textbook of the differential and integral calculus; \"Visible and Invisible Movements\",\n1901\n; and \"Clerk Maxwell's Electromagnetic Theory\",\n1924\n.\nIn\n[\n7\n]\nO W Richardson describes Lorentz as:-\n... a man of remarkable intellectual powers ... . Although steeped in his own investigation of the moment, he always seemed to have in his immediate grasp its ramifications into every corner of the universe. ... The singular clearness of his writings provides a striking reflection of his wonderful powers in this respect. .... He possessed and successfully employed the mental vivacity which is necessary to follow the interplay of discussion, the insight which is required to extract those statements which illuminate the real difficulties, and the wisdom to lead the discussion among fruitful channels, and he did this so skilfully that the process was hardly perceptible.\nLorentz received a great many honours for his outstanding work. He was elected a Fellow of the\nRoyal Society\nin\n1905\n. The Society awarded him their Rumford Medal in\n1908\nand their Copley Medal in\n1918\n.\nThe respect in which Lorentz was held in The Netherlands is seen in Richardson's description of his funeral\n[\n7\n]\n:-\nThe funeral took place at Haarlem at noon on Friday,\n10\nFebruary. At the stroke of twelve the State telegraph and telephone services of Holland were suspended for three minutes as a revered tribute to the greatest man Holland has produced in our time. It was attended by many colleagues and distinguished physicists from foreign countries. The President, Sir Ernest Rutherford, represented the\nRoyal Society\nand made an appreciative oration by the graveside."
}