{
  "nome_completo": "Henry Savile",
  "nome_curto": "Henry Savile",
  "ano_nascimento": "1549",
  "ano_morte": "1622",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Savile/",
  "lugar_nascimento": "Bradley (near Halifax), Yorkshire, England",
  "lugar_morte": "Eton, Berkshire, England",
  "biografia": "Henry Savile\nentered Brasenose College Oxford in\n1561\nand he was elected a Fellow of Merton College Oxford in\n1565\n. He graduated with an B.A. in\n1566\nand an M.A. in\n1570\n.\nOn\n10\nOctober\n1570\nhe began to lecture at Oxford on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nand we are fortunate in that his lecture notes for this course have survived. We shall now describe the content of these lectures more fully.\nThe lectures are far more than\nPtolemy\n's text with added explanation. Savile introduced his students to the new ideas of\nRegiomontanus\nand\nCopernicus\n. He mentions both classical authors of mathematics, giving their biographies, and the leading mathematicians of the day whose works he had clearly studied. In the introduction to the lectures Savile gives his views on why students should study mathematics. The study of mathematics, argues Savile, turns a student into an educated, civilised human being. As an example he quotes the classical story of Aristippus who, on being shipwrecked on Rhodes, realised that the inhabitants were civilised when he saw a mathematical figure drawn in the sand. It is worth noting, however, that twenty years later, when Savile was trying to make sure his subject received proper funding, he argued for mathematics because of its practical uses.\nIt is interesting to read Savile's comments in these lectures on why he felt that mathematics at that time was not flourishing. Students did not understand the importance of the subject, Savile wrote, there were no teachers to explain the difficult points, the texts written by the leading mathematicians of the day were not studied, and no overall approach to the teaching of mathematics had been formulated. Of course, as we shall see below, fifty years later Savile tried to rectify these shortcomings by setting up two chairs at the University of Oxford.\nIn\n1578\nSavile set out on a major European tour. First he visited France, and he also visited Wrocław and Rome and, in addition, many other places on his travels between these cities. He met and exchanged ideas with the leading European mathematicians of the time. On his return to Oxford in\n1582\nhe became a Greek tutor to Queen Elizabeth. In\n1585\nhe became Warden of Merton and, in addition, he became Provost of Eton in\n1596\n[\n4\n]\n:-\nHe continued to hold the Wardenship of Merton while residing at Eton, and governed both with uncompromising strictness, not to say arrogance; this, and his constant absence from Merton, made him rather unpopular amongst the Fellows.\nIn\n1592\nQueen Elizabeth I visited the University of Oxford and Savile was much occupied in making sure that the University impressed her so that it would continue to receive financial support. In fact, as well as giving a speech of welcome, he summed up a debate which Queen Elizabeth attended. In his summing up he defended the usefulness of mathematics saying that it has important applications to setting the calendar\n(\nquoting\nPlato\nas his authority\n)\n, and was vital in military affairs\n(\nthis time using the example of\nArchimedes\nto make his point\n)\n.\nHowever Savile is most famous for founding two chairs at Oxford in\n1619\n. Savile said that he established the Chairs to remedy the fact that:-\n... geometry is almost totally unknown and abandoned in England.\nIn his life of Savile Aubrey says:-\nBishop Ward, of Salisbury, has told me that he first sent for Mr\nGunter\n, from London,\n(\nbeing of Oxford University\n)\nto have been his professor of Geometry: so he came and brought with him his sector and quadrant, and fell to resolving of triangles and doing a great many fine things. Said the grave knight, 'Do you call this reading of Geometry? This is showing of tricks, man!' and so dismissed him with scorn, and sent for\nBriggs\nfrom Cambridge.\nSavile gave the first geometry lecture himself to a large number of students with the first holders of the chairs in his audience, and again we shall spend a moment looking at its contents. This lecture was designed to be an introduction to the first book of\nEuclid\n's\nElements\n. It digressed into other areas, however, such as how mathematics should be taught. It also contained what Savile saw as his own contributions to the subject, the most important of which he considered was his demonstration that\nEuclid\n, the author of the\nElements\n, was distinct from\nEuclid of Megara\n. This indeed is an important contribution to the history of mathematics.\nThe Savilian chair of Geometry was first occupied by\nBriggs\nand Savile ended his lecture with the words\n(\nsee for example\n[\n4\n]\n)\n:-\nI hand on the lamp to my successor, a most learned man, who will lead you to the innermost mysteries of geometry.\nMany famous mathematicians have held this chair; you can see the list of those who have occupied the\nTHIS LINK\n. The second chair was the Savilian Chair of Astronomy, first occupied by John Bainbridge. One of the most famous people to be appointed to this chair was\nChristopher Wren\nin\n1661\n. A list of the occupants of this chair is also at\nTHIS LINK\n.\nSavile did not found these chairs so that those appointed could follow their own ideas. Far from it. He laid down very precise conditions on how the subjects were to be taught and required the professors to undertake research in their disciplines. The professor of geometry was required to teach the whole of\nEuclid\n's\nElements\n,\nApollonius\n's\nConics\nand the complete works of\nArchimedes\nhaving first provided all the necessary mathematical background for an understanding of the texts. His course notes had to be deposited in the University Library. He was also required to show the practical applications of mathematics, teach arithmetic, mechanics and the theory of music. Perhaps more unusual, especially to those thinking in terms of mathematics taught in universities today, was the requirement that field work was to be undertaken in the country when the weather allowed such activities, and the students would there study practical geometry.\nThe professor of astronomy had to meet similar requirements, but in this case the text was to be\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nbut full details of the newer theories had also to be presented such as those of\nJabir ibn Aflah\nin his\nCorrection of the Almagest\nand\nCopernicus\n's\nheliocentric\npoint of view. Other requirements for the astronomy professor was to teach spherics, calculation with\nsexagesimal\nnumbers, optics, geography and navigation. Although this sounds a very classical course, this was not the attitude that Savile took. In fact he required the professor of astronomy to carry out research and, although this may not sound unusual by today's standards, at that time many professors did no more than teach. The professor had to make his own instruments and carry out his own observations with them which, like the lecture notes, had to be deposited in the library. These conditions were given to ensure that astronomy was be a subject that would develop and not be simply that fixed by the classical writers. One final, but very strongly put, condition was that the teaching of astrology in any shape or form was banned.\nAubrey\n[\n1\n]\ndescribed Savile's appearance with these words:-\nHe was an extraordinarily handsome man; no lady had a finer complexion.\nOutside the area of mathematics Savile is best known for his contributions to the preparation of the King James Version of the Bible."
}