{
  "nome_completo": "Henry Gellibrand",
  "nome_curto": "Henry Gellibrand",
  "ano_nascimento": "1597",
  "ano_morte": "1637",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gellibrand/",
  "lugar_nascimento": "Aldersgate, London, England",
  "lugar_morte": "London, England",
  "biografia": "Henry Gellibrand\n's father was also named Henry Gellibrand. Henry Gellibrand senior was a fellow of All Souls College, Oxford, and Henry, the subject of this biography, was his eldest son. He entered Trinity College, Oxford on\n22\nMarch\n1616\n, in the year after his father died, and at Trinity he was introduced to mathematics by\nSavile\n. He received a B.A. from Trinity College in\n1619\nand an M.A. in\n1623\n. He became a friend of\nBriggs\nwhile in Oxford.\nHe entered the church becoming a curate in Chiddingstone, Kent, a couple of years after receiving his M.A. from Oxford. Gellibrand succeeded\nGunter\nto the chair of astronomy in Gresham College, London in\n1627\n. It was largely through the influence of\nBriggs\nthat he received this chair. However he was involved in a religious controversy which led to a court case\n[\n2\n]\n:-\nGellibrand held puritan meetings in his rooms, and encouraged his servant, William Beale, to publish an almanac for\n1631\n, in which the Catholic saints were superseded by those in Foxe's book of martyrs. Laud, then bishop of London, brought them both into the high commission court. They were acquitted on the ground that similar almanacs had been printed before, and this prosecution was used against Laud at his own trial in\n1643\n.\nGellibrand's most famous scientific discovery was the change over the years in\nmagnetic declination\n. He achieved this by comparing measurement he took in Deptford with similar ones taken by\nGunter\ntwelve years earlier. Gellibrand published his findings in\nA discourse mathematical of the variation of the magneticall needle together with its admirable diminution lately discovered\n(1635)\n.\nHe also made mathematical contributions to navigation, in particular working on methods to determine longitude. His methods were based on observing various celestial events and in particular he arranged with Captain Thomas James that they would simultaneously observe the eclipse of the moon on\n29\nOctober\n1831\n. James was the leader of an expedition to try to find the north-west passage and at the time of the eclipse was on Charlton Island in James Bay, Canada. Gellibrand, on the other hand, was observing in Gresham College. The time difference allowed Gellibrand to compute the difference in longitude between the two points of observation and he published the results in\nAppendix concerning Longitude\n(1633)\n. Gellibrand also published logarithm and trigonometrical tables. After his friend\nBriggs\ndied in\n1630\n, he worked to complete\nBriggs\n's\nTrigonometria Britannica\nwhich he did, publishing the work in\n1633\n.\nAlthough only\n39\nyears of age, Gellibrand retired in\n1836\nto Mayfield in Sussex. He died of a fever at age\n39\nbut several of his publications were published after he died.\nInstitution Trigonometrical\n(1638)\n, with an expanded version in\n1658\n, applied trigonometry to navigation and astronomy.\nEpitome of Navigation\nfirst appeared\n62\nyears after his death; a rather remarkable length of time. It was his most popular work."
}