{
  "nome_completo": "Herbert William Richmond",
  "nome_curto": "Herbert Richmond",
  "ano_nascimento": "1863",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Richmond/",
  "lugar_nascimento": "Tottenham, Middlesex, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Herbert Richmond\n's father was William Hall Richmond\n(\nborn Sedgefield, Durham about\n1832)\nwho was a chaplain at Draper's College, Tottenham and a schoolmaster. His mother was Charlotte Mary Richmond\n(\nborn Ewell, Surrey about\n1836)\n. Herbert William Richmond had younger siblings, George\n(\nborn about\n1865)\n, Margaret\n(\nborn about\n1867)\n, Ethel\n(\nborn about\n1869)\nand Alfred\n(\nborn about\n1872)\n.\nHerbert entered Merchant Taylors' School in London in\n1875\nand studied there until he graduated in\n1882\n. In the same year he entered King's College, Cambridge, to read mathematics. He went to Cambridge as a Barnes Scholar having won both an open Eton Scholarship and a scholarship from his own school.\nAt King's College, Richmond was coached by the famous coach Dr\nRouth\n. He was highly successful, and he was Third\nWrangler\n, meaning he was ranked third among the First Class students in the Mathematical Tripos examinations\n(\nLove\nwas one place above him\n)\n. He graduated with a BA in\n1885\n. However the rigours of the Tripos had taken its toll. According to Richmond the intense work needed to succeed at Cambridge made him turn away from mathematics after his graduation and he took up music for a while. However his love for mathematics soon returned and, after writing a dissertation on\nalgebraic geometry\n, he was awarded a Fellowship to King's College, Cambridge, in\n1888\n.\nRichmond was a college lecturer from\n1891\nto\n1927\nand, in addition, a university lecturer from\n1901\nuntil he retired in\n1923\n. His main work was in algebraic geometry. Writing in February\n1946\nhe set the scene for his research work in the following, rather delightful, way:-\nIn\n1885\nCayley\nand\nSalmon\nhad carried forward the investigations of the earlier German geometers,\nHesse\n,\nSteiner\n,\nPlücker\nand other; and\nSalmon\nhad expounded the subject in treatises which for clarity of style are still unrivalled. Further, the Italians,\nCorrado Segre\nand\nCastelnuovo\nwere opening the way into a vast unexplored field, geometry of more than three dimensions. Rarely has a branch of science offered more inviting prospects for a novice hoping to undertake research.\nYet I must now admit that my devotion to this one branch of mathematics has been in some degree unfortunate; for time has shown\n(\nwhat might perhaps have been foreseen\n)\nthat the elementary algebraic methods, so effective and so admirable when applied to the simpler curves and surfaces, fail to produce results when applied to loci of higher order. Often, no doubt, no relations of an elementary nature exist, and the search for them is bound to end in disappointment. Nevertheless, methods of elementary algebra may still be employed with success both in geometry proper and in applications such as arithmetical properties of rational functions. It is true that the scope of these methods is restricted, but there is compensation in the fact that when geometry is successful in solving a problem the solution is almost invariably both simple and beautiful.\nThe last sentence explains why so many of my published papers are very short. A result already known is obtained in a simple manner.\nAdmittedly I have spent much time advocating old-fashioned methods which have fallen into undeserved neglect\n(\nin my opinion\n)\n. This does not imply lack of appreciation of modern methods...\nOf course it is always good to look at opinions of researchers other than their own! Here is how Richmond's research is described in\n[\n1\n]\n:-\nRichmond's mathematical researches lay in the field of pure and algebraic geometry, though he also lectured to generations of undergraduates on\ndifferential geometry\n. His papers always showed the characteristics of elegance and apparent effortlessness. His forte lay in seeing the relations between apparently diverse theorems, and he was especially at home in the projective properties of figures in spaces of more than three dimensions, but he did not disdain the consideration of elementary theorems in plane geometry; he would remark a little sadly that his results were remote from the trends of modern geometry.\nRichmond was honoured by being elected a Fellow of the\nRoyal Society\nin\n1911\n. He was an active member of the\nLondon Mathematical Society\nfor many years and served as its President from\n1920\nto\n1922\n. He was also honoured by the University of St Andrews in the award of an honorary degree in\n1923\n.\nSpecial mention should be made of the work Richmond undertook during World War I. He was attached to the Ministry of Munitions and he undertook research into ballistics at the Royal Naval Gunnery School on Whale Island, Portsmouth, with Sir Ralph\nFowler\n. He continued his work on spinning shells after the war ended and published the two volume work\nText book of AA\n(\nanti-aircraft\n)\nGunnery\nin\n1924\n. His work in this area strongly influenced later work on ballistics undertaken during World War II. Unfortunately this work at Portsmouth involved experimental work with explosives which left him partially deaf. In\n1923\nhe resigned from the committees he was serving on since he felt that his deafness prevented him following the business and playing a full role in the work of the committee.\nOutside mathematics his other interests included music, an interest in flowers, birds and flora. He enjoyed trips to the Orkneys and Shetlands to photograph birds which he did with photographs of professional quality. A E\nMilne\n, writing in\n[\n2\n]\n, says:-\nBut shining through his special interests was his genius for friendships with men of all academic generations. He endeared himself to all of them by his utter sincerity and unpretentiousness, his extreme modesty, his engaging humour..., his faithfulness... . He was a lovely person to know.\nSimilar sentiments are recorded in\n[\n1\n]\n:-\nNo bare recital of his achievements and interests can possibly convey the true flavour of the man, his emphatic modesty, his engaging humour, his humanity, his outstanding sympathy with men of all generations, his impatience with anything pretentious or shoddy."
}