{
  "nome_completo": "Herbert Ellsworth Slaught",
  "nome_curto": "Herbert Ellsworth Slaught",
  "ano_nascimento": "1861",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slaught/",
  "lugar_nascimento": "Watkins, New York, USA",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Herbert Ellsworth Slaught\nwas the youngest of his parents' seven children, having four older brothers and two older sisters. The name Ellsworth\nwas chosen by his parents to honour Colonel Ephraim Elmer Ellsworth who had been killed in the civil war on\n24\nMay\n1861\n. Herbert's parents had been married in Hector, New York in\n1838\nand had lived mainly on their farm on the east shore of Seneca Lake. However, at the time that Herbert was born, his father was working in Watkins, New York and the family had moved there although it was only about\n10\nkm from their farm.  He was brought up on the farm on Seneca Lake but an event which greatly affected him for the rest of his life happened when he was three years old\n[\n1\n]\n:-\nFollowing an escapade in the local swimming hole with his older brothers on a cool day, he had an attack of rheumatic fever. For a period of several weeks he suffered severely. As a result of this sickness his right foot and leg never developed properly. He was crippled the rest of his life. It was necessary for him to walk with a cane until many years later when he, with unusual mechanical skill and ingenuity, perfected a shoe which enabled him to walk in comparative comfort and in fairly normal fashion.\nHowever, despite these problems, he had a good upbringing on the farm\n[\n1\n]\n:-\nIn spite of his lameness, suffering, and frailty, there were numerous delightful experiences during his years on the farm. Among those related in his Reminiscences are his are his prankish adventures with his dog, Fido; his experiences in helping the older boys make maple sugar; long sittings in the grape arbor and under the fruit trees of the large orchard; and learning to telegraph on instruments which he and the other boys made with their own hands.\nWhen he was\n13\nyears old, his family lost their farm and were forced to move. This was as a result of failing to pay the mortgage since his father had drifted into \"moral delinquency\" and left the family. Perhaps, as\nGilbert Bliss\nrelates in\n[\n3\n]\n, this was a blessing in disguise:-\n... Slaught himself has said that he would probably have spent his life working on the farm if it had not happened, and the farm was apparently not a very good one.\nSlaught, with his invalid mother, a sister and two brothers, moved to Hamilton, New York, in\n1875\n. They travelled there on a horse and cart, salvaged from their farm, towing one cow and carrying a few household goods rescued from the farm. Slaught attended Colgate Academy in Hamilton until he graduated in\n1879\n. A major advantage of the move to Hamilton was that he entered Colgate University after graduating but was still able to live at home. He had to support himself both through college and through his undergraduate studies. After an outstanding undergraduate career he graduated with an A.B. in\n1883\n. His main interest had not been mathematics but rather classics and he had hoped on graduating to find a position in this area. However, he was offered the post of instructor in mathematics at the Peddie Institute in Hightstown, New Jersey and he quickly accepted. Very quickly he impressed everyone with his abilities to teach and his administrative abilities.\nSlaught was quickly promoted at the Peddie Institute, first to assistant principal in\n1886\n, then to principal in\n1889\n. During his time at the Peddie Institute he completely reorganised the Mathematics Department. However, despite his success or perhaps because of it, he decided to aim higher.\nGilbert Bliss\nwrites\n[\n3\n]\n:-\nHe had married Miss Mary L Davis, the instructor in music at Peddie, in\n1885\n, and she sympathized with and encouraged his desire to enter the field of university mathematical work, even though such a course meant a serious sacrifice for them for some time to come. So in\n1892\nSlaught accepted a two-year appointment to one of the first three fellowships awarded by the Department of Mathematics at the University of Chicago, which was just then opening its doors.\nChicago had not been Slaught's first choice, for he had planned to undertake research for his doctorate at Johns Hopkins University and had applied for a fellowship. However, Frederick Taylor Gates, an advisor to John D Rockefeller, knew Slaught because of his efforts to gain funding for the Peddie Institute and, when he learnt that Slaught was applying to study for a Ph.D. in mathematics, he arranged for him to be interviewed by William Rainey Harper, the first President of the newly founded University of Chicago\n[\n4\n]\n:-\nPresident Harper with characteristic decisiveness offered Slaught a two-year fellowship with a guarantee of extra summer quarter teaching to help out with his finances, and Slaught accepted. He thus became one of the first three fellows in the department of mathematics at the University of Chicago.\nAfter two years of research at Chicago, his fellowship ended and he was appointed onto the teaching staff. He did not complete his doctorate until\n1898\nbecause of the high teaching load that he had. His research had been supervised by\nEliakim Moore\nand he was awarded his doctorate for a thesis entitled\nThe Cross Ratio Group of\n120\nQuadratic Cremona Transformations of the Plane\n. Slaught soon received promotion at the University of Chicago. In\n1900\nhe was made an assistant professor, them associate professor in\n1908\nand full professor in\n1913\n. Slaught remained at Chicago for the rest of his career, retiring from his chair in\n1931\n.\nLet us quote from William David Reeve about Slaught's abilities as a teacher\n[\n24\n]\n:-\nProfessor Slaught's great contribution was as a teacher and as an inspiration to his students, many of whom either were teachers or later became teachers. Many students who had studied calculus before, learned what the subject really meant in Professor Slaught's class. He was a kindly, intensely human, and understanding teacher who knew how to sympathize with ordinary students as well as to select those whom he wished to spur on to more advanced work. Many students of his will never forget the pleasant hours spent at his home with his wife and daughter Katherine at the teas on Sunday afternoons. His influence on the students at the University of Chicago both inside and outside of class was invaluable.\nDuring\n1902\n-\n3\nSlaught travelled in Europe attending lectures by the leading mathematicians. Perhaps he felt that he could never achieve the depth of research he was exposed to at this time for, after a worrying time of indecision, he decided that he was not cut out for a research career but could give most to the world of mathematics by concentrating on teaching. On his return in\n1903\n, the Central Association of Science and Mathematics Teachers was beginning to become active and he at once joined the organization and became one of its most active supporters. He was later made one of the few honorary life members of the Association.\nAfter seeking\nLeonard E Dickson\n's advice on the best way to serve the mathematical community, he accepted\nDickson\n's suggestion of becoming co-editor of the\nAmerican Mathematical Monthly\n. He served as an editor of the\nMonthly\nfrom\n1907\nto\n1937\n. In\n1913\nhe became Managing Editor and continued to hold that position until\n1918\nwhen the post was renamed Editor-in-Chief. He was then Editor-in-Chief\n1916\n-\n18\n[\n5\n]\n:-\nSlaught, probably more than any other person, had the conviction that more must be done for the average teacher of mathematics and more must be done within the field of collegiate mathematics. As far back as\n1912\nthe question was raised as to the possibility of having the\nAmerican Mathematical Society\nextend its scope so as to include the publication of the Monthly. The proposition took a more definite shape, under Slaught's impetus, at the April\n1914\nmeeting of the Chicago Section of the Society.\nWilliam DeWeese Cairns, who was President of the\nMathematical Association of America\nin\n1943\n-\n44\n, writes in\n[\n5\n]\nof his:-\n... grateful tribute to\n[\nSlaught\n]\nfor the intelligent direction which he gave to those whom he selected as his assistants. He moved consistently toward bringing as many different people as possible into active work for the 'Monthly' and the Association; this is strikingly verified if one merely glances at the extensive lists of associate editors of the 'Monthly' and officers of the Association. He was remarkable in his power of spying out new men and women of promise and of guiding them into enthusiastic service.\nSlaught also became active in the organisation of the\nMathematical Association of America\nand served as its President in\n1919\n. He also strongly supported the Chicago section of the\nAmerican Mathematical Society\nserving as its secretary from\n1906\nto\n1916\n. The third annual meeting of the Association was held, in conjunction with a meeting of the\nAmerican Mathematical Society\n, in Chicago in December\n1918\n. Slaught was chairman of the local organising committee. In September\n1919\na joint meeting of the\nMathematical Association of America\n, the\nAmerican Mathematical Society\nand the American Astronomical Society was held at the University of Michigan. Slaught acted as toastmaster at a joint dinner for all three societies.\nHe also played a major role in founding the National Council of Teachers of Mathematics in\n1920\n[\n5\n]\n:-\nAlways sympathetic with progress in the teaching of secondary school mathematics, he continued, in his busy existence, to hearten and to advise. The Council paid him the high honour in January\n1937\nof electing him honorary president for life. Much to his own delight and to the later pleasure of the Council members, he was enabled in his own home in February\n1937\nto make a disk record of a speech to be reproduced at the annual meeting of the Council at the Hotel Stevens in Chicago.\nWe can see from Slaught's work for many societies and associations which were interested in secondary school teaching that he had a strong interest in that area. In fact he wrote many articles about secondary school teaching of mathematics.\nWe give some brief extracts from some of these articles at\nTHIS LINK\n.\nHe also wrote many textbooks at school and undergraduate level. For example:\n(\nwith Nels Johann Lennes\n)\nHigh-School Algebra. Elementary Course\n(1907)\n,\n(\nwith Nels Johann Lennes\n)\nHigh-School Algebra. Advanced Course\n(1908)\n,\n(\nwith Nels Johann Lennes\n)\nPlane Geometry with Problems and Applications\n(1909)\n,\n(\nwith Nels Johann Lennes\n)\nFirst Principles of Algebra\n(1911)\n,\n(\nwith Nels Johann Lennes\n)\nSolid Geometry: With Problems and Applications\n(1911)\n,\n(\nwith\nErnest Julius Wilczynski\n)\nPlane Trigonometry and Applications\n(1914)\n,\n(\nwith\nErnest Julius Wilczynski\n)\nLogarithmic and Trigonometric Tables\n(1914)\n, and\n(\nwith\nErnest Julius Wilczynski\n)\nCollege Algebra with Applications\n(1916)\n.\nFor brief extracts of reviews of these and other texts by Slaught, see\nTHIS LINK\n.\nBliss\n, in\n[\n3\n]\n, describes Slaught as:-\n... one of the men most widely known by teachers and students of mathematics... His lifelong devotion to... the promotion of the study of mathematics, his skill as a teacher, his effective leadership in the mathematical organizations which he sponsored, and his influence with teachers of mathematics the country over, were remarkable.\nSamuel Thomas Sanders, professor at the Southwestern Louisiana Institute, writes\n[\n31\n]\n:-\nWe first sat in his classes as a student in the spring of\n1908\n. From the very beginning, we were impressed with the dynamic humanness of the man. But little study of his teaching was needed to show that his power as a teacher of mathematics came essentially from the indivisible union in his nature of two things:\n(\na\n)\na profound love of mathematics,\n(\nb\n)\nan equally profound interest in his fellows, especially young people. These two qualities could scarcely have been consistent with any programs he might originally have entertained for extensive mathematical research. Indeed, the cause of mathematics in America would probably have suffered had he chosen to confine his energies to research. ... Professor Slaught's manner was entirely unpretentious and free from the slightest affectation. Wholesome humour was one of his marked characteristics, and was reflected in his laugh. That laugh, utterly free from sarcasm or rancour, was so hearty, so sincere, so warm with the spirit of good-fellowship that quite every one to whom he might talk, whether in casual conversation or sitting as a student of one of his classes, could not avoid thinking of him more as a good pal than as a professor of mathematics.\nLet us end this biography of Slaught by quoting from Ellen Grassman\n[\n10\n]\n:-\nThe following tributes were given at the time of his death in\n1937\n. \"His was a rare spirit, a great heart, a rich personality, a generous soul,\" said Nelson L Greene. \"He has thus for many years been influential in the affairs of the most important of the mathematical associations of our country.\" This is a statement from 'Science'. \"He had an unselfish interest in the problems and personalities of those with whom he came in contact,\" was another statement made in the 'American Mathematical Monthly'."
}