{
  "nome_completo": "Hermann Klaus Hugo Weyl",
  "nome_curto": "Hermann Weyl",
  "ano_nascimento": "1885",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weyl/",
  "lugar_nascimento": "Elmshorn (near Hamburg), Schleswig-Holstein, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Hermann Weyl\nwas known as Peter to his close friends. His parents were Anna Dieck and Ludwig Weyl who was the director of a bank. As a boy Hermann had already showed that he had a great talents for mathematics and for science more generally. After taking his Abiturarbeit\n(\nhigh school graduation exam\n)\n(\nsee\n[\n17\n]\n)\nhe was ready for his university studies.  In\n1904\nhe entered the University of Munich, where he took courses on both mathematics and physics, and then went on to study the same topics at the University of Göttingen. He was completely captivated by\nHilbert\n. He later wrote:-\nI resolved to study whatever this man had written. At the end of my first year I went home with the \"Zahlbericht\" under my arm, and during the summer vacation I worked my way through it - without any previous knowledge of elementary number theory or\nGalois\ntheory. These were the happiest months of my life, whose shine, across years burdened with our common share of doubt and failure, still comforts my soul.\nHis doctorate was from Göttingen where his supervisor was\nHilbert\n. After submitting his doctoral dissertation\nSinguläre Integralgleichungen mit besonder Berücksichtigung des Fourierschen Integraltheorems\nⓉ\n(\nSingular integral equations with special application to the Fourier integral theorems\n)\nhe was awarded the degree in\n1908\n. This thesis investigated singular integral equations, looking in depth at\nFourier\nintegral theorems. It was at Göttingen that he held his first teaching post as a\nprivatdozent\n, a post he held until\n1913\n. His\nhabilitation\nthesis\nÜber gewöhnliche Differentialgleicklungen mit Singularitäten und die zugehörigen Entwicklungen willkürlicher Funktionen\nⓉ\n(\nOn ordinary differential equations with singularities and their developments for arbitrary functions\n)\ninvestigated the spectral theory of singular\nSturm\n-\nLiouville\nproblems. During this period at Göttingen, Weyl made a reputation for himself as an outstanding mathematician who was producing work which was having a major impact on the progress of mathematics. His habilitation thesis was one such piece of work but there was much more. He gave a lecture course on\nRiemann\nsurfaces in session\n1911\n-\n12\nand out of this course came his first book\nDie Idee der Riemannschen Fläche\nⓉ\n(\nThe idea of  the Riemann surface\n)\nwhich was published in\n1913\n. It united analysis, geometry and\ntopology\n, making rigorous the geometric function theory developed by\nRiemann\n. The book introduced for the first time the notion of a\n[\n59\n]\n:-\n... two-dimensional differentiable\nmanifold\n, a covering surface, and the duality between differentials and\n1\n-cycles. ...Weyl's idea of a space also included the famous separation property later introduced and popularly credited to\nFelix Hausdorff\n(1914)\n.\nL Sario wrote in\n1956\nthat Weyl's\n1913\ntext:-\n... has undoubtedly had a greater influence on the development of geometric function theory than any other publication since\nRiemann\n's dissertation.\nIt is rather remarkable that this\n1913\ntext was reprinted in\n1997\n. Weyl himself produced two later editions, the third\n(\nand final\n)\nof these editions appearing in\n1955\ncovering the same topics as the original text but with a more modern treatment. It was the original\n1913\nedition, however, which was reprinted in\n1997\nshowing perhaps more fully than the later editions just how significant the original\n1913\ntext was in the development of mathematics.\nAs a privatdozent at Göttingen, Weyl had been influenced by Edmund Husserl who held the chair of philosophy there from\n1901\nto\n1916\n. Weyl married Helene Joseph, who had been a student of Husserl, in\n1913\n; they had two sons. Helene, who came from a Jewish background, was a philosopher who was working as a translator of Spanish. Not only did Weyl and his wife share an interest in philosophy, but they shared a real talent for languages. Language for Weyl held a special importance. He not only wrote beautifully in German, but later he wrote stunning English prose despite the fact that, in his own words from a\n1939\nEnglish text:-\n... the gods have imposed upon my writing the yoke of a foreign language that was not sung at my cradle.\nFrom\n1913\nto\n1930\nWeyl held the chair of mathematics at Zürich Technische Hochschule. In his first academic year in this new post he was a colleague of\nEinstein\nwho was at this time working out the details of the theory of general relativity. It was an event which had a large influence on Weyl who quickly became fascinated by the mathematical principles lying behind the theory.\nWorld War I broke out not long after Weyl took up the chair in Zürich. Being a German citizen he was conscripted into the German army in\n1915\nbut the Swiss government made a special request that he be allowed to return to his chair in Zürich which was granted in\n1916\n. In\n1917\nWeyl gave another course presenting an innovative approach to relativity through differential geometry. The lectures formed the basis of Weyl's second book\nRaum-Zeit-Materie\nⓉ\n(\nSpace-time-matter\n)\nwhich first appeared in\n1918\nwith further editions, each showing how his ideas were developing, in\n1919\n,\n1920\n, and\n1923\n. These later ideas included a gauge metric\n(\nthe Weyl metric\n)\nwhich led to a gauge field theory. However\nEinstein\n,\nPauli\n,\nEddington\n, and others, did not fully accept Weyl's approach. Also over this period Weyl also made contributions on the uniform distribution of numbers modulo\n1\nwhich are fundamental in\nanalytic number theory\n.\nIn\n1921\nSchrödinger\nwas appointed to Zürich where he became a colleague, and soon closest friend, of Weyl. They shared many interests in mathematics, physics, and philosophy. Their personal lives also became entangled as Moore relates in\n[\n5\n]\n:-\nThose familiar with the serious and portly figure of Weyl at Princeton would have hardly recognised the slim, handsome young man of the twenties, with his romantic black moustache. His wife, Helene Joseph, from a Jewish background, was a philosopher and literateuse. Her friends called her Hella, and a certain daring and insouciance made her the unquestioned leader of the social set comprising the scientists and their wives. Anny\n[\nSchrödinger\n's wife\n]\nwas almost an exact opposite of the stylish and intellectual Hella, but perhaps for that reason\n[\nWeyl\n]\nfound her interesting and before long she was madly in love with him. ... The special circle in which they lived in Zürich had enjoyed the sexual revolution a generation before\n[\nthe United States\n]\n. Extramarital affairs were not only condoned, they were expected, and they seemed to occasion little anxiety. Anny would find in Hermann Weyl a lover to whom she was devoted body and soul, while Weyl's wife Hella was infatuated with Paul Scherrer.\nFrom\n1923\n-\n38\nWeyl evolved the concept of continuous\ngroups\nusing matrix representations. In particular his theory of\nrepresentations\nof semisimple groups, developed during\n1924\n-\n26\n, was very deep and considered by Weyl himself to be his greatest achievement. The ideas behind this theory had already been introduced by\nHurwitz\nand\nSchur\n, but it was Weyl with his general character formula which took them forward. He was not the only mathematician developing this theory, however, for\nCartan\nalso produced work on this topic of outstanding importance.\nFrom\n1930\nto\n1933\nWeyl held the chair of mathematics at Göttingen where he was appointed to fill the vacancy which arose on\nHilbert\n's retirement. Given different political circumstances it is likely that he would have remained in Göttingen for the rest of his career. However\n[\n8\n]\n:-\n... the rise of the Nazis persuaded him in\n1933\nto accept a position at the newly formed Institute for Advanced Study in Princeton, where\nEinstein\nalso went. Here Weyl found a very congenial working environment where he was able to guide and influence the younger generation of mathematicians, a task for which he was admirably suited.\nOne also has to understand that Weyl's wife was Jewish, and this must have played a major role in their decision to leave Germany in\n1933\n. Weyl remained at the Institute for Advanced Study at Princeton until he retired in\n1952\n. His wife Helene died in\n1948\n, and two years later he married the sculptor Ellen Lohnstein Bär from Zürich.\nWeyl certainly undertook work of major importance at Princeton, but his most productive period was without doubt the years he spent at Zürich. He attempted to incorporate electromagnetism into the geometric formalism of general relativity. He produced the first unified field theory for which the\nMaxwell\nelectromagnetic field and the gravitational field appear as geometrical properties of space-time. With his application of group theory to\nquantum mechanics\nhe set up the modern subject. It was his lecture course on group theory and quantum mechanics in Zürich in session\n1927\n-\n28\nwhich led to his third major text\nGruppentheorie und Quantenmechanik\nⓉ\n(\nGroup theory and quantum mechanics\n)\npublished  in\n1928\n. John Wheeler writes\n[\n56\n]\n:-\nThat book has, each time I read it, some great new message.\nMore recently attempts to incorporate electromagnetism into general relativity have been made by Wheeler. Wheeler's theory, like Weyl's, lacks the connection with quantum phenomena that is so important for interactions other than gravitation. Wheeler writes about meeting Weyl for the first time in\n[\n56\n]\n:-\nErect, bright-eyed, smiling Hermann Weyl I first saw in the flesh when\n1937\nbrought me to Princeton. There I attended his lectures on the\nÉlie Cartan\ncalculus of differential forms and their application to electromagnetism - eloquent, simple, full of insights.\nWe have seen above how Weyl's great works were first given as lecture courses. This was a deliberate design by Weyl\n[\n56\n]\n:-\nAt another time Weyl arranged to give a course at Princeton University on the history of mathematics. He explained to me one day that it was for him an absolute necessity to review, by lecturing, his subject of concern in all its length and breadth. Only so, he remarked, could he see the great lacunae, the places where deeper understanding is needed, where work should focus.\nMany other great books by Weyl appeared during his years at Princeton. These include\nElementary Theory of Invariants\n(1935)\n,\nThe classical groups\n(1939)\n,\nAlgebraic Theory of Numbers\n(1940)\n,\nPhilosophy of Mathematics and Natural Science\n(1949)\n,\nSymmetry\n(1952)\n, and\nThe Concept of a Riemannian Surface\n(1955)\n. There is so much that could be said about all these works, but we restrict ourselves to looking at the contents of\nSymmetry\nfor this perhaps tells us most about the full range of Weyl's interests.\nCoxeter\nreviewed the book and his review beautifully captures the spirit of the book:-\nThis is slightly modified version of the Louis Clark Vanuxem Lectures given at Princeton University in\n1951\n... The first lecture begins by showing how the idea of bilateral symmetry has influenced painting and sculpture, especially in ancient times. This leads naturally to a discussion of \"the philosophy of left and right\", including such questions as the following. Is the occurrence in nature of one of the two enantiomorphous forms of an optically active substance characteristic of living matter? At what stage in the development of an embryo is the plane of symmetry determined? The second lecture contains a neat exposition of the theory of groups of transformations, with special emphasis on the group of similarities and its subgroups: the groups of congruent transformations, of motions, of translations, of rotations, and finally the symmetry group of any given figure. ... the cyclic and dihedral groups are illustrated by snowflakes and flowers, by the animals called Medusae, and by the plans of symmetrical buildings. Similarly, the infinite cyclic group generated by a spiral similarity is illustrated by the Nautilus shell and by the arrangement of florets in a sunflower. The third lecture gives the essential steps in the enumeration of the seventeen space-groups of two-dimensional crystallography ...\n[\nIn the fourth lecture he\n]\nshows how the special theory of relativity is essentially the study of the inherent symmetry of the four-dimensional space-time continuum, where the symmetry operations are the\nLorentz\ntransformations; and how the symmetry operations of an atom, according to quantum mechanics, include the permutations of its peripheral electrons. Turning from physics to mathematics, he gives an extraordinarily concise epitome of\nGalois theory\n, leading up to the statement of his guiding principle: \"Whenever you have to do with a structure-endowed entity, try to determine its group of automorphisms\".\nIn\n1951\nWeyl retired from the Institute for Advanced Study at Princeton. In fact he described the\nSymmetry\nbook as his 'swan song'. After his retirement Weyl and his wife Ellen spent part of their time at Princeton and part at Zürich. He died unexpectedly while in Zürich. He was walking home after posting letters of thanks to those who had wished him well on his seventieth birthday when he collapsed and died.\nWe must say a little about another aspect of Weyl's work which we have not really mentioned, namely his work on mathematical philosophy and the foundations of mathematics. It is interesting to note what a large number of the references we quote deal with this aspect of his work and its importance is not only in the work itself but also in the extent to which Weyl's ideas on these topics underlies the rest of his mathematical and physical contributions. Weyl was much influenced by Husserl in his outlook and also shared many ideas with\nBrouwer\n. Both shared the view that the intuitive continuum is not accurately represented by\nCantor\n's set-theoretic continuum. Wheeler\n[\n56\n]\nwrites:-\nThe continuum ..., Weyl taught us, is an illusion. It is an idealization. It is a dream.\nWeyl summed up his attitude to mathematics, writing:-\nMy own mathematical works are always quite unsystematic, without mode or connection. Expression and shape are almost more to me than knowledge itself. But I believe that, leaving aside my own peculiar nature, there is in mathematics itself, in contrast to the experimental disciplines, a character which is nearer to that of free creative art.\nYou can discover more of Weyl's attitude to mathematics from his address to the Princeton Bicentennial in\n1946\nat\nTHIS LINK\n.\nHis often quoted comment:-\nMy work always tried to unite the truth with the beautiful, but when I had to choose one or the other, I usually chose the beautiful ...\nalthough half a joke, sums up his personality."
}