{
  "nome_completo": "Herman Chernoff",
  "nome_curto": "Herman Chernoff",
  "ano_nascimento": "1923",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chernoff/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Herman Chernoff\n's parents were Pauline and Max Chernoff. They were both Jewish, had been born and brought up in Russia, and had emigrated to New York. Herman attended junior high school in New York and, because he had shown considerable ability, was invited to sit the competitive examinations to enter Townsend Harris High School. This was a particularly prestigious school which acted as a preparatory school for those who went on to attend the City College of New York. He was successful in the examinations so, after studying at Townsend Harris High School, he entered the City College of New York. There he studied mathematics as his major subject and physics as a minor one. One important influence came when he took two courses on statistics. Given a paper to read during a weekend by\nNeyman\nand\nPearson\n, he found it baffling at first but finally realised that the ideas were not complicated. He was awarded a B.S. from the College in January\n1943\n, in the middle of World War II.\nAfter graduating, Chernoff had been intending to study mathematics at graduate level but he received a letter asking him to contribute to the war effort by working as a junior physicist for the U.S. Navy. After eighteen months working at the Dahlgren Proving Ground on electronic equipment, he entered Brown University to undertake research in applied mathematics. He took courses by\nBers\n,\nFeller\n,\nLoewner\n,\nTamarkin\n, and others, and wrote a Master's dissertation\nComplex Solutions of Partial Differential Equations\nunder Bergman's supervision. This work became his first mathematics paper when published by the\nAmerican Journal of Mathematics\nin\n1946\n. Before he could continue with his research, however, he was drafted into the Army shortly after the end of the war\n[\n2\n]\n:-\n... after three days basic training,\n[\nI\n]\noperated as a clerk in the night shift at the separation centre for returning army men. It was in a way the first vacation I had had in a long time, because I worked about six hours in the evening and had the whole day free. On the weekends, I rode to Brown University and I was actually taking a couple of reading courses while I was there.\nThis worked well, but then he was sent for real basic training and told he was going to be assigned a post abroad. By this time he had been awarded an NSF predoctoral fellowship so he requested a discharge from the Army. This was granted and, after just over three months in the Army, he was able to return to Brown University.\nBy this time Chernoff had decided that his talents did not lie in applied mathematics but, having seen more statistical applications during his military service, he decided to change topics. After a few more months at Brown he went to North Carolina to take a summer course in statistics held in Raleigh with lectures given by\nR A Fisher\n,\nWilliam Cochran\nand\nJ Wolfowitz\n.\nWald\nwas at North Carolina and Chernoff prepared by reading papers by\nWald\non sequential analysis. He then asked\nWald\nif he would supervise his Ph.D. This was a somewhat strange request since he was a registered student at Brown University and would submit his thesis there. After some hesitation,\nWald\nagreed and so Chernoff's doctoral thesis\nAsymptotic Studentization in Testing of Hypotheses\nwas supervised by\nWald\nalthough his official supervisor at Brown University was shown to be James Krumhansl and the degree was awarded by Brown. Chernoff was awarded the degree in\n1948\nand part of his thesis was published as\nAsymptotic Studentization in testing of hypotheses\nin\n1949\n. E L Lehmann writes:-\nMethods are developed for obtaining \"asymptotically similar\" tests, that is, tests the size of which is constant except for an error term of prescribed order in the number of observations.\nThis was in fact Chernoff's third paper since he published\nA note on the inversion of power series\nin\n1947\nwhich:-\n...\n[\ntreats\n]\nthe multiplication of power series and their inversion by means of a movable strip of paper on which the coefficients are written.\nWhile studying at Brown University, Chernoff met Judy Ullman and they married in September\n1947\n; they had two daughters Ellen and Miriam. After completing the work for his doctorate Chernoff and his wife moved to Chicago where he had an appointment as Research Instructor at the University of Chicago with the Cowles Commission for Research in Economics.\nIn\n1949\nChernoff became an Assistant Professor of Mathematics at the University of Illinois at Urbana. He was promoted to associate Professor of Mathematics there in\n1952\n. He said\n[\n2\n]\n:-\nI liked the University of Illinois very much. being a provincial from the Bronx, the small town college life at Illinois appealed to my personality.\nAlthough on the faculty at Illinois until\n1952\n, Chernoff went to Stanford University as a visitor from June\n1951\nuntil January\n1952\n, then later that year accepted the position of Associate Professor of Statistics there. He was promoted at Professor of Statistics at Stanford in\n1956\nand remained there until\n1974\n[\n2\n]\n:-\nI did not care for my introduction to California that well; the social life did not seem to be quite as nice. The intellectual environment in the Statistics department at Stanford, however, did appeal to me.\nIn\n1959\nChernoff, in collaboration with Lincoln E Moses, published a classic text\nElementary decision theory\n. D V Lindley provides this summary:-\nThis is a book about decision making, under uncertainty about the state of nature, for a student with only a background of U.S. high school mathematics. The first six chapters deal with the processing of data\n(\ngraphical methods, means and variances\n)\n, probability and random variables, the concept of utility\n(\ntreated axiomatically following\nvon Neumann\n)\nand the comparison of various strategies\n(\nBayes\n, minimax etc.\n)\n. The remaining four chapters provide an introduction to classical statistics\n(\nthe adjective is the authors'\n)\nand discuss point and interval estimation and tests of hypotheses. There are numerous appendixes in which side-issues or more difficult points are discussed, and a good set of the usual tables which appear at the end of most statistical text books.\nIn\n1972\nChernoff published a monograph which incorporated much of his work over many years. This monograph was entitled\nSequential analysis and optimal design\nand is described by P Whittle:-\nThis\n120\npage monograph takes the author's own researches as a thread which is unifying rather than dominant. The material of\n76\nreferences is knitted into a self-contained and attractive account of the sequential and design-optimal aspects of experimentation. A brief summary of the contents follows. After some elementary preliminaries, Elfving's geometrical treatment of c-optimal designs is introduced and, after some discussion of the large-sample properties of maximum likelihood estimators, the author's own treatment of locally optimal designs for estimation. A list of other topics treated follows: D-optimality and the\nKiefer\n-\nWolfowitz\nequivalence theorem; hypothesis-testing in a treatment which is largely, although not whole-heartedly, decision-theoretical; the large-sample evaluation of risk in terms of the Chernoff bounds\n(\na term not used in the text\n)\nand the various information numbers; optimisation of sample size in the case of low-cost experimentation; the sequential probability ratio test, no-overshoot approximations, optimality; the Chernoff \"procedure A\" for sequential design, and its asymptotic optimality; adjacent hypotheses, and the Schwarz boundaries; testing for the sign of a normal mean, with a general consideration of dynamic programming ideas, and of helpful asymptotics; some discussion of one- and two-armed bandits.\nIn\n1974\nChernoff left Stanford University and moved to the Massachusetts Institute of Technology where he was appointed Professor of Applied Mathematics. He held this post until\n1985\nwhen he retired and was given the title Professor Emeritus. However, Chernoff did not really retire since he was appointed as Professor of Statistics at Harvard University. He continued in this role until\n1997\nwhen in addition to being Professor Emeritus of Applied Mathematics of M.I.T. he became also Professor Emeritus of Statistics of Harvard University.\nThe authors of\n[\n3\n]\nsum up Chernoff's contributions:-\nHerman is known to be an inspiring teacher and has greatly influenced a large number of his doctoral students and post-doctoral research associates, who in turn have contributed vastly to the field of statistics.\nChernoff has been honoured in many ways for his important contributions. For example he has received honorary doctorates from Ohio State University, The Technion in Israel, La Sapienza in Rome, and the University of Athens. He has been elected to the\nNational Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, and the International Statistical Institute."
}