{
  "nome_completo": "Hidehiko Yamabe",
  "nome_curto": "Hidehiko Yamabe",
  "ano_nascimento": "1923",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yamabe/",
  "lugar_nascimento": "Ashiya, near Osaka, Japan",
  "lugar_morte": "Evanston, USA",
  "biografia": "Hidehiko Yamabe\n's father was Takhiko Yamabe. It was a large family with Hidehiko being his parents' fifth son. The family were well off but Hidehiko's health was poor and his parents were warned by the doctor who treated him that he was unlikely to live much beyond twenty years of age. Hidehiko attended elementary school in Ashiya than continued his secondary education close to his home. In\n1942\nhe was sent to The Third High School in Kyoto, following the practice in Japan at this time to send exceptionally talented boys to one of a small number of senior high schools before entering university. Despite his health problems he loved sports at secondary school but his health prevented him from playing as much rugby as he would have liked.\nOf course most of Yamabe's time in secondary school and high school had been during the years of World War II\n[\n2\n]\n:-\nQuite often classes could not be held regularly during World War II. Quite often he had to go to work in fields and factories with his classmates.\nThe war was reaching its climax in\n1944\nwhen Yamabe entered the University of Tokyo to study mathematics. He graduated in\n1947\nand was appointed as an assistant at Osaka University. These years in Japan were as difficult as the war years. Despite the problems Yamabe published some fine mathematical papers. In\nOn an arcwise connected subgroup of a Lie group\npublished in\n1950\nin the\nOsaka Mathematical Journal\nYamabe gave a direct proof of the theorem that an arcwise connected subgroup of a\nLie\ngroup is a\nLie\nsubgroup. He then began to tackle\nHilbert\n's Fifth Problem:-\nA connected locally compact group G is a projective limit of a sequence of\nLie\ngroups; and, if G has no small subgroups, then it is a\nLie\ngroup.\nThis problem had been investigated by many mathematicians such as\nChevalley\n,\nGleason\n,\nIwasawa\n, Kuranishi,\nMontgomery\n,\nPontryagin\n,\nvon Neumann\n, and\nZippin\n.  Yamabe began to produce partial results in papers such as\nOn some properties of locally compact groups with no small subgroup\n(1951)\nwritten with Morikuni Goto, which shows that in a locally Euclidean group with no small subgroup every point sufficiently near the identity is on a unique one-parameter subgroup. Also in\n1951\nhe published\nNote on locally compact groups\nwhich again attacks\nHilbert\n's Fifth problem and gives results proved independently by\nChevalley\nand\nGleason\n. Further progress came in\nOn a problem of Chevalley\n(1952)\n.\nDespite the large amount of progress that Yamabe was making to solve\nHilbert\n's Fifth Problem, he was also producing many other papers such as:\n(\nwith Zuiman Yujobo\n)\nOn the continuous function defined on a sphere\n(1950)\n;\n(\nwith Morikuni Goto\n)\nOn continuous isomorphisms of topological groups\n(1950)\n;\nOn an extension of the Helly's theorem\n(1950)\n; and\nA condition for an abelian group to be a free abelian group with a finite basis\n(1951)\n.\nIn\n1952\nYamabe married Etsuko and a few months later they travelled to the United States where Yamabe took up a post at Princeton as\nDeane Montgomery\n's assistant. It was during his two years at Princeton that he published the two papers\nOn the conjecture of Iwasawa and Gleason\nand\nA generalization of a theorem of Gleason\n. Both papers appeared in\n1953\nin the\nAnnals of Mathematics\nand together they give a final answer to\nHilbert\n's Fifth Problem. This is undoubtedly Yamabe greatest achievement, although he went on to produce many more very high quality pieces of work.\nNot only did Yamabe put the final touches to his solution to\nHilbert\n's Fifth Problem in Princeton but while he was there his first child Kimiko was born and he submitted his doctoral dissertation to Osaka University and was awarded his doctorate. In\n1954\nhe left Princeton and was appointed as assistant professor at the University of Minnesota. Hidehiko and Etsuko Yamabe had their second child Noriko in\n1956\nand in the following year Yamabe was promoted to associate professor. This was a period when his mathematical interests began to move away from\nLie\ngroups to differential equations and\ndifferential geometry\n.\nA proof of a theorem on Jacobians\n(1957)\npublished in the\nAmerican Mathematical Monthly\nwas a paper concerning the teaching of mathematics in which he gave a proof of the invertibility of mappings with non-zero Jacobian. His next major research contribution was\nKernel functions of diffusion equations. I\n(1957)\nwhich\nPeter D Lax\nreviews writing:-\nThis paper presents a new, elegant method for constructing\nGreen\n's function G for the heat equation over any domain D in Euclidean space.\nIn the following year Yamabe published\nA unique continuation theorem for solutions of a parabolic differential equation\nwritten jointly with Seizo Ito. The same theme was taken up in\nA unique continuation theorem of a diffusion equation\nwhich he published in\n1959\n. By this time, however, Yamabe had returned to Japan\n[\n2\n]\n:-\nHe enjoyed American life and was fully Americanised, yet there were nostalgic moments. It was quite difficult for him to forget his strong attachment to his mother country. In addition, as the number of young mathematicians from his country who settled in the United States increased, he started to wonder if he should go back to Japan to help the younger generation. He had some dreams about this and went back to Japan in September\n1958\nto take up the position of Professor at Osaka University to see if his plans were workable.\nYamabe returned to the United States in July of following year to continue with his position at the University of Minnesota. However he was offered a full professorship at Northwestern University at Evanston which he took up in September\n1960\n. His second paper on\nKernel functions of diffusion equations\nwas published in\n1959\nand in the following year he published\nOn a deformation of Riemannian structures on compact manifolds\nand\nGlobal stability criteria for differential systems\n. The second of these two papers was written with Lawrence Markus. Yamabe died of a stroke aged\n37\nnot long after taking up the appointment at Northwestern University\n[\n2\n]\n:-\n... he felt a severe headache one evening in November of\n[1960]\n. He was hospitalised in Evanston hospital. He stayed there for five days and died November\n20\n,\n1960\n...\nFinally let us note a publication by Yamabe, together with David Pope,\nA computational approach to the four-color problem\nwhich appeared in\n1961\n.\nCoxeter\nwrites:-\nIt was proved by\nP J Heawood\nthat the four-colouring of a given \"normal\" map\n(\nhaving\n2\nn\n2n\n2\nn\nvertices,\n3\nn\n3n\n3\nn\nedges, and\nn\n+\n2\nn + 2\nn\n+\n2\nfaces or countries\n)\nis equivalent to the solution of a system of\nn\n+\n2\nn + 2\nn\n+\n2\ncongruences modulo\n3\nfor\n2\nn\n2n\n2\nn\nunknowns\n(\neach equal to ±\n1\n, and each occurring in three of the congruences\n)\n. The authors have coded this problem on the UNIVAC Scientific\n1103\ncomputer, which took\n25\nminutes to obtain the\n146\nsolutions in a typical case with\nn\n=\n18\nn = 18\nn\n=\n1\n8\n.\nThe Yamabe Memorial Lecture has been held in his honour since\n1989\nand from\n2002\nthis was replaced by the Yamabe Memorial Symposium. Here are details:-\nThe Yamabe Memorial Lecture has been held since\n1989\n, through support from a fund created by Etsuko Yamabe and through contributions from a number of mathematicians. The lecture has been held in alternating years at the University of Minnesota and at Northwestern University.  ... The Yamabe Memorial Symposium is an enhancement of this tradition. Mathematicians will gather every two years at the University of Minnesota for a long weekend to hear geometry talks, discuss the latest research and interact with younger mathematicians. One goal will be to advance areas of mathematics related to the interests of Hidehiko Yamabe, which touched in a substantial and ground-breaking way on several quite different areas of mathematics, all of which may be roughly described as having significant geometric aspects."
}