{
  "nome_completo": "Hipparchus",
  "nome_curto": "Hipparchus",
  "ano_nascimento": "190 BC",
  "ano_morte": "120 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hipparchus/",
  "lugar_nascimento": "Nicaea (now Iznik), Bithynia (now Turkey)",
  "lugar_morte": "probably Rhodes, Greece",
  "biografia": "Little is known of\nHipparchus\n's life, but he is known to have been born in Nicaea in Bithynia. The town of Nicaea is now called Iznik and is situated in north-western Turkey. Founded in the\n4\nth\nCentury BC, Nicaea lies on the eastern shore of Lake Iznik. Reasonably enough Hipparchus is often referred to as Hipparchus of Nicaea or Hipparchus of Bithynia and he is listed among the famous men of Bithynia by\nStrabo\n, the Greek geographer and historian who lived from about\n64\nBC to about\n24\nAD. There are coins from Nicaea which depict Hipparchus sitting looking at a globe and his image appears on coins minted under five different Roman emperors between\n138\nAD and\n253\nAD.\nThis seems to firmly place Hipparchus in Nicaea and indeed\nPtolemy\ndoes describe Hipparchus as observing in Bithynia, and one would naturally assume that in fact he was observing in Nicaea. However, of the observations which are said to have been made by Hipparchus, some were made in the north of the island of Rhodes and several\n(\nalthough only one is definitely due to Hipparchus himself\n)\nwere made in Alexandria. If these are indeed as they appear we can say with certainty that Hipparchus was in Alexandria in\n146\nBC and in Rhodes near the end of his career in\n127\nBC and\n126\nBC.\nIt is not too unusual to have few details of the life of a Greek mathematician, but with Hipparchus the position is a little unusual for, despite Hipparchus being a mathematician and astronomer of major importance, we have disappointingly few definite details of his work. Only one work by Hipparchus has survived, namely\nCommentary on Aratus and Eudoxus\nand this is certainly not one of his major works. It is however important in that it gives us the only source of Hipparchus's own writings.\nMost of the information which we have about the work of Hipparchus comes from\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nbut, as Toomer writes in\n[\n1\n]\n:-\n... although\nPtolemy\nobviously had studied Hipparchus's writings thoroughly and had a deep respect for his work, his main concern was not to transmit it to posterity but to use it and, where possible, improve upon it in constructing his own astronomical system.\nWhere one might hope for more information about Hipparchus would be in the commentaries on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. There are two in particular by the excellent commentators\nTheon\nof Alexandria and by\nPappus\n, but unfortunately these follow\nPtolemy\n's text fairly closely and fail to add the expected information about Hipparchus. Since when\nPtolemy\nrefers to results of Hipparchus he does so often in an obscure way, at least he seems to assume that the reader will have access to the original writings by Hipparchus, and it is certainly surprising that neither\nTheon\nor\nPappus\nfills in the details. One can only assume that neither of them had access to the information about Hipparchus on which we would have liked them to report.\nLet us first summarise the main contribution of Hipparchus and then examine them in more detail. He made an early contribution to trigonometry producing a table of chords, an early example of a trigonometric table; indeed some historians go so far as to say that trigonometry was invented by him. The purpose of this table of chords was to give a method for solving triangles which avoided solving each triangle from first principles. He also introduced the division of a circle into\n360\ndegrees into Greece.\nHipparchus calculated the length of the year to within\n6\n.\n5\nminutes and discovered the\nprecession of the equinoxes\n. Hipparchus's value of\n46\n\" for the annual precession is good compared with the modern value of\n50\n.\n26\n\" and much better than the figure of\n36\n\" that\nPtolemy\nwas to obtain nearly\n300\nyears later. We believe that Hipparchus's star catalogue contained about\n850\nstars, probably not listed in a systematic coordinate system but using various different ways to designate the position of a star. His star catalogue, probably completed in\n129\nBC, has been claimed to have been used by\nPtolemy\nas the basis of his own star catalogue. However, Vogt shows clearly in his important paper\n[\n26\n]\nthat by considering the\nCommentary on Aratus and Eudoxus\nand making the reasonable assumption that the data given there agreed with his star catalogue, then\nPtolemy\n's star catalogue cannot have been produced from the positions of the stars as given by Hipparchus.\nThis last point shows that in any detailed discussion of the achievements of Hipparchus we have to delve more deeply than just assuming that everything in the\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nwhich he does not claim as his own must be due to Hipparchus. This view was taken for many years but since Vogt's\n1925\npaper\n[\n26\n]\nthere has been much research done trying to ascertain exactly what Hipparchus achieved. So major shifts have taken place in our understanding of Hipparchus, first it was assumed that his discoveries were all set out by\nPtolemy\n, then once it was realised that this was not so there was a feeling that it would be impossible to ever have detailed knowledge of his achievements, but now we are in a third stage where it is realised that it is possible to gain a good knowledge of his work but only with much effort and research.\nLet us begin our detailed description of Hipparchus's achievements by looking at the only work which has survived. Hipparchus's\nCommentary on Aratus and Eudoxus\nwas written in three books as a commentary on three different writings. Firstly there was a treatise by\nEudoxus\n(\nunfortunately now lost\n)\nin which he named and described the constellations. Aratus wrote a poem called\nPhaenomena\nwhich was based on the treatise by\nEudoxus\nand proved to be a work of great popularity. This poem has survived and we have its text. Thirdly there was commentary on Aratus by Attalus of Rhodes, written shortly before the time of Hipparchus.\nIt is certainly unfortunate that of all of the writings of Hipparchus this was the one to survive since the three books on which Hipparchus was writing a commentary contained no mathematical astronomy. As a result of this Hipparchus chose to write at the same qualitative level in the first book and also for much of the second of his three book. However towards the end of the second book, continuing through the whole of the third book, Hipparchus gives his own account of the rising and setting of the constellations. Towards the end of Book\n3\nHipparchus gives a list of bright stars always visible for the purpose of enabling the time at night to be accurately determined. As we noted above Hipparchus does not use a single consistent coordinate system to denote stellar positions, rather using a mixture of different coordinates. He uses some equatorial coordinates, although often in a rather strange way as for example saying that a star\n(\nsee\n[\n1\n]\n)\n:-\n... occupies three degrees of Leo along its parallel circle...\nHe has therefore divided each small circle parallel to the equator into\n12\nportions of\n30\n° each and this means that the\nright ascension\nof the star referred to in the quotation is\n123\n°. The data in the\nCommentary on Aratus and Eudoxus\nhas been analysed by many authors. In particular the authors of\n[\n15\n]\nargue that Hipparchus used a mobile\ncelestial sphere\nwith the stars pictured on the sphere. They claim that the data was taken from on a star catalogue constructed around\n140\nBC based on observations accurate to a third of a degree or even better. In the earlier work\n[\n16\n]\nby the same authors, they suggest that the observations were made at a latitude of\n36\n°\n15\n' which corresponds to that of northern Rhodes. This would tend to confirm that this work by Hipparchus was done near the end of his career. As Toomer writes in\n[\n1\n]\n:-\nFar from being a \"work of his youth\", as it is frequently described, the commentary on Aratus reveals Hipparchus as one who had already compiled a large number of observations, invented methods for solving problems in spherical astronomy, and developed the highly significant idea of mathematically fixing the positions of the stars...\nThere is of course no agreement on many of the points discussed here. For example Maeyama in\n[\n13\n]\nsees major differences between the accuracy of the data in\nCommentary on Aratus and Eudoxus\n(\nclaimed to be written around\n140\nBC\n)\nand Hipparchus's star catalogue\n(\nclaimed to be produced around\n130\nBC\n)\n. Maeyama writes\n[\n13\n]\n:-\n... Hipparchus's \"Commentary\" contains his own observations of the stellar positions, great in number but inaccurate in operation, despite all his ability for accurate observations. ... the observational accuracy\n[\nof\n]\nhis two different epochs have nothing in common, as if they dealt with two different observers. Within an interval of\n10\nyears everything can happen, particularly in the case of a man like Hipparchus. Those views which consider Hipparchus's astronomical activities at his two different epochs as similar are completely unfounded.\nPerhaps the discovery for which Hipparchus is most famous is the discovery of precession which is due to the slow change in direction of the axis of rotation of the earth. This work came from Hipparchus's attempts to calculate the length of the year with a high degree of accuracy. There are two different definitions of a 'year' for one might take the time that the sun takes to return to the same place amongst the fixed stars or one could take the length of time before the seasons repeated which is a length of time defined by considering the\nequinoxes\n. The first of these is called the\nsidereal year\nwhile the second is called the\ntropical year\n.\nOf course the data needed by Hipparchus to calculate the length of these two different years was not something that he could find over a few years of observations. Swerdlow\n[\n20\n]\nsuggests that Hipparchus calculated the length of the tropical year using Babylonian data to arrive at the value of\n1\n300\n\\large\\frac{1}{300}\\normalsize\n3\n0\n0\n1\n​\nof a day less than\n365\n1\n4\n365\\large\\frac{1}{4}\\normalsize\n3\n6\n5\n4\n1\n​\ndays. He then checked this against observations of equinoxes and\nsolstices\nincluding his own data and those of\nAristarchus\nin\n280\nBC and Meton in\n432\nBC. Hipparchus also calculated the length of the sidereal year, again using older Babylonian data, and arrived at the highly accurate figure of\n1\n144\n\\large\\frac{1}{144}\\normalsize\n1\n4\n4\n1\n​\ndays longer than\n365\n1\n4\n365\\large\\frac{1}{4}\\normalsize\n3\n6\n5\n4\n1\n​\ndays. This gives his rate of precession of\n1\n° per century.\nHipparchus also made a careful study of the motion of the moon. There are difficult problems in such a study for there are three different periods which one could determine. There is the time taken for the moon to return to the same longitude, the time taken for it to return to the same velocity\n(\nthe anomaly\n)\nand the time taken for it to return to the same latitude. In addition there is the\nsynodic month\n, that is the time between successive\noppositions\nof the sun and moon. Toomer\n[\n22\n]\nwrites:-\nFor his lunar theory\n[\nHipparchus\n]\nneeded to establish the mean motions of the Moon in longitude, anomaly and latitude. The best data available to him were the Babylonian parameters. But he was not content merely to accept them: he wanted to test them empirically, and so he constructed\n(\npurely arithmetically\n)\nthe eclipse period of\n126007\ndays\n1\nhour, then looked in the observational material available to him for pairs of eclipses which would confirm that this was indeed an eclipse period. The observations thus played a real role, but that role was not discovery, but confirmation.\nIn calculating the distance of the moon, Hipparchus not only made excellent use of both mathematical techniques and observational techniques but he also gave a range of values within which be calculated that the true distance must lie. Although Hipparchus's treatise\nOn sizes and distances\nhas not survived details given by\nPtolemy\n,\nPappus\n, and others allow us to reconstruct his methods and results.\nThe reconstruction of Hipparchus's techniques is beautifully presented in\n[\n24\n]\nwhere the author shows that Hipparchus based his calculations on an eclipse which occurred on\n14\nMarch\n190\nBC. Hipparchus's calculations led him to a value for the distance to the moon of between\n59\nand\n67\nearth radii which is quite remarkable\n(\nthe correct distance is\n60\nearth radii\n)\n. The main reason for his range of values was that he was unable to determine the\nparallax\nof the sun, only managing to give an upper value. Hipparchus appears to know that\n67\nearth radii for the distance of the moon comes from this upper limit of solar parallax, while the lower value of\n59\nearth radii corresponds to the sun being at infinity.\nHipparchus not only gave observational data for the moon which enabled him to compute accurately the various periods, but he developed a theoretical model of the motion of the moon based on\nepicycles\n. He showed that his model did not agree totally with observations but it seems to be\nPtolemy\nwho was the first to correct the model to take these discrepancies into account. Hipparchus was also able to give an epicycle model for the motion of the sun\n(\nwhich is easier\n)\n, but he did not attempt to give an epicycle model for the motion of the planets.\nFinally let us examine the contributions which Hipparchus made to trigonometry.\nHeath\nwrites in\n[\n6\n]\n:-\nEven if he did not invent it, Hipparchus is the first person whose systematic use of trigonometry we have documentary evidence.\nThe documentary evidence comes from\nPtolemy\nand\nTheon\nof Alexandria who explicitly says that Hipparchus wrote a work on chords in\n12\nbooks. However,\nNeugebauer\n[\n7\n]\npoints out that:-\n... this number is obvious nonsense since\n13\nbooks sufficed for the whole of the \"Almagest\"\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nor of\nEuclid\n's \"Elements\"...\nToomer\n(\n[\n1\n]\nor\n[\n23\n]\n)\nreconstructs Hipparchus's table of chords, and the mathematical means by which Hipparchus calculated it. The table was based on a circle divided into\n360\ndegrees with each degree divided into\n60\nminutes. The radius of the circle is then\n360\n×\n60\n2\nπ\n=\n3438\n360\\times \\Large\\frac{60}{2\\pi}\\normalsize  = 3438\n3\n6\n0\n×\n2\nπ\n6\n0\n​\n=\n3\n4\n3\n8\nminutes and the chord function Crd of Hipparchus is related to the sine function by\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n(\nCrd\n2\na\n)\n=\n3438\nsin\n⁡\na\n2a) = 3438 \\sin a\n2\na\n)\n=\n3\n4\n3\n8\nsin\na\n.\nToomer claims that Hipparchus defined his Crd function at\n7\n.\n5\n° intervals\n(\n1\n48\n\\large\\frac{1}{48}\\normalsize\n4\n8\n1\n​\nof the circle\n)\nand used linear interpolation to find the value at intermediate points. He then goes on to show that the table can be computed from some basic formulae which would be known to Hipparchus, one of which is the supplementary angle theorem, essentially\nPythagoras\n's theorem, and the half-angle theorem. The only trace of Hipparchus's tables that survives is in Indian tables which are thought to have been based on that of that of Hipparchus.\nToomer summarises the contributions of Hipparchus in this area when he writes in\n[\n1\n]\n:-\n... it seems highly probable that Hipparchus was the first to construct a table of chords and thus provide a general solution for trigonometrical problems. A corollary of this is that, before Hipparchus, astronomical tables based on Greek geometrical methods did not exist. If this is so, Hipparchus was not only the founder of trigonometry but also the man who transformed Greek astronomy from a purely theoretical into a practical predictive science."
}