{
  "nome_completo": "John Howard Van Amringe",
  "nome_curto": "Howard Van Amringe",
  "ano_nascimento": "1835",
  "ano_morte": "1915",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Amringe/",
  "lugar_nascimento": "Philadelphia, Pennsylvania, USA",
  "lugar_morte": "Morristown, New Jersey, USA",
  "biografia": "Howard Van Amringe\n's parents were William Frederick Van Amringe and Susan Budd Sterling. Howard's paternal grandfather Lionel Van Amringe was born in Rotterdam, served under Frederick the Great, married Elizabeth Oborne, a Hampshire woman, in London and emigrated from Holland to the United States in\n1791\n. William Frederick Van Amringe was born on\n22\nMay\n1791\n, became a lawyer, published the massive book\nAn Investigation of the Theories of the Natural History of Man\nin\n1848\nand\nThe nature and origin of heat and the forces of the universe\nin\n1869\n, and died on\n16\nMarch\n1873\n. Susan Budd, the daughter of James Sterling of Coleraine, Londonderry, Ireland was born in the City of Burlington, NJ, on\n11\nJune\n1798\nand died on\n4\nDecember\n1891\n. William and Susan were married on\n7\nOctober\n1818\n. The family moved from Philadelphia to New York in\n1841\n. Howard was educated at home by his father until he entered Montgomery Academy in New York. There he prepared to enter Yale University which he did in\n1854\n. In\n1856\nhe left and became a teacher of mathematics but returned to his studies in\n1858\nwhen he entered Columbia College in New York City. The College was to become Columbia University in\n1912\n.\nVan Amringe taught at Columbia while an undergraduate but not, as one might expect, in the Department of Mathematics but rather in the Department of Greek. He received his A.B. in\n1860\nand his A.M. in\n1863\n. Keyser writes\n[\n6\n]\n:-\nSo brilliant and many-sided were his native powers and his attainments that even before graduation he had been tendered an instructorship in no fewer than five widely diverse departments: Greek, Latin, history, chemistry, mathematics. He might with equal propriety have been invited into the department of English, had there been such a department at that time, for his extant writings, including many published addresses, show that he had a remarkable control over the resources of English speech.\nVan Am, as he was known, spent his entire career at Columbia College. He was appointed as a tutor in mathematics in\n1860\nbeing promoted to adjunct professor of mathematics in\n1863\n. He was a lecturer in the School of Mines in\n1864\n-\n5\nand full professor in\n1865\n, holding this chair until\n1873\nwhen he was appointed professor of mathematics in the School of Arts. He was head of mathematics from\n1892\nuntil he retired in\n1910\n. He served as dean of the School of Arts from\n1894\nto\n1896\nwhen he became dean of Columbia College. As dean he served on the University Council and for the year\n1899\nhe served as President of the University. He held the position of dean for fourteen years until June\n1910\nwhen he resigned from his duties. At this time he was made Emeritus Professor of Mathematics.\nVan Amringe was a good teacher of mathematics, Thomas\n[\n4\n]\nwrites:-\n... probably no other teacher of his day was so loved and revered...\nKeyser writes\n[\n6\n]\n:-\nVan Amringe was a great teacher, especially of undergraduate men. He was never converted to a belief in coeducation. He did not believe in, and he did not employ, the lecture method with undergraduates. He was convinced that one of the great desiderata is to teach students to read solid books understandingly, and so he assigned them daily definite lessons in a chosen book and required them to report, usually in the form of classroom recitations. Idleness was not tolerated; industry and achievement were praised generously and discriminatingly. If a student, having tried, failed to understand, he was not overwhelmed by explanations, but led, by the too rare art of skilful questioning and suggestion, into the presence of the truth.\nHe was not, however, a research mathematician of any quality. He did not publish any research papers on mathematics but he is important in his role in the founding of the\nNew York Mathematical Society\nwhich quickly changed its name to the\nAmerican Mathematical Society\n. He was the first president of the Society appointed at the first meeting on\n24\nNovember\n1888\n. He held this post until the meeting on\n5\nDecember\n1890\nwhen\nEmory McClintock\n, an actuary with the Mutual Life Insurance Company in New York, became the second president. At the meeting on\n5\nDecember\n1890\n, Van Amringe proposed that the Society should publish a Bulletin. The Society accepted his proposal to publish a journal named\nThe Bulletin of New York Mathematical Society\n.\nBurgess\n[\n1\n]\ndescribes Van Amringe in colourful terms:-\nHe was ... the ideal college patriot, and consequently the idol of the students and alumni of the college, although he was quite a disciplinarian in the classroom. ... He was always having some accident, such as breaking an arm or a leg. ... he was a great smoker and frequenter of clubs. He was also something of a politician .. he was a good, staunch, reliable friend and very agreeable in social intercourse. No one could know the man and not love him.\nRaymond Archibald\nwrites about the\nAmerican Mathematical Society\nin\n[\n2\n]\n:-\n... it was only natural that one of\n[\nVan Amringe's\n]\nprominence, occupying the position that he did, should have become our Society's first president.\nHe was also a member of the New York Historical Society and the American Society for the Advancement of Science. But there was another area in which he was extremely active in the community which was his involvement in many religious organisations. He served on the Vestry of Trinity Church, and was a Trustee of the New York Protestant Episcopal Public School, of the Society for Promoting Religion and Learning in the State of New York, of the Common Prayer Book Society, and of the General Theological Seminary of the Protestant Episcopal Church.\nVan Amringe was married to Cornelia Bucknor, daughter of William G Bucknor, in New York City on\n20\nJune\n1865\nby the Revd George Jarvis Geer. Howard and Cornelia Van Amringe, who lived at\n48\nWest Fifty-ninth Street, New York, had a daughter Emily and a son Guy who became a New York lawyer. Cornelia was born in New York in\n1837\nand died in that city on\n10\nMay\n1914\n. Howard Van Amringe's death is described in\n[\n4\n]\n:-\nHe had been suffering from a weak heart for the last three days and had remained in his room. At\n1\no'clock luncheon was served in his room, and when he rose he was stricken with apoplexy and collapsed in his chair. His daughter, Miss Emily Van Amringe, rushed to his assistance, and he begged her to send for a physician, saying, \"I think that I am suffering from a stroke.\" Then he lapsed into unconsciousness and died within an hour.\nAmong many honours given to Van Amringe let us mention in particular the bust of the Dean Van Amringe that the alumni of Columbia University donated in March\n1913\nto the Columbia University Club. At this time the Chairman, Charles Halstead Maples, gave this tribute\n[\n4\n]\n:-\nVan Am has become more than a mere man to us; he's a sentiment. He was right, always right. What the Yale fence is to Yale, the ivy to Princeton, Van Am is to Columbia - a tangible, concrete expression of sentiment to which our members lovingly cling. He has been the friend of our youth, of our young manhood and now of our prime. This then, is the bust of the friend of each one of us - a friend like the Douglas of old, tender and true. It has come, as I know Van Am would have it come, by popular subscription, a gift from many loving Columbia hearts.\nWe end this biography by quoting a song written by the students of Columbia University:\nD'ye ken Van Am with his snowy hair,\nD'ye ken Van Am with his whiskers rare,\nD'ye ken Van Am with his martial air,\nAs he crosses the quad in the morning?\nThe sight of Van Am raised my hat from my head.\nAnd the sound of his voice often filled me with dread.\nOh, I shook in my boots at the things that he said\nWhen he asked me to call in the morning.\nYes, I ken'd Van Am, to my sorrow, too,\nWhen I was a freshman of verdant hue.\nFirst a cut, then a bar, then an interview\nWith the Dean in his den in the morning.\nBut we love Van Am from our heart and soul,\nLet's drink to his health! Let's finish the bowl!\nWe'll swear by Van Am through fair and through foul,\nAnd wish him the top o' the morning.\nD'ye ken Van Am with his fine old way.\nThe Dean of Columbia for many a day?\nLong may he live and long may he stay\nWhere his voice may be heard in the morning."
}