{
  "nome_completo": "Abu Zayd Hunayn ibn Ishaq al-Ibadi",
  "nome_curto": "Hunayn ibn Ishaq",
  "ano_nascimento": "808",
  "ano_morte": "873",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hunayn/",
  "lugar_nascimento": "Al-Hirah (now in Iraq)",
  "lugar_morte": "Baghdad (now in Iraq)",
  "biografia": "Hunayn ibn Ishaq\nis most famous as a translator. He was not a mathematician but trained in medicine and made his original contributions to the subject. However, as the leading translator in the House of Wisdom at one of the most remarkable periods of mathematical revival, his influence on the mathematicians of the time is of sufficient importance to merit his inclusion in this archive. His son Ishaq ibn Hunayn, strongly influenced by his father, is famed for his Arabic translation of\nEuclid\n's Elements.\nHunayn's father was Ishaq, a pharmacist from Hira. The family were from a group who had belonged to the Syrian Nestorian Christian Church before the rise of Islam, and Hunayn was brought up as a Christian. Hunayn became skilled in languages as a young man, in particular learning Arabic at Basra and also learning Syriac.\nTo continue his education Hunayn went to Baghdad to study medicine under the leading teacher of the time. However, after falling out with this teacher, Hunayn left Baghdad and, probably during a period in Alexandria, became an expert in the Greek language. Hunayn returned to Baghdad and established contact with the teacher with whom he had fallen out. The two became firm friends and were close collaborators on medical topics for many years.\nLet us go back to a time before Hunayn was born and describe the events which would lead to a remarkeble period of scholarship. Harun al-Rashid became the fifth Caliph of the Abbasid dynasty on\n14\nSeptember\n786\n. He brought culture to his court and tried to establish the intellectual disciplines which at that time were not flourishing in the Arabic world. It was during al-Rashid's reign that the first Arabic translation of\nEuclid\n's\nElements\nwas made by al-Hajjaj. The first steps began to be taken which would allow Greek knowledge to spread through the Islamic empire, a process in which Hunayn was to play a major role.\nAl-Rashid had two sons, the eldest was al-Amin while the younger was al-Ma'mun. Harun al-Rashid died in\n809\n, the year after Hunayn's birth, and there was an armed conflict between his two sons. Al-Ma'mun won the armed struggle, became Caliph and ruled the empire from Baghdad. He continued the patronage of learning started by his father and founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. It should not be thought that the Arabs who were translating these Greek texts simply sat down with a pile of Greek manuscripts and translated them. Most of the difficulty occurred in searching for the manuscripts which were to be translated. In order to find manuscripts of the works of\nAristotle\nand others, al-Ma'mun sent a team of his most learned men to Byzantium. It is thought that Hunayn, being more skilled in the Greek language than any of the other scholars in Baghdad, was on this expedition.\nAs an example of the lengths that Hunayn went in order to find a particular manuscript we quote his description of a search for a medical manuscript\n(\nsee for example\n[\n1\n]\n)\n:-\nI sought for\n[\nthe manuscript\n]\nearnestly and travelled in search of it in the lands of Mesopotamia, Syria, Palestine and Egypt, until I reached Alexandria, but I was not able to find anything, except about half of it at Damascus.\nAl-Ma'mun recruited the most talented men for the House of Wisdom such as\nal-Khwarizmi\n,\nal-Kindi\nand al-Hajjaj the first translator of\nEuclid\n's\nElements\ninto Arabic refered to above. There they worked with Hunayn and later also with\nThabit ibn Qurra\n. Hunayn became a close friend of\nMuhammad Banu Musa\nalthough relations between some of the scholars was not good due to rivalry.\nIn\n833\nal-Ma'mun died and was succeeded by his brother al-Mu'tasim. The house of Wisdom continued to flourish under successive caliphs. Al-Mu'tasim died in\n842\nand was succeeded by al-Wathiq\n[\n1\n]\n:-\nHunayn soon became famous and participated in the scholarly meetings at which physicians and philosophers discussed dificult problems in the presence of Caliph al-Wathiq.\nCaliph al-Wathiq was succeeded as Caliph in\n847\nby al-Mutawakkil who appointed Hunayn to the post of chief physician at his court, a position he held for the rest of his life. Under both these Caliphs internal arguments and rivalry arose between the scholars in the House of Wisdom and Hunayn was most certainly involved in this rivalry. The rivalry could certainly become serious and at one point Hunayn had his library confiscated and he was imprisoned.\nHunayn is important for the many excellent translations of Greek texts which he made into Arabic. In particular he translated\nPlato\nand\nAristotle\n. These translations were spread widely through Mesopotamia, Syria and Egypt."
}