{
  "nome_completo": "Iacopo Barsotti",
  "nome_curto": "Iacopo Barsotti",
  "ano_nascimento": "1921",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barsotti/",
  "lugar_nascimento": "Turin, Italy",
  "lugar_morte": "Padua, Italy",
  "biografia": "Iacopo Barsotti\nstudied at the Scuola Normale Superiore of Pisa, which was originally founded in\n1810\nby a decree of Napoleon Bonaparte and intended to be a sister institute of the École Normale Supérieure in Paris. It had become an institute of higher education linked to the University of Pisa in\n1932\nbut when Barsotti was studying there World War II broke out. Italy kept out of the war for the first few months of the fighting but joined the hostilities of World War II, declaring war on Britain and France on\n10\nJune\n1940\n, only days before France surrendered to the Germans. The Scuola Normale continued to operate despite the war, but there were some limitations and practical difficulties. Barsotti was able to continue studying there and was awarded his laurea in\n1942\n. At this stage he was called up to undertake military service and remained in the army until the war ended in\n1945\nwhen he was able to return to Pisa. Barsotti was not, therefore, in a position to publish material from his thesis until after the war ended. In fact he published a summary of his thesis results in\nStudi sopra le algebra senza base finita\nⓉ\n(\nStudies of an algebra without a finite base\n)\n(1946)\nand then the full details in\nAlgebre senza base finita\nⓉ\n(\nAlgebras without a finite base\n)\n(\nfirst part in\n1947\n, second part in\n1948)\n. The papers state that they were extracted from his\n1942\nthesis.\nIrving Kaplansky\nwrites:-\n[\nPart I\n]\nThe author lays the foundation of a theory of linear spaces and algebras of infinite order. Particular attention is paid to what can be proved without the axiom of choice.\n[\nPart II\n]\nContinuing his discussion of algebras of infinite order, the author takes up ideals, subalgebras, idempotents and\nKronecker\nproducts; the latter are constructed without using a basis.\nThe Scuola Normale Superiore of Pisa had suffered severely during the war. Pisa had been bombed by the Americans on\n31\nAugust\n1943\nand the director of the Scuola Normale, being threatened with arrest, had fled.\nLeonida Tonelli\nhad become the new director and he had done much to preserve the buildings of the Scuola Normale which were being used as a German barracks. Pisa was liberated by the Allies on\n2\nSeptember\n1944\nand on\n25\nSeptember\n1945\nrestoration of the Scuola Normale began while a number of war veterans signed up as students. After Barsotti returned to Pisa, he helped with the restoration of teaching at the university. However, in\n1946\nhe moved to Rome when he was appointed as\nFrancesco Severi\n's assistant. Francesco Gherardelli writes\n[\n4\n]\n:-\nI first met Barsotti in Rome, when he was an assistant in geometry. He had just graduated from the Scuola Normale of Pisa but was already working independently, with originality of interests, making use of unusual cultural support. In those years the methods of modern algebra in\nalgebraic geometry\nwere almost unknown in Italy: in Rome it was only Barsotti who had already securely mastered them.\nThis was a difficult period with considerable tensions. Following the war,\nSeveri\nhad been investigated by the High Commission for Sanctions against Fascism, suspended from his post for several months but reinstated in May\n1945\n. However, he was investigated again in the following year and, although cleared of any wrongdoing, he was thrown out of the\nAccademia dei Lincei\n. Continued accusations against\nSeveri\nmade Barsotti's years as his assistant from\n1946\nto\n1948\ndifficult ones.\nSeveri\n's difficulties continued throughout this period but he was reelected to the\nAccademia dei Lincei\nin\n1948\n. Notice that although Barsotti was\nSeveri\n's assistant in Rome during\n1946\n-\n48\n, he still gave his address as Pisa on the paper\nA proof of two fundamental theorems on linear transformations in Hilbert space, without use of the axiom of choice\nwhich he submitted to the\nBulletin\nof the\nAmerican Mathematical Society\nin March\n1947\n.\nBarsotti's experience in Rome, with the continuing after-effects of the war, convinced him that he needed to leave Italy if he wanted to work in the most advanced schools of mathematics. He applied for, and was awarded, an Italo-American fellowship to allow him to study at Princeton University in the United States. He spent\n1948\n-\n49\nat Princeton and while there wrote the paper\nAlgebraic Correspondences Between Algebraic Varieties\n. He writes in the introduction to the paper:-\nThe present paper was originally intended to give a satisfactory algebraic definition of 'algebraic equivalence' between curves of an algebraic surface, and to prove the usual equivalence criteria. However in the course of development of these ideas it became apparent that the methods used could be applied to varieties of any dimension, at least as long as the concept of algebraic correspondence was involved. In the present paper it is only with these methods that we are concerned. it is intended that the original plan, and some other topic on the theory of intersections, will appear in a future paper as an application of the general theory. The present treatment differs from the previous ones given\n[\nby\nBartel van der Waerden\nand\nAndré Weil\n]\nIt differs also from\nZariski\n's approach to the subject\n[\nwhich will be\n]\ncontained in a book to be published in the\nAmerican Mathematical Society\nColloquium Publications. The Author had access to a part of the manuscript by courtesy of Professor\nZariski\n.\nThe future papers that Barsotti referred to in this introduction appeared over the next years. He had been appointed at the University of Pittsburgh after his year at Princeton and it was from Pittsburgh that he wrote the papers\nLocal properties of algebraic correspondences\n(1951)\nand\nIntersection theory for cycles of an algebraic variety\n(1952)\n. Both acknowledge that the research was carried out with support from a U.S. Navy contract. Barsotti puts the whole area into context in his introduction to this\n1952\npaper:-\nFor a number of years intersection theory represented one of the most debated subjects in the field of algebraic geometry; also one of the main reasons for seeing in the whole structure of algebraic geometry an inherent flimsiness which even discouraged the study of this branch of mathematics. This situation came to an end when the methods of algebra began to be successfully applied to geometry, mainly by\nvan der Waerden\nand\nZariski\n; in the specific case of intersection theory, a completely general and rigorous treatment of the subject was given by\nChevalley\nin\n1945\n. This rebuilding of algebraic geometry on firm foundations has often taken a form quite different from what the classical works would have led one to expect. Thus it is not surprising that\nChevalley\n's solution of the problem has no evident link with the methods that, according to the suggestions of the classical geometers, should have been used in order to define the intersection multiplicity; rather, it is linked to the analytical approach, and it is therefore a strictly \"local\" theory, thus having the advantage of providing an intersection multiplicity also for algebroid varieties. The method by\nAndré Weil\n[\nin 'Foundations of algebraic geometry'\n(1946)]\nis another example of local theory. The classical approach to the problem is illustrated in the introduction to\n[\nI Barsotti\n, '\nLocal properties of algebraic correspondences'\n(1951)]\n, and carried out in the present paper.\nIn\n1960\nBarsotti moved to Brown University in Providence, Rhode Island but, while there, entered the competition for the chair of geometry and algebra at the University of Pisa. He was ranked in first place by the panel and, in\n1961\n, returned to Italy to take up the appointment. This was a golden time for the mathematics department at Pisa due to the appointment of\nAlessandro Faedo\nin\n1946\n.\nFaedo\n, who was rector of the university from\n1958\nto\n1972\n, brought an amazing collection of outstanding mathematicians to Pisa. In addition to Barsotti, he appointed\nAldo Andreotti\nand Edoardo Vesentini. While at Pisa, Barsotti published a series of seven papers entitled\nMetodi analitici per varietà abeliane in caratteristica positiva\n. These seven papers, published between\n1964\nand\n1966\n, are parts of a single work which studies inseparability phenomena for abelian varieties over an algebraically closed field of characteristic greater than zero. His work in this area is remembered since his name has been attached to the Barsotti-\nTate\ngroups. Barsotti introduced these groups in his\n1962\npaper\nAnalytical methods for abelian varieties in positive characteristic\nand named them equidimensional hyperdomain.\nJohn Tate\nworked on them five years later, calling them\np\np\np\n-divisible groups, but the name Barsotti-\nTate\ngroup is due to\nAlexander Grothendieck\nin\n1971\nwho observed that these groups are naturally associated with the crystalline cohomology of a smooth scheme defined over a field of positive characteristic.\nBarsotti was not, however, to spend the rest of his career at Pisa for, in\n1968\n, he moved to Padua to take up the chair of geometry at the university there. He published a number of articles on the theta function after moving to Padua, for example\nConsiderazioni sulle funzioni theta\n(1970)\nwhich aims to bring the classical theory of theta functions of several variables within the scope of abstract algebraic geometry. The intention is to be able to extend the theory to cover the case of non-zero characteristic. He moved to this in\nTheta functions in positive characteristic\n(1979)\nand, staying with the theme of theta functions, published\nDifferential equations of theta functions\n(1983)\nand\nTheta functions and differential equations\n(1985)\n. While working on the theta function, he returned to Princeton to spend time as a visiting scholar at the Institute for Advanced Study in\n1982\n.\nFollowing his death in\n1987\n, a Symposium in Algebraic Geometry was held in his honour from\n24\nto\n27\nJune\n1991\nin Abano Terme. The proceedings of the conference was published by Academic Press in\n1994\n, see\n[\n1\n]\n."
}