{
  "nome_completo": "Igor Rostislavovich Shafarevich",
  "nome_curto": "Igor Rostislavovich Shafarevich",
  "ano_nascimento": "1923",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shafarevich/",
  "lugar_nascimento": "Zhytomyr, Ukraine",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Igor Rostislavovich Shafarevich\nis generally regarded as one of the leading contemporary mathematicians of Russia. He was born in\n1923\n, the son of Rostislav Stepanovich Shafarevich and Yulia Yacovlevna Vasileva. Rostislav Stepanovich had attended Moscow State University where he obtained a degree in mechanics. He taught theoretical mechanics in a number of different higher education institutions, for example the Moscow Engineering Institute\n(\nTechnical University of Moscow\n)\n. However, he had gone through some extremely difficult times in the years before Igor Rostislavovich was born. Speaking about his father's experiences, Igor said\n(\nsee\n[\n1\n]\n)\n:-\n[\nThere\n]\nwas threat of execution, for example. ... Simply, because some party came to town, or hostages were taken, or just in case, or because you had boots. My father was twice taken to be shot, he said. And once it all ended up in him being inspected. They checked what they could take from him and whether it was worth shooting him. And when they saw that he had shoes - not boots - he was let go.\n[\nThere was\n]\nhunger, typhus, death of people in masses.\nAs a young man Rostislav Stepanovich had thought about entering a monastery but the events of the civil war had made him become less religious. Igor's mother, Yulia Yacovlevna, had a degree in philology from the Bestuzhev Institute for Women in St Petersburg. She was a talented musician who had studied the piano under Theophil Richter, an organist and composer, the father of Sviatoslav Theophilovich Richter\n(1915\n-\n1997)\n, one of the leading pianists of the\n20\nth\ncentury. The Richter family were close friends of the Shafarevich family, and Igor and Sviatoslav spent much time together as they were growing up.\nAt the time that Igor was born, his father was working in Moscow and the family lived in a room in a communal apartment there. Yulia Yacovlevna's father was the director of the State Bank in Zhytomyr, the town where Yulia Yacovlevna had lived. He had a large flat in the town and Yulia Yacovlevna had returned to her parents' home for the birth of her child. Sviatoslav Richter, like Igor, was born Zhytomyr which was the Richter's home town. Igor and his mother soon returned to their room in the Moscow apartment and it was in Moscow that Igor was brought up. As a child, Igor was taught by his parents so when it came time for him to attend school he could already read and write, so was put straight into the second class.\nShafarevich's first love was history and literature. His love of literature began when he read fables as a child. He read of the Greek legends, the Russian fables and the German fables of the brothers Grimm. These not only gave him a love of literature but also an international perspective. Reading was easy for Shafarevich since his parents had many books in their apartment. Reading a history book made him think of becoming an historian\n(\nsee\n[\n1\n]\nor\n[\n15\n]\n)\n:-\nWhat I wanted to be at first was a historian. Some book on history came into my hands. Not even all that interesting. A translation from German on history of antiquity for grammar schools. And suddenly I felt that the world was not limited to what is around me but extended in all directions in time and space. I discovered for the first time for myself that I and those surrounding me are only one link in an endless chain of generations. I instantly fell in love with history, up to the point of immersing myself in it.\nSuddenly, when he was around twelve years old, his passion for history suddenly changed and he developed a passion for mathematics. By this we certainly don't mean to suggest that he lost his interest in history, for all his life his main interests other than mathematics were history and music. The reason for suddenly realising that he wanted to devote his life to mathematics was something that he never fully understood\n[\n15\n]\n:-\nI tried to remember how I turned to mathematics and could not recall the logic or reason for it, though I think that to work on history then would really have been hard. It was considered an ideological discipline, and the possibility of choice of various points of view was very limited. I could hardly have understood that as a\n10\n-\n12\n-year-old boy, but maybe I felt it subconsciously.\nHe demonstrated mathematical gifts at this early age, a gift which was nurtured by his parents. He read mathematical textbooks independently but was unsure whether he had really understood them. In\n1938\n, he decided that he would seek help from the university so he approached the dean at Moscow University and explained his position. The dean, realising that he had a very talented youngster in front of him, suggested that he could enrol Shafarevich as an external student even though he was still a schoolboy. He then sent Shafarevich to\nBoris Nikolaevich Delone\nwho examined him in analytic geometry. Next he went to\nAleksandr Gennadievich Kurosh\nwho examined him in algebra, and finally he went to\nIsrail Moiseevic Gelfand\nwho examined him in analysis\n[\n15\n]\n:-\nThey were very cordial and good towards me, they worked a great deal with me, i.e., gave me a lot of literature to read on top of what was required. ... I consider\nDelone\nand\nKurosh\nmy teachers. They represented not just two different, but two diametrically opposite mathematical types.\nDelone\nwas a classical representative of the Petersburg school. He was interested in Diophantine analysis of a very classical type. ... But\nKurosh\nwas, on the contrary, a radical. He told me that mathematics can be divided into two parts: philosophy and accounting. All formulae, integrals - that was accounting. And everything that existed before the twentieth century had already lost its interest. ... This two-sided influence helped me in some sense to find a middle road. ...\nDelone\ngave me two particularly good pieces of advice: one was to read\nHilbert\n's 'Zahlbericht'\nⓉ\n(\nReport on number\n)\n, and the second to read\nGauss\n.\nThese works were to have a long-lasting influence on his future mathematical activities. Now Shafarevich's parents worried that his school studies would suffer if he spent all his time on university level mathematics so they only agreed to him undertaking these mathematical studies on the condition that he studied geometry in English and algebra in German. Shafarevich left school in\n1939\nafter completing the ninth grade and never took the examinations for his high school diploma but, having taken most of the university examinations, went straight into the final undergraduate year at Moscow University. He graduated with his university diploma in\n1940\naround the time of his seventeenth birthday and began undertaking research advised by\nGelfand\nand\nKurosh\n.\nThe Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the World War II had little effect on life in Moscow and, in particular, none on Shafarevich's undergraduate year and his first year as a research student. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. Shafarevich recalled what happened next\n(\nsee for example\n[\n1\n]\n)\n:-\n... all the postgraduate students were called together and it was announced that we were being enlisted in the so-called 'People's Militia'. They told us that we were first being sent to the barracks, where we would go through a short training course, and then we would perhaps live at home but be periodically on duty guarding various objects in Moscow. Then my teachers\nB N Delone\nand\nA G Kurosh\nwrote a letter to the district committee\n(\nthe militia was being formed by the district committees\n)\nwith an appeal to let me return to graduate school and I was deferred. Soon I was mobilized to dig antitank ditches in the district of Borodino. This work continued for more than two months, until an artillery barrage could be heard from the direction of Moscow. We were ordered to move to Mozhaisk, and from there, under bombing by German planes, we returned by train to Moscow.\nHe returned to Moscow on\n15\nOctober\n1941\nto learn that the German army was already into the outskirts of the city. Back in his home he met up with Sviatoslav Richter who was still living there and they decided to go for an expedition together and took a train journey. Leaving the train, they were walking about\n40\nkm from Moscow when they were stopped by a group of peasants. Richter explained what happened\n(\nsee for example\n[\n1\n]\n)\n:-\n[\nThe peasants\n]\ntook us to be saboteurs or spies sent by Hitler and bundled us off to the nearest police station. They discovered the word 'German' on my ID card. And when he saw Shafarevich's, the chief of police couldn't conceal his surprise: 'What's all this, then? Nineteen and already in your second year at university? ... I tried to explain: 'It's because he's very gifted. ...' Shafarevich found this irresistible and burst out laughing. The police chief, who had been extremely threatening until now, suddenly relaxed: 'You know what you're going to do? Get on the first train home without delay.' ... it was two in the morning when we finally got back to the Shafareviches', where I was staying at the time.\nThe university was evacuated to Tashkent in Uzbekistan, so Shafarevich went there. This may have been fortunate since late in\n1941\nSviatoslav Richter's father, who was living at the Shafarevichs' home, was arrested and shot as a German collaborator. When the Shafarevichs' home was searched, they found German mathematics books that Shafarevich had studied and took them away as evidence but later they were returned and the Shafarevichs had no serious problems from the secret police. The main part of Moscow University later operated in Ashkhabad and still later in Sverdlovsk. Shafarevich spent time in both these places, in particular during the time that the university was in Ashkhabad in\n1942\nhe was awarded his candidate's degree\n(\nequivalent to a Ph.D.\n)\n. During this latter stage of his research, he had not had\nGelfand\nas an advisor as he had moved to a different city, so his only advisor had been\nKurosh\n.\nBy\n1944\nShafarevich had begun teaching in the Mechanics and Mathematics Department\n(\nMeh-Mat\n)\nof Moscow University. He was awarded the Doctor of Science degree in\n1946\nat the age of\n21\nand became an associate at the Steklov Institute of the USSR Academy of Sciences. However, in\n1949\nhe, along with a number of his colleagues, was fired\n[\n15\n]\n:-\nIt seems that if a teacher had many students, that was considered bad. The desire was for a more bureaucratic way. All should have the same number of students. Many that had part-time positions were fired. It is not as though we were stripped of our jobs. ... I continued to work in the Steklov Institute. Foreign mathematicians phoned me asking whether I couldn't feed my family. That was never the case. In\n1949\nthere was no rule that you couldn't teach somewhere else, but many of those who worked somewhere else and also taught at Meh-Mat were fired.\nShafarevich was reinstated in\n1953\n. His life and career, however, are inextricably bound with the political upheaval that befell the Former Soviet Union. His attitude to the political situation around\n1955\nis described by his student\nIlya Piatetski-Shapiro\n(\nsee, for example\n[\n1\n]\n)\n:-\nI remember that our conversations were not restricted to mathematics, and after finishing our mathematical discussions we frequently turned to politics. Shafarevich, a son of a professor, was a well-educated man who knew French and German. Even then, he made it clear that he disliked the October Revolution. Of course, he did not say it explicitly, which would have been dangerous. At that time, during Stalin's rule, no one could dream of being a dissident. However, it was clear to me that Shafarevich had negative feelings for Communism. Of course, he never was a member of the Communist Party. More interestingly, he was against all revolutionary movements in principle. At that time, Dostoevskii was not easily available in Russian, but Shafarevich quoted the very negative depiction of revolution from the famous novel 'Devils'.\nIn\n1972\n, he became an active participant in the group of dissidents of which Solzhenitsyn was a leading member. As a consequence, he was dismissed from the University of Moscow in\n1975\n. He described the events surrounding this\n(\nsee for example\n[\n15\n]\n)\n:-\nI published a book on socialism and a series of nonmathematical articles. I collaborated with Solzhenitsyn, with Sakharov. And me, a university professor, teaching students! It was of course a strange phenomenon. ...\n[\nThat I wasn't dismissed sooner\n]\nwas purely due to\nIvan Georgievich Petrovsky\n. He would say to me: \"You know they ask me for your blood.'\" And I would answer: \"What's to be done. They ask - so spill it.\" \"No, no, no. You know, I use ruses. I tell them that the students like you, who knows what would happen if you were dismissed, it isn't convenient to do it in the middle of the academic year. ... By the end of the year, they have forgotten.\" That was my last conversation with\nPetrovsky\n. ... his successor, Khokhlov, also managed to delay it for some time.\nIn\n1980\n, he published a book entitled\nThe Socialist Phenomenon\n. This was an elaboration of his essay which first appeared in the collection titled\nFrom under the Rubble\n. He continued his political involvement by publishing the book entitled\nRussophobia\nin\n1989\n. This proved offensive to many readers who saw in it elements of racism and it provoked extensive discussion coupled with censure. He wrote a defence of his right to express his ideas freely.\nHis mathematical research has been universally recognized. He made major contributions to the inverse problem of\nGalois theory\nas well as to class field theory, thereby solving some long outstanding conjectures. More recently he made important advances to\nalgebraic geometry\n. Perhaps the best summary of his mathematical contributions is Igor Dolgachev's review of\n[\n2\n]\n. We quote an extract:-\n... the impact of a mathematician's work on the progress of mathematics has nothing to do with the length of the list of his published papers. During his long mathematical life Shafarevich published no more than\n50\nresearch papers, but the influence of many of them on the development of number theory, group theory and algebraic geometry is difficult to overestimate. The highlights of Shafarevich's contribution to these fields can be briefly summarized as follows. In number theory: the theory of p-extensions of number fields, explicit forms of general reciprocity law, solution of the inverse\nGalois\nproblem for solvable groups\n(1946\n-\n1954)\n, solution of the class field tower problem\n(\nwith Evgenii Solomonovich Golod,\n1964)\n, the work on the arithmetic of elliptic curves over number fields\n(1957\n-\n1967)\n. In group theory: the work with Golod and\nAleksei Ivanovich Kostrikin\non the\ncohomology\nof groups\n(1957\n-\n64)\n, the work with\nKostrikin\nand Alexei N Rudakov on\nCartan\npseudogroups and\nLie algebras\nover fields of positive characteristic\n(1966\n-\n69)\n. In algebraic geometry: the theory of principal homogeneous varieties of abelian varieties over function fields\n(1961)\n, the theory of elliptic surfaces, a reconstruction of the results of the Italian school of algebraic geometry on classification of algebraic surfaces\n(\nwith his students\n)\n(1964\n-\n65)\n, the periods and arithmetic of K\n3\nsurfaces\n(\nwith\nIlya Piatetski-Shapiro\n,\n1970\n-\n73)\n, K\n3\nsurfaces over fields of positive characteristic\n(\nwith Alexei N Rudakov,\n1976\n-\n1984)\n.\nBoth his books and articles are widely read and acclaimed. See\nTHIS LINK\nfor extracts from reviews and Prefaces of some of his books.\nHe was outstanding as a lecturer and teacher and his mathematical writings are praised for their clarity and incisiveness. His students report that their association and supervision by Shafarevich were among the happiest of their professional careers.\nIndeed his work was recognized abroad by his appointment as a foreign member of the\nNational Academy of Sciences\nof the USA in\n1974\n. In addition to his election to membership of the\nNational Academy of Sciences\nof the USA, Shafarevich has been elected to the\nAcademy of Sciences of the USSR\n, the\nAmerican Academy of Arts and Sciences\n, the\nRoyal Society of London\n, the\nGerman Academy Leopoldina\n, the\nItalian Accademia dei Lincei\nand the Serbian Academy of Sciences and Arts. Among the many prizes he has received, we mention the Lenin Prize and the Heinemann Prize of the\nGöttingen Academy of Sciences\n. He has been made an honorary member of the\nLondon Mathematical Society\n. The University of Paris awarded him an honorary doctorate.\nWe have already indicated that Shafarevich loved history, literature and music. One hobby that we should also mention is that of hiking. When he was younger he loved hiking in the mountains, a passion which was due to the influence of\nDelone\n[\n1\n]\n:-\nDelone\nhimself reminisced how he, Shafarevich who was \"still a boy\", and a mathematician named Sergei Mikhailovich Nikolskii once walked a full\n110\nkilometres in one go, making just short breaks for eating and swimming in the middle.\nShafarevich was married to Nina Ivanova, who taught at the Moscow State Engineering Physics Institute. They had a son Andrei Igorevich Shafarevich, born in\n1963\n, who is a physicist. They also had a daughter."
}