{
  "nome_completo": "Ioan Mackenzie James",
  "nome_curto": "Ioan James",
  "ano_nascimento": "1928",
  "ano_morte": "2025",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/James/",
  "lugar_nascimento": "Croydon, Surrey, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Ioan James\nwas a Foundation Scholar at St Paul's School. From there he won an Open Scholarship to the University of Oxford where he studied mathematics at Queen's College in the\ntopology\nschool of\nHenry Whitehead\n.\nAfter completing his education at Oxford, James went to the United States for the year\n1954\n-\n55\n. He did this having been awarded a Commonwealth Fund Fellowship which enabled him to spend time at Princeton University, the University of California at Berkeley and the Institute for Advanced Study at Princeton. Returning to England, James was Tapp Research Fellow at Gonville and Caius College in Cambridge in\n1956\nbefore returning to the University of Oxford.\nBack at Oxford in\n1957\n, James was appointed Reader in Pure Mathematics, a post which he held until\n1969\n. From\n1959\nuntil\n1969\nhe was a Senior Research Fellow at St John's College. In\n1970\nJames was appointed to the famous chair of Savilian Professor of Geometry. The chair was founded by\nSavile\nin\n1619\nand first occupied by\nBriggs\n.\nJames was elected a Fellow of New College Oxford in\n1970\nwhen he became Savilian Professor of Geometry and he continues to hold the fellowship. He retired as the Savilian Professor of Geometry in\n1995\nand became professor emeritus.\nJames has done wide ranging work in topology, particularly in\nhomotopy theory\n. His first publication was in\n1953\n, followed by four publications in\n1954\nwhich were all written jointly with\nHenry Whitehead\n. These papers were on fibre spaces and the homotopy theory of sphere bundles over spheres. James then published on suspensions, on multiplication on spheres, on cup-products, and, another publication with\nHenry Whitehead\n,\nHomology with zero coefficients\n. He then wrote many papers on homotopy groups and Stiefel\nmanifolds\n.\nThe mathematical works of\nJ H C Whitehead\nappeared in four volumes in\n1962\nand\n1963\nedited by James. These volumes covered\nHenry Whitehead\n's work in\ndifferential geometry\n, complexes and manifolds, homotopy theory, and\nalgebraic\nand classical topology.\nIn\n1976\nJames published\nThe topology of Stiefel manifolds\nwhich was based on his lecture notes. A reviewer wrote:-\nThere are a number of fascinating problems concerning the Stiefel manifolds which are of importance in the geometric applications of homotopy theory, and in homotopy theory itself. These lecture notes present, and solve, some of these problems\n(\nmany of which the author has worked on\n)\n, bringing in the necessary tools\n(\ne.g. K-theory characteristic classes, J-theory,\nSamelson\nproducts\n)\nas needed.\nGeneral topology and homotopy theory\n(1984)\n, another book by James which was based on his lectures, is described as follows:-\nIn this monograph, based on a set of sixteen lectures to students, the author expounds certain parts of\ngeneral topology\nwhich are particulary relevant to homotopy theory. His book is reasonably self-contained. It is tightly written and elegant. ... This is a beautifully written and much needed book, both as a text and as a reference. It will probably become a classic.\nIn\n1987\nJames published\nTopological and uniform spaces\nwhich was written for advanced undergraduates or new graduate students.\nFibrewise topology\n(1988)\nis a treatise on general topology, uniform spaces, and homotopy theory from the point of view of fibres.\nIntroduction to uniform spaces\n(1989)\nis again based on lectures given by James at the University of Oxford. James published\nHandbook of algebraic topology\nin\n1995\n.\nIn the late\n1950\ns\nHenry Whitehead\napproached Robert Maxwell, the chairman of Pergamon Press, to start a new journal\nTopology\nalthough\nWhitehead\nnever lived to see the first part appear. James became an editor of\nTopology\nin\n1962\nand he has continued in that role ever since. On the\n25\nth\nanniversary of the founding of the journal, James gave an address in which he related much of the early history of the publication with which he has been so closely associated. The address has been published, see\n[\n2\n]\n.\nJames has received many honours for his major contributions to mathematics. In\n1968\nhe was elected a fellow of the\nRoyal Society of London\n. Other honours have been the Junior Berwick Prize from the London Mathematical Society in\n1959\nand the Senior\nWhitehead\nPrize from that Society in\n1978\n. He served the\nLondon Mathematical Society\nin a number of ways, in particular as treasurer from\n1969\nto\n1979\nand as the\n62\nnd\npresident of the Society from\n1984\nto\n1986\n.\nAmong other honours he has received have been an honorary fellowship from St John's College Oxford in\n1988\n, an honorary professorship from the University of Wales in\n1989\nand an honorary doctorate from the University of Aberdeen in\n1993\n.\nOver the last ten years, James has produced a number of outstanding historical studies. In\n1999\nhe edited\nHistory of topology\nand contributed three chapters to the book:\nFrom combinatorial topology to algebraic topology\n;\nTopologists at conferences\n; and\nSome topologists\n. In\n2001\nhe published\nPortrait of Alexander\n(1888\n-\n1971)\n. The introduction reads:-\nThe first half of the twentieth century was a golden age for Princeton mathematics. This was especially true of topology, and the prince of Princeton topologists for most of that time was\nJames Waddell Alexander\n. What has hitherto been published about him hardly does justice to one of the most interesting and important American mathematicians of that period. The available material is not only scanty and fragmentary but also quite hard to find. The following short memoir will, I hope, go some way towards filling the gap.\nIn\n2002\nJames published\nRemarkable mathematicians : From Euler to von Neumann\n. This excellent collection of sixty biographies makes very enjoyable reading. A deeper look at twenty mathematical personalities occurs in James' book\nThe mind of the mathematician\n(2007)\nwritten jointly with Michael Fitzgerald. One of the main themes of the book is that most mathematical geniuses showed some symptoms of the Asperger syndrome. This theme is explored in another recent book by James,\nAsperger's Syndrome and High Achievement : Some Very Remarkable People\n(2005)\n. James'\nRemarkable mathematicians\nis in fact the first of a \"Remarkable\" collection of books by James. He published\nRemarkable Physicists : From Galileo to Yukawa\nin\n2004\n,\nRemarkable Biologists : From Ray to Hamilton\nin\n2009\n, and a further work\nRemarkable Engineers : From Riquet to Shannon\nis about to be published. Another recent book by James\nDriven to Innovate: A Century of Mathematicians and Physicists\n:-\n... celebrates the extraordinary contribution made by Jewish people in mathematics and physics, from the mathematician\nNorbert Wiener\n, the founder of cybernetics, to distinguished nuclear physicist and Nobel Prize-winner\nNiels Bohr\n. He tells the life-stories of thirty-five men and women, born in the nineteenth century, who were at the forefront of research in the closely related fields of mathematics and physics, often in the face of various kinds of anti-Semitism."
}