{
  "nome_completo": "Ivar Otto Bendixson",
  "nome_curto": "Ivar Bendixson",
  "ano_nascimento": "1861",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bendixson/",
  "lugar_nascimento": "Bergshyddan, Djurgården, Sweden",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "Ivar Bendixson\n's father was Vilhelm Emanuel Bendixson, who was a merchant, and his mother was Tony Amelia Warburg. Ivar was born into a middle class family. After attending a new primary school, Ivar studied at a secondary school in Stockholm. On completing his schooling, he obtained his school certificate on\n25\nMay\n1878\nand, on the\n13\nSeptember of that year, he enrolled in the Royal Technological Institute. We should note that Royal Technological Institute is a literal translation of \"tekniska högskola\" which literally means Technical High School but to call it a high school in English would be misleading.\nIn\n1879\nBendixson went to Uppsala University, the oldest institution of higher learning in Sweden, and he graduated with the equivalent of a Master's degree on\n27\nJanuary\n1881\n. Stockholm University was the third university in Sweden and it was planned from\n1865\nbut it did not open until\n1880\n. We note that although we shall refer to it here by its present name of Stockholm University, it was known in Sweden as Stockholms Högskola until\n1950\nwhich literally means \"Stockholm High School\". By the time Bendixson graduated from Uppsala, Stockholm University was open and he studied there. After studying in Stockholm, he was awarded a doctorate by Uppsala University on\n29\nMay\n1890\n.\nOn\n10\nJune\n1890\nBendixson was appointed as a\ndocent\nat Stockholm University. He then worked as an assistant to the professor of mathematical analysis from\n5\nMarch\n1891\nuntil\n31\nMay\n1892\n. From\n1892\nuntil\n1899\nhe taught at the Royal Technological Institute in Stockholm and he also taught calculus and algebra at Stockholm University. During this period he married Anna Helena Lind on\n19\nDecember\n1887\n. Anna, who was about eighteen months older than Bendixson, was the daughter of the banker Johan Lind.\nIn\n1899\nBendixson substituted for the Professor of Pure Mathematics at the Royal Technological Institute and then he was promoted to professor there on\n26\nJanuary\n1900\n. On\n16\nJune\n1905\nhe became professor of higher mathematical analysis at Stockholm University and from\n1911\nuntil\n1927\nhe was rector of the University.\nBendixson showed his exceptional talent for mathematics from the beginning of his student days and, as he progressed, these talents became more and more obvious. He also started out very much as a pure mathematician but later in his career he turned to also consider problems from applied mathematics. His first research work was on set theory and the foundations of mathematics, following the ideas which\nCantor\nhad introduced. He contributed important results in point set topology.\nAs a young student Bendixson made his name by proving a theorem which he included in a letter which he wrote to\nCantor\n, the letter being published in Volume\n2\nof\nActa Mathematica\n. This theorem states\n[\n1\n]\n:-\n... every uncountable closed set can be partitioned into a perfect set and a countable set.\nThe perfect set in this partition is, in today's terminology, the Bendixson derivative of the original set. Hence the derived set is either of\nBaire\nclass\n1\nor\nBaire\nclass\n2\n. The proof of the theorem which Bendixson gave uses\nCantor\n's notion of transfinite numbers. He also gave another important contribution to the theory of perfect point sets when he gave an example of a perfect set which is totally disconnected.\nBendixson also made interesting contributions to algebra when he investigated the classical problem of the algebraic solution of equations.\nAbel\nhad shown that the general equation of degree five could not be solved by radicals, while\nGalois\nhad developed\nGalois\ntheory which determined which equations could be solved by radicals. Bendixson returned to\nAbel\n's original contribution and showed that\nAbel\n's methods could be extended to describe precisely which equations could be solved by radicals.\nAbel\nhimself had written shortly before his death that he hoped to be able to achieve this, and it is interesting that Bendixson was able to do so using\nAbel\n's methods. However, his reason for undertaking this work seems more to do with his treating\ngroup theory\nwith suspicion rather than trying to justify\nAbel\n's approach. Bendixson published these results in\nActa Mathematica\nand it is worth noticing that he was prepared to accept the new ideas of set theory but not of group theory.\nIn fact Bendixson was a frequent contributor to\nActa Mathematica\n, the journal founded by his colleague\nMittag-Leffler\n. Bendixson is probably best remembered for the\nPoincaré\n- Bendixson theorem. We shall say a little about how Bendixson came to prove this result. This came about because of his work in real analysis. In this area he first studied uniform convergence of series of real functions and took an important step towards giving precise conditions when the limit function of continuous functions is continuous. In examining periodic solutions of\ndifferential equations\nBendixson used methods based on\ncontinued fractions\n. These methods had first been used by\nLegendre\nto prove that\ne\nand π are irrational.\nThe analysis problem which intrigued Bendixson more than all others was the investigation of integral curves to first order differential equations, in particular he was intrigued by the complicated behaviour of the integral curves in the neighbourhood of singular points. This important problem was first studied by\nBriot\nand his friend\nBouquet\nand, before Bendixson worked on it, had recently been investigated by\nPoincaré\n.\nPoincaré\nhad obtained a qualitative description of the integral curves but it was Bendixson who gave a quantitative description near the singular points.\nThe\nPoincaré\n-Bendixson theorem, which says an integral curve which does not end in a singular point has a limit cycle, was first proved by\nPoincaré\nbut a more rigorous proof with weaker hypotheses was given by Bendixson in\n1901\n. To do this Bendixson used successive approximations. Realising the extreme difficulty of the general case, he specialised to the case of real integral curves. In that case he was able to give precise results in the neighbourhood of a singular point, completely solving the\nBriot\nand\nBouquet\nproblem.\nGårding\nwrites in\n[\n2\n]\n:-\nThe greater part of this theory has later entered into the textbooks, and in this way it has shared the fate of a large part of mathematics, namely to melt into a growing mathematical general knowledge where the originators are not mentioned.\nBendixson became more involved in politics as his career progressed. He was well known for his mild left-wing views and he put his beliefs into practice being head of a committee to help poor students. He served on many other committees and he was an advisor to a committee which investigated a proportional representation voting system in Sweden in\n1912\n-\n13\n. In this capacity he was able to make use of his mathematical skills in advising the committee.\nZeilon writes in\n[\n1\n]\nthat Bendixson:-\n... belonged to a groups of important mathematicians who are tied to the development of the newly built university in Stockholm. From\n1882\nhe was affiliated with the university, first as a student, then as a teacher.\nAs a teacher Bendixson was always well prepared. He not only taught well but he also wrote well\n[\n1\n]\n:-\nStylistic elegance was particularly apparent in his scientific work.\nFor his outstanding contributions, Bendixson received many honours including an honorary doctorate on\n24\nMay\n1907\n."
}