{
  "nome_completo": "John Edensor Littlewood",
  "nome_curto": "J E Littlewood",
  "ano_nascimento": "1885",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Littlewood/",
  "lugar_nascimento": "Rochester, Kent, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "J E Littlewood\n's parents were Edward Thornton Littlewood and Sylvia Maud Ackland. A very few close friends called him Jack when he was elderly, but otherwise he would be addressed as Littlewood, which was not unusual between friends at that time.\nHardy\nwith whom he had a close collaboration for many years would write to him as \"Dear L\".\nHis father Edward Thornton Littlewood was also a mathematician and was Ninth\nWrangler\nin the Mathematical Tripos at Cambridge in\n1882\n, three years before his eldest son John Edensor was born. Edward and Sylvia Littlewood went on to have three sons, their second being Martin Wentworth Littlewood, who went on to study medicine, and a third son who tragically died when he was eight years old by falling into a lake from a bridge. When John Edensor was seven years old his father had to make a choice between two offers he received, one of a Fellowship at Magdalene College, Cambridge, or the second the position of Headmaster at a new school in Wynberg in South Africa. He chose the second and in\n1892\nthe family sailed to South Africa.\nLittlewood later wrote\n(\nsee for example\n[\n7\n]\n)\n:-\nOur lives would have been very different in Cambridge. ... the children of dons acquire an easy self-confidence ... As it was I had a very happy childhood among mountains, the ocean, and a beautiful climate.\nIf the climate and scenery were superb, certainly the education that the young Littlewood had in South Africa was not. The quality of his school teachers was poor, and he was confused by the mathematics teaching that he received to the extent that he failed an arithmetic examination. He still did quite well and entered the University of Cape Town at a young age but again found that he was not able to benefit from teaching which was less than outstanding. His father soon realised that the University of Cape Town was not going to encourage his son's mathematical talents to blossom and Littlewood's parents made the decision to send their son back to England. We should mention that Littlewood, as we explain in more detail below, suffered from depression for most of his life, beginning while he was at school, and this may have contributed to his difficult days in the South African education system.\nIn\n1900\nLittlewood, then aged\n15\n, returned to England and entered St Paul's School in London. He was very fortunate to have there an outstanding teacher of mathematics\nFrancis Macaulay\n[\n7\n]\n:-\nThis was education with a university atmosphere; at no school could Littlewood have acquired a better foundation of self-reliance, knowledge and judgement. He understood uniform convergence, and he could discriminate between basic ideas and tricks of manipulation.\nWhile at St Paul's School in December\n1902\n, Littlewood won a scholarship to Cambridge.\nLittlewood entered Trinity College Cambridge in October\n1903\n. He wrote in\n[\n3\n]\n:-\nTo be in the running for Senior Wrangler one had to spend two-thirds of the time practising how to solve difficult problems against time ... I do not claim to have suffered high-souled frustration. I took things as they came; the game we were playing came easily to me, and I even felt a sort of satisfaction in successful craftsmanship.\nHis tutor at Trinity was\nWalter Rouse Ball\n, the author of the famous popular book\nMathematical Recreations and Essays\n. After being equal first in Part I, he completed Part II in\n1906\nand began research under the direction of his tutor\nE W Barnes\n. Rapidly solving the first problem which\nBarnes\ngave him, Littlewood was next presented with the\nRiemann hypothesis\nas his next research problem by\nBarnes\n. Swinnerton-Dyer, in a memorial address at Trinity College after Littlewood's death, said:-\nIt is an amazing illustration of the isolation and insularity of British mathematics at that time that\nBarnes\nshould have thought it suitable for even the most brilliant research student, and that Littlewood should have tackled it without demur.\nLittlewood never regretted having tackled the\nRiemann\nhypothesis, remarking that if one attempted a problem that was too difficult then one would always end up proving some interesting related results.\nFrom\n1907\nto\n1910\nhe lectured as Richardson Lecturer at the University of Manchester. He became a fellow of the Trinity College in\n1908\n, winning a Smith's prize in that year, then returning to Trinity in\n1910\nto fill the position left vacant when\nA N Whitehead\nwas essentially forced out of his job. Shortly after this, certainly by\n1911\nbut some suggest in\n1910\n, Littlewood began his famous collaboration with\nG H Hardy\nwhich we discuss in more detail below.\nIn World War I Littlewood served in the Royal Garrison Artillery. His contributions were highly significant and special allowances were made to keep him happy, such as letting him live with friends in London, and to carry an umbrella when in uniform! Littlewood himself described this war work in\n[\n14\n]\n. The result was that he improved the accuracy of anti-aircraft range tables and improved the formulae for finding the range, the time of flight and the angle of descent at the end of a trajectory with small elevation.\nE A Milne\nhas described how Littlewood was able to discover techniques which greatly reduced the amount of work needed for making these accurate calculation of missile trajectories. Trials were conducted to see if the results of Littlewood's predictions held in practice and,\nMilne\nwrites:-\n... to the astonishment and joy of all concerned the observed positions of the shellbursts fell exactly on Littlewood's trajectories, at the correct time-markings, within very small errors of observation.\nLittlewood become\nRouse Ball\nprofessor of mathematics in Cambridge in\n1928\n. This chair had been founded by a benefaction from\nWalter Rouse Ball\nafter his death in\n1925\n, and Littlewood was its first occupant. It was a particularly appropriate choice, not only because of his outstanding mathematical contributions, but also since Littlewood had been tutored by\nRouse Ball\nin his undergraduate days at Trinity. As\nRouse Ball\nProfessor, Littlewood could lecture on topics of his own choice and he no longer had to take part in routine teaching. It was an aspect which he enjoyed, delivering courses on his own wide areas of interest in analysis.\nAlmost all of Littlewood's mathematical research was in classical analysis, but in this area he looked at a remarkable range of subjects and he used an even broader range of techniques in proving his results. For\n35\nyears he collaborated with\nG H Hardy\nworking on the theory of series, the\nRiemann zeta function\n, inequalities, and the theory of functions. The collaboration led to a series of papers\nPartitio numerorum\nusing the\nHardy\n-Littlewood-\nRamanujan\nanalytical method. During the years of this collaboration Littlewood was seldom seen outside Cambridge, in fact there were jokes around that he was the invention of\nHardy\n. The real reason was rather a sad one, namely that Littlewood suffered from depression which we shall discuss more fully below. The rules that\nHardy\nand Littlewood adopted for their collaboration were spelled out by\nHarald Bohr\nin a lecture which he gave in\n1947\n(\nsee for example\n[\n11\n]\nwhere there is also an interesting discussion as to how far they stuck to their own rules and how far they ignored them\n)\n:-\nWhen one wrote to the other, it was completely indifferent whether what they wrote was right or wrong\n.\nWhen one received a letter from the other, he was under no obligation to read it, let alone answer it\n.\nAlthough it did not really matter if they both simultaneously thought about the same detail, still it was preferable that they should not do so\n.\nIt was quite indifferent if one of them had not contributed the least bit to the contents of a paper under their common name\n.\nIn\n[\n11\n]\nCartwright\nconjectures that these rules were actually agreed on by Littlewood and\nHardy\nin\n1912\n. We should also comment that if it seems strange that such a prolific mathematician as Littlewood has his collected papers published in only two volumes, this is because the large\nHardy\n-Littlewood collection of papers appears in\nHardy\n's collected works.\nIn the late\n1930\n's the Department of Scientific and Industrial Research tried to interest pure mathematicians in nonlinear\ndifferential equations\nwhich were important for radio engineers and scientists because they described the behaviour of electric circuits. The impending war motivated this interest and in\n1938\nthe Radio Research Board asked British pure mathematicians for help in dealing with certain types of nonlinear differential equations arising in radio engineering. Littlewood, working jointly with\nMary Cartwright\n, spent\n20\nyears working on equations of this type such as\nvan der Pol\n's equation. McMurran and Tattersall discuss this collaboration in\n[\n16\n]\n, and in particular the work on\nvan der Pol\n's equation is discussed in\n[\n17\n]\n. They write:-\nVan der Pol\n's experiments with nonlinear oscillators during the\n1920\ns and\n1930\ns stimulated mathematical interest in nonlinear differential equations arising in radio research. The problems caught the attention of British mathematicians\nM L Cartwright\nand J E Littlewood, initiating a collaboration that lasted more than ten years.\nCartwright\nand Littlewood's analysis of the\nvan der Pol\nequation and its generalizations led them to explore some interesting topological methods, including the development of a fixed-point theorem for continua invariant under a homeomorphism of the plane. They were among the earliest mathematicians to apply\nPoincare\n's transformation theory to the analysis of dissipative systems. Their research is among the earliest in large parameter theory and played a role in the development of the modern theory of\ndynamical systems\nand chaos theory.\nLittlewood was elected a Fellow of the\nRoyal Society\nin\n1915\n. He received the Royal Medal of the Society in\n1929\n, and the\nSylvester\nMedal of the Society in\n1943\n:-\n... in recognition of his mathematical discoveries and supreme insight in the analytic theory of numbers. ... Littlewood, on\nHardy\n's own estimate, is the finest mathematician he has ever known. He was the man most likely to storm and smash a really deep and formidable problem; there was no one else who could command such a combination of insight, technique and power.\nHe also received the Copley Medal of the Society in\n1958\n:-\n... in recognition of his distinguished contributions to many branches of analysis, including Tauberian theory, the\nRiemann\nzeta-function, and non-linear differential equations.\nAs we mentioned on a couple of occasions above, one problem which Littlewood had to cope with throughout his life was depression. It had affected him from his school days and continued to trouble him throughout his career. There is no evidence that it in any way impaired his ability to do mathematics, indeed it is hard to see how it could have done so given what he achieved, yet it certainly did much to spoil his social life for it had the effect of making him withdraw into himself. Although his mathematical research did not seem to suffer, it certainly stopped him from undertaking other mathematical activities which involved meeting people. For example he was able to say late in his life that he had never been secretary or chairman of any committee. In fact although he was President of the\nLondon Mathematical Society\nin\n1941\n-\n43\nhe never chaired a meeting, the vice-President taking the chair throughout his period of office.\nAfter he retired he did receive treatment for his depression which was quite effective, and after\n1957\nhe felt more able to accept invitations to visit colleagues. Indeed he made many visits to the United States in the ten years following\n1957\n. We note that his problems of meeting people did not extend to those whom he knew well, for example he fully participated in the conversations at dinner in Trinity and greatly enjoyed the company in the familiar surroundings.\nWe should end this biography by saying something about Littlewood's interests outside mathematics. He\n[\n7\n]\n:-\n... was slightly below average in height, strongly built and agile. At school he had been one of the best gymnasts and a hard hitting batsman. ... he was a keen follower of ball games and watched cricket at Fenner's on summer afternoons. He had an intense interest in music\n(\nclassical - particularly Bach, Beethoven and Mozart\n)\n; he had taught himself as an adult to play the piano ... He was best known to unmathematical undergraduates at Trinity for his skill in circling the seven yards of a pillar of the Library on the narrow ledge of its base and for his daily walk across the court to the baths, with a towel but no shirt. On most days he walked many miles in the country.\nHis\n[\n2\n]\n:-\n... muscular strength and quickness of reaction made for success in rock climbing and skiing, and he spent many holidays in Cornwall, Scotland and Switzerland.\nHe continued to produce excellent mathematical results for many years after he retired and even when ninety years old he was still sharp and able to come up with new deep ideas. In\n1970\nhe published a paper in which he wrote that he had solved a problem which:-\n... raised difficulties which defeated me for some time. I have now overcome them.\nIn addition to the honours which we have mentioned above, Littlewood was honoured with election to the\nAkademie der Wissenschaften\nin Göttingen in\n1925\n, the\nSwedish Academy\nin\n1948\n, the\nRoyal Danish Academy\nalso in\n1948\n, and the Dutch Academy in\n1950\n. In\n1957\nhe was elected to the Paris\nAcadémie des Sciences\nto replace\nFréchet\n. We mentioned above that Littlewood was President of the\nLondon Mathematical Society\n, but that Society also honoured him with its\nDe Morgan\nMedal in\n1938\nand its Senior Berwick Prize in\n1960\nfor two papers which he wrote on celestial mechanics.\nFinally we note that he received honorary degrees from the University of Liverpool in\n1928\n, the University of St Andrews in\n1936\nand the University of Cambridge in\n1965\n."
}