{
  "nome_completo": "Jacob ben Machir ibn Tibbon",
  "nome_curto": "Jacob ben Tibbon",
  "ano_nascimento": "1236",
  "ano_morte": "1305",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tibbon/",
  "lugar_nascimento": "Marseilles, Spain (now France)",
  "lugar_morte": "Montpellier, France",
  "biografia": "Jacob ben Tibbon\nis also known by the Latin version of his name,\nProphatius Judaeus\n, and in Provence he is known by the name\nDon Pro Fiat\n. The ibn Tibbon family were famed over several generations so we begin by looking at the ancestors of the subject of this biography. We begin with Judah ben Saul ibn Tibbon\n(1120\n-\n1190)\nwho was the great-grandfather of Jacob ben Tibbon. He lived for the first\n30\nyears of his life in Granada which at this time was a Muslim country. There was a thriving community of Jews in this part of Spain from around the year\n1000\n, many of whom made major contributions to the study of languages. The Almohads expelled the Jews from Muslim Spain in\n1148\n, and Judah ben Saul ibn Tibbon together with many other learned refugees, went to the south of France. He settled in Lunel where he translated philosophical works from Arabic into Hebrew. His son, Samuel ben Judah ibn Tibbon, was born in Lunel and continued his father's work of translating although he, like his father, was a medical doctor.\nSamuel ben Judah ibn Tibbon's son, Moses ben Samuel ibn Tibbon, was born in Marseilles. He again was a medical doctor who was famed as a translator from Arabic into Hebrew. He also translated Arabic-language works by Jews and Arabs dealing with philosophy, mathematics, astronomy, and medicine. One of the mathematical works he translated was\nEuclid\n's\nElements\n. Jacob ben Machir ibn Tibbon, the subject of this biography, was the son of Machir ben Judah ibn Tibbon, Samuel ben Judah ibn Tibbon's brother. He, like his father, was born in Marseilles and he continued the family tradition of being a distinguished member of the medical profession while at the same time making important contributions through translating.\nJacob was educated in Lunel and then studied medicine in the medical faculty of the University of Montpellier. Certainly by\n1266\nhe was in Gerona in the northeast of Spain just to the south of the Pyrenees. He lived there for at least a year but he then returned to Lunel, where he had family connections, and he also lived for long periods in Montpellier.\nJacob ben Tibbon is himself known as a translator as well as a mathematician and an astronomer. He translated into Hebrew many Arabic versions of Greek mathematical and astronomical works, including\nEuclid\n's\nElements\n,\nEuclid\n's\nData\n,\nEuclid\n's\nOptics\n,\nMenelaus\n's\nSpherics\n,\nAutolycus\nof Pitane's\nOn the Moving Sphere\n,\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nas well as certain Arabic works such as\nal-Haytham\n's\nConfiguration of the World\n(\nintended for the layman\n)\n, and works by al-Ghazali, al-Zarqali, and others. He also translated many works on philosophy and zoology. It is interesting to read a comment Tibbon makes in the Preface of his translation of\nEuclid\n's\nElements:-\nAnd here is geometry, the basis for all mathematical sciences, and this book is the basis, the root and the beginning for all later books on this science. I, Jakob ben Makir, have undertaken to translate it into our language ... in order to avoid the mockery of the Christians, who say that we lack to all sciences.\nNow Tibbon was much more than a translator, for he was a fine mathematician and astronomer writing original works in addition to the translations. For example, he wrote\nJacob's Quadrant\nin which he describes a quadrant of his own invention. This work contains a table of\n11\nfixed stars which are to be used in the construction of the instrument which was later called the\nquadrans novus\n(\nnew quadrant\n)\nto differentiate it from the traditional quadrant or\nquadrans vetus\n(\nold quadrant\n)\n. Vernet writes in\n[\n1\n]\n:-\nExamples of the quadrans novus  have been preserved, and it apparently was much used in its time. It consists of a simplification of the face of the astrolabe by means of two successive rebates that have their axes the north-south and east-west lines. Whatever connections may exist between this apparatus and similar instruments used by the Arabs have not been clearly established.\nJacob ben Tibbon also wrote\nLuhot\n(\nTables\n)\na book of astronomical tables giving\nascensions\nof certain stars at Paris. These tables are mentioned in Dante's\nDivine Comedy\n.  The Italian astronomer Andalo di Negro wrote\nCanones Super Almanach Profatii\nin\n1323\nwhich dealt with Jacob ben Tibbon's tables in\nLuhot\n.\nAnother work by Jacob ben Tibbon was\nAlmanach Perpetuum\nwhich, as the title indicates, was a work on the almanac. It was written for users in Montpellier, indicating that he was living and working there at the time, and the calculations begin with data for\n1\nMarch\n1300\n. There has been a considerable debate among historians as to the basis for the tables. At the time Tibbon wrote the work both the Toledan Tables of Arzachel and the newer Alfonsine Tables created for King Alfonso X of Castile were in use. Tibbon appears to state that he used the Toledan Tables but\nPierre Duhem\ncriticised him for using 'old' tables instead of the latest available to him. Thorndike, in\n[\n6\n]\n, defends Tibbon with a number of points, but also suggests that Tibbon may have meant the Alfonsine Tables rather than the Toledan Tables. Harper's analysis in\n[\n4\n]\nsuggested that Tibbon's\nAlmanach\nwas based on original work but Toomer in\n[\n8\n]\ndemonstrates errors in Harper's calculations. Toomer concludes:-\n... in the introduction to the Latin version of the Almanach\n[\nit is written\n]\nthat the author had based his work on the Toledan tables. Since all mention of the Toledan tables is absent from the Hebrew version, I had previously supposed that this was a mistaken interpolation by the person responsible for the Latin version. I now believe that it stems from Prophatius\n[\nTibbon\n]\nhimself, and that he did indeed use the Toledan tables as the basis for his Almanach.\nTibbon's work was used by\nCopernicus\nin forming his theories."
}