{
  "nome_completo": "Jacques Ozanam",
  "nome_curto": "Jacques Ozanam",
  "ano_nascimento": "1640",
  "ano_morte": "1718",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ozanam/",
  "lugar_nascimento": "Sainte-Olive, Bresse, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jacques Ozanam\n's family had originally been Jewish but several generations earlier had become Christian converts and joined the Roman Catholic Church. It was a wealthy family, members having frequently served in the French provincial Parlements, with Jacques' father owning substantial lands. Jacques was the younger of his parents two sons, so would not have inherited the family estates, these would have gone to his elder brother. One of the expected routes for the younger son of the landed gentry would be to join the Church and indeed this is exactly what Jacques' father expected of him.\nAlthough his education was aimed towards the study of theology, Jacques developed a liking for other topics, particularly science and mathematics. He had very little tuition in mathematics, however, so he made efforts to teach himself. At one stage he did receive a little help with his mathematics from a tutor, but basically he was self taught in mathematics. At the age of around fifteen he produced his first substantial piece of mathematics which he wrote up. The other subjects which interested him at this stage were chemistry and mechanics but, in order to continue to receive his father's financial support, he had little option but to follow his father's wishes and begin to study theology.\nThe thoughts of becoming a priest did not suit Ozanam who seems to have enjoyed socialising, enjoyed gambling, and enjoyed spending money. Schaaf writes in\n[\n1\n]\n:-\n... probably he was too tolerant to have made a good churchman of his day.\nAfter Ozanam had been studying theology for four years his father died and suddenly the pressure to join the priesthood was removed. He could now follow the path which he wanted, so he gave up theology and devoted himself to the study of mathematics and the sciences. Being from a wealthy family he had been able to live in style and he had studied mathematics out of love for the subject, never seeing it as a means to earn a living. He even seems to have felt that someone who truly loves their subject would lower themselves by charging to impart this knowledge to others, so when he began teaching mathematics in Lyon he made no charge for his services.\nHaving principles about not charging for teaching mathematics was one thing when Ozanam had plenty of money to live on, but after his father died and his elder brother inherited the family estates his income from his family stopped. Also he still had an extravagant lifestyle, spending much on gambling, so he began charging for the mathematics tuition he gave. As Riddle put it\n[\n4\n]\n:-\n... the stern realities of distress would speedily dissipate all illusions about the dignity of teaching science for its own sake.\nIn\n1670\n, while teaching in Lyon, he published\nTable des sinus, tangentes, et sécantes\nⓉ\n(\nTable of sines, tangents, and secants\n)\na work which contained trigonometric tables more accurate than those of\nBriggs\n,\nVlacq\nand\nPitiscus\n.\nOzanam was a generous man, despite always being short of money, and it was an act of great generosity which led to him moving from Lyon to Paris. One day Ozanam met two strangers who did not have sufficient money to allow them to return to Paris. He gave them a loan of money to fund their return trip to Paris without any real guarantee that it would be repaid. After the two returned to Paris they told a friend, M. Daguesseau, about Ozanam's generosity. M. Daguesseau was the father of the French Chancellor, and when he learnt of Ozanam's generosity towards his father's friends, he invited him to Paris.\nOf course Paris was a place where someone like Ozanam would find it easy to spend money, and indeed he did. He brought in a good income from his teaching, but equally he found it easy to spend everything he had on frivolous amusement and gambling. He seems to have decided that marriage would bring a stability to his life which his nature made it hard for him to achieve as a single man. Indeed he did settle down after marrying\n[\n1\n]\n:-\n... a modest, virtuous young woman without means. Although his financial problems remained unsolved, the marriage was happy and fruitful; there were twelve children, most of whom died young. After his marriage Ozanam's conduct was exemplary; always of a mild and cheerful disposition, he became sincerely pious ...\nHe worked hard, teaching mathematics to many foreign pupils who came to Paris to be educated. He also wrote many works on mathematics, for example\nMéthode générale pour tracer les cadrans\nⓉ\n(\nGeneral method for drawing dials\n)\n(1673)\n,\nLa géométrie pratique du sr Boulenger\nⓉ\n(\nThe practical geometry of Jean Boulenger\n)\n(1684)\n,\nTraité de la construction des équations pour la solution des problèmes indéterminez\nⓉ\n(\nTreatise on the construction of equations for the solution of indeterminate problems\n)\n(1687)\n,\nTraité des lieux géométriques\nⓉ\n(\nTreatise on geometric loci\n)\n(1687)\n,\nTraité des lignes du premier genre\nⓉ\n(\nTreatise on lines of the first kind\n)\n(1687)\n,\nDe l'usage du compas de proportion\nⓉ\n(\nOn the use of the proportional compass\n)\n(1688)\n.\nAll his books sold well and ran to many editions, especially his famous works\nDictionnaire mathématique\nⓉ\n(\nMathematical dictionary\n)\n(1691)\n, the five volume work\nCours de mathématiques\nⓉ\n(\nMathematics lessons\n)\n(1693)\nand\nRécréations mathématiques et physiques\nⓉ\n(\nMathematical and physical recreations\n)\n(1694)\n. It is certainly for this last work on recreational mathematics that Ozanam will be most remembered. The precursor of books to follow for the next\n200\nyears, he published it in four volumes in\n1694\nand it later went through at least ten editions. Ozanam based his book on earlier works by\nBachet\n,\nMydorge\n, Leurechon, and Schwenter. It was later revised and enlarged by\nMontucla\n, then translated into English by\nHutton\n(1803\n,\n1814)\n. Riddle edited a new edition, which was published in\n1844\n, removing some old material and adding new material so that\n[\n4\n]\n:-\n... the work might continue to be to the present generation a useful manual of scientific recreation, as its predecessors have been to the generation which has passed.\nOzanam's original edition contained an early example of a problem about orthogonal Latin squares:-\nArrange the\n16\ncourt cards so that each row and each column contains one of each suit and one of each value.\nAnother topic from his books, which has been the subject of a relatively recent paper\n[\n5\n]\n, is contained in chapters in two of his works headed\nAbout some curious sundials\n. The geometry of these sundials, which could be adjusted to work at any latitude, is studied in\n[\n5\n]\nparticularly those types with hour-lines which were rectilinear, parabolic, elliptical, and hyperbolical.\nMontucla\n, who enlarged and improved Ozanam's book on recreational mathematics, gave this assessment of him in his\nHistory of Mathematics:-\nHe promoted mathematics by his treatise on lines of second order; and had he pursued the same branch of research, he would have required a more solid reputation than by the publication of his Cours, Récréations, or Dictionnaire mathématique; but having to look to the support of himself and family, he wisely consulted the taste of his purchasers rather than his own.\nIn one sense\nMontucla\nis certainly correct, but had he pursued research level mathematics and never written his recreational works, I\n[\nEFR\n]\ndoubt whether he would be in an archive such as this today for, as Schaaf writes in\n[\n1\n]\n:-\nBy almost any criterion Ozanam cannot be regarded as a first-rate mathematician ...\nHe did well in Paris after his marriage, having a high reputation as a teacher and as a popular writer of mathematical texts. His fortunes changed for the worse, however, in\n1701\n. His wife died in this year and he never really recovered from this tragedy. In the same year political events worked against him with the start of the war of Spanish succession. The French army led by Louis XIV invaded the Spanish Netherlands which resulted in an anti-French alliance being formed on\n7\nSeptember\n1701\nby England, and the Dutch Republic. Later by Portugal, Prussia, Hanover and others joined the alliance against France. The effect was that most foreign students, finding that their country was at war with France, left Paris. Ozanam's income from his tutoring, which was mainly to foreign students, dropped dramatically. He still continued to publish books, however, such as the two volume text\nNouveaux Eléments d'Algèbre\nⓉ\n(\nNew Elements of Algebra\n)\npublished in Amsterdam in\n1702\n, and other texts which we mention below.\nThe year\n1701\nwas also not entirely bad for Ozanam for in that year he was admitted as an élève in the\nAcadémie Royale des Sciences\n. He received further distinction from the Academy over the last few years of his life being made an élève géomètre in\n1707\n, and finally associé mécanicien in\n1711\n.\nAs well as mathematics, Ozanam was also interested in cartography and military engineering. To illustrate the range of his interests let us look briefly at his claims on the best substance to use in an hour glass. Domenico Martinelli had claimed that marble dust, lead or tin made the best substances for such a use. However Ozanam argued against Martinelli's ideas, claiming that well-dried, pulverized eggshell made a better substance for use in an hour-glass since it is less affected by humidity than most other substances.\nOzanam wrote many works on science and applications of mathematics including\nMéthode de lever les plans et les cartes de terre et de mer\nⓉ\n(\nMethod of surveying plans and maps of land and sea\n)\n(1691)\n,\nTraité de la fortification régulière et irrégulière\nⓉ\n(\nTreatise on regular and irregular fortification\n)\n(1691)\n,\nMéthode facile pour arpenter et mesurer toutes sortes de superficies\nⓉ\n(\nEasy method for surveying and measuring all kinds of areas\n)\n(1699)\n,\nLa perspective théorique et practique\nⓉ\n(\nTheoretical and practical perspective\n)\n(1711)\nand\nLa géographie et cosmographie qui traite de la sphere\nⓉ\n(\nGeography and cosmography which deals with the sphere\n)\n(1711)\n.\nFinally let us quote Riddle's description of Ozanam's character\n[\n4\n]\n:-\nHe was of a mild and cheerful temper, generous to the extent of his means, and of an inventive genius; and his conduct after marriage was irreproachable. He was devout, but averse to disputations about points of faith. On this subject he used to say, \"It is the business of the Sorbonne to discuss, of the Pope to decide, and of a mathematician to go straight to heaven in a perpendicular line.\""
}