{
  "nome_completo": "James Eells",
  "nome_curto": "James Eells",
  "ano_nascimento": "1926",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eells/",
  "lugar_nascimento": "Cleveland, Ohio, USA",
  "lugar_morte": "Cambridge, England",
  "biografia": "James Eells\nattended Western Reserve Academy\n[\n2\n]\n:-\n... until his exuberance led to his expulsion.\nHowever he still was accepted into Bowdoin College, Maine. After studying mathematics there he graduated in\n1947\nand decided to take a 'gap' year abroad. He went to Turkey where he taught mathematics at Robert College in Istanbul. Robert College is today Boğaziçi University\n(\nor Bosphorus University\n)\n. He returned to the United States in\n1948\nand was appointed as an instructor in mathematics at Amherst College in Amherst, Massachusetts. At this time Amherst was a men's college but it was here that he met Nan Munsell. They married in\n1950\nand had one son and three daughters.\nEells had not undertaken graduate studies up to this time but after two years teaching at Amherst he decided that he wanted to make a career in mathematics. He applied for graduate study at Harvard and there began research under\nHassler Whitney\n. He was awarded his doctorate in\n1954\nfor his thesis\nGeometric Aspects of Integration Theory\n. After spending a session at the Institute for Advanced Study at Princeton, he was appointed to the University of California at Berkeley. In these early years of his career, Eells published a number of papers including\nGeometric aspects of currents and distributions\n(1955)\n,\n(\nwith Charles B Morrey\n)\nA variational method in the theory of harmonic integrals\n(1955)\n,\n(\nwith Richard F Arens\n)\nOn embedding uniform and topological spaces\n(1956)\n, and\n(\nwith Charles B Morrey\n)\nA variational method in the theory of harmonic integrals\n(1956)\n.\nFor a few years Eells taught at the Columbia University, New York. He spent\n1963\nat Churchill College, Cambridge then was appointed as a full professor at Cornell University in the following year. He returned to Cambridge to spend the year\n1966\n-\n67\nthere and while in England he visited the University of Warwick in the summer of\n1967\nto run a symposium. I\n[\nEFR\n]\nwas a research student at the University of Warwick at this time and I met Eells who was captivated by the lively research atmosphere, the energy, and the excitement at the newly established university. Eells was keen to find a permanent appointment at Warwick and in\n1969\nhe was appointed as the first Professor of Analysis. The year\n1967\nin which Eells ran the symposium at Warwick was also the year that he published\nSingularities of smooth maps\nwhich mainly deals with on\nMorse\ntheory. He writes in the Preface:-\nAside from minor changes these notes form the first half of a course given at Columbia University in\n1960\n-\n61\n. This is not a text book; it consists of reprinted lecture notes, of an informal, incomplete and definitely temporary character.\nIn\n[\n2\n]\nElworthy described Eells' mathematics and how it fitted into the way the things were developing at Warwick:-\nIt was an appointment which fitted perfectly with the philosophy of the department at that time, which was to feature research in global, rather than traditional, analysis; and it was already becoming known as a centre for the global approach to\ndynamical systems\ntheory. It is tempting to describe global analysis as a holistic approach to mathematics. In it the whole geometry or topology of the spaces involved play a role, rather than just the equations describing the behaviour or motion in small areas. Non-linearity, especially that caused by curvature, is a prevalent aspect. A prime example is Eells's most famous article, \"Harmonic Mappings of Riemannian Manifolds\", published in the American Journal of Mathematics in\n1964\n. Written with J H Sampson of Johns Hopkins University, it founded the theory of \"harmonic maps\" and the \"non-linear heat flow\".\nOne of the features of mathematics at Warwick were the year long symposia which brought leading mathematicians in a particular area to spend time at Warwick during the tear the symposium ran. Eells had first been attracted to Warwick through the mini summer symposium he ran in\n1967\nso once on the permanent staff at Warwick it was natural that he should run year long symposia. This he did with \"Global Analysis\" in\n1971\n-\n72\n, \"Geometry of the Laplace Operator\" in\n1976\n-\n77\n, and \"Partial Differential Equations in Differential Geometry\", in\n1989\n-\n90\n. However, despite being fully committed to Warwick, Eells took on another role in addition, namely one at the International Centre for Theoretical Physics at Trieste. In fact he association with this Centre came about it a fairly similar way to his association with the University of Warwick. In the summer of\n1972\nhe organised a symposium there, being a continuation of the\n1971\n-\n72\nWarwick symposium. It was in fact the first mathematics symposium at the International Centre for Theoretical Physics which had, up till then, been only involved with physics. The success of Eells symposium led to the setting up of a Mathematics Division of the Centre and Eells became its first director in\n1986\n. It was a role he filled for six years in addition to his role at Warwick. The work of the Centre is particularly aimed at helping scientist in Third World countries to participate fully in their specialities and Eells' role as Director of the Mathematics Division reflected his passion to support mathematicians working in low income countries.\nWe should say more about Eells substantial and deep contributions to mathematics. His work on harmonic maps has already been mentioned in connection with his\n1964\npaper\nHarmonic Mappings of Riemannian Manifolds\n. In fact Eells went on to publish two definitive surveys on the topic with Luc Lemaire who studied for a doctorate under Eells' supervision. These were\nA report on harmonic maps\n(1978)\nand\nAnother report on harmonic maps\n(1988)\nboth published in the\nBulletin\nof the\nLondon Mathematical Society\n. In\n1992\na selection of Eells' papers on Harmonic maps was published as a book with this title in\n1992\n. In this book Eells points out that:-\n... harmonic maps pervade\ndifferential geometry\nand mathematical physics: they include geodesics, minimal surfaces, harmonic functions, Abelian integrals, Riemannian fibrations with minimal fibres,\nholomorphic\nmaps between\nKähler\nmanifolds, chiral models, and strings.\nOther books written by Eells on this topic were\nSelected topics in harmonic maps\n(1983)\nwith Luc Lemaire,\nHarmonic maps and minimal immersions with symmetries\n(1992)\nwith Andrea Ratto\n(\nanother PhD student of Eells' who received his doctorate in\n1987)\n, and\nHarmonic maps between Riemannian polyhedra\n(2001)\nwith the Danish mathematician B Fuglede.\nDavid Elworthy describes Eells in\n[\n2\n]\n:-\nJim Eells was a man of irrepressible enthusiasm for mathematics, and for most other things; especially people, irreverent fun, lots of wine, and music. His interest in the latter ranged across most styles and he would delight the younger children of his colleagues with lively performances of scatological songs.\nDavid Elworthy writes in\n[\n1\n]\n:-\nJim Eells had a phenomenal memory for people, matched by an interest in them. It has been claimed that in his early days he could recognise every member of the\nAmerican Mathematical Society\n. His wife Nan became well known to the younger researchers especially, and their families, due to her friendship and splendid dinner parties, with only mild attempts to control the exuberance of her husband. With Jim came tremendous mathematical excitement combined with an intensity of fun. He is missed a lot.\nIn\n1992\nEells retired from his professorship at the University of Warwick and ended his role as director of the Mathematics Division of the International Centre for Theoretical Physics at Trieste. He went to Cambridge  which became his base, although he maintained his world-wide travels."
}