{
  "nome_completo": "James Booth",
  "nome_curto": "James Booth",
  "ano_nascimento": "1806",
  "ano_morte": "1878",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Booth/",
  "lugar_nascimento": "Lavagh, County Leitrim, Ireland",
  "lugar_morte": "Stone, Buckinghamshire, England",
  "biografia": "James Booth\nwas the first of three children of John and Ellen Booth. James' parents owned a small property at Lavagh which is close to the small village of Drumsna on the river Shannon. In was in Drumsna, at a small school run by Parson Kane, that Booth received his early education. This classical school specialised in teaching Greek and Latin.\nBooth entered Trinity College, Dublin, in\n1825\n. At this time Franc Sadleir\n(1775\n-\n1851)\nwas the Professor of Mathematics and\nBartholomew Lloyd\nwas the professor of Natural and Experimental Philosophy. Teaching of both mathematics and physics at Trinity College had been greatly modernised by\nBartholomew Lloyd\n, and Booth entered a university teaching the up-to-date continental approach to these topics. Booth was awarded a scholarship in\n1829\nand graduated with a B.A. in\n1832\n. He continued to study at Trinity College and was awarded\nBishop Berkeley\n's gold medal for Greek in\n1834\n. This medal had been endowed by\nGeorge Berkeley\nshortly before his death in\n1753\n. Booth then attempted to win a fellowship at Trinity College. Few were successful in winning a fellowship at their first attempt so he took the fellowship examinations several times:-\nThe examination for fellowship was formidable, being held on twelve days preceding Trinity Sunday from nine to twelve in the forenoon and two to five in the afternoon of each day. The subjects of the examination were pure and applied mathematics, experimental physics, mental and moral philosophy, Greek language and literature, Latin language and literature, and Hebrew and cognate languages.\nAlthough Booth was highly placed in each of his attempts, he failed to win a fellowship. Among the unsuccessful candidates, he was placed second in\n1835\n, first in\n1837\n, fourth in\n1838\n, first in\n1839\nand second in\n1840\n. How unlucky can you get! On each occasion he was awarded a premium and the Madden Premium in both\n1837\nand\n1839\n. The Madden Premium, first awarded in\n1798\nfrom funds bequeathed in the will of Rev Samuel Molyneux Madden, was given after the Fellowship Examination:-\n... into the hand of that disappointed candidate whom the majority of his examiners shall declare to have best deserved to succeed if another fellowship had been vacant.\nWe note that in\n1840\nthree other candidates including\nGeorge Salmon\nfailed to obtain a fellowship but received premiums. All these three were subsequently awarded fellowships but Booth, after five unsuccessful attempts, seems to have given up the struggle in\n1840\n. In that year he was awarded an M.A. by Trinity and, in the same year, he was appointed as principal of Bristol College. Before leaving Trinity College he wrote the tract\nOn the Application of a New Analytic Method to the Theory of Curves and Curved Surfaces\n. You can read Booth's Preface to this tract, which he wrote on\n25\nMarch\n1840\nat\nTHIS LINK\n.\nAlthough written in\n1840\n, this tract was not published until\n1843\nand by the time it appeared, Booth's address was the Liverpool Collegiate Institution. Let us explain what happened to his position at Bristol College. It had opened in\n1831\nand, we note in passing, had given an excellent education to\nGeorge Stokes\nwho had attended Bristol College from\n1835\nto\n1837\n. However, Booth's position at the College was short-lived. Although Bristol College was non-denominational, it had Quaker founders and was attended by children from nonconformist families. This led to strong opposition from the Church of England, in particular from Bishop James Henry Monk, and in August\n1840\nthe rival Bishop's College opened. Bristol College closed at Christmas\n1841\nand Booth then opened his own private school. This school was attended by several Quaker children, in particular Edward Fry, son of Joseph Storrs Fry who had been a founder of Bristol College. Booth's paper\nOn the Rectification and Quadrature of the Spherical Ellipse\nwhich was published in the\nPhilosophical Transactions\nof the\nRoyal Society of London\nin\n1842\nstill gave Booth's position as Principal of Bristol College. The paper was communicated by\nJohn T Graves\nof the Inner Temple. The paper gives a number of interesting theorems which relate to research by\nJames MacCullagh\nand\nCharles Graves\nat Trinity College, Dublin.\nIn\n1842\nBooth was ordained a deacon by the Bishop of Exeter and, later that year, ordained a priest by the Archbishop of Canterbury. He served as a curate in Bristol before moving to Liverpool in\n1843\nwhen he was appointed professor of mathematics and vice-principal of the Liverpool Collegiate Institution. This school had been opened by William Gladstone on\n6\nJanuary\n1843\nwith theologian and novelist Dr William John Conybeare as Principal. Booth remained in Liverpool for five years and during that time he was President of the Literary and Philosophical Society of Liverpool, addressing that Society in\n1846\n. In the same year he published the tract\nEducation and Educational Institutions considered with reference to the Industrial Professions and the Present Aspect of Society\n. You can read Booth's Preface to this tract at\nTHIS LINK\n.\nBooth's interest in school education led to his most lasting contribution for we will see below that he was to bring in educational ideas which today are a standard part of the system. His next educational tract, published in\n1847\n, was\nExamination the Province of the State; or, the Outlines of a Practical System for the Extension of National Education\n. In this\n73\n-page tract, Booth called for a national examination system. At the time no such examination system was in operation and he argued strongly that having a national examination system would drive up standards giving schools incentives to achieve higher standards from their pupils. This tract attracted much attention and Booth was encouraged to find ways to achieve his aims of setting up national examinations.\nWhile he was in Liverpool, Booth travelled frequently to London where he lectured at the\nRoyal Society\n. On\n22\nJanuary\n1846\nBooth was elected as a fellow of the\nRoyal Society of London\n, partly for his lectures at the Society and partly for his published geometrical works. He continued to visit London often and, in\n1848\n, he resigned his positions at the Liverpool Collegiate Institution and moved to London. He continued his mathematical researches and published\nOn the Application of the Theory of Elliptic Functions to the Rotation of a Rigid Body round a Fixed Point\n(1849)\n, and\nResearches on the Geometrical Properties of Elliptic Integrals\n(1851)\n. Also in\n1851\nhe published the book\nThe Theory of Elliptic Integrals and the Properties of Surfaces of the Second Order, applied to the Motion of a Body round a Fixed Point\n. In the Preface to this book he writes:-\nThe investigations given in the following pages were made, the greater portion of them, several years ago. Some of them appeared from time to time in those periodical publications whose pages are open to discussions on subjects of this nature. In this treatise a complete investigation has been attempted of the laws of the motion of a rigid body round a fixed point, free from the action of accelerating forces, based on the properties of surfaces of the second order, of the curves in which these surfaces intersect, and on the theory of elliptic integrals. The results which have been obtained are exact and not approximate, general and not restricted by any imposed hypothesis.\nIn\n1852\nBooth joined the Society for the Encouragement of Arts, Manufactures and Commerce which is usually known by the short version of its name, the Royal Society of Arts. He immediately suggested to the Council that the Society publish a public Journal rather than minutes of their weekly meetings which had been done up to that time. The suggestion was rapidly taken up and the first part of volume\n1\nof the Journal of the Society of Arts was published on\n26\nNovember\n1852\n. In December of that year Booth was asked to join the Council of the Society and he rapidly pressed his case for national examinations. He was asked to chair a Committee on Industrial Instruction which, within a year, produced its report in\n1853\n. The report produced:-\n... decisive testimony in favour of some system of examination for provincial schools in connection with a central body, which would be empowered to grant certificates of proficiency.\nIn November\n1855\n, Booth delivered the lecture\nOn the female education of the industrial classes\nat the at the Mechanics' Institution in Wandsworth. We get a feeling for how passionate Booth is from the following quote\n[\n1\n]\n:-\nI have called the subject I am going to talk to you about important. Everybody says pretty much the same when he brings any subject he is going to speak about before his hearers; but I will go further, and say, that of all the things I could possibly talk to you about - and they are a good many - I say that out of them all, and I will not except a single one - no, not even one - this is by far the most important thing I could ask you to consider. Now you may be surprised at my saying this, but you will not when I tell you that all your education, all your national schools, all your trade schools, all your ragged schools, all your sermons, will effect no lasting good until you begin at the beginning, and make the education of your girls a very different thing from what it is.\nHe spoke about the development of national examinations by the Royal Society of Arts in two lectures delivered in\n1856\nand published in\n[\n2\n]\n:-\nOf these\n[\nreforms\n]\nthere is none so pressing as the amendment of the education of the masses. To ignorance, with its consequent improvidence, may be traced most of our national evils. So many of our social wrongs have been redressed within the last few years, one cannot believe that this the greatest, as being the source of nearly all the rest, shall continue without remedy.\nThe document\n[\n2\n]\ncontains an appendix with the 'Programme of Examinations for\n1857\n'. Booth was an examiner for Mathematics, Physics and Geography for this first set of examinations. The programme set by the examiners for Mathematics and Physics is given at\nTHIS LINK\n.\nBooth was chairman of the Council in\n1855\n-\n56\nbut resigned in\n1857\nfeeling that fellow members thought that he was driving the Society faster and further than it wanted in the direction of national examinations. However, the Society did continue to set national examinations which attracted an increasing number of candidates.\nIt was not just mathematical education which now interested Booth for he continued his interest in mathematical research. In\n1854\nhe published a delightful little paper showing that a six figure number in which the first three places coincided with the final three places, for example,\n376376\n,\n459459\nor\n301301\n, is always divisible by\n7\n,\n11\nan\n13\n. This is easy to prove using modular arithmetic. See our comments on Booth's paper at\nTHIS LINK\n.\nThree years later he published\nOn the Application of Parabolic Trigonometry to the Investigation of the Properties of the Common Catenary\n(1857)\nand in the following year\nOn Tangential Coordinates\n(1858)\n. In this paper he tries again to interest the mathematical world in the ideas that he had developed while still at Trinity College Dublin. He writes in the Introduction to that paper:-\nMany years ago, after I had taken my degree I, was much interested in the study of the original memoirs on reciprocal curves and curved surfaces, published in the 'Annales Mathématique' of\nGergonne\n, and in the works of such accomplished geometers as\nMonge\n,\nDupin\n,\nPoncelet\n, and\nChasles\n. In the course of my own researches, it occurred to me that there ought to be some way of expressing by common algebra the properties of such reciprocal curves and surfaces, some method which would, on inspection, show the relations existing between the original and derived surfaces. I was then led to the discovery of a simple method and compact notation from the following considerations. But before I state them, it is proper to mention that I published the discovery in a little tract which I printed at the time, of which the title was, 'On the Application of a New Analytic Method to the Theory of Curves and Curved Surfaces.' This little tract, which is now out of print, as only a few copies were printed, excited but little attention. Nor is this to be wondered at. Mathematical researches, and, indeed, I might add, scientific pursuits in general, command but small attention in this country, unless they promise to pay. The obscurity of the author, and the remoteness of a provincial press, still further account for the little notice it obtained. Besides, it must in fairness be added, that the materials were hastily and crudely thrown together; that to save space, the demonstrations were for the most part omitted, and that the principles on which the method rests were not so clearly explained as to enable an ordinary reader, - who had to incorporate with his own thinking the notions of another, - to pursue the train of argument, or the successive steps of a proof with facility and conviction. This may to some extent also explain why the method has hitherto received so little countenance as not to be admitted into any elementary work on the application of the principles and notation of algebra to the investigation and discussion of the properties of space. But the addition of a new method of investigation to those already in use, the development of its principles, with illustrations of the mode of its application, are surely not of less value to a philosophical appreciation of what that is in which mathematical knowledge truly consists, than the giving of problems, which, while they embody no general principle, are yet often difficult to solve; and when solved, frequently afford no clue by which the solution may be rendered available in other cases.\nIn the same paper, Booth also makes a comment about mathematical education:-\nThe radical vice in mathematical instruction in this country and in our time would seem to be, that knowledge of principles and familiarity with methods of investigation are subordinated to nimble dexterity in the manipulation of symbols, and to cramming the memory with long formulae and tabular expressions. Again, it often happens that an investigation, which, if pursued by one method, would prove barren of results or altogether impracticable, when followed out from a different point of view and by the help of another method, not infrequently leads by a few easy steps to the discovery of important truths, or to the consideration of others under a novel aspect. Hence the multiplication of methods of investigation tends widely to enlarge the boundaries of science.\nWe have described some of Booth's activities in London, but not said anything about his various roles within the Church. He was appointed as vicar of St Anne's, Wandsworth, in\n1854\n. A year earlier he had founded the Wandsworth Trade School in Garratt Lane, Wandsworth, south west London. One sees Booth's ideas being put into practice in this school; for example\nThe Principles and Rules of the Trade School at Wandsworth\n, published in\n1854\n, states:-\nThe applications of Science to industry are becoming every day more numerous. In some a knowledge of the elementary principles of Mathematics is required; in others some acquaintance with Mechanics; in others, again, some familiarity with the processes of Chemistry. There are no schools, however, within the reach of tradesmen or artisans, where instruction can be had in these matters ...\nAfter two years the school had around\n100\nboys studying there but advanced classes did not attract support and it closed in\n1859\n.\nOn\n28\nSeptember\n1854\nBooth married Mary Watney, a daughter of Daniel Watney, who was a brewer from Wandsworth, and Eleanor Langton. James and Mary Booth had two sons and one daughter. In\n1859\nthe position of vicar at St John's, Stone, near Aylesbury became vacant. This was in the gift of the\nRoyal Astronomical Society\nwho proposed Booth as vicar. Although Booth was not a fellow of the\nRoyal Astronomical Society\n, they considered his contributions to science and education made him worthy of the position. After he became vicar at St John's, Stone, he was elected a fellow of the\nRoyal Astronomical Society\n.\nBooth made a final attempt to bring his mathematical ideas to the fore. He republished all his previous mathematical writings in two volumes\nA Treatise on some New Geometrical Methods\n(\nVolume\n1\n,\n1873\n, Volume\n2\n,\n1877)\n. The first volume contains his work on tangential coordinates and reciprocal polars. The second volume contains his papers on elliptic integrals. Booth writes in the Introduction:-\nIt has been a heavy drawback and deep discouragement that I have had no fellow workers to share in these researches. Neither have I entered into the labours of any. Without sympathy and without help I have worked upon those monographs presented to the public.\nJames Glaisher\nexplains why, in his opinion, Booth's work attracted so little attention in\n[\n7\n]\n:-\nThe English mathematician who devotes himself to one or two special subjects can scarcely expect to have many fellow workers among his countrymen, but the theories to which Dr Booth's writings relate have been enormously developed on the Continent in the last fifty years, and the comparative neglect to which he alludes may be traced to the fact that it is these foreign researches which, being expressed in more modern forms, have been generally referred to.\nBooth's wife Mary died in\n1874\nand Booth died at the vicarage at Stone, Buckinghamshire, at the age of\n71\n. What of his legacy? Foden, in\n[\n3\n]\n, writes:-\nBooth had more to do than anyone else... in setting going the vast examination machine that came to dominate English education ..."
}