{
  "nome_completo": "James Robert McConnell",
  "nome_curto": "James McConnell",
  "ano_nascimento": "1915",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McConnell/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dalkey, Dún Laoghaire-Rathdown, County Dublin, Ireland",
  "biografia": "James McConnell\n's parents were Robert McConnell\n(\nborn\n1885)\n, who was a pharmacist originally from Ballymenna, and Frances Lennon\n(\nborn\n1884)\nfrom Dalkey, County Dublin. Robert McConnell died when James was four years old and he was brought up by his mother. He had a terrible experience when he was five years old. James and his mother were in Talbot Street in Dublin on\n14\nOctober\n1920\nwhen there was a shootout between a British Secret Service surveillance team and Seán Treacy, one of the leaders of the Irish Republican Army. Treacy and two British agents were killed in the shootout and this traumatic experience was witnessed by the five year old James. For the rest of his life James retained a vivid mental picture of the scene and he could name every shop on both sides of the street.\nMcConnell was educated at the O'Connell School on North Richmond Street in Dublin. This school had been founded by the Congregation of the Christian Brothers in\n1828\nand was named after the Irish patriot, Daniel O'Connell. In\n1932\nMcConnell completed his studies at the O'Connell School and entered University College Dublin. At university he studied mathematics and, in particular, he was taught by\nArthur William Conway\nwhose lectures on quantum theory and relativity inspired McConnell. He graduated in\n1936\nwith an M.A. with First Class Honours in Mathematics. After graduating, McConnell entered the Roman Catholic seminary of Holy Cross College in Clonliffe Road, Drumcondra, Dublin. He studied there for a year undertaking training for the priesthood. Advised to continue his studies in Rome, he moved to the Pontifical Lateran University of Rome where he received the degrees of S.T.L.\n(\nLicentiate of Sacred Theology\n)\n, D.D.\n(\nDoctor of Divinity\n)\nand B.C.L.\n(\nBachelor of Civil Law\n)\n. He was ordained in\n1939\nand completed his studies at the Pontifical Lateran University in\n1940\n. At the same time as he was studying at the Pontifical Lateran University, McConnell was undertaking research in mathematical sciences at La Sapienza, University of Rome, and was awarded a doctorate by La Sapienza in\n1941\n. Of course in June\n1940\nItaly had joined Germany and declared war on Britain and France so by the time McConnell received his doctorate Italy was allied with Germany. However, Ireland remained neutral throughout World War II so, although the war made things very difficult for McConnell, it was still possible for him to return to Ireland in\n1942\n.\nThe Dublin Institute for Advanced Studies had been founded by\nÉamon de Valera\nin\n1940\nwith the School of Theoretical Physics being one of two schools in the new Institute.\nErwin Schrödinger\nbecame the Director of the School of Theoretical Physics and, in\n1942\n, after receiving a strong recommendation from\nA W Conway\n, McConnell joined this School. In\n1943\nMcConnell published the paper\nNon-Linear Quantum Electrodynamics of the Vacuum\n. He begins the Introduction by writing:-\nThis paper is a modest first step towards establishing a non-linear quantum electrodynamics, that is to say, an attempt at a quantum mechanical description of the electromagnetic field, based on\nBorn\n's non linear electrodynamics rather than on\nMaxwell\n's theory. No great revelations with immediate bearing on experiments can be expected from this first step, which deals with the charge-free electromagnetic field in the first approximation\n(\nas regards amplitudes\n)\nafter the linear Maxwellian case. Yet it is a step necessary for further progress. Covering ground, which in the linear approximation is still entirely trivial, it illustrates well the complexity entailed by this - or any other - non-linear theory and thus, very probably, the true complexity of the problem of quantum electrodynamics.\nHe ends his paper with the following acknowledgement:-\nI am greatly indebted to Professor\nE Schrödinger\nfor many valuable discussions and suggestions. My thanks are also due to Professor W Heitler, who suggested the introduction of radiation damping.\nIn\n1943\nMcConnell and\nSchrödinger\nwrote the joint paper\nThe Shielding Effect of Planetary Magnetic Fields\n(1944)\n. They begin their Introduction as follows:-\nVery much the same as in the case of\nEinstein\n's field-equations of gravitation in empty space,\nMaxwell\n's equations likewise admit of a term expressing that the potentials act also as sources of the field-the \"cosmical term,\" as it is usually called. While in the case of gravitation anything but an extremely low order of magnitude of this term is excluded by observation, the widespread 'belief that the corresponding Maxwellian term must be of the same low order, neither rests on direct experimental evidence, nor are there strong theoretical grounds for it.\nIn\n1945\nMcConnell was appointed as Professor of Mathematical Physics at St Patrick's College, Maynooth. This College has an interesting history. It was founded in\n1795\nas a seminary to train priests but also taught Classics, English, Irish and Modern Languages, Mathematics, and Natural Philosophy. When the National University of Ireland was founded in\n1908\n, it was not allowed to teach theology or grant degrees in that subject. However, a few years later, St Patrick's College became a Recognised College of the National University of Ireland for Arts and Science. Professors, like McConnell, were appointed as professors in the National University of Ireland.\nMcConnell published three papers on\nProduction and annihilation of negative protons\n(1945\n,\n1947\n,\n1954)\n. These papers involved a theoretical study of the antiproton, a particle predicted theoretically by\nPaul Dirac\nin\n1933\nbut which was only shown to exist experimentally in\n1955\n. In\n1958\nhe published his book\nQuantum particle dynamics\n. Ronan Sheehan writes about this book in\n[\n5\n]\n:-\nIts object was to enable those who had no previous acquaintance with relativity or quantum theory to acquire sufficient knowledge of quantum mechanics, quantum electrodynamics and meson theory to understand the main features of the theory of elementary particles.\nC Strachan, in\n[\n6\n]\n, feels that McConnell should have gone into more details:-\nSome\n250\npages offer rather cramped accommodation for the development from introductory wave-mechanics to strange particle theory via quantum electrodynamics. Particularly in the earlier chapters, on Special Theory of Relativity, Introductory Quantum Theory, Wave and Matrix Mechanics, Angular Momentum, Many-particle Systems, the reviewer feels that a reader for whom these chapters are necessary will find parts of the treatment too facile to avoid perplexity. ... One can only regret that the author did not develop part or all of his subject matter much more fully.\nAlso in\n1958\nMcConnell published a paper quite different to anything that he had previously worked on. This paper, published in the\nProceedings\nof the\nEdinburgh Mathematical Society\n, was entitled\nWhittaker's correlation of physics and philosophy\n.\nGerald James Whitrow\nwrites in a review:-\nIn this clearly written concise survey of Sir\nEdmund Whittaker\n's writings on the philosophy of physics, the author divides\nWhittaker\n's work in this field for convenience into five divisions: neo-Cartesianism,\nEddington\n's principle, determinism and freewill, cosmology, natural theology. With regard to\nEddington\n's Fundamental Theory, the author makes the point that in recent years\nEddington\n's work would have been ignored had not\nWhittaker\nfocussed attention on it, and he claims that both for this and for pointing out the epistemological defects he has placed both philosophers and mathematical physicists under a debt.\nThis change in McConnell's interests was followed by another change of direction. In\n1964\n-\n65\nhe gave a series of seminars on the applications of group theory to elementary particles and he wrote these up in the\n111\n-page tract\nIntroduction to the group theory of elementary particles\n(1965)\n. Paul Roman describes the contents in a review:-\nAfter a few ad hoc words on elementary particles in general, the\nS\nU\n2\nSU_{2}\nS\nU\n2\n​\ngroup is briefly discussed and the notion of a\nLie\ngroup is introduced. The next five chapters contain a simple, readable account on the general notions concerning semi-simple\nLie algebras\n, their root diagrams, weight diagrams, and the reduction of product representations. Chapter\n8\npresents a detailed explicit treatment of the\nS\nU\n3\nSU_{3}\nS\nU\n3\n​\ngroup. Chapter\n9\nis devoted to the\n5\n-dimensional rotation group, and includes mention of the possibility of applying it to leptonic symmetries. The concluding chapter reviews some of the major applications of\nS\nU\n3\nSU_{3}\nS\nU\n3\n​\nfor strong, electromagnetic, and weak interactions.\nAfter these lectures and resulting publication, McConnell began to publish research papers on applications of\nLie\ngroups and\nLie\nalgebras to physics, for example:\nGroup theoretical study of leptonic processes\n(1965)\n;\nMultiplicities in weight diagrams\n(1966)\n;\nProperties of the exceptional\nG\n2\nG_{2}\nG\n2\n​\n-Lie group\n(1968)\n;\nThe general linear group GL\n(4)\nand the Lie group\nC\n2\nC_{2}\nC\n2\n​\n(1969)\n; and\nGraph theory of weight multiplicities\n(1970)\n. After these papers, he published the\n164\n-page tract\nWeight diagrams and their application to the reduction of representations of the general linear group\n(1971)\n. Albert John Coleman\n(1918\n-\n2010)\n, at that time Head of the Department of Mathematics and Statistics at Queen's University, Canada, writes in a review:-\nThe first half of this brochure is devoted to a detailed and elaborate discussion of the weight diagrams of representations of the simple Lie groups of rank two:\nA\n2\n,\nB\n2\nA_{2}, B_{2}\nA\n2\n​\n,\nB\n2\n​\nand\nG\n2\nG_{2}\nG\n2\n​\n. A graphical method is developed for obtaining the multiplicities of the weights in an irreducible representation starting from a dominant weight. In the remainder the author studies representations of the general linear group over the complex numbers,\nG\nL\n(\nn\n,\nC\n)\nGL(n, \\mathbb{C})\nG\nL\n(\nn\n,\nC\n)\nfor\nn\n>\n2\nn > 2\nn\n>\n2\n, and the reduction of such representations when the group is restricted to a subgroup of rank two.\nAt St Patrick's College, Maynooth, McConnell took on some administrative duties. He was Dean of the Faculty of Science from\n1957\nto\n1968\nand Registrar of the College from\n1966\nto\n1968\n. During this period he took study leave which allowed him to be a visiting professor at Fordham University, New York in\n1959\n-\n60\nand a visiting professor at Laval University, Quebec in\n1964\n. While at Fordham University he worked with Joseph Y Shapiro and they wrote the joint paper\nCovariant statistical treatment of antiproton annihilation\nwhich was published in\n1963\n. In\n1968\nMcConnell was appointed as a Senior Professor in the School of Theoretical Physics of the Dublin Institute for Advanced Studies. He served as Director of the School from\n1969\nto\n1972\n. In\n1980\nhe published the book\nRotational Brownian motion and dielectric theory\n. Raymond Streater writes in\n[\n7\n]\n:-\nThis book has a dual interest; one, according to the foreword, is to give an exposition of the theory of dielectrics that will guide experimenters to set up the critical experiment to test the substantial body of the theory described here. A second use for the book is to provide probabilists with hard but clearly interesting problems in stochastic differential equations and which call for a more rigorous treatment.\nMcConnell received many awards for his outstanding contributions. He was elected to membership in the\nRoyal Irish Academy\nin\n1949\n, serving as its Secretary from\n1967\nto\n1972\n. He served as Chairman of the National Committee for Mathematics of the\nRoyal Irish Academy\nfrom\n1960\nto\n1964\n, and Chairman of its National Committee for Physics from\n1965\nto\n1968\n. He was a founder member of the European Physical Society in\n1968\nand served on its Council from\n1969\nto\n1971\n. In\n1986\nhe was awarded the\nBoyle\nMedal by the Royal Dublin Society. He was elected to the\nPontifical Academy of Sciences\non\n25\nJune\n1990\n. Pope John Paul II made him a Prelate of Honour in the following year.\nRonan Sheehan, a lawyer and friend, described McConnell's sad final years in\n[\n5\n]\n:-\nIn September\n1992\n, my father died. A couple of days later, I walked down the aisle of the same church to where Fr McConnell was standing at the altar-rail. He wasn't looking very well himself. ... I had taken instructions from him some time before to draft his will and I had presented it to him for execution at the Institute for Advanced Studies on Burlington Road. He bequeathed his intellectual property to 'Propaganda Fidei'. Shortly after my father's death, Fr McConnell's descent into dementia commenced. Unhappy was the day I made an application to the High Court to make this mathematical genius a ward of court and myself guardian of his person and property, including intellectual property. I knew his book had been taught in Princeton, in Beijing, in Cracow. Where else? ... What precisely were my duties in the matter? My responsibility did not last long enough to make answers to these questions an obligation. He died soon after. Responsibility for the management of his property passed to his executor.\nWe note that 'Propaganda Fidei', now known as the Congregation for the Evangelization of Peoples, is based in Rome and organises all the missionary activity of the Catholic Church.\nThe author of\n[\n1\n]\nwrites:-\nJames McConnell was a friendly, unassuming and generous man, who was full of vitality and had an infectious enthusiasm for all his undertakings. He was sustained in his late years of failing health by his faith and the devoted care of the Carmelite Sisters for the Aged and Infirm at Our Lady's Manor, Dalkey. Requiescat in pace."
}