{
  "nome_completo": "Jean-Baptiste Charles Joseph Bélanger",
  "nome_curto": "Jean-Baptiste Bélanger",
  "ano_nascimento": "1790",
  "ano_morte": "1874",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Belanger/",
  "lugar_nascimento": "Valenciennes, France",
  "lugar_morte": "Neuilly-sur-Seine, France",
  "biografia": "Jean-Baptiste Bélanger\n's parents were Jeanne Françoise Joseph Fauconnier and Charles Antoine Aimé Joseph Bélanger, a master locksmith. Charles Antoine Bélanger, the son of Antoine Joseph Bélanger and Angélique Godefroy, was a native of the parish of St Étienne at Lille and had been\n26\nyears old when he had married Jeanne Françoise Fauconnier, daughter of Pierre Joseph Fauconnier and Marie Anne Berton, on\n21\nApril\n1789\nat Valenciennes. Jean-Baptiste was baptised by the local Roman Catholic priest on the day he was born, which was standard practice at this time. His godparents were his uncle Charles Belanger and his aunt Helene Fauconnier.\nIn\n1808\nBélanger sat the entrance examination for the École Polytechnique, as did\nGaspard-Gustave de Coriolis\nwho became his classmate and friend. They entered the university which had a remarkable collection of top mathematicians as lecturers including\nGaspard Monge\n,\nLazare Carnot\n,\nCharles Brianchon\n,\nSylvestre Lacroix\n,\nAndré-Marie Ampère\n,\nLouis Poinsot\n, and\nJean Hachette\n. On graduating Bélanger was ranked second in his class and, in\n1812\n, he entered the École Nationale Supérieure des Ponts et Chaussées in Paris to train to become an engineer. This was a standard route for the best students at this time and Coriolis also entered the École des Ponts et Chaussées at the same time. Bélanger qualified as an engineer in\n1816\nand went to undertake work at La Réole, a town on the river Garonne about\n50\nkm south east of Bordeaux. It is not clear exactly what he worked on at this point. There had long been an aim to connect the west coast of France to the Mediterranean by navigable canals and creating canals on the Garonne was a next step in this plan. However, work on this does not appear to have begun until some years after Bélanger left the town. Another project, with a link to Bélanger, was to bridge the river Garonne at La Réole. In fact work on a suspension bridge was begun in\n1833\nby Gustave Eiffel, who had been a student of Bélanger.\nIn\n1821\nBélanger left La Réole and moved to work on the Somme navigation canal project. This was a canal in northern France beginning at Saint-Valery-sur-Somme on the English Channel, and joining the Canal de Saint-Quentin at St Simon. It was a major project, undertaken over many years with work beginning in\n1770\nand not being completed until\n1843\n. After five years on this project, during which time he designed the canals, the  water supply for the canal and the management of water resources, he moved in\n1826\nto work on the Ardennes navigation canal. Work on this canal, joining the Canal lateral a l'Aisne at Vieux-les-Asfeld with the Canal de l'Est at Pont-a-Bar, had begun in\n1821\nand continued until\n1833\n. The\n88\nkm canal was a major piece of engineering with\n44\nlocks and a\n200\nm tunnel. Bélanger's contributions were similar to those on the Somme canal.\nWhile working on these canals from\n1821\nonwards, Bélanger began to apply high powered mathematical techniques to study the flow of water in these channels. Olivier Darrigol writes in\n[\n6\n]\n:-\nLike many former polytechnicians, Bélanger had faith in the practical usefulness of higher mathematics. While working on canals and adjacent rivers, he sought a theory of non-uniform flow that would permit more rational designs. The Royal Academy of Metz had recently advertised a prize for \"determining the curve that running water forms upstream from a weir.\" The only known formulas concerned uniform permanent flow, for which the section of the channel is uniform and the slope of the water surface is the same as the slope of the bottom. In his new theory, Bélanger supposed a slow variation of the section of the channel and slight differences between the surface and bottom slopes.\nBélanger's first work on this was published in a report that appeared in the\nJournal des Mines\nin\n1823\nbut he was unhappy with this and felt that it required considerable improvements, particularly needing a stronger theoretical foundation. By\n1826\nhe had introduced new ideas to strengthen his work and he produced a revised paper which was evaluated by a Commission of the Ponts et Chaussées et des Mines on\n21\nJuly\n1827\n. The Commission gave Bélanger's paper considerable praise:-\nThe Commission is of the opinion that M Bélanger has much talent, and the paper may be very useful; as a consequence it believes that the author deserves congratulations and encouragement.\nThe revised paper was published as\nEssai sur la Solution Numérique de quelques Problèmes Relatifs au Mouvement Permanent des Eaux Courantes\nⓉ\n(\nEssay on the numerical solution of some problems relating to the steady flow of water\n)\n. Hubert Chanson writes\n[\n3\n]\n:-\nIn an open channel, the transition from a high-velocity open channel flow to a fluvial motion is a flow singularity called a hydraulic jump. The application of the momentum principle to the hydraulic jump is commonly called the Bélanger equation, but few know that his original treatise was focused on the study of gradually varied open channel flows\n(\nBélanger\n1828)\n. The originality of Bélanger's\n1828\nessay was the successful development of the backwater equation for steady, one-dimensional gradually-varied flows in an open channel, together with the introduction of the step method, distance calculated from depth, and the concept of critical flow conditions. In\n1828\n, Jean-Baptiste Bélanger understood the rapidly varied nature of the jump flow, but he applied incorrectly the\nBernoulli\nprinciple to the hydraulic jump.\nBélanger gave some specific examples in the paper to show the applicability of his equation. In particular\n[\n6\n]\n:-\nBélanger provided a stepwise integration of this equation in the simple case of the horizontal aqueduct that had been built recently to bring the waters of the Ourcq River into Paris. In this case the practical question was the height that the water must have at the beginning of the aqueduct for a given height at the end. Bélanger also gave a few examples of calculations of the backwaters before a weir, with the navigability of rivers in view.\nWhen Bélanger wrote this work he was employed on the Ardennes canal project. However, he moved on to other engineering projects, working on railways rather than canals. In this he worked with Antoine-Rémi Polonceau\n(1778\n-\n1847)\nin the Seine-et-Oise département, a large region to the north, west and south of Paris.\n[\nThe département of Seine-et-Oise was created in\n1790\nand abolished in\n1968\n.\n]\nThese two engineers were involved in the design of the railway from Paris to Le Havre along the valley of the Seine passing through Rouen. Also, as part of this study, they included the design of a railway line to Dieppe which left the Paris-Rouen-Le Havre line north of Rouen and heads north to Dieppe while the Rouen-Le Havre line heads west. This integrated design therefore incorporated both Paris-Rouen-Le Havre and Paris-Rouen-Dieppe lines. The two engineers began to conduct their survey in early\n1836\nand their design is set out in\n[\n2\n]\n. It incorporated five major bridges and four tunnels of total length\n3\n.\n5\nkm. The work was undertaken by the Riant-Laffitte-Jourdan company and the Paris to Rouen line was completed in\n1843\nwith the extension to Le Havre being completed in\n1847\n.\nBélanger had a teaching career in addition to his engineering career. He was appointed to the École Centrale des Arts et Manufactures in\n1838\nand, three years later, he added a lectureship at the École des Ponts et Chaussées. In\n1851\nhe added a third lecturing position when, in addition, he was appointed as a professor at the École Polytechnique. He made major contributions to teaching at this famous university\n[\n4\n]\n:-\n... he developed a new university curriculum in mechanics\n(\ncours de Mécanique\n)\nin response to a re-structure of the engineering programme at École Polytechnique. Linking kinematics and dynamics, he argued that the mechanics is based upon three principles: inertia, action-reaction and constant ratio force to acceleration at any point. Among the innovations, he considered statics as a limited case of dynamics which was most innovative in France at the time.\nHe only taught in all three of these establishments for four years for, in\n1855\n, he gave up teaching at the École des Ponts et Chaussées. In\n1860\nhe ended his lecturing duties at the École Polytechnique but continued to teach at the École Centrale des Arts et Manufactures until he retired in\n1864\n. Bélanger produced an important publication\nNotes sur l'Hydraulique\nⓉ\n(\nNotes on water resources\n)\nin\n1841\nbeing his lecture notes for session\n1841\n-\n42\nat the École des Ponts et Chaussées. He used the same lecture notes for courses he gave at the École Centrale des Arts et Manufactures. Over the following years he produced new versions of these notes which were fairly minor re-editings. For example in\n1849\nthe notes have the title\nNotes sur le Cours d'Hydraulique\nⓉ\n(\nNotes on the course in hydraulics\n)\nand are those he used for his\n1849\n-\n50\ncourse at the École des Ponts et Chaussées. After he began lecturing at the École Polytechnique he also used the same notes for courses he gave there.\nWhen we gave an indication of Bélanger's\n1828\nwork we mentioned that he applied incorrectly the\nBernoulli\nprinciple to the hydraulic jump. We learn from Bélanger's lecture notes that he realised his error in\n1838\nand a version with the momentum principle correctly applied is presented in\nNotes sur l'Hydraulique\nⓉ\n(\nNotes on water resources\n)\n(1841)\n. He wrote:-\n... new thoughts led me in\n1838\nto realise that the assumption was incorrect.\nThis\n1841\nwork contained the hydraulic jump equation now known as the Bélanger equation. Olivier Darrigol writes in\n[\n7\n]\n:-\nThe courses that ... Bélanger gave at Centrale, the Ponts et Chaussées, and the Polytechnique in the\n1840\ns and\n1850\ns integrated ... work and live force in the teaching of rational mechanics. Their exceptional clarity and architectural harmony made them a model for later mechanical textbooks.\nIn addition to these lecture notes, Bélanger published a number of books. The first edition of\nRésumé de leçons de géométrie analytique et de calcul infinitésimal\nⓉ\n(\nSummary of lessons on analytic geometry and calculus\n)\nappeared in\n1842\nwith a second edition in\n1859\n. In the Preface to the first edition Bélanger explained the aims of the text:-\nThe mathematical knowledge required to present for admission to the École Centrale des Arts et Manufactures is merely arithmetic, elementary geometry and a part of algebra. The lessons of which we publish a summary, are intended to complete a pupil's instruction in pure mathematics to the point necessary to be able to usefully follow a course in rational mechanics, hydraulics, and the dynamical theory of machines, which, together with other sciences applicable to industry, come within the scope of the teaching at the École Centrale. The preparatory course in higher mathematics, in a few topics that it treats, goes beyond the current teaching of university colleges; however its extent is limited since it requires the students for which it is intended to study for only four or five months. So the École Centrale des Arts et Manufactures devised a teaching plan, attempting to satisfy the condition without sacrificing in proofs the tight logic without which mathematics becomes an often misleading semi-science, not compromising clarity by excessive brevity, but by choosing those parts of analytic geometry and the infinitesimal calculus which every engineer must know, and especially those which are necessary for the study of mechanics viewed from the point of view of its practical application to industrial work.\nIn\n1858\nBélanger published the treatise\nThéorie de la résistance de la torsion et de la flexion plane des solides\nⓉ\n(\nTheory of the resistance of the torsion and bending of a planar solid\n)\n; a second edition was published in\n1862\n. In\n1864\nhe published two books,\nTraité de cinématique\nⓉ\n(\nTreatise on dynamics\n)\nand\nTraité de la dynamique d'un point matériel\nⓉ\n(\nTreatise of the dynamics of a material point\n)\n. He published another text,\nTraité de la dynamique des systèmes matériels\nⓉ\n(\nTreatise of the dynamics of material systems\n)\n, in\n1866\n[\n4\n]\n:-\nHis ideas influenced strongly the teaching of statics and dynamics, and mechanics in France and Europe during the\n19\nth\ncentury as well as into the\n20\nth\ncentury.\nBélanger married Louise Aimée Dumas\n(1797\n-\n1877)\n. She outlived him by three years and is buried in the same grave as her husband at the old cemetery in Neuilly-sur-Seine. We remarked above that Gustave Eiffel\n(1832\n-\n1923)\nwas a student of Bélanger's at the École Centrale des Arts et Manufactures. Eiffel, of course, went on to design the Eiffel Tower and Bélanger is one of the\n72\nscientists whose names are engraved on the facades of the Tower. His name follows that of\nJoseph-Louis Lagrange\n.\nLet us end with the words of Chanson\n[\n3\n]\n:-\nAltogether Jean-Baptiste Bélanger's\n(1828\n,\n1841\n,\n1849)\ncontributions to modern open channel hydraulics were remarkable and influenced the works by J A C Bresse, H P G Darcy,\nA J C Barré de Saint Venant\n, and\nJ V Boussinesq\n.\nJacques Antoine Charles Bresse\n(1822\n-\n1883)\n, mentioned in this quote, was greatly influenced by Bélanger and succeeded him as a professor at the École Nationale Supérieure des Ponts et Chaussées in\n1855\n. His name, like that of Bélanger, in engraved on the Eiffel Tower."
}