{
  "nome_completo": "Jean-Louis Koszul",
  "nome_curto": "Jean-Louis Koszul",
  "ano_nascimento": "1921",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Koszul/",
  "lugar_nascimento": "Strasbourg, Bas-Rhin, France",
  "lugar_morte": "Fontanil-Cornillon, Grenoble, France",
  "biografia": "Jean-Louis Koszul\n's parents were Marie Fontaine, who was born at Lyon on\n19\nJune\n1887\n, and André Koszul, born at Roubaix on\n19\nNovember\n1878\n. André was a university professor in Strasbourg and his parents\n(\nJean-Louis grandparents\n)\nwere Julien Stanislas Koszul and Hélène Ludivine Rosalie Marie Salome. Jean-Louis was the youngest of his parents four children, having three older sisters, Marie Andrée, Antoinette, and Jeanne. He was educated at the Lycée Fustel-de-Coulanges in Strasbourg before studying at the Faculty of Science in Strasbourg and the Faculty of Science in Paris.\nIn\n1947\nKoszul published three papers in\nComptes rendus de l'Academie des sciences\n. The first was\nSur le troisième nombre de Betti des espaces de groupes de Lie compacts\nⓉ\n(\nThe third Betti number of spaces of compact Lie groups\n)\nin which he completed the proof that the third\nBetti\nnumber of a simple compact\nLie group\nis one by studying certain of the exceptional groups. The second of the three papers was\nSur les opérateurs de dérivation dans un anneau\nⓉ\n(\nOn the derivation operators in a ring\n)\nin which he studied rings having a derivation operator with the formal properties of the coboundary operator of algebraic topology. This work generalised ideas due to\nLeray\n. The third of the three papers was\nSur l'homologie des espaces homogènes\nⓉ\n(\nOn the homology of homogeneous spaces\n)\nin which he applied the ideas in his second paper to cohomology rings.\nKoszul married Denise Reyss-Brion on\n17\nJuly\n1948\n; they had three children Michel\n(\nwho married Marie Françoise Chevallier\n)\n, Bertrand, and Anne\n(\nwho married Stanislas Crouzier\n)\n. He became a second generation member of\nBourbaki\nalong with\nJ Dixmier\n,\nR Godement\n,\nS Eilenberg\n,\nP Samuel\n,\nJ P Serre\nand\nL Schwartz\n.\nKoszul was appointed as Maître de Conférences at the University of Strasbourg in\n1949\n. He was promoted to professor there in\n1956\n, and remained in Strasbourg until he appointed professor in the Faculty of Science at Grenoble in\n1963\n.\nThe main topics on which Koszul undertook research included: homology and\ncohomology\nof\nLie algebra\n; relative cohomology; reductive subalgebras and the transgression theorem; the formalism of spectral sequences; \"Koszul complexes\"; proper and differentiable actions of\nLie\ngroups; slices; hermitian forms on complex homogeneous domains; bounded domains; locally flat manifolds; convex homogeneous domains; simplicial spaces; themes related to\nGelfand\n-Fuks theory and supergeometry.\nIn\n1950\nKoszul published a major\n62\npage paper\nHomologie et cohomologie des algèbres de Lie\nⓉ\n(\nHomology and cohomology of Lie algebras\n)\nin which he studied the connections between the homology and cohomology\n(\nwith real coefficients\n)\nof a compact connected\nLie\ngroup\nG\nG\nG\nand purely algebraic problems on the Lie algebra associated with\nG\nG\nG\n. Further important papers were\nSur un type d'algèbres différentielles en rapport avec la transgression\nⓉ\n(\nOn a type of differential algebra related to transgression\n)\n(1951)\n,\nSur les représentations linéaires des algèbres de Lie résolubles\nⓉ\n(\nOn linear representations of solvable Lie algebras\n)\n(1953)\n,\nSur certains groupes de transformations de Lie\nⓉ\n(\nOn some transformations of Lie groups\n)\n(1953)\n, and\nSur les modules de représentation des algèbres de Lie résolubles\nⓉ\n(\nOn the representation modules of solvable Lie algebra\n)\n(1954)\n.\nKoszul gave a lecture course in São Paulo on\nFaisceaux et cohomologie\nⓉ\n(\nBundles and cohomology\n)\n. The superb lecture notes were published in\n1957\nand covered:\nČech\ncohomology with coefficients in a sheaf; resolutions; a theorem concerning the cohomology with coefficients in a sheaf for a paracompact space; isomorphism of ordinary\nČech\ncohomology with\nde Rham\n-cohomology,\nAlexander\n-\nSpanier\n- cohomology, and singular cohomology. In the autumn of\n1958\nhe again held a seminar series in São Paulo, this time on symmetric spaces.\nR Bott\nreviews the subsequent publication decsribing the lectures as:-\n... very enjoyable. The pace is quick, and considerable material is covered elegantly. Apart from the more or less standard theorems on symmetric spaces, the author discusses the geometry of geodesics, the Bergmann metric, and finally investigates the bounded domains in considerable detail.\nIn the mid\n1960\ns Kosul lectured at the Tata Institute of Fundamental Research in Bombay\nOn groups of transformations\nand\nOn fibre bundles and differential geometry\n. The second course was on the theory of connections and the lecture notes were first published in\n1965\nand reprinted in\n1986\n. After a number of further important publications which appeared in the proceedings of various conferences that Koszul attended such as Convegno sui Gruppi Topologici e Gruppi di\nLie\nin Rome\n(1974)\n, Symplectic geometry in Toulouse\n(1981)\n, an international meeting on geometry and physics in Florence\n(1982)\n, he published\nIntroduction to symplectic geometry\nin Chinese in\n1986\n. Chuan Yu Ma writes in a review that:-\n... this beautiful, modern book should not be absent from any institutional library.\nHe also explains the background to the work:-\nDuring the past eighteen years there has been considerable growth in the research on symplectic geometry. Recent research in this field has been extensive and varied. This work has coincided with developments in the field of analytic mechanics. Many new ideas have also been derived with the help of a great variety of notions from modern algebra,\ndifferential geometry\n,\nLie\ngroups,\nfunctional analysis\n, differentiable manifolds and\nrepresentation theory\n.\n[\nKoszul's book\n]\nemphasizes the differential-geometric and topological properties of symplectic manifolds. It gives a modern treatment of the subject that is useful for beginners as well as for experts.\nKoszul was honoured with election to the\nAcademy of Sciences\nin Paris on\n28\nJanuary\n1980\n. In the following year he was elected to the Academy on São Paulo. In\n1994\na volume containing\n24\narticles by Koszul were published under the title\nSelected papers of J-L Koszul\n. The book contains a commentary by Koszul which explains the problems with which he was concerned at the time he invented what is now called the \"Koszul complex\". This was first introduced to define a cohomology theory for\nLie\nalgebras and turned out to be a useful general construction in homological algebra.\nAmong Koszul's hobbies was mountaineering and he was a member of the Club Alpin Français."
}