{
  "nome_completo": "Jean-Pierre Kahane",
  "nome_curto": "Jean-Pierre Kahane",
  "ano_nascimento": "1926",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kahane/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Jean-Pierre Kahane\nwas the son of Ernest Kahane\n(1903\n-\n1996)\nand Marcelle Élise Jeanne Wurtz\n(1900\n-\n1991)\n. The family were Jewish, a fact we must record since it had consequences after the German invasion in\n1940\n. Ernest Kahane was born in Piatra Neamt, Romania, and became a university professor of biochemistry in France. A militant antifascist and communist, he was a member of the French Resistance during the German occupation of World War II. Ernest Kahane was the son of Albert Kahane\n(1872\n-\n1963)\nand Pépi Struhl\n(1879\n-\n1948)\n. He became a French citizen on\n15\nFebruary\n1924\nand he married the chemist Marcelle Wurtz on\n27\nDecember\n1924\nin Paris. Marcelle was the daughter of Georges Jean Wurtz and Henriette Mémé Moebs.\nJean-Pierre was the oldest of his parents three children, all sons. His two brothers were André Bernard Kahan\n(1929\n-\n)\nand Roger Kahane\n(1932\n-\n2013)\n. Let us record here the following information about Jean-Pierre's brothers. André Bernard Kahan, born\n14\nNovember\n1929\nin Bois-Colombes, became a professor of physics at the University of Genoble. He is a member of the French Communist Party and a leading player of the game Go. Roger Kahane, born\n20\nDecember\n1932\nin Bois-Colombes, studied science but turned to film studies. He has directed many famous television series and films for the cinema.\nKahane attended the Lycée Henry-IV in the Latin Quarter on the left bank of the river Seine in Paris. This school, founded in\n1796\n, was one of the most prestigious lycées in France. World War II had begun on\n1\nSeptember\n1939\nwith the German invasion of Poland. On\n3\nSeptember France declared war on Germany. In May\n1940\nGerman troops invaded Holland, Belgium and Luxemburg moving on to France. German troops entered Paris on\n14\nJune and on\n22\nJune the Franco-German Armistice was signed. This limited the amount of France occupied by German troops and set up a French government in Vichy which cooperated with Germany. In Paris the occupying German forces began to move against Jewish members of the community and on\n22\nJune\n1940\nthey began to construct an internment camp at Royallieu-Compiègne. This camp, intended for French resistance fighters and Jews, was fully functioning by June\n1941\n.\nOn his\n15\nth birthday,\n11\nDecember\n1941\n, Kahane was arrested at his parents' home in a raid by German soldiers. His father, realising the danger he was in as a Jew, had left Paris for the region controlled by the Vichy government. Kahane was taken to the Royallieu-Compiègne internment camp where Jews and communists were housed, separated by barbed wire. He was put on the Jewish side of the barbed wire but showed his political beliefs through quickly making contact with the communists. One might have expected this to lead to serious consequences for Kahane but, perhaps because of his young age, he was released on\n18\nDecember. The Germans occupied Paris from\n1940\nto\n1944\n. The city was liberated in August of\n1944\n.\nIn\n1946\n, Kahane entered the École Normale Supérieure\n(\nENS\n)\nand later that year he joined the branch of the Communist Party at the ENS. In the same year he joined the Mouvement Jeunes communistes de France\n(\nMJCF\n)\n. We note that in fact the organisation only adopted this name in\n1956\nand, when Kahane joined, it was the Union de la jeunesse républicaine de France\n(\nUJRF\n)\n. In\n1947\nhe attended the\n1\nst World Festival of Youth and Students held in Prague. The festival celebrated young people's solidarity for democracy and against war and imperialism. Kahane performed exceptionally well in his mathematical studies and graduated in\n1949\nranked first in the mathematics aggregation.\nKahane joined the Syndicat National de l'Ensignement Secondaire\n(\nSNES\n)\nin\n1947\n. This union for secondary school teachers had a long history but only adopted this name in\n1944\nafter France was liberated. He became a researcher at the Centre National de la Recherche Scientifique\n(\nCNRS\n)\nin\n1949\n. He had begun publishing mathematics papers in\n1947\nwith\nSur les propriétés des asymptotiques généralisées\nⓉ\n(\nOn the properties of generalized asymptotics\n)\n. This was followed by\nQuasi-analyticité des fonctions sommes de séries de Fourier lacunaires\nⓉ\n(\nQuasi-analyticity of functions sums of gap Fourier series\n)\n(1950)\n, which he co-authored with Pierre Lalaguë,\nExtension du théorème de Carlson et applications\nⓉ\n(\nExtension of Carlson's theorem and applications\n)\n(1952)\n, and\nQuasi analyticité des fonctions moyenne-périodiques\nⓉ\n(\nQuasi Analyticity of Medium-Periodic Functions\n)\n(1953)\n.\nOn\n11\nJuly\n1951\n, Kahane married Agnès Kaczander\n(1927\n-\n2014)\n, the daughter of the engineer Maxime Kaczander of Hungarian origin, who was a communist student. They married in Paris and wished to spend their honeymoon in Hungary but were refused visas to enter Hungary. Jean-Pierre and Agnès Kahane had three daughters, Geneviève\n(\nborn\n1953)\n, Françoise\n(\nborn\n1955)\nand Catherine\n(\nborn\n1960)\n. Agnès was a translator who translated books from English and Hungarian into French.\nIn\n1954\nKahane submitted his thèse de doctorat,\nSur quelques problèmes d'unicité et de prolongement, relatifs aux fonctions approchables par des sommes d'exponentielles\nⓉ\n(\nOn some problems of uniqueness and extension, relating to functions approachable by sums of exponentials\n)\n, to the Faculty of Science in Paris. His thesis advisor was\nSzolem Mandelbrojt\n. The authors of\n[\n5\n]\nwrite:-\nIn his thesis, he proposes a new theory of the medium-periodic functions of\nDelsarte\nand\nSchwartz\n, which surpasses and greatly simplifies the work of his predecessors.\nAfter the award of his doctorate, Kahane was appointed as an assistant lecturer at the Faculty of Sciences of Montpellier, being promoted to professor in\n1958\n. When he went to Montpellier, he accompanied his father Ernest Kahane who had been appointed to set up the teaching of biological chemistry at the Faculty of Sciences there. The family lived on rue Mareschal in Montpellier, in an apartment which had been given to them by the widow of the director of Midi Libre, Jacques Bellon, who was also of Romanian origin. Both Ernest and Jean-Pierre Kahane had common commitments: both were members of the French Communist Party. They were also members of the \"Franco-Chinese Friendships\" and the Rationalist Union of Montpellier which was chaired by Ernest Kahane.\nJean-Pierre Kahane travelled in Eastern Europe during the period of the Cold War, visiting Yugoslavia, Hungary, and Romania. He was also invited to teach at the Tata Institute in Bombay in\n1957\nand at the UNESCO Centre in Buenos Aires in\n1959\n. Despite the crisis caused by the events in Hungary in the Revolution of\n1956\n, he remained loyal to his party. The Revolution was led by Imré Nagy, a communist Hungarian politician but failed when the Soviet army invaded Hungary. Nagy was arrested, secretly tried, found guilty, sentenced to death and executed by hanging on\n16\nJune\n1958\n. This enraged Kahane who wrote\n(\njointly with two colleagues\n)\nto János Kádár who was General Secretary of the Hungarian Workers' Party on\n18\nJune\n1958\n(\nsee\n[\n3\n]\n)\n:-\nWe believe that it does not serve the anti-fascist cause, the popular cause, to let pass without protest what seems to us to be a new and serious mistake by the Hungarian authorities. Enemies in principle of the death penalty, anxious to see the basic rules of justice safeguarded - and in particular the right of accused to be defended, we cannot support the execution of Imré Nagy and his companions, under conditions which were stated to us: in closed session before the opening up of the proceedings, immediate execution of the sentence without the possibility of appeal or of grace. We are convinced that a socialist democracy can be imposed without resorting to such methods.\nThe Algerian war of independence began on\n1\nNovember\n1954\n. The mathematician\nMaurice Audin\n, a member of the Communist Party of Algeria which he joined in\n1950\n, strongly supported Algeria's right to be independent of France. He was murdered by the French authorities but, after a long argument about the circumstances of his death,\nAudin\n's thesis was accepted posthumously on\n2\nDecember\n1957\nwith an\nin abstentia\ndefence at the Sorbonne. Kahane was a strong supporter and attended\nAudin\n's in abstentia defence. Kahane published an article on\n8\nFebruary\n1958\nin which he retaliated to attacks on academics by journalists, writing about the\n[\n3\n]\n:-\n... crimes committed under the guise of the Algerian war. ... You will not impose silence on academics by calling them traitors and morons.\nIn\n1961\n, the Communist Federation of Herault created a \"New University\" in Montpellier, housed Rue des Étuves, presided over by Jacques Roux, and which began with\n110\ncommunist sympathisers including Kahane and his father. Kahane, however, was about to leave Montpellier for, in\n1961\n, he was appointed Professor at the Faculty of Sciences of Paris Sud at Orsay. He served as President of the University from\n1975\nto\n1978\n. He remained a professor at Orsay for the rest of his career until he retired in\n1994\n.\nOn\n29\nJuly\n1961\nKahane flew from Paris to New York, USA, to spend four weeks at Stanford University departng on\n26\nAugust. He gives his Paris address as\n11\nrue du Val-de-Grâce, Paris.\nSoon after arriving back in Paris he joined the Syndicat National de l'Enseignement Supérieur\n(\nSNESup\n)\n. This union had come into existence in\n1956\nand had a reputation as being on the political \"left\". Michel Chaillou, the Secretary General, invited Kahane to join the office of the union and Kahane served as the next General Secretary\n1961\n-\n62\nand again\n1963\n-\n64\n. He attended the International Congress of Mathematicians held in Stockholm, Sweden, from\n15\nAugust to\n22\nAugust\n1962\n. He had been invited to deliver a one hour plenary lecture at the Congress and delivered\nTransformées de Fourier des fonctions sommables\nⓉ\n(\nFourier Transforms Summable Functions\n)\n. He gave the following introduction to his lecture:-\nIn\nFourier\nanalysis, there are probably few more natural questions than the study of\nFourier\ntransforms of summable functions. This includes, in particular, the functions, continuous on the circle, whose\nFourier\nseries is absolutely convergent\n(\nFourier\ntransforms of summable functions on the group of integers\n)\n, and the\nFourier\n-\nLebesgue\ncoefficient sequences\n(\nFourier\ntransforms of summable functions on the circle\n)\n. The subject, although long studied, remained rather mysterious: in\n1958\n, in the introduction to the second edition of his treatise,\nZygmund\ncounted, among the two or three major problems concerning the trigonometric series, that of specifying the structure of the functions having absolutely convergent\nFourier\nseries. In recent years, and particularly since\n1958\n, important progress has been made: long-sought problems have been solved; others have arisen. I would like to try to give an overall picture here, hoping that many of the delegates will have been able to hear the most remarkable recent results directly from the authors\n(\nI think, in particular, of Paul Malliavin and\nPaul J Cohen\n)\n. Interested mathematicians can also refer to the excellent work of\nWalter Rudin\n, which will appear shortly.\nHe was a member of the Central Committee of the Communist Party from\n1979\nto\n1994\n, in charge of issues relating to science, research and new technologies. He said\n(\nsee for example\n[\n3\n]\n)\n:-\nI have been a communist since the age of twenty. I was a grassroots activist, a member of a cell, a platoon, without any significant responsibility, until I was \"shoved\" as a member of the Central Committee. It was in\n1979\n. Based on me looking good and my performance as university president, I guess. But in fact there was something to be done to the Communist Party. The Communist Party has strong traditions in relation to science, with personalities who have marked it strongly like Paul Langevin, like Frédéric Joliot-Curie, and previously like Marcel Prenant. Now, there is a need to constantly reactivate, whether in the Communist Party or elsewhere, this interest in science.\nHe took on other roles such as president of the Inter-Ministerial Mission for Scientific and Technical Information from\n1982\nto\n1986\nand president of the Rationalist Union from\n2001\nto\n2004\n. He also chaired the International Commission on Mathematical Instruction of the International Mathematical Union from\n1983\nto\n1990\nand the National Mathematical Education Commission from\n1997\nto\n1999\n.\nMathSciNew lists nearly\n300\npublications by Kahane. Giving an overview of these would be impossible so let us look at some of the important books he published. We mentioned above that he taught at the UNESCO Centre in Buenos Aires in\n1959\n. Two resulting sets of his lecture notes were published in\n1961\n, namely\nAlgebras de convolucion de sucesiones, funciones y medidas sumables\nⓉ\n(\nAlgebras of convolution of successions, functions and summable measures\n)\nand\nTeoria constructiva de funciones\nⓉ\n(\nConstructive theory of functions\n)\n. In\n1963\nhis book\nEnsembles parfaits et séries trigonométriques\nⓉ\n(\nPerfect Sets and Trigonometric Series\n)\n(\nco-authored with\nRaphaël Salem\n)\nwas published. R P Boas writes in a review:-\nThis elegant book treats a variety of topics in the theory of trigonometric series - some fairly well known, but most of them quite recent - unified by the occurrence in each case of special classes of perfect sets.\nKahane's book\nSéries de Fourier aléatoires\nⓉ\n(\nRandom Fourier Series\n)\n(1963)\nwas reviewed by H Hever who writes:-\nThis is a set of lecture notes on the highly interesting subject of random\nFourier\nseries. The reader is first introduced to the elementary theory of\nFourier\nseries\n(\nand also to the notion of hyperdistribution, invented in 'Ensembles parfaits et séries trigonométriques' by the author and\nR Salem\n)\nas well as to the elements of probability theory. Here one can find a natural proof of the famous\nMarcinkiewicz\n-\nZygmund\nresult on almost sure convergence of sums of independent real random variables after translation by a suitable sequence of real numbers. As an application, the equivalence principle for sums of independent real random variables is given. ... Altogether the set of notes under review is a most desirable aid for any introduction to the \"pearls\" of the theory of random\nFourier\nseries.\nHis next book\nSome random series of functions\n(1968)\nis described by\nPaul Erdős\nas:-\n... an interesting little book\n[\nwhich\n]\ndeals with various problems and results on random series. ... The book can be recommended very highly to those who want to do further research in this interesting field, which may have many new and unexpected potentialities and to which the author has made many important contributions.\nThe International Congress of Mathematicians was held in Nice, France from\n1\nSeptember to\n10\nSeptember\n1970\n. Kahane was a member of the Organising Committee of this Congress.\nHe was elected a corresponding member of the\nAcadémie des Sciences\nin\n1982\n, and elected a full member on\n5\nJanuary\n1998\n. He was President of the\nFrench Mathematical Society\nin\n1972\n-\n1973\n. He was elected to the\nPolish Academy of Sciences\nand the\nHungarian Academy of Sciences\n. He received numerous awards including the Peccot prize at the Collège de France in\n1957\n, the Servant prize in\n1972\n, the prix d\"État des sciences mathématiques et physiques in\n1980\n, the\nMaurice Audin\nprize, the\nÉmile Picard\nmedal from the\nAcadémie des sciences\nin\n1995\n, and several more.\nHis funeral, which took place on\n30\nJune\n2017\n, was attended by a large number of people. He was buried at the Père Lachaise cemetery.\nJean-François Le Gall and Cédric Villani write\n[\n5\n]\n:-\nJean-Pierre Kahane was one of the great mathematicians of the late twentieth century, an emblematic figure during several decades of French harmonic analysis. Thanks to his extraordinary inventiveness, he has discovered many brilliant and profound results in mathematical analysis as well as in probability theory. But Jean-Pierre Kahane will also remain an outstanding character for his action in the service of the community and his political commitment to \"change the world\" as he said himself.\nLet us end with two quotes by Kahane, given in\n[\n2\n]\n:-\nI am a professional mathematician, a good mathematician. But I am also an amateur: I like to discover what others do, and I also like to flutter. At my age, I will be less and less professional. I hope to be more and more an amateur, an amateur of all that is beautiful and useful in the mathematics of the past and present.\nAs a researcher, I felt more like a gardener than an architect. So I helped to discover or create new species, which sometimes seem strange before we get used to them. However, my activity as a researcher did not follow an overall plan: I was carried by open questions, asked by my teachers, by colleagues or by chance through my reading. In each case it needed ad hoc tools, and the pleasure, as in any business, was that the tools worked well. We know that there is no pleasure without pain, and I have struggled a lot, as everyone probably has, by going astray, deceiving myself, correcting, starting again, before ending up with results that gave me the most pleasure.\nIn May\n2017\n, he wrote in\nL'Humanité\n:-\nFalse beliefs prevent society from advancing on pressing issues ... The progress of science, progress in medicine, all the progress that we can think of, translate and aggravate the inequalities in the world. They could be for the benefit of all, but they are first of all at the service of the rich and powerful."
}