{
  "nome_completo": "Jean Richer",
  "nome_curto": "Jean Richer",
  "ano_nascimento": "1630",
  "ano_morte": "1696",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Richer/",
  "lugar_nascimento": null,
  "lugar_morte": "Paris, France",
  "biografia": "Nothing is known of\nJean Richer\n's life other than his work for the\nAcadémie Royale des Sciences\n. We therefore do not know the town in which he was born, although it must be almost certain that he was born in France. Again we do not know the date of his birth; in fact the year of\n1630\nthat we give, although generally accepted by most historians, is simple a guess based on the fact he joined the\nAcadémie\nas a junior astronomer in\n1666\n. This certainly means that he must have had a good education, and later in life he worked as an engineer without\n(\napparently\n)\nany further training, so it is certainly possible that his education before joining the service of the\nAcadémie\nincluded gaining some engineering skills. He became a member of the\nAcadémie Royale des Sciences\nin\n1666\nwith the title of 'élève astronome' which means that he was an assistant astronomer. By\n1670\n, however, he had been given the title 'mathematician' by the\nAcadémie\n. He spent the next three years undertaking work for the\nAcadémie\n.\nAlmost all that is known about Richer relates to two scientific expeditions he made for the\nAcadémie des Sciences\n. These were the first expeditions undertaken for purely scientific purposes, all earlier expeditions being mainly for political reasons. In fact organising scientific expeditions must have been in the mind of the founders of the\nAcadémie des Sciences\nand seen by them as one of the reasons to set up a formal organisation. Three weeks after the first meeting of the\nAcadémie\n, on\n11\nJanuary\n1667\n,\nAdrien Auzout\nread a memoir to a meeting of the\nAcadémie\nproposing a scientific expedition to Madagascar.\nAuzout\n[\n6\n]\n:-\n... had discerned with remarkable insight the great scientific possibilities of such a voyage. Moreover, the ends of the expedition as he conceived them were exclusively scientific. In the memoir there is no naiveté, no crudely economic motivation.  A considerable gulf separates these lucid proposals from the confused ideas about scientific voyaging current in scientific circles in Paris and in London at the time ...\nOver the following months, discussions on what might be achieved focused largely on testing\nHuygens\n' proposals for solving the longitude problem using pendulum clocks. After\nGiovanni Cassini\narrived in Paris in early\n1669\nto head the new Observatory, the secretary of the Académie records that they\n(\nsee\n[\n6\n]\n)\n:-\n... began to discuss sending observers under the patronage of our most munificent King into different parts of the world to observe the longitudes of localities for the perfection of geography and navigation.\nIn February\n1670\n, Richer was paid for experiments and astronomical observations he had carried out for the\nAcadémie des Sciences\nduring in the previous months. In fact one month earlier, M Meurisse and J Richer had been listed as\n(\nsee\n[\n6\n]\n)\n:-\n... mathematicians designated to go to Cayenne to make astronomical observations of utility to navigation.\nBy March\n1670\n, Colbert wrote that the\nAcadémie\nwas to send assistants Jean Richer and M Meurisse to the East Indies\n(\nsee\n[\n7\n]\n)\n:-\n... to make various astronomical observations in connection with others which are to be made here\n[\nin Paris\n]\n, and to test the clocks which have been constructed for the determination of longitude at sea.\nRicher and Meurisse, following their luggage and instruments, went to La Rochelle, from where the ship was to depart, and while there Richer measured the height of the tides at the vernal\nequinox\n. Eight days later the ship sailed from La Rochelle for Madagascar but neither Richer nor Meurisse were on board. It appears that\nHuygens\n' clocks, which were to be tested on the voyage, had failed to arrive in time, for Colbert received a letter\n[\n7\n]\n:-\nM Richer's clocks arrived here after the departure of the Persian squadron\n[\nto Madagascar\n]\n. I think it will be decided to send him to Acadia. It is a voyage from east to west during which he will be able to make his experiments; and, if he returns in time, it will be possible for him to embark on Le Breton\n[\nfor the East Indies\n]\nin October.\nA rival method for determining the longitude to that proposed by\nHuygens\nusing marine pendulum clocks had been proposed by Jean Deshayes. It now appears the opportunity was taken to have the two methods compete against each other. Colbert received the letter from La Rochelle\n[\n7\n]\n:-\nI have already had the honour to write you that Richer will embark with his clocks on the 'Saint Sébastien' for Acadia. Deshayes will also sail on the same vessel with the instrument that he has made in Paris. It is to be hoped that from the contact of these two men, who are embarking on good terms, knowledge will result with which you may be satisfied.\nThere is no definite proof that Jean Deshayes did in fact sail on the 'Saint Sébastien' for he is not mentioned again. However, the most likely scenario is that he did make the voyage but, not obtaining worthwhile results, made no report. The 'Saint Sébastien' was delayed in La Rochelle because of bad weather but sailed on\n1\nMay. Soon after leaving port the ship ran into a heavy storm and, before the conditions improved, both of\nHuygens\n' clocks that Richer was to test had stopped. One had been badly damaged in a fall but neither clock was restarted and this part of the science was not tested. Richer did, however, make some remarkably good determinations of latitude on the voyage. He found a value of\n47\n°\n21\n' for Belle-Île, off the French coast, which is correct to the nearest minute. Arriving in Canada, Richer measured the latitude of the French fort at Pentagoûët as\n44\n°\n23\n'\n20\n\". This observation is remarkable, first because Richer had the confidence to give the reading in degrees, minutes and seconds where all measurements at the time were only given in degrees and minutes, second because it is remarkably close to the correct value of\n44\n°\n23\n'\n25\n\". Some historians have claimed that Richer must have been lucky to get all his readings as close as he did, but since his measurements are consistently good it is only fair to assume that he was an observer of extraordinary high ability.\nOn his return Richer from Acadia reported the failure of the clocks to\nHuygens\nand to the\nAcadémie\n.\nHuygens\naccused Richer of incompetence in a letter in which he declared that\n[\n7\n]\n:-\nRicher's handling of the clocks had been bad throughout the voyage. For want of a little oil, properly applied, the clocks had been needlessly damaged and afterward more or less ruined; for want of attention to the written instructions provided, they had not been started again after the storm so that they might be observed during the balance of the voyage. In short, he concluded, \"the want of success on this occasion, as far as I can judge, stems more from the carelessness of the observers than from the failure of the clocks.\"\nThis is unfair on Richer, but\nHuygens\nhad placed such high hopes on his ideas that he had to find someone to blame. Only several years later did\nHuygens\nadmit that pendulum clocks were not likely to be the answer to the longitude problem.\nBy September\n1670\nRicher was back in Paris following his visit to Acadia. Preparation began for a scientific expedition to Cayenne, French Guyana, and, after slow but steady progress, Richer's passport was issued in September\n1671\n. He was to lead the expedition, assisted by Meurisse, and after the equipment and supplies were made ready in October, Richer discussed the final details of the research to be undertaken with\nGiovanni Cassini\nin the Paris Observatory in November. What were these aims that these two scientists discussed?\n[\n7\n]\n:-\nThe principal questions with which the expedition was concerned were three in number: the movements of the sun and the planets, refraction, and\nparallax\n.\nGiovanni Cassini\n, and also\nJean Picard\n, hoped that a station close to the equator, where the planets and the sun were nearer the observer's zenith, would practically eliminate the effects of refraction. A great improvement in existing tables of solar and planetary motions would thus be made possible. In addition to testing the accuracy of existing tables of refraction, it was hoped to discover the observational errors which might result from any considerable parallax of the planets. The successful determination of solar parallax, a fundamental astronomical constant, would open the way to the long-sought knowledge of the actual dimensions of the\nsolar system\n.  No one appears to have regarded the investigation of the length of a seconds pendulum as a principal task of the expedition.\nThe expedition left La Rochelle on\n8\nFebruary\n1672\n, later than intended but this was fortunate since it meant that observations of Mars would be made by Richer at the time of the planet's closest approach to the Earth. His first task there was to measure the parallax of Mars and the observations were to be compared with those taken at other sites in order to compute the distance to the planet. Richer made careful observations of the planet during August, September and October of\n1672\n. He measured the meridian altitude of the planet and of near-by stars as well as the precise time when the planet made its meridian transit.\nGiovanni Cassini\nobserved the planet from the Paris Observatory and later used his own data and that of Richer to compute the parallax of Mars. Using\nKepler\n's laws, his data enabled the scale of the solar system to be computed with reasonable accuracy for the first time\n[\n3\n]\n:-\nThe figure\nCassini\ncame up with for the Sun-Earth distance,\n140\nmillion km, was only\n7\npercent less than the accepted modern value\n(149\n.\n6\nmillion km\n)\n, and gave the first accurate indication of the scale of the Solar System.\nIn fact, as we have mentioned when discussing other results of this expedition, historians are surprised at the accuracy that was achieved. Later astronomers failed to obtain results which were as accurate as those obtained by Richer and\nCassini\nand it was only in\n1769\n, nearly\n100\nyears later, that a more accurate value for the distance of the Earth to the sun was obtained using data from transits of Venus.\nRicher's second important work on this expedition to Cayenne was to calculate the length of the seconds pendulum in Cayenne and compare this with the length of the seconds pendulum in Paris. Note that the \"length of the seconds pendulum\" is the length of a pendulum whose period is precisely one second. This observation was certainly not considered as a particularly important one when the aims of the expedition were being discussed but Richer rightly saw it as highly significant for he wrote in his report:-\nOne of the most important observations I have made is that of the length of the seconds pendulum, which has been found shorter in Cayenne than at Paris. For the same measurement marked on an iron rod in the former place in accordance with the length found necessary to make a seconds pendulum was transported to France and compared with the Paris measurement. The difference between them was found to be\n11\n4\n\\large\\frac{11}{4}\\normalsize\n4\n1\n1\n​\nlines, by which the Cayenne measurement falls short of the Paris measurement, which is\n3\nfeet,\n183\n5\n\\large\\frac{183}{5}\\normalsize\n5\n1\n8\n3\n​\nlines\n[\na line is\n1\n144\n\\large\\frac{1}{144}\\normalsize\n1\n4\n4\n1\n​\npart of a foot\n]\n. This observation was repeated during ten whole months, when no work passed without its being carefully performed several times. The vibrations of the simple pendulum which was used were very short and remained quite perceptible up to\n52\nminutes, and were compared with those of an extremely good clock whose vibrations indicated seconds.\nIsaac Newton\nexpressed the results of Richer's experiment somewhat differently in the\nPrincipia\nwhen he stated how Richer's pendulum clock which kept perfect time in Paris, went slow in Cayenne:-\nNow several astronomers, sent into remote countries to make astronomical observations, have found that pendulum clocks do accordingly move slower near the equator than in our climates. And, first of all, in the year\n1672\n, M Richer took notice of it in the island of Cayenne; for when, in the month of August, he was observing the transits of the fixed stars over the meridian, he found his clock to go slower than it ought in respect of the mean motion of the sun at the rate of\n2\nm\n28\ns a day.\nThese experimental results by Richer supported\nNewton\n's theoretical claims that the Earth was flattened at the poles. Only after\nJacques Cassini\npublished\nDe la grandeur et de la figure de la terre\nⓉ\n(\nOn the size and shape of the earth\n)\n(1720)\nin which he claimed that the Earth was elongated at its poles did a vigorous conflict arise between the English followers of\nNewton\nand the French followers of\nJacques Cassini\n.\nIn addition to these extremely important results of the expedition, there were other results of some importance. Richer measured the positions of many southern hemisphere stars not visible from Paris. He also made many observations of the sun which allowed a much more accurate timing of the equinoxes to be calculated. This in turn meant that more accurate positions of all stars could be deduced. He made many observations of all the planets and the moon. In Cayenne, as he had done on his earlier expedition, he made measurements of the height of the tides. He published all his observations in his only written work\nObservations astronomiques et physiques faites en l'isle de Caienne\nⓉ\n(\nAstronomical and physical observations made on the Isle of Cayenne\n)\n(1679)\n. It had been intended that Richer carry with him on the voyage a new remodelled marine clock designed by\nHuygens\n. However, the clock was not ready in time and so was not carried on the journey.\nHuygens\n, who unfairly blamed Richer for the failure of the earlier trial of his marine clocks, said he was glad that the clock was not ready in time for Richer to test it! We should mention that Richer's assistant, Meurisse, died in Cayenne in\n1673\nshortly after Richer, who himself had become ill, left Cayenne on\n25\nMay\n1673\nand returned to France earlier than he had intended.\nAfter Richer returned to Paris, his service to the\nAcademy of Sciences\nwas terminated. He was given the title of 'royal engineer' and undertook work on fortifications working under Vauban. In\n1679\nRicher was elected to full membership of the\nAcademy of Sciences\n. No information has been found about his life after this date except for the record of the date of his death. We end this biography with a quotation from\n[\n6\n]\n:-\nRicher's skill as an observer, the presumable quality of his instruments, his involvement in the current efforts to improve standards of observational accuracy - all these ... have a bearing on the quality of the results of which he was capable when conditions were favourable."
}