{
  "nome_completo": "Jeremiah Horrocks",
  "nome_curto": "Jeremiah Horrocks",
  "ano_nascimento": "1618",
  "ano_morte": "1641",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Horrocks/",
  "lugar_nascimento": "Toxteth, Liverpool, England",
  "lugar_morte": "Toxteth, Liverpool, England",
  "biografia": "Jeremiah Horrocks\n' mother was Mary Aspinwall, while his father, who was a farmer, is variously recorded as William Horrocks or James Horrocks. There is some evidence that Horrocks' father came from the Deane district of Bolton, although this is far from certain, but we do know that his mother was from a notable Toxteth Park family. Certainly some members of the family were watchmakers and it is said that a watchmaker brother of Mary Aspinwall first interested Jeremiah in astronomy. We have no certain information concerning the size of the family, although we do know that Jeremiah had a brother named Jonas.\nWe know nothing of Horrocks' early education, but we do know that he entered Emmanuel College, Cambridge, on\n11\nMay\n1632\n. This young age, only thirteen or fourteen, might make us double check the date of his birth. We should explain that we have deduced the year of his birth from the certain knowledge of the date of his death, and a report that he died at the age of\n22\n. Some historians give\n1617\nand others give\n1619\nas the year of his birth. However, we should not be suspicious of the date of his birth on account of his entering Cambridge at the age of thirteen or fourteen since this was a common age to begin a university education at this time. He entered Cambridge as a\nSizar\nwhich means that he did not have the means to support himself and was given specific menial duties to compensate for a reduction in the fees.\nAlthough no record of Horrocks' university education exists, we know that at this time all students studied a set course which covered classical languages, literature, and divinity. A very minor part of the course would cover\nEuclid\n's\nElements\nand\nPtolemy\n's astronomy. Since Horrocks left Cambridge with a deep knowledge of the latest ideas in astronomy due to\nCopernicus\nand\nKepler\n, as well as the expertise in mathematics to further develop their ideas, this tells us that he studied mathematics and astronomy in his own time. He left Cambridge in\n1635\nand returned to Toxteth Park. He did not graduate at Cambridge, but this is consistent with his financial status and many poor students left university without a degree since they could not afford the cost of graduation.\nSoon after his return to Lancashire, Horrocks began a scientific correspondence with William Crabtree a merchant in Broughton, near Manchester. Chapman suggests that John Worthington of Manchester, who had been an undergraduate at Cambridge at the same time as Horrocks, probably introduced Horrocks and Crabtree. By\n8\nJune\n1639\nHorrocks was in the village of Much Hoole, near Preston, since we have copies of correspondence he wrote from that village. He himself describes Much Hoole as:-\n... an obscure village ... about fifteen miles to the north of Liverpool.\nIt is probable that he went to Much Hoole as a curate and to act as a tutor to the children of the Stones family, and if so he would have lived at Carr House, the Stones family residence.\nIn\n1635\nHorrocks began to use\nLansberge\n's tables to compute planetary positions and to compare the answers with his own observations. He soon discovered that\nLansberge\n's tables were seriously wrong and he realised that the tables were based on a false planetary theory. He turned to\nKepler\n's\nTabulae Rudolphinae\nⓉ\n(\nThe Rudolphine tables\n)\nwhich had been published in\n1627\n. Comparing the theoretical positions with his own observations he realised that these were by far the most accurate tables and that they were founded on a correct planetary theory. He therefore accepted\nKepler\n's theory of elliptical orbits for the planets and tested\nKepler\n's laws by direct observation. However he rejected\nKepler\n's theory of why the planetary orbits were ellipses, which was based on alternate attraction and repulsion of a planet by the sun.\nHorrocks then proposed that the planets had a tendency to fall towards the sun. He wrote:-\nThe sun's conversion doth turn the planet out of this line framing its motion into a circle, but the former desire of the planet to move in a straight line hinders the full conquest of the sun and forces it into an elliptical figure.\nNot content with this theory without evidence, he supported it by analogy with the conical pendulum. He noted that if the bob was drawn back and released then it followed an elliptical path, and moreover the major axis rotated in the direction of revolution exactly as did the apsides of the moon's orbit. He also claimed, correctly, that comets and the moon followed elliptical orbits. Now with his greater understanding, Horrocks set to work improving\nKepler\n's tables.\nKepler\nhad predicted a transit of Venus would occur in\n1631\n, and that another would occur in\n1761\n.\nKepler\nhad died in\n1630\nbut even if he had lived he would not have seen the transit of\n1631\nsince it was not visible in Europe as the sun was below the horizon during the transit. Horrocks, after correcting\nKepler\n's tables realised that a transit of Venus would occur on\n24\nNovember\n1639\n, and that it would be visible from England. He wrote to his friend Crabtree and both planned to observe the transit. Horrocks purchased a simple telescope which he set up to project an image of the sun onto a graduated circle six inches in diameter.\nHorrocks wrote in\nVenus in Sole Visa\n(\nsee\n[\n8\n]\n)\n:-\nI watched carefully on the\n24\nth\nfrom sunrise to nine o'clock, and from a little before ten until noon, and at one in the afternoon, being called away in the intervals by business of the highest importance which, for these ornamental pursuits, I could not with propriety neglect. But during all this time I saw nothing in the sun except a small and common spot ... This evidently had nothing to do with Venus. About fifteen minutes past three in the afternoon, when I was again at liberty to continue my labours, the clouds, as if by divine interposition, were entirely dispersed, and I was once more invited to the grateful task of repeating my observations. I then beheld a most agreeable spectacle, the object of my sanguine wishes, a spot of unusual magnitude and of a perfectly circular shape, which had already fully centred upon the sun's disc on the left, so that the limbs of the Sun and Venus precisely coincided, forming an angle of contact. Not doubting that this was really the shadow of the planet, I immediately applied myself sedulously to observe it.\nHorrocks was able to make some deductions from his observations which gave greatly improved data. He gave an excellent value for the apparent diameter of Venus, far superior to any previously found. He was also able to give greatly improved data for the orbit of Venus, finding better values for the radius of the orbit, its eccentricity and inclination to the ecliptic. Although he had only been able to make three observations of the transit from the same site, Horrocks was able to compute the distance of the earth to the sun far more accurately than any previously found. His value of\n[\n8\n]\n:-\n... at least\n15\n000\nsemidiameters of the earth.\ngives around\n60\n000\n000\nmiles\n(\nthe correct value is\n93\n000\n000)\n.\nThe last letter we have from Horrocks written in Much Hoole was on\n20\nApril\n1640\n. Shortly after that he returned to Toxteth where he wrote\nVenus in Sole Visa\nfrom which we quoted above. Although he is best known for his observations of the transit of Venus in\n1639\n, Horrocks' most important work was his lunar theory. He realised that the moon's orbit was perturbed by the sun\n(\nremember that he worked before\nNewton\nproposed his theory of universal gravitation\n)\nand was able to give a lunar theory which was much better than anything available at the time. In fact Horrocks' lunar theory was used for around\n100\nyears, a remarkable achievement. It is described in detail in\n[\n16\n]\nwhere Wilson traces the origin of Horrocks' theory in\nKepler\n's work on the motion of the moon, as transformed and calibrated by further data, in particular critical data concerning the duration of lunar eclipses. The final theory includes an explanation of the inequality depending on both elongation and anomaly of the moon by means of a variable eccentricity and an oscillating apse line.\nAll we know of Horrocks' death at the age of\n22\nis what Crabtree wrote on a bundle of Horrocks' letters:-\nMr Jeremiah Horrocks's letters to me for the years\n1638\n,\n1639\n,\n1640\nup to the day of his death, very suddenly, on the morning of the\n3\nrd\nJanuary\n[1641]\n; the day before he had arranged to come to me. Thus God puts an end to all worldly affairs. I have lost, alas, my dear Horrocks. Hinc illae lachrimae\n[\nthus the tears fall\n]\n. Irreparable loss.\nApplebaum writes in\n[\n1\n]\n:-\nHorrocks' papers remained with his family but a short time. Part of them were destroyed in the course of the English civil war, part were taken by a brother\n[\nJonas\n]\nto Ireland and never seen thereafter, and still another portion was destroyed in the Great Fire of\n1666\n. The remainder passed into the hands of an antiquary, who also managed to obtain letters by Horrocks from the Crabtree family. From the late\n1650\n's until their eventual publication, Horrocks' manuscripts were widely circulated. the first part to be printed was his treatise on the transit, \"Venus in Sole Visa\"\nⓉ\n(\nVenus seen in the sun\n)\n, which was published by Hevelius in\n1662\n. The newly founded\nRoyal Society\nassumed responsibility for publication of most of the remainder as \"Opera posthuma\"\nⓉ\n(\nPosthumous works\n)\nin\n1672\n-\n73\n."
}