{
  "nome_completo": "Johann(III) Bernoulli",
  "nome_curto": "Johann(III) Bernoulli",
  "ano_nascimento": "1744",
  "ano_morte": "1807",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernoulli_Johann(III)/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Johann\n(\nIII\n)\nBernoulli\nwas a son of\nJohann\n(\nII\n)\nBernoulli\n. He was certainly considered a prodigy when a child with an encyclopedic knowledge and, like many other members of his extraordinarily talented family, he studied law and took an interest in mathematics.\nYou can see the Bernoulli family tree at\nTHIS LINK\n.\nAt the early age of fourteen he graduated with the degree of master of law. He was appointed to a chair at\nBerlin Academy\nat the age of only\n19\n. Frederick II asked him to revive the astronomical observatory of the Academy but this was not a task for which Johann\n(\nIII\n)\nwas particularly well suited. His health had never been particularly good and his qualities as an astronomical observer were relatively poor.\nJohann\n(\nIII\n)\nBernoulli wrote a number of works on astronomy, reporting on astronomical observations and calculations, but these are of little importance. Strangely his most important contributions were the accounts of his travels in Germany which were to have a historical impact.\nIn the field of mathematics he worked on\nprobability\n, recurring decimals and the theory of equations. As in his astronomical work there was little of lasting importance. He did, however, publish the\nLeipzig Journal for Pure and Applied Mathematics\nbetween\n1776\nand\n1789\n.\nHe was well aware of the famous mathematical line from which he was descended and he looked after the wealth of mathematical writings that had passed between members of the family. He sold the letters to the\nStockholm Academy\nwhere they remained forgotten about until\n1877\n. At that time when these treasures were examined,\n2800\nletters written by Johann\n(\nIII\n)\nBernoulli himself were found in the collection."
}