{
  "nome_completo": "John Wilson",
  "nome_curto": "John Wilson",
  "ano_nascimento": "1847",
  "ano_morte": "1896",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilson_John_2/",
  "lugar_nascimento": "Montrose, Angus, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "John Wilson\n's father was James Wilson, the rector of James Wilson Academy, Bannockburn, Stirlingshire. John Wilson was an undergraduate at the University of Edinburgh and graduated with an M.A. He then entered the New College where he was trained for the ministry, becoming a licensed preacher in the Free Presbytery of Edinburgh. Wilson did not seek a charge, but instead went to help his father at James Wilson Academy, Bannockburn\n[\n1\n]\n:-\nIn addition to his work in Bannockburn he established and conducted evening science classes in Stirling long before work of this kind was taken up by the Educational Boards.\nWilson's father retired from being rector of the Academy and Wilson took charge of the school until\n1887\nwhen it was merged with the Public School. He then moved to Edinburgh and became a Tutor in Mathematics and Natural Philosophy:-\n[\nHe\n]\nsoon acquired a sound reputation as a conscientious and efficient teacher ... His 'Notes on Physics and Natural Philosophy', an epitome of physical principles arranged alphabetically, admirably fulfilled the purpose intended, as many grateful graduates can testify.\nWilson joined the\nEdinburgh Mathematical Society\nin February\n1885\n, two years after the Society was founded. He was Treasurer of the Society during\n1888\n-\n1895\n, then President for session\n1896\n-\n97\n.\nThe\nRoyal Society of Edinburgh\nelected Wilson to a fellowship of the Society on\n4\nFebruary\n1878\n. He had been proposed by\nPhilip Kelland\n, James Sime, Thomas A Graham Balfour, and\nPeter Guthrie Tait\n. Wilson's obituary, written by\nC G Knott\n, appeared in John Wilson,\nProc. Roy. Soc. Edinburgh\n22\n(1897\n-\n99)\n, i-ii.\nWe give a version of this obituary at\nTHIS LINK\nOn Thursday,\n10\nth\nDecember\n1896\nthe following announcement of Wilson's death appeared in\nThe Scotsman:-\nAnnouncement has bean made of the death of the Rev. John Wilson, M.A., F.R.S.E.,\n25\nBuccleugh Place, Edinburgh, who was at one time Rector of Bannockburn Academy, having succeeded his father in that office. For the last ten years he resided in Edinburgh, following the vocation of a Mathematical tutor. Mr Wilson was a mathematician of a high order, and took a deep interest in the advancement of his favourite science. He was an active member of the\nEdinburgh Mathematical Society\n, of which for a number of years he acted as treasurer, and of which he was elected president only a few weeks ago.\nHe was a frequent attender at the meetings of the\nRoyal Society of Edinburgh\n, and some years ago he made some original contributions on \"Linkages\" to the Society. Mr Wilson, who was for long an elder of the Free High Church, was a modest, unassuming, warm-hearted, kindly man, and his death brings with it keen and lasting regret to a large circle of friends."
}