{
  "nome_completo": "John Playfair",
  "nome_curto": "John Playfair",
  "ano_nascimento": "1748",
  "ano_morte": "1819",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Playfair/",
  "lugar_nascimento": "Benvie (near Dundee), Scotland",
  "lugar_morte": "Burntisland, Fife, Scotland",
  "biografia": "John Playfair\nwas the eldest son of the Reverend James Playfair, minister of Benvie, a small town near Dundee\n(\nthen in Perthshire, now in Angus\n)\n, Scotland. He was educated by his father at home until the age of fourteen, when he was sent to the University of St Andrews to study for a general degree with the aim of entering the Church. Playfair was awarded a scholarship to the University in\n1762\n, and there his aptitude and keenness to study gained him both the respect and friendship of his professors. His progress in the mathematical sciences was so rapid that the professor of natural philosophy\n(\nphysics was still called natural philosophy in St Andrews when I\n[\nEFR\n]\nstudied it in the\n1960\ns\n)\n, Professor Wilkie, when suffering from an illness, found him to be the person best qualified to deliver his lectures on natural philosophy. Playfair graduated from the University of St Andrews with an M.A. in\n1765\n.\nIn\n1766\n, while still only eighteen, Playfair entered a contest for the Chair of Mathematics at Marischal College in Aberdeen. In this contest, which lasted eleven days, he distinguished himself and gained great recognition. The extent of mathematical knowledge required to be successful in such a contest was immense. Playfair was unsuccessful, however, finishing third out of the six candidates, behind the Reverend Dr\nTrail\n, who was appointed to the Chair, and Dr Hamilton, who succeeded him in the Chair. However Playfair, at a very young age, had proved his extraordinary talent combined with his comprehensive knowledge of mathematics.\nGoing on to study divinity at the University of St Andrews, Playfair undertook his theological studies at St Mary's College, St Andrews. On completion of his studies in\n1769\n, he left the University, and from then on spent much of his time until\n1773\nin Edinburgh. There he mixed with the luminaries of the Scottish Enlightenment\n(\nsee\n[\n3\n]\n)\n; which included such great scholars as Dugald Stewart the mathematician\n(\nson of\nMatthew Stewart\n)\n, Adam Smith the economist, Joseph Black the chemist, James Hutton the geologist, Robert Adam the architect and engineer, and Principal Robinson the historian.\nDuring the period between\n1769\nand\n1773\n, Playfair had twice attempted to obtain an academic post. His first attempt was in\n1769\nbut it was unsuccessful. He continued, however, in his vocation as a minister and was licensed to preach by Dundee Presbytery in\n1770\n. In\n1772\nPlayfair applied for the Chair of Natural Philosophy in the University of St Andrews, which was left vacant after the death of his friend Wilkie but again another candidate was appointed. Having failed to obtain an academic post Playfair returned to Edinburgh where he remained until his father's death in\n1772\n.\nPlayfair was nominated by Lord Gray to succeed his father as the Parish Minister of Liff and Benvie and he moved to Liff to supervise the education of his brothers and sisters. Almost a year had elapsed, however, before his nomination was confirmed, as Lord Gray's rights of presentation were disputed by the Crown of Lawyers. The case went before the Court of Session and, in August\n1773\n, Playfair received confirmation by a resolution of the General Assembly of the Church. He was then ordained the Minister of Liff and Benvie in succession to his father.\nDuring this period Playfair did not neglect his own academic studies, and beside making occasional visits to Edinburgh, he made an excursion in\n1774\nto Schiehallion, Perthshire, to conduct experiments with\nNeville Maskelyne\n, the Astronomer Royal. They became lifelong friends and\nMaskelyne\nintroduced him to the leading scientific men of the day. He persuaded Playfair to submit his first successful paper on mathematics to the\nRoyal Society of London\nand this was published in the\nPhilosophical Transactions\nin\n1779\n. This first mathematical paper by Playfair\nOn the Arithmetic of Impossible Quantities\n, has been described as exhibiting\n[\n12\n]\n:-\n... a greater taste for purely analytical investigation than shown by any of the British mathematicians of that age.\nPlayfair became Moderator of the Synod but soon after this he received, in\n1782\n, a lucrative offer to resign his church position and to become the tutor to the two sons of Ferguson of Raith. He tutored Ronald Ferguson and his brother from\n1782\nuntil\n1787\n. This involved moving closer to Edinburgh, and he was thus able to participate in the city's intellectual life. Playfair became involved in the establishment of the\nRoyal Society of Edinburgh\nin\n1783\nand was one of the original Fellows of that\nSociety\n. During a vacation he made his first visit to London, where\nMaskelyne\nintroduced him to the scientific world.\nIn\n1785\nPlayfair was appointed Joint Professor of Mathematics in the University of Edinburgh, a position which he was to hold for twenty years. Two years later, after completing his tutoring duties for the Ferguson's, he moved to Edinburgh, joining his mother and sisters, who had for some years been resident in Edinburgh. From\n1787\nPlayfair published on various topics in the\nTransactions of the Royal Society of Edinburgh\nand also contributed to the\nEdinburgh Review\n.\nIn\n1793\nPlayfair's brother James, who was established in London as an architect, died suddenly. Playfair interrupted his studies to make the family's arrangements. In the following year, he adopted James's eldest son, William Henry Playfair, then only six years of age. William would follow in his father's footsteps and also become an renowned architect.\nIn the eighteenth century geometry was systematically studied from\nEuclid\n's\nElements\nin the universities, while the schools were generally content to accept the theorems and constructions without proof. However, mathematicians began to demand more rigour with the growing interest in analytic investigation. In\n1795\nPlayfair published an edition of the\nElements\nwhich he intended for use by his students. The main innovation was Playfair's use of algebraic notation to abbreviate the proofs which he taught in his class. This was intended to avoid the \"tediousness and circumlocution\" of geometric theory.\nThe difficulties encountered by those who studied the\nElements\nin the eighteenth century centred around two problems. Firstly, there was the contentious \"parallel\" postulate. The second problem was\nEuclid\n's theory of proportion, derived from\nEudoxus\n.\nRobert Simson\nof Glasgow University had, in his\n1756\nedition of the\nElements\n, given a proof of the parallel axiom based on another assumption. Playfair solved this difficulty in\n1795\nwith a retatement of Euclid's\nEuclid\n's parallel axiom:-\nTwo straight lines cannot be drawn through the same point, parallel to the same straight line, without coinciding with one another.\nThis form of axiom was certainly not new as it had already been given in the fifth century by\nProclus\n. It is curious that Playfair's name should be associated with this axiom, particularly since he clearly points out that he derived the axiom from\nProclus\n.  Later writers rephrased this as:-\nGiven a line and a point not on the line, it is possible to draw exactly one line through the given point parallel to the line.\nand this is what is usually known as Playfair's Axiom.\n[\n16\n]\nPlayfair standardised the notation for points and sides of figures in the first six books of his edition of\nEuclid\n. To these books, which specifically deal with plane geometry, Playfair added three more books intended to supplement the preceding six; On the\nQuadrature\nof the Circle and the Geometry of Solids\n,\nElements of Plane and Spherical Trigonometry\nand\nThe Arithmetic of Sines\n. He also included a section of notes in the form of an appendix, which gave his reasons for the alterations made throughout the volumes, and an illuminating discussion on the difficult topic of parallel lines. The fact that it ran to six editions shows the popularity of Playfair's edition of\nEuclid\n. The author of\n[\n15\n]\nclaims that:-\n... Playfair's intervention saved\nEuclid\nfor a hundred years from its inevitable fate!\nPlayfair suffered a severe attack of rheumatism, during the early part of\n1797\n. This did not prevent him writing however, and during this time he wrote\nAn Analytical Treatise on the\nConic Sections\n, and an\nEssay on the Accidental Discoveries Which Have Been Made By Men of Science, Whilst In Pursuit of Something Else, Or When They Had No Determinate Object in View\n.\nThe death of his friend,\nJames Hutton\n, moved Playfair to compose a biographical memoir, which gradually became a reply to the critics of\nHutton\n's theories of geology. This in turn gave rise to Playfair's geological work\nIllustrations of the Huttonian Theory of the Earth\n. Playfair presented\nHutton\n's theories in a different style from\nHutton\n's original presentation.\nHutton\nhad a rather peculiar style of presentation which made his theory less intelligible and, as a result, he had received less acclaim than he deserved. It was a style which led to many erroneous misrepresentations and to attacks from the few who had read it. Playfair's simple and eloquent style consisted of a series of chapters clearly stating the Huttonian theory, giving the facts to support it, and the arguments given against it. The success of Playfair's presentation can be judged by the fame and credit which have since been given to\nHutton\n, who is now regarded as the first great British geologist. The\nIllustrations\n[\n12\n]\n:-\n... not only gave popularity to\nHutton\n's theory, but help to create the modern science of geology.\nPlayfair spent almost five years, from\n1797\nto\n1802\n, writing the\nIllustrations\n. The majority of his spare time he spent travelling through Great Britain, in pursuit of his geological studies. Playfair had hoped to extend his researches to the Continent, but he was prevented in doing so by the war in Europe. He turned his attention to Ireland, making visits to Dublin and to the Giant's Causeway.\nIn\n1803\nPlayfair published his biographical sketch of Hutton in the\nTransactions of the Royal Society of Edinburgh\n. This work was described over a century later as\n[\n12\n]\n:-\n... a work for which luminous treatment and graceful direction, stands still without a rival in English Geological literature.\nPlayfair was a successful teacher in his position as Professor of Mathematics at the University of Edinburgh, lecturing with a verve for the subject, doing his utmost to inspire his students with an enthusiasm for mathematical investigation, and rewarding those who succeeded by praising them in front of the class. He was described as a 'magnetic teacher' who\n[\n3\n]\n:-\n... carried on with considerable aplomb after\n1800\nan established tradition of brilliant exposition and effective pedagogy associated since at least the seventeenth century with Scotland's solid Presbyterian schooling and its eloquent university facilities.\nPlayfair was among the first in Britain to teach modern analysis. His course on this topic was attended by many who had long before completed their academic studies. To express their gratitude, class members presented Playfair with a precious astronomical circle, which was placed in the Observatory of the Astronomical Institution. However, despite his success as a mathematician, Playfair exchanged the Chair of Mathematics for the Chair of Natural Philosophy in\n1805\n. Two years later he was elected a Fellow of the\nRoyal Society of London\n.\nThe Astronomical Institution of Edinburgh was founded in\n1811\n, preceding the\nRoyal Astronomical Society\nin England by nine years, making it the first British society devoted to astronomy. Playfair was its first president. The New Observatory on Calton Hill was built largely through Playfair's efforts in support of the project.\nIn\n1812\nPlayfair published the first of the volumes of his\nOutlines of Natural Philosophy\n, again intended primarily for the use of his students. The first volume covered dynamics, mechanics, hydrostatics, hydraulics, aerostatics, and pneumatics. The second volume was entirely devoted to astronomy, while a third volume, which was intended to complete the series and cover the subjects of optics, electricity, and magnetism, was never completed.\nIn\n1815\nPlayfair succeeded his friend and colleague, Professor Robison, as the Secretary of the\nRoyal Society of Edinburgh\n. Playfair published many papers in the\nTransactions\nof the Society including a set of meteorological tables constructed from his own observations.\nLater in\n1815\npeace in Europe followed the defeat of Napoleon and Playfair began a\n17\nmonth,\n4000\nmile geological study of the Continent to gather material for the second edition of the\nIllustrations of the Huttonian Theory of the Earth\n. Although\n68\nyears of age, Playfair set out on an arduous and extensive journey through France and Switzerland, continuing to the southern tip of Italy, examining the geological structure of the parts of the world he visited. He was accompanied for part of the time by his eldest nephew, James George Playfair, who assisted him by recording the details of their journeys.\nThe second edition of the\nIllustrations\nwas designed to be a much more major work than the first. It was intended to be more like scientific texts of today, beginning with the well authenticated facts, followed by general inferences that were deduced from these facts, with an examination of the various geological models that had been hypothesised. It was Playfair's aim to base the principles of geology on unquestionable assumptions and arguments. It would conclude with Playfair's model of geology and its applications.\nHowever, this plan was interrupted when Playfair received a request he write an essay entitled\nDissertation on the Progress of the Mathematical and Physical Science since the Revival of Letters in Europe\nfor the supplement to Encyclopaedia Britannica. He moved to Burntisland in Fife in\n1818\nafter seeing work begin on the New Observatory for the Astronomical Institution of Edinburgh, in order to complete this essay. While in Burntisland, he also wrote his\nMemoir on Naval Tactics\n, published posthumously in the\nTransactions of the Royal Society of Edinburgh\n.\nSoon after completing the\nDissertation\nPlayfair suffered a severe attack of a disease of the bladder which prevented him from continuing his planned second edition of the\nIllustrations\nand interrupted his lectures. He regained his health sufficiently to finish the course of lectures in Edinburgh but, sadly, the second edition of the\nIllustrations\nwas never completed. In June\n1819\nthe bladder disease recurred with increased severity and Playfair returned to Burntisland. Although suffering very severe pain, he spent the last days of his life dictating corrections to the proof sheets of the\nDissertation\n.\nAfter an illness lasting a month Playfair died. There were over\n500\nmourners at his burial in the Old Calton Burial Ground, overlooked by the Observatory which he helped to create. His grave is adjacent to that of David Hume, the famous philosopher, however it does not bear any indication whatever of who is interred there and, sadly, over the years has been neglected.\nPlayfair earned for himself a high reputation in at least three branches of pure science, not primarily as a discoverer but rather as an expounder of theories. In the field of mathematics he introduced continental methods to Britain through his articles in scientific journals and encyclopaedias, and by his lecture courses. His nephew, James George Playfair, who edited\nThe Works of John Playfair\nin\n1822\nwrote\n[\n11\n]\n:-\n... we believe we hazard nothing in saying that he was one of the most learned mathematicians of his age, and among the first, if not the very first, who introduced the beautiful discoveries of the later continental geometers to the knowledge of his countrymen, and gave their just value and true place, in the scheme of European knowledge, to those important improvements by which the whole aspect of the abstract sciences has been renovated since the days of our illustrious Newton.... He possessed, indeed, in the highest degree, all characteristics both of a fine and powerful understanding, - at once penetrating and vigilant, - but more distinguished, perhaps, for the caution on sureness of its march, than for the brilliancy or rapidity of its movements, -and guided and adorned through all its progress by the most genuine enthusiasm for all that is grand, and the justest taste for all that is beautiful in the Truth or the Intellectual Energy with which he was habitually conversant.\nPlayfair's character made him a popular personality. He possessed a\n[\n12\n]\n:-\n... cordial combination of the two aristocracies of rank and of letters.\nLord Henry Coburn wrote that Playfair was\n[\n6\n]\n:-\nAdmired by all men, and beloved by all women, of whose virtues and intellect he was always champion, society felt itself the happier and the more respectable from his presence.\nHis nephew writes in\n[\n11\n]\n:-\n... though the most social of human beings, and the most disposed to encourage and sympathise with the gaiety and joviality of others, his own spirits were in general rather cheerful than gay, or at least never rose to any turbulence or tumult of merriment... His own satisfaction might generally be traced in the slow and temperate smile, gradually mantling over his benevolent and intelligent features, and lighting up the countenance of the Sage with the expression of the mildest and most genuine philanthropy.\nIn\n[\n16\n]\nPlayfair's contributions are summed up as follows:-\nThe wide learning, the calm intellect and the clear thought, so apparent in all his writings, also marked his lectures. He was, according to one of his many illustrious pupils, 'a charming teacher, so simple, unaffected and sincere in manner, so chaste in style, so clear in demonstration'. By consolidating the learning of past generations and collating the discoveries and theories of his own time, he gave a comprehensive and unified presentation of the subjects he professed and thus laid the basis for future constructive researches in the fields of mathematics and natural philosophy."
}