{
  "nome_completo": "John Dee",
  "nome_curto": "John Dee",
  "ano_nascimento": "1527",
  "ano_morte": "1609",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dee/",
  "lugar_nascimento": "Tower Ward, London, England",
  "lugar_morte": "Mortlake, London, England",
  "biografia": "John Dee\n's father was Roland Dee who was of Welsh descent. Roland Dee dealt in textiles and, in addition, was a gentleman sewer at the court of Henry VIII. In this latter capacity he would have made clothing for the royal household as well as buying and supplying fabrics for the King. John Dee's mother was Jane Wild. Jane married Roland when she was fifteen years of age and, three years later, John\n(\nwho was their first and only child\n)\nwas born.\nJohn was educated at a school in Chelmsford in Essex from\n1535\n, then entered St. John's College, Cambridge in November of\n1542\n. There he studied Greek, Latin, philosophy, geometry, arithmetic and astronomy. Woolley writes\n[\n10\n]\n:-\nHe was so eager to learn, he later recalled, so \"vehemently bent to study\", that he worked eighteen hours a day, allowing just four hours for sleep and two for meals. Mathematics was his passion ...\nDuring\n1546\n, his final year as an undergraduate, he began to make astronomical observations. Using a quadrant and a cross-staff he made\n(\nas he later wrote in\nCompendious Rehearsal\n)\n:-\n... observations\n(\nvery many to the hour and minute\n)\nof the heavenly influences and operations actual in this elemental portion of the world. Of which sort I made some thousands in the years then following.\nPerhaps we should say a few words at this stage to explain this quotation. One would not expect a modern astronomer to say \"observations of the heavenly influences\" but Dee, in common with the general practice in his time, believed in astrology. However, Dee sought a scientific explanation for the reasons that the positions of the planets at the moment of a person's birth would affect their future. He would argue that each body emitted rays of force which acted on all other bodies. One could view this as an early form of the law of universal gravitation, but this might be somewhat overstating Dee's idea. However,\nNewton\n's concept of force certainly derived from concepts of magic powers such as those of Dee. We should stress, however, that Dee's approach was always through mathematics and he sought a scientific explanation.\nDee graduated with a B.A. in\n1546\nand became a Fellow of St John's College. In December\n1546\nhe became a Fellow of Trinity College, Cambridge. Henry VIII founded Trinity College, the largest of the Cambridge colleges, in\n1546\nand Dee became one of its founding Fellows.\nBeing unhappy with the scientific attitude in England, Dee travelled on the Continent between\n1548\nto\n1551\n. He first made a visit to Louvain near Brussels, arriving on\n24\nJune\n1548\n, where he studied with\nGemma Frisius\nand\nGerardus Mercator\n. Soon\nMercator\nbecame a particularly close friend of Dee's and together they discussed new models for the universe. Dee later wrote:-\nIt was the custom of our mutual friendship and intimacy that, during three whole years, neither of us lacked the other's presence for as much as three whole days.\nDuring his time in Louvain Dee wrote two texts on astronomy. In\n1550\nhe went to Brussels to meet the mathematicians working there. It seems that around this time he met\nNunes\nand they became close friends. In the same year Dee went to Paris where he lectured on\nEuclid\n's\nElements\n. He must have been an impressive lecturer for it was reported that people flocked to hear his lectures which filled the lecture rooms to overflowing. In\n1551\nDee was offered an appointment as professor of mathematics in Paris but declined. He also declined a lectureship in mathematics at Oxford three years later.\nBack in England Dee entered the service of the Earl of Pembroke in February\n1552\n, then he entered the service of the Duke of Northumberland near the end of the same year. While holding this latter post he wrote a work on tides.\nAfter the death of King Edward VI, there were great problems between Catholics and Protestants as to the succession. The Catholic Queen Mary came to the throne very much against the wishes of many Protestants who feared for their safety. Indeed they were right to have such fears as Mary instigated a campaign against eminent Protestants and one person to be arrested was Roland Dee, John Dee's father, who was taken prisoner in August\n1553\n. He was released, but only after he had been deprived of all his financial assets. John, who had expected to inherit considerable wealth from his father and be in a position to carry out scientific studies free from worries about earning an income, was put in a difficult position. He might have solved his financial problems by accepting a mathematics post at the University of Oxford which he was offered in\n1554\n, but his views on the lack of scholarship in the English universities led him to turn the offer down.\nOn\n28\nMay\n1555\nDee was arrested and charged with \"calculating\". At this time mathematics in England was considered to be equivalent to the possession of magical powers and Aubrey writes\n(\nsee\n[\n22\n]\n)\nthat the authorities had:-\n... burned mathematical books for conjuring books.\nAlthough he was guilty of the charges brought against him, Dee was released in August after being held for three months. Although he was released as a free man his sources of income were removed putting him in severe financial problems. Dee's father died in\n1555\nwithout being able to recover his wealth. As to Dee's religious position this seems a little harder to ascertain. He seems, with good reason, to have tried to avoid taking sides in the Catholic-Protestant argument, but after his release from prison he seemed completely at home in the Catholic regime which had imprisoned him. He may have changed sides for political convenience, but we shall see in a moment that there is a theory that he was acting as a spy.\nDee presented plans for a national library to Queen Mary on\n15\nJanuary\n1556\n. It was a superb scheme to preserve learning by finding copies of all important books and keeping them in a Royal Library which men could consult to settle:-\n... such doubts and points of learning, as might cumber and vex their heads\n[\nand\n]\nlearning\n[\nwould\n]\nwonderfully be advanced.\nThe scheme did not receive official backing, but nevertheless Dee, despite his financial difficulties, set out to create his own library. See\n[\n7\n]\nfor the library catalogue from the library that he built up.\nQueen Mary died in\n1558\nand the Protestant Elizabeth became Queen. Dee quickly found favour with Elizabeth and was even asked to use his astrological skills to select the most appropriate day for her coronation. This he did but one is left wondering how someone so closely associated with the previous Catholic administration might have found favour so soon. Woolley\n[\n10\n]\nsuggests that Dee may have acted as a spy for Elizabeth in Mary's administration and this would certainly be consistent with events and explain some otherwise puzzling ones.\nDuring the next five years Dee spent time abroad collecting books for his library, and studying astronomy, astrology, mathematics, coding, and magic - all topics which were linked in his mind as he struggled to understand the ultimate truths about the universe. Despite being close to Queen Elizabeth, and advising her frequently, he never achieved from her the financial security that he longed for to enable him to devote himself completely to his studies. By\n1566\nhe was living with his mother at Mortlake, in London, to reduce his living costs. There he built up a remarkable collection of scholarly works in his library as well as a collection of astronomical instruments, globes\n(\nincluding one given to him by\nMercator\n)\nand accurate clocks.\nIn\n1568\nhe published\nPropaedeumata Aphoristica\nand presented the work to Queen Elizabeth. Elizabeth was impressed and Dee gave her mathematics lessons to enable her to understand it. The book contains a mixture of good physics and mathematics, and also a lot of astrology and magic. Let us emphasise that we should not think any the less of Dee because of his interests in magic; most of the great scientists and mathematicians of his time, and much later, had such interests. For example\nBrahe\nfirmly believed in alchemy and astrology as did\nCavalieri\nand\nKepler\nwhile\nNewton\n, like Dee, was obsessed with studying alchemy. Among what we would describe as \"good science\" in\nPropaedeumata Aphoristica\nis a statement that unequal masses fall at the same speed. Dee refers to earlier scientists who also claimed this fact. He also states that every object in the universe exerted a force on all others.\nIn\n1570\nDee edited an edition of\nEuclid\n's\nElements\ntranslated by Billingsley. Dee wrote a famous preface to this edition justifying the study of mathematics:-\nO comfortable allurement, O ravishing persuasion to deal with a science whose subject is so ancient, so pure, so excellent, so surrounding all creatures, so used of the almighty and incomprehensible wisdom of the Creator, in distinct creation of all creatures: in all their distinct parts, properties, natures, and virtues, by order, and most absolute number, brought from nothing to the formality of their being and state.\nDee observed the \"new star\" which is often called \"Tycho Brahe's supernova of\n1572\n\" and in the following year he wrote\nParallacticae commentationis praxosque\nwhich gives trigonometric methods which were applied to find the distance to the new star. He had made accurate observations with his assistant Thomas\nDigges\nand the two probably corresponded with\nBrahe\nabout the star. Certainly\nBrahe\ngreatly admired Dee's contributions.\nDee brought instruments of navigation back from the Continent when he returned in\n1551\n. From\n1555\nhe was a consultant to the Muscovy Company. The Muscovy Company was formed in\n1555\nby the navigator and explorer Sebastian Cabot together with a number of London merchants. It was granted a monopoly of Anglo-Russian trade and had as one of its aims the search for the Northeast Passage. Dee prepared nautical information, including charts for navigation in the polar regions, for the company during the next\n32\nyears. He instructed the crews on geometry and cosmography before they left for voyages to North America in\n1576\n.\nIn\n1579\nDee's mother gave her house at Mortlake\n(\nwhich he had lived in for at least\n13\nyears\n)\nto him; she died the following year. Dee had married Jane Fromands in February\n1578\nand together they had eight children. She was his third wife - his second wife had died in March\n1576\nin the year following their marriage. He had no children\n(\nat least none that survived\n)\nfrom his first two marriages.\nEdward Kelley entered Dee's life in March of\n1582\n. He was a medium who claimed to be able to contact angels and spirits and he did so by gazing into a crystal ball. Although this was not the first time Dee had been involved in such practices, at first he was still highly suspicious that Kelley's visions were real. Two things convinced him, however: Kelley was highly skilled in his art, and secondly Dee so longed to understand the ultimate truth about the universe which he had failed to find by other means. The lack of reaction of others to his scientific work was also a factor, as was the fact that he had been accused of magic so often in his life. Dee became more and more deeply involved in conversing with angels and spirits through Kelley and, sadly, it dominated the latter part of his life. This took place over a period of about five years. Several of the references give details of these conversations which Dee recorded in a diary; see for example\n[\n6\n]\n,\n[\n9\n]\n, and\n[\n10\n]\n. We note that in his diaries Dee refers to himself as Δ, a clever pun on the fact that Δ is the Greek character for the letter \"dee\" and also a magical symbol.\nDee made a proposal to Queen Elizabeth for calendar reform in February\n1583\n. He proposed the removal of eleven days to bring the calendar into line with the astronomical year. It was, of course, exactly the right course of action and Dee's proposal gained support from several of Elizabeth's advisors. However, the Archbishop of Canterbury opposed the scheme, partly because he was engaged in a longstanding argument with Elizabeth, partly because he considered such a scheme to be close to what the Catholic Church had adopted in the previous year. Dee's scheme was, however, a better one than that adopted across Europe after the proclamation by Pope Gregory XIII. The Gregorian calendar was based on the date of the Council of Nicaea in\n325\n, while Dee proposed a calendar with an astronomical base rather than a political one as he clearly pointed out. The failure of Dee's calendar reform proposal would mean that England retained a calendar at odds with that in the rest of Europe until\n1752\n.\nDee and Kelley visited Poland and Bohemia\n(1583\n-\n89)\n, giving displays of magic at the courts of princes. Kelley achieved fame and wealth and was knighted. On the other hand Dee, still in severe financial problems, returned to Mortlake in December\n1589\nto discover that much of his library had been stolen, as were his scientific instruments. Around this time Dee must have become friendly with\nThomas Harriot\n. The two discussed the allegations of atheism made against Raleigh's school and discussed which of them was being referred to as \"the conjurer that is master thereof\". They also discussed scientific and mathematical matters in the\n1590\ns. In\n1590\nHarriot\nsent Dee a copy of one of his books in which he had written \"To my dear friend\".\nFor a number of years Dee tried unsuccessfully to gain compensation for the income he had lost over the years. He tried to gain an appointment as Master of St John's Cross which was approved by Queen Elizabeth subject to approval by the Archbishop of Canterbury - but this approval never materialised. In\n1596\nhe was appointed warden of the Collegiate Chapter in Manchester, almost certainly as a means of removing him from London. In\n1605\nManchester was hit by the plague and Dee's wife and several of his children died. He returned to London where he died a few years later."
}