{
  "nome_completo": "John Napier",
  "nome_curto": "John Napier",
  "ano_nascimento": "1550",
  "ano_morte": "1617",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Napier/",
  "lugar_nascimento": "Merchiston Castle, Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "John Napier\n's father, Archibald Napier, was an important man in late\n16\nth\ncentury Scotland. His family had owned the Merchiston estate from the\n1430\ns when one of his ancestors acquired the estate, becoming the first Napare of Merchiston.\n(\nWe shall comment shortly on the different spellings of Napier's name.\n)\nThe family also owned estates at Lennox and at Menteith and a residence at Gartness. Archibald Napier married Janet Bothwell, the sister of the Bishop of Orkney, in\n1549\nwhen he was only\n15\nyears old. Their son John Napier was born the following year. Archibald Napier was a justice-depute and was knighted in\n1565\n. He was appointed Master of the Mint in\n1582\n.\nBefore continuing we should comment on the spelling of John Napier. The name John is most easily dealt with as John Napier, and almost everyone else around his time, used the old spelling \"Jhone\". His surname appears in a large variety of different spellings. The forms Napeir, Nepair, Nepeir, Neper, Napare, Naper, Naipper are all seen but John Napier would most commonly have been written Jhone Neper at that time. The only form of Napier that we are sure would not have been used in Napier's lifetime was the present modern spelling \"Napier\"!\nLittle is known about John Napier's early years. One of the few scraps of information that we have is from a letter from the Bishop of Orkney, John's uncle, to Archibald Napier written when John was eleven years old:-\nI pray you, sir, to send your son John to school; over to France or Flanders; for he cannot learn well at home nor get profit in this most perilous world - that he may be saved in it; - that he may seek honour and profit as I do not doubt that he will...\nThis is a translation of the old Scots that the Bishop of Orkney actually wrote. For those interested the original version reads:-\nI pray you, schir, to send your son Jhone to the schuyllis; oyer to France or Flandaris; for he can leyr na guid at hame, nor get na proffeitt in this maist perullous worlde ...\nNapier was educated at St Andrews University, entering the university in\n1563\nat the age of\n13\n. His mother arranged for him to live in St Salvator's College and special arrangements were made for the Principal of the University, John Rutherford, to take care of him personally. Napier's name appears on the matriculation roll of St Salvator's College for\n1563\n. Shortly after Napier matriculated his mother died. We know that Napier spent some time at St Andrews University and he wrote himself many years later that it was in St Andrews that he first became passionately interested in theology.\nHowever Napier's name does not appear in the list of those being awarded degrees in the subsequent years so he must have left St Andrews to study in Europe before completing a degree. Of other facts we can also be certain. Napier did not acquire his knowledge of higher mathematics at St Andrews nor did he acquire his deep knowledge of classical literature there. Both these must have been acquired during his studies in Europe but no record exists to show where he studied, although the University of Paris is highly likely and it is also probable that he spent some time in Italy and the Netherlands.\nBy\n1571\nNapier had returned to Scotland for he was present at his father's second marriage which took place in that year. It was in\n1571\nthat Napier himself began to make arrangements for his own marriage but it was at nearly two years before that took place. In\n1572\nmost of the estates of the Napier family were made over to John Napier and a castle was planned for the estate at Gartness.\nWhen the castle was completed in\n1574\n, Napier and his wife took up residence there. Napier devoted himself to running his estates. This task he took very seriously and, being a great genius as an inventor, he applied his skills to these tasks. He approached agriculture in a scientific way and he experimented with:-\n... improving and manuring of all sorts of field land with common salts, whereby the same may bring forth in more abundance, both of grass and corn of all sorts, and far cheaper than by the common way of dunging used heretofore in Scotland.\nThe above is quoted in\n[\n12\n]\nwithout reference to its origin.\nNapier took part in the religious controversies of the time. He was a fervent Protestant and published, what he considered his most important work, the\nPlaine Discovery of the Whole Revelation of St. John\n(1593)\n.\nNapier had been a fanatical Protestant from his days as an undergraduate at St Andrews. He wrote the\nPlaine Discovery of the Whole Revelation of St. John\naccording to his preface:-\n... for preventing the apparent danger of Papistry arising within this Island...\nIn fact there were good reasons why Napier thought that a change in the religious situation in Scotland might occur, for there had, for some time, been rumours that Philip of Spain might invade Scotland. The\nPlaine Discovery of the Whole Revelation of St. John\ndid gain Napier quite a reputation, not only within Scotland, but also on the Continent after the work was translated into Dutch, French and German. Gibson, in\n[\n12\n]\n, remarks however:-\n... I suppose that there are few indeed of the present generation who have read, or even heard of, the book; whatever its merits may have been they do not appeal to the modern mind...\nNapier's study of mathematics was only a hobby and in his mathematical works he writes that he often found it hard to find the time for the necessary calculations between working on theology. He is best known, however, for his invention of logarithms but his other mathematical contributions include a mnemonic for formulae used in solving spherical triangles, two formulae known as \"Napier's analogies\" used in solving spherical triangles and an invention called \"Napier's bones\" used for mechanically multiplying dividing and taking square roots and cube roots. Napier also found exponential expressions for trigonometric functions, and introduced the decimal notation for fractions.\nMuch of Napier's work on logarithms seems to have been done while he was living at Gartness. The\nStatistical Account\n(\nVol. xvi, page\n108)\ncontains the following:-\nAdjoining the mill at Gartness are the remains of an old house in which John Napier of Merchiston, Inventor of Logarithms, resided a great part of his time\n(\nsome years\n)\nwhen he was making his calculations. It is reported that the noise of the cascade, being constant, never gave him uneasiness, but that the clack of the mill, which was only occasional, greatly disturbed his thoughts. He was therefore, when in deep study, sometimes under the necessity of desiring the miller to stop the mill that the train of his ideas might not be interrupted.\nNapier's discussion of logarithms appears in\nMirifici logarithmorum canonis descriptio\nin\n1614\n. Two years later an English translation of Napier's original Latin text was published, translated by Edward Wright. In the preface of the book Napier explains his thinking behind his great discovery\n(\nwe quote from the English translation of\n1616\nof the original Latin of\n1614)\n:-\nSeeing there is nothing\n(\nright well-beloved Students of the Mathematics\n)\nthat is so troublesome to mathematical practice, nor that doth more molest and hinder calculators, than the multiplications, divisions, square and cubical extractions of great numbers, which besides the tedious expense of time are for the most part subject to many slippery errors, I began therefore to consider in my mind by what certain and ready art I might remove those hindrances. And having thought upon many things to this purpose, I found at length some excellent brief rules to be treated of\n(\nperhaps\n)\nhereafter. But amongst all, none more profitable than this which together with the hard and tedious multiplications, divisions, and extractions of roots, doth also cast away from the work itself even the very numbers themselves that are to be multiplied, divided and resolved into roots, and putteth other numbers in their place which perform as much as they can do, only by addition and subtraction, division by two or division by three.\nUnlike the logarithms used today, Napier's logarithms are not really to any base although in our present terminology it is not unreasonable\n(\nbut perhaps a little misleading\n)\nto say that they are to base\n1\ne\n\\Large\\frac{1}{e}\\normalsize\ne\n1\n​\n. Certainly they involve a constant\n1\n0\n7\n10^{7}\n1\n0\n7\nwhich arose from the construction in a way that we will now explain. Napier did not think of logarithms in an algebraic way, in fact algebra was not well enough developed in Napier's time to make this a realistic approach. Rather he thought by dynamical analogy. Consider two lines\nA\nB\nAB\nA\nB\nof fixed length and\nA\n′\nX\nA'X\nA\n′\nX\nof infinite length. Points\nC\nC\nC\nand\nC\n′\nC'\nC\n′\nbegin moving simultaneously to the right, starting at\nA\nA\nA\nand\nA\n′\nA'\nA\n′\nrespectively with the same initial velocity;\nC\n′\nC'\nC\n′\nmoves with uniform velocity and\nC\nC\nC\nwith a velocity which is equal to the distance\nC\nB\nCB\nC\nB\n. Napier defined\nA\n′\nC\n′\n(\n=\ny\n)\nA'C' (= y)\nA\n′\nC\n′\n(\n=\ny\n)\nas the logarithm of\nB\nC\n(\n=\nx\n)\nBC (= x)\nB\nC\n(\n=\nx\n)\n, that is\ny\ny\ny\n= Nap.log\nx\nx\nx\n.\nNapier chose the length\nA\nB\nAB\nA\nB\nto be\n1\n0\n7\n10^{7}\n1\n0\n7\n, based on the fact that the best tables of sines available to him were given to seven decimal places and he thought of the argument\nx\nx\nx\nas being of the form\n1\n0\n2\n.\nsin\n⁡\nX\n10^{2}.\\sin X\n1\n0\n2\n.\nsin\nX\n.\nThe fact that Nap.log\n1\ndoes not equal\n0\nis a major difficulty which make Nap.logs much less convenient for calculations than our logs. A change to logs with log\n1\n=\n0\ncame about in discussions between Napier and\nBriggs\n.\nBriggs\nread Napier's\n1614\nLatin text and, on the\n10\nMarch\n1615\nwrote in a letter to a friend:-\nNapper, lord of Markinston, hath set my head and hands a work with his new and admirable logarithms. I hope to see him this summer, if it please God, for I never saw a book which pleased me better or made me more wonder.\nIn fact\nBriggs\ndid make the difficult journey from London to Edinburgh to see Napier in the summer of\n1615\n(\nwould he have dreamed that now it takes\n4\nhours by train, rather than at least\n4\ndays by horse and coach in those times\n)\n. A description of their meeting was told by John Marr to William Lilly who writes the following\n(\nsee\n[\n12\n]\n)\n:-\nMr\nBriggs\nappoints a certain day when to meet at Edinburgh; but failing thereof, Merchiston was fearful he would not come. It happened one day as John Marr and the Lord Napier were speaking of Mr\nBriggs\n, \"Oh! John,\" saith Merchiston, \"Mr\nBriggs\nwill not come now\"; at the very instant one knocks at the gate, John Marr hastened down and it proved to be Mr\nBriggs\nto his great contentment. He brings Mr\nBriggs\ninto my Lord's chamber, where almost one quarter of an hour was spent, each beholding other with admiration, before one word was spoken. At last Mr\nBriggs\nbegan, -\"My Lord, I have undertaken this long journey purposely to see your person, and to know by what engine of wit or ingenuity you came first to think of this most excellent help unto astronomy, viz. the Logarithms ...\nBriggs\nhad suggested to Napier in a letter sent before their meeting that logs should be\n(\nin our terminology\n)\nto base\n10\nand\nBriggs\nhad begun to construct tables. Napier replied that he had the same idea but\n(\n[\n12\n]\n)\n:-\n... he could not, on account of ill-health and for other weighty reasons undertake the construction of new tables.\nAt their meeting Napier suggested to\nBriggs\nthe new tables should be constructed with base\n10\nand with log\n1\n=\n0\n, and indeed\nBriggs\ndid construct such tables. In fact\nBriggs\nspent a month with Napier on his first visit of\n1615\n, made a second journey from London to Edinburgh to visit Napier again in\n1616\nand would have made yet a third visit the following year but Napier died in the spring before the planned summer visit.\nNapier presented a mechanical means of simplifying calculations in his\nRabdologiae\npublished in\n1617\n. He described a method of multiplication using \"numbering rods\" with numbers marked off on them. The reason for publishing the work is given by Napier in the dedication, where he says that so many of his friends, to whom he had shown the numbering rods, were so pleased with them that they were already becoming widely used, even beginning to be used in foreign countries.\nNapier's numbering rods were made of ivory, so that they looked like bones which explains why they are now known as Napier's bones. To multiply numbers the bones were placed side by side and the appropriate products read off.\nGlaisher\ndescribed how to use Napier's bones in an article he wrote for\nEncyclopaedia Britannica\nand this description is quoted in\n[\n10\n]\n. Napier's bones are also described in\n[\n6\n]\n,\n[\n16\n]\nand\n[\n19\n]\n.\nIt would be surprising if a man of such great an intellect as Napier did not appear rather strange to his contemporaries and, given the superstitious age in which he lived, strange stories began to circulate. Many traditions suggest that Napier was\n... in league with the powers of darkness...\nand these are taken seriously in the biased biography\n[\n7\n]\nwritten by Mark Napier, one of John Napier's descendants. Mark Napier suggests that John Napier deliberately played upon the primitive beliefs of his servants by going round with a cock which he had covered in soot. Even the\nStatistical Account\n(\nquoted above\n)\nsays:-\n[\nNapier\n]\nused frequently to walk out in his nightgown and cap. This, with some things which to the vulgar appear rather odd, fixed on him the character of a warlock. It was formerly believed and currently reported that he was in compact with the devil; and that the time he spent in study was spent in learning the black art and holding conversation with Old Nick.\nNapier, however, will be remembered for making one of the most important contributions to the advance of knowledge. It was through the use of logarithms that\nKepler\nwas able to reduce his observations and make his breakthrough which then in turn underpinned\nNewton\n's theory of gravitation. In the preface to the\nMirifici logarithmorum canonis descriptio\n, quoted above, Napier says he hoped that his logarithms will save calculators much time and free them from the\nslippery errors\nof calculations.\nLaplace\n,\n200\nyear later, agreed, saying that logarithms:-\n...by shortening the labours, doubled the life of the astronomer ."
}