{
  "nome_completo": "John Henry Pratt",
  "nome_curto": "John Pratt",
  "ano_nascimento": "1809",
  "ano_morte": "1871",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pratt/",
  "lugar_nascimento": "St Mary Woolnoth, London, England",
  "lugar_morte": "Ghazipur, India",
  "biografia": "John Pratt\n's mother was Elizabeth Jowett and his father was Josiah Pratt, a vicar in the Church of England. There is some  ambiguity about his date of birth. See\nTHIS LINK\n. John attended Oakham School, Rutland, before matriculating at Gonville and Caius College, Cambridge in\n1829\n. He received his B.A. in\n1833\nbeing ranked as third\nWrangler\n, an excellent result, and he was elected to a Fellowship. In\n1836\nhe received his M.A. from Christ's and Sidney Sussex College. John's father, Josiah, was secretary of the Church Missionary Society and John left university with two strong drives inside him, one coming from his exceptional scientific ability, the other from the missionary zeal coming through his father.\nPratt obtained a chaplaincy appointment with the East India Company in\n1838\n. He remained in India for the rest of his life, becoming chaplain to Daniel Wilson, the Bishop of Calcutta, in\n1844\n. Then in\n1850\nPratt was appointed Archdeacon of Calcutta.\nHis first work, published in\n1836\n, was\nThe mathematical principles of mechanical philosophy\n. He revised the work in\n1842\n, then expanded and republished it under the title\nOn attractions,\nLaplace\n's functions and the figure of the Earth\nin\n1860\n. This work of Pratt's was, as the title indicates, on the shape of the Earth. He assumed that the Earth behaved as a fluid and showed, as\nNewton\nhad done, that the resulting shape would be an oblate spheroid. He gave\n26\n.\n9\nmiles as the difference between the equatorial and polar axes, quite a good result.\nPratt's next contribution was motivated by measurements made by George Everest published in\n1847\n(\nMount Everest was renamed in his honour in\n1865)\n. Everest had spent\n25\nyears between\n1818\nand\n1843\nmaking a trigonometric survey of India, including measuring the\n11\n.\n5\ndegree arc of the meridian from the Himalayas to Cape Comorin, the most southerly point of the Indian subcontinent. He noted that there was a small difference in this measurement compared with that made by astronomical methods, but put this down to errors in the measurements. Pratt, however, looked for other reasons for obtaining different values. He took into account the fact that the gravitational mass of the Himalayas would cause deviations in plumb-lines. He found that when he took the mass of the Himalayas into account, rather than explaining the difference as he had hoped, plumb-lines were not deflected towards the mountains as much as would be expected. In fact the difference discovered by George Everest should have been larger! In\n1855\nPratt postulated density differences in the Earth's crust, lower densities under mountains, higher densities in lowlands, to explain the\n(\ntoo nearly constant\n)\nvalues obtained for gravity at a given latitude. This is included in the rewrite of his work in\n1860\n. In the same year,\n1855\n,\nAiry\noffered a different explanation of the gravitational data. Both Pratt's and\nAiry\n's proposals have their merits but are oversimplifications of the actual situation.\nPratt also published religious works;\nScripture and science not at variance\n(1856)\nwas a popular work which ran to many editions. He also edited his father's\nNotes of discussion on religious topics at meetings of the Eclectic Society, London, during\n1798\n-\n1814\n. He was elected a Fellow of the\nRoyal Society\nin\n1866\n. He was described in\n[\n4\n]\nas:-\n... one of the ablest theologians and most devoted divines ... that England ever sent to India ... a quiet earnest worker, solitary in his habits ... a wise counsellor ... and an ardent, though undemonstrative contraversialist.\nPratt died of cholera while on a visit to Ghazipur in India."
}