{
  "nome_completo": "John Todd Morrison",
  "nome_curto": "John Morrison",
  "ano_nascimento": "1863",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morrison/",
  "lugar_nascimento": "Muthill, Perthshire, Scotland",
  "lugar_morte": "Stellenbosch, Cape Colony, South Africa",
  "biografia": "John Morrison\n's father was  James Morrison\n(\nborn in Muthill, Perthshire about\n1835)\nwho was a master shoemaker employing\n6\nmen and\n5\nboys. His mother was  Mary Todd was\n(\nborn in Alva, Clackmannan about\n1830)\n. John Morrison had an older brother Andrew\n(\nborn about\n1861)\nand three younger siblings: James\n(\nborn about\n1865)\n, Annie\n(\nborn about\n1868)\nand William\n(\nborn about\n1869)\n.\nJohn Morrison began his schooling in Perthshire at Muthill F.C. School, spending seven years at this school, but attended George Watson's College, Edinburgh, for three years before matriculating at the University of Edinburgh. In fact his school career was outstanding and he was dux of George Watson's in\n1878\nat the age of fifteen. His undergraduate career at university was of the same exceptional standard and he won the Neil Arnott Prize and was Vans Dunlop Scholar in Physics. He was awarded an M.A. in\n1883\nand a B.Sc. in\n1888\n.\nMorrison left Edinburgh University before completing his B.Sc., taking up a position in physics at Heriot-Watt College, Edinburgh, in\n1886\n. He held this post for five years until\n1891\nwhen he went to South Africa on being appointed Professor of Physics and Chemistry at Victoria College, Stellenbosch\n(\nlater incorporated with the University of Stellenbosch\n)\n. In\n1901\n, in conjunction with\nJohn Beattie\n, Morrison began the study of the magnetic elements as recorded at the Cape of Good Hope, and they were led on to their magnetic survey of South Africa. A report of their observations up to\n1908\nwas published in\n1909\nby the Cambridge University Press for the\nRoyal Society\n, and a report of their observations up to\n1910\nwas published by the Carnegie Institution of Washington in\n1912\n. Morrison retired in\n1934\n.\nThe\nEdinburgh Mathematical Society\nwas founded in February\n1883\nand Morrison was one of the founder members although he was only an Edinburgh undergraduate at the time. From\n1888\nhe served a spell on the Committee. He continued to be a member of the Society after moving to South Africa and remained a member throughout his career. He was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1892\n, his proposers being\nPeter Guthrie Tait\n, Alexander Crum Brown,\nAlexander Buchan\n,\nCargill Gilston Knott\n.\nAn obituary, written by\nAlexander Brown\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1945\n, page\n20\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nStellenbosch University awards the John Todd Morrison Research Medal, which was donated by Mrs J T Morrison, John Todd Morrison's wife. A solid silver, gold-plated medal is presented annually to the best student who obtains the M.Sc. degree in Physics and Applied Mathematics cum laude."
}