{
  "nome_completo": "John Frank Charles Kingman",
  "nome_curto": "John Kingman",
  "ano_nascimento": "1939",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kingman/",
  "lugar_nascimento": "Beckenham, Kent, England",
  "lugar_morte": null,
  "biografia": "John Kingman\n's paternal grandfather was a coal miner in Somerset. He was determined that his sons would have a good education and not need to become miners so John's father Frank E T Kingman was able to study at the University of Bristol, where he was awarded his Ph.D. He moved to London on taking up a scientific post with the government and there married John's mother Maud Elsie Harley who came from a London family. They had two children, and John and his brother were brought up on the outskirts of London.\nJohn was educated at Christ's College, Finchley in London where he won a scholarship to Cambridge. Of his school days he said\n[\n1\n]\n:-\nI had several very good teachers at school, and received a lot of encouragement in my ambition to study mathematics.\nHe then entered Pembroke College Cambridge in\n1956\nfrom where he was awarded an M.A. It was during his second year of study that\nMichael Atiyah\njoined Pembroke College and had an instant beneficial effect on Kingman's studies\n[\n1\n]\n:-\n[\nAtiyah\n]\nsupervised my pure mathematics: an education in itself. When I told him of my interest in probability and statistics, he arranged for me to be taught by Dennis Lindley, perhaps the best teacher of the subject for a generation. There were also quite a number of dreadful lecturers in Cambridge at that time, who had better remain nameless.\nKingman intended to undertake research with Lindley but he left Cambridge for Aberystwyth. Kingman followed Lindley's advice to stay in Cambridge where he became a PhD student of Peter Whittle. When Whittle moved to Manchester Whittle suggested that Kingman go to Oxford and work with\nDavid Kendall\n. This he did, but after Kingman had spent one year at Oxford,\nDavid Kendall\nmoved to Cambridge where he was appointed Professor of Mathematical Statistics. At this stage Kingman returned to Cambridge but never finished his Ph.D. He did, however, continue collaborating with\nDavid Kendall\nduring the next years that he spent in Cambridge.\nIn\n1961\nKingman became a Fellow of Pembroke College, being a Smith's Prizeman in\n1962\n. Also in\n1962\nKingman was appointed as an assistant lecturer in mathematics. He was a visiting professor at the University of Western Australia in\n1963\n, then he returned to Cambridge where he was promoted to lecturer in mathematics in\n1964\n. It was in this year that he married Valerie Cromwell who was a historian.\nIn\n1965\nKingman moved from Cambridge when he was appointed as reader in mathematics and statistics at the University of Sussex. Sussex was a very new university when Kingman was appointed there since it had only been founded a few years earlier. He said\n[\n1\n]\n:-\nSussex in the\n1960\ns was a very exciting place, alive with ideas and opportunities. My wife was teaching history there, and we made many friends across the whole range of subjects.\nAfter only a year at Sussex, Kingman was promoted to a chair of mathematics and statistics in\n1966\n. Two important books by Kingman were published in that year, namely\nIntroduction to\nMeasure\nand\nProbability\n(\nwritten jointly with S J Taylor\n)\nand\nThe Algebra of Queues\n. His work on queues, particularly involving applications to traffic flows, have become an established area of\noperational research\n. The application to traffic queues had been amongst his earliest work with\nThe single server queue in heavy traffic\nbeing published in\n1961\nand\nOn queues in heavy traffic\nin the following year. Newell, reviewing this last mentioned paper, realised its significance at the time:-\nQueueing theory, which has endured a long period in which people treated one example after another, is finally breaking out of its confinement to independent arrivals, service times, etc. The present paper represents a significant step in that direction.\nIn\n1967\nKingman became a member of the International Statistical Institute. It was around this time that he was studying subadditive\nergodic theory\nwhich in many ways turned out to be the most influential of all his mathematical achievements. The beginnings of the subject was a\n1965\npaper by J M Hammersley and D J A Welsh in which they made conjectured the subadditive ergodic theorem. Kingman succeeded in proving the theorem: he published\nThe ergodic theory of subadditive stochastic processes\nin the\nJournal of the Royal Statistical Society\nin\n1968\nand\nAn ergodic theorem\nin the\nBulletin of the London Mathematical Society\nin the following year. Kingman gave a beautiful description of the development of the subject in his\n1973\npaper\nSubadditive ergodic theory\npublished in the\nAnnals of Probability\n.\nKingman was appointed as professor of mathematics at the University of Oxford in\n1969\nand he held this post until\n1985\n. He explained why he was appointed to mathematics rather than statistics\n[\n1\n]\n:-\nStatistics in Oxford in\n1969\nwas frankly a mess. There was no professor of statistics, the only chair having been abolished some years before. ... I was appointed Professor of Mathematics to raise the profile of probability theory\n(\nbut not statistics\n)\nin the Faculty of Mathematics.\nTwo years after his appointment, in\n1971\n, his tremendous contributions to mathematical statistics were recognised when he was elected a Fellow of the\nRoyal Society\n. This was the year in which he published another very important paper\nMarkov transition probabilities V\nwhich gave complete characterization for the diagonal transition probabilities of a standard continuous-time Markov chain on a countable state space. This paper gave, in some sense, a complete solution to a problem which Kingman had been studying since his paper\nMarkov transition probabilities. I\npublished in\n1967\n. Between this first paper and the complete solution in\n1971\n, Kingman had published several further contributions building up to the final elegant result:\nMarkov transition probabilities. II. Completely monotonic functions\n(1967)\n,\nMarkov transition probabilities. III. General state spaces\n(1968)\n, and\nMarkov transition probabilities. IV. Recurrence time distributions\n(1968)\n. This work was part of the theory of regenerative phenomena and, in addition to a number of other articles, Kingman published his classic text\nRegenerative phenomena\nin\n1972\n.\nWhile at Oxford he became a fellow of St Anne's College, holding this position from\n1978\nuntil\n1985\n. During his time at Oxford, Kingman held several visiting appointments, in particular at the University of Western Australia in\n1974\nand the Australian National University in\n1978\n. He held a number of important national positions during this time, such as chairman of the Science Board of the Science Research Council from\n1979\nto\n1981\nand then chairman of the Science and Engineering Research Council from\n1981\nuntil\n1985\n.\nIn\n1985\nKingman was appointed as Vice-Chancellor of the University of Bristol. Although he was at this stage in a position which no longer required him to retain his interests in mathematical statistics, Kingman certainly did not give up his mathematical interests. He was president of the\nRoyal Statistical Society\nfrom\n1987\nto\n1989\nand president of the\nLondon Mathematical Society\nfrom\n1990\nto\n1992\n. He continued his position as vice-president of the Institute of Statisticians which he had held from\n1976\nand he continued in this role until\n1992\n. In\n2001\nKingman left Bristol to become Director of the\nIsaac Newton\nInstitute for Mathematics Sciences.\nIn addition to these mathematical activities, he undertook some less mathematical ones. He was a member of the board of the British Council between\n1986\nand\n1991\nand chairman of the Committee of Inquiry into the Teaching of the English Language in\n1987\n-\n88\n. He also held a number of directorships such as IBM UK\n(1985\n-\n95)\nand Beecham Group\n(1986\n-\n89)\n. He was associated with the British Technology Group, serving on the Council from\n1984\nuntil\n1992\nwhen he became a director.\nWe have commented above on several areas of Kingman's research as we were describing events in his life. Let us now sum up his mathematical contributions which were almost all in the area of mathematical statistics, more precisely stochastic analysis, random processes, regenerative phenomena and mathematical genetics. He wrote on the theory of Markov processes and published an important series of articles on Markov transition probabilities which we gave details of above. Among a large number of other topics to which he made major contributions were ergodic theorems, random walks and the theory of queues, in particular applying queuing theory to problems of traffic flow. He also wrote on a number of fascinating topics such as what happens to a piece of string when it is thrown.\nIn\n1979\nKingman gave a series of lectures at Iowa State University on the contributions of mathematics to the study of genetic evolution. This was an area in which Kingman had made many important contributions himself and these are detailed in the lecture notes published as\nMathematics of Genetic Diversity\nin the following year. Kingman discussed deterministic models and stochastic models relating to genetic evolution.\nIn\n1993\nKingman published\nPoisson processes\nwhich provides a systematic treatment of the subject. A reviewer writes that the book:-\n... fulfils the expectations one might have when a famous elder author writes a book on a classic topic. It gives the basic facts in a clear and lucid way. It is shown how the theory can be applied to interesting problems of astronomy, queuing and traffic etc., and these examples are studied very thoroughly and deeply, giving even the specialist new insights\n.\nKingman served as Director of the\nIsaac Newton\nInstitute for Mathematical Sciences from October\n2001\nto September\n2006\n. During that period he was the first N M Rothschild & Sons Professor of Mathematical Sciences. He was also the founding Chairman of the Statistics Commission, set up in\n2000\nto increase public confidence in UK National Statistics. He held this role until\n2003\n.\nKingman has received many honours for his work in mathematics and statistics in addition to those, such as election as a fellow of the\nRoyal Society\n, mentioned above. He was awarded the Junior Berwick Prize of the\nLondon Mathematical Society\nin\n1967\n, the Guy medal in Silver from the\nRoyal Statistical Society\nin\n1981\nand the Royal Medal of the\nRoyal Society\nin\n1983\n. He has been awarded honours by the universities of Sussex\n(1983)\n, Southampton\n(1985)\n, Bristol\n(1989)\n, West of England and Hannover\n(1991)\n, Queen's University, Ontario\n(1999)\n. Kingman was knighted in\n1985\n.\nIn July\n2004\n, Kingman was awarded a D.Sc. by Brunel University."
}