{
  "nome_completo": "John Leslie Britton",
  "nome_curto": "John Britton",
  "ano_nascimento": "1927",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Britton/",
  "lugar_nascimento": "Cottingham (near Hull), England",
  "lugar_morte": "Isle of Skye, Scotland",
  "biografia": "John Britton\nentered Beverley Grammar School in\n1939\nand he completed his school education in\n1946\n, entering the University College of Hull in that year. He was extremely lucky to be taught by two outstanding group theorists at Hull, namely\nBernhard Neumann\nand\nHanna Neumann\n. Britton graduated from Hull in\n1950\n, although at that time Hull could not award its own degrees and so Britton graduated with an external University of London degree.\nBernhard Neumann\nleft Hull to take up a post in Manchester in\n1948\n, but the Neumann's spent the summer of\n1950\nin Hull and organised an algebra seminar at their house. Britton took part in that seminar which served as his introduction to research in algebra. Britton then proceeded to study for a Master's degree at Hull, supervised by\nHanna Neumann\n. This degree, again an external London degree, was awarded in\n1951\n.\nBritton then proceeded to Manchester where\nBernhard Neumann\nsupervised his doctoral studies. His doctoral thesis studied the word problem for\ngroups\n, extending work by Tartakovskii on problems originally formulated by\nDehn\n.\nAfter compulsory military service, Britton accepted a post at the University of Glasgow as a research fellow. He soon obtained a permanent position on the lecturing staff at Glasgow where he continued his research into word problems in groups. His work attracted the attention of a leading expert in the word problem for groups, namely Bill\nBoone\n.\nBoone\ninvited Britton to the University of Illinois for session\n1960\n-\n61\nand this proved an important event for Britton since it enabled his work to become widely known and hugely influential in combinatorial group theory.\nBritton was appointed Reader at the new University of Kent at Canterbury in\n1966\nand he remained there until he accepted the chair of Pure Mathematics at Queen Elizabeth College London in\n1973\n. Britton remained in London for the rest of his career, retiring in\n1988\n.\nI\n[\nEFR\n]\nfirst met Britton during his time at Canterbury. He was clearly a shy man, slightly ill at ease in company, yet he treated me with great kindness and I remember his quiet sense of humour during the meal we had in the university refectory.\nBritton did not like to tackle numerous small mathematical problems. Rather he was attracted by the biggest problems in his area of combinatorial group theory. His way of working was to be prepared to devote many years of his life to working on one major problem yet even his colleagues were often unaware of which problem he was working on. After making major contributions to word problems Britton turned his attention to the\nBurnside problem\n.\nNovikov\nhad announced in\n1959\nthat he had proved that, for every\nn\n>\n71\nn > 71\nn\n>\n7\n1\n, there was a finitely generated infinite group all of whose elements had order dividing\nn\nn\nn\n. However\nNovikov\ndid not follow up the announcement with the expected published proof and Britton, suspecting correctly that\nNovikov\n's proof had run into difficulties, began to work on the Burnside problem himself. Working jointly with\nAdian\n,\nNovikov\nwas able to prove the result, although the proof needed\nn\nn\nn\nto be much greater than\n71\nto work, and they published their result in\n1968\n.\nThe publication of the proof would have persuaded most people to give up, but not so Britton. He persisted with his monumental task and in\n1970\nhe believed that his work was complete. The proof ran to almost\n300\npages and was published in\n1973\n. Sadly, however,\nAdian\nfound an error in Britton's arguments. As Collins writes in\n[\n1\n]\n:-\n...\nAdian\npointed out that, while individual lemmas were correct, in order to apply them all simultaneously the inequalities needed to make their hypothesis valid were inconsistent. For John the matter was exceptionally unfortunate for he had spent a number of his prime mathematical years on the problem.\nBritton never really regained his mathematical confidence after this and was never again prepared to tackle major problems. He did publish three further papers but they are of relatively minor importance. His one further major work was to edit the publication of\nTuring\n's collected work in pure mathematics which was published in\n1992\n."
}