{
  "nome_completo": "John Frederick William Herschel",
  "nome_curto": "John Herschel",
  "ano_nascimento": "1792",
  "ano_morte": "1871",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herschel/",
  "lugar_nascimento": "Slough, Buckinghamshire, England",
  "lugar_morte": "Hawkhurst, Kent, England",
  "biografia": "John Herschel\nwas the son of\nWilliam Herschel\n, the astronomer who discovered Uranus. His mother Mary Pitt was the daughter of a wealthy merchant. She was\n38\nyears old when she married\nWilliam Herschel\n, her first husband and her only child having both died. When John Herschel was born in\n1792\nWilliam\nwas\n55\nyears old and Mary was\n42\n. In addition to his parents, his aunt\nCaroline Herschel\nwas another important figure in John Herschel's upbringing.\nWilliam Herschel\nwas not only a leading astronomer but he also had a great talent for music. Both he and his sister\nCaroline Herschel\nwere extremely musical, and they had both used their musical talents to help augment their income after first arriving in England. John was brought up in Observatory House, with its\n40\nfoot telescope, where music, science and religion were dominant.\nCaroline Herschel\nhad left her brother's home when he married, but she continued to come to Observatory House every day to help\nWilliam\nreduce his data and she proved an outstanding teacher to John, carrying out experiments in physics and chemistry with the young boy.\nSchooling did present some problems for John. After studying at Dr Gretton's School in Hitcham, he was sent to Eton College when he was eight years old but he was bullied by the other boys. He was removed from the school by his mother after a few months. In addition to schooling at Clewer and Hitcham, John was tutored at home by Mr Rogers, a private mathematics tutor, to prepare him for university. He entered St John's College Cambridge in\n1809\n.\nAs an undergraduate Herschel made friends with\nPeacock\nand\nBabbage\n. In\n1812\nthe three undergraduates founded the Analytical Society which had as its aim the introduction of Continental methods of mathematical analysis into English universities. It is fair here to say that the aim was to bring Continental mathematical theory into English universities since the Scottish universities were at this time more progressive. We should also say that the Analytical Society was not the first move towards Continental mathematics in England, for Woodhouse who was one of Herschel's lecturers at Cambridge, had written a fine book which took the\nLeibniz\napproach to the calculus rather than\nNewton\n's approach. Yet the mathematical syllabus at Cambridge reflected none of the theories of\nd'Alembert\n,\nLeibniz\n(\nin particular\nEuler\n's development of this approach\n)\n, or of the more algebraic approach of\nLagrange\n.\nHerschel, together with\nPeacock\n, translated\nLacroix\n's\nTraité du calcul différentiel et du calcul intégral\nⓉ\n(\nTreatise on differential calculus and integral calculus\n)\nwhich examined these different approaches to the calculus. Herschel did not offer these three approaches with equal recommendation for he believed that the algebraic approach of\nLagrange\nwas the right one. However the Analytical Society did not survive for very long. Herschel graduated in\n1813\ntaking first place in the final examination.\nPeacock\ncame second to Herschel while\nBabbage\nhad withdrawn mainly because he could not compete with Herschel and he was not prepared to enter a competition which he knew that he could not win.\nFollowing his graduation Herschel became first Smith's prizeman and was elected a fellow of St John's College. Also in\n1813\nhe was elected as a fellow of the\nRoyal Society of London\n, having published a mathematics paper\nOn a remarkable application of Cotes's theorem\nin the\nTransactions of the Royal Society\n. Despite the demise of the Analytical Society Herschel continued to work on mathematics. He studied algebras and published papers on trigonometrical series. Among many mathematical works he published a two volume book in\n1820\non examples of applications of finite differences. His mathematical work continued up to\n1820\n(\nand his interest in mathematics was evident in many later works on other topics\n)\nbut even before\n1820\nhis interest in other subjects had begun to take him away from research in mathematics.\nIt is interesting to think that it was in some ways due to Herschel's remarkable all round abilities that he failed to make an advance of the depth that he was clearly capable of in any of the subjects that he studied. In all of them he could have been the person that we remember today as the world leader of his time. Yet the fact that he contributed to so many areas meant that he had usually moved on to something else when he might have been consolidating his work in a single area. Certainly his mathematical work, important as it was, never had the influence which he might have been able to have achieved had he continued to work in the area.\nPerhaps most surprising of all was the decision that Herschel made after graduating. He decided to enter the legal profession, much against the advice of his father who wanted him to join the Church, and he went to London in February\n1814\nto begin training. It was not long before he found that it was not right for him and he wrote to\nBabbage\nin September\n1814\nsaying that he would stick it out since it was his chosen career. However, after\n18\nmonths, he gave up his legal training and returned to Cambridge as a tutor and examiner in mathematics.\nHerschel spent a holiday with his father during the summer of\n1816\n. He seems to have decided during this holiday to turn to astronomy, almost certainly influenced by the fact that at\n78\nyears of age his father's health was failing and there was nobody else to continue his father's work. He wrote on\n10\nOctober\n1816\nto\nBabbage\n(\nsee C A Ronan's article in\n[\n6\n]\n)\n:-\nI shall go to Cambridge on Monday where I mean to stay just enough time to pay my bills, pack up my books and bid a long - perhaps a last farewell to the University. ... I am going under my father's directions, to take up the series of his observations where he has left them\n(\nfor he has now pretty well given over regular observing\n)\nand continuing his scrutiny of the heavens with powerful telescopes ...\nIndeed John Herschel began to undertake work in astronomy from this time although he also studied other topics. Even before his first astronomy paper was published, Herschel published details of his chemical and photography experiments in\n1819\nwhich,\n20\nyears later, would prove of fundamental importance in the development of photography. He was very much involved with the founding of the\nAstronomical Society\nin\n1820\nand he was elected vice-president at the second meeting of the Society when the officers of the Society were elected. Herschel's great versatility is shown by the fact that in\n1821\n, having recently become involved in astronomy and chemistry, he was awarded the Copley Medal of the\nRoyal Society of London\nfor his work on mathematical analysis.\nBabbage\nand Herschel remained close friends and the two travelled together to Italy and Switzerland in\n1821\n. They shared a love of climbing mountains but their exploits here were not simply for pleasure as Herschel continually learnt about science from his environment. Other trips abroad by Herschel included one in\n1822\nand another with\nBabbage\nin\n1824\n. These trips included visits to other scientist, for example while in Paris Herschel and\nBabbage\nhad discussed topics of common interest with\nArago\n,\nLaplace\nand\nBiot\n. On the\n1824\ntrip Herschel had visited Fraunhofer and had met with\nFox Talbot\nwho was visiting Fraunhofer at the time. He also visited\nPfaff\n, who was working on a German translation of his father's work, and his aunt\nCaroline Herschel\nwho had returned to Hanover after the death of her brother\n(\nJohn Herschel's father\n)\nin\n1822\n.\nIn fact\n1822\nwas the year in which John Herschel published his first paper on astronomy, a relatively minor work on a new method to calculate eclipses of the moon. His first major publication in astronomy was a catalogue of double stars which he published in the\nTransactions of the Royal Society\nin\n1824\nand for which he received honours. The\nParis Academy\nawarded him its\nLalande\nPrize in\n1825\nand the\nAstronomical Society\nawarded him its Gold Medal the following year.\nThe work on double stars had been undertaken as a continuation of his father's work which attempted to measure the\nparallax\nof a star. The parallax is the apparent change in position of a relatively nearby star against the background of very distant stars due to the change in position of the earth in its orbit around the sun. John Herschel published an important paper on this topic in\n1826\nbut did not succeed in determining the parallax of any star. He continued to work on double stars until\n1833\n, in particular he developed methods to determine the orbits of those double stars which orbited a common centre of gravity and for this work he received the Royal Medal of the\nRoyal Society\nin\n1833\n.\nBessel\nwas the first to demonstrate the parallax of a star, publishing his results in\n1840\n.\nIn\n1830\nHerschel published his famous treatise\nDiscourse on Natural Philosophy\nthe importance of which is beautifully described by\nFaraday\nin writing to Herschel:-\n... when your work on the study of Natural Philosophy came out, I read it, as others did with delight. I took it as a school book for philosophers, and feel that it has made me a better reasoner and even experimenter, and has altogether heightened my character, and made me, if I may be permitted to say so, a better philosopher.\nHerschel's involvement with the\nRoyal Society\nhad important influences on his career. He had been elected Secretary of the Society in\n1824\n(\nalthough he resigned in\n1827)\nand, in\n1831\n, he was proposed by\nBabbage\nfor President of the\nRoyal Society\n. This was part of a battle that was going on in the Society between reformers and traditionalists, Herschel being the champion of the reformers. In a slightly embarrassing episode for Herschel, he failed narrowly to be elected, the traditionalists winning the day. He had been elected as President of the\nAstronomical Society\nin\n1827\nand he was knighted in\n1831\nso he received great recognition despite his disappointment with the\nRoyal Society\n.\nThe\nRoyal Society\nepisode may have been the main reasons why Herschel decided to make a long visit to the Cape of Good Hope in South Africa. Also it became possible at this time because of the death of his mother Mary Herschel in\n1832\n. The Royal Observatory had been completed at the Cape of Good Hope in\n1828\nwith the scientific aim to catalogue interesting astronomical objects which could not be observed from the northern hemisphere. Herschel sailed for South Africa in\n1833\n, taking with him his own\n20\nfoot refractor telescope. He travelled with his family, having married Margaret Brodie Stewart four years earlier, and their ship reached South Africa in January\n1834\n.\nAmong the many important scientific advances made by Herschel in South Africa was his observations of\nHalley\n's comet on its\n1835\nreturn. He recognised that the comet was being subjected to major forces other than gravitation and he was able to calculate that the force was one repelling it from the sun. This could in some sense be said to constitute the discovery of the solar wind which is indeed the reason for the repulsive force discovered by Herschel. He also made the important discovery that gas was evaporating from the comet.\nThe geologist Lyell saw the irony in the fact that Herschel had done this work in South Africa because he failed to be elected President of the\nRoyal Society\n. He wrote\n(\nsee for example\n[\n6\n]\n)\n:-\nFancy exchanging Herschel at the Cape for Herschel as President of the\nRoyal Society\n, which he so narrowly missed being, and I voted for him too! I hope to be forgiven for that.\nMore information on Herschel's time in South Africa is available at\nTHIS LINK\n.\nIn\n1838\nHerschel returned to England not having had much time to reduce the many observations that he had made while there. His intention was to work on these as soon as he returned but he was kept so busy with other events that this task was not completed until\n1847\n. Despite the delay, the publication was an event of great importance and Herschel received his second Copley Medal from the\nRoyal Society\nfor this work. The events which prevented him from working on his observations after his return were partly non-scientific such as his investment to a baronetcy in June\n1838\nwhich he accepted with considerable reluctance. The main distractions were, however, scientific ones.\nOn\n22\nJanuary\n1839\nHerschel heard of Daguerre's work on photography from a casual remark in a letter written by Beaufort to Margaret his wife. Without knowing any details, Herschel was able to take photographs himself within a few days.\nFox Talbot\nvisited him on the\n1\nFebruary to discuss their separate experiments in photography. In his article in\n[\n6\n]\nRoberts quotes from a letter by Herschel's wife:-\nI happen to remember well the visit to Slough of Mr\nFox Talbot\n, who came to show Herschel his beautiful little pictures of Ferns and Laces taken by his new process. - when something was said about the difficulty of fixing the pictures, Herschel said \"Let me have this one for a few minutes\" and after a short time he returned and gave the picture to Mr\nFox Talbot\nsaying \"I think you'll find that fixed\" - this was the beginning of the hyposulphite plan of fixing.\nIndeed Herschel was able to achieve this remarkably rapid breakthrough due to the work that he had conducted and published in\n1819\non chemical processes related to photography. Herschel went on to publish a number of further papers on photography, in\n1839\n,\n1840\nand\n1842\n. In fact many people have wondered why Herschel himself never made the steps which would have led to his being recognised as the inventor of photography. There was a period of around\n20\nyears from the time of his\n1819\nwork when he might have made the breakthrough but again it was probably due to his wide ranging talents that he failed to do so. Not only did his talents take him into a wide range of other activities but his great skill as an artist meant that he had less need to invent photography than most others!\nIn\n1850\nHerschel made a rather strange decision as to the future direction of his career. He had turned down entering parliament as a Cambridge University member and he had also turned down a proposal that he become president of the\nRoyal Society\n. He did become rector of Marischal College in Aberdeen in\n1842\nand served as president of the\nBritish Association\nat Cambridge in\n1845\n. In\n1850\n, however, he accepted the post of Master of the Mint. He thus became head of the Mint at a very difficult time, with a major reform already agreed but its implementation not begun. It was not a job which Herschel found to his liking. There were difficulties in dealing with staff, difficulties in dealing with the Treasury, but perhaps most significantly of all to Herschel, he no longer could pursue his scientific interests.\nHerschel was a scientist by nature, not a business man. After difficult years, frequently separated from his family by the demands of the job which he tried his best to do well, he resigned. His health had suffered through the stresses of the post and it must have come as a great relief to him to be free of the problems. He essentially retired to Collingwood at this stage in his career being\n63\nyears of age. To say he retired needs of course to be qualified with the remark that throughout his life he never held any paid scientific post. He certainly did not retire from scientific work but, free of the huge demands of the job at the Mint for which he had received a fair salary, he was able to complete many tasks which he and his father had started but had never reached completion. As\nTait\nwrote\n(\nsee for example\n[\n10\n]\n)\n:-\nEvery day of Herschel's long and happy life added its share to his scientific services.\nAlthough he made no major breakthroughs for which he is remembered today he was considered by many of his contemporaries as the leading scientist of his day.\nBiot\nconsidered him the natural successor to\nLaplace\nwhen he died in\n1827\n. In the obituary\n[\n13\n]\nit is remarked:-\nIn John Frederick William Herschel British science has sustained a loss greater than any which it has suffered since the death of\nNewton\n, and one not likely to be replaced...\nThe article\n[\n13\n]\nthen goes on to say that of even higher value than his research:-\n... was the influence of his teaching and example in wakening the public to the power and beauty of science, and stimulating and guiding its pursuit."
}