{
  "nome_completo": "John Robert Stallings",
  "nome_curto": "John Stallings",
  "ano_nascimento": "1935",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stallings/",
  "lugar_nascimento": "Morrilton, Arkansas, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "John Stallings\nstudied mathematics at the University of Arkansas graduating with a B.Sc. in\n1956\n. He was one of the first two students to enrol in a new honours programme which the University had just introduced. After graduating with his first degree, Stallings went to Princeton University where he undertook research supervised by\nRalph Fox\n. He submitted his doctoral thesis\nSome Topological Proofs and Extensions of Grushko's Theorem\nand was awarded a Ph.D. by Princeton in\n1959\n. In the same year his first publication\nFixed point theorems for connectivity maps\nappeared in print. He did not publish the work of his thesis until\n1965\nwhen\nA topological proof of Grushko's theorem on free products\nappeared in\nMathematische Zeitschrift\n. David Epstein writes in a review:-\nThe author proved the results in this paper six years before he published them. The main result is a very elegant and short proof of Grushko's theorem ... The terrifying cancellation arguments and inductions within inductions within inductions, to which one was subjected in the past, can now be entirely avoided. The proofs given here are topological, but the author points out that they can easily be translated into pure algebraic proofs. This was done in the author's thesis ...\nAfter completing the work for his thesis in\n1959\nhe was awarded a National Science Foundation postdoctoral fellowship to enable him to study at the University of Oxford in England. While in Oxford he heard that\nStephen Smale\nhad proved the\nPoincaré\nConjecture for surfaces of dimension five and higher. Without any idea how\nSmale\nhad achieved this, Stallings was brave enough to try to prove the conjecture himself. At first he thought he had a proof but later realised that his proof only worked for surfaces of dimension seven and higher. His proof appears in\nPolyhedral homotopy-spheres\n(1960)\nand H Noguchi writes:-\nThe generalized\nPoincaré\nconjecture, i.e., that a homotopy\nn\nn\nn\n-sphere is topologically the\nn\nn\nn\n-sphere, has been an outstanding problem of topology. This paper is an ingenious solution of the conjecture for dimension\nn\n≥\n7\nn ≥ 7\nn\n≥\n7\n.\nStallings later wrote in\nHow not to prove the Poincaré conjecture\n(1965)\n:-\nI have committed the sin of falsely proving\nPoincaré's Conjecture\n. But that was in another country; and besides, until now, no one has known about it.\nHe ended this paper with the comment:-\nI was unable to find flaws in my 'proof' for quite a while, even though the error is very obvious. It was a psychological problem, a blindness, an excitement, an inhibition of reasoning by an underlying fear of being wrong. Techniques leading to the abandonment of such inhibitions should be cultivated by every honest mathematician.\nAfter returning from Oxford, Stallings taught at Princeton, first as an instructor in mathematics and later as assistant professor, before being appointed as a professor at the University of California at Berkeley in\n1967\n. He had held an Alfred P Sloan Research fellowship during the period\n1962\n-\n65\n.\nStallings visited the Tata Institute of Fundamental Research in\n1967\nand gave a series of lectures which were written up for publication by G Ananda Swarup who writes\n[\n3\n]\n:-\nI was asked to write up his lecture notes on 'Polyhedral Topology'. By that time my interests were established and I was planning to work in Algebraic Topology and Differential Topology. Before he came, I read many of his papers and during the two months of his stay, I was in contact with him almost daily discussing his lectures. ... Then over years, I found that whatever I did had some connection to Stallings' work. Perhaps, coming in to contact with a first rate mind early in my career unknowingly influenced me and I do not think that there is a single paper of mine not influenced by Stallings.\nIn\n1968\nStallings published his most famous paper\nOn torsion-free groups with infinitely many ends\nin the\nAnnals of Mathematics\n. L Neuwirth explains what is contained in the paper:-\nIn this remarkable paper, the author, using very little besides his bare hands, proves the following theorem:\nTheorem\n1\n. If G is a torsion-free, finitely presented group, with infinitely many ends, then G is a non-trivial free product.\nThis simple sounding theorem proves to be very powerful, implying\n(\nwith a little work\n)\nthe following two theorems:\nTheorem\n2\n. A torsion-free, finitely generated group, containing a free subgroup of finite index, is itself free.\nTheorem\n3\n. A finitely generated group of cohomological dimension\n1\nis free.\nThis last theorem answers a question which had been unanswered for over ten years and which had received considerable attention over that period of time. Theorem\n2\nanswers a question of\nJ-P Serre\n, who proved an analogue of Theorem\n2\nfor pro-p groups. The proof of Theorem\n1\nis both combinatorial and geometric in nature and, as suggested, is self-contained.\nFor this truly outstanding paper the\nAmerican Mathematical Society\nawarded Stallings their\nFrank Nelson Cole\nPrize in Algebra in\n1970\n. Also in\n1970\nhe was invited to address the International Congress of Mathematicians in Nice, France. He gave a talk on\nGroup theory and\n3\n-manifolds\n. He had been honoured in the previous year when invited to give the James K Whittemore Lecture in Mathematics at Yale University in\n1969\n. His topic was\nGroup theory and three-dimensional manifolds\n. This lecture and his Nice address were both published in\n1971\n.\nAmong the fifty or so papers Stallings published, we should highlight another two which have proved particularly important:\nTopology on finite graphs\n(1983)\nand\nNon-positively curved triangles of groups\n(1991)\n. The first of these introduced the 'Stallings subgroup graph' as a method to describe subgroups of free groups. It also introduced a foldings technique now known as 'Stallings' foldings method' which has been the basis for much later work. The second of these two papers introduced the notion of a triangle of groups which became the basis for later work on the theory of complexes of groups.\nStallings retired from his chair at Berkeley in\n1994\nbut he continued to supervise doctoral students until\n2005\n. In\n2000\nhe was sixty-five years old and the conference \"Geometric and Topological Aspects of Group Theory\" was held at the Mathematical Sciences Research Institute in Berkeley to honour the occasion. The special issue of volume\n92\nof\nGeometriae Dedicata\ndedicated to Stallings was another honour to mark his sixty-fifth birthday.\nHe died at his home in Berkeley of prostate cancer and was survived by his companion of many years, Marjorie Mulcahy. The UCBerkeleyNews\n[\n2\n]\nreported comments by Benson Farb, a former student of Stallings who is now professor of mathematics at the University of Chicago:-\n[\nStallings\n]\nwas known for his great originality. He most often came up with completely original ideas rather than following up on the ideas of others. His ideas often inspired a great flurry of activity by other mathematicians, though, who would follow up and develop Stallings' methods. ... Everyone loved Stallings. He was always generous with his time and with his ideas. He treated students with the same respect as he did colleagues; indeed, with more respect. Stallings had a dislike of authority, and made a point of playing by his own rules.\nThe UCBerkeleyNews also gives an indication of other aspects of Stalling's personality\n[\n2\n]\n:-\nStallings was known for his sense of humour as well as for his genius. Stallings once wrote an entire paper in Interlingua, a universal language created in the mid-\n20\nth\ncentury to facilitate world communication. Interlingua was only one of the obscure languages Stallings studied, according to cousin Sylvia Shannon of Virginia. She once saw a book on old Estonian by his bedside.\nStallings' nephew, Sandy Wilbourn, said that Stallings enjoyed hiking and camping, and was a gifted amateur pianist\n[\n2\n]\n:-\nIn many ways, he was the stereotype of a mathematician: a bit of a loner, a somewhat shy and private person. But he was known for his irony and for unusual points of view that would surprise his friends."
}