{
  "nome_completo": "John Flamsteed",
  "nome_curto": "John Flamsteed",
  "ano_nascimento": "1646",
  "ano_morte": "1719",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flamsteed/",
  "lugar_nascimento": "Denby (near Derby), Derbyshire, England",
  "lugar_morte": "Greenwich, London, England",
  "biografia": "John Flamsteed\n's father was a business man who was quite wealthy. Flamsteed's mother however died when he was still a child and this affected his upbringing.\nFlamsteed attended Derby free school which prepared children for a university education. However life did not go smoothly for Flamsteed who, at the age of\n14\n, developed severe health problems. A chronic rheumatic condition led to his father deciding not to send him to university. Flamsteed was extremely disappointed but he did not let it prevent him from studying.\nBetween\n1662\nand\n1669\nFlamsteed studied astronomy on his own without the help of teachers. In fact he does not seem to have missed the formal teaching but his father continued to oppose his studies and this made far more difficulties for Flamsteed than the fact that he could not attend lectures. Flamsteed's father always maintained that it was because of his son's ill health that he opposed his studying but Flamsteed, in his correspondence in later life, suggested that his father may have had other motives. Since Flamsteed's mother had died when he was young, Flamsteed was useful to his father as someone to look after the home. Whether or not this was his father's motive, certainly Flamsteed felt bitterness towards his father.\nFlamsteed began systematic observations in\n1671\n. He also began corresponding with Henry Oldenburg and\nJohn Collins\n. These two arranged for Flamsteed to meet\nJonas Moore\nduring a visit Flamsteed made to the\nRoyal Society\nin London in\n1670\n.\nMoore\nbecame his patron and persuaded Charles II to grant a warrant so that Jesus College Cambridge could award an M.A. to Flamsteed in\n1674\n.\nIn February\n1675\nFlamsteed arrived in London to stay with\nMoore\nand\nMoore\narranged that Flamsteed visit the King, Charles II, to ask for a Royal Observatory. In fact Flamsteed had to some extent paved the way to find favour with the King, having made a barometer and a thermometer for Charles II and the Duke of York in previous year. On\n4\nMarch\n1675\nthe King appointed Flamsteed his astronomical observer by Royal Warrant. From his salary of £\n100\nhe had to pay £\n10\ntaxes and also provide all his own instruments. The Royal Observatory at Greenwich was built and equipped for his observations and he began observing there in\n1676\n.\nOrdained in\n1675\n, Flamsteed received the income of the living of Burstow, Surrey from\n1684\n. In\n1677\nhe was elected a fellow of the\nRoyal Society\n.\nFlamsteed was a skilled observer and had a number of observing programmes at the Royal Observatory to answer major questions. Among his other achievements was the fact that Flamsteed invented the conical projection, an important projection of the sphere onto a plane which is used in cartography.\nNewton\nrequired data for his understanding of the orbit of the Moon, a difficult problem to which\nNewton\napplied his universal law of gravity. Flamsteed never quite seemed to understand what\nNewton\nrequired and the two were not on the best of terms, in fact Flamsteed was a perfectionist and was not an easy man to get on with.\nIn\n[\n1\n]\nhe is described as follows:-\nPossessed of an attitude that can only be described as uncompromising, he was an intemperate man even by the standards of an intemperate age. The particular and enduring subject of his passion was\nEdmond Halley\n. The last thirty years of Flamsteed's extensive correspondence is infused with vituperative remarks about the man who should have been his most natural ally.\nIt is hard to say exactly why Flamsteed was so bitter towards\nHalley\nbut their personalities certainly clashed while there must have been a certain professional jealousy between them. The battle Flamsteed had with\nHalley\nover the publication of his carefully made observations is described in\n[\n2\n]\n:-\nThe latter part of Flamsteed's life passed in controversy over the publication of his excellent observations. He struggled to withhold them until completed, but they were urgently needed by\nIsaac Newton\nand\nEdmond Halley\n, among others.\nNewton\n, through the\nRoyal Society\n, led the movement for their immediate publication. In\n1704\nPrince George of Denmark undertook the cost of publication, and, despite the prince's death in\n1708\nand Flamsteed's objections, the incomplete observations were edited by\nHalley\n, and\n400\ncopies were printed in\n1712\n. Flamsteed later managed to burn\n300\nof them.\nFlamsteed did publish his star catalogue\nHistoria Coelestis Britannica\nin\n1725\ncontaining data on\n3000\nstars. It listed more stars and gave their positions considerably more accurately than any other previous publication had done. It was ironical that his greatest enemy,\nHalley\n, should succeed him as the second Astronomer Royal."
}