{
  "nome_completo": "John Crank",
  "nome_curto": "John Crank",
  "ano_nascimento": "1916",
  "ano_morte": "2006",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Crank/",
  "lugar_nascimento": "Hindley, Lancashire, England",
  "lugar_morte": "Ruislip, London, England",
  "biografia": "John Crank\nwas a student of Lawrence Bragg and Douglas\nHartree\nat Manchester University\n(1934\n-\n38)\n, where he was awarded the degrees of B.Sc. and M.Sc. and later\n(1953)\nD.Sc. After war work on ballistics he was a mathematical physicist at Courtaulds Fundamental Research Laboratory from\n1945\nto\n1957\nand professor of mathematics at Brunel University\n(\ninitially Brunel College in Acton\n)\nfrom\n1957\nto\n1981\n. His main work was on the numerical solution of\npartial differential equations\nand, in particular, the solution of heat-conduction problems. In the\n1940\ns such calculations were carried out on simple mechanical desk machines. Crank is quoted as saying that to \"burn a piece of wood\" numerically then could take a week.\nJohn Crank is best known for his joint work with\nPhyllis Nicolson\non the heat equation, where a continuous solution\nu\n(\nx\n,\nt\n)\nu(x, t)\nu\n(\nx\n,\nt\n)\nis required which satisfies the second order partial differential equation\nu\nt\n−\nu\nx\nx\n=\n0\nu_{t} - u_{xx} = 0\nu\nt\n​\n−\nu\nx\nx\n​\n=\n0\nfor\nt\n>\n0\nt > 0\nt\n>\n0\n, subject to an initial condition of the form\nu\n(\nx\n,\n0\n)\n=\nf\n(\nx\n)\nu(x, 0) = f (x)\nu\n(\nx\n,\n0\n)\n=\nf\n(\nx\n)\nfor all real\nx\nx\nx\n. They considered numerical methods which find an approximate solution on a grid of values of\nx\nx\nx\nand\nt\nt\nt\n, replacing\nu\nt\n(\nx\n,\nt\n)\nu_{t}(x, t)\nu\nt\n​\n(\nx\n,\nt\n)\nand\nu\nx\nx\n(\nx\n,\nt\n)\nu_{xx}(x, t)\nu\nx\nx\n​\n(\nx\n,\nt\n)\nby finite difference approximations. One of the simplest such replacements was proposed by\nL F Richardson\nin\n1910\n.\nRichardson\n's method yielded a numerical solution which was very easy to compute, but alas was numerically unstable and thus useless. The instability was not recognised until lengthy numerical computations were carried out by Crank,\nNicolson\nand others. Crank and\nNicolson\n's method, which is numerically stable, requires the solution of a very simple system of linear equations\n(\na tridiagonal system\n)\nat each time level."
}