{
  "nome_completo": "Joseph Alfred Serret",
  "nome_curto": "Joseph Serret",
  "ano_nascimento": "1819",
  "ano_morte": "1885",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Serret/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Versailles, France",
  "biografia": "Joseph Serret\n's parents were Pierre Antoine Serret and Marie Virginie Tessier. Joseph was born at\n397\nRue St Honoré, Paris. He had an older sister who was also born in Paris; Marie Ernestine Serret was born on\n12\nSeptember\n1812\n. She is also known as Marie-Ernestine Cabart or Marie-Ernestine Cabart-Danneville and she became a famous painter.\nSerret graduated entered the École Polytechnique in Paris in\n1838\nand, after two years of study, graduated in\n1840\n. He continued his studies at the École des tabacs which had been founded in\n1831\nto train workers for the ten tobacco factories that were then operating in France. From\n1836\nthe École des tabacs took students exclusively from the École Polytechnique and Serret was in one of the six classes of classes of students which they recruited, namely the mathematics and mechanics class. Training at the École des tabacs was a two-year course, after which graduates worked as sub-inspectors, inspectors, controllers or administrators in the factories. However, after working in the tobacco factory for a while Serret resigned his position and returned to Paris. There he was appointed as an examiner at the College Sainte Barbe. At the same time he undertook research for a doctorate in mathematical sciences at the Faculty of Sciences in Paris. On\n25\nOctober\n1847\nhe submitted two theses to the Faculty of Science for his doctorate;\nSur le mouvement d'un point matériel attiré par deux centres fixes, en raison inverse du carré des distances\nⓉ\n(\nOn the motion of a point mass attracted by two fixed centres according to the inverse square of the distance\n)\n, and\nSur la détermination de la figure des corps célestes\nⓉ\n(\nThe determination of the shape of the heavenly bodies\n)\n.\nFor his two theses, following an oral examination, Serret was awarded his doctorate in\n1847\nand, in the following year, he was appointed as an entrance examiner for the École Polytechnique; he held this position until\n1862\n. In session\n1848\n-\n49\nhe was in charge of the Course of Higher Algebra and Analysis at the Faculty of Science.\nLouis-Benjamin Francoeur\nhad been the professor at the Faculty of Science but illness curtailed his activities from\n1840\nforcing him to retire from his chair in the Faculty of Sciences in\n1845\n. Serret took over some of his duties although\nFrancoeur\n's chair was given to\nJean-Marie Duhamel\n.\nOn\n26\nNovember\n1853\n, Serret married Cecile Marie Amélie Thomas, the daughter of Charles Jules Thomas and Cécile Herpin. In\n1856\nSerret took over some of\nUrbain Le Verrier\n's lecturing duties, and he did so again from\n1861\nto\n1863\n. On\n14\nJune\n1861\nhe was appointed professor of celestial mechanics at the Collège de France, after\nLouis Lefébure de Fourcy\nhad retired from the chair. Two years later he was appointed to the chair of differential and integral calculus at the Sorbonne. At the College of France he gave several series of lectures, taking a different topic in each academic year. He gave a course on the general principles of perturbation theory\n(1862)\n, on the rotational movement of the celestial bodies around their centres of gravity\n(1863)\n, on general variational theory and the applications of this theory in astronomy\n(1864)\n, on the methods of analysis which are used in astronomical theories\n(1865)\n, on\nelliptic functions\n, and applications of this theory to various problems of mechanics\n(1866)\n, on several problems related to the theory of the figure of celestial bodies\n(1867)\n, on the perturbation of the elliptical motion of celestial bodies\n(1868)\n, and on various issues relating to the theory of forces acting inversely as the square of the distance\n(1869)\n.\nIn\n1860\nSerret was elected to the\nAcadémie des Sciences\n, the position having become vacant following the death of\nLouis Poinsot\nin December of the previous year. In\n1871\nhe suffered a stroke and he retired to Versailles as his health was now too poor for him to continue in his various positions.\nJean-Claude Bouquet\ntook over Serret's lecture courses at the Faculty of Science in\n1871\nand was appointed professor of differential and integral calculus in\n1874\n. However, Serret became a member of the Bureau des Longitudes in\n1873\n.\nSerret did important work in\ndifferential geometry\n. Together with\nPierre Bonnet\nand\nJoseph Bertrand\nhe made major advances in this topic. The fundamental formulae in the theory of space curves are the\nFrenet\n-Serret formulae. Serret also published papers on\nnumber theory\n, calculus, the theory of functions, group theory, mechanics, differential equations and astronomy. Some of his most important papers are\nMémoire sur les surfaces orthogonales\nⓉ\n(\nMemoir on orthogonal surfaces\n)\n(1847)\n,\nSur quelques formules relatives à la théorie des courbes à double courbure\nⓉ\n(\nOn some formulas for the theory of curves of double curvature\n)\n(1851)\n,\nMémoire sur les surfaces dont toutes les lignes de courbure sont planes ou sphériques\nⓉ\n(\nMemoir on surfaces where all lines of curvature are flat or spherical\n)\n(1853)\n, and\nSur la moindre surface comprise entre des lignes droites données dans le même plan\nⓉ\n(\nOn the minimal surface of between straight lines in the same plane\n)\n(1855)\n. He edited the works of\nLagrange\nwhich were published in\n14\nvolumes between\n1867\nand\n1892\n. He also edited the\n5\nth\nedition of\nGaspard Monge\n's famous book\nApplication de l'analyse à la géométrie\nⓉ\n(\nApplication of analysis to geometry\n)\nwhich was published in\n1850\n. However, he was best known during his lifetime as the author of a number of extremely well-received textbooks. He published\nCours d'algèbre supérieure\nⓉ\n(\nAdvanced algebra course\n)\nin\n1849\n. The book, based on lectures he gave to the Faculty of Science in Paris. It contains a presentation of classical\nGalois theory\nand the paper\n[\n4\n]\nconsiders how much of this material is due to Serret himself. A second edition of the text only differed slightly from the first edition but, in\n1866\n, a third edition was published which contained much new material, a lot of which was a consequence of Serret's only researches. In this third edition he wrote a Preface which gives some details of all these three editions. He writes:-\nThe first edition of this book was a summary of lectures given at the Sorbonne in the Chair of Higher Algebra of the Faculty of Sciences of Paris. The favour with which this essay was greeted by mathematicians imposed on me the duty to make improvements which seemed to me to be necessary and to fill several important gaps.\nBut some years after its publication, when it came to preparing a second edition, I could not bring myself to change the character of the book, and, except for a small number of key changes, I kept the original wording, referring to notes at the end of the book, for all new developments that had seemed necessary to introduce.\nThis second edition has been out of print for a long time, and despite the success it achieved, I have not considered reprinting this work without having to make changes that profoundly alter its character and I need mention these here.\nAs soon as I began to deal with the considerable work, the results of which I am today publishing and on which I have not spent less than three years, I recognized the suitability and even the need for much more extensive developments in several important theories that had not been addressed in a comprehensive manner in previous editions; I had in my heart at the same time to introduce into this work the results of my new research on algebra, in particular those relating to elimination, the theory of congruences and that of substitutions. But the framework that I adopted for the first edition, and that I kept in the second, was unsuitable for such a large increase in materials. A division into lessons, so natural under the conditions where I published for the first time the Courses Higher Algebra, it became necessary to substitute a more rational division which allowed me to include a brief look at all theories that relate to each of the various branches of algebraic analysis.\nThe fourth edition of the book, now in two volumes, appeared in\n1877\nand\n1879\n. Serret give the following description of the contents:-\nThis fourth edition of my Higher Algebra is divided into five sections, each consisting of several chapters. The first section contains the general theory of equations and the principles on which their numerical solution is based; in particular a highly developed theory of\ncontinued fractions\ncan be found in this first section. The second section comprises the theory of symmetric functions, that of alternating functions and of determinants, and the many issues related to them, with important applications to the general theory of equations. The third section aims to give all the properties of integers that are essential in the theory of the algebraic resolution of equations; we find in this section a complete and new study of\nentire functions\nof one variable taken with respect to a first module. The fourth section contains the theory of substitutions; it includes all the key facts acquired in that science, in this difficult part of the algebraic analysis. Finally I gather together in the fifth Section everything that relates directly to the algebraic solution of equations.\nHis other popular textbooks include\nCours de calcul différentiel et intégral, Arithmétique\nⓉ\n(\nCourse of differential and integral calculus, Arithmetic\n)\n, and\nTraité de Trigonométrie rectiligne et sphérique\nⓉ\n(\nTreatise on plane and spherical trigonometry\n)\n. This last textbook had run to six editions by\n1880\nand Serret gives the following description of the contents of this sixth edition:-\nThe first chapter of this sixth edition contains the first elements of the theory of circular functions; the second is related to the construction and the use of trigonometric tables; the following two chapters contain Trigonometry itself, that is to say, the set of principles underlying the resolution of plane or spherical triangles. These four chapters are the elementary part of our textbook. In the fifth chapter, we give a fairly comprehensive theory of circular functions, so useful in the higher parts of mathematics. Finally, the sixth chapter, which ends the textbook, is primarily devoted to developing trigonometric solutions based on the use of series; these solutions relate to different situations that arise frequently in Astronomy and in Geodesy, and for which general methods become insufficient.\nThe book\nArithmetique\nhas the following Preface by Serret:-\nThis Treatise is intended primarily for people who study Arithmetic in order to tackle Algebra and other parts of Mathematics. However, it requires readers no prerequisites of the reader; so it can still be useful to those who want to restrict themselves to the first principles of computation.\nI have divided this work into six books, each composed of several chapters. The first five books consist of arithmetic in its own right; the sixth book contains an exposition of the metric system and several applications which together form a sort of introduction to Algebra.\nEach chapter ends with a series of questions relating to the material treated; I urge the reader to seek the solution.\nThe first note placed at the end of the work contains the theory of different number systems; the other two notes relate to the theory of the greatest common divisor and the approximate evaluation of irrational quantities.\nSeveral of Serret's books were translated into German and proved popular textbooks. Here is an extract from an\n1909\nreview of the third German edition of\nCours de Calcul Différentiel et Intégral\nⓉ\n(\nCourse of differential and integral calculus\n)\n[\n5\n]\n:-\nSerret's 'Cours de Calcul Différentiel et Intégral' still seems to hold its own in the land of its birth and in Germany. It was published some thirty-five years ago, and\nAxel Harnack\n's translation into German was issued in\n1884\n. A second edition was published in\n1904\nby Georg Bohlmann\n(1869\n-\n1928)\nand\nErnst Zermelo\n, and it concluded with about four and a half pages of errata. The last French edition came out in\n1900\n(\nit is time for another\n)\n, and now we have a third German edition prepared by\nGeorg Scheffers\n.\nDuring his lifetime Serret was honoured with election to the\nParis Academy of Sciences\nand, after his death, he has been honoured with a Paris street named for him."
}