{
  "nome_completo": "Joseph-Louis Lagrange",
  "nome_curto": "Joseph-Louis Lagrange",
  "ano_nascimento": "1736",
  "ano_morte": "1813",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lagrange/",
  "lugar_nascimento": "Turin, Sardinia-Piedmont (now Italy)",
  "lugar_morte": "Paris, France",
  "biografia": "Joseph-Louis Lagrange\nis usually considered to be a French mathematician, but the Italian Encyclopaedia\n[\n40\n]\nrefers to him as an Italian mathematician. They certainly have some justification in this claim since Lagrange was born in Turin and baptised in the name of Giuseppe Lodovico Lagrangia. Lagrange's father was Giuseppe Francesco Lodovico Lagrangia who was Treasurer of the Office of Public Works and Fortifications in Turin, while his mother Teresa Grosso was the only daughter of a medical doctor from Cambiano near Turin. Lagrange was the eldest of their\n11\nchildren but one of only two to live to adulthood.\nTurin had been the capital of the duchy of Savoy, but became the capital of the kingdom of Sardinia in\n1720\n, sixteen years before Lagrange's birth. Lagrange's family had French connections on his father's side, his great-grandfather being a French cavalry captain who left France to work for the Duke of Savoy. Lagrange always leant towards his French ancestry, for as a youth he would sign himself Lodovico LaGrange or Luigi Lagrange, using the French form of his family name.\nDespite the fact that Lagrange's father held a position of some importance in the service of the king of Sardinia, the family were not wealthy since Lagrange's father had lost large sums of money in unsuccessful financial speculation. A career as a lawyer was planned out for Lagrange by his father, and certainly Lagrange seems to have accepted this willingly. He studied at the College of Turin and his favourite subject was classical Latin. At first he had no great enthusiasm for mathematics, finding Greek geometry rather dull.\nLagrange's interest in mathematics began when he read a copy of\nHalley\n's\n1693\nwork on the use of algebra in optics. He was also attracted to physics by the excellent teaching of Beccaria at the College of Turin and he decided to make a career for himself in mathematics. Perhaps the world of mathematics has to thank Lagrange's father for his unsound financial speculation, for Lagrange later claimed:-\nIf I had been rich, I probably would not have devoted myself to mathematics.\nHe certainly did devote himself to mathematics, but largely he was self taught and did not have the benefit of studying with leading mathematicians. On\n23\nJuly\n1754\nhe published his first mathematical work which took the form of a letter written in Italian to\nGiulio Fagnano\n. Perhaps most surprising was the name under which Lagrange wrote this paper, namely Luigi De la Grange Tournier. This work was no masterpiece and showed to some extent the fact that Lagrange was working alone without the advice of a mathematical supervisor. The paper draws an analogy between the\nbinomial theorem\nand the successive derivatives of the product of functions.\nBefore writing the paper in Italian for publication, Lagrange had sent the results to\nEuler\n, who at this time was working in Berlin, in a letter written in Latin. The month after the paper was published, however, Lagrange found that the results appeared in correspondence between\nJohann Bernoulli\nand\nLeibniz\n. Lagrange was greatly upset by this discovery since he feared being branded a cheat who copied the results of others. However this less than outstanding beginning did nothing more than make Lagrange redouble his efforts to produce results of real merit in mathematics. He began working on the\ntautochrone\n, the curve on which a weighted particle will always arrive at a fixed point in the same time independent of its initial\nposition\n. By the end of\n1754\nhe had made some important discoveries on the tautochrone which would contribute substantially to the new subject of the\ncalculus of variations\n(\nwhich mathematicians were beginning to study but which did not receive the name 'calculus of variations' before\nEuler\ncalled it that in\n1766)\n.\nLagrange sent\nEuler\nhis results on the tautochrone containing his method of maxima and minima. His letter was written on\n12\nAugust\n1755\nand\nEuler\nreplied on\n6\nSeptember saying how impressed he was with Lagrange's new ideas. Although he was still only\n19\nyears old, Lagrange was appointed professor of mathematics at the Royal Artillery School in Turin on\n28\nSeptember\n1755\n. It was well deserved for the young man had already shown the world of mathematics the originality of his thinking and the depth of his great talents.\nIn\n1756\nLagrange sent\nEuler\nresults that he had obtained on applying the calculus of variations to mechanics. These results generalised results which\nEuler\nhad himself obtained and\nEuler\nconsulted\nMaupertuis\n, the president of the\nBerlin Academy\n, about this remarkable young mathematician. Not only was Lagrange an outstanding mathematician but he was also a strong advocate for the principle of least action so\nMaupertuis\nhad no hesitation but to try to entice Lagrange to a position in Prussia. He arranged with\nEuler\nthat he would let Lagrange know that the new position would be considerably more prestigious than the one he held in Turin. However, Lagrange did not seek greatness, he only wanted to be able to devote his time to mathematics, and so he shyly but politely refused the position.\nEuler\nalso proposed Lagrange for election to the\nBerlin Academy\nand he was duly elected on\n2\nSeptember\n1756\n. The following year Lagrange was a founding member of a scientific society in Turin, which was to become the\nRoyal Academy of Sciences of Turin\n. One of the major roles of this new Society was to publish a scientific journal the\nMélanges de Turin\nwhich published articles in French or Latin. Lagrange was a major contributor to the first volumes of the\nMélanges de Turin\nvolume\n1\nof which appeared in\n1759\n, volume\n2\nin\n1762\nand volume\n3\nin\n1766\n.\nThe papers by Lagrange which appear in these transactions cover a variety of topics. He published his beautiful results on the calculus of variations, and a short work on the\ncalculus of probabilities\n. In a work on the foundations of dynamics, Lagrange based his development on the principle of least action and on kinetic energy.\nIn the\nMélanges de Turin\nLagrange also made a major study on the propagation of sound, making important contributions to the theory of vibrating strings. He had read extensively on this topic and he clearly had thought deeply on the works of\nNewton\n,\nDaniel Bernoulli\n,\nTaylor\n,\nEuler\nand\nd'Alembert\n. Lagrange used a discrete mass model for his vibrating string, which he took to consist of\nn\nn\nn\nmasses joined by weightless strings. He solved the resulting system of\nn\n+\n1\nn+1\nn\n+\n1\ndifferential equations\n, then let\nn\nn\nn\ntend to infinity to obtain the same functional solution as\nEuler\nhad done. His different route to the solution, however, shows that he was looking for different methods than those of\nEuler\n, for whom Lagrange had the greatest respect.\nIn papers which were published in the third volume, Lagrange studied the integration of differential equations and made various applications to topics such as fluid mechanics\n(\nwhere he introduced the Lagrangian function\n)\n. Also contained are methods to solve systems of linear differential equations which used the characteristic value of a linear substitution for the first time. Another problem to which he applied his methods was the study the orbits of Jupiter and Saturn.\nThe\nAcadémie des Sciences\nin Paris announced its prize competition for\n1764\nin\n1762\n. The topic was on the libration of the Moon, that is the motion of the Moon which causes the face that it presents to the Earth to oscillate causing small changes in the position of the lunar features. Lagrange entered the competition, sending his entry to Paris in\n1763\nwhich arrived there not long before Lagrange himself. In November of that year he left Turin to make his first long journey, accompanying the Marquis Caraccioli, an ambassador from Naples who was moving from a post in Turin to one in London. Lagrange arrived in Paris shortly after his entry had been received but took ill while there and did not proceed to London with the ambassador.\nD'Alembert\nwas upset that a mathematician as fine as Lagrange did not receive more honour. He wrote on his behalf\n[\n1\n]\n:-\nMonsieur de la Grange, a young geometer from Turin, has been here for six weeks. He has become quite seriously ill and he needs, not financial aid, for the Marquis de Caraccioli directed upon leaving for England that he should not lack for anything, but rather some signs of interest on the part of his native country ... In him Turin possesses a treasure whose worth it perhaps does not know.\nReturning to Turin in early\n1765\n, Lagrange entered, later that year, for the\nAcadémie des Sciences\nprize of\n1766\non the orbits of the moons of Jupiter.\nD'Alembert\n, who had visited the\nBerlin Academy\nand was friendly with Frederick II of Prussia, arranged for Lagrange to be offered a position in the\nBerlin Academy\n. Despite no improvement in Lagrange's position in Turin, he again turned the offer down writing:-\nIt seems to me that Berlin would not be at all suitable for me while M\nEuler\nis there.\nBy March\n1766\nd'Alembert\nknew that\nEuler\nwas returning to St Petersburg and wrote again to Lagrange to encourage him to accept a post in Berlin. Full details of the generous offer were sent to him by Frederick II in April, and Lagrange finally accepted. Leaving Turin in August, he visited\nd'Alembert\nin Paris, then Caraccioli in London before arriving in Berlin in October. Lagrange succeeded\nEuler\nas Director of Mathematics at the\nBerlin Academy\non\n6\nNovember\n1766\n.\nLagrange was greeted warmly by most members of the Academy and he soon became close friends with\nLambert\nand\nJohann\n(\nIII\n)\nBernoulli\n. However, not everyone was pleased to see this young man in such a prestigious position, particularly\nCastillon\nwho was\n32\nyears older than Lagrange and considered that he should have been appointed as Director of Mathematics. Just under a year from the time he arrived in Berlin, Lagrange married his cousin Vittoria Conti. He wrote to\nd'Alembert\n:-\nMy wife, who is one of my cousins and who even lived for a long time with my family, is a very good housewife and has no pretensions at all.\nThey had no children, in fact Lagrange had told\nd'Alembert\nin this letter that he did not wish to have children.\nTurin always regretted losing Lagrange and from time to time his return there was suggested, for example in\n1774\n. However, for\n20\nyears Lagrange worked at Berlin, producing a steady stream of top quality papers and regularly winning the prize from the\nAcadémie des Sciences\nof Paris. He shared the\n1772\nprize on the\nthree body problem\nwith\nEuler\n, won the prize for\n1774\n, another one on the motion of the moon, and he won the\n1780\nprize on perturbations of the orbits of comets by the planets.\nHis work in Berlin covered many topics: astronomy, the stability of the\nsolar system\n, mechanics, dynamics, fluid mechanics, probability, and the foundations of the calculus. He also worked on\nnumber theory\nproving in\n1770\nthat every positive integer is the sum of four squares. In\n1771\nhe proved\nWilson\n's theorem\n(\nfirst stated without proof by\nWaring\n)\nthat\nn\nn\nn\nis\nprime\nif and only if\n(\nn\n−\n1\n)\n!\n+\n1\n(n -1)! + 1\n(\nn\n−\n1\n)\n!\n+\n1\nis divisible by\nn\nn\nn\n. In\n1770\nhe also presented his important work\nRéflexions sur la résolution algébrique des équations\nⓉ\n(\nReflections on the algebraic solution of equations\n)\nwhich made a fundamental investigation of why equations of degrees up to\n4\ncould be solved by\nradicals\n. The paper is the first to consider the roots of an equation as abstract quantities rather than having numerical values. He studied\npermutations\nof the roots and, although he does not compose permutations in the paper, it can be considered as a first step in the development of\ngroup theory\ncontinued by\nRuffini\n,\nGalois\nand\nCauchy\n.\nAlthough Lagrange had made numerous major contributions to mechanics, he had not produced a comprehensive work. He decided to write a definitive work incorporating his contributions and wrote to\nLaplace\non\n15\nSeptember\n1782\n:-\nI have almost completed a 'Traité de mécanique analytique'\nⓉ\n(\nTreatise on analytical mechanics\n)\n, based uniquely on the principle of virtual velocities; but, as I do not yet know when or where I shall be able to have it printed, I am not rushing to put the finishing touches to it.\nCaraccioli, who was by now in Sicily, would have liked to see Lagrange return to Italy and he arranged for an offer to be made to him by the court of Naples in\n1781\n. Offered the post of Director of Philosophy of the Naples Academy, Lagrange turned it down for he only wanted peace to do mathematics and the position in Berlin offered him the ideal conditions. During his years in Berlin his health was rather poor on many occasions, and that of his wife was even worse. She died in\n1783\nafter years of illness and Lagrange was very depressed. Three years later Frederick II died and Lagrange's position in Berlin became a less happy one. Many Italian States saw their chance and attempts were made to entice him back to Italy.\nThe offer which was most attractive to Lagrange, however, came not from Italy but from Paris and included a clause which meant that Lagrange had no teaching. On\n18\nMay\n1787\nhe left Berlin to become a member of the\nAcadémie des Sciences\nin Paris, where he remained for the rest of his career. Lagrange survived the French Revolution while others did not and this may to some extent be due to his attitude which he had expressed many years before when he wrote:-\nI believe that, in general, one of the first principles of every wise man is to conform strictly to the laws of the country in which he is living, even when they are unreasonable.\nThe\nMécanique analytique\nⓉ\n(\nAnalytical mechanics\n)\nwhich Lagrange had written in Berlin, was published in\n1788\n. It had been approved for publication by a committee of the\nAcadémie des Sciences\ncomprising of\nLaplace\n, Cousin,\nLegendre\nand\nCondorcet\n.\nLegendre\nacted as an editor for the work doing proof reading and other tasks. The\nMécanique analytique\nsummarised all the work done in the field of mechanics since the time of\nNewton\nand is notable for its use of the theory of differential equations. With this work Lagrange transformed mechanics into a branch of mathematical analysis. He wrote in the Preface:-\nOne will not find figures in this work. The methods that I expound require neither constructions, nor geometrical or mechanical arguments, but only algebraic operations, subject to a regular and uniform course.\nLagrange was made a member of the committee of the\nAcadémie des Sciences\nto standardise weights and measures in May\n1790\n. They worked on the metric system and advocated a decimal base. Lagrange married for a second time in\n1792\n, his wife being Renée-Françoise-Adélaide Le Monnier the daughter of one of his astronomer colleagues at the\nAcadémie des Sciences\n. He was certainly not unaffected by the political events. In\n1793\nthe Reign of Terror commenced and the\nAcadémie des Sciences\n, along with the other learned societies, was suppressed on\n8\nAugust. The weights and measures commission was the only one allowed to continue and Lagrange became its chairman when others such as the chemist Lavoisier,\nBorda\n,\nLaplace\n,\nCoulomb\n,\nBrisson\nand\nDelambre\nwere thrown off the commission.\nIn September\n1793\na law was passed ordering the arrest of all foreigners born in enemy countries and all their property to be confiscated. Lavoisier intervened on behalf of Lagrange, who certainly fell under the terms of the law, and he was granted an exception. On\n8\nMay\n1794\n, after a trial that lasted less than a day, a revolutionary tribunal condemned Lavoisier, who had saved Lagrange from arrest, and\n27\nothers to death. Lagrange said on the death of Lavoisier, who was guillotined on the afternoon of the day of his trial:-\nIt took only a moment to cause this head to fall and a hundred years will not suffice to produce its like.\nThe École Polytechnique was founded on\n11\nMarch\n1794\nand opened in December\n1794\n(\nalthough it was called the École Centrale des Travaux Publics for the first year of its existence\n)\n. Lagrange was its first professor of analysis, appointed for the opening in\n1794\n. In\n1795\nthe École Normale was founded with the aim of training school teachers. Lagrange taught courses on elementary mathematics there. We mentioned above that Lagrange had a 'no teaching' clause written into his contract but the Revolution changed things and Lagrange was required to teach. However, he was not a good lecturer as\nFourier\n, who attended his lectures at the École Normale in\n1795\nwrote:-\nHis voice is very feeble, at least in that he does not become heated; he has a very pronounced Italian accent and pronounces the s like z ... The students, of whom the majority are incapable of appreciating him, give him little welcome, but the professors make amends for it.\nSimilarly Bugge who attended his lectures at the École Polytechnique in\n1799\nwrote:-\n... whatever this great man says, deserves the highest degree of consideration, but he is too abstract for youth.\nLagrange published two volumes of his calculus lectures. In\n1797\nhe published the first theory of functions of a real variable with\nThéorie des fonctions analytiques\nⓉ\n(\nTheory of analytic functions\n)\nalthough he failed to give enough attention to matters of convergence. He states that the aim of the work is to give:-\n... the principles of the differential calculus, freed from all consideration of the infinitely small or vanishing quantities, of limits or fluxions, and reduced to the algebraic analysis of finite quantities.\nAlso he states:-\nThe ordinary operations of algebra suffice to resolve problems in the theory of curves.\nNot everyone found Lagrange's approach to the calculus the best however, for example\nde Prony\nwrote in\n1835\n:-\nLagrange's foundations of the calculus is assuredly a very interesting part of what one might call purely philosophical study: but when it is a case of making transcendental analysis an instrument of exploration for questions presented by astronomy, marine engineering, geodesy, and the different branches of science of the engineer, the consideration of the infinitely small leads to the aim in a manner which is more felicitous, more prompt, and more immediately adapted to the nature of the questions, and that is why the Leibnizian method has, in general, prevailed in French schools.\nThe second work of Lagrange on this topic\nLeçons sur le calcul des fonctions\nⓉ\n(\nLessons on calculating functions\n)\nappeared in\n1800\n.\nNapoleon named Lagrange to the Legion of Honour and Count of the Empire in\n1808\n. On\n3\nApril\n1813\nhe was awarded the Grand Croix of the Ordre Impérial de la Réunion. He died a week later."
}