{
  "nome_completo": "Jules Joseph Drach",
  "nome_curto": "Jules Drach",
  "ano_nascimento": "1871",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Drach/",
  "lugar_nascimento": "Sainte-Marie-aux-Mines (near Colmar), France",
  "lugar_morte": "Cavalaire, Var, France",
  "biografia": "Jules Drach\n's parents were Joseph Louis Drach and Marie-Josèphe Balthazard who were farmers. Just before Jules' birth was a particularly difficult time for all French people, but it was particularly difficult for people living in Alsace like the Drach family. The popularity of Napoleon III, the French emperor, had declined and he decided that a war with Prussia might change his political fortunes. His advisers had told him that the French Army could defeat Prussia with ease, so the plan looked like a winner. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states so he too saw the political advantage of war. With both sides actively seeking a war, the Franco-Prussian War became inevitable. On\n14\nJuly\n1870\n, Bismarck sent a telegram aimed at infuriating the French government. He succeeded, for on the\n19\nJuly France declared war on Prussia. The German offensive met with only an ineffective French reply. In August, the German army trapped part of the French army in Metz and they surrendered on\n1\nSeptember. On\n19\nSeptember the German army began to blockade Paris which surrendered on\n28\nJanuary\n1871\n. The formal Treaty of Frankfurt on\n10\nMay\n1871\nended the war and when it was implemented a couple of months later Germany annexed Alsace and half of Lorraine, with Metz. The Drach family were French and, despite being farmers, they saw their only option was to leave German occupied Alsace and their farm. Joseph Drach and his wife, together was Jules and their other two sons, fled to Saint Dié in the Vosges, the region in which both had been born.\nJules worked as an architect in his youth to help his family who had never been very well off but were considerably poorer after they were forced to flee. After attending primary school Jules was able to go to the College in Saint Dié. This was only possible because he was awarded a scholarship, and this only happened due to the strong encouragement of the teachers at the primary school who had seen the young boy's potential. After attending the College, he went to the Lycée in Nancy, which was to the north west of Saint Dié, then to École Normale Supérieure in Paris at the age of\n18\n.\nDrach gave a lecture in\n1892\nSur la transcendance du nombre π\nⓉ\n(\nOn the transcendence of the number π\n)\nas part of the requirements of his degree of agrégé. The proof of trancendency which he gave, and also the proof of the general theorem of\nLindemann\n, is essentially that of\nWeierstrass\n. Drach's lecture was published in\n1951\n. Despite a poor performance in his agrégé, he was encouraged by\nJules Tannery\nto undertake mathematical research and he obtained a doctorate from École Normale Supérieure in\n1898\nfor his thesis\nEssai sur la théorie générale de l'intégration et sur la classification des transcendantes\nⓉ\n(\nEssay on the general theory of integration and classification of transcendentals\n)\n. It is clear that\nJules Tannery\nwas right to encourage Drach, for his thesis was an impressive and important piece of mathematics which we say a little more about below.\nAfter completing his doctorate, Drach was appointed as Maître de Conférences at the University of Clermont. Following on from this first appointment he went to Lille, then to a professorship of mathematics at the University of Poitiers. While he was at Poitiers, Drach married Mathilde Guitton; their son Pierre Drach became a famous biologist. After an appointment at Toulouse, Drach was appointed to the Chair of Analytical Mechanics and Higher Analysis at the Sorbonne in Paris in\n1913\n.\nDrach viewed\nÉmile Picard\n's application, in\n1887\n, of\nGalois\ntheory to linear\ndifferential equations\nas a model of perfection and he tried to extend\nGalois theory\nto differential equations in general, building on the work of\nLie\nand\nVessiot\nin addition to that of\nÉmile Picard\n. This work by Drach appeared in his doctoral thesis, which was published in\n1898\n, and in it he asserted\n[\n1\n]\n:-\n... that the theory of groups is inseparable from the study of the transcendental quantities of the integral calculus.\nOther papers by Drach include three published in\n1908\n:\nSur les systèmes complètement orthogonaux de l'espace euclidien à n dimensions\nⓉ\n(\nOn the completely orthogonal systems of Euclidean n-dimensional space\n)\n;\nRecherches sur certaines déformations remarquables à réseau conjugué persistant\nⓉ\n(\nResearch on some remarkable distortions of a persistent conjugated network\n)\n; and\nSur le problème logique de l'intégration des équations différentielles\nⓉ\n(\nOn the logical problem of the integration of differential equations\n)\n. The 'logical' problem of integration consists\n[\n1\n]\n:-\n... of classifying the transcendental quantities satisfying the rational system verified by the solutions.\nDrach opposed this and introduced the idea of a 'rationality group'.\nAfter Drach was appointed to the chair at the Sorbonne, there was only a short period before the outbreak of World War I. He contributed to the war effort by applying his methods to solve problems in ballistics. After the war ended he published his geometric approach to such problems in\nL'équation différentielle de la balistique extérieure et son intégration par quadratures\nⓉ\n(\nThe differential equation of the exterior ballistics and integration by quadratures\n)\n(1920)\n. The work by Drach in\n1919\nis the subject of the paper\n[\n2\n]\n. In this the authors write:-\nIn this note we reproduce Drach's original contribution establishing the relationship between complete integrability and spectral theory. Drach's results can be compared with the modern treatment of the same class of equations.\nIn\n1935\nDrach considered Hamiltonian systems with two degrees of freedom that have cubic first integrals. Ten systems discovered by Drach are looked at using modern techniques in\n[\n5\n]\n.\nIn\n1945\nDrach published\nSur quelques points de théorie des nombres et sur la théorie générale des courbes algégriques\nⓉ\n(\nOn some points of theory of numbers and on the general theory of curves algégriques\n)\nin which he used the method of descent to prove theorems concerning numbers represented by the sums of two, three and four squares and by the sum of three triangular numbers. In the second part of the paper he classified algebraic curves with certain specified types of singularities. Another example of his work is\nSur la théorie des corps plastiques et l'équation d'Airy-Tresca\nⓉ\n(\nOn malleable body theory and the  Airy-Tresca equation\n)\nwhich he published in\n1946\n. In this paper he discussed stresses and velocities of a perfectly plastic body in a state of plane stress. He published two papers on geometry,\nSur les lignes d'osculation quadrique des surfaces.\n(\nLignes de Darboux\n)\nⓉ\n(\nOn the lines of osculation of quadric surfaces.\n(\nDarboux Lines\n)\n)\n(1947)\nand\nDétermination des lignes d'osculation quadrique\n(\nlignes de Darboux\n)\nsur les surfaces cubiques. Lignes asymptotiques de la surface de Bioche\nⓉ\n(\nDetermination of osculating quadric\n(\nDarboux lines\n)\non cubic surfaces. Asymptotic lines of the of Bioche's surface\n)\n(1948)\n. These papers are on\nDarboux\ncurves:-\nA\nquadric\nhaving contact of the second order with a surface at an ordinary point of the surface will intersect it in a curve with a triple point at the point of contact. The directions in which the three tangents may coincide are the directions at the point of the \"\nDarboux\ncurves.\"\nAround the same time Drach published two papers on partial differential equations:\nSur les équations aux dérivées partielles du premier ordre dont les caractéristiques sont lignes asymptotiques des surfaces intégrales\nⓉ\n(\nOn the partial differential equations of the first order whose characteristics are asymptotic lines of integral surfaces\n)\n(1947)\n; and\nSur des équations aux dérivées partielles du premier et du second ordre dont les caractéristiques sont lignes asymptotiques des surfaces intégrales\nⓉ\n(\nOn the partial differential equations of first and second order whose characteristics are asymptotic lines of integral surfaces\n)\n(1948)\n.\nDrach was a friend of\nBorel\n, and together they published lectures by\nPoincaré\nLeçons sur la théorie de l'élasticité\nⓉ\n(\nLectures on the theory of elasticity\n)\n(1892)\nand by\nJules Tannery\nIntroduction à l'étude de la théorie des nombres et de l'algèbre supérieure\nⓉ\n(\nIntroduction to the study of the theory of numbers and higher algebra\n)\n(1895)\nwhile Drach was a student at the École Normale Supérieure. Later in his career Drach helped to prepare\nPoincaré\n's works for publication. These appeared in\n11\nvolumes between\n1916\nand\n1956\n.\nThe work which Drach undertook has proved important and papers like\n[\n4\n]\n,\n[\n5\n]\n, and\n[\n6\n]\nexplain the significance of his ideas for modern mathematics. It is all the more impressive that Drach managed to do such good work despite poor health which affected him for many years. The importance of his contributions were recognised when he was elected to the\nAcademy of Sciences\non\n10\nJune\n1929\nbut because of his health problems he could spend little time in Paris and spent most of the year in the warm south of France. He had an estate at Cavalaire and after he retired from his chair at the Sorbonne he continued to undertake research living on his estate. The papers we have described above show that he remained mathematically active, in fact publishing four papers during the final two years of his life. Retirement from teaching did give him more time to enjoy his other passions, namely reading and creating art from pliable materials.\nIn many ways Drach's personality was a result of the difficult times through which he lived. It was the dramatic events of his first few years which shaped him and, despite having a good standard of living, nevertheless his affinity was to the poor, particularly the poor peasants who struggled to make their living from the land. He did much to help improve the land and conditions of those around him."
}