{
  "nome_completo": "Kenneth Kilpatrick Weatherhead",
  "nome_curto": "K K Weatherhead",
  "ano_nascimento": "1898",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weatherhead/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "K K Weatherhead\n's father was  James Weatherhead\n(\nborn at Whitsome, Berwickshire about\n1863)\nwho was a United Free Church Minister. His mother was  Margaret M Weatherhead born Glasgow about\n1875\n. He had two older siblings, Elizabeth\n(\nborn about\n1896)\nand Leslie\n(\nborn about\n1897)\n.\nWeatherhead was born at\n18\nKelvinside Terrace, Glasgow. He was educated at Giffnock Academy from\n1902\nto\n1906\n, Harris Academy, Dundee, from\n1906\nto\n1911\n, then Dundee High School from\n1911\nto\n1916\n. He obtained passes in the Leaving Certificate examination at the Higher level in Latin, Mathematics, English, and French in\n1915\n.\nAfter having passed the Preliminary Examination, Weatherhead first matriculated at the University of Edinburgh in October\n1916\nwhere he was awarded the John Welsh Mathematical Scholarship. In his first year he took courses at the Ordinary level in Mathematics, Natural Philosophy, and Latin. His studies, however, had to be put on hold due to World War I in which he served with the Scots Guards. After the war ended he returned to Edinburgh University in\n1919\nand graduated with an M.A. with First Class honours in Mathematics and Natural Philosophy on\n13\nJuly\n1922\n.\nIn\n1922\nWeatherhead joined The Scottish Life Assurance Co. Ltd. in Edinburgh and by\n1925\nhe had qualified to become a fellow of The Faculty of Actuaries. In\n1929\nhe became Assistant Actuary of The Scottish Equitable Life Assurance Society. Here are a few further highlights of his career.\nIn December\n1935\nhe was appointed as an external examiner in Actuarial Mathematics for the University of Edinburgh. Then, in February\n1938\n, The Scottish Equitable Life Assurance Society promoted him from assistant actuary to joint actuary. In March\n1940\nThe Scottish Temperance and General Assurance Co. Ltd. made the following announcement:-\nOwing to the continued expansion of the company, the directors decided to increase the official staff by the appointment of Mr Kenneth K Weatherhead, M.A., F.F.A., as joint secretary with Mr Bowie\n[\nin April\n1939]\n. Mr Weatherhead has had a successful professional career in Edinburgh, where he relinquished the position of joint actuary of the Scottish Equitable Life Assurance Society to take up service with our Company, and we welcome him as a valuable addition to our staff.\nFull details of Weatherhead's career are given in two obituaries at\nTHIS LINK\nand\nTHIS LINK\n.\nFinally we note that Weatherhead was a member of the\nEdinburgh Mathematical Society\n, joining the Society in November\n1925\n."
}