{
  "nome_completo": "Karl Frithiof Sundman",
  "nome_curto": "Karl Sundman",
  "ano_nascimento": "1873",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sundman/",
  "lugar_nascimento": "Kasko, Vaasa, Finland",
  "lugar_morte": "Helsinki, Finland",
  "biografia": "Karl Sundman\nwas born in the small town of Kasko\n(\nKaskinen\n)\non the Gulf of Bothnia in Finland. His father John Frithiof Sundman was a customs officer. Karl's health was poor as he was growing up and he certainly did not have a very easy time studying on his own without a teacher so that he could take the baccalaureate examinations, which he did on\n18\nMay\n1893\n. After qualifying to enter university, Sundman went to Helsinki\n(\nHelsingfors\n)\nwhere he began his studies in the autumn of\n1883\n. The University was an ancient one, founded in\n1640\n, and there Sundman excelled academically although he had to battle against financial difficulties. During his studies he had to take on work to bring in money to cover his living expenses. These financial problems gave him a hard time but did not dampen his enthusiasm for scientific studies. He had two papers published on mathematical astronomy in\n1896\nbefore he graduated from Helsinki in the following year.\nAfter graduating Sundman went to Pulkovo Observatory to continue his research on astronomy. The Observatory,\n19\nkm south of St Petersburg on the Pulkovo Heights, was founded in\n1839\n. Its first director was Friedrich Georg Wilhelm von Struve. In\n1878\na\n76\n-centimetre\n(30\n-inch\n)\nrefractor was built there which was the largest telescope in the world at the time. Sundman, however, was interested in the theoretical aspects of astronomy. He spent two years at Pulkovo Observatory before being awarded a scholarship which allowed him to continue his studies at various universities in Germany and France. His doctoral dissertation\nÜber die Störungen der kleinen Planeten, speciel derjenigen, deren mittlere Bewegung annähernd das Doppelte Jupiters beträgt\nⓉ\n(\nOn the interference of minor planets, especially those with period nearly twice that of Jupiter\n)\nwas submitted in\n1901\n. In this work Sundman examined the perturbations of minor planets whose period of revolution round the sun is in the ratio of\n1\n:\n2\nof that of Jupiter. He restricted considerations to those minor planets whose orbits have eccentricity less than\n0\n.\n16\nand whose orbit was inclined to the plane of Jupiter's orbit by less than\n14\n°. His methods were applicable more generally, however, and he went on to make a major breakthrough in the solution of the three-body problem.\nIn\n1902\nSundman was appointed as a lecturer at the University of Helsinki, being promoted to extraordinary professor of astronomy there in\n1907\n. In\n1918\nhe was named as Professor of Astronomy at Helsinki and also director of the Observatory. He occupied both the chair of astronomy and the directorship of the Observatory until he retired in\n1941\n.\nThe most famous contribution of Sundman was his solution of the three-body problem which he accomplished using analytic methods to prove the existence of an infinite series solution. His work on this topic is contained in a number of papers:\nRecherches sur le problème des trois corps\nⓉ\n(\nResearch on the three-body problem\n)\n(1907)\n,\nNouvelles recherches sur le problème des trois corps\nⓉ\n(\nNew research on the three-body problem\n)\n(1909)\n,\nSur les singularités réelles dans le problème des trois corps\nⓉ\n(\nOn the real singularities in the three-body problem\n)\n(1910)\n, and\nMémoire sur le problème des trois corps\nⓉ\n(\nMemoir on the three-body problem\n)\n(1912)\n. In\n1913\nthe\nAcademy of Sciences\nin Paris awarded Sundman their Pontécoulant prize for his outstanding work on this problem. In fact the Academy was so impressed by his solution that, after receiving a report on his work from a committee headed by émile Picard, they decided to double the usual value of the prize in recognition of the brilliance of the work.\nOne of the reasons why the Academy was so impressed by Sundman's solution was that it was a problem to which\nHenri Poincaré\nhad devoted much effort. However, little progress was made and Tisserand in volume\n4\nof his Méchanique céleste  had written:-\nThe rigorous solution of the three-body problem is no further advanced today than it was in\nLagrange\n's time, and one could say that it was clearly impossible.\nTo regularize the singularity of the differential equations of motion, in the\n1912\npaper mentioned above, Sundman introduced a new independent variable which regularizes the motion within a band of finite breadth. In\n[\n2\n]\nDell'Aglio looks at the approaches of\nLevi-Civita\n,\nPainlevé\nand Sundman to the three body problem which:-\n... constitute the greatest contribution to the development of this branch of modern celestial mechanics. ... it is possible to show the existence of two different research programs, one related to\nLevi-Civita\n's works, the other to Sundman's investigations, which include for the first time a complete regularization of the three-body problem. The methodological differences between these two research programs and their influences upon one another allow a complete reconstruction of this historical case. In particular, their divergences reflect different views about the mathematical model of the three-body problem; and, finally, different conceptions about the idea of 'solution' of a physico-mathematical problem.\nSundman will always be known for his remarkable solution to the extremely difficult three-body problem, but he did other important work. Perhaps the most significant was his paper\nPlan d'une machine destinée à donner les perturbations des planètes\nⓉ\n(\nPlan of a machine designed to calculate planetary perturbations\n)\n(1915)\n. E J Nyström describes the contents of this paper:-\nSundman considers that the complicated calculations necessary to determine the perturbations caused by the planets on each other is work which could be carried out by means of a machine. Such a machine will necessarily be very complicated and Sundman describes the project in detail using well-known techniques and construction capabilities in a field unrelated to astronomy. ... It is a matter of construction a machine for solving systems of second order differential equations. The machine is planned according to the principle of analogy, that is to say the mathematical operations are translated or represented on different parts of the mechanical system. Although designed to calculate astronomical perturbations, the machine essentially functions as an integrator for differential equations and could be used for a large number of other problems. Its adaptation for these other aims will be relatively simple to achieve.\nLet us note a few other publications by which appeared late in his career. He published\nLa gravitationuniverselle et sa vitesse de propogation\nⓉ\n(\nUniversal gravitation and the speed of propogation\n)\n(1929)\n,\nDémonstration nouvelle du théorème de Poisson sur l'invariabilité des grands axes\nⓉ\n(\nDemonstration of new Poisson theorem on the invariance of the major axes\n)\n(1940)\n, and\nThe Motions of the Moon and the Sun at the Solar Eclipse of\n1945\n, July\n9\nth\n(1948)\n. In the\n1940\npaper Sundman gave a new and elegant demonstration of the theorem of\nPoisson\non the invariability of the major axes of the planetary orbits which had been demonstrated in several ways.\nIn\n[\n4\n]\nJärnefelt describes Sundman's character:-\nSundman had a very reserved character. He was always full of sympathy for his fellow man and hated publicity.\nThis last statement suggests that Sundman may not have been pleased had he realised that\n60\nyears after his death a biography describing his remarkable achievements would be placed on the web!"
}