{
  "nome_completo": "Karl Pearson",
  "nome_curto": "Karl Pearson",
  "ano_nascimento": "1857",
  "ano_morte": "1936",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pearson/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Coldharbour, Surrey, England",
  "biografia": "Karl Pearson\n's mother Fanny Smith and his father William Pearson were both from Yorkshire families. William was a barrister of the Inner Temple\n[\n26\n]\n:-\nHe was a man of great ability, with exceptional mental and physical energy and a keen interest in historical research, traits which his son also exhibited.\nWilliam and Fanny named their second child Carl and he used this name until he was about\n23\nyears old when he changed the spelling to Karl. In this article we shall refer to him either as Karl or as Pearson.\nKarl, together with his one older brother and one younger sister, were brought up in an upper-middle class family. After being educated at home up to the age of nine years, he was sent to University College School, London. He studied there until he was sixteen, but he was then forced to leave due to illness. A private tutor was engaged to teach him at home and he took the Cambridge Scholarship Examinations in\n1875\nand, coming second in the examinations, he won a scholarship to King's College.\nAt Cambridge he was taught by\nStokes\n,\nMaxwell\n,\nCayley\nand\nBurnside\n. His coach was perhaps the most famous of all the Cambridge coaches, namely\nRouth\n. He spoke of his undergraduate years saying\n(\nsee\n[\n3\n]\n)\n:-\nAt Cambridge I studied mathematics under\nRouth\n,\nStokes\n,\nCayley\n, and\nClerk Maxwell\n, but read papers on Spinoza.\nBut these were days of great happiness for Pearson\n[\n22\n]\n:-\nThere was pleasure in the friendships, there was pleasure in the fights, there was pleasure in the coaches' teaching, there was pleasure in searching for new lights as well in mathematics as in philosophy and religion.\nAs he indicates in these quotations, his studies at Cambridge were unusually broad. He read Goethe, Dante, and Rousseau, read about the history of religious thought, and enjoyed debating with students of moral philosophy about their subject.\nPearson was never one to accept authority and this comes out clearly during his undergraduate years at Cambridge. At that time divinity lectures and attendance at chapel were compulsory. Pearson was deeply interested in religion yet hated the compulsory nature of these activities. He argued successfully to have the University regulations changed so that attendance was no longer compulsory at divinity lectures and, having won this battle, fought the second battle on compulsory chapel with his father's help. Having won, he surprised the University authorities by continuing to attend chapel but, of course, to Pearson there was a world of difference between attending voluntarily and compulsory attendance.\nHe graduated from Cambridge University in\n1879\nas Third\nWrangler\nin the Mathematical Tripos\n(\nmeaning that he was ranked third among those who gained a First Class degree\n)\n. He then travelled to Germany to study at the University of Heidelberg. There he studied physics under G H Quincke and metaphysics under Kuno Fischer. He next visited the University of Berlin, where he attended the lectures of the famous physiologist Émile du Bois-Reymond on Darwinism\n(\nÉmile was a brother of\nPaul du Bois-Reymond\n, the mathematician\n)\n. Other subjects which he studied in Berlin included Roman Law, taught by Bruns and Mommsen, medieval and\n16\nth\ncentury German Literature, and Socialism. He was strongly influenced by the courses he attended at this time and he became sufficiently expert on German literature that he was offered a post in the German Department of Cambridge University. On his return to England in\n1880\n, Pearson first went to Cambridge\n[\n3\n]\n:-\nBack in Cambridge, I worked in the engineering shops, but drew up the schedule in Mittel- and Althochdeutsch for the Medieval Languages Tripos.\nHis first book,\nThe New Werther\n, was published at this time. In it Pearson gives a clear indication of why he studied so many diverse subjects\n(\nsee for example\n[\n17\n]\nor\n[\n26\n]\nor\nThe New Werther\n)\n:-\nI rush from science to philosophy, and from philosophy to our old friends the poets; and then, over-wearied by too much idealism, I fancy I become practical in returning to science. Have you ever attempted to conceive all there is in the world worth knowing - that not one subject in the universe is unworthy of study? The giants of literature, the mysteries of many-dimensional space, the attempts of\nBoltzmann\nand Crookes to penetrate Nature's very laboratory, the Kantian theory of the universe, and the latest discoveries in embryology, with their wonderful tales of the development of life - what an immensity beyond our grasp! ... Mankind seems on the verge of a new and glorious discovery. What\nNewton\ndid to simplify the planetary motions must now be done to unite in one whole the various isolated theories of mathematical physics.\nDespite the feelings he expresses in this quote, Pearson decided to study law so that he might, like his father, be called to the Bar. Again quoting Pearson's own account\n[\n3\n]\n:-\nComing to London, I read in chambers in Lincoln's Inn, drew up bills of sale, and was called to the Bar, but varied legal studies by lecturing on heat at Barnes, on Martin Luther at Hampstead, and on Lasalle and Marx on Sundays at revolutionary clubs around Soho.\nDespite being called to the Bar in\n1882\n, Pearson never practised law. During\n1882\n-\n84\nhe lectured around London on a wide variety of topics such as German social life, the influence of Martin Luther, and historical topics. He also wrote essays, articles and reviews as well as substituting for professors of mathematics at King's College and University College London.\nHe spent most of his career at University College, London, after he was appointed to the Chair of Applied Mathematics in\n1885\nas Goldsmid Professor. One of his former pupils writes in\n[\n3\n]\n:-\nHe was no \"textbook\" teacher, and could instil an understanding of the fundamentals of a subject with greater ease and in a shorter time than any mathematical lecturer I have since known. His personal appearance was arresting: the typical Greek athlete, with finely cut features and a magnificent physique. ... He was a pertinacious controversialist, but in any personal discussion his humorous twinkle was disarming.\nFrom\n1884\nto\n1890\nPearson was highly productive. As well as giving lectures on statics, dynamics and mechanics, he completed the unfinished first volume of\nClifford\n's\nThe Common Sense of the Exact Sciences\n(\npublished in\n1885)\n, completed and edited the half written first volume of\nTodhunter\n's\nHistory of the Theory of Elasticity\n, began working on the second volume which had hardly been started by\nTodhunter\n, and published many papers on applied mathematics. He also lectured on\nThe Ethic of Free Thought\n, and undertook research on a number of historical topics such as the evolution of Western Christianity. In\n1885\nhe was a founder member of the Men and Women Club dedicated to discussion of the role of men and women in society, and at meetings of the club he met Maria Sharpe. Their marriage in\n1890\nproduced three children;\nEgon Pearson\n(\nborn\n1895)\nwho followed his father's profession, and two daughters Sigrid Loetitia who was three years older than Egon and Helga Sharpe who was three years younger.\nIt is worth pausing to realise that Pearson is known as one of the founders of statistics, yet we have reached\n1890\nand the\n33\nyear old professor of applied mathematics, although having a high reputation in a wide variety of areas, had still not begun to work on statistical problems. As Aldrich writes in\n[\n6\n]\n:-\n... his contribution to statistical methodology overshadowed his contribution to any substantive field. His statistical contributions can be divided into ways of arranging numerical facts - univariate and multivariate - estimation and testing.\nTwo events changed the course of his career. The first was the publication by\nGalton\nof his book\nNatural Inheritance\nin\n1889\n. The second was the appointment of\nWeldon\nas Professor of Zoology at University College London in\n1890\n. Walker writes in\n[\n26\n]\n:-\nThe importance for science of the intense personal friendship which soon sprang up between Pearson and\nWeldon\n, then both in their early thirties, can scarcely be exaggerated.\nWeldon\nasked the questions that drove Pearson to some of his most significant contributions.\nThrough\nWeldon\nand\nGalton\n's book, Pearson became interested in developing mathematical methods for studying the processes of heredity and evolution. From\n1893\nto\n1912\nhe wrote\n18\npapers entitled\nMathematical Contributions to the Theory of Evolution\nwhich contain his most valuable work. These papers contain contributions to regression analysis, the correlation coefficient and includes the chi-square test of statistical significance\n(1900)\n. His chi-square test was produced in an attempt to remove the normal distribution from its central position.\nHis book\nThe Grammar of Science\n(1892)\nwas remarkable in that it anticipated some of the ideas of relativity theory. It was wide ranging and attempted to extend the influence of science into all aspects. Pearson coined the term 'standard deviation' in\n1893\n. His work was influenced by the work of\nEdgeworth\nwhile he in turn influenced the work of\nYule\n.\nPearson was a co-founder, with\nWeldon\nand\nGalton\n, of the statistical journal\nBiometrika\n. This came about because he had presented a paper to the\nRoyal Society\n, of which he had been elected a Fellow in\n1896\nand received its Darwin Medal in\n1898\n, in\n1900\n. The paper looked at heredity and argued using a mathematical analysis of large amounts of collected data. Biologists in the\nRoyal Society\nwere not, however, prepared to accept biological conclusions based on mathematical analysis.\nWeldon\n, in a letter to Pearson on\n16\nNovember\n1900\n, suggested solving the problem of getting such papers published by setting up their own journal. Pearson was enthusiastic and suggested they name the journal\nBiometrika\n. The first volume appear in October\n1901\nwith Pearson as its editor, a role he continued to hold until his death\n35\nyears later.\nFrom around\n1906\nPearson put a large effort into setting up a postgraduate centre. He did this\n(\nsee\n[\n17\n]\n)\n:-\n... to make statistics a branch of applied mathematics with a technique and nomenclature of its own, to train statisticians as men of science ... and in general to convert statistics in this country from being the playing field of dilettanti and controversialists into a serious branch of science, which no man could attempt to use effectively without adequate training, and more than he could attempt to use the differential calculus, being ignorant of mathematics.\nHe was the first\nGalton\nProfessor of Eugenics, holding the chair from\n1911\nto\n1933\n.\nGalton\nhad set up the Eugenics Record Office in\n1904\nand in\n1906\nhe put Pearson in charge. Pearson already ran the Biometric Laboratory and in\n1911\nthe two laboratories were combined into the Department of Applied Statistics in University College.\nGalton\nhad expressed the wish that Pearson should be offered the chair, so becoming head of the new Department. In so doing Pearson gave up his Goldsmid chair.\nPearson had a long, bitter, and very public dispute with\nFisher\n. At first they exchanged friendly letters after Pearson received a manuscript from\nFisher\nin September\n1914\nof a paper he was submitting for publication. Pearson's initial response was to say\n(\nsee\n[\n18\n]\n)\n:-\nI congratulate you very heartily on getting out the actual distribution form ... if the analysis is correct which seems highly probable, I should be delighted to publish the paper in Biometrika.\nAgain a week later\n[\n18\n]\n:-\nI have now read your paper fully and think it marks a distinct advance.\nPearson then offered to have his staff at the\nGalton\nLaboratories work on a tabulation of values for the frequency curves arising in\nFisher\n's paper to test the exact distribution produced by\nFisher\nagainst previously known approximations. By May\n1916\nthey were still corresponding in a friendly manner. However Pearson misunderstood the assumptions of\nFisher\n's maximum likelihood method, and criticised it unfairly in the May\n1917\nCooperative Study\npaper which he co-authored with his staff concerning tabulating the frequency curves.\nFisher\n, believing that Pearson's criticism was unwarranted, responded with a paper which criticised examples in the\nCooperative Study\nto the extent of ridiculing them.\nFisher\nhad looked again at his earlier correspondence with Pearson, noticed that many of his papers had been rejected, and concluded that Pearson had been responsible.\nAlthough both were strong advocates of statistical methods their approach was rather different. Pearson used large samples which he measured and the tried to deduce correlations in the data.\nFisher\n, on the other hand, followed\nGosset\nin trying to use small samples and, rather than deduce correlations, to find causes. The dispute became bad enough to have\nFisher\nturn down the post of Chief Statistician at the\nGalton\nLaboratory in\n1919\nsince it would have meant working under Pearson. The dispute continued to grow in intensity with each taking every opportunity to attack the other's views.\nMaria, Pearson's wife, died in\n1928\nand he remarried Margaret Victoria Child, a co-worker in his department, in the following year. Pearson resigned from the\nGalton\nChair in the summer of\n1933\nand University College decided to split his Department into two. His son\nEgon Pearson\nbecame head of the Department of Statistics, while\nFisher\nwas appointed to the\nGalton\nChair to succeed Pearson as head of the Department of Eugenics.\nGreenwood writes of Pearson's character in\n[\n9\n]\n:-\nPearson was among the most influential university teachers of his time; he took great pains to be intelligible and could hold a large audience either of students or merely casual hearers who were without special interest in his topics. In the smaller circle of his research pupils he inspired enthusiastic personal affection; no head of a department repaid loyal service more generously. ... He had some of the defects of his qualities; he was dominating, ... he had an intense and genuine belief in freedom of thought but was apt to attribute intellectual differences of opinion to stupidity or even moral obliquity. Personal relations between him and his pupils were sometimes painfully interrupted for years; but it is pleasant to record that eventually most of these broken friendships were happily resumed. Only intellectual differences disturbed harmony; in the ordinary social relations of life he was a charming host, guest, or travelling companion. Pearson's influence upon those who only knew him through his writings was also great. He was admired and feared, rather than loved, by many; in some he aroused bitter hostility.\nWalker sums up Pearson's importance in\n[\n26\n]\nas follows:-\nAlthough Pearson made contributions to statistical technique that now appear to be of enduring importance, these techniques are of less importance than what he did in arousing the scientific world from a state of sheer interest in statistical studies to one of eager effort by a large number of well-trained persons, who developed new theory, gathered and analysed statistical data from every field, computed new tables, and re-examined the foundations of statistical philosophy. This is an achievement of fantastic proportions. His laboratory was a world centre in which men from all countries studied. Few men in all the history of science have stimulated as many other people to cultivate and to enlarge the fields they themselves had planted. he provided scientists with the concept of a general methodology underlying all science, one of the great contributions to modern thought.\nWe have mentioned above some of the honours which Pearson received. Let us also note that he received an honorary degree from the University of St Andrews and from the University of London. He was also elected a fellow of the\nRoyal Society of Edinburgh\n."
}