{
  "nome_completo": "Karl Schwarzschild",
  "nome_curto": "Karl Schwarzschild",
  "ano_nascimento": "1873",
  "ano_morte": "1916",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwarzschild/",
  "lugar_nascimento": "Frankfurt am Main, Germany",
  "lugar_morte": "Potsdam, Germany",
  "biografia": "Karl Schwarzschild\n's parents were Henrietta Sabel and Moses Martin Schwarzschild. The family was Jewish, with Karl's father being a well-off member of the business community in Frankfurt. Dieke writes in\n[\n1\n]\n:-\nFrom his mother, a vivacious, warm person, Schwarzschild undoubtedly inherited his happy, outgoing personality; from his father, a capacity for sustained hard work.\nKarl was the oldest of his parents six children, having four younger brothers and one sister. He was part of a larger extended family of relatives, too, who were cultured people with interests mainly in art and music. He did not, however, get his love of science from his immediate or extended family since he became the first member of his family to become a scientist.\nHe attended a Jewish primary school in Frankfurt up to the age of eleven, then he entered the\nGymnasium\nthere. It was at this stage that he became interested in astronomy and saved his pocket money to buy himself materials such as lens from which he could construct a telescope. Karl's father was friendly with Professor J Epstein, who was professor at the Philanthropin Academy and had his own private observatory. Their friendship arose through a common interest in music. Professor Epstein has a son, Paul\nEpstein\n, who was two years older than Karl and the two boys became good friends. They shared an interest in astronomy, and Karl learnt how to use a telescope and also learnt some advanced mathematics from his friend Paul\nEpstein\n.\nIt was in large part what he learnt through his friendship with\nEpstein\nwhich led to Schwarzschild mastering celestial mechanics by the age of sixteen. Such was this mastery that he wrote his first two papers on the theory of orbits of double stars at this age while still at the Frankfurt Gymnasium. The papers were published in\nAstronomische Nachrichten\nin\n1890\n.\nSchwarzschild studied at the University of Strasbourg during the two years\n1891\n-\n93\nwhere he learnt a great deal of practical astronomy, then at the University of Munich where he obtained his doctorate. His dissertation, on an application of\nPoincaré\n's theory of stable configurations of rotating bodies to tidal deformation of moons and to\nLaplace\n's origin of the\nsolar system\n, was supervised by Hugo von Seeliger. Schwarzschild found great inspiration from Seeliger's teaching which influenced him throughout his life.\nAfter the award of his doctorate, Schwarzschild was appointed as an assistant at the Von Kuffner Observatory in Ottakring which is a suburb of Vienna. He took up his appointment in October\n1896\nand held it until June\n1899\n. While at the Observatory he worked on ways to determine the apparent brightness of stars using photographic plates\n[\n4\n]\n:-\n... a long and sustained investigation, which required much perfection of detail as well as brilliance of conception.\nHe left the Von Kuffner Observatory in June\n1899\nand became a\nPrivatdozent\nat the University of Munich, having submitted his work on measuring stellar magnitudes as his\nhabilitation\nthesis\nBeiträge zur photographischen Photometrie der Gestirne\nⓉ\n(\nContributions to the photographic photometry of stars\n)\n. This work led him to make several important discoveries. First he saw that the photographic magnitudes which he measured differed from the visual magnitudes which had been tabulated. He realised that the difference was due to different colours of the stars. Choosing\n367\nstars to measure from the Von Kuffner Observatory, he included two variable stars. The range of magnitude change as measured by his photographic methods was much greater than the range of change in visual magnitude. He realised, correctly, that this was due to changes in surface temperature of the variable star through its cycle.\nAt a meeting of the German Astronomical Society in Heidelberg in\n1900\nSchwarzschild discussed the possibility that space was\nnon-Euclidean\n. In the same year he published a paper giving a lower limit for the radius of curvature of space as\n2500\nlight years. He also worked on radiation pressure from the sun and, with the assumption that the tails of comets consisted of spherical particles which reflected light well, he calculated the size of the particles in the tails. He knew that radiation pressure had to overcome gravitation, and he also knew that the particles did not scatter light. This allowed him to deduce that the diameters of the particles had to be between\n0\n.\n07\nand\n1\n.\n5\nmicrons.\nFrom\n1901\nuntil\n1909\nhe was extraordinary professor at Göttingen and also director of the Observatory there. In Göttingen he collaborated with\nKlein\n,\nHilbert\nand\nMinkowski\n. In less than a year he had been promoted to Ordinary Professor.\nEddington\nwrites in\n[\n4\n]\n:-\nTo a man of his wide interests in all branches of mathematics and physics the surroundings must have been very congenial ...\nSchwarzschild published on electrodynamics and geometrical optics during his time at Göttingen. He carried out a large survey of stellar magnitudes while at the Göttingen Observatory, publishing\nAktinometrie\nⓉ\n(\nActinometry\n)\n(\nthe first part in\n1910\n, the second in\n1912)\n. In\n1906\nhe studied the transport of energy through a star by radiation and published an important paper on radiative equilibrium of the atmosphere of the sun. He married Else Posenbach, the daughter of a professor of surgery at Göttingen, on\n22\nOctober\n1909\n. They had three children, Agathe, Martin who was born on\n31\nMay\n1912\nand went on to became a professor of astronomy at Princeton, and Alfred.\nAfter his marriage, near the end of\n1909\n, Schwarzschild left Göttingen to take up an appointment as director of the Astrophysical Observatory in Potsdam. This was the most prestigious post available for an astronomer in Germany and he filled the position with great success. He had the opportunity to study photographs of the return of\nHalley\n's comet in\n1910\ntaken by a Potsdam expedition to Tenerife. He also made major contributions to spectroscopy which became a topic of great interest to him around this time.\nIn\n1913\nSchwarzschild was elected to the\nBerlin Academy\n. In his admission speech he gave a good indication of his attitude towards science\n(\nsee for example\n[\n4\n]\n)\n:-\nMathematics, physics, chemistry, astronomy, march in one front. Whichever lags behind is drawn after. Whichever hastens ahead helps on the others. The closest solidarity between astronomy and the whole circle of exact science. ... from this aspect I may count it well that my interest has never been limited to the things beyond the moon, but has followed the threads which spin themselves from there to our sublunar knowledge; I have often been untrue to the heavens. That is an impulse to the universal which was strengthened unwittingly by my teacher Seeliger, and afterwards was further nourished by Felix\nKlein\nand the whole scientific circle at Göttingen. There the motto runs that mathematics, physics, and astronomy constitute one knowledge, which, like the Greek culture, is only comprehended as a perfect whole.\nOn the outbreak of war in August\n1914\nSchwarzschild volunteered for military service. He served in Belgium where he was put in charge of a weather station, France where he was assigned to an artillery unit and given the task of calculating missile trajectories, and then Russia.\nWhile in Russia he wrote two papers on\nEinstein\n's relativity theory and one on\nPlanck\n's\nquantum theory\n. The quantum theory paper explained that the Stark effect, namely the splitting of the spectral lines of hydrogen by an electric field\n(\nthe amount being proportional to the field strength\n)\n, could be proved from the postulates of quantum theory. This was proved independently by a P Epstein from Munich at almost the same time.\nSchwarzschild's relativity papers give the first exact solution of\nEinstein\n's general gravitational equations, giving an understanding of the geometry of space near a point mass. He sent the first paper to\nEinstein\nwho replied:-\nI had not expected that one could formulate the exact solution of the problem in such a simple way.\nThe work presented in these two papers formed the basis for a later study of black holes, showing that bodies of sufficiently large mass would have an escape velocity exceeding the speed of light and so could not be seen. However, Schwarzschild himself makes clear that he believes that the theoretical solution is physically meaningless, so making it very clear that he did not believe in the physical reality of black holes.\nHe contracted an illness while in Russia called pemphigus, which is a rare autimmune blistering disease of the skin. For people with this disease the immune system mistakes the cells in the skin as foreign and attacks them causing painful blisters. In Schwarzschild's time there was no known treatment and, after being invalided home in March\n1916\n, he died two months later.\nEddington\nwrites in\n[\n4\n]\n:-\nThe wide range of his contributions to knowledge suggests a comparison with\nPoincaré\n; but Schwarzschild's bent was more practical, and he delighted as much in the design of instrumental methods as in the triumphs of analysis. ... his joy was to range unrestricted over the pastures of knowledge, and, like a guerrilla leader, his attacks fell where they were least expected.\nSince Schwarzschild died at age\n42\nat the height of his achievements, it is not too surprising that he received relatively few honours in his lifetime. He was, however, elected to the Scientific Society of Göttingen in\n1905\n, the\nRoyal Astronomical Society of London\non\n11\nJune\n1909\n, and the\nGerman Academy of Sciences\nin\n1913\n. He did receive posthumous honours too, in particular an observatory, founded in\n1960\nin Tautenburg as an affiliated Institute of the\nGerman Academy of Sciences\n, was named after him. The dedication described him as:-\n... the greatest German astronomer of the last hundred years.\nAfter the reunification of Germany, the Institute was refounded in\n1992\nand renamed \"Thüringer Landessternwarte 'Karl Schwarzschild' Tautenburg\". The German Astronomical Society established a special lectureship in his honour in\n1959\nand a Karl Schwarzschild Medal. The first recipient was Martin Schwarzschild, his son."
}