{
  "nome_completo": "Karl Friedrich Wilhelm Rohn",
  "nome_curto": "Karl Rohn",
  "ano_nascimento": "1855",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rohn/",
  "lugar_nascimento": "Schwanheim (near Bensheim), Hesse, Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Karl Rohn\nattended the Polytechnikum at Darmstadt beginning his studies there in\n1872\n. He had begun by taking engineering courses, with the intention of qualifying as an engineer, but the mathematics he studied as part of his engineering degree became by far the most interesting to him. He studied mathematics and engineering at the University of Leipzig, then mathematics at the University of Munich. He was strongly influenced by\nAlexander von Brill\nwho taught him mathematics in Munich but the main influence on him at this stage was\nFelix Klein\nwho acted as his thesis advisor. Rohn was awarded a doctorate in\n1878\nfor his dissertation,\nBetrachtungen über die Kummersche Fläche und ihren Zusammenhang mit den hyperelliptischen Funktionen p =\n2\nⓉ\n(\nReflections on the Kummer surface and its connection with the hyperelliptic functions p =\n2\n)\n. In this excellent piece of work he studied the relationship of\nKummer\n's surface to\nhyperelliptic functions\n. He submitted his\nHabilitation\nthesis, again strongly influenced by suggestions made by\nKlein\n, to the University of Leipzig in the following year. From\n1879\nhe was a\nPrivatdozent\nat Leipzig.\nIn\n1884\nRohn was promoted to extraordinary professor at Leipzig, then in\n1887\nhe became a full professor at Technische Hochschule in Dresden where he held the chair of descriptive geometry.\nFelix Klein\nlectured during his visit to the United States in Evanston between\n28\nAugust and\n9\nSeptember\n1893\n. During these lectures he spoke about various models of the\nKummer\nsurface. He said that Rohn's work on this topic was the most significant. One of Rohn's models for the\nKummer\nsurface uses the generating lines on a hyperboloid of one sheet. He then took four lines from each of the two sets of generators, shaded the alternate regions, and then glued a copy of the shaded regions to the original along the boundary. In this way he produced a closed surface without boundary having sixteen real nodal points. He published this construction in\n1881\nand gave more details in an\n1887\npaper. Burau writes\n[\n1\n]\n:-\nIn these early writings he demonstrated his ability to work out connections between geometric and algebraic- analytic relations. In the following years, Rohn further developed these capacities and became an acknowledged master in all questions concerning the\nalgebraic geometry\nof the real\nP\n2\nP_{2}\nP\n2\n​\nand\nP\n3\nP_{3}\nP\n3\n​\n, where it is possible to overlook the different figures. This concerns forms of algebraic curves and surfaces up to degree four, linear and quadratic congruences, and complexes of lines in\nP\n3\nP_{3}\nP\n3\n​\n. Gifted with a strong spatial intuition, Rohn possessed outstanding ability to select geometric facts from algebraic relations.\nHis love of geometry is also illustrated by his beautiful thread models which were especially produced to excite the curiosity of the uninitiated. Rohn constructed models of surfaces and space curves that he was studying, particularly in the early part of his career. In\n1884\nthe Jablonowski Society proposed as prize problem asking for essays on the general surface of order\n4\n, extending the work of\nSchläfli\n,\nKlein\nand\nZeuthen\non cubic surfaces; they awarded the prize to Rohn for his essay in\n1886\n. He made important contributions to the theory of quartic surfaces, in particular of ruled quartics and quartics with a triple point. He also showed that the maximum number of separated ovals possible for a quartic surface is ten. He published\nDie Flächen vierter Ordnung hinsichtlich ihrer Knotenpunkte und ihrer Gestaltung: Gekrönte Preisschrift\nⓉ\n(\nThe surfaces of the fourth order with respect to their hubs and their design: Winning Prize Essay\n)\n(1886)\n. Rohn was made rector of the Technical University of Dresden during\n1900\n-\n01\n. As rector he gave a speech on\n23\nApril\n1900\nto celebrate the birthday of His Majesty the King. His speech was entitled\nDie Entwickelung der Raumanschauung im Unterricht\nⓉ\n(\nThe evolution of the perception of space in the classroom\n)\nand it was published by the Technical University of Dresden in\n1900\n. In Dresden, Rohn gave the course 'Darstellende Geometrie' in the summer of\n1904\n. It was the last session that he lectured at Dresden for in the following year he was appointed to the University of Leipzig. From\n1\nApril\n1905\nuntil his death, Rohn held the chair of mathematics at the University of Leipzig.\nLet us look briefly at some of the mathematical highlights of Rohn's career, some of which have already been mentioned. In his\n16\nth\nproblem\nHilbert\nasked about non-singular algebraic curves and surfaces. Rohn published three papers contributing to this problem. We mentioned above his outstanding investigations of fourth degree surfaces having one triple point or having finitely many isolated singular points. In the later part of his career he was involved in deep investigations of\nKummer\nsurfaces which possess the greatest number of singular points, namely ten. He also solved the difficult problem of finding the possible positions of the maximum number of ovals, namely eleven, that the real branch of a sixth degree curve can possess.\nDavid Hilbert\nwas particularly interested in these results.\nThe\nAmerican Mathematical Monthly\npublished this notice of his death which mentions his famous book\nLehrbuch der darstellenden Geometrie\nⓉ\n(\nTextbook of descriptive geometry\n)\n:-\nDr K F W Rohn, professor of mathematics at the University of Leipzig since\n1905\n, died on\n4\nAugust\n1920\n, aged sixty-five years. He is, perhaps, best known to mathematicians through his three volume work\n(\nin its third edition,\n1906)\nentitled\nⓉ\n(\nTextbook of descriptive geometry\n)\n(1893\n-\n1896\n; fourth edition,\n1913\n-\n16)\n, which he prepared, after the appearance of the first volume, in collaboration with Dr E Papperitz.\nAfter Rohn's death, the book\nStereometrie: Ein Handbuch für Studierende und Lehrer\nⓉ\n(\nStereometry: A Handbook for Students and Teachers\n)\n(1922)\nwas published.\nDavid Smith\nwrites in a review:-\nThis work was substantially ready for publication at the time of Professor Rohn's death, in August\n1922\n, the necessary completion of the manuscript in minor details having been done by his friend and former pupil Dr Friedrich Wünschmann. Dr Rohn was himself a pupil of Professor\nKlein\n, and the latter, in his appreciative introduction, speaks highly of his skill in the field of geometry. The work sets forth in succinct form the essential features of modern projective geometry with respect to solids, thus extending the ordinary treatment of the projective properties of figures in a plane to those of three dimensions. It begins with a review of plane geometry\n(50\npages\n)\nand then considers the sphere, cylinder, and cone, proceeding later to the properties of conic sections and other plane figures in space. The work shows a return to the better type of German bookmaking of pre-war days and will be welcomed by students of modern geometry as an aid to their advanced work in this field."
}