{
  "nome_completo": "Kathleen Timpson Ollerenshaw",
  "nome_curto": "Kathleen Ollerenshaw",
  "ano_nascimento": "1912",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ollerenshaw/",
  "lugar_nascimento": "Manchester, England",
  "lugar_morte": "Didsbury, Manchester,England",
  "biografia": "Kathleen Ollerenshaw\n's name before marriage was Kathleen Timpson. Her father, Charles Timpson, was the son of William Timpson, founder of Timpson shoes, and her mother, Mary Elizabeth Stops, was the daughter of Thomas Spincks Stops, a farmer. Her parents were both from large families and her mother, having seen financial hardships, wanted better for her own family. Kathleen had one sister, Betty\n(4\nyears her senior\n)\n, to whom she was very close. Kathleen inherited otosclerosis from her father's side of the family and was always partially deaf. At the age of eight, an illness brought on sensorineural deafness and left her almost completely deaf.\nIn September\n1918\n, Kathleen entered Lady Barn House Montessori School in Withington where, at the age of five, she met her future husband Robert Ollerenshaw. Kathleen was good at mathematics, and had always found pleasure in patterns and numbers. When she became almost completely deaf at the age of eight, the school arranged for her to learn lip-reading. It was thought this was better than sign-language, because with sign-language, you can only communicate with other people who can also sign. Kathleen considers her deafness to be one of the reasons that she took to mathematics so keenly; it was one of the few subjects in which she was not disadvantaged due to her deafness. At the age of nine, a new headmistress who had studied mathematics at Cambridge increased her passion for numbers, insisting on\n[\n1\n]\n:-\n... exactitude, formal proofs, and total accuracy at all times -- with checks. She emphasised the need for 'proof' and the difference between conjecture and logical mathematical proof.\nMathematics was not Kathleen's only passion whilst at school. She enjoyed playing cricket and lacrosse, and was a regular winner of the\n100\nm on sports days. With sport, as with mathematics, her deafness did not put her at a disadvantage.\nWhen Kathleen was thirteen years old she entered St Leonard's, a prestigious girl's boarding school in St Andrews, Scotland. Her education from Lady Barn House meant that she was ahead of all the other girls in mathematics, so she focused on other subjects. Robert and Kathleen continued to exchange letters during this time, and when he started in the sixth form, Robert sent her his slide rule\n[\n1\n]\n:-\nHe felt he wouldn't be needing mathematics and I would make better use of it. This slide-rule was of a superior design: large, with a powerful cursor. He had made a leather case for it and I counted this as the mark of true love.\nWhen told that she could not study mathematics in the sixth form because she had not attended applied mathematics classes, she threatened to leave the school. Her teachers thought there was no future in her studying mathematics since the only role for women mathematicians was in teaching, which was ruled out by her deafness. As a compromise she was told that she could continue mathematics for the first half of the term. After receiving outstanding grades in both pure and applied mathematics, she was given a copy of\nTurnbull\n's\nThe Great Mathematicians\n. The book increased her enthusiasm for mathematics and for mathematicians such as\nEuler\n.\nWhile at St Leonard's, her passion for sport continued. She gained school colours in hockey and lacrosse, and half-colours in cricket. Kathleen developed a technique that proved useful throughout her lifetime. She called this technique 'subliminal learning'\n[\n1\n]\n:-\nBefore falling asleep, I 'drew' with my finger any relevant geometrical figure or algebraic equation on the partitioning of the dormitory cubicle that formed a bedside wall. The result would be miraculous. Without fail, on waking in the morning, the details, the logical argument required or the facts that I needed to recall were clearly imprinted in my mind and, because of clarity, any required solution would often be clearly 'written' on the partition.\nIn July\n1930\n, at the age of\n17\n, after taking her Higher School Certificate, Kathleen left St Leonard's and applied to Oxford and Cambridge to study mathematics. Her first choice would have been Cambridge because of its mathematical reputation, but Robert had just started studying medicine at Oxford. In August, Kathleen went as a representative of St Leonard's school to a conference on disarmament held for sixth formers at the League of Nations Headquarters in Geneva. She wrote a report on the conference for the school newspaper. Kathleen returned home and took up ice-skating, gaining many medals in both figure skating and ice dancing. However, she realised that to pass the Oxford and Cambridge entrance examinations would require further practice, so she sought advice from the mathematics department at Manchester University. They introduced her to J M Child, who discussed with her his research and the book that he was writing,\nThe Higher Algebra\n. When she finally sat the entrance exams, Kathleen found the algebra-geometry paper set by Oxford to be very easy\n[\n1\n]\n:-\nWith the recent experiences with J M Child, I found one question not only easy, but ridiculously so.\nWhen it came to the Cambridge interview, however, Kathleen scraped through without anyone knowing she was deaf, but struggled to lip-read the questions. As she left the room she mentioned her deafness. Despite the interviewers feeling it too great a disadvantage, she was reluctantly offered an exhibition at Newnham College. The Oxford interview went much better for when asked about her summer holiday she gave a detailed account of the conference in Geneva. She completed the interview without mentioning she was deaf, and did not make the mistake of letting them know afterwards. She was awarded an open scholarship to\nSomerville\nCollege, Oxford and only when she began her course did she explain she was deaf.\nSomerville\nCollege had no mathematics tutor so she was assigned an English Literature tutor instead. In her final year, however,\nFerrar\nbecame her tutor.\nIn her first term at Oxford, Robert and Kathleen got engaged. She attended lectures, but spent most of her time socialising and playing sport, gaining her 'Blue' in hockey and going on to become captain of the hockey team. She also attended a public lecture given by\nAlbert Einstein\n. Although she could not lip-read German she still greatly enjoyed the excitement that surrounded the experience. Despite devoting little time to study, she gained a first class degree and graduated in the summer of\n1933\n[\n1\n]\n:-\nLooking back, I threw away the academic opportunities that were available, unaware of the guidance I needed.\nAfter graduating form Oxford, Kathleen learned touch typing and covered her sister's secretarial job while she had her first child. She continued to skate and play hockey, this time for Lancashire County, the North of England, and the Reserve England elevens. She also learned to play women's ice-hockey, and played on a team that represented England. She spent the summers\n1933\n-\n1939\nwith Robert and his family in a villa by a lake near Salzburg, Austria. They attended the Salzburg Festival and spent time sailing on the lake, climbing and skiing.\nAt the beginning of\n1936\nKathleen went out to Germany to learn to ski. She enrolled to study geography at Innsbruck University for a semester so that she would be eligible for a student discount for the mountain railways. Once she had her concessionary pass, she never went back to the university. When the weather became warmer, and the snow melted, she took to mountain climbing with friends\n[\n1\n]\n:-\nThere is a strong parallel between mountain climbing and mathematics research. When first attempts on a summit are made, the struggle is to find any route. Once on the top, other possible routes up may be discerned and sometimes a safer or shorter route can be chosen for the descent or for subsequent ascents. In mathematics the challenge is finding a proof in the first place. Once found, almost any competent mathematician can usually find an alternative often much better and shorter proof. At least in mountaineering we know that the mountain is there and that, if we can find a way up and reach the summit, we shall triumph. In mathematics we do not always know that there is a result, or if the proposition is only a figment of the imagination, let alone whether a proof can be found.\nIn September\n1936\n, Kathleen started research on cotton for the Shirley Institute on a temporary basis. She taught herself all the statistical techniques that she needed to test the efficiencies of the different methods and ingredients used in weaving. By applying advanced algebra, she managed to discover methods to complete a task in six hours that usually took six days. After this, she was offered a permanent position designing a cotton canvas that would be impervious to water for making tents for the army\n[\n1\n]\n:-\nIt was moreover a matter of geometry -- pure mathematics -- a nice problem that had a neat and successful solution. The requirement was that rain falling on a tent or coat should run directly downward and not soak through the woven fabric. It fell to me to devise a weaving pattern so that this could be achieved with cotton.\nKathleen and Robert married on\n6\nSeptember\n1939\nbefore he was called up for war duty. She continued to work at the Shirley Institute until her son Charles was born in\n1941\n. Being unable to hear air-raid warnings, it would have been unsafe for her to live alone, so she moved in with her parents. After Charles was born she had to give up work, but she renewed contacts with J M Child at Manchester University who introduced her to\nKurt Mahler\n. He suggested an unsolved problem relating to critical lattices, which she solved within a couple of days.\nMahler\nsuggested that if she expanded this work, it would be a good basis for a PhD, so she returned to\nSomerville\nCollege as a tutor. Her DPhil supervisor was Theo Chaundy and, after publishing five original papers in two years, she gained her DPhil in\n1945\nwithout having to write a thesis\n[\n1\n]\n:-\nCritical lattices relate to whole numbers in two or more dimensions and lead, by geometrical methods, to solutions concerned with 'close packing', for example, how best to stack tins in a cupboard or oranges in a box.\nAfter the war ended she set up home with Robert who had returned from war service. She was now a mother, housewife, and carer of Robert's father who died in\n1948\n. She also continued to work on critical lattices and took up a part-time lecturing position at Manchester University. In\n1946\n, her second child, Florence, was born. In\n1949\n, Ollerenshaw was given one of the first hearing aids, which completely revolutionised her life. Although a crude device, uncomfortable to wear, it meant that she could now hear things that previously she could not.\nIn\n1951\n, Ollerenshaw began her life of public service when she became a member of the governing body of St Leonard's school; she was president\n1981\n-\n2003\n. She subsequently became the school's representative on the Association of Governing Bodies of Girls' Public Schools. In\n1952\n, she became a member of the National Council of Women, and produced her first report on the state of school buildings in Manchester. She started work on improving conditions in schools, publishing an article,\nOld School Buildings\n, which outlined the appalling conditions of school buildings. In\n1954\n, Robert and Kathleen bought a house in the Lake District which became their weekend retreat, and the main place that Kathleen did her mathematics. Later that year, Ollerenshaw became a co-opted member of Manchester Education Committee. From\n1956\nuntil\n1981\nshe was elected as a Conservative Member of Manchester City Council, becoming a member of the council's finance committee.\nIn\n1960\n, Kathleen joined the Central Advisory Council for Education. An improved hearing aid allowed her to appreciate music and she became involved in the creation of what has now become the Royal Northern College of Music; she was chairman of the governing body for\n18\nyears,\n1968\n-\n1986\n. She was elected chairman of the Manchester education committee in\n1967\n. Ollerenshaw was elected to the British Association for Commercial and Industrial Education governing council in May\n1963\n. This took her to the USSR to learn about their post-school educational opportunities. She went to the USA in\n1965\nwith the Winifred Cullis Fellowship - a three month exchange programme between USA and UK\n[\n1\n]\n:-\nThe links in the USA were with the Association of American University Women\n(\nAAUW\n)\nand with Rotary. I had to prepare four standard speaking scripts to be used during the tour as material for my hosts to select from and for press, radio, television and other publicity.\nOllerenshaw was interested in the educational system in the USA and arranged that in her free time she could visit various schools and leading educators. It was here she learned of the Stanford research project that was being established to measure the standards of mathematics teaching in countries across the world, precisely Kathleen's area of interest. In\n1969\nthe results of the research at Stanford was published, revealing children in Japan to be far ahead of those in all other participating countries\n(\nRussia and India refused to participate\n)\n. With sponsorship from the British Council, Ollerenshaw went out to Japan to see for herself the reasons for the success of the Japanese educational system. She found that the class sizes were much larger than in the UK, but that there was a high standard of discipline, and an attitude of expectation of success\n[\n1\n]\n:-\nIt confirmed my experience that the attitude toward mathematics, of parents, teachers and the general populace, is of critical importance, and that\n(\ngiven good class discipline\n)\nthe mathematical competence and enthusiasm of the teachers matters more than the size of classes.\nIn\n1970\n, Kathleen was appointed Dame Commander of the British Empire for services to education. Sadly, shortly after receiving notification, her daughter Florence was diagnosed with cancer; she died at home at the end of October\n1972\n. In June\n1972\n, Dame Kathleen started a part time senior research fellowship at Lancaster University in the Department of Educational Research, and in the following year she became the first chairman of the new Greater Manchester County St John Ambulance Brigade. Having worked along side Alan\nTuring\nat Manchester University, she was aware of the developments in computer science, and was the first person to introduce computers to the organisation.\nDame Kathleen was elected Lord Mayor of Manchester in May\n1975\n. When her year as Lord Mayor was over, she took a holiday with Robert in Malta, where she wrote a children's book\nThe Lord Mayor's Party\n. She was invited to become a Founder Fellow of the Institute of Mathematics and its Applications\n(\nIMA\n)\nin\n1964\n. In\n1970\n, she became a member of the IMA's governing council and was president from\n1978\n-\n1979\n. It was through the IMA, that Dame Kathleen first met\nHermann Bondi\n, with whom she later started her work on magic squares. In her presidential address,\nThe Magic of Mathematics\n, Dame Kathleen discusses the beauty of mathematics, and her experiments with soap film bubbles. Her work on soap film bubbles also formed the basis of many of her lectures\n[\n1\n]\n:-\nA cluster of bubbles blown with a bubble-pipe gives a spectacular illustration of the 'closest packing' of pliable solid objects. The bubbles in the centre of a cluster\n(\nor 'froth'\n)\ntake up shapes that fill the space available without extraneous air gaps and give minimum surface area for the volume of air which they contain.\nThe IMA publish a quarterly journal,\nMathematics Today\n, formerly named the\nBulletin of the Institute of Mathematics and its Applications\n. This became a good outlet for her papers which included the first general solution Rübik's cube, a solution to the twelve penny problem, and a solution to the nine prisoners problem. She also published on critical lattices and\nmagic squares\n[\n1\n]\n:-\nEvery true mathematician sees mathematics everywhere -- in a child's swing or a pendulum, in the outline shape of a tree and that of its leaves, in the clouds, in the way a circular tube is made from straight strips of paper.\nAs a result of her work on the Rübik cube, Dame Kathleen injured her thumb. She damaged the ball of her left thumb seriously enough that it required an operation. The American Reader's Digest recorded this as the first known case of 'mathematician's thumb'.\nIn\n1982\n, Dame Kathleen Ollerenshaw and\nHermann Bondi\npublished a paper,\nMagic squares of order four\n, in which they prove the conjecture of\nFrénicle de Bessy\nshowing that there are\n880\nessentially different normal magic squares of order\n4\n. This was the first analytical proof of this result to be published. About a year later,\nBondi\nreceived a letter asking how to construct pandiagonal magic squares of order\n16\n. The letter writer used pandiagonal magic squares of order\n8\nin a process called 'dither printing', and thought that squares of order\n16\nwould give him better results. This led Dame Kathleen to consider magic squares of higher orders. Magic squares can be broken down into many smaller subsets, one of which is most-perfect pandiagonal magic squares. She studied them on and off in her spare time for eight years, and eventually produced the first method for constructing and enumerating these squares\n[\n1\n]\n:-\nThis was the first time in all the thousands of years during which magic squares have fascinated mathematicians and laymen alike, that a method of construction had been found for a whole class.\nOn Wednesday\n12\nJuly\n2006\n, Manchester City Council made a presentation to Ollerenshaw to mark the\n50\nth\nanniversary of her election in May\n1956\n, as a Conservative councillor for Rusholme ward:-\nDame Kathleen represented Rusholme ward as a councillor and alderman, then on reorganisation as an elected councillor again. She was Lord Mayor from\n1975\nuntil\n1976\n. In\n1984\nshe was granted freedom of the city, the highest honour a city can bestow."
}