{
  "nome_completo": "Kenjiro Shoda",
  "nome_curto": "Kenjiro Shoda",
  "ano_nascimento": "1902",
  "ano_morte": "1977",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shoda/",
  "lugar_nascimento": "Tatebayashi, Gunma Prefecture, Japan",
  "lugar_morte": "Ashikaga, Japan",
  "biografia": "Kenjiro Shoda\nwas born in Tatebayashi in the Gunma Prefecture of Japan but he underwent schooling in Tokyo until he completed middle school. There were academies in Japan for the brightest pupils with the task of preparing them for a university education. Shoda, after showing great talents at middle school, attended the Eighth National Senior High School in Nagoya.\nAfter graduating from the Eighth High School, Shoda entered Tokyo Imperial University\n(\nthe title 'Imperial' would soon be dropped from the name of all Japanese universities\n)\nand there he was taught by\nTakagi\n. This was an exciting period to study at Tokyo University for\nTakagi\nhad published his famous paper on class field theory in\n1920\n.\nTakagi\nlectured on group theory, representation theory, Galois theory, and\nalgebraic number theory\n. When Shoda was in his final undergraduate year, his studies were supervised by\nTakagi\nand he inspired Shoda to work on algebra. Shoda graduated from the Department of Mathematics at Tokyo University in\n1925\nand began his graduate studies under\nTakagi\n's supervision.\nDuring his first year of graduate studies he read works on the theory of group representations by\nFrobenius\nand\nSchur\n. Then in\n1926\n, his second year of study, he was awarded a scholarship to allow him to study in Germany and he set off for Berlin to work with\nSchur\n. While in Berlin he attended\nSchur\n's lectures and had his first mathematical success in research discovering an interesting result on matrices. After a year in Berlin, Shoda went to Göttingen where he joined\nEmmy Noether\n's school, attending her lectures on hypercomplex systems and\nrepresentation theory\n. Nagao writes\n[\n1\n]\n:-\nThis particular year seems to mark the most significant period in his mathematical growth. There, near\nNoether\n, he witnessed the remarkable process of creation of great mathematical ideas and theory, and youthful Shoda buried himself in enthusiastic pursuit of mathematics in a wonderful creative atmosphere generated by the many young, able mathematicians who had come from all over the world to Göttingen, attracted by\nEmmy Noether\n.\nShoda returned to Japan in\n1929\nand almost immediately began to write his algebra book.\nAbstract algebra\n, an advanced-level textbook of modern algebra, was first published in\n1932\nand it proved a very significant work for Japanese mathematics. The twelfth printing of the book was published in Tokyo in\n1971\nwith the chapter headings: Basic concepts; Field theory;\nGalois theory\n; Elimination theory; General ideal theory; Valuation theory.\nThis fine work, published in\n1932\n, must have been a significant factor in Shoda being appointed as professor in the Faculty of Science at Osaka University in\n1933\n. He had also published twelve papers on groups and rings before he was appointed to this post.\nThe war years were particularly difficult ones in Japan and many Japanese mathematicians failed to keep their research going through these difficult times. Shoda, however, managed to continue to undertake research and in\n1946\nhe was elected the first Chairman of the\nMathematical Society of Japan\n. In this role he had the task of reconstructing Japanese mathematics and he did this in many ways, one of which was to lead by example with some fine and important publications.\nIn\n1947\nhe published his text\nGeneral Algebra\n. This text attempted to unify many existing algebraic systems. Here are some details from a review of the work by\nT Nakayama\n:-\nIn this book a systematic and consistent treatment of general algebraic systems is given ... In the first chapter the fundamental notions are introduced and discussed. An algebraic system is defined as a set possessing a family of compositions\n(\nwhere a composition may not have meaning for all pairs of elements\n)\n, a primitive algebraic system as one in which every composition is defined for every pair of elements and which admits certain identities with respect to compositions, while an elementary algebraic system is a weakening of the latter in which the identities are supposed to be valid as soon as both sides have meaning. ... Lattices, groups, groupoids, mixed groups\n(\nof\nLoewy\n)\nare considered. For instance, the notion of group is shown to be primitive by taking division as its composition.\nThe second chapter is on the theory of free systems, including the fundamental theorem and the theorem of change of generators\n(\nof\nTietze\n)\n. A theory of independence is given, making use of a certain notion of valuation so as to take care of algebraic and linear dependence, the latter being distinguished in that an element is\n(\nlinearly\n)\ndependent on a set of elements if and only if it is contained in the subsystem generated by the set. Free lattices, free groups, free\nLie\nand associative rings are treated, emphasizing the relationship among them.\nThe third chapter starts by proving the author's sufficient condition for a lattice of congruences to be modular ... Then the author ... develops generalized theories of normal chains, composition series, of direct and subdirect products, and generalizations of the\nJordan\n-\nHolder\nand the\nRemak\n-\nSchmidt\n-Ore theorems. After completely reducible systems, the notions of solvable and nilpotent systems are discussed, where general identities are considered instead of the usual commutativity. Further, a set of endomorphisms of an algebraic system is considered as an algebraic system in terms of the usual multiplication\n(\nof mappings\n)\nand the compositions induced from those of the original system. Here the multiplication is of course associative, and distributive for the latter compositions, presenting the notion of ring-systems as a generalization of the ring notion. Structural theory of abstract ring-systems is developed, under chain conditions, including\n(\ngeneralized\n)\nPeirce decompositions and\nWedderburn\n's theorem; for the latter the notion of matrices is also generalized.\nThe last chapter gives the theory of representing\n(\nprimitive\n)\nalgebraic systems as systems of endomorphisms of some other systems called representation systems. Reduction and direct decomposition are discussed in connection with representation systems. Particular observations are made to the cases of ring-systems, rings, and groups.\nIn\n1949\nShoda was awarded the\nJapan Academy of Science\nPrize in recognition of his fine achievements. In the same year he became Dean of the Faculty of Science at Osaka\n[\n1\n]\n:-\nIt was at this time, after the war, that Japan was going through a difficult period of transition from the old to the new educational system. Under his headship a foundation for the new Faculty of Science and the Graduate School Division for research of Science was firmly established.\nIn\n1955\nShoda was appointed as President of Osaka University, a post he held for six years. One of his achievements as President was the setting up of a Faculty of Engineering Science at Osaka and, in\n1961\nafter his term as President ended, he became Dean of the new Faculty.\nAfter he retired from Osaka University, Shoda continued to work for a better educational system in Japan taking on many roles where he was able to use his long experience to give advice to many education Committees.\nHis death from a heart attack was very unexpected, occurring while he was driving his family to Ashikaga to see the plum blossom.\nNagao pays this tribute to Shoda in\n[\n1\n]\n:-\nHe loved the scholarly life and he loved his fellow man. His discipline was strict, yet his heart was warm and big. His faith in any man whom he came to know never wavered or changed. I know that the memory of this man's warm and rich humanity will live in the heart of many for a long time to come."
}