{
  "nome_completo": "Jean Bernard Léon Foucault",
  "nome_curto": "Léon Foucault",
  "ano_nascimento": "1819",
  "ano_morte": "1868",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Foucault/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Léon Foucault\n's father, Jean Léon Fortuné Foucault, was a publisher who had gained a fair reputation by publishing an excellent collection of volumes on the history of France. When Léon was young his father retired, since his health was rather poor, and the family moved from Paris to Nantes. However retirement did not result in any improvement in his father's health and he died in Nantes in\n1829\nwhen Léon was nine years old. His mother decided that they would return to Paris and from the age of ten Léon lived with his mother in a rather fine house on the junction of rue de Vangirard and rue d'Assas. The house is still there today and is marked by a commemorative plaque.\nIt was not only Léon's father who suffered from poor health, for Léon himself was a very frail child. He had one eye which was short-sighted and the other long-sighted. It gave him a rather awkward appearance and this was made worse by the fact that Léon became self-conscious about his appearance, tending to prefer being by himself. He was certainly given good educational opportunities by his mother who sent him to the Collège Stanislas but he did not seem to make the most of them. His teachers described him as lazy, he did not submit work on time, so that his mother had to employ tutors to educate him at home.\nLissajous\n, who was about two and a half years younger than Foucault, was one of his few childhood friends. He wrote:-\nNothing about the boy announced that he would be illustrious some day; his health was delicate, his character mild, timid and not expansive. The frailty of his constitution and the slow way he worked made it impossible for him to study at college. He was only able to study successfully thanks to the help of dedicated tutors watched over by his mother.\nFoucault did, however, make a good friend of one of the students at the Collège Stanislas, namely Hippolyte Fizeau.\nIf academic school  work was not to Foucault's liking, he did begin to exhibit other talents. As a teenager he loved to construct toys and machines, some of which were really highly sophisticated such as a steam engine and a telegraph. His dexterity suggested to his mother than he would make a superb surgeon and so, having obtained his high school diploma, he entered medical school in Paris in\n1839\n. At first he progressed well and his professor, Alfred Donné, was very pleased with his progress. However, on his first spell of hospital experience he saw some blood and fainted. After trying to overcome this problem, he realised that he would never be able to carry out medical duties and withdrew. Donné, however, wanted him to continue using his talents in the cause of medical science in a way that did not involve him coming in contact with patients, so he employed him as his assistant.\nJust before starting work as Donné's assistant, Foucault had attended talks by Daguerre on his photographic methods. Foucault's friend Fizeau had been with him and the two experimented, improving the photographic process. Foucault combined his new photographic skills with his work for Donné and devised a method of taking photographs through a microscope. To do this he had to invent a powerful electric light source to illuminate the objects being photographed. In\n1845\nFoucault and Donné published\nA course of microscopy\nwhich contained\n80\nphotographs of objects under a microscope.\nDonné was the scientific editor of the\nJournal des Débats\nwhich was published daily. He retired from this position in\n1845\nhanding over the task to Foucault.\nBertrand\nin\n[\n2\n]\nwrites about this task which Foucault carried out with remarkable success:-\nAt the age of\n25\n, not having learnt anything at school nor from book, enthusiastic about science but not about study, Léon Foucault took on the task of making the work of scientists understandable to the public and of passing judgement on the value to the work of leading men of science. From the start he showed great subtlety, good judgement based on more prudence than would be expected. His first articles were remarkable; they were spiritual. He took his duties seriously. Launched, without any experience, into the highest level of science with all its confusion and problems, he was assured carrying out a role in which mediocrity would mean failure, with complete success.\n... Always polite, yet seeking the truth, Foucault applied carefully considered judgements. Previously an unknown, this young man with no scientific publications nor known scientific discoveries, displayed a quiet authority and frankness which irritated many leading scientists.\nArago\nhad learnt of Foucault's expertise with photography through a microscope on the publication of his book with Donné. He approached Foucault and Fizeau, whom he knew personally, in\n1845\nand asked if they could try to take photographs of the sun. They were successful in this and took the first ever photograph of the sun. It clearly shows a number of sunspots.\nArago\nwas delighted and saw the potential Foucault had to carry out other experiments for the\nAcademy of Sciences\n. He next suggested that Foucault and Fizeau try to measure the speed of light in water. This was an experiment which\nArago\nwanted to perform himself, but his failing eyesight meant that he could not undertake exacting experimental work himself. Shortly after beginning work using\nArago\n's methods, Foucault and Fizeau had an argument. As a result they went their own ways, each attempting to carry out the experiment on their own.\nFoucault now devised his own methods to approach the problem of measurement, building a steam engine to drive a spinning mirror. In April\n1850\nhe showed that light travels slower in water than in air. This was in accordance with what the wave theory of light predicted, but contradicted what the corpuscular theory predicted. Foucault wrote\n[\n2\n]\n:-\nI did not invent the spinning mirror, nor the achromatic lens, nor the network, nor the micrometer but I have had the good fortune to be able to put these instruments, devised by other scientists, together in such a way that I have solved a problem which was posed twelve years ago.\nFoucault's next idea was that if he was able to design the support for a pendulum which allowed it to freely move in any direction without any resistance, then once set in motion it would retain its plane of swing in space while the Earth rotated beneath it. In January\n1851\nhe succeeded in constructing such a pendulum in the basement of his house. It did indeed retain its position in space, demonstrating clearly for the first time that the Earth rotates. He told\nArago\nof his achievement and\nArago\nasked him to repeat it in the Paris Observatory. Every scientist in Paris received an invitation to view the pendulum in the Paris Observatory on\n3\nFebruary\n1851\n. The demonstration was a complete success. A paper by Foucault on his pendulum was read by\nArago\nto the\nAcademy of Sciences\non the same day as the experiment was carried out in the Observatory. In the paper Foucault presented, without proof, his sine law:\nT\n=\n24\n/\nsin\n⁡\nq\nT = 24/\\sin q\nT\n=\n2\n4\n/\nsin\nq\nwhere\nT\nT\nT\nis the time in hours taken for the pendulum to return to its original position and\nq\nq\nq\nis the latitude at which the experiment is carried out. So at the poles it takes\n24\nhours to return to its original position while at the equator it does not rotate at all.\nBinet\npresented a full report to the\nAcademy of Sciences\ngiving the full mathematical justification for the sine law on\n17\nFebruary.\nPlana\npresented a paper to the\nAcademy of Sciences of Turin\non Foucault's pendulum in March.\nBertrand\nwrites\n[\n2\n]\n:-\nWe say very clearly, for it is true, that the mathematicians had shown the direction; but we add, for it is just to do so, that they had not explored it.\nPoisson\nhad, deplorably quickly, decided its was not worth considering; and it was Foucault, without and help or assistance, who was the first to propose it.\nFoucault next invented the gyroscope, which he did to demonstrate in yet another way the motion of the Earth. Again the gyroscope remains fixed in space while the Earth moves. It was an invention which was of little significance in Foucault's time, but of course today we recognise its widespread use in airplanes, guiding of telescopes, the\nHubble\nspace telescope etc.\nPolitical events in France now worked to Foucault's advantage. He was famous, but had no job or income other than as science editor of the\nJournal des Débats\n. On\n2\nDecember\n1851\nthere was a coup d'état in France with Louis-Napoléon Bonaparte assuming absolute power and dissolving the National Assembly. Exactly one year later he became Emperor taking the title Napoleon III. If the scientific community in France was somewhat dismissive of Foucault, who had no proper scientific training, then the same could not be said for Napoleon III who was himself an amateur scientist. He greatly supported science in general and Foucault in particular so he arranged the post of Physicist Attached to the Imperial Observatory to be specially created for Foucault.\nThe director of the Imperial Observatory, as Napoleon III had renamed the Paris Observatory, was now\nLe Verrier\n. Soon Foucault was creating superb telescopes for the Observatory with many innovative features. He made many scientific discoveries and invented many other machines to assist the astronomers at the Observatory. An experiment he carried out to determine the speed of light was by far the most accurate which had been carried out up to that time and was correct to within half of one percent.\nFoucault accompanied\nLe Verrier\non an expedition to Spain in\n1860\nto observe the eclipse on\n18\nJuly. He took a photograph of the eclipse. Honours were now quickly given to him: Napoleon III made him an Officer Légion d'Honneur in\n1862\n; he was elected to the Bureau des Longitudes\n(1862)\n; he was elected a fellow of the\nRoyal Society of London\n; also a member of the\nGerman Academy of Scientists Leopoldina\n; and finally in\n1865\nthe\nFrench Academy of Sciences\nwhere he replaced\nClapeyron\n.\nBy October\n1867\nFoucault began to feel numbness in his hands. The illness progressed rapidly despite the efforts of Foucault's mother to help her son recover. It is likely that the illness was the result of the chemicals, in particular mercury, that Foucault had experimented with all his life. Of course, as we noted at the beginning of this biography, Foucault's father died young so perhaps hereditary factors also played a part."
}