{
  "nome_completo": "Lászlo Rátz",
  "nome_curto": "Lászlo Rátz",
  "ano_nascimento": "1863",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ratz/",
  "lugar_nascimento": "Sopron, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Lászlo Rátz\n's parents were Ågost Rátz\n(1827\n-\n1882)\n, who was an ironmonger, and Emma Töpler\n(1831\n-\n1900)\n. Ågost and Emma had six children: Emma Carolina Rátz\n(1852\n-\n1879)\n; Ågost Ede Rátz\n(1854\n-\n1892)\n; Ottó Rátz\n(1857\n-\n1914)\n; Károly Rátz\n(1859\n-\n1907)\n; Lászlo Rátz\n(\nthe subject of this biography\n)\n; and Lujza Rátz\n(1869\n-\n1945)\n. Lászlo Rátz was given the name Ladislaus Wilhelm Rátz when he was born, since Sopron belonged to a German speaking area, but he chose to use the Hungarian version of his name. Both Rátz's primary and secondary schooling was in Sopron. His secondary education was at the Royal Hungarian State School which today is called the Széchenyi István\nGymnasium\n. The director of the school at this time was Leo Salamin\n(1832\n-\n1902)\nwho, for five years, taught Rátz the French language. Rátz studied at this school until\n1880\nwhen he moved to the Sopron Lutheran Lyceum for the final two years of his secondary education.\nAt the Lyceum, in the first of his two years, he was taught history by Sámuel Fehér, Hungarian language by Imre Góbi, German and Latin by J P Király, logic by Sándor Malatides, German by Gusztáv Poszvék, religion by Sándor Poszvék, mathematics and physics by János Renner, and Greek by Károly Thiering. János Renner had a love and enthusiasm for mathematics and physics that he transmitted to his pupils. He was a strict teacher maintaining military discipline in his classes and the class had to sit in absolute silence waiting for him to arrive. However, he was very fair and respected by his pupils although they found him rather frightening. He gave all his students, and certainly he gave Rátz, an excellent grounding to begin university studies. In the second of his two years he was again taught by Imre Góbi, J P Király, Gusztáv Poszvék, Sándor Poszvék, János Renner, and Károly Thiering. However, he had two new teachers, namely Miklós Gombócz who taught him psychology and history, and Mátyás Müllner who taught him Latin.\nRátz entered the Budapest University of Arts and Sciences\n(\ntoday named\nEötvös Loránd\nUniversity\n)\nin\n1883\nand he studied there until\n1887\n. From\n4\nOctober\n1887\nto\n7\nAugust\n1888\nhe studied philosophy at the University of Berlin, before going to Strassburg where he studied science and natural history for a year starting the course on\n31\nOctober\n1888\n. He returned to Budapest in September\n1889\nand spent a year as a student teacher at the Gymnasium which was attached to the University of Arts and Sciences. The Budapest University of Arts and Sciences had been in the forefront of teacher training in Europe having founded the State Teacher Training Institution\n(\ntoday called the Faculty of Primary and Pre-School Education\n)\nin\n1869\nand, three years later, the first Teacher Training School\n(\ntoday called the ELTE Trefort Ågoston Teacher Training School\n)\n.\nOn\n28\nNovember\n1890\n, Rátz received a university diploma in mathematics and physics, three months after he had taken up his appointment as a substitute teacher at the Budapest Fasor Lutheran Gymnasium on\n1\nSeptember. This Gymnasium had been founded in\n1823\n. It was situated in what is today known as Deák Square but, long before Rátz began teaching there, it had moved in\n1864\nto a location in Sütö Street. Although his initial appointment had only been a temporary one, after two years it was made permanent. He remained at the school for the rest of his career, retiring in\n1925\n.\nThe Fasor Lutheran Gymnasium was a highly successful school and it took in a large number of pupils. It became too large for its premises on Sütö Street and attempts were made to obtain funding to move to a new building. Funding was obtained from the Hungarian State and sponsorship was obtained from Dániel Glosius and his wife Sarolta Artner. A plaque now honours their help in providing new buildings. In\n1904\na new building was opened at Városliget Fasor which provided greater facilities for the school. Rátz was made director of the Fasor Lutheran Gymnasium in\n1909\nand continued in this capacity for five years. It was during these years that he began teaching some of his most famous pupils. In the\n1910\ns,\nJohn von Neuman\n,\nJenó Wigner\nand the physicist Leó Szilárd\n(1898\n-\n1964)\nwere taught at the Budapest Fasor Lutheran Gymnasium. The school provided a solid education for them in mathematics, literature, classics and religion. It did provide science teaching, but there was less emphasis on this than on other subjects. All were taught mathematics by Rátz.\nWigner\nspoke about Rátz after receiving the Nobel prize\n(\nsee\n[\n4\n]\nand also\n[\n3\n]\n)\n:-\n... there were many superb teachers at the Lutheran gymnasium. But the greatest was my mathematics teacher László Rátz. Rátz was known not only throughout our gymnasium but also by the church and government hierarchy and among many of the teachers in the country schools. I still keep a photograph of Rátz in my workroom because he had every quality of a miraculous teacher: He loved teaching. He knew the subject and how to kindle interest in it. He imparted the very deepest understanding. Many gymnasium teachers had great skill, but no one could evoke the beauty of the subject like Rátz. Rátz cared deeply about mathematics as a discipline. At the retirement of Imre Gobi, the gymnasium director, the staff named Rátz as his successor. That gave Rátz a formal title and likely a higher salary. Most men would have said, 'Thank you kindly for the promotion. This is very fine.' But Rátz worried that his new duties would hurt his teaching. He knew how much energy is needed to evoke the deepest beauties of mathematics. And after five years of distinguished service as director, Rátz quietly resigned as director and became just a teacher again. He took special care to find his better students and to inspire them. Rátz felt so privileged to tutor a phenomenon like\nNeumann Jancsi\nthat he refused any money for it. He took special care to find his better students and to inspire them. Rátz felt so privileged to tutor a phenomenon like\nNeumann Jancsi\nthat he refused any money for it. You might say, 'Well,\nvon Neumann\nwas one of the great mathematicians of our century. Of course he deserved private classes as a boy.' But look at this from the teacher's point of view. He appeared to be a genius. But, of course, not yet famous at all. His brain wasn't that of an adult. He had never published. He was just a startling\n10\n-year-old boy, working next to\n20\nother bright\n10\n-year-olds. Who could know that this precocious\n10\n-year-old would someday become a great mathematician? Somehow Rátz knew. And he discovered it very quickly. Rátz was just as nice to me and nearly as devoted as he was to\nNeumann\n. Rátz was the only gymnasium teacher to invite me into his home. There were no private lessons. But Rátz lent me many well-chosen books, which I read thoroughly and made sure to return in good condition. Rátz also compiled for his students a book of common sense mathematical problems. I solved a few of them, but most I found fantastically hard. Often in the years since, when I have been in no mood for work, I have taken Rátz's little book from the self and studied those common sense problems.\nSándor Mikola wrote an appreciation of Rátz when he retired and this appeared in\n[\n1\n]\n:-\nEven more profound than that of the reform in mathematics teaching was the impact which László Rátz's work in connection with the Journal of Secondary-School Mathematics had on the teaching of mathematics in our country. He edited the journal for twenty years, and did so with the utmost selflessness, receiving no support from the state or any other source\n(\nnot that he asked for it\n)\nand, indeed, contributing substantial amounts of his own money to ensure the journal's publication. With the greatest of care he solicited for publication in the modest periodical articles and problems which would sow the seeds of mathematical thought in the pupils. With even greater care and conscientiousness he read through and evaluated solutions to the published problems sent in from all parts of the country. His acute perceptiveness consistently enabled him to recognise true abilities, I can deservedly boast on his part that those who excelled as mathematicians in college or university, with almost no exceptions, emerged from the modest ranks of his journal's readership.\nNot only did Rátz excel as a mathematics teacher but he was also active in his efforts to reform the teaching of mathematics throughout all Hungarian schools. He was a major player in a committee set up to propose reforms and his ideas inffluenced the teaching of mathematics in Hungary for many years. You can read about his work in reforming the teaching of mathematics in Hungary at\nTHIS LINK\n.\nIt was not just the recommendations of the committee that were influential, however, for the example he set at the Budapest Lutheran Gymnasium also had an strong influence on teaching in other schools. For example, Vogeli writes in\n[\n4\n]\n:-\nThe reputation of Rátz and the Fasor Street Gymnasium set the stage in Budapest for identifying particular schools that specialised in mathematics.\nIt was not only teaching in Budapest that was influenced by Rátz for, in session\n1907\n-\n08\n, the Budapest Lutheran Gymnasium sent materials used in the teaching of mathematics in the school to London, England, to form part of the cultural section of an exhibition there.\nAfter Rátz retired in\n1925\nhe was made an honorary director of the Lutheran Gymnasium. He died in the Grünwald Sanatorium in Budapest after suffering a long and painful illness. His grave is in the Lutheran Cemetery in Budapest."
}