{
  "nome_completo": "Ladislaus Josephowitsch Bortkiewicz",
  "nome_curto": "Ladislaus Bortkiewicz",
  "ano_nascimento": "1868",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bortkiewicz/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Ladislaus\n(\nor\nVladislav\n)\nBortkiewicz\n's father was Joseph Ivanowitsch Bortkiewicz and his mother was Helene von Rokicka. The family were of Polish descent. Joseph Bortkiewicz came from the Russian nobility. He was a military man with the rank of colonel but he was an instructor teaching artillery and mathematics. In fact he wrote a number of elementary teaching texts on mathematics, economics and finance. Ladislaus certainly was influenced by his father's academic interests.\nBortkiewicz studied law at St Petersburg, graduating in\n1890\nand then went on to study political economy and statistics for a year of postgraduate work. He studied at Strasbourg from\n1891\nto\n1892\n, then at Göttingen under\nLexis\nin\n1892\n, going on to also study at Vienna and Leipzig. After submitting a dissertation, he was awarded a doctorate in\n1893\nfrom Göttingen.\nAfter lecturing in statistics and actuarial science from\n1895\nto\n1897\nas a\nprivatdozent\nin Strasbourg he went to St Petersburg where he was a clerk in the Railway Office from\n1897\nuntil\n1901\n. However, during this time he returned to academic life, teaching statistics from\n1899\nuntil December\n1900\nat the Alexandrowskii Lyceum. Then in\n1901\nhe was appointed as an extraordinary professor of statistics at the University of Berlin. Bortkiewicz became an ordinary professor of statistics and political economy at the University of Berlin in\n1920\nand he spent the rest of his life there. An unfortunate argument with an Italian statistician Gini, who accused Bortkiewicz of plagiarism, led to an unhappy episode near the end of Bortkiewicz's life.\nBortkiewicz worked on mathematical statistics and applications to actuarial science and political economy. His work on actuarial science was largely concerned with mortality tables. He examined life expectancy in an increasing population and showed in\n1893\n, contrary to what had previously been believed, that life expectancy in such a population could only be computed from mortality tables and was not a function of the observed birth rate and death rate. He published on mortality rates again in publication of\n1904\nand\n1911\nwhere he examined methods to compare mortality rates.\nGood, in\n[\n5\n]\n, argues that the\nPoisson\ndistribution should have been named the von Bortkiewicz distribution. Bortkiewicz was interested in the law of small numbers and he used the divergence coefficient Q, deducing its expectation and standard deviation. This aspect of Bortkiewicz research is studied in detail in\n[\n7\n]\n. He published a work\nThe Law of Small Numbers\nin\n1898\n. In this he was the first to note that events with low frequency in a large population followed a\nPoisson\ndistribution even when the probabilities of the events varied. Gumbel writes in\n[\n6\n]\n:-\nA striking example was the number of soldiers killed by horse kicks per year per Prussian army corps. Fourteen corps were examined, each for twenty years. For over half the corps-year combinations there were no deaths from horse kicks; for the other combinations the number of deaths ranged up to four. Presumably the risk of lethal horse kicks varied over years and corps, yet the over-all distribution was remarkably well fitted by a\nPoisson\ndistribution.\nWe also mentioned that Bortkiewicz worked on political economy. Here he examined Marx's theory of profit and prices. He showed that there was an inconsistency in Marx's argument and modified Marx's scheme to make it consistent. Schumpteter writes in\n[\n9\n]\n:-\nBy far\n[\nBortkiewicz's\n]\nmost important achievement is his analysis of the theoretical framework of the Marxian system, much the best thing ever written on it and, incidentally, on its other critics. A similar masterpiece is his paper on the theories of rent of Rodbertus and Marx.\nOther areas to which Bortkiewicz applied his statistical methods include radioactivity\n(1913)\n, order statistics, and applications to legal studies.\nBortkiewicz was critical of the approach of\nKarl Pearson\nto statistics. He claimed that\nPearson\nproduced formulae to match observed results but with no theoretical reasoning. This, claimed Bortkiewicz, was worthless.\nKeynes\nhowever put the other side of the argument when he wrote in his\nTreatise on probability\n(1921)\n:-\n... Bortkiewicz does not get any less obscure as he goes on. The mathematical argument is right enough and often brilliant. But what it is all really about, and what it really amounts to, and what the premises are, it becomes increasingly perplexing to decide.\nSheynin writes in\n[\n1\n]\n:-\nBortkiewicz was one of the main representatives of the \"Continental direction\" in mathematical statistics and its application to statistics, but he left no monographs, and the German scientist were only marginally interested in his works. He did not create a school ...\nDespite writing no monographs, Bortkiewicz did write books and he wrote over\n100\npapers\n(\nsome very long\n)\nwhich are listed in\n[\n3\n]\n. He wrote almost exclusively in German and his works\n[\n1\n]\n:-\n... are distinguished by independent opinions ..., rigorous deductions, and voluminous references of international scope. At the same time, being comprehensive and not accompanied by a summary, they make hard reading.\nBortkiewicz received many honours including membership of the\nSwedish Academy of Sciences\n, the\nRoyal Statistical Society\n, the\nAmerican Statistical Association\nand the International Statistical Institute."
}