{
  "nome_completo": "Lawrence Crawford",
  "nome_curto": "Lawrence Crawford",
  "ano_nascimento": "1867",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Crawford/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Cape Town, South Africa",
  "biografia": "Lawrence Crawford\n's father was John Crawford, who was a native of Glasgow. Lawrence attended Glasgow High School and then entered the University of Glasgow. He had a very distinguished undergraduate career at Glasgow, winning the Metcalfe, Muir, and Ferguson Bursaries. He completed his studies at King's College, Cambridge, where he won the Glynn and Richards Prizes and was Fifth\nWrangler\nin the Mathematical Tripos of\n1890\n(\nmeaning he was ranked fifth among the First Class students\n)\n. He was then elected a Fellow of King's College where he remained undertaking research.\nIn\n1903\nCrawford was appointed as Lecturer in Mathematics at Mason College, Birmingham. In the same year he married Annie M Spilhaus; they had three sons and two daughters. After five years in Birmingham he was appointed as Professor of Mathematics in the South African College, Cape Town, South Africa. In\n1904\n, four years before Crawford arrived in Cape Town, a movement had started to obtain a charter for a University of Cape Town. The Acts were adopted in\n1916\nconstituting a University of Cape Town which formally began on\n2\nApril\n1918\n. At this time Crawford became Professor of Pure Mathematics at the University of Cape Town. He held this position until he retired in\n1938\n. After retiring Crawford remained in Cape Town and was elected as a City Councillor in\n1944\n, an office he held for the rest of his life.\nCrawford joined the\nEdinburgh Mathematical Society\nin April\n1885\nwhile he was still a student in Glasgow. He contributed papers to meetings of the Society such as\nOn the Use of the Hyperbolic Function in connection with the Hyperbola\ncommunicated by\nJohn Alison\nto the meeting on Wednesday\n10\nApril\n1895\n; and\nOn the evaluation of a certain determinant\nto the meeting on Friday\n8\nDecember\n1899\n.\nHe was elected to the\nRoyal Society of Edinburgh\non\n5\nJanuary\n1903\n, his proposers being\nSir W Thomson\n(\nLord Kelvin\n)\n,\nThomas Muir\n,\nGeorge Chrystal\n,\nJohn Sturgeon Mackay\n.\nAn obituary, written by S Skewes, appears in the\nRoyal Society of Edinburgh\nYear Book\n1952\n, pages\n14\n-\n15\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nIn South Africa he was a member of the South African Association for the Advancement of Science, and elected president of the Association in\n1916\n. He was elected a fellow of the Royal Society of South Africa, being president from\n1936\nto\n1941\n. In\n1942\nhe published\nEdward Waring, eighteenth century mathematician\nin\nTrans. Roy. Soc. South Africa\n."
}