{
  "nome_completo": "Lazarus Immanuel Fuchs",
  "nome_curto": "Lazarus Fuchs",
  "ano_nascimento": "1833",
  "ano_morte": "1902",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuchs/",
  "lugar_nascimento": "Moschin (near Posen), Prussia (now Poznań, Poland)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Lazarus Fuchs\n's parents were the Jewish teacher Rafael Fuchs and his wife Caecilie Katz. We do not have dates for Lazarus's parents but we know that at the time he wrote his doctoral thesis his mother was deceased but his father was still alive. He was first taught by his father in Moschin but he had a strong desire for learning so, in\n1846\n, he went to Posen\n(\nnow Poznań in Poland\n)\nwhere he was privately taught classical languages for two years but mainly studied on his own. However, his parents were in financial difficulties and could not give him any support. He did get very minimal support from a distant wealthy relative but he lived in extreme poverty. He found a place to live which was cheap but the conditions were extremely bad. For months his only food was coffee and bread. He often begged his better-off friends to give him the last end of a candle so that he could study during the night and achieve his aim of entering the local\nGymnasium\n. In\n1848\nhe entered the third class at the Friedrich Wilhelm Gymnasium in Posen which, at this time, had Gustav Kiessling as its director. While he was studying at the Gymnasium, Albert Gustav Heydemann\n(1808\n-\n1877)\nwas appointed as director in\n1850\n.\nIt was at the Gymnasium that his remarkable abilities at mathematics became very clear to his teachers despite the fact that he had a very poor preparation in the topic before beginning his studies at the Gymnasium. Mathematics became the subject which, even at this early stage, Fuchs knew was going to dominate the rest of his life. In addition to his school studies, Fuchs had to earn money by giving private tutoring and his abilities for developing hidden skills and talents in his pupils were quickly appreciated so that he became a much sought-after teacher. One of his friends was\nLeo Königsberger\nwho was four years younger that Fuchs and was also a pupil at the Friedrich Wilhelm Gymnasium in Posen. After eighteen months, Fuchs had completed the Middle School and, missing out a year in the Upper School, he was able to take his maturity examination at Easter\n1853\nwhich he passed with grade \"excellent\".\nDespite qualifying to enter university in\n1853\n, he could not begin his studies since he was completely destitute. It was at this stage that\nLeo Königsberger\n's parents came to his rescue. They offered to employ Fuchs as a private tutor to Leo for a year, to give him accommodation in their home, and to pay him a modest fee. He happily accepted and, after tutoring\nLeo Königsberger\nfor a year, he entered the University of Berlin at Easter\n1854\n. The rector of the university at this time was the famous astronomer\nJohann Franz Encke\nand Fuchs was enrolled into the Faculty of Philosophy whose dean was the philosopher Friedrich Adolf Trendelenburg\n(1802\n-\n1872)\n. From Easter\n1857\nto Easter\n1864\nFuchs and\nKönigsberger\nshared accommodation in Berlin. They lived in a great number of different houses, forced to live a very simple and modest life-style since, especially in the first few years, they lived off the income that Fuchs made through giving private lessons.\nAt the University of Berlin, Fuchs attended lectures by a number of famous mathematicians including\nEduard Kummer\nand\nKarl Weierstrass\n. He gives the full list of those who taught him during his four years at the University of Berlin in his doctoral thesis. These teachers are: mathematician Peter Friedrich Arndt\n(1817\n-\n1866)\n, classical scholar August Böckh\n(1785\n-\n1867)\n,\nCarl Borchardt\n,\nRudolf Clausius\n,\nLejeune Dirichlet\n, physicist and meteorologist Heinrich Wilhelm Dove\n(1803\n-\n1879)\n, astronomer\nJohann Franz Encke\n,\nEduard Kummer\n, zoologist Martin Heinrich Carl Lichtenstein\n(1780\n-\n1857)\n, experimentalist in chemistry and physics Heinrich Gustav Magnus\n(1802\n-\n1870)\n, chemist and mineralogist Eilhard Mitscherlich\n(1794\n-\n1863)\n, mathematician\nMartin Ohm\n, physicist Johann Christian Poggendorff\n(1796\n-\n1877)\n, historian and political scientist Friedrich Ludwig Georg von Raumer\n(1781\n-\n1873)\n, chemist Franz Leopold Sonnenschein\n(1817\n-\n1879)\n, philosopher Friedrich Adolf Trendelenburg\n(1802\n-\n1872)\n, mineralogist Christian Samuel Weiss\n(1780\n-\n1856)\n, and\nKarl Weierstrass\n. He writes:-\nI am, and will always be, grateful to all these men who perfectly rendered outstanding services to me.\nAs well as attending lectures by the people listed above, Fuchs read\nGauss\n's\nDisquisitiones arithmeticae\nand works by\nFourier\n,\nLaplace\nand\nCauchy\n. The professors who had the greatest influence on Fuchs were\nKarl Weierstrass\n, who introduced him to function theory, and\nEduard Kummer\nwho went on to supervise his doctorate. The examiners for his doctoral dissertation,\nDe Superficierum lineis curvaturae\nⓉ\n(\nOn curves on a surface\n)\n, held on\n2\nAugust\n1858\nwere\nKummer\nand\nMartin Ohm\n(\nthe brother of\nGeorg Simon Ohm\n)\nand his opponents were Julius Weingarten,\nLeo Königsberger\nand Eduard Fischer. Fuchs was awarded the degree by the University of Berlin\n1858\n.\nBefore the award of his doctorate, Fuchs began to worry about whether he should convert from Judaism to Christianity. He knew that if he remained a follower of the Jewish faith he would suffer discrimination and his career prospects would be very limited. Although Jews had been officially discriminated against during the early years of Fuchs' life, a new constitution in Prussia in\n1850\ngave all citizens equal rights irrespective of their religion. Despite the constitution, equality did not happen and discrimination continued in Prussia as did many restrictions and limitations on Jews. Fuchs spent three years deeply worried about whether he should convert to Christianity. Of course, it was not simply a personal matter since he worried greatly about how his Jewish family would feel if he converted. Both\nKummer\nand\nWeierstrass\nwere well aware of Fuchs' painful suffering on the issue and encouraged him to take the step. He was also given great support from Julius Müllensiefen\n(1811\n-\n1893)\n, who was a pastor at the church of St Marien in Berlin. In\n1860\n, Fuchs converted to Evangelical-Lutheran Christianity.\nBefore obtaining his doctorate, Fuchs was appointed to a teaching post at a Gymnasium in Berlin on\n19\nMarch\n1859\n. In fact he taught in several different institutions before moving on to a mathematics teaching position at the Friedrich Werder Trade School. During this time he was undertaking research with the aim of becoming a university professor. It was during this period that he did outstanding work on homogeneous linear differential equations with variable coefficients which was published in the important\n40\n-page paper\nZur Theorie der linearen Differentialgleichungen mit veränderlichen Coefficienten\nⓉ\n(\nOn the theory of linear differential equations with variable coefficients\n)\nwhich appeared in\nCrelle\n's Journal in\n1866\n. This work is described in more detail below. He began his university teaching career when he was appointed as a Privatdozen at the University of Berlin in August\n1865\nafter submitting his\nhabilitation\nthesis\nZur Theorie der linearen Differentialgleichungen mit veränderlichen Coeffizienten\nⓉ\n(\nOn the theory of linear differential equations with variable coefficients\n)\n. He was promoted to extraordinary professor there on\n2\nDecember\n1866\nand taught at the University until winter semester\n1868\n-\n69\nwhen he accepted an appointment as a full professor at Greifswald. Fuchs also held a second post in Berlin from\n23\nMay\n1867\nwhen he was appointed as professor of mathematics at the Artillery and Engineering School.\nIn\n1868\nFuchs married Marie Anders\n(23\nJuly\n1849\n-\n10\nMay\n1917)\n. They had four sons and two daughters including Clara Fuchs\n(1869\n-\n1954)\nand\nRichard Fuchs\nwho became a mathematician and has a biography in this Archive. Clara married the mathematician\nLudwig Schlesinger\nwho also has a biography in this Archive. We note that\nRichard Fuchs\nand\nLudwig Schlesinger\njointly edited Lazarus Fuchs' complete works:\nGesammelte mathematische Werke von L Fuchs\nwhich was published by Mayer & Müller, Berlin in three volumes in\n1904\n,\n1906\nand\n1909\n.\nFuchs took up the professorship in Greifswald on\n3\nFebruary\n1869\n, the position becoming vacant since Leo Königsberger, who had taught at Greifswald for five years, had been appointed to a chair of mathematics at Heidelberg. After spending five years in Greifswald, Fuchs moved again, this time to Göttingen where he took up an appointment as an ordinary professor on\n23\nJanuary\n1874\n. Then in the following year he went to Heidelberg and taught there for nine years. In many ways these years were the most enjoyable period of his life. He loved the natural environment around the city, something that was important to Fuchs who had deep feelings for nature. Also in Heidelberg he had a particularly good relationship with his many outstanding doctoral students, and he got on extremely well with the other members of staff in many different faculties of the university. In fact during nine years at Heidelberg he supervised the doctoral studies of at least eight students who went on to become professors of mathematics. We will say a little below about the correspondence he carried out with\nHenri Poincaré\nduring his years at Heidelberg. In the summer semester of\n1884\nhe returned to Berlin to fill Kummer's chair when his old teacher retired. Fuchs held this post for the rest of his life. He also undertook important editorial duties in the final ten years of his life when he was the editor of\nCrelle\n's journal, the\nJournal für die reine und angewandte Mathematik\n. Fuchs published many papers in this journal over his career: see the papers at\nTHIS LINK\n.\nErnest Julius Wilczynski\nattended Fuchs' lectures in Berlin. He writes in\n[17]\nthat he:-\n... remembers the small and crowded lecture-room in the University of Berlin, poorly ventilated, stuffy and hot in the summer days, but so full of meaning and inspiration to the earnest and thoughtful student. Fuchs was not a brilliant lecturer. He spoke in a quiet, undemonstrative manner, but what he said was full of substance. To the student there was the inspiration of seeing a mathematical mind of the highest order full at work. For Fuchs worked when he lectured. He was rarely well prepared, but produced on the spot what he wished to say. Occasionally he would get lost in a complicated computation. Then he would look around at the audience over his glasses with a most winning and child-like smile. He was always certain of the essential points of his argument, but numerical examples gave him a great deal of trouble. He was fully conscious of this failing, and I remember well one occasion when, after a lengthy discussion, he laid considerable emphasis upon the fact that \"\nin this case\n, two times two is four.\"\nFuchs worked on differential equations and the theory of functions.\nGeorge Mathews\nwrites\n[\n12\n]\n:-\nFuchs's mathematical papers are very pleasant to read and free from that tendency to heaviness which is apt to belong to memoirs on differential equations. He had the faculty of bringing out clearly the really important points without over-elaborate detail, and he did not disdain to show the power of his methods by applying them to specific and definite problems.\nIn\n[\n1\n]\nJerome Manheim writes:-\nFuchs was a gifted analyst whose works form a bridge between the fundamental researches of\nCauchy\n,\nRiemann\n,\nAbel\n, and\nGauss\nand the modern theory of differential equations discovered by\nPoincaré\n,\nPainlevé\n, and\nÉmile Picard\n.\nIn\n1865\nFuchs studied nth order linear ordinary differential equations with complex functions as coefficients. This is described by Bölling in\n[\n3\n]\n:-\nFuchs enriched the theory of linear differential equations with fundamental results. He discussed problems of the following kind: What conditions must be placed on the coefficients of a differential equation so that all solutions have prescribed properties\n(\ne.g. to be regular or algebraic\n)\n. This led him\n(1865\n,\n1866)\nto introduce an important class of linear differential equations\n(\nand systems\n)\nin the complex domain with analytic coefficients, a class which today bears his name\n(\nFuchsian equations, equations of the Fuchsian class\n)\n. ... He succeeded in characterising those differential equations the solutions of which have no essential singularity in the extended complex plane. Fuchs later also studied non-linear differential equations and moveable singularities.\nFuchs' study\n(1876\nwith\nHermite\n)\nof elliptic integrals as a function of a parameter marks an important step towards the theory of modular functions\n(\nKlein\n,\nDedekind\n)\n. In a series of papers\n(1880\n-\n81)\nFuchs studied functions obtained by inverting the integrals of solutions to a second-order linear differential equation in a manner generalising\nJacobi\n's inversion problem.\nIt was Fuchs' work on this inverse function which led\nPoincaré\nto introduce what he called a Fuchsian group, and use this as a fundamental concept in the development of the theory of automorphic functions. The first contact between\nPoincaré\nand Fuchs was a letter written by\nPoincaré\non\n29\nMay\n1880\n:-\nI have read with great interest the remarkable treatise that you had recently included in the last issue of\nCrelle\n's Journal with the title \"Über die Verallgemeinerung des kehrungsproblems.\"\nⓉ\n(\nOn a generalization of reversal problems.\n)\nI hope you will grant me, dear sir, to request from you certain clarifications on the subject. ... I have to confess, dear sir, that these thoughts have raised with me some doubts about the generality of the results that you have published and I have taken the freedom to approach you about it, hoping that it will not trouble you to clear this up.\nAlthough we have given the extract from\nPoincaré\n's letter in English\n(\nfollowing\n[\n2\n]\n)\nin fact he wrote in French while Fuchs replied in German. Both seemed happy with this arrangement. Verhulst writes in\n[\n2\n]\n:-\nFuchs, despite being\n21\nyears Poincaré's senior, consistently maintained a tone of friendship and interest, even when it began to become clear that his young French correspondent was developing an approach that was quite different from his own and more complete.\nOn\n12\nJune\n1880\nPoincaré\nwrote to Fuchs:-\nI find in the case that there are two singular points only, that the function you have introduced has very remarkable characteristics, and because I intend to publish the results I have obtained, I am asking your permission to call them Fuchsian functions; for it was you who discovered them.\nOn\n20\nMarch\n1881\n,\nPoincaré\nwrote his last letter to Fuchs:-\nI have continued with the functions that I named after you and I hope to publish my results shortly. These functions contain as a special case the elliptic functions and also the modular function. With these and other functions that I have called zeta Fuchsian, one can solve:\n(1)\nAll linear differential equations with rational coefficients that have three singularities only, two finite and one infinite.\n(2)\nAll second order equations with rational coefficients.\n(3)\nA large number of equations of various orders with rational coefficients.\nFuchs also investigated how to find the matrix connecting two systems of solutions of differential equations near two different points. A survey of Fuchs work appears in\n[\n8\n]\nwhere Gray also describes how this work influenced\nKlein\n,\nJordan\n,\nPoincaré\nand others. In this interesting paper Gray also discusses the relationships between Fuchs' ideas and his mathematical tools, and illustrates how solutions of certain problems led Fuchs to the study of further problems. Gray writes in his introduction:-\n[\nFuchs'\n]\nwork can profitably be seen as an attempt to impose upon the inchoate world of differential equations the conceptual order of the emerging theory of complex functions. As well as being the architect of the rigorous modern theory of linear equations, he raised many questions which were taken up by his contemporaries and provided an interesting battleground for the schools of invariant theory and transformation group theory.\nAfter discussing the concepts named for Fuchs, Gray writes\n[\n8\n]\n:-\nBut it would be idle to debate the justice of remembering Fuchs by things Fuchsian. Rather, Fuchs' career remains of interest because it shows clearly and dramatically how mathematical ideas are many-sided, and how many new ideas may be needed to solve a problem. There is an ironic truth in the assessment that Fuchs opened up a new province: repeatedly Fuchs pointed to problems in analysis that could best be solved by group theory. Denying himself this tool, which belonged to the younger generation, one might say that Fuchs could only stand like Moses and gaze upon the promised land.\nIn\n[\n3\n]\nBölling describes Fuchs' character as follows:-\n... Fuchs is a representative of both Berlin's classical and its post-classical era. His personality has been described as indecisive, timid, but at the same time humorous and full of kindness."
}