{
  "nome_completo": "Lazare Nicolas Marguérite Carnot",
  "nome_curto": "Lazare Carnot",
  "ano_nascimento": "1753",
  "ano_morte": "1823",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carnot/",
  "lugar_nascimento": "Nolay, Burgundy, France",
  "lugar_morte": "Magdeburg, Prussian Saxony (now Germany)",
  "biografia": "Lazare Carnot\nwas the son of Claude Abraham Jean Jacques Carnot\n(1719\n-\n1797)\nand Magdelaine Marguerite Pothier\n(1726\n-\n1788)\n. Claude Carnot was a leading citizen of Nolay, a notary, judge and bailiff for the Marquisate of Nolay. The Marquisate of Nolay had been created in the time of Henry IV of France\n(1553\n-\n1610)\n. Lazare Carnot's paternal grandfather was Jean Carnot\n(1672\n-\n1735)\n, a notary and procurator fiscal. Claude and Marguerite Carnot were married in\n1745\nand had seventeen children including Joseph-François-Claude Carnot\n(1852\n-\n1835)\n, Lazare Carnot\n(1753\n-\n1823)\n, the subject of this biography, and Claude-Marie Carnot Feulins\n(1755\n-\n1836)\n. Let us note at this point that Joseph-François-Claude Carnot became a jurist, was a member of the Court of Cessation\n(1801\n-\n1835)\n, was elected to the Académie des Sciences Morales et Politiques in\n1832\nand became an Officer of the Légion d'Honneur. Claude-Marie Carnot Feulins was a soldier. He was a deputy to the Legislative Assembly of\n1791\n, a Representative during the Hundred Days of\n1815\nand a provisional commissioner in the French Executive Commission of\n1815\n. This brother, two years younger that Lazare, was closest to him among his siblings and they became inseparable. Both of Lazare Carnot's two brothers we just mentioned published several books. None of his relatives that we have mentioned had the name Lazare, but it was a family name. He was\n[\n8\n]\n:-\n... named after an uncle who was a learned doctor of the Sorbonne and a vicar general of the diocese of Chalon.\nLazare's elementary education was first from M Masson, then from M Boisson, both excellent Latinists, at the small college in Nolay. He reached the second rhetoric class under their instruction. In\n1767\n, when he was fourteen years old, Lazare and his older brother were sent to Autun about\n25\nkm due west of Nolay. He boarded with Mme Gondier in Autun and took the third year of rhetoric at the Collège d'Autun, an Oratorian college, studying philosophy and classics. After a year at the Collège d'Autun, he entered the Sulpician Seminary of Autun. This small Seminary was run by the Society of Priests of Saint Sulpice and emphasised academic work. Here Carnot studied mathematics, logic and theology, his teacher being Abbé Bisson. While he was in Autun there was a smallpox epidemic which affected Carnot but, thanks to Mme Gondier and his doctor M Lhomme, he made a quick recovery and his education suffered little\n[\n8\n]\n:-\nIn\n1768\nhe passed a brilliant public examination in Latin, declining the usual assistance of the masters in the defence of his thesis, and in the face of learned objections presented by a public auditor, Madame Lhomme, the wife of his physician. At this time the boy was so devout that certain of his relatives suggested holy orders for him.\nLazare Carnot's father Claude worked for the Duke D'Aumont, the Marquis of Nolay, and the Duke, being very impressed with Lazare and feeling that holy orders was not the way he should proceed, recommended to his father that his son would benefit from a military career. The Duke offered to contact the Ministry of War to allow Carnot to be admitted to the engineering corps despite recent moves to limit numbers entering. He began studying at Louis-Siméon Mausserat de Longpré's school in the Marais area of Paris. At this time there were two preparatory schools in Paris which trained boys for engineering, artillery and the navy. Mausserat de Longpré's school was the smaller, and considered the stronger academically, of the two. The director of the school was very friendly with\nJean d'Alembert\n, as Carnot's son Hippolyte Carnot\n(1801\n-\n1888)\nexplained in\n[\n3\n]\n:-\nThe illustrious academician would come and sit among the students and enjoy exercising their intelligence by confronting them with embarrassing problems. He had noticed young Carnot ... and predicted great success for him. My father recalled all his life with gratitude the conversations and encouragement of\nD'Alembert\n, to whom he attributed a notable influence on his scientific development.\nIn February\n1771\nCarnot sat the entrance examination for entering an engineering school and was ranked third in the\n[\n8\n]\n:-\n... class of one hundred and fifteen taking the examination, Carnot was appointed as a second lieutenant to the engineering school at Mézières. He was then eighteen years of age. The examiners said of him: An excellent prospect, very intelligent, knows his course excellently.\nCarnot was taught at the School of Engineering in Mézières by\nGaspard Monge\namong others. At Mézières his courses included geometry, mechanics, geometrical designing, geography, and hydraulics. It was around this time that he met\nBenjamin Franklin\nwho visited France in\n1772\nwhile he was the American emissary in England seeking French support for American independence. This friendship was important in the development of Carnot's political ideas which, a few years later, he put into practice.\nHe graduated from the School in\n1773\n, leaving on\n13\nFebruary. He then embarked on his military career, appointed as a first lieutenant in the Prince of Condé's engineering corps. He quickly made a name for himself both as an expert on fortification and on dirigible balloons. He would later published important work on both these topics. He also continued to study mathematics.\nIn\n1778\nhe wrote\nEssai sur les machines en général\nⓉ\n(\nEssay on machines in general\n)\nwhich he submitted for a prize in a competition. He revised it in\n1781\nand it was eventually published in\n1783\n. It deals with mechanics and areas of engineering. The Preface begins:-\nAlthough the theory in question here is applicable to all questions concerning the communication of movements, this pamphlet has been given the title of 'Essay on Machines in General'; first, because it is mainly the Machines that we have in view, as being the most important object of mechanics; and secondly, because there is no question of any particular Machine, but only of the properties which are common to all. This theory is based on three main definitions; the first looks at certain movements which I call geometrical, because they can be determined by only the principles of geometry, and are absolutely independent of the rules of Dynamics; I did not believe that we could easily do without it, without leaving something suspicious in the statement of the main proportions as I show in particular for the principle of\nDescartes\n. By the second of my definitions, I try to fix the meaning of the terms soliciting force and resistant force: one cannot, it seems to me, clearly compare the causes with the effects in the Machines, without a well-characterised distinction between these different forces; and it is this distinction on which it seems to me that something has always been left vague and indeterminate.\nIn\n1783\nhe published\nÉloge de Vauban\nⓉ\n(\nTribute to Vauban\n)\n. At the session of\n3\nDecember\n1778\n, the Academy of Sciences, Arts and Belles Lettres of Dijon had proposed the \"Éloge du Maréchal Vauban\" for the literary competition of\n1784\n. Sébastien, Marquis de Vauban\n(1633\n-\n1707)\n, was considered to have been the leading French engineer whose system of fortifications had, in his day, been considered the best. Vauban was from Burgundy and the Dijon Academy thought he deserved a better éloge than\nBernard de Fontenelle\nhad given him in the\nParis Academy of Sciences\n. Carnot, also from Burgundy, and now an expert on fortifications had entered the Dijon Academy's competition. Carnot, now captain in the Corps du Royal Génie in the garrison at Arras, received two gold medals and the Academy's prize on\n2\nAugust\n1784\n, the presentation being by the Prince of Condé himself. Carnot's\nÉloge de Vauban\nⓉ\n(\nTribute to Vauban\n)\nwas praised for its enthusiasm, its warmth of expression, and its compassion and he was described as learned and eloquent. Carnot replied to the Prince\n[\n26\n]\n:-\nMonseigneur, it is very sweet to be crowned by a hero with the name of Condé, and the laurels which your hand dispenses, just as those which decorate your august forehead, are of a species never to wither.\nLet us quote from the\nÉloge de Vauban\nⓉ\n(\nTribute to Vauban\n)\n(\nsee, for example,\n[\n17\n]\n)\nfor we find there things about Carnot's character and his attitude towards his country:-\nHow rare it is for a wise man to reap the fruit of his works! He is ahead of his century, and his words can only be understood by posterity; but that is enough support for him; his imagination breaks through the shades of error; he is the friend of men yet to be born, he converses with them in his deepest research; as a citizen, he looks to his nation, his hopes are for it, he applauds its successes; he takes part in its triumphs; as philosopher, he has already crossed the boundaries separating empires. He has no enemies, he is a citizen of all places and contemporary of all times; he stays with man from his frail origin until his final perfection.\nHere is a quote about geometry from the\nÉloge de Vauban\nⓉ\n(\nTribute to Vauban\n)\n[\n43\n]\n:-\nThere is a geometry more subtle than that of\nEuclid\n. This\n[\nnew\n]\nnatural geometry is genius itself applied to the science of measure. ... It is through such a natural geometry that man sees, although as in a fog, the results of a new hypothesis, before any calculation. This natural geometry creates, the other just cleans; without the first, the second is useless.\nMarc René, Marquis de Montalembert\n(1714\n-\n1800)\nhad improved on Vauban's fortifications but now Carnot was quickly gaining a reputation for improving on Montalembert's ideas. In\n1787\nhe was elected a member of the Dijon Academy.\nOn\n25\nMay\n1787\nCarnot addressed the Academy of Arras and again we learn much about him from it\n[\n17\n]\n:-\nThere is only one true practicable morality, it is the one that teaches us to draw our particular interest from the common interest of mankind. ... By the habit of serving the common interest of mankind, through the constant practice of virtue, the citizen arrives at a type of pleasure that only its very practice can give. ... It is the only pleasure that, rather than becoming time-worn, has the unique advantage of increasing itself through its fulfilment. When you do the good, you always want to do more, you always know that there is much more to do and you can never be satisfied.\nThe year\n1789\nsaw the outbreak of the French Revolution when in May of that year France became a constitutional monarchy followed by the storming of the Bastille on\n14\nJuly. This saw Carnot enter the world of politics. He was elected to the Legislative Assembly in\n1791\nand was appointed to their Committee for Public Instruction. He worked on educational reforms based on his beliefs that all citizens should be entitled to an education. The chaotic upheavals following the Revolution prevented any of his reforms being implemented at this time.\nDuring this period, Carnot married Marie Jacqueline Sophie Josèphe Dupont\n(1764\n-\n1813)\non\n17\nMay\n1791\n. This marriage came about due to rather unusual set of circumstances. Claude-Marie Carnot, Lazare's younger brother, married Marie Adélaïde Françoise Josèphe Dupont\n(1766\n-\n1854)\nat Saint Martin au Laërt, Pas de Calais, on\n11\nMay\n1790\n. She was the daughter of Jacques Antoine Léonard Dupont, Lord of Moringhem\n(1731\n-\n1808)\n, who was a lawyer, and Marie Anne Françoise Sevault\n(1739\n-\n1807)\n. Lazare Carnot injured his leg with a fall from his horse on\n10\nSeptember\n1790\nand his sister-in-law, Marie Jacqueline Sophie Josèphe Dupon, nursed him until he recovered and eight months later they were married. They had three sons:\nSadi Carnot\n, an important mathematician with a biography in this archive, was born on\n19\nJuly\n1794\n; Nicolas Léonard Sadi Carnot was born on\n1\nJune\n1796\n, he became a physicist who worked on thermodynamics; and Lazare Hippolyte Carnot, born\n6\nApril\n1801\n, who became a journalist and then Minister of Public Instruction and a member of the Academy of Moral and Political Sciences. Let us note at this point that Hippolyte Carnot wrote the article\n[\n3\n]\nand Hippolyte's son Marie François Sadi Carnot was President of France from\n1887\nuntil his assassination in\n1894\n.\nWhen the Legislative Assembly was dissolved, Carnot was elected to the National Convention in\n1792\n[\n44\n]\n:-\nFrom September to November\n1792\n, Carnot was in the Pyrenees as a special emissary of the Convention. After his return, he presented proposals for the economic development of the otherwise backward mountain region\n(\ndeveloping its textile industry\n)\nso that it could free itself from British domination.\nHe directed the Army of the North after April\n1793\nbecoming in that year a leading member of the Committee of General Defence and a member of the Committee of Public Safety which meant he was responsible for planning military operations. In September\n1793\n, with the allies under General von Coburg threatening to advance on Paris, Carnot went to the front himself\n[\n44\n]\n:-\nCarnot, as a member of the Committee of Public Safety, grabbed a rifle from a soldier who was standing nearby, and, in his civilian clothes, recognisable only by the large feather he wore in his hat, he himself led the attack at the head of his troops. General Gratien thought this attack was too daring, so Carnot ordered his arrest right there on the battlefield. The psychological effect of the attack was devastating. Coburg withdrew to the north the next day, and Paris was saved.\nIn September\n1794\n, under direction from Carnot and\nMonge\n, a 'Grande École' was set up called 'École Centrale des Travaux Publics' but its name was changed to 'École Polytechnique' in the following year.\nCarnot now put into practice his military strategy which led to the French inflicting defeats on the allies. Part of the strategy involved building up the military forces but he also worked on other ways to see France victorious such as obtaining Prussian neutrality and disrupting communications between Austria and England. France won notable victories occupying the Netherlands. This highly successful military leadership led to Carnot being known as the 'Organiser of Victory'. A coup led by Paul Barras in\n1794\nled to the end of the Reign of Terror and under Carnot's influence Robespierre was removed. All was now not well for Carnot, however, for he strongly opposed the policies of Barras particularly when he put down a revolt of the people of Paris. Carnot resigned from the Committee of Public Safety because of his opposition to Barras but returned to power on\n11\nApril\n1795\nwhen he became a member of the Directory, a five-man ruling committee. On\n30\nApril\n1796\nhe was elected President of the Directory.\nThe year\n1797\nwas an eventful one for Carnot. In this year he published his famous text\nRéflexions sur la métaphysique du calcul infinitésimal\nⓉ\n(\nReflections on the metaphysics of calculus\n)\n. The book was an extended version of the essay which Carnot had submitted for the\nBerlin Academy\nPrize in\n1786\nbut had failed to win, the prize being awarded to\nSimon Lhuilier\n. The advertisement for the book is introduced with the words:-\nAs however everything indicates that there will be a new turn in the culture of mathematics, the author deems it apposite to publish this monograph.\nThiele writes that Carnot's approach to mathematics shows strongly his engineering background. In\n[\n49\n]\nhe writes that Carnot:-\n... accepted mathematical expressions only insofar as the quantities contained in them were real and the operations involved held meaning. ... to Carnot negative quantities are impossible, and zero, just like infinity, is a limit. ... infinitely small quantities are real objects, being representable as differences between limits ...\nJacques Harthong takes a much more positive view of Carnot's contribution\n[\n33\n]\n:-\nThe main interest of this book is to reveal the fallacy of a very common idea: that the infinitesimal calculus would not have become fully rigorous\n(\nthat is to say, based on logic alone without any recourse to intuition or flair\n)\nonly with\nWeierstrass\n. It is true that\nWeierstrass\n's point of view is the dominant one today; it is also true that it gives a satisfactory approach; but it is no less true that that of Carnot\n(\nwho, moreover, owes a lot to\nLagrange\n)\ncould have given a just as satisfactory approach, and another explanation must be found for the choice ultimately made by history. Indeed Carnot offers a true axiomatic approach.\nFor extracts from the English translation by the Rev W R Browell M.A., Fellow of Pembroke College, Oxford, published in\n1832\n, see\nTHIS LINK\n.\nIn the same year,\n1797\n, following the coup by Pierre Augereau, the political situation in France became such that he could no longer remain with his strong republican views. On the night of\n3\n-\n4\nSeptember\n1797\n[\n35\n]\n:-\n... a body of troops\n(\nincluding artillery\n)\n, having rallied under Barras' window\n(\nadjacent to Carnot's in the Luxembourg Palace where the Directors had their apartments\n)\n, came to Carnot's front door while unidentified \"assassins\" waited at the back in the garden. Carnot ordered some other Director's troops to disperse the assassins, got his brother to slow up the guards coming to arrest him, and slipped through a little-known gate in the Luxembourg gardens away into exile.\nCarnot fled to Switzerland going on to Nuremberg in Germany.\nIn\n1800\nCarnot returned to France with Napoleon's permission. Napoleon had became First Consul in\n1799\n. Carnot became Napoleon Bonaparte's minister of war for a period of five months and was promoted further to the rank of lieutenant-general. In May\n1802\n, however, he voted against the proposal to make Napoleon consul for life. On\n2\nDecember\n1804\nNapoleon was crowned emperor in Notre Dame. Carnot's republican views made further service impossible and he retired from public life.\nCarnot is best known as a geometer. In\n1801\nhe published\nDe la correlation des figures de géométrie\nⓉ\n(\nCorrelation of geometrical figures\n)\nin which he tried to put pure geometry into a universal setting. He showed that several of the theorems of\nEuclid\n's\nElements\ncan be established from a single theorem. In this\n1801\nwork, Carnot proposes an original idea regarding the difference between analysis and synthesis. According to him, they are distinguished from each other by the fact that, in synthesis:-\n... one can never reason except on real and effective objects ...\nwhile in analysis,\n... we admit objects that do not exist; we represent them by symbols as well as what is real. We mix real beings with beings of reason; then by methodical transformations, we manage to eliminate or drive out the latter from the calculation: then what was unintelligible in the formulas disappears; there remains what a subtle synthesis would surely have been able to reveal. But this result has often been obtained by a shorter route, more easy, and almost in a purely mechanical way, when it would have taken prodigious efforts to achieve it otherwise. Such is the advantage of analysis, and consequently that of the moderns over the ancients.\nIn\n1803\nhe published\nGéométrie de position\nⓉ\n(\nGeometry of position\n)\nin which sensed magnitudes were first used systematically in geometry. This work greatly extended his work of\n1801\nand in it Carnot again shows what quantities mean to him writing:-\nEvery quantity is a real object such that the mind can grasp it or at least its representation in calculation.\nCarnot writes in the Introduction:-\nThe title of this work may remind Geometers that the illustrious\nLeibniz\nhad conceived the idea of an 'Analyse de situation'; an idea which has not been really developed. ... My work on the geometry of position differs from that of 'Analyse de situation'; although it is analogous to it.\nLeibniz\nwanted us to include in the expression of the conditions of a geometric problem, the diversity of positions of the corresponding parts of the compared figures, so that by separating them by a very distinctive character, we could isolate them more easily in the calculation. Now this diversity of positions is often expressed by simple changes of signs; and it is precisely the theory of these changes that is the essential subject of the research that I have in view, and which I call 'Géométrie de position'.\nHe also published\nPrincipes fondamentaux de l'équilibre et du mouvement\nⓉ\n(\nFundamentals of balance and movement\n)\nin\n1803\n.\nCarnot's military masterpiece\nDe la défense des places fortes\nⓉ\n(\nDefending strongholds\n)\nwas published in\n1809\n. He later served as military governor of Antwerp but after Napoleon's final defeat at Waterloo he went into exile. He fled to Magdeburg, after going first to Warsaw, arriving in Magdeburg in November\n1816\n.\nCarnot's interests turned toward the steam engine with the first steam engine coming to Magdeburg in\n1818\n. His son\nSadi Carnot\nvisited him in Magdeburg in\n1821\nand it is clear that Lazare Carnot influenced his son.\nSadi Carnot\npublished his masterpiece on the thermodynamics of the steam engine three years later.\nLet us end with this quote from\n[\n34\n]\n:-\nAt the moment when France faced its darkest crisis, when defeat was almost certain, Carnot managed to turn defeat into victory. He did it by showing \"excellence\" in leadership, by making a revolution in military warfare, mobilising the best scientists of France, making use of the École Polytechnique so as to lay the foundation for a broad-based education of French citizens, while using his own discoveries of new scientific principles in the field of machine-tools and machine building, so as to create the basis for an industrial and technological revolution in France and Europe as a whole.\nCarnot was convinced that the key to organise nations and people, to elevate citizens to become true nation-builders, is based on the moral quality of leadership whose excellence is not based in the academic knowledge of theories and books, but which shows in particular under conditions of crisis, wars, and duress. The biggest resource and strength in building nations is the sovereign, creative mind of the individual who, faced with the unknown - with obstacles and paradoxes that challenge customary opinion - is forced to look for creative flanks and bold solutions. \"Circumstances develop sometimes faculties in us whose germ we did not think of, making our souls greater and giving our souls energy,\" Carnot said. Among his most excellent generals, he chose people at the age of\n25\nor\n30\n, upon whose shoulder he put responsibility, having confidence in their powers of imagination and boldness.\nThat emotional quality of the mind, indispensable for overcoming obstacles and making discoveries, is what Carnot calls \"enthusiasm\" - passion. According to his son Hippolyte, who wrote the most insightful and wonderful biography of his father, \"A great passion is the soul of the great totality.\" \"Passion is the unique principle of all that is beautiful and great in the world.\" In a poem called \"Ode to Enthusiasm,\" Carnot writes:\nEnthusiasm, love of beauty!\nPrinciple of noble flames. ...\nYou are not raving drunkenness,\nyou are not cold reason;\nyou go further than wisdom,\nwithout exceeding its extent.\nDelicate instinct which precedes\nboth the counsel of prudence\nand the calculations of judgment.\nWithout \"enthusiasm,\" there can never be a creative discovery in science or art. Carnot calls that creative capacity of the mind the \"natural geometry,\" where, with a 'coup d'oeil', or glance, with \"artistic ingenuity\" the mind forms new hypothesis."
}