{
  "nome_completo": "Johann Peter Gustav Lejeune Dirichlet",
  "nome_curto": "Lejeune Dirichlet",
  "ano_nascimento": "1805",
  "ano_morte": "1859",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dirichlet/",
  "lugar_nascimento": "Düren, French Empire (now Germany)",
  "lugar_morte": "Göttingen, Hanover (now Germany)",
  "biografia": "Lejeune Dirichlet\n's family came from the Belgium town of Richelet where Dirichlet's grandfather lived. This explains the origin of his name which comes from \"Le jeune de Richelet\" meaning \"Young from Richelet\". Many details of the Dirichlet family are given in\n[\n6\n]\nwhere it is shown that the Dirichlets came from the neighbourhood of Liège in Belgium and not, as many had claimed, from France.\nHis father was the postmaster of Düren, the town of his birth situated about halfway between Aachen and Cologne. Even before he entered the\nGymnasium\nin Bonn in\n1817\n, at the age of\n12\n, he had developed a passion for mathematics and spent his pocket-money on buying mathematics books. At the Gymnasium he was a model pupil being\n[\n1\n]\n:-\n... an unusually attentive and well-behaved pupil who was particularly interested in history as well as mathematics.\nAfter two years at the Gymnasium in Bonn his parents decided that they would rather have him attend the Jesuit College in Cologne and there he had the good fortune to be taught by\nOhm\n. By the age of\n16\nDirichlet had completed his school qualifications and was ready to enter university. However, the standards in German universities were not high at this time so Dirichlet decided to study in Paris. It is interesting to note that some years later the standards in German universities would become the best in the world and Dirichlet himself would play a hand in the transformation.\nDirichlet set off for France carrying with him\nGauss\n's\nDisquisitiones arithmeticae\nⓉ\n(\nInvestigations in arithmetic\n)\na work he treasured and kept constantly with him as others might do with the Bible. In Paris by May\n1822\n, Dirichlet soon contracted smallpox. It did not keep him away from his lectures in the Collège de France and the Faculté des Sciences for long and soon he could return to lectures. He had some of the leading mathematicians as teachers and he was able to profit greatly from the experience of coming in contact with\nBiot\n,\nFourier\n,\nFrancoeur\n,\nHachette\n,\nLaplace\n,\nLacroix\n,\nLegendre\n, and\nPoisson\n.\nFrom the summer of\n1823\nDirichlet was employed by General Maximilien Sébastien Foy, living in his house in Paris. General Foy had been a major figure in the army during the Napoleonic Wars, retiring after Napoleon's defeat at Waterloo. In\n1819\nhe was elected to the Chamber of Deputies where he was leader of the liberal opposition until his death. Dirichlet was very well treated by General Foy, he was well paid yet treated like a member of the family. In return Dirichlet taught German to General Foy's wife and children.\nDirichlet's first paper was to bring him instant fame since it concerned the famous\nFermat's Last Theorem\n. The theorem claimed that for\nn\n>\n2\nn > 2\nn\n>\n2\nthere are no non-zero integers\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nsuch that\nx\nn\n+\ny\nn\n=\nz\nn\nx^{n} + y^{n} = z^{n}\nx\nn\n+\ny\nn\n=\nz\nn\n. The cases\nn\n=\n3\nn = 3\nn\n=\n3\nand\nn\n=\n4\nn = 4\nn\n=\n4\nhad been proved by\nEuler\nand\nFermat\n, and Dirichlet attacked the theorem for\nn\n=\n5\nn = 5\nn\n=\n5\n. If\nn\n=\n5\nn = 5\nn\n=\n5\nthen one of\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nis even and one is divisible by\n5\n. There are two cases: case\n1\nis when the number divisible by\n5\nis even, while case\n2\nis when the even number and the one divisible by\n5\nare distinct. Dirichlet proved case\n1\nand presented his paper to the\nParis Academy\nin July\n1825\n.\nLegendre\nwas appointed one of the referees and he was able to prove case\n2\nthus completing the proof for\nn\n=\n5\nn = 5\nn\n=\n5\n. The complete proof was published in September\n1825\n. In fact Dirichlet was able to complete his own proof of the\nn\n=\n5\nn = 5\nn\n=\n5\ncase with an argument for case\n2\nwhich was an extension of his own argument for case\n1\n. It is worth noting that Dirichlet made a later contribution proving the\nn\n=\n14\nn = 14\nn\n=\n1\n4\ncase\n(\na near miss for the\nn\n=\n7\nn = 7\nn\n=\n7\ncase!\n)\n.\nOn\n28\nNovember\n1825\nGeneral Foy died and Dirichlet decided to return to Germany. He was encouraged in this by Alexander von Humboldt who made recommendations on his behalf. There was a problem for Dirichlet since in order to teach in a German university he needed an\nhabilitation\n. Although Dirichlet could easily submit an habilitation thesis, this was not allowed since he did not hold a doctorate, nor could he speak Latin, a requirement in the early nineteenth century. The problem was nicely solved by the University of Cologne giving Dirichlet an honorary doctorate, thus allowing him to submit his habilitation thesis on polynomials with a special class of\nprime\ndivisors to the University of Breslau. There was, however, much controversy over Dirichlet's appointment and the large correspondence between German professors both for and against his appointment is considered in\n[\n15\n]\n.\nFrom\n1827\nDirichlet taught at Breslau but Dirichlet encountered the same problem which made him choose Paris for his own education, namely that the standards at the university were low. Again with von Humboldt's help, he moved to the Berlin in\n1828\nwhere he was appointed at the Military College. The Military College was not the attraction, of course, rather it was that Dirichlet had an agreement that he would be able to teach at the University of Berlin. Soon after this he was appointed a professor at the University of Berlin where he remained from\n1828\nto\n1855\n. He retained his position in the Military College which made his teaching and other administrative duties rather heavier than he would have liked.\nDirichlet was appointed to the\nBerlin Academy\nin\n1831\nand an improving salary from the university put him in a position to marry, and he married Rebecca Mendelssohn, one of the composer Felix Mendelssohn's two sisters. Dirichlet had a lifelong friend in\nJacobi\n, who taught at Königsberg, and the two exerted considerable influence on each other in their researches in\nnumber theory\n.\nIn the\n1843\nJacobi\nbecame unwell and diabetes was diagnosed. He was advised by his doctor to spend time in Italy where the climate would help him recover. However,\nJacobi\nwas not a wealthy man and Dirichlet, after visiting\nJacobi\nand discovering his plight, wrote to Alexander von Humboldt asking him to help obtain some financial assistance for\nJacobi\nfrom Friedrich Wilhelm IV. Dirichlet then made a request for assistance from Friedrich Wilhelm IV, supported strongly by Alexander von Humboldt, which was successful. Dirichlet obtained leave of absence from Berlin for eighteen months and in the autumn of\n1843\nset off for Italy with\nJacobi\nand\nBorchardt\n. After stopping in several towns and attending a mathematical meeting in Lucca, they arrived in Rome on\n16\nNovember\n1843\n.\nSchläfli\nand\nSteiner\nwere also with them,\nSchläfli\n's main task being to act as their interpreter but he studied mathematics with Dirichlet as his tutor.\nDirichlet did not remain in Rome for the whole period, but visited Sicily and then spent the winter of\n1844\n/\n45\nin Florence before returning to Berlin in the spring of\n1845\n. Dirichlet had a high teaching load at the University of Berlin, being also required to teach in the Military College and in\n1853\nhe complained in a letter to his pupil\nKronecker\nthat he had thirteen lectures a week to give in addition to many other duties. It was therefore something of a relief when, on\nGauss\n's death in\n1855\n, he was offered his chair at Göttingen.\nDirichlet did not accept the offer from Göttingen immediately but used it to try to obtain better conditions in Berlin. He requested of the Prussian Ministry of Culture that he be allowed to end lecturing at the Military College. However he received no quick reply to his modest request so he wrote to Göttingen accepting the offer of\nGauss\n's chair. After he had accepted the Göttingen offer the Prussian Ministry of Culture did try to offer him improved conditions and salary but this came too late.\nThe quieter life in Göttingen seemed to suit Dirichlet. He had more time for research and some outstanding research students. However, sadly he was not to enjoy the new life for long. In the summer of\n1858\nhe lectured at a conference in Montreux but while in the Swiss town he suffered a heart attack. He returned to Göttingen, with the greatest difficulty, and while gravely ill had the added sadness that his wife died of a stroke.\nWe should now look at Dirichlet's remarkable contributions to mathematics. We have already commented on his contributions to Fermat's Last Theorem made in\n1825\n. Around this time he also published a paper inspired by\nGauss\n's work on the law of biquadratic reciprocity. Details are given in\n[\n13\n]\nwhere Rowe discusses the importance of the intellectual and personal relationship between\nGauss\nand Dirichlet.\nHe proved in\n1837\nthat in any\narithmetic progression\nwith first term\ncoprime\nto the difference there are infinitely many primes. This had been conjectured by\nLegendre\n.\nDavenport\nwrote in\n1967\n(\nsee\n[\n16\n]\n)\n:-\nAnalytic number theory\nmay be said to begin with the work of Dirichlet, and in particular with Dirichlet's memoir of\n1837\non the existence of primes in a given arithmetic progression.\nShortly after publishing this paper Dirichlet published two further papers on analytic number theory, one in\n1838\nwith the next in the following year. These papers introduce Dirichlet series and determine, among other things, the formula for the class number for quadratic forms.\nHis work on units in\nalgebraic number theory\nVorlesungen über Zahlentheorie\nⓉ\n(\nLectures on number theory\n)\n(\npublished\n1863)\ncontains important work on ideals. He also proposed in\n1837\nthe modern definition of a function:-\nIf a variable y is so related to a variable x that whenever a numerical value is assigned to x, there is a rule according to which a unique value of y is determined, then y is said to be a function of the independent variable x.\nIn mechanics he investigated the equilibrium of systems and\npotential theory\n. These investigations began in\n1839\nwith papers which gave methods to evaluate multiple integrals and he applied this to the problem of the gravitational attraction of an ellipsoid on points both inside and outside. He turned to\nLaplace\n's problem of proving the stability of the solar system and produced an analysis which avoided the problem of using series expansion with quadratic and higher terms disregarded. This work led him to the Dirichlet problem concerning harmonic functions with given\nboundary conditions\n. Some work on mechanics later in his career is of quite outstanding importance. In\n1852\nhe studied the problem of a sphere placed in an incompressible fluid, in the course of this investigation becoming the first person to integrate the hydrodynamic equations exactly.\nDirichlet is also well known for his papers on conditions for the convergence of trigonometric series and the use of the series to represent arbitrary functions. These series had been used previously by\nFourier\nin solving\ndifferential equations\n. Dirichlet's work is published in\nCrelle's Journal\nin\n1828\n. Earlier work by\nPoisson\non the convergence of\nFourier series\nwas shown to be non-rigorous by\nCauchy\n.\nCauchy\n's work itself was shown to be in error by Dirichlet who wrote of\nCauchy\n's paper:-\nThe author of this work himself admits that his proof is defective for certain functions for which the convergence is, however, incontestable.\nBecause of this work Dirichlet is considered the founder of the theory of\nFourier\nseries.\nRiemann\n, who was a student of Dirichlet, wrote in the introduction to his habilitation thesis on\nFourier\nseries that it was Dirichlet\n[\n11\n]\n:-\n... who wrote the first profound paper about the subject.\nIn\n[\n1\n]\nDirichlet's character and teaching qualities are summed up as follows:-\nHe was an excellent teacher, always expressing himself with great clarity. His manner was modest; in his later years he was shy and at times reserved. He seldom spoke at meetings and was reluctant to make public appearances.\nAt age\n45\nDirichlet was described by\nThomas Hirst\nas follows:-\nHe is a rather tall, lanky-looking man, with moustache and beard about to turn grey with a somewhat harsh voice and rather deaf. He was unwashed, with his cup of coffee and cigar. One of his failings is forgetting time, he pulls his watch out, finds it past three, and runs out without even finishing the sentence.\nKoch, in\n[\n11\n]\n, sums up Dirichlet's contribution writing that:-\n... important parts of mathematics were influenced by Dirichlet. His proofs characteristically started with surprisingly simple observations, followed by extremely sharp analysis of the remaining problem. With Dirichlet began the golden age of mathematics in Berlin."
}