{
  "nome_completo": "Leone Battista Alberti",
  "nome_curto": "Leone Battista Alberti",
  "ano_nascimento": "1404",
  "ano_morte": "1472",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alberti/",
  "lugar_nascimento": "Genoa, French Empire (now Italy)",
  "lugar_morte": "Rome, Papal States (now Italy)",
  "biografia": "Leone Battista Alberti\n's father was Lorenzo Alberti. We do not know who his mother was, and there is reason to believe that he was an illegitimate child. His father's family were wealthy and had been involved in banking and commercial business in Florence during the\n14\nth\ncentury. In fact the success of the city of Florence during this period is to a large extent a consequence of the success of the Alberti family, whose firm had branches spread widely through north Italy. Not content with their major financial achievements, however, members of the family became involved in politics. This turned out to be a disaster and the family was driven out of Florence after decrees were passed to exile them. It was for this reason that Lorenzo Alberti came to be living in Genoa at the time his son was born, for there he was safe yet still able to continue his wealthy life style within a local branch of the family firm.\nAs a child Leone Battista received his mathematical education from his father Lorenzo. However, when the plague struck Genoa, Lorenzo rapidly went with his children to Venice where the firm also had a major branch run by members of the Alberti family. However, Lorenzo died shortly after arriving in Venice and Leone Battista began living with one of his uncles. This arrangement was short-lived for the uncle soon vanished. It is likely that by this time members of the family were attempting by unscrupulous means to gain access to the family fortune. Leone Battista attended a school in Padua then, from\n1421\n, he attended the University of Bologna where he studied law but did not enjoy this topic. He became ill through overwork but still managed to gain a degree in canon law. It was around this time that he became interested in pursuing his mathematical studies, rather as a way to relax when stressed out by his law studies which he found made far too large demands on memory. Also around this time he wrote a comedy\nPhilodoxius\n(\nLover of Glory,\n1424)\n, composed in Latin verse.\nBy this time the decrees which had forced his family to flee from Florence had been revoked and Alberti went to live in the city where he met\nBrunelleschi\nand the two became good friends. They shared an interest in mathematics and, through\nBrunelleschi\n, Alberti became interested in architecture. At this stage, however, his interest was purely theoretical and he did not put his theories into practice. In\n1430\nAlberti began working for a cardinal of the Roman Catholic Church. This post meant that he travelled a lot, in particular to France, Belgium and Germany. In\n1432\nhe began following a literary career as a secretary in the Papal Chancery in Rome writing biographies of the saints in elegant Latin. Going to Rome was highly significant for Alberti, for there he fell in love with the ancient classical architecture which he saw all around. This led him to study not only classical architecture but also painting and sculpture. Alberti served Pope Eugene IV but this was a period of considerable weakness for the Papacy and military action against the Pope forced Eugene IV out of Rome on several occasions. Alberti left Rome with the Pope at such times and spent time at the court in Rimini. Nicholas V, who was Pope from\n1447\nto\n1455\n, was an enthusiast for classical studies and produced an environment much suited to Alberti who presented him with his book on architecture\nDe re aedificatoria\nin\n1452\n. Alberti modelled the book on the classical work by\nVitruvius\nand copied his format by dividing his text into ten books.\nVitruvius\n(1\nst\ncentury BC\n)\nwas the author of the famous treatise\nDe architectura\n(\nOn Architecture\n)\n. The methods of fortification which Alberti set out in the text were highly influential and were used in the fortification of towns for several hundred years. In\n1447\n, the year Nicholas V became Pope, Alberti became a canon of the Metropolitan Church of Florence and Abbot of Sant' Eremita of Pisa. Pope Nicholas V employed him on a number of major architectural projects and we describe below some of his remarkable buildings.\nAlberti studied the representation of\n3\n-dimensional objects and,  in\n1435\n, wrote the first general treatise\nDe Pictura\non the laws of perspective. This was first published in Latin but in the following year Alberti published an Italian version under the title\nDella pittura\n. The book was dedicated to\nBrunelleschi\nwho had indeed been a great inspiration to him. It was printed in\n1511\n. Simon writes in\n[\n13\n]\n:-\nAlberti explained and justified his method of perspective construction by using the metaphor of a window opening onto the world. The picture surface is conceived as intersecting the pyramid of vision without altering it.\nAlberti wrote about how he enjoyed applying mathematics to artistic undertakings:-\nNothing pleases me so much as mathematical investigations and demonstrations, especially when I can turn them to some useful practice drawing from mathematics the principles of painting perspective and some amazing propositions on the moving of weights .\nField\n[\n9\n]\nalso comments on how mathematics influenced the arts through the contributons of Alberti and others around the same period:-\nWhat we seem to be seeing in this progress of perspective towards the applied arts in the sixteenth century is the progress of mathematics as an increasingly important component in the training and practice of craftsmen in general, and of architects in particular.\nAlberti also worked on maps\n(\nagain involving his skill at geometrical mappings\n)\nand he collaborated with Paolo Toscanelli who supplied Columbus with the maps for his first voyage. He also wrote the first book on cryptography which contains the first example of a frequency table. In this area he introduced polyalphabetic substitution\n[\n10\n]\n. This is the method of cipher in which the\nk\nk\nk\nth letter of a text which is the\ni\ni\ni\nth letter in the alphabet is replaced by the\nj\nj\nj\nth letter of the alphabet where\nj\n=\nf\n(\ni\n,\nk\n)\nj = f (i, k)\nj\n=\nf\n(\ni\n,\nk\n)\nfor some function\nf\nf\nf\n. Polyalphabetic substitution was introduced into diplomatic practice by Alberti, who also invented a simple mechanical device to speed up coding and decoding, consisting of a fixed and a movable ring.\nAlberti is best known, however, as an architect. We mentioned above that Alberti spent time in Rimini and it was there that he designed the facade of the Tempio Malatestiano, his first attempt to put his theoretical ideas about architecture into practice. It was designed in the style of the Arch of Augustus in Rimini and is the first example in the history of art of a classical building becoming the model for a Renaissance one.\nGombrich writes\n[\n4\n]\n:-\nBrunelleschi's idea had been to introduce the forms of classical buildings, the columns, pediments and cornices which he had copied from Roman ruins. He had used these forms in his churches. His successors were eager to emulate him in this.\n[\nThe Church of S Andrea, Mantua, is\n]\na church planned by the Florentine architect Leone Battista Alberti, who conceived its facade as a gigantic triumphal arch in the Roman manner. But how was this new programme to be applied to an ordinary dwelling-house in a city street? No private houses had survived from Roman times, and even if they had, needs and customs had changed so much that they might have offered little guidance. The problem, then, was to find a compromise between the traditional house, with walls and windows, and the classical forms which\nBrunelleschi\nhad taught the architects to use. It was again Alberti who found the solution that remained influential up to our own days. When he built a palace for the rich Florentine merchant family Rucellai, he designed an ordinary three-storeyed building. There is little similarity between this facade and a classical ruin. And yet Alberti stuck to\nBrunelleschi\n's programme and used classical forms for the decoration of the facade. Instead of building columns or half-columns, he covered the house with a network of flat pilasters and entablatures which suggest a classical order without changing the structure of the building. ... Alberti ... merely 'translated' a Gothic design into classical forms by smoothing out the 'barbaric' pointed arch and using the elements of the classical order in a traditional context.\nThe Church of S Andrea, Mantua, which Gombrich comments on in the above quote, was designed by Alberti in\n1470\nand work on it began two years later. Alberti did not live to see his design take shape for he died in the year in which building started and by the time the facade and portico were in position he had been dead for\n18\nyears. The church is discussed in\n[\n5\n]\nwhere the author writes that Alberti's:-\n... avowed architectural aim, to schematise in the spatial form of the church the immanent, harmonious order of the world, found majestic realization in\n[\nhis\n]\nown church of Sant' Andrea in Mantua. This was his final architectural work ... and it carries out these theoretical ideas with perfect artistic clarity.\nAlberti made numerous innovations in his design with the traditional division into nave and aisles discarded in favour of providing a continuous space. There is certainly a mathematical flavour to the way that Alberti has sequences of small and large chapels alternating along the sides of the main space.\nIn addition to the Church of S Andrea, Mantua, Alberti had earlier articulated the facade of the Santa Maria Novella in Florence, which he began work on in\n1447\n, and the Palazzo Rucellai, mentioned in the quote of Gombrich above. Both works were undertaken for the Florence merchant Giovanni di Paolo Rucellai. The Palazzo Rucellai was designed between\n1446\nand\n1451\nand stands in the Via della Vigna. In the square, on the right, is the Loggia dei Rucellai built by Alberti in\n1460\nas a formal hall for the Rucellai family.\nAs to Alberti's character and appearance, Gille writes in\n[\n1\n]\n:-\nAlberti was, we are told, amiable, very handsome, and witty. He was adept at directing discussions and took pleasure in organising small conversational groups.\nIn fact Alberti wrote some autobiographical notes which survive in which he boasts of his physical abilities. He claimed he was capable of:-\n... standing with his feet together, and springing over a man's head.\nIn a similar vein he also claimed that he:-\n... excelled in all bodily exercises; could, with feet tied, leap over a standing man; could in the great cathedral, throw a coin far up to ring against the vault; amused himself by taming wild horses and climbing mountains.\nEven if untrue, these delightful quotes tell us much of Alberti's personality."
}