{
  "nome_completo": "Leonhard Euler",
  "nome_curto": "Leonhard Euler",
  "ano_nascimento": "1707",
  "ano_morte": "1783",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Euler/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "St Petersburg, Russia",
  "biografia": "Leonhard Euler\n's father was Paul Euler. Paul Euler had studied theology at the University of Basel and had attended\nJacob Bernoulli\n's lectures there. In fact Paul Euler and\nJohann Bernoulli\nhad both lived in\nJacob Bernoulli\n's house while undergraduates at Basel. Paul Euler became a Protestant minister and married Margaret Brucker, the daughter of another Protestant minister. Their son Leonhard Euler was born in Basel, but the family moved to Riehen when he was one year old and it was in Riehen, not far from Basel, that Leonard was brought up. Paul Euler had, as we have mentioned, some mathematical training and he was able to teach his son elementary mathematics along with other subjects.\nLeonhard was sent to school in Basel and during this time he lived with his grandmother on his mother's side. This school was a rather poor one, by all accounts, and Euler learnt no mathematics at all from the school. However his interest in mathematics had certainly been sparked by his father's teaching, and he read mathematics texts on his own and took some private lessons. Euler's father wanted his son to follow him into the church and sent him to the University of Basel to prepare for the ministry. He entered the University in\n1720\n, at the age of\n14\n, first to obtain a general education before going on to more advanced studies.\nJohann Bernoulli\nsoon discovered Euler's great potential for mathematics in private tuition that Euler himself engineered. Euler's own account given in his unpublished autobiographical writings, see\n[\n1\n]\n, is as follows:-\n... I soon found an opportunity to be introduced to a famous professor\nJohann Bernoulli\n. ... True, he was very busy and so refused flatly to give me private lessons; but he gave me much more valuable advice to start reading more difficult mathematical books on my own and to study them as diligently as I could; if I came across some obstacle or difficulty, I was given permission to visit him freely every Sunday afternoon and he kindly explained to me everything I could not understand ...\nIn\n1723\nEuler completed his Master's degree in philosophy having compared and contrasted the philosophical ideas of\nDescartes\nand\nNewton\n. He began his study of theology in the autumn of\n1723\n, following his father's wishes, but, although he was to be a devout Christian all his life, he could not find the enthusiasm for the study of theology, Greek and Hebrew that he found in mathematics. Euler obtained his father's consent to change to mathematics after\nJohann Bernoulli\nhad used his persuasion. The fact that Euler's father had been a friend of\nJohann Bernoulli\n's in their undergraduate days undoubtedly made the task of persuasion much easier.\nEuler completed his studies at the University of Basel in\n1726\n. He had studied many mathematical works during his time in Basel, and Calinger\n[\n24\n]\nhas reconstructed many of the works that Euler read with the advice of\nJohann Bernoulli\n. They include works by\nVarignon\n,\nDescartes\n,\nNewton\n,\nGalileo\n,\nvan Schooten\n,\nJacob Bernoulli\n,\nHermann\n,\nTaylor\nand\nWallis\n. By\n1726\nEuler had already a paper in print, a short article on isochronous curves in a resisting medium. In\n1727\nhe published another article on reciprocal trajectories and submitted an entry for the\n1727\nGrand Prize of the\nParis Academy\non the best arrangement of masts on a ship.\nThe Prize of\n1727\nwent to\nBouguer\n, an expert on mathematics relating to ships, but Euler's essay won him second place which was a fine achievement for the young graduate. However, Euler now had to find himself an academic appointment and when\nNicolaus\n(\nII\n)\nBernoulli\ndied in St Petersburg in July\n1726\ncreating a vacancy there, Euler was offered the post which would involve him in teaching applications of mathematics and mechanics to physiology. He accepted the post in November\n1726\nbut stated that he did not want to travel to Russia until the spring of the following year. He had two reasons to delay. He wanted time to study the topics relating to his new post but also he had a chance of a post at the University of Basel since the professor of physics there had died. Euler wrote an article on acoustics, which went on to become a classic, in his bid for selection to the post but he was not chosen to go forward to the stage where lots were drawn to make the final decision on who would fill the chair. Almost certainly his youth\n(\nhe was\n19\nat the time\n)\nwas against him. However Calinger\n[\n24\n]\nsuggests:-\nThis decision ultimately benefited Euler, because it forced him to move from a small republic into a setting more adequate for his brilliant research and technological work.\nAs soon as he knew he would not be appointed to the chair of physics, Euler left Basel on\n5\nApril\n1727\n. He travelled down the Rhine by boat, crossed the German states by post wagon, then by boat from Lübeck arriving in St Petersburg on\n17\nMay\n1727\n. He had joined the\nSt Petersburg Academy of Sciences\ntwo years after it had been founded by Catherine I the wife of Peter the Great. Through the requests of\nDaniel Bernoulli\nand\nJakob Hermann\n, Euler was appointed to the mathematical-physical division of the Academy rather than to the physiology post he had originally been offered. At St Petersburg Euler had many colleagues who would provide an exceptional environment for him\n[\n1\n]\n:-\nNowhere else could he have been surrounded by such a group of eminent scientists, including the analyst, geometer\nJakob Hermann\n, a relative;\nDaniel Bernoulli\n, with whom Euler was connected not only by personal friendship but also by common interests in the field of applied mathematics; the versatile scholar\nChristian Goldbach\n, with whom Euler discussed numerous problems of analysis and the theory of numbers; F Maier, working in trigonometry; and the astronomer and geographer J-N Delisle.\nEuler served as a medical lieutenant in the Russian navy from\n1727\nto\n1730\n. In St Petersburg he lived with\nDaniel Bernoulli\nwho, already unhappy in Russia, had requested that Euler bring him tea, coffee, brandy and other delicacies from Switzerland. Euler became professor of physics at the Academy in\n1730\nand, since this allowed him to become a full member of the Academy, he was able to give up his Russian navy post.\nDaniel Bernoulli\nheld the senior chair in mathematics at the Academy but when he left St Petersburg to return to Basel in\n1733\nit was Euler who was appointed to this senior chair of mathematics. The financial improvement which came from this appointment allowed Euler to marry which he did on\n7\nJanuary\n1734\n, marrying Katharina Gsell, the daughter of a painter from the St Petersburg\nGymnasium\n. Katharina, like Euler, was from a Swiss family. They had\n13\nchildren altogether although only five survived their infancy. Euler claimed that he made some of his greatest mathematical discoveries while holding a baby in his arms with other children playing round his feet.\nWe will examine Euler's mathematical achievements later in this article but at this stage it is worth summarising Euler's work in this period of his career. This is done in\n[\n24\n]\nas follows:-\n... after\n1730\nhe carried out state projects dealing with cartography, science education, magnetism, fire engines, machines, and ship building. ... The core of his research program was now set in place:\nnumber theory\n; infinitary analysis including its emerging branches,\ndifferential equations\nand the\ncalculus of variations\n; and rational mechanics. He viewed these three fields as intimately interconnected. Studies of number theory were vital to the foundations of calculus, and\nspecial functions\nand differential equations were essential to rational mechanics, which supplied concrete problems.\nThe publication of many articles and his book\nMechanica\n(1736\n-\n37)\n, which extensively presented Newtonian dynamics in the form of mathematical analysis for the first time, started Euler on the way to major mathematical work.\nEuler's health problems began in\n1735\nwhen he had a severe fever and almost lost his life. However, he kept this news from his parents and members of the Bernoulli family back in Basel until he had recovered. In his autobiographical writings Euler says that his eyesight problems began in\n1738\nwith overstrain due to his cartographic work and that by\n1740\nhe had\n[\n24\n]\n:-\n... lost an eye and\n[\nthe other\n]\ncurrently may be in the same danger.\nHowever, Calinger in\n[\n24\n]\nargues that Euler's eyesight problems almost certainly started earlier and that the severe fever of\n1735\nwas a symptom of the eyestrain. He also argues that a portrait of Euler from\n1753\nsuggests that by that stage the sight of his left eye was still good while that of his right eye was poor but not completely blind. Calinger suggests that Euler's left eye became blind from a later cataract rather than eyestrain.\nBy\n1740\nEuler had a very high reputation, having won the Grand Prize of the\nParis Academy\nin\n1738\nand\n1740\n. On both occasions he shared the first prize with others. Euler's reputation was to bring an offer to go to Berlin, but at first he preferred to remain in St Petersburg. However political turmoil in Russia made the position of foreigners particularly difficult and contributed to Euler changing his mind. Accepting an improved offer Euler, at the invitation of Frederick the Great, went to Berlin where an\nAcademy of Science\nwas planned to replace the Society of Sciences. He left St Petersburg on\n19\nJune\n1741\n, arriving in Berlin on\n25\nJuly. In a letter to a friend Euler wrote:-\nI can do just what I wish\n[\nin my research\n]\n... The king calls me his professor, and I think I am the happiest man in the world.\nEven while in Berlin Euler continued to receive part of his salary from Russia. For this remuneration he bought books and instruments for the\nSt Petersburg Academy\n, he continued to write scientific reports for them, and he educated young Russians.\nMaupertuis\nwas the president of the\nBerlin Academy\nwhen it was founded in\n1744\nwith Euler as director of mathematics. He deputised for\nMaupertuis\nin his absence and the two became great friends. Euler undertook an unbelievable amount of work for the Academy\n[\n1\n]\n:-\n... he supervised the observatory and the botanical gardens; selected the personnel; oversaw various financial matters; and, in particular, managed the publication of various calendars and geographical maps, the sale of which was a source of income for the Academy. The king also charged Euler with practical problems, such as the project in\n1749\nof correcting the level of the Finow Canal ... At that time he also supervised the work on pumps and pipes of the hydraulic system at Sans Souci, the royal summer residence.\nThis was not the limit of his duties by any means. He served on the committee of the Academy dealing with the library and of scientific publications. He served as an advisor to the government on state lotteries, insurance, annuities and pensions and artillery. On top of this his scientific output during this period was phenomenal.\nDuring the twenty-five years spent in Berlin, Euler wrote around\n380\narticles. He wrote books on the calculus of variations; on the calculation of planetary orbits; on artillery and ballistics\n(\nextending the book by\nRobins\n)\n; on analysis; on shipbuilding and navigation; on the motion of the moon; lectures on the differential calculus; and a popular scientific publication\nLetters to a Princess of Germany\n(3\nvols.,\n1768\n-\n72)\n.\nSee\nTHIS LINK\n.\nIn\n1759\nMaupertuis\ndied and Euler assumed the leadership of the\nBerlin Academy\n, although not the title of President. The king was in overall charge and Euler was not now on good terms with Frederick despite the early good favour. Euler, who had argued with\nd'Alembert\non scientific matters, was disturbed when Frederick offered\nd'Alembert\nthe presidency of the Academy in\n1763\n. However\nd'Alembert\nrefused to move to Berlin but Frederick's continued interference with the running of the Academy made Euler decide that the time had come to leave.\nIn\n1766\nEuler returned to St Petersburg and Frederick was greatly angered at his departure. Soon after his return to Russia, Euler became almost entirely blind after an illness. In\n1771\nhis home was destroyed by fire and he was able to save only himself and his mathematical manuscripts. A cataract operation shortly after the fire, still in\n1771\n, restored his sight for a few days but Euler seems to have failed to take the necessary care of himself and he became totally blind. Because of his remarkable memory he was able to continue with his work on optics, algebra, and lunar motion. Amazingly after his return to St Petersburg\n(\nwhen Euler was\n59)\nhe produced almost half his total works despite the total blindness.\nEuler of course did not achieve this remarkable level of output without help. He was helped by his sons, Johann Albrecht Euler who was appointed to the chair of physics at the\nAcademy in St Petersburg\nin\n1766\n(\nbecoming its secretary in\n1769)\nand Christoph Euler who had a military career. Euler was also helped by two other members of the Academy, W L Krafft and A J\nLexell\n, and the young mathematician\nN Fuss\nwho was invited to the Academy from Switzerland in\n1772\n.\nFuss\n, who was Euler's grandson-in-law, became his assistant in\n1776\n.\nYushkevich\nwrites in\n[\n1\n]\n:-\n.. the scientists assisting Euler were not mere secretaries; he discussed the general scheme of the works with them, and they developed his ideas, calculating tables, and sometimes compiled examples.\nFor example Euler credits Albrecht, Krafft and\nLexell\nfor their help with his\n775\npage work on the motion of the moon, published in\n1772\n.\nFuss\nhelped Euler prepare over\n250\narticles for publication over a period on about seven years in which he acted as Euler's assistant, including an important work on insurance which was published in\n1776\n.\nHe also wrote a eulogy of Euler, which you can see at\nTHIS LINK\n.\nYushkevich\ndescribes the day of Euler's death in\n[\n1\n]\n:-\nOn\n18\nSeptember\n1783\nEuler spent the first half of the day as usual. He gave a mathematics lesson to one of his grandchildren, did some calculations with chalk on two boards on the motion of balloons; then discussed with\nLexell\nand\nFuss\nthe recently discovered planet Uranus. About five o'clock in the afternoon he suffered a brain haemorrhage and uttered only \"I am dying\" before he lost consciousness. He died about eleven o'clock in the evening.\nAfter his death in\n1783\nthe\nSt Petersburg Academy\ncontinued to publish Euler's unpublished work for nearly\n50\nmore years.\nEuler's work in mathematics is so vast that an article of this nature cannot but give a very superficial account of it. He was the most prolific writer of mathematics of all time. He made large bounds forward in the study of modern analytic geometry and trigonometry where he was the first to consider sin, cos etc. as functions rather than as chords as\nPtolemy\nhad done.\nHe made decisive and formative contributions to geometry, calculus and number theory. He integrated\nLeibniz\n's differential calculus and Newton's method of fluxions into mathematical analysis. He introduced\nbeta\nand\ngamma functions\n, and\nintegrating factors\nfor differential equations. He studied continuum mechanics, lunar theory with\nClairaut\n, the\nthree body problem\n, elasticity, acoustics, the wave theory of light, hydraulics, and music. He laid the foundation of analytical mechanics, especially in his\nTheory of the Motions of Rigid Bodies\n(1765)\n.\nWe owe to Euler the notation\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nfor a function\n(1734)\n,\ne\ne\ne\nfor the base of natural logs\n(1727)\n,\ni\ni\ni\nfor the square root of -\n1\n(1777)\n,\nπ\n\\pi\nπ\nfor pi,\n∑\n\\sum\n∑\nfor summation\n(1755)\n, the notation for finite differences\nΔ\ny\n\\Delta  y\nΔ\ny\nand\nΔ\n2\ny\n\\Delta ^{2} y\nΔ\n2\ny\nand many others.\nLet us examine in a little more detail some of Euler's work. Firstly his work in number theory seems to have been stimulated by\nGoldbach\nbut probably originally came from the interest that the Bernoullis had in that topic.\nGoldbach\nasked Euler, in\n1729\n, if he knew of\nFermat\n's conjecture that the numbers\n2\nn\n+\n1\n2^{n} + 1\n2\nn\n+\n1\nwere always\nprime\nif\nn\nn\nn\nis a power of\n2\n. Euler verified this for\nn\nn\nn\n=\n1\n,\n2\n,\n4\n,\n8\nand\n16\nand, by\n1732\nat the latest, showed that the next case\n2\n32\n+\n1\n=\n4294967297\n2^{32} + 1 = 4294967297\n2\n3\n2\n+\n1\n=\n4\n2\n9\n4\n9\n6\n7\n2\n9\n7\nis divisible by\n641\nand so is not prime. Euler also studied other unproved results of\nFermat\nand in so doing introduced the Euler phi function\nϕ\n(\nn\n)\n\\phi(n)\nϕ\n(\nn\n)\n, the number of integers\nk\nk\nk\nwith\n1\n≤\nk\n≤\nn\n1 ≤ k ≤ n\n1\n≤\nk\n≤\nn\nand\nk\nk\nk\ncoprime\nto\nn\nn\nn\n. He proved another of\nFermat\n's assertions, namely that if\na\na\na\nand\nb\nb\nb\nare coprime then\na\n2\n+\nb\n2\na^{2} + b^{2}\na\n2\n+\nb\n2\nhas no divisor of the form\n4\nn\n−\n1\n4n - 1\n4\nn\n−\n1\n, in\n1749\n.\nPerhaps the result that brought Euler the most fame in his young days was his solution of what had become known as the Basel problem. This was to find a closed form for the sum of the infinite series\nζ\n(\n2\n)\n=\n∑\n1\nn\n2\n\\zeta(2) = \\sum  \\Large\\frac 1 {n^{2}}\nζ\n(\n2\n)\n=\n∑\nn\n2\n1\n​\n, a problem which had defeated many of the top mathematicians including\nJacob Bernoulli\n,\nJohann Bernoulli\nand\nDaniel Bernoulli\n. The problem had also been studied unsuccessfully by\nLeibniz\n,\nStirling\n,\nde Moivre\nand others. Euler showed in\n1735\nthat\nζ\n(\n2\n)\n=\n1\n6\nπ\n2\n\\zeta(2) = \\large\\frac{1}{6}\\normalsize \\pi^{2}\nζ\n(\n2\n)\n=\n6\n1\n​\nπ\n2\nbut he went on to prove much more, namely that\nζ\n(\n4\n)\n=\n1\n90\nπ\n4\n,\nζ\n(\n6\n)\n=\n1\n945\nπ\n6\n,\nζ\n(\n8\n)\n=\n1\n9450\nπ\n8\n,\nζ\n(\n10\n)\n=\n1\n93555\nπ\n10\n\\zeta(4) = \\large\\frac{1}{90}\\normalsize \\pi^{4}, \\zeta(6) = \\large\\frac{1}{945}\\normalsize \\pi^{6}, \\zeta(8) = \\large\\frac{1}{9450}\\normalsize \\pi^{8}, \\zeta(10) = \\large\\frac{1}{93555}\\normalsize \\pi^{10}\nζ\n(\n4\n)\n=\n9\n0\n1\n​\nπ\n4\n,\nζ\n(\n6\n)\n=\n9\n4\n5\n1\n​\nπ\n6\n,\nζ\n(\n8\n)\n=\n9\n4\n5\n0\n1\n​\nπ\n8\n,\nζ\n(\n1\n0\n)\n=\n9\n3\n5\n5\n5\n1\n​\nπ\n1\n0\nand\nζ\n(\n12\n)\n=\n691\n638512875\nπ\n12\n\\zeta(12) = \\large\\frac{691}{638512875}\\normalsize \\pi^{12}\nζ\n(\n1\n2\n)\n=\n6\n3\n8\n5\n1\n2\n8\n7\n5\n6\n9\n1\n​\nπ\n1\n2\n. In\n1737\nhe proved the connection of the\nzeta function\nwith the series of prime numbers giving the famous relation\nζ\n(\ns\n)\n=\n∑\n1\nn\ns\n=\n∏\n1\n1\n−\np\n−\ns\n\\zeta(s) = \\sum  \\Large\\frac 1 {n^{s}}\\normalsize = \\prod \\Large\\frac 1 {1- p^{-s}}\nζ\n(\ns\n)\n=\n∑\nn\ns\n1\n​\n=\n∏\n1\n−\np\n−\ns\n1\n​\nHere the sum is over all natural numbers\nn\nn\nn\nwhile the product is over all prime numbers.\nBy\n1739\nEuler had found the\nrational\ncoefficients\nC\nC\nC\nin\nζ\n(\n2\nn\n)\n=\nC\nπ\n2\nn\n\\zeta(2n) = C\\pi^{2n}\nζ\n(\n2\nn\n)\n=\nC\nπ\n2\nn\nin terms of the\nBernoulli numbers\n.\nOther work done by Euler on infinite series included the introduction of his famous Euler's constant γ, in\n1735\n, which he showed to be the limit of\n1\n1\n+\n1\n2\n+\n1\n3\n+\n.\n.\n.\n+\n1\nn\n−\nlog\n⁡\ne\nn\n\\large\\frac{1}{1}\\normalsize  + \\large\\frac{1}{2}\\normalsize  + \\large\\frac{1}{3}\\normalsize  + ... + \\large\\frac{1}{n}\\normalsize  - \\log_{e}n\n1\n1\n​\n+\n2\n1\n​\n+\n3\n1\n​\n+\n.\n.\n.\n+\nn\n1\n​\n−\nlo\ng\ne\n​\nn\nas\nn\nn\nn\ntends to infinity. He calculated the constant γ to\n16\ndecimal places. Euler also studied\nFourier series\nand in\n1744\nhe was the first to express an algebraic function by such a series when he gave the result\n1\n2\nπ\n−\n1\n2\nx\n=\nsin\n⁡\nx\n+\n1\n2\n(\nsin\n⁡\n2\nx\n)\n+\n1\n3\n(\nsin\n⁡\n3\nx\n)\n+\n.\n.\n.\n\\large\\frac{1}{2}\\normalsize \\pi - \\large\\frac{1}{2}\\normalsize x = \\sin x + \\large\\frac{1}{2}\\normalsize (\\sin 2x) + \\large\\frac{1}{3}\\normalsize (\\sin 3x) + ...\n2\n1\n​\nπ\n−\n2\n1\n​\nx\n=\nsin\nx\n+\n2\n1\n​\n(\nsin\n2\nx\n)\n+\n3\n1\n​\n(\nsin\n3\nx\n)\n+\n.\n.\n.\nin a letter to\nGoldbach\n. Like most of Euler's work there was a fair time delay before the results were published; this result was not published until\n1755\n.\nEuler wrote to\nJames Stirling\non\n8\nJune\n1736\ntelling him about his results on summing reciprocals of powers, the harmonic series and Euler's constant and other results on series. In particular he wrote\n[\n60\n]\n:-\nConcerning the summation of very slowly converging series, in the past year I have lectured to our Academy on a special method of which I have given the sums of very many series sufficiently accurately and with very little effort.\nHe then goes on to describe what is now called the Euler-\nMaclaurin\nsummation formula. Two years later\nStirling\nreplied telling Euler that\nMaclaurin\n:-\n... will be publishing a book on fluxions. ... he has two theorems for summing series by means of derivatives of the terms, one of which is the self-same result that you sent me.\nEuler replied:-\n... I have very little desire for anything to be detracted from the fame of the celebrated Mr\nMaclaurin\nsince he probably came upon the same theorem for summing series before me, and consequently deserves to be named as its first discoverer. For I found that theorem about four years ago, at which time I also described its proof and application in greater detail to our Academy.\nSome of Euler's number theory results have been mentioned above. Further important results in number theory by Euler included his proof of\nFermat's Last Theorem\nfor the case of\nn\n=\n3\nn = 3\nn\n=\n3\n. Perhaps more significant than the result here was the fact that he introduced a proof involving numbers of the form\na\n+\nb\n√\n−\n3\na + b√-3\na\n+\nb\n√\n−\n3\nfor integers\na\na\na\nand\nb\nb\nb\n. Although there were problems with his approach this eventually led to\nKummer\n's major work on\nFermats Last Theorem\nand to the introduction of the concept of a\nring\n.\nOne could claim that mathematical analysis began with Euler. In\n1748\nin\nIntroductio in analysin infinitorum\nEuler made ideas of\nJohann Bernoulli\nmore precise in defining a function, and he stated that mathematical analysis was the study of functions. This work bases the calculus on the theory of elementary functions rather than on geometric curves, as had been done previously. Also in this work Euler gave the formula\ne\ni\nx\n=\ncos\n⁡\nx\n+\ni\nsin\n⁡\nx\ne^{ix} = \\cos x + i \\sin x\ne\ni\nx\n=\ncos\nx\n+\ni\nsin\nx\n.\nIn\nIntroductio in analysin infinitorum\nEuler dealt with logarithms of a variable taking only positive values although he had discovered the formula\nln\n⁡\n(\n−\n1\n)\n=\nπ\ni\n\\ln(-1) = \\pi i\nln\n(\n−\n1\n)\n=\nπ\ni\nin\n1727\n. He published his full theory of logarithms of complex numbers in\n1751\n.\nAnalytic functions of a complex variable were investigated by Euler in a number of different contexts, including the study of orthogonal trajectories and cartography. He discovered the\nCauchy\n-\nRiemann\nequations in\n1777\n, although\nd'Alembert\nhad discovered them in\n1752\nwhile investigating hydrodynamics.\nIn\n1755\nEuler published\nInstitutiones calculi differentialis\nwhich begins with a study of the calculus of finite differences. The work makes a thorough investigation of how differentiation behaves under substitutions.\nIn\nInstitutiones calculi integralis\n(1768\n-\n70)\nEuler made a thorough investigation of integrals which can be expressed in terms of elementary functions. He also studied beta and gamma functions, which he had introduced first in\n1729\n.\nLegendre\ncalled these 'Eulerian integrals of the first and second kind' respectively while they were given the names beta function and gamma function by\nBinet\nand\nGauss\nrespectively. As well as investigating double integrals, Euler considered\nordinary\nand\npartial differential equations\nin this work.\nThe calculus of variations is another area in which Euler made fundamental discoveries. His work\nMethodus inveniendi lineas curvas\nⓉ\n(\nA method for curves\n)\n... published in\n1740\nbegan the proper study of the calculus of variations. In\n[\n12\n]\nit is noted that\nCarathéodory\nconsidered this as:-\n... one of the most beautiful mathematical works ever written.\nProblems in mathematical physics had led Euler to a wide study of differential equations. He considered linear equations with constant coefficients, second order differential equations with variable coefficients, power series solutions of differential equations, a method of variation of constants, integrating factors, a method of approximating solutions, and many others. When considering vibrating membranes, Euler was led to the\nBessel\nequation which he solved by introducing\nBessel functions\n.\nEuler made substantial contributions to\ndifferential geometry\n, investigating the theory of surfaces and curvature of surfaces. Many unpublished results by Euler in this area were rediscovered by\nGauss\n. Other geometric investigations led him to fundamental ideas in\ntopology\nsuch as the Euler characteristic of a polyhedron.\nIn\n1736\nEuler published\nMechanica\nwhich provided a major advance in mechanics. As\nYushkevich\nwrites in\n[\n1\n]\n:-\nThe distinguishing feature of Euler's investigations in mechanics as compared to those of his predecessors is the systematic and successful application of analysis. Previously the methods of mechanics had been mostly synthetic and geometrical; they demanded too individual an approach to separate problems. Euler was the first to appreciate the importance of introducing uniform analytic methods into mechanics, thus enabling its problems to be solved in a clear and direct way.\nIn\nMechanica\nEuler considered the motion of a point mass both in a vacuum and in a resisting medium. He analysed the motion of a point mass under a central force and also considered the motion of a point mass on a surface. In this latter topic he had to solve various problems of differential geometry and geodesics.\nMechanica\nwas followed by another important work in rational mechanics, this time Euler's two volume work on naval science. It is described in\n[\n24\n]\nas:-\nOutstanding in both theoretical and applied mechanics, it addresses Euler's intense occupation with the problem of ship propulsion. It applies variational principles to determine the optimal ship design and first established the principles of hydrostatics ... Euler here also begins developing the kinematics and dynamics of rigid bodies, introducing in part the differential equations for their motion.\nOf course hydrostatics had been studied since\nArchimedes\n, but Euler gave a definitive version.\nIn\n1765\nEuler published another major work on mechanics\nTheoria motus corporum solidorum\nⓉ\n(\nTheory of the motion of solid bodies\n)\nin which he decomposed the motion of a solid into a rectilinear motion and a rotational motion. He considered the Euler angles and studied rotational problems which were motivated by the problem of the\nprecession of the equinoxes\n.\nEuler's work on fluid mechanics is also quite remarkable. He published a number of major pieces of work through the\n1750\ns setting up the main formulae for the topic, the continuity equation, the\nLaplace\nvelocity potential equation, and the Euler equations for the motion of an inviscid incompressible fluid. In\n1752\nhe wrote:-\nHowever sublime are the researches on fluids which we owe to Messrs Bernoulli,\nClairaut\nand\nd'Alembert\n, they flow so naturally from my two general formulae that one cannot sufficiently admire this accord of their profound meditations with the simplicity of the principles from which I have drawn my two equations ...\nEuler contributed to knowledge in many other areas, and in all of them he employed his mathematical knowledge and skill. He did important work in astronomy including\n[\n1\n]\n:-\n... determination of the orbits of comets and planets by a few observations, methods of calculation of the\nparallax\nof the sun, the theory of refraction, consideration of the physical nature of comets, .... His most outstanding works, for which he won many prizes from the Paris\nAcadémie des Sciences\n, are concerned with celestial mechanics, which especially attracted scientists at that time.\nIn fact Euler's lunar theory was used by\nTobias Mayer\nin constructing his tables of the moon. In\n1765\nMayer\n's widow received £\n3000\nfrom Britain for the contribution the tables made to the problem of the determination of the longitude, while Euler received £\n300\nfrom the British government for his theoretical contribution to the work.\nEuler also published on the theory of music, in particular he published\nTentamen novae theoriae musicae\nⓉ\n(\nA new musical theory\n)\nin\n1739\nin which he tried to make music:-\n... part of mathematics and deduce in an orderly manner, from correct principles, everything which can make a fitting together and mingling of tones pleasing.\nHowever, according to\n[\n8\n]\nthe work was:-\n... for musicians too advanced in its mathematics and for mathematicians too musical.\nCartography was another area that Euler became involved in when he was appointed director of the\nSt Petersburg Academy\n's geography section in\n1735\n. He had the specific task of helping Delisle prepare a map of the whole of the Russian Empire. The\nRussian Atlas\nwas the result of this collaboration and it appeared in\n1745\n, consisting of\n20\nmaps. Euler, in Berlin by the time of its publication, proudly remarked that this work put the Russians well ahead of the Germans in the art of cartography."
}