{
  "nome_completo": "Leone Minna Gold Burton",
  "nome_curto": "Leone Burton",
  "ano_nascimento": "1936",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burton/",
  "lugar_nascimento": "Sydney, Australia",
  "lugar_morte": "Cambridge, England",
  "biografia": "Leone Burton\nwas given the name Leone Minna Gold. Her parents were Jewish and lived in Scotland, but her maternal grandparents, Marcus and Minna Levy, were Lithuanian, emigrating to Britain in the early years of the\n20\nth century. Marcus Levy\n(\nborn about\n1862)\nbecame a picture frame maker and dealer in paintings in Edinburgh. Leone was given the name Minna after this grandmother. There was exceptional mathematical talent in the family with Marcus and Minna Levy's son, Leone's uncle, being\nHyman Levy\n. The Gold family were Jewish and seeing the very public displays of anti-Semitism in Germany, and fearing these would spread across the whole of Europe, they left Scotland and emigrated to Australia. They settled in Sydney where Leone was born.\nLeone attended all-girl schools in Australia, both primary and secondary, and in these schools she was taught exclusively by female teachers. Although she was quite good at mathematics, the subject certainly did not stand out. In fact her schooling did not produce any real enthusiasm for any of the subjects she studied and her English teacher was highly critical of her ability to write. After graduating from secondary school, she entered university on an arts based course. Shortly after beginning the course her health failed and she had to give up. Taking some time to regain her health, she then worked to allow her to save enough money to travel, the one thing she felt sure that she wanted to do.\nOn\n25\nJanuary\n1957\n, when she was twenty years old, she sailed on the ship\nOrsova\nfrom Sydney, Australia. The ship docked in Auckland on\n28\nJanuary, then continued sailing to the United States, reaching San Francisco, California, on\n14\nFebruary. From San Francisco, Leone travelled across the United States, ending up eventually in New York. To earn some money to help finance her travels, Leone gave talks about Australia. After a period in New York, she continued her journey to England going to London where her uncle\nHyman Levy\nwas living.\nLevy\nhad been Head of the Mathematics and Mechanics Department of Imperial College of Science and Technology, London, but had retired in\n1955\n, a few years before Leone came to London. His wife, Marion Aitken Fraser, was an \"upright Scottish Protestant\" and Leone quickly became very fond of her. The Levys were very left-wing politically and\nHyman Levy\nhad been a member of the British Communist Party but, after a visit to Russia in\n1956\n, he discovered the persecution of Russian Jews and, after writing about this when back in England, he had been expelled from the British Communist Party. Leone's contacts with the Levys and their friends made a big impression on her and she loved the political and academic discussions. In an environment where there were lots of ideas, yet one in which she had time to think about her own future, Leone decided that she wanted to return to education.\nUp to this time Leone had no idea what career she wanted but she now decided that what she wanted to do was to teach. Although her own schooling had failed to give her an enthusiasm for mathematics, nevertheless, her contacts with her mathematician uncle had made her think that this was the subject she wanted to teach so she entered the University of London to read for a degree in mathematics. Charlene Morrow writes\n[\n3\n]\n:-\nAt that time, Leone was particularly interested in the philosophical aspects of mathematics. ... In preparation for her first course in mathematics, she read the classic volume by\nRussell\nand\nWhitehead\n, 'Principia Mathematica'. During the first week she\n(\none of two women in a class of twenty-five students\n)\nasked a question to which the reply was, \"You are here to study mathematics, not philosophy!\" The professor then slammed his book closed and left the class. Leone nearly changed her area of study but decided not to allow herself to be intimidated. She became even more committed to participating in mathematics ...\nWhile studying at the University of London, Leone lived at\n5\nCamden Court, Rousden Street, St Pancras, Camden. She shared this accommodation with another University of London student, Claire N Edelman, who received a medical degree from the University of London in\n1965\n. Leone graduated from the University of London with a degree in mathematics in\n1963\nand, immediately after finishing the course, she flew back to Australia on\n13\nJuly\n1963\n, flying from London to Fremantle, Western Australia, on Qantas Empire Airways. Returning to England, she became a secondary school teacher but, in parallel, began working for her postgraduate certificate of education at the University of London. Her experiences teaching mathematics at secondary school level were mixed; she enjoyed interacting with the children but she disliked the system and felt that she could not teach mathematics the way she wanted to within the system. She therefore gave up her position teaching mathematics at secondary level and became a primary school teacher.\nIn\n1966\nshe was awarded a Postgraduate Certificate in Education from the University of London. Around May\n1966\nshe married John W Burton and they settled on a farm in Kent where their son Mark Burton was born in\n1968\n. We note that the marriage did not last long and Leone Burton essentially brought up her son Mark herself. Also in\n1968\nshe graduated with a Diploma in Education from the University of London and, in the following year, she was appointed to teach mathematical education at Battersea College of Education, a teacher training college. In the year she was appointed,\n1969\n, she published the paper\nEducation and Development\n.\nFor information on this paper, and other papers by Burton, see\nTHIS LINK\n.\nThe Battersea College of Education had been established in the department of 'Women's Studies' at Battersea Polytechnic Institute. It merged with the Polytechnic of the South Bank in\n1976\nand Burton gave her address as the Polytechnic of the South Bank when she published\nThe Teaching of Mathematics to Young Children Using a Problem Solving Approach\nin\n1980\n.\nFor information on this paper, and other papers by Burton, see\nTHIS LINK\n.\nIn\n1980\nBurton was awarded a Ph.D. from the University of London for her thesis\nThe impact of education on political development\n. The authors of\n[\n1\n]\n(\nand\n[\n2\n]\n)\nwrite:-\nIn the thesis, Leone reviewed historically the changing concept of political development and explored the interrelationship between professional development and education. She proposed a model of professional development based on\n3\nparameters: participation, social mobilisation and vulnerability. The model is used to examine educational experiences in Kenya and Tanzania. She acknowledged help from \"the staff of the Department of Education in Developing Countries at the Institute of Education, University of London.\"\nThe Polytechnic of the South Bank became South Bank Polytechnic in\n1987\n, South Bank University in\n1992\n, and London South Bank University in\n2003\n. However, Burton had left the Polytechnic of the South Bank before the first name change and joined Avery Hill College. She was there in\n1984\nwhen she published\nMathematical Thinking: The Struggle for Meaning\n.\nFor information on this paper, and other papers by Burton, see\nTHIS LINK\n.\nAt Avery Hill College Burton became Head of the Mathematics Department. The College became part of Thames Polytechnic in\n1985\nand Burton continued to work there until\n1992\nwhen she joined the University of Birmingham as Professor of Science and Mathematics Education. In fact, a year after she left Thames Polytechnic it was renamed Greenwich University in\n1993\n. In\n[\n1\n]\nthe authors write of her time at Birmingham:-\nOver her years there, she built up a doctoral programme with students studying largely at a distance and coming for three one-day workshops on Saturdays each year.\nShe remained at Birmingham until she retired in\n2001\n.\nMay I\n[\nEFR\n]\nmake a personal remark here. I attended a talk by Burton in Birmingham, although I can't remember in which year. I do remember that she accused the university lecturers in the audience of \"teaching mathematics in a white, male way.\" I often thought about this comment when I was teaching over the years that followed.\nHere is a comment from Hilary Povey who became Burton's Ph.D. student while Burton was working at Avery Hill College:-\nLeone made a wonderful supervisor - both critical in the very best sense of that word and deeply supportive. She never nagged me - but, equally, I never felt for a moment that she didn't care. And my highest praise for Leone as a supervisor is that she let me do my own thing in my own way and at my own pace. Leone was, for me, the perfect supervisor.\nIn\n[\n1\n]\nand\n[\n2\n]\nthe following overview of Burton's contributions is given:-\nLeone's professional contribution was substantial in many fields and we can only refer to a few of these here. She had a lifelong passion for enabling all children to enjoy mathematical activities. She was one of the authors of Thinking Mathematically, referred to by John above, and her book Thinking Things Through continues to be bought and used by primary teachers. The last research project she was engaged on until her final illness was a return to investigate the state of mathematical problem solving in lower secondary schools in England, a project funded by the British Academy and undertaken with Steve Lerman, following years of government regulation in mathematics classrooms. Another lifelong passion was the study of gender, particularly in mathematics. She is considered to have played the major role in shifting teachers' perceptions in relation to girls and mathematics in the UK and other places around the world. Her final book was a major study of the experiences and opinions of a large sample of UK mathematicians. The community has still much to learn from those interviews.\nWe must mention Burton's important work for the Open University. This is recorded in\n[\n4\n]\n:-\nFor a period in the early\n1980\ns, Leone worked at the Open University, collaborating with Ann Floyd, Nick James and John Mason, to develop a new kind of mathematics course for teachers, \"Developing Mathematical Thinking\". Materials for the course were to include the new-fangled medium of VHS video! These videos are still in regular use in mathematics teacher education. The clothes and hairstyles may have changed, but the arresting and powerful engagement of viewers with evergreen issues in teaching and learning remains as potent as ever. Another outcome of the Open University collaboration was the best-seller \"Thinking Mathematically\"\n(\nMason, Burton, and Stacey,\n1982)\n. Leone also worked on developing mathematical problem-solving in primary and middle schools with colleagues from teacher education colleges, resulting in her rigorous but accessible\n1984\nbook, \"Thinking Things Through\".\nFor extracts from reviews of works by Burton, including\nThinking Mathematically\n, see\nTHIS LINK\n.\nWriting about the same Open University project the authors of\n[\n1\n]\nwrite:-\nIt was extremely stimulating to find colleagues coming together from very different backgrounds but with nearly complete agreement on what would be most beneficial for teachers.\nAfter she retired in\n2001\n, Burton was made an honorary Chair at King's College London. In\n2004\nshe became an Honorary Professor of Mathematics Education at the University of Cambridge. Here\n[\n4\n]\n:-\n... she taught both undergraduate and graduate students, and was an energetic and stimulating presence in the life of the Mathematics Education Group.\nBurton visited many Asian countries where she was given the role of a visiting professor. From\n1984\nto\n1988\nshe was the convenor of the International Organisation of Women and Mathematics Education.\nHer health deteriorated when she suffered from cancer but this was greatly worsened with a severe stroke. After her death on\n1\nDecember\n2007\n, she was buried on\n10\nDecember at Barton Glebe, a woodland burial ground near to Cambridge.\nThe articles\n[\n1\n]\nand\n[\n2\n]\ncollected words from tributes to Burton following her death:-\nA simple grouping of these words and phrases characterizes Leone for us very effectively:\n(\ni\n)\nLeone was a sensitive and caring friend, good company, generous, kind, warm, honest, wise and supportive.\n(\nii\n)\nLeone was an inspiring doctoral supervisor offering encouragement, sound advice, excellent ideas, insightful intelligence and flexibility of thinking. She was also direct, questioning, challenging, demanding, deeply supportive and empowering, a wonderful role model.\n(\niii\n)\nAs a scholar, Leone was incisive, passionate, rigorous, principled, intellectually sharp, critical, strong, tough, feisty, daunting and straight to the point.\n(\niv\n)\nOverall, she showed concern, conviction, taste, flexibility and courage.\nThe comments left by friends emphasised how much Burton loved music. She performed on the cello, played the piano, and sang in choirs. She also loved cooking and shopping for food but not for herself but to share her meals with friends. Her other love which she had all her life was a desire to travel. She took holidays in India, Morocco and Venice. She owned a house in France where she would tend the garden with loving care.\nLet us end our biography of Burton by quoting from her book\nMathematicians as Enquirers: Learning about Learning Mathematics\n(2004)\n:-\nIt is amazing that the usual reply to being introduced to a mathematician is a stumbling apology about how bad someone is at mathematics, no matter how good they may be in reality. The problem is that we have come to view mathematics as an arcane branch of knowledge that only a few can aspire to understand or grasp. The sense of separation between those who have the knowledge and those who do not, is present even amongst academics where many of the same skills and research practices exist - intuition, the use of symbolic structures and the use of intuition and insight. The more worrying aspect of this separation is the ever declining numbers of students choosing mathematics as part of their curriculum beyond the stage when it is mandatory. Even worse, it would seem that the mathematics community has created a discriminatory environment that deters many students from continuing beyond secondary and tertiary education."
}