{
  "nome_completo": "Leslie Colin Woods",
  "nome_curto": "Leslie Woods",
  "ano_nascimento": "1922",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Woods/",
  "lugar_nascimento": "Reporoa, New Zealand",
  "lugar_morte": "Oxford, England",
  "biografia": "Leslie Woods\nwas born in Reporoa, in North Island New Zealand, a small settlement in the middle of the Island between Rotorua and Taupo. His name was not Woods at this stage, that was a name he chose later in life, but rather he was Leslie Woodhead. His father became a fisherman when Leslie was four years old and the family moved to Mercury Bay on Coromandel Peninsula on the north coast of the North Island. There the family home was a tent and, after his younger brother died, Leslie lived in an isolated situation with only his mother and father for company. It was a hard life, fishing for his food and having only clothes made by his mother.\nThe nearest village was Whitianga and the family moved there after a year so that Leslie could attend school. He remained in Whitianga until he was nine, then the family moved to Auckland, then to Parnell, and then to Panmure Basin. It was not until he was fourteen years old when he began attending Brixton Road Primary School that Leslie wore shoes for the first time. He did well at school and his teachers encouraged him to continue his education at a grammar school. However his father\n[\n1\n]\n:-\n... used to boast that he was the only fisherman in Auckland with a knowledge of Latin and Greek, and he was certainly not going to let his son waste time learning such useless dead languages!\nLeslie was, therefore, sent to Seddon Memorial Technical College in Auckland in\n1936\n. There he learnt engineering and a little mathematics. He had to bring in money for the family, however, and among the jobs he took was delivering papers and working in an abattoir. In\n1938\nhe passed the Matriculation examination and wanted to go to Auckland University College but his father refused to pay the fees. He then spent another year at Seddon Memorial Technical College preparing to take the scholarship examinations to University College. He was successful in the examinations but his father still refused to provide any support for his maintenance. When one of the teachers at Seddon Memorial Technical College offered to pay for Leslie from his own pocket, his father relented. Leslie then began the engineering course at Auckland University College.\nIn\n1941\nhis difficult relationship with his parents finally broke down and he left home. He resigned his scholarship and joined the Royal New Zealand Air Force. Of course World War II was taking place and, after training to be a fighter pilot, he took part in the war in the South Pacific. He continued his studies on his own and was awarded a B.Sc. after taking the examinations in Auckland in November\n1943\n. By this time he had married Betty Bayley on\n21\nAugust\n1943\n. Although taking part in active service flying missions in the Pacific, he was able to register as an external student for both an M.Sc and a B.A. at the University of Auckland. When on leave he attended some lectures and sat examinations. In\n1944\nhe was awarded an M.Sc.\n(\nSecond Class\n)\nand in the same year, just before the birth of his first daughter, he changed his name from Woodhead to Woods. His reasons were complex - partly he felt that Woodhead was an unfortunate name to give a child, partly he wanted to spite his own father. Later in life he regretted having changed his name.\nAfter leaving the Royal New Zealand Air Force in November\n1945\nhe began to study further at Auckland University College School of Engineering, providing for his family by teaching evening classes at Seddon Memorial Technical College. His application for a Rhodes Scholarship to enable him to study for a doctorate at Oxford in England was successful and by the end of\n1948\nhe had travelled with his family to begin studies at Merton College. He continued with his love of flying, however, and joined the University Air Squadron. His supervisor at Oxford was Alexander Thom and after undertaking research in the Engineering Department he was awarded a D.Phil. in\n1950\nfor his thesis\nThe flow of a compressible fluid about a body\n. His external examiner was\nGeorge Temple\n. This work led to two papers in\n1950\n:\nImprovements to the accuracy of arithmetical solutions to certain two-dimensional field problems\nand\nThe two-dimensional subsonic flow of an inviscid fluid about on aerofoil of arbitrary shape\n. This second paper:-\n... describes and applies exact methods of calculating the incompressible flow about thick aerofoils of general shape in a free stream, and about symmetrical aerofoils between channel walls. One of these methods is extended to an approximate treatment of subsonic compressible flow by making use of\nvon Kármán\n's transformation.\nWoods then did something that few others have ever done - after the award of his doctorate he studied for an Oxford B.A. which he was awarded in\n1951\n. By this time Woods had joined the New Zealand Defence Corps and they sent him to the National Physical Laboratory at Teddington in\n1951\n. He now published a whole series of papers - the next two were:\nA new relaxation treatment of flow with axial symmetry\n(1951)\n, and\nThe numerical solution of two-dimensional fluid motion in the neighbourhood of stagnation points and sharp corners\n(1952)\n. This second paper was reviewed by\nGarrett Birkhoff\nwho wrote:-\nNets of streamlines and potentials are calculated by an adaptation of the relaxation method. The main ideas are:\n(\ni\n)\nalgebraic expansion of the logarithmic singularity near a sharp corner, and\n(\nii\n)\nan iterative treatment, following Thom, of the boundary conditions in the\n(\nf, y\n)\n-plane.\nWoods own description of his\n1953\npaper\nThe relaxation treatment of singular points in\nPoisson\n's equation\nstates:-\nIf F is harmonic or is a solution to\nPoisson\n's equation, it may have singular points in the field or on the boundary at which it\n(\na\n)\nhas finite values, but has infinite derivatives,\n(\nb\n)\nhas logarithmic infinities, or\n(\nc\n)\nhas simple discontinuities. This paper describes methods that can be adopted by computers using the relaxation technique when working in the neighbourhood of these points. Methods of obtaining accurate derivatives and integrals in these neighbourhoods are also given. Four examples illustrate the methods and suggest that the accuracy is comparable with that obtained in similar problems without singularities.\nIn February\n1954\nWoods was appointed to a Senior Lectureship in Applied Mathematics at Sydney University. In May\n1956\nhe was appointed Nuffield Research Professor of Engineering at the University of New South Wales. He spent\n1960\nback in England at the Atomic Energy Research Establishment at Harwell, then became the Foundation Fellow in Engineering at Balliol College, Oxford. In addition, he was a consultant in plasma physics at the Atomic Energy Research Establishment at Harwell. He was steadily promoted at Oxford, being made Reader in Applied Mathematics in\n1965\n, then Professor of the Mathematics of Plasma in\n1969\n.\nHe published a number of major texts including:\nThe Theory of Subsonic Plane Flow\n(1961)\n;\nThe Thermodynamics of Fluid Systems\n(1975)\n;\nPrinciples of magnetoplasma dynamics\n(1987)\n,\nKinetic Theory of Gases and Magnetoplasmas\n(1993)\n; and\nThermodynamic Inequalities with Applications to Gases and Magnetoplasmas\n(1996)\n.\nBrian Woods\n[5]\nwrites:-\nThis severely abridged catalogue of scientific and worldly success might tempt the reader to suppose that Les is a solidly establishment figure. I suppose that there is an uninteresting sense in which that might be true, but there is a refreshingly maverick aspect to his character which the years have not attenuated. He has not flinched from open controversy. Perhaps the clearest statement of his approach to applied mathematics can be found in two papers, \"Beware of Axiomatics in Applied Mathematics\", and \"The Bogus Axioms of Continuum Mechanics\", both in the Bulletin of the Institute of Mathematics and its Applications. I shall not attempt to summarize these, but both are substantial in content and polemical in tone, and led to quite strong exchanges of views subsequently. I commend them to readers ...\nHe was a candidate for a Fellowship of the\nRoyal Society\nand he discusses in\n[\n1\n]\nthe progress of his candidature. The discussion in\n[\n1\n]\nis remarkably frank, and Woods suggests that the reason he was not elected to a fellowship related to the various scientific controversies in which he was involved.\nWoods was Chairman of the Mathematical Institute at Oxford University from\n1984\nto\n1989\n. During this time he spent time in Muscat as the Foundation Professor of Mathematics for the Sultan Qaboos University, and he set up a mathematics department there. He retired from his Oxford chair in\n1990\nbeing made Professor Emeritus. In the following year he became Emeritus Fellow at Balliol College. After he retired he\n[\n4\n]\n:-\n... resumed playing his clarinet, and in\n1996\n(\naged\n73)\nhe took up gliding as a hobby.\nWe should mention another important contribution by Woods. He was a founder editor of the\nJournal of the Institute of Mathematics and its Applications\n.\nAs to Woods personal life we note that he had five daughters with his first wife Betty. They were divorced in\n1977\nand two later marriages also ended in divorce.\nJohn Ockendon writes in\n[\n2\n]\n:-\nHis ideas never survived peer review, and so they can only be found in his rather idiosyncratic textbooks. However, a layman's version appears in his wonderfully informative and entertaining autobiography \"Against the Tide\", an expurgated version of which was published in\n2000\nby the Institute of Physics only after two other well-known publishing houses found it too cuttingly forthright. The book received a better review in \"The Aeroplane\" than in the physics literature, and it seems to have been ignored by the axiomatic applied mathematics community, with whom Woods had also become embattled; he did not like \"rigor mortis\"."
}