{
  "nome_completo": "Loránd Baron von Eötvös",
  "nome_curto": "Loránd Eötvös",
  "ano_nascimento": "1848",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eotvos/",
  "lugar_nascimento": "Pest (now part of Budapest), Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Loránd Eötvös\nis also known by the German version of Loránd, namely Roland. Had he only published in Hungarian, Eötvös would have achieved far less in the way of an international reputation so he published his most important results in German as well as Hungarian. To international scientists, therefore, he is known by the name which appeared on these German papers, namely Roland, Baron Eötvös. His full title is, however, far more grand: in Hungarian Vásárosnaményi Báro Eötvös Loránd; in English Roland, Baron Eötvös of Vásárosnaményi. Looking at a present day map of Hungary, Vásárosnaményi is close to its eastern border with Ukraine.\nLoránd's mother was Agnes Rosty. His father was József, Baron Eötvös, a novelist, essayist, educator, and statesman, whose life and writings were devoted to the creation of a modern Hungarian literature and to the establishment of a modern democratic Hungary. He was a friend of Franz Liszt, the famous pianist and composer. At the time of Loránd's birth his father was minister of education in the revolutionary government of\n1848\n, but after a disagreement with Lajos Kossuth, who headed the government, he resigned later in the year and went to Munich where he lived until\n1851\n. Certainly Loránd grew up in a high ranking family and he received the benefits of a broad education. When he was young, Loránd's father employed Gusztáv Keleti, a painter who was the leader of the school of fine arts at that time, to tutor his son. Loránd rapidly showed talents in a whole range of artistic pursuits, and he became highly skilled at drawing, and wrote poetry. He sketched scenes from his travels in his notebook throughout his life.\nAt school Eötvös studied Hungarian, German, mathematics, history, geography, biology, mineralogy, and physics. Although mathematics and physics were particularly interesting to him, he was expected to follow the family tradition and study law as the route to a government position. When he entered the University of Budapest in\n1865\nhe was following the family wishes and enrolled to take a law degree. Well, it is not quite true that he studied at the University of Budapest for at the time it was the University of Pest; only in\n1872\ndid the town of Pest join with the town of Buda on the opposite bank of the Danube to form Budapest.\nEötvös was always more interested in mathematics and science than in law and while he studied law in courses at the university, he took private lessons in mathematics from Otto Petzval. József Eötvös, seeing that his son was fascinated by science, asked the professor of mineralogy at the University to teach the young Eötvös science. He also worked in the chemistry laboratory of Charles Than at the university and soon decided to give up law and concentrate completely on science.\nHe terminated his law studies in\n1867\nand went to study at Heidelberg where he was taught by\nKirchhoff\n,\nHelmholtz\nand Bunsen. Clearly he was a typical student, for he received a caution from the police for singing too loudly on the street at night with his student friends! From Heidelberg he went to Königsberg and studied under\nFranz Neumann\nand Friedrich Richelot. He returned to Heidelberg and received a doctorate in\n1870\nwith a thesis which studied problems of Fizeau on the relative motion of a light source. This was one of the first steps towards relativity theory. The years abroad had formed an extremely important period for Eötvös's development\n[\n1\n]\n:-\nHis professors profoundly influenced Eötvös's working habits.\nKirchhoff\ntaught him the importance of accurate measurements.\nHelmholtz\nliked to spend as much time as possible with his students and showed Eötvös the value of individual discussions. His knowledge of theoretical physics, and in particular of potential theory, came from\nFranz Neumann\n.\nEötvös's father died on\n2\nFebruary\n1871\nand in that year Eötvös returned to Hungary and was appointed to the University of Budapest as a\nprivatdozent\nfor a year before being promoted to full professor of theoretical physics. He had now inherited his father's title and he became a member of the Upper House in the Hungarian Parliament in\n1872\n. He added the teaching of experimental physics to the theoretical topics he taught in\n1874\nand he became professor of experimental physics in\n1878\nwhen the previous holder of the chair retired. Eötvös married Gizella Horváth, the daughter of the former Hungarian minister of justice Boldizsár Horváth, on\n29\nJuly\n1876\n. Gizella was a highly cultured aristocratic girl, a fine pianist, with beautiful handwriting, having a good knowledge of French. They had two daughters Ilona and Rolanda who achieved significant success in sport, becoming famous in Hungarian society.\nEötvös published on surface tension between\n1876\nand\n1886\n, a topic he had become interested in while studying with\nFranz Neumann\nin Königsberg. At this time Eötvös had devised an instrument to measure the constant of surface tension. Presenting his ideas in\nFranz Neumann\n's seminar had led to him receiving praise from his professor, and Eötvös began to consider problems in the topic. He discovered Eötvös's law of surface tension which states that the temperature coefficient of the molecular surface energy of a liquid is independent of the nature of simple unassociated liquids. After\n1886\nhe ceased to publish on surface tension and from then on he published on gravitation for the rest of his life. He invented the Eötvös balance and showed that, to a high degree of accuracy, gravitational mass and inertial mass are equivalent. The first field measurements with his torsion balance were carried out on Ság Hill in Hungary in\n1891\n. One reason why his interests moved towards gravitation must have been the fact that the Hungarian Society for Natural Sciences requested, in\n1881\n, that measurements be made to ascertain the values for the acceleration due to gravity in different locations throughout Hungary\n[\n1\n]\n:-\nThe achievement of Eötvös in the use of his instrument are threefold. By developing the complete theory of the Eötvös balance, he was able to push its sensitivity to such a point that it took decades to devise methods for exceeding his precision. It is only proper to mention that the high degree of precision he achieved was not due solely to the design of the instrument but depended also on the unparalleled skill he displayed in using it. The other two accomplishments encompassed the clear recognition of the very important applications of the balance: geophysical exploration and the equivalence of gravitational and inertail mass. In both cases the recognition was followed by intense work proving his insight.\nThe University of Göttingen announced as a prize topic a request for improved accuracy in checking the accepted fact that all bodies fell with the same acceleration in a vacuum. Eötvös, and his team of researchers, did indeed check this old claim of\nGalileo\nwith very much higher accuracy than had previously been achieved. He also verified, as part of the same experiments, that gravitational mass and inertial mass are equivalent to an accuracy of\n5\nparts in\n1\n0\n9\n10^{9}\n1\n0\n9\n.\nFrom June\n1894\nto January\n1895\nEötvös was the minister of public instruction in the Cabinet of Sandor Wekerle. One of the main achievements of his short period of office was the founding of the Eötvös Collegium to improve the teaching of Hungarian secondary school teachers.\n(\nDo not think Eötvös named the College after himself, rather it was named after his father!\n)\nEötvös resigned this government post in\n1895\nto devote himself fully to teaching physics at the University of Budapest.\nEötvös founded the Hungarian Society for Mathematics in\n1885\nand after physicists also wished to be part of the Society, he founded the Mathematical and Physical Society in\n1891\n. Eötvös was elected as the first president of the Society and declared it founded with the following words:-\nTo further the development of science by word of mouth at our meetings, and publish everything that is worth the attention of the experts in a journal: this goal does not seem more than the goal of a self-educating student circle, and still in case we give it the deserved attention, our work will have merit, it will fulfil an important task. If we carry out the task of self-education with dedication and seriousness, it will also have the result that in the future the researchers and developers of science will come from among us. I hereby declare the Mathematical and Physical Society founded.\nAfter Eötvös died in\n1919\n, the Society was renamed the Eötvös Loránd Mathematical and Physical Society. What was once the Péter Pázmány University in Budapest is now known as the Loránd Eötvös University.\nIn\n1873\nEötvös became a corresponding member of the\nHungarian Academy of Sciences\n, being elected as a full member in\n1883\n. In\n1889\nhe was elected President of the\nHungarian Academy of Sciences\n. Although this was a three year term, Eötvös continued to be re-elected to the position for sixteen years until he resigned in\n1905\n.\nEötvös had several hobbies. One was mountaineering and he loved climbing in the South Tirol. This was not simply a little recreation, for Eötvös soon gained the reputation as one of Europe's most famous mountaineers. He was the first to climb a number of peaks in the Dolomites and his fame was such that a peak there is named after him. After his daughters grew up they accompanied their father on several climbs from around\n1896\n. Climbing also fitted in with another of Eötvös's hobbies, namely photography. He took many photographs while on mountaineering trips, but also took photographs while on field trips making scientific measurements. Since on such occasions he would take the photographs, they tend to show other members of Eötvös's party but not Eötvös himself."
}