{
  "nome_completo": "Lorenzo Mascheroni",
  "nome_curto": "Lorenzo Mascheroni",
  "ano_nascimento": "1750",
  "ano_morte": "1800",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mascheroni/",
  "lugar_nascimento": "Bergamo, Lombardo-Veneto (now Italy)",
  "lugar_morte": "Paris, France",
  "biografia": "Lorenzo Mascheroni\n's parents were Maria Ciribelli and Paolo Mascheroni dell'Olmo who was a wealthy landowner. Mascheroni was educated with the aim of becoming a priest and he was ordained at the age of\n17\n. At first he taught\nrhetoric\nthen, from\n1778\n, he taught physics and mathematics at the seminary at Bergamo.\nIn\n1786\nMascheroni became professor of algebra and geometry at the University of Pavia, mainly on the strength of his excellent work on statics\nNuove ricerche su l'equilibrio delle volte\nwhich he had published one year earlier. Later, in\n1789\n, he became rector of the university, holding the appointment for four years. During the years\n1788\nto\n1791\nhe was head of the Accademia degli Affidati.\nIn\nAdnotationes ad calculum integrale Euleri\nⓉ\n(\nNotes on Euler's integral calculus\n)\n(1790)\nMascheroni calculated\nEuler\n's constant to\n32\ndecimal places. In fact only the first\n19\nplaces were correct but the remaining places were corrected by Johann von Soldner in\n1809\n. Despite the error in the calculation, Mascheroni's work shows a deep understanding of\nEuler\n's calculus.\nMascheroni is also known as a poet and he dedicated one of his books\nGeometria del compasso\nⓉ\n(\nCompass geometry\n)\n(\npublished in Pavia in\n1797)\nto Napoleon Bonaparte in verse. In this work Mascheroni proved that all Euclidean constructions can be made with compasses alone, so a straight edge in not needed. In fact this had been\n(\nunknown to Mascheroni\n)\nproved in\n1672\nby a little known Danish mathematician\nGeorg Mohr\n. In the preface to\nGeometria del compasso\nⓉ\n(\nCompass geometry\n)\nMascheroni explains how he approached the problem\n[\n1\n]\n:-\nHe was moved initially by a desire to make a contribution to elementary geometry. It occurred to him that ruler and compass could perhaps be separated, as water can into two gases; but he was assailed by doubts and fears often attendant upon research. He then chanced to reread an article on the way Graham and Bird had divided their great astronomical quadrant, and he realised that the division had been made by compass alone, although, to be sure, by trial and error. This encouraged him and he continued his work with two purposes in mind: to give a theoretical solution to the problem of constructions with compasses alone and to offer practical constructions that might be of help in making precision instruments.\nSee\nTHIS LINK\n.\nThe article\n[\n3\n]\ngives an idea of the content of Mascheroni's book. In it he shows how, with compasses alone, to bisect a given circular arc, to add and subtract given segments, to find a fourth proportional to three given segments, to find the point of intersection of two given lines, and to find the points in which a given line meets a given circle. From the solution to these problems he is able to prove theoretically that any construction which can be made using a ruler and compasses can be made with compasses alone.\nFor his excellent contributions Mascheroni received a number of honours such as election to the Academy of Padua, the Royal Academy of Mantua and to the Società Italiana delle Scienze.\nMascheroni was appointed as a deputy in the governing legislative assembly in Milan in\n1797\n. The French had been working on the introduction of the metric system of weights and measures and on\n7\nApril\n1795\nthe National Convention had passed a law introducing the metric system putting\nLegendre\nin charge of the transition to the new system. Mascheroni was sent to Paris to study the new system and to report to the governing body in Milan. He published his report in\n1798\nbut the War of the Second Coalition began in\n1799\nwhile Napoleon Bonaparte was in Egypt and the French government was in crisis. Austria took the opportunity to secure Russia as an ally and then attack the French on several fronts including the north of Italy. Mascheroni was unable to return to Milan due to the war and the Austrian occupation of the city in\n1799\n. He remained in Paris where he died in the following year after a brief illness resulting from complications after catching a cold.\nOne is left with asking whether Mascheroni deserves the credit for proving a result which\nMohr\nproved\n125\nyears earlier. The first question we must ask is whether Mascheroni might have known of\nMohr\n's result. If one examines the two proofs it is seen that they approach the problem in very different ways. One is certainly led to believe that Mascheroni could not have known\nMohr\n's proof but it is still possible that he had heard that the result had been proved earlier. This does not seem particularly likely and even if he had seen the result stated it detracts little from his achievement. It is clear to me\n[\nEFR\n]\nthat both Mascheroni and\nMohr\ndeserve equal credit."
}