{
  "nome_completo": "Louis François Antoine Arbogast",
  "nome_curto": "Louis Arbogast",
  "ano_nascimento": "1759",
  "ano_morte": "1803",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arbogast/",
  "lugar_nascimento": "Mutzig, Alsace",
  "lugar_morte": "Strasbourg, France",
  "biografia": "Little is known of\nLouis Arbogast\n's childhood and education. The first definite reference to him is in\n1780\nwhen he was\n21\nyears old. At that time he registered as a lawyer at the Sovereign Council of Alsace but, seven years later, we know that he was professor of mathematics at the Collège de Colmar.\nFrom this time on information on Arbogast becomes more plentiful. While at the Collège de Colmar Arbogast entered a mathematical competition which was run by the\nSt Petersburg Academy\n. His entry was to bring him fame and an important place in the history of the development of the calculus. Perhaps a little background will make the reason for the question that was posed for this competition more meaningful.\nEuler\nand\nd'Alembert\nhad fallen out in the\n1750\ns over a number of different matters, some mathematical and others more to do with their personalities. The particular mathematical dispute which prompted the question set by the\nSt Petersburg Academy\nin\n1787\n, however, concerned the arbitrary functions which appeared when a differential equation was integrated.\nd'Alembert\nclaimed that these arbitrary functions were required to be continuous and must always be expressed in terms of algebraic or transcendental equations.\nEuler\nargued that more general functions could be introduced when differential equations were integrated.\nThe actual question the\nSt Petersburg Academy\nposed was:-\nDo the arbitrary functions introduced when differential equations are integrated belong to any curves or surfaces either algebraic, transcendental, or mechanical, either discontinuous or produced by a simple movement of the hand? Or should they legitimately be applied only to continuous curves susceptible of being expressed by algebraic or transcendental equations?\nArbogast submitted an essay to the\nSt Petersburg Academy\nin which he came down firmly on the side of\nEuler\n. In fact he went much further than\nEuler\nin the type of arbitrary functions introduced by integrating, claiming that not only could the functions be discontinuous in the limited sense that\nEuler\nclaimed, but discontinuous in a more general sense that he defined which allowed the function to consist of portions of different curves. Arbogast won the prize with his essay and his notion of discontinuous function became important in\nCauchy\n's more rigorous approach to analysis.\nIn\n1789\nArbogast moved from Colmar to Strasbourg where he taught mathematics at the École d'Artillerie. Also in\n1789\nhe submitted a major report on the differential and integral calculus to the\nAcadémie des Sciences\nin Paris which was never published. In the Preface of a later work he described the ideas which prompted him to write the major report of\n1789\n. Essentially he realised that there was no rigorous methods to deal with the convergence of series. This fact caused him to:-\n... reflect on fundamental principles. ... I then foresaw the birth of the first inkling of the ideas and methods which, when developed and extended, formed the substance of the calculus of derivatives\n.\nArbogast's career in Strasbourg reached new heights. In addition to his mathematics post, he was appointed as professor of physics at the Collège Royal in Strasbourg and from April\n1791\nhe served as its rector until October\n1791\nwhen he was appointed rector of the University of Strasbourg. By this time, however, Arbogast was involved in politics and in\n1791\nhe was elected to the Legislative Assembly. As a member he introduced plans for reforms in the schools at all levels. Then in\n1792\nhe was returned as member for Haguenau to the Convention Nationale.\nIn\n1794\nhe was appointed Professor of Calculus at the École Centrale\n(\nsoon to become the École Polytechnique\n)\nbut he taught at the École Préparatoire. In July\n1795\nhe was put in charge of planning the École Centrale du Bas-Rhin and, once set up, he became the professor of mathematics there in\n1796\n, holding the post until\n1802\n.\nHis contributions to mathematics show him as a philosophical thinker somewhat ahead of his time. As well as introducing discontinuous functions, as we discussed above, he conceived the calculus as operational symbols. The formal algebraic manipulation of series investigated by\nLagrange\nand\nLaplace\nin the\n1770\ns was put in the form of operator equalities by Arbogast in\n1800\nin\nCalcul des dérivations\n. In\n[\n3\n]\nLjusternik and Petrova explain that in this work:-\n... operators and functions of operators were separated from the functions on which they act.\nArbogast is clear about what he is doing writing in the Preface explaining that his method separates the scale of operations:-\nThis method is generally thought of as separating from the functions of variables when possible, the operational signs which affect this function. Then, of treating the expression formed by these signs applied to any quantity whatsoever, an expression which I have called a scale of operation, to treat it, I say, nevertheless as if the operational signs which compose it were quantities, then to multiply the result by the function.\nArbogast was interested in the history of mathematics and classified\nMersenne\n's papers and collected manuscript copies of memoirs and letters of\nFermat\n,\nDescartes\n,\nJohann Bernoulli\n,\nVarignon\n,\nde L'Hôpital\nand others. This is an extremely important collection, part of which is now in Paris and part in Florence.\nArbogast was friendly with\nFrançois Français\nand together they worked on the calculus of derivations and the operational calculus. After Arbogast died in\n1803\n,\nFrançois Français\ninherited his collection of manuscripts, and also his mathematical papers. He continued Arbogast's work on the operational calculus and presented a memoir on this topic, in particular applying the methods to study projectiles in a resistant medium, to the\nAcadémie des Sciences\nin\n1804\n. This memoir was very highly praised by\nBiot\nin a report of\n22\nApril\n1805\n, but the work was not published.\nThe historical manuscripts which went to\nFrançois Français\non Arbogast's death were bought by\nLibri\nfrom a bookseller in Metz in\n1839\n.\nWe should mention one other important contribution made by Arbogast. He\n[\n1\n]\n:-\n... was responsible for the law introducing the decimal metric system in the whole of the French Republic.\nArbogast was elected to the\nAcadémie des Sciences\nin\n1792\nand the mathematics section of the Institut National in\n1796\n."
}