{
  "nome_completo": "Lucien Marie Le Cam",
  "nome_curto": "Lucien Le Cam",
  "ano_nascimento": "1924",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Cam/",
  "lugar_nascimento": "Croze, Creuse, France",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Lucien Le Cam\n's father was François Le Cam and his mother was Marie Jouanno. Neither of his parents had more than a very basic elementary education but they were hard working people. Lucien spoke about his parents in\n[\n1\n]\n:-\nMy parents were hard working people. They were born in a poor part of Brittany and had to leave elementary school at ten or eleven because they had to work, but they were fine strong intelligent people. My father spent a bit of his youth fighting in the First World War. After that he started from scratch in Brittany but in\n1922\ndecided to move to the centre of France, where he could be a fermier. That is someone who leases a farm owned by someone else. In the centre of France my parents could be fermiers. In Brittany they would have had to be farmhands ...\nLucien, the second of his parents' three sons, was born on a little farm called La Jasseix in Croze but he was brought up in Felletin where the family moved shortly after he was born. In Felletin they leased a farm which gave them sufficient to live on but the family had little money to spare and in fact for the first five or six years of his life the family could not even afford mattresses to sleep on. In\n1936\nLucien and his older brother Jean were sent to the Notre Dame boarding school in Guéret, a town about\n50\nkilometres from Felletin. Tragedy struck the family, however, in\n1938\nwhen Lucien's father died.\nThe family were now in serious financial problems. More than this, Le Cam's mother could not run the farm on her own. By this time all three brothers were at the boarding school but only Lucien was able to remain there as Jean returned to the farm to help his mother and his younger brother Joseph, who disliked school, also left.\n(\nBoth of Le Cam's brothers became farmers but, unlike their parents who leased farms, the brothers owned their farms.\n)\nLucien was able to remain at Notre Dame school since, although the family could not afford to pay for his education, the priests at Notre Dame offered to pay his living expenses\n[\n1\n]\n:-\nNotre Dame was a nice place where you got up at about\n5\na.m., washed your face in a little individual basin, and then went to mass. After mass there was a one-hour study period, then breakfast, then a fifteen-minute break to use the outside toilets. Those were as dirty and stinky as any I have seen elsewhere. Actually, I was privileged. I served mass every morning for five years and had the opportunity to witness exactly how much the priests believed in their rituals.\nDespite the generous act by the priests in funding Le Cam's education, it was disrupted by the war. Notre Dame boarding school was turned into a military hospital and\n[\n11\n]\n:-\n... the students for all the grades, except those of us in the highest two grades, were scattered out in the countryside. The top two classes were in the basement of a church. I passed the state graduation exams given nationwide. Then the director of the school decided that I was a good prospect for a seminary. So I went to the seminary.\nLe Cam's favourite subject at the high school had been chemistry and he took chemistry books with him to the seminary. However, he was told that the only book he could bring in was the bible and anything else required special permission. Unhappy at these restrictions, he left the seminary the next day and returned home\n[\n1\n]\n:-\nThe next step was to go to the university in Clermont-Ferrand. It was already two or three weeks past the start of the teaching year. Chemistry laboratories were full. Since I could not be admitted to chemistry, I opted for mathematics. That was OK, but money was needed, not for fees - they were minimal - but for lodging and food. The university people advised me to go to the lycée, where I could get room and board.\nThe lycée in Clermont-Ferrand offered him a free noon meal each day but had no accommodation left. He rented a room nearby and attended the lycée taking the two-year course to prepare for the competitive examinations for the École Normale and the École Polytechnique. The schedule was hard\n[\n1\n]\n:-\n... sixteen hours of lectures on mathematics, seven on physics, six on chemistry, etc., per week. Oral examinations in mathematics every week and alternating examinations in physics and chemistry. However, that still left me a bit of leeway to see a few things at the university.\nHe attended some university lectures and one day he went into a bookshop on his way there and bought a copy of\nBourbaki\n's\nÉléments de Mathématique\nⓉ\n(\nElements of mathematics\n)\n. The book fascinated him and this was the beginning of his lifelong love of the\nBourbaki\ntexts. Of course, all these events were taking place in occupied France and, although his education was not significantly disrupted, nevertheless life was extremely difficult and dangerous\n[\n1\n]\n:-\nIn\n1944\nI joined an underground group in the woods. That was a small group of about twenty people, led by someone I had known from my days at Notre Dame. At the time of the landing in Normandy\n[6\nJune\n1944]\nthe group swelled overnight to more than fifteen hundred people. Something had to be done. A group of fifteen people, including one of my favourite cousins, took over the military camp at La Courtine. It was \"defended\", if one can call it that, by some\n150\nFrench soldiers under the command of a dozen German officers. The next day the crowd of us went there. The French military, who had been invisible since\n1940\n, came out of the woodwork and tried to teach us to march in step and the like. I got into a hassle with one of them and was about to be court-martialled when someone spread the rumour that the Germans were coming back. The French officers disappeared again into the woodwork, and I escaped court-martial.\nLe Cam was still trying to get into university; the École Polytechnique  was his first choice with the École Normale Supérieure as second choice. However, he had to wait until he could sit the competitive entrance examinations\n[\n1\n]\n:-\nI went back to the farm and stayed there until late October. Returning to Clermont-Ferrand in November\n1944\n, I found that I was a suspicious character. The story was that I had volunteered to battle the Russians in a German outfit and had been killed in action. The fact that I was there, very much alive, was not enough to kill the story. I shortly left for Paris. It had been arranged\n(\nby my Clermont-Ferrand teachers\n)\nthat I would join the Lycée Henri IV in the Math Spé class directed by Professor Perrichet. Unfortunately, Perrichet insisted on my being a boarder in his school. Having tasted freedom, I refused.\nHis attempts to sit the entrance examinations for the École Polytechnique failed since he was unable to get all the necessary documents to prove that he was racially French back to his grandparents\n(\nthe German occupiers had introduced mechanisms to bar those with a Jewish grandparent\n)\n. In December\n1944\nhe took the examinations for the École Normale\n(\nfortunately, he did not need his parents and grandparents birth certificates for this\n)\n. He passed the written paper but failed the oral examination. Rather than wait to try again in the following June, Le Cam began to take courses at the University of Paris. He was nearly drafted into the French army but, after passing the medical, he was not required because of an administrative error in the process. He continued to take University of Paris courses in calculus and rational mechanics but needed a third course to obtain a diploma. He asked\nMaurice Fréchet\nif he could take the examinations in\nprobability\ndespite not having attended the course but\nFréchet\nsaid he would fail a student who had not attended lectures. He made the same request of\nGeorge Darmois\nfor the statistics course and was told that he could try the examination if he could find a set of notes from which to learn the material. He passed and obtained a diploma in October\n1945\n.\nAsking\nDarmois\nfor advice on getting a job, Le Cam was advised that Électricité de France were looking for statisticians. He was appointed and, together with several other statisticians at the organisation, read statistics journals and attended statistics lectures at the university. His work at Électricité de France was\n[\n3\n]\n:-\n... on efficient operation of dams and on estimating probabilities of drought or flood.\nHe published his first paper\nUn instrument d'étude des fonctions alétoires: la fonctionnelle caractéristique\nⓉ\n(\nAn tool for the study of random functions: the characteristic functional\n)\nin\n1947\nand, in the following year, the paper\nSur certains classes de fonctions aléatoires\nⓉ\n(\nOn some classes of random functions\n)\nwhich was joint work with Jean Bass. A turning point came in his career in\n1950\nwhen, through attending\nDarmois\n' seminar, he met\nJerzy Neyman\nwho invited him to spend a year at the University of California at Berkeley. During the year\n1950\n-\n51\nthat he spent in Berkeley as a visiting lecturer,\nNeyman\nsaid that provided he take a Ph.D. he could remain at Berkeley. Before working on his thesis, however, he had to take the Ph.D. Qualifying Examination and was given the task of presenting fixed point theorems in a one-hour lecture. He spent too long presenting the background material in algebraic topology and never reached the fixed point theorems - he was failed. He was allowed to retake the examination a few months later and this time gave an excellent lecture presenting a clever proof of his own. However, one of the examiners thought\n(\nincorrectly\n)\nthat the proof was wrong and Le Cam was given a bare pass.\nHe worked on his doctoral thesis advised by\nNeyman\nbut decided to marry Louise Romig, daughter of the statistician Harry Romig, before submitting\n[\n1\n]\n:-\n[\nNeyman\n]\nflew into a rage. He called my future father-in-law Harry Romig ... and told him it was \"illegal\" for me to get married because I had not finished my thesis. Actually it was finished except for a few pages still to be typed. I went ahead and got married anyway in April\n1952\n. I was awarded my Ph.D. that June.\nHis thesis\nOn Some Asymptotic Properties of Maximum Likelihood Estimates and Related Bayes' Estimates\n. Grace Yang writes\n[\n10\n]\n:-\nIn his thesis he proved that\nBayes\nestimates for one-dimensional parameters possess two asymptotic \"optimality\" properties: local asymptotic minimaxity and local asymptotic admissibility. He then showed that maximum likelihood estimates for one-dimensional parameters inherit both properties by being \"close\" to the\nBayes\nestimates.\nLet us record at this point that Lucien and Louise Le Cam had three children: Denis, Steven, and Linda. After the award of his doctorate, Le Cam was appointed as an Instructor in Mathematics and Junior Research Statistician at the University of California, Berkeley. A year later in\n1953\nhe was appointed as an Assistant Professor of Mathematics in the Statistical Laboratory. In\n1955\nhis position became an Assistant Professor in the Department of Statistics when the Department was founded. He achieved tenure at Berkeley when he was promoted to Associate Professor in\n1958\nand, two years later, became a full Professor. He was Chairman of the Department of Statistics during\n1961\n-\n65\n.\nIn\n[\n11\n]\nGrace Yang marvels at Le Cam's achievements in the five years following the award of his doctorate:-\nI am astonished by your extraordinary accomplishments\n[\nas an assistant Professor\n]\n. In  five years you produced seven Ph.D.'s: Julius Blum, C Kraft, B Rankin, George Steck, Tom Ferguson, Jim Esary and I Abrams. During the same period, you wrote many fundamental papers and introduced the theory of contiguity, theory of local asymptotic normality\n(\nLAN\n)\n, an asymptotic optimum estimation procedure\n[\nobtaining estimates without\nNewton\n-\nRaphson\n-like iterations, some call it one-step estimator\n]\n, asymptotic sufficiency, tightness in weak convergence and on and on. This would scare aspiring young assistant professors.\nLet us now look at some of the books that Le Cam has published, all in the area of modern asymptotic theory of statistical inference of which he is one of the founders. In\n1969\nhe published\nThéorie asymptotique de la décision statistique\nwhich is described by\nJack Kiefer\n:-\nThis essentially self-contained treatment can profitably be read by mathematicians who have little background in statistics but would like to learn about an important area of research in it, as well as by students and research workers in theoretical statistics. Beginning with basic notions of experiments and their comparison, the author quickly introduces the\nHellinger\ntransform, his notion of contiguity, and approximation by exponential families, to obtain limit theorems and apply them to questions of asymptotic efficiency, ending with the study of asymptotic\nBayes\nprocedures. The understanding of these seminar notes is enhanced by the author's inclusion of remarks, examples, and description of relations among various peoples' work.\nHe published notes of one of his courses as\nNotes on asymptotic methods in statistical decision theory\n(1974)\nand then produced the definitive text\nAsymptotic methods in statistical decision theory\n(1986)\n. Reinhard Michel writes about this masterpiece:-\nMembers of the statistical community have been wondering when Professor Le Cam's book would be published. Now it has appeared and it is worth the wait. One of the main principles of the present book is to organize the large field of asymptotic statistical theory around a few essential ideas and elements. As the title indicates, this is done within the framework of Wald's decision theory. ... The exposition of the whole subject is such that anyone who wants to enter it needs to read only this book. Everything has been developed in detail, advanced techniques are fully explained, and results from classical analysis that are used in the text are collected in an extensive appendix.\nIn collaboration with Grace Yang, he published\nAsymptotics in statistics. Some basic concepts\n(1990)\nproducing a second edition increased in length by over\n50\n% completed in\n2000\nshortly before his death.\nAlthough Le Cam made deep highly mathematical contributions to statistics, we should not give the impression that all his work was of this type. He made many contributions to the solution of practical problems such as studying stochastic models for rainfall, for the effects of radiation on living cells, sodium channel modelling and for cancer metastasis. It was, sadly, for personal family reasons that he came to put much effort into cancer treatments\n[\n4\n]\n:-\nBecause of\nNeyman\n's interest, Le Cam had been involved in cancer research and became much more committed to it in the early\n1970\ns when his daughter\n[\nLinda\n]\nwas stricken with bone cancer and had to have a leg amputated and later, a lung removed. Le Cam's extraordinary knowledge of cancer quickly gained the respect of the attending physicians and some of the people at the Mayo Clinic. He was invited to participate in research in a clinical trial of a group of young children with osteosarcoma, including his daughter. The result of the trial and the related immunology research have been published in a series of papers in medical journals.\nIn\n[\n10\n]\nGrace Yang describes Le Cam's lectures and interaction with students:-\nHe was well known for giving deep and mathematically difficult lectures. Most of us did not have the necessary background for his courses. He never lectured from notes. I remember well my first class in his asymptotics course. He wrote on the blackboard seventeen different types of convergence of probability measures. The sixteenth was\nL\n1\nL_{1}\nL\n1\n​\nconvergence and he said that it is useful. We had never heard of many of the types of convergence he showed us. ... If his lectures were an overview, outside the classes he was extremely generous with his time and ideas. His office door was always open. Anyone could walk in at any time to ask him questions. Students' questions were taken seriously and the discussions could go on for hours. Sometimes upon request he would provide long written answers and even provide new theorems.\nLe cam retired in\n1991\nand was made Professor Emeritus. This made surprisingly little difference to his daily routine and he continued to operate his \"open door\" policy in the Department. Four days before his death he was in the Department as usual. He returned home at his usual time but later that evening was taken to hospital by his wife. He survived for four days at the hospital during which time he did not regain consciousness.\nLe Cam was honoured for his many contributions in several different ways. He was President of the Institute of Mathematical Statistics in\n1973\n, elected to\nAmerican Academy of Arts and Sciences\nin\n1976\n, elected a Fellow of the American Association for the Advancement of Science in\n1977\n, made a member of the\nNew York Academy of Sciences\nin\n1982\n, and awarded an Honorary Degree by the Université Libre de Bruxelles in Brussel in\n1997\n."
}