{
  "nome_completo": "Manuela Garín Pinillos de Álvarez",
  "nome_curto": "Manuela Garín",
  "ano_nascimento": "1914",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Garin/",
  "lugar_nascimento": "Asturias, Spain",
  "lugar_morte": "Mexico City, Mexico",
  "biografia": "Let us begin this biography by stating that\nManuela Garín\nwas definitely born in Asturias, Spain. Some biographies claim she was born in Pilar Del Rio, Cuba, and this incorrect information is perfectly understandable since there is false official documentary evidence that she was born in Cuba; see for example\n[\n8\n]\ncontaining her entry record into the USA on\n26\nNovember\n1943\n. We shall explain below why this contradictory evidence exists.\nManuela Garín, known to her friends and colleagues as Mane, was the daughter of Domingo Garín y Viejo and Luisa Pinillos Urra. Domingo was born in\n1890\nin Pais Vasco, Spain, the son of Josefina and Canuto while Luisa was born on\n19\nAugust\n1886\nin Aragon, Spain, the daughter of Eusebia and Santiago. Three children were born in Asturias, Spain, Santiago Garin Pinillos\n(\nborn on\n27\nSeptember\n1912)\n, Manuela Garín Pinillos\n(\nborn on\n1\nJanuary\n1914\n, the subject of this biography\n)\nand Maria Luisa Álvarez Pinillos\n(\nborn\n1916)\n. Maria Luisa Álvarez appears to be a half-sister of Manuela having Luisa and Manuel Álvarez as her parents. Domingo Garín was a mining engineer and Luisa was a housewife taking care of the children.\nWorld War I began in July\n1914\nand Spain declared neutrality so was not directly involved. There was, however, consequences for the country with difficult economic conditions and Domingo and Luisa Garín decided to emigrate to Cuba in\n1917\n. Manuela's first memory came from that time\n[\n17\n]\n:-\n... my first memory, when I was maybe three years old, is standing on the deck of a ship, hand in hand with my mother, in the middle of the sea, watching a whale float on the horizon, covered with birds. With that unusual image, the world began for me, during a journey in the middle of the ocean. It would be\n1917\n.\nDomingo registered the three children who had been born in Asturias, Spain as being born in Pinar del Río, the capital city of Pinar del Río Province on the west most tip of Cuba. Domingo was employed by an American company to work at the copper mines which were in the westernmost part of the island of Cuba. This was a district of Cuba where there were no schools and so Manuela was taught by her parents until she reached the age of ten. She was taught reading, writing and mathematics by her father and developed a special love of mathematics. The family continued to grow with Dario Garin Pinillos born on\n22\nNovember\n1918\nand Josefina Garin Pinillos born on\n15\nMarch\n1922\n.\nSince the copper mining district had no schools, the family moved to Pinar del Río in\n1924\n. Manuela was able to attend schools in Pinar del Río since her parents had registered her as being Cuban born. She completed her primary education and then continued to study at a secondary school in Pinar del Río for two years. To understand the problems the family faced over the following years we have to look briefly at Cuban history.\nCuba was ruled by Spain from the end of the\n15\nth century but there were strong independence movements towards the end of the\n19\nth century. Armed conflict and the Spanish-American war led to Cuba becoming a protectorate of the United States and then independent as the Republic of Cuba in\n1902\n. The United States, however, retained the right to intervene in Cuban affairs. Problems, including military interventions, occurred over the following years. In\n1924\n, the year the Garín family moved to Pinar del Río, Gerardo Machado was elected president. The first years were ones of prosperity but after he was re-elected for a second term in\n1928\nprotests began which became increasingly violent. Machado became increasingly violent against his critics. Manuela Garín said in the interview reported in\n[\n19\n]\n:-\nIn\n1932\n, the Machado dictatorship was at its height, violence and repression reigned everywhere. We went to protest, but Machado responded by killing people. At that time, shark fishing was prohibited because personal belongings of the disappeared appeared there. High schools and the University were closed due to student riots and my father decided it was better for us to leave Cuba. He gave us the choice between going to Spain or Mexico. We chose Mexico thinking that this way we would be closer to Cuba and it would be easier for us to return when Machado fell. But we never came back, I didn't know that life had another destiny in store for me.\nThe Garín family had risked their lives helping the students who opposed Machado. The family owned an up-market car and when they travelled between Havana and Pinar del Río they picked up packages in Havana and delivered them to the opposition in Pinar del Río. The car had a boot which was always searched by the police but the packages were hidden in the glove compartment. Domingo Garín risked his life doing this since he certainly expected he would be killed if the police found the packages.\nLeaving Cuba was not that simple since Manuela and all her siblings had been registered as born in Cuba and, because of the violent protests against President Gerardo Machado, students were not allowed to leave Cuba. Manuela's mother had a friend who was able to arrange for the children to get false Spanish passports. The irony was, of course, that Manuela and two of her siblings had been born in Spain and would have been entitled to Spanish passports if they had not been falsely registered as being born in Cuba. She arrived in Mexico with a false Spanish passport and a false Cuban birth certificate but, having these documents, she had to continue to give her place of birth as Pinar del Río, Cuba. Her father, Domingo, was not given a visa so could not travel with the family to Mexico. He travelled to Spain but died there so, after leaving Cuba, Manuela never saw her father again.\nAfter arriving in Mexico City, Manuela Garín wanted to study at the National Preparatory School. The Escuela Nacional Preparatoria had been founded in\n1868\nand belonged to the National Autonomous University of Mexico. She wanted to take a year to obtain the necessary qualifications to enter but the state school she entered said she had to start from the beginning and take three years. She therefore moved to the Instituto Científico Motolinía, founded by María Dolores Echeverría Esparza in\n1918\nand run by nuns. She gained all the passes she needed to enter the National Preparatory School but, when she tried to enrol, she was refused on the grounds that she had not studied sports and singing for two years. By this time Gerardo Machado had been forced out of office and had left Cuba so Manuela Garín told her mother that if she was not allowed to enter the National Preparatory School in Mexico City she was going back to Cuba. Manuela's mother spoke to the Cuban ambassador in Mexico and asked him for help. He spoke to the Mexican Secretary of Public Education who arranged that Manuela be given certificates for two years study of sports and singing. She was accepted to study at the National Preparatory School.\nAt the National Preparatory School Garín studied chemistry. She had wanted to study a subject close to mathematics like engineering but her mother said that was not a career for a woman. Garín's mother said if she studied chemistry she could work in a pharmacy but the thought of serving behind a counter appalled Manuela. She did, however, sign up to study chemistry and found that the classes had a large majority of women. She said\n[\n5\n]\n:-\nI didn't like chemistry in the sense that the laboratory seemed to me like a cooking class that had nothing to do with the theoretical class, well, that didn't attract me to the subject.\nShe did, however, have two excellent mathematics teachers,\nCarlos Graef Fernández\nand\nAlfonso Nápoles Gándara\n. She said\n[\n19\n]\n:-\nGraef\nwas a nice man, a very good teacher and a man of great human qualities. His laughter in the first yard could be heard as far as the third yard of the high school.\nIt was\nAlfonso Nápoles Gándara\nwho encouraged Garín to study mathematics in the School of Physical-Mathematical Sciences of the Universidad Nacional Autónoma de México\n(\nUNAM\n)\n. Although students of chemistry were officially allowed to enter mathematical sciences, two ladies in the administration tried to prevent her from doing so. The engineer Ricardo Monges López, head of the School of Physical-Mathematical Sciences, stepped in and allowed Garín to begin her studies of mathematics at the UNAM in\n1937\n. She said in an interview\n[\n19\n]\n:-\nThe School of Sciences was the adopted daughter of the Faculty of Engineering. We had classes in a little corner on one side of the stairs. There was the blackboard, the teacher's place and four seats. There was no more. There was not a very defined study plan and everyone took the subjects they wanted. I began my studies in\n1937\ntogether with\nEnriqueta Gonzáles Baz\n,\nFélix Recillas\nand a metallurgical engineer named Gal. We were really the first generation to follow a structured curriculum.\nFor financial reasons,\nFélix Recillas\ngave up his studies. There was a rule that courses could only be put on for a minimum of three students so Gal was persuaded to register for courses he did not take so that Manuela and Enriqueta could study them. Although Manuela and\nEnriqueta\nhad the same academic interests, they were not really friends since their political views were very different. Explaining her political views, Manuela said\n[\n19\n]\n:-\n... the fact of having left Cuba because of the political climate marked me forever. I participated from a young age in all the student movements, in support of the Spanish civil war, the oil expropriation and others.\nIn her first year in the School of Physical-Mathematical Sciences she had Raúl Alvarez as a fellow student in some courses given jointly to mathematics and physics students. He was intending to obtain a physics degree at that time but later changed to engineering. They shared left-wing political views and soon became close friends. Manuela and Raúl became engaged, although she warned him that she would not marry him until she finished her degree. After completing her studies, Manuela Garín married Raúl Alvarez Encarnación on\n19\nOctober\n1940\n. Let us note that, although completing the course work, she left before completing the thesis necessary to graduate. Only many years later did she write her thesis and graduate with a Master's Degree.\nAfter their marriage, Manuela and Raúl Alvarez moved north living first in Ensenada and later in Monterrey. Over the following years Manuela taught in a high school and for around five years at the Tecnológico de Monterrey. It had only been founded about four years before she arrived there and, together with other mathematicians, decided to give special mathematics classes and try to persuade students in engineering to move to mathematics. Before moving to Monterrey she had two children, Raúl Álvarez Garín was born in Mexico City on\n9\nAugust\n1941\nand Tania Álvarez Garín was born in Ensenada early in\n1943\n. In the interview\n[\n17\n]\nshe explained how she began teaching. She never wanted to be a housewife and made it known that she wanted to teach mathematics:-\nOne day my mother-in-law says to me: \"Hey, can't you live on with what your husband earns?\" I answered, \"yes, but if I had a career and was working I could add a little to Raúl's, paying someone to look after the house while I dedicate myself to mathematics, so why don't I go to work?\" Thus the matter of an unconventional wife was settled. And since my husband never forbade me ... well, that's how I continued. It was the\n40\ns of course.\nFor more information about Manuela's two children and how she was involved with them, see\nTHIS LINK\n.\nThe Institute of Geophysics at the UNAM was founded by the engineer Ricardo Monges López\n(1886\n-\n1983)\n. He was commissioned to propose a plan for creating the new Institute in July\n1946\nand was helped by his assistant\nJulián Adem\n. From the founding of the UNAM Institute of Geophysics, Manuela Garín de Alvarez worked there as a researcher. She worked on mathematical models of geomagnetism, using matrix methods and, in\n1946\n, she published the paper\nDecomposition of the matrix of the general Lorentz transformation into simple factors\n(\nSpanish\n)\nin the\nBulletin\nof the\nMexican Mathematical Society\n.\nHarold Ruse\nwrites in the review\n[\n18\n]\n:-\nDecomposition of the general\nLorentz\ntransformation L into the form L = ABC, where the matrices A, C represent rotations of axes in the ordinary sense of analytical geometry, and B a special\nLorentz\ntransformation\n(\none affecting the time-variable and only one of the space-variables\n)\n.\nShe began teaching in the Faculty of Engineering at the Universidad Nacional Autónoma de México in\n1951\n. In the following year she began teaching at the Faculty of Science. Among the topics she taught were calculus, analytical geometry and modern algebra. She explained that the Faculty of Engineering wanted engineers to teach their students mathematics rather than mathematicians since mathematicians tended to teach theoretical mathematics in a rigorous way. They were, however, happy with the way she taught mathematics and encouraged her to continuing to teach engineers.\nThe\nMexican Mathematical Society\nwas founded in\n1943\nwhile Manuela was at Ensenada. She became a member and attended congresses held in Guadalajara and Monterrey. She said\n[\n19\n]\n:-\nThey were beautiful, family congresses, we all knew each other.\nShe was in Mérida where she gave some courses organised by the\nMexican Mathematical Society\nto prepare engineering professors at the University of Yucatán to study for their bachelor's degree in mathematics.\nThe University of Sonora was founded in Hermosillo in\n1942\nand, in\n1963\n, they made the decision to set up a School of Advanced Studies with the intention of strengthening the institution academically and training higher level teachers that were required in the State. The staff were mostly those in engineering and it began its work in March\n1964\n. Moisés Canale Rodríuez, who was rector of the University of Sonora from\n1961\nto\n1965\n, asked Manuela to be the first director of the School of Advanced Studies and head of its Mathematics Department\n[\n4\n]\n:-\nI told the rector, Dr Canale, a very nice person, I said to him: \"Look doctor, I would be enthusiastic, I would be happy starting that School, but my family, what do I do with it?'\" He replied, \"Bring it to Sonora, I will give everyone a job.\" But no, Tania was dedicated to ballet and no, she couldn't go.\nAt that time her son Raúl Álvarez Garín had just married and Manuela's mother Luisa told her that if Manuela wanted to take the job, she would look after the house for her husband and daughter. She talked a little about her time in Hermosillo in the interview\n[\n4\n]\n:-\nI was the director, and I had to prepare the study plans and present them to the University Council, a great job. But I was very happy, I lived near the University and the classes were in the afternoon. The little school building they gave me had been a High School, they gave me that building and we organised it very well. I told Dr Canale, the rector: \"Listen, doctor, I want to open a cafeteria, because I need to go for a coffee with a donut at mid-morning because if not the battery will run out,\" He told me, \"But ma'am, here the school principals don't want to have cafeterias.\" I said, \"I promise that my cafeteria will be very orderly, doctor.\" And then that little school had a room where I organised my cafeteria. I made sure there was a door on the outside so that people could come and go freely. I was very happy there. Then it was given the name 'Physics, Mathematics and Letters'. The school secretary took care of Literature, he was a very nice person, he always consulted me about everything. As for Physics and Mathematics, Román Alvarez, my nephew, and Carmen Varea, his wife, who had just graduated and whom I took as teachers there, helped me a lot. The school was founded, although it was later separated, because the University was greatly enlarged, as is natural everywhere.\nJorge Ontiveros paid a tribute to Manuela Garín de Alvarez during the closing ceremony of the XXXI National Congress of the\nMexican Mathematical Society\nin Hermosillo in\n1998\n[\n13\n]\n:-\nAt the end of\n1964\n, Manuela Garín de Álvarez arrived at the University of Sonora as the first director of the School of Advanced Studies and head of its Mathematics Department and brought order out of chaos. Just like the missionaries and pioneers who, regardless of distance, opened the roads of Sonora to civilisation, Maestra Garín left behind family, husband and children, colleagues and friends and came to build the foundations of an educational work that is already bearing fruit.\nOne way in which she raised the profile of the University of Sonora was in organising the IX National Congress of the\nMexican Mathematical Society\nin Hermosillo in February\n1966\n. It was a great success and she was asked to organise the\n1969\nCongress in Guadalajara.\nBack in Mexico City, she returned to teaching in the Faculty of Engineering. She wrote a thesis on probability advised by Remigio Valdés Gámez\n(1918\n-\n2013)\n. He had studied in the United States, first at Princeton University and then probability and statistics at Columbia University. After completing her thesis Manuela was awarded an M.Sc.\nShe taught mathematics in the Faculty of Engineering until\n1989\nwhen she retired and was named Emeritus Professor of the Faculty of Engineering of the UNAM.\nLet us quote from\n[\n14\n]\nManuela's views about the importance of mathematics:-\nToo bad not everyone has a university degree, because it gives you another way of thinking. It is not about people just absorbing information, but knowing how to see things and analyse them. For that, mathematics is essential, it is the fundamental thing to train you in logical processes. It would be a good thing if everyone was a mathematician!\nFinally, some descriptions from those who knew her well.\nP Saavedra and M Neumann write in\n[\n19\n]\n:-\nManuela is a small, thin woman, with very lively eyes and a smile on her lips. She is a warm, open woman, with clear opinions that reveal her strength of character.\nBlanche Petrich writes in\n[\n16\n]\n:-\nRevolution, mathematics, camaraderie and teaching were some of the battles of this woman who was a migrant girl from Asturias to Cuba during the convulsed years of the First World War; she later took refuge in Mexico, fleeing the Cuba of Gerardo Machado. Mane, as her many friends called her, was a pioneer in science, she spent five decades of her life in the classroom, mother of the greatest exponent of the\n1968\nstudent movement and a notable dancer, activist for the freedom of political prisoners and reformer of teaching mathematics in schools and universities in the country. She died yesterday. She had completed\n105\nyears of fruitful life.\nOn\n8\nMarch\n2020\n, within the framework of the International Day of Women and Girls in Science, the Government of Mexico City announced the \"Manuela Garín Pinillos\" Competition, aimed at girls and adolescents in primary, secondary and high school in the\n16\nmunicipalities, and whose objective is to promote science among this group of the population\n[\n1\n]\n:-\nThe reason for the name of the competition \"Manuela Garín Pinillo\" is because this person was one of the first female mathematicians in the country, she was also a teacher at the UNAM Faculty of Sciences and a social activist who participated in the student movement of\n1968\n."
}