{
  "nome_completo": "Marcel Louis Brillouin",
  "nome_curto": "Marcel Brillouin",
  "ano_nascimento": "1854",
  "ano_morte": "1948",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brillouin/",
  "lugar_nascimento": "Melle, Deux-Sèvres, France",
  "lugar_morte": "Paris, France",
  "biografia": "Marcel Brillouin\n's father was the painter, illustrator and lithographer Louis George Brillouin\n(1817\n-\n1893)\n. George Brillouin was born on\n22\nApril\n1817\nat Saint Jean d'Angély, Charente Maritime, to Louis Brillouin and Marguerite Sorin. He studied at the École des Beaux Arts entering in\n1840\n. He became a pupil of Michel Martin Drolling and Louis-Nicolas Cabat and began exhibiting at the Paris Salon in\n1843\n. He was a highly successful painter, awarded a gold medal in\n1865\n. His work is represented in the museums of Pontoise and Reims, the latter as part of the Vasnier Collection. He married Marie Andrault\n(1833\n-\n1922)\nat Saint-Martin-lès-Melle on\n23\nMarch\n1854\n. Marie was the daughter of Pierre Théodore Andrault\n(1805\n-\n1898)\nand Anne Charlot de La Vergne\n(1811\n-\n1892)\n. George and Marie Brillouin had two children,  Louis Marcel Brillouin\n(\nborn\n19\nDecember\n1854\n, the subject of this biography\n)\nand Jean Baptiste Pierre André Brillouin\n(1858\n-\n1928)\n(\nborn on\n25\nSeptember\n1858)\n. André Brillouin became an engineer and provided electric light to replace gas lighting.\nMarcel Brillouin was born in Saint-Martin-lès-Melle, the home of his mother, but the family lived Paris where Marcel was educated. He attended the Lycée\nCondorcet\nalthough when he began his studies there it was named the Imperial High School Bonaparte. This school, one of the oldest and most prestigious high schools in Paris, had been founded in\n1803\nwhen it was named the High School of the Chaussée d'Antin, but by\n1805\nit had been renamed the Imperial High School Bonaparte. It had another name change being the Royal College of Bourbon between\n1815\nand\n1848\nbut, then reverted to the name Imperial High School Bonaparte. This was not a good time to be in Paris. France declared war on Prussia on\n19\nJuly\n1870\nbut suffered defeats and by\n1\nSeptember\n1870\nthe Prussian army began to besiege Paris. The Brillouin family, having left Paris to avoid the worst problems of the war, went to Melle to live in the home of Marcel's maternal grandfather Pierre Théodore Andrault\n(1805\n-\n1898)\n.\nThis home in Saint-Martin-lès-Melle was the Château de Chaillé which had been built around\n1604\non the remains of an old medieval castle. It had been bought by Pierre Théodore Andrault's father, the Andrault family having made money from coffee plantations. While at the Château de Chaillé, Marcel Brillouin read the philosophy books belonging to his grandfather during the two years,\n1870\n-\n1871\n, he spent there. When France surrendered to Prussia in early\n1871\nthe war was over and peace was finalised at the Treaty of Frankfurt on\n10\nMay\n1871\n. Brillouin was able to return to Paris in\n1872\nand, having spent the intervening time well, excelled at his studies. He was back at the same Lycée but it had been renamed the Lycée\nCondorcet\non\n22\nOctober\n1870\n. He showed a remarkable talent for mathematics and, in\n1873\n, was ranked top in the Concours Général in elementary mathematics. In the following year he won the prize for special mathematics in the Concours Général. His first publication appeared in\n1874\n, being the solution to a geometry problem.\nHe entered the École Normale Supérieure in\n1874\ngraduating in\n1878\n. Despite his outstanding mathematical abilities, it was physics that Brillouin concentrated on, perhaps being influenced by Pierre Auguste Bertin\n(1818\n-\n1884)\nwho was a physicist and Deputy Director of the École. After graduating from the École Normale, Brillouin was a physics assistant to Eleuthère Elie Nicolas Mascart\n(1837\n-\n1908)\nat the Collège de France while he worked for his doctorate in mathematics and physics which was awarded in\n1881\n. Mascart, who had studied at the École Normale Supérieure, had been awarded his doctorate in\n1864\n, and taught at the Lyceum in Metz and at Versailles before being appointed to the chair of general and experimental physics in the Collège de France. Let us look Brillouin's papers and theses from the years\n1878\n-\n1882\n.\nBrillouin's first research publication, published in the\nJournal de Physique Théorique et Appliquée\nin\n1878\n, was\nLiquéfaction des gaz\nⓉ\n(\nGas liquefaction\n)\n. He presented his theses for the doctorate of mathematical sciences in July\n1880\nand they were published in the\nAnnals\nof the École Normale Supérieure in January\n1881\n. He published\nÉtablissement des courants électriques dans un système quelconque de les conducteurs immobiles\nⓉ\n(\nEstablishment of electric currents in any system of stationary conductors\n)\nin\n1881\nin which he states:-\nI give here only the manner of establishing the equations of the problem and the statement of the main results. The reader will find the details of the proofs and the examples in my original memoir \"Theses for the doctorate in mathematical sciences, Annales de l'École Normale, January\n1881\n.\"\nHis thesis was\nIntégration des équations différentielles auxquelles conduit l'étude des phénomènes d'induction dans les circuits dérivés: Propositions données par la faculté, par Marcel Brillouin\nⓉ\n(\nIntegration of the differential equations to which the study of induction phenomena in derived circuits leads: Proposals given by the faculty, by Marcel Brillouin\n)\n(1880)\nand was, as he states in the above quote, published in January\n1881\n. The Introduction states\n[\n3\n]\n:-\nWhen electric currents, having reached their permanent state, circulate in any system of conductive wires,\nOhm\n's laws allow one to easily study their distribution between these wires. But, during the variable period, these laws are no longer applicable. The sharing of the current between the wires then depends on the phenomena of induction, and this has only been studied, to my knowledge, in a limited number of particular cases. It is the general study of the laws of this division, leading to a precise rule for the formation of the unique algebraic equation to which the question is reduced, which is the subject of this work.\nThe first part relates to a particular system of wires. The second relates to any network of wires, each of which is at least part of a closed circuit. We can then neglect the capacity of the wires, and consider each of them as being traversed at each moment by the same current in its entire length. These are only wires which do not undergo either displacement or deformation, and in the vicinity of which no magnet moves. The resistances are assumed to be constant, as well as the electromotive force of the batteries. The variations in intensity may be due to any change in the state of the network, provided that it leaves all circuits closed. These are: the simultaneous closing of all circuits which contain batteries; instantaneous substitution, at any number of the batteries, of wires of the same resistance, or the reverse substitution. These substitutions can take place either during the steady state or at any time during the variable period, which abruptly alters the constants which depend on the initial state, without changing the differential equations.\nAnton Oberbeck explains in the review\n[\n6\n]\nthat Brillouin is incorrect in believing this has not been studied before:-\nIn the introduction to his treatise the author expresses the opinion that the general problem of the distribution of variable currents in branched conductor systems has not yet been dealt with. Here he is mistaken, which testifies to a very poor knowledge of the relevant literature. The problem in question was probably first posed and solved in general by\nHelmholtz\nin\n1851\n. The author's explanations therefore do not differ in principle from the first treatment, apart from a few mathematical additions. In the first part of the present treatise, the formation of currents in n different circuits is discussed, which act on one another by mutual induction. The calculation of the variable currents leads to a system of n linear differential equations with n dependent variables.\nIn\n1881\n, Brillouin also published\nDu partage des courants instantanés\nⓉ\n(\nSharing instantaneous currents\n)\nin which he states he is a \"Doctor of Mathematical Sciences.\" A major publication in\n1882\n,\nComparaison des coefficients d'induction\nⓉ\n(\nComparison of induction coefficients\n)\n, must also be one of two theses he submitted for his doctorate. By the time this paper was published he states he is \"In charge of the physics course at the faculty of Science at Dijon.\" He expresses his thanks to his advisor as follows:-\nAll the precise experiments cited in this thesis were performed at the Physics Laboratory of the Collège de France, the best electrical devices of which were made available to me by M Mascart. Allow me to express to him here all my gratitude for the kind attention with which he has followed the progress of this work.\nHis Introduction begins as follows\n[\n4\n]\n:-\nWe know of what importance, of what daily use the methods of comparison of electrical resistances, electromotive forces and capacities are in laboratories. The best experimental arrangements are not always those which lend themselves most easily to theoretical calculation, even when great precision is not necessary; it is thanks to the method of comparison that it is possible to satisfy these two conditions separately. In addition to the resulting facilities for absolute measurements, these methods are essential in all industrial applications in which direct calculations would be unaffordable. So far, however, the methods of comparing induction coefficients do not seem to have become practical. Having found in\nMaxwell\n's great 'Treatise' a succinct indication of methods of comparison, based, like the precise methods mentioned above, on the reduction to zero of the current in one of the wires of a closed circuit, I undertook to study the conditions under which these methods are sensitive and accurate.\nIn all these methods, the currents induced by variation of intensity are used. When, through a certain wire, the intensity of the permanent current and the total quantity of electricity of the instantaneous current produced by the closing of the circuit which contains the battery are zero, there exists between the coefficients of induction of the various wires of the circuit and their resistances a homogeneous relation separately with respect to these two orders of variables. Under certain conditions, two induction coefficients alone subsist, and their ratio is given by a ratio of resistances. A sensitive galvanometer, well graduated resistor boxes as rigorously as possible devoid of their own induction coefficient, are the essential instruments.\nAnton Oberbeck writes in the review\n[\n7\n]\n:-\nThis extensive paper contains an experimental test of various methods given by\nMaxwell\n(\n'Treatise on electricity II'\n)\nto test the induction coefficients of coils. This can be either the induction effect of one coil on a second, when a current is passed through the former, or the self-induction of a coil, when a current flowing through it opens and closes. One can therefore compare:\n1)\nThe mutual induction coefficients of two pairs of coils,\n2)\nthe self-induction coefficients of two coils,\n3)\na coefficient of the first and second kind. A more detailed discussion of the methods used here should not be in place here. We therefore only want to mention briefly that the last two determinations are carried out by a Wheatstone bridge arrangement in which the bridge wire remains de-energised not only when there is a constant current but also when it is opened and closed by suitable determination of the resistance. The calculation of the coefficients in question is done according to the formulas already given by\nMaxwell\n. The author has examined a not unimportant source of error in more detail. It consists of the property of tightly wound coils to act as condensers. The influence of this phenomenon on the determination of the induction coefficients is discussed in the last section of the paper.\nHe then held posts as assistant professor of physics in the Faculty of Science at Dijon, at Nancy and at Toulouse before returning to Paris to the École Normale Supérieure in\n1887\n. On\n18\nJuly\n1888\n, Brillouin married Charlotte Marguerite Mascart\n(1867\n-\n1946)\nin Paris. She was the third of the seven children of Eleuthère Elie Nicolas Mascart and his wife Françoise Léontine Briot\n(1843\n-\n1910)\n. Mascart was the professor whom Brillouin had worked under at the Collège de France and who had supervised his doctoral studies. Françoise Léontine Briot, known as \"Fanny\", was the daughter of the mathematician Charles Auguste Briot. Marcel and Charlotte Brillouin had three children: Léon Nicolas Brillouin\n(1889\n-\n1969)\n; Jacques Brillouin\n(1892\n-\n1971)\n; and Madeleine Brillouin\n(1894\n-\n1978)\n. Let us note that Léon Brillouin studied at the École Normale Supérieure from\n1908\nto\n1912\n, then went to the Ludwig Maximilian University of Munich where he studied under\nArnold Sommerfeld\n. He undertook war work during World War I, then completed his doctoral studies in Paris with a dissertation on quantum theory. He became a professor of theoretical physics in France but left for the United States in\n1940\nwhere he worked for the rest of his career. The Brillouin zones of solid state physics are named for Léon Brillouin. Jacques Brillouin became a composer.\nAfter the papers connected with his thesis, Brillouin published\nSur la torsion des prismes\nⓉ\n(\nOn the torsion of prisms\n)\n(1886)\n,\nEssai sur les lois d'élasticité d'un milieu capable de transmettre des actions en raison inverse du carré de la distance\nⓉ\n(\nEssay on the laws of elasticity of a medium capable of transmitting actions in inverse ratio to the square of the distance\n)\n(1887)\n,\nQuestions d'hydrodynamique\nⓉ\n(\nHydrodynamic issues\n)\n(1887)\n,\nNote sur un point de thermodynamique\nⓉ\n(\nNote on a point of thermodynamics\n)\n(1988)\n,\nChaleur spécifique pour une transformation quelconque et thermodynamique\nⓉ\n(\nSpecific heat for any transformation and thermodynamics\n)\n(1888)\n, and\nDéformations permanentes et Thermodynamique\nⓉ\n(\nPermanent deformations and thermodynamics\n)\n(1888)\n.\nIn\n1891\nBrillouin published the book\nRécherches récentes sur diverses questions d'hydrodynamique exposé des travaux de von Helmholtz, Kirchhoff, Sir W Thomson, Lord Rayleigh, etc.\nⓉ\n(\nRecent research on various questions of hydrodynamics exposition of the works of von Helmholtz, Kirchhoff, Sir W Thomson, Lord Rayleigh, etc.\n)\nThe Preface begins a follows:-\nIn this first Revue de Physique, I propose to present the main progress made in the study of the phenomena of movement of liquids over the past twenty years. It was the illustrious professor of the University of Berlin,\nM H von Helmholtz\n, who, in a Memoir published in\n1858\nand in a short Note of\n1868\n, put forward the two capital ideas, the origin of many and important works of von\nKirchhoff\n,\nRayleigh\n, J Thomson, and the speculations of such an original genius as\nSir W Thomson\n.\nDespite the obvious accuracy of the equations of the Hydrodynamics of perfect or low viscosity fluids, certain phenomena of daily observation, the formation and persistence of swirling rings, that of jets, had remained without explanation. Today these phenomena are explained in their general characters, and it does not seem doubtful that the numbers furnished by the experiment are themselves in conformity with the theory when the efforts of the mathematicians make it possible to treat completely some particular cases of these singularly difficult problems.\nFrom\n1900\nto\n1931\nMarcel Brillouin was Professor of Mathematical Physics at the Collège de France. He attended the first Solvay Conference in\n1911\nand, in the closing discussion, said:-\nIt has become necessary to introduce a discontinuity into our physical ideas, an element that can change only in jumps, whose existence we had not suspected until a few years ago.\nIn\n1912\nhe was awarded the Prix La Caze by the\nAcadémie des Sciences\n. This prize, created with a donation by Louis La Caze and first awarded in\n1870\n, was to recognise a major contribution in physiology, physics or chemistry. Brillouin was elected to the\nAcadémie des Sciences\non\n21\nNovember\n1921\n.\nBrillouin wrote around\n200\npapers on theory and experiment. The topics he wrote on were the kinetic theory of gases, viscosity, thermodynamics, melting conditions and electricity. Around\n1900\nhe built a new model of the\nEötvös\nbalance. He also wrote on\nHelmholtz\nflow and the stability of aircraft. An early worker on atomic structure he studied the\nBohr\nmodel of the atom. His results here were used by\nde Broglie\nand\nSchrödinger\n. Another topic which he worked on was the theory of the tides, a topic which he began to study around\n1925\n. His research contributions are summarised by Reinhold Fürth as follows\n[\n5\n]\n:-\nIn hydrodynamics he did fundamental work on the theory of discontinuity surfaces in liquid flow and the formation of vortices on similar lines to\nHelmholtz\n, and in aerodynamics he developed a theory of the dispersion of sound. In thermodynamics he devoted himself to the study of permanent deformations of solids and to the specific heat of black body radiation, and he derived the proportionality of this quantity with the third power of absolute temperature. The kinetic theory of matter was enriched by Brillouin's contributions to the theory of diffusion and viscosity in gases and liquids, and he also took part in the once topical controversy on the apparent contradiction in statistical mechanics between the reversibility of the laws of dynamics and the irreversibility of those of thermodynamics. He was very much interested in geophysics as well, and he contributed to this branch of applied physics by papers on the circulation of the atmosphere, the formation of rain, the theory of the tides, etc. An outstanding piece of research in this field consisted in a series of precision measurements of gravity within the Simplon tunnel aiming at a determination of the shape of the 'geoid'. Although naturally his main activity was in the domain of 'classical' physics, he was nevertheless actively interested in the theory of relativity and in quantum theory, where he made an early attempt to give a representation of quantum phenomena in terms of a continuum theory.\nTwo books by Brillouin, in addition to the one mentioned above, are\nPropagation de l'Électricité: Histoire et Théorie\nⓉ\n(\nPropagation of electricity: history and theory\n)\n(1904)\nand\nLeçons sur la Viscosité des Liquides et des Gaz\nⓉ\n(\nLessons on viscosity of liquids and gases\n)\n(1906\n-\n07)\n. For more information on these two books and Brillouin's\n1891\nbook mentioned above, see\nTHIS LINK\n.\nIn\n[\n2\n]\nBrillouin is described as follows:-\nThe interests of this wide-ranging, open minded scientist extended from history of science to the physics of the earth and the atom.\nReinhold Fürth writes in\n[\n5\n]\n:-\nHe belonged to a generation of men of science who could not only master the whole realm of their subject but also make important original contributions to almost every branch of it. As a result they were able to present that subject to their students in a most perfect form, thus providing them with a solid foundation for their own future activities in this field. Prof Brillouin's lecture courses at the College de France provide an outstanding example of this almost extinct art, and many of them have been published in book form, like the well-known \"Leçons sur la viscosite des liquides et des gaz.\"\nFor further details of Brillouin's research, see the obituary by Henri Villat at\nTHIS LINK\n.\nBrillouin was friends with most of the top scientists of his day. In particular he was friends with Lord Kelvin\n(\nWilliam Thomson\n)\n,\nLorentz\n,\nPlanck\nand\nSommerfeld\n.\nBrillouin died in Paris but was buried in Saint-Martin-lès-Melle, Deux-Sèvres."
}