{
  "nome_completo": "Marek Kuczma",
  "nome_curto": "Marek Kuczma",
  "ano_nascimento": "1935",
  "ano_morte": "1991",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuczma/",
  "lugar_nascimento": "Katowice, Poland",
  "lugar_morte": "Katowice, Poland",
  "biografia": "Marek Kuczma\nattended primary and secondary school in Katowice before going to Kraków to study at the Jagiellonian University. After obtaining his first degree he continued to study there for his doctorate under the supervision of\nStanisław  Gołąb\n. He had already obtained new research results starting from around\n1956\nand he published a large number of papers over the next few years before he submitted his doctoral thesis. For example in the student years he published papers such as:\n(\nwith\nStanisław Gołąb\nand Z Opial\n)\nLa courbure d'une courbe plane et l'existence d'une asymptote\nⓉ\n(\nThe curvature of a plane curve and the existence of an asymptote\n)\n(1958)\n,\nOn convex solutions of the functional equation\ng\n[\na\n(\nx\n)\n]\n−\ng\n(\nx\n)\n=\nj\n(\nx\n)\ng[a(x)] - g(x) = j(x)\ng\n[\na\n(\nx\n)\n]\n−\ng\n(\nx\n)\n=\nj\n(\nx\n)\n(1959)\n,\nOn the functional equation\nj\n(\nx\n)\n+\nj\n[\nf\n(\nx\n)\n]\n=\nF\n(\nx\n)\nj(x) + j [f (x)] = F(x)\nj\n(\nx\n)\n+\nj\n[\nf\n(\nx\n)\n]\n=\nF\n(\nx\n)\n(1959)\n,\nOn linear differential geometric objects of the first class with one component\n(1959)\n,\nBemerkung zur vorhergehenden Arbeit von M Kucharzewski\nⓉ\n(\nRemarks on the previous work of Kucharzewski\n)\n(1959)\n,\nNote on convex functions\n(1959)\n, and\n(\nwith Jerzy Kordylewski\n)\nOn some functional equations\n(1959)\n.\nKuczma was awarded his doctorate from the Jagiellonian University of Kraków in\n1961\nand continued to work there towards his\nhabilitation\n. In October\n1963\nhe submitted his habilaitation thesis to the Jagiellonian University. This was exactly the time when the Jagiellonian University was opening a new branch in Katowice and Kuczma was sent there to coincide with the opening in October\n1963\n. Although he was a newly appointed\ndocent\n, Kuczma immediately assumed the role of head of the mathematical section of the Katowice branch of the Jagiellonian University. In addition he was elected as vice-dean of the Faculty of Mathematics, Physics and Chemistry of the Jagiellonian University, and was responsible for the running of the Katowice branch of that Faculty. On\n1\nDecember\n1966\n, in addition to these position which he continued to hold, Kuczma became head of the Department of Functional Equations at Katowice. He also worked at the Mathematical Analysis Section of the Mathematical Institute of the\nPolish Academy of Sciences\nfrom\n1966\n. During this period he supervised the doctoral studies of students both at the Jagiellonian University and at the\nPolish Academy of Sciences\n.\nIn\n1968\na change occurred since the Katowice branch of the Jagiellonian University became an independent university, named the Silesian University of Katowice. From the founding of the new University, Kuczma became the head of the mathematics section and head of the department of functional equations. However the new university soon produced a new structure and so from\n1969\nKuczma was appointed to the new position of Director of the Mathematical Institute. He held this post for four years until\n30\nSeptember\n1973\n. Also during this period he worked at the Section of Complex Automatic Systems of the\nPolish Academy of Sciences\nwhich was situated in the Katowice district. He also undertook other duties such as serving of the Council of the Mathematical Institute of the Silesian University and on the corresponding Council for the nearby Technical University of Gliwice.\nDespite heavy administrative and teaching responsibilities, Kuczma maintained a remarkable research record with numerous publications. Perhaps it was the excessive work-load that he undertook that led to his health problems. These struck in\n1978\nwhen he was in his early\n40\n's in the form of stroke. Severely disabled by the stroke, nevertheless Kuczma undertook therapy and eventually was able to return to each at the university. Sadly he suffered a second stroke not long after he resumed his duties and this time he was confined to a wheel-chair\n[\n4\n]\n:-\n... a second stroke restricted him to a wheel-chair and to the modest interiors of his flat at Mikolowaka Street in Katowice. There he could manage exclusively due to the care, angelic patience and devotion of his wife Krystyna.\nAlthough badly disabled and confined to his flat, Kuczma was able to continue to undertake research and publish papers and books. In fact he published around\n30\npapers during the\n1980\ns despite his severe disability and in\n[\n2\n]\nBogdan Choczewski looks at these.\nWe now look briefly at the three books which Kuczma published. The first of these\nFunctional equations in a single variable\nappeared in\n1968\nand was the first book to be written on this topic. M A McKiernan writes in a review:-\nThis is the first book ever published on functional equations in a single variable ... The related questions of commuting functions, continuous iteration, and\nSchröder\n's and\nAbel\n's functional equations are also treated. ... The book stresses real variables and weak regularity conditions\n(\nbut analytic functions are also treated\n)\n... The author has succeeded in the monumental task of organizing the literature\n(63\npages of bibliography\n)\nand has presented the material in a unified coherent form; this is the first time that this has been done. Many of the theorems are of general interest; the occasional theorem requiring lengthy and tedious proof should not discourage the general reader. ...\nKuczma's second book was\nAn introduction to the theory of functional equations and inequalities. Cauchy's equation and Jensen's inequality\npublished in\n1985\n. János Aczél writes in a review:-\nProbably even the most devoted specialist would not have thought that about\n300\npages can be written just about the\nCauchy\nequation\n(\nand on some closely related equations and inequalities\n)\n. And the book is by no means chatty, and does not even claim completeness. ... In the opinion and experience of this reviewer this is a very useful book and a primary reference not only for those working in functional equations, but mainly for those in other fields of mathematics and its applications who look for a result on the\nCauchy\nequation and/or the\nJensen\ninequality.\nHis final book\nIterative functional equations\nwas written jointly with Bogdan Choczewski and Roman Ger who had worked for his doctorate with Kuczma at the Silesian University of Katowice, graduating in\n1971\n. Jaroslav Smital describes the book in a review\n(\nwhich was used by the publisher\nCambridge University Press\nto create its own publicity for the work\n)\n:-\nThe book is a cohesive and exhaustive account of contemporary theory of iterative functional equations. It contains many results that have appeared before only in the research literature. Fundamental notions such as existence and uniqueness of solutions of equations under consideration are treated throughout the book as well as a surprisingly wide scale of examples showing applications of the theory in dynamical systems,\nergodic theory\n,\nfunctional analysis\n, functional equations in several variables, functional inequalities, geometry, iteration theory, ordinary differential equations, partial differential equations, probability theory and stochastic processes. The book ends with a comprehensive bibliography covering papers published mostly during the last\n40\nyears.\nRoman Ger writes in\n[\n4\n]\n:-\n... the paramount achievement of Professor Marek Kuczma was the creation and development of a systematic theory of iterative functional equations and founding a mathematical school centred around the seminar conducted by him since October\n1964\n. ... Kuczma was considered an outstanding mathematician highly esteemed by the international community of specialists; among the functional equationists he had commonly been treated as one of the informal leaders. His personality and influence allowed him to enjoy the respect of his entourage but also of people with loose, if any, connections to mathematics. His ingenuity, efficiency and his ability of getting fast to the crux of the matter, his uncompromising attitude and adherence to honest and respectable principles of life - all these made Kuczma a great Teacher. A rich and fruitful career has come to an end."
}