{
  "nome_completo": "Maria Gaëtana Agnesi",
  "nome_curto": "Maria Agnesi",
  "ano_nascimento": "1718",
  "ano_morte": "1799",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Agnesi/",
  "lugar_nascimento": "Milan, Habsburg Empire (now Italy)",
  "lugar_morte": "Milan, Habsburg Empire (now Italy)",
  "biografia": "Maria Gaetana Agnesi\nwas the daughter of Pietro Agnesi who came from a wealthy family who had made their money from silk. Pietro Agnesi had twenty-one children with his three wives and Maria was the eldest of the children. As\nTruesdell\nwrites in\n[\n20\n]\n, Pietro Agnesi:-\n... belonged to a class intermediate between the patricians and the merely rich. Such a bourgeois could have a household fit for a lord, comport himself like a knight, mingle freely with some nobles, occupy himself with the finer things of life, be a patron of men of talent.\n[\nPietro Agnesi\n]\ndid just that...\nSome accounts of Maria Agnesi describe her father as being a professor of mathematics at Bologna. It is shown clearly in\n[\n16\n]\nthat this is entirely incorrect, but the error is unfortunately carried forward to\n[\n1\n]\nand will also be seen in a number of other places.\nPietro Agnesi could provide high quality tutors for Maria Agnesi and indeed he did provide her with the best available tutors who were all young men of learning from the Church. She showed remarkable talents and mastered many languages such as Latin, Greek and Hebrew at an early age. At the age of\n9\nshe published a Latin discourse in defence of higher education for women. It was not Agnesi's composition, as has been claimed by some, but rather it was an article written in Italian by one of her tutors which she translated and\n[\n20\n]\n:-\n... she delivered it from memory to an academic gathering arranged by her father in the garden...\nIn\n1738\nshe published\nPropositiones Philosophicae\na series of essays on philosophy and natural science. The volume contained\n191\nphilosophical theses which Agnesi would defend in disputes with specially invited audiences of important international and national people who her father would invite to his house. In\n[\n4\n]\nde Brosses describes one such evening which took place on\n16\nJuly\n1739\n:-\n... I was brought into a large fine room, where I found about thirty people from all countries of Europe, arranged in a circle and Mlle Agnesi, all alone with her little sister, seated on a sofa. She is a girl of about twenty years of age, neither ugly nor pretty, with a very simple and very sweet manner. ... Count Belloni, who took me, wanted to make a public show. He began with a fine discourse in Latin to this young girl, that it might be understood by all. She answered him well, after which they entered into a dispute, in the same language, on the origin of fountains and on the causes of the ebb and flow which is seen in some of them, similar to tides at sea. She spoke like an angel on this topic, I have never heard anything so pleasurable. ...\nShe is much attached to the philosophy of\nNewton\n, and it is marvellous to see a person of her age so conversant with such abstract subjects. Yet however much I was amazed at her learning, I was perhaps more amazed to hear her speak Latin with such purity, ease and accuracy...\nIt might look as if this were an extremely distasteful affair, with Agnesi's father showing off his daughter's talents like a circus act. To some extent this must be the case, but it is fair to say that shows of this type were relatively common at the time. Certainly, although Agnesi always acted in total obedience to her father's wishes, she was not very happy with the spectacle that he put on. Again we quote\n[\n4\n]\nwhere de Brosses wrote:-\nShe told me that she was very sorry that the visit had taken the form of a thesis defence, and that she did not like to speak publicly of such things, where for every one that was amused, twenty were bored to death. ... I was much annoyed to hear it said that she wished to enter a convent, and it was not through need, for she is very rich.\nIn\n[\n20\n]\nTruesdell\nexplains further about her wishing to become a nun:-\nShe did ask her father's permission to become a nun. Horrified that his dearest child should desire to leave him, he begged her to change her mind. She agreed to continue living in his house and caring for him on three conditions: that she go to church whenever she wished, that she dress simply and humbly, that she abandon altogether balls, theatres, and profane amusements.\nAgnesi concentrated her efforts on studying religious books and learning mathematics. Around this time she wrote a commentary on\nde L'Hôpital\n's\nTraité analytique des section coniques\nbut it has never been published. Learning mathematics without proper instruction is an almost impossible task and only a few have ever achieved great things in this way. Agnesi was fortunate, however, in her bid to learn mathematics for a monk, Ramiro\nRampinelli\n, a mathematician who had been a professor at both Rome and Bologna, arrived in Milan and became a frequent visitor to the Agnesi house. With\nRampinelli\n's help Agnesi studied\nReyneau\n's calculus text\nAnalyse démontrée\n(1708)\n. Agnesi understood the debt she owed to\nRampinelli\nand in the preface to her famous book\nInstituzioni analitiche ad uso della gioventù italiana\nshe wrote:-\nWith all the study, sustained by the strongest inclination towards mathematics, that I forced myself to devote to it on my own, I should have become altogether tangled in the great labyrinth of insuperable difficulty, had not\n[\nRampinelli\n's\n]\nsecure guidance and wise direction led me forth from it ...; to him I owe deeply all advances\n(\nwhatever they might be\n)\nthat my small talent has sufficed to make.\nRampinelli\nencouraged Agnesi to write a book on differential calculus. She wrote the book in Italian as a teaching text which, according to the preface, attempted to present the material:-\n... endowed with proper clarity and simplicity..., which proceeds with that natural order which provides, perhaps, the best instruction and the greatest light.\nAgnesi, with her father's money, was able to arrange for the private printing of the book in her own home where she could supervise the whole operation herself. However, she wished to obtain more input from leading mathematicians so, on the\n20\nJuly\n1745\n, she wrote to\nRiccati\n. It was\nRampinelli\nwho suggested that\nRiccati\nmight offer Agnesi advice and he had clearly contacted\nRiccati\n, who had been one of his own teachers, and\nRiccati\nhad agreed to read the final draft of Agnesi's book and make suggestions.\nRiccati\nreplied quickly to Agnesi's first letter and promised to pass the text to his two sons,\nVincenzo Riccati\nand\nGiordano Riccati\n, so that they could also comment on the work. Once Agnesi received\nRiccati\n's comments on the first part of the text she organised printing of that part while later parts were sent to\nRiccati\nalso for him to comment on. By\n1747\nAgnesi was sending\nRiccati\nlater parts of the book and explaining to him that printing of the earlier parts was nearly complete.\nRiccati\nwrote to\nRampinelli\non\n1\nFebruary\n1747\n, offering Agnesi his some of his earlier work on integration for inclusion in her book. Agnesi included the work with proper acknowledgement to\nRiccati\n. In her letters Agnesi tried to get\nRiccati\nto reply more quickly giving his notes on her draft since the printer had other work to undertake, and she wrote to\nRiccati\nsaying that:-\n... if it becomes necessary to suspend the printing again, I do not know when I could start it anew, because even now it has been extremely difficult for me to continue with printing the first part\n(\nwhich soon will be finished\n)\n.\nThe first volume of Agnesi's famous two volume work\nInstituzioni analitiche ad uso della gioventù italiana\nⓉ\n(\nAnalytical methods for the use of Italian youth\n)\nwas published in\n1748\nwhile Agnesi continued corresponding with\nRiccati\nover the material for the second volume which was published the following year. The work was to bring her much fame. A report on it made by a committee of the\nAcadémie des Sciences\nin Paris states:-\nIt took much skill and sagacity to reduce, as the author has done, to almost uniform methods these discoveries scattered among the works of modern mathematicians and often presented by methods very different from each other. Order, clarity and precision reign in all parts of this work. ... We regard it as the most complete and best made treatise.\nPope Benedict XIV wrote to Agnesi saying that he had studied mathematics when he was young and could see that her work would bring credit to Italy and to the Academy of Bologna. Soon after this he appointed Agnesi to the position of honorary reader at the University of Bologna. Then Agnesi was approached by the president of the Academy of Bologna and three other professors of the Academy and invited to accept the chair of mathematics at the University of Bologna. Indeed, shortly after this, Agnesi received a letter from Pope Benedict XIV written on\n26\nSeptember\n1750\n:-\nWe have had the idea that you should be awarded the well known chair of mathematics, by which it comes of itself that you should not thank us by we you...\nIt is probable that Agnesi neither accepted nor rejected this offer. As\nTruesdell\nwrites in\n[\n20\n]\n:-\nIn October\n[\nAgnesi\n]\nreceived a papal rescript confirming her appointment. She had already devoted herself to a holy, retired life; while her name remained on the rolls of the university for forty-five years, she never went to Bologna.\nThis does explain the confusion which appears in many accounts as to whether Agnesi ever held a chair of mathematics. Frisi, who was a school friend of one of Agnesi's brothers, visited the Agnesi house after the time that her book was published. He describes in\n[\n6\n]\nhow her father imposed severe constraints on her, and she chose to inhabit rooms of the house away from where the rest of the family lived and there she helped old women who were ill. However\n[\n6\n]\n:-\n... she immediately, with no apparent difficulty, gave way to her father's wishes ..., taking part in the usual academies in his house with such grace and penetration, propounding or answering questions, problems, and scientific doubts...\nAfter the death of her father in\n1752\n, Agnesi devoted herself entirely to charitable work. She\n[\n20\n]\n:-\n... resumed her study of Catholic doctrine and her costly acts of piety towards the poor and suffering, the hopelessly ill and the demented. First in her late father's house and afterwards in other places she established a hospice for old infirm women.\nAgnesi spent all her money on this charitable work and she died in total poverty in the poorhouse of which she had been the director.\nThe treatise\nInstituzioni analitiche ad uso della gioventù italiana\nⓉ\n(\nAnalytical methods for the use of Italian youth\n)\ncontains no original mathematics by Agnesi. Rather the book contains many examples which were carefully selected to illustrate the ideas; one review calls it an:-\n... exposition by examples rather than by theory.\nThe book includes a discussion of the cubic curve now known as the 'witch of Agnesi'. There has been much argument over the reason why the curve is called a 'witch'. The curve was discussed by\nFermat\nand, in\n1703\n, a construction for the curve was given by\nGrandi\n. In\n1718\nGrandi\ngave it the Latin name 'versoria' which means 'rope that turns a sail' and he so named it because of its shape.\nGrandi\ngave the Italian 'versiera' for the Latin 'versoria' and indeed Agnesi quite correctly states in her book that the curve was called 'la versiera'.\nJohn Colson, who had translated\nNewton\n's\nDe Methodis Serierum et Fluxionum\nⓉ\n(\nMethods for series and fluxions\n)\nfrom Latin to English for publication in\n1736\n, translated Agnesi's\nInstituzioni analitiche ad uso della gioventù italiana\nⓉ\n(\nAnalytical methods for the use of Italian youth\n)\ninto English before\n1760\n(\nthe year of Colson's death\n)\nalthough his English translation was not published until\n1801\n. Colson mistook 'la versiera' for 'l'aversiera' which means 'the witch' or 'the she-devil'. See\n[\n21\n]\nfor a detailed description of how the curve has become known as the 'Witch of Agnesi'.\nMore information about this curve is at\nTHIS LINK\n."
}