{
  "nome_completo": "Mark Grigorievich Krein",
  "nome_curto": "Mark Krein",
  "ano_nascimento": "1907",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krein/",
  "lugar_nascimento": "Kiev, Russian Empire (now Kyiv, Ukraine)",
  "lugar_morte": "Odessa, Ukranian SSR",
  "biografia": "Mark G Krein\n's father was involved in the wood trade which meant that the family had little money. The fact that the family were Jewish meant that Krein grew up in an atmosphere of persecution. This was also highly significant for Krein's subsequent career, for discrimination against Jews in Ukraine was bad and, by misfortune for Krein, was particularly bad in Odessa where he lived from the age of\n17\n.\nKrein showed a remarkable talent for mathematics at a young age. By the time he reached\n14\nyears of age he was already attending research seminars in mathematics in Kiev. However, Krein never completed his undergraduate degree for he left his home in Kiev when he was\n17\nyears old and ran away to Odessa. Despite the lack of an undergraduate degree, his talents were clearly visible to the mathematicians at Odessa University and, in\n1926\n, Krein was accepted for doctoral studies under\nChebotaryov\n.\nChebotaryov\nhimself was not in the happiest of positions for, after working at Odessa University, he had accepted a permanent post in Moscow in\n1924\n. The political situation surrounding this appointment induced him to leave Moscow and return to Odessa after only a few months. Krein therefore began his doctoral studies well aware of the difficulties of the time.\nIn\n1928\nChebotaryov\nleft Odessa and became professor at Kazan University. Krein completed his doctorate at Odessa in the following year and remained on the staff at the university building up one of the most important centres for\nfunctional analysis\nresearch in the world. During this time he worked on topics such as Banach spaces, the moment problem,\nintegral equations\nand\nmatrices\n, and on\nspectral theory\nfor linear operators. As Osilenker writes in\n[\n28\n]\nand\n[\n29\n]\n:-\nIn the creative legacy of M G Krein a large place is occupied by the moment problem and the study of associated Jacobian matrices....\nKrein's work on the moment problem, which played such an important part in his mathematical development, is discussed in detail in\n[\n25\n]\nand\n[\n26\n]\n.\nKolmogorov\nhad laid the foundations for the study of extremal problems in\n1935\nand Krein began to work on extremal problems for the class of differentiable periodic functions. Together with N I\nAkhiezer\n, Krein made a major contribution to this field in\n1937\n.\nIn\n1941\nKrein had to leave Odessa when the university was evacuated as the German armies advanced. He was appointed as professor of theoretical mechanics at Kuibyshev Industrial Institute but he returned to Odessa in\n1944\n. However, soon after taking up his post again he was dismissed. Gohberg writes in\n[\n13\n]\n:-\n[\nKrein\n]\nwas accused of Jewish nationalism, presumably for having had too many Jewish students before the War. This accusation was certainly included in his classified file and was presumably held against him all his life. ... He was not allowed to have Jewish students and was deprived of a university base.\nNot only was Krein dismissed but the whole of the functional analysis school at Odessa was closed down.\nPotapov\n, who had been one of Krein's non-Jewish students, tried hard to influence the university authorities to reverse their decisions. He wrote:-\nThe leaders of the university have to correct their mistakes and to revive immediately the famous traditions of the Odessa School of Mathematics. The Faculty of Physics and Mathematics has to become active again, as a really creative centre of scientific and mathematical thought in our city ....\nKrein was not reinstated, however, but held the chair of theoretical mechanics at Odessa Marine Engineering Institute from\n1944\n. Also from\n1944\n, he held a part-time post as head of the functional analysis and algebra department at the Mathematical Institute of the Ukranian Academy of Science in Kiev. This latter position came to a sudden end in\n1952\nwhen he was dismissed for a second time. Officially the reason given was that he did not live in Kiev, but in reality it seems more likely that the accusation of Jewish nationalism in his classified file was again the reason.\nAlthough the\n1940\ns must have been difficult times for Krein, his mathematical research did not suffer. Among other important work, Krein wrote eight papers on\nharmonic analysis\nand\nrepresentation theory\nin the\n1940\ns. In these papers he studied the use of algebras of operators applied to obtain results on positive definite kernels and functions. He also studied analysis on homogeneous spaces and duality theorems.\nFrom\n1954\nuntil his retirement Krein occupied the chair of theoretical mechanics at the Odessa Civil Engineering Institute. During the\n1940\ns and\n1950\ns there were many unsuccessful attempts to have Krein and his students reinstated at Odessa University but all attempts failed.\nDuring the many years of very active research Krein had around him a group of very active mathematicians although this group was based more on an informal arrangement than that of a proper research group. This group provided him with strong support, frequently meeting in Krein's own house. For example one of the Jewish student he ahd supervised before World War II was\nLivsic\nand he, like Krein, was not welcome back at Odessa University after the War.\nLivsic\n, again like Krein, did return to Odessa, teaching at the Hydrometerological Institute until\n1957\nand forming part of Krein's unofficial research group in Odessa. As well as Krein's house, the group often met at the Scientists' Club in Odessa and, in\n[\n16\n]\n, Thomas Kailath describes a visit he made to Odessa where he talked at the Scientists' Club at the end of\n1984\n.\nDespite the support of those around him, Krein did have to work at a mathematical disadvantage in one sense, however, for he was not allowed to travel abroad and so was unable to attend international conferences that many mathematicians feel to be almost essential for someone so pre-eminent at an international level.\nInternational recognition came to Krein despite his inability to visit centres of mathematical research around the world. In\n1968\nthe\nAmerican Academy of Arts and Sciences\nelected him an honorary member, and he was elected a Foreign Member of the\nNational Academy of Sciences\nin\n1979\n. Krein received many other honours, but perhaps the most prestigious award made to him was the Wolf Prize in Mathematics in\n1982\n. After the years of discrimination on account of being Jewish it must have been particularly pleasing to receive this Prize from Israel. The citation for the prize summarises well the contribution that Krein made to mathematics:-\nHis work is the culmination of the noble line of research begun by\nChebyshev\n,\nStieltjes\n,\nSergei Bernstein\nand\nMarkov\nand continued by\nF Riesz\n,\nBanach\nand\nSzego\n. Krein brought the full force of mathematical analysis to bear on problems of function theory, operator theory,\nprobability\nand mathematical physics. His contributions led to important developments in the applications of mathematics to different fields ranging from theoretical mechanics to electrical engineering. His style in mathematics and his personal leadership and integrity have set standards of excellence.\nGohberg writes of the quality and style of Krein's work in\n[\n13\n]\n:-\nHe is the author of more than\n270\npapers and monographs of unsurpassed breadth and quality. ... A profound intrinsic unity and close interlacing of general abstract and geometrical ideas with concrete and analytical results and applications and characteristic of Krein's work.\nDespite a life of persecution, in which he often feared arrest, Krein remained enthusiastic, friendly and kind, showing great mathematical generosity towards his students and colleagues. Towards the end of his life, however, the struggle which he continually had to make took its toll and he suffered from depression which became worse after the death of his wife."
}