{
  "nome_completo": "Mary Tsingou Menzel",
  "nome_curto": "Mary Tsingou Menzel",
  "ano_nascimento": "1928",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tsingou/",
  "lugar_nascimento": "Milwaukee, Wisconsin, USA",
  "lugar_morte": null,
  "biografia": "Mary Tsingou Menzel\nwas the daughter of Thomas John Tsingou\n(1893\n-\n1979)\nand Anastasia Koutsouyianni\n(1904\n-\n1981)\n. She was Mary Tsingou until her marriage Joseph Lawrence Menzel after which she was known as Mary Tsingou Menzel. Thomas Tsingou was a Greek, born in Assenovgrad, Bulgaria on\n3\nMarch\n1893\n. Let us note that the\n1930\ncensus and his wife's naturalisation record gives his date of birth as\n1894\nbut his tombstone records his date of birth as\n2\nMarch\n1892\nwhile his naturalisation record gives his date of birth as\n3\nMarch\n1893\n. We also note that although we have given the city of his birth as Assenovgrad, it was only given that name in\n1934\n, being known before that as Stanimaka. Thomas was a cook who sailed from Buenos Aires, Argentina on the ship the\nPomera\non\n10\nAugust\n1911\nand arrived in Tampa, Florida, USA on\n4\nSeptember. He applied to become a naturalised American on\n17\nJune\n1920\nin Hopewell, Virginia, and he became a citizen at Milwaukee, Wisconsin on\n9\nFebruary\n1925\n.\nAnastasia Koutsouyianni was a Greek, born in Assenovgrad, Bulgaria on\n1\nJanuary\n1904\n. Thomas Tsingou married Anastasia on\n2\nMay\n1926\nin Assenovgrad and they sailed on the ship\nMoreas\nfrom Pireas, Greece to New York arriving on\n21\nSeptember\n1926\n. The settled in Milwaukee, Wisconsin where their two daughters were born; Sotana Tsingou, known as Sally, was born on\n3\nJuly\n1927\n, and Mary Tsingou, the subject of this biography, was born on\n14\nOctober\n1928\n. Let us note at this point that both sisters would do innovative work programming very early computers, Mary with MANIAC at the Los Alamos Laboratory and Sally with ENIAC at the Bureau of Standards in Washington, D.C.\nThe Tsingou family spoke Greek at home, so when Mary's sister Sally went to school she did not know a word of English. Mary began her schooling one year later and had, by that time, a few words of English, but still language was a big problem. The early\n1930\ns were hard years for the Tsingou family living in Milwaukee, for the Great Depression had a dramatic impact on that city. Thomas Tsingou was a factory worker and these were particularly hard hit. Feeling that they would have a better life if they returned to their native Bulgaria where they still owned a home, they returned to Assenovgrad in Bulgaria in\n1936\n.\nWith World War II already started, the American embassy contacted Thomas Tsingou strongly advising him to return to the United states for the safety of the family. By April\n1940\nhe was back in Milwaukee when the\n1940\ncensus was carried out, as a lodger in North\n11\nth Street, giving his occupation as scissors grinder. Anastasia, Sally and Mary returned on the\nSS Manhattan\nleaving from Genoa, Italy, arriving in New York on\n10\nJune\n1940\n. Only after this did she apply to become a naturalised American and this was granted on\n28\nJanuary\n1944\n.\nMary had not completed the second grade at primary school in Milwaukee before the family had left for Bulgaria and, of course, they had spoken Greek throughout the four years in Assenovgrad, so Mary had forgotten the little English she had learnt. Although she was eleven years old when she began her schooling again in Milwaukee, because she knew no English, she was put back in the second grade class. She learnt English quite quickly and was able to skip grades, so that when she entered West Division High School in Milwaukee she was essentially back into the correct age group. She graduated from the West Division High School in\n1947\n. The\n1947\nYearbook\n[\n7\n]\ndescribes Mary Tsingou as:-\nA very smart girl who is a real pearl.\nIt also records that she had been a member of the Welles Club, of the Latin Club, had been a Cafeteria worker and had been elected as a Monitor. The Welles Club was an organisation designed to \"promote good fellowship, to afford social entertainment, and to help girls live a better life.\" Mathematics was her favourite subject at the West Division High School and she had been told that mathematics teachers were in high demand, so she entered the University of Wisconsin-Madison in\n1947\n, taking the Mathematics Education course designed to train students to become High School mathematics teachers. The University of Wisconsin had a Milwaukee extension, which meant that she was able to complete the first two years in Milwaukee before moving to Madison for her final two years. She majored in mathematics and graduated in June\n1951\nwith a B.S. degree.\nAlthough she had been told that mathematics teachers were in demand when she began her university studies, by the time she was applying for positions she was told they could fill the vacancies with men, many of whom had returned from military service during World War II, and were not hiring women. Tsingou's advisor at the university explained to her that the Los Alamos National Laboratory was adopting a different strategy. They had employed young men straight out of college, trained them and then lost them since they were called up for military service because of the Korean War. They therefore began employing women mathematicians. Tsingou followed the advice she had been given, applied to Los Alamos and, after an interview, was offered a position. There was, however, a problem to overcome; her parents were from Bulgaria which by that time was ruled by the Bulgarian Communist Party closely allied to the Soviet Union. Security checks were completed by the end of\n1951\nand on\n7\nJanuary\n1952\nshe moved to Los Alamos\n[\n6\n]\n:-\nUpon being hired, Tsingou was flatly informed that she and the other young women would be paid less than men with the same skills and qualifications because \"men were breadwinners and women were just supplementary.\" Still, Tsingou was excited about work at Los Alamos; she had chosen the job over others at companies such as General Electric because \"the salary was twice as much\" and because she had never been out West. She also felt pride in her position, working at a national security science laboratory during the Cold War. \"We were doing this in the same way young men went into the military,\" she says of herself and her colleagues. \"We knew it was something that was important for the country.\"\nAlthough she was pleased to be working at Los Alamos, Tsingou was rather disappointed not to be using any of the mathematical skills she had acquired at university. At first she was one of around\n40\n\"computers\" assigned to the Theoretical Division T\n1\n, mostly girls just out of college, who worked using Marchant calculators. The work was purely arithmetical carrying out the rules they were given to do numerical integration. The Theoretical Division T\n7\nwas beginning to operate MANIAC\n(\nMathematical Analyzer, Numerical Integrator, and Computer\n)\n. She was one of the girls who opted to attend programming classes given by Jack Burton Jackson\n(1924\n-\n2015)\n. Jackson had flown missions in the Army Air Corps during World War II, then studied mathematics, physics and chemistry at the University of Colorado, Boulder.  He began his career at the Los Alamos Laboratory in\n1950\n, where he developed programming code for the first stored program computer, MANIAC. Two of the girls, Mary Tsingou and Mary Huntsburger, who attended the programming classes were asked to transfer from Theoretical Division T\n1\nto Theoretical Division T\n7\n. The transfer was for six months and, if they did not like the work, they could return at any time to T\n1\n.\nProgramming the MANIAC was nothing like programming with today's high level languages. Tsingou explained\n[\n6\n]\n:-\nIt was a very rudimentary machine language. It was nothing like what we have now. You had to use what the machine recognised, which was only ones and zeros. We typed the directions on a tape and put it in the machine.\nFor example, if the sine of an angle was required, the programmer had to write code to compute the value by using the series expansion of sin. MANIAC could only output hexadecimal numbers so there was nothing output to indicate what the numbers represented, the person writing the program had to know what the output meant. Another problem was that memory was very limited so programs had to be written in such a way to handle that. If all the memory was taken up, then one had to recompute numbers since they could not be stored.\nThe main task of the MANIAC was to make calculations for the team trying to devise a theoretical method to create a fusion bomb: that is the hydrogen bomb. Much of the programming that Tsingou undertook was related to that work but the mathematicians working on the fusion bomb and a few others were able to use MANIAC to study other physics problems. In her initial period at Los Alamos, the two people Tsingou worked most closely with were John Pasta and\nStan Ulam\n.\nJohn Pasta\n(1918\n-\n1961)\nhad to drop out of college because of the Great Depression, then served in the forces as a cryptographical security officer and radar officer during World War II. He completed his education after the war ended and was awarded a Ph.D. for his thesis\nLimiting Procedures in Quantum Electrodynamics\n. He was appointed to the Los Alamos Laboratory in August\n1951\n. Working with Pasta, Tsingou wrote a computer program to display graphics. This means that she was almost certainly the first person to write a computer graphics program. Pasta had equations which modelled an explosion and Tsingou implemented a program to display the resulting explosion of a screen. When the graphics came to the edge of the screen, the scale changed so that the exploding particles could continue to be displayed. In this way it allowed the equations to be modified in an attempt to make the explosion symmetrical.\nTsingou worked with Pasta and\nUlam\non what is now known as the\nFermi\n-Pasta-\nUlam\n-Tsingou Problem\n(\noften referred to as the FPU problem\n)\n.\nFermi\nworked at the University of Chicago and only made occasional visits to Los Alamos. He wrote his own code for the MANIAC so Tsingou had little contact with him. She did, however, know his daughter Nella well, since when the\nFermi\nfamily came to Los Alamos,\nEnrico Fermi\nand his wife Laura lived with their friends\nStan Ulam\nand his wife Françoise, while Nella, who did not want to be with her parents, shared a dormitory with Tsingou.\nThe Los Alamos Report on the\nFermi\n-Pasta-\nUlam\n-Tsingou Problem was written by the first three listed, while all four were involved in the investigation. Tsingou and her co-author James Leslie Tuck\n(1910\n-\n1980)\nwrote a follow-up report on the FPU problem in\n1972\n. Tuck was a British scientist who was sent to Los Alamos as a member of the British delegation to the Manhattan Project. He returned to England but was invited to work on thermonuclear research at Los Alamos in\n1950\nwhere he remained for the rest of his career. Tuck and Tsingou\n(\nwriting under her married name of Menzel\n)\nwrote in the follow-up report\n[\n13\n]\n:-\nThe Maniac I computer\n(\nN Metropolis\n)\nstarted working at Los Alamos early in\n1952\n.\nE Fermi\n, who was visiting the Laboratory, J R Pasta, and\nS M Ulam\nentertained themselves by considering what new problems it opened up for study. One such, in classical fluid theory in its simplest approximation, considers a linear array of atoms linked by nonlinear forces. The results of the first calculations, which were coded by one of us\n(\nMary Tsingou Menzel\n)\n, were so surprising that the investigators were enticed into a study of nonlinear systems generally.\nThe authors of\n[\n16\n]\nwrite:-\nThe FPU problem touches on a remarkably broad range of topics in nonlinear dynamics, statistical mechanics and computational physics. Yet these broad categories represent only a small fraction of the research literature that the original FPU paper has spawned. New studies of the FPU problem are still being published today,\n54\nyears after the original Los Alamos report. We fully expect that work of this kind will keep researchers busy long after scientists celebrate the centennial of the FPU problem in\n2055\n.\nFor more details about the\nFermi\n-Pasta-\nUlam\n-Tsingou Problem see extracts from Tsingou's papers at\nTHIS LINK\n.\nWe should emphasise the importance of this new idea that physical problems could be investigated by making experiments on a computer carrying out \"experimental mathematics.\" One of the people who strongly believed in the importance of this approach was\nJohn von Neumann\nand it was a letter he sent to\nUlam\nthat started another computer investigation on MANIAC which Tsingou was involved in. The report on this investigation was written up in\n[\n3\n]\nwhich begins:-\nThe purpose of this paper is to report the results obtained on MANIAC I when that machine was used to solve numerically a set of difference equations approximating the equations of two-dimensional motion of an incompressible fluid in Eulerian coordinates.\nFor more information about this investigation, see\nTHIS LINK\n.\nTsingou realised that she would benefit by studying more mathematics. The University of California was offering graduate level evening classes in mathematics and she took some of these before deciding that she wanted to study for a Master's Degree in mathematics. The University of Michigan allowed her to transfer some credits from the University of California courses she had taken, so studying at the University of Michigan during one summer and one further semester was sufficient for her to graduate with a Master's Degree in mathematics in\n1955\n. She returned to Los Alamos and continued working on an upgraded computer MANIAC II.\nWhen she started working with the MANIAC I computer, Tsingou worked with Mary Hunsberger who became Mary Kircher after her marriage. Mary Kircher said the first time that she and Tsingou were taken to see MANIAC it had been programmed to print a prime number. It printed out\n25\nand everyone laughed. MANIAC was actually correct, however, since it was printing answers in hexadecimal and\n25\nin hexadecimal is\n37\nas a decimal.\nMary Kircher explained how women were discriminated against at Los Alamos\n[\n17\n]\n:-\nBack in the MANIAC days, the first sign that it was really not going to be a woman's job anymore was when Jack Jackson got some of the young men together - none of the women - to write the first assembler. ...  We were not invited. And there was some bitterness about it, of course. ... I know Mary Tsingou was upset. Mary was a little more sensitive to women's issues than the rest of us.\nThose who had worked for a number of years at Los Alamos were given the opportunity to go to Nevada to witness a nuclear test. Tsingou decided to go and was flown to the Nevada Test Site. She found it an exciting experience; they had built houses and placed cars near the bomb to see what would happen to them when the bomb exploded. Soldiers were sent into the area where the nuclear device exploded immediately after the explosion and although Tsingou did not realise the danger of this at the time, she later regretted that had happened.\nOn\n27\nApril\n1958\n, Mary Tsingou married Joseph Lawrence Menzel in Milwaukee, Wisconsin. Joseph Menzel\n(1923\n-\n2022)\nwas a Security Inspector at the Los Alamos Laboratory. In his\n1950\ncensus record it is recorded that he worked\n59\nhours a week. His obituary states\n[\n18\n]\n:-\nJoe was born on\n15\nDecember\n1923\nin Dubuque Iowa to Louise Mary Clemens and Joseph F Menzel, Jr. He enlisted in the Navy in\n1944\nand fought in World War II serving as a Quartermaster aboard the USS Weeden in the Asiatic-Pacific and the Philippine Liberation. He was honourably discharged in\n1946\n. He was recruited into the newly formed Protective Force in\n1947\n, as security at the Los Alamos National Laboratory, and was transferred from the United States Army to Civil Service Personnel. He worked in the Protective Force in various capacities until his retirement in\n1987\n. In\n1952\nhe met the love of his life, Mary Tsingou and they were married on\n27\nApril\n1958\n. Mary and Joe enjoyed\n63\nyears of love and happiness. Throughout retirement the two of them were always together whether hiking, riding a tandem bicycle, swimming laps, or walking their dog.\nMary and Joseph Menzel had two daughters, Ann S Menzel\n(\nborn\n9\nNovember\n1961)\n, who became a paediatrician, and Carol E Menzel who also studied medicine. The Los Alamos policy on housing their staff meant that Mary and Joseph Menzel were eligible for an apartment when they married. Once Mary became three months pregnant with her first daughter, the family became eligible for a house. It remained their home and the family were still living there when Joe Menzel died at the age of\n98\n, on Friday,\n7\nJanuary\n2022\n.\nMary Menzel worked at Los Alamos as computers rapidly developed. By the late\n1950\ns, the FORTRAN programming language began to be used and Mary became an early expert. She said\n[\n6\n]\n:-\nWhen Fortran came, it was almost like paradise.\nShe became an expert editing and manipulating the Poisson Group codes which were developed for Los Alamos National Laboratory by Ron Holsinger and Klaus Halbach for field solutions in two-dimensions. In March\n1983\nPresident Reagan announced the Strategic Defense Initiative\n(\noften known as Star Wars\n)\n. Reagan hoped that if successful it would make nuclear weapons obsolete. One of the problems that Menzel worked on was to be able to identify a missile carrying a nuclear device when it was one of many apparently identical missiles, the others each carrying a conventional bomb.\nMary Menzel continued working at Los Alamos until she retired in\n1991\n. In fact she could have continued working for longer but she was offered a pension essentially equal to what she would earn if she continued working. Let us end with the following\n[\n6\n]\n:-\nLooking back on her career, Tsingou expresses fondness for the projects she worked on and marvels at the ways in which the world is different from what scientists of the mid-\n20\nth century thought it would be. \"They thought nuclear energy was going to change the world,\" she says, \"but it's the computers that have changed the world.\""
}