{
  "nome_completo": "Mary Ellen Rudin",
  "nome_curto": "Mary Ellen Rudin",
  "ano_nascimento": "1924",
  "ano_morte": "2013",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rudin/",
  "lugar_nascimento": "Hillsboro, Texas, USA",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Mary Ellen Rudin\n's name before she married was Mary Ellen Estill. Her parents were Joe Jefferson Estill, who was a civil engineer, and Irene Shook, who was an English teacher in a High School before marrying Joe. For ten years Mary Ellen was an only child until her younger brother was born. Both of Mary Ellen's grandmothers had graduated from Mary Sharp College in Winchester, Tennessee.  The tradition of education was strongly felt in the family but they had no special espectations for Mary Ellen and certainly none in mathematics.\nJoe Estill was engaged on road building projects around Leakey, Texas and it was in that small isolated town that Mary Ellen was brought up. Certainly an engineer to improve the roads was vital. To reach Leakey in the\n1920\ns was certainly not easy with the only route being a\n50\nmile dirt road through a canyon which forded the Frio River seven times. Uvalde is situated at the bottom of the canyon and the road travelled north from there up the Frio river, then beyond Leakey to the town of Junction which is as far north of Leakey as Uvalde is to the south. Mary Ellen spoke of her childhood in Leakey:-\nWe had few toys. There was no movie house in town. We listened to the radio. But our games were very elaborate and purely in the imagination. I think actually that that is something that contributes to making a mathematician - having time to think and being in the habit of imagining all sorts of complicated things.\nMary Ellen attended the Leakey school, the only school of any kind within\n60\nmiles of Leakey.  It had\n10\ngrades altogether with\n2\n1\n2\n2\\large\\frac{1}{2}\\normalsize\n2\n2\n1\n​\nteachers for its \"high school\" where each grade had about\n5\nstudents. When she entered the University of Texas in\n1941\nshe did not have high expectations, nor did she have any set ideas as to the subjects she wanted to study. It was almost by accident that she came to study mathematics. She went to a large hall full of students on the day for registration:-\n... there were few people at the mathematics table so I was sent over there. The man who was sitting there was an old white-haired gentleman. He and I discussed all kinds of things for a long time. When I went to my math class the next day, I found the professor was\nR L Moore\n- the same man who talked to me at the registration table.\nMary Ellen had registered for\nMoore\n's trigonometry class and she would take one of his classes every year until she graduated with her B.A. degree in\n1944\n.\nMoore\nspotted Mary Ellen's mathematical talent right from the start and he was determined that she would become a mathematician:-\nI'm a child of\nMoore\n. I was always conscious of being manoeuvred by him. I hated being manoeuvred. But part of his technique of teaching was to build your ability to withstand pressure from outside. So he manoeuvred you in order to build your confidence. He built your confidence that you could do anything. I have that total confidence to this day.\nAs to\nMoore\n's teaching methods she wrote:-\nHis way of teaching was to present you with things that had not yet been proved, and with all kinds of things which might turn out to have a counterexample, and sometimes unsolved problems - that is, unsolved by anyone, not only unsolved by you. So you had some idea of what it meant to be a mathematician - more than the average undergraduate does today.\nAlthough the Moore Method proved good for Mary Ellen Estill, she understood that it was not right for everyone:-\nI wouldn't for anything have let my children go to school with\nMoore\n! That is, I think that he was destructive to anyone who didn't fit exactly into his pattern, he did not succeed in giving the people that worked with him an education. It's a mistake to go to school under those circumstances in general.\nR L Moore\nwas not the only interesting mathematician whom Mary Ellen met at the University of Texas.  Much later\nF Burton Jones\nwho himself had been a student of\nMoore\n, had more influence on her mathematics than\nMoore\nhad had. But as an undergraduate all of her mathematics courses were taught by\nMoore\nand she did not specialize in mathematics or any other subject.  When she graduated with a BA in\n1944\nshe had not considered going to graduate school in anything.  However, when offered a regular Instructorship in mathematics, she began doing topological research under\nMoore\n's supervision for her doctorate.  She received her PhD in\n1949\nand\nMoore\narranged an Instructorship for her at Duke University in Durham, North Carolina. She began teaching at Duke in\n1949\n.  She found her situation at Duke very different from that at Texas where\nMoore\n's students were isolated from all contact with books, other mathematicians, or other mathematical ideas beyond their own.  She very much enjoyed reading, and listening to and talking to other mathematicians about their mathematics.  In fact, she found her opportunities at Duke so wonderful that\n[\n1\n]\n:-\n... it still seems impossible that anyone would pay me for doing this.\nIn\n1949\nWalter Rudin\n, like Mary Ellen Estill, had just received his PhD in mathematics\n(\nfrom Duke instead of Texas\n)\nand he had accepted an Instructorship at Duke for that year also.  He left that spring for MIT and in\n1952\naccepted an Associate Professorship at the University of Rochester.  In August of\n1953\nMary Ellen and\nWalter\ndecided to marry and she just arrived at Rochester as his wife.  They soon had two daughters, Catherine born in\n1954\nand Eleanor in\n1955\n.  Mary Ellen was a busy wife and mother but already recognized as a successful topologist, one quite actively doing research, and she brought a two year National Science Foundation grant with her.  No one in the Rochester mathematics department worked in her field, but the University offered Mary Ellen a Temporary Part time Associate Professorship.  For Rochester this title admitted her presence there as a mathematician, avoided any nepotism problem, and got an elementary course taught.  For Mary Ellen it gave her legitimate access to the mathematical community and its seminars and library and demanded minimal time.  It suited everyone and she held this position from\n1953\nto\n1958\n.  Mary Ellen was not working for the money, but for the love of mathematics\n[\n1\n]\n:-\nI spent more money than most on childcare. It would have been cheaper for me to stay at home.\nIn\n1959\nWalter Rudin\naccepted an appointment as a Full Professor at the University of Wisconsin, Madison.  The mathematics department there had a strong group of topologists very interested in Mary Ellen's research and they quickly arranged for her to receive an appointment as a Temporary part time, Lecturer in Mathematics which she enjoyed for\n12\nyears. Mary Ellen and Walter's two sons were born in Madison, Robert Jefferson in\n1961\nand Charles Michel in\n1964\n.  But this appointment not only gave Mary Ellen some time to be a mother which was important to her, it offered enthusiastic and knowledgeable colleagues, research support, PhD students, a private office, and much more.\nI was a mathematician, and I always thought of myself as a mathematician. I always had all the goodies that go with being a mathematician. I had graduate students, I had seminars, I had colleagues who loved me. I never had committees. I did lots of mathematics, but I did it because I wanted to do it and enjoyed doing it, not because it would further my career.\nIn\n1971\nshe was promoted from lecturer to full professor, going in one step from the bottom point of the academic ladder to the top:-\nThe guilt feelings in the mathematics department were such that nobody even asked me if I wanted to be a professor. I was simply presented with this full professorship.\nTo begin to understand why the Mathematics Department at the University of Wisconsin should have felt guilty that by\n1971\nMary Ellen Rudin was still only a lecturer, we need to take a look at her remarkable mathematical achievements. First, however, let us note that others had recognised her accomplishments long before Wisconsin for, in\n1963\n, the Mathematical Society of the Netherlands awarded her its Prize of\nNieuwe Archief voor Wiskunde\n.\nIn a\n1988\ninterview\n[\n3\n]\nRudin explained her mathematical interests:-\n... from the beginning, it was the set-theoretic aspects of topology which interested me most. I liked finite and infinite combinatorics. ... I'm basically a problem solver.\nTo Rudin, mathematics is pattern recognition:-\nI draw little pictures and try this thing and that thing. I'm interested in how ideas fit together. Actually I'm very geometric in my thinking. I'm not really interested in numbers.\nShe began publishing after completing her doctoral thesis. In\n1950\nthe paper\nConcerning abstract spaces\nwas published in the\nDuke Mathematical Journal\n. It looked at the implications, and relations to various alternatives, of an axiom system for point set theory proposed by\nMoore\nin\n1932\n. She continued to look at spaces satisfying a subset of\nMoore\n's axioms in\nSeparation in non-separable spaces\npublished in\n1951\n. Her\n1952\npaper\nA primitive dispersion set of the plane\nprovided a positive solution to an unsolved problem contained in\nR L Wilder\n's book\nTopology of manifolds\n(1949)\n. Also in\n1952\nthe paper\nConcerning a problem of Souslin's\ncontinued her examination of the implications of\nMoore\n's axiom systems, this time motivated by a\n1920\nproblem due to Souslin.\nThe above papers were all published under her maiden name of Mary Ellen Estill, but beginning with\nCountable paracompactness and Souslin's problem\nin\n1955\n, she published under her married name of Mary Ellen Rudin. Having looked at some of her earliest papers let us note that she is best known for her ability to construct counter-examples. Perhaps one of the most famous of these example was produced in\n1970\nwhen Rudin, using box products, constructed an example of a normal\nHausdorff\nspace whose Cartesian product with an interval is not normal.\nIn August\n1974\nRudin gave a series of lectures on set theoretic topology at the CBMS Regional Conference held at the University of Wyoming, Laramie. The notes of these lectures were published by the\nAmerican Mathematical Society\nin the following year. In the lectures she surveyed what were then the recent results connecting set theory with the problems of\ngeneral topology\n. In particular her many impressive results are put in context in this useful survey.\nIn\n1981\nRudin became the first holder of the\nGrace Chisholm Young\nProfessorship at Wisconsin. She remained at the University of Wisconsin for the rest of her career, being made professor emeritus. Over the last few years, however, Rudin has produced some very deep mathematical papers. She began publishing a sequence of four papers in\n1998\naimed at characterizing the\nHausdorff\ncontinuous images of compact linearly ordered spaces. These confirm a conjecture by J Nikiel that they are precisely the compact\nHausdorff\nmonotonically normal spaces.\nRudin has received many honours for her work, including at least four honorary doctorates, and will continue to receive further awards. She was elected Vice-President of the\nAmerican Mathematical Society\nin\n1980\n-\n81\n, she has been Governor of the\nMathematical Association of America\n, elected a Fellow of the\nAmerican Academy of Arts and Science\n, and elected to the\nHungarian Academy of Science\n. Invited to be the\nEmmy Noether\nLecturer for the Association for Women in Mathematics, she lectured on\nParacompactness\n.\nWhen asked how she managed to combine being a full-time mother with being a full-time mathematician, she replied:-\nI have never minded doing mathematics lying on the sofa in the middle of the living room with the children climbing all over me. I feel more comfortable and confident when I'm in the middle of things, and to do mathematics you have to feel comfortable and confident."
}