{
  "nome_completo": "Mary Constance Simpson",
  "nome_curto": "Mary Simpson",
  "ano_nascimento": "1901",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Simpson_Mary/",
  "lugar_nascimento": "Gateshead-on-Tyne, England",
  "lugar_morte": "Plymouth, England",
  "biografia": "Mary Simpson\nlived in Newport in Fife\n(\nacross the river Tay from Dundee\n)\nand there attended Newport Public School from\n1906\nto\n1908\n. She then entered Portobello H. G. School in\n1908\nand studied there for four years before spending the next three years at Broughton J. S. Centre. On first matriculation in the Faculty of Pure Science of Edinburgh University in October\n1919\nshe gave her Religious Denomination as Episcopalian. From\n1919\nto\n1922\nshe studied for a B.Sc., the degree being awarded in July\n1922\n.\nBefore she graduated with a B.Sc., Simpson had decided that she wanted to take an Honours M.A. degree and made an application to the Arts Faculty. In February\n1922\nshe obtained the necessary permission:-\nYour application has now been considered by the Faculty of Arts, and I write to inform you that you have been granted permission to take the Honours Examination although you will still require one ordinary subject. This subject you may take after your Honours work.\nI am,\nYours faithfully,\nThoS. F. Harley\nAssistant Secretary\nSimpson first matriculated in the Arts Faculty in October\n1922\n. At this time she gave her Religious Denomination as Episcopalian and her Nearest Relative to be Mrs A Simpson\n(\nMother\n)\n. By this time her father must have died. Her address was the same as that of her mother,\n2\nOrmelie Terrace, Joppa. Joppa is very close to Portobello\n(\nthey are on the coast and were the seaside resorts for Edinburgh\n)\n, so it is reasonable to assume she lived there when she attended Portobello H. G. School which is close to Ormelie Terrace, Joppa.\nFor the Ordinary subject that she was required to take, Simpson chose English. She graduated with an M.A. with First Class Honours in July\n1923\n. In December\n1923\nshe joined the Edinburgh Mathematical Society. She did not remain long in Edinburgh, for she was appointed by the University of St Andrews to a position in University College, Dundee in\n1924\n. Simpson remained in that position until\n1942\n. We do not have details of her husband, but do know that her married name was Dempster."
}