{
  "nome_completo": "Mary Taylor Slow",
  "nome_curto": "Mary Taylor",
  "ano_nascimento": "1898",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taylor_Mary/",
  "lugar_nascimento": "Sheffield, England",
  "lugar_morte": "Malvern, England",
  "biografia": "Mary Taylor\n's parents, John Edward Taylor and Sarah Hett, were both school teachers. John Edward Taylor\n(1856\n-\n1932)\nstudied at the University of London and was awarded an M.A., a B.Sc., an a B.D.\n(\nHons\n)\n. He became an Associate Member of the Institution of Electrical Engineers. He had married Caroline Shepherd on\n15\nMarch\n1878\nin St George the Martyr Church in Southwark, England: they had two children, a son Edward E Taylor\n(\nborn\n1879\n, who became an advertising manager for a corset manufacturer\n)\nand a daughter Mary Emma Taylor\n(\nborn\n1881)\n. Caroline Taylor died on\n5\nMay\n1896\nat the age of\n39\nand John Edward Taylor married Sarah Hett, the daughter of Charles Hett, the foreman in a silver refinery, and Mary Bennett in\n1897\n. John Edward Taylor was headmaster of the Sheffield Central School and the Taylor family lived at Sandon Cottage,\n92\nBrunswick Street, Sheffield. Mary had a younger sister, Dorothy Taylor\n(\nborn\n1903)\n.\nMary attended Pomona Street Elementary School in Sheffield before continuing her education at Sheffield High School. While at the school she won a Clothworker's Scholarship which allowed her to study at Girton College, Cambridge, which she entered in\n1916\n.\nTaylor was awarded a BA by Cambridge in\n1919\n, having studied both the Mathematical Tripos and the Natural Science Tripos. She was Class I in Part I of the Mathematical Tripos in\n1917\n, took Part II of the Tripos, and completed her undergraduate studies in\n1920\nafter taking courses in both the Mathematical Tripos and the Natural Science Tripos. She continued to study at Cambridge and was awarded a research fellowship. In\n1922\nshe was appointed as an assistant lecturer in mathematics at Girton College, a post she held for two years. As well as teaching mathematics, Taylor became interested in the theory of radio waves and began research on the topic under the direction of Edward Appleton who was at this time working at the Cavendish Laboratory in Cambridge. We note that Edward Appleton won the Nobel Prize in\n1947\nfor his research into the ionosphere, part of the earth's upper atmosphere.\nIn\n1924\nAppleton left Cambridge to become the Wheatstone professor of physics at King's College, University of London. Taylor left Cambridge and went to Göttingen in Germany where she continued to study aspects of electromagnetic waves. She was awarded her doctorate by the University of Göttingen in\n1926\nand was awarded a Yarrow Research Fellowship which enabled her to remain at Göttingen undertaking research with\nRichard Courant\n. Taylor returned to England in\n1929\nand was appointed as a Scientific Officer at the Radio Research Station in Slough, Berkshire. The Radio Research Station was part of the government Department of Scientific and Industrial Research and of the National Physical Laboratory. There she carried out research on her specialist topics of the magneto-ionic theory of radio wave propagation and also in differential equations, particularly their applications to physics. She published\nThe Appleton-Hartree formula and dispersion curves for the propagation of electromagnetic waves through an ionized medium in the presence of an external magnetic field Part\n1\n: curves for zero absorption\n(1933)\nwhich has the following Abstract\n[\n5\n]\n:-\nThis paper gives dispersion curves derived from the Appleton-\nHartree\nformula in the case of zero absorption. The value of the magnetic field is taken as that of the earth's field at Slough. The curves are drawn to show the value of the squares of the indices of refraction and attenuation as functions of the electron density for a series of twelve frequencies, which are chosen to illustrate the various classes of curve and the boundary curves separating the classes and, in the case of frequencies above\n1\n.\n321\nmegacycles per second, the various regions of short and ultra-short waves. The derivation and general properties of the Appleton-\nHartree\nformula and the various possible modes of propagation are also discussed. The dispersion curves are classified according to the infinities they contain and a diagram is given to show how the classes of curve holding for any angle of inclination of the direction of propagation to the magnetic field H depend on the ratio of the longitudinal component of H to H itself. The use of the zeros and infinities of the dispersion curves in the interpretation of propagation phenomena is described and a summarising diagram is given, showing how the possible propagation of zero, one or two basic modes for any frequency depends on the electron density. The polarisation corresponding to each dispersion curve is shown graphically and the general properties of the polarisations of the basic propagation modes are discussed.\nThere is a Discussion following Taylor's paper\n[\n5\n]\nin which R A Watson Watt writes:-\nThe author's interim report of progress in her heroic investigation of the theory of propagation of electromagnetic waves in an ionised medium under an external magnetic field is timely and valuable. I was, some years ago, so strongly impressed by the need for such a general investigation and by the formidable difficulties of bringing together adequate mathematical and physical skill and adequate computing facilities for bringing the problem to numerical solution that I suggested to the Radio Research Board that the work should be taken up at Slough, where close contact with experimental work would be a valuable guide to the mathematical investigator.\nThe results now presented ... are of a kind required by all investigators concerned with the mechanism of return of wireless waves from the ionosphere, and this paper will stand as a source from which initial data for new investigations can be obtained without duplication of effort.\nAs part of the same Discussion, E V Appleton writes\n[\n5\n]\n:-\nAll experimental workers in the field of ionospheric investigations will welcome Dr Taylor's exhaustive representation of illustrative magneto-ionic dispersion curves. It is only by having the theory so fully worked out for us at the first stage that we are able to make the next step and consider the effects of collisional friction in differentiating between the attenuation experiences of the ordinary and extraordinary rays in their ionospheric journeys.\nIn the following year she published\nThe Appleton-Hartree formula and dispersion curves for the propagation of electromagnetic waves through an ionized medium in the presence of an external magnetic field. Part\n2\n: curves with collisional friction\n. This paper has the following Acknowledgements\n[\n6\n]\n:-\nThis work was carried out at the Radio Research Station, Slough, as part of the programme of the Radio Research Board of the Department of Scientific and Industrial Research, and is published by permission of the Board. Thanks are due to Mr R A Watson Watt, Superintendent of the Station, for his interest in the work and for the provision of facilities for conducting it; to Prof E V Appleton and Prof\nD R Hartree\nfor valuable discussion, and suggestions as to the presentation of the paper; to Dr L J Comrie, for advice on the arrangement of the calculations; to Miss A C Stickland for assistance in the calculations and to Mr E C Slow for help in drawing the curves.\nIn a Discussion at the end of\n[\n6\n]\n, E V Appleton writes:-\nI do not think it is possible to over-estimate the usefulness of the author's elucidation of the magneto-ionic formula to experimental workers in this field. The wave-lengths chosen for the graphical illustration are most suitable and illustrate the variety of phenomena we are to expect.\nE C Slow, mentioned in the above Acknowledgements, is Ernest Clive Slow\n(1905\n-\n1991)\n, known as Clive. He was awarded an O.B.E. in\n1964\n. In\n1934\nTaylor married Clive Slow and as a consequence had to leave her position at the Radio Research Station under the Civil Service rules which were in force at that time. Mary and Clive Slow had two daughters. She worked for the\nWireless Engineer\nas an abstractor and translator. She moved with her husband to Malvern when he was appointed to a post in the Air Defence Research and Development Establishment. Mary Slow then taught mathematics in local schools, in particular Worcester Grammar School for Girls, and Lawnside, Malvern. She was a member of the\nLondon Mathematical Society\nand the Cambridge Philosophical Society. She published a number of papers in the Proceedings of the Physics Society the most important of which are\n[\n5\n]\nand\n[\n6\n]\n.\nIn\n[\n1\n]\nthere is a brief biography of Clive Slow which also explains Mary Taylor Slow's contributions:-\nErnest Clive Slow: Clive started his working life in the shadow of the Portsmouth Dockyard, following his father as an apprentice engineer there. He set about educating himself and was rewarded with a London B.Sc.\n(\nexternal\n)\nand then found his first job at the Slough Radio Research Station, where his work with Watson-Watt and Wilkins drew him into the radar story, and provided him with a wife, Dr Mary Taylor, a brilliant mathematician. She it was who had done most of the calculations for Watson-Watt and Wilkins when he was presenting his evidence about 'Death Rays' and the possibility of aircraft detection to the Tizard Committee. When they married, under Civil Service Rules, she had to resign her post, losing for the Scientific Civil Service one of its most outstanding mathematicians. Clive was seconded to Bawdsey Research Station, and from thence he went to ADEE at Christchurch at the outbreak of war. He remained with the Establishment on its subsequent move to Malvern. During his time at Christchurch, he did most of the design work, including the aerial system for the Army GL\n2\nequipment and saw it into production at EMI\n(\naerials and display system\n)\nand Metro Vickers\n(\nTransmitter\n)\n. At Malvern, he oversaw the development of a\n25\ncm radar for close control of the Bofors gun.\nThe following quote appears in\n[\n7\n]\n:-\nDr Mary Taylor, a brilliant mathematician. She it was who had done most of the calculations for Watson Watt and Wilkins when he was presenting his evidence about 'Death Rays' and the possibility of aircraft detection. When she married Slow, under Civil Service Rules, she had to resign her post, losing the Scientific Civil Service one of its most outstanding mathematicians."
}