{
  "nome_completo": "Charles Max Mason",
  "nome_curto": "Max Mason",
  "ano_nascimento": "1877",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mason/",
  "lugar_nascimento": "Madison, Wisconsin, USA",
  "lugar_morte": "Claremont, California, USA",
  "biografia": "Max Mason\nnever used his first name of \"Charles\" and was always known by his middle name of \"Max\". His mother was Josephine Vroman, and his father was Edwin Cole Mason who was an accountant and businessman. Max studied at the University of Wisconsin which he entered intending to read for a degree in engineering. He engaged in many sports and hobbies at university where he was a champion high-jumper, enjoyed sailing, canoeing, and skating, played bridge and billiards, and learned to play the violin. On the academic side, which he did take seriously despite his many outside interests, he took some mathematics courses from Charles Sumner Slichter who turned Mason on to mathematics. He changed from engineering to study mathematics courses and received a B.Litt. in\n1898\n.\nFor a year he taught mathematics at a high school in Beloit, Wisconsin. It was a year in which he was able to put his many talents other than mathematics to good use for he\n[\n3\n]\n:-\n... coached the track team, led the school orchestra, and trained the debating club.\nMason then went to Germany in the autumn of\n1900\nwhere studied for his doctorate at the University of Göttingen, working under\nHilbert\n's supervision. The first problem which\nHilbert\nsuggested to him for a thesis topic was rapidly solved and he wrote up an elegant solution in two pages.\nHilbert\nwas impressed, but said this was not sufficient to submit for his doctorate. He then gave Mason a second problem which led to a substantial and impressive thesis. His received his doctorate in\n1903\nfor his dissertation entitled\nRandwertaufgaben bei gewöhnlichen Differentialgleichungen\nⓉ\n(\nBoundary value problems in ordinary differential equations\n)\nwhich was awarded the highest distinction. Mason then returned to the United States, accepting a post of instructor in mathematics at the Massachusetts Institute of Technology.\nAfter spending the academic year\n1903\n-\n4\nat MIT, Mason spent the next four years as assistant professor of mathematics at Yale. He married Mary Louise Freeman in\n1904\n; they had three children. In\n1908\nhe was appointed as an associate professor of mathematics at the University of Wisconsin but after one year a vacancy arose in the physics department for a full professor. Mason was appointed and transferred to the physics department.\nWeaver\n, who studied at Wisconsin, said that Mason :-\n... had a great and lasting influence on a large number of graduate students. The mediocre ones found him pretty tough, but the really good ones almost worshiped him.\nMason remained at Wisconsin until\n1925\nbut during World War I, between\n1917\nand\n1919\n, he took leave of absence and worked as a member of the submarine committee of the National Research Council. During this period of war work he invented a submarine detection device known as the \"M-V tube\". The idea for this type of detector was due to the French Navy, and Mason learned of the French device at a meeting at the National Research Council in July\n1917\n. Mason worked with colleagues to produce a prototype which was first tested on a raft in Lake Mendota, then tested on a ship off the east coast of the United States. Hunter writes in\n[\n3\n]\n:-\nThese tubes consisted of sets of sound receivers, which were mounted on the outside of a ship below the water line, and transmitters that focussed the sound inside the ship. The device allowed the crew to determine the location of a submarine or other ship producing the noise.\nWeaver\nwrites that Mason's\n[\n5\n]\n:-\n...  contributions were critical in all aspects of these problems, in acoustical theory, and in mechanical and naval engineering. the short time required to bring this detector into service is almost complete evidence of the energy and ability which Mason concentrated upon this problem.\nMason left Wisconsin in\n1925\nto become president of the University of Chicago. Up until that time the presidency had been filled by one of the founding faculty members but on the death of Ernest Burton in\n1925\nit was realised that the university would have to make an outside appointment. Although Mason had little experience of university administration, it was his experience in managing the large research team developing the submarine detectors which convinced the Board that he was the right man for the job. It appears that his abilities on the golf course also played a part! The chairman of the Board, Harold Swift, later wrote:-\n... here was a president who was a well-known scientist, who might do things differently! The leaders of the city became excited, and the University became very excited. He handled himself well. He met the public well. The idea that a university president might beat almost any member of the Commercial Club in a golf game was something new.\nOne might have expected that Mason would have stayed in his post as president of the University of Chicago for a long spell; certainly many around the university expected that he would. However he was only there for three years before, in June\n1928\n, he resigned to become the natural sciences director of the Rockefeller Foundation in New York. Whether the move was related to the death of his wife in\n1928\nit is hard to say, but he certainly left Chicago after her death.\nThe father and son philanthropists both named John D Rockefeller had founded the Rockefeller Foundation in\n1913\n. Mason was the director of Natural Sciences Division of the Rockefeller Foundation for one year and then became president of the foundation in\n1929\nafter George E Vincent retired. After becoming president, Mason approached\nWeaver\nto take up the post of director of the Natural Sciences Division. Mason held the position of president until\n1936\nwhen he moved to California to  join the team directing the construction of the Palomar Observatory. George Ellery Hale, the original designer of the\n200\n-inch telescope, died shortly after Mason joined the team and he took over as chairman. There were many problems to solve with the\n200\n-inch telescope, in particular the mirror deformed under gravity as it was moved. Mason used his engineering skills to solve these problems with the telescope which was completed in\n1948\n.\nWe noted above that Mason's wife Mary died in\n1928\n. He married for a second time and then, in\n1938\n, he married Helen Schermerhorn Young but she died in\n1944\n. One year later Mason married Daphne Crane Drake who became his fourth wife.\nMason's mathematical research interests lay in\ndifferential equations\n, the\ncalculus of variations\nand electromagnetic theory. He developed the relation between the algebra of\nmatrices\nand\nintegral equations\nas well as studying\nboundary value problems\n. Other topics in the large range of applied mathematics topics which he studied were existence theorems and asymptotic expansions. He published seven papers in the\nTransactions of the American Mathematical Society\nbetween\n1904\nand\n1910\n:\nGreen's theorem and Green's functions for certain systems of differential equations\n(1904)\n,\nThe doubly periodic solutions of Poisson's equation in two independent variables\n(1905)\n,\nA problem of the calculus of variations in which the integrand is discontinuous\n(1906)\n,\nOn the boundary value problems of linear ordinary differential equations of second order\n(1906)\n,\nThe expansion of a function in terms of normal functions\n(1907)\n;\nThe properties of curves in space which minimize a definite integral\n(1908)\nand\nFields of extremals in space\n(1910)\n. He also published\nCurves of minimum moment of inertia with respect to a point\nin the\nAnnals of Mathematics\nin\n1906\n, and he invented acoustical compensators.\nHe wrote a number of books, in particular\nThe New Haven Mathematical Colloquium\n(1910)\nand he co-authored\nThe Electromagnetic Field\nwith\nWarren Weaver\nwhich was first published in\n1929\nand reprinted in\n1952\n.\nA strong supporter of the\nAmerican Mathematical Society\n, he was an associate editor of the\nTransactions of the American Mathematical Society\nbetween\n1911\nand\n1917\n. He was elected a member of the\nNational Academy of Sciences\n(\nUnited States\n)\n, the\nGerman Mathematical Society\n, and the\nMathematical Circle of Palermo\n.\nAfter he retired in\n1949\n, Mason moved to Claremont, California, and taught at Claremont College for a year. Let us end our biography with a quotation from Mason which he wrote in the preface to Edward Price Bell's\nEurope's Economic Sunrise\n(1927)\n:-\nUnless man can set his social house in order ... all his knowledge of natural law, so dearly bought, will but serve to bring him the quicker to disaster."
}