{
  "nome_completo": "Max August Zorn",
  "nome_curto": "Max Zorn",
  "ano_nascimento": "1906",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zorn/",
  "lugar_nascimento": "Krefeld, Germany",
  "lugar_morte": "Bloomington, Indiana, USA",
  "biografia": "Max Zorn\nwas born in Krefeld in western Germany, about\n20\nkm northwest of Dusseldorf. He attended Hamburg University where he studied under\nArtin\n. Hamburg was\nArtin\n's first academic appointment and Zorn became his second doctoral student. He received his Ph.D. from Hamburg in April\n1930\nfor a thesis on alternative algebras. We shall explain below what an alternative algebra is and describe some of the mathematical contributions which Zorn made at this time. At this stage, however, we should comment that his achievements were considered outstanding by the University of Hamburg and he was awarded a university prize. He was appointed as an assistant at Halle but he did not have the opportunity to work there for long since, in\n1933\n, he was forced to leave Germany because of the Nazi policies. He was not, however, Jewish.\nZorn emigrated to the United States and was appointed a Sterling Fellow at Yale University. He worked there from\n1934\nto\n1936\nand it was during this period that he proposed \"Zorn's Lemma\" for which he is best known. We describe below the form in which Zorn originally stated this result. Following his years at Yale, he moved to the University of California at Los Angeles where he remained until\n1946\n. During this time\nHerstein\nwas one of his doctoral students. He left the University of California to become professor at Indiana University, holding this position from\n1946\nuntil he retired in\n1971\n.\nSince Zorn is best known for \"Zorn's Lemma\" it is perhaps appropriate that we should begin a discussion of his mathematical achievements by considering this contribution. Of course Zorn did not call his result \"Zorn's Lemma\", rather it was given by him as a \"maximum principle\" in a short paper entitled\nA remark on method in transfinite algebra\nwhich he published in the\nBulletin of the American Mathematical Society\nin\n1935\n. Perhaps in passing we should note that the name \"Zorn's Lemma\" was due to John\nTukey\n. Zorn's aim in this paper was to study field theory and in particular to improve on the method used for obtaining results in the subject. Methods used up to that time had depended heavily on the well-ordering principle which\nZermelo\nhad proposed in\n1904\n, namely that every set can be well-ordered. What Zorn proposed in the\n1935\npaper was to develop field theory from the standard axioms of set theory, together with his maximum principle rather than\nZermelo\n's well-ordering principle.\nThe form in which Zorn stated his maximum principle was as follows. The principle involved chains of sets. A chain is a collection of sets with the property that for any two sets in the chain, one of the two sets is a subset of the other. Zorn defined a collection of sets to be closed if the union of every chain is in the collection. His maximum principle asserted that if a collection of sets is closed, then it must contain a maximal member, that is a set which is not a proper subset of some other in the collection. The paper then indicated how the maximum principle could be used to prove the standard field theory results.\nToday we know that the Axiom of Choice, the well-ordering principle, and Zorn's Lemma\n(\nthe name now given to Zorn's maximum principle by\nTukey\nand now the standard name\n)\nare equivalent. Did Zorn know this when he wrote his\n1935\npaper? Well at the end of the\n1935\npaper he did say that these three are all equivalent and promised a proof in a future paper. Was Zorn's idea entirely new? Well similar maximum principles had been proposed earlier in different contexts by several mathematicians, for example\nHausdorff\n,\nKuratowski\nand\nBrouwer\n. Paul Campbell examines this question in\n[\n1\n]\nand:-\n... investigates the claim that \"Zorn's Lemma\" is not named after its first discoverer, by carefully tracing the origins of several related maximal principles and of the name \"Zorn's Lemma\".\nZorn made other contributions to set theory, such as his\n1944\npaper\nIdempotency of infinite cardinals\nin which he proved that an infinite cardinal number is equal to its square. His proof uses his maximum principle rather than using ordinal numbers as had been done in previous proofs of the result.\nIn addition to his well known work in infinite set theory, Zorn worked on\ntopology\nand algebra. As we mentioned above his doctoral thesis was on alternative algebras. These are algebras in which\n(\nx\ny\n)\nz\n−\nx\n(\ny\nz\n)\n(xy)z - x(yz)\n(\nx\ny\n)\nz\n−\nx\n(\ny\nz\n)\nis an alternating function in the sense that it is zero whenever any two of\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nare equal or, put another way, any two dimensional subalgebra is associative. Zorn went on to publish four papers on alternative algebras. He proved the uniqueness of the\nCayley\nnumbers\n(\nor octonians\n)\nin\n1933\nby showing that it was the only alternative, quadratic, real nonassociative algebra without zero divisors. He studied the structure of semisimple alternative rings in\n1932\n, proving that such a ring is a direct sum of simple alternative algebras which he classified. In\nAlternative rings and related questions I: existence of the radical\npublished in\n1941\nZorn considered the theory of the radical of an alternative ring. He also published results on algebras which were fundamental in the study of\nalgebraic number fields\n.\nWe have looked briefly at Zorn's contributions to algebra and to set theory. Let us now take a brief look at his contributions to analysis. In\n1945\nhe published the paper\nCharacterization of analytic functions in Banach space\nin the\nAnnals of Mathematics\n. We quote from the introduction to that paper since it both states the type of problems that Zorn was examining very clearly, and also because it illustrates his clear style of writing mathematics:-\nThe concept of analyticity may be extended in various ways to functions from one complex Banach space to another. We may ask that the function be differentiable on one-dimensional\n(\ncomplex\n)\nsubspaces; here one is led to the theory of the Gâteaux differential. Or we may prescribe a seemingly much more powerful condition, namely, that the function possesses a development into\n(\nabstract\n)\npower series about each point of the domain of definition. Here the\nFréchet\ndifferential plays a decisive role.\nThe characterization theorem which we are going to derive will serve to show that the functions which fall under the first definition but not under the second are, from a certain point of view, to be considered as freaks, counter examples rather than examples. They are similar in character to, say, additive functions of a real variable which are not linear. For it turns out that only a very weak continuity property has to be added to the existence of the Gâteaux differential in order to ensure the existence of the power series development called for by the second definition.\nAfter\n1947\nZorn stopped publishing mathematical papers. This does not mean that he gave up mathematics. As Haile said at the Memorial Symposium held for Zorn at Indiana University in June\n1993\n(\nsee\n[\n3\n]\n)\n:-\n... Max's published work, as significant and substantial as it is, is not what we will remember him by. It is rather Max's life-long dedication to mathematics and his apparently endless curiosity about mathematical ideas that we remember and from which we draw inspiration.\nEwing writes\n[\n2\n]\n:-\nIn his retirement Max Zorn became an essential part of the department. He came to the office every day, seven days a week. He was at tea, at seminars, and at colloquia. His questions were often penetrating and sometimes enigmatic. Outside speakers were usually charmed by Max and his passion for mathematics.\nHalmos\n[\n4\n]\nalso describes the colloquia:-\nI don't remember any colloquium at which he didn't ask a question afterwards\n(\nand sometimes during\n)\n- a relevant question, a pertinent question, a sharp question. His questions showed that he understood the subject, understood the talk, and was ready to understand and remember the answers.\nReturning to Ewing\n[\n2\n]\n:-\nIn recent years Max became fascinated by the\nRiemann Hypothesis\nand possible proofs using techniques from\nfunctional analysis\n. He read and studied and talked about mathematics nearly every day of his life. From time to time he published a slim newsletter, the Piccayune Sentinel, devoted to cryptic remarks about mathematics and mathematicians. He was a gentle man with a sharp wit who, during nearly half a century, inspired and charmed his colleagues at Indiana University.\nPerhaps the reference to the Piccayune Sentinel deserves comment. Zorn did spell this with two c's but it is named after the newspaper the New Orleans Picayune.\nHalmos\nin\n[\n4\n]\ngives more details:-\nI don't know just when he started it; the first issue that I have a copy of is dated November\n1950\n. It was a one-sheet affair that Max called the world's smallest newspaper and that he gave to a few friends\n(\nusually by putting copies into his colleagues' mailboxes, and rarely, for distant friends, by mailing them\n)\n. ... The contents of the Piccayune Sentinel were of the same kind as Max himself and his postcards\n(\nand as unpredictable and as confusion-inducing\n)\n...\nMax Zorn married Alice Schlottau and they had one son Jens and one daughter Liz."
}