{
  "nome_completo": "Maxime Bôcher",
  "nome_curto": "Maxime Bôcher",
  "ano_nascimento": "1867",
  "ano_morte": "1918",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bocher/",
  "lugar_nascimento": "Boston, Massachusetts, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Maxime Bôcher\n's parents were Caroline Little and Ferdinand Bôcher. Maxime's father, Ferdinand Bôcher, was professor of modern languages at the Massachusetts Institute of Technology when Maxime was born and, in\n1872\n, he became Professor of French at Harvard. Certainly Bôcher was born into a family with a strong academic background and he had a good quality education from his parents as well as from a number of public and private schools in Boston and Cambridge. His final preparation for university was at the Cambridge Latin School from which he graduated in\n1883\n. After this he studied at Harvard University, receiving his first degree from there in\n1888\n. His course at Harvard was a broad one for, in addition to mathematics, he studied a remarkably wide range of topics including Latin, chemistry, philosophy, zoology, geography, geology, meteorology, Roman and mediaeval art, and music.\nBôcher was awarded a Harvard Fellowship, a Harris Fellowship and a Parker Fellowship which allowed him to travel to Europe to undertake research. The leading university for mathematics was Göttingen and there he attended lectures by\nKlein\n,\nSchönflies\n,\nSchwarz\n,\nSchur\nand Voigt. He was particularly attracted by\nKlein\n's course on\nLamé\nfunctions which was given in session\n1889\n-\n90\n. At Göttingen he also attended lecture courses by\nKlein\non the potential function, on\npartial differential equations\nof mathematical physics and on\nnon-euclidean geometry\n. He was awarded a doctorate in\n1891\nfor his dissertation\nÜber die Reihenentwicklungen der Potentialtheorie\nⓉ\n(\nOn the series expansions of potential theory\n)\nhaving been encouraged to study this topic by\nKlein\nwho acted as supervisor. It was an outstanding piece of work which received a university prize from Göttingen.\nOsgood\n, writing in\n[\n8\n]\n, describes Bôcher's doctoral thesis in these terms:-\nThough the leading ideas had been set forth by\nKlein\nin his lectures, nothing could be further from the truth than to think that Bôcher merely elaborated some details. The subject was an exceedingly broad one. It required for its treatment not so much a specific knowledge of the theory of the potential, although Bôcher was thoroughly equipped on that side, even familiarity with the geometry of inversion, of which he made himself a master, but rather the power to carry through a piece of detailed analytic investigation with accuracy and skill ...\nWhile Bôcher was in Göttingen he met Marie Niemann and they were married in July\n1891\nafter Bôcher had submitted his doctoral thesis. The Bôchers had three children, Helen, Esther, and Frederick. He returned with his new wife to Harvard where he was appointed as an instructor. In\n1892\nhe published five papers:\nOn Bessel's functions of the second kind; On a nine-point conic; On some applications of Bessel's functions with pure imaginary index; Note on the nine-point conic\n; and\nSome propositions concerning the geometric representation of imaginaries\n. Given his impressive record it is not surprising that in\n1894\nhe was promoted to assistant professor. In that year he published his first book which was an extended version of his thesis with the same title. Perhaps 'extended version' does not do it justice since this book was now four times the length of his doctoral thesis. He  became a full professor of mathematics in\n1904\n.\nBôcher published around\n100\npapers on differential equations, series, and algebra. His text on algebra\nIntroduction to higher algebra\n, published by Macmillan, New York in\n1907\n, was particularly important. In a seventy page article in\n1906\n,\nIntroduction to the theory of Fourier's series\npublished in the\nAnnals of Mathematics\n, he gave the first satisfactory treatment of the\nGibbs\nphenomenon\n(\nhe wrote another paper\nOn Gibbs' phenomenon\nin\n1914)\n. In\n[\n3\n]\nhis papers are said to:-\n... excel in simplicity and elegance and nearly all of them treat subjects of great importance to marked advantage. He never occupied himself with an unimportant problem.\nLet us mention, in particular,\nThe theory of linear dependence\nwhich he published in the\nAnnals of Mathematics\nin\n1900\n. This paper treats both the algebraic and functional notions in a unified fashion.\nBôcher's books are singled out in\n[\n3\n]\nfor special mention:-\nBôcher's Introduction to Higher Algebra, translated into German and Russian, was a remarkable pioneer work in English, which was long of great service to students. ... Yet another exceptional service was rendered by his \"Introduction to the Study of Integral Equations\" ..., the emphasis placed on the historical development of the subject being an interesting feature of the tract. Special attention should be drawn also to his little known pamphlet on regular point of linear differential equations of the second order used for a number of years in connection with one of his courses of lectures. Because of the clarity and care with which his elementary texts on analytic geometry and trigonometry were written they are still in demand.\nWhen\nAn introduction to the study of integral equations\nwas reprinted in\n1971\na reviewer wrote:-\nThe original was the first connected account of the subject. It was written when the pioneering work of\nVolterra\nand\nFredholm\nwas still fresh in the memory and while\nHilbert\n,\nErhard Schmidt\nand\nWeyl\nwere in full flood. It is remarkable that this tract, which can still be read as a text-book, conveys so well the excitement of the time.\nHe also wrote elementary texts such as\nTrigonometry\n(\nwritten jointly with Gaylord\n)\nand\nAnalytic geometry\n. His final book was\nLeçons sur les méthodes de Sturm dans la théorie des équations différentielles linéaires et leurs développements modernes\n(1917)\nwhich was a record of lectures he gave in Paris in\n1913\n-\n14\nwhen he was Harvard Exchange Professor at the University of Paris. Although he was only\n46\nyears old when he spent the year in Paris there was already signs that his health, which had never been particularly strong, was failing. He died at his home in Cambridge, Massachusetts, after suffering a prolonged illness.\nAs to his character\nOsgood\nwrites\n[\n8\n]\n(\nsee also\n[\n9\n]\nwhich reproduces\n[\n8\n]\n)\n:-\nAbove all, Bôcher was sincere. He liked to argue and to defend a position; but when the game was over, it was the truth which had been brought out that pleased him most. He distrusted popular conclusions, even when the public was a learned one. It was facts, not views, that he sought, and his own intellect was the final arbiter ...\nLater in the article\nOsgood\nwrites:-\nHis nature was reserved. He would not talk on personal matters relating to himself and this disinclination extended even to his scientific work. He was, however, glad to discuss the work of others with them. He was quick to grasp the central idea and often could express it more clearly than its author.\nBôcher was honoured by the\nAmerican Mathematical Society\nwhen he was chosen to give the first series of Colloquium lectures in\n1896\n. He gave six lectures on\nLinear differential equations and their applications\n. He was a founder and the first editor-in-chief of the\nTransactions of the American Mathematical Society\nholding this post for five years in total during two spell, the first beginning in\n1908\nand the second in\n1911\n. He was honoured with election to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1909\nand he served as president of the\nAmerican Mathematical Society\nduring\n1909\n-\n1910\ndelivering his presidential address in Chicago on\nThe published and unpublished works of Charles Sturm on algebraic and differential equations\n.  In\n1912\nBôcher was an invited speaker at the International Congress of Mathematicians held in Cambridge, England. He lectured there on\nBoundary problems in one dimension\n.\nZund, in\n[\n10\n]\n, gives this assessment:-\n... it is difficult to adequately appreciate Bôcher's influence on his time because so much of his work was devoted to perfecting and polishing material rather than to producing striking new results that would bear his name. Nevertheless, his instinct and sense of what was important was impressive and much of his work became commonplace knowledge although his authorship was largely forgotten. ... In style and temperament Bôcher was a consummate artist ..."
}