{
  "nome_completo": "Michael Scot",
  "nome_curto": "Michael Scot",
  "ano_nascimento": "1175",
  "ano_morte": "1235",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scot/",
  "lugar_nascimento": null,
  "lugar_morte": "(possibly) Northern England/Southern Scotland",
  "biografia": "Michael Scot\n(\nor in latinized form\nMichael Scotus\n)\nis a figure of both  history and legend making him elusive to discern. Although believed to have  come from the area bordering Northern England and Southern Scotland,  doubts on his origins had been cast, since in\n1223\n, he declined the position of  Archbishop of Cashel in Ireland by claiming that he was ignorant of gaelic.  However, the use of gaelic is not widespread in Southern Scotland\n(\nas opposed  to the North\n)\n, and given that Scot had broken the barrier of several languages  with no impediment to his functions, this claim may have been exaggerated  as an excuse to refuse the offer. In a letter to Stephen Langton dated in\n1227\n, Pope Honorius III described Michael as ardently devoted to letters and  science\nfrom boyhood up\n. Thorndike infers him as a Fatherless boy raised  by his uncle. Sir Walter Scott identified him with the Sir Michael Scot of  Balwearie, sent in\n1290\non a special mission to Norway, but this is rejected  by most historians. However, a connection to minor nobility is not ruled out  given the cost of education at that time. His education allegedly begins at  the cathedral school of Durham and includes Oxford and the University of  Paris where he studied Mathematics, Astrology\n(\nwhich included Astronomy\n)\n,  Alchemy and Medicine.\nThe earliest documented record of his life and work is dated\n18\nAugust\n1217\nin  Toledo Spain, where Michael Scot completed the translation from Arabic into  Latin of al-Bitruji's\nAlpetragius\nthe first work to present a non-Ptolemaic astronomical system. Michael was part of the Toledan school of Translation,  and assisted by Jewish scholars under the direction of the Archbishop Rodrigo Jiménez de la Rada who played a key role in the battle of Las Navas de Tolosa against the Muslim Almohads in\n1212\n. This school had already hosted  famous translators such as\nGherard of Cremona\n(1114\n-\n1187)\nin the previous  century.\nA recent study\n[\n12\n]\nbased on a passage written by Michael Scot on multiple rainbows, a phenomena only understood by modern physics and recent observations, suggests that Michael Scot may have been in contact with the Tuareg in the Sahara desert.\nBy\n1227\n-\n8\n, Michael Scot and\nLeonardo Fibonacci\nwere both in the court of  Frederick II Hohenstaufen\n(1194\n-\n1250)\n, ruler of the Holy Roman Empire.  Both would play their part in transmitting much of the scientific knowledge  of the Muslims\n(\nmainly from Moorish Spain\n)\ninto Europe\n(\nmainly Italy and  Sicily\n)\n, thereby planting many of the seeds of the scientific developments  surrounding the Italian Renaissance. Scot is said to have been an imperial  tutor but manuscripts give him the title of \"astrologer\".  Scot had written a number of books but his most significant contributions are through other people and related to his work on translations. The second  version of\nLeonardo Fibonacci\n's famous book on mathematics,\nLiber Abaci\n,  was dedicated to Michael Scot in\n1227\n. The school of Toledo had made  translations of the works of\nAl-Khwarizmi\nand perhaps even those of\nAbu Kamil\n.\nLeonardo\nused them substantially for this\nLiber Abaci\n. It has been  suggested that Michael Scot might have even played an indirect role in the  presentation of the Fibonacci sequence.  Scot's translations of\nHistoria animalium\n, a zoological natural history text by\nAristotle\nwith commentaries by Ibn Rushd\n(\nAverroes\n)\n, would help Frederick  write his own famous book on falconry. This book, published in\n1240\nas\nDe  Arte Venandi cum Avibu\n(\n\"The Art of Hunting with Birds\"\n)\n, is considered to  be one of the earliest studies on bird behaviour and the first work known to  include illustrations of birds.\nFrederick sent Scot to communicate his translations and other scholarly works  at prominent European Universities including Oxford where Scot met a young\nRoger Bacon\n. Scot also explored the Lipari islands, attempting  to understand, in alchemical terms, the now realized connection between  volcanic activity and the presence of gold. For example, it is known that the  California Gold rush of\n1849\nwas prompted by the outcome of such volcanic  activity.\nThe importance of Frederick's court may have been exaggerated by some\n(\nfor example,\n[\n2\n]\nand\n[\n5\n]\n)\n. Nevertheless Frederick II authorized the first autopsies over the protests of the Roman Catholic church,  as better knowledge of the human anatomy was vital for the improvement  of medicine. In\n1543\n, the same year that Copernicus wrote his treatise on  Astronomy\nDe revolutionibus orbium coelestium\n(\n\"On the revolutions of the  Heavenly Spheres\"\n)\n, Andreas Vesalius wrote his treatise on anatomy\nDe Humani Corporis Fabrica\n(\n\"On the structure of the human body\"\n)\n. Human  dissections had revealed many anatomical errors by the ancient Greek physician Galen. This and other threads of scientific discovery can be traced to  Frederick's court. During the \"dark ages\", the issue was not entirely the unavailability of books, many of which had been destroyed during the fall of the  Roman Empire. The very \"scientific culture\" surrounding these books had  been forgotten. However, Muslim scholarship had retained a better collective  memory of the works of the ancient Greeks and other cultures, and Michael  Scot played a connecting role in bringing this knowledge into Europe.  Scot's own contributions have both been obscure and misunderstood in part  because he lived in an time where science, superstition, religion and belief  in magic coexisted together in a messy undisciplined body of thought, a  \"prehistory\" of science. For example, modern-day notions of what is called  Astrology and Astronomy were fused together at that time\n(\nand even in\nKepler\n's time\n)\nin one body of thought called \"Astrology\". Nonetheless, Scot  was observant. His very meticulous description in Latin concerning the medical case of \"Mary of Bologna\" dismissed as a \"calcified fibroid tumor\", was  realized in the\n1970\ns to be the description of a very rare case of miscarriage  or \"spontaneous abortion\", not followed by immediate expulsion, of twin  embryos, dead at different dates and calcified.\nScots works, largely unfinished, dealt principally with Astrology, Alchemy  and \"magic\" but also included meteorology, music and and various commentaries of a specialized nature. Some censure was passed upon his writings  by\nAlbertus Magnus\n(\nAlbert the Great\n)\n; some praise and some abuse from\nRoger Bacon\n(\nbut few are grateful to their creditors\n)\n. His magnum opus, his\nLiber Introductorius maior in astrologiam\n(\n\"Great Book on the introduction  to Astrology\"\n)\n, is divided into three sections:\nLiber quatuor distinctionum\n(\n\"Book of four distinctions\"\n)\nLiber particularis\n(\n\"Singular Book\"\n)\n, with the\nDe mirabilibus mundi\n(\n\"Marvels of the world\"\n)\nLiber physiognomiae\n(\n\"Book of physiognomy\"\n)\nAlthough well viewed by the papal authorities around\n1227\n, Scot would acquire the sinister reputation of a magician or wizard and would be condemned  to the inferno in Dante Alighieri's epic poem,\nThe Divine Comedy\nonly to be  \"rescued\" much later on in Sir Walter Scott's poem\nLay of the Last Minstrel\n."
}