{
  "nome_completo": "Michael Francis Atiyah",
  "nome_curto": "Michael Atiyah",
  "ano_nascimento": "1929",
  "ano_morte": "2019",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Atiyah/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Michael Atiyah\n's father, Edward Selim Atiyah\n(1903\n-\n1964)\n, was Lebanese and his mother, Jean Levens, was Scottish. Edward, whose father was a medical doctor in Khartoum, had been educated at Brasenose College, Oxford, and became a civil servant in Khartoum. He was also an author and set up a radio broadcasting service during World War II. He was a strong supporter of the Palestinian cause. Michael Atiyah, when interviewed in\n[\n32\n]\n, spoke about his father:-\nMy father's main dream was to go to Oxford. He wanted to convert himself into an Englishman. It didn't quite work out. When he came back to Sudan, he found he wasn't part of the English class structure, he was regarded as one of the lower classes, although he was Oxford-educated and regarded himself as culturally English. That turned him over a bit. He became an Arab nationalist to some extent. All his life was divided between wanting passionately to be English and yet sympathising with the Arab political position within the British empire.\nMichael's mother Jean, although of Scottish descent, was the daughter of a minister of a church in Yorkshire. She lived in Oxford and had studied at the university there. It was in Oxford that Edward and Jean met. They had four children, three sons Michael\n(\nthe eldest and subject of this biography\n)\n, Patrick Selim\n(\nborn\n5\nMarch\n1931\n, who went on to become an English lawyer and academic\n)\nand Joseph\n(\nknown as Joe, the youngest of the four children who after a mathematics degree from Cambridge University, became a computer scientist working in computer software and telecommunications\n)\n, and a daughter Selma\n(\nwho studied English at an American University and lives in America\n)\n. Although he was born in London, Michael grew up in Khartoum. However, to avoid the summer heat there the family usually returned to England at that time. Michael's primary school education was at the Diocesan school in Khartoum which he entered in\n1934\nat the age of five. He completed his primary education in\n1941\nand the family, as usual, returned to England.\nLebanon had been controlled by the French and, after the fall of France in\n1940\n, it came under the control of the Vichy government. After their trip to England, the Atiyah family returned to Lebanon via France in\n1941\nand Michael returned to a French school. However, just after this began, the British and Free French began fighting to gain control of the Lebanon. Michael was sent to Victoria College in Cairo. This was a boarding school modelled on the English boarding school system and it was a school that Edward Atiyah had attended. Atiyah writes in the autobiography\n[\n3\n]\n:-\nAt Victoria College I got a good basic education but had to adapt to being two years younger than most others in my class. I survived by helping bigger boys with their homework and so was protected by them from the inevitable bullying of a boarding school.\nAtiyah talked in\n[\n35\n]\nabout how he came to chose mathematics:-\nI was always interested in mathematics from a very young age. ... My parents always thought that I was cut out to be a mathematician from a very young age, all the way through. ... But there was a stage\n[\nat Victoria College in Cairo\n]\nwhen I got very interested in chemistry, and I thought that would be a great thing; after about a year of advanced chemistry I decided that it wasn't what I wanted to do and I went back to mathematics. I never seriously considered doing anything else.\nHe gave a somewhat fuller description of his decision between chemistry and mathematics in the interview. He said that it was inorganic chemistry that put him off the subject\n[\n15\n]\n:-\nIt was how to make sulphuric acid and all that sort of stuff. Lists of facts, just facts, you had to memorize a vast amount of material. Organic chemistry was more interesting, there was a bit of structure to it. But inorganic chemistry was just a mountain of facts in books like this. It's true that in mathematics you don't really need an enormous memory. You can work most things out for yourself, remember a few principles. If you're good at that, then it comes easily. If you want to do other things, you've got to work hard to learn a lot of facts. There was one reason, I think. But I enjoyed thinking, I'm good at it, and will continue with it.\nAfter the war ended in\n1945\n, Edward Atiyah returned to live permanently in England. Michael Atiyah attended Manchester Grammar School, one of the best schools for mathematics in the country. Although he was only sixteen years old, he had already taken his A-level examinations having been two years ahead of his age groups in Victoria College, Cairo. His two years at Manchester Grammar School were spent training to take the Cambridge scholarship examinations. However, it was at this school that he came to love geometry\n[\n3\n]\n:-\nI found that I had to work very hard to keep up with the class and the competition was stiff. We had an old-fashioned but inspiring teacher who had graduated from Oxford in\n1912\nand from him I acquired a love of projective geometry, with its elegant synthetic proofs, which has never left me. I became, and remained, primarily a geometer though that word has been reinterpreted in different ways at different levels. I was also introduced to\nHamilton\n's work on\nquaternions\n, whose beauty fascinated me, and still does.\nHe won a scholarship to Trinity College, Cambridge in\n1947\n. However, rather than go straight to university, which was an option, he decided to do his two-years National Service, which was compulsory at the time. He served as a clerical officer and took the opportunity to read mathematics books and articles. He read\nHardy\nand\nWright\n's\nNumber Theory\nat this time and also read articles on group theory. He was granted special permission to cut short the final year of his military service and spend it at Cambridge. There he played a lot of tennis and avidly studied mathematics on his own in the library. He matriculated at Trinity College in the autumn of\n1949\n. Many of his fellow students had decided to postpone their National Service, so Atiyah was one of the older of the students in his year. With his exceptional talent, his extra maturity, and the studying he had done before starting his course, it is not at all surprising that he came out ranked first despite having many very talented fellow students. While still an undergraduate, he wrote his first paper\nA note on the tangents of a twisted cubic\n(1952)\n.\nAfter graduating with his BA in\n1952\n, Atiyah continued to undertake research at Trinity College, Cambridge obtaining his doctorate in\n1955\nwith his thesis\nSome Applications of Topological Methods in Algebraic Geometry\n. His thesis advisor was\nWilliam V D Hodge\n. Speaking of the work for his thesis, Atiyah said\n[\n35\n]\n:-\nI'd come up to Cambridge at a time when the emphasis in geometry was on classical projective\nalgebraic geometry\nof the old-fashioned type, which I thoroughly enjoyed. I would have gone on working in that area except that\nHodge\nrepresented a more modern point of view -\ndifferential geometry\nin relation to topology; I recognized that. It was a very important decision for me. I could have worked in more traditional things, but I think that it was a wise choice, and by working with him I got much more involved with modern ideas. He gave me good advice and at one stage we collaborated together. There was some recent work in France at the time on sheaf theory. I got interested in it, he got interested in it, and we worked together and wrote a joint paper which was part of my thesis. That was very beneficial for me.\nAtiyah published two joint papers with his thesis advisor\nWilliam Hodge\n,\nFormes de seconde espèce sur une variété algébrique\nⓉ\n(\nForms of the second kind on an algebraic variety\n)\n(1954)\nand\nIntegrals of the second kind on an algebraic variety\n(1955)\n. He also published the single author papers\nComplex fibre bundles and ruled surfaces\n(1955)\n. He was made a fellow of Trinity College, Cambridge in\n1954\n. He married Lily Brown on\n30\nJuly\n1955\n; they had three sons John, David and Robin. Lily, born in Edinburgh in\n1928\n, was the daughter of a dock worker at the Rosyth naval yard. She had studied mathematics first at the University of Edinburgh and then took the Cambridge Tripos. She went on to obtain a doctorate, working under Mary Cartwright. Lily had met Michael Atiyah at Cambridge but, by the time they married, she was a lecturer at Bedford College, London. Atiyah was awarded a Commonwealth Fellow to study at the Institute for Advanced Study in Princeton during session\n1955\n-\n56\n. Lily had to decide whether to keep her job at Bedford College or go to Princeton with her husband. She chose to go to Princeton with her husband and resigned her position at Bedford College. This was an important year for Atiyah who met, among others,\nJean-Pierre Serre\n,\nFriedrich Hirzebruch\n,\nKunihiko Kodaira\n,\nDonald Spencer\n,\nRaoul Bott\nand\nIsadore Singer\n. Returning to Cambridge, he was a college lecturer from\n1957\nand a Fellow of Pembroke College from\n1958\n. He remained at Cambridge until\n1961\nwhen he moved to a readership at the University of Oxford where he became a Fellow of St Catherine's College.\nAtiyah was soon to fill the highly prestigious Savilian Chair of Geometry at Oxford from\n1963\n, holding this chair until\n1969\nwhen he was appointed professor of mathematics at the Institute for Advanced Study in Princeton. After three years in Princeton, Atiyah returned to England, becoming a\nRoyal Society\nResearch Professor at Oxford. He was also elected a Fellow of St Catherine's College, Oxford. Oxford was to remain Atiyah's base until\n1990\nwhen he became Master of Trinity College, Cambridge and Director of the newly opened\nIsaac Newton\nInstitute for Mathematical Sciences in Cambridge.\nAtiyah showed how the study of vector bundles on spaces could be regarded as the study of cohomology theory, called K-theory.\nGrothendieck\nalso contributed substantially to the development of K-theory. In\n[\n13\n]\nAtiyah's early mathematical work is described as follows:-\nMichael Atiyah has contributed to a wide range of topics in mathematics centring around the interaction between geometry and analysis. His first major contribution\n(\nin collaboration with\nF Hirzebruch\n)\nwas the development of a new and powerful technique in topology\n(\nK-theory\n)\nwhich led to the solution of many outstanding difficult problems. Subsequently\n(\nin collaboration with\nI M Singer\n)\nhe established an important theorem dealing with the number of solutions of elliptic differential equations. This 'index theorem' had antecedents in algebraic geometry and led to important new links between differential geometry, topology and analysis. Combined with considerations of symmetry it led\n(\njointly with\nRaoul Bott\n)\nto a new and refined 'fixed point theorem' with wide applicability.\nFor these early achievements Atiyah was awarded a\nFields\nMedal at the International Congress at Moscow in\n1966\n. An address concerning Atiyah's contributions was given at the Congress by\nHenri Cartan\n, see\n[\n18\n]\n. The K-theory and the index theorem are studied in Atiyah's book\nK-theory\n(1967\n, reprinted\n1989)\nand his joint work with G B Segal,\nThe Index of Elliptic Operators\nI-V, in the\nAnnals of Mathematics\n, volumes\n88\nand\n93\n(1968\n,\n1971)\n. Atiyah also described his work on the index theorem in\nThe index of elliptic operators\ngiven as an\nAmerican Mathematical Society\nColloquium Lecture in\n1973\n.\nThe ideas which led to Atiyah being awarded a\nFields Medal\nwere later seen to be relevant to gauge theories of elementary particles. Again we quote\n[\n13\n]\n:-\nThe index theorem could be interpreted in terms of quantum theory and has proved a useful tool for theoretical physicists. Beyond these linear problems, gauge theories involved deep and interesting nonlinear differential equations. In particular, the Yang-Mills equations have turned out to be particularly fruitful for mathematicians. Atiyah initiated much of the early work in this field and his student\nSimon Donaldson\nwent on to make spectacular use of these ideas in\n4\n-dimensional geometry. More recently Atiyah has been influential in stressing the role of topology in quantum field theory and in bringing the work of theoretical physicists, notably\nE Witten\n, to the attention of the mathematical community.\nThe theories of superspace and supergravity and the string theory of fundamental particles, which involves the theory of\nRiemann\nsurfaces in novel and unexpected ways, were all areas of theoretical physics which developed using the ideas which Atiyah was introducing.\nAtiyah has published a number of highly influential books:\nK-theory\n(1967)\n;\n(\nwith I G Macdonald\n)\nIntroduction to commutative algebra\n(1969)\n;\nVector fields on manifolds\n(1970)\n;\nElliptic operators and compact groups\n(1974)\n;\nGeometry on Yang-Mills fields\n(1979)\n;\n(\nwith N J Hitchin\n)\nThe geometry and dynamics of magnetic monopoles\n(1988)\n;\nThe geometry and physics of knots\n(1990)\n;\n(\nVideo\n)\nThe mysteries of space\n(1992)\n;\nSiamo tutti Matematici\nⓉ\n(\nWe are all Mathematicians\n)\n(2007)\n; and\nEdinburgh Lectures on Geometry, Analysis and Physics\n(2010)\n.\nWe give extracts from some reviews of these books, some extracts from Prefaces and some Publisher's descriptions at\nTHIS LINK\n.\nAtiyah and\nJohn Tate\ndescribed the Clay Mathematics Institute Millennium Prize Problems in a lecture in Paris on\n24\nMay\n2000\n. Atiyah's lecture covered the\nPoincaré\nconjecture, the\nHodge\nconjecture, quantum Yang-Mills theory and the\nNavier\n-\nStokes\nequation. He explained the problems and placed them in their historical context. He also discussed the implications for various fields of mathematics and physics if solutions to these problems were found. A\n60\n-minute video of the lecture is available entitled\nThe millennium prize problems\n.\nSix volumes of Atiyah's\nCollected Works\nhave been published. These contain a commentary by Atiyah and in the Preface he comments on the practice of publishing 'collected works' during the lifetime of their author:-\nIt appears to be increasingly fashionable to publish 'collected works' long before the author's demise. There are several clear advantages to all parties: posterity is saved the trouble of undertaking the collection, while the author can add some personal touches by way of a commentary. There are also disadvantages: the commentary will be biased, and the author may feel that he is being pensioned off.\nAnother important aspect of Atiyah's contribution is the remarkable collection of doctoral students he supervised.\nWe have listed his students with the title and date of their thesis and, for those who we know have gone on to an academic career, a university at which they have taught, at\nTHIS LINK\n.\nWe have one further link to give the reader. Brief extracts from eight papers written by Michael Atiyah for a general audience are at\nTHIS LINK\n.\nAtiyah has received many honours during his career, in addition to the\nFields\nMedal referred to above, and although we cannot list them all we will give a fairly full account. He was elected a Fellow of the\nRoyal Society of London\nin\n1962\nat the age of\n32\n. He received the Royal Medal of the Society in\n1968\nand its Copley Medal in\n1988\n. He gave the\nRoyal Society\n's Bakerian Lecture on\nGlobal geometry\nin\n1975\nand was President of the\nRoyal Society\nfrom\n1990\nto\n1995\n. He was President of the\nRoyal Society of Edinburgh\nfrom\n2005\nto\n2008\n.\nAmong the prizes that he has received are the Feltrinelli Prize from the\nAccademia Nazionale dei Lincei\nin\n1981\n, the King Faisal International Prize for Science in\n1987\n, the Gunning Victoria Jubilee Prize from the\nRoyal Society of Edinburgh\nin\n1990\n, the\nBenjamin Franklin\nMedal in\n1993\n, the Jawaharlal Nehru Memorial Medal in\n1993\n, the Order of Andres Bello\n(1\nst  Class\n)\nfrom the Republic of Venezuela in\n1997\n, the Royal Medal from the\nRoyal Society of Edinburgh\nin\n2003\n, the Order of Merit\n(\nGold\n)\nfrom the Lebanon in\n2005\n, and the President's Medal from the Institute of Physics in\n2008\n. In\n2004\nAtiyah and\nIsadore Singer\nwere awarded the\nNeils Abel\nprize of £\n480\n000\nby the\nNorwegian Academy of Science and Letters\n:-\n... for their discovery and proof of the index theorem, bringing together topology, geometry and analysis, and their outstanding role in building new bridges between mathematics and theoretical physics.\nThey were presented with the prize by King Harald V of Norway at a ceremony in Oslo.\nAtiyah was the\nAmerican Mathematical Society\nColloquium Lecturer in\n1973\n. He was President of the\nLondon Mathematical Society\nin\n1974\n-\n76\nreceiving its\nDe Morgan\nMedal in\n1980\n. Atiyah was knighted in\n1983\nand made a member of the Order of Merit in\n1992\n.\nHe has been elected a foreign member of many national academies including: the\nAmerican Academy of Arts and Sciences\n(1969)\n,\nRoyal Swedish Academy of Sciences\n(1972)\n,\nGerman Academy of Scientist Leopoldina\n(1977)\n,\nAcadémie des Sciences, Paris\n(1978)\n,\nUnited States National Academy of Sciences\n(1978)\n,\nRoyal Irish Academy\n(1979)\n, Third World Academy of Science\n(1983)\n,\nAustralian Academy of Sciences\n(1992)\n,\nUkrainian Academy of Sciences\n(1992)\n,\nIndian National Science Academy\n(1993)\n,\nRussian Academy of Sciences\n(1994)\n,\nGeorgian Academy of Sciences\n(1996)\n, Academy of Physical, Mathematical and Natural Sciences of Venezuela\n(1997)\n, American Philosophical Society\n(1998)\n,\nAccademia Nazionale dei Lincei, Rome\n(1999)\n,\nRoyal Norwegian Society of Sciences and Letters\n(2001)\n,\nCzechoslovakia Union of Mathematics\n(2001)\n,\nMoscow Mathematical Society\n(2001)\n,\nSpanish Royal Academy of Sciences\n(2002)\n, Lebanese Academy of Sciences\n(2008)\n,\nNorwegian Academy of Science and Letters\n(2009)\n. He has been made an Honorary Fellow or Member of: Trinity College, University of Cambridge\n(1976)\n, Pembroke College, University of Cambridge\n(1983)\n, Royal Institution\n(1991)\n, St Catherine's College, University of Oxford,\n(1991)\n, Darwin College, University of Cambridge\n(1992)\n, Royal Academy of Engineering\n(1993)\n, New College, University of Oxford\n(1999)\n, Faculty of Actuaries\n(1999)\n, Academy of Medical Sciences\n(2000)\n. Many universities have awarded him an honorary degree including: Bonn\n(1968)\n, Warwick\n(1969)\n, Durham\n(1979)\n, St Andrews\n(1981)\n, Trinity College Dublin\n(1983)\n, Chicago\n(1983)\n, Edinburgh\n(1984)\n, Cambridge\n(1984)\n, Essex\n(1985)\n, London\n(1985)\n, Sussex\n(1986)\n, Ghent\n(1987)\n, Reading\n(1990)\n, Helsinki\n(1990)\n, Leicester\n(1991)\n, Rutgers\n(1992)\n, Salamanca\n(1992)\n, Montreal\n(1993)\n, Waterloo\n(1993)\n, Wales\n(1993)\n, Queen's-Kingston\n(1994)\n, Keele\n(1994)\n, Birmingham\n(1994)\n, Open University\n(1995)\n, Manchester\n(1996)\n, Chinese University of Hong Kong\n(1996)\n, Brown University\n(1997)\n, Oxford\n(1998)\n, University of Wales Swansea\n(1998)\n, Charles University Prague\n(1998)\n, Heriot-Watt University\n(1999)\n, University of Mexico\n(2001)\n, American University of Beirut\n(2004)\n, York\n(2005)\n, Harvard University\n(2006)\n, Scuola Normale Pisa\n(2007)\n, Universitat Politècnica de Catalunya\n(2008)\n.\nLet us end this biography by recording the sad facts that Atiyah's eldest son John died on\n24\nJune\n2002\nwhile on a walking holiday in the Pyrenees with his wife, while Jeremy, the youngest son of Atiyah's brother Patrick, died on\n12\nApril\n2006\nwhile walking in Italy. Lily Atiyah died on\n13\nMarch\n2018\nat the age of\n90\n. Atiyah himself died on\n11\nth January\n2019\n. Both Michael and Lily Atiyah are buried in Binning Memorial Wood, Tyninghame, Scotland. See\nhttps://www.binningwood.co.uk/\n."
}