{
  "nome_completo": "Michel Chasles",
  "nome_curto": "Michel Chasles",
  "ano_nascimento": "1793",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chasles/",
  "lugar_nascimento": "Epernon, France",
  "lugar_morte": "Paris, France",
  "biografia": "Michel Chasles\n's father, Charles-Henri Chasles, was a wood merchant who became president of the chamber of commerce in Chartres. Epernon, the town where Chasles was born, is in the region of Chartres lying about one third of the way from the town of Chartres to Paris. Chasles was born into a fairly well off Catholic family. In fact  Chasles was christened Floréal Chasles by his parents after the month of the Republican calendar. This calendar fell out of use and a court order was obtained to change his name from Floréal to Michel a few days after his sixteenth birthday.\nChasles attended the Lycée Impérial for his secondary education. Then, in\n1812\n, he entered the École Polytechnique in Paris. This was the period when Napoleon was desperately trying to call up conscripts for his armies as he attempted to replenish the troops lost in the fighting. In January\n1813\n, after the disaster of the Russian campaign, Napoleon called up more men to fill the dwindling numbers in his armies. Chasles was called up to take part in the defence of Paris in early\n1814\n. Shortly after Paris fell, Napoleon abdicated on\n6\nApril\n1814\nand the war was over. Chasles was able to return to his studies at the École Polytechnique.\nHaving obtained a place in the engineering corps, Chasles decided not to accept it but to give his place to one of his fellow students who was in financial difficulties. At this point Chasles returned to living at home but his father insisted that he join a firm of stockbrokers in Paris. This was not the occupation for Chasles but he obeyed his father's wishes and went to join the firm in Paris to learn the trade of a stockbroker. However, Chasles was interested in history and in mathematics and he was not successful as a trainee in the firm. He returned again to his home where he could pursue his historical and mathematical interests.\nIn\n1837\nChasles published his first major work\nAperçu historique sur l'origine et le développement des méthodes en géométrie\nⓉ\n(\nHistorical overview of the origin and development of methods in geometry\n)\nwhich quickly made his reputation as both a mathematician and as an historian of mathematics.\nAperçu historique\nⓉ\n(\nHistorical overview\n)\nis still an important historical reference. It was written because of a question asked in\n1829\nby the Royal Academy in Brussels. The question asked for\n[\n1\n]\n:-\n... a philosophical examination of the different methods in modern geometry, in particular the method of reciprocal polars.\nIn\nAperçu historique\nⓉ\n(\nHistorical overview\n)\nChasles studied the method of reciprocal polars as an application of the principle of duality in\nprojective geometry\n; in the same way the principle of homography leads to a great number of properties of\nquadric surfaces\n. The\nAcadémie des Sciences\nwanted to publish the work which Chasles submitted to them but he asked to be able to add to the historical introduction as well as to add further historical notes to the text and include some new material and notes. This work in many ways is the crucial one for Chasles's future research since almost all of the many works he produced throughout the rest of his career elaborate on points discussed in these notes he added to the\nAperçu historique\nⓉ\n(\nHistorical overview\n)\n. The extended version is the one which the Academy published in\n1830\n. Koppelman notes in\n[\n1\n]\nthat the work had one weakness. This was that Chasles could not read German so he was not so familiar with the recent results published in that language.\nOn the strength of his fine work Chasles became professor at the École Polytechnique in Paris in\n1841\n, at the age of nearly\n48\n. Topics he taught were geodesy, mechanics, and astronomy. In\n1846\nhe was appointed to a chair of higher geometry at the Sorbonne which had been specially created for him. He continued to teach at the École Polytechnique after this appointment at the Sorbonne but he resigned his post at the École Polytechnique in\n1851\n, retaining his chair at the Sorbonne until his death.\nHe also wrote an extremely important text on geometry showing the power of synthetic geometry. In his text\nTraité de géométrie\nⓉ\n(\nTreatise on geometry\n)\nin\n1852\nChasles discusses cross ratio, pencils and involutions, all notions which he introduced. In fact\nMöbius\nindependently introduced the cross ratio. A second text,\nTraité des sections coniques\nⓉ\n(\nTreatise on conic sections\n)\n(1865)\n, applied these techniques to\nconic sections\n. The principle of duality occurs throughout his work which was carried further by\nSteiner\n.\nOne of the results for which Chasles is well known is his enumeration of conics. Questions of this type go back to\nApollonius\n, but such questions had arisen while Chasles was working on geometry, in particular the\nSteiner\n\"problem of five conics\" was posed in\n1848\n. This problem, namely to determine the number of conics tangent to five given conics, was solved incorrectly by\nSteiner\nwho gave the answer\n7776\n. Chasles solved this problem correctly in\n1864\nwhen he gave the answer of\n3264\n. Chasles' developed a theory of characteristics to solve this problem and Chasles's characteristic formula is discussed in\n[\n5\n]\n.\nKoppelman writes in\n[\n1\n]\n:-\nChasles published highly original work until his very last years. He never married, and his few interests outside his research, teaching, and the Academy, which he served on many commissions, seem to have been in charitable organisations.\nChasles received many honours for this highly original work. He was elected a corresponding member of the\nAcadémie des Sciences\nin\n1839\nand a full member in\n1851\n. He was elected a Fellow of the\nRoyal Society of London\nin\n1854\nand won its Copley Medal in\n1865\n. The\nLondon Mathematical Society\nwas founded in\n1865\nand it elected Chasles in\n1867\nas its first foreign member. He was also a member of academies in Brussels, Copenhagen, Naples, Stockholm, St Petersburg, and the United States.\nThere is one aspect of Chasles's life which seems so out of character with the brilliant man that he was that it caused him great distress. He was the victim of a celebrated fraud paying the equivalent of\n20\n,\n000\npounds for various letters from famous men of science and others which turned out to be forged. Chasles collected autographs and manuscripts but appears to have displayed a naiveté which is almost unbelievable. Chasles bought thousands of manuscripts from Denis Vrain-Lucas between\n1861\nand\n1869\n. Vrain-Lucas sold Chasles documents which purported to be part of correspondence between\nNewton\n,\nPascal\n, and\nBoyle\n. Chasles presented the letters to the\nAcadémie des Sciences\nin\n1867\nfor they \"proved\" that\nPascal\nwas the first to propose the universal law of gravitation, and not\nNewton\n.\nAs one might expect this created a great controversy. Chasles argued strongly that the letters were genuine. However Vrain-Lucas was tried in\n1869\n-\n70\nfor forging the documents and Chasles had to appear at the trial. It was an extremely uncomfortable experience for Chasles since he had to admit in court that he had purchased documents supposedly written by\nGalileo\n, Cleopatra and Lazarus and how someone of Chasles's intelligence and a deep interest in history would have believed that these all these wrote in French is beyond belief! Vrain-Lucas was found guilty and Chasles, although\n77\nby this time, must have looked extremely silly."
}