{
  "nome_completo": "Mikio Sato",
  "nome_curto": "Mikio Sato",
  "ano_nascimento": "1928",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sato/",
  "lugar_nascimento": "Tokyo, Japan",
  "lugar_morte": "Kyoto, Japan",
  "biografia": "Mikio Sato\n's father was a lawyer. Mikio had an extremely difficult time growing up in Japan during the years of World War II and living through equally difficult years that followed. He began his elementary schooling in Tokyo in April\n1935\nsince children only began school in April and they had to be six years old. In fact Mikio was seven years old only days after beginning school but the entrance rules were rigorously imposed. In April\n1941\nhe moved from elementary school to middle school, essentially a year behind some of his fellow pupils because of his date of birth\n[\n1\n]\n:-\n... it did not really matter, since I was not a quick boy. On the contrary, when I was a child, say, four ... , I was called 'bonchan', which means a boy who is very slow in responding, very inadequate. I think I am very much the same now, ha! ha! Anyway, I turned thirteen right after entering middle school. In December of that year, Japan entered the war against the allied forces: U.S., UK, Holland, and China.\nIt was around the time that Sato entered middle school that he became interested in mathematics. It was algebra that first attracted him and soon he was reading books on his own, learning about complex numbers, projective geometry and other more advanced topics. Other school subjects, however, did not interest Sato and except for mathematics he found middle school boring. Of course since his years in middle school coincided with the years that Japan was involved in World War II, he had little chance to concentrate on learning. The story of the war years was told by Sato in a moving way in\n[\n1\n]\nand so we choose to quote his own words:-\nAfter Pearl Harbor, the British fleet was destroyed in the Far East, Singapore was occupied, and so on. Things looked favorable for Japan. But soon after, a year or so later, things started changing. This was the beginning of my hard experiences. My regular courses in middle school lasted for only two years, and the rest of my school life was total chaos. The war in the Pacific ended on May\n15\n,\n1945\n. The first atomic bomb was dropped on August\n6\n,\n1945\n, after which the USSR declared war on Japan in order to secure the Kurilsk and Sachalin islands. At that time I was fifteen. Being a teenager, I had to work in factories. From\n1943\nto\n1945\n, I had to carry coal. Very hard work ... bad food ... In late\n1944\n, the systematic bombings of civilian targets by the U.S. started, after the fall of Micronesia, which then served as a base. In early\n1945\n, Tokyo was a target. The first attack on Tokyo was on March\n10\n,\n1945\n, and some\n80\n,\n000\nwere killed that night, but my family was spared. This was a short respite, since a month later there was a second attack and another broad area of Tokyo was burned down, including our house. I narrowly escaped the fire. We lost everything, but the family was safe. Due to the smoke, I partially lost my eyesight for a couple of weeks. Who cares about such details, anyway? Well, Japan had been rough on some people elsewhere, like the occupation army in China, and now it was hard for Japan. It was hard for many. ... the government decided to move the schools to the countryside - they were practically closed, anyway. We could not find a place or job outside Tokyo. In a way, our family collapsed. We did not have any relatives in the countryside we could stay with, and we had no house. Pupils with family or friends in the countryside were supposed to go there, and those without such advantages had to join a party led by a schoolteacher. My father was a lawyer, but in\n1941\nor\n1942\nhe fell ill and could not work as such anymore. Still, he thought that he could provide for his family. But then there was a sharp devaluation of the yen, by a factor of\n100\n(\na yen was nearly the equivalent to a dollar before the war\n)\n. Soon, the money my father had left from his work was down to practically nothing. We could not live on that anymore, and we nearly starved.\nIn\n1945\n, after the war ended, Sato entered the First High School in Tokyo, a school closely linked to the University of Tokyo. Because of the disruption in his middle school education, there was only a very nominal test to see that he had some mathematical ability before he was allowed to begin his studies. In\n1948\n, after three years at the First High School, Sato would have liked to continue his education at the University of Tokyo but as his father was ill, he had to earn money to support his younger sister and brother aged, at that time, nine and five respectively. He became a full time mathematics teacher at the new High School for at this time the Japanese education system changed with the length of middle school halved to come into line with the American system. He entered the University of Tokyo in\n1949\nto study mathematics although he remained a full time teacher at the High School. However, things did not work out for Sato as he had hoped. Despite producing the best paper in the final mathematics examinations in\n1952\n, because he had not attended the exercise classes he was only given a bare pass. This meant that he was not offered an assistantship which was given to the best and often second best student.\nSato then changed to study theoretical physics, first at the University of Tokyo then after two years at the Tokyo School of Education where he studied until\n1958\n. During these years he remained a full-time high school teacher. However, by this time his brother and sister did not require his financial support any longer and he was already moving back to mathematics. During the summer vacation in\n1957\nhe had worked hard on developing a new mathematical theory\n[\n1\n]\n:-\nI worked out hyperfunction series and outlined the theory for several variables - though the complete theory was finished later, since it required a generalization of cohomology theory.\nHe showed his work to Shokichi Iyanaga who had been his advisor in the Mathematics Department at the University of Tokyo. He was impressed and persuaded Kosaku Yosida to offer him a position as his assistant. Sato held this position for two years,\n1958\n-\n60\n, then was appointed as a lecturer at the Tokyo University of Education. Iyanaga had sent Sato's work to\nAndré Weil\nwho was impressed and, as a consequence, invited Sato to the Institute for Advanced Study at Princeton. Before leaving Tokyo, he gave a lecture at the Colloquium in Tokyo in which he set out his programme for research. He had already published a paper in two parts in\n1958\nentitled\nOn a generalization of the concept of functions\n. In these papers he generalised the theory of distributions of\nLaurent Schwartz\nby using the natural embedding of real Euclidean space into complex Euclidean space. In\n1960\nhe published the two-part paper\nTheory of hyperfunctions\n.\nLeopoldo Nachbin\nexplains that the papers give:-\n... an exposition of the elements of a theory of hyperfunctions\n(\nanalytic distributions\n)\n, motivated by the classical work of\nLuigi Fantappiè\non analytic functionals and of\nLaurent Schwartz\non the theory of distributions, and by a relatively recent article by\nGottfried Köthe\nputting together these viewpoints.... The generalization of the concept of function is carried out by using the\ncohomology theory\nwith coefficients in sheaves.\nThe first part gives the theory in the case of a single variable, while the second part gives the theory for more than one variable. After this Sato published nothing on hyperfunctions\n(\nor anything else for that matter\n)\nfor ten years. He explained\n[\n1\n]\n:-\nIt seemed to me that even\nAndré Weil\ndid not like my way of putting things in terms of cohomology very much. In fact, I learned that he was very much against cohomology. I got the idea that hyperfunctions were not taken very seriously, and since I was sort of a little boy\n(\nthough I was\n32\n!\n)\nI just wanted to show the usefulness of my ideas. My general program, which I had expanded at the colloquium talk of\n1960\n, was just a very formal kind of general nonsense. I then wanted to give some concrete example of it in the analysis of differential equations. But my knowledge of that field was very poor. I'm not a reader of big books and specialized papers. I live for practical examples and, just as now, I was very slow in developing my deeper thoughts.\nAfter returning from Princeton, Sato worked at Osaka University from the spring of\n1963\n. He spent\n1964\n-\n66\nas a visiting professor at Columbia University in New York, having been invited there by\nSerge Lang\n. Returning to Japan, Sato resigned from Osaka in the autumn of\n1966\n. He moved to Tokyo in\n1967\nalthough he now had no job. In\n1968\nhe began to give a series of talks on algebraic analysis at Tokyo University which was attended by two students Takahiro Kawai and Masaki Kashiwara. Invited to lecture at an International Symposium which was to take place at the Research Institute for the Mathematical Sciences, Kyoto University in April\n1969\n, he began to rework his ideas on hyperfunctions from ten years earlier. Beginning in the spring of\n1969\nhe became a professor at Komaba, which is part of the Faculty of General Education of the University of Tokyo. Then in\n1970\nhe was appointed as professor at the Research Institute for the Mathematical Sciences at Kyoto University. Kawai became an assistant at the Research Institute and Kashiwara was funded for a year on a grant before becoming an assistant there in\n1971\n. Sato served as director of Research Institute for the Mathematical Sciences from\n1987\nto\n1991\n. In that year he retired and became professor emeritus at Kyoto University.\nSato explained the new theory of microlocal analysis in his lecture\nRegularity of hyperfunctions solutions of partial differential equations\nat the International Congress of Mathematicians at Nice in\n1970\n, but the details appear in the\n165\npage paper by Sato, Kawai and Kashiwara\nMicrofunctions and pseudo-differential equations\nin the proceedings of the Katata Conference held in\n1971\n. Talking about this famous paper, Sato said\n[\n1\n]\n:-\nThe basic structure of the paper hinges on my talk at the Katata conference, but the manuscript was completely prepared by Kawai and Kashiwara. Let us say I presented the whole story, but did not prove every detail. For example, concerning the notion of microdifferential operators, I worked out some cohomological constructions, but then Kawai and Kashiwara gave a better, more direct presentation .... Kawai and Kashiwara must have taken a lot of effort to complete every detail.\nIn addition to the deep mathematical results we mentioned above, Sato has also made major contributions to theoretical physics. In\n1978\n, with coauthors Tetsuji Miwa and Michio Jimbo, he began publishing a series of papers\nHolonomic quantum fields\n. The authors write:-\nThis is the first one of a series of papers on holonomic quantum fields. In this series we deal with these objects:\n(1)\nDeformation theory for linear differential equations\n(\nRiemann\n-\nHilbert\nproblem and its generalization to higher dimensions\n)\n,\n(2)\nQuantum fields with critical strength\n(2\n-dimensional Ising model, etc.\n)\nand\n(3)\nTheory of Clifford group.\nBy\n1980\nthey had reached the\n17\nth\npaper in this series. In addition to his work in analysis and in mathematical physics, Sato has obtained many outstanding results in both group theory and number theory.\nSato has received many honours for his remarkable achievements in mathematics and theoretical physics. He was awarded the Asahi Prize of Science\n(1969)\n, the\nJapan Academy\nPrize\n(1976)\n, the Person of Cultural Merits award of the Japanese Education Ministry\n(1984)\n, the Fujiwara Prize\n(1987)\n, and the Schock Prize of the\nRoyal Swedish Academy of Sciences\n(1997)\n(\n[\n8\n]\nor\n[\n9\n]\n)\n:-\n... for his creation of the theory of hyperfunctions. Professor Sato has been the driving force behind a world-leading group of researchers in algebraic analysis. His work in theoretical physics has increased our understanding of the divergences of quantum theory.\nIn\n[\n9\n]\nthe following summary of Sato's achievements are given which led to him receiving the Rolf Schock Prize in Mathematics from Princess Christina of Sweden at a ceremony on\n23\nOctober\n1997\nin the Konserthuset in Stockholm:-\nSato's theory of hyperfunctions allows much freer calculations than does classical calculus. A function may not have a derivative which is a function, but it does have a derivative which is a hyperfunction. Every function is regarded as a sum of limit values of\nholomorphic\nfunctions, which means that one uses the fact that immediately outside the real numbers there are complex numbers - this is said to reflect the old idea that phenomena in the real world are limits of complex\n(\nimaginary, fictitious!\n)\nevents that lie very close to but are still outside our reach. A rich theory for differential equations has been the result. The theory of hyperfunctions is competing with the so-called theory of distributions and often gives analogous results, but along a different path. In some sense the two theories are equivalent, but there are important differences in mode of attack. One theory is best known in Europe and the Americas, the other in Japan. Sato is deeply interested in and motivated by problems in theoretical physics. His important contributions concern\nFeynman\nintegrals and integrable systems.\nIn\n2003\nSato received the Wolf Prize. The citation reads\n[\n4\n]\n:-\nMikio Sato's vision of \"algebraic analysis\"  and mathematical physics initiated several fundamental branches of mathematics. He created the theory of hyperfunctions and invented microlocal analysis, which allowed for a description of the structure of singularities of\n(\nhyper\n)\nfunctions on cotangent bundles. Hyperfunctions, together with integral\nFourier\noperators, have become a major tool in linear partial differential equations. Along with his students, Sato developed holonomic quantum field theory, providing a far-reaching extension of the mathematical formalism underlying the two-dimensional Ising model, and introduced along the way the famous tau functions. Sato provided a unified geometric description of soliton equations in the context of tau functions and infinitedimensional\nGrassmann\nmanifolds. This was extended by his followers to other classes of equations, including self-dual Yang-Mills and\nEinstein\nequations. Sato has generously shared his ideas with young mathematicians and has created a flourishing school of algebraic analysis in Japan.\nIn addition to these awards, we note that in\n1993\nhe was elected to the United States\nNational Academy of Sciences\n.\nLet us end this biography by quoting the final words of Pierre Schapira\n[\n12\n]\n:-\nLooking back, forty years later, we realize that Sato's approach to mathematics is not so different from that of\nGrothendieck\n, that Sato did have the incredible temerity to treat analysis as\nalgebraic geometry\n, and that he was also able to build the algebraic and geometric tools adapted to his problems. His influence on mathematics is, and will remain, considerable."
}