{
  "nome_completo": "Moritz Benedikt Cantor",
  "nome_curto": "Moritz Cantor",
  "ano_nascimento": "1829",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cantor_Moritz/",
  "lugar_nascimento": "Mannheim, Baden (now Germany)",
  "lugar_morte": "Heidelberg, Germany",
  "biografia": "Moritz Cantor\n's parents were Isaac Benedikt Cantor\n(1799\n-\n1885)\nand Nanette Meyer Schnapper. Isaac, who was a merchant from Amsterdam, was the son of Benedict Cantor and Telly de Vries. Nanette, known as Nelly, was the daughter of the money changer Meyer Wolf Schnapper and Johanna Israel. Isaac and Nanette Cantor were married in Amsterdam on\n14\nNovember\n1825\n. Nanette's brother Adolph Schnapper was a witness at the marriage ceremony. Both families were Jewish. Moritz was brought up in Amsterdam and his early education was from private tutors employed by his parents. He attended the\nGymnasium\nin Mannheim to complete his secondary education and prepare for his university studies.\nHe entered Heidelberg University in\n1848\nwhere he was taught by Franz Ferdinand Schweins\n(1780\n-\n1856)\nand Arthur Arneth\n(1802\n-\n1858)\n. Given Cantor's fame as an historian of mathematics, we should note at this point that Arneth was an excellent historian of mathematics who wrote the important work\nHistory of Pure Mathematics in its relation to the History of the Human Mind\n(1852)\n. He was one of the first to try to base the history of mathematics on general philosophical principles, rather than seeing it as merely compiling facts and recording past events. There is, however, no sign that Cantor was influenced towards the history of mathematics at this stage in his career. After a year at Heidelberg, Cantor went to the University of Göttingen where he spent the years from\n1849\nto\n1851\n. At Göttingen he was taught mathematics and astronomy by\nCarl Gauss\n, physics by\nWilhelm Weber\nand mathematics by\nMoritz Stern\n, who was particularly interested in\nnumber theory\n. He returned to Heidelberg where he presented his doctoral thesis in\n1851\n. His advisor at the Ruprecht-Karls University of Göttingen was Ferdinand Schweins and he was awarded a doctorate on\n6\nMay\n1851\nfor his thesis entitled\nÜber ein weniger gebräuchliches Koordinatensystem\nⓉ\n(\nOn a less common coordinate system\n)\n. He did not take the state examination to qualify as a gymnasium teacher, which most students took at this stage, but he went to Berlin where he spent the summer semester of\n1852\nattending courses by\nLejeune Dirichlet\nand\nJakob Steiner\n. On\n30\nApril\n1853\nhe was appointed as a\ndocent\nat the University of Heidelberg having submitted his\nhabilitation\nthesis\nGrundzüge einer Elementararithmetik\nⓉ\n(\nEssence of elementary arithmetic\n)\n. He was to remain at Heidelberg for the rest of his life.\nCantor's early work was not on the history of mathematics but he did write a short paper on\nRamus\n,\nStifel\nand\nCardan\nwhich he presented to a scientific meeting in Bonn. It looked at the introduction of Hindu-Arabic numerals into Europe, and was published in\n1857\n. Later Cantor told\nCajori\n, see\n[\n5\n]\n, that his paper was:-\n... so well received that he felt encouraged to continue his historical work.\nHowever, he was influenced at Heidelberg by Arneth, whom we mentioned above, and by the cultural philosopher Eduard Maximilian Röth. Although Röth was the professor of philosophy and Sanskrit at Heidelberg, he had studied mathematics, physics and chemistry in Paris with teachers such as\nFrançois Arago\n,\nJean-Baptiste Biot\n, Pierre-Louis Dulong\n(1785\n-\n1838)\nand Jean-Baptiste-André Dumas\n(1800\n-\n1884)\n. He may well have encouraged Cantor to visit Paris which he did in the late\n1850\ns. During this visit, which Cantor made shortly after his encouraging Bonn meeting, he became friendly with\nMichel Chasles\nand\nJoseph Bertrand\n.\nChasles\nwas an acknowledged leading expert on the history of geometry and encouraged Cantor to publish further historical material in\nComptes Rendus\n.\nFrom\n1860\nCantor lectured on the history of mathematics and became one of the leading German historians of mathematics at the end of the\n19\nth\nCentury. His first significant work was\nMathematische Beiträge zum Kulturleben der Völker\nⓉ\n(\nMathematical contributions to the cultural life of the people\n)\n(1863)\n(\nMathematical Contributions to the Cultural Life of the People\n)\nwhich, like his earlier work, concentrated on the introduction of Hindu-Arabic numerals into Europe. Not only did\n1863\nmark the first important work by Cantor, but it also was the year in which he was promoted to extraordinary professor at Heidelberg. On his birthday,\n23\nAugust\n1868\n, he married Telly Gerothwohl\n(1847\n-\n1873)\n; they had one son and one daughter.\nCantor's second book was\nEuclid und sein Jahrhundert\n(\nEuclid\nand his century\n)\nin which he summarised the work of\nEuclid\n,\nArchimedes\nand\nApollonius\n. It was published in\n1867\n. His next major contribution was\nDie römischen Agrimensoren und ihre Stellung in der Geschichte der Feldmesskunst\nⓉ\n(\nRoman surveyors and their place in the history of surveying\n)\n. This may seem a strange topic at first sight since it is recognised that the Romans added little to the development of mathematics. However, Cantor saw that the Roman surveyors had played an important role in transmitting Egyptian and ancient Greek practical geometric methods to Europe in the Middle Ages.\nCantor is best remembered for the four volume work\nVorlesungen über Geschichte der Mathematik\nwhich traces the history of mathematics up to\n1799\n. The first volume was published in\n1880\nand the last volume appeared in\n1908\n. The first volume traces the general history of mathematics up to\n1200\n. The second volume traces the history up to\n1668\n. The year\n1668\nwas chosen by Cantor because in this year\nNewton\nand\nLeibniz\nwere just about to embark on their mathematical researches. The third volume continues the overview of the history up to\n1758\n, again chosen because of the significance of\nLagrange\n's work which began shortly after this date. The review of these three volumes in\n[\n10\n]\nis full of praise:-\nIt would be impossible to do justice to this monumental work within the brief limits of a book review, even if the task were not rendered supererogatory by the high standing of the work and the acknowledged authority of its author. Cantor's 'Lectures on the History of Mathematics' are the work of a man who has unswervingly devoted a life-time to this single task, who thirty-three years ago was well known for his important contributions to this subject, and who can now in the second edition of the first volume of his great work point with pride to the impulse and awakened interest which his endeavours have aroused in the historical studies of his science. He has had many predecessors, each of whom has distinguished himself in certain branches and by certain excellences ... Nevertheless, it may safely be said that profundity, accuracy, and extensiveness of treatment have never before in any history of mathematics been so thoroughly and intimately united as in the three volumes constituting these Lectures of Moritz Cantor.\nGeorge Gibson\n, in the review\n[\n7\n]\n, writes:-\nIt hardly requires to be stated that this history is certain to remain for many years the standard work on the subject with which it deals; in completeness, in accuracy, in clearness of arrangement, it stands unrivalled, and for the period which it covers is bound to be a permanent work of reference.\nAfter completing the third volume Cantor realised that, at the age of\n69\n, he was not up to the task of completing another volume, so at the Congress of\n1904\nin Heidelberg he organised a team with nine further contributors to collaborate on the fourth volume. As editor-in-chief Cantor set high standards and insisted that the style and impartiality of the first three volumes be retained. This fourth volume again stopped just before a highly significant development since\n1799\nis the year of\nGauss\n's doctoral thesis. The review\n[\n11\n]\nregrets that Cantor could not have written this himself:-\nIt is fifteen years since the second edition of the first volume of Cantor's 'Vorlesungen' made its appearance, and last year a third edition was called for. After the completion of Vol. III, which brought this monumental work up to\n1758\n, the author felt that the time had come when the claims of advancing years were strong enough to force him to leave the completion of his magnum opus to others. He must have felt that he had not lived in vain and that an historical school worthy of German traditions had grown up around him, when, inspired by his example and enthusiasm, men were found able and eager to continue his great work under his direction. We are unfortunate in that the health of the aged savant has prevented him from giving that full personal supervision which is so essential in securing a general unity of treatment when the mathematical labours of half a century are divided among so many hands, however individually competent they may be. And when we say that no less than nine monographs by nine men constitute this fourth volume, it is not surprising to find, that although there is less diversity of treatment than might be expected, yet the volume is not what it would have been had Cantor been able to continue his colossal task. As it is, he had intended to append to this portion of the work a general treatment of the progress of mathematics during the latter part of the eighteenth century. We are, however, disappointed at the absence of what would of course have been a masterly survey of the development of ideas in that period, and greatly regret that the plan had to be abandoned. The greatest mathematical historiographer found himself compelled to be content with a chronological index. Even so, it is one of the most useful features in the book. His 'Überblick' gives a mass of information in a couple of dozen pages, fortified with ample cross references to the sections of this volume.\nCantor was an excellent linguist and\nCajori\ndescribes in\n[\n5\n]\nsome amusing incidents of English speaking mathematicians speaking foreign languages at Congresses told to him by Cantor. Let us note at this point that Cantor was invited to give a plenary lecture at the International Congress of Mathematicians in Paris in\n1900\n. He gave the lecture\nL'historiographie des mathématiques\nⓉ\n(\nThe historiography of mathematics\n)\nwhich he delivered in French. His command of the language was so good that some believed him to be French.\nIn\n[\n13\n]\nthe historian of mathematics\nDavid Smith\nrelates some touching personal memories of Cantor:-\nI feel that I may be allowed to mention my personal impressions of Professor Cantor, gained from an acquaintance of about thirty years. It began with a visit to his home when I was planning to spend a year in his course at Heidelberg. I shall never forget his kindliness of manner when I stated that I wished to devote time to the early stages of the calculus. He asked me where I thought it best to begin and I said with\nKepler\nor\nCavalieri\n. The pleasant way in which he approved, with the suggestion that it might be better to start with\nArchimedes\n, impressed the young American of thirty, but now he would begin somewhat earlier still. Circumstances have a way of changing one's life rather suddenly, and the plan was never carried out in Heidelberg University, but it did not interfere with the making of several visits from time to time in his home. The last of these was made about\n1910\n, I believe. He was then nearly blind. As I entered his study he rose from a chair near the window, held out his hands, and advanced towards me. I took them and led him back to his chair and we talked over the years since we had first met. ... When I was leaving he rose, motioned with his hand to his bookcase\n(\nnot a large collection\n)\nand said, \"these are my books, but I cannot see them.\" Then he walked with me to the door and I said the conventional \"Auf Wiedersehen\", knowing that it would never come.\nCajori\ndescribes in\n[\n5\n]\nmeeting Cantor, then\n86\n, in\n1915\n. Cantor described himself as:-\n... a hewer of timber who with a big axe and with powerful strokes roughly cut the timber to proper form and dimension, but left it for those who follow him to dress, polish and finish.\nCajori\nrelates details of that visit in\n[\n5\n]\n. We give an extract:-\nAlmost complete blindness had compelled him to stop research. He said he could see the general outline of a person's body, but could not make out the features. He could move about in his house without assistance. His hearing was still good and his mind fairly clear. Neither of us touched upon war issues, except that he once referred to me as coming from a nominally neutral country. Later in the day I met his son and daughter, who were free in expressing to me the hope that the United States would soon come to observe real neutrality. Cantor made inquiries about certain American and English mathematicians and spoke of special historical researches then in progress in Germany. ... After a dinner which was served in the garden in the open, the writer, having been told that it was Cantor's habit to lie down after the mid-day meal, departed.\nMoritz Cantor was no relation to\nGeorg Cantor\nwho referred to him as his Namensvetter\n(\ncousin by name only\n)\n. Moritz Cantor was honoured with election to the\nGerman Academy of Scientists Leopoldina\nin\n1877\n. He is buried in the Heidelberg Bergfriedhof Cemetery."
}