{
  "nome_completo": "Nathan Jacobson",
  "nome_curto": "Nathan Jacobson",
  "ano_nascimento": "1910",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jacobson/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Hamden, Connecticut, USA",
  "biografia": "Nathan Jacobson\nwas known as Jake by all around him. His mother was Pauline Rosenberg and his father was Charles Jacobson\n(\nat least this was what Jacobson calls his \"Ellis Island name\"\n)\n. It was a Jewish family, and Nathan was born in the Jewish ghetto of Warsaw. In fact he was actually born on\n5\nOctober but this was wrongly converted to\n8\nSeptember which is now the date which appears on all official documents and the latter incorrect date has now been accepted as his official birthday. Nathan had a brother Solomon who was about eighteen months older. The two boys began their elementary schooling in Warsaw where they encountered discrimination with Jewish children required to sit on special benches separated from Polish children.\nWhen Nathan was five years old his father emigrated to the United States leaving his family behind in Warsaw until he had earned sufficient money for them to make the trip. Charles bought a small grocery store in Nashville, Tennessee and there he lived in a small room at the rear. It took him two years to save enough money to pay for his family's passage and then Nathan, with his mother and brother, made the trip\n[\n4\n]\n:-\nIt was a long journey from Warsaw to New York: in a sealed freight car through Germany to Rotterdam where we had to wait four months for a Dutch ship to take us across the U-boat infested Atlantic. ... After a brief visit with relatives in New York, our family was reunited in Nashville where we squeezed into the modest quarters that my father had occupied.\nThe family soon moved to Birmingham, Alabama, where Nathan attended elementary school, and then High School. The Jacobson family moved to Columbus, Mississippi where Nathan completed the two final years of his school career at the S D Lee High School. Jacobson entered the University of Alabama in\n1926\nand, in\n1930\n, was awarded a B.A.\n[\n4\n]\n:-\nI had intended to study law to follow in the footsteps of a maternal uncle who had come to the United States a few years before my father and had obtained a degree in law from the University of Alabama. My initial objective of law as well as my interests at the time led me to a curriculum that was heavily weighted in the humanities especially history. However, I also took the mathematics courses that were offered\n(\nnot a large number\n)\n. Apparently I had distinguished myself in these, for I was offered a teaching assistantship in mathematics in my junior year. This marked a turning point in my college career since I decided then to major in mathematics and to pursue this study beyond college ...\nHaving applied to Princeton, Harvard and Chicago for financial support to undertake graduate studies, he went to Princeton where he was awarded a research assistantship to study for his doctorate under\nWedderburn\n's supervision. For his second and third years Jacobson was awarded a part-time instructorship, and in his fourth year he was a Procter Fellow with a good stipend:-\nThe mathematics students formed a closely knit group. We lived in Graduate College and we ate together, particularly dinner at Procter Hall where academic gowns were required attire. Much to the annoyance of the other students, our dinner talk was almost exclusively confined to mathematics. This was an important part of our learning process ...\nHaving attended a course by\nWedderburn\non matrices in which he ended by developing his classical structure theory of finite dimensional algebras over finite fields, Jacobson was given the task of studying division algebras which were idealizers of one-sided ideals of polynomial rings. His doctorate was awarded in\n1934\nfor a thesis on this topic entitled\nNon-commutative polynomials and cyclic algebras\n, the main results from which were published in the\nAnnals of Mathematics\n. He spent\n1934\n-\n35\nat the Institute of Advanced Study at Princeton during which time he read\nWedderburn\n's paper\nAlgebras which do not possess a finite basis\n. This paper would lead him to his important results on the structure of rings some years later.\nHaving saved from his salary he was able to visit Europe in the summer of\n1935\nwith two fellow colleagues from Princeton. He made a short visit by himself to Poland where he was able to see an uncle, aunts and cousins\n[\n4\n]\n:-\nThis was the last time I would see them. All were killed by the Nazis in the death camps after the German invasion of Poland in\n1939\n.\nJacobson's career began with relatively short periods in a number of universities throughout the United States. Jacobson had heard\nEmmy Noether\nlecture on class field theory in Princeton in the spring semester of\n1935\nand again at the summer meeting of the\nAmerican Mathematical Society\nwhere she made comments on Jacobson's thesis results which he presented there. Jacobson also met\nNoether\nat the\nBrauer\ns' home where they were invited for dinner on several occasions. When she died in the spring of\n1935\nJacobson was invited to take up a one year post at Bryn Mawr to give\nNoether\n's advertised lecture courses so session\n1935\n-\n36\nwas spent at Bryn Mawr.\nThe year\n1935\nsaw the publication of Jacobson's first paper on\nLie algebras\nand over the four years up to\n1938\nhe published five further papers on the topic as well as two papers on topological rings. During these four years, Jacobson worked at three different universities. After session\n1935\n-\n36\nat Bryn Mawr, he spent\n1936\n-\n37\nat the University of Chicago, financed by a National Research Council Fellowship, where\nDickson\nand\nA A Albert\nwere working. Then the University of North Carolina was home to him for a number of years.\nIn fact this was a particularly difficult period due to the depression, which affected everyone, and anti-Semitism which meant that the top research universities were not taking on staff from Jewish backgrounds. He was lucky that North Carolina had a liberal policy and was also looking for young research mathematicians who would be given a light teaching load. Appointed in\n1937\nas an instructor, he became an assistant professor there in\n1938\n, then in\n1941\nan associate professor.\nSoon after the United States entered World War II a training programme was set up in Chicago to train teachers for the Navy Pre-Flight School. Jacobson undertook the training, then taught at the Navy school for pilots. While in Chicago, Jacobson mixed with the algebraists at the University and there he met Florence Dorfman\n(\nknown as Florie\n)\nwho was a doctoral student working under\nA A Albert\n. They married on\n25\nAugust\n1942\nand Florence gave up her doctoral studies. Florie did not give up mathematics for she was a joint author with her husband on their\n1949\npaper\nClassification and representation of semi-simple Jordan algebras\n.\nIn\n1943\ncivilian instructors were asked to leave the Navy Pre-Flight School and Jacobson was appointed to a two year post at Johns Hopkins University where\nZariski\nwas on the Faculty. Together with his wife, he moved to Baltimore in September\n1943\nto take up this post. He writes in\n[\n5\n]\n:-\nMy research at Hopkins during the years\n1943\n-\n46\nwas mainly in the area of\nGalois theory\nand the general structure of rings. I also wrote my first paper on\nJordan\nrings during this period.\nAfter four years at Johns Hopkins University he moved to Yale in\n1947\n. This was made possible since discrimination against Jews lessened in the United States after the end of World War II\n[\n6\n]\n:-\nI accepted and became the first Jew to hold a tenured position in the mathematics department.\nTwo years after his appointment to Yale he was promoted to full professor, then in\n1961\nhe was appointed as James E English Professor, and in\n1963\nas Henry Ford II Professor. He remained at Yale until he retired in\n1981\n, but when he was offered a position at Chicago in\n1960\nhe certainly had to make a difficult decision. He wrote to\nA A Albert\n[\n7\n]\n:-\n... I am convinced that there would have been many scientific advantages to making this move. However, after a good deal of thought on the subject, I still feel that for me these are outweighed by the advantages of living in New Haven and the difficulties of uprooting myself and my family from an environment we have found congenial for so many years.\nDuring his years at Yale, Jacobson spent time on visits to other universities. For example he spent the summer of\n1947\nat Chicago,\n1951\n-\n52\nas a Guggenheim Fellow in Paris living in\nAndré Weil\n's apartment, the summer of\n1956\nas visiting professor at the University of California at Berkeley, and\n1957\n-\n58\nin Paris for a second visit. He attended the Fourth All-Union Congress of Mathematicians of the USSR in\n1961\n, attending the International Congress of Mathematicians in the same year. After taking unpaid leave from Yale to visit Chicago and Japan in\n1964\n-\n65\nhe lectured in St Andrews Scotland in\n1968\n[\n8\n]\n:-\nWe had a very pleasant summer in\n1968\n, lecturing in Scotland and sight-seeing in Scotland and Ireland. I was invited to give a course of lectures at the St Andrews Colloquium of the\nEdinburgh Mathematical Society\n.\nI\n[\nEFR\n]\nattended Jacobson's course that he gave on\nQuadratic Jordan algebras\nat the Colloquium and learnt much, not only about\nJordan\nalgebras, but also on how to lecture combining both excitement and clarity.\nWe have made a number of references to Jacobson's Jewish background in this article and there is one further episode we should mention which illustrates the tensions that resulted. From\n1972\nto\n1974\nJacobson and\nPontryagin\nwere both vice-presidents of the\nInternational Mathematical Union\n. They argued over the Soviet Union's refusal to allow invited Jewish speakers to attend and lecture at conferences in the West. In\n1978\nJacobson was attacked by\nPontryagin\nwho made the following infamous anti-Semitic statement\n(\nwe quote from\n[\n9\n]\n)\n:-\nThere was an attempt by Zionists to take the\nInternational Mathematical Union\ninto their hands. They attempted to raise N Jacobson, a mediocre scientist but an aggressive Zionist, to the presidency. I managed to repel this attack.\nThis attack Jacobson answered at length with a reply which appears in the June\n1980\nNotices of the American Mathematical Society\n.\nJacobson is well known for his outstanding contributions to ring theory. Seligman writes in\n[\n2\n]\n:-\n... his contributions have become a part of the daily vocabulary and working equipment of many of us. ... he earned his dominance by recasting whole theories of algebraic systems and by insisting on the module theoretic viewpoint in their study.\nJacobson discovered a deep structure theory for rings and has given his name to the Jacobson radical, the intersection of the maximal ideals of a ring. He also made very substantial contributions to nonassociative algebras, in particular\nLie\nalgebras and\nJordan\nalgebras. He worked on rings satisfying conditions of the type\nx\nn\n=\nx\nx^{n} = x\nx\nn\n=\nx\nin\n1945\n.\nHerstein\nwas to carry on the study of rings satisfying this type of condition.\nThe collection of Jacobson's sixteen algebra books are beautifully written, presenting deep results which are accessible to advanced undergraduate and postgraduate students. They include\nThe theory of rings\n(1943)\nand the three volume work\nLectures in abstract algebra\n(1951\n-\n64)\ncovering basic concepts, linear algebra and the theory of fields and\nGalois\ntheory. In\n1956\nhis book\nStructure of rings\nappeared.\nKaplansky\nwrites in\n[\n2\n]\nthat this volume:-\n... includes his account of his structure theory. It was definitive when it appeared. It remains indispensable today; I think it will continue to be indispensable for a long time.\nHe wrote two books which rapidly became classics on\nLie\nalgebras,\nLie algebras\n(1962)\nand\nExceptional Lie algebras\n(1971)\n. On\nJordan\nalgebras he wrote\nStructure and representations of Jordan algebras\n(1968)\nand another major work on algebra was\nPI-algebras : an introduction\n(1975)\n.\nMany honours have been bestowed on this outstanding algebraist. Besides the award of a Guggenheim Fellowship, he has been elected to the\nNational Academy of Sciences\nand the\nAmerican Academy of Arts and Sciences\n. He also has served as president of the\nAmerican Mathematical Society\nfrom\n1971\nto\n1973\n, and was vice-president of the\nInternational Mathematical Union\nfrom\n1972\nto\n1974\n. He was made an honorary member of the\nLondon Mathematical Society\nin\n1972\nand the University of Alabama designated him Sesquicentennial Honorary Professor in\n1981\n. He received the Leroy P Steele Prize for Lifetime Achievement from the\nAmerican Mathematical Society\nin\n1998\n."
}