{
  "nome_completo": "Nicolas-François Canard",
  "nome_curto": "Nicolas-François Canard",
  "ano_nascimento": "1754",
  "ano_morte": "1833",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Canard/",
  "lugar_nascimento": "Sézanne, Haute Marne, France",
  "lugar_morte": "Moulins-sur-Allier, Auvergne, France",
  "biografia": "Nicolas-François Canard\nstudied mathematics and philosophy and, after completing his studies, he joined the Fathers of Christian Doctrine. He served for a year,\n1779\n-\n1780\n, as a teacher at the Collège de Chaumont after which he was appointed as professor of rhetoric at that the Collège de Vitry-le-François where he taught for two years. In\n1782\nhe was appointed to the Lycée de Moulins, run by the Fathers of Christian Doctrine, where he taught for eleven years.\nOne of the other teachers at the Lycée de Moulins was to have a significant influence on Canard's life. This was Joseph Lakanal\n(1762\n-\n1845)\n, the teacher of philosophy, who, like Canard, was in the Fathers of Christian Doctrine. The French Revolution had a dramatic impact on all those living in France at this time. In November\n1790\nthe Assembly required all priests to take an oath of submission. Canard, renouncing his ecclesiastical status, took the oath. In August\n1791\nhe followed his colleague Lakanal and joined famous and influential political club, the Jacobin Club. Here the topical issues of the day were discussed by leading progressive thinkers. Canard came in contact with such men as Antoine-Louis-Claude Destutt de Tracy\n(1754\n-\n1836)\n, who founded the school of ideology\n(\nthe science of ideas\n)\n, Pierre-Jean-Georges Cabanis\n(1757\n-\n1808)\n, a philosopher and physiologist, Constantin-François de Chasseboeuf, Count de Volney\n(1757\n-\n1820)\n, a historian and philosopher, and Dominique Joseph Garat\n(1749\n-\n1833)\n, a writer and politician. The discussions between members of the Jacobin Club clearly influenced Canard's interests.\nThe French Revolution became more radical after\n1891\n. After a brief return to a constitutional monarchy under Louis XVI, the king was put on trial and executed in January\n1793\n. Rival factions fought for control and the reign of terror followed. The Jacobin Club was republican and argued for universal education. In fact, compulsory school attendance in France was introduced from\n1794\n. In August\n1795\nFrance put a new constitution into place, creating a five-man Directory as its governing committee. In April\n1796\nCanard was appointed as professor of mathematics at the École Centrale de Moulins. However, on\n4\nSeptember\n1797\n, there was a coups d'état which removed royalists from the Directory and other bodies. Canard was dismissed from his position of professor of mathematics, having been accused of being a royalist. One of his colleagues was appointed to teach mathematics at the École while, after a time, Canard was again allowed to teach at the École Centrale de Moulins, but this time general grammar rather than mathematics. In December\n1802\n, the École Centrale de l'Allier was combined with the Lycée de Moulins and, following this change, Canard was appointed as professor of mathematics in March\n1803\n. This appointment was carried out by a committee chaired by\nJean-Baptiste Delambre\nand Canard was preferred by the committee to his colleague Noël Baudeux. He was named professor of higher mathematics on\n1\nMarch\n1814\n, a position he only held for a few months before retiring in December\n1814\nat the age of sixty.\nCanard's most important contributions were on mathematical economics where he attempted to use his mathematical skills to attack economic problems such as taxation, supply and demand, pricing and value. He wrote a number of works such as\nPrincipes d'économie politique\nⓉ\n(\nPrinciples of Political Economy\n)\n(1801)\n,\nMoyens de perfectionner le jury\nⓉ\n(\nWays to improve the jury\n)\n(1802)\n,\nTraité élémentaire du calcul des inéquations\nⓉ\n(\nElementary Treatise on calculation with  inequalities\n)\n(1808)\n,\nÉléments de météorologie\nⓉ\n(\nElements of meteorology\n)\n(1824)\nand\nMémoire sur les causes qui produisent la stagnation et le décroissement du commerce en France\nⓉ\n(\nMemoir on the causes of stagnation and the decrease of trade in France\n)\n(1826)\n. The first of these was written as consequence of a winning submission Canard made to a prize competition proposed by the French National Institute of Sciences and Arts. The topic for the competition was taxation, with the specific question being: \"Est-il vrai que, dans un pays agricole, toute espèce d'impôt retombe en dernier terme sur les propriétaires fonciers, et si l'on se décide par l'affirmative, les contributions indirectes retombent-elles sur ces mêmes propriétaires avec une surcharge?\"\nⓉ\n(\nIs it true that in an agricultural country, any kind of tax falls last term on landowners, and if it is decided in the affirmative, indirect contributions they fall on the same owners with an surcharge?\n)\nIn fact Canard made a number of both successful and unsuccessful submissions to various competitions proposed by the French National Institute. He entered the\n1798\ncompetition, \"Déterminer quelle a été l'influence des signes sur la formation des idées\"\nⓉ\n(\nDetermining what has been the influence of signs on the formation of ideas\n)\nwith no success but received an honourable mention a couple of years later for his essay \"To determine the influence of habit on the faculty of thinking, or, in other words, to see the effects produced on each of our mental faculties by the frequent repetition of the same operation\". Thierry Martin explains that Canard was quite successful in these competitions\n[\n15\n]\n:-\nSo Canard gets two honourable mentions, both in the first section, and twice won the prize, the first time in\n1801\nfor his 'Memoir on tax', the second the following year for the dissertation on \"Ways to improve the jury.\" The succession of memoirs and their distribution among the different sections of the classes of moral and political sciences show no clear trend in the direction of Canard's scientific interests. Beginning in\n1796\nwith an analysis of an economic nature, he immediately abandons this area to turn to the theory of knowledge, before returning to economic analysis, after a detour through morality, before turning to the legal field, then returning to the theory of knowledge.\nHowever, the quality of Canard's attempt to apply mathematical techniques, in particular algebraic techniques, to economics has been much criticised. The referees of his competition entries pointed out errors in the way that Canard had applied some of his mathematical machinery. Some later workers have been extremely critical. For example, we quote\nJoseph Bertrand\nwriting in\n1888\n:-\nCitizen Canard, although a mathematics teacher, is ignorant of or forgets the elements of the calculus of functions ... How did he become a laureate of the Institute? On the report of which commission, I have not had the indiscretion to seek answers.\nHowever, more recent reappraisals of Canard's contributions have shown that his work does have merit for, although there are errors, perhaps these are understandable as he is making a study of an unexplored area. Also, it is now possible to see that Canard anticipated some of the ideas which were introduced by later workers.\nRoss Robertson writes in\n[\n17\n]\n:-\nTo Canard belongs the credit for first attempting a comprehensive treatment of the fundamental problem of price determination as a study in the equilibria of forces. To Canard likewise must be attributed the first unequivocal attempt at supply-and-demand analysis. Whatever his errors may have been, there was a sufficient contribution in his book to have enabled a reader with great technical training and superior intellectual gifts to achieve a clearer and more accurate exposition of the matters which he considered.\nR F Hébert in\n[\n10\n]\nexplains the basics of Canard's mathematical economics which does, however, show signs of using ideas from earlier writers. In particular, some of the ideas are similar to those studied by Richard Cantillon, an Irish economist and financier, who wrote\nEssai sur la nature du commerce en général\nⓉ\n(\nAn essay on the nature of commerce in general\n)\n, around\n1730\n. It was published by the Marquis de Mirabeau in\n1755\n. Hébert writes:-\nFirst, without using the terms, Canard advanced both an 'intrinsic' and a 'market' conception of price. He held that everything derives its value from the quantity of labour bestowed upon it. Different\n(\nunmeasurable\n)\nqualities of labour, however, render labour quantity an unsatisfactory measure. Therefore, one must look to the market to discover the determinants of price. Canard developed an equilibrium theory based on the relative bargaining power of buyer and seller, which he related to need and competition.\n(\nClearly recognizing the forces of monopoly and monopsony, he nevertheless failed to develop a bilateral monopoly model.\n)\nSecond, Canard revived Cantillon's 'three rents', and wove them into a general equilibrium conception of the economy, which he used to trace the effects of taxation\n(\nin the process, adumbrating the Ricardian theory of land rent\n)\n. Canard argued that the imposition of a new tax produces disequilibrium and sets in motion certain equilibrating adjustments which take time to work themselves through the economy. Each person who initially pays the new tax will attempt to pass it on to the purchaser of the good, but his success in doing so depends upon the 'forces' encountered; or as we would say today, the tax is shifted in proportion to the elasticities of demand and supply. Canard's maxim that 'every old tax is good, every new tax is bad', must be judged in this context.\nDespite this work by Canard and other early writers,\nAntoine Augustin Cournot\nis usually considered as writing the first significant work on mathematical economics when he published\nRecherches sur les principes mathématiques de la théorie des richesses\nⓉ\n(\nResearch on the mathematical principles of the theory of wealth\n)\n(1838)\n. Although in many ways this is in fact correct, it appears that an important starting point for his work was Canard's book\nPrincipes d'économie politique\nⓉ\n(\nPrinciples of political economy\n)\n(1801)\n. This is, at first sight, rather surprising since\nCournot\nattacks Canard's book in the strongest terms:-\nThese so-called principles are so radically false, and the application of them is so wrong, that the approval of an eminent body could not save the work from oblivion. It is easy to see why essays of this nature should not encourage economists ... to use algebra.\nHowever, Bruce Larson writes\n[\n13\n]\n:-\n... it is highly probable that the 'Principes' played an important role in the development of the 'Recherches'. The 'Principes' showed that mathematics could be used to examine economic questions. It employed the rationality postulate. It used equilibrium as its central analytic concept. It verbally discussed downward-sloping demand and the existence and properties of a monopoly-revenue maximizing price. ... It appears, then, that the 'Principes' presented concepts and methods which\nCournot\nused, suggested conclusions which\nCournot\nverified and rejected, employed relationships which Cournot may have graphed and analyzed, and confirmed\nCournot\nin his asymmetric treatment of supply and demand. Simply put, it gave\nCournot\na point of departure, important elements of which he retained.\nWe should end this biography by noting that Canard was married and his daughter Elisabeth-Félicie Bayle-Mouillard\n(1796\n-\n1865)\npublished several books on a wide variety of topics such as poetry, manuals of domestic economy, and a manual of perfumes. These books were not published under her own name but rather under the pseudonym Madame Celnart."
}