{
  "nome_completo": "Nikolay Yakovlevich Sonin",
  "nome_curto": "Nikolay Sonin",
  "ano_nascimento": "1849",
  "ano_morte": "1915",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sonin/",
  "lugar_nascimento": "Tula, Russia",
  "lugar_morte": "Petrograd (now St Petersburg), Russia",
  "biografia": "Nikolay Sonin\n's father Yakov Sonin had trained in law and was working as a state official at the time of Nikolay's birth but later practised as a lawyer. Nikolay Sonin attended Moscow University where he studied mathematics and physics in the Faculty of Physics and Mathematics from\n1865\nto\n1869\n. In the middle of this period\nNicolai Vasilievich Bugaev\n, after studying for a period of two and a half years with\nKummer\nand\nWeierstrass\nin Berlin and\nLiouville\nin Paris, was appointed as a professor at Moscow University. Sonin published his first paper on differentiation of functions defined with complex exponents in\n1869\n, the year he obtained his first degree. Sonin then undertook research under\nBugaev\n's supervision. He obtained a Master's Degree with a thesis on the expansion of functions in infinite series submitted in\n1871\n. He then taught at the University of Warsaw where he was appointed as a\ndozent\nin\n1872\n. He continued working on his doctorate, essentially equivalent to the German\nhabilitation\n, and after submitting a thesis on partial differential equations of the second order to the Moscow University he was awarded the degree in\n1874\n.\nIn\n1876\nSonin was appointed to a chair in the University of Warsaw. There he played several major roles in high positions in the University including two spells when he was elected to serve as dean of the  Faculty of Physics and Mathematics. He also organised the Society of Natural Scientists and was elected to the\nRussian Academy of Sciences\nin\n1891\n. Two years later he was made an academician in pure mathematics and moved to St Petersburg to take part in the academic and administrative work of the Academy. From\n1894\nSonin also taught at the St Petersburg University for Women. From\n1899\nto\n1901\nhe was superintendent of the St Petersburg Educational District and then from\n1901\nhe was president of the Scientific Committee of the Ministry of National Education. At\nKlein\n's invitation he joined the International Committee on Mathematical Education\n(1909\n-\n1914)\n.\nSonin worked on\nspecial functions\n, in particular studying functions such as Bessel functions, gamma functions and their generalizations, such as functions\nF\n(\nx\n)\nF(x)\nF\n(\nx\n)\nsatisfying\nF\n(\nx\n+\n1\n)\n−\nF\n(\nx\n)\n=\nf\n(\nx\n)\nF(x+1) - F(x) = f (x)\nF\n(\nx\n+\n1\n)\n−\nF\n(\nx\n)\n=\nf\n(\nx\n)\n. In particular he undertook research on cylindrical functions and also worked on the\nEuler-Maclaurin summation formula\n. Among other topics to which he made contributions are Bernoulli polynomials\n(\nnamed after\nJacob Bernoulli\n)\n, mechanical quadrature, approximate computation of definite integrals in which he continued\nChebyshev\n's work on numerical integration,\nChebyshev\ninequalities and multiple integrals. He has a sequence of polynomials named after him - the Sonin polynomials\nT\nm\nn\n(\nx\n)\nT^{n}_{m}(x)\nT\nm\nn\n​\n(\nx\n)\nsatisfy the differential equation\nx\ny\n\"\n+\n(\nm\n+\n1\n−\nx\n)\ny\n′\n+\nn\ny\n=\n0.\nxy\" + (m + 1 - x)y' + ny = 0.\nx\ny\n\"\n+\n(\nm\n+\n1\n−\nx\n)\ny\n′\n+\nn\ny\n=\n0\n.\nYouschkevitch writes in\n[\n1\n]\n:-\nSonin made a substantial contribution to the theory of special functions; the unifying idea of his researches was to establish a few convenient definitions of initial notions and operations leading to broad and fruitful generalisations of the these functions. Especially important were his discoveries in the theory of cylindrical functions, which he enriched both with general principles and with many particular theorems and formulas that he introduced into the contemporary literature. He also worked on Bernouillian polynomials, and his works on the general theory of orthogonal polynomials were closely interwoven with his research on the approximate computation of definite integrals and on various integral inequalities; in the latter area he continued\nChebyshev\n's research.\nTogether with\nA A Markov\n, Sonin prepared a two volume edition of\nChebyshev\n's works in French and Russian."
}