{
  "nome_completo": "Nikolai Ivanovich Lobachevsky",
  "nome_curto": "Nikolai Ivanovich Lobachevsky",
  "ano_nascimento": "1792",
  "ano_morte": "1856",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lobachevsky/",
  "lugar_nascimento": "Nizhny Novgorod (was Gorky from 1932-1990), Russia",
  "lugar_morte": "Kazan, Russia",
  "biografia": "Nikolai Ivanovich Lobachevsky\n's father Ivan Maksimovich Lobachevsky, worked as a clerk in an office which was involved in land surveying while Nikolai Ivanovich's mother was Praskovia Alexandrovna Lobachevskaya. Nikolai Ivanovich was one of three sons in this poor family. When Nikolai Ivanovich was seven years of age his father died and, in\n1800\n, his mother moved with her three sons to the city of Kazan in western Russia on the edge of Siberia. There the boys attended Kazan\nGymnasium\n, financed by government scholarships, with Nikolai Ivanovich entering the school in\n1802\n.\nIn\n1807\nLobachevsky graduated from the Gymnasium and entered Kazan University as a free student. Kazan State University had been founded in\n1804\n, the result of one of the many reforms of the emperor Alexander I, and it opened in the following year, only two years before Lobachevsky began his undergraduate career. His original intention was to study medicine but he changed to study a broad scientific course involving mathematics and physics. Vinberg writes\n[\n44\n]\n:-\nIn the first years the atmosphere in the Department was quite favourable. The students were full of enthusiasm. They studied day and night to compensate for lack of knowledge. The professors, mainly invited from Germany, turned out to be excellent teachers, which was not common. Lobachevsky was highly successful in all courses he took ...\nOne of the excellent professors who had been invited from Germany was\nMartin Bartels\n(1769\n-\n1833)\nwho had been appointed as Professor of Mathematics.\nBartels\nwas a school teacher and friend of\nGauss\n, and the two corresponded. We shall return later to discuss ideas of some historians, for example\nM Kline\n, that\nGauss\nmay have given Lobachevsky hints regarding directions that he might take in his mathematical work through the letters exchanged between\nBartels\nand\nGauss\n. A skilled teacher,\nBartels\nsoon interested Lobachevsky in mathematics. We do know that\nBartels\nlectured on the history of mathematics and that he gave a course based on the text by\nMontucla\n. Since\nEuclid\n's\nElements\nand his theory of parallel lines are discussed in detail in\nMontucla\n's book, it seems likely that Lobachevsky's interest in the Fifth Postulate was stimulated by these lectures. Laptev, see\n[\n29\n]\n, has established that Lobachevsky attended this history course given by\nBartels\n.\nLobachevsky received a Master's Degree in physics and mathematics in\n1811\n. In\n1814\nhe was appointed to a lectureship and in\n1816\nhe became an extraordinary professor. In\n1822\nhe was appointed as a full professor\n[\n1\n]\n:-\n... the same year in which he began an administrative career as a member of the committee formed to supervise the construction of new university buildings.\nLobachevsky had experienced difficulties during this period at the University of Kazan.\nStruik\nwrites in\n[\n2\n]\nthat the administration, led by the curator M L Magnitskii:-\n... reflected the spirit of the later years of Tsar Alexander I, who was distrustful of modern science and philosophy, particularly that of the German philosopher Immanuel Kant, as evil products of the French Revolution and a menace to orthodox religion. The results at Kazan during the years\n1819\n-\n26\nwere factionalism, decay of academic standards, dismissals, and departure of some of the best professors, including ...\nBartels\n...\nDespite these difficulties, many brought on according to Vinberg in\n[\n44\n]\nby Lobachevsky's \"upright and independent character\", he achieved many things. As well as his vigorous mathematical research, which we shall talk about later in this article, he taught a wide range of topics including mathematics, physics and astronomy. His lectures\n[\n44\n]\n:-\n... were detailed and clear, so that they could be understood even by poorly prepared students.\nLobachevsky bought equipment for the physics laboratory, and he purchased books for the library in St Petersburg. He was appointed to important positions within the university such as the dean of the Mathematics and Physics Department between\n1820\nand\n1825\nand head librarian from\n1825\nto\n1835\n. He also served as Head of the Observatory and was clearly strongly influencing policy within the University. However\n[\n30\n]\n:-\n... the clashes with the curator\n[\nMagnitskii\n]\ncontinued.\nIn\n1826\nTsar Nicholas I became ruler and introduced a more tolerant regime. In that year Magnitskii was dismissed as curator of Kazan University and a new curator M N Musin-Pushkin was appointed. The atmosphere now changed markedly and Musin-Pushkin found in Lobachevsky someone who could work with him in bringing important changes to the university. In\n1827\nLobachevsky became rector of Kazan University, a post he was to hold for the next\n19\nyears. The following year he made a speech\n(\nwhich was published in\n1832)\nOn the most important subjects of education\nand this gives clearly what were the ideas in his educational philosophy. Laptev writes in that Lobachevsky\n[\n30\n]\n:-\n... outlined the ideal of the harmonious development of the personality, emphasised the social significance of upbringing and education, and discussed the role of the sciences and the scientist's duty to his country and people.\nThe University of Kazan flourished while Lobachevsky was rector, and this was largely due to his influence. There was a vigorous programme of new building, with a library, an astronomical observatory, new medical facilities and physics, chemistry and anatomy laboratories being constructed. He pressed strongly for higher levels of scientific research and he equally encouraged research in the arts, particularly developing a leading centre for Oriental Studies. There was a marked increase in the number of students and Lobachevsky invested much effort in raising not only the standards of education in the university, but also in the local schools.\nTwo natural disasters struck the university while he was Rector of Kazan\n[\n44\n]\n:-\n... a cholera epidemic in\n1830\nand a big fire in\n1842\n. Owing to resolute and reasonable measures taken by Lobachevsky the damage to the University was reduced to a minimum. for his activity during the cholera epidemic Lobachevsky received a message of thanks from the Emperor.\nThe book\n[\n5\n]\ncontains some yearly reports Lobachevsky wrote as rector of Kazan University. Those published are only a small sample taken from the hundreds of pages of manuscript:-\n... written in\n[\nLobachevsky's\n]\nfull, firm hand, with hardly an error, let alone a crossing-out, reports which were an obstacle to real work in the path of all academics then as now.\nDespite this heavy administrative load, Lobachevsky continued to teach a variety of different topics such as mechanics, hydrodynamics, integration,\ndifferential equations\n, the\ncalculus of variations\n, and mathematical physics. He even found time to give lectures on physics to the general public during the years\n1838\nto\n1840\nbut the heavy work-load was to eventually take its toll on his health.\nIn\n1832\nLobachevsky married Lady Varvara Alexejevna Moisieva who came from a wealthy family. At the time of his marriage his wife was a young girl while Lobachevsky was forty years old. The marriage gave them seven children and it is claimed in\n[\n1\n]\nthat the children:-\n... and the cost of technological improvements for his estate left him with little money upon his retirement.\nIn\n[\n44\n]\nVinberg writes:-\nThe couple lived in a big three-storey house and received a lot of guests with lavish hospitality. However Lobachevsky was not lucky in his marriage.\nAfter Lobachevsky retired in\n1846\n(\nessentially dismissed by the University of Kazan\n)\n, his health rapidly deteriorated. Matveev, in his article\n[\n34\n]\n, quotes many records concerning Lobachevsky's estate which he purchased at Slobodka. There are many claims by biographers that:-\nLobachevsky was an impractical manager who jeopardised his financial position by purchasing the estate while living on a pension; that he had no time to look after the estate and took little interest in it; that he was left in poverty and ignored by the local officials, etc.\nBut Matveev shows that these claims are totally unjustified. Soon after he retired, however, his favourite eldest son died and Lobachevsky was hit hard by this tragedy. The illness that he suffered from became progressively worse and led to blindness. These and financial difficulties added to the heavy burdens he had to bear over his last years. His great mathematical achievements, which we shall now discuss, were not recognised in his lifetime and he died without having any notion of the fame and importance that his work would achieve.\nSince\nEuclid\n's axiomatic formulation of geometry mathematicians had been trying to prove his fifth postulate as a theorem deduced from the other four axioms. The fifth postulate states that given a line and a point not on the line, a unique line can be drawn through the point parallel to the given line. Lobachevsky did not try to prove this postulate as a theorem. Instead he studied geometry in which the fifth postulate does not necessarily hold. Lobachevsky categorised euclidean as a special case of this more general geometry.\nHis major work,\nGeometriya\ncompleted in\n1823\n, was not published in its original form until\n1909\n. On\n11\nFebruary\n1826\n, in the session of the Department of Physico-Mathematical Sciences at Kazan University, Lobachevsky requested that his work about a new geometry was heard and his paper\nA concise outline of the foundations of geometry\nwas sent to referees. The text of this paper has not survived but the ideas were incorporated, perhaps in a modified form, in Lobachevsky's first publication on hyperbolic geometry. He published this work on\nnon-euclidean geometry\n, the first account of the subject to appear in print, in\n1829\n. It was published in the\nKazan Messenger\nbut rejected by\nOstrogradski\nwhen it was submitted for publication by the\nSt Petersburg Academy of Sciences\n.\nIn\n1834\nLobachevsky found a method for the approximation of the roots of algebraic equations. This method of numerical solution of algebraic equations, developed independently by\nGräffe\nto answer a prize question of the\nBerlin Academy\n, is today a particularly suitable method for using computers to solve such problems. This method is today called the\nDandelin\n-\nGräffe\nmethod since\nDandelin\nalso independently investigated it, but only in Russia does the method appear to be named after Lobachevsky who is the third independent discoverer. See\n[\n24\n]\nfor a discussion of the method and its three discoverers.\nIn\n1837\nLobachevsky published his article\nGéométrie imaginaire\nⓉ\n(\nImaginary geometry\n)\nand a summary of his new geometry\nGeometrische Untersuchungen zur Theorie der Parellellinien\nⓉ\n(\nGeometric Investigations on the theory of parellelism\n)\nwas published in Berlin in\n1840\n. This last publication greatly impressed\nGauss\nbut much has been written about\nGauss\n's role in the discovery of non-euclidean geometry which is just simply false. There is a coincidence which arises from the fact that we know that\nGauss\nhimself discovered non-euclidean geometry but told very few people, only his closest friends. Two of his friends were\nFarkas Bolyai\n, the father of\nJános Bolyai\n(\nan independent discoverer of non-euclidean geometry\n)\n, and\nBartels\nwho was Lobachevsky's teacher. This coincidence has prompted speculation that both Lobachevsky and\nBolyai\nwere led to their discoveries by\nGauss\n.\nM Kline\nhas put forward this theory but it has been refuted in several works; see for example\n[\n28\n]\n. Also Laptev in\n[\n29\n]\nhas examined the correspondence between\nBartels\nand\nGauss\nand shown that\nBartels\ndid not know about\nGauss\n's results in non-euclidean geometry.\nThere are other claims made about Lobachevsky and the discovery of non-euclidean geometry which have been recently refuted. For example in\n[\n25\n]\nthe claims that Lobachevsky was in correspondence with\nGauss\n(\nGauss\nappreciated Lobachevsky's works very highly but had no personal correspondence with him\n)\n, that\nGauss\nstudied Russian to read Lobachevsky's Russian papers as claimed for example in\n[\n1\n]\n(\nactually,\nGauss\nhad studied Russian before he had even heard of Lobachevsky\n)\n, and that\nGauss\nwas a \"good propagandist\" of Lobachevsky's works in Germany\n(\nGauss\nnever commented publicly on Lobachevsky's work\n)\nare shown to be false.\nThe story of how Lobachevsky's hyperbolic geometry came to be accepted is a complex one and this biography is not the place in which to go into details, but we shall note the main events. In\n1866\n, ten years after Lobachevsky's death,\nHoüel\npublished a French translation of Lobachevsky's\nGeometrische Untersuchungen\nⓉ\n(\nGeometric Investigations on the theory of parellelism\n)\ntogether with some of\nGauss\n's correspondence on non-euclidean geometry.\nBeltrami\n, in\n1868\n, gave a concrete realisation of Lobachevsky's geometry.\nWeierstrass\nled a seminar on Lobachevsky's geometry in\n1870\nwhich was attended by\nKlein\nand, two years later, after\nKlein\nand\nLie\nhad discussed these new generalisations of geometry in Paris,\nKlein\nproduced his general view of geometry as the properties invariant under the action of some\ngroup\nof transformations in the\nErlanger Programm\n. There were two further major contributions to Lobachevsky's geometry by\nPoincaré\nin\n1882\nand\n1887\n. Perhaps these finally mark the acceptance of Lobachevsky's ideas which would eventually be seen as vital steps in freeing the thinking of mathematicians so that relativity theory had a natural mathematical foundation."
}