{
  "nome_completo": "Nina Karlovna Bari",
  "nome_curto": "Nina Bari",
  "ano_nascimento": "1901",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bari/",
  "lugar_nascimento": "Moscow, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Nina Bari\n's parents were Olga Eduardovna Seligson and Karl Adolfovich Bari. Karl Adolfovich was a medical doctor. Nina Karlovna was educated at a private school, L O Vyazemska's High School for Girls in Moscow, where she showed great potential in mathematics. At this time the education available for girls in Russia was of lower quality than that of boys and, as a consequence, the final examinations for girls were of a lower standard than those for boys. However, Bari wanted to show her proficiency in mathematics so she took the highly unusual step of taking the boy's leaving examinations. After the October\n1917\nRevolution in Russia the Bolshevik Party introduced major educational reforms, the most relevant to Bari being that for the first time universities were open to women as well as men. Before the Revolution, women who wanted further education attended colleges such as the Moscow Women's College. The year\n1918\nwas the first in which women were allowed to enter Moscow State University and this coincided nicely with Bari achieving the entrance qualifications. In fact the University had been closed during the disruption caused by the Revolution and\n1918\nwas the first year in which it reopened. She entered the Faculty of Mathematics and Physics at Moscow State University at a time when it was becoming an extremely vigorous research environment.\nIn the Moscow School of Mathematics she came under the influence of\nNikolai Nikolaevich Luzin\nbut he was only one of a number of world-class mathematicians teaching at the university at this time, including\nSergei Alekseevich Chaplygin\n,\nDimitri Fedorovich Egorov\n,\nVyacheslaw Vassilievich Stepanov\nand\nNikolai Egorovich Zhukovsky\n. Among the undergraduate students\nPavel Samuilovich Urysohn\nwas in his final year of study and remained part of the School of Mathematics undertaking research. This strong mathematical group, which the students called 'Luzitania', was joined by\nPavel Sergeevich Aleksandrov\nin\n1920\n[\n4\n]\n:-\nNina Bari's student years coincided with the rapid growth of the Moscow Mathematical school, which was to be a very great influence in the subsequent blossoming of the whole of mathematics in the Soviet Union. This was the period of intensive development of the Moscow real variable school, headed by\nN N Luzin\n, under whose guidance Nina Bari started her own mathematical work while still an undergraduate. In fact, it was then that she first began to study the uniqueness problem for trigonometric series.\nTo see why 'Luzitania' was so successful, we need look no further than the comments that\nAleksandrov\nmade about this time:-\nTo see\nLuzin\nin those years was to see a display of what is called an inspired relationship to science. I learnt not only mathematics from him, I received also a lesson in what makes a true scholar and what a university professor can and should be. Then, too, I saw that the pursuit of science and the training of young people in it are two facets of one and the same activity - that of a scholar.\nBari graduated in\n1921\n, and having completed the four-year course in only three years, she became the first woman to graduate from Moscow State University. She began teaching mathematics at a number of institutions, the Moscow Forestry Institute, the Moscow Polytechnic Institute, and the Sverdlov Communist Institute. However, her aim was to become a university teacher and having sampled the excitement of 'Luzitania' while an undergraduate she applied for a research fellowship. She won one of a small number of available scholarships and joined the Research Institute of Mechanics and Mathematics at Moscow State University. Bari began research at the Institute, with\nLuzin\nas her thesis advisor, but continued to hold her teaching posts. She undertook research on the theory of trigonometrical series and her major results were announced in her first paper\nSur l'unicite du developpement trigonometrique\nⓉ\n(\nOn the uniqueness of trigonometric development\n)\npublished by the\nAcadémie des Sciences\nin Paris in\n1923\n. In the same year she presented the results in a lecture to the\nMoscow Mathematical Society\n(\nbecoming the first woman to address the Society\n)\n. In addition to support from\nLuzin\n, she was strongly influenced by\nDmitrii Evgenevich Menshov\nwho had undertaken research with\nLuzin\nbut returned to Moscow State University as a lecturer in\n1922\n. Bari's thesis\nOn the uniqueness of trigonometric expansions\nwas submitted in\n1925\nand the degree awarded after she defended her thesis in January\n1926\n. The exceptional quality of this thesis led to her being awarded the Glavnauk Prize. After this Bari became a research assistant at the Institute of Mathematics and Mechanics in Moscow. She published further papers in\n1926\n, namely\nSur la representation analytique d'une classe de fonctions continues\nⓉ\n(\nOn the analytical representation of a class of continuous functions\n)\nand\n(\nwith\nD E Menshov\n)\nSur l'integrale de Lebesgue-Stieltjes et les functions absolument continues de fonctions absolument continues\nⓉ\n(\nOn the integral of Lebesgue-Stieltjes and absolutely continuous functions of absolutely continuous functions\n)\nboth of which had the distinction of also appearing in the\nAcadémie des Sciences\npublications. In\n1927\nshe published detailed proofs of the results of her thesis which she had announced in her first paper\n[\n4\n]\n:-\nAlready this first piece of work by Nina Bari testified to her great mathematical talent, since it included the solution of several very difficult problems in the theory of trigonometric series that had lately been engaging the attention of many outstanding mathematicians.\nDuring\n1927\n-\n29\nshe spent time at the Sorbonne and the Collège de France in Paris, attending lectures by\nJacques Hadamard\n. After attending the Polish Mathematical Congress in Lwów, she also attended the International Congress of Mathematicians in Bologna in\n1928\nat which she gave the invited lecture\nSur la structure analytique d'une fonction continue arbitraire\nⓉ\n(\nOn the analytical framework of an arbitrary continuous function\n)\n. Following this, she was awarded a Rockefeller fellowship which funded a second year-long visit to Paris. In\n1929\nshe returned to Moscow State University where she became a full professor in\n1932\n. Three years later she was awarded the equivalent of a D.Sc. in Physical-Mathematical Sciences. This degree, normally conferred after submitting a thesis, was awarded to Bari without the thesis requirement\n[\n4\n]\n:-\n... since she was already recognised as one of the leading mathematicians specializing in the theory of functions of a real variable.\nThe year Bari graduated from Moscow State University, Viktor Vladmirovich Nemytski entered the university to read mathematics. They became close friends sharing not only mathematical interests but also a love of hiking in the mountains. They were eventually married. The vigorous school at Moscow State University headed by\nLuzin\nbegan to run out of steam in the last few years of the\n1920\ns as he concentrated on writing monographs. He left the University in the early\n1930\ns to work at the\nUSSR Academy of Sciences\nand from\n1935\non he led the Department of the Theory of Functions of Real Variables at the Steklov Institute. This left Bari and\nMenshov\nto take over his role of leading the School of Function Theory which they did in the\n1940\ns.\nBari was an outstanding research mathematician who wrote over fifty research articles. The authors of\n[\n4\n]\nwrite:-\nNina Bari was one of the acknowledged leaders of the Soviet real variable school, and a worthy representative of this discipline at the Moscow University with which it is so closely associated. Her numerous papers exerted a great influence on the development of such fundamental branches of the theory of functions as the theory of trigonometric series, orthogonal series and bases, etc. Several of her investigations are rightly regarded as classics, for example her papers on the theory of uniqueness for trigonometric series and on the superpositions of functions. ... a number of her papers, for example those on the theory of uniqueness and on bases, have served as starting-points for new lines of research in the theory of functions, afterwards intensively developed ...\nLet us mention in particular her paper\nThe uniqueness problem of the representation of functions by trigonometric series\n(\nRussian\n)\nwhich she published in\n1949\n.\nAntoni Zygmund\ndescribes it as:-\n... an exhaustive review, in many cases accompanied by complete proofs, of the existing results in the theory of uniqueness of representation of functions by trigonometric series.\nThis paper was translated into English and was published as a\n90\n-page book by the\nAmerican Mathematical Society\nin\n1951\n. In\n[\n1\n]\nher final publication, a\n936\n-page research monograph on trigonometric series, is described as follows:-\nThe range and depth of topics covered is quite extensive, and most of her work in the field is included. But even within so long a monograph, the subject could not be completely exhausted. ... It has become a standard reference for mathematicians specializing in the theory of functions and the theory of trigonometric series.\nThe fifteen chapters of the book are: Basic concepts and theorems;\nFourier\ncoefficients; Convergence of a\nFourier series\nat a point;\nFourier\nseries of continuous functions; Convergence and divergence of a\nFourier\nseries on a set; \"Correcting\" a function on a set of small measure; Summability of\nFourier\nseries; Conjugate trigonometric series; Absolute convergence of\nFourier\nseries; Sine and cosine series with decreasing coefficients; Lacunary series; Convergence and divergence of general trigonometric series; Absolute convergence of general trigonometric series; The problem of uniqueness of the expansion of a function in a trigonometric series; and Representation of functions by trigonometric series.\nBari also wrote textbooks for use in teaching training institutes such as\nHigher Algebra\n(1932)\nand\nThe Theory of Series\n(1936)\n. She edited the complete works of\nLuzin\nand was the editor of two important mathematics journals. She also translated\nLebesgue\n's famous book on integration into Russian.\nShe died by falling in front of a train on the Moscow Metro. It has been claimed that this was suicide due to depression caused by\nLuzin\n's death eleven years earlier. One of her students, P L Ul'yanov, wrote after her death\n[\n1\n]\n:-\nThe untimely death of N K Bari is a great loss for soviet mathematics and a great misfortune for all who knew her. The image of Bari as a lively, straightforward person with an inexhaustible reserve of cheerfulness will remain forever in the hearths of all who knew her.\nFinally let us give some indication of her personality and interests outside mathematics. We have already mentioned her love of hiking which took her into seriously difficult terrains in the Caucausus, Pamir and Tian Shan mountains. Her love of music and the arts included ballet, literature and poetry.\nMikhail Lavrent'ev\nand L A Lyusternik write of her\n[\n3\n]\n:-\n... lively temperament, directness, with an inexhaustible supply of young vigour ..."
}