{
  "nome_completo": "Ole Jacob Broch",
  "nome_curto": "Ole Jacob Broch",
  "ano_nascimento": "1818",
  "ano_morte": "1889",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Broch/",
  "lugar_nascimento": "Fredrikstad, Norway",
  "lugar_morte": "Sèvres, France",
  "biografia": "Ole Jacob Broch\nwas both a mathematician and a politician. His parents were Johan Jørgen Broch\n(1791\n-\n1860)\n, a military man and a member of parliament, and Jensine Laurentze Bentzen\n(1790\n-\n1877)\n. At the time Ole Jacob was born his father was in command of a company at Fredrikstad but later that year he was transferred to Kristiansand where Ole Jacob spent his childhood. Ole Jacob had a younger brother Jens Peter Broch\n(1819\n-\n1886)\n, who became an orientalist and linguist specialising in Semitic languages. Ole Jacob was the uncle of Elise Heyerdahl\n(1858\n-\n1921)\n, one of the first women elected to the Oslo City Council.\nOur biography below is based largely on\n[\n3\n]\nwith some additions, particularly concerning his work in mathematics.\nBroch first studied some advanced mathematics as an eleven-year-old with his uncle, Major General Theodor Broch\n(1796\n-\n1863)\n, who taught him the differential and integral calculus. He received a more classical education at Kristiansand Cathedral School, and later at the Institute of Head Teacher Møller in Christiania\n(\nnow named Oslo\n)\nafter the family moved there in\n1833\n. After finishing school in\n1835\n, he started teaching at Møller's Institute, while he was studying at the University of Christiania. During that time,\nBernt Holmboe\nwas working on publishing the papers left by\nNiels Henrik Abel\n, who had died in\n1929\n. Broch was a gifted student, and soon, many were hoping that he would become\nAbel\n's successor. He submitted his first paper\nSur quelques propriétés d'une certaine classe de fonctions transcendantes\nⓉ\n(\nOn some properties of a certain class of transcendent functions\n)\nto\nCrelle's Journal\nin August\n1839\n; it was published in\n1840\nin volume\n20\n.\nBroch spent the years from\n1840\nto\n1842\nabroad supported by grants from the State. In Paris, he worked on mathematics within the abelian tradition, including elliptic functions and abelian integrals. He attended lectures at the École Polytechnique and the Collège de France by\nClaude-Louis Navier\nand by Jacques Babinet\n(1794\n-\n1872)\n, an expert on optics. The\nFrench Academy of Sciences\nhaving \"lost\"\nAbel\n's thesis may have worked to Broch's advantage, as no one wanted to risk committing a similar offence towards another Norwegian. Broch was therefore well received in Paris, not least by\nCauchy\n, one of the central figures in the\nAbel\nscandal.\nCauchy\n's work on the theory of light aroused Broch's interest, and it was in this field that he would make his greatest scientific contribution.\nOle Jacob Broch became a professor of mathematics, a school reformer, a textbook author and a government minister. Practical judgment, energy and determination to get something done characterized most of his activity, and his versatility and friendly disposition made him a popular figure during the latter half of the\n19\nth century. He married Friederike Ernestine Wilhelmine Schmidt\n(5\nFebruary\n1823\n-\n13\nOctober\n1901)\non\n27\nOctober\n1843\n, daughter of Friedrich Wilhelm Schmidt from Berlin and Louise Wilhelmine Guthertz.\nWhile he was abroad, Broch was active in areas beyond mathematics. During his stay in Paris, he became familiar with new theories in optics, and attended lectures in various topics in both mathematics and physics. When he later travelled to Berlin and Königsberg, he was able to follow up this new interest in optics with practical experiments. In Berlin he studied optics and descriptive geometry, while in Königsberg in\n1842\nhe studied mathematical physics with\nCarl Jacobi\n, Friedrich Julius Richelot\n(1808\n-\n1875)\n, and\nFranz Neumann\n. A third scientific area that inspired Broch while abroad was the application of mathematics to statistics.\nOne can easily get the impression that once Broch had proved his mathematical ability by completing some advanced and independent work, he then hurried on to try out his other skills. Mathematics led him to physics and mechanics on the one hand, and to statistics and economics on the other.\nBack home, in\n1842\n, he became a research fellow at the University of Christiania in pure and applied mathematics, and in mathematical physics. However, Broch resigned from his position quickly, in order to found Nissen's Latin and Science School in\n1843\nwith his friend Hartvig Nissen\n(1815\n-\n1874)\n. His involvement with this school, which lasted until\n1847\n, is typical of Broch, who worked to raise the level of science education there, just as he would do in his other positions within the education sector. At Nissen's Latin and Science School\n[\n2\n]\n:-\n... three and four hours a week\n[\nof mathematics\n]\nwere taught in the two upper forms. During the school's first few years, Ole Jacob Broch obviously led all the teaching of mathematics. When Broch left the school ... it was still in many ways\n[\nhe\n]\nwho ruled the teaching of mathematics. As professor of mathematics Broch not only taught future teachers ...\n[\nhe\n]\nalso determined the requirements for the 'examen artium'. Broch was known to be such a strict examiner and censor that many could not pass his requirements ...\nThe school was a forerunner for later reforms within the public school system.\nBroch was part of the creation of an institution that recruited students, on behalf of the university, for a new course that did not yet exist, but of which Broch was a great advocate, and which would aim to educate science teachers. It has been claimed that Broch was the brains behind this reform. Nissen was consulted by the authorities on the school reform, and was a central figure in the legislative work that led to the creation of the science teacher examination in\n1851\n.\nIn\n1847\n, Broch was the first to make use of the new rule that made it possible to write his doctoral thesis in Norwegian. The title of the thesis was\nLovene for Lysets Forplantelse i isophane og eenaxig krystalliserede Legemer\nⓉ\n(\nThe laws of light propagation in isophane and single-axed crystallized bodies\n)\n, a topic that had interested him since his time in Paris. Broch resumed his position as a fellow at the University of Christiania after the award of his doctorate.\nAt the University of Christiania, mathematics was divided into two areas: pure and applied mathematics. Christopher Hansteen\n(1784\n-\n1873)\nwas responsible for applied mathematics and astronomy, and\nBernt Holmboe\nfor pure mathematics. In\n1848\n, Broch was appointed extraordinary lecturer in applied mathematics to relieve Christopher Hansteen from his substantial workload, with the clear assumption that Broch would take over whichever of the two positions that would first become available. His health was quite poor however, and so he spent the following two years in France, Spain and Madeira.\nWhen\nHolmboe\ndied unexpectedly in March\n1850\n, Broch started lecturing in pure mathematics. However, it seems like his teaching remained quite similar no matter the position he officially held. Broch continued lecturing on mechanics even after going over to pure mathematics.\nBroch was also involved in the question of developing a polytechnic course or school, an issue that was not resolved during his life time. It appears that he was divided between his desires as a scholar and his views on what would be the most economically viable for the nation. He agreed that a polytechnic education should become part of the university, but argued at the same time that this was far too expensive, and that it would be better if the science high schools taught the basic level of technological education and the university and the Military College\n(\nDen militaere høyskole\n)\nshared responsibility for the higher-level technological education.\nBroch worked at the university from\n1848\nto\n1869\nand again from\n1872\nto\n1879\n, from\n1858\nonwards as a professor. He wrote textbooks and initiated reforms. Not only did he promote higher requirements for the level of science education, he also published textbooks that would make this possible. His great work on mechanics,\nLehrbuch der Mechanik\nⓉ\n(\nTextbook of mechanics\n)\n, which was published in Berlin in\n1854\n, is important in this respect. But he published textbooks in other areas as well, including in arithmetic and algebra, descriptive geometry, definite integrals, analytical plane geometry, analytical stereometry and trigonometry. For example he published\nTraité Élémentaire des Fonctions Elliptiques\nⓉ\n(\nElementary Treatise on Elliptic Functions\n)\nin\n1867\n,\nLaerebog i Arithmetik og Algebraens Elementer\nⓉ\n(\nTextbook of arithmetic and elementary algebra\n)\nin\n1860\nand\nLogarithme-Tabel med\n5\nDecimaler\nⓉ\n(\nLogarithm tables to\n5\ndecimal places\n)\nin\n1865\n.\nFor many years\n(1843\n-\n1858)\n, Broch taught the armed forces, first at the Military Academy\n(\nKrigsskolen\n)\n, and later at the Military College as well. He raised the level of science education in both institutions, partly by giving extra lessons in modern mathematics, descriptive geometry and later also in natural science, and partly by improving the regular mathematics teaching. At the time, it was common for the scientists working at the University, whose subjects were also taught at the military institutions, to lecture in both places.\nBroch extended his activity beyond academia early on and he applied his skills practically in his work in many areas of society. In\n1847\n, he founded \"Christiania almindelige, gjensidige Forsørgelsesanstalt\"\n(\nlater simply called \"Gjensidige\"\n)\n, Scandinavia's first life insurance company. In\n1852\nhe became part of the board of the country's first public bank\n(\nother than Norway's central bank\n)\n, Kongeriget Norges Hypothekbank. He played a central role in\n1857\nduring the establishment of Den norske Creditbank, a commercial bank, and was at its head for several years from\n1859\nonwards. He also combined his scientific interests with practical work in banking and insurance by working out statistics and various tables.\nTelegraph and railway construction was another area in which Broch was active. He was part of the board of directors during the construction of several railway tracks and a member of the commission that drafted the plans for nationwide telegraph lines. He continued his commitment to the development of the country's communication infrastructure in\n1868\nwhen he became the permanent chairman for the \"Engineering Commission\", an advisory and coordinating body for all public work.\nBroch also had a career as a politician. In\n1857\n, he was elected onto Christiania's\n(\nOslo's\n)\ncity council, and was part of its executive committee for two terms\n(1861\n-\n1869\nand\n1873\n-\n1876)\n. From\n1862\nto\n1869\n, he was a member of Parliament for Christiania. In Parliament, he led the railway committee and was a member of the military committee.\nBroch left the university in\n1869\nwhen he became part of the government, where he was at the head of the Department of the Navy and the Postal Service. This ministerial office put him in control of the Navy's workshops and the development of the postal service. Broch's role in the government was the culmination of his political career, but it came also as a consequence of his scientific and technological interests and of his commitment to the economic development of the nation.\nHowever, his time as Minister of the Navy was cut short. He resigned from the government in\n1872\nbecause of a controversy over the ministers' access to Parliament. Parliament had voted a constitutional reform forcing the government to meet the Parliament regularly, but the government advised the king, Oscar II, not to assent to the bill, in effect using his veto power. Unlike most of the government, Broch disagreed with this. Like the rest of the government, he opposed the constitutional reform, but thought that refusing to assent to it would not give the desired result. Broch argued that this denial would actually provoke what would later be called \"parliamentary government\", i.e. that the government would practically be under the control of the parliamentary majority. Politically, Broch must be considered a moderate. His position on this issue should not be interpreted as a directly parliamentary stance, but rather as an example of his pragmatic attitude.\nOle Jacob Broch espoused Scandinavianism, the idea of uniting Norway, Sweden and Denmark, and was the first chairman of the Scandinavian Society\n(\nSkandinaviske Selskab\n)\nfounded in\n1864\n. Despite this, he let practical considerations overrule his position as a Scandinavist, when in\n1872\n, as a member of the Nordic Coin Commission, he opposed the proposition that the Swedish currency should apply to the three realms, and suggested the German currency instead.\nBroch's life achievements span four different aspects: science and education, administration and economic development, politics, and international activity. All these can be considered to tend towards the same goal: progress under freedom. The laws passed by the parliament all intended to drive society toward something better, but this development was dependent on each person being able to flourish freely and interact with others. Thus, it became necessary to facilitate relations between individuals, as this was a prerequisite for progress. In practice, this can be seen through Broch's work for the establishment of the railroad, the telegraph and the postal service, and more indirectly through his efforts in banking and insurance. In his political career, his pursuit of free trade, his favourable position on the political union between Norway and Sweden and his support of Scandinavism are examples of his desire for exchanges to reach larger communities.\nAn important prerequisite for being able to communicate is to speak the same language. The efforts during the\n19\nth century to standardise weights and measures in various areas was a key instrument in promoting technological development as well as scientific communication. Broch's work in this area was crucial for Norway, who adopted the metric system in\n1875\n, and his contribution was also of great importance internationally.\nDuring the\n1870\ns, Broch's scientific endeavours in Norway gave way to international duties. He was Norway's representative at the many international exhibitions, which displayed both industry and science. In\n1879\n, he was employed by the International Bureau of Weights and Measures in Sèvres, and was asked to devise an international scientific weights and measures system. In\n1883\n, he became the director of the Bureau and several Norwegian scientists were hired, for shorter or longer periods, as assistants at the Bureau. Broch's career as a scientist concluded with the large standardization work being virtually completed by his death.\nAlongside this permanent position in Sèvres, he often held other representative or diplomatic positions. He was the delegate from Norway and Sweden at the International Diplomatic Conference in Paris in\n1880\nand was, from\n1881\nto\n1882\n, Norway's negotiator for the conclusion of a new trade treaty with France. He also participated at the Paris Convention for the Protection of Industrial Property in\n1883\n, at the Conference on electrical units in\n1884\n, and had been appointed as Norway's general commissioner at the Exposition Universelle in Paris in\n1889\n, although he died in that year before carrying out his duties.\nDuring the tense days in June\n1884\n, when Christian Homann Schweigaard's \"April government\" resigned, Ole Jacob Broch was called back from Paris and asked to try to form a government. However, he wished to have some ministers from the Liberal party\n(\nVenstre\n)\nin his government. The attempt failed, and Broch left politics permanently and returned to Paris.\nSince Broch was very popular, this became a widely discussed subject at the time, and historians have later devoted considerable attention to the political altercations of that summer. How much the lost opportunity to become prime minister meant for Broch himself is uncertain. He had several other interests to protect and many irons in the fire.\nAs a politician, Ole Jacob Broch is a typical representative of the generation which was active during the mid-\n19\nth century. The battle to secure the Norwegian Constitution, adopted in\n1814\n, against Swedish interference had ended, the relations between the two united kingdoms were harmonious, although there were still some dark shadows. It was an optimistic era where great faith was given to the accomplishments of science. It was therefore perfectly natural that outstanding academics held political office. It was perhaps more the practical possibility to get something done rather than true political interest that lured Broch into public life. Few have had as many public and semi-public positions as Broch. In addition to the tasks for which Broch's academic qualifications made him the obvious choice, he also had a wide range of duties that required comprehensive professional knowledge, critical sense and above all academic authority.\nOle Jacob Broch was a significant personality in Norway in the\n19\nth century, especially since he was active in so many various areas. His scientific and creative efforts found their natural continuation in politics. He was not interested in power, but keen to achieve things, preferably in collaboration with others from moderate circles. \"Ola-Jakob\", as he was called, was of a friendly disposition, but could also be ruthlessly honest during a factual discussion. Flexibility was not in his nature if it went against professional considerations.\nOle Jacob Broch was honoured for his achievements, both scientific as well as political, with a variety of awards and distinctions. He was a member of the Royal Norwegian Academy of Sciences and Letters from\n1849\n, the Academy of Sciences of Christiania\n(\nnow\nNorwegian Academy of Science and Letters\n)\nfrom its foundation in\n1857\n, as well as a member of many scientific academies such as those of Trondheim, Stockholm and Copenhagen. He became Knight of the Order of St Olav in\n1855\n, Commander of the order in\n1866\nand was awarded the Grand Cross of St Olav in\n1879\n. He was also Grand Officer of the French Legion of Honour and Commander Great Cross of the Swedish Order of the Polar Star."
}