{
  "nome_completo": "Olinthus Gilbert Gregory",
  "nome_curto": "Olinthus Gregory",
  "ano_nascimento": "1774",
  "ano_morte": "1841",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gregory_Olinthus/",
  "lugar_nascimento": "Yaxley, Huntingdonshire (now Cambridgeshire), England",
  "lugar_morte": "Woolwich, near London, England",
  "biografia": "Olinthus Gregory\n's parents are unknown but they must have been working class.  His first schooling was in his home town but then he spent over ten years at Richard Weston's boarding school. Weston\n(1732\n-\n1806)\nwas primarily a botanist who published a number of works on gardening and botany but he was also a competent mathematician. The training that he gave Gregory was of such a high standard that in\n1793\n, at the age of nineteen, Gregory published\nLessons, Astronomical and Philosophical\n. It is interesting to give the full title of the work which is so long that it is seldom quoted:\nLessons, Astronomical and Philosophical: for the Amusement and Instruction of British Youth: Being an Attempt to Explain and Account for the Most Usual Appearances in Nature in a Familiar Manner, From Established Principles, the Whole Interspersed With Moral Reflections\n. Gregory was able to publish that text-book having acquired John Joshua Proby, earl of Carysfort, as his patron. Proby was a fellow of the\nRoyal Society\nand held high political office at the time. Gregory's work, covering a wide range of topics, became a popular school-book. We quote his ideas given in the book for regulating musical time. He proposes:-\n... the substitution of proper characters to denote the different kinds and velocities of musical time, instead of those vague, indefinite ones which are now in use. ... Every composer of musical airs would be of real service to the practitioner if he would point out the absolute rate at which his music is to be performed; this would be no difficult task as he would only have to mention the length of a pendulum which would make one complete vibration in the time that part of a bar called a beat was performing.\nAt this time Gregory was still being taught by Richard Weston who suggested to him that he contribute, as Weston did himself, to the mathematical problems in the\nLadies' Diary\n. Here are two of the questions Gregory proposed for\n1793\n-\n94\n:-\nThe sum of all the chords drawn in a semicircle from one end of the diameter to those points which divide the circumference into a certain number of equal parts\n(\ntogether with the diameter\n)\nis\n429\n.\n7877\n. Now if the diameter be\n100\n, what is the number of chords and the length of each?\nThere is an inflexible rod, void of gravity,\n26\ninches long, at one end of which is suspended\n1\ncwt.\n1\nqr.\n23\n1\n2\n23\\large\\frac{1}{2}\\normalsize\n2\n3\n2\n1\n​\nlbs. of sugar, in a barrel that weighs\n21\nlb.; at\n1\nfoot distance from this end hangs a weight of\n8\n1\n2\n8 \\large\\frac{1}{2}\\normalsize\n8\n2\n1\n​\nlbs. and\n4\ninches further a weight of\n6\n1\n2\n6\\large\\frac{1}{2}\\normalsize\n6\n2\n1\n​\nlbs.; also at\n7\ninches from the other end  weight of\n5\nlb., and at this other end a weight of\n4\n1\n2\n4\\large\\frac{1}{2}\\normalsize\n4\n2\n1\n​\nlbs. Query the point of the rod, which being made a fulcrum, these weights etc will remain in equilibrio?\nIn\n1794\nhe composed a treatise on the slide rule. This was never published but it brought him to the attention of\nCharles Hutton\n. Gregory, perhaps encouraged by\nHutton\n, began to think of an academic career. However, while studying Christianity deeply, he went though various different beliefs but felt he could not subscribe to the Thirty-Nine Articles of religion which was required before a student could matriculate. Nevertheless, he went to Cambridge around\n1798\nwhere he taught mathematics, ran a bookshop for about a year, and worked as an editor of the\nCambridge Intelligencer\nfor about six months. This radical newspaper began publishing in\n1793\nand ended publication in\n1803\n. Gregory still appears as \"Teacher of Mathematics, Cambridge\" on the title page of his book\nA Treatise on Astronomy\npublished in\n1802\n. He dedicated the work to\nCharles Hutton\n:-\nIn testimony of admiration and esteem for the eminent talents and genius he has so frequently and usefully displayed in his public capacity; and for those generous and amiable qualities which shed a lustre over the path of private life ...\nGregory explains in the Preface of\nA Treatise on Astronomy\nthat he has religious reason for studying the subject. While making such a study, he writes:-\n... is it possible that we should not be impressed with a sense of the unlimited power, unbounded wisdom, and infinite goodness, of the adorable Creator and Governor? The great excellence of Astronomy then, even as a promoter of morality and devotion, must be admitted if it appear that it furnishes us with stronger arguments to prove the existence of a supreme, intelligent First Cause - shows more effectually his power and wisdom - or gives us more clear and just notions of his other attributes and perfections ...\nHis friendship with\nHutton\ncertainly stood him in good stead for\nHutton\nrecommended him for the new position of second mathematical master at the Royal Military Academy at Woolwich, a post he took up in December\n1802\n. He married Anne Beddome\n(\nborn\n1789)\n, a daughter of Boswell Brandon Beddome and Ann Wilkins, on\n20\nDecember\n1809\n; they had three children, Annie\n(\nborn\n1811)\n, Boswell Robert\n(\nborn\n1813)\nwho sadly drowned in the Thames, and Charles Hutton\n(1817\n-\n1898)\nwho became a well-known engineer. In May\n1821\nGregory was appointed to the chair of mathematics at the Royal Military Academy, Woolwich, and held this post until he retired in June\n1838\n. For the last ten years he had suffered from an illness which became progressively more severe. He died at his home on Woolwich Common.\nIn addition to his duties at Woolwich, Gregory undertook several other tasks. He edited the\nGentleman's Diary\nfrom\n1802\nuntil\n1819\n. From\n1818\n, he edited the\nLadies' Diary\n, was involved in the production of\nWhite's Ephemeris\n(\nsecond only to the\nNautical Almanac\nas an astronomical almanac\n)\n, and was in charge of acquiring the astronomical data necessary for all the almanacs published by the Worshipful Company of Stationers and Newspaper Makers of London. He was an important member of the Philosophical Society of London which grew up in the early\n1800\ns and was officially founded in\n1811\nwith its own rooms in Fleet Street, London. He was elected vice-president of the Society and lectured to it on ballistics. However, the Society only survived until\n1815\n. He then became a founder member of the\nRoyal Astronomical Society\n, being one of fourteen to attend the first meeting of that Society on Wednesday\n12\nJanuary\n1820\n. Of these fourteen, Gregory was elected to serve on the committee along with\nJohn Herschel\n,\nCharles Babbage\n, Henry Colebrooke, Thomas Colby, Daniel Moore, William Pearson, and Francis Baily. Gregory served as secretary to the\nRoyal Astronomical Society\nfrom\n1824\nto\n1828\nand as vice-president in\n1829\n-\n30\n. Perhaps it is worth noting at this point that\nHerschel\nconsidered Gregory\n[\n3\n]\n:-\n... as rather too coarse in his strictures and behaviour.\nProposals to set up a secular university in London were made in\n1825\nand Gregory soon added his weight to the movement. By the end of the year Gregory was serving on a ten-man committee which had been set up to interview and select the university's teaching staff. His name was inscribed on the foundation stone of the new University, laid in Gower Street on\n30\nApril\n1827\n.\nLet us now look at a few more of Gregory's publications, in addition to those already mentioned above. In\n1806\nhe published the\n2\n-volume work\nA Treatise of Mechanics, theoretical, practical and descriptive\n. The book was dedicated, as his earlier work, to John Joshua Proby, earl of Carysfort. Gregory wrote:-\nAlthough the promotion of the arts and sciences has been ever deemed the proper province of the great and noble, yet it has not always been the good fortune of those who employ their time and exertions in the dissemination of knowledge to meet with a patron who is at once distinguished by his rank, his talents, and his zeal in the encouragement of useful performances. I cannot, therefore but esteem it a high honour and a source of considerable gratification that I am permitted to present a 'Treatise of Mechanics' to the public under you Lordship's protection ...\nIn the Preface Gregory explains why he wrote the book:-\nIt has of late been a too prevailing opinion in this country that a man may become celebrated as a natural philosopher and be very successful in the application of his knowledge to practical purposes, particularly in the construction of machinery, while he is completely unacquainted with the principles of mathematics. Among a variety of unpleasant consequences which have resulted fro this erroneous opinion may be reckoned the rapid decline of the mathematical sciences in Britain, the dissemination of superficial and vague notions on physical topics and the absolute necessity of having recourse to foreign publications for profound and extensive information on these subjects which we should have supposed had not experience convinced us to the contrary, Englishmen would have been proud to cultivate since they were first placed upon an unshaken basis in the 'Principia' of our own countryman, the illustrious\nNewton\n.\nThe first volume was divided into five books: Statics; Dynamics, Hydrostatics, Hydrodynamics, and Pneumatics. The second volume covered Practical Mechanics and Description of Machines\n(\nAlphabetically arranged\n)\n.\nIn\n1811\nGregory published\nLetters on the Evidences, Doctrines, and Duties of the Christian Religion\n. He explains in the Preface that the letters were written to a friend:-\n... much younger than myself, who had a considerable acquaintance with almost all except religious subjects. He expressed much surprise that a person of my habits and pursuits in other respects should adopt the religious notions I had long entertained ...\nIn this work he states:-\nWe do not deny that the scheme of revelation has its difficulties: for if the things of nature are often difficult to comprehend, it would be strange indeed if supernatural matters were so simple, and obvious, and suited to finite capacities, as never to startle or puzzle us at all. Origen remarked, with his usual sagacity, that \"he who believes the Scripture to have proceeded from him who is the Author of Nature, may well expect to find the same sort of difficulties in it as are found in the constitution of nature:\" and this obviously suggests the reflection, that he, who denies the Bible to have come from God on account of these difficulties, may, for exactly the same reason, deny that the world was formed by him.\nFurther books by Gregory include:\nElements of Plane and Spherical Trigonometry\n(1816)\n,\nMathematics for Practical Men\n(1825)\n,\nMemoirs of ... John Mason Good, M.D.\n(1828)\n,\nMemoir of the Rev. Robert Hall\n(1832)\n,\nAids and Incentives to the Acquisition of Knowledge\n(1838)\n, and\nHints to the Teachers of Mathematics\n(1840)\n. The\n1838\nwork is Gregory's Farewell Address on retiring as Professor of Mathematics, delivered on\n7\nJune of that year. In it he addressed the first year students of the Royal Military Academy:-\nThe genuine object of all sound education is the development of the intellectual, the moral, and the bodily faculties of man; or, as it has been sometimes more tersely expressed, the improvement and application of head, heart, and limb. The system of education in the institution in which you have the honour to receive instruction, embraces all this. The blame will be your own, and it will through life be the subject of regret, if any of you quit this Academy without having acquired the manners of a gentleman, the principles of a man of honour and high and pure morality, the ornamental facilities of an artist, and a competent store of literary and philosophical knowledge.\nWe should not come away with the impression that all of Gregory's contributions came from his books. He also conducted important experiments. For example he carried out experiments with a pendulum in Shetland and also made astronomical observations there, reporting on these experiments in an article in the\nPhilosophical Magazine\nin\n1818\n. In\n1823\nhe carried out experiments at Woolwich to determine the velocity of sound using mortars, guns and muskets which were fired at various distances from observers. He came up with the result of\n1100\nfeet per second which is a good result\n(\nthe speed of sound in dry air at\n20\n° C is\n1125\nfeet per second\n)\n.\nGregory received many honours for his achievements. In the\n1826\nedition of his\nMechanics\ntext he lists himself as: Corresponding Associate of the Academy of Dijon; Honorary Member of the Literary and Philosophical Society of New York; Honorary Member of the New York Historical Society; Honorary Member of the Literary and Philosophical Society of Newcastle-upon-Tyne; Honorary Member of the Antiquarian Society of Newcastle-upon-Tyne; Honorary Member of the Cambridge Philosophical Society; Honorary Member of the Institution of Civil Engineers; etc. The 'etc.' here includes honorary memberships of societies in Bristol and Paris. He was awarded an honorary M.A. by the University of Aberdeen in\n1806\nand an honorary LL.D. two years later. He was elected president of the Woolwich Institution for the Advancement of Literary, Scientific and Technical Knowledge from its foundation in\n1838\n. Gregory, together with his friend Alexander John Scott, had been the founders of the Institution.\nIn\n[\n6\n]\nGregory's character is recorded as follows:-\n... all he did and said was dictated by benevolence of feeling, and he was  man of unbounded charity. As a Christian, he was moral and devout, and as a scholar he merited and obtained consideration of the first mathematicians of the day; his great zeal in his vocation, his parental kindness, his earnest and impressive admonitions, his entertaining, improving, and philosophical conversation, and his ever readiness to assist, will be gratefully remembered by many. He took a warm interest in the cultivation of mathematics, to which he may be said to have devoted, with indefatigable perseverance, nearly the whole of his valuable life."
}