{
  "nome_completo": "Olive Clio Hazlett",
  "nome_curto": "Olive Clio Hazlett",
  "ano_nascimento": "1890",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hazlett/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "Keene, New Hampshire, USA",
  "biografia": "Olive Clio Hazlett\nwas the only child of the postal clerk Robert Hazlett\n(1862\n-\n1905)\nand his wife Olive Leonora Binkley\n(1866\n-\n1954)\n, the daughter of a carriage maker. Robert, who worked for the Railway Mail Service in Cincinnati, married Olive in Washington, Ohio, USA on\n15\nNovember\n1888\n. Olive studied at the Laura Memorial Woman's Medical College in Cincinnati and, after being licensed to practice medicine in\n1898\n, she became a doctor at the Reformatory Prison for Women in Sherborn Town, near Boston, in\n1899\n. Her daughter Olive Clio, then eight years old, went with her mother to the Reformatory Prison for Women. On the Census taken on\n1\nJune\n1900\n, Olive Clio Hazlett is living at the Reformatory Prison for Women in Sherborn Town, as a boarder in the house of the watchman George L Works, his wife Eliza A Works and his fourteen year old daughter Emma S Works. A few days later, on\n12\nJune\n1900\n, the Census shows nine year old Olive C Hazlett in Zanesville City, Muskingum County, Ohio living with her paternal grandparents, William R and Rebecca D Hazlett, her parents Robert and Olive Hazlett, and Robert's elder sister Lucy R Hazlett.\nOlive Clio attended various schools, for example the Malden High School in Malden, Middlesex, Massachusetts, United States where she studied in session\n1904\n-\n05\n. Her father died before the end of the\n1905\nschool session and, in September\n1905\n, Olive and her mother spent a year in Europe, spending time in France and England. They returned sailing from Liverpool to Boston on the\nSaxonia\ndeparting\n7\nAugust\n1906\nand arriving on\n16\nAugust\n1906\n. She then attended the Dorchester High School in Boston from\n1906\nto\n1909\n. In the\n1910\ncensus, Olive and her mother were living at\n306\nTalbot Avenue, Boston.\nAfter graduating from the Dorchester High School, Olive Clio Hazlett entered Radcliffe College in\n1909\n. This College, which existed from the\n1870\ns as somewhere women could obtain informal education by Faculty members from Harvard University, was given the right to award degrees in\n1894\nafter moves to admit women directly to Harvard failed. Hazlett graduated from Radcliffe College in\n1912\nand then went to the University of Chicago to undertake research in algebra. She writes that there she undertook\n[\n6\n]\n:-\n... graduate training in the Department of Mathematics and Astronomy of the University of Chicago\n(\nchiefly under Professors\nE H Moore\nand\nL E Dickson\n, writing my theses under the latter\n)\n...\nShe was awarded a graduate scholarship and graduated with a Master's Degree in\n1913\nhaving submitted the dissertation\nInvariants which characterize linear associative algebras of a small number of units\n. She then studied for her Ph.D., holding a Fellowship of the Boston Branch of the Collegiate Alumnae and was awarded the degree in\n1915\nfor a thesis entitled\nOn the Classification and Invariantive Characterization of Nilpotent Algebras.\nFollowing the award of the doctorate Hazlett was awarded an Alice Freeman Palmer memorial scholarship of Wellesley College which enabled her to undertake postdoctoral study at Harvard during\n1915\n-\n1916\n[\n15\n]\n:-\nThe holder of the Alice Freeman Palmer Fellowship for the year\n1915\n-\n16\nwas Miss Olive Clio Hazlett, B.A. Radcliffe College\n1912\n, S.M. University of Chicago\n1913\n, Ph.D. University of Chicago\n1915\n. Miss Hazlett was unable to pursue research work in France and Germany, and spent the year in Cambridge, Massachusetts, attending certain Harvard University lectures, but chiefly in research work along the lines of her doctor's thesis, 'Classification and Invariantive Characterization of Nilpotent Algebras'. At the December meeting of the\nAmerican Mathematical Society\n, Dr Hazlett presented a paper on this subject and a second one at the September Colloquium of the Society. The fellowship was awarded to Dr Hazlett for a second year, with the expectation that an important advance would be made in the subject where she had already obtained interesting and satisfactory results, but at the same time as the award of the fellowship, an appointment at Bryn Mawr College was offered to Miss Hazlett which she felt constrained to accept.\nHer first appointment, therefore, was at Bryn Mawr in\n1916\nwhere\nCharlotte Scott\n, the first Head of Mathematics, was still in that role. The College was headed by Martha Carey Thomas who by this time had built it into a college with a very high quality of education for women.\nAfter two years at Bryn Mawr, Hazlett was appointed as Assistant Professor at Mount Holyoke. In\n1924\nMount Holyoke promoted her to Associate Professor, but Hazlett was dedicated to research in algebra and she was unhappy with the many classes she had to teach leaving her little time for research. She did, nevertheless, have an impressive publication record in her first five years at Mount Holyoke publishing six papers between\n1918\nand\n1922\n[\n4\n]\n:-\nHazlett's years at Mount Holyoke were some of her most productive research years and included the start of her long tenure as an associate editor of the 'Transactions' of the\nAmerican Mathematical Society\n.\nIn\n1924\nshe wrote an\n8\n-page review of the two books\nAlgebras and their Arithmetics\nby\nLeonard Eugene Dickson\nand\nCorpi Numerici e Algèbre\nⓉ\n(\nNumber theory and algebra\n)\nby\nGaetano Scorza\n. The review begins:-\nOn first picking up Professor\nDickson\n's book, the reader's attention is caught by the fact that the author assumes no knowledge beyond the most elementary parts of a first course in the theory of equations. As the reviewer turned from one page to another, there was a certain ease and simplicity in the style which called to mind some of those science primers of the days of our grandfathers. One felt once more the half-forgotten glamor of the rainy day long ago when one discovered several of these \"primers\", during one's secret investigation of a pompous old book-case on the landing of the stair.\nShe was also on a committee of the American Association of University Professors consisting of Harold H Bender\n(\nChairman\n)\n, Anna A Cutler, Olive C Hazlett and Robert K Root which produced the\n109\n-page report\nThe Selection, Retention, and Promotion of Undergraduates\n(1926)\n.\nThe facilities at Mount Holyoke, such as the library, were not really what an ambitious researcher required so Hazlett decided to move on. She applied for a post at the University of Illinois and already she had a high research reputation being described by\nL E Dickson\nas\n[\n13\n]\n:-\n... one of the two most noted women in America in the field of mathematics.\nShe was offered a post at the University of Illinois and she knew that there she would have all the facilities she needed to concentrate on her algebra research. She accepted a reduction in rank from associate professor to assistant professor in taking the post at Illinois\n[\n4\n]\n:-\nWhile at Illinois she served a three-year term on the council of the\nAmerican Mathematical Society\n1926\n-\n28\n, and in\n1927\nshe became the second woman \"starred\" for mathematics in 'American Men of Science'; the first was\nCharlotte Scott\n.\nShe wrote in\n[\n6\n]\nthat after her doctoral training:-\n... it was inevitable that I should continue research in algebra: linear algebras, nilpotent algebras, matrices, quaternions, division algebras; modular invariants and covariants in a\nGalois\nField,\nG\nF\n(\np\nn\n)\nGF(p^{n})\nG\nF\n(\np\nn\n)\n, of order\np\nn\np^{n}\np\nn\n- both formal and otherwise; and ideals of a matrix algebra. The resulting papers were published in 'Bulletin' of the\nAmerican Mathematical Society\n, Transactions of the\nAmerican Mathematical Society\n, Annals of Mathematics, Journal of Mathematics, and Journal de Mathématiques Pures et Appliquées as well as in Proceedings of the International Mathematical Congress\n(\nToronto,\n1924)\nand Atti del Congresso Internazionale dei Matematici\n(\nBologna,\n1928)\n.\nFor details of Hazlett's papers, see\nTHIS LINK\n.\nThe International Congress of Mathematicians in Bologna which Hazlett mentions at the end of the above quote was one to which she presented the paper\nIntegers as Matrices\n. She was able to attend the Congress while holding a Guggenheim Fellowship which enabled her not only to visit Italy, but also to visit Göttingen in Germany and Zürich in Switzerland during\n1928\nand\n1929\n. Back at the University of Illinois in\n1930\n, she was promoted to Associate Professor. However, she found the teaching workload high and she felt that Illinois never quite gave her the research opportunities that she felt she had been promised when she was first appointed. She did not publish any further papers on algebra after\n1930\nbut she was active in other ways, both before and after that time\n[\n6\n]\n:-\nI did refereeing of research papers in above lines of algebra offered for publication to 'Transactions' of the\nAmerican Mathematical Society\n, Annals of Mathematics, and\n(\nI think\n)\nJournal of Mathematics. For some years, I was an Associate Editor of the 'Transactions' of the\nAmerican Mathematical Society\n, a research journal. Also, I wrote the article on 'Quaternions' for the Encyclopaedia Britannica\n(14\nth edition\n)\n. - Around\n1930\n, the International Association of University Women formed a committee to award fellowships and I was made the judge of any mathematical manuscript submitted to it.\nIn\n1934\n-\n35\none of the students taking her algebra class was\nPaul Halmos\n. He writes\n[\n5\n]\n:-\nAlgebra was taught by Olive Hazlett who was, by our lights, a famous and important mathematician: she published papers and she taught advanced courses... Hazlett's course was based mainly on the first volume of\nvan der Waerden\n, with, of course, some deletions and additions. She enjoyed telling us about one of her papers whose title she gave as \"Embedding a ring in a field,\" and she enjoyed telling us how her colleague Shaw teased her about it - it evoked a picture of nefarious agricultural activities, he said.\nThe difficulties were about to take their toll, however. Rossiter writes in\n[\n13\n]\n:-\nIsolated and moderately successful but with aspirations of full equality,\n[\nshe\n]\ndenied the potential psychological dangers in\n[\nher\n]\nposition.\nShe wrote to the Chairman of the Mathematics Department in\n1935\ncomplaining about the large service courses she was required to teach. By December\n1936\nshe was forced to take sick leave which was supposed to end in August\n1937\nso that she could take up teaching again for the academic year\n1937\n-\n38\n. During\n1936\n-\n37\nshe spent several months in Rogers Memorial Sanatorium in Oconomowoc, Wisconsin before spending the remainder of the year in Chicago. However her health was not good enough to allow her to return to work and she was forced to take another year off on sick leave\n[\n4\n]\n:-\n... which Hazlett spent mainly in Colorado, first in Denver and then in Estes Park. Also in\n1937\nHazlett described her interests as \"rock climbing especially above the timberline and when the technique is pressure climbing; landscape photography, especially working across the light or into the light; Oriental rugs and other.\"\nIn September\n1938\nshe returned to work in Illinois. We have a description of Hazlett teaching a second semester course on algebra in\n1940\n-\n41\nby one of the students taking the class who writes that she was\n[\n1\n]\n:-\n... tall, thin, her long grey hair done up in a bun, wisps of hair always hanging down in her face. She seemed so different that we in her class were rather frightened of her.\nWorld War II led to a second phase in Hazlett's research. She describes that as follows\n[\n6\n]\n:-\n... in\n1940\ncame the second World War and I found myself caught up in its tentacles. The\nAmerican Mathematical Society\nappointed a Cryptanalysis Committee with\n(\nas I recall\n)\nfive members of whom Professor\nA A Albert\nof the University of Chicago was chairman and Commander H T Engstrom the military\n(\nand hence the most important\n)\nmember. Later, they apparently added some members and I was one of them. Accordingly, I had entrusted to me several classified military documents of the U.S. Signal Corps.\nHer description of the lengths she had to go to in order to keep her work secret makes interesting reading\n[\n6\n]\n:-\nThis meant that I had to exercise great caution as to\n[\nthe documents\n]\nsafety. Naturally, as a naive self-protection, I told the head of my department about the work and the documents, showing him the letter from Commander Engstrom. Otherwise, I did not mention documents or work to a soul except to an officer of the U.S.S.C. or to the F.B.I. when need arose.\n[\nIn a subsequent letter Hazlett corrected this by giving the names of one or two others she had confided in, including\nE H Moore\n.\n]\nI never had them in my office at the University and I used them only in my apartment which I shared only with a loyal dog. If the door-bell rang when I was working with them, I quickly scuttled them out of sight and reach, replacing them with innocent stuff\n(\nresearch in progress\n)\nin algebra that was waiting. At my summer place, I had installed a Diebold Treasure Chest with triple-combination lock and then changed combinations single-handed.\nIt so happened that one of my ideas was, apparently, the bit that was featured by Commander Enstrom when he gave\n[\nthe preliminary report of the Cryptanalysis Committee\n]\nto the\nAmerican Mathematical Society\nat the Museum of Science and Industry in Chicago in the spring\n1943\nor\n1944\n. - Later, they suggested that I go to D.C. to make certain contacts and I so did on my way back to my job in early fall of\n1944\n. Of all my various reports, I kept a carbon copy, sent original \"registered, return receipt requested\" and then burned my copy in a galvanised iron pail, pouring ashes down toilet.\nA court order committed Hazlett to the Neuropsychiatric Institute of the University of Illinois in Chicago in November\n1944\n. She was released but the Champaign County Court committed Hazlett to Kankakee State Hospital in Kankakee, Illinois in March\n1945\n. Up to this time she had been on temporary disability leave but this was made permanent in May\n1945\n. This continued until she retired in\n1959\nwhen she was made professor emeritus.\nShe had been released from the state hospital in\n1953\n, however, when she petitioned for her release and it was granted. She spent the next\n20\nyears in her home, 'Timeless Cabin', in Peterborough, New Hampshire. She was befriended by brothers from the Carmelite community during these years. Hazlett was fascinated by puzzles and the brothers from the Carmelite community, having been given many of her puzzles before her death, donated them to the Smithsonian and they were displayed in\n1984\n. Fascinating pictures and descriptions of these puzzles are given at\n[\n11\n]\n.\nHer final few months were spent in a nursing home in Keene, New Hampshire. After dying in the nursing home, she was buried in Saint Peters Cemetery, Peterborough, Hillsborough County, New Hampshire. Her grave is marked by a small irregular stone simply inscribed \"OLIVE C HAZLETT\n1890\n-\n1974\n.\"\nLet us end with quoting Della Dumbaugh Fenster's overview of Hazlett's contributions, particularly the way she interacted with her advisor\nLeonard Dickson\nand the other professors who taught her\n[\n2\n]\n:-\nOlive Hazlett, a\n1915\nDickson\ndoctorate, followed her adviser's lead and studied nilpotent algebras, division algebras, and modular invariants before she apparently followed\nDickson\ndown the road to the arithmetic of algebras. At the\n1924\nInternational Congress of Mathematicians in Toronto, she extended his arithmetic of rational algebras to algebras over an arbitrary field. Hazlett could not claim the exclusive rights for these ideas, however, since\nDickson\npresented the same generalisation at the same meeting.\n(\nThis, perhaps, represented a bitter sweet moment for\nDickson\n(\nand Hazlett, for that matter\n)\n, bitter in that he was not the only one presenting a more general theory but sweet in that he had trained his student well.\n)\nLike\nDickson\n, Hazlett certainly placed a high value on research mathematics. She wrote more papers than any other pre-\n1940\nAmerican woman mathematician and, reflective of her adviser's commitment to the broader mathematical community, she served as a cooperating editor of the 'Transactions' of the\nAmerican Mathematical Society\nfor\n12\nyears, held a two-year term on the\nAmerican Mathematical Society\nCouncil, and she,\nCharlotte Scott\n, and\nAnna Johnson Pell Wheeler\ncomposed the entire group of women mathematicians starred in 'American Men of Science' between\n1903\nand\n1943\n. As for her relationship with\nDickson\n, it can be characterised as one of mutual respect. In particular, although she continued to draw from his work, Hazlett apparently neither tended to consult\nDickson\ndirectly about her employment dilemmas nor to keep him informed of her research. In short, for Hazlett,\nDickson\nserved as a role model rather than a mentor.\nInterestingly, Hazlett consulted\nE H Moore\nand\nHerbert Slaught\n(\nand not\nDickson\n)\nabout professional decisions. In\n1918\n, Hazlett wrote\nMoore\nconcerning her dismissal from Bryn Mawr and\nSlaught\nregarding her subsequent job offer from Mount Holyoke. She wrote\nMoore\nagain in\n1925\nas she considered a position at the University of Illinois\n(\nwhich she ultimately accepted\n)\n. As an aside, Hazlett's\n1925\nletter to\nMoore\ncandidly depicts the dilemmas faced by women attempting to do research mathematics at institutions without adequate libraries or sabbatical opportunities. See Olive Hazlett to\nE H Moore\n, January\n29\n,\n1918\n; Olive C Hazlett to\nHerbert S Slaught\n, February\n25\n,\n1918\n; and Olive Hazlett to\nE H Moore\n, March\n11\n,\n1925\n."
}