{
  "nome_completo": "Oronce Fine",
  "nome_curto": "Oronce Fine",
  "ano_nascimento": "1494",
  "ano_morte": "1555",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fine/",
  "lugar_nascimento": "Briançon, France",
  "lugar_morte": "Paris, France",
  "biografia": "Oronce Fine\nwas born in the Dauphiné, a region in southeastern France. At the time of his birth this was a semi-independent region of France, so called since it was ruled by the eldest son of the King of France who was given the title of dauphin. Briançon, the town of Fine's birth, was in the Dauphiné so Fine wrote under the Latin name\nOrontius Finaeus Delphinatus,\nthe last of these names indicating that he came from the Dauphiné. We are certain of the Latin form of Fine's name since this name is on his written works, but we are less certain of the French form of his name \"Fine\". Two other forms are possible, Finee or Finé but experts on the Dauphiné are clear that Fine is the form that one would expect in that region and so we have opted for this version.\nFine's father was François Fine who was a medical doctor, educated at the University of Paris, and practicing in Briançon at the time that his son was born. François Fine was certainly at the University of Paris in\n1472\n-\n73\nsince copies of lecture notes of a course on\nAristotle\nmade by him in that year still survive. Fine's grandfather, Michel Fine, had also been a medical doctor and wrote a text on the plague which in fact Oronce Fine, the subject of this biography, later published. Oronce Fine was brought up in Briançon until his father died after which he was sent to Paris where he was cared for by Antoine Silvestre. At the time Silvestre was a regent at the quasi-monastic Collège de Montaigu, where John Calvin studied few years later in\n1523\n, and Silvestre later held the same position at the Collège de Navarre. Fine was educated at the University of Paris obtaining a medical degree from the Collège de Navarre in\n1522\n. He spent a while in prison in\n1518\nbefore completing his degree and again in\n1524\nhe spent some time in prison. Whether he worked on a sundial while in prison is uncertain but he certainly constructed an ivory sundial in\n1524\nwhich still exists. Despite his fascination with the theory of instruments, this may well be the only one he actually constructed.\nBefore being awarded his medical degree, Fine had edited mathematics and astronomy books for a Paris printer. Among the texts which he edited were\nPeurbach\n's\nTheoricae Novae Planetarum\n, which presented\nPtolemy\n's epicycle theory of the planets, and\nSacrobosco\n's\nTractatus de Sphaera\n, a book on astronomy in four chapters. The first book which Fine authored himself was published in\n1526\nand it was on the equatorium, an instrument which Fine was very interested in and which he worked on throughout his life, writing four further texts about it. The instrument can be used to determine the positions of the planets. Fine was appointed to the chair of mathematics at the Collège Royal in Paris in\n1531\nand he taught there from this time until his death. The Collège Royal had been founded in\n1530\nby Françios I\n(\nFrancis I\n)\n, a patron of the arts and scholarship, who was King of France from\n1521\nto\n1544\n. Also known as the Collegium Trilinguae\n(\nCollege of Three Languages\n)\n, it still exists today as the Collège de France.\nThe major work which Fine produced at almost exactly the time that he was appointed to the chair of mathematics at the Collège Royal was known as\nProtomathesis\n. It is a slightly strange work for it is in four parts with the parts having more than one volume. In some sense it looks more like a collection of separate works, for each part has a separate title page of its own with dates usually a year or two earlier than the whole work which appeared in\n1532\n. Despite it appearing that volumes of this work were published separately, it is unlikely that this was the case. The first part deals with arithmetic, particularly with whole numbers, common fractions and sexagesimal fractions. This latter topic was important for the later astronomy parts of the\nProtomathesis\n. The second part covers geometry and is in two volumes. It begins with setting geometry up in a similar axiomatic way to\nEuclid\n's\nElements\n, but then it goes on to more practical considerations of measuring length, height, surface area, and volumes. In this part Fine uses\n22\n7\n\\large\\frac{22}{7}\\normalsize\n7\n2\n2\n​\nfor π in calculating with circles. The second of the geometry volumes covers topics in trigonometry but only at an elementary level.\nThe third and fourth parts of the\nProtomathesis\nare on astronomy and astronomical instruments. The third part is an elementary introduction to astronomy and is clearly intended as a fairly low level teaching text rather than a research monograph. Many sundials and quadrants are described in the final volume of the fourth part.\nAs we have noted, Fine gave the value of π to be\n22\n7\n\\large\\frac{22}{7}\\normalsize\n7\n2\n2\n​\nin the geometry part of the\nProtomathesis\n(\nwhich is dated\n1530)\n. However he claimed that\n(\n22\n2\n9\n)\n/\n7\n(22\\large\\frac{2}{9}\\normalsize )/7\n(\n2\n2\n9\n2\n​\n)\n/\n7\nwas a better approximation in a work which appeared in\n1544\n. Later he gave\n47\n15\n\\large\\frac{47}{15}\\normalsize\n1\n5\n4\n7\n​\nand, in\nDe rebus mathematicis\n(\npublished posthumously in\n1556)\n, he gave\n3\n11\n78\n3\\large\\frac{11}{78}\\normalsize\n3\n7\n8\n1\n1\n​\n. Now, computing approximate values, we have\nπ = 3.141592654,\n22/7 = 3.142857143,\n(22 + 2/9)/7 = 3.174603175,\n47/15 = 3.133333333,\n3 + 11/78 = 3.141025641\nWe see, therefore, that Fine's values of\n1\n7\n(\n22\n2\n9\n)\n\\large\\frac{1}{7}\\normalsize (22\\large\\frac{2}{9}\\normalsize )\n7\n1\n​\n(\n2\n2\n9\n2\n​\n)\nand\n47\n15\n\\large\\frac{47}{15}\\normalsize\n1\n5\n4\n7\n​\nare both worse than\n22\n7\n\\large\\frac{22}{7}\\normalsize\n7\n2\n2\n​\n, but his final attempt of\n3\n11\n78\n3\\large\\frac{11}{78}\\normalsize\n3\n7\n8\n1\n1\n​\nis actually better. These attempts to find better approximations to π are muddled up with Fine's attempts to square the circle. He gave several, of course fallacious, proofs, and his contemporaries were quick to point out the errors he had made. As Poulle writes in\n[\n1\n]\n:-\nIt must be acknowledged that Fine's arrogance about his own accomplishments undoubtedly made his errors of logic all the more intolerable to his opponents.\nLike many mathematicians of his time Fine was an expert on fortifications and he worked on fortifications of Milan. His suggestion that eclipses of the moon could be used to determine the longitude of places was an important idea which was relevant to his other major contribution, namely cartography. Fine was born two years after the discovery of America and when he was three years old Vasco da Gama sailed round Africa to India. he lived through a time when maps were of the utmost importance to the European powers. It was natural therefore that Fine would be encouraged to use his mathematical skills in this task. In making maps, Fine had two distinct sources of information, one being the recently rediscovered maps of\nPtolemy\nand others from that period, the other being the newly reported discoveries from his own time. Fine invented a map projection and, around\n1519\n, he produced a map of the world using his heart-shaped projection. This was around the time that Magellan was sailing round the tip of South America. Fine also produced maps of France in\n1525\nand on another map of the world which he produced in\n1531\nwith a double heart-shaped projection the name \"Terra Australis\" appears for the first time. It is only in recent years, however, that this map has achieved a certain celebrity status as we now describe.\nCharles Hapgood was a teacher who, in\n1956\n, got his students to undertake a project studying ancient world maps. Hapgood was particularly excited by Fine's\n1531\nmap of the world and he began to develop rather amazing theories about the map. These theories were published in Hapgood's\nMaps of the Ancient Sea Kings\nin\n1965\n. What struck Hapgood when he examined Fine's world map was that there was a fairly accurate representation of Antarctica on the map. It was drawn in\n1531\nyet Antarctica was not discovered until\n1820\n. How was this possible? The fairly accurate representation of Antarctica, however, shows rivers and the Ross Sea which cannot be seen for the thick sheets of ice which cover the continent. Hapgood's theory that Fine was in possession of an ancient map, drawn at a time when Antarctica was not covered in sheets of ice, seems too ridiculous to discuss. However, we are still left with the problem of how Fine knew that Antarctica was there. The most likely is the following. It had long been believed that there had to be a balance between the land masses of the northern hemisphere and the southern hemisphere so some land mass in the south was necessary.\nLeonardo da Vinci\n, for example, produced a globe with a southern land below Africa more than twenty years before Fine drew his map. The northern coast of Australia had probably been visited by Europeans by this time and the northern coast of Fine's Antarctica is probably drawn from such representations. There may also have been reports which did indeed represent the sighting of Antarctica and Fine put the reports together to produce a half real, half guessed, map. Of course this explanation puts the fact that Fine's Antarctica looks quite close to the actual Antarctica down to just good luck.\nWhat evidence do we have for the above suggestion? On another map of about\n1513\n(\nalso investigated by Hapgood\n)\nthe following is written on land in this region:-\nIt is related by the Portuguese that on this spot, night and day are, at their shortest period, of two hours duration, and at longest phase, of twenty-two hours. But the day is very warm and in the night there is much dew.\nThe first sentence here suggests that Portuguese explorers had indeed reached Antarctic latitudes. The second sentence suggests a climate more like the north coast of Australia. Certainly this is evidence of Antarctica being confused with Australia and we suggest that Fine's\n1531\nmap suffers from a similar confusion.\nPoulle\n[\n1\n]\nsums up Fine's contributions as follows:-\nFine's scientific work may be briefly characterised as encyclopaedic, elementary, and unoriginal. It appears that the goal of his publications, which range in subject from astronomy to instrumental music, was to popularise the university science that he himself had been taught."
}