{
  "nome_completo": "Oscar Xaver Schlömilch",
  "nome_curto": "Oscar Schlömilch",
  "ano_nascimento": "1823",
  "ano_morte": "1901",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schlomilch/",
  "lugar_nascimento": "Weimar, Germany",
  "lugar_morte": "Dresden, Germany",
  "biografia": "Oscar Schlömilch\n's first name is sometimes written as Oskar. He studied mathematics and physics in Jena, Berlin and Vienna. In Berlin he was taught by\nDirichlet\nwho had a strong influence on him. He was awarded his doctorate in\n1844\nfrom the Friedrich-Schiller-Universität Jena for his thesis\nTheorema taylorianum\nⓉ\n(\nTaylor's theorem\n)\n. In the following year he submitted his\nHabilitation\nthesis to the University of Jena and he was appointed as a\nPrivatdozent\n. By\n1847\nhe had been promoted to Extraordinary professor at the University of Jena where he continued to teach until\n1849\n, by that time being a full professor. He was appointed as Professor of Higher Mathematics at the Königlich Sächsischen polytechnischen Schule\n(\nRoyal Technical Education Institute\n)\nin Dresden in\n1849\n, filling the chair previously held by Traugott Franke who had left to take up a professorship at the Polytechnische Schule in Hannover. By\n1851\nSchlömilch was the Professor of Higher Mathematics and Analytic Mechanics at Dresden where he continued to teach until\n1874\n. By\n1853\nhe had been elected a member of the Royal Academy of Sciences of Leipzig. In\n1874\nSchlömilch was appointed to the Dresden Ministry of Culture as minister responsible for education in schools in Saxony. He held this position until he retired in\n1885\n, making a number of significant changes to mathematical teaching in Saxony.\nThere are several important aspects of Schlömilch's contributions which we shall examine. There are his excellent contributions to mathematical research, his fame as a writer of textbooks, and his founding of the journal\nZeitschrift für Mathematik und Physik\nwhich he edited for many years. First let us list a few highlights of his research contributions. In\n1847\nhe gave a general remainder formula for the remainder in\nTaylor\nseries. He discovered an important series expansion of an arbitrary function in terms of\nBessel functions\nin\n1857\n. It is interesting to note that this\n1857\npaper,\nÜber die Bessel'sche Function\nⓉ\n(\nOn the Bessel function\n)\n, was the first to treat\nBessel functions\nof the first kind with integer indices as the object of a special mathematical theory independent of applied mathematics problems. He also made major contributions to the theory of the convergence of continued fractions.\nHe began publishing books early in his career with textbooks such as\nHandbuch der mathematischen Analysis\nⓉ\n(\nHandbook of mathematical analysis\n)\n(1845)\n,\nHandbuch der Differential- und Integralrechnung\nⓉ\n(\nHandbook of differential and integral Calculus\n)\n(1846\n-\n48)\n,\nTheorie der Differenzen und Summen Ein Lehrbuch\nⓉ\n(\nTheory of differences and sums: A textbook\n)\n(1848)\n,\nAnalytische Studien Theorie der Gammafunktionen\nⓉ\n(\nAnalytical studies in the theory of gamma functions\n)\n(1848)\n,\nDie allgemeine Umkehrung gegebener Funktionen\nⓉ\n(\nThe general inversion of given functions\n)\n(1849)\n, and\nGrundzüge einer wissenschaftlichen Geometrie des Masses\nⓉ\n(\nOutline of a scientific geometry of mass\n)\n(1849)\n. His textbooks presented\nCauchy\n's techniques in analysis and through them these important methods became well known in Germany. After moving to Dresden in\n1849\n, amazingly his output of textbooks became even greater with books such as\nMathematische Abhandlungen\nⓉ\n(\nMathematical treatises\n)\n(1850)\n,\nDie Reihenentwickelungen der Differenzial- und Integralrechnung\nⓉ\n(\nThe series expansions of calculus\n)\n(1851)\n,\nHandbuch der algebraischen Analysis\nⓉ\n(\nHandbook of algebraic analysis\n)\n(1851)\n,\nDer Attractionscalcül\nⓉ\n(\nThe calculus of attraction\n)\n(1851)\n, and the two volumes of\nCompendium der höheren Analysis\nⓉ\n(\nCompendium of higher analysis\n)\n(1853)\n. It would not be useful to give details of the many editions these books went through but, as an example, let us note that the first volume of\nGeometrie des Masses\nⓉ\n(\nGeometry of masses\n)\n, published in\n1849\n, had reached its seventh edition by\n1888\n. Also the first volume of\nCompendium der höheren Analysis\nⓉ\n(\nCompendium of higher analysis\n)\n, published in\n1853\n, had reached its fifth edition by\n1881\n.\nIt was around\n1853\nthat Schlömilch began to correspond with the published B G Teubner. It was through the collaboration with Schlömilch that Teubner went on to become one of the leading publishers of mathematics books and well as Schlömilch's journal\nZeitschrift für Mathematik und Physik\n. Earlier Schlömilch had given much support to Johann August Grunert and his journal\nArchiv der Mathematik und Physik\n. The story of how the breakdown of his relationship with Grunert led to Schlömilch founding his own journal is told by Peter Schreiber in\n[\n4\n]\n:-\nExcept in a few cases, the many famous mathematicians of the nineteenth century did not publish in Grunert's Archiv. ... One of the few contributors of the journal who has remained well known today, was Oscar Xaver Schlömilch. In the first twenty volumes of Grunert's Archiv he published\n83\nnotes and\n16\nproblems, thus becoming one of the most industrious of Grunert's cooperators. At this time there must have been a good personal relationship between Grunert and Schlömilch. For example, Grunert arranged for the printing of Schlömilch's book, 'Handbuch der Differential- und Integralrechnung'\n(1846\n-\n48)\n, at C A Koch in Greifswald. Then an unpleasant dispute between Schlömilch and F W Barfuss, the director of an insurance company in Weimar, arose, which ran through several volumes of the Archiv. In a militant manner, Barfuss defended an obsolete point of view on the question of symbolic calculation with divergent series against Schlömilch. Possibly Schlömilch became vexed because Grunert repeatedly gave Barfuss the opportunity of printing nonsensical answers in the Archiv. Possibly Schlömilch changed his opinion about Grunert's\n(\nsometimes old-fashioned\n)\nstyle of mathematics and indeed about his scientific ability. In all events, in\n1856\nSchlömilch founded his own journal, the Zeitschrift für Mathematik und Physik, which was very similar to Grunert's Archiv with regard to readership and contents. In general, thereafter, the better known and more gifted authors preferred to publish in Schlömilch's journal.\nSchlömilch wrote to Teubner in\n1854\nexplaining why a new journal was necessary. He explained that:-\nCrelle\n's 'Journal für Mathematik' is totally unsuitable for a large group of teachers. The same is true for Poggendorff's 'Annalen der Physik und Chemie'. It only has a large readership because it is the only physics journal ... Thirdly the fact that Grunert's 'Archiv der Mathematik und Physik' is still a respected journal only goes to show the pressing need for a new journal.\nTeubner accepted the proposal immediately and the first volume appeared in\n1856\n. Sometimes in its early years the\nZeitschrift für Mathematik und Physik\nwas called 'Schlömilch's Zeitschrift'. In\n1857\n, in the second volume of his journal, Schlömilch published a harsh, damaging review of Grunert's\nAnalytische Geometrie der Ebene und der Raumes für polare Koordinaten\nⓉ\n(\nAnalytical geometry of the plane and the space for polar coordinates\n)\n. In it Schlömilch was highly critical of Grunert's old-fashioned style and his criticisms have a personal rather cruel tone. From\n1856\nto\n1859\n, Schlömilch was assisted in editing his journal by Benjamin Witzschel, then in\n1859\nMoritz Cantor\nreplaced Witzschel as an editor. In the following year E Kahl joined the team and, until Schlömilch retired as an editor in\n1896\n, these three jointly edited the journal. We should note that after\nMoritz Cantor\njoined the editorial team, articles on the history of mathematics began to appear in the journal. From\n1875\nHistorisch-literarische Abteilungen der Zeitschrift für Mathematik und Physik\nⓉ\n(\nHistorical-literary sections of the Journal of Mathematics and Physics\n)\nappeared as a supplement to\nZeitschrift für Mathematik und Physik\n.\nSchlömilch's first highly successful publication with B G Teubner was a joint work\nLehrbuch der analytischen Geometrie\nⓉ\n(\nTextbook of analytical geometry\n)\nwritten with O Fort and published in\n1855\n. A review in\nThe Mathematical Gazette\nexplains that:-\n... rather more attention than usual is paid to questions that are capable of graphical interpretation or application. ... Conics are treated at first individually and in detail so as to bring out particular geometrical properties; then, starting with the equation of the second degree, they are discussed and reduced to their simplest forms and incidentally, as it were, we are introduced to the general properties of the curves of the second and higher orders. The proofs are well arranged and simply put.\nOther highly successful works included the two-volume text\nCompendium der höheren Analysis\nⓉ\n(\nCompendium of higher analysis\n)\n(1862)\nand the two-volume text\nÜbungsbuch zum Studium der höheren Analysis\nⓉ\n(\nExercise book for the study of higher analysis\n)\n(1867\n,\n1868)\n. In\n1879\nhe published the first of two volumes of\nHandbuch der mathematik\nⓉ\n(\nHandbook of mathematics\n)\n, the second volume appearing in\n1881\n. A second edition of this text appeared in three volumes in\n1904\n. After Schlömilch left his professorship at the Technical University of Dresden in\n1874\nto take up an appointment as minister responsible for education in schools in Saxony, he continued to hold his position as an editor of\nZeitschrift für Mathematik und Physik\n. He also continued to write new textbooks and to bring out new editions of his many highly respected works.\nAmong the honours he received, we mentioned above his election to the Royal Academy of Sciences of Leipzig but we should also mention his election to the\nRoyal Swedish Academy of Sciences\n(\nKungl. Vetenskapsakademin\n)\nin\n1862\n."
}