{
  "nome_completo": "Oskar Johann Viktor Anderson",
  "nome_curto": "Oskar Anderson",
  "ano_nascimento": "1887",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anderson/",
  "lugar_nascimento": "Minsk, Russian Empire (now Belarus)",
  "lugar_morte": "Munich, Germany",
  "biografia": "Oskar Anderson\nis sometimes said to be Russian, sometimes German. His name appears both as Oskar Nikolaevich Anderson and Oskar Johann Viktor Anderson. The reason for the confusion is that he was born in Minsk\n(\nin what is now Belarus\n)\nand moved to Kazan, which is in western Russia on the edge of Siberia in the\n1890\n's, but he was born into a family which was ethnically German. His father Nikolas Anderson was professor of Finno-Ugric languages at the University of Kazan.\nOskar attended Kazan\nGymnasium\n(\nthe same school\nLobachevsky\nattended a century before\n)\nand graduated with the gold medal in\n1906\n. Anderson spent one year studying mathematics at the University of Kazan before going to St Petersburg where he studied economics at the Polytechnic Institute. From\n1907\nto\n1915\nhe was A A Chuprov's assistant and his dissertation was on variance-difference methods for analysing time series. It developed the ideas of his supervisor Chuprov on correlation and was published in\nBiometrika\nin\n1914\n. See\n[\n3\n]\nfor details of Chuprov and his work with Anderson.\nWhile studying at the Polytechnic Institute of St Petersburg, and acting as assistant to Chuprov, he took on further duties in\n1912\nwhen he began lecturing at a commercial school in St Petersburg. As well as teaching at this school, Anderson graduated with a law degree. Johnson and Kotz write in\n[\n5\n]\n:-\nAmong his other activities at this time, he organised and participated in an expedition in\n1915\nto Turkestan to carry out an agricultural survey in the area around the Syr Darya river. This survey was on a large scale, and possessed a representativity ahead of contemporary surveys in Europe and the USA.\nIn\n1917\nAnderson left St Petersburg and moved to Kiev. There he held two posts, one in the Commercial Institute where he first studied statistics and then taught, the other in the Demographic Institute of the Kiev Academy of Sciences.\nSlutsky\nwas teaching in the Kiev Institute of Commerce when Anderson arrived and they would remain colleagues for three years. Events in\n1920\nwere to have a profound influence on Anderson's life.\nThe Russian civil war began in\n1918\nafter the end of World War I. There were three sides, the Red Army led by Trotsky, the Whites Army who were anti-communists led by former imperial officers and the Greens who were anarchists opposed to the Reds and strongest in Ukraine. Lenin came to power but he did not favour moving quickly toward a socialist economy since the necessary economic skills were lacking. There were disputes over economic policy, some wishing to move quickly to a socialist economy. The policies which were put in place left the work force feeling cheated since they had expected to gain control of industry, and there were strikes and unrest in the country. Lenin approached Anderson and offered him a high position in the economic running of Russia. Anderson, like many Russians at this time, had political views which were leftist. However he was unhappy with the direction of the country and particularly unhappy about the way that some of his colleagues had been treated. He left Russia in\n1920\nwith his family; they were effectively refugees.\nWold writes in\n[\n10\n]\n:-\nThe course of outer events in Oskar Anderson's life reflects the turbulence and agonies of a Europe torn by wars and revolution.\nIndeed this turbulence was to have a dramatic effect on Anderson's life. He lost three children over the following period, first a daughter, then a little while later a son, and finally a second son died serving in World War II. But we have got ahead of the events that we were describing, so returning to the period after Anderson left Russia, he went to Budapest and in\n1921\nhe became a school teacher there. After a few years he moved to Bulgaria and from\n1924\nuntil\n1933\nhe was a professor at the Commercial Institute of Varna.\nIn\n1933\nAnderson was awarded a Rockefeller Scholarship which enabled him to travel to England and Germany. He held the scholarship until\n1935\nand during this time he wrote his first book, which was on mathematical statistics, which was published in Vienna in\n1935\n. In this book Anderson tried to present the latest statistical methods assuming only that his readers had covered school level mathematics.\nReturning to Bulgaria in\n1935\nAnderson was appointed professor at the University of Sofia. He had been involved in several important pieces of work for the Bulgarian government such as the use of sampling techniques in the\n1926\ncensus of population and manufacture, Bulgarian agricultural production in\n1931\n-\n32\n, and crop statistics in\n1936\n. He was sent to Germany in\n1940\nby the Bulgarian government to study rationing in war time, and in\n1942\nhe accepted a chair at the University of Kiel.\nTwo years after the end of World War II, at the age of sixty, Anderson accepted the chair of economics at the University of Munich. He remained in Munich for the rest of his life. Fels writes in\n[\n2\n]\n:-\nAt the time of his death, his authority in German statistical circles was unrivalled. It was mainly through his efforts that the statistical training for economists at German universities was improved ...\nTintner, in\n[\n9\n]\n, describes Anderson as \"perhaps the most widely known statistician in Central Europe\". He goes on to write that:-\n... through his origin in the flourishing Russian school of\nprobability\n, ... Anderson belongs to the so-called 'continental' school of statistics, and worked in the tradition of\nLexis\nand\nBortkiewicz\n. He might be the last representative of this approach ....\nHe applied mathematical statistics to economics, using nonparametric methods. An overview of his work is presented in\n[\n10\n]\n:-\nHis scientific work, always marked by personal involvement, is of sufficient stature to be of lasting interest... Some of Anderson's endeavours were ahead of his time... Thus his emphasis on casual analysis of non-experimental data is a reminder that this important sector of applied statistics is far less developed than descriptive statistics and experimental analysis.... The main strength of Anderson's scientific work lies, I think, in the systematic coordination of theory and application.\nIn\n[\n1\n]\nhis contribution is summed up as follows:-\nHe especially believed that statistics, based on the law of large numbers and the sorting out of random deviations, is the only substitute for experimentation, which is impossible in economics. Sensibly estimating the difficulties inherent in economics as a science, Anderson was opposed to the use of \"refined\" statistical methods and to accepting preconditions regarding laws of distribution. This led him to nonparametric methods and to the necessity of casual analysis in economics."
}