{
  "nome_completo": "Peter Guthrie Tait",
  "nome_curto": "P G Tait",
  "ano_nascimento": "1831",
  "ano_morte": "1901",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tait/",
  "lugar_nascimento": "Dalkeith, Midlothian, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "P G Tait\n's father was John Tait and his mother was Mary Ronaldson. John Tait was a secretary to Walter Francis Scott, the fifth duke of Buccleuch. Peter had two sisters and he began his schooling in the Grammar School in Dalkeith. However, when he was six years old his father died and Peter, with his two sisters and his mother, moved to Edinburgh to live with an uncle John Ronaldson. An Edinburgh banker, John Ronaldson was nevertheless interested in science, in particular in astronomy, geology and with the newly invented photography. He soon interested his young nephew Peter in these subjects and it is fair to say that Peter's interest in science was a direct consequence of his uncle's enthusiasm for the sciences.\nWhen the family moved to Edinburgh Peter, of course, had to leave his school in Dalkeith. He next attended a private school in Circus Place Edinburgh, then in\n1841\n, when he was ten years old, he entered Edinburgh Academy. Lewis Campbell, who later became the professor of Greek at the University of St Andrews, and\nJames Clerk Maxwell\nwere one year above Tait at the Academy. In fact\nMaxwell\nwas slightly younger than Tait so the difference of one year certainly did not reflect their respective ages.\nTait was top of his class in each one of his six years at Edinburgh Academy. His early interests, however, were not in science but rather in classics. By his fourth year at the Academy mathematics had become his real love and that was the subject in which he really excelled. In\n1846\nhe was placed first in the mathematics section of the Edinburgh Academical Club Prize which was no mean achievement given that he beat Lewis Campbell, who was placed second, and\nMaxwell\nwho was placed third. In\n1847\n, Tait's final year at Edinburgh Academy,\nMaxwell\nhad his revenge since he was placed first for the Edinburgh Academical Club Prize with Tait second.\nAt the age of\n16\n, in November\n1847\n, Tait entered the University of Edinburgh.\nMaxwell\nentered Edinburgh University at the same time at Tait and together they attended the second mathematics class taught by Kelland and the natural philosophy\n(\nphysics\n)\nclass taught by James David Forbes. Tait remained at Edinburgh University for only one year before entering Peterhouse, Cambridge in\n1848\n. There he was tutored by\nWilliam Hopkins\nthrough what was a remarkable undergraduate career. In January\n1852\n, at the age of twenty, he graduated as senior\nWrangler\nin the Mathematical Tripos. This means that he was placed first among the First Class degrees in mathematics awarded by Cambridge in that year. He was also the first Smith's prizeman.\nMaxwell\nfollowed Tait to Peterhouse in\n1850\nbut transferred to Trinity where he believed that it was easier to obtain a fellowship. Another fellow student and friend of Tait's was William Steele who was in the same year as Tait and graduated as Second Wrangler. Tait won a Fellowship at Peterhouse and, in addition to coaching undergraduates for the Tripos, he began to collaborate with Steele in writing a text\nDynamics of a particle\n. Tragically Steele died before much progress had been made with writing the book but Tait continued with the project and generously published the book under their joint authorship despite having written most of it himself. It was published in\n1856\n.\nIn September\n1854\nTait took up an appointment as professor of mathematics at Queen's College, Belfast. A number of the colleagues and friends he made in Belfast were to have a very significant effect on Tait's career. One of these was Thomas Andrews and the two collaborated in experiments to determine the density of ozone and also the affects of passing electrical discharge through oxygen and other gases. Tait had not been involved in experimental work up to this time and it is certainly due to the influence of Andrews that he added this interest to his growing range of skills. This research carried out with Andrews took Tait towards chemistry and this was a subject he retained an interest in through his career.\nAnother friendship of real significance was that with\nHamilton\n. Tait had read\nHamilton\n's\nLectures on\nquaternions\nin\n1853\nwhile he was still at Cambridge but although the topic fascinated him he was more taken up with physical applications of mathematics at the time and did not pursue the topic at that stage. Then in July\n1858\nTait read a paper by\nHelmholtz\nin\nCrelle's Journal\non the motion of a perfect fluid.\nHelmholtz\n's paper\nÜber Integrale der hydrodynamischen Gleichungen, welche den Wirbelbewegungen entsprechen\nⓉ\n(\nOn integrals of hydrodynamic equations, which correspond to vortex motion\n)\nbegan by decomposing the motion of a perfect fluid into translation, rotation and deformation. Tait saw that using quaternions he could express the fluid velocity as a \"vector function\". It was the physical insight which\nHamilton\n's quaternion differential calculus then gave which impressed Tait and he began to work hard developing a physical theory.\nTait began to correspond with\nHamilton\nin August\n1858\nand, in reply to\nHamilton\n's question as to how he had started to work with quaternions, Tait wrote to\nHamilton\non\n7\nDecember\n1858\n(\nsee for example\n[\n7\n]\n)\n:-\n... it was only in August last that I suddenly bethought me of certain formulas I had admired years ago on page\n610\nof your Lectures - and I thought\n(\nand still think\n)\nlikely to serve my purpose exactly.\n(\nThe matter which more immediately suggested this to me was a paper by\nHelmholtz\nin\nCrelle\n's Journal\n(\nVol. LX\n)\nwhich I was reading in July last as soon as we received it ... The title\n(\nin German\n)\nI forget - but a manuscript translation of my own which I now have beside me is headed \"Vortex motion\" ...\n)\n.\nIf Tait's friendship with\nHamilton\nwas to prove important for his future research, then other friendships which Tait formed were important in his family life. Two of his friends at Peterhouse were sons of the Rev James Porter and through them Tait met their sister, Margaret Archer Porter, whom he married in Belfast on\n13\nOctober\n1857\n.\nThe Chair of Natural Philosophy at the University of Edinburgh became vacant in\n1859\n, J D Forbes having moved to the University of St Andrews. Tait was a candidate for the chair but so was\nMaxwell\nwho had been forced to seek another post when Marischal College and King's College in Aberdeen combined.\nRouth\n, who had been First Wrangler at Cambridge in\nMaxwell\n's year, was also a candidate but the real competition was always going to be between Tait and\nMaxwell\n. Tait won despite\nMaxwell\n's outstanding scientific achievements. When the Edinburgh paper, the\nCourant\n, reported the result it noted that Tait had been chosen in preference to\nMaxwell\nsince:-\n... there is another quality which is desirable in a Professor in a University like ours and that is the power of oral exposition proceeding on the supposition of imperfect knowledge or even total ignorance on the part of pupils.\nThe claim that Tait was the better person to teach poorly qualified pupils was certainly a fair one and, of course, Tait's personality meant that he made a stronger impression on the appointing committee rather than the much more reserved\nMaxwell\n.\nBy the time he arrived in Edinburgh in\n1860\nTait was making strong contributions in applying\nHamilton\n's quaternions. In the year he took up the chair of Natural Philosophy at Edinburgh he published\nQuaternion investigations connected with electro-dynamics and magnetism\nin which he reworked\nHelmholtz\n's hydrodynamic- electromagnetic analogy in the language of quaternions. As Epple writes in\n[\n11\n]\n:-\n... not only quaternion analysis profited from acquiring a new. physical meaning. Quaternionic formulas also helped to grasp physical situations which could be described in terms of fluid motion more easily.\nBy\n1863\nwhen he published\nNote on a quaternion transformation\nin the\nProceedings of the Royal Society of Edinburgh\n, Tait claimed that:-\n... the next grand extensions of mathematical physics will, in all likelihood, be furnished by quaternions.\nHamilton\ndied in\n1865\nand Tait took over the crusade to give quaternions a leading role in mathematical physics. Among the many contributions he made to the topic we should mention his two important texts\nElementary Treatise on Quaternions\n(1867)\n, and\nIntroduction to Quaternions\n(1873)\n.\nMaxwell\nwas impressed by Tait's many works on physical applications of quaternions and wrote in a letter to\nWilliam Thomson\nin\n1871\n:-\nYou should let the world know that the true source of mathematical methods as applicable to physics is to be found in the Proceedings of the Royal Society of Edinburgh. The volume- surface- and line- integrals of vectors and quaternions and their properties as in the course of being worked out by Tait is worth all that is going on in other seats of learning.\nDespite his intense work on quaternions, Tait was involved in many other activities. In\n1862\nhe had published joint work with James A Wanklyn on electricity produced during evaporation and during effervescence. Three years later he published a paper on the motion of iron filings on a vibrating plate which was subjected to a magnetic field. In\n1866\nhe started a joint project with the physicist Balfour Stewart on heating a disk which was rapidly rotating in a vacuum. This was a topic Tait came back to on several occasions throughout his career. Then in\n1867\nhe published, in addition to the treatise on quaternions, his translation of\nHelmholtz\n's\n1858\narticle and also the\nTreatise on Natural Philosophy\nfor which he may be best known.\nIn\n1861\nTait had been working on a text on mathematical physics. His friend\nWilliam Thomson\n(\nlater Lord Kelvin\n)\n:-\n... to my great delight offered to join.\nThe two intended to write a two volume work and\nTreatise on Natural Philosophy\n(1867)\nwas to be the first of the volumes. However the second volume was never written. The treatise, known as\nT & T'\n, was written mainly by Tait who seemed to find time despite his numerous other activities, while\nThomson\nfound that his many other activities prevented him finding as much time as Tait to work on the book. Hamilton Dickson writes in\n[\n10\n]\n:-\nThe work was epoch-making, and created a revolution in scientific development. For the first time T & T', as the authors called themselves, traced to\nNewton\nthe concept of the 'conservation of energy' which was just then obtaining recognition among physicists, and they showed once and for all that 'energy' was the fundamental physical entity and that its 'conservation' was its predominant and all-controlling property.\nWe have already detailed major achievements for Tait dated\n1867\nbut there is one further event of that year which we should mention.\nHelmholtz\n, in his\n1858\npaper, described the theoretical behaviour of vortex rings. He claimed that two interacting rings would change size and velocity as they interacted but would retain their ring shape. Tait verified\nHelmholtz\n's theoretical claims with experiments with smoke rings in\n1867\n. He used two boxes each with a rubber diaphragm which shot out white smoke rings when the diaphragm was struck.\nThomson\nwrote to\nHelmholtz\non\n22\nJanuary\n1867\n:-\n... a few days ago Tait showed me in Edinburgh a magnificent way of producing\n[\nvortex rings\n]\n. We sometimes can make one ring shoot through another, illustrating perfectly your description; when one ring passes near another, each is much disturbed, and is seen to be in a state of violent vibration for a few seconds, till it settles again into its circular form. ... The vibrations make a beautiful subject for mathematical work.\nThese experiments were to have a major influence on\nThomson\nwho saw the permanence of form as a possible explanation for atoms and therefore explain the way that the different elements could be built. Tait was not convinced by\nThomson\n's idea at first, rightly so of course since, although a beautiful idea, it is quite wrong. The idea led Tait,\nThomson\nand\nMaxwell\nto begin to work on\nknot theory\nsince the basic building blocks, in\nThomson\n's vortex atom theory, would be the rings knotted in three dimensions. By\nHelmholtz\n's theory of a perfect fluid, these knotted rings, although they could be distorted, would retain the 'same knot' as a circular knotted piece of string that can be moved around yet the form of the knot remains an invariant.\nTait,\nThomson\nand\nMaxwell\nexchanged letters in which they invented many topological ideas as they looked at knots. Soon they discovered\nListing\n's\n1847\ncontributions to knot theory. Tait, although at first unconvinced by\nThomson\n's vortex atom theory, began to include the theory in his lecture courses at Edinburgh in the early\n1870\ns and he gave popular lectures describing the theory. In\n1876\nTait began an intense study of knots, attempting to classify them. He published seven papers on knots in the\nProceedings of the Royal Society of Edinburgh\nin the academic year\n1876\n-\n77\n.\nTait considered alternating knots, namely those which when traversing the projection in\n2\n-dimensional space the crossings go alternately over and under. He labelled the\nn\nn\nn\ncrossings of such a knot\nA\n,\nB\n,\nC\n,\n.\n.\n.\nA, B, C, ...\nA\n,\nB\n,\nC\n,\n.\n.\n.\nand then the knot would be described by the sequence of crossings of length\n2\nn\nn\nn\nwhere each of\nA\n,\nB\n,\nC\n,\n.\n.\n.\nA, B, C, ...\nA\n,\nB\n,\nC\n,\n.\n.\n.\noccurred exactly twice when the knot was traversed. There were then two basic problems to solve. Firstly which sequences of the above type corresponded to a knot, and secondly how could it be determined when two knots described by such sequences were the same.\nWithout any rigorous theory, which would have been well beyond nineteenth century mathematics, Tait began to classify knots using his mathematical and geometrical intuition. By\n1877\nhe had classified all knots with seven crossings but he stopped there. One of the problems he considered after that was the colouring of graphs since he claimed to have a correct proof of the four colour theorem. His proof is fallacious and, sadly, he did not relate colouring of graphs to the knot theory he had considered a few years earlier. Another topic which he had worked on over a number of years was the results of the Challenger expedition on deep sea temperatures. In\n1881\nTait published an important paper on the topic in which he showed how to correct the temperature readings because of the high pressures on the thermometers.\nHe returned to the topic of knots in his address to the\nEdinburgh Mathematical Society\nin\n1883\n:-\nWe find that it becomes a mere question of skilled labour to draw all the possible knots having any assigned number of crossings. The requisite labour increases with extreme rapidity as the number of crossings is increased. ... I have not been able to find time to carry out this process further than the knots with seven crossings. ... It is greatly desired that someone, with the requisite leisure, should try to extend this list, if possible up to\n11\n...\nKirkman\nread the text of Tait's address and began to work on classifying knots with more than seven crossings. He sent Tait his results on knot projections with up to nine crossings in May\n1884\nbut he had not looked at the problem of deciding which of the projections led to equivalent knots. Tait worked on this side of the problem and, considering only alternating knots, solved the equivalence problems within a few weeks. Tait seemed to know how to tell whether two knots were equivalent without rigorous methods. He states this quite clearly in the paper he wrote tabulating the knots where he says that his methods have:-\n... the disadvantage of being to a greater or less extent tentative. Not that the rules laid down ... leave any room for mere guessing, but they are too complex to be always completely kept in view. Thus we cannot be absolutely certain that by means of such processes we have obtained all the essentially different forms which the definition we employ comprehends.\nDespite the problems Tait knew exactly what he was doing for, remarkably, his tables are correct. When\nKirkman\nsent him all knot projections with\n10\ncrossings in January\n1885\nagain Tait found all in equivalent knots. The tables were printed in September\n1885\nand again they are completely correct. By then he had received from\nKirkman\n1581\nknot projections with\n11\ncrossings and this time Tait felt that he did not have the time to solve the equivalence problem for these.\nIt would be quite impossible in an article of this length to cover all the topics which Tait worked on.\nKnott\n[\n7\n]\nlists\n365\npapers and\n22\nbooks written by Tait. We will mention two final topics which he worked on after ending his work on knots.\nThomson\nsuggested that he work on the kinetic theory of gases and between\n1886\nand\n1892\nTait published more than\n20\npapers on the topic. In this work he gave what\nThomson\nconsidered the first proof of the Waterston-\nMaxwell\nequipartition theorem.\nTait also wrote a classic paper on the trajectory of golf balls\n(1896)\n. The subject of golf was one of great interest to Tait. Of his four sons, the third was Frederick Guthrie Tait. He became the leading amateur golfer in\n1893\nand won the The Amateur Championship in\n1896\nand\n1898\n. He finished third in The Open Championship in\n1896\nand\n1897\nand was leading amateur in the Open six times. Freddie Tait, as he was known in the golfing world, has a street in St Andrews named after him which is not far from my\n[\nEFR\n]\nhome. Freddie was a military man in the Black Watch. He gave up his golf when he volunteered to serve in the Boer War in\n1899\n. He was wounded at Magersfontein on\n19\nDecember\n1899\nand killed during fighting at Koodoosberg on\n7\nFebruary\n1900\n.\nA deeply religious man, Tait wrote, with the physicist Balfour Stewart,\nThe Unseen Universe\n(1875)\n:-\n... to overthrow materialism by a purely scientific argument.\nBecause of the public demand, he wrote a sequel\nParadoxical Philosophy\n(1878)\n.\nWe have painted a very positive picture of Tait in the details we have given above. This is right for he deserves no less. However there was another side to his character which we should mention. He became involved in many arguments with his fellow scientists and at least twice engaged in very public arguments. Tait was prone to let his heart rule his head in such situations and he often came of worse in the scientific debate. One of his disputes was with\nHeaviside\nand\nGibbs\nwhose vector methods he argued vigorously against over a long period. Certainly Tait came off worst in this arguments, perhaps his heart was too set on quaternionic methods to allow his head to see the importance of the ideas of\nHeaviside\nand\nGibbs\n.\nAnother bitter dispute was with\nClausius\nand Tyndall. Tait was patriotic to the extent that he would let such considerations prejudice his view of science. The dispute began over who was the first to propose the equivalence of work and heat. Tait and Tyndall began an argument over whether Joule or Julius Robert Mayer von Mayer had priority. Tait wrote a highly prejudiced account of the history of thermodynamics which was stupidly pro-British and Tyndall was right to be offended. Then\nHopkins\nstumbled into the controversy when Tyndall had asked him to send him all von Mayer's papers but he was as pro-German as Tait was pro-British when he published an article in\n1868\nstating that not only did von Mayer have priority but so did the German nation. A more bitter dispute between Tait and\nClausius\nbegan in\n1872\nwhen\nMaxwell\npublished his\nTheory of Heat\n.\nClausius\nstated that the British were trying to claim more than they deserved for the theory of heat which, given Tait's writing, was a fair comment.\nMaxwell\n, however, had over a number of years fully recognised\nClausius\n's contribution, unlike Tait with his prejudiced approach.\nOf course Tait's patriotism also meant that he was a devoted supporter of the\nRoyal Society of Edinburgh\nwhich he served faithfully from the time he was elected a Fellow shortly after being appointed to the chair in Edinburgh. He served the Society as General Secretary for\n22\nyears from\n1879\nuntil\n1901\n. He won the Gunning Victoria Jubilee Prize and twice the Keith prize from that Society. Although never elected a Fellow of the\nRoyal Society of London\n, he did have the distinction of receiving that Society's Royal Medal in\n1886\n. Other honours given to Tait included the award of honorary degrees by the University of Glasgow and the University of Ireland, as well as being elected to honorary membership of the academies of Denmark, Holland, Sweden and Ireland.\nAt a ceremony in Peterhouse to present a portrait of Tait,\nLord Kelvin\nspoke of his friend:-\nI remember Tait once remarking that nothing but science is worth living for. It was sincerely said, but Tait himself proved it to be not true. Tait was a great reader. He would get Shakespeare, Dickens, and Thackeray off by heart. His memory was wonderful. What he once read sympathetically he ever after remembered. Thus he was always ready with delightful quotations, and these brightened our hours of work. For we did heavy mathematical work, stone breaking was not in it.\nIn\n[\n3\n]\nhe is described as follows:-\nHis familiar figure was marked by a certain eccentricity, or carelessness of dress, and some of his intimate friends can scarcely remember ever to have seen him in a dress suit. Dining out was indeed an abomination in his eyes, unless it were informally in the company of one or two kindred spirits."
}