{
  "nome_completo": "Panagiotis S Zervos",
  "nome_curto": "Panagiotis Zervos",
  "ano_nascimento": "1878",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zervos/",
  "lugar_nascimento": "Zervata, Kefalonia, Greece",
  "lugar_morte": "Athens, Greece",
  "biografia": "Panagiotis Zervos\nwas born in the village of Zervata on the Greek Ionian island of Kefalonia. He belonged to the ancient family of the island, which is first mentioned in a document dated\n1264\n. The long-standing family tradition was that at least one son from each generation joined the Church. Panagiotis was a son of Spiridon Zervos, a merchant, and his wife Anastasia Montesanda. He was one of a large family having two brothers, Ioannis and Christos, and six sisters, one of whom, Maria, deserves special mention.\nMaria Zervos became one of the first Greek women to graduate from the Department of Mathematics at Athens University. She became a school teacher and published a schoolbook on theoretical arithmetic, written in Greek, as well as at least four papers written in French:\nSur les expressions de certains théorèmes de l'arithmétique élémentaire\nⓉ\n(\nOn the expressions of some theorems of elementary arithmetic\n)\n(1927)\n,\nSur une expression nouvelle de la définition des nombres premiers\nⓉ\n(\nOn a new expression of the definition of prime numbers\n)\n(1930)\n,\nSur quelques définitions et théorèmes de l'arithmétique\nⓉ\n(\nOn some definitions and theorems of arithmetic\n)\n(1932)\nand\nSur une classe de nombres composés\nⓉ\n(\nOn a class of composite numbers\n)\n(1934)\n. The second of these four papers was the published version of the talk she gave in the 'Matematiche elementari, Questioni didattiche, Logica matematica' Section of the International Congress of Mathematicians in Bologna in September\n1928\n. Let is return to our biography of her brother Panagiotis.\nBefore Panagiotis had reached the age to attend elementary school, the family moved to Corfu. Spiridon Zervos, together with the rich merchant Margaritis, founded a wax works producing candles. Panagiotis attended the Economou School\n(1884\n-\n1889)\nand then at the\nGymnasium\nof Corfu\n(1889\n-\n1893)\n. Panagiotis's older brother Ioannis had already distinguished himself at this Gymnasium but Panagiotis ran into problems in the mathematics class. The mathematics teacher was unhappy when Panagiotis produced solutions to problems that were different from the 'official solutions'. He also got into problems in a written examination for helping another member of his class.\nThe problems at the school were minor compared with other tragedies that the family suffered. Two of Panagiotis's younger sisters, Angeliki and Philile, died and his father's wax business went bankrupt. The family left Corfu and moved to Alexandria in Egypt and Panagiotis, who had not yet completed his secondary education, entered the French school, the Collège des Frères. A year after moving to Egypt, Spiridon Zervos died in\n1894\nand left his family without financial support. Panagiotis's mother decided that her son should take a job as a watchman at a medical warehouse. This did not please Panagiotis who had become passionate about mathematics and wanted, above all else, to be able to study the subject at university. Therefore, at the age of sixteen, he travelled alone to Athens and, with no financial support, entered the Faculty of Mathematics of the University of Athens.\nIn the first two university years of\n1894\n-\n1896\nhe lived alone in the attic of a house and earned his living by tutoring. In his first year of study, Zervos won a competition for students who needed financial support and received a cash prize. When Zervos began his third year at university, his whole family\n(\nexcept his older brother Ioannis\n)\nmoved from Alexandria to Athens and he was able to support the whole family from the money he earned from tutoring since he had already gained a high reputation as a tutor. His younger brother, Christos, joined the army, but soon after died of tuberculosis.\nThe professor of mathematics at the University of Athens at this time was Cyparissos Stephanos\n(1857\n-\n1917)\n, who had studied for his Ph.D. at the University of Paris. As well as serving as professor of mathematics, Stefanos was rector of the university\n1894\n-\n1895\n. He taught three students who became leading mathematicians. One was Zervos, the subject of this biography, and the other two were\nGeorgios Remoundos\nand\nNicholas I Hatzidakis\n.\nRemoundos\nbegan his studies at the University of Athens in\n1895\n, one year after Zervos.\nNicholas Hatzidakis\ngraduated one year before Zervos entered the university but his father Ioannis Hazzidakis, who had also studied in Paris, had been appointed as a full professor at Athens in\n1884\nand was the greatest influence on the mathematical development of Zervos. There was, however, one further mathematician teaching at the University of Athens at this time who was important to Zervos and that was his professor, Cyparissos Stephanos.\nZervos graduated from the University of Athens in\n1899\nwith a degree which qualified him as a school teacher. He was awarded the grade 'excellent'. His examining committee included Cyparissos Stephanos and Ioannis Hazzidakis, and they contacted the Ministry of Education recommending that Zervos should begin immediately working as a secondary school teacher. On\n24\nAugust\n1899\n, he was appointed as a teacher in Lixouri, Kefalonia, where he taught during the school year\n1899\n-\n1900\n. In the following year he taught at the Varvakis Lyceum in Athens, followed by a year at the high school in Keratea. At this time, in addition to his teaching duties, Zervos was undertaking research attempting to determine the exact number of positive roots of algebraic equations with real factors. He published two papers in\n1901\n, namely\nQuelques remarques sur la recherche du nombre des racines positives d'un polynôme\nⓉ\n(\nSome remarks on finding the number of positive roots of a polynomial\n)\nand\nSur le théorème de Descartes\nⓉ\n(\nOn the Descartes theorem\n)\nboth in the journal\nL'Enseignement Mathématique\n. His introduction to the second of these papers is as follows:-\nIn the following proof of\nDescartes\n' theorem we use\nRolle\n's theorem.\nLaguerre\nalso gave a proof of the same theorem based on\nRolle\n's theorem. But our proof differs essentially from his. It shows how, given a polynomial, we find an upper limit of the number of positive roots by means of the upper limit of the number of positive roots of its derivative of a certain order. If we express by\nn\nn\nn\nthe number of sign changes of coefficients of a polynomial with real coefficients, the number of its positive roots is\nn\n−\n2\nt\nn - 2t\nn\n−\n2\nt\n, where\nt\nt\nt\nis a positive integer or zero.\nThe second of these papers contained results which were in Zervos's Ph.D. thesis entitled\nOn the series and the theorem of Descartes\n(\nGreek\n)\nfor which he was awarded his doctorate by the University of Athens in\n1901\n.\nFor a list of some of Zervos's papers, see\nTHIS LINK\n.\nStephanos had encouraged Zervos to enter the state competition for a scholarship for further studies which took place in\n1901\n. He did not enter, however, telling Stephanos that his family obligations did not let him take part. In fact it was this competition that was won by\nRemoundos\nand it allowed him to undertake research in Paris. Although he planned to carry on teaching and supporting his family, in fact circumstances did not allow that to happen. On\n12\nSeptember\n1902\n, he was dismissed from public service, because one of his relations, who was a politician, realised Zervos had not voted for him. Now out of a job, there was no reason why he could not go to Paris so, at the beginning of\n1903\nthis is what he did. It was a brave move since he had very little in the way of financial support. Once in Paris, Zervos attended the lectures of\nPaul Painlevé\nand\nJacques Hadamard\nfor four semesters at the Collège de France.\nAt the beginning of\n2005\nHadamard\nsuggested to Zervos that he look at the\nMonge\nProblem.\n[1]\n:-\nThe\nMonge\nproblem in one independent variable, in the broad sense, consists of explicitly integrating a system of k\n(\nk\n≤\nn\n−\n1\n)\n(k ≤ n - 1)\n(\nk\n≤\nn\n−\n1\n)\nMonge\nequations:\nF\ni\n(\nx\n1\n,\nx\n2\n,\n.\n.\n.\n,\nx\nn\n+\n1\n;\nd\nx\n1\n,\nd\nx\n2\n,\n.\n.\n.\n,\nd\nx\nn\n+\n1\n)\n=\n0\n(\ni\n=\n1\n,\n2\n,\n.\n.\n.\n,\nk\n)\nF_{i} (x_{1,} x_{2,}...,  x_{n+1} ;  dx_{1,} dx_{2,}...,  dx_{n+1}) = 0 (i = 1, 2, ..., k)\nF\ni\n​\n(\nx\n1\n,\n​\nx\n2\n,\n​\n.\n.\n.\n,\nx\nn\n+\n1\n​\n;\nd\nx\n1\n,\n​\nd\nx\n2\n,\n​\n.\n.\n.\n,\nd\nx\nn\n+\n1\n​\n)\n=\n0\n(\ni\n=\n1\n,\n2\n,\n.\n.\n.\n,\nk\n)\n,\nin which the\nF\ni\nF_{i}\nF\ni\n​\nare homogeneous functions of the\nd\nx\n1\n,\nd\nx\n2\n,\n.\n.\n.\n,\nd\nx\nn\n+\n1\ndx_{1}, dx_{2}, ..., dx_{n+1}\nd\nx\n1\n​\n,\nd\nx\n2\n​\n,\n.\n.\n.\n,\nd\nx\nn\n+\n1\n​\n.\nBy the term \"explicitly integrating,\" we mean expressing the x variables as well- defined functions of one parameter,\nn\n−\nk\nn - k\nn\n−\nk\narbitrary functions of that parameter and their derivatives up to a certain order, and that those functions can also contain a finite number of arbitrary constants.\nMonge\nsolved that problem for the case\nn\n=\n2\n,\nk\n=\n1\nn = 2, k = 1\nn\n=\n2\n,\nk\n=\n1\n.\nZervos began looking to see what had been already done and discovered that the problem had been investigated by\nJoseph Serret\nin\n1848\n, by\nGaston Darboux\nin\n1873\nand\n1887\n, by\nGeorg Frobenius\nin\n1877\n, by\nFriedrich Engel\nin\n1889\n, by\nSophus Lie\nin\n1898\n, by\nÉdouard Goursat\nin\n1898\n, by\nHeinrich Weber\nin\n1900\n, by\nÉlie Cartan\nin\n1901\n, and by\nHadamard\nhimself in\n1901\n. With such a collection of leading mathematicians having studied the problem before him, Zervos thought\nHadamard\nmust be joking to ask him to examine it. After two months of unsuccessful attempts to prove the general case of the\nMonge\nProblem, Zervos found a counterexample showing it was not true in general. He published this result in\nSur le problème de Monge\nⓉ\n(\nOn the problem of Monge\n)\n(1905)\n. Zervos continued to undertake research on this problem for the rest of his life.\nFor a list of some of Zervos's publications, see\nTHIS LINK\n.\nAfter his return from France to Greece at the end of\n1905\n, Zervos again faced family obligations and his income was through giving private lessons. He attended the International Congress of Mathematicians held in Rome in April\n1908\nand gave the talk\nSur la correspondance entre les théories d'intégration des équations aux drivées partielles du premier ordre et d'intégration des systèmes de Monge\nⓉ\n(\nOn the correspondence between the integration theories of first-order partial equations and the integration of Monge systems\n)\nin Section I: Arithmetic, Algebra, and Analysis.\nIn September\n1908\n, he began teaching at the\n4\nth school of Piraeus and remained in that post until\n1911\n. In the academic year of\n1908\n-\n1909\nhe also taught Dynamics and Mechanics at the University of Athens. In\n1911\nhe was moved to teach at the\n4\nth school of Athens. He continued to work on the\nMonge\nProblem and in\n1912\n, independently, he obtained results similar to those published by\nDavid Hilbert\nin\nÜber den Begriff der Klasse von Differentialgleichungen\nⓉ\n(\nOn the concept of the class of differential equations\n)\n(1912)\nwhich appeared in the\nHeinrich Weber\nFestschrift. Zervos's results were presented to the International Congress of Mathematicians in Cambridge, England, in August\n1912\nas the lecture\nSur les équations aux derivées partielles du premier ordre à trois variables indépendantes\nⓉ\n(\nOn first order partial differential equations with three independent variables\n)\n. Zervos was able to generalise\nHilbert\n's results and published these in\nSur l'intégration de certains systèmes indéterminés d'équations\nⓉ\n(\nOn the integration of some undetermined systems of equations\n)\nwhich appeared in\nCrelle\n's Journal.\nIn October\n1913\n, he became a teacher at the Second Varvakis High School in Athens. Ioannis Hazzidakis retired from the chair of Differential and Integral Calculus in\n1914\nand Zervos was invited to accept a professorship in the Department of Higher Algebra at the University of Athens. But to everyone's surprise, Zervos, who was struggling to make ends meet, refused a professorship at the university and chose to remain a high school teacher. The professorship remained vacant, however, and Zervos was unanimously elected on\n30\nNovember\n1917\n. This election was one of the last administrative acts of Cyparissos Stephanos, who died on\n27\nDecember\n1917\n. Zervos visited Stephanos shortly before his death and he asked Zervos to take over the publication of his unpublished works. Zervos's mother died soon after this, however, and when some time later he managed to visit the house where Stephanos had lived, his sisters refused Zervos access to their brother's manuscripts. On\n26\nJanuary\n1918\nZervos gave his inaugural professorial address at the University of Athens entitled 'Relations of mathematics to other sciences and to philosophy'.\nThe\nGreek Mathematical Society\nwas created in\n1918\n, and\nNikolaos Hatzidakis\nbecame the first president with Zervos as vice-president. The Society began publication of the\nBulletin\nof the\nGreek Mathematical Society\nin\n1919\nand Zervos published two papers in French in the first volume, namely\nSur l'équivalence des systèmes d'équations différentielles\nⓉ\n(\nOn the equivalence of systems of differential equations\n)\nand\nSur quelques remarques relatives aux théories de l'intégration des systèmes en involution du second ordre\nⓉ\n(\nSome remarks on the theories of system integration in second-order involution\n)\n. In\n1920\nhe published four papers, two of them in the\nProceedings\nof the International Congress of Mathematicians which was held in Strasbourg in September of that year. At this International Congress of Mathematicians the\nInternational Mathematical Union\nwas founded with eleven founding countries, one of which was Greece. One place on the board was for a Greek representative and Zervos held this place. He also represented Greece on the International Committee for the Teaching of Mathematics. He wrote papers on teaching mathematics such as\nOn the teaching of Differential and Integral Calculus in Greece\n(1920)\nand\nModern trends in the teaching of Mathematics in different countries\n(1936)\n.\nThe political situation in Greece gave Zervos severe problems. Constantine I had been king of Greece from\n1913\nbut internal pressure from Eleftherios Venizelos, the Greek Prime Minister, together with external pressure from Britain and France, led to him resigning in June\n1917\n. Alexander, the second son of Constantine I, became king and it was Alexander who appointed Zervos to the chair at the University of Athens. Alexander died on\n25\nOctober\n1920\n, after a freak accident, and Constantine returned as king on\n19\nDecember\n1920\n. One of the first acts of Constantine was cancel all appointments made by Alexander so Zervos was dismissed. For the following two years he lived in extremely difficult financial circumstances. After the Greeks under Constantine were defeated by the Turks in Anatolia, Constantine abdicated the throne for the second time on\n27\nSeptember\n1922\n. His eldest son George became king as George II and Zervos was reinstated to his chair at the University of Athens on\n1\nDecember\n1922\n. He continued in this position until he retired in August\n1949\n.\nIn\n1925\nZervos married the philologist Hariklia Papaioannou, a secondaary school teacher who published many books including\nIntroduction to the study of ancient Greek poetry\n(1974)\n. They had one son, Spyros P Zervos\n(\nborn\n17\nMarch\n1930\n, died\n23\nJanuary\n2015)\n, who also became an outstanding mathematician. Spyros studied at the École Normale Supérieure in Paris where he was awarded his doctorate in\n1960\nfor his\n115\n-page thesis\nAspects modernes de la localisation des zéros des polynomes d'une variable\nⓉ\n(\nModern aspects of zero localization of polynomials in a variable\n)\n. He returned to Athens becoming a professor at the university where he continued except during\n1968\n-\n1974\nwhen he was dismissed by the Junta.\nSince\n1925\nthe\nParis Academy of Sciences\nhad been commissioning a series of monographs reviewing current mathematical problems, the series having the title\nMémorial des sciences mathématiques\nⓉ\n(\nMemorial of mathematical sciences\n)\n. Zervos, as a recognised world leader on the\nMonge\nProblem was asked to write\nLe problème de Monge\nⓉ\n(\nThe problem of Monge\n)\nwhich appeared as No\n53\nin the series in\n1932\n, see\n[\n2\n]\n. This was translated into English by D H Delphenich and is reference\n[1]\nbelow. The work is headed:-\nMemorial to the Mathematical Sciences. Published under the Patronage of the Paris Academy of Sciences, of the Academies of Belgrade, Brussels, Bucharest, Coimbre, Kraków, Kiev, Madrid, Prague, Rome, Stockholm\n(\nMittag-Leffler Foundation\n)\n, of the French Mathematical Society, with the Collaboration of Numerous Scholars.\nThe\n1\nst Inter-Balkan Mathematical Conference was held in Athens in September\n1934\norganised by Zervos and\nHatzidakis\n. Zervos was Chairman of the Organising Committee, while\nHatzidakis\nwas Chairman of the Executive Committee. The Honorary President was\nConstantin Carathéodory\nand the honorary vice-presidents were\nGheorghe Titeica\n,\nRichard von Mises\nand Panagiotis Zervos. The conference proceedings were published and it contained two papers by Zervos, both written in French, namely\nSur quelques équations différentielles indéterminées\nⓉ\n(\nOn some indeterminate differential equations\n)\nand\nSur l'intégration des systèmes différentiels indéterminés\nⓉ\n(\nOn the integration of indeterminate differential systems\n)\n.\nThe success of the conference led to the publication in\n1936\nof the research journal\nRevue Mathematique de l'Union Interbalcanique\nwith Zervos as its editor-in-chief. Zervos published an obituary of\nGheorghe Titeica\nin the second volume of the\nRevue\nin\n1939\n.\nWe have seen from the title of Zervos's inaugural lecture that he was interested in philosophy. In fact, from\n1930\nto\n1940\n, he taught a course for final year undergraduate students 'Chapters from Mathematical Philosophy'. He pressed for the founding of the Greek Philosophical Society and this came about in\n1933\n. Zervos became its first president. He was elected to the\nAcademy of Athens\nin\n1944\n, having published the paper\nSur l'intégration symbolique\nⓉ\n(\nOn symbolic integration\n)\nin the\nAcademy\n's journal in\n1940\nand after is election gave several talks to the\nAcademy\non\nPlato\n's Mathematics.\nZervos died in Athens at the age of seventy-four. His mathematical work was continued by his son Spyros P Zervos."
}