{
  "nome_completo": "Ernst Pascual Jordan",
  "nome_curto": "Pascual Jordan",
  "ano_nascimento": "1902",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jordan_Pascual/",
  "lugar_nascimento": "Hannover, Germany",
  "lugar_morte": "Hamburg, West Germany",
  "biografia": "Pascual Jordan\n's parents were Ernst Pasqual Jordan\n(1858\n-\n1924)\nand Eva Fischer. Ernst Jordan, the father of the subject of this biography, was a painter who was renowned for his portraits and landscapes. He was an associate professor of art at Hanover Technical University when his son was born. The family name was originally Jorda and it was of Spanish origin. The first born sons were all given the name Pasqual or the version Pascual. The family settled in Hannover after Napoleon's defeat at the Battle of Waterloo in\n1815\nand at some stage changed their name from Jorda to Jordan. Ernst Jordan married Eva Fischer in\n1892\n. Pascual leant much from his parents. In an interview in\n1963\nhe spoke about things he learnt from them:-\nMy father used to read popular books about natural science especially the series of 'Kosmos' books which was popular at the beginning of this century. Each year several books came out in this series, written by people such as Eilhelm Bölsche who was well-known as a popular author. All these 'Kosmos' books belonged to my first reading in natural science. ... My mother knew a good deal about plants, flowers, birds and stars. I learnt from her that light takes eight minutes in coming from the sun to the earth. She was also interested in numbers and calculation; I learnt arithmetic from her.\nWhen he was around eleven years old Jordan was attracted to painting and architecture, topics in which his father was highly skilled. His father strongly encouraged him to follow these interests but soon Jordan became attracted to biology. He said in the\n1963\ninterview:-\nVery early when I was a little boy, I was very fond of animals. I was often taken to the zoological gardens and I began collecting pictures of extinct animals.\nHe attended the Reform\nGymnasium\nin Hannover and, by the age of fourteen, he was reading books such as August Pauly's\n1905\nwork\nDarwinismus und Lamarckismus. Entwurf einer psychophysischen Teleologie\nⓉ\n(\nDarwinism and Lamarckism. Draft psychophysical teleology\n)\n. There he learnt of the ideas of Charles Darwin and Jean Baptiste Lemarck. He also read Friedrich Albert Lange's\nGeschichte des Materialismus und Kritik seiner Bedeutung in der Gegenwart\nⓉ\n(\nHistory of materialism and criticism of its importance at the present\n)\n(1866)\nand began to think deeply about fundamental questions such as whether organic life was understandable from a purely mechanical and physical perspective. He worried whether there was a contradiction between Darwin's theories and the Bible but his teacher of religion at the Gymnasium convinced him that there was no contradiction between Christian teaching and the sciences. In order to gain further understanding he studied classical physics and the theory of forces. He decided that there was no reason to prevent man building a rocket which could travel to the moon. These thoughts made him enthusiastic about studying science.\nAt the age of sixteen, he became interested in advanced mathematics through reading the classic book by Walther Nernst and\nArthur Schönflies\nEinführung in die Mathematische Behandlung der Naturwissenschaften\nⓉ\n(\nIntroduction to mathematical treatment of science\n)\n(1895)\nand the same two authors' book\nKurzgefasstes Lehrbuch Der Differential Und Integralrechnung\nⓉ\n(\nA concise text book of the calculus\n)\n(1895)\n. Concerning this last book he remarked\n(\nin\n1963)\n:-\nIt presents differential calculus and the beginnings of integral calculus, also some considerations about multiple integrals and such things, with specific application to scientific problems. ... I could not read it all at once; at first I read only the first few chapters, then stopped, but later I read on further. It thus took me several years to read completely, up to the first year of my university studies.\nAmong other mathematics books he read while at the Gymnasium, we mention\nKonrad Knopp\n's\nFunktionentheorie\nⓉ\n(\nComplex analysis\n)\n(1913)\n.\nAgainst his father's wishes, after Jordan graduated from the Gymnasium in\n1921\n, he entered the Hanover Technische Hochschule in the summer of that year to study mathematics and physics. His father had pressed him hard to study architecture but Jordan resisted and followed his own wishes. The teaching of physics at the Technische Hochschule disappointed Jordan and he studied mostly mathematics taking courses on differential equations, methods of integration, and algebra. He also attended an electrical engineering course, a physical chemistry course and zoology courses. Since the physics teaching was not up to the standard he hoped for, he left the Technische Hochschule and enrolled at the University of Göttingen in the summer of\n1922\n. His father still pressed for Jordan to remain at the Technische Hochschule and study architecture there but Jordan's mother persuaded her husband to relent and accept that their son would study physics. However, when Jordan began studying at Göttingen he discovered that the physics lectures were all before\n9\no'clock in the morning. This was not to his liking since he had developed the habit of going to bed late and rising late in the mornings, so again Jordan took mainly mathematics courses. In particular he enrolled in\nRichard Courant\n's differential equations course and\nCourant\nquickly realised that he had an exceptionally talented student. He helped\nCourant\nwith the writing of\nCourant\nand\nHilbert\n's\nMethoden der mathematischen Physik\nⓉ\n(\nMethods of mathematical physics\n)\n(1924)\n. The two would meet daily to discuss problems and\nCourant\nexpressed his thanks to Jordan in the Foreword of the book.\nAt Göttingen, Jordan attended lectures by\nEdmund Landau\non number theory and had discussions with\nEmmy Noether\nat the Mathematische Gesellschaft. He also attended the seminar on the structure of matter run by\nMax Born\n,\nDavid Hilbert\nand James Franck. Jordan became\nMax Born\n's student and assisted\nBorn\nwith his encyclopaedia article on crystal dynamics. After the encyclopaedia article was completed,\nBorn\nbecame deeply interested in molecular theory and tried to interest his student Jordan in this topic for his doctoral dissertation. However, Jordan was not particularly interested in this area finding it rather specialised while he wanted to attack more fundamental questions. He read a\n1923\npaper by\nEinstein\nand\nEhrenfest\non light quanta and gave a talk on the paper in a seminar. Jordan said\n(\nin\n1963)\n:-\nAfter listening to my seminar on light-quanta\nBorn\nsaid that I could make that the topic of my dissertation if I liked it better. There was general scepticism about light-quanta and a belief that a different approach to the problem was needed.\nBorn\n's opinion on this was not fixed and he said that since I had raised the question I could pursue it.\nJordan's doctoral dissertation was published in 'Zeitschrift für Physik' in\n1924\n.\nEinstein\nthought that Jordan's dissertation was an ingenious piece of work but disagreed with his basic hypotheses.\nEinstein\npublished a note in 'Zeitschrift für Physik' in\n1925\nstating his objections. Jordan was pleased that\nEinstein\nhad taken an interest in his work and published a further paper on light quanta in\n1925\nfollowing the approach by\nPlanck\n,\nEinstein\nand\nEhrenfest\n. In this paper Jordan thanked\nEinstein\n\"for the kind interest he has taken in this investigation.\" However, by this time Jordan was helping James Franck in writing the book\nAnregung von Quantensprungen durch Stöβe\nⓉ\n(\nExcitation of quantum leaps through bumps\n)\n. Unlike the assistance he had given previously in writing books, this time he appeared as a joint author when the book was published in\n1926\n. The book studied spectroscopic problems but Jordan did not continue with this area for he had already become interested in quantum mechanics.\nIn the summer of\n1925\nWerner Heisenberg\n, who was been\nBorn\n's assistant, returned to Göttingen from a visit to Copenhagen where he had worked with\nNiels Bohr\n. Back in Göttingen he showed\nBorn\nhis new matrix mechanics, the first version of quantum mechanics. He did not invent these concepts as a matrix algebra, however, rather he focused attention on a set of quantised probability amplitudes. These amplitudes formed a non-commutative algebra.\nBorn\nread\nHeisenberg\n's manuscript and tried to make sense of it. He thought that\nHeisenberg\n's quantum objects must be related to matrices but felt he needed a young collaborator with a strong mathematical background to help him formalise his ideas. Jordan offered to help\nBorn\nattack the problem and he had formalised\nBorn\n's vague ideas about matrices in a few days.\nBorn\nand Jordan submitted their paper\nZur Quantenmechanik\nⓉ\n(\nOn quantum mechanics II\n)\non matrix mechanics on\n27\nSeptember\n1925\n. It was almost entirely the work of Jordan since\nBorn\nwas on holiday in Switzerland for most of the time that it was being written. This paper contains the famous\np\nq\n−\nq\np\npq - qp\np\nq\n−\nq\np\nequation, the first appearance of this fundamental quantum theory equation. Jordan's contributions were coming rapidly and in November\n1925\nJordan,\nBorn\nand\nHeisenberg\nsubmitted their three-author paper\nZur Quantenmechanik II\nⓉ\n(\nOn quantum mechanics II\n)\nwhich was published in\n1926\n. Before the end of the year Jordan had submitted a single author paper which suffered an unfortunate fate.\nThis paper\n[\n29\n]\n:-\n... contained what is nowadays known as the\nFermi\n-\nDirac\nstatistics; however it encountered an extremely unfortunate fate after its submission because it landed on the bottom of one of\nMax Born\n's\n(\nin his role as the editor of the 'Zeitschrift für Physik'\n)\nsuitcases on the eve of an extended lecture tour to the US, where it remained for about half a year. When\nBorn\ndiscovered this mishap, the papers of\nDirac\nand\nFermi\nwere already in the process of being published.\nThis paper by Jordan was never published, but he further developed its contents and this extended piece of work,\nZur Quantenmechanik der Gasentartung\nⓉ\n(\nOn the quantum mechanics of gas degeneracy\n)\n,  was published by Jordan in\n1927\n. He published other, extremely significant, papers in\n1927\nsuch as\nÜber eine neue Begründung der Quantenmechamik\nⓉ\n(\nOn a new foundation of quantum mechanics\n)\n(\nin two parts\n)\nwhich deals with what today in called \"transformation theory\". His ideas here were close to those of\nPaul Dirac\n. On\n24\nDecember\n1926\nDirac\n, who was at that time in Copenhagen visiting\nNiels Bohr\n, wrote to Jordan\n(\nsee for example\n[\n16\n]\n)\n:-\nDr\nHeisenberg\nhas shown me the work you sent him, and as far as I can see it is equivalent to my own work in all essential points. The way of obtaining the results may be rather different though ... I hope you do not mind the fact that I have obtained the same results as you, at\n(\nI believe\n)\nthe same time as you. Also, the\nRoyal Society\npublishes papers more quickly than the Zeits. f. Phys., and I think my paper will appear in their January issue. I am expecting to go to Göttingen at the beginning of February, and I am looking forward very much to meeting you and Prof\nBorn\nthere.\nIndeed both papers were published in January\n1927\n, a month after being submitted, with\nDirac\n's paper, as he had thought, appearing first. Jordan's paper was the first of the two part paper whose title we gave above. There are many other contributions that Jordan made to quantum theory in these years but we must look at another remarkable contribution he made which has had a major impact on the development of mathematics. In\n1929\nJordan was appointed as extraordinary professor of physics at the University of Rostock.\nBohr\nwas delighted and wrote to Jordan saying that, since Rostock was quite close to Copenhagen, he hoped they could collaborate. Jordan was, by this time, becoming interested in applying ideas from quantum theory to biological matters. For example, Jordan published\nQuantenmechanik und die Grundprobleme der Biologie und Psychologie\nⓉ\n(\nQuantum mechanics and the basic problems of biology and psychology\n)\n(1932)\nand\nQuantenphysikalische Bemerkungen zu Biologie und Psychologie\nⓉ\n(\nQuantum physical observations on biology and psychology\n)\n(1934)\n.\nBohr\nwas also interested in these ideas.\nIn\n1932\n, in an attempt to put quantum theory into a new algebraic setting, Jordan tried to establish the basic rules satisfied in the matrix interpretation of quantum theory. He published these ideas in\nÜber die Multiplikation quantenmechanischer Gröβen\nⓉ\n(\nOn the multiplication of quantum sizes\n)\n(1934)\nand convinced\nJohn von Neumann\nand\nEugene Wigner\nthat these were significant ideas. Jordan,\nvon Neumann\nand\nWigner\npublished their joint ideas on this in the three-author paper\nOn the algebraic generalization of the quantum mechanical formalism\n(1934)\n. With his approach, Jordan had introduced what today are called Jordan algebras. For more details see\nTHIS LINK\n.\nJordan was, as we have seen, one of the main contributors to the development of quantum theory. However, he never achieved the recognition for this that others, whose contributions appeared to be less, received. Most now believe that this was due to Jordan's political views and his support for the Nazi party. We must therefore look at this aspect of Jordan's life, partly out of interest, but also partly because of its connection with his scientific and mathematical views. Jordan's undergraduate years saw him in Göttingen at a time when most of his fellow students were feeling very hard done by because of the impact on Germany of the severe financial burdens imposed by the Allies following World War I. Jordan's views, however, went far beyond those of most of his fellow students. From the late\n1920\ns he was publishing articles with extreme far-right political views under the pseudonym Ernst Domeier. The fact that he published these anonymously certainly shows that, at that stage, he wanted to keep his political views separate from his scientific work. We present a short quote from an article that Jordan wrote in\n1930\nunder the name Ernst Domeier:-\nSince\n1918\n... instead of a subject we are an object of world politics ... All those who have anything to do with the government of our Reich  ... must be inwardly filled with feelings which result with law-like necessity from the pressing sensation of powerless dependence .... Inferiority complexes create the necessity of a compensation at any price. ... Bureaucratic pomposity and bureaucrats' terrorizing of their own peoples produce the needed compensation.\nIn addition he being a German nationalist, he was very anti-Communist and viewed the rise of the Soviet Union as a major danger to the world. These views, of course, made him an easy target for the Nazi propaganda and indeed he joined the Nazi party in\n1933\n, the year Hitler came to power. Things, however, are not quite as simple as they might appear and one must not think that because Jordan was a staunch and enthusiastic Nazi supporter, he believed in all the Nazi policies. For example, Jordan wrote the book\nPhysikalisches Denken in der neuen Zeit\nⓉ\n(\nPhysical thinking in modern times\n)\nwhich was published in\n1935\n. This book contains an attack on\nLudwig Bieberbach\n's idea of 'Deutsche Mathematik' although Jordan does not mention\nBieberbach\nby name.\nYou can read an extract from the book in which Jordan attacks the idea of 'Deutsche Mathematik' at\nTHIS LINK\n.\nIt is interesting that, as well as not subscribing to all the Nazi policies, he was actively trying to change them from inside the Nazi Party.\nAnother of the 'big' Nazi policies was their anti-Semitism. There is no evidence that Jordan had any anti-Semitic views and the large number of Jewish friends that he had seems to confirm this. The Nazis demanded that all German scientists omit mention of Jewish scientists in the development of their discipline but Jordan argued strongly that politics and science should be kept separate. He wrote books on the history of physics in the\n20\nth\ncentury such as\nDie Physik des\n20\nsten Jahrhunderts\nⓉ\n(\nThe physics of the\n20\nth century\n)\n(1936)\nwhich gave full credit to all Jewish scientists. Of course, Jordan's views presented the leading Nazis with some difficulty. On the one hand he was putting out strong pro-Nazi propaganda which they loved, but his continued association with Jewish scientists meant that Jordan was not trusted by the authorities. There is, of course, a certain irony in the fact that Jordan was almost certainly not awarded a Nobel prize because of his Nazi views when he himself had argued with the Nazis that politics should not influence views of scientific merit.\nWhen World War II began in\n1939\n, Jordan enlisted in the Luftwaffe. He did not see active service but worked as a weather analyst at Peenemünde on the Baltic Sea where V-\n2\nrockets were developed and produced. However, he continued to be more interested in his own ideas rather than in the work that was assigned to him. Peter P Wegener writes\n[\n9\n]\n:-\nJordan sat in front of his typewriter all day composing a textbook on algebra without ever consulting notes. Usually toward the end of the day he would suddenly recall the original purpose of his assignment at Peenemünde. He had never worked in fluid dynamics, but rather than read books as I did, he proceeded to derive the equations of motion of supersonic flows. He delighted in the discovery of such phenomena as shock waves.\nIn\n1944\n, before the war ended, Jordan was appointed as an ordinary professor of theoretical physics at the University of Berlin to fill the chair previously held by Max von Laue who had been declared emeritus in\n1943\n, one year before he was due to retire. Of course after Germany's defeat in the war, Jordan, as a strong Nazi supporter, was in some difficulty. Several of his colleagues, such as\nWerner Heisenberg\nand\nWolfgang Pauli\n, spoke up in his favour. There is a nice episode when, after the war,\nPauli\nand Jordan met.\nPauli\nquoted some of Jordan's \"Nazi propaganda\" and asked, \"Herr Jordan, how could you write such a thing?\" Jordan replied, \"Herr\nPauli\n, how could you read such a thing?\" For the two years\n1945\n-\n47\n, Jordan was dismissed from his position at the university but in\n1947\nhe was reinstated as a visiting professor after statements such as that by\nHeisenberg\nwho said:-\nI never reckoned with the possibility that Jordan could be a true National Socialist ...\nSince Jordan had advertised the fact that he was a Nazi in the most vociferous of ways, this statement by\nHeisenberg\ncould only mean that he wanted all Nazis reinstated. Jordan also asked\nNiels Bohr\nto support his reinstatement but\nBohr\nwas less kind in that he simply replied by sending Jordan a list of his friends and relatives murdered by the Nazis. In\n1947\nJordan was offered temporary professorships at Freiburg and at Hamburg. He chose the latter and in\n1953\nthe position became permanent and Jordan was allowed to supervise Ph.D. students. Wolfgang Kundt writes\n[\n24\n]\n:-\nThe first twenty years of my scientific life,\n1951\n-\n71\n, were strongly shaped by Pascual Jordan, the dominant lecturer of my classes in theoretical physics at Hamburg University, my supervisor for the diploma, Ph.D., and\nhabilitation\n, later as the head of the weekly 'Relativitätstheorieseminar', and as the scientific father who cared equally for the mental and physical wealth of his scholars.\nJordan retired from Hamburg in\n1971\nbut before this he had had a political career being a Christian-Democratic MP in the Bundestag from\n1957\nto\n1961\n. In doing so he had ignored\nPauli\n's advice for when he spoke up for Jordan to be reinstated, he advised him not to enter politics. When in the Bundestag he frequently called for a return to the 'true front spirit'. He continued to believe in militarisation, advocated Germany being allowed to develop a nuclear bomb, remained a staunch anti-Communist, and, in\n1965\n, argued that Germany should not recognise the Oder-Neisse line as the border between Germany and Poland. He continued to argue strongly for Germany to believe more in itself, writing in\n1973\n:-\n... what the German people most urgently need today is the overcoming of its national inferiority complex.\nHe objected to the fact that when he spoke out in favour of a strong Germany, he was called a fascist by those on the political Left.\nLet us end our biography by quoting from\n[\n21\n]\n:-\nThat Jordan never won a Nobel Prize in physics is a puzzle. Some blame his inability to give elegant lectures because of a stutter; some blame his pro-Nazi politics or his support, after World War II, for a German nuclear weapons program; some blame the fact that\nBorn\nmisplaced Jordan's\n1925\nmanuscript in which\nFermi\n-\nDirac\nstatistics were first presented, thus depriving the modest Jordan of his rightful claim to priority over\nPauli\n. But the fact remains that his contributions to the development of modern quantum theory were as fundamental and far-reaching as those of many whose achievements were recognized with a Nobel Prize. It was Jordan, more than anyone else, who developed a mathematically elegant formulation of matrix mechanics. It was Jordan who went on to consolidate matrix mechanics with\nDirac\n's alternative operator calculus and\nErwin Schrödinger\n's wave-mechanical formulation in the comprehensive formalism known as statistical transformation theory. It was Jordan who did more than anyone other than\nDirac\nto inaugurate the program of quantum field theory, in ways such as developing the second quantization approach and being the first to discover the problem of divergences in quantum field theory. And it was Jordan who, along with\nvon Neumann\nand\nEugene Wigner\n, was developing more abstract algebraic frameworks for quantum mechanics. Not without reason has Jordan been described as \"the unsung hero among the creators of quantum mechanics\"."
}