{
  "nome_completo": "Paul Dubreil",
  "nome_curto": "Paul Dubreil",
  "ano_nascimento": "1904",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dubreil/",
  "lugar_nascimento": "Le Mans, Maine, France",
  "lugar_morte": "Soisy sur École (near Paris), France",
  "biografia": "Paul Dubreil\n's father was Léon-René Dubreil, a teacher at the lycée Montesquieu in Le Mans. Born in Le Mans on\n31\nMarch\n1863\nin Le Mans, from a family originally from Parcé-sur-Sarthe, Léon trained to be a teacher in Le Mans from\n1879\nto\n1882\n. He taught at the lycée Montesquieu there from\n1882\nuntil his death on\n6\nApril\n1924\n. On his death the following tribute was paid to him\n(\nsee\n[\n1\n]\n)\n:-\nHe was everywhere loved by his students, with his kindness, poorly concealed by apparent rudeness, joined by bonds of shared affection.\nPaul had an older sister Marie-Rose Dubreil, born in Le Mans on\n5\nOctober\n1900\n. Marie-Rose studied at the girls school in Le Mans and went on to study English at the Faculty of Arts of Caen. After teaching at Nice, then at Lorient, she taught at the lycée Montesquieu in Le Mans from\n1929\nto\n1934\nbefore moving to Paris where she obtained a doctorate on the topic of the novelist Joseph Conrad.\nLéon-René Dubreil's second child was Paul Dubreil, the subject of this biography, who was three and a half years younger than his sister. He was taught at home by his parents before entering a primary school in Le Mans in\n1907\n. After completing his primary schooling, he attended the Lycée in Le Mans where his father was the professor of mathematics. He continued to study there until\n1921\n. Of course, World War I took place from\n1914\nto\n1918\nwhile Dubreil was at school in Le Mans. His father was not conscripted in\n1914\nsince he was too old to serve in the military and continued to teach in Le Mans. The war did, however, have a huge impact on the schools in Le Mans. The lycée Montesquieu was, in part, requisitioned to serve as a hospital and\n100\nwounded soldiers arrived there on\n16\nAugust\n1914\n. The schools continued to operate throughout the war years but many of the teachers were mobilised and many were killed in action. These were difficult times for the young Dubreil who was fourteen years old when the war ended.\nGraduating from the lycée Montesquieu in\n1921\n, Dubreil went to Paris where he studied at the Lycée St Louis, preparing for the entrance examinations to one of the École Normale Supérieure or the École Polytechnique. He took the examinations in July\n1923\nand was ranked first for admission to the École Normale Supérieure and second for admission to the École Polytechnique. He chose to study at the École Normale Supérieure, beginning his studies there later that year. At the École Normale Supérieure, in the first semester, he attended lectures by\nErnest Vessiot\non\nGalois theory\nwhich was presented in a similar way to that in\nÉmile Picard\n's\nTraité d'analyse\nⓉ\n(\nTreatise on analysis\n)\n. In the second semester of his first year,\n1923\n-\n24\n, he attended a course of analysis given by\nÉmile Picard\nwhich looked at topics such as plane algebraic curves and abelian integrals. He also used the textbook\nThéorie des Fonctions algébriques de deux Variables indépendantes\nⓉ\n(\nTheory of algebraic functions of two independent variables\n)\nby\nÉmile Picard\nand Georges Simart. In his first year of study, he also attended some sessions of\nVessiot\n's seminar on the geometry of numbers according to\nMinkowski\nand some sessions of\nHadamard\n's seminars but Dubriel writes in\n[\n5\n]\nthat his:-\n... training was insufficient to draw real profit.\nOf his first year of study Dubreil wrote, rather modestly, in\n[\n5\n]\n:-\nPersonally, I found it hard and obtained a rather mediocre result in the examination. But I remember having experienced great enthusiasm following the\nÉmile Picard\n's lectures on Riemann surfaces ...\nNot only did Dubreil have outstanding teachers at the École Normale Supérieure, but he also had some excellent mathematicians as fellow students including\nRené de Possel\nand Pierre Honnorat. These two fellow students became very interested in\nCamille Jordan\n's\nTraité des substitutions\nⓉ\n(\nTreatise on substitutions\n)\nas well as\nGeorge-Henri Halphen\n's paper\nMémoire sur la classification des corbes gauches algébriques\nⓉ\n(\nMemorandum on the classification of left algebraic curves\n)\nand\nMax Noether\n's paper\nZur Grundlegung der Theorie der algebraischen Ramcurven\nⓉ\n(\nOn the foundations of the algebraic theory  of rational curves\n)\n.\nIn\n1924\n-\n25\nDubreil attended the Cours Peccot delivered at the Collège de France by Marcel Légaut\n(1900\n-\n1990)\non\nÉtude géométrique des systèmes de points dans un plan. Application à la théorie des courbes gauches algébriques\nⓉ\n(\nGeometrical study of systems of points in a plane. Application to the theory of algebraic space curves\n)\n. Dubreil also read Légaut's\n1926\ntranslation into French of\nCourbes et fonctions algébraiques d'une variable\nⓉ\n(\nCurves and algebraic functions of one variable\n)\nby\nFederigo Enriques\n. He went to the Sorbonne to complete his License es Sciences. In the\n1926\nAgrégation de Mathématiques\n, a national examination to find the best candidates for teaching positions, Dubreil was placed first in the whole of France. Before continuing with his studies, however, he undertook the compulsory military service.\nIn October\n1927\n, after completing his military service, he was appointed as a lecturer at the École Normale Supérieure and he began working towards his doctorate. He was undertaking research on algebraic geometry but soon encountered difficulties\n[\n5\n]\n:-\nI soon had the feeling of not being really good at it: I saw trouble everywhere, I was unable to build acceptable reasoning. ... Such were my tribulations when I had a conversation with my friend\nAndré Weil\nwho had just returned from a visit to Göttingen\n(\nprobably as a Rockefeller Fellow\n)\nwhere he had met\nEmmy Noether\n(\nthe daughter of\nMax Noether\n)\nand\nvan der Waerden\n. He pointed out to me that I was immersed, without knowing it, in the theory of ideals of polynomials and advised me to read the memoir of\nvan der Waerden\n'Zur Nullstellen der Polynomideale' and introduced me to the fundamental work of\nEmmy Noether\nand of\nWolfgang Krull\n. Reading these works, which were clear and rich in new ideas, gave me enthusiasm. In July\n1928\n, my thesis was almost finished ...\nIn\n1929\nhe won a prestigious Rockefeller scholarship which enabled him to visit Hamburg in October of that year to study with E\nmil Artin\n. He attended\nArtin\n's lectures, given twice a week, from\n11\n:\n15\nto\n12\n:\n00\nand\n12\n:\n15\nto\n13\n:\n00\n. After the lectures,\nArtin\nwould return to the Institute followed by his students, including Dubreil, and after chatting until around\n14\n:\n00\n, they all went with\nArtin\nto a nearby restaurant. There they would discuss mathematics but there were also other topics of conversation such as literature, music and the cinema.\nEmmy Noether\n, invited by the Philosophical Society, visited Hamburg in February\n1930\n. She attended\nArtin\n's lecture in the morning of the day she was to lecture and came to the lunch which followed. Dubreil got to know her at the lunch, then he attended her lecture in the evening which was given in the main lecture theatre to an audience of philosophers and mathematicians. He wrote to\nMarie-Louise Jacotin\n, whom he was to marry in a few months time, and gave her his impressions of\nEmmy Noether\n[\n6\n]\n:-\nI saw a small plump woman with a ruddy complexion and with no sartorial elegance. Obviously very intelligent, she talked a lot, very quickly, in a jerky way. She fell headlong into the trap that this was a conference for philosophers and mathematicians and her lecture was incomprehensible to philosophers.\nDubreil, however, found discussions with her extremely useful. For the summer semester, beginning at the end of April, Dubriel worked with\nNoether\n. However, before that he took a vacation in Groningen so that he could meet\nBartel van der Waerden\n. Then he went to Frankfurt because by that time\nNoether\nwas in Frankfurt for the summer semester, visiting\nCarl Siegel\n, and Dubreil wanted to continue exchanging ideas with her. As soon as he arrived in Frankfurt,\nNoether\ntold him that she wanted him to talk at the seminar in the next semester. In Frankfurt, Dubreil also met\nMax Dehn\nand his students\nWilhelm Magnus\nand\nRuth Moufang\n. He returned to Paris to marry\nMarie-Louise Jacotin\non\n28\nJune\n1930\n. She was also an outstanding mathematician and the two cooperated for the rest of their careers. After their marriage, they went together to Frankfurt arriving there just before the summer semester ended towards the end of July. Dubreil returned to Paris briefly to defend his doctoral thesis\nRecherches sur la valeur des exposants des composants primaires des ideaux de polynomes\nⓉ\n(\nResearch on the value of the exponents of the primary components of the ideals of polynomials\n)\nin October\n1930\n. Certainly Dubreil was going to get the most out of his Rockefeller scholarship and he next went to Rome where he discussed problems with the geometers\nGuido Castelnuovo\n,\nFederigo Enriques\nand\nFrancesco Severi\n. In Rome, Dubreil and his wife lived in the Hotel Vittoria on the Via Sardegna in the Pincio district.\nFederigo Enriques\nand\nTullio Levi-Civita\nwere also living there at this time. While in Rome, Dubreil was invited to a dinner given by\nLevi-Civita\nin honour of\nSolomon Lefschetz\nwho, along with his wife, was spending a sabbatical year in Europe.\nDubreil's main interest at that time was algebraic varieties and he believed that he had learnt most from\nNoether\nso, before returning to France, his final visit was again to Göttingen to visit\nNoether\n. Once there, he met\nLars Ahlfors\nwho, like Dubreil, was supported with a Rockefeller scholarship. At this time, he also met\nHans Fitting\n,\nHans Heilbronn\n(\nwho was\nEdmund Landau\n's assistant\n)\n,\nKurt Mahler\nand Helmut Ulm\n(1908\n-\n1975)\n. Several visitors also spoke at\nEmmy Noether\n's seminar including\n[\n6\n]\n:-\n...\nBeniamino Segre\n,\nAndré Weil\n, who was returning from India, and\nJacques Herbrand\nwho made two brilliant presentations. He left us in early July to go mountain climbing in France with some comrades, and it was during one of these mountain climbs that the accident happened from which he died.\nHerbrand\n's accident was reported in\nLe Temps\non\n29\nJuly\n1931\nand a cutting from the paper sent to Dubreil in Göttingen. He told\nEmmy Noether\nwhat had happened and she was deeply saddened and kept repeating, \"That is unthinkable.\" While in Göttingen, Dubreil joined in the traditional walk after the Seminar in the wooded hills east of the city.\nEmmy Noether\nwould also take part in the walks which would stop at small rural restaurants providing a variety of attractions.\nThe exciting travels of his fellowship over, Dubreil took up his first permanent post at the University of Lille. Two years later, in\n1933\n, he moved to Nancy where he was to spend the period of World War II. During this period his wife Marie-Louise had appointments at Rennes and then at Poitiers. In November\n1946\nDubreil returned to the Sorbonne and there, in October\n1954\n, he was appointed to the chair of arithmetic and number theory. This chair had been held by\nAlbert Châtelet\nuntil he retired in\n1954\n.\nAfter his Ph.D. thesis, Dubreil published a series of papers:\nRecherches sur la valeur des exposants des composants primaires des idéaux de polynomes\nⓉ\n(\nResearch on the value of the exponents of the primary components of the ideals of polynomials\n)\n(1930)\n;\nSur quelques propriétés des systèmes de points dans le plan et des courbes gauches algébriques\nⓉ\n(\nOn some properties of systems of points in the plane and algebraic space curves\n)\n(1933)\n;\nSur les intersections totales mixtes dans l'espace à trois dimensions\nⓉ\n(\nOn the total mixed intersections in three-dimensional space\n)\n(1933)\n;\nSur quelques propriétés des variétés algébriques\nⓉ\n(\nOn some properties of algebraic varieties\n)\n(1934)\n; and\nQuelques propriétés des variétés algébriques se rattachant aux théories de l'algèbre moderne\nⓉ\n(\nSome properties of algebraic varieties pertaining to the theories of modern algebra\n)\n(1935)\n. He began to work in more general algebraic structures around\n1936\nwhen he became interested in generalising the familiar elementary properties of groups into more general settings. He studied the lattice of equivalence relations on sets and from there was led to study semigroups. Writing in\n1936\nhe explained his approach to attacking problems\n(\nsee for example\n[\n12\n]\n)\n:-\nThe questions to which I have tried to make a personal contribution belong both to the field of algebra and that of geometry, and are related to problems which have been studied or posed for some time. If these problems had received only partial solutions, the reason seems to be, regardless of their own difficulties, that they had been considered only from one of the two points of view, algebraic or geometric. Instead, forcing myself to never separate these two points of view, highlighting the geometric meaning of algebraic results and making progress with algebraic methods so that they can meet the needs of geometry, I could not only elucidate points which remained obscure ... but also address problems from a very general and essentially new approach.\nAxel Thue\nhad published on semigroups as early as\n1914\nwhen he had posed word problem for semigroups. However it was not until the late\n1930\ns and early\n1940\ns that the study of semigroups became a major topic.\nAnatoly Malcev\n,\nAlfred Clifford\nand Dubreil became major figures in the new subject. Dubreil's first major work in this area was\nContribution à la théorie des demi-groupes\nⓉ\n(\nContribution to the theory of semi-groups\n)\n(1941)\n; a second part of this paper\nContribution à la théorie des demi-groupes II\nⓉ\n(\nContribution to the theory of semi-groups II\n)\nappeared in\n1951\nand a third part in\n1953\n.\nLallement who was a student of Dubreil's, describes his lectures in\n[\n12\n]\n:-\nEach of his lectures was a brilliant piece of exposition, clear, precise, polished, and at the same time inspiring by his ability to relate the topics in hand to past and current research. I remember vividly the keen competition this course\n[\nAlgebra and Number Theory\n]\ngenerated among students who were all eager to solve the most challenging weekly problems. When I became one of his doctoral students in\n1961\n, I realised how deep Paul Dubreil's influence on young algebraists was. He was directing a large number of theses, and the weekly meetings of the Dubreil-\nPisot\nseminar were rallying points of researchers, coming even from distant universities to listen to a very wide variety of guest lectures.\nIn\n1946\nDubreil published his book\nAlgèbre. Tome I. Équivalences, Opérations, Groupes, Anneaux, Corps\nⓉ\n(\nAlgebra. Volume I: Equivalents, operations, groups, rings, fields\n)\n. A second edition was published in\n1954\nand a third edition in\n1963\n. In collaboration with his wife\nMarie-Louise Dubreil-Jacotin\n, he published\nLeçons d'algèbre moderne\nⓉ\n(\nLessons in modern algebra\n)\nin\n1964\n. A English edition was published in\n1967\nunder the title\nLectures on modern algebra\n. You can read extracts from some reviews of these books at\nTHIS LINK\n.\nDubreil received many honours for his outstanding contributions, the most notable of which are the Grand Prix des Sciences Mathématiques of the Académie des Sciences\n(1952)\n... for all his work in algebra and analysis\nand being made an Officer of the 'Ordre national de la Légion d'honneur'\n(1955)\n."
}