{
  "nome_completo": "Paul Mansion",
  "nome_curto": "Paul Mansion",
  "ano_nascimento": "1844",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mansion/",
  "lugar_nascimento": "Belle-Maison, Marchin, near Huy, Belgium",
  "lugar_morte": "Ghent, Belgium",
  "biografia": "Paul Mansion\nwas born into a large family, being the ninth of his parents' ten children. He was only a baby when his father died and he was brought up by his mother, Fernande Devreux, and his elder siblings. His mother Fernande, who came from the Namur district in south-central Belgium, brought up her family with enlightened care and made a happy home for all the children. Young Paul played hard and studied hard so that he excelled in elementary school. There he was taught by an outstanding teacher and already at this young age he seemed to know the direction his studies would eventually take him. At this stage, he was at least a year ahead of anyone else in his class in arithmetical skills. Leaving the elementary school, he attended Middle School in Huy for two years before entering the College in Huy in\n1857\n. Lagasse de Locht, a school friend, described in colourful terms Mansion's daily routine during his time in the College\n(\nsee\n[\n3\n]\n)\n:-\nEvery day during these years of hard work he descended from the highlands of Condroz to the foot of the rocks bordering the picturesque Hoyoux valley. With the enthusiasm of youth, and his happy enthusiastic nature, he went through the woods of Sandron, of Barse and of Bailli, whose invigorating scent cleansed him and prepared him for the hard daily exercises and the intellectual duals that he wanted to win. And in the evening, when he retook the same road ... he meditated amid the splendid nature, preparing to revise, to work on, in the family retreat, the lessons that with sustained effort, the result of his iron will, he had been able to assimilate on the benches of the school.\nMansion was particularly grateful to three teachers at the College for the positive influence they had on him, namely J Poumay, who taught him French and German, G Smiet, who taught him mathematics, and J Kunders , who taught him Latin and Greek. He left the College in Hoy and entered the École Normale des Sciences, attached to the University of Ghent, on\n15\nOctober\n1862\n. He graduated with his first degree on\n3\nJuly\n1865\nand continued to undertake research for his doctorate. In November\n1865\nhe began lecturing on advanced algebra, analytic geometry and descriptive geometry at the School of Civil Engineering, attached to the University of Ghent. He taught these courses for two years while he undertook research guided by Félix Dauge and Mathias Schaar. He submitted his thesis\nThéorie de la multiplication et de la transformation des fonctions elliptiques\nⓉ\n(\nTheory of multiplication and transformation of elliptic functions\n)\nand defended it before a jury of professors of the University of Ghent and the University of Brussels on\n3\nAugust\n1867\n.\nLucien Godeaux\nwrites that the thesis\n[\n4\n]\n:-\n... studied, by a particularly simple original method, the multiplication and transformation of\nelliptic functions\n.\nMansion was awarded his doctorate in mathematical and physical sciences with distinction.\nLet us say a little about Félix Dauge\n(1829\n-\n1899)\nand Mathias Schaar\n(1817\n-\n1867)\nwho had such a strong influence on Mansion and on the direction of his research throughout his life. We quote from Mansion himself\n(\nsee\n[\n3\n]\n)\n:-\nDauge, whose student I had the good fortune to be, was an eminent professor. He taught advanced algebra, analytic geometry, astronomy and mathematical methodology. His methodology course was especially remarkable. ...\n[\nSchaar\n]\nraised the level of studies at the University of Ghent by introducing into the doctoral courses the first principles of the general theory of functions and the theory of elliptic integrals.\n[\nHis work on\n]\nStirling's formula\nand the law of quadratic reciprocity gives his name a lasting place in the history of mathematics.\nSchaar was not quite fifty years old when he died in April\n1867\nleaving the Chair of Differential and Integral Calculus and Higher Analysis vacant. By October\n1867\nMansion, who had only been awarded his doctorate two months earlier, had been appointed to teach Schaar's advanced mathematics courses. He was appointed as an extraordinary professor of mathematics at the University of Ghent in\n1870\nand became a full professor four years later. After his appointment as an extraordinary professor, Mansion married to Marie-Cécile Belpaire\n(1846\n-\n1924)\n, the daughter of Alphonse Belpaire\n(1817\n-\n1854)\n, a mathematician, poet and musician, and Elizabeth Teichmann\n(1821\n-\n1900)\n. Paul and Marie-Cécile Mansion had several children: Alphonse Mansion\n1872\n-\n1873\n, Marie Mansion\n1874\n-\n1912\n, Cécile Mansion\n1875\n-\n1894\n, Joseph Mansion\n1877\n-\n1937\n, and Victor Mansion\n1879\n-\n1902\n. In\n1892\nMansion succeeded Emmanuel-Joseph Boudin when he was appointed to the Chair of the Calculus of Probabilities at Ghent.\nAccording to J Pelseneer\n[\n1\n]\n, Mansion:-\n... held an eminent position in the scientific world of Belgium despite his extreme narrow-mindedness.\nAlphonse Demoulin writes\n[\n3\n]\n:-\nAuthor of many works on mathematical analysis, the calculus of probabilities, non-Euclidean geometry, the history and philosophy of science,\n[\nMansion\n]\nheld a prominent place in the Belgian scientific world.\nIn fact Mansion's first publication, appearing before he submitted his doctoral thesis, was a\n13\n-page paper on probability\nSur le problème des partis\nⓉ\n(\nOn the problem of points\n)\nwhich appeared in the\nMémoires\nof the\nRoyal Belgium Academy of Science\nin\n1868\n. This was the first of his many publications on\nprobability\n. We give a few examples of works on this topic published near the end of his career:\nDémonstration du théorème de Bernoulli\nⓉ\n(\nDemonstration of Bernoulli's theorem\n)\n.\nSur une intégrale considérée en calcul des probabilités\nⓉ\n(\nOn an integral considered in the calculus of probability.\n)\n.  Sur une intégrale considérée par Poisson en calcul des probabilités\nⓉ\n(\nOn an integral considered by Poisson in the calculus of probabilities\n)\n(1902)\n,\nSur la portée objective du calcul des probabilités\nⓉ\n(\nOn the objective scope of probability\n)\n(1903)\n,\nSur une intégrale considérée en calcul des probabilités\nⓉ\n(\nOn an integral considered in the calculus of probabilities\n)\n(1904)\n, and\nExceptions apparentes au théorème de Jacques Bernoulli en calcul des probabilités\nⓉ\n(\nApparent exceptions to Jacques Bernoulli's theorem in probability\n)\n(1913)\n.\nThe\nRoyal Belgium Academy of Science\nproposed for its prize competition for\n1871\nthe task \"to summarise and simplify the theory of partial differential equations of the first two orders\". This was a vast and difficult undertaking and Mansion decided to enter but to restrict himself to the theory of first order partial differential equations. The competition was extended by two years setting\n1873\nas the new date for submissions. Mansion submitted the\n289\n-page memoir\nMémoire sur la théorie des équations aux dérivées partielles du premier ordre\nwhich was judged the winning entry.\nJoseph de Tilly\n, one of the commissioners judging the entries, is quoted in the report as stating that:-\nMansion has produced a considerable body of work in which he has shown deep analytical knowledge and vast erudition.\nIn\n1875\nMansion's winning entry was published in the\nMémoires\nof the\nRoyal Belgium Academy of Science\n. An extended German translation of this work was published as\nTheorie der partiellen Differentialgleichungen erster Ordnung\nin\n1892\n. The scale of the additions are clear when we note that this German publication ran to\n489\npages.\nOf course living in Ghent made Mansion particularly aware of the famous mathematician\nAdolphe Quetelet\nwho was born in that city some\n50\nyears before Mansion was born, and who had studied at the university there. Quetelet and Jean-Guillaume Garnier\n(1766\n-\n1840)\n, the professor of astronomy and higher mathematics at Ghent, had edited the Belgium publication\nCorrespondance mathématique et physique\nand in\n1874\nMansion, together with\nEugène Catalan\nand\nJoseph Neuberg\n, founded the journal\nNouvelle correspondance mathématique\nnamed to honour the earlier\nCorrespondance mathématique et physique\nand to follow the naming pattern set by the French journal\nNouvelles Annales de Mathématiques\nwhich followed the\nAnnales de Mathématiques\n. The journal which Mansion,\nCatalan\nand\nNeuberg\nfounded was published between\n1874\nand\n1880\n. During these years Mansion published\n15\npapers in the journal, for example:\nDémonstration d'un théorème de Liouville\nⓉ\n(\nProof of a theorem of Liouville\n)\n(1874)\n;\nThéorie analytique des transformations linéaires\nⓉ\n(\nAnalytic theory of linear transformations\n)\n(1874\n,\n1876\n,\n1887\n,\n1888)\n;\nSur les carrés magiques\nⓉ\n(\nOn magic squares\n)\n(1876)\n;\nRemarques sur les théorèmes arithmétiques de Fermât\nⓉ\n(\nNotes on the arithmetic theorems of Fermat\n)\n(1879)\n; and\nDérivées des fonctions élémentaires d'une variable imaginaire\nⓉ\n(\nDerivatives of elementary functions of an imaginary variable\n)\n(1880)\n. After this journal ceased publication,\nCatalan\nencouraged Mansion and\nNeuberg\nto collaborate in publishing a new journal and, indeed, they did precisely this, publishing\nMathesis\nfrom\n1881\nonwards. Mansion became director of\nMathesis\nand continued with this project until he retired in\n1910\n. He published over\n80\npapers and notes in\nMathesis\nup to\n1915\n, the time that it temporarily stopped publication because of the difficulties caused by World War I.\nAfter he retired in\n1910\n, Mansion was made professor emeritus on\n9\nNovember of that year. He continued to publish numerous article on all the topics that had interested him throughout his career, for example\nQuadrilatère asymptotique lobatchefskien\nⓉ\n(\nAsymptotic quadrangles in Lobatevsky's geometry\n)\n(1910)\n,\nSur un principe de calcul des probabilités\nⓉ\n(\nOn a probability calculation principle\n)\n(1911)\n,\nSur les figures isopérimètres en géométrie plane\nⓉ\n(\nOn isoperimeters figures in plane geometry\n)\n(1913)\n, and\nSur la constante spatiale en géométrie non euclidienne\nⓉ\n(\nOn the spatial constant in non-Euclidean geometry\n)\n(1914)\n. In\n1916\nhe published the book\nLeçons de calcul des probabilités\nⓉ\n(\nLessons in probability calculation\n)\nwhich consisted of Emmanuel-Joseph Boudin's lectures at the University of Ghent given between\n1846\nand\n1890\n, together with numerous notes and additions by Mansion. In the Preface to the book, Mansion dedicated the work to his father-in-law, writing:-\nWe dedicate this book to the memory of the eminent man, Alphonse Belpaire\n(1817\n-\n1854)\n, who was the Boudin's advisor at the beginning of his career and to whom we are closely related, as he is the grandfather of our children.\nMansion translated into French mathematical works by\nRiemann\n,\nPlücker\nand\nClebsch\n. He did not restrict himself to translating mathematical texts, however, for he translated works by other famous authors such as Dante into French, publishing\nLa Divine Comédie\nⓉ\n(\nThe Divine Comedy\n)\nin\n1887\n. He wrote on the history of Greek mathematics and on many mathematicians including:\nHermite\n,\nAbel\n,\nde la Vallée Poussin\n,\nSaccheri\n,\nLobachevsky\n,\nde Tilly\n,\nPoincaré\n,\nCopernicus\n,\nGalileo\n,\nKepler\n,\nDescartes\n,\nHuygens\n,\nLeibniz\n,\nNewton\n,\nd'Alembert\n,\nEuler\n,\nLaplace\n,\nAmpère\n,\nFaraday\n,\nQuetelet\n,\nLord Kelvin\n, and\nHelmholtz\n. He also wrote on the history of physics and on Greek astronomy in\nNote sur le caractère géométrique de l'ancienne astronomie\nⓉ\n(\nNote on the geometric nature of ancient astronomy\n)\n(1899)\n. Being a narrow-minded man with highly orthodox Roman Catholic views, his evaluation of the work of authors such as\nCopernicus\nand\nGalileo\nwas somewhat biased and indeed many would consider his writings on these authors as intended to justify the views of the Roman Catholic Church.\nDespite the rather critical tone of these comments we should point out that, as the reader will have already observed, Mansion was highly productive. When Alphonse Demoulin wrote the obituary of Mansion\n[\n3\n]\n(\npublished in\n1929)\nhe included a list of\n349\nof his works although in fact the list contains many papers with the same title published in parts over many years which each appear as a single item. Nor were these works merely of local interest, for many were considered important enough to be translated into German or to be republished in foreign publications. Demoulin, who was a student of Mansion's and wrote a doctoral dissertation\nSur l'application d'une méthode vectorielle à l'étude de divers systèmes de droites\n(\ncomplexes, congruences, surfaces réglées\n)\nⓉ\n(\nOn the application of a vector method to the study of various straight systems\n(\ncomplexes, congruences, ruled surfaces\n)\n)\n(1890)\nunder his supervision, is full of praise for his teacher\n[\n3\n]\n:-\nMansion was an outstanding teacher. His lessons, clear and modern, illustrated with historical references which he filled effortlessly with the treasures of his erudition, were a real treat for his listeners.\nAmong the honours which Mansion received was election to the\nRoyal Belgium Academy of Science\n. Elected as a corresponding member in\n1882\n, he became a full member in\n1887\n. He was further honoured by being made president of the Academy in\n1903\n, giving a particularly influential presidential address on the theory of probability. He was also a member of many other societies and academies such as the Royal Society of Sciences of Liège, the Mathematical Society of Amsterdam, and the\nAccademia Pontificia dei Nuovi Lincei\nin Rome. He was a founder member of the Brussels Scientific Society."
}