{
  "nome_completo": "Paul Charles William Davies",
  "nome_curto": "Paul Davies",
  "ano_nascimento": "1946",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davies_Paul/",
  "lugar_nascimento": "London, England",
  "lugar_morte": null,
  "biografia": "Paul Davies\n's parents were Hugh Augustus Robert Davies and Pearl Vera Davies. He was educated at Woodhouse Grammar School\n(\nnow Woodhouse College\n)\nin North Finchley, a district towards the north side of Greater London. Margaret Thatcher became the Member of Parliament for Finchley in\n1959\n(\nshe became Prime Minister of Britain twenty years later\n)\n, and she presented Paul with a copy of\nNorton's Star Atlas\nfor an outstanding performance in his O level examinations at the\n1962\nSpeech Day at the school. This, Davies writes, was highly significant since\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\n... I can trace my own decision to become a scientist to more or less that event.\nFrom Woodhouse Grammar School, Paul went to University College, London, where he was awarded a B.Sc. with\n1\nst\nClass Honours in\n1967\n. He continued to study at University College undertaking research supervised by Michael Seaton and Sigurd Zienau. He was awarded a Ph.D. for his thesis\nContributions to Theoretical Physics:\n(\ni\n)\nRadiation Damping in the Optical Continuum\n(\nii\n)\nA Quantum Theory of Wheeler-\nFeynman\nElectrodynamics\nin\n1970\n. Following the award of his doctorate, he spent two years,\n1970\n-\n72\n, as a Research Fellow at the Institute of Theoretical Astronomy at the University of Cambridge working with\nFred Hoyle\n. Describing his early research, Davies writes\n[\n3\n]\n:-\nI began work in the field of atomic astrophysics, and worked on the problem of di-electronic recombination in the solar corona. I then moved into cosmology, and the theory of black holes, especially their quantum and thermodynamic properties.\nOn\n28\nJuly\n1972\n, Davies married Susan Vivien Corti Woodcock; they had three daughters and one son. Later in\n1972\nhe was took up a post as Lecturer in Applied Mathematics at King's College, London. He held this lectureship for eight years. During these years he published many important papers including:\n(\nwith Stephen A Fulling\n)\nRadiation from a moving mirror in two dimensional space-time: conformal anomaly\n(1976)\nwhich gives a two-dimensional model of particle production by gravitational fields;\nQuantum vacuum stress without regularization in two-dimensional space-time\n(1977)\nwhich Davies summarises as follows:-\nIt is proved that there is a unique conserved stress tensor possessing a local trace, in the two-dimensional quantum theory of massless scalar and spinor fields propagating in a curved space-time;\n(\nwith T S Bunch\n)\nCovariant point-splitting regularization for a scalar quantum field in a Robertson-Walker universe with spatial curvature\n(1977)\nwhich investigates the vacuum stress tensor for a massless scalar quantum field in the background space-time of a spatially flat\nRobertson\n-\nWalker\nuniverse, and that for a massive field in the special case of the\nEinstein\nuniverse; and\n(\nwith Stephen A Fulling\n)\nQuantum vacuum energy in two dimensional space-times\n(1977)\nwhich, the authors write:-\n... presents in detail the renormalization theory of the energy-momentum tensor of a two-dimensional massless scalar field which has been used elsewhere to study the local physics in a model of black hole evaporation.\nIn\n1974\nDavies published a major monograph\nThe physics of time asymmetry\n. This, writes Richard Sigal in a review of the reprint of\n1977\n, is:-\n... a clear and well referenced introduction to the time asymmetries found in physical processes. Although probably aimed at the professional physicist, this book is self-contained, concisely reviewing all concepts necessary for the arguments and as such should be accessible to others interested in the fundamental question of the \"arrow of time\". The author discusses in turn the asymmetries found in thermodynamics, cosmology, electromagnetic theory and quantum mechanics.\nMuch of Davies's work during his time at King's College appears in his\n1982\nmonograph\nQuantum fields in curved space\nwritten with Nicholas D Birrell who wrote his thesis\nThe Application of Quantum Field Theory to Cosmology and Astrophysics\n(1979)\nwhile being advised by Davies. In\n1980\nDavies was named Professor of Theoretical Physics at the University of Newcastle upon Tyne. He held this position for ten years during which time, in addition to significant research articles, he published many excellent popular science books showing his outstanding abilities as a communicator. Before moving to Newcastle, he had already published books such as\nThe Runaway Universe\n(1977)\n,\nThe Forces of Nature\n(1979)\n, and\nOther Worlds\n(1980)\n. Examples of the books he published while holding the chair at Newcastle are:\nThe Edge of Infinity\n(1981)\n;\nThe Accidental Universe\n(1982)\n;\nGod and the New Physics\n(1983)\n;\nSuperforce\n(1984)\n;\nQuantum Mechanics\n(1984)\n,\n(\nwith Julian R Brown\n)\nThe Ghost in the Atom\n(1986)\n;\nFireball\n(1987)\n;\nThe Cosmic Blueprint\n(1987)\n; and\n(\nwith Julian R Brown\n)\nSuperstrings: A Theory of Everything?\n(1988)\n.\nIn\n1990\nDavies went to Australia when appointed as Professor of Mathematical Physics at the University of Adelaide. He held this position until\n1993\nwhen he became Professor of Natural Philosophy at the University of Adelaide. In\n1998\nhe became a Visiting Professor at Imperial College, London, and an Adjunct Professor at the University of Queensland. In\n2001\nhe became Adjunct Professor of Natural Philosophy at the Australian Centre for Astrobiology, Macquarie University, New South Wales having helped to found this Centre. In\n2003\nhe married Pauline, a science broadcaster. He became College Professor and Director of Beyond: Center for Fundamental Concepts in Science, Arizona State University, in\n2006\n. His efforts to communicate the latest ideas in science to a general audience have, particularly over the last ten years, made him a household name\n[\n1\n]\n:-\nHe gives numerous public lectures each year throughout the world and has written twenty-seven books, both popular and specialist works, which have been translated into many languages. He writes regularly for newspapers, journals and magazines in several countries. Among Davies's better-known media productions were a series of\n45\nminute BBC Radio\n3\nscience documentaries. Two of these became successful books and one, 'Desperately Seeking Superstrings', won the Glaxo Science Writers Fellowship. In early\n2000\nhe devised and presented a three-part series for BBC Radio\n4\non the origin of life, entitled 'The Genesis Factor'. His television projects include two six-part Australian series 'The Big Questions' and 'More Big Questions' and a\n2003\nBBC documentary about his work in astrobiology entitled 'The Cradle of Life'.\nDavies has received many honours in addition to those mentioned in the above quotation. For example he had been elected: a fellow of the UK Institute of Physics, a fellow of the Australian Institute of Physics, a fellow of the World Economic Forum, a member of the Royal Literary Society, an honorary member of the Indian Astronomical Society, and an honorary member of the Singapore Institute of Physics. His biography on the World Economic Forum states that he believes that:-\n... science is a cultural as well as an economic activity, and that the gulf between the sciences and the arts is damaging and must be bridged by both sides; focuses on the deep questions of existence, and frequently debates science and religion with senior members of the clergy.\nOther honours received by Davies include: the ABC Eureka Prize\n(1991)\n; the University of New South Wales Press Eureka Prize for the book 'The Mind of God'\n(1992)\n; the Advance Australia Award for outstanding contributions to science\n(1993)\n; and the Templeton Prize received from the John Templeton Foundation\n(1995)\n. This was an extremely prestigious award. Davies writes\n[\n4\n]\n:-\nI was awarded the\n1995\nTempleton Prize for my work on the deeper significance of science. The award was announced at a press conference at The United Nations in New York. The ceremony took place in Westminster Abbey in May\n1995\nin front of an audience of\n700\n, where I delivered a\n30\nminute address describing my personal vision of science and theology. It was followed by a private meeting in Buckingham Palace, where Prince Philip presented me with a cheque, a medal and a certificate. The judges for the\n1995\nprize included President George Bush Sr. and Baroness Margaret Thatcher.\nHis Templeton Prize address, published in\n[\n5\n]\nand\n[\n6\n]\n, is fascinating to read. Here is a brief extract which gives an indication of Davies's beliefs:-\nSome scientists have tried to argue that if only we knew enough about the laws of physics, if we were to discover a final theory that united all the fundamental forces and particles of nature into a single mathematical scheme, then we would find that this superlaw, or theory of everything, would describe the only logically consistent world. In other words, the nature of the physical world would be entirely a consequence of logical and mathematical necessity. There would be no choice about it. I think this is demonstrably wrong. There is not a shred of evidence that the universe is logically necessary. Indeed, as a theoretical physicist I find it rather easy to imagine alternative universes that are logically consistent, and therefore equal contenders for reality.\nCertainly the Templeton Prize was a very major award but Davies continued to receive a host of others including: the Asteroid\n1992\nOG was renamed\n(6870)\nPauldavies\n(1999)\n; he received the\nKelvin\nMedal from the UK Institute of Physics\n(2001)\n; he received the\nMichael Faraday\nPrize from the\nRoyal Society\n(2002)\n; he received the American Institute of Physics Science Writing Award\n(2003)\n; he received the Trotter Prize from Texas A & M University, USA\n(2004)\n; and received an honorary D.Sc. from Macquarie University\n(2006)\n. On\n11\nJune\n2007\nDavies was made a Member of the Order of Australia:-\nFor service to science, particularly the disciplines of physics, cosmology and astrobiology, as an educator, author and public commentator.\nHe lists his hobbies as keeping fit and discussing geographical trivia."
}