{
  "nome_completo": "Paul Albert Gordan",
  "nome_curto": "Paul Gordan",
  "ano_nascimento": "1837",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gordan/",
  "lugar_nascimento": "Breslau, Prussia (now Wrocław, Poland)",
  "lugar_morte": "Erlangen, Germany",
  "biografia": "Paul Gordan\n's father, David Gordan,was a merchant in Breslau, and his mother was Friedericke Friedenthal. Paul was educated in Breslau where he attended the\nGymnasium\n, going on to study at the business school. At this stage Gordan was not heading for an academic career and he worked for several years in banks.\nHe had, however, attended lectures by\nKummer\non\nnumber theory\nat the University of Berlin in\n1855\nand his interest in mathematics was strongly encouraged by N H Schellbach who acted as a private tutor to Gordan. His university career began at the University of Breslau but, as almost all German students did at this time, he undertook part of his university studies at different universities. Moving to Königsberg, Gordan studied under\nJacobi\n, then he moved to Berlin where he began to become interested in problems concerning algebraic equations.\nReturning to the University of Breslau he submitted a dissertation on geodesics of spheroids in\n1862\n. This was a fine piece of work and the dissertation, which employed methods devised by\nLagrange\nand\nJacobi\n, was awarded a prize by the Philosophy Faculty at Breslau.\nAs soon as Gordan had completed his dissertation he went to visit\nRiemann\nat Göttingen. However,\nRiemann\nhad caught a heavy cold which turned to tuberculosis so Gordan's visit was cut short. In\n1863\nClebsch\ninvited Gordan to come to Giessen. He lectured at Giessen, being promoted to associate professor in\n1865\n. In\n1869\n, while still at Giessen, Gordan married Sophie Deurer who was the daughter of the professor of law there.\nThe first work which Gordan and\nClebsch\nworked on in Giessen was the theory of\nabelian functions\n. They jointly wrote the treatise\nTheorie der Abelschen Funktionen\nⓉ\n(\nTheory of Abelian Functions\n)\nwhich was published in\n1866\n. The\nClebsch\n-Gordan coefficients used in spherical harmonics were introduced by them as a result of this cooperation. The topic for which Gordan is most famous is\ninvariant theory\nand\nClebsch\nintroduced him to this topic in\n1868\n. For the rest of his career, although Gordan did not work exclusively on this topic, it would be fair to say that invariant theory dominated his mathematical research.\nFor the next twenty years Gordan tried to prove the finite basis theorem conjecture for\nn\nn\nn\n-ary forms. He made a good start to solving this problem for\nn\n=\n2\nn = 2\nn\n=\n2\nwhen he found a constructive proof of a finite basis for binary forms. The higher cases defeated him, however, and despite introducing more and more complicated computational techniques he failed to construct a finite basis.\nGordan did not undertake the bulk of this work at Giessen, however, for he moved to Erlangen in\n1874\nto become professor of mathematics at the university. When Gordan was appointed\nKlein\nheld the chair of mathematics at Erlangen but he moved in the following year to the Technische Hochschule at Munich. In the year\n1874\n-\n75\nwhen Gordan and\nKlein\nwere together at Erlangen they undertook a joint research project examining\ngroups\nof substitutions of algebraic equations. They investigated the relationship between\nP\nS\nL\n(\n2\n,\n5\n)\nPSL(2,5)\nP\nS\nL\n(\n2\n,\n5\n)\nand equations of degree five. Later Gordan went on to examine the relation between the group\nP\nS\nL\n(\n2\n,\n7\n)\nPSL(2,7)\nP\nS\nL\n(\n2\n,\n7\n)\nand equations of degree seven, then he studied the relation of the group\nA\n6\nA_{6}\nA\n6\n​\nto equations of degree six.\nIn\n1888\nHilbert\nproved the finite basis theorem, only giving an existence proof, not one which allowed the basis to be constructed.\nHilbert\nsubmitted his results to\nMathematische Annalen\nand, since Gordan was the leading world expert on invariant theory, he was asked his opinion of the work. Gordan found\nHilbert\n's revolutionary approach difficult to appreciate and not at all consistent with his ideas of constructive mathematics. After refereeing the paper, he sent his comments to\nKlein\n:-\nThe problem lies not with the form ... but rather much deeper.\nHilbert\nhas scorned to present his thoughts following formal rules, he thinks it suffices that no one contradict his proof ... he is content to think that the importance and correctness of his propositions suffice. ... for a comprehensive work for the Annalen this is insufficient.\nHowever, Hilbert had learnt through his friend\nHurwitz\nabout Gordan's report to\nKlein\n, and he wrote to\nKlein\nin forceful terms:-\n... I am not prepared to alter or delete anything, and regarding this paper, I say with all modesty, that this is my last word so long as no definite and irrefutable objection against my reasoning is raised.\nKlein\nwas in a difficult position. Gordan was recognised as the leading world expert on invariant theory and he was also a close friend of\nKlein\n's. However\nKlein\nrecognised the importance of\nHilbert\n's work and assured him that it would appear in the\nAnnalen\nwithout any changes whatsoever, as indeed it did.\nGordan also worked on\nalgebraic geometry\nand he gave simplified proofs of the\ntranscendence\nof e and π. One rather unsuccessful idea which he embarked on quite late in his career was to apply invariant theory to chemical valences. His work on this, however, came in for criticism from mathematicians such as\nEduard Study\n, and chemists were totally unimpressed with the ideas too. This was rather an unfortunate episode since it resulted in Gordan, who had enjoyed a fine reputation, losing respect from his colleagues.\nThe style of Gordan's mathematics, which lead to his difficulties with\nHilbert\n's basis theorem, is described in\n[\n1\n]\n:-\nThe overall style of Gordan's mathematical work was algorithmic. He shied away from presenting his ideas in informal literary forms. He derived his results computationally, working directly towards the desired goal without offering explanations of the concepts that motivated the work.\nGordan's only doctoral student was\nEmmy Noether\n, the daughter of\nMax Noether\nwho was also at Erlangen during this period. One would have to say that this lack of numbers is more than made up for by the remarkable quality of that one student who would do so much to set algebra on the path it is still on today."
}