{
  "nome_completo": "Pavel Tichy",
  "nome_curto": "Pavel Tichy",
  "ano_nascimento": "1936",
  "ano_morte": "1994",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tichy/",
  "lugar_nascimento": "Brno, Czechoslovakia (now Czech Republic)",
  "lugar_morte": null,
  "biografia": "Pavel Tichy\nstudied philosophy and mathematics at the Charles University in Prague from\n1954\n. He was awarded his doctorate in\n1959\nfor his thesis\nAn Exposition of Gödel's Incompleteness Theorem in the Simple Theory of Types\n(\nCzech\n)\n. He remained at the Charles University, being appointed a lecturer in the Department of Logic in\n1961\n. His first important paper, based on his doctoral thesis,\nAn Exposition of Gödel's Incompletness Proof in the Single Type Theory\nwas published in\n1962\n. His first book\nLogic for Students of Pedagogical Institutes\n(\nCzech\n)\nwas published in the following year. He submitted a thesis\nOn Computability with respect to Theories\n(\nCzech\n)\nfor his Candidates degree in\n1964\n. His paper\nA remark on the concept of problem and solvability\n(1967)\nis written in Czech but contains an English summary by the author. This reads as follows:-\nPavel Materna suggested the following definition of solvability\n(\ncall it M-solvability\n)\n: the mass problem connected with a function f is M-solvable if there exists a partial recursive function g defined wherever f is defined and such that the set\n{\ng\n(\nx\n)\n∣\nf\n(\nx\n)\n}\n\\{g(x) | f (x)\\}\n{\ng\n(\nx\n)\n∣\nf\n(\nx\n)\n}\nis defined\nis the set of all ordered couples of the form\n<\ny\n,\nf\n(\ny\n)\n>\n<y, f (y)>\n<\ny\n,\nf\n(\ny\n)\n>\n.\nIn the present paper it is shown that the property of M-solvability is too weak since it does not secure for f to be a restriction of a partial recursive function\n(\neven if g is total recursive\n)\n.\nTichy's second book,\nThe Logical Structure of Scientific Language\n, was published in Czech in\n1968\n. However, political events which took place that year in Czechoslovakia had a profound effect on his career.\nThere had been problems in the Czech universities from around the time that Tichy became a lecturer. Student unrest occurred throughout the\n1960\ns and this became worse in\n1967\nwhen, dissatisfied with the conditions in their universities, students took to the streets where they were met with police brutality. Academics also began to question why no opposition to the government was allowed. Opposition to the Soviet domination within the government led to reforms during\n1968\n. This in turn led to Soviet troops invading the country. Before the Soviet invasion Tichy had received an invitation from the University of Exeter in England and, although he had not left Czechoslovakia when the invasion took place, nevertheless he was later allowed to leave the country. He spent the two years\n1968\n-\n70\nas a Research Fellow in the Department of Philosophy at Exeter. During these years he was tried in his absence in Czechoslovakia by the Socialist Republic and sentenced to five years hard labour. Not surprisingly he chose not to return to serve his sentence and, in\n1970\n, emigrated with his family to New Zealand. He was married to Jindra, and they had two children. He was awarded a Ph.D. by the University of Exeter in\n1971\nfor his thesis\nContributions to the Theory of Postulate Systems\n.\nTichy was appointed as Senior Lecturer in the Department of Philosophy at the University of Otago in Dunedin, New Zealand, in\n1971\n. He spent the academic year\n1976\n-\n1977\nas an Andrew Mellon Postdoctoral Fellow in the Department of Philosophy at the University of Pittsburgh in the United States. Returning to his position in Otago, he was promoted to Associate Professor in\n1978\nand then to full professor in\n1981\n. The political situation in Czechoslovakia eventually changed. Opposition to the Czechoslovak communist regime in the\n1989\nVelvet Revolution brought about its peaceful demise. Tichy was now in a position to return to his native country. In\n1993\nhe was offered the position of Head of the Department of Logic at the Faculty of Philosophy and Arts in the Charles University of Prague. He accepted the position and was due to take up his duties in\n1995\n. However, he died in an accident in Dunedin in October\n1994\nbefore he was able to return to Prague.\nLet us mention briefly some of Tichy's works. He published\nIntension in terms of Turing machines\n(1969)\nwhich is an interesting attempt to analyse semantical notions as sense and analyticity using a procedure given in terms of a\nTuring\nmachine. To do this he states that having a concept is equivalent to there being a procedure to determine whether an individual falls under the concept.\nSynthetic components of infinite classes of postulates\n(1971)\nextends, in certain cases, the fact that a theory with finitely many postulates can be broken into a\nRamsey\n(\nsynthetic\n)\npart and an analytic part to theories with infinitely many postulates. Other papers include\nWhat do we talk about?\n(1975)\n,\nVerisimilitude redefined\n(1976)\n,\nA new theory of subjunctive conditionals\n(1978)\n,\nThe transiency of truth\n(1980)\n, and\nConstructions\n(1986)\n. Perhaps his most important work was the book\nThe foundations of Frege's logic\n(1988)\n. W Park, reviewing this book, writes:-\nThis book is not an introduction to\nFrege\n's general philosophy, or a running commentary on\nFrege\n's work, or a polemic against recent commentators on\nFrege\n, or an attempt to give\nFrege\na place in the history of logic and philosophy. The author is interested in any project that tries to preserve and in some way continue\nFrege\n's program. As a result, the author discusses a wide range of living philosophical issues in the latter half of his book:\nChurch\n's logic of sense and denotation, Montague's intensional logic,\nGentzen\n's sequent calculus, and\nHilbert\n's formal axiomatics, to name a few. So, in an important sense, this is not so much a study of\nFrege\nas a record of the author's own philosophy developed in\nFrege\n's spirit. Every page of this book has some interesting ideas to think about. Even where the most notorious problem is dealt with, the author's exposition is always lucid and clear.\nHolster, in\n[\n3\n]\n, writes:-\nTichy was a highly original philosopher, semanticist, and logician. Perhaps his most enduring claim to fame lies in his theory called Transparent Intensional Logic, the culmination of his extensive work on semantics and logic.\nOn the cover of\n[\n1\n]\n,\nPavel Tichy's Collected Papers in Logic and Philosophy\n, this appreciation of Tichy's work is given:-\nTichy was an original and gifted logician and philosopher of language. He developed what he called Transparent Intensional Logic, a semantic theory within which to analyse both natural and artificial languages. This theory is devoted to the central problem of saying exactly what it is that we learn, know and can communicate when we come to understand what a sentence means. The theory remains one of the most inspiring and controversial doctrines of contemporary philosophical logic, attracting passionate defenders and equally fierce opponents."
}