{
  "nome_completo": "Percy Alexander MacMahon",
  "nome_curto": "Percy MacMahon",
  "ano_nascimento": "1854",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacMahon/",
  "lugar_nascimento": "Sliema, Malta",
  "lugar_morte": "Bognor-Regis, England",
  "biografia": "Percy MacMahon\nwas born into a military family. His father was Brigadier-General P W MacMahon and, it is interesting to note that as a young child he had a fascination with the way that the ammunition was stacked. This early mathematical interest, before he even knew what mathematics was, is typical of many who go on to become leading mathematicians.\nMacMahon was educated at a school in Cheltenham and was always destined for a military career. In February\n1871\nhe entered the Royal Military Academy at Woolwich as a gentleman cadet, and in the following year he became a Lieutenant. After his education at Woolwich, he served in India for five years beginning in\n1873\n; first in Madras\n(\nnow Chennai\n)\n, then Lucknow, then Dinapore\n(\nnow Danapur\n)\n. He was with the Royal Artillery's No\n1\nMountain Battery on the North West Frontier of the British Indian Empire when, on\n9\nAugust\n1877\n, he took ill a few weeks before his unit went into battle. In\n1878\nhe was sent home to England where it took him eighteen months to recover his health.\nPromoted to Captain in\n1881\n, he was appointed as Instructor in Mathematics at the Royal Military Academy in the following year. He held this post until\n1888\nwhen he became Assistant Inspector at the Arsenal. Three years later he was appointed as Instructor in Physics at the Artillery College, being promoted to Professor of Physics there before he retired from the Army in\n1898\n. In fact he had suffered a great disappointment in the previous year when he was a candidate for the Savilian Chair of Geometry at Oxford.\nSylvester\n, who held the Savilian Chair of Geometry, died in March\n1897\n. For three years before that his eyesight had been failing and William Esson, who had been a mathematics tutor at Merton College, had acted as his deputy. MacMahon was a candidate to fill the vacant Savilian Chair, as was Esson, and after Esson was appointed MacMahon wrote to\nSir Joseph Larmor\nexpressing his feelings at losing out to Esson. He claimed, with justification, that Esson was not even worthy of being a candidate let alone being appointed. Esson had no record of mathematical research and even his interests in reforming the teaching of mathematics at Oxford seemed to vanish after his appointment as Savilian professor. One would have to say that MacMahon was fully justified in feeling aggrieved at losing out to Esson.\nBefore he was a candidate for the Savilian Chair of Geometry, MacMahon had been elected a Fellow of the\nRoyal Society\nin\n1890\n. He had joined the\nLondon Mathematical Society\nin\n1883\nand served as its President from\n1894\n-\n96\nbefore taking on a number of different roles. In\n1901\nhe served as President of Section A of the\nBritish Association\nfor its meeting in Glasgow then, from\n1902\nto\n1914\n, he was one of the Secretaries to the\nBritish Association\n. From\n1906\nto\n1920\nhe served as Deputy Warden of the Standards of the Board of Trade.\nHis roles were not only many in number but also varied in nature. He was elected to the\nRoyal Astronomical Society\nin\n1879\n, was its President in\n1917\nand also served on the Council of the Royal Society of Arts. He was appointed as a Governor of Winchester College.\nIt was\nAlfred George Greenhill\nwho taught MacMahon at the Royal Military Academy at Woolwich and\nGreenhill\n's interests at that time had a large influence on MacMahon's early work.\nGreenhill\nwas trying to construct a model of the trajectory of a missile based on experiments which suggested that the resistance varies as the cube of the velocity. In\n1884\nMacMahon calculated a table of values based on\nGreenhill\n's model. He then published his own original work on an extension of Allegret's problem.\nMacMahon then worked on invariants of binary quartic forms, following\nCayley\nand\nSylvester\n. He gave a\n1\n-\n1\ncorrespondence between semi-invariants and symmetric functions which excited both\nCayley\nand\nSylvester\n. In fact\nCayley\nbegan one of his own papers with the words:-\nA very remarkable discovery in the theory of semi-invariants has been recently made by Captain MacMahon ...\nThis study of symmetric functions led MacMahon to study partitions and Latin squares, and for many years he was considered the leading worker in this area. His published values of the number of unrestricted partitions of the first\n200\nintegers which proved extremely useful to\nHardy\nand\nLittlewood\nin their own work on partitions. He gave a Presidential Address to the\nLondon Mathematical Society\non combinatorial analysis in\n1894\n. MacMahon wrote a two volume treatise\nCombinatory analysis\n(\nvolume one in\n1915\nand the second volume in the following year\n)\nwhich has become a classic. He wrote\nAn introduction to combinatory analysis\nin\n1920\n. In\n1921\nhe wrote\nNew Mathematical Pastimes\n, a book on mathematical recreations. This book shows another of the topics which fascinated MacMahon, namely the construction of patterns which can be repeated to fill the plane. However he wrote in the Preface:-\nIt has not been found possible to produce the book in colour ...\nwhich greatly saddened him.\nMacMahon was well respected in his day. For example he was described by a Member of Parliament in\n1909\nas:-\n... one of the leading mathematicians of our day.\nHe was an accomplished billiard player and a congenial host. In\n[\n2\n]\n89\nof his publications are listed.\nBaker\n, in\n[\n2\n]\n, describes his personality:-\nHis absorption in the mathematical problems he was considering, which was noticeable in his Woolwich days, became more pronounced in later life; but another trait, also noticeable at Woolwich, was manifest to the end, namely, his formal kind courtesy towards all with whom he had dealings; and he had always a desire to know the names of the more distinguished younger mathematicians, and to get some idea of the work they were doing. Many of his friends will always remember his personal cordiality, in which he was so ably assisted by his wife.\nMacMahon received many honours. In particular he was awarded honorary degrees by Trinity College, Dublin\n(1897)\n, Cambridge\n(1904)\n, Aberdeen\n(1911)\nand St Andrews\n(1911)\n. He also won numerous medals: the Royal Medal of the\nRoyal Society\n(1900)\n, the\nSylvester\nMedal of the\nRoyal Society\n(1919)\n, and the\nDe Morgan\nMedal from the\nLondon Mathematical Society\n(1923)\n."
}