{
  "nome_completo": "Peter Turner",
  "nome_curto": "Peter Turner",
  "ano_nascimento": "1586",
  "ano_morte": "1652",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Turner/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Southwark, London, England",
  "biografia": "Peter Turner\n's parents were Pascha Parry and Peter Turner. He was educated at Oxford matriculating at St Mary Hall on\n31\nOctober\n1600\n, then moving to Christ Church from where he graduated with a B.A. on\n27\nJune\n1605\n. Turner became a fellow of Merton College, Oxford in\n1607\n, holding the fellowship until\n1648\n. In\n1620\nhe succeeded\nBriggs\nfirst to the chair of geometry at Gresham College in London, then, in\n1630\n, to the Savilian chair of Geometry at Oxford\n[\n2\n]\n:-\nIn\n1629\n, at Archbishop Laud's request, he drew up the Caroline cycle to regulate the election of proctors from the various colleges. About the same date he also served on a committee established to revise the university statutes.\nEngland had been governed by King Charles I from around\n1629\nwithout parliament being called, but when he needed to raise money to fight the Scots after being defeated by them in\n1639\nhe decided to summon Parliament in April\n1640\n. After a second defeat by the Scots in August\n1640\nhe again summoned Parliament in November\n1640\n. Tensions rapidly rose between the King and Parliament, and late in\n1641\nboth sides began to enlist troops. Sir John Byron began to enlist troops to support the King and Turner, a staunch Royalist, was one of the first to join Sir John Byron. The King moved to Oxford, setting up his court in Christ Church, while London was controlled by Parliament. There were initial skirmishes but the Civil War began in earnest with the Battle of Edgehill near Warwick in November\n1643\n. Turner had been taken prisoner by the Parliamentary forces in one of the skirmishes and taken to London where he was imprisoned in Southwark. However in\n1643\nthere was an exchange of prisoners between Parliament's side and the King's side and Turner was allowed to return to join the King in Oxford.\nThe King largely had the best of the military exchanges in\n1644\nbut the tide changed in\n1645\nwhen the King was defeated at the Battle of Naseby. The success of Cromwell for the Parliamentary side was a decisive factor and the King suffered further defeats during the rest of\n1645\n. By the spring of\n1646\nOxford was surrounded by Parliament's forces but the King escaped and joined the Scottish covenanters. They handed him over to Parliament in\n1647\nand by\n1648\nParliament was totally in control of the country. On\n9\nNovember\n1648\nrepresentatives of Parliament removed Turner from his fellowship at Merton and from the Savilian chair of Geometry. He had strongly supported the Royalist cause during the Civil War and served in a military capacity from\n1641\nso there was no way that Parliament was going to allow him to continue to hold these influential positions. With no means of financial support, Turner went to live with his sister in Southwark. She had married a brewer named Wats but her husband had died. He lived out his final years in total poverty.\nTurner's quality as a mathematician cannot be judged as he left no mathematical publications but we know he wrote very stylish Latin! One might reasonably ask how someone who left behind no evidence of mathematical ability came to hold two of the major mathematical chairs in England. It appears mainly due to William Laud, archbishop of Canterbury\n(1633\n-\n45)\nand religious adviser to King Charles I. Laud became president of St John's, Oxford, in\n1611\nand then chancellor in\n1629\n. Laud set up a committee which produced the Laudian statutes, new endowments and new buildings in Oxford. Turner was a highly active member of this committee and so came to Laud's notice. Through Laud, Turner gained the appointment to the Savilian chair of Geometry at Oxford. Wood writes in\n[\n5\n]\nthat Turner was:-\n... a most exact latinist and Grecian, was well skilled in the Hebrew and Arabic, was an accomplished mathematician, was excellently well read in the fathers and councils, a most curious critic, a politician, and what not ... He wrote many admirable things, but being too curious and critical, he could never finish them according to his mind, and therefore cancelled them ...\nPerhaps the fairest summing up is by Adamson\n[\n3\n]\nwho describes Turner as:-\n... more obviously a Royalist and an Anglican than an academic of any sort."
}