{
  "nome_completo": "Philip Kelland",
  "nome_curto": "Philip Kelland",
  "ano_nascimento": "1808",
  "ano_morte": "1879",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kelland/",
  "lugar_nascimento": "Dunster, Somerset, England",
  "lugar_morte": "Bridge of Allen, Stirlingshire, Scotland",
  "biografia": "Philip Kelland\nwas the son of the Rev. Phillip Kelland\n(\ndied\n1847)\n, curate of Dunster, Somerset and then rector of Landcross, Devon. He studied at Queens' College, Cambridge and was coached privately by\nWilliam Hopkins\n, graduating in\n1834\nas senior\nwrangler\nand first Smith's prizeman. Kelland was ordained in the Church of England and was a fellow of Queens' College during\n1834\n-\n38\n. In\n1838\nhe was appointed Professor of Mathematics at Edinburgh University in succession to\nWilliam Wallace\n. He was the first English-born and wholly English-educated holder of that chair: the unsuccessful applicants included the Scots\nDuncan F Gregory\n,\nEdward Sang\nand\nJohn Scott Russell\n.\nIn Edinburgh, Kelland joined with James D Forbes, the Professor of Natural Philosophy, in supporting reforms of the Scottish university system. According to A. Grant,\nhe came to know the Scottish Universities better even than do Scotsmen themselves\n. He was an effective reformer who won the respect of his colleagues, and a successful and popular teacher who gained the affection of his students. One of his students, the writer Robert Louis Stevenson, wrote kindly that:-\n... for all his silver hair and worn face, he was not truly old; and he had too much of the unrest and petulant fire of youth, and too much invincible innocence of mind, to play the veteran well ... as I still fancy I behold him frisking actively about the platform, pointer in hand, that which I seem to see most clearly is the way his glasses glittered with affection.\nFor many years, Kelland served as secretary of the Senatus of Edinburgh University. He was elected FRS in\n1838\nand FRSE in\n1839\n. He was President of the\nRoyal Society of Edinburgh\nduring\n1878\n-\n79\n, dying in office. He was also active in the Edinburgh Society of Arts, a member of the Board of Visitors of the Edinburgh Observatory, an examiner for several of Edinburgh's schools and colleges, and a founder and actuarial adviser of the Life Association of Scotland. For the last-mentioned, he toured Canada and the U.S.A., and published an account of his travels entitled\nTransatlantic Sketches\n. In addition to his university duties, he gave mathematical lectures to the Edinburgh Ladies' Educational Association, and he took Sunday services in some of Edinburgh's Episcopal churches.\n(\nOne obituarist records that\nPreaching, however, was ... one of the few accomplishments in which he did not excel\n.\n)\nHe was twice married, first to a Miss Pilkington of Dublin, and then to a Miss Boswell of Wardie. He was survived by his widow, three sons and two daughters.\nHis early research work, undertaken at Cambridge, was influenced by\nFourier\nand\nCauchy\n. This is described in his\nTheory of Heat\n(1837\n,\n1842)\nand in some papers; but this work turned out to be based on unsound principles. In all,\n28\npapers are listed in the\nRoyal Society Catalogue of Scientific Papers\n: these are mainly on heat, light and water waves. His theoretical work on water waves\n(1840\n,\n1844)\n, published in\nTrans. Roy. Soc. Edin\n., attempted to explain aspects of the important experiments of\nJohn Scott Russell\n, then being carried out near Edinburgh. This work, though flawed in some respects, anticipated some of the results later obtained more convincingly by\nGeorge Gabriel Stokes\n. He wrote analytical papers on\nGeneral Differentiation\n(1839)\n, and\nDifferential Equations\n(1853)\n, and gave a geometrical\nTheory of Parallels\noutlining a version of non-Euclidean geometry. Kelland produced a much-revised edition of\nJohn Playfair\n's\nElements of Geometry\nand a successful textbook of\nAlgebra\n. He wrote on the reform of the Scottish Universities, and edited the collected works of Thomas Young. Late in life, he collaborated with\nPeter Guthrie Tait\non an\nIntroduction to Quaternions\n.\nThough not a research mathematician of the highest rank, Kelland had a great influence on the development of education in Scotland, and he attained a high standard of mathematical instruction."
}