{
  "nome_completo": "Philip Franklin",
  "nome_curto": "Philip Franklin",
  "ano_nascimento": "1898",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Franklin/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Belmont, Massachusetts, USA",
  "biografia": "Philip Franklin\n's parents were Benjamin Franklin and Isabelle Phelps. Philip attended the College of the City of New York receiving his B.S. in\n1918\n, the year after\nEmil Post\n. While still an undergraduate, Franklin was taking part in published discussions in\nThe American Mathematical Monthly\n, his contribution to the Discussion:\nRelating to the Real Locus Defined by the Equation x\ny\n= y\nx\nappearing in March\n1917\n. Another paper published in\nThe American Mathematical Monthly\nin April\n1919\nwas\nSome Geometrical Relations of the Plane, Sphere, and Tetrahedron\nwhich was probably submitted while he was still at the College of the City of New York since he gives that address. The paper begins with the following paragraph indicating the idea behind it:-\nProfessor\nChrystal\nhas remarked that mathematical works should be read backwards as well as forwards, i.e., advanced notions of mathematics often throw light on elementary problems. While this \"back-tracking\" is frequently brought out in analysis, it is seldom emphasised in connection with plane and solid geometry.\nAfter graduating, Franklin spent a year at the U.S. Army Proving Grounds in Aberdeen, Maryland. This was to have a very considerable influence on Franklin, mainly because he met and became friendly with\nNorbert Wiener\n. In\n[\n2\n]\nWiener\nwrites:-\nI shared a roughly boarded compartment in the civilian barracks with Philip Franklin ... and with Bennington Gill of the College of the City of New York. ... Franklin and Gill, nineteen and thus considerably younger than I, were my particular cronies. When we were not working on the noisy hand-computing machines, which we knew as \"crashers,\" we were playing bridge together after hours using the same computing machines to record our scores. Sometimes we played chess or a newly devised three-handed variant of it on a board made of a piece of jump-screen, or risked the dangers of burning smokeless powder or TNT. We went swimming together in the tepid, brackish waters of Chesapeake Bay, or took walks in the woods amid a flora that was too southern to be familiar to us. I remember the pawpaws and their exotic tropical manner of growing their fruits directly from the tree trunk. Whatever we did, we always talked mathematics. Much of our talk led to no immediate research. I remember some half-baked ideas about the geometry of Pfaffians ... I cannot remember all the other subjects we discussed, but I am sure that this opportunity to live for a protracted period with mathematics and mathematicians greatly contributed to the devotion of all of us to our science.\nWhile he was in the Ordnance Department of the Aberdeen Proving Grounds, Franklin submitted\nCalculation of the Complex Zeros of the Function P\n(\nz\n)\nComplementary to the Incomplete Gamma\nFunction\nto the\nAnnals of Mathematics\n; it was published in September\n1919\n. Franklin had already presented the paper on\n26\nApril\n1919\nat a meeting of the\nAmerican Mathematical Society\nheld at New York City. From the Aberdeen Proving Grounds, he went to Princeton University to undertake doctoral studies. He was awarded his Ph.D. in\n1921\nfor a thesis\nThe Four Color Problem\nwritten under\nOswald Veblen\n's supervision. On completing his doctorate Franklin remained at Princeton where he was an Instructor in Mathematics during\n1921\n-\n22\n. While at Princeton, Franklin submitted a number of papers on widely different topics which were published in\n1921\nand\n1922\n. He published:\nGeneralized Conjugate Matrices\n(1921)\nand\n(\nwith\nOswald Veblen\n)\nOn Matrices Whose Elements Are Integers\n(1921)\nboth in the\nAnnals of Mathematics\n;\nAn Arithmetical Perpetual Calendar\n(1921)\nand\nOn Curves Whose Evolutes are Similar Curves\n(1921)\nin the\nAmerican Mathematical Monthly\n;\nThe Meaning of Rotation in the Special Theory of Relativity\n(1922)\nin the\nProceedings\nof the\nNational Academy of Sciences\nof the United States of America; and\nThe Four Color Problem\n(1922)\nin the\nAmerican Journal of Mathematics\n. This last mentioned paper contained results from his doctoral thesis. In it he listed six properties which must be satisfied by a map with a minimal number of regions which cannot be four-coloured. His two main results were the first proof that all planar graphs with at most\n25\nvertices can be four-coloured and that there exists a map with\n42\nregions which can be four-coloured yet it satisfies all six properties given for a graph which cannot be four-coloured.\nAfter his year as an instructor at Princeton, in\n1922\nFranklin went to Harvard University where he was appointed a\nBenjamin Peirce\nInstructor. We have not yet mentioned one important outcome of Franklin's time at the Aberdeen Proving Grounds. His friendship with\nNorbert Wiener\nled to his meeting\nWiener\n's sister Constance who, like Franklin, was born in\n1898\n. They married on\n14\nJune\n1924\nand had three children, David, Janet\n(\nwho married Vaclav E Benes\n)\n, and Hope\n(\nwho married Barrett O'Neill\n)\n. In\n1924\nFranklin was appointed Instructor in Mathematics at the Massachusetts Institute of Technology. He was to remain at MIT, being promoted to assistant professor in\n1925\n. Then, during\n1927\n-\n28\nhe held a Guggenheim Fellowship, before being promoted to associate professor in\n1930\nand full professor seven years later. He spent\n1935\n-\n36\nundertaking research at the Institute for Advanced Study at Princeton and undertook foreign travel. In\n1948\nhe lectured on mathematical physics at Harvard University.\nWe have already looked at the titles of some of Franklin's papers up to\n1922\n. Let us record a few later highlights. In\n1926\n, in the paper\nApproximations to Topological Transformations\nwritten in collaboration with his brother-in-law\nNorbert Wiener\n, it is proved that every continuous one-to-one mapping of a two-dimensional region of finite connectivity may be approximated as closely as required by an analytic one-to-one mapping. In\n1928\nhe described an orthonormal basis for\nL\n(\n[\n0\n,\n1\n]\n)\nL([0,1])\nL\n(\n[\n0\n,\n1\n]\n)\nconsisting of continuous functions. This is now known as \"Franklin's system\". In\nA Step-Polygon of a Denumerable Infinity of Sides which Bounds No Finite Area\n(1933)\n, written in collaboration with\nJesse Douglas\n, the authors gave an explicit construction for functions which had been shown to exist by\nJesse Douglas\nin his solution of\nPlateau\n's problem in his paper published in\n1931\n(\nfor which he received a\nFields Medal\n)\n. In\nA Six Color Problem\n(1934)\nFranklin gave a\n12\n-vertex cubic graph whose embedding into the\nKlein\nbottle provides the only known counter-example to the\nHeawood\nconjecture.\nHowever, he is best known for textbooks he published on calculus,\ndifferential equations\n, complex variable and\nFourier series\n. In particular he wrote\nDifferential equations for electrical engineers\n(1933)\n,\nTreatise on advanced calculus\n(1940)\n,\nThe four color problem\n(1941)\n,\nMethods of advanced calculus\n(1944)\n,\nFourier\nmethods\n(1949)\n,\nDifferential and integral calculus\n(1953)\n,\nFunctions of a complex variable\n(1958)\nand\nCompact calculus\n(1963)\n.\nExtracts from reviews of each of these papers can he seen at\nTHIS LINK\nwhich give a good flavour of the different styles of book that Franklin wrote, all with great success.\nLet us here quote from\nRichard Courant\n's review of\nA Treatise on Advanced Calculus\n[\n6\n]\n:-\nRigour, whatever this word may mean, was one of the great mathematical achievements of the nineteenth century. Only gradually has this tendency penetrated into textbooks. The first great work of this kind,\nJordan\n's \"Cours d'analyse,\" was followed by many others, of which\nHardy\n's \"Pure Mathematics\" seems to be the foremost in English. Franklin's book is an admirable attempt on a much broader scale to combine rigour with completeness in a volume of modest size.\nErnst Hellinger\n, reviewing the same textbook by Franklin, writes\n[\n11\n]\n:-\nThis book is an extraordinarily satisfactory addition to the literature of advanced calculus. This text is indeed a treatise which covers completely the infinitesimal calculus and includes much prerequisite algebra and analysis\n(\nand most other concepts\n)\nthat are needed for geometric and physical applications. The theorems and proofs are given with utmost precision and completeness, and the reader will never have need of another text for the material that is treated here.\nFour years after publishing this rigorous text, Franklin published another text\nMethods of advanced calculus\non similar material but now with very different students in mind. Morris Marden contrasts the two different style books in\n[\n14\n]\n:-\nThe two books are in some respects different as to content, but in all respects different as to point of view. ... While the first book was a sort of \"cours d'Analyse,\" the new book ... has the purpose of serving the needs of prospective engineers, physicists, and others who may regard mathematics primarily as a tool. ... the new volume may be regarded as one of the best textbooks now available for any advanced calculus course which is intended to be a terminal course in mathematics for engineers, physicists and the like.\nIn addition to this impressive collection of books, Franklin was editor of the\nJournal of Mathematics and Physics\nfrom\n1929\n. In\n1943\nhe was honoured by his old College when the College of the City of New York awarded him their Townsend Harris Medal. The Medal was presented on\n13\nNovember at a dinner held in the Hotel Roosevelt. The citation reads:-\nAt various times a member of the faculties of Princeton, Harvard and the Institute for Advanced Study, and now professor of mathematics in the Massachusetts Institute of Technology, your colleagues consider you one of the outstanding mathematicians in the United States. As an editor of 'The Journal of Mathematics and Physics' and the author of studies in algebra and calculus you have made important contributions to scholarship.\nAs a summary of Franklin's contributions we quote\nDirk Struik\nwriting in\n[\n1\n]\n:-\nPhil was an even-tempered, mild, humorous man, \"of almost Mr Chips proportions\", as Dean Harrison said in\n1965\nat his funeral service. His Princeton Ph.D. thesis of\n1922\nwas in the Veblen topology field and a contribution to the four-colour problem. Coming to Harvard first then to MIT he brought a new field to Cambridge. \"Franklin\",\nMarshall Stone\nwrites, \"gave us\n[\nHarvard\n]\nour first systematic introduction to topology.\" In the MIT Journal of\n1933\n-\n34\nhe extended his studies to the six-colour problem for one-sided surfaces. He was well-versed in many fields of geometry, algebra and analysis. In\n1936\nhe lectured before the\nAmerican Mathematical Society\non transcendental numbers. In the early\n30\ns he published with Moore a set of papers on algebraic Pfaffians. Since Franklin brought topology to MIT in his \"analysis situs\" form, and\nWiener\nin its \"point-set-Lebesgue\" form, we see that it came to the Institute through two brothers-in-law. I have always had the feeling that living in the shadow, so to speak, of his overwhelming brother-in-law, cramped his style. At any rate, he devoted much of his time to the writing of eight excellent textbooks ...\nWe should mention Franklin's service to the mathematical community through serving on the Board of Governors of the\nMathematical Association of America\nduring\n1940\n-\n42\nand again during\n1954\n-\n56\n. He was chairman of the Nominating Committee of the Association in\n1949\n-\n50\n. He also served on the Council of the\nAmerican Academy of Arts and Sciences\nin\n1947\n-\n50\n. In\n1950\nhe was one of a\n3\n-man team asked \"to report on ways of discovering and encouraging latent scientific talent in New England.\"\nIn June\n1964\nhe retired but continued to teach part time. He died unexpectedly while recovering from surgery. He was buried in Pawlet, Vermont."
}