{
  "nome_completo": "Friederich Pius Philipp Furtwängler",
  "nome_curto": "Philipp Furtwängler",
  "ano_nascimento": "1869",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Furtwangler/",
  "lugar_nascimento": "Elze, Hanover, Prussia, now Germany",
  "lugar_morte": "Vienna, Austria",
  "biografia": "Philipp Furtwängler\n's parents were Wilhelm Furtwängler\n(1829\n-\n1883)\nand Mathilde Sander\n(\nborn\n1843)\n. Wilhelm was an organ builder as had been his father, the grandfather of the mathematician whose biography is being given, who was also named Philipp Furtwängler\n(1800\n-\n1867)\n. The Furtwängler family contains many famous people in addition to those just mentioned, for example two of the most prominent are the archaeologist Adolf Furtwängler\n(1853\n-\n1907)\nand his son Wilhelm Furtwängler\n(1886\n-\n1954)\n, a famous German conductor who was one of the leading exponents of Romantic music. Wilhelm and Mathilde had two sons, Philipp Furtwängler the subject of this biography born\n1869\nand Wilhelm Furtwängler\n(1875\n-\n1959)\n, who like his father and grandfather built organs.\nFurtwängler attended elementary school in his home town of Elze and then he studied at the Andreanum\nGymnasium\nin Hildesheim. This Gymnasium was the nearest to Elze, with Hildesheim being only about\n12\nkm distant. He graduated from the Gymnasium at Easter\n1889\nand, later that year, he began his study of mathematics at Georg-August University of Göttingen. This was perhaps the best university in the world for mathematics at this time and he was taught by a number of leading mathematicians;\nHeinrich Bürkhardt\n,\nRobert Fricke\n,\nOtto Hölder\n,\nFelix Klein\n,\nArthur Schönflies\nand\nWilhelm Weber\n. In addition to mathematics, which formed his main interest, he also studied courses in physics and chemistry. Furtwängler attended\nFelix Klein\n's number theory course which went on for two semesters. This course particularly interested him and\nKlein\nsuggested that he might undertake research on ternary cubic forms for his doctorate. Furtwängler wrote the thesis\nZur Theorie der in Linearfaktoren zerlegbaren ganzzahlingen ternären kubischen Formen\nⓉ\n(\nOn the theory of integers decomposable into linear factors of ternary cubic forms\n)\nand he was awarded his doctorate by the University of Göttingen for this work in\n1895\n. This thesis was published as a\n64\n-page monograph in\n1896\n. This was not his first publication for he had published\nZur Begründung der Idealtheorie\nⓉ\n(\nIn support of ideal theory\n)\nin\n1895\n. In fact, he had completed his studies at Göttingen in\n1894\nand he spent the academic year\n1894\n-\n95\nas an assistant at the Physics Institute of the Technical University of Darmstadt.\nAt the University of Göttingen, Furtwängler had qualified to teach mathematics, physics, chemistry and mineralogy at secondary schools. However, before beginning secondary school teaching, he spent a year doing voluntary military service in a programme specially designed for those who had undertaken higher education. After this year, he spent two years teaching in schools in Hanover, Norden, a town on the North Sea shore, and Celle which is situated in north-central Germany. The city of Celle is on the Aller River, at the southern edge of the Lüneburger Heide, northeast of Hanover. After this necessary teaching experience to complete his teaching qualifications, in\n1898\nhe was appointed as an assistant at the Geodetic Institute in Potsdam. He was promoted to research associate and remained there until\n1904\n. In this post he carried out, in collaboration with Friedrich Kühnen, measurements of absolute masses and measurements of the gravitational constant at various locations in Silesia. He contributed the article\nDie Mechanik der einfachsten physikalischen Apparate in Versuchsanordnungen\nⓉ\n(\nThe mechanics of the simplest physical apparatus in test arrangements\n)\nto the\nEncyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\nwhich was published in\n1904\n. While undertaking this work, he married Ella Buchwald in\n1903\n; they had one daughter.\nDespite working at the Geodetic Institute in Potsdam, it was number theory which was Furtwängler's main research interest. His\n80\n-page paper\nÜber das Reziprozitätsgesetz der l-ten Potenzreste in alqebraischen Zahlkörpern, wenn l eine ungerade Primzahl bedeutet\nⓉ\n(\nOn the reciprocity of the l-th power residues in algebraic number fields, if l is an odd prime\n)\nwas awarded a prize by the\nGöttingen Academy of Sciences\n. This was a contribution to\nHilbert\n's Ninth Problem, stated in his address at the International Congress of Mathematicians in Paris in\n1900\n.\nDavid Hilbert\npresented the following form of the Ninth Problem in his paper in the conference Proceedings:-\nProof of the most general reciprocity law.\nFor a number field, it is to be proved the most general reciprocity law for the p th power residues, when p denotes an odd prime, and moreover, when p is a power of\n2\nor a power of an odd prime. The law, as well as the means essential to its proof, will, I believe, result from suitably generalizing the theory of the field of the p th roots of unity, developed by me, and any theory of relative quadratic fields.\nFurtwängler continued to attack\nHilbert\n's Ninth Problem in a series of papers:\nAllgemeiner Existenzbeweis für den Klassenkörper eines beliebigen algebraischen Zahlkörpers\nⓉ\n(\nGeneral existence proof for the class field of an arbitrary algebraic number field\n)\n(1907)\n;\nReziprozitätsgesetze für Potenzreste mit Primzahlexponenten in algebraischen Zahlkörpern\nI\nⓉ\n(\nReciprocity laws for power residues with prime exponent in algebraic number I\n)\n,\n(1909)\n;\nReziprozitätsgesetze für Potenzreste mit Primzahlexponenten in algebraischen Zahlkörpern\nII\nⓉ\n(\nReciprocity laws for power residues with prime exponent in algebraic number II\n)\n(1912)\n; and\nReziprozitätsgesetze für Potenzreste mit Primzahlexponenten in algebraischen Zahlkörpern\nIII\nⓉ\n(\nReciprocity laws for power residues with prime exponent in algebraic number III\n)\n,\n(1913)\n.\nLet us return to our description of Furtwängler's career. He had qualified as a secondary school teacher and then worked at the Geodetic Institute in Potsdam but he had never\nhabilitated\n. However, he was appointed as a professor at the Agricultural Academy in Bonn in\n1904\nand worked there for three years before moving to Aachen where he was a professor of mathematics at the Technische Hochschule from\n1907\nto\n1910\n. He then returned to the Agricultural Academy in Bonn as a professor of mathematics where he taught during\n1910\n-\n1912\nwhile at the same time held a lectureship in applied mathematics at the University of Bonn. In\n1912\nhe was appointed as a professor of mathematics at the University of Vienna and he continued to hold this post until he retired in\n1938\n. In this role he worked very hard. Furtwängler came to the Mathematical Institute at\n8\nclock in the morning and held oral examinations and colloquia. From\n10\no'clock he held a one-hour seminar twice weekly. He regularly delivered lectures on differential and integral calculus, on number theory and on algebra. These lectures were very well attended; more than four hundred students attended his lectures but only half of them could get seats in the lecture theatre. This was all the more remarkable since, from\n1916\nhe became progressively more paralysed and lectured from a wheelchair. He lectured without notes and had an assistant who wrote equations on the blackboard. It was Furtwängler's lectures which turned\nKurt Gödel\nfrom physics to mathematics.\nGödel\n, who entered the University of Vienna in\n1922\n, described Furtwängler's lectures as the best he had ever heard. To hear this quality of lectures from someone confined to a wheelchair who was paralysed from the neck down, would make a big impact on any student, but on\nGödel\nwho was very conscious of his own health, it had an even bigger influence.\nFurtwängler was also a member of the examination committee for teaching in secondary schools. This position gave him a major amount of work since he had to hold a very large number of teacher training exams. It is remarkable that someone with his severe disability was able to carry out this high work load which would have seemed too great for a fully able person. He supervised the doctoral dissertations of\n60\nstudents including\nOtto Schreier\nand\nOlga Taussky-Todd\n. The obituary\n[\n4\n]\nlists\n49\nitems by Furtwängler. These include\nÜber das Verhalten der Ideale des Grundkörpers im Klassenkörper\nⓉ\n(\nOn the behavior of the ideals of the base body in the class field\n)\n(1916)\n,\nPunktgitter und Idealtheorie\nⓉ\n(\nLattice of points and ideal theory\n)\n(1921)\n,\nÜber die linearen Mannigfaltigkeiten auf Hyperflächen zweiter Ordnung\nⓉ\n(\nOn linear manifolds on hypersurfaces of the second order\n)\n(1926)\n,\nÜber die simultane Approximation von Irrationalzahlen\n(1927)\n,\nÜber die simultane Approximation von Irrationalzahlen\nⓉ\n(\nOn the simultaneous approximation of irrational numbers\n)\n(1928)\n, and\nÜber affektfreie Gleichungen\nⓉ\n(\nAbout effectively free equations\n)\n(1929)\n.\nPerhaps, to my\n[\nEFR\n]\nmind, his greatest achievement, however, is his proof of the principal ideal theorem which answered a conjecture made by\nDavid Hilbert\n. This was a major unsolved problem which many leading algebraists had failed to solve. When Furtwängler gave his proof he was\n61\nyears old, remarkably old for someone to come up with such a major result. His\n23\n-page paper proving the principal ideal theorem is\nBeweis des Hauptidealsatzes für Klassenkörper algebraischer Zahlkörper\nⓉ\n(\nProof of the principal ideal theorem of the class fields of algebraic number fields\n)\n(1929)\n. For this outstanding work he was awarded the Ernst Albe memorial prize and the medal of the Carl Zeiss Foundation in\n1930\n. It is worth noting that this was only the second time that the Ernst Albe memorial prize had been awarded for work in pure mathematics, the previous occasion being in\n1924\nto\nFelix Klein\n.\nCertainly these prizes were not the first honours to be given to Furtwängler. He was elected a corresponding member of the Academy of Sciences in Vienna in\n1916\nand became a full member in\n1927\n. He was elected a corresponding member of the\nBerlin Academy of Sciences\nin\n1931\n, and a member of the\nGerman Academy of Scientists Leopoldina\nin Halle in\n1939\n. In the same year of\n1939\n, the\n48\nth\nvolume of\nMonatshefte für Mathematik und Physik\nⓉ\n(\nMathematics and physics monthly\n)\nwas dedicated to Furtwängler on the occasion of his\n70\nth\nbirthday.\nFurtwängler's second marriage was in\n1929\nto Emilie Schön. By this time he had been paralysed for over ten years but was still managing to carry out his duties despite being seriously ill. Emilie nursed him through more than ten years in a totally self-sacrificing way and helped him through his severe suffering which she made easier for him to bear. In October\n1938\nFurtwängler's condition forced him to retire from his duties. In January\n1940\nhis health became even worse and everyone realised that he did not have long to live. He survived until May of that year when he suffered a stroke.\nFinally, let us mention that he was writing the article\nAllgemeine Theorie der algebraischen Zahlen\nⓉ\n(\nThe general theory of algebraic numbers\n)\nin\n1938\n, the year in which he was forced to retire. However, his health was too poor to allow him to complete the work which was intended for the\nEnzyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\n. Furtwängler's article was completed by\nMartin Eichler\n,\nHelmut Hasse\nand Wolfram Jehne.\nKenkichi Iwasawa\nwrites in a review of the article, which finally appeared in the\n1953\nedition of the\nEncyclopaedia\n:-\nIt covers that part of\nalgebraic number theory\nwhich is concerned with properties of finite\nalgebraic number fields\nin general; class field theory, the theory of complex multiplications and other special theories on algebraic number fields are to be given in other articles. The material is well prepared and neatly arranged in a relatively small space. The main contents are as follows.\n1\n. The ideal theory of algebraic number fields; methods of\nDedekind\nand\nKronecker\n.\n2\n.\nKummer\n-\nHensel\n's method with valuation theory.\n3\n. The structure of residue-class rings modulo integral ideals.\n4\n. The ramification theory.\n5\n. Ideal classes and units.\n6\n. Decomposable forms and\nKlein\n's lattices.\n7\n. Orders and their conductors.\n8\n.\nArtin\n's conductors and\nArtin\n's\nL\nL\nL\n-functions.\n9\n. Calculation of class numbers by analytic method."
}