{
  "nome_completo": "Pierre Lelong",
  "nome_curto": "Pierre Lelong",
  "ano_nascimento": "1912",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lelong/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Lelong\nparents both lived long lives. We obtain the following information about his parents in\n[\n4\n]\n:-\nHis family was, as he once told me, by tradition atheists for several generations. Like his mother, he felt profoundly Alsacian, but his father was a true Parisian boy with ancestors from the Massif central.\nLelong attended schools in Paris, in particular the Lycée\nBuffon\n. In\n1927\nwhen he was a pupil in the Second C class of the baccalaureate, his headmaster asked him to attend the presentation of the prizes for the Concours Général at a ceremony held in the main amphitheatre of the Sorbonne University. This was the first time that Lelong had heard about this prestigious competition. One of the prize winners was Georges Pompidou, the future President of France, who would go on to become Lelong's friend. In the following year,\n1928\n, Lelong was put forward by his school for the mathematics competition of the Concours Général. He writes\n[\n7\n]\n:-\nThe adventure of the competition as well as giving me the joy of receiving the Mathematics Prize gave me in addition a new happiness, that of being able to solve, after several hours of a difficult test, a problem of a new style, and it was for my young age as a promise of success and future happiness. More than the satisfaction of receiving and celebrating a Prize, this mathematics prize I received then gave extreme value by the originality and interest of the test imposed on the candidate. Without going beyond the syllabus of geometry of the class of 'first C', the problem posed in the competition required candidates to study a very simple surface but extending to infinity; it was generated by the rotation of an unlimited line around another line of our space. During this difficult, beautiful and exciting event, I had, at a very young age, to fight with the only weapons at my disposal namely mathematical proof and logic, and to develop an intuition for our space beyond the too limited view that life daily gives us. In this way, I was forced to go beyond the real world, to build a complement created by the mind, science and reason. This Concours général was therefore for me and my future, more than a meritorious ordeal, it gave me an unforgettable lesson in introducing scientific creation beyond the daily intuition. And I admit that I still regret today that I do not know the author of the problem.\nNot only did Lelong win the first prize in mathematics in the Concours Général in\n1928\n, he also won the first prize in mathematics in\n1929\n. Having prepared to take the entrance examinations for the Grand Écoles at the Lycée Louis-le-Grand in Paris, Lelong entered the École Normale Supérieure in\n1931\n. Georges Pompidou also prepared for entry to the École Normale Supérieure at the Lycée Louis-le-Grand and both entered in the same year, although academically their interests were very different. Lelong attended lectures by\nArnaud Denjoy\nand\nPaul Montel\nand graduated in\n1934\n.\nAfter graduating from the École Normale Supérieure, Lelong began undertaking research advised by\nPaul Montel\n. His first paper\nSur le principe de Lindelöf et les valeurs asymptotiques d'une fonction méromorphe d'ordre fini\nⓉ\n(\nOn the principle of Lindelöf and the asymptotic values\n)\nwas published in\n1937\nand his second paper\nLimitation d'une fonction analytique de deux variables complexes à l'intérieur d'un domaine ayant une surface remarquable\nⓉ\n(\nLimiting an analytic function of two complex variables within a domain with a remarkable surface\n)\nwas published in the following year. In the first of these, Lelong investigates the accuracy of the estimate of the number of direct critical points of the inverse of a meromorphic function\nw\n(\nz\n)\nw(z)\nw\n(\nz\n)\ngiven by\nLars Ahlfors\nin a\n1932\npaper.\nWorld War II began on\n1\nSeptember\n1939\nwith the German invasion of Poland. On\n3\nSeptember France declared war on Germany. On\n19\nOctober\n1939\nthe Centre National de la Recherche Scientifique\n(\nCNRS\n)\nwas founded. Although the outbreak of war played a part in its founding, there had been progress towards setting up the CNRS over many years. Lelong became a researcher at the CRNS from its founding. In May\n1940\nGerman troops invaded Holland, Belgium and Luxemburg moving on to France. German troops entered Paris on\n14\nJune and on\n22\nJune the Franco-German Armistice was signed. This limited the amount of France occupied by German troops and set up a French government in Vichy which cooperated with Germany. Lelong, however, still managed to publish research articles, for example\nSur l'ordre d'une fonction entière de deux variables\nⓉ\n(\nOn the order of an integer function of two variables\n)\n(1940)\n,\nSur l'intégrale de Kronecker appliquée à un système de deux fonctions de deux variables complexes\nⓉ\n(\nOn the Kronecker integral applied to a two-function system of two complex variables\n)\n(1940)\n,\nSur les zéros d'une fonction entière de deux variable\nⓉ\n(\nOn the zeros of an integer function of two variable\n)\n(1940)\n,\nSur les domaines cerclés qui sont domaines naturels d'existence d'une fonction analytique de deux variables complexes\nⓉ\n(\nOn circled domains which are natural domains of existence of an analytic function of two complex variables\n)\n(1941)\n, and\nSur quelques problèmes de la théorie des fonctions de deux variables complexes\nⓉ\n(\nOn some problems of the theory of functions of two complex variables\n)\n(1941)\n.\nIn\n1941\nLelong submitted his Thèse de Doctorat d'État entitled\nSur quelques problèmes de la théorie des fonctions de deux variables complexes\nⓉ\n(\nOn some problems of the theory of the functions of two complex variables\n)\nto the Faculty of Science in Paris for the degree of docteur es sciences mathématiques. He also submitted the minor thesis\nLes continus indécomposables\nⓉ\n(\nthe indecomposable continuous\n)\n. The examining committee was chaired by\nPaul Montel\nwith\nArnaud Denjoy\nand\nGeorges Valiron\nas examiners. Lelong dedicated his thesis \"To my father and to doctors R Gouverneur and L Pollet, surgeon and doctor of Paris hospitals.\" Unfortunately we do not know why he dedicated his thesis to these two doctors. The thesis was approved on\n10\nJuly\n1941\n.\nEven before the award of his Doctorat d'État, Lelong had been appointed as an assistant lecturer at the Faculty of Sciences of Paris in\n1940\n. After two years in this position, he was appointed as a lecturer at the University of Grenoble in\n1942\n. The German invasion of France in\n1940\nhad led to a major change at Grenoble. Louis Néel\n(1904\n-\n2000)\nhad studied at the École Normal Supérieure in Paris from\n1924\nto\n1928\n, where he was appointed lecturer in\n1928\n. In\n1932\nhe obtained the degree of Doctor of Science at the University of Strasbourg, where he was appointed Professor at the Faculty of Science in\n1937\n. The Germans took control of Strasbourg in\n1940\nand Néel's laboratory was moved from Strasbourg to Grenoble and remained there. This resulted in intense scientific activity at the University which Lelong entered into with enthusiasm\n[\n5\n]\n:-\nNéel's laboratory tries to establish links between laboratories and local industries, and Lelong, \"supported by J Peres with whom he had been an assistant in Paris, strives to establish contact with engineers and classify their problems.\"\nRobert Mazet\n(1903\n-\n1991)\noccupied the chair of rational and experimental mechanics at the University of Lille from\n1929\nto\n1944\nwhen he left to become rector in Caen. Lelong was appointed to Lille to fill the vacant chair of rational and experimental mechanics. At Lille he became a colleague of Robert Bossut who was a lecturer, then professor of rational mechanics and mechanics of solids there from\n1942\nto\n1967\n[\n5\n]\n:-\nAppointed to Lille in\n1946\n, Lelong focuses on his research and his students are then Parisian\n(\nFrançois Norguet, for example, who began his studies in Lille, receiving in\n1949\n-\n50\na \"prix de licence\"\n)\n. ... Here is an example of a problem of rational mechanics taught in Lille, about\n1954\n, by Pierre Lelong and Robert Bossut, at the time when Yves Leroy was a student: A 'gouttière' rotates uniformly around its centre of gravity, a ball circulates in its axis, give the movement of the ball.\nWhat is a 'gouttière'? Consider the apparent contour, or outline, of a smoothly embedded surface in\nR\n3\n\\mathbb{R}^{3}\nR\n3\nunder orthogonal projection to a plane. Generically, the only local singularities of the outline are cusps, and cusps can be gained or lost - for example, by varying the direction of projection - only through one of a half-dozen different transitions. These are the familiar lip, beak-to-beak, swallowtail, and butterfly, plus two others: a fusion of the lip and beak-to-beak called the goose or gutter\n(\n\"gouttière''\n)\nand a fusion of the beak-to-beak and swallowtail called the gulls or ruffle\n(\n\"godron''\n)\n.\nPierre Dolbeault writes in\n[\n3\n]\nabout these times:-\nI met Pierre Lelong for the first time, probably in the spring of\n1946\n, at the ENS Garden Party. Although he had already achieved important results on entire functions and multisubharmonic functions and gained experience in university teaching, he behaved cordially, as an elder, but not as a master. That same year, he became a professor at the University of Lille. He started an analysis seminar in Paris with\nGustave Choquet\naround this time. I attended the seminar in\n1950\n-\n51\nand, at the beginning of\n1951\n, I proposed a title of a presentation on a result published in June. I gave a dozen presentations in one or other of these seminars, either on a topic requested or on personal results, until\n1972\n.\nOn\n22\nNovember\n1947\nPierre Lelong married the mathematician\nJacqueline Ferrand\n, a mathematics professor in Caen. Pierre and Jacqueline had four children, Jean, Henri, Françoise and Martine. We note at this point that Pierre Lelong and his wife divorced and he married the mathematician France Fages in\n1976\n. France Fages had published\nCroissance maximale de certaines fonctions plurisousharmoniques positives\nⓉ\n(\nMaximum growth of certain positive multisubharmonic functions\n)\n(1971)\n. After her marriage she published under the name France Lelong.\nIn\n1954\nLelong left Lille and returned to Paris where he was appointed as a professor at the Faculty of Science. Lelong and his wife\nJacqueline Lelong-Ferrand\nboth spent a semester, September-December\n1956\n, at the Institute for Advanced Study at Princeton, USA. We note that the Faculty of Science was divided into several universities in\n1970\nand after that Lelong worked at Paris VI which, in\n1974\n, became the Université Pierre et Marie Curie.\nLelong soon became involved with the French government. Charles de Gaulle\n(1890\n-\n1970)\nbecame President of the Fifth Republic on\n8\nJanuary\n1959\n. The day de Gaulle was appointed he made Pierre Lelong 'Conseiller technique au Secrétariat général de la Présidence de la République'. This meant that Lelong was responsible for scientific research, all levels of education and public health. He held this position until\n1961\nand then became Chairman of the 'Commission de la recherche scientifique du IV-ème plan' from\n1962\nto\n1964\n. Lelong wrote\n(\nsee for example\n[\n7\n]\n)\n:-\nSome describe the first seven years\n(1958\n-\n1965)\nas the golden age of research in France. ... Politics and science have a sense of reality, but they are not the same. The result is, and it became a principle, that General de Gaulle accepted that research activity can only be evaluated as to its proper quality by those who practise it themselves ...\nThe article\n[\n8\n]\nis Lelong's final report of the work of the Commission in which he tries to encourage the politicians to support researchers:-\n... the mechanism of invention is complex, little explored, and, let us not forget it, there is no real research without researchers and the hazards inherent in research. ... One cannot do research without a qualified researcher.\nWe now look briefly at some of the books that Lelong wrote.\n1\n.\nFonctions plurisousharmoniques et formes différentielles positives\nⓉ\n(\nMultisubsharmonic functions and positive differential forms\n)\n(1968)\n. Robert Clifford Gunning writes in a review:-\nThis volume is based on a set of survey lectures by the author\n(\nat the Centro Internazionale Matematico Estivo during the Summer of\n1963)\ncovering plurisubharmonic functions and related topics to which he has contributed notably.\n2\n.\nFonctionnelles analytiques et fonctions entières\nⓉ\n(\nAnalytical Functionality and Integer Functions\n)\n(1968)\n. Carlos Berenstein writes in a review:-\nThese lecture notes are written with great detail and care and, if one disregards the errata - inevitable in this format - they could even be used as a textbook for a graduate course or seminar on the theory of entire functions of several variables.\n3\n.\nIntroduction à l'analyse fonctionnelle. I: Espaces vectoriels topologiques\nⓉ\n(\nIntroduction to Functional Analysis. I: Topological vector spaces\n)\n(1971)\n. These are notes from a course delivered at the Sorbonne.\n4\n.\n(\nwith Lawrence Gruman\n)\nEntire functions of several complex variables\n(1986)\n. Lev Isaakovich Ronkin writes in a review:-\nThe authors give the basic facts of the theory of entire functions of several variables and some of its applications. The book consists of nine chapters and three appendices.\n5\n.\nPositivité dans les espaces complexes et fonctions plurisousharmoniques\nⓉ\n(\nPositivity in complex spaces and multisubharmonic functions\n)\n(1998)\n. Mongi Blel writes in a review:-\nThis book is a collection of previously published works by the author on the theory of closed positive currents and plurisubharmonic functions. It consists of ten articles.\nWe gave information above about Lelong's work for the government in the first half of the\n1960\ns. His government work certainly did not stop there for his friend  Georges Pompidou was Prime Minister of France during\n1962\n-\n1968\n, and President of the Republic during\n1969\n-\n1974\n. Pompidou gave Lelong the task of preparing a budget for all research in the whole of France.\nYum-Tong Siu writes in\n[\n11\n]\nabout his meetings with Lelong:-\nI had the opportunity of meeting Professor Pierre Lelong in person for the first time in the spring of\n1972\nwhen I visited Paris VII for one semester. He was very approachable and humorous. Though at that time I was only a young mathematician, he made me feel completely at ease in our mathematical conversations. Since then I had many occasions to discuss mathematics with him at the meetings of the Lelong-Dolbeault-Skoda Seminar and other mathematics seminars in Paris and in many conferences such as the conference at Poitiers in\n1972\n, the\nAmerican Mathematical Society\n's twenty-third summer institute at Williams College in\n1975\n, and Lelong's seventieth birthday conference at Wimereux in\n1981\n. I greatly enjoyed and benefitted from these conversations. Each time not only did I learn to understand better from his perspective and gain more insight into his work, but I also came away with a deepened interest and greater enthusiasm for his theory of closed positive currents. His passion for the subject was infectious.\nSeán Dineen\nwrites in\n[\n2\n]\nabout his meetings with Lelong:-\nI first met Pierre Lelong during a conference on Several Complex Variables at the University of Maryland in the summer of\n1970\n. ... I was a freshly minted Ph.D. and Pierre was, although I didn't know it at the time, close to sixty and a very important mathematician. I introduced myself, having been instructed to do so by my thesis advisor\nLeopoldo Nachbin\n, and although his English and my French were both, shall we say, laboured, he was friendly and talkative and we managed to communicate and keep communicating, without misunderstanding as far as I am aware, for over thirty years at conferences, meetings and private visits in the US, Brazil, Paris and Dublin. He visited Ireland as a tourist twice and enjoyed the music\n(\nit's different he said\n)\n, the weather\n(\nit's also different\n)\n, the driving\n(\nit's very different\n)\n, the food\n(\nit's unusual\n)\nand the English\n(\nit's just like yours he said\n)\n.\nLet us end with this tribute from Henri Skoda\n[\n11\n]\n:-\nI wish to pay tribute to the memory of Pierre Lelong. One of the best mathematicians of the twentieth century has left us, whose influence will go on for a long time, but who was also an academic deeply wedded to humanistic values and to funding the values of the French Republic."
}