{
  "nome_completo": "Pierre Henri Puiseux",
  "nome_curto": "Pierre Puiseux",
  "ano_nascimento": "1855",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puiseux_Pierre/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Fontenay, Jura, France",
  "biografia": "Pierre Puiseux\nwas the son of\nVictor Alexandre Puiseux\n, who has a biography in this archive, and his wife Laure Louise Fébronie Jannet. Victor and Laure were married at Versailles on\n2\nOctober\n1849\n. Laure was the daughter of Jean-Louis François Jannet\n(1795\n-\n1861)\n, head of the Lycée of Versailles, and Sophie Fébronie Joseph Wallon\n(1811\n-\n1892)\n. Victor and Laure Puiseux had six children: Paul Louis Puiseux\n(\nborn\n18\nFebruary\n1851\n, died aged\n14\non\n6\nJanuary\n1856)\n; Marie Laure Louise Puiseux\n(\nborn\n28\nDecember\n1852\n, died aged\n21\non\n11\nMay\n1874)\n; Fébronie Marie Puiseux\n(\nborn\n20\nJuly\n1853\n, died aged\n18\non\n31\nMarch\n1872)\n; Pierre Henri Puiseux\n(\nborn\n20\nJuly\n1855\n, the subject of this biography\n)\n; André Victor Puiseux\n(\nborn\n11\nSeptember\n1857\n, died aged\n3\nweeks later on\n1\nOctober\n1857)\n; and André Paul Puiseux\n(\nborn\n22\nNovember\n1858\n, died in\n1931)\n. We note that Pierre's mother Laure died on\n2\nDecember\n1858\n, aged\n28\n, as a result of child birth. At this time Pierre was only three years old and perhaps too young to understand what had happened, but he must have felt the intense sadness. Sophie Jannet, Pierre's maternal grandmother, was widowed in\n1861\nand she took a large part in helping\nVictor Puiseux\nbring up his five children. They lived at\n64\nrue de l'Ouest in Paris. Let us refer to the subject of this biography as Pierre\n(\nor Pierre Puiseux\n)\nthroughout, since otherwise there will be confusion with other family members.\nIn the\n1860\ns\nVictor Puiseux\ntook his five children on vacations in the French mountains where they all enjoyed very long walks. Although only a young lad, Pierre loved this time in the country and mountainside. Some years they went to the Alps, some years to the Pyrenees. While on these holidays, Victor Puiseux would write to Sophie Jannet, Pierre's maternal grandmother, and these letters show how grateful he was for her support with his family. Pierre, whose studies were all in Paris, began his school studies at the Lycée Henri IV, then entered the Lycée Saint-Louis in\n1865\n. Augustin Boutan\n(1820\n-\n1900)\n, professor of physics and Headmaster of the Lycée, was a friend of\nVictor Puiseux\n. Another tragedy struck the family soon after Pierre entered the Lycée Saint-Louis when his brother Paul Puiseux died of typhoid fever in January\n1866\n. Pierre was ten years old and losing his older brother must have been devastating.\nSoon after the death of Paul, the family moved to\n81\nBoulevard Saint-Michel, where Sophie Jannet also took an apartment. She died at the age of\n93\nin\n1874\n. In\n1867\n, now with four children,\nVictor Puiseux\nwent for the summer holiday to Switzerland, to the small village of Engelberg, in the Bernese Alps. On\n7\nSeptember\nVictor Puiseux\n, Pierre and his two older sisters, made an ascent of the Titlis, a mountain of\n3240\nmetres. It is remarkable to think that Pierre, only twelve years old at the time, could make such an ascent. We are lucky to have a record of\nVictor Puiseux\n's own description\n(\nsee\n[\n2\n]\n)\n:-\nAwakened before midnight, I called Pierre, Louise and Marie, who rose without being asked. We descend with as little noise as possible, and at the foot of the staircase we find our guides, Leodegard Feierabend and Giuseppe Cattani, each carrying a lantern with one hand, and the other with an axe whose handle serves as a steel-tipped stick; they also provided us with ropes, and each of them has on his back a bag containing provisions. Clouds cover much of the sky; we see only a few stars towards the north. We leave without being reassured about the weather, and after crossing the bridge in front of the village, we begin to climb into the forest.\nSoon they are climbing through rocks and snow:-\nAbout four o'clock we notice a rock which shelters us against the wind and in the crevices of which there is a fairly mild temperature. It is here that we make our first breakfast, above a frightful precipice in which a guide enjoys rolling stones.\nThey continue to climb through difficult terrain:-\nPierre and Marie are tied to the guide who walks at the front. Another rope ties Louise, the second guide and myself, the guide was in the rear and Louise between us. At last we arrive at the critical spot where it is no longer snow that we have under our feet, but a slope of hard ice leading to precipices.\nThey reach the summit, enjoy the scenery, and do not begin their return until midnight, arriving back at their hotel in time for lunch the next day \"a little tired but delighted with our expedition.\"\nOften on such climbs Pierre and his father would stop and sketch the scene before continuing. This experience gave Pierre a life-long passion for mountaineering.\nIn\n1870\n, when Pierre was fifteen years old, the family took their summer holiday in the Pyrenees without André, and on their return in September they stopped at Lectoure, where Augustin Boutan, Pierre's headmaster, had a holiday home. The French army had suffered defeats in the Franco-Prussian war which began on\n19\nJuly and Prussian troops were approaching. Victor Puiseux returned to Paris with his two daughters, leaving Pierre with the wife of Augustin Boutan in Lectoure. Pierre quickly became good friends with the Boutan children. Over the winter, the mathematics teacher at the local Lycée was absent due to the war and Pierre took over teaching mathematics at the school. After the armistice at the end of January\n1871\nPierre returned to Paris and continued with his schooling at the Lycée Saint-Louis. His sister Marie, who had become ill during the Paris siege, died from tuberculosis in March\n1872\n. Around this time his other sister Louise also became ill; she died in May\n1874\n. Remarkably, every summer, including the years when the girls died, Pierre with his brother André and their father, went climbing in the mountains.\nIn\n1875\nPierre sat the entrance examinations in mathematics for the École Normale Supérieure and later that year he began his studies there. However, he also attended lectures at the Sorbonne, for example the attended\nJules Tannery\n's lecture course there in\n1876\n. His passion for mountaineering became even greater and he continued to tackle the hardest peaks every summer. For example, Pierre and André climber the Dard in\n1876\n, Victor, Pierre and André reached the summit of the Chasseforêt on\n1\nSeptember\n1876\n, André and Pierre climber the Labby on\n4\nAugust, and Pierre climbed the Arpont on\n20\nAugust\n1876\n. Pierre's book\n[\n2\n]\nand\n[\n3\n]\ngive details of all his mountaineering exploits.\nHe obtained his aggregation in mathematics in\n1878\nand presented his doctoral thesis\nSur l'accélération séculaire du mouvement de la lune. Suivi de Propositions données par la faculté\nⓉ\n(\nOn the centuries-old acceleration of the motion of the moon. Following proposals of the Faculty\n)\nto the Faculty of Science in\n1879\n. This important work was published in the same year and Pierre was awarded his doctorate. However, the family had always been highly religious and, after the award of his doctorate, Pierre decided to change career completely and study divinity. He wrote to the minister of education on\n29\nOctober\n1879\n[\n9\n]\n:-\n... having entered the École Normale in\n1875\n, I was soon convinced that the path I had taken was not the best one for my tastes and for the nature of my spirit. Wishing to follow an obvious vocation and to serve my country more effectively, I have come to ask you for permission to begin my ecclesiastical studies at the seminary of Saint-Sulpice.\nThe minister replied to the director of the École Normale on\n7\nNovember\n[\n9\n]\n:-\nI have the honour to inform you that I do not put any obstacle to the resolution of M Pierre Puiseux.\nHowever, at this point the family must have put pressure on Pierre to change his mind and to continue to follow a scientific career. Pierre's uncle Léon Puiseux, who was inspector general of primary education, wrote to the director of higher education on\n11\nNovember\n[\n9\n]\n:-\nMy nephew, agreeing to the request of the members of his family, sacrificed what he considered to be his vocation and renounced the resolution he had taken.\nOn\n20\nNovember, Pierre applied for admission to the Paris Observatory as a student-astronomer, and was accepted on\n1\nDecember\n1879\n. He was promoted to assistant astronomer in\n1881\n. He was sent to Fort de France, in Martinique, in\n1882\nfor the observation of the transit of Venus. This was one of ten expeditions organised by the\nAcademy of Sciences\nto observe the transit which took place on\n6\nDecember\n1882\n, other expeditions going to Haiti, Florida, Cape Horn and Mexico. Pierre Puiseux was part of the Martinique expedition headed by\nFelix Tisserand\n(1845\n-\n1896)\nwhich also included\nGuillaume Bigourdan\n. Pierre Puiseux published\nNote sur le passage de Vénus de\n1882\nⓉ\n(\nNote on the passage of Venus of\n1882\n)\nin the\nConnaissance des temps ou des mouvements célestes à l'usage des astronomes et des navigateurs\nⓉ\n(\nKnowledge of celestial times or movements for the use of astronomers and navigators\n)\npublished by the Bureau des longitudes.\nPierre Puiseux married Beatrice Elise Marie Bouvet\n(1861\n-\n1963)\nin Salins on\n21\nJune\n1883\n. Beatrice Bouvet was the daughter of Alfred Bouvet\n(1820\n-\n1900)\nand his second wife Esther Billet. Alfred Bouvet, who came from Salins, was from a wealthy family who had made their fortune from transport companies. He presented the newly married couple with property at Frontenay, a village on the edge of the Jura. There were two large houses set among vineyards. Pierre and Beatrice had six children: Marie-Louise Puiseux\n(1884\n-\n1970)\n; Victor Marie Puiseux\n(1887\n-\n1978)\n; Madeleine Marie Puiseux\n(1888\n-\n1983)\n; Robert André Jean Joseph Puiseux\n(1892\n-\n1992)\n; Marguerite Marie Adele Puiseux\n(1894\n-\n1984)\n; and Olivier Henri Frederic Puiseux\n(1899\n-\n1947)\n.\nHe continued to be promoted at the Paris Observatory, being made an associate astronomer in\n1885\n. He also had other positions, however for the book\nLeçons de Cinématique. Mécanismes, Hydrostatique, Hydrodynamique\nⓉ\n(\nLessons in kinematics. Mechanisms, hydrostatics, hydrodynamics\n)\nwhich he published in\n1890\nwas based on lectures he had given at the Sorbonne. He describes himself on this book as an assistant lecturer at the Faculty of Science in Paris. For the Preface to this book, see\nTHIS LINK\n.\nHe had held this position at the Faculty of Science since\n1880\nand in\n1897\nhe became an honorary professor there. In\n1904\nhe was promoted to the position of astronomer at the Paris Observatory and, in the same year, he was appointed as professor of celestial mechanics at the Paris Faculty of Science and gave a course on celestial mechanics at the Sorbonne. He also gave a course on celestial mechanics at the Sorbonne from\n1909\nuntil\n1917\n.\nWe have emphasised above the important part that mountaineering had in Pierre Puiseux's life but this was not just a hobby. From the very earliest times when he climbed with his father and other family members he had been fascinated by the geology of the rocks that he was clambering over. This meant that when he became an astronomer, he became interested in the moon for he saw there rock formations and wanted to understand the geology of the moon. At the Observatory he worked with the astronomer Moritz\n(\nMaurice\n)\nLoewy\n(1833\n-\n1907)\n. Loewy, born in Vienna of Jewish parents, escaped the persecution of Jews in his home city and moved to France where he was employed at the Paris Observatory. In\n1781\nLoewy proposed a revolutionary new type of telescope, the Equatorial Coudé, and the director of the Observatory,\nCharles Delaunay\n, was extremely positive about the idea. However Delaunay died in\n1872\nand the Equatorial Coudé project was put on hold. In\n1882\n, Loewy with Pierre Puiseux as his assistant, began working on the design and construction of the telescope. Their first Small Equatorial Coudé had a\n10\n.\n5\ninch\n(27\ncm\n)\nobjective and performed exceptionally well. They then worked on building the Grand Equatorial Coudé, a\n23\n.\n6\ninch telescope, which they completed in around\n1891\n. Maurice Loewy and Pierre Puiseux published a description of this work in their book\nThéorie nouvelles de l'équatorial coudé et des équatoriaux en général\nⓉ\n(\nNew theory of the equatorial elbow and equatorial in general\n)\npublished in\n1888\n.\nThe major work that Loewy and Pierre Puiseux undertook with the Grand Equatorial Coudé was their monumental\nAtlas Photographique de la Lune\nⓉ\n(\nPhotographic atlas of the Moon\n)\n. This required fourteen years to complete between\n1894\nand\n1909\nand in fact Loewy died in\n1907\nso Pierre Puiseux headed the project on his own in its final stages. They took\n[\n1\n]\n:-\n... over\n6000\nphotographic plates of the Moon covering the whole portion visible from the Earth. Because perfect weather conditions were needed, the project took\n14\nyears to complete. During this period only\n50\nor\n60\nnights per year exhibited the ideal weather conditions, and from those nights suitable for photography only\n4\nor\n5\nusable plates were taken.\nFor an extract from the Preface of the book, giving the authors' reasons for producing this monumental\n12\n-volume work, see\nTHIS LINK\n.\nIn April\n1904\nthe Bureaux des Longitudes proposed to French observatories that they organise expeditions to observe the total solar eclipse which would occur on\n30\nAugust\n1905\n. The Paris Observatory sent an expedition to Cistierna, Léon, Spain led by Pierre Puiseux and also involving Maurice Hamy, Charles Le Morvan, Jules Baillaud and Georges Prin.\nIn\n1908\nPierre Puiseux published the book\nLa terre et la lune : forme extérieure et structure interne\nⓉ\n(\nThe Earth and the Moon: External form and internal structure\n)\ngiving his theory regarding the craters on the moon. He believed that the craters were mostly caused by internal mechanisms, a theory which has turned out to be incorrect since we now know that most of the craters are the result of external bombardment.\nSadly he began to suffer serious health problems and from\n1913\nonwards could not even walk in his beloved mountains due to severe arthritis. However, he still spent his summers sitting in a place where he could see the mountains. Even his work at the Observatory was only possible with great difficulty and considerable suffering.\nHis astronomical contributions are summed up in\n[\n7\n]\n:-\nAt the Observatory he was associated with Loewy in the construction of the Equatorial Coudé and on the observations made with it. The first work with this instrument was a determination of the constant of aberration. The principal work carried out by Loewy and Puiseux was on lunar photography. Over\n6000\nplates of the moon were taken. These were carefully examined by Puiseux, who made the enlargements from which the fine atlas of seventy-one sheets was constructed. It was Puiseux also who wrote the descriptions and discussed the results. This naturally led him to consider the \"geology\" of the moon. He reached the generally accepted opinion that the lunar formations can be explained as the result of stresses set up at the solidifying surface of an originally liquid sphere, and not through the action of outside forces. He has given in great detail his ideas of the progress of events in the cooling and gradual solidification of the moon. The difference between terrestrial and lunar mountains was attributed by him to a folding of layers on the earth and a rupture of the surface of the moon. In his final work he discussed the oscillation of the moon about its centre of gravity.\nPierre Puiseux received many honours. He was awarded the Valz Prize by the\nAcademy of Sciences\nin\n1892\n, the\nLalande\nPrize of the French Astronomical Society in\n1896\n, and the Janssen Prize from the\nAcademy of Sciences\nin\n1908\n. He was made a knight of the Legion of Honour in\n1900\n. An active member of the French Astronomical Society, he was elected president in\n1911\n. He was elected to the Astronomy Section of the\nAcademy of Sciences\nin\n1912\n, and was elected an associate member of the\nRoyal Astronomical Society\nin\n1917\n. Not surprisingly, he was an enthusiastic member of the French Alpine Club which elected him honorary president.\nHe died in\n1928\nafter many years of great suffering. His wife Beatrice survived him by thirty-five years, living to be well over\n100\n."
}