{
  "nome_completo": "Pierre Louis Moreau de Maupertuis",
  "nome_curto": "Pierre-Louis Moreau de Maupertuis",
  "ano_nascimento": "1698",
  "ano_morte": "1759",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maupertuis/",
  "lugar_nascimento": "Saint Malo, France",
  "lugar_morte": "Basel, Switzerland",
  "biografia": "Pierre-Louis Moreau de Maupertuis\n's father, M Moreau, was a member of the Council of Commerce and he also represented the state of Brittany. He had received his title shortly before the birth of Pierre-Louis who was his eldest son. Pierre-Louis's mother played a large part in forming his character by being excessively protective. Samuel Formey, in his obituary of Maupertuis for the\nBerlin Academy\n, wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nMadame Moreau idolized her son rather than loved him. She could not refuse him anything.\nOne effect of this treatment was that Maupertuis' younger brother, Moreau de Saint Ellier, was very jealous of the fact that his older brother was treated so much more favourably than he was, and he came to hate Maupertuis because of this.\nIn\n1714\nMaupertuis was sent to study at the Collège de la Marche in Paris. Malebranche had studied at this famous college sixty years earlier and now Maupertuis studied philosophy under Le Blond. After two years in Paris, however, Maupertuis' mother insisted that he come home to Saint Malo. He began to study music in\n1717\nbut soon he developed a strong interest in mathematics.\nThe navy seemed like an attractive career to Maupertuis but his mother felt it was too dangerous so he was forbidden from pursuing this choice. His father was able to obtain for him the position of lieutenant in the Musketeers and in\n1718\nhe joined the regiment of La Roche Guyon stationed at Lille. Although this was the sort of position that most young men of the time could only dream about, it did not suit Maupertuis. By\n1722\nhe had given up his career as a cavalry officer and was living in Paris enjoying the intellectual life of the cafés. He became friendly with the dramatist, novelist and journalist Marivaux, the playwright La Motte, and mathematicians Joseph\nSaurin\n, Nicole, and Terrasson. His early interest in mathematics now blossomed and, with instruction in the higher reaches of the subject from these men, he soon acquired a deep understanding.\nMaupertuis became an adjoint in the\nAcadémie des Sciences\nin\n1723\nand in the following year he produced his first paper\nSur la forme des instruments de musique\nwhich studied the effect of the shape of an instrument on the characteristics of the note it produced. Further papers followed: on maxima and minima in\n1726\n, on the cycloid in\n1727\n, and further papers on curves in\n1727\n,\n1728\nand\n1729\n. During this period, however, Maupertuis was also interested in biology. He acted as secretary to the naturalist Bignon and wrote an important paper on the salamander which shows his talents as an excellent observer of the natural world. In\n1728\nMaupertuis visited London and during this short visit he was elected a Fellow of the\nRoyal Society\n.\nIn order to extend the range of his mathematical and scientific knowledge Maupertuis went to Basle to study under\nJohann Bernoulli\n. He matriculated in Basle on\n30\nSeptember\n1729\nand spent the session living in\nJohann Bernoulli\n's home. At the University of Basle he received an outstanding education and training. He learnt of\nDescartes\n' vortex theory model of the solar system and of\nLeibniz\n's views on mechanics from his teacher\nJohann Bernoulli\nwho was perhaps the strongest supporter of these theories. At the same time, however, Maupertuis learnt of\nNewton\n's physics from\nJohann Bernoulli\nwho accepted the results of universal gravitation but looked towards\nLeibniz\n's theories to provide an explanation for them which\nNewton\nleft completely unexplained. How could two bodies effect each other when separated by a vacuum?\nBack in Paris by July of\n1730\n, Maupertuis began writing papers on mechanics in which he used the expertise he had already developed on curves. By\n1731\nhe had written his first paper on astronomy and another on differential equations, and was rapidly developing a reputation as an all round mathematician and scientist. In\n1732\nhe published a paper in the\nPhilosophical Transactions of the Royal Society of London\nwhich treated rotating bodies, discussing in particular the nature of Saturn's rings\n(\nwhich he believed to be the captured tail of a comet\n)\nand the shape that a rotating body assumes. It is an interesting paper but it contains some errors and shows that Maupertuis has not fully understood\nNewton\n's inverse square law and the resulting gravitational force within a solid body. In November\n1732\nhe declared himself a supporter of\nNewton\n's theory of gravitation in France with his publication of a major treatise\nFigures des astres\nⓉ\n(\nShapes of the stars\n)\n. It announced Maupertuis's position on one of the biggest problems of the day, namely the shape of the Earth.\nIn May\n1735\nthe\nParis Academy\nsent an expedition to Peru to make measurements of the Earth. It was headed by\nLa Condamine\nand had\nBouguer\nand Godin as members. A second expedition was sent to Lapland headed by Maupertuis, also to measure the length of a degree along the meridian. It left Dunkirk on\n2\nMay\n1736\nwith the scientists\nClairaut\nand\nCamus\nunder Maupertuis. They set up base in Tornio in northern Finland and managed to make their measurements despite the problems of being attacked by insects in summer and suffering unbearably cold weather during the winter. They were shipwrecked in the Baltic on their return journey but managed to keep the records of their observations undamaged. Rather strangely Maupertuis brought back with him two native girls from Finland. Back in Paris he attended the meeting of the Academy on\n20\nAugust\n1737\n, reporting that his results confirmed that the Earth was oblate. He made a full report to the Academy on\n13\nNovember.\nMaupertuis gained fame from this expedition but he forced home his advantage by publishing some vicious attacks on his opponents, in particular on\nJacques Cassini\n. Even his friends were shocked at the personal venom he displayed. His relations with\nClairaut\nand\nJohann Bernoulli\nhad broken down a little while before. In\n1739\nhe became friendly with\ndu Châtelet\nand Voltaire spending some time living at their home at Cirey. He tried to patch up relations with\nJohann Bernoulli\n, visiting Basle, and became increasing friendly with\nJohann\n(\nII\n)\nBernoulli\n. By the end of\n1739\nhe had been awarded a good salary to work on problems of navigation.\nHe was invited to Germany by King Frederick the Great in\n1740\nas part of Frederick's aim of bringing top philosophers and scientists to Berlin. Frederick informed Maupertuis that he was going to set up the\nBerlin Academy\nand invited him to be its president. After staying a while in Berlin while Frederick occupied himself with military matters, he joined the King with the Prussian army at the battle of Mollwitz in April\n1741\n. Frederick left the field early, fearing defeat, and Maupertuis was taken prisoner by the Austrians. He was treated kindly, taken to Vienna, but soon released and returned to Berlin. By June he was back in Paris, somewhat shaken by his experiences.\nBack in Paris, Maupertuis was appointed assistant director of the\nAcadémie des Sciences\nand in the following year be became its director. On\n27\nJune\n1743\nhe was admitted to the Académie Française. In the autumn of\n1744\nhe went to Basle, and from there he went to the French camp at the siege of Freiburg im Breisgau. He then went back to Prussia taking with him news of the French victory which he delivered to Frederick. The\nBerlin Academy\nwas now taking shape and Frederick again pressed Maupertuis to become its first president. He decided to accept the position and returned to Paris in the spring of\n1745\nto tidy up his affairs before taking up his new role. While in Berlin he had arranged a marriage to Eleonor Borck and, after his brief visit to Paris, he married her in Berlin on\n25\nAugust\n1745\n.\nMaupertuis had now committed himself to Berlin, and the\nParis Academy\ncancelled his membership in September\n1745\nafter a campaign against him led by\nJacques Cassini\n. On\n12\nMay\n1746\nMaupertuis was officially appointed as president of the\nBerlin Academy\n, a post which he was to hold for eight years. His presidency did not get off to a good start, however, for in June his father died and he returned to Paris, remaining there until September. Although he tried very hard to make a success of his role as president of the\nBerlin Academy\n, things were rather against him. On the one hand he did not speak German, and although the official business of the Academy was conducted in French or Latin, Maupertuis was rather cut off from the day to day administration which was conducted in German. His other problem was that Frederick wanted his Academy to be world class, but he was not prepared to put up the necessary funds to attract the top people. Maupertuis tried to overcome this by making appointments of foreigner scientists as associate members who did not work at the Academy. Of course the Academy did contain one person of the very highest calibre, namely\nEuler\n.\nMaupertuis published on many topics including mathematics, geography, moral philosophy, biology, astronomy and\ncosmology\n. We have mentioned some of his contributions above, but let us now mention some others. One important publication on natural history was\nVénus physique\nⓉ\n(\nThe earthly Venus\n)\nin\n1745\nin which he discussed the biological theory of the formation of the embryo. This work, and other work by Maupertuis on heredity, proposed a series of conjectures which some see as an early version of the theory of evolution. Indeed if he had taken his conjectures forward and developed them into a more fully formed theory he might now be recognised as putting forward the foundations of the theory of evolution. As it was, although he put forward the mechanism for one species developing into another, he failed to postulate the driving mechanism, namely natural selection.\nWe have left until late in this article a discussion of the topic for which Maupertuis is best known, namely the Principle of Least Action. One reason is that indeed it was late in his career that he proposed the principle. It was in\n1746\n, soon after becoming director of the\nBerlin Academy\n, that he first enunciated the\nPrinciple of Least Action\nand it was four years later that he published it in\nEssai de cosmologie\nⓉ\n(\nEssay on cosmology\n)\n. Maupertuis hoped that the principle might unify the laws of the universe and combined it with an attempted proof of the existence of God. He wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nThe laws of movement thus deduced\n[\nfrom the Principle of Least Action\n]\n, being found to be precisely the same as those observed in nature, we can admire the application of it to all phenomena, in the movement of animals, in the vegetation of plants, in the revolution of the heavenly bodies: and the spectacle of the universe becomes so much the grander, so much the more beautiful, so much more worthy of its Author ...\nThese laws, so beautiful and so simple, are perhaps the only ones which the Creator and Organizer of things has established in matter in order to effect all the phenomena of the visible world ...\nAnother reason for leaving a discussion of the Principle of Least Action to now is that it played a large role in the sad events near the end of his life.\nSamuel König\nwas a mathematician whom Maupertuis had known for a long time. Both had been students of\nJohann Bernoulli\n, both had taught\ndu Châtelet\n, both had studied the shape of the Earth, and Maupertuis had proposed\nSamuel König\nfor election to the\nBerlin Academy\n. The strange affair began in\n1751\nwhen\nKönig\nvisited Berlin and gave a paper to Maupertuis to be considered for publication. Clearly Maupertuis never read it, but simply returned it the following day recommending publication. It was indeed published in March\n1751\nand only then did Maupertuis read it and discover that on the one hand it argued that the Principle of Least Action was false, on the other hand it argued that\nLeibniz\nwas the first to propose the theory. The evidence which was put forward to support the claim was a letter of\n1707\nfrom\nLeibniz\nto Jacob\nHermann\n.\nIt is fair to say that by this time Maupertuis had serious health problems. Also he never reacted well to criticism, becoming ever more sensitive as his health declined, and we have already described the vicious personal attacks he made on his opponents in the argument about the shape of the Earth many years before. However, perhaps most relevant of all, he felt that the Principle of Least Action was his greatest achievement, the one for which he would go down in history. Maupertuis was strongly defended by\nEuler\nbut he used his position as director of the Academy to have it declare publicly that\nKönig\nhad forged the quotation. This left\nKönig\nno option but to resign from the Academy. Voltaire had at one time been a close friend of Maupertuis, but the two had fallen out years before this sad affair. Voltaire now used his great literary skill to rubbish Maupertuis's ideas, his voyage to Lapland, and he\n[\n1\n]\n:-\n... lampooned Maupertuis's amorous adventures in the North.\nFrederick tried to support the president of his Academy, but Maupertuis's failing health collapsed under the strain and he left Berlin for Paris in\n1753\n. He remained there for over a year, being pressed by Frederick to return to Berlin who claimed that the Academy was out of control now its director was absent. This Maupertuis did in\n1754\nbut then he was apparently blackmailed by a girl who claimed that he was the father of her child.\nIn\n1756\nJacques Cassini\ndied. Shortly after this Maupertuis's membership of the\nAcadémie des Sciences\nwas renewed and he was awarded a pension from the Paris Academy. He returned to Paris in July\n1756\n, but by September he was in his home town of Saint Malo. Advised to travel to Italy for health reasons, he set out in June\n1757\n. By now the French were at war with the Prussians and his position became even more difficult. He spent seven months in Bordeaux but eventually reached Basle in October\n1758\nwhere he was a guest in the home of\nJohann Bernoulli\n. By the following summer he realised that his life was nearly over and his wife set out to travel to Basle to be with him. He died before she reached Basle, and was buried at Dornach.\nBeeson writes\n[\n4\n]\n:-\nThe brilliance of much of what he did was undermined by his tendency to leave work unfinished, his failure to realise his own potential: it was the insight of genius that led him to least-action principle, but a lack of intellectual energy or rigour that prevented his giving it the mathematical foundation that Lagrange would provide. ... he reveals remarkable powers of perception in heredity, in understanding the mechanism by which species developed, even in immunology, but no fully elaborated theory. His philosophical work is his most enthralling: bold, exciting, well argued."
}