{
  "nome_completo": "Pierre Rémond de Montmort",
  "nome_curto": "Pierre Rémond de Montmort",
  "ano_nascimento": "1678",
  "ano_morte": "1719",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montmort/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Rémond\nwas only later to become\nPierre Rémond de Montmort\n. His parents were François Rémond, Sieur de Breviande, and Marguerite Rallu. Pierre was born into a noble well-off family and was the second of his parents three sons. François Rémond was said to be very severe and very uncompromising. His advice to his son Pierre was that he should study law and François had everything organised for his son with a vacant magistracy ready for him to step into after he had qualified. After studying at a College, he was sent to begin studying law. Pierre, however, was rebellious and chose not to follow his father's advice. Tired of studying law, he left home at the age of eighteen and decided to go abroad. He went to England and toured round the country, learning to speak English and becoming fond of the English way of life. The Treaty of Ryswick, signed in September\n1697\n, ended the Nine Years' War between France and the forces of England, Spain and the Netherlands. One result of this treaty was the Frenchmen could travel freely in Europe and Pierre took full advantage of this.\nLeaving England, he moved on to the Low Countries, then going to Germany where again he visited a number of places. He visited his cousin, M de Chamoys, in Regensburg in Germany. M de Chamoys was a French representative on the Diet of Regensburg. While living in M de Chamoys' home he found\nMalebranche\n's\nLa Recherche de la Vérité\nⓉ\n(\nThe Search for Truth\n)\nin his cousin's library and read the book. This seems to have affected the young man markedly and, according to\nBernard de Fontenelle\n[\n11\n]\n, it made Rémond into a philosopher and a Christian. Rémond decided that he should make his peace with his father. By the age of\n21\nhe was back in France where he began to study under\nMalebranche\n. His father died in the following year and so at the age of\n22\nRémond found himself a very wealthy young man.\nParticularly given Rémond's earlier behaviour, one might have expected him to live a life of leisure once he had the financial means to do so. However he seems to have never looked back after his change of heart while living with his cousin, and continued to pursue his studies with vigour.\nMalebranche\ntaught Rémond philosophy and\nDescartes\n' physics. Rémond went on to study the latest mathematics, in particular studying algebra and geometry with M Carré and M Guisnée. For three years he and another young mathematician François Nicole\n(1683\n-\n1758)\n, together taught themselves about the latest mathematical developments. In\n1700\nhe made a second visit to London and at this time he briefly met with\nIsaac Newton\n. Returning to France, he followed the advice of his brother and accepted an appointment as a canon at Notre Dame de Paris. We already mentioned that soon after Rémond returned to France in\n1699\nhe came into a large inheritance from his father. Now he did not need the income from his position in the Church so he gave quite a large sum to charity, probably all of his income from his position as canon. In\n1704\n, he used this wealth to purchase an estate at Montmort\n(\nand therefore became Pierre Rémond de Montmort\n)\n. From this point on we shall refer to him as Montmort. He also used his wealth to aid science, for example in\n1709\nhe arranged and paid for the printing\n100\ncopies of\nIsaac Newton\n's\nDe Quadratura\nⓉ\n(\nOn integration\n)\n. He lived most of his life in the Château de Montmort on his estate and often invited top mathematicians to visit him. In\n1706\nMontmort married Mademoiselle de Romicourt, the niece of the Duchess of Angouleme. The Duchess of Angouleme lived at the Château Mareuil, a neighbouring property to the estate at Montmort, and Montmort had met the Duchess's niece while making a courtesy call on his neighbours. Before his marriage, he had given up his position as canon at Notre Dame de Paris. His marriage was a very happy one.\nMontmort's reputation was made by his book on probability\nEssay d'analyse sur les jeux de hazard\nⓉ\n(\nEssay on the analysis of gambling\n)\nwhich appeared in\n1708\n. The book, which is a collection of combinatorial problems, is a systematic study of games of chance and shows that there is important mathematics in this area. Thomas Kavanagh summarises Montmort's reasons for writing the book\n[\n5\n]\n:-\nMontmort explains that his careful scrutiny of so apparently frivolous a subject as the intricacies of popular card games carries with it the serious advantage of allowing him to vanquish, on its home ground, that most decried of all Enlightenment evils: superstition.\nWe give extracts from Montmort's Preface to the book at\nTHIS LINK\n.\nHowever, we should give some background to Montmort's work by looking at various influences on him. David Bellhouse explains that gambling was popular in France at this time\n[\n9\n]\n:-\nLouis XIV set the tone for gambling among the French nobility. Games of chance were played at all the royal chateaux and stakes were often very high... At Versailles Louis played at least three times a week at his 'appartements du roi'.\nThe correspondence between\nBlaise Pascal\nand\nPierre de Fermat\nin\n1654\nis generally taken as the beginnings of\nprobability theory\n, but the first published work on the topic was by\nChristiaan Huygens\nwho heard about the\nPascal\n-\nFermat\ncorrespondence but independently solved the problems they had discussed.\nHuygens\npublished\nDe Ratiociniis in Ludo Aleae\nⓉ\n(\nReasoning in games of dice\n)\nin\n1657\nand in it stated five problems which Montmort solved in his book. Both\nHuygens\n' paper and knowing that\nJacob Bernoulli\nhad written an unfinished work in probability seem to be the main influences on Montmort.\nMontmort collaborated with\nNicolaus\n(\nI\n)\nBernoulli\nin a fascinating correspondence which began in\n1710\n. They discussed many topics, particularly the probability questions that arose from Montmort's book.\nNicolaus\n(\nI\n)\nBernoulli\nspent three months at the Château de Montmort in\n1712\n. He had been invited by Montmort who writes to Bernoulli in a letter dated\n5\nSeptember\n1712\n:-\nThe hope that you give me, Sir, of giving me the honour that you will come to visit me here, gives me infinite pleasure.\nIn the second edition of\nEssay d'analyse sur les jeux de hazard\nⓉ\n(\nEssay on the analysis of gambling\n)\npublished in\n1713\n, Montmort included copies of the correspondence. Here is an ideas of the contents of this second edition. There are five sections:\n(1)\nA Treatise on Combinations;\n(2)\nProblems on Games of Chance;\n(3)\nThis is called \"Problem on Quinquenove:\"\n(4)\nVarious Problems; and\n(5)\nCorrespondence. The second section studies the card games: Pharaon, Lansquenet, Treize, Bassette, Piquet, Triomphe, L'Ombre, Brelan, Imperial and Quinze. The third section examines games played with dice: Quinquenove, Hazard, Esperance, TricTrac, Trois Dez, Rafle, Trois Rafles, and Noyaux. The fourth section solves various problems including Huygens problems from\nDe Ratiociniis in Ludo Aleae\nⓉ\n(\nReasoning in  gambling games\n)\n. The section ends giving four unsolved problems. The fifth section contains Montmort's correspondence with\nNicolaus\n(\nI\n)\nBernoulli\n.\nSee\nTHIS LINK\nfor an extract to the Preface of\nEssay d'analyse sur les jeux de hazard\n.\nSee\nTHIS LINK\nfor\nFlorence Nightingale David\n's description of Montmort and his book.\nSee\nTHIS LINK\nfor Montmort's statement of the game of Treize.\nHowever, it was not only probability that\nNicolaus\n(\nI\n)\nBernoulli\nand Montmort discussed in their letters. In\n1713\nMontmort wrote to\nNicolaus\n(\nI\n)\nBernoulli\n(\nsee\n[\n14\n]\n)\nwith an interesting suggestion:-\nIt would be desirable if someone wanted to take the trouble to instruct how and in what order the discoveries in mathematics have come about. ... The histories of painting, of music, of medicine have been written. A good history of mathematics, especially of geometry, would be a much more interesting and useful work. ... Such a work, if done well, could be regarded to some extent as a history of the human mind, since it is in this science, more than in anything else, that man makes known that gift of intelligence that God has given him to rise above all other creatures.\nOf course, since this present biography is part of a History of Mathematics archive, Montmort's comments are particularly important. It is interesting to note that\nJean-Etienne Montucla\n, in his\nHistoire des mathématiques\nⓉ\n(\nHistory of Mathematics\n)\n(1758)\n, claimed that this letter was his inspiration in writing his famous history of mathematics book.\nIn\n1715\nMontmort visited England again, this time to watch the total eclipse of the sun in the company of the Astronomer Royal,\nEdmond Halley\n. He met a number of mathematicians on this visit including\nAbraham de Moivre\nand\nBrook Taylor\n. He became friendly with these mathematicians even though he suspected\nde Moivre\nof plagiarism with his\nDe Mensura Sortis\nⓉ\n(\nThe measure of Socrates\n)\n(\nthe Latin precursor of\nDoctrine of Chance\n)\n. It says a lot that they were capable of friendship despite having had a quite public scientific disagreement.\nDe Moivre\nhad made a vicious attack on Montmort's first edition of the\nEssay\nin his\nDe Mensura Sortis\nⓉ\n(\nThe measure of Socrates\n)\n(1711)\nand Montmort had retaliated with an attack on\nde Moivre\nwhen he brought out his second edition. However Montmort has more credit in trying to mend the quarrel, for although he wrote repeatedly to\nde Moivre\n, the latter only infrequently responded. After returning to France in the spring of\n1715\nMontmort carried out a very active correspondence with\nTaylor\n. In addition to those mentioned above, let us add at this point that Montmort corresponded with\nJohn Craig\n,\nEdmond Halley\n,\nGottfried Leibniz\n,\nJakob Hermann\nand\nGiovanni Poleni\n. At a time of high feelings in the\nNewton\n-\nLeibniz\ncontroversy it says a lot for Montmort that he could be close friends with followers of both camps. Montmort had been elected to be a Fellow of the\nRoyal Society of London\nin\n1715\nwhile he was on this trip to England. He was elected an associate member of the\nAcadémie Royal des Sciences\nin\n1716\n. Only those living in Paris could be full members.\nThe correspondence between Montmort and\nTaylor\ngoes far beyond the discussion of scientific topics, and Montmort wrote about intimate family matters. As\nFontenelle\nwrites in\n[\n13\n]\n, their friendship showed a tenderness one would expect to see between brothers. This close friendship did not stop them carrying out a fascinating discussion regarding the merits of the physics of\nDescartes\nand that of\nNewton\n. In March\n1716\nMontmort wrote to\nTaylor\n(\nsee\n[\n6\n]\n)\n:-\nYou must be shocked not to have received my response to your objections against our principles and our manner of philosophising in physics. I hope that it will soon be in a state where I can send it to you. However, since it is destined for judges as sharp as you and your colleagues, I cannot take enough precautions in writing it. We are as divided on physics as theologians, but at least we can see a bit more clearly in science than in religion. You deserve good proofs. I hope to find them for you, and since nothing pleases the mind more than natural and methodical order I will attend not only to things but also to the manner of expressing them.\nMontmort eventually produced\nDissertation on the principles of physics of M Descartes compared to those of the English philosophers\nwhich was published in October\n1718\nin\nL'Europe savante\n. Shank writes\n[\n6\n]\n:-\nThe simple fact that Rémond de Montmort and\nTaylor\nfelt compelled to debate the physics of universal gravitation was an important marker of the changing intellectual climate of the time, yet the appearance of their thoroughly exchange within a journal self-consciously devoted to promoting and provoking public, critical debate of philosophical matters was even more catalysing. ... Montmort constructed a carefully reasoned defence of Malbranchian physics that was rooted, in his mind, in the fundamental similarity between it and a correct reading of\nNewton\n's 'Principia'.\nWe quote a brief passage from Montmort's\nDissertation\n:-\nGiven known truths one tries to find those that are hidden. This is the method of analysis used by mathematicians, and the art of pulling the unknown out of the known is what renders this science the most beautiful and the most useful production of the human mind. Its usage is not limited to discovering the properties of numbers and curved lines; it extends itself to everything that is susceptible to quantitative relationships, and in particular to the discovery of truths in physics.\nIn this argument, he was precisely following\nNewton\n's approach and he went on to argue that application of\nNewton\n's ideas led directly to the theory of vortices. He tried to bridge the gulf between the two sides by accepting\nNewton\n's inverse square law of attraction but arguing that the mechanism was due to\nDescartes\n' vortices. However, he\n[\n6\n]\n:-\n... neither insisted dogmatically that the vortices existed nor even that gravitational attraction was an obvious fiction. Rather, he argued, we can never know what the real nature of bodies is, and we are thus restricted to rational descriptions of empirical phenomena.\nSmallpox was a dreaded disease at this time with around\n400\n,\n000\npeople dying each year in Europe. About\n30\n% of those affected died from the disease. There were frequent epidemics, the one that struck Paris in\n1719\nkilled\n14\n,\n000\nof the inhabitants of the city. Montmort, was infected by smallpox during this\n1719\nepidemic and died in October of that year. He was\n40\nyears old and at the height of his scientific powers and activities. After his death his paper on summing infinite series,\nDe seriebus infinitis tractatus\nⓉ\n(\nA tract on infinite series\n)\n, was published in the\nPhilosophical Transactions of the Royal Society\n. This paper has an appendix by\nTaylor\n.\nLet us end with this quote from\nIsaac Todhunter\n[\n7\n]\n:-\n[\nIn the 'Essay d'analyse sur les jeux de hazard'\n]\nwith the courage of Columbus he revealed a new world to mathematicians."
}