{
  "nome_completo": "Pierre Laurent Wantzel",
  "nome_curto": "Pierre Wantzel",
  "ano_nascimento": "1814",
  "ano_morte": "1848",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wantzel/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Wantzel\n's father served in the army for seven years after the birth of Pierre, then became professor of applied mathematics at the École speciale du Commerce. Pierre Wantzel attended primary school in Ecouen, near Paris, where the family lived. Even at a very young age he showed great aptitude for mathematics, and\nSaint-Venant\nrelates in\n[\n4\n]\nthat\n... he showed, with his great memory, a marvellous aptitude for mathematics, a subject about which he read with extreme interest. He soon surpassed even his master, who sent for the young Wantzel, at age nine, when he encountered a difficult surveying problem.\nIn\n1826\n, while still only\n12\nyears old, Wantzel entered the École des Arts et Métiers de Châlons. Here he was extremely fortunate in having Étienne\nBobillier\nas a mathematics teacher. However France at this time was filled with political unrest and revolts, one of which caused the school to be reorganised in\n1827\n. Unhappy with the less academic nature of the school in\n1828\n, Wantzel entered the Collège Charlemagne after being coached in Latin and Greek by a M Lievyns\n(\nwhose daughter he was later to marry\n)\n.\nBy\n1829\n, at the remarkably young age of\n15\n, he edited a second edition of\nReynaud\n's\nTreatise on arithmetic\ngiving a proof of a method for finding square roots which was widely used but previously unproved. In\n[\n2\n]\nde Lapparent describes his successes at the Collège Charlemagne:-\nIn\n1831\n, the first prize of French dissertation from the Collège Charlemagne was awarded to him, and better yet, first prize in Latin dissertation, acquired in open contest, attested with splendour to the universality of Wantzel's aptitude.\nHe was placed first in\n1832\nin the entrance examination to the École Polytechnique and also first for the science section of the École Normale. This had never previously been achieved and, as related in\n[\n3\n]\n:-\n... he threw himself into mathematics, philosophy, history, music, and into controversy, exhibiting everywhere equal superiority of mind.\nHe entered the engineering school of Ponts et Chaussées in\n1834\nand was sent to the Ardennes in\n1835\n, then to Berry in\n1836\n. However\nSaint-Venant\nin\n[\n4\n]\nsays that Wantzel:-\n... said merrily to his friends that he would be but a mediocre engineer. He preferred the teaching of mathematics...\nIn order to further his career in mathematics he asked for leave of absence. He became a lecturer in analysis at the École Polytechnique in\n1838\nbut, in addition, he was made an engineer in\n1840\nand from\n1841\nbecame professor of applied mechanics at the École des Ponts et Chaussées. Wantzel was not one to take life easy and he took on additional duties taking charge of the entrance examinations at the École Polytechnique in\n1843\nand in addition taught various mathematics and physics courses at various schools around Paris, including at the Collège Charlemagne.\nWantzel is famed for his work on solving equations by\nradicals\n. In\n1837\nWantzel published proofs of what are some of the most famous mathematical problems of all time in a paper in\nLiouville\n's Journal on\n... the means of ascertaining whether a geometric problem can be solved with\nruler and compasses\n.\nGauss\nhad stated that the problems of\nduplicating a cube\nand\ntrisecting an angle\ncould not be solved with ruler and compasses but he gave no proofs. In this\n1837\npaper Wantzel was the first to prove these results. Improved proofs were later given by Charles\nSturm\nbut he did not publish them.\nIn\n1845\nWantzel, continuing his researches into equations, gave a new proof of the impossibility of solving all algebraic equations by radicals. Wantzel writes in the introduction:-\nAlthough\n[\nAbel\n's\n]\nproof is finally correct, it is presented in a form too complicated and so vague that it is not generally accepted. Many years previous,\nRuffini\n, an Italian mathematician, had treated the same question in a manner much vaguer still and with insufficient developments, although he had returned to this subject many times. In meditating on the researches of these two mathematicians, and with the aid of principles we established in an earlier paper, we have arrived at a form of proof which appears so strict as to remove all doubt on this important part of the theory of equations.\nIn fact Wantzel published over\n20\nworks which are listed in\n[\n4\n]\n. Three of these works are written jointly with\nSaint-Venant\nand concern the flow of air when there is a large pressure difference. De Lapparent in\n[\n2\n]\nsums up his other work as follows:-\nWe owe to him a note on the curvature of elastic rods, several works on the flow of air ... finally, in\n1848\n, an important posthumous note on the rectilinear diameters of curves. It was he who first gave the integration of\ndifferential equations\nof the elastic curve.\nAccording to\nSaint-Venant\nin\n[\n4\n]\nhis death was the result of overwork.\nSaint-Venant\nwrote:-\n... one could reproach him for having been too rebellious against those counselling prudence. He usually worked during the evening, not going to bed until late in the night, then reading, and got but a few hours of agitated sleep, alternatively abusing coffee and opium, taking his meals, until his marriage, at odd and irregular hours.\nWantzel certainly published some important results, although it must be understood that his proofs of the impossibliity of solving the classical ruler and compass problems were built on the work of others.\nSaint-Venant\n, in\n[\n4\n]\n, ponders the question of why Wantzel with one of the most impressive early achievements of any mathematician, should have failed to achieve even more innovative results despite his early death.\nSaint-Venant\nwrites:-\n... I believe that this is mostly due to the irregular manner in which he worked, to the excessive number of occupations in which he was engaged, to the continual movement and feverishness of his thoughts, and even to the abuse of his own facilities. Wantzel improvised more than he elaborated, he probably did not give himself the leisure nor the calm necessary to linger long on the same subject."
}