{
  "nome_completo": "Pierre Hérigone",
  "nome_curto": "Pierre Hérigone",
  "ano_nascimento": "1580",
  "ano_morte": "1643",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herigone/",
  "lugar_nascimento": null,
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Hérigone\nis actually a pseudonym for the Baron Clément Cyriaque de Mangin. In fact, just to make things even more confusing, Cyriaque de Mangin also used the pseudonym Denis Henrion. He was of Basque origin. Little is known of his life except that he taught for most of it in Paris.\nHérigone's only important work is the six volume\nCursus mathematicus, nova, brevi, et clara methodo demonstratus\nⓉ\n(\nCourse on mathematics : new, short, and with clear methods shown\n)\nor, to give it its French title,\nCours mathematique, demonstre d'une nouvelle, briefve, et claire methode\nwhich appeared between\n1634\nand\n1642\n. In fact remaining copies of the first five volumes were reissued with new title pages in\n1644\nwhen the sixth volume was published. This is in fact a fictitious second edition, since it consisted of rebound copies of the first edition volumes which had been unsold. The work is a compendium of elementary mathematics written in both French and Latin. It introduced a complete system of mathematical and logical notation, yet none is used today.\nFlorian Cajori\nwrote:-\nA full recognition of the importance of notation and an almost reckless eagerness to introduce an exhaustive set of symbols is exhibited in the 'Cursus mathematicus'\nⓉ\n(\nCourse on mathematics\n)\nof Pierre Hérigone, in six volumes, in Latin and French ,...\nHérigone did, however, introduce a number of familiar symbols such as ⟂  for 'is perpendicular to'. He also used < for 'angle' but since this is essentially the same as the 'less than' symbol,\nWilliam Oughtred\nmade a slight modification to  Hérigone's notation using  ∠  for 'angle' in\nTrigonometria\n(1657)\n. At a time when an exponent notation was not in common use, Hérigone introduced\na\n2\n,\na\n3\na2, a3\na\n2\n,\na\n3\n, etc for the powers of\na\na\na\n. This is a variant of our present notation in which the powers are raised while in the form in which Hérigone used them they were on the same level as the\na\na\na\n.\nTo give a little flavour of this rather strange work, let us note that Hérigone describes a camera obscura in the form of a goblet which was designed so that one could spy on others at the table while drinking from the goblet. It had a cunning optical set-up with a mirror but appears only to have been created for a bit of fun. He also introduced a code by which numbers were translated into words to aid memorising them. The code was as follows:\n1\n=\np\n,\na\n;\n2\n=\nb\n,\ne\n;\n3\n=\nc\n,\ni\n;\n4\n=\nd\n,\no\n;\n5\n=\nt\n,\nu\n;\n6\n=\nf\n,\na\nr\n,\nr\na\n;\n7\n=\ng\n,\ne\nr\n,\nr\ne\n;\n8\n=\nl\n,\ni\nr\n,\nr\ni\n;\n9\n=\nm\n,\no\nr\n,\nr\no\n;\n0\n=\nn\n,\nu\nr\n,\nr\nu\n1 = p, a; 2 = b, e; 3 = c, i; 4 = d, o; 5 = t, u; 6 = f, ar, ra; 7 = g, er, re; 8 = l, ir, ri; 9 = m, or, ro; 0 = n, ur, ru\n1\n=\np\n,\na\n;\n2\n=\nb\n,\ne\n;\n3\n=\nc\n,\ni\n;\n4\n=\nd\n,\no\n;\n5\n=\nt\n,\nu\n;\n6\n=\nf\n,\na\nr\n,\nr\na\n;\n7\n=\ng\n,\ne\nr\n,\nr\ne\n;\n8\n=\nl\n,\ni\nr\n,\nr\ni\n;\n9\n=\nm\n,\no\nr\n,\nr\no\n;\n0\n=\nn\n,\nu\nr\n,\nr\nu\n. So to remember a number such as\n314159\none produced a word such as 'cadator' which then translated back into\n314159\n. The assumption here was that 'cadator' was easier to remember than\n314159\n.\nOne of the problems which Hérigone looked at in the text concerns an apothecary who had four kinds of medicines, of which the first is hot in the fourth degree, the second is hot in the second degree, the third is cold in the first degree and the fourth is cold in the third degree. He then asks in what proportions the medicines have to be mixed to produce a compound of the first degree of heat. He solves it in a rather clumsy way using a geometrical proof with unnecessary use of several theorems from\nEuclid\n's\nElements\n. There are also some gems in the text such as one described in the article\n[\n2\n]\nwhere a clear description of the determination of the sine law by Hérigone in the fifth volume of his\nCursus mathematicus\nⓉ\n(\nCourse on mathematics\n)\nappears.\nWe know that Hérigone served on a number of committees and took a full part in the mathematical life of Paris. One committee which he served on was set up to judge whether\nJean-Baptiste Morin\n's scheme for determining longitude from the Moon's motion was practical. The committee members, in addition to Hérigone, were\nÉtienne Pascal\n,\nMydorge\n,\nBeaugrand\n, J C Boulenger and L de la Porte. Hérigone, and the rest of the committee, became involved in a dispute with\nJean-Baptiste Morin\n.\nWe mentioned above that Hérigone also wrote under the name of Denis Henrion. It was under this pseudonym that he translated\nTractatus de Globis\nⓉ\n(\nTreatise on the globe\n)\nby the English geographer Robert Hues\n(1554\n-\n1632)\n. The original text was written in Latin and published in London in\n1594\n. The translation into French by Denis Henrion was published as\nTraite des Globes et de Leur Usage, traduit du Latin de Robert Hues, et Augmente de plusieurs nottes et operations du Compas de proportion par D Henrion, mathematicien\nⓉ\n(\nTreatise on globes and their use, translated from Latin by Robert Hues, and including several notes and compass operations by D Henrion, mathematician\n)\nin Paris in\n1618\n. As can be seen from the title, Hérigone added his own notes on the use of the compass of proportion. Finally we mention\nQuatre livres de la géométrie pratique\nⓉ\n(\nFour books of practical geometry\n)\npublished by Cyriaque de Mangin in\n1620\n."
}