{
  "nome_completo": "Reinhard Selten",
  "nome_curto": "Reinhard Selten",
  "ano_nascimento": "1930",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Selten/",
  "lugar_nascimento": "Breslau, Germany (now Wrocław, Poland)",
  "lugar_morte": "Poznań, Poland",
  "biografia": "Reinhard Selten\n's father, Adolf Selten, was racially Jewish but had no religious affiliation. Reinhard's mother, Käthe Luther, was a protestant. Adolf Selten had not received much in the way of education, spending only three years at school. When he was still young he went blind making it difficult for him to work to support his family yet he had managed to build up a flourishing business. Reinhard Selten spoke about his father in\n[\n2\n]\n:-\nWhen I was born my father owned a business called a \"reading circle\"; folders containing an assortment of magazines were lent to customers for one week, then recollected and lent out again. The older the folder, the lower was the fee.\nThe coming to power of the Nazi party in Germany in\n1933\nled to the passing of laws which prevented Jews from holding employment connected to the press, so Adolf Selten was forced to sell his business. Adolf and Käthe had decided that, given their religious positions, they would let Reinhard grow up without any religious attachment so that he could make his own choice when he reached the appropriate age. However given the moves made by the Nazis against the Jews beginning in\n1933\n, they decided that they would have Reinhard baptised as a protestant\n[\n2\n]\n:-\nThe ceremony is one of my early memories. Much later as a young man I left the protestant church and became unattached to any religion again.\nBeing baptised as a protestant did not save Selten from the severe problems of growing up in Nazi Germany with a Jewish father. When he was eleven years old his father died\n[\n2\n]\n:-\nUnlike several other relatives my father did not become a victim of the holocaust, since he died after a serious illness already in\n1942\nbefore the worst of the terror began.\nBeing half-Jewish, Selten was denied an education beyond the age of\n14\nand had to take employment as an unskilled worker but this situation was short-lived since World War II was drawing to a close. As Soviet troops approached the city of Breslau, which had been fortified by the Nazis, German people began to leave, the exodus beginning in\n1944\n. Shortly before the city fell to the Russians in May\n1945\n, trains evacuating people stopped running but Selten, along with his mother, brothers and sister, managed to escape the city on one of the last trains. The family lived for a while in Saxony before moving to Austria when Selten worked as a farm labourer. Then they moved to Hesse where they lived in a small village and Selten again worked as a farm worker. In\n1946\nGerman schools opened again following the end of World War II and Selten was able to continue his education. In\n1947\nthe family were in Melsungen which is a small spa town in northern Hesse about\n20\nkm south of Kassel. Selten studied at Melsungen\nGymnasium\nfrom\n1947\nto\n1951\nand at this time he became interested in mathematics\n[\n2\n]\n:-\nI had to walk to school which took about three and a half hours there and back. During these walks I occupied my mind with problems of elementary geometry and algebra.\nWhen he completed high school, Selten knew that he wanted to study mathematics but he also had many other interests including economics and psychology. Although he could not have realised it at the time, he had already made a significant start towards his final career when he read an article on\ngame theory\nin Fortune Magazine in his final year at school. When he entered the Johann-Wolfgang-Goethe-University in Frankfurt am Main in\n1951\n, although working towards a mathematics degree, he took many courses out of interest which had nothing to do with his main subject. Game theory, of course, was a part of mathematics and he continued his interest in that topic by reading\nvon Neumann\nand\nMorgenstern\n's\nTheory of Games and Economic Behaviour\nwhich he found in the university library. He was awarded his Vordiplom\n(\nessentially equivalent to a BA\n)\nin\n1955\n. Continuing to work at Frankfurt for a Master's degree, Selten had to present a minor topic for examination in addition to writing a mathematical dissertation. His increasing interest in game theory and economics led to him to ask if he could take mathematical economics as a minor subject instead of astronomy. This was allowed and he became the first student to take this option. For his Master's thesis on cooperative game theory he was advised by Ewald Burger. Selten wrote\n[\n2\n]\n:-\nHe was a man of extraordinary mathematical erudition and an excellent teacher. I owe much to his guidance and to his patient advice.\nIn\n1957\nSelten was awarded a Master's degree in mathematics from Frankfurt. For the next ten years he worked as an assistant in economics to Heinz Sauermann at Frankfurt University. He explained in\n[\n2\n]\nthe work he undertook:-\nIt was my task to do research funded by Deutsche Forschungsgemeinschaft, the German counterpart of the National Science Foundation. At first I was supposed to apply decision theory to the theory of the firm, but soon I became involved in economic laboratory experimentation. Fortunately the referees of Sauermann's research proposals approved of this new research direction. This made it possible to finance a small group of young people doing experimental research. Sauermann had about\n15\nassistants and only two to four of them were involved in experiments. I became something like a foreman of this small detachment.\nOne of Selten's many interests was the international language Esperanto and it was through this that he met another enthusiast Elisabeth Langreiner; they married in\n1959\n. Selten was awarded his doctorate from Frankfurt in\n1961\n. Shortly after this he accepted an invitation from\nOskar Morgenstern\nto participate in a game theory conference in Princeton, and\nMorgenstern\nalso arranged financial support to allow Selten to spend a few weeks at Princeton after the conference ended. He wrote\n[\n2\n]\n:-\nMy short visit to Princeton was important for my life since it gave me the opportunity to interact with R J Aumann and M Maschler who were members of\nMorgenstern\n's research group at that time.\nBefore returning to Germany, Selten spent a couple of days in Pittsburgh following the game theory conference so that he could make contact with Herbert Simon, who had produced work on bounded rationality that was significant to Selten's research. In\n1965\nhe attended a small workshop in Jerusalem where he met John C Harsanyi for the first time; the two began joint work from this time. After spending the year\n1967\n-\n68\nvisiting the University of California, Berkeley, Selten submitted his\nHabilitationsschrift\non multiproduct pricing to Frankfurt University, the award being made in\n1968\n. In\n1969\nSelten was appointed to a chair of economics at the Free University in Berlin. He wrote\n[\n2\n]\n:-\nMy wife and I liked to live in West Berlin. In these years Germany experienced a period of student unrest, which made teaching difficult and sometimes impossible. The student movement was especially strong at the Free University, but this was not the reason why I moved to the University of Bielefeld in\n1972\n. I was attracted by plans to create a big Institute of Mathematical Economics. However, these plans could not be realized since it finally turned out that the money was not available.\nAfter twelve years at the Institute for Mathematical Economics of the University of Bielefeld he moved to a chair at the University of Bonn where an experimental economics laboratory was being set up. However, he spent the year\n1987\n-\n88\nback at Bielefeld running a year-long research workshop on game theory in the behavioural sciences.\nIn\n1965\nhe published important work\nEin Oligopolmodell mit Nachfrageträgheit\nⓉ\n(\nAn oligopoly model with demand inertia\n)\non distinguishing between reasonable and unreasonable decisions in predicting the outcome of games. He published the books:\n(\nwith John C Harsanyi\n)\nA General Theory of Equilibrium Selection in Games\n(1988)\n;\nModels of Strategic Rationality\n(1988)\n; and\nGame Equilibrium Models\n(1991)\n. For his work in game theory Selten was, jointly with John C Harsanyi and\nJohn Nash\n, awarded the\n1994\nNobel Prize in Economic Science:-\n... for their pioneering analysis of equilibria in the theory of non-cooperative games.\nThe respective contributions of\nNash\nand Selten are as follows.\nNash\ndivided game theory into two parts, cooperative games, in which binding agreements can be made, and non-cooperative games, where binding agreements are not possible.\nNash\nmade a significant contribution with his equilibrium concept for non-cooperative games. It is now called the\nNash\nequilibrium. Selten worked on this concept and he refined the\nNash\nequilibrium concept for analysing dynamic strategic interaction. Selten has also applied his refined version of these concepts to other problems such as analysing competition when there are only a small number of sellers. On receiving the Nobel prize, Selten gave his Nobel Lecture on\n9\nDecember\n1994\n. His abstract is as follows:-\nThe order of stages in a multistage game is often interpreted by looking at earlier stages as involving more long term decisions. For the purpose of making this interpretation precise, the notion of a delay supergame of a bounded multistage game is introduced. A multistage game is bounded if the length of play has an upper bound. A delay supergame is played over many periods. Decisions on all stages are made simultaneously, but with different delays until they become effective. The earlier the stage the longer the delay. A subgame perfect equilibrium of a bounded multistage game generates a subgame perfect equilibrium in every one of its delay supergames. This is the first main conclusion of the paper. A subgame perfect equilibrium set is a set of subgame perfect equilibria all of which yield the same payoffs, not only in the game as a whole, but also in each of its subgames. The second main conclusion concerns multistage games with a unique subgame perfect equilibrium set and their delay supergames which are bounded in the sense that the number of periods is finite. If a bounded multistage game has a unique subgame perfect equilibrium set, then the same is true for every one of its bounded delay supergames. Finally the descriptive relevance of multistage game models and their subgame perfect equilibria is discussed in the light of the results obtained.\nAfter the award of the Nobel prize he published a number of other books:\nGame Theory and Economic Behaviour\n(1999)\n;\n(\nwith Michael Schreckenberg\n)\nHuman Behaviour and Traffic Networks\n(2004)\n; and\n(\nwith Daniel Friedman and Alessandra Cassar\n)\nEconomics Lab: An Intensive Course in Experimental Economics\n(2004)\n.\nSelten has been honoured by many awards in addition to the Nobel Prize. He received the Nordrheim Westfalen State Prize in\n2000\nand the Order of Merit Arts and Sciences in\n2006\n. He was elected to the\nAmerican Academy of Arts and Sciences\n, to the Rheinisch-Westfalen Akademie der Wissenschaften, and to a fellowship of the Econometric Society. He received honorary degrees from Bielefeld University\n(1989)\n, Frankfurt University\n(1991)\n, Graz University\n(1996)\n, University of East Anglia\n(1996)\n, Norwich University\n(1997)\n, Cachan University\n(1998)\n, Innsbruck University\n(2000)\n, Hong Kong University\n(2003)\nand Osnabrück University\n(2006)\n."
}