{
  "nome_completo": "Reinhold Baer",
  "nome_curto": "Reinhold Baer",
  "ano_nascimento": "1902",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baer/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Reinhold Baer\n's parents were Emil Baer and Bianka Timendorfer. Emil Baer had been born in Kempen, Posen, Prussia\n(\nsince\n1920\nthis town is Kepno, Poznań, Poland\n)\non\n10\nOctober\n1861\nbut at the time Reinhold was born he was living in Berlin where he was a successful clothing manufacturer. He was the son of Jakob Baer, a manufacturer, and Charlotte Gallewski, both from Kempen. Bianka was born in Berlin on\n30\nMarch\n1875\n, the daughter of Adolf Timendorfer and Sarah Loewy. Adolf Timendorfer was a merchant who had served in the Prussian army during the wars of\n1864\n,\n1866\nand\n1870\n-\n71\n. He died in Berlin in\n1922\n. Emil and Bianka were married in Berlin on\n28\nAugust\n1901\nand their only child was Reinhold, the subject of this biography. Sadly, it is relevant to the events of Baer's life to say at this point that both his parents and his four grandparents were Jewish. Now\n(\n[\n5\n]\nand\n[\n6\n]\n)\n:-\n.. the family was prosperous. They lived in Charlottenburg, an elegant part of Berlin. As a small child, Reinhold travelled a good deal with his parents, and remembered staying in the best hotels and eating exotic food.\nBaer began his studies at the Kaiser Friedrich Schule in Charlottenburg in\n1908\n. He remained in this Humanistisches\nGymnasium\nfor twelve years until he took the\nAbitur\nexamination and graduated at the age of\n18\nin\n1920\n. These were dramatic years with the\n1914\n-\n18\nwar having a major impact on German life. Also Baer's father had died in Berlin on\n28\nApril\n1917\n. When Baer began his schooling he had belonged to a prosperous family looking forward to a good future. By the time of his graduation, however, the family fortune was no more and the future looked difficult and uncertain. Baer felt that he could best support the family by training to be an engineer. He also decided that he would be more successful if he became a Christian so, in\n1920\n, he adopted the Protestant faith.\nHe studied mechanical engineering for a year at the Technische Hochschule at Hannover but, after an academic year studying the theory and the summer of\n1921\nspent undertaking practical engineering work in a factory, he realised that this was not the subject for him. He then changed to mathematics and philosophy at the Albert-Ludwigs University of Freiburg im Breisgau beginning his course on\n1\nOctober\n1921\n.\nWolfgang Krull\nhad just been appointed as a\nPrivatdocent\nin Freiburg and Krull's thesis advisor,\nAlfred Loewy\n, was an ordinary professor there.\nFriedrich Karl Schmidt\nhad been an undergraduate at Freiburg for two years when Baer arrived but they became friends\n(\n[\n5\n]\nand\n[\n6\n]\n)\n:-\nBaer found the town and surrounding Black Forest countryside very much to his liking and retained a great fondness for Freiburg throughout his life.\nHe went to Göttingen in\n1922\nand was influenced by\nEmmy Noether\nand\nHellmuth Kneser\n(\nthe son of\nAdolf Kneser\n)\nwho supervised Baer's doctoral thesis on the classification of curves on surfaces. Baer won a scholarship for specially gifted students in\n1924\nand this enabled him to study at Kiel for a year with\nHelmut Hasse\n,\nErnst Steinitz\nand\nOtto Toeplitz\n. He gained much mathematically in working with\nHasse\nbut this year also gave him the opportunity to continue his interest in philosophy and the foundations of mathematics for he made friends with\nHeinrich Scholz\n, a theologian and philosopher. During this year in Kiel, Baer wrote up his doctoral dissertation\nKurventypen auf Flächen\nⓉ\n(\nTypes of curves on surfaces\n)\n, and presented it to Göttingen in\n1925\n. It was published in\nCrelle\n's Journal in\n1927\nand presented a classification of the homotopy classes of closed curves on a closed orientable surface of genus >\n1\n. This was not his only publication in\n1927\nfor in that year he also published\nÜber nicht-archimedisch geordnete Körper\nⓉ\n(\nOn non-Archimedean ordered fields\n)\nand\nAlgebraische Theorie der differentiierbaren Funktionenkörper\nⓉ\n(\nAlgebraic theory of differentiable function fields\n)\n.\nA post at Freiburg was offered to him by\nAlfred Loewy\nwho was looking for an assistant. Baer held this assistant position from\n1926\nuntil\n1928\nand, during this time, he turned towards algebra.\nLoewy\nclearly was one of the main influences in this change of direction. There was another influence on Baer at Freiburg, however, namely\nWolfgang Krull\n. Influenced by\nLoewy\nand\nKrull\n, he began undertaking deep research into various aspects of algebra. But an event at Freiburg was to have a major influence on his personal life. In the autumn of\n1927(\n[\n5\n]\nand\n[\n6\n]\n)\n:-\n... Baer had been asked by a school friend to look up the daughter of a friend of his who was coming from Leipzig to continue mathematical studies at Freiburg. According to Baer's own account he complied, but grudgingly. Thus he met Marianne Kirstein, who was later to become his wife.\nTheir marriage took place in\n1929\nand Reinhold and Marianne had one son, Klaus Baer who become an Egyptologist and professor at the University of Chicago's Oriental Institute and also in its Near Eastern Languages Department. Baer\nhabilitated\nat Freiburg on\n1\nMarch\n1928\nand taught his first course there during the summer semester. However,\nHasse\noffered him a post at Halle in\n1928\nand Baer accepted, partly because the prospect of working with\nHasse\nexcited him but also because he would then be living close to Leipzig where his wife's parents lived and her father published art books. Baer's marriage was an extremely happy one but he gained mathematically as well. This was because Friedrich Levi, who had been a friend of his wife's family since she was a young girl, was teaching at Leipzig University. Baer and Levi began a mathematical collaboration which lasted until Levi's death in\n1966\n. While at Halle he undertook a joint project with\nHasse\n, publishing\nSteinitz\n's\nAlgebraische Theorie der Körper\nⓉ\n(\nAlgebraic theory of fields\n)\n, which had been first published in\nCrelle\n's Journal in\n1910\n. They turned\nSteinitz\n's paper into a book with a commentary on the text and an appendix on\nGalois theory\nwritten by Baer.\nWhile Baer was on holiday in Igls, near Innsbruck in Austria, with his wife, Hitler came to power and Baer was required to complete a questionnaire to comply with the \"Law for the Restoration of the Professional Civil Service\" enacted on\n7\nApril\n1933\n. He completed the form, giving details of his parents and grandparents, on\n30\nJune\n1933\nwhile still in Igls. He was then informed that his services at Halle were no longer required. In a letter written on\n7\nSeptember\n1933\nby the 'Prussian minister for science, art and education of the people' he was informed that:-\nBased on §\n3\nof the Law for the Restoration of the Professional Civil Service, dated\n7\nApril\n1933\n, I hereby withdraw your right to teach at the University of Halle-Wittenberg. Previously received remunerations shall cease by the end of September\n1933\n.\nBaer and his wife never returned to Halle but remained in Austria wondering what they should do.\nHelmut Hasse\nwas fully aware of Baer's predicament and he contacted\nLouis Mordell\nin England.\nMordell\nsent Baer an invitation to go to Manchester which he gladly accepted. British academics had set up the Academic Assistance Council to assist refugees and funded it from their own salaries. Baer was one of the first to get financial assistance from the Council and spent two academic years\n1933\n-\n35\nat Manchester as an Honorary Research Fellow\n(\n[\n5\n]\nand\n[\n6\n]\n)\n:-\nWhen the Baer family arrived in England, they stayed for the first three weeks with the Mordells, who were extremely kind and helpful to them. Marianne and Reinhold knew hardly a word of English, but they quickly learned to speak effortlessly and fluently, and were happy to be in Manchester. They met interesting non-mathematicians, something they always valued greatly wherever they lived. Among these were Leonard Palmer, then assistant lecturer in classics and later professor of comparative philology at Oxford, and the historian A J P Taylor. The Taylors had a cottage in the Peak District and the Baers often spent week-ends with them there, as well as longer periods hiking in the Lake District.\nAfter going to Oxford to meet\nWeyl\n, who was based at the Institute for Advanced Study in Princeton but spending\n1934\n-\n35\nin Oxford, Baer received an invitation to Princeton which he accepted and spent two years,\n1935\n-\n37\n, as a member of the Institute for Advanced Study. This was a wonderful time for Baer, both from the exciting mathematics and from the rural setting in hills and woods that he so enjoyed.\nBaer had begun studying infinite\nabelian groups\nwhile at Manchester and he continued his study of this topic at Princeton; in fact he lectured for a term in Princeton on infinite abelian groups. He moved to North Carolina at Chapel Hill as an assistant professor in\n1937\nbut when he was offered a position as Associate Professor of Mathematics at the University of Illinois at Urbana-Champaign in\n1938\nby\nArthur B Coble\nhe accepted the post. He was promoted to full professor at Urbana-Champaign in\n1944\nand, in the same year, both Baer and his wife became American citizens. However, the Baers did not find Illinois the ideal place to live since, as we have seen from their time in Germany, they loved the mountains. Now the United States is not short of mountains and the Rockies provided exactly the type of scenery that Baer loved. He made his first trip to Estes Park, Colorado in the Rockies in the summer of\n1939\nand returned there every year until\n1950\n. Often other friends stayed with the Baers at Estes Park, including\nRichard Brauer\n,\nHermann Weyl\nand\nMax Dehn\n. Baer had a very positive impact on the mathematical life at the University of Illinois at Urbana-Champaign\n[\n4\n]\n:-\nBaer's time in Illinois was very productive and led to much important work in both commutative and non-commutative group theory. He had no less than\n20\nPh.D. students ... Baer also had a very positive effect on the development of the Mathematics Department: in particular he was responsible for\nMichio Suzuki\ncoming to Illinois - a crucial event that led to the Department becoming a centre of research in finite simple group theory.\nHowever, Baer did not enjoy certain aspects, particularly teaching low level undergraduate mathematics of a standard that he considered \"high school mathematics\". He wanted to return to Germany as soon as the war had ended but, since he had not held a permanent position when he was dismissed, there was no post to which he could return. He was shortlisted for the professorship of mathematics at the University of Münster in\n1946\nbut was not successful. He attempted to get back into the German mathematical scene through visiting professorships and lecture tours, the first being in\n1950\n. We see how he felt from the letter he wrote to\nWilhelm Süss\nin June\n1951\n:-\nToday I would like to ask your advice, as you had offered it to us so generously on the occasion of our visit last year. As you know I have for quite a while been entitled to a sabbatical year, and i would like to spend this year in the intellectual realm of central Europe. There are many reasons: some sentimental and aesthetic, some intellectual and mathematical. And in order to squeeze the greatest benefit from this year, particularly concerning the latter reasons, I feel that I should once again fully integrate myself into the local academic community. The memories I have in this respect need to be refreshed, as the approaches and values here are quite different - even though I am sure that, after the catastrophes and enticements of the last\n18\nyears, European intellectual life has been exposed to ample Americanisation. I cannot quite estimate how such a temporary inclusion into German academia can be organised, and this is where I would be grateful for your advice. Apart from the intellectual problems, there is also a material problem. For the duration of such a sabbatical year the university will only pay half of my salary\n(\nand my wife's additional income will disappear completely\n)\n. The remaining amount may be considered quite sufficient in Europe, but I do have the running expenses here that absorb quite a proportion of my income on a regular basis, not to mention travel expenses and a certain necessary, not only desirable, degree of mobility in Europe. All of this will require careful planning, and there are some problems for which I cannot adequately envision solutions, and for this reason I am turning to you for advice. ...\nHe continued to hold his permanent position in the University of Illinois until\n1956\nwhen he returned to Frankfurt am Main in Germany, to the Johann Wolfgang Goethe-Universität where\nRuth Moufang\nheld a senior position. Despite wanting to return to Germany, he was sad to leave the United States and he returned for research visits over the following years; he was a visiting professor at the University of Chicago in\n1958\n, and at the University of California at Berkeley in\n1963\n. These were years during which he travelled world-wide, lecturing in New Zealand, South Africa, Japan and at many universities throughout North America. He visited the University of Warwick, England, in\n1966\n,\n1973\nand\n1977\n. I\n[\nEFR\n]\nmet him for the first time when he visited Warwick in\n1966\nand we met at several conferences over the following years. Baer retired from his professorship at Frankfurt in\n1967\nand, again showing his love for the mountains, he settled in Zürich. The school he built at Frankfurt is described by Otto Kegel, one of Baer's doctoral students\n[\n8\n]\n:-\nIn order to stimulate his research team and to kindle the curiosity of his students, Baer would bring in visitors for two weeks and Colloquium speakers working on problems of interest to at least one of us. Especially the visitors who stayed a little longer were of great value to all of us, as they gave seminar lectures and were available for detailed discussions. Once or twice a year Baer would transfer his seminar to Oberwolfach for week-ends or, occasionally, for a whole week. This, of course, was a very good occasion for closer scientific and personal contact within the group; the general climate was set by Reinhold and Marianne Baer. In a way, they considered his students as \"their children\". He believed that the only real way of learning mathematics is by doing mathematics; so he tried to be an exemplary mathematician teaching to do mathematics, at all levels. He was an infectious teacher, hiding a kind and very generous heart behind irony and\n(\noccasionally sharp\n)\nsarcasm.\nHis mathematical work, some of which has been mentioned above, was wide ranging;\ntopology\n, abelian groups and projective geometry. This last mentioned subject, which he was led to by his study of abelian groups, he thought of as being the lattice of all linear subspaces of a vector space. He then generalised this to consider a new type of geometry, namely the lattice of\nsubgroups\nof an abelian group. In\n1940\nhe introduced the concept of an injective module, then began studying group actions in geometry. He applied group theory to the study of projective planes and his work in this area led to the topic of combinatorics as we know it today. His algebraic formulation of geometry appeared in his paper\nA unified theory of projective spaces and finite abelian groups\n(1942)\n. His\n1952\nbook\nLinear algebra and projective geometry\npresented a completely new approach to projective geometry. He wanted:-\n... to establish the essential structural identity of projective geometry and linear algebra.\nFriedrich Levi writes in a review:-\nGeometers of the older type may wonder about a book which neither mentions the favourite subjects of classical geometry nor uses any method of analysis, but nevertheless gives a deep insight into the background of geometry. The results are obtained by a skilful combination of general algebra, lattice theory, and abstract set-theory with methods of classical synthetic geometry. A great number of \"remarks'' inserted into the text provide a welcome help to the reader who studies this very valuable and interesting work.\nProbably Baer's most important work, however, was in group theory; on the extension problem for groups, finiteness conditions,\nsoluble\nand\nnilpotent groups\n. From\n1950\nonwards his work turned more towards finiteness conditions on groups and generalisations of soluble and nilpotent groups. Many concepts in this area were introduced by him, in particular the Baer radical of a group and Baer groups\n(\ngroups in which every cyclic subgroup is subnormal\n)\n. He published the monograph\nGruppen mit abzählbaren Automorphismengruppen\nⓉ\n(\ngroups with countable automorphism\n)\n(1970)\non group theory. In it he studied groups whose factor groups all have countable automorphism groups, and groups every factor group of which has every abelian subgroup of its automorphism group countable.\nI\n(\nEFR\n)\nheard him lecture at the University of Warwick in\n1977\n. This was a sad occasion as by this time Baer knew that he was seriously ill\n(\nwith stomach cancer\n)\n. He described work which he felt he wanted to communicate but felt that he would not live long enough to be able to polish it to his high standards. An operation in\n1978\nwas successful and Baer enjoyed a while longer creating the mathematics he loved and communicating it to others showing his excitement and joy in his subject. He enjoyed a final Oberwolfach meeting in May\n1979\nwhere he was:-\n... a trim and fit figure, dressed in an open-neck white shirt, grey flannel trousers and tennis shoes. A happy smile on his face... .\nAmong the honours given to Baer, we mention that he received honorary degrees from the University of Giessen in\n1974\n, The University of Kiel in\n1976\n, and the University of Birmingham in\n1978\n."
}