{
  "nome_completo": "René Descartes",
  "nome_curto": "René Descartes",
  "ano_nascimento": "1596",
  "ano_morte": "1650",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Descartes/",
  "lugar_nascimento": "La Haye (now Descartes),Touraine, France",
  "lugar_morte": "Stockholm, Sweden",
  "biografia": "René Descartes\nwas a philosopher whose work,\nLa Géométrie\nⓉ\n(\nGeometry\n)\n, includes his application of algebra to geometry from which we now have Cartesian geometry.\nRené Descartes' parents were Joachim Descartes\n(1563\n-\n1640)\nand Jeanne Brochard\n(1566\n-\n1597)\n. Joachim, the son of the medical doctor Pierre Descartes\n(1515\n-\n1566)\n, studied law and was a counsellor in the Parliament of Brittany which sat at Rennes. Jeanne was the daughter of the military man René Brochard who formed part of the garrison stationed at Poitiers. One of Jeanne's brothers, also named René Brochard, became one of René Descartes' two godfathers; René Descartes was named after his godfather René Brochard. Jeanne's widowed mother, Jeanne Sain Brochard, lived at La Haye, near Tours, and it was in her home that René was born. Joachim and Jeanne Descartes were married on\n15\nJanuary\n1589\nand lived at Châtellerault. They had two surviving children older than René, a girl named Jeanne\n(\nborn\n1590)\nand a boy named Pierre\n(\nborn\n1591)\n. René was baptised in the Roman Catholic Church of Saint George in La Haye when he was four days old. His mother died in childbirth a year after he was born and the boy, born at the time of her death, also died. At this time, René was sent back to his grandmother's home in La Haye where he was cared for by Jeanne Sain Brochard. Joachim Descartes remarried in\n1600\nto Anne Morin and they had a boy named Joachim\n(\nborn\n1602)\nand a girl named Anne\n(\nborn\n1611)\n. René therefore had a older brother and an older sister, as well as a younger half-brother and younger half-sister. He did not return to live with his father and step-mother, however, but continued living with his grandmother at La Haye. Now René's health was poor when he was a child. Throughout his childhood, up to his twenties, he was pale and had a persistent cough which was probably due to tuberculosis. It seems likely that he inherited these health problems from his mother.\nDescartes was educated at the Jesuit college of La Flèche in Anjou. He entered the college at Easter\n1607\nat the age of eleven years where he became a boarder.\n[\nThere is some uncertainty here, with some biographers claiming that he entered the College two years earlier.\n]\nThe college had opened in January\n1604\nso was a comparatively new school. He studied there taking courses in classics, logic and traditional Aristotelian philosophy. He also learnt mathematics from the books of\nClavius\n, while studying all the branches of mathematics, namely arithmetic, geometry, astronomy and music. While in the school his health was poor and, instead of rising at\n5\na.m. like the other boys, he was granted permission to remain in bed until\n11\no'clock in the morning, a custom he maintained until the year of his death. In his final years at the school he studied natural philosophy, metaphysics and ethics. He left the La Flèche College in\n1614\n. School had made Descartes understand how little he knew, the only subject which was satisfactory in his eyes was mathematics. This idea became the foundation for his way of thinking, and was to form the basis for all his works.\nSee Descartes' own words describing his schooling at\nTHIS LINK\n.\nComparatively little is known of Descartes' life between\n1614\nand\n1618\n. He spent a while in Paris, apparently keeping very much to himself, and some have speculated that he might have suffered some sort of a breakdown at this time. Then he studied at the University of Poitiers, receiving a law degree from Poitiers in\n1616\n. He took the law degree to comply with his father's wishes but he quickly decided that this was not the path he wanted to follow. He wrote in\nDiscourse on the Method\n:-\nI entirely abandoned the study of letters, resolving to seek no knowledge other than that which could be found in myself or else in the great book of the world. I spent the rest of my youth travelling, visiting courts and armies, mixing with people of diverse temperaments and ranks, gathering various experiences, testing myself in the situations which fortune offered me, and at all times reflecting on whatever came my way so as to derive some profit from it.\nHe may have returned to Paris before he enlisted in the military school at Breda in\n1618\n, becoming a volunteer in the army of Maurice of Nassau. While in Breda his formal study was of military engineering but he started studying mathematics and mechanics under the Dutch scientist Isaac Beeckman, and began to seek a unified science of nature. Advised by Beeckman, he began considering mechanical problems. While in Holland, he wrote to Beeckman in March\n1619\nabout his new ideas:-\n[\nI want to promote a\n]\ncompletely new science by which all questions in general may be solved that can be proposed about any kind of quantity, continuous as well as discrete. But each according to its own nature. ... In arithmetic, for instance, some questions can be solved by\nrational\nnumbers, some by surd numbers, and others can be imagined but not solved. For continuous quantity I hope to prove that, similarly, certain problems can be solved by using only straight or circular lines, that some problems require other curves for their solution, but still curves which arise from one single motion and which therefore can be traced by the new compasses, which I consider to be no less certain and geometrical than the usual compasses by which circles are traced; and, finally, that other problems can be solved by curved lines generated by separate motions not subordinate to one another.\nAfter this time in Holland he left the service of Maurice of Nassau and travelled through Europe with the plan to join the army of Maximilian of Bavaria. In\n1619\nhe joined the Bavarian army and was stationed in Ulm. An important event in his life was three dreams he had in November\n1619\n. These he believed were sent by a divine spirit with the intention of revealing to him a new approach to philosophy. The ideas from these dreams would dominate much of his work from that time on.\nFor Descartes' own description of the ideas that he developed at this time see\nTHIS LINK\n.\nWhile serving Maximilian of Bavaria, Descartes was present as an official observer with the Catholic League at the Battle of the White Mountain near Prague in November\n1620\n. After this he left the army but since the plague was ravaging in Paris he could not return there but instead began a period of travel.\nFrom\n1620\nto\n1628\nDescartes travelled through Europe, spending time in Bohemia\n(1620)\n, Hungary\n(1621)\n, Germany, Holland and France\n(1622\n-\n23)\n. He spent time in\n1623\nin Paris where he made contact with\nMarin Mersenne\n, an important contact which kept him in touch with the scientific world for many years, and with\nClaude Mydorge\n. From Paris he travelled through Switzerland to Italy where he spent some time in Venice and in Rome, then he returned to France again\n(1625)\n. He renewed his acquaintance with\nMersenne\nand\nMydorge\n, and met\nGirard Desargues\n. His Paris home became a meeting place for philosophers and mathematicians and steadily became more and more busy. By\n1628\nDescartes, tired of the bustle of Paris, the house full of people, and of the life of travelling he had before, decided to settle down where he could work in solitude. He gave much thought to choosing a country suited to his nature and he chose Holland. What he longed for was somewhere peaceful where he could work away from the distractions of a city such as Paris yet still have access to the facilities of a city. It was a good decision which he did not seem to regret over the next twenty years. He told\nMersenne\nwhere he was living so that he might keep in touch with the mathematical world, but otherwise he kept his place of residence a secret.\nSoon after he settled in Holland, Descartes began work on his first major treatise on physics,\nLe Monde, ou Traité de la Lumière\nⓉ\n(\nThe world or a treatise on light\n)\n. He wrote to\nMersenne\nin October\n1629\n:-\n[\nThe foundations of physics\n]\nis the topic which I have studied more than any other and in which, thank God, I have not altogether wasted my time. At least I think that I have found how to prove metaphysical truths in a manner which is more evident than the proofs of geometry - in my opinion, that is: I do not know if I shall be able to convince others of it. During my first nine months in this country I worked on nothing else.\nThis work was near completion when news that\nGalileo\nwas condemned to house arrest reached him. He, perhaps wisely, decided not to risk publication and the work was published, only in part, after his death. He explained later his change of direction saying:-\n... in order to express my judgement more freely, without being called upon to assent to, or to refute the opinions of the learned, I resolved to leave all this world to them and to speak solely of what would happen in a new world, if God were now to create ... and allow her to act in accordance with the laws He had established.\nFor Descartes' own description of the contents of\nLe Monde, ou Traité de la Lumière\nⓉ\n(\nThe world or a treatise on light\n)\nsee\nTHIS LINK\n.\nIn Holland, Descartes had a number of scientific friends as well as continued contact with\nMersenne\n. His friendship with Beeckman continued and he also had contact with\nMydorge\n, Hortensius,\nHuygens\nand\nFrans van Schooten\n(\nthe elder\n)\n. Langer\n[\n112\n]\ndescribes Descartes' life in Holland:-\nAs throughout his life he continued to do his work abed in the mornings. His evenings he generally devoted to the consideration of his correspondence, which was mainly scientific, rarely personal, and of which he was painstakingly careful, while the intermediate part of the day he gave to relaxation. In matters of money he was neither extravagant nor parsimonious, showing himself in this respect a true philosopher. He always did some entertaining, now more, now less, professing to find considerable enjoyment in conversation, though he was himself rather taciturn.\nDescartes was pressed by his friends to publish his ideas and, although he was adamant in not publishing\nLe Monde\nⓉ\n(\nThe world or a treatise on light\n)\n, he wrote a treatise on science under the title\nDiscours de la méthode pour bien conduire sa raison et chercher la vérité dans les sciences\nⓉ\n(\nDiscourse on the method for conducting one's reason well and seeking the truth in the sciences\n)\n. Three appendices to this work were\nLa Dioptrique\nⓉ\n(\nDioptics\n)\n,\nLes Météores\nⓉ\n(\nMeteorology\n)\n, and\nLa Géométrie\nⓉ\n(\nGeometry\n)\n. The treatise was published at Leiden in\n1637\nand Descartes wrote to\nMersenne\nsaying:-\nI have tried in my \"Dioptrique\" and my \"Météores\" to show that my Méthode is better than the vulgar, and in my \"Géométrie\" to have demonstrated it.\nThe work describes what Descartes considers is a more satisfactory means of acquiring knowledge than that presented by\nAristotle\n's logic. Only mathematics, Descartes feels, is certain, so all must be based on mathematics.\nLa Dioptrique\nⓉ\n(\nDioptics\n)\nis a work on optics and, although Descartes does not cite previous scientists for the ideas he puts forward, in fact there is little new. However his approach through experiment was an important contribution.\nLes Météores\nⓉ\n(\nMeteorology\n)\nis a work on meteorology and is important in being the first work which attempts to put the study of weather on a scientific basis. However many of Descartes' claims are not only wrong but could have easily been seen to be wrong if he had done some easy experiments. For example\nRoger Bacon\nhad demonstrated the error in the commonly held belief that water which has been boiled freezes more quickly. However Descartes claims:-\n... and we see by experience that water which has been kept on a fire for some time freezes more quickly than otherwise, the reason being that those of its parts which can be most easily folded and bent are driven off during the heating, leaving only those which are rigid.\nDespite its many faults, the subject of meteorology was set on course after publication of\nLes Météores\nⓉ\n(\nMeteorology\n)\nparticularly through the work of\nBoyle\n,\nHooke\nand\nHalley\n.\nLa Géométrie\nⓉ\n(\nGeometry\n)\nis by far the most important part of this work. In\n[\n22\n]\nScott summarises the importance of this work in four points:-\nHe makes the first step towards a theory of invariants, which at later stages derelativises the system of reference and removes arbitrariness\n.\nAlgebra makes it possible to recognise the typical problems in geometry and to bring together problems which in geometrical dress would not appear to be related at all\n.\nAlgebra imports into geometry the most natural principles of division and the most natural hierarchy of method\n.\nNot only can questions of solvability and geometrical possibility be decided elegantly, quickly and fully from the parallel algebra, without it they cannot be decided at all\n.\nSome extracts from Descartes'\nLa Géométrie\nⓉ\n(\nGeometry\n)\nare at\nTHIS LINK\n.\nSome ideas in\nLa Géométrie\nⓉ\n(\nGeometry\n)\nmay have come from earlier work of\nOresme\nbut in\nOresme\n's work there is no evidence of linking algebra and geometry.\nWallis\nin\nAlgebra\n(1685)\nstrongly argues that the ideas of\nLa Géométrie\nⓉ\n(\nGeometry\n)\nwere copied from\nHarriot\n.\nWallis\nwrites:-\n... the Praxis was read by Descartes, and every line of Descartes' analysis bears token of the impression.\nThere seems little to justify\nWallis\n's claim, which was probably made partly through patriotism but also through his just desires to give\nHarriot\nmore credit for his work.\nHarriot\n's work on equations, however, may indeed have influenced Descartes who always claimed, clearly falsely, that nothing in his work was influenced by the work of others.\nDescartes'\nMeditations on First Philosophy\n, was published in\n1641\n, designed for the philosopher and for the theologian. It consists of six meditations, Of the Things that we may doubt, Of the Nature of the Human Mind, Of God: that He exists, Of Truth and Error, Of the Essence of Material Things, Of the Existence of Material Things and of the Real Distinction between the Mind and the Body of Man. However many scientists were opposed to Descartes' ideas including\nArnauld\n,\nHobbes\nand\nGassendi\n.\nThe most comprehensive of Descartes' works,\nPrincipia Philosophiae\nⓉ\n(\nPrincipals of philosophy\n)\nwas published in Amsterdam in\n1644\n. In four parts,\nThe Principles of Human Knowledge\n,\nThe Principles of Material Things\n,\nOf the Visible World\nand\nThe Earth\n, it attempts to put the whole universe on a mathematical foundation reducing the study to one of mechanics. This is an important point of view and was to point the way forward. Descartes did not believe in action at a distance. Therefore, given this, there could be no vacuum around the Earth otherwise there was no way that forces could be transferred. In many ways Descartes' theory, where forces work through contact, is more satisfactory than the mysterious effect of gravity acting at a distance. However Descartes' mechanics leaves much to be desired. He assumes that the universe is filled with matter which, due to some initial motion, has settled down into a system of vortices which carry the sun, the stars, the planets and comets in their paths. Despite the problems with the vortex theory it was championed in France for nearly one hundred years even after\nNewton\nshowed it was impossible as a\ndynamical system\n. As Brewster, one of\nNewton\n's\n19\nth\ncentury biographers, puts it:-\nThus entrenched as the Cartesian system was ... it was not to be wondered at that the pure and sublime doctrines of the 'Principia' were distrustfully received ... The uninstructed mind could not readily admit the idea that the great masses of the planets were suspended in empty space, and retained their orbits by an invisible influence ...\nPleasing as Descartes' theory was, even the supporters of his natural philosophy such as the Cambridge metaphysical theologian Henry More, found objections. Certainly More admired Descartes, writing:-\nI should look upon Des-Cartes as a man most truly inspired in the knowledge of Nature, than any that have professed themselves so these sixteen hundred years...\nHowever between\n1648\nand\n1649\nthey exchanged a number of letters in which More made some telling objections. Descartes however in his replies makes no concessions to More's points. More went on to ask:-\nWhy are not your vortices in the form of columns or cylinders rather than ellipses, since any point of the axis of a vortex is as it were a centre from which the celestial matter recedes with, as far as I can see, a wholly constant impetus? ... Who causes all the planets not to revolve in one plane\n(\nthe plane of the ecliptic\n)\n? ... And the Moon itself, neither in the plane of the Earth's equator nor in a plane parallel to this?\nIn\n1644\n, the year his\nMeditations\nwere published, Descartes visited France. He returned again in\n1647\n, when he met Pascal and argued with him that a vacuum could not exist, and then again in\n1648\n.\nIn\n1649\nQueen Christina of Sweden persuaded Descartes to go to Stockholm. However the Queen wanted to draw tangents at\n5\na.m. and Descartes broke the habit of his lifetime of getting up at\n11\no'clock. After only a few months in the cold northern climate, walking to the palace for\n5\no'clock every morning, he died of pneumonia.\nAfter his death an unfinished manuscript entitled\nRegulae ad directionem ingenii\nⓉ\n(\nRules for the direction of intelligence\n)\nwas found in his papers. Only the first\n21\nof the Rules were presented, the last three being only given by their intended titles. Sadly, the original manuscript has been lost and only copies remain. Here is a short extract from the manuscript:-\nI would not value these Rules so highly if they were good only for solving those pointless problems with which arithmeticians and geometers are inclined to while away their time, for in that case all I could credit myself with achieving would be to dabble in trifles with greater subtlety than they. I shall have much to say below about figures and numbers, for no other disciplines can yield illustrations as evident and certain as these. But if one attends closely to my meaning, one will readily see that ordinary mathematics is far from my mind here, that it is quite another discipline I am expounding, and that these illustrations are more its outer garments than its inner parts. This discipline should contain the primary rudiments of human reason and extend to the discovery of truths in any field whatever. Frankly speaking, I am convinced that it is a more powerful instrument of knowledge than any other with which human beings are endowed, as it is the source of all the rest.\nWe should end this biography by saying a little more about Descartes as a person. In\n[\n112\n]\nLanger describes Descartes' appearance and personality:-\nIn appearance Descartes was a small man of rather slight figure with a large head. His nose was prominent, his lower lip somewhat protruding, his beard and moustache of a semi-military type, and his hair growing down upon his forehead almost to his eyebrows. He wore a wig of natural colour to which he always gave fastidious attention, as he did also to his clothes which were now invariably of black cloth. In demeanour he was generally cheerful, rarely gay. His manners were always refined, gentle, and polite, and his temper tranquil and easy. As a personality he was proud, somewhat aristocratically reserved, sensitive, a bit angular, and, though a shade domineering, was pre-eminently obliging.\nBertrand Russell\nwrites\n[\n150\n]\n:-\nHe always was well dressed, and wore a sword. He was not industrious; he worked short hours, and read little. When he went to Holland he took few books with him, but among them were the Bible and Thomas Aquinas. His work seems to have been done with great concentration during short periods; but perhaps, to keep up the appearance of a gentlemanly amateur, he may have pretended to work less than in fact he did, for otherwise his achievements seem scarcely credible."
}