{
  "nome_completo": "Richard Delamain",
  "nome_curto": "Richard Delamain",
  "ano_nascimento": "1600",
  "ano_morte": "1644",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delamain/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "England",
  "biografia": "Richard Delamain\n's name is sometimes written as Delamaine. He was a joiner by trade but nothing else is known of his birth, parents or upbringing although it is clear that his family were of low social status. It is commonly stated that he studied mathematics at Gresham College, London, but the only evidence for this is a scornful comment by\nWilliam Oughtred\nwhen he is attacking Delamain's lack of expertise. For example, Taylor writes in\n[\n5\n]\nthat Delamain:-\n... by attending the Gresham lectures and mixing with learned men, acquired enough knowledge to become a teacher of practical mathematics.\nThis is, we believe, reading too much into a comment by\nOughtred\nwhich was meant to be hurtful to Delamain. Now we have come to the crux of the problem in giving any details of Delamain's education. Our only information on this comes from\nOughtred\nwhen he is trying his hardest to talk down Delamain's abilities. We therefore have to tread carefully and try to produce a balanced view of Delamain despite the deliberately unbalanced view presented by\nOughtred\n. It would appear that Delamain was not familiar with languages other than English, and his education had not given him Latin or French. However, he does seem to have travelled in France, in particular visiting Paris, and by the age of twenty he had reached a level which allowed him to become a master of a writing-school in Drury Lane. According to\nOughtred\n(\nsee, for example\n[\n14\n]\n)\n:-\n... Delamain took the degree of a Justices Clerk, or a Doctor of Physic, or both.\nCertainly, Delamain became a student of\nOughtred\n's and they were great friends at first.\nOughtred\nwrote that he gave Delamain:-\n... access to my chamber in Arundell House day by day, teaching and instructing him that faculty he professeth: not only satisfying his scruples in those things he partly knew but even laying the very foundation of diverse parts, whereof he was utterly ignorant.\nCertainly\nOughtred\nclaims to have taught Delamain astronomy, conic sections and optics. Delamain also claimed to have been tutored by\nEdmund Gunter\n. His income was mainly as a private tutor of mathematics in London and he taught his pupils to solve mathematical problems using instruments which he had designed. We will discuss below his ideas on teaching mathematics as well as his priority dispute with\nOughtred\nover the invention of calculating instruments. Delamain married Sarah and they lived in London in the upper part of Chancery Lane. They had at least eleven children, ten of whom survived their father. Their eldest son, also named Richard, was baptized on\n7\nMarch\n1627\nat St Andrew's Church, Holborn, and became a clergyman, although he certainly had some mathematical skills which he put to good use. Their son Alexander, baptized in the same church on\n3\nOctober\n1631\n, became a wealthy London tobacconist, while a third son Edward became a Baptist preacher.\nDelamain came to enjoy the patronage of Charles I, who was king of Great Britain and Ireland from\n1625\nto\n1649\n. Delamain was the same age as the king, both being born in\n1600\n. Delamain described a circular slide rule in a\n32\npage pamphlet\nGrammelogia; or the mathematical ring\nwhich he sent as a gift to the King in\n1629\n. He wrote a dedication which he included with the present:-\nI have no better thing as yet to express a loyal subject's heart and affection by: but only my self, which with my poor endeavours in all humble submission I cast down as your sacred feet.\nThe King was impressed and he made a grant to Delamain to cover the cost of printing the\nGrammelogia\nand making his mathematical-ring. The pamphlet was published in January of the following year and Delamain's fame as a mathematician rests on this work. On\n4\nJanuary\n1630\n, the King had granted Delamain more privileges, namely:-\n... privilege, license and authority for the sole making, printing, and selling of the said instrument and book: straightly forbidding any other to make, imprint, or sell, or cause to be made, or imprinted, or sold, the said instrument or book within any of our Dominions, during the space of ten years.\nOn\n4\nMarch\n1633\nthe King granted Delamain:-\n... the liberty to teach the use of the instruments in the city of London and elsewhere.\nThen on\n20\nMay\n1633\nthe King appointed Delamain as an engineer in the Office of Ordinance, assigned a salary of\n40\npounds per year and, in addition, a servant and\n2\nshillings per day when engaged on the King's business. Of course, military research always seems easier to fund and indeed the King seems to have seen Delamain as someone who would be able to construct machines of war. His task was set out as:-\n... the framing and contriving of warlike engines, ... and forts, raising batteries and entrenchments for both assault and defence.\nFrequent personal contact with the King led Delamain to believe that he might manage to secure a higher salary and he continually sought to increase his salary as well as more funds for building various different instruments. He even told the King, on one occasion, that he had been offered £\n200\nper year to enter the service of a foreign country\n(\nof course this may or may not have been true\n)\n. It is unclear quite how successful he was in his requests, but there is little doubt that he barely had enough money to live on and to pay those making the instruments. It must be understood that the King himself suffered a permanent financial crisis since during these years he was in dispute with Parliament which he kept dissolving. On\n20\nNovember\n1638\n, the King appointed Delamain to an engineer's post at a salary of £\n100\nper year with now\n60\nshillings per day extra when he was on the King's business. Certainly, Charles I was very impressed by Delamain and treasured the mathematical ring that Delamain had presented to him. During the Civil War, Charles I\n(\naccording to an account by Sir Thomas Herbert\n)\n:-\n... commanded Mr Herbert so give his son, the Duke of York\n(\nafterwards James II\n)\n, his large ring calculating-dial, of silver, a jewel his Majesty much valued; it was invented and made by Mr Richard Delamain, a very able mathematician, who projected it, and in a little printed book did show its excellent use in resolving many questions in arithmetic, and other rare operations to be wrought by it in the mathematics.\nIt is time that we gave more details of this 'large ring calculating-dial' which the King treasured and look at the dispute that it caused with\nWilliam Oughtred\n. In\n[\n10\n]\n(\nor\n[\n11\n]\n)\nsome details are given:-\nAfter having largely explained the use of the 'Grammelogia' in the solution of a variety of questions in proportion, in interest, in annuities, in the extraction of roots, etc., the author concludes thus: \"If there be composed three circles of equal thickness, A, B, and C, so that the inner edge of B, and the outer edge of A, be answerably graduated with logarithmic sines; and the outer edge of B, and the inner edge of C, with logarithms, and then, on the backside, be graduated the logarithmic tangents, and again the logarithmic sines opposite to the former graduations, it shall be fitted for the resolution of plain and spherical triangles.\nDelamain also emphasises that it is \"fit for use ... as well on horseback as on foot\". He also explains that he invented his ring as an improvement on\nEdmund Gunter\n's rule:-\n... by some motion, so that the whole body of logarithms might move proportionally the one to the other, as occasion required. This idea in February\n[1629]\nI struck upon, and so composed my 'Grammelogia' or 'mathematical ring'; by which only with an ocular inspection, there is had at one instant all proportionals through the said body of numbers.\nDelamain and\nOughtred\nhad a bitter dispute over the invention of a circular slide rule. Oughtred described the slide rule in\n1622\nbut the circular slide rule was not described by him until\n1632\n. Delamain also published\nThe Making, Description, and Use of ... a Horizontal Quadrant\n(1631)\nwhich Oughtred claimed consisted of ideas stolen from him. Jonathan Dawplucker, in\n[\n10\n]\n(\nor\n[\n11\n]\n)\n, makes\n(\nin my opinion\n)\nsensible comments on the argument:-\n[\nOughtred\n]\ncomplains that the said Delamain's mathematical ring is borrowed from his circles of proportion; but really, in my opinion, with no good reason; the instruments are very different from one another, both in their structure and in the mode of using them. In Delamain's we have two\n(\nor three\n)\nflat brass rings, of the same thickness, graduated and grooved on the edges, one moving within, and in contact with, the other:\nOughtred\n's instrument consists of one round plate, divided into several concentric circles, on which are laid down the logarithms of numbers, sines and tangents, and all operations are performed by means of two indices, radiating from a pin at the centre, like the legs of a sector; this mode of operation, it must be obvious, is far more complex, more inconvenient, and more liable to derangement, than the simple movement first proposed by Delamain.\nDelamain argued with\nOughtred\n, not only concerning the invention of the circular slide rule but also as regards the use of instruments in teaching mathematics.\nOughtred\n, in an attack on Delamain, claimed that:-\n... the true way of art is not by instruments, but by demonstration: and that it is a preposterous course of vulgar teachers to begin with instruments, and not with the sciences, and so instead of artists, to make their scholars only doers of tricks, and as it were jugglers.\nDelamain replied:-\nWhich words are neither cautious, nor subterfugious, but are as downright in their plainness, as they are touching, and pernicious, by two much derogating from many, and glancing upon many noble personages, with too gross, if not too base an attribute, in calling them 'doers of tricks, as it were to juggle': because they perhaps make use of a necessity in the furnishing of themselves with such knowledge by Practical Instrumental operation, when their more weighty negotiations will not permit them for Theoretical figurative demonstration; those that are guilty of the aspersion, and are touched therewith may answer for themselves, and study to be more Theoretical, than Practical: for the Theory, is as the Mother that produceth the daughter, the very sinews and life of Practise, the excellence and highest degree of true Mathematical Knowledge: but for those that would make but a step as it were into that kind of Learning, whose only desire is expedition, and facility, both which by the general consent of all are best effected with Instrument rather than with tedious regular demonstrations, it was ill to check them so grossly, not only in what they have Practised, but abridging them also of their liberties with what they may Practise, which aspersion may not easily be slighted off by any gloss or Apology, without an Ingenuous confession, or some mental reservation: To which vilification, howsoever, in the behalf of my self, and others, I answer; That Instrumental operation is not only the Compendiating, and facilitating of Art, but even the glory of it, whole demonstration both of the making, and operation is soly in the science, and to an Artist or disputant proper to be known and so to all, who would truly know the cause of the Mathematical operations in their original; But, for none to know the use of a Mathematical Instrument except he knows the cause of its operation, is somewhat too strict, which would keep many from affecting the Art, which of themselves are ready enough everywhere, to conceive more harshly of the difficulty, and impossibility of attaining any skill therein, than it deserves, because they see nothing but obscure propositions, and perplex and intricate demonstrations before their eyes, whose unsavoury tartness, to an inexperienced palate like bitter pills is sweetened over, and made pleasant with an Instrumental compendious facility, and made to go down the more readily, and yet to retain the same virtue, and working; And me thinks in this queasy age, all help may be used to procure a stomach, all bates and invitations to the declining study of so noble a Science, rather than by rigid Method and general Laws to scare men away. All are not of like disposition, neither all\n(\nas was said before\n)\npropose the same end, some resolve to wade, others to put a finger in only, or wet a hand: now thus to tie them to an obscure and Theoretical form of teaching, is to crop their hope, even in the very bud. ... The beginning of a man's knowledge even in the use of an Instrument, is first founded on doctrinal precepts, and these precepts may be conceived all along in its use: and are so far from being excluded, that they do necessarily concomitate and are contained therein: the practice being better understood by the doctrinal part, and this later explained by the Instrumental, making precepts obvious unto sense, and the Theory going along with the Instrument, better informing and enlightening the understanding, etc.\nIf we think in terms of modern instruments such as computers then one would have to say that Delamain's views have a ring of realism in today's world which are somewhat lacking in\nOughtred\n's high ideals. For example, almost everyone makes use of the Google search facility on the web without understanding the deep and clever mathematical ideas which underlie its use.\nIt appears that Delamain's devotion to the King was essentially put on to further his career for, as soon as the Civil War broke out in\n1642\n, he left the King's Court and joined the Parliamentary forces under Oliver Cromwell. As a recognised expert on fortifications, he was sent to various towns to fortify them against a possible attack by the King's forces. In particular, he was involved in erecting fortifications round Northampton, Newport\n(\nin Wales\n)\nand Abingdon. He also\n(\naccording to his wife Sarah\n)\nacted as Quartermaster General to the Parliamentary armies. He died while in the Parliamentary army some time before\n1645\n, about five years before Charles I was executed."
}