{
  "nome_completo": "Rimhak Ree",
  "nome_curto": "Rimhak Ree",
  "ano_nascimento": "1922",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ree/",
  "lugar_nascimento": "Hamhung, South Hamgyong Province, Korea (now North Korea)",
  "lugar_morte": "Vancouver, Canada",
  "biografia": "Rimhak Ree\n(\nwhose name is sometimes given as Im-hak Ree\n)\nwas born in Hamhung which is today the second largest city in North Korea but, when Ree was born it was, of course, a city in an undivided Korea. However, Korea at this time was not an independent country but was under Japanese rule following its official annexation in\n1910\n. He was educated at first at the elementary school, Hamhung No\n1\nPublic Ordinary School, up to the age of eleven when, on\n1\nApril\n1934\n, he entered Hamhung Public High School. This was a period when there was considerable active opposition to Japanese rule and his schooling was disrupted on many occasions when police and military police were sent into the classrooms to silence dissent. Ree graduated from the school in\n1939\nand began his university studies.\nRee entered Keijo Imperial University in\n1939\nand there he studied mathematics and physics in the Physics Department. Keijo is now known as Seoul and the Imperial University had been founded there in\n1924\n. As Korea was under Japanese rule at this time, the university was Japanese but unlike Imperial universities in Japan, the head of Keijo Imperial University was the Governor-General of Korea\n(\nwho was, of course, an administrator for the Japanese government\n)\n. Ree graduated in\n1944\nfrom Keijo University in\n1944\nwith a degree in physics\n(\nthe university did not offer degrees in mathematics\n)\nand went to Fengtianfu in Manchukuo. Today this city is known as Shenyang and it is in China but in\n1944\nwhen Ree went there it was, like Korea, under Japanese rule. In Fengtianfu, Ree worked as a supervisor for an aircraft company but he was not there for long since major changes came about following the defeat of Japan at the end of World War II with an occupying Soviet force arriving in August\n1945\nfollowing the surrender of Japan. Ree returned to his home town of Hamhung in Korea just before the Japanese surrender. Soon there were dramatic changes in his homeland with Korea being divided by the\n38\nth\nparallel into a Soviet administered north and a United States administered south.\nOn the defeat of Japan, Keijo Imperial University had been renamed Kyongsong University, then on\n22\nAugust\n1946\nit became part of the new Seoul National University which was formed from the merger of ten higher education institutions. In early\n1947\nRee began teaching at Seoul National University as an assistant professor. Later that year, in Namdaemun Market a large traditional market near the southern gate of the city of Seoul, Ree found the current issue of the\nBulletin\nof the\nAmerican Mathematical Society\nwhich had been left there unintentionally by some American soldiers. In the\nBulletin\nRee found the paper\nNote on power series\nby\nMax Zorn\nin which\nZorn\nsolved a problem originally posed by\nSalomon Bochner\nabout the convergence of certain power series with complex coefficients. In the paper\nZorn\nposed the question of whether the same result held for power series with real coefficients. Ree managed to solve the problem and sent his solution to\nMax Zorn\n.\nWhen\nZorn\nreceived Ree's solution he was impressed and sent it to the\nBulletin\nof the\nAmerican Mathematical Society\n. It was published in\n1949\nwith the title\nOn a problem of Max A Zorn\nand became the first mathematical paper published by a Korean in an international journal. Strangely, the\n1947\npaper by\nZorn\nwas the last paper he published for, despite still being a young man who carried on doing mathematics for another\n45\nyears, he gave up publishing at this point in his career. One might imagine that Ree would be overjoyed to have his first paper published in a prestigious journal but he did not realise that the paper had been published for over five years after he sent his solution to\nZorn\n. On\n25\nJune\n1950\nhis life was totally disrupted when the North Korean army invaded the South. Both armies had provoked the other in the preceding months with raids across the\n38\nth\nparallel. However, the invasion by the North Korean army saw soldiers rapidly pushing south and, on\n27\nJune\n1950\n, officials from Seoul were evacuated. Ree fled to Pusan, in the south east of the Korean peninsular and, by September\n1950\n, only Pusan was in the hands of the United Nations which had come to the aid of the South.\nIn\n1953\nRee was awarded a Canadian Scholarship to allow him to study for a Ph.D. at the University of British Columbia in Canada. There he worked with Stephen Arthur Jennings as his thesis advisor and was awarded his doctorate for his thesis\nWitt Algebras\npresented to the Faculty of Graduate Studies of the University of British Columbia in May\n1955\n. He had been much helped by attending the Summer Research Institute of the the\nCanadian Mathematical Congress\nduring the summer of\n1954\n, a visit which had been funded by a grant from the Congress. Results from his thesis were published in the paper\nOn generalized Witt algebras\n(1956)\n. However, he had already published a number of papers on group theory such as\nOn ordered, finitely generated, solvable groups\n(1954)\n,\n(\nwith Robert J Wisner\n)\nA note on torsion-free nil groups\n(1956)\n, and\nThe existence of outer automorphisms of some groups\n(1956)\n. He also published\nOn projective geometry over full matrix rings\n(1955)\n. Following the award of his doctorate, Ree was appointed as a lecturer at Montana State University. We have painted a very positive picture of Ree's work in Canada, but he had some hard times getting the right to work. When the time came to extend his visa at the Consulate, his passport was confiscated and he was declared a stateless person. In the summer of\n1955\nRee received a grant from the National Research Council of Canada and he worked with Jennings on\nLie\nalgebras. They published their joint work in\nOn a family of Lie algebras of characteristic p\n(1957)\n. Eventually, with considerable difficulty, his passport problems were satisfactorily sorted out and he continued to work at the University of British Columbia. Note that when he visited Columbia University in New York between September\n1959\nand June\n1960\nhe was still listed as a visiting foreign mathematician from Korea.\nIn\n1957\nRee published his first paper on finite simple groups, the topic for which he is best known today. In this paper\nOn some simple groups defined by C Chevalley\n, Ree identifies many classes of finite simple groups defined by\nClaude Chevalley\nin his ground-breaking\n1955\npaper, with classes of classical simple groups. Ree's most famous papers were\nA family of simple groups associated with the simple Lie algebra of type\nG\n2\nG_{2}\nG\n2\n​\n(1960)\nand\nA family of simple groups associated with the simple Lie algebra of type\nF\n4\nF_{4}\nF\n4\n​\n(1961)\nin which he announced the construction of new families of finite simple groups. He gave full details in two further papers with similar titles. Joseph Gallian writes\n[\n3\n]\n:-\nMichio Suzuki\n[\nin 'A new type of simple groups of finite order'\n(1960)]\n, while in the process of classifying a certain type of doubly transitive permutation groups, discovered another new infinite family. Analyzing the\nSuzuki\ngroups, Rimhak Ree noticed that when interpreted from a\nLie\n-theoretical point of view, they were closely related to a certain family of\nChevalley\ngroups. He then showed that the method of Steinberg could be used to construct the\nSuzuki\ngroups. This in turn led him to investigate two other similar situations and eventually discover his two families of simple groups. The\nSuzuki\nand Ree groups together with those of\nChevalley\nand Steinberg are collectively referred to as the simple groups of\nLie\ntype.\nIn fact these were the final two families of finite simple groups of\nLie\ntype to be discovered, bringing the total to sixteen classes. In\n1961\nhe was promoted to Assistant Professor at the University of British Columbia and then was given leave for the academic year\n1961\n-\n62\nso that he could spend it at Yale University in the United States. Ree was elected to the\nRoyal Society of Canada\nin\n1964\n. He was elected into the Korea Science & Technology Hall of Fame in natural sciences in\n2007\n. The article\n[\n2\n]\nreporting his election gives this tribute:-\nThe late Dr Prof Rimhak Ree was a world authority in group theory who originated the so called 'Ree Group' in\n1960\ns. His achievements of research in some\n29\nsimple groups including the two found in\n1960\ns made him a gigantic figure in world mathematic circles and remain as important accomplishments in the world history of mathematics. His fame is proved by the fact that over\n90\npapers of research on Ree Group were published during the\n1984\n-\n1994\nperiod. He was selected as one of the world's greatest contributors to group theory research along with\nCauchy\nand\nGalois\n. At the age of\n40\nhe was elected as fellow of\nRoyal Society of Canada\n. He is also famous as a teacher of\nLanglands\n[\nhe taught him\nGalois\ntheory\n]\n, one of the most famous contemporary mathematicians.\nHe was survived by his wife Rhoda, and sons Ronald, Robert and Richard; and also by two daughters by a previous marriage Erran and Hiran."
}