{
  "nome_completo": "Robert Simson",
  "nome_curto": "Robert Simson",
  "ano_nascimento": "1687",
  "ano_morte": "1768",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Simson/",
  "lugar_nascimento": "West Kilbride, Ayrshire, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Robert Simson\nwas the eldest son of John Simson and Agnes Simson\n(\nnée Simson\n)\n. Simson's mother had\n17\nchildren, all boys, only six of whom reached manhood. Simson entered the University of Glasgow as a student on\n3\nMarch\n1702\n, being\n14\nyears old at the time, and studied under the regent John Tran. He distinguished himself in classics, oriental languages and botany.\nHis father had intended that Robert should enter the church, and it was only by accident that his interests turned to mathematics. As a student of theology he was required to produce written work for his teachers. This he found unsatisfying, since he felt the arguments to be inconclusive and speculative. For recreation he turned first to a book on oriental philology, where he found statements that could be shown to be true or false, but this was not wholly satisfying and at that stage he had recourse to mathematics and\nEuclid\n's\nElements\n. He then set to work to study mathematics seriously, but he had to do this on his own, since at that time, for some reason, there were no lectures given on the subject by the professor Robert Sinclair.\nDuring his first year as a student in Glasgow Robert Simson was involved in a rather interesting incident which shows that, even before the Union of the Parliaments, Scottish as well as English students celebrated the\n5\nth\nof November with fireworks. On emerging from a close that night Robert was hurt in the face by shot from a pistol belonging to a fellow student Arthur Tran, who with a group of other students was firing a pistol and letting off squibs. They were hauled before the Faculty where Tran agreed that he had fired the pistol, and that he had said\nhe would shoot it in some old wife's lug.\nTran himself was fined half-a-crown, his friends lesser amounts and were publicly rebuked in the Common Hall. Tran may have been the son of the regent John Tran.\nIt is generally supposed that Robert Simson attended the University as a student for a period of about eight years until\n1710\n, this was not an unusual period of study at the time. In\n1710\nProfessor Robert Sinclair resigned, and Simson was offered the chair. He was disinclined to accept it immediately, and asked permission to spend some time in London, where he might have the opportunity to become acquainted with some of the most eminent mathematicians in England. This was granted and he went immediately to London where he met several well-known mathematicians, such as\nEdmond Halley\n, John Caswell\n(\nd.\n1712)\n, Savilian Professor of Geometry at Oxford,\nWilliam Jones\n, and finally Humphrey Ditton\n(1675\n-\n1715)\n, Mathematical Master at Christ's Hospital, with whom Simson was particularly friendly. While in London he was informed that, by the Faculty minute of\n8\nMarch\n1711\n, he had been nominated to the Glasgow chair\nproviding always, that he gives a satisfactory proof to the faculty of his skill in the Mathematics before his admission.\nHe returned to Glasgow, where on\n10\nNovember\n1711\nhe was given two geometrical problems to resolve. These he dealt with to the satisfaction of the Faculty\nafter which he gave a satisfactory specimen of his skill in mathematicks and dexterity in teaching geometry and algebra, he also produced sufficient testimonials from Mr Caswell the Professor of astronomy at Oxford and from others in London well skilled in the mathematicks, upon all which the faculty resolve he shall be admitted the nineteenth day of this instant November.\nThree days before his admission he graduated Master of Arts.\nIt was while he was in England that\nEdmond Halley\nsuggested to him that he might devote his considerable talents to the restoration of the work of the early Greek geometers, such as\nEuclid\nand\nApollonius of Perga\n. These are works that only survive in abbreviated accounts given by later mathematicians such as\nPappus of Alexandria\n. He first studied\nEuclid\n's so-called porisms.\nPlayfair\n's\n1792\ndefinition of porism is\na proposition affirming the possibility of finding such conditions as will render a certain problem indeterminate, or capable of innumerable solutions.\nSimson's work on\nEuclid\n's porisms was published in\n1723\nin the\nPhilosophical Transactions of the Royal Society\n, and his restoration of the\nLoci Plani\nof\nApollonius\nappeared in\n1749\n. Further work of his on porisms and other subjects including logarithms was published posthumously in\n1776\nby Lord Stanhope at his own expense. Simson also set himself the task of preparing an edition of\nEuclid\n's\nElements\nin as perfect a form as possible, and his edition of\nEuclid\n's books\n1\n-\n6\n,\n11\nand\n12\nwas for many years the standard text and formed the basis of textbooks on geometry written by other authors. The work ran through more than\n70\ndifferent editions, revisions or translations published first in Glasgow in\n1756\n, with others appearing in Glasgow, Edinburgh, Dublin, London, Cambridge, Paris and a number of other European and American cities. Recent editions appeared in London and Toronto in\n1933\nunder the editorship of\nIsaac Todhunter\n, and in São Paolo in\n1944\n. Simson's lectures were delivered in Latin, at any rate at the beginning of his career. His most important writings were written in that language, however, his edition of\nEuclid\n, after its first publication in Latin, appeared in English, as did a treatise on\nconic sections\nthat he wrote for the benefit of his students.\nHis reputation as a geometer has always been very high, although, as a critic wrote\nthe additions and alterations which Simson made by way of restoring the text to its 'original accuracy' are certainly not all of them improvements, and the notes he appended show with what reverence he regarded the great geometers of antiquity.\nThere was a feeling in some quarters that, by limiting his efforts to the attainment of he perfect text, he lost an opportunity of applying his own considerable talents and insight to a more useful exposition of his subject. For Simson the best vehicle for presenting a mathematical argument was geometry and, although he was familiar with the recent developments in algebra and the\ninfinitesimal\ncalculus, he preferred to express himself in geometrical terms wherever possible. He was not, of course, alone in this, as\nNewton\nhad adopted the same viewpoint when writing his\nPrincipia\n.\nThat Simson's work was not restricted to Greek geometry is illustrated by Tweddle's paper\n[\n3\n]\n, in which he discusses an early manuscript of Simson dealing with inverse tangent series and their use in calculating π.\nFor fifty years Simson lectured five days a week during term time to his two main classes. By all accounts he was a good lecturer, although better in his younger days than towards the end of his life, when his absence of mind made him the victim of practical jokes. Several of his pupils achieved distinction in mathematics, notably\nMaclaurin\n,\nStewart\n, John Robison who became Professor of Natural Philosophy in the University of Edinburgh and\nTrail\n.\nSimson was a good looking man, tall of stature and favouring light coloured cloths. He was unmarried and so had no use of the commodious house in the College to which he was entitled, but lived in rooms there. He ate all his meals, including breakfast, at a small tavern opposite the College gate kept by a Mrs Millar. He delighted in showing visitors round the College and was very knowledgeable about the large collection of Roman antiquities coming from the Antonine Wall and its neighbourhood.\nAccording to the Reverend Alexander Carlyle\nHe was particularly averse to the company of ladies, and, except one day in the year, when he drank tea at Principal Campbell's and conversed with gaiety and ease with his daughter Mally, who was always his first toast, he was never in company with them. It is said to have been otherwise with him in his youth, and that he had been much attached to one lady, to whom he had made proposals, but on her refusing him he became disgusted with the sex. The lady was dead before I became acquainted with the family, but her husband I knew, and must confess that in her choice the lady preferred a satyr to Hyperion.\nSimson was a sociable man. On Friday evenings he would meet with friends at a club in a nearby tavern, where he would play whist, a game in which he excelled. This was followed by a period of conversation and singing. He was fond of singing Greek odes set to contemporary music.\nEvery Saturday he would walk, alone or in company, to an inn in the nearby village of Anderston, where he played host to his particular friends and any visitors to Glasgow that he had invited to join him for dinner.\nHe was a most methodical man and, on daily walks in the College garden and elsewhere, he counted the number of paces from one place to another.\nRobert Simson was the first person to be appointed to the office of Clerk\n(\nlater known as Clerk of Senate\n)\n, which he took up in\n1728\nand only demitted when he retired in\n1761\n. In\n1761\nhe retired from his chair having held it for fifty years. He kept his rooms in the tower until his death, but gave up his College house, which he had never lived in. Simson remained in good health until a few years before his death, during which period he had to employ an amanuensis to assist him in revising his geometrical writings.\nA year before he retired from the Chair of Mathematics, Simson had proposed that his colleague James Buchanan, the Professor of Oriental Languages, should relieve him of his teaching duties on condition of succeeding to the Chair when he retired, but Buchanan died before any action was taken. Before Simson retired in\n1761\nhe stipulated that his Assistant James Williamson should succeed him, and this was agreed.\nRobert Simson died in his eight-first year and was buried in the neighbouring Blackfriars burial ground, where a marble tombstone, bearing a long laudatory Latin inscription, was raised in his memory. Later, through the efforts of a Mr Fullerton of Overton in the parish of West Kilbride, an imposing monument fifty feet high was erected in West Kilbride cemetery, bearing the inscription in which he is described as\nthe Restorer of Grecian Geometry, and by his Works the Great Promoter of its Study in the Schools.\nSimson bequeathed his very large library of books and papers to the University of Glasgow, where they comprise the valuable Simson Bequest. The collection includes the sixteen volumes of his daily notebooks, the\nAdversaria\n. These cover the years\n1715\n-\n1765\nand consist of numerous geometrical problems interspersed with exercises in algebra and astronomy, as well as occasional accounts of financial transactions.\nAdditional comments\nSimson also made many discoveries of his own in geometry and the Simson line is named after him. However the Simson line does not appear in his work but\nPoncelet\nin\nPropriétés Projectives\nsays that the theorem was attributed to Simson by\nServois\nin the\nGergonne\n's Journal. It appears that the theorem is due to\nWilliam Wallace\n.\nSee\nTHIS LINK\n.\nThe University of St Andrews awarded Simson an honorary Doctorate of Medicine in\n1746\n.\nIn\n1753\nSimson noted that, as the\nFibonacci numbers\nincreased in magnitude, the ratio between adjacent numbers approached the\ngolden ratio\n, whose value is\n1\n2\n(\n1\n+\n√\n5\n)\n=\n1.6180\n\\large\\frac{1}{2}\\normalsize (1 + √5) = 1.6180\n2\n1\n​\n(\n1\n+\n√\n5\n)\n=\n1\n.\n6\n1\n8\n0\n..."
}