{
  "nome_completo": "Robert Charles Thompson",
  "nome_curto": "Robert C Thompson",
  "ano_nascimento": "1931",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thompson_Robert/",
  "lugar_nascimento": "Winnipeg, Manitoba, Canada",
  "lugar_morte": "Santa Barbara, California, USA",
  "biografia": "Although\nRobert Thompson\nwas born in Winnipeg, he grew up close to Vancouver in British Columbia, and it was in British Columbia that his school and undergraduate university education took place. He entered the University of British Columbia in Vancouver where he received his bachelor's degree, and then continued to study for his master's degree at the same university. For his doctoral studies, however, Thompson moved to the United States, and he became\nOlga Taussky-Todd\n's first Ph.D. student at California Institute of Technology, beginning his studies shortly after she arrived there with her husband.\nThompson was awarded a Ph.D. in\n1960\nfor his thesis\nCommutators in the Special and General Linear Groups\n. In\n1961\nThompson published a paper\nCommutators in the special and general linear groups\nin the\nTransactions of the American Mathematical Society\nwhich was based on results from his thesis. In the paper he looks at matrices over a field\nK\nK\nK\nwith at least\n4\nelements. He proves that a matrix\nA\nA\nA\nin\nS\nL\n(\nn\n,\nK\n)\nSL(n, K)\nS\nL\n(\nn\n,\nK\n)\ncan be written in the form\nB\n−\n1\nC\n−\n1\nB\nC\nB^{-1}C^{-1}BC\nB\n−\n1\nC\n−\n1\nB\nC\n, where\nB\n,\nC\nB, C\nB\n,\nC\nbelong to\nS\nL\n(\nn\n,\nK\n)\nSL(n, K)\nS\nL\n(\nn\n,\nK\n)\n, except perhaps when\nA\nA\nA\nis a scalar matrix and\nK\nK\nK\nhas characteristic\n0\n. A scalar matrix in\nS\nL\n(\nn\n,\nK\n)\nSL(n, K)\nS\nL\n(\nn\n,\nK\n)\nis, however, a product of two commutators. Although the paper does not examine the cases where\nK\n=\nG\nF\n(\n2\n)\nK = GF(2)\nK\n=\nG\nF\n(\n2\n)\nor\nG\nF\n(\n3\n)\nGF(3)\nG\nF\n(\n3\n)\n, Thompson gave complete information about these in his thesis and went on to publish the results for\nK\n=\nG\nF\n(\n3\n)\nK = GF(3)\nK\n=\nG\nF\n(\n3\n)\nin\nOn matrix commutators\n(1962)\nand the case for\nK\n=\nG\nF\n(\n2\n)\nK = GF(2)\nK\n=\nG\nF\n(\n2\n)\nin\nCommutators of matrices with coefficients from the field of two elements\n(1962)\npublished in the\nDuke Mathematical Journal\n. These papers are described by Charles R Johnson and Morris Newman in the following way:-\nIn that very detailed work, Thompson answered nearly all the major questions in the subject and revealed what would become a hallmark of his work: a willingness and an ability to make unusually elaborate algebraic calculations in order to answer a question. It was not that he did not appreciate external or efficient, implicit tools if they were available. Quite the contrary: he was a major proponent of the use of other parts of mathematics that could be useful in matrix theory.\nAfter Thompson was awarded his doctorate he returned to Canada, going back to the University of British Columbia where he was on the faculty for three years. In\n1963\nhe moved to the University of California at Santa Barbara where he remained on the faculty for the rest of his career.\nThompson published over\n120\npapers and four undergraduate textbooks during his career. He attacked problems over a long period with great persistence and emphasis on detail. As a result he published a number of series of papers attacking particular problems. For example, he published nine papers on\nPrincipal submatrices\nin which he conducted a deep investigation of interlacing properties relating the eigenvalues of a matrix to the eigenvalues of a principal submatrix. For example\nInvariant factors of integral quaternion matrices\nwhich Thompson published in\nLinear and Multilinear Algebra\nin\n1987\nwas reviewed by Morris Newman as follows:-\n[\nThompson's\n]\npurpose in this paper is to develop the theory of unimodular equivalence for matrices whose entries come from the\nHurwitz\nring of integral quaternions. This is done in complete detail, and a normal form is obtained which exhibits as much uniqueness as is possible for the case of a noncommutative ring. The author also proves a number of results concerned with the relationship between the invariant factors of a full matrix and the invariant factors of a submatrix, which generalize his earlier work on this subject.\nIn\n1990\nThomson spoke at a conference in Auburn, Alabama. His lecture\nHigh, low, and quantitative roads in linear algebra. Directions in matrix theory\nwas a particularly interesting one for in it he attempted to predict the future direction of core linear algebra. He discussed: quantitative prediction; high and low roads; the numerical range; similarity invariants of principal submatrices; commutators; the triangle inequality; the facial structure of the unit ball; the Gershgorin circle theorem; matrices, graphs, inertia, number theory; power embeddings and dilatations; the\nSchubert\ncalculus; the spectrum of a sum of Hermitian matrices; the\nHadamard\n-\nSchur\nproduct; the exponential function; the exponential function and commutativity; integral quadratic forms; the matrix-valued numerical range; inequalities with subtracted terms; and further uses of the computer.\nEditorial work was important to Thompson: he was a contributing editor of\nLinear Algebra and its Applications\nand an editor of the\nSociety for Industrial and Applied Mathematics\nJournal on Matrix Analysis\n. Thompson's influence on linear algebra was felt in other ways too for he was one of the founders of the International Linear Algebra Society and of the journal\nLinear and Multilinear Algebra\n. Given this experience his article\nAuthor vs. referee: a case history for middle level mathematicians\nwhich appeared in the\nAmerican Mathematical Monthly\nin\n1983\nis all the more interesting. He explains in the introduction why he wrote it:-\nThis note evolved from a referee's rejection of a research paper that I wrote. The reasoning behind the rejection was perhaps unusual, and leads to a not altogether trivial question concerning the role of the referee in the professional development of a mathematician. The discussion will be more candid than is customary, and this may add spice to the article, since confession of failure, or even of sin, is always interesting.\nThompson's health deteriorated and heart problems were diagnosed:-\nHe retained his sense of humour and optimism to the end; although fully aware of his condition, he did not let it interfere with his work or discourage him. In fact, shortly before his death, he mentioned that he had told his doctors they were obligated to keep him alive for at least four more years, since he had just purchased an athletic club membership for that amount of time.\nSadly the doctors failed to give him four years for he died while waiting for a heart transplant. Sadly the award of the International Linear Algebra Society's Hans Schneider Prize in Linear Algebra came after his death."
}