{
  "nome_completo": "Robert Charles Geary",
  "nome_curto": "Robert Geary",
  "ano_nascimento": "1896",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Geary/",
  "lugar_nascimento": "Drumcondra, Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "Robert Geary\nwas known to his friends and colleagues as Roy. His parents were Edmond Geary and Jennie O'Sullivan. Edmond Geary was from Cork and, after working in the Customs Service in Gravesend, he returned to Ireland to work in the General Registrar's Office in Charlemont House. We note that the\nLondon Gazette\nof\n24\nJune\n1892\nrecords\n[\n11\n]\n:-\nThe following candidates have been certified by the Civil Service Commissioners after open competition: Clerks: Edmond Geary.\nAlso the\nLondon Gazette\nof\n4\nJuly\n1905\nrecords\n[\n12\n]\n:-\nGeneral Register Office, Dublin: Minor staff officer, Edmond Geary.\nJennie O'Sullivan\n(\nborn\n1870)\nwas from Kerry and she married Edmond Geary\n(\nborn\n1867)\nin\n1895\n. They had four children, Robert Charles Geary\n(\nthe subject of this biography\n)\nknown as Roy, Kathleen Patricia Geary\n(\nborn\n1897)\nknown as Kathna, John Peter Geary\n(\nborn\n1900)\nknown as Jack, and Clare Emilia Geary\n(\nborn\n1902)\n. We note that these dates of birth are approximate since they are computed from their ages at the time of the\n1911\ncensus. We note that Edmond Geary was in charge of this\n1911\ncensus, having been a clerk for the earlier\n1901\ncensus. He also was an advisor to the\n1926\ncensus. We do know exact dates of death for Roy's parents: Jennie died on\n7\nAugust\n1929\n, and Edmond on\n29\nAugust\n1936\nat his home at\n2\nIona Park, Glasnevin, Dublin. Jack Geary became a medical doctor with a practice in London. As youngsters both Jack and Roy were renowned as excellent footballers.\nJennie Geary was a talented musician who played the piano. She taught her children to appreciate music and play various instruments. Roy played the cello, Clare played the piano, while Jack and Kathna were violinists. The four children occasionally formed a quartet. The love of music that Roy discovered as he grew up stayed with him throughout his life and remained important to him.\nGeary was a primary pupil at the Glasnevin Model Training School and then a secondary pupil at O'Connell School before entering University College Dublin in\n1913\n. The O'Connell School was a Christian Brothers school in North Richmond Street in Dublin. It had been established in\n1829\nand had some notable pupils such as the novelist James Joyce. At the O'Connell School Geary was influenced by Brother Walsh who taught him mathematics. From this school he won a Dublin Corporation scholarship, and he held this and a College Scholarship during his three years at University College Dublin. He graduated with a First Class degree in Mathematics and Mathematical Physics in\n1916\n. After graduating with his first degree, Geary remained at University College Dublin for two further years studying for his Master's Degree. He was awarded an M.Sc. in\n1918\nand won a Travelling Scholarship which enabled him to continue to study at the Sorbonne in Paris beginning in\n1919\n.\nAt the Sorbonne, Geary attended lectures by\nÉmile Borel\n, who held the chair of Theory of Functions,\nÉlie Cartan\n, who held the Chair of Differential and Integral Calculus,\nÉdouard Goursat\n, an expert on differential equations, and\nHenri Lebesgue\nwho was Professor of the Application of Geometry to Analysis. He also attended lectures by Paul Langevin who was professor of physics at the Collège de France. Geary fell in love with France during these two years and became fluent in French. For the rest of his life he read French books and newspapers to maintain his fluency. In\n1921\nhe returned to Dublin where he did some teaching and continued to undertake research.\nWe should, at this point, say a little about Geary's political views since these play an important part in his future career. The complications of the Irish bid for home rule are too complicated to go into in detail here but let us record that there was a movement for an independent all-Ireland and one that would retain parts of the north within the United Kingdom. A Protestant paramilitary force, the Ulster Volunteer Force, was organised in\n1912\nto fight Irish Home Rule. On\n25\nNovember\n1913\n, a meeting in the Rotunda Hall, Dublin, set up the Irish Volunteers to counter the Ulster Volunteer Force. Geary, who was still a school pupil, was present at this meeting. We should not infer from this that Geary favoured violence as a means of gaining Irish independence - he certainly did not. The Irish Volunteers led the Easter Rising of\n1916\nwhen they took Dublin by force and declared the establishment of the Irish Republic. Geary was, by this time, in his final year as an undergraduate at University College Dublin and certainly did not support the Easter Rising. The majority of people in Ireland also opposed the armed coup d'état but the reaction of the British government following the Rising soon changed opinions. Executions and the introduction of conscription turned people in favour of the Rising. Geary supported Arthur Griffith who founded Sinn Fein:-\nSinn Fein aims at securing the international recognition of Ireland as an independent Irish Republic.\nSinn Fein was declared illegal in August\n1919\nand throughout the next couple of years the Irish rebellion developed. In\n1921\nIreland was still represented by a football team which supposedly represented the whole country, both north and south. This team, which contained\n10\nplayers from the north and one from the south, played France in Paris in that year. Geary was studying in Paris at this time and, along with three fellow students, they stationed themselves one on each of the four sides of the pitch carrying a tri-colour, the flag symbolising Irish nationalism. The Irish team refused to take the field until the flags were removed and Geary and his three companions were removed by the police.\nWe have looked at Geary's involvement in the political situation to try to understand his actions in\n1922\n. After returning from Paris, he was offered a lectureship in mathematics and mathematical physics at the University of Southampton. He accepted this position. However the Irish Treaty of December\n1922\nled to the division of Ireland with the creation of the Irish Free State with Ulster remaining part of the United Kingdom. British troops left the Irish Free State but a civil war now raged between those who supported the division of Ireland and those who wanted to continue to fight for a united Ireland. It is unclear whether Geary ever took up his position in the University of Southampton in the autumn of\n1922\nbut he certainly resigned quickly and by\n1923\nhe was in Ireland\n(\nin fact he may never have left Ireland\n)\n. Certainly by November\n1922\nhe was seeking a position in the Statistics Branch in the Department of Industry and Commerce. At this time, John Hooper, the head of the Statistics Branch, wrote to George Campbell, secretary to the Department of Industry and Commerce, about Geary\n(\nsee\n[\n5\n]\n)\n:-\nI think you should warn him that, if he is to do your work in the manner you will expect, he will have little energy left for any ambitious research in higher mathematics ... he is anxious to make a name for himself. His ordinary work will of course be much more prosaic but he will find it interesting.\nGeary's political position was certainly in favour of the Irish Treaty and he got as far as attempting to join the pro-Treaty army in the civil war but when he tried to enlist the recruiting office was closed and he never returned. By the middle of\n1923\nthe civil war was over but Geary had decided before that that his duty was to remain in Ireland and give the new country his full support. He took up a position in the Civil Service on\n1\nJanuary\n1923\n, joining the staff of the Statistics Branch in the Department of Industry and Commerce as a Junior Administrative Officer. Of course this major change of direction meant that in fact he followed a career similar to that of his father. Initially his post was a temporary non-established one but on\n13\nJanuary\n1926\nthe post became a permanent established one.\nGeary had undertaken research in mathematics up to\n1922\nwithout publishing anything. When he became a statistician in\n1923\nhe began to undertake research in statistics and published his first paper in\n1925\n, namely\nMethods of sampling applied to Irish statistics\npublished in the\nJournal of the Statistical and Social Inquiry Society of Ireland\n[\n29\n]\n:-\nFisher\nwas in the early stages of his fundamental work and the celebrated collaboration of\nNeyman\nand\nPearson\nhad not begun. Roy took no part in the major controversies on fiducial probability and inference which were soon to come but followed the struggles with keen interest. The greatest influence on him was\nFisher\n. He admitted in a letter of\n1976\n: \"The luckiest thing that happened to me was that my research lifetime coincided with most of that of\nFisher\n's. Everything is in\nFisher\n. One only had to dig it out a bit.\" He was obviously greatly attracted to the\nNeyman\nand\nPearson\napproach, however, and used it consistently.\nGeary's career now progressed rapidly. Continuing to work in the Department of Industry and Commerce, he was appointed as Senior Technical Assistant on\n1\nOctober\n1926\nbecoming Assistant Principal on\n6\nJanuary\n1932\n. He married Mida Maura O'Brien in\n1927\n; they had one son and one daughter, Colm and Clodagh. Mida was very musical and sang beautifully. She was an active member of the Rathmines and Rathgar Musical Society and also worked at the Gate Theatre in Dublin.\nSome papers Geary published between\n1927\nand\n1936\nare:\nSome properties of correlation and regression in a limited universe\n(1927)\n,\nThe frequency distribution of the quotient of two normal variates\n(1930)\n,\nThe future population of Saorstat Eireann and some observations on population statistics\n(1935)\n,\nThe ratio of the mean deviation to the standard deviation as a test of normality\n(1935)\n,\nNote on the correlation of\nb\n2\nb_{2}\nb\n2\n​\nand w\n(1935)\n,\nThe distribution of 'Student's' Ratio for non-normal samples\n(1936)\nand\nMoments of the ratio of the mean deviation to the standard deviation for normal samples\n(1936)\n.\nGeary's work on estimating and comparing national incomes made an international impression and in August\n1946\nRichard Stone\n(1913\n-\n1991)\ninvited him to spend a year in the Department of Applied Economics of Cambridge University. The work that Stone and Geary did at Cambridge in the years\n1946\n-\n47\nled to what today is known as the Stone-Geary Utility Function. Geary did not return to his position in Dublin at the end of his year at Cambridge, for the following year he spent at the National Accounts Branch in the United Nations Statistical Office in New York. Returning to Dublin, Geary was appointed as head of the newly created Central Statistics Office in\n1948\n. He held this position until\n1957\nwhen he returned to New York to take up the position of Chief of the National Accounts Branch of the Statistical Office of the United Nations. He spent three years in New York and during that time he was a Visiting Professor at the New School, New York during\n1958\n-\n59\n. Leaving New York in\n1960\n, he returned to Ireland to take up the position of Director of the Economic Research Institute. We note that Geary had now moved from statistics to an economics post. Peter Neary writes\n[\n24\n]\n:-\nRoy Geary was not an economist by training or inclination. His jousts with \"literary\" economists have been well documented and he seems to have had little time for pure theory either. Of course he worked with economic statistics for most of his life and in his later years published extensively on applied economics topics. But he appears to have had little appreciation of the deductive as opposed to the inductive side of economics. So it is all the more remarkable that, in addition to his seminal work in statistics and econometrics, he made a number of important contributions to economic theory.\nNeary describes three major contributions by Geary to economics. There is\n(\ni\n)\nthe Stone-Geary Utility Function which we mentioned above,\n(\nii\n)\nhis algorithm to determine international comparisons of real income, and\n(\niii\n)\nhis work on measuring the increase in the real income of a country coming about from changes in its terms of trade. Geary continued as Director of the Economic Research Institute until he retired in\n1966\n. At this time the Institute honoured him by establishing the annual Geary Lecture. Geary continued to work as a consultant for the Institute and attended the annual lecture named after him, right up until his death.\nAlthough Geary's statistical work received the highest praise, the books that he wrote were somewhat less well received and had mixed reviews. For some brief extracts of reviews of:\nElements of Linear Programming with Economic Applications\n(1964)\n, by R C Geary and M D McCarthy; and\nExercises in mathematical economics and econometrics\n(1974)\n, by J E Spencer and R C Geary see\nTHIS LINK\n.\nWe note that\nElements of Linear Programming with Economic Applications\nhas a second edition which appeared in\n1973\nbut with authors R C Geary and J E Spencer. Geary also wrote the book\n(\nwith M Palekar\n)\nA short manual on sampling\n.\nAs an example of Geary's style we quote from\n[\n4\n]\n:-\nDr Geary's editorial survey begins with a characteristically entertaining commentary on the present state of quantitative economics, and is followed by penetrating comments on several technical features of the individual contributions.\nHere is an extract from that \"characteristically entertaining\" editorial:-\nThe object of economics is to improve the material welfare of mankind. To this end, the only topic in economics worthy of serious consideration is economic programming at all levels. Economics must therefore be converted with all due speed into an experimental science and the essence of science is measurement. Literary economics is outmoded; its gimcrack edifice would have collapsed long ago if it were not kept up by the wallpaper of style; let's have done with it. Because of its survival, economics, regarded as a science, is at the phlogiston stage of chemistry before the advent of Lavoisier and Priestley. The littérateurs don't seem to know this; we could, in Charity, forgive them anything but their complacency\nNot surprisingly, Geary corresponded with\nWilliam Sealy Gosset\n, better known as \"Student\". Some details of their correspondence are given at\nTHIS LINK\n.\nGeary received many honours for his statistical contributions. These included: election to the International Statistical Institute in\n1935\nand serving as its Vice President from\n1951\nto\n1957\n; being elected Vice President of the\nRoyal Irish Academy\n; being elected an Honorary Fellow of the Econometric Society in\n1951\nand serving on its Council from\n1962\nto\n1964\n; being elected an Honorary Fellow of the\nRoyal Statistical Society\n; being elected an Honorary Fellow of the\nAmerican Statistical Association\n; and serving as Chairman of the Council of the International Association for Research in Income and Wealth from\n1961\nto\n1967\n(\nhe was a Member from\n1951\nto\n1969)\n. In\n1981\n, he was awarded the\nBoyle\nMedal of the Royal Dublin Society. He was also awarded an honorary DEconSc from the National University of Ireland in\n1962\n, an honorary DSc\n(\nEcon\n)\nfrom Queen's University Belfast in\n1968\n, and an honorary ScD from Trinity College Dublin in\n1973\n.\nMaurice Kendall\ngave the Sixth Geary Lecture in\n1973\nand spoke about the man the series honoured:-\nMy distinguished predecessor in contributing to this series of lectures,\nJan Tinbergen\n, included in the title of his lecture the word 'interdisciplinary'. I follow him in spirit, for the problem of forecasting is truly interdisciplinary, calling as it does on the combined skills of the economist, the statistician and the mathematician as well as the commonsense of the practitioner. And I cannot think of any more suitable name in whose honour a lecture of this kind should be given than that of Roy Geary, himself an interdisciplinarian if ever there was one, equally at home in all these subjects, and among his many distinctions possessing one which I think is unique, that of being the only former head of a Government Central Statistical Office whose name is attached to a mathematical theorem, has acted at the Abbey Theatre and has been offered a job as a professional footballer.\nTo see a little of Geary's character we quote from\n[\n9\n]\n:-\nRoy Geary was a man of great courtesy and charm inspiring devotion from his friends and colleagues. He was totally unselfish in sharing his ideas and encouraging others to develop them. He was wonderful company and had an impish humour which he often directed at himself, and even at his sacred statistics. A story he never tired of citing was the devastating reply, allegedly given by his beloved wife Mida, when he dismissed her complaints about rising prices by referring to a fall in the official Cost of Living Index for which he was responsible. \"My dear man\", she said\n(\naccording to Roy\n)\n, \"I'm talking about facts, not statistics\".\nGeary's wife Mida died on\n19\nFebruary\n1978\naged\n75\nyears. She was buried in Glasnevin Cemetery in the same grave as Geary's parents. Five years later, after a brief illness, Geary died and was buried in the grave with his wife and parents."
}