{
  "nome_completo": "Roger Collingwood",
  "nome_curto": "Roger Collingwood",
  "ano_nascimento": "1480",
  "ano_morte": "1520",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Collingwood_Roger/",
  "lugar_nascimento": "Diocese of Durham, England",
  "lugar_morte": null,
  "biografia": "Although his precise date and location of birth are unknown,\nRoger Collingwood\n, from the Diocese of Durham, is known to have been educated at Queen's College, Cambridge shortly after its foundation. Graduating in\n1496\n, as Bachelor of Arts, he was at Queen's at an important time for Cambridge, as it fell under humanist influence, which led to significant reforms and rationalization in the curriculum. In the BA course, which followed the traditional liberal arts, the emphasis on ancient writers, particularly\nAristotle\n, was reduced, and the syllabus broadened, with an increasing prominence for mathematics from\n1500\nonwards.\nPart of this growth of mathematics at Cambridge was the institution of new lecturing arrangements, which, to save the University's central funds, would be covered by fees paid by students. At a salary of £\n4\np.a.\n(26\n/\n8\nd per term\n)\n, a lecturer was employed to teach mathematics. Collingwood was the first to hold this post, making him the earliest known professional lecturer specifically of mathematics. First listed in the Grace Books of University of Cambridge at the start of the sixteenth century, he taught during the periods\n1501\n-\n1502\n,\n1503\n-\n1507\n, and\n1514\n-\n1517\n.\nIn the intervening years, he travelled on the Continent, for some of the time funded by Lady Margaret Beaufort. Mathematically, he was exposed to the work of Lefèvre d'Etaples in Paris.\nHowever, he also used the time abroad for other pursuits. During the first break from his lecturing, he studied canon law in Paris. With the benefit of that education, he was ordained. Between\n1503\nand\n1504\n, he was Dean in the Chapel of Queen's College. Later, in\n1509\n, he was installed as rector of Albury. Back in Cambridge, he became Senior Proctor of Queen's College in\n1513\n, bearing responsibility for aspects of University administration and for student discipline.\nAt Queen's, Collingwood was a contemporary, and served during the Presidency, of Bishop John Fisher, the Roman Catholic Cardinal and Bishop executed under King Henry VIII.\nUnder the pseudonym 'Carbo-in-ligno', he composed the mathematical text\nArithmetica experimentalis\n, of which an original copy is now held in the library of Corpus Christi College. Bishop Richard Foxe patronized Collingwood, who, in return, dedicated his book to the Bishop, to whom he likely owed his position.\nIn his work, Collingwood defends the importance of mathematics. His text suggests that practice was pre-eminent over pure mathematical theory in Cambridge at the time, with emphasis placed on the importance of applying knowledge."
}