{
  "nome_completo": "Roman Sikorski",
  "nome_curto": "Roman Sikorski",
  "ano_nascimento": "1920",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sikorski/",
  "lugar_nascimento": "Mszczonów, Poland",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Roman Sikorski\n's parents were Ignacy Sikorski\n(\nborn about\n1885\nin Osuchów\n)\n, who was a potter, and Józefa Wasilewska\n(\nborn about\n1891\nin Mszczonów\n)\n. Ignacy and Józefa were married in Mszczonów, a small town in central Poland, in\n1910\n. After elementary schooling in Mszczonów, Roman attended the Adam Skwarczynski Gymnasium in the nearby town of Zyrardów. While studying at this Gymnasium, he was one of the editors of the school magazine \"Young blades\". Physics and mathematics were his favourite subjects at the Gymnasium so it was a natural choice that he enrolled to study physics at the University of Warsaw.\nSikorski began his university studies in\n1937\nand, of course, his physics course involved taking various mathematics options. He soon found that he was more enthusiastic about mathematics than physics so he changed to make this his major topic. After two years of study at university, things changed very dramatically with the outbreak of World War II.\nOn\n1\nSeptember\n1939\nGerman troops entered Poland and the German Luftwaffe began bombing all strategically important sites. By\n4\nSeptember they were within\n60\nkm of Warsaw which they encircled with two pincer movements coming from the north and south, one to the east of Warsaw the other to the west. On\n22\nSeptember, Russian troops entered Poland occupying Lwów and on\n27\nSeptember Warsaw surrendered. The Germans and Russians had agreed to partition Poland between them and this now came about. Warsaw was occupied by the Germans who closed the University of Warsaw. The university buildings became a military barracks. In fact the Germans closed all higher education establishments in Poland for their idea was that they would make use of Poles to carry out their menial tasks so there was no need to educate them.\nWith the university closed, Sikorski left Warsaw and returned to his home in Mszczonów. Although education was now banned in Poland, and punishable by death, many risked their lives to educate young people in secret. With help from others and working on his own, Sikorski continued to study at what he would later jokingly call the \"University of Mszczonów.\" On\n17\nJanuary\n1945\nWarsaw was liberated by Russian troops but at this stage, with the city and university largely destroyed, it was unclear whether the city and its university would be rebuilt. However staff and students who had survived the war began returning to the university and Sikorski was among them. During\n1945\nhe married Krystyna Bobinskich\n(\nborn\n1917)\n; they had one son Krzysztof Lech Sikorski\n(\nborn\n1946)\n, who went on to study engineering and became a construction engineer. The University of Warsaw reopened in December\n1945\nwith\n4000\nstudents attending lectures in a campus which was basically little more than a ruin. Sikorski at this stage was both a student but also an assistant, helping to teach other students.\nIn\n1946\nSikorski obtained the only scholarship available in Poland to fund study abroad, and he went to Zürich where he spent eight months. Returning to Warsaw, he now worked with\nAndrzej Mostowski\nwho had taken up the position of acting professor in September\n1946\n. Sikorski was awarded his Master's degree in\n1947\nand, advised by\nMostowski\n, he undertook research for his doctorate. He submitted his doctoral thesis in\n1949\n, defended his thesis\nOn extension of homomorphisms\non\n4\nJuly of that year, and was awarded a doctorate in natural and mathematical sciences. A paper from his thesis was published in the\n1948\nvolume of the\nAnnales de la Société Polonaise de Mathematique\n(\nwhich did not appear in print until\n1949)\n. He had already been appointed as an assistant professor in\n1948\n, which gave him the right to teach and direct students' scientific work.\nFrom\n1947\nSikorski began publishing papers in English and French. The following eight papers appeared in\n1947\nand\n1948\n:\nOn the Cartesian product of metric spaces\n(1947)\n;\nSur les corps de Boole topologiques\nⓉ\n(\nOn topological Boolean fields\n)\n(1948)\n;\nSur la convergence des suites d'homomorphies\nⓉ\n(\nOn the convergence of sequences of homomorphisms\n)\n(1948)\n;\n(\nwith\nEdward Marczewski\n)\nMeasures in non-separable metric spaces\n(1948)\n;\nOn a generalization of theorems of Banach and Cantor-Bernstein\n(1948)\n;\nOn the representation of Boolean algebras as fields of sets\n(1948)\n;\nRemarks on a problem of Banach\n(1948)\n;\nA theorem on extension of homomorphisms\n(1948)\n; and\nOn an ordered algebraic field\n(1948)\n.\nIn\n1949\nSikorski became a research worker in the Institute of Mathematical Sciences in Warsaw, which was the first part of the\nPolish Academy of Sciences\nto be established. The Institute of Mathematical Sciences began operating in November\n1948\nso was a very new institution when Sikorski began working there. Its director was\nKazimierz Kuratowski\n. The\nPolish Academy of Sciences\nwas founded in\n1952\nand incorporated the Institute of Mathematical Sciences. In addition to his position in the Institute, on\n11\nOctober\n1950\nhe was appointed as an assistant professor in the Warsaw University of Technology becoming, at\n30\nyears of age, the youngest professor in Poland. He was promoted in\n1951\nand headed the Department of Mathematics in the Faculty of Chemistry at the Warsaw University of Technology where he taught analysis and applications of mathematics. Two years later, in\n1952\n, he was appointed extraordinary professor in the Department of Mathematical Analysis of the University of Warsaw. In\n1955\nhe submitted five papers to the Institute of Mathematical Sciences of the\nPolish Academy of Sciences\nfor the equivalent of a D.Sc. degree. His submission was examined by\nEdward Marczewski\n,\nStanisław Mazur\nand\nWładysław Orlicz\n. He became a full professor at the University of Warsaw in\n1957\nwhen he was appointed to the Chair of Real Functions. There he taught a range of different topics including the foundations of mathematics, algebra, calculus, differential geometry and topology. In\n1962\nSikorski was elected to the\nPolish Academy of Sciences\nas a corresponding member and then in\n1969\nas a full member. He served as a member of its Committee of Mathematical Sciences, being the Committee chairman from\n1969\nto\n1971\n. From\n1956\nto\n1977\nhe was director of Academy's Institute of Mathematical Sciences.\nIn addition to his impressive research record, Sikorski played an extremely important role in Polish mathematics through his tremendous support for the\nPolish Mathematical Society\n. This Society had been founded after World War I but, being unable to operate during World War II, it had to be reestablished in\n1945\n.\nKazimierz Kuratowski\nwas president of the Society from\n1945\nto\n1953\n. Sikorski was an active member in the second half of the\n1940\ns and became Secretary of the Society in\n1951\n. He held this position until\n1955\n, then in\n1957\nhe became Vice-President. He continued in the role of Vice-President until\n1965\nwhen he was elected President of the Society, a role he held until\n1977\n. In this year he was forced to give up all his mathematical activities due to ill health but the\nPolish Mathematical Society\nrecognised his enormous contribution by awarding his honorary membership of the\nPolish Mathematical Society\nat this time. At the Ninth Congress of Polish Mathematicians held in Kraków in\n1969\n, Sikorski gave the\nAddress presented September\n3\n,\n1969\nat the inauguration of the Jubilee of the Polish Mathematical Society\n(\nPolish\n)\nwhich was published in\n1971\n. This address contained an account of the rebirth and development of the\nPolish Mathematical Society\nsince\n1945\n.\nThe\nPolish Mathematical Society\nwas only one of several different ways that Sikorski made a major contribution to the development of mathematics in Poland. Another was the editorial work he undertook serving on the editorial boards of a number of journals such as \"Fundamenta Mathematicae\", \"Studia Mathematica\", \"Colloquium Mathematicum\" and \"Mathematical Monographs\".\nThere are many mathematical concepts which are named for Sikorski. Let us mention a few: Sikorski spaces, the\nRasiowa\n-Sikorski lemma\n(\nHelena Rasiowa\nworked with Sikorski and this lemma is contained in their joint work as are the other concepts named for these two mathematicians\n)\n,\nHopf\n-Sikorski algebras, the Loomis-Sikorski theorem\n(\nthe theorem was discovered by both the American mathematician Lynn Harold Loomis\n(1915\n-\n1994)\nand Sikorski at the same time but independently\n)\n, the Loomis-Sikorski representation, Sikorski CW-complexes, the\nRasiowa\n-Sikorski deduction system, Sikorski differential spaces, and Sikorski's trace formula. We have found over\n60\npapers\n(\nas of November\n2016)\nwhich have titles containing one of these concepts. There are\n(\nas of November\n2016)\n519\npapers in MathSciNet with \"Sikorski\" in the review text. Many relate to his work on Boolean algebras or his work on first order logic. However, there are also many that refer to his work on differential spaces or on\nBanach\nspaces.\nA number of books by Sikorski have made important contributions to the teaching of mathematics in Poland and others have been research monographs which have been translated into several languages\n(\nincluding English\n)\nand have played an important role. His most important monograph is\nBoolean Algebras\nwhich was first published in\n1960\nwith a second edition four years later. R S Pierce, reviewing the first edition writes:-\nThere has long been a need for a book on the mathematical theory of Boolean algebras at the graduate or research level. The author's book fills this need in spectacular fashion.\nThe same reviewer had even stronger praise for the second edition:-\nThe new edition of the author's distinguished book brings the story of Boolean algebras pretty much up to date. In doing this, it retains all of the virtues of the original work. This monograph is amazingly complete. Everything that the research worker needs to know about Boolean algebras can be found between its covers. Still more remarkable is the fact that the book could serve very well to introduce a serious student to a wide range of topics in set theory, topology, measure theory, logic, and, of course, the theory of Boolean algebras.\nOther reviews of Sikorski's\nBoolean Algebras\nare given at\nTHIS LINK\n.\nAmong Sikorski's other books we mention\nReal functions\n(2\nvolumes\n)\n(\nPolish\n)\n(1958\n,\n1959)\n;\nDifferential and integral calculus: Functions of several variables\n(\nPolish\n)\n(1967)\nwhich was translated in English as\nAdvanced Calculus. Functions of Several Variables\n(1969)\n; and\nIntroduction to differential geometry\n(\nPolish\n)\n(1972)\n. Note that these books ran to several editions, for example the fourth edition of\nDifferential and integral calculus\n(\nPolish\n)\nappeared in\n1977\nand the fifth edition in\n1980\n. For extracts from reviews of these books see\nTHIS LINK\n.\nThere is one other book which Sikorski wrote jointly with\nHelena Rasiowa\nwhich deserves a special mention. This book,\nThe Mathematics of Metamathematics\n(1963)\n, is a very interesting and somewhat unusual work. Melvin Fitting gives the following assessment of this book:-\nIt was a strange book. On the one hand, it was painfully exhaustive and thorough in the presentation of material. Page after page enumerated detailed results almost in the form of a catalogue, dry and utilitarian. On the other hand, the ideas were of a sort I had never come across before, and I was enchanted. This way of using algebra, producing known results in classical logic, then applying similar techniques to non-classical logics to get new results it all seemed like magic. Profound results fell out so effortlessly, it seemed. How could one read this book and remain unaffected?\nFor extracts from two other reviews of this book see\nTHIS LINK\n.\nSikorski made many trips to give lectures abroad. Countries he lectured in include Switzerland\n(1956)\n, USSR\n(1956)\n, USA\n(1958\n,\n1961\n,\n1966\n,\n1970)\n, Argentina\n(1958)\nand Canada\n(1967)\n. On the first of these trips to the USA, Sikorski was a member of the Institute for Advanced Study at Princeton from September\n1958\nto December\n1958\n.\nBogdan Mis writes\n(\nsee\n[\n15\n]\n)\n:-\nOne of the wittiest and most charming people I have known in my life - in addition to being a world-class mathematician - Professor Roman Sikorski, was known by several generations of mathematicians under the deservedly frivolous nickname \"Ersik\" ...\nSikorski received many awards for his outstanding contributions. He received the\nStefan Mazurkiewicz\nAward of the\nPolish Mathematical Society\nin\n1950\nand various State prizes such as Officer of the Cross of Merit\n(1968)\nand Commander of the Cross of Merit\n(1974)\n. He also received the Order of Poland Reborn.\nAfter an extremely active life, Sikorski had several years of suffering before his death in September\n1983\n. He was buried in the Powazki cemetery in the Wola district of west Warsaw. We note that several eminent mathematicians are also buried in this cemetery including\nStefan Mazurkiewicz\nand\nWacław Sierpiński\n."
}