{
  "nome_completo": "Andrew Ronald Mitchell",
  "nome_curto": "Ronald Mitchell",
  "ano_nascimento": "1921",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mitchell/",
  "lugar_nascimento": "Dundee, Scotland",
  "lugar_morte": "Dundee, Scotland",
  "biografia": "Ronald Mitchell\nwas known as Ron to his friends and colleagues. His parents were married in Forfar, and they moved to Dundee where Ron was born. His father was a blacksmith. Ron went to school at Morgan Academy, and was in the Boys Brigade at Clepington Parish Church. He played football at school, and his ability was recognised when he was invited to sign for North End Junior Football Club in Dundee.\nRon left Morgan Academy in\n1938\n, and won scholarships through the school to do a mathematics degree in the old University College, Dundee\n(\na college of St Andrews University\n)\n. During his time as a student he did vacation work for the Forestry Commission, starting by trimming limbs from trees and eventually becoming a tree feller. He won medals for Special Mathematics\n(1939\n-\n40)\n, Special Physics\n(1940\n-\n41)\n, and Senior Honours Mathematics\n(1941\n-\n42)\n. He graduated with First Class Honours in\n1942\n, and was called up and sent to the wartime Ministry of Aircraft Production in London, where he remained until after the end of the war. His duties included the interrogation of captured Luftwaffe pilots, in an attempt to get information about their aircraft; some years later he met one of them at a conference. While he was in London, he continued to play football, turning out a few times for Chelsea.\nIn October\n1946\n, Ron decided he would like to do a PhD, and returned to Dundee to see if this might be possible. There was no available supervisor in University College, but he made contact with\nD E Rutherford\n, who was then a Lecturer in Mathematics and Applied Mathematics in St Andrews University. Lecturing staff were in short supply at that time, and\nRutherford\nagreed to act as supervisor in return for Ron taking an Assistant Lectureship for the duration of his PhD.\nAlthough\nRutherford\nwas responsible for the Applied Mathematics part of the Mathematics Department in St Andrews, his main research interest was in Lattice Theory, so the supervision must have been fairly nominal, particularly as Ron's thesis was concerned with relaxation methods in compressible flow. After being awarded his PhD in\n1950\n, Ron stayed on at St Andrews as a Lecturer. There was some co-operation with\nRutherford\nas two joint papers were published. In particular, they discovered an early form of Successive Over-Relaxation, before the famous paper of David Young, although the work was never published.\nDuring much of this time, Ron continued to play football, and signed as a part-time professional with a number of Scottish clubs. During the period\n1946\n-\n1955\n, he played with St Johnstone, East Fife, Brechin City and Berwick Rangers in that order. While with Berwick Rangers, he won a Scottish Qualifying Cup South Runners Up Medal in\n1949\n-\n50\n, and Scottish Qualifying Cup South Winners Medal in\n1950\n-\n51\n.\nRon's first PhD student was J D Murray, who started in\n1953\non a topic in boundary layer fluid dynamics. In these days the Air Ministry published a list of their top ten problems in fluids. Number\n6\nat that time was flow into a pitot tube: was the speed of flow which was registered the correct speed of the aircraft? This was Murray's PhD problem. As is well known, he went on to an illustrious career, which included an FRS and the Chair of Mathematical Biology at Oxford.\nRon had developed an interest in Numerical Analysis, initially as a means of tackling fluid dynamics problems using Southwell's relaxation methods. In\n1953\n/\n54\n, he taught an Honours special topic in Numerical Analysis, the first time Numerical Analysis had been taught in St Andrews. Ron's second PhD student was J Y Thompson who started in\n1954\nworking on numerical aspects of fluid dynamics. Following the award of his PhD, he went on to a Lectureship in Applied Mathematics in Liverpool where he married a widowed medical doctor with a large number of children, and retrained into the medical profession.\nIn\n1959\n, Ron married Ann, and took up a one-year post of Senior Research Fellow in the Mathematics Department at California Institute of Technology. Jack Lambert was appointed as a Lecturer at St Andrews in the same year and he became Ron's third PhD student, working for the degree part-time. He worked on an idea of Ron's of incorporating higher derivatives into methods for Ordinary Differential Equations, apparently one of the few times Ron strayed away from PDE's to ODE's. In\n1963\n, Ron and Jack jointly took on the PhD supervision of Graeme Fairweather and Brian Shaw, but this arrangement resolved itself into\n2\npairings with Ron and Graeme working on parabolic PDE's and the other two on ODE's.\nA joint Mitchell/Fairweather paper, published in\n1964\n, was the first in a series on high order alternating direction finite difference methods for elliptic PDE's. It caused surprise in some quarters, where it had been believed that such higher order methods did not exist. The method was not completely reliable, although it did well on problems with homogeneous\nDirichlet\nboundary conditions on at least two sides of the square. Contrary to Ron's belief that there was an error in the program, it turned out that there was a problem with the handling of the boundary conditions in high-order methods. An elegant way round the problem was obtained by Ron and Graeme Fairweather in\n1966\n, and was published the following year. This paper also described how to deal with problems in L-shaped regions. Earlier joint work by the same authors involved the use of a difference scheme based on the Schwarz alternating procedure, published in\n1966\n: this paper may have been the first to give numerical results obtained using a domain decomposition method.\nThroughout his time at the University of St Andrews, Ron continued to live in Dundee. On a typical day, he would catch the\n8\n.\n02\ntrain from Dundee to St Andrews which got him into his office around\n8\n.\n40\n. At\n9\nhe met his students, and he then had a lecture at\n10\n. At\n11\nhe would have coffee in the Staff Club in the Younger Hall, and after possibly seeing his students again he would gather his things together to catch the train back to Dundee at\n12\n.\n40\n. An overlong discussion could result in a rush for the train, and a jogging party to the station which would leave the students hanging on to the railings to recover. Ron kept himself extremely fit, and at that time was one of the best squash players in the University. Only a very special event, such as an important visitor, would keep Ron in St Andrews for an afternoon.\nRon was a good lecturer. Edmund Robertson, now a Professor at St Andrews, recalls:-\nRon taught me when I was an undergraduate. He was the only lecturer who I ever went to and complained that his course and exam were too easy. Now that I understand such things better, I realise that it was just due to the fact that he was such a good teacher!\nBy\n1965\n, there was a thriving numerical analysis group in St Andrews. There was also a group in Edinburgh, headed by Mike Osborne, who came to Edinburgh in\n1964\nas Assistant Director of the University Computer Unit. He was mainly interested at that time in finite difference methods for both ordinary and partial differential equations. He was joined in March\n1964\nby Donald Kershaw, whose main interests were differential and\nintegral equations\n, and some students, including Alistair Watson.\nAfter a seminar in St Andrews given by\nJohn Todd\n, and attended by some of the Edinburgh group, Ron and Mike exchanged ideas about the need for more interaction, and Mike Osborne suggested a conference. St Andrews was chosen because Ron was friendly with the warden of a particular hall of residence and was able to arrange cheap accommodation before the hall closed for the summer vacation, and Ron and Jack Lambert were the main organisers.\nApparently, around\n25\npeople attended a programme extending over two days. The intention was that participants would only be from Scotland, but in the event it appears that quite a few attended from south of the border. Emboldened by the success of this meeting, a second one was held in St Andrews from\n26\n-\n30\nJune\n1967\n, attracting\n85\nparticipants.\nAround\n1965\n-\n66\n, Ron went to evening classes in Dundee to learn Russian. Having long since lost his School Leaving Certificate, he experienced some difficulty in persuading the organisers that he had an appropriate level of general education to allow him entry to the course; apparently a PhD was not an acceptable alternative. During Graeme Fairweather's thesis work, it had been realised that some Russians, in particular\nSamarskii\n, Andreyev and D'Yakonov were also working on high order difference methods for PDEs. Indeed a method, essentially that of the\n1964\nNumerische Mathematik\npaper, had been published in Russian at about the same time, and D'Yakonov had also discovered the loss of accuracy referred to earlier. A knowledge of Russian not only allowed Ron to keep up with the Russian literature as soon as it appeared, but was invaluable when he attended the ICM Meeting in Moscow in\n1966\n. There he met D'Yakonov and, as a result, the latter visited Ron in the late sixties. In Moscow, Ron was able to indulge his love of soccer: he played for The Rest of the World against the USSR in a soccer match which was organised in the stadium of Moscow Dynamo. The home team, who had been in training for several weeks, won\n5\n-\n2\n.\nThe work of Mitchell/Fairweather lay somewhere between the classical ADI approach of Douglas, Peaceman, Rachford and Gunn, and that of D'Yakonov. The former would not handle the loss of accuracy at the boundary, while the latter would, but was cumbersome. A by-product was that people in the West became much more aware of the activity in the USSR concerning split operator techniques.\nIn\n1965\nD S Jones was appointed to the Ivory Chair of Mathematics in Queens College\n(\nformerly University College\n)\n, Dundee. With a level of priority which was atypical of a classical Applied Mathematician in those days, he decided to build up Numerical Analysis, which he was far-sighted enough to see as a growth area. In\n1967\n, the year in which Queens College Dundee formally severed its links with St Andrews and became the University of Dundee, he obtained funds to establish a Chair of Numerical Analysis, and Ron\n(\nby that time a Reader in St Andrews\n)\nwas appointed.\nRon continued to attract research students, and with funding from NCR and the Ministry of Defence largely obtained through the efforts of\nDouglas Jones\n, other numerical analysts were appointed to post-doctoral positions. Another conference was held in Dundee in\n1969\n, and while in fact the first of what was to become a long series of biennial meetings associated with Dundee, the two earlier St Andrews meetings have quite properly been included and so have pushed it into third place.\nThe academic year\n1970\n-\n71\nwas a special one for numerical analysis in Dundee. Ron obtained funding from the UK Science Research Council to promote the theory of numerical methods and to upgrade the study of numerical analysis in British universities and technical colleges. This was done by arranging lecture courses, seminars and conferences in Dundee. Some\n34\nof the world's leading numerical analysts visited Dundee during this period, some for short periods and others for longer periods up to the full year.\nRon's interests had changed in the late\n1960\n's to finite elements, a move allegedly instigated by Dick Wait who turned up at Ron's doorstep and announced that he would like to do a PhD in the area. This was virgin territory for numerical analysts and Ron did much pioneering work during the next five years with George Phillips, Gene Wachspress, Bob Barnhill and his students Dick Wait, Robin McLeod and Jim Marshall, work which focussed mainly on the treatment of boundaries - the approximation of curved boundaries and the exact matching of boundary data using blending interpolants.\nThe next change of direction occurred as a consequence of a lecture given by Olec Zienkiewicz at the second MAFELAP conference organized by John Whiteman at Brunel University in\n1975\n. In this talk Olec Zienkiewicz described instabilities they had experienced in converting their successful finite element codes for structural problems into codes for solving the\nNavier\n-\nStokes\nand related equations in fluid dynamics. Finite difference practitioners had known for many years that the instability could be overcome by the use of \"upwind differencing\"  and Ron was immediately intrigued to know how this type of stabilization could be applied to the finite element situation.\nOn his return to Dundee, he and David Griffiths attacked this problem with some gusto over the next few weeks, and the end result was upwind-biased test functions and what is now known as the Petrov-Galerkin finite element method\n(\nthis term was apparently coined in a joint paper Ron wrote with Bob Anderssen\n)\n.\nThere followed several fruitful years working on convection-diffusion problems until, through his interest in diffusion and dispersion effects and his collaboration with\nBrian Sleeman\n, he became interested in nonlinear effects in the early\n1980\n's. Some of the problems arose from Mathematical Biology, on which \"Mano\" Manoranjan did much of his PhD work, but Ron was also interested in solitons, particularly those arising from the\nKorteweg\n-\nde Vries\nand\nSchrödinger\nequations. He was instrumental in bringing the subject of spurious solutions to the fore.\nAlthough he had not been a main organiser of the Conferences since they moved to Dundee in\n1969\n, nevertheless they continued very much under Ron's guiding influence, and many participants were attracted to the meetings by Ron's presence, his humour, and the power of his personality. During the\n1989\nConference, Ron took ill, and was rushed to hospital with a suspected heart attack. Fortunately, he was soon up and about again. The\n1991\nConference celebrated Ron's\n70\nth\nbirthday. It was also decided to initiate a special lecture\n(\nthe A R Mitchell Lecture\n)\nto be given at this and at future conferences by an eminent numerical analyst.\nDuring his research career, Ron has always had the uncanny knack of alighting on fundamental issues which, through his many papers and conference talks, have drawn others to the subject. He has a long and illustrious list of publications, but equally if not more impressive is the list of his PhD students. A few have been mentioned, but many more have gone on to make names for themselves in research. One of Ron's great strengths has been the way he has been able to motivate and encourage his students; he has a truly outstanding talent for getting the best out of research students and for instilling self-confidence in them.\nAlthough plagued recently by ill-health, Ron has never lost his sense of humour, or lost his ability to produce outrageous puns. He is a major figure in UK Numerical Analysis, and he has had a significant impact on the subject."
}