{
  "nome_completo": "Karl Rudolf Fueter",
  "nome_curto": "Rudolf Fueter",
  "ano_nascimento": "1880",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fueter/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Brunnen, Switzerland",
  "biografia": "Rudolf Fueter\n's father was Eduard Rudolf Fueter, who was an architect, and his mother was Adèle Gelzer. Rudolf studied in his home town of Basel before going to Göttingen in\n1899\nto study under\nHilbert\n. He worked on\nquadratic number fields\nand his doctorate, supervised by\nHilbert\n, was awarded in\n1903\nfor a thesis entitled\nDer Klassenkörper der quadratischen Körper und die komplexe Multiplikation\nⓉ\n(\nThe class field of the square body and the complex multiplication\n)\n.\nAfter obtaining his doctorate Fueter travelled to various European centres of mathematical activity. He spent some time in Paris, then in Vienna and finally went to London while pursuing his studies. He was then appointed as a lecturer at the University of Marburg in\n1907\n, and at the Mining Academy in Clausthal before being appointed as professor of mathematics at Basel in\n1908\n. On\n1\nMarch\n1908\nhe had married Amélie von Heusinger. They would have one daughter.\nFive years later, in\n1913\n, Fueter left Basel to take the chair of mathematics at the Technical University of Karlsruhe, a post he only held for three years before moving to the chair at the University of Zürich. In\n[\n2\n]\nBurckhardt discusses the impact that Fueter had on the University of Zürich and demonstrates how he began the process of making it a cultural centre, even during a very difficult period of history.\nFueter's first major publication was\nSynthetische Zahlentheorie\nⓉ\n(\nSynthetic Number Theory\n)\nwhich he published in\n1917\nsoon after taking up the chair at Zürich. The work was a very successful one, a third edition being published in\n1950\n, the year of Fueter's death. He did important work on the class formula for number fields summarising his work on the class formula for abelian number fields over an imaginary quadratic base field in the two volume work\nVorlesungen über die singulären Moduln und die komplexe Multiplikation der elliptischen Funktionen\nⓉ\n(\nLectures on the singular moduli and the complex multiplication of elliptic functions\n)\n. The first of the two volumes was published in\n1924\n, with the second following three years later.\nBetween the two volumes of\nVorlesungen über die singulären Moduln und die komplexe Multiplikation der elliptischen Funktionen\nⓉ\n(\nLectures on the singular moduli and the complex multiplication of elliptic functions\n)\nFueter published another major work,\nDas mathematische Werkzeug des Chemikers, biologen und Statistikers\nⓉ\n(\nThe mathematical tools of the chemist, biologist and statistician\n)\nwhich was first published in\n1926\nand also ran to three editions, the third in\n1947\n.\nFueter was a cofounder of the\nSwiss Mathematical Society\n, which came into existence in\n1910\n, becoming its first President. He also became Rector of the University of Zürich serving in this role during\n1920\n-\n22\n. As a member of the Swiss Natural Science Society he served as an editor on the major project to publish the complete works of\nEuler\n. In addition he undertook other editorial work such at the editorship of\nComentarii Mathematici Helvetici\n.\nPerhaps surprisingly Fueter also held the rank of colonel in the artillery of the Swiss army. The fact that Switzerland was neutral did not mean that the Swiss did nothing as Hitler came to power and the prospects of war became imminent. On the contrary they prepared themselves\npsychologically, economically, and militarily for involvement in a possible war.\nFrom the outbreak of World War II Fueter served in the Department of Press and Radio and was noted for his strong opposition to the Nazis. Despite being surrounded by Nazi and fascist controlled countries, Switzerland remained the only democratic state in central Europe and Fueter played an important role in that process. Kimche writes in\n[\n3\n]\n:-\nFueter restated the democratic rights of the press in almost classical form ... In his report of April\n10\n,\n1940\n... Fueter developed his argument more fully. \"If is the duty of our press to reject the domestic and foreign policies of the National Socialists both clearly and forcefully.\""
}