{
  "nome_completo": "Saharon Shelah",
  "nome_curto": "Saharon Shelah",
  "ano_nascimento": "1945",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shelah/",
  "lugar_nascimento": "Jerusalem, British Mandate for Palestine (now Israel)",
  "lugar_morte": null,
  "biografia": "Saharon Shelah\n's father was the Israeli poet Uriel Shelach who was born in Warsaw in\n1908\n. Uriel Shelach was given the name Uriel Heilperin when he was born. He emigrated to Palestine in\n1921\nand studied at the Hebrew University of Jerusalem in the late\n1920\ns. He was a writer who joined the Revisionist Zionist movement, later writing poetry under the pseudonym of Yonatan Ratosh. His son Saharon, however, knew from a young age that he wanted to follow a scientific rather than a literary career\n[\n5\n]\n:-\nWhile I was still in primary school, I knew I wanted to become a scientist, but as Mathematics was taught, it did not attract me especially. I was very interested, on the other hand, in Physics and Biology and I read popular scientific books. But when I reached the ninth grade I began studying geometry and my eyes opened to that beauty - a system of demonstrations and theorems based on a very small number of axioms which impressed me and captivated me. On the other hand laboratories were not to my taste and vice versa. So, by the age of\n15\n, I knew my desire was to be a mathematician.\nShelah attended Tel Aviv University and was awarded his B.Sc. in\n1964\n. He continued to study at Tel Aviv while serving in the Israel Defence Forces Army between\n1964\nand\n1967\n. He received an M.Sc. from Tel Aviv in\n1967\nthen went to the Institute of Mathematics of the Hebrew University of Jerusalem where he was appointed as a Teaching Assistant and undertook research supervised by Michael Oser Rabin. Shelah was awarded a Ph.D. in\n1969\nfor his work on stable theories. He extended ideas in model theory introduced by Michael Morley in his Ph.D. thesis\nCategoricity in power\nin\n1962\n. Shelah\n[\n1\n]\n:-\n... generalises many of the results of Morley's 'Categoricity in power' to first-order theories in an uncountable language. The key step in the transition from countable to uncountable languages is the isolation of those properties of a theory which depend upon a single formula ...\nAfter completing his doctorate, Shelah spent the year\n1969\n-\n70\nas a Lecturer at Princeton University and the following year\n1970\n-\n71\nas an Assistant Professor at the University of California, Los Angeles. He then returned to the Hebrew University of Jerusalem where he became a professor in\n1974\nbefore being appointed to the A Robinson Chair for Mathematical Logic in\n1978\n, a position he continues to hold. He was a Visiting Professor at the University of Wisconsin\n1977\n-\n78\n, at the University of Californa, Berkeley in\n1978\nand again in\n1982\n, in the Department of Electrical Engineering and Computer Science of the University of Michigan\n1984\n-\n85\n, at Simon Fraser University, Burnaby, British Columbia\n1985\n, and at Rutgers University, New Jersey in\n1985\n. Since\n1986\nhe has also been a Distinguished Visiting Professor at Rutgers University.\nWe look at Shelah's mathematical contributions by first recording the awards that he has received and we quote from the citations of these. In\n1977\n, Shelah was awarded the Anna and Lajos Erdős Prize in Mathematics. It is a prize, honouring\nPaul Erdős\n's parents, given by the Israel Mathematical Union to Israeli mathematicians, preference being given to candidates up to the age of\n40\n. Shelah was only\n32\nyears old when he received the prize.\nAlthough not strictly speaking an award, let us note at this point the he was invited to give a plenary address at the International Congress of Mathematicians held in Berkeley, California, in August\n1986\n. His lecture\nClassifying general classes\nwas published in the conference proceedings in\n1987\nand a video of his talk was also released. He was also a plenary speaker at the British Mathematical Colloquium at Exeter in\n1988\nwhen he lectured on\nVan der Waerden numbers\n.\nThe\nBolyai\nPrize Committee decided to award the\n2000\nBolyai\nprize to Shelah for his monograph\nCardinal arithmetic\n(1994)\n. The citation first gives an overview of Shelah's contributions\n[\n4\n]\n:-\nThe award winner Saharon Shelah is a phenomenal mathematician, pre-eminent both in model theory and set theory. His work, beginning in the early\n1970\n's, has tremendously advanced both subjects, and even now, in his mid fifties, he is continuing to produce results at a furious pace. He has over\n700\nitems in his bibliography, the majority of them long or substantial papers. The one other modern mathematician who sustained a comparable level of productivity on paper was\nPaul Erdős\n, and in an interview that appeared in\n1985\nhe singled out Shelah among all mathematicians for praise.\nThe citation continues by examining in more detail the work for which the award was made:-\nThe book \"Cardinal Arithmetic\" that is being awarded discusses only a specific, but very significant part of Shelah's work, the theory of pcf\n(\n\"possible cofinalities\"\n)\nand its applications. This theory, created by Shelah, became a major branch of set-theoretic research since the late\n1980\n's, illuminating many issues involving singular cardinals in combinatorial set theory and the theory of large cardinals. One of the features of the theory, emphasized by Shelah himself as well, is that it has led to a plethora of direct theorems of set theory, as opposed to relative consistency results. The advent of forcing and large cardinals in the\n1960\n's led to a continuing investigation through the next two decades of strong propositions independent of set theory and their consistency strength. What pcf theory did was to broaden set-theoretic research by infusing a complex of new direct theorems of set theory. A striking instance of Shelah's results on cardinal arithmetic is that:\nIf the continuum is smaller than the first singular cardinal\n(\nℵ\nω\n\\aleph _{\\omega}\nℵ\nω\n​\n)\n, then the number of countable subsets of a set of this cardinality can be estimated without extra set-theoretical hypotheses\n(\nℵ\nω\n4\n\\aleph _{\\omega}4\nℵ\nω\n​\n4\n)\n.\nThe proof of such a result was considered inconceivable to any expert before Shelah. The title of the book would suggest a detailed account of such results only, but the book also features a myriad of applications of pcf theory. One is tempted to use\nBolyai\n's words: He has created a new world out of nothing.\nIn\n1998\nhe received the Israel Prize, the most prestigious award made by the State of Israel and presented on the eve of Independence Day. The\n2001\nWolf Prize in Mathematics was awarded to Shelah\n[\n2\n]\n:-\n... for his many fundamental contributions to mathematical logic and set theory and their applications within other parts of mathematics.\nThe article\n[\n2\n]\ngives this appreciation of his contributions which led to the award of the prize:-\nSaharon Shelah has for many years been the leading mathematician in the foundations of mathematics and mathematical logic. His staggering output of\n700\npapers and half a dozen monographs includes the creation of several entirely new theories that changed the course of model theory and modern set theory and also provided the tools to settle old problems from many other branches of mathematics, including\ngroup theory\n,\ntopology\n,\nmeasure theory\n,\nBanach spaces\n, and combinatorics. Shelah created a number of subfields of set theory, most notably the theory of proper forcing and the theory of possible cofinalities, which is a remarkable refinement of the notion of cardinality and which led to proofs of definite statements in areas previously considered far beyond the limits of undecidability. His work on set theoretic algebra and its applications showed that many parts of algebra involve phenomena that are not controlled by universally recognized axioms of set theory. In model theory he carried through a monumental program of deep structural analysis known as \"stability theory\", which now dominates a large part of the field.\nIn the course of examining the awards made to Shelah we have given details of his famous book\nCardinal Arithmetic\n(1994)\n. However, he has written many other outstanding texts and we now look briefly at these. In\n1978\nhe published\nClassification theory and the number of nonisomorphic models\n. Daniel Lascar writes:-\n...\n[\na\n]\nfeature of the book is its amazing richness: a wide range of methods is employed\n(\ncombinatorial, algebraic, set-theoretic\n)\nand a profusion of ideas is displayed, leading to very deep structure theorems, and eventually to surprisingly precise results.\nA second edition, which has been expanded by more than\n150\npages and contains four new chapters, appeared in\n1990\n. An important feature of this second edition is put in context in\n[\n7\n]\n:-\nHistorically the development of \"model theory for its own sake\" focused on a certain invariant\nI\nT\nI_{T}\nI\nT\n​\n. This\nI\nT\nI_{T}\nI\nT\n​\nis the function that associates to a cardinal k the number of models of T of cardinality k, up to isomorphism ... This may seem to be a rather strange invariant to consider, but it was quite natural, as set-theoretic language and concerns permeate logic. Moreover, there are many classical model-theoretic techniques for building models of theories and distinguishing them up to isomorphism. The problem of describing the possible invariants\nI\nT\nI_{T}\nI\nT\n​\nwas posed in the late\n1960\ns by Saharon Shelah and solved in the early\n1980\ns by him. The solution appears in the second edition of his book 'Classification Theory and the Number of Non-isomorphic Models'\n(1990)\n.\nIn\n1982\nShelah published his now classic text\nProper forcing\n. A second edition of this famous text was published in\n1998\n. A Kanamori writes about the second edition\n[\n3\n]\n:-\nSaharon Shelah's proper forcing has become a staple part of the methods of modern set theory, with its applications powerful and wide-ranging and the development of its theory a fount of continuing research. Shelah came to proper forcing in the late\n1970\n's, and in a timely tract\n(\nthe first edition of the present text\n)\ncommunicated the subject to an excited set theory community. The tract in fact went far beyond its title to bring together much of Shelah's work in set theory to that time, and the wealth of information and techniques therein greatly stimulated set-theoretic research in the ensuing years. Time passed, and with Shelah's inimitable English and expositional gaps having become legion and a steady stream of new results having been established, it became apparent that a mature, magisterial presentation of proper forcing in all of its aspects was needed. The book under review is the result, far larger in scope than even the original tract and most welcome as the authoritative exposition, the more so after several years of being held up because of word processing difficulties.\nHis next book,\nAround classification theory of models\n(1986)\n, is a collection of\n14\npapers on model theory, set theory and generalized logics. A common feature of most of these papers is that they deal with the number of objects of a certain kind\n(\nmodels, ideals, etc\n)\n. The prize-winning book\nCardinal Arithmetic\n(1994)\nhas already been mentioned above.\nA Kanamori has given a beautiful description of the style of Shelah's mathematics and, around\n1999\n, wrote the following\n[\n3\n]\n:-\nSaharon Shelah is a phenomenal mathematician, pre-eminent in both model theory and set theory. His work, beginning in the early\n1970\n's, has tremendously advanced both subjects, and even now, in his fifties, he is going from strength to strength, continuing to produce results at a furious pace. ... In set theory Shelah is initially stimulated by specific problems. He typically makes a direct, frontal attack, bringing to bear extraordinary powers of concentration, a remarkable ability for sustained effort, an enormous arsenal of accumulated techniques, and a fine, quick memory. When he is successful on the larger problems, it is often as if a resilient, broad-based edifice has been erected, the traditional serial constraints loosened in favour of a wide, fluid flow of ideas and the final result almost incidental to the larger structure. What has been achieved is more than just a succinctly stated theorem but rather the establishment of a whole network of robust constructions and arguments. A telling point is that when some local flaw is pointed out to Shelah, he is usually able to come up quickly with another idea for crossing that bridge. Shelah's written accounts have acquired a certain notoriety that in large part has to do with his insistence that his edifices be regarded as autonomous mental constructions. Their life is to be captured in the most general forms, and this entails the introduction of many parameters. Often, the network of arguments is articulated by complicated combinatorial principles and transient hypotheses, and the forward directions of the flow are rendered as elaborate transfinite inductions carrying along many side conditions. The ostensible goal of the construction, the succinctly stated result that is to encapsulate it in memory, is often lost in a swirl of conclusions. This can make for difficult and frustrating reading, with the usual problem of presenting a mathematical argument in linear form exacerbated by the emphasis on the primacy of the construction itself and its overarching generality. Further difficulties ensue from the nature of the enterprise. Shelah regards the written word as necessary and central for capturing and fixing a construction, and so for him getting everything down on paper is of crucial importance. The tensions among the robustness of the construction, the variability of its possible renditions, and the need to convey it all in print are inevitably complicated by the speed with which he is able to establish new results. The papers have to be written quickly, previous constructions are newly refreshed and modified, and so a labyrinthian network may result over a series of related papers. In mathematics one often aspires to the most elegant or definitive treatment; in contrast, Shelah's work features a continuing, dynamic self-dialogue, one that pushes to the limits of exposition. Many may consider Shelah's work to be \"technical\", but as T S Eliot has written \"We cannot say at what point 'technique' begins or where it ends\"\n[\n'The Sacred Wood'\n]\n. While there is a particular drive to solve specific problems, Shelah with his generalizing approach is able to draw out larger, recurring patterns that lead to new techniques that soon get elevated to methods. One primary instance is the whole complex of approaches and results he developed under the general rubric of proper forcing. Shelah started out in model theory, developing an abstract classification theory for models which is a continuing research program for him and model theorists to this day. In the mid-\n1970\n's, in his first major body of results in set theory, Shelah resolved a long-standing problem in abelian group theory,\nWhitehead\n's problem, by establishing both the consistency and the independence of the corresponding proposition. It is through these beginnings, motivated by the set-theoretic problems that arose, that Shelah started to develop a general theory of iterated forcing for the continuum.\nFinally let us note that, by the end of\n2024\n, MathSciNet listed the truly remarkable number of\n1190\npublications for Shelah."
}