{
  "nome_completo": "Samuil Osipovich Shatunovsky",
  "nome_curto": "Samuil Osipovich Shatunovsky",
  "ano_nascimento": "1859",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shatunovsky/",
  "lugar_nascimento": "Velyka Znamianka, Tavricheskaya gubernia, Ukraine",
  "lugar_morte": "Odessa, USSR (now Ukraine)",
  "biografia": "Samuil Osipovich Shatunovsky\nwas born into a large Jewish family in Velyka Znamianka, a town on the south bank of the Dnieper River about\n50\nkm south west of Zaporozhye. He was the ninth of his parents' children. He completed his secondary education at a school in Kherson, a city with a large Jewish community on the Dnieper River near where it empties into the Black Sea. He then left Ukraine and went to Rostov, in Russia, where he spent a year taking additional classes. Shatunovsky wanted a university education, but the rules did not permit him to follow that route so he went to St Petersburg where he enrolled at the Institute of Technology, and then at the Institute of Communications. He did not enjoy the engineering courses he took at the Institute of Technology and, although unable to enrol formally at the university since he had no school certificate, he began attending mathematics lectures at the University. At this time\nPafnuty Lvovich Chebyshev\nled an important school of mathematics at St Petersburg which included several other outstanding younger mathematicians such as\nAleksandr Nikolaevich Korkin\n,\nEgor Ivanovich Zolotarev\nand\nYulian Vasilievich Sokhotsky\n. Shatunovsky gave up the courses he was taking at the technical institutes and attended lectures from all of these men at the University, enthusiastically participating in\nChebyshev\n's school of mathematics. However, given that he would never be in a position to obtain a degree, Shatunovsky decided to try to obtain a university education in Switzerland and travelled to that country.\nAfter the remarkable research environment in Chebyshev's school of mathematics at St Petersburg, Shatunovsky found the mathematical environment in Switzerland to be rather disappointing. However, his attempt to gain a higher education in Switzerland soon came to an end due to his lack of funds. Returning to Ukraine, Shatunovsky earned a living by giving private mathematics lessons in various towns. He taught in Ekaterinoslav\n(\nnow known as Dnipropetrovsk\n)\nand in other towns where there was no university so he had no access to other mathematicians or to libraries containing mathematical texts. Despite these difficulties, he was able to produce some fine pieces of mathematics and he sent a manuscript of his mathematical work to Odessa University. The quality of the work was seen immediately by the mathematicians at Odessa and Shatunovsky was invited to go there to begin studying. Most importantly, he was offered financial support which allowed him undertake full-time study. The school of mathematics at Odessa was not quite the quality of the St Petersburg school, but nevertheless it was excellent with leading mathematicians such as the geometer\nBenjamin Fedorovich Kagan\n,\nIvan Vladislavovich Śleszyński\nwhose main work was on\ncontinued fractions\n, least squares and axiomatic proof theory based on mathematical logic, S P Yaroshenko, and the mathematical historian I Yu Timchenko.\nDespite producing outstanding work at Odessa, Shatunovsky still could not officially obtain a Master's degree\n(\nequivalent of a Ph.D.\n)\nsince, not having the necessary qualifications, he had not been able to obtain a matriculation certificate. The Ministry of Education at this time applied the rules very strictly, but Shatunovsky's mathematical talents were so outstanding that the Education Minister made a rare exception and allowed Shatunovsky to graduate. After obtaining a degree from Odessa he was appointed to the staff there as a\ndozent\nin\n1905\n. This did not provide much in the way of an income, so he taught in various secondary schools in Odessa to allow him to survive. In\n1917\nhe submitted his doctoral thesis\n(\nequivalent to the\nhabilitation\n)\nAlgebra as the Study of Congruence of Functional Values\nand was promoted to the rank of professor at Odessa University. He continued to work there for the rest of his life. Anellis writes\n[\n2\n]\n:-\nShatunovskii's doctoral thesis, which became the algebra textbook 'Algebra as the Study of Congruence of Functional Values'\n(1917)\n, introduced the question of the 'Law of Excluded Middle' as a foundational question outside the context of non-classical, especially paraconsistent and many-valued logics. His students also included Moishe Isai'evich Sheinfinkel'\n(\nbetter known in the West as Moses Schönfinkel;\n1889\n-\n1942)\n.\nLevin\n, in his article about\nMark Grigorievich Krein\n, gives the following description of Shatunovsky:-\nSamuil Osipovich Shatunovskii was a brilliant lecturer and a talented mathematician who often left time behind in his lectures and works. As early as at the end of the\n19\nth\ncentury, i.e., before the appearance of Gilbert's book \"Foundations of Geometry,\" Shatunovskii gave, in his course of lectures, \"Introduction to Analysis,\" an axiomatic definition of the notion \"magnitude\" and verified the independence of these axioms by using models. Later, this course was published. He also gave a definition of the limit of a function given on a semiordered set.\n(\nThe Moore-Shatunovskii limit.\n)\nShatunovskii often criticized in his lectures the unlimited use of the law of excluded middle and not only criticized but also gave in his doctoral thesis\n(\nin\n1917)\na constructive, i.e., without the law of excluded middle, presentation of the\nGalois theory\n.\nN G Chebotaryov\nspecially emphasized in his book \"Galois Theory\" that the presentation is based on Shatunovskii's ideas.\nShatunovsky's research was on several topics from analysis and algebra. In particular he produced excellent work in\ngroup theory\n, the theory of numbers, and geometry. Although not often recognised as the first to give the definition of a ring, there is little doubt that he has priority. He is perhaps best known, however, as one of the founders of the constructive approach to contemporary mathematics. Working on the foundations of mathematics, he produced an axiomatic theory independently of, but similar to, that of\nHilbert\n. He used the axiomatic method to lay the logical foundations of geometry, algebraic fields,\nGalois theory\nand analysis. We mention, in particular, his paper\nProof of the existence of transcendental numbers\n(1923)\n, and his two books:\n(\nwith I Yu Timchenko\n)\nNotes on spherical trigonometry\n(1919)\n; and\nIntroduction to analysis\n(1923)\nwhich was based on lecture courses he gave at Odessa. He published a book\nOn the measurement of straight line segments and constructing numbers using ruler and compass\non geometrical constructions with ruler and compass where he gave an algebraic interpretation but did not introduce\nGalois\ntheory. In his book\nMethods of solving linear trigonometry\nhe proposed a general principle of solving trigonometric problems based on the consideration of homogeneous functions of measure zero. He also made other important contributions to mathematics\n[\n4\n]\n:-\nWe must mention the active participation of the Odessa scientists and especially of\nV F Kagan\nand S O Shatunovskii in the work of the Odessa press \"Matezis\" which published both Russian and foreign physics and mathematics literature,\n(\nmonographs text books, popular books and pamphlets\n)\n. These publications were, as a rule, of high scientific and literary quality and attractively presented. They undoubtedly attracted many people towards mathematics and assisted in raising the level of its teaching both in secondary schools and in universities.\nNikolai Grigorievich Chebotaryov\ndescribed Shatunovsky's skills as a teacher\n[\n3\n]\n:-\nSamuil Osipovich was a brilliant teacher. Never sacrificing rigour, Samuil Osipovich was able to make his lectures containing challenging and profound ideas available to students. His lectures were always beautifully constructed and at the same time were extremely animated and infused with enthusiasm.\nShatunovsky died in\n1929\nfrom the painful disease of cancer of the oesophagus. During his illness he showed exceptional courage, never showing his pain and treating the illness with his characteristic humour. He continued to give lectures almost up to the day of his death.\nIn\n[\n3\n]\nChebotaryov\ngives this appreciation:-\nThe number of mathematicians who know the work of S O Shatunovsky is small, since he produced few \"facts\" in the narrow sense of the word. But those who are familiar with his work cannot but admire the elegance of its findings and, most importantly, the depth of his logical analysis. And in life, as in mathematics, Shatunovsky was a brilliant thinker, sometimes paradoxical, but always using invincible logic. ... In mathematics, as in any other spheres of thought, Shatunovsky was striking in his originality, poignancy and unshakable logic. Only those who knew him personally can appreciate the depth of thought with which he defended, it would seem, the most paradoxical views."
}