{
  "nome_completo": "Sheila Scott Macintyre",
  "nome_curto": "Sheila Scott Macintyre",
  "ano_nascimento": "1910",
  "ano_morte": "1960",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macintyre/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Cincinnati, Ohio, USA",
  "biografia": "Sheila Scott\n's parents were James Alexander Scott and Helen Myers Meldrum. James Scott was born in Banchory. a small town on Deeside to the west of Aberdeen. He attended the University of Aberdeen and became a school teacher. He was rector of Trinity Academy Edinburgh from\n1925\nto\n1942\n. Helen Meldrum was from Kilmuir Easter, in the County of Ross, just north of Inverness across the Moray Firth. She was the author of two books. Sheila was brought up in Edinburgh where she attended Trinity Academy Edinburgh and during the time that she was studying there her father was appointed rector of the Academy. She then attended Edinburgh Ladies' College, now renamed Mary Erskine School, from\n1926\nuntil\n1928\nwhen she graduated as Dux in Mathematics and joint Dux of the College.\nIn the same year,\n1928\n, she entered the University of Edinburgh where she won several scholarships. She graduated M.A. with first class honours in mathematics and natural philosophy in\n1932\n. It was usual for the top students in those days to study at Oxford or Cambridge University after taking their first degree at a Scottish University. Scott spent three years at Girton College at Cambridge. Her final year at Cambridge was one in which she undertook research under\nMary Cartwright\n's supervision. She published her first paper on the work she had done under\nCartwright\n's supervision\nOn the asymptotic periods of integral functions\nin\n1935\n.\nScott returned to Scotland to train as a teacher and she taught for five years in a number of schools from\n1934\n. She taught mathematics for four years at St Leonard's School, an independent girls' school in St Andrews which was founded in\n1877\nin the buildings which had been St Leonard's College of the University of St Andrews. Scott then taught mathematics for a short time at James Allen's School for Girls. The oldest girls' independent school in London, this school was founded in\n1741\nand is situated in Dulwich, South London. After this, Scott spent another short period teaching mathematics, this time at Stowe School in Buckingham. This school had been founded in\n1923\nand had over\n500\npupils when Scott taught there.\nDuring this period\nEdmund Whittaker\nintroduced Sheila Scott to\nArchibald James Macintyre\nwho was a mathematics lecturer at Aberdeen University. They married on\n27\nDecember\n1940\nand the following year Sheila Macintyre was appointed as an assistant lecturer in the same department as her husband in the University of Aberdeen. At this time World War II was taking place and several of the mathematics staff at Aberdeen had been called up for war service. She taught courses at the university filling in for the men who were fighting and also undertook research for a Ph.D. thesis. In\n1946\n, while she was pregnant with her second child, she gave up teaching but she continued to undertake research towards her doctorate. Sheila Macintyre completed her doctoral dissertation under\nE M Wright\n's supervision in\n1947\n.\nWright\nwrote:-\n... good as her research was there would have been more of it had she not had a family to look after.\nHer thesis\nSome Problems in Interpolatory Function Theory\nwas submitted to the University of Aberdeen in\n1947\n. In the same year she was awarded a Ph.D.\nMary Cartwright\nwrites\n[\n1\n]\n:-\nThe ideas of her thesis were entirely her own; starting from a paper by\nWright\non functional inequalities she pursued the problems involved into the field of interpolation series in which her husband was also interested.\nBetween\n1947\nand\n1958\nshe published another ten papers during a period when she brought up her two children Alister William Macintyre\n(\nborn\n8\nFebruary\n1944)\nand Susan Elizabeth Macintyre\n(\nborn March\n1950)\n. A third child, a boy named Douglas Scott Macintyre, died from enteritis in March\n1949\nat age two. Having given up teaching in\n1946\n, she was appointed as a Lecturer in Mathematics at the University of Aberdeen in\n1949\n.\nCossar gives a summary of her research contributions in\n[\n2\n]\n:-\nMrs Macintyre's chief mathematical interest was the theory of functions of a complex variable, and from\n1947\nonwards she made regular contributions to the subject. Some of her earlier work of this period was concerned with integral functions of exponential type, and in particular included a determination of bounds for the value of the \"\nWhittaker\nconstant\". Much of her work was on interpolation series associated with analytic functions. In a joint paper with her husband, convergence properties of the Abel series of a function, which had been discussed by several writers in the case of an integral function, were investigated for a class of functions regular in an angle. The\nLaplace transformation\nwas applied here, as it had been by various previous writers on the theory of functions, notably by\nA J Macintyre\n. Mrs Macintyre later devised an integral transform in which the kernel was obtained from that of the\nLaplace\ntransform by a process involving fractional differentiation, and applied it to extend the theory of the\nGregory\n-\nNewton\nand\nAbel\ninterpolation series. A long-standing conjecture on the convergence properties of the former was settled in one of her papers. In another, using results of the joint paper already mentioned, she solved a problem posed by\nRamanujan\nin\n1914\n.\nLet us add a comment on Sheila and\nArchibald Macintyre\n's joint work. In volume\n23\nof the\nJournal\nof the\nLondon Mathematical Society\n(1948)\nthere are two papers by the Macintyres. The first, by Sheila Scott Macintyre, is an\n8\n-page entitled\nA functional inequality\nwhile the next paper, by\nA J Macintyre\n, is a\n3\n-page paper entitled\nNote on the preceding paper\n. These two papers investigate a problem posed by\nE M Wright\nand give conditions on a real function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nand its derivatives to ensure that\nf\n(\nx\n)\n≤\nsin\n⁡\nx\nf (x) ≤ \\sin x\nf\n(\nx\n)\n≤\nsin\nx\nin a certain interval. Sheila Macintyre proves two new theorems attacking\nWright\n's question while\nArchibald Macintyre\nuses one the lemmas in Sheila Macintyre's paper to generalise a theorem proved by Wright in an earlier paper. A few years later, in\n1952\n, the two Macintyres published a more conventional type of joint paper, namely the\n2\n-author work\nTheorems on the convergence and asymptotic validity of Abel's series\n(\nmentioned by Cossar in the quote above\n)\nwhich was published in the\nProceedings\nof the\nRoyal Society of Edinburgh\n.\nIn\n1956\n, in collaboration with Edith Witte, she published\nGerman-English mathematical vocabulary\n. The Preface begins:-\nThis book is designed to help English-speaking mathematicians to read German. The German mathematician wishing to speak or write in English will require more guidance in the choice of the appropriate English equivalent. The vocabulary covers a fairly wide field in pure mathematics, but applied mathematics, statistics and mathematical logic are not included.\nSheila Macintyre was an active member of the\nEdinburgh Mathematical Society\nand of the\nMathematical Association\n. On\n3\nMarch\n1958\nshe was elected a Fellow of the\nRoyal Society of Edinburgh\nhaving been proposed for a fellowship by\nEdward Maitland Wright\n, Harold S A Potter, Charles Strachan, Reginald V Jones.\nIn\n1958\nMacintyre and her husband accepted visiting research professorships at the University of Cincinnati. They returned to Aberdeen in\n1959\nbut, on\n30\nSeptember of that year,\nArchibald Macintyre\nresigned his Senior Lectureship at Aberdeen so that he could take up a permanent post as Research Professor in Mathematics at Cincinnati. Sheila Macintyre resigned her Lectureship at the same time and was also appointed as a professor in the Mathematics Department at Cincinnati where she taught until her early death from breast cancer. She was a very successful lecturer at Cincinnati, being popular with both staff and students. James Alexander Scott, Sheila Macintyre's father, went to America with his daughter and her family. He settled there where he outlived Sheila Macintyre by three years.\nIn\n[\n1\n]\nCartwright\nquotes R C Buck who wrote about Macintyre's mathematical achievements:-\nIn her chosen area of analysis, she introduced powerful refinements of techniques, and what is much harder, new and original problems for investigation.\nEdward Maitland Wright\n, writing in\n[\n4\n]\n, says:-\nBrilliant original mathematician though Sheila was, it is even more as the superb teacher and the gay helpful colleague that we remember her. Her clarity of mind made her a quite exceptionally able lecturer, but it was her warm-hearted interest in each of her students\n(\ncombined with a shrewd assessment of their abilities\n)\nthat made her so successful a tutor and regent. They repaid her by a very real affection and respect."
}