{
  "nome_completo": "Shisong Mao",
  "nome_curto": "Shisong Mao",
  "ano_nascimento": "1936",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mao_Shisong/",
  "lugar_nascimento": "Chao Xian, (now Chaohu, Anhui Province), China",
  "lugar_morte": "Shanghai, China",
  "biografia": "Shisong Mao\nwas born in Chao Xian\n(\nnow Chaohu of Anhui Province\n)\nin China. He began studying mathematics at East China Normal University in Shanghai in\n1954\nand continued to work there after graduating in\n1958\n. Initially, he and several other young people formed a study group to teach themselves Probability and Mathematical Statistics. However, they found it very difficult to explore and fill the gap in knowledge of the subject at that time in China. Professor Mao has described that experience\n[\n1\n]\n:-\nIt was ever so challenging! We always argued with each other intensely just over a math question!\nProfessor Mao was dedicated to statistics throughout his life. He established one of the first three Statistics majors, and also the first Mathematical Statistics department in the whole country in East China Normal University in\n1983\nand\n1984\n. He wrote and edited more than ten professional textbooks for statistics education in Chinese, and was involved in over thirty others. The\n2004\ntextbook,\nProbability and Mathematical Statistics\n, written and edited by Shisong Mao, Yiming Cheng and Xiaolong Pu, is one of the most influential undergraduate textbooks in China.  Professor Mao was hired as a tenured professor of East China Normal University in December\n2002\n. He devoted himself to education, and was sincerely loved by students and generally respected by colleagues at home and abroad, winning the\nShanghai Yucai Award\nand the\nBaoGang Excellent Teacher Award\n. He was particularly committed to the application of mathematical statistics in the field of quality management. His teaching materials for engineers and training in the field of quality science won the\nNational Excellent Quality Management Worker and the National Quality Management Outstanding Contribution Award\n.\nHis wife Mrs Mao commented\n[\n1\n]\n:-\nHe would like to keep talking about statistics, even during the time when he was suffering from illness. Statistics was his life!\nProfessor Mao studied outside China three times:\n09\n/\n1961\n-\n07\n/\n1963\nMoscow State University, Soviet Union\n12\n/\n1984\n-\n03\n/\n1986\nvisiting University of Maryland and University of Wisconsin-Madison, USA\n10\n/\n1991\n-\n03\n/\n1992\nvisiting Canada\nWhen in Moscow Mao studied Information Theory, mainly working on mathematical problems in telecommunications. During this time, he published his first paper\nProbability and the Application\nin Russian. After returning to work in East China Normal University, he proposed applying information theory to cryptology communication. However, strong confidentiality concerns prevented him from trying.\nIn the spring of\n1965\nMao took his students to Luoyang Bearing Research Institute\n(\nin Henan Province\n)\n. Based on the real data of bearing life, they studied the random defects of bearings and methods of estimating life distribution. Perhaps this experience initiated Mao's joy in applying statistics to serve society. He said\n[\n1\n]\n:-\nIt is difficult to describe in words the sense of accomplishment that comes from reducing a lot of messy materials and summing them up in a law.\nFrom about\n1975\n, Mao promoted and applied further reliability methods. With several collaborators, he participated in the formulation of product reliability standards led by the Fourth Ministry of Machinery\n(\nlater renamed the Ministry of Electronics Industry\n)\n. They first cooperated to complete the Standard for Data Processing Method of Life Test and Accelerated Life Test\n(\nthe basis of national standard GB/T\n2689\n-\n1981)\n. This won the first prize of\nscientific and technological achievements of the Fourth Ministry of Machinery\n, and also won the\nmajor technical improvement achievements of the National Defense Science and Technology Commission second prize\n. Later, in view of the long life-test period and high cost of color TV sets and considering the long-term accumulated test data, Mao proposed using a Bayesian method, forming the\nBayesian Method for Life Test of Color Receivers\n(\nthe basis of the national standard GB/T\n9382\n-\n1988)\n. This won the first prize of\nscientific and technological progress of the Ministry of Electronics Industry\n. In\n1992\n, the\nThe Normal Distribution Interval Estimation Coefficient Table\nthat Mao participated in won the second prize of the\nScience and Technology Progress Award of the Ministry of Aeronautics and Space\n.\nMao, together with other teachers and industrial engineers, held statistical application seminars at Professor Zongshu Wei's home every three weeks on Sunday from\n1988\nto\n1993\n. They mainly discussed practical problems encountered by factory personnel, such as the determination of sample size, and they also introduced some emerging statistical methods. This seminar built bridges between engineers and teachers, and communicated and promoted the application of statistics. Recalling these experiences, Professor Mao once said emotionally\n[\n1\n]\n[\n2\n]\n[\n4\n]\n:-\nMathematical statistics cannot be done behind closed doors. Only when it is truly applied in the field of production practice can its value be reflected, and mathematical statistics really take root in China.\nOn\n29\nth December in\n1984\n, the first Department of Mathematical Statistics in China was established in East China Normal University. Mao was appointed as the first department head in\n1986\non his return from an extended study trip in the USA.\nUnder the leadership of Professor Mao, the whole department worked together to provide excellent training and promote scientific research. They achieved outstanding academic achievements in the fields of stochastic process, multivariate analysis, reliability statistics, and applied statistics, at the cutting edge of research in China. In\n1987\n, Mathematical Statistics of East China Normal University was identified as a key subject of higher education by the Ministry of Education in China.\nMao thought it was not appropriate to use directly or translated foreign textbooks as they were relatively difficult and too theoretical. Therefore, he invited experts from various universities to co-author a set of\nMathematical Statistics Series\n, which combined knowledge of the Chinese teaching context with ideas from the foreign teaching materials to express the principles and applications of statistical methods in plain language. Eight textbooks have been published since\n1986\n:\nMathematical Statistics\n(\nShisong Mao, Jinglong Wang\n)\n,\nIntroduction to Stochastic Processes\n(\nShengwu He\n)\n,\nRegression Analysis\n(\nJixiang Zhou\n)\n,\nExperimental Design\n(\nWanzhong Wang\n)\n,\nNonparametric Statistics\n(\nXiru Chen, Genxiang Chai\n)\n,\nPractical Multivariate Statistical Analysis\n(\nKaitai Fang\n)\n,\nTime Series Analysis\n(\nHongzhi An\n)\n,\nBasic Statistical Methods Course\n(\nQuan Fu, Beihua Hu\n)\n. The publication of this set of textbooks was welcomed by colleges and universities and solved their immediate needs.\nProfessor Mao had been dedicated to writing and editing tutorial materials for students his whole life. He once said\n[\n1\n]\n:-\nI suffered from the absence of books to read when I first got to know Probability. I studied for two years in China and two years in the Soviet Union; it just helped me to understand the basics of probability theory. I hope the Chinese younger generation does not take this tortuous road again, so I want to tell Chinese young people my understanding of Probability Theory and Mathematical Statistics, so they can acquire great command of the basics of this subject in a short period of time, which may take about six months to one year."
}