{
  "nome_completo": "Siegfried Heinrich Aronhold",
  "nome_curto": "Siegfried Aronhold",
  "ano_nascimento": "1819",
  "ano_morte": "1884",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aronhold/",
  "lugar_nascimento": "Angerburg, East Prussia (now Węgorzewo, Poland)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Siegfried Aronhold\n's father was the merchant M Aronhold, and his mother was W Saaling from an Angerburg family. The Aronhold family were Jewish, and when Siegfried Aronhold matriculated at university he gave his religion as Jewish. However, when he produced a handwritten CV later in his life\n(\nat age\n44\nyears\n)\nhe gave his religion as Protestant. This change was almost certainly not due to religious motives but rather to improve his prospects in the anti-Semitic environment in which he lived. He was brought up in Angerburg and studied first at the elementary school there before moving to the\nGymnasium\nat Rastenburg\n(\nnow Ketrzyn, Poland\n)\n. His father died while he was studying at the Gymnasium and, following this tragedy, his mother moved to Königsberg where Aronhold attended the Altstädtischen Gymnasium, graduating in\n1841\n.\nAronhold then entered the University of Königsberg to study mathematics and natural sciences, matriculating on\n25\nOctober\n1841\n. There he was taught by\nFriedrich Wilhelm Bessel\n, Friedrich Julius Richelot,\nLudwig Otto Hesse\nand\nFranz Ernst Neumann\nbut he was most influenced by\nCarl Gustav Jacob Jacobi\n. At the University, he joined the Mathematical Seminar run by\nBessel\n,\nJacobi\nand\nNeumann\nand twice received awards for producing the best work. When\nJacobi\nwas appointed to the University of Berlin in June\n1844\n, Aronhold followed him and he continued his studies of mathematics in Berlin under\nLejeune Dirichlet\nand\nJakob Steiner\n. He also studied physics at the University of Berlin, taught by Heinrich Gustav Magnus and Heinrich Wilhelm Dove. However, by this stage in his education he was able to work independently on mathematical research problems.\nThings were certainly not easy for the young Aronhold. He did not have any enthusiasm for school teaching and as a consequence he never made the time to take the state examinations to qualify him as a high school teacher. This was not his only problem, however, for he was well aware that as a Jew his prospects of a normal academic career were limited. Therefore, although he loved pure mathematics, he spent much time studying the applied side of the subject to give him better prospects to teach users of mathematics, physicists and engineers. He wrote from Berlin to\nHesse\nin Königsberg on\n1\nOctober\n1849\n[\n4\n]\n:-\nUnfortunately my external circumstances are not such that I could achieve a solid position in life, and the daily effort to earn a living produces a depressing influence on my scientific endeavours, making it utterly impossible to meet those obligations to which I consider necessary for entering into a better situation.\nIn February\n1850\nhe wrote to\nHesse\nsaying that he was too busy with his research to find time to take the examinations to qualify as a Gymnasium teacher, see\n[\n4\n]\n. He wrote to Richelot in September\n1850\nmaking the same comments, see\n[\n6\n]\n. For many years he made his living by giving private mathematics lessons. His research had, however, progressed extremely well and he had published a highly influential paper\nÜber die homogenen Funktionen dritter Ordnung von drei Veränderlichen\nⓉ\n(\nOn the homogeneous functions of the third order of three variables\n)\nin\nCrelle\n's Journal in\n1849\n. In the autumn of\n1850\nhe was offered a post as tutor in a respectable family in Vienna.\nHis doctorate from the University of Königsberg was awarded on\n5\nApril\n1851\n. Although he had not been studying at Königsberg, Richelot supported the award of the degree based partly on his thesis\nÜber ein neues algebraisches Prinzip\nⓉ\n(\nOn a new algebraic principle\n)\nand partly on the paper he had published in\n1849\nin\nCrelle\n's Journal. He resigned from his post as tutor in Vienna later in\n1851\nand returned to Berlin to take up a post.\nHe taught at the Royal Academy of Architecture in Berlin, an institution which later became part of the Technical University of Berlin, from\n1851\n. From\n1852\nuntil\n1854\nhe also taught at the Artillery and Engineer's School in Berlin. Aronhold continued to teach at the Academy of Architecture as a\ndozent\nfor several years. He was appointed to a permanent position at the Academy of Architecture in\n1860\nand later in the same year to a permanent position at the Industrial Institute, a second institution which would later become part of the Technical University of Berlin. Until this time he had not held a sufficiently secure position to allow him to support a wife and family but that all changed with the permanent positions in\n1860\n. In that year he married Marie Julie Friederike Hayn; they had three children, Henriette Marie\n(\nborn\n1861)\n, Emilie Margarethe\n(\nborn\n1866)\nand Maximilian Ignatz\n(\nborn\n1869)\n. Maximilian Aronhold became an assistant judge in\n1900\n.\nKarl Weierstrass\nalso taught at the Industrial Institute where he had been a professor since\n1856\nbut he collapsed in December\n1861\nand was too ill to teach during\n1862\n. At this stage Aronhold took over\nWeierstrass\n's teaching and, two years later, succeeded to his chair at the Industrial Institute. He was also appointed professor at the Royal Academy of Architecture in\n1863\n. Although he now had a high status in good institutions, nevertheless these Institutions did not have the power to confer doctorates. This meant that any students he advised necessarily had to have formal supervisors in other institutions. The most famous of these students was\nArthur Moritz Schönflies\n, who was one of Aronhold's students in the early\n1870\ns, but he had also taught\nSchönflies\n's older brother Samuel Martin Schönflies over ten years earlier. Aronhold was well respected for his excellent teaching\n[\n1\n]\n:-\nHe was considered an enthusiastic and inspiring teacher, and was held in high esteem everywhere.\nIn fact he was so happy teaching at the Industrial Institute that he turned down offers from prestigious institutions; the University of Giessen\n(1868)\n, the University of Zürich\n(1868)\n, the University of Dresden\n(1874)\nand the University of Heidelberg\n(1874)\n. In\n1879\nthe Industrial Institute and the Academy of Architecture were combined to form the Technical University of Berlin. Aronhold became Vice President of the new Technical University but was forced to step down from this post on\n1\nJuly\n1880\nbecause of a serious illness. He never fully recovered from this illness and died four years later.\nAronhold made important contributions to the\ntheory of invariants\n. The topic was also being intensively studied by\nSylvester\n,\nCayley\n,\nClebsch\nand\nHesse\nbut Aronhold was the first German to work on this topic. Certain linear\npartial differential equations\nwhich he came across in his work are characteristic of invariant theory and are named after him. His most important work on the topic was\nÜber eine fundamentale Begründung der Invariantentheorie\nⓉ\n(\nOn a fundamental justification of the theory of invariants\n)\npublished in\nCrelle\n's Journal in\n1863\n[\n1\n]\n:-\nIn this treatise Aronhold offers solid proof of his theory, which he had welded into an organic entity. His method refers to functions that remain unchanged under linear substitutions. He stresses the importance of the logical development of a few basic principles so that the reader may find his way through other papers. Aronhold established his theory in general and does not derive any specific equations. He derives the concept of invariants from the concept of equivalency for the general linear group of invariants. ... His efforts to obtain equations independent of substitution coefficients led to linear partial differential equations of the first order, which have linear coefficients. These equations, which are characteristic of the theory of invariants, are known as 'Aronhold's differential equations'.\nAlthough others were working in the same area at this time, Aronhold states that he arrived at his principles in\n1851\nand so has priority. There is certainly no reason to doubt that this is in fact the case and letters he wrote to\nHesse\nduring the years\n1849\nto\n1851\nsupport his claim. Before publishing this important memoir Aronhold\n[\n1\n]\n:-\n... had worked on plane curves. The problem of the nine points of inflection of the third order plane curve, which had been discovered by by\nPlücker\n, was brought to completion by\nHesse\nand Aronhold. Aronhold explicitly established the required fourth degree equations and formulated a theorem on plane curves of the fourth order. Seven straight lines in the plane determine one, and only one, algebraic curve of the fourth order, in that they are part of their double tangents and that among them there are no three lines whose six tangential points lie on a conic section.\nFinally we note that Aronhold was honoured with election to the\nGöttingen Academy of Sciences\nin\n1869\nand he was appointed as an editor of\nAnnali di Matematica\nin\n1867\n."
}