{
  "nome_completo": "Sigurður Helgason",
  "nome_curto": "Sigurður Helgason",
  "ano_nascimento": "1927",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Helgason/",
  "lugar_nascimento": "Akureyri, Iceland",
  "lugar_morte": "Belmont, Massachusetts, USA",
  "biografia": "Sigurður Helgason\nwas the son of Helgi Skúlason\n(1892\n-\n1983)\nand Kára Sigurðarsóttir Briem\n(1900\n-\n1982)\n. Helgi was born on\n22\nJune\n1892\nin Oddi, Iceland to Skúli Skúlason, who was cabinet secretary, and Sigríður Helgadóttir. He studied medicine from\n1910\n, graduating in\n1915\n. After practicing for a couple of years, he trained in Freiburg and Berlin in Germany to become a specialist in eye diseases. He worked as a doctor in Reykjavík from\n1921\nto\n1927\n, and then settled in Akureyri where he lived until\n1970\n. He was an adjunct lecturer in ophthalmology in the Faculty of Medicine of the University of Iceland between\n1923\nand\n1927\n. Kára Briem was born on\n1\nApril\n1900\nin Reykjavík where her father was the postmaster. Helgi and Kára married on\n31\nOctober\n1925\nand had three children: Skúli Helgason\n(1926\n-\n1973)\n, Sigurður Helgason\n(1927\n-\n2023)\n, the subject of this biography, and Sigriður Helgadóttir\n(1933\n-\n2003)\n. Skúli Helgason, born\n18\nJune\n1926\nin Reykjavík, became a doctor in Umea, Sweden, but died young. Sigriður Helgadóttir, born\n15\nFebruary\n1933\nin Akureyri, became a pathologist. The city of Akureyri, at the time when Sigurður was born, is described in\n[\n19\n]\n:-\nAkureyri was then the second largest city in Iceland with about\n3\n,\n000\npeople living there, whereas the population of Iceland was about\n103\n,\n000\n. As with other cities in northern Iceland, Akureyri was isolated, having only a few roads so that horses or boats were the transportation of choice. Its schools, based on Danish traditions, were good.\nMathematics fascinated Helgason from the time he was a young child and he would measure circular objects from home to calculate π. He entered Akureyri Junior College in\n1939\n. Although this school dates back to\n1880\n, for a long time it was linked with Reykjavík Gymnasium with students having to go to Reykjavík for their final three years. It was only in\n1930\nthe school became an independent Gymnasium, the second in Iceland. It offered a six year course with considerable emphasis on languages - Helgason took classes in Danish, English, German, and French. His science subjects were chemistry, astronomy, physics, and mathematics. He was greatly influenced by the astronomer Trausti Einarsson\n(1907\n-\n1984)\nwho had studied at Göttingen. Hejgason said in the interview\n[\n21\n]\nthat his mathematics teacher Einarsson:-\n... was a highly respected astronomer and geologist. And he had this infectious respect for mathematics, which he conveyed to the students. He became a professor at the University of Iceland in Reykjavík.\nAlthough Sigurður's father, Helgi Skúlason, was based in Akureyri, he travelled to various villages in north Iceland during the summer months to see patients with eye problems.\nWhile at the gymnasium, Sigurdur Helgason went with his father on one of these trips. This took them to Raufarhöfn which had a herring factory and Sigurður signed up to work there during the following few summers while still at school. It was a very hard job, with two six-hour shifts each day, but the pay was good. Before taking on the herring factory summer job, he had done farm work during the summer, haymaking and looking after animals. Although Iceland was neutral during World War II, British troops arrived there in\n1940\n. Sigurður sold \"War News\" newspapers to those who were stationed in Akureyri.\nHelgason graduated from Akureyri Gymnasium in\n1945\n. He had, of course, been six years at the Gymnasium, exactly the six years of World War II. He would have liked to have studied university mathematics at Göttingen in Germany but, in\n1945\n, this was out of the question. His second choice was the University of Copenhagen, but although this had operated during World War II, managing to hold most of its classes and conducting some research, Helgason was advised not to begin studying there in\n1945\nbut to wait a year until the University was fully operational. He therefore spent\n1945\n-\n46\nas a student in the School of Engineering at the University of Iceland in Reykjavík. He avoided the technical subjects, and took courses in mathematics, physics and chemistry, and a short course in philosophy.\nIn\n1946\nhe went to Denmark to begin his studies at the University of Copenhagen. Although his aim was to specialise in mathematics, for the first three years he took courses in mathematics, physics, chemistry and astronomy designed to bring students to a level required to teach these subjects in Danish secondary schools. He then specialised in mathematics taking the advanced courses. There were not many such courses and he could have completed his Candidatus magisterii degree quite quickly, but he was keen to enter for the University of Copenhagen Prize Competition. The topic proposed for the Prize was \"To establish a\nNevanlinna\n-type value distribution theory for\nDirichlet\nseries\". Anyone under\n30\nyears of age could apply, there was one year before solutions had to be submitted and entries were anonymous. A code on each entry allowed the name of the winning candidate to be determined but all other entries remained anonymous. Helgason was declared the winner of the University of Copenhagen Gold Medal in l\n951\n. He was awarded the\nCandidatus magisterii\ndegree in January\n1952\n.\nAlthough by taking part in the competition, he had begun mathematical research, Helgason assumed at this stage that his future would be as a gymnasium teacher of mathematics back in Iceland. His parents, however, suggested that he apply for a fellowship to study for a doctorate in the United States. His application was successful and he received a Fulbright Grant in\n1952\nwhich gave him the choice of studying at Harvard University or Princeton University. Helgason was taught at the University of Copenhagen by\nBørge Jessen\nwho had spent time in\n1933\n-\n34\nat the Institute for Advanced Study at Princeton and had also visited Harvard at that time. While at the Institute for Advanced Study\nJessen\nhad collaborated with\nSalomon Bochner\nand\nAurel Wintner\nleading to a joint paper with each. He had no hesitation in advising Helgason to study for his doctorate at Princeton; advice for which Helgason was very great grateful.\nHelgason flew from Keflavík Airport, the main Icelandic airport, to Idlewild Airport, New York, on a Pan American Airways flight, arriving on\n15\nMarch\n1952\n. He took a few courses, for example a topology course by\nRalph Fox\nwhom he had already met when Fox had visited Copenhagen. Another student taking this course was\nGian-Carlo Rota\nwith whom Helgason would later become very friendly when they were colleagues at MIT. In order to progress to become a Ph.D. candidate, students had to take the oral Ph.D. General Examination. Helgason was examined by\nEmil Artin\n,\nSolomon Lefschetz\nand\nDonald Spencer\nand began his Ph.D. studies with\nSalomon Bochner\nas his thesis advisor. He said\n[\n21\n]\n:-\nBochner\nwas inspiring to talk to, and he spoke freely about many things. I also liked the fact that although he talked to me about certain problems that he wanted me to get interested in, the fact that I was not interested in those problems but started on some other problems instead - he reacted positively to that and was very supportive. So I got into this habit of just following my own taste in the choice of topics to work on. This suited me better.\nHe was awarded a Proctor Fellowship to fund his second year at Princeton. After two years at Princeton, Helgason submitted his\n52\n-page thesis\nBanach Algebras and Almost Periodic Functions\nand was awarded his Ph.D. in\n1954\n. He published his first paper in\n1954\n, namely\nThe derived algebra of a Banach algebra\n. His address on this paper is Princeton University, but by the time his second paper\nSome problems in the theory of almost periodic functions\nwas published in\n1955\n, he was already on the staff at the Massachusetts Institute of Technology\n(\nMIT\n)\n. He gives the following acknowledgement on the\n1955\npaper:-\nThe author wishes to express his gratitude to Professor\nS Bochner\nfor his advice and many helpful conversations during the preparation of this paper.\nAfter completing his doctoral studies in\n1954\n, Helgason applied for instructorships  at both Harvard and MIT. He went to visit MIT with a friend and liked it, so when he received the offer of a place from them, he accepted immediately before Harvard had responded. The appointment at MIT was for two years as a C L E Moore Instructor. He had quite a light lecturing load, with a few elementary courses and only one advanced course on functional analysis. He began to make a serious study of\nHarish-Chandra\n's papers and\nÉlie Cartan\n's work. He became friendly with\nJohn Nash\nand played a lot of chess with\nNorbert Wiener\n.\nIn the summer of\n1955\nChicago had a summer workshop on functional analysis with\nGeorge Mackey\n,\nIrving Segal\n,\nIrving Kaplansky\nand\nPaul Halmos\nas lecturers.\nSaunders Mac Lane\n, who was chairman at Chicago, visited MIT before the meeting looking for young talent to invite to the workshop. He had some funding and offered financial support to Helgason. He took part in the summer meeting at Chicago which he found a very positive experience. Particularly valuable was becoming friendly with\nAlexander Grothendieck\n; they had meals together and went for walks on which they would talk mathematics.\nAfter the two years at MIT, Helgason was appointed as a lecturer at Princeton University in\n1956\n. Although Princeton was not a one year appointment, when he got an offer from the University of Chicago he accepted and left Princeton to became a Louis Block Assistant Professor at the University of Chicago in\n1957\n.\nHelgason married Artie Gianopulos on\n9\nJune\n1957\n. Artie Gianopulos had been born on\n23\nNovember\n1930\n, the daughter of the locksmith Gus Gianopulos and his wife Anne. Helgason had met Artie at a dance at Bryn Mawr College in\n1953\n. They became engaged to be married in December\n1956\nand the announcement of their engagement appeared in the\nPittsburgh Post-Gazette\non Monday,\n31\nDecember\n1956\n[\n2\n]\n:-\nMr and Mrs Gus Gianopulos of Methyl Avenue, Pittsburgh, have announced the engagement of their daughter, Artie Gianopolus, to Dr Sigurdur Helgason, son of Dr and Mrs Helgi Skulason of Akureyri, Iceland. Miss Gianopolus received her bachelor of arts degree from Chatham College in Pittsburgh and her master's degree from Bryn Mawr College. She is presently working as a research social worker at the Marriage Council of Philadelphia. Dr Helgason studied at the University of Copenhagen and received his doctor of philosophy degree in mathematics from Princeton University where he is currently teaching.\nSigurður and Artie Helgason had two children: Thor Helgason, born\n15\nAugust\n1961\n, who became an engineer, and Anna Loa Helgason, born\n10\nOctober\n1967\n, who became a medic.\nAfter two years at Chicago, Helgason was appointed to the mathematics faculty at MIT but was allowed to spend the year\n1959\n-\n60\nas an Assistant Professor at Columbia University before taking up the Assistant Professorship at MIT in\n1960\n. He was promoted rapidly becoming an Associate Professor in\n1961\n. In\n1962\nhe published his first book, namely\nDifferential Geometry and Symmetric Spaces\n. For information about this book including extracts from the Preface and from some reviews, see\nTHIS LINK\n.\nHe was awarded a Guggenheim Guggenheim Fellowship for\n1964\n-\n65\nto work on the project \"Theory of functions on symmetric spaces\" and he become a full Professor in\n1965\n.\nHelgason wrote\nDifferential Geometry, Lie Groups, and Symmetric Spaces\nwhich was published in\n1978\n. He wrote in the Preface:-\nThe present book is intended as a textbook and reference work on three topics in the title. Together with a volume in progress on \"Groups and Geometric Analysis\" it supersedes my \"Differential Geometry and Symmetric Spaces,\" published in\n1962\n. Since that time several branches of the subject, particularly the function theory on symmetric spaces, have developed substantially. I felt that an expanded treatment might now be useful.\nAlthough he was already working on \"Groups and Geometric Analysis\", he first published\nThe Radon Transform\nin\n1980\n. This work, based mostly on his own papers published between\n1959\nand\n1965\n, closely followed a lecture course he had given at MIT in the autumn of\n1966\n.\nGroups and Geometric Analysis: Integral Geometry, Invariant Differential Operators, and Spherical Functions\nwas published in\n1984\nfollowed by\nGeometric Analysis on Symmetric Spaces\nin\n1994\n. His final book was\nIntegral geometry and Radon transforms\npublished in\n2010\n. For more information about these very influential books and about second editions of some of them, see\nTHIS LINK\n.\nAlthough he spent the rest of his career at MIT, Helgason had a number of research visits to the Institute for Advanced Study in Princeton. He was a Member of the School of Mathematics at the IAS from September\n1964\nto June\n1966\n, from September\n1974\nto June\n1975\n, from September\n1983\nto January\n1984\nand from February\n1998\nto May\n1998\n. He also was a member of the Mittag-Leffler Institute in Sweden in\n1970\n-\n71\nand again in the autumn of\n1995\n. In the Spring of\n1990\nhe was on leave as a visiting professor at the University of Copenhagen.\nHelgason retired in\n2014\nafter serving for\n55\nyears on the MIT Mathematics Faculty. He received MIT's first Graduate Teaching Award in\n1975\nand served as the chair of the Graduate Faculty from\n1986\nto\n1993\n. The Faculty gave the following summary of his research contributions\n[\n23\n]\n:-\nHelgason for many decades led the study of group actions on manifolds. Generations of mathematicians entered the field through his classic\n1962\ntext 'Differential Geometry and Symmetric Spaces', and its greatly expanded\n1978\nsecond edition 'Differential Geometry,\nLie\nGroups, and Symmetric Spaces'. His own research contributions included the\nPlancherel\nand\nPaley\n-\nWiener\ntheorems for Riemannian symmetric spaces. He was a superb lecturer, a well-regarded graduate advisor, and a cherished colleague. ... As a part of his geometric work, Helgason helped to create the modern theory of\nRadon\ntransforms: seeking to reconstruct a function from its integrals along various subspaces.\n(\nThis is the mathematical basis of many kinds of medical imaging.\n)\nHelgason understood that a zoo of special results could be understood as instances of a very general \"double fibration\". This insight became part of the foundation of his work on the\nFourier\ntransform on symmetric spaces, his existence results for solutions of group-invariant differential equations, and his contributions to infinite-dimensional representation theory.\nAn overview of his contributions is also given in\n[\n19\n]\n:-\nSigurður Helgason is known worldwide for his first book 'Differential Geometry and Symmetric Spaces'. With this book he provided an entrance to the opus of\nÉlie Cartan\nand\nHarish-Chandra\nto generations of mathematicians. On this the occasion of his\n85\nth birthday we choose to reflect on the impact of Sigurður Helgason's sixty years of mathematical research. He was among the first to investigate systematically the analysis of differential operators on reductive homogeneous spaces. His research on\nRadon\n-like transforms for homogeneous spaces presaged the resurgence of activity on this topic and continues to this day. Likewise he gave a geometrically motivated approach to harmonic analysis of symmetric spaces. Of course there is much more - eigenfunctions of invariant differential operators, propagation properties of differential operators, differential geometry of homogeneous spaces, historical profiles of mathematicians.\nAmong the many awards that he was won for his outstanding work, we mention the Børge Jessen Diploma Award by the\nDanish Mathematical Society\nin September l\n982\n, the Steele Prize from the\nAmerican Mathematical Society\nin\n1988\n, and the Major Knights Cross of the Icelandic Falcon in\n1991\n. He was elected a member of the Icelandic Academy of Sciences in l\n960\n, of the\nAmerican Academy of Arts and Sciences\nin l\n970\n, and of the\nDanish Royal Academy of Sciences and Letters\nin l\n972\n. In\n1997\nhe was made an honorary member of the\nIcelandic Mathematical Society\n. He was awarded an honorary doctorate by the University of Iceland in l\n986\n, by the University of Copenhagen in\n1988\n, and by the University of Uppsala in\n1996\n. He became a fellow of the\nAmerican Mathematical Society\nin\n2012\n,\nHe was also honoured with two international conferences held in his honour. The first was the 'Conference on\nFourier\nand\nRadon\nTransformations on Symmetric Spaces' held at Roskilde, Denmark on\n10\n-\n12\nSeptember\n1992\nto mark his\n65\nth birthday. The second was the 'International Conference on Integral Geometry, Harmonic Analysis and Representation Theory' held in Reykjavik, Iceland on\n15\n-\n18\nAugust\n2007\nto mark his\n80\nth birthday. The Information concerning this conference states:-\nThe history of harmonic analysis goes back to the eighteenth century work of\nFourier\non the heat equation. But it is also closely related to the modern development of number theory, geometry, operator algebras, representation theory and physics, in particular quantum mechanics. The emphasis of this conference is on abstract harmonic analysis, integral geometry and representation theory of\nLie\ngroups and the interplay between those fields. This includes generalisations of well known integral transform like the Radon transform to compact and noncompact symmetric spaces, applications of complex methods in real harmonic analysis on homogeneous spaces and algebraic methods in representation theory and its connection to analysis.\nHe had several hobbies which are mentioned in\n[\n23\n]\n:-\nA self-taught pianist, Sigurður played almost daily up until the day before he died. An avid and skilled chess player, he was an early adopter of computer chess, starting with the\n(\nnow-obsolete\n)\n\"Chess Challenger\". He particularly enjoyed playing chess with his grandson during the many family gatherings held at his home. He was also an enthusiastic photographer, capturing images of the unique and beautiful parts of Iceland, as well as the more prosaic close-ups of the resident cardinal on his bird feeder in Belmont.\nDuring his career, he advised\n17\ndoctoral students and acted as a mentor many more. He particularly supported Icelandic students\n[\n23\n]\n:-\nCountless Icelandic students and musicians who came to study in Boston knew Sigurður as the unofficial \"consulate\". He extended remarkable hospitality to them and his home in Belmont was the \"home away from home\" for many Icelanders. It was a rare Thanksgiving, Christmas or Easter without at least one Icelandic student joining the celebration. He remained very close to his family and friends in Iceland, and made many extended visits.\nFollowing his death at the age of\n96\nin December\n2023\n, a remembrance of his life was held on\n20\nJanuary\n2024\nat the Scandinavian Living Center, in Newton, Massachusetts."
}