{
  "nome_completo": "Sridhara",
  "nome_curto": "Sridhara",
  "ano_nascimento": "870",
  "ano_morte": "930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sridhara/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Sridhara\nis now believed to have lived in the ninth and tenth centuries. However, there has been much dispute over his date and in different works the dates of the life of Sridhara have been placed from the seventh century to the eleventh century. The best present estimate is that he wrote around\n900\nAD, a date which is deduced from seeing which other pieces of mathematics he was familiar with and also seeing which later mathematicians were familiar with his work. We do know that Sridhara was a Hindu but little else is known. Two theories exist concerning his birthplace which are far apart. Some historians give Bengal as the place of his birth while other historians believe that Sridhara was born in southern India.\nSridhara is known as the author of two mathematical treatises, namely the\nTrisatika\n(\nsometimes called the\nPatiganitasara\n)\nand the\nPatiganita\n. However at least three other works have been attributed to him, namely the\nBijaganita\n,\nNavasati\n, and\nBrhatpati\n. Information about these books was given the works of\nBhaskara II\n(\nwriting around\n1150)\n, Makkibhatta\n(\nwriting in\n1377)\n, and Raghavabhatta\n(\nwriting in\n1493)\n. We give details below of Sridhara's rule for solving quadratic equations as given by\nBhaskara II\n.\nThere is another mathematical treatise\nGanitapancavimsi\nwhich some historians believe was written by Sridhara. Hayashi in\n[\n7\n]\n, however, argues that Sridhara is unlikely to have been the author of this work in its present form.\nThe\nPatiganita\nis written in verse form. The book begins by giving tables of monetary and metrological units. Following this algorithms are given for carrying out the elementary arithmetical operations, squaring, cubing, and square and cube root extraction, carried out with natural numbers. Through the whole book Sridhara gives methods to solve problems in terse rules in verse form which was the typical style of Indian texts at this time. All the algorithms to carry out arithmetical operations are presented in this way and no proofs are given. Indeed there is no suggestion that Sridhara realised that proofs are in any way necessary. Often after stating a rule Sridhara gives one or more numerical examples, but he does not give solutions to these example nor does he even give answers in this work.\nAfter giving the rules for computing with natural numbers, Sridhara gives rules for operating with\nrational\nfractions. He gives a wide variety of applications including problems involving ratios, barter, simple interest, mixtures, purchase and sale, rates of travel, wages, and filling of cisterns. Some of the examples are decidedly non-trivial and one has to consider this as a really advanced work. Other topics covered by the author include the rule for calculating the number of combinations of\nn\nn\nn\nthings taken\nm\nm\nm\nat a time. There are sections of the book devoted to arithmetic and geometric progressions, including progressions with a fractional numbers of terms, and formulae for the sum of certain finite series are given.\nThe book ends by giving rules, some of which are only approximate, for the areas of a some plane polygons. In fact the text breaks off at this point but it certainly was not the end of the book which is missing in the only copy of the work which has survived. We do know something of the missing part, however, for the\nPatiganitasara\nis a summary of the\nPatiganita\nincluding the missing portion.\nIn\n[\n7\n]\nShukla examines Sridhara's method for finding rational solutions of\nN\nx\n2\n±\n1\n=\ny\n2\n,\n1\n−\nN\nx\n2\n=\ny\n2\n,\nN\nx\n2\n±\nC\n=\ny\n2\nNx^{2} ± 1 = y^{2}, 1 - Nx^{2} = y^{2}, Nx^{2} ± C = y^{2}\nN\nx\n2\n±\n1\n=\ny\n2\n,\n1\n−\nN\nx\n2\n=\ny\n2\n,\nN\nx\n2\n±\nC\n=\ny\n2\n, and\nC\n−\nN\nx\n2\n=\ny\n2\nC - Nx^{2} = y^{2}\nC\n−\nN\nx\n2\n=\ny\n2\nwhich Sridhara gives in the\nPatiganita\n. Shukla states that the rules given there are different from those given by other Hindu mathematicians.\nSridhara was one of the first mathematicians to give a rule to solve a quadratic equation. Unfortunately, as we indicated above, the original is lost and we have to rely on a quotation of Sridhara's rule from\nBhaskara II\n:-\nMultiply both sides of the equation by a known quantity equal to four times the coefficient of the square of the unknown; add to both sides a known quantity equal to the square of the coefficient of the unknown; then take the square root.\nTo see what this means take\na\nx\n2\n+\nb\nx\n=\nc\nax^{2} + bx = c\na\nx\n2\n+\nb\nx\n=\nc\n.\nMultiply both sides by\n4\na\n4a\n4\na\nto get\n4\na\n2\nx\n2\n+\n4\na\nb\nx\n=\n4\na\nc\n4a^{2}x^{2} + 4abx = 4ac\n4\na\n2\nx\n2\n+\n4\na\nb\nx\n=\n4\na\nc\nthen add\nb\n2\nb^{2}\nb\n2\nto both sides to get\n4\na\n2\nx\n2\n+\n4\na\nb\nx\n+\nb\n2\n=\n4\na\nc\n+\nb\n2\n4a^{2}x^{2} + 4abx + b^{2}= 4ac + b^{2}\n4\na\n2\nx\n2\n+\n4\na\nb\nx\n+\nb\n2\n=\n4\na\nc\n+\nb\n2\nand, taking the square root\n2\na\nx\n+\nb\n=\n√\n(\n4\na\nc\n+\nb\n2\n)\n2ax + b = √(4ac + b^{2})\n2\na\nx\n+\nb\n=\n√\n(\n4\na\nc\n+\nb\n2\n)\n.\nThere is no suggestion that Sridhara took two values when he took the square root."
}