{
  "nome_completo": "Stanisław Leśniewski",
  "nome_curto": "Stanisław Leśniewski",
  "ano_nascimento": "1886",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lesniewski/",
  "lugar_nascimento": "Serpukhov (near Ivanovo-Vosniesiensk), Russia",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Stanisław Lesniewski\n's name should be written as Leśniewski but is usually transliterated as Lesniewski and we will use this form throughout this article. Lesniewski's father was Isydor Lesniewski, a Polish railway engineer. It was a job which involved Isydor Lesniewski being sent to places where railways were being constructed and at the stage when Stanisław was attending secondary school the family were living in Siberia. Stanisław attended school there in the town of Irkutsk.\nHe studied at several universities, spending some time in Munich where he attended lecturers by Hans Cornelius, before taking his doctorate at the Polish University of Lemberg\n(\nnow Lviv, Ukraine but then under the control of Austria\n)\n. In Lemberg he studied mainly philosophy and also took mathematics courses, attending mathematics lectures by\nJozef Puzyna\nand\nWacław Sierpiński\n. Lesniewski, whose doctoral supervisor was Kazimierz Twardowski, published the two papers\nA contribution to the analysis of existential propositions\nand\nAn attempt at a proof of the ontological principle of contradiction\nwhile still undertaking his doctoral research. These papers were published in Lesniewski's mother tongue of Polish but in\n1913\na Russian translation of the two papers was published under the single title\nLogical Studies\n. His doctorate was awarded in\n1912\n.\nAt that time\nJan Łukasiewicz\nwas teaching at Lemberg, being promoted from\nPrivatdozent\nto extraordinary professor in\n1911\n, and he greatly influenced Lesniewski in the first course on mathematical logic which he gave there. One way in particular that this influence was exerted was over the law of the excluded middle. One of Lesniewski's first projects had been to attempt to disprove this principle, but\nJan Łukasiewicz\nhad published an appendix to his\n1910\npublication\nOn the principle of contraction in Aristotle\nwhich caused Lesniewski to change to direction of his research. He began to study formal logic and began to make strenuous attempts to understand\nRussell\n's paradox which he had learnt through\nJan Łukasiewicz\n.\nIn\n1913\nLesniewski published an article on the law of the excluded middle, then in the following year a publication on\nRussell\n's paradox. He left Lwów to take up a teaching position at a Warsaw school but after the start of World War I he made the decision to return to Russia, He spent\n1914\n-\n18\nin Moscow where he taught at a Polish High School. Although he had presented his first ideas on a new theory of classes which would avoid the paradoxes while he was in Lwów, it was during his time in Moscow that Lesniewski published his formal theory called mereology. We give some further technical details of this theory below.\nAs soon as Poland was liberated at the end of the war, Lesniewski returned to Warsaw. There he began to get more involved in the study of mathematical logic.\nJaniszewski\nand\nMazurkiewicz\nhad created in Warsaw by the end of the war one of the strongest schools of mathematics in the world. Led by\nJaniszewski\nthis school was particularly interested in set theory, and the foundations of mathematics. Lesniewski enthusiastically joined\nJaniszewski\n's school of mathematics. In\n1919\n, he accepted the chair of the philosophy of mathematics at Warsaw where\nŁukasiewicz\nwas already teaching.\nVarious mathematicians in Warsaw, including\nJaniszewski\n,\nMazurkiewicz\nand Lesniewski, played a major role in the setting up of the journal\nFundamenta Mathematicae\n. It was\nJaniszewski\nwho proposed the name of the journal in\n1919\nbut Lesniewski was a member of the editorial board influencing policy. The first volume appeared in\n1920\nand, although the intention was for a truly international journal, the editors had quite deliberately decided to make the first volume contain papers by Polish authors only.\nJaniszewski\nwrote:-\n... it is my intention to present, if possible, all Polish mathematicians working in the field of set theory, to which the journal is devoted.\nŁukasiewicz\n, who as we mentioned was also on the staff at Warsaw University at this time, began collaborating with Lesniewski.\nŁukasiewicz\nhad considerable influence on Polish education over this period for he served as Polish Minister of Education in\n1919\nand was twice rector of Warsaw University. During this time\nŁukasiewicz\nand Lesniewski founded the Warsaw School of Logic. They gathered round them a group of impressive students.\nTarski\nwas a student of Lesniewski who helped make this school internationally famous as he progressed from student to colleague of Lesniewski and\nŁukasiewicz\n.\nIn\n1927\nLesniewski published his first important work on the foundations of mathematics. From then until\n1939\nhe published a series of twelve papers giving his theories of logic and mathematics. His theories overcame the paradoxes of\nRussell\nin set theory. The editors of\n[\n7\n]\nwrite in the Introduction to that work:-\nFor Lesniewski his publications were not the only way of publishing his new system of the foundations of mathematics. He attached great importance to his university lectures and he lectured almost entirely about his own work.\nThese lectures are given in\n[\n5\n]\n. Fortunately\nTarski\nwas able to make known the unpublished results of Lesniewski which were destroyed in World War II.\nThe author of\n[\n15\n]\nargues that the importance of Lesniewski's work is in providing an alternative to the classical approach to logic and the foundations of mathematics. Lesniewski's contributions to logic concentrate on the structure of a sentence, and he argues for the traditional idea of a sentence as consisting of a subject, an object and a copula. His mathematical work concentrates on set theory, where his concern is the nature of a set. Lesniewski puts the main emphasis on the distinction between sets in the distributive sense and sets in the collective sense.\nLesniewski's views developed from his analysis of\nRussell\n's paradox which he concluded confused two different notions of class. The three major logical systems which Lesniewski developed were: Protothetic, a theory of propositions and propositional functors, similar in power to a theory of propositional types, providing an extended propositional calculus with quantified functional variables; Ontology, which is an axiomatised theory of common names based on protothetic which may be characterised as a cross between traditional term logic and modern type theory, containing, besides singular terms, also empty and plural terms and a host of other interesting features; and Mereology, which is an axiomatic extension of ontology for a theory of classes quite different from set theory providing a formal theory of part and whole similar to the calculus of individuals.\nSurma, Srzednicki, Barnett and Rickey as the editors of\n[\n7\n]\nsum up Lesniewski's contributions:-\nStanisław Lesniewski was one of the co-founders of the Polish School of Logic and an author of a new and wholly original system of the foundations of logic and mathematics. He was also the forerunner and originator of many ideas included as a matter of course in modern textbooks of logic and the foundations of mathematics. Although Lesniewski played a considerable role during the period of development of modern mathematical logic and of the foundations of mathematics, his systems are not as well known as they deserve to be and the fact remains that his systems are not generally accepted as a tool in the foundational practice. Nevertheless, they have greatly influenced the very philosophy of mathematics."
}