{
  "nome_completo": "William Stanley Jevons",
  "nome_curto": "Stanley Jevons",
  "ano_nascimento": "1835",
  "ano_morte": "1882",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jevons/",
  "lugar_nascimento": "Liverpool, England",
  "lugar_morte": "Hastings, England",
  "biografia": "Stanley Jevons\n's father was Thomas Jevons and his mother was Mary Anne Roscoe. Thomas Jevons was an iron merchant but showed lots of talent both as an inventor of iron boats and as a writer on various legal and economic topics. Mary Anne Roscoe was the daughter of the historian William Roscoe. Thomas and Mary Roscoe had eleven children and Stanley was the ninth. The family were Unitarians, a liberal branch of the Protestant Church that bases its religious beliefs on reason, and Stanley was brought up with these beliefs. There is very clear evidence in Jevons later writings of the Unitarian influence.\nStanley was sent to London to became a boarder at University College School in\n1850\n. In the following year, still only sixteen years of age, he entered University College with a view to study chemistry and botany. He later wrote that his interest in the way that society worked began in his early days as a student, particularly since he could observe the condition of the poor in London as he walked about the city. He wrote\n(\nsee\n[\n5\n]\n)\n:-\nI began to think that I could and ought to do more than others. A vague desire and determination grew upon me.\nHe was filled with a desire to help but his aims were on a grand scale for he wanted to be\n[\n5\n]\n:-\n... powerfully good, that is to be good, not towards one, or a dozen, or a hundred, but towards a nation or the world.\nHe broke off his studies of natural sciences at University College in\n1854\nto take a job in Sydney in Australia. He was offered a position as an assayer at the new Australian mint. This involved determining the characteristics such as weight, measure, or quality of the coinage, and Jevons was offered the post because of his already impressive abilities at chemistry. He probably would not have been interested in such a post before he had completed his degree had his family not been in financial difficulties. His father's business had collapsed in\n1848\nand the attractively paid post in Sydney was too tempting for him to refuse since it allowed him to contribute substantially to his family's finances.\nIn Australia he had much leisure time, and little to occupy that time, so the five years he spent there were important ones for his mental development. Jevons became interested in meteorology\n(\nwriting a paper on the topic\n)\n, geology and political economy. He became more and more interested in economics yet it was a topic in which he was entirely self-taught. In February\n1858\n, while still in Australia, he wrote to his sister back in England\n[\n5\n]\n:-\nI am glad you find political economy tolerable. The Wealth of Nations is perhaps one of the driest on the subject. You will perceive that economy, scientifically speaking, is a very contracted science, it is in fact a sort of vague mathematics which calculates the causes and effects of man's industry, and shows how it may be best applied.\nIn the letter Jevons then goes on to express the same feeling of mission that he felt when a student\n[\n5\n]\n:-\nI have an idea ... that my insight into the foundations and nature of the knowledge of man is deeper than that of most men or writers. In fact, I think that it is my mission to apply myself to such subjects, and it is my intention to do so. ... Thoroughly to understand the principles of society appears to me now the most cogent business.\nTo some extent his job in the mint, involved in actually making money, must have influenced Jevons interests in economics, as must the failure of his father's family business. Now, filled with the feelings of mission he described, Jevons gave up his lucrative job and returned to England in\n1859\nto complete his education. Back in University College, London, he completed his B.A. and then was awarded his Master's Degree in\n1863\n. An important influence on Jevons while he was studying in London was\nDe Morgan\n, not in terms of Jevons thoughts on economics but certainly in terms of his thoughts on logic and\nprobability\n.\nJevons' developing thoughts on economics are evident in his correspondence. In\n1860\nwhen he was studying in London, Jevons wrote to his brother saying that he had recently found\n[\n5\n]\n:-\n... what I have no doubt is the true theory of economy, so thorough-going and consistent, that I cannot read other books on the subject without indignation.\nIn the same letter to his brother he outlined his ideas:-\nOne of the most important axioms is, that as the quantity of any commodity, for instance plain food, which a man has to consume, increases, so the utility or benefit derived from the last portion used decreases in degree.\nHe outlined these ideas on the marginal utility theory of value in\nGeneral Mathematical Theory of Political Economy\nwhich he read to the\nBritish Association for the Advancement of Science\nin\n1862\n(\nit was published in\n1866)\n.\nAfter being awarded his Master's Degree, Jevons was appointed as a tutor at Owens College, which went on to become the University of Manchester. He was appointed to a second post in\n1865\nwhen he became a part-time professor of logic and political economy at Queen's College, Liverpool. Then in\n1866\nhe was appointed to a chair of political economy at Manchester and also to a professorship in logic and mental and moral philosophy.\nIn\n1867\nJevons married Harriot Ann Taylor, one of the daughter's of the founder and first editor of the Manchester Guardian\n(\nfounded in\n1821\nas the weekly, it had become a daily paper in\n1855)\n. They had three children, one son Herbert Stanley Jevons following in his father's footsteps and becoming well known as an economist.\nJevons remained in Manchester until he moved to University College, London in\n1876\n. His time at Manchester was a highly productive one. He published\nPure Logic\nin\n1864\n, developed the 'logical piano' which was exhibited at the\nRoyal Society\nin\n1870\n, and he published\nThe Theory of Political Economy\nin\n1871\n. He was elected a fellow of the\nRoyal Society\nin\n1872\n. We should say a little more regarding some of these accomplishments.\nJevons's main contributions outside economics are in mathematical logic. It was\nBoole\n, particularly with his book\nThe Laws of Thought\n(1854)\n, who strongly influenced Jevons' ideas on mathematical logic. On the one hand Jevons can be seen as a strong supporter of\nBoole\n's ideas, and someone who both worked on improving them and bringing them to a wider audience. On the other hand his own version of the ideas contained certain weaknesses. Jevons and\nBoole\ncorresponded in\n1863\nand\n1864\n, and this correspondence is published in\n[\n12\n]\n. The article\n[\n11\n]\ndiscusses the differences between\nBoole\n's and Jevons' concepts of logic. Grattan-Guinness\n[\n10\n]\nsuggests that the main difference between their approach was that, although both believed they were studying the laws of thought,\nBoole\nhad a more algebraic concept of logic while Jevons argued that mathematics proceeds from logic. Jevons was fond of syllogistic methods.\nHowever, Jevons criticised certain aspects of\nBoole\n's work writing that\n(\nsee for example\n[\n1\n]\n)\n:-\n... the mathematical dress into which\n[\nBoole\n]\nthrew his discoveries is not proper to them, and his quasi-mathematical processes are vastly more complicated than they need have been.\nIn many ways this showed one weakness that Jevons had, namely that although he was advocating a mathematical approach to many problems, his lack of understanding of\nBoole\n's mathematics in particular shows that he could not fully appreciate it.\nThe 'logical piano', a machine designed by Jevons and constructed by a Salford watchmaker, had\n21\nkeys for operations in equational logic. It has many features which were later incorporated into computer design. As Gridgeman writes in\n[\n1\n]\n:-\nAlthough its principal value was as an aid to the teaching of the new logic of classes and propositions, it actually solved problems with superhuman speed and accuracy ...\nHis most important book in logic was\nPrinciples of science\n(1874)\n. This work made important contributions to probability as well as to logic. Jevons claims in this work that absolute precision in observations is impossible, as is a complete correspondence between a theory and the physical situation that it models. He stresses the interrelation between concepts rather than the more strictly 'cause and effect' philosophy which was then current. Although the work contains much in the way of innovative ideas perhaps its weaknesses are illustrated by one of his examples on the use of probability.\nJevons, writing in\n1873\n, knew\n64\nchemical elements had been discovered of which\n50\nare metals. He then naively claims that the probability that the next element discovered will be a metal is\n50\n+\n1\n64\n+\n2\n=\n17\n22\n\\large\\frac{50+1}{64+2}\\normalsize  = \\large\\frac{17}{22}\\normalsize\n6\n4\n+\n2\n5\n0\n+\n1\n​\n=\n2\n2\n1\n7\n​\n. Can the reader see what is wrong with this argument?\nWe have already noted that Jevons left Manchester in\n1876\nwhen he moved to University College, London. He was never as ease when lecturing and he felt that he would have to teach less in London than Manchester. However, he found that the London chair also required him to speak in public which he seemed to hate more and more. He resigned his chair in London in\n1880\nso that he might concentrate on writing. His health deteriorated despite many holidays in which he tried to recover. He drowned while swimming when on holiday in the south of England, but the most likely cause of the accident was that he suffered a heart-attack or stroke.\nJevons' work is very highly regarded by most.\nKeynes\n, on first meeting Jevons' writings when he was\n22\nyears of age wrote:-\nI am convinced that he was one of the minds of the century. He has the curiously exciting style of writing which one gets if one is good enough.\nHutchison writes in\n[\n14\n]\n:-\nFor breadth, variety, originality, and incisive penetration, Jevons' work as economist, statistician, logician, and philosopher is among the greatest on modern times.\nHowever, Mosselmans in\n[\n18\n]\ntakes a somewhat less positive attitude. He writes:-\n... Jevons was not a precursor of logical positivism despite his attempt to build up a unified science. His mechanical reductionism was directed towards this project, and Jevons tried to found mathematics on logic through the development of a theory of number. ... his attempts were unsuccessful, and ... his errors remain visible within the totality of his mechanical system, including his economics. ... Although Jevons did not succeed in establishing a unified science, his flawed methodology resulted in one of the first applications of statistics to the social sciences."
}