{
  "nome_completo": "Stefan Schwarz",
  "nome_curto": "Stefan Schwarz",
  "ano_nascimento": "1914",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwarz_Stefan/",
  "lugar_nascimento": "Nové Mesto nad Váhom, Austria-Hungarian Empire (now Slovakia)",
  "lugar_morte": "Bratislava, Slovak Republic",
  "biografia": "Stefan Schwarz\nwas born in Nové Mesto nad Váhom, meaning new town on the River Váh in central Slovakia. He attended secondary school in the town of his birth and already at this stage his talent for mathematics was clear to all his teachers who were impressed by the depth of his interest in the subject. In\n1932\nhe entered the Charles University of Prague, the Universita Karlova which had been founded in\n1348\nby the Holy Roman emperor Charles IV. Schwarz stayed at the Charles University after his undergraduate studies to work for his doctorate under the supervision of Karel Petr. Schwarz submitted his doctoral thesis\nOn the reducibility of polynomials over finite fields\nin\n1937\n.\nHowever\n1937\nwas the year in which the situation in Czechoslovakia became serious. In September\n1937\nHitler began his program of eastward expansion. In November\n1937\nhe informed his military chiefs of his intention to invade Austria and Czechoslovakia. After the annexation of Austria in March\n1938\nthe Czechoslovaks knew that they were next in line. Hitler, Mussolini, Chamberlain, and Daladier met at Munich on September\n29\n-\n30\n. They agreed the Munich treaty requiring the Prague government to cede to Germany all of Bohemia and Moravia with populations that were more than half German. On\n15\nMarch\n1939\nBohemia and Moravia were occupied by Hitler's armies and proclaimed a protectorate of the Third Reich. Schwarz knew that as a Jew his life would be in danger if he remained in Prague until the Nazis arrived so, immediately after Bohemia and Moravia were occupied, Schwarz left Prague and returned to Slovakia where he felt more safe.\nHe was able to find a post in the new Slovak Technical University in Bratislava and he taught there until\n1944\npublishing a\n64\npage work\nTheory of\nSemigroups\nin\n1943\n. However the Germans had taken over the whole country after May\n1942\nand mass executions followed. Many were sent to concentration camps and, in November\n1944\n, Schwarz was betrayed to the SS by some local informers. He was arrested and sent him to the Oranienburg-Sachsenhausen concentration camp north-west of Berlin.\nOf the total of around\n200\n000\nprisoners who were sent to Sachsenhausen, about\n100\n000\ndied there. Many of the remainder were transferred to other camps and indeed Schwarz was transferred to Buchenwald, a camp which complemented the Sachsenhausen concentration camp. There were no gas chambers at Buchenwald but hundreds still died there through disease, starvation, assaults and executions. In April\n1945\n, when Schwarz was near death, Buchenwald camp was liberated and his life was saved. Schwarz's two sisters did not survive the war however, one dying in the concentration camp at Auschwitz and the other in Bergen-Belsen camp.\nDespite his horrific experiences during the war, Schwarz quickly began to devote his energies to rebuilding the education system in his country. In\n1946\nhe was appointed to the Comenius University in Bratislava, then the following year he was appointed professor at the Slovak Technical University in Bratislava. He continued teaching there until he retired in\n1982\n. He was Head of the Mathematical Institute of the\nSlovak Academy of Sciences\nfrom\n1966\nuntil\n1987\n.\nIn\n[\n2\n]\nthe direction of Schwarz's research towards semigroup theory is described:-\n... in his dissertation Schwarz considered reducibility of polynomials over finite fields. Continuing his research, he studied arithmetic in the ring of integers in\nalgebraic number fields\n. This led him to a necessity of investigating systems closed under an associative operation and the abstract theory of ideals in such systems. In short, his interest in classical algebra and\nnumber theory\nbrought him to abstract semigroups.\nIn addition to his work on semigroups, number theory and finite fields, Schwarz contributed to the theory of non-negative and\nBoolean\nmatrices\n.\nSchwarz organised the first International Conference on Semigroups in\n1968\n. At this conference setting up the journal\nSemigroup Forum\nwas discussed and Schwarz became an editor from Volume\n1\nwhich appeared in\n1970\n, continuing as editor until\n1982\n. This was not his first editorial role since he had been an editor of the\nCzechoslovak Mathematical Journal\nfrom\n1945\nand continued to edit this journal until he was nearly\n80\nyears old. He also founded the\nMathematico-Physical Journal of the Slovak Academy of Sciences\nin\n1950\nand continued as an editor of the mathematics part of the journal when it split from the physics part to become\nMathematica Slovaca\nuntil\n1990\n.\nAmong the many honours which were awarded to Schwarz there were memberships of the\nCzechoslovak Academy of Sciences\nin\n1952\nand the\nSlovak Academy of Sciences\nin\n1953\n. He served as President of the\nSlovak Academy of Sciences\nfrom\n1965\nto\n1970\nand vice-president of the\nCzechoslovak Academy of Sciences\nfrom\n1965\nto\n1970\n. Schwarz was awarded the\n1980\nNational Prize of the Slovak Socialist Republic.\nSchwarz had a fine reputation as a teacher and was very well liked by his students who appreciated the help and guidance he gave them. The authors of\n[\n2\n]\nwrite:-\nAnyone who has listened to lectures by Schwarz could not fail to notice that he is an exceptionally clear expositor. That is why his lectures were so popular among students and graduate engineers. The following student saying is well known among the initiated \"If you don't understand Schwarz, go and study something far from mathematics ...\" ..."
}