{
  "nome_completo": "Subrahmanyan Chandrasekhar",
  "nome_curto": "Subrahmanyan Chandrasekhar",
  "ano_nascimento": "1910",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chandrasekhar/",
  "lugar_nascimento": "Lahore, India (now Pakistan)",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Subrahmanyan Chandrasekhar\nwas known throughout his life as\nChandra.\nHis father was C Subrahmanyan Ayyar and his mother was Sitalaksmi Aiyar. His father, an Indian government auditor whose job was to audit the Northwest Railways, came from a Brahman family which owned some land near Madras\n(\nnow Chennai\n)\n, India. Chandra came from a large family, having two older sisters, three younger brothers and four younger sisters. When Chandra was still young his parents moved to Madras\n(\nnow Chennai\n)\nand, as he grew up, he was encouraged to seek an education which would see him following his father into government service. However Chandra wanted to be a scientist and his mother encouraged him to follow this route. He had a role model in his paternal uncle Sir Chandrasekhara Venkata Raman who went on to win the Nobel prize in\n1930\nfor his\n1928\ndiscovery of Raman scattering and the Raman effect, which is a change in the wavelength of light occurring when a beam of light is deflected by molecules. See\n[\n15\n]\nfor some letters Chandra exchanged with his uncle.\nChandra studied at Presidency College, University of Madras, and he wrote his first research paper while still an undergraduate there. The paper was published in the\nProceeding of the Royal Society\nwhere it had been submitted by\nRalph Fowler\n. Also at Presidency College with Chandra was Lalitha Doraiswamy, who was the daughter of a family living close to where Chandra's family lived in Madras. They became engaged to marry at this time. Chandra obtained a scholarship from the Indian government to finance his studies in England, and in\n1930\nhe left India to study at Trinity College, Cambridge, England. From\n1933\nto\n1937\nhe undertook research at Cambridge, but he returned to India in\n1936\nto marry Lalitha on\n11\nSeptember. Mestel writes\n[\n2\n]\n:-\nTheir marriage, exceptionally, was by mutual choice rather than by arrangement. Lalitha's family was also very interested in education, and before her marriage she worked as a school headmistress. She was an ever-present support for Chandrasekhar during their fifty-nine years together. There were no children of the marriage.\nThey returned to Cambridge in\n1936\nbut in the following year Chandra joined the staff at the University of Chicago where he was to remain for the rest of his life. At first he worked in Yerkes Observatory, part of the University of Chicago in Wisconsin. Later he moved to work on the university campus in the city of Chicago. During World War II he worked in the Ballistic Research Laboratories at the Aberdeen Proving Ground in Maryland. Two reports, written in\n1943\n, show the type of problems he was working on at this time: the first is\nOn the decay of plane shock waves\nwhile the second is\nThe normal reflection of a blast wave\n.\nHe was honoured with being appointed Morton D Hull distinguished service professor of the University of Chicago in\n1952\n. Although by that time Chandra had been working in the United States for\n15\nyears, neither he nor his wife had taken out citizenship earlier. However, both became American citizens in the following year and became very much integrated into the life of the country. When Chandra was offered a chair at Cambridge in\n1964\nhe replied by return that he was not interested, so turning down a position which as a young man he would have found the most desirable.\nChandrasekhar published around\n400\npapers and many books. His research interests were exceptionally broad but we can divide them into topics and rough periods when he was concentrating on these particular topics. First he studied stellar structure, including the theory of white dwarfs, from\n1929\nto\n1939\n, then stellar dynamics from\n1939\nto\n1943\n. Next he looked at the theory of radiative transfer and the quantum theory of the negative ion of hydrogen from\n1943\nto\n1950\n, followed by hydrodynamic and hydromagnetic stability from\n1950\nto\n1961\n. During most of the\n1960\ns he studied the equilibrium and the stability of ellipsoidal figures of equilibrium but during this period he also began work on topics from general relativity, the radiation reaction process, and the stability of relativistic stars. During the period from\n1971\nto\n1983\nhe undertook research into the mathematical theory of black holes, then for the last period of his life he worked on the theory of colliding gravitational waves.\nIn\n1930\nChandra showed that a star of a mass greater than\n1\n.\n4\ntimes that of the Sun\n(\nnow known as the Chandrasekhar's limit\n)\nhad to end its life by collapsing into an object of enormous density unlike any object known at that time. He said:-\n... one is left speculating on other possibilities ...\nnamely objects such as black holes. However, this work led to a controversy between Chandra and\nEddington\nwho described Chandra's work as:-\n... almost a\nreductio ad absurdum\nof the relativistic degeneracy formula.\nEddington\n, who was a leading expert on relativity at this time, argued that:-\n... there is no such thing as relativistic degeneracy!.\nChandra was very frustrated by the controversy with\nEddington\nand to a certain extent it influenced the way that he worked through the rest of his life. Many years later Chandra was awarded the Nobel prize for Physics in\n1983\n-\n... for his theoretical studies of the physical processes of importance to the structure and evolution of the stars.\nHe described this work in\nThe Mathematical Theory of Black Holes\n(1983)\n. He said that:-\n... one of the ways in which one may explore the physical content of the general theory of relativity is to allow one's sensibility to its aesthetic base guide in the formulation of problems with conviction in the harmonious coherence of its mathematical structure.\nHis other books include\nAn Introduction to the Study of Stellar Structure\n(1939)\n,\nPrinciples of Stellar Dynamics\n(1942)\n,\nRadiative Transfer\n(1950)\n,\nPlasma Physics\n(1960)\n,\nHydrodynamic and Hydromagnetic Stability\n(1961)\n,\nEllipsoidal Figures of Equilibrium\n(1969)\n,\nTruth and Beauty: Aesthetics and Motivations in Science\n(1987)\n, and\nNewton's Principia for the Common Reader\n(1995)\n. These texts have played a major role in mathematical astronomy. For example a reviewer wrote of\nHydrodynamic and Hydromagnetic Stability:-\n... the author has no peer in the treatment of his main topics of thermal and rotational instability.\nAlso the review of\nPrinciples of Stellar Dynamics\nrightly asserts:-\nThe book is written with exceptional clarity ...\n[\nIt\n]\nshould prove stimulating to astronomer, mathematician and physicist.\nChandrasekhar was awarded the Royal Medal of the\nRoyal Society of London\nin\n1962\n:-\n... in recognition of his distinguished researches in mathematical physics, particularly those related to the stability of convective motions in fluids with and without magnetic fields.\nThe\nRoyal Society\nalso awarded him their Copley Medal in\n1984\n:-\n... in recognition of his distinguished work on theoretical physics, including stellar structure, theory of radiation, hydrodynamic stability and relativity.\nFrom\n1952\nuntil\n1971\nChandrasekhar was editor of the\nAstrophysical Journal\n. This journal was originally a local University of Chicago publication, but it grew in stature to become national publication of the American Astronomical Society, then a leading international journal.\nChandrasekhar received many honours for his outstanding contributions some of which, such as the Nobel prize for Physics in\n1983\n, the\nRoyal Society\n's Royal Medal of\n1962\nand their Copley Medal of\n1984\n, we have mentioned above. We should also mention, however, that he was honoured with the Bruce medal of the Astronomical Society of the Pacific, the Henry Draper medal of the\nNational Academy of Sciences\n(\nUnited States\n)\n, and the Gold Medal of the\nRoyal Astronomical Society\n.\nChandra retired in\n1980\nbut continued to live in Chicago where he was made professor emeritus in\n1985\n. He continued to give thought-provoking lectures such as\nNewton and Michelangelo\nwhich he delivered at the\n1994\nMeeting of Nobel Laureates held in Lindau. He compared Michelangelo's frescoes in the Sistine Chapel and\nNewton\n's\nPrincipia\n:-\n... in the larger context of whether there is any similarity in the motivations of scientists and artists in their respective creative quests.\nOther lectures in a similar vein include\nShakespeare, Newton and Beethoven or patterns of creativity\nand\nThe perception of beauty and the pursuit of science\n.\nChandrasekhar remained active and published in final major book\nNewton's Principia for the Common Reader\nat\n85\nyears of age in the final months of his life. Shortly after publication of this work he died from heart failure and was buried in Chicago. He was survived by his wife Lalitha. Let us end this biography by quoting the words of Tayler from\n[\n20\n]\n:-\n[\nChandrasekhar\n]\nwas a classical applied mathematician whose research was primarily applied in astronomy and whose like will probably never be seen again."
}