{
  "nome_completo": "Sun Zi",
  "nome_curto": "Sun Zi",
  "ano_nascimento": "400",
  "ano_morte": "460",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sun_Zi/",
  "lugar_nascimento": null,
  "lugar_morte": "China",
  "biografia": "Nothing is known about\nSun Zi\nexcept his text\nSunzi suanjing\n(\nSun Zi's Mathematical Manual\n)\n. Dating this is made more difficult since it is not known how much the text was changed or added to over time. Let us first look at the various theories about the date.\nIn the\n17\nth\ncentury Sun Zi was identified with Sun Wu, a famous military expert of the sixth century BC who wrote\nSun Zi's art of war\n. The\nRuan Yuan\nin his\nChouren zhuan\nor\nBiographies of astronomers and mathematicians\n(1799)\ncertainly realised that references in certain problems in the\nSunzi suanjing\nmeant that the identification with Sun Wu was incorrect. He placed Sun Zi around\n250\nBC but knew that there was still problems with this dating which he said would have to be studied later. Indeed such studies did take place and Dai Zhen, an\n18\nth\ncentury scholar, historian and mathematician, stated that it was impossible for the\nSunzi suanjing\nto have been written before about\n50\nBC.\nIn more recent times Alexander Wylie, the expert on China who worked with the London Missionary Society in Shanghai for many years, states in a text published in\n1897\nthat:-\nDuring the third century Sun Zi, an author of considerable note, published his Sunzi suanjing.\nL E Dickson\n, the American number theorist, claimed in\n1919\nthat the\nSunzi suanjing\nwas written in the first century AD. Wang Ling\n[\n10\n]\nseems to have the most convincing argument:-\nThe Sunzi suanjing mentions the mein as an item of taxation, and the hu tiao system. These two were first established in\n280\nAD. So the book could not have been written before this date. ... A new scale between chih and tuan was established in\n474\nAD; the Sunzi, still using the old scale by Wu Ch'en-Shih's emendation, cannot be older than\n473\nAD.\nOf course this dating assumes that the text was written as a whole, while it seems more likely that it was compiled, like many of the texts, from older sources. In that case Wang Ling's dating will only establish when part of the text was written, some possibly being earlier, while other parts probably have been written later. This theory is supported by the fact that in a bibliography compiled in\n636\nit is stated that the\nSunzi suanjing\nhas two chapters while today's version has three. Rather strangely it is the first of the three chapters which has a different form to the other two, so perhaps an elementary introduction was added at a later date.\nWhat of the modern texts? Lam and Ang in\n[\n1\n]\nsuggest it is a '\n3\nrd\ncentury AD treatise'; Martzloff in\n[\n2\n]\n(\nalso\n[\n3\n]\n)\ngives 'fifth century very approximately'; Bag and Shen\n[\n4\n]\nsay 'About\n400\nAD a Chinese mathematician, Sun Zi, took up the problem ...'; Berezkina\n[\n5\n]\nsays it was 'composed in the third or fourth century of our era'; Lam in\n[\n6\n]\nsays 'Sun Zi\n(\nsomewhere between the\n3\nrd\nand\n5\nth\ncenturies AD\n)\n...'; while Shen\n[\n9\n]\ngives the very precise date for the\nSunzi suanjing\nof\n237\nAD.\nLeaving the question of the date let us look briefly at the content of the treatise, before finally trying to make some guesses about Sun Zi based purely on the text. The\nSunzi suanjing\nconsists, as we have already noted, of three chapters. The first chapter describes systems of measuring with considerable detail, and gives instructions on using counting rods to multiply, divide, and compute square roots. It also gives two systems for designating high powers of ten. Sun Zi explains how to do multiplication on a counting board:-\nLay down the multiplicand in the upper row and the multiplier in the lower, with the product in between. Attention must be paid to the placing of the digits.\nSo the numbers to be multiplier are placed in the top and bottom of the three rows of the counting board and multiplications by single digits and additions take place in constructing the product in the middle row. Sun Zi then explains how to do division on a counting board:-\nIn division, reverse the order by placing rods in rows for quotient\n(\nupper\n)\n, dividend\n(\nmiddle\n)\n, and divisor\n(\nlower\n)\nrespectively,\nin this case the if one were dividing\n1813\nby\n49\n, then\n1813\nis placed in the middle row,\n49\nin the bottom row. Then division by single digits takes place, building up the answer in the top row, with subtraction from the middle row until it is empty.\nThe second and third chapters consist of problems\n(28\nproblems and\n36\nproblems respectively\n)\nconcerning fractions, areas, volumes etc. similar to, but rather easier than, the problems in the\nNine Chapters\non the\nMathematical Art\n. Here is a sample, rather easy, problem:-\nProblem\n3\n.\n34\n: Suppose that, after going through a town gate, you see\n9\ndykes, with\n9\ntrees on each dyke,\n9\nbranches on each tree,\n9\nnests on each branch, and\n9\nbirds in each nest, where each bird has\n9\nfledglings and each fledgling has\n9\nfeathers with\n9\ndifferent colours in each feather. How many are there of each?\nAnswer:\n81\ntrees,\n729\nbranches,\n6561\nnests,\n59049\nbirds,\n531441\nfledglings,\n4782969\nfeathers,\n43046721\ncolours.\nOne problem, however, is of special interest, this being Problem\n26\nin Chapter\n3\n:-\nSuppose we have an unknown number of objects. When counted in threes,\n2\nare left over, when counted in fives,\n3\nare left over, and when counted in sevens,\n2\nare left over. How many objects are there?\nThis, of course, is important for it is a problem which is solved using the Chinese remainder theorem. It is the earliest known occurrence of this type of problem. In fact the solution given, although in a special case, gives exactly the modern method. After solving the particular problem\n(\nthe answer is\n23)\nthe\nSunzi suanjing\ngives a method for arbitrary remainders:-\nMultiply the number of units left over when counting in threes by\n70\n, add to the product of the number of units left over when counting in fives by\n21\n, and then add the product of the number of units left over when counting in sevens by\n15\n. If the answer is\n106\nor more then subtract multiples of\n105\n.\nLet us mention one further major contribution by Sun Zi. Xu, in\n[\n11\n]\n, gives a detailed description of the algorithm used by Sun Zi for the extraction of roots and compares it with the method described in the\nNine Chapters\non the\nMathematical Art\n. Xu argues convincingly that Sun Zi's procedure differs from the earlier method in significant ways and so should be recognized as an outstanding and original contribution.\nCan we deduce anything of Sun Zi himself? Perhaps the most significant fact is that nothing is known. How can this tell us anything? Well first notice that since the work of modern historians has placed the\nSunzi suanjing\nmuch later than was thought in ancient times, we can now see that as nothing was known of Sun Zi within say\n100\nyears of his death. For example in the\nStandard History of the Sui dynasty\nthe treatise is mentioned with no details of the author, and the same occurs in other similar works. Unlike many Chinese mathematicians, Sun Zi cannot have been an important government official, nor to have been from a family of high social standing. The best guess would be that he was a scholar, clearly interested in the social issues of the day, but playing a very minor role in society. One problem suggests that he may have been a Buddhist for he mentions a Buddhist sutra in Problem\n4\nof Chapter\n3\n."
}