{
  "nome_completo": "Tatiana Ehrenfest-Afanassjewa",
  "nome_curto": "Tatiana Alexeyevna Afanassjewa",
  "ano_nascimento": "1876",
  "ano_morte": "1964",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ehrenfest-Afanassjewa/",
  "lugar_nascimento": "Kiev, Russian Empire (now Kyiv, Ukraine)",
  "lugar_morte": "Leiden, The Netherlands",
  "biografia": "Tatiana Alexeyevna Afanassjewa\n's father was Alexander Afanassjev. Alexander worked as Chief Engineer on the Imperial Railways in the Russian Empire and as a young girl, Tatiana went all over the Russian Empire with her father. However, while she was still quite young, her father died and after that she was brought up in St Petersburg by her uncle Peter Afanassjev, a professor at the Polytechnic Institute, and his wife Sonya. Tatiana studied at the normal school in St Petersburg, specialising in mathematics and science.\nAfter graduating from the normal school, Afanassjewa entered the Women's University in St Petersburg where she studied mathematics and physics under Orest D Chvolsou. In\n1902\nshe went to Germany to continue her studies with\nFelix Klein\nand\nDavid Hilbert\nat the University of Göttingen. There she met\nPaul Ehrenfest\n.\nPaul Ehrenfest\nhad moved to Göttingen in\n1901\n, like Tatiana Afanassjewa to study under\nKlein\nand\nHilbert\n. Both Paul and Tatiana attended courses by\nKlein\nand\nHilbert\n, and it was at this time that the two met.\nEhrenfest\nwondered why Tatiana did not come to meetings of the mathematics club but he then discovered that the reason was that women were not allowed to attend.\nEhrenfest\nchallenged this rule and, after quite a battle, was able to get the rule changed. It was the beginning of their friendship which led eventually to their marriage in\n1904\n. This took place after\nEhrenfest\nhad returned to Vienna where he received his doctorate on\n23\nJune\n1904\n. After this Tatiana left Göttingen to join\nEhrenfest\nin Vienna and they married after overcoming the severe problem of having different religions\n(\nPaul was Jewish and Tatiana was Russian Orthodox\n)\n. They both had to renounce their religion before the marriage was allowed - it took place on\n21\nDecember\n1904\n.\nPaul and Tatiana Ehrenfest remained at Vienna although Paul had no position there. Their first child, Tatyana Pavlovna Ehrenfest was born in October\n1905\nin Vienna. The family returned to Göttingen in September\n1906\n, hoping there might be a position available for Paul but there was not.\nKlein\nasked Paul and Tatiana Ehrenfest to write an article on statistical mechanics. The two Ehrenfests began working on the article at this time but it did would not appear in print until\n1911\n.\nIn\n1907\nthe Ehrenfests went to St Petersburg. It was not that either of them had a post there but with this move Tatiana was returning to the city in which she was brought up and the move was aimed at finding somewhere where the couple could feel at home. Certainly\nEhrenfest\nhad mixed feelings about his own country given the anti-Semitic attitudes he had encountered. The Ehrenfests spent five years in St Petersburg during which time they organised an informal physics colloquium which met:-\n... every other week, usually at Ehrenfest's home, for reports on work published recently in the physics literature. Occasionally one of the participants would have some current work of his own to report on. Discussions were lively and vigorous, often extending until midnight or even later.\nIt was a time when\nPaul Ehrenfest\nwas deeply engrossed in research problems and Tatiana became involved in a project to reform mathematics teaching in Russia. Tatiana, along with her husband, also worked on the review article on statistical mechanics which took longer to complete than expected. They corresponded with\nKlein\nwho told them that what was required was a survey, not a complete solution of all the problems of the subject by the Ehrenfests themselves.\nFrom\n1907\nto\n1912\nthe Ehrenfest's lived and worked in St Petersburg. Their second child, Anna\n(\noften called Galya or Galinka\n)\nwas born in July\n1910\n. With no paying position the family were very poor, now with two children to care for. In\n1912\nthe major article\nBegriffe Grundlagen der statischen Auffassung in der Mechanik\nⓉ\n(\nFoundations of statistical conception in mechanics\n)\nwhich\nKlein\nhad requested, was published in\nEncyclopädie der mathematische Wissenschaften\n. An English translation under the title\nThe conceptual foundations of the statistical approach in mechanics\nappeared in\n1959\n(\nand was reprinted in\n1990)\n. N G van Kampen writes in a review:-\nThis is the first English translation of the celebrated encyclopedia article of Paul and Tatiana Ehrenfest, published in\n1912\n. It consists of a critical discussion of the foundations of\n(\nclassical\n)\nstatistical mechanics, in particular, the use of the concept 'probability',\nBoltzmann\n's H-theorem, the objections of Loschmidt and\nZermelo\nand the various attempts to overcome them, and the difference between the approaches of\nBoltzmann\nand\nGibbs\n. Since the theory of irreversible processes has become an important branch of statistical mechanics, this discussion has gained new interest. Many English-speaking readers will be able to profit from the critical attitude of the authors and the thorough way in which they recognize and analyze the difficulties, rather than hide them in some streamlined formalism.\nOn\n29\nSeptember\n1912\nEhrenfest\nreceived a telegram saying that he had been named professor at Leiden and the family moved there. In\n1915\ntheir third child Paul was born, then in August\n1918\na second son Vassily was born\n[\n1\n]\n:-\nSometime during the twenties, Ehrenfest-Afanassjewa returned to Russia, where she taught mathematics and continued to publish papers, although the couple still met occasionally.\nPaul Ehrenfest\nthrough his life had suffered from low self esteem, but now began to suffer from depression. He was also greatly saddened by his youngest son Vassily who suffered from Down's syndrome and had severe problems both physically and mentally. On\n25\nSeptember\n1933\nEhrenfest\nshot Vassily in the waiting room of the Professor Watering Institute in Amsterdam where Vassily was being treated. Then he shot himself. The Dutch papers only reported his sudden death and gave lengthy accounts of his achievements. Ehrenfest-Afanassjewa returned to Leiden where she remained for the rest of her life. Not only did she lose her husband and youngest son in such a tragic way, but a few years later, in\n1939\n, her eldest son Paul was killed by an avalanche while skiing in the French Alps.\nTatiana Ehrenfest played an important role in mathematical education in the Netherlands. A discussion with\nE J Dijksterhuis\non the intuitive approach to teaching geometry in\n1924\nled to the appearance of a magazine for the didactics of mathematics, published under the name '\nEuclid\n.' The intuitive approach was characterised by contemplating obvious spatial concepts and phenomena. From\n1936\nTatiana Ehrenfest was the driving force behind the Mathematics Working Group of the Association of Education for Innovation and Education. The Working Group produced many decisive contributions to the development of teaching math in the Netherlands, especially after the end of World War II. She also continued to publish works such as\nDie Grunglagen der Thermodynamik\nⓉ\n(\nBasics of thermodynamics\n)\n(1956)\nand\nOn the use of the notion of 'probability' in physics\npublished in the\nAmerican Journal of Physics\nin\n1957\n.\nTatiana's eldest daughter, Tatiana Pavlovna Ehrenfest, attended the University of Leiden where she studied mathematics and physics. Like her mother, she was more interested in mathematics than in physics and taught mathematics at the University of Leiden. In mathematics she has done important work in collaboration with\nNicolaas Govert de Bruijn\n, Cedric Smith and\nBill Tutte\n.  She married the surgeon Dr van Aardenne."
}