{
  "nome_completo": "Theaetetus of Athens",
  "nome_curto": "Theaetetus",
  "ano_nascimento": "417 BC",
  "ano_morte": "369 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theaetetus/",
  "lugar_nascimento": "Athens, Greece",
  "lugar_morte": "Athens, Greece",
  "biografia": "Most of what we know of\nTheaetetus\n's life comes from the writing of\nPlato\n. It is clear that\nPlato\nheld Theaetetus in the highest regard and he wrote two dialogues which had Theaetetus as the principal character, one of the dialogues being\nTheaetetus\nwhile the other is the\nSophist\n.\nIn\nTheaetetus\na discussion between\nSocrates\n, Theaetetus and his teacher\nTheodorus\nof Cyrene is recorded. This conversation took place in\n399\nBC and Theaetetus is described as a youth at the time. This allows us to give a fairly accurate date for Theaetetus's birth\n(\nalthough some have claimed that the Greek word could describe a man of up to\n21\nyears old\n)\n. Again from\nPlato\nwe learn that Theaetetus's father, Euphronius of Sunium, was a wealthy man and left a large fortune. However, the money was squandered by the trustees of the will but despite this Theaetetus was generous to all around him.\nIn appearance Theaetetus had a snub nose and protruding eyes but he is described by\nPlato\nas having a beautiful mind and he is also described as being the perfect gentleman.\nTheodorus\nsaid that of all his pupils\n[\n1\n]\n:-\n... he had never found one so marvellously gifted.\nThere are two references to a 'Theaetetus' in the\nSuda Lexicon\n(\na work of a\n10\nth\ncentury Greek lexicographer\n)\n. The first states\n(\nsee for example\n[\n1\n]\n)\n:-\nTheaetetus, of Athens, astronomer, philosopher, disciple of Socrates, taught at Heraclea. He was the first to construct the so-called five solids. He lived after the\nPeloponnesian war\n.\nThe\nPeloponnesian War\nwas fought between Athens and Sparta from\n431\nBC to\n404\nBC so the dates here are consistent since Theaetetus would be\n13\nyears old when the War ended so saying the he 'lived after the Peloponnesian war' is reasonable.\nThe second reference in the\nSuda Lexicon\nstates\n(\nsee for example\n[\n1\n]\n)\n:-\nTheaetetus, of Heraclea in Pontus, philosopher and pupil of\nPlato\n.\nOf course it is unclear whether these refer to the same person or to two different people. There are many historians of mathematics who believe that these refer to the same person. Bulmer-Thomas in\n[\n1\n]\n, however, thinks that Allman's explanation in\n[\n5\n]\nis the most likely. According to this theory the second Theaetetus was the son of the first. If this is so then he would have been born when Theaetetus of Athens was teaching in Heraclea and would have been sent by his father to Athens to be educated at the\nAcademy\nthere under\nPlato\n.\nTheaetetus took part in the battle between Athens and Corinth in\n369\nBC. After acquitting himself with distinction in the battle, he was wounded and carried back to Athens. As a result of the wounds that he received in the battle, Theaetetus contracted dysentery and died in Athens.\nTheaetetus made very important contributions to mathematics and despite none of his writing having survived we do know a great deal about his contribution. Book X and Book XIII of\nEuclid\n's\nElements\nare almost certainly a description of Theaetetus's work. This means that it was Theaetetus's work on\nirrational\nlengths which is described in the Book X, thought by many to be the finest work of the\nElements\n.\nPappus\nwrote in the introduction to his commentary to Book X of\nEuclid\n's\nElements\n(\nsee for example\n[\n1\n]\n)\n:-\nThe aim of Book X of\nEuclid\n's treatise on the \"Elements\" is to investigate the\ncommensurable\nand the incommensurable, the\nrational\nand irrational continuous quantities. This science has its origin in the school of\nPythagoras\n, but underwent an important development in the hands of the Athenian, Theaetetus, who is justly admired for his natural aptitude in this as in other branches of mathematics. One of the most gifted of men, he patiently pursued the investigation of truth contained in these branches of science ... and was in my opinion the chief means of establishing exact distinctions and irrefutable proofs with respect to the above mentioned quantities.\nPappus\ntells us, therefore, that Theaetetus was inspired by the work of\nTheodorus\nto work on incommensurables and that he made major contributions to the theory. In\nHeath\n's translation, see for example\n[\n3\n]\n,\n(\nwe repeat in a slightly different form part of the above quotation by\nPappus\n)\nthe theory of irrationals:-\n... was considerably developed by Theaetetus the Athenian, who gave proof, in this part of mathematics as in others, of ability which has been justly admired. ... As for the exact distinctions of the above-named magnitudes and the rigorous demonstrations of the propositions to which this theory gives rise, I believe that they were chiefly established by this mathematician. For Theaetetus had distinguished square roots commensurable in length from those which are incommensurable, and who divided the more generally known irrational lines according to the different means, assigning the\nmedial\nline to geometry, the\nbinomial\nto arithmetic and the\napotome\nto harmony, as stated by\nEudemus\n...\nB L\nvan der Waerden\nargues in\n[\n4\n]\nthat Book X of the\nElements\nis entirely the work of Theaetetus. He writes:-\nHas the same Theaetetus who studied the medial, the binomial, and the apotome, also defined and investigated the ten other irrationalities, or were they introduced later on? It seems to me that all this is the work of one mathematician. For the study of the\n13\nirrationalities is a unit. The same fundamental idea prevails throughout the book, the same methods of proof are applied in all cases. ... Hence the entire book is the work of Theaetetus.\nHowever, as Bulmer-Thomas points out in\n[\n1\n]\n,\nvan der Waerden\n's argument only holds up if we assume that\nEuclid\nhas not done a lots of work in unifying the methods and giving a consistent approach to the work of Book X. Bulmer-Thomas prefers the conjecture that although Book X is based on Theaetetus's work there is much due to\nEuclid\npresented there too.\nPlato\n, writing in his work\nTheaetetus\n, has Theaetetus describe how he came to generalise\nTheodorus\n's proof that √\n3\n, √\n5\n, ..., √\n17\nwere irrational\n(\nsee for example\n[\n3\n]\n)\n:-\nThe idea occurred to the two of us\n[\nTheaetetus and the younger Socrates\n]\n, seeing that these square roots appeared to be unlimited in multitude, to try to arrive at one collective term by which we could designate all these roots. ... We divided number in general into two classes. The number which can be expressed as equal multiplied by equal we likened to a square in form, and we called it square ... The intermediate number, such as three, five, and any number which cannot be expressed as equal multiplied by equal ... we likened to an oblong figure and called it an\noblong number\n...\nIn\n[\n10\n]\n, however, Paiow argues that\nTheodorus\nhad a general method and only presented the particular cases for pedagogical reasons. If his arguments are valid then, of course, Theaetetus would not be the first to prove the general result.\nTheaetetus is also thought to be the author of the theory of proportion which appears in\nEudoxus\n's work.\nTheaetetus was the first to study the\noctahedron\nand the\nicosahedron\nand it is believed that Book XIII of\nEuclid\n's\nElements\nis based on his work. A comment\n(\nthought to be due to\nGeminus\n)\nstates\n[\n3\n]\n:-\n... the five so-called Platonic figures which, however, do not belong to\nPlato\n, three of the five being due to the Pythagoreans, namely the cube, the pyramid, and the\ndodecahedron\n, while the octahedron and the icosahedron are due to Theaetetus.\nWe quoted from\nPappus\nabove where he described Theaetetus's work on the medial, the binomial, and the apotome. Given two magnitudes\na\n,\nb\na, b\na\n,\nb\nthe medial is\na\nb\nab\na\nb\n, the binomial is\na\n+\nb\na + b\na\n+\nb\n, and the apotome is\na\n−\nb\na - b\na\n−\nb\n. It is easy to see that the medial and the binomial are closely related to the geometric mean and the arithmetic mean respectively. What is much less clear is how the apotome is\na\n−\nb\na - b\na\n−\nb\nis related to the modern harmonic mean."
}