{
  "nome_completo": "Theon of Smyrna",
  "nome_curto": "Theon of Smyrna",
  "ano_nascimento": "70",
  "ano_morte": "135",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theon_of_Smyrna/",
  "lugar_nascimento": "Smyrna (now Izmir), Turkey",
  "lugar_morte": null,
  "biografia": "Little is known of\nTheon of Smyrna\n's life. He was called 'the old Theon' by\nTheon\nof Alexandria and 'Theon the mathematician' by\nPtolemy\n. The date of his birth is little better than a guess, but we do have some firm data about dates in his life. We know that he was making astronomical observations of Mercury and Venus between\n127\nand\n132\nsince\nPtolemy\nlists four observations which Theon made in\n127\n,\n129\n,\n130\nand\n132\n. From these observations Theon made estimates of the greatest angular distance that Mercury and Venus can reach from the Sun. The style of his bust, dedicated by his son 'Theon the priest', gives us the date of his death to within\n10\nyears and it is placed within the period\n130\n-\n140\n(\nhence our midpoint guess of\n135)\n.\nTheon's most important work is\nExpositio rerum mathematicarum ad legendum Platonem utilium\n. This work is a handbook for philosophy students to show how\nprime numbers\n, geometrical numbers such as squares, progressions, music and astronomy are interrelated. Its rather curious title means that it was intended as an introduction to a study of the works of\nPlato\n, but this is rather fanciful. As Huxley writes in\n[\n1\n]\n:-\n... the book has little to offer the specialist student of\nPlato\n's mathematics. It is, rather, a handbook for philosophy students, written to illustrate how arithmetic, geometry, stereometry, music, and astronomy are interrelated.\nThe most important feature of the work is the wide range of citations of earlier sources. Its worst feature is its lack of originality.\nHeath\nwrites\n[\n2\n]\n:-\nTheon's work is a curious medley, valuable, not intrinsically, but for the numerous historical notices which it contains.\nIn the introduction Theon gives his reason for writing the work:-\nEveryone would agree that he could not understand the mathematical arguments used by\nPlato\nunless he were practised in this science... One who had become skilled in all geometry and all music and astronomy would be reckoned most happy on making acquaintance with the writings of\nPlato\n, but this cannot be come by easily or readily, for it calls for a very great deal of application from youth upwards. In order that those who have failed to become practised in these studies, but aim at a knowledge of his writings, should not wholly fail in their desires, I shall make a summary and concise sketch of the mathematical theorems which are specially necessary for readers of\nPlato\n....\nThe work begins with a collection of theorems which Theon says will be useful for the study of arithmetic, music, geometry, and astronomy in\nPlato\n. However his coverage of geometry is none too good and later in the book he makes an excuse for this saying that anyone who reads his book, or the works of\nPlato\n, will have already studied elementary geometry.\nIn the section on numbers Theon adopts a Pythagorean approach, writing about odd numbers, even numbers, prime numbers,\ncomposite numbers\n,\nsquare numbers\n,\noblong numbers\n,\ntriangular numbers\n,\npolygonal numbers\n, circular numbers, spherical numbers, solid numbers with three factors,\npyramidal numbers\n,\nperfect numbers\n,\ndeficient numbers\nand\nabundant numbers\n.\nThe best section of\nExpositio rerum mathematicarum\nis the astronomy section which teaches that the Earth is spherical, that mountains are negligible in height compared with the Earth etc. It includes knowledge of\nconjunctions\n, eclipses,\noccultations\nand\ntransits\n. However,\nNeugebauer\nwrites in\n[\n3\n]\n:-\nIt is clear that Theon's treatise does not pretend to make original contributions to astronomy. Unfortunately it is also clear that Theon has not fully digested the material he is presenting to his readers.\nTheon also wrote commentaries on the main authorities of mathematics and astronomy. In particular he wrote an important work on\nPtolemy\nand another on\nPlato\n's\nRepublic\nwhich he refers to himself in work which survives. Whether his work on the ancestry of\nPlato\nis a separate work or a section of one of his commentaries on\nPlato\n's work, it is impossible to say."
}