{
  "nome_completo": "Valentina Mikhailovna Borok",
  "nome_curto": "Valentina Mikhailovna Borok",
  "ano_nascimento": "1931",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borok/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": "Haifa, Israel",
  "biografia": "Valentina Mikhailovna Borok\nwas born on\n9\nJuly\n1931\nin Kharkov, Ukraine. Her father, Michail Borok, had a PhD in chemistry and was an expert in material science. His genealogy can be traced back to Vilna Gaon\n(\nthe leading scholar and sage of Lithuanian Jews in the eighteenth century\n)\n. Her mother, Bella Sigal, was an economist. A top student, Bella began graduate school in the early\n1920\ns, but was soon commissioned for a government job. In the early\n1930\ns she held one of the top positions in the ministry of economics of Ukraine. Because of her mother's position, Valentina had a\n(\nrelatively\n)\nprivileged early childhood. Yet, a Jewish woman at such a high position in the government, Bella could not possibly have been spared of the repressions of late\n1930\ns. However, unlike most others, she had a remarkable wisdom to foresee what was about to happen and the ability to act on it. In the beginning of\n1937\n, she voluntarily resigned from her position\n(\ngiving up the many perks that came with it\n)\nby citing family reasons, and took instead a low-key job. That saved her and her family. From that time on, Valentina fully shared the hardships of the majority of the population of Ukraine, including the very difficult years of evacuation during World War II.\nIn\n1949\n, on the advice of her high school teachers, Valentina decided to study mathematics and was admitted as a mathematics student to Kiev State University. There she met, and later married, a fellow mathematics student Yakov Zhitomirskii. They were inseparable for the next\n54\nyears. In her second year of undergraduate studies, Valentina\n(\nalong with Yakov\n)\nstarted research under the supervision of Georgii Shilov, and quickly established herself as a serious scientist. Her undergraduate thesis on distribution theory and its applications to the theory of systems of linear partial differential equations was noted as outstanding and published in a top Russian journal. It was later\n(\nin\n1957)\nselected for one of the first volumes of the\nAmerican Mathematical Society\ntranslations. In\n1954\n, Valentina graduated from Kiev University and moved\n(\nfollowing G E Shilov\n)\nto the graduate school at Moscow State University, where she received a PhD in\n1957\nfor a thesis\nOn Systems of Linear Partial Differential Equations with Constant Coefficients\n.\nHer papers published in\n1954\n-\n1959\ncontain a range of \"inverse\" theorems that allow partial differential equations to be characterized as parabolic or hyperbolic, by certain properties of their solutions. In the same period she obtained formulae that made it possible to compute in simple algebraic terms the numerical parameters that determine classes of uniqueness and well-posedness of the\nCauchy\nproblem for systems of linear partial differential equations with constant coefficients.\nFrom\n1960\nto\n1994\nValentina Borok worked at Kharkov State University. She became a full professor there after an award of her\nhabilitation\nin\n1970\n, and from\n1983\nto\n1994\nshe was the Chair of the analysis department.\nIn the early\n1960\ns Valentina worked on fundamental solutions and stability for partial differential equations well-posed in the sense of Petrovskii. Her two other lines of work in that period were on the parabolic systems degenerating at infinity and on the dependence of classes of uniqueness on the transformations of the spatial argument. Her results in both of these directions are still quite influential some\n40\nyears later. Valentina's work during that time was mostly joint with Yakov Zhitomirskii.\nStarting in the late\n1960\ns, Valentina began a series of papers that lay the foundations for the theory of local and non-local boundary value problems in infinite layers for systems of partial differential equations. Her central results include the construction of maximal classes of uniqueness and well-posedness,\nPhragmén\n-\nLindelöf\ntype theorems, and the study of asymptotic properties and stability of solutions of boundary-value problems in infinite layers. In the early\n1970\ns Valentina Borok founded a school on the general theory of partial differential equations in Kharkov. Her results have been further developed and extended by her students. The work of Valentina Borok and her school on boundary value problems in layers forms an important chapter in the general theory of partial differential equations. Her other important contributions were in the area of difference, difference-differential, and functional-differential equations. She was, as many believe, the most prominent female mathematician in Ukraine during most of the\n1970\ns-\n1980\ns.\nDuring her lifetime, Valentina published some\n80\npapers in top Russian and Ukrainian journals. She supervised\n16\nPhD students and many more master theses. Students started working with her as undergraduates and then continued through graduate school. However, this was not so for several of her students, including some of the very best ones, who were denied entrance to the graduate school because of their Jewish nationality. Instead they had to take mandatory post-graduate full-time jobs, leaving little time for research. Valentina continued working with them informally and encouraging them to pursue their research. After their theses were ready, she worked very hard to organize their defense at Universities in other states of the Former Soviet Union with other formal advisors. Valentina was a true mother figure to all of her students, and was very much involved in, and always ready to help with, various aspects of their lives.\nValentina Mikhailovna was considered THE teacher of rigorous analysis in Kharkov State University. That was the course in which all the ambitious mathematics students at Kharkov State got their first taste of research through her famous sets of \"creative problems\", which were required to get an A. She also developed and published original lecture notes on a number of other core, as well as more specialized courses, in analysis and partial differential equations. She established the curriculum and set the tradition that is being actively used over\n30\nyears later. Valentina Borok was a brilliant lecturer and an extremely dedicated teacher to her undergraduates.\nIn\n1994\n, a grave illness forced Valentina to urgently retire and emigrate to Israel, as the necessary medical treatment was unavailable in Ukraine. The last ten years she lived in Haifa. She enjoyed very close relationships with her two children, who often sought her advice and wisdom on various aspects of their lives. Her son Michail Zhitomirskii, who works on the theory of differentiable manifolds, and daughter Svetlana both became research mathematicians. Valentina Borok was actively involved in raising and educating her five grandchildren at all stages of their growth. Her grandchildren ranged in age from\n5\nmonths to\n24\nyears at the time of her death in\n2004\n. At least some of them are continuing her legacy."
}