{
  "nome_completo": "Vincenzo Riccati",
  "nome_curto": "Vincenzo Riccati",
  "ano_nascimento": "1707",
  "ano_morte": "1775",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Riccati_Vincenzo/",
  "lugar_nascimento": "Castelfranco Veneto near Treviso (now Italy)",
  "lugar_morte": "Treviso (now Italy)",
  "biografia": "Vincenzo Riccati\nwas the second son of\nJacopo Riccati\nand his wife Elisabetta dei Conti d'Onigo. Jacopo and Elisabetta were married on\n15\nOctober\n1696\nand had eighteen children, nine of whom died in childhood and nine survived to adulthood.\nJacopo Riccati\nwas of independent means and had a large estate at Castelfranco Veneto, a small town about\n30\nkm north of Padua and about\n40\nkm north west of Venice. There he cared for his family and also played a major role in the administration of the town, being mayor for nine years between\n1698\nand\n1729\n. Of the nine surviving children, the two sons who achieved fame, other than Vincenzo the subject of this biography, were\nGiordano Riccati\n(1709\n-\n1790)\nand Francesco Riccati\n(1718\n-\n1791)\n.\nGiordano\n, after studying law, made notable contributions to musical temperament and to architecture. Francesco, like his brothers, was an extraordinarily versatile scholar.\nVincenzo's early education was at home and from the Jesuits. From the age of ten he studied at the Jesuit College of San Francesco Saverio in Bologna, being taught mathematics and philosophy there by Luigi Marchenti, a former pupil of\nPierre Varignon\nat Paris. Riccati entered the Jesuit order on\n20\nDecember\n1726\ngoing to the Jesuit College in Piacenza in\n1728\nto teach literature. In\n1729\nhe moved to the College in Padua where he both taught and studied, then he moved to the College of Santa Caterina in Parma in\n1734\n. At the College of Santa Caterina he taught Italian literature and Latin but from\n1735\nhe began to study theology. He did this first at San Rocco in Parma, then from\n1735\nto\n1739\nat the Institute of Sant'Ignazio in Rome. He returned to Bologna in\n1739\nwhere he taught mathematics, replacing his former teacher Luigi Marchenti. On\n2\nFebruary\n1741\nhe took vows and continued to teach mathematics in the College of San Francesco Saverio and the College of Santa Lucia for\n30\nyears. Among his best pupils at these Colleges we mention Virgilio Cavina, Jacobi Mariscotti,\nGian Francesco Malfatti\n, Giovanni Antonio Pedevilla, Leopoldo Marco Antonio Caldani, Petronio Maria Caldani and\nPietro Giannini\n. It was\nGian Francesco Malfatti\n, who studied under Riccati in the early\n1750\ns, who became the most famous mathematician from among his pupils but it is worth commenting briefly on some of the others who also made significant contributions.\nVirgilio Cavina\n(1731\n-\n1808)\nwas taught by Riccati beginning in\n1743\nbefore he became a teacher in Brescia. Leaving Brescia he taught mathematics in Parma, corresponding frequently with Vincenzo Riccati as well as his brothers. He moved to Bologna in\n1766\nand published some important mathematical works. Leopoldo Marco Antonio Caldani\n(1725\n-\n1813)\nstudied under Riccati in Bologna but went on to take a medical degree in\n1750\n. Five years later he became professor of practical medicine at Bologna. His brother, Petronio Maria Caldani\n(1735\n-\n1808)\n, also studied with Riccati and went on to become professor of mathematics at Bologna.\nJean Le Rond d'Alembert\ndescribed Petronio Maria Caldani as \"the first geometer and algebraist of Italy\".\nPietro Giannini\nwas a student of Riccati and he strongly influenced\nGiannini\nto publish his first book\nOpuscula Mathematica\n(1773)\n. Shortly after publishing this book,\nGiannini\nwent to Spain and was appointed as a professor in Segovia.\nVincenzo continued his father's work on integration and\ndifferential equations but Giorgio Bagni notes differences in their approach in\n[\n3\n]\n:-\nFrom a first comparison between the works of Vincenzo Riccati and those of his father Jacopo, some differences between the scientific character of the two scholars clearly emerges: compare the versatile style, typically encyclopedic, of Jacopo, with Vincenzo's interests which appear to be concentrated on mathematical science and physics. Vincenzo's favorite field of research is analysis, in particular setting out the analytical treatment of mechanical problems, conducted by solving differential equations, properly constructed.\nVincenzo gave a collection of methods to solve certain specific types of differential equations in his memoir\nDe usu motus tractorii in constructione Aequationum Differentialium Commentarius\n(1752)\n. Here he notes new approaches by\nEuler\nand these influence him in finding a new method for solving differential equations. However, his method makes use of a physical model, a process that is not in\nEuler\n's work. Dominique Tournès gives this assessment of the memoir in\n[\n8\n]\n:-\nFrom a theoretical point of view, 'De usu motus tractorii' is the culmination of the old way of geometrically solving problems by the construction of curves. Vincenzo Riccati, somehow, put an end to this trend by showing that one could construct in a simple continuous way all transcendental curves from the differential equations that define them. From the practical point of view, the memoir of\n1752\nprovides a very general theoretical model to explain, in a unified way, how a large number of traditional methods\n(\nthose before\n1750)\nworked and also future methods .... However, the work of Vincenzo Riccati did not bring him fame and has virtually been forgotten. It was clearly little read and little circulated. It probably came too late, at the end of the period of construction of the curves, when geometry has given way to algebra, and when series became the tool of choice to represent the solutions of differential equations. Although original and brilliant, it became immediately obsolete.\nVincenzo studied hyperbolic functions and used them to obtain solutions of\ncubic equations\n. This appears in his two volume book\nOpusculorum ad res physicas et mathematicas pertinentium\n(1757\n-\n1762)\n.  He found the standard addition formulas for hyperbolic functions, their derivatives and their relation to the exponential function.\nJohann Heinrich Lambert\nis often cited as the first to introduce the hyperbolic functions but he did not do so until\n1770\nwhile Vincenzo Riccati's work\n(\nsome joint with Girolamo Saladini\n(1731\n-\n1813))\nwas published between\n1757\nand\n1767\n.\nSaladini, who was a brilliant student of Riccati's, was a co-author with Riccati of the two volume book\nInstitutiones Analyticae\n(\nVol\n1\n,\n1765\n; Vol\n2\n,\n1767)\nwhich contains the formulas for the addition and subtraction of hyperbolic functions as well as other, now standard, formulas analogous to those for the circular functions. They also computed the derivatives of sinh x and cosh x\n[\n1\n]\n:-\nRiccati and Saladini also considered the principle of the substitution of infinitesimals in the 'Institutiones analyticae'\nⓉ\n(\nAnalytical methods\n)\n, together with the application of the series of integral calculus and the rules of integration for certain classes of circular and hyperbolic functions. Their work may thus be considered to be the first extensive treatise on integral calculus .... Although both Newton and Leibniz had recognized that integration and derivation are inverse operations, they had defined the integral of a function as a second function from which the former function is derived; Riccati and Saladini, on the other hand, considered differentiation to be the division of a quantity into its elements and integration to be the addition of these elements and offered examples of direct integrations.\nThis book is considered one of the most important mathematics texts to appear before\nLeonard Euler\npublished\nInstitutiones calculi integralis\nⓉ\n(\nMethods of integral calculus\n)\n(1768\n-\n70)\n. Riccati and Saladini also worked on the 'rose curves' which had been introduced by\nGuido Grandi\n. Another topic they studied was Alhazen\n(\nal-Haytham\n)\n's problem:-\nGiven points A and B find the point C on a circular mirror so that a ray of light from A is reflected at C to B.\nAl-Haytham\nhad a less than satisfactory solution to his own problem,\nChristiaan Huygens\nfound a good solution which Vincenzo Riccati and Saladini simplified and improved.\nRiccati was skilled in hydraulic engineering and carried out flood control projects which saved the regions round Venice and Bologna from flooding\n[\n1\n]\n:-\nRiccati was also skilled in hydraulic engineering and, under government commissions, carried out flood control projects along the Reno, Po, Adige, and Brenta rivers. He was much honored for this work, which saved the Venetian and Bolognan regions from disastrous flooding, and was made one of the first members of the Società dei Quarante.\nAs we have noted, Riccati taught at Jesuit Colleges in Bologna but as the years went by the Jesuit Order came under attack from opponents within the Catholic Church. The Jesuits were suppressed in Portugal in\n1759\n, in France in\n1764\n, then in Spain and the Kingdom of the Two Sicilies in\n1767\n. Attempts to have Pope Clement XIII act against the Jesuits failed but his successor Pope Clement XIV \"suppressed the Society for the good of the church\" in\n1773\n. All the Jesuit schools and colleges in Bologna were closed following the papal brief of\n21\nJuly\n1773\nand all the religious staff given notice to leave the city. Riccati left Bologna and went to Treviso to live with his two brothers\nGiordano\nand Montino who were living in the house which had belonged to their father\nJacopo Riccati\n. In\n1773\n, shortly after he moved to Treviso, Vincenzo Riccati was offered the chair of mathematics at the University of Bologna and, around the same time, he was also offered the chair of mathematics at Pisa. He turned down both offers and, less than two years later, died in Treviso where he was buried next to his father\nJacopo Riccati\n, in the family tomb in the Cathedral."
}