{
  "nome_completo": "Virgil Snyder",
  "nome_curto": "Virgil Snyder",
  "ano_nascimento": "1869",
  "ano_morte": "1950",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Snyder/",
  "lugar_nascimento": "Dixon, Iowa, USA",
  "lugar_morte": "Ithaca, New York, USA",
  "biografia": "Virgil Snyder\n's parents were Ephraim Snyder and Eliza Jane Randall. The Snyder family were originally from Germany having, at that time, the name Schneider. It was Johannes Schneider who emigrated from Germany to the USA in\n1777\n, settling in Pennsylvania. His descendant Ephraim Snyder was a farmer in Iowa while his wife Eliza Jane, from New England but of English-French descent, had been a school teacher. Virgil attended Iowa State College from\n1886\nto\n1889\nbeing awarded his Sc.B. in\n1889\n. He remained at Cornell as a graduate student during\n1890\n-\n92\nand in these years he became a founder member of the Cornell Mathematical Club which held its first meeting on\n24\nJanuary\n1891\n. The aim of the Club was to involve both students and staff in a German style mathematical seminar. The Club encouraged many students to go to Germany to study for their doctorates and Snyder went to Germany in\n1892\nhaving been awarded an Erastus W Brooks fellowship. James Oliver, who had been\nFelix Klein\n's student before returning to Cornell, wrote to\nKlein\n(\nsee for example\n[\n1\n]\n)\n:-\nRemembering your kindness to myself, and the inspiration and enlarged outlook that I got from your lectures, I could think of no one else whose advice and instruction was likely to help\n[\nMr Snyder\n]\nso much. You will find\n[\nhim\n]\nan earnest student and a thoroughly honourable and loyal man. He has made a good record in his works here, and I value him highly, both as a student and as a friend.\nSnyder studied for his doctorate at Göttingen, attending lectures by\nKlein\nand participating in his seminar. He was awarded a doctorate in December\n1894\nfor his dissertation\nÜber die linearen Komplexe der Lie'schen Kugelgeometrie\nwritten under\nKlein\n's supervision. Arthur B Coble writes\n[\n2\n]\n:-\nProfessor Snyder began his work at a time when geometers were exploring the superstructures of their subject, particularly in space and hyperspace. By adding the radius of a sphere to its coefficients,\nLie\nhad defined a sphere by six homogeneous coordinates subject to a non-singular quadratic relation. This situation also occurs with the\nPlücker\nline-coordinates so that the parallel between line geometry in three-space and\nLie\n's \"Kugelgeometrie\" was apparent. Snyder's doctoral dissertation\n(\nGöttingen,\n1895)\nwas concerned with linear complexes of spheres. Of twenty-one papers he published in the next ten years, twelve were concerned with the metric side of this parallel and dealt with annular, tubular, and developable surfaces, their asymptotic lines, and lines of curvature, or with the development of collateral algebra.\nSnyder married Margarete Glesinger on\n28\nDecember\n1894\n; they had two sons Herbert and Norman. He returned to Cornell University as an Instructor in Mathematics in\n1895\n. He was to spend the rest of his career at Cornell, promoted to assistant professor in\n1903\nand then to full professor in\n1910\n. He retired in\n1938\nafter a career which is summed up by\nRaymond Archibald\nin\n[\n5\n]\nas follows:-\nDuring more than forty years at Cornell University, Professor Snyder has devoted himself whole-heartedly, and with high idealism, to improving the teaching of mathematics, to promoting the welfare of his students and guiding them into research, and to carrying on his own original work in the fields of geometry of the line and sphere, configurations of ruled surfaces, and birational transformations.\nAfter retiring from Cornell, Snyder was a Visiting Professor at Brown University in\n1942\n-\n43\nand then a Visiting Professor at Rollins College, Winter Park, Florida in\n1943\n-\n44\n.\nAs to his interest in the teaching of mathematics, mentioned in the above quote, let us give an example by quoting from Snyder's paper\nRelating to the Teaching of Axonometry\npublished in\n1915\nin the\nAmerican Mathematical Monthly\n:-\nAbout ten years ago one of our trustees ... suggested that the department of mathematics introduce a regular course in descriptive geometry as an alternative for those Arts students who ought to have some mathematics, but who found the calculus too difficult or too unattractive to be studied with profit. ... the department gave me the task of working out the course and it has been given every second year since then. This work is not to overlap with the instruction given in descriptive geometry by the technical colleges of the university, but is planned to furnish an insight into the processes and methods of graphical representation of various kinds. As now given the course comprises four chapters: orthogonal projection, plane projection, perspective, and axonometry. The last chapter was given in fifteen lessons and six drawing periods. We took up orthogonal and oblique representation and did considerable reading on military and cavalier projections. Pedagogically the experiment has been interesting. A considerable number of students took the course who were not taking other work in mathematics and a goodly number of them are now taking further courses. My smallest class had six members, and the largest, twenty-eight.\nKaren Parshall and David Rowe write in\n[\n1\n]\nabout Snyder's importance:-\nUp until the\n1920\ns, Snyder's prolific output and his talents as a teacher made him, together with\nFrank Morley\nof Johns  Hopkins, one of the most influential algebraic geometers in the nation.  Together with\nHenry White\n, in fact, Snyder emerged as a principal heir to\nKlein\n's geometric legacy.\nAnother significant contribution by Snyder was his textbooks. He published\n(\nwith James McMahon\n)\nTreatise on Differential Calculus\n(1898)\n,\n(\nwith John I Hutchinson\n)\nDifferential and Integral Calculus\n(1902)\n,\n(\nwith John H Tanner\n)\nPlane and Solid Geometry\n(1911)\n,\n(\nwith John I Hutchinson\n)\nElementary Textbook on the Calculus\n(1912)\n, and\n(\nwith Charles H Sisam\n)\nAnalytic Geometry of Space\n(1914)\n. In a review of this last mentioned textbook, Gordon Bill writes\n[\n2\n]\n:-\nIt is probable that in no branch of elementary mathematics has there been such need of a good, teachable book as in the analytic geometry of space. ... Taken as a whole the book\n[\nby Snyder and Sisam\n]\nis noteworthy for its literary style. It is a delight to read it. Simple, forceful language is employed throughout, the theorems are models of clear expression and, when a paragraph is completed, its connection with the rest of the subject is apparent. We are glad to note that, when the proof of some theorem has been standardised on account of its elegance, the authors have not felt obliged to bring forth an outrageous, new demonstration. The reviewer will never agree that desire for change is sufficient excuse to mangle a natural, tried and beautiful development. The book is arranged so that its contents fall very naturally into materials for two courses, the first eight chapters constituting a course of some thirty-five lessons and the last six one of about fifty lessons. The outstanding feature of the first eight chapters, and to the reviewer the finest thing in the book, is the natural and immediate introduction of certain geometric concepts which most authors seem to feel are better left out of a first course, such concepts as plane coordinates, homogeneous coordinates of points and planes, elements at infinity, imaginary elements, the absolute, circular points and isotropic planes. ... Let me say in conclusion that, with its splendid style, its fine choice and arrangement of material and its pedagogical excellences, I believe this book one of the best contributions to American textbooks made in recent years.\nSnyder was honoured by being elected to the\nAmerican Academy of Arts and Sciences\nin\n1919\n. He was also a member of the German Mathematical Society and the Mantematical Circle of Palermo. He served as an editor of the Bulletin of the\nAmerican Mathematical Society\nfrom\n1903\nto\n1921\n, was a member of the\nAmerican Mathematical Society\nCommittee on Publications\n1907\n-\n1921\nand was Review Editor from\n1938\nuntil his death. He was vice-president of the\nAmerican Mathematical Society\nin\n1916\nand president of the Society from\n1927\nto\n1928\n. He was awarded an honorary degree by the University of Padua in\n1922\n, at the celebrations for the\n700\nth\nanniversary of its foundation. From\n1926\nto\n1929\nhe was a member of the National Research Council. He was the National Research Council and\nInternational Mathematical Union\ndelegate at the International Congress of Mathematicians in Toronto in\n1924\n, in Bologna in\n1928\nand in Zürich in\n1932\n. He was also the United States Government delegate to the International Congress of Mathematicians in Bologna in\n1928\nand in Oslo in\n1936\n. From\n1924\nto\n1934\nhe was chairman of the National Research Council Committee on Rational Transformations and during this time five of his papers appeared under the title\nSelected Topics in Algebraic Geometry\nin the Bulletin No.\n63\n(1928)\nand four papers under the title\nSelected Topics in Algebraic Geometry II. Supplemental Report\nin Bulletin No.\n96\n(1934)\n.\nIn\n[\n5\n]\nArchibald describes his interests outside mathematics as follows:-\n... a lover of travel ... intensely interested in politics ... His favourite recreation is mountain climbing and going on long hikes with Mrs Snyder as companion.\nHe was also a member of the Tennis Club."
}