{
  "nome_completo": "Vladimir Aleksandrovich Marchenko",
  "nome_curto": "Vladimir Aleksandrovich Marchenko",
  "ano_nascimento": "1922",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Marchenko/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": null,
  "biografia": "Vladimir Aleksandrovich Marchenko\n's parents were Olga Fedorovna and Alexander Grigoryevich Marchenko. Alexander Grigoryevich was from a working class background but had a good education at the St Petersburg Academy of Forestry. He worked at the Novoaleksandriia Institute of Agriculture and Forestry in Poland until\n1914\nwhen, due to the outbreak of World War I, it was transferred to Kharkov. He married Olga Fedorovna who was a school teacher from St Petersburg, and they had four children: Irina, Dmitri, Sergei and Vladimir. By the time their youngest son Vladimir was born in\n1922\n, Alexander Grigoryevich was a professor at the Institute in Kharkov. Let us note that Irina went on to become an expert in art history, Dmitri became an engineer, and Sergei studied medicine but was killed in\n1944\nduring World War II. Vladimir Aleksandrovich's childhood was far from easy. In\n1929\n, when he was seven years old, his father was convicted of attempting to prevent massive deforestation which was seen to be necessary to further socialism. Over the next years his father was seldom able to be at home and Alexander Grigoryevich died in\n1940\n. The\n1930\ns were extremely difficult in Kharkov as attempts were made to eradicate Ukrainian culture with arrests and murders of intellectuals.\nDespite the difficulties, Vladimir Aleksandrovich had a good school education learning foreign languages and excelling at chemistry which was his favourite subject. Olga Fedorovna was a great source of strength to the family during these difficult years and her efforts gave all the children an excellent start in life. After graduating from high school in\n1939\n, Vladimir Aleksandrovich entered the Department of Physics in Leningrad University. Although World War II started in September\n1939\nwith the German invasion of Poland, this had little effect in Russia and Ukraine and Marchenko was able to take courses in physics, mechanics and mathematics. His university career progressed well and by the summer of\n1941\nhe had finished two successful years when he returned to his family home in Kharkov for the summer vacation. However, on\n22\nJune\n1941\nthe German armies invaded their former allies pushing rapidly east into Soviet lands. At first their main advance was aimed towards Moscow, but by August they made a strong push in the south deep into Ukraine capturing Kharkov on\n24\nOctober\n1941\n. Marchenko was not called up for military service since he was severely myopic. Little could be done to halt the German advance as their armies approached Kharkov, nor was fleeing a realistic option by this time, so Marchenko remained in Kharkov with his mother, Irina and her daughter, all other members of the family having left earlier. An attempt by the Red Army to retake the city from the Germans failed in May\n1942\n.\nThe German occupation of Kharkov lasted until\n1943\n. During this time of great hardship Marchenko was able to use his expertise in chemistry to good advantage since he was able to manufacture salt and matches which were is very short supply. His mother sold what he made in exchange for basic food and this allowed them to survive. The first liberation of the city in February\n1943\nonly lasted until March\n1943\nwhen again it was captured by the Germans. After the city was finally liberated on\n23\nAugust\n1943\n, Marchenko was able to continue his education which he did in the Mathematics Department of the Physics and Mathematics Faculty of Kharkov University. By this time he had decided that mathematics was the topic he wanted to specialise in and he obtained his first degree from Kharkov University in\n1945\n. Continuing his studies at Kharkov he was awarded his candidates degree\n(\nequivalent to a Ph.D.\n)\n, advised by Naum Samoilovich Landkof who had been a student of\nMikhail Alekseevich Lavrent'ev\n, in January\n1948\nafter defending his thesis\nSummation methods for generalized Fourier series\n. He was appointed as a lecturer at Kharkov University in\n1950\nand he submitted his doctoral thesis\n(\nequivalent to the German\nhabilitation\n)\nSome questions in the theory of one-dimensional linear second-order differential operators\nin\n1951\n. In addition to Landkof, Marchenko was influenced by other Kharkov mathematicians, particularly\nNaum Il'ich Akhiezer\n, an expert on function theory and approximation theory, and\nAleksandr Yakovlevich Povzner\n(1915\n-\n2008)\nwho was the first to apply the technique of transformation operators of\nVolterra\ntype to\nspectral theory\nin\n1948\n.\nMarchenko was appointed onto the staff in\n1950\nand worked at Kharkov University as an assistant professor in the Department of the Theory of Functions. In\n1952\nhe was promoted to professor in the Department of Mathematical Physics. He moved to the Department of Computational Mathematics in\n1959\nwhere he served as head until\n1961\n. In that year Marchenko was appointed to the Physical-Technical Institute of Low Temperature of the\nUkranian Academy of Sciences\n. This Institute in Kharkov had been founded in\n1960\nlargely through the efforts of Boris Ieremievich Verkin\n(1919\n-\n1990)\nwho had been a friend of Marchenko's since they were children growing up in Kharkov. Discussions between Verkin and Marchenko led to the, perhaps surprising yet very successful, decision to create a mathematics department within the Institute and Marchenko was appointed Head of the Department of Mathematical Physics at the Institute. However, he continued to hold his chair at the University.\nWe now look at some of his mathematical contributions\n[\n9\n]\n:-\nMarchenko's scientific interests generally centre around problems in mathematical analysis, the theory of\ndifferential equations\n, and mathematical physics. At the very start of his scientific activity, he obtained fundamental results that had a major influence on the development of mathematics.\nIn the\n1950\ns Marchenko was influenced by ideas of his colleagues\nAkhiezer\nand\nPovzner\n. He obtained important results in approximation theory, in particular his results concern the approximation theory of almost periodic functions. Also in the\n1950\ns he studied the asymptotic behaviour of the spectral measure and of the spectral function for the\nSturm\n-\nLiouville\nequation. In\n[\n12\n]\nthis work is described as follows:-\nHe is well known for his original results in the spectral theory of differential equations, including the discovery of new methods for the study of the asymptotic behaviour of spectral functions and the convergence expansions in terms of eigenfunctions. He also obtained fundamental results in the theory of inverse problems in spectral analysis for the\nSturm\n-\nLiouville\nand more general equations.\nWith great success, Marchenko applied his methods to the\nSchrödinger\nequation. Later Marchenko published monographs on this work:\nSpectral theory of Strum-Liouville operators\n(1972)\n; and\nSturm-Liouville operators and their applications\n(1977)\n. The second of these is essentially a reworked and augmented version of the first. Mamim M Skriganov, reviewing the\n1977\nmonograph writes:-\nThe spectral theory of\nSturm\n-\nLiouville\noperators is a classical domain of analysis, comprising a wide variety of problems at the present time. Besides the basic results on the structure of the spectrum and the eigenfunction expansion of regular and singular\nSturm\n-\nLiouville\nproblems, it is in this domain that one-dimensional quantum scattering theory, inverse spectral problems and, of course, the surprising connections of the theory with nonlinear evolution equations first become related. The goal of the monograph under review is to present these questions from a unified point of view, namely from the point of view of applying the technique of transformation operators of\nVolterra\ntype. ... The monograph is carefully written, with attention paid to complete details in the proofs. Each chapter contains numerous problems that supplement the basic text. All this makes the book eminently suitable both as a textbook and as a reference work for the specialist.\nEarlier, in collaboration with Z S Agranovich, he had written\nThe inverse problem of scattering theory\nwhich appeared in English translation in\n1963\n. Paul Roman writes:-\nProblems where it is required to ascertain the spectral data which determine a differential operator uniquely, and where a method is sought for constructing this operator from the data, are usually called \"the inverse problem\" of spectral theory. Probably the most important class of such problems is the inverse problem of scattering theory. The present monograph discusses in detail the particular methods developed previously by the same authors to deal with the inverse scattering problem. ... This book is one on pure mathematics and not on physics as such. However, in view of the lucid presentation and excellent pedagogical approach, this volume may be used with great advantage by any theoretical physicist. Incidentally, quite apart from the principal topic, various methods of functional analysis and algebra which are used should also be of great interest to both pure and applied mathematicians.\nThe periodic case of the\nKorteweg\n-\nde Vries\nequation was solved by Marchenko in\n1972\n. He used the method of the inverse problem in the theory of dissipation.\nVolodymyr Petryshyn\nin\n[\n12\n]\ndescribes other work of Marchenko including his work on self adjoint differential operators:-\nMarchenko made significant contributions to the theory of self-adjoint differential operators with infinitely many independent variables and also to the theory of spaces of functions of infinitely many variables as inductive limits of locally convex function spaces.\nIn addition to the important monographs mentioned above, other major texts written by Marchenko include\nNonlinear equations and operator algebras\n(1986)\n. He writes in the Preface to this book:-\nWe systematically present a method for solving some physically important nonlinear equations that is based on the replacement of a given equation by an equation of the same form with respect to functions that take values in an arbitrary operator algebra. The solution of an operator equation in the form of a travelling wave\n(\na one-soliton solution\n)\nis elementary. The solutions of the original equation are obtained from the one-soliton operator solutions by bordering them with special finite-dimensional projectors. Arbitrariness in the choice of the operator algebra and the bordering projectors allows us to find broad classes of solutions of the\nKorteweg\n-\nde Vries\n, Kadomtsev-Petviashvili, nonlinear\nSchrödinger\n, sine-Gordon, Toda lattice, Langmuir and other equations. In these classes solutions are contained that can be obtained by the inverse problem method and by the methods of algebraic geometry, and also solutions that do not reduce to these methods.\nIn\n1992\nMarchenko's monograph\nOrthogonal functions of a discrete argument and their application in geophysics\nwas published and in\n2005\n, in collaboration with\nEvgeni Yakovlevich Khruslov\n, he wrote\nHomogenization of partial differential equations\n.\nIn addition to his mathematical research we must mention his service as an editor of several journals: he was editor-in-chief of\nThe theory of functions, functional analysis, and their applications\nfor nearly thirty years; an honorary editor of\nMathematical Physics, Analysis, Geometry\n; an editor of the\nProceedings of the Ukrainian Academy of Sciences\n; and an editor of\nInverse Problems\n. The authors of\n[\n7\n]\ncomment on his skills as a teacher:-\nFor several years Marchenko has been engaged in teaching at Kharkov University. He devotes much effort and energy to this work, and his influence on whole generations of Kharkov mathematicians would be hard to overestimate. The characteristics of Vladimir Aleksandrovich's pedagogic activities are a high academic standard and a continuing quest for new methods of instruction. There are several dozen Ph.D's and Doctors of Science among his students.\nMarchenko has received numerous honours. In\n1961\nhe was elected a corresponding member of the\nUkrainian Academy of Sciences\n, and in\n1969\nhe was elected a full member. In\n1987\nhe was elected to the\nUSSR Academy of Sciences\n. He was awarded the Lenin Prize in\n1962\nfor his series of papers on inverse problems of spectral analysis. He has also been awarded the\nN M Krylov\nPrize in\n1980\n, the State Prize of the USSR in\n1989\n, and the\nN N Bogolyubov\nPrize in\n1996\n. In\n1992\nhe was awarded the title \"Honoured scientist and technologist of the Ukraine\". In\n1997\nhe was awarded an honorary doctorate by the Sorbonne in Paris. He was elected a member of the\nNorwegian Academy of Science and Letters\nin\n2001\nand the following year he was awarded the Ukrainian Order of Yaroslav Mudryi. He has served as president of the Kharkov Mathematical Society for a number of years.\nOutside mathematics, Marchenko is married with a son and a daughter. He has had many hobbies such as skiing, kayaking and stamp collecting. The authors of\n[\n3\n]\ngive the following tribute:-\nThe breadth of Marchenko's scientific interests and erudition, his limitless dedication to science, high demands on himself, constant attention to students and colleagues, kind-heartedness and readiness to give any amount of help are well known to all who have had the good fortune to meet and work with him."
}