{
  "nome_completo": "Wang Xiaotong",
  "nome_curto": "Wang Xiaotong",
  "ano_nascimento": "580",
  "ano_morte": "640",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wang_Xiaotong/",
  "lugar_nascimento": null,
  "lugar_morte": "Chian",
  "biografia": "Wang Xiaotong\nis also known as\nWang Hs'iao-t'ung.\nHe lived the early part of his life under the Sui dynasty\n(581\n-\n618)\n. Although it was only a short-lived dynasty, during these years the north and south of China were unified. Wang is famed as the author of the\nJigu suanjing\n(\nContinuation of Ancient Mathematics\n)\none of\nThe Ten Classics\n. He presented his treatise to the Emperor of China, Li Yuan the first emperor of the T'ang dynasty, who came to power in\n618\n. Li Yuan, who had been an official in the Sui dynasty, did not control the whole country at first. He had full control of the eastern part by\n621\nand of the north and south as well by\n624\n. We know a little about Wang Xiaotong's life because when he presented his treatise to Emperor Li Yuan he gave the emperor a brief biography at the same time. This biography has survived, becoming attached to the treatise.\nWang Xiaotong's biography tells us that he became interested in mathematics at a young age. He made a careful study of the\nNine Chapters on the Mathematical Art\nand was particularly impressed with the commentary on that text written by\nLiu Hui\n. Wang went on to become a teacher of mathematics, and later he was appointed as deputy director of the Astronomical Bureau.\nIt was known that the Chinese calendar at that time was in need of reform since, although only in operation for a few years, already predictions of eclipses were getting out of step. In\n623\nWang and Zu Xiaosun, a Civil Servant, were given the task of reporting on the problems with the calendar and making recommendations. There was disagreement between Wang and another calendar expert Fu Renjun about certain aspects of the calendar and in fact Wang's ideas were not particularly good since he wished to ignore the irregularity of the sun's motion and he also wanted to ignore the precession of the equinoxes which had first been incorporated in calendar calculations by\nZu Chongzhi\nin the fifth century.\nOne might ask why we have included Wang in this archive when his achievements on calendar reform seem retrograde. Well, he has not been included for this work but rather for the remarkable contribution he made to Chinese mathematics in the\nJigu suanjing\n(\nContinuation of Ancient Mathematics\n)\n. The book contains\n20\nproblems. The first is a pursuit problem of a dog chasing a hare, but Wang tells us that this is really a problem about movements of astronomical bodies. The next\n13\nproblems concern engineering constructions and the volume of granaries. The final six problems concern right angled triangles.\nThe important innovation which is incorporated in most of these problems is that they reduce to a cubic equation which Wang solves numerically. We do not know of any earlier Chinese work on cubic equations. Of course one has to understand that when we say that the text is concerned with cubic equations, we do not see expressions with\nx\n,\nx\n2\nx, x^{2}\nx\n,\nx\n2\nand\nx\n3\nx^{3}\nx\n3\nin them. Rather the equations are expressed in words and Wang thinks in a geometrical way. For example where we might say \"Let the height be\nx\nx\nx\n\" and then produce an equation in\nx\nx\nx\n, Wang writes:-\nLet the height be the side of a cube.\nHe then goes on to set up a cubic equation for the height. Again he will write:-\nLet the depth be the side of a cube\nwhen he is about to set up a cubic equation for the depth. It is interesting to compare this geometrical way of thinking about cubics with that of\nCardan\n900\nyears later. Many see this work by Wang as the first steps towards the \"tian yuan\" or \"coefficient array method\" or \"method of the celestial unknown\" of\nLi Zhi\n. For example\nRuan Yuan\nwrites in his\nBiographies of astronomers and mathematicians\n(1799)\n(\nsee\n[\n5\n]\n)\n:-\nReally his work is the true source of the later \"tian yuan\" method.\nMikami writes\n[\n3\n]\n:-\nIn setting up cubic equations Wang Xiaotong utilised a rule which is the same as the \"tian yuan\". Thus the rule is new in form, but, in fact, it is the continuation of the ancient style handed down from earlier generations.\nThe problems in the\nJigu suanjing\n(\nContinuation of Ancient Mathematics\n)\nare stated in a very complicated form. Here is a flavour of the style with a translation of Problem\n3\nas given in\n[\n1\n]\n:-\nSuppose that a dyke is to be built. The difference between the lower and upper widths of the west face is\n6\nzhang\n8\nchi\n2\ncun ..., the height of the east face is\n3\nzhang\n1\nchi less than the height of the west face .... Sub-prefecture A gives\n6724\nmen, sub-prefecture B gives\n16677\nmen ... Each man of the four sub-prefectures excavates\n9\ndan\n9\ndou\n2\nsheng of earth per day and packs down on average\n11\nchi\n4\ncun and\n6\n/\n12\ncun per day ... Previously a man was able to cover a horizontal road of length\n192\nbu\n62\ntimes per day carrying\n2\ndou\n4\nsheng and\n8\nhe of earth on his back. But now, it is necessary to climb a hill and cross a watercourse in order to fetch the earth. A climb of\n3\nbu is equivalent to\n4\nbu of a flat road,\n1\nbu for a ford is equivalent to\n2\nbu for a flat road, ... What is the daily task of a man who digs, transports and constructs; what are the heights and the upper and lower widths of the dyke ...\nIf we strip away some of the complications then we are left with workers from four countries,\nA\n,\nB\n,\nC\n,\nA, B, C,\nA\n,\nB\n,\nC\n,\nand\nD\nD\nD\nwho cooperate to build a dyke. The east and west ends of the dyke are trapezoidal. The length, upper width, lower widths of the east and west ends and the height of the west end are all known as functions of the height\nx\nx\nx\nof the east end. This allows the volume to be calculated as a function of\nx\nx\nx\n. Data given for the work done by the workers allows the volume to be calculated, and a cubic equation is arrived at for\nx\nx\nx\n.\nTo be able to solve this problem Wang has not only to be able to set up a cubic equation and solve it, but he also needs to know a formula for the volume of his dyke with trapezoidal ends and varying cross-section. One of Wang's achievements was calculating this formula and in the preface to the treatise he gives a reference to ideas which had led him to the volume formula\n(\nsee for example\n[\n6\n]\n)\n:-\nPeople much appreciated\nZu Geng\n's Appended Rules. It is a pity Zu did not clearly explain the problems on the frustum. Here I give alternative methods for extending them.\nNote that\nZu Geng\nwas\nZu Chongzhi\n's son.\nLet us now look at the problems on right angled triangles, namely problems\n15\nto\n20\ninclusive. We use letters to name the sides of the right angled triangle where Wang uses names:-\nProblem\n15\n: Let a right angled triangle have sides a, b, c where c is the hypotenuse. If a times b is seven hundred and six and one fiftieth, and if c is thirty six and nine tenths more than a. What are the values of the three sides.\nSuppose we forget the numbers for a moment and look at the data we are given. We know\na\nb\n,\nc\n−\na\nab, c - a\na\nb\n,\nc\n−\na\nand of course that\na\n2\n+\nb\n2\n=\nc\n2\na^{2} + b^{2} = c^{2}\na\n2\n+\nb\n2\n=\nc\n2\nby the Gougu rule\n(\nPythagoras\n)\n. Wang calls\na\na\na\nthe unknown and finds a cubic equation in terms of\na\na\na\n. Let us see how this can be done\n(\nwe do not know exactly how Wang reasoned\n)\n.\n(\na\nb\n)\n2\n=\na\n2\nb\n2\n=\na\n2\n(\nc\n2\n−\na\n2\n)\n=\na\n2\n(\nc\n−\na\n)\n(\nc\n+\na\n)\n(ab)^{2} = a^{2}b^{2} = a^{2}(c^{2}- a^{2}) = a^{2}(c - a)(c + a)\n(\na\nb\n)\n2\n=\na\n2\nb\n2\n=\na\n2\n(\nc\n2\n−\na\n2\n)\n=\na\n2\n(\nc\n−\na\n)\n(\nc\n+\na\n)\nHence, dividing by\n2\n(\nc\n−\na\n)\n2(c - a)\n2\n(\nc\n−\na\n)\nwe get\n1\n2\n(\na\nb\n)\n2\n(\nc\n−\na\n)\n=\n1\n2\na\n2\n(\nc\n+\na\n)\n=\na\n2\n(\n2\na\n+\n1\n2\n(\nc\n−\na\n)\n)\n=\na\n2\n(\na\n+\n1\n2\n(\nc\n−\na\n)\n)\n=\na\n3\n+\n1\n2\na\n2\n(\nc\n−\na\n)\n\\large\\frac{1}{2}\\normalsize (ab)^{2}(c - a) = \\large\\frac{1}{2}\\normalsize a^{2}(c + a) = a^{2}(2a + \\large\\frac{1}{2}\\normalsize (c - a)) = a^{2}(a + \\large\\frac{1}{2}\\normalsize (c - a)) = a^{3} + \\large\\frac{1}{2}\\normalsize a^{2}(c - a)\n2\n1\n​\n(\na\nb\n)\n2\n(\nc\n−\na\n)\n=\n2\n1\n​\na\n2\n(\nc\n+\na\n)\n=\na\n2\n(\n2\na\n+\n2\n1\n​\n(\nc\n−\na\n)\n)\n=\na\n2\n(\na\n+\n2\n1\n​\n(\nc\n−\na\n)\n)\n=\na\n3\n+\n2\n1\n​\na\n2\n(\nc\n−\na\n)\n.\nWriting\nx\nx\nx\nfor the unknown\na\na\na\n, we have the cubic equation\nx\n3\n+\n1\n2\nx\n2\n(\nc\n−\na\n)\n=\n(\na\nb\n)\n2\n2\n(\nc\n−\na\n)\nx^{3} + \\large\\frac{1}{2}\\normalsize x^{2}(c - a)\\normalsize =  \\Large\\frac{(ab)^{2}}{2(c-a)}\nx\n3\n+\n2\n1\n​\nx\n2\n(\nc\n−\na\n)\n=\n2\n(\nc\n−\na\n)\n(\na\nb\n)\n2\n​\nand we know\na\nb\nab\na\nb\nand\nc\n−\na\nc - a\nc\n−\na\nso the coefficients are known. Isn't that clever! Remember that Wang did not have our symbolic notation which makes the whole process so much easier today.\nOther problems here are of the same type. In Problem\n17\nwe are given\nb\nc\nbc\nb\nc\nand\na\n+\nb\na + b\na\n+\nb\n, while in Problem\n19\nwe are given\nb\nc\nbc\nb\nc\nand\na\na\na\n. Try to set up the necessary equations in these two cases in a similar way to our solution to Problem\n15\nabove.\nIn\n656\n, after editing by\nLi Chunfeng\n, the treatise\nJigu suanjing\n(\nContinuation of Ancient Mathematics\n)\nbecame a text for the Imperial examinations and it became one of\nThe Ten Classics\nwhen reprinted in\n1084\n. Not only did Wang's work influence later Chinese mathematicians, but it is said that it was his ideas on cubic equations which\nFibonacci\nlearnt, probably first transmitted into the Islamic/Arabic world, and then brought to Europe."
}