{
  "nome_completo": "Gottfried Wilhelm Flügge",
  "nome_curto": "Wilhelm Flügge",
  "ano_nascimento": "1904",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flugge/",
  "lugar_nascimento": "Greiz, Thuringia, Germany",
  "lugar_morte": "Los Altos, California, USA",
  "biografia": "Wilhelm Flügge\n's father, also named Wilhelm Flügge, was a minister in the Protestant church. Wilhelm had a younger brother Siegfried Flügge\n(1912\n-\n1997)\n. Let us record at this point that Siegfried obtained a doctorate in theoretical physics from the University of Göttingen in\n1933\nwhere he was advised by Max Born. In\n1910\nthe Flügges' father took the family to Dresden when he became a minister in a church there. Wilhelm attended a\nGymnasium\nin Dresden, graduating in\n1921\n. In the same year he entered the Technische Hochschule Dresden, renamed the Dresden University of Technology in\n1961\n, graduating in\n1925\nwith a Diploma in Civil Engineering. Then he was the appointed as an assistant to Kurt Beyer while he undertook research for his doctorate.\nKurt Beyer\n(1881\n-\n1952)\n, who had been a student at the Technische Hochschule Dresden, was an expert on applying mathematics to reinforced concrete. He had been appointed as the Professor of the Statics of Structures and Applied Mechanics at the Technische Hochschule Dresden in\n1919\n. During the years that Flügge was his student, Beyer was working on his most important work\nDie Statik im Eisenbetonbau\nⓉ\n(\nStatics in reinforced concrete construction\n)\n(1927)\n. Flügge graduated with his doctorate in\n1927\nand then worked in the construction industry for Dyckerhoff & Widmann. This firm, founded in\n1865\nby Wilhelm Gustav Dyckerhoff\n(1805\n-\n1894)\nin Karlsruhe, made concrete components. They were highly innovative and in the\n1920\ns they developed a concrete shell construction system. It was on this system that Flügge worked during his three years with the company at their Leipzig and Wiesbaden factories. We note that the firm was later awarded the Edward Longstreth Medal by the Franklin Institute for this thin shell concrete structure.\nFlügge left Dyckerhoff & Widmann in\n1930\nwhen he was appointed to a post-doctoral position at the University of Göttingen. At the Aerodynamics Research Institute in Göttingen he met Irmgard Lotz\n(\nFlügge-Lotz\nafter her marriage\n)\nwho had recently been appointed as a Junior Research Engineer in\nLudwig Prandtl\n's research group. Flügge was soon made aware of the difficulties that Lotz had in a male dominated team:-\n... the position of a female in the world of science and engineering was difficult. Wilhelm has told of the secretary who served tea to the group at the weekly conference, but refused to serve Irmgard: \"\nShe\ncan make her own tea.\"\nIn\n1932\nFlügge submitted his\nhabilitation\nthesis and became a\nprivatdozent\nat the University of Göttingen. In the following year he was one of the founders of the important journal\nZentralblatt für Mechanik\n. He published\nStatik und Dynamik der Schalen\nⓉ\n(\nStatics and dynamics of shells\n)\nin\n1934\n. A review of the German text states:-\n... the book deals to a considerable extent with linear membrane theory of shells of revolution, with the linear theory of circular cylindrical shells and with linear bending theory for symmetrical deformations of shells of revolution. Some consideration is given to classical elastic stability theory of circular cylindrical shells and spherical shells and to vibrations of shells.\nThis classic book was translated into English and appeared under the title\nStresses in shells\nin\n1960\n. Eric Reissner\n(1913\n-\n1996)\nwrites in a review of the English edition:-\nAbout two hundred pages of this book are devoted to linear membrane theory\n(\nwhich is that aspect of shell theory where bending moments and transverse shear forces, as well as non-linear effects, are assumed negligible. For many problems this is a practically adequate assumption.\n)\nThe treatment here is quite thorough and comprehensive, except concerning the nature of appropriate boundary conditions in problems where this represents a significant question\n(\nas for instance in the problem of unsymmetrical deformations of spherical shells\n)\n. About one hundred pages are concerned with bending theory of circular cylindrical shells. Unsymmetrical deformations are analysed to a considerable extent by means of the author's own system of basic equations. Another one hundred pages cover the subject of linear-theory bending of shells of revolution. This includes the classical material on symmetrical bending and edge effects associated with the names of Hans Reissner\n[(1874\n-\n1967)\n, Eric Reissner's father\n]\n, E Meissner and J W Geckeler\nThe five years from\n1933\nto\n1938\nwere difficult ones for both Flügge and Lotz in Göttingen as the Nazi policies had a major affect on the staff. Flügge was branded \"politically unreliable\" and realised that his chance of an academic career had vanished. Someone who was \"politically unreliable\" stood no chance of a professorship. However, as Flügge and Lotz prepared to marry, Lotz's career had progressed well for she had continued research at the Aerodynamics Research Institute making major advances in techniques to predict the aerodynamic pressure on various parts of a plane such as its body, wings, and turbine blades. By\n1938\nshe had been appointed Head of the Department of Theoretical Aerodynamics. In\n1938\nIrmgard Lotz and Wilhelm Flügge were married, and in the following year they moved to Berlin where Flügge was appointed to the Deutschland Versuchsanstalt Luftfahrt. It seems that the benefits to the German air force of his expertise outweighed the fact that he was considered \"politically unreliable\". At the start of World War II in\n1939\n, Berlin was a relatively safe place for the Deutschland Versuchsanstalt Luftfahrt to be sited but, as the war progressed, Berlin came under increasingly heavy bombing raids from the allies\n[\n2\n]\n:-\nIn the spring of\n1944\n, the destruction of Berlin had progressed so far that Wilhelm and Irmgard moved with their departments to Saulgau, a little town in the hills of southern Germany. After the end of the war, Saulgau was in the French zone of occupation. The French aeronautical establishment was resurrected after the war on an enlarged scale and was eager to take in the German intelligentsia. In\n1947\nWilhelm Flügge and\nIrmgard Flügge-Lotz\nmoved with many of their co-workers to Paris, to become part of the Office National d'Études et de Recherches Aéronautiques.\nAlthough Flügge and his wife were happy living in Paris, the positions both of them held there in the Office National d'Études et de Recherches Aéronautiques gave them little hope of progressing in their careers. They wrote to Stephen Timoshenko enquiring about the possibility of working in the United States and, in\n1948\n, both received offers of posts at Stanford University which they quickly accepted\n[\n5\n]\n:-\nTimoshenko deserves the credit for bringing mathematical analysis into engineering practice, certainly in the area of structures. He realized the advantage of bringing Wilhelm Flügge to strengthen the work in applied mechanics at Stanford.\nHowever, Stanford University had a policy that a husband and wife could not both have a professorial role in the same Department. With Wilhelm Flügge being appointed as a professor, this meant that, despite\nFlügge-Lotz\n's eminence in research, she had to accept a lowly position of \"lecturer\".\nWhile at Stanford, Flügge published a number of important books. We have already mentioned the English translation of his\n1934\nGerman text as\nStresses in shells\n(1960)\n. Before this, he published\nFour-place tables of transcendental functions\nin\n1954\n. After the English translation of his German text, there followed\nStatique et dynamique des coques\nⓉ\n(\nStatics and dynamics of shells\n)\n(1960)\n,\nViscoelasticity\n(1967)\n, and\nTensor analysis and continuum mechanics\n(1972)\n. A review of this last mentioned book states:-\nAs is implied by the title, this is an account of tensor analysis written with continuum mechanics in mind. Indeed, the mathematics and mechanics are so intertwined that each new mathematical concept is immediately applied. The treatment is detailed but concise, so that in barely\n200\npages the reader is taken from elementary vector analysis to the research level.\nFlügge also edited\nHandbook of engineering mechanics\n(1962)\n, an excellent reference book with many authors. The last of his books was published in\n1975\nafter he had retired and one year after the death of his wife. However he continued to live as he had before\n[\n5\n]\n:-\n... occasionally inviting guests for evening tea and on rarer occasions preparing an elaborate meal for guests. The spirit of Irmgard was always present. ...\n[\nLater\n]\nhe devoted his attention to his hobbies of photography, bird watching, a cactus collection, and travelling. Many will remember the unique Christmas cards he would prepare, featuring an interesting angle photograph of his latest little creation, such as a quizzical owl from a pine cone.\nHis outstanding contributions led to him receiving a number of awards. He held a Fulbright Scholarship during the\n1966\n-\n67\nacademic year and in\n1970\nwas awarded the\nTheodore von Kármán\nMedal by the American Society of Civil Engineers. He also received the Worcester Reed Warner Medal from the American Society of Mechanical Engineers\n[\n5\n]\n:-\nIt seems to be no coincidence that he died on the day after his\n86\nth\nbirthday. On that day his driver's license expired and could not be renewed because of failing eyesight, as well as failing strength. He simply was not willing to yield the home he had shared with Irmgard nor his independence. His departure marks the end of an era."
}