{
  "nome_completo": "Wilhelm Süss",
  "nome_curto": "Wilhelm Süss",
  "ano_nascimento": "1895",
  "ano_morte": "1958",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suss/",
  "lugar_nascimento": "Frankfurt am Main, Germany",
  "lugar_morte": "Freiburg im Breisgau, Germany",
  "biografia": "Wilhelm Süss\n's mother came from a leading family, several members of which had become local mayors. Wilhelm's father was a school teacher and came from a musical family including professional musicians. Wilhelm inherited their love and talents for music. At his high school Wilhelm excelled in all his subjects and he had quite a difficult decision to make when entering university as to which subject he would study. He chose mathematics and entered Freiburg University where he was taught by\nAlfred Loewy\n.\nIt was the custom that students in Germany at this time did not remain at one university for their studies, but sampled the lectures at a number of different universities. Süss moved from Freiburg to Göttingen and then to Frankfurt, but before he could complete his studies World War I began and Süss was drafted into the army in October\n1915\n. He fought on the front lines and was lucky to survive, contracting malaria from which he recovered in eight weeks. For a while he served as a veterinary assistant\n(\ndue to an error in the information which the army held on his qualifications\n)\nbut later he used his mathematical skills with a sound-ranging group. After three years of continuous service the war ended and he was demobilised in November\n1918\n.\nHe returned to Frankfurt to complete his studies after this three year break, where his research in geometry was supervised by\nBieberbach\n. Süss submitted his thesis\nBegründung der Inhaltslehre im Raum ohne Benutzung von Stetigkeitsaxiomen\nⓉ\n(\nJustification of the inclusion rule in space without the use of continuity axioms\n)\nto Frankfurt in March\n1920\n. At this time Süss met Irmgard Deckert, a mathematics student at the University and the daughter of a lecturer in geography. Later they married and we note that\n[\n13\n]\nand\n[\n14\n]\nare written by Irmgard Süss. In\n1921\nBieberbach\nmoved from Frankfurt to the University of Berlin where he was appointed to the chair of geometry. Süss moved from Frankfurt to Berlin to become\nBieberbach\n's assistant but seems to have spent more time working for the\nGerman Mathematical Society\nthan for\nBieberbach\n.\nIn January\n1923\nSüss accepted a position in Kagoshima, Japan and began his new job in March. It was not really a mathematical job but rather saw Süss using his skills in German language and literature. He certainly did not abandon mathematics despite it not being part of his day to day work, and continued to undertake research which he published. After five years in Japan, Süss corresponded with Karl Reinhardt who was professor at Greifswald. The two had known each other from their childhood and the exchange of letters led to Reinhardt telling Süss that if he submitted his papers to Greifswald he could\nhabilitate\nthere and obtain a position. Süss accepted the idea and returned from Japan in\n1928\nto take up the lecturing post at Greifswald.\nHellmuth Kneser\n, the son of\nAdolf Kneser\n, had been appointed as professor at Greifswald three years before Süss came onto the staff there. The two soon became lifelong friends. This was a difficult time in Germany and Süss soon felt that the country was suffering unfairly. Although this led to him being a German Nationalist, he was certainly not a supporter of the National Socialist party at this time. His later associations with the Nazis is still a matter of considerable controversy among historians. For example Remmert\n(\nsee\n[\n10\n]\nand\n[\n11\n]\n)\nis highly critical of the way that Süss worked with the Nazis, while Segal\n(\nsee\n[\n1\n]\n)\ntakes the view that Süss only cooperated with the Nazis as far as was necessary to protect mathematics. Supporters of each view can point to evidence to support their case and it is doubtful whether it will ever be possible to clarify Süss's motives.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany. In March all the teaching staff at Greifswald were forced to join the Sturmabteilung\n(\nStormtroopers\n)\n. Exemption was given to those who were members of the Stahlhelm, a veteran's organisation, so Süss joined the Stahlhelm. However on\n3\nJuly members of the Stahlhelm automatically became members of the Stormtroopers. In\n1934\nAlfred Loewy\n, Süss's former teacher, was dismissed from his chair at the University of Freiburg under the Nazi legislation dismissing Jews. Süss negotiated with the Ministry about succeeding\nLoewy\nand was appointed to the chair at Freiburg. According to Irmgard Süss, he began his discussions with the Ministry but making it clear that he was not a member of the Nazi party. At Freiburg Süss became a colleague of\nDoetsch\nand until\n1940\nthe two were joint mathematical leaders of the university.\nThe\nGerman Mathematical Society\nbecame embroiled in political manoeuvrings after the National Socialists came to power.\nBieberbach\nwas unsuccessful in his attempt to become Chairman of the Society for life in\n1934\n. After\nBlaschke\nand\nHamel\nhad served as Chairman, Süss was appointed in\n1937\n. Some see his chairmanship as saving the\nGerman Mathematical Society\n, while others see it as a period when Süss enthusiastically cooperated with the National Socialists. Süss certainly initiated the expulsion of Jews from editorial boards, specifically asking that\nIssai Schur\nbe removed from the board of\nMathematische Zeitschrift\nin\n1938\n. He joined the Nazi party in\n1938\n(\nSegal\n[\n1\n]\nclaims he resisted but was persuaded by colleagues that he could act more effectively to change Nazi policies from within the party\n)\n. He actively participated in the expulsion of non-Aryan\nGerman Mathematical Society\nmembers in\n1938\nand\n1939\nwhich led to the\nGerman Mathematical Society\nbeing successful in dealing with Nazi government officials. There is no doubt that during his period as Chairman, from\n1938\nto\n1945\n, Süss worked in close collaboration with Nazi government officials. Among those who defend Süss's actions are Hildegard Abetz, Süss's daughter, and her husband\n[\nsee P Abetz and H Abetz,\nMitt. Dtsch. Math.-Ver\n.\n(4)\n1999\n,\n53]\n. They emphasise that things in the Third Reich were much more subtle than people who condemn Süss realise.\nToday Süss is remembered as the creator of the Oberwolfach Mathematical Institute. In\n[\n14\n]\nIrmgard Süss writes that Süss had the idea for a Mathematical Institute for some time and felt that it should be based at Göttingen.\nHasse\nwrote to Süss on\n24\nMarch\n1944\nsuggesting he leave Freiburg and move to Göttingen. However Freiburg were keen to keep Süss who was at that time the most important figure in mathematical politics in Germany. Süss wrote\n(\nsee\n[\n1\n]\n)\n:-\nThe Ministry of Education of Baden, wanting to keep me in Freiburg at least in the present difficult situation, has offered me a place of rare advantages in the Black Forrest where I hope to start the most urgent work without delay and undisturbed.\nOn\n3\nAugust\n1944\nHermann Göring authorised the creation of the Mathematisches Forschungsinstitut Oberwolfach in a hunting lodge known as Lorenzenhof\n(\nnamed after the farm that it replaced\n)\nin the tiny village of Oberwolfach-Walke in the Black Forest. Jackson writes\n[\n5\n]\n:-\nOf all the world's mathematics institutes the Mathematisches Forschungsinstitut Oberwolfach is certainly one of the most beloved. Traditionally referred to simply as Oberwolfach ... the institute is perched on a hillside in a lovely valley of Germany's Black Forest.\nThere is no doubt that the creation of the Institute was agreed because the Nazis believed that mathematics was of military importance to Germany. Süss was not only the founded of the Institute but he became its first director. Senechal writes in\n[\n12\n]\n:-\nSüss was Oberwolfach and Oberwolfach was Süss.\nHe took his family to Oberwolfach and together with mathematicians from military establishments and colleagues from Freiburg, including\nBehnke\nand\nSeifert\n, they made up a team of about twenty who lived there until the war ended\n[\n5\n]\n:-\nIrmgard Süss's history tells a tale of courage and camaraderie in those final days; the problem of securing food and heating; the preparations for flight in case the Lorenzenhof was attacked; the eventual occupation of the lodge; and, once the war was officially over, the frantic burning of books on National Socialism that had been stored in the house.\nSüss was suspended from his position at Freiburg at the end of the war. He kept his position as director of Oberwolfach, however. He was a member of the Nazi party who had a close association with party officials, but many letters of support from his colleagues stated that he never held Nazi beliefs and had only joined the party to help the cause of mathematics. Süss too claimed that he had always opposed Nazi policies and that he had supported colleagues suffering under Nazi policies. Letters from colleagues such as\nCarathéodory\n,\nTietze\n,\nHopf\nand\nPerron\ntold of many colleagues whom Süss had saved from political persecution. Süss was reinstated after two months, and Freiburg elected him Rector of the University in\n1958\n. By this time, however, he was ill with liver cancer from which he died shortly afterwards.\nIt was due in large part to Süss's efforts that Oberwolfach flourished after the war ended\n[\n5\n]\n:-\nThe Institute lost its funding from the national government but was able to keep going with a small amount from the state government of Baden. Süss worked hard to make the Institute truly international. Indeed, Oberwolfach played an important role in the rebuilding of mathematics in Germany after the war by serving as a place for meetings between German mathematicians and their colleagues abroad. ...\nFrom\n1949\nto\n1953\nthree to five meetings were held every year; the number increased to about a dozen per year after Süss secured funding from the federal government.\nLet us look at some of the mathematics which Süss produced, in particular examining papers which give results which are rather typical of his mathematical output. In\n1947\nSüss proved the following theorem in\nKennzeichnende Eigenschaften der Kugel als Folgerung eines Brouwerschen Fixpunktsatzes\nⓉ\n(\nCharacteristic properties of the sphere as a consequence of Brouwer's fixed-point theorem\n)\n. Let\nE\nE\nE\nbe a convex body in three-space with the following property: to every direction\ny\ny\ny\ncorresponds a plane normal to\ny\ny\ny\n, depending continuously on\ny\ny\ny\n, and intersecting\nE\nE\nE\nin a region\nB\n(\ny\n)\nB(y)\nB\n(\ny\n)\nsuch that all these regions\nB\n(\ny\n)\nB(y)\nB\n(\ny\n)\nare congruent. Then the regions\nB\n(\ny\n)\nB(y)\nB\n(\ny\n)\nare circles. In\n1950\nhe proved in\nBestimmung einer Fläche durch die dritte Grundform und die Summe der Hauptkrümmungsradien\nⓉ\n(\nDetermination of area by the third fundamental form and the sum of the principal radii of curvature\n)\nthat a surface is uniquely determined if a strip, and\n(\nas functions of the parameters\n)\nthe third fundamental form, i.e., the first fundamental form of the spherical image, and the sum of the principal radii of curvature, is given. In the same year he published\nEichflächenprinzipien in der projektiven Flächentheorie\nⓉ\n(\nCalibration of surface principles in projective theory of surfaces\n)\nwhich aims to put in place the foundations of a general projective theory of surfaces in a manner roughly corresponding to\nBerwald\n's treatment of the Euclidean and affine case but strongly employing the methods of relative\ndifferential geometry\n.\nThe paper\nEine elementare kennzeichnende Eigenschaft des Ellipsoids\nⓉ\n(\nAn elementary distinguishing characteristic of the ellipsoid\n)\n(1953)\nproves in an elementary way that an ovaloid, all of whose orthogonal projections are ellipses, is an ellipsoid. In\n1954\nSüss's paper\nEine characteristische Eigenschaft der Ellipse\nⓉ\n(\nA characteristic property of the ellipse\n)\nproved the following theorem: Let\nM\nM\nM\nbe a set of ovals equivalent to each other under the group of affine transformations, and let\nM\nM\nM\nhave the property that any two of its members meeting in more than four points coincide. Then the ovals in\nM\nM\nM\nare ellipses. We should also mention Süss's work as an editor of\nFundamentals of mathematics\n(\nfirst edition in German in\n1958)\nwhich he worked on with\nBehnke\n, F Bachmann, K Fladt."
}