{
  "nome_completo": "Willem de Sitter",
  "nome_curto": "Willem de Sitter",
  "ano_nascimento": "1872",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sitter/",
  "lugar_nascimento": "Sneek, Netherlands",
  "lugar_morte": "Leiden, Netherlands",
  "biografia": "Willem de Sitter\n's parents were Lamoraal Ulbo de Sitter and Catharine Theodore Wilhelmine Bertling. Lamoraal Ulbo de Sitter was a judge and firmly in the de Sitter family tradition of becoming lawyers. His son Willem was expected to follow the family tradition, but he took a different career path with his love of mathematics and science. Willem attended secondary school in Arnhem, studying at the Arnhem\nGymnasium\n. After graduating from the school, he entered the University of Groningen with the intention of taking a mathematics degree. In addition to his love for mathematics, his enjoyment of physics and carrying out physical experiments grew during his undergraduate years. He obtained permission to assist with experiments being carried out by Hermanus Haga, the professor of physics at the University of Groningen, and as a consequence began to work in the Astronomical Laboratory at Groningen. In the Laboratory Jacobus Kapteyn, the Professor of Astronomy and Theoretical Mechanics, was measuring photographic plates which had been taken by the astronomer David Gill as part of a photographic survey of the southern sky taken at the Cape Town Observatory. Although Kapteyn was the Groningen Professor of Astronomy, he had volunteered to assist in the Astronomical Laboratory since he had no observatory in which to conduct his own observations.\nThe turning point in de Sitter's life came in\n1896\nwhen David Gill visited Kapteyn to discuss progress on the southern sky survey. Entering the Laboratory, Gill saw de Sitter at a measuring machine and the two talked briefly\n[\n15\n]\n. On :-\n... the following morning de Sitter, while having breakfast in his rooms, received a message that Gill wished to speak with him in the laboratory. De Sitter did not possess at that time the fluent command of the English language which he afterwards acquired; Kapteyn was lecturing at the time and Mrs Kapteyn acted as interpreter at the interview. Gill invited de Sitter to come to the Cape as a computer and, as de Sitter afterwards stated in a letter to Gill, \"thereby complete my astronomical education - or rather begin it, for up to that time I had never made a speciality of astronomy and intended to become a mathematician.\"\nDe Sitter consulted his parents, and decided to take their advice and complete his examinations at Groningen before taking up Gill's offer. He received a Bachelor's Degree in\n1897\nand left for Cape Town in the summer of that year arriving in August. He worked at the Cape Observatory in South Africa for two years taking part in photometric and heliometer programmes. It was at Gill's suggestion that de Sitter also worked towards his doctorate studying heliometer observations of Jupiter's moons which had been made by Gill in\n1891\n. After de Sitter returned to Groningen in\n1899\nhe was appointed as an assistant in the Astronomical Laboratory and also continued to work towards his doctorate, advised by Kapteyn. He submitted his thesis\nDiscussion of Heliometer Observations of Jupiter's Satellites\nto the University of Groningen in\n1901\n. Jan Hendrik Oort writes in\n[\n13\n]\n:-\nWith the discussion of Gill's heliometer observations of Jupiter's satellites, de Sitter had entered upon the field which seemed so completely to suit his versatile mind: the talent, on one hand, for seeing clearly through the most intricate mathematical problems and dealing practically with them; on the other hand, the critical insight into the value and limitations of observations - an insight which sprang from a very active interest in observations as well as instruments.\nOn\n6\nDecember\n1898\nde Sitter had married Eleonora Suermondt in Cape Town, South Africa. Eleonora was born in Surabaya, the second largest city in the Dutch East Indies, and she had met de Sitter in the Cape where she was working as a school teacher. Their first child Lamoraal Ulbo was born in Cape Town in September\n1899\nbut sadly died on\n10\nJanuary\n1901\nafter the family had returned to Groningen. Their other children were: Theodora born on\n28\nSeptember\n1900\nin Groningen; Lamoraal Ulbo born on\n6\nMarch\n1902\nin 's-Gravenhage; Aernout born on\n5\nApril\n1905\nin Groningen; and Agnes born\n14\nMay\n1908\nin Groningen. Let us record a few details of the lives of two of these children at this point. Lamoraal Ulbo de Sitter became well-known as a structural geologist and died in Nistelrode in\n1980\n. Aernout de Sitter served as director of the Bosscha Observatory in Lembang, Dutch East Indies. After the Japanese invasion of the Dutch East Indies he was arrested and put into a detention camp where he died on\n5\nSeptember\n1944\n.\nHendricus Gerardus van de Sande Bakhuyzen had been Professor of Astronomy and Director of the University Observatory at the University of Leiden from his appointment in\n1872\n. He retired in\n1908\nand his duties were split into two, with the chair of astronomy being separated from the directorship of the Observatory. De Sitter was appointed to the chair of astronomy while Ernest-Frederich van de Sande Bakhuyzen, H G van de Sande Bakhuyzen's brother, was appointed as Director of the Observatory. On taking up the chair, de Sitter gave his inaugural lecture on\nThe New Methods in Celestial Mechanics\n. E F van de Sande Bakhuyzen died in\n1918\nand in the following year de Sitter was appointed Director of the Leiden Observatory in addition to his professorship. He undertook a complete reorganisation of astronomy at Leiden dividing it into three divisions: Fundamental Astronomy of position or astrometry; Astrophysics; and Celestial Mechanics or theoretical astronomy. Under his leadership it was one of the leading astronomical centres in the world. Oort writes\n[\n13\n]\n:-\nThroughout the years at Groningen, as well as later, de Sitter showed an almost unbelievable activity. In looking through a number of his more important publications, one is struck with the rapidity with which discussions on different topics follow each other and by the amount of thorough critical thinking of which each of these brings evidence. Neither a serious illness from which he suffered during some years, nor the directorship of an observatory which he undertook to reorganise almost entirely, nor his constant activities in many matters connected with the University could slow up the flow of his scientific investigations.\nIn\n1913\nde Sitter produced an argument based on observations of double star systems which proved that the velocity of light was independent of the velocity of the source. It put to rest attempts which had been made up until this time to find emission theories of light which depended on the velocity of the source but were not in conflict with experimental evidence.\nDe Sitter corresponded with\nPaul Ehrenfest\nin\n1916\n, and he proposed that a four-dimensional space-time would fit in with cosmological models based on general relativity. He published a series of papers\n(1916\n-\n17)\non the astronomical consequences of\nEinstein\n's general theory of relativity. He found solutions to\nEinstein\n's field equations in the absence of matter. This was significant since Mach had stated a principle that local inertial frames of reference were determined by the large-scale distribution of mass in the universe. De Sitter asked:-\nIf no matter exists other than the test body, does it have inertia.\nDe Sitter's work led directly to\nArthur Eddington\n's\n1919\nexpedition to measure the gravitational deflection of light rays passing near the Sun, results which, at that time, could only be obtained during an eclipse. De Sitter, unlike\nEinstein\n, maintained that relativity actually implied that the universe was expanding, theoretical results which were later verified observationally and only then accepted by\nEinstein\n.\nIn fact\nEinstein\nhad introduced the cosmological constant in\n1917\nto solve a significant problem concerning the universe, which had also troubled\nNewton\nbefore him, namely why does the universe not collapse under gravitational attraction. This rather arbitrary constant of integration which\nEinstein\nintroduced, admitting it was not justified by our actual knowledge of gravitation, was later said by him to be \"the greatest blunder of my life.\" However de Sitter wrote in\n1919\nthat the term:-\n... detracts from the symmetry and elegance of\nEinstein\n's original theory, one of whose chief attractions was that it explained so much without introducing any new hypothesis or empirical constant.\nIn the\n1990\ns observational evidence suggested that the expansion of the universe is accelerating. One way to incorporate this into the relativistic model is to reintroduce the cosmological constant. This remains an extremely active area of research.\nIn\n1932\nEinstein\nand de Sitter published a joint paper in which they proposed the\nEinstein\n-de Sitter model of the universe. This is a particularly simple solution of the field equations of general relativity for an expanding universe. They argued in this paper that there might be large amounts of matter which does not emit light and has not been detected. This matter, now called 'dark matter', has since been shown to exist by observing is gravitational effects. However the dark matter postulated by\nEinstein\nand de Sitter in\n1932\nstill remains a mystery in that its nature is still unknown but is the subject of major research efforts today.\nAlthough de Sitter is best known for this work on relativity, he made many other contributions of great significance. His doctorate had been on the satellites of Jupiter and he maintained an interest in this topic throughout his life. He used data on eclipses of the satellites dating back to\n1668\nto produce definitive data on the orbital elements and masses of the four satellites. He published theoretical discussion in three papers of\n1918\n,\n1919\nand\n1925\n. Finally in\n1929\nhe produced his definitive results, but he was still working on tables of the motions of the satellites when he died in\n1934\n. During his investigations of the timings of the eclipses of Jupiter's moons, he realised that his data was being affected by variations in the speed of rotation of the earth. Immediately de Sitter had another topic for which he had precisely the right skills to make a breakthrough. His study showed that there is varying tidal friction which affects both the earth and the moon and, in addition, sudden changes which occur in the moment of inertia of the earth.\nAnother study which de Sitter undertook was to refine the data for the fundamental constants of astronomy.\nSimon Newcomb\nhad published values for these constants in\n1895\nand in a rather remarkable international agreement in Paris in\n1896\n, it had been decided that the ephemerides of every country in the world should use\nNewcomb\n's values for these constants. In\n1915\nde Sitter published his first paper on improving the values, this one being concerned almost entirely with the figure and composition of the earth. He wrote in the introduction:-\nOn various occasions I have found myself confronted with the question which would be the best value to adopt for one of the fundamental astronomical constants. We have, of course, the set of constants officially adopted in the national ephemerides ... Some of the adopted constants are inconsistent with each other. This the adopted length of the year and the constant of precession are contradictory, and similarly the mass of the earth and the solar parallax.\nNewcomb\n's great work is now more than thirty years old, but it still stands unsurpassed as an example of sound critical discussion. ... I have only been led by the considerations that on the one hand my results may perhaps be useful to others in similar circumstances, and on the other hand that a critical survey like the present may be helpful to guide the efforts of astronomers to those points where they are most needed.\nHis second paper on the fundamental constants was published in\n1927\nand dealt with the constants associated with precession, nutation, solar parallax, lunar parallax and the mass of the moon. At the time of his death, de Sitter had almost completed a new updating of these constants.\nMany honours were given to de Sitter for his outstanding contributions. He received the Watson Gold Medal from the\nNational Academy of Sciences\nin\n1929\n. The Medal was presented to him in Washington, USA, by Armin Otto Leuschner, Professor of Astronomy of the University of California and Chairman of the Trustees of the Watson Fund. Leuschner said:-\nThe privilege accorded me involves a task of unusual difficulty, for the major part of de Sitter's work is in intricate, speculative, and mathematical fields dealing with the perturbations of the motions of bodies of the solar system according to classical celestial mechanics, and with the theory of relativity from a purely speculative point of view as well as in relation to perturbations observed, but not explained, and relativistic theoretical perturbations not perceived or as yet perceivable by observation. I, therefore, beg your indulgence if I fail in a clear presentation of the significance of some of his contributions to science. His intellectual abilities cover so wide a range and penetrate so deeply and so minutely into practical astronomy and the mathematical theories to explain what is observed, that only an intensive study of his brilliant work could do justice to the greatness of the man.\nIn\n1931\nde Sitter received the Bruce Medal from the Astronomical Society of the Pacific. Also in\n1931\nhe received the Gold Medal of the\nRoyal Astronomical Society\n:-\n... for his theoretical investigations on the orbits of the satellites of Jupiter, and for his contribution to the Theory of Relativity.\nHe was elected as President of the International Astronomical Union and served in this capacity from\n1925\nto\n1928\n.\nDe Sitter suffered from chest complaints for several years but seemed to overcome them. However he died from pneumonia at the young age of sixty-two years. The following is part of a tribute to him which appeared in the\nNew York Times\non\n25\nNovember\n1934\n; it is also reproduced in\n[\n8\n]\n:-\nIn\n[\nde Sitter's\n]\nwork we see the creative mathematician at his best. He is not a cold, dispassionate juggler of Greek letters, a balancer of equations, but rather an artist in whom wild flights of the imagination are restrained by the formalism of a symbolic language and the evidence of observation. Only the musician can fully grasp what it must have meant to de Sitter to see the cosmos shaping itself in new ways in his formulas. Like musical notes, strange symbols, standing for forces and masses that were divined rather than known, arranged themselves into a coherent message. And when the message came to be read a totally new universe was revealed. Here we have something of the direct personal experience of the outer world, of the significance of nature's wonders, that comes only to a Beethoven or a Milton. The expanding universe of de Sitter must be regarded as something more than an inexorable conclusion drawn from the strictest kind of logic with which the human mind is familiar. It is poetry of a new sort - the scientist's way of writing an epic."
}