{
  "nome_completo": "William Marvin Whyburn",
  "nome_curto": "William Whyburn",
  "ano_nascimento": "1901",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whyburn_William/",
  "lugar_nascimento": "Lewisville, Denton County, Texas, USA",
  "lugar_morte": "Greenville, North Carolina, USA",
  "biografia": "William Whyburn\n's parents were the farmers Thomas Whyburn and Eugenia Elizabeth McLeod. Thomas Whyburn had been born in Devonshire, England, but had emigrated with his family to the United States when he was two years old. Eugenia was a native of Alabama. William was brought up on the farm, near to Lewisville, North Texas. He had a younger brother,\nGordon Thomas Whyburn\n, who also has a biography in the archive. William attended Bethel School in the small settlement of Bethel which was situated near the present intersection of Bethel School Road and Moore Road to the east of Coppell. This school, which had existed since\n1858\n, only taught pupils up to the ninth grade so, in\n1916\n, when William was not yet fifteen years old, he entered North Texas State College in Denton. He had sat the college qualifying examinations to gain admission to this College.\nNorth Texas State College was a liberal arts college, mainly aimed at training teachers, but its President from\n1906\nto\n1923\nwas William Hershel Bruce who had organised the starting of Bachelor of Arts and Bachelor of Science degree programmes in\n1917\n-\n18\n. Let us note that William Hershel Bruce was a mathematician who had been a mathematics professor at North Texas State College for five years before becoming President. Whyburn studied at North Texas State College until\n1920\nwhen he went to the University of Texas in Austin. After two years, during which he majored in mathematics, he was awarded a Bachelor of Arts degree and he continued to study there for his Master of Arts degree which he received one year later in\n1923\n. We note that Whyburn's younger brother,\nGordon Whyburn\n, was also a student at the University of Texas from\n1921\n, but he majored in chemistry for his Bachelor's degree.\nIn the year that William Whyburn was awarded his Master's degree,\n1923\n, he married Marie Barfield\n(1900\n-\n1988)\n. Marie, the daughter of Joseph Purcell Barfield and Mary Jane Powers, was a fellow student at the University of Texas. They had two children, Willa Marie Whyburn\n(\nborn\n1928)\nand Clifton Thomas Whyburn\n(\nborn\n1937)\n. We note that Clifton Thomas Whyburn studied mathematics and was awarded a Ph.D. in\n1964\nfrom The University of North Carolina at Chapel Hill. His thesis advisor was\nAlfred Brauer\nand his thesis was entitled\nOn the Second Smallest Quadratic Non-Residue\n.\nReturning to our description of William Whyburn's career, after the award of his Master's degree he continued to study at University of Texas for his Ph.D. His thesis advisor was Hyman Joseph Ettlinger\n(1889\n-\n1986)\n, who had been a student of\nG D Birkhoff\n, and Whyman was awarded a doctorate in June\n1927\nfor his thesis\nLinear Boundary Value Problems for Ordinary Differential Equations and Their Associated Difference Equations\n. However, Whyburn had already published three papers before submitting his doctoral thesis, namely\nAn extension of the definition of the Green's function in one dimension\n(1924)\n,\nOn the Green's function for systems of differential equations\n(1927)\nand\nOn the polynomial convergents of power series\n(1927)\n. In the first of these Whyburn appended the note:-\nThis paper was written at the suggestion of and under the supervision of Professor H J Ettlinger.\nWhyburn introduces the paper by writing:-\nThe\nGreen\n's function in one dimension was defined by\nBôcher\nin\n1901\n. This definition applies to linear differential systems of the nth order where the coefficients of the differential equation are continuous functions and the coefficients of the\nn\nn\nn\nlinearly independent boundary conditions are constants. It is the purpose of this paper to extend this definition to apply to linear differential systems of the second order whose coefficients are analytic functions of a parameter. This extended definition of the\nGreen\n's function is used to carry over the results that have been obtained for these differential systems to integral equations whose kernels are in general analytic functions of a parameter.\nAlthough not published until after his thesis had been submitted, he had also submitted\n(\non\n26\nFebruary\n1927)\nthe paper\nSecond-Order Differential Systems with Integral and k-Point Boundary Condition\ns for publication; it appeared in\n1928\n. Whyburn was still at the University of Texas when he submitted a further paper\nExistence and oscillation theorems for non-linear differential systems of the second order\nfor publication on\n7\nSeptember\n1927\nbut, shortly after that, he went to Harvard where he spent the academic year\n1927\n-\n28\nas a National Research Fellow.\nThe reader may have noticed that Whyburn took four years before submitting his Ph.D. thesis after the award of his Master's degree. This is not a particularly long time but, in Whyburn's case, his doctoral studies had only been a small part of his commitments since he was also teaching. In fact he began teaching while studying at North Texas State College for, between\n1918\nand\n1920\n, he taught at various schools in Denton County. It is worth noting that\nSamuel Wilks\n's first school was Little Elm School, a local one-room primary school, and when he was in the\n7\nth\ngrade at this school he was taught by Whyburn. For the first of the four years between his Master's degree and his Ph.D.,\n1923\n-\n24\n, he taught full-time as an Instructor at South Park Junior College, Beaumont, Texas, and for the next,\n1924\n-\n25\n, he was an Assistant Professor at Texas A&M College. In the third of these years,\n1925\n-\n26\n, he was an Associate Professor at the Texas Technological College in Lubbock, Texas. This looks as though he had not even begun his doctoral studies until\n1926\nbut he had spent the summers at the University of Texas during these years. He was awarded a Louis Lipsitz Fellowship for the academic year\n1926\n-\n27\nso he was able to work full-time at his thesis during that year. He retained his position at the Texas Technological College in Lubbock, taking leave from the College and, in\n1927\n-\n28\nwhile he was at Harvard he was still on the faculty at the Texas Technological College but on leave. We should marvel that, with such a limited amount of research time over his four years at the University of Texas, not only did he write a thesis but also the series of major papers we mentioned above.\nIn\n1928\nWhyburn was appointed as an Assistant Professor of Mathematics at the University of California at Los Angeles. He spent sixteen years at the University of California, steadily being promoted until he became a full professor on\n1938\n. He served as the chairman of the Mathematics Department for seven years from\n1937\nto\n1944\n. Of course, some of these seven years were the years of World War II and Whyburn undertook various war related duties in addition to his role as chairman of department. He served as Chairman of the Supervisors Committee, Los Angeles Area, University of California, for Engineering, Science, Management War Training Programs from\n1941\nto\n1944\n. He also held the role of Chief of the Operations Analysis Section of the Third Air Force in\n1944\n. During the war years he wrote the paper\nMathematics for production and war\n(1943)\nand the book\n(\nwith Paul H Daus and John W Gleason\n)\nBasic mathematics for war and industry\n(1944)\n. A preliminary edition of the book\n(\nreproduced from a typewritten copy\n)\nwas published in\n1943\nunder title\nMathematics for war and industry\n. The authors write in the Preface:-\nThe war program has given rise to extensive training and educational activities designed to meet needs of essential industries and the armed forces. Skill in the use of mathematics, particularly arithmetic, algebra, geometry, and trigonometry, is an integral part of all phases of a highly technical war. Similarly, but to a less spectacular degree, basic mathematical skills are indispensable to peace-time activities. The experiences of serious investigators lead to the uniform conclusion that the same principles of elementary mathematics are needed for the armed forces, for war industry, and for ordinary civilian activities. ... This book is written to provide a single text in which selected principles of elementary mathematics are presented in a carefully organised manner. The book has been made thoroughly practical - both in the choice and treatment of topics. The practical aspects have been introduced without sacrifice of mathematical rigour or accuracy of statement.\nWe note that, in\n1921\n, Paul Harold Daus\n(1894\n-\n1973)\nhad received his doctorate from the University of California where his thesis advisor was\nDerrick N Lehmer\n. He was associated with the University of California until he retired in\n1961\n. He wrote a number of texts in collaboration with Whyburn in addition to the one we have just mentioned:\nFirst year college mathematics with applications\n(1949)\n,\nAlgebra for college students\n(1955)\n,\nIntroduction to mathematical analysis, with applications to problems of economics\n(1958)\n, and\nAlgebra with applications to business and economics\n(1961)\n. In the first of these texts the authors write:-\nThis book is written with the intention of providing a single text for the study of first year college mathematics, especially in engineering and technical schools. Its purpose is to provide a strong and ample background for the study of the calculus, and to integrate the subjects of college algebra, analytic geometry, and analytic trigonometry. At the same time the text illustrates all principles by applications taken from science and engineering, so that the course is completely independent of its future use.... Suggested lesson outlines for a ninety-hour course\n(\nthree days a week for two semesters\n)\nand for a seventy-five-hour course are given....\nE M Beesley writes in the review\n[\n1\n]\n:-\nThose who prefer to give relatively strong training in analytic geometry should welcome this book with enthusiasm. In sharp contrast with recent works which combine analytics with calculus and thereby effect a de-emphasis of the former subject, this text retains most of the traditional geometrical topics. Moreover, it provides a vigorous and well-motivated presentation which, in the opinion of the reviewer, is superior to that of many established books.\nFor extracts from more reviews of this book, and of Whyburn's other books, see\nTHIS LINK\n.\nIn\n1944\nWhyburn was appointed as President of Texas Technological College\n[\n10\n]\n:-\nAs President of Texas Tech he recruited able people, and provided leadership in advancing that school to a higher academic level and its recognition by such agencies as the American Association of Universities and the American Association of University Women. The institution also profited by Whyburn's contacts with government agencies, as reflected by the excellent support that was obtained for certain programs.\nHe held this position for four years before resigning in\n1948\nwhen he was appointed Kenan Professor of Mathematics at the University of North Carolina in Chapel Hill. He also became chairman of the mathematics Department from the time of his appointment. In\n1956\nhe gave up the chairmanship of the department when he became Acting Provost for the academic year\n1956\n-\n1957\n, and he then served as Vice President for Research from\n1957\nto\n1960\n. In January\n1967\n, when aged\n65\n, he retired from the University of North Carolina but was appointed as Frensley Professor of Mathematics at the Southern Methodist University in Dallas. He undertook his duties in Dallas until June\n1970\nwhen he took a \"second retirement\" returning to live again in Chapel Hill in the home he had lived in for over twenty years. Even after two retirements, Whyburn found it difficult to leave the academic world and he was happy to accept a part-time position teaching in East Carolina University in Greenville, North Carolina. He taught there until his sudden death from a heart attack in May\n1972\n.\nA look at the extracts from the reviews of Whyburn's books at\nTHIS LINK\nwill show immediately how much he was concerned about teaching at all levels. It is clear that he had thought deeply about how to enthuse students, particularly those who were users of mathematics rather than those studying the subject for its own sake. William Reid, who had been a research student at the University of Texas advised by H J Ettlinger at the same time as Whyburn, writes\n[\n10\n]\n:-\nWhyburn was interested in teaching at all levels, and according to one of his former colleagues he prided himself upon carrying a balanced load of courses at all levels from freshman to advanced graduate. In the classroom, one of his precepts was \"give the student something that he can do\", and he was always concerned with the development of the student's initiative. In supervising dissertation research, he carefully adapted his tactics to the individual student. Out of the classroom, he was sincerely concerned with the welfare of students and faculty, and was readily accessible to all.\nWe must not let the fact that Whyburn wrote low level undergraduate texts lead us to believe that he did not contribute much in high-level research. On the contrary, he wrote around\n40\npapers on differential equations. These are discussed in\n[\n1\n]\nunder the areas: Boundary value problems; Systems of difference equations; General existence theorems, and functional properties of solutions; Specific properties of\nGreen\n's functions and\nGreen\n's matrices; and Nonlinear matrix differential equations. Closely related to this work on differential equations is his papers on the theory of the\nLebesgue\nintegral following\nFrigyes Riesz\n's approach of approximation by step functions.\nAmong the honours Whyburn received for his contributions, we mention that he served as Vice President of the\nMathematical Association of America\nfor\n1943\n-\n1945\n. He was elected to the National Academy of Peru in December\n1943\n, and in\n1948\nhe was awarded the honorary doctorate by Texas Technological College."
}