{
  "nome_completo": "William Oughtred",
  "nome_curto": "William Oughtred",
  "ano_nascimento": "1574",
  "ano_morte": "1660",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oughtred/",
  "lugar_nascimento": "Eton, Buckinghamshire, England",
  "lugar_morte": "Albury, Surrey, England",
  "biografia": "William Oughtred\n's father was the Rev Benjamin Oughtred, a writing-master and 'registrar' at Eton College. We have given William's date of birth as\n5\nMarch\n1574\n, and indeed most biographies give this as his date of birth, but in fact it is the date that he was baptised. His actual date of birth is unknown but is unlikely to be more than a few days before his date of baptism. William attended Eton School as a King's Scholar, which although a very famous school was in fact his local school, the school were his father taught. William was taught arithmetic at Eton by his own father. From there he went to King's College Cambridge, entering in\n1592\n. It is surprising that although very little mathematics was taught at either Eton or Cambridge at this time, Oughtred became passionately interested. Oughtred was self-taught in mathematics while at Cambridge, writing\n(\nsee, for example,\n[\n30\n]\n)\n:-\n... in Cambridge in King's College ... ... the time which over and above those usual studies I employed upon the mathematical sciences I redeemed night by night from my natural sleep, defrauding my body, and inuring it to watching, cold, and labour, while most others took their rest. ... by inciting, assisting and instructing others, I brought many into the love and study of those Arts, not only in our own, but in some other Colleges also.\nThree years later he became a Fellow of King's College, received his B.A. in\n1596\nand his M.A. in the year\n1600\n. Although Oughtred did not publish any mathematics during his years at Cambridge, nevertheless we know that he did produce various writings which he published much later. Also at this time he was thinking about the design of mathematical instruments about which again he published nothing at this time but would do so years later.\nOughtred was ordained a Church of England minister in\n1603\nbut he continued as a fellow at Cambridge University until\n1604\nwhen he became vicar of Shalford, Surrey, a village south of Gilford. There he met Christsgift Caryll, the daughter of William and Dorothy Caryll. William Caryll had married Dorothy Cowdry on\n8\nMay\n1587\nat Godalming, Surrey. Their daughter, Christsgift, was baptised at Godalming on\n21\nApril\n1588\nand, when Oughtred met Christsgift she was living with her parents in Tangley, close to Shalford. Oughtred married Christsgift Caryll at Tangley on\n20\nFebruary\n1607\n. They had twelve children, William, Henry, Henry\n(\nthe first Henry died as a baby\n)\n, Benjamin, Simon, Margaret, Judith, Edward, Elizabeth, Anne, George, and John. Two of his sons, Benjamin and John, shared Oughtred's interest in instruments and became watchmakers.\nIn\n1610\n, Oughtred became rector of Albury, a village about\n5\nkm east of Shalford. He would continue to keep this position for the rest of his life, but he made contacts with fellow mathematicians at Gresham College in London. Writing in about\n1633\n, Oughtred describes a visit to London\n15\nyears earlier:-\nIn the Spring\n1618\nI being at London went to see my honoured friend Master\nHenry Briggs\nat Gresham College: who then brought me acquainted with Master\nGunter\nlately chosen Astronomical lecturer there, and was at that time in Doctor Brooks his chamber. With whom falling into speech about his quadrant, I showed him my Horizontal Instrument. He viewed it very heedfully: and questioned about the projecture and use thereof, often saying these words, it is a very good one. And not long after he delivered to Master\nBriggs\nto be sent to me mine own Instrument printed off from one cut in brass: which afterwards I understood he presented to the right Honourable the Earl of Bridgewater, and in his book of the sector printed six years after, among other projections he setteth down this.\nOughtred's marriage had brought him into contact with certain local families which influenced his position. Two of these families were the Aungiers and the Duncombes both of which were distantly related to his wife's family. Francis Aungier\n(1558\n-\n1632)\nwas\n1\nst Baron of Longford and Oughtred taught his son, Gerald Aungier\n(1596\n-\n1655)\n, mathematics. Oughtred, of course, was also a Latin scholar and, as others of this period, would write his works in Latin. He taught Latin to a member of the family of George Duncombe\n(1563\n-\n1660)\n, who was one of his parishioners.\nIn\n1620\nOughtred met Captain Marmaduke Neilson who claimed to have found an astronomical method of finding longitude at sea. It seems that at this time it was agreed that Neilson's method would not work but, some years later Oughtred would become more formally involved with assessing Neilson's method. We will describe this later in this biography.\nIt was in\n1628\nthat Oughtred made an important contact which allowed him to become more involved with the mathematicians working in London. Thomas Howard,\n21\nst Earl of Arundel, had been a leading courtier during the reign of King James I who had died in\n1625\n. Howard was then a courtier for King Charles I, a role he had in\n1628\nwhen he made contact with Oughtred who wrote that in\n1628\n:-\n... the Earl of Arundel my most honourable Lord in a time of his private retiring to his house ... at West Horsley, four small miles from me ... hearing of me ... was pleased to send for me: and afterward at London to appoint me a chamber in his own house\n[\nArundel House, in the Strand\n]\n.\nThis gave Oughtred a base in London which was important to him. Thomas Howard's youngest son was William Howard\n(1614\n-\n1680)\nwho later became\n1\nst Viscount Stafford and an Fellow of the Royal Society. William Howard was a bright boy and Oughtred taught him advanced mathematics. To assist in this teaching, Oughtred composed a work on mathematics which was published in\n1631\nas\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\n. We will look at the contents of this important work below. Oughtred took private pupils who came to his house in Albury and lived there free of charge while they received mathematical instruction. However, having a room in London allowed him to also give some tuition there. He had many pupils but the most famous were\nJohn Wallis\n,\nJohn Pell\n,\nSeth Ward\n,\nChristopher Wren\nand\nRichard Delamain\n. Some of these he tutored in Albury, some in London, and some could be perhaps better described as followers who had gained much from reading the\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\nand perhaps had an occasional word with him\n.\nAnother benefit from his London base was that it allowed him to have close contact with makers of mathematical instruments, particularly Elias Allen\n(1592\n-\n1653)\nwho had his workshop beside St Clement Danes Church, the Strand, near Arundel House. A letter from Oughtred to Allen, dated\n20\nAugust\n1638\n, reads:-\nI have here sent you directions\n(\nas you requested me being at Twickenham\n)\nabout the making of the two rulers. ...\n[\nI\n]\nwould gladly see one of\n[\nthe two parts of the instrument\n]\nwhen it is finished: which yet I never have done.\nChristopher Brookes, one of Allen's assistants, became Oughtred's son-in-law. He edited Oughtred's\nThe Solution of All Spherical Triangles by the Planisphere\n(1651)\n.\nAlthough Oughtred had not had instruments made early in his career, he had invented them while at Cambridge. In fact one of his pupils at Albury, William Forster, spent the summer of\n1630\nliving in Oughtred's home and was so impressed with Oughtred's mathematical instruments that he persuaded Oughtred to let him publish an English translation of Oughtred's unpublished Latin description. It was published in London in\n1632\nunder the title\nThe Circles of Proportion and the Horizontal Instrument. Both invented, and the uses of both written in Latin by Mr William Oughtred. Translated into English and set forth for the public benefit by William Forster\n. It states:-\nPrinted for Elias Allen maker of these and all other Mathematical Instruments and are to be sold at his shop over against St Clements church without Temple Bar.\nWilliam Forster writes in the book:-\nFor being in the time of the vacation\n1630\n, in the country, at the house of the Reverend, and my worthy friend, and Teacher, Mr William Oughtred ... I told him of Mr\nGunter\n's Ruler.\n[\nHe described it as\n]\na poor invention\n[\nand showed me\n]\nwhat devices\n[\nhe\n]\nhas had by\n[\nhim\n]\nthese many years. ... he meant to commend to me, the skill of Instruments, but first he would have me well instructed in the Sciences.\nAlthough, as we have seen, Oughtred gained from the support of Thomas Howard,\n21\nst Earl of Arundel, nevertheless he felt that he never received the rewards that he deserved from his patron. Others too considered Arundel less than generous in his dealings with Oughtred who looked for church preferments. His one acquisition was the Heathfield prebend at Chichester Cathedral given to him, not by the Earl of Arundel, but by Bishop Henry King an English poet who served as Bishop of Chichester. Bishop Henry King was related to George Duncombe and had his son John King who was tutored by Oughtred.\nWe mentioned above that Oughtred would become involved with Captain Marmaduke Neilson later and this happened in\n1636\n. A document of\n22\nMay of that year refers to Captain Marmaduke Neilson's petition regarding his astronomical method of finding longitude at sea. A commission composed of Sir James Galloway, John Seldon,\nHenry Gellibrand\nand William Oughtred was set up \"to consider and certify whether they hold the petitioner able to perform the particulars mentioned in his petition.\" The commission's report has not survived but we can be certain that the commission did not find Neilson's method workable.\nOur description of Oughtred's life makes it appear that it was a busy one for, we must remember, his full-time position was as rector of Albury. He himself, however, described his life as quiet with infrequent trips to London\n(\nsee, for example,\n[\n3\n]\nor\n[\n11\n]\n)\n:-\nIndeed the life and mind of man cannot endure without some interchangeableness of recreation, and pauses from the intensive actions of our several callings; and every man is drawn with his own delight. My recreations have been diversity of studies; and as oft as I was toiled with the labour of my own profession, I have allayed that tediousness by walking in the pleasant and more than Elysian fields of the diverse and various parts of humane learning, and not the Mathematics only.\nAubrey\n[\n5\n]\ngives an interesting description of Oughtred's appearance and lifestyle:-\nHe was a little man, had black hair, and black eyes\n(\nwith a great deal of spirit\n)\n. His head was always working. He would draw lines and diagrams on the dust.... he used to lie a bed till eleven or twelve a clock, with his doublet on ... studied late at night, went not to bed till\n11\no'clock, had his tinder box by him, and on top of his bed-staff, he had his ink-horn fixed. He slept but little. Sometimes he went not to bed in two or three nights, and would not come down to meals till he had found out the quaesitum.\nFlorian Cajori\nstudied Oughtred's writings carefully and was able to gain a useful feeling for both his approach to mathematics and to teaching mathematics.\nCajori\nwrote\n[\n3\n]\n:-\nOughtred was a great admirer of the Greek mathematicians -\nEuclid\n,\nArchimedes\n,\nApollonius of Perga\n,\nDiophantus\n. But in reading their words he experienced keenly what many modern readers have felt, namely, that the almost total absence of mathematical symbols renders their writings unnecessarily difficult to read. Statements that can be compressed into a few well-chosen symbols which the eye is able to survey as a whole are expressed in long drawn out sentences. ... In studying the ancient authors Oughtred is reported to have written down on the margin of the printed page some of the theorems and their proofs, expressed in the symbolic language of algebra.\nOughtred's most important work,\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\n(1631)\n, included a description of Hindu-Arabic notation and decimal fractions but one of the real strengths of the work is the way that fractions, irrationals, decimal expansions, and logarithms are all treated as \"numbers.\" This was in contrast with other mathematicians at this time who treated these as distinct concepts. He even treats negative numbers as \"numbers,\" although he does not allow these to be the solutions of equations. As Neal writes\n[\n5\n]\n:-\n... he treated numbers as continuous, rather than discrete, which was a movement away from Greek concerns.\nThe work contains a considerable section on algebra, although this is still thought of geometrically as is shown by his rejection of negative numbers as solutions to equations. He wrote in the second edition\n(1647)\nof\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\nthat:-\n... Which treatise not written in the usual synthetic manner, nor with verbose expressions, but in the inventive way of Analysis, and with symbols or notes of things instead of words, seemed unto many very hard; though indeed it was but their own diffidence, being scared by the newness of the delivery; and not any difficulty in the thing itself. For this specious and symbolical manner, neither racketh the memory with multiplicity of words, nor chargeth the fantasy with comparing and laying things together; but plainly presenteth to the eye the whole course and process of every operation and argumentation. ... Now my scope and intent in the first Edition of that my 'Key' was, and in this New Filing, or rather forging of it, is, to reach out to the ingenious lovers of these Sciences, as it were Ariadne's thread, to guide them through the intricate Labyrinth of these studies, and to direct them for the more easy and full understanding of the best and ancientest Authors; ... That they may not only learn their propositions, which is the highest point of Art that most Students aim at; but also may perceive with what solertiousness, by what engines of equations, interpretations, comparations, reductions, and disquisitions, those ancient Worthies have beautified, enlarged, and first found out this most excellent Science. ... Lastly, by framing like questions problematically, and in a way of Analysis, as if they were already done, resolving them into their principles, I sought out reasons and means whereby they might be effected. And by this course of practice, not without long time, and much industry, I found out this way for the help and facilitation of Art.\nHe experimented with many new symbols including _ for multiplication and :: for proportion. Like all Oughtred's works it was very condensed containing only\n88\npages.\nOughtred used π in\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\nbut not for the ratio of the circumference to the diameter, merely for the circumference. Other notation for greater than and less than proved hard to remember and was not accepted, the familiar > and < being due to\nThomas Harriot\nat almost the same time.\nToday it seems that Oughtred is best known for his invention of an early form of the slide rule.\nEdmund Gunter\n(1620)\nplotted a logarithmic scale along a single straight two foot long ruler. He added and subtracted lengths by using a pair of dividers, operations that were equivalent to multiplying and dividing. In\n1630\nOughtred invented a circular slide rule. In\n1632\nhe used two\nGunter\nrulers so that he could do away with the dividers. His description was published in\nCircles of Proportion\nin\n1632\nas we explained above. It describes slide rules and sundials.\nA picture of Oughtred's\nCircle of Proportion\nis at\nTHIS LINK\n.\nThere was a dispute, however, regarding priority over the invention of the circular slide rule.\nDelamain\ncertainly published a description of a circular slide rule before Oughtred. His\nGrammelogia, or the Mathematicall ring\nwas published in\n1630\n. It may well be that both invented this instrument independently. Unfortunately a very heated argument ensued and to some extent this formed a cloud over the later years of Oughtred's life. The argument came down to whether one needed to understand how an instrument worked before one could make use of it. Katherine Hill writes\n[\n20\n]\n:-\nDelamain\nproposed that it was acceptable to teach the use of instruments without explaining why the instruments worked the way they did. ... in his 'Mathematical instruments and the education of gentlemen',\n[\nDelamain\nstates\n]\nthat instruments were the simplest way to make mathematical activity available to gentlemen without having to provide 'a full grounding in the theoretical principles of mathematics'. Many prospective students wished to treat instruments as 'black boxes' and ignore the principles behind their operation. Oughtred, on the other hand, believed, for example, that it was improper to teach the use of the Circles of Proportion to someone who had no understanding of logarithms. For him, it was vital that the student understood the principles behind the instrument's construction before they learned its use.\nIt was the following statement by Oughtred in\nCircles of Proportion\nthat upset\nDelamain\nwho saw it as an attack directed at him:-\nThat the true way of Art is not by Instruments, but by Demonstration: and that it is a preposterous course of vulgar Teachers, to begin with Instruments, and not with the Sciences, and so instead of Artists, to make their Scholars only doers of tricks, and as it were jugglers: to the despite of Art, loss of previous time, and betraying of willing and industrious wits, unto ignorance, and idleness. That the use of Instruments is indeed excellent, if a man be an Artist: but contemptible, being set and opposed to Art.\nWe note that the present form of the slide rule was designed in\n1850\nby a French army officer,\nAmedee Mannheim\n.\nOughtred's other works were\nTrigonometria\n(1657)\n, one of the first works on trigonometry to use concise symbolism,\nThe Solution of All Spherical Triangles by the Planisphere\n(1651)\n, solving spherical triangles by the planisphere, and a number of more minor works on watchmaking and methods to determine the position of the sun published posthumously as\nOpuscula mathematica\nⓉ\n(\nMathematical works\n)\n(1677)\n.\nThe English Civil War\n(1642\n-\n1646)\nwas a difficult time for Oughtred who was a staunch royalist supporter. In\n1646\nhe was summoned before Oliver Cromwell's sequestration committee because of his royalist support. William Lilly\n(1602\n-\n1681)\nwas a parliamentary astrologer whose support of Oughtred was a factor in having him spared. Others are believed to have also helped save him including Sir Richard Onslow, a Surrey landowner, to whom he dedicated the second edition of the\nClavis Mathematicae\npublished in\n1647\n. Oughtred was shocked at execution of King Charles I in January of\n1649\nbut it is said that he rejoiced on his deathbed at the news that Charles II, who reached London on\n20\nMay\n1660\n, had been restored to the English throne.\nOughtred was buried on\n15\nJune and, on\n24\nJuly\n1661\n, the administration of his estate was given to his son Henry. Oughtred owned an important library which went in part to\nWilliam Jones\nbut it is impossible today to identify the books that came from Oughtred's library."
}