{
  "nome_completo": "William Vallance Douglas Hodge",
  "nome_curto": "William Hodge",
  "ano_nascimento": "1903",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hodge/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Cambridge, England",
  "biografia": "William Hodge\n's parents were Janet Vallance\n(\nborn\n1875)\n, whose father William Vallance owned a confectionary business in Edinburgh, Scotland, and Archibald James Hodge\n(1869\n-\n1938)\nwho worked in the property market as a partner in the firm Douglas and Company. Archibald Hodge and Janet Vallance were married in\n1900\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nAt first the Vallance family objected strongly to the marriage. Although both families were by this time comfortably off, the Vallances, having carefully built up their savings, were distinctly wealthier and they suspected young Archibald of being after their daughter's money\n(\nwhich was quite untrue\n)\n. In addition Archibald, being the only son of well-off parents, had led a gay life and acquired a taste for drink.\nWilliam was born at\n1\nChurch Hill Place, Edinburgh, Scotland. He was the second of his parents' three children, having one older brother Archibald Vallance Hodge and one younger sister Janet Horsburgh Hodge. He began his schooling at the age of four and spent two years in the local kindergarten.\nAfter leaving the kindergarten, Hodge's entire education was at George Watson's Boys College in Edinburgh, entering in\n1909\nand studying there until\n1920\n. He performed well in his academic subjects at school and this was important to him for while his father and brother were excellent golfers, William displayed a distinct lack of ability on the golf course. His academic success was, therefore, a compensation to him and he determined to make the most of it. Hodge was eleven years old when World War I began and the next four war years were difficult ones. In the middle of these years, in\n1916\n, his uncle William Hodge, died and this led to his elder brother Archibald Vallance Hodge leaving school to become an apprentice in the Vallance confectionary business. The family had decided that Archibald would, after training, take over the business. This had quite an impact on Hodge for now he had to make his own way at George Watson's and this led to him becoming friends with the academically inclined pupils. His performance improved markedly from this time but, having nobody to guide him, he made some poor choices of subjects. He opted to take optional courses on Latin and Greek instead of science. It was a decision that, in later life, he felt had been a major mistake.\nIn\n1918\nthe war ended and the demand for housing rose sharply but, with many employees of the firm Douglas and Company still in the army, the family decided that Hodge should leave school and join the firm. At Easter\n1918\n, he left George Watson's and took on a clerical position in Douglas and Company. Hodge did the work competently but felt that the rather trivial boring routine work did not challenge him in any way. After six months of this clerical job the family decided to allow him to return to George Watson's where he spent another two years. During these two years Hodge's family had many discussions about his future career, and eventually it was decided that he should aim at entering the Civil Service. This would require him to have a university degree so, as part of the plan, he prepared to sit the University of Edinburgh Bursary Competition. His best school subject was mathematics so his aim was to take a degree in mathematics and philosophy. His mathematical talents had been brought out by his teacher\nPeter Ramsay\nwho\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\n... had the gift of being able to stimulate any mathematical ability which could be found in his pupils in a manner which, as described by Hodge, was a remarkable combination of sarcasm and kindliness.\nIn June\n1920\n, Hodge sat the Bursary Competition. He performed quite well and was ranked quite high on the list but he did not look outstanding. However, there was one paper which aimed to find the best mathematics student for the John Welsh Mathematical Bursary and in this special mathematics paper he did top the list. Winning this mathematical bursary made him financially secure and allowed him to progress to become a student at Edinburgh University. Another very positive aspect of his performance in the special paper was that, even before he began his studies, professor\nEdmund Whittaker\nwas aware of his talented student. He matriculated at the University of Edinburgh in October\n1920\nand was taught there by\nWhittaker\nand also became a fellow student of\nWhittaker\n's son, the talented\nJohn Whittaker\n. Hodge, who had done well at school but only managed to be ranked somewhere in the top third of most classes, found himself easily ranked first in his mathematics classes at university. In addition to mathematics, he took classes in English, economics and physics but in these subjects his performance was less impressive. At this stage he was still intending to seek entry to the Civil Service after graduating but, since his achievements seemed to be solely dependent on his ability in mathematics, he began to feel that entering the Civil Service with only expertise in mathematics would limit his career. With strong encouragement from\nWhittaker\nhe began to consider an academic career and\nWhittaker\nadvised him to continue his studies at Cambridge. After graduating with First Class Honours in mathematics from Edinburgh in\n1923\n, he entered St John's College, Cambridge, in October of that year.\nHis studies at Cambridge were financed by a van Dunlop bursary which he had won from the University of Edinburgh and a £\n60\nscholarship from St John's College. The University of Cambridge came as a bit of a shock to the young Hodge who had been taught a rather old fashioned mathematics course at Edinburgh. The Mathematical Tripos at Cambridge had just undergone a major revision and Hodge was taught by\nJ E Littlewood\nand F P White\n(\nwho lectured on projective geometry\n)\n. He was also taught by\nHenry Baker\nand Hodge, poorly prepared for this material, had a hard struggle to keep up with the demanding courses. However, it was White whose course most inspired Hodge\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nFairly soon after arriving in Cambridge Hodge had to decide what subject he intended to specialize in for schedule B. In the event this decision turned out to be extremely easy. From the moment he joined F P White's course on projective geometry he never gave a thought to any other topic. This may seem surprising since White, though an enthusiastic geometer and a charming man, made no claims to being a brilliant lecturer. The explanation lies in the contrast between the way projective geometry was treated in Edinburgh and Cambridge. Whereas in Edinburgh it was an appendage to Euclidean geometry, White's course gave a comprehensive account of the synthetic approach, based on the axioms of incidence, and its relation to coordinate geometry. This opened up a whole new world to Hodge and, in his own words, he was promptly \"hooked\".\nIn\n1921\nAlan Broadbent\nhad matriculated at St John's College and, once Hodge came to the same College, the two became friends. They were almost exactly the same age, Hodge being about two weeks younger than\nBroadbent\n. After gaining distinction in the Mathematical Tripos of\n1925\n, Hodge went on to win a Smith's Prize and spent a further year undertaking research at Cambridge financed by a Ferguson scholarship. His friend\nBroadbent\nwas also undertaking research at this time advised by\nJ E Littlewood\nbut Hodge seems to have had no intention of spending more than a year undertaking research so he only had advice from\nH F Baker\non an informal basis. In some ways the year was not a great success for Hodge did not find any problem he could make progress with for most of the year. However, in other ways the year was useful since after the stressful Tripos years when he was having to put in vast efforts to achieve top quality results, now the pressure was off. He lived in rooms in St John's College in\n1925\n-\n26\nwith\nBroadbent\nand the two would remain close friends for the rest of their lives. In fact\nBroadbent\nmarried Hodge's sister, Janet\n(\nNita\n)\nHodge, in\n1930\n.\nHodge was appointed to an assistant lectureship at the University of Bristol in\n1926\nand spent five years there. It was a very profitable period for him and, realising his research potential, the head of department Henry Ronald Hassé gave him a light teaching load so that he could concentrate on research. He began publishing papers during his time at Bristol, namely\nLinear systems of algebraic curves on a plane and on a cone\n(1928)\n,\nThe isolated singularities of an algebraic surface\n(1929)\n,\nOn multiple integrals attached to an algebraic variety\n(1930)\n, and\nFurther properties of abelian integrals attached to algebraic varieties\n(1931)\n. It was the\n1930\npaper which brought him international attention. In it he applied topological ideas from a\n1929\npaper by\nSolomon Lefschetz\nwho had studied integrals on a curve. Hodge was able to solve a problem about integrals on a surface which had been posed by\nFrancesco Severi\nusing\nLefschetz\n's topological methods. That same year he gained election to a fellowship at St John's College, Cambridge.\nIn the previous year, on\n27\nJuly\n1929\n, he had married Kathleen Anne Cameron, the daughter of Robert Stevenson Cameron, the manager of the Edinburgh branch of Oxford University Press. They had one son and one daughter. In\n1931\n, after winning an\n1851\nExhibition Studentship, he went to Princeton so that he could work with\nLefschetz\nwhom he greatly admired. His initial contact with\nLefschetz\nhad been difficult since\nLefschetz\nrefused to believe that Hodge's results in\nOn multiple integrals attached to an algebraic variety\nwere correct\n[\n5\n]\n:-\nAt first\nLefschetz\ninsisted publicly that Hodge was wrong and he wrote to him demanding that the paper should be withdrawn. Eventually\nLefschetz\nand Hodge had a meeting in May\n1931\nin\nMax Newman\n's rooms in Cambridge. There was a lengthy discussion leading to a state of armed neutrality and an invitation to Hodge to spend the next academic year at Princeton.\nIt took Hodge the whole of his first month at Princeton before he was able to convince\nLefschetz\nthat he was right. Once convinced,\nLefschetz\npublicly admitted his error and was very generous in his praise of Hodge's work. While in the United States Hodge spent two months at Johns Hopkins University studying with\nOscar Zariski\n. This had been at the suggestion of\nLefschetz\nwho said that Hodge would gain much useful insight into\nalgebraic geometry\nfrom\nZariski\n.\nAfter his visit to the United States, Hodge returned to Cambridge, England, in\n1932\n. He was appointed as a university lecturer in the following year and, in\n1935\n, was elected to a fellowship at Pembroke College, Cambridge. He had a very high teaching load but, nevertheless, during this period he developed the relationship between geometry, analysis and topology, and produced some of his best remembered work on the theory of harmonic integrals. For these contributions Hodge won the\nAdams\nPrize in\n1937\nand\nHermann Weyl\ndescribed this contribution as:-\n... one of the great landmarks in the history of science in the present century.\nHodge published a polished account of his important theory in\n1941\nin the book\nThe theory and applications of harmonic integrals\n. This work marked an important change in direction for the Cambridge school of geometry which, under Baker's leadership, had become somewhat isolated from other areas of mathematics.\nFor some extracts from reviews of Hodge's\n1941\nmonograph, see\nTHIS LINK\n.\nIn March\n1936\nHodge had been appointed as Lowndean Professor of Astronomy and Geometry, succeeding\nHenry Baker\n, and he held this chair at Cambridge until\n1970\n. He spoke of his appointment nearly\n20\nyears later\n[\n12\n]\n:-\nI well remember that when I became Professor at Cambridge in\n1936\n[\nHardy\n]\ntook great pains to help me to encourage developments in geometry along the lines that seemed best to me, and gave me much advice which proved of the greatest value.\nWhen he was appointed to the chair, he also became a professorial fellow of Pembroke College and so continued his association with that College. He continued to work at Cambridge during World War II, but took on extra duties to compensate for the shortage of staff who were away in the forces; in particular he acted as bursar of Pembroke. The rules did not allow a professor to be a bursar but this was got round by calling the post Steward of Pembroke\n[\n6\n]\n:-\nAs Steward, Hodge was responsible for the domestic side of College affairs. It was his first taste of administration and he soon found, to his surprise and amusement, that he was coping very efficiently with his new responsibilities. This proved a turning point in Hodge's life. Once it was discovered that he both enjoyed and was efficient at administration he was constantly called on to serve in various capacities both within and outside the University.\nDuring the war, in\n1941\n, Hodge began a collaboration with\nDaniel Pedoe\nwho had undertaken research at Cambridge for his Ph.D. under\nH F Baker\n. Hodge had been one of the examiners of\nPedoe\n's thesis\nThe Exceptional Curves on an Algebraic Surface\nin\n1937\n. The collaboration between Hodge and\nPedoe\nled to the three-volume work\nMethods of Algebraic Geometry\n.\nFor some extracts of reviews of these three volumes, see\nTHIS LINK\n.\nHodge visited Harvard in\n1950\n. He was an invited plenary speaker at the International Congress of Mathematicians in Cambridge, Massachusetts in September of that year where he gave the address\nThe Topological Invariants of Algebraic Varieties\n. However, he spent the year from January\n1950\nat Harvard where\nZariski\nhad arranged for him to be a visiting lecturer. Hodge went with his family to the United States and every Sunday they dined at the\nZariski\nhome. On these occasions Hodge wished to be sociable and did not discuss mathematics with his host.\nIn\n1958\nhe was appointed as Master of Pembroke, holding the post until he retired from university life in\n1970\n.\nHodge was one of the originators of the British Mathematical Colloquium, an annual conference which visits different British universities. He also played a major role in setting up the\nInternational Mathematical Union\nin\n1952\n, being elected as vice-president from\n1954\nto\n1958\n. He was chairman of the International Congress of Mathematicians in Edinburgh in August\n1958\n. In\n1959\nthe\nLondon Mathematical Society\nawarded him their\nDe Morgan\nMedal. He was elected to the\nRoyal Society of London\nin\n1938\n, received the Society's Royal Medal in\n1957\n, and was vice-president from\n1959\nto\n1965\n. The Royal Medal was awarded in:-\n... recognition of his distinguished work on algebraic geometry.\nHe was also awarded the Copley Medal by the\nRoyal Society\nin\n1974\n:-\n... in recognition of his pioneering work in algebraic geometry, notably in his theory of harmonic integrals.\nHe received many other honours. He was elected to the\nRoyal Society of Edinburgh\n, and the\nAmerican National Academy of Sciences\n. He was awarded honorary degrees by many universities including Bristol\n(1957)\n, Edinburgh\n(1958)\n, Leicester\n(1959)\n, Sheffield\n(1960)\n, Exeter\n(1961)\n, Wales\n(1961)\n, and Liverpool\n(1961)\n. He was knighted in\n1959\n.\nHe is described in\n[\n4\n]\nas follows:-\nHodge was very unlike the conventional picture of a mathematician. Jovial, informal and down-to-earth, he could easily have passed for a businessman.\nMichael Atiyah\n, who was one of Hodge's student, writes that Hodge was:-\n... modest and unassuming. Genial in manner and temperament, endowed with sturdy Scots common sense, he got on well with his colleagues and students.\nLet us end by quoting Hodge's own assessment of how the position of geometry changed from the time he was an undergraduate at Cambridge\n[\n12\n]\n:-\nThe last thirty years\n[1925\nto\n1955]\nhave seen an enormous improvement in the position of geometry as a branch of mathematics, or, rather, have seen the re-integration of geometry into the main fabric of mathematics. Indeed, one can go further and say that with the restoration of geometry to its rightful place in the mathematical scheme the process of fragmentation which had been doing so much harm to mathematics has been reversed, and we may look forward to the day in which there are no longer analysts, algebraists, geometers and so on, but simply mathematicians. Mathematical research has two aspects, motivation and technique, and when the latter gains control the result is apt to be excessive specialisation. The revolution of geometrical thought, and the reinstatement of geometry as one of the major mathematical disciplines, have helped to bring about a unification of mathematics which we may justly regard as one of the major contributions of the last quarter century to the subject"
}