{
  "nome_completo": "William Jack",
  "nome_curto": "William Jack",
  "ano_nascimento": "1834",
  "ano_morte": "1924",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jack_William/",
  "lugar_nascimento": "Stewarton, Ayrshire, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "William Jack\n's father, Robert Jack, came from Irvine in Ayrshire. William attended Irvine Academy, and from there he went to the University of Glasgow. He graduated M.A. in\n1853\n, then continued his education at the University of Cambridge. He was elected to a fellowship at Peterhouse, and was awarded a second degree of M.A. from Cambridge in\n1859\n.\nJack had a surprisingly varied career. In\n1860\nhe was appointed HM Inspector of Schools for the south-west district of Scotland. He became one of six inspectors of schools in the whole of Scotland. He held this position for six years before, in\n1866\n, accepting the chair of Natural Philosophy at Owen's College, Manchester\n[\n1\n]\n:-\nOwen's College then had only\n113\nstudents, and it occupied an old house in Quay Street which had belonged to Richard Cobden.\nHis next move was a rather surprising one for, in\n1870\n, he left his Professorship at Manchester to take up an appointment as editor of the\nGlasgow Herald\n[\n1\n]\n:-\nPerhaps the most vivid memory of his editorship was the outbreak of the Franco-Prussian War, tidings of which reached the office in Buchanan Street on a well-remembered Glasgow Fair Saturday.\nWhile holding this post he was elected a fellow of the\nRoyal Society of Edinburgh\non\n3\nMay\n1875\n. He was proposed for the fellowship by\nSir William Thomson\n(\nLord Kelvin\n)\n, James Thomson Bottomely, Allen Thomson, and\nPeter Guthrie Tait\n. Jack served on the council of the Society from\n1888\nto\n1891\n. In the same year that he was elected to a fellowship of the\nRoyal Society of Edinburgh\n, Jack was honoured with the award of an LL.D. by the University of Glasgow.\nIn fact Jack held the editorship of the\nGlasgow Herald\nfor six years before moving to London in\n1876\nto take up a position with the publisher Macmillan & Co\n[\n1\n]\n:-\n... an occupation in which he was thrown into contact with many of the best-known literary men of the day.\nIn\n1879\nJack was appointed to the Chair of Mathematics at the University of Glasgow. He held this post for\n30\nyears until he retired in\n1909\n.\nGeorge Alexander Gibson\n, Professor of Mathematics in Glasgow Technical College, was appointed to the Chair of Mathematics in Glasgow University, in succession to Jack in September\n1909\n. It is worth noting that\nGibson\nhad been an assistant of Jack's at the University before he took up the appointment at Glasgow Technical College. In the year after Jack's retirement, the William Jack Prize was founded in commemoration of his services to Glasgow University. The following announcement was made:-\nAt the University of Glasgow a portrait of Professor William Jack was recently unveiled. In commemoration of his fifty years of service as teacher of mathematics, a fund of three hundred pounds has been secured, the income of which will be known as the William Jack prize. It will be awarded to the writer of the most meritorious thesis for the degree of doctor of science in mathematics at the University of Glasgow.\nLet us note that\nMacRobert\n, who succeeded\nGibson\nas professor of Mathematics at Glasgow University himself won the William Jack Prize in\n1916\n.\nJack married Agnes Jane Nichol, the daughter of John Pringle Nichol, Regius Professor of Astronomy at the University of Glasgow and the sister of John Nichol, Regius Professor of English Literature at the same University. Agnes died in\n1901\n.\nWilliam Jack was elected an honorary member of the\nEdinburgh Mathematical Society\nin March\n1902\n."
}