{
  "nome_completo": "Witold Hurewicz",
  "nome_curto": "Witold Hurewicz",
  "ano_nascimento": "1904",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hurewicz/",
  "lugar_nascimento": "Łódź, Russian Empire (now Poland)",
  "lugar_morte": "Mérida, Mexico",
  "biografia": "Witold Hurewicz\n's father, Mieczyslaw Hurewicz, was an industrialist. Mieczyslaw was born in Wilno, Poland on\n4\nApril\n1872\nto Serge Hurewicz and Fannie Eisenstat. He married Katarzyna Finkelsztain\n(\nborn Bila Tserkva, Russian Empire,\n26\nApril\n1877)\non\n4\nSeptember\n1900\nat Warsaw, Poland. Mieczyslaw and Katarzyna Hurewicz had two children, Stefan\n(\nborn\n3\nOctober\n1901\nat Łódź, Poland\n)\nand Witold\n(\nthe subject of this biography\n)\n. The family was Jewish.\nWitold attended elementary school in Łódź in a Russian controlled Poland but with World War I beginning before he had begun secondary school, major changes occurred in Poland. At the outbreak of war, the Hurewicz family left Łódź and travelled to Moscow where Witold attended secondary school from\n1914\nto February\n1919\n. In August\n1915\nthe Russian forces which had held Poland for many years withdrew. Germany and Austria-Hungary took control of most of the country and the University of Warsaw was refounded and it began operating as a Polish university. Rapidly a strong school of mathematics grew up in the University of Warsaw, with\ntopology\nbeing one of the main topics. The Hurewicz family returned to Łódź in February\n1919\nand Witold completed his secondary school studies at the Oswiata\nGymnasium\nin that city. He passed the matriculation examination in May\n1921\nand graduated from the Oswiata Gymnasium. Although Hurewicz knew by this time that he wanted to specialise in mathematics and fully understood that there was a vigorous school of mathematics in Poland, nevertheless he chose to go to Vienna to continue his studies. He left Łódź to travel to Vienna on\n16\nJuly\n1921\n.\nIn Vienna, he studied under\nHans Hahn\n, receiving a Ph.D. in\n1926\nfor his thesis\nÜber eine Verallgemeinerung des Borelschen Theorems\nⓉ\n(\nOn a generalization of Borel's theorem\n)\n.\nKarol Borsuk\nexplains how the Vienna school of mathematics determined the direction of Hurewicz's research\n[\n5\n]\n:-\nAt that time Vienna was a very prosperous place for mathematics, and besides\nHahn\n(\nwho authored the excellent exposition 'Theorie der reellen Funktionen'\nⓉ\n(\nTheory of real functions\n)\n)\n, there were also many other outstanding mathematicians, including N Hofreiter and\nW Wirtinger\n. Under\nHahn\n's powerful influence, an active mathematics research centre of set theory formed in Vienna. Among the many eminent set theorists there were\nKarl Menger\n, one of the creators of dimension theory, and his colleagues\nKurt Gödel\n(\nwho consequently became famous as one of the most thorough investigators of the principles of set theory\n)\n, Georg Nöbeling, and\nAbraham Wald\n. In this environment Hurewicz turned to set theory.\nAlthough\nBorsuk\ngives a good indication of\nHahn\n's Vienna School in this quote, it is a little confusing since not all those mentioned were teaching there when Hurewicz was a student.\nWilhelm Wirtinger\nwas appointed to a chair at the University of Vienna in\n1905\nand\nHahn\nwas appointed in\n1921\n.\nKarl Menger\nentered the University of Vienna in\n1920\nto study physics but changed to write a doctoral thesis on dimension advised by\nHahn\nwhich he completed in\n1924\n. Nikolaus Hofreiter\n(1904\n-\n1990)\nstudied from\n1923\nin Vienna with\nHans Hahn\n,\nWilhelm Wirtinger\n, Emil Müller and Philipp\nFurtwängler\n. He was a student at the same time as Hurewicz and was awarded his doctorate in\n1927\n.\nAbraham Wald\nentered the University of Vienna in\n1927\nto study with\nKarl Menger\nand was awarded his doctorate in\n1929\n.\nHurewicz began to work on extending theorems of\nMenger\nand\nUrysohn\non dimension, which they had proved for Euclidean spaces, to separable metric spaces. To do this he had to produce new techniques and he began to publish his results in a series of papers. The first few are:\nÜber schnitte von Punktmengen\nⓉ\n(\nOn sections of sets of points\n)\n(1926)\n,\nStetige bilder von Punktmengen\nⓉ\n(\nContinuous images of point sets\n)\n(1926)\n,\nGrundiss der Mengerschen Dimensionstheorie\nⓉ\n(\nBasics of Menger's theory of dimension\n)\n(1927)\n,\nNormalbereiche und Dimensionstheorie\nⓉ\n(\nNormal ranges and dimension theory\n)\n(1927)\n,\nStetige bilder von Punktmengen.\nII\nⓉ\n(\nContinuous images of sets of points. II\n)\n(1927)\n,\nVerhalten separabler Räume zu kompakten Räumen\nⓉ\n(\nThe behavior of separable spaces and compact spaces\n)\n(1927)\n, and\nÜber Folgen stetiger Funktion\nⓉ\n(\nOn sequences of continuous functions\n)\n(1927)\n. As\nBorsuk\nwrites that, through these papers\n[\n4\n]\n:-\n... Hurewicz became known as one of the creators of dimension theory, next to\nMenger\nand\nUrysohn\n.\nHe was awarded a Rockefeller scholarship which allowed him to spend the year\n1927\n-\n28\nin Amsterdam. He remained in Amsterdam being appointed as a\ndocent\nand an assistant to\nL E J Brouwer\nfrom\n1928\nto\n1936\n.\nSamuel Eilenberg\nwrites about this period in\n[\n6\n]\n:-\nI first met Hurewicz when I was a student at the University of Warsaw. It was around\n1932\n-\n1933\n. To me he was an idol, a Jew from Poland who became a prominent world mathematician in a field I was in love with: an ideal to admire and to follow. Hurewicz was then in Holland and came to Warsaw almost once a year. We talked about mathematics, and I discussed what I was doing. He was supportive and helpful. Once when I proved something good, I wrote to him and received a very congratulatory reply. I still have that letter. At the same time I met\nLefschetz\nwho visited Warsaw on several occasions. We all three met in Oslo in\n1936\non the occasion of the International Mathematical Congress. At that time my future was discussed, and it was agreed that I should visit Western Europe first\n(\nParis, Zürich, Oxford, and Cambridge\n)\nbefore moving to America. In the fall of\n1936\nI started implementing this plan and went to Paris for a six-month stay. I was helped in various ways by Professor\nWacław Sierpiński\n. At the time Hurewicz was already in America.\nHe was given study leave for a year which he decided to spend in the United States. In September\n1936\nhe sailed from Rotterdam to New York on the\nStatendam\n. He visited the Institute for Advanced Study in Princeton and spent the year\n1936\n-\n37\nas a fellow there. He decided to remain in the United States and not return to his position in Amsterdam but he came back to Europe in the summer of\n1937\n, returning from Le Havre to New York on the SS President Roosevelt in October\n1937\n. Given the impending war in Europe this was clearly a wise decision. He returned to the Institute for Advanced Study in Princeton and, in January\n1938\n, he applied for citizenship of the United States. At this time he was living at\n1\nEvelyn Place, Princeton. He describes himself as having brown hair, brown eyes, height\n5\nft\n6\nin, weight\n145\nlbs, of Hebrew race and Polish nationality. He remained at the Institute until\n1939\nalthough he again visited Europe in the summer of\n1938\n, returning to New York from Le Havre in September of that year on the Champlain. In April\n1939\nhe went with his colleague Henry Wallman to meet his friend\nSamuel Eilenberg\nwhen he arrived in New York on the SS Manhattan.\nEilenberg\nwrites\n[\n6\n]\n:-\nI arrived to New York on April\n27\n,\n1939\n, and there at the pier were Hurewicz and Wallman to take me by car for about ten days to Princeton, which was then the undisputed mathematical mecca of the world. On the way we stopped for a snack, and I was introduced to cinnamon toast, which just became a big fad. I was also introduced to car trouble, as the lights refused to work when we were ready to continue.\nAfter his years at Princeton, Hurewicz was appointed first to the University of North Carolina being an assistant professor there from\n1939\nto\n1942\n. His parents, Mieczyslaw and Katarzyna Hurewicz, sailed to New York from Rotterdam on the Niew-Amsterdam in April\n1939\n. They returned to Europe but sailed from Genoa, Italy to New York in June\n1940\non the SS Manhattan. His brother Stefan also emigrated to the United States via the Philippines in January\n1941\n. This route via the Philippines was a common one for Jews fleeing Nazi persecution. Hurewicz was registered for the draft on\n16\nFebruary\n1942\n. During World War II he contributed to the war effort with research on applied mathematics, in particular the work he did on servomechanisms at that time was classified because of its military importance. He was still officially on the staff of the University of North Carolina from\n1942\nto\n1945\nalthough he was given leave of absence for government service. In fact he was promoted to Associate Professor in\n1942\n. He did have time to accept the position of Visiting Professor at Brown University, Providence, Rhode Island from January\n1943\nto June\n1944\nliving at\n1\nMegee, Providence. He gave a series of lectures at Brown University in\n1943\nand these were published in mimeographed form by Brown University as\nOrdinary\ndifferential equations\nin the real domain with emphasis on geometric method\n. The notes covered existence theorems, linear systems, and geometrical aspects of non-linear systems in the plane. During\n1944\n-\n45\nhe worked at the Radiation Laboratory at the Massachusetts Institute of Technology in Cambridge, Massachusetts.\nFrom\n1945\nuntil his death he worked at the Massachusetts Institute of Technology. He was an Associate Professor of Mathematics there from\n1945\nto\n1948\nwhen he was promoted to full professor. He lived at\n993\nMemorial Drive, Cambridge, Massachusetts with his mother who was now calling herself Catherine. In September\n1950\nhe attended the International Congress of Mathematicians at Cambridge, Massachusetts and delivered the invited plenary lecture\nHomology and\nHomotopy\nin the Topology Section of the Congress.  During the summer of\n1953\nhe was in Paris, lecturing on 'Homotopy' at the Collège de France, then flying back from Paris to Boston on\n7\nAugust on Air France. During the autumn of\n1953\nhe again visited the Institute for Advanced Study in Princeton. He also spent the summer of\n1954\nvisiting Europe, attending the International Congress of Mathematicians in Amsterdam from\n2\nSeptember to\n9\nSeptember, then visiting Paris from where he flew back to Boston on\n16\nSeptember on Air France. Hurewicz died falling off a ziggurat\n(\na Mexican pyramid\n)\nwhile on a conference outing at the 'International Symposium on\nAlgebraic Topology\n' in Mexico. His fall was on the\n4\nSeptember\n1956\nand he was taken to the medical centre in Mérida, Mexico with serious injuries, dying two days later. The death certificate, signed by Dr Fernando Guzmán-Espinoso, gives the cause of death as \"traumatic and hemorrhagic shock resulting from severe fractures.\" In\n[\n1\n]\nit is suggested that his legendary absentmindedness was a factor:-\nHurewicz, who never married, was a highly cultured and charming man, and a paragon of absentmindedness, a failing that probably led to his death.\nEilenberg writes\n[\n6\n]\n:-\nWhen Hurewicz died in Mérida after the Mexico City conference of\n1956\n, I and several other participants were still in Mexico City. I remember sitting with a group of friends in the gardens of a hotel\n(\na converted cloisterlike seventeenth-century hospital\n)\nwhen the news arrived. It was a black day.\nAt his brother Stefan's request, Hurewicz was cremated and his ashes were shipped back to Mount Auburn Cemetery, Cambridge, Massachusetts. Rather strangely, it is noted on his death certificate that, \"Neither a United States passport nor any other evidence of citizenship of the deceased was found among his personal effects.\"\nAs we have already noted, Hurewicz's early work was on set theory and topology and\n[\n1\n]\n:-\n... a remarkable result of this first period\n[1930]\nis his topological embedding of separable metric spaces into compact spaces of the same\n(\nfinite\n)\ndimension.\nIn the field of\ngeneral topology\nhis contributions are centred around dimension theory. He wrote, in collaboration with Henry Wallman, an important text\nDimension theory\npublished in\n1941\n. The authors write in the Preface:-\nIn this book it has been the aim of the authors to give a connected and simple account of the most essential parts of dimension theory. Only those topics were chosen which are of interest to the general worker in mathematics as well as the specialist in topology. Since the appearance of\nKarl Menger\n's well-known 'Dimensions theorie' in\n1928\n, there have occurred important advances in the theory, both in content and in method. These advances justify a new treatment, and in the present book great emphasis has been laid on the modern techniques of function spaces and mappings on spheres. The algebraically minded reader will find in Chapter VIII a concise exposition of modern\nhomology\ntheory, with applications to dimension. Historical references are made solely for the guidance of the beginning student, and no attempt has been made to attain completeness in this respect.\nA reviewer writes that the book:-\n... is truly a classic. It presents the theory of dimension for separable metric spaces with what seems to be an impossible mixture of depth, clarity, precision, succinctness, and comprehensiveness.\nKarol Borsuk\nwrites\n[\n5\n]\n:-\n... for separable metric spaces, the book by Hurewicz and Wallman remains a model of clarity and strict parallels between the theory and the geometric insight. Their book also contains algebraic topology notions and methods introduced to dimension theory by\nP S Aleksandrov\n.\nIn addition to this book, Hurewicz is best remembered for two remarkable contributions to mathematics, his discovery of the higher homotopy groups in\n1935\n-\n36\n, and his discovery of exact sequences in\n1941\n. His work led to homological algebra. It was during Hurewicz's time as\nBrouwer\n's assistant in Amsterdam that he did the work on the higher homotopy groups\n[\n1\n]\n:-\n... the idea was not new, but until Hurewicz nobody had pursued it as it should have been. Investigators did not expect much new information from groups, which were obviously commutative ...\nHurewicz had a second textbook published, but this was not until\n1958\nafter his death.\nLectures on ordinary differential equations\nwas a reprinting, with minor revisions, of the mimeographed notes of his Brown University lectures. Perhaps it is worth noting that the mimeographed notes had been reissued by the Mathematics department of the Massachusetts Institute of Technology in\n1956\n. This textbook is a beautiful introduction to ordinary differential equations which again reflects the clarity of his thinking and the quality of his writing.\nLet us end our biography of Hurewicz by quoting from the Preface to\n[\n2\n]\nwritten by\nKrystyna Kuperberg\n:-\nWitold Hurewicz is known for his contributions to dimension theory, algebraic topology\n(\nmainly, the\n1930\ns papers on homotopy theory and the work on fibrations\n)\n, and applied mathematics. Among his published works are two excellent books ... Both books, beautifully written in a clear and concise manner so characteristic of Hurewicz, are continuously popular, and have been reprinted more than once. ..."
}