{
  "nome_completo": "Wolfgang Alt",
  "nome_curto": "Wolfgang Alt",
  "ano_nascimento": "1947",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alt/",
  "lugar_nascimento": "Hilden, Mettmann, Germany",
  "lugar_morte": null,
  "biografia": "Wolfgang Alt\nwas the son of Willy Alt\n(1909\n-\n1997)\nand Auguste Leonie Ingenerf\n(1918\n-\n2006)\nknown as 'Leonie'. Willy Alt, son of Wilhelm Alt\n(1884\n-\n1982)\nand Elisabetha Weissmann\n(1885\n-\n1969)\n, born\n27\nAugust\n1909\nin Heltersberg, Germany, had entered the University of Würzburg in\n1931\n. There he studied mathematics, physics and astronomy and was awarded a doctorate in\n1937\n. From\n1946\nhe worked at the Leibniz Gymnasium in Düsseldorf. He married Auguste Leonie Ingenerf on\n25\nAugust\n1944\nin Hilden, Mettmann. Leonie Ingenerf was the daughter of a confectionery wholesaler who had moved to Hilden in\n1907\nas a sales assistant, bought a house there and opened a café. Leonie was born in that house on\n15\nOctober\n1918\nand by the time of her marriage was working as a chemical laboratory assistant. From\n1958\nWilly Alt taught at the Schloss Gymnasium in Benrath, close to Hilden, where he set up a school observatory. He retired as a teacher in\n1974\nbut continued as head of the observatory until\n1979\n.\nWilly and Leonie Alt had two sons: Hans Wilhelm Alt was born in\n1945\nand Wolfgang Alt, the subject of this biography, was born in\n1947\n. Before continuing with Wolfgang Alt's biography, let us give some details of his older brother Hans Wilhelm Alt since he also became a mathematician. Hans Wilhelm attended the Helmholtz-Gymnasium in Hilden and was awarded his Abitur in\n1965\n. He then studied mathematics at the University of Göttingen and undertook research for his doctorate advised by Erhard Heinz\n(1924\n-\n2017)\n. He was awarded his doctorate in\n1971\nfor his thesis\nVerzweigungspunkte von H-Flächen\nⓉ\n(\nBranching points of H-surfaces\n)\n. He became a Professor of Applied Mathematics at the Institute for Applied Mathematics at the University of Bonn. He retired in\n2010\nand in the following year was made an honorary professor at the Technical University of Munich. Some of his major contributions are given in\n[\n14\n]\n:-\nHe managed to solve problems with so-called free margins. Such mathematical modelling describes, for example, the interface between different phases of a liquid, whose shape and position and possibly even their presence are initially unknown. He wrote a number of important contributions to the variational theory of elliptic and parabolic free boundary value problems. In particular, the publication on nonlinear parabolic equations written together with Stephan Luckhaus and the ground-breaking work on the beam problem received worldwide attention.\nWolfgang Alt was a couple of years younger than his brother and, influenced by him, followed a similar school and university career. Like his brother, he attended the\nHelmholtz\n-Gymnasium in Hilden. This school, founded in\n1910\n, was named after\nHermann von Helmholtz\nand originally specialised in mathematics and science. From\n1923\nthe school became an Oberrealschule and students could take the general university entrance qualification. Alt graduated from the school in\n1966\nand, again like his brother, studied mathematics at the Georg-August University of Göttingen. He graduated from the University of Göttingen in\n1971\nwith a Diploma in Mathematics and then went to the University of Münster to study for his doctorate.\nAt the University of Münster, Alt's thesis advisor was Willi Jäger. Jäger, who was born on\n15\nAugust\n1940\nin Kschellowitz, Bohemia, had studied for his doctorate at the Ludwig-Maximilians University of Munich advised by Erhard Heinz. Let us note that Wolfgang Alt's older brother Hans Wilhelm Alt had also had Erhard Heinz as his thesis advisor. Jäger had been awarded his doctorate in\n1966\nfor his thesis\nÜber das Dirichlet-Problem in Außengebieten für die Schwingungsgleichung\nⓉ\n(\nOn the Dirichlet problem in external regions for the oscillation equation\n)\nand, after spending a year at the\nCourant\nInstitute in New York City, had been appointed as a professor of mathematics at the University of Münster in\n1970\n.\nHans Engler describes meeting Wolfgang Alt in\n1971\nnot long after he began his doctoral studies in Münster\n[\n6\n]\n:-\nWolfgang and I met on\n12\nOctober\n1971\nshortly after\n11\n:\n15\nin the morning in the M\n1\nlecture hall at the University of Münster. Or rather, around\n400\nfreshmen in the Calculus I class got to know Wolfgang, and I was among them. Wolfgang and his brother Hans Wilhelm were the assistants who supervised this lecture for Willi Jäger. In this beginner's lecture, metric spaces were introduced before real numbers, or perhaps a week later. Wolfgang and Hans Wilhelm introduced us to these abstract concepts using all possible means, for example by decorating exercise sheets and scripts with the adventures of mathematically inspired stick figures.\nWolfgang Alt received his doctorate from the University of Münster in\n1973\nfor his thesis\nRegularitätssätze für singuläre Integrale mit gemischten Homogenitäten und ihre Anwendung auf Integraldarstellungen in der komplexen Funktionentheorie mehrerer Variabler\nⓉ\n(\nRegularity Theorems for Singular Integrals with Mixed Homogeneities and Their Application to Integral Representations in Complex Multivariable Function Theory\n)\non the functions of several complex variables. Alt published two papers related to his thesis, both appearing in\n1974\n, namely:\nSinguläre Integrale mit gemischten Homogenitäten auf Mannigfaltigkeiten und Anwendungen in der Funktionentheorie\nⓉ\n(\nSingular integrals with mixed homogeneities on manifolds and applications in function theory\n)\nand\nHölderabschätzungen für Ableitungen von Lösungen der Gleichung\n∂\nˉ\nu\n=\nf\n\\bar\\partial u = f\n∂\nˉ\nu\n=\nf\nbei streng pseudokonvexem Rand\nⓉ\n(\nHölder estimates for derivatives of solutions of the equation ∂u = f with a strictly pseudoconvex boundary\n)\n. In the first of these he gives the acknowledgement:-\nI would especially like to thank Prof W Jäger and Prof N Kerzman for their suggestions.\nWe note that Norberto Kerzman\n(1943\n-\n2019)\nwas born in Buenos Aires, Argentina, obtained his Ph.D. from New York University in\n1970\nand then began his career at Princeton and MIT. The second of Alt's papers has the acknowledgement:-\nI would especially like to thank Prof Jäger and Prof Lieb for suggestions and advice in completing my dissertation, the second part of which resulted in this work.\nWe note that Ingo Lieb\n(\nborn\n4\nSeptember\n1939\nin Hanover\n)\nstudied physics and mathematics at the University of Göttingen. He was advised by Hans Grauert and awarded his doctorate in\n1965\n. After being an assistant at Göttingen from\n1965\nto\n1971\n, during which time he got to know Wolfgang Alt, he spent\n1971\n-\n72\nat Princeton before being appointed as a professor at the University of Münster.\nHans Engler writes\n[\n6\n]\n:-\nI began my thesis in the fall of\n1974\n, and Wolfgang was my immediate supervisor. The support was very good - he suggested directions that were promising, warned against other directions that promised difficulties or little success, and gave me a lot of leeway. Maybe too much, the work ended up being quite long.\nWilli Jäger became professor of applied mathematics at the Heidelberg University in\n1974\n. Alt became an assistant at Heidelberg University. Hans Engler writes\n[\n6\n]\n:-\nFrom the spring of\n1975\n, most of the members\n(\nassistants, doctoral students, many graduate students\n)\nof the Jäger working group moved to Heidelberg. We all spent a lot more time together than before in Münster. Hikes in the Odenwald and bike tours in the Palatinate wine regions, football games on a meadow near the institute, seminar weeks in the Black Forest at the Fehrenbacher Hof and in the Vosges, trips together to conferences, and I have very fond memories of an election party in\n1976\nat the house of Wolfgang and his then wife Inge on Monchhofstrasse\n(\nwhen Helmut Schmidt was re-elected\n)\n.\nAlt began to move towards applied mathematics topics and his next two publications were on periodicity. The first was\nSome periodicity criteria for functional differential equations\n(1978)\nwhich has the following Abstract:-\nUsing the classical fixed point index for cones in a\nBanach\nspace some criteria for the existence of periodic solutions of autonomous functional differential equations\nx\n˙\n(\nt\n)\n=\nF\n(\nx\nt\n)\n\\dot{x}(t) = F(x_t)\nx\n˙\n(\nt\n)\n=\nF\n(\nx\nt\n​\n)\nare derived, regarding the asymptotic behaviour of F near zero and infinity. The general result is applied to equations with distributed time delay.\nHe extended this work in the paper\nPeriodic solutions of some autonomous differential equations with variable time delay\nwhich was published in the\nProceedings\nof the Summer School on 'Functional differential equations and approximation of fixed points' held at the University of Bonn in July\n1978\n.\nThis work on periodicity was only a diversion from the main direction that his interests were going, for, beginning in\n1975\n, he was involved with studying cell biology at the Deutsches Krebsforschungszentrum, the German Cancer Research Centre, in Heidelberg. This Research Centre had been founded in\n1964\nand became a member of the Association of National Research Centres in\n1975\n. Alt worked on a biased random walk models for chemotaxis and was awarded his\nhabilitation\nfrom the University of Heidelberg in\n1980\nhaving submitted the thesis\nVergleichsätze für quasilineare elliptisch-parabolische Systeme partieller Differentialgleichungen\nⓉ\n(\nComparison theorems for quasilinear elliptic-parabolic systems of partial differential equations\n)\n. Hans Engler writes\n[\n6\n]\n:-\nI had proofread his habilitation thesis from this time, in which his theory on biased random walk models for chemotaxis was developed in detail, and I clearly remember the impression that I had never seen anything like it before: something new under the sun.\nIn\n1978\n, Alt became a co-founder of SFB\n123\n\"Stochastic, Mathematical Models\" at the University of Heidelberg which was set up with Willi Jäger as its chairman. A conference on 'Models of Biological Growth and Spread', was held at the German Cancer Research Centre in Heidelberg and at the Institute of Applied Mathematics of the University of Heidelberg,\n16\n-\n21\nJuly\n1979\n. The Proceeding\n[\n9\n]\nwere published in\n1980\n:-\nThe main theme of the conference was the mathematical representation of biolog­ical populations with an underlying spatial structure. An important feature of such populations is that they and/or their individual com­ponents may interact with each other. Such interactions may be due to external disturbances, internal regulatory factors or a combination of both. Many biological phenomena and processes including embryogenesis, cell growth, chemotaxis, cell adhesion, carcinogenesis, and the spread of an epidemic or of an advantageous gene can be studied in this context. Thus, problems of particular importance in medicine\n(\nhuman and veterinary\n)\n, agriculture, ecology, etc. may be taken into consideration and a deeper insight gained by utilising\n(\nmore\n)\nrealistic mathematical models. Since the intrinsic biological mechanisms may differ considerably from each other, a great variety of mathematical approaches, theories and techniques is required. The aims of the conference were\n(\ni\n)\nTo provide an overview of the most important biological aspects.\n(\nii\n)\nTo survey and analyse possible stochastic and deterministic approaches.\n(\niii\n)\nTo encourage new research by bringing together mathematicians interested in problems of a biological nature and scientists actively engaged in developing mathematical models in biology.\nAlt played a large role in organising the conference and his paper\nBiased random walk models for chemotaxis and related diffusion approximations\n, closely related to his habilitation, was published in the\nProceedings\nin\n1980\n. This paper has the Abstract:-\nStochastic models of biased random walk are discussed, which describe the behaviour of chemosensitive cells like bacteria or leukocytes in the gradient of a chemotactic factor. In particular the turning frequency and turn angle distributions are derived from certain biological hypotheses on the background of related experimental observations. Under suitable assumptions it is shown that solutions of the underlying differential-integral equation approximately satisfy the well-known Patlak-Keller-Segel diffusion equation, whose coefficients can be expressed in terms of the microscopic parameters. By an appropriate energy functional a precise error estimation of the diffusion approximation is given within the framework of singular perturbation theory.\nAlt spent the year\n1982\n-\n83\nin the United States as a visiting associate professor at the University of Utah in Salt Lake City. The\nAmerican Mathematical Society\nheld its\n804\nth meeting at the University of Utah in Salt Lake City\n29\n-\n30\nApril\n1983\n. A Special Session was held on\nNonlinear elliptic and parabolic partial differential equations\nand Alt was invited to lecture at this session.\nIn\n1986\nAlt was appointed as a professor at the University of Bonn and became the founder and head of the \"Theoretical Biology\" department in the Faculty of Mathematics and Natural Sciences at the University of Bonn. Diedrik Menzel addresses Alt as he writes in\n[\n12\n]\n:-\nBecause of the interdisciplinary nature of your field of work, you could just as easily have been based at the Zoological Institute when you were appointed to Bonn in\n1986\n. We are glad that this did not happen then. We owe it to this fortunate circumstance that you have stood by us as a reliable and lovable colleague in all matters relating to the Institute over the many years.\nHeike Lischke was a diploma student at Bonn when Alt arrived. She tells us in\n[\n11\n]\nabout her first interactions with Alt:-\nA new professor had recently moved into our rooms down on Kirschallee. We were a small group of biology graduate students and doctoral students of other professors who were struggling with all sorts of biological modelling. ... In my diploma thesis, I had been trying for some time to get my model to reproduce the plankton data in the Haltern reservoir, with moderate success. At first we were a bit sceptical about the new \"office roommate\", after all the new professor belonged to the exotic species of \"mathematician\". But we quickly realised that he didn't fit our stereotype of the distinguished professor or unworldly mathematician; he was friendly, and rather hip and alternative. Some of his hallmarks were colourful scarves and constant consumption of carrots.\nMy first contact with him made me I wanted to sink into the ground. He happened to be passing by the copier just as I was trying to secretly scrape the smudged film off the rollers, which had stuck there due to my improper handling. Instead of continuing without comment, he offered to help me too!\nA few days later I wanted to make a pot of tea for all of us. The kettle that we used for our immense tea consumption was in his office. I noticed he wasn't there right then. So I turned on the stove, emptied the tea strainer with the old, dried-out tea, and briefly went back to my terminal. Shortly afterwards, a rather irritated Wolfgang stood in our room and asked: \"Do any of you know where my special\n(\nXY\n)\ntea blend has gone? I was just about to make myself a nice cup and had already filled the tea strainer?\" My second sinking into the ground ...\nWhat is astonishing is that despite this somewhat unfortunate start, Wolfgang then set the course for my career, as he found me the doctoral position in Heidelberg\n(\nof all things in mathematics\n)\n, supervised my dissertation from a distance, and also had a hand in arranging a postdoc position for me in Zurich.\nVincenzo Capasso writes in\n[\n5\n]\nabout Alt:-\nWhat I have always liked a lot of Wolfgang, has been his genuine interest for biology, though with a deep competence in advanced methods of mathematics. Different from many biomathematicians, he has always been method independent, since at the centre of his scientific concern has been the biological problems.\nHis communication skills being excellent, once, for a lecture of his on chemotaxis, he impressed me and the whole audience by carrying in the lecture hall a basin with two real insects swimming in water that he had just taken from a pond!\nHe has been always a source of enthusiasm for science at large, with a spirit of curiosity that many time professional academicians loose too early, moved by career and competition to fast publishing of about anything.\n...\nI like to mention that we also share a great interest in supporting young scientists; Wolfgang is very special as a teacher putting himself all the time aside if required, to emphasise the importance of the contribution by the young members of his team.\nThe University of Bonn is very lucky to have him among its faculty members, and all of us are grateful to Wolfgang for his strong and enthusiastic support to the interdisciplinary field of mathematical and theoretical biology.\nLet us give another tribute, this time from Michael Welter\n[\n15\n]\n:-\nWorking with you is always a pleasure; regardless of whether it is about the mathematics education of biology students or the history of the university.\nWhen I gave the mathematics lecture \"Mathematics in Biology\" for the first time in the winter semester of\n2006\n/\n07\n, you made it incredibly easy for me to get started. Your concept, which includes the interlinking of theoretical knowledge in mathematics and biology with applied project work, including on computers in small groups, was convincing from the start and has survived the not insignificant changes, which brought with it the change to the bachelor's and master's degree programmes.\nIn March\n1989\n, the workshop 'Biological motion' was held in Königswinter, Germany and the\nProceedings\nwere published in\n1990\nwith Wolfgang Alt and Gerhard Hoffmann as editors. The editors wrote the Preface and we give an extract\n(\nsee\n[\n17\n]\n)\n:-\nDuring the\n70\n's, when Biomathematics\n(\nbeyond Biomedical Statistics and Computing\n)\nbecame more popular at universities and research institutes, the problems dealt with came mainly from the general fields of 'Population Biology' and 'Complex Systems Analysis' such as epidemics, ecosystems analysis, morphogenesis, genetics, immunology and neurology. Since then, the picture has not considerably changed, and it seems that \"a thorough analysis of behaviour\" of single organisms and, moreover, of their mutual interactions, is far from being understood. On the contrary, mathematical modellers and analysts have been well-advised to restrict their investigations to specific aspects of 'biological behaviour', one of which is 'biological motion'.\n...\nThe idea for this Workshop, the Proceedings of which we now present, arose between\n1987\nand\n1988\n, when Gerhard Hoffmann from Würzburg and Hans Scharstein from Koln had reported on their work on Animal Physiology at the Biomathematical Colloquium organised by three colleagues in Bonn. In response, one of these, Wolfgang Alt, visited the Zoological Institute at Köln\n(\ngroup of Gernot Wendler\n)\nand was fascinated by a colloquium talk on ciliary motion presented by Hans Machemer from the Cell Physiology Department in Bochum, in particular by the demonstration of his famous plastic flagella model. Finally, coming into mind as participant of an interesting meeting on chemotaxis of leukocytes, Hans Gruler from the Biophysics Department in Ulm joint us and completed the group of five organisers. We soon developed the concept of a four-day Workshop on \"Modelling, Analysis and Simulation of Biological Motion\" and requested various scientists to assemble for a discussion of our main topic: \"Mechanisms and Control of Locomotion\". The selection of motile species taken into consideration was clearly influenced by the organisers' own research fields: predominantly unicellular organisms, blood and tissue cells, but also insects, crustaceans and even fish were placed 'on the table'.\n... the atmosphere during the Workshop was exciting, and it stimulated a continuous work from Thursday evening,\n16\nMarch, until Sunday morning,\n19\nMarch,\n1989\n, in the comfortable 'Stegerwaldhaus' of the Jakob-Kaiser-Stiftung placed at the little wine-growing village Königswinter on the Rhine, opposite to Bonn and at the foot of the 'Drachenfels'. Those who never can finish a discussion concluded the Workshop by a walk through the forest around this pleasant hill.\n...\n... the complex dynamical systems inducing the 'miracles' of naturally evolved 'biological motors'\n(\non the individual side\n)\nand resulting cooperative movements of organisms\n(\non the population side\n)\nrequire adequate mathematical theories and techniques to give insight into the underlying highly non-linear world of spatio-temporal phenomena. Therefore, it has been very fortunate for the Workshop to obtain generous financial, material and personnel support by the Research Program SFB\n256\non \"Non-linear Partial Differential Equations\" sponsored by the German Research Fond\n(\nDFG\n)\n.\nWolfgang Alt is a member of the Society for Mathematical Biology, of the German Society for the History and Theory of Biology, and of the\nGerman Mathematical Society\n. He has served as president of the European Society for Mathematical and Theoretical Biology.\nAlt has local history as a hobby and is a member of the Poppelsdorf History Association. We note that Poppelsdorf is a district of Bonn which contains the science departments of the University of Bonn. He has co-authored several books on the history of Poppelsdorf, including\nSpurensuche in Poppelsdorf: die kurfürstliche Zeit; ein Führer zu kulturhistorischen Rundgängen\nⓉ\n(\nSearch for clues in Poppelsdorf: the electoral period; a guide to cultural and historical tours\n)\n(2002)\n, and\nKirmes-Rausch in Poppelsdorf: Kulturgeschichte eines Bonner Volksfestes: Dokumente - Erinnerungen - Analysen - Deutungen\nⓉ\n(\nKirmes-Rausch in Poppelsdorf: Cultural history of a Bonn folk festival: documents - memories - analyses - interpretations\n)\n(2021)\n.\nLet us end this biography was this tribute from\nPhilip Maini\n[\n18\n]\n:-\nThe work that you and the Theoretical Biology group at Bonn have done has been outstanding and an inspiration to all of us in mathematical biology. It has always been exciting to visit Bonn and to talk with the group there and at conferences and meetings. In particular, talking with you about science or other things is always a pleasure."
}