{
  "nome_completo": "Wolfgang Krull",
  "nome_curto": "Wolfgang Krull",
  "ano_nascimento": "1899",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krull/",
  "lugar_nascimento": "Baden-Baden, Germany",
  "lugar_morte": "Bonn, Germany",
  "biografia": "Wolfgang Krull\n's father was Helmuth Krull and his mother was Adele Siefert Krull. Helmuth Krull had a dentist's practice in Baden-Baden and it was in that town that Krull attended school.\nAfter graduating from secondary school in\n1919\nhe entered the University of Freiburg. It was the custom in those days for students in Germany to move around various universities during their period of study and Krull was no exception. He spent time at the University of Rostock before moving to Göttingen in\n1920\n.\nFrom\n1920\nto\n1921\nhe studied at Göttingen with\nKlein\nbut was most influenced by\nEmmy Noether\n. He attended\nKlein\n's seminar in the session\n1920\n-\n21\nand he then returned to Freiburg and presented his doctoral thesis on the theory of elementary divisors in\n1922\n. Ring theory results from this thesis have recently been found important in the area of coding theory.\nAppointed as an instructor at Freiburg on\n1\nOctober\n1922\nhe was promoted to extraordinary professor in\n1926\n. He remained there until\n1928\nwhen he moved to Erlangen. His inaugural address on becoming a full professor at Erlangen was one which says much of how Krull saw mathematics. He saw the role of a mathematician as\n[\n1\n]\n(\nsee also\n[\n2\n]\nand\n[\n4\n]\n)\n:-\n... not merely ... finding theorems and proving them. He wants to arrange and group these theorems together in such a way that they appear not only as correct but also as imperative and self-evident. To my mind such an aspiration is an aesthetic one and not one based on theoretical cognition\nIf\nEmmy Noether\nhad the greatest influence on the topics which Krull would spend his life researching, it can be seen from this inaugural address that it was\nKlein\nwho had the greatest influence on Krull's large scale view of mathematics. In\n1929\nhe married Gret Meyer and they would have two daughters.\nThe ten years Krull spent in Erlangen were the most productive period of his career. Schoeneborn writes in\n[\n1\n]\n:-\nThe years Krull spent as a full professor in Erlangen were the high point of his creative life. About thirty-five publications of fundamental importance for the development of commutative algebra and\nalgebraic geometry\ndate from this period.\nAt Erlangen he was involved in university life as well as concentrating on his research, being elected Head of the Faculty of Science.\nIn\n1939\nKrull left Erlangen to take up a chair at Bonn. However, his career was disrupted by the Second World War which began shortly after Krull was appointed to the University of Bonn. During the war he undertook war duties, working in the naval meteorological service. When his war service had ended in\n1946\n, Krull took up again his post at the University of Bonn and he would remain there for the rest of his life. In this final period of his career Krull continued his high level of productivity\n(\nhe wrote\n50\npapers in his post-war years in Bonn\n)\nand also broadened his mathematical interests. He continued\n[\n1\n]\n:-\n... his earlier studies, but also dealt with other fields of mathematics:\ngroup theory\n,\ncalculus of variations\n,\ndifferential equations\n,\nHilbert spaces\n.\nKrull's first publications were on rings and algebraic extension fields. In\n1925\nhe proved the Krull-\nSchmidt\ntheorem for decomposing\nabelian groups\nof operators. He then studied\nGalois theory\nand extended the classical results on Galois theory of finite field extensions to infinite field extensions. In passing from the finite to the infinite case Krull introduced\ntopological\nideas.\nIn\n1928\nhe defined the Krull dimension of a commutative Noetherian ring and brought ring theory into in new setting in which he was able to show that the principal ideal theorem held. Perhaps the reason that the idea of the Krull dimension is such a natural concept is that it encapsulates in an abstract setting the analogues of geometric dimensions. The principal ideal theorem\n[\n2\n]\n:-\n... was quickly recognised as a decisive advance in\nNoether\n's programme of emancipating abstract ring theory from the theory of polynomial rings.\nKrull carried his work forward, defining further concepts which are today central to modern research in ring theory. In\n1932\nhe defined valuations which are today known as Krull valuations. He then wrote the remarkable treatise\nIdeal Theory\nwhich remains a beautiful introduction to ring theory but is simply a theory built from the results that Krull had himself proved. One could say that Krull had achieved the goal he had in some sense set himself in his Erlangen address and arranged his theory to be self-evident.\nAnother major topic in ring theory is the study of local rings, that is rings having a unique maximal ideal, and they are used in the study of local properties of algebraic varieties. The concept was introduced by Krull in\n1938\nand his fundamental results were developed into a major theory by mathematicians such as\nChevalley\nand\nZariski\n.\nHe supervised\n35\ndoctoral students, and rather remarkably,\n32\nof these were students whom he supervised after the end of World War II. Gray, in\n[\n2\n]\n, writes that Krull's papers are:-\n... marked by the profundity of his ideas, the rigour of his proofs, and also by a strong aesthetic sense.\nIndeed much of modern ring theory is still following the path which Krull took, building on the foundations which\nEmmy Noether\nhad laid."
}