{
  "nome_completo": "Yvonne Suzanne Marie-Louise Choquet-Bruhat",
  "nome_curto": "Yvonne Bruhat",
  "ano_nascimento": "1923",
  "ano_morte": "2025",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Choquet-Bruhat/",
  "lugar_nascimento": "Lille, France",
  "lugar_morte": "Mérignac, France",
  "biografia": "Yvonne Bruhat\nis also known by the name\nYvonne Fourès-Bruhat\nwhich she used while she was married to the mathematician Léonce Fourès. However, she is best known by the name\nYvonne Choquet-Bruhat\n, that she has used since she married her second husband Gustave Choquet. For simplicity, we will use the name Yvonne Bruhat throughout this biography. Yvonne Bruhat was the daughter of Georges Bruhat\n(1887\n-\n1945)\nand Berthe Hubert\n(1892\n-\n1972)\n. Georges Bruhat had been ranked first in the\nConcours d'agrégation\nin physics in\n1909\n. He was awarded his doctorate in physics before the outbreak of World War I in\n1914\n, was mobilised during the war, and then appointed to the University of Lille in\n1919\n. He was promoted to professor of physics at Lille in\n1921\n. He had married Berthe Hubert who had had been ranked first in the Concours d'agrégation in arts in\n1917\n. She went on to become a professor of philosophy. Georges and Berthe Bruhat had two children, a daughter Yvonne\n(\nthe subject of this biography\n)\nborn in\n1923\nand a son\nFrançois Bruhat\n(\nwho also has a biography in this archive\n)\nborn in\n1929\n. In\n1927\n, when Yvonne was under four years old, her father was appointed to the Faculty of Science in Paris so she was brought up in that city.\nYvonne Bruhat undertook her secondary school education in Paris. In\n1941\n, she entered the Concours General, a competition to determine the best pupils in the whole of France, and she won the silver medal for physics. Of course, by this time France was occupied by German troops. World War II had begun on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but over the following months France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and by June France had surrendered and fighting ended. Georges Bruhat had been appointed as deputy director of the École Normale Supérieure in\n1935\nand was appointed to the chair of physics there in\n1941\n, the previous holder of the chair having lost his position through a decision of the Vichy government. In\n1943\nYvonne Bruhat began her studies at the École Normale Supérieure de Jeunes Filles at Sèvres just outside Paris. This university for women was the partner institution of the École Normale Supérieure, on Rue d'Ulm. University studies in occupied Paris was difficult enough but tragedy struck the Bruhat family in\n1944\n[\n1\n]\n:-\nWhen the Gestapo arrested a student who was absent from Rue d'Ulm during the night of August\n4\nth\n,\n1944\n, they undertook a systematic search of the premises.\nRoger Apéry\n, who had been making false identity papers in his room, hurriedly burned all the compromising documents. The Gestapo took Mrs Bruhat and Mrs Baillou hostage, to exchange them for their husbands the next day; the cleaning woman, not realizing the implications, was complaining loudly about the ashes left in\nApéry\n's room. Bruhat and Baillou were deported, and Bruhat perished at Buchenwald.\nBaillou, mentioned in this quote, is Jean Baillou who was the general secretary of the École Normale Supérieure. Yvonne was in the middle of her studies when the tragedy happened. Speaking years later of this extremely difficult time she said\n[\n10\n]\n:-\nI was very protected, even too much, so that I could continue my studies. In a way\n[\nmy father\n]\ninfluenced me a lot, but then he was more interested in his son. He did not think that his daughter would become a leading scientist. He thought that I would be a good mother for my family, a high school teacher.\nShe dedicated the book\nGeneral Relativity and the Einstein Equations\n(2009)\nshe wrote many years later to:-\nGeorges Bruhat,\n1887\n-\n1944\n, who gave me the love of physics by his kindness and explanations, and after his death by his books. Berthe Bruhat, born Hubert,\n1892\n-\n1972\n, who always encouraged me to try to understand some of the world and to pursue scientific research.\nGeorges Bruhat's books include the four volume\nCours de physique générale\nⓉ\n(\nA general physics course\n)\n. Volume\n1\nis\nElectricity\n(1924)\n, Volume\n2\nis\nThermodynamics\n(1926)\n, Volume\n3\nis\nOptics\n(1930)\nand Volume\n4\nis\nMechanics\n(1934)\n. Let us add at this point that Yvonne's mother, Berthe Hubert Bruhat, published\nTraite de pedagogie generale\nⓉ\n(\nTreatise on general education\n)\nin\n1946\n.\nYvonne Bruhat graduated from the École Normale Supérieure de Jeunes Filles in\n1946\nand undertook research advised by\nAndré Lichnerowicz\n. From\n1946\nto\n1949\nwas an assistant at the École Normale Supérieure.  In\n1949\n-\n51\n, she was first a Research Assistant, then promoted to Research Associate, at the Centre National de la Recherche Scientifique. She was awarded her doctorate in\n1951\nfor her thesis\nThéorème d'existence pour certains systèmes d'équations aux dérivées partielles non linéaires\nⓉ\n(\nAn existence theorem for some systems of  nonlinear partial differential equations\n)\n. However, she had many papers published even before submitting her thesis. They were all published under the name Yvonne Fourès-Bruhat, since she had married the mathematician Léonce Guy Fourès who, like Bruhat, was undertaking research in Paris. He was awarded his doctorate in\n1951\nfor his thesis\nSur quelques points de la théorie des surfaces de Riemann\nⓉ\n(\nOn some points of the theory of Riemann surfaces\n)\n.\nBruhat's first four papers were published in\n1948\n:\nSur une expression intrinsèque du théorème de Gauss en relativité générale\nⓉ\n(\nOn an intrinsic expression of Gauss theorem in general relativity\n)\n;\n(\nwith\nAndré Lichnerowicz\n)\nSur un théorème global de réduction des\nd\ns\n2\nds^{2}\nd\ns\n2\nstatiques généraux d'Einstein\nⓉ\n(\nOn a global reduction theorem of ds\n2\ngeneral statics of Einstein\n)\n;\nSur l'intégration du problème des conditions initiales en mécanique relativiste\nⓉ\n(\nOn the integration of the problem of the initial conditions in relativistic mechanics\n)\n; and\nThéorème global sur les\nd\ns\n2\nds^{2}\nd\ns\n2\nextérieurs généraux d'Einstein\nⓉ\n(\nA global theorem on ds\n2\n)\n. Further papers followed:\nThéorème d'existence pour les équations de la gravitation einsteinienne dans le cas non analytique\nⓉ\n(\nAn existence theorem for equations of Einstein's gravitation in the non-analytic case\n)\n(1950)\n;\nUn théorème d'existence sur les systèmes d'équations aux dérivées partielles quasi linéaires\nⓉ\n(\nAn existence theorem for systems of quasi linear partial differential equations\n)\n(1950)\n; and\nThéorèmes d'existence et d'unicité pour les équations de la théorie unitaire de Jordan-Thiry\nⓉ\n(\nExistence theorems and uniqueness for equations of the unitary theory of Jordan-Thiry\n)\n(1951)\n. In\n1952\n, in addition to two short papers, she published a major paper in\nActa mathematica\nwith the same title as her thesis\n[\n2\n]\n:-\nOne has to face difficult nonlinear partial differential equations in\nEinstein\n's theory of gravity. She carried out this task at a new level of mathematical rigour that she herself created. This led to a far-reaching enrichment of both mathematics and physics. ... Of very great significance is that Yvonne Bruhat's analysis enabled her to prove rigorously for the first time local-in-time existence and uniqueness of solutions of the\nEinstein\nequations.\nBruhat spent part of the academic year\n1951\n-\n1952\nand the academic year\n1952\n-\n53\nin the United States, at the Institute for Advanced Study in Princeton. Her husband, Léonce Fourès, was also a member of the Institute for Advanced Study in Princeton during the same period. Returning to France she was appointed to the Faculty of Science in Marseille in\n1953\n. Fourès was also appointed to Marseille. Bruhat and her husband were soon back at Princeton spending part of the academic year\n1955\n-\n56\nat the Institute for Advanced Study. She remained on the faculty in Marseille for five years before being appointed to the University of Reims in\n1958\n. She only held this position for one year before being appointed as a full professor at Faculty of Science in Paris in\n1960\n. On\n16\nMay\n1961\nshe married her second husband, Gustave Alfred Arthur Choquet\n(1915\n-\n2006)\n. He was a mathematician who had obtained his doctorate in\n1946\nand, from\n1950\n, had been a professor at the University of Paris. Here is an extract from his obituary\n[\n5\n]\n:-\nHe published more than\n160\nmathematical articles and\n11\nbooks. He made important contributions to a variety of fields: topology, measure theory, descriptive set theory, potential theory, and functional analysis. Two themes deserve particular mention. His monumental\n1953\n-\n4\npaper 'Theory of capacities' contains among many riches his celebrated capacitability theorem. A second great theme is his theory of integral representations in compact convex sets and weakly complete cones, now usually known as Choquet theory, which launched a huge development. The work on capacities and that on integral representations have both found many applications in analysis and probability. His personal distinction was allied in a remarkable way to great kindness and humanity. He was an inspiring teacher who gave generous encouragement and support to pupils and younger colleagues.\nBruhat was appointed to the Chair of Mechanics at the University of Paris VI, the Pierre and Marie Curie University, where her husband was also a professor. This University was established in\n1971\nwhen the University of Paris was divided into several separate universities. The Pierre and Marie Curie University was largely the old Faculty of Sciences, on the Jussieu Campus in the Latin Quarter of Paris. She held this chair until she retired in\n1992\n, becoming professor emeritus at that time.\nThe Institut des Hautes Études Scientifiques gives the following summary of Bruhat's contributions\n[\n4\n]\n:-\nYvonne Choquet-Bruhat is an internationally recognized mathematician. Her research area is located on the border between mathematics and physics. Her research covers a very wide range of knowledge from the first mathematical proof for the existence of solutions of\nEinstein\n's relativistic theory of gravitation to the study of the conversion of electromagnetic waves into gravitational waves\n(\nor the reverse\n)\nin the vicinity of a black hole. Her research has created new mathematical methods that have provided a solid foundation for the study of several physical theories: the theory of general relativity, relativistic hydrodynamics, non-Abelian gauge theory, the theory of supergravity, etc. She introduced some new formulations of\nEinstein\n's theory of gravitation which has led to spectacular recent progress in numerical relativity, including the calculation of gravitational waves emitted during the collapse and merger of two black holes. These results are of great importance for giant interferometric detectors of gravitational waves such as VIRGO\n(\nFranco-Italian\n)\nor LIGO\n(\nAmerican\n)\n.\nMathSciNet lists\n241\npublications by Yvonne Choquet-Bruhat\n(\nsome of these are under the name Yvonne Fourès-Bruhat. Given this incredible publication record, it is impossible to give a good indication here of its contents. Let us single out a few very significant papers.\nOndes Asymptotiques et Approchees pour des Systemes d'Equations aux Derivees Partielles non Lineaires\nⓉ\n(\nWaves and asymptotic approximations for systems of non-linear partial differential equations\n)\n, published in\n1969\n, gives a method for constructing asymptotic and approximate wave solutions about a given solution for nonlinear systems of partial differential equations.\nGlobal Solutions of the Problem of Constraints on a Closed Manifold\n, published in\n1973\n, shows that the existence of global solutions of the constraint equations of general relativity on a closed manifold depend on subtle properties of the manifold. She gave the first deep mathematical study of supergravity in\nCausalite des Theories de Supergravite\nⓉ\n(\nCausality of theories of  supergravity\n)\n(1984)\n. After this very brief look at some of her highly significant papers, let us look at some of the books that she has written.\nIn\n1963\nshe published\nRecueil de problèmes de mathématiques à l'usage des physiciens\nⓉ\n(\nCollection of mathematics problems for use by physicists\n)\nwhich was translated into English as\nProblems and solutions in mathematical physics\n(1967)\n. It consists of problems and their solutions required for certificate examinations in the mathematical methods of physics. In\n1968\nshe published\nGéométrie différentielle et systèmes extérieurs\nⓉ\n(\nDifferential geometry and external systems\n)\n. J D Zund writes in a review:-\nThis is an extremely elegant account of the methods of\ndifferential geometry\nand exterior differential systems, which as\nAndré Lichnerowicz\nsays in his preface, remains faithful to the spirit of\nÉlie Cartan\n. The book is very attractive and beautifully written. ...\n[\nIt\n]\nis to be most enthusiastically recommended to both pure and applied mathematicians, and it will be of particular value to theoretical physicists who desire a glimpse into the fascinating field of modern differential geometry.\nBruhat gave courses at the University of Paris to students taking the Master of Mathematics degree which prepared them for the practical use of distributions in the partial differential equations of theoretical physics. These courses became the basis for her French text\nDistributions\n(1973)\n. A collaboration with Cecile DeWitt-Morette and Margaret Dillard-Bleick led to the major three-author work\nAnalysis, manifolds and physics\n(1977)\n. Rudolph Schmid, reviewing the second edition which appeared in\n1982\n, wrote\n[\n8\n]\n:-\nThe success of the first edition of this excellent book encouraged the authors to write an enlarged and updated second edition. They have succeeded in gathering in one volume the mathematical infrastructure of modern mathematical physics, which includes the theories of differentiable manifolds and global analysis, Riemannian and Kählerian geometry,\nLie\ngroups, fibre bundles and their connections, characteristic classes and index theorems, distributions, and partial differential equations. ... In my opinion, this book accomplishes its purpose well, being a reference which can be used as a text in an advanced physical mathematics course.\nBruhat and Cecile DeWitt-Morette produced a companion volume in\n1989\n. J E Marsden writes in a review:-\nThe original book was well received in the community and is still a valuable resource today. It covers an amazing variety of topics that are of use to a large number of mathematicians, mathematical physicists, and mathematical engineers. The original book already had a number of interesting applications, such as the\nSchrödinger\nequation, soap bubbles, electromagnetism, shocks, gravity, Hamiltonian systems, monopoles, spinors, degree theory applied to PDE,\nWiener\nmeasure, etc. However, many of these were contained in extended problem format and tended to be a bit sketchy because of that, and also for lack of space, given the breadth of topics that the authors wanted covered in a coherent whole. This companion volume extends the applications to a more detailed discussion and to more sophisticated and interesting ones as well. To illustrate, here is a topic from each chapter: the Fierz identity, the stress-energy tensor,\nStiefel\nmanifolds, the\nWeyl\nHeisenberg\ngroup, Calabi-\nYau\nspaces,\nChern\n-Simons classes, and Wightman and\nSchwinger\nfunctions.\nWe must mention two further important books which were single-author works by Bruhat. First there was\nGraded bundles and supermanifolds\n(1989)\nwhich was reviewed by Alice Rogers who writes:-\nThese lecture notes give a pedagogical account of the basic concepts in the differential geometry of graded manifolds and supermanifolds. The style is clear and readable. Both graded manifolds and supermanifolds extend classical geometry to include anticommuting variables, an approach which is motivated by the desire to extend the geometric techniques used in theoretical physics to systems which include fermions. The formalism is particularly appropriate for supersymmetric systems, which have symmetries which mix bosonic and fermionic degrees of freedom, as it treats these two kinds of degrees of freedom in a similar manner.\nHer latest book,\nGeneral relativity and the Einstein equations\nwas published in\n2009\n. Hans-Peter Künzle begins a review by writing:-\nThis massive book covers in detail the areas of classical mathematical relativity theory to which the author has made major contributions during her long and active research career. As the title indicates, the emphasis is on the mathematical properties of the\nEinstein\nequations, in particular the local and global existence theorems of the initial value problem. But the inclusion of some introductory chapters on Lorentzian manifolds, special relativity and kinetic theory makes it an up-to-date reference work or even a textbook for an advanced graduate course.\nBruhat had a daughter Michelle with her first husband, Léonce Fourès, and a son Daniel and a daughter Geneviève with her second husband Gustave Choquet. Daniel Choquet studied bioengineering in Paris and obtained a doctorate from the Pierre and Marie Curie University in\n1988\n. He has made important advances in nanoscopic imaging and the organization of receptors in neurons, earning him election to the\nAcademy of Sciences\nand several prizes.\nFor her contributions to mathematical physics, Bruhat has received many honours. In\n1958\nshe was awarded the Silver Medal by the Centre National de la Recherche Scientifique. She was awarded the Henri de Parville Prize by the\nAcademy of Sciences\nin\n1963\n. She was elected a corresponding member of the Academy of Sciences on\n13\nMarch\n1978\nand, on\n14\nMay\n1979\n, she became a full member becoming the first woman full member. In\n1985\nshe was elected to the\nAmerican Academy of Arts and Sciences\n. She was made a Commander of the Légion d'Honneur on\n22\nOctober\n1997\n. In\n2003\n, jointly with James York, Cornell University, she received the Dannie Heineman Prize for Mathematical Physics:-\n... for their separate as well as joint work in proving the existence and uniqueness of solutions to\nEinstein\n's gravitational field equations so as to improve numerical solution procedures with relevance to realistic physical solutions.\nOn\n11\nJuly\n2008\nshe was elevated to the two 'dignities' in the Légion d'Honneur, namely 'Grand Officier' and 'Grand Croix', the highest level of honour."
}