{
  "nome_completo": "Zofia Szmydt",
  "nome_curto": "Zofia Szmydt",
  "ano_nascimento": "1923",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szmydt/",
  "lugar_nascimento": "Warsaw, Poland",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Zofia Szmydt\nwas the daughter of Józef Konstanty Szmydt\n(1885\n-\n1960)\nand Zofia Wanda Gąsiorowska\n(1893\n-\n1977)\n. Józef was a farmer with a higher education, working on the Komarów estate in the Vilnius region. He married Zofia Gąsiorowska, who had been born in Saint Petersburg, Russia on\n21\nApril\n1893\n, in October\n1919\nin the Church of the Holy Cross in Warsaw. This required special permission since they were related. In\n1912\nZofia Gąsiorowska had begun studying philology and history at the Faculty of Philosophy of the Jagiellonian University. She had taught in Warsaw during World War I but in\n1917\nshe returned to the Jagiellonian University where she obtained a doctorate in philosophy in June\n1917\n. She had returned to school teaching and publishing papers before marrying Józef Szmydt. Józef Szmydt and Zofia Szmydtowa had two children, Maria Danuta Szmydt\n(2\nDecember\n1920\n-\n17\nMay\n2011)\nand Zofia Szmydt\n(29\nJuly\n1923\n-\n6\nNovember\n2010)\n, the subject of this biography. Zofia Szmydtowa, the mother of the mathematician, worked at the Department of the History of Polish Literature at the Faculty of Polish Studies at the University of Warsaw from\n1926\n, becoming a professor in\n1933\n. From\n1929\nthe family lived in Warsaw in an apartment previously owned by Władysław Stanisław Reymont, a Polish novelist who had been awarded the Nobel Prize in Literature in\n1924\n. Let us quote the beginning of the article\n[\n13\n]\nabout Zofia Szmydtowa:-\nZofia Szmydtowa's work is a phenomenon that cannot be presented in a concise description. It is not only about the breadth of her interests, encompassing both ancient, Greek and Roman literature, as well as Western European literature, mainly French, Italian and Spanish, but also about her specific method of researching literary phenomena, combining philological precision with the features of contemporary comparative studies and with Zofia Szmydtowa's characteristic critical intuition, inventiveness in formulating hypotheses and aesthetic sensitivity.\nZofia Szmydt began her schooling in Warsaw in\n1929\n. After her primary education, she attended a junior high school before completing her schooling at the Cecylia Plater-Zyberkówna School in Warsaw. Cecylia Plater-Zyberk had entered a convent in Warsaw in\n1880\n, then three years later founded a craft school for girls. In\n1886\nshe founded a girls' secondary school which was given full recognition by the Education Authority in\n1917\n; it was this school that Zofia Szmydt was attending when Germany invaded Poland in September\n1939\nand World War I began. The occupying German forces quickly moved to limit education of Poles. Heinrich Himmler, second in command to Hitler, produced a document on\n5\nMay\n1940\nwhich required all education in Poland to be in German and\n[\n2\n]\n:-\n... for the non-German population of the East there can be no type of school above the four-grade rudimentary school. The job of these schools should be confined to the teaching of counting\n(\nno higher than up to\n500)\n, the writing of one's name, and the teaching that God's commandment means obedience to the Germans, honesty, industry and politeness. Reading I do not consider essential.\nPolish teachers and lecturers, at great risk to their lives, organised secret underground courses taught in private houses. Even a clandestine examination system was set up and Zofia was able to pass the matriculation examination in mathematics and physics in\n1940\n. The occupying German forces had closed the University of Warsaw and turned its buildings into a military barracks, but lecturers continued to teach classes in secret using private houses and religious buildings. Zofia was able to obtain a university education with this clandestine university system. She lived throughout the war with her parents in their Warsaw home and was able to earn money by giving private lessons. Her mother was one of the brave university professors who participated in the secret teaching of the underground University of Warsaw.\nAlthough Germany and the Soviet Union had made a treaty before the invasion of Poland, in June\n1941\nGermany attacked the Soviets. At first they made deep advances into the Soviet Union but as the war progressed the Red Army drove them back. In the summer of\n1944\nthe Red Army was advancing towards Warsaw and German troops began to leave the city. The Polish Resistance saw an opportunity to retake control of Warsaw and on\n1\nAugust\n1944\nthe Warsaw Uprising began. The Red Army halted their advance allowing the German troops to regroup and defeat the Uprising. In the\n2\n-month battle that followed most of the city was destroyed and it is estimated that the German forces killed around\n40000\ncivilians. Much of Zofia Szmydtowa's research was destroyed with the family's property and, after the Poles surrendered, the Germans sent the Szmydt family along with many other surviving Polish families to Kraków. Zofia Szmydt was forced to leave Warsaw with her parents and to live in to Kraków. There she supported herself giving private tuition.\nGerman occupiers evacuated Kraków on\n17\nJanuary\n1945\nand, two days later, Soviet forces entered Kraków. The Jagiellonian University reopened on\n19\nMarch\n1945\nbut it was a difficult time with\n25\n% of the staff having been killed. Chairs had to be developed and staff appointed. Soon after the University opened, in March\n1945\n, Szmydt enrolled for a mathematics degree in the Faculty of Philosophy. She already had a good mathematics education from the underground University of Warsaw so she was soon in a position to take examinations in Kraków\n[\n4\n]\n:-\nDuring her studies, she passed with very good results exams in differential and integral calculus with an introduction to analysis, analytic geometry, principles of higher algebra with elements of number theory, theoretical mechanics, experimental physics, main principles of philosophical sciences, theory of analytic functions, differential equations, integral equations and hydrodynamics. She passed her final exam in December\n1945\nwith a good result. Her master's thesis 'On the characteristic roots of matrices' received a very good grade. She received her Master of Philosophy diploma in mathematics on\n20\nMarch\n1946\n.\nThese were hard times for the whole Jagiellonian University and mathematics was no exception to these difficulties. It was led by\nTadeusz Ważewski\nand other members of staff included\nFranciszek Leja\n,\nStanisław Gołąb\nand\nBronisław Knaster\n.\nAndrzej Turowicz\n, who had left mathematics in\n1945\nto join the Benedictine Abbey in Tyniec, was brought back to help with lecturing in\n1946\n. Szmydt certainly flourished with these fine mathematicians as her teachers. Also in the Department of Mathematics at that time was\nZofia Krygowska\nwho was studying for her doctorate. Even before the award of her Master's Degree, Szmydt was appointed as a senior assistant in the Faculty of Mathematics and Natural Sciences of the Jagiellonian University on\n1\nJanuary\n1946\n.\nThe Institute of Mathematics of the\nPolish Academy of Sciences\nwas named the State Mathematical Institute when it was established by the Polish government on\n20\nNovember\n1948\n; it was headed by\nWacław Sierpiński\n. Branches were established in major Polish cities including Kraków. In March\n1949\n, in addition to her position at the Jagiellonian University, Szmydt was appointed as a senior assistant in the Department of Differential Equations of the Department of Differential Equations of the State Institute of Mathematics.\nWhile undertaking duties at the University and at the Institute, Szmydt studied for her doctorate advised by\nTadeusz Ważewski\n. He proposed that she work on a problem he suggested on the existence of nontrivial first integrals of the equation\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny' = f(x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\nin simply connected domains. She solved the problem and submitted the\n14\n-page thesis\nOn the first integrals of the differential equation\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny' = f(x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\nfor her doctorate. She was examined for the doctorate offering mathematics as her main subject and logic as her minor subject. She was examined by a committee chaired by Bogdan Kamieński with members\nFranciszek Leja\n,\nTadeusz Ważewski\nand\nStanisław Gołąb\n. Bogdan Kamieński\n(1897\n-\n1973)\nwas a leading physical chemist who, at the time of Szmydt's examination on\n18\nFebruary\n1949\n, was dean of the Faculty of Mathematics and Natural Sciences at the Jagiellonian University. She was awarded her doctorate on\n5\nDecember\n1949\n.\nSzmydt's first paper,\nSur les racines caractéristiques et sur les directions caractéristiques de certaines matrices\nⓉ\n(\nOn the characteristic roots and on the characteristic directions of certain matrices\n)\n, was related to her Master's thesis and was published in\n1949\n. This paper\n[\n10\n]\n, published under the name Zofia Szmydtówna, was reviewed by\nOlga Taussky-Todd\n[\n12\n]\n:-\nSeveral theorems due to\nFrobenius\nconcerning matrices with positive or nonnegative elements are generalised to the cases of matrices whose off-diagonal elements are positive\n(\na\n+\na^{+}\na\n+\n-matrices\n)\nor nonnegative\n(\na-matrices\n)\n. The author observes that the original proofs of some of these theorems made no use of the signs of the main diagonal elements. For other theorems the proof can be reduced to the\nFrobenius\ncase. It is shown that the characteristic root with largest real part of an a-matrix is real\n[\nsee also Rohrbach\n(1931)]\n; for an\na\n+\na^{+}\na\n+\n-matrix this root is simple. The components\nx\ni\nx_{i}\nx\ni\n​\nof the corresponding characteristic vectors are such that\nx\ni\nx\nj\n≥\n0\nx_{i}x_{j}  ≥ 0\nx\ni\n​\nx\nj\n​\n≥\n0\nfor an a-matrix and\nx\ni\nx\nj\n>\n0\nx_{i}x_{j}  > 0\nx\ni\n​\nx\nj\n​\n>\n0\nfor an\na\n+\na^{+}\na\n+\n-matrix. The components of a vector which corresponds to a smaller real characteristic root cannot all be positive. Finally, a theorem concerning the vectors which correspond to complex roots is proved; this result has no analogue among the Frobenius theorems.\nSzmydt's second paper\nSur les intégrales premières de l'équation\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny' = f(x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\nⓉ\n(\n7608\n, On the first integrals of the equation\ny' = f\n(\nx, y\n)\n)\nwas basically her doctoral thesis translated into French and published in\n1950\n. C Miranda writes in the review\n[\n15\n]\n:-\nThe author shows that for every integer n one can construct an open and simply connected set\nΩ\nn\n\\Omega _{n}\nΩ\nn\n​\nand a function\nf\nn\n(\nx\n,\ny\n)\nf_{n}(x, y)\nf\nn\n​\n(\nx\n,\ny\n)\nendowed with derivatives of any high order, such that every first integral of the equation\ny\n′\n=\nf\nn\n(\nx\n,\ny\n)\ny' = f_{n}(x, y)\ny\n′\n=\nf\nn\n​\n(\nx\n,\ny\n)\nthat is continuous in\nΩ\nn\n\\Omega _{n}\nΩ\nn\n​\nwith all derivatives up to and including those of order n is necessarily constant in\nΩ\nn\n\\Omega _{n}\nΩ\nn\n​\n.\nSzmydt had been promoted to assistant professor at the Jagiellonian University on\n1\nMarch\n1951\nand continued in this position until\n31\nAugust\n1952\n. In\n1952\nthe State Mathematical Institute became part of the\nPolish Academy of Sciences\nand was given its current name.\nSierpiński\nbecame the first President of the Scientific Council of the Institute of Mathematics. Szmydt was promoted to assistant professor at the Institute of Mathematics, a role she held between\n31\nJuly\n1953\nand\n31\nJuly\n1954\nwhen she became an independent researcher. Later in\n1954\nshe was given the title of associate professor. In parallel with her work at the Institute of Mathematics of the\nPolish Academy of Sciences\nshe was employed as an independent researcher in the Department of Mathematics at the Faculty of Chemistry of the Warsaw University of Technology from\n1\nSeptember\n1953\nto\n31\nAugust\n1954\n.\nWe note that on the\n1955\npaper\nSur l'allure asymptotique des intégrales de certains systèmes d'équations différentielles non linéares\nⓉ\n(\nOn the asymptotic appearance of the integrals of certain systems of nonlinear differential equations\n)\n, the sixth of her published papers, she gives her address\n(\nin both Polish and French\n)\nas Institute of Mathematics of the\nPolish Academy of Sciences\nKraków. Up to\n1955\nall her papers are written in French but her first paper in English was\nOn the degree of regularity of surfaces formed by the asymptotic integrals of differential equations\n(1955)\n. This paper contains results which she had communicated to the\n8\nth Congress of Polish Mathematicians held in Warsaw\n6\n-\n12\nSeptember\n1953\n. Among other papers delivered to this Congress were:\nThe present state of investigations on the foundations of mathematics\n, by\nAndrzej Mostowski\n;\nThe influence of new mathematical methods on the development of classical mathematical disciplines,\nby\nTadeusz Ważewski;\nTheory of probability as a tool for investigations in science and the field of production\n, by\nHugo Steinhaus\n; and\nThe organisation, the present state, and the problems of mathematics in Poland\n, by\nKazimierz Kuratowski\n.\nIn\n1956\n, Szmydt was awarded the\nStefan Banach\nPrize by the\nPolish Mathematical Society\n. This prestigious prize had been first awarded in\n1946\nto\nHugo Steinhaus\nand other winners of the prize before Szmydt had been\nWładysław Orlicz\n(1948)\n,\nStanisław Mazur\n(1949)\n, and\nJan Mikusiński\n(1950)\n. She was the first woman to receive this prize, the next being Danuta Przeworska-Rolewicz in\n1969\n.\nIn\n1957\nSzmydt submitted the thesis\nLimit problems of a new type for hyperbolic partial differential equations\nfor her\nhabilitation\n. This thesis consisted of six previously published papers:\nSur un nouveau type de problèmes pour un système d'équations différentielles hyperboliques du second ordre à deux variables indépendantes\nⓉ\n(\nOn a new type of problems for a system of hyperbolic differential equations of the second order with two independent variables\n)\n(1956)\n;\nSur une généralisation des problèmes classiques concernant un système d'équations différentielles hyperboliques du second ordre à deux variables indépendantes\nⓉ\n(\nOn a generalization of classical problems concerning a system of hyperbolic differential equations of the second order with two independent variables\n)\n(1956)\n;\nSur le problème de Goursat concernant les équations différentielles hyperboliques du second ordre\nⓉ\n(\nOn the Goursat problem concerning hyperbolic differential equations of the second order\n)\n(1957)\n;\nSur un problème concernant un système d'équations différentielles hyperboliques d'ordre arbitraire à deux variables indépendantes\nⓉ\n(\nOn a problem concerning a system of hyperbolic differential equations of arbitrary order with two independent variables\n)\n(1957)\n;\nSur l'existence de solutions de certains nouveaux problèmes pour un système d'équations différentielles hyperboliques du second ordre à deux variables indépendantes\nⓉ\n(\nOn the existence of solutions of certain new problems for a system of hyperbolic differential equations of the second order with two independent variables\n)\n(1957)\n; and\nSur l'existence d'une solution unique de certains problèmes pour un système d'équations différentielles hyperboliques du second ordre à deux variables indépendantes\nⓉ\n(\nOn the existence of a unique solution of certain problems for a system of second order hyperbolic differential equations with two independent variables\n)\n(1957)\n.\nThe reviewers of her thesis were Adam Bielecki\n(1910\n-\n2003)\n, who was a professor at the Institute of Mathematics of the\nPolish Academy of Sciences\n, and\nTadeusz Ważewski\n. She defended her thesis before the Scientific Council of the Institute of Mathematics on\n22\nFebruary\n1958\nand she was awarded her habilitation.\nAfter the award of her habilitation, Szmydt was awarded a scholarship to make a research visit to Italy for six months in\n1958\n-\n59\n. This was very successful and led to the award of two Italian scholarships which allowed her to spend time in Italy, first from November\n1959\nto April\n1960\n, and then from February to July of\n1962\n. She continue to be based at the Institute of Mathematics of the\nPolish Academy of Sciences\nin Kraków until\n1971\nbut also gave lectures at the Jagiellonian University in\n1952\n-\n1953\n,\n1966\n-\n1967\nand\n1969\n-\n1970\n. Zofia Szmydt's parents had returned to Warsaw from Kraków in February\n1945\nwhere her father had died in\n1960\n. Her mother, who had been appointed as a full professor at the University of Warsaw on\n1\nMarch\n1959\ncontinued to live in Warsaw after the death of her husband and retired in\n1965\n. By\n1971\nher health had become poor and Zofia Szmydt made a request to the Institute of Mathematics of the\nPolish Academy of Sciences\nto let her move from the Kraków branch to the Warsaw branch so that she could support her mother. Her mother died on\n3\nMarch\n1977\nand Zofia Szmydt continued to live in Warsaw.\nIn\n1972\nSzmydt published the book\n[\n7\n]\nTransformacja Fouriera i równania różniczkowe liniowe\nⓉ\n(\nFourier Transformation and Linear Differential Equations\n)\n. Grzegorz Łysik explains that it was written\n[\n4\n]\n:-\n... to present the foundations of the theory of linear partial differential equations with particular emphasis on distributional limit problems for the basic equations of mathematical physics\n(\nheat,\nSchrödinger\n, wave,\nLaplace\nand\nPoisson\nequations\n)\n. This monograph contains the first extensive study in Polish literature of the foundations of the theory of distribution and\nFourier\ntransforms in the distributional approach. ... In the world literature, it was a unique publication in which the author included her own research achievements together with a precise and professional discussion of the tools and methods used. Moreover, it is the only book in which the concept of determining variables in the distribution was discussed in detail and applied to differential equations. Additionally, it contains the first publication by Bogdan Ziemian and the first version of his joint work with Szmydt, in which, using the invariance of the wave operator with respect to the\nLorentz\ntransformation group, formulas for its fundamental solution were derived.\nThe original Polish version of the book was translated into English and published as\nFourier transformation and linear differential equations\n(1977)\n. This book is\n[\n8\n]\nin our list of references and it was reviewed by Z Zielezny\n[\n13\n]\nwho writes:-\nThe English edition is a revised and enlarged version of the original Polish edition. Its main purpose is to give a modern exposition of the fundamental theory of linear partial differential equations of mathematical physics. It is a monograph designed for graduate students in mathematics, physics and engineering, as well as for researchers.\nThe solutions of the differential equations are sought in the space of distributions and the main tool is the\nFourier\ntransformation. A special feature is the application of an operation called \"fixation of variables in a distribution\" which was introduced by S Łojasiewicz in\n1958\n.\nThe book is self-contained and does not require any knowledge of the classical theory of partial differential equations. A number of theorems from functional analysis which are applied in the text are formulated in the introduction.\nThe first two chapters contain the basic facts of the theory of distributions and\nFourier\ntransforms. In Chapter III, the author presents the general definitions and theorems on partial differential equations. The subsequent three chapters are devoted to the principal differential operators of mathematical physics: the wave operator, the operator of heat conduction, and the\nLaplace\nand\nHelmholtz\noperators. Numerous exercises are designed to illustrate or complement the text. The book concludes with an appendix on fundamental solutions of the wave operator.\nOn\n24\nSeptember\n1973\n, Szmydt was awarded the Commander's Cross of the Order of Polonia Restituta, in recognition of her services in educating students and for publishing the textbook\nFourier Transformation and Linear Differential Equations.\nOne of Szmydt's three students whom she advised for a doctorate was Bogdan Ziemian\n(1953\n-\n1997)\nwho was awarded his doctorate in\n1981\n. From October\n1991\nshe collaborated with Ziemian on writing the book\nThe Mellin transformation and Fuchsian type partial differential equations\nwhich was published in\n1992\n. She retired on\n1\nOctober\n1993\nbut continued to undertake research in collaboration with Bogdan Ziemian. They published a total of\n18\nresearch papers, three of which were written after Szmydt retired. In total she published\n58\npapers, the final two being obituaries of Bogdan Ziemian. Her last paper, written with two co-authors, ends with the sentence:-\nOn\n13\nMarch\n1997\n, Bogdan and his wife were involved in a tragic accident. Bogdan Ziemian did not survive; his final act was to save the life of his wife.\nLet us end with a quotation from Emelie Agnes Kenney's paper\n[\n3\n]\n:-\nSzmydt was known as a sophisticated instructor who gave smooth presentations; as a person, she was thought of as very generous, but somewhat averse to attending social functions. Roman Sznajder, who took six courses with her, recalls attending the International Congress of Mathematicians in\n1978\nin Helsinki with Szmydt. She gave Sznajder her invitation to attend a reception at the home of the Mayor of Helsinki, since he did not have one. She also kept on hand a supply of restaurant coupons so that her students could eat for free."
}