{
  "nome_completo": "Abraham Adrian Albert",
  "nome_curto": "A Adrian Albert",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Albert_Abraham/",
  "data_nascimento": "9 November 1905",
  "local_nascimento": "Chicago, Illinois, USA",
  "data_morte": "6 June 1972",
  "local_morte": "Chicago, Illinois, USA",
  "summary": "A Adrian Albert was an American mathematician who worked on associative and non-associative algebras.",
  "biografia": "A Adrian Albert\n's parents were Russian. His father, Elias Albert, came to the United States from England and had set up a retail business. His mother, Fannie Fradkin, had come to the United States from Russia. Adrian was the second of Elias and Fannie's three children, but he also had both a half-brother and half-sister from his mother's side.\nIt was in Chicago that Adrian undertook most of his education; in fact this was his home town for most of his life. He began his education there entering primary school in\n1911\n. In\n1914\n, however, the family moved to Iron Mountain in Michigan where he continued his schooling until the family returned to Chicago in\n1916\n. Back in the town of his birth, Adrian entered the Theodore Herzl Elementary School where he studied until\n1919\nthen, in that year, he entered the John Marshall High School. In\n1922\nhe graduated from the High School and began his studies at the University of Chicago.\nAlbert completed his B.S. degree in\n1926\nand was awarded his Master's degree in the following year. He remained at the University of Chicago undertaking research under\nL E Dickson\n's supervision. That\nDickson\n, the leading American mathematician in the fields of number theory and algebra, was on the Chicago faculty was a piece of good fortune for Albert. Not only did Dickson strongly influence the course of all Albert's later research, but also his style as a teacher and academic rubbed off on Albert. He was awarded his Ph.D. in\n1928\nfor a doctoral dissertation entitled\nAlgebras and their Radicals and Division Algebras\n.\nBy the time that he received his doctorate Albert was a married man, having married Freda Davis on\n18\nDecember\n1927\n. The economic situation in the United States was deteriorating at this time with the advent of the depression.\nHerstein\nwrites in\n[\n7\n]\n(\nsee also\n[\n6\n]\n)\n:-\nShortly after he got his Ph.D., the great economic depression started. Sensitive as he was to the suffering of others, he deeply felt the economic hardship that so many of his friends were undergoing. He, too, did not have an easy time of it economically. In addition he was beset by a series of illnesses ...\nIn his doctoral thesis Albert had made considerable progress in classifying division algebras. It was an impressive piece of work and it led to him being awarded a National Research Council Fellowship to enable him to undertake postdoctoral study at Princeton. He spent nine months at Princeton in\n1928\n-\n29\nand this was an important period for Albert since during his time there Lefschetz suggested that he look at open problems in the theory of\nRiemann\nmatrices\n. These matrices arise in the theory of complex manifolds and Albert went on to write an important series of papers on these questions over the following years.\nAlbert was then offered a post as an instructor at Columbia University and he worked there for two years from\n1929\nto\n1931\n. His first paper\nA determination of all normal division algebras in sixteen units\nwas published in\n1929\n. It was based on the second half of his doctoral thesis but Albert had, by this time, pushed the ideas further classifying division algebras of dimension\n16\nover their centres. The case of dimension\n9\n, the next smaller case, had been solved by\nWedderburn\n.\nAlbert returned to the University of Chicago in\n1931\nwhere he was appointed as assistant professor. He remained on the staff there for the rest of his life being promoted to associate professor in\n1937\nand full professor in\n1941\n. During the years\n1958\nto\n1962\nhe was chairman of the Chicago Department.\nKaplansky\nwrites\n[\n7\n]\n:-\nThe main stamp he left on the Department was a project dear to his heart; maintaining a lively flow of visitors and research instructors, for whom he skilfully got support in the form of research grants.\nShortly after beginning his second three year term as Chairman of the Department Albert was asked to take on the post of Dean of Physical Sciences. He served Chicago for\n9\nyear in the role until\n1971\n.\nHerstein\nwrites\n[\n6\n]\n:-\nHe dearly loved Chicago as a city, more especially the Hyde Park area surrounding the university, and most especially, the university itself. He was an integral part of the university, and the university was an integral part of his life. He knew and was known by almost everybody at the university, and his influence went well beyond the realm of the physical sciences. Of all the honours and responsibilities that came to him, the one that he probably enjoyed most, and which meant the most to him, was that of being Dean of Physical Sciences in his beloved university.\nWe should say a little about Albert's family life which was filled with great happiness until the tragic death of his son Roy. He was one of their three children\n(\nthe other two being Alan and Nancy\n)\nand Roy's death at the age of\n23\nin\n1958\nbrought a deep sadness which Albert and his wife never got over. One should say, though, that it was in his nature not to allow his grief to be too visible publicly. The blow was softened, if ever the loss of a child could ever really be softened, by the happiness that Albert and his wife enjoyed from their other two children and from their five grand-children.\nWe have already said a little above about Albert's mathematical contributions but we should now give further details. His main work was on associative algebras, non-associative algebras, and\nRiemann\nmatrices. He worked on classifying division algebras building on the work of\nWedderburn\nbut\nBrauer\n,\nHasse\nand\nEmmy Noether\ngot the main result first. Albert's major contribution is, however, detailed in a joint paper with\nHasse\n. Albert's book\nStructure of Algebras\n, published in\n1939\n, remains a classic. The content of this treatise was the basis of the Colloquium Lectures which he gave to the\nAmerican Mathematical Society\nin\n1939\n. We should also mention Albert's other fine text on algebra,\nModern Higher Algebra\n, which was published two years before\nStructure of Algebras\n.\nAlbert's work on\nRiemann\nmatrices was, as we mentioned above, a consequence of suggestions made by\nLefschetz\n. For his papers on the construction of\nRiemann\nmatrices published in the\nAnnals of Mathematics\nin\n1934\nand\n1935\nAlbert received the\nCole\nprize in algebra from the\nAmerican Mathematical Society\nin\n1939\n. These important papers had been a direct consequence of Albert's\n1928\n-\n29\nvisit to Princeton and when he spent the academic year\n1933\n-\n34\nat the Institute for Advanced Study at Princeton he again received a stimulus which would lead him to further important results.\nLectures by\nWeyl\non\nLie\nalgebras were particularly stimulating but perhaps even more important was his introduction to\nJordan\nalgebras. These algebras had been introduced by\nPascual Jordan\nas being related to\nquantum theory\n.\nJordan\nhad worked with\nvon Neumann\nand\nWigner\non the structure of these algebras but they had left open certain fundamental questions. Albert was able to use his expertise in structural questions regarding algebras to solve some of the problems in his\n1934\npaper\nOn certain algebras of quantum mechanics\n. His work on\nJordan\nalgebras did not end there for he published three further fundamental papers on their structure in\n1946\n,\n1947\nand\n1950\n.\nDuring the Second World War Albert contributed to the war effort as associate director of the Applied Mathematics Group at Northwestern University which tackled military problems. Another interest of Albert's, which appears to have been prompted by the War, was that of cryptography. He lectured to the\nAmerican Mathematical Society\non\nSome mathematical aspects of cryptography\nat the Society's meeting in November\n1941\n.\nLectures by\nWeyl\non\nLie algebras\nin\n1934\n-\n35\nintroduced Albert to the theory of non-associative algebras. It was not until\n1942\n, however, that he published his first major work on non-associative algebras.\nKaplansky\nwrites in\n[\n9\n]\n:-\nAlbert investigated just about every aspect of non-associative algebras. At times a particular line of attack failed to fulfil the promise it had shown; he would then exercise his sound instinct and good judgement by shifting the assault to a different area. In fact, he repeatedly displayed an uncanny knack for selecting projects which later turned out to be well conceived ...\nAlbert received many honours for his outstanding achievements. He was elected to the\nNational Academy of Sciences\nin\n1943\n, the\nBrazilian Academy of Sciences\nin\n1952\n, and the Argentine Academy of Sciences in\n1963\n. He served as chairman of the Mathematics Section of the National Research Council from\n1958\nto\n1961\n, and President of the\nAmerican Mathematical Society\nin\n1965\n-\n66\n.\nHerstein\nsays this about Albert as a person\n(\n[\n6\n]\nor\n[\n7\n]\n)\n:-\nWhat characterised him best as a person was his intense loyalty to his friends and to his profession. He viewed the profession of mathematician with a great deal of pride and he did everything he could to have it recognised as he felt it deserved. He constantly fought for the improvement of working conditions, salaries, and student support in his chosen field. Although he had a strong set of principles in life and a definite attitude to moral and professional behaviour, he was endowed with an enormous tolerance for the changes that were taking place around him ...",
  "matematicos_citados_na_biografia": [
    "L E Dickson",
    "Dickson",
    "Herstein",
    "Riemann",
    "matrices",
    "Wedderburn",
    "Kaplansky",
    "Brauer",
    "Hasse",
    "Emmy Noether",
    "American Mathematical Society",
    "Lefschetz",
    "Cole",
    "Weyl",
    "Lie",
    "Jordan",
    "Pascual Jordan",
    "quantum theory",
    "von Neumann",
    "Wigner",
    "Lie algebras",
    "National Academy of Sciences",
    "Brazilian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}