{
  "nome_completo": "Abraham Gotthelf Kästner",
  "nome_curto": "Abraham Kästner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kaestner/",
  "data_nascimento": "27 September 1719",
  "local_nascimento": "Leipzig, Germany",
  "data_morte": "20 June 1800",
  "local_morte": "Göttingen, Germany",
  "summary": "Abraham Kästner was a German mathematician who compiled encyclopaedias and wrote text-books. He taught Gauss.",
  "biografia": "Abraham Gotthelf Kästner\n's father was a university professor of jurisprudence. He hoped that his son would follow in his footsteps and Kästner started out on a university course with the intention of studying the philosophy of law, but he soon found other topics more to his liking and began to concentrate more on philosophy, physics and mathematics.\nKästner wrote his\nhabilitation\nthesis at the University of Leipzig, and was awarded the qualification which allowed him to teach there in\n1739\n. He taught at the University of Leipzig as a\nPrivatdozent\nuntil\n1746\nwhen he was appointed as an extraordinary professor. Ten years later, in\n1756\n, he was appointed as professor of mathematics and physics at Göttingen where he succeeded to\nSegner\n's chair. He was an excellent expositor of mathematics although it is reported that\nGauss\ndid not bother to go to his lectures as he found them too elementary. However he did influence\nGauss\n, in particular with his interest in\nEuclid\n's\nparallel postulate\n.\nThe paper\n[\n5\n]\nexamines the contribution of Kästner who Sinaceur describes as an important German mathematician of the mid- and late\n18\nth\ncentury. Kästner is not famed for original research but rather he was involved in compiling encyclopedias and in writing textbooks. He was concerned with philosophical questions in mathematics and other areas such as logic. However Kästner was quite unenthusiastic about logic, but this is not surprising for a mathematician of this period who was interested in geometry. Despite this he was interested in the philosophy of mathematics and he wrote widely, in long volumes, about the applications of mathematics to optics, dynamics and astronomy.\nPerhaps his two most famous works, both in four volumes, were\nMathematische Anfangsgründe\nⓉ\n(\nMathematical Foundations\n)\nand\nGeschichte der Mathematik\nⓉ\n(\nHistory of Mathematics\n)\n(1796\n-\n1800)\n. This latter work was intended to form the basis for a history of mathematics. For example Volume\n2\n, published in\n1787\n, is considered one of the standard sources on the history of mathematical optics.\nPerhaps the most important feature of Kästner's contributions was his interest in the parallel postulate which indirectly influenced\nBolyai\nand\nLobachevsky\ntoo. Kästner taught\nBolyai\n's father and\nJ M C Bartels\n, one of Kästner's students, taught\nLobachevsky\n. Folta writes in\n[\n3\n]\nabout Kästner's work on geometry:-\nKästner\n[\nis\n]\namong the mathematicians of the\n18\nth\ncentury whose broad interests compelled\n[\nhim\n]\nto concern\n[\nhimself\n]\nwith the principal problems of geometry.\n[\nHis\n]\nresults included new features that more precisely formulated the traditional interpretation of elementary geometry. In fact,\n[\nhe\n]\nbegan the conscious attempt to make a precise axiomatisation of the fundamental concepts. Kästner, in spite of his rather great inclination for\nEuclid\n's Elements, based his version of the axiomatics of geometry in his Kompendium on other principles\n(\ne.g., on motions\n)\nand attempted both to seize on other fundamental properties\n(\ncontinuity, ordering\n)\nand to determine the selection of the parallel axiom as a foundation.\nThe article\n[\n1\n]\ngives us a few more details of Kästner's life, which is described in detail in\n[\n2\n]\nwhich is an autobiography. Goe writes in\n[\n1\n]\n:-\nKästner is also known in German literature, notably for his epigrams. He was a devout Lutheran. Kästner married twice and had a daughter by his second wife.",
  "matematicos_citados_na_biografia": [
    "habilitation",
    "Privatdozent",
    "Segner",
    "Gauss",
    "Euclid",
    "parallel postulate",
    "Bolyai",
    "Lobachevsky",
    "J M C Bartels"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}