{
  "nome_completo": "Achille Pierre Dionis du Séjour",
  "nome_curto": "Achille-Pierre Dionis du Séjour",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dionis/",
  "data_nascimento": "11 January 1734",
  "local_nascimento": "Paris, France",
  "data_morte": "22 August 1794",
  "local_morte": "Vernou (near Fontainebleau), France",
  "summary": "Achille-Pierre Dionis du Séjour was a French mathematician, astronomer and politician.",
  "biografia": "Achille-Pierre Dionis du Séjour\n's father was Louis-Achille Dionis du Séjour and his mother was Geneviève-Madeleine Héron. Louis-Achille Dionis du Séjour held a legal position in the Cour des Aides, the board of excise, in Paris.\nDionis du Séjour attended the Collège Louis-le-Grand in Paris and the studied at the Faculté de Droit. He published a treatise on the analytic geometry of plane curves in\n1756\nTraité des courbes algébrique\n. As a result of this work he was elected associé libre of the\nAcadémie des Sciences\nin the same year as its publication.\nIn\n1758\nhe was appointed as a member of the parliament in Paris. He combined this political career with his research in mathematics and astronomy which, although of high quality, was no more than a hobby for him. However, he wrote extensively on applications of mathematics to astronomy, in particular planetary orbits, and his work was highly regarded by\nLagrange\n,\nLaplace\nand\nCondorcet\n.\nDionis du Séjour applied the latest analytic mathematical methods to the study of problems in astronomy. Over a period of almost\n20\nyears from\n1764\nhe wrote a series of memoirs on eclipses, occultations\n(\nwhen one astronomical body comes in front of another\n)\n, calculating orbits, and other such topics, and these were brought together in a two volume work\nTraité analytique des mouvements apparents des corps célestes\nⓉ\n(\nanalytical Treaty apparent motions of the heavenly bodies\n)\nwhich he published, volume one in\n1786\nand volume two in\n1789\n.\nHe published two other volumes on mathematical astronomy. The first was\nEssai sur les comètes en général; et particulièrement sur celles qui peuvent approacher de l'orbite de la terre\nⓉ\n(\nEssay on comets in general; and particularly those that can approacher the orbit of the earth\n)\n(1775)\nwhich, as the title suggests considers comets and, in particular, shows that the probability of a collision between a comet and the earth is very low. It is interesting, particularly given the interest in this topic today, to see the subject being explored\n225\nyears ago. The second volume is\nEssai sur les phémomènes relatifs aux disparitions périodique de l'anneau de Saturne\nⓉ\n(\nEssay on the phemomena of the periodic disappearance of Saturn's ring\n)\nwas published in\n1776\nand, again as suggested by the descriptive title, it explains the variation in the appearance of the rings of Saturn.\nDionis du Séjour also worked on the theory of equations, not attaining the depth of results of\nBézout\nor\nLagrange\n. With\nCondorcet\nand\nLaplace\nhe undertook a determination of the population of France\n[\n1\n]\n:-\nUtilising the list of communes appearing in the Cassini map of France and the most recent information furnished by the civil engineers, this enquiry was based on the empirical hypothesis that the annual number of births in a given population is approximately one twenty-sixth of the total of that population.\nThe French Revolution caused problems for Dionis du Séjour, both in his political roles and in his scientific work. He was elected as a deputy of the Paris nobility on\n10\nMay\n1789\n. This gave him a seat in the National Assembly. The storming of the Bastille on\n14\nJuly\n1789\nmarked the start of the French Revolution and the National Assembly then became the Constituent Assembly. On\n30\nSeptember\n1791\nthe Constituent Assembly was replaced by Legislative Assembly and Dionis du Séjour's role came to an end at this time.\nOn\n31\nNovember\n1791\nDionis du Séjour was appointed as a judge of the Paris tribunal but later he resigned and retired to his estate in Argeville. However from\n5\nSeptember\n1793\nto\n27\nJuly\n27\n1794\nthere was the Reign of Terror during which\n17\n,\n000\nwere officially executed. Dionis du Séjour was in fear of his life throughout this period and the anxiety he experienced may well have hastened his death which was less than a month after the Reign of Terror ended.\nAs to Dionis du Séjour's character, he is described as\n[\n1\n]\n:-\n... appreciated for his simplicity, his liberalism, and his humanity.",
  "matematicos_citados_na_biografia": [
    "Académie des Sciences",
    "Lagrange",
    "Laplace",
    "Condorcet",
    "Bézout"
  ],
  "imagens": [
    "dionis.jpg"
  ]
}