{
  "nome_completo": "Augusta Ada Byron King, countess of Lovelace",
  "nome_curto": "Ada Lovelace",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lovelace/",
  "data_nascimento": "10 December 1815",
  "local_nascimento": "Piccadilly, Middlesex (now in London), England",
  "data_morte": "27 November 1852",
  "local_morte": "Marylebone, London, England",
  "summary": "Ada Lovelace was a daughter of Lord Byron who became interested in Babbage's analytic engine and described how it could be programmed.",
  "biografia": "Augusta Ada Byron\n's father was the famous poet Lord George Gordon Byron and her mother was Anne Isabelle Milbanke. Ada's parents married on\n2\nJanuary\n1815\nbut separated on\n16\nJanuary\n1816\n, a month after she was born. On\n25\nApril\n1816\nLord Byron went abroad and Ada never saw her father again. Lord Byron never returned to England and died in Greece when Ada was eight years old. Lady Byron was given sole custody of her daughter Ada, who was declared a Ward in Chancery in April\n1817\n, and she tried to do everything possible in bring up her child to ensure that she would not become a poet like her father.\nLady Byron had been interested in the study of mathematics herself. Lord Byron, before his marriage, had called his future wife \"the Princess of Parallelograms\" and had written to her on\n18\nOctober\n1812\n(\nsee for example\n[\n3\n]\nwhere the letter is quoted\n)\n:-\nI agree with you quite upon Mathematics too - and must be content to admire them at an incomprehensible distance - always adding them to the catalogue of my regrets - I know that two and two make four - and should be glad to prove it too if I could - though I must say if by any sort of process I could convert two and two into five it would give me much greater pleasure. The only part I remember which gave me much delight were those theorems\n(\nis that the word?\n)\nin which after ringing the changes upon A, B and C, D etc I at last came to \"which is absurd - which is impossible\" and at this point I have always arrived and I fear always shall through life ...\nGiven this mathematical frame of mind, which Lord Byron clearly did not share, it was natural that Lady Byron should try to encourage Ada in that direction. Also she considered mathematics a good subject for training the mind to ensure that her daughter took a disciplined approach. Music, Lady Byron believed, was a topic that provided a girl with the right social skills so this was also emphasised in Ada's education. However although Lady Byron devoted much energy to organise Ada's upbringing she herself seems to have spent very little time with her. Lord Byron must have heard about the problems for he wrote to Lady Byron on\n1\nMarch\n1816\n(\nsee for example\n[\n3\n]\nwhere the letter is quoted\n)\n:-\nThey tell me young\n[\nAda\n]\nis well and shows marvellous indications of acquaintance with her nurse and her grandmother - it is perhaps time she should begin to recognise another of her relations.\nThe grandmother that Lord Byron refers to in this quote was Lady Noel, Lady Byron's mother, who was indeed much more in daily contact with Ada than was her mother. Lady Noel, however, died in\n1822\n.\nA number of tutors were employed, often for only a short period, to direct Ada's education. At age about six she had a Miss Lamont as a tutor and, despite her mother's emphasis on mathematics, Ada's favourite subject was geography while arithmetic she only studied reluctantly in order to please her mother. On discovering that Ada preferred geography to arithmetic, Lady Byron insisted that one of Ada's geography lessons be replaced by an arithmetic lesson and shortly after this Miss Lamont was replaced as Ada's tutor. Some members of the family feared that Lady Byron was insisting that her daughter be driven too hard.\nLady Byron ignored the family concerns and kept a constant pressure on her daughter to work hard and long at her lessons. Some rewards were offered but pressure was usually applied by giving Ada punishments like solitary confinement, making her lie motionless, and demanding that she write apologies such as\n(\nsee for example\n[\n3\n]\n)\n:-\nI, Ada, have not done the Notes very well, but I'll try to do it better tomorrow.\nAda's mathematical education was undertaken by a number of private tutors. William Frend, who had tutored Lady Byron in mathematics, was involved in Ada's mathematical education but by this time he was an old man who had not kept pace with mathematical developments. Dr William King was also engaged as a tutor to Ada in\n1829\nbut his interest in mathematics was not very deep and he confessed that he had studied mathematics by reading it rather than by doing it. He continued to give advice for some years and in correspondence with Ada Byron in\n1834\nhe wrote:-\n... you will soon puzzle me in your studies.\nIt is evident that King, the tutor, was rather out of his depth. We say King \"the tutor\" since by\n1834\nthere was a second William King in Ada Byron's life, namely the man she would marry in the following year.\nReturning to the tutors Lady Byron employed to teach the thirteen year old Ada we might also mention Miss Arabella Lawrence who Lady Byron instructed to change Ada's \"argumentative disposition\". Few can have done more to mould the character of their child than Lady Byron did! The young Ada, however, had long suffered some health problems and in\n1829\ncontracted measles from which she took a long while to recover.\nIn\n1833\nAda Byron was presented at court and, on the\n5\nJune that year, she met\nCharles Babbage\nat a party. Two weeks later Ada and her mother visited\nBabbage\n's London studio where the Difference Engine was on display. Ada was fascinated and, according to Sophia Frend, William Frend's daughter and later\nDe Morgan\n's wife, wrote that Ada:-\n... young as she was, understood its working, and saw the great beauty of the invention.\nIn\n1834\n, when Ada was eighteen years old, she met\nMary Somerville\n[\n3\n]\n:-\nMrs\nSomerville\nsent Ada mathematics books, advised her on study, set problems for her, and above all, talked to her young protégée about mathematics. Some of the conversation was about\nBabbage\nand his engines.\nBabbage\nand Mrs\nSomerville\nhad been friends for years and corresponded regularly.\nAda Byron enjoyed attending mathematics and scientific demonstrations with\nMary Somerville\n, but she also enjoyed her company on other occasions. In June\n1835\nshe wrote to William King, her future husband\n(\nsee for example\n[\n3\n]\nwhere the letter is quoted\n)\n:-\nI am going this evening to my friend Mrs\nSomerville\n's to stay the night. She has kindly offered to take me to a concert, which my love of music could not resist.\nAda King became Countess of Lovelace when her husband William King, whom she married on\n8\nJuly\n1835\n, was created an Earl in\n1838\n. They had three children; Byron born\n12\nMay\n1836\n, Annabella born\n22\nSeptember\n1837\nand Ralph Gordon born\n2\nJuly\n1839\n. It was after this, in\n1841\n, that Lovelace began advanced study in mathematics which was provided by\nDe Morgan\n.\nAs we mentioned above, in\n1833\nAda Byron\n(\nas she still was at that time\n)\nhad become interested in\nBabbage\n's analytic engine and, ten years later, she produced an annotated translation of\nMenabrea\n's\nNotions sur la machine analytique de Charles Babbage\n(1842)\n.\nBabbage\n[\n2\n]\ndescribes how this came about:-\nSome time after the appearance of\n[\nMenabrea\n's\n]\nmemoir on the subject in the \"Bibliothèque Universelle de Genève,\" the late Countess of Lovelace informed me that she had translated the memoir of\nMenabrea\n. I asked why she had not herself written an original paper on a subject with which she was so intimately acquainted? To this Lady Lovelace replied that the thought had not occurred to her. I then suggested that she should add some notes to\nMenabrea\n's memoir; an idea which was immediately adopted.\nWe discussed together the various illustrations that might be introduced: I suggested several, but the selection was entirely her own. So also was the algebraic working out of the different problems, except, indeed, that relating to the\nnumbers of Bernoulli\n, which I had offered to do to save Lady Lovelace the trouble. This she sent back to me for an amendment, having detected a grave mistake which I had made in the process.\nThe notes of the Countess of Lovelace extend to about three times the length of the original memoir. Their author has entered fully into almost all the very difficult and abstract questions connected with the subject.\nThese two memoirs taken together furnish, to those who are capable of understanding the reasoning, a complete demonstration - That the whole of the developments and operations of analysis are now capable of being executed by machinery.\nIn the annotations, which were called \"Notes\", Ada Lovelace described how the Analytical Engine could be programmed and gave what many consider to be the first ever computer program. She described the Analytical Engine in the following way\n[\n6\n]\n:-\nThe distinctive characteristic of the Analytical Engine, and that which has rendered it possible to endow mechanism with such extensive faculties as bid fair to make this engine the executive right-hand of abstract algebra, is the introduction into it of the principle which Jacquard devised for regulating, by means of punched cards, the most complicated patterns in the fabrication of brocaded stuffs. It is in this that the distinction between the two engines lies. Nothing of the sort exists in the Difference Engine. We may say most aptly that the Analytical Engine weaves algebraical patterns just as the Jacquard loom weaves flowers and leaves.\nShe also wrote in the Notes\n[\n6\n]\n:-\nAgain,\n[\nthe Analytical Engine\n]\nmight act upon other things besides number, were objects found whose mutual fundamental relations could be expressed by those of the abstract science of operations, and which should be also susceptible of adaptations to the action of the operating notation and mechanism of the engine . . . Supposing, for instance, that the fundamental relations of pitched sounds in the science of harmony and of musical composition were susceptible of such expression and adaptations, the engine might compose elaborate and scientific pieces of music of any degree of complexity or extent.\nLovelace's Notes were published in Richard Taylor's Scientific Memoirs Volume\n3\nin\n1843\nwith the author's name given as AAL. This was the high point of her achievements and for a while she basked in the admiration that she received from her friends who knew who AAL was, but already these friends were showing concern about her health. By the end of the year she was taking several medicines for different health problems which troubled her.\nFollowing the publication of the Notes her life deteriorated, almost certainly the lack of a scientific project, and particularly the fact that she lacked friends with whom she could discuss mathematical and scientific problems, being a major reason for her decline. Certainly she regarded the Notes as her first mathematical publication and wrote in many letters about the many mathematical works that she anticipated would follow. She considered writing a long review, perhaps in the style of her Notes, of\nOhm\n's work\nOn galvanic series, mathematically determined\nbut\nBabbage\n, whom she looked to for encouragement, was becoming depressed at his own lack of success with financing the development of his computers and failed to give her the necessary support. In\n1844\nLovelace wrote to\nDe Morgan\n's wife saying that because of a recent illness:-\n... I have been utterly unable to think even of my studies. I yesterday resumed them; but for some time I must only give them half an hour to an hour a day. Pray tell Mr\nDe Morgan\nall this; he must wonder at not having heard from me.\nLovelace flirted with several of her male acquaintances and there were several scandals. Her husband made sure that over\n100\nof her letters to such friends were destroyed. There was also a problem with over indulgence in wine which became worse when drinking with her meals changed to drinking instead of meals. At one point she considered writing a scientific study of the effects of opium and wine gained from her own experiences. Gambling on horses was another passion in these years and she pawned some of her jewels to finance it. She owed £\n2000\nin gambling debts when she died.\nPerhaps had her husband been a stronger personality, particularly had he been able to match her intellectual abilities, some of the problems might have been avoided, for it was Lady Byron who dominated the whole family. However around\n1850\nLovelace fell out with her mother, almost certainly when she discovered that for years her mother had lied to her about her father Lord Byron. Lady Byron had tried all her life to make sure her daughter was as different from Lord Byron as possible and eventually Lovelace discovered the extent of her mother's manipulation.\nBy January\n1852\nLovelace was wracked with pain, as the cancer which presumably had been a major cause of her health problems for some time, became more acute. Her mind however remained as sharp as ever. Her husband wrote\n(\nsee for example\n[\n5\n]\n)\n:-\nHer mind was invigorated by the society of the intellectual men whom she entertained as guests. ... She mastered the mathematical side of a question in all its minuteness ... her power of generalisation was indeed most remarkable, coupled as it was with that of minute and intricate analysis.\nBabbage\nwas a constant intellectual companion and she ever found in him a match for her powerful understanding, their constant philosophical discussions begetting only an increased esteem and mutual liking.\nIn\n1852\n, when only\n37\nyears of age, Ada died of cancer.",
  "matematicos_citados_na_biografia": [
    "Charles Babbage",
    "Babbage",
    "De Morgan",
    "Mary Somerville",
    "Somerville",
    "Menabrea",
    "numbers of Bernoulli",
    "Ohm"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}