{
  "nome_completo": "Carmen Adelina Gutiérrez Alonso Moreno",
  "nome_curto": "Adelina Gutiérrez Moreno",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moreno/",
  "data_nascimento": "27 May 1925",
  "local_nascimento": "Santiago de Chile, Chile",
  "data_morte": "11 April 2015",
  "local_morte": "Santiago de Chile, Chile",
  "summary": "Adelina Gutiérrez was a Chilean professor, scientist and academic who was the main force behind setting up the first Bachelor's degree in Astronomy in Chile and later the first Master's degree in Astronomy. She was the first Chilean to obtain a doctorate in astrophysics and also the first woman elected to the Chilean Academy of Sciences.",
  "biografia": "Adelina Gutiérrez\n's full name was\nCarmen Adelina Gutiérrez Alonso\nbut after her marriage to Hugo Moreno she used the name\nAdelina Gutiérrez Moreno\n. She was the daughter of Ramón Gutiérrez and Carmen Alonso. Adelina attended the María Auxiliadora school in Santiago de Chile. This school had been founded in\n1884\non Club Hípico street by the Daughters of Mary Help of Christians, a Christian religious order founded in Turin, Italy. In\n1903\nit moved to Avenida Matta\n726\nand it was there when Adelina attended the school. She graduated with good grades from María Auxiliadora school in\n1942\nand, with mathematics and physics her favourite subjects, entered the Pedagogical Institute of the University of Chile to train as a mathematics and physics teacher. We will refer to her as Gutiérrez for the rest of this biography, although from\n1966\non she published under the name Gutiérrez-Moreno.\nMathematics and physics courses at the Pedagogical Institute had undergone major changes under the influence of Carlos Grandjot. You can read about the developments in mathematics and physics at the Pedagogical Institute at\nTHIS LINK\n.\nWhile studying at the Pedagogical Institute, Gutiérrez met a fellow student Hugo Moreno León who was also studying science subjects. She gained the qualification to teach mathematics and physics at schools in\n1948\nand for a short time taught at the Liceo Darío Salas. This co-educational high school opened in\n1947\nin Santiago de Chile and introduced some innovative educational ideas. On\n1\nJune\n1949\nshe began working at the National Astronomical Observatory, which was part of the Faculty of Physical and Mathematical Sciences of the University of Chile. Hugo Moreno also worked at the National Astronomical Observatory and it is unclear whether he influenced Gutiérrez to move to astronomy or whether she influenced him. They married in\n1951\nand went on to have three children: Hugo Moreno, Carmen Moreno and Alfredo Moreno.\nThe National Astronomical Observatory was inaugurated in\n1852\nand was one of the first observatories in Latin America. A government decree of\n14\nJuly\n1927\nhad the University of Chile take charge of the National Astronomical Observatory, so at that time it became part of the Faculty of Physical and Mathematical Sciences. With this decision, the Chilean government transferred the responsibility for the development of astronomy in the country to the University of Chile. Soon after Gutiérrez began working there, Federico Rutllant\n(1904\n-\n1971)\nbecame the director. Rutllant was a mathematician and astronomer who had taught Higher Algebra, Introduction to Infinitesimal Calculus, Plane and Spherical Trigonometry, Analytical Geometry, and Cosmography and Astronomy at the Pedagogical Institute in the\n1940\ns. Gutiérrez's husband, Hugo Moreno, writes\n[\n13\n]\n:-\nIn\n1950\nProfessor Federico Rutllant was appointed Director of the Observatorio Astronómico Nacional. He was a very active and enthusiastic person who had in mind many ambitious programmes which in the long run could contribute to modernise the astronomical activities of the Observatory. Perhaps his most important dream was to see an international astrophysical observatory established in Chile.\nWhen Gutiérrez began working at the National Astronomical Observatory in\n1949\nshe was assigned to mathematical tasks related to the reduction of astronomical data obtained by other colleagues, including her future husband Hugo Moreno. Soon, however, she began to undertake research on her own and her first publication was\nDeterminaciones astronómicas realizadas con teodolito\nⓉ\n(\nAstronomical determinations made with a theodolite\n)\n(1953)\n. Gutiérrez wished to undertake research for a doctorate and was encouraged by the Director of the National Astronomical Observatory. She was also encouraged by her husband. María Teresa Ruiz, who was a student of Gutiérrez's, was the winner of the National Prize for Exact Sciences in\n1997\nand the first woman President of the\nChilean Academy of Sciences\nin\n2016\n, wrote about Gutiérrez undertaking doctoral studies in the United States\n(\nsee\n[\n16\n]\n)\n:-\nThe doctorate is what enables you to do research and she got it at great personal cost. She had the support of her husband, Hugo Moreno, who stayed in Chile with her children while she studied. At that time,\n50\nyears ago, it was something heroic.\nOn\n12\nJanuary\n1960\n, Gutiérrez flew on the airline Lan from Santiago de Chile to Miami, Florida on her way to Indiana University in Bloomington, Indiana. She gives her United States address as Astronomy Department, Indiana University and her permanent address as Rotario Paul Harris\n9041\n, Santiago, Chile. She was awarded a Ph.D. in Astrophysics in June\n1964\nand so became the first Chilean to obtain a doctorate in astrophysics.\nAfter the award of her doctorate, Gutiérrez returned to the University of Chile and together with her husband Hugo Moreno and Claudio Anguita\n(1930\n-\n2000)\n, who was the director of the Department of Astronomy at the University of Chile, worked on setting up the first Bachelor's Degree in Astronomy offered in Chile. The degree was created in\n1965\nand the first students were accepted onto the course in\n1966\n. Also in\n1966\nshe began publishing research papers and had at least\n8\npapers published in the five years\n1966\n-\n1970\n. These\nincluded: The atmospheric extinction at Cerro Tololo\n(1967)\n; Spectrophotometry of early type stars\n(1968)\n;\nSpectrophotometric Parameters of Early-Type stars II. Relative Spectral-Intensity Distributions\n(1968)\n;\nPhotoelectric observations of W Serpentis\n(1969)\n;\nThe Atmospheric Extinction at Cerro Tololo,\n1967\n-\n69\n(1970)\n; and\nEffects of reddening on colour transformations\n(1970)\n.\nThe\nChilean Academy of Sciences\nwas founded in\n1964\n, limited to a maximum of\n18\nmembers. Towards the end of\n1967\nGutiérrez was elected as the first woman member of the Academy. She became the\n12\nth member and the first astronomer to be elected to the Academy. Carlos Mori\n(1904\n-\n1985)\n, who had become its President in September\n1967\n, introduced Gutiérrez saying:-\nIt is an honour for this Academy to be the first to incorporate a lady into its list of members, because all of us recognise in the female sex the same intellectual qualities and human conditions that were attributed for a long time, in my opinion with a false sense of superiority, only to men.\nHaving established a Bachelor's Degree in Astronomy, Gutiérrez worked on the introduction of a Master's Degree in Astronomy in the Faculty of Physical and Mathematical Sciences of the University of Chile. The first students began studying for this Master's Degree in\n1976\n.\nGutiérrez was a pioneer in photoelectric photometry of southern stars and the author of many books and study manuals, among which we mention\nObservando los Astros: Desarrollo de las Técnicas de Astrofísica\nⓉ\n(\nObserving the stars: developing astrophysical techniques\n)\n(1978)\n. In this book she deals chronologically, from\nGalileo\nup to the date on which she wrote the book, with the techniques of astronomy and astrophysics. She writes:-\nThe great scientific advances are usually linked to the invention of new instruments. That is why when we think of the telescope we immediately recall its long and successful association with astronomy. Were it not for this interaction, our current knowledge of the heavens would be similar to that of Renaissance astronomers, who thought that the Solar System reached as far as the orbit of Saturn and that the outer limit of our universe was the stars visible to the naked eye.\nWe have found over\n60\npapers written by Gutiérrez, most of them with her husband and sometimes also with other colleagues. Her youngest son Alfredo Moreno spoke about his parents' academic partnership\n(\nsee\n[\n3\n]\n)\n:-\nThey worked together. For my mother, the fact of having taken an unusual option for the female environment filled her with pride.\nWe should note that Gutiérrez spent much time bringing up her children and only worked part-time until the end of\n1973\n. She was totally committed to her work but was very keen that her young children would also discover the pleasures in the world she was investigating. She always took her three little children for a walk to the Planetarium and often to see the telescopes that were on the Calán and Tololo hills. Her daughter Carmen recalled\n(\nsee\n[\n9\n]\n)\n:-\nShe loved talking about astronomy, so much so that she explained the theory of black holes to us in a simple way for us to understand. My mother narrated a wonderful world and it was impressive how she taught it.\nGutiérrez had interests in addition to astronomy and her family; she loved music, movies and literature. She always read books in her bed and it was usually a book by an author such as Agatha Christie, Barbara Wood, Edgard Alan Poe, Alberto Fuget, Gabriela Mistral or Gustavo Adolfo Bécquer. These last two were poets and Gutiérrez was keen to write poems herself. Her daughter Carmen recalled\n(\nsee\n[\n3\n]\n)\n:-\nI remember reading some poems that my mother wrote to the Virgin Mary.\nMónica Rubio studied at the University of Chile, then was awarded a Ph.D. in Astrophysics and Space Science by the University of Paris in\n1992\n. She received the\n2021\nNational Exact Sciences Award and, in an interview by the Ministry of Science, spoke about the inspiration the Gutiérrez had been to her\n(\nsee\n[\n11\n]\n)\n:-\nI had no references at that time, but I had read Asimov's books with great interest. Then Dr Adelina Gutiérrez, the only woman in the Department of Astronomy, the only astronomer who had a doctorate, made a great impression on me, the rest of the professors had not studied abroad. She was dedicated to an area that did not motivate me much, but the fact that she was a woman, mother of three children, that she had managed to advance her career, travelling abroad, at that time was very pioneering. She was a great encouragement to me.\nFrom\n1\nJanuary\n1974\nGutiérrez worked full time until she retired on\n30\nDecember\n1987\n. She was far too active and enthusiastic to stop work at that time, however, and from\n1\nJanuary\n1990\nshe worked part-time at the observatory at Casa de Bello until\n30\nJune\n1998\n. Although retired, she continued to publish papers, the final three being:\nNew spectroscopic observations of the planetary nebula PC\n11\n(1998)\n;\nTrigonometric distances of planetary nebulae\n(1999)\n; and\nSpectroscopic Observations of Some S-type Symbiotic Stars\n(1999)\n.\nHer husband Hugo Moreno died in\n2000\nbut Gutiérrez outlived him by\n15\nyears during which time she continued to live in Santiago de Chile. She died aged\n89\nand was buried in the Parque del Recuerdo in Santiago on Sunday,\n12\nApril\n2015\n. After her death the\nChilean Academy of Sciences\nhonoured her by establishing the Adelina Gutiérrez Award for Scientific Excellence which recognises outstanding research abilities in those under the age of\n40\n.\nPerhaps Gutiérrez achieved her greatest fame in\n2020\n, five years after her death, when on\n27\nMay of that year, Google celebrated what would have been her\n95\nth birthday with one of their famous doodles on the main page of their search engine in Chile, Argentina and Peru. Ana María Gómez, Marketing Manager of Google Chile, said\n(\nsee\n[\n10\n]\n)\n:-\nFor Adelina the sky was not the limit, and at Google we are proud to be able to celebrate the life and work of this woman who undoubtedly left a great mark in her field of action. With this doodle we want to continue fulfilling our mission of contributing to the conservation and democratisation of the legacy of women like Adelina Gutiérrez and we extend an invitation to learn more about her enormous legacy to national science.\nYou can see the doodle at .\nJosé Maza was a student of Gutiérrez's and he was awarded the National Prize for Exact Sciences in\n1999\n. He said\n(\nsee\n[\n16\n]\n)\n:-\n... all of us who passed through the Observatory in the late\n1960\ns and early\n1970\ns had courses with Adelina Gutiérrez. She made a very solid scientific career and we owe her for having started this path for all of us. ... She was very active in the\n1970\ns and\n1980\ns at the\nChilean Academy of Sciences\n. I have heard that she went to all the meetings, she was always worried about what was going on and she was secretary, treasurer and even got to be vice president.\nLet us end with this quote from\n[\n14\n]\n:-\nToday, when we begin to say goodbye to the International Year of Astronomy, Chile's leading role in the world astronomical concert is recognised. It is, then, the right time to remember and honour the first national astronomer, a pillar of the development of current astrophysics, whose ability and discipline were stronger than the prejudices and limitations of the time.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Chilean Academy of Sciences",
    "Galileo"
  ],
  "imagens": [
    "moreno.jpg"
  ]
}