{
  "nome_completo": "Albert William Tucker",
  "nome_curto": "Albert Tucker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tucker_Albert/",
  "data_nascimento": "28 November 1905",
  "local_nascimento": "Oshawa, Ontario, Canada",
  "data_morte": "25 January 1995",
  "local_morte": "Hightstown, New Jersey, USA",
  "summary": "Albert Tucker was a Canadian mathematician who worked in topology, game theory and non-linear programming. He gave the name and interpretation to the \"prisoner's dilemma\" in game theory.",
  "biografia": "Albert Tucker\nwas known as Al to his friends, colleagues and students. He was born in Oshawa, a small town on the northern shore of Lake Ontario and the family lived in various small towns on the northern shore as he grew up, never spending more than three years in any one place. His father, William B Tucker, had some mathematical training but it was his role as a Methodist minister which led to the many moves. Albert's mother was Florence M Huff. He was his parents' only child and did not begin his school education until he was six years old. He explained in\n[\n8\n]\nhow he became interested in mathematics while in his second year at a small high school with only three teachers covering all subjects. In addition to these teachers, the Principal of the school taught science and mathematics:-\nA few weeks into my Euclidean geometry course, the Principal decided to give us a test. For his own convenience, he used part of a provincial examination. This contained both questions of knowledge and \"originals\". He had not previously given us any originals and didn't expect us to answer them. Well, I didn't know this, so I answered the originals. That night the Principal came to see my father and wanted to know if my father had been coaching me, because my father had taught mathematics for a year of two. My father said \"no\", he had not. Then the Principal said: \"I think your son must be a mathematical genius. I think he can have a very promising career as an actuary!\"\nTucker wanted to study at university but as his family were poor this required him to win a scholarship. He repeated his final year at high school so that he could obtain a scholarship to enter the University of Toronto, coming first in the provincial scholarship examinations in both mathematics and Latin. He began his university studies in\n1924\n, enrolling for the four-year Honors Course in Mathematics and Physics. Although the Principal of his High School had suggested that he aim at becoming an actuary, in fact Tucker thought at this stage that he would become a schoolteacher of mathematics. In his first year at Toronto he took a conic sections course taught by\nJohn Synge\n, who quickly recognised his great potential. As well as mathematics and physics courses, he also took courses in chemistry and astronomy.\nAs part of his physics course he was asked to write a report on quantum mechanics. The subject was in its very early stage at the time and only research papers existed. The chairman of physics was very impressed with Tucker's report and asked him to change from a joint mathematics-physics degree to a single subject physics degree. The chairman of mathematics, Alfred Tennyson DeLury, agreed that he should change to a single subject degree but, of course, thought Tucker should choose mathematics. It was a difficult decision for Tucker who really enjoyed physics but felt that he had a deeper understanding of mathematics. After considerable deliberation, he changed to a mathematics degree realising at the time that he was now taking a course which was not suitable for an intending schoolteacher.\nIn his final year of undergraduate study Tucker was advised by DeLury to go abroad for graduate study. DeLury suggested Paris, Göttingen or Bologna as the best places, with Cambridge as the best option if he felt he had to have teaching in English. Tucker immediately rejected the non-English speaking universities, and wrote to the University of Cambridge enquiring about their graduate programme. In fact the courses did not look too attractive to Tucker so, after the award of his B.A. in\n1928\n, he remained at Toronto for a fifth year. He was employed as a Teaching Fellow during\n1928\n-\n29\nand also worked for his Master's Degree which he was awarded in\n1929\n. DeLury still pressed him to go to Europe to do graduate work or, failing that, to go to Chicago or Harvard. Tucker, however, wanted to go to Princeton and eventually DeLury agreed. This was not the end of his problems since his application to\nHenry Fine\narrived shortly after his death in December\n1928\nand was only later passed to\nLuther Eisenhart\nby which time applications for graduate study had closed. However there was a part-time Instructorship which Princeton was about to fill so, with Alfred DeLury's support, Tucker was appointed to this position for\n1929\n-\n30\n. He was at last able to begin working towards his doctorate with\nSolomon Lefschetz\nas his thesis advisor. He spoke of the faculty members at this time in an interview\n[\n10\n]\n:-\nWhen I was a graduate student - I started in\n1929\nand got my degree in\n1932\n- the chairman of the department and Dean of the Faculty was\nEisenhart\n. He had become Dean of the Faculty in\n1924\n. I'll take the others alphabetically. This is the list for the academic year\n1930\n-\n31\n.\nJames W Alexander\n, professor;\nAlonzo Church\n, assistant professor;\nWilliam Gillespie, professor.\n(\nGillespie had been brought in from the University of Chicago in the\n1890\ns, but he contented himself with teaching underclass courses.\n)\nEinar Hille\n, associate professor. He had come here in the early\n1920\ns from Stockholm.\nMorris Knebelman, assistant professor;\nSolomon Lefschetz\n, professor;\nHoward P Robertson\n, associate professor. We should have mentioned him as one of the people developed here during the\n1920\ns. He took his Ph.D. at Cal Tech and came here on a post-doctoral fellowship. He then was appointed to the faculty.\nTracy Y Thomas, assistant professor. He got his Ph.D. in the '\n20\ns with\nOswald Veblen\n.\nOswald Veblen\n, professor;\nJohn von Neumann\n, professor, but on leave during the first term;\nJoseph H M Wedderburn\n, professor;\nEugene Wigner\n, professor.\nNow\nvon Neumann\nand\nWigner\nshared, at that time, a professorship at Princeton and an appointment in Berlin. One of them would be here for one of the terms, and the other for the other term.\nTucker received his doctorate in\n1932\nfor his thesis\nAn Abstract Approach to Manifolds\n. However, his first research paper came about because he found an error in\nLuther Eisenhart\n's course on Riemannian Geometry which he attended during his year as an Instructor.\nEisenhart\nencouraged him to write it up for publication and\nOn generalised covariant differentiation\nappeared in print in\n1931\n.\nTucker was a National Research Fellow during\n1932\n-\n33\n, spending the autumn term at the University of Cambridge working with\nMax Newman\n. He also attended the International Congress of Mathematicians held in Zürich in September\n1932\nwhere he heard talks from, among others,\nMarston Morse\nand\nJames Alexander\n. In December\n1932\nhe went to Harvard, where he worked with\nMorse\n, leaving in June\n1933\nto spend the summer at the University of Chicago. In\n1933\nhe was appointed as an Instructor at Princeton and was promoted to assistant professor in the following year. He became an associate professor in\n1938\nand a full professor in\n1946\n. On\n17\nDecember\n1938\n, soon after he was promoted to Associate Professor, Tucker married Alice Judson Curtiss. They had three children; sons Alan Curtiss Tucker\n(\nborn\n6\nJuly\n1943)\nand Thomas William Tucker\n(\nborn\n15\nJuly\n1945)\nand a daughter Barbara Jane Tucker.\nIn\n1954\nhe succeeded\nEmil Artin\n(\nwho became\nFine\nProfessor at this time\n)\nas Albert Baldwin Dod Professor of Mathematics at Princeton, having become chairmen of the mathematics department at Princeton in the previous year. He retired in\n1974\nwhen he was named professor emeritus.\nHis early work was in combinatorial topology, continuing to develop the areas he had studied for his thesis. He published papers such as:\nAn abstract approach to manifolds\n(1933)\n;\nOn tensor invariance in the calculus of variation\n(1934)\n;\nNon-Riemannian subspaces\n(1935)\n;\nCell spaces\n(1936)\n;\nOn chain-mappings carried by cell-mappings\n(1939)\n; and\nThe algebraic structure of complexes\n(1939)\n. During World War II Tucker was involved in war work of an applied mathematical nature in the Princeton Fire Control Research Project. Here 'fire control' refers to gunfire controlled by range or height finders. He recalled\n[\n20\n]\n:-\n... from September\n1941\nuntil about\n1944\nI worked for the Princeton Fire Control Research Project, for which I was the so-called Associate Director. Merrill Flood was the Director. I did this in addition to carrying the normal teaching load at the University. ... In\n1943\nthe Army Specialized Training Program started at Princeton, and somewhat later the Naval College Training Program. I had charge of the mathematics portion of the Army Specialized Training Program, and although I did no teaching in the Naval Program I had some administrative responsibility for that. The one somewhat unusual piece of teaching that I did was a mathematics refresher for Naval officers who were being trained in radar.\nAfter the Princeton Fire Control Project ended he then worked as an assistant to\nSamuel Wilks\non statistical projects, and spent some time working with\nvon Neumann\nat the Institute for Advanced Studies on techniques that could be used on the high-speed computer that\nvon Neumann\nwas beginning to develop. He returned to his regular duties at Princeton University in\n1946\nbut found it difficult to pick up his topology research after the forced break caused by World War II. This, in part, led to his involvement with game theory and linear programming for which his name is today most associated.\nGeorge Dantzig\nwas working for the Air Force at the Pentagon and visited\nvon Neumann\nat Princeton in November\n1947\nto explain the simplex method to him.\nDantzig\nreturned to Princeton in early\n1948\nto ask\nvon Neumann\nfor suggestions about where a university project on the mathematics of linear programming might be set up. By chance, on this visit he met Tucker who asked him to explain what linear programming was. Tucker immediately saw it as a topic which would interest him particularly since he saw connections to ideas from his topological research. By the summer of\n1948\nthe project had been set up at Princeton under the Office of Naval Research\n(\nthere was no Office of Air Force Research\n)\nwith Tucker as its director.\nSolomon Lefschetz\nalready had a project going at Princeton with the Office of Naval Research so the two projects were linked. Tucker began work with two graduate students, David Gale and Harold Kuhn, on the connections between linear programming and matrix games. He also had\nJohn Nash\nas a research student from\n1948\n:\nNash\n's thesis\nNon-cooperative Games\nwas submitted in\n1950\n. From this time on Tucker published papers in conference proceedings, choosing to leave the regular journals for younger mathematicians. His publications after the start of this project include:\n(\nwith David Gale and Harold Kuhn\n)\nOn symmetric games\n(1950)\n;\n(\nwith David Gale and Harold Kuhn\n)\nReductions of game matrices\n(1950)\n;\n(\nwith David Gale and Harold Kuhn\n)\nLinear programming and the theory of games\n(1951)\n; and\n(\nwith Harold Kuhn\n)\nNonlinear programming\n(1951)\n. The rest of Tucker's research career was involved in aspects of game theory and linear programming.\nIn\n1949\n-\n50\nTucker took sabbatical leave which he spent at Stanford University. Asked to give an elementary account of game theory to graduate psychology students, he remembered a game Melvin Dresher had told him about. Dresher, along with Merrill Flood, had devised a game to use in a psychology experiment while working at the RAND Corporation. Tucker made up a setting for the Dresher-Flood game which he called the \"Prisoner's dilemma\". Today the Prisoner's dilemma is presented in a slightly more elaborate form, but as Tucker presented it to the psychology students in May\n1950\nit read:-\nTwo men, charged with a joint violation of law, are held separately by the police. Each is told that\n(1)\nif one confesses and the other does not, the former will be given a reward ... and the latter will be given a large fine ...\n(2)\nif both confess, each will be given a small fine ... At the same time each has good reason to believe that\n(3)\nif neither confesses, both will go clear.\nEach argues that, whatever the other does he has a better deal by confessing. So they both confess and receive a small fine. However, if they could cooperate, they could agree that neither will confess and they will both be cleared.\nJ J Kohn became a graduate student at Princeton in\n1953\nat the time Tucker became departmental chairman. He writes\n[\n4\n]\n:-\nFrom the beginning it was clear that Al was the person most responsible for the smooth running of the department. The atmosphere in the old Fine Hall was exceptional; it was stimulating, and it had that rare mixture of friendliness and competitiveness. This optimal environment was largely due to Al's management of the department, his leadership, his sense of fairness, and his commitment to research and teaching.\nIn June\n1961\nTucker was awarded an honorary D.Sc. from Dartmouth College. The President of the College, John Sloan Dickey, addressed Tucker with the following citation\n(\nsee for example\n[\n7\n]\n)\n:-\nNearly three decades ago you began an academic career at Princeton which became a mission to mathematics. In a field where scholarship scores only if the idea is both new and demonstrably true, your ideas have won their way in topology, in the theory of games, and in linear\n[\nand nonlinear\n]\nprogramming. But even in mathematics a mission is more than ideas; it is also always a man, a man who cares to the point of dedication, whose concern is that others should care too, and who can minister to the other fellow, as the need may be, either help or forbearance. Because you, Sir, embody in extraordinary measure both your profession's love of precision and man's need for conscientious leadership, mathematics in America at all levels is today higher than it was and tomorrow will be higher.\nIn\n1967\nthe\nMathematical Association of America\npresented their Award for Distinguished Service to Tucker. The citation reads:-\n... the award is made for outstanding service to mathematics or mathematical education on a national scale. ... the Association has honoured brilliant teachers, statesmen of the mathematical community, creative scientists, and crusading reformers of the nation's mathematical curriculum. The man we honour today has played all these roles with dedicated enthusiasm. By his willing service to those ho would learn, teach, advance, or use mathematics, Albert William Tucker has added measurably to the vigour and quality of mathematics today.\nTucker died of pneumonia at the Presbyterian Home of Meadow Lakes, a nursing home in Hightstown, New Jersey, after a long illness. He and his wife Alice had divorced in June\n1960\nand Tucker had married Mary F Shaw on\n26\nFebruary\n1964\n. He was survived by his second wife Mary, his two sons Alan and Tom\n(\nboth eminent professors of mathematics\n)\n, and his daughter Barbara Tucker Cervone\n(\nSpecial Assistant to the president of Brown University\n)\n.",
  "matematicos_citados_na_biografia": [
    "John Synge",
    "Henry Fine",
    "Luther Eisenhart",
    "Solomon Lefschetz",
    "Eisenhart",
    "James W Alexander",
    "Alonzo Church",
    "Einar Hille",
    "Howard P Robertson",
    "Oswald Veblen",
    "John von Neumann",
    "Joseph H M Wedderburn",
    "Eugene Wigner",
    "von Neumann",
    "Wigner",
    "Max Newman",
    "Marston Morse",
    "James Alexander",
    "Morse",
    "Emil Artin",
    "Fine",
    "Samuel Wilks",
    "George Dantzig",
    "Dantzig",
    "John Nash",
    "Nash",
    "Mathematical Association of America"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}