{
  "nome_completo": "Albrecht Dürer",
  "nome_curto": "Albrecht Dürer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Durer/",
  "data_nascimento": "21 May 1471",
  "local_nascimento": "Imperial Free City of Nürnberg (now in Germany)",
  "data_morte": "6 April 1528",
  "local_morte": "Imperial Free City of Nürnberg (now in Germany)",
  "summary": "Dürer was a German artist who is known for his work as an engraver. The foundations of descriptive geometry are laid in Dürer's treatise on human proportions published in Nuremberg after his death in 1528 .",
  "biografia": "Albrecht Dürer\nwas the third son of Albrecht Dürer and Barbara Holfer. He was one of their eighteen children. The Dürer family came from Hungary, Albrecht Dürer senior being born there, and at this time the family name was Ajtos. The name Ajtos means \"door\" in Hungarian and when Dürer senior and his brothers came to Germany they chose the name Türer which sounds like the German \"Tür\" meaning door. The name changed to Dürer but Albrecht Dürer senior always signed himself Türer rather than Dürer.\nPortraits of his father and mother are at\nTHIS LINK\n.\nAlbrecht Dürer senior was a jeweller who had served his apprenticeship with Hieronymus Holfer, and then married Holfer's daughter. Albrecht Dürer junior wrote about his father and his upbringing\n(\nsee for example\n[\n3\n]\n)\n:-\nMy father suffered much and toiled painfully all his life, for he had no resources other than the proceeds of his trade from which to support himself and his wife and family. He led an honest, God-fearing life. His character was gentle and patient. He was friendly towards all and full of gratitude to his Maker. He cared little for society and nothing for worldly amusements. A man of very few words and deeply pious, he paid great attention to the religious education of his children. His most earnest hope was that the high principles he instilled into their minds would render them ever more worthy of divine protection and the sympathy of mankind. He told us every day that we must love God and be honourable in our dealings with our neighbours.\nAs a young boy Dürer was educated at the Lateinschule in St Lorenz and he also worked in his father's workshop learning the trade of a goldsmith and jeweller. By the age of\n13\nhe was already a skilled painter as seen from a self portrait which he painted at that time.\nYou can see this self-portrait at\nTHIS LINK\nThis was the first of many self-portraits which Dürer painted and they provide a wonderful record. Our collection of such self-portraits is at\nTHIS LINK\n.\nIn\n1486\nDürer became an apprentice painter and woodcut designer to Michael Wolgemut, the leading producer of altarpieces. After an apprenticeship of four years, Dürer had learnt all he could from Wolgemut and had reached a level of artistic quality exceeding that of his famous teacher. Wolgemut advised Dürer to travel to widen his experience and meet other artists. Following Wolgemut's advice, Dürer delayed visiting Italy\n(\nwhich Wolgemut himself never visited\n)\n, where there were very different artistic styles, until he had fully developed his own style and learnt more techniques from other German artists.\nA portrait of Wolgemut is at\nTHIS LINK\n.\nDürer travelled first to Nördlingen, where he met artists of the Swabian school. The Swabian style had been influenced by Dutch artistic design which Dürer had not met before. His next visit was to Ulm where he met more artists of the Swabian school. Dürer\n[\n3\n]\n:-\n... participated with keen enjoyment in the discussions among artists of his own age, in the low-ceilinged taverns, over foaming mugs of beer. These youthful enthusiasts, in common with those of all nations throughout history, were bent on rejuvenation of the art of the world. They were delighted with Dürer's drawings, with his first engravings and the small pictures he had already painted, independently of Wolgemut's directions or opinions.\nLeaving Ulm, Dürer made his way to Constance which charmed him with its fairyland appearance. Basel was the next town which Dürer visited, and he found it quite similar to his home town of Nürnberg. Finally Dürer returned home, making visits to Colmar and Strasbourg on the way.\nIt had been a long journey of great importance to Dürer which had taken nearly four years, but after he returned to Nürnberg in\n1494\nhe felt disappointed that he had not visited Italy. He had also become convinced that\n[\n1\n]\n:-\n... the new art must be based upon science - in particular, upon mathematics, as the most exact, logical, and graphically constructive of the sciences.\nItaly was not only a country with new ideas to offer Dürer in art, but it was also leading the world at this time in the revival of mathematics. Before setting out for Italy, however, Dürer married Agnes Frey, the daughter of a learned man Hans Frey who had made quite a lot of money through making jewellery, musical instruments, and mechanical devices.\nPortraits of Agnes are at\nTHIS LINK\n.\nThe marriage seems to have been more the idea of the parents of Agnes and Albrecht, and the pair were married on\n7\nJuly\n1494\n. It was a marriage which helped raise Dürer's status in Nürnberg, as well as provide him with money which helped him set up his own studio.\nBefore the end of\n1494\n, Dürer was on his travels again, leaving Agnes behind in Nürnberg. First he visited Augsburg where he met strong Italian artistic influences for the first time. Travelling through the Tyrol, he reached Trento and his first view of Italy.\nOne of his paintings of Trento is at\nTHIS LINK\n.\nHe travelled on to Verona before reaching Venice which was his main objective. In Venice, Dürer, as he had done throughout his journeys, sketched scenes, visited galleries and churches, and met with the local artists. One of the artists that he met in Venice, Giovanni Bellini, had an important influence on Dürer for\n[\n3\n]\n:-\n... everything that\n[\nVenice\n]\ncould teach him was to be found in Giovanni's paintings. He cultivated the artist's society, therefore, with a devotion both impassioned and deferential, retaining throughout his life, with his whole heart and soul, unbounded feelings of gratitude to the man whose pictures had unveiled so wonderful a world to him.\nDürer returned to Nürnberg in\n1495\n, and although he does not seem to have met with any of the major Italian mathematicians on his journeys, he did meet Jacopo de Barbari who told him of the mathematical work of\nPacioli\nand its importance to the theory of beauty and art. Nor did Dürer meet with\nLeonardo da Vinci\nwhile in Italy, but he learnt of the importance which that artist placed in mathematics. Back in Nürnberg, Dürer began a serious study of mathematics. He read\nEuclid\n's\nElements\nand the important treatise\nDe architectura\nⓉ\n(\nArchitecture\n)\nby\nVitruvius\n(1\nst\ncentury BC\n)\n, the famous Roman architect and engineer. He also became familiar with the work of\nAlberti\nand\nPacioli\non mathematics and art, in particular work on proportion.\nIt was not only this scientific approach to art that influenced Dürer as he began his artistic career in Nürnberg, but he also benefited from seeing different artistic styles and the different scenery which he had viewed\n[\n3\n]\n:-\nThe variety of regions through which Dürer had passed in the course of his travels and the care he had taken with the drawings and water-colours he had made of the most attractive or unfamiliar of them had provided him with a great range of pictorial motives emanating from the most diverse sources.\nIn\n1495\nDürer was still not well known as an artist in the highest circles but news of his skill reached Frederick the Wise, Elector of Saxony, and Dürer was commissioned to paint his portrait. Frederick liked his portrait which Dürer painted in April\n1496\nwhen Frederick had visited Nürnberg. Despite Frederick's attempts to persuade Dürer to move to Weimar and become Court painter, the artist did not wish to leave Nürnberg.\nYou can see this portrait at\nTHIS LINK\n.\nHe was deeply attached to Nürnberg, painting views of the city in\n1497\nthat you can see at\nTHIS LINK\n.\nFrom about\n1500\nDürer's art showed the influence of the mathematical theory of proportion which he continued to spend so much time studying. It is claimed that his\nself-portrait in a wig\nmade in\n1500\nhas the dimensions of the head constructed proportionally. See\nTHIS LINK\n.\nFor the engraving\nAdam and Eve\nmade in\n1504\n, Dürer described the intricate\nruler and compass\nconstructions which he made to construct the figures. See\nTHIS LINK\n.\nIt was not only the mathematical theory of proportion which influenced Dürer's art at this period, but also his mastery of perspective through his study of geometry. This is most clearly seen in his woodcuts\nLife of the Virgin\nmade between\n1502\nand\n1505\n. See\nTHIS LINK\n.\nDuring the ten years after\n1496\nDürer went from a relatively unknown artist to someone with a wide reputation as both an artist and a mathematician. His personal circumstances had changed greatly. His father had died in\n1502\nand Dürer was left to care for his invalid, and nearly blind, mother. He had set up his own printing press while he, or often his wife, sold his works to buyers at local fairs. It was a difficult life and one in which Dürer's health began to suffer. In fact he would never regain full health during the rest of his life.\nFrom\n1505\nto\n1507\nDürer made a second visit to Italy, spending much time again in Venice. It was a very different visit from his first, with Dürer now more interested in his international fame than in learning about art. He was so conscious of his fame, and the threat he perceived that he might hold to the local artists, that\n[\n3\n]\n:-\n... he refused invitations to dinner in case someone should try to poison him.\nIt was not about art that Dürer now wished to learn from the Italians, but rather about mathematics. He visited Bologna to meet with\nPacioli\nwhom he considered held the mathematical secrets of art. He also visited Jacopo de Barbari and the great efforts which Dürer made to meet de Barbari shows the importance which Dürer more and more attached to mathematical knowledge. Dürer returned to Nürnberg from this second visit to Italy feeling that he must delve yet more deeply into the study of mathematics.\nIn about\n1508\nDürer began to collect material for a major work on mathematics and its applications to the arts. This work would never be finished but Dürer did use parts of the material in later published work. He continued to produce art of outstanding quality, and he produced one of his most famous engravings\nMelancholia\nin\n1514\n.\nYou can see this engraving at\nTHIS LINK\nIt contains the first\nmagic square\nto be seen in Europe, cleverly including the date\n1514\nas two entries in the middle of the bottom row. Also of mathematical interest in\nMelancholia\nis the polyhedron in the picture. The faces of the polyhedron appear to consist of two equilateral triangles and six somewhat irregular pentagons. An interesting reconstruction of the polyhedron is given in\n[\n19\n]\n, see also\n[\n18\n]\nfor further details.\nDürer worked for Maximilian I, the Holy Roman emperor, from about\n1512\n. Maximilian, however, had little in the way of wealth to pay for Dürer's work and he asked the councillors of Nürnberg to exempt Dürer from taxes as compensation. He then asked the councillors to pay Dürer a pension on his behalf, which certainly did not please them. From about\n1515\nthe councillors tried to avoid paying this pension. Dürer met Maximilian personally for the first time in\n1518\nand, probably from one sitting in Augsburg, painted Maximilian's portrait. See\nTHIS LINK\n. The following year Maximilian died and this was the final excuse for the councillors to refuse to make any further payment, saying that the new emperor Charles would have to agree to the pension.\nAlthough Dürer was fairly well off by this time and the pension was not necessary for him, it was more a matter of prestige to have his pension restored. He set off for Antwerp on\n15\nJuly\n1520\nwith his wife and their maid to visit the Emperor Charles V. Passing through Aachen, Dürer sketched the cathedral at Aachen. See\nTHIS LINK\nDürer had a second reason for this visit to the Netherlands, for he believed that Maximilian's daughter had a book by Jacopo de Barbari on applications of mathematics to art, and Dürer had long sought the truths which he believed this work contained. On meeting Maximilian's daughter he offered her the portrait of her father which he had painted, but was distressed to find that she did not want the portrait. She had already given the book by Jacopo de Barbari to another artist so Dürer's quest was in vain. He did persuade Charles V to restore his pension, however, which was formally agreed on\n12\nNovember\n1520\n.\nAfter returning to Nürnberg, Dürer's health became still worse. He did not slacken his work on either mathematics or painting but most of his effort went into his work Treatise on proportion. Although it was completed in\n1523\n, Dürer realised that it required mathematical knowledge which went well beyond what any reader could be expected to have, so he decided to write a more elementary text. He published this more elementary treatise, in four books, in\n1525\npublishing the work through his own publishing company.\nThis treatise,\nUnterweisung der Messung mit dem Zirkel und Richtscheit\nⓉ\n(\nTraining of measurement with the compass and straightedge\n)\n, is the first mathematics book published in German\n(\nif one discounts an earlier commercial arithmetic book\n)\nand places Dürer as one of the most important of the Renaissance mathematicians. Dürer's sources for this work are discussed in\n[\n21\n]\nwhere three main sources are suggested\n(\ni\n)\nthe practical recipes of craftsmen,\n(\nii\n)\nclassical mathematics from printed works and manuscripts, and\n(\niii\n)\nthe manuals of Italian artists. The article\n[\n16\n]\ngives many details of the mathematics contained in the treatise.\nThe first of the four books describes the construction of a large number of curves, including the\nSpiral of Archimedes\n, the\nEquiangular or Logarithmic Spiral\n, the\nConchoid\n,\nDürer's Shell Curves\n, the\nEpicycloid\n, the\nEpitrochoid\n, the\nHypocycloid\n, the\nHypotrochoid\n, and the\nLimaçon of Pascal\n(\nalthough of course Dürer did not use that name!\n)\n. Details about Dürer's descriptions of the curves, in particular one he calls a \"muschellini\", is given in\n[\n9\n]\n.\nIn the second book he gave exact and approximate methods to construct regular polygons. Dürer's constructions of regular polygons with\n5\n,\n7\n,\n9\n,\n11\nand\n13\nsides is discussed in\n[\n12\n]\n. Dürer also gave approximate methods to\nsquare the circle\nusing ruler and compass constructions in this book. A method to obtain a good approximation to the\ntrisector of an angle\nby Euclidean construction is also given.\nBook three considers pyramids, cylinders and other solid bodies. The second part of this book studies sundials and other astronomical instruments. The final book studies the five Platonic solids as well as the semi-regular Archimedean solids. Also in this book is Dürer's theory of shadows and an introduction to the theory of perspective.\nIn\n1527\nDürer published another work, this time on fortifications. There were strong reasons why he produced a work on fortifications at this time, for the people of Germany were in fear of an invasion by the Turks. Many cities, including Nürnberg, would improve their fortifications using the methods set out by Dürer in this book. Dürer's final masterpiece was his\nTreatise on proportion\nwhich was at the proof stage at the time of his death.\nDescriptive geometry originated with Dürer in this work although it was only put on a sound mathematical basis in later work of\nMonge\n. One of the methods of overcoming the problems of projection, and describing the movement of bodies in space, is descriptive geometry. Dürer's remarkable achievement was through applying mathematics to art, he developed such fundamentally new and important ideas within mathematics itself.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Pacioli",
    "Leonardo da Vinci",
    "Euclid",
    "Vitruvius",
    "Alberti",
    "ruler and compass",
    "magic square",
    "Spiral of Archimedes",
    "Equiangular or Logarithmic Spiral",
    "Conchoid",
    "Dürer's Shell Curves",
    "Epicycloid",
    "Epitrochoid",
    "Hypocycloid",
    "Hypotrochoid",
    "Limaçon of Pascal",
    "square the circle",
    "trisector of an angle",
    "Monge"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}