{
  "nome_completo": "Alessandro Padoa",
  "nome_curto": "Alessandro Padoa",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Padoa/",
  "data_nascimento": "14 October 1868",
  "local_nascimento": "Venice, Italy",
  "data_morte": "25 November 1937",
  "local_morte": "Genoa, Italy",
  "summary": "Alessandro Padoa was an Italian mathematician and logician.",
  "biografia": "Alessandro Padoa\n's parents were Pellegrino Padoa and Pasqua Levi. The family was Jewish and Alessandro was brought up in the Jewish faith. He was educated at the Technical Institute 'Paolo Sarpi' in Venice, graduating from this high school in\n1885\n. He began studying engineering at the University of Padua but then, for family reasons, he moved to the University of Turin in January\n1889\n. Then in March of that year he moved again, this time to the University of Bologna. He returned to the University of Turin for session\n1894\n-\n95\nwhere he attended two courses given by\nGiuseppe Peano\n, one on the infinitesimal calculus and the other on higher geometry which made particular study of the geometric contributions of\nHermann Grassmann\n. He was greatly influenced by\nPeano\nwho was to direct Padoa's research. Padoa was awarded a mathematics degree from the University of Turin on\n26\nNovember\n1895\nand he continued to study at Turin for his Diploma in Mathematical Education which was necessary for him to become a high school teacher. He received the diploma on\n20\nJune\n1896\nbeing awarded the highest grade.\nAfter graduating, Padoa became a secondary school teacher of mathematics following the advice of\nEnrico D'Ovidio\n, teaching first at the high school in Pinerolo as well as at the Technical Institute \"Michele Buniva\" in that city where he acted as a substitute for Carlo Vercesi. In\n1898\nhe moved to Sondrio where he taught for a year at the Technical Institute, following which he went to Rome where he taught from\n1899\nto\n1904\nat the Technical College \"Pietro della Valle\". Moving on again, he spent two years teaching at the Nautical Institute in Chioggia\n(1904\n-\n06)\n, the following two years\n(1906\n-\n08)\nat the Technical Institute \"Pietro Martini\" in Cagliari, and then sixteen years at the Technical Institute \"Vittorio Emanuele\" in Genoa. His final move as a school teacher saw him remain in Genoa but become a teacher at the High School \"Cristoforo Colombo\" from\n1924\nuntil he retired in\n1935\n. However, Padoa also gave many lecture courses at Naval Academy in Genoa including 'Algebraic Analysis'\n(1911\n-\n12\nand\n1913\n-\n14)\n, 'Infinitesimal Calculus'\n(1912\n-\n13)\nand 'Further Mathematics'\n(1914\n-\n1930)\n. He shared the 'Further Mathematics' course with\nGiuseppe Vitali\n, the two mathematicians teaching it in alternate years.\n(\nBefore Padoa became a teacher at the High School \"Cristoforo Colombo\" in Genoa,\nVitali\nhad taught there from\n1904\nto\n1923\n.\n)\nIn\n1932\nPadoa was appointed as a lecturer in Mathematical Logic at the University of Genoa and he held this post until\n1936\nwhen he reached the age limit for lecturers and was forced to retire. This was certainly not the first time that Padoa had attempted to leave school teaching and become a university lecturer; he had applied unsuccessfully for a lectureship in Mathematical Logic in\n1901\n, a lectureship in Descriptive Geometry in\n1909\n, and a lectureship in Theoretical Philosophy in\n1912\n. After he was appointed at the staff of the University of Genoa, he taught courses on 'Mathematical Logic'\n(1932\n-\n34)\n, 'Ideographic Logic'\n(1934\n-\n37)\n, and 'Descriptive Geometry'\n(1935\n-\n36)\n.\nPadoa became a member of the examination committee for the Technical College in the Sampierdarena district of Genoa in\n1914\n. He was on the examination committee for the Matura, the Italian final secondary school examination, in Milan in\n1924\n, in Modena in\n1925\nand in Imperia, Liguria, in\n1933\n. Padoa also gave lectures at many philosophy and mathematics congresses. Beginning in\n1898\nhe gave a series of lectures at the Universities of Brussels\n(1898)\n, Pavia\n(1899)\n, Rome\n(1900\n,\n1901\n,\n1903)\n, Padua\n(1905)\n, Cagliari\n(1907)\nand Geneva\n(1911)\n. He lectured at congresses in Paris\n(1900\n,\n1935)\n, Rome\n(1908)\n, Cambridge\n(1912)\n, Livorno, Parma, Padua, Bologna\n(1911\n,\n1928)\nand Florence\n(1937)\n.\nLet us now look briefly at Padua's research contributions. He belonged to\nPeano\n's school of mathematical logic, popularising this type of work. He gave the important lecture\nEssay of an algebraic theory of whole numbers, preceded by a logical introduction to any deductive theory\nat the International Congress of Philosophy in Paris in\n1900\n. He had discovered an important method in the theory of definition. He had drawn a parallel between the axiomatic method, where theorems are deduced from axioms, and deducibility from primitive terms. Padoa was the first to present a method to prove that a primitive term of a theory cannot be defined within the system using the remaining primitive terms. This result was first made public in his lecture at the Paris Congress referred to above. Padoa believed, correctly, that his result was of major importance and wrote in this paper:-\nWe can now settle completely\n(\nand, we believe, for the first time\n)\na question of the greatest logical importance.\nHe explained how he had settled the question:-\nTo prove that the system of undefined symbols is irreducible with respect to the system of unproved propositions, it is necessary and sufficient to find, for each undefined symbol, an interpretation of the system of undefined symbols that verifies the system of unproved propositions and that continues to do so if we suitably change the meaning of only the symbol considered\nThis work became even more important when\nmodel theory\nwas developed and\nTarski\nproved Padoa's method in\n1924\n. Immediately following the Congress of Philosophy in Paris, the Second International Congress of Mathematicians took place in\n1900\n. Padoa spoke on\nA new system of definitions for Euclidean geometry\nbut began with a summary of his lecture at the Philosophy Congress.\nCharlotte Scott\nfound this one of the most interesting talks at the Congress but wrote:-\nMr Padoa did not get beyond this definition, possibly because he had entered so minutely into the details of the proof of the independence of the seven postulates that he had exhausted his allowance of time.\nGeorge Halsted\nalso attended the Congress and wrote that Padoa was:-\n... among the most interesting personalities present.\nIn March\n1903\nPadoa published a long deep article in\nL'Enseignement Mathématique\non compatibility of axioms and non-contradictory axioms. He wrote the article in response to the problems that had arisen in set theory which became clear following the work of\nBertrand Russell\n. This led to a lively debate in which\nDavid Hilbert\nparticipated. Padoa published the\n106\n-page book\nLa Logique Déductive dans sa dernière Phase de Développement\nⓉ\n(\nDeductive logic in its final development phase\n)\nin\n1912\n. This book had appeared as three separate papers in\nRevue de metaphysique et de morale\nin\n1911\nand\n1912\n. A Foreword to the book was written by\nGiuseppe Peano\n:-\nVarious scientists from all countries who have adopted the ideographic logic believe that it is refined and completed today. M Padoa - previously my distinguished student and now my colleague and my friend - has given to this subject, since\n1898\n, a series of well-attended conferences in the Universities of Brussels, Pavia, Rome, Padua, Cagliari and Geneva, and has presented highly regarded papers to the Congresses of philosophy and mathematics in Paris, Livorno, Parma, Padua and Bologna. Continuing his work as a collaborator and adviser, M Padoa has led everyone to appreciate the simplicity and power of the ideographic language - which has given birth to a new development in deductive logic and a further analysis of the different branches of mathematics - and to consult profitably and easily the many books in which it is applied. The aim of this work seems to me to present it in a way which is clear, orderly, and complete: it contains the explanation of all the logical symbols, the study of their properties, analysis of their relationships and their reduction to minimum, due to M Padoa. Many examples, drawn from everyday language and scientific language, make reading the work more intelligible and more enjoyable, and well-chosen historical references trace the progress of these studies from Leibniz to the present. Finally, although it is fairly thin, this treatise contains everything we know about this science which is relevant to both philosophers and mathematicians.\nPadoa himself explains what he hoped to achieve in the book:-\nI do not hope to suggest to you the sympathetic and touching optimism of\nLeibniz\n, who, prophesying the triumphal success of these researches, affirmed: 'I dare say that this is the last effort of the human mind, and, when this project shall have been carried out, all that men will have to do will be to be happy, since they will have an instrument that will serve to exalt the intellect not less than the telescope serves to perfect their vision'. Although for some fifteen years I have given myself up to these studies, I have not a hope so hyperbolic; but I delight in recalling the candour of this master who, absorbed in scientific and philosophic investigations, forgot that the majority of men sought and continue to seek happiness in the feverish conquest of pleasure, money, and honours. Meanwhile we should avoid an excessive scepticism, because always and everywhere, there has been an elite - today less restricted than in the past - which was charmed by, and delights now in, all that raises one above the confused troubles of the passions, into the imperturbable immensity of knowledge, whose horizons become the more vast as the wings of thought become more powerful and rapid.\nPhilip Jourdain\nreviewed the book\n[\n6\n]\n:-\nThis admirable exposition of the mathematical logic of\nPeano\nand his school was given in the form of lectures delivered under the auspices of the University of Geneva, and was published in the 'Revue de Metaphysique et de Morale' for\n1912\n. It fulfils this purpose remarkably well.\nIn\n1937\n, after he retired, Padoa published the paper\nCe que la Logique doit a Peano\nⓉ\n(\nWhat logic is necessary for Peano?\n)\n. Cooper Harold Langford writes\n[\n8\n]\n:-\nLogic, Padoa says, is not in a particularly fortunate position. On the one hand, philosophers prefer to speak of it without using it, while on the other hand mathematicians prefer to use it without speaking of it and even without desiring to hear it spoken of. The paper contains an outline of the fundamental ideas introduced into logic by\nPeano\n, together with examples illustrating how the distinctions\nPeano\ndrew remove confusions and paradoxes.\nPadoa was also a well-respected contributor of papers on the teaching of elementary mathematics and on mathematical education. The topics which interested him were extremely wide with his contributions ranging from regular polygons to magic triangles and from the theory of fractions to complex numbers. He played a major part in the journal\nMathesis\nof the Italian association of mathematics teachers from its founding in\n1895\n. The journal was mainly concerned with discussing details of mathematical subjects taught in school rather than with pedagogical issues. He published the book\nMatematica intuitiva\nⓉ\n(\nIntuitive mathematics\n)\n(1923)\nand important papers on the training of high school mathematics teachers. Padoa was invited by\nGuido Castelnuovo\nto participate in the International Commission on Mathematical Instruction founded at the International Congress of Mathematicians at Rome in\n1908\n. He submitted a major report in\n1912\nto the Commission making suggestions regarding the training of school teachers and the teaching of mathematics in primary and secondary schools.\nIn\n1934\nPadoa was awarded the mathematics prize of the\nAccademia dei Lincei\nand in the following year he was presented with a prize by the\nRoyal Academy of Italy\n.\nFinally we note that Padoa married Elisabetta Padoa\n(\nborn at Bologna on\n30\nAugust\n1870)\n, the daughter of Felice Padoa and Ginevra Vivanti: they had three children, Baldo\n(\nborn at Turin on\n13\nDecember\n1893)\n, Gino\n(\nborn at Pinerolo on\n8\nFebruary\n1898)\nand Giovanna\n(\nborn at Bologna on\n14\nOctober\n1901)\n. Padoa was a man of broad cultural interests including art, poetry and politics. He was active in the Jewish community of Genoa and followed closely the events of the Zionist movement. He died from heart disease at the age of sixty-nine.",
  "matematicos_citados_na_biografia": [
    "Giuseppe Peano",
    "Hermann Grassmann",
    "Peano",
    "Enrico D'Ovidio",
    "Giuseppe Vitali",
    "Vitali",
    "model theory",
    "Tarski",
    "Charlotte Scott",
    "George Halsted",
    "Bertrand Russell",
    "David Hilbert",
    "Leibniz",
    "Philip Jourdain",
    "Guido Castelnuovo",
    "Accademia dei Lincei",
    "Royal Academy of Italy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}