{
  "nome_completo": "Alexandru Ioan Lupas",
  "nome_curto": "Alexandru Lupas",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lupas/",
  "data_nascimento": "5 January 1942",
  "local_nascimento": "Arad, Romania",
  "data_morte": "14 August 2007",
  "local_morte": "Sibiu, Romania",
  "summary": "Alexandru Lupas was a Romanian mathematician who was a specialist in approximation theory and classical analysis.",
  "biografia": "Alexandru Lupas\nwas brought up in Arad, Romania. Arad is in western Romania, the city belonging to Hungary until the end of World War I. He attended the Moise Nicoara high-school in Arad, an excellent school which had been taken over by the Romanian State in\n1934\n. After graduating from the high school he entered Babeș-Bolyai University in Cluj. The University was an excellent one at which to study mathematics and there he was taught by some outstanding mathematicians including\nGheorghe Calugăreănu\n, Dumitru V Ionescu, Tiberiu Mihailescu, Petru T Mocanu,\nGheorghe Pic\n,\nTiberiu Popoviciu\n,\nFerenc Rado\n, and\nDimitrie D Stancu\n.\nLupas graduated in\n1964\nand was then appointed as a researcher at the Institute of Numerical Computation of the\nRomanian Academy\nin Cluj-Napoca. The\nRomanian Academy\nhad set up the Mathematical Institute at Cluj-Napoca in\n1948\nand it had become the Institute of Numerical Computation of the\nRomanian Academy\nin\n1957\n. At this time it consisted of two departments, the Department of Approximation and Calculus, and the Computer Department. Lupas held this appointment until\n1975\nwhen the Institute of Numerical Computation was transferred from the\nRomanian Academy\nto the National Education Minister and the number of researchers reduced from\n48\nto\n6\n. While working at the Institute of Numerical Computation, Lupas published a number of excellent papers. For example\nOn Bernstein power series\n(1966)\nwas reviewed by D E Wulbert who wrote:-\nThe author first develops a method for constructing sequences of positive linear operators on a subspace of bounded functions on the real line. As special cases of his general method, the author constructs the\nSzász\n-Mirakjan and Baskakov operators. These latter operators are studied in the second part of the paper, where they are shown to exhibit some properties similar to those of the Bernstein operator.\nIn\n1967\nhe published\nSome properties of the linear positive operators. I\n,\nApproximationseigenschaften der Gammaoperatoren\n,\nSome properties of the linear positive operators. II\n, and\n(\nwith Gheorghe Cimoca\n)\nTwo generalizations of the Meyer-König and Zeller operator\n.\nHis outstanding work led to him winning a Humboldt scholarship to enable him to undertake research at the Universities of Stuttgart and Tübingen. He worked for his doctorate with Werner Meyer-König as his thesis advisor and was awarded the degree of Doktor der Naturwissenschaften from Universität Stuttgart in\n1972\nfor his thesis\nDie Folge der Betaoperatoren\nⓉ\n(\nThe sequence of beta operators\n)\n. He graduated with distinction on\n28\nApril\n1972\nand then returned to Cluj where he undertook research for a second doctorate. His advisor\nTiberiu Popoviciu\nsadly died in\n1975\nso Lupas was advised by\nDimitrie D Stancu\nfor the final months of his work. He submitted this second thesis\nContributions to the Theory of Approximation by Linear Operators\nto Babeș-Bolyai University in\n1976\n. In the same year he was appointed as a lecturer at the University of Sibiu, the year in which the university became an independent institution. Before this higher education in Sibiu had been part of the University of Cluj.\nIn\n1969\nhe attended, by invitation, the conference 'Iterationsverfahren, Numerische Mathematik, Approximationstheorie' at the Oberwolfach research centre in the Black Forest in Germany. There he presented a paper\nOn the approximation by linear positive operators\nwhich was summarised by Sheldon Eisenberg:-\nIn the first part of this paper, the author discusses the graphic behaviour of the\nSzász\n-Mirak'jan operator. Specifically, he gives conditions under which the operator preserves convexity, concavity, and polynomiality. The second part of the paper continues his work on the Baskakov operator. Here he gives conditions under which the Baskakov operator is variation-diminishing.\nIn\n1971\nhe published\nOn the approximation by linear operators of the class\nS\nm\nS_{m}\nS\nm\n​\n, and in the following year\nAn integral inequality for convex functions\n. In all he published over\n100\nresearch papers,\n6\nresearch level monographs and\n10\ntextbooks.\nWe noted above that Lupas was appointed to the University of Sibiu in\n1976\n. The university did not find favour with the government and gradually through the\n1980\ns they closed down the schools until only the School of Mechanical Engineering remained. At this point it became part of the Polytechnic School of Cluj-Napoca. After the Revolution of December\n1989\nmoves were rapidly put in place to refound the University of Sibiu and it was formally reconstituted on\n5\nMarch\n1990\n. On\n12\nMay\n1995\n, the University of Sibiu was granted the name of the distinguished Romanian writer and philosopher, Lucian Blaga.\nLupas was a major figure in the affairs of the university through this difficult period.  In\n1980\nhe was promoted to associate professor, then to full professor in\n1990\nwhen the University was formally founded again. He held this professorship until his death. He also held a number of important positions such as the Chair of Applied Mechanics from\n1982\nto\n1985\n. After the University of Sibiu properly existed again as an institution in its own right in\n1990\nhe became Rector of the University for the year and Dean of the Faculty of Sciences from\n1990\nuntil\n1992\n. He was also appointed vice-rector of the Romanian-German University of Sibiu\n(1998\n-\n1999)\nand, after the University was renamed, Head of the Department of Mathematics of Lucian Blaga University from\n1999\nto\n2000\n.\nLupas was married to Luciana who was herself an eminent mathematician on the staff of the university. Alexandru and Luciana Lupas, together with Heiner, were editors of the Proceedings of the conference\nMathematical analysis and approximation theory\nwhich consisted of papers presented to the\n5\nth\nRomanian-German Seminar on Approximation Theory held in Sibiu from\n12\nto\n15\nJune\n2002\n. He published two papers in these proceedings,\nThe positivity of a certain quadrature\nand\nq-analogues of Stancu operators\n. In\n2002\nhe published a joint paper with his wife in\nProperties of Stancu operators\n. Alexandru and Luciana Lupas write:-\nThe paper is concerned with the\nStancu\noperators ... After the pioneering work of\nD D. Stancu\n(1968)\n, these operators have been successfully used by other mathematicians to study properties of linear positive methods of approximation. A substantial part of contributions in this field can be found in the survey\n[\nB Della Vecchia\n(1992)]\n. In this paper we present some properties related to the operators ... . For instance, we prove a representation of the remainder term and also some mean value theorems. At the end we discuss a quadrature formula for\nStancu\noperators.\nThe authors of\n[\n2\n]\npay this tribute to Lupas:-\nThis year, on August\n14\n, the mathematical community suffered a big loss: the decease of Professor Alexandru Lupas, a distinguished Romanian mathematician, one of the most important of his generation. Professor at the Department of Mathematics of the University \"Lucian Blaga\" in Sibiu, Romania, he was a specialist in Approximation Theory, Classical Analysis, Inequalities, Convexity, Numerical Analysis, Special Functions, Finite Operatorial Calculus\n(\nUmbral Calculus\n)\nand q-Calculus. His unexpected death, occurring only one year after the death of his wife Luciana Lupas, also a distinguished mathematician at the University \"Lucian Blaga\" in Sibiu, shocked not only his family, but also his friends, disciples, PhD students and students. He was an extraordinarily kind man, with a pleasant personality and an optimistic view of the world, life and work. For many, he was a master, an advisor and a friend.",
  "matematicos_citados_na_biografia": [
    "Gheorghe Calugăreănu",
    "Gheorghe Pic",
    "Tiberiu Popoviciu",
    "Ferenc Rado",
    "Dimitrie D Stancu",
    "Romanian Academy",
    "Szász",
    "Stancu",
    "D D. Stancu"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}