{
  "nome_completo": "Alexander George Burgess",
  "nome_curto": "Alexander Burgess",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burgess/",
  "data_nascimento": "24 December 1872",
  "local_nascimento": "Wishaw, Lanarkshire, Scotland",
  "data_morte": "29 March 1932",
  "local_morte": "Rothesay, Bute, Scotland",
  "summary": "Alexander Burgess graduated from Edinburgh and taught at Merchiston Castle School Edinburgh and at Rothesay Academy. He became Rector of the latter school.",
  "biografia": "Alexander Burgess\n's father was  John Burgess\n(\nborn Inveravon, Banffshire in about\n1839)\nwho was a bank agent, writer and notary. His mother was  Annie McIntosh Burgess\n(\nborn in Cullen, Banffshire in about\n1840)\n. Alexander Burgess had an older sister Annie\n(\nborn about\n1871)\nand three younger sisters Frances\n(\nborn about\n1875)\n, Mabel\n(\nborn about\n1877)\n, and Elizabeth\n(\nborn about\n1880)\n.\nAlexander Burgess attended Wishaw Academy, then spent four years at George Watson's College, Edinburgh, before entering the University of Edinburgh in October\n1890\n. In his first year of study Burgess took courses in Latin, Greek and Mathematics. In session\n1891\n-\n92\nhe studied Latin, Greek, Mathematics, and Natural Philosophy. In addition to taking Honours courses in Mathematics and Natural Philosophy over the next two sessions, Burgess also took the Ordinary course in Logic and Metaphysics. He was awarded an M.A. from Edinburgh with First Class Honours in Mathematics and Natural Philosophy in\n1894\n.\nAfter an appointment as a Mathematics Master at Merchiston Castle School, Edinburgh, he was appointed Mathematical master and second master in Rothesay Academy. He spent five years in this position then returned to Edinburgh in\n1900\nto work in the Mathematical department of Edinburgh Ladies' College. He spent\n17\nyears in this College before he was appointed Rector of Rothesay Academy, Bute, in\n1917\n. After his death a memorial plaque was unveiled in the school and we quote from the Press Release for that occasion:-\nDr Burgess's rectorship coincided with a remarkable development of the roll and of the work of the Academy. ...\nDr Burgess gave his school a signal example of devotion to knowledge, industry, kindliness of heart, high ideals. He was hampered in the later years by his health; he was stricken towards the end by grievous domestic afflictions, but he served his day and generation well, he spent more than half of his active life in Rothesay, and he enabled many a Rothesay boy and girl to develop their gifts to the maximum and to increase their usefulness to the country and the Empire.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n3\nMarch\n1902\nhaving been proposed by\nJohn Alison\n,\nWilliam Peddie\n,\nGeorge Chrystal\n, and\nJohn Sturgeon Mackay\n.\nBurgess was an active member of the\nEdinburgh Mathematical Society\n, serving on the Committee from November\n1906\n, serving as an editor of the\nProceedings\nin\n1907\n-\n08\n, then Secretary during\n1908\n-\n11\n, vice-President in\n1911\n-\n12\n, and as President of the Society in\n1912\n-\n13\n. This was a particularly important Presidency for in the summer of\n1913\nthe Society held their first Colloquium in Edinburgh:-\nAt the close of the Colloquium in the afternoon the President, Mr Burgess, paid a tribute to the enthusiasm and energy with which the secretary,\nMr Comrie\n, had thrown himself into the work of organising the meeting. The first Mathematical Colloquium in Britain had proved a complete success, a success that was chiefly due to the ability of the lecturers, each an authority on his own subject. No happier combination could have been made than that of the three lecturers, in whom it was remarked that the three nationalities were represented - English, Irish, and Scottish. Mr Burgess ventured the prediction that this, the first, Colloquium would not be the last, and suggested the possibility of a similar meeting at the time of the\nNapier\ncelebrations next year.\nBurgess also contributed papers to the Society. For example he read\nAnti-reciprocal Points\nat the meeting on Friday\n9\nJanuary\n1903\n, and\nThe orthoptic locus of the semi-cubical parabola\nat the meeting on Friday\n10\nMarch\n1905\n.\nAn obituary, written by\nPeter Comrie\n, was published in the\nProceedings\nof the\nEdinburgh Mathematical Society\n.\nA version is at\nTHIS LINK\n.\nIn addition Burgess was a member of the Educational Institute for Scotland and the Bute Natural History Society. He was awarded a D.Sc. by the University of Edinburgh in\n1924\nfor his thesis\nTripolar co-ordinates, straight line and circle. And Concurrency of lines joining vertices of a triangle to opposite vertices of triangles on its sides; determinants connected with the periodic solutions of Mathieu's equation\n.",
  "matematicos_citados_na_biografia": [
    "Royal Society of Edinburgh",
    "John Alison",
    "William Peddie",
    "George Chrystal",
    "John Sturgeon Mackay",
    "Edinburgh Mathematical Society",
    "Mr Comrie",
    "Napier",
    "Peter Comrie",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}