{
  "nome_completo": "Alfred Barnard Basset",
  "nome_curto": "Alfred Barnard Basset",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Basset/",
  "data_nascimento": "25 July 1854",
  "local_nascimento": "London, England",
  "data_morte": "5 December 1930",
  "local_morte": "Fledborough Hall, Holyport, Berkshire, England",
  "summary": "Alfred Barnard Basset was an English mathematician who worked on algebraic geometry, electrodynamics and hydrodynamics.",
  "biografia": "Alfred Barnard Basset\nwas the son of Alfred Basset\n(1828\n-\n1867)\nand Anne Dennison\n(1834\n-\n1873)\n. Alfred Basset Sr., the son of a warehouseman, was born in Croydon, Surrey, on\n19\nOctober\n1828\n. He became a wealthy man as a partner in the firm Basset and Harris who were corn factors undertaking international trade in grain. Anne Dennison, born in Tottenham, Middlesex, on\n26\nJanuary\n1834\n, was a servant in a house in Hackney, Middlesex, in\n1851\n. She married Alfred Basset in\n1853\nand they had three children, Alfred Barnard Basset, the subject of this biography, born\n25\nJuly\n1854\nand one younger daughter, Ann Gertrude Basset, born in\n1856\nbut died at the age of two years on\n12\nDecember\n1858\n.\nAlfred Basset Sr. died on\n28\nJuly\n1867\nand Anne Basset died in\n1873\nthe year that her son Alfred Barnard Basset had matriculated at Trinity College, University of Cambridge on\n18\nFebruary\n1873\n. He was admitted as a pensioner, that is an undergraduate who pays for his own keep. In\n1876\nhe became a scholar, that is he was awarded a scholarship to cover the cost of his university education. He had already decided on a law career and he was admitted at Lincoln's Inn on\n8\nJanuary\n1875\n. He graduated from the University of Cambridge in\n1877\n, being the\n13\nth\nWrangler\n, that is ranked\n13\nth in the list of First Class mathematics students. One wonders how much he is writing from his own examination experiences when he writes\n[\n4\n]\n:-\nOne of the difficulties, which the Examiners for the Mathematical Tripos have to contend against, is the tendency on the part of the Candidates to devote their time to learning certain pieces of book-work, which are likely to be set, instead of endeavouring to acquire an accurate and thorough knowledge of the fundamental facts and principles of the subjects, which they take up; and well-selected examples and problems illustrating the book-work are of great assistance to an examiner, in enabling him to discriminate between candidates, who have acquired a perfunctory knowledge of a subject, and those who have endeavoured to master it. But it would be a fallacy to imagine, that the utility of examples and problems is exclusively confined to the particular examination in which they are set; or that the practical value of a problem is to be estimated solely by the scientific value of the result, which it embodies. The existence of a large collection of examples and problems, is of great assistance to future generations of students, in enabling them to grasp the fundamental principles of a subject, and to acquire facility in the application of mathematical analysis to physics; and the severe course of training, which the University of Cambridge extracts from students of the higher branches of Mathematics, is of inestimable benefit to Science, in producing a body of men, who are thoroughly conversant with dynamical principles, and are able to employ with ease the more recondite processes of mathematical analysis.\nBasset was called to the bar at Lincoln's Inn in\n1879\nand he became a Equity Draftsman and Conveyancer. He did not continue in this profession, however, for he had inherited a considerable estate from his parents and had no need to earn a living. He therefore decided to devote his life to mathematical research. On\n11\nApril\n1882\nBasset married Edith Sarah Irwin Dechaundre who had been born in Fitzwilliam Square, Dublin, in\n1865\n. Alfred and Edith Basset had two daughters, Almina Caroline Georgina Basset, born\n9\nNovember\n1901\n, and Effie Alfreda Ilma Basset, born on\n26\nJune\n1903\n. The family lived at Fledborough Hall, Holyport, Berkshire. We quote from\n[\n8\n]\n, written at the time Basset and his family were living in the Hall:-\nHolyport is a hamlet in the parish of Bray,\n1\nmile south-south-west from Bray and\n2\nmiles south from Maidenhead; it contains a Wesleyan chapel. ... Fledborough Hall, the seat of Alfred Barnard Basset, esq. F.R.S. is built on the site of an old house, called Bourne Bridge Lodge, which formerly belonged to Sir Robert Sidney kt.; the present house is named after the manor of Fledborough in Nottinghamshire.\nWe get a brief indication of the life that Basset and his family experienced from the census of\n1901\nand the census of\n1911\n. At the time of the\n1901\ncensus Basset and his wife had no children and they were living in Fledborough Hall with seven servants. Two of the servants are men, a domestic butler and a footman, and five are women, three housemaids, a cook and a kitchen maid. By the time of the\n1911\ncensus both their daughters have been born. They still have seven servants, two men and five women, but now the women are head housemaid, second housemaid, ladies maid, kitchen maid, and cook. The two men are still a butler and a footman.\nSoon after his marriage, Basset devoted himself to undertaking research in mathematics\n[\n9\n]\n:-\nFrom\n1883\nonwards Basset produced a succession of papers on applied mathematics, mainly on subjects suggested by current discussions. The 'classical' hydrodynamics had at that time a great fascination for a number of rising mathematicians, and Basset's own contributions in this kind to the Proceedings of the Cambridge Philosophical Society, the\nLondon Mathematical Society\n, and the Philosophical Transactions of the\nRoyal Society of London\nwere of distinct merit. Among the numerous subjects which he treated we may mention the equilibrium of revolving fluids, and the theorems of\nDirichlet\nand\nDedekind\n, the interest in which had been revived by Bryan,\nGreenhill\n, and\nLove\n. At a later stage he attacked the theory of elastic plates and shells, which was then a matter of controversy, and was led to recognise independently the true explanation of a rather serious difficulty. Mention should also be made of his work on viscosity, and in particular on\nBoussinesq\n's problem of the variable slow motion of a sphere in a viscous liquid. These are only a few items out of the long list which appears in the\nRoyal Society\n's catalogue.\nWe have listed twelve of Basset's papers, together with their abstracts, ten of which are on the topics referred to in the above quote, at\nTHIS LINK\n.\nIn fact in\n1893\nBasset wrote\nPublication of scientific papers\nwhere he gave his ideas about publishing. He wrote\n[\n5\n]\n:-\nThe only feasible scheme seems to be the publication of a digest of papers by the co-operation of the various scientific societies; and, if thought desirable, papers published in foreign countries might also be included. In order to prepare the way for such a digest, I should strongly recommend that, in future, all societies should follow the example of the Incorporated Society for Law Reporting, and require authors to append a head-note to their papers, briefly setting forth the object of the investigation. Every three of four years the titles and head-notes of all papers relating to each separate branch of science should be copied out and arranged in proper order, and a series of digests of each separate branch of science should be published. Mathematicians would thus be enabled to purchase the mathematical digests a, and the chemists the chemical one. They would thereby be in a position to find out at a glance what papers have been published on their own special subjects during that period.\nIn\n1888\nBasset gave an historical introduction to hydrodynamics in his book\nA treatise on hydrodynamics, with numerous examples\n(1888)\n. We give a version of this \"History of Hydrodynamics\" at\nTHIS LINK\n.\nThis\n2\n-volume\n1888\ntext by Basset was the first of five books which he wrote. It is very much to Basset's credit that this work was of such quality that the\n2\n-volume monograph was reprinted in\n1961\n,\n73\nyears after it was first published, by Dover Publications, New York.\nLouis Melville Milne-Thomson\nhad by this time retired from his chair of mathematics at the Royal Naval College in Greenwich and was leading a very active research group at the University of Arizona. He wrote the following review of the reprinted text by Basset\n[\n11\n]\n:-\nThis work is a classic and a model of compact analysis and clear writing. The book was still in use as a text at Cambridge in the first decade of the present century. Although it refers to the state of the science as it existed in the interval\n1884\n-\n1888\n, the book is still useful as a work of reference to many matters which by then had assumed a definitive form.\nYou can read Basset's Preface to\nA treatise on hydrodynamics, with numerous examples\nat\nTHIS LINK\n.\nBasset wrote a second work on hydrodynamics,\nAn elementary treatise on hydrodynamics and sound\n(1890)\n, which was not intended, as the\n1888\nmonograph had been, as a record of the current state of progress in the topic but this second work was intended for students of the mathematical tripos at Cambridge. Two years later Basset published\nA treatise on physical optics\n(1892)\n[\n9\n]\n:-\n... a treatise on physical optics, another of his favourite subjects, to which he devoted immense pains, but which scarcely met with the recognition which it undoubtedly deserved.\nYou can read Basset's Preface to all five of his books at\nTHIS LINK\n.\nLater in his life Basset became interested in pure mathematical topics and published papers on geometry as well as two textbooks. He published\nAn elementary treatise on cubic and quartic curves\n(1901)\nin which he wrote\n[\n6\n]\n:-\nThe present work originated in certain notes, made about twenty-five years ago, upon the properties of some of the best-known higher plane curves ...\nThis comment means that his interest in these topics on geometry went back to his undergraduate days at Cambridge. The review of this book by P Worsley Wood is quite hard-hitting\n[\n12\n]\n:-\nThe earlier chapters of the book mainly reproduce some of the results contained in the first half of\nSalmon\n's 'Higher Plane Curves'; the methods of obtaining these results are novel. The treatment of\nPlücker\n's equations is specially striking, and equally unsatisfactory; the author would, in fact, have done better to have omitted his first four chapters and given a reference to\nSalmon\n's work in the preface. ... The whole question of plane cubics and quartics is nowhere seriously undertaken; elliptic functions are not used, and some of the analysis is of a very clumsy character. The subject matter is so diffuse that a good index is indispensable to anybody using the book as a text-book: but the book cannot be recommended as a text-book, so perhaps the absence of an index is immaterial. The appearance of this treatise once again emphasises the necessity for a new edition of\nSalmon\n's 'Higher Plane Curves', brought up to date with the researches of the past twenty years. Now that the learned author is no more, perhaps some enterprising geometer will undertake the task: practically, the only modern work on the subject is\nFiedler\n's German translation of\nSalmon\n, and a comparison of the contents of the original work and its translation is sufficient to show how far the subject has grown in the last few years.\nBasset's fifth and final book was\nA treatise on the geometry of surfaces\n(1910)\n. Again this geometry text seems not to have matched the quality of his applied mathematics works.\nIn\n1889\nBasset was elected a fellow of the\nRoyal Society of London\n. He was an active member of the\nLondon Mathematical Society\nand served as vice-president in\n1892\n-\n93\n. Later in his life, however, his interest in current mathematical topics seemed to fade and he was less often seen at mathematical meetings. No doubt this was caused, at least in part, by his failing health but family tragedies must have contributed. In\n1917\nhis daughter Almina died at the age of\n16\n. His wife Edith died in\n1929\nand Basset lived out the final years of his life in his residence at Fledborough Hall. When he died in December\n1930\nhe left £\n65794\nto his surviving daughter Effie Alfreda Ilma Basset. This is a large amount of money, being worth over £\n4\nmillion today. Effie Basset married Clarence Aylmer Underwood John French on\n20\nJuly\n1936\nin Monaco. She died in May\n1985\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "London Mathematical Society",
    "Royal Society of London",
    "Dirichlet",
    "Dedekind",
    "Greenhill",
    "Love",
    "Boussinesq",
    "Royal Society",
    "THIS LINK",
    "Louis Melville Milne-Thomson",
    "Salmon",
    "Plücker",
    "Fiedler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}