{
  "nome_completo": "Alice Everett",
  "nome_curto": "Alice Everett",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Everett/",
  "data_nascimento": "15 May 1865",
  "local_nascimento": "Glasgow, Scotland",
  "data_morte": "21 July 1949",
  "local_morte": "Hampton Hill, Middlesex, England",
  "summary": "Alice Everett was a mathematician and astronomer who studied the mathematical tripos at Girton College, worked at the Royal Observatory Greenwich and then at the Potsdam Astrophysical Observatory. She had a second career working on optics at the National Physical Laboratory. Her final career was working on the early developments of television broadcasting.",
  "biografia": "Alice Everett\nwas the daughter of Joseph David Everett\n(1831\n-\n1904)\nand his wife Jessie Fraser\n(1841\n-\n1924)\n. Joseph Everett, born near Ipswich, Suffolk, had become a mathematics teacher at Mr Thorowgood's school at Totteridge, near Barnet before winning a scholarship to study mathematics and physics at Glasgow University. He graduated with First Class Honours in\n1857\nand became professor of mathematics in King's College, Windsor, Nova Scotia, Canada in\n1859\n. He married Jessie Fraser on\n3\nSeptember\n1862\nat Blythswood Hill, Glasgow and continued his professorship in Canada until\n1864\nwhen he returned to Glasgow as assistant to the Professor of Mathematics,\nHugh Blackburn\n. He then worked for\nWilliam Thomson\n. His wife, Jessie Fraser, was born in Edinburgh, Scotland, the daughter of the Revd Alexander Fraser, who became Congregational minister of Ewing Place Chapel, Glasgow. In fact Joseph and Jessie Everett were married by the Revd Alexander Fraser. They had six children, including: Alice Everett\n(1865\n-\n1949)\n, the subject of the biography; Wilfred Hermann Everett\n(1869\n-\n1945)\n; Edith Maud Everett\n(1871\n-\n1960)\n; Genevieve Lilian Everett\n(1877\n-\n1942)\n; and Alexander Fraser Everett\n(1879\n-\n1917)\n.\nIn\n1867\nJoseph Everett was appointed as professor of natural philosophy at Queen's College, Belfast and the family moved to that city. Except for Alice, who was born in Glasgow, all Joseph and Jessie's other children were born in Belfast. Alice attended Miss Hardy's preparatory school in Belfast, then went to The Ladies' Collegiate School in Belfast. This independent girls' school had been founded in\n1859\nand has been known as Victoria College since\n1888\n. She then attended the Methodist College in Belfast which had opened in\n1868\nwith the aim of educating \"young ladies\" on equal terms with the boys\n[\n4\n]\n:-\nAlice was educated at the Methodist College in Belfast, a coeducational day school with a strong ethos of \"plain living and high thinking\" which after initial struggles had achieved a high level of academic distinction. She was a prize pupil whose later attainments are recorded with pride in the annals of the College.\nEverett was faced with some difficult decisions. How could a girl from Belfast get a university degree at this time? The Royal University of Ireland had received its Royal Charter in\n1880\nand could award degrees to both men and women who successfully passed their examinations, but no teaching was offered. In\n1882\nthe Queen's University in Belfast admitted women to lectures so that they could study for the examinations set by the Royal University of Ireland. In England, beginning in\n1882\n, the University of Cambridge allowed women to study and be examined for a degree, but women could not be awarded a degree. But what did Everett want to study? She said\n[\n1\n]\n:-\n... for a year after leaving school I gave my attention to art studies, and have never regretted it. At one time I hesitated between Girton and the studios. My mother has much artistic power, and I had some taste in the same direction.\nEverett then chose to study at the Queen's University of Belfast with the intention of taking the degree examinations of the Royal University of Ireland. She sat the first year scholarship examination in science in\n1884\nand was ranked first. The College lawyers were consulted to see if the regulations allowed women to receive scholarships. The decision was that only men were eligible so, despite coming top, Everett was denied a scholarship. She won a scholarship to Girton College, Cambridge, however, and she matriculated there in\n1886\n.\nAt Girton College, Everett studied the mathematical tripos.\nAnnie Russell\n(\nlater\nAnnie Maunder\n)\nalso entered Girton College in\n1886\nto study the mathematical tripos. They were two out of the\n29\nwomen who matriculated at Girton College in that year. One of Everett's lecturers at Cambridge was\nWilliam Henry Young\nwho had been appointed as a fellow in\n1886\n. Everett sat the Royal University of Ireland's examinations in\n1887\nand was awarded a B.A. with honours in mathematics and mathematical physics. In\n1889\nshe was awarded a Master's Degree by the Royal University of Ireland. Also in\n1889\n, Everett sat the Cambridge mathematical tripos examinations and was ranked as a 'senior optime', equivalent to a Second Class degree, but, as a woman, could not be awarded the degree. A 'senior optime' degree was a disappointment to Everett who had hoped to be ranked among the Wranglers. She said\n[\n1\n]\n:-\nI tried High School teaching for a term as a stop gap, though not desiring to be drawn into the universal drift towards teaching.\nIn fact she taught mathematics at a Girls' High School on the island of Jersey but was delighted when offered a position at the Royal Observatory Greenwich\n[\n1\n]\n:-\nThe question of employing women at the Royal Observatory arose when the new photographic section was started, and Mrs Huggins, who, like her distinguished husband, has earned a world-wide reputation as an astronomer, interested herself, I believe, in the matter. The first I heard of it was when the Observatory authorities wrote to ask if I would come.\nIn fact employing women was an experiment by the Astronomer Royal, William Christie\n(1845\n-\n1922)\n. Christie had been appointed to that position in\n1881\nfollowing the ill-health retirement of\nGeorge Airy\n. With increasing work loads, he had tried to secure additional funding for new appointments but had not been successful. He then came up with a scheme of employing well-qualified women who, because they were women, could be paid a minimal salary. Everett's application had been supported by\nRobert Stawell Ball\n, the Royal Astronomer of Ireland, and she took up her position on the staff at Greenwich on\n15\nApril\n1890\n, being one of four women employed for Christie's experiment. Rebekah Higgitt said in the interview\n[\n3\n]\n:-\n... the title of the job she had was a Supernumerary Computer, which really put her on the same level as kind of boys who joined the Observatory straight out of school, and did fairly basic, repetitious kind of work, dealing with number-crunching, calculating what they called 'reducing the observations' so they could be printed. So that was her title and she was paid on that kind of level and yet she had the qualifications of one of the top astronomers there - a First Assistant or a Chief Assistant at the Observatory.\nEverett herself said in the\n1893\ninterview\n[\n1\n]\nthat:-\n... the awkward technical title 'Assistant' is applied to those gentlemen who hold permanent posts at the Observatory under the Astronomer Royal. They are appointed partly by competitive Civil Service examinations, and are generally University men of good standing. Under them work boy computers. It is doubtful whether women are eligible for the examination, and candidates must be nominated by the Astronomer Royal, who refused to take the responsibility when we applied.\nThe British Astronomical Association was founded in October\n1890\nby Walter Maunder, with support of others, to provide a society more aimed at amateur astronomers than the\nRoyal Astronomical Society\n. It was set up with a Council consisting of\n48\nmembers, four of whom were women. Everett was a member of the Association from its founding. The\nRoyal Astronomical Society\n, however, was not prepared to have women members. In\n1892\nEverett was one of three women proposed as fellows of the Royal Astronomical Society, the other two being\nAnnie Russell\nand Elizabeth Brown\n(1830\n-\n1899)\n. Stuart Mathieson writes\n[\n13\n]\n:-\nIn\n1892\n,\n[\nEdward Walter Maunder\n]\nnominated ...\nAnnie Russell\nand Alice Everett as fellows of the\nRoyal Astronomical Society\n, with the \"him\" on their application forms crossed out and replaced with \"her\". One member quipped that the nominations would make\nRoyal Astronomical Society\nmeetings more social, \"and all we shall require is a piano and a fiddle\", while another challenged the legality of any election; ultimately neither were elected.\nAlthough Everett was assigned to the Astrographic Department when she was appointed, for her first task she was re-computing meridian transit observations until June\n1891\n. At that time the initial commissioning of the Astrographic Telescope was completed so she was able to work at the Astrographic Department on the\nCarte du Ciel\nproject. The\nCarte du Ciel\nproject had been initialised in\n1887\nby Paris Observatory director Amédée Mouchez, who realised the potential of the new dry plate photographic process to revolutionise the process of making maps of stars. A congress, held in the Paris Observatory on\n16\nApril\n1887\n, had resolved:\n(\ni\n)\nto create a chart of all stars down to the fourteenth magnitude, the plates to be in duplicate\n(\nii\n)\nto create a second series of photographs with shorter exposure, including stars to the eleventh magnitude, to be made concurrently to form a catalogue and to determine fundamental positions in the first series. Eighteen observatories, including the Royal Observatory Greenwich, collaborated on this colossal task, which would require of at least\n20600\nphotographic frames. The project gained much attention at first but this became less as the size of the task became clear and it was never completed, the final decision to abandon it coming in\n1970\n.\nThree of the \"lady computers\" who had begun work at the Royal Observatory Greenwich soon left and, at Everett's suggestion,\nAnnie Russell\njoined her taking up her appointment on\n1\nSeptember\n1891\n. It is hard to know now exactly what Everett did since the records at the Royal Observatory do not contain nearly as much information for women as the records do for the men working there at the time. One wonders whether the Royal Observatory in some ways did not want to admit that the women were doing excellent work.\nIn\n1892\nthe position of assistant at the Dunsink Observatory, the observatory for Trinity College Dublin, became vacant. The director,\nRobert Ball\n, had left Dunsink when appointed to the Lowndean Chair at Cambridge in February\n1892\nand his only assistant Arthur Rambaut\n(1859\n-\n1923)\n, had been promoted to Director of Dunsink Observatory. The Observatory had acquired a\n15\n-inch reflector and were about to begin a programme of stellar photography. Everett was well qualified in stellar photography and her application for the post of assistant was supported by the Astronomer Royal, William Christie, who\n[\n6\n]\n:-\n... wrote her a glowing testimonial, referring to her experience with the various instruments, her familiarity with computation and other qualifications. He described her as \"a skilful photographer who has made herself expert in the manipulation of the new photographic equatorial\" and who carried her duties \"with much intelligence and determination.\" Her experience would, he believed, qualify her for such a post as that of assistant at Dunsink Observatory.\nHer application was also supported by the leading astronomer William Huggins\n(1824\n-\n1910)\n,\nRobert Ball\n, Edward James Stone\n(1831\n-\n1897)\n, who worked at the Radcliffe Observatory in Oxford, and\nArthur Downing\n. In her application Everett\n[\n6\n]\n:-\n... declared that she was very strong and was used to working with men at Greenwich where she and\nMiss Russell\n\"seem to work along quite naturally in the midst of them ... I do not think that my sex should be any real obstacle, though to some at first, the presenting of an unusual idea may prejudice against it.\"\nShe was not offered the post and continued to work at Greenwich. In the interview\n[\n1\n]\nshe spoke about her love of observing:-\nObserving is the part of the work I like best. You feel that you really are an astronomer then, doing practical business. Besides, there is a certain charm about having the handling of a fine and powerful instrument. I scarcely know why it is, but I find the hours fly when I am observing, though the old hands say it grows very monotonous in the course of years. In winter, though the roof is partly open and the dome kept at the temperature of the outer air, we are too actively employed to feel the cold much, unless it be windy. In summer, though, perhaps, the irregular hours may prove trying in time, the quiet, fresh night is much pleasanter than the hot and dusty London day. Towards dawn it is quite interesting to observe what a difference the dim light makes in the aspect of the earth.\nShe was elected to the Council of the British Astronomical Association in\n1892\nand became a secretary of the Association in October\n1893\n, holding this post for two years\n[\n1\n]\n:-\nI am one of the secretaries of the British Astronomical Association; Mr Duke is the other. Nothing could be more generous and considerate than the spirit which that Association has shown towards women. Please be sure to say in your paper how grateful we are for the help and encouragement its officers and council have given us.\nHer published work over the years\n1891\n-\n95\nincluded the papers:\nThe Total Lunar Eclipse of November\n15\n,\n1891\n(1891)\n;\nOn the photographic Magnitude of Nova Aurigae\n(1892)\n;\nThe total solar eclipse\n(1893)\n;\nTotal Eclipse of the Sun, August\n9\n,\n1896\n(1894)\n; and\nNote on the binary\nLeonis\n(1895)\n.\nEverett resigned her post at the Royal Observatory Greenwich on\n5\nJuly\n1895\nand took up a\n3\n-year appointment at the Potsdam Astrophysical Observatory, starting on\n1\nOctober\n1895\n. There she replaced Friedrich Karl Arnold\n(1870\n-\n1964)\nwho had a short-term position at Potsdam from\n1893\nto\n1895\n. At Potsdam Everett continued to work on the\nCarte du Ciel\nproject publishing\nGalactic Longitude and Latitude of Poles of Binary-Star Orbits\n(1896)\n. She measured and reduced the positions of\n22\n,\n000\nstars on\n72\nplates in the year\n1897\n.\nHer appointment at the Potsdam Astrophysical Observatory ended in July\n1898\nand she then was an Assistant for one year at observatory at Vassar College in Poughkeepsie, USA\n[\n4\n]\n:-\nAlive Everett was employed as an assistant for one year,\n1898\n-\n99\n, at the observatory of Vassar College, USA, the women's college where\nMary Whitney\n, successor to\nMaria Mitchell\n, was professor of astronomy. This small institution had only one member of staff besides Miss\nWhitney\n, and Alice Everett no doubt was pleased to have the opportunity of working there, even temporarily. Her year was fruitful and resulted in two papers jointly written with\nMary Whitney\non observations of minor planets and a comet in the Astrophysical Journal.\nAfter the Vassar College post ended, she applied for a position at the Lick Observatory where the Director James Edward Keeler\n(1857\n-\n1900)\nwas keen to employ her. He tried to get funding for her salary from Phoebe Hearst, an American philanthropist, feminist and suffragist. Keeler asked Hearst if she would fund a position for women at Lick Observatory, saying he had a very suitable person to fill it. He wrote:-\nMiss Everett is a lady of distinction in astronomical science who is admirably qualified to aid us in a most important part of our work - the measurement of our photographs of star spectra in which we are falling sadly behind.\nUnlike the Royal Observatory, he proposed a salary matching her skills, but Phoebe Hearst replied saying unfortunately she could not help. Everett, now without a job, returned to England. At the time of the\n1901\nCensus she was living with her parents, now retired, at\n11\nLeopold Road, Ealing, London. Her siblings, Edith, Genevieve and Alexander are also living at this address and the family had a housemaid and a cook. Alexander is listed as a student, but no occupation is given for Alice, Edith, or Genevieve who are all unmarried.\nAlthough Everett gave no occupation at the time of the\n1901\ncensus, in fact she was working with her father translating a German scientific text by H Hoverstadt into English. The book\nJena glass and its scientific and industrial applications\nwas published in\n1902\n. She had a couple of astronomy papers published by the British Astronomical Association:\nPhotographs of Cross-sections of Hollow Pencils formed by Oblique Transmission through an Annulus of a Lens\n(1902)\n; and\nThe Jena Glass Works, with special reference to Astronomical Objectives\n(1903)\n. Her father died in\n1904\nand Everett's interests turned to optics.\nIn\n1912\nshe published\nClouds and shadows\nin the journal\nNature\n. The paper gives her address as Milbourne Lane, Esher, Surrey and begins:-\nMr Cyril Crossland's description of great shadow bands cast across the sky at sunset interested me, for I well remember being impressed by a similar phenomenon when crossing a New Mexican prairie, with the sun setting behind the Rockies. I have seen the bands in England, but imperfectly. To a non-expert, like myself, Mr Crossland's remark, \"The shadows being cast by the reflected light of the glowing clouds in the west, not by the sun itself, of course\", presents difficulties. A mass of glowing cloud seems too extensive a luminous source to cast definite shadows of peaks comparatively near it. Further, the sun being beyond the cloud, the bulk of the sunlight reflected by the cloud would fall the wrong way. Long after the sun's rays are cut off from the spectator, they will still be shining upon clouds high overhead, and therefore able to cast shadows.\nShe published another paper in\nNature\nin\n1913\n, namely\nThe Halo in the Ricefield and the Spectre of the Brocken\n. Again her address is Milbourne Lane, Esher. She ends this paper as follows:-\nPerhaps I may take this opportunity to record another little optical observation of different character. Once - I think it was towards the close of the hot summer of\n1908\n- watching, from the top of a cliff some\n800\nft high, the sun setting over the sea, I saw the upper half of the disc look like a double staircase; there were three or four distinct, almost rectangular, steps cut out of the limb symmetrically on either side. When most of the disc had sunk out of sight, the small portion remaining was suggestive of the lid of a teapot with a knob on top. Some lines of light cloud about the horizon showed the existence of horizontal stratification in the atmosphere, and the strange distortion of the solar limb was evidently due to refraction through horizontal strata with extraordinary sharpness of boundary and difference of density.\nWorld War I saw many men called for military service and women were sought to fill vacant positions. Everett was employed for a year in the optical laboratory of Hilger, a company founded by two German precision optical instrument technicians Adam and Otto Hilger in\n1874\n. The company was based in Islington, London, and specialised in the manufacture of precision optical and mechanical instruments. On\n9\nOctober\n1917\nEverett joined the National Physical Laboratory as a Junior Assistant in the Physics Division. She had a highly successful career working on theoretical problems concerning aberration in lens and mirrors. She retired at age\n60\non\n15\nMay\n1925\n.\nRemarkably, Everett started on yet another career. The Regent Street Polytechnic, which today is the University of Westminster, offered evening classes and Everett took classes in practical wireless there in the winters of\n1926\n-\n27\nand\n1927\n-\n28\n. After passing the wireless examinations in the Spring of\n1928\nshe spent session\n1928\n-\n29\nundertaking research in the Engineering Department of the City and Guilds College which had been incorporated into Imperial College London in\n1910\n. Even before this year, Everett had become a founder fellow of the Television Society which had been formed on\n7\nSeptember\n1927\n. Let us note that this Society, which became the Royal Television Society in\n1966\n, was founded nine years before television broadcasts began in\n1936\n.\nEverett now began to undertake research on the apparatus, called a mirror drum, used to produce the scanning light beam for televisions. One such device was being developed by the Baird Television Company with Everett making substantial improvements to the mirror drum and on\n30\nJanuary\n1933\nEverett and the Baird Television Company jointly applied for a patent. The application was abandoned, however, when the BBC decided to employ a different company. Everett continued to support the Television Society and in\n1938\nshe was awarded a pension in recognition to her services to physical sciences.\nIn\n1939\nEverett was living at\n7\nRiverside, Lower Hampton Road, Sunbury-on-Thames, Middlesex. She gives her occupation as Science\n(\nRadio and Optical Engineering\n)\nand is sharing the house with Edith Gertrude Wilson, a\n47\n-year old Scientific Assistant and Abstractor. She continued to live at this address until her final illness when she went to Gloucester House nursing home, Hampton Hill, Middlesex where she died aged\n84\n.\nFinally let us quote Everett's own words, made in\n1893\n, about her interests outside science\n[\n1\n]\n:-\nTennis and golf are among my favourite pursuits, and I probably owe my wiry health to a liking for exercise and fresh air. At home, when we generally spent the summer at some wild spot on the beautiful though stormy coast of Antrim, I used to enjoy the rough-and-tumble boating in fishermen's sturdy tubs, in which we all revelled.",
  "matematicos_citados_na_biografia": [
    "Hugh Blackburn",
    "William Thomson",
    "Annie Russell",
    "Annie Maunder",
    "William Henry Young",
    "George Airy",
    "Robert Stawell Ball",
    "Royal Astronomical Society",
    "Robert Ball",
    "Arthur Downing",
    "Miss Russell",
    "Mary Whitney",
    "Maria Mitchell",
    "Whitney"
  ],
  "imagens": [
    "everett.jpg"
  ]
}