{
  "nome_completo": "Anders Wiman",
  "nome_curto": "Anders Wiman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiman/",
  "data_nascimento": "11 February 1865",
  "local_nascimento": "Hammarlöv, Skane County, Malmöhus, Sweden",
  "data_morte": "13 August 1959",
  "local_morte": "Lund, Sweden",
  "summary": "Anders Wiman was a Swedish mathematician who worked on algebraic geometry and applications of group theory.",
  "biografia": "Anders Wiman\n's parents were land owning farmers and were financially well off. They owned one of the large farms close to the village of Hammarlöv in the south of Sweden. Note that most biographies of Wiman give\n(\nincorrectly\n)\nhis place of birth as Hammerlöf. Anders attended school in Lund, graduating from the secondary school in that city in\n1885\n.\nÅke Pleijel\nwrites\n[\n3\n]\n:-\nWiman was the only member of his rural family who went to study. One reason was that he was not considered suited for work in the fields.\nHe entered the University of Lund in the autumn of\n1885\nand, as well as mathematics, he studied botany and Latin for his first degree. He was awarded his Bachelor's degree in\n1887\nand his Licentiate in\n1891\n. Continuing to study for his doctorate at Lund he was advised by Carl Fabian Emanuel Björling\n(1839\n-\n1910)\nwho had also taught him through his earlier university years.\nBjörling, the son of the mathematician Emanuel Gabriel Björling\n(1808\n-\n1872)\n, had studied at Uppsala and was appointed as professor of mathematics at Lund in\n1873\n. He then devised the four-year mathematics course that Wiman followed, which put emphasise on function theory and particularly on a full range of geometric topics. He strongly influenced Wiman and so it is useful to quote from Björling's obituary about his qualities as a teacher:-\nBjörling's lectures were brilliant from a formal point of view. He had an unusual ability to express his thoughts easily, correctly and in a stimulating way. In contrast he was not to the same degree rigorous - neither orally nor in writing. Although equipped with a sharp intelligence and wit, it can be said that he was more gifted for reviewing and rounding off than for abstraction and strict reasoning. This feature is apparent in his remarkable textbooks.\nBjörling was interested in\nalgebraic geometry\nso it was a natural topic for him to give to his research students. One of Björling's students, Jakob Bergstedt, wrote a doctoral thesis which he completed in\n1886\nwhile Wiman was still an undergraduate. Björling had suggested that Bergstedt attempt to classify ruled surfaces of degree six. He achieved some significant results, well worthy of a doctorate, but failed to classify such surfaces. It was, therefore, a natural topic for Björling to suggest that Wiman study to see if he could succeed where Bergstedt had fallen short. Indeed, Wiman did succeed and submitted his thesis\nKlassifikation af regelytorna af sjette graden\nⓉ\n(\nClassification of ruled surfaces of the sixth degree\n)\nin\n1892\n.\nLars Gårding\nwrites in\n[\n2\n]\n:-\nWiman used methods where the ruled surface is mapped onto a space curve in different ways. ... There are many details and technicalities in the\n109\npages of this thesis ... Wiman's thesis is written in Swedish and hardly ever quoted, but it is a fine achievement and shows the sharp intellect and strong character of the author.\nWiman was appointed as a\ndocent\nin mathematics at the University of Lund in\n1892\n. This is, in the Swedish system, essentially the equivalent of an assistant lecturer. He was formally awarded his doctorate in\n1893\nand undertook impressive work on the classification of finite geometrical groups over the last years of the\n19\nth\ncentury. He published four papers\n(\nall in German\n)\nin\n1895\n. Two of these,\nÜber die hyperelliptischen Curven und diejenigen vom Geschlechte p\n=\n3\n, welche eindeutige Transformationen in sich zulassen\nⓉ\n(\nOn hyperelliptic curves and those of the family of p =\n3\n, which allow unique transformations into themselves\n)\nand\nÜber die algebraischen Curven von den Geschlechtern p\n=\n4\n,\n5\nund\n6\n, welche eindeutige Transformationen in sich besitzen\nⓉ\n(\nOn the algebraic curves of the families p =\n4\n,\n5\nand\n6\nwhich possess unique transformations into themselves\n)\nmark the start of Wiman's work on group theory. In these he classified all algebraic curves of genus\n3\n,\n4\n,\n5\nand\n6\nwhich have non-trivial algebraic automorphisms. In\nÜber eine einfache Gruppe von\n360\nebenen Collineationen\nⓉ\n(\nOn a simple group of\n360\nflat collineations\n)\n(1896)\nhe proved that a certain group of order\n360\n, which he showed isomorphic to the alternating group of degree\n6\n, had been omitted by\nCamille Jordan\nin his classification of the groups of projective bijections of the complex projective plane.\nA paper on probability theory\nÜber eine Wahrscheinlichkeitsaufgabe bei Kettenbruchentwickelungen\nⓉ\n(\nOn a probability problem in continued fractions\n)\n, which Wiman probably did not consider particularly important, appeared in\n1900\n. The background to this paper was a remark in a paper by Hugo Gyldén, a Swedish astronomer, where he introduced approximations to small denominators using a probabilistic argument. Torsten Brodén, at that time a\ndocent\nat Lund, had tried to revise Gyldén's work in a more rigorous fashion but Wiman was unhappy with Brodén's approach. In his own paper, which was a second attempt to put Gyldén's work on a rigorous basis, Wiman applied measure theory to the probabilistic problem. He was the first to do so and his work influenced\nÉmile Borel\nto work on such questions. For more details, see\n[\n6\n]\nand\n[\n7\n]\nwhere theories are put forward as to how\nBorel\nlearnt of Wiman's paper.\nIn\n1900\n, Alexander Fredrik Berger\n(1844\n-\n1901)\nwas working as a docent and acting professor at Uppsala. An extraordinary professorship in algebra and number theory was created by Uppsala, essentially designed to give Berger a chair. He had written a paper on the distribution of primes in\n1875\n, but his paper follows closely an\n1852\npaper by\nChebyshev\n, and fails to even reference\nChebyshev\n's paper. As\nGårding\nwrites\n[\n2\n]\n, \"it gives the reader a bad feeling\". Berger had continued to write articles on number theory which surveyed the results by other mathematicians, yet Berger's papers contain no references. The extraordinary professorship at Uppsala was advertised and there were three applicants, Berger,\nvon Koch\nand Wiman. The appointing committee consisted of Edvard Rudolf Neovius\n(1851\n-\n1917)\n,\nLudwig Sylow\nand\nGösta Mittag-Leffler\n. They reviewed the work of the applicants and placed Wiman as their first choice, with\nvon Koch\nin second place. This was not a judgment on the absolute merits of Wiman and\nvon Koch\nas mathematicians, but rather an argument that both were fine mathematicians with\nvon Koch\n's expertise being more in analysis than in algebra and number theory. This, of course, was not the result that Uppsala University had wanted since the extraordinary professorship had been created specifically to give Berger a chair. The faculty asked the professor of mathematics, Matths Falk\n(1841\n-\n1920)\n, to judge the three applicants and he, unsurprisingly, put Berger at the top of the list. It looked as though a rather serious argument was about to take place but, at this point, Berger suddenly died at the age of\n57\n. The extraordinary professorship in algebra and number theory was offered to Wiman who happily accepted taking up the appointment on\n5\nDecember\n1901\n.\nOne of the topics that Wiman studied was the solubility of algebraic equations. For example, in\nÜber die metacyklischen Gleichungen von Primzahlgrad\nⓉ\n(\nOon the metacyclic equations of prime degree\n)\npublished in the volume of\nActa Mathematica\ndedicated to the memory of\nNiels Abel\n, he studied the\nGalois\ngroup of soluble equations of prime degree. He also worked on\nentire functions\npublishing, for example,\nÜber die durch Radikale auflösbaren Gleichungen neunten Grades\nⓉ\n(\nOn the equations of ninth degree resolvable by radicals\n)\n(1904)\n. Björling, the professor at Lund who had taught Wiman during his years there, retired in\n1906\nand Wiman was keen to return to his alma mater. The position would also be a more senior one for this was an ordinary professorship at Lund while he only held an extraordinary professorship at Uppsala. Wiman\n[\n2\n]\n:-\n... entrusted a friend with the task of delivering the necessary papers to the university authorities. But the friend was one day late and that is why Wiman, who had been the natural first choice, could not return to his alma mater.\nTorsten Brodén, who we mentioned above in connection with Wiman's use of\nmeasure theory\nin questions of\nprobability\n, was appointed to the chair at Lund. However, Wiman did not have to wait long for an ordinary professorship since Uppsala promoted him to that position in\n1906\n, shortly after his disappointment with failing to be considered for the chair at Lund. He held the chair at Uppsala until he was made professor emeritus in\n1929\n. He continued to teach for a while after becoming professor emeritus.\nWe have mentioned some of the topics that Wiman worked on, but it is worth noting the lasting influence that his contributions have made. One mark of this is the fact that MathSciNet lists around\n100\npapers with a concept named after Wiman in the title. For example, Wiman-\nValiron\ntheory, Wiman-\nValiron\ndiscs, Wiman theorems for quasiregular mappings, Wiman surfaces, the Wiman inequality, Wiman's sextic, the Wiman-\nValiron\nmethod for difference equations, the conjecture of Wiman, and the Wiman bound.\nLet us look now at Wiman's character and his influence on those around him.\nGårding\nwrites in\n[\n2\n]\n:-\nHe never married and led a quiet life of study and research in the circle of his students who gave him many signs of appreciation and friendship.\nÅke Pleijel\n, who became a professor at the Royal Technical Institute in Stockholm in\n1947\n, later moving to Lund and finally to a chair at Uppsala, writes\n[\n3\n]\n:-\nWiman was by nature unassuming but with a firm self-confidence. His vivid interest in people was a decisive factor in his behaviour towards the many students whom he took care of during his time as a professor. He was not a fluent talker, his speech was slow and came in spurts accompanied by vivid movements of his hands and fingers. His judgement of people and events was sharp and to the point. Wiman was the only member of his rural family who went to study. One reason was that he was not considered suited for work in the fields. Wiman often talked about this with a shade of disappointment. Otherwise Wiman looked on the world with a positive eye - he was a composed and harmonic human being of a kind rarely met.\nTrygve Nagell\n(1895\n-\n1988)\n, who succeeded to Wiman's chair at Uppsala when he retired, writes\n[\n8\n]\n:-\nDuring his thirty years as a professor Wiman had a major influence on the development of university education in mathematics. By modernizing this teaching, he inaugurated a new era. His lessons were characterized by accuracy, by clarity and by their pedagogical presentation. Thirty of his students have defended their doctoral theses.\nWiman, throughout his life, maintained a keen interest in the teaching of mathematics in secondary schools. For\n25\nyears he was a censor for the final examinations in Swedish schools.\nClassical languages were Wiman's greatest interest outside the mathematical sciences. His knowledge in this area was vast and sound.\nPersonally, he was a quiet man, precise and devoid of vanity. All those who knew him will keep the memory of a very friendly and very generous man, gifted with a splendid sense of humour. One listened with pleasure to his wise and well-founded opinions on art, on science, on politics and on men.\nWe should add a few comments to clarify these comments by Trygve Nagell. First let us say a little about Wiman's doctoral students. His first doctoral students worked on problems with entire functions, but later students wrote theses looking at problems in group theory, irreducibility criteria for polynomials with integer coefficients, and algebraic geometry. Among these students we mention\nFritz Carlson\n. Wiman also taught\nArne Beurling\nand influenced him greatly, but had retired before\nBeurling\nsubmitted his thesis. Next let us explain Wiman's role as a censor for the final examinations in Swedish schools. This now historic activity started in\n1862\nwhen the universities ceased to have entrance examinations and ended in\n1968\n. The replacement was a flying inspection in which teams of university professors went to the secondary schools as auditors of the oral examinations and censors when the grades were decided.\nWiman received many honours. In\n1900\nhe became a member of the Royal Physiographic Society in Lund\n(\nfounded\n1772)\n. Three years later he became a member the Royal Society of Sciences in Uppsala\n(\nthe oldest of the royal academies in Sweden founded in\n1710)\n. He was elected to the\nRoyal Swedish Academy of Sciences\n(\nfounded in Stockholm in\n1739)\nin\n1905\n. In\n1920\nhe became a member of the Royal Society of Arts and Sciences in Gothenburg\n(\nfounded\n1778)\n. After he retired, he was made an honorary member of the Royal Society Sciences in Uppsala in\n1938\n.\nAlthough Wiman spent a few years in Uppsala after he retired, he eventually returned to Lund and spent his final years there.",
  "matematicos_citados_na_biografia": [
    "Åke Pleijel",
    "algebraic geometry",
    "Lars Gårding",
    "docent",
    "Camille Jordan",
    "Émile Borel",
    "Borel",
    "Chebyshev",
    "Gårding",
    "von Koch",
    "Ludwig Sylow",
    "Gösta Mittag-Leffler",
    "Niels Abel",
    "Galois",
    "entire functions",
    "measure theory",
    "probability",
    "Valiron",
    "Fritz Carlson",
    "Arne Beurling",
    "Beurling",
    "Royal Swedish Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}