{
  "nome_completo": "Annie Hutton Numbers",
  "nome_curto": "Annie Hutton Numbers",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Numbers/",
  "data_nascimento": "6 March 1897",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "10 April 1988",
  "local_morte": "High Wycombe, England",
  "summary": "Annie Hutton Numbers graduated from Edinburgh University and worked in the Chemistry department in Edinburgh. She taught in schools in Ipswich and High Wycombe.",
  "biografia": "Annie Hutton Numbers\nwas also known as Ann Hutton Numbers. Her father was Alexander Anderson Numbers\n(1864\n-\n1939)\n, born in Dysart, Fife on\n26\nJune\n1864\n, who was a joiner and cabinetmaker. Her mother was Margaret Cousin\n(1870\n-\n1933)\n, known as Maggie, born in Dunfermline, Fife and died\n31\nJuly\n1933\nin Edinburgh. Alexander and Maggie Numbers were married in Dunfermline in\n1893\n. Annie Numbers had a younger sister Isabella Anderson Numbers\n(\nborn\n10\nJuly\n1898\n, died\n14\nFebruary\n1933\nin Edinburgh\n)\n. At the time of the\n1901\ncensus, the family was living at\n24\nDuncan Street, Mayfield, Edinburgh. In addition to her parents and sister, the\n56\n-year old Helen Numbers, who was a cousin of Alexander, is living with them. By the time of the\n1911\ncensus two further siblings of Annie have been born, a brother Alexander Numbers, born\n20\nJune\n1906\nand a sister Elizabeth \"Lizzie\" C Numbers born\n11\nJanuary\n1902\n.\nAnnie Numbers began her education at Mrs Steele's Private School in Upper Gray Street in Edinburgh. She then entered James Gillespie's School in\n1904\n, spending three years at this primary school. In\n1907\nshe began her secondary education at Edinburgh Ladies' College\n(\nMary Erskine's\n)\n. In the years\n1911\n,\n1912\n,\n1913\nand\n1914\nshe sat Scottish Leaving Certificate examinations. Let us note the schools that her siblings attended\n(\nsee\n[\n1\n]\n)\n: Isabella Numbers attended the Edinburgh Institution, Elizabeth Numbers attended James Gillespie's Higher Grade Public School and then Edinburgh Ladies College, and Alexander Numbers attended George Watson's Boys' College.\nAfter graduating from Edinburgh Ladies' College, Annie Numbers then went to Edinburgh University, beginning her studies in\n1914\nand graduating with the degrees of MA\n(\nHons\n)\n, Mathematics and Natural Philosophy, in\n1918\n. She had been taught by\nCargill Knott\nand\nEdmund Whittaker\n. After completing her undergraduate studies, Annie enrolled on a course of professional training, to become a Specially Qualified Teacher of Science in Intermediate and Secondary Schools.\nAfter a brief spell teaching, she returned to her studies at the University of Edinburgh for a B.Sc. in Mathematics, and for a B.Sc. in Chemistry, graduating with these degrees in\n1920\n. She was taught chemistry by James Walker\n(1863\n-\n1935)\n, the Professor of Chemistry. While on the final stages of the B.Sc. courses, she was appointed as Assistant Lecturer and Demonstrator at the Department of Chemistry at Edinburgh University. Continuing on the staff of the University, Numbers undertook research towards the degree of Ph.D. At this time she was living with her parents at\n6\nVentnor Terrace, Edinburgh. At the time when the Electoral Register was taken in\n1924\n, her sisters Isabella and Elizabeth were also living in the same house. In fact it was later in that year, in December\n1924\n, that the new chemistry buildings and laboratories, which had begun construction at King's Buildings in\n1919\n, were officially opened\n[\n8\n]\n:-\nThe new Department was a tribute to Walker's vision. The laboratories could accommodate\n400\nundergraduates and one of the main features, for which he was criticised at the time, was the extensive provision made for research workers; there were over\n30\nresearch rooms, the smaller rooms accommodating two workers and the larger three or four. Hitherto there had been little incentive for students to stay on after graduation but now that space was available and the research Degree of Ph.D. had been instituted, the number of postgraduates progressively increased.\nIn\n1926\nAnnie Numbers was awarded a Ph.D. for her thesis\nThe influence of substituents on the optical rotatory power of compound\ns.\nThe Isomeric Methoxy and Nitro-benzoic Esters of Active Secondary β-Octyl Alcohol.\nHer thesis advisor had been Harold Gordon Rule\n(1887\n-\n1943)\nwho had studied at Munich for his doctorate\n(1913)\n, then lectured in organic chemistry at the University of Edinburgh from\n1915\nuntil\n1943\n.\nNumbers' Ph.D. thesis contains this acknowledgement:-\nThe writer wishes to acknowledge her indebtedness to Dr H G Rule for his helpful suggestions and advice during the course of this work.\nThe Introduction to the thesis begins as follows.\nThe relative changes in the rotatory power of a compound produced by the introduction of a number of different substituents have been comparatively little investigated until recent years. Much of the work carried out in this direction has been limited to the study of homologous series, as in the case of the menthyl esters of aliphatic acids examined by Tschugaeff, the corresponding amyl esters by Guye and Ghavanne\n(\nComptes rendus\n1895\n,\n120\n,\n152)\nand menthyl esters of carvoxime by Rupe and Wolfaleben\n(\nAnnalen,\n1912\n,\n395\n,\n136)\n.\nA great deal of systematic work of this nature has been accomplished by Pickard and Kenyon in connection with optically active secondary carbinols and their esters and ethers.\nTwo generalisations have emerged from these researches and others of similar type. In the first instance, it is now accepted that the introduction of a methyl group in place of hydrogen often produces a marked change in the rotatory power of the parent compound, but that the subsequent lengthening of the chain by the introduction of succeeding methylene groups produces less and less change in the rotation, until in many cases a constant value is finally attained.\nIn the second place, it is frequently observed that the curve representing the change undergone by the molecular rotation in a homologous series as the number of carbon atoms increases is broken by an inflexion corresponding to a maximum or minimum at or about the fifth, tenth and fifteenth carbon atoms in the chain, counting from the asymmetric atom. These effects have been explained by Frankland on the basis of Baeyer's strain theory as being due to the influence of the end of the chain as it returns upon itself in space.\nShe published two papers:\n(\nwith Harold Gordon Rule\n)\nOptical activity and the polarity of substituent groups. Part IV. sec.-β-Octyl esters of o-, m-, and p-methoxy- and nitro-benzoic acids\n(1926)\n; and\n(\nwith Harold Gordon Rule, William Hay and T Ramsay Paterson\n)\nOptical activity and the polarity of substituent groups. Part VII. sec.\n2\nβ-Octyl esters of o-, m-, and p-methoxy- and nitro-benzoic acids\n(1928)\n. This second paper begins as follows:-\nIn recent years a considerable amount of attention has been directed towards the influence of substituents on the physical and chemical behaviour of a parent compound. These researches have had to do with such diverse properties as benzene substitution, velocity of reaction, optical activity, dielectric constants, and physical state. As a result, it has been made abundantly clear that in nearly all these cases the main influence at work falls into one of two categories. The first and most commonly observed influence is that usually described as the 'general effect' of the substituent, which is regarded as being due to a general shift of the valency electrons away from an electropositive group ... and towards an electro-negative one ...\nJohn Edwin MacKenzie\n(1868\n-\n1955)\n, Reader in chemistry at the University of Edinburgh, explained Annie Numbers' contributions to the Department of Chemistry at Edinburgh\n[\n2\n]\n:-\nHer work was characterised by method and efficiency. Her accurate knowledge and skilful manipulation combined with a flair for teaching made her an ideal instructress. ... With both staff and students Dr Numbers was persona grata.\nOn\n2\nAugust\n1929\n, Annie Numbers sailed from Glasgow to Montreal in Canada on the ship the\nMelita\n. Her occupation is described as \"School Mistress\". On\n15\nSeptember\n1929\nshe sailed from New York to Southampton on the\nS S Leviathan\n. Her occupation is described as \"Teacher\". On both journeys she gives her United Kingdom address as\n6\nVentnor Terrace, Edinburgh.\nNumbers left her post at the Department of Chemistry at the University of Edinburgh after\n1930\nto become a teacher in Ipswich and then in High Wycombe. By the time of the\n1939\nRegister, she is living at Plomer Hill, High Wycombe, giving her occupation as \"High School Teacher\". She continued teaching in High Wycombe until she retired in\n1965\n.\nAnnie Hutton Numbers joined the\nEdinburgh Mathematical Society\nin January\n1917\nwhen living at\n16\nWest Savile Terrace, Edinburgh. She remained a member for around\n16\nyears while she continued to work in Edinburgh. She died on\n10\nApril\n1988\nwhen living at\n3\nCedar Court, Totteridge Road, High Wycombe.\nFinally, let us record two tributes to Numbers. Elma McMenemy published the book\nBloody Scottish History. Aberdeen\nin\n2014\n. The book had the following dedication:-\nIn memory of my Auntie Anne, Annie Hutton Numbers, MA, BSc, PhD,\n1897\n-\n1988\n, one of the 'spinster generation'. Without her unfailing guidance and encouragement in my early life I would have achieved very little.\nThe second tribute is the Annie Hutton Numbers Room named for her in Argyle House,\n3\nLady Lawson Street, Edinburgh. This is recorded in\n[\n4\n]\nwhere the location of Argyle House is given.",
  "matematicos_citados_na_biografia": [
    "Cargill Knott",
    "Edmund Whittaker",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "numbers.jpg"
  ]
}