{
  "nome_completo": "Antoine Meyer",
  "nome_curto": "Antoine Meyer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meyer_Antoine/",
  "data_nascimento": "31 May 1801",
  "local_nascimento": "Luxembourg City, Luxembourg",
  "data_morte": "29 April 1857",
  "local_morte": "Liège, Belgium",
  "summary": "Antoine Meyer was a 19 th century mathematician who wrote important works on integration and probability. He is also famed for his poetry written in Luxembourgish which is still relevant today in debates about the Luxembourg language.",
  "biografia": "Antoine Meyer\nwas the son of Hubert Meyer\n(1768\n-\n1829)\nand Elisabeth Kirschenbilder\n(1771\n-?\n)\n. Before we give any further details, let us address the question of Antoine Meyer's year of birth. It is given by some authors as\n1801\nand by others as\n1803\n. For example\n[\n13\n]\n, written in\n1860\n, gives\n1801\nwhile\n[\n10\n]\n, written in\n1869\n, gives\n1803\n. To add to the confusion,\nLucien Godeaux\ngave\n1801\nas the year of Antoine Meyer's birth when he addressed the\n72\nnd Session of the French Association for the Advancement of Science in\n1953\n[\n6\n]\nbut, three years later, gave\n1803\nin the\nNotices\n[\n5\n]\n.\nFor an English translation of the paper\n[\n5\n]\n, see\nTHIS LINK\n.\nFor an English translation of the paper\n[\n6\n]\n, see\nTHIS LINK\n.\nOf ten national libraries that hold books by Antoine Meyer, six give\n1801\nwhile four give\n1803\n. No paper we have seen discusses the two dates and only the French Wikipedia article on Antoine Meyer mentions that both dates occur in papers written shortly after his death. We have chosen to give\n1801\nsince it seems the more likely of the two when considering his age at which he began his university studies.\nLet us give some details concerning Antoine Meyer's family. His father, Hubert Meyer, was the son of Pierre Meyer\n(\nborn\n1742)\nand Marie Everling Hansen. He became a shoemaker and married Elisabeth Kirschenbilder who had been born in Sanem, a commune and town in south-western Luxembourg, on\n13\nDecember\n1771\na daughter of Dominique Kirschenbilder and Antoinette Hornek. Hubert and Elisabeth Meyer had four children, Antoine Meyer\n(\nborn\n1801\n, the subject of this biography\n)\n, François Meyer\n(\nborn\n1804)\n, Anne Marie Meyer\n(\nborn\n1805)\n, and Anne Elisabeth Meyer\n(\nborn\n1808)\n. They lived in the centre of Luxembourg old town close to the Place d'Armes. After his primary education near his home, in\n1812\nAntoine began his studies at the Athénée de Luxembourg. One of his teachers at the Athénée was Heinrich Stammer\n(1785\n-\n1859)\nwho ran the student poetry circle Polyhymnia. Antoine was a member of Stammer's Polyhymnia and developed a great love for poetry. He was a brilliant student in all his courses at the Athénée, particularly excelling in mathematics. He graduated from the Athénée in\n1818\nand later that year began his studies of mathematics at the University of Liège.\nMeyer's family were of modest means and not in a position to support their son financially through university. Alphonse Le Roy explains in\n[\n10\n]\nhow he was supported:-\nA large number of Luxembourgers were then attending the University of Liège: they clubbed together to have him come to them. He rewarded them by becoming in some way the centre of their meetings, which he enlivened with his witty conversation and his talent for improvising, in the dialect of his country, verses on all sorts of subjects. He soon began to provide for his needs by giving private lessons and taking charge of writing the catalogue of science books in the academic library.\nMeyer continued his studies at the University of Liège undertaking research for a doctorate in mathematics. He wrote the thesis\nDe maximis et minimis\nwhich was published on\n29\nNovember\n1823\nbut he did not present himself for examination at this time but rather decided to go to Paris to continue to attend the courses of the world leading mathematicians who lectured there. He travelled to Paris in\n1824\nand enrolled in courses at the Sorbonne and the Collège de France. He made the journey to Paris with only enough money to get him there. To earn enough to live he had to undertake manual work, but also made money through private tutoring. He barely had enough money to live on and certainly could not buy the books he wished to study. He managed, however, to visit the stalls of the open-air booksellers where he would read the books that he could not afford to buy. Although we do not know which mathematicians Meyer met in Paris, we note that\nJoseph Fourier\n,\nPierre Laplace\nand\nSiméon-Denis Poisson\nwere there when Meyer visited and, given Meyer's mathematical interests, it would be surprising if he had not attended their lectures.\nIn\n1826\nhe left Paris and returned to Luxembourg where he was appointed as a professor at the Collège Royal d'Echternach, where Jean Engling\n(1801\n-\n1888)\nwas his colleague. With only these two professors, Meyer had to teach Latin, Greek, Dutch, German, and mathematics. He spent two years at this College, then in\n1828\nwas appointed as professor of mathematics at the Military School of Breda which was only just opened. Breda, like Liège, was at this time in the United Kingdom of the Netherlands but in August\n1830\nthe Belgium Revolution began which would lead to Belgium becoming an independent country. Meyer left Breda in the early days of the Belgium Revolution and, in\n1831\n, he was appointed as a Professor of Mathematics at the College of Louvain.\nAlthough Meyer was being employed as a professor of mathematics, he was publishing poetry works. The first to appear was\nE Schréck op de Lëtzebuerger Parnassus\nⓉ\n(\nA Schreck on the Luxembourgish Parnassus\n)\nwith a Preface dated\n4\nSeptember\n1829\n. John Bellamy writes\n[\n17\n]\n:-\nHis poetry collection, \"E Schréck op de Lëtzebuerger Parnassus\"\nⓉ\n(\nA Schreck on the Luxembourgish Parnassus\n)\n, written entirely in Luxembourgish\n(\nincluding metalinguistic comments\n)\n, spans\n53\npages and is regarded as a founding work of Luxembourgish literature. The book begins with a four-page foreword outlining eleven points on Luxembourgish spelling and pronunciation to facilitate reading the poetry. The collection finishes with a nine-page afterword consisting of comments on Luxembourgish, including further guidance on grammar and spelling. Meyer's use of Luxembourgish for metalinguistic commentary marks this work out as unique amongst contemporary works that have sections on Luxembourgish to contextualise their literary material. ... Although Meyer's work did not initially receive much resonance or praise, the pioneering nature of the work cemented his status as a founding figure in Luxembourgish literature. The earliest ideas for a Luxembourgish spelling outlined by Meyer in this text are predominantly to facilitate reading the poetry in his collection, which is traditionally considered the first \"true\" work in Luxembourgish.\nShortly after completing the Preface on his book, on\n16\nSeptember\n1829\n, he married Catherine Kuborn\n(1810\n-\n1857)\nin Luxembourg. Catherine was the daughter of Jean George Kuborn\n(\nborn\n1784)\nand Elisabeth Meyer\n(1791\n-\n1813)\n.\nIn\n1832\nhe published in Louvain under the title of\nJong vum Schreck op de Letzeburger Parnassus\nⓉ\n(\nJong vum Schreck on the Luxembourgish Parnassus\n)\n, a second pamphlet of eighteen pages of new poems also written in Luxembourgish. Although his works on Luxembourgish poems are now considered important, at the time they received little attention with Meyer complaining that only\n37\npeople had ordered his\n1832\npamphlet.\nMeyer continued to teach mathematics, and in\n1832\nhe decided to complete the formalities require for his doctorate and he defended his\n1823\nthesis\nDe maximis et minimis\nⓉ\n(\nOn maximas and minimas\n)\nin Liège on\n16\nJune\n1832\n. Later in\n1832\nhe took up a new position of Professor of Mathematics at the Institut Gaggia in Brussels, where he prepared students for the Military School. The Institut Gaggia had been founded by P-J Gaggia, an emigrant from Brescia in Lombardy, but from\n1829\nhad been run by a Commission consisting of two members of the State Council together with\nAdolphe Quetelet\n, director of the new Brussels Observatory. While working at the Institut Gaggia, he wrote\nQuelques développements d'analyse combinatoire\nⓉ\n(\nSome developments of combinatorial analysis\n)\nwhich was published in\n1838\n. He introduces his own notation giving his reasons in a Preface which begins:-\nIn this pamphlet I use some notations different from those that are ordinarily followed. However, I beg the reader not to believe that it is through a vain desire to innovate unnecessarily that I have deviated a little from other authors; I have done so with the aim of simplifying and symmetrising my formulas. Moreover, one will see, by examining these notations, that they are almost always founded on the very nature of things; I mean that they recall to the mind a fundamental property of the operation or quantity that they designate. It is with this intention that I represent the sine by\n⊂\n\\subset\n⊂\nand the cosine by\n⊃\n\\supset\n⊃\n. For, by bringing these two signs together they form a whole circle, each of which, as a half, is the complement of the other. This circumstance is therefore proper, as we see, to fix in the mind the known property, that the sine of an arc is equal to the cosine of its complement. The use of these two elementary signs presents yet another advantage: it is that by combining them suitably and with slight alterations, we make them suitable for representing the other trigonometric lines, without removing, for that, from these combinations, the character which must always preside over the use of a good notation, and which consists in ensuring that the sign always recalls a property of the thing signified. ...\nIn\n1834\n, in addition to his position at the Institut Gaggia, he was appointed Professor of Analysis and Mechanics at the École Royale Militaire, which had just opened in Brussels. After the Belgium Revolution of\n1830\n, tension had remained between Belgium and the Netherlands and Belgium decided it needed well-trained military officers which led to the establishment of the École Royale Militaire. While at the Military School, he became interested in geodesy and collaborated with\nQuetelet\n's assistant and cartographic officers in making triangulations and he then reduced the the data. He would incorporate some of results he obtained in books he wrote in\n1844\nand\n1845\nwhich we mention below.\nMeyer had moved frequently and must have felt that his appointment to the École Royale Militaire would give him a settled career where he could undertake mathematical research. Sadly, this was not to be. Claude-Auguste Neyen writes\n[\n13\n]\n:-\n.. when one day he was busy presenting on the board a problem of higher mathematics, having before his eyes the manual that he had to follow and to which the regulations of the school obliged the teachers to conform in their teaching, he noticed that the author only gave an imperfect solution to the question and threw the book away; then he explained to his students a better method, which was his own.\nE Bède writes\n[\n2\n]\n:-\nThe act was all the more serious because the author of this book existed and occupied a high position in a neighbouring country. M. Meyer was required to apologise; he replied with his resignation, and when he was asked where he intended to go after having thus renounced his only means of existence: \"under the blue sky,\" he said, \"it will not be the first time.\"\nHe had to wait before he got another job but in\n1838\nhe was appointed to the chair of higher mathematics at the Free University of Brussels. This university had been founded in\n1834\nas the Free University of Belgium in the aftermath of Belgium becoming independent. It only became the Free University of Brussels in\n1842\n. In addition to his appointment at the Free University of Brussels, Meyer was appointed as a computer at the Ministry of War. On\n2\nApril\n1839\nhe became a Belgium national.\nIn\n1841\nhe published\nNouveaux éléments de mathématiques pures\nⓉ\n(\nNew elements of pure mathematics\n)\ngiving his affiliation as \"Employé au Dépot de la Guerre, Professeur de Mathématique a l'Institut Gaggia et a l\"Université Libre.\" This work on arithmetic was the first volume of a series of books which Meyer was intending to publish covering a broad range of mathematics but a change of Ministry caused Meyer to lose the support on which he was counting. In\n1842\nMeyer gave the course\nLeçons de trigonométrie rectiligne\nⓉ\n(\nLessons in rectilinear trigonometry\n)\nat the war depot, by order of General Joly; it was published in\n1843\n. In the following year he published the book\nLeçons de trigonométrie sphérique\nⓉ\n(\nLessons in spherical trigonometry\n)\n, being a course given at the war depot, especially for staff officers attached to Colonel Trumper's division. The Preface to this second work begins:-\nThese lessons were written to serve as a text for the course in spherical trigonometry that Colonel Trumper, director of the war depot, had instructed me to give last winter to the staff officers attached to his division. I thought it necessary to publish them as a follow-up to my lessons in rectilinear trigonometry, of which they form the necessary complement.\nWithout restricting myself to making all the propositions of the spherical depend solely on a single principle, following the example of Lagrange, I indicated in the remarks the possibility of this unitary deduction, by each time linking the propositions demonstrated by various principles, to the fundamental theorem of spherical trigonometry. This way of expounding the principles of science seemed to me to be the only way to reconcile the simplicity and ease of demonstrations, with the uniformity and scientific value of the method.\nThe reader will doubtless also see with pleasure the constant correlation that I have established between the formulas of the two trigonometries, a correlation that has provided me with a fairly simple means of giving mnemonics to the relations of spherical trigonometry, in particular those which relate to the various cases of the resolution of right triangles.\nIn\n1845\nhe published\nCours de géodésie\nⓉ\n(\nCourse in geodesy\n)\nand also another work of poems in Luxembourgish\nLuxemburgische Gedichte und Fabeln\nⓉ\n(\nLuxembourgish poems and fables\n)\nwritten in collaboration with Heinrich Gloden. Gloden\n(1804\n-\n1894)\nhad, like Meyer, attended the Athénée de Luxembourg, where he had been influenced by Heinrich Stammer. The book provides a grammatical introduction as well as explanations of certain dialect words and expressions. Alphonse Le Roy writes\n[\n10\n]\n:-\nMeyer's verses, full of originality and humour, are unfortunately intended only for a restricted public, the Luxembourg dialect offering difficulties to the Germans themselves. Indifferent to his own fame as much as heedless of the future, Meyer wrote only to relax, and addressed himself only to his compatriots: however, the curious who would like to appreciate the supple talent and sparkling spirit of the poet, and to initiate themselves at the same time into the mysteries of the language of our neighbours, will find, thanks to Meyer himself and to his friend M Gloden, their task considerably facilitated ...\nMeyer was appointed to the University of Liège in\n1849\nto occupy the chair of Mathematical Analysis. This had become vacant in\n1847\nwhen Jean-François Lemaire\n(1797\n-\n1852)\nretired and became emeritus. At this time appointments of professors were made by the Minister of the Interior and so Meyer was appointed by Charles Rogier, the minister responsible for Public Education.\nLucien Godeaux\nwrites in\n[\n5\n]\nthat this decision by Rogier was a brave one since Meyer, with his independent character, had made many enemies who wrote to the minister with their complaints. Charles Rogier, however, was confident of Meyer's qualities as a mathematician and as a teacher. He began teaching the Course on Differential and Integral Calculus, the Course on Higher Analysis and the Course on Calculus of Probabilities.\nGodeaux\nwrites\n[\n5\n]\n:-\nAs soon as he arrived in Liège, Meyer took care of the publication of his courses and of research of a higher order. His volume on the theory of definite integrals and that relating to the calculus of variations reproduce part of the course of higher analysis that he gave at the University of Liège. These are works written for students, the examples abound. They attest that the author was well aware of the issues addressed and that he knew how to present them clearly ...\nTo read more of\nGodeaux\n's\nNotice\nfor Antoine Meyer, see\nTHIS LINK\n.\nMeyer's two most important books are\nExposé élémentaire sur la théorie des intégrales definis\nⓉ\n(\nElementary presentation on the theory of definite integrals\n)\n(1851)\nand the posthumous work\nCours de Calcul des Probabilites fait a l'Universite de Liege de\n1849\na\n1857\nⓉ\n(\nCourse on Calculation of Probabilities given at the University of Liege from\n1849\nto\n1857\n)\n(1874)\n. He begins the Preface to the first of these two books as follows:-\nWhen I was charged, some time ago, with a course in higher analysis at the University of Liège, beginning this teaching with a series of lessons on definite integrals, I was not slow to realise that, in the absence of any manual, lessons on these subjects, given orally, would hardly be appreciated by the students, because of the difficulty they have in taking sufficiently accurate notes. This reason, together with the high usefulness of the course, led me to publish the text of my lessons; and here I must thank the Royal Society of Sciences of Liège, which was kind enough to help me, in this enterprise, with its disinterested patronage.\nIf, limited by financial resources, I have not been able to include, within the framework of my work, the development of all definite integrals, at least, by setting out the essential methods for determining their values, I have chosen those of these quantities which are most frequently encountered in applications. Prevented, by the nature of my work, from setting out the properties of the functions\nand L which M Goudermain introduced into analysis, I regret having been forced to omit a fairly extensive method, based on the passage from hyperbolic functions to circular functions.\nMoreover, it is less the development of the integrals themselves that I had in mind, in writing this summary, than to coordinate the various theories which relate to these values, and to give an elementary, sufficiently extensive exposition of them. For this purpose, I have divided my work into six books: the first contains the general principles on the formation and transformation of definite integrals; the second relates to the various methods of determining their values; the third gives the theory of arbitrary functions expressed by periodic series, and of multiple integrals; the fourth is devoted to the theory of\nEuler\n's transcendents, and mainly to gamma functions; the fifth makes known the principles for the reduction of multiple integrals; and finally the sixth deals with the integration of partial differential equations using definite integrals.\nThe book\nCours de Calcul des Probabilites fait a l'Universite de Liege de\n1849\na\n1857\nⓉ\n(\nCourse on Calculation of Probabilities given at the University of Liege from\n1849\nto\n1857\n)\nwas published\n17\nyears after his death. Marie-Françoise Jozeau writes in\n[\n8\n]\n(\nsee also\n[\n9\n]\n)\n:-\nAfter\n1838\n, having achieved a stable position, he wrote a dozen textbooks. These were original, and written in simple and precise language; furthermore, Meyer was quick and accurate in his calculations, which were carried out with great ability. His lectures on probability were published only many years after his death, in\n1874\nby F Folie, based on the author's manuscripts, as the \"Cours de Calcul des Probabilites fait a l'Universite de Liege de\n1849\na\n1857\n\"\nⓉ\n(\nCourse on Calculation of Probabilities given at the University of Liege from\n1849\nto\n1857\n)\n(\nF Hayez, Brussels\n)\n. This work, given the relative dearth of treatises on probability at the time, created something of a stir, and was translated into German in\n1879\nby\nEmanuel Czuber\nunder the title \"Vorlesungen aber Wahrscheinlichkeitsrechnung\"\nⓉ\n(\nLectures on probability theory\n)\n. It contains a thoroughly researched account of the theory of errors.\nF Folie writes in the Preface to Meyer's book:-\nThis book by Meyer is a very complete summary of the most important works of\nDaniel Bernoulli\n,\nAbraham de Moivre\n,\nPierre-Simon Laplace\n,\nSiméon Poisson\n,\nCarl Friedrich Gauss\n,\nJohann Encke\n,\nIréneé-Jules Bienaymé\n... on the calculus of probabilities. One might well suggest that there does not exist a broader treatise on the subject, except for\nLaplace\n's \"Theorie analytique des probabilites\"\nⓉ\n(\nAnalytical theory of probabilities\n)\n... .\nThe years Meyer spent at the University of Liège were in many ways his most productive but they were difficult years since his health was poor. He suffered from gout and struggled to carry out all his duties despite his heath problems. He died in\n1857\nat the age of\n55\nafter a particularly severe attack of gout.",
  "matematicos_citados_na_biografia": [
    "Lucien Godeaux",
    "THIS LINK",
    "Joseph Fourier",
    "Pierre Laplace",
    "Siméon-Denis Poisson",
    "Adolphe Quetelet",
    "Quetelet",
    "Godeaux",
    "Euler",
    "Emanuel Czuber",
    "Daniel Bernoulli",
    "Abraham de Moivre",
    "Pierre-Simon Laplace",
    "Siméon Poisson",
    "Carl Friedrich Gauss",
    "Johann Encke",
    "Iréneé-Jules Bienaymé",
    "Laplace"
  ],
  "imagens": [
    "meyer_antoine.jpg"
  ]
}