{
  "nome_completo": "Antoine Deparcieux",
  "nome_curto": "Antoine Deparcieux",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Deparcieux/",
  "data_nascimento": "28 October 1703",
  "local_nascimento": "Clotet-de-Cessous, France",
  "data_morte": "2 September 1768",
  "local_morte": "Paris, France",
  "summary": "Antoine Deparcieux was a French mathematician who is best known for an early work on annuities and mortality.",
  "biografia": "Antoine Deparcieux\n's father was Jean-Antoine Deparcieux while his mother was Jeanne Donzel. It was a poor family, Antoine's father being a farm worker. He attended the schools of Porte and Saint-Florent where he learned to read and write. Sadly, before his twelfth birthday, Antoine became an orphan and his education and upbringing became the responsibility of his elder brother Pierre Deparcieux.\nWhen Antoine was fifteen years old, Pierre sent him to study at the Jesuit College in Alès in southeastern France. This would not have been possible without the financial support of at least one patron. He studied at this College until he was seventeen years old. He showed great promise in scientific subjects at the College and when he left he went to Paris to study mathematics. Again he had financial support, this time from Montcarville who was his patron.\nIn Paris Deparcieux found that the financial support provided by Montcarville was not sufficient to allow him to study without a job. He became a maker of sundials and, although this is not the reason that he appears in this archive, it was an occupation which at that time gave him a reasonable income. He was also interested in hydrodynamics and hydraulics and he moved on from making sundials to invent other machinery, in particular pumps. He is chiefly known, however, for his work on mathematical and statistical tables.\nIn\n1741\nDeparcieux published\nNouveaux traités de trigonométrie rectiligne et sphérique\nⓉ\n(\nA new treatment of rectilinear and spherical trigonometry\n)\nwhich consisted of tables of sins, tans, secs\n(\ncalculated to seven decimal places\n)\n, and log sins and log tans\n(\ncalculated to eight decimal places\n)\n. This work also contains interesting trigonometric formulae for\ntan\n⁡\n1\n2\na\n\\tan \\large\\frac{1}{2}\\normalsize a\ntan\n2\n1\n​\na\n.\nIn\n1746\nDeparcieux published a treatise on annuities and mortality: it was one of the first statistical work of its kind and is the main reason for his fame. Deparcieux's interest in mortality tables resulted from his interest in life expectancy which he had investigated in several different contexts. Lorenzo de Tonti from Naples was a financier who had devised the tontine life insurance plan in the seventeenth century. Those taking part in the plan contributed money which eventually went to the one who survives all the others. Deparcieux studied the way that such plans worked, and he also studied life expectancy in individual families and religious communities. The reason for choosing data such groups was that Deparcieux was fully aware that if one looked at births and deaths in a city\n(\nas had been done before\n)\n, then migration made the data unreliable. However, as Johnson and Kotz write in\n[\n3\n]\n:-\n... the results obtained for restricted populations, although accurately derived - even according to current standards - could not reasonably be ascribed to surrounding areas, a point which caused some criticism.\nThe results of Deparcieux's investigations were published in the\n1746\ntreatise\nEssai sur les probabilités de la durée de la vie humaine\nⓉ\n(\nEssay on the probabilities of the duration of life\n)\n. Busard writes in\n[\n1\n]\n:-\nDeparcieux showed a real progress in his theoretical explanation of the properties of the tables of mortality. However, his tables, which were for a long time the only ones on life expectancies in France, indicated too small a value for the probable life expectancy at every age.\nIn\n1746\nDeparcieux was elected a member of the\nAcadémie des Sciences\nand it would appear his\n1746\npublication was the reason for this election.\nDeparcieux was, as we have indicated above, interested in hydrodynamics. He devised a way of bringing the water of the river Yvette to Paris and, although he did not see his plan put into being during his lifetime, it was carried out after his death.\nNicolas, in\n[\n4\n]\n, describes Deparcieux's character:-\nHe was modest, not overambitious always keeping in mind his humble origins.",
  "matematicos_citados_na_biografia": [
    "Académie des Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}