{
  "nome_completo": "Argelia Velez-Rodriguez",
  "nome_curto": "Argelia Velez-Rodriguez",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Velez-Rodriguez/",
  "data_nascimento": "23 November 1936",
  "local_nascimento": "Havana, Cuba",
  "data_morte": null,
  "local_morte": null,
  "summary": "Argelia Velez-Rodriguez is a Cuban-American mathematician and educator. She was the first Black woman to earn a doctorate in mathematics in Cuba.",
  "biografia": "Argelia Velez-Rodriguez\n's name before she married was Argelia Velez. Her father was Pedro Velez and he worked in the Cuban Congress under Fulgencio Batista. Batista was elected president of Cuba in\n1940\nand at first he governed well. He improved the educational system of Cuba and generally made the country more wealthy, but also made a great deal of wealth for himself.\nArgelia, who was born into a Black Roman Catholic family, was brought up in Cuba at the time of this improving situation. She attended a Roman Catholic primary school and showed her ability in mathematics at an early age when she won an arithmetic competition at her school when she was nine years old. She continued her schooling at a Roman Catholic secondary school during the period after Fulgencio Batista retired from government. This was a period of widespread corruption in the Cuban government and in\n1952\nBatista was returned to power by an army revolt.\nAt the time that Batista regained power Velez was studying mathematics at the Marianao Institute. Unlike countries such as the United States, there was no racial discrimination in Cuba at this time nor was there discrimination against women. Velez suffered no problems on these scores but Cuba was going through a bad time with Batista now governing as a brutal dictator, controlling the university, the press, and the Congress where Velez's father worked. Velez married Raul Rodriguez in\n1954\nwhile she was an undergraduate and we will now refer to her as Velez-Rodriguez. Their first child, a son, was born in\n1955\n.\nAfter gaining her Bachelor's Degree from the Marianao Institute in\n1955\n, Velez-Rodriguez continued on to graduate studies at the University of Havana. Here most of her teachers were women and all had doctorates, so it was perfectly natural for a woman in Cuba to be undertaking doctoral studies in mathematics. However, as we remarked above, Velez-Rodriguez was Black. Only around\n10\n% of the Cuban population was Black and no Black woman had received a doctorate in mathematics.\nHer doctoral work consisted of studying differential equations which arose in the study of astronomical orbits. She submitted her doctoral dissertation\nDetermination of Orbits Using Talcott's Method\nand was awarded her doctorate by the University of Havana in\n1960\n. She became the first Black woman to receive a doctorate in mathematics at the University of Havana. During her doctoral studies Velez-Rodriguez's second child, a daughter, was born in\n1959\n.\nHowever the situation in Cuba had changed again by\n1960\n. Fidel Castro had taken control of Cuba in January\n1959\n, with little opposition as the corrupt government of Batista was highly unpopular, and Batista had fled. Castro began the process of dismantling the capitalist structure in Cuba and introducing a Soviet style Communist government. Velez-Rodriguez became increasing unhappy with Communist Cuba and in\n1962\nthe Roman Catholic school which her seven year old son was attending was taken over by the Communist government. At this point she decided to go to the United States so that her children could have a better education.\nVelez-Rodriguez emigrated from Cuba to the United States in\n1962\n. Her husband, however, was unable to leave Cuba with her and he was forced to remain in Cuba for three years until he was able to join his wife. Although life in many ways was much better in the United States than it had been in Cuba, there was one respect in which it was certainly not and this was the discrimination which she now suffered both because she was Black and because she was a woman mathematician.\nIn\n1962\nVelez-Rodriguez began teaching mathematics and physics at Texas College. It was in\n1970\nthat she first became involved with the science education programmes of the National Science Foundation, and this marks the start of what would eventually become her life's work. She taught at several Colleges and schools for Black students before joining Bishop College in Dallas, Texas, in\n1972\n. It was in\n1972\nthat Velez-Rodriguez became an American citizen. At Bishop College she was a professor and she was appointed chair of the Department of Mathematical Science from\n1975\nto\n1978\n. She continued to experiment with ways of teaching mathematics which would be particularly beneficial to minority students and disadvantaged students.\nIn\n1979\nshe took leave of absence from Bishop College to become a programme manager with the Minority Institutions Science Improvement Program in Washington, D.C. She did not return to Bishop College, however, for in\n1980\nshe became director of the Minority Science Improvement Program at the U.S. Department of Education.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "velez-rodriguez.jpg"
  ]
}