{
  "nome_completo": "Barnabé Brisson",
  "nome_curto": "Barnabé Brisson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brisson/",
  "data_nascimento": "11 October 1777",
  "local_nascimento": "Lyon, France",
  "data_morte": "25 September 1828",
  "local_morte": "Nevers, France",
  "summary": "Barnabé Brisson was a French engineer who built canals. He also worked on partial differential equations.",
  "biografia": "Barnabé Brisson\n's father, Antoine-François Brisson\n(1728\n-\n1796)\n, was inspector of commerce and manufacture for the financial district of Lyon when his son Barmabé was born. Antoine-François was a scholar who published\nMémoires historiques et économiques sur le Beaujolais\nin\n1795\nand contributed to Diderot's\nEncyclopaedia\n. He was a member of various academies, including the Académie de Lyon and the Académie de Villefranche. Barnabé studied at the Collège Oratorien de Juilly. On\n11\nNovember\n1793\nhe entered the École des Ponts et Chaussées in Paris and, on\n21\nDecember of the following year, he began to study at the newly created École Centrale des Travaux Publics which had opened that year. In\n1795\n, while Brisson was a student there, the École Centrale des Travaux Publics was renamed the École Polytechnique. During these years he met\nJean-Baptiste Biot\nand, as a consequence of their friendship,\nBiot\ngot to know Brisson's sister Gabrielle who was sixteen at the time. Jean-Baptiste and Gabrielle were married in\n1797\n. Brisson was highly thought of by\nGaspard Monge\n, who was one of his teachers at the École Polytechnique. Brisson married\nMonge\n's niece, Anne-Constance Huart de l'Enclos\n(\nborn\n18\nNovember\n1789)\n, in\n1808\n. He graduated from the École Polytechnique in\n1796\nand then returned to the École des Ponts et Chaussées on\n21\nDecember of the same year. He was named as civil engineer in the Doubs department, in eastern France near the Swiss border, on\n11\nMay\n1798\n. The Doubs department had been created, along with\n82\nother departments, in\n1790\nduring the French Revolution.\nAfter sixteen months working in Doubs, Brisson was conscripted into the army on\n12\nSeptember\n1799\n. He served for less than a year before returning to his duties as a civil engineer, this time taking up a position in Besançon on\n21\nJuly\n1800\n. He specialised in the design and construction of ship canals; in particular he applied descriptive geometry to problems of canals. While at the École des Ponts et Chaussées he had got to know Pierre-Louis Dupuis de Torcy\n(1770\n-\n1803)\nand they collaborated on\nMémoire sur l'art de tracer les canaux à point de partage\nⓉ\n(\nmemory on the art of drawing the channels split point\n)\npublished in\n1801\n. In this work they applied method of geometry they had learnt from\nMonge\nto problems of geography, in particular systems of canal routing\n[\n2\n]\n:-\nBrisson and Torcy had worked out a powerful method for surveying all possible waterway linkages in France.\n[\nThey\n]\napplied descriptive geometry to the actual geography of France\n[\ndiscovering\n]\na way to find the lowest points in the watersheds between basins by a simple examination of existing topographical maps, which lacked contour lines and all but a few isolated points of altitude. Brisson's method thus overcame the limitations of contemporary cartography while avoiding the drawbacks of the traditional methods that employed the judgment of the human eye on the ground or the costly and time-consuming detailed instrument survey of alternative possibilities. By locating the appropriate summit point for any canal without leaving his study, Brisson could propose as \"possible\" over one hundred new canals, find the technically optimal\n(\ni.e. shortest and cheapest\n)\nroutes for them to follow, and even determine for long and complicated lines compounded of several waterways the correct combination of summit points.\nBetween\n1802\nand\n1809\nBrisson collaborated in the construction of the St Quentin Canal, beginning the project on\n3\nJuly. This canal, with a\n5\nkm tunnel, opened in\n1810\n. It linked the North Sea and the Scheldt and Lys systems with the English Channel via the Somme. It also linked with Paris and Le Havre via the Oise and the Seine. While working on this project Brisson was promoted, first to Ordinary Engineer First Class on\n28\nMarch\n1805\nand again to Chief Engineer Second Class on\n1\nMay\n1808\n, a very great honour for someone only thirty years old. Between\n1809\nand\n1814\nBrisson was employed extending dikes and canals in the l'Escaut region, beginning this project on\n1\nMarch. These connect the rivers Somme, Oise and Escaut, connecting the region with the navigable waterways that link Paris and Flanders. While undertaking these projects he was promoted again, this time to Chief Engineer First Class on\n1\nMarch\n1813\n. All this work had been carried out during a time of French expansion under Napoleon Bonaparte who had encouraged a huge programme of public works building. However, this all came to an end after Napoleon's abdication in\n1813\nand then his final defeat at Waterloo in\n1815\n.\nThe events of\n1814\n, when Belgium was made independent of France, brought Brisson back home and, on\n1\nAugust of that year, he was given the duties of chief engineer of the Department of Marne by Baron Pasquier. Here his main task was to oversee the repairs to roads and other structures which had been damaged during the recent wars. Over the next few years France was a much less prosperous country, having lost both territory and finance. Brisson carried out routine duties, based at Chalons-sur-Marne, but his fortunes improved markedly in October\n1819\nwhen François Becquey, the General Director of the Bureau of Ponts et Chaussées, toured the provinces and the two met. Becquey was about to initiate a programme of canal building and he discovered that Brisson was the man with precisely the expertise he needed. Brisson wrote to Becquey on\n10\nNovember\n1819\n(\nsee\n[\n2\n]\n)\n:-\nWhen you last passed through Chalons-sur-Marne you said that you would be interested in seeing the results of some studies that I have done on the interior navigation of France. Since that moment I have been busily writing up my research on that subject, and I am taking the liberty of submitting to you a first memoir covering what seems to me should comprise the first part of the general system of our interior navigation. If the views that I present seem to you likely to be taken into consideration and of becoming sooner or later some use, please let me know and that will be the most powerful encouragement for me to pursue the work I have undertaken. I will try in that case to present you later with the second part, which ought to contain a listing of the second-class canals, much more numerous than those of the first class and for which I have so far gathered the necessary materials for only about half of the kingdom.\nBecquey read Brisson's memoir and sent him an encouraging reply on\n8\nDecember. In it he asked Brisson to come to Paris as quickly as possible to work with M. Dutens on a major report detailing the whole interior navigation system of France. The innovative geometric methods which Brisson had introduced in his\n1801\nmemoir written with Dupuis de Torcy formed the basis of Brisson's approach and Becquey asked for a copy of the\n1801\npaper. Reed Geiger writes\n[\n2\n]\n:-\n... Becquey chose him to be his \"intimate counsellor\" because the obscure young Brisson possessed exactly what Becquey needed to put together his canal programme.\nThe work done by Dutens and Brisson was put together as \"Report to the King\" which proposed a system of:-\n... canals which will unite the most distant parts of the country, which will link all the rivers that traverse it, and will lead every point in the kingdom to the two seas. The admirable Languedoc Canal will then be only a branch of that vast system of internal navigation on which one will be able to travel from Marseille to Dunkerque or Strasbourg at will.\nThe report retained Brisson's first class and second class canals but added a third class consisting of all other options that had been suggested. Funding, of course, was the biggest problem and indeed private firms never came forward in the numbers hoped for to take the necessary risks involved in many of the projects. Brisson's career, however, began a rapid rise to fame.\nFrom\n1\nMay\n1820\nhe was put in charge of the project to build a canal from Paris to Tours. Later in\n1820\n, on\n26\nJuly, he was appointed professor of stereometry and construction at the École des Ponts et Chaussées. In addition he became an inspector of the École des Ponts et Chaussées on\n1\nMay in the following year. Three years later, he became secretary of the Conseil Royal des Ponts et Chaussées on\n28\nApril\n1824\nand, on the same day, Divisional Inspector. As Reed Geiger writes\n[\n2\n]\n:-\n... once ensconced in Paris he began a meteoric rise that carried him to the top of the corps in less than five of the eight years he had left to live. In the\n1820\ns, Brisson was at the centre of everything concerned with canals: professor and administrative head of a newly revitalised École des Ponts et Chaussées, secretary of the General Council, charter member of Becquey's new Canal Commission, and consultant to private companies.\nHis mathematical work is closely associated with\nGaspard Monge\n. He edited the fourth edition of\nMonge\n's\nGéométrie descriptive\nⓉ\n(\nDescriptive Geometry\n)\n, adding two new chapters. It is remarkable that following its first publication in\n1820\n, nineteen editions of Brisson's edition were published up to\n1922\n. Brisson also wrote\nNotice historique sur Gaspard Monge\nⓉ\n(\nHistorical notice of Gaspard Monge\n)\n(1818)\nfollowing\nMonge\n's death in\n1818\n. He also brought out an edition of\nMonge\n's\nThéorie des ombres et de la perspective\nⓉ\n(\nTheory of shadows and perspective\n)\nwhich was published in\n1827\n.\nRené Taton, in\n[\n1\n]\n, describes Brisson's main pure mathematical contributions:-\nHis favourite field of study was the theory of\npartial differential equations\n. Brisson drew up two important reports on this subject. One was read before the Académie des Sciences by\nBiot\n, his fellow student at the École Polytechnique and his brother-in-law. This paper was published in\n1808\n. The other was read in\n1823\nand was not published. The main idea in these reports was the application of the functional calculus, through symbols, to the solution of certain kinds of linear\ndifferential equations\nand of linear equations with finite differences. The\n1823\nreport was the object of lively discussion in\n1825\nbefore the Academy and was approved of by\nCauchy\n, who, although he had some reservations about the validity of some of the symbols used and the equations obtained, emphasized the elegance of the method and the importance of the objects to which they were applied.\nCauchy\nfollowed the way opened by Brisson, who thus became one of those who developed the methods of functional calculus.\nAs to his character, the author of\n[\n7\n]\nwrites that he had great virtues as a family man. He was an:-\n... excellent husband, good father, good brother, and a faithful and devoted friend. Forgetful of his own interests to look after those of everyone else, we can say that the qualities of his heart were equal to those of his mind.\nHe died at the Hôtel de France in Nevers.",
  "matematicos_citados_na_biografia": [
    "Jean-Baptiste Biot",
    "Biot",
    "Gaspard Monge",
    "Monge",
    "partial differential equations",
    "differential equations",
    "Cauchy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}