{
  "nome_completo": "Bartel Leendert van der Waerden",
  "nome_curto": "Bartel van der Waerden",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_der_Waerden/",
  "data_nascimento": "2 February 1903",
  "local_nascimento": "Amsterdam, Netherlands",
  "data_morte": "12 January 1996",
  "local_morte": "Zürich, Switzerland",
  "summary": "Van der Waerden was a Dutch mathematician best known for his \"Modern Algebra\" text-book. He also worked on topology and on the history of mathematics.",
  "biografia": "Bartel van der Waerden\n's parents were Theodorus van der Waerden and Dorothea Adriana Endt. Theo's father, Bartel's paternal grandfather, was Hendricus Johannes van der Waerden who owned a large blacksmith business. Theo was born in Eindhoven on\n21\nAugust\n1876\nand studied civil engineering at the Delft Technical University. Then, after teaching mathematics and mechanics in Leeuwarden and Dordrecht, he moved to Amsterdam in\n1902\nwhere again he taught mathematics and mechanics. At university he had become interested in politics and played a role in politics throughout his life as a left wing Socialist. He married Dorothea on\n28\nAugust\n1901\n. Her parents were Coenraad Endt and Maria Anna Kleij who were Dutch Protestants. Bartel was the eldest of their three children, the other two boys being Coenraad\n(\nborn\n29\nDecember\n1904)\nand Benno\n(\nborn\n2\nOctober\n1909)\n. In\n1911\nTheo was awarded the degree of Doctor of Technical Sciences, and was elected as a member of the SDAP\n(\nSociaal-Democratische Arbeiderspartij\n)\nto the Provincial government of North Holland in\n1910\n.\nAs a child, van der Waerden was not allowed to read his father's mathematics books but was told to play outside. This made him fascinated to discover mathematics for himself. After elementary school, van der Waerden entered the Hogere Burger School of Amsterdam in\n1914\n. As a school pupil at the Hogere Burger School, van der Waerden showed remarkable promise and he developed for himself the laws of trigonometry. He studied mathematics at the University of Amsterdam, beginning his course in\n1919\nat the age of sixteen. He learnt\ntopology\nfrom Gerrit Mannoury who was a friend of his father\n(\nMannoury was a Communist and Theo, although not a Communist himself, had many friends in that party\n)\n. He also learnt\ninvariant theory\nfrom Roland Weitzenböck. Dirk van Dalen\n[\n3\n]\npaints a picture of van der Waerden as an undergraduate:-\nThe study of mathematics was for him the proverbial 'piece of cake'. Reminiscing about his studies he said: \"I heard\nBrouwer\n's lectures, together with\nMax Euwe\nand Lucas Smidt. The three of us listened to the lectures, which were very difficult.\" ... Van der Waerden meticulously took notes in class, and usually that was enough to master all the material.\nBrouwer\n's class was an exception. Van der Waerden recalled that at night he actually had to think over the material for half an hour and then he had in the end understood it.\nVan der Waerden was an extremely bright student, and he was well aware of this fact. He made his presence in class known through bright and sometimes irreverent remarks. Being quick and sharp\n(\nmuch more so than most of his professors\n)\nhe could make life miserable for the poor teachers in front of the blackboard. During the, rather mediocre, lectures of Van der Waals Jr he could suddenly, with his characteristic stutter, call out: \"Professor, what kind of nonsense are you writing down now?\" He did not pull such tricks during\nBrouwer\n's lectures, but he was one of the few who dared to ask questions.\nBrouwer\nhowever, did not like to be questioned and his assistant spoke to van der Waerden asking him to ask no further questions during lectures. After taking his first degree in Amsterdam he went to Göttingen for seven months to study under\nEmmy Noether\n.\nBrouwer\nwrote to\nHellmuth Kneser\nat Göttingen on\n21\nOctober\n1924\nbefore van der Waerden went there\n(\nsee\n[\n3\n]\n)\n:-\nIn some days my student\n(\nor actually Weitzenböck's\n)\nwill come to Göttingen for the winter semester. His name is Van der Waerden, he is very clever and has already published\n(\nnamely in Invariant Theory\n)\n.\nAt Göttingen, van der Waerden learnt much topology from\nHellmuth Kneser\n. He said\n[\n7\n]\n:-\n... from the beginning I was in contact with him, and from him I really learned topology. Kneser and I used to have lunch together; after having eaten he went home, but on occasion we first took a brief walk. We strolled through the woods of Göttingen, and he taught me many things.\nDirk van Dalen writes\n[\n3\n]\n:-\nOnce in Göttingen under\nEmmy\n's wings, Van der Waerden became a leading algebraist.\nEmmy\nwas very pleased with the young Dutchman, \"That Van der Waerden would give us much pleasure was correctly foreseen by you. The paper he submitted in August to the Annalen is most excellent\n(\nZeros of polynomial ideals\n)\n... \", she wrote to\nBrouwer\non\n14\nNovember\n1925\n.\nVan der Waerden returned to the Netherlands in\n1925\nwhere he both wrote his doctoral dissertation, supervised by Hendrik de Vries, and undertook military duty at the marine base in Den Helder. Dirk van Dalen writes\n[\n3\n]\n:-\nIn mathematics Van der Waerden was easily recognised as an outstanding scholar, but in the 'real world' he apparently did not make such a strong impression. When Van der Waerden spent his period of military service at the naval base in Den Helder, a town at the northern tip of North-Holland, his Ph.D. advisor\n[\nHendrik de Vries\n]\nvisited him one day. He said that the commander was not impressed by the young man, \"he is a nice guy but not very bright.\"\nHis doctoral thesis\nDe algebraiese grondslagen der meetkunde van het aantal\nⓉ\n(\nThe algebraic foundations of the geometry of numbers\n)\nwas submitted to the University of Amsterdam and he defended it in the grand hall of the University on\n24\nMarch\n1926\n. He had been awarded a Rockefeller fellowship for a year and, following the semester in Göttingen with\nEmmy Noether\n, he went to Hamburg to study for a semester with\nHecke\n,\nArtin\nand\nSchreier\n. There he attended\nArtin\n's algebra course and took notes with the aim of writing a joint book with him. However, when later\nArtin\nsaw the part of the text van der Waerden was writing, he suggested that he write the whole book without any chapters being contributed by\nArtin\n. This eventually became van der Waerden's famous text\nModerne Algebra\nⓉ\n(\nModern Algebra\n)\n. The year\n1927\nwas a busy one for van der Waerden. He was offered a position at the University of Rostock but was appointed to a lectureship at Groningen in the same year. He returned to Göttingen as a visiting professor in\n1929\nand in July of that year he met Camilla Rellich, sister of the\nFranz Rellich\nwho was completing his doctoral thesis under\nRichard Courant\n. Van der Waerden married Camilla in September\n1929\nand the two returned to Groningen. There he continued working on\nModerne Algebra\nⓉ\n(\nModern Algebra\n)\nwhich contained much material from\nEmmy Noether\n's lectures as well as those of\nArtin\n. Volume I was published in\n1930\nwhile volume II, which contains much of van der Waerden's own work, was published in the following year.\nIn\n1931\nhe was appointed professor of mathematics at the University of Leipzig where he became a colleague of\nWerner Heisenberg\n. His interaction with\nHeisenberg\nand other theoretical physicists led to van der Waerden publishing\nDie gruppentheoretische Methode in der Quantenmechanik\nⓉ\n(\nGroup theoretic methods in quantum mechanics\n)\nin\n1932\n. He then began to publish a series of articles in\nMathematische Annalen\non\nalgebraic geometry\n. In these articles, van der Waerden defined precisely the notions of dimension of an algebraic variety, a concept intuitively defined before. His work in algebraic geometry uses the ideal theory in polynomial rings created by\nArtin\n,\nHilbert\nand\nEmmy Noether\n. His work also makes considerable use of the algebraic theory of fields. However, he later changed his approach as is evident in his book\nEinführung in die Algebraische Geometrie\nⓉ\n(\nIntroduction to Algebraic Geometry\n)\n(1939)\n.\nDan Pedoe\nwrites in a review:-\nAbout ten years ago, van der Waerden, already eminent as an algebraist, began, in a series of papers in the Mathematische Annalen, to create rigorous foundations for algebraic geometry. The implication-that there was some-thing unsound in the magnificent structure of Italian geometry-was vigorously contested by\nSeveri\n. Fortunately, van der Waerden continued his researches, but with the implicit sub-title, \"An algebraist looks at algebraic geometry\". With increasing knowledge of the powerful methods of the Italian school, he has gladly modified his own methods. Ideal-theory, the weapon of attack in his first papers, he has found almost completely unnecessary ... As a result of the experience gained in writing these papers, and in giving various courses of lectures, Professor van der Waerden has produced a work which must sooner or later find a place on every geometer's bookshelves.\nIn\n1934\nvan der Waerden joined the main editorial board of\nMathematische Annalen\n. This was a difficult time to take on such a role since he came under pressure from the Nazis not to publish papers by Jewish authors. This pressure made him think about resigning, but when he was informed that if he did so it was likely that one of the Nazis\nWilhelm Blaschke\nor\nLudwig Bieberbach\nwould replace him, he decided to continue. Both before and after the start of World War II, van der Waerden, as a foreigner, had problems from the Nazis. Although working in Germany he refused to give up his Dutch citizenship and his life was made difficult. He wrote on\n16\nMay\n1940\n(\nsee\n[\n1\n]\n)\n:-\nIn itself I have nothing against German citizenship, however, at this moment, since Germany has occupied my homeland, I would not gladly give up my previous neutrality and throw myself in a certain measure publicly on the German side.\nThis letter was written one day after the German invasion of the Netherlands was complete. At this time his parents were still in the Netherlands. They had moved from Amsterdam to Laren near the end of the\n1920\ns after their children had left home. Theo had built a fine home there but shortly after the German invasion, on\n12\nJune\n1940\n, he died of cancer. Dorothea continued to live there with her daughter but she was so distressed by the German occupation that she committed suicide on\n14\nNovember\n1942\n, drowning herself in a lake near her home. On\n4\nDecember\n1943\nthe van der Waerden home in Leipzig was bombed and Bartel and Camilla van der Waerden, together with their three children Helga, Ilse and Hans, left for Dresden where Camilla's brother\nFranz Rellich\nwas professor of mathematics. Here the situation was equally bad so they accepted an invitation from one of van der Waerden's students to live with her in Bischofswerda, a small town near Dresden. They remained there for nearly a year before returning to Leipzig. The city was under continual air attack and in\n1945\n, unable to take the strain any longer, they moved to Austria to live in the country at Tauplitz, near Graz, with Camilla's mother. In July\n1945\nAmerican soldiers arrived in Tauplitz and told everyone to return to their country of origin. The van der Waerdens returned to the Netherlands and lived in the house Theo van der Waerden had built in Laren.\nVan der Waerden now had no job and hardly any money to buy food for his family. He was offered a post at Utrecht University, arranged by\nHans Freudenthal\n, but because he had worked throughout the war in Germany, the government refuse to allow him to take up the position.\nFreudenthal\nthen managed to obtain a position for van der Waerden working for Shell in Amsterdam on applied mathematics. In\n1947\nhe visited the United States, going to Johns Hopkins University where he was offered a permanent post. He refused the offer and returned in\n1948\nto a chair of mathematics at the University of Amsterdam where he remained until\n1951\n. In\n1950\nKarl Fueter\ndied and van der Waerden was appointed to fill the vacant chair in Zürich in\n1951\n. His impact on the department in Zürich was very great. As well as an almost unbelievable range of mathematical research interests, van der Waerden stimulated research in Zürich by supervising over\n40\ndoctoral students during his years there. In fact van der Waerden was to remain in Zürich for the rest of his life.\nVan der Waerden worked on algebraic geometry, abstract algebra, groups, topology,\nnumber theory\n, geometry, combinatorics, analysis,\nprobability theory\n, mathematical statistics,\nquantum mechanics\n, the history of mathematics, the history of modern physics, the history of astronomy and the history of ancient science. We have already mentioned Van der Waerden's most famous book,\nModerne Algebra\npublished in\n1930\n-\n1931\n. In\nGalois theory\nhe showed the asymptotic result that almost all integral algebraic equations have the full\nsymmetric group\nas\nGalois\ngroup. He produced results in invariant theory,\nlinear groups\n,\nLie groups\nand generalised some of\nEmmy Noether\n's results on rings. In group theory he studied the\nBurnside\ngroups\nB\n(\n3\n,\nr\n)\nB(3, r)\nB\n(\n3\n,\nr\n)\nwith\nr\nr\nr\ngenerators and exponent\n3\n. These are solutions of the\nBurnside problem\n. These groups were shown to be finite by\nBurnside\n. In\n1933\nvan der Waerden found the exact order and structure of the groups\nB\n(\n3\n,\nr\n)\nB(3, r)\nB\n(\n3\n,\nr\n)\n. He showed that the order of\nB\n(\n3\n,\nr\n)\nB(3, r)\nB\n(\n3\n,\nr\n)\nis\n3\nN\n(\nr\n)\n3^{N(r)}\n3\nN\n(\nr\n)\nwhere the exponent\nN\n(\nr\n)\n=\nr\n+\n1\n2\nr\n(\nr\n−\n1\n)\n+\n1\n6\nr\n(\nr\n−\n1\n)\n(\nr\n−\n2\n)\n.\nN(r) = r + \\large\\frac{1}{2}\\normalsize r(r - 1) + \\large\\frac{1}{6}\\normalsize r(r - 1)(r - 2).\nN\n(\nr\n)\n=\nr\n+\n2\n1\n​\nr\n(\nr\n−\n1\n)\n+\n6\n1\n​\nr\n(\nr\n−\n1\n)\n(\nr\n−\n2\n)\n.\nAmong his many historical books are\nOntwakende wetenschap\nⓉ\n(\nAwakening science\n)\n(1950)\ntranslated into English as\nScience Awakening\n(1954)\n,\nScience Awakening II: The Birth of Astronomy\n(1974)\n,\nGeometry and Algebra in Ancient Civilizations\n(1983)\n, and\nA History of Algebra\n(1985)\n.\nDirk Struik\n, reviewing the first of these, writes:-\nThis is the first book which bases a full discussion of Greek mathematics on a solid discussion of pre-Greek mathematics. Carefully using the best sources available at present, the author acquaints the reader not only with the work of\nNeugebauer\nand\nHeath\n, but also with that of the philological critics who centered around the \"Quellen und Studien.\" ... This book contains a wealth of material, critically arranged, and reads exceedingly well. It has an original approach and contains much novel material.\nAs to\nA History of Algebra\n, Jeremy Gray writes in a review:-\nIt is almost unfailingly clear. The arguments presented are summarized with a deftness that isolates and illuminates the main points, and as a result they are frequently exciting. Since nearly\n200\npages of it are given over to modern developments which are only now receiving the attention of historians, this book should earn itself a place as an invaluable guide. Its second virtue is the zeal with which the author has attended to the current literature. Almost every section gives readers an indication of where they can go for a further discussion. As a result, many pieces of information are here presented in book form that might otherwise have languished in the scholarly journals. Since one must be cynical of the mathematicians' awareness of those journals, the breadth and generosity of van der Waerden's scholarship will do everyone a favour.\nThe history of mathematics was not a topic he just turned to late in life. He explained\n[\n7\n]\n:-\nWhen I was a student,\nHendrik de Vries\ngave a course on the history of mathematics. After that I read\nEuclid\nand some of\nArchimedes\n. Thus, my interest began very early. At Göttingen - the first time I was there - I attended the lectures of\nNeugebauer\n, who gave a course on Greek mathematics.\nVan der Waerden's important paper\nDie Arithmetik der Pythagoreer\nⓉ\n(\nThe arithmetic of the Pythagoreans\n)\nappeared in\n1947\nfollowed by\nDie Astronomie der Pythagoreer\nⓉ\n(\nThe astronomy of the Pythagoreans\n)\nin\n1951\n.\nIn\n1973\nvan der Waerden retired from his chair in Zürich. He continued to undertake research in the history of mathematics publishing around\n60\npapers after he retired. The papers which appeared in the years\n1986\n-\n88\ninclude:\nFrancesco Severi and the foundations of algebraic geometry\n(1986)\n,\nOn Greek and Hindu trigonometry\n(1987)\n,\nThe heliocentric system in Greek, Persian and Hindu astronomy\n(1987)\n,\nThe astronomical system of the Persian tables\n(1988)\n, On the\nRomaka-Siddhanta\n(1988)\n,\nReconstruction of a Greek table of chords\n(1988)\n, and\nThe motion of Venus in Greek, Egyptian and Indian texts\n(1988)\n. Although several of his publications appeared after\n1988\n, all were taken from lectures he had given earlier.",
  "matematicos_citados_na_biografia": [
    "topology",
    "invariant theory",
    "Brouwer",
    "Max Euwe",
    "Emmy Noether",
    "Hellmuth Kneser",
    "Emmy",
    "Hecke",
    "Artin",
    "Schreier",
    "Franz Rellich",
    "Richard Courant",
    "Werner Heisenberg",
    "Heisenberg",
    "algebraic geometry",
    "Hilbert",
    "Dan Pedoe",
    "Severi",
    "Wilhelm Blaschke",
    "Ludwig Bieberbach",
    "Hans Freudenthal",
    "Freudenthal",
    "Karl Fueter",
    "number theory",
    "probability theory",
    "quantum mechanics",
    "Galois theory",
    "symmetric group",
    "Galois",
    "linear groups",
    "Lie groups",
    "Burnside",
    "Burnside problem",
    "Dirk Struik",
    "Neugebauer",
    "Heath",
    "Hendrik de Vries",
    "Euclid",
    "Archimedes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}