{
  "nome_completo": "Bernard Placidus Johann  Nepomuk Bolzano",
  "nome_curto": "Bernard Bolzano",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bolzano/",
  "data_nascimento": "5 October 1781",
  "local_nascimento": "Prague, Bohemia, Austrian Habsburg domain (now Czech Republic)",
  "data_morte": "18 December 1848",
  "local_morte": "Prague, Bohemia (now Czech Republic)",
  "summary": "Bernard Bolzano successfully freed calculus from the concept of the infinitesimal. He also gave examples of 1 - 1 correspondences between the elements of an infinite set and the elements of a proper subset.",
  "biografia": "Bernard Bolzano\n's parents were Bernard Pompeius Bolzano and Maria Cecilia Maurer. His mother Maria, the daughter of a Prague merchant, was German speaking and a devout Roman Catholic. Bernard Bolzano senior, the father of the subject of this biography, was born in the north of Italy and had emigrated to Prague. He made his living as a dealer in art, but was a man of modest means. Well educated, he was also a pious Roman Catholic who showed great concern towards others. An indication of how seriously he put his beliefs into practice is the fact that he was the driving force behind the founding of an orphanage in Prague. Bernard, the subject of this biography, was born in the oldest part of the city of Prague, being the fourth of his parents twelve children. Despite the large family, Bernard and one of his brothers, Johann, were the only two to reach adulthood. His health, however, was delicate and he had to fight against respiratory problems throughout his life.\nBolzano's upbringing was a major factor in the ideas that he taught later in his life. He was much influenced by his father's active attempts to care for his fellow men, and this was strengthened by the Piarist\nGymnasium\nthat Bolzano attended in Prague between\n1791\nand\n1796\n. There he was taught by the Roman Catholic followers of Joseph Calasanz who was the Spanish founder of the Ordo Clericorum Regularium Pauperum Matris Dei Scholarum Piarum\n(\nOrder of Poor Clerks Regular of the Mother of God of the Pious Schools\n)\n. Although Spanish, Calasanz founded Order, usually called by the name Piarists, in Rome at the beginning of the\n17\nth\ncentury. Members of the Piarist Order were teachers who made a fourth vow to take special care of young people in addition to the usual three vows made by monks. It is fair to say that Bolzano left this environment more convinced of the moral beliefs, which had been foremost in his upbringing and in his schooling, than in the purely religious Christian beliefs.\nBolzano entered the Philosophy Faculty of the Charles University of Prague in\n1796\n, studying philosophy, physics and mathematics. Bolzano was particularly influenced in his mathematical studies by reading\nKaestner\n's\nMathematische Anfangsgründe\nⓉ\n(\nMathematical Foundations\n)\n.\nKaestner\nwas concerned with philosophical questions in mathematics, was deeply interested in the philosophy of mathematics, and took great care to prove many results which were thought \"obvious\", so not requiring proof, by other mathematicians of the day. Bolzano, who soon developed a strong belief in this approach, wrote:-\nMy special pleasure in mathematics rested therefore particularly on its purely speculative parts, in other words I prized only that part of mathematics which was at the same time philosophy.\nDuring the year\n1799\n-\n1800\nBolzano undertook research in mathematics with\nFrantišek Josef Gerstner\nand also contemplated his future. In the autumn of\n1800\n, against his father's wishes, he began three years of theological study at the Charles University. While pursuing his theological studies he prepared a doctoral thesis on geometry. He received his doctorate in\n1804\nwriting a thesis giving his view of mathematics, and what constitutes a correct mathematical proof. In the preface he wrote:-\nI could not be satisfied with a completely strict proof if it were not derived from concepts which the thesis to be proved contained, but rather made use of some fortuitous, alien, intermediate concept, which is always an erroneous transition to another kind.\nTwo days after receiving his doctorate Bolzano was ordained a Roman Catholic priest. However, as Russ points out in\n[\n50\n]\n:-\nHe came to realise that teaching and not ministering defined his true vocation.\nIn fact his years of study of theology had done nothing to strengthen his acceptance of the religious beliefs on which Christianity is founded. However, his professor at the Charles University had put forward an argument which Bolzano had found very persuasive, namely that faith in a doctrine was justified if it led to moral good. Later in his writings Bolzano argued for a more general form of this argument:-\nOf all actions possible to you, choose always the one which, weighing all consequences, will most further the good of the totality, in all its parts.\nThis allowed Bolzano to accept the mystical elements of Christianity for the greater good of mankind, although he did not accept them to be historically true.\nIn order to understand the events of Bolzano's life, we need to fill in a little background about the situation in Bohemia. From early in the\n17\nth\ncentury, after Roman Catholic forces defeated the Bohemian Protestants, Bohemia had been ruled by the Habsburgs. It was absorbed into the Austrian Empire, German became the language of instruction in grammar schools and the Charles University, and Czech nationalism was suppressed. In\n1781\nJoseph II granted religious tolerance but the French Revolution brought in an era of free thinking which the rulers feared. To hold the Empire together, the rulers decided to move against all nationalistic organisations which they believed encouraged ideas of independence for various parts of the Empire. In\n1804\n, Emperor Franz who ruled from Vienna, decided that one way to counter the impact of the enlightenment was to strengthen the hold of the Roman Catholic Church which tended to be very conservative and opposed to liberal thinking. He set up chairs of philosophy of religion in the universities as one of the means to achieve his aims.\nChairs in the universities were filled by competition and Bolzano entered two such competitions for chairs at the Charles University. One was for the chair of mathematics which became vacant on the death of Stanisław Vydra, the other being for the new chair in the philosophy of religion which Emperor Franz had just established. Bolzano came top in both competitions, but the university preferred to give him the chair in the philosophy of religion since they were then able to give the mathematics chair to Ladislaw Jandera who had substituted for Vydra during his illness between\n1801\nand\n1804\n. In many ways Bolzano was exactly the wrong person to fill this chair given the reasons for its creation, for he stood for all the ideas which Franz feared, being a free thinker who believed in social justice, pacifism, and equality for the Czech speaking Bohemians.\nHis appointment to the chair had to be confirmed in Vienna, and they certainly understood that he was not the Roman Catholic conservative that they had been hoping would be appointed. Confirmation of his appointment was delayed while Vienna considered what its best action should be, but in\n1807\nit was granted\n[\n10\n]\n:-\n... he lectured on religion and moral philosophy with strong pacifistic and socialistic overtones. He used the pulpit to proclaim before hundreds of impressed students a kind of utopian socialism. In his sermons he tried to prove the essential equality of all human beings, attacked private property obtained without work, and exhorted his listeners to sacrifice everything in their struggle for human rights.\nThe appointment of Bolzano was viewed with suspicion by the Austrian rulers in Vienna. He criticised discrimination wherever he saw it, principally by the German speaking Bohemians against their Czech fellow citizens, and also he criticised the anti-Semitism displayed by both the German and Czech Bohemians. Some members of the Roman Catholic Church were also unhappy because Bolzano's lectures contains elements of rationalism. He certainly had supporters within the Church, for example the important Archbishop of Prague and Dr Fessl who directed the seminary of Leitmeritz. In\n1815\nBolzano was elected to the Royal Bohemian Society of Sciences which was bilingual society drawing its members mainly from the German speakers but also from Czech speakers. Bolzano published\nOn the Condition of the Two Nationalities in Bohemia\nin\n1816\nin which he put into print his concerns that the Czech Bohemians were dominated by the German speaking Bohemians. The peasants were Czech speaking, the cities largely inhabited by German speakers but Bolzano saw the problems which were being created due to increasing industrialisation which saw Czech speakers moving into the cities. Bolzano's career continued to flourish, despite the fact that charges were brought against him at the Vienna court in\n1816\n, and in\n1818\nhe was elected Dean of the Faculty of Philosophy at Charles University.\nBolzano was suspended from his position in December\n1819\nafter pressure from the Austrian government. In addition to being suspended from his professorship, he was put under house arrest, had his mail censored, and not allowed to publish. Between\n1821\nand\n1825\nhe was tried by the Church, and despite his strong defence of his views, was required to recant his supposed heresies. He refused to do so and resigned his chair. From\n1823\nhe had spent the summers living near the village of Techobuz in southern Bohemia, on the estate of his friends Josef and Anna Hoffmann, while he spent the winter living in Prague with his brother Johann. J J I Hoffmann was a mathematician who had reviewed several of Bolzano's earlier works\n(\nsee\n[\n54\n]\n)\n. Between\n1830\nand\n1841\nhe lived throughout the year with the Hoffmanns, having much time to devote to study. When Anna Hoffmann took ill in\n1841\n, Bolzano and the Hoffmanns moved to Prague where they all lived with Johann Bolzano\n(\nAnna died in\n1842)\n. There Bolzano again became an active member of the Royal Bohemian Society of Sciences and was president during\n1842\n-\n43\n. He had suffered from respiratory problems for most of his life and these became more severe as he grew older. In the winter of\n1848\nhe contracted a cold which, given the poor condition of his lungs, led to his death.\nAlthough some of his books had to be published outside the Austrian Empire because of government censorship, he continued to write and to play an important role in the intellectual life of his country. In fact he had won a partial lifting of the publication ban, and he was only forbidden from publishing anything of a religious or political nature.\nBolzano wrote\nBeyträge zu einer begründeteren Darstellung der Mathematik. Erste Lieferung\nⓉ\n(\nContibutions to justifying a more comprehensive view of mathematics. First part\n)\n(1810)\n, the first of an intended series on the foundations of mathematics. Bolzano wrote the second of his series but did not publish it. Instead he decided to:-\n... make myself better known to the learned world by publishing some papers which, by their titles, would be more suited to arouse attention.\nPursuing this strategy he published\nDer binomische Lehrsatz\n...\nⓉ\n(\nThe binomial theorem ..\n)\n.\n(1816)\nand\nRein analytischer Beweis\n...\nⓉ\n(\nPure analytic proof ...\n)\n(1817)\n, which contain an attempt to free calculus  from the concept of the\ninfinitesimal\n. He is clear in his intention stating in the preface of the first of these that the work is:-\n... a sample of a new way of developing analysis.\nAlthough Bolzano did achieve exactly what he set out to achieve, he did not do so in the short term, his ideas only becoming well known after his death. In\n[\n50\n]\nRuss describes Bolzano's aims in the\n1817\npaper:-\nIn this work ... Bolzano ... did not wish only to purge the concepts of limit, convergence, and derivative of geometrical components and replace them by purely arithmetical concepts. He was aware of a deeper problem: the need to refine and enrich the concept of number itself.\nThe paper gives a proof of the intermediate value theorem with Bolzano's new approach and in the work he defined what is now called a\nCauchy\nsequence. The concept appears in\nCauchy\n's work four years later but it is unlikely that\nCauchy\nhad read Bolzano's work.\nAfter\n1817\n, Bolzano published no further mathematical works for many years. However, in\n1837\n, he published\nWissenschaftslehre\nⓉ\n(\nThe theory of science\n)\n, an attempt at a complete theory of science and knowledge. Between sometime before\n1830\nand the\n1840\ns, Bolzano worked on a major work\nGrössenlehre\nⓉ\n(\nThe greater theory\n)\n. This attempted to put the whole of mathematics on a logical foundation was published in parts, while Bolzano hoped that his students would finish and publish the complete work. His work on paradoxes\nParadoxien des Unendlichen\nⓉ\n(\nParadoxes of infinity\n)\n, a study of paradoxes of the infinite, was published in\n1851\n, three years after his death, by one of his students. The word set appears here for the first time. In this work Bolzano gives examples of\n1\n-\n1\ncorrespondences between the elements of an infinite set and the elements of a proper subset.\nMost of Bolzano's works remained in manuscript and did not become noticed and therefore did not influence the development of the subject. Many of his works were not published until\n1862\nor later. Bolzano's theories of mathematical infinity anticipated\nGeorg Cantor\n's theory of infinite sets. It is also remarkable that he gave an example of a function which is nowhere differentiable yet everywhere continuous.\nAttempts to publish Bolzano's manuscripts are described in our article\nBernard Bolzano's manuscripts\n.\nAs an example of the mathematics that Bolzano was working on while he was professor of the philosophy of religion, here is a description of what he recorded in his notebook\nMiscellanea mathematica\nin\n1816\n. The description is by Dauben reviewing this material when it was first published in\n1996\n:-\nBolzano opens this notebook of Miscellanea mathematica with notes on irrational and transcendental numbers and functions. But he was reading and recording his ideas on a host of other subjects as well, including the problem of how best to approach the proper mathematical understanding of zero;\nLegendre\n's work on surfaces, convexity, concavity, and conditions for congruity; analysis of other geometric concepts, including lengths, areas, volumes, and spheres; trigonometric formulas and spherical trigonometry; imaginary and exponential numbers; definition of the differential and discussion of the infinite and various opinions about it, as well as aspects of maxima and minima. ... Other topics covered here include various approaches to the calculus\n(\nincluding the method of exhaustion\n)\n, and grounds for asserting the certainty of mathematics.\nIn addition to his mathematical work, Bolzano was important as a philosopher and as a logician. We mention briefly two major works. First there is\nLehrbuch der Religionswissenschaft\n(\nTextbook of the Science of Religion\n)\n(1834)\nin which he bases his religious philosophy on ethics\n[\n35\n]\n:-\nHe criticises Kant's categorical imperative and his doctrine of postulates, and advocates a version of utilitarianism.\nHis second major work which we mention is\nWissenschaftslehre\nⓉ\n(\nThe theory of science\n)\npublished in four volumes in\n1837\n. The first two volumes cover his ideas on the philosophy of logic, the third volume presents a theory of scientific discovery, while the final volume presents his methodology of writing textbooks\n[\n17\n]\n:-\nBolzano's theory of science\n(\nWissenschaftslehre\n)\ncontains a great amount of very valuable information concerning the development of logic from its beginnings in\nAristotle\ntill the post-Kantian period. In a critical exposition, Bolzano presents views of his predecessors and compares them with his own point of view.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Kaestner",
    "František Josef Gerstner",
    "infinitesimal",
    "Cauchy",
    "Georg Cantor",
    "Bernard Bolzano's manuscripts",
    "Legendre",
    "Aristotle"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}