{
  "nome_completo": "Charles Marie de La Condamine",
  "nome_curto": "Charles-Marie de La Condamine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/La_Condamine/",
  "data_nascimento": "28 January 1701",
  "local_nascimento": "Paris, France",
  "data_morte": "4 February 1774",
  "local_morte": "Paris, France",
  "summary": "Charles-Marie La Condamine was a French mathematician and surveyor who took part in an expedition to South America to measure a degree of latitude.",
  "biografia": "Charles-Marie de La Condamine\n's parents were Charles de La Condamine\n(1649\n-\n1711)\n, a district tax collector of the Bourbonnais, and Louise-Marguerite de Chourses\n(1672\n-\n1751)\n, daughter of Gabriel de Chourses and Judith de Breslay. Charles and Louise-Marguerite were married on\n3\nFebruary\n1697\nat Versailles. Notice that Charles was\n23\nyears older than his wife. They had two children Charles-Marie de La Condamine, the subject of this biography, and Louise Hélène de La Condamine\n(1706\n-\n1771)\n. Charles-Marie was baptised in the Saint-Roch church in Paris.\nCharles-Marie de La Condamine studied at the Jesuit College of Louis-le-Grand in Paris. There he was taught mathematics by Père\nLouis Castel\n, philosophy by Père Brisson the Professor of Theology, and humanities by Père Charles Porée\n(1675\n-\n1741)\nthe Professor of Rhetoric. Porée was a friend of Voltaire\n(1694\n-\n1778)\nand soon La Condamine would also become a friend of Voltaire who had himself been a student at Louis-le-Grand. On leaving the College, La Condamine had little enthusiasm for any particular career so he decided to join the military. When the War of the Quadruple Alliance broke out with Spain in August\n1718\nhe joined the army. The Quadruple Alliance against Spain consisted of the Hapsburg Empire, England, France and Savoy. After the Spanish attacked Sardinia and Sicily, the French retaliated by attacking Catalonia, trying to seize the fortress of Rosas. La Condamine  was involved in this French attack and distinguished himself with his bravery at the siege of Rosas in early\n1719\n. However, he soon decided that army life did not suit him and he left the army seeking other exciting occupations. Back in Paris, he lived in a house in the cul-de-sac St Thomas du Louvre near the Louvre Gallery close to the Seine. He began to study mathematics, in particular conic sections, mechanics, chemistry and physics, where he was particularly interested in the declination of the magnetic needle. He was certainly not looking for a quiet life and sought the company of scientists and artists\n[\n6\n]\n:-\nIn Paris in the late\n1720\ns, he regularly attended the informal salon at the Café Procope, which was presided over at the time by the flamboyant dramaturge Antoine Houdart de La Motte. Later,\nPierre-Louis Moreau de Maupertuis\ntook the reins, an astronomer with whom La Condamine would collaborate throughout his career ...\nLa Condamine was adept at mathematics both through the excellent teaching at Louis-le-Grand and his own studies, and he applied his skills to make lots of money for himself and his friend Voltaire. The French government had set up a lottery in\n1728\nin an effort to raise money but they miscalculated the prizes offered. Neil Safier writes\n[\n6\n]\n:-\nFollowing Voltaire's return from exile in England, during which time he had become a vocal advocate for Newtonian science, the two friends conceived and carried out a brilliant scheme to defraud the French treasury of large sums of money. For anyone willing to make the massive initial investment, La Condamine had realised with devious mathematical prowess that the poorly designed lottery would pay out more money than it actually took in. They bought as many tickets as they could, and enriched themselves greatly as a result.\nThe Deputy Finance Minister, Le Pelletier-Desforts, finally realised that Voltaire and La Condamine had set up a scheme which was making them rich at the expense of the French State. He took them to court but lost the case. The lottery was shut down in\n1730\n, Le Pelletier-Desforts was sacked, but Voltaire and La Condamine were allowed to keep their winnings. La Condamine used his newly acquired fortune for scientific exploration.\nAt this point La Condamine, who already had many contacts with scientists in Paris, was proposed for election to the\nAcadémie Royale des Sciences\nas an adjoint in chemistry. He was elected a member of the Academy on\n12\nDecember\n1730\n. Certainly his friendship with Paris scientists, particularly\nMaupertuis\n, was a factor here but some members of the Academy were wary of La Condamine given his recent exploits with the lottery. The quiet life in Paris did not suit him either and, using funds from his lottery wins, he sailed on the ship L'Espérance of the Levant Company commanded by Pierre Blouet de Camilly on a voyage to Algiers, Alexandria, Palestine, Cyprus and Constantinople\n(\nnow Istanbul\n)\nwhere he spent five months. Some of the observations and experiments he carried out had been suggested by Maupertuis. He was particularly interested in the pyramids and obelisks he saw in Egypt, observing hieroglyphs some of which he sketched. On his return to Paris he published mathematical and physical observations of his voyage in the paper\nObservations mathématiques et physiques faites dans un voyage de Levant en\n1731\net\n1732\nⓉ\n(\nMathematical and physical observations made travelling in the Levant  in\n1731\nand\n1732\n)\n. It contains sections on navigation, geography, mechanics, anatomy, chemistry, botany, physics, and natural history. It was presented to the\nAcadémie Royale des Sciences\non\n12\nNovember\n1732\n[\n1\n]\n:-\nAlthough the memoir did not consist entirely of new results, it was sufficient to earn him the reputation of a competent mathematician, an observant traveller, and a good storyteller.\nFor example, he writes about the Egyptian hieroglyphs:-\nOne can see along the seashore, among the ruins of Alexandria, Egypt, two obelisks composed of granite, or Theban stone. ... As far as the obelisk is concerned, the side exposed to the northwest, which faces the sea, and the side facing the new city, are those that are best preserved, and one can clearly make out the hieroglyphic figures that are engraved there, and which I have sketched.\nThe\nAcadémie Royale\nwas impressed, promoted La Condamine to associate mathematician in\n1735\n, and sent him on a scientific expedition to Peru. In April\n1735\nLa Condamine set out on the expedition to Peru to measure the length of a degree of meridian at the equator. One of the big problems of science at this time was to decide between the competing views of\nNewton\n, who argued that the earth was flattened at the poles, and of\nDescartes\nwho argued that the earth was flattened at the equator.\nPierre Bouguer\nwas a member of the same expedition and its third scientific member was the leader of the expedition Louis Godin\n(1704\n-\n1760)\n. The three finished their journey by different routes, La Condamine going overland from Manta, the other two sailing to Quito where they joined up. La Condamine sailed up the Esmeraldas River and then climbed over the Andes Mountains, arriving in Quito on\n4\nJune\n1736\n. As part of the surveying work that La Condamine carried out he had pyramids constructed:-\n... specially suited to fix the endpoints of the measurement that had been the foundation of all our geographical and astronomical observations.\nAs La Condamine wrote in\nHistoire des pyramides de Quito\n(1751)\n:-\nThere was never any discussion of constructing a fancy edifice, but rather a simple and durable monument appropriate for showing clearly the two endpoints of our base. As far as their form was concerned, the most convenient to accomplish our purposes was the pyramid, and the simplest of all pyramids was the tetrahedron; but since we wanted to orient the structure in relation to the regions of the world, I decided to give our pyramids four sides, not including the base, a decision which also happened to facilitate their construction.\nWhile La Condamine was on the South American journey the\nAcademy\nmade him a pensionary member in chemistry in\n1739\n. However, things did not go smoothly and the three French scientists were soon involved in disagreements. Godin began to work on his own while La Condamine worked with\nBouguer\n. In\n1741\nBouguer\ndiscovered a small error in their joint measurements and the two fell out when\nBouguer\nrefused to allow La Condamine to recheck the results. All three made independent measurements, the work being completed in\n1743\n. The three scientists returned by different routes. In\n1743\nLa Condamine began his return journey which included a four month raft journey down the Amazon river. He gave the first scientific account of the Amazon which he published as\nJournal du voyage fait par ordre du roi a l'équateur\nⓉ\n(\nA travel journal made by Royal order at the equator\n)\n(1751)\n. He had already published his map in\nCarte du cours du Maragnon ou de la Grande Rivière des Amazones\nⓉ\n(\nMap of the course of the Maranon or Great River of the Amazons\n)\n(1745)\n. He wrote that his aim was to produce a map:-\n... of the course of a river that traverses vast lands nearly unknown to geographers.\nNeil Safier writes in\n[\n17\n]\n:-\nThe map extended from the Pacific coast to the Atlantic, from the Spanish American province of Quito in the west to the Portuguese city of Pará in the east\n(\nnear the mouth of the Amazon\n)\n, including the Guyanas to the north and parts of Brazil and Peru to the south.\nLa Condamine's account, however, is a mixture of accurate precision surveys and unverified reports of locals. For example, he tried to verify many of the legends which had grown up concerning South America. For some of these he did indeed provide scientific evidence, for example concerning the bark of the Cinchona tree famed as a cure for fevers\n(\nit contains the anti-malarial drug quinine\n)\n. Others, such as the legend of the Amazon women warriors\n(\nafter which the river is named\n)\nhe accepted as true on the basis of reports by locals. Many believe that he accepted such legends simply because they made his reports far more interesting and exciting to the French public.\nLa Condamine spent five months in Cayenne on his journey home and here he repeated\nRicher\n's experiments on the variation of weights at different latitudes. The reason he did not return earlier was the fact that France was at war, involved in the War of the Austrian Succession, and he felt that a voyage on a French merchant ship would be too dangerous as it was liable to be attacked. He waited for a Dutch vessel on which he returned to Amsterdam. The journey, which went via Paramaribo, the capital of Surinam, took from\n22\nAugust to\n30\nNovember\n1744\n. In February\n1745\nLa Condamine made the final leg of his journey arriving in Paris on\n23\nrd\nof that month. He had been away for ten years. He returned with many notes,\n200\nnatural history specimens and works of art which he gave to\nBuffon\n. However, after reaching Paris he learnt that\nBouguer\nhad presented their joint work to the Academy under his own name. La Condamine wrote\n(\nsee\n[\n4\n]\n)\n:-\nM Bouguer\nhas taken possession of everything in presenting our joint work first ... it is impossible for me to say anything new.\nBouguer\n, however, claimed that reading his paper first put him at a disadvantage since he was required to give a copy to the\nAcademy\nwhich could then be read by La Condamine while he had no way of knowing what La Condamine would report to the\nAcademy\n. Consequently he broke the rules and refused to give a copy of his paper to the\nAcademy\n. The president of the\nAcademy\n, Jean-Jaques Amelot de Chaillou\n(1689\n-\n1749)\n, tried to sort out the problem and La Condamine was asked to read his paper which would be printed in the same volume as that of\nBouguer\n. La Condamine read the paper\nRelation abrégée d'un voyage fait dans l'intérieur de l'Amérique méridionale\n.\nBouguer\ntried to disrupt the reading of La Condamine's paper with continual interruptions but both their papers did appear in the same volume of the\nMémoires\nof the\nAcademy\n. The argument continued, however, with\nBouguer\nclaiming that La Condamine's paper contained real changes from what had been reported to the\nAcademy\n. If the two versions are compared today, we see that La Condamine did make some changes to the style of writing but not to the content. When both scientists published further papers and books relating to the expedition again arguments raged. We should make it clear that all these arguments were not related to the scientific content, but simply arguments over who should get the most credit. Yves Laissus writing in the\nDictionary of Scientific Biography\nsays\n[\n1\n]\n:-\nThe last survivor of the expedition, La Condamine, who was a less gifted astronomer than Godin and a less reliable mathematician than\nBouguer\noften received the major part of the credit, probably because of his amiable nature and his talent as a writer.\nIn\n1756\nLa Condamine went to Italy. His purpose was to seek permission from the pope, Benedict XIV, to allow him to marry his niece Charlotte Bouzier d'Estouilly\n(1726\n-\n1779)\n, the daughter of his sister Louise Hélène de La Condamine and her husband Antoine Bouzier d'Estouilly. Permission was granted by the pope and they married in August\n1756\n. However, La Condamine could not make a trip to Italy without making scientific observations.\nA report of these scientific observations, made to the\nRoyal Society of London\nis at\nTHIS LINK\nLa Condamine spent much effort in the last part of his life campaigning for inoculation against small-pox. His passion on this topic was partly due to the fact that he had suffered from small-pox as a child. He read two papers on this topic to the\nAcademy\nin\n1754\nand\n1758\nbut when he tied to publish a third paper in\n1764\nhe ran into problems. The Committee of the\nAcademy\nwhich decided on publications had become anti-inoculation.\nCharles-Etienne-Louis Camus\nand Antoine Petit\n(1722\n-\n1794)\nwere asked to report on La Condamine's paper but nothing happened for over three years. La Condamine went over the heads of the Committee and took his fight to the full\nAcademy\nwhere\nCamus\nand Petit's report was read on\n9\nJanuary\n1768\n. It stated\n(\nsee\n[\n4\n]\n)\n:-\nWe believe that this memoir by M de La Condamine not only contains nothing that could hinder its publication, but on the contrary that it contains a large number of useful points which bring honour to the author and which make it worthy of a place in the collection of memoirs published by this\nAcademy\n.\nHowever, the Committee still refused to publish La Condamine's paper. He appealed again to the full\nAcademy\nwhich, eventually, overruled its own publication Committee and the paper appeared in print.\nAlthough exceptionally talented, La Condamine's character meant that his researches were less deep than they might have been.\nCondorcet\nwrites in\n[\n12\n]\n(\nor\n[\n13\n]\n)\nthat his character:-\n... made all prolonged meditation impossible, preventing him from going deeply enough into any scientific area to arrive at any new discoveries.\nHowever,\nCondorcet\nwrites that La Condamine was\n[\n12\n]\n:-\n... widely known in every society, possessing the art of persuading the ignorant people to whom he had listened, bringing back singular observations to pique the frivolous curiosity of the people of the world, writing with enough charm to have people read his work, with enough neglect and too simple a tone to foster envy or threaten the self-esteem of others, interesting for his bravery and piquant for his faults.",
  "matematicos_citados_na_biografia": [
    "Louis Castel",
    "Pierre-Louis Moreau de Maupertuis",
    "Académie Royale des Sciences",
    "Maupertuis",
    "Académie Royale",
    "Newton",
    "Descartes",
    "Pierre Bouguer",
    "Academy",
    "Bouguer",
    "Richer",
    "Buffon",
    "M Bouguer",
    "Royal Society of London",
    "THIS LINK",
    "Charles-Etienne-Louis Camus",
    "Camus",
    "Condorcet"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}