{
  "nome_completo": "Charles Vernon Boys",
  "nome_curto": "Charles Boys",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boys/",
  "data_nascimento": "15 March 1855",
  "local_nascimento": "Wing, Rutland, England",
  "data_morte": "30 March 1944",
  "local_morte": "St Mary Bourne, Andover, Hampshire, England",
  "summary": "Charles Boys was an English physicist, known for his careful and innovative experimental work.",
  "biografia": "Charles Boys\n' parents were Caroline Goodrich Dobbie and the Rev Charles Boys who was the vicar at Wing. Charles was one of a large family, being his parents' eighth child, and he was brought up in the vicarage at Wing. He was educated at Marlborough, and in the dedication of his book on\nSoap bubbles\nhe expressed his gratitude to Mr G F Rodwell, the first science master appointed at that school. From there Boys went to the Royal School of Mines where he was taught physics by Frederick Guthrie. He graduated in mining and metallurgy. The school had no mathematics department so Boys learnt mathematics from books including\nTodhunter\n's\nIntegral Calculus\n. He always claimed, perhaps because of this lack of mathematical education, that he was not a mathematician. Others, including his pupils, certainly did not agree with this as he showed a wide knowledge of geometrical methods.\nBoys is famed as a physicist and inventor of instruments. While still at the Royal School of Mines he invented an integraph, a machine for drawing the antiderivative of a function. He published a description of this instrument in the\nPhilosophical Magazine\nin\n1881\n. After graduating in mining it was natural for Boys to seek employment at a colliery, which he did. After a short time in this employment, Guthrie offered him employment as a demonstrator in physics. He accepted this post and began his academic career.\nIt was his invention of a fused quartz fibre suspension that brought him great fame, and his applications of quartz fibres are described in\n[\n3\n]\nin the following way:-\nOne application he made of\n[\nquartz fibres\n]\nwas to the suspension of the moving system of his radiomicrometer for the measurement of radiant heat, an instrument so sensitive that, aided by a reflecting telescope to bring the heat to a focus, it could detect the differences in radiation from different parts of the moon's disc and would respond to the heat of a candle at a distance of more than a mile ... He also made use of quartz fibres in his repetition of Cavendish's famous experiment for the determination of the gravitational constant.\nIt was by using a quartz fibre suspension in Cavendish type experiments that Boys was able to improve the value obtained for the gravitational constant. He used quartz fibres to suspend a short\n(\nless than one inch long\n)\nbeam with spheres at each end. He was then able to use attracting masses much larger in proportion than Cavendish had been able to use, thus enabling him to make accurate measurements of the small forces involved. His work on gravitation is certainly his most important contribution and shows the precision which he could achieve in his experiments. However there were many problems which he had to overcome, such as the vibrations in the earth caused by traffic. To avoid these problems he conducted his experiments in Oxford, rather than London, but he still had to make his measurements at times when no shunting was going on in the railway yards more than a mile from his laboratory. His remarkably accurate results were published in the\nPhilosophical Transactions of the Royal Society\nin\n1895\n.\nFurther contributions which Boys made to other areas are also described in\n[\n3\n]\n:-\nAnother subject to which he devoted a great deal of attention was the photography of lightning flashes and of rapidly moving objects, such as bullets, and soap films provided him with a study in which his powers of delicate manipulation found full scope, his book on \"Soap bubbles, their colours, and the forces which mould them\" being a classic in its way.\nIn\n1888\nBoys was elected a Fellow of the\nRoyal Society\n. The following year he became assistant professor at the Royal College of Science, South Kensington, a post he held until\n1897\n. While holding this post he supplemented his income examining for the University of London. He married Marion Amelia Pollock in\n1892\n, and we comment below about how this marriage ended in divorce. They had one daughter and one son.\nIn\n1887\nBoys took up an applied science post of Metropolitan Gas Referee and he held this post until the Referees were abolished in\n1939\n. Even then, his services were retained in an advisory capacity until\n1943\n. It was in this role that he worked for many years to improve the instruments used to measure the calorific value of gas. This enabled gas to be priced in terms of its calorific value rather than in terms of its volume.\nHis\n(\nalleged\n)\nill-treatment of his wife led to her having an affair with\nForsyth\nand a scandal at Cambridge resulted. Boys divorced his wife in\n1910\nafter\n18\nyears of marriage. From\n1913\nonwards he lived in rooms in Westminster, going every weekend to the country where he had a workshop.\nAfter\n1939\nhe retired permanently to his country house where he became interested in growing weeds. He published\nWeeds, weeds, weeds\nin\n1937\n.\nBoys received many honours in addition to election to the fellowship of the\nRoyal Society\nwhich we mentioned above. He received the Royal Medal from the\nRoyal Society\nin\n1896\nand from the same Society he received its Rumford Medal in\n1924\n. He was also awarded the Duddell Medal of the Physical Society in\n1925\n, and the Elliot Cresson Medal of the Franklin Institute of Philadelphia in\n1939\n. He was elected to the\nNew York Academy of Sciences\nand the Physical Society of Moscow. He was knighted in\n1935\n.\nOther honours included election to the presidency of the Röntgen Society in\n1906\n-\n07\n, of the Mathematics and Physics Section of the\nBritish Association\nin\n1903\n, and of the Physical Society in\n1916\n-\n17\n. The University of Edinburgh awarded Boys an honorary degree in\n1932\n.",
  "matematicos_citados_na_biografia": [
    "Todhunter",
    "Royal Society",
    "Forsyth",
    "New York Academy of Sciences",
    "British Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}