{
  "nome_completo": "Charles Jasper Joly",
  "nome_curto": "Charles Joly",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Joly/",
  "data_nascimento": "27 June 1864",
  "local_nascimento": "Tullamore, County Offaly, Ireland",
  "data_morte": "4 January 1906",
  "local_morte": "Dunsink, Dublin, Ireland",
  "summary": "Charles Joly was an Irish mathematician who did outstanding work on the quaternions. He became Andrews Professor of Astronomy in the University of Dublin and Royal Astronomer of Ireland at Dunsink Observatory.",
  "biografia": "Charles Jasper Joly\nwas the son of the Rev John Swift Joly\n(1818\n-\n1887)\n[\n7\n]\n:-\n... a man of studious bent and author of archaeological studies of local interest ...\nand Elizabeth Slator\n(1835\n-\n1904)\n. John Swift Joly was rector of St Catherine's Church of Ireland, Tullamore and he came from a family who had emigrated from the Austrian Netherlands in the middle of the eighteenth century. His great-grandfather was Jean Jasper Joly\n(1740\n-\n1823)\nwho came to Dublin from France in\n1769\n. He was\n[\n3\n]\n:-\n... financial secretary to the duke of Leinster ... later appointed keeper of the house of lords in Ireland, and owned several houses on Harcourt Street.\nJean Jasper Joly's son, Charles Joly, was the father of John Swift Joly who had married Elizabeth Slator, the daughter of Rev Nathaniel Robert Slator and Frances Alicia Berry, at St Mary's Church, Athlone, Ireland on\n12\nAugust\n1863\n. Let us note at this point that there is some confusion in the literature between Charles Jasper Joly, the subject of this biography, and John Joly\n(1857\n-\n1933)\nwho became a leading physicist. Charles Jasper Joly and the physicist John Joly were related since John Joly's grandfather Henry Edward Joly\n(1784\n-\n1852)\nwas the brother of Jean Jasper Joly's son, Charles Joly. In fact John Joly is the author of\n[\n7\n]\nfrom which we have already quoted.\nReturning to the Rev John Swift Joly and his wife Elizabeth, they had five children: Charles Jasper Joly\n(1864\n-\n1906)\n, the subject of this biography; Henry Nathaniel Joly\n(1866\n-\n1954)\n; Frances Isabel Joly\n(1868\n-\n1947)\n; Isabel Emily Joly\n(1871\n-\n1921)\n; and John Swift Joly\n(1876\n-\n1943)\n. Henry Nathaniel Joly followed his father in joining the church while John Swift Joly Jr became a leading surgeon. Let us note here that Frances Isabel Joly married Henry Joly, the brother of the physicist John Joly.\nWhen Charles Jasper Joly as still a baby, the family moved from Tullamore to Athlone were his father became the rector of the parish. He attended school in Portarlington for a short time, then spent four years attending the Grammar School in Galway. This Protestant school, established by the Erasmus Smith Trust in\n1669\n, was, when Joly  was a pupil, situated in College Street. The master was Robert Biggs, who had been appointed in\n1875\n, and there were around\n30\nboarders and\n40\nday pupils. Joly gained a reputation as a fine mathematician, being awarded numerous prizes and medals, and won a scholarship to Trinity College Dublin which he entered in\n1882\n. His performance as an undergraduate was good but not outstanding\n[\n7\n]\n:-\n... as a student in Trinity College there was nothing accomplished by Joly that has not been accomplished by many a man who subsequently remained without further distinctions through life. He took a mathematical scholarship - by no means on specially brilliant marks - and finally won a mathematical studentship, but, again, without the distinction of the \"Large\" gold medal. His second subject at this examination was Experimental Science.\nDespite this slightly uninspiring undergraduate career, nevertheless Joly graduated in\n1886\nas the top mathematician of his year. At this stage, however, he decided not to pursue a career in mathematics but rather to specialise in experimental physics. Accordingly, after graduating he went to Berlin where he worked in\nHermann von Helmholtz\n's laboratory with Arthur König\n(1856\n-\n1901)\n. König was studying optics, in particular vision and its defects, and this was the path that Joly would probably have followed but for the death of his father on\n3\nDecember\n1887\n. This required him to return to Ireland where he lacked the laboratory facilities to continue with his experimental studies, so he began to concentrate on mathematics with the aim of gaining a Trinity College Fellowship. John Joly writes\n[\n7\n]\n:-.\nThe possibility of attaining to the Fellowship of his own College induced him to pursue the mathematical and mathematical-physics courses required for the mathematical side of this test. The severity of this competition is intensified by the extraordinary arrangement permitting candidates in mathematics and classics to compete against each other; the successful candidate being the winner of highest marks, where subjects, papers, examiners are different. For this ordeal it is not uncommon for men to read for five or seven years; not, perhaps, acquiring fresh wisdom after the first two or three years' reading, though gradually becoming more proficient in the art of scoring.\nYear after year Joly fell short of success. Year after year he read Dante and other masters of literature, and, led away by the facile charms of literary studies, he plunged, forgetful of everything else, into the real or unreal world of poetry and romance. It was at this period that my own more intimate friendship with him commenced. Besides the tie of relationship, we had many tastes in common. In the course of our endless discussions and speculations there was revealed to me a mind both keen, critical, and honest; a nature undemonstrative, sincere, and deeply affectionate. It was not till\n1894\nthat Joly was successful in his efforts to gain Fellowship.\nThe somewhat peculiar way that the Fellowship competition was organised meant that publishing original work was of no great help so it was not until he obtained the Fellowship that Joly began publishing mathematical papers relating to the quaternions. His first paper\nThe theory of vector functions\nwas read at the meeting of the\nRoyal Irish Academy\non\n10\nDecember\n1894\n. He was elected a member of the\nRoyal Irish Academy\nat the next meeting of the Academy on\n14\nJanuary\n1895\n. His next paper\nScalar invariants of two linear vector functions\nwas read at the meeting of the\nRoyal Irish Academy\non\n9\nDecember\n1895\nand, in\n1896\n, four of his papers were published by the\nRoyal Irish Academy\n, namely\nQuaternion invariants of linear vector functions and quaternion determinants\n;\nVector Expressions for Curves\n;\nProperties of the General Congruency of Curves\n; and\nOn the Homographic Divisions of Planes, Spheres, and Space, and on the Systems of Lines Joining Corresponding Points\n.\nAs a fellow, he tutored at Trinity College, and in\n1896\nhe was appointed junior proctor. On\n20\nMarch\n1897\n, Joly married Jessie Sophie Meade\n(1874\n-\n1945)\nin Dublin. Jessie, the youngest daughter of the solicitor Robert Warren Meade and Jessie Sophia Lyster Jameson, had been born in Dublin on\n16\nDecember\n1874\n. Charles and Jessie Joly had three daughters: Jessie Elizabeth Joly\n(1898\n-\n1987)\n; Lucy Mary Joly\n(1899\n-\n1966)\n; and Frances Isabel Joly\n(1905\n-\n1982)\n. Also in\n1897\nJoly was appointed as Andrews Professor of Astronomy in the University of Dublin and Royal Astronomer of Ireland at Dunsink Observatory. For someone passionately undertaking research on quaternions, what could have been a better appointment for Joly than to follow the inventor of quaternions into his residence at the old House at Dunsink Observatory\n[\n7\n]\n:-\nThe old House commands from the south windows an extensive view. The panorama of the Dublin Hills - the rounded granite hills of Leinster - rising one beyond the other, invite the imagination into the furthest distance. Between lies a broad and noble valley containing in the near distance the lawns and woods of Phoenix Park, and to the east the City of Dublin. The pastoral element predominates, however, and, seen from this view-point, Dublin might appear to be a city girt with peaceful lawns and forest trees. Further yet, beyond the \"towers, domes, citadels,\" the Bay of Dublin stretches to the horizon. A more varied sweep of mountains, forest, city and sea it would be hard to find. From the south window of the study an observer lifting his eyes can, at a glance, review it all. Around the house is the fruit garden and shrubbery, planted by\nJohn Brinkley\nand\nRobert Ball\n, and the old-fashioned box-trimmed flower garden merging into the orchard. Tall trees line the shady walk leading to the gate in the wall where suddenly is revealed to you, across steeply sloping fields, the same majestic panorama of mountains and woods seen from the study window.\nIn\n1898\nhe was elected a fellow of the\nRoyal Astronomical Society\nand in\n1900\ntook part in the eclipse expedition to Spain organised by the Royal Dublin Society and the\nRoyal Irish Academy\n. Joly described in his report\n[\n9\n]\nthe difficulties encountered, probably as a result of the Boer War:-\nIn the summer of the year\n1899\n, Sir Howard Grubb proposed that a Joint Committee should be appointed by the Councils of the Royal Dublin Society and the\nRoyal Irish Academy\nto consider the feasibility of fitting out an expedition to observe the Total Solar Eclipse of\n1900\n, May\n28\nth. As many members of the Societies signified their intention of witnessing the eclipse, it seemed probable that the number of those joining the expedition would be sufficiently large to justify the chartering of a steamer, and it was believed that the greater part of the cost of the instrumental equipment might be defrayed by fixing the prices of the berths slightly in excess of the contract charge.\nThe Committee was duly elected, and\n130\nprovisional applications for berths were received; but when it became necessary to ask for definite  promises, only thirteen members ratified their applications. The Committee attributed this extraordinary falling off in numbers to the unsettling effect of the war in South Africa. The project of chartering a steamer had consequently to be abandoned, but the Committee recommended that observations of the eclipse should be undertaken, and that the Societies should provide the necessary instruments. Accordingly the Societies placed at the disposal of the Committee a sum of money sufficient to procure certain of the instruments employed in the observations descried in this Report, and to cover the cost of freightage.\nTheir successful observations were made from just below the summit of the hill of Berrocalillo within walking distance of the town of Plasencia in western Spain.\nOnce established in Dunsink Observatory, Joly began publishing on both astronomy and on mathematics related to quaternions. For example in\n1898\nhe published four mathematics papers, two of which are\nAstatics and quaternion functions\nand\nThe associative algebra applicable to hyperspace\n. He had been working hard on editing a new edition of\nHamilton\n's\nElements of Quaternions\nand, in\n1899\n, the first of the two volumes was published. For information see\nTHIS LINK\n.\nIn\n1900\nmost of his publications were on astronomy; for example\nCatalogue of the mean places of\n321\nstars deduced from observations made with the meridian circle at Dunsink\n(1898\n-\n1899)\n,\nTable of instrumental errors\n, and others works in the publication\nAstronomical observations and researches made at Dunsink, the observatory of Trinity College\n.\nIn\n1902\nhe published eight papers on mathematics, all related to work with quaternions, while he continued working on editing the second volume of his new edition of\nHamilton\n's\nElements of Quaternions.\nFor more information about this volume, see\nTHIS LINK\n.\nAlexander Macfarlane\nwas a Scottish mathematician who spent most of his career in the United States and in Canada. He had been taught by\nP G Tait\nand had a life-long interest in quaternions. In\n1900\nthe International Congress of Mathematicians was held in Paris in August and\nMacfarlane\ntravelled from Canada to Paris, stopping in Dublin for a few days to visit Joly. He writes\n[\n11\n]\n:-\nBy the middle of\n1900\n, having finished his editorial work on the \"Elements,\" he resolved to transfer his principal scientific attention from the quaternion analysis to astronomy; I found him in this frame of mind when I visited Dublin on my way to the second International Congress of Mathematicians. I had the pleasure of spending three days as his guest at the observatory. A charming wife, two little daughters and a sister-in-law graced his home. On his work-table were photographs of the totality which he had secured as a member of the Eclipse Expedition sent out to Spain by the Dublin Scientific Societies; proof-sheets of the last pages of the second volume of the \"Elements\"; and preparations were being made to spend the vacation in Switzerland. Alpine climbing was one of his recreations; so proficient was he therein as to become a member of the Alpine Club.\nAt the dining-table much of our talk was about the two quaternion giants,\nHamilton\nand\nTait\n. About\nHamilton\n's habits and peculiarities Joly had a great stock of information. That same dining-room was\nHamilton\n's study; he worked in it like a recluse during the later years of his life while writing the \"Elements\"; at his death the floor was found covered knee-deep with manuscripts arranged in beds with convenient walks between; when the mass was wheeled out many kitchen plates were found along with the remains of chops and steaks. The explanation was that\nHamilton\nrarely left the room for his meals; something was brought in to him, which as likely as not was never noticed. On the other hand Joly was anxious to hear about\nTait\n, whom he had never met; and this I was able to supply, having been a pupil of that great teacher. He was the more interested in the matter as the\nRoyal Irish Academy\nhad just elected\nTait\nto honorary fellowship. Another place of interest was the observatory garden. It is enclosed by a stone wall, and divided by shaded walks, one of which\nHamilton\nnamed Wordsworth's walk. The poet Wordsworth had made it a favourite haunt when on a visit to\nHamilton\n; their common interest lay in philosophy and poetry. One day Professor Joly took me to see the Quaternion bridge. We retraced the course which Hamilton walked on the memorable\n16\nth day of October,\n1843\n, starting from the observatory house, descending the Dunsink hill, following the path by the side of the Royal Canal, and finally arriving at the second bridge over the canal. The path goes under the arch, and\nHamilton\nhad merely to take a step or two to the side to find the stone surface on which he first inscribed the formula\ni\n2\n=\nj\n2\n=\nk\n2\n=\ni\nj\nk\n=\n−\n1\ni^{2} = j^{2} = k^{2} = ijk = - 1\ni\n2\n=\nj\n2\n=\nk\n2\n=\ni\nj\nk\n=\n−\n1\n. Of course the inscription has long since mouldered away.\nLater in the day we visited Trinity College, where I had the honour of dining with my friend at the high table. Dinner over, we sought the library, but found it closed. I had not the pleasure of seeing the hall in which\nHamilton\n, when only thirty years of age was knighted by the lord lieutenant on the occasion of the first meeting of the\nBritish Association\nin Dublin. So we strolled through the ground, and while viewing the antiquities of the college of Queen Elizabeth we had a lively discussion over the principles of quaternions.\nIn\n1903\nJoly published the paper\nQuaternions and Projective Geometry\nwhich, being over\n100\npages in length, could easily have been a book. The Abstract begins:-\nThe object of this paper is to include projective geometry within the scope of quaternions. The calculus, as established by\nHamilton\n, was solely adapted to the treatment of metrical relations, but when we regard a quaternion as representing a weighted point, projective properties can be investigated with great facility.\nAn extract from a review of this work is at\nTHIS LINK\n.\nJoly was elected a Fellow of the\nRoyal Society\nin\n1904\n, then in the following year, he published his book\nA Manual of Quaternions\n. The timing was not a coincidence, for\n1905\nwas the centenary of\nHamilton\n's birth\n[\n7\n]\n:-\nThe work was written in a marvellously short space of time - about a twelvemonth. He however, wrote mathematics, worked out examples, and pursued his reasoning with the facility and ease with which a ready writer of fiction might develop the events of a novel. This, about his last great work, was received with commendation on every side; a reception all the more flattering as those who were admirers of\nTait\n's treatment of the subject had to adapt themselves to a somewhat different mode of development before they could appreciate the new writer's work. Indeed, the Hamiltonian method of establishing the laws of Quaternions is here in part abandoned. In this work the author makes use of a wonderfully extensive knowledge of the mathematics of every branch of Physical Science.\nThe Preface of this work can be read at\nTHIS LINK\n.\nThere was a brief mention of Joly's love of climbing above but we give a further quote about this taken from Patricia Byrne's article\n[\n3\n]\n:-\nOutside his work he had an extensive knowledge of literature, especially Italian, and climbing was a passion. A keen member of the British Alpine Club, he spent his holidays in the Alps, scaling the most difficult peaks. He was especially fond of rock climbing. Despite a delicate appearance he possessed endurance, courage, and a keen sense of humour, once leading a group successfully down from the Eiger in a snowstorm.\nIn\n1905\nhe was at the height of his powers and he attended the seventy-fifth meeting of the\nBritish Association for the Advancement of Science\nheld in South Africa in August-September of that year. The meetings for different sections of the Association were held in Cape Town and Johannesburg. Shortly after he returned to Dublin from South Africa, his daughter Jessie Elizabeth Joly contracted typhoid. The\nIrish Times\nof\n6\nNovember\n1905\nrecords:-\nDublin has earned an unenviable notoriety for typhoid fever, and many typhoid fever epidemics have been traced to the use of contaminated milk.\nSoon Joly too became ill with the disease. He wrote to a friend\n(\nsee\n[\n7\n]\n)\n:-\nIf the attack is as severe as Jessie's, I know quite well I cannot hold out. For myself I am content, though I should have given much to save the pain that others may feel. I confess also that I should like to be allowed to finish my life's work. Many unsolved problems might have some light thrown upon them if I had a little more time. I might have a useful influence in the affairs of College. I feel it would be a pity ...\nHe died on\n4\nJanuary\n1906\nand was buried at Mount Jerome Cemetery in Dublin.",
  "matematicos_citados_na_biografia": [
    "Hermann von Helmholtz",
    "Royal Irish Academy",
    "John Brinkley",
    "Robert Ball",
    "Royal Astronomical Society",
    "Hamilton",
    "THIS LINK",
    "Alexander Macfarlane",
    "P G Tait",
    "Macfarlane",
    "Tait",
    "British Association",
    "Royal Society",
    "British Association for the Advancement of Science"
  ],
  "imagens": [
    "joly.jpg"
  ]
}