{
  "nome_completo": "Charles Hermite",
  "nome_curto": "Charles Hermite",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hermite/",
  "data_nascimento": "24 December 1822",
  "local_nascimento": "Dieuze, Lorraine, France",
  "data_morte": "14 January 1901",
  "local_morte": "Paris, France",
  "summary": "Charles Hermite 's work in the theory of functions includes the application of elliptic functions to the quintic equation. He published the first proof that e is a transcendental number.",
  "biografia": "Charles Hermite\n's father was Ferdinand Hermite and his mother was Madeleine Lallemand. Ferdinand Hermite was a trained engineer and he worked in this capacity in a salt mine near Dieuse. After he married Madeleine he joined in the draper's trade in which her family were involved. However he was an artistic man who always wanted to pursue art as a career. He had his wife look after the draper's business and he took up art. Charles was the sixth of his parents seven children and when he was about seven years old his parents left Dieuse and went to live in Nancy to where the business had moved.\nEducation was not a high priority for Charles's parents but despite not taking too much personal interest in their children's education, nevertheless they did provide them with good schooling. Charles was something of a worry to his parents for he had a defect in his right foot which meant that he moved around only with difficulty. It was clear that this would present him with problems in finding a career. However he had a happy disposition and bore his disability with a cheerful smile.\nCharles attended the Collège de Nancy, then went to Paris where he attended the Collège Henri. In\n1840\n-\n41\nhe studied at the Collège Louis-le-Grand where some fifteen years earlier\nGalois\nhad studied. In fact he was taught mathematics there by\nLouis Richard\nwho had taught\nGalois\n. In some ways Hermite was similar to\nGalois\nfor he preferred to read papers by\nEuler\n,\nGauss\nand\nLagrange\nrather than work for his formal examinations.\nIf Hermite neglected the studies that he should have concentrated on, he was showing remarkable research ability publishing two papers while at Louis-le-Grand. Also like\nGalois\nhe was attracted by the problem of solving algebraic equations and one of the two papers attempted to show that the\nquintic\ncannot be solved in radicals. That he was unfamiliar with\nGalois\n's contributions, despite being at the same school, is not at all surprising since the mathematical community were completely unaware of them at this time. However he might reasonably have known of the contributions of\nRuffini\nand\nAbel\nto this question, but apparently he did not.\nAgain like\nGalois\n, Hermite wanted to study at the École Polytechnique and he took a year preparing for the examinations. He was tutored by\nCatalan\nin\n1841\n-\n42\nand certainly Hermite fared better than\nGalois\nhad done for he passed. However it was not a glorious pass for he only attained sixty-eighth place in the ordered list. After one year at the École Polytechnique Hermite was refused the right to continue his studies because of his disability. Clearly this was an unfair decision and some important people were prepared to take up his case and fight for him to have the right to continue as a student at the École Polytechnique. The decision was reversed so that he could continue his studies but strict conditions were imposed. Hermite did not find these conditions acceptable and decided that he would not graduate from the École Polytechnique.\nHermite made friends with important mathematicians at this time and frequently visited Joseph\nBertrand\n. On a personal note this was highly significant for he would marry Joseph\nBertrand\n's sister. More significantly from a mathematical point of view he began corresponding with\nJacobi\nand, despite not shining in his formal education, he was already producing research which was ranking as a leading world-class mathematician. The letters he exchanged with\nJacobi\nshow that Hermite had discovered some\ndifferential equations\nsatisfied by theta-functions and he was using\nFourier series\nto study them. He had found general solutions to the equations in terms of theta-functions. Hermite may have still been an undergraduate but it is likely that his ideas from around\n1843\nhelped\nLiouville\nto his important\n1844\nresults which include the result now known as\nLiouville\n's theorem.\nAfter spending five years working towards his degree he took and passed the examinations for the baccalauréat and licence which he was awarded in\n1847\n. In the following year he was appointed to the École Polytechnique, the institution which had tried to prevent him continuing his studies some four years earlier; he was appointed répétiteur and admissions examiner.\nHermite made important contributions to\nnumber theory\nand algebra, orthogonal polynomials, and\nelliptic functions\n. He discovered his most significant mathematical results over the ten years following his appointment to the École Polytechnique. In\n1848\nhe proved that doubly periodic functions can be represented as quotients of periodic\nentire functions\n. In\n1849\nHermite submitted a memoir to the\nAcadémie des Sciences\nwhich applied\nCauchy\n's residue techniques to doubly periodic functions.\nSturm\nand\nCauchy\ngave a good report on this memoir in\n1851\nbut a priority dispute with\nLiouville\nseems to have prevented its publication.\nAnother topic on which Hermite worked and made important contributions was the theory of\nquadratic forms\n. This led him to study\ninvariant theory\nand he found a reciprocity law relating to binary forms. With his understanding of quadratic forms and invariant theory he created a theory of transformations in\n1855\n. His results on this topic provided connections between number theory, theta functions, and the transformations of\nabelian functions\n.\nOn\n14\nJuly\n1856\nHermite was elected to the\nAcadémie des Sciences\n. However, despite this achievement,\n1856\nwas a bad year for Hermite for he contracted smallpox. It was\nCauchy\nwho, with his strong religious conviction, helped Hermite through the crisis. This had a profound effect on Hermite who, under\nCauchy\n's influence, turned to the Roman Catholic religion.\nCauchy\nwas also a very staunch royalist and Hermite was influenced by him to also become a royalist. We made comparisons with\nGalois\nearlier on in this article, but with royalist views, Hermite was now completely opposed to the views which the staunch republican\nGalois\nhad held.\nThe next mathematical result by Hermite which we must mention is one for which he is rightly famous. Although an algebraic equation of the fifth degree cannot be\nsolved in radicals\n, a result which was proved by\nRuffini\nand\nAbel\n, Hermite showed in\n1858\nthat an algebraic equation of the fifth degree could be solved using elliptic functions. He applied these results to number theory, in particular to class number relations of quadratic forms.\nIn\n1862\nHermite was appointed maître de conférence at the École Polytechnique, a position which had been specially created for him. In the following year he became an examiner there. The year\n1869\nsaw him become a professor when he succeeded\nDuhamel\nas professor of analysis both at the École Polytechnique and at the Sorbonne. Hermite resigned his chair at the École Polytechnique in\n1876\nbut continued to hold the chair at the Sorbonne until he retired in\n1897\n. In the\n1890\ns Hermite became much less interested in the new results found by the mathematicians of the next generation.\nThe\n1870\ns saw Hermite return to problems which had interested him earlier in his career such as problems concerning approximation and interpolation. In\n1873\nHermite published the first proof that\ne\ne\ne\nis a\ntranscendental\nnumber. This is another result for which he is rightly famous. Using method's similar to those of Hermite,\nLindemann\nestablished in\n1882\nthat π was also transcendental. Many historians of science regret that Hermite, despite doing most of the hard work, failed to use it to prove the result on which would have brought him fame outside the world of mathematics. Hermite is now best known for a number of mathematical entities that bear his name: Hermite polynomials, Hermite's differential equation, Hermite's formula of interpolation and Hermitian\nmatrices\n.\nFor Hermite certain areas of mathematics were much more interesting than other areas.\nHadamard\n, who unlike his teacher Hermite worked in all areas of mathematics, spoke of Hermite's dislike for geometry:-\n[\nHermite\n]\nhad a kind of positive hatred of geometry and once curiously reproached me with having made a geometrical memoir.\nHermite's great love was for analysis and, not surprisingly, he had a great respect for\nWeierstrass\n. When\nMittag-Leffler\narrived in Paris to study with him, Hermite greeted him warmly but said:-\nYou have made a mistake, sir, you should follow\nWeierstrass\n's course in Berlin. He is the master of us all.\nPoincaré\nis almost certainly the best known of Hermite's students. He once suggested that Hermite's mind did not proceed in logical fashion. He wrote:-\nBut to call Hermite a logician! Nothing can appear to me more contrary to the truth. Methods always seemed to be born in his mind in some mysterious way.\nHadamard\nlike Poincaré was very interested in the way that mathematics was discovered. He also had this to say about the way that Hermite made his discoveries:-\nHermite used to observe\n[\nthat biology\n]\nmay be a most useful study even for mathematicians, as hidden and eventually fruitful analogies may appear between processes in both kinds of studies.\nHadamard\nhad great respect for Hermite as a teacher. He said:-\nI do not think that those who never listened to him can realise how magnificent Hermite's teaching was, overflowing with enthusiasm for science, which seemed to come to life in his voice and whose beauty he never failed to communicate to us, since he felt it so much himself to the very depth of his being.\n[\nHermite\n]\nwas making a deep impression on us, not only with his methods and those of\nWeierstrass\n, but also with his enthusiasm and love of science; in our brief but fruitful conversations, Hermite loved to direct to me remarks such as: \"He who strays from the paths traced by providence crashes.\" These were the words of a profoundly religious man, but an atheist like me understood them very well, especially when he added at other times: \"In mathematics, our role is more of servant than of master.\" It goes without saying that gradually, as years and my scientific work unfolded, I came to understand more and more deeply the aptness and scope of his words.\nCross, reviewing\n[\n10\n]\nwhere\n125\nletters from Hermite to\nMittag-Leffler\nare reproduced, writes:-\nSo there stands revealed one of the most engaging and influential men in Parisian and French mathematics in the second half of the\n19\nth\ncentury, one might even say the central character for the period in which he published,\n1842\n-\n1901\n. What radiates from the text is\n[\nHermite's\n]\nhumility, his Catholicism, his concern for his\n(\nvery extended\n)\nfamily, his willingness to fight for colleagues whose merit he discerns, and his devotion to family, merit, and principle rather than simple influence.\nIn terms of his family life Hermite had married Louise Bertrand,\nJoseph Bertrand\n's sister. One of their two daughters married\nÉmile Picard\n.\nStruik\nwrites:-\nHermite lived a retired life, with his family. His working hours were devoted to mathematical research and teaching. His outlook on mathematics was realistic in the Platonic sense: a mathematician, like a naturalist, discovers an outside world, in his case a world of ideas. Hermite, therefore, disliked\nCantor\n's world, in which a new mathematical world was created.",
  "matematicos_citados_na_biografia": [
    "Galois",
    "Louis Richard",
    "Euler",
    "Gauss",
    "Lagrange",
    "quintic",
    "Ruffini",
    "Abel",
    "Catalan",
    "Bertrand",
    "Jacobi",
    "differential equations",
    "Fourier series",
    "Liouville",
    "number theory",
    "elliptic functions",
    "entire functions",
    "Académie des Sciences",
    "Cauchy",
    "Sturm",
    "quadratic forms",
    "invariant theory",
    "abelian functions",
    "solved in radicals",
    "Duhamel",
    "transcendental",
    "Lindemann",
    "matrices",
    "Hadamard",
    "Weierstrass",
    "Mittag-Leffler",
    "Poincaré",
    "Joseph Bertrand",
    "Émile Picard",
    "Struik",
    "Cantor"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}