{
  "nome_completo": "Christian Gustav Adolph Mayer",
  "nome_curto": "Christian Adolph Mayer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mayer_Adolph/",
  "data_nascimento": "15 February 1839",
  "local_nascimento": "Leipzig, Germany",
  "data_morte": "11 April 1908",
  "local_morte": "Gries bei Bozen, Austria (now Bolzano, Italy)",
  "summary": "Christian Adolph Mayer was a German mathematician who worked on differential equations, the calculus of variations and mechanics.",
  "biografia": "Christian Mayer\n's father, also called Christian Adolph Mayer\n(1802\n-\n1875)\n, was a merchant, banker and financial advisor from Leipzig with a prosperous business so that the family were well off. In fact the Mayer family had lived in Leipzig for several generations having emigrated from St Gallen in the seventeenth century. Christian Adolph Mayer was a family name given to the eldest son of each generation, so Adolph Mayer's paternal grandfather was also named Christian Adolph Mayer\n(1775\n-\n1843)\nand was also a banker in Leipzig. Christian Mayer's mother was Agnes Frege\n(1809\n-\n45)\n, the daughter of Christian Gottlob Frege\n(1780\n-\n1821)\n, a banker and financial advisor, and Johanna Henriette Rode. Mayer studied at the Thomas\nGymnasium\nin Leipzig, completing his studies in the autumn of\n1857\n. He then began his university education but, breaking with family tradition of becoming a banker, he chose to study mathematics and natural sciences\n(\nparticularly chemistry and mineralogy\n)\nrather than commercial studies. As was the custom of German students at this time, he studied at a number of different universities during his education. He spent his first two semesters at the Ruprecht-Karls University of Heidelberg, then he studied under Moritz Abraham Stern\n(1807\n-\n1894)\nat Göttingen for a year beginning in autumn\n1858\n. In fact Stern had just been appointed as a full professor at Göttingen, succeeding Gauss. After the year, Mayer returned to the University of Heidelberg where he was fascinated by the lectures of Otto Hesse, and, after spending one semester at Leipzig, he completed his doctorate at Heidelberg with the degree being awarded on\n14\nDecember\n1861\n.\nFollowing the award of his doctorate, Mayer went to Königsberg in\n1862\nwhere he worked under Friedrich Julius Richelot\n(1808\n-\n1875)\n, a student of Jacobi, and Franz Neumann who was a student of Richelot. Königsberg was a leading research centre at this time, still benefitting from Jacobi's influence, with Richelot being an outstanding scholar who was known to deliver difficult and sometimes obscure lectures. It was Richelot who advised Mayer to undertake research on the\ncalculus of variation\n, and he followed this advice working on this topic for the rest of his life. Another student at Königsberg, also working on his\nhabilitation\nthesis, was Heinrich Weber; he and Mayer became close friends. Another student at Königsberg at this time, but at an earlier stage in his career since he was studying for his doctorate with Franz Neumann, was Albert Wangerin. Mayer remained at Königsberg until\n1865\n, then he returned to his home town of Leipzig and submitted his habilitation thesis\nBeiträge zur Theorie der Maxima und Minima einfacher Integrale\nⓉ\n(\nContributions to the theory of maxima and minima of simple integrals\n)\nto that university and gained the right to teach at universities in December\n1866\n. He began teaching at Leipzig University in\n1867\ngiving two courses in that year, Analytic Mechanics and the Calculus of variations, as well as teaching a Mathematical Exercises class. In the following years he taught Differential and Integral Calculus, Theory of Definite Integrals, Some chapters from mechanics and the calculus of variations, Higher Algebra,\nDifferential Equation\nof Mechanics and the Calculus of Variations, Analytic Geometry, and many more courses of a similar type. In fact his teaching was considered to be of the very highest quality\n[\n5\n]\n:-\nThose who heard his lectures will remember them as eloquent, with ever word and every thought in its place; there was no word that could be safely lost. ... In the Mathematical Exercises, to which he devoted much time and energy, Mayer took great care that the tasks he set were actually solved using established or derived principles and not with ad hoc tricks which achieved the goal in a roundabout way.\nHe taught at Leipzig for the rest of his life, as a\nprivatdozent\nfrom\n1867\nto\n1871\n, becoming an extraordinary professor of mathematics in\n1871\n. He married Margerete Weigel in the following year. Margerete was the daughter of Oswald Weigel a publisher in Leipzig, and Pauline Therese Hildegard Felix. Adolph and Margerete Mayer had four children, the eldest boy being named Christian Adolph Mayer\n(1874\n-\n1946)\nin the family tradition and he also followed the family tradition by becoming a banker. Mayer was promoted to an honorary ordinary professorship in\n1881\nand a full ordinary professorship in\n1890\n. He was co-director of the Mathematics Seminar at Leipzig from\n1882\n. We should note that, while he was still a privatdozent, the Franco-Prussian war took place in\n1870\n. Mayer volunteered to serve his country and was a nurse for the duration of the conflict.\nWussing\nwrites in\n[\n1\n]\nthat:-\nAs a professor, Mayer enjoyed great respect from his colleagues and students. His activities as a researcher ... earned him membership in numerous learned societies ...\nMayer worked on differential equations, the calculus of variations and mechanics. The papers he wrote during his years as a privatdozent were:\nÜber die Kriterien des Maximums und Minimums einfacher Integrale\nⓉ\n(\nOn the criteria of maximum and minimum of simple integrals\n)\n(1868)\n,\nDer Satz der Variationsrechnung, welcher dem mechanischen Prinzips der kleinsten Wirkung entspricht\nⓉ\n(\nThe theorem of variational calculus, which corresponds to the mechanical principle of least action\n)\n(1870)\n,\nÜber die Jacobi-Hamiltonache Integrationsmethode der partiellen Differentialgleichungen erster Ordnung\nⓉ\n(\nOn the Jacobi Hamilton integration method of partial differential equations of the first order\n)\n(1871)\n,\nÜber die Integration simultaner partieller Differentialgleichungen der ersten Ordnung mit derselben unbekannten Funktion\nⓉ\n(\nThe integration of simultaneous partial differential equations of the first order with the same unknown function\n)\n(1871)\n, and\nUnbeschränkt integrable Systeme von linearen totalen Differentialgleichungen und die simultane Integration linearer partieller Differentialgleichungen\nⓉ\n(\nUnbounded integrable systems of linear total differential equations and the simultaneous integration of linear partial differential equations\n)\n(1871)\n. He emphasised the principle of least action in all his work which followed the path of Lagrange and Jacobi. His work on the integration of\npartial differential equation\nand a search to determine maxima and minima using variational methods brought him close to the investigations which Lie was carrying out around the same time. He is also considered a forerunner of the modern control theory.\nEngel received his doctorate from Leipzig in\n1883\nafter studying under Mayer and writing a thesis on contact transformations. Engel became a valuable assistant to Lie for several years but towards the end of the\n1880\ns the relationship between Engel and Lie broke down. In\n1892\nthe lifelong friendship between Lie and Klein broke down and the following year Lie publicly attacked Klein. Mayer was connected with the whole episode through his friendship with Klein, both being editors of Mathematische Annalen, and perhaps most significantly since his work was closely related to that of Lie. The book\n[\n2\n]\ncontains a collection of\n186\nletters exchanged between Klein and Mayer over the years from\n1871\nto\n1907\n. The letters provide insights into the scientific and personal relations among Klein, Mayer and Lie over the period.\nWussing\nwrites in\n[\n1\n]\nthat:-\n... through the subsequent works of Mayer, Lie's achievements became famous relatively quickly.\nMuch of the material in the letters between Mayer and\nKlein\ndiscuss their editorial work on the journal\nMathematische Annalen\n.\nMayer received many honours for his contributions. He was elected to the\nBerlin Academy of Sciences\nand to the\nLeopoldina Carolina German Academy\n. He was also elected a member of the\nGöttingen Academy of Sciences\nand the\nTurin Academy of Sciences\n. VonderMühll gives the following tribute to Mayer in\n[\n6\n]\n:-\nHe worked hard for his students encouraging them to undertake further research and also encouraged them to study abroad. He was a most faithful friend to his colleagues, he worked tirelessly to promote Leipzig University and for him no trouble or personal sacrifice was too great.\nMayer had a home in Leipzig where he entertained friends, colleagues and guests during the academic session. Each summer he would go to Abtnaundorf, about\n4\n.\n5\nkm from the city centre, where he had a comfortable cottage in the Old Park on an estate which had for generations belonged to his mother's side of the family. The walk from his summer cottage to the university took him around an hour but he always chose to make the journey on foot. For many years he was a very fit man, being a keen gymnast and swimmer in his younger days. As he grew older, his health was not so robust and he complained of hoarseness which he tried to cure by resting beside the lake. In the winter semester of session\n1907\n-\n08\nhe had to cancel his lecture course on the Calculus of Variations because of a stabbing pain in his chest, especially at night. It was probably pneumonia which was pulling him down and slowly exhausting his strength. He made a final effort to overcome his health problems, travelling with his wife and daughter to Bozen, then in Austria. There, in the mountain air, his health began to improve and he wrote some letters to his colleagues which were full of confidence that he would soon be fully fit again. Suddenly his health deteriorated rapidly and he died peacefully in Bozen. The tribute paid to him at his funeral, attended by academic colleagues, senior faculty of the university, family and many friends, spoke of him as a noble and pure person who never sought fame or glory.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "calculus of variation",
    "habilitation",
    "Differential Equation",
    "privatdozent",
    "Wussing",
    "partial differential equation",
    "Klein",
    "Berlin Academy of Sciences",
    "Leopoldina Carolina German Academy",
    "Göttingen Academy of Sciences",
    "Turin Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}