{
  "nome_completo": "Christian Heinrich von Nagel",
  "nome_curto": "Christian Heinrich von Nagel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nagel/",
  "data_nascimento": "28 February 1803",
  "local_nascimento": "Stuttgart, Germany",
  "data_morte": "27 October 1882",
  "local_morte": "Ulm, Germany",
  "summary": "Christian Heinrich von Nagel was a German geometer. The \"Nagel point\" of a triangle is named after him.",
  "biografia": "Christian Heinrich von Nagel\n's parents were Johann Heinrich Nagel, who was a tailor, and Christiane Friedrike Huntzinger. The family was poor and Johann Heinrich Nagel wanted his son to follow in his profession of tailor. However, two people helped Christian Heinrich to receive an education. First there was his maternal grandfather who was an educated man and gave the young boy his first lessons. Second there was August von Weckherlin\n(1794\n-\n1868)\n, an agronomist born in Stuttgart who was a good customer of Nagel's father. He persuaded the Nagel family to allow their son to study. For someone with no means of financial support there was little choice at this time in what one could study. The only route to an education was through the church and this is the route Christian Heinrich took.\nNagel attended classes at the\nGymnasium\nin Stuttgart and then after taking the county examinations in\n1817\nhe was accepted into the Evangelical Seminaries of Maulbronn and Blaubeuren in Baden-Württemburg. These two Protestant Gymnasiums had been founded in the middle of the\n16\nth\ncentury to provide a broad education to gifted pupils. They were boarding schools with the younger boys going to Maulbronn and then transferring to Blaubeuren. Nagel studied in these Gymnasiums for four years and, although the aim was an education based on theology, he also studied science and mathematics at Blaubeuren. He soon realised that he had a passion for mathematics.\nIn\n1821\nhe entered the Evangelical Monastery in Tübingen and began his studies of theology at the Eberhard-Karls University of Tübingen. However he also attended lectures on mathematics and physics at the university given by the astronomer Johann Gottlieb Friedrich von Bohnenberger\n(1765\n-\n1831)\n, who was the professor of mathematics and astronomy at the University of Tübingen, and Friedrich Joseph Pythagoras Riecke\n(1794\n-\n1876)\nwho was a lecturer in Tübingen until\n1823\nwhen he left to become Professor of Mathematics and Physics in Hohenheim. Nagel had hoped to study under Christoph Friedrich von Pfleiderer, professor of mathematics at Tübingen, but Pfleiderer died in September\n1821\njust when Nagel was starting his studies.\nNagel completed his studies in\n1825\nand, having qualified as a clergyman, entered the Church. His first church was in Kirchentellinsfurt, about\n7\nkm east of Tübingen and later he moved to the church in Hengen about\n30\nkm south east of Tübingen. While in Hengen he applied for a teaching position in Oldenburg but he was not successful. In December\n1826\nhe applied for a teaching position at the Lyceum in Tübingen. He was accepted and began teaching both there and at the Realschule in Tübingen in\n1827\n. He taught both mathematics and biology at these schools. Being in Tübingen, he took the opportunity to continue his study of mathematics at the university. Advised by Bohnenberger, he submitted his thesis\nDe triangulis rectangulis ex algebraica aequatione construendis\nⓉ\n(\nOn right-angled triangles, which can be constructed with the help of an algebraic equation\n)\nto the Faculty of Arts of the University of Tübingen in October\n1827\nand was appointed as a\nprivatdocent\n. At the University he lectured on Euclidean geometry and on mathematical and physical geography.\nWhen Nagel realised that his chances of becoming a professor at Tübingen were very slight, he decided to accept the offer of an appointment as Professor of Mathematics and Natural Science at the Gymnasium in Ulm. He took up this position on\n1\nNovember\n1830\nand at the same time he taught at the Realschule in Ulm. In September\n1844\nhe became Rector of the Real-Schule in Ulm and he continued to hold this position for\n25\nyears. He retired from teaching in\n1875\n. As to Nagel's approach to teaching mathematics we note that he writes in his book\nDie Idee Der Realschule, Nach Ihrer Theoretischen Begründung Und Praktischen Ausführung Dargestellt\nⓉ\n(\nThe idea of the real school, shown with theoretical and practical justification\n)\n(1840)\nthat an education in mathematics is necessary:-\n... to expose the ideas laid down in nature: the simple pure utterances of the deity.\nNagel published six mathematical articles, the most important of which is\nUntersuchungen über die Eigenschaften der wichtigsten mit dem Dreieck in Verbindung stehenden Kreise\nⓉ\n(\nStudies on the properties of the key associated with the triangular circles\n)\n(1835)\nand\nUntersuchungen über die wichtigsten zum Dreiecke gehörigen Kreise. Eine Abhandlung aus dem Gebiete der reinen Geometrie\nⓉ\n(\nStudies of the most important of the triangles associated with circles. A treatise in pure geometry\n)\n(1836)\n. In these papers he studied various points in a triangle which occur as the intersection of concurrent lines. He is most famous for one of these points of intersection that is today called the Nagel point.\nThis is constructed in a simple way. Take any triangle\nA\nB\nC\nABC\nA\nB\nC\nand let\ns\ns\ns\nbe its semiperimeter, this is half the sum of the lengths of the three sides. Starting at\nA\nA\nA\ngo a distance\ns\ns\ns\nround the triangle to a point on\nB\nC\nBC\nB\nC\nthat we will call\na\na\na\n. Similarly starting at\nB\nB\nB\ngo a distance\ns\ns\ns\nround the triangle to a point on\nA\nC\nAC\nA\nC\nthat we will call\nb\nb\nb\nand starting at\nC\nC\nC\ngo a distance\ns\ns\ns\nround the triangle to a point on\nA\nB\nAB\nA\nB\nthat we will call\nc\nc\nc\n. Then the lines\nA\na\n,\nB\nb\n,\nC\nc\nAa, Bb, Cc\nA\na\n,\nB\nb\n,\nC\nc\nare concurrent at\nN\nN\nN\n, the Nagel point.\nThere is another way to construct\na\n,\nb\na, b\na\n,\nb\nand\nc\nc\nc\nsince they are the points where the three excircles touch the triangle as shown in the diagram.\nParticularly interesting is Nagel's idiosyncratic, purely elementary geometrical method of proof. In his papers he proved the existence of the Nagel point and other points such at the\nGergonne\npoint and the Middle point. The Middle point\nM\nM\nM\nof a triangle is the point where the three lines, each formed by joining the centre of an excircle to the midpoint of the side of the triangle that it touches, concur. The\nGergonne\npoint\nG\nG\nG\nis the point where the three lines, each formed by joining the point the incircle touches a side to the opposite vertex, concur. Other interesting properties of the Nagel point is that it, the centroid and the incentre of a triangle are collinear.\nOther mathematical publications by Nagel include\nTheorie der periodischen Decimalbrüche nebst Tabellen zur leichteren Verwandlung gewöhnlicher Brüche in Decimalbrüche\nⓉ\n(\nThe theory of periodic decimal expansions along with tables to facilitate transformation of ordinary fractions in decimals\n)\n(1845)\n.\nNagel made other contributions to Ulm in addition to serving as a teacher and rector there. In particular he acted as an advisor to the city magistrates and it was Nagel who was instrumental in setting up gas lighting in Ulm. He was also responsible for setting up a technical training school to provide commercial training to pupils. Another of his achievements was founding a mathematical club in Ulm.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "privatdocent",
    "Gergonne"
  ],
  "imagens": [
    "thumbnail.jpg",
    "../../Diagrams/Nagel_point.gif"
  ]
}