{
  "nome_completo": "Clifford Ambrose Truesdell III",
  "nome_curto": "Clifford Ambrose Truesdell III",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Truesdell/",
  "data_nascimento": "18 February 1919",
  "local_nascimento": "Los Angeles, California, USA",
  "data_morte": "14 January 2000",
  "local_morte": "Baltimore, USA",
  "summary": "Clifford Truesdell was an American mathematician best known as a historian of science.",
  "biografia": "It will come as no surprise to learn that the father of\nClifford Ambrose Truesdell III\nwas Clifford Ambrose Truesdell II. Perhaps a more detailed look at the \"Clifford Ambrose Truesdell\" name would be more helpful. The original Clifford Ambrose Truesdell was born in\n1863\n(\nand died in\n1937)\n. He married Emily Estelle Galinger\n(1869\n-\n1957)\nand their third child was named Clifford Ambrose Truesdell II\n(1894\n-\n1932)\n. He married Yetta Helen Walker\n(1897\n-\n1987)\nand they named their first child Clifford Ambrose Truesdell III. He was brought up in Los Angeles where he attended the Polytechnic High School. His interests were broad, at one time he wanted to become a poet, and his fascination with art began early with his first art purchase made when he was nine years old. He graduated from the High School in\n1936\nand spent the next two years on what, in earlier times, would have been called the \"grand tour\". For two years he spent time in Oxford, England, travelled widely throughout Europe, and engaged in private study. He studied Latin and Ancient Greek and, using his time in various countries to acquire language skills, became proficient in German, French and Italian. He had a life-long love of Italy and the Renaissance, something which we shall comment on in more detail later in this biography.\nBack in the United States in\n1938\n, he entered the California Institute of Technology where he majored in mathematics and physics. Both these departments at Caltech had been raised to a high level by outstanding scientists. In the case of physics this was Robert A Millikan and, for mathematics, there was the hugely influential\nHarry Bateman\n. These men had a major influence on Truesdell who received a B.S.\n(\nMathematics\n)\nand a B.S.\n(\nPhysics\n)\nin\n1941\n. While he was an undergraduate, he married Beverly Grace Poland on\n18\nNovember\n1939\n. They had one son who, not surprisingly, they named Clifford Ambrose Truesdell IV. After receiving his first degree, Truesdell continued to work at Caltech for his Master's Degree in mathematics which he was awarded in\n1942\n. In his last two years at Caltech, namely\n1940\n-\n42\n, he was employed as an assistant in history, debating and mathematics but it was understanding\nBateman\n's approach to mathematics that made these years so important for Truesdell\n[\n1\n]\n:-\nHe took courses from\nBateman\non the partial differential equations of mathematical physics in\n1940\n-\n41\n, and in\n1941\n-\n42\non methods of mathematical physics\n(\nwhere for the entire year he and C-C Lin were the only students\n)\n, aerodynamics of compressible fluids, and potential theory. In his generous tribute to\nBateman\n[\nin 'An Idiot's Fugitive Essays on Science'\n(1984)]\nTruesdell recalls how tough these courses were, and how he devoted long hours to following them and doing the exercises. In subject matter, in particular their coverage of continuum mechanics and physics, and their use of the theory of partial differential equations and special functions, the courses formed a solid foundation for the young researcher. But\nBateman\nwas also a man who \"saw the whole of the mathematical sciences as a continuum without compartments\" and who \"saw no difference in style or standard between pure mathematics and applied\", values that Truesdell's own research were to exemplify.\nLeaving Caltech, Truesdell went to Brown University in Providence, Rhode Island, where he was employed as an Assistant in Mechanics in the School of Mathematical Mechanics. He was awarded a Certificate in Mechanics by Brown University in\n1942\nand, in the following year, he was awarded a Ph.D. by Princeton University for his thesis\nThe Membrane Theory of Shells of Revolution\n. His thesis advisor at Princeton was\nSolomon Lefschetz\nbut Truesdell had begun work on his thesis during the summer of\n1942\nwhile at Brown University. The authors of\n[\n1\n]\ngive details of the contents of Truesdell's thesis:-\nHe develops a formal method for deriving both 'membrane' and 'bending' theory simultaneously from a common expansion, and he studies the singular state at the apex of a cone, relying mainly on the tools of\nFourier\nexpansion and formal manipulation of power series. In its use of formal methods, its reliance on special kinematic hypotheses\n(\nmembranes of revolution only\n)\nand its presentation of series solutions of a great many special problems, this work can be considered properly isolated from his other work. Perhaps, through juxtaposition and reaction, it is a point of departure toward loftier goals.\nWhile at Princeton working on his thesis, Truesdell attended\nAlonzo Church\n's graduate course\nIntroduction to Mathematical Logic\nand the notes that he took became\nChurch\n's book published with this title in\n1944\n. After rapidly obtaining a Ph.D. from Princeton, Truesdell was employed for the year\n1943\n-\n44\nas an Instructor of Mathematics at Michigan University. He worked in the Radiation Laboratory of the Massachusetts Institute of Technology during\n1944\n-\n1946\nbefore being appointed Chief of the Theoretical Mechanics Subdivision of the U.S. Naval Ordnance Laboratory at White Oak, Maryland in\n1946\n. After two years in this post, he was appointed Head, of the Theoretical Mechanics Section of the U.S. Naval Research Laboratory in Washington, D.C. During these years he kept his links with universities through the University of Maryland, College Park. He was a Lecturer in Mathematics during\n1946\n-\n1947\n, and Assistant Professor of Mathematics during\n1947\n-\n1949\n, and an Associate Professor of Mathematics during\n1949\n-\n1950\n. After two years in Washington D.C. he again moved, returning to university life in\n1950\nwith an appointment as Professor of Mathematics at Indiana University. However, he kept his links with the U.S. Naval Research Laboratory in Washington D.C., being a consultant during\n1951\n-\n55\n, and he was also a consultant for the U.S. National Bureau of Standards in Washington D.C. during\n1950\n-\n62\n.\nIn\n[\n6\n]\na quotation from Andrew Douglas, former chairman of the mechanical engineering department at Johns Hopkins University, sums up the main thrusts of Truesdell's research:-\nHe brought a tremendous mathematical rigour and sense of historical perspective to a field that forms the basis of mechanical engineering today. He is one of the few people who made a lifelong study of rational mechanics - how materials behave. He also was a pioneer in thermodynamics. His most significant contribution was to go back and put rational mechanics in a rigorous mathematical framework. His writings forced people to do things right and rationally.\nAn excellent example of this is Truesdell's major paper\nThe mechanical foundations of elasticity and fluid mechanics\n(1952)\n. He explains the background to this paper in his book\nContinuum Mechanics I, The Mechanical Foundations of Elasticity and Fluid Mechanics\n(1966)\n:-\nWhen, in\n1946\n, I first began to study the foundations of continuum mechanics, within a few months I had set the whole field in order, to my own satisfaction. I quickly wrote and submitted to an international meeting an expository memoir, which was rejected. In view of the quality of the papers accepted by the same meeting, I was naive enough to be astonished as well as disappointed, and I sent the manuscript for criticism to a number of experts. Most of these did not deign to acknowledge it or reply, but two did. Mr\nFriedrichs\ntold me I had underestimated the work of earlier authors. Since my information concerning it was drawn from a number of reputable textbooks, I turned, somewhat taken aback, to the sources they cited, and then to the sources cited by these sources, and so on, until within a period of a year I found out how right he was and how little I had seen of the real issues faced by the great natural philosophers one and two centuries ago.\nAfter Truesdell's first marriage to Beverly ended, he married Charlotte Janice Brudno on\n16\nSeptember\n1951\n. Truesdell was asked by T Y Thomas to join him in founding a new journal and they set about the task of founding the\nJournal of Rational Mechanics and Analysis\n. Truesdell and Thomas became the two editors-in-chief and Truesdell's wife Charlotte became their editorial assistant. The first issue appeared in January\n1952\nand the aim of the Journal was clearly stated in the first issue:-\nThe 'Journal of Rational Mechanics and Analysis' nourishes mathematics with physical applications, aiming especially to close the rift between \"pure\" and \"applied\" mathematics and to foster the discipline of mechanics as a deductive, mathematical science in the classical tradition.\nHowever, only five volumes of the Journal were published before a new head of department at Indiana removed Truesdell as an editor and changed the name of the Journal. Perhaps the difficulty may be understood if we look at the comment made about Truesdell in\n[\n2\n]\nby Jean-Pierre Meyer:-\n... his brusque personality and ego made him unpopular with colleagues. He was infamous for being vocally critical of other faculty members.\nHowever, Truesdell was able to continue publication of the journal under the title\nArchive for Rational Mechanics and Analysis\nwhen Springer-Verlag agreed to take over publication in December\n1956\n. Truesdell now became the sole editor-in-chief and most of the editorial team of the Journal joined the Board of the Archive. Truesdell, on behalf of the editors, wrote in the first issue:-\nContributions for pure analysis are welcome; while they need not have physical application, when such application is possible it should be developed. Similarly, papers on rational mechanics need not contribute to analysis or to practical application, but if such connections exist, they should be explained. The basic function of the 'Archive' is to serve mechanics treated as a mathematical discipline and those parts of pure mathematics that are useful in mechanics.\nIn\n1961\nTruesdell moved to Baltimore when he took up an appointment as Professor of Rational Mechanics at Johns Hopkins University\n[\n2\n]\n:-\nSoon after arriving at Homewood in\n1961\n, Truesdell and his wife, Charlotte, purchased a brick and stone mansion on Greenway in the city's Guilford neighbourhood. ... Truesdell felt the house was not sufficiently Renaissance, so he engineered and oversaw a variety of changes to create a more Italian feel. The reworked 'Il Palazzetto' soon began to fill with the couple's collection of art, furniture, and statuary. When the Truesdells entertained, they often hired musicians to play Renaissance works on period instruments in the home's massive front hall.\nWhile we are describing Truesdell love of the Renaissance period, let us quote from Walter Noll\n[\n7\n]\n:-\n[\nTruesdell\n]\nbelieved that the pinnacle of civilization had been reached in the\n18\nth\ncentury and that things have gone downhill ever since. He had no television set and no radio, and I doubt that he ever used a typewriter, let alone a computer. Many of the letters he sent me were written with a quill pen.\n(\nHowever, he did not reject such modern conveniences as flush toilets and air-conditioning.\n)\nHe loved baroque music and did not care very much for what was composed later on. He owned very fine harpsichords and often invited masters of the instrument to play, often before a large audience, in his large home in Baltimore, which he called \"Il Palazetto\". He collected art and antique furniture, mostly from the\n18\nth\ncentury. He even often dressed in the manner of an\n18\nth\ncentury gentleman. Most importantly, he admired the scientists of the\n18\nth\ncentury and, above all,\nLeonhard Euler\n, whom he considered to be the greatest mathematician of all time.\nHis love of Italy is illustrated by the numerous times he was in the country as a visiting lecturer: at the University of Pisa in\n1966\n,\n1973\n.\n1974\n,\n1975\n,\n1978\n,\n1980\n,\n1982\n,\n1985\nand\n1987\n, and at the\nAccademia dei Lincei\nin Rome in\n1970\nand\n1973\n.\nWe have given some indication of Truesdell's mathematical contributions but to illustrate these further the reader might like to look at some of the books he published. These are given\nTHIS LINK\n.\nThe extracts from reviews and Prefaces that we present give considerable insight into Truesdell's style and range of contributions.\nTruesdell retired from his chair at Johns Hopkins University in\n1989\nand was made Professor Emeritus. He received many honours throughout his career. He was awarded a number of medals and prizes: California Institute of Technology, Conger Peace Prize,\n1940\n,\n1941\n;\nEuler\nmedal of the\nUSSR Academy of Sciences\n,\n1958\n,\n1983\n; Bingham Medal of the Society of Rheology,\n1963\n; Gold Medal and International Prize \"Modesto Panetti\"\n(\napplied mechanics\n)\n, Accademia di Scienze di Torino,\n1967\n;\nGeorge David Birkhoff\nPrize\n(\napplied mathematics\n)\n,\nAmerican Mathematical Society\nand\nSociety for Industrial and Applied Mathematics\n,\n1978\n:-\nThe sixth award was given in\n1978\nto Clifford A Truesdell for his outstanding contributions to our understanding of the subjects of rational mechanics and nonlinear materials, for his efforts to give precise mathematical formulation to these classical subjects, for his many contributions to applied mathematics in the fields of acoustic theory, kinetic theory, and nonlinear elastic theory, and the thermodynamics of mixtures, and for his major work in the history of mechanics.\nHe also received: the Ordine del Cherubino, University of Pisa,\n1978\n; and the\nTheodore von Karman\nMedal,\n1996\n.\nHe was awarded honorary degrees from the Politecnico di Milano\n(1965)\n, Tulane University\n(1976)\n, Uppsala University\n(1979)\n, the University of Basel\n(1979)\n, and the University of Ferrara\n(1992)\n. He was elected to the Accademia Nazionale di Scienze, Lettere ed Arti, Modena\n(1960)\n, the Académie Internationale d'Histoire des Sciences, Paris\n(1961)\n, the Istituto Lombardo Accademia di Scienze e Lettere\n(1968)\n, the Istituto Veneto di Scienze, Lettere ed Arti\n(1969)\n, the Accademia delle Scienze dell'Istituto di Bologna\n(1971)\n, the Accademia Nazionale dei Lincei Rome\n(1972)\n, the Académie Internationale de Philosophie des Sciences, Bruxelles\n(1974)\n, the Accademia delle Scienze, Torino\n(1978)\n, the\nAcademia Brasileira de Ciências\n(1981)\n, the Polish Society for Theoretical and Applied Mechanics\n(1985)\n, the Regia societas scientiarum Upsaliensis\n(1987)\n, and the\nAmerican Academy of Arts and Sciences\n(1991)\n.\nLet us end this biography of Truesdell by quoting from Bernard Coleman\n[\n4\n]\n:-\nI consider myself to have been among the most fortunate of men: I have had a teacher and friend, indeed, more than a friend, in effect, an elder brother, who was the leading scholar in my science and who gave me encouragement, sound advice, and every type of help that I might need, even when I did not know that I needed it. Most important of all, he taught me that careful scholarship and the persistent search for insight and understanding are far more important than facile skill in the use of contemporary techniques for the solution of currently popular problems. ... I visited your house in Bloomington for a week in, I believe, the winter of\n58\n-\n59\n. That visit had a major influence on my view of what is important. As if struck by lightening, like the one Christians call Paul, I suddenly saw clearly something for which I was ready by instinct. In my case it was not a new religion, but a way to get out of a rut, by seeking to study the languages, the writings, the art, the customs, the lives, and the music and diversions of the ages in which our science originated and the works we admire were produced. Your example gave me the impetus to try to learn properly other languages. I became serious in my study of Italian. In later years I have tried to improve my French.\n(\nIn my\n62\nnd\nyear, I started working on Attic and Homeric Greek, but was too old for such efforts.\n)",
  "matematicos_citados_na_biografia": [
    "Harry Bateman",
    "Bateman",
    "Solomon Lefschetz",
    "Fourier",
    "Alonzo Church",
    "Church",
    "Friedrichs",
    "Leonhard Euler",
    "Accademia dei Lincei",
    "THIS LINK",
    "Euler",
    "USSR Academy of Sciences",
    "George David Birkhoff",
    "American Mathematical Society",
    "Society for Industrial and Applied Mathematics",
    "Theodore von Karman",
    "Academia Brasileira de Ciências",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}