{
  "nome_completo": "Daniel Pedoe",
  "nome_curto": "Daniel Pedoe",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pedoe/",
  "data_nascimento": "29 October 1910",
  "local_nascimento": "London, England",
  "data_morte": "27 October 1998",
  "local_morte": "St Paul, Minnesota, USA",
  "summary": "Dan Pedoe was an English-born mathematician and geometer.",
  "biografia": "Daniel Pedoe\n's name did not come from his father whose name was originally Szmul Abramski\n(1863\n-\n1942)\n. However, it is not that simple; for his father, who was a Polish Jew from the priestly tribe of Kohanim, changed his name to Cohen when he arrived in Britain in the\n1890\ns. He chose Cohen because he was from the Kohanim tribe and thought that Cohen would be an easier name for British people. He was a skilled cabinetmaker and, after arriving in England, lived in the East End of London. Daniel's mother, who was also from Poland, was the only daughter of the corn merchant Wolf Pedowicz and his wife Sarah Haimnovna Pecheska. She was born in Lomza in the Russian part of Poland. Her name was Ryfka Raszka Pedowicz\n(1865\n-\n1948)\nand, as we will explain in a moment, it was that name which eventually led to the subject of this biography being given the name Pedoe. This, however, came later and the family of thirteen children all started life with the name of Cohen. To make it easier to understand, we shall refer to the subject of this biography as Pedoe throughout, even during the years when his name was Cohen. Daniel was the youngest of the thirteen children and he had brothers and sisters who were adults when he was born. In\n[\n20\n]\nPedoe explained that life was hard by modern standards:-\nOur three-story house had an outside toilet. There was no indoor tap when I was very young. I have a distinct memory of my mother doing the laundry in a large galvanized iron tub under the outside cold-water tap. We used the public baths, of course, and eventually we also used a commercial laundry. Gas light was eventually replaced with electricity, but this did not extend to the outside toilet, where a candle provided the only light.\nUp to the age of eleven Pedoe attended the local primary school. There he met some geometry in drawing classes. He had\n[\n20\n]\n:-\n... a drawing lesson once a week. Before taking some students to a swimming class, the drawing master would set out an assortment of cones and cubes\n(\nI do not remember any spheres\n)\nfor the rest of us to sketch. On his return, he would look through our drawings and cane on the hand any unsatisfactory artists. His criteria were never explained.\nAt the age of eleven he began his secondary school education at the Central Foundation Boys' School, in Cowper Street, London. This school had been founded in\n1866\nby the Reverend William Rogers who wanted to provide a good education for the sons of skilled workmen and tradesmen who could not afford high fees. When Pedoe studied there it was selective, only accepting boys with good academic standards, and was fee paying. The pupils, but not the teachers, were mostly Jewish. The headmaster was Norman Martin Gibbins\n(\nborn\n15\nOctober\n1882)\nwho was a mathematician and had graduated as\n12\nth\nWrangler\nin the\n1903\nCambridge mathematical tripos examinations. He was also a great enthusiast for chess and is remembered today for his paper\nChess in Three and Four Dimensions\npublished in\nThe Mathematical Gazette\nin\n1944\n. He was second master at the Central Foundation Boys' School\n1912\n-\n1922\nand headmaster\n1922\n-\n1946\n. Pedoe writes\n[\n20\n]\n:-\nGibbins, was a lover of geometry, particularly of conics.\n[\nHe\n]\nhad piercing eyes, and a bad stutter\n(\nwhich he seemed to ignore\n)\nadded to the intensity of his speech. ... There was a concentration on mathematics at his school, but the arts and sciences were not neglected, and there was even woodwork for the junior classes. ... Gibbins was a good pianist and encouraged music at his school. ... The language instruction at Gibbins' school was especially good; I left there having enjoyed seven years of French and six of German.\nSoon after beginning his secondary education his name was changed from Cohen to Pedoe. He explains how this came about in\n[\n20\n]\n:-\nMy brother Arthur, who was about thirteen years my senior, first became a schoolmaster at a private grammar school, and then entered the actuarial profession, which involved passing rather difficult exams in\nprobability\nand general law. He was very successful. His seniors knew his origin, but by changing his name from Abraham Cohen to Arthur Pedoe he avoided any awkward confrontation. With his fair, curly hair and blue eyes, Arthur could \"pass\" as a gentile. My slightly older brother Joe had red, curly hair and blue eyes, while I had fair hair and hazel eyes. I was sometimes smiled at by gentile neighbours as being \"one of us,\" which hardly pleased my mother. ... Anyway, when I was twelve, Arthur changed Joe's name and mine to Pedoe, a contraction of our mother's name Pedowicz, to which he felt we had a right.\nWhile a pupil at the Central Foundation Boys' School, Pedoe published his first paper\nThe geometric interpretation of Cagnoli's equation:\nsin\n⁡\nb\nsin\n⁡\nc\n+\ncos\n⁡\nb\ncos\n⁡\nc\ncos\n⁡\nA\n=\nsin\n⁡\nB\nsin\n⁡\nC\n−\ncos\n⁡\nB\ncos\n⁡\nC\ncos\n⁡\na\n\\sin b \\sin c + \\cos b \\cos c \\cos A = \\sin B \\sin C - \\cos B \\cos C \\cos a\nsin\nb\nsin\nc\n+\ncos\nb\ncos\nc\ncos\nA\n=\nsin\nB\nsin\nC\n−\ncos\nB\ncos\nC\ncos\na\nwhich appeared in\n1929\nin the\nMathematical Gazette\n. He used the following mathematics books as he prepared to sit the\n1930\nCambridge Scholarship examination\n[\n19\n]\n:-\nC Smith,\nAlgebra\nand\nAnalytical Conics\n;\nLoney\n,\nTrigonometry\n, Parts I and II;\nMacaulay\n,\nGeometrical Conics\n;\nLoney\n,\nStatics and Dynamics\n(\nno calculus used\n)\n; Edwards,\nDifferential Calculus\n; Williamson,\nIntegral Calculus\n; Besant,\nHydrodynamics\n. He also read  Casey,\nSequel to Euclid\n;\nChrystal\n,\nAlgebra\n, Vol. II;\nSalmon\n,\nConic Sections\n;\nHobson\n,\nTrigonometry\n; Burnside and Panton,\nTheory of Equations\n;\nRouth\n,\nDynamics of a Particle and Rigid Bodies\n; Minchin,\nStatics, including Theory of Attractions\n.\nPedoe matriculated at Magdalene College, Cambridge, in\n1930\n. There his tutor was Arthur Stanley Ramsey, the father of\nFrank Ramsey\n. Arthur Ramsey was not only a mathematics tutor, for he was President of Magdalene College. Pedoe attended lectures by\nLudwig Wittgenstein\n[\n20\n]\n:-\nI tried to attend his lectures, but sitting uncomfortably on canvas chairs in a small room as Ludwig walked up and down wrestling with his thoughts, producing words at the rate of fewer than one per minute - all this was too much for me.\nHe attended lectures by\nBertrand Russell\n:-\nRussell\n's lectures had an unusual characteristic: they were deliberately fabricated to repel students.\nHis main interest, however, was in geometry. He attended\nHenry Baker\n's lectures on Italian\nalgebraic geometry\nand began working towards his doctorate advised by\nBaker\n, publishing the papers\nAn extension of a fundamental theorem in the theory of surfaces\n(1934)\n,\nOn the virtual grade of curves on an algebraic surface\n(1935)\nand\nOn a class of irregular surfaces\n(1935)\non this topic. He had also read\nvan der Waerden\n's papers on the algebraic foundations of algebraic geometry.\nFeeling he needed a break from the Cambridge atmosphere, he made arrangements in\n1935\nto visit the Institute for Advanced Study at Princeton where he worked with\nSolomon Lefschetz\n. Returning to England in\n1936\nhe was appointed as an assistant lecturer at the University of Southampton. In\n1937\nhis papers\nOn the canonical systems of certain algebraic surfaces\nand\nOn the representation of circles by means of points in space of three dimensions\nwere published. He submitted his thesis\nThe Exceptional Curves On An Algebraic Surface\nto the University of Cambridge and, after being examined by\nHenry Baker\nand\nWilliam Hodge\n, he was awarded his Ph.D. Around this time Pedoe married the geographer Mary Tunstall; their first child was a daughter Naomi, followed by twin sons Dan and Hugh, born on\n30\nDecember\n1939\n. By this time World War II had begun and his next paper\nSome properties of the paraboloid\nz\n=\nx\n2\n+\ny\n2\nz = x^{2} + y^{2}\nz\n=\nx\n2\n+\ny\n2\n(1939)\nhad been published in the\nEdinburgh Mathematical Notes\n.\nIn\n1941\nthe famous independent school Winchester College was struggling to carry out its teaching obligations since many of its masters had been drafted into the army. The mathematics master at Winchester,\nClement Vavasor Durell\n, wrote to the University of Southampton asking if they had any members of staff who could help them out and Pedoe, being the most junior member of Southampton's Mathematics department, was asked to go to Winchester on one day each week to teach there. At Winchester, he taught\nFreeman Dyson\n:-\nI taught a junior class of twelve-year-olds at Winchester as well as the top class, where one of the students was young\nFreeman Dyson\n. I was not asked to teach\nDyson\n's class geometry, but just to continue with a set of problems on infinite series. In Southampton, my university class could do about six problems for each homework, but\nDyson\n's class turned in thirty or forty! I found the junior class rather difficult and noisy. Once, after I had been up all night in an air raid, I appealed to them to make less noise. They calmed down for about five minutes.\nIn\n1941\nPedoe began his collaboration with\nWilliam Hodge\non the famous three volume book\nMethods of algebraic geometry\n. It was a letter from\nHodge\nto Pedoe which began this collaboration and we give this letter at\nTHIS LINK\n.\nYou can read short extracts from the review of\nMethods of algebraic geometry\nat\nTHIS LINK\nand a Pedoe's account of\nHodge\nat\nTHIS LINK\n.\nIn\n1942\nthree further papers by Pedoe appeared:\nA remark on a property of a special pencil of quadrics\n;\nOn some geometrical inequalities\n; and\nAn inequality for two triangles\n. In that year he moved from Southampton to Birmingham to take up a lectureship at the university. There his teaching was mainly to engineering students:-\nWe found Birmingham a grim place after Southampton. There seemed to be a fine, damp soot in the air most of the time, which did not suit our children. The University consisted of pretentious buildings, bitterly cold in the winter, and the head of the mathematics department,\nG N Watson\n, took pleasure in behaving eccentrically. We had no mathematics seminars, and I never heard\nWatson\nlecture.\nThe professor of mathematical physics at Birmingham was\nRudolf Peierls\nwho, at this time, was working on the theoretical side of the British project to develop an atomic bomb. He suggested to Pedoe that he should contribute to the war effort and Pedoe was enlisted to work part-time on the improvement of piston rings.\nIn\n1947\nPedoe moved to Westfield College, part of the University of London, where he became a reader in mathematics. However, his income was not sufficient to allow him to make a deposit for a house of his own so he and his family had to live in lodgings on the Finchley Road. He also found that the \"Westfield College atmosphere was a strain\" so, encouraged by his wife who as a professional geographer had long wanted to visit Egypt and Africa, he applied for the position of head of the mathematics department at the University of Khartoum. He was given leave from Westfield to try out this new appointment which he took up in\n1952\n. After a few months, Westfield demanded that he make a decision whether he wanted to return to his post there and, after thinking through the rather difficult decision, he decided to remain in Khartoum and resign his Westfield appointment. Pedoe spent the next seven years in Khartoum.\nPart of his conditions of the appointment to Khartoum was that his family would be flown out from London at the University of Khartoum's expense to spend time with him every Christmas:-\nAt Christmas, my family left the pea-soup December fogs of London and entered a land of perfect weather, with twelve hours of sunshine every day, cool nights, excellent servants in spotless white robes, no food rationing\n(\nunlike Britain\n)\n, a swim every afternoon, and the undoubted romance of being on the Nile.\nAfter a few years his wife decided to remain permanently with him in Khartoum although his children remained in England:-\nFor much of the year one slept outdoors. I would be awakened soon after sunrise by my servant Daoud gently pressing the big toe of my right foot before placing my tea on the bedside table. I would drink my tea, shower, eat a good breakfast, and settle down to writing books on my Olivetti typewriter. At noon, a trip to the Sudan Club, a swim, a beer, and back for lunch and siesta. It was a good life.\nWhile he was in Khartoum, he wrote the two books\nCircles\n(1957)\nand\nThe Gentle Art of Mathematics\n(1959)\n. For extracts from some reviews of these books see\nTHIS LINK\n.\nHe left Khartoum in\n1959\nwhen he was appointed as head of the mathematics department at the University of Singapore. The retirement age in Singapore was\n55\nso, after a few years, Pedoe realised that he was approaching that age yet had no wish to retire. The situation was solved with an offer from Purdue University in Indiana. He took up the appointment there in\n1962\n[\n20\n]\n:-\nPurdue was very cut off from the rest of Indiana. The nearest small town, Lafayette, had one cinema and one bar. The mathematics faculty entertained each other a great deal, and the atmosphere was a friendly one. I made some good friends .... I was in demand for lectures, and I was also asked to join the Minnesota College Geometry Project as a Senior Mathematician, the other being\nDonald Coxeter\n. The idea of the project, which was funded by the National Science Foundation, was to improve geometry teaching in high schools and colleges, by making films on geometry and writing an accompanying textbook. So I began writing scripts.\nWhile at Purdue, he published two books,\nAn Introduction to Projective Geometry\n(1963)\nand\nA Geometric Introduction to Linear Algebra\n(1963)\n. For extracts from some reviews of these books see\nTHIS LINK\n.\nAfter spending two years at Purdue University, he was appointed to the University of Minnesota. Here he continued to write excellent books, the first being\nA Course of Geometry for Colleges and Universities\n(1970)\nwhich was republished as\nGeometry: A Comprehensive Course\n(1988)\n. He also published\nGeometry and the Liberal Arts\n(1976)\nwhich was republished as\nGeometry and the Visual Arts\n(1983)\n. For extracts from some reviews of these books see\nTHIS LINK\n.\nPedoe continued to work at the University of Minnesota until he retired in\n1981\n. At this time he was made Professor Emeritus. It was after he retired that he published the book\nJapanese Temple Geometry Problems\n(1989)\nwritten jointly with Fukagawa Hidetosi. We mentioned above that Pedoe taught\nFreeman Dyson\nat Winchester College.\nDyson\nwrote a preface to Fukagawa Hidetoshi and Tony Rothman's book\nSacred Mathematics: Japanese Temple geometry\n[\n11\n]\nin which he writes about Pedoe:-\nDaniel Pedoe was my teacher when I was studying mathematics as a boy in an English high-school long ago. He gave me my first taste of mathematical research, asking me to work out a mapping of the circles in a Euclidean plane onto the points of a three-dimensional Euclidean space. I found the mapping, and my eyes were opened to the power and beauty of geometry. Many of the properties of circles became intuitively obvious when I looked at the map. Later, I renewed my friendship with Pedoe after we both moved to America. Forty years later, Pedoe discovered 'sangaku'. He was then a professor of mathematics in Minnesota, and there he received a letter from Fukagawa. Fukagawa had written to six mathematicians known to be interested in geometry, informing them of the existence of 'sangaku' and inviting them to collaborate in making 'sangaku' known to the world outside Japan. Pedoe was the only one of the six who answered. He agreed to collaborate with Fukagawa in producing the book 'Japanese Temple Geometry Problems', which was published in English in\n1989\nby the Babbage Institute in Winnipeg, Canada. Pedoe paid for Fukagawa and his wife to come to Minnesota to work on the book, and he also visited Fukagawa in Japan. He remained a close friend of Fukagawa's and a promoter of 'sangaku' until his death in\n1998\n.\nIn fact Fukagawa Hidetoshi dedicated the book\n\"To the Memory of\nDan Pedoe\nWho first introduced\nsangaku\nto the world.\"\nFor extracts from some reviews of Pedoe's\nJapanese Temple Geometry Problems\nsee\nTHIS LINK\n.\nAmong the honours that Pedoe received we mention the Senior Fulbright Fellowship he was awarded which enabled him to visit Australia and the\nMathematical Association of America\n's\nLester Ford\nAward which he received in\n1968\n. Among his hobbies we must mention that he was an excellent painter in oils and his work was exhibited in several exhibitions. He died of pneumonia at the age of\n87\n, two days before his\n88\nth\nbirthday.\nFinally let us say a little about Pedoe's twin sons Dan Tunstall Pedoe and Hugh Tunstall Pedoe. Dan studied at Cambridge and Oxford becoming a cardiologist and leading expert on sports medicine. He was the founding chief medical officer of the London marathon, being the medical director of the marathon for\n25\nyears. He died of a heart attack in London on\n13\nFebruary\n2015\nat the age of\n75\n. Hugh also trained in medicine and cardiology and worked for\n34\nyears for the World Health Organisation. He became Professor of Cardiovascular Epidemiology at the University of Dundee, Scotland, in\n1981\nwhere he is now professor emeritus.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "probability",
    "Loney",
    "Macaulay",
    "Chrystal",
    "Salmon",
    "Hobson",
    "Routh",
    "Frank Ramsey",
    "Ludwig Wittgenstein",
    "Bertrand Russell",
    "Russell",
    "Henry Baker",
    "algebraic geometry",
    "Baker",
    "van der Waerden",
    "Solomon Lefschetz",
    "William Hodge",
    "Clement Vavasor Durell",
    "Freeman Dyson",
    "Dyson",
    "Hodge",
    "THIS LINK",
    "G N Watson",
    "Watson",
    "Rudolf Peierls",
    "Donald Coxeter",
    "Mathematical Association of America",
    "Lester Ford"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}