{
  "nome_completo": "David Robert Bates",
  "nome_curto": "David Bates",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bates/",
  "data_nascimento": "18 November 1916",
  "local_nascimento": "Omagh, County Tyrone, Ireland",
  "data_morte": "5 January 1994",
  "local_morte": "Belfast, Ireland",
  "summary": "David Bates was an Irish mathematician and physicist who worked on atmospheric physics, molecular physics and the chemistry of interstellar clouds.",
  "biografia": "David Bates\nwas the son of Walter Vivian Bates\n(1877\n-\n1935)\nand Mary Olive Shera\n(\nborn\n1887)\n. Walter Bates, from Mountrath, County Laois\n[\n7\n]\n:-\n... appears to have been a man of intelligence with real, if untutored, mathematical talent, and was adept to finding ingenious solutions to puzzles.\nHaving trained as a pharmacist, Walter registered with the Pharmaceutical Society of Northern Ireland in\n1890\n. He moved to Omagh in\n1909\nwhere he opened a chemist shop. In the April\n1911\nCensus he gave his address as The Pharmacy, High Street, Omagh. On\n20\nJune\n1911\nhe married Mary Olive\n(\nMolly\n)\nShera at Clogherny Parish Church. The ceremony was performed by the Rev Dr Hunter. Molly Shera was the only daughter of David and Margaret Shera, The Glebe, Dunmoyle, Sixmilecross, County Tyrone. David Shera was Land Agent for Lord Justice Ross. Walter and Mary Bates had four children, the youngest being David Bates, the subject of this biography. Only one of his three older siblings survived beyond being a baby, namely Margaret\n(\nPeggy\n)\nBates.\nDavid and his older sister Margaret attended Miss Quigly's school in Omagh. This school only had one room, the front room of Miss Quigly's house, in which all the children were taught. Realising that David required better educational prospects than Omagh could offer, his parents decided to make a considerable sacrifice. His mother Molly, together with the two children Margaret and David, moved to Belfast when David was nine years old so that he could have a better education. His father remained in Omagh where he continued to run The Pharmacy in the High Street. Bates writes in his\nScientific Reminiscences\n[\n1\n]\n:-\nI accepted the move thoughtlessly, not then appreciating the sacrifice made by my father who continued his business as a pharmacist in Omagh travelling to our home in Belfast twice a week.\nOnce in Belfast, the nine year old Bates continued his education at the Inchmarlo Preparatory School. From there, in\n1929\nhe progressed to the Royal Belfast Academical Institution. He excelled at mathematics and science, being particularly fond of chemistry, but was criticised by his teachers for his lack of enthusiasm for organised sports. In fact the emphasise that the school put on sport meant that Bates was not happy at the school. His shy introspective nature meant that he did not fit in well and he spent many hours carrying out his own chemistry experiments in the shed at the bottom of his garden. In\n1934\nhe won a scholarship to Queen's University, Belfast, and began his studies there later in the same year. When he matriculated in the Faculty of Science, he was still unsure whether he wanted to specialise in physics or chemistry. He began by studying mathematics, physics and chemistry but it was his physics teachers who were outstanding. He studied courses on experimental physics given by Karl George Emeleus\n(1901\n-\n1989)\nand mathematical physics delivered by Harrie Stewart Wilson Massey\n(1908\n-\n1983)\n. Their excellent teaching quickly persuaded Bates to give up his notions about studying chemistry and he graduated in\n1937\nwith a First Class degree in both Experimental Physics and Mathematical Physics.\nHarrie Massey suggested that, for a Master's degree, Bates should work with his fellow student Joseph John Unwin. The thesis,\nRecombination in the upper atmosphere\n, involved much heavy computation which was shared by Bates and Unwin. These computations were carried out using a specially constructed differential analyser made by technician John Wylie. Bates was awarded an M.Sc. in\n1938\nand, after Richard Arthur Buckingham\n(1911\n-\n1994)\nhad used different methods to check the results of the thesis, it was published in\n1939\n, becoming Bates' first publication. In autumn\n1938\nHarrie Massey was appointed to the Goldschmid Chair of Applied Mathematics at University College, London and he took Bates, his most promising researcher, to University College with him. Bates registered as a Ph.D. student at University College London and worked on his thesis advised by Massey. However, when Bates was part way though the research, World War II began. He had, however, already published the paper\nThe quantal theory of continuous absorption of radiation by various atoms in their ground states\n(1939)\n. We should note that during the war Joseph Unwin became a civilian Scientific Officer with the R.A.F. and was killed in an accident while testing an airplane. We should note also that Richard Buckingham was an assistant lecturer in mathematical physics at Queen's University, Belfast who also followed Massey to University College London in late\n1938\n.\nRequired to undertake war work, Massey was sent to the Admiralty Research Laboratory at Teddington to head a team trying to find ways to combat the threat of German magnetic mines which were destroying the Allies' ships. He took with him a number of young scientists from University College including Bates and Buckingham. By\n1941\nthey had solved the problems of German mines and the team transferred to the Mine Design Department near Portsmouth to work on making mines with which to attack German ships. Bates became Chairmen of the Research Committee on Mechanical Engineering Problems. Massey later said\n[\n2\n]\n:-\n... he introduced a breath of fresh air into a moribund subject of great importance for the defence effort.\nFrancis Crick, who along with James Watson determined the double-helix structure of DNA in\n1953\n, worked with Bates during the war. He said\n(\nsee for example\n[\n11\n]\n)\n:-\nBeneath a quiet, rather reserved manner, David seemed confident in himself, with a shy, rather engaging charm ... I recall my association with him with affection ...\nWhen the war ended Bates and Massey returned to University College London. Bates never completed his doctoral dissertation; the opportunity had passed and by this time he was too much of an established researcher to require a Ph.D. He was appointed as a Lecturer in Mathematics at University College in\n1945\n. Together with two research students, Bates produced many important research papers applying mathematical techniques in the study of the ionised regions of the Earth's atmosphere. In particular they\n[\n4\n]\n:-\n... began a programme of quantum mechanical calculations of atomic and molecular processes, especially those of importance in the upper atmosphere.\nThe year\n1950\nwas important for Bates who took study leave and spent the year in Pasadena, California, where he began a collaboration with Marcel Nicolet, but also was able to visit Princeton University where he wrote an important paper\nThe density of molecules in interstellar space\nin collaboration with\nLyman Spitzer\n. It was during his year in the United States that Bates began to wear a red tie and red socks, something which became his trademark attire from that time on. In\n1951\nBates was awarded a D.Sc. by University College London and made a Reader in Physics there. However, later the same year he accepted an appointment as Professor of Applied Mathematics at Queen's University, Belfast. Ray Flannery writes\n[\n8\n]\n:-\nHe created a supportive yet challenging environment at Queen's, and many came from all over the world to carry out research in atomic, molecular and atmospheric physics, under his inspiration and direction. To have built this world-class department within such a short time was no mean achievement. It required great intellectual might and vision, incredible leadership and insight, sustained dedication and loyalty.\nDavid Bates was elected a fellow of the\nRoyal Society of London\nin\n1955\n. He travelled to London for the ceremony where new members of the Society were admitted and, on that occasion, met Barbara Morris. Soon after this he took Barbara to see Burlington House, where the Society had its premises, and there proposed marriage. They were married in London on\n20\nMarch\n1956\nand Harrie Massey, who attended the wedding, said\n(\nsee for example\n[\n7\n]\n)\n:-\nIn\n1956\nmy wife and I had the privilege of attending his wedding to Barbara. After the ceremony we lunched at the Coq d'Or and thence, while Barbara and my wife looked at the shops, Bates and I attended a meeting of the Gassiot Committee ...\n(\nWe note that the Gassiot Committee was a\nRoyal Society of London\nCommittee of experts on the upper atmosphere of the Earth.\n)\nThe next day the newly married couple returned to Belfast and spent a short honeymoon touring Ireland. David and Barbara Bates had two children, Kathryn Maud Bates and Adam David Bates.\nAt Queen's University Belfast Bates taught courses extremely successfully at all levels. Alex Dalgarno\n(1928\n-\n2015)\n, one of Massey's Ph.D. students at University College and later one of Bates' colleagues at Queen's, writes about Bates' undergraduate teaching in\n[\n7\n]\n:-\nThough the years at Queen's, David taught the entire range of undergraduate classes. Many recall the clarity of his expositions and the revelation that mathematics could be used to study interesting questions of physics. In the classes for those specialising in applied mathematics, David took the time to speak individually to every one of the students and to discuss their progress. They may not have recognised it at the time, but David was motivated by his concern that they achieve their full potential and he also wished to ensure that any failure to do so was not caused by neglect on his part or lack of diligence and commitment on theirs.\nDetails of Bates' research are given in many of the references quoted below, see for example\n[\n5\n]\n,\n[\n8\n]\nand\n[\n11\n]\n. Here is a brief overview from\n[\n6\n]\n:-\nIn his studies, Bates combined physical insight with mathematical formulations constructed so that numerical calculations could be carried out to enable quantitative comparisons to be made of theory and measurement. He investigated a diverse range of processes and made significant contributions to the accurate description of photoionization, photodetachment, collisional excitation, ionization and charge transfer, chemical reactions, mutual neutralization, radiative association, dissociative recombination, dielectronic recombination, collisional-radiative recombination, and ion-ion recombination.\nLet us record here some of the many honours he received for his contributions. We have already mentioned that he was elected as a fellow of the\nRoyal Society of London\nin\n1955\nbut before this he had been elected as a fellow of the\nRoyal Irish Academy\nin\n1952\n, and served as its Vice-President in\n1976\n. However, many other leading academies elected him as a member such as the International Academy of Astronautics in\n1961\n, the\nAmerican Academy of Arts and Sciences\nin\n1974\n, the\nRoyal Belgium Academy of Science\nin\n1979\n, the\nUnited States National Academy of Sciences\nin\n1984\n, and the International Academy of Quantum Molecular Science in\n1985\n. He was awarded several medals for his remarkable research contributions, the main ones being the Hughes Medal of the\nRoyal Society\nin\n1970\n, the Chree Medal and Prize of the UK Institute of Physics in\n1978\n, the Gold Medal of the\nRoyal Astronomical Society\nin\n1979\n, and the Fleming Medal of the American Geophysical Union in\n1987\n. Nine universities awarded him an honorary degree: the National University of Ireland, the University of Ulster, the University of Dublin, the University of Glasgow, Stirling University, Essex University, York University of England, York University of Canada, and Queen's University of Belfast. For his services to science and education Bates was knighted in\n1978\nbecoming 'Professor Sir David Bates'. Three awards have been created and named in his honour: the David Bates Medal of the European Geosciences Union awarded:-\n... for exceptional contributions to planetary and solar system science;\nthe David Bates Prize of the Institute of Physics awarded:-\n...for distinguished achievement in atomic, molecular, optical and plasma physics;\nand the Bates Prize by Queen's University Belfast:-\n... to a student who has performed with distinction in the final honours examination in the Department of Applied Mathematics and Theoretical Physics and who subsequently pursues research in the department.\nOf course, Northern Ireland was going through a very difficult period with paramilitary violence causing high tensions, armed men patrolling the streets, night long curfews and a whole range of problems. Northern Ireland was divided into Roman Catholic and Protestant communities leading to politics being conducted totally along sectarian lines. Bates was strongly opposed to referring to his students as 'Catholics' and 'Protestants' using instead the phrase 'nourished by our two different traditions'. It was no surprise that he was a founder member of the Alliance Party of Northern Ireland in April\n1970\nwhich attempted to break the sectarian divisions of politics. With both Roman Catholic and Protestant members it argued for moderate policies and improving cross-community relations. Bates wrote an influential letter to\nThe Times\nconcerning the Alliance Party and served as its Vice-President for the rest of his life.\nA serious heart attack in\n1973\ndid nothing to stop his remarkable research output with over\n100\nof his\n339\npublications being written after this major illness. In fact he published six papers in\n1973\nand nine in the following year. Although he lived for over twenty years after this serious heart attack, in the end his death came through heart failure.\nThe following quote from\n[\n5\n]\nforms a fitting tribute to this great scientist and mathematician:-\nDavid Bates was one of the greatest twentieth-century Irish scientists. He was a brilliant, innovative and productive theoretical physicist and chemist. He was a very modest, kind and generous person, an inspiration to generations of students. After his retirement in\n1982\n, QUB named the building which houses the Theoretical and Computational Physics Research Division, the David Bates Building. He was especially proud of 'having his name over the shop' and continued to work in his office, stimulating everyone by his perceptive questions. He was a most devoted husband to Barbara and loving father to their two children Katharine and Adam.",
  "matematicos_citados_na_biografia": [
    "Lyman Spitzer",
    "Royal Society of London",
    "Royal Irish Academy",
    "American Academy of Arts and Sciences",
    "Royal Belgium Academy of Science",
    "United States National Academy of Sciences",
    "Royal Society",
    "Royal Astronomical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}