{
  "nome_completo": "David Kennedy Picken",
  "nome_curto": "David Picken",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Picken/",
  "data_nascimento": "27 July 1879",
  "local_nascimento": "Dennistoun, Glasgow, Scotland",
  "data_morte": "17 June 1956",
  "local_morte": "Victoria, Australia",
  "summary": "David Picken studied at Glasgow and Cambridge universities. After a period as a lecturer at Glasgow he became Professor of Mathematics at Victoria College, Wellington New Zealand. He later moved to the University of Melbourne in Australia.",
  "biografia": "David Picken\n's father was  David Picken\n(\nborn in Kilmarnock, Ayrshire about\n1847)\nwho was a schoolmaster. His mother was  Margaret Picken\n(\nborn in Edinburgh about\n1847)\n. He had four older siblings: Gusella\n(\nborn about\n1871)\n, Robert\n(\nborn about\n1874)\n, Charles\n(\nborn about\n1876)\n, and Annie\n(\nborn about\n1877)\n. He also had a younger brother Ralph\n(\nborn about\n1885)\n.\nDavid Picken attended school at Allan Glen's, Glasgow and then studied at Glasgow University being awarded an M.A. He then went to Cambridge to study the Mathematical Tripos and matriculated at Jesus College, Cambridge in October\n1899\n. He was sixth\nwrangler\nin\n1902\n. Following his graduation Picken was appointed Lecturer and Assistant Professor in the University of Glasgow. From there he moved to become Professor of Mathematics at Victoria College, Wellington, New Zealand in\n1907\n. In\n1915\nhe was appointed Master of Ormond College, University of Melbourne, Victoria, Australia. The College was a Presbyterian one named after its principal benefactor Francis Ormond. In fact Picken was the second master of Ormond College, the first being John MacFarland who had become Vice-Chancellor of the University in\n1914\n.\nDavid Kennedy Picken's obituary appeared in\nThe Mathematical Gazette\n, Vol.\n41\n, No.\n337\n.\n(\nOct.,\n1957)\n, pp. xxvi-xxvii. We present a version of this obituary at\nTHIS LINK\n.\nLet us give here a few details which are not in the\nGazette\nobituary. First let us list a few of the papers that Picken published in\nThe Mathematical Gazette: Ratio and proportion\n(\nJanuary\n1920)\n;\nThe complete angle and geometrical generality\n(\nDecember\n1922)\n;\nSome general principles of analytical geometry\n(\nJuly\n1923)\n;\nThe complete angle\n(\nOctober\n1923)\n;\nThe notation of the calculus\n(\nOctober\n1923)\n;\nParallelism and similarity\n(\nOctober\n1924)\n;\nThe approach to the logarithmic and exponential functions\n(\nDecember\n1926)\n; and\nThe approach to the calculus\n(\nOctober\n1927)\n. He also published in\nThe Australian Math. Teacher\n, for example\nThe Arithmetic and Algebra of the Natural Numbers\n(1946)\n. Picken's book\nThe Number System of Arithmetic and Algebra\nwas published by Melbourne University Press in\n1923\n.\nA nice account of Picken as Master of Ormond College is given by Sir Zelman Cowen who wrote:-\nMy own experience is I think instructive. When I came to the University of Melbourne in\n1936\nmy ambition, transmitted to me by my mother, was to become a barrister. She stipulated, \"You're to be a boy or a barrister.\" Accordingly, I wished to take a straight law course and embark on the practice of the law as soon as possible. It happened that I'd won a non-resident scholarship to Ormond College in the University, and I was interviewed by the Master of that College, D K Picken, a doughty, Scots Cambridge mathematician. He threw cold water on my hopes of completing my law course as quickly as possible. He told me bluntly that this was misconceived and that I would benefit both educationally and in my personal development if I undertook a combined Arts and Law course. At the time I felt frustrated and vexed that my entry into the legal profession would be delayed for a year. But ever since then I have been deeply grateful for Picken's firm guidance. His insistence that I should broaden my university studies opened up a learning and cultural experience for me in areas in which the university was at its best. I was exposed to its outstanding teachers. It was a truly broad and liberal education and as such, it was to be of inestimable benefit to me.\nPicken was a member of the\nEdinburgh Mathematical Society\n, joining in May\n1903\nand remaining a member during his career in New Zealand and Australia. He served on the Committee of the Society from session\n1904\n-\n5\n, and served as editor of the\nProceedings\nfrom session\n1906\n-\n07\n. He read papers to the Society such as\nA Proof of the Addition Theorem in Trigonometry\nto the meeting on Friday\n9\nDecember\n1904\n,\nOn a Direct Method of Obtaining the Foci and Directrices from the General Equation of the Second Degree\nto the meeting on\n9\nJune\n1905\n,\nOn Simson Line and Related Theory:\nand\nAn Exercise in Geometric Generality\n(\ncommunicated by\nA W Young\n)\non\n8\nMay\n1914\n.\nHe also joined the Wellington Philosophical Society when working in Wellington, New Zealand. He lectured on\nSpherical Geometry and Trigonometry\nto the Society on\n11\nApril\n1911\n. He was on the Council of the Philosophical Society from\n1912\n.",
  "matematicos_citados_na_biografia": [
    "wrangler",
    "THIS LINK",
    "Edinburgh Mathematical Society",
    "A W Young"
  ],
  "imagens": [
    "picken.jpg"
  ]
}