{
  "nome_completo": "David Gawen Champernowne",
  "nome_curto": "David Champernowne",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Champernowne/",
  "data_nascimento": "9 July 1912",
  "local_nascimento": "Oxford, England",
  "data_morte": "19 August 2000",
  "local_morte": "Budleigh Salterton, Devon, England",
  "summary": "David Champernowne was an English economist and mathematician.",
  "biografia": "David Gawen Champernowne\n's parents were Francis Gawayne Champernowne\n(\nborn Dartington, Devon,\n22\nApril\n1866\n; died\n28\nMay\n1921)\nand Isabel Mary Rashleigh\n(\nborn\n20\nAugust\n1884\n; died\n1969)\n. Francis Champernowne had matriculated at Keble College, Oxford in\n1884\nand, after taking his M.A., had become a barrister and had returned to Keble College, Oxford as the bursar. He had married Isabel, the daughter of George Rashleigh, of Riseley, Horton Kirby, Kent. David Champernowne, known to all as Champ, was educated at Winchester College, a famous independent school for boys founded in the\n14\nth\ncentury. This school provided Champernowne with an outstanding education and his favourite subject at school was mathematics. In\n1931\nhe won a scholarship to study mathematics at King's College, Cambridge and matriculated in the autumn of that year. However, he was already showing an interest in economics and, in the summer before going to Cambridge, he read Alfred Marshall's\nPrinciples of Economics\n.\nChampernowne was almost exactly the same age as\nAlan Turing\nand the two young students both matriculated at the same time to study the mathematical tripos at King's College, Cambridge. They quickly became life-long friends. Champernowne quickly made his mark as a brilliant mathematician and proved some beautiful results which we will now describe. A real number is normal if in its representation as a decimal, any arbitrary sequence of digits of length\nt\nt\nt\noccurs, in the limit,\n1\n1\n0\nt\n\\Large\\frac{1}{10^{t}\\normalsize}\n1\n0\nt\n1\n​\ntimes. For example, in a normal number, each single digit occurs, in the limit,\n1\n10\n\\Large\\frac{1}{10}\\normalsize\n1\n0\n1\n​\nof the time. The sequence\n12345\nwill, in a normal number, occur in the limit\n1\n1\n0\n5\n\\Large\\frac{1}{10^{5}\\normalsize}\n1\n0\n5\n1\n​\nof the time. Champernowne was the first to give simply constructed normal numbers. The easiest of these to define is the number\n0\n.\n1234567891011121314151617\n...\nwhich is constructed by concatenating the natural numbers\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n,\n10\n,\n11\n,\n12\n,\n13\n, ... after the decimal point.\nThis number is now known as Champernowne's constant and he published a proof that it is normal is a delightful paper submitted to the\nJournal\nof the\nLondon Mathematical Society\nin April\n1933\n.\nWith such a brilliant start to his undergraduate career, one might have expected Champernowne to carve out for himself a career as a top mathematician. However, one of his lecturers at Cambridge was\nJohn Maynard Keynes\nwho quickly spotted Champernowne's potential and interest in economics. He was also influenced by the economist Dennis Robertson\n(1890\n-\n1963)\nwho was working closely with\nKeynes\nand also teaching at Cambridge. Advised by\nKeynes\n, Champernowne completed his mathematics degree in two years and then embarked on a second degree in economics. From October\n1934\nhis work in economics was supervised by\nKeynes\n. He ended up with two first class degrees, one in mathematics and the other in economics.\nOne has to understand how important new ideas in economics had become around this time. This was a period of unemployment and the Great Depression, which had begun around\n1929\nin the United States, had hit Great Britain hard from\n1930\nonwards. Conventional economics could not cope with the extraordinary events which took place leaving traditional economic theory with no answer.\nKeynes\npublished his most important work, containing the culmination of his ideas, in\nThe General Theory of Employment, Interest and Money\n(1935\n-\n36)\n. Champernowne had already published a number of small articles on economics but his first major work on economics was a review of\nKeynes\n's work which he published in the\nReview of Economic Studies\nin\n1936\n[\n7\n]\n:-\nIn his review article of 'The General Theory', Champernowne argued that, while\nKeynes\nwas correct to stress that wage-earners and employers bargained over money-wages at any moment in time, yet it was expected and desired real wages that they had in mind, taking into account their present and expected future circumstances. If in the event the economy did not deliver the real wages they desired, their actions would be directed to achieving them. Therefore, he argued, the observed trend relationship between unemployment and real wages was determined by the latter actions. He analysed how they reacted in the short period if actual wages were above or below the trend, on which what he called the basic wage prevailed.\nIn November\n1936\nChampernowne submitted his prize fellowship dissertation\nDistribution of income between persons\nto King's College, Cambridge.\nKeynes\nhad suggested that Champernowne:-\n... should search for an explanation of the remarkable degree of conformity with Pareto's law displayed by many statistics of income-distributions published by the taxation authorities of various countries.\nHowever\n[\n2\n]\n:-\nChampernowne went ... far beyond his initial assignment, anticipating for example that progressive taxation brings about a certain downward concavity in what would otherwise be a straight Pareto \"line\" in its upper reaches, and finding this concavity in British data since\n1920\n.\nHarold Lydall explains in\n[\n9\n]\nthat, in his dissertation, Champernowne's:-\n... basic assumptions are, first, that each person possesses certain 'qualifications,' such as his inborn ability, education, and property, from each of which he draws an income; and secondly, that his total income from all sources follows a\nMarkov\nprocess through time. If the probability distribution of each change has certain characteristics, which are constant over time, the income distribution will converge towards a unique equilibrium as time moves towards infinity. If incomes are eternal - e.g., because both personal and property qualifications are passed on from father to son - observed distributions could be regarded as approximations to this long-term equilibrium, in which the cumulative effect of past random changes dominates the original distribution of qualifications.\nIn\n1936\n, after graduating, Champernowne had been appointed as an assistant lecturer at the London School of Economics. He spent two years in this position before returning to Cambridge in\n1938\nas a university lecturer in statistics. A year after he took up this position, World War II broke out. In\n1940\nhe was made a temporary Civil Servant and was assigned to the statistical section of the prime minister's office as an assistant to Frederick Alexander Lindemann, Viscount Cherwell\n(1886\n-\n1957)\n. Lindemann was an excellent physicist but he was a strong supporter of eugenics and held the working class, and various minorities, in contempt. He had, at Winston Churchill's request, set up the statistical section known as 'S-Branch' which daily reported directly to Churchill. Champernowne did not find working for Lindemann easy. Lindemann had proposed saturation bombing of working class areas of German cities and Champernowne showed considerable moral courage to criticise this strategy, both on the grounds that it was not effective and that it was not moral. Champernowne was moved to the Department of Statistics and Programming in the Ministry of Aircraft Production. There he worked under the economist John Jewkes\n(1902\n-\n1988)\nfor the rest of the war.\nAfter the war ended in\n1945\n, Champernowne returned to university positions but not at Cambridge, rather at the University of Oxford where he was appointed as a fellow of Nuffield College, Oxford. He was also made director of the Oxford University Institute of Statistics and, at the Institute he met Wilhelmina Barbara Maria Dullaert, known as Mieke, who was working there. She was the daughter of Petrus Ludovicus Dullaert and his wife Mevrouw. The Dullaert family were from Zutphen in The Netherlands. David Champernowne married Mieke on\n30\nMarch\n1948\nin Oxford; they had two sons Richard and Arthur. In the same year of\n1948\nChampernowne was appointed as professor of statistics at Oxford. As to his research interests at Oxford, he was mainly interested in applying statistical methods to economics. In\n1948\nhe had published the paper\nSampling theory applied to autoregressive sequences\nin the\nJournal\nof the\nRoyal Statistical Society\n. This paper represented the first serious attempt at the application to time-series analysis of the techniques of\nThomas Bayes\n. Frank Cowell writes\n[\n4\n]\n:-\nWhile at Oxford Champernowne pursued his pre-war interest in\nFrank Ramsey\n's\ntheory of probability\n: this led to work on the application of Bayesian analysis to autoregressive series at a time when the Bayesian approach was intellectually unfashionable.\nChampernowne's friendship with\nAlan Turing\nhad continued and, after the war, the two began to investigate writing a computer program to play chess. The program, called Turochamp, was described by Champernowne many years later:-\nMost of our attention went to deciding which moves were to be followed up. My memory about this is infuriatingly weak, Captures had to be followed up at least to the point where no further captures was immediately possible. Check and forcing moves had to be followed further. We were particularly keen on the idea that whereas certain moves would be scorned as pointless and pursued no further others would be followed quite a long way down certain paths. In the actual experiment I suspect we were a bit slapdash about all this and must have made a number of slips since the arithmetic was extremely tedious with pencil and paper. Out general conclusion was that a computer should be fairly easy to programme to play a game of chess against a beginner and stand a fair chance of winning or least reaching a winning position.\nBoth Champernowne and\nTuring\nwere good chess players and Turochamp certainly could not have given them a good game. However, Mieke could not play chess so Champernowne taught his wife the basic moves so that Turochamp might be tested against a total beginner.\nChampernowne did not find the University of Oxford as good an environment as he had the University of Cambridge. In fact, he was prepared in\n1959\nto give up his Oxford chair and return to Cambridge to a lesser position as a Reader in Economics. On his return, he became a fellow of Trinity College. Only after eleven years was he appointed to a personal professorship at Cambridge. In that same year of\n1970\nhe was elected to the British Academy. He held this chair for eight years until he retired in\n1978\n.\nIn addition his famous mathematics paper and to many articles on statistics and economics which he published in journals, Champernowne published three major books. The first of these is the\n3\n-volume treatise\nUncertainty and Estimation in Economics\n(1969)\n. His second major book is\nThe Distribution of Income between Persons\n(1973)\n. This is his prize fellowship dissertation of\n36\nyears earlier, with some additions. The third of these major texts is\nEconomic Inequality and Income Distribution\n(1998)\nwhich he wrote in collaboration with Frank A Cowell of the London School of Economics.\nShort extracts from reviews of these works are given at\nTHIS LINK\nBefore this work was published, Champernowne began to suffer the symptoms of Alzheimer's disease. In\n1995\nhe moved with his wife to Budleigh Salterton so that he might be near his son Richard. He died of bronchial pneumonia and was buried in the family graveyard in St Mary's Church, Dartington. As to his personality and hobbies we quote from\n[\n12\n]\n:-\nHe loved hiking, and at the age of\n74\nmanaged to fulfil a lifelong ambition by scaling Sca Fell. Another passion was music; he had been in the choir at both Winchester and King's College, Cambridge. Though shy, he was defiant of authority and orthodoxy, and to the end a schoolboy at heart.\nNeville Norman, one of Champernowne's Ph.D. students said\n(\nsee\n[\n7\n]\n)\n:-\n[\nHe\n]\nwas completely unselfish ... always wanted to help others. His\n[\nwritings\n]\nwere done to advance \"economics\", or \"thinking\" rather than himself ... the dominant theme of his life.",
  "matematicos_citados_na_biografia": [
    "Alan Turing",
    "London Mathematical Society",
    "John Maynard Keynes",
    "Keynes",
    "Markov",
    "Royal Statistical Society",
    "Thomas Bayes",
    "Frank Ramsey",
    "theory of probability",
    "Turing",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}