{
  "nome_completo": "Demetrios Lambrou Christodoulou",
  "nome_curto": "Demetrios Christodoulou",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Christodoulou/",
  "data_nascimento": "19 October 1951",
  "local_nascimento": "Athens, Greece",
  "data_morte": null,
  "local_morte": null,
  "summary": "Demetrios Christodoulou is a Greek theoretical physicist and mathematician who has made major contributions to general relativity, black holes and shocks in compressible fluids. He has won many major awards including the Shaw Prize.",
  "biografia": "Demetrios Christodoulou\nwas the son of Lambros Christodoulou\n(1913\n-\n1999)\nand Maria Georgiadis\n(1925\n-\n2014)\n. His mother Maria was born in Athens on\n18\nFebruary\n1925\n. Maria's father was from Samsonta in Pontus\n(\nnow called Amisos\n)\nand her mother was from Bithynia. Demetrios's\nfather Lambros was born in Alexandria but Lambros's father Miltiades had come from Agios Theodoros and his mother Eleni from Choirokoitia in Cyprus. In fact, Christodoulou's grandfather's father was named Lambros Pafitis and was born in Letymbou, in the Paphos district of Cyprus. He migrated to Agios Theodoros in the province of Larnaca at the end of the\n19\nth century, due to the very bad economic conditions of that time in the province of Paphos, and changed his surname to Christodoulou.\nDemetrios\nbegan his primary schooling at the Lyceum of Athens, in the Psychico district in north Athens. The school had been founded in\n1936\nbut moved to its location in the Psychico district in\n1952\nwhen Antonis Moraitis became the headmaster. Demetrios continued his secondary education at the same school which was renamed the Moraitis School in\n1976\nbut Demetrios had left long before then. It was when he was in the third grade at this school that he became interested in mathematics, becoming fascinated with Euclidean geometry. In\n1966\n, during the summer between his third and fourth year of high school, Christodoulou tried to find a ruler and compass construction to trisect an angle. Of course, this had been proved impossible, but the young schoolboy was not aware of this\n[\n6\n]\n:-\n[\nChristodoulou\n]\nhimself confesses today that it was his futile attempt to find the non-existent solution that caused him to suspect the immense depth of mathematics.\nDuring the fourth grade at the Lyceum of Athens, he studied National Technical University of Athens textbooks, while he started buying books from the Eleftheroudakis bookstore in Athens containing difficult physics and mathematics exercises and was able to solve all the exercises he found in them.\nThe year\n1968\nwas a highly significant one for Christodoulou who was already achieving fame in Athens. The local papers reported on his fame with headlines like \"Student-\nEinstein\n: High School Student Reads Higher Mathematics and Solves Difficult Problems.\" Spyros Michalopoulos, a mechanical engineer at the National Technical University, was a friend of the Christodoulou family. He was a student and acquaintance of the eminent Greek theoretical physicist Achille Papapetrou who was working at the\nHenri Poincaré\nInstitute in Paris. When Michalopoulos met up with Papapetrou he told him about the remarkable way that Christodoulou was teaching himself advanced mathematics. At the beginning of\n1968\n, Papapetrou invited Christodoulou to Paris for a week so that he might meet with the famous theoretical physicist John Archibald Wheeler\n(1911\n-\n2008)\n. Wheeler, a professor at Princeton University who had studied under\nNiels Bohr\n, was spending research leave in Paris at the time. He suggested that Christodoulou should go to Princeton as a graduate student in theoretical physics. Christodoulou was quick to follow this advice and left the Lyceum of Athens without a high school diploma. From February to September\n1968\nhe prepared for his studies at Princeton.\nIn September\n1968\nChristodoulou began studying for an M.A. at Princeton University which he received in\n1970\n. By this time, however, he already had published his first, highly important, paper. Remo Ruffini writes\n[\n27\n]\n:-\nAfter one year Christodoulou entered the graduate school and started collaborating with me. At the time I was working with Wheeler on the effective potential approach to geodesics co-rotating and counter-rotating in the Kerr metric. In parallel, Frank Zerilli was working on the gravitational radiation emitted by the fall of a test particle in a\nSchwarzschild\nblack hole. A new approach started with the arrival of Demetrios: he was just creating mathematics following his needs. We identified the reversible and irreversible transformations of a\nKerr\nblack hole. Wheeler advanced a thermodynamic analogy. I addressed the need of identifying the concept of irreducible mass and Demetrios's contribution was to integrate, overnight, the differential equation for infinitesimal reversible transformations which led to the finite mass-energy formula of a\nKerr\nblack hole. That evening, while walking back home through the Institute for Advanced Study woods, I expressed to Wheeler the great relevance of the newly found formula by Demetrios and proposed to let Demetrios be the single author of this article, admiring his great mathematical talent. Wheeler agreed.\nThis paper by Christodoulou was\nReversible and irreversible transformations in black hole physics\n(1970)\n. He writes in\n[\n28\n]\n:-\nWhen I first presented\n[\nthe paper\n]\n, Wheeler, seeing that a new chapter was opening, the thermodynamics of black holes, became so excited that he set off firecrackers. He had, you know, a particular love of explosions.\nThe paper has the acknowledgement:-\nI would like to thank Professor J A Wheeler and Dr R Ruffini for very helpful discussions and suggestions.\nChristodoulou and Ruffini continued working with the solution that Christodoulou had found and published the joint paper\nReversible transformations of a charged black hole\n(1971)\n. It has the following Abstract:-\nA formula is derived for the mass of a black hole as a function of its \"irreducible mass,\" its angular momentum, and its charge. It is shown that\n50\n% of the mass of an extreme charged black hole can be converted into energy as contrasted with\n29\n% for an extreme rotating black hole.\nAt the age of\n19\n, just three years after entering Princeton, Christodoulou completed a doctoral thesis under the supervision of John Archibald Wheeler and Remo Ruffini. The title of his thesis was\nInvestigation in gravitational collapse and the physics of black holes\n. In it he shows that the area of a black hole is proportional to its entropy. The Abstract begins:-\nThis thesis deals with the physics of gravitational collapse and its final states, the collapsed objects called black holes. We know that a star, that is at the end point of thermonuclear evolution, will be unstable against gravitational collapse if its mass is larger than a certain critical mass. Will radiation be similarly unstable above a certain critical mass-energy and undergo gravitational collapse? This question is treated in Chapter II, in considering an imploding and re-exploding scalar pulse of radiation, and is answered in the affirmative.\nWill a black hole always be stationary? Will the physics of the dynamical region inside the event horizon never come into play? No - in Chapter III it is shown that the dynamics of the interior geometry comes into play in the final stages of collapse of the Universe itself, and the\nSchwarzschild\nsingularity is amalgamated into the\nFriedmann\nsingularity.\nIn Chapter V, we show various processes that extract energy from a rotating black hole. The first such method was investigated by\nR Penrose\n. Here, the concepts of irreducible mass and of reversible and irreversible transformations in black holes are introduced. ...\nThe thesis was examined by a committee which included\nEugene Paul Wigner\n, John Archibald Wheeler and Remo Ruffini. Christodoulou graduated with a Ph.D. from Princeton in\n1971\n.\nFollowing the award of his doctorate, Christodoulou was appointed as a Research Fellow at the California Institute of Technology where he spent the academic year\n1971\n-\n72\n. He continued to work with Remo Ruffini and published papers such as\nThe electrodynamics of collapsed objects\nin\n1973\n. It has the following Abstract:-\nThe details of the magnetic and electric field to be expected in a collapsed object nonradioactive at infinity\n(\n\"Black Hole\"\n)\nare here given. Also given are the formulae determining the maximum total energy extractable from a collapsed object and the definition of its angular velocity as seen from infinity. Physical meaning is given to the expression of the surface area. Typical order of magnitude of the preceding quantities for collapsed objects of different masses are here estimated.\nHe returned to Greece in\n1972\nwhen he was appointed as a Professor of Physics at the National and Kapodistrian University of Athens. In January\n1973\nthere was the following announcement of the engagement of Demetrios Christodoulou and Kathleen Kelly\n[\n31\n]\n:-\nMr and Mrs Frank R Kelly of South Pasadena announce the engagement of their daughter, Kathleen, to Dr Demetrios L Christodoulou of Athens, Greece. Kathleen is a graduate of South Pasadena High and Pasadena City College. She will be continuing her studies in nutrition at the University of Athens. Dr Christodoulou is the son of Mr and Mrs Lambros Christodoulou of Athens. He received his degrees from Princeton University, lectured at California Institute of Technology and returned to Athens last fall to accept the\n2\nnd Chair of the Theoretical Physics Department, University of Athens. The wedding will be held the evening of\n8\nMarch, in historical settings in Athens. The couple will visit the Isle of Rhodes and then return to Athens to make their home.\nDemetrios and Kathleen Christodoulou had two children, Penelope Christodoulou and Alexandra Christodoulou. Let us note at this point that Demetrios and Kathleen Christodoulou were divorced in May\n1995\nand Demetrios married Nikoleta Sigala, on\n12\nJune\n1997\n.\nAlthough Demetrios and Kathleen Christodoulou made their home in Athens after their honeymoon on Rhodes, they moved to Geneva in Switzerland before the end of\n1973\nwhere Christodoulou spent a year as a Visiting Scientist at CERN. It was in\n1952\nthat CERN, the European Council for Nuclear Research, was set up and the site in Geneva was chosen. By the time Christodoulou visited CERN, they had made great steps forward with the announcement of the first colliding protons being detected. After the year at CERN, Christodoulou moved to the International Centre for Theoretical Physics in Trieste where he spent two years\n1974\n-\n76\n. While there he published\nThe chronos principle\n(1975)\nwith Abstract:-\nThe definition of time is established as a fundamental physical principle. From this principle, in connection with the quantum and relativity principles, the laws of quantum geometrodynamics and, in the classical limit, those of general relativity theory, are uniquely deduced.\nIn\n1976\nChristodoulou became a fellow of the Humboldt Foundation and spent the following five years at the\nMax Planck\nInstitute for Theoretical Astrophysics in Munich. Up to this time, although he had shown great mathematical skills, his work had been in theoretical physics. It was while he was at the\nMax Planck\nInstitute, however, that his interests turned more to mathematics. Partly, this was because mathematics had always had great appeal to him, but partly it was due to Jürgen Ehlers, the director of its gravitational theory department at the\nMax Planck\nInstitute, who saw the enormous potential in Christodoulou's mathematical skills. Christodoulou wrote\n[\n5\n]\n:-\nA decisive turn in my career came in\n1977\n, at a time when I was a postdoctoral fellow at the\nMax Planck\nInstitute for Astrophysics in Munich. There, Jürgen Ehlers, the leader of the group in which I was working, although himself a physicist, realised that I had a talent in mathematics and gave me an unlimited leave of absence with pay to study mathematics in Paris under the guidance of\nYvonne Choquet-Bruhat\n. Thus, I finally found my true calling and in the period\n1977\n-\n1981\nI studied mathematical analysis in the French school.\nHe began a collaboration with the Italian mathematician Mauro Francaviglia\n(1953\n-\n2013)\nwho was based in Turin and worked on applying methods of differential geometry to problems in mathematical physics. For example they published the joint paper\nRemarks Concerning the Solution of the Equations of Quantum Geometrodynamics by Successive Approximation\nin\n1977\n. The paper ends with the following Acknowledgement:-\nThis work was sponsored by the \"Seminario Matematico dell'Università e Politecnico di Torino.\" We wish to express our gratefulness to Professor D Galletto and to Professor T Zeuli, who invited one of us\n(\nD Christodoulou\n)\nto Turin, making our collaboration easier.\nAnother joint paper by Christodoulou and Francaviglia in\n1977\nwas\nRemarks about the thin sandwich conjecture\n. It has the following Abstract:-\nThe thin sandwich conjecture in the initial value problem of general relativity is investigated by means of differential geometrical methods, in connection to the definition of arc length in a Wheeler superspace. The conjecture is proved to be false by good physical reasons. Its failure on a flat space is related to the \"functional dimension\" of the superspace and to the behaviour in the linearised theory of quantum gravitation.\nStudying with\nYvonne Choquet-Bruhat\nin Paris led to the three author paper\nCauchy data on a manifold\n(1978)\nby\nYvonne Choquet-Bruhat\n, Demetrios Christodoulou and Mauro Francaviglia. The same three authors published\nOn the wave equation in curved spacetime\n(1979)\n.\nIn\n1981\nChristodoulou returned to the United States when he spent two years as a visiting member of the\nCourant\nInstitute in New York. The year\n1981\nalso marks the time when he received his first major award, namely the Otto Hahn Medal awarded by the\nMax Planck\nSociety in June of that year. Soon after arriving back in the United States, he met\nShing-Tung Yau\n. In\n[\n7\n]\nhe explains the importance of this meeting:-\nI first met\nYau\nin September\n1981\n. I had arrived in New York from Germany a few days earlier for what turned out to be a\n2\n-year visiting membership at the\nCourant\nInstitute. I knew the Princeton area well because I had been a Ph.D. student in physics in the period\n1968\n-\n1971\n, so I looked for housing there, the plan being to commute by train to New York. I sought people at the University and at the Institute and\nYau\nwas one of the first people I met. ... my working mathematical knowledge at that point was limited to the field of analysis. I had no working knowledge of geometry.\nYau\n's directness of character and his hands on approach to mathematical problems, cutting through formalities to get to the heart of the matter, won me over from the beginning. He was giving a course on minimal surface theory and applications, in particular the application in the proof of the positive mass theorem, a course which continued for the next academic year. So I decided to stay most of each week at Princeton, follow his course, and learn as much as I could from him.\nFor twelve years, after the award of his doctorate in\n1971\nuntil\n1983\n, Christodoulou had postdoctoral positions, visiting positions and fellowships. His last visiting position in these years was from January to June\n1983\nat the School of Mathematics at the Institute for Advanced Study at Princeton. Only in September\n1983\ndid he accept a permanent faculty appointment when he was appointed as Associate Professor of Physics at Syracuse University in Syracuse, New York State about\n300\nkm north of New York City.\nYau\narranged for Christodoulou to be a member of the School of Mathematics at the Institute for Advanced Study from January to June\n1984\n. He managed to fit this in with his lecturing duties at Syracuse University by having all his lectures in the first part of each week, flying to Newark each Wednesday evening and then bus to Princeton. He flew back to Syracuse each Sunday evening.\nIn the spring of\n1985\n, Christodoulou changed departments at Syracuse when he became Professor of Mathematics there. He was given study leave from January to August\n1986\nwhich he spent at the University of California San Diego, working with\nYau\n. Also in San Diego at this time was\nRichard Hamilton\nwith whom he would later share the Shaw Prize. By\n1986\nChristodoulou was already working with Sergiu Klainerman on the problem of the global nonlinear stability of the\nMinkowski\nspacetime. This led to a number of papers and the jointly authored book\nThe global nonlinear stability of the Minkowski space\n(1993)\n. Even before the book was published, his work with Klainerman was one of the factors leading to Christodoulou receiving the Basilis Xanthopoulos Award in\n1991\n. It was awarded\n[\n29\n]\n:-\n... for his many basic contributions to rigorous mathematical results in the general theory of relativity. They include: i\n)\nthe boost theorems which establish the existence of a large class of solutions to\nEinstein\n's\n(\nand Yang-Mills\n)\nequations in a region obtained by boosting the initial\nCauchy\nsurface a finite amount; ii\n)\na complete mathematical analysis of the spherical collapse of a scalar field including the structure of the horizons and singularities; and iii\n)\nhis work with Klainermann on the global existence of solutions to\nEinstein\n's equations with weak initial data.\nBy the time he won this award, Christodoulou had left Syracuse and returned to the\nCourant\nInstitute where he was Professor of Mathematics from\n1988\nto\n1992\n.\nPeter Lax\n, who worked at the\nCourant\nInstitute for most of his career, was delighted to see Christodoulou back. Speaking of Christodoulou,\nLax\nsaid\n[\n32\n]\n:-\nFortunately, after\n2300\nyears, the Greeks have returned to mathematics!\nChristodoulou moved to Princeton in\n1992\nwhen he was appointed as Professor of Mathematics there. In\n1993\nhe was awarded the prestigious MacArthur Fellows Award which supported his work over the following five years.\nIn\n2001\nhe made his final move, going back to Europe to become Professor of Mathematics and Physics at ETH Zurich. He retired in\n2017\n, remaining in Zurich as Professor Emeritus.\nAfter taking up the professorship in Zurich, Christodoulou began to study the formation of shocks in compressible fluids. Although this appears at first sight to be quite a different problem to the equations of general relativity, in fact there are strong similarities, both leading to nonlinear systems of hyperbolic type. The \"shocks\" problem led to his book\nThe Formation of Shocks in\n3\n-Dimensional Fluids\n(2007)\nwhile the related problems for general relativity are contained in his book\nThe Formation of Black Holes in General Relativity\n(2009)\n.\nFor information about these books and other books by Christodoulou, see\nTHIS LINK\n.\nWe have mentions some awards made to Christodoulou but let us now briefly mention some more. In\n1999\nthe\nAmerican Mathematical Society\nawarded Demetrios Christodoulou the\nBôcher\nPrize:-\n... for his contributions to the mathematical theory of general relativity.\nIn January\n2000\nDemetrios Christodoulou was awarded the Zenon Prize by the Mathematical Society of Cyprus. He was awarded the Bodossaki Excellence Award in\n2006\n:-\n... for his considerable contribution to the theory of general relativity and gravity.\nThe\n2008\nTomalla Prize was awarded to Demetrios Christodoulou:-\n... for his important contributions to general relativity, especially for his rigorous demonstration of global non-linear stability of Minkowski spacetime.\nThe\n2011\nShaw Prize was awarded jointly to Demetrios Christodoulou and\nRichard S Hamilton\n:-\n... for their highly innovative works on nonlinear partial differential equations in Lorentzian and Riemannian geometry and their applications to general relativity and topology.\nIn\n2016\nhe was awarded the Nemitsas Foundation Prize for Mathematics. Following that, he was next awarded the\nHenri Poincaré\nPrize in Mathematical Physics\n2021\n:-\n... for pathbreaking contributions to mathematical understanding of the\nEinstein\nequations, including fundamental results on black hole formation and the discovery of a nonlinear memory effect in the theory of gravitational radiation, and for introducing a powerful geometric point of view for the problem of shock formation for compressible fluids.\nChristodoulou was awarded a\n2021\nMarcel Grossmann\nAward by the International Centre for Relativistic Astrophysics:-\n... for his many lasting contributions to the foundation of mathematical physics including the dynamics of relativistic gravitational fields.\nFor more information about all these awards to Christodoulou, see\nTHIS LINK\n.\nFinally let us mention other honours given to Christodoulou. These include: Honorary Doctorate in the Sciences, University of Athens\n(\nJune\n1996)\n; Honorary Doctorate in the Sciences, National Technical University of Athens\n(\nMay\n2000)\n; elected to the\nAmerican Academy of Arts and Sciences\n(\nApril\n2001)\n; Honorary Doctorate in the Sciences, Brown University\n(\nMay\n2001)\n; Honorary Doctorate in the Sciences, University of Cyprus\n(\nMay\n2003)\n; Honorary Doctorate in the Sciences, Aristotle University of Thessaloniki\n(\nMay\n2010)\n; elected to the U.S.\nNational Academy of Sciences\n(\nMay\n2012)\n; elected a fellow of the\nAmerican Mathematical Society\n(\nNovember\n2012)\n; elected to the Academia Europea\n(\nJune\n2016)\n; and Honorary Professor, Department of Physics, University of Crete\n(\nOctober\n2023)\n.",
  "matematicos_citados_na_biografia": [
    "Einstein",
    "Henri Poincaré",
    "Niels Bohr",
    "Schwarzschild",
    "Kerr",
    "Friedmann",
    "R Penrose",
    "Eugene Paul Wigner",
    "Max Planck",
    "Yvonne Choquet-Bruhat",
    "Courant",
    "Shing-Tung Yau",
    "Yau",
    "Richard Hamilton",
    "Minkowski",
    "Cauchy",
    "Peter Lax",
    "Lax",
    "THIS LINK",
    "American Mathematical Society",
    "Bôcher",
    "Richard S Hamilton",
    "Marcel Grossmann",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences"
  ],
  "imagens": [
    "christodoulou.jpg"
  ]
}