{
  "nome_completo": "Diocles",
  "nome_curto": "Diocles",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Diocles/",
  "data_nascimento": "about 240 BC",
  "local_nascimento": null,
  "data_morte": "about 180 BC",
  "local_morte": null,
  "summary": "Diocles was a Greek mathematician who was the first to prove the focal property of a parabolic mirror and studied the cissoid curve as part of an attempt to duplicate the cube.",
  "biografia": "Diocles\nwas a contemporary of\nApollonius\n. Practically all that was knew about him until recently was through fragments of his work preserved by\nEutocius\nin his commentary on the famous text by\nArchimedes\nOn the sphere and the cylinder\n. In this work we are told that Diocles studied the cissoid as part of an attempt to\nduplicate the cube\n. It is also recorded that he studied the problem of\nArchimedes\nto cut a sphere by a plane in such a way that the volumes of the segments shall have a given ratio.\nThe extracts quoted by\nEutocius\nfrom Diocles'\nOn burning mirrors\nshowed that he was the first to prove the focal property of a parabolic mirror. Although Diocles' text was largely ignored by later Greeks, it had considerable influence on the Arab mathematicians, in particular on\nal-Haytham\n. Latin translations from about\n1200\nof the writings of\nal-Haytham\nbrought the properties of parabolic mirrors discovered by Diocles to European mathematicians.\nRecently, however, some more information about Diocles' life has come to us from the Arabic translation of Diocles'\nOn burning mirrors\nwhose discovery is described below. From this work we learn that\nZenodorus\ntravelled to Arcadia and entered into discussions with Diocles, so that certainly Diocles was working in Arcadia at the time. This may not seem a very major centre of mathematical importance at the time for such an outstanding scholar as Diocles to be working in, but as Toomer writes in\n[\n4\n]\n:-\nIt would be wrong to conclude from this that Archadia was a cultural centre in this period ... : the whole of the introduction confirms the impression we derive from other contemporary sources, that mathematics during the Hellenistic period was pursued, not in schools established in cultural centres, but by individuals all over the Greek world, who were in lively communication with each other both by correspondence and in their travels.\nLet us quote from Diocles' introduction to\nOn burning mirrors\nin the translation by Toomer\n[\n4\n]\n:-\nPythian the Thasian geometer wrote a letter to\nConon\nin which he asked him how to find a mirror surface such that when it is placed facing the sun the rays reflected from it meet the circumference of a circle. And when\nZenodorus\nthe astronomer came down to Arcadia and was introduced to us, he asked us how to find a mirror surface such that when it is placed facing the sun the rays reflected from it meet a point and thus cause burning.\nToomer notes that his translation of\nwhen\nZenodorus\nthe astronomer came down to Arcadia and was introduced to us\ncould, perhaps, be translated\nwhen\nZenodorus\nthe astronomer came down to Arcadia and was appointed to a teaching position there\n.\nIt is only recently that an Arabic translation of Diocles\nOn burning mirrors\nhas been found in the Shrine Library in Mashhad, Iran. No writing of Diocles was known to\nHeath\nin\n1921\nwhen he wrote\n[\n3\n]\n, but Toomer translated and published the newly found Arabic translation of the lost treatise\nOn burning mirrors\nby Diocles in\n1976\n.\nIt has been noticed that\nOn burning mirrors\nis loosely in three parts, for three separate topics are studied. These three topics are burning mirrors,\nArchimedes\n' problem to cut a sphere by a plane, and duplicating the cube. Sesiano\n(\nsee\n[\n4\n]\n)\nhas suggested that we may have three short works by Diocles combined into one work and this would have a certain attraction since the title\nOn burning mirrors\nfails to reflect properly the contents of the whole. If Sesiano's suggestion is correct then we know that the three were combined early on since by the time of\nEutocius\nthey formed a single work.\nOn burning mirrors\nis a collection of sixteen propositions in geometry mostly proving results on\nconics\n. It is thought that three of the propositions are later additions to the text, while the remaining ones give a remarkable insight into the theory of conics in the early second century BC.\nThe first of these propositions proves what has long been known to have been first established by Diocles, namely the focal property of the\nparabola\n. The next two propositions give properties of spherical mirrors and with Propositions\n4\nand\n5\ngiving the\nfocus directrix\nconstruction of the parabola. These constructions are again properties of the parabola that Diocles was the first to give.\nThe problem of\nArchimedes\nto cut a sphere in a given ratio which was known to be in the work through the writing of\nEutocius\nreferred to above is studied in Propositions\n7\nand\n8\n. The duplication of the cube problem, again referred to by\nEutocius\n, is studied by Diocles in Proposition\n10\n. The next two propositions solve the problem of inserting two mean proportions between a pair of magnitudes using the cissoid curve which was invented by Diocles. The final three propositions solve generalisations of the duplication of the cube problem using the cissoid, and another problem of the two mean proportionals type.\nThere are other fascinating deductions that Toomer makes as editor of\n[\n4\n]\n. A study of the work lead him to claim, contrary to what has long been believed, that the terms \"\nhyperbola\n\", \"parabola\", and \"\nellipse\n\" were introduced into the theory of conics before the time of\nApollonius\n.\nIn\nOn burning mirrors\nDiocles also studies the problem of finding a mirror such that the\nenvelope\nof reflected rays is a given caustic curve or of finding a mirror such that the focus traces a given curve as the Sun moves across the sky. The solution of this problem would, of course, have interesting consequences for the construction of a sundial.\nNeugebauer\n, in an appendix to\n[\n4\n]\n(\nsee also\n[\n6\n]\n)\n, shows that this problem cannot be solved exactly while in\n[\n5\n]\nHogendijk shows that, using methods available to Diocles, the problem can be solved approximately. Hogendijk in\n[\n5\n]\nthen considers the interesting possibility that Diocles gave arguments of this type in the original text but that later copiers of the text could not understand this part so omitted it.",
  "matematicos_citados_na_biografia": [
    "Apollonius",
    "Eutocius",
    "Archimedes",
    "duplicate the cube",
    "al-Haytham",
    "Zenodorus",
    "Conon",
    "Heath",
    "conics",
    "parabola",
    "focus directrix",
    "hyperbola",
    "ellipse",
    "envelope",
    "Neugebauer"
  ],
  "imagens": []
}