{
  "nome_completo": "Dmitrii Evgenevich Menshov",
  "nome_curto": "Dmitrii Menshov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Menshov/",
  "data_nascimento": "18 April 1892",
  "local_nascimento": "Moscow, Russia",
  "data_morte": "25 November 1988",
  "local_morte": "Moscow, Russia",
  "summary": "Dmitrii Menshov was a Russian mathematician known for his contributions to the theory of trigonometric series.",
  "biografia": "Dmitrii Evgenevich Menshov\n's father, Evgenii Titovich Menshov, was a medical doctor who worked in the New Ekaterininskii Hospital and the Lazarevskii Institute of Oriental Languages. His mother, Alexandra Nikolaevna Tatishcheva, was an important early influence in Menshov's education. She was a highly educated woman who, as well as educating her son, also sometimes gave French lessons to other children.\nIn\n1904\n, at the age of\n12\nyears, Menshov began his secondary schooling. He attended the\ngymnasium\nsection of the Lazarevskii Institute of Oriental Languages where his father acted as school doctor. Influenced by his mother's tuition in foreign languages, Menshov's first love at school was indeed for languages. He went on to study French, German, English, Latin, and Armenian at school. However, Menshov had an outstanding mathematics teacher and, like many children who are influenced by an outstanding teacher, Menshov began to show a strong interest in mathematics from about the age of\n13\n. He also was strongly attracted to physics so, with wide interests across many subjects, he graduated from the school in\n1911\nwith the gold medal for outstanding achievement.\nAfter leaving school, Menshov sat the entrance examination for the Moscow Engineering College and began his studies there in the autumn of\n1911\n. However he only studied there for six months before deciding to leave and work on his own on learning advanced mathematics. Then in the autumn of\n1912\nMenshov entered the Department of Physics and Mathematics at Moscow University. There he attended lectures by\nEgorov\n, Lakhtin,\nAndreev\nand he took his first course on functions of a real variable given by Byushgens. Perhaps the most significant event for Menshov, however, was that\nLuzin\nreturned from Göttingen to Moscow in the autumn of\n1914\nand began to lecture on functions of a real variable.\nMenshov attended\nLuzin\n's lecture course, and when\nLuzin\nposed the open problem of whether the\nDenjoy\nintegral and the\nBorel\nintegral were equivalent, he was able to solve the problem. The\nDenjoy\nintegral is the more general of the two and Menshov showed that this was the case. He showed\nLuzin\nhis solution to the problem that\nLuzin\nhad just posed and before the end of\n1914\nthe two had begun a firm mathematical friendship. Menshov's discovery, made while still an undergraduate, became his first publication. It appeared as the paper\nThe relationship between the definitions of the\nDenjoy\nand\nBorel\nintegrals\nin\n1916\n.\nLuzin quickly established a School of Mathematics at Moscow University and Menshov became one of his fist research students along with\nP S Aleksandrov\n,\nM Ya Suslin\n, and\nA Ya Khinchin\n. Menshov's first degree was awarded in\n1916\nfor the thesis which he wrote on\nThe Riemann theory of trigonometric series\nwhich was examined by\nEgorov\nand\nLuzin\n. However, only three weeks after he graduated, Menshov discovered one of his most fundamental results on the uniqueness problem for trigonometric series. Let us describe this result.\nConsider the trigonometric series\n1\n2\na\n0\n+\n∑\n(\na\nn\ncos\n⁡\nn\nx\n+\nb\nn\nsin\n⁡\nn\nx\n)\n\\large\\frac{1}{2}\\normalsize a_{0} + \\sum  (a_{n}\\cos nx + b_{n}\\sin nx)\n2\n1\n​\na\n0\n​\n+\n∑\n(\na\nn\n​\ncos\nn\nx\n+\nb\nn\n​\nsin\nn\nx\n)\n.\nCantor\nhad proved that if this series converges to\n0\nfor all\nx\nx\nx\nin\n[\n<\n!\n>\n0\n,\n2\nπ\n]\n−\nE\n[<!>0, 2\\pi] - E\n[\n<\n!\n>\n0\n,\n2\nπ\n]\n−\nE\n, for a countable set\nE\nE\nE\n, then\na\nn\n=\nb\nn\n=\n0\na_{n} = b_{n} = 0\na\nn\n​\n=\nb\nn\n​\n=\n0\nfor all\nn\nn\nn\n.\nVallée Poussin\nhad proved that if the above series converged to a finite\nLebesgue\nintegrable function\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nthen the given series is the\nFourier series\nof\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\n. It was expected that\nVallée Poussin\n's result would still hold if the countable set\nE\nE\nE\nwas replaced by a set\nE\nE\nE\nof measure zero. The remarkable, and unexpected, result that Menshov discovered in\n1916\nwas that this was not so, for he constructed a trigonometric series which converges to\n0\nfor all\nx\nx\nx\nin\n[\n<\n!\n>\n0\n,\n2\nπ\n]\n−\nE\n[<!>0, 2\\pi] - E\n[\n<\n!\n>\n0\n,\n2\nπ\n]\n−\nE\n, for a set\nE\nE\nE\nof measure zero, yet not all the coefficients of the trigonometric series are zero.\nBy the end of\n1918\nMenshov had been awarded his Master's degree and he went to Ivanovo north-east of Moscow, which at that time was the temporary capital of the revolutionary government, but he soon moved to Nizhnii-Novgorod where he was appointed as a professor at the University. He taught at Nizhnii-Novgorod during\n1919\nand early\n1920\nbut he returned to Ivanovo in May\n1920\nwhere he was appointed as a professor at the Ivanovo Pedagogic Institute. In addition to this appointment he also taught at the Polytechnic Institute at Ivanovo from January\n1921\n. At this time\nLuzin\nand other members of his research school were in Ivanovo so Menshov was certainly in the mainstream of the exciting mathematics that was being developed.\nIn the autumn of\n1922\nMenshov returned to Moscow and began teaching at the University. He also taught for a few years at the Moscow Institute of Forest Technology. It may have been noticed by an attentive reader that we have still not noted that Menshov being awarded a doctorate\n(\nequivalent to the\nhabilitation\nor D.Sc.\n)\n. In fact he never submitted a thesis for a doctorate but, despite this, he was awarded the doctorate in\n1935\nsince\n(\n[\n1\n]\nor\n[\n2\n]\n)\n:-\n... he had already been acknowledged as one of the world's most outstanding specialists on the theory of functions of a real and a complex variable.\nTogether with the award of the doctorate came Menshov's appointment to a professorship at Moscow University.\nIn\n1933\na new chair of Analysis and Theory of Functions was created at Moscow University and\nLavrent'ev\nappointed. In\n1938\nthe Faculty of Mechanics and Mathematics at Moscow University founded two chairs, the chair of the Theory of Functions and the chair of\nFunctional Analysis\n.\nPrivalov\nheld this first chair up to\n1941\nbut then, on\nPrivalov\n's early death in that year, Menshov was appointed to the chair of the Theory of Functions. Lusternik held the chair of Functional Analysis from\n1938\n. In\n1943\nthese two chairs were combined and the Department of Theory of Functions and Functional Analysis was created with Menshov as its head. Menshov also worked a the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\nfrom\n1934\nto\n1941\nand then again from\n1947\n.\nMenshov's mathematical interests and the style of his mathematics is described in\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\nHis scientific interests relate principally to the theory of trigonometric series, the theory of orthogonal series and the problem of monogenity of functions of a complex variable. He published more than eighty papers on these subjects, which have had an exceptionally great effect on the development of the whole theory of functions. Menshov does not belong among the ranks of those mathematicians who undertake the solution of comparatively easy problems, or who continue the research of other authors on a course that has already been indicated. A characteristic feature of scientific activity is that in his work on the theory of functions he solved a number of extremely difficult key problems which had baffled many eminent mathematicians.\nFor his work on the representation of functions by trigonometric series, Menshov was awarded a State Prize in\n1951\n. He was then elected a Corresponding Member of the\nUSSR Academy of Sciences\nin\n1953\n. In\n1958\nMenshov attended the International Congress of Mathematicians in Edinburgh and he was invited to address the Congress with his paper\nOn the convergence of trigonometric series\n.\nThe first of the two pictures of Menshov which we have given was taken while he was at the Congress in Edinburgh, Scotland in\n1958\n.",
  "matematicos_citados_na_biografia": [
    "gymnasium",
    "Egorov",
    "Andreev",
    "Luzin",
    "Denjoy",
    "Borel",
    "P S Aleksandrov",
    "M Ya Suslin",
    "A Ya Khinchin",
    "Cantor",
    "Vallée Poussin",
    "Lebesgue",
    "Fourier series",
    "habilitation",
    "Lavrent'ev",
    "Functional Analysis",
    "Privalov",
    "Steklov",
    "USSR Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}