{
  "nome_completo": "Jean-Dominique Comte de Cassini",
  "nome_curto": "Dominique Cassini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cassini_Dominique/",
  "data_nascimento": "30 June 1748",
  "local_nascimento": "Paris, France",
  "data_morte": "18 October 1845",
  "local_morte": "Thury, France",
  "summary": "Dominique Cassini ( Cassini IV ) was a French mathematician and surveyor who worked on his father's map of France.",
  "biografia": "Dominique Cassini\nwas the son of\nCésar-François Cassini de Thury\n, the grandson of\nJacques Cassini\nand the great-grandson of\nGiovanni Domenico Cassini\n. Dominique Cassini is also known as Cassini IV. His mother, Charlotte Drouin de Vandeuil, married César-François Cassini in\n1747\nand they lived in the Paris Observatory where Jacques Cassini was effectively the director, although this official position was only created somewhat later. Dominique was born in the Observatory and was the eldest of his parents two children. He had a younger sister Françoise-Elisabeth. When he was eight years old his grandfather\nJacques Cassini\ndied.\nDominique received his early education in the Paris Observatory, then he attended the Collège du Plessis in Paris and the Collège Oratorien run by the Congregation of the Oratory at Juilly. The Congregation of the Oratory of Jesus and Mary Immaculate had been founded by Pierre de Bérulle in\n1611\nwith one of the main aims being to give an education to train candidates for the priesthood. Dominique Cassini, however, did not wish to join the priesthood but wished to follow in the family tradition, so he continued his education by studying physics, mathematics and astronomy.\nHe sailed on a scientific voyage in\n1768\n, given the task of testing a new marine chronometer invented by Pierre Le Roy which, if successful, would allow ships to determine their longitude while at sea. The voyage took him to America, then to the coast of Africa, and finally back to Brest. In\n1770\nhe published an account of his voyage in\nVoyage fait par ordre du roi en\n1768\npour éprouver les montres marines inventées par M Le Roy\nⓉ\n(\nA voyage done by order of the king in\n1768\nto test the marine watches invented by M Le Roy\n)\n. In the same year of\n1770\n, actually on\n23\nJuly, Cassini was elected to the\nAcadémie des Sciences\n.\nIn\n1771\nCassini's father,\nCassini de Thury\n, was made Director of the Paris Observatory by the King with the conditions that succession would be preserved for the Cassini family. At this stage Cassini knew that he would become Director of the Observatory on the death of his father and so he lived his life with this in mind. As he was growing up he always knew that his father's major project was the map of France and in the\n1770\ns he began to become more and more involved in assisting his father with the project.\nIn\n1773\nCassini married Claude-Marie-Louise de la Myre-Mory. They had five children Cécile, Angélique, Aline, Alexis, and Alexandre Henri Gabriel who became a botanist. After the death of his father in\n1784\n, Cassini assumed the role of Director of the Paris Observatory. He persuaded King Louis XVI to restore the Observatory and he began a reorganisation of its operation. His first task, however, was to complete the project his father had laboured on for so many years, namely the map of France. Only two sheets of Brittany required completion but the project was not finished until\n1790\nwhen Cassini presented the map to the National Assembly.\nWhile he was completing his father's map, Cassini worked on another surveying project. In\n1787\nhe was involved in a joint project with English scientists to determine the precise distance between the observatories at Greenwich and at Paris. This would allow extremely useful scientific results to be obtained by combining data from the two observatories. The Government appointed Cassini as a commissioner, along with\nLegendre\nand\nMéchain\n, to triangulate the French side. The English side would be surveyed using\nRamsden\n's theodolite while the French proposed using\nBorda\n's repeating circle.\n[\nSee\nBorda\n's biography for a description of the repeating circle.\n]\nA picture of the Borda repeating circle is at\nTHIS LINK\n. Cassini had\nMéchain\nas his assistant but he took control and made the measurements with the repeating circle while\nMéchain\nwas given the task of checking the results with older equipment. Cassini was very impressed with the accuracy of the\nBorda\nrepeating circle writing\n(\nsee\n[\n2\n]\n)\n:-\nUsually in the arts and sciences, the closer one approaches perfection, the more the number of difficulties multiply and accumulate; so that one is sometimes tempted to think that there is a limit beyond which even the genius and hand of man cannot cross, were not that unhoped for success\n[\nthe\nBorda\ncircle\n]\ndid not come to reanimate our trust, and prove to us that nothing is impossible for men of inquiry and perseverance.\nOn the morning of\n14\nJuly\n1789\na mob of armed men advanced on the Bastille wanting the arms and munitions stored there. The prison governor refused them entry and the mob stormed and captured the State Prison, an action which came to signify the end of the ancien régime and the beginning of the French Revolution. Two days later, around\n300\narmed men forced their way into the Paris Observatory looking for food, arms and munitions. They forced Cassini to take them into the cellars beneath the building but they found nothing of use to them. They removed lead from the roof to use to make ammunition.\nIn\n1791\ntragedy struck Cassini when his wife died and he was left with five young children to bring up. At this time the\nAcadémie des Sciences\nwas setting up its project to accurately measure the meridian from Dunkerque to Barcelona in order to obtain an accurate value for the metre which was to be defined as one ten millionth of the distance from the North Pole to the equator. Although\nCassini de Thury\nhad surveyed almost exactly this in\n1740\n, it was the invention of the\nBorda\nrepeating circle which made the\nAcademy\nconfident that a new much more accurate measurement could be achieved. In April\n1791\nthe\nAcademy\nappointed Cassini,\nLegendre\nand\nMéchain\nto carry out the task. On\n19\nJune Cassini,\nLegendre\n,\nMéchain\n, and\nBorda\nhad an audience with King Louis XVI. Cassini later reported his conversation with the King who asked:-\nWill you again measure the meridian your father and grandfather measured before you? Do you think you can do better than they?\nCassini replied:-\nSire, I would not flatter myself to think I could surpass them had I not a distinct advantage. My father and grandfather's instruments could but measure to within fifteen seconds; the instrument of M\nBorda\nhere can measure to within one second.\nThe day after their meeting the King fled to Varennes but was recognised and arrested. Cassini felt deep loyalty to the King, but none to the revolutionary forces now in control of France. He was supposed to set out to measure the northern part of the meridian, but he was reluctant to do so now that he had to bring up his five young children himself. He still felt that tradition required him to lead the expedition and so he proposed that he remain in command in Paris while assistants undertook the surveying. The\nAcademy\ndid not wish this arrangement, believing that he could not command the project without knowledge of the day to day work, so in May\n1792\nhe was replaced by\nDelambre\n.\nThings were becoming more and more difficult for Cassini who was completely out of sympathy with the Revolution. Running the Observatory became increasingly difficult as expectations changed. Cassini had three assistants, the\n[\n2\n]\n:-\n... eldest, a mild fifty-year old monk named Nicolas-Antoine Nouet, who also served as the Observatory chaplain, informed Cassini that he wished to marry his personal serving-woman. Cassini was horrified and the two men, once cordial, never spoke again. The second student, a young man of astronomical talent named Jean Perny, returned drunk to the Observatory late one night after a meeting of his Revolutionary club and banged on his patron's door with the butt of his sword, shouting, \"Cassini the aristocrat must be killed! He had to be subdued and taken to bed. ... The third student, Alexandre Ruelle, a youthful deserter from a dragoon regiment, whom Cassini had harboured and trained until his amnesty came through, became his benefactor's most bitter enemy.\nThe students in the Observatory accused Cassini of publishing their work under his own name without giving them credit. In fact Cassini had always acknowledged their work but truth had no place in France during this period. The National Assembly changed things at the Observatory by making four posts of Professor, one of which went to Cassini but on half his previous salary, while his students were appointed to the other three professorships. Perny was appointed Director, with the understanding that the post would rotate. Cassini was humiliated and resigned on\n6\nSeptember\n1793\n.\nThe\nAcadémie des Sciences\nhad already been disbanded in August\n1793\n, despite Cassini's best efforts to prevent this happening, so he could not turn there for help. His students told him that he had to leave his rooms in the Observatory which he did a few weeks later. The National Assembly then took the Cassini map as their own property and when he complained he was arrested and imprisoned on\n14\nFebruary\n1794\n. However, a week later Ruelle, one of the students who had been elevated to professor at the Observatory, was imprisoned for making up his observational data. Cassini was later released and went to live in the family château at Thury.\nDelambre\nand\nLalande\nbegged him to return to his scientific work but he refused.\nCassini wrote in\nMon apologie\nin\n1795\n(\nsee for example\n[\n2\n]\n)\n:-\n\"But what of your astronomy?\" you ask. I confess, it is nothing to me now .... \"But,\" you ask, \"does not your glory, your reputation, your duty as a savant all speak against this retreat?\" My friend, the duty of a father surpasses that of an academician. ... And as for my reputation, my glory, I have sacrificed them, and it has cost me little. ... obliged to flee the Observatory, I saw the\nAcademy of Sciences\ndelivered to the government of the sans-culottes. And what grieved me most, I saw the savants themselves up in arms, divided against one another, partaking of the delirium and the rage of the Revolutionary horde, adopting their morals, their manners, and even their language. ... How can I recognise myself in the changes they have wrought in our old ways of calculating, our old measures, when we had not ten hours in a day, but twenty-four, and no circles of four hundred degrees ...? Everything has changed, and I am too old to abandon my old habits and ideas. The year, the months, the almanac, the astronomical tables, all are changed. If\nGalileo\n,\nNewton\nor\nKepler\nwere to descend from heaven and appear at the\nAcademy\n, they would not comprehend a word in the presentation of Citizen\nLalande\nwhen he told them that on\n20\nbrumaire, the moon, in a\n200\ndegree opposition to the sun, passed the meridian at five hours ...\nWhen offered a position at the Bureau des Longitudes in\n1795\n, he refused as he did when offered a place at the new National Institute, which now replaced the\nAcademy\n, in January\n1796\n. He did have a change of heart around\n1798\nwhen he did accept on election to the National Institute but his attempts to enter the Bureau des Longitudes were turned down and he gave up on his attempted return to science.",
  "matematicos_citados_na_biografia": [
    "César-François Cassini de Thury",
    "Jacques Cassini",
    "Giovanni Domenico Cassini",
    "Académie des Sciences",
    "Cassini de Thury",
    "Legendre",
    "Méchain",
    "Ramsden",
    "Borda",
    "THIS LINK",
    "Academy",
    "Delambre",
    "Lalande",
    "Academy of Sciences",
    "Galileo",
    "Newton",
    "Kepler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}