{
  "nome_completo": "Domokos Szász",
  "nome_curto": "Domokos Szász",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szasz_Domokos/",
  "data_nascimento": "18 August 1941",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": null,
  "local_morte": null,
  "summary": "Domokos Szász is a Hungarian mathematician known for his work in mathematical physics and dynamical systems.",
  "biografia": "Domokos Szász\nwas brought up and educated in Budapest. After graduating from high school in\n1959\n, he entered the Faculty of Sciences of the Eötvös Loránd University in Budapest where he was attracted to probability theory. He graduated in\n1964\nwith a Diploma in Mathematics and continued to study at Eötvös Loránd University where he was appointed as an Assistant Professor in the Probability Department. His first publication\nOn the general branching process with continuous time parameter\nwas published in\n1967\n.\nJoseph Doob\nexplains that in this paper Szász:-\n... gives a systematic presentation of general continuous parameter branching processes. Application is made to find under what kind of branching a Poisson random point distribution remains one.\nAlso in\n1967\n, he was awarded his second degree, the Dr. rer. nat, for his graduate thesis\nSpreading processes\n(\nHungarian\n)\n. He continued to work at Eötvös Loránd University until\n1968\nwhen he went to Moscow to study for his Candidate's Degree at the Lomonosov University of Moscow. There his thesis advisor was\nBoris Vladimirovich Gnedenko\n, but he was also strongly influenced by Roland Lvovich Dobrushin and by\nYakov Grigorevich Sinai\n, both of whom had been students of\nAndrey Nikolaevich Kolmogorov\n.\nIn\n1969\nSzász received the Géza Grünwald Commemorative Prize from the\nJános Bolyai\nMathematical Society, an award given to outstanding young mathematicians. He was awarded his Candidate's degree\n(\nwith distinction\n)\nfrom the Lomonosov University of Moscow in\n1971\nfor his thesis\nThe asymptotic behaviour of sums of a random number of independent random variables\n(\nRussian\n)\n. This was a highly productive time for Szász who published six papers in\n1971\n, one in English, two in Hungarian and three in Russian. Szász was appointed to the Mathematical Institute of the Hungarian Academy of Sciences in\n1971\n. He held this position until\n1999\n. He was awarded a doctorate\n(\nequivalent to a D.Sc. or\nhabilitation\n)\nin\n1981\nfor his thesis\nRandom point distributions and their applications in reliability theory and statistical physics\n(\nHungarian\n)\n. In\n[\n2\n]\nhe explains the main thrusts of his research:-\nMy encounter with the Moscow mathematical school, in particular with Dobrushin and\nSinai\nand their students, turned my interest in the mid\n1970\n's to mathematical statistical physics and later to\ndynamical systems\n, both in an enthralling blossoming then and since. Starting with the early\n1980\n's I have been thinking a lot on ergodic and stochastic properties of hard ball systems and billiards, and of hyperbolic dynamical systems with singularities, in general. Central questions have been how to establish the\nBoltzmann\n-\nSinai\nErgodic Hypothesis and how to prove probabilistically or statistical physically interesting properties of these systems. I am also much interested in the dynamical theory of Brownian motion. I could convince several clever guys in Budapest, how attractive mathematical statistical physics and dynamical systems are.\nIn\n1984\nhe received the Research Prize of the\nHungarian Academy of Sciences\nand in\n1990\nhe was elected as a Corresponding Member of the\nHungarian Academy of Sciences\nbeing elected an Ordinary Member five years later. Also in\n1995\nhe was awarded the Tibor Szele Prize by the\nJános Bolyai\nMathematical Society. This award is given to leading researchers who have founded important scientific schools. He has been invited as a visiting professor to a number of universities: Dartmouth College, USA\n(6\nmonths in\n1977)\n, Goethe University, Frankfurt\n(6\nmonths in\n1977\n-\n78)\n, Dartmouth College, USA\n(6\nmonths in\n1985)\n, and  Princeton University, USA\n(1990\n-\n91)\n.\nIn\n1999\nhe was made Director of Mathematical Institute of the Budapest University of Technology and Economics. In\n2000\nhe became Distinguished Széchenyi Professor at the Budapest University of Technology and Economics. He was awarded the Széchenyi Prize in\n2005\n, an award made by the Hungarian State to those who have made an outstanding contribution to academic life in Hungary. The prize was presented to Szász on National Day\n(15\nMarch\n)\nby Ferenc Mádl, the President of Hungary.\nLet us look briefly at a couple of the problems to which Szász has made major contributions. One is the\nBoltzmann\n-\nSinai\nconjecture and we quote Nikolai Chernov's comments on the history of the problem in his review of the paper\nHard ball systems are completely hyperbolic\n(1999)\nby Szász and Nándor Simányi:-\nThe paper presents a partial solution of a classical open problem in mathematical physics, which is to prove rigorously the ergodicity of a system consisting of any number of identical hard balls in a box with periodic boundary conditions\n(\ni.e., on a torus\n)\n. This problem is ascribed to a hypothesis stated by\nL Boltzmann\nmore than a hundred years ago. A rigorous version of this hypothesis is due to\nYa A Sinai\n, who proved it for two balls in\n1970\nand made several crucial contributions to the study of the problem later, from\n1973\nto\n1987\n, including the proof of the so-called \"fundamental theorem in the theory of dispersing billiards\".\nSinai\n's seminal paper in\n1970\nopened the door to a new branch of mathematical physics - the theory of hyperbolic\n(\nchaotic\n)\nbilliard systems. The\nBoltzmann\n-\nSinai\nconjecture was proved for three balls in\n1991\nby A Krámli, N Simányi and D Szász. The next year the same authors proved the conjecture for four balls. Under certain additional restrictions on the dimension of the balls or the graph of allowable collisions, the conjecture was proved for larger numbers of balls. This paper establishes the complete hyperbolicity of a system of any number of hard balls on a torus. The only restriction is that the masses of the balls must be \"generic\", i.e. avoid some exceptional submanifolds of codimension one. ... The proof is based on fascinating constructions.\nThe\nLorentz\nsystem describes the motion of a free point particle which is reflected from the boundaries of a convex scatterer. Szász, working with different co-investigators, examined the recurrence of such a system when there is a periodic configuration of scatterers. In a\n1985\npaper\nThe problem of recurrence for Lorentz processes\nwith András Krámli he proved a weak form of recurrence while in\nLocal limit theorem for the Lorentz process and its recurrence in the plane\n(2004)\nwritten with Tamás Varjú they proved strong recurrence properties. This work is related to that done by\nLai-Sang Young\n.\nSzász married in\n1975\nand has a daughter and two sons.",
  "matematicos_citados_na_biografia": [
    "Joseph Doob",
    "Boris Vladimirovich Gnedenko",
    "Yakov Grigorevich Sinai",
    "Andrey Nikolaevich Kolmogorov",
    "János Bolyai",
    "habilitation",
    "Sinai",
    "dynamical systems",
    "Boltzmann",
    "Hungarian Academy of Sciences",
    "L Boltzmann",
    "Ya A Sinai",
    "Lorentz",
    "Lai-Sang Young"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}