{
  "nome_completo": "Dudley Ernest Littlewood",
  "nome_curto": "Dudley Littlewood",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Littlewood_Dudley/",
  "data_nascimento": "7 September 1903",
  "local_nascimento": "London, England",
  "data_morte": "6 October 1979",
  "local_morte": "Llandudno, Wales",
  "summary": "Dudley Ernest Littlewood was a British mathematician known for his work in group representation theory.",
  "biografia": "Dudley Littlewood\n's mother was Ada Piper and his father was Harry Bramley Littlewood who worked as a solicitor's clerk in London. Dudley was an only child, brought up in London through the years of World War I, and he attended Tottenham county school in Middlesex. In his final year at school he won a state scholarship and an open entrance scholarship to Trinity College, Cambridge. He entered Trinity College where his undergraduate tutor was\nJ E Littlewood\n(\nwho was not related to Dudley\n)\n. Littlewood was a very successful mathematics undergraduate being awarded College prizes and the Yeats prize. He graduated in\n1925\n, the same year as\nHall\nand\nHodge\nalso graduated from Cambridge, being a\nwrangler\n(\nfirst class student\n)\nin the Mathematical Tripos. He remained at Cambridge, where he began research in analysis, but it appears that he was neither sufficiently good or interested in analysis and, lacking financial support, decided to give up research and look for a job.\nLittlewood's first appointment was as a school teacher, but, in\n1928\n, he found a post as a temporary part-time lecturer at University College Swansea. He worked for a short time at Queen's College, Dundee\n(\nat that time part of the University of St Andrews\n)\nbut returned to Swansea where he worked until\n1947\n. He married Muriel Doris Dyson in\n1930\nand they had one child, a son born in\n1935\n. His part-time position became an assistant lectureship in\n1930\nand a lectureship in\n1934\n. Although his research flourished in Swansea, Littlewood was keen to return to Cambridge and, when the chance came in\n1947\n, he accepted a post as university lecturer. It was not a College appointment so he only had an office through the kindness of\nHodge\n. Littlewood's family were not happy with the move to Cambridge but he did not remain there long for in\n1948\nhe was appointed to the chair of mathematics at the University College of North Wales, Bangor.\nUntil Littlewood's appointment to Swansea he had no definite research interests. However at Swansea the professor,\nArchibald Read Richardson\n, was an algebraist who, according to\n[\n2\n]\n, was 'bursting with problems', and he introduced Littlewood to research in algebra. His first work was on\nquaternion\nalgebras and some of his first papers were written jointly with\nA R Richardson\n. During this period, developments of his first papers led to further work in which he laid the foundations of\ninvariant theory\nof forms in non-commutative algebra.\nInvariant theory was at its height in the\n19\nth\ncentury with the work of\nCayley\n,\nSylvester\n,\nClebsch\n,\nGordan\nand others. Littlewood claimed that:-\n... interest in invariant theory had flagged somewhat, one reason for this being the introduction of\ntensors\n.\nAnother reason was certainly the work of\nHilbert\n, but Littlewood tried to remedy the \"tensor reason\" in a series of papers on tensors and invariant theory.\nLittlewood's main work, however, began in\n1934\nafter\nRichardson\nhad suggested that Littlewood study papers by\nFrobenius\nand\nSchur\n. The two Swansea mathematicians then collaborated on\nGroup characters and algebras\nwhich was published in the\nPhilosophical transactions of The Royal Society\nin\n1934\n[\n1\n]\n:-\nIn it they introduced the 'immanant' of a\nmatrix\n(\na generalization of the\ndeterminant\nand\npermanent\n)\nand its relationship with a class of symmetric functions, which they christened S-functions\n(\nor Schur functions\n)\n. Above all, this paper is renowned for its statement of a rule for multiplying S-functions, now universally called the Littlewood-\nRichardson\nrule\n(\nthis had to wait a further thirty-five years for a rigorous proof\n)\n.\nThis marks the beginning of Littlewood's investigation of\ngroup characters\n, in particular the characters of the\nsymmetric group\n. He examined\nS\nS\nS\n-functions and applied these to invariant theory. He also studied\nquantum mechanics\nand some of the problems in\nrepresentation theory\nhe considered were motivated by this. He published three books perhaps the first\nThe theory of group characters and matrix representations of groups\n(1940)\nbeing the most famous.\nJ A Green\n, a student of Littlewood's, summed up his approach to mathematics writing:-\nLittlewood's mathematical strength lay in his extraordinary insight into the way certain algebraic processes worked.\nIn\n[\n3\n]\nthe authors write:-\nHe clearly had a strong intuitive grasp of formal mathematics and when he felt a result to be true he could be perfunctory about its proof. Littlewood had a great love for the works of\nFrobenius\n,\nSchur\nand\nWeyl\n- these were mathematicians who produced the kind of usable formulae which he could and did appreciate. But he did not appreciate their mathematical rigour, he grasped their methods and results and he proceeded to develop them in his own fashion.\nMorris writes in\n[\n2\n]\n:-\nLittlewood also had a profound interest in philosophy and religion, which he regarded as 'subjects far more worthy of investigation than mathematics' ... . On his retirement in\n1970\nhe wrote up his ideas in an unpublished manuscript, 'In search of wisdom'. He was an avid reader of science fiction, shy and retiring by nature, always with a friendly smile; kind, caring, and supportive in an unobtrusive way.\nIn\n1970\nLittlewood retired from the chair at Bangor, but he continued to live at Llandudno on the North Wales coast. Around the time of his\n76\nth\nbirthday, Littlewood fell and broke a leg. He died suddenly a few weeks later at his home. He was buried at Llanrhos, just south of Llandudno, where parts of the ancient church date back to the\n6\nth\ncentury. His wife Muriel died ten years later.",
  "matematicos_citados_na_biografia": [
    "J E Littlewood",
    "Hall",
    "Hodge",
    "wrangler",
    "Archibald Read Richardson",
    "quaternion",
    "A R Richardson",
    "invariant theory",
    "Cayley",
    "Sylvester",
    "Clebsch",
    "Gordan",
    "tensors",
    "Hilbert",
    "Richardson",
    "Frobenius",
    "Schur",
    "matrix",
    "determinant",
    "permanent",
    "group characters",
    "symmetric group",
    "quantum mechanics",
    "representation theory",
    "J A Green",
    "Weyl"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}