{
  "nome_completo": "Edgar Raymond Lorch",
  "nome_curto": "Edgar Raymond Lorch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorch_Ray/",
  "data_nascimento": "22 July 1907",
  "local_nascimento": "Nyon, Switzerland",
  "data_morte": "5 March 1990",
  "local_morte": "Manhattan, New York City, New York County, USA",
  "summary": "Raymond Lorch was a Swiss-born American mathematician who worked in general topology and functional analysis.",
  "biografia": "Edgar Raymond Lorch\nwas known as\nRay\nbut gave his name on papers as Edgar R Lorch or E R Lorch. His father, Henry John Lorch\n(1868\n-\n1957)\n, was born in Brighton, Sussex, England, the son of a German father and English mother. Ray's mother, Myrtle A Racine, was born in\n1876\nin Switzerland to Swiss parents. Ray's older brother Arthur E Lorch was born in Frankfurt, Germany in\n1904\n. Ray's older sister Madeline D Lorch was born in Frankfurt, Germany in\n1905\n. Ray was born in Nyon, on Lake Geneva, in Switzerland in\n1907\n. In\n1916\nHenry Lorch emigrated to the United States, leaving his family behind until he was settled. In the following year Myrtle, Arthur, Madeline, and Ray left Switzerland to join up with Henry Lorch who was working as a bank clerk in Bergen, New Jersey.\nLorch attended Columbia University in New York where he studied mathematics and was awarded a Bachelor's degree, summa cum laude, in\n1928\n. In his final undergraduate year he was awarded the Albert Ascher Green prize. He continued to study at Columbia University for his Ph.D. advised by\nJoseph Ritt\nand submitted his thesis\nElementary Transformations\nin\n1932\n. In the same year he became an American citizen and he published a paper with results from his thesis in the\nAnnals of Mathematics\n. This paper, with the same title as his thesis, begins as follows:-\nIn a series of remarkable memoirs,\nLiouville\ndemonstrated the impossibility of evaluating certain indefinite integrals, and of solving certain differential equations, in terms of elementary functions. The elementary functions are understood here to be those which are obtained in a finite number of steps by performing algebraic operations and taking exponentials and logarithms. ... A transformation on\nn\nn\nn\nvariables is called an elementary transformation provided the\nn\nn\nn\nfunctions which define the transformation are each elementary. One of the problems arising in the study of elementary transformations is to determine under what conditions the inverse to such a transformation is itself elementary. For transformations operating on one variable, the problem has been completely solved by\nJ F Ritt\n[\nin the paper \"Elementary Functions and their Inverses,\" Trans. Amer. Math. Soc.\n27\n(1925)]\n. In this paper we analyse this problem for the case of elementary transformations of a special type operating on two variables.\nHe was awarded the degree of Ph.D. in\n1933\nwhich was the year in which the United States was suffering most severely from the Great Depression with over one quarter of the workforce unemployed. Obtaining a university position would have been almost impossible for Lorch but, fortunately for him, he was awarded a National Research Council Fellowship to finance a year of postdoctoral study at Harvard University working with\nMarshall Stone\n. Three others with a National Research Council Fellowship arrived in Harvard at this time, namely Magnus Hestenes\n(1906\n-\n1991)\n, David Solomon Nathan\n(1903\n-\n1957)\nand\nDeane Montgomery\n. They formed a seminar to study topology lecturing to each other from\nOswald Veblen\n's\nAnalysis Situs.\nShortly after they began, they were joined by\nNorman Steenrod\n. Lorch explained in\n[\n4\n]\nthat the National Research Council Fellowships:-\n... had been severely cut, both in number and in stipend. Nevertheless, even with the reduced stipend of $\n1\n,\n600\nfor twelve months, I managed to live in Boston like a Bohemian, dividing my activities between wooing the recalcitrant muse of mathematics and indulging in the follies of youth: drinking beer, going to symphony concerts, and jogging in the park. This extra year at Harvard was supposed to give us a \"coat of varnish,\" as one of my friends put it. Whether it turned us into gentlemen or scholars is a moot question. It did provide a line in my curriculum vitae. Future employers were impressed.\nStone\nadvised Lorch to more deeply study\nHilbert\nspaces and\nBanach\nspaces.\nStone\nalso said that the two mathematicians who would be of the greatest help to him would be\nJohn von Neumann\nand\nFrigyes Riesz\n[\n4\n]\n:-\nStone\nhad a special sense of humour. At one of our infrequent meetings I mentioned some problems as possible candidates for research topics. About the best one of my problems,\nStone\nsaid, \"Oh, I don't know. Somebody must have worked on that problem already.\" The following week, while browsing in Widener Library, I came upon an article containing the complete solution to the problem. The author:\nM H Stone\n.\nWith the Great Depression still causing great worries about future jobs, Lorch applied for an extension to his one-year National Research Council Fellowship to visit the Institute for Advanced Study at Princeton. He was delighted to be offered a position as\nJohn von Neumann\n's assistant and made a trip to Princeton to see what the duties of an assistant would be.\nOswald Veblen\n, the director of the Institute, told him what was expected of\nvon Neumann\n's assistant. Lorch did not feel that anyone could carry out all the tasks that were expected of the assistant but he said he wouldd think it over. Back at Harvard, he received a letter from Columbia University offering him a Cutting Traveling Fellowship. After a good deal of thought and taking advice from others, he decided to turn down the position at the Institute for Advanced Study, accept the Cutting Traveling Fellowship and visit\nFrigyes Riesz\nin Hungary. He wrote to\nRiesz\nand got back a positive reply.\nArriving in Szeged he found a sleepy market town with almost no cars and a great many horses. The University was of high quality with leading academics. He was given a room in the postgraduate college,\nEötvös\nKollégium. He had\n[\n4\n]\n:-\n... an adequate room, with bed, table and hard chair. The room was kept in order by a hall boy, who would run errands for a tip. The entrance to the Kollégium was locked at\n11\np.m. Access for latecomers was by ringing a bell to waken the concierge. After midnight you had to pay a fee. Poor students could not afford it, and were in their rooms by\n10\np.m. The \"rich\" could spend their evenings drinking wine in the cafes and return at all hours. This was especially true during carnival, when merriment went on until the wee hours of the morning.\nLorch had a productive year with\nFrigyes Riesz\n. You can read his description of\nRiesz\nat\nTHIS LINK\n.\nHe had exceptionally good relations with\nRiesz\n[\n4\n]\n:-\nThe optimal relation between a mentor and his disciple is seldom achieved. The relation between\nRiesz\nand me was optimal. It was warm, intimate, continuous, without pressure, very calm, leaving each of us free to develop his own thoughts. My stay with him was a perfect amalgam of a healthy, pleasurable life and an uninterrupted communication of mathematical ideas. Access to mutual discussion was free, but never overused.\nFrigyes Riesz\nwas indeed a perfect teacher and a warm companion.\nHis collaboration with\nRiesz\nled to a joint paper,\nThe integral representation of unbounded self-adjoint transformations in Hilbert space\n, which was published in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1936\n. They discussed mathematics at the university in Szeged but also on other occasions. They spent free time together, at weekends, on vacation days, and they often went to Budapest where they stayed at the hotel \"Gellért\". The days in Budapest were spent visiting friends who were mathematicians but they especially loved the famous swimming pool at the hotel where mathematics was discussed while they swam slowly back and forward in the pool. The only unpleasant thing about the visit was the tension that was in the air due to the political situation where everyone was nervous at Hitler's rise to power.\nThis joint paper was not the only paper to come out of his visit to Szeged\n[\n4\n]\n:-\nWhile I lived in Szeged, I published a paper on functions of self-adjoint transformations in which I replaced the previous definition by bilinear forms and\nLebesgue\n-\nStieltjes\nintegration with a theory of measure determined by a resolution of the identity, where the measure of a set is a closed linear manifold. This measure has the virtues that the measure of the intersection and union of sets is the intersection and union of the measures, and the measure of a set essentially determines the set.\nRiesz\nwas much interested in this paper, and made many useful suggestions while I was writing it.\nReturning to the United States in May\n1935\n, Lorch was appointed as an Instructor in mathematics at Columbia University. He married the teacher Else Beylegaard Petersen, daughter of Lorentz Severin Petersen and C Ingrid Olsen, on\n31\nJuly\n1937\n. Else had been born in\n1915\nin Bergen, Norway. They had three children, Edwin Duncan, Madeleine Louise and Ingrid Jacqueline. They were divorced in\n1955\n.\nIn\n1941\nLorch was promoted to assistant lecturer at Columbia University. In\n1944\nhe became an associate professor but, at the same time, he spent the year\n1944\n-\n45\ndoing war work as a research mathematician on the National Defense Research Committee. In\n1948\nhe was appointed as\nAdrain\nprofessor mathematics, a position he held at Columbia until he retired. Also in\n1948\nhe became Science advisor to the chief of staff of the United States Army. Lorch was enthusiastic about visiting European countries and able to deliver lectures in five different languages.  For example during his career he lectured in France, Germany, Scandinavia, Switzerland, and Italy where, as well as collaborating with mathematicians he also worked with philosophers and psychologists. One of his trips to Italy was particularly important when he was Fulbright lecturer in Italy during the academic year\n1953\n-\n1954\n. He gave a series of lectures in Italian at the University of Rome which he then rewrote in English to become his famous book\nSpectral Theory\n(1962)\ndescribed by a reviewer as \"a model of economy and clarity.\" You can read some extracts from reviews of this text at\nTHIS LINK\n.\nWe noted above that Lorch was divorced from his first wife in\n1955\n. On\n25\nMarch\n1956\nhe married Maristella de Panizza Bové. Maristella had been born in Bolzano, Italy on\n8\nDecember\n1919\n, studied at the Liceo Classico, Merano, before obtaining a doctorate from the University of Rome in\n1941\n. She was a professor of Latin and Greek at the Liceo Virgilio in Rome, before emigrating to the United States in\n1947\n. Like Lorch, she was divorced from her first husband, Claude Bové, in\n1955\n. She had one daughter Claudia with her first husband. Ray and Maristella Lorch had two daughters Lavinia Edgarda Lorch and Donatella Livia Lorch. Maristella was on the Faculty of Barnard College and of Columbia University from\n1951\nuntil she retired in\n1990\n.\nBetween\n1958\nand\n1990\n, Ray and Maristella de Panizza Lorch worked to enhance links, particularly educational links, between Europe and the United States. For example they collaborated on developing the Lycée Français de New York, which integrates French and American education, with Ray serving as 'Conseiller Scientifique' and his wife a Senior Member of the Board. In\n1986\nthey were co-founders, along with other members of Columbia University, of La Scuola New York, now called the Scuola d'Italia. This is a bilingual, bicultural school.\nLorch was Chairman of the Department of Mathematics at Barnard College from\n1948\nto\n1963\n, and served as chairman of the committee on instruction in\n1961\n. He was a Visiting professor at the Carnegie Institute of Technology in\n1949\n, at the University of Rome in\n1953\n-\n1954\nand again in\n1982\n, at the University of Florence in\n1953\n-\n1954\nand again in\n1975\n, at the College de France in\n1958\n, at Stanford University in\n1963\nand at the Middle East Technology University, Ankara in\n1965\n. He was a Fulbright lecturer in Colombia in\n1977\n.\nHe was chairman of the mathematics department at Columbia University from\n1968\nto\n1972\nand, four years later in\n1976\n, he retired from his\nAdrain\nprofessorship in mathematics and made professor emeritus. However he continued to lecture and retirement saw him become involved in a number of different projects\n[\n6\n]\n:-\nIn\n1980\nDr Lorch helped found the Center for International Scholarly Exchange at Barnard-Columbia. Since\n1982\nhe had been chairman at Columbia of the University Seminar on 'Computers, Man and Society'.\nLorch played an active role in the\nAmerican Mathematical Society\n. He served on the council from\n1952\nto\n1955\n, was chairman of the committee on nominations in\n1958\n, and was a member of the editorial board from\n1945\nto\n1950\n. He was also an active member of the\nMathematical Association of America\n. He was a member of the\nAccademia dei Lincei\n, the\nSocieté Mathématique de France\n, the\nOesterreichische Mathematische Gesellschaft\n, and the\nUnione Matematica Italiana\n.\nIt was music that was Lorch's greatest passion outside mathematics. He deeply loved music, as a composer, pianist and organist. It was fitting that Columbia University's Italian Academy for Advanced Studies, founded in\n1991\nby Maristella de Panizza Lorch, presented the first annual E R Lorch Memorial Recital on Wednesday,\n1\nMay\n2013\nwith a performance by Italian pianist Emanuele Torquati.\nIn May\n1989\nRay and Maristella de Panizza Lorch visited Hungary to celebrate Ray's long connections with the country beginning with his doctoral studies there in\n1934\n. You can read Maristella's description of their visit at\nTHIS LINK\n.\nLorch died on at St Luke's-Roosevelt Medical Center in Manhattan after a long illness. He had written two manuscripts for a proposed book on mathematics in Hungary. However, he never completed the project so, after his death, Reuben Hersh edited the two manuscripts to create the article\n[\n4\n]\n. In\n1994\nhe received the posthumous award of the\nLester R Ford\naward from the\nMathematical Association of America\nfor the article 'Szeged in\n1934\n' published in the\nAmerican Mathematical Monthly\n.",
  "matematicos_citados_na_biografia": [
    "Joseph Ritt",
    "Liouville",
    "J F Ritt",
    "Marshall Stone",
    "Deane Montgomery",
    "Oswald Veblen",
    "Norman Steenrod",
    "Stone",
    "Hilbert",
    "Banach",
    "John von Neumann",
    "Frigyes Riesz",
    "M H Stone",
    "von Neumann",
    "Riesz",
    "Eötvös",
    "THIS LINK",
    "American Mathematical Society",
    "Lebesgue",
    "Stieltjes",
    "Adrain",
    "Mathematical Association of America",
    "Accademia dei Lincei",
    "Societé Mathématique de France",
    "Oesterreichische Mathematische Gesellschaft",
    "Unione Matematica Italiana",
    "Lester R Ford"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}