{
  "nome_completo": "Eduard Čech",
  "nome_curto": "Eduard Čech",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cech/",
  "data_nascimento": "29 June 1893",
  "local_nascimento": "Stracov, Bohemia (now Czech Republic)",
  "data_morte": "15 March 1960",
  "local_morte": "Prague, Czechoslovakia (now Czech Republic)",
  "summary": "Eduard Čech was a Czech mathematician known for his work in projective differential geometry and topology. He introduced the idea of the higher homotopy groups of a space.",
  "biografia": "Eduard Čech\n's father was Čenek Čech, a policemen, and his mother was Anna Kleplova. Eduard, his parent's fourth child, was born in Stracov which was in northeastern Bohemia but he attended the\nGymnasium\nin Hradec Kralove where his talent for mathematics first became evident and he decided at this time that he wanted to be a school teacher of mathematics.\nHe entered the Philosophy Faculty of Charles University of Prague in\n1912\n, with the aim of becoming a school teacher. He had little interest in physics so he choose courses which were within the area of mathematics and descriptive geometry. Already Čech was studying mathematical texts which were much more advanced than the level of his courses and he spent much time in the Mathematics library.\nHis studies were interrupted by World War I and, although he was able to complete three years of study, he was drafted into the Austro-Hungarian army in\n1915\n. Čech spent three years in the army, but they were not totally wasted as far as his academic studies were concerned for he took the opportunity to learn Italian, German and Russian. When the war ended in\n1918\nhe was able to return to the Charles University and complete the degree which allowed him to teach mathematics in schools.\nHaving obtained his degree, Čech began to teach in secondary schools in Prague but he continued to undertake research in mathematics and completed his doctorate in\n1920\n. His interest in a new area of mathematics, namely projective\ndifferential geometry\n, led to his first paper on the topic appearing in\n1921\nand, in the same year, he obtained a scholarship from the Ministry of Education to go to Italy and study with\nFubini\nin Turin. Čech studied there between\n1921\nand\n1922\nand he clearly impressed\nFubini\nwho asked him to cooperate with him in joint project to write a monograph on projective differential geometry. This joint work with\nFubini\nappeared in two volumes, the first in\n1926\nand the second in the following year. The collaboration was clearly a highly successful one for they cooperated again in writing another major text which appeared in\n1931\n.\nAfter leaving Italy in\n1922\n, Čech wrote his\nhabilitation\nthesis, becoming a\ndocent\nat the Charles University of Prague. This post did not carry a salary, so Čech continued to teach in the secondary schools of Prague to earn enough money to live. Tomás Masaryk was the political leader who liberated the Czechs and Slovaks from Austrian rule and in\n1918\nhe was elected president of Czechoslovakia. A year after the founding of Czechoslovakia, a new university, named the Masaryk University after the first president, was founded in Brno. Mathias\nLerch\nbecame the first professor of mathematics at this, the second Czech university, when it opened in\n1920\n. However,\nLerch\ndied in\n1922\nand the opportunity arose for Čech to gain a chair and a permanent university post. Čech was appointed extraordinary professor at Masaryk University in\n1923\n. There he lectured on analysis and algebra, becoming a full professor in\n1928\n.\nČech was interested in geometry but he was appointed to the chair of analysis at Masaryk University since this had been\nLerch\n's chair. There was another professor of mathematics at Masaryk University, namely\nSeifert\n, who held the geometry chair. So\n[\n14\n]\n:-\n... although geometry was Čech's field of research, Čech had to take over courses in analysis and algebra. He proceeded to master these two fields.\nThrough his widening mathematical interests, to some extent forced on him by his teaching duties, Čech became interested in\ntopology\n, in particular he became one of the foremost experts on combinatorial topology. The topology papers written by Polish mathematicians in the new journal\nFundamenta mathematicae\ngreatly excited him. His early interests in topology were in\nhomology theory\n, a topic on which he published in\n1932\n, and he proved duality theorems for\nmanifolds\n. His aim was to bring together\npoint-set topology\nand\nalgebraic topology\nwith his\n1932\npaper. In this paper, which introduces the topic which today is called the Čech homology theory, Čech also introduced the notion of the inverse limit.\nAt the International Congress of Mathematicians in Zürich in\n1932\n, Čech introduced the notion of higher\nhomotopy groups\nof a space. These were independently investigated by\nHurewicz\n. Two years later Čech extended his work on homology to local homology. On hearing Čech talk about his results at a combinatorial topology conference in Moscow,\nLefschetz\ninvited him to visit Princeton and Čech made the visit during session\n1935\n-\n36\n.\nČech was influenced by the work of\nAleksandrov\nand\nUrysohn\nand he set up a topology seminar at Brno in\n1936\nwhich went on to produce\n26\npapers in\n3\nyears. One of these papers was Čech's paper\nOn bicompact spaces\n(1937)\nwhich introduced what today is called the\nStone\n-Čech compactification of regular topological spaces.\nOn bicompact spaces\ninvestigated certain topological spaces which\nTikhonov\nhad introduced in\n1930\nand\n[\n1\n]\n:-\nČech's interpretation became a very important tool of general topology and also of some branches of\nfunctional analysis\n.\nČech's Brno seminar only ended when the Czech universities were closed down at the start of World War II. Čech, however, tried to continue the work of his seminar despite the War and it continued to meet at the flat of B Pospisl, one of his students, until\n1941\n. At this point Pospisl was arrested by the Gastapo and the seminar could no longer continue. In fact Pospisl was released by the Nazis from prison in\n1944\nbut died shortly afterwards.\nDespite the difficulties which Čech encountered during World War II, he did spend much time working on his book Topological spaces which he later rewrote and published in\n1959\n. In\n1945\n, after the end of World War II, Čech returned to the Charles University of Prague and began an administrative career. Before the start of the war Čech had begun to organise courses for school teachers in Brno. He believed passionately in the improvement of mathematics teaching at all levels and decided to try to improve the way mathematics was taught in schools. He continued this interest after the war ended and used his experiences with the school teachers to organise a series of school mathematics textbooks. He was involved in school reforms and chaired a commission whose remit was to devise a new syllabus for school level mathematics.\nČech became Director of the Mathematical Research Institute of the\nCzech Academy of Sciences\nin\n1947\n, Director of the Central Mathematical Institute in\n1950\n, and Director of the\nCzech Academy\nin\n1952\n. However in that year he returned to the Charles University of Prague to head the new Mathematical Institute there. In the\n1950\ns his mathematical interests turned to differential geometry and after a gap through the war years he began to publish again, writing\n17\npapers on that topic. In\n1956\nhe was appointed as the first director of the Mathematical Institute of the Charles University of Prague. However, his health began to fail but\n[\n14\n]\n:-\n... when already gravely ill, he performed two further important services for Czech mathematics. He founded the journal Commentationes Mathematicae Universitatis Carolinae, the first issue appeared in\n1960\n, and he came up with the idea of organising in Prague an international topological conference. The conference took place in\n1961\nunder the name Symposium on general topology and its relations to Modern Analysis and Algebra. Since then, every five years there has been a Prague Topological Symposium.\nLet us end this biography by giving some details of Čech's character. Koutnik writes in\n[\n14\n]\n:-\nWhenever he was doing something in mathematics, he always strove to achieve a thorough understanding of the subject. The result was that even outside his fields of research he had an extensive knowledge and deep insight into many other areas of mathematics. This feature of his personality also had some other consequences. While he was not conceited and talked easily to people with little formal education, he expected in his fellow professors the same qualities that he himself possessed. this did not contribute to smooth relations with some people as he was not diplomatic but, on the contrary, quite forthright in expressing his opinions.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "differential geometry",
    "Fubini",
    "habilitation",
    "docent",
    "Lerch",
    "Seifert",
    "topology",
    "homology theory",
    "manifolds",
    "point-set topology",
    "algebraic topology",
    "homotopy groups",
    "Hurewicz",
    "Lefschetz",
    "Aleksandrov",
    "Urysohn",
    "Stone",
    "Tikhonov",
    "functional analysis",
    "Czech Academy of Sciences",
    "Czech Academy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}