{
  "nome_completo": "Edward John Routh",
  "nome_curto": "Edward Routh",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Routh/",
  "data_nascimento": "20 January 1831",
  "local_nascimento": "Quebec, Canada",
  "data_morte": "7 June 1907",
  "local_morte": "Cambridge, England",
  "summary": "Edward Routh was a Canadian-born English mathematician, best-known as an outstanding coach of students preparing for the Mathematical Tripos examination of the University of Cambridge.",
  "biografia": "Edward Routh\n's father, Sir Randolph Isham Routh KCB, was born in Poole, Dorset, England, in\n1787\n. After being educated at Eton, Randolph served in the British Army entering the commissariat department in\n1805\n. He served throughout the Napoleonic wars and as Deputy Commissary-General, was senior commissariat officer at the Battle of Waterloo. In\n1826\nRandolph was made Commissary-General of the British Army and was serving in Canada at the time Edward was born. In\n1841\nRandolph was knighted for general services, including action in the Quebec rebellion of\n1837\n, and for being a cabinet member of Lt. Governor Lord Durham's Executive Council of Lower Canada\n(\nQuebec\n)\n. Edward's mother, Marie Louise Taschereau, was Randolph Routh's second wife, his uncle was Cardinal Taschereau, his maternal grandfather father Chief Justice of Quebec.\nThe family returned to London England in\n1842\nwhile his father was still Commissary-General. Edward attended University College School and then entered University College, London, in\n1847\nhaving won a scholarship. There he studied under De Morgan whose influence led to him to decide on a career in mathematics. After the award of a B.A. from London in\n1849\n, he entered Peterhouse on\n1\nJune\n1850\nat the same time as\nMaxwell\n. However,\nMaxwell\ntransferred to Trinity College\n(\nperhaps because he felt Routh was too strong competition!\n)\n. Routh obtained his M.A. from London in\n1853\n, being awarded at that time the Gold Medals for Mathematics and for Natural Philosophy.\nIn January\n1854\nRouth graduated with a B.A. from Cambridge. He was Senior\nWrangler\nin the Mathematical Tripos examinations\n(\nranked first among those with First Class degrees\n)\nwith\nMaxwell\nbeing placed second. The prestigious Smith Prize was at that time decided by examination, and the prize was divided equally between them\n(\nthe first time the prize had been awarded jointly\n)\n. In\n1855\nRouth was elected a fellow of Peterhouse and was appointed as a College lecturer in Mathematics. In the following year he was appointed as assistant tutor at Peterhouse.\nIn\n1857\nthe post of first assistant at the Royal Greenwich Observatory became vacant and Routh was invited by\nGeorge Airy\n, the Astronomer Royal and President of the\nRoyal Society\n, to visit the Observatory so that he might be offered the post. He did go to the Observatory but decided he would prefer not to accept the post there, but rather remain at Cambridge. While he was there, however, he met Hilda Airy,\nGeorge Airy\n's eldest daughter, and a friendship began which led to their marriage on\n31\nAugust\n1864\n. They had five sons and one daughter. Edward Airy Routh was commissioned a Lieutenant in the Royal Garrison Artillery but died age\n24\n, George Richard Randolph Routh became H.M. Inspector of Schools, Arthur Lionel Routh also commissioned in the Royal Garrison Artillery rose to the rank of Colonel, Harold Victor Routh became Professor of Latin at the University of Toronto, and Rupert John Routh served in the Indian Civil Service. Daughter Mary Elizabeth Hilda Routh carried on at Cambridge by marrying a lecturer there.\nRouth became the most famous of the Cambridge coaches for the Mathematical Tripos. His first pupil was Third Wrangler in\n1856\nand, two years later, both the First and Second Wranglers were his pupils. By\n1862\nhe was established as the best Cambridge coach for, in that year, he coached\n19\nof the\n32\nWranglers including seven of those placed in the top ten. Of course once his reputation was established the best students sought him out as a coach and so maintaining his leading role became relatively easy. Naturally his exceptional teaching ability was a factor in his success, but equally his understanding of where students should allocate their energies and how they could make the best use of their knowledge were important. Over a period of\n22\nyears from\n1862\nRouth coached the Senior Wrangler in every year. During his career he coached about\n700\npupils of whom about\n480\nwere Wranglers out of around\n900\nWranglers over these\n30\nyears.\nWhen he retired as a coach in\n1888\na presentation was held at which Routh's portrait, painted by Sir Hubert von Herkomer, was presented to his wife. Eighty of his former pupils had contributed to the cost of the painting. In fact a rather amusing story was told at the time of the presentation to illustrate Routh's skill as a teacher\n[\n2\n]\n:-\nThe case of a student of hydrodynamics was alleged as typical of the trials to which\n[\nhis patience\n]\nwas exposed. The troubled undergraduate's primary difficulty lay in conceiving how anything could float. This was so completely removed by Dr Routh's lucid explanation that he went away sorely perplexed as to how anything could sink!\nWe must not think of Routh as just a superb teacher, however, for he also contributed to mathematics with some excellent research papers and some outstanding texts. The research areas which interested him most were geometry, dynamics, astronomy, waves, vibrations and harmonic analysis. His work on mechanics was particularly important and in\n1877\nhe was awarded the\nAdams\nPrize for work on dynamic stability\nTreatise on the stability of a given state of motion, particularly steady motion\n. The fact that he did this in a Christmas vacation suggests that had he devoted more time to research and less to teaching he may have had a much more lasting impact of the course of mathematics. In fact the impact of this prize winning work was very significant since\nThomson\nand\nTait\nrewrote for the second edition of their text\nNatural philosophy\ntreatise the part dealing with equations of motion using Routh's developments.\nHe published famous advanced treatises which became standard applied mathematics texts such as\nA Treatise on Dynamics of Rigid Bodies\n(1860)\n,\nA Treatise on Analytic Statistics\n(1891)\n, and\nA Treatise on Dynamics of a Particle\n(1898)\n.\nHe was elected a fellow of the Cambridge Philosophical Society in\n1854\n, and in\n1856\nhe became a founder member of the\nLondon Mathematical Society\n. He was also elected a fellow of the\nRoyal Astronomical Society\nin\n1866\nand of the\nRoyal Society\nin\n1872\n. He was awarded honorary degrees from a number of universities including Glasgow\n(1878)\nand Dublin\n(1892)\n. He was made an honorary fellow of Peterhouse in\n1883\n.\nThe author of\n[\n2\n]\nwrites:-\nDr Routh was a man of the most kindly disposition, and was both liked and respected by his numerous pupils. He influenced deeply the mathematical teaching of his time and held strong views as to the best ways of promoting the study. For years he has been a familiar figure in the roads and paths around the University town, but latterly his health failed and he was unable to take his usual walk. The alterations in the procedure of the Mathematical Tripos adopted by the Senate last autumn were a real grief to him, and almost his last appearance in public was at the debate on the proposed changes, when he fought for the retention of the Senior Wrangler.",
  "matematicos_citados_na_biografia": [
    "Maxwell",
    "Wrangler",
    "George Airy",
    "Royal Society",
    "Adams",
    "Thomson",
    "Tait",
    "London Mathematical Society",
    "Royal Astronomical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}