{
  "nome_completo": "Edward Norton Lorenz",
  "nome_curto": "Edward Lorenz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorenz_Edward/",
  "data_nascimento": "23 May 1917",
  "local_nascimento": "West Hartford, Connecticut, USA",
  "data_morte": "16 April 2008",
  "local_morte": "Cambridge, Massachusetts, USA",
  "summary": "Edward Lorenz was an American mathematician and meteorologist first recognised the phenomenum of chaos in complex systems.",
  "biografia": "Edward Lorenz\nstudied mathematics at Dartmouth College in the town of Hanover in western New Hampshire. He graduated from Dartmouth College with a bachelor's degree in\n1938\n, then went to Harvard where he studied for a Master's Degree in mathematics. He received the A.M. degree in\n1940\nand submitted his first mathematical paper for publication. The paper\nA generalization of the Dirac equations\nappeared in the\nProceeding of the National Academy of Sciences\nin\n1941\n.\nAfter the award of his master's degree, Lorenz undertook war service with the United States Army Air Corps. His work with the Army Air Corps involved applying his mathematical skills to weather forecasting and soon he was looking to undertake further study of meteorology. He did a second master's degree, this time an S.M. in meteorology, at the Massachusetts Institute of Technology graduating in\n1943\n. Then, after World War II ended, he continued to study for his doctorate at the Massachusetts Institute of Technology with James Austin as his thesis advisor. He was awarded his Sc.D. in\n1948\nafter submitting the dissertation\nA Method of Applying the Hydrodynamic and Thermodynamic Equations to Atmospheric Models\n.\nLorenz had been employed as an assistant meteorologist at the Massachusetts Institute of Technology from\n1946\n, but when he was awarded his doctorate in\n1948\nhe was promoted to meteorologist. He held this post until\n1954\nand during these eight years he published some major works. He submitted\nDynamic Models Illustrating the Energy Balance of the Atmosphere\nto the\nJournal of the Atmospheric Sciences\nin June\n1949\nand it was published in February\n1950\n. Lorenz's abstract for this paper reads:-\nA generalized vorticity equation for a two-dimensional spherical earth is obtained by eliminating pressure from the equations of horizontal motion including friction. The generalized vorticity equation is satisfied by formal infinite series representing the density and wind fields. The first few terms of a particular series solution are obtained explicitly. The series appear to converge near the north pole, and determine a model of a polar air mass. Within the air mass, the coldest winds are northeasterly and the warmest are southwesterly, while the coldest air of all is at the north pole. Heating occurs in the northwesterly winds and cooling in the southeasterlies, while aside from the effect of friction the air mass as a whole is cooled. The energy balance of the air mass is investigated. It is suggested that an analogous distribution of heating and cooling may be instrumental in maintaining the general circulation of the atmosphere.\nThe paper\nSeasonal and Irregular Variations of the Northern Hemisphere Sea-Level Pressure Profile\nappeared a year later in the same journal. Lorenz's abstract begins:-\nThe variations of five-day mean sea-level pressure, averaged about selected latitude circles in the northern hemisphere, and the variations of differences between five-day mean pressures at selected pairs of latitudes are examined statistically.\nIn\n1952\nhe published\nFlow of Angular Momentum as a Predictor for the Zonal Westerlies\n. The first sentences of the abstract read:-\nAn approximate differential equation is presented, relating the change in speed of the zonal westerly winds to the contemporary zonal wind-speed and the meridional flow of absolute angular momentum. This equation is tested statistically by means of values of the momentum flow and the zonal wind-speed, computed with the aid of the geostrophic-wind approximation, from pressure and height data extracted from analyzed northern-hemisphere maps.\nLorenz spent his whole career at the Massachusetts Institute of Technology, being appointed assistant professor in\n1954\n, then promoted to associate professor before becoming Professor of Meteorology in\n1962\n. He served as Head of Department from\n1977\nto\n1981\n, retiring in\n1987\nwhen he was made professor emeritus.\nIt was a simple event in\n1961\nwhich led Lorenz to results which brought him worldwide fame. He was using a computer to investigate models of the atmosphere which he had devised involving twelve differential equations. Having obtained results from running his program, he decided that he would like to carry the calculations further. Rather than start the whole program again\n(\nfor although he was using an up-to-date computer, it was painfully slow by later standards\n)\n, he started the program in the middle of the calculation inputting the data as calculated by the machine at that middle point. After going away for a cup of coffee, he came back to see how the computer was getting on with the calculations. He was surprised to see that the computer had found significantly different answers over the range that it had calculated before. At first he thought it must be a hardware problem, since the software should come up with the same answer every time when given the same input data. Eventually he discovered that the data he had input to begin the second run had not been printed out to the same number of decimal places as the machine had stored, so the initial data was slightly different for the second run\n(\ndiffering in the fourth decimal place\n)\n. He then set about trying to understand how a tiny change in the initial data could have such a major effect on the calculations. Lorenz had discovered chaos.\nLorenz was not the first person to discover chaos.\nPoincaré\nhad discovered chaos in the\n1880\ns when studying the\n3\n-body problem. However,\nPoincaré\n's discovery had not led to any significant developments. Now that Lorenz understood the significance of his discovery he wrote it up in the paper\nDeterministic Nonperiodic Flow\nand it appeared in the\nJournal of the Atmospheric Sciences\nin\n1963\n. The abstract begins:-\nFinite systems of deterministic ordinary nonlinear differential equations may be designed to represent forced dissipative hydrodynamic flow. Solutions of these equations can be identified with trajectories in phase space. For those systems with bounded solutions, it is found that nonperiodic solutions are ordinarily unstable with respect to small modifications, so that slightly differing initial states can evolve into considerably different states. Systems with bounded solutions are shown to possess bounded numerical solutions.\nThe paper, like\nPoincaré\n's work\n80\nyears earlier, had relatively little impact in the time immediately after it appeared. However, it has gone on to become one of the most quoted papers of all time. The set of equations and the attractors described by this set of equations are now called the 'Lorenz equations' and 'Lorenz attractors', respectively. It would be fair to say that Lorenz began a scientific revolution with this paper which he and many others developed over the following years. In\n1972\nhe addressed the American Association for the Advancement of Science giving a talk with the title\nPredictability: Does the Flap of a Butterfly's Wings in Brazil Set off a Tornado in Texas?\nBy encapsulating the essence of chaos theory in the title of his talk, Lorenz succeeded in capturing the public's imagination and the term \"butterfly effect\" was soon the popular term for chaos.\nAnother account of aperiodic behaviour in ordinary differential equations, and difference equations, in which Lorenz describes how he arrived, starting from the description of convection in meteorology, at the Lorenz equations is contained in his paper\nOn the prevalence of aperiodicity in simple systems\ndelivered at the Biennial Seminar of the Canadian Mathematical Congress in Calgary, Canada, in\n1978\n. In\n1980\nhe published\nAttractor sets and quasigeostrophic equilibrium\n:-\nThe primary purpose of this study is to find out what the attractor set looks like for some simple atmospheric model.\nLater papers include:\nA very narrow spectral band\n(1984)\nwhich investigates the spectral properties of the Lorenz system\n; The local structure of a chaotic attractor in four dimensions\n(1984)\n;\nLyapunov numbers and the local structure of attractors\n(1985)\n;\nOn the existence of a slow manifold\n(1986)\n;\nAtmospheric models as dynamical systems\n(1986)\n;\nComputational chaos - a prelude to computational instability\n(1989)\n; and\nThe slow manifold - what is it?\n(1992)\n.\nIn\n1991\nLorenz gave the Jessie and John Danz Lectures at the University of Washington. He used this series of three lectures as a basis for his famous text\nThe essence of chaos\n(1993)\n. Andrew Fowler writes in a review:-\nThis is an excellent book, providing a popular exposition of the science of chaos by an undisputed international authority. ... In measured tones, Lorenz starts slowly and builds up gradually a complete understanding of chaos. The discussion is not technical, but does not shirk genuine explanation. The reader is assumed to be intelligent, and is expected to cope with the whole battery of chaotic phenomena. By the end, the dogged reader will find himself with an unsensational but genuine understanding of the subject.\nLorenz was married to Jane Logan\n(\nwho died in\n2001)\n; they had three children, two daughters Nancy and Cheryl, and a son Edward. As to his hobbies, he\n[\n2\n]\n:-\n... was an active hiker and cross-country skier and made it a point to visit mountain trails near every scientific meeting he attended.\nHis daughter Cheryl said\n[\n1\n]\n:-\nHe was out hiking two and one-half weeks ago, and he finished a paper a week ago with a colleague.\nHe died from cancer at his home in Cambridge, Massachusetts.\nLorenz received many awards and honours for his remarkable contributions. For example: elected a fellow of the\nAmerican Academy of Arts and Sciences\n(1961)\n; awarded the Clarence Leroy Meisinger Award and the Carl Gustaf Rossby Research Medal\n(1969)\nboth from the American Meteorological Society; awarded the Symons Memorial Gold Medal of the Royal Meteorological Society\n(1973)\n; elected a Fellow of the\nNational Academy of Sciences\n(\nUnited States\n)\n(1975)\n; elected a Member of the\nIndian Academy of Sciences\n; elected a Member of the\nNorwegian Academy of Science and Letters\n(1981)\n; awarded the Crafoord Prize of the\nRoyal Swedish Academy of Sciences\n(1983)\n:-\n... for fundamental contributions to the field of geophysical hydrodynamics, which in a unique way have contributed to a deeper understanding of the large-scale motions of the atmosphere and the sea.\nHe was also awarded the Elliott Creson Medal from the Franklin Institute. In\n1984\nhe was elected an Honorary Member of the Royal Meteorological Society, then in\n1991\nhe was awarded the Kyoto Prize of the Inamori Foundation\n(\nJapanese equivalent of the Nobel prize\n)\nfor discovering deterministic chaos which has:-\n... profoundly influenced a wide range of basic sciences and brought about one of the most dramatic changes in mankind's view of nature since\nSir Isaac Newton\n.\nIn addition he was awarded the Roger Revelle Medal from the American Geophysical Union and the Louis J Battan Author's Award from the American Meteorological Society. In\n2004\nhe was awarded the Buys Ballot medal of the\nRoyal Netherlands Academy of Arts and Sciences\nwhich is awarded approximately every ten years to an individual that has made significant contributions to meteorology.",
  "matematicos_citados_na_biografia": [
    "Poincaré",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Indian Academy of Sciences",
    "Norwegian Academy of Science and Letters",
    "Royal Swedish Academy of Sciences",
    "Sir Isaac Newton",
    "Royal Netherlands Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}