{
  "nome_completo": "Egbert Rudolf van Kampen",
  "nome_curto": "Egbert van Kampen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_Kampen/",
  "data_nascimento": "28 May 1908",
  "local_nascimento": "Berchem, Antwerp, Belgium",
  "data_morte": "11 February 1942",
  "local_morte": "Baltimore, Maryland, USA",
  "summary": "Egbert van Kampen was a Belgian mathematician who made important contributions to topology and algebra.",
  "biografia": "Egbert van Kampen\n's parents had lived in The Netherlands until a couple of years before their third son Egbert was born when they moved to Belgium. Egbert's father was employed as an accountant, working at the Minnerva car factory in Antwerp. During World War I the family moved to Amsterdam to live with relatives. After the war ended they moved again, this time to The Hague where Egbert attended Eerste Christelijke school. He graduated in\n1924\nwith an outstanding performance which led to reports in the press of his remarkable mathematical talent.\nFollowing his graduation from school, van Kampen entered the University of Leiden. After graduating with a first degree he continued to undertake research in mathematics. In\n1927\nhe travelled to Göttingen where he met\nvan der Waerden\nwho was undertaking research there for his\nhabilitation\n. He also met\nAleksandrov\nin Göttingen, for around this period\nAleksandrov\nspent every summer there. Discussions with these two mathematicians proved important for van Kampen's research and he began to study ways of making a satisfactory topological definition of a variety. Back at the University of Leiden, his research was supervised by Willem van der Woude, himself a student of\nPieter Schoute\n. Van Kampen submitted his thesis\nDie kombinatorische Topologie und die Dualitätssatze\nⓉ\n(\nCombinatorial topology and the duality theorem\n)\nto the University of Leiden and was awarded his doctorate in\n1929\n.\nBefore the award of his doctorate, van Kampen had spent the summer months of\n1928\nat the University of Hamburg where he worked with\nArtin\n. Van Kampen's first published work was an example of a knot which appeared in the\nHamburger Abhandlungen\nin\n1928\n. The knot provided a counterexample to a result which\nArtin\nhad claimed to be true in\n1925\n. At this stage in his career van Kampen was approached by Johns Hopkins University in the United States and offered a position but he was still too young to enter the United States so decided to work in Europe before taking up the offer from Johns Hopkins. He accepted an appointment as an assistant to\nSchouten\n, who was professor of mathematics at the University of Delft.\nSchouten\nworked all his life on tensor analysis and although this seems quite far removed from the topics that van Kampen had been undertaking research on, nevertheless he collaborated with\nSchouten\non three papers on tensor analysis, published in\n1930\n,\n1931\nand\n1933\n. However he continued to work on topological ideas, in particular embedding complexes in Euclidean space.\nIn\n1931\nvan Kampen left Europe and travelled to the United States to take up the position which he had been offered at Johns Hopkins University in Baltimore, Maryland. There he met\nZariski\nwho had taught at Johns Hopkins University as a Johnston Scholar from\n1927\nuntil\n1929\nwhen he had joined the Faculty.\nZariski\nhad been working on the fundamental group of the complement of an algebraic curve, and he had found generators and relations for the fundamental group but was unable to show that he had found sufficient relations to give a presentation for the group. Van Kampen solved the problem, showing that Zariski's relations were sufficient, and the result is now known as the\nZariski\n-van Kampen theorem.\nVan Kampen spent the year\n1933\nat Princeton University where\nJ W Alexander\n,\nA Einstein\n,\nM Morse\n,\nO Veblen\n,\nvon Neumann\n, and\nH Weyl\nwere working at the newly founded Institute for Advanced Study. Shortly before this\nPontryagin\n, who had been working on problems in topology and algebra, had been studying duality. He had proved that compact abelian groups are dual to discrete abelian groups, and\nvon Neumann\nwas interested in extending this result. Van Kampen became interested in\nPontryagin\n's duality and wrote sixteen papers on this topic, including an excellent survey article published in\n1935\n.\nIn\n1935\nvan Kampen began to work in a different area of mathematics when he became interested in the work which\nWintner\nwas undertaking.\nWintner\nhad worked at Johns Hopkins since\n1930\n, the year before van Kampen arrived, and his interests were in almost-periodic functions and differential equations. Van Kampen had become involved with the study of almost-periodic functions when he had visited Princeton, and\nvon Neumann\nhad explained to him how\nPontryagin\n's duality results could be extended using almost-periodic functions. Van Kampen published a paper on almost-periodic functions in the\nJournal of the London Mathematical Society\nin\n1937\n, having published his first joint paper with\nWintner\nOn the canonical transformations of Hamiltonian systems\nin the\nAmerican Journal of Mathematics\nin the previous year.\nBy the late\n1930\ns van Kampen was complaining of headaches in letters which he wrote to his family back in Belgium. At first doctors thought that the problem was coming from his neck and he had physiotherapy to try to cure the pain. However the headaches worsened and cancer was diagnosed, originating from a birth mark near his left ear. In April\n1941\nvan Kampen entered hospital and doctors operated to remove the malignant growth. At first the operation was thought to have been successful and van Kampen resumed teaching in the autumn of\n1941\n. However the headaches soon returned even more severe than before, and he lost the hearing in his left ear. With his health rapidly deteriorating, van Kampen entered hospital again in December\n1941\nand another operation was carried out in January\n1942\n. It was not successful and van Kampen lapsed into unconsciousness on\n10\nFebruary and died on the following day.\nDuring his final illness van Kampen's papers were still appearing in print. Seven papers appeared in\n1939\n, four on statistics and three on almost periodic functions.\nWintner\nwas a joint author of four of these papers,\nKac\nof three, and two had van Kampen as sole author. Five papers appeared in\n1940\n, one of them a major article over\n30\npages in length in the\nAmerican Journal of Mathematics\nwith the title\nInfinite product measures and infinite convolutions\n. Also in\n1940\nhe published a paper written jointly with\nErdős\n,\nKac\nand\nWintner\n:\nRamanujan sums and almost periodic functions\n. Three more papers appeared in print in\n1941\nand at the time of his death he had\n54\npapers in print, a remarkable achievement over a period of\n12\nyears. Five years after van Kampen's death\nWintner\npublished a paper\nOn the asymptotic distribution of geodesics on surfaces of revolution\nwhich he made a joint work with van Kampen since it contained ideas on which the two had been working.",
  "matematicos_citados_na_biografia": [
    "van der Waerden",
    "habilitation",
    "Aleksandrov",
    "Pieter Schoute",
    "Artin",
    "Schouten",
    "Zariski",
    "J W Alexander",
    "A Einstein",
    "M Morse",
    "O Veblen",
    "von Neumann",
    "H Weyl",
    "Pontryagin",
    "Wintner",
    "Kac",
    "Erdős"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}