{
  "nome_completo": "Eižens Leimanis",
  "nome_curto": "Eižens Leimanis",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leimanis/",
  "data_nascimento": "10 April 1905",
  "local_nascimento": "Vecbaizas (near Valmiera), Latvia",
  "data_morte": "4 December 1992",
  "local_morte": "Vancouver, Canada",
  "summary": "Eižens Leimanis was a Latvian mathematician who worked on the three-body problem.",
  "biografia": "Eižens\n(\nEugene\n)\nLeimanis\n's father was a farmer and Eizens was born on the Vecbaizas estate near Valmiera. As a young boy his parents began to teach him at home, then after the family moved to Riga when he was six years old, Eizens entered a primary school there. He continued his education in Riga, attending Riga's First\nGymnasium\nfrom which he graduated in\n1924\n.\nLeimanis was brought up in Latvia near the end of a long period of Russian domination. During his time at secondary school World War I had caused severe problems. However, in\n1917\nthe Russian domination of Latvia ended and, after a brief period of German invasion, the country became independent in a proclamation made on\n18\nNovember\n1918\n. Within this new independent country there was a wish to quickly found a national university and the University of Latvia was founded in September\n1919\n. It was into this new University of Latvia that Leimanis entered in\n1924\n. There he was taught by\nMeders\nand obtained his Master's Degree in\n1929\n.\nAfter the award of his Master's Degree Leimanis was appointed as an assistant in the Department of Descriptive Geometry at the University, but he supplemented his income by teaching mathematics at the Riga School of Commerce during session\n1930\n-\n31\n. Keen to broaden his education, Leimanis set off in\n1931\nto visit various places in Europe with very different mathematical specialities. First he went to the University of Leipzig, where\nKoebe\nwas on the staff and\nvan der Waerden\nhad just been appointed as Professor, taking courses in pure mathematics. He next went to Copenhagen Astronomical Observatory where he studied celestial mechanics. Returning to Latvia, he was awarded a doctorate for a thesis on\nalgebraic geometry\nand appointed as a\ndozent\nin the Department of Pure Mathematics at the University of Latvia.\nImmediately he was on his travels again, this time going to Paris where he spent a year at the\nHenri Poincaré\nInstitute undertaking research on differential equations and celestial mechanics. He made the most of the very active mathematical scene in Paris for he also attended\nHadamard\n's seminar, and attended courses at the Collège de France and the University of Paris. Leaving Paris in the summer of\n1936\n, he went to Oslo to attend the International Congress of Mathematicians. Back in Riga, he was appointed as a dozent in\n1937\nin the Department of Theoretical Astronomy and Analytical Mechanics at the University of Latvia.\nThe German-Soviet Nonaggression Pact was signed in August\n1939\nand Latvia's fate was out of its own hands. On\n17\nJune\n1940\nthe Red Army invaded Latvia and only three days later a new government of Soviet supporters was announced. They voted on\n21\nJuly for Latvia to become a part of the USSR and on\n5\nAugust this became official. The Soviet occupation saw around\n35\n,\n000\nLatvians deported to Russia within a year. During this extremely difficult period Leimanis continued to teach and undertake research at the University of Latvia. However, there were dramatic changes when the German army invaded Latvia in July\n1941\n. For a period Latvia was a province of a larger Ostland\n(\nincluding Estonia, Lithuania, and Byelorussia\n)\n. In\n1944\nthe Soviet army again marched into Latvia and a renewed period of Soviet domination began. At this time Leimanis was forced to go to Danzig as a refugee.\nFor a while Leimanis taught at the Baltics University in Hamburg but in\n1949\nhe emigrated to Canada, becoming professor at Columbia University in Vancouver.\nIn\n1958\nLeimanis published\nSome recent advances in the dynamics of rigid bodies and celestial mechanics. Dynamics and nonlinear mechanics\n. This article is part of the\nSurveys in Applied Mathematics\nand were written as a joint project of the Office Of Naval Research and Applied Mechanics Reviews. F Joachim Weyl explains in the Preface to the book the purpose of the surveys:-\n[\nT\n]\nhe survey articles have the primary objective of summarizing the state of selected fields of applied mathematics, particularly those fields whose current state cannot be satisfactorily assessed without a study of the less accessible literature on the subject. The articles are not written for specialists in the field, but are aimed at a fairly broad audience, including engineers.\nJ P LaSalle, reviewing Leimanis' article, writes:-\nLeimanis's survey of dynamics is well organized and, especially when one considers the limitations of a survey, his presentation of the topics he selected is both interesting and complete. He does particularly well in giving an account of some of the recent Soviet and Italian contributions.\nLeimanis continued to publish and, when he was approaching\n80\n, the paper\nOn integration of the differential equation of central motion\nappeared. The authors describes the content as follows:-\nAssuming that the force acting on a particle is of the form\nf\n(\nr\n)\ng\n(\nq\n)\nf(r)g(q)\nf\n(\nr\n)\ng\n(\nq\n)\n, the theory of infinitesimal transformations is applied to determine the forms of\nf\n(\nr\n)\nf(r)\nf\n(\nr\n)\nand\ng\n(\nq\n)\ng(q)\ng\n(\nq\n)\nfor which the differential equation of central motion is integrable by quadratures or reducible to a first-order differential equation.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Meders",
    "Koebe",
    "van der Waerden",
    "algebraic geometry",
    "dozent",
    "Henri Poincaré",
    "Hadamard"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}