{
  "nome_completo": "Elliott Waters Montroll",
  "nome_curto": "Elliott Montroll",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montroll/",
  "data_nascimento": "4 May 1916",
  "local_nascimento": "Pittsburg, Pennsylvania, USA",
  "data_morte": "3 December 1983",
  "local_morte": "Chevy Chase, Maryland, USA",
  "summary": "Elliott Montroll was an American scientist and mathematician who worked in a variety of applied mathematical and statistical areas.",
  "biografia": "Elliott Montroll\n's parents were Esther Israel and Adolph Baer Montroll. Adolph was an artist who dealt in furs and together with his wife Esther provided a loving home in which Elliott grew up. They taught Elliott to read and write before he entered school for the first time at the age of five. At school he showed great initiative in designing projects for his class and, with a growing interest in chemistry, his parents allowed him to convert the basement of their home into a laboratory. There he spent long hours carrying out experiments with one of his school friends.\nIt was clear that given his passion for chemistry that was the subject Montroll would study at university. Indeed he entered the University of Pittsburgh in\n1933\n, taking a chemistry course and he graduated with a B.S. in chemistry four years later. However by the time he graduated he had changed from his schoolboy ambition to become a chemist and decided to undertake research in mathematics. He registered for a Ph.D. in mathematics at the University of Pittsburgh and was awarded his doctorate in\n1939\n. He used both his expertise in chemistry and mathematics in his thesis\nApplications of the characteristic value theory of integral equations\nin which he applied\nintegral equations\nto the study of imperfect gases. A paper published jointly with Joseph E Mayer in\n1941\nStatistical mechanics of imperfect gases\nalso examined ideas developing out of his thesis.\nMontroll was now in the unusual position of being able to work in mathematics, physics or chemistry departments. His first appointment was as a research assistant in chemistry at Columbia University in\n1939\n-\n40\n. It was during this time that he worked with Joseph Mayer on the techniques published in the\n1941\npaper mentioned above. In\n1940\n-\n41\nhe was a Sterling Research Fellow at Yale University where his work on the Ising model of a ferromagnet led him to solve certain Markov chain problems. Following this he was a Research Associate at Cornell University in\n1941\n-\n42\nwhere he began his studies of the problem of finding the frequency spectrum of elastic vibrations in crystal lattices. During\n1942\n-\n43\nMontroll was an instructor in physics at Princeton University and in\n1943\nhe married Shirley Abrams; they had ten children, five boys and five girls.\nIn\n1943\nMontroll was appointed as Head of the Mathematics Research Group at the Kellex Corporation in New York. There he worked on programs associated with the Manhattan Project, using his expertise in applying statistical mechanics to the behaviour of neutrons in a chain reaction. In\n1944\nhe went to the Polytechnic Institute of Brooklyn, being appointed adjunct professor of chemistry, then in\n1946\nhe returned to the University of Pittsburgh. He served as assistant professor of physics and mathematics and was promoted to associate professor in\n1947\n. He remained at Pittsburgh until\n1950\nbut also served as head of the Physics Branch of the Office of Naval Research in Washington, D.C., from\n1948\nto\n1950\n. In\n1950\nhe was appointed as a research fellow at the Courant Institute in New York. In\n1951\nhe was appointed Research Professor in the Institute for Fluid Dynamics and Applied Mathematics at the University of Maryland and, given the many moves he had made, this was a period of comparative stability since he held the post until\n1960\n. However, he also Director of its Physical Science Division of the Office of Naval Research from\n1952\nto\n1954\n.\nDuring his time at Maryland, Montroll published\nTopics in statistical mechanics of interacting particles\nwhich was\n86\npages of mimeographed notes of a lecture series, written jointly with G F Newell. The object of the lectures was to study the equilibrium statistical mechanics of large systems of interacting particles. In\n1953\nhe delivered a lecture at the symposium on special topics in applied mathematics at Northwestern University, publishing\nFrequency spectrum of vibrations of a crystal lattice\nin the Proceedings. This is a review of some developments in the analysis of the vibration spectrum of crystal lattices with particular emphasis on the observation that the frequency distribution function is expected to have singularities. At the Third Berkeley Symposium on Mathematical Statistics and Probability\n1954\n-\n1955\n, Montroll gave a paper\nTheory of the vibration of simple cubic lattices with nearest neighbor interactions\nin which described vibrations of a cubic lattice with\n1\n,\n2\n,\n3\n, and\nn\nn\nn\ndimensions where\nn\nn\nn\nis large. In\n1956\nhe published\nRandom walks in multidimensional spaces, especially on periodic lattices\nin which he looked at random walks on a\nk\nk\nk\n-dimensional lattice. In\n1958\n, as consultant to General Motors Corporation, he undertook studies of traffic flow and published\nTraffic dynamics: Studies in car following\n.\nMontroll was not someone who was happy to remain in one place for a long time and by\n1960\n, having been at the University of Maryland for nine years, he felt it was time to move on. He wanted to move, both from Maryland and also from universities, and took a took the post of Director of General Sciences at the IBM Thomas J Watson Research Center in Yorktown Heights, New York. In\n1963\nhe took up the position of Vice President for Research at the Institute for Defense Analysis in Washington, D.C. but by this time a return to university life looked attractive. In\n1966\nhe was appointed\nAlbert Einstein\nProfessor of Physics, and the Director of the Institute for Fundamental Studies, at the University of Rochester. He remained there until he reached the retiring age of\n65\nwhen he accepted two further posts, one back at the University of Maryland and the other at the University of California, Irvine.\nSome of his later work appeared in\nSocial dynamics and the quantifying of social forces\n(1978)\nin which he proposed a general framework in which social and technological change can be modelled and measured. In the proceeding of the conference\nNonlinear equations in abstract spaces\nheld in\n1977\nat the University of Texas he published\nOn some mathematical models of social phenomena\nin which he examined models for population growth and statistical models of other social phenomena.\nMontroll's work led to him receiving many honours and prizes. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1969\n, and to the\nAmerican Academy of Arts and Sciences\nin\n1973\n. His work on traffic flow led to him winning\n(\njointly\n)\nthe Lanchester Prize of the Operations Research Society of America in\n1959\n. Carey writes in\n[\n1\n]\n:-\nHis particular genius consisted of his ability to develop elegant and powerful mathematical formulae capable of explaining complex physical and social relationships.\nA A Maradudin, K E Shuler and R F Wallis write in a tribute to Montroll by the University of California:-\nAs a person, Elliott Montroll was one of the most cheerful and imperturbable people one could ever hope to meet. He was unfailingly helpful to his colleagues, and always willing to take on tasks without first asking what was in it for him. He was truly a man about whom it can be said that no one ever uttered an unkind word and who never made an unkind remark about anyone. His universe consisted exclusively of friends and admirers.\nHe died at his home from heart failure.",
  "matematicos_citados_na_biografia": [
    "integral equations",
    "Albert Einstein",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}