{
  "nome_completo": "Émile Michel Hyacinthe Lemoine",
  "nome_curto": "Émile Lemoine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lemoine/",
  "data_nascimento": "22 November 1840",
  "local_nascimento": "Quimper, Finistère, France",
  "data_morte": "21 February 1912",
  "local_morte": "Paris, France",
  "summary": "Émile  Lemoine was a French civil engineer, mathematician and geometer.",
  "biografia": "Émile Lemoine\n's father had been a military man, serving in Napoleon Bonaparte's army from\n1807\n. The College at La Flèche had been closed in\n1793\ndue to the French Revolution but in\n1808\nNapoleon transferred the Prytanée de Saint-Cyr to the College buildings in La Flèche, founding the military school there. Émile Lemoine's father was involved in the founding of the military Prytanée of La Flèche at this time and, because of this, Émile was awarded a scholarship to enable him to be educated there. While at this school, Lemoine published\nNote sur une conique et son cercle directeur\nⓉ\n(\nNote on a conic and its director circle\n)\nin the\nNouvelles annales de mathématiques\nin\n1858\n. In this paper, Lemoine describes himself as a pupil in the Spéciales of the Prytanee impérial of La Flèche. Along with Charles Kessler, a fellow pupil at the Prytanée Militaire, he published a solution to a geometric question posed in the\nNouvelles annales de mathématiques\nin\n1859\n. Their paper appeared in this journal in\n1860\n. Graduating from the Prytanée Militaire in\n1860\n, Lemoine entered the École Polytechnique in Paris.\nLemoine was very musical and while at the École Polytechnique he founded an amateur musical group named \"La Trompette\" which, several years later, was good enough to have Saint-Saëns write music especially for it. Saint-Saëns composed\nSeptet in E flat major\nOp\n65\n, at Lemoine's request. The piece was written for trumpet, two violins, viola, cello, double bass and piano. In fact Saint-Saëns and other leading musicians of the day would perform with Lemoine's \"La Trompette\". In October\n1907\n, Saint-Saëns wrote to Lemoine about his Op\n65\n:-\nWhen I think how much you pestered me to make me produce, against my better judgment, this piece that I did not want to write and which has become one of my great successes, I never understood why.\nSaint-Saëns composed other works for Lemoine. For example he gave Lemoine the work\nPréambule\nas a present for Christmas\n1879\n. It was played at a concert in January\n1880\nand Saint-Saëns was so pleased with the result that he promised Lemoine that he would write a complete work with\nPréambule\nas its first movement, which he had done by the end of\n1880\n.\nLet us return to Lemoine's university career which he completed when he graduated from the École Polytechnique in\n1866\n. His life after this was unconventional although he did do some teaching at the École Polytechnique\n[\n3\n]\n:-\nInstead of accepting any of the careers offered by the State to all graduates of the Polytechnic School, M Lemoine determined to make his own way. Indeed, for the next few years, although engaged in science teaching in Paris, he seems to have run the round of pleasure of which that city is the home par excellence. Of great versatility and exceptional conversational powers, with an originality that fascinated and a personality that impressed his large circle of friends, he lived the life of a dilettante in the best sense of the term, and drank at the fountains of pleasure, of politics, of the arts, and of the sciences.\nHowever, Lemoine's life was not simply one of enjoying the social life of Paris. He continued his scholarly interests in a remarkably wide range of different areas. He did not give up studying for he attended classes at the École des Mines. He served as an assistant to the astronomer Pierre Jules César Janssen\n(1824\n-\n1907)\nwho had been appointed as professor of physics at the École Speciale d'Architecture in Paris in\n1865\n. Janssen invented a way to observe the sun without there being an eclipse, and in that way discovered the element helium in\n1868\n. Lemoine also worked with the chemist Charles Adolphe Wurtz\n(1817\n-\n1884)\n[\n3\n]\n:-\n... for whom he always had a great admiration and between whom and himself there was much affection.\nHe spent a year studying law, but \"his republican principles and his liberal views on church matters\" meant that he did not fit into this particular profession and he was forced to abandon it. His love for travelling was limited by the costs involved, but he managed to make a number of journeys in the role of tutor to the children of wealthy families. However, in\n1870\nhe had an accident which caused a problem with his larynx. This put an end to his teaching and for a while he left Paris and rested in Grenoble. Around this time he began to undertake research in mathematics again and he published\nNote sur l'expression de la distance entre quelques points remarquables d'un triangle ABC\nⓉ\n(\nNote on the expression of the distance of a few remarkable points of a triangle ABC\n)\n(1870)\nand\nNote sur une question d'arithmétique\nⓉ\n(\nNote on a mathematical question\n)\n(1870)\n, both in the\nNouvelles annales de mathématiques, journal des candidats aux Écoles Polytechnique et Normale\n.\nThe popularity of Napoleon III, the French emperor, was declining in France and he thought a war with Prussia might change his political fortunes since his advisers had told him that the French Army could defeat Prussia. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states. With both sides feeling that a war was to their advantage, the Franco-Prussian War became inevitable. On\n14\nJuly, Bismarck sent a telegram which infuriated the French government and on the\n19\nJuly France declared war on Prussia. Because of the war, Lemoine served for a while in the army. However, the war went badly for France and in August the German army trapped part of the French army in Metz. The French army surrendered on\n1\nSeptember, and on\n19\nSeptember the German army began to blockade Paris. The city fell in January\n1871\nand the treaty following the French defeat was humiliating. From March to May\n1871\n, as a result of dissatisfaction with the government, there was an insurrection in Paris against the French government. After peace was restored, Lemoine returned to Paris in the summer of\n1871\nand, changing career, he became a civil engineer. However he continued to work as an amateur mathematician and musician.\nHis next mathematical work was\nSur une question de probabilités\nⓉ\n(\nOn a question of probabilities\n)\npublished in the\nBulletin de la Société Mathématique de France\nin\n1872\n. Although at first sight this does not appear to be on his favourite topic of geometry, in fact it does solve a geometrical problem since the paper answers the following question:-\nA rod is broken into three pieces; what is the probability that, with these three pieces, one can form a triangle?\nThis is such a nice little question that the reader will almost certainly like to know what answer Lemoine came up with. The answer is\n1\n4\n\\large\\frac{1}{4}\\normalsize\n4\n1\n​\n.\nAs a civil engineer he rose to the rank of chief inspector and in that capacity he was responsible for the gas supply to Paris. He worked in the gas inspection service from\n1886\nuntil\n1896\n.\nLemoine's contribution to mathematics was mainly on geometry and he published\nNote sur un point remarquable du plan d'un triangle\nin\n1873\n. He founded a new study of properties of a triangle in his paper\nSur quelques propriétés d'un point remarquable de triangle\nⓉ\n(\nOn some properties of a remarkable point of triangle\n)\nof\n1873\nand his\n1874\npaper\nNote sur les propriétés du centre des médianes antiparalleles dans un triangle\nⓉ\n(\nNote on median antiparallel center properties in a triangle\n)\n. In these papers he studied the point of intersection of the symmedians of a triangle, a concept which we define below. He had been a founder member of the Association Française pour l'Avancement des Sciences and it was at a meeting of the Association in\n1873\nin Lyon that he presented the first of these papers on the symmedians. The second paper of\n1874\nhe presented to the Congrès de Lille.\nA\nsymmedian\nof a triangle from vertex\nA\nA\nA\nis obtained by reflecting the median from\nA\nA\nA\nin the bisector of the angle\nA\nA\nA\n. He proved that the symmedians are concurrent, the point where they meet now being called the Lemoine point. Among other results on symmedians in Lemoine's\n1873\npaper is the result that the symmedian from the vertex\nA\nA\nA\ncuts the side\nB\nC\nBC\nB\nC\nof the triangle in the ratio of the squares of the sides\nA\nC\nAC\nA\nC\nand\nA\nB\nAB\nA\nB\n. He also proved that if parallels are drawn through the Lemoine point parallel to the three sides of the triangle then the six points lie on a circle, now called the Lemoine circle. Its centre is at the mid-point of the line joining the Lemoine point to the circumcentre of the triangle.\nYou can see the Lemoine point configuration by clicking\nTHIS LINK\nand the Lemoine circle configuration by clicking\nTHIS LINK\n.\nThese results are interesting but Lemoine's next venture failed to interest many mathematicians. He produced a classification of geometry according to five operations:-\nplacing a compass end on a given point,\nplacing a compass end on a given line,\ndrawing a circle with the compass so placed,\nplacing a straight edge on a given line,\ndrawing a line with the straight edge so placed.\nLemoine then classified the \"simplicity\" of a construction according to how many times these five operations had to be used. As an example of the types of results that he obtained was his study of the problem of constructing a circle tangent to three given circles: the\nApollonius\nproblem. The usual construction required over\n400\nof Lemoine's operations but he was able to reduce the number to\n199\n. He presented these results to the meeting of the Association Française pour l'Avancement des Sciences in\n1888\nat Oran in Algeria. One would have to say that these results were not thought to be particularly interesting by mathematicians at the meeting and there has been a similar lack of interest ever since.\nIt is perhaps worth asking what is interesting in mathematics. Why are these results of Lemoine not found interesting? All I\n[\nEFR\n]\ncan add is that I agree with the mathematicians of the time who preferred a construction with a large number of easily understood steps to a shorter one with sophisticated, rather obscure, steps. Let me add that I do find Lemoine's results on symmedians of a triangle to be very interesting and beautiful! He deserves much credit for showing that there are many interesting properties of the triangle waiting to be discovered.\nLemoine gave up active mathematical research in\n1895\nbut continued to support the subject. He had helped to found the mathematical journal\nL'intermédiaire des mathématiciens\nin\n1894\nand he became its first editor, a role he held for many years. Lemoine had been helped to found the journal by Charles-Ange Laisant\n(1841\n-\n1920)\n, who had been a fellow student at the École Polytechnique and had then served in the military before entering politics. The journal\nL'intermédiaire des mathématiciens\ncontinued to be published until\n1925\n.\nLet us end by quoting\nDavid E Smith\n's personal comments about Lemoine and his music. We note that the American\nDavid Smith\nwas a great lover of Paris and its culture and was a frequent visitor there where he met Lemoine\n[\n3\n]\n:-\nThe soirées of M and Mme Lemoine are justly celebrated, and each week of the winter sees an assemblage representing the 'anciens élèves' of the École Polytechnique, the École Normale, the Marine, and in general a good part of the scientific, literary, and artistic circles of Paris, to listen to a musical programme as original as the mathematical labours of the host. These soirées have exerted a great influence in a musical way, the type which they have fixed being adopted by many societies in and about Paris. One amusing feature of these meetings is the name which designates them. If the writer may be pardoned a personal allusion, he once attended an examination in the École Polytechnique by M\nHermann Laurent\n. It was one of the most severe he had ever seen, - an exceptionally bright young man submitted to an oral examination that would certainly have floored most American professors, - the examiner, a dyspeptic looking man as cold and as keen as steel and apparently as unsympathetic as ice, though in reality one of the most genial of men. To this justly celebrated mathematician, M\nLaurent\n, is due the name of M Lemoine's soirées, \"La Trompette\". Long ago he one day remarked to M Lemoine in a jesting way, as the latter was excusing himself to attend one of his musical reunions, \"Stay here with me, let the trumpet alone.\" Struck by the name, Lemoine adopted it, and La Trompette has ever since designated the delightful soirées with which the Paris cultured world is familiar. A final word concerning the modesty of M Lemoine. He estimates his position exactly. He says that he is not a mathematician. He has no claim to rank with\nHermite\n,\nPoincaré\n,\nPicard\n,\nPainlevé\n,\nAppell\n,\nJordan\n,\nBertrand\n,\nTannery\n,\nDarboux\n, or any of that famous circle which is making Paris such a centre of study in the fields of higher modern mathematics. But all mathematicians feel that he has done a noteworthy work in other lines, and for this his name will be known and prominently known in the history of mathematics.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Apollonius",
    "David E Smith",
    "David Smith",
    "Hermann Laurent",
    "Laurent",
    "Hermite",
    "Poincaré",
    "Picard",
    "Painlevé",
    "Appell",
    "Jordan",
    "Bertrand",
    "Tannery",
    "Darboux"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}