{
  "nome_completo": "Félix Edouard Justin Émile Borel",
  "nome_curto": "Émile Borel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borel/",
  "data_nascimento": "7 January 1871",
  "local_nascimento": "Saint Affrique, Aveyron, Midi-Pyrénées, France",
  "data_morte": "3 February 1956",
  "local_morte": "Paris, France",
  "summary": "Borel created the first effective theory of the measure of sets of points beginning of the modern theory of functions of a real variable.",
  "biografia": "Émile Borel\n's father was Honoré Borel who was a Protestant minister. Honoré Borel himself was the son of a craftsman from Montauben, the capital of Tarn-et-Garonne in the Midi-Pyrénées region. Émil's mother was Émilie Teissié-Solier who was the daughter of a rich wool merchant from Saint Affrique. Émilie's father was opposed to her marrying a minister, wanting her to marry a rich landowner from the district. As a result he disinherited her and bad feeling existed between Emilie and her father. At the time Émile was born, his parents were living in a fine eighteenth century house in which Honoré Borel had a school for the children of Protestant families in the neighbourhood. Honoré and Émilie had two daughters who were much older than Émile, being sixteen and fourteen years old when he was born. Honoré Borel was an intelligent man and for the first years of his son's life he educated him at home.\nWhen Émile was eleven years old he left home in Saint Affrique and went to live with his eldest sister, Madame Lebeau, who was married to a minister from Montauben. This meant that he was able to attend the Lycée at Montauben. There he showed extraordinary talents and, several years later, went to Paris as a bursar to the Collège Sainte-Barbe. While studying there, he attended courses at the Lycée Louis-le-Grand in preparation for taking the examinations to enter the École Polytechnique and the École Normale. He had the distinction of being ranked first in both these examinations and could choose either of the two universities. He also took first prize in the Concours Général. One might have expected this achievement to cause high praise to he heaped on the brilliant schoolboy. However\n[\n5\n]\n:-\nThe spectacular feat attracted a good deal of publicity, not all of it sympathetic. For there was a sneering reference by a prominent man to the ephemeral nature of schoolboy success and its quickly fading laurels with a challenge to the young champion to show himself in ten years time. Before half that time had passed the ungenerous critic could have been made to look foolish ...\nFamily friends urged Borel to enter the École Polytechnique, which was considered the more prestigious establishment, but he had other ideas.\nThe family friends were merchants and industrialists, and their advice was to aim at an occupation where he would make a lot of money. Borel was advised that a degree from the École Polytechnique would give him the best opportunities for a job in industry or business. He, however, had very strong views that he wanted a job in science, particularly in mathematics, and he was sure that the best opportunities for such a position would be achieved by studying at the École Normale. He did have the support of his father for his decision, entering in\n1889\n. We should mention a significant factor in his decision. While at the Lycée Louis-le-Grand he had met\nGaston Darboux\n's son who was a pupil there. The two became firm friends and through the Darboux family Borel came to know leading mathematicians of the day, in particular\nÉmile Picard\nwhom he later remarked was a major influence on him at this time.\nWhile studying at university he undertook military service with the engineers at Montpellier for a while but he seemed to be able to do this without too much disruption to his mathematical work. He published his first two mathematical papers in\n1890\n. These were fairly minor works but still remarkable for a young undergraduate student just starting his studies. In\n1892\nhe was awarded the\nagrégation\nin mathematics and in the same year his sixth paper, which is his first major memoir, was published. One year later he was awarded his doctorate after submitting his thesis\nSur quelques points de la théorie des fonctions\nⓉ\n(\nOn some points of the theory of functions\n)\n. His thesis advisor was\nGaston Darboux\n.\nCollingwood\nwrites\n[\n5\n]\nabout this published thesis:-\n... the theory of measure, Borel's theory of divergent series, his theory of non-analytic continuation and the theory of quasi-analytic functions all derive from ideas which make their first appearance in this paper. And it contained the explicit statement and proof of the famous covering theorem which, quite inappropriately, acquired the name of the\nHeine\n-Borel theorem ...\nLater Borel spoke about the mathematicians who had influenced him most in his early years mentioning, among others,\nCamille Jordan\n,\nÉmile Picard\n,\nPaul Appell\n,\nÉdouard Goursat\n,\nPaul Painlevé\nand\nMarcel Brillouin\n.\nAt almost exactly the same time that he was receiving his doctorate, when still only\n22\nyears of age, Borel was appointed Maître de Conférence at the University of Lille. He spent three years at Lille during which time he published\n22\npapers, with several others in the hands of the printer when he left. It was not only the quantity that is amazing but also the remarkable quality of the work that he produced. He returned to Paris in January\n1897\nwhen appointed Maître de Conférence at the École Normale Supérieure. Later in\n1897\nhe was joint secretary at the first International Congress of Mathematicians held in Zürich from\n9\nAugust to\n11\nAugust.\nBorel achieved much over the next years, both in his career and in the outstanding mathematics which he produced. From\n1899\nto\n1902\nhe taught at the Collège de France and was reserve for the Cours Peccot. He was appointed examiner for entry to the École Navale in\n1900\n, holding this position for ten years. He was awarded the Grand Prix of the\nAcademy of Sciences\nin\n1898\n, he was awarded the\nPoncelet\nPrize in\n1901\n, he received the Vaillant Prize in\n1904\n, and the Petit d'Ormcy Prize in\n1905\n. Also in\n1905\nhe was elected president of the\nFrench Mathematical Society\n.\nIn October\n1901\nhe had married Marguerite Appell, daughter of the mathematician\nPaul Appell\n. They had no children but adopted one of Borel's nephews, Fernand Lebeau, the son of his eldest sister whom he had lived with while a pupil at the Lycée at Montauben. Both his sister and her pastor husband had died young and, tragically, Fernand was later killed during World War I. Marguerite Borel was an outstanding author, writing under the pen name Camille Marbo\n(\nMarbo being the first three letters of Marguerite and the first two of Borel\n)\n, and received the distinction of being awarded the Prix Femina in\n1913\nfor\nLa Statue voilée\nⓉ\n(\nThe veiled statue\n)\n.\nIn\n1909\nBorel was appointed to a chair of Theory of Functions created specially for him at the Sorbonne and he went on to hold this professorship until\n1941\n. The year\n1910\nsaw him attain the prestigious position of Deputy Director of the École Normale Supérieure, on the death of\nJules Tannery\n, which he held for ten years. He later said that he regarded this appointment as the greatest honour he had received up to that time. During World War I he volunteered for military service and commanded an artillery battery\n[\n5\n]\n:-\nOn the outbreak of war, as his students left for the front, he had organised a project partly in Paris and partly at the front on sound-ranging; but in\n1915\nPainléve\n, then Minister of War, placed him in charge of a central department of research and inventions and later, when Prime Minister, appointed him Secretary-General in the Cambinet Office. On the fall of\nPainléve\nin\n1917\n, Borel returned for a time to the front ...\nIn\n1918\nhe received the Croix de Guerre for his efforts for his country during World War I. However returning to his position at the École Normale after the war ended proved emotionally very difficult for him. Half of his students had been killed, and his own adopted son had also been killed in the war. He resigned as Deputy Director of the École Normale in\n1920\nand this period marks a change in direction in both his career and in his research interests. In\n1921\nhe was elected to the\nAcadémie des Sciences\n, becoming its vice-president in\n1933\nand its president in\n1934\n. Also in\n1921\nhe was appointed to succeed Joseph Boussinesq in the chair of Probability and Mathematical Physics and, in the following year, he founded the Institut de Statistique de l'Université de Paris\n(\nInstitute of Statistics at the University of Paris\n)\n. In\n1928\n, with financial support from Rockefeller and Rothschild, he set up the Institut\nHenri Poincaré\n(\nthe Centre Émile Borel is now part of the Institute\n)\nand he ran the Institute for thirty years.\nIn\n[\n8\n]\nBorel's mathematical work is divided into the following topics: Arithmetic; Numerical series; Set theory; Measure of sets; Rarefaction of a set of measure zero; Real functions of real variables; Complex functions of complex variables; Differential equations; Geometry; Calculus of probabilities; and Mathematical physics. Borel created the first effective theory of the measure of sets of points. This work, along with that of two other French mathematicians,\nRené Baire\nand\nHenri Lebesgue\n, marked the beginning of the modern theory of functions of a real variable. Borel, although not the first to define the sum of a divergent series, was the first to develop a systematic theory for a divergent series which he did in\n1899\n. After\n1905\nhe became interested in the theory of probability. His contributions to this area are described in detail in\n[\n9\n]\nand we quote here part of the abstract of that paper:-\nIn addition to many textbooks, Borel published more than fifty papers between\n1905\nand\n1950\non the calculus of probability. They were mainly motivated or influenced by\nPoincaré\n,\nBertrand\n,\nReichenbach\n, and\nKeynes\n. However, he took for the most part an opposed view because of his realistic attitude toward mathematics. He stressed the important and practical value of\nprobability theory\n. He emphasized the applications to the different sociological, biological, physical, and mathematical sciences. He preferred to elucidate these applications instead of looking for an axiomatization of probability theory. Its essential peculiarities were for him unpredictability, indeterminism, and discontinuity. Nevertheless, he was interested in a clarification of the probability concept.\nIn addition, between\n1921\nand\n1927\n, Borel published a series of papers on\ngame theory\nand became the first to define games of strategy. During this period, however, he had already embarked on a political career. He wrote an important political work in\n1924\nLa politique républicaine\nⓉ\n(\nRepublican policy\n)\n[\n3\n]\n:-\n... and began the struggle for a united Europe, and with unbending optimism continued it for the rest of his life. ... In the meantime he joined the Republican-Socialist Party, the group to which Briand and\nPainlevé\nbelonged, and was elected deputy for Aveyron in\n1924\n, for St Affrique in\n1928\n.\nHe published many outstanding works over the years including\nLeçons sur la théorie des fonctions\nⓉ\n(\nLectures on the theory of functions\n)\n(1898)\n,\nLeçons sur les séries entières\nⓉ\n(\nLectures on the entire series\n)\n(1900)\n,\nLeçons sur les fonctions divergentes\nⓉ\n(\nLessons on divergent functions\n)\n(1901)\n,\nLeçons sur les fonctions de variables réelles et les développements en séries de polynômes\nⓉ\n(\nLessons on real variables functions and series expansions of polynomials\n)\n(1905)\n,\nLe Hasard\nⓉ\n(\nChance\n)\n(1913)\n,\nLeçons sur les fonctions monogènes uniformes d'une variable complexe\nⓉ\n(\nLessons on uniforms monogenic functions of a complex variable\n)\n(1917)\n,\nL'Espace et le temps\nⓉ\n(\nSpace and time\n)\n(1921)\n,\nMéthodes et problèmes de la théorie des fonctions\nⓉ\n(\nMethods and problems of the theory of functions\n)\n(1922)\n,\nTraité du calcul des probabilités et ses applications\nⓉ\n(\nTreaty of probability and its applications\n)\n(1924\n-\n1934)\n, and\nPrincipes et formules classiques du calcul des probabilités\nⓉ\n(\nPrinciples and classic formulas of probability\n)\n(1925)\n.\nAfter\n1924\n, Borel became active in the French government serving in the French Chamber of Deputies\n(1924\n-\n36)\nand as Minister of the Navy\n(\nApril to November\n1925)\n. During World War II he continued to produce mathematical works of great originality such as\nValeur pratique et philosophique des probabilités\nⓉ\n(\nPractical and philosophical value of probabilities\n)\n(1939)\n,\n(\nwith André Chéron\n)\nThéorie mathématique du bridge à la portée de tous\nⓉ\n(\nMathematical theory of bridge to everyone\n)\n(1940)\n,\nLe jeu, la chance et les théories scientifiques contemporaines\nⓉ\n(\nchance and contemporary scientific theories\n)\n(1941)\n,\nLes probabilités et la vie\nⓉ\n(\nProbability and life\n)\n(1943)\n, and\nEvolution de la mécanique\nⓉ\n(\nEvolution of mechanics\n)\n(1943)\n. However he was also involved in fighting with the Resistance and he was arrested and imprisoned at Fresnes for a month in\n1941\n, but soon released. After his imprisonment under the Vichy regime he continued working for the Resistance. After the war, he was awarded the Médaille de la Résistance with rosette, and the Grand Croix Légion d'Honneur\n(1950)\n. In\n1946\n, when he was\n75\nyears old, Borel published the fascinating book\nLes paradoxes de l'infini\nⓉ\n(\nThe paradoxes of infinity\n)\n. But further works were to come from his pen such as\nEléments de la théorie des ensembles\nⓉ\n(\nElements of set theory\n)\n(1949)\n,\nLes nombres inaccessibles\nⓉ\n(\nInaccessible numbers\n)\n(1952)\n, and\nL'imaginaire et le réel en mathématiques et en physique\nⓉ\n(\nThe imaginary and the real in mathematics and physics\n)\n(1952)\n. He also made\n[\n3\n]\n:-\n... a number of valuable contributions to the knowledge of\nEinstein\n's theory of relativity.\nFurther roles were given to this distinguished man such as being elected as a member of the Bureau des Longitudes in\n1946\nand being made president of the Science Committee of UNESCO in\n1948\n. For his scientific work he received the first gold medal of the Centre National de la Recherche Scientifique in\n1955\n.",
  "matematicos_citados_na_biografia": [
    "Gaston Darboux",
    "Émile Picard",
    "agrégation",
    "Collingwood",
    "Heine",
    "Camille Jordan",
    "Paul Appell",
    "Édouard Goursat",
    "Paul Painlevé",
    "Marcel Brillouin",
    "Academy of Sciences",
    "Poncelet",
    "French Mathematical Society",
    "Jules Tannery",
    "Painléve",
    "Académie des Sciences",
    "Henri Poincaré",
    "René Baire",
    "Henri Lebesgue",
    "Poincaré",
    "Bertrand",
    "Reichenbach",
    "Keynes",
    "probability theory",
    "game theory",
    "Painlevé",
    "Einstein"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}