{
  "nome_completo": "Emil Artin",
  "nome_curto": "Emil Artin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Artin/",
  "data_nascimento": "3 March 1898",
  "local_nascimento": "Vienna, Austria",
  "data_morte": "20 December 1962",
  "local_morte": "Hamburg, Germany",
  "summary": "Artin made a major contribution to the theory of noncommutative rings and later worked on rings with the minimum condition on right ideals, now called Artinian rings.",
  "biografia": "Emil Artin\n's father, also called Emil Artin, was an art dealer. Emil's mother was Emma Laura-Artin and she was an opera singer. All his life Emil would have a love of music which essentially equalled his love of mathematics. He was brought up in the town of Reichenberg in Bohemia which was then part of the Austrian Empire. Although the town today is called Liberec, and is in the northern Czech Republic, at the time that Emil was educated there it was a mainly German speaking city. As the centre of the textile industry it was often nicknamed the \"Bohemian Manchester\".\nArtin's childhood was not a particularly happy one and he recounted later in his life how he had felt lonely. He did not find himself attracted to mathematics at a very young age, contrary to what seems to happen to most mathematicians, and up to the age of sixteen the subject meant no more to him than any of his other school subjects and less than some. Rather surprisingly up to sixteen he did not show any particular talent for the subject; at least this was his own view of his schooldays when he spoke of them later in his life. The school subject which he did show talent for, and which he was most attracted towards, was chemistry. He spent a happy school year in France, the happiest of his schooldays, then his interests moved towards mathematics during his final two years at school.\nBy the time he took his school leaving examinations in\n1916\nin Reichenberg, Europe had already suffered two years of World War I. However Artin did begin his university career, enrolling at the University of Vienna. After one semester, however, he was drafted into the Austrian army and he served with this army until the end of the War. Then, in January\n1919\n, he entered the University of Leipzig where he continued his mathematics studies with Herglotz. Academic success came quickly and in\n1921\nhe was awarded his doctorate. His thesis concerned applying the methods of the theory of\nquadratic number fields\nto quadratic extensions of a field of\nrational functions\nof one variable taken over a finite prime field of constants. After receiving his doctorate he attended the University of Göttingen for one year\n(1921\n-\n22)\n. He went to the University of Hamburg as an assistant in October\n1922\nfor the start of winter semester of session\n1922\n-\n23\n. In\n1923\nhe had his\nHabilitation\nand accordingly became\nPrivatdozent\nat Hamburg.\nAt Hamburg Artin lectured on a wide variety of topics including mathematics, mechanics and relativity. He was promoted to extraordinary professor there in\n1925\n, then he became an ordinary professor in the following year. These were particularly productive years for Artin's research.\nBrauer\nwrote in\n[\n8\n]\n:-\nThe ten year period\n1921\n-\n1931\nof Artin's life\n[\nsaw\n]\nan activity not often equalled in the life of a mathematician.\nHe made a major contribution to field theory, the theory of braids and, around\n1928\n, he worked on rings with the minimum condition on right ideals, now called Artinian rings. He had the distinction of solving, in\n1927\n, one of the\n23\nfamous problems posed by\nHilbert\nin\n1900\n. Also in\n1927\nhe gave a general law of reciprocity which included all previously known laws of reciprocity which had been discovered from the time that\nGauss\nproduced his first law.\nField theory had been created by\nSteinitz\nin\n1910\n. It developed rapidly in the following decade and when Artin solved the following problem in\n1924\nhe was following the natural progression for the topic. The problem which he solved was whether, given an algebraically closed field\nO\nO\nO\n, there exist subfields\nK\nK\nK\n, properly contained in\nO\nO\nO\n, with\nO\nO\nO\nan algebraic extension of finite degree of its subfield\nK\nK\nK\n. In his\n1924\nattack on this problem Artin restricted himself to considering only fields which were an algebraic closure of the field of\nrationals\n. However, two years later in\n1926\nhe realised that his arguments actually proved more than he had originally thought, and he was able to solve the problem for any algebraically closed field of characteristic\n0\n. By this stage he had proved, using very clever arguments with\nGalois theory\nand\nCauchy\n's theorem on subgroups of prime order, that\nO\nO\nO\nhad to be an extension of\nK\nK\nK\nof degree\n2\nand that the subfield\nK\nK\nK\nhad to have the property that -\n1\ncould not be expressed as a sum of squares. In\n1926\nArtin published an important paper on joint work with Otto\nSchreier\nand we give some details below.\nBefore looking further at the joint\n1926\npaper of Artin and\nSchreier\nwe note that the pair published a\n1927\npaper in which they were able to handle the problem described above in the case of fields of prime characteristic. In this\n1927\nwork they introduced what are called today Artin-\nSchreier\ncyclic extensions of degree\np\np\np\n. In fact, in the case of prime characteristic, they proved that the field\nO\nO\nO\ncannot be a finite extension of a proper subfield\nK\nK\nK\n.\nThe earlier research by Artin and\nSchreier\nhad led them to define what today are called formally real fields, they are fields with the property that -\n1\ncannot be expressed as a sum of squares. They also defined real-closed fields to be those that were formally real yet every algebraic extension of them failed to be formally real. Artin himself proved that when\nO\nO\nO\nis the field of algebraic numbers, the subfield\nK\nK\nK\nof real\nalgebraic numbers\nsolves the problem and, moreover, it is the unique solution up to automorphisms of the field\nO\nO\nO\n. Artin and\nSchreier\npublished in their famous\n1926\npaper their studies of all formally real fields and real closed fields, showing that a specific ordering could be defined on them. Now that the connection had been made with ordered fields, Artin was able to apply these methods to solve\nHilbert\n's\n17\nth\nproblem. Artin gave a complete solution in the paper\nÜber die Zerlegung definiter Funcktionen in Quadrate\nⓉ\n(\nOn the decomposition of definite functions in squares\n)\nalso published in\n1927\n. It is also worth noting that the theory of real-closed fields directly influenced\nAbraham Robinson\nin his contributions to model theory, particularly for the concepts of model completeness and model completion, see for example\n[\n5\n]\n.\nThe path which led Artin to his reciprocity law began while he was still a student. In\n1920\nTakagi\npublished his fundamental paper on class field theory in which he built the theory around a remarkable fact which he had discovered, namely that the set of class fields, as defined by\nHeinrich Weber\n, over a fixed ground field\nk\nk\nk\nis identical to the set of abelian extension fields over\nk\nk\nk\n. Artin took the work of\nTakagi\nforward making several major steps. He defined a new type of\nL\nL\nL\n-series, which generalised\nDirichlet\n's\nL\nL\nL\n-series, yet was quite different in nature. In\n1923\nin\nÜber eine neue Art von L-Reihen\nⓉ\n(\nOn a new type of L-series\n)\nArtin was able to obtain special cases of the results which were clearly forming in his mind and these special cases depended on the use of existing reciprocity laws. However, in\n1927\nhe published his masterpiece on the subject\nBeweis des allgemeinen Reziprozitätsgesetzes\nⓉ\n(\nEvidence of the general reciprocity law\n)\nwhere now he had developed the results differently.\nThe new idea originated in work which Nikolai\nChebotaryov\npublished in\n1924\nwhere he had proved a conjecture made by\nFrobenius\nabout the density of the set of prime ideals of a normal extension field. It was not\nChebotaryov\n's result which was seen to be so important for Artin's theories, rather it was a method he used in his proof. With this idea as a basis Artin was able to reverse his\n1923\napproach. Instead of using the existing reciprocity laws, Artin proved his theorems based on the new approach which then yielded a new reciprocity law which contained all previous reciprocity laws. The theorems of Artin's\n1927\npaper have became central results in abelian class field theory. Roquette writes\n[\n12\n]\n:-\nIn my opinion, the main importance of Artin's Reciprocity Law is that it opens a new viewpoint on those classical laws, formulating it as an isomorphism theorem. The situation is similar to that with\nGalois\nTheory which, today, is formulated in the framework of abstract algebra, and in this form opens new applications and generalizations. Similarly, Artin's Reciprocity Law opens the way to new applications and progress.The most striking application was given by\nFurtwängler\n's proof of the principal ideal theorem of class field theory, given one year after the publication of Artin's Reciprocity Law.\nAnother important piece of work done by Artin during his first period in Hamburg was the theory of braids which he presented in\n1925\n. He again showed his originality by introducing this new area of research which today is being studied by an increasing number of mathematicians working in\ngroup theory\n,\nsemigroup theory\n, and\ntopology\n.\nArtin made a number of conjectures which have played a large role in the development of mathematics. Two of these, mentioned by Roquette in\n[\n12\n]\n, have wide interest, namely:-\nFirst, the analogue of the\nRiemann\nconjecture for the\nzeta function\nof a curve over finite fields. In his seminal Ph.D. thesis Artin verified this in a number of cases numerically. In\n1933\nHasse\nsucceeded in proving this for elliptic curves, and in\n1942\nWeil\nfor arbitrary curves. Later, as is well known,\nDeligne\ngeneralized this for arbitrary varieties. Thus, this conjecture of Artin was the origin of a wide range of activities in what is now called arithmetic geometry.\nSecond, there is Artin's conjecture on primitive roots. Given any integer g not\n1\nor -\n1\n, and g not a power of some other integer, then Artin conjectured that there are infinitely many prime numbers p such that g is a primitive root modulo p in the sense of\nGauss\n. More precisely: the set of those prime numbers has positive density, which can be written down and computed explicitly. Artin made this conjecture to\nHasse\non\n27\nSeptember\n1927\n(\naccording to an entry in\nHasse\n's diary\n)\n, and since then many mathematicians have tried to prove it. Hooley has proved it under the condition that a strong form of\nRiemann\n's hypothesis\n(\nfor number fields\n)\nis valid. There are very interesting unconditional results, proved by Heath-Brown and others. Again, Artin's conjecture triggered a lot of interesting activities in\nnumber theory\n.\nArtin married one of his students, Natalie Jasny, in\n1929\n[\n8\n]\n:-\nHis family now occupied a central position in his life. When his children were growing up, he took a most active part in all phases of their education. He spent hours with them every day, and it was of foremost importance to him to instil in them his own personal and cultural standards.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Artin was not a Jew and was not affected by these laws. However his wife was a Jew so when the 'New Official's Law' was passed in\n1937\nthose related to Jews by marriage were affected. Artin\n[\n8\n]\n:-\n... with his feeling for individual freedom, his sense of justice, his abhorrence of physical violence ...\nhad no real alternative but to leave Germany. In\n1937\nhe emigrated to the United States and taught at various universities there. He was at Notre Dame for the academic year\n1937\n-\n38\n, he spent eight years at Bloomington at Indiana University from\n1938\nto\n1946\n, and then he was twelve years at Princeton from\n1946\nto\n1958\n.\nDuring his years in the United States Artin put his energies into teaching and supervising his Ph.D. students who themselves went on to make major contributions. He published relatively few papers, but he wrote a number of extremely important texts which have become classics. In\n1944\nhe did fundamental work on rings with the minimum condition on right ideals, now called Artinian rings. He presented new insight into semi-simple algebras over the rationals. In\n1955\nhe produced two important papers on finite\nsimple groups\n, proving that the only coincidences in orders of the known\n(\nin\n1955)\nfinite simple groups were those given by\nDickson\nin his\nLinear groups\n. This important piece of work is one of a number of results leading to the intense interest in finite simple groups which eventually led to their classification.\nAmong Artin's main books are\nGalois theory\n(1942)\n,\nRings with minimum condition\n(1948)\nwritten jointly was C J Nesbitt and R M Thrall,\nGeometric algebra\n(1957)\nand\nClass field theory\n(1961)\nwritten with\nJ T Tate\n.\nPerhaps his views on teaching and writing texts are best illustrated by a quotation from a review he wrote in\n1953\n:-\nWe all believe that mathematics is an art. The author of a book, the lecturer in a classroom tries to convey the structural beauty of mathematics to his readers, to his listeners. In this attempt, he must always fail. Mathematics is logical to be sure, each conclusion is drawn from previously derived statements. Yet the whole of it, the real piece of art, is not linear; worse than that, its perception should be instantaneous. We have all experienced on some rare occasion the feeling of elation in realising that we have enabled our listeners to see at a moment's glance the whole architecture and all its ramifications.\nIn\n1958\nArtin returned to Germany, being appointed again to the University of Hamburg which he had left in such unhappy circumstances over\n20\nyears before. He made the decision to return to Germany in\n1956\n, for in that year he took his first ever sabbatical leave which he spent in Germany. It was his first visit to that country since he left it in the grip of the Nazis in\n1937\n. During his sabbatical leave he revisited universities which had a special place in his mathematical achievements. He taught for a term in Göttingen and then returned to Hamburg where he also taught for a term. In\n1958\nArtin returned to Hamburg and, in a moving passage in\n[\n8\n]\n,\nBrauer\ndescribes walking through the streets of Hamburg with Artin in November\n1958\n:-\nWe took a long walk one afternoon talking of old times. It was one of those misty, melancholy, and rather miserable days which all northern harbour cities know so well in late fall. We wandered endlessly through the streets searching, I did not know for what, until I realised, it was a Hamburg which no longer existed and times which were gone for ever. Before Artin's eyes, I believe, there must have been the picture of the young Artin who had walked through the same streets thirty years before, full of life and strength.\nArtin had many interests outside mathematics, however, having a love of chemistry, astronomy and biology. He also loved music and was an accomplished musician playing the flute, harpsichord and clavichord. Roquette writes\n[\n12\n]\n:-\nI remember in Hamburg when he once told me of a conference on electronic music which he had attended.\nAn amateur astronomer, he even built his own telescope as a hobby.\nIn\n[\n1\n]\nhis influence is described as follows:-\nArtin's scientific achievements are only partially set forth in his papers and textbooks and in the drafts of his lectures, which often contain new insights. They are also to be seen in his influence on many mathematicians of his period, especially his Ph.D. candidates\n(\neleven in Hamburg, two in Bloomington, eighteen in Princeton\n)\n.",
  "matematicos_citados_na_biografia": [
    "quadratic number fields",
    "rational functions",
    "Habilitation",
    "Privatdozent",
    "Brauer",
    "Hilbert",
    "Gauss",
    "Steinitz",
    "rationals",
    "Galois theory",
    "Cauchy",
    "Schreier",
    "algebraic numbers",
    "Abraham Robinson",
    "Takagi",
    "Heinrich Weber",
    "Dirichlet",
    "Chebotaryov",
    "Frobenius",
    "Galois",
    "Furtwängler",
    "group theory",
    "semigroup theory",
    "topology",
    "Riemann",
    "zeta function",
    "Hasse",
    "Weil",
    "Deligne",
    "number theory",
    "simple groups",
    "Dickson",
    "J T Tate"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}