{
  "nome_completo": "Erastus Lyman De Forest",
  "nome_curto": "Erastus De Forest",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Forest/",
  "data_nascimento": "27 June 1834",
  "local_nascimento": "Watertown, Connecticut, USA",
  "data_morte": "6 June 1888",
  "local_morte": "Watertown, Connecticut, USA",
  "summary": "Erastus De Forest was an American mathematician and statistician and an early user of Monte Carlo methods.",
  "biografia": "Erastus De Forest\n's parents were Lucy Starr Lyman and Dr John De Forest. He was named after his mother's father, Erastus Lyman, who was from Litchfield, Connecticut. Both sides of the family were well off and Erastus was born into a privileged place in society.  John De Forest graduated from Yale College and wished his son to follow in his footsteps as indeed he did, entering Yale at the age of sixteen to study mathematics. He was awarded his B.A. in\n1854\nand his father celebrated the occasion by endowing the De Forest Mathematical Prize at Yale. Erastus's maternal grandfather celebrated the occasion by making him a large bequest.\nDe Forest remained at Yale to study engineering and at this time was a fellow student with\nJ Willard Gibbs\nwho entered Yale in the year that De Forest was awarded his B.A. In\n1856\nDe Forest was awarded a Ph.B. by Yale and then in February of the following year he set off with his aunt for New York to begin a journey with her to Havana. However, before the ship was due to depart De Forest vanished leaving his luggage. When his family could find no trace of him they put an advertisement in the\nNew York Times\nasking for information. They received a reply which told them his body was in East River but a search revealed nothing.\nFor two years De Forest's family continued to make desperate efforts to locate him but receiving not a shred of information they came to believe that he must have been murdered. It was more than two years after he vanished that John De Forest received a letter from his son, posted in Australia. De Forest, depressed with his privileged life, had travelled to California where he had got a job at a mine. After a while he was appointed as a teacher in a private school where he taught for about a year before going to Australia where again he taught, this time at Melbourne Church of England Grammar School in South Yarra. After more than four years away, he returned to the United States in\n1861\nvisiting India and England on his way. He returned to Europe in\n1863\nfor a lengthy trip which lasted until\n1865\n.\nFrom his return to Connecticut in\n1865\nhe devoted himself to the study of mathematics. After publishing papers interpolation and its applications, he was asked by his uncle, who was President of the Knickerbocker Life Insurance Company of New York, to examine the liabilities that the company's life policies involved. De Forest became deeply involved in improving mortality tables, publishing over\n20\npapers on the topic between\n1870\nand\n1885\n[\n4\n]\n:-\nIn a tour de force that anticipated much of the work that would appear over the following half-century, he introduced formal optimality criteria for smoothness, and he borrowed statistical ideas from astronomy in developing and fully investigating the use of least squares methods in this area.\nThe remarkable contributions of De Forest to statistics had little or no influence on the subject since those who later developed similar ideas were totally unaware of his contributions. This was for a number of reasons. De Forest was not associated with any institution so lacked the visibility that such a position would have meant. He worked in the United States at a time when little of mathematical significance was happening in that country. Also he published his work in somewhat obscure American journals. His contributions were recognised, however, by\nPearson\nwhose attention was drawn to De Forest's papers.\nPearson\nacknowledged De Forest's priority in deriving the chi square distribution. The book\n[\n2\n]\ncontains reprints of four of De Forest's papers as well as a biographical article written by J Anderson. His life and work are both discussed by Stigler in\n[\n6\n]\nand also in\n[\n4\n]\n. Stigler uses information on De Forest available to him from a well researched but unpublished work on De Forest by H H Wolfenden.\nDe Forest never married and cared for his father for many years until his death in\n1885\n, from which time his own health began to deteriorate. Shortly before he died he founded the Erastus L De Forest Professorship of Mathematics at Yale.",
  "matematicos_citados_na_biografia": [
    "J Willard Gibbs",
    "Pearson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}