{
  "nome_completo": "Erwin Rudolf Josef Alexander Schrödinger",
  "nome_curto": "Erwin Schrödinger",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schrodinger/",
  "data_nascimento": "12 August 1887",
  "local_nascimento": "Erdberg, Vienna, Austria",
  "data_morte": "4 January 1961",
  "local_morte": "Vienna, Austria",
  "summary": "Erwin Schrödinger made important contributions to the development of Quantum Mechanics and received a Nobel prize in 1933 .",
  "biografia": "Erwin Schrödinger\n's father, Rudolf Schrödinger, ran a small linoleum factory which he had inherited from his own father. Erwin's mother, Emily Bauer, was half English, this side of the family coming from Leamington Spa, and half Austrian with her father coming from Vienna.\nSchrödinger learnt English and German almost at the same time due to the fact that both were spoken in the household. He was not sent to elementary school, but received lessons at home from a private tutor up to the age of ten. He then entered the Akademisches\nGymnasium\nin the autumn of\n1898\n, rather later than was usual since he spent a long holiday in England around the time he might have entered the school. He wrote later about his time at the Gymnasium:-\nI was a good student in all subjects, loved mathematics and physics, but also the strict logic of the ancient grammars, hated only memorising incidental dates and facts. Of the German poets, I loved especially the dramatists, but hated the pedantic dissection of their works.\nIn\n[\n16\n]\nthere is the following quotation from a student in Schrödinger's class at school:-\nEspecially in physics and mathematics, Schrödinger had a gift for understanding that allowed him, without any homework, immediately and directly to comprehend all the material during the class hours and to apply it. After the lecture ... it was possible for\n[\nour professor\n]\nto call Schrödinger immediately to the blackboard and to set him problems, which he solved with playful facility.\nSchrödinger graduated from the Akademisches Gymnasium in\n1906\nand, in that year, entered the University of Vienna. In theoretical physics he studied analytical mechanics, applications of\npartial differential equations\nto dynamics,\neigenvalue\nproblems,\nMaxwell\n's equations and electromagnetic theory, optics, thermodynamics, and\nstatistical mechanics\n. It was Fritz Hasenöhrl's lectures on theoretical physics which had the greatest influence on Schrödinger. In mathematics he was taught calculus and algebra by\nFranz Mertens\n, function theory,\ndifferential equations\nand mathematical statistics by\nWilhelm Wirtinger\n(\nwhom he found uninspiring as a lecturer\n)\n. He also studied\nprojective geometry\n, algebraic curves and\ncontinuous groups\nin lectures given by Gustav Kohn.\nOn\n20\nMay\n1910\n, Schrödinger was awarded his doctorate for the dissertation\nOn the conduction of electricity on the surface of insulators in moist air\n. After this he undertook voluntary military service in the fortress artillery. Then he was appointed to an assistantship at Vienna but, rather surprisingly, in experimental physics rather than theoretical physics. He later said that his experiences conducting experiments proved an invaluable asset to his theoretical work since it gave him a practical philosophical framework in which to set his theoretical ideas.\nHaving completed the work for his\nhabilitation\n, he was awarded the degree on\n1\nSeptember\n1914\n. That it was not an outstanding piece of work is shown by the fact that the committee was not unanimous in recommending him for the degree. As Moore writes in\n[\n8\n]\n:-\nSchrödinger's early scientific work was inhibited by the absence of a group of first-class theoreticians in Vienna, against whom he could sharpen his skills by daily argument and mutual criticism.\nIn\n1914\nSchrödinger's first important paper was published developing ideas of\nBoltzmann\n. However, with the outbreak of World War I, Schrödinger received orders to take up duty on the Italian border. His time of active service was not wasted as far as research was concerned, however, for he continued his theoretical work, submitting another paper from his position on the Italian front. In\n1915\nhe was transferred to duty in Hungary and from there he submitted further papers for publication. After being sent back to the Italian front, Schrödinger received a citation for outstanding service commanding a battery during a battle.\nIn the spring of\n1917\nSchrödinger was sent back to Vienna and assigned to teach a course in meteorology. He was able to continue research and it was at this time that he published his first results on\nquantum theory\n. After the end of the war he continued working at Vienna. From\n1918\nto\n1920\nhe made substantial contributions to the theory of colour vision.\nSchrödinger had worked at Vienna on radioactivity, proving the statistical nature of radioactive decay. He had also made important contributions to the kinetic theory of solids, studying the dynamics of crystal lattices. On the strength of his work he was offered an associate professorship at Vienna in January\n1920\nbut by this time he wished to marry Anny Bertel. They had become engaged in\n1919\nand Anny had come to work as a secretary in Vienna on a monthly salary which was more than Schrödinger's annual income. Then he was offered an associate professorship, still not at a salary large enough to support a non-working wife, so he declined.\nSchrödinger accepted instead an assistantship in Jena and this allowed him to marry Anny on\n24\nMarch\n1920\n. After only a short time there, he moved to a chair in Stuttgart where he became friendly with\nHans Reichenbach\n. He then moved to a chair at Breslau, his third move in eighteen months. Soon however he was to move yet again, accepting the chair of theoretical physics in Zürich in late\n1921\n. During these years of changing from one place to another, Schrödinger studied physiological optics, in particular he continued his work on the theory of colour vision.\nWeyl\nwas Schrödinger's closest colleague in his first years in Zürich and he was to provide the deep mathematical knowledge which would prove so helpful to Schrödinger in his work. The intellectual atmosphere in Zürich suited Schrödinger and Zürich was to be the place where he made his most important contributions. From\n1921\nhe studied atomic structure, then in\n1924\nhe began to study quantum statistics. Soon after this he read\nde Broglie\n's thesis which became a turning point in the direction of his research and had a major influence on his thinking. On\n3\nNovember\n1925\nSchrödinger wrote to\nEinstein\n:-\nA few days ago I read with great interest the ingenious thesis of\nLouis de Broglie\n, which I finally got hold of...\nOn\n16\nNovember, in another letter, Schrödinger wrote:-\nI have been intensely concerned these days with\nLouis de Broglie\n's ingenious theory. It is extraordinarily exciting, but still has some very grave difficulties.\nOne week later Schrödinger gave a seminar on\nde Broglie\n's work and a member of the audience, a student of\nSommerfeld\n's, suggested that there should be a wave equation. Within a few weeks Schrödinger had found his wave equation.\nSchrödinger published his revolutionary work relating to wave mechanics and the general theory of relativity in a series of six papers in\n1926\n. In its most general form, the time-dependent Schrödinger equation describes the time evolution of closed quantum physical systems as\ni\nℏ\n∂\n∂\nt\nψ\n(\nr\n,\nt\n)\n=\nH\n^\nψ\n(\nr\n,\nt\n)\ni \\hbar  \\Large\\frac{\\partial }{\\partial t}\\normalsize  \\psi(\\textbf {r}, t) = \\hat {H} \\psi(\\textbf {r}, t)\ni\nℏ\n∂\nt\n∂\n​\nψ\n(\nr\n,\nt\n)\n=\nH\n^\nψ\n(\nr\n,\nt\n)\nwhere\ni\ni\ni\nis the imaginary unit,\n∂\n∂\nt\n\\Large\\frac{\\partial }{\\partial t}\\normalsize\n∂\nt\n∂\n​\nis partial differentiation with respect to time\nt\n,\nψ\nt, \\psi\nt\n,\nψ\nis the wave function of the quantum system,\nr\nand\nt\nt\nt\nare the position vector and time respectively, and\nH\n^\nĤ\nH\n^\nis the Hamiltonian operator characterizing the total energy of the quantum system.\nWave mechanics, as proposed by Schrödinger in these papers, was the second formulation of quantum theory, the first being\nmatrix\nmechanics due to\nHeisenberg\n. The relation between the two formulations of wave mechanics and matrix mechanics was understood by Schrödinger immediately as this quotation from one of his\n1926\npapers shows:-\nTo each function of the position- and momentum- coordinates in wave mechanics there may be related a matrix in such a way that these matrices, in every case satisfy the formal calculation rules of\nBorn\nand\nHeisenberg\n. ... The solution of the natural\nboundary value problem\nof this differential equation in wave mechanics is completely equivalent to the solution of\nHeisenberg\n's algebraic problem.\nThe work was indeed received with great acclaim.\nPlanck\ndescribed it as:-\n... epoch-making work.\nEinstein\nwrote:-\n... the idea of your work springs from true genius...\nThen, ten days later\nEinstein\nwrote again:-\nI am convinced that you have made a decisive advance with your formulation of the quantum condition...\nEhrenfest\nwrote:-\nI am simply fascinated by your\n[\nwave equation\n]\ntheory and the wonderful new viewpoint it brings. Every day for the past two weeks our little group has been standing for hours at a time in front of the blackboard in order to train itself in all the splendid ramifications.\nThe author of Schrödinger's obituary in\nThe Times\nwrote\n[\n3\n]\n:-\nThe introduction of wave mechanics stands ... as Schrödinger's monument and a worthy one.\nSchrödinger accepted an invitation to lecture at the University of Wisconsin, Madison, leaving in December\n1926\nto give his lectures in January and February\n1927\n. Before he left he was told he was the leading candidate for\nPlanck\n's chair in Berlin. After giving a brilliant series of lectures in Madison he was offered a permanent professorship there but\n[\n8\n]\n:-\n... he was not at all tempted by an American position, and he declined on the basis of a possible commitment to Berlin.\nThe list of candidates to succeed\nPlanck\nin the chair of theoretical physics at Berlin was impressive.\nSommerfeld\nwas ranked in first place, followed by Schrödinger, with\nBorn\nas the third choice. When\nSommerfeld\ndecided not to leave Munich, the offer was made to Schrödinger. He went to Berlin, taking up the post on\n1\nOctober\n1927\nand there he became a colleague of\nEinstein\n's.\nAlthough he was a Catholic, Schrödinger decided in\n1933\nthat he could not live in a country in which persecution of Jews had become a national policy. Alexander Lindemann, the head of physics at Oxford University, visited Germany in the spring of\n1933\nto try to arrange positions in England for some young Jewish scientists from Germany. He spoke to Schrödinger about posts for one of his assistants and was surprised to discover that Schrödinger himself was interested in leaving Germany. Schrödinger asked for a colleague, Arthur March, to be offered a post as his assistant.\nTo understand Schrödinger's request for March we must digress a little and comment on Schrödinger's liking for women. His relations with his wife had never been good and he had had many lovers with his wife's knowledge. Anny had her own lover for many years, Schrödinger's friend\nWeyl\n. Schrödinger's request for March to be his assistant was because, at that time, he was in love with Arthur March's wife Hilde.\nMany of the scientists who had left Germany spent the summer of\n1933\nin the South Tyrol. Here Hilde became pregnant with Schrödinger's child. On\n4\nNovember\n1933\nSchrödinger, his wife and Hilde March arrived in Oxford. Schrödinger had been elected a fellow of Magdalen College. Soon after they arrived in Oxford, Schrödinger heard that, for his work on wave mechanics, he had been awarded the Nobel prize.\nIn the spring of\n1934\nSchrödinger was invited to lecture at Princeton and while there he was made an offer of a permanent position. On his return to Oxford he negotiated about salary and pension conditions at Princeton but in the end he did not accept. It is thought that the fact that he wished to live at Princeton with Anny and Hilde both sharing the upbringing of his child was not found acceptable. The fact that Schrödinger openly had two wives, even if one of them was married to another man, did not go down too well in Oxford either, but his daughter Ruth Georgie Erica was born there on\n30\nMay\n1934\n.\nIn\n1935\nSchrödinger published a three-part essay on\nThe present situation in quantum mechanics\nin which his famous Schrödinger's cat paradox appears. This was a thought experiment where a cat in a closed box either lived or died according to whether a quantum event occurred. The paradox was that both universes, one with a dead cat and one with a live one, seemed to exist in parallel until an observer opened the box.\nIn\n1936\nSchrödinger was offered the chair of physics at the University of Edinburgh in Scotland. He may have accepted that post but for a long delay in obtaining a work permit from the Home Office. While he was waiting he received an offer from the University of Graz and he went to Austria and spent the years\n1936\n-\n1938\nin Graz.\nBorn\nwas then offered the Edinburgh post which he quickly accepted.\nHowever the advancing Nazi threat caught up with Schrödinger again in Austria. After the Anschluss the Germans occupied Graz and renamed the university Adolf Hitler University. Schrödinger wrote a letter to the University Senate, on the advice on the new Nazi rector, saying that he had:-\n... misjudged up to the last the true will and the true destiny of my country. I make this confession willingly and joyfully...\nIt was a letter he was to regret for the rest of his life. He explained the reason to\nEinstein\nin a letter written about a year later:-\nI wanted to remain free - and could not do so without great duplicity.\nThe Nazis could not forget the insult he had caused them when he fled from Berlin in\n1933\nand on\n26\nAugust\n1938\nhe was dismissed from his post for 'political unreliability'. He went to consult an official in Vienna who told him that he must get a job in industry and that he would not be allowed to go to a foreign country. He fled quickly with Anny, this time to Rome from where he wrote to\nde Valera\nas President of the League of Nations.\nDe Valera\noffered to arrange a job for him in Dublin in the new Institute for Advanced Studies he was trying to set up. From Rome, Schrödinger went back to Oxford, and there he received an offer of a one year visiting professorship at the University of Gent.\nAfter his time in Gent, Schrödinger went to Dublin in the autumn of\n1939\n. There he studied electromagnetic theory and relativity and began to publish on a unified field theory. His first paper on this topic was written in\n1943\n. In\n1946\nhe renewed his correspondence with\nEinstein\non this topic. In January\n1947\nhe believed he had made a major breakthrough\n[\n8\n]\n:-\nSchrödinger was so entranced by his new theory that he threw caution to the winds, abandoned any pretence of critical analysis, and even though his new theory was scarcely hatched, he presented it to the Academy and to the Irish press as an epoch-making advance.\nThe\nIrish Times\ncarried an interview with Schrödinger the next day in which he said:-\nThis is the generalisation. Now the\nEinstein\nTheory becomes simply a special case... I believe I am right, I shall look an awful fool if I am wrong.\nEinstein\n, however, realised immediately that there was nothing of merit in Schrödinger's 'new theory'\n[\n8\n]\n:-\n[\nSchrödinger\n]\nwas even thinking of the possibility of receiving a second Nobel prize. In any case, the entire episode reveals a lapse in judgment, and when he actually read\nEinstein\n's comment, he was devastated.\nEinstein\nwrote immediately saying that he was breaking off their correspondence on unified field theory. Unified field theory was, however, not the only topic to interest him during his time at the Institute for Advanced Study in Dublin. His study of Greek science and philosophy is summarised in\nNature and the Greeks\n(1954)\nwhich he wrote while in Dublin. Another important book written during this period was\nWhat is life?\n(1944)\nwhich led to progress in biology.\nOn the personal side Schrödinger had two further daughters while in Dublin, to two different Irish women. He remained in Dublin until he retired in\n1956\nwhen he returned to Vienna and wrote his last book\nMeine Weltansicht\nⓉ\n(\nMy world view\n)\n(1961)\nexpressing his own metaphysical outlook.\nDuring his last few years Schrödinger remained interested in mathematical physics and continued to work on general relativity, unified field theory and meson physics.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "partial differential equations",
    "eigenvalue",
    "Maxwell",
    "statistical mechanics",
    "Franz Mertens",
    "differential equations",
    "Wilhelm Wirtinger",
    "projective geometry",
    "continuous groups",
    "habilitation",
    "Boltzmann",
    "quantum theory",
    "Hans Reichenbach",
    "Weyl",
    "de Broglie",
    "Einstein",
    "Louis de Broglie",
    "Sommerfeld",
    "matrix",
    "Heisenberg",
    "Born",
    "boundary value problem",
    "Planck",
    "Ehrenfest",
    "de Valera",
    "De Valera"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}