{
  "nome_completo": "Jean Étienne Montucla",
  "nome_curto": "Étienne Montucla",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montucla/",
  "data_nascimento": "5 September 1725",
  "local_nascimento": "Lyon, France",
  "data_morte": "18 December 1799",
  "local_morte": "Versailles, France",
  "summary": "Étienne Montucla was a French historian of mathematics who wrote in 1754 a history of the problem of squaring the circle.",
  "biografia": "Étienne Montucla\n's father was a merchant who lived and worked in Lyon. It was in that town that his son Étienne was born, was brought up, and began his education.\nÉtienne was educated in the Jesuit College in Lyon but, in\n1741\n, while he was studying there his father died and he was left an orphan. At this stage his grandmother took over his upbringing. Étienne was interested in a wide range of studies at the Jesuit College. Riddle writes in\n[\n4\n]\n:-\nHis attention was chiefly directed to the ancient classics; but having a natural taste for philosophical studies, and a powerful memory, he was enabled to acquire an accurate knowledge of several modern languages; among which Italian, German, Dutch, and English are mentioned. Under Le Père Bêraud, who was subsequently the tutor of\nLalande\n, he made considerable proficiency in the study of mathematics and physics.\nIn\n1745\nMontucla's grandmother died and at this point he went to Toulouse where he began to study law. After completing his studies at Toulouse, he decided to go to Paris which would be the most suitable place to gain further legal training. There he became friends with Diderot,\nLalande\nand\nd'Alembert\nwhom he met at the scientific soirées organised by Charles Antoine Jombert. He made many other friends among the top mathematicians of his day, and he began to combine his many interests and study the history of mathematics. Making the acquaintance of Jombert had other advantages, for he was a bookseller and publisher. The advice from Jombert,\nd'Alembert\nand Diderot set Montucla on the road of publishing on the history of mathematics.\nHis first work was\nHistoire des recherches sur la quadrature du cercle\nⓉ\n(\nHistory of research on squaring the circle\n)\nwhich was published by Jombert in Paris in\n1754\n, and the high regard in which this work was held can be judged by the fact that on the strength of this work alone Montucla was elected a corresponding member of the\nBerlin Academy\n. Although the history of the problem of\nsquaring the circle\nhas changed greatly since Montucla's day this book is still a classic of its kind. Already at this time he was working on his masterpiece,\nHistoire des mathématiques\nⓉ\n(\nHistory of Mathematics\n)\n, and in\n1754\nhe announced that it would be published at a future date. He was undertaking a very major task, one which had never really been undertaken in this form before, and four years would pass before publication. Montucla needed an income to allow him to pursue his research interests and around this time he worked at the\nGazette de Paris\n.\nIn\n1756\nMontucla published a work which shows the breadth of his scientific interests. A collaboration with the physician Joseph Morisot-Deslandes led to the publication of\nRecueil de pièces concernant l'inoculation de la petite vérole et propres à en prouver la sécurité et l'utilité\nⓉ\n(\nCollection of documents concerning the inoculation of smallpox and specifically to prove the safety and utility\n)\n, which provided a collection of sources on smallpox vaccination. Then in\n1758\nhe published his two volume work, again with Jombert as his publisher,\nHistoire des mathématiques\n. The first volume covered the history of mathematics from ancient times to\n1700\n, while the second volume was entirely devoted to\n17\nth\ncentury mathematics. Vogel\n[\n6\n]\ndescribes Montucla's treatise as:-\n... the first attempt of a history of mathematical ideas and problems.\n[\nEarlier works being mostly\n]\nlists of names, titles and dates ...\nMontucla had been intending to produce a third volume covering the first half of the\n18\nth\ncentury but the volume of work which had appeared during this time, and the difficulties of putting recent work into its historical context, led him to give up this aim. These two volumes rightly led to Montucla gaining a high reputation in Paris and he began to work for the French government.\nIn\n1761\nhe went to Grenoble where he was appointed to the position of intendant to Dauphiné. Dauphiné was a region of south-eastern France which had originally been independent. In the\n14\nth\ncentury it had been sold to Charles V of France who then ceded Dauphiné to his heir, a practice which later Kings continued. A Parlement of Dauphiné was created in\n1453\nby the son of Charles VII who used his position there to cause an argument with his father, who then responded by annexing Dauphiné to France. In\n1628\nthe French government appointed an intendant to Dauphiné to prevent any notions of independence it might have. The intendant was an important royal official with control over the area, and it was to that position that Montucla was appointed in\n1761\n. He was based in Grenoble, the principal town of Dauphiné. There he met Marie Françoise Romand and they married in\n1763\n.\nA year after his marriage the French government sent Montucla to Cayenne on the north-eastern coast of South America.\nJean Richer\nhad been sent there by the French government almost exactly\n100\nyears earlier and Montucla also went there as an astronomer. In\n1643\nFrench merchants founded a town on the site of the present day city of Cayenne, a port of French Guiana, calling the settlement La Ravardière. The Indians later destroyed the town but the French reoccupied it in\n1664\nand were awarded French Guiana in a treaty of\n1667\n, four years before they sent\nJean Richer\nthere. In the\n1700\ns the French worked hard at building up their South American territory. Montucla was appointed royal astronomer and secretary to a French expedition to French Guiana in\n1764\nand was sent to La Ravardière. After spending over a year he returned to France in\n1765\n. We note in passing that La Ravardière was renamed Cayenne in\n1777\n.\nAfter his return to France, Montucla received another major government appointment, as Head Clerk of Royal Buildings, holding the post from\n1766\nto\n1789\n. He was also appointed as Royal Censor of mathematical works in\n1775\n. A few years later he published another text for which he is famed, namely a new edition of\nOzanam\n's\nRécréations mathématiques et physiques\nⓉ\n(\nMathematical and physical recreations\n)\nin\n1778\n. Riddle writes in\n[\n4\n]\nthat Montucla:-\n... so greatly enlarged and improved the \"Recreations\" of\nOzanam\n, that he may be said to have made the work his own. ... so carefully had he concealed his connection with the work, that, on its completion, a copy of it was sent to him, in his capacity of censor, for examination and approval. Besides expunging from the work of\nOzanam\nmuch that was absurd, puerile, and obsolete, he enriched his edition with dissertations upon almost every branch of practical science ...\nHis edition was influential in popularising geometric dissection problems which involve the cutting of geometric figures into pieces that can be arranged to form other geometric figures.\nCharles Hutton\ntranslated Montucla's edition of\nOzanam\n's\nRécréations mathématiques et physiques\nⓉ\n(\nMathematical and physical recreations\n)\ninto English in\n1803\nand Riddle's edition was published in\n1844\n, called\nRecreations in science and natural philosophy\n.\nIn\n1788\nFourier sent an algebra paper to Montucla for his opinion.\nFourier\n, however, did not receive an opinion and wrote in a letter a year later:-\nI begin to take M Montucla at his word when he tells us he has fallen out with learned analysis: I wait calmly for him to be reconciled with it.\nThis may mean that Montucla had stopped doing mathematics at this time but\nFourier\n's comment is not properly understood.\nNot surprisingly Montucla's royal posts vanished when the French Revolution began in\n1789\n. By this time he was quite well off, having held high office for many years, but the Revolution saw him lose most of his wealth, as Riddle writes:-\n... throwing him on the world in his old age, stripped of everything but his integrity, and the love and respect of his friends.\nAt this time he retired and went to live at Versailles where he worked on history of mathematics texts. He was, however, given further public appointments in\n1795\neven although he was seventy years old by this time. He was given the task of evaluating the treaties in the Ministry of Foreign Affairs, but was paid so little he lost financially. He also held a position in the office of the National Lottery.\nMontucla's friends persuaded him to work on a new edition of his famous\nHistoire des mathématiques\nⓉ\n(\nHistory of Mathematics\n)\n. In August\n1799\nMontucla published new editions through Agasse in Paris of the two volumes originally published in\n1758\n. Montucla extensively revised and enlarged the two volumes. He had intended to extend his cover of history to the end of the\n18\nth\ncentury and part of the third volume on this topic was printed by the time he died, four months after the publication of the new editions of\n1799\n.\nLalande\n, with the help of some other scientists, completed volumes three and four to give the coverage that Montucla had intended. Volume three covered\n18\nth\ncentury pure mathematics, optics and mechanics in\n832\npages, while the fourth volume covered\n18\nth\ncentury astronomy, mathematical geography and navigation in\n688\npages. Vogel writes in\n[\n1\n]\n:-\nMontucla's major work, the first classical history of mathematics, was a comprehensive and, relative to the state of contemporary scholarship, accurate description of the development of the subject in various countries. the account also included mechanics, astronomy, optics, and music ...\nSarton\n[\n5\n]\nwrote:-\nIt is still a very valuable book, though only for the wary 'connoisseur'; novices will do well to leave it alone.\nThe introduction to a reprint of the four volumes of\nHistoire des mathématiques\nin\n1968\ngives this assessment of Montucla's contribution:-\nMontucla has given us a double lesson in the history of mathematics. Of these lessons, the first is what he has composed for us. The second is what he has written without intending to, that which, through his personality, \"se trouve être l'image des idées, des manières de voir de son époque et du milieu scientifique qu'il fréquentait et connaissait très bien\"\nⓉ\n(\n... is to be the image of ideas, ways of thinking of his time and of the scientific community he frequented  and knew very well.\n)\n.",
  "matematicos_citados_na_biografia": [
    "Lalande",
    "d'Alembert",
    "Berlin Academy",
    "squaring the circle",
    "Jean Richer",
    "Ozanam",
    "Charles Hutton",
    "Fourier"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}