{
  "nome_completo": "Eugène Rouché",
  "nome_curto": "Eugène Rouché",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rouche/",
  "data_nascimento": "18 August 1832",
  "local_nascimento": "Sommières, Occitanie, Languedoc, France",
  "data_morte": "19 August 1910",
  "local_morte": "Lunel, Hérault, Languedoc, France",
  "summary": "Eugène Rouché was a French geometer best known for his theorem on complex functions.",
  "biografia": "Eugène Rouché\nwas born in Sommières in southern France. This town, about\n30\nkm from the south coast, is situated between Nimes and Montpellier and now contains a street named after the famous mathematician. His parents were Jean Jacques Rouché\n(1818\n-\n1861)\nand Marie Nicot\n(1807\n-\n1861)\n. Jean Jacques Rouché was a tax collector and the family moved to Aniane in the Hérault district where Jean Jacques was employed.\nRouché completed his schooling at the Sainte-Barbe College in Rue Valette in Paris. This school, founded in\n1460\n, was designed to prepare students for sitting the entrance examinations for the École Polytechnique and the École Normale Supérieure. He attended the school at the same time as Gustave Eiffel\n(1832\n-\n1923)\n, later famed as an engineer. In\n1852\n, after success in the entrance examinations to the Grandes Écoles, Rouché entered the École Polytechnique. When he entered this university, his home address was in Aniane and his physical description is recorded as: light brown hair; low forehead; medium nose; red eyes; medium mouth; round chin; and rounded face. He was in the same class as Alfred de Billy\n(1832\n-\n1906)\nwho became an Inspector of Finances, Fernand Raoul-Duval\n(1833\n-\n1892)\nwho became a leading engineer, and François Chrétien Léon Hartung\n(1832\n-\n1908)\nwho, after a military career, became governor of Verdun. Rouché graduated from the École Polytechnique in\n1854\nafter two years of study.\nAfter training as a mathematician, Rouché taught for one year at Nantes where he was appointed professor of physics at the Lycée de Nantes. Then, in\n1855\n, he was appointed as professor of mathematics at the Lycée Charlemagne in Paris. At this stage Rouché had spent only two undergraduate years for his university of mathematics and physics and he had no research degree. He now undertook research and, on\n17\nJuly\n1858\n, he presented two theses to the Faculty of Science in Paris for the degree of Doctor of Mathematical Sciences. The first of these theses was on analysis and was entitled\nSur le développement des fonctions en séries ordonnées suivant les dénominateurs des réduites d'une fraction continue\nⓉ\n(\nOn the development of the functions in series ordered according to the denominators of the reductions of a continuous fraction\n)\nwhile the second was on mechanics and was entitled\nSur les intégrales communes à plusieurs problèmes de mécanique relatifs au mouvement d'un point sur une surface\nⓉ\n(\nOn the integrals common to several problems of mechanics relating to the movement of a point on a surface.\n)\n. This second thesis was on a topic which had been studied by\nJoseph Bertrand\n. Rouché dedicated his two doctoral theses to Auguste Nouseilles\n(1798\n-\n1881)\n, Principal of the Lycée Charlemagne. An oral examination was held on\n8\nNovember\n1858\nwith\nLouis Lefébure de Fourcy\nas President, and\nGabriel Lamé\nand\nJoseph Liouville\nas examiners. Rouché was awarded his doctorate but we have to feel a little sorry for him since\nLefébure de Fourcy\nhad a reputation as a difficult examiner. An inspector who sat in on several of the examinations conducted by\nLefébure de Fourcy\nwrote:-\nSeveral times I attended oral examinations by Mr\nLefébure de Fourcy\nand this is my impression. The professor cannot be considered a benevolent reviewer, his voice is harsh, his tone is dismissive, also he questioned in a very firm stiff manner, and showed no mercy for any errors of logic.\nIn\n1858\nRouché was appointed as admissions examiner for the École Centrale in Paris, a position he held until\n1877\n. He was appointed as a tutor for geometry and stereotomy for the École Polytechnique in\n1861\n, continuing to hold this position for the next\n22\nyears. Rouché married Suzanne Hélène Marie Bouzanquet on\n11\nDecember\n1861\nin Lunel, Hérault. Hélène Marie Bouzanquet had been born\n26\nSeptember\n1838\nin Lunel. They had a son Louis Eugène Rouché\n(1862\n-\n1957)\nwho was known as \"Jacques\". He became an Inspector of Finance, and Director of the National Academy of Music and Dance from\n1914\nto\n1944\n.\nIn\n1867\nRouché was nominated professor of descriptive geometry and stereotomy at the École Centrale in Paris. He also acted as an examiner at the École Polytechnique from\n1877\nto\n1883\n. In\n1884\nhe was named professor holding the chair of descriptive geometry at the Conservatoire des Arts et Métiers in Paris. He continued to hold this position until he retired in\n1905\n.\nRouché published many mathematics articles, among them were some which appeared in\nComptes Rendus\nand some in the\nJournal of the École Polytechnique\n. For example he published\nMémoire sur la serie de Lagrange\nⓉ\n(\nMemoir on the series of Lagrange\n)\nin the second of these two journals in\n1862\n. In\nComptes Rendus\nhe published papers such as\nSur la discussion des équations du premier degré\nⓉ\n(\nOn the discussion of first degree equations\n)\n(1875)\n,\nSur les lignes asymptotiques d'une surface du quatrième degré\nⓉ\n(\nOn the asymptotic lines of a surface of the fourth degree\n)\n(1877)\n,\nSur un problème relatif à la durée du jeu\nⓉ\n(\nOn a problem with the duration of the game\n)\n(1888)\n, and\nSur la formule de Stirling\nⓉ\n(\nOn the Stirling formula\n)\n(1890)\n. The two-page paper\nSur la discussion des equations du premier degré\nⓉ\n(\nOn the discussion of equations of the first degree\n)\nin volume\n81\nof\nComptes Rendus\nof the\nAcadémie des Sciences\ncontains his result on solving systems of linear equations. This is the well-known criterion which says that a system of linear equations has a solution if and only if the rank of the matrix of the associated homogeneous system is equal to the rank of the augumented matrix of the system. Rouché later published a fuller version of this theorem in\n1880\nin the\nJournal de l'École Polytechnique\n. In fact he was not the first to prove such a result and, after Rouché's paper appeared, Georges Fontené published a note in the\nNouvelles Annales de Mathématiques\nclaiming priority. When\nGeorg Frobenius\ndiscussed this result in his papers, for example in\nZur Theorie der linearen Gleichungen\nⓉ\n(\nOn the theory of linear equations\n)\npublished in\nCrelle's Journal\nin\n1905\n, he gave credit for proving the theorem to both Rouché and Fontené. However it is now often called the Rouché-\nFrobenius\ntheorem, especially in the Spanish speaking world. This is almost certainly because the Spanish/Argentinian mathematician\nJulio Rey Pastor\nreferred to the theorem by this name.\nAlthough few today know who Rouché was, his name is very well known through 'Rouché's theorem' which he published in volume\n39\nof the\nJournal\nof the École Polytechnique in\n1862\n:-\nIf f\n(\nz\n)\nand g\n(\nz\n)\nare two complex functions which are regular within and on a closed contour C, on which f\n(\nz\n)\ndoes not vanish and also\n∣\ng\n(\nz\n)\n∣\n<\n∣\nf\n(\nz\n)\n∣\n|g(z)| < |f (z)|\n∣\ng\n(\nz\n)\n∣\n<\n∣\nf\n(\nz\n)\n∣\nthen\nf\n(\nz\n)\nf (z)\nf\n(\nz\n)\nand\nf\n(\nz\n)\n+\ng\n(\nz\n)\nf (z) + g(z)\nf\n(\nz\n)\n+\ng\n(\nz\n)\nhave the same number of zeros within C.\nRouché also wrote several textbooks including\nEléments d'algèbre à l'usage des candidats au baccalauréat és sciences et aux écoles spéciales\nⓉ\n(\nElements of algebra for candidates for the baccalaureate of science and special schools\n)\n(1857)\n,\nLeçons nouvelles de trigonométrie rectiligne et sphérique\nⓉ\n(\nNew lessons in rectilinear and spherical trigonometry\n)\n(\nwritten jointly with L Lacour\n)\n(1857)\n,\nTraité de géométrie élémentaire\nⓉ\n(\nTreatise on elementary geometry\n)\n(\nwritten jointly with Charles de Comberousse\n)\n(1864\n-\n1866)\n,\nÉléments de Statique Graphique\nⓉ\n(\nElements of graphic statics\n)\n(1889)\n,\nCoupe des pierres: précédée des principes du trait de stéréotomie\nⓉ\n(\nCutting stones: preceded by the principles of the theory of stereotomy\n)\n(\nwritten jointly with Charles Brisse\n)\n(1893)\n, and\nAnalyse infinitésimale à l'usage des ingénieurs\nⓉ\n(\nInfinitesimal analysis for engineers\n)\n(2\nvolumes\n)\n(1900\n-\n1902)\n. This two volume work was the result of a collaboration with Lucien Lévy\n(1853\n-\n1912)\nwho was the father of the well known mathematician\nPaul Lévy\n. Lucien Lévy taught mathematics at the Lycée Louis-le-Grand in Paris and, for\n23\nyears, was an examiner at the École Polytechnique.\nHis most famous textbook was the geometry book written jointly with Charles Jules Félix de Comberousse\n(1826\n-\n1897)\nwho taught mathematics at the Collège Chaptal in Paris. This book appeared in two volumes, the first being on\nGéométrie plane\nⓉ\n(\nPlane geometry\n)\nand the second on\nGéométrie dans l'espace\nⓉ\n(\nGeometry in space\n)\n. The book went through many editions, for example the seventh edition of this work was published in Paris by Gauthier-Villars in\n1900\n. It was a major treatise, the volumes having\n548\nand\n664\npages respectively. Editions continued to be published after Rouché's death, with a new edition published in Paris by Gauthier-Villars in\n1922\nand another in\n1954\n. Indeed it is still in print now with a reproduction produced in\n2010\n. The authors describe their approach to writing this textbook in the following way:-\nThere are two ways of writing a book intended for study: one can restrict oneself to the official syllabus and do not go outside the framework; or perhaps one can also, by strictly following these syllabuses in what they require to be compulsory, yet go beyond and try to complete them. In order to apply a science, it is not sufficient to know a few parts of it, rather it is necessary to be familiar with all its methods, to grasp the whole. The magnificent discoveries of modern geometry have not penetrated into teaching; abandoned by the official syllabuses, they do not occupy the place in the series of mathematical studies due to them; we speak of it only a little and incidentally in Analytical Geometry, where it seems to be wrong to replace the admirable ideas created by\nDescartes\nby new ideas. We are far from reproaching the syllabuses for their silence in this respect; they are so full that it would be unworthy to demand an addition. But can one not learn the syllabus required for an examination and try at the same time to understand the scope of the science that is being studied, by making with a quick study, an overview of its main methods? Such is the thought which guided us in the composition of this work.\nFor a list of the contents of the\n1900\nedition of this work, which clearly exhibits the philosophy described by its authors in the above quote, see\nTHIS LINK\n.\nEdmond Laguerre\ndied in\n1886\nand Rouché became one of the editors to work on the production of his\nCollected Works\n. There were three editors for this work, the other two being\nCharles Hermite\nand\nHenri Poincaré\n.\nOeuvres de Laguerre Tome I, Algèbre, calcul integral\nⓉ\n(\nWorks of Laguerre Vol I, Algebra, calculus integral\n)\nappeared in\n1898\nand\nOeuvres de Laguerre Tome II, Géométrie\nⓉ\n(\nWorks of Laguerre Vol II, Geometry\n)\nwas published in\n1905\n.\nRouché was a member of the\nSociété Mathématique de France\n, serving as its president in\n1883\n-\n84\n. He was also a member of the\nSociété philomathique\nin Paris and a member of the\nConseil supérieur de l'enseignement technique\n. He was elected to the\nAcademy of Sciences\nin\n1896\nand to the Académie des Sciences et Lettres de Montpellier.\nThe town of Lunel where Rouché died is close to his birthplace of Sommières. In fact it is situated about halfway between Sommières and the southern coast of France.",
  "matematicos_citados_na_biografia": [
    "Joseph Bertrand",
    "Louis Lefébure de Fourcy",
    "Gabriel Lamé",
    "Joseph Liouville",
    "Lefébure de Fourcy",
    "Académie des Sciences",
    "Georg Frobenius",
    "Frobenius",
    "Julio Rey Pastor",
    "Paul Lévy",
    "Descartes",
    "THIS LINK",
    "Edmond Laguerre",
    "Charles Hermite",
    "Henri Poincaré",
    "Société Mathématique de France",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}