{
  "nome_completo": "Frederick Francis Percival Bisacre",
  "nome_curto": "F F P Bisacre",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bisacre/",
  "data_nascimento": "20 June 1885",
  "local_nascimento": "Tonbridge, Kent, England",
  "data_morte": "9 November 1954",
  "local_morte": "Helensburgh, Scotland",
  "summary": "F F P Bisacre was an engineer who was educated at Cambridge and worked for the Edinburgh publishers Blackie with whom he published a Calculus textbook. He wrote some research papers on X-ray diffraction.",
  "biografia": "F F P Bisacre\n's father was George Bisacre, born Wootton Under Edge, Gloucestershire in about\n1846\nand his mother was Emma Garrett born North Newington, Oxfordshire in about\n1848\n. Frederick Bisacre had three older siblings: Edith Blanche\n(\nborn about\n1872)\n, Elizabeth C\n(\nborn about\n1877)\nand Ernest born about\n1880\n.\nBisacre was educated privately and at Trinity College, Cambridge. From\n1910\nto\n1919\nhe was with Merz and McLellan Consulting, Engineers, first as Assistant, and later as Personal Assistant to Mr Charles Merz.\nIn\n1915\nBisacre married Jean Margaret Blackie, eldest daughter of Walter W Blackie\n(1861\n-\n1953)\nand Anna Christina Younger\n(1866\n-\n1957)\n. Walter W Blackie was the director of the well-known Glasgow publisher. The announcement appeared in the press as follows:-\nAt Glasgow Cathedral on the\n28\nApril\n1915\n, by the Rev. Alexander Ritchie, B.D. Dunblane assisted by the Rev. John G C Christie, B.D., Helensburgh, Frederick Francis Percival Bisacre, son of George Bisacre, Southborough, Kent, to Jean Margaret Blackie, eldest daughter of Walter W Blackie, The Hill House, Helensburgh, Dumbartonshire.\nThe Hill House is the finest of Charles Rennie Mackintosh's domestic creations. It is situated high above the Clyde commanding fine views over the river estuary. Walter Blackie commissioned not only the house and garden but much of the furniture and all the interior fittings and decorative schemes. In\n1904\nthe Blackie family had moved into their new home. The Hill House is now a National Trust for Scotland property, and is open to the public.\nIn\n1920\nBisacre joined Blackie & Son Ltd, and became a Director, and subsequently he was Chairman of the Company. Bisacre was elected an Associate Member of the Institute of Civil Engineers in\n1914\n. For his paper on\nOverhead Track Construction for Direct-Current Electric Railways\n, he was awarded a Crampton Prize.\nIn\n1921\nBisacre's\nApplied calculus; an introductory textbook\nwas published by Blackie and Son. The book consisted of\n446\npages and was reviewed in the\nBulletin\nof the\nAmerican Mathematical Society\n.\nSee\nTHIS LINK\n.\nAs examples of Bisacre's papers we quote his own abstract to two of them. First we gave the abstract of\nThe theory of the formation of an image by a plane band grating used in the soft X-ray region\nwhich appears in\nProc. Phys. Soc\n.\n47\nNo\n5\n(1\nSeptember\n1935)\n948\n-\n963\n:-\nABSTRACT.\nThis paper describes an investigation of the reflection of light from a plane grating illuminated by a cylindrical wave diverging from a Huygens line source. It is shown that for pencils sufficiently narrow the isophasics\n(\nproperly parabolas\n)\nbecome circles with a virtual focus as centre. The position of this virtual focus is found. A formula is given for the intensity of the light along the reflected isophasic. It has a Fresnel integral as a factor. It is shown that if the dimensions of the grating are chosen so that the modulus of the Fresnel integral has its maximum value, the intensity along the isophasic varies after the fashion of an Airy image and the maximum possible intensity occurs on the axis of the reflected pencil - in other words, the reflected light is automatically focused. The critical\n(\noptimum\n)\nlength of the grating for automatic focusing is determined by the condition that the quadratic term in the expansion for the optical path in powers of distance measured along the grating face from its centre must be three-eighths of a wave-length. Formulae for the dispersion and resolution of an optimum grating are given and the resolution turns out to be exactly the same as for an ordinary grating, namely the total number of lines on the grating multiplied by the spectral order. Some numerical examples are given. Third-order effects have been considered and it is shown that in the conditions contemplated in the use of these optimum gratings, the third-order term affects the length of the optical path by something like one\n650\nth\npart of a wave-length, and is consequently negligible.\nNext we give the abstract of\nSome preliminary notes on diffraction gratings\nwhich appeared in\nProc. Phys. Soc\n.\n48\nNo\n1\n(1\nJanuary\n1936)\n184\n-\n188\n:-\nABSTRACT.\nIn §\n1\na simple test, using polarized light, for the best setting of a diffraction grating is described. When used under the best conditions for brightness, a grating should show little or no polarizing effect. The reason for this depends upon the fact that the Huygens-Kirchhoff integrals for the electric and magnetic vectors have different cosine factors which have the same value only in the case of ordinary reflection.\nIn §\n2\nan extension of the Huygens-Kirchhoff integrals bringing in a second approximation is given. This second approximation becomes important if either the radius of curvature is comparable to the wave-length of light or the angle of incidence is very nearly\n90\n° , as it may be in soft X-ray experiments.\nIn §\n3\na new curve for the effect of slit-width upon the resolving-power of a spectroscope is given and compared with Schuster's curve also. Schuster's curve is based on the assumption that the slit is filled with incoherent light; the author's, with coherent light. These two curves are probably upper and lower limits.\nIn §\n4\na new method of ruling concave gratings, namely radial ruling, is suggested. In this method the diamond is given a uniform chordal displacement, from line to line, as in the present method of ruling, but during its displacement from line to line it is constrained to rotate about an axis parallel to the ruled lines and passing through the centre of curvature of the face of the grating. For the metal concave grating of more than\n20\n,\n000\nlines per inch this method of ruling would do what figuring does for an astronomical mirror, though not to so high an order of accuracy.\nIn December\n1925\nBisacre joined the\nEdinburgh Mathematical Society\ngiving his address as c/o Messrs Blackie & Co.,\n17\nStanhope Street, Glasgow.\nBisacre and his wife had two sons and one daughter. Their first son, George Henry Bisacre, was born on\n13\nMarch\n1916\n. Their second son, David Walter Bisacre, was born three years later and their daughter, Margaret A Bisacre, was born in\n1925\n. Margaret Bisacre graduated M.A. Ordinary from the University of St Andrews in\n1947\n, then was awarded Second Class Honours in English Language and Literature in\n1949\n. On\n9\nOctober\n1947\nthe engagement was announced between George Henry Bisacre, elder son of Mr and Mrs F F P Bisacre, Ascania, Helensburgh, Dumbartonshire and Barbara Joan Plant. They were married on\n27\nDecember\n1947\nand had a son at Lorna Lodge Nursing Home, Manchester, on\n17\nJanuary\n1949\n. The announcement of the younger son's marriage appeared in the press in the following form:-\nAt Cambridge on Wednesday\n29\nMarch\n1944\n, David Walter Bisacre, Captain, R.E., younger son of Mr and Mrs F F P Bisacre, Ascania, Helensburgh, Dumbartonshire to Phyllis Southwell Mansfield, A.T.S., eldest daughter of Mr and Mrs Wilfred Mansfield,\n10\nGrange Road, Cambridge. David Walter Bisacre attended Charterhouse School and was on the winning team for the School's Cup yachting races on the Gareloch in August\n1936\n.",
  "matematicos_citados_na_biografia": [
    "American Mathematical Society",
    "THIS LINK",
    "Edinburgh Mathematical Society"
  ],
  "imagens": []
}