{
  "nome_completo": "Félix Recillas Juarez",
  "nome_curto": "Félix Recillas",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Recillas/",
  "data_nascimento": "27 January 1918",
  "local_nascimento": "San Mateo Atenco, Mexico",
  "data_morte": "15 January 2010",
  "local_morte": "Mexico City, Mexico",
  "summary": "Félix Recillas was a Mexican mathematician who was awarded a Ph.D. by Princeton advised by Chevalley and made a major contribution to building successful mathematical research schools in Mexico.",
  "biografia": "Félix Recillas\nwas the son of Félix Recillas and Herminia Juárez. He had three brothers, Agustin, Vicente and Felipe who were quite a lot older than he was. The family lived in San Mateo Atenco, on the east side of Toluca. Félix's father was a minor civil servant in the government of the Mexican President José de la Cruz Porfirio Díaz before the Mexican revolution of\n1910\n. This presented problems when the revolution broke out and many members of the community joined the Zapatistas, set up by Emiliano Zapata, or the Carrancistas, followers of Venustiano Carranza. Another revolutionary Pancho Villa at first supported the Carrancistas but later broke away and formed the Villistas. These different revolutionary groups fought each other but Felix's father, who had collected taxes for Porfirio's government, was seen as 'the enemy' by them all. When men from San Mateo Atenco joined one of the revolutionary groups and later returned home they would show their enmity to Félix's father. He had to hide among the fishing nets in the lagoon when they came looking for him. When Félix was three months old, his mother became so worried by the situation that she insisted that the family move to Mexico City.\nIn the interview\n[\n7\n]\nRecillas spoke of his early years in Mexico City:-\nWe came to live in a vacant lot where there were some shacks, near the General Hospital. At the age of two my father vanished, got lost in the big city, left and never came back. My mother returned to the village, where they had some pieces of land that they continued to cultivate, and I stayed with my older brothers. They started working in spinning and weaving factories, later they became drivers, all very hard-working. I never left the district of Doctores, where I spent my childhood and adolescence in an environment of blacksmiths, carpenters and drivers.\nAs we indicated above, Félix's brothers were much older than he was and, by the time he was attending primary school, his brothers were married. This led to another problem for the young boy when religious tensions became a major issue. Plutarco Elías Calles was the Mexican president from December\n1924\nto November\n1928\n. Calles, who was an atheist, decided to try to end the power of the Roman Catholic Church in Mexico with the imposition of anticlerical laws in June\n1926\n. Catholic organisations and individuals resisted the imposition of the law with an economic boycott against the government. Catholic teachers in state schools refused to teach. One of Félix's sister-in-laws was a staunch Roman Catholic and, through her influence, Félix was not allowed to attend primary school for between one and two years. He was therefore older than the other children in his class when, at the age of fifteen, he entered Secondary School No.\n17\nin\n1933\n.\nRecillas was fortunate in having some exceptional teachers at the Secondary School. The head of mathematics was\nAlfonso Nápoles Gándara\nwho taught elementary algebra in the first year\n[\n7\n]\n:-\nNápoles\nhad a great personality and walked with an air of great dignity through the central courtyard.\nIn the same interview, he spoke about his literature teacher:-\nJulio Torri was my literature teacher. When Torri got to the classroom, he was met by a mob of crazy people, who were fighting and yelling, and he would sit very dignified at the desk, he would open his book and wait until everyone calmed down.\nThe school invited\nAlberto Barajas\nto give a trigonometry course during the vacation so that the pupils might progress faster. He gave a course which went as far as spherical trigonometry and Recillas was so impressed that he knew at that stage that he wanted to study more mathematics. Completing the examinations, Recillas qualified to enter the National Preparatory School which was only one block away from Secondary School No.\n17\n.\nLife now became exciting but chaotic for Recillas.\nBarajas\nsuggested that a way for Recillas to learn more mathematics was to enrol at the Chemical Sciences High School and attend the mathematics classes given there by\nCarlos Graef\n. He did so and took classes on analytical geometry and calculus.\nGraef\nrealised he had an enthusiastic and very able student and suggested that they walk together each day from San Idelfonso to the School of Construction Engineers. Recillas said\n[\n7\n]\n:-\nGraef\nwas very jocular, cheerful, and a great athlete. On walks he would talk to me about his mathematical friends and the history of mathematics. He taught me vector calculus by chatting.\nAfter a year\nGraef\nadvised Recillas to enrol for a bachelor's degree engineering in the School of Engineering Sciences rather than spend a second year at the high school. That would give him the opportunity to learn more advanced mathematics. What Recillas chose to do, however, was to enrol for a second year at the high school but hardly ever attend. Instead he took some mathematics classes given by\nGraef\nand some given by\nNápoles Gandara\n. It was an exciting time for the young man who now met with students who came from a very different cultural environment. Not only did he learn more advanced mathematics but he learned about literature and music. In\n1938\nGraef\nwas awarded a Guggenheim scholarship and left for the United States in July of that year. Recillas did not have the financial support to continue with his education and decided he had to find employment.\nNow twenty years old, Recillas got a job as a surveyor in Michoacán. He enjoyed working outdoors but that work ended and then he had to work in the central office from\n8\n:\n00\nto\n14\n:\n00\n. He was bored with the work and hated the discipline so he became depressed. In\n1940\nhe heard that\nGraef\nhad returned to Mexico, so he went to see him and told him that he wanted to continue studying mathematics. At this time\nGraef\nhad become involved in astronomy. While he had been studying for a Ph.D. at Harvard,\nGraef\nhad met Luis Enrique Erro\n(1897\n-\n1955)\n. Erro was an amateur Mexican astronomer who became a member of the administration in\n1940\ntasked with building an observatory in Tonantzintla, Puebla. This site has particularly favourable atmospheric conditions for an observatory. Erro had asked\nGraef\nif he would be the founding deputy director of the Observatory project.\nGraef\nnow saw the possibility for Recillas to go to Harvard by having him join the Tonantzintla Observatory project. Recillas replied that he did not know anything about astronomy, but\nGraef\nsaid if he went to Harvard saying he wanted to learn astronomy, he could attend all the mathematics courses he wanted. With support from Erro and\nGraef\n, Recillas was awarded a scholarship to study astronomy at Harvard and began his studies in January\n1941\n.\nRecillas spent the summer of\n1941\nlearning observational tasks at the Harvard Observatory. In his spare time he read the book\nAn Introduction to the Study of Stellar Structure\nby\nSubrahmanyan Chandrasekhar\n. Recillas thought that learning German would be useful to him and the astronomy postdoctoral student\nParis Pishmish\noffered to help him. Although Turkish, she spoke perfect German. It had been her favourite foreign language at school and she had perfected it when studying for a Ph.D. in Istanbul advised by\nFinlay Freundlich\n. Recillas and\nPishmish\nmarried around the end of\n1941\n. They had two children Elsa Recillas Pishmish\n(\nborn\n1942)\nand Roberto Sevín Recillas-Pishmish\n(\nborn\n1943)\n. We will give some details about these children's careers later in this biography.\nThe fact that he had read\nChandrasekhar\n's book, meant that Recillas could start graduate studies at Harvard. He took physics courses but continued his passion for mathematics by attending algebra courses by\nGarrett Birkhoff\nand\nOscar Zariski\n. It was Manuel Sandoval Vallarta, who had been\nGraef\n's thesis advisor, who suggested that Recillas continue his interest in mathematics in this way. He was at Harvard, however, as part of the programme for setting up the Tonantzintla Observatory and in\n1942\nhis studies had to be cut short when he was told to return to Mexico and bring with him the\n28\ninch Schmidt camera which had been built in the Harvard College Observatory shops with optics provided by PerkinElmer. With a colleague, Recillas drove a truck with the Schmidt camera from Boston to the Mexican border where a professional group took over and continued the journey to the Tonantzintla Observatory. The Observatory was officially opened in February\n1942\nand an Astrophysical Congress was held in Puebla to inaugurate the Tonantzintla Astrophysical Observatory. Both Recillas and his wife\nParis\nattended the Congress and Recillas presented a paper on radiation transport in stellar atmospheres.\nChandrasekhar\nattended the Astrophysical Congress and was impressed by Recillas's paper. After returning, he wrote to Erro suggesting that Recillas might come to Chicago to work with him and said he could arrange a scholarship and make the travel arrangements. Although Recillas was now officially an astronomer at the Tonantzintla Observatory, mathematics was still his real love and he made the\n100\nkm journey to Mexico City every week to attend the topology seminar in the Mathematics Institute organised by\nRoberto Vázquez\n.\nThe First National Congress of Mathematics was held in Saltillo, Coahuila,\n1\n-\n7\nNovember\n1942\n. It was organised by\nAlfonso Nápoles Gándara\n,\nAlberto Barajas\nand Francisco José Alvarez. Recillas attended the Congress and while there he spoke with\nSolomon Lefschetz\ntelling him that he was interested in studying more mathematics.\nLefschetz\nasked him what area of mathematics interested him and Recillas replied that he was fond of algebra and had read\nAn Introduction to Abstract Algebra\nby\nCyrus C MacDuffee\n.\nLefschetz\ntold him that\nMacDuffee\n's book was useless as an introduction to research and said he could arrange a scholarship for Recillas to study for a Ph.D. at Princeton supervised by\nClaude Chevalley\n.\nChevalley\nhad been on a visit to the Institute for Advanced Study at Princeton when World War II broke out and chose to remain there throughout the duration of the war. When Recillas went to the topology seminar in Mexico City in the week after the Congress,\nLefschetz\ntold him that his scholarship for Princeton had been arranged.\nRecillas had begun astronomy research and had published the joint paper\n[\n17\n]\nwith Edith Jones Woodward\n(1914\n-\n2002)\n. Woodward worked at Harvard College Observatory and had published\nA study of four W Ursae Majoris stars\nin\n1942\n. Their joint paper begins:-\nThe variability of U Pegasi was discovered by Chandler in\n1894\n. Visual observations established the fact that it was a short period variable and subsequent observations have shown it to be an eclipsing binary of W Ursae Majoris type, with a period of about\n0\n.\n375\ndays. ... The present study was undertaken with the purpose of investigating the constancy of the period of U Pegasi and determining an accurate light curve for the star.\nWhile waiting to go to Princeton, Recillas continue to work at the Tonantzintla Observatory but was a founding member of the\nMexican Mathematical Society\n, being present at the first meeting on\n30\nJune\n1943\n. He was on the Tonantzintla Observatory expedition to Peru organised by Luis Enrique Erro to observe the eclipse of\n25\nJanuary\n1944\n. They set up their instruments west of Chiclayo in the school grounds of Centro Escolar\n221\n. Visibility was good and they were able to take several photographs. Recillas' own account is in\n[\n18\n]\n.\nIn\n1944\nRecillas resigned his position at the Observatory, but his wife continued to hold a post there. On\n28\nOctober\n1944\nRecillas entered the United States on his way to the Graduate School at Princeton. He gives the following personal details: Height,\n5\nft\n7\nin; Complexion, dark; Hair, black; Eyes, brown; Scar under chin. His Mexican address is\n17\nSur\n709\n, Pueblo, Mexico and his wife continued to live there. He said\n[\n7\n]\n:-\nWith the money that Luis Enrique Erro gave me to go to Chicago and with the scholarship that\nSolomon Lefschetz\ngave me, I was able to pay for my first year in Princeton. After that year I passed the examinations and they gave me a scholarship from the Rockefeller Foundation to finish my doctorate.\nRecillas' wife,\nParis Pishmish de Recillas\n, worked at the Tonantzintla Observatory until January\n1946\nwhen she went to study at the Princeton University Observatory, joining her husband.\nAt Princeton, Recillas was advised by\nClaude Chevalley\nand wrote the thesis\nExtension of a theorem of Hilbert to formal power series\n. He was awarded a Ph.D. by Princeton in\n1948\n. The theorem of\nHilbert\nreferred to in the title of the thesis is\nHilbert\n's syzygy theorem, a fundamental theorem about polynomial rings over fields proved in\n1890\n. The theorem is important in algebraic geometry. An Abstract of the thesis can be read in\n[\n19\n]\n.\nReturning to Mexico in\n1948\n, Recillas became a researcher at the Institute of Mathematics of the Universidad Nacional Autónoma de México\n(\nUNAM\n)\nand a professor in the Faculty of Sciences of the UNAM. In\n[\n7\n]\nhe spoke about the Institute of Mathematics at that time:-\nAlthough I was received with kindness and courtesy, the academic atmosphere was disillusioned. The splendid works of\nGraef\nand\nBarajas\nhad been left behind and there was an atmosphere of depression, there was no confidence that theorems could be proved. The responsibility for the mathematical work was carried out by\nRoberto Vázquez\n, who asked me to organise a course or, failing that, a seminar on algebraic topology. I agreed to do the seminar on the condition that\nJosé Adem\nwas invited to participate. We read the book 'Algebraic Topology' by Professor\nLefschetz\n. The first chapter we read was relatively easy, because it had been written by\nChevalley\n, but the subsequent chapters, written by\nLefschetz\nin the style of the old French school, proved really difficult. But facing the challenge with humility and a deep critical spirit allowed us to achieve our purpose.\nHe was invited to Princeton for a semester as a visiting professor in\n1950\n. While he was there,\nClaude Chevalley\nsuggested that he spend a year in Paris at the\nHenri Cartan\nSeminar at the École Normale Supérieure. His wife and children flew from Mexico City on\n12\nNovember\n1951\nand, joining up with Recillas, the whole family flew to Paris on\n16\nNovember\n1951\n. Recillas returned after the year in Paris sailing from Le Havre to New York, arriving there on\n9\nNovember\n1952\n. He returned for a second visit to Paris, leaving Mexico City on\n10\nNovember\n1953\nand returning on\n10\nMarch\n1954\n.\nIn\n1956\nRecillas was one of the organisers of the\nSymposium Internacional de Topología Algebraica held at the UNAM. Many leading topologists attended this meeting including\nMichael Atiyah\n,\nSamuel Eilenberg\n,\nPeter Hilton\n,\nFriedrich Hirzebruch\n,\nWitold Hurewicz\n,\nIoan James\n,\nSolomon Lefschetz\n,\nJohn Milnor\n,\nHans Samelson\n,\nStephen Smale\n,\nNorman Steenrod\nand\nRené Thom\n.\nHe was one of the editors of the conference Proceedings which has the following Preface\n[\n1\n]\n:-\nThe International Symposium on Algebraic Topology was held in Mexico at Ciudad Universitaria in August\n1956\n, at the initiative of a group of researchers from the Institute of Mathematics of the National University, the National Institute of Scientific Research and the Mexican Mathematical Society, with the cooperation of various men of science from foreign academies. This scientific event was carried out with the moral and economic support of the Federal Government of our Republic, and the cooperation of some national institutions ... and foreign institutions, the American Mathematical Society, the Rockefeller Foundation, and UNESCO, to whom we publicly give our most sincere thanks.\nRecillas received several further invitations, being in Princeton in\n1957\nand then back to Paris as a visiting professor from March to June\n1959\n. He was also invited to spend time as a visiting professor at the Henri Poincaré Institute in Paris in\n1962\nand at the University of Heidelberg in Germany in\n1965\n.\nFélix Recillas and\nParis Pishmish\nwere divorced and Recillas married Minerva Targa; they had one son Félix Recillas Targa.\nRecillas published a number of papers including:\nOn prime ideals in generalized semilocal rings\n(\nSpanish\n)\n(1953)\n;\nHilbert's function in semilocal rings\n(\nSpanish\n)\n(1954)\n;\nOn the formulas of Peterson and Stein\n(\nSpanish\n)\n(1961)\n; and\nSpecializations of local complete rings\n(\nSpanish\n)\n(1961)\n. He was the Director of the Faculty of Sciences of the UNAM from\n1982\nto\n1986\n.\nHaving continued to work at the Institute of Mathematics into his nineties, Recillas died a few days short of his\n92\nnd birthday. He left instructions that his collection of\n1953\nbooks be donated to the library of the Institute. This was fitting since it had been largely through the efforts of Recillas that the Institute library was started. When the books were received in April\n2014\n, Javier Bracho, a former director of the Institute, said\n[\n14\n]\n:-\nBy opening one of these books and noting that it was donated by one of the most important researchers the country has had in the field of mathematics, students can find out who Recillas Juárez was and what he has meant to the Institute. Dr Recillas Juárez was very important in the development of Mexican mathematics and he had a special interest all his life in books on this science. He had a really precious and very well selected collection. It is a great honour to be chosen to host this collection.\nThe collection contains books published in English, French, German, Spanish, Italian, and Portuguese.\nLet us give a few details of Recillas' three children. Elsa Recillas Pishmish\n(\nborn\n1942)\nwas awarded a physics degree by the UNAM in\n1968\n, a Master's Degree in Astronomy by the University of Sussex, England, in\n1971\n, a Master's Degree in Physics from UNAM in\n1983\nand a Ph.D. from the UNAM in\n1988\n. She became a professor in the Mexican National Institute of Astrophysics, Optics and Electronics. She married the astronomer Carlos Cruz-González, and their daughter Irene Cruz-González also became an astronomer. Sevín Recillas-Pishmish\n(\nborn in Puebla in\n1943)\nwas awarded a Bachelor's Degree in Mathematics from the Faculty of Sciences of the UNAM in\n1964\n, and then went to Brandeis University in the United States where he received a Master's Degree in\n1967\nand a Ph.D. for his thesis\nA relation between curves of genus\n3\nand curves of genus\n4\nin\n1970\n. MathSciNet lists\n27\npapers by Sevín Recillas-Pishmish all on algebraic geometry. He died in\n2005\n. Félix Recillas Targa studied biology at the UNAM\n(1982\n-\n85)\n, then studied for a biochemistry Ph.D. at the University of Paris\n(1988\n-\n1993)\n. He became a researcher at the Institute of Cellular Physiology of the UNAM in\n1990\n.\nFinally, let us quote some thoughts about Recillas. Raymundo Bautista writes\n[\n3\n]\n:-\nFélix Recillas shared with the mathematicians of his generation the dream of building mathematics schools in Mexico with international impact. He always had a piece of advice, a word of encouragement, towards those he believed to be interested in research in mathematics. He was a tireless propagandist for those mathematical topics that he saw as central, he organised seminars, lent books, got whoever he saw interested in a topic of his interest invitations to international schools or congresses. We will remember him with gratitude and affection.\nHis son Félix Recillas Targa, spoke about his father\n[\n9\n]\n:-\nHe was extremely honest, quite a gentleman, but he had a strong, tough character ... He was very strict academically, but his human part was very good with people ... He never forced us to be scientists but he gave us the example ... he was doing mathematics at his desk, at home. He told us that we had to be very humble about science.\nEnrique Ramirez de Arellano writes\n[\n13\n]\n:-\nWhen the scientific culture of a country is in formation, the paths that the sciences will follow will be regulated by their founders, and not only the paths, but also the ambitions, illusions and above all the audacity to set goals, apparently utopian, for the development of these sciences. In the case of Mexican mathematics, Félix Recillas is one of the first to raise such goals, apparently illusory in our environment regarding the development of mathematics. He insisted \"You have to study the great contemporary mathematical schools\" and he gave importance to modern algebraic geometry,\nLie\ngroups, the teachings of\nWeil\n,\nGrothendieck\n,\nMumford\n,\nTate\nand many more. He encouraged a new generation to study algebraic groups, automorphic forms, analysis of locally compact groups, and many other topics that were beginning to have relevance. He was the one who made students aware of the\nLanglands\n' program of uniting various branches of mathematics and of the importance of not artificially subdividing mathematics into mutually alien branches. The development of modern mathematics in Mexico is largely due to the tenacious work of Félix Recillas. We can never thank him enough for his efforts.",
  "matematicos_citados_na_biografia": [
    "Alfonso Nápoles Gándara",
    "Nápoles",
    "Alberto Barajas",
    "Barajas",
    "Carlos Graef",
    "Graef",
    "Nápoles Gandara",
    "Subrahmanyan Chandrasekhar",
    "Paris Pishmish",
    "Finlay Freundlich",
    "Pishmish",
    "Chandrasekhar",
    "Garrett Birkhoff",
    "Oscar Zariski",
    "Paris",
    "Roberto Vázquez",
    "Solomon Lefschetz",
    "Lefschetz",
    "Cyrus C MacDuffee",
    "MacDuffee",
    "Claude Chevalley",
    "Chevalley",
    "Mexican Mathematical Society",
    "Paris Pishmish de Recillas",
    "Hilbert",
    "José Adem",
    "Henri Cartan",
    "Michael Atiyah",
    "Samuel Eilenberg",
    "Peter Hilton",
    "Friedrich Hirzebruch",
    "Witold Hurewicz",
    "Ioan James",
    "John Milnor",
    "Hans Samelson",
    "Stephen Smale",
    "Norman Steenrod",
    "René Thom",
    "Lie",
    "Weil",
    "Grothendieck",
    "Mumford",
    "Tate",
    "Langlands"
  ],
  "imagens": [
    "recillas.jpg"
  ]
}