{
  "nome_completo": "Felice Casorati",
  "nome_curto": "Felice Casorati",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Casorati/",
  "data_nascimento": "17 December 1835",
  "local_nascimento": "Pavia (now Italy)",
  "data_morte": "11 September 1890",
  "local_morte": "Casteggio, Italy",
  "summary": "Felice Casorati is best remembered for the Casorati-Weierstrass theorem characterising the behaviour of a function near an essential singularity.",
  "biografia": "Felice Casorati\n's parents were Francesco Casorati and Maria Stabilini. Francesco Casorati was a medical man who researched in physiology at the University of Pavia. Felice was a student at Pavia and initially his interests were in engineering and architecture. He received a diploma in these subjects from Pavia in\n1856\n. After this he began to help\nA Bordoni\nand\nBrioschi\nbut very quickly was acting as their assistant. He was appointed as a teaching assistant at Pavia in\n1875\n, teaching topography and hydrometry. In\n1858\n, together with\nBetti\nand\nBrioschi\n, he visited Göttingen, Berlin and Paris and this visit is often taken as the point where Italian mathematics joined the mainstream of European mathematics. On this and later journeys, for example he discussed the foundations of analysis with\nKronecker\nand\nWeierstrass\n. While in Germany in\n1864\n, Casorati became familiar with he ideas of\nRiemann\nand\nWeierstrass\non complex function theory and then spread these ideas through his lectures and contacts.\nAfter returning from the first of his journeys in\n1859\n, Casorati was appointed as extraordinary professor of algebra and analytic geometry at the University of Pavia. In\n1862\nhe was appointed as an ordinary professor at Pavia and in the following year he succeeded Mainardi to the chair of infinitesimal calculus. He taught geodesy and analysis at Pavia from\n1865\nto\n1868\nwhen he moved to Milan where he taught until\n1875\n, although he continued to hold the chair at Pavia. Leaving Milan he returned to Pavia in\n1875\nwhere he taught analysis until his death.\nCasorati wrote one major book and published\n49\nresearch papers. Differential equations were of great interest to  him and his research in this area was undertaken with the aim of making the existing theories more accurate and more complete. He also worked on complex function theory, and wrote an important book\nTeoria delle funzioni di variabili complesse\nⓉ\n(\nTheory of functions of a complex variable\n)\n(1868)\non this topic.  Particularly pleasing to those with an interest in the history of mathematics is the fact that in the first part of the text he gives a valuable historical account of the development of the theory. Other areas to which he made major contributions include the inversion of abelian integrals and the existence of many-valued functions with an infinity of distinct periods.\nCasorati is best remembered for the Casorati-\nWeierstrass\ntheorem which says that an analytic function comes arbitrarily close to any given value in any neighbourhood of an essential singularity.\nWeierstrass\nproved this in a paper of\n1876\nand, although he had proved it some time before publication, Casorati had already included it in his\n1868\ntreatise\nTeoria delle funzioni di variabili complesse\nⓉ\n(\nTheory of functions of a complex variable\n)\n. The paper\n[\n9\n]\ncontains a careful analysis which shows convincingly that, although\nWeierstrass\nand Casorati were in correspondence, it was Casorati who gave the first proof.  In fact the first to make an investigation relevant to this problem was\nLiouville\nwho began the attempt to characterize analytic functions in terms of their singularities and to investigate spherical representation. Although Neuenschwander shows that priority rests with Casorati, nevertheless\nWeierstrass\ndid prove a lemma in\n1841\nwhich was needed by Casorati in his proof.\nCasorati was an energetic correspondent and much still survives that gives an inside picture of the scientific and academic life in Italian universities in the second half of the\n19\nth\ncentury. For example he corresponded with\nBeltrami\nbetween the years\n1862\nand\n1889\nare discussed in\n[\n8\n]\n, and the\n27\nletters between\nHermite\nand Casorati from\n1863\nto\n1889\non various mathematical topics are discussed in\n[\n4\n]\n. He corresponded with\nWeierstrass\n, who told him in a letter written in\n1867\nthat Italian scientific investigations were better understood and valued in Germany than in England and France, and also that German mathematics was more appreciated in Italy than in either France or England. There is an interesting comment by Bottazzini in\n[\n5\n]\nthat provides some understanding of why this might have come about. He notes that since both Germany and Italy were at the time struggling towards political unification, mathematicians from these countries would necessarily have had a common bond.\nStruik\n, writing about Neuenschwander's research on Casorati's papers which are held in Pavia\n[\n10\n]\n, lists some more of Casorati's correspondents:-\nCasorati left a large number of papers, now preserved in Pavia. They contain hundreds of letters to mathematicians, memoranda on conversations, observations on contemporary papers, a diary, some lecture notes and manuscripts, including much of considerable interest to the student of the mathematics of the mid- and late nineteenth century. Among the mathematicians with whom Casorati corresponded we find Eneström,\nFuchs\n,\nHermite\n,\nKronecker\n,\nSchwarz\n, Prym,\nMittag-Leffler\nand\nSchläfli\n(\nno fewer than\n108\nletters with him\n)\n. Conversations with\nKronecker\nand\nWeierstrass\nare reported. ... Casorati, in these papers, is seen clearly as one of the principal figures in the transmission of German and French mathematics to the new generation of Italian mathematicians such as\nBetti\n,\nBeltrami\nand others.\nCasorati received many honours. He was elected to the\nGöttingen Academy of Sciences\n(\nKönigliche Gesellschaft der Wissenschaften\n)\nin\n1877\n, the\nTurin Mathematical Society\n(\nby then the\nTurin Academy of Sciences\n)\nin\n1880\n, the Bologna Academy of Sciences in\n1885\n, and the\nBerlin Academy of Sciences\nin\n1886\n. He was also elected to the Lombardy Institute of Sciences and Letters in\n1868\n, the Italian Society of Science in\n1869\n, and the\nAccademia dei Lincei\nin\n1875\n(\nhaving been a corresponding member from\n1871)\n.",
  "matematicos_citados_na_biografia": [
    "A Bordoni",
    "Brioschi",
    "Betti",
    "Kronecker",
    "Weierstrass",
    "Riemann",
    "Liouville",
    "Beltrami",
    "Hermite",
    "Struik",
    "Fuchs",
    "Schwarz",
    "Mittag-Leffler",
    "Schläfli",
    "Göttingen Academy of Sciences",
    "Turin Mathematical Society",
    "Turin Academy of Sciences",
    "Berlin Academy of Sciences",
    "Accademia dei Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}