{
  "nome_completo": "Ferdinand Verbiest",
  "nome_curto": "Ferdinand Verbiest",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Verbiest/",
  "data_nascimento": "9 October 1623",
  "local_nascimento": "Pittem, Flanders, Spanish Netherlands (now Belgium)",
  "data_morte": "28 January 1688",
  "local_morte": "Beijing, China",
  "summary": "Ferdinand Verbiest was a Flemish missionary to China in the 17 th century. He produced the first Manchu edition of the first six books of Euclid, a remarkable world map, and a steam automobile. He is also famed as an astronomer, designing astronomical instruments and producing calendars.",
  "biografia": "Ferdinand Verbiest\nwas the son of Judocus Verbiest\n(\nknown as Just or Joos\n)\nand Ann Van Hecke. Just Verbiest had been born in Bruges in\n1593\n/\n94\nand studied at the Bogaardenschool there. After obtaining the degree of Master of Arts from the University of Douai in\n1611\n, he taught at the Bogaardenschool where he had himself studied, then in\n1615\nat a school in Tielt, where he also served as sexton of the church. Valerie Arickx writes\n[\n10\n]\n:-\nJust Verbiest had much to do in Tielt in the church and in the school. ...\n[\nHe\n]\ngot a good name and reputation in the town as an intelligent and learned man with a good pen and very nice writing! ... Verbiest found, in this manner, his way into the administration, and the municipal government asked him many times to draw up and write official papers and letters for the municipality, the church and the public assistance committee.\nIn\n1617\nhe married Ann Van Hecke whose family were important people in Bruges. While in Tielt, three of Just and Ann's seven children were born: Judoca Verbiest\n(1618\n-\n1634)\n; Katherin Verbiest\n(\nborn\n1620)\n; and John Baptist Verbiest\n(1622\n-\n1659)\n. In late\n1622\n, the Verbiest family moved to Pittem, which is only about\n4\nkm west of Tielt, and lived in a large house in the market square near the church. Just Verbiest now took on the role of bailiff and was a tax collector for the lord of Pittem, Don Ferdinando de Zuniga, a nobleman from Madrid. Four of Just and Ann's seven children were born after the family moved to Pittem: Ferdinand Verbiest\n(1623\n-\n1688)\n, the subject of this biography; Jemina Verbiest\n(1626\n-\n1678)\n; Albert Verbiest\n(1628\n-\n1694)\n; and Ann Verbiest\n(1630\n-\n1681)\n.\nBefore continuing with Ferdinand's biography, let us say a little about his siblings. Judoca Verbiest died aged\n16\nfrom the plague. Katherin Verbiest married the merchant R Van de Vinck in Kortrijk in\n1658\n. John Baptist Verbiest had the same occupations as his father, bailiff, tax collector and judge, but did not have his father's administrative abilities and ended up as tax collector for the Hospital of Our Lady in Kortrijk where he died a poor man. Jemina Verbiest married John Lust in\n1650\n. He was secretary and later mayor of Pittem. She died in the house owned her parents in the market square of Pittem in\n1678\n. Albert Verbiest was awarded a law degree, then was bailiff in Pittem in\n1651\n. He married Katherine Isenbaert in Bruges in\n1658\nand died from the plague in\n1694\n. Ann Verbiest became a nun at the Hospital of Our Lady in Kortrijk.\nLet us return to the biography of Ferdinand Verbiest who lived in his home town of Pittem until\n1635\nwhen he was twelve years old. These were not easy times in the Spanish Netherlands with fighting continuing throughout these years as the Thirty Years War saw the French and Dutch trying to defeat the Spanish rulers. Verbiest went to a school in Pittem where he was taught by the parish priest and the sexton. During these years his father, who was an important man in the village, went on many business trips to Bruges, Brussels, Ghent and Kortrijk. In the autumn of\n1635\nVerbiest went to secondary school in Bruges which is about\n25\nkm north of Pittem\n[\n9\n]\n:-\nWhen Ferdinand Verbiest went to secondary school in Bruges in\n1635\n, he was not a mere peasant. He knew what a book and a map were, he had seen Bruges, and he had heard about far-away countries.\nThe year\n1635\nsaw the French and Dutch call on those living in the Spanish Netherlands to rise against their rulers. A Dutch-French army entered the country in June\n1635\nand there was a siege of Leuven. The fighting did not end until\n1648\nwith the Peace of Westphalia when the Spanish Netherlands came under Dutch control. Verbiest studied at Bruges for the year\n1635\n-\n36\n, then moved to attend school in Kortrijk.\nVerbiest spent four years studying at the Jesuit College in Kortrijk. This college, founded in\n1587\nas a Latin school with four classes, had a Greek course added in\n1587\n. Beginning in\n1630\n, teacher training also took place in the Jesuit College. He completed his studies at the Jesuit College in Kortrijk in\n1640\nand, on\n7\nJanuary\n1641\n, he matriculated in Lily College of the University of Leuven. This College, founded in\n1431\nonly a few years after the university was founded, was one of four colleges of the University of Leuven which, when Verbiest studied there, were specifically teaching colleges for undergraduates in the Liberal Arts. He took examinations for entry into the Society of Jesus and, after showing his brilliance, was accepted into the Society on\n2\nSeptember\n1641\n. He then left for the Jesuit novitiate in Mechelen where he remained for two years. After successfully completing the necessary examinations, he took his vows on\n4\nSeptember\n1643\n.\nAfter taking his vows, Verbiest was sent back to the College in Leuven where he studied mathematics and philosophy for two years. He was fortunate that\nAndré Tacquet\nspent the year\n1644\n-\n45\nteaching at the college in Leuven and Verbiest benefitted from being taught by one of the finest mathematicians. Astronomy was taught from\nPtolemy\n's description, still using the\nSphaera Mundi\nof\nJohannes de Sacrobosco\n, but there was some mention of the ideas of\nNicolaus Copernicus\nand\nTycho Brahe\n. For example,\nTacquet\nseems to have taken the position that scientifically he approved the heliocentric system but had to reject it to follow the beliefs of his Church.\nAfter his studies in Leuven, Verbiest was sent to teach at the Jesuit College in Kortrijk. At this stage he was keen for missionary work and he had applied to in January\n1645\nto be sent to America as a missionary. His request was refused but he did not give up and he applied again in February\n1647\n. Again his request was refused. In May\n1647\nhis third request was approved and he was assigned to a mission to New Biscay in Mexico. He went to Spain to sail to Mexico but the Spanish authorities did not allow him to embark on the grounds that there were already too many missionaries in Mexico. He then taught Greek and Latin in Brussels from\n1648\nto\n1652\n, when he was sent to study in Rome at the Pontifical Georgian College. In Rome he studied theology, mathematics and astronomy. There he met the famous mathematician and scientist Athanasius Kircher\n(1602\n-\n1680)\nand his assistant Gaspar Schott\n(1608\n-\n1666)\n. After a year in Rome he was approved for a mission to the New Kingdom of Granada\n(\npresent day Colombia\n)\nbut told first to go the Colégio San Hermenegildo in Seville to continue his studies of theology. He was ordained as a priest and finished his studies in Seville in\n1655\nwith the award of a doctorate\n(\nin April of that year\n)\nbut again the Spanish authorities did not allow him to embark. He knew that two fellow Belgium Jesuits, Philippe Couplet and François de Rougemont, were hoping to be missionaries in China so Verbiest applied to go to China.\nWhile waiting to go to China, Verbiest went to Genoa where he continued his study of mathematics, probably with Giacomo Bonvicini\n(1619\n-\n1657)\n. He remained in Genoa until\n8\nJanuary\n1656\nwhen he left and travelled back to Lisbon. The Dutch ship the missionaries were to sail on, the\nDe Griet\n, was hijacked by French pirates. While waiting for another ship, Verbiest was sent to the Jesuit College in Coimbra to teach mathematics. Returning to Lisbon, on\n4\nApril\n1657\nVerbiest sailed with\n37\nmissionaries,\n17\nof whom were heading for China under the leadership of Martino Martini\n(1614\n-\n1661)\n. Of the two mentioned above, Philippe Couplet was already in China and François de Rougemont was on the same ship as Verbiest. In October, the ship reached Goa in India and the Chinese group waited there until\n30\nJanuary\n1658\nwhen they sailed to Macao which they reached on\n17\nJune. In Macao, Verbiest lived in the Colégio Madre de Deus and met up with Philippe Couplet who was waiting for permission to enter China. Finally, in the spring of\n1659\nVerbiest was one of fourteen missionaries allowed to enter China from Macao. Many of the missionaries had died on the voyage which explains the relatively small number entering China.\nVerbiest's first assignment was to be a preacher in the Shaanxi province. In\n1660\n, however, the Jesuit Johann Adam Schall von Bell\n(1591\n-\n1666)\n, who headed the Beijing Imperial Observatory and the Mathematical Tribunal, called Verbiest to come to Beijing and act as his assistant. Verbiest arrived in Beijing to take up this position on\n6\nJune\n1660\n. At this time Schall was very much in favour with the Shunzhi Emperor and had considerable authority. This began to change in\n1661\n, however, when the Emperor died and four regents took power to run the country until the Emperor's seven year old son who succeeded him became old enough to rule. Yang Guangxian\n(1597\n-\n1669)\n, a Chinese Muslim official, brought charges against Schall in a pamphlet in\n1664\n. As well as accusing Schall, who had suffered a stroke a few months earlier, of using his position to promote Christianity, he claimed that Schall had made mathematical errors in certain astronomical predictions.\nAs a result of the accusations, Schall, Verbiest and eight others were detained in prison in chains. Because of his stroke, Schall was unable to defend himself, so Verbiest took on that role. Showing that Schall had not made errors was easy for Verbiest but he admitted that Schall had shown Christian material to the Emperor. By the end of December\n1664\nall were found guilty. Schall was sentenced to death while Verbiest and two others were each sentenced to a hundred strokes of the cane and were banned from the Chinese court. They were saved, however, by a series of earthquakes which struck Beijing in April\n1665\ncausing a fire at the Imperial Palace. This was seen as divine punishment for the verdicts and lighter sentences imposed. Several missionaries were exiled to Canton, but Verbiest was allowed to remain in Beijing. Schall died from his illness so his death penalty became meaningless.\nYang Guangxian now took over as Director of the Beijing Imperial Observatory and head of the Mathematical Tribunal. In\n1667\nVerbiest was put under house arrest but this gave him an opportunity to devote much time to working as a mathematician and astronomer. In\n1668\n, however, he was given an opportunity to demonstrate his skills as a mathematician and astronomer at the Imperial Court. He was able to point to errors in the\n1669\ncalendar which Yang Guangxian and his assistant had produced. Various tests were proposed all of which Verbiest passed with ease. In January\n1669\nhe informed the court about further errors in their calendar and, after the instruments at the Beijing Imperial Observatory had been used to show he was correct, Verbiest was appointed Director of the Beijing Imperial Observatory and head of the Mathematical Tribunal. Things were now going in his favour, particularly since the regency had collapsed and in\n1669\nthe Shunzhi Emperor's son, the fifteen year old Kangxi Emperor, was taking power.\nOver the next few years Verbiest used his skills as a linguist\n(\nhe spoke Manchu, Latin, German, Dutch, Spanish, Italian and Tartar\n)\n, as a mathematician, as an astronomer, and in other sciences to great effect. He became a tutor to the Kangxi Emperor teaching him geometry and, to help in this, he translated the first six books of\nEuclid\ninto the Manchu language. He also taught the Kangxi Emperor philosophy and music. He explained Christian teachings to the Emperor and, as a consequence, the Emperor allowed him to preach Christianity in all regions under his rule. As Director of the Beijing Imperial Observatory he had it rebuilt in\n1673\nand had six new instruments built to his own design to replace the out-dated ones which were consigned to a museum. He produced a\n16\n-volume work\nDisclosure on the Newly-Built Astronomical Instruments in the Observatory\nin\n1674\ndescribing the design, use, and function of the instruments. Joseph Brucker writes\n[\n12\n]\n:-\nThe emperor requested the priest to construct instruments like those of Europe, and in May,\n1674\n, Verbiest was able to present him with six, made under his direction: a quadrant, six feet in radius; an azimuth compass, six feet in diameter; a sextant, eight feet in radius; a celestial globe, six feet in diameter; and two armillary spheres, zodiacal and equinoctial, each six feet in diameter. These large instruments, all of brass and with decorations which made them notable works of art, were, despite their weight, very easy to manipulate, and a credit to Verbiest's mechanical skill as well as to his knowledge of astronomy and mathematics. They are still in a perfect state of preservation ...\nAlso in\n1674\nhe produced\nA Map of the Whole World\n. Only a few copies survive, one of which is in the University of Glasgow's Hunterian Museum\n[\n31\n]\n:-\n'Kunyu Quantu'\n(\nA Map of the Whole World\n)\n, by Ferdinand Verbiest,\n1674\n, showing the two hemispheres of the world was designed for the Chinese Emperor Kangxi\n(1662\n-\n1722)\nby the Jesuit Father Ferdinand Verbiest ... Printed from woodblocks, the map was part of a larger geographical work called 'Kunyu tushuo'\n(\nIllustrated Discussion of the Geography of the World\n)\n, which included information on different lands as well as the physical map itself. Cartouches provide information on the size, climate, land-forms, customs and history of various parts of the world and details of natural phenomena such as eclipses and earthquakes.  Columbus' discovery of America is also discussed.  Images of ships, real and imaginary animals and sea creatures pepper both hemispheres, creating a visually stunning as well as historically important object.\nVerbiest was also an inventor with many remarkable ideas. His steam powered car was designed for the Kangxi Emperor and is described in\n[\n8\n]\n. Here is the summary of that work:-\nIn the early\n1670\ns, Ferdinand Verbiest, a Flemish Jesuit missionary in China and head of the observatory of Peking, built a small working model of a steam turbine-powered vehicle which he demonstrated at the Chinese imperial court and which may be considered as the oldest precursor of the automobile. From the design of the steam turbine and the arrangement of the power train of this vehicle, it appears that Verbiest was aware of the description of a steam turbine and a self-moving vehicle published in\n1629\nby the Italian architect and engineer Giovanni Branca\n(1571\n-\n1645)\n.\nLyman Horace Weeks writes in\n[\n33\n]\n:-\nThe Verbiest model was for a four-wheeled carriage, on which an aeolipile was mounted with a pan of burning coals beneath it. A jet of steam from the aeolipile impinged upon the vanes of a wheel on a vertical axle, the lower end of the spindle being geared to the front axle. An additional wheel, larger than the supporting wheels, was mounted on an adjustable arm in a manner to adapt the vehicle to moving in a circular path. Another orifice in the aeolipile was fitted with a reed, so that the steam going through it imitated the song of a bird.\nIn\n[\n12\n]\nJoseph Brucker discusses some of Verbiest's work for the Jesuit mission:-\nIn\n1677\nFather Verbiest was appointed vice provincial, i.e. superior of all the Jesuit missions of China. This nomination was a stimulus to seek new means of developing the work confided to his direction, with which object he addressed\n(15\nAugust,\n1678)\na circular letter to all the members of his order in Europe. In it he set forth the hopes which more than ever were held out to the Faith in China, together with the impossibility for the missionaries taken in the field, with the fewness of their number and the inadequacy of their resources, to gather in all the harvest. He then urged his brethren in Europe by most touching arguments to come in as great numbers as possible to reinforce this body of overworked labourers, and also to procure for the mission the material resources necessary for founding new Christian communities, supporting catechists, establishing schools, etc. ... There is a memoir ... dated from Peking,\n12\nJune,\n1678\n[\nin which Verbiest\n]\nenergetically advocated the necessity of ordaining Chinese priests ... He desired that these Chinese priests might be allowed to say Mass and administer the sacraments in the Chinese language, which permission had been granted in principle by Paul V, as early as\n1615\n. Among the things which Father Verbiest particularly recommend to Father Couplet, sent to Rome in\n1680\nas procurator of the missions of China, was a request for a confirmation of this permission. His gift to the pope of the Chinese translation of the Missal by Father Buglio was calculated to support this request, but Father Couplet's negotiations in this respect were without result.\nWe should note that Verbiest always stressed the importance of missionaries becoming competent mathematicians and argued for improved mathematics teaching in European Jesuit colleges.\nOn\n13\nFebruary\n1687\nVerbiest fell from his horse and had to spend a while in bed. This marked the start of a decline in his health. On\n25\nJanuary\n1688\nhe had a very high fever and he received the last rites on the following day. He died on\n28\nJanuary\n1688\nand his funeral was held on\n11\nMarch. He was buried in the Zhalan Cemetery, Beijing. See\nTHIS LINK\n.\nHis remarkable achievements have been recognised in a number of ways. The Chinese gave him the exceptional title \"Learned and diligent\" in an imperial decree of\n19\nMay\n1689\n. In more recent times a statue was erected in his home town of Pittem\n[\n13\n]\n:-\nOn the market square of Pittem is a bronze statue of Ferdinand Verbiest. It represents Verbiest as a Chinese mandarin, sitting in a beautifully decorated seat. He's resting his head on his right hand while pointing with his left hand to a globe. The monument was made by sculptor Count Jacques de Lalaing and was inaugurated on\n10\nAugust\n1913\n. It soon had to be hidden away to protect it from the \"bronze hunger\" of the German occupier. On\n26\nMay\n1940\nthe statue was slightly damaged by bomb shrapnel, and was restored in\n1988\nin the Sergeys bell foundry in Leuven.\nIn\n1982\nthe Ferdinand Verbiest Foundation and the Ferdinand Verbiest Institute were founded. The Foundation:-\n... promotes dialogue and cultural exchange with China. It engages in joint academic research with institutes in Chain and in Belgium. It cooperates with the Church in China in a spirit of Christian brotherhood and equality among particular Churches.\nThe Ferdinand Verbiest Institute:-\n... is a Belgium-based institute sponsored by the Ferdinand Verbiest Foundation leuven and hosted by the Catholic University of Leuven and committed to the dialogue between Europe and China. The Institute was named after the Belgian Jesuit-astronomer at the Chinese court, Ferdinand Verbiest. Faithful to the inspiration of its patron, the Institute combines scholarly exchange with an active interest in the Church of China.",
  "matematicos_citados_na_biografia": [
    "André Tacquet",
    "Ptolemy",
    "Johannes de Sacrobosco",
    "Nicolaus Copernicus",
    "Tycho Brahe",
    "Tacquet",
    "Euclid",
    "THIS LINK"
  ],
  "imagens": [
    "verbiest.jpg"
  ]
}