{
  "nome_completo": "Francesco Maurolico",
  "nome_curto": "Francesco Maurolico",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maurolico/",
  "data_nascimento": "16 September 1494",
  "local_nascimento": "Messina, Kingdom of Sicily (now Italy)",
  "data_morte": "22 July 1575",
  "local_morte": "Messina, Kingdom of Sicily (now Italy)",
  "summary": "Francisco Maurolico was an Italian Benedictine who wrote important books on Greek mathematics. He also worked on geometry, the theory of numbers, optics, conics and mechanics.",
  "biografia": "Francesco Maurolico\n's name is Greek and is transcribed in a variety of different ways in addition to 'Francesco Maurolico' which is the most common. His first name is sometimes given as Francisco while other forms of his family name are Maurolyco, Maruli or Marulli. He used a Latin form of his name in his publications, giving again different forms: Maurolycus, Maurolicus or Maurolycius. His family were originally Greek but had fled to Messina, in Sicily, to escape from Turkish invasions of their homeland, so their first language was Greek. Francesco's father, Antonio Maurolico, had fled from Constantinople to Messina where he was tutored by the Greek scholar and grammarian Constantine Lascaris who had also fled from Constantinople, settling in Messina in\n1466\n. Antonio became a physician and then Master of the Messina Mint\n(\nSicily minted its own currency at this time\n)\n. He married Penuccia and they had seven sons: Girolamo, Gio-Saluo, Silvestro, Matteo, Francesco, Gio-Pietro, and Giacomo, and one daughter Laurea. The family were well-off owning two homes in and around Messina, a town house and a villa outside the city. Much of Francesco's education came from his mother, described as a wise and noble women, and his father, who taught him Greek, mathematics and astronomy. However, he also learned much from Francesco Faraone, a priest in Messina, who taught him grammar and rhetoric. His education gave him the critical approach of the humanist Renaissance scholars. Thus Maurolico would believe in approaching problems using his intellect, and using his own practical experience.\nInfluenced by his upbringing he entered the Church and was ordained a priest in\n1521\n. However, disease spread through Messina and many died during the next few years, including Maurolico's father, two of his brothers and his sister. Maurolico left the city for a while to escape from the deadly illness. Around\n1525\nhe made a visit to Rome and spent some time there. After his father's death, Maurolico inherited sufficient wealth to allow him to live without working for several years. Although he was not the eldest of his parent's children, his older brothers died before his father so he inherited. Maurolico was able to concentrate on his scholarly pursuits during these years and he produced significant contributions in a broad range of different topics although his best work was done on mathematics. Certainly he was not a wealthy man and required patrons to be able to publish his work and several leading men of Messina appear to have put up funds since their names appear in dedications in Maurolico's work. For example,\nGrammatica rudimenta\n, which he published in\n1528\n, was dedicated to Ettore Pignatelli. In the same year he was requested by the governor of Messina, Giovanni Marullo, to lecture on\nThe Sphere\nof\nSacrobosco\nand\nEuclid\n's\nElements\n. In fact the governor attended Maurolico's lectures on these topics. Perhaps as a result of these lectures, Maurolico wrote up his rearrangement and translation of part of\nEuclid\n's\nElements\nand completed the task on\n9\nJuly\n1532\n. It was on that day that he signed the dedication but it remained unpublished for\n43\nyears, only being printed and published in\n1575\nas part of\nOpuscula Mathematica\nwhich we say more about below. J-P Sutto\n[\n50\n]\ndiscusses Maurolico's work on\nEuclid\n:-\nIn his compendium of\nEuclid\n's 'Elements', Francesco Maurolico modifies the theory of proportions. The Sicilian concentrates on equalities of ratios of Book\n5\nand tries to avoid handling of equimultiples. He concentrates on isolating 'named' ratios - of a number to a number - and he constantly compares ratios and named ratios.\nAnother of Maurolico's patrons was Giovanni Ventimiglia,\n6\nth\nMarchese di Geraci, Prince of Castelbuono\n(\na town in the province of Palermo, Sicily\n)\n, and Governor of Messina. He had married Dona Isabella de Montcada dei Conti di Aitona in\n1527\nand their son Simone Ventimiglia\n(1528\n-\n60)\nwas also a patron of Maurolico who lived at their estate for long periods during\n1547\n-\n50\n. He was able to use the tower of their Pollina Castle from which to make astronomical observations. In\n1550\n, he became a Benedictine and Simone Ventimiglia conferred on him the Abbey of Santa Maria del Parto\n(\ntoday called the Santuario di San Guglielmo\n)\nin Castelbuono. At this time the Benedictine Order was one of the two main monastic orders which formed the basis of Christian life in Sicily, the other being the Franciscans. As a Benedictine, Maurolico would have a life of simplicity, a feature that was much loved by the people. However in a\n1543\npublication he describes events which took place in\n1540\n(\nsee for example\n[\n29\n]\n)\n:-\nThe insolence of the Spanish soldiers returning from the capture of Castelnuovo gave us a winter harsher than usual, so that the barbarians would not incur such consideration from us; among which tumults even I\n(\nwho would not laugh?\n)\n, having put down my ruler and compass, was driven to take up arms for a time. For the example of my\nArchimedes\nwarned me that in such danger I should not be devoting myself to drawing lines and circles.\nAfter several years in the Abbey in Castelbuono, Maurolico returned to Messina where he was appointed as an abbot in the cathedral. In fact he lived his whole life in Sicily except for short periods in Rome and Naples. In Messina, St Ignatius had founded the first ever Jesuit college in\n1548\n. This later became the Studium Generale and is now the University of Messina. Maurolico was involved in the mathematical curriculum that was set up in the College being appointed as professor of mathematics in\n1569\n. It is interesting to note that his contract specified that he was required to teach the theory of music as a branch of mathematics. He also served as head of the mint in Messina and he was in charge of the fortifications of Messina\n(\nin collaboration with Antonio Ferramolino worked for the Spanish crown in Sicily for during years\n1530\n-\n50)\n, largely dominated by the impressive San Salvatore fort, a task he was given by Charles V's viceroy Giovanni de Vega who was President of the Sicilian Parliament in\n1546\n. Maurolico was also mathematics tutor to one of Giovanni de Vega's two sons. He was involved in designing churches in the city, and the building of two famous fountains, the Fontana di Orione in front of the cathedral and the Fontana del Nettuno designed by G Montorsoli. In addition he was appointed to write a history of Sicily which was published under the title\nSicanicarum reum compendium\nin\n1562\n. Ten years earlier he had received a salary for two years from the Senate of Messina to allow him to work on this History as well as his mathematics texts.\nMaurolico wrote important books on Greek mathematics, restored many ancient works from scant information and translated many ancient texts such as those by\nTheodosius\n,\nMenelaus\n,\nAutolycus\n,\nEuclid\n,\nApollonius\nand\nArchimedes\n. Some appeared in\nTheodosii Sphaericorum Elementorum Libri iii\nwhich he published in\n1558\n. The work contains nine separate items by Maurolico, some translations, some commentaries, and a work of his own\nDe Sphaera Sermo\n. The\nTheodosii\nalso contains a table of secants and, although\nDelambre\ncredited him with the first use of this function, it had appeared earlier in the work of\nCopernicus\n. However, Maurolico does prove secant = radius / cosine and secant =\n(\nradius × tangent\n)\n/ sine and gives a table of secants from\n0\n° to\n45\n°. Maurolico also worked on geometry, the theory of numbers\n(\nL E Dickson\nnotes some of his results\n)\n, optics,\nconics\nand mechanics, writing important books on these topics which we will discuss in more detail below. Maurolico completed a restoration of books V and VI of\nApollonius\n's\nConics\nin\n1547\nworking from the scant details that\nApollonius\ngives in the Preface to the work. These were not published until\n1654\n, about\n80\nyears after his death, as\nEmendatio et restitutio conicorum Apollonii Pergaei\n. Both\nGuglielmo Libri\nand\nGino Loria\nclaimed that this achievement alone showed that Maurolico was a genius.\nIn\n1535\nhe wrote\nCosmographia\nin the form of three dialogues, which was published in\n1543\n. In it he states that he completed the book:-\n... on Thursday\n21\nOctober\n1535\n, the day that the Emperor Charles V came to Messina on his return from the African campaign.\nMaurolico gave methods for measuring the Earth in\nCosmographia\nwhich were later used by\nJean Picard\nin measuring the meridian in\n1670\n. However, he believed that the Earth is the centre of the universe and he dismisses\nCopernicus\n's sun centred universe without mentioning him by name\n(\nsee\n[\n14\n]\n)\n:-\nAnd it would not be necessary for astronomers to refute any other principles as regards the earth, if diversity of opinion and human fickleness had not so grown that it is doubted whether one may perhaps believe and say the earth turns on its axis whilst the heavens stay at rest.\nLater, however, he made a much more personal attack on\nCopernicus\nwhich we quote below.\nMaurolico made astronomical observations, in particular he observed the supernova which appeared in Cassiopeia in\n1572\nnow known as 'Tycho's supernova'.\nTycho Brahe\npublished details of his observations in\n1574\n. Some details of Maurolico's observations were published by\nChristopher Clavius\nbut full details of Maurolico's observations were never published and only rediscovered in\n1960\nby\nC Doris Hellman\n. The manuscript that she discovered was dated\n6\nNovember\n1572\n, five days before\nBrahe\nmade his observations. Perhaps there is an argument for renaming 'Tycho's supernova' as 'Maurolico's supernova'. This would, if nothing else, give this important mathematician some wider recognition which he so clearly deserves.\nBy\n1569\nMaurolico was making considerable efforts to have a collection of his unpublished work printed. He wrote to Francisco Borgia, general of the Jesuit Order, on\n16\nApril\n1569\nasking him to assist in publishing:-\n... certain compendia, in which I have treated all the essentials compactly and inserted most of the topics omitted, ignored or overlooked by others.\nThe work,\nOpuscula Mathematica\n, was dedicated to the governor of Messina who had agreed to help with the expenses. Maurolico also wrote to\nChristopher Clavius\n:-\n... requesting his aid in editing or correcting my essays.\nThe general of the Jesuit Order replied in a letter of\n8\nJuly\n1569\nsaying that:-\n... steps will be taken to see that the book is sent to Venice and recommended to the rector of our college, so that he may turn it over to a suitable printer for publication.\nIn fact the book went to the bookseller Giovanni Comisino in Venice but over five years later the work had still not been published and the general of the Jesuit Order\n(\nthe successor to the one Maurolico wrote to in\n1569)\nwrote to the Venetian governor:-\n... please find out from the bookseller Giovanni Comisino what he has done about the printing of Abbot Maurolico's books, because Sicily asks us about them.\nChristopher Clavius\nvisited Maurolico in\n1574\nand Maurolico gave him various manuscripts of his optical works under the title\nPhotismi de lumine, et umbra\n. These treatises were mostly written in\n1554\nand\nClavius\npromised to have them published in Rome. One treatise discusses the rainbow about which Maurolico writes\n[\n10\n]\n:-\nBut how does it happen, you ask, that the altitude of the rainbow is not exactly\n45\n°, but a little less as ascertained by observation? I do not know how to answer this or what reason I may offer, unless it be that the falling drops are somewhat elongated or somewhat flattened, and thus, varying from the spherical form, change the angle of reflection and hence also the straightness of the ray which in the case of a perfect sphere comes back at an angle of forty-five degrees.\nAnother treatise in\nPhotismi de lumine, et umbra\n, called\nDe conspiciliis\n, discusses lenses\n[\n23\n]\n:-\nHaving recognized that the humour crystallinus, assumed to be the seat of the visual power of the eye, is in fact a bi-convex lens, Maurolico included in this treatise a discussion of the working of the eye.\nBy November\n1574\nthe\nOpuscula Mathematica\nwas in press but there must have been a further delay since when the work was published it did not contain Maurolico's dedication to the governor of Messina but rather a dedication written by the publisher dated\n26\nJuly\n1575\n, four days after Maurolico's death. The\nOpuscula Mathematica\ncontains seven of Maurolico's treatises including\nDe instrumentis astronomicis\non the theory and use of the principal astronomical instruments. Another of the treatises is\nDe Sphaera Liber Unus\nand, in a postscript to this work, Maurolico addresses the reader\n(\nsee\n[\n14\n]\n)\n:-\nI wrote the foregoing work, gentle reader, not so that you would peruse only my treatment and ignore all the others, but so that you would understand the others better because of my discussion, and from it learn what was omitted by the others. I have no doubt that on the basis of my elementary exposition you will read more circumspectly, and judge more perspicaciously, what you see in\nSacrobosco\n,\nRobert Grosseteste\nor\nCampanus\n.\nGrosseteste\ndid not put an end to the reading of\nSacrobosco\n, nor did\nCampanus\nput an end to the reading of\nGrosseteste\n, as perhaps he thought he did. In like manner\nPeurbach\n's 'Theoricae', although extremely accurate and worked out in accordance with the Ptolemaic system, could not completely eliminate the teachings of Al-Bitruji\n(\nAlpetragius\n)\nand the ravings of\nGerard of Cremona\n.\nGeorg Peurbach\nand\nRegiomontanus\ncontented themselves with warning their readers to learn to the best of their ability what to reject and what to accept. But not even Atlas, who supports the heavens, despite all his vigour would have the strength to correct every mistake that has been made and to lead everyone's mind to the path of truth. There is toleration even for\nNicholas Copernicus\n, who maintained that the sun is still and the earth has a circular motion; and yet he deserves a whip or a scourge rather than a refutation. Let us therefore go on to the remaining topics, lest we waste our time for nothing.\nDomenico Scinà writes in\n1808\n(\nsee the new edition of his\nElogio di Francesco Maurolico\n[\n5\n]\n)\n:-\nNobody can reasonably find fault with Maurolico and chide him for not having sided with\nCopernicus\n. I do not thereby intend to excuse our Francesco. On the contrary I readily admit that he did not know how, and was unable, to save himself from the common contagion of his times.\nA companion volume\nArithmeticorum libri duo,\nwritten in\n1557\n, was published at the same time as the\nOpuscula Mathematica\n. This work on number theory contains a proof by induction that is claimed to be the first genuine such proof\n[\n15\n]\n:-\nMaurolycus in Book I of his arithmetic begins with the definitions of different kinds of numbers, namely, even, odd, triangular, square, numeri parte altera longiores, etc. By definition the nth triangular number is the sum of the integers from\n1\nto\nn\nn\nn\ninclusive and the\nn\nn\nn\nth numerus parte altera longior is\nn\n(\nn\n−\n1\n)\nn(n - 1)\nn\n(\nn\n−\n1\n)\n.\nDefining the nth square number as\nn\n2\nn^{2}\nn\n2\nand the nth odd number as\n2\nn\n−\n1\n2n - 1\n2\nn\n−\n1\n, Maurolico goes on to prove results such as:\nProposition VI. The\nn\nn\nn\nth integer plus the preceding integer equals the\nn\nn\nn\nth odd number.\nProposition VIII. The\nn\nn\nn\nth triangular number doubled equals the following\nnumerus parte altera longior\n.\nProposition X. The\nn\nn\nn\nth\nnumerus parte altera longior\nplus\nn\nn\nn\nequals the\nn\nn\nn\nth square number.\nProposition XI. The\nn\nn\nn\nth triangular number plus the preceding triangular number equals the\nn\nn\nn\nth square number.\nProposition XIII. The\nn\nn\nn\nth square number plus the following odd number equals the following square number.\nProposition XV. The sum of the first\nn\nn\nn\nodd integers is equal to the\nn\nn\nn\nth square number.\nIn the proof of this last Proposition, Maurolico makes clear use induction. After proving the first few cases he uses Proposition XIII to prove the inductive step from\nn\nn\nn\nto\nn\n+\n1\nn + 1\nn\n+\n1\n.\nWe have concentrated on Maurolico's mathematical work but Caterina Pirina writes\n[\n37\n]\n:-\n... Maurolico's interests were not restricted to science. A list of his numerous writings appears in the \"Index Lucubrationum\" at the end of the volume of his 'Opuscula Mathematica' of\n1575\n. It includes humanistic works, two libelli of carmina and epigrams, and his Latin verse translation from the Greek, Poemata Phocylidis et Pythagorae Moralia, as well as six books of Diodorus Siculus and six books of the elements of grammar.\nIn\n1613\nfurther mathematical works by Maurolico were published by his nephew Francesco, Barone della Foresta, and his brother Silvestro. They had inherited several of Maurolico's unpublished works which they published together with the biography\nVita dell'Abbate del Parto D Francesco Maurolico\nwritten by Francesco. Perhaps the most significant of Maurolico's works to be published at this time was\nProblemata mechanica\noriginally completed in\n1569\n. W R Laird writes about this work in\n[\n30\n]\n:-\nThe first thinker to attempt to reconcile Archimedean statics and the 'Mechanical Problems' was the mathematician and abbot Francesco Maurolico ... Although Maurolico preferred to ground his mechanics in Archimedean statics, he nevertheless recognized the application of mechanics beyond conditions of equilibrium, to the motion of heavy bodies - the moving of weights with machines and the harnessing of impetus. His notion of the primacy of Archimedean statics in mechanics came to be shared by all the mathematical practitioners who followed.\nIn\n1685\nMaurolico's\nDe momentis aequalibus\n, completed in\n1548\n, was published in which he investigated the centre of gravity of a paraboloid\n(\nsee\n[\n36\n]\nfor more details\n)\n. In\n1876\nFederico Napoli published further Maurolico manuscripts including:\nDemonstratio algebrae\n, which is an elementary text looking at quadratic equations and problems whose solution reduces to solving a quadratic;\nGeometricarum questionum\n(\nBooks\n1\nand\n2)\n, which is a work on trigonometry and solid geometry but also discusses the method for measuring the Earth that Maurolico proposed earlier in\nCosmographia\n;\nBrevis demonstratio centri in parabola\n, a text dated\n1565\n, which examines mechanics problems of the type considered in his commentary on\nArchimedes\n. In this work he determines the centre of gravity of a segment of a paraboloid of revolution bounded by a plane perpendicular to the axis.\nWe should not think that all these posthumous publications complete the printing of Maurolico's treatises. For example, in\n1995\nin\n[\n54\n]\n, Roberta Tassora gives the previously unpublished text of Maurolico's reconstruction of the treatise\nDe sectione cylindri\noriginally written by\nSerenus\nof Antinoeia. Maurolico completed this work in\n1534\n.",
  "matematicos_citados_na_biografia": [
    "Sacrobosco",
    "Euclid",
    "Archimedes",
    "Theodosius",
    "Menelaus",
    "Autolycus",
    "Apollonius",
    "Delambre",
    "Copernicus",
    "L E Dickson",
    "conics",
    "Guglielmo Libri",
    "Gino Loria",
    "Jean Picard",
    "Tycho Brahe",
    "Christopher Clavius",
    "C Doris Hellman",
    "Brahe",
    "Clavius",
    "Robert Grosseteste",
    "Campanus",
    "Grosseteste",
    "Peurbach",
    "Gerard of Cremona",
    "Georg Peurbach",
    "Regiomontanus",
    "Nicholas Copernicus",
    "Serenus"
  ],
  "imagens": [
    "maurolico.jpg"
  ]
}