{
  "nome_completo": "François Viète",
  "nome_curto": "François Viète",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Viete/",
  "data_nascimento": "1540",
  "local_nascimento": "Fontenay-le-Comte, Poitou (now Vendée), France",
  "data_morte": "13 December 1603",
  "local_morte": "Paris, France",
  "summary": "François Viète was a French amateur mathematician and astronomer who introduced the first systematic algebraic notation in his book In artem analyticam isagoge . He was also involved in deciphering codes.",
  "biografia": "François Viète\n's father was Étienne Viète, a lawyer in Fontenay-le-Comte in western France about\n50\nkm east of the coastal town of La Rochelle. François' mother was Marguerite Dupont. He attended school in Fontenay-le-Comte and then moved to Poitiers, about\n80\nkm east of Fontenay-le-Comte, where he was educated at the University of Poitiers. Given the occupation of his father, it is not surprising that Viète studied law at university. After graduating with a law degree in\n1560\n, Viète entered the legal profession but he only continued on this path for four years before deciding to change his career.\nIn\n1564\nViète took a position in the service of Antoinette d'Aubeterre. He was employed to supervise the education of Antoinette's daughter Catherine, who would later become Catherine of Parthenay\n(\nParthenay is about half-way between Fontenay-le-Comte and Poitiers\n)\n. Catherine's father died in\n1566\nand Antoinette d'Aubeterre moved with her daughter to La Rochelle. Viète moved to La Rochelle with his employer and her daughter.\nThis was a period of great political and religious unrest in France. Charles IX had become king of France in\n1560\nand shortly after, in\n1562\n, the French Wars of Religion began. It is a gross over-simplification to say that these wars were between Protestants and Roman Catholics but fighting between the various factions would continue on and off until almost the end of the century. In\n1570\nViète left La Rochelle and moved to Paris. Although he was never employed as a professional scientist or mathematician, Viète was already working on topics in mathematics and astronomy and his first published mathematical work appeared in Paris in\n1571\n. While Viète was in Paris, Charles IX authorised the massacre of the Huguenots, who were an increasingly powerful group of French Protestants, on\n23\nAugust\n1572\n. This must have been an extremely difficult time for Viète for, although not active in the Protestant cause, he was a Huguenot himself. Charles did not live very long after this event, the massacre apparently haunting him for the rest of his life. However, on\n24\nOctober\n1573\nCharles appointed Viète to the government of Brittany which was based at Rennes.\nViète moved to Rennes to take up his position of counsellor there. He remained at Rennes until March\n1580\nwhen he returned to Paris. Charles IX had died on\n30\nMay\n1574\nand, on Charles' death Henry III became king. Henry made concessions to the Protestant Huguenots in\n1576\nand the Roman Catholics formed the Holy League to look after their own interests by military actions. In this tense atmosphere Viète was appointed by Henry III as royal privy counsellor on\n25\nMarch\n1580\n, and he was attached to the parliament in Paris.\nIn\n1584\nthe Holy League was strengthened when Henry III's brother died and the Protestant Henry of Navarre became heir to the throne. Fearing that the Protestants might gain control in France, the Holy League fought more vigorously for the Roman Catholic cause. The royal court contained factions with different political aims and in\n1584\nViète's position as a known Huguenot became untenable and he was banished by his political enemies from the court. Leaving Paris, Viète went to Beauvoir-sur-Mer, on the coast about\n130\nkm northwest of his home town of Fontenay-le-Comte. During the five years that he spent at Beauvoir-sur-Mer, Viète was able to devote himself entirely to his mathematical studies. In many ways Viète's enemies did mathematics a favour, for it was during this period without formal duties that Viète's most important mathematics was done.\nIn\n1587\nHenry of Navarre defeated the army of Henry III. A rising of the people of Paris, a Holy League stronghold, on\n12\nMay\n1588\n, caused the king to flee to Chartres. At this stage Henry III sent for Viète and, in April\n1589\n, brought him back into his parliament which was now set up at Tours. Henry III was reconciled with Henry of Navarre\n(\nsince it suited them to combine forces\n)\nand together they tried to retake Paris in\n1589\n. Henry III was, however, assassinated by a Jacobin friar on\n1\nAugust of that year.\nPhilip II of Spain, a champion of the Roman Catholic Counter-Reformation, supported the Holy League by sending money and troops to France. After the murder of Henry III, Philip claimed the throne of France for his daughter, Isabella Clara Eugenia. A letter to Philip dated\n28\nOctober\n1589\nwritten in code fell into the hands of Henry of Navarre who was to become the next king, Henry IV.\nFollowing the assassination of Henry III, Viète worked for Henry IV. He was now in a sounder position, as a Protestant supporter of a Protestant King. Viète was certainly well known for his mathematical abilities by this time and, as one of the Henry IV's most loyal supporters, it was natural for Henry to turn to Viète to decode messages being sent to his enemy Philip II of Spain. It took Viète some time to crack the complicated code. At first he was only able to decode parts of the message and forwarded parts to Henry IV, but eventually Viète sent him the fully decoded message on\n15\nMarch\n1590\n. However\n[\n2\n]\n:-\n... when Philip, assuming that the cipher could not be broken, discovered that the French were aware of his military plans, he complained to the Pope that black magic was being employed against his country.\nAlthough Viète was never a professional mathematician, he did lecture on mathematics. For instance in\n1592\nhe lectured at Tours and discussed recent claims that the\ncircle could be squared\n, an\nangle trisected\n, and the\ncube doubled\nusing only\nruler and compass\n. He showed in these lectures that the \"proofs\" which had been published earlier in the year were fallacious.\nIn\n1592\nHenry IV did not control Paris, and he was still opposed by the Holy League in France who were supported by Spain. Henry converted back to Roman Catholicism in July\n1593\n, perhaps for political rather than religious reasons. Viète followed the example of his king and also converted to Roman Catholicism. Henry's conversion was certainly effective, for resistance against him lessened and he took Paris on\n22\nMarch\n1594\n. Henry declared war on Philip II of Spain in January\n1595\nand continued to wipe out resistance by the League and its Spanish allies.\nDuring the period referred to in the previous paragraph, Viète had again come to the King's rescue by solving a mathematical problem. In\n1593\nRoomen\nhad proposed a problem which involved solving an equation of degree\n45\n. The ambassador from the Netherlands made comments to Henry IV on the poor quality of French mathematicians saying that no Frenchman could solve\nRoomen\n's problem. Henry put the problem to Viète who solved it by realising that there was an underlying trigonometric relation. As a result of this a friendship grew up between Viète and\nRoomen\n. Viète proposed the problem of drawing a circle to touch\n3\ngiven circles to\nRoomen\n(\nthe Apollonian Problem\n)\nand\nRoomen\nsolved it using\nhyperbolas\n, publishing the result in\n1596\n. Viète himself, published his answer to\nRoomen\n's problem in\n1595\n, stating in the introduction\n[\n1\n]\n:-\nI, who do not profess to be a mathematician, but who, whenever there is leisure, delight in mathematical studies ...\nViète continued to serve Henry IV in Paris until\n1597\nwhen he went back to his home town of Fontenay-le-Comte. Two years later he was back in Paris, again in the service of Henry IV, but he was dismissed by Henry on\n14\nDecember\n1602\n. He died almost exactly one year later.\nSome of Viète's first work was directed towards the production of a major work on mathematical astronomy\nAd harmonicon coeleste\n. It was a work which was never published but four manuscripts, one of them an autograph, have survived and were rediscovered by\nLibri\n. The contents of these manuscripts are described in\n[\n22\n]\nwhere it is stated that Viète was interested purely in the geometry of the planetary theories of both\nPtolemy\nand\nCopernicus\n, and did not consider the question of whether the theories represented the actual physical reality. Perhaps rather surprisingly Viète came to the conclusion that\nCopernicus\n's theory was not valid geometrically.\nAlthough the\nAd harmonicon coeleste\nwas never published, Viète did begin publishing the\nCanon Mathematicus\nin\n1571\nwhich was intended as a mathematical introduction to the astronomy treatise. The\nCanon Mathematicus\ncovers trigonometry; it contains trigonometric tables, it also gives the mathematics behind the construction of the tables, and it details how to solve both plane and spherical triangles. It is interesting that in the second part of the\nCanon Mathematicus\nViète\n[\n1\n]\n:-\n... wrote decimal fractions with the fractional part printed in smaller type than the integral and separated from the latter by a vertical line.\nViète introduced the first systematic algebraic notation in his book\nIn artem analyticam isagoge\npublished at Tours in\n1591\n. The title of the work may seem puzzling, for it means \"Introduction to the analytic art\" which hardly makes it sound like an algebra book. However, Viète did not find Arabic mathematics to his liking and based his work on the Italian mathematicians such as\nCardan\n, and the work of ancient Greek mathematicians. One would have to say, however, that had Viète had a better understanding of Arabic mathematics he might have discovered that many of the ideas he produced were already known to earlier Arabic mathematicians.\nIn his treatise\nIn artem analyticam isagoge\nViète demonstrated the value of symbols introducing letters to represent unknowns. He suggested using letters as symbols for quantities, both known and unknown. He used vowels for the unknowns and consonants for known quantities. The convention where letters near the beginning of the alphabet represent known quantities while letters near the end represent unknown quantities was introduced later by\nDescartes\nin\nLa Gèometrie\n. This convention is used today, often without people realising that a convention is being used at all.\n(\nIf I asked for a solution to\na\nx\n=\nb\nax = b\na\nx\n=\nb\nnobody asks: \"For which quantity do I solve the equation ?\"\n)\nViète made many improvements in the theory of equations. However, if we are to be strictly accurate we should say that he did not solve equations as such but rather he solved problems of proportionals which he states quite explicitly is the same thing as solving equations. However, he was restricted by a condition of homogeneity of dimension. The problem is that if we ask for a solution of\nx\n3\n+\nx\n=\n1\nx^{3} + x = 1\nx\n3\n+\nx\n=\n1\nthen we ask for the solution to a problem which does not make sense geometrically. For\nx\n3\nx^{3}\nx\n3\nis a cube while\nx\nx\nx\nis a line and clearly it makes no sense to add a three dimensional object to a one dimensional object. Viète therefore looked for solutions of equations such as\nA\n3\n+\nB\n2\nA\n=\nB\n2\nZ\nA^{3} + B^{2}A = B^{2}Z\nA\n3\n+\nB\n2\nA\n=\nB\n2\nZ\nwhere, using his convention,\nA\nA\nA\nwas unknown and\nB\nB\nB\nand\nZ\nZ\nZ\nwere knowns. The dimensions here are \"correct\" each term being of dimension\n3\n. Viète wrote in the\nIn artem analyticam isagoge\n(\nsee\n[\n7\n]\nor\n[\n3\n]\n)\n:-\nThe first and permanent law of equalities or proportions which, because it is conceived from homogeneous quantities is called the law of homogeneous quantities, is this: homogeneous quantities must be compared with homogeneous quantities.\nHe presented methods for solving equations of second, third and fourth degree. He knew the connection between the positive roots of equations and the coefficients of the different powers of the unknown quantity. Perhaps it is worth noting that the word \"coefficient\" is actually due to Viète. When Viète applied numerical methods to solve equations as he did in\nDe numerosa potestatum\nhe gave methods which were similar to those given by earlier Arabic mathematicians. For example his methods are compared with those of\nSharaf al-Din al-Tusi\nin the paper\n[\n11\n]\nand\n[\n19\n]\n. In the first the author argues that although the methods appear to be similar at first sight, there are many important differences. He deduces that the work of Viète is not based on that of\nSharaf al-Din al-Tusi\n. In\n[\n19\n]\n, however, Rashed argues that the methods of\nSharaf al-Din al-Tusi\nand of Viète are very close indeed.\nViète also wrote books on trigonometry and geometry such as\nSupplementum geometriae\n(1593)\n. He gave geometrical solutions to doubling a cube and trisecting an angle in this book.\nIn\n1593\nViète published a second book, which in many ways was motivated by his lecture course at Tours in the previous year\n(\nwhich we mentioned above\n)\n, examining various problems such as doubling the cube, trisecting an angle and the construction the\ntangent\nat any point on an Archimedian spiral. Also, in this book, he calculated π to\n10\nplaces using a polygon of\n6\n×\n2\n16\n=\n393216\n6 \\times  2^{16} = 393216\n6\n×\n2\n1\n6\n=\n3\n9\n3\n2\n1\n6\nsides. He also represented π as an infinite product which, as far as is known, is the earliest infinite representation of π.\nFinally we should mention that Viète is often called \"the father of algebra\". As the author of\n[\n9\n]\nargues this, on the one hand, is unfair on the many fine algebraists who preceded Viète. On the other hand it is unfair to Viète since his contributions were of much wider mathematical importance.\nIt would also be interesting to know how much Viète's ideas were influenced by those of\nHarriot\n. In\n[\n3\n]\na quotation from a book about\nHarriot\nwritten in\n1900\nby H Stevens is given:-\n... it appears that\nHarriot\n's system of analytics or algebra was based on that of his friend and correspondent François Viète as Viète's was avowedly based on that of the ancients. ... Full credit was given by\nHarriot\nand his friends to the distinguished French mathematician.\nAlthough this seems to make\nHarriot\n's dependence on Viète clear, one would have to say that the two men give very similar approaches to solving equations\nalgebraically\n, yet\nHarriot\nshows deeper understanding than does Viète. I\n[\nEFR\n]\nfeel that one must allow the possibility that ideas flowed in both directions and that Viète's algebra must have benefited from his correspondence with\nHarriot\n.",
  "matematicos_citados_na_biografia": [
    "circle could be squared",
    "angle trisected",
    "cube doubled",
    "ruler and compass",
    "Roomen",
    "hyperbolas",
    "Libri",
    "Ptolemy",
    "Copernicus",
    "Cardan",
    "Descartes",
    "Sharaf al-Din al-Tusi",
    "tangent",
    "Harriot",
    "algebraically"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}