{
  "nome_completo": "François Joseph Français",
  "nome_curto": "François Français",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Francais_Francois/",
  "data_nascimento": "7 April 1768",
  "local_nascimento": "Saverne, Bas-Rhin, France",
  "data_morte": "30 October 1810",
  "local_morte": "Mainz, Germany",
  "summary": "François Français was one of a pair of French mathematical brothers who worked on partial differential equations.",
  "biografia": "François Français\nwas the brother of\nJacques Français\n. The brothers were the children of Jacques Frédéric Français, who was a grocer in Saverne, and Maria Barbara Steib. In\n1789\nFrançois became a seminarist, that is a student in an institution for training candidates for the priesthood. Two years later, in June\n1791\n, he was appointed professor in the Collège at Colmar. Just over a year later, in September\n1792\n, he was appointed to the chair of mathematics in the Collège at Strasbourg.\nPolitical events produced an interlude in Français' career. The French Revolution of\n1789\nhad not gained universal support and there were attempted counter-revolutions in parts of France. In the Vendée region in the west of France there was an uprising which was sparked off by the introduction of conscription in February\n1793\n. By the middle of March there was an alliance of Royalists and peasants with a fair size army. Français joined the government army in May\n1793\nwhich was moving to put down the rebellion.\nThe rebel army at this stage numbered around\n30\n000\nand they took the towns of Thouars, Parthenay, and Fontenay in May. Crossing the Loire the rebels moved east taking Angers in the middle of June but their progress was stopped when they failed to take the town of Nantes. During the summer months there was confused fighting with the government forces somewhat fragmented. Français continued to fight with the government forces and as the autumn approached they became a more cohesive force under a single command and heavily defeated the rebel army\n(\nby this time numbering around\n65000)\nin October.\nThe fighting did not stop there and it was not until the end of December that the government forces mopped up all resistance. Français, however, left the government army in October and returned to teaching. The period of army life must have been attractive to Français for he quickly rejoined the army as an officer and served for a further four years until October\n1797\nwhen he was appointed professor of mathematics at the École Centrale du Haut-Rhin in Colmar.\nFrançais never seemed to be one to stay in any one post for long but this appointment in Colmar lasted longer than any of his others. He remained there for six years but, once he moved on in September\n1803\nto the Lycée in Mainz, he was to teach mathematics in a number of different institutions over the next few years. In\n1804\nhe taught at the École d'Artillierie in La Fère, then he returned to Mainz and taught at the École d'Artillierie there.\nMuch of François Français's work was published after his death by his brother who added to it in a way to make the contribution of each hard to distinguish. François worked on\npartial differential equations\nand his memoir of\n1795\non this topic was developed further and presented to the\nAcadémie des Sciences\nin\n1797\n.\nLacroix\npraised Français' work and described it as making a major contribution to the study of partial differential equations; however, it was not published.\nFrançais was friendly with\nArbogast\nand together they worked on the calculus of derivations. After\nArbogast\ndied in\n1803\n, Français inherited his mathematical papers and continued to work on the calculus of derivations. He presented a memoir on this topic, in particular applying the methods to study projectiles in a resistant medium, to the\nAcadémie des Sciences\nin\n1804\n. This memoir was very highly praised by\nBiot\nin a report of\n22\nApril\n1805\n, but again the work was not published.\nAfter this Français did work which was praised by\nLegendre\n,\nLagrange\n,\nLacroix\nand\nBiot\nbut submitted no further memoirs during his lifetime. However, as described above, his brother published much of his work after his death, publishing four memoirs of François Français's work. Taton, writes in\n[\n1\n]\n:-\nWhile not of the first rank, the mathematical activity of the Français brothers merits mention for its originality and diversity.",
  "matematicos_citados_na_biografia": [
    "Jacques Français",
    "partial differential equations",
    "Académie des Sciences",
    "Lacroix",
    "Arbogast",
    "Biot",
    "Legendre",
    "Lagrange"
  ],
  "imagens": []
}