{
  "nome_completo": "Francis Maseres",
  "nome_curto": "Francis Maseres",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maseres/",
  "data_nascimento": "15 December 1731",
  "local_nascimento": "London, England",
  "data_morte": "19 May 1824",
  "local_morte": "Reigate, Surrey, England",
  "summary": "Francis Maseres was an English mathematician who wrote some influential text-books.",
  "biografia": "Francis Maseres\n's parents were Magdalene du Pratt du Clareau and Peter Abraham Maseres. Originally of French origin, the family were protestants who were forced to leave France due to religious persecution after Louis XIV revoked the Edict of Nantes, which had guaranteed freedom of worship, in\n1685\n. Peter Maseres was a doctor who first lived in Broad Street, Soho, London but then moved to Rathbourne Place. Francis had a brother Peter and they were brought up in a family that was well off.\nFrancis attended the Rev Richard Wooddeson's School in Kingston-upon-Thames before matriculating at Clare College, Cambridge, on\n4\nJuly\n1748\n. Francis' brother Peter matriculated on the same day and both brothers graduated from Clare College Cambridge in\n1752\nwith a degree in classics and mathematics. Francis was ranked as fourth\nwrangler\nmeaning that he was fourth out of the students awarded a first class degree. Francis was awarded the first chancellor's classical medal which was presented to him by the Duke of Newcastle. He was awarded a Joseph Diggons scholarship in January\n1752\n, awarded his MA in\n1755\n, and elected to a fellowship on\n24\nSeptember\n1756\nwhich he held until August\n1759\nwhen he resigned the fellowship when it still had a year to run.\nIn\n1750\nMaseres entered the Inner Temple meaning he was training to join the legal profession. He qualified in\n1758\nand practised law for a few years without too much success although his whole life was associated with The Temple which lies between Fleet Street and the Embankment in the City of London. He was described as walking round wearing:-\n... the costume of the reign of George the Second ...\n[\nwith\n]\nthree-cornered hat, tie, wig, and ruffles.\nHe served as Attorney General for Quebec from\n1766\nuntil\n1769\n[\n3\n]\n:-\n... with such zeal and dignity that on his return to England he was requested by the protestant settlers in that city to act as their agent.\nAfter returning to England he was appointed\nCursitor Baron\nof the Exchequer in August\n1773\nand held this office until his death at the age of\n93\n. He was appointed deputy recorder of London on\n16\nFebruary\n1779\nand he held the post until he resigned in\n1783\n. He was elected senior judge in the Sheriff's Court of the city of London in\n1780\nand he held this position until\n1822\nwhen he was\n91\nyears old. Courtney writes\n[\n3\n]\n:-\nMaseres was a zealous protestant and Whig and a warm advocate for reforms in the church of England, but he was not in favour of a wide scheme of electoral reform.\nMaseres wrote many mathematical works which show a complete lack of creative ability. He rejected negative numbers and that part of algebra which is not arithmetic, despite writing\n150\nyears after\nViète\nand\nHarriot\n. It is probable that Maseres rejected all mathematics which he could not understand. He wrote in\nDissertation on the use of the negative sign in algebra\n(1758)\n:-\nIf any single quantity is marked either with the sign + or the sign - without affecting some other quantity, the mark will have no meaning or significance, thus if it be said that the square of -\n5\n, or the product of -\n5\ninto -\n5\n, is equal to +\n25\n, such an assertion must either signify no more than\n5\ntimes\n5\nis equal to\n25\nwithout any regard for the signs, or it must be mere nonsense or unintelligible jargon.\nMaseres had an unfortunate influence on the teaching of algebra in Britain for several decades. An example of this is seen in the algebra text of\nNicolas Vilant\n, Regius Professor at St Andrews from\n1765\nto\n1807\n. Schaaf, writing in\n[\n1\n]\n, gives a positive side to his mathematical contributions:-\nPerhaps the many publication with which he strove to bring mathematics to a much wider public were the most notable aspect of Maseres' legacy. Some were original works; others were reprints of the works of distinguished mathematicians. ... Of the reprints that Maseres made at his own expense, the most significant is the \"Scriptores logarithmici\"\n(1791\n-\n1807)\n, six volumes devoted to the subject of logarithms, including works of\nKepler\n,\nNapier\n,\nSnell\n, and others, interspersed with original tracts on related subjects. Other republications include the following:\n1\n. \"Scriptores optici\"\n(1823)\n, a reprint of the optical essays of\nJames Gregory\n,\nDescartes\n,\nSchooten\n,\nHuygens\n,\nHalley\nand\nBarrow\n;\n2\n.\nJacob Bernoulli\n's tract on permutations and combinations;\n3\n. Colson's translation of\nAgnesi\n's \"Analytical Institutions\";\n4\n. Hale's latin treatise on fluxions\n(1800)\n; and\n5\n. several tracts on English history.\nPresumably a number of authors were indebted to Maseres for financial assistance of this sort. there can be little doubt of his sincerity and generosity, even if somewhat misplaced.\nCourtney gives more details of Maseres' personality in\n[\n3\n]\n:-\nIt was his delight to entertain his friends in his rooms in London or his country house at Reigate, and his conversation abounded in anecdote and information, particularly in the incidents of English history from\n1640\nto his own date. He kept up his taste for the classics. Homer he knew by heart, and Horace was at his fingers' ends. Lucan was his favourite next to Homer in ancient literature; among English writers he felt great admiration for Milton, and was thoroughly conversant with the works of\nHobbes\n. He spoke French fluently ... and\n[\nhe was\n]\na good chess player ...",
  "matematicos_citados_na_biografia": [
    "wrangler",
    "Viète",
    "Harriot",
    "Nicolas Vilant",
    "Kepler",
    "Napier",
    "Snell",
    "James Gregory",
    "Descartes",
    "Schooten",
    "Huygens",
    "Halley",
    "Barrow",
    "Jacob Bernoulli",
    "Agnesi",
    "Hobbes"
  ],
  "imagens": [
    "maseres.jpg"
  ]
}