{
  "nome_completo": "Frank Stanton Carey",
  "nome_curto": "Frank Carey",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carey/",
  "data_nascimento": "14 June 1860",
  "local_nascimento": "Pill St George, Easton-in-Gordano, Somerset, England",
  "data_morte": "26 July 1928",
  "local_morte": "Liverpool, Lancashire, England",
  "summary": "Frank Carey was Professor of Mathematics in Liverpool for over 37 years. He was important in University College, Liverpool becoming the University of Liverpool. He wrote several excellent undergraduate texts.",
  "biografia": "Frank Carey\nwas born in Pill St George, Easton-in-Gordano. The following description of the village was written only a few years after he was born\n[\n20\n]\n:-\nPill St George, a hamlet and chapelry in the parish of Easton-in-Gordano, Hundred of Portbury, county Somerset,\n5\nmiles N.W. of Bristol. It is situated on the river Avon, and is the pilot station for the port of Bristol. The modern village is built at a short distance from the Roman station Ad Sabrinam, on the Via Julia, or Fosse Way, which passes through the chapelry. There are places of worship for Independents, Baptists, and Wesleyans.\nWe have given Frank Stanton Carey's name as 'Frank Carey' but we note that his name appears on the cover of one of his books as 'F Stanton Carey'.\nHis parents were the coal merchant John Carey\n(1828\n-\n1868)\nand his wife Fanny Windham. We note that there is some confusion caused by more than one Carey family living in Pill St George. For example at the\n1861\nCensus, see\n[\n4\n]\n, John and Fanny Carey are living in Marine Parade, Pill St George with their three children, John M Carey\n(\nage\n5)\n, Jessy G Carey\n(\nage\n3)\nand Frank S Carey, the subject of this biography\n(\nage\n10\nmonths\n)\n. John Carey's age is given as\n33\nwhile his wife Fanny's age is given as\n38\n. We believe that Fanny's age is incorrect, perhaps caused by a copying error, and should be\n35\n. The source of the confusion in some records lies in the fact that living in the next house is Elizabeth Carey\n(\na pilot's wife\n)\nwith two children. We note that 'pilot' will refer to a mariner who assists in navigating ships in difficult waters. John Carey died in\n1868\nand, at the time of the\n1871\nCensus, see\n[\n5\n]\n, Fanny Carey and her three children are living at Belle Vue Crescent, Clifton, Bristol. They are living in the home of the wholesale grocer Frederick G Saunders and his wife Mary. Also living with them is Sarah Windham, Fanny Carey's sister.\nCarey studied at Bristol Grammar School, an independent school with a long tradition having been founded in\n1532\n. The headmaster of Bristol Grammar School when Carey studied there was John William Caldicott\n(1829\n-\n1895)\n. Caldicott had studied both classics and mathematics at the University of Oxford, and was a mathematics lecturer at Jesus College and a tutor there. He was appointed headmaster of Preston Grammar School in Lancashire in\n1854\nand headmaster of Bristol Grammar School in\n1860\n. A former pupil described his influence\n[\n23\n]\n:-\nHe certainly ruled the school with a rod of iron ... but nevertheless his personality was indelibly stamped upon most of us who were pupils under his regime. He was, indeed, a strong man, and in my humble opinion, the methods he adopted, by his ideas of discipline, punctuality and strict attention to duty had a markedly beneficial effect upon the youthful imaginations committed to his charge, this, quite apart from his scholastic attainments which were of a high order.\nCarey performed well at this school and was admitted as a\nsizar\nto Trinity College, Cambridge on\n4\nOctober\n1879\n. He studied the mathematical tripos and his excellent performance saw him made a scholar in\n1881\n. At the time of the\n1881\nCensus, he was living in Dr\nWhewell\n's Buildings, part of Trinity College, in Trinity and Sidney Street, All Saints, Cambridge. In\n1883\nhe was awarded a B.A. and ranked Third\nWrangler\n. The Senior Wrangler that year was\nGeorge Ballard Mathews\nand the Second Wrangler was Edward Gurner Gallop\n(1862\n-\n1936)\nwho was a Fellow of Caius College from\n1889\nuntil his death in\n1936\n. Carey was elected a fellow of Trinity College in\n1884\n.\nIt was as Professor of Mathematics in Liverpool, that Carey spent his whole career after leaving Cambridge\n[\n21\n]\n:-\nIn\n1886\n, Carey was appointed to the chair of mathematics at Liverpool, which had been founded three years earlier, and already occupied by\nA R Forsyth\nand R A Herman. In this chair his life's work was carried out. A born teacher, he was exceptionally able to impart knowledge to the dullest of his pupils, and at the same time to inspire the most brilliant of them. Both types of men continuously sought his advice long after they had left the University, and they were always amply rewarded. He himself never ceased to be an enthusiastic student of pure mathematics, always keeping a youthful outlook and fully appreciating the modern ideas in that subject, vastly different as they are from all that he was taught at Cambridge.\nDuring the years that Carey was Professor of Mathematics in Liverpool, the institution where he held his chair went through several stages to become the University of Liverpool. He had been appointed in\n1886\nto University College Liverpool\n[\n9\n]\n:-\nIn response to a Petition presented on behalf of the citizens of Liverpool, Queen Victoria incorporated by Charter on\n18\nOctober\n1881\na University College which was housed on a site and in buildings acquired and transferred to the College by the Corporation of the City of Liverpool. Generous support was readily given to the College by the people of Merseyside and within three years fourteen Chairs were established. In view of this rapid progress and of its growing prestige as a centre of higher learning, the University College was in\n1884\nadmitted as one of the constituent colleges of the Victoria University which in\n1880\nhad been incorporated by Royal Charter upon the Petition of Owens College, Manchester. ...  In\n1902\nthe University College presented a petition to King Edward VII, supported by a Petition of a committee appointed at a public meeting of the inhabitants of Liverpool applying for the Grant of a Royal Charter as a separate and Independent University. The Royal Charter, granted on\n15\nJuly\n1903\n, incorporated the University of Liverpool with full powers to administer its affairs and confer degrees upon its students. On\n14\nAugust\n1903\nthe Royal Assent was given to an Act of Parliament, entitled the Liverpool University Act\n1903\n, which separated University College, Liverpool from the Victoria University and merged it into the University of Liverpool.\nOn\n4\nAugust\n1894\n, Carey married Jessie Mein\n(1861\n-\n1941)\n. Jessie, the daughter of the grocer and tea dealer Andrew Mein and his wife Jane Parkinson, had been born in Liverpool. Frank and Jessie Carey had four children: Windham Francis Carey\n(1896\n-\n1968)\n; Richard Mein Carey\n(1897\n-\n1983)\n; Gillian Carey\n(1898\n-\n1985)\n; and Audrey Joyce Carey\n(1899\n-\n1958)\n. Let us record some information about these children. Windham Francis Carey, born\n1\nNovember\n1895\n, was educated at Greenbank School, Liverpool, Liverpool College and the University of Liverpool. He was awarded an M.Eng. and then studied electrical engineering and steam turbines at Manchester College of Technology. He had a career as a research engineer. Richard Mein Carey studied mathematics at the University of Cambridge and was awarded a B.A. in\n1922\n. He became a schoolmaster and wrote the book\nA school algebra\nwhich was published in\n1936\n. Gillian Carey married the engineer Frederic Alexander Richmond Paton on\n14\nFebruary\n1928\n. We note that both Gillian's parents were present at the wedding and signed the marriage certificate although Frank Stanton Carey died five months later. Audrey Joyce Carey never married. She became a J.P.\nReturning to look at Frank Stanton Carey's career, we note that he wrote few research papers, but he published a number of books which were important textbooks:\nSolid Geometry\n(1897)\n,\nInfinitesimal Calculus\n(1917)\n,\n(\nwith\nJ Proudman\n)\nThe Elements of Mechanics\n(1925)\n, and\n(\nwith S F Grace\n)\nFour-Place Mathematical Tables with Forced Decimals\n(1927)\n. He writes in the Preface to\nInfinitesimal Calculus\n:-\nBelieving that there is no royal road which leads smoothly and directly to the Infinitesimal Calculus, the author has made no attempt to evade all the difficulties which at the outset face the student in this subject. The road has, however, been laid in the first section so as to pass through those domains of number and function with which the student is  probably already acquainted, while the functions which are likely to be unfamiliar to him have been reserved for the second section. To assist the student in mastering the fundamental conception of a differential coefficient, two ideas which are usually reserved for books of a more advanced character have been introduced at the beginning and used throughout the book, namely, range and sequence, and the ordinary symbolism in connection with them has been varied.\nReviewing this book,\nWilliam P Milne\nwrites\n[\n14\n]\n:-\nThe book is not a mere engineering manual, but is intended mainly for students who desire to obtain a sound academic knowledge of the subject. It gives plenty of practical applications on which the student can exercise himself, and it does not \"hedge\" the fundamental principles of Number, Continuity, etc., on which the modern conception of the Calculus is based; but wherever these abstract motions are introduced, Prof Carey attempts by concrete illustration to vivify and vitalise as far as possible those nebulous entities which in many modern treatises and lectures leave the ordinary student vague and miserable.\nReviewing\nThe Elements of Mechanics\n,\nHarry Bateman\nwrites\n[\n3\n]\n:-\nThis book by a professor emeritus in the University of Liverpool and a young professor who has made notable advances in the study of the tides is a good example of what can be accomplished when the experience of a great teacher is combined with the brilliance of an ardent investigator. The subject is well presented, one good feature being the frequent use of vectors. Many illustrations are given to assist the reader and numerous examples are worked out at the end of the book to help along any student who is reading the subject for the first time. Though the work is quite elementary, room is found for a useful chapter on frameworks and an elementary treatment of hydrostatics is included. We fully agree that instruction on these subjects should be given in a course on mechanics.\nFor more information about Carey's books including a longer extract from the Preface of\nInfinitesimal Calculus\nand extracts from several reviews, see\nTHIS LINK\n.\nJoseph Proudman\n, however, thought his best writing was the chapter on mathematics he wrote for the book edited by Arthur Augustus Tilley,\nModern France. A Companion to French Studies\n(\nCambridge University Press, Cambridge,\n1922)\n[\n21\n]\n:-\nBut of his writings perhaps that which shows him at his best is his chapter on mathematics in the volume on \"Modern France\" published in\n1922\nby the Cambridge University Press. In this there occurs a sentence which reveals an admirable spirit for a university teacher: \"Perhaps the new ways were invisible except to the eyes of youth.\"\nThe contents of Carey's chapter in\nModern France\nare as follows:\nChapter XIV. Mathematics.\nBy F S Carey, M.A., Professor of Mathematics in the University of Liverpool, formerly Fellow of Trinity College, Cambridge.\n§ I. Seventeenth Century.\nDescartes\n,\nDesargues\n,\nFermat\n,\nPascal\n,\nRoberval\n. Astronomy.\nG D Cassini\nand the Paris Observatory. Early histories of mathematics.\n§ II. Eighteenth Century.\nVarignon\n,\nClairaut\n,\nD'Alembert\n,\nLagrange\n,\nLaplace\n,\nLegendre\n,\nMonge\n,\nPoncelet\n.\n§ III. Nineteenth Century.\nFourier\n,\nCauchy\n, Pupils of the École Polytechnique,\nArago\n,\nSadi Carnot\n,\nGalois\n,\nHermite\n,\nDarboux\n,\nPoincaré\n.\nPerhaps Carey's greatest achievement was the long and valuable service he gave to the University of Liverpool for over\n37\nyears. In particular he did outstanding work in seeing University College Liverpool develop into the University of Liverpool.\nProudman\nwrites\n[\n22\n]\n:-\nIn the administration of his University, Carey took a prominent part, and on council, senate, and faculties he always judiciously upheld the claims of science and scholarship. He rendered vital help in the establishment of the Tidal Institute. The library, Teachers' Training College, finance committee, and athletic club all benefited by his active sympathy and sound judgment.\nA number of letters from Frank Stanton Carey to James George Frazer are in the Trinity College Archive. Sir James George Frazer\n(1854\n-\n1941)\nwas a social anthropologist and classical scholar. The letters are dated from\n1905\nto\n1918\nand they give some insight into Carey's life and his friends. Those written during the years of World War I give particular insight into his feelings at that time. We give a brief summary of some of these letters at\nTHIS LINK\n.\nHis contributions were recognised on his retirement\n[\n10\n]\n:-\nOn his retirement the title of emeritus professor was conferred on him by the Senate, and a sum of £\n240\nwas subscribed by friends, colleagues and past students for the foundation of the Carey prize in mathematics, to commemorate his long and distinguished work for the university.\nFollowing his death in July\n1928\nProbate was on\n30\nOctober:-\nCarey, Frank Stanton, of Laregan, France Lynch, Gloucestershire died\n26\nJuly\n1928\nat\n1\nGambier Terrace, Liverpool. Probate Liverpool\n30\nOctober to Jessie Carey widow and Richard Mein Carey schoolmaster.",
  "matematicos_citados_na_biografia": [
    "sizar",
    "Whewell",
    "Wrangler",
    "George Ballard Mathews",
    "A R Forsyth",
    "J Proudman",
    "William P Milne",
    "Harry Bateman",
    "THIS LINK",
    "Joseph Proudman",
    "Descartes",
    "Desargues",
    "Fermat",
    "Pascal",
    "Roberval",
    "G D Cassini",
    "Varignon",
    "Clairaut",
    "D'Alembert",
    "Lagrange",
    "Laplace",
    "Legendre",
    "Monge",
    "Poncelet",
    "Fourier",
    "Cauchy",
    "Arago",
    "Sadi Carnot",
    "Galois",
    "Hermite",
    "Darboux",
    "Poincaré",
    "Proudman"
  ],
  "imagens": [
    "carey.jpg"
  ]
}