{
  "nome_completo": "Francesco Cecioni",
  "nome_curto": "Francesco Cecioni",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cecioni/",
  "data_nascimento": "1 December 1884",
  "local_nascimento": "Livorno, Italy",
  "data_morte": "30 September 1968",
  "local_morte": "Livorno, Italy",
  "summary": "Francesco Cecioni was an Italian mathematician who specialised in algebra.",
  "biografia": "Francesco Cecioni\n's parents were Olderigo Cecioni, a shoemaker, and Isolina Cantinelli. There were two children in the family, Francesco\n(\nthe subject of this biography\n)\nand his brother Giovanni. The family, who probably originated in Florence, were poor. Francesco's mother died when he was young which meant that the children had an even harder upbringing. Francesco received a classical humanist education attending the Liceo Classico in Livorno despite his father wanting him to leave school and take up a job in the Municipality of Livorno.\nCecioni won a place to study at the Scuola Normale Superiore in Pisa where he came under the influence of\nLuigi Bianchi\n. From\nBianchi\nhe not only learnt much about mathematical research but he also learnt teaching skills that he would continue to develop for the rest of his career. He graduated from the Scuola Normale Superiore in Pisa with his laurea on\n15\nDecember\n1905\n. His thesis\nTeoria della rappresentazione conforme delle aree piane pluriconnesse\nⓉ\n(\nTheory of the conformal representation of multi-connected surfaces\n)\n(1905)\nbecame the basis for his first publication,\nSulla rappresentazione conforme delle aree piane pluriconnesse su un piano in cui siano eseguiti dei tagli paralleli\nⓉ\n(\nOn the the conformal representation of multi-connected surfaces on a plane in which parallel cuts are performed\n)\n(1908)\n.\nFor a list of many of Cecioni's publications, see\nTHIS LINK\n.\nAfter graduating, in\n1907\nCecioni was employed as an assistant in algebra and analytical geometry at the University of Pisa. He returned to his home town in\n1910\nand, in that year, he began teaching at the Istituto Nautico in Livorno. His career was interrupted by World War I which Italy entered in May\n1915\n. Italy had remained neutral when war broke out in August\n1914\nand began to negotiate with both sides to see which would offer the most for their support. Eventually in April\n1915\n, at the Treaty of London, Italy joined France, Britain and Russia and one month later began military advances towards Austria-Hungary. Cecioni became an infantry officer and for most of the war he fought on the Austrian front taking part in the fierce fighting which took place.\nAfter World War I ended in\n1918\n, Cecioni was able to return to his position at the Istituto Nautico in Livorno. He had published six papers before the outbreak of war and, not surprisingly, had published nothing during the war years. His first paper to appear after he began teaching again after the war was\nSopra una relazione fra certe forme differenziali quadratiche e le algebre commutative\nⓉ\n(\nOn a relationship between certain quadratic differential forms and commutative algebras\n)\n(1921)\n. Cecioni did not continued teaching at the Istituto Nautico for long since he became Professor of Mathematics at the Naval Academy of Livorno. In\n1925\nhe entered the competition for the chair of Algebraic and Infinitesimal Mathematical Analysis at the University of Pisa. He was declared the winner of the competition and took up the chair in Pisa in\n1926\n. There he became a colleague of\nLuigi Bianchi\n,\nEugenio Bertini\nand\nOnorato Nicoletti\n.\nOnorato Nicoletti\nwas an expert in the theory of Hermitian forms who had taken over\nUlisse Dini\n's courses on infinitesimal calculus after\nDini\n's death in\n1918\n. Cecioni did not give up his position at the Naval Academy when appointed to the chair at the University but continued to hold both positions until\n1942\nwhen he left his role at the Academy.\nLandolino Giuliano writes in\n[\n3\n]\n:-\nMany classes of students still remember the Maestro with moving gratitude for the admirable didactic efficacy of his lectures, which were a model of clarity, in which the most hidden concepts and the most abstruse subjects were examined in depth and presented by him with a simplicity and elegance that captivated and thrilled. But they remember him, with affectionate admiration, also for the luminous example of scrupulous dedication to duty and of the profound spirit of sacrifice that he gave them for over fifty years. A master of life, nobody failed to take his precious advice; he helped everyone with detached disinterest; he was paternal and understanding, simple, patient, humble, generously charitable, particularly with the young. Shy from the clamour, he lived, secluded, in evangelical simplicity. He was of exceptional modesty; he always put others before himself and never took pride in his successes. He was silent on the faults of others; instead he exalted their merits and virtues. Absolutely alien to all forms of envy and acrimony; he always rejoiced in the scientific merits of his colleagues and his students. He never solicited the acknowledgments, which he deserved, as a teacher, as a scientist or as a man.\nThe next few paragraphs discuss Cecioni's mathematical contributions as given in\n[\n4\n]\n, following Andrea Mariani's translation\n[\n2\n]\n.\nHis works, from those of his youth on conformal mappings to his last great work, of which he had just completed the first volume, on the foundations of mathematics, represent a major contribution from the critical point of view, and one that is characterised by a profound scientific and moral rigour. They can be grouped thus: memoirs on conformal mappings and on real algebraic curves\n(1908\n-\n1935)\n; memoirs on the theory of matrices\n(1908\n-\n1930)\n; memoirs on some algebraic theories\n(1921\n-\n1924)\n; lecture courses on mathematical analysis and the foundations of geometry.\nHis first papers appeared in the\nAnnali di matematica pura ed applicata\nⓉ\n(\nAnnals of pure and applied mathematics\n)\n. In\n1936\nhe published, in Pavia, in the\nScritti matematici offerti a L Berzolari\nⓉ\n(\nMathematical writings sent to L Berzolari\n)\n(\npages\n487\n-\n509)\n, the note\nSu alcune diseguaglianze fra sistemi di moduli trascendenti di curve algebraiche presentanti il caso di Harnack\nⓉ\n(\nOn some inequalities between systems of transcendental modules of algebraic curves presenting the case of Harnack\n)\n.\nWorthy of particular mention for its power of synthesis is his laurea thesis:\nSopra alcune operazioni algebraiche sulle matrici\nⓉ\n(\nAbove some algebraic operations on matrices\n[\nOn some algebraic operations with matrices\n]\n)\n(\npublished in\nAnnali della R. Scuola Normale di Pisa\nⓉ\n(\nAnnals of the Royal Normal School of Pisa\n)\n, XI\n(1909)\n,\n140\npages\n)\n, which was also mentioned in\n1958\nwhen he was awarded the gold medal. Already in the introduction one can note a certain rigour which is not common in the presentation of the material, but that nevertheless does not inhibit clarity and accessibility. Getting inspiration from the important notion of the product of matrices, after recalling the concept of a conjugate transpose matrix, with frequent citations to\nFrobenius\n, he translates the theorems of matrix theory to concepts and theorems in the theory of linear substitutions and of bilinear forms.\nCecioni then moves on to recall the definition of the \"row-column\" product, its algebraic properties, the concept of permutable matrices, that of the exponent of a square matrix\nM\nM\nM\n, the notions of diagonal and unit matrices, the notion of matrix sum and difference, of a zero matrix and, in particular, of a linear function of a matrix\n(\nvariable\n)\nX\nX\nX\n. He then cites\nLeopold Kronecker\nto recall the definition of a reciprocal matrix and quotient. He then defines what is to be understood as a rational integer function of matrices and recalls that these particular functions cannot be reduced to the same form as their analogues for numbers since the commutative property of matrix products does not hold in general. With regard to the more general linear equations with a matrix unknown, the author recalls the works of\nJames Joseph Sylvester\n. In these works, a method according to which it is possible to rationally determine the solution of any linear equation in an unknown matrix, in the case where this equation has only one solution, is described. But this method leads to extremely lengthy calculations. In the first and second chapters of his work, Cecioni discusses some particular linear equations between matrices, but he does this more generally by discussing the conditions of solubility and all of the possible solutions. In the first chapter he also touches upon those equations in which the unknown matrix is multiplied by the known matrix always on one side; moreover, he determines, as an example, the conditions of solubility of\na\nx\nb\n=\nc\naxb = c\na\nx\nb\n=\nc\n. In the second chapter he considers, among other things the particularly remarkable equation\na\nx\n=\nx\nb\nax = xb\na\nx\n=\nx\nb\n. Lastly, in the third chapter he talks about the simplest equation of higher degree, that is\nx\nm\n=\na\nx^{m} = a\nx\nm\n=\na\n, and tackles the problem of determining the\nm\nm\nm\nth\nroot of a matrix and then that of a linear substitution.\nCecioni's contribution to the didactics of elementary mathematics, as well as to the detailed study of that same elementary mathematics and of its foundations, is also remarkable. Concerning this, we recall the following works:\nCorso di matematiche complementary\nⓉ\n(\nCourse of complementary mathematics\n)\n, Pisa\n1939\n;\nAritmetica pratica per la I e II classe della scuola media\nⓉ\n(\nPractical arithmetic for\n1\nst and\n2\nnd class secondary school\n)\n, Rome\n1941\n;\nNozione di algebra per la III classe della scuola media\nⓉ\n(\nNotions of algebra for the\n3\nrd year of secondary school\n)\n, Rome\n1942\n;\nPrincipî di geometria\nⓉ\n(\nPrinciples of geometry\n)\n, hand-outs for the academic year\n1947\n-\n48\nof the University of Pisa;\nLezioni sui fondamenti della matematica, premesse e questioni generali\nⓉ\n(\nLessons on the foundations of mathematics, premises and general questions\n)\n, Padova\n1958\n. There is also another work to recall that appeared in the\nAnnali di matematica pura ed applicata\nⓉ\n(\nAnnals of pure and applied mathematics\n)\n(\nXLVIII\n(1959)\n, pages\n341\n-\n351\nand LI\n(1960)\n, pages\n10\n-\n38)\n, with the title:\nQualche osservazione sulle antinomie ed in particolare su quella di Burali-Forti\nⓉ\n(\nSome observations on antinomies and in particular on those of Burali-Forti\n)\n. On the theory of divisibility, Cecioni wrote the article\nAlcune osservazioni sulla teoria della divisibilità\nⓉ\n(\nSome observations on the theory of divisibility\n)\n(\npublished in\nBoll. Dell'Unione matem. Ital.\nⓉ\n(\nBulletin of the  Italian Mathematical Union\n)\n, historical-didactics section, X\n(1955)\n,\n3\n, pages\n382\n-\n400)\n.\nPaolo Bussotti and Matteo Casarosa examine one of Cecioni's last works in\n[\n1\n]\n. This is a fascinating article and we present here their abstract:-\nIn this contribution, we explain and comment on the main ideas developed by Francesco Cecioni in his work 'Lezioni sui fondamenti della matematica'\nⓉ\n(\nLessons on the foundations of mathematics, premises and general questions\n)\n, published in\n1958\n. This text includes a conspicuous part of Cecioni's lectures in Complementary Mathematics, he addressed to the students of Pisa University. We are convinced this volume has not yet received the attention it deserves. For, some interesting conceptions on mathematics foundations are here expounded. We have selected the ones we consider the most relevant. Therefore, we have explained Cecioni's general view of mathematics relying upon:\n1\n.  an analysis of Cecioni's conception of arithmetic;\n2\n.  his interpretation of\nZermelo\n's axiom of choice. In this context, his criticisms of\nZermelo\n's proposition are rather remarkable;\n3\n.  the comparison developed by Cecioni between logical implication and causality;\n4\n.  his ideas as to the relations between mathematics and symbolic logic.\nWe are sure the reader will find stimulating and original points of views in Cecioni's conceptions, although, perhaps, he will not agree with the whole of Cecioni's view.\nLet us return to Cecioni's career. He held his professorship at Pisa from\n1926\nuntil\n1955\n. During these years he was for a long time President of the Faculty of Science and Director of the Mathematical Institute \"\nLeonida Tonelli\n\". In addition to his teaching he added the role of public administrator when, in\n1946\n, he was elected to the Livorno Community Council as a member of the Democrazia Cristiana party. He was particularly motivated to see Livorno recover from the damage inflicted during the war years with restoration work. He continued to serve Livorno in this capacity until\n1954\n. The above quote gives details of the contents of\n[\n1\n]\nconcerning Cecioni's book\nLezioni sui fondamenti della matematica\nⓉ\n(\nLessons on the foundations of mathematics\n)\npublished in\n1958\n. In fact this was the first volume of a major work which Cecioni was not able to complete due to deteriorating health and his death in\n1968\n.\nHe received many honours for his contributions including being made Cavaliere della Corona d'Italia, being made Commendatore dell'Ordine di San Silvestro and given the title of the Ordine del Cherubino. Let us end this biography with the final words of Landolino Giuliano's tribute to Cecioni\n[\n3\n]\n:-\nToday there is only one way to remember such a master: the memory of the luminous example of a life lived in an exemplary way: I remember him as one of those fortunate enough to know him and be close to him and for me he will always remain active, alive, current, and imperishable.",
  "matematicos_citados_na_biografia": [
    "Luigi Bianchi",
    "Bianchi",
    "THIS LINK",
    "Eugenio Bertini",
    "Onorato Nicoletti",
    "Ulisse Dini",
    "Dini",
    "Frobenius",
    "Leopold Kronecker",
    "James Joseph Sylvester",
    "Zermelo",
    "Leonida Tonelli"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}