{
  "nome_completo": "Francesco da Paola Virgilio Secondo Maria Faà di Bruno",
  "nome_curto": "Francesco Faà di Bruno",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faa_di_Bruno/",
  "data_nascimento": "29 March 1825",
  "local_nascimento": "Alessandria, Piemonte (now Italy)",
  "data_morte": "27 March 1888",
  "local_morte": "Turin, Italy",
  "summary": "Faa di Bruno is best known for his formula for the n th derivative of a composition of functions. He was beatified in 1988",
  "biografia": "Francesco Faà di Bruno\n's parents were Carolina Sappa and Luigi Faà di Bruno. Francesco was the youngest of his parents' twelve children and he had seven sisters and four brothers. His father was a wealthy landowner with several titles such as Marquis of Bruno, Count of Carentino, Lord of Fontanile, and Patrizio of Alessandria. The village of Bruno is about\n18\nkm south west of Alessandria, a major city roughly equidistant from Turin, Milan and Genoa. Francesco's mother, Carolina, was from a noble family from Milan. Patrizia Solari writes\n[\n11\n]\nthat Luigi and Carolina had:-\n... a happy marriage, one of the most wealthy of the Piedmontese nobility and most generous to the needy people.\nAlthough he is always known as Francesco, the full name of the subject of this biography was Francesco da Paola Virgilio Secondo Maria Faà di Bruno. One of Francesco's brothers, Giuseppe Maria Faà di Bruno, built the church of St Peter in Hatton Garden, London, the most important church for Italian immigrants. He was a leader of the Pious Society of Missions and wrote \"Catholic Belief\", an exposition of Catholic doctrine aimed at non-Catholics. Over one million copies of this book were sold. Another of Francesco's brothers, Emilio, served in the army and was killed in the Battle of Lissa in\n1866\n. Two of Francesco's sisters became nuns.\nWhen Francesco was nine years old, his mother died. His early education had been at home and he began his school career in\n1836\nwhen he entered the college of the Novi Ligure dei Padri Somaschi. After studying for four years at the Novi Ligure he entered the Royal Military Academy of Turin in\n1840\nwith the aim of making a career in the army. It was a six-year course and after graduating in\n1846\nhe was commissioned as a lieutenant in the army. The advanced courses he took included topography and foreign languages. The revolutions which broke out across Europe in\n1848\nled to the First Italian War of Independence in which Faà di Bruno participated in the Piedmontese Brigata Guardie commanded by Vittorio Emanuele. For six weeks the Brigata Guardie attacked the Austrians at Peschiera del Garda and were victorious on\n30\nMay\n1848\n. After this military campaign there was an uneasy truce was lasted around seven months. Faà di Bruno's main task during these months was to draw up maps and he produced his major map of the Mincio area. He undertook his duties with great enthusiasm, realising that the generals commanding the Piedmontese armies did not have recent accurate maps of the Lombardo-Veneto region. In\n1849\nhe was promoted to captain and shortly after this, in March\n1849\n, the Austrians broke the truce and the resulting battle between the Austrian and Piedmontese armies at Novara on\n22\nMarch was a humiliating defeat for the Piedmontese. Faà di Bruno's horse was killed by Austrian rifle fire, so he mounted another horse only to have that killed too. He was wounded in the leg and seeing many of his comrades killed, he realised that an army career was not for him.\nCharles Albert, the King of Sardinia, resigned following the defeat at Novara and his son Vittorio Emanuele became King of Sardinia. He had two young sons and, realising Faà di Bruno was both an extraordinary person and an exceptional scholar, he asked him to tutor his two young sons. However, Faà di Bruno was known as a devout Catholic and the King immediately came under pressure to appoint a secular tutor for his sons. Vittorio Emanuele decided that, for political reasons, he had to withdraw his offer to Faà di Bruno which he did. Then Faà di Bruno asked permission to leave the army and take up the study of mathematics. He travelled to Paris in\n1850\nwhere he studied at the Sorbonne under\nAugustin-Louis Cauchy\nwho\n[\n2\n]\n:-\n... he admired, not only for his genius, but also for his religious fervour and his philanthropy.\nAt the Sorbonne Faà di Bruno was in the same classes as\nCharles Hermite\nand the two became close friends. However, his time in Paris was not all spent on academic studies for he also assisted in the parish of Saint Sulpice and visited the homes of the poor. He greatly enjoyed visiting the bookshops of Paris and shops where scientific instruments were sold. While in Paris he began publishing mathematical papers:\nNote sur un nouveau procédé pour reconnaître immédiatment, dans certains cas, l'existence de racines imaginaires dans une équation numérique\nⓉ\n(\nNote on a new method for recognizing immediately, in some cases, the existence of imaginary roots in a numerical equation.\n)\n(1850)\n;\nDémonstration d'un théorème de M Sylvester, relatif à la décomposition d'un produit de deux déterminants\nⓉ\n(\nDemonstration of Sylvester's theorem on the decomposition of a product of two determinants\n)\n(1851)\n; and\nDémonstration d'un théorème relatif à la réduction des fonctions homogènes à deux lettres à leur forme canonique\nⓉ\n(\nDemonstration of a theorem on the reduction of homogeneous functions in two letters to their canonical form\n)\n(1852)\n. After graduating from Paris with his Licence in Science in\n1851\n, he returned to Turin but this was a difficult time for anyone who was a devout Catholic\n[\n3\n]\n:-\nAmong the greatest tragedies of his life, there will always be the contrast between his aspirations, as a sincere patriot desiring Italian unity, but rejection, as a Catholic loyal to the pope, of the methods and unacceptable manner in which that unity was pursued with persecution and oppression of the Church.\nThe Church of San Massimo, in Borgo Nuovo, was completed in June\n1853\nand, in the following year, Faà di Bruno set up a choral school for women in the church where they were trained every Sunday by Faà di Bruno who played the organ. He now published papers in Italian such as\nSullo stabilimento di un osservatorio magnetico e meteorologico in Torino\nⓉ\n(\nOn the establishment of a magnetic and meteorological observatory in Turin\n)\n(1853)\n, and\nTheorema di geometria\nⓉ\n(\nTheorems in geometry\n)\n(1853)\n, and also continued to publish in French, for example\nNote sur un théorème de M Brioschi\nⓉ\n(\nNote on a theorem of Brioschi\n)\n(1854)\n. In May\n1855\nFaà di Bruno returned to Paris to undergo further training at the astronomical observatory at Brera. The authorities in Turin promised him that, after he returned from Paris, he would be employed at the Observatory in Turin - a promise they did not keep. However, in Paris Faà di Bruno studied astronomy under\nUrbain Le Verrier\nand also undertook research with\nCauchy\non mathematics. He graduated in\n1856\nhaving presented two theses, one in mathematics\nThéorie générale de l'élimination\nⓉ\n(\nGeneral theory of elimination\n)\non elimination theory, and the other in astronomy on celestial mechanics. While in Paris he had also invented a mechanical device to allow blind people to write. He had personal reasons to invent such an apparatus, for his sister Maria Luigia was becoming blind.\nHe continued to publish papers in both French and in Italian:\nSullo sviluppo delle Funzioni\nⓉ\n(\nOn the development of functions\n)\n(1855)\n,\nSulle Funzioni Isobariche\nⓉ\n(\nOn isobaric functions\n)\n(1856)\nand\nNote sur une nouvelle formule de calcul différentiel\nⓉ\n(\nNote on a new calculus formula\n)\n(1857)\nwere all written while he was undertaking research in Paris. Both the first and the third of these papers contain the result for which he is best known, namely Faà di Bruno's formula. This formula gives the\nn\nn\nn\nth derivative of the composition of two functions\nf\n(\ng\n(\nx\n)\n)\nf (g(x))\nf\n(\ng\n(\nx\n)\n)\n. Warren Johnson writes\n[\n7\n]\n:-\nOnce Faà di Bruno's formula was considered a real analysis result: it is in the 'Cours d'Analyse' of\nGoursat\nand of\nde la Vallée Poussin\n. Riordan and Comtet saw it as part of combinatorial analysis, a term that seems to be going out of fashion; the subject subsumed in algebraic combinatorics, the books of Riordan and Comtet largely superseded by Stanley's monumental 'Enumerative combinatorics'\n(1997\n,\n1999)\nwhere Faà di Bruno's formula is mentioned, but not stated. It can also be found in books on partitions\n[\nGeorge E Andrews\n, 'The theory of partitions'\n(1976)]\n, mathematical statistics, matrix theory, calculus of finite differences, computer science\n[\nDonald E Knuth\n, 'The Art of Computer Programming'\n(1968)]\n, symmetric functions, and miscellaneous mathematical techniques.\nSeveral authors have pointed out that Faà di Bruno was not the first to either state or prove this result. The papers\n[\n4\n]\nand\n[\n7\n]\ngive fascinating accounts of earlier work. However, Faà di Bruno did give a form of the formula using determinants which nobody had found earlier. After his time in Paris, he was appointed as a lecturer in higher analysis at the University of Turin, and he also gave popular astronomy courses. In\n1859\nhe published an important book in French,\nThéorie générale de l'élimination\nⓉ\n(\nThe general theory of elimination\n)\n. By this stage in his career he had\n20\nworks published. From\n1859\nAngelo Genocchi\nheld the Chair of Algebra and Complementary Geometry at Turin, then in the following year he moved to the Chair of Higher Analysis and Faà di Bruno was appointed as his deputy. He obtained his doctorate, essentially a D.Sc., in\n1861\n.\nAfter his time studying in the Sorbonne, Faà di Bruno did much charity work on his return to Turin. He had seen food being prepared and distributed to the poor while in Paris and, back in Turin, he began to organise a similar scheme during the winter months. At this time Faà di Bruno came in contact with Giovanni Bosco.  Bosco had been ordained a Roman Catholic priest in\n1841\nin Turin and began to work there to help boys who came to look for work in the city. Bosco provided boys with education, religious instruction, and recreation. Eventually he headed a large establishment containing a grammar school, a technical school, and a church, all built through his efforts. In Turin Bosco and others founded the Society of St Francis de Sales in\n1859\n. Faà di Bruno, following Bosco's example, founded the Pia opera di Santa Zita in the San Donato area of Turin on\n2\nFebruary\n1859\n. He used his own money together with funds he had collected standing at the doors of churches. He chose the site because this was an area of Turin which was inhabited by the poorest people. Also in\n1859\nFaà di Bruno founded the Opera per la santificazione delle feste, a Society to promote Sunday observance and to protect workers who were being forced to work on Sundays. He was president of the Society and Bosco accepted the role of vice-president.\nFaà di Bruno was incredibly energetic in his work with the poor. In\n1860\nhe founded the Infermeria di San Giuseppe, an infirmary for poor women and the sick where people had an opportunity to convalesce after an illness. In\n1862\nhe founded a boarding-house for the elderly and disabled women. In fact one has to realise that there was much illness in Turin at this time. Frequent epidemics, especially of typhus and cholera, were the result of poor hygiene and Faà di Bruno was able to set up wash rooms in the San Donato area. But his charity work was not restricted to caring for the sick, for he was also passionate about providing educational opportunities for the young people from poor families. He organised a mobile library in\n1863\nwhich provided books on many topics, particularly religion and science. In\n1864\nhe set up classes providing training in home economics and, in\n1866\n, he organised courses to train people to become elementary school teachers.\nWe mentioned above that Emilio Faà di Bruno, one of Francesco's brothers, served in the army and was killed in the Battle of Lissa in\n1866\n. Francesco began the building of the church of Nostra Signora del Suffragio in\n1866\n, following the death of his brother. Building the church took around three years and much of the architectural design was due to Faà di Bruno himself. His experience as a soldier, and his brother's death, had greatly affected him and he held daily prayers in the church of Nostra Signora del Suffragio for the souls of all soldiers killed in wars. Despite the many long hours he spent undertaking charity work, Faà di Bruno did not ignore his mathematical research. He continued to publish articles and gained international fame as a mathematician. This fame, however, did not lead to rapid promotion within the University of Turin. The reason for this was the secular nature of the Italian Independence movement with discrimination against those active in the Church. In\n1871\nhe was put in charge of teaching calculus and analytic geometry and he was appointed as an extraordinary professor of higher analysis in\n1876\n. His colleagues thought very highly of him and seven times they put him forward for a chair. Although he is usually remembered today because of \"Faà di Bruno's formula\", his most influential mathematical work was his book\nThéorie des formes binaires\nⓉ\n(\nTheory of binary forms\n)\non binary forms which he published in\n1876\n. The book was based on lectures that Faà di Bruno had given at the University of Turin. The book became better known in\n1881\nwhen\nMax Noether\npublished a German edition.\nPaul Gordan\nwrote to Faà di Bruno from Erlangen on\n29\nSeptember\n1875\nand his letter is reproduced, both in the original German and in a French translation, in the Preface to\nThéorie des formes binaires\nⓉ\n(\nTheory of binary forms\n)\n:-\nI have had the opportunity to read your book on binary forms, and I was happy because I found it well adapted to introduce the reader to the theory of invariants. The subject is thoroughly and brilliantly set out, the exposition is simple, clear and, in several places, elegant. ... You have with this work delivered a service to science for which it will be grateful, since you have filled an important gap.\nNot only did Faà di Bruno have difficulties in obtaining promotion within the university, but he also had difficulty in becoming ordained. Although he had undertaken the necessary training, his archbishop was opposed to ordaining men later in their lives. Faà di Bruno had to make a special plea to pope Pius IX to overrule the archbishop before he was ordained a Roman Catholic priest in Rome on\n22\nOctober\n1876\n. The religious order he had founded, the Suore Minime di Nostra Signora del Suffragio, supported girls in a house called the Conservatorio del Suffragio. In order to provide work for the girls, Faà di Bruno had the idea that they could train as typesetters. He purchased a printing press and set up the Tipographia Suffragio. There a number of mathematics books were published including one by Faà di Bruno himself on\nelliptic functions\n. In\n1898\n, ten years after Faà di Bruno's death, the printing press was purchased by\nGiuseppe Peano\nfor\n407\nlire and he printed the\nRivista di Matematica\nⓉ\n(\nJournal of mathematics\n)\non it for several years.\nIn\n[\n2\n]\nFaà di Bruno is described as follows:-\nFaà di Bruno was tall and not always well dressed, but he was simple and good natured. He was of a solitary disposition and spoke seldom\n(\nand not always successfully in the classroom\n)\n. He cultivated music and was said to be a good pianist.\nIn fact, to give a little more information on his musical talents, he composed scared melodies which were highly thought of by Franz Liszt. We have mentioned above his interest in scientific instruments, but let us add that he invented, among other things, a differential barometer, described in a publication of\n1870\n, and an electric alarm clock. He set up a Foucault pendulum in his church, the Chiesa del Suffragio, to demonstrate the rotation of the earth.\nHe died suddenly, two days short of his\n63\nrd\nbirthday, from an intestinal infection. Bosco, who had been an inspiration to Faà di Bruno and had died less than two months before him, was made a Saint on\n1\nApril\n1934\n. Already by this time there was a movement to canonise Faà di Bruno and in\n1955\nthe Sacred Congregation of Rites officially accepted the claim for Faà di Bruno to be canonised. Faà di Bruno was beatified by pope John Paul II in St Peter's Square in Rome on\n25\nSeptember\n1988\n.",
  "matematicos_citados_na_biografia": [
    "Augustin-Louis Cauchy",
    "Charles Hermite",
    "Urbain Le Verrier",
    "Cauchy",
    "Goursat",
    "de la Vallée Poussin",
    "George E Andrews",
    "Donald E Knuth",
    "Angelo Genocchi",
    "Max Noether",
    "Paul Gordan",
    "elliptic functions",
    "Giuseppe Peano"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}