{
  "nome_completo": "Frederick Valentine Atkinson",
  "nome_curto": "Frederick Atkinson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Atkinson/",
  "data_nascimento": "25 January 1916",
  "local_nascimento": "Pinner, Middlesex, England",
  "data_morte": "13 November 2002",
  "local_morte": "Toronto, Canada",
  "summary": "Frederick Atkinson was an English mathematician who worked in functional analysis and spent most of his career in Nigeria, Australia and Canada.",
  "biografia": "Frederick Atkinson\nwas known as Derick from the time he was young. His father was George Arthur Atkinson, a journalist and film critic on the Daily Telegraph, and his mother was Dorothy Boxer. Dorothy was George Atkinson's second wife and they had two children with Derick having a sister Anne four years his junior. Derick entered Reddiford School in Pinner in\n1922\n, then later he attended Alleyn's School. His parents moved to Dulwick and, in\n1929\nDerick was attending Dulwich College Preparatory School. At this time his ability in mathematics became evident and he topped his class in geometry, algebra, and arithmetic. His parents, however, did not see their son as a future mathematician, rather his father wanted him to enter the diplomatic service while his mother hoped that her son would enter the Church.\nIn the summer of\n1929\nAtkinson was accepted into St Paul's School in West Kensington. It was a famous school with an outstanding reputation and Atkinson flourished as a mathematician there. He received the highest praise for his mathematical achievements and the only note of criticism was the fear that he would concentrate too much on mathematics. He was elected to a Senior Foundation Scholarship in\n1932\nand, after sitting the Mathematical Scholarship Examinations at Queen's College, Oxford, in\n1933\nhe was awarded an open scholarship and matriculated at the College in\n1934\n. During his undergraduate years he shared a room for part of the time with J L B Cooper. The two became life-long friends. Atkinson graduated B.A. with First Class Honours in Mathematics in\n1937\n. He continued to study at Oxford working on his doctoral thesis advised by\nTitchmarsh\n. He submitted his thesis\nMean Value Theorems for the Riemann Zeta Function\nin\n1939\nand, after being examined by Hardy, Littlewood and Titchmarsh, he was awarded his doctorate. He was then appointed to a Junior Research Fellow position at Magdelen College.\nWorld War II broke out around the time that Atkinson took up his fellowship. He resigned the fellowship in October\n1940\nso that he might undertake war work with the Intelligence Corps. Atkinson was interested in languages and spoke Urdu, German, Hungarian and Russian. He also was proficient in Latin and Ancient Greek, and had some knowledge of French, Italian, and Spanish. He began visiting Ladislav and Agnes Haas, whose first language was Hungarian and had recently arrived from Czechoslovakia, in order to practise speaking Hungarian and Russian with them. Ladislav and Agnes had two daughters and, after a couple of years, Atkinson proposed to Dusja Haas. They were married in\n1943\nand had three children, Stephen, Vivienne and Leslie. Rooney writes in\n[\n3\n]\n:-\nOne of Dusja's favourite stories is that Derick proposed to her in Hungarian, their only common language, and her reaction was: He doesn't know what he is saying!\nAtkinson was in the Intelligence Corps from\n1940\nto\n1946\n. Part of this time he spent at Bletchley Park involved in code breaking, but for around three years he was in India breaking Japanese codes. After his war service came to an end he returned to Oxford where he taught for two years as a lecturer in Christ Church. In\n1948\n, shortly after he was reappointed for a further two years at Oxford, he was offered the chair of mathematics at University College, Ibadan, Nigeria. Atkinson resigned his Oxford post and accepted the professorship in Ibadan. His letter of appointment states\n[\n1\n]\n:-\nYour duties will initially be to develop your department as a centre of teaching and research.\nAtkinson held the chair at Ibadan for seven years before moving to Australia in\n1956\nto Canberra College. Four years later he moved to Canada to take up a professorship at the University of Toronto. He held this position from\n1960\nuntil he retired in\n1981\n. For the final six years of this period he was Chairman of the Department of Mathematics.\nWe noted above that Atkinson's doctoral dissertation was on the\nRiemann zeta function\n. In fact much of his early research followed on from this beginning with papers such as\nA summation formula for p\n(\nn\n)\n, the partition function\n(1939)\n,\nThe mean value of the zeta-function on the critical line\n(1941)\n,\nA divisor problem\n(1941)\n,\nThe Abel summation of certain Dirichlet series\n(1948)\n,\nA mean value property of the Riemann zeta-function\n(1948)\n,\nThe mean-values of arithmetical functions\n(1949)\n, and\nThe mean-value of the Riemann zeta function\n(1949)\n. The most important of these early results was probably the last of these papers in which he found the second term in the asymptotic expansion of the mean square average of the zeta function on the critical line. A new phase of his work began when he began to study eigenfunction expansions both for difference equations and differential equations. He published the important book\nDiscrete and continuous boundary problems\nin\n1964\n. He wrote in the Preface:-\nThe essential unity of our subject has not always been apparent; the wealth of its applications and interpretations are perhaps responsible for this. ... We shall pursue our task from three directions. We shall present the theory of certain recurrence relations in the spirit of the theory of boundary problems for differential equations. Second, we shall present the theory of boundary problems for certain ordinary differential equations, emphasizing cases in which the coefficients may be discontinuous, or may have singularities of delta function type. Finally, we give some account of theories which unify the topics of differential and difference equations, relying mainly on the method of replacement by integral equations.\nIn\n1972\nhe published another important book\nMultiparameter eigenvalue problems\n. Patrick J Browne gives high praise to the work which, he writes, is:-\n... an invaluable and indispensable introduction to the subject. The author's tidy but none-the-less flowing style is complemented by sound and clear exposition throughout.\nRooney\n[\n3\n]\ndescribes Atkinson's personality:-\nIn personality, Derick seemed a very quiet man, but a little probing revealed immense depth, perspicacity and ability.\nHe also describes his hobbies:-\nDerick's main hobby was music, for he was a fine pianist and a near professional quality player of the piano accordion. Indeed, while in Nigeria, Derick organized and played in a dance orchestra at faculty dances. Another enjoyment for him was giving parties, ably complemented by Dusja, who is a masterly cook. ... Other interests included gardening and carpentry; when Derick began to run out of space for books in his house, he lined the basement with bookshelves constructed by himself.\nAtkinson received many honours for his contributions including election to fellowship in the\nRoyal Society of Canada\n(1967)\n, election to fellowship in the\nRoyal Society of Edinburgh\n(1975)\n, and the McDougall- Brisbane Prize of the\nRoyal Society of Edinburgh\nfor\n1974\n-\n76\nfor his paper\nLimit-n criteria of integral type\n(1974)\n. He served as nineteenth president of the\nCanadian Mathematical Society\nduring\n1989\n-\n91\n. He also received the Humboldt Prize of the German Government in\n1992\n.\nIn August\n1992\n, after returning from Europe where he was presented with the Humboldt Prize, Atkinson suffered a massive stroke. He survived for a further ten years during which time he could not speak and he was partly paralysed. His wife Dusja cared for him throughout this long and difficult final illness.",
  "matematicos_citados_na_biografia": [
    "Titchmarsh",
    "Riemann zeta function",
    "Royal Society of Canada",
    "Royal Society of Edinburgh",
    "Canadian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}