{
  "nome_completo": "Frederick Bath",
  "nome_curto": "Frederick Bath",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bath/",
  "data_nascimento": "10 September 1900",
  "local_nascimento": "Islington, London, England",
  "data_morte": "2 September 1982",
  "local_morte": "Dartmouth, Devon, England",
  "summary": "Frederick Bath graduated from Bristol and Cambridge and held posts at King's College London, University College Dundee, St Andrews and Edinburgh. He worked in Geometry.",
  "biografia": "At the\n1901\ncensus,\nFrederick Bath\nis with his mother, Edith Matilda Bath, living with Albert Freeman\n(\naged\n40)\nand Mary A Freeman\n(\nage\n62)\nin Bath. Albert is the head of the family and Mary is described as his wife. Edith is a visitor, aged\n24\n, living on own means. Frederick is\n6\nmonths old and was born in Islington, London. At the\n1911\ncensus they are still living in Bath at\n17\nShaftesbury Avenue, Lower Weston, Bath. Edith Matilda Bath is the head of the family but now Frederick has two siblings, Catherine Bath\n(\nborn about\n1906)\nand Robert Bath\n(\nborn about\n1910)\n.\nFrederick Bath attended King Edward VI School in Bath, England, where he held a scholarship. After completing his secondary education there, and winning a scholarship to Bristol University, he began his studies in Bristol. There he was particularly influenced by Peter Fraser, an outstanding lecturer.\nDirac\n, who was at the University of Bristol at about the same time as Bath, wrote the following about Fraser:-\nDuring\n[\nmy\n]\nmathematical training\n[1921\n-\n23\nat the University of Bristol\n]\n, the man who influenced me most was Fraser. Fraser was a mathematician who never did any research, never published anything, but he was a wonderful teacher, able to inspire his students with real excitement about basic ideas in mathematics. ... There were two things I learnt from Fraser. One of these was rigorous mathematics. ... The second thing I learned from Fraser was projective geometry. Now that had a profound influence on me because of the mathematical beauty involved in it.\nFraser had the same strong influence on Bath, and he encouraged him to undertake research at Cambridge after he had graduated with First Class Honours in Mathematics from Bristol. Bath entered King's College, Cambridge, where he undertook research with\nH W Richmond\n. Bath was awarded his doctorate from Cambridge for his thesis\nResearches In The Geometry Of Algebraic Curves And Surfaces\n.\nIn\n1924\nBath was appointed Lecturer in Mathematics in King's College, London. He held this appointment until\n1928\nwhen he became Lecturer in Mathematics in the University of St Andrews and Assistant to the Professor of Mathematics in University College, Dundee. In December\n1929\nthe University of St Andrews intimated that Dr Frederick Bath, Lecturer in Mathematics in University College, Dundee, had been appointed to a Carnegie Trust Teaching Fellowship. He held the lectureship in St Andrews until\n1937\nwhen he moved to Edinburgh. When Frederick Bath resigned his position in Dundee in\n1936\non his appointment to Edinburgh University,\nWalter Ledermann\nfilled the vacancy.\nBath taught at Edinburgh from\n1937\nto\n1945\n. During these years he married Olga Heywood. The announcement of the marriage reads:-\nAt St George's Church, Headstone, on\n4\nApril\n1940\n, Frederick Bath, Edinburgh University, to Olga, daughter of Dr and Mrs H B Heywood, Harrow, Middlesex.\nTwo years later the birth of a daughter, one of three children, was announced:-\nAt Queen Mary Nursing Home, Edinburgh, on\n17\nMay\n1942\n, to Olga, wife of Frederick Bath, a daughter.\nBath was a member of the\nEdinburgh Mathematical Society\n, joining in June\n1928\n. He was honoured by being elected as President of the Society for session\n1938\n-\n39\nand again for session\n1939\n-\n40\n. By\n1940\nBritain was at war with Germany and Bath undertook war service in the Department of Health for Scotland. When the war ended in\n1945\nhe resigned his position in the University, finding it hard to live on the poor salary, and became a Civil Servant working at the Treasury. In\n1949\nhe became secretary to the Nature Conservancy, returning to a Civil Service position as Assistant Secretary at the Ministry of Works. He was honoured with an OBE when he retired in\n1969\n.\nFrederick Bath was elected to the\nRoyal Society of Edinburgh\non\n4\nMarch\n1929\n, his proposers being\nJohn Edward Aloysius Steggall\n,\nHerbert Westren Turnbull\n, David Waterston, Herbert Stanley Allen.\nAn obituary, written by\nW L Edge\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1984\n, pages\n167\n-\n169\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nFinally we mention that Bath published\nOn circles determined by five lines in a plane\nin\nProc. Cambridge Philos. Soc\n.\n35\n(1939)\n. N A Court writes:-\nThe known properties of the circles of the figure are proved synthetically and very elegantly by placing the plane in a four dimensional space.",
  "matematicos_citados_na_biografia": [
    "Dirac",
    "H W Richmond",
    "Walter Ledermann",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "John Edward Aloysius Steggall",
    "Herbert Westren Turnbull",
    "W L Edge",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}