{
  "nome_completo": "Fritz Alexander Ernst Noether",
  "nome_curto": "Fritz Noether",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Noether_Fritz/",
  "data_nascimento": "7 October 1884",
  "local_nascimento": "Erlangen, Middle Franconia, Bavaria, Germany",
  "data_morte": "10 September 1941",
  "local_morte": "Orel, Russia",
  "summary": "Fritz Noether was a German mathematician who emigrated from Nazi Germany to the Soviet Union and was later executed by the Stalinist NKVD. He was the son of Max Noether and the brother of Emmy Noether.",
  "biografia": "Fritz Noether\n's parents were the famous mathematician\nMax Noether\nand his wife Ida Amalia Kaufmann\n(1852\n-\n1915)\n. Max and Ida were both Jewish and they married in\n1880\n. Fritz was the third of his parents' four children, having\nEmmy Noether\nas his older sister. Fritz had one older brother Alfred Noether\n(28\nMarch\n1883\n-\n13\nDecember\n1918)\nand one younger brother, Gustav Robert Noether\n(15\nNovember\n1889\n-\n4\nJune\n1928)\n. Let us note right at the beginning of this biography that although we have given a precise date and place for Fritz's death, there is some doubt about this as we shall relate below.\nFritz's school education was in Erlangen. He entered elementary school in May\n1890\n, studied there for four years. In winter\n1894\nhe began his studies at an Erlangen humanistic\nGymnasium\nand, in July\n1903\n, passed his Abitur examinations giving him the right to begin his university studies. At this time, however, it was compulsory for German boys to spend one year in military service before beginning their university studies so it was not until the winter semester of the academic session\n1904\n-\n05\nthat he entered the University of Erlangen to begin his studies of mathematics and physics. He spent five semesters at the University of Erlangen where he attended lectures and exercise classes given by\nPaul Gordan\n,\nMax Noether\n, Eilhard Wiedemann\n(1852\n-\n1928)\n, Rudolf Reiger\n(1877\n-\n1943)\n, Emil Hilb,\nErnst Fischer\n,\nKurt Hensel\n, Hans Lenk\n(1863\n-\n1938)\n, and Hermann Leser\n(1873\n-\n1937)\n. In addition to his mathematics lectures he attended lectures on geology given by Lenk, philosophy given by Leser, and physics given by Reiger and Wiedemann. Moving to Munich, he spent four semesters undertaking research for his doctorate advised by Aurel Edmund Voss\n(1845\n-\n1931)\n. At the University of Munich he attended lectures and exercise classes given by Sebastian Finsterwalder\n(1862\n-\n1951)\n,\nFerdinand von Lindemann\n,\nAlfred Pringsheim\n, Hugo von Seeliger\n(1849\n-\n1924)\n,\nArnold Sommerfeld\n, Aurel Voss and Arthur Korn\n(1898\n-\n1934)\n. In addition to the mathematics professors, Finsterwalder was a mathematician and glaciologist, von Seeliger was an astronomer, and Korn was a physicist. Noether was awarded his doctorate in\n1909\nfor his thesis\nÜber rollende Bewegung einer Kugel auf Rotationsflächen\n.\nⓉ\n(\nOn the rolling motion of a sphere on surfaces of revolution.\n)\nThe thesis, which gives differential equations for the Bohr conditions, etc., was published in\nAnnalen der Physik\nin the following year. Its importance can be seen from the fact that a Russian translation\nOn the question of the kinematics of an absolutely rigid body in the theory of relativity\n(\nRussian\n)\nwas made by L Z Ponizovskii and published in\n1980\n. Gottfried Emanuel Noether, Fritz Noether's younger son, writes in\n[\n8\n]\nabout\nSommerfeld\n's role in advising his father:-\nHis Ph.D. adviser at the University in Munich was Professor A Voss. But in the dissertation, the candidate gave equal thanks to Professor\nA Sommerfeld\nfor valuable inspiration. A close working relationship between Fritz Noether and\nA Sommerfeld\nis indicated by the fact that Part\n4\n(\n'Die technischen Anwendungen der Kreiseltheorie'\nⓉ\n(\nThe technical applications of the centrifugal theory\n)\n)\nin\nF Klein\n's and\nA Sommerfeld\n's 'Über die Theorie des Kreisels'\nⓉ\n(\nOn the theory of the gyroscope\n)\n, published in\n1910\nby Teubner in Leipzig, bears the notation: \"Prepared for publication and supplemented by Fritz Noether.\" Indeed,\nSommerfeld\n's introductory remarks refer to Fritz Noether as collaborator for this fourth and final part of the\nKlein\nand\nSommerfeld\nwork on gyroscopes.\nAfter the award of his doctorate, Noether undertook postdoctoral studies in Göttingen. In\n1911\n, after two years at Göttingen, Noether went to Karlsruhe where he was appointed as\nKarl Heun\n's assistant at the Technische Hochschule.\nHeun\nhad been appointed as professor of theoretical mechanics at Karlsruhe in\n1902\nand his first assistant had been\nGeorg Hamel\n. Max Winkelmann\n(1879\n-\n1946)\nhad been\nHeun\n's next assistant but he had been appointed as Professor of Applied Mathematics at Jena in\n1911\nwhere he succeeded\nWilhelm Kutta\nwho had moved to Aachen. Noether filled the position left vacant by Winkelmann's departure. In the summer of\n1911\n, Noether submitted his\nhabilitation\nthesis\nÜber den Gültigkeitsbereich der Stokesschen Widerstandsformel\nⓉ\n(\nAbout the scope of the Stokes' resistance formula\n)\nto the Karlsruhe Technische Hochschule and gained his right to lecture. This habilitation thesis was published in\nZeitschrift für Mathematik und Physik\nin\n1912\n. For a list of publications by Noether, see\nTHIS LINK\n.\nIn December\n1911\n, Noether married Regina Maria Würth\n(1882\n-\n1935)\n. She was the daughter of a customs official from the Jewish community at Randegg/Baden on the Swiss-German border between Schaffhausen and Singen. They had two children, Hermann Dietrich Alexander Noether\n(1912\n-\n2007)\nand Gottfried Emanuel Noether\n(1915\n-\n1991)\n.\nOver the next few years Noether published\nÜber die Entstehung einer turbulenten Flüssigkeitsbewegung\nⓉ\n(\nOn the origin of turbulent fluid motion\n)\n(1913)\nand\nZur Theorie der Turbulenz\nⓉ\n(\nOn the theory of turbulence\n)\n(1914)\nbut then World War I broke out in the summer of\n1914\n. In the early part of the war Noether served on the German-French front but after he was wounded he was sent to undertake research in ballistics. There is, naturally, a bit of a gap in his publication record during the war years. After the war ended in\n1918\n, Noether returned to the Karlsruhe Technische Hochschule where he was promoted to extraordinary professor. In\n1921\nhe took leave of absence to work at the industrial firm Siemens in Berlin. He did not return to his position at Karlsruhe Technische Hochschule since, in\n1922\n, he was appointed to the second chair of Higher Mathematics and Mechanics at the University of Breslau.\nNoether's main contributions to mathematics are described in\n[\n6\n]\n:-\nNoether's main contribution to science was his criticism towards some of\nHeisenberg\n's results which were evidenced only decades later. He has also published some works on the turbulence problems thereby accounting for a mathematical approach. His particular interest was the origin of turbulent flow, as was experimentally investigated by colleagues such as Ludwig Schiller\n(1882\n-\n1961)\n. He also investigated the definition domains of the resistance formulas relating to the fall of spheres in a viscous fluid, as first investigated by\nGeorge Gabriel Stokes\n(1819\n-\n1903)\n. In\n1931\nNoether presented a chapter on the investigation of the\nNavier\n-\nStokes\nequations.\nThe reference in this quote to Noether's criticism of\nHeisenberg\n's results needs further amplification.\nWerner Heisenberg\nsubmitted his dissertation,\nOn the Stability and Turbulence of Liquid Currents\n, to the University of Munich in July\n1923\n.\nSommerfeld\nhad suggested he attack the exceptionally difficult problem of determining the precise transition of a liquid from laminar flow to turbulent flow. The thesis was accepted for publication but, at a joint meeting of the\nGerman Mathematical Society\nand the German Engineering Society held in Marburg in September\n1923\n, Noether gave a talk in which he raised objections to\nHeisenberg\n's results. The published version of Noether's talk is\nZur asymptotischen Behandlung der stationären Lösungen im Turbulenzproblem\nⓉ\n(\nOn asymptotic treatment of the stationary solutions in turbulence problems\n)\n(1926)\n. In this paper Noether writes\n(\ntranslation taken from\n[\n2\n]\n)\n:-\nWithout going into the details of\nHeisenberg\n's treatment, I just wish to mention here that he makes use of a rather doubtful extension of the \"transition situations\", which has been proposed by\nHopf\nfor a specific case, and that he takes over certain assumptions from\nRayleigh\n's studies of frictionless flows, which cannot be considered justifiable even in\nRayleigh\n's case ...\nSince Noether's work on turbulence rightly had a high reputation,\nHeisenberg\n's results were treated with the utmost suspicion after this criticism. However, twenty years later\nHeisenberg\nwrote in a letter to\nSommerfeld\n(\nsee\n[\n2\n]\n)\n:-\nI was amused to find that evidently the main content of my dissertation was still all right. In particular, the specialists on hydrodynamics now apparently agree that the parabolic flow profile is indeed unstable, as I had stated at that time, and that also my calculation of the region of instability was essentially correct.\nIn\n1952\nHeisenberg\nspoke at the International Congress of Mathematicians in Cambridge, Massachusetts, USA, and said\n(\nsee\n[\n2\n]\n)\n:-\n.. the paper of Noether, which in his time had made the whole theory of instability suspicious, seems to contain some mistake, but the mistake has not yet been found.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which, among others, exempted non-Aryans who had served in the\n1914\n-\n18\nWar. Noether was Jewish but had served in World War I, had been wounded and had been awarded the Iron Cross. He clearly satisfied the exemption clause but, on\n26\nApril\n1933\n, a group of students complained to the Rektor of the University of Breslau that having Noether on the staff \"in large measure contradict the Aryan principle.\" The students suggested that Noether, as a Jew, would never work in the national interest. Noether protested that of course he was a German who would work for the national interest. However, to let things cool off he stopped lecturing thinking, quite rightly, that his presence would lead to student unrest. After taking a break from teaching he returned but on\n25\nAugust the students complained again. This time they accused him of having leftwing political views, of actively supporting the League for Human Rights and other \"crimes.\" Section\n4\nof the Civil Service Law allowed anyone to be dismissed who was opposed to the national state. Before he could be dismissed under that Section of the Act, he appealed stating categorically that he had never been politically active. Knowing that he had no chance of preventing his dismissal, he asked that he be allowed to leave under Section\n5\nof the Civil Service Law which allowed a person to move to a different position. More importantly for Noether, this would allow him to retain his pension and also his reputation as a loyal German.\nNoether's sister,\nEmmy Noether\n, suffered in the same way and was dismissed from Göttingen. She went to the United States but Fritz Noether decided to go to Russia. This was, as we shall see, the wrong decision but it is understandable since he did have left wing political views and had a certain admiration for the Soviet Union. He emigrated to the Soviet Union in\n1933\nand was appointed as professor at the Institute of Mathematics and Mechanics in the University of Tomsk. His German pension which he had managed to retain, was immediately cancelled when he emigrated.\nEmmy Noether\ndied in April\n1935\nand, later that year on\n5\nSeptember,\nPavel Sergeevich Aleksandrov\ngave a moving memorial address to the\nMoscow Mathematical Society\ncalling\nEmmy Noether\n\"the greatest woman mathematician of all time.\" Fritz Noether was present in Moscow as a guest of honour to hear\nAleksandrov\n's memorial address. Shortly after this, on\n2\nOctober, Noether wrote from Tomsk to\nHelmut Hasse\n, by this time in Göttingen, concerning the estate of\nEmmy Noether\n. Noether tells\nHasse\nthat\nRichard Brauer\nhad informed him that he had sent two manuscripts of\nEmmy Noether\n's to\nHasse\n, one of which should be considered for publication. Noether tells\nHasse\nthat he is happy that\nHasse\ndecides the journal to which to send the manuscript. Noether suggests that\nEmmy Noether\nprobably destroyed most of her notes before going to the United States and believes that she did not leave anything in Göttingen.\nIn July\n1936\nNoether had attended the International Congress of Mathematicians in Oslo and presented a paper\nÜber elektrische Drahtwellen\nto Section V, the Mathematics Physics, Astronomy and Geophysics Section. This paper was published in the Proceedings in the following year. We note that Noether appears to have been the only mathematician from the Soviet Union at the Congress. Although eleven Soviet participants were listed, only Noether was present at the Congress and none of the others, even the two plenary lecturers\nAleksandr Gelfond\nand\nAleksandr Yakovlevich Khinchin\n, actually attended. One assumes that Noether still had a German passport and was able to leave Russia while the others could not.\nOf course when Noether had emigrated to Russia his wife and two sons had gone with him. However his wife Regina became ill with severe depression and, in\n1935\n, she returned to Germany. She died shortly after and was buried in Ortenberg, Ortenaukreis, Baden-Württemberg, Germany. Noether's two sons remained with their father in Tomsk. For a long time the exact fate of Noether was unknown but his two sons had survived being deported from Russia and given refuge in Sweden before moving on. For many years his two sons made strenuous efforts to get information about their father's fate from the Soviet authorities and on\n12\nMay\n1989\nthey received the following letter from Andrei Parastaev, First Secretary at the USSR Embassy in Washington, D.C.:-\nDear Dr Noether, I write to inform you that on December\n22\n,\n1988\nthe Plenum of the USSR Supreme Court passed a decree No.\n308\n-\n88\n(\nsee enclosure\n)\nin which it determined that your father, Professor Fritz Noether, had been convicted on groundless charges and voided his sentence, thus fully rehabilitating him. On October\n23\n,\n1938\nProfessor Noether was found guilty of allegedly spying for Germany and committing acts of sabotage and was sentenced in Novosibirsk to\n25\nyears of imprisonment. He served time in different prisons. On September\n8\n,\n1941\nthe Military Collegium of the USSR Supreme Court sentenced Professor F Noether to death on the accusation of engaging in anti-Soviet agitation. He was shot in Orel on September\n10\n,\n1941\n. His burial place is unknown. Please, accept my deepest sympathy although I understand that no words can alleviate your pain.\nThe Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union was signed on\n23\nAugust\n1939\nand one might think that this would have placed Noether in a better position. However, Noether was no longer a German citizen by this time since, by Nazi decree, he lost his German citizenship in\n1938\n. There is, however, some doubt concerning the accuracy of this official account of his death given above. First let us give a few more details of his arrest\n[\n4\n]\n:-\nOn November\n22\n,\n1937\n, Noether was arrested on charges of being a German spy who not only spied on the Russian armament industry but committed acts of sabotage against it. On October\n13\n,\n1938\n, he was sentenced to twenty-five years in prison and confiscation of all his belongings. It appears that all the evidence against Noether and the three Russians accused with him was falsified.\nOne must also assume that Noether's death was related to the fact that Germany broke the non-aggression pact on\n22\nJune\n1941\nand invaded the Soviet Union. The reason that the official description of Noether's death is in doubt is due to Savelii Vladimirovich Falkovich\n(1911\n-\n1982)\n. Falkovich\n[\n5\n]\n:-\n... met Fritz Noether on the Moscow metro in the late fall of\n1941\n. Noether and Falkovich knew each other and Noether told his story about his arrest and tortures in Tomsk NKVD. In particular, NKVD agents confiscated many of his things and books. Noether said that finally he was released from Orel Central and went to Lubyanka\n(\nNKVD/KGB headquarters\n)\nfor some travelling documents to visit his family. Then the train stopped and their conversation was interrupted. Since he did not come to Tomsk\n(\nhis son's Gottfried Noether testimony\n)\n, he most probably was arrested again.\nFinally, let us record that we owe to Fritz Noether the notion of the index of an operator. In\n1921\nhe showed that the index of a one-dimensional singular integral operator is expressed by a winding number.",
  "matematicos_citados_na_biografia": [
    "Max Noether",
    "Emmy Noether",
    "Gymnasium",
    "Paul Gordan",
    "Ernst Fischer",
    "Kurt Hensel",
    "Ferdinand von Lindemann",
    "Alfred Pringsheim",
    "Arnold Sommerfeld",
    "Sommerfeld",
    "A Sommerfeld",
    "F Klein",
    "Klein",
    "Karl Heun",
    "Heun",
    "Georg Hamel",
    "Wilhelm Kutta",
    "habilitation",
    "THIS LINK",
    "Heisenberg",
    "George Gabriel Stokes",
    "Navier",
    "Stokes",
    "Werner Heisenberg",
    "German Mathematical Society",
    "Hopf",
    "Rayleigh",
    "Pavel Sergeevich Aleksandrov",
    "Moscow Mathematical Society",
    "Aleksandrov",
    "Helmut Hasse",
    "Hasse",
    "Richard Brauer",
    "Aleksandr Gelfond",
    "Aleksandr Yakovlevich Khinchin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}