{
  "nome_completo": "Gabriel Cramer",
  "nome_curto": "Gabriel Cramer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cramer/",
  "data_nascimento": "31 July 1704",
  "local_nascimento": "Geneva, Switzerland",
  "data_morte": "4 January 1752",
  "local_morte": "Bagnols-sur-Cèze, France",
  "summary": "Gabriel Cramer worked on analysis and determinants. He is best known for his formula for solving simultaneous equations.",
  "biografia": "Gabriel Cramer\n's father was Jean Isaac Cramer, who was a medical doctor in Geneva, while his mother was Anne Mallet. Jean and Anne had three sons who all went on to academic success. Besides Gabriel, their other two sons were Jean-Antione who followed his father's profession and Jean who became a professor of law.\nGabriel certainly moved rapidly through his education in Geneva, and in\n1722\nwhile he was still only eighteen years old he was awarded a doctorate having submitted a thesis on the theory of sound. Two years later he was competing for the chair of philosophy at the Académie de Clavin in Geneva.\nThe competition for the chair was between three men; the eldest was Amédée de la Rive while the other two were both young men,\nGiovanni Ludovico Calandrini\nwho was twenty-one years old and Cramer who was one year younger. The magistrates who were making the appointment favoured the older man with more experience but they were so impressed with brilliant two young men that they thought up a clever plan to enable them to acquire the services of all three. Clearly they were looking to the future and seeing in Cramer and\nCalandrini\ntwo men who would make important future contributions to the Academy.\nThe scheme the magistrates proposed was to split the chair of philosophy into two chairs, one chair of philosophy and one chair of mathematics. De la Rive was offered the philosophy chair, which after all was what he had applied for in the first place, while Cramer and\nCalandrini\nwere offered the mathematics chair on the understanding that they shared the duties and shared the salary. The magistrates put another condition on the appointment too, namely that Cramer and\nCalandrini\neach spend two or three years travelling and while one was away the other would take on the full list of duties and the full salary. It was a good plan for not only did it successfully attract all three men to the Academy, but it also gave Cramer the opportunity to travel and meet mathematicians around Europe and he was to take full advantage of this which both benefited him and the Academy.\nCramer and\nCalandrini\ndivided up the mathematics courses each would teach. Cramer taught geometry and mechanics while\nCalandrini\ntaught algebra and astronomy. The two had been paired in the arrangement and their friends joking called them Castor and Pollux. Had their personalities been different the arrangement might have presented all sorts of difficulties, but given their natures things worked out remarkably well. Cramer is said to have been\n[\n1\n]\n:-\n... friendly, good-humoured, pleasant in voice and appearance, and possessed of good memory, judgement and health.\nWe must not give the impression that Cramer just fitted into an existing pattern of teaching. He proposed a major innovation, which the Academy accepted, which was that he taught his courses in French instead of Latin, the traditional language of scholars at that time:-\n... in order that persons who had a taste for these sciences but no Latin could profit.\nAppointed in\n1724\n, Cramer followed the conditions of his appointment and set out for two years of travelling in\n1727\n. He visited leading mathematicians in many different cities and countries of Europe. He headed straight away for Basel where many leading mathematicians were working, spending five months working with\nJohann Bernoulli\n, and also\nEuler\nwho soon afterwards headed off to St Petersburg to be with\nDaniel Bernoulli\n. Cramer then visited England where he met\nHalley\n,\nde Moivre\n,\nStirling\n, and other mathematicians. His discussions with these mathematicians and the continuing correspondence with them after he returned to Geneva had a big influence on Cramer's work.\nFrom England Cramer made his way to Leiden where he met\n'sGravesande\n, then he moved on to Paris where he had discussions with\nFontenelle\n,\nMaupertuis\n,\nBuffon\n,\nClairaut\n, and others. These two years of travelling were to set the tone for Cramer's career for he was highly regarded by all the mathematicians he met, he corresponded with them throughout his life, and he was to perform many extremely valuable major tasks as an editor of their works.\nBack in Geneva in\n1729\n, Cramer was at work on an entry for the prize set by the\nParis Academy\nfor\n1730\n, which was \"Quelle est la cause de la figure elliptique des planètes et de la mobilité de leurs aphélies?\"\nⓉ\n(\nWhat is the cause of the elliptic figure of the planets and the movement of their aphelion?\n)\nCramer's entry was judged as the second best of those received by the\nAcademy\n, the prize being won by\nJohann Bernoulli\n. In\n1734\nthe \"twins\" split up when\nCalandrini\nwas appointed to the chair of philosophy and Cramer became the sole holder of the Chair of Mathematics.\nCramer lived a busy life, for in addition to his teaching and correspondence with many mathematicians, he produced articles of considerable interest although these are not of the importance of the articles written by most of the top mathematicians with whom he corresponded. He published articles in various places including the\nMemoirs of the Paris Academy\nin\n1734\n, and of the\nBerlin Academy\nin\n1748\n,\n1750\nand\n1752\n. The articles cover a wide range of subjects including the study of geometric problems, the history of mathematics, philosophy, and the date of Easter. He published an article on the aurora borealis in the\nPhilosophical Transactions of the Royal Society of London\nand he also wrote an article on law where he applied\nprobability\nto demonstrate the significance of having independent testimony from two or three witnesses rather than from a single witness.\nHis work was not confined to academic areas for he was also interested in local government and served as a member of the Council of Two Hundred in\n1734\nand of the Council of Seventy in\n1749\n. His work on these councils involved him using his broad mathematical and scientific knowledge, for he undertook tasks involving artillery, fortification, reconstruction of buildings, excavations, and he acted as an archivist. He made a second trip abroad in\n1747\n, this time only visiting Paris where he renewed his friendship with\nFontenelle\nas well as meeting\nd'Alembert\n.\nThere are two areas of Cramer's mathematical work which we should highlight. This is the editorial work which he undertook and also his major mathematical work\nIntroduction à l'analyse des lignes courbes algébriques\nⓉ\n(\nIntroduction to the analysis of algebraic curves\n)\npublished in\n1750\n.\nJohann Bernoulli\ndied in\n1748\n, only three or so years before Cramer, but he arranged for Cramer to publish his\nComplete Works\nbefore his death. It shows how much respect\nBernoulli\nhad for Cramer that he insisted that no other edition of his works be published by any editor other than Cramer.\nJohann Bernoulli\n's\nComplete Works\nwas published by Cramer in four volumes in\n1742\n. Not only did\nJohann Bernoulli\narrange for Cramer to publish his\nComplete Works\nbut he also requested that he edit\nJacob Bernoulli\n's works.\nJacob Bernoulli\nhad died\n1705\nand Cramer published his\nWorks\nin two volumes in\n1744\n. These are not complete since\nArs conjectandi\nⓉ\n(\nThe art of conjecture\n)\nis omitted\n(\nthis had been published by\nNicolaus Bernoulli\nin\n1713)\n, but the volumes do contain previously unpublished material and the mathematical background necessary to understand them. In\n1745\n, jointly with Johann\nCastillon\n, Cramer published the correspondence between\nJohann Bernoulli\nand\nLeibniz\n. Cramer also edited the five volume work by Christian Wolff, first published between\n1732\nand\n1741\nwith a new edition appearing between\n1743\nand\n1752\n.\nFinally we should describe Cramer's most famous book\nIntroduction à l'analyse des lignes courbes algébraique\nⓉ\n(\nIntroduction to the analysis of algebraic curves\n)\n. It is a work which Cramer modelled on\nNewton\n's memoir on cubic curves and he praises highly a commentary on\nNewton\n's memoir written by\nStirling\n. He also comments that had he known of\nEuler\n's\nIntroductio in analysin infinitorum\nⓉ\n(\nIntroduction to infinitesimal analysis\n)\nearlier he would have made great use of it. Of course\nEuler\n's book was only published in\n1748\nat which time much of Cramer's book might well have been written. Jones writes in\n[\n1\n]\n:-\nThat he made little use of\nEuler\n's work is supported by the rather surprising fact that throughout his book Cramer makes essentially no use of the infinitesimal calculus in either\nLeibniz\n's or\nNewton\n's form, although he deals with such topics as tangents, maxima and minima, and curvature, and cites\nMaclaurin\nand\nTaylor\nin footnotes. One conjectures that he never accepted or mastered the calculus.\nThe suggestion that Cramer never mastered the calculus must be considered doubtful, particularly given the high regard that he was held in by\nJohann Bernoulli\n.\nAfter an introductory chapter in which types of curves are defined and techniques for drawing their graphs are discussed, Cramer goes on to a second chapter in which transformations to simplify curves are studied. The third chapter looks at a classification of curves and it is in this chapter that the now famous \"Cramer's rule\" is given. After giving the number of arbitrary constants in an equation of degree\nn\nn\nn\nas\n1\n2\nn\n2\n+\n3\n2\nn\n\\large\\frac{1}{2}\\normalsize n^{2} + \\large\\frac{3}{2}\\normalsize n\n2\n1\n​\nn\n2\n+\n2\n3\n​\nn\n, he deduces that an equation of degree\nn\nn\nn\ncan be made to pass through\nn\nn\nn\npoints. Taking\nn\n=\n5\nn = 5\nn\n=\n5\nhe gives an example of finding the five constants involved in making an equation of degree\n2\npass through\n5\npoints. This leads to\n5\nlinear equations in\n5\nunknowns and he refers the reader to an appendix containing Cramer's rule for their solution. We should remark, of course, that Cramer was certainly not the first to give this rule.\nThe other \"well known\" part of Cramer's work is his description of Cramer's paradox. He states a theorem by\nMaclaurin\nwhich says that an equation of degree\nn\nn\nn\nintersects an equation of degree\nm\nm\nm\nin\nn\nm\nnm\nn\nm\npoints. Taking\nn\n=\nm\n=\n3\nn = m = 3\nn\n=\nm\n=\n3\nthis says that two cubics intersect in\n9\npoints, yet his own formula\n1\n2\nn\n2\n+\n3\n2\nn\n\\large\\frac{1}{2}\\normalsize n^{2} + \\large\\frac{3}{2}\\normalsize n\n2\n1\n​\nn\n2\n+\n2\n3\n​\nn\nwith\nn\n=\n3\nn = 3\nn\n=\n3\ngives\n9\nso a cubic is uniquely determined by\n9\npoints. This, says Cramer, is a paradox, but his attempt to explain the paradox is incorrect.\nCramer's name has sometimes been attached to another problem, namely the\nCastillon\n-Cramer problem. This problem, proposed by Cramer to\nCastillon\n, asked how to inscribe a triangle in a circle so that it passed through three given points.\nCastillon\nsolved the problem\n25\nyears after Cramer's death, and the problem went on to various generalisations about inscribed polygons in a conic section.\nCramer had worked extremely hard over a long period with writing his\nIntroduction à l'analyse\nⓉ\n(\nIntroduction to analysis\n)\nand undertaking the large amount of editorial work in addition to all his normal duties. Always of good health, this overwork coupled with a fall from his carriage, brought on a sudden decline. He spent two months in bed recovering, and his doctor then recommended that he spend a quiet period in the south of France to completely regain his strength. Leaving Geneva on\n21\nDecember\n1751\nhe began his journey but he died two weeks later while still on the journey.",
  "matematicos_citados_na_biografia": [
    "Giovanni Ludovico Calandrini",
    "Calandrini",
    "Johann Bernoulli",
    "Euler",
    "Daniel Bernoulli",
    "Halley",
    "de Moivre",
    "Stirling",
    "'sGravesande",
    "Fontenelle",
    "Maupertuis",
    "Buffon",
    "Clairaut",
    "Paris Academy",
    "Academy",
    "Berlin Academy",
    "probability",
    "d'Alembert",
    "Bernoulli",
    "Jacob Bernoulli",
    "Nicolaus Bernoulli",
    "Castillon",
    "Leibniz",
    "Newton",
    "Maclaurin",
    "Taylor"
  ],
  "imagens": [
    "cramer.jpg"
  ]
}