{
  "nome_completo": "Gaspar Lax",
  "nome_curto": "Gaspar Lax",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lax/",
  "data_nascimento": "1487",
  "local_nascimento": "Sarinena, Aragon (now Spain)",
  "data_morte": "23 February 1560",
  "local_morte": "Zaragoza, Spain",
  "summary": "Gaspar Lax was a Spanish scholar who published several mathematics books based on the work of earlier mathematicians.",
  "biografia": "After studying arts and theology at the University of Zaragoza, where he obtained a first degree,\nGaspar Lax\nwent to Paris where he took further degrees including a divinity degree taken at the Sorbonne. Lax remained in Paris and taught there at the Collège de Calvi during\n1507\nand\n1508\n. The Collège de Sorbonne was a theological college of the University of Paris, founded in\n1257\nby Robert de Sorbon. In about\n1271\nSorbon had added the Collège de Calvi which was a literary college that became known as the \"little Sorbonne\".\nAfter these two years at the Collège de Calvi, Lax transferred to the Collège de Montaigu, one of the leading theological colleges of Paris, where he studied under\nMaior\nbut also was an important teacher at the College. One of Lax's fellow countrymen, who was also studying under\nMaior\n, wrote to the representative of the Spanish King in Paris:-\nI am following the theology course of\nJohn Maior\nwith great interest as he is a deeply knowledgeable man whose virtue is as great as his faith. ... may the eternal king deign to grant him long life that he may for long years be useful to our alma mater, the University of Paris.\nIn\n1517\nLax returned to teach again at the Collège de Calvi which he did for the next six years. These were years in which France was engaged in various wars and disputes particularly against Spain and its possessions. Charles I of Spain became the Holy Roman Emperor Charles V in\n1519\n. Francis I had become king of France in\n1515\nand in that year he took Milan. Charles V visited Spain in\n1522\nand France felt threatened from all sides. Between\n1521\nand\n1523\nthe French were expelled from Genoa and the area around Milan, but this led to a French counter attack in\n1523\n. In that year foreigners were asked to leave the Collège de Calvi and shortly after this Lax decided to return to his native land. The conflict between Francis I of France and Holy Roman Emperor Charles V continued.\nIn\n1524\nLax left France and returned to Spain. He was appointed professor at the University of Zaragoza and remained there for the rest of his life. He did achieve certain higher posts within the University of Zaragoza, eventually becoming Vice Chancellor and Rector.\nLax published several good mathematics books based on works by\nBoethius\n,\nEuclid\n,\nJordanus\nand\nCampanus\n. He was one of the Spanish school of \"calculatores\" who studied mechanics, being particularly involved with numerical examples, and using as their main tools the elements of proportion theory and infinitesimal arithmetic. This school seems to have originated with Lax and other students of\nMaior\nwho studied in Paris, then returned to Spain.\nLax was also known as a philosopher, often called the 'Prince of Sophists'.  Almost certainly\nMaior\n's influence was one of the main reasons he studied logical subtleties. However, one of Lax's students wrote that he heard Lax express regret late in his career that he had spent so much time on 'such trivialities'.\nLax published\nArithmetica speculativa\nⓉ\n(\nSpeculative arithmetic\n)\n(1515)\nwhich, according to the historian\nD E Smith\n, was:-\n... a very prolix treatment of theoretical arithmetic based on\nBoethius\nand his medieval successors.\nAnother work by Lax in the same year was\nProportiones\nⓉ\n(\nProportions\n)\n[\n1\n]\n:-\n... a more compact and formalistic treatment of ratios, with citations of\nEuclid\n,\nJordanus\nand\nCampanus\n; unlike most sixteenth-century treatises on ratios, however, it does not deal with the velocities of motion in the Mertonian and Parisian traditions.\nHe also published\nQuaestiones phisicales\nⓉ\n(\nPhysical questions\n)\nin\n1527\nbut this text does not appear to have survived.",
  "matematicos_citados_na_biografia": [
    "Maior",
    "John Maior",
    "Boethius",
    "Euclid",
    "Jordanus",
    "Campanus",
    "D E Smith"
  ],
  "imagens": [
    "lax.jpg"
  ]
}