{
  "nome_completo": "Achille Marie Gaston Floquet",
  "nome_curto": "Gaston Floquet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Floquet/",
  "data_nascimento": "15 December 1847",
  "local_nascimento": "Épinal, France",
  "data_morte": "7 October 1920",
  "local_morte": "Nancy, France",
  "summary": "Gaston Floquet was a French mathematician who worked on mathematical analysis, especially in the theory of differential equations.",
  "biografia": "Gaston Floquet\nstudied at the Lycée Louis-le-Grand in Paris and while there he won a place at the École Normale Supérieure which he entered in\n1869\n. Then in the following year the Franco-Prussian war began which was to prove disastrous for France. The political situation between France and Prussia was deteriorating. The popularity of Napoleon III, the French emperor, was declining in France and he thought a war with Prussia might change his political fortunes since his advisers having told him that the French Army could defeat Prussia. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states. With both sides feeling that a war was to their advantage, the Franco-Prussian War became inevitable. On\n14\nJuly, Bismarck sent a telegram aimed at infuriating the French government. He succeeded, for on the\n19\nJuly France declared war on Prussia. Floquet joined the army of the Loire as a second lieutenant and fought in war until the signing of the peace treaty when he returned to his studies at the École Normale Supérieure. This was a difficult time for the French were naturally looking for reasons why they lost the war so decisively and the education system took much of the blame. In this difficult atmosphere Floquet completed his studies in\n1873\nand on the\n19\nSeptember of that year he was appointed to the Lycée de Belfort where he took charge of the mathematics course.\nFloquet obtained his mathematics\nagrégation\non\n15\nSeptember\n1875\nand a week later he was named as professor of elementary mathematics at the Lycée d'Angers. On\n8\nNovember of the following year Floquet was appointed to the position of professor of special mathematics at the Lycée de Clermont-Ferrand. On\n13\nFebruary\n1878\nhe was appointed maître de conférences at the Faculty of Science at Nancy. As a result of the Franco-Prussian war which had proved disastrous for France, some French territory had been annexed by Germany and this increased the importance of Nancy. It was situated near the border, and when Floquet arrived there it was a city full of barracks. It also contained many industrialists who had left the annexed territory refusing to become German nationals.\nFloquet submitted his doctoral thesis\nSur la théorie des équations différentielles linéaires\nⓉ\n(\nOn the theory of linear differential equations\n)\nto the Faculty of Science in Paris on\n8\nApril\n1879\n. Much of the work he did over the next few years was based on the ideas which were incorporated in his thesis. For example he published three papers with the title\nSur les équations différentielles linéaires à coefficients périodiques\nⓉ\n(\nOn linear differential equations with periodic coefficients\n)\n, two in\n1881\nand the third in\n1883\n. In\n1884\nhe published\nAddition à un mémoire sur les équations différentielles linéaires\nⓉ\n(\nAddition to a memoir on linear differential equations\n)\nand\nSur les équations différentielles linéaires à coefficients doublement périodiques\nⓉ\n(\nOn linear differential equations with doubly periodic coefficients\n)\n. The two\n1881\npapers and the second mentioned paper of\n1884\nappeared in\nComptes Rendus\nwhile the others appeared in the\nAnnals of the École Normale Supérieure\n.\nIn November\n1879\nFloquet was given a temporary appointment as a professor at Nancy and in the following year he was put in charge of the mathematics course there. In July\n1880\nhe was given a permanent chair and by the end of the year he was holding the chair of pure mathematics and analysis. He was appointed as head of the Faculty of Science at Nancy in October\n1905\n. He was a very successful head, creating a number of Institutes which helped to make Nancy the leading scientific research centre outside Paris. He continued to publish high quality papers on mathematics and astronomy in\nComptes Rendus\nand in various journals associated with Nancy. For example he published\nSur une classe d'équations différentielles linéaires non homogènes\nⓉ\n(\nOn a class of non-homogeneous linear differential equations\n)\n(1887)\n,\nSur une propriété de la surface\nx\ny\nz\n=\nl\n3\nxyz = l^{3}\nx\ny\nz\n=\nl\n3\nⓉ\n(\nOn a property of the surface xyz = l\n3\n)\n(1888)\n,\nSur le mouvement d'un fil dans un plan fixe\nⓉ\n(\nOn the motion of a wire in a fixed plane\n)\n(1889)\n,\nSur l'équation de Lamé\nⓉ\n(\nOn the Lamé equation\n)\n(1895)\n,\nSur le mouvement d'un point ou d'un fil glissant sur un plan horizontal fixe lorsqu'on tient compte de la rotation de la terre et du frottement\nⓉ\n(\nOn the motion of a point or wire sliding on a fixed horizontal plane when considering the rotation of the earth and friction\n)\n(1898)\n,\nSur les équations intrinsèques du mouvement d'un fil et sur le calcul de sa tension\nⓉ\n(\nOn the intrinsic equations of motion of a wire and the calculation of its tension\n)\n(1901)\n, and\nL'astronome Messier\nⓉ\n(\nThe astronomer Messier\n)\n(1902)\n.\nWorld War I broke out in\n1914\nand Nancy was heavily shelled. Floquet remained in Nancy during the war, never once leaving the city during the four years to\n1918\n.",
  "matematicos_citados_na_biografia": [
    "agrégation"
  ],
  "imagens": [
    "floquet.jpg"
  ]
}