{
  "nome_completo": "George W Eyre Andrews",
  "nome_curto": "George E Andrews",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Andrews/",
  "data_nascimento": "4 December 1938",
  "local_nascimento": "Salem, Oregon, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "George E Andrews is an American mathematician who worked in special functions, number theory, analysis and combinatorics",
  "biografia": "George E Andrews\n' parents were Raymond Leslie Andrews and Ravena Pearl Eyre. He grew up on a farm outside Salem. He liked detective stories when he was at junior high school and realised at that time that he enjoyed working things out. He thought that he might achieve this by entering the legal profession, but when he was at high school his ideas changed somewhat and he decided that he would study engineering. It was with this in mind that he began his undergraduate studies at Oregon State University in Corvallis in\n1956\n. However, his mathematics lecturer soon persuaded him that he should forget his idea of taking engineering as his major subject and choose mathematics instead. Andrews said\n[\n1\n]\n:-\nI went into mathematics and never looked back. I was struck by the beauty and the appeal of mathematics. It just captivated me.\nAndrews graduated from Oregon State University with both a B.S. and an M.S. in June\n1960\n. Later that summer, on\n2\nSeptember, he married Joy Margaret Brown; they had three children Amy Beth, Katherine Yvonne, and Derek George. He then spent a year at the University of Cambridge in England on a Fulbright Scholarship. After returning to the United States in\n1961\n, Andrews began his graduate studies at the University of Pennsylvania in Philadelphia. He already knew that he wanted to undertake research in number theory but at the time he began his course it was prime numbers which fascinated him. He took a graduate course on number theory given by Hans\nRademacher\nand there he met the notion of a partition. Andrews had come across these ideas before, since Joy, before they were married, had given him a book which contained\nG H Hardy\n's\nA Mathematician's Apology\nand in that he had encountered the partition formula that\nHardy\nand\nRamanujan\nhad discovered in\n1916\nfor the number of different ways an integer can be expressed as a sum of natural numbers. Andrews was fascinated and asked\nRademacher\nif he would become his thesis advisor. The topic suggested by\nRademacher\nwas\nRamanujan\n's mock theta functions and indeed his research led to his thesis\nOn the Theorems of Watson and Dragonette for Ramanujan's Mock Theta Functions\n. Andrews had published three papers by the time he had completed his thesis work:\nAn asymptotic expression for the number of solutions of a general class of Diophantine equations\n(1961)\n;\nA lower bound for the volume of strictly convex bodies with many boundary lattice points\n(1963)\n; and\nOn estimates in number theory\n(1963)\n. This last paper, in the\nAmerican Mathematical Monthly\n, gave a method for finding an upper bound for the number of solutions of a\nDiophantine equation\nof the form\ny\n=\nf\n(\nx\n)\ny = f (x)\ny\n=\nf\n(\nx\n)\n.\nAndrews was awarded his doctorate in\n1964\nfrom the University of Pennsylvania and was offered the position of assistant professor at Pennsylvania State University. His list of publications continued to grow with the paper\nA simple proof of Jacobi's triple product identity\n(1965)\nappearing before three papers were published in the following year based on the work of his doctoral thesis on mock theta functions and partitions. In\n1967\nAndrews was promoted to associate professor and then to full professor in\n1970\n. He continued his career at Pennsylvania State University, being named Evan Pugh Professor in\n1981\n.\nThe year\n1970\nsaw the publication of Andrews' first book\nNumber theory\n. C Ryavec writes:-\nThis book is highly suitable for a course in elementary number theory. The material is presented clearly, and it is supplemented by a balanced selection of exercises, so that the interest of both the merely competent and of the more able undergraduate is maintained.\nIn\n1970\n-\n71\nAndrews was a visiting professor at Massachusetts Institute of Technology, then in\n1975\nat the University of Erlangen in Germany. Back in the United States he went to the University of Wisconsin where he was a visiting professor during\n1975\n-\n76\nworking mainly with Richard\nAskey\n. Having received an invitation to speak at a conference in Strasbourg, France, he went there from Wisconsin. After the conference ended Andrews visited the University of Cambridge in England before returning to Wisconsin. In Cambridge Andrews asked to be allowed to work on the papers left by\nG N Watson\non his death, which had been donated to the University Library and continued to be housed there. What Andrews found in an old box astounded him, for it contained around\n100\nloose pages in what he immediately recognised as\nRamanujan\n's handwriting. It did not take Andrews long to recognise that the formulas on the sheets concerned mock theta functions. Indeed there was little else but formulas on the sheets with hardly any connecting words. Askey has said\n[\n1\n]\n:-\nThere were certain identities that George recognized as mock theta functions. No one else would have spotted them instantly. George has done many things, but this is what will make the history books.\nAbout the same time as Andrews was making his major discovery of what is now called 'Ramanujan's lost notebook', his second book\nThe theory of partitions\nwas published. Carlitz writes:-\n... as the author points out, there are almost no books devoted entirely to partitions. The combinatorial and formal power series aspects of the subject have usually been treated in books on elementary number theory or combinatorial analysis. Asymptotic problems concerning partitions have been considered in books on analytic or additive number theory. Applications of partitions in various branches of mathematics and statistics, the author points out, may make use of both combinatorial and asymptotic methods. ...\nThe book is very well written. Despite the large amount of ground covered it is quite readable. It is an excellent introduction to a fascinating subject.\nAndrews, on his web page, describes his research interests as follows:-\nMy research centres on the theory of partitions and related areas. I have a long-term interest in the work of\nRamanujan\n, the Indian genius, whose last notebook I unearthed in the Trinity College Library at Cambridge in\n1976\n. I am collaborating with Bruce Berndt on a multi-volume study of this 'Lost Notebook.' The first volume of this study appeared in June\n2005\n. In addition, I have written more than\n250\nscientific papers, and several books on number theory and the theory of partitions, as well as edited the collected papers of\nPercy A MacMahon\n.\nAs Andrews says, the first volume of\nRamanujan\n's lost notebook, co-authored with Bruce C Berndt, was published in\n2005\n. It is the first of what the authors expect to be four volumes. Andrew V Sills writes:-\nThe mathematics community owes a huge debt of gratitude to Andrews and Berndt for undertaking the monumental task of producing a coherent presentation along with complete proofs of the chaotically written mathematical thoughts of\nRamanujan\nduring the last year of his life. Some\n85\nyears after his death, beautiful \"new\" and useful results of\nRamanujan\ncontinue to be brought to light.\nAmong Andrews' other books we mention\nSpecial functions\nwritten jointly with Richard\nAskey\nand Ranjan Roy and published in\n1999\n. Bruce C Berndt, in a review of the book, points to many remarkable features. We extract a few:-\nThe book genuinely reflects the author's vast accumulated insights. Most notably, the authors demonstrate a superb familiarity with the historical roots of their subject. ...\n\"Special functions\" will certainly emerge as the chief textbook and reference on special functions for the next several years. Indeed, the historical insights and copious problems make it an excellent textbook for a beginning graduate course. This book joins F W J Oliver's 'Asymptotics and special functions', first published in\n1974\n, as the only general books on special functions during the past three decades that belong \"in the Hobbs class\", to quote\nG H Hardy\n.\nIt is impossible to give any sort of overview of the totality of Andrews' contributions given that he has, up to\n2006\n,\n275\nitems in his publications list. Although he has continued on the faculty at Pennsylvania State University, Andrews has spent around\n12\nfurther spells as visiting professor at universities in the United States, Canada, Mexico, Australia, France, South Africa, Austria and England.\nHe has served on the editorial boards of many journals:\nDiscrete Mathematics\n, the\nJournal of Combinatorial Theory\n(\nA\n)\n; The Ramanujan Journal; Integers: The Electronic Journal of Combinatorial Number Theory\n; the\nProceedings of the Jangjeon Mathematical Society; Advanced Studies in Contemporary Mathematics\n; the\nAcharya Nagarjuna International Journal of Mathematics and Information Technology\n; and the\nInternational Journal of Number Theory\n.\nAndrews has received, and continues to receive, many honours for his outstanding contributions. For example he has been an invited one-hour speaker at four Joint\nAmerican Mathematical Society\n-\nMathematical Association of America\nmeetings\n(1972\n,\n1977\n,\n1993\n,\n1994)\n, and he was the\nMathematical Association of America\n's\nHedrick\nLecturer in\n1980\n, and the J S Frame Lecturer in\n1993\n. He has received honorary degrees from the University of Parma\n(1998)\n, the University of Florida\n(2002)\n, and the University of Waterloo\n(2004)\n. He was elected to the\nAmerican Academy of Arts and Sciences\nin\n1997\n, and to the\nNational Academy of Sciences\nin\n2003\n. He has received the Allegheny Region Distinguished Teaching Award from the\nMathematical Association of America\nand the Centennial Award from the Department of Mathematics, the University of Pennsylvania:-\n... in recognition of contributions to pure mathematics and\n[\n...\n]\nmathematical education ...\nin October\n1999\n.\nAs to his current\n(\nSeptember\n2006)\nresearch interests, Andrews writes:-\nCurrently I am reviving\nMacMahon\n's \"Partition Analysis\", collaborating on further applications of partitions to statistical mechanics and computer science, and completing my study of the relationship between\nRamanujan\n's enigmatic identities and quadratic forms.",
  "matematicos_citados_na_biografia": [
    "Rademacher",
    "G H Hardy",
    "Hardy",
    "Ramanujan",
    "Diophantine equation",
    "Askey",
    "G N Watson",
    "Percy A MacMahon",
    "American Mathematical Society",
    "Mathematical Association of America",
    "Hedrick",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "MacMahon"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}