{
  "nome_completo": "Georg Simon Ohm",
  "nome_curto": "Georg Simon Ohm",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ohm/",
  "data_nascimento": "16 March 1789",
  "local_nascimento": "Erlangen, Bavaria (now Germany)",
  "data_morte": "6 July 1854",
  "local_morte": "Munich, Bavaria, Germany",
  "summary": "Georg Simon Ohm was a German mathematician best known for Ohm's Law on electrical resistance.",
  "biografia": "Georg Simon Ohm\ncame from a Protestant family. His father, Johann Wolfgang Ohm, was a locksmith while his mother, Maria Elizabeth Beck, was the daughter of a tailor. Although his parents had not been formally educated, Ohm's father was a rather remarkable man who had educated himself to a high level and was able to give his sons an excellent education through his own teachings. Had Ohm's brothers and sisters all survived he would have been one of a large family but, as was common in those times, several of the children died in their childhood. Of the seven children born to Johann and Maria Ohm only three survived, Georg Simon, his brother\nMartin\nwho went on to become a well-known mathematician, and his sister Elizabeth Barbara.\nWhen they were children, Georg Simon and\nMartin\nwere taught by their father who brought them to a high standard in mathematics, physics, chemistry and philosophy. This was in stark contrast to their school education. Georg Simon entered Erlangen\nGymnasium\nat the age of eleven but there he received little in the way of scientific training. In fact this formal part of his schooling was uninspired stressing learning by rote and interpreting texts. This contrasted strongly with the inspired instruction that both Georg Simon and Martin received from their father who brought them to a level in mathematics which led the professor at the University of Erlangen, Karl Christian von Langsdorf, to compare them to the Bernoulli family. It is worth stressing again the remarkable achievement of Johann Wolfgang Ohm, an entirely self-taught man, to have been able to give his sons such a fine mathematical and scientific education.\nIn\n1805\nOhm entered the University of Erlangen but he became rather carried away with student life. Rather than concentrate on his studies he spent much time dancing, ice skating and playing billiards. Ohm's father, angry that his son was wasting the educational opportunity that he himself had never been fortunate enough to experience, demanded that Ohm leave the university after three semesters. Ohm went\n(\nor more accurately, was sent\n)\nto Switzerland where, in September\n1806\n, he took up a post as a mathematics teacher in a school in Gottstadt bei Nydau.\nKarl Christian von Langsdorf left the University of Erlangen in early\n1809\nto take up a post in the University of Heidelberg and Ohm would have liked to have gone with him to Heidelberg to restart his mathematical studies. Langsdorf, however, advised Ohm to continue with his studies of mathematics on his own, advising Ohm to read the works of\nEuler\n,\nLaplace\nand\nLacroix\n. Rather reluctantly Ohm took his advice but he left his teaching post in Gottstadt bei Nydau in March\n1809\nto become a private tutor in Neuchâtel. For two years he carried out his duties as a tutor while he followed Langsdorf's advice and continued his private study of mathematics. Then in April\n1811\nhe returned to the University of Erlangen.\nHis private studies had stood him in good stead for he received a doctorate from Erlangen on\n25\nOctober\n1811\nand immediately joined the staff as a mathematics lecturer. After three semesters Ohm gave up his university post. He could not see how he could attain a better status at Erlangen as prospects there were poor while he essentially lived in poverty in the lecturing post. The Bavarian government offered him a post as a teacher of mathematics and physics at a poor quality school in Bamberg and he took up the post there in January\n1813\n.\nThis was not the successful career envisaged by Ohm and he decided that he would have to show that he was worth much more than a teacher in a poor school. He worked on writing an elementary book on the teaching of geometry while remaining desperately unhappy in his job. After Ohm had endured the school for three years it was closed down in February\n1816\n. The Bavarian government then sent him to an overcrowded school in Bamberg to help out with the mathematics teaching.\nOn\n11\nSeptember\n1817\nOhm received an offer of the post of teacher of mathematics and physics at the Jesuit Gymnasium of Cologne. This was a better school than any that Ohm had taught in previously and it had a well equipped physics laboratory. As he had done for so much of his life, Ohm continued his private studies reading the texts of the leading French mathematicians\nLagrange\n,\nLegendre\n,\nLaplace\n,\nBiot\nand\nPoisson\n. He moved on to reading the works of\nFourier\nand\nFresnel\nand he began his own experimental work in the school physics laboratory after he had learnt of Oersted's discovery of electromagnetism in\n1820\n. At first his experiments were conducted for his own educational benefit as were the private studies he made of the works of the leading mathematicians.\nThe Jesuit Gymnasium of Cologne failed to continue to keep up the high standards that it had when Ohm began to work there so, by\n1825\n, he decided that he would try again to attain the job he really wanted, namely a post in a university. Realising that the way into such a post would have to be through research publications, he changed his attitude towards the experimental work he was undertaking and began to systematically work towards the publication of his results\n[\n1\n]\n:-\nOverburdened with students, finding little appreciation for his conscientious efforts, and realising that he would never marry, he turned to science both to prove himself to the world and to have something solid on which to base his petition for a position in a more stimulating environment.\nIn fact he had already convinced himself of the truth of what we call today \"Ohm's law\" namely the relationship that the current through most materials is directly proportional to the potential difference applied across the material. The result was not contained in Ohm's firsts paper published in\n1825\n, however, for this paper examines the decrease in the electromagnetic force produced by a wire as the length of the wire increased. The paper deduced mathematical relationships based purely on the experimental evidence that Ohm had tabulated.\nIn two important papers in\n1826\n, Ohm gave a mathematical description of conduction in circuits modelled on\nFourier\n's study of heat conduction. These papers continue Ohm's deduction of results from experimental evidence and, particularly in the second, he was able to propose laws which went a long way to explaining results of others working on galvanic electricity. The second paper certainly is the first step in a comprehensive theory which Ohm was able to give in his famous book published in the following year.\nWhat is now known as Ohm's law appears in this famous book\nDie galvanische Kette, mathematisch bearbeitet\nⓉ\n(\nThe galvanic chain, processed mathematically\n)\n(1827)\nin which he gave his complete theory of electricity. The book begins with the mathematical background necessary for an understanding of the rest of the work. We should remark here that such a mathematical background was necessary for even the leading German physicists to understand the work, for the emphasis at this time was on a non-mathematical approach to physics. We should also remark that, despite Ohm's attempts in this introduction, he was not really successful in convincing the older German physicists that the mathematical approach was the right one. To some extent, as Caneva explains in\n[\n1\n]\n, this was Ohm's own fault:-\n... in neither the introduction nor the body of the work, which contained the more rigorous development of the theory, did Ohm bring decisively home either the underlying unity of the whole or the connections between fundamental assumptions and major deductions. For example, although his theory was conceived as a strict deductive system based on three fundamental laws, he nowhere indicated precisely which of their several mathematical and verbal expressions he wished to be taken as the canonical form.\nIt is interesting that Ohm's presents his theory as one of contiguous action, a theory which opposed the concept of action at a distance. Ohm believed that the communication of electricity occurred between \"contiguous particles\" which is the term Ohm himself uses. The paper\n[\n8\n]\nis concerned with this idea, and in particular with illustrating the differences in scientific approach between Ohm and that of\nFourier\nand\nNavier\n. A detailed study of the conceptual framework used by Ohm in formulating Ohm's law is given in\n[\n6\n]\n.\nAs we described above, Ohm was at the Jesuit Gymnasium of Cologne when he began his important publications in\n1825\n. He was given a year off work in which to concentrate on his research beginning in August\n1826\nand although he only received the less than generous offer of half pay, he was able to spend the year in Berlin working on his publications. Ohm had believed that his publications would lead to his receiving an offer of a university post before having to return to Cologne but by the time he was due to begin teaching again in September\n1827\nhe was still without such an offer.\nAlthough Ohm's work strongly influenced theory, it was received with little enthusiasm. Ohm's feeling were hurt, he decided to remain in Berlin and, in March\n1828\n, he formally resigned his position at Cologne. He took some temporary work teaching mathematics in schools in Berlin.\nHe accepted a position at Nüremberg in\n1833\nand although this gave him the title of professor, it was still not the university post for which he had strived all his life. His work was eventually recognised by the\nRoyal Society\nwith its award of the Copley Medal in\n1841\n. He became a foreign member of the\nRoyal Society\nin\n1842\n. Other academies such as those in\nBerlin\nand\nTurin\nelected him a corresponding member, and in\n1845\nhe became a full member of the Bavarian Academy.\nThis belated recognition was welcome but there remains the question of why someone who today is a household name for his important contribution struggled for so long to gain acknowledgement. This may have no simple explanation but rather be the result of a number of different contributary factors. One factor may have been the inwardness of Ohm's character while another was certainly his mathematical approach to topics which at that time were studied in his country a non-mathematical way. There was undoubtedly also personal disputes with the men in power which did Ohm no good at all. He certainly did not find favour with Johannes Schultz who was an influential figure in the ministry of education in Berlin, and with Georg Friedrich Pohl, a professor of physics in that city.\nElectricity was not the only topic on which Ohm undertook research, and not the only topic in which he ended up in controversy. In\n1843\nhe stated the fundamental principle of physiological acoustics, concerned with the way in which one hears combination tones. However the assumptions which he made in his mathematical derivation were not totally justified and this resulted in a bitter dispute with the physicist August Seebeck. He succeeded in discrediting Ohm's hypothesis and Ohm had to acknowledge his error. See\n[\n10\n]\nfor details of the dispute between Ohm and Seebeck.\nIn\n1849\nOhm took up a post in Munich as curator of the Bavarian Academy's physical cabinet and began to lecture at the University of Munich. Only in\n1852\n, two years before his death, did Ohm achieve his lifelong ambition of being appointed to the chair of physics at the University of Munich.",
  "matematicos_citados_na_biografia": [
    "Martin",
    "Gymnasium",
    "Euler",
    "Laplace",
    "Lacroix",
    "Lagrange",
    "Legendre",
    "Biot",
    "Poisson",
    "Fourier",
    "Fresnel",
    "Navier",
    "Royal Society",
    "Berlin",
    "Turin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}