{
  "nome_completo": "George Waddel Snedecor",
  "nome_curto": "George Waddel Snedecor",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Snedecor/",
  "data_nascimento": "20 October 1881",
  "local_nascimento": "Memphis, Tennessee, USA",
  "data_morte": "15 February 1974",
  "local_morte": "Amherst, Massachusetts, USA",
  "summary": "George Waddel Snedecor was an American mathematician and statistician who worked on correlation.",
  "biografia": "George Waddel Snedecor\n's parents were James George Snedecor and Emily Alston Estes. James, the son of a lawyer, was born in Louisville, Mississippi in\n1855\nand also became a lawyer. He married Emily on\n20\nJanuary\n1880\nand George Waddel, the subject of this biography, was their first child. Because James had poor health, the family moved to an isolated log cabin home in Florida when George was one year old. The family lived there for five years and George's sisters, Elizabeth, Harriet and Ione, and a brother, Estes, were born there. James regained his health and changed his profession, becoming a minister in the Presbyterian Church. From\n1887\nto\n1890\nthe family lived in Dunedin, Florida but then moved to Alabama where they lived in several different villages where James was a minister at the local church. Two further brothers for George were born in Alabama; Palmer Godden in\n1891\nand James Gayle in\n1894\n. George had just begun his elementary schooling in Florida before the family moved to Alabama where he completed the rest of his schooling. From\n1894\n, the family lived on a farm near Woodlawn and James served as minister at Woodlawn Presbyterian Church from\n1899\nto\n1903\n.\nGeorge Snedecor attended Alabama Polytechnic Institute in Auburn for two years beginning in\n1899\n. He then spent two years,\n1901\nand\n1902\n, teaching at the Presbyterian Preparatory School in Salem, Alabama. During the last of these years teaching, another brother was born, Philip Alston in February\n1902\n. In\n1903\nthe family moved to Tuscaloosa, Alabama, and Snedecor continued his studies at the University of Alabama to be near his family. He majored in mathematics and physics, and graduated with a B.S. in\n1905\n. He was then appointed as an instructor at Selma Military Academy in\n1905\n, moving after two years to Austin College, Sherman, Texas, where he taught mathematics and Greek. It was while teaching at Austin College in Sherman that he met Gertrude Douglas Crosier whose mother was a dormitory matron at the College; they were married in Sherman on\n29\nDecember\n1908\n. Let us record at this point that George and Gertrude Snedecor had two sons, Edward Crosier\n(\nborn in\n1914)\nand James George\n(\nborn in\n1917)\n. In\n1910\nSnedecor left Austin College to take up an appointment in Ann Arbour as a Graduate Assistant in Physics at the University of Michigan. He also studied for a Master's Degree in physics and he was awarded the degree in\n1913\n.\nIn\n1913\nSnedecor was appointed as an Assistant Professor of Mathematics at Iowa State College and in the following year he was promoted to Associate Professor. Herbert David writes\n[\n14\n]\n:-\nHe soon found himself involved in helping research workers, especially in agriculture, in the design and analysis of their experiments. Fostering this activity was to be his life's mission.\nIn session\n1914\n-\n15\nIowa State College introduced new courses \"Probability and Least Squares\" and \"Mathematics as Applied to Social and Economic Problems.\" Five years later the two courses had become \"Statistical Method of Interpreting Experimental Data\" and \"Biometric Methods of Interpreting Agricultural Data\". Certainly up to this time Snedecor had only been involved in teaching statistics and had no publications in the topic. The change appears to be due to Henry Wallace, an agricultural graduate of Iowa State College, who gave a series of ten Saturday afternoon lectures to agricultural and biological research workers in\n1924\n.\n[\nHenry A Wallace\n(1888\n-\n1965)\nmay be better known as Vice-President of the United States in\n1941\n-\n45\nwhen Franklin D Roosevelt was President.\n]\nSnedecor was in the audience and he collaborated with Wallace to produce a\n47\n-page booklet based on Wallace's lectures. Entitled\nCorrelation and Machine Calculation\n, this became Snedecor's first publication. The authors wrote in the Preface:-\nThe rapid extension during recent years of the ideas of simple correlation has imposed their use upon many scientists not trained in the mathematical theory underlying them. The present trend in all biological sciences, as well as in economics and psychology, is still further to extend the use of correlation, broadening its scope to include the associations among more than two variables. One object of this bulletin is to present in simple un-technical language some explanation of the meaning and uses of the various correlation coefficients, simple partial and multiple. The second and principal object of the bulletin is to set forth explicit directions for the use of the usual commercial forms of calculating machines ... . in finding correlation coefficients or related constants.\nOscar Kempthorne\n[\n27\n]\nexplains the importance of Snedecor's approach to statistics:-\nSnedecor was almost unique in the U.S. and even in the world in recognizing the nature of one of the major\n20\nth\ncentury revolutions or evolutions, the recognition that interpretation of data is a remarkably difficult activity requiring integration of mathematics and some logic of analogy. Snedecor recognized that one could not merely talk about the problem from a purely philosophical viewpoint; the question is not what one should do on the basis of a philosophy of knowledge obtained from untenable axioms - but what one should do here and now with the current given question ... . How does one interact usefully with the observable world ... ?\nThis approach is clearly visible in the book which has, more than anything else, become his most significant achievement, namely\nStatistical Methods Applied to Experiments in Agriculture and Biology\n(1937)\n. Here are some extracts from the Preface which show Snedecor's aims:-\nThe beginner in experimentation too often finds himself supplied with a pair of elaborate mechanisms. In the one hand is a mass of data demanding simplification and interpretation, while in the other is a complex statistical methodology said to be necessary to research. How shall the two be geared together? Since the data can be only insufficiently utilised without statistical method, and since method is futile until applied to data, it seems strange that greater effort has not been made to unite the two. For those of some experience there are adequate texts and journal articles. It is the novice to whose needs this book is directed. ... The only mathematics used in this book is arithmetic, supplemented by enough symbolism to make the exposition intelligible. ... The easiest ideas are put first, and only one new concept is presented at a time. ... Numerous examples form an indispensable part of the presentation.\nIn\n1927\nthe Mathematics Statistical Service was founded at Iowa State College; it was led by Snedecor and his colleague A E Brandt. Tragedy struck the family, however, in\n1930\nwhen their fifteen year old son Edward died from spinal meningitis. Academically things were going exceptionally well with Snedecor's student\nGertrude Cox\ncompleting the first Master's Thesis on statistics at Iowa State in\n1931\nand, in September of the same year, Snedecor was given charge of the computing services. Also in\n1931\nhe was promoted to Professor of Mathematics. In\n1933\nthe Statistical Laboratory was founded with Snedecor as its director\n[\n14\n]\n:-\nThe laboratory's functions are described in the College Catalogue for\n1934\n-\n1935\nunder five headings: Research; Statistical Counsel; Teaching; Computation Service; and Calculating Machines. It is explained that the laboratory is not a department of instruction, but that members of its staff devote part of their time to teaching statistics in the Mathematics Department. Snedecor, Brandt and\nCox\nwere the initial faculty members of the Statistical Laboratory. Their teaching on the theory side was supplemented by other members of the Mathematics Department.\nSnedecor retired from his role in the Statistical Laboratory on\n30\nJune\n1947\n. On the occasion of his retirement, the President of Iowa State College said\n(\nsee\n[\n10\n]\n)\n:-\nProfessor Snedecor may relinquish his administrative duties with the knowledge and satisfaction that he has developed one of the most important research activities in the nation today. For this fine work he has the gratitude and thanks of every scientist.\nRetirement from the Statistical Laboratory did not mean that he was about to leave the College for he had already put in much effort towards establishing a Department of Statistics at Iowa State College and, on\n1\nJuly\n1947\n, the Department came into being. Snedecor was appointed professor in the Department of Statistics, serving until\n1958\n. In\n1950\nhe published another important book\nEveryday Statistics - facts and fallacies\n. Tippett writes in his review\n[\n37\n]\n:-\nProfessor Snedecor has in mind the layman and so he introduces each bit of statistics in terms of some everyday problem, and explains the ideas underlying the statistical approach in everyday terms. And what a fascinating set of problems they are! Teachers and lecturers will value this feature of the book. The exposition is unhurried and the working of the illustrative examples carried through step by step, with full explanation of the meaning of each step. The author takes the reader on a series of excursions of rather exciting discovery.\nDespite this praise, Tippett had his worries:-\n... the reviewer has doubts that he cannot still. Although \"no mathematics beyond elementary algebra is required\" and \"the attempt is made to present the logic of the science with only so much mathematical symbolism as is necessary for clarity,\" the \"lay reader\" has to learn, and learn quickly, a formidable amount of what he must regard as jargon.\nCertainly the book did not prove anything like as popular as\nStatistical Methods\n.\nYou can see more about Snedecor's books at\nTHIS LINK\n.\nLeaving Ames after he retired from Iowa State College in\n1958\n, Snedecor and his wife moved to San Diego, California. Although he was now\n77\nyears old he still wanted to give of his skills and in\n1959\nhe took up a consulting position at the United States Navy Electronics Laboratory. Indeed he had a great deal to give to the Laboratory and he collaborated, particularly with E R Anderson, on analysing data from experiments in oceanography and underwater acoustics. In\n1963\nSnedecor left his consulting position at the Navy Electronics Laboratory so that he could look after his wife who had become seriously ill. By\n1965\nSnedecor's own health was also failing and he took a heavy blow when his wife had a stroke in June\n1966\nfalling into a coma which she never came out of; she died in September\n1966\n. Snedecor himself suffered a stroke in February\n1968\nand was not expected to recover. He did, however, make a partial recovery and was well enough to live for two years from\n1971\nto\n1973\nwith his son James in Amherst. He spent the final year of his life in the Amherst Nursing Home.\nSnedecor received many honours from Iowa State College including an honorary D.Sc. in\n1958\nand, in\n1969\n, the building at the College which houses the Statistical Laboratory and the Department of Statistics was named Snedecor Hall. He received many other honours: he was elected to the American Association for the Advancement of Science in\n1933\n, to the\nAmerican Statistical Association\nin\n1939\n, to the Institute of Mathematical Statistics in\n1942\n, to the International Statistical Institute in\n1950\n, an Honorary Fellow of the British\nRoyal Statistical Society\nin\n1954\n, and an Honorary Life Member of the International Biometrics Society in\n1971\n. He served as President of the\nAmerican Statistical Association\nin\n1947\nand he was awarded the\nSamuel S Wilks\nMemorial Medal in\n1970\n. The citation for this Medal reads:-\nTo George W Snedecor for his pioneer contributions in the development and use of statistical methods, including applications of experimental design to research investigations, and for introducing several generations of statisticians and research workers to the subject statistics through teaching and the six editions of his world-renowned book, 'Statistical Methods'.\nThis was not the last edition of\nStatistical Methods\n, however, for in\n1989\nan eighth edition appeared. It states in the Preface:-\nThe first edition of this book was published in\n1937\nwith George W Snedecor as the sole author. Snedecor asked\nWilliam G Cochran\nto do the revisions for the sixth edition, and\nCochran\nwas listed as the second author of the sixth and seventh editions. The present edition was prepared by several members of the Department of Statistics at Iowa State University. The revisions were guided by the principle that the work should remain the work of its original authors; thus, much of the material remains as previously published.\nFinally we mention the tribute paid to him by the publication of the book\nStatistical papers in honor of George W Snedecor\n(1972)\n. Ted Bancroft edited the volume and wrote in the Preface:-\nThis volume is presented as a tribute to George Waddel Snedecor, founder and first director of the Statistical Laboratory at Iowa State University. Its contributors include friends, former students, and former colleagues of Professor Snedecor - able statisticians who were asked to select their own topics and provide their own scientific refereeing. ... we believe that this collection will be of interest to statisticians and scientists who know Professor Snedecor personally and to those who have become acquainted with him through various editions of his outstanding book, 'Statistical methods'. Together, these groups should include nearly every statistician and many scientists in the world, for the impact of George Snedecor's statistical work on many scientific investigations in various fields is indeed worldwide.\nMore information about these books is at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Gertrude Cox",
    "Cox",
    "THIS LINK",
    "American Statistical Association",
    "Royal Statistical Society",
    "Samuel S Wilks",
    "William G Cochran",
    "Cochran"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}