{
  "nome_completo": "George Frederick Oster",
  "nome_curto": "George Oster",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oster/",
  "data_nascimento": "20 April 1940",
  "local_nascimento": "New York City, New York, USA",
  "data_morte": "15 April 2018",
  "local_morte": "Berkeley, California, USA",
  "summary": "George Oster was an American biophysicist who worked in a range of scientific fields and was extremely successful in mathematical modelling of biological mechanisms that led to major advances in population, evolutionary, developmental, and molecular biology.",
  "biografia": "George Oster\nwas the son of Jack Henry Oster\n(1902\n-\n1964)\nand Margaret Helen Failing\n(1916\n-\n1999)\n. Jack Oster was born\n7\nSeptember\n1902\nin Montgomery County, Alabama. The Oster family were originally Polish with Jack's grandfather Israel Oster, who was born in Poland in\n1866\n, emigrating to the United States. Jack became a marine engineer working on oil tankers. Margaret Failing was born on\n15\nMay\n1916\nin Hornell, Steuben County, New York and attended New York University. Jack and Margaret Oster were married on\n23\nJanuary\n1937\nin Harrison, New York. They had two children, George Oster, the subject of this biography, born\n20\nApril\n1940\n, and Susan M Oster born\n22\nJanuary\n1944\n.\nThe family lived in Hempstead, on Long Island, New York, and it was there that George attended High School. He was just approaching his graduation from the High School in\n1957\nwhen his father lost his job. This meant that there was no way that the family could afford college fees for George. The United States Merchant Marine Academy was situated at Kings Point on the Great Neck Peninsula in North Hempstead on the north shore of Long Island, close to where the Oster family lived. The Academy trained its students in all the subjects important to the task of running a large commercial ship, for example there were courses on knot tying and marine seamanship. Perhaps, most importantly given the financial position of the family, students paid no fees. There was another attraction to the young Oster in that the second year of the\n4\n-year course was spent as a cadet on regular American merchant ships providing a chance to see the world. Indeed he did see the world serving on freighters and tankers which called at ports in many countries including Casablanca and Morocco and let him visit Trieste in Italy and Rio de Janeiro in Brazil. It did not, however, set him up for a career that suited him; he explained\n[\n12\n]\n:-\n... it turned out not to be a happy experience. I didn't really fit in at the Academy. I realised that my father was right when he told me that most things in life 'tell' better than they 'live'. So although I had a lot of 'sea stories' to tell, I didn't always like being there. Sailing itself was mostly very boring.\n[\nAn aside by EFR: This reminds me of my grandfather who was in the Royal Navy. He was always singing the song which begins \"We joined the navy to see the world. And what did we see? We saw the sea.\"\n]\nWhen he graduated in\n1961\nhe decided to look for a different career and applied to enter Columbia University to study for a doctorate in nuclear engineering. Despite not having the necessary undergraduate background, the Department was keen for students and he was accepted. He had to spend much of his first year studying undergraduate material. He said\n[\n12\n]\n:-\nThe professors who interviewed me were amused by my transcript. They saw that I had courses like knot tying and marine seamanship. Nevertheless, they admitted me on probation, and I had to make up much of an entire undergraduate education during the first year.\nHe also had to find a source of income to pay the course fees and he did this by sailing during the summers. On\n31\nJanuary\n1963\nhe was added to the register of commissioned and warrant officers of the United States Naval Reserve.\nCharles Francis Bonilla had studied chemical engineering and became professor of chemical engineering at Columbia University in\n1948\n. From\n1960\nhe became professor of nuclear engineering at Columbia and he became Oster's Ph.D. advisor. Oster enjoyed the mathematical aspects of his studies but was less enthusiastic about the applications. He said\n[\n12\n]\n:-\nI learned how to design reactors, which I didn't find much more interesting than sailing on ships.\nIn\n1964\nhe was awarded a graduate fellowship from the Atomic Energy Commission and no longer needed to earn money over the summers. He spent a summer at the Lawrence Berkeley National Laboratory in the hills of Berkeley, California, working on plasma physics. He loved the Bay Area and aimed to find a way to return to the area if at all possible. In\n1967\nhe was awarded a Ph.D. by Columbia University for his\n64\n-page thesis\nHigh temperature saturated liquid and vapor densities and the critical point of caesium\n.\nDeciding that nuclear engineering was not for him and keen to return to Berkeley, Oster applied to do a Ph.D. in biophysics at the University of California, Berkeley. Not realising that he already had a Ph.D. he was accepted and, he explained\n[\n12\n]\n:-\n... then when I got there, and they saw that I had a Ph.D., it was too late for them to say no.\nA turning point came when he met Aharon Katchalsky, a Polish born Israeli scientist who had adopted the name Aharon Katzir after emigrating to Israel. Oster met him when he was visiting the department of medical physics and biophysics at Berkeley where he was advising Alan Perelson's Ph.D. thesis in biophysics. Oster said after one year working on biophysics\n[\n16\n]\n:-\n... the singular event in my professional life happened: I found a mentor, Aharon Katchalsky, who was a visiting professor at Berkeley at the time and was looking for a student who knew something about thermodynamics. I had taught thermodynamics at Columbia during graduate school, and that gave me the hubris to approach Katchalsky, who was recognised as one of the great experts in the field. He must have seen through my pretences immediately, but he was a kind man and, for reasons I'll never really understand, he took me back to the Weizmann Institute as a postdoc. That was the turning point in my professional life. I believe that, for most scientists, a mentor is nearly indispensable; it surely was for me, and I could not have imagined a better one than Katchalsky. All I ever became as a scientist I owe to his influence and inspiration. Tragically, shortly after my postdoctoral stint, he was murdered at the Tel Aviv airport by terrorists as he was returning to become President of Israel.\nOster assisted Katzir in the work he was undertaking on the thermodynamics of biological networks. With Alan Perelson and Aharon Katzir, Oster published\nNetwork Thermodynamics\nin\nNature\nin\n1971\n. Also in\n1971\nhe published, with David M Auslander, the paper\nTopological representations of thermodynamic systems - I. Basic concept\ns and the single author follow-up paper\nTopological representations of thermodynamic systems - II. Some elemental subunits for irreversible thermodynamics.\nThe Abstract of the first paper begins:-\nThis paper describes the development of a generalised topological representation for thermodynamic systems. The elements and topology of the representation provide a conceptual reticulation of the real system into elements drawn from a set of ideal, but physically realisable, lumped-parameter components. The representation is in the form of bond-graph notation.\nBy the time Katzir was assassinated in May\n1972\n, Oster was back at Berkeley where he had been appointed to a\n2\n-year position in the Department of Mechanical Engineering. He had been working on a major paper\nNetwork thermodynamics: dynamic modelling of biophysical systems\nwith Alan Perelson and Aharon Katzir and the\n135\n-page paper was published in\n1973\n. Oster gives his address on the paper as Donner Laboratory, Lawrence Berkeley Laboratory, University of California, Berkeley. The Donner Laboratory is a division of the Lawrence Berkeley Laboratory named for William H Donner, at one time president of the Donner Steel Corporation, who provided the funds for building the laboratory which specialises in nuclear medicine. Here is an extract from the Introduction to the above\n1973\npaper:-\nThe thrust of modern biology is toward the investigation of increasingly complex structures. It has become almost a cliché to acknowledge that living entities are extremely complicated, heterogeneous, non-linear systems. They are based on a subtle interplay between the energetic rate processes of transport, reaction and conformational change, on the one hand, and cybernetic flows of information, whose regulatory effects are not proportional to their energetic level, on the other. The theory outlined in this paper is designed specifically for the treatment of coupled, non-linear, time-dependent thermodynamic processes in heterogeneous media and is also capable of incorporating non-energetic, informational flows. The general formalism employs a simple and intuitive graphical notation which emphasises the topological relations of the system under consideration.\nOster's work won him the Louis E Levy Prize from the Franklin Institute on two occasions. He was awarded the prize in\n1973\nfor an \"Outstanding paper in Journal of the Franklin Institute for\n1971\n\", namely\nTopological representations of thermodynamic systems.\nIn\n1976\nhe again won the Louis E Levy Prize, this time for his paper\nDynamics of Interacting Populations\nin the\nJournal of the Franklin Institute\nfor\n1974\n. The paper has the Abstract:-\nA biological population can be viewed as a distributed parameter dynamical system. The dynamics of host-parasite systems are investigated by coupling populations via age specific interactions; analysis and simulation results are compared with experiments performed on a laboratory ecosystem. A number of novel dynamical effects emerge from the model which have some interesting ecological consequences.\nThese prize winning papers did not please the Department of Mechanical Engineering at Berkeley, however, as they considered them to be on a topic not relevant to the Department. They decided not to renew his contract but, before he left Berkeley, another opportunity opened up\n[\n16\n]\n:-\nThe entomology department at Berkeley offered Simon Levin a position as their resident mathematical population biologist and, when he turned it down, he suggested they ask me. They hired me, and so I became a population biologist. Moving to a biology department turned out to be the best professional decision I ever made. It forced me to teach biology students and absorb the culture of biologists that values experiments and solving particular problems far more than general theories. In biology, I've learned, it's easier to make a theory of everything than a theory of something.\nThroughout his career, Oster has moved from topic to topic as different opportunities arose. Let us quote his own description of how this happened\n[\n16\n]\n:-\nThe summer after taking the job in population biology I met Ed Wilson in a bar at Woods Hole, and that led to a book on ant castes. While working with Ed, I met\nBob May\nat a Gordon Conference, and that led to our work on population chaos. Later, at another Gordon Conference, I heard Beth Burnside lecture on embryology and that evening I met Garry Odell. Together we started working on a model for gastrulation, and that launched my morphogenesis period. About then my new graduate student, Pere Alberch, saw the connections between our morphogenesis models and evolutionary trends, and that led to my work in 'evo-devo'. Then I met\nJim Murray\n, who invited me to Oxford for a sabbatical because he was interested in morphogenesis too. That led to more developmental biology modelling and pattern formation, and to cell motility. From there it was but a short jump to modelling molecular motors. A chance meeting with Dale Kaiser at a conference led me into modelling bacterial locomotion and pattern formation. It seems that, as I grew older, my horizons contracted to smaller things rather than, as is more typical, expanded to larger issues.\nLet us say a little more about a couple of these collaborations. His work with\nRobert May\nresulted in their joint paper\nBifurcations and Dynamic Complexity in Simple Ecological Models\nwhich was published in\nThe American Naturalist\nin\n1976\n. The paper has the following Abstract:-\nMany biological populations breed seasonally and have nonoverlapping generations, so that their dynamics are described by first-order difference equations,\nN\nt\n+\n1\n=\nF\n(\nN\nt\n)\nN_{t+1} = F(N_{t})\nN\nt\n+\n1\n​\n=\nF\n(\nN\nt\n​\n)\n. In many cases,\nF\n(\nN\n)\nF(N)\nF\n(\nN\n)\nas a function of\nN\nN\nN\nwill have a hump. We show, very generally, that as such a hump steepens, the dynamics goes from a stable point, to a bifurcating hierarchy of stable cycles of period\n2\nn\n2^{n}\n2\nn\n, into a region of chaotic behaviour where the population exhibits an apparently random sequence of \"outbreaks\" followed by \"crashes.\" We give a detailed account of the underlying mathematics of this process and review other situations\n(\nin two- and higher dimensional systems, or in differential equation systems\n)\nwhere apparently random dynamics can arise from bifurcation processes. This complicated behaviour, in simple deterministic models, can have disturbing implications for the analysis and interpretation of biological data.\nAn interesting quote from that paper is the following:-\n... it could be argued that a study of very simple nonlinear difference equations ... should be part of high school or elementary college mathematics courses. They would enrich the intuition of students who are currently nurtured on a diet of almost exclusively linear problems.\nTheir joint work also led to the paper\nPeriod doubling and the onset of turbulence: an analytic estimate of the Feigenbaum ratio\n(1980)\n.\nThe other collaboration that we single out for a mention is with\nJim Murray\n. Together they studies pattern formation and morphogenesis and wrote a whole series of papers in the\n1980\ns, for example\nGeneration of Biological Pattern and Form\n(1984)\nand\nPattern formation models and developmental constraints\n(1989)\n. The Abstract of the\n1989\npaper is as follows:-\nMost schemes for embryonic pattern formation are built around the notion of lateral inhibition. Models of this type arise in many settings, and all share some common characteristics. In this paper we examine a number of pattern formation models and show how the phenomenon of lateral inhibition constrains the possible geometries that can arise.\nWe should note that several of the joint papers of Oster and Murray also have\nPhilip Maini\nas a co-author.\nMaini\n, who went on to do outstanding work in modelling processes in biology and medicine, was a student of\nMurray\n's at the University of Oxford and worked with Oster when he made a research visit to the Centre for Mathematical Biology at Oxford.\nMichele Meltzer writes in\n[\n19\n]\n:-\nOster's intervention into the assumed divide between mathematical physics and biology epitomised his creative and cross-disciplinary approach to scientific research. Oster also developed mathematical models to quantitatively explore biological mechanisms, transforming scientists' understanding of biomolecules and their systems.\nThe authors of\n[\n11\n]\nwrite:-\nGeorge Oster often said that people are what is most important in science. He always pulled together a very interdisciplinary set of students and postdocs as diverse as molecular cell biology, physics, mathematics, engineering and chemistry. He inspired so many with his brilliance, enthusiasm, and passion for science and life. Generations of students, friends, and colleagues will never forget the fountains of ideas gushing out of him in the Brewed Awakening café on\nEuclid\nAvenue at the edge of the Berkeley campus, where George held informal group meetings almost every morning. George was also a generous mentor both professionally and personally to his students and postdocs in their advancement. He also served for more than two years on the Berkeley Division of the Academic Senate's Library Committee\n(2008\n-\n2011)\n, helping colleagues from across campus to see how digital tools where changing the way the academy expanded knowledge. He retired from the University of California Berkeley in\n2016\n.\nOster's innovative work earned him much international recognition. The Guggenheim Foundation and the MacArthur Foundation made him awards, see\n[\n3\n]\nand\n[\n4\n]\nrespectively. He was also awarded the Weldon Memorial Prize by Oxford University in\n1992\n, the Winfree Prize by the Society for Mathematical Biology in\n2009\nand the Raymond and Beverly Sackler International Prize in Biophysics in\n2014\n:-\nFor discovery of physical principles behind intracellular force generation in cell motility, morphogenesis and biological pattern formation.\nHe was elected to the\nNational Academy of Sciences\nin\n2004\nand the\nAmerican Academy of Arts and Sciences\nin\n2006\n.\nAlex Mogilner was one of Oster's postdoctoral students. He said\n[\n11\n]\n:-\nOster was very fortunate to be a part of the great generation of scientists who had audacity and freedom to move between disciplines. Early in his career, he worked on pathbreaking mathematical models of population dynamics and developed the first detailed theories of caste evolution among social insects\n(\nwith Edward O Wilson\n)\nas well as theories of bifurcations to a hierarchy of periodic oscillations and chaos in simple ecological models\n(\nwith\nRobert May\n)\n. ... He was one of the first biophysicists who 'married' experiment and theory by developing computational models of a bewildering variety of molecular machines …\n[\nHe\n]\nestablished a now common approach to solving biological puzzles by iterative cycles of modelling and experimentation. ... It would not be an exaggeration to say that Oster more than any other physicist or mathematician inspired our current understanding of molecular motors. ...\n[\nHe\n]\npioneered an important shift from conceptual to detailed and predictive mathematical models of biological systems.\nMogilner spoke about how fortunate he was to have known and worked with Oster\n[\n8\n]\n:-\n[\nGeorge was\n]\na warm man who radiated the joy of doing science. He will be sorely missed by the scientific community and by his many friends who have been lucky to bask in the light of George's mind.\nOster himself said in a\n2006\ninterview\n[\n12\n]\n:-\nWhen I was coming up, things were a lot looser, jobs were easier. Now it's quite tight, and I think that people have to specialise in ways that I didn't have to. It's hard to get away with being a dabbler like me these days. I'm amazed at how lucky I've been. ... I think I just met the right people at the right time and worked on the right problems. I think of my career as a sequence of lucky accidents, of meeting people who were really smart. In fact, I think the story of my professional life is being able to work with people smarter than I am. ... When I was sailing in the engine room of ships, sweating, cursing my lot, and drinking coffee, not in a million years did I think I would be here. I remember Rod Laver, the tennis champion, once said to a reporter, 'I can't believe they pay me to do this.' Every day I look up at the Berkeley hills, and that's the way I feel. It is so much fun that I would pay them to do it. The idea that I would end up in Berkeley as a professor, let alone in the\nNational Academy\n? It never crossed my mind.\nThe paper\n[\n7\n]\nis by those who worked with Oster. The twelve authors say that they all:-\n... agree that his sharp intellect, physical intuition, and passion for scientific inquiry not only inspired us as scientists but also greatly influenced the way we conduct research.\nThe paper is full of information about Oster's influence on those working with him. Here is a paragraph from the Introduction:-\nThose of us who were lucky enough to work with George were forever shaped by his tenacious drive to understand the mechanisms underlying diverse biological phenomena. George often quoted Aharon Katchalsky, his postdoc advisor at Weizmann: \"It is easier to make a theory of everything, than a theory of something.\" Modelling a biological system is indeed a daunting task and the \"theories of something\" that we have so proudly produced were sometimes invalidated by subsequent experiments. George, however, always insisted that despite the difficulties, we must focus on modelling specific systems because this modelling approach was more useful for advancing our knowledge of biology. Although validation by subsequent experiments was certainly rewarding, contradiction motivated us to revise and improve our models. With each iteration, we learned something new and got closer to the truth. While we worked with George, we became disciples of his approach to science. Now, as independent investigators, we try to continue his legacy by exposing our trainees to his style of research.\nAlthough his work was frequently based on applying mathematics and physics to biology, he spoke in the interview\n[\n16\n]\nabout its limitations:-\nQuite a few mathematical fads have burst onto the popular press, promising great new insights into biology: information theory, catastrophe theory, chaos theory, and most recently complexity theory, to name just a few. All were quite useful in their founding fields\n(\nexcept complexity, which has proven slippery to even define\n)\n, but all failed to live up to their hype, and faded from the public eye, slinking back to the specialties where from they arose, and where they still prove quite useful. But none has really contributed much to biology. As for chaos, it is a mathematical phenomenon that biologists were well advised to be aware of: that deterministic models could mimic random variation in some ways. But beyond that, I can't see that it has provided any startling biological insights. In physics and chemistry, mathematical phenomena have occasionally found amazing correspondences in the real world, but this has not happened very much in biology, where biological truths are not found in mathematics, but in measurements. Someday this may change, but I don't foresee it happening any time soon.\nWhen at the peak of his career, he was struck down with Lewy body Parkinson's disease. After a long struggle it took his life at the age of\n77\n.\nFinally let us note that Oster's daughter, Liya Oster, studied at the University of California, Los Angles, from\n2014\nto\n2018\nand was awarded a Bachelor of Science degree\nMagna Cum Laude\nin\n2018\n. She was awarded the \"Highest Honors in Biophysics\" and the \"Richard Kaplan Award in Biological Physics\". Since\n2018\nshe has been undertaking research for her doctorate in the Bioengineering Department of the University of California, Berkeley, and\n(\nin April\n2024)\nalready has four publications.",
  "matematicos_citados_na_biografia": [
    "Bob May",
    "Jim Murray",
    "Robert May",
    "Philip Maini",
    "Maini",
    "Murray",
    "Euclid",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences",
    "National Academy"
  ],
  "imagens": [
    "oster.jpg"
  ]
}