{
  "nome_completo": "Georges Henri-Joseph-Edouard Lemaître",
  "nome_curto": "Georges Lemaître",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lemaitre/",
  "data_nascimento": "17 July 1894",
  "local_nascimento": "Charleroi, Belgium",
  "data_morte": "20 June 1966",
  "local_morte": "Charleroi, Belgium",
  "summary": "Georges Henri Joseph Édouard Lemaître was a Belgian mathematician and astronomer who worked on the theory of an expanding universe.",
  "biografia": "Georges Lemaître\n's parents were Joseph Lemaître and Maguerite Lannoy. In\n1911\nhe entered the Catholic University of Louvain to study for a degree in engineering. However in\n1914\n, while he was still an undergraduate, World War I broke out. He volunteered and served as an artillery officer in the Belgian army. He was decorated for bravery, receiving the Military Cross, but the dreadful carnage he had seen on the battlefields troubled him deeply and changed his life. After the war ended he returned to his university studies but his interests now moved away from engineering and towards mathematics. He graduated with the degree of Docteur en Sciences in mathematics in\n1920\nafter submitting his thesis\nl'Approximation des fonctions de plusieurs variables réelles\nⓉ\n(\nApproximation of functions of several real variables\n)\nwritten under guidance from\nde la Vallée Poussin\n.\nAnother change in his life brought about by his wartime experiences came about when he enrolled at the Maison Saint Rombaut, a seminary of the Archdiocese of Malines, and was ordained in\n1923\n, becoming Abbé Lemaître. Now, with the strong mathematical background obtained from his studies with\nde la Vallée Poussin\n, Lemaître turned towards mathematical astronomy and went to Cambridge in England where he studied with\nEddington\nduring the academic years\n1923\n-\n24\n, then he went to the United States spending the next academic year at the Harvard College Observatory in Massachusetts. In\n1925\nhe accepted a position as a part-time lecturer at the Catholic University of Louvain in Belgium but continued to spend time at Harvard and at the Massachusetts Institute of Technology in the United States. He was awarded a Ph.D. in\n1927\nfor his thesis\nThe gravitational field in a fluid\nsubmitted to MIT. His supervisor at MIT had been\nHarlow Shapley\n. The research he had undertaken, partly at Harvard, partly at MIT and partly at Louvain, was written up as\nUn Univers homogène de masse constante et de rayon croissant rendant compte de la vitesse radiale des nébuleuses extragalactiques\nⓉ\n(\nA homogeneous Universe of constant mass and growing radius accounting for the radial velocity of extragalactic nebulae\n)\nand published in the\nAnnales de la Société Scientifique de Bruxelles\nin\n1927\n.\nIn this groundbreaking paper Lemaître derived what is now known as\nHubble\n's Law relating the speed with which a galaxy is moving away to its distance. In\n1927\nthe famous Solvay Conference was held and most of the leading physicists attended.\nEinstein\nwas at the conference and he spoke to Lemaître in Brussels telling him that the ideas in his\n1927\npaper had been presented by\nFriedmann\nin\n1922\n, but he also said that although he thought Lemaître's solutions of the equations of general relativity were mathematically correct, they presented a solution which was not feasible physically.\nEinstein\nsaid:-\nYour calculations are correct, but your grasp of physics is abominable.\nEinstein\nwas not alone in finding Lemaître's ideas totally unacceptable; rather this was the opinion of almost all scientists. However in\n1929\nHubble\npublished work presenting considerably more evidence of an expanding universe, contradicting the then accepted theory of a static universe.\nEddington\nand other members of the\nRoyal Astronomical Society\nbegan to undertake work to try to solve the problem brought about by the discrepancy between theory and observation. Lemaître then sent a copy of his\n1927\npaper to\nEddington\nwho immediately saw that it provided an explanation.\nEddington\narranged for an English translation of Lemaître's paper to be published in the\nMonthly Notices of the Royal Astronomical Society\nand indeed it appeared there in March\n1931\n. There was still a part of Lemaître's theory that scientists, including\nEddington\n, found impossible to accept, namely the implication that the universe had a beginning at a finite time in the past. Almost all wanted to believe that the universe had always existed. We leave it to the reader to ponder the thought that perhaps Lemaître's deep Christian beliefs made the thought that the world began at a finite time in the past\n(\nas the book of Genesis claims\n)\nmore easily accepted.\nLemaître responded to the objections against his theory in a paper published in\nNature\nin May\n1931\n. He wrote:-\nIf the world has begun with a single quantum, the notions of space and time would altogether fail to have any meaning at the beginning; they would only begin to have a sensible meaning when the original quantum had been divided into a sufficient number of quanta. If this suggestion is correct, the beginning of the world happened a little before the beginning of space and time.\nThis was the first explicit formulation of the currently accepted 'big bang' theory. We should note that, although accepted by most scientists,\nFred Hoyle\ndid not accept this theory and the term 'big bang' was\nHoyle\n's scornful description of Lemaître's theory in a\n1950\nradio broadcast. In\n1933\nEinstein\nand Lemaître gave a series of lectures in California. After listening to Lemaître explain his theory in one of these seminars,\nEinstein\nstood up and said:-\nThis is the most beautiful and satisfactory explanation of creation to which I have ever listened.\nLemaître published a more detailed version of his theory in\nL'univers en expansion\nⓉ\n(\nThe expanding universe\n)\nin\n1933\n. An English translation of this paper by M A H MacCallum was published in\n1997\n. The ideas presented in his\n1933\npaper reached the popular press who described him as the world's leading cosmologist. An article in the\nNew York Times\nfeatured a photograph of\nEinstein\nand Lemaître with a caption:-\nThey have a profound respect and admiration for each other.\nOf course, the fact that Lemaître was both a leading scientist and a Catholic Priest was part of the fascination that the popular press had. In the same article, the author wrote:-\n'There is no conflict between religion and science,' Lemaitre has been telling audiences over and over again in this country .... His view is interesting and important not because he is a Catholic priest, not because he is one of the leading mathematical physicists of our time, but because he is both.\nHonours from several different sources came his way such as the Francqui Prize in\n1934\n. This prize, presented to Lemaître by King Léopold III, was the highest scientific honour that Belgium could bestow. In\n1936\nhe was inducted into the\nPontifical Academy of Sciences\nby Pope Pius XI. He was elected member of the\nRoyal Academy of Sciences and Arts of Belgium\nin\n1941\n, became the first to be awarded the\nEddington\nMedal by the\nRoyal Astronomical Society\nin\n1951\n, and he served as President of the\nPontifical Academy of Sciences\nfrom\n1960\nto\n1966\n.\nLemaître had been appointed Professor at Louvain in\n1927\nand remained there for the rest of his career. Let us look at a few of his later publications, particularly those of a more mathematical nature. In\n1942\nhe published\nL'itération rationnelle\nⓉ\n(\nRational iteration\n)\nin which he discussed\nGauss\n's method of successive approximations applied to a system of two equations in two unknowns to determine the orbit of a planet from three observations. Lemaître then applied these ideas to accelerate the orthodox process of iteration, taking the\nPicard\niterative solution of first order differential equations as an example. He applied the same techniques in another paper published in the same year, namely\nIntégration d'une équation différentielle par itération rationnelle\nⓉ\n(\nIntegration of a differential equation with rational iteration\n)\n. In\nSur un cas limite du problème de Stormer\nⓉ\n(\nOn a limiting case of Stormer's problem\n)\n(1945)\nhe studied trajectories of an electron in the neighborhood of lines of force of a magnetic dipole field, then returned to his study of numerical solutions to first order differential equations in\nInterpolation dans la méthode de Runge-Kutta\nⓉ\n(\nInterpolation in the Runge-Kutta method\n)\n(1947)\n. In\n1948\nhe published a paper applying mathematical techniques to a problem in astronomy publishing\nModèles mécaniques d'amas de nébuleuses\nⓉ\n(\nMechanical models of clusters of nebulae\n)\n. B L J Bok writes in a review of this paper:-\nThe author is concerned with the problem posed by the existence of large random velocities for the individual members of clusters of galaxies. Is it possible to account for the existence of more or less permanent concentrations of galaxies in which no single galaxy remains long in the same place? The two-fold purpose of the paper is to delineate the underlying mechanical model and to write down the fundamental equations of the problem. It is shown how these equations can be applied toward the solution of the well-known problem of uniform distribution in a homogeneous, expanding universe.\nAnother paper published in the same year\nModèles de nébuleuses à vitesses radiales\nⓉ\n(\nModels ofnebulae with radial velocities\n)\n, this time jointly with R Vander Borght, is concerned with the study of equilibrium configurations for stellar systems with radial symmetry and in which only radial and no transverse velocities are permitted. In\n1949\nhe returned to his study of an expanding universe in\nCosmological application of relativity\n.\nH P Robertson\nwrites:-\nThe paper opens with a rapid expository review of the general relativity theory of gravitation, including discussion of kinematics, conservation laws, spherical symmetry, and the solutions of\nSchwarzschild\nand\nde Sitter\nin terms of comoving coordinates. There follows an account of the homogeneous expanding universe models of\nFriedmann\n, with specialization to the type demanded by red-shift and time-scale observations. The remaining third of the paper is concerned with effects of inhomogeneities in the model, with a brief account of author's hypotheses and predictions concerning the origin of cosmic rays, their condensation into clouds, formation of nebulae and clusters of nebulae, and offers an explanation of the prevalence of hydrogen and helium as materialization of kinetic energy.\nLemaître taught less through the\n1950\ns but continued to publish on the same topics that had interested him in the\n1940\ns. His papers include\nApplication des méthodes de la mécanique céleste au problème de Stormer\nⓉ\n(\nApplication of methods of celestial mechanics to the  Stormer problem\n)\n(1950)\n,\nModèles mécaniques d'amas de nébuleuses\nⓉ\n(\nMechanical models of clusters of nebulae\n)\n(1951)\n,\nCoordonnées symétriques dans le problème des trois corps\nⓉ\n(\nSymmetric coordinates in the three-body problem\n)\n(1952)\n, and\nRégularisation dans le problème des trois corps\nⓉ\n(\nRegularization in the three-body problem\n)\n(1954)\n. However, a new interest came into Lemaître's research related to the introduction of computers into mathematical research. He developed computer languages, proposed new calculating techniques, and continued his interests in computational mathematics. Some papers on calculating are\nComment calculer?\nⓉ\n(\nHow to calculate?\n)\n(1954)\nin which he proposes that paper and pencil computing be replaced by paper and typewriter. Instead of using the Arabic numerals\n0\n-\n9\nhe proposes that the four letters\ni, j, k, l\nwhich lie within easy reach of the right hand be used to give a peculiar binary coded decimal representation. In\nPourquoi de nouveaux chiffres?\nⓉ\n(\nWhy new figures?\n)\n(1955)\nhe discusses the shortcomings of the decimal system and even the Arabic digits. Certain advantages of the binary system are stressed such as the fact that it takes the fun out of playing Nim. His argument against the Arabic numerals is given again in\nWhy new digits?\n(1955)\n. He stresses the advantages of the binary system in\nLe calcul élémentaire\nⓉ\n(\nElementary calculation\n)\n(1956)\n. His arithmetical architecture is discussed by Lipnik in\n[\n12\n]\n.\nLemaître retired in\n1964\nwhen he was made professor emeritus. He continued to publish interesting papers, such as\nThe expansion of the Universe\n(1967)\n, and\nThe principle of continuity according to Jean-Victor Poncelet\n(1967)\n. We end this biography by quoting from a review by R N Tiwari of\n[\n5\n]\nsince in many ways it provides both a summing up of Lemaître's contributions, but poses some fascinating questions for the reader to consider:-\nLemaître graduated in engineering, and his studies were interrupted due to World War I. He joined the army and, to quote from the author's statement, \"after\n53\nmonths of war ordeals and military camps, he lost interest in a professional career and decided to become a priest\"; this ultimately resulted in a change from engineering to the mathematical sciences, particularly to general relativity, which marked a very notable turning point in Lemaître's life. Whether this change of mind was due to war or the seed of such a thought was inherent in him and germinated at the appropriate time, and whether the environment of the Church and its a priori principles had any influence on his scientific discoveries\n(\nsuch as the evolution of the universe from a primordial atom, the existence of singularity at the initial epoch, etc.\n)\ncannot be inferred conclusively. The sequence of events narrated by the author shows, however, that time and again Lemaître was accused\n(\nespecially by\nEinstein\n)\nof using scientific reasonings \"to defend a\n(\nreligious\n)\ndogma of the Church\". Was it really so? Was Lemaître the scientist being guided by Lemaître the Catholic priest? The author leaves these points for readers to decide for themselves. However, he remarks that \"for modern scientific cosmologists, although they may feel uneasy about this primordial singularity, the objectivity of the thinking of its initiator is beyond doubt\".",
  "matematicos_citados_na_biografia": [
    "de la Vallée Poussin",
    "Eddington",
    "Harlow Shapley",
    "Hubble",
    "Einstein",
    "Friedmann",
    "Royal Astronomical Society",
    "Fred Hoyle",
    "Hoyle",
    "Pontifical Academy of Sciences",
    "Royal Academy of Sciences and Arts of Belgium",
    "Gauss",
    "Picard",
    "H P Robertson",
    "Schwarzschild",
    "de Sitter"
  ],
  "imagens": [
    "lemaitre.jpg"
  ]
}