{
  "nome_completo": "Georg Faber",
  "nome_curto": "Georg Faber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faber/",
  "data_nascimento": "5 April 1877",
  "local_nascimento": "Kaiserslautern, Germany",
  "data_morte": "7 March 1966",
  "local_morte": "Munich, Germany",
  "summary": "Georg Faber was a German mathematician whose most important work was on the polynomial expansion of functions.",
  "biografia": "Georg Faber\nstudied mathematics and physics at the universities of Munich and Göttingen between\n1896\nand\n1901\n. In\n1902\nhe received a doctorate from the Ludwig-Maximilians University in Munich for a thesis\nÜber Reihenentwicklungen analytischer Funktionen\nⓉ\n(\nOn series expansions of analytic functions\n)\n. He received his university teaching qualification from the University of Würzburg in\n1905\n, after submitting his\nHabilitationsschrift\npresenting work on power series in several variables.\nHe worked at a number of universities, being appointed to the University of Tübingen as an extraordinary professor in\n1909\n, then a year later as an ordinary professor at the Technische Hochschule in Stuttgart.  He remained in Stuttgart until\n1912\nwhen he moved to the University of Königsberg for a year, again moving on, this time to the University of Strasbourg. He was appointed to the chair of Higher Mathematics at the Technische Hochschule in Munich in\n1916\n. This was a post he held until he retired in\n1946\n.\nFaber's most important work was on the polynomial expansion of functions. This is the problem of expanding an analytical function in an area bounded by a smooth curve as a sum of polynomials, where the polynomials are determined by the area.  These polynomials are now known as 'Faber polynomials' and first appear in Faber's\n1903\npaper\nÜber polynomische Entwickelungen\nⓉ\n(\nOn polynomial developments\n)\npublished in\nMathematische Annalen\n. Another important paper which he also published in\nMathematische Annalen\n, this time in\n1909\n, was\nÜber stetige Funktionen\nⓉ\n(\nOn continuous functions\n)\n. In this paper he introduced the 'hierarchical basis' and explicitly used it for the representation of functions. In fact Faber was building on the idea of\nArchimedes\nwho computed approximately using a hierarchy of polygonal approximations of a circle. Only in the\n1980\ns was Faber's idea seen to be an important ingredient for the efficient solution of partial differential equations.\nMost of Faber's publications are in function theory. For example in addition to the papers mentioned above his publications include:\nÜber die Fortsetzbarkeit gewisser Taylorscher Reihen\nⓉ\n(\nOn thehe continuability of certain Taylor's series\n)\n(1903)\n;\nÜber arithmetische Eigenschaften analytischer Funktionen\nⓉ\n(\nOn arithmetic properties of analytic functions\n)\n(1904)\n;\nÜber die Abzählbarkeit der rationalen Zahlen\nⓉ\n(\nOn the countability of the rational numbers\n)\n(1905)\n;\nÜber analytische Funktionen mit vorgeschriebenen Singularitäten\nⓉ\n(\nOn analytic functions with prescribed singularities\n)\n(1905)\n;\nÜber die zusammengehörigen Konvergenzradien von Potenzreihen mehrerer Veränderlicher\nⓉ\n(\nOn matching radii of convergence of power series of several variables\n)\n(1905)\n;\nÜber das Anwachsen analytischer Funktionen\nⓉ\n(\nOn the growth of analytic functions\n)\n(1907)\n;\nBeitrag zur Theorie der ganzen Funktionen\nⓉ\n(\nContribution to the theory of entire functions\n)\n(1910)\n; and\nÜber die interpolatorische Darstellung stetiger Funktionen\nⓉ\n(\nOn the interpolating representation of continuous functions\n)\n(1914)\n. However, he also edited the collected works of\nChristoffel\nand volumes\n14\n,\n15\n, and\n16\nof\nEuler\n's collected works.\nOne further achievement of Faber is worthy of mention. In\n1894\nLord Rayleigh\nmade the following claim:-\n... given a fixed area of ox-hide to make a drum, the ground tone is lowest if you make your drum circular.\nTwo mathematicians independently verified\nRayleigh\n's conjecture, Faber and Edgar Krahn.\nFaber was also interested in mathematical education and he worked with his colleague\nvon Dyck\nat Munich on the mathematical education of engineers, physicists and mathematicians. In addition to his research areas, Faber lectured on complex analysis,\nprobability theory\n, the theory of relativity and analytical mechanics.\nWhen World War II ended in\n1945\n, Faber was appointed rector of the Technische Hochschule in Munich by the government. He organised restarting teaching in the university, which happened in the spring of\n1946\n, before retiring later that year. His achievements were marked by his election to the Bavarian Academy of Sciences in\n1921\n, the award of the Order of Merit in\n1956\n, and he received the Bavarian Service medal in\n1959\n.\nFaber had many interests outside mathematics. He was a great linguist enjoying the study of both classical and modern languages, he loved music and art, and he enjoyed long walks.",
  "matematicos_citados_na_biografia": [
    "Habilitationsschrift",
    "Archimedes",
    "Christoffel",
    "Euler",
    "Lord Rayleigh",
    "Rayleigh",
    "von Dyck",
    "probability theory"
  ],
  "imagens": [
    "faber.jpg"
  ]
}