{
  "nome_completo": "George Boole",
  "nome_curto": "George Boole",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boole/",
  "data_nascimento": "2 November 1815",
  "local_nascimento": "Lincoln, Lincolnshire, England",
  "data_morte": "8 December 1864",
  "local_morte": "Ballintemple, County Cork, Ireland",
  "summary": "George Boole approached logic in a new way reducing it to a simple algebra, incorporating logic into mathematics. He also worked on differential equations, the calculus of finite differences and general methods in probability.",
  "biografia": "George Boole\n's parents were Mary Ann Joyce and John Boole. John made shoes but he was interested in science and in particular the application of mathematics to scientific instruments. Mary Ann was a lady's maid and she married John on\n14\nSeptember\n1806\n. They moved to Lincoln where John opened a cobbler's shop at\n34\nSilver Street. The family were not well off, partly because John's love of science and mathematics meant that he did not devote the energy to developing his business in the way he might have done. George, their first child, was born after Mary Ann and John had been married for nine years. They had almost given up hope of having children after this time so it was an occasion for great rejoicing. George was christened the day after he was born, an indication that he was a weak child that his parents feared might not live. He was named after John's father who had died in April\n1815\n. Over the next five years Mary Ann and John had three further children, Mary Ann, William and Charles.\nIf George was a weak child after his birth, he certainly soon became strong and healthy. George first attended a school in Lincoln for children of tradesmen run by two Misses Clarke when he was less than two years old. After a year he went to a commercial school run by Mr Gibson, a friend of John Boole, where he remained until he was seven years old. His early instruction in mathematics, however, was from his father who also gave George a liking for constructing optical instruments. When he was seven George attended a primary school where he was taught by Mr Reeves. His interests turned to languages and his father arranged that he receive instruction in Latin from a local bookseller.\nHaving learnt Latin from a tutor, George went on to teach himself Greek. By the age of\n14\nhe had become so skilled in Greek that it provoked an argument. He translated a poem by the Greek poet Meleager which his father was so proud of that he had it published. However the talent was such that a local schoolmaster disputed that any\n14\nyear old could have written with such depth. By this time George was attending Bainbridge's Commercial Academy in Lincoln which he had entered on\n10\nSeptember\n1828\n. This school did not provide the type of education he would have wished but it was all his parents could afford. However he was able to teach himself French and German studying for himself academic subjects that a commercial school did not cover.\nBoole did not study for an academic degree, but from the age of\n16\nhe was an assistant school teacher at Heigham's School in Doncaster. This was rather forced on him since his father's business collapsed and he found himself having to support financially his parents, brothers and sister. He maintained his interest in languages, began to study mathematics seriously, and gave up ideas which he had to enter the Church. The first advanced mathematics book he read was\nLacroix\n's\nDifferential and integral calculus\n. He was later to realise that he had almost wasted five years in trying to teach himself the subject instead of having a skilled teacher. In\n1833\nhe moved to a new teaching position in Liverpool but he only remained there for six months before moving to Hall's Academy in Waddington, four miles from Lincoln. In\n1834\nhe opened his own school in Lincoln although he was only\n19\nyears old.\nIn\n1838\nRobert Hall, who had run Hall's Academy in Waddington, died and Boole was invited to take over the school which he did. His parents, brothers and sister moved to Waddington and together they ran the school which had both boarding and day pupils. At this time Boole was studying the works of\nLaplace\nand\nLagrange\n, making notes which would later be the basis for his first mathematics paper. However he did receive encouragement from\nDuncan Gregory\nwho at this time was in Cambridge and the editor of the recently founded\nCambridge Mathematical Journal\n. Boole was unable to take\nDuncan Gregory\n's advice and study courses at Cambridge as he required the income from his school to look after his parents. In the summer of\n1840\nhe had opened a boarding school in Lincoln and again the whole family had moved with him. He began publishing regularly in the\nCambridge Mathematical Journal\nand his interests were influenced by\nDuncan Gregory\nas he began to study algebra.\nBoole had begun to correspond with\nDe Morgan\nin\n1842\nand when in the following year he wrote a paper\nOn a general method of analysis\napplying algebraic methods to the solution of\ndifferential equations\nhe sent it to\nDe Morgan\nfor comments. It was published by Boole in the\nTransactions of the\nRoyal Society\nin\n1844\nand for this work he received the Society's Royal Medal in November\n1844\n. His mathematical work was beginning to bring him fame.\nBoole was appointed to the chair of mathematics at Queens College, Cork in\n1849\n. In fact he made an application for a chair in any of the new Queen's Colleges of Ireland in\n1846\nand in September of that year\nDe Morgan\n,\nKelland\n,\nCayley\n, and\nThomson\nwere among those writing testimonials in support.\nDe Morgan\nwrote\n(\nsee for example\n[\n7\n]\n)\n:-\nI can speak confidently to the fact of his being not only well-versed in the highest branches of mathematics, but possessed of original power for their extension which gives him a very respectable rank among their English cultivators of this day.\nKelland\nwrote:-\nFrom the originality of his conceptions and the extent and accuracy of his knowledge, I conceive he has few superiors in Europe ...\nBoole's father died in December\n1848\nbefore the decision had been made concerning the Irish chairs but an announcement came in August\n1849\nthat Boole was to become the first Professor of Mathematics at Queen's College, Cork, and he took up the position in November. He taught there for the rest of his life, gaining a reputation as an outstanding and dedicated teacher. However the position was not without difficulty as the College became embroiled in religious disputes. Boole wrote to\nDe Morgan\non\n17\nOctober\n1850\n(\nsee for example\n[\n7\n]\n)\n:-\n... if you should hear of any situation in England that would be likely to suit me ... let me know of it. I am not terrified by the storm of religious bigotry which is at this moment raging round us here. I am not dissatisfied with my duties and I may venture to say that I am on good terms with my colleagues and with my pupils. But I cannot help entertaining a feeling ... that recent events in this College have laid the foundation of a lack of mutual trust and confidence among us ...\nIn May\n1851\nBoole was elected as Dean of Science, a role he carried out conscientiously. By this time he had already met\nMary Everest\n(\na niece of Sir George Everest, after whom the mountain is named\n)\nwhose uncle was the professor of Greek at Cork and a friend of Boole. They met first in\n1850\nwhen\nMary\nvisited her uncle in Cork and again in July\n1852\nwhen Boole visited the Everest family in Wickwar, Gloucestershire, England. Boole began to give\nMary\ninformal mathematics lessons on the differential calculus. At this time he was\n37\nyears old while\nMary\nwas only\n20\n. In\n1855\nMary\n's father died leaving her without means of support and Boole proposed marriage. They married on\n11\nSeptember\n1855\nat a small ceremony in Wickwar. It proved a very happy marriage with five daughters: Mary Ellen born in\n1856\n, Margaret born in\n1858\n, Alicia\n(\nlater\nAlicia Stott\n)\nborn in\n1860\n, Lucy Everest born in\n1862\n, and Ethel Lilian born in\n1864\n. MacHale writes\n[\n7\n]\n:-\nThe large gap in their ages seemed to count for nothing because they were kindred spirits with an almost complete unity of purpose.\nLet us now look at Boole's most important work. In\n1854\nhe published\nAn investigation into the Laws of Thought, on Which are founded the Mathematical Theories of Logic and Probabilities\n. Boole approached logic in a new way reducing it to a simple algebra, incorporating logic into mathematics. He pointed out the analogy between algebraic symbols and those that represent logical forms. It began the algebra of logic called\nBoolean algebra\nwhich now finds application in computer construction, switching circuits etc. Boole himself understood the importance of the work. He wrote in a letter to\nThomson\ndated\n2\nJanuary\n1851\n(\nsee for example\n[\n7\n]\n)\n:-\nI am now about to set seriously to work upon preparing for the press an account of my theory of Logic and Probabilities which in its present state I look upon as the most valuable if not the only valuable contribution that I have made or am likely to make to Science and the thing by which I would desire if at all to be remembered hereafter ...\nBoole also worked on differential equations, the influential\nTreatise on Differential Equations\nappeared in\n1859\n, the calculus of finite differences,\nTreatise on the Calculus of Finite Differences\n(1860)\n, and general methods in\nprobability\n. He published around\n50\npapers and was one of the first to investigate the basic properties of numbers, such as the distributive property, that underlie the subject of algebra.\nMany honours were given to Boole as the genius in his work was recognised. He received honorary degrees from the universities of Dublin and Oxford and was elected a Fellow of the\nRoyal Society\n(1857)\n. However his career, which was started rather late, came to an unfortunately early end when he died at the age of\n49\n. The circumstances are described by\nMacfarlane\nin\n[\n18\n]\nas follows:-\nOne day in\n1864\nhe walked from his residence to the College, a distance of two miles, in the drenching rain, and lectured in wet clothes. The result was a feverish cold which soon fell upon his lungs and terminated his career ....\nWhat\nMacfarlane\nfails to say is that\nBoole's wife\nbelieved that a remedy should resemble the cause. She put Boole to bed and threw buckets of water over the bed since his illness had been caused by getting wet.\nHirst\ndescribed Boole as:-\n... evidently an earnest able and at the same time a genial man.\nHis work was praised by\nDe Morgan\nwho said:-\nBoole's system of logic is but one of many proofs of genius and patience combined. ... That the symbolic processes of algebra, invented as tools of numerical calculation, should be competent to express every act of thought, and to furnish the grammar and dictionary of an all-containing system of logic, would not have been believed until it was proved. When\nHobbes\n... published his \"Computation or Logique\" he had a remote glimpse of some of the points which are placed in the light of day by Mr Boole.\nBoolean algebra has wide applications in the design of modern computers. Boole's work has to be seen as a fundamental step in today's computer revolution.",
  "matematicos_citados_na_biografia": [
    "Lacroix",
    "Laplace",
    "Lagrange",
    "Duncan Gregory",
    "De Morgan",
    "differential equations",
    "Royal Society",
    "Kelland",
    "Cayley",
    "Thomson",
    "Mary Everest",
    "Mary",
    "Alicia Stott",
    "Boolean algebra",
    "probability",
    "Macfarlane",
    "Boole's wife",
    "Hirst",
    "Hobbes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}