{
  "nome_completo": "George Udny Yule",
  "nome_curto": "George Udny Yule",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yule/",
  "data_nascimento": "18 February 1871",
  "local_nascimento": "Morham (near Haddington), Scotland",
  "data_morte": "26 June 1951",
  "local_morte": "Cambridge, England",
  "summary": "George Yule was an English mathematician who is best known for his book: Introduction to the Theory of Statistics .",
  "biografia": "George Udny Yule\n's father was also called George Udny Yule. George Udny Yule senior was one of three brothers, the other two being Robert Yule\n(\nkilled during the Indian Mutiny while commanding the\n9\nth\nLancers at Delhi\n)\n, and Henry Yule\n(\na colonel in the Royal Engineers but also a leading scholar who edited Marco Polo's Travels and was knighted\n)\n. George Yule senior was involved in administration in the Bengal Civil Service in India and, like his brother Henry, was knighted for his services. George Yule senior married Henrietta Peach Pemberton who was the daughter of Captain Robert Boilean Pemberton of the Indian Army. The Yule family had a strong reputation for scholarship, with the grandfather of the George Udny Yule of this biography, William Yule, being a renowned scholar in Persian and Arabic.\nGeorge, the subject of this biography, was born at Beech Hill, a house in Morham near Haddington in Scotland. When he was four years old the family moved from Morham to Tooting, London. Remaining in London, they moved from Tooting to Bayswater where George attended day-school in Orme Square. When he was ten years old he was sent to boarding school at Dunchurch near Rugby, then after three years he entered Winchester College, one of the oldest of the great independent schools of England situated in Winchester, Hampshire. It was at this school that the physics teacher W B Croft gave George encouragement to excel in his studies. He wrote many years later about his school days\n[\n6\n]\n:-\nI did not enjoy school days, being no use whatever at games or sports, but consider the education at Winchester in my days was in advance of much of what you see now - a well balanced course in both classics, mathematics and science: the only subject almost entirely neglected was one's native language. But Winchester, I fancy, was not remarkable in that respect.\nIn\n1886\n, while George was at Winchester, his father died and his family moved from Bayswater. George remained at Winchester until he was sixteen years of age when, in\n1887\n, he entered University College, London, to read for an engineering degree. In\n1890\nYule graduated with a degree in engineering and then for two years he was involved in the practical side of the subject, working in engineering workshops. It was an experience which made him decide that engineering was not the subject for him, so, in\n1892\n, he began to undertake research in physics.\nYule spent a year in Bonn undertaking research in experimental physics under\nHertz\n. This was a successful year in which he published four papers based on the research on electric waves that he undertook in Bonn, yet again Yule seems not to have found the topic one to excite him enough for him to want to work in that area for the rest of his life. In fact the influence of his work in engineering and experimental physics was less than one would expect for, as\nMaurice Kendall\nwrites in\n[\n4\n]\n:-\nIt does not appear, in fact, that this early training left a permanent imprint on his habits of thought. One would not suspect an engineering background behind his mature work; the only point at which it exerted some influence was in his careful and expert draughtsmanship and his preference for diagrammatic representation.\nYule returned from Germany to London in the summer of\n1893\nand was offered a post as a demonstrator in University College, London, by\nKarl Pearson\n. In fact\nPearson\nhad known Yule when he had studied at University College as an undergraduate so he knew that he was appointing someone with great potential. For the first time, Yule was inspired by the work which he undertook with\nPearson\n, and his first paper on statistics appeared in\n1895\nOn the correlation of total pauperism with proportion of out-relief\n. This work\n[\n3\n]\n:-\n... introduced correlation coefficients in studying two-way tables in the earlier volumes of the monumental work of Booth\n[\nLife and labour of the people of London\n(1889\n-\n1893)]\n.\nIn\n1895\nYule was elected to the\nRoyal Statistical Society\nand over the next few years, inspired by\nPearson\n, he produced a series of important articles on the statistics of regression and correlation. Yule's work entitled\nOn the Theory of Correlation\nwas first published in\n1897\n. He developed his approach to correlation via regression over the next few years with a conceptually new use of least squares and by the\n1920\n's his approach predominated in applications in the social sciences.\nLet us illustrate the types of statistical problems that Yule worked on by quoting from his own introduction to one of his papers, namely\nOn the association of attributes in statistics: with illustrations from the material of the Childhood Society etc\n. written in\n1899\n:-\nIn the ordinary theory of statistical correlation, normal or otherwise, we are always supposed to be dealing with material susceptible of continuous variation, or at least of variation by a considerable number of discontinuous steps. The correlation of lengths or measurements on portions of the body form examples of the first kind; of numbers of children in families, petals or other parts of flowers, are examples of the second.\nCertain practical cases arise, however, where either no variation is thinkable at all, or else is not measured or possibly measured. We may class a number of individuals into deaf and not deaf, blind and not blind, imbecile and not imbecile, without attempting to go further ... and demand on the basis of the enumeration a discussion of the association.\nHe progressed from his appointment as a demonstrator to that of Assistant Professor of Applied Mathematics at University College in\n1896\n, but as he was paid scarcely enough to live on, he left his assistant professorship in\n1899\nto take up the better paid position of secretary to the examination board of the City and Guilds of London Institute. In fact his affiliation is given as \"Formally Assistant Professor of Applied Mathematics, University College, London\" in the\n1899\npaper from whose introduction we quoted above. The reason for Yule needing a better salary was that he had married May Winifred Cummings, the daughter of the Principal of the Guildhall School of Music in\n1899\n. However\nYates\nwrites in\n[\n6\n]\n:-\nThe marriage was not a success, and was annulled in\n1912\n, there being no children.\nThis change of job did not lessen Yule's research output in statistics, nor did it end his association with University College, London, for over the next few years he gave the annual Newmarch Lectures in Statistics. These lectures became the basis for Yule's famous text\nIntroduction to the Theory of Statistics\nwhich he first published in\n1911\n. The text was intended for those who possessed only a limited knowledge of mathematics and proved a great success. It was a book clearly reflecting\nPearson\n's approach to statistics, but containing many of the notable contributions made by Yule. It ran to fourteen editions but, perhaps surprisingly, later editions sold very much better than the early ones.\nNeyman\n, reviewing the book for\nNature\nwrote:-\nIn my opinion, this is the best book on statistics that was ever written.\nIn the same year of\n1911\nYule was awarded the Guy Medal in Gold of the\nRoyal Statistical Society\n, their highest award. While commenting on his association with the\nRoyal Statistical Society\nit is worth noting that Yule was secretary to the Society from\n1907\nto\n1919\nand President from\n1924\nto\n1926\n.\nIn\n1912\nhe accepted a Lectureship in Statistics at Cambridge, taking a drop in salary but never regretting the move. He became a member of St John's College in\n1913\nand lived in the College for most of the rest of his life. He was made a Fellow of St John's College in\n1922\n, which was the same year in which he was elected a Fellow of the\nRoyal Society\n. During World War I Yule worked as a statistician in the army in the Contracts Department of the War Office, then at the Ministry of Food where he was Director of Requirements. After the war he was awarded a C.B.E. for this work. For example he published\n(\njointly with Major Greenwood\n)\nThe statistics of anti-typhoid and anti-cholera inoculations and the interpretation of such statistics in general\nin\n1915\n. The paper begins:-\nHardly any subjects within the range of preventative medicine are of more immediate importance than the methods of prophylaxis which ought to be adopted with respect to typhoid fever and cholera.\nTyphoid fever has already been responsible for much illness and many deaths in nearly all the armies on active service, while cholera has taken toll of one at least of our enemies and one of our allies. Further, our troops are now fighting in a part of Europe and Asia which has always been a favourable soil for the development of epidemic cholera and was recently the scene of outbreaks among troops engaged in the present war.\nAmongst the measures of prophylaxis which need to be discussed, that of preventative inoculation is clearly of exceptional interest ... we shall be obliged to devote a good deal of space to\n[\nconsideration of the cholera data\n]\n. We have also been led to discuss various theoretical problems which might have been thought more suitable to the pages of a purely statistical journal. We are, however, satisfied that these questions of method ought to be studied in connection with the practical problems from which they originate.\nThe years from\n1920\nto\n1930\nwere the most productive ones for Yule. He wrote papers on time-correlation in which he introduced the correlogram and he did fundamental work on the theory of autoregressive series. In\n1930\nhe retired from his post, by now a readership, in Cambridge. Although he was still active in research, and would be for many years to come, he had begun to regret that statistics had expanded into such a broad topic that he would never be able to keep up to date. When\nKarl Pearson\ndied in\n1936\n, Yule was deeply affected.\nLet us relate a story about Yule which tells us quite a bit about his character. He became interested in driving a car in the\n1920\ns and would, it was reported, drive at reckless speeds. This desire for speed made him want to fly which he decided he would do when he had retired. However, after he retired he discovered that he was too old to qualify for insurance and no company would teach him to fly. He was not to be stopped by such problems, however, and he purchased his own plane and qualified for his pilot's licence in\n1931\n. He could beat the insurance companies but not his health for sadly he suffered a heart problem in\n1931\nwhich prevented him for flying and made him a partial invalid for the rest of his life.\nIn\n1937\nYule produced a thorough revision of the text of\nIntroduction to the Theory of Statistics\nfor the eleventh edition published in that year.\nMaurice Kendall\nwrites in\n[\n4\n]\n:-\nThe increasing popularity of the book did a great deal to counteract Yule's feeling of being left behind by modern developments. He professed to be astonished that the work fulfilled his earlier hope that it would be useful to new generations of students, but he was undoubtedly greatly pleased and comforted.\nThe fourteenth and last edition of\nIntroduction to the Theory of Statistics\nwas written jointly with\nMaurice Kendall\nand published in\n1950\n, shortly before Yule's death. The first half of the book deals with descriptive statistics: the theory of attributes, frequency distributions and their characteristics, correlation and regression, and curve fitting\n)\n. The second half of the book deals with sampling theory: large and small samples, chi-square, analysis of variance. The last chapters discuss interpolation and graduation, index numbers, and time series.\nIn his later years he applied statistics to literary style and published a book\nThe statistical study of literary vocabulary\nin\n1944\n. His paper\nCumulative sampling: a speculation as to what happens in copying manuscripts\n(1946)\nis described in a review by\nFeller\nas follows:-\nVariations in old manuscripts are to a great extent due to copying errors and these are in turn frequently related to \"danger spots\" in the outward appearance. Since the error removes the danger spot, variations due to copying errors will in general be more stable than the original version. The author uses an admittedly greatly oversimplified model of a random game to study the probable development within so-called families of texts. The mathematics is elementary and the interest of the paper lies in conclusions which apparently differ greatly from commonly accepted views. It is stated that the criterion has been applied to a particular case with results contradicting the philologists' conclusions.\nYule did not develop any completely new branches of statistical theory but he took the first steps in many areas which proved important in their further development by later statisticians.\nMaurice Kendall\n's comment in\n[\n4\n]\nas to Yule's contribution is, however, very appropriate:-\nA great deal of Yule's contributions to the advancement of statistics cannot come to light; they reside in the stimulus he gave to his students, the discussions he held with his colleagues on a host of subjects, notably agriculture and demography, and the advice he freely tendered to all who consulted him, for he was always a most approachable man.\nThe story about Yule learning to fly tells us something of his character. In addition\nMaurice Kendall\ntells us in\n[\n4\n]\nthat Yule was:-\n... kindly, gentle and genial. His wide knowledge of many subjects and his love of an apposite story made him the best of companions. His correspondence was a delightful mixture of shop, anecdote, and commentary on things in general ...\nAs we mentioned above, Yule's health problems began in\n1931\nwhen he developed heart problems. He life after this time was lived with a degree of difficulty; climbing stairs became a major undertaking. He acted as if he had little time left to live, spending time tidying up loose ends to his work, yet he lived for twenty years after his\n1931\nheart problems. In fact as the years went by he appeared more prepared to undertake deep research again, and from about\n1939\nonwards he made further major contributions, some of which we mentioned above. By the late\n1940\ns, however, his health began to deteriorate again and he spent the last two and a half years of his life in nursing homes\n[\n4\n]\n:-\n... walking a little, reading a little, corresponding a little, but conscious that his powers were failing, and waiting, not always patiently, for the end.\nHe died in the Evelyn Nursing Home in Cambridge at age\n83\n.",
  "matematicos_citados_na_biografia": [
    "Hertz",
    "Maurice Kendall",
    "Karl Pearson",
    "Pearson",
    "Royal Statistical Society",
    "Yates",
    "Neyman",
    "Royal Society",
    "Feller"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}