{
  "nome_completo": "Gerbert of Aurillac",
  "nome_curto": "Gerbert of Aurillac",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gerbert/",
  "data_nascimento": "946",
  "local_nascimento": "Belliac, (now St-Simon) Auvergne, France",
  "data_morte": "12 May 1003",
  "local_morte": "Rome (now Italy)",
  "summary": "Gerbert of Aurillac or Pope Sylvester II was a talented French mathematics teacher who popularised the Indo-Arabic numerals.",
  "biografia": "Gerbert of Aurillac\nis also known by the name he took when he was made Pope, namely\nSylvester II\n. We do not know anything about his parents or his childhood. Even the date of his birth that we have given as\n946\nas simply a guess based on later known dates. However, the majority of historians believe that he was born in either\n945\nor\n946\n. The fact that nothing is known of his parents would certainly suggest that they were poor people and not of any status. Gerbert was educated at the monastery of Saint-Gerald at Aurillac, a Benedictine monastery which had been founded around\n60\nyears before Gerbert entered it in\n963\n. There he studied under the monk Raymond de Lavaur whom Gerbert later praised for the high quality of his teaching in a letter to the monastery:-\nIt is from you all in general that I remember having acquired the benefits of my education, but more particularly from father Raymond. If I have acquired any knowledge it is, after God, to him more than to any other mortal that I owe it.\nAt the monastery, Gerbert learnt literature, theology, history, and philosophy, but would not have studied any mathematics and only a very little logic.\nThe year\n967\nwas one of great importance for Gerbert since in that year he gained the opportunity to learn mathematical skills which were almost totally lacking throughout Europe. It was in\n967\nthat Count Borrell II of Barcelona visited Aquitaine and, as he was returning to Barcelona, he came to the Benedictine monastery of Saint-Gerald at Aurillac. The abbot of the monastery, Gerauld, asked Count Borrell whether there were scholars of the arts in Spain and, when he replied that there were many men of learning, Gerauld persuaded Count Borrell to take one of his students back to Barcelona with him so that he might profit from the learning there. The brothers at the monastery decided that Gerbert was the one who might benefit most so he accompanied Count Borrell to Barcelona. There he lived in the cathedral school of Vich, close to Barcelona, for three years. Bishop Atto was in charge of the cathedral school of Vich and he was officially Gerbert's teacher during these years but it was not from Atto that Gerbert learnt about the leading Islamic scholarship of the day. It is almost certain that he must have made visits to Cordova and Seville, where Islamic scholars were living, during the three years. What he learnt at this time included the latest developments from the Islamic world in mathematics and astronomy.\nWe know about Gerbert's studies in Spain from a number of sources, the most important of which was written by Richer of Saint-Remi, a student of Gerbert's, who wrote\nHistoria Francorum\naround\n996\n. Count Borrell took Gerbert to Rome in\n970\nand there he met pope John XIII. Richer writes:-\nThe pope did not fail to notice the youth's diligence and will to learn. And because music and astronomy were completely ignored in Italy at that time, the pope through a legate promptly informed Otto, king of Germany and Italy, that a young man of such quality had arrived, one who perfectly mastered mathematics and who was capable of teaching it effectively to his men.\nWhat particular skills had Gerbert acquired while in Spain? Richer of Saint-Remi gives more information, as Marco Zuccato explains in\n[\n29\n]\n:-\nRicher provides a detailed account of Gerbert's \"mathematical\" teaching. It is noteworthy that arithmetic and music are only very briefly mentioned at the beginning and that geometry is described in a short paragraph at the end, while the rest of the account is devoted to a description of astronomical tools fabricated by Gerbert in order to introduce his disciples to astronomy. Here Richer describes four celestial spheres: a solid sphere, a hemisphere, an armillary sphere, and a star sphere. These tools portray an ingenious and original method of familiarizing students with the names and positions of the zodiacal constellations and with planetary astronomy and also of providing a basic knowledge of how to tackle problems of positional astronomy.\nClearly Otto I was impressed by the learning which Gerbert had acquired for he offered him a position as tutor to his son. This was as good a position as any scholar could ever hope to have and one might have expected Gerbert to make full use of the opportunity. However, he only spent two years as tutor to Otto's son before he was tempted to move to Rheims to continue his studies. The reason he wanted to go to Rheims was that Garamnus, perhaps Europe's leading logician, was there and he had offered to teach Gerbert logic in exchange for Gerbert teaching him music and mathematics. The two had met in Rome in\n972\nwhere they were both attending the wedding of Otto I's son to a Greek princess. Garamnus, who was an archdeacon, was at the wedding as a representative of the king of France.\nOnce Gerbert was settled in Rheims, he quickly impressed Archbishop Adalbero of Rheims who appointed him to take charge of the cathedral school in Rheims. Gerbert designed the syllabus and quickly made this school into perhaps the leading European centre of learning of its time. He made no mathematical discoveries, but he wrote some fine texts for his students to use. His work in this area is important for he had learnt about the Hindu-Arabic numerals while in Spain and had understood how these were much better suited to mathematics than were Roman numerals. His mathematics books are thought to include\nLibellus de numerorum divisione, De geometria, Regula de abaco computi, Regulae de numerorum abaci rationibus, and Liber abaci.\nThe contents of one are described in\n[\n19\n]\n:-\nIts opening chapters are concerned with definitions, explanations of symbols, the properties of numbers and figures. Some of\nEuclid\n's propositions occur further on; but the major portion of the work is concerned with finding the area of figures and fields, the heights of mountains, the widths of rivers, and such like questions, which are generally considered the province of mensuration or trigonometry today.\nAt Rheims Gerbert also taught his students how to use astronomical instruments and, with a breadth of learning which covered the full range of academic subjects, he taught his students the classic Latin authors Terence, Cicero, Virgil, Lucan, Persius, Juvenal and Statius. Roland Allen describes his more advanced teaching\n[\n6\n]\n:-\nWith their minds well trained in these exercises his pupils advanced to the higher arts of the quadrivium - arithmetic, music, astronomy, and geometry. Here it was that Gerbert's powers found their fullest play in inventions of all kinds for the simplification of the subject and the advancement of science. So astonishing was his skill, that the simple folk of his day, in sheer bewilderment, accepted without question the belief that his knowledge was universal ... It is to be noticed that Gerbert was the first to introduce into the schools instruments as an assistance to the study of arithmetic, astronomy, and geometry. In arithmetic he first introduced the abacus, a tablet divided lengthwise into twenty-seven parts, on which the student moved about the nine numerical signs, which Gerbert caused to be cut out in horn to the number of one thousand. The number varied in value according to the column in which they were placed. A blank space was left to replace the figure\n0\n, which was unknown to Gerbert. Cumbrous as his methods appear to us, they must have been a great advance upon the ignorance of the end of the ninth century, and must also have been of the utmost service in teaching the proper use of arithmetic.\nIt is worth noting that we have not made mention of any great advances in Gerbert's teaching of theology. This is for good reason since it was not a subject which he considered important. His belief was that his teaching had to give his students skills to help them lead their lives and, as a consequence, he had little regard for much of the abstract theological arguments which were undertaken by most in the Church. Remember to that we are here describing a man who went on to become pope! It was at Rheims that Gerbert was ordained by Archbishop Adalbero.\nThe reputation that Gerbert gained soon caused others to be jealous and attempt to undermine his reputation. One such was Otric, the head of the school at Magdeburg, who attempted to damage Gerbert by sending one of his own students to study with Gerbert in Rheims and bring copies of his lectures back to Magdeburg. The student, apparently, made some errors in the notes he took back and Otric thought he had evidence to bring down Gerbert so reported the errors to Otto II. Of course Otto II had been taught by Gerbert and held him in high regard. He summoned Gerbert and Otric to Ravenna in\n980\nand set up a contest between the two men to be judged by himself and the most learned men at court. Gerbert was declared a clear winner and returned to Rheims with an even higher reputation. In\n983\nOtto II made Gerbert abbot at the monastery of St Columban at Bobbio. This important monastery had been badly run for many years and was in need of major reform. Gerbert was a talented teacher whose passion in life was scholarship and teaching, but he had neither the administrative skills nor the desire to turn round the failing monastery. Soon after arriving in Bobbio he was writing to the archbishop of Trèves:-\n... if you are in doubt whether you should send scholars to us in Italy, here is our definite agreement: those you approve we will approve; what you recommend we will accept.\nAfter a year of arguments with the monks, Gerbert gave up the unequal struggle to reform the St Columban monastery and he returned to Rheims where he was enthusiastically reinstated as head of the school.\nLet us illustrate Gerbert's love of learning by quoting from a letter he wrote:-\nHave Pliny corrected, let us receive Eugraphius; and have copied those books which are at Orbais and at Saint-Basle. ... Procure the 'Historia' of Julius Caesar from Lord Adso, abbot of Montier-en-Der, to be copied again for us in order that you may have whichever books are ours at Rheims, and may expect ones that we have since discovered at Bobbio, namely eight volumes:\nBoethius\n'On astrology', also some beautiful figures of geometry; and others no less worthy of being admired. ... You know with what zeal I am everywhere collecting copies of books. You also know how many copyists there are here and there in the cities and countryside of Italy. ... I am diligently forming a library. And, just as a short time ago in Rome and in other parts of Italy, and in Germany also, and in Lorraine, I used large sums of money to pay copyists and to acquire copies of authors ...\nAt Rheims, Gerbert had been much more than a teacher and head of the cathedral school. He had been both secretary and advisor to Archbishop Adalbero, and deeply involved in political as well as ecclesiastical affairs. Archbishop Adalbero died in\n988\nand he had made it known that he wanted Gerbert to be his successor. However, it appears that Gerbert did not want to become Archbishop of Rheims, and certainly there were others who did not want to see him in that role. Arnulf, a descendant of Charlemagne, became Archbishop but was almost at once accused of irregular practices. A council of French bishops and abbots was held in Rheims in\n991\nand, following a recommendation by the French King, Arnulf was dismissed and Gerbert appointed in his place. There followed a bitter wrangle, with claims that Arnulf had been improperly dismissed and certainly Gerbert was faced with almost impossible difficulties in carrying out his duties. In\n995\na synod was held which dismissed Gerbert and reinstated Arnulf. Pope Gregory V become pope in\n996\nand, two years later, he appointed Gerbert to be Archbishop of Ravenna. In the following year,\n999\n, pope Gregory V died and Gerbert was elected pope. He took the name pope Sylvester II when he was consecrated pope on\n9\nApril\n999\n.\nGerbert's time as pope was extremely difficult and he was unable to bring peace and prosperity as he wished\n[\n19\n]\n:-\nGreatness did not bring him happiness; power, in his case, was not crowned with achievement. He found that the unfortunate circumstances of the time, the animosity of the Romans towards him, and the swift approach of death were more than able to paralyze his own worthy projects and high endeavours, and the powerful protection of the Emperor.\nHe was the first Frenchman to become pope and the Romans certainly considered that the position of pope should not go to a \"foreigner\". A revolt in the winter of\n1001\nsaw both Emperor Otto III and the pope forced out of Rome. Otto III never returned to Rome, for having twice unsuccessfully tried to take the city, he died on the third attempt in\n1002\n. Gerbert returned to Rome soon after the death of Otto III, although he never regained his authority. He died in the following year.\nFinally we look at a letter that Gerbert wrote to his friend Adalbold shortly before he was elected pope. Gerbert writes:-\nYou have requested that if I have any geometrical figures of which you have not heard, I should send them to you, and I would, indeed, but I am so oppressed by the scarcity of time and by the immediateness of secular affairs that I am scarcely able to write anything to you.\nGerbert then goes on to answer a problem that Adalbold has posed. In an equilateral triangle with base\n30\nfeet and height\n26\nfeet Adalbold knows two ways of finding the area. One is to take half the base times the height, giving\n390\n. The other is to compute\n1\n2\n30\n(\n30\n+\n1\n)\n=\n465\n\\large\\frac{1}{2}\\normalsize 30(30 + 1) = 465\n2\n1\n​\n3\n0\n(\n3\n0\n+\n1\n)\n=\n4\n6\n5\n. Since they give different answers, both cannot be correct. Gerbert correctly tells his friend that half the base times the height, giving\n390\nsquare feet, is the correct method. However, his explanation is far from convincing! There are a number of points worth making.\n(\ni\n)\nThe triviality of the problem gives a good indication of the low level of European mathematics in the year\n1000\n.\n(\nii\n)\nThe second, rather mysterious, method must come from the Pythagorean triangular numbers. The\n30\nth\ntriangular number is indeed an equilateral triangle of dots with\n1\nin the first row,\n2\nin the second, up to\n30\nin the third. A total of\n465\ndots.\n(\niii\n)\nFinally, we note that an equilateral triangle with base\n30\nfeet has height\n25\n.\n98\nfeet so the height of\n26\nfeet is a good approximation.\nGerbert's fame as a mathematician lies not in any mathematical achievement but rather in his enthusiasm to teach the topic and to popularise the use of Indo-Arabic numerals and the abacus in Europe at a time when, for Europeans, mathematical understanding was at a low ebb.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Boethius"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}