{
  "nome_completo": "Gerhard Gentzen",
  "nome_curto": "Gerhard Gentzen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gentzen/",
  "data_nascimento": "24 November 1909",
  "local_nascimento": "Greifswald, Germany",
  "data_morte": "4 August 1945",
  "local_morte": "Prague, Czechoslovakia",
  "summary": "Gerhard Gentzen invented a 'natural deduction' which provided a logic closer to mathematical reasoning than the systems proposed by Frege, Russell and Hilbert.",
  "biografia": "Gerhard Gentzen\n's father was a lawyer who practised law in Bergen on the Isle of Rügen. It was there that Gerhard spent his childhood years, attending first the elementary school there, and later the Realgymnasium. His father, however, was killed in World War I and in\n1920\nGentzen's mother moved to Stralsund. Gentzen had already begun his secondary schooling at this stage but he continued his education at the Humanistische\nGymnasium\nin Stralsund.\nCertainly moving schools did not affect Gentzen's academic achievements for when he received his\nAbitur\nin\n1928\nit was with distinction and he was ranked top in his school. In\n[\n6\n]\nRobbel describes the intellectual world of the young Gentzen in particular examining the influences on him of his grandparents\n(\nespecially A Bilharz\n)\nand his parents. The results of his\n1928\nReifeprufung examination are given in an appendix to\n[\n6\n]\n. The headmaster of the Humanistische Gymnasium was certainly impressed with the results and, recognising his exceptional mathematical abilities, awarded him a university scholarship.\nGentzen, as was usual at this time, moved between different German universities. He began his mathematical studies at the University of Greifswald in\n1928\nthen, after studying there for two semesters, he entered the University of Göttingen on\n22\nApril\n1929\n. Again he spent only two semesters before moving on, this time to the University of Munich where he spent only one semester followed by one further semester at the University of Berlin. After this he returned to Göttingen where he worked under\nWeyl\nfor his doctorate on the foundations of mathematics. He was taught by\nBernays\n,\nCarathéodory\n,\nCourant\n,\nHilbert\n,\nKneser\n,\nEdmund Landau\nand, of course, his supervisor\nWeyl\n.\nIn\n1933\nGentzen was awarded his doctorate by Göttingen but the intense study in different environments had taken its toll so he was forced at this stage to return home to rest and recover his health. He returned to Göttingen, becoming\nHilbert\n's assistant in\n1934\n. M E Szabo writes in\n[\n2\n]\n:-\n... he continued to work\n[\nat Göttingen\n]\neven after\nHilbert\n's retirement. During these years Gentzen published some of his most important papers and was also given the responsible task of reviewing numerous works of eminent researchers from many countries for the Zentralblatt für Mathematik. These reviews attest his extraordinary range of interest and the great extent of his involvement in the international community of scholars.\nAs we have mentioned, Gentzen's work was on logic and the foundations of mathematics. He submitted his first paper to\nMathematische Annalen\nearly in\n1932\n. The paper studies the theory of 'sentence systems' and answers a major open problem in the subject by constructing a counterexample to show that not all sentence systems have independent axiom systems. However he also showed that linear sentence systems do have independent axiom systems. He introduced the notion of 'logical consequence' which provided a logic closer to mathematical reasoning than the systems proposed by\nFrege\n,\nRussell\nand\nHilbert\n. This idea was later attributed to\nTarski\nwho introduced it in\n1936\n, three years after Gentzen.\nIn\n1934\nGentzen gave the method of succinct Sequenzen, rules of consequents, which were particularly useful for deriving metalogical decidability results.\nHilbert\nhad him work on axiomatic methods and the classification of mathematics into levels. The idea of levels, probably first introduced by\nWeyl\n, considers number theory as the first level since it deals with the natural numbers, analysis as the second level since it deals with the real numbers, and set theory as the third level where the full extent of\nCantor\n's cardinal and ordinal numbers would be studied. Gentzen wrote several papers on these concepts, particularly examining the occurrence of set theory paradoxes.\nOf course\nGödel\npublished his incompleteness theorem just at the time Gentzen was beginning his work. At first Gentzen worried that it affected what he wanted to achieve on the foundations of mathematics and he withdrew what would have been his second paper after he had corrected the final proofs because of worries about the significance of\nGödel\n's theorems. Later, however, he wrote of\nGödel\n's result saying:-\n... this is undoubtedly a very interesting, but certainly not an alarming, result. We can paraphrase it by saying that for number theory no once-and-for-all sufficient system of forms of inference can be specified, but that on the contrary, new theorems can always be found whose proof requires a new form of inference.\nIn a paper published in\nMathematische Zeitschrift\nin\n1935\nGentzen introduced two new versions of predicate logic now called the\nN\nN\nN\n-system and the\nL\nL\nL\n-system. In the following year he gave a consistency proof in terms of an\nN\nN\nN\n-type logic for the system S of arithmetic with induction. Gentzen wrote in the introduction to this paper:-\nThe aim of the present paper is to prove the consistency of elementary number theory or, rather, to reduce the question of consistency to certain fundamental principles.\nHe then looks at why such consistency proofs are necessary:-\nMathematics is regarded as the most certain of all sciences. That it could lead to results which contradict one another seems impossible. This faith in the indubitable certainty of mathematical proofs was sadly shaken around\n1900\nby the discovery of the antinomies or paradoxes of set theory. It turned out that in this specialised branch of mathematics, contradictions arise without our being able to recognise any specific error in our reasoning.\nAfter discussing the paradoxes, in particular\nRussell\n's paradox, Gentzen writes:-\n... I shall carry out such a consistency proof for elementary number theory. Yet even here we shall meet forms of inference whose closer inspection will give us cause for concern. ... One point should, however, be made clear from the outset: these forms of inference which might possibly be considered disputable hardly ever occur in actual number theoretical proofs; we must not be misled and, because of the great self-evidence of these proofs, consider a consistency proof as superfluous.\nBy\nGödel\n's unprovability theorem, such a proof as Gentzen gave had to make use of tools stronger than those of S; extending ordinary mathematical induction, Gentzen employed transfinite induction up to\nCantor\n's first epsilon number, and he also showed that this was the minimum required for such proof.\nKleene\nwrote:-\n... to what extent the Gentzen proof can be accepted as securing classical number theory in the sense of that problem formulation is in the present state of affairs a matter of individual judgement.\nTarski\nwrote:-\nGentzen's proof of the consistency of arithmetic is undoubtedly a very interesting metamathematical result, which may prove very stimulating and fruitful. I cannot say, however, that the consistency of arithmetic is now much more evident to me ... than it was before the proof was given.\nGentzen's was the most outstanding contribution to\nHilbert\n's programme of axiomatising mathematics. In\n1937\nhe addressed the Congress in Paris giving a talk with title\nConcept of infinity and the consistency of mathematics\n. His outstanding work, however, was cut short by the start of World War II.\nGentzen remained on the staff at Göttingen until\n1943\n, although he had to undertake military service in the years\n1939\nuntil\n1941\n. He was conscripted into the army where he worked in telecommunications. He became ill, however, and spent three months recovering in a military hospital. His health was now too poor to allow him to continue with his military service and he returned to Göttingen. In the summer of\n1942\nhe submitted his\nHabilitation\nthesis\nProvability and nonprovability of restricted transfinite induction in elementary number theory\nto Göttingen and, on the award of the degree, he became entitled to teach in universities.\nAs part of the German war effort, he took up a teaching post as a\nDozent\nin the Mathematical Institute of the German University of Prague and he taught there until arrested and taken into custody. The citizens of Prague rose in revolt against the occupying German forces on\n5\nMay\n1945\n, the day all the staff of the German University were arrested, and held the city until the Russian Army arrived four days later. One would have to mention the facts concerning Gentzen's political and military life that Vihan relates in\n[\n8\n]\n, namely his association with the SA, NSDAP and NSD Dozentenbund. Gentzen was interned by the Russian forces and held in poor conditions. He died of malnutrition after\n3\nmonths in internment. A friend who was in prison with him described his last few days:-\nI can see him lying on his wooden bunk thinking all day about the mathematical problems that preoccupied him. He once confided in me that he was really quite content since now he had at last time to think about a consistency proof for analysis... He also concerned himself with other questions such as that of an artificial language, etc. Now and then he would give a short talk ... we were continually reassured that the formalities of our release would only take a few days longer.... he was hoping to be able to return to Göttingen and devote himself fully to the study of mathematical logic and the foundations of mathematics. He was dreaming of an Institute for this purpose ...",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Abitur",
    "Weyl",
    "Bernays",
    "Carathéodory",
    "Courant",
    "Hilbert",
    "Kneser",
    "Edmund Landau",
    "Frege",
    "Russell",
    "Tarski",
    "Cantor",
    "Gödel",
    "Kleene",
    "Habilitation",
    "Dozent"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}