{
  "nome_completo": "Gheorghe  Calugăreănu",
  "nome_curto": "Gheorghe  Calugăreănu",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Calugareanu/",
  "data_nascimento": "16 July 1902",
  "local_nascimento": "Iasi, Romania",
  "data_morte": "15 November 1976",
  "local_morte": "Cluj, Romania",
  "summary": "Gheorghe  Calugăreănu was a Romanian mathematician who studied the theory of functions of a complex variable  as well as of differential geometry and algebraic topology.",
  "biografia": "Gheorghe Calugăreănu\nwas a natural scientist who went on to serve as rector of the University of Cluj. Gheorghe attended primary school in Bucharest from\n1909\nto\n1913\n, then the \"Ch Lazer\" secondary school, also in Bucharest, from\n1913\nto\n1921\n. After graduating from the famous secondary school, Calugăreănu entered the Faculty of Mathematics and Physics at the University of Cluj. Cluj\n(\nknown also by its German name, Klausenburg, and its Hungarian name, Kolozsvár\n)\nhad, with the rest of Transylvania, been incorporated into Romania in\n1919\n, just over a year before Calugăreănu went to study there. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n.\n(\nThe Hungarian university in Cluj moved first to Budapest, then to Szeged.\n)\nThe university in Cluj was named King Ferdinand I University and it was at this university that Calugăreănu studied from\n1921\nuntil\n1924\n.\nIn\n1926\nCalugăreănu went to Paris to study at the university there. He was supported financially by a Romanian government scholarship. In Paris he met the leading mathematicians of the day. These included\nÉmile Picard\n,\nJacques Hadamard\n,\nÉlie Cartan\n,\nPaul Montel\n,\nArnaud Denjoy\nand\nGaston Julia\n. Calugăreănu was awarded a \"licence in science\" from the University of Paris in\n1926\n, then he was awarded his doctorate in\n1928\nafter submitting his dissertation\nSur les fonctions polygènes d'une variable complexe\nⓉ\n(\nOn the polygenic functions of a complex variable\n)\n.\nAfter Calugăreănu returned to Romania he worked mainly in Cluj. His first appointment there at the university was in\n1930\nas an assistant. He was then promoted to a lecturer in\n1934\nand named professor there in\n1942\n. Over this period there had been changes due to the effects of World War II.  In\n1940\n, after the start of World War II, the Hungarian university was moved back from Szeged to Cluj, and the Romanian university in Cluj moved to Sibiu and Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. Parts of the Hungarian university in Cluj moved back to Szeged, while that part which remained in Cluj was named the Bolyai University\n(\nafter\nJános Bolyai\n)\n.\nDue to the high quality of his teaching and his scientific research, Calugăreănu became one of the most important professors at the University of Cluj. His importance certainly went well beyond the university itself, and he made major contributions to higher education and science throughout Romania. He also held important administrative positions within the university such as Dean of the Faculty of Mathematics from\n1953\nto\n1957\n. In\n1959\nthe Babeș University and the Bolyai University in Cluj joined to became the Babeș-Bolyai University. Calugăreănu continued to chair the Department of the Theory of Functions at Babeș-Bolyai University.\nCalugăreănu worked in a number of different mathematical areas such as the theory of functions of one complex variable, geometry, algebra, and topology. His early work, including the work of his doctoral dissertation, were on the theory of functions of one complex variable and here he particularly extended the work of\nDimitrie Pompeiu\n. His remarkable contributions to the theory of\nmeromorphic functions\nand univalent functions mean that he is considered as the founder of the school of the geometric theory of univalent functions at Cluj.\nIacob\nwrites in\n[\n2\n]\nabout Calugăreănu's mathematical contributions:-\nCalugăreănu's rich scientific work, the importance of which becomes more evident as time passes, reveals to us a harmonious, well-knit structure of exquisite elegance and mathematical profoundness. Uninfluenced by passing currents or fashions in mathematics, Calugăreănu, a strong personality, followed in his scientific activity an original, specific line of research established in his youth.\nHis investigations on Picard's fundamental theorem, on theorems of\nBorel\nand\nNevanlinna\nin connection with the study of exceptional values of meromorphic functions of finite genus, made him already in the third and fourth decades of this century one of the first important Romanian mathematicians as well as a mathematician of European stature and distinguished member of the Romanian school of complex analysis founded by David Emmanuel and Dimitrie\nPompeiu\n. Through their work in the theory of polygenic functions, both\nPompeiu\nand Calugăreănu established themselves as genuine founders of the theory of generalized analytic functions, a branch of complex analysis that developed considerably in the period\n1930\n-\n1970\n.\nDuring the same period of rapid development of aerodynamics, studies connected with the theory of conformal representation became of great interest. Calugăreănu investigated necessary and sufficient conditions for univalence of functions holomorphic in a disc and obtained results in the theory of conformal representation of multiply connected domains. The importance of this investigation should be underlined here.\nReturning to\nWeierstrass\n's point of view on analyticity and the definition of analytic functions via\nTaylor series\nelements, Calugăreănu created the theory of invariants and covariants of analytic continuation. The problem that he posed, which should be connected to his name, is a substantial contribution to his legacy.\nCalugăreănu was constantly preoccupied with revealing genuine invariance or covariance properties of the mathematical problems that he investigated. Guided by this point of view, Calugăreănu left us important works on differential geometry and topology. These by themselves would be enough to ensure his mathematical fame, and his results in this domain enjoy considerable renown. In\ndifferential topology\n, starting from an invariant introduced by\nGauss\n, Calugăreănu discovered a system of invariants which found applications in knot theory and molecular biology. The study of the complete system of isotopy invariants of\n3\n-dimensional knots led him, in the field of modern algebra, to problems of isomorphism and invariants for groups defined via generators and relations.\nIn\n1963\nCalugăreănu published\nElements of the theory of functions of a complex variable\nin Romanian. This elementary textbook covers all the standard topics usually covered in such an elementary text, but also has a chapter on elliptic functions with applications to cubic curves in the plane, and a final section on modular functions which contains the theorem of\nPicard\n.\nAs a lecturer, Calugăreănu gave simple, clear explanations. He spoke quietly and he would start every lecture by spending ten minutes going over the material from the previous lecture. At the end of the lecture he would explain what was coming in the next lecture. This makes it sound as if he would make little progress, but on the contrary, he was able to go steadily though the material. Students really understood the lectures as he gave them and his lectures were models for the highest quality of teaching. His research was elegant and his personality shone through his mathematical papers as it did in his teaching. Some of his results had applications in molecular biology or fluid mechanics. In fact Calugăreănu spoke of about the tension between pure and applied mathematics in his autobiographical paper\n[\n2\n]\n. He remarks there that, in Communist Romania, the party and the state stress the importance of research which leads to improvements in the conditions of life. However, they also recognize the importance of fundamental research as a foundation for and preliminary to applications. The paper\n[\n2\n]\nallows us to glimpse other aspects of Calugăreănu's approach to mathematics. He addresses younger mathematicians explaining that because of the rapid expansion in mathematics there is great importance in having a guiding thread or theme in one's research. This, he explains, is especially true if one's work spans several fields. His own work did indeed span several fields, and he recognises that his thread was the idea of invariance which ran through his work in complex variables, differential topology, and modern algebra.\nCalugăreănu was elected to the\nRomanian Academy of Sciences\nin\n1963\n. His most famous student, Petru T Mocanu the author of\n[\n8\n]\n, was also elected a member of the\nRomanian Academy of Sciences\n.",
  "matematicos_citados_na_biografia": [
    "Émile Picard",
    "Jacques Hadamard",
    "Élie Cartan",
    "Paul Montel",
    "Arnaud Denjoy",
    "Gaston Julia",
    "János Bolyai",
    "Dimitrie Pompeiu",
    "meromorphic functions",
    "Iacob",
    "Borel",
    "Nevanlinna",
    "Pompeiu",
    "Weierstrass",
    "Taylor series",
    "differential topology",
    "Gauss",
    "Picard",
    "Romanian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}