{
  "nome_completo": "Gheorghe Țițeica",
  "nome_curto": "Gheorghe Țițeica",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Titeica/",
  "data_nascimento": "4 October 1874",
  "local_nascimento": "Turnu-Severin, Oltenia, Kingdom of Romania (now Romania)",
  "data_morte": "5 February 1939",
  "local_morte": "Bucharest, Romania",
  "summary": "Gheorghe Țițeica was a Romanian mathematician who worked in geometry. He was a founder of the Romanian school of differential geometry.",
  "biografia": "Gheorghe Țițeica\npublished under this version of his name and also under the version\nGeorges Tzitzeica.\nWhen he was young his interests included science, literature and especially music. He learnt to play the violin when he was young and this remained one of his pleasures throughout his life. He showed his many talents during his years in primary school in Turnu Severin. By\n1885\nwhen he was admitted to the prestigious secondary school \"Carol I\" National College in Craiova\n(\ntoday named Nicolae Balcescu College\n)\nhis parents knew that they had a remarkably talented son.\nIn Craiova he continued to achieve top grades, and he also spent time in pursuing his musical interests as a relaxation. The city, situated near the Jiu River,\n185\nkm west of Bucharest, was a good centre for music and the arts which suited Țițeica very well. He graduated from secondary school in Craiova in\n1882\nand was awarded a scholarship to train to become a teacher at the Training College in Bucharest. He went to Bucharest where, in addition to studying at the Training College, he attended mathematics lectures at the University. Among his lecturers were David Emmanuel,\nSpiru Haret\n, O Gogu, Dimitrie Petrescu and Iacob Lahogary. He graduated with a bachelor's degree in mathematics in June\n1895\nand in the autumn of that year he began teaching at the theological seminary in Bucharest while continuing his studies for his \"capability examination\".\nHe qualified as a secondary school teacher of mathematics in\n1896\nand later that year was appointed to the 'Vasile Alecsandri' secondary school in Galati. The city is an inland port\n190\nkm northeast of Bucharest. Teachers at the school, and Țițeica's friends, all encouraged him to go to Paris and study further mathematics, and this he did in\n1897\nwhen he entered the École Normale Superieure. There he made friends with two other students,\nHenry Lebesgue\nand\nPaul Montel\n. Among his lecturers were a whole host of leading mathematicians including\nDarboux\n,\nPicard\n,\nPoincaré\n,\nAppell\n,\nGoursat\n,\nHadamard\n, and\nBorel\n.  After Țițeica left Paris, his close friend\nLebesgue\nwrote about Țițeica in a letter to one of his friends\n(\nsee\n[\n9\n]\n)\n:-\nI was thrilled to find him again happy, vivid, delighted to talk to me about his home, with that magnificent moral health radiating from his luminous yet thorough look in his eyes. ... I understood then, that inside himself, laid an everlasting union between the sense of the duty to be achieved and the euphoria rising from the conscience of the fulfilled duty ... and I discovered that our friendship for him was always shaded by an even greater respect.\nȚițeica flourished in Paris having teachers and friends with outstanding mathematical abilities who inspired him to produce excellent research. He published three papers in\n1898\n, namely\nSur un theoreme de M Cosserat;  Sur les systemes orthogonaux\nⓉ\n(\nOn a theorem M Cosserat; On orthogonal systems\n)\nand\nSur les systemes cycliques\nⓉ\n(\nOn cyclic systems\n)\n. In the following year he published seven papers including his doctoral dissertation\nSur les congruences cycliques et sur les systemes triplement conjugues\nⓉ\n(\nOn cyclic congruences and triply conjugate systems\n)\n. His thesis was presented to the Faculty of Science and was examined on\n30\nJune\n1899\nby a committee headed by\nGaston Darboux\n.\nReturning to Romania, Țițeica was appointed as an assistant professor at the University of Bucharest where he taught the course on differential and integral calculus. He was promoted to professor of Analytical Geometry at Bucharest University on\n4\nMay\n1900\n. He remained there until his death in\n1939\n.\nȚițeica's research contributions were mainly in geometry, in particular affine\ndifferential geometry\n. The author of\n[\n17\n]\nwrites:-\nIn\n1908\nȚițeica showed that for a surface in Euclidean\n3\n-space the ratio of the Gaussian curvature to the fourth power of the distance from a fixed point to the tangent plane is invariant under an affine transformation fixing O. He defined an S-surface to be any surface for which this ratio is constant. These S-surfaces turn out to be what are now called proper affine spheres with centre at O.\nHis book\nGéométrie différentielle projective des réseaux\nⓉ\n(\nDifferential geometry of projective networks\n)\n(1923)\nconsisted mostly of Țițeica's own results. The paper\n[\n18\n]\nis devoted entirely to looking at the mathematical contents of this important work. It describes the work he did on the lattice of mutually conjugated lines on a surface and the\nLaplace\nsequence of such lattices\n[\n18\n]\n:-\nȚițeica was led to these studies starting from deep research concerning deformation theory of surfaces in three dimensional Euclidean space.\nFurther investigations of such structures led Țițeica to develop further beautiful theory which he set out in his book\nThe projective differential geometry of lattices\n(1927)\n. He published\nIntroduction to Differential Projective Differential Geometry of Curves\nin\n1931\n. An interesting insight into his ideas about the nature of mathematical research is given in\n[\n19\n]\n. This paper, written by Țițeica's daughter Gabriela, illustrates his thoughts on such matters by quoting passages from his notebooks.\nAs well as being famed for this geometrical research, Țițeica also gave a famous geometry course at Bucharest University over many years. Mihaileanu\n[\n8\n]\nreports on the topics covered by Țițeica in this course and shows how he covered different areas every year. Among these many topics were surfaces of constant curvature, ruled surfaces, metrical properties of space, minimal surfaces,\nWeingarten\ncongruencies, conformal representation, and conformal geometry. One of his students, who went on the become a university professor of mathematics, wrote of his teaching\n(\nsee for example\n[\n9\n]\n:-\nAfter Tzitzeica's courses one would have left home bearing the teaching in his mind. But this is an understatement. It is hard to express in words the internal harmony of Tzitzeica's courses. Each course left you with a strong feeling of delightfulness; the one you would have expresses when being confronted with a painting. One would have left the courses of this apostle of geometry abiding by both his example of dignity and straightness that he was for his entire life and by the optimistic belief the mathematics, in general, and, especially, geometry have a high and admirable educational value for young people.\nAnother important contribution made by Țițeica was his work with the\nJournal of Mathematics\n, which published research contributions, and\nNatura\n, a magazine he co-founded which published popular scientific articles. D Barbilian, at one time assistant to Țițeica, wrote of these different aspects of his contributions\n[\n9\n]\n:-\nThis man's life is split between the faculty, where his Analytical Geometry course flows like a river of clarity whose waters cannot be seen twice, the two magazines, and his scientific work. Unlike ours, his life passes, aside from worries, equally and exemplary.\nIn\n[\n16\n]\nRimer describes Țițeica's contributions to mathematics education in Romania. He notes in particular the non-parochial emphasis Țițeica placed on learning about, and incorporating, the experiences of other countries, while at the same time keeping in mind their relevance to Romanian national spirit and culture.\nMany trips abroad allowed him to sample the best educational practices of other countries. He gave lecture courses at the Sorbonne in Paris in\n1926\n,\n1930\nand\n1937\n. In particular the\n1930\ncourse covered the research topics for which he achieved international distinction at that time, namely webs and congruencies. He also taught courses in Brussels in\n1926\nand Rome in\n1937\n.\nȚițeica was elected a corresponding fellow of the Maryland Academy of Science in\n1930\n, a fellow of the Royal Society of Science in Liège in\n1934\nand, in the same year, he was awarded an honorary degree by the University of Warsaw. He was elected a corresponding member of the\nRomanian Academy of Sciences\nin May\n1909\n, then a full member in\n1913\non the death of\nSpiru Haret\n. He became vice-president of the scientific section in\n1922\n, becoming vice-president of the Academy in\n1928\nas well as general secretary the following year. He also served as president of the\nRomanian Mathematical Society\n(\nSocietatea de Stiinte Matematice din Romania\n)\n(\nseveral times\n)\nand of the Romanian Association of Science. He was honoured for his work on the promoting science by election as President of the Association for the Development and Spreading of the Sciences.",
  "matematicos_citados_na_biografia": [
    "Spiru Haret",
    "Henry Lebesgue",
    "Paul Montel",
    "Darboux",
    "Picard",
    "Poincaré",
    "Appell",
    "Goursat",
    "Hadamard",
    "Borel",
    "Lebesgue",
    "Gaston Darboux",
    "differential geometry",
    "Laplace",
    "Weingarten",
    "Romanian Academy of Sciences",
    "Romanian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}