{
  "nome_completo": "Gilbert Baumslag",
  "nome_curto": "Gilbert Baumslag",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baumslag/",
  "data_nascimento": "30 April 1933",
  "local_nascimento": "Johannesburg, South Africa",
  "data_morte": "20 October 2014",
  "local_morte": "New York City, New York, USA",
  "summary": "Gilbert Baumslag had a long career as one of the leading researchers on infinite group theory. In the last part of his career he used his skill in group theory applying it to cryptography.",
  "biografia": "Gilbert Baumslag\nwas the son of Boruch Baumshlag or Baumslagk\n(\nabout\n1900\n-\n1980)\nand his wife\n(\nborn about\n1910)\n. Boruch Baumshlag was brought up in Daugavapils in the Russian Empire, a city which became part of Latvia in\n1920\n, while his wife was also brought up in the Baltic States. They emigrated in around\n1928\nand settled in South Africa. Gilbert was the oldest of his parents' three children, having a younger brother Benjamin Baumslag who became a group theorist working in much the same area as Gilbert, and a younger sister.\nGilbert was born in Johannesburg and attended schools in that city. Graduating from high school in\n1950\n, he entered the University of the Witwatersrand\n(\nWits\n)\nto study mathematics. This university, founded as the South African School of Mines in\n1896\n, had been granted full university status in\n1922\n. The University had a policy to treat everyone equally, irrespective of their class, wealth, race or creed. In\n1948\nthe South African government began to introduce apartheid policies which the universities opposed.\nIsmail Mohamed\nwas a student on the same course as Gilbert and he had taught himself group theory despite it not being part of the course at Wits. He persuaded the university to put on an honours group theory course which Gilbert took. It was his introduction to the subject he would spend his career working on. We explain below how, in\n1989\n, Gilbert supported efforts to free\nIsmail Mohamed\nfrom prison. Baumslag was awarded a bachelor's degree by the University of the Witwatersrand in\n1953\nand he continued to study for a master's degree which he was awarded in\n1955\n.\nBaumslag was accepted by the University of Manchester to study for a Ph.D. and he sailed from Durban, South Africa, on the ship the\nStirling Castle\n, arriving in Southampton, England, on\n16\nSeptember\n1955\n. He stated on entry to England that he was going to the University of Manchester as a student. At this time Manchester was an exciting place for postgraduate work on group theory.\nMax Newman\nheld the chair of Mathematics and worked on combinatorial topology, but he had undertaken work on computers during World War II and had appointed\nAlan Turing\nto Manchester. He had also appointed to Manchester, among others,\nB H Neumann\nwho was one of the leading group theorists. When Baumslag arrived in Manchester he was immediately introduced to a fellow Ph.D. student of\nB H Neumann\n, namely\nJim Wiegold\n. Ian David Macdonald and Michael Frederick Newman, who would become important figures in the development of group theory, joined them a couple of years later, also as students of\nB H Neumann\n. While Baumslag was undertaking research at Manchester,\nJoachim Neubüser\nspent a postdoctoral year\n1957\n-\n58\nthere.\nJim Wiegold\n, who had undertaken research on similar topics to Baumslag, submitted his doctoral dissertation entitled\nNilpotent products of groups with amalgamations\nin\n1958\nand was awarded his Ph.D.\nBaumslag had two papers in print before the award of his doctorate, namely\nA theorem on infinite groups\n(1957)\nand\nFinite factors in infinite ascending derived series\n(1958)\n. The\n1958\npaper was submitted in\n1\nNovember\n1956\nand contains the following acknowledgement:-\nI express my thanks to Dr\nB H Neumann\nfor his generous help, guidance and encouragement, and my gratitude and appreciation to my Parents to whom this opportunity for further study is due.\nWhile studying at Manchester, Baumslag returned to South Africa in the summer of\n1956\n, sailing from Southampton to Cape Town on the\nCarnarvon Castle\non\n7\nJune, returning on the ship the\nCapetown Castle\nfrom Cape Town to Southampton arriving on\n5\nOctober\n1956\n.\nHe was awarded his Ph.D. in\n1958\nfor his thesis entitled\nSome aspects of groups with unique roots\n. He writes in the thesis:-\nI take this opportunity to express my gratitude and appreciation to my Parents, without whose help and encouragement this opportunity for further study would have been both unwanted and impossible.\nIt is a very great pleasure for me to acknowledge the help of Dr\nB H Neumann\nduring the past\n30\nmonths. He suggested this topic to me and his ever-ready advice, criticism and creative remarks have helped, in no small way to make this dissertation possible. It has been both a privilege and a delight to have him as a supervisor. I thank the members of the Department of Mathematics of the University of Manchester for their interest and many useful comments. Finally, I thank the University of the Witwatersrand for a grant in my third year.\nThe thesis has the following Abstract:-\nA large number of Russian mathematicians have investigated groups satisfying conditions as to the existence and uniqueness of roots in groups. This thesis is concerned with groups in which certain classes of roots are unique. The investigation makes use of notions which belong more to abstract algebra than to group theory. In particular \"free\" systems of groups with unique roots are studied.\nWe note that Baumslag's fellow postgraduate students Ian D Macdonald and Mike Newman graduated with  PhDs in\n1960\n; Ian Macdonald with the thesis\nOn Groups with Conditions like Finiteness of Conjugacy Classes\nand Mike Newman with the thesis\nOn Groups All of Whose Proper Homomorphic Images are Nilpotent\n.\nAfter the award of his Ph.D., Baumslag spent the year\n1958\n-\n59\nas a lecturer in Manchester before returning to South Africa where he married Sybil on\n3\nJuly\n1959\n. She was a musician and a fine pianist. Gilbert and Sybil Baumslag had two children but we note at this point that Gilbert and Sybil were divorced on\n17\nSeptember\n1971\nat Harris, Texas, USA. The newly married couple sailed on the\nStirling Castle\nfrom Cape Town to Southampton, arriving on\n11\nSeptember\n1959\n. They sailed from Southampton on\n12\nSeptember on the\nMauretania\narriving in New York on\n18\nSeptember. They were travelling to Princeton where Baumslag had been appointed as an Instructor in Mathematics. In\n1961\nhe was appointed as an assistant professor at the\nCourant\nInstitute of New York University, where his address was\n6610\nYellowstone Boulevard, Forrest Hills\n75\n, New York. Baumslag and his wife spent the summer of\n1961\nin Europe, returning to the United States on\n23\nAugust\n1961\n. At this point they considered their time in the United States not to be permanent since they gave their permanent address as\n199\nOxford Road, Dunkeld, Johannesburg, South Africa.\nAfter a year, Baumslag was promoted to associate professor. In\n1964\nhe became a professor at the City University of New York\n(\nCUNY\n)\n, spending from September\n1968\nto May\n1969\nat the Institute for Advanced Study at Princeton. In May\n1969\nhe gave a series of lectures on finitely generated nilpotent groups at the University of Texas, Austin, which he wrote up as the book\nLecture notes on nilpotent groups\n(1971)\n. Mike Newman wrote in the review\n[\n17\n]\n:-\nThis is a slightly polished version of notes prepared as an aid to a series of lectures on finitely generated nilpotent groups given in May\n1969\nat the University of Texas, Austin. The notes begin with a short Chapter\n0\n, Basic notions and results. Chapter\n1\n, Algorithmic problems for finitely generated nilpotent groups, is devoted to the word, conjugacy and isomorphism problems for finitely generated nilpotent groups. Chapter\n2\n, Residual properties and some applications, is concerned mainly with residual properties of finitely generated torsion-free nilpotent groups; the existence and uniqueness of the\nMalcev\ncompletion is established. Chapter\n3\n,\nLie\nand associative ring techniques and the commutator calculus, provides a quick account of basic material for use in Chapter\n4\n,\nLie\ngroup techniques, which is the heart of the notes ...\n...\nThe notes convey the spirit of the subject without always going into all the details and the careful reader will often have a good deal of work to do.\nThen, from\n1969\nto\n1973\n, he was a professor at Rice University. Returning to New York, he was a Distinguished Professor at the City College of the City University of New York from\n1973\n. He was described by CUNY as:-\n... a person of outstanding merit and accomplishment in his field.\nBaumslag became an American citizen on\n2\nJuly\n1980\n. By this time he had around\n85\npublications in print, about half of the total number he would produce throughout his career. MathSciNet lists\n50\nco-authors involved in these\n166\npublications and over his career he supervised the doctoral studies of over\n30\nstudents.\nIn May\n1983\nColin Campbell and I\n[\nEFR\n]\ninvited Baumslag to be one of five main speakers at the conference Groups St Andrews\n1985\nwhich we organised. All accepted our invitation and Gilbert chose to give his course of four lectures on\nA survey of groups with a single defining relation\n. He explained\n[\n3\n]\n:-\nIn this series of\n4\nlectures I will not have the time to survey the entire field of modern day one-relator group theory.  Instead I have chosen to focus on a few of the facets of the theory that either arise from other areas of mathematics or seem to have wider application than to one-relator groups alone. Much of what I say will involve the prevalence of free subgroups and the way in which properties of free groups persist in one-relator groups. It is clear to me that I will have left many important areas untouched and that often too little time will be devoted to work that deserves more. Indeed there are many important papers that will not even be referred to here and the bibliography is by no means a comprehensive one.\nStephen Pride, in a review of the paper, wrote:-\nThe paper is very well written and is a pleasure to read.\nLet me\n[\nEFR\n]\ndescribe an event related to Groups St Andrews\n1985\nthat involved Gilbert Baumslag.\nIsmail Mohamed\nwas a coloured South African mathematician who specialised in group theory. Like Gilbert Baumslag, he studied at the University of the Witwatersrand, obtaining a B.Sc. and an M.Sc. He obtained a scholarship to study for a Ph.D. at the University of London which he was awarded in\n1960\n. His thesis was entitled\nOn Series of Subgroups Related to Groups of Automorphisms\n, and his thesis advisor had been\nKurt Hirsch\n. He was appointed as an assistant lecturer at the University of London but, after the racial riots in South Africa, chose to return to a position at the University of the Witwatersrand, turning down the offer of a permanent position at the University of London. Back in South Africa he campaigned for human rights.\nMohamed\nwrote to us saying he wished to attend Groups St Andrews\n1985\nand we invited him to lecture to the conference. On\n18\nFebruary\n1985\nMohamed\nwas arrested along with other leaders of the United Democratic Front so could not attend Groups St Andrews\n1985\n. During the conference I was approached by some participants who wanted to write to the South African government arguing for\nMohamed\n's release as a prisoner of conscience and wanted to invite other conference participants to sign their letter. I had a worry about this for, at that time, I had no idea what Gilbert Baumslag's political views were and I had no wish to offend him. Gilbert, however, told me about his attempts to help people who were being discriminated against. He said he had known\nMohamed\nas a student at the University of the Witwatersrand, he fully supported the letter and would add his signature in support of\nMohamed\n. The letter was sent off signed by around\n300\nof the world's leading group theorists. I doubt if it had any impact but the trial of United Democratic Front members collapsed\n(\nsome of the State's evidence was suspect\n)\nand all were released by June\n1986\n.\nIn\n1989\nBaumslag organised a year long conference on combinatorial group theory at the Mathematical Sciences Research Institute in Berkeley, California. This led to much increased interest in automatic groups and hyperbolic groups.\nIn\n1991\nBaumslag published the book\nTopics in combinatorial group theory\n. As with the earlier book mentioned above, this was the result of a course he had given, this time at ETH Zürich in the winter term of\n1987\n/\n88\n. The Publisher, following the Preface, writes:-\nCombinatorial group theory is a loosely defined subject, with close connections to topology and logic. With surprising frequency, problems in a wide variety of disciplines, including differential equations, automorphic functions and geometry, have been distilled into explicit questions about groups, typically of the following kind: Are the groups in a given class finite\n(\ne.g., the\nBurnside\nproblem\n)\n? Finitely generated? Finitely presented? What are the conjugates of a given element in a given group? What are the subgroups of that group? Is there an algorithm for deciding for every pair of groups in a given class whether they are isomorphic or not? The objective of combinatorial group theory is the systematic development of algebraic techniques to settle such questions. In view of the scope of the subject and the extraordinary variety of groups involved, it is not surprising that no really general theory exists. These notes, bridging the very beginning of the theory to new results and developments, are devoted to a number of topics in combinatorial group theory and serve as an introduction to the subject on the graduate level.\nStelios Andreadakis writes in the review\n[\n1\n]\n:-\nThe author exhibits some known old and new fascinating theorems in an \"elementary\" exposition and in almost all cases with complete proofs preceded by the necessary background material. An indication of the material covered is given by the titles of the chapters: Chapter I. History. Chapter II. The weak\nBurnside\nproblem. Chapter III. Free groups, the calculus of presentations and the method of\nReidemeister\nand\nSchreier\n. Chapter IV. Recursively presented groups, word problems and some applications of the\nReidemeister\n-\nSchreier\nmethod. Chapter V. Affine algebraic sets and the representation theory of finitely generated groups. Chapter VI. Generalized free products and HNN-extensions. Chapter VII. Groups acting on trees. The reviewer feels this book will be very useful also to the graduate student and pleasant to read for the mature and expert mathematician.\nThe New York Group Theory Seminar was started by\nWilhelm Magnus\nin around\n1955\nbut after he retired in\n1987\nBaumslag took over running the seminar. In a grant application he made in\n2003\nhe wrote:-\nThe emphasis of the seminar is on Combinatorial, Geometric and Computational Group Theory. Many of the talks touch also on three-dimensional topology, homological algebra and theoretical computer science. There are usually\n10\nseminars each semester. A sprinkling of these seminars are expository and are sometimes combined with one-day or two-day long workshops or conferences.\nGroups are mathematical structures, which capture, in mathematical form, the nature of symmetry. It turns out, for this very reason, that they play an important role in crystallography, in particle physics, in geometry and in the study of the three-dimensional world that we live in. They are an important tool in many diverse mathematical disciplines as well as in theoretical computer science. Recently they have been used in cryptography, a field of enormous economic and strategic importance.\nLater in his career, Baumslag became interested in the interaction between group theory and computer science. He founded the Center for Algorithms and Interactive Scientific Software\n(\nCAISS\n)\nas one of the research centres of the City College of New York:-\nFounded by Gilbert Baumslag, its original scope was research at the intersection of Group Theory and Theoretical Computer Science. Following some exciting work applying group theory to secure encryption, the Center's focus shifted to becoming a leading research institution in Cryptography and Network Security. CAISS members do research and publish academic papers in a variety of areas, from the theoretical foundations of cryptography to the design and implementation of cryptographic protocols.\nIn\n1994\nBaunslag headed a team developing MAGNUS, a computer algebra system specifically designed to compute with infinite groups. It was released to the public in\n1997\nbut in August\n2005\nit was decided to abandon the project.\nGilbert Baumslag's work on cryptography led to him publishing papers on the topic, the first three of which all appeared in\n2006\n:\nCryptosystems using linear groups\n;\nA proposed public key cryptosystem using the modular group\n; and\nDesigning key transport protocols using combinatorial group theory\n. We note that by this time he was\n73\nyears old but was able to continue working after passing the usual retirement age. In fact after serving in the Department of Mathematics for more than\n35\nyears, he joined the Department of Computer Science at CUNY in\n2006\n.\nBaumslag was married to Mary Kennedy and they lived in Manhattan and Long Island. He continued to undertake research until August\n2014\nwhen his illness was diagnosed; he died in October\n2014\n. The tenth in the Groups St Andrews series of conferences was planned to be held in Birmingham in\n2017\nand Gilbert Baumslag, Ben Fine and Gerhard Rosenberger were working on the paper\nOne-relator groups: an overview\nat the time of his death\n[\n4\n]\n:-\nSadly, our co-author and friend Gilbert Baumslag died during the preparation of this paper. The remaining two authors dedicate the paper to the memory of Gilbert and to all the work that he inspired. In\n1985\n, at Groups St Andrews, Gilbert Baumslag gave a short course on one-relator groups which provided a look at the subject up to that point. In this paper we partially update the massive amount of work done over the past three decades. For the most part we concentrate on areas and results to which the authors have made contributions. We look at the important connections with surface groups and elementary theory, and describe the surface group conjecture and the Gromov conjecture on surface subgroups. We look at the solution by Wise of Baumslag's residual finiteness conjecture and discuss a new Baumslag conjecture on virtually free-by-cyclic groups. We examine various amalgam decompositions of one-relator groups and the Baumslag-Shalen conjectures. We then look at a series of open problems in one-relator group theory and their status. Finally we introduce a concept called plainarity based on the Magnus breakdown of a one-relator group which might provide a systematic approach to the solution of problems in one-relator groups.\nAnother project Baumslag was working on at the time of his death was the book\nA course in mathematical cryptography\nco-authored with Ben Fine, Martin Kreuzer and Gerhard Rosenberger. It was published in\n2015\nand contains the following by Baumslag's three co-authors\n[\n5\n]\n:-\nWhile this book was being completed, tragically our colleague, co-author and friend, Gilbert Baumslag, died. Gilbert was one of the foremost researchers in the world in infinite group theory and developed many computational techniques for finitely presented groups. Over the past decade he had been active in transferring this knowledge to group-based cryptography. It is our hope that this book honours his memory and his contribution.\nThe Publisher gives the following description of the book\n[\n5\n]\n:-\nCryptography has become essential as bank transactions, credit card information, contracts, and sensitive medical information are sent through insecure channels. This book is concerned with the mathematical, especially algebraic, aspects of cryptography. It grew out of many courses presented by the authors over the past twenty years at various universities and covers a wide range of topics in mathematical cryptography. It is primarily geared towards graduate students and advanced undergraduates in mathematics and computer science, but may also be of interest to researchers in the area. Besides the classical methods of symmetric and private key encryption, the book treats the mathematics of cryptographic protocols and several unique topics such as Group-Based Cryptography, Gröbner Basis Methods in Cryptography, and Lattice-Based Cryptography.\nFor Baumslag's interests outside mathematics we quote from\n[\n7\n]\n:-\nHe had a great fondness for Nantucket where he spent more than\n25\nyears during school vacations and holidays writing papers, exploring problems on his famous\n500\nlb blackboard installed on the office wall of his beloved old house on Darling Street. He was enormously fond of many friends on Nantucket with whom he shared a lot of important and silly experiences. One such was playing cricket on Darling Street on a hot August night with four amateurs at the game. There were no winners. There were also no losers. He also loved having lunch at The Opera House where there was no rush, no impatience, and just great food, a great atmosphere, all under the guidance of the renowned Gwen Gaillard. And the always present lure of the Atlantic Ocean was not to be ignored. He loved the land of his birth and was truly happy when the government was transformed by the release of Nelson Mandela. He went to Johannesburg whenever possible for more than\n40\nyears not only to see old friends but also to encourage math projects in the country.\nIn\n[\n16\n]\nthere are many tributes paid to Gilbert Baumslag. For example, Benjamin Baumslag, his younger brother, writes:-\nI am deeply shocked by the brutally sudden and unexpected death of Gilbert. He had a long and successful life, being a man of many talents. With his cheerful helpful personality he brought zest to even the most subdued gatherings, bringing them fully to life. He had a major influence on the theory of infinite groups and computing science and produced an abundance of books, articles and research students. His was a unique lecturing style which brought a focus and clarity to the subject. He was good at sport and retained his interest in particular to cricket. He disliked discrimination and as a student in Apartheid South Africa he protected an Indian friend from harassment. Much later on, as Apartheid became even more vicious, he helped get the same man out of a South African prison. As his younger brother he was my hero. I am still in awe of him.\nFor more memories of Gilbert Baumslag, see\nTHIS LINK\nand for more memories from his students, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Ismail Mohamed",
    "Max Newman",
    "Alan Turing",
    "B H Neumann",
    "Jim Wiegold",
    "Joachim Neubüser",
    "Courant",
    "Malcev",
    "Lie",
    "Kurt Hirsch",
    "Mohamed",
    "Burnside",
    "Reidemeister",
    "Schreier",
    "Wilhelm Magnus",
    "THIS LINK"
  ],
  "imagens": [
    "baumslag.jpg"
  ]
}