{
  "nome_completo": "Giovanni Frattini",
  "nome_curto": "Giovanni Frattini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frattini/",
  "data_nascimento": "8 January 1852",
  "local_nascimento": "Rome (now Italy)",
  "data_morte": "21 July 1925",
  "local_morte": "Rome, Italy",
  "summary": "Giovanni Frattini was an Italian mathematician who made important  contributions to group theory.",
  "biografia": "Giovanni Frattini\nattended school in Rome and, completing his schooling in\n1869\n, entered the University of Rome in November of that year to study mathematics. Frattini was taught by some outstanding mathematicians at the University of Rome, being tutored by the geometers Guiseppe\nBattaglini\n, Eugenio\nBeltrami\n(\nwho had just published his masterpiece on\nnon-euclidean geometry\n)\n. In\n1873\nLuigi\nCremona\narrived in Rome and also taught Frattini who obtained his doctorate in\n1875\n.\nAfter graduating Frattini went to Caltanissetta in central Sicily where he taught at the Liceo, taking up his appointment in\n1876\n. At this school Frattini was the head of mathematics but it was a school he was only to teach in for two years for, in November\n1878\n, he moved to Viterbo in central Italy. This was much nearer to home for Frattini for Viterbo is situated at the foot of the Cimini Mountains to the northwest of Rome. He taught at the Technical Institute there, becoming Head of Mathematics and Descriptive Geometry in the year following his appointment.\nFrattini's road back to Rome was completed in February\n1881\nwhen his request for a transfer to the Technical Institute there accepted. In\n1884\na Military College was founded in Rome and Frattini lectured there from the time that the College opened. It was shortly after joining the College that Frattini published three papers on\ngroup theory\nwhich today make his name familiar to anyone who has studied the topic.\nThe route that Frattini had taken to undertake research in group theory had been to study Camille\nJordan\n's papers on the topic. As a result of this study, Frattini published two major papers on transitive groups, the first in\n1883\nand the second in the following year. These are not two of the three papers which have made him famous, the latter being three papers on the generators of finite groups one of which he published in\n1885\nand the remaining two in\n1886\n.\nIn the first of these papers\nIntorno alla generazione dei gruppi di operazioni\nⓉ\n(\nOn the generation of  groups of operations\n)\nFrattini defined the\nsubgroup\nwhich today is known as the Frattini subgroup. His definition was as the subgroup generated by all the non-generators of the group\n(\nelements which if included in a generating set for the group can always be omitted to still leave a generating set\n)\n. He showed that the Frattini subgroup is\nnilpotent\nand, in so doing, used the beautiful method of proof known today as the \"Frattini argument\".\nThe quality of this work led to Frattini being offered a university chair in Naples, but he declined the offer not wishing to leave Rome for family reasons. Although he was offered a lectureship in algebra at the University of Rome in\n1914\nhe never took up the appointment. By that time he was\n62\nyears of age.\nBefore commenting on the final years of Frattini's life it is worth noting that he contributed to other areas of mathematics in addition to group theory. His work on\ndifferential geometry\nis important as is his papers on the analysis of second degree indeterminates. On this latter topic he simplified the classical work by\nEuler\n,\nLagrange\nand\nGauss\n(\nanyone would be proud to improve on the work of these three mathematicians!\n)\n.\nThe First World War was a difficult time for Frattini who found the events very troubling. In\n1915\nItaly turned from the Triple Alliance to make a treaty with Britain, France, and Russia. Italy declared war on Austria-Hungary in May of\n1915\nand some rather indecisive battles were fought in the north. Many Italian soldiers were killed,\n500\n,\n000\nin\n1916\nalone. Frattini's son was wounded in the war and, in order to be able to support him in the difficult economic conditions, Frattini continued working at a time when he wished to retire. His wife died and poor Frattini suffered a number of unhappy years in his old age.\nA glimpse of Frattini's character can be gained by looking at one of his eccentricities. He was a great admirer of the poems of Giuseppe Gioacchino Belli, a Roman poet who wrote around\n2\n,\n000\nsonnets in the Roman dialect. Belli's sonnets:-\n... ... express his revolt against literary tradition, the academic mentality, and the social injustices of the papal system. The ritualism of the church and the accepted principles of commonplace morality were also objects of his derision.\nFrattini recited the sonnets to his pupils in the Roman dialect in which Belli wrote them. This was reported to the authorities in Rome and a ministerial enquiry was set up. However\n[\n1\n]\n:-\n[\nFrattini\n]\ndeclared himself willing to replace these sonnets by the poetry of a highest undersecretary of education. Without further ado, he was allowed to continue his recitation of Belli's poetry.\nOne can feel from this episode that Frattini was probably an outstanding teacher and indeed this was the case. His belief was that to learn mathematics a student had to do more and read less. I\n[\nEFR\n]\nabsolutely agree with Frattini that one can only learn mathematics by doing mathematics, not by reading about how to do mathematics. Despite Frattini's belief that one should do mathematics rather than read mathematics, he did write a number of excellent books. These do indeed present mathematics in a concrete way\n[\n1\n]\n:-\n... bereft of superfluous abstraction and rich in elegant brilliance.\nThose who have seen the \"Frattini argument\" will agree that \"elegant brilliance\" is an apt phrase to describe that part of Frattini's work too.",
  "matematicos_citados_na_biografia": [
    "Battaglini",
    "Beltrami",
    "non-euclidean geometry",
    "Cremona",
    "group theory",
    "Jordan",
    "subgroup",
    "nilpotent",
    "differential geometry",
    "Euler",
    "Lagrange",
    "Gauss"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}