{
  "nome_completo": "Giulio Benedetto Isacco Vivanti",
  "nome_curto": "Giulio Vivanti",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vivanti/",
  "data_nascimento": "24 May 1859",
  "local_nascimento": "Mantua, Kingdom of Lombardy-Venetia, Austria (now Italy)",
  "data_morte": "19 November 1949",
  "local_morte": "Milan, Italy",
  "summary": "Giulio Vivanti was an Italian mathematician who worked in analysis. He suffered from anti-Jewish legislation later in his life.",
  "biografia": "Giulio Vivanti\n's parents were Guglielmo Vivanti\n(1831\n-\n1903)\nand Regina Colorni\n(1831\n-\n1863)\n. Guglielmo Vivanti, the son of Giuseppe Vivanti and Ester Rossena, was a landowner who had qualified with a law degree. It was a Jewish family and at the time Giulio was born they were living at No\n3\nvia Tubo Casa in Mantua\n(\nnow renamed via Bertani\n)\n. In\n1862\nGiulio's sister Clelia was born. The city of Mantua, where the Vivanti family lived, had become part of the Austrian Empire under the Congress of Vienna in\n1815\nbut just a few years before Giulio was born there was a revolt against Austrian rule which was suppressed by the Austrian army. This episode was an important step in the beginning of the unification of Italy. Before Giulio began his secondary school studies, the family moved to No\n3\nAgnello Casa\n(\nnow renamed via Agnelli\n)\nin Mantua.\nIn\n1869\nVivanti began his studies at the Liceo-ginnasio Virgilio of Mantua. His achievements there were outstanding and on\n27\nSeptember\n1876\nhe was examined for his high school diploma earning the top mark in all his subjects. His examiners gave him a special merit in Italian and in physics. At this stage in his education, Vivanti decided that he wanted to study engineering and he entered the Polytechnic of Turin to study that subject, He was awarded his civil engineering degree in\n1881\nbut the mathematics he had studied as part of this degree convinced him that mathematics was the subject for him and he entered the University of Bologna where he was taught by\nCesare Arzelà\nand\nSalvatore Pincherle\n. He was awarded his laurea in mathematics from Bologna on\n30\nJune\n1883\n. He then began teaching at the University of Bologna, in particular teaching courses on algebraic number theory.\nOn\n25\nJanuary\n1887\n, Vivanti married Enrichetta Bianchini, the daughter of a 'landowner' from Padua. Giulio and Enrichetta Vivanti had five children: Eduardo Guglielmo Isacco Vivanti\n(\nborn in\n1887)\n, Regina Vivanti\n(\nborn\n1888)\n, Anna Vivanti\n(\nborn\n1890)\n, Leo Vivanti\n(\nborn\n1892)\nand Alberto Vivanti\n(\nborn\n1893)\n.\nVivanti obtained his 'libera docenza'\n(\nsimilar to the habilitation in that it is the 'right to teach'\n)\nin infinitesimal calculus at the University of Bologna on\n13\nMay\n1892\n. This was transferred to the University of Pavia in\n1893\n. He had entered several competitions for professorships before this date, for example he entered one for Modena in\n1887\nand in the one for Turin in\n1890\n.\nOn\n23\nOctober\n1892\nVivanti sent a note to\nGiuseppe Peano\nfrom Mantua entitled\nSull'uso della rappresentazione geometrica nella teoria aritmetica dei numeri complessi\nⓉ\n(\nOn the use of geometric representation in the arithmetic theory of complex numbers\n)\nfor publication in the\nRivista di Matematica,\nof which\nPeano\nwas the editor-in-chief. Vivanti introduced the note having arisen from the course he was teaching on this topic\n(\nsee, for example\n[\n1\n]\n)\n:-\nWhile teaching a course on the general theory of algebraic numbers, I came to observe that the theory of complex whole numbers assumes a fairly clear and intuitive form thanks to the constant recourse to geometrical representation. Here I outline the part of my lessons that refers to the above mentioned theme, in the hope that it might be of some interest to readers of the 'Rivista' from a didactic point of view. For brevity's sake. I will omit all that reflects the extension of elementary operations to complex numbers, an extension to be carried out in conformity with\nHankel\n's 'principle of the permanence of formal rules'.\nHe worked at Pavia as professor in the\nScuola Normale\nfor three years until\n1895\n. His work there was described in a letter dated\n19\nDecember\n1895\nby Carlo Formenti, Dean of the Faculty of Mathematics, written to the rector of the university\n[\n4\n]\n:-\nProf Giulio Vivanti, in addition to the service provided in this Royal University, as Internal Professor of the normal school, mathematical section, annexed to the Faculty of Science, and in addition to acting as substitute in algebraic analysis and analytical geometry that he did during the last year during the illness of Prof G Platner, he also held a free course on 'The theory of the algebraic resolution of equations' a course approved by the Faculty of Science\n[\n...\n]\nThe service provided by Prof Vivanti in this university was constantly praiseworthy for zeal and diligence, all the more because he knew how to be loved by the students for his skill in educating them and for the love and the patience with which he advised them and followed them in their studies, as well as being able to be appreciated by the professors who were his colleagues for the firm and extended culture which he required for the office of which he was in charge.\nIn December\n1895\nhe was appointed as extraordinary professor of infinitesimal calculus at the University of Messina. In\n1897\nhe entered a competition for the chair of infinitesimal calculus at the University of Modena. A committee, with\nUlisse Dini\nas president, considered Vivanti's application along with that of seven other candidates, namely Italo Zignago,\nMineo Chini\n,\nOnorato Nicoletti\n, Rodolfo Bettazzi, Domenico Amanzio, Orazio Tedone and Giuseppe Lauricella. A report of the findings of the committee appeared in\n[\n3\n]\nand we give a version of their evaluation of Vivanti:-\nDr Giulio Vivanti, a graduate with a laurea in mathematics from Bologna in\n1883\n, obtained a 'libera docenza' teaching position in infinitesimal calculus, which was then transferred to Pavia. He taught there as an internal professor in the school of education. Since December\n1895\nhe has been an extraordinary professor of infinitesimal calculus in Messina. He presents\n52\noriginal printed works, reviews, translations and lithographed courses. The first\n19\nworks were already judged in the calculus competition in Modena in\n1887\nand in the one in Turin in\n1890\n. The Commissions said that these works demonstrate a lot of ease of assimilation and versatility of talent, in spite of some errors that were detected there. The numerous works that Vivanti published after\n1890\nrefer in part strictly to calculus, and partly to the most varied branches of mathematics with greater relevance to the chair in this competition. It would be too much to expose here in this place the complete and minute analysis made by the Commission. To remember the works that are most pertinent to questions of calculus, we will limit ourselves to hinting at the interesting question proposed with the memoir: \"On the series of powers whose coefficients depend on a variable\". - The attempts made with the work \"Preliminaries for the study of the functions of two variables\", are praiseworthy. The book \"The concept of the infinitesimal and its application to mathematics\" shows that Vivanti has a vast historical, literary and bibliographical knowledge. These qualities are further confirmed by the work \"Theory of sets\", where Vivanti publishes the complete collection of the propositions so far known relative to the interesting continuous groups, connected sets of points, of transfinite numbers, on the order types, etc., with the bibliographic list of\n70\nworks on this subject. There Vivanti tries also to understand and know how to handle the theories of mathematical logic. The works on the application of the function can also be noted in the\nPoncelet\npolygons, on the surfaces of constant mean curvature, icosahedral irrationality, contact transformations, the theory of partial derivatives of the\n2\nnd order, the extension of the\nAmpère\nmethod, on the integral polydromes of differential equations, and not a few others. Nor should the lithographed courses on analytic geometry, calculus and other parts of mathematics, held in Bologna, Pavia, and Messina, and which together have their merits, be kept in silence. Finally one must take into account the various years of lecturing, in which he gave splendid evidence of talented teaching. Together with all these works, Vivanti shows that he continues to be an indefatigable worker, and if he does not leave deep footprints in the various parts he has dealt with, he knows how to make himself master of each one, using it with ease. His mathematical culture is undoubtedly the most varied; and he demonstrates a special aptitude for his own research.\nFor a list of Vivanti's publications, including the\n52\nthat he submitted for the competition for the chair at Modena, see\nTHIS LINK\n.\nThe committee ranked Vivanti first followed by Bettazzi and Tedone. However, Vivanti must have turned down the chair at the University of Modena for he remained at the University of Messina where he became a full professor in\n1901\n. In addition to the regular mathematics courses he also taught a course of mathematics aimed at students of natural science since it was felt that such students did not have the necessary background in the subject.\nOn\n1\nDecember\n1907\nVivanti requested a transfer to the University of Pavia. He was Dean of the Faculty of Science of the University of Pavia for the three years\n1914\n-\n17\n, resigning from that position in March\n1917\n; he was also Dean of the same Faculty from\n1920\nuntil\n1924\n. In\n1924\nVivanti moved to the University of Milan. This was a new university, founded in\n1924\nfrom the merger of two older institutions. At this new university he taught Higher Analysis, Differential Geometry, Mathematical Analysis, Algebraic Analysis and Infinitesimal Analysis. He was head of the Faculty of Science from\n1930\nto\n1932\n, a member of the board of directors from\n1926\nto\n1934\n, and director of the advanced course in applied mathematics from\n1932\nto\n1934\n. Salvatore Coen writes\n[\n1\n]\n:-\nThanks to his mastery of modern languages, he was solidly inserted in the international mathematical community, above all in that of Germany, where his indefatigable activity as reviewer for the 'Jahrbuch über die Fortschriften der Mathematik'\nⓉ\n(\nYearbook on the progress of mathematics\n)\nwas well-known\n(\nhe published a total of\n1\n,\n740\nreviews between\n1884\nand\n1938)\n. Vivanti was, moreover, sensitive to didactic issues. The clearest testimony to his teaching skills lies in his nineteen university and six secondary school textbooks, together with the clearly-explained booklets published by Hoepli on analytic functions, on integral equations, and on polyhedric and modular functions, some of which were translated into German and favourably received in Italy and abroad. Given his training and his academic activities, it was natural that Vivanti's collaboration on the 'Enciclopedia delle Matematiche Elementari' was primarily focused on analytic slope. He contributed two articles on this matter and oversaw their coordination with other related entries. Member of the Pavia section of Mathesis, and later, starting from\n1925\n, President of the Milan section, he was nonetheless only fully involved in the first volume of the Enciclopedia. Subsequently, his role became increasingly marginal and eventually ceased altogether, partly as a result of his blindness, and partly because of the racial laws, which led to his marginalisation from the academic world.\nFor reviews of the\nEnciclopedia delle Matematiche Elementari\nⓉ\n(\nEncyclopedia of Elementary Mathematics\n)\n, see\nTHIS LINK\n.\nIn\n[\n4\n]\nVivanti's activities relating to the Royal Virgilian Academy of Sciences, Letters and Arts of Mantua are discussed. We give some details below. On\n12\nJune\n1892\nhe addressed the Academy delivering the lecture \"The infinite in nature and science\". The lecture \"was heard with the utmost attention, and when it ended it was greeted by long cordial applause.\" At the meeting of the Academy on\n21\nMay\n1893\na proposal was put forward, signed by seven members of the Academy, proposing that Vivanti be elected to the Academy which was unanimously approved. Vivanti responded with a letter sent from Mantua on\n24\nMay expressing his \"heartfelt gratitude for the high honour that the Academy wanted to appoint me as an effective member\". As a member of the Academy he was involved in its activities, in particular writing obituaries. However, by the\n1930\ns the political situation in Italy, with its Fascist government, made things increasingly difficult for Vivanti since he was a Jew. Vivanti wrote to the President of the Academy on\n14\nNovember\n1935\n. In this letter, as well as providing some data concerning his academic career and information related to his own scientific production, he indicated that he did not want to be registered with the National Fascist Party. At this stage he continued to be a member of the Academy but the royal decree of\n17\nNovember\n1938\n, \"Provisions for the defence of the Italian race\", led to the expulsion of Jews from universities and academies. Following this decree, eleven members of the Academy were expelled, including the mathematicians\nGino Fano\n,\nGino Loria\nand Giulio Vivanti. In a census of Jewish academics dated\n8\nOctober\n1938\nVivanti is described as \"registered with the Jewish community\" and \"professing the Jewish religion.\"\nVivanti had retired from teaching at the University of Milan in\n1934\nwhen he had reached the age of\n75\nand he had been appointed professor emeritus. However, the last ten years of his life must have been greatly saddened by the fact that his country Italy, which he had supported so passionately over the years, in some sense disowned him. Let us end this biography by looking a little at this passion he had shown for his country.\nItaly entered World War I in May\n1915\n. The country had remained neutral when war broke out in August\n1914\nand began to negotiate with both sides to see which would offer the most for their support. Eventually in April\n1915\n, at the Treaty of London, Italy joined France, Britain and Russia and one month later began military advances towards Austria-Hungary. Vivanti was in Pavia at this time and he became President of the Pavia Section of the \"General Union of Italian Teachers for the National War\". In this capacity he circulated fifteen messages to his fellow teachers and presidents of other Sections during the period\n1916\n-\n1918\n, the first being on\n9\nJune\n1916\n. In this message he said that during the first year of the war the Teachers of the Province of Pavia were worthy of the highest praise for the assistance they had given to soldiers\n[\n4\n]\n:-\n... always first in every useful initiative, always ready to offer their personal work and their help, they have rendered invaluable service to the great national cause.\nHe encourages the teachers to \"dedicate their efforts to hasten the inevitable final victory.\" Later missives called for \"a broad civil mobilization, which will leave all citizens who are fit for arms free for war\" and one sent out on\n14\nMay\n1917\nstated\n[\n4\n]\n:-\nMay the inevitable victory crown the efforts of our marvellous army very soon! On that day we will celebrate, together with the triumph of freedom, of civilization, of law, also that of the schools; because from the schools came those young heroes who peacefully lost their lives on the Alps and the Carso, also from the schools came those beneficial forces which supported our people during the long struggle.\nA month later he is proposing that school pupils assist in the war effort by working in military hospitals, and supporting the families of the military and of those killed in the war. The war had not gone well for Italy and in October\n1917\nthey had a military disaster at Caporetto which left many Italians dead, injured or captured. After the battle the Austrians began to occupy much of the Veneto.  By the beginning of\n1918\nVivanti was urging support for refugees from invaded areas, and by the middle of\n1918\nhe writes\n[\n4\n]\n:-\nAt this grave hour, in which the very existence of the Fatherland is at stake, it is our first need to render our work of assistance and propaganda more intense, assiduous, and more effective.\nVivanti was proposed for the honour of Knight of the Crown of Italy for his deep patriotic commitment during the war. One can only imagine how he must have suffered with the Fascist decrees to remove Jews from public offices.",
  "matematicos_citados_na_biografia": [
    "Cesare Arzelà",
    "Salvatore Pincherle",
    "Giuseppe Peano",
    "Peano",
    "Hankel",
    "Ulisse Dini",
    "Mineo Chini",
    "Onorato Nicoletti",
    "Poncelet",
    "Ampère",
    "THIS LINK",
    "Gino Fano",
    "Gino Loria"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}