{
  "nome_completo": "Gloria Rita Olive",
  "nome_curto": "Gloria Olive",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Olive/",
  "data_nascimento": "8 June 1923",
  "local_nascimento": "New York City, USA",
  "data_morte": "17 April 2006",
  "local_morte": "Dunedin, New Zealand",
  "summary": "Gloria Olive was an American mathematician who worked on on applications of generalised powers.",
  "biografia": "Gloria Olive\nwas the daughter of Lazar Olive\n(1876\n-\n1956)\nand Florence Goldstein\n(1889\n-\n1960)\n. Lazar Olive was born on\n13\nOctober\n1876\nin Poland\n(\nalthough formally it was Russia at this time\n)\nand emigrated to the USA. At the time of the World War I Registration in\n1918\nhe gives his occupation as a 'self-employed clothing and furs manufacturer'. The Registration shows he was naturalised, married to Flora Olive and living at\n534\nWest\n178\nStreet, apartment\n23\n, in Manhattan, New York City. The data he gives in the census records of\n1915\n,\n1920\n,\n1925\n,\n1930\n, and\n1940\nconcerning his name, age, date of immigration to the United States and date of naturalisation appears to be somewhat inconsistent. His name appears as Louis\n(1915\n,\n1940)\n, Lazaar\n(1920\n,\n1925)\nand Lazar\n(1930)\n, his age is given as\n36\n(1915)\n,\n36\n(1920)\n,\n47\n(1925)\n,\n55\n(1930)\nand\n65\n(1940)\n, he immigrated in\n1910\n(1915\n,\n1920)\n,\n1905\n(1925)\n,\n1895\n(1930)\n. He is consistent as giving his occupation as the fur trade but his daughter Gloria said he was\n[\n3\n]\n:-\n... a lawyer, businessman and amateur mathematician.\nFlorence was born on\n20\nAugust\n1889\nin New York, the daughter of Polish immigrants. Like her husband, her age is inconsistent on the census records. Lazar and Florence Olive had two children, a son Milton Olive born on\n1\nApril\n1914\nin New York, who became a photographer, and Gloria Olive, the subject of this biography. Gloria said that her mother\n[\n3\n]\n:-\n... gave so much and expected nothing in return.\nIn\n1930\n, the Olive family moved to Brighton Beach, Brooklyn. Gloria Olive completed her school education at Abraham Lincoln High School in Brooklyn, New York, graduating in\n1940\n. She said\n(\nsee\n[\n2\n]\n)\nthat while at this High School she was more interested in ball games than in mathematics. In fact she made quite a name for herself as a sportswoman\n[\n4\n]\n:-\nIn\n1938\nshe was the Manhattan Beach Women's Table Tennis Champion, and pitched for the Manhattan Beach Women's Softball Team at Madison Square Garden.\nAfter graduating from the Abraham Lincoln High School she entered Brooklyn College in New York where her intention was to continue her sporting interests and study for a degree in Physical Education. This, however, required her to take courses on biological sciences so she changed her mind and began to study mathematics. Perhaps the most famous of her lecturers was\nJesse Douglas\nwho had been awarded the\nFields Medal\nat the International Congress of Mathematicians at Oslo in\n1936\n. She also took courses by Moses Richardson\n(1911\n-\n1968)\nand Walter Prenowitz\n(1906\n-\n2000)\n. She graduated from Brooklyn College with an B.A. in\n1944\n. After graduating, Olive was appointed as a Graduate Assistant at the University of Wisconsin where she spent the two academic years\n1944\n-\n46\n. The chairman of the Mathematics Department at Wisconsin was Rudolf Ernest Langer\n(1894\n-\n1968)\nwho had studied at Harvard University for his Ph.D. advised by\nG D Birkhoff\n. Olive described in her talk\n[\n9\n]\nher arrival at Wisconsin to take up her appointment:-\nIt was a Monday and I asked the secretary if I could make an appointment to see Professor Langer that afternoon. She replied, \"Professor Langer is never here in the afternoon.\" So, I asked, \"How about tomorrow morning?\" and she said \"Professor Langer is never here on Tuesday.\" I was glad to be able to see Professor Langer on Wednesday morning. When I arrived, he was most gracious and asked about my trip to Madison ... He then asked if I had found a place to live. When I told him I had, he said he would like to have my address and so, he called out to his secretary\n(\nin his Harvard accent\n)\n: \"Ms Meyer, Ms Meyer.\" When there was no response, he called out to his other secretary: \"Ms Smith, Ms Smith.\" When she also failed to respond, I said, \"I guess you'll have to write it down yourself.\"\nIn addition to teaching she studied for her Master's Degree during these two years and was awarded the degree of M.A. in\n1946\n. She had taken courses at Wisconsin from Richard Hubert Bruck\n(1914\n-\n1991)\n, who had been a student of\nRichard Brauer\nat Toronto, Herbert P Evans, Rudolf Ernest Langer, and\nCyrus Colton MacDuffee\n.\nFrom Wisconsin, Olive moved to the University of Arizona in\n1946\nwhere she was appointed as an instructor. After two years she was appointed to Idaho State University where again she spent two years teaching as an instructor. Her next appointment in Oregon State University in\n1950\nwas as a Graduate Assistant and after this one-year post she left the academic world for a short time, taking a job as a cryptographer in the U.S. Department of Defense in Washington, D.C. After a year in Washington, Olive returned to an academic position being appointed to Anderson College in\n1952\n.\nThe Anderson Bible Training School had been founded in\n1917\nas an educational establishment to train leaders and workers for a life in the church. It rapidly developed a broader, more general, education program, and changed its name first to Anderson College and Theological Seminary, and then to Anderson College. At Anderson College, Olive built up the mathematics department and began to become interested in mathematical research, in particular studying generalised powers.\nC C MacDuffee\n, who had taught Olive at the University of Wisconsin, agreed to accept a visiting professorship at Oregon State University so that he could supervise her doctoral thesis. Sadly he died in\n1961\nand Olive was left without a thesis advisor. However she was awarded a Ph.D. for her thesis\nGeneralized Powers\nin\n1963\n. She wrote in\n[\n7\n]\n:-\nThis paper is essentially the author's Ph.D. thesis at Oregon State University\n(1963)\nand was written while an NSF Science Faculty Fellow. The kindness of the late Professor\nC C MacDuffee\nis gratefully acknowledged and this paper is dedicated to his memory.\nOlive continued to work at Anderson College until\n1968\nwhen she accepted a professorship at the University of Wisconsin-Superior. She left the mathematics department in Anderson College, of which she had been the chair, with three members of staff who were her former students. The educational establishment she joined had been accredited as Superior Normal School in\n1916\n, then ten years later became Superior State Teachers College. By\n1951\nit had changed its name to Wisconsin State College-Superior, and then in\n1964\nit became a university, although at this stage it was not part of the University of Wisconsin. While at the University of Wisconsin-Superior, she became a founder member of the Association for Women in Mathematics.\nLenore Blum\nwrites\n[\n1\n]\n:-\nThe formal idea of women getting together and forming a caucus was first made publicly at a Mathematics Action Group meeting in\n1971\nin Atlantic City. Joanne Darken, then an instructor at Temple University and now at the Community College of Philadelphia, stood up at the meeting and suggested that the women present remain and form a caucus. I have been able to document six women who remained: me\n(\nI was a graduate student at Maryland at the time\n)\n, Joanne Darken,\nMary Gray\n(\nshe was already at American University\n)\n, Diane Laison\n(\nthen an instructor at Temple\n)\n, Gloria Olive and Annie Selden.\nOlive stayed at the University of Wisconsin-Superior until\n1972\n, the year after it joined the University of Wisconsin, and went to New Zealand where she was appointed as a senior lecturer at the University of Otago. Is the article\n[\n6\n]\nshe wrote while at University of Wisconsin-Superior giving her opinion of the Mathematics Department there? It begins:-\nOne day when the boat was rocked, a passenger observed that the rudder broken. He immediately ran and told the Captain. The Captain replied. \"There's no need to worry - for if the boat is not rocked again, the broken rudder won't show.\" A Captain with this philosophy is doomed to be the Captain of a sinking ship! On the other hand, a Captain who recognises the seriousness of the problem and somehow is able to arrange a replacement for the defective rudder, at least has a fighting chance to save his ship. A comparable situation exists when a key Department in a University has a Chairman who is committed to the destruction of his own Department. For in this role the Chairman serves as the broken rudder on the University Ship. The rudder must be replaced if the University is to survive! If the Department does not have any boat-rockers, there will not even be any passengers who will report the broken rudder to the Captain. If the Captain is fortunate enough to be informed of the broken rudder, the ship will still be doomed if the Captain deludes himself into thinking that there will be no danger if he is able to keep the boat from rocking, for then no one would see the broken rudder! And one way to keep the boat from rocking is to fill the Department with mice, for every one knows that mice are not capable of rocking boats! Also, mice might find it more comfortable to ride on a broken rudder!\nWhoever this is aimed at, it says something quite revealing about Gloria Olive's character. Peter Fenton knew Olive at Otago University and his memories also give us an insight into her character\n[\n4\n]\n:-\nGloria was a senior colleague, and of course a woman, in a department largely made up of youngish males with new PhDs, kindly enough but sure of ourselves and quick to judge. Her view that teaching should be student-centred fell on deaf ears. Her exam results were consistently higher than others, and examiners meetings took a familiar form, Gloria putting her arguments against scaling, with a freshness as though she were making them for the first time, and with so much energy that for much of the meeting she was standing, and frequently gesturing, at her seat, the rest of us putting, with stony patience\n(\nif only in our minds\n)\n, the counter-arguments. Invariably the rest of us prevailed. But she never gave up. On the wall of her living room hung a picture of Abraham Lincoln, with a quotation one presumes she identified with: Let us have faith that right makes might; and in that faith let us to the end, dare to do our duty as we understand it. My own relationship with Gloria was instantly turbulent. We shared the first-year calculus course, Gloria taking the afternoon stream and I the morning stream. This required regular meetings in her office to ensure that we were synchronised. She found me inflexible and wrong-headed. I found her prescriptive and condescending. Over time we forgave each other, though nothing was said, and a warmth, even affection, developed between us.\nShe continued as a senior lecturer at the University of Otago until she retired in\n1989\n.\nMac Lane\nand Rayner wrote on her retirement\n[\n5\n]\n:-\nFor all of her time with the Mathematics and Statistics Department of Otago University, Gloria has been the only female on the staff with tenure, and as such has been a shining example to both staff and students. She has fought hard for the issues she championed, and contributed to several worthwhile changes\n(\nsuch as the current internal assessment policy applauded by both staff and students\n)\n. Her colleagues will miss her lively contributions to the debates in departmental meetings.\nMuch of Olive's research was on applications of generalised powers. She published papers such as\nBinomial functions and combinatorial mathematics\n(1979)\n,\nA combinatorial approach to generalized powers\n(1980)\n, Binomial functions with the Stirling property\n(1981)\n,\nSome functions that count\n(1983)\n,\nTaylor series revisited\n(1984)\n,\nCatalan numbers revisited\n(1985)\n,\nA special class of infinite matrices\n(1987)\n, and\nThe ballot problem revisited\n(1988)\n.\nMac Lane\nand Rayner write\n[\n5\n]\n:-\nSome of her work on binomial functions overlaps that of\nGian-Carlo Rota\n's \"polynomials of binomial type\". She has had a special interest in the polynomials which are generated by her generalised powers, and hopes that someone will prove or disprove her conjecture, now about\n30\nyears old, that all their zeros lie on the unit circle. This conjecture has now been verified for infinitely many special cases.\nIn\n1973\nshe published the book\nMathematics for the Liberal Arts Students\n(\nsee\n[\n8\n]\n)\n. The Preface begins:-\nThis book is designed for a wide variety of college and university students, including those who have never had a course in high school mathematics. It is written in the hope that these students and others will want to become involved in mathematics so that they can learn to appreciate, understand, use, and enjoy it. A major objective is to present an interesting approach to mathematics that does not involve complicated algebraic manipulations. The topics were chosen on the basis of affirmative answers to each of the following questions:\n(1)\nIs it mathematically significant?\n(2)\nIs it easy to understand?\n(3)\nIs it interesting?\nDuring her years in New Zealand, she served on the Council of the\nNew Zealand Mathematical Society\nand was the convener of the New Zealand National Committee for Mathematics. She retired in\n1989\nand in that year was invited to address the\nMathematical Association of America\n's joint meeting with the\n852\nnd meeting of the\nAmerican Mathematical Society\nheld at Ball State University in Muncie, Indiana on\n27\n-\n28\nOctober\n1989\n. She gave the Invited Address\nDoes Rudolf Steiner have the answer?\nPeter Fenton describes Olive's final illness\n[\n3\n]\n:-\nGloria Olive died at Redroofs, a nursing home in Dunedin\n[\nNew Zealand\n]\n, on\n17\nApril\n2006\n. She had been ill for several months. Towards the end of her life, Gloria relied on a thick magnifying glass to read, but eventually even that proved ineffective, and when she was no longer able to walk she consciously allowed herself to die. There was a death notice in the 'Otago Daily Times' but, at Gloria's request, no funeral. She left her body to medical science.",
  "matematicos_citados_na_biografia": [
    "Jesse Douglas",
    "Fields Medal",
    "G D Birkhoff",
    "Richard Brauer",
    "Cyrus Colton MacDuffee",
    "C C MacDuffee",
    "Lenore Blum",
    "Mary Gray",
    "Mac Lane",
    "Gian-Carlo Rota",
    "New Zealand Mathematical Society",
    "Mathematical Association of America",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}