{
  "nome_completo": "Friedrich Ludwig Gottlob Frege",
  "nome_curto": "Gottlob Frege",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frege/",
  "data_nascimento": "8 November 1848",
  "local_nascimento": "Wismar, Mecklenburg-Schwerin (now Germany)",
  "data_morte": "26 July 1925",
  "local_morte": "Bad Kleinen, Germany",
  "summary": "Gottlob Frege was a German mathematician who was one of the founders of modern symbolic logic putting forward the view that mathematics is reducible to logic.",
  "biografia": "Gottlob Frege\n's parents were Alexander Frege and Auguste Bialloblotzky. Alexander Frege was the head of a girls' high school in Wismar and it was in that town that Gottlob was born. Wismar, in northern Germany, is situated on an inlet of the Baltic Sea. It had been administered by the Mecklenburg-Schwerin state since\n1803\nbut at the time when Gottlob was born there, the town was still claimed by Sweden, the country which had controlled it from the Peace of Westphalia in\n1648\nuntil\n1803\n. It is thought that Gottlob's mother was from a family which did not originate in that area but was probably of Polish origin.\nGottlob grew up in Wismar, attending the local\nGymnasium\nwhere he was taught by Leo Sachse. It was almost certainly through following Sachse's advice that Frege chose to go to the University of Jena to continue his studies and in general Sachse had a large influence on his young student\n(\nsee for example\n[\n48\n]\nand\n[\n54\n]\n)\n. Frege was proud to live in the state of Mecklenburg, he loved the ducal house of Mecklenburg, and certainly believed in this form of government rather than a democratically elected one. A period of great political change in this part of Europe was approaching and events began to move quickly in\n1866\n. Before looking at these events, however, we should note that\n1866\nwas the year in which Alexander Frege, Gottlob's father, died.\nIn fact the political change which set events in motion was Otto von Bismarck becoming prime minister of Prussia in\n1862\n. Bismarck saw that Prussia's leading role would be best served by the unification of the German states such as Mecklenburg, but Austria opposed this course. The resulting Seven Weeks' War in\n1866\nsaw Mecklenburg side with Prussia against Austria and the Prussian victory led to the setting up of the North German Confederation, with Mecklenburg as a member, in\n1867\n. When Frege went to the University of Jena in\n1869\nit was a politically changed Europe, and during the two years that he studied there more changes were to take place. Prussia led the German states to victory over France in the Franco-Prussian War of\n1870\n-\n71\nand in\n1871\nthe German Reich\n(\nGerman Empire\n)\n, with William I of Prussia as its emperor, came into existence.\nAt Jena Frege was taught by\nErnst Abbe\nand K Fischer. After his two years of study at the University of Jena, Frege continued his education in\n1871\nentering the University of Göttingen where he studied courses in mathematics, physics, chemistry and philosophy. He received his doctorate in\n1873\nfrom Göttingen for a dissertation\nÜber eine geometrische Darstellung der imaginären Gebilde in der Ebene\nⓉ\n(\nOn a geometric representation of imaginary structures in the plane\n)\n, in which he tried to lay down foundations for a portion of geometry. The thesis was published at Jena in the same year that he was awarded his doctorate. Supported by\nAbbe\n, he presented his\nhabilitation\nRechnungsmethoden, die sich auf eine Erweitung des Grössenbegriffes gründen\nⓉ\n(\nAccounting methods, which are based on a concept enhancement of the field size\n)\n, essentially a work on abelian groups and\ninvariant theory\n, to the University of Jena in\n1874\nand was appointed as a\nPrivatdozent\nin mathematics in Jena in May of that year. He taught there for the rest of his career, carrying out his job quietly with minimal contacts with his students and colleagues. However Rudolf Eucken was a colleague of Frege's for more than\n40\nyears in the faculty of philosophy with whom he had close scientific contacts. Eucken - like\nRussell\nand Sartre - was one of the few philosophers who were awarded the Nobel Prize in Literature\n(1908)\n. Before Frege had published any of his major pieces of work, his mother died in\n1878\n.\nFrege was one of the founders of modern symbolic logic putting forward the view that mathematics is reducible to logic. He lectured on all branches of mathematics, in particular analytic geometry, calculus, differential equations, and mechanics, although his mathematical publications outside the field of logic are few. His writings on the philosophy of logic, philosophy of mathematics, and philosophy of language are of major importance. He once said:-\nEvery good mathematician is at least half a philosopher, and every good philosopher is at least half a mathematician.\nIn\n1879\nFrege published his first major work\nBegriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens\nⓉ\n(\nConcept notation, an arithmetic formula modeled language of pure thought\n)\n. A George and R Heck write in\n[\n45\n]\n:-\nIn\n1879\n, with extreme clarity, rigour and technical brilliance, he first presented his conception of rational justification. In effect, it constitutes perhaps the greatest single contribution to logic ever made and it was, in any event, the most important advance since\nAristotle\n. For the first time, a deep analysis was possible of deductive inferences involving sentences containing multiply embedded expressions of generality. Furthermore, he presented a logical system within which such arguments could be perspicuously represented: this was the most significant development in our understanding of axiomatic systems since\nEuclid\n.\nIn this work Frege presented for the first time what we would recognise today as a logical system with negation, implication, universal quantification, essentially the idea of truth tables etc., but what would not be recognisable today is the notation which Frege used. For the implication\nA\n⇒\nB\nA \\Rightarrow B\nA\n⇒\nB\n, Frege used a notation which was placed across two lines with\nA\nA\nA\nbeing written on the line below\nB\nB\nB\n. It is not hard to see why his notation has not survived, but we should not allow this in any way to diminish the magnitude of his achievement. The publication of the\nBegriffsschrift\nwas followed in the same year by Frege's promotion, again supported by\nAbbe\n, to Extraordinary Professor at Jena but on the whole his remarkable work led to surprisingly little recognition for him. Very few people seemed to be able to appreciate the importance of this landmark publication. However, in contrast to his later treatises, the\nBegriffsschrift\nreceived six reviews: from Reinhold Hoppe,\nJohn Venn\n,\nPaul Tannery\n, Kurd Lasswitz, Karl Michaëlis and\nErnst Schröder\n. The first three of these reviews, however, show that their authors are uninterested in Frege's treatise, while the latter three, despite some criticisms, are more sympathetic\n(\nsee\n[\n81\n]\nfor more details\n)\n.\nIt is reasonable to ask what prompted Frege to produce the revolutionary\nBegriffsschrift\nⓉ\n(\nConcept notation\n)\n. He wanted to have a precise way of stating results and of proving them, for he realised the difficulties of using ordinary language which was necessarily imprecise and ambiguous. He stated in the Preface to the work that he wanted to prove the basic truths of arithmetic \"by means of pure logic\". This aim makes Frege the first to fully develop the main thesis of logicism, that mathematics is reducible to logic. However, we should note that he only applied the thesis to number theory and real analysis. His next major work\nDie Grundlagen der Arithmetik\nⓉ\n(\nFoundations of Arithmetic\n)\n, published in\n1884\n, was written to achieve the aim that he had clearly set out in the Preface to the earlier work and present an axiomatic theory of arithmetic.\nAfter setting his agenda at the start of the\nGrundlagen\nⓉ\n(\nFoundations of Arithmetic\n)\n, Frege looked at the contributions made by previous mathematicians to two fundamental questions:-\nWhat are numbers? What is the nature of arithmetical truth?\nIn fact he demolishes all earlier attempts to answer these questions with brilliant clarity. Perhaps it will come as a surprise to readers of this article to learn that all attempts to define \"number\" before Frege contained logical errors. Indeed this is precisely what he showed, for these earlier definitions had confused the idea of \"number\" with that of \"plurality\". The plurality \"two\" refers to a collection of two objects, for example two chairs, two pencils, two houses, etc. The number \"two\" is, however, the class of all instances of the \"plurality two\" and so is a \"plurality of pluralities\" and the logical error which had been made in not recognising this meant that before Frege's\nGrundlagen\nnobody had managed to give a logically correct definition of \"number\". Frege then went on to give his own definitions of the basic concepts of arithmetic based purely on logic, and from these he deduced, again using pure logic, the basic laws of arithmetic. Dummett writes\n[\n39\n]\n:-\nThe work is fascinating even for those quite uninterested in the philosophy of mathematics, since in the course of it many ideas are presented which are of significance for the whole of philosophy.\nWhat was the reaction to the\nGrundlagen\nfrom mathematicians and philosophers? One might have expected an enormous amount of interest, but this did not materialise. The\nGrundlagen\nonly received a single review and that was by\nCantor\n. What did\nCantor\nthink of this brilliant book? Dummett writes that the review\n[\n2\n]\n:-\n... was a devastatingly hostile one by\nGeorg Cantor\n, the mathematician whose ideas were the closest to Frege's, who had not bothered to understand Frege's book before subjecting it to totally unmerited scorn.\nThe\nGrundlagen\nwas a non-technical work, written without symbolism and with only sketches of proofs, which Frege saw as a first step towards the realisation of his goal of defining a precise logical framework in which to set up the basic concepts of arithmetic and to deduce the rules of arithmetic. Although he was extremely disappointed at the reaction to the\nGrundlagen\nnevertheless in the following years he wrote a number of articles which polished and extended the ideas which he would need to carry out his project. Dummett calls these:-\n... a series of brilliant philosophical articles in which he elaborated his philosophy of logic.\nLet us look briefly at one of these, namely\nÜber Sinn und Bedeutung\nⓉ\n(\nOn sense and importance\n)\npublished in\n1892\n. In this he gives his famous argument to show that sense and reference are distinct. His example concerns the planet Venus which was known as \"the evening star\" and as \"the morning star\" before it was realised that both were Venus. Frege argues: \"the evening star\" = \"the morning star\" does not have the same sense as \"the evening star\" = \"the evening star\" so \"the evening star\" does not have the same sense as \"the morning star\". However \"the evening star\" and \"the morning star\" refer to the same object so the reference of \"the evening star\" is distinct from its sense.\nIn\n1893\nDie Grundgesetze der Arithmetik, Volume\n1\nⓉ\n(\nThe basic laws of arithmetic, Volume\n1\n)\nappeared in which Frege set up a formal logical system with more rules of inference than that of his earlier work the\nBegriffsschrift\n.  Frege axiomatized arithmetic with an intuitive collection of axioms, and proofs of\nnumber theory\nresults which he had only sketched earlier he now gave formally. The main thrust of this volume was to develop the rules of number theory and in the later volumes Frege intended to extend the work to the real numbers. His bitter disappointment at the lack of reaction to his earlier work shows explicitly in the Preface to Volume\n1\nwhere he complains about other authors being unfamiliar with his ideas. He must have hoped that this first volume of what he viewed would be his greatest achievement would be well received, but except for one review by\nPeano\n, it was ignored by his contemporaries.\nFrege, who had not allowed the previous lack of reaction to divert him from the tasks that he had set himself, decided to delay publication of the second of his three proposed volumes. During this period Frege was appointed ordinary honorary professor at Jena, a post funded by the Carl Zeiss Foundation with which\nAbbe\nwas closely associated. In fact it would be ten years after the publication of Volume\n1\nof\nDie Grundgesetze der Arithmetik\nbefore Volume\n2\nappeared. This second volume gives Frege's development of the real numbers which he constructed straight from the integers without taking the route of first defining the rational numbers. The bitterness which he now felt shows clearly in this volume with his attacks on the work of earlier mathematicians being abusive\n(\nwhich it had never been before\n)\nand there were clear signs that he was hitting back at those he felt had ignored his contributions. In particular he strongly criticised\nCantor\n's and\nDedekind\n's theories of irrational numbers. After the work was written, but before it was published, Frege discovered that this volume, and Volume\n1\n, were based on inconsistent axioms.\nWhile Volume\n2\nof\nThe Basic Laws of Arithmetic\nwas at the printers Frege received a letter\n(\non\n16\nJune\n1902)\nfrom\nBertrand Russell\n.\nRussell\npointed out, with great modesty, that the\nRussell\nparadox gave a contradiction in Frege's system of axioms. After many letters between the two, Frege modified one of his axioms and explains in an appendix to the book that this was done to restore the consistency of the system. However with this modified axiom, many of the theorems of Volume\n1\ndo not go through and Frege must have known this. He probably never realised that even with the modified axiom the system is inconsistent since this was only shown by\nLesniewski\nafter Frege's death.\nOne often sees it stated that Frege's work was worthless because of the inconsistency pointed out by\nRussell\n. In fact this is far from the truth and one must view Frege as the person who made one of the most important contributions to the foundations of mathematics that has ever been made. In fact in many ways\nRussell\nis correct when he wrote in his\nHistory of Western Philosophy:-\nIn spite of the epoch-making nature of\n[\nFrege's\n]\ndiscoveries, he remained wholly without recognition until I drew attention to him in\n1903\n.\nFrege's influence in the short term came through the work of\nPeano\n,\nWittgenstein\n, Husserl, Carnap and\nRussell\n. In the longer term, however, Frege has become a major influence on the development of philosophical logic and the man who seems to have been largely ignored by his contemporaries has been avidly read by many in the second half of the twentieth century, particularly after his works were translated into English.\nAnother statement that one often reads is that Frege was so depressed after\nRussell\n's letters that he gave up research. This is not entirely without foundation and it is certainly true that he never published the intended third volume of\nThe Basic Laws of Arithmetic\n, but although he did indeed become very depressed the reasons are far more complex than this. Another factor in his depression was the death of his wife Margarete. Frege had married Margarete Lieseberg but they never had any children. Frege and his wife did adopt a son, Alfred, who went on to become an engineer, but after Frege's wife died in\n1904\nhe seemed to sink more deeply into himself.\nThe political situation in Germany distressed him. Frege, as we have mentioned, was a firm believer of the old style monarchy which operated in the German States before the unification. In the German Empire there was a democratically elected parliament, in addition to the mostly undemocratic state parliaments. Frege disliked the move to democracy, and detested it even more as the socialists gained power. He attacked most of his fellow mathematicians going far beyond professional criticism. For example\nThomae\n, who also taught at Jena, came in for severe personal attacks from Frege. He seemed to lash out at a wide variety of people and his diary shows a deep hatred of the French, of Catholics, and of Jews.\nFrege retired from his professorship in Jena in\n1917\n. He had published nothing between\n1904\nand the time he retired\n(\nif one discounts bitter argumentative attacks published against fellow mathematicians such as\nThomae\n)\n.\nRussell\nhad invited him to address a mathematical congress in Cambridge in\n1912\nbut Frege's reply, declining the invitation, shows his depressed state of mind. This was not the reply one would have expected from the man who had earlier been vividly aware of his own genius and had a total belief that his brilliant ideas would be recognized. However, Frege began to publish important articles again in\n1918\nwith contributions to the nature of thoughts. These publications have the freshness of his earlier work and show that the depression which had gripped him for many years had, at least partially, lifted. In\n1923\nFrege came to the conclusion that the aim he had set himself throughout most of his career, namely to found arithmetic on logic, was wrong. He decided instead that one had to base the whole of mathematics on geometry. He began to work on these ideas but had not progressed far by the time of his death. He published nothing on these ideas.\nWe have quoted many tributes to Frege's genius, but let us end with one more. Weiner writes in\n[\n20\n]\n:-\nGottlob Frege's writings have had a profound influence on contemporary thought. His revolutionary new logic was the origin of modern mathematical logic - a field of import not only to abstract mathematics, but also to computer science and philosophy.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Ernst Abbe",
    "Abbe",
    "habilitation",
    "invariant theory",
    "Privatdozent",
    "Russell",
    "Aristotle",
    "Euclid",
    "John Venn",
    "Paul Tannery",
    "Ernst Schröder",
    "Cantor",
    "Georg Cantor",
    "number theory",
    "Peano",
    "Dedekind",
    "Bertrand Russell",
    "Lesniewski",
    "Wittgenstein",
    "Thomae"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}