{
  "nome_completo": "Gustav Doetsch",
  "nome_curto": "Gustav Doetsch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Doetsch/",
  "data_nascimento": "29 November 1892",
  "local_nascimento": "Cologne (Köln), Germany",
  "data_morte": "9 June 1977",
  "local_morte": "Freiburg-Günterstal, Germany",
  "summary": "Gustav Doetsch wasa German mathematician who worked on the Laplace Transform. His connections with the Nazis led to difficulties after World War II.",
  "biografia": "Gustav Doetsch\nattended the Wöhler\nRealgymnasium\nin Frankfurt am Main from\n1904\n. He graduated from the school in\n1911\nand for the next three years studied mathematics, physics and philosophy in Göttingen, Munich and Berlin. It was common practice among German students at this time to study at a number of different universities during their undergraduate years and Doetsch was typical in this respect. He had been intending to continue with his education but the outbreak of World War I in\n1914\nmeant that he was forced to interrupt his studies.\nHe served as an artillery observer for the first part of the war and then, from\n1916\n, he flew on aircraft as an observer. He was decorated for his services before the end of the war, and in December\n1918\nhe ended active service as a highly decorated flying officer. After the war ended he was able to continue with his academic studies, first in Frankfurt and then in Göttingen where his doctoral dissertation\nEine neue Verallgemeinerung der Borelschen Summabilitätstheorie der divergenten Reihen\nⓉ\n(\nA new generalization of Borel summability theory  of a divergent series\n)\nwas supervised by\nEdmund Landau\n. Doetsch was awarded his doctorate in\n1920\n, and in the following year he submitted his\nhabilitation\nthesis to the Technical University of Hanover and received the right to lecture. He taught at the University of Halle from\n1922\nto\n1924\nbefore being appointed as Ordinary Professor of Descriptive Geometry at the Technical University of Stuttgart. In\n1922\nhe published a famous work on the applications of mathematics which asked fundamental questions about the character of the mathematical sciences. He writes in the article that it is strange that deep mathematics, understood by only a very few specialists, provides such a powerful tool in directing the natural sciences. Doetsch says that the natural scientist turns to mathematics to provide an explanation for experimental facts. However, in his eyes, the use of mathematics in the natural sciences gives at best an \"approximate image of reality\". Also in the\n1920\ns Doetsch collaborated with\nFelix Bernstein\non what is considered today to be the modern version of the\nLaplace\ntransform. This remained one of the main research topics of his whole career.\nDuring his years in Stuttgart, Doetsch became an active member of the peace movement. While at Stuttgart he was approached a number of times with offers of chairs in other universities. For example he was offered the chair of mathematics at the University of Greifswald in\n1927\nand three years later at the University of Giessen. It was in the spring of\n1930\nthat he received the offer from Giessen and his letter of rejection is dated\n2\nMarch. However, when he was offered the chair at the University of Freiburg he accepted, taking up the post in the summer of\n1931\n.\nDoetsch had collaborated with a number of Jewish mathematicians; his doctoral supervisor was\nEdmund Landau\nand his collaborator on the\nLaplace transform\nwas\nFelix Bernstein\n, both Jewish mathematicians. Doetsch, however, seems to have given wholehearted support to the ideas of National Socialism as put forward by the Nazis in the\n1930\ns. On\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany and Nazi policies began to have a major impact on the\nGerman Mathematical Society\nand on its members. Both\nEdmund Landau\nand\nFelix Bernstein\nwere dismissed from their posts, actions which were approved of by Doetsch, who gave his full support to\nBieberbach\nin his attempt to become chairman of the\nGerman Mathematical Society\nin\n1934\n. Doetsch argued that\nPerron\n, who had been appointed as chairman of the\nGerman Mathematical Society\nin September\n1933\n, could no longer be tolerated and he argued strongly for the idea that\nBieberbach\nshould be made chairman for life.\nDespite his support for the Third Reich, Doetsch was investigated by them, particularly over his earlier involvement with the peace movement. However his position as an Air Force reserve seems to have been sufficient to ensure further investigations were dropped. From around\n1936\nDoetsch seems to have been less energetic in his support for National Socialism. However, he does not seem to have made friends in Freiburg, on the contrary he fell out with many of his colleagues despite being held in high regard as an applied mathematician. His most important mathematical contribution during this time was his major text on the\nLaplace\ntransform and its applications to engineering published in\n1937\n, the first such text to be written.\nWhen World War II started Doetsch was already taking part in an exercise as a Captain in the Air Force reserve. He was kept in the Air Force despite his attempts to return to the University of Freiburg. He contacted\nWilhelm Süss\n, at this time rector of the University of Freiburg, asking him to help argue for his return but to no avail. Doetsch was given a role with the Reichsluftfahrtministerium\n(\nReich Air Force Ministry\n)\nin Berlin coordinating the mathematical contributions relevant to the war effort by the Air Force. However because of his difficult personality he was not trusted by the majority of the mathematicians who felt that they were better served by cooperating with the\nGerman Mathematical Society\nthan with the Reich Air Force Ministry. In this respect Doetsch and\nSüss\n, who was chairman of the\nGerman Mathematical Society\n, were in direct competition and relations between the two men became very poor. Doetsch made major efforts in the Reich Air Force Ministry to coordinate mathematicians and mathematical knowledge for the purposes of the war. In particular he put a large effort into developing a programme to collect mathematical formulae and mathematical tables which were needed for aviation research. From\n1942\nDoetsch became increasingly isolated in the Reich Air Force Ministry and consequently in\n1944\nhe was transferred to the Institute for Theoretical Ballistics at the Aviation Research Institute Hermann Göring at Braunschweig. At the end of war Doetsch returned to the University of Freiburg but in the autumn\n1945\nhe was suspended from his duties as professor.\nIn June\n1946\nhe made a request to retire from lecturing in order to be able to dedicate himself entirely to research. The request was rejected. He was reinstated to his chair at Freiburg in\n1951\nbut was now completely isolated within the university. He served for a further ten years before he retired in\n1961\n, but during that time he had no contact with other mathematicians at the Mathematics Institute. Walter Felscher writes:-\n... between\n1958\nand\n1969\nI held positions at Freiburg, and during the earlier of these years I still saw the announcements posted of Doetsch's lectures. However, Doetsch never came to the mathematics department and did not hold his lectures in the building where all other mathematicians taught\n(\ninstead, he used classrooms in the university's main building, normally used by philologists\n)\n. He did not visit faculty meetings, did not use the secretarial staff, and did not take part in social gatherings of the faculty's members. I never noticed him taking part in examination boards, nor did he then seem to have doctoral students or assistants.\nDoetsch remained active mathematically despite his isolation in Freiburg. He gave a number of lectures at other institutions, for example in Santa Fé in Argentina in\n1950\n, in Madrid in\n1952\n, and in Rome in\n1953\n.",
  "matematicos_citados_na_biografia": [
    "Realgymnasium",
    "Edmund Landau",
    "habilitation",
    "Felix Bernstein",
    "Laplace",
    "Laplace transform",
    "German Mathematical Society",
    "Bieberbach",
    "Perron",
    "Wilhelm Süss",
    "Süss"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}