{
  "nome_completo": "Hans Petersson",
  "nome_curto": "Hans Petersson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petersson/",
  "data_nascimento": "26 June 1902",
  "local_nascimento": "Bentschen, Posen, Germany (now Poznań, Poland)",
  "data_morte": "9 November 1984",
  "local_morte": "Münster, Germany",
  "summary": "Hans Petersson was a German mathematician who worked in the theory of modular and automorphic forms.",
  "biografia": "Hans Petersson\nwas born in Bentschen in Posen. The province of Posen had been named Poznań but given the German name of Posen around the time of Petersson's birth. Petersson's father was a local court official and he changed the spelling of his surname from Peterssohn to Petersson. The original family name was Swedish and given as Petersson, but Petersson's great-grandfather had changed the spelling to the German version of Peterssohn. However Petersson's father had changed it back to the original spelling. Before Bentschen became Polish, which happened in\n1918\nafter the end of World War I, the Petersson family had left the town and moved west into Germany.\nPetersson studied for his doctorate at Hamburg University where his studies in algebraic number theory were supervised by\nHecke\n. After the award of his doctorate in\n1925\nfor the thesis\nÜber die Darstellung natürlicher Zahlen durch definite und indefinite quadratische Formen von\n2\nr Variablen\nⓉ\n(\nOn the representation of natural numbers through definite and indefinite quadratic forms of\n2\nr variables\n)\nhe remained at Hamburg, continuing to study with\nHecke\n, and the successful submission of his\nhabilitation\nthesis to Hamburg in\n1929\nsaw him become a\nPrivatdozent\nthere. On\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany. Petersson was an Aryan so was not affected by the Civil Service Law, passed on\n7\nApril\n1933\n, which provided the means of removing Jewish teachers from the universities. However Petersson married Margarete Ehlers on\n30\nSeptember\n1933\nand his wife had a Jewish grandparent on her mother's side. Petersson asked Hecke for advice and he suggested that he join the Sturmabteilung\n(\nStormtroopers\n)\n. Although Petersson had a strong dislike for the National Socialists, he acted out of self-preservation.\nHecke\n,\nBlaschke\nand\nArtin\n, all professors at Hamburg, requested Petersson's promotion on\n8\nJune\n1934\n. However the request was refused on the grounds that promotion was only possible after teaching for six years. Petersson was now in a difficult financial position, only being a Privatdozent but having to support a wife. He tried to find a professorship by approaching Hans-Heinrich Lammers, the Secretary of State, who had been a friend of his father. Lammers sent Petersson's request to be considered for a chair to the Ministry of Education who asked three known Nazi supporters Tornier,\nBieberbach\nand Riebesell for their opinions. The Ministry of Education, having received reasonable but not particularly strong references, decided not to offer Petersson a chair.\nBlaschke\ntried to obtain a chair for Petersson in Calcutta in\n1935\nbut was unsuccessful. Having now satisfied the six years teaching experience criterion, an application went in from Hamburg for Petersson's promotion in June\n1935\n. This time\nBieberbach\n,\nHecke\n, and\nHasse\nwere asked for opinions and on\n4\nDecember Petersson was asked to supply birth certificates giving his religion and marriage certificates for himself and his wife going back two generations. He said that as Bentschen was now Polish these could not all be given and he managed to hide the non-Aryan relations on his wife's side. Certainly his membership of the Stormtroopers helped prevent investigation as he had hoped.\nOn\n1\nMay\n1937\nPetersson joined the Nazi party, after a lengthy explanation of why his name was not given a German spelling, still trying to gain favour. In this he was certainly successful. A report by the Hamburg division of the Nazi party reported in April\n1938\n[\n1\n]\n:-\nThe information requested from his Sturmabteilung naval groups about Petersson has turned out very good. Besides Petersson has been a party member since\n1\nMay\n1937\n. Petersson in the meantime has likewise completed an eight-week military exercise. Professor Petersson represents the rarely occurring case of a mathematician who stands without reservation on the ground of the National Socialists and besides is active in the Sturmabteilung with a will.\nOn\n9\nSeptember\n1939\nhe was appointed to a chair at Prague University but, perhaps due to the war starting, did not now want to leave Hamburg. On\n7\nOctober\n1940\nhe was ordered to Prague. In\n1941\nhe went to Strasbourg University and worked there until\n1944\nwhen the advancing armies of the allies forced the closure of the university.\nBlaschke\nrequested that Petersson return to Hamburg. At the end of World War II in\n1945\nhe was suspended and investigated by the denazification committee. They were made aware of the reasons for which Petersson had joined the Stormtroopers and noted that he had not been:-\n... very active in the Stormtroopers\n[\nfor\n]\nduring twelve years of membership he did not reach a rank higher than private first class.\nPetersson was reinstated in Hamburg in March\n1947\n. He turned down offers of professorships at Jena and Rostock in\n1951\n, possibly because they were in East Germany. He accepted an appointment as ordinary professor at Münster in\n1953\nand remained there for the rest of his career. From\n1953\nuntil his retirement in the year\n1970\nhe was a director of the Mathematical Institute of the Westfälischen Wilhelms University at Münster.\nPetersson's leading contributions to the theory of modular and automorphic forms began with the introduction in\n1939\nof his inner product as a tool for studying these functions. As noted in\n[\n2\n]\n:-\n... the abstract notion of a vector space appeared in print only in\n1922\nin papers by\nS Banach\nand\nH Hahn\n.\nSo what is now completely standard linear algebra for all mathematicians was, when Petersson published\nKonstruktion der sämtlichen Lösungen einer Riemannschen Funktionalgleichung durch Dirichlet-Reihen mit Eulerscher Produktentwicklung\nⓉ\n(\nConstruction of all solutions of the Riemann functional equation by Dirichlet series with Euler product development\n)\nin\n1939\n, at the forefront of the latest research.\nIn\n1982\nPetersson published an important book\nModulfunktionen und quadratische Formen\nⓉ\n(\nModule functions and quadratic forms\n)\nin Springer-Verlag's\nErgebnisse der Mathematik und ihrer Grenzgebiete\nseries. Fomenko, reviewing the book, writes:-\nThis book is a detailed introduction to the theory of elliptic modular forms and relies on the classical works of\nHecke\nand of the author. It is concerned with the study of the representation of integers by positive-definite quadratic forms by means of the theory of modular forms, in particular, of the theory of theta-functions. The basic aim of this book is to evaluate\n(\nin explicit form\n)\nthe number of representations of integers\nn\nn\nn\nby specific positive-definite quadratic forms F.\nPetersson continued to undertake important research after he retired in\n1970\nand his final paper\nÜber Spuren von Modulformen und die Eisensteinschen Reihen in den Kongruenzklassen der rationalen Modulgruppe\nⓉ\n(\nOn traces of modular forms and the  Eisenstein  series in the congruence classes of the rational modular group\n)\nappeared in\n1986\n, two years after his death.",
  "matematicos_citados_na_biografia": [
    "Hecke",
    "habilitation",
    "Privatdozent",
    "Blaschke",
    "Artin",
    "Bieberbach",
    "Hasse",
    "S Banach",
    "H Hahn"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}