{
  "nome_completo": "Harold Hotelling",
  "nome_curto": "Harold Hotelling",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hotelling/",
  "data_nascimento": "29 September 1895",
  "local_nascimento": "Fulda, Minnesota, USA",
  "data_morte": "26 December 1973",
  "local_morte": "Chapel Hill, North Carolina, USA",
  "summary": "Harold Hotelling was an American mathematical statistician who wrote important papers on economics as well as on statistics.",
  "biografia": "Harold Hotelling\n's father, Clair Alberta Hotelling, had a business selling hay. If this sounds a little strange, the reader should realise that he had entered the business at a time when horses were the main means of transport and hay was their fuel. Harold's mother was Lucy Amelia Rawson who was descended from Edward Rawson who was Secretary of the Massachusetts Bay colony soon after it was founded by English Puritan settlers in\n1630\n. In fact Hotelling could trace his family back much further than the seventeenth century, to important people in England and Holland. Harold was the oldest of his parents' six children who were brought up according to strict Methodist principles. Now the year Harold was born marks the beginning of automobile production in the United States and soon it became clear that automobiles were going to replace horses as a means of transport. The Ford Motor Company began selling cars in\n1903\nand Harold's father soon realised that selling hay for horses was going to be a thing of the past. When Harold was nine years old, the family moved to Seattle making the journey by train\n[\n14\n]\n:-\n... with, not only the five children they now had, but also forty horses salvaged from the abandoned business in Fulda!\nSoon their life became even harder\n[\n4\n]\n:-\nThe depression of\n1907\ntook its toll on Seattle and on the Hotellings: Harold's father lost on his investments and on his hay business, which was being made obsolete by the coming of the automobile.\nThe Methodist Church in Seattle became a major focus for the family and, although later in his life Hotelling would not be religious, nevertheless he retained the strong beliefs in social justice, and the abhorrence of alcohol and tobacco, which came from the Church. The young Hotelling was an avid reader, making great use of the Seattle Public Library. During his years at high school he studied mathematics, science and classics but he was particularly interested in electricity reading every book he could find on the topic.\nAfter graduating from high school, he decided on a university education, entering Washington University with the aim of becoming a journalist. He worked for several small newspapers while he was undertaking his undergraduate studies, and he also made use of his knowledge of electricity by doing wiring jobs. He majored in journalism, but took a couple of mathematics courses taught by\nEric Temple Bell\nwho spotted his talent. However, before completing the course, he was called up for war service during World War I. Despite his obvious academic talents, the army decided that he was best suited to looking after mules. This turned out to be a blessing in disguise for one of the temperamental mules\n(\ncalled Dynamite\n)\nkicked him and broke his leg. Although this does not look like a blessing, we note that he did not see active service because of this while the other members of his division were sent to France where the majority were killed. He was discharged from the army on\n4\nFebruary\n1919\nand resumed his studies at Washington University. He graduated with a B.A. in\n1919\nand took a job as a journalist with the Washington Standard. However, he did not find the work attractive and, persuaded by\nE T Bell\n, he returned Washington University in January\n1920\nto study for a Master's degree in mathematics. Later that year he married Floy Tracy; they had two children, the first born in\n1923\nbeing named Eric Bell Hotelling showing his appreciation of\nE T Bell\n. After the award of an M.S. in\n1921\nhe decided to use his mathematical skills in economics\n(\nhe had taken economics courses as an undergraduate\n)\n. However, his application to Columbia University for an Economics Fellowship failed so he went to Princeton University with a Mathematics Fellowship to undertake research for a doctorate. He still hoped to study economics and statistics at Princeton but did not find the experts there that would have made that possible. His thesis advisor at Princeton was\nOswald Veblen\nand his thesis\nThree-Dimensional Manifolds of States of Motion\nwas on topology. He was awarded a doctorate in\n1924\nand he was to make good use in his subsequent career of the topology,\ndifferential geometry\n, analysis and mathematical physics he had learnt at Princeton.\nFollowing the award of his doctorate, Hotelling was appointed as a junior associate at the Food Research Institute attached to Stanford University. In\n1925\nhis thesis was published as well as two important papers\nA general mathematical theory of depreciation\non mathematical economics, and\nThe distribution of correlation ratios calculated from random data\nin which he\n[\n9\n]\n:-\n... obtained the distribution of the correlation ratio in samples from a normal population. This\n[\npaper\n]\n, in the Fisher spirit of deriving exact distributions by geometric arguments, obtained a form of the F distribution independently of Fisher's treatment of essentially the same problem in the analysis of variance.\nAt this stage of his career, although in a Research Institute, Hotelling was teaching mathematics and statistics at Stanford University\n[\n14\n]\n:-\n... he taught his first course, \"The\ntheory of probability\nand statistical inference\" in the year\n1925\n-\n26\n, and it is interesting to note that in the following year he was offering \"Determinants and probability\" and \"The mathematics of statistical inference,\" as well as \"Analysis situs\"\n[\nthe older name for Topology\n]\nand \"Differential geometry.\"\nIn\n1927\nhe was appointed as an Associate Professor in the Mathematics Department at Stanford University. This was the year in which his review of\nR A Fisher\n's book\nStatistical Methods for Research Workers\nwas published. In it he heaped praise on\nFisher\nfor his \"brilliant contributions to the subject\", ending his review with the words\n[\n7\n]\n:-\nThe author's work is of revolutionary importance and should be far better known in this country.\nCertainly Hotelling decided to get to know\nFisher\n's work from first hand experience for he spent six months from June to December in\n1929\nworking with\nFisher\nat the Rothamsted Agricultural Experiment Research Station at Harpenden in England\n[\n14\n]\n:-\nIt was during this sojourn that mathematical statistics, already one of his several scholarly interests, became a life-long and consuming passion. During these months in England he also made friends with many British statisticians who were, like himself, to rise to international prominence. These friendships were preserved to the end of his life and were to provide him and them with many congenial occasions and to produce valuable exchanges of ideas.\nPerhaps his most significant contribution to mathematical statistics was\nThe generalization of Student's ratio\nwhich he published in\n1931\n. This paper on hypothesis testing contains the now standard idea of \"confidence intervals\". The year\n1931\nwas significant for Hotelling in another way for, in that year, he left Stanford University to take up a professorship in the Economics Department of Columbia University. There he taught courses on economics but most of his energy for research was put into developing statistics. However, tragedy struck his personal life soon after the family arrived in New York, His wife Floy became ill and died in October\n1932\n. Left with two young children to bring up, he was helped by Floy's sister who took them into her own family and cared for them with her own children. Hotelling then met Susanna Porter Edmonson who was a student in a statistics course he was teaching. They married in June\n1934\nand moved out of New York city to a home at Mountain Lakes in New Jersey\n[\n3\n]\n:-\nWith the aid of the research associates the statistics program was indeed first-rate; it had a separate listing in the catalogue but there was no department and no degree associated with it. His intellectual leadership, kindness, and generosity to his students were legendary among them, and his house in Mountain Lakes, New Jersey, witnessed his and his wife's monthly open houses for them and other statisticians. He had none of the prejudices then still common; refugees from Europe and students from India could count on his warm support and very practical help.\nWe note that Harold and Susanna Hotelling had six children. Further we note that among the research associates referred to in the above quote there was the famous\nAbraham Wald\n, one of the 'refugees from Europe', who came to Columbia University in September\n1938\n. Hotelling was passionately against all that Hitler stood for and strongly argued for the United States to enter the war long before the country did. However, once the United States was involved in World War II, he persuaded the military to set up a Statistical Research Group at Columbia University which worked on various statistical problems associated with the war effort such as quality control issues. Hotelling pressed Columbia University to set up an independent department of statistics with its own permanent staff. He argued the case very convincingly in his paper\nThe teaching of statistics\n(1940)\n(\nsee also\n[\n10\n]\n)\n-\nShould statistics be taught in the department of agriculture, anthropology, astronomy, biology, business, economics, education, engineering, medicine, physics, political science, psychology, or sociology, or in all these departments? Should its teaching be entrusted to the department of mathematics, or to a separate department of statistics, and in either of these cases should other departments be prohibited from offering duplicating courses in statistics, as they are often inclined to do? ...\n[\nThe question\n]\nto have received too little of the attention of college and university administrative officers is ...\"What sort of persons should be appointed to teach statistics?\" ... Qualifications of a good teacher of statistics include, first and foremost, a thorough knowledge of the subject. This statement seems trivial, but it has been ignored in such a way as to bring about the present unfortunate situation. Mathematicians and others, who deplore the tendency of Schools of Education to turn loose on the world teachers who have not specialised in the subjects they are to teach, would do well to consider their own tendency to entrust the teaching of statistics to persons who not only have not specialised in the subject, but have no sound knowledge of it whatever.\nHotelling received an offer from the University of North Carolina to start a statistics programme there. He had previously tried hard to persuade Columbia to offer him the same opportunity, but they had not been persuaded. Hotelling, therefore, left Columbia in\n1946\nto start up a Department of Mathematical Statistics at the University of North Carolina at Chapel Hill. He was chairman of the Department as well as associate director of the Institute of Statistics\n[\n4\n]\n:-\nHe published very little\n[\nafter the move\n]\n, but rather devoted himself to the role of establishing the Institute as the premier centre of excellence statistical research. Hotelling drew together a group of statisticians at the Institute, a list of whom reads like a role call of honour. In creating a world centre of excellence in mathematical statistical research Hotelling surely had no equal.\nIn\n1961\nhe was named Kenan Professor of Statistics at Chapel Hill. He retired in\n1966\nand was made professor emeritus.\nNow Hotelling wrote, as we have already indicated, important papers on economics as well as on statistics. The first of these economics papers, mentioned above, was\nA general mathematical theory of depreciation\n(1925)\n. He wrote, in addition, five more major works on economics:\nStability in competition\n(1929)\n,\nThe economics of exhaustible resources\n(1931)\n,\nEdgeworth's taxation paradox and the nature of demand and supply functions\n(1932)\n,\nDemand functions with limited budgets\n(1935)\n, and\nThe general welfare in relation to problems of taxation and of railway and utility rates\n(1938)\n. This last paper was, in fact, his presidential address to the Econometric Society. He was elected a fellow of the\nAmerican Statistical Association\nin\n1937\n, serving as its vice president in\n1941\n. He also served as president of the Institute of Mathematical Statistics. He was honoured with the North Carolina Award, presented to him in\n1972\nfor his contributions to science.\nFinally, we should also examine Hotelling's ideas on teaching mathematics and statistics. In\n1946\n, in his lecture\nThe place of statistics in the university\n, delivered to the Berkeley Symposium in Mathematical Statistics and Probability, he said\n[\n10\n]\n:-\nThe possibilities of teaching quite advanced mathematics to young children have scarcely begun to be explored. Children of kindergarten age are fascinated and thrilled by the wonders of topology, and groups and number theory can be tremendous sensations in the fifth grade, though all these subjects are ordinarily reserved for graduate students specialising in mathematics. What is lacking is teachers who know mathematics and its applications and who possess enough freedom to teach what they know instead of the long, dull, and relatively useless drill on problems of wall-paper-hanging and the like, problems turning on mere conventions which are quickly forgotten - painful, repetitious work which makes children resolve to quit mathematics as soon as possible.",
  "matematicos_citados_na_biografia": [
    "Eric Temple Bell",
    "E T Bell",
    "Oswald Veblen",
    "differential geometry",
    "theory of probability",
    "R A Fisher",
    "Fisher",
    "Abraham Wald",
    "American Statistical Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}