{
  "nome_completo": "John Henry Constantine Whitehead",
  "nome_curto": "Henry Whitehead",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whitehead_Henry/",
  "data_nascimento": "11 November 1904",
  "local_nascimento": "Madras,  (now Chennai) India",
  "data_morte": "8 May 1960",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "J H C Whitehead was a topologist and differential geometer who is best remembered for his work on homotopy equivalence.",
  "biografia": "Henry Whitehead\n's father was The Right Rev Henry Whitehead, Bishop of Madras\n(\nnow Chennai\n)\nin India. His mother, Isobel Duncan, was the daughter of the Rector of Calne, Wiltshire, so Henry came from a family deeply involved with the Church. However, Henry Whitehead's family also had strong academic connections; in particular there was a strong tradition of mathematical excellence. His mother had studied mathematics at Oxford University, being one of the early women undergraduates, while the famous mathematician and philosopher,\nAlfred North Whitehead\n, was his uncle.\nAlthough Henry was born in India he lived in England from the age of about eighteen months. It was at that age that his parents brought him back from India and left him in the care of his maternal grandmother who lived in Oxford. His parents then returned to India and Henry saw little of them while he was growing up. It would not be until his father retired when Henry was sixteen years old that they returned to England.\nHenry's childhood in Oxford was a quiet one since\n[\n6\n]\n:-\n... it was a very peaceful place and he would recall going for drives with his grandmother in her carriage and seeing the horsedrawn buses in town.\nHenry did quite well at primary school, both academically, socially and in sport. He was\n[\n6\n]\n:-\n... of above average intelligence, good at games, prone to be careless in his work, but with a great capacity for enjoying life. If he had worked harder he might have won a scholarship to Eton...\nDespite the lack of a scholarship to Eton, Whitehead was successful in the Entrance Examination and began a happy period at Eton where he specialised in mathematics, yet never showed himself as a mathematical genius. One reason why this outstanding mathematician only appeared \"good\" at school was a whole range of other interests which occupied him\n[\n6\n]\n:-\nHis exuberance, gaiety and intelligence made him many friends and his irrepressible high spirits and disregard for authority sometimes strained the patience of his tolerant and long suffering housemaster. His personal popularity got him elected to Pop, and his athletic prowess won him a place in the cricket second eleven, his fives colours and a silver cup at boxing.\nAnother reason why he failed to shine academically may have been due to an inner sadness at being separated from his parents. Whatever the reasons it made his desired progress harder than it might otherwise have been. Whitehead wanted to go to Balliol College, Oxford, to study mathematics but his mathematics teacher at Eton did not think that he stood a chance of winning a scholarship. He wrote\n[\n6\n]\n:-\nIn pure geometry he has not been over diligent ... he would have been more successful in mathematics if he had been less so at cricket.\nThe mathematics teacher was wrong, however, and in March\n1923\nWhitehead did win a scholarship to study at Balliol College. At Balliol Whitehead was tutored by J W Nicholson, who had been a student of Whitehead's uncle\nA N Whitehead\n. However, Nicholson's health was poor and Whitehead was tutored frequently by H Newboult at Merton College.\nAs Eton had done, however, Oxford also provided a whole range of distractions to Whitehead. He played many sports including cricket, squash, tennis, and boxing. His interest in cricket brought him into contact with\nG H Hardy\n, so the sporting interests had some academic benefits. At Oxford Whitehead developed another passion, namely playing poker. He claimed that his mother taught him how to play the game when he was a young child recovering from an illness. Whitehead played poker for quite large sums of money while at Oxford although his friends did not always pay what they owed him.\nAt Oxford Whitehead showed himself to be better than the \"good\" at mathematics which he had displayed at Eton. Despite his success, and the award of a First Class degree, he did not consider himself sufficiently talented for an academic career so, in\n1927\n, he joined the firm of stockbrokers Buckmaster and Moore. By this time his parents had returned from India and were living in the village of Sulham in Berkshire and Whitehead lived there and travelled to his job in the city of London every day.\nIt took not much over a year of work at the stockbrokers to convince Whitehead that the City was not the life for him so, in\n1928\n, he returned to the University of Oxford. While at Oxford Whitehead met\nVeblen\n, who was on leave from Princeton. He attended a seminar which\nVeblen\ngave on\ndifferential geometry\nand it must have been a very fine talk for it persuaded Whitehead that he would undertake research in that topic.\nVeblen\nsupported Whitehead's application for a Commonwealth Fellowship to enabled him to study for a Ph.D. at Princeton.\nWhitehead arrived at Princeton in the summer of\n1929\nto begin his research. He worked mainly on differential geometry although towards the end of his three years there he became interested in\ntopology\n. He was awarded his doctorate from Princeton in\n1932\nfor a dissertation entitled\nThe Representation of Projective Spaces\n. Whitehead's joint work with his doctoral supervisor\nVeblen\nled to\nThe Foundations of Differential Geometry\n(1932)\n, now considered a classic. It contains the first proper definition of a differentiable\nmanifold\n.\nAs we mentioned Whitehead's interests turned more towards topology near the end of his three years in Princeton when he collaborated with\nLefschetz\nin proving that all analytic manifolds can be triangulated. In this area he is best remembered for his work on\nhomotopy\nequivalence. The three years at Princeton were happy ones for Whitehead and he\n[\n6\n]\n:-\n... had throughout his life a really deep affection for\n[\nPrinceton\n]\nand its inhabitants, ranging from the Dean of the Graduate College to the barman at \"Andy's\".\nWhitehead returned to Oxford after being awarded his doctorate and he was elected to a Fellowship at Balliol College in\n1933\n. In the following year Whitehead married Barbara Sheila Carew Smyth\n(\none of the authors of\n[\n6\n]\n)\nwho was a concert pianist\n[\n3\n]\n:-\nThey shared great zest for life and enjoyed a marriage of surpassing happiness.\nThey lived at first in St Giles, Oxford, but later moved to North Oxford after their first of their two sons was born. Their home there\n[\n6\n]\n:-\n... became a meeting place for mathematicians, where there was generally a mug of beer or a cup of tea and always a warm welcome, and a pencil and a block of paper each for host and guest to write their thoughts on. Many ideas were exchanged and many informal seminars took place in his study.\nSoon after his return to England, Whitehead wrote another major work on differential geometry\nOn the Covering of a Complete Space by the Geodesics Through a Point\n(1935)\n. Whitehead also studied Stiefel manifolds and set up a school of topology at Oxford. However, events would soon cause a break in Whitehead's career.\nThe Nazi moves against Jewish mathematicians gave Whitehead great distress, and he actively helped many to escape to safety. In particular he helped\nEilenberg\nand\nDehn\n, while\nSchrödinger\ncame to live in his home after escaping from Austria. Whitehead left Oxford in\n1940\nto undertake war work in London, spending\n[\n6\n]\n:-\n... the night of the worse blitz on London sitting in his friend's wine cellar placidly working at mathematics. He afterwards congratulated himself on his high standard of morality as not one bottle was\n[\nopened\n]\n.\nAfter working at the Board of Trade, at the Admiralty, and finally at the Foreign Office, during the War, Whitehead returned to his home in North Oxford when World War II ended. In\n1947\nhe was appointed to the Waynflete Chair of Pure Mathematics at Oxford. At that time Whitehead moved from Balliol College to Magdalen College.\nWhitehead's father died in\n1947\nand his mother died six years later in\n1953\n. She had owned a small farm and when Whitehead inherited the cattle he and his wife decided to buy Manor Farm in Noke, north of Oxford. The farm was run mainly by Whitehead's wife but he took a keen interest in the farm where the couple lived until Whitehead's death. His death, while on a visit to the Institute for Advanced Study at Princeton during a Sabbatical year he was spending in the United States, was totally unexpected\n[\n6\n]\n:-\nIn May\n1960\n, without any previous warning symptoms or illness, he died of a heart attack in Princeton, where his mathematical life had begun.\nWhitehead's personality is clearly described in\n[\n6\n]\n:-\nHe was able to reach across the barriers of age, class and nationality to talk on equal terms with anyone who shared his passion for mathematics. The long series of collaborative papers written between\n1950\nand\n1960\nreflects his eagerness to share his ideas and to interest himself in the results of others, which remained undiminished to the end of his life. It was in long mathematical conversations, in which ever detail had to be hammered out till he had it quite correct and secure that he most delighted and it is by these conversations, gay and informal, in which he contrived to make everyone his own equal, that he will be best remembered by those who knew him.\nHis career produced mathematical results which would have a major influence on the directions of mathematical research. However, as the authors of\n[\n6\n]\nrelate, his influence extended beyond this:-\nHis influence on the development of mathematics during his active lifetime can be partly measured by the innumerable references, implicit and explicit, in current mathematical literature on algebraic and geometric topology; but it could not have been so great without the generosity and enthusiasm which he poured into every mathematical enterprise and which inspired such deep affection in all who knew him well.\nWhitehead received several honours for outstanding mathematical achievements, but he died at the age of\n55\nwhen at the height of his powers, so did not live to receive awards which normally come later in life. He was elected to the\nRoyal Society\nin\n1944\n. He served the\nLondon Mathematical Society\nin a number of ways, most notably as president during\n1953\n-\n55\n.\nMax Newman\n, who was a friend of Henry Whitehead from\n1929\nuntil the end of his life, writes\n[\n3\n]\n:-\nThe immediate attractiveness of his tremendous high spirits and friendly manners would not have sufficed to bring him the lasting affection of mathematical friends all over the world if it had not been backed, from his earliest days, by a most delicate perception of the thoughts and feelings of the person he was talking to, and a deep enjoyment and tolerance of all kinds of human behaviour. He had the dislike of formality which is not uncommon among men of science and learning, but it was a comfortable, not an uncomfortable, informality which enabled him to soften the high and exalted as easily as he could unfreeze the young and timid. Those leisurely, searching conversations, enjoyed on exactly the same terms by all comers, on a walk over the farm, with his not very obedient gun-dog, or sitting in arm chairs with pencils and blocks of paper for following the details, were as refreshing and enlivening after\n30\nyears as on the first day.",
  "matematicos_citados_na_biografia": [
    "Alfred North Whitehead",
    "A N Whitehead",
    "G H Hardy",
    "Veblen",
    "differential geometry",
    "topology",
    "manifold",
    "Lefschetz",
    "homotopy",
    "Eilenberg",
    "Dehn",
    "Schrödinger",
    "Royal Society",
    "London Mathematical Society",
    "Max Newman"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}