{
  "nome_completo": "Henri Eugène Padé",
  "nome_curto": "Henri Padé",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pade/",
  "data_nascimento": "17 December 1863",
  "local_nascimento": "Abbeville, Picardy, France,",
  "data_morte": "9 July 1953",
  "local_morte": "Aix-en-Provence, France",
  "summary": "Henri Padé made important contributions to the theory of continued fractions.",
  "biografia": "Henri Padé\nwas born in Abbeville which is a town northwest of Amiens in the Picardy region of northern France. He attended school in his home town and obtained his baccalaureate in\n1881\nat the age of seventeen. He then went to Paris to continue his education at the Lycée St Louis where he spent two years preparing to sit the university entrance examinations.\nAfter completing his studies at Lycée St Louis, Padé sat the entrance examination for the École Normale Supérieure in Paris, entering the École in\n1883\n. Three years later he graduated with his\nAgrégation de Mathématiques\nand began a career teaching in secondary schools. He did begin publishing papers on his mathematical research during this period, however, and his first publication appeared in\n1888\n.\nIn\n1889\nPadé went to Germany to continue his studies, going first to Leipzig and then to Göttingen, studying under\nKlein\nand\nSchwarz\n. He returned to France in\n1890\nand continued teaching in secondary schools while he worked for his doctorate in mathematics under\nHermite\n's supervision. In\n1892\nhe presented his doctoral thesis\nSur la representation approchee d'une fonction par des fractions rationelles\nⓉ\n(\nOn the approximate representation of a function by rational fractions\n)\nto the Sorbonne in Paris. Padé defended his thesis on\n21\nJune\n1892\n, the examiners being his supervisor\nHermite\n, together with\nÉmile Picard\nand\nPaul Appell\n.\nIn his thesis Padé made the first systematic study of what we call today Padé approximants, which are rational approximations to functions given by their power series. He proved results on their general structure and also clearly set out the connection between Padé approximants and\ncontinued fractions\n. Of course, although Padé's thesis was the first systematic study, the ideas had been around for some time although not systematically developed.\nDaniel Bernoulli\nstudied a Padé-type approximation in\n1730\nand\nJames Stirling\ngave a similar method in\nMethodus differentialis\nⓉ\n(\nDifferential methods\n)\npublished in the same year. At around the same time\nEuler\nused Padé-type approximation to find the sum of a series. In\n1758\nLambert\nfound approximants which are Padé approximants, but developed no general theory.\nThe first who seemed to realise the full significance of the method of Padé approximants was\nLagrange\nin a paper of\n1776\nwhere he related them to continued fractions. The method continued to be used from time to time by various mathematicians, for example\nKummer\nin\n1837\nused Padé approximants to sum series which only converged very slowly.\nJacobi\ndeduced a formula for the approximants in terms of determinants in\n1845\n. Padé approximants appear in Hankel's doctoral thesis\nÜber eine besondere Classe der symmetrischen Determinanten\n,\nⓉ\n(\nOn a special class of symmetric determinants\n)\nwritten in\n1861\n, while in his thesis of\n1870\n, supervised by\nWeierstrass\n,\nFrobenius\ndiscovered identies between the approximants which he developed more fully in a paper he published twenty years later. It would be fair to say that this work is the first systematic study of Padé approximants. Between these two contributions by\nFrobenius\n,\nDarboux\nhad looked at Padé approximants of the exponential function. Other contributions were made by\nLaguerre\nand\nChebyshev\n. Padé's doctoral supervisor\nHermite\nhad used approximants and continued fractions in his work of\n1873\non proving the transcendence of e.\nHow much of this earlier work was known to Padé is less obvious and he certainly seemed to be unaware of the contributions of\nFrobenius\n. The greatest influence on him, as is to be expected, was the contributions of his supervisor\nHermite\n, who had developed a general theory of interpolation by\nrational functions\n. In his doctoral thesis Padé showed that, in a properly defined sense, the Padé approximant was the best approximant among all the rational ones.\nVan Vleck\n, at a meeting of the\nAmerican Mathematical Society\nin Boston in\n1903\nsaid\n(\nsee for example\n[\n1\n]\n)\n:-\nThe existence of approximants was, of course, well-known before Padé, but no systematic examination of them had been made except by\nFrobenius\n, who determined the important relations which normally exist between them. Padé goes further, and arranges the approximants, expressed each in its lowest terms, into a table ...\nPadé established various properties of this table in his thesis and developed the ideas further in later papers, particularly in\n1899\nwhen he studies the exponential series and in\n1901\nwhen he considered\n(\n1\n+\nx\n)\nm\n(1+x)^{m}\n(\n1\n+\nx\n)\nm\n, for\nm\nm\nm\nnot an integer.\nAfter completing his doctoral studies, Padé taught at the Lycée Faidherbe in Lille, taking up this post in October\n1893\n. He continued to investigate approximants, and in\n1894\nhe published a memoir in which he generalised the continued fraction algorithm which\nHermite\nhad studied in\n1863\nand again in\n1893\n. The approximants which Padé introduced in this paper are now known as the Padé-Hermite approximants. In January\n1897\n, a little over three years after taking up his appointment at the Lycée Faidherbe, Padé became Maître de Conférences at the University of Lille. In this post he succeeded\nÉmile Borel\nwho had just left Lille to take up an appointment at the École Normale Supérieure in Paris. In\n1899\nPadé published another major work on Padé approximants which, as we noted above, looked in depth at approximants of the exponential function.\nAfter four years in the post of Maître de Conférences at the University of Lille, Padé left to go to Poitiers where he was appointed as Professor of Rational and Applied Mechanics in June\n1902\n. Only a little more than a year later he moved to Bordeaux where he took up an appointment at the University. In\n1906\nhe received the Grand Prix of the French\nAcademy of Sciences\nand in the same year was appointed Dean of the Faculty of Science at the University of Bordeaux. Let us look briefly at this Grand Prix competition.\nThe subject proposed for the Grand Prix of the\nParis Academy\nof\n1906\nwas on the convergence of algebraic continued fractions. Five submissions were received and four referees were appointed,\nÉmile Picard\n,\nPainlevé\n,\nPoincaré\n, and\nAppell\n.\nÉmile Picard\nread two of the submissions, including the one by Padé, while these other referees read one each of the remaining three entries. Brezinski writes\n[\n1\n]\n:-\nThe work of Padé consists of a presentation of his previous results concerning the Padé table. He studied the convergence problem for the exponential function. This led him to work on the connection bewteen\nSylvester\n's formulas on the polynomials arising in the application of\nSturm\n's theorem and the theory of continued fractions.\nThe contribution by Padé contains two sealed covers. The first one, numbered\n6614\n, is dated\n2\nFebruary\n1903\nand has been published in\n1907\nin the \"Annales de l'École Normale Supérieure\". It deals with the development into a continued fraction of the generating function of a sequence satisfying a difference equation.\nThe second sealed envelope, dated\n22\nJune\n1903\n, contains a paper entitled\nOn a new method for studying the development of certain functions in continued fractions\n.\nThree of the five submissions received a prize, with Padé receiving the first prize together with half the total prize money, with smaller amounts going to the submissions judged to be worthy of second and third place. He had reached a high point in his career in universities which he would leave two years later.\nBy\n1908\nPadé had written\n41\npapers,\n29\nof which were on continued fractions and Padé approximants. Although the theory of Padé approximants which he had developed in his thesis, and in many later papers, was not quick to be taken up by many other mathematicians, it did become well known after\nBorel\npresented Padé approximants in his\n1901\nbook on divergent series. Padé had made other significant contributions, however, such as publishing an elementary algebra book and translating\nKlein\n's Erlangen programme from German into French. His translation had appeared as\nLe programme d'Erlangen\nⓉ\n(\nThe Erlangen program\n)\nin the\nAnnals of the École Normale Supérieure\nin\n1891\n, shortly after he returned from his studies in Germany.\nHaving achieved high standing at the University of Bordeaux, Padé left universities in\n1908\n, when he was\n44\nyears old, to became Rector of the Academy in Besançon. This too was a high distinction for Padé who became the youngest Rector in France when he was appointed. In\n1917\nhe became Rector of the Academy of Dijon and from\n1923\nuntil he retired in\n1934\n, at the age of\n70\n, he was Rector at Aix-Marseille.",
  "matematicos_citados_na_biografia": [
    "Agrégation de Mathématiques",
    "Klein",
    "Schwarz",
    "Hermite",
    "Émile Picard",
    "Paul Appell",
    "continued fractions",
    "Daniel Bernoulli",
    "James Stirling",
    "Euler",
    "Lambert",
    "Lagrange",
    "Kummer",
    "Jacobi",
    "Weierstrass",
    "Frobenius",
    "Darboux",
    "Laguerre",
    "Chebyshev",
    "rational functions",
    "Van Vleck",
    "American Mathematical Society",
    "Émile Borel",
    "Academy of Sciences",
    "Paris Academy",
    "Painlevé",
    "Poincaré",
    "Appell",
    "Sylvester",
    "Sturm",
    "Borel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}