{
  "nome_completo": "Herbert Ellis Robbins",
  "nome_curto": "Herbert Robbins",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robbins/",
  "data_nascimento": "12 January 1915",
  "local_nascimento": "New Castle, Pennsylvania, USA",
  "data_morte": "12 February 2001",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "Herbert Robbins was an American mathematician and statistician who worked in topology, measure theory, statistics,and other fields.",
  "biografia": "Herbert Robbins\n's parents were Mark Louis Robbins and Celia Klemansky, and he had a younger sister Francie. Herbert's father died when he was thirteen years old leaving the family in financial difficulties. Herbert was not particularly interested in mathematics at high school; it was literature which really fired his interest at that time\n[\n4\n]\nor\n[\n5\n]\n:-\nI used to go down to the public library after school, and come home with an armful of books. I'd read them all before the next day? I must have read every book in the library.\nHe entered Harvard University in\n1931\n, when only sixteen tears old, and took courses on literature but he also took a calculus course\n[\n4\n]\nor\n[\n5\n]\n:-\nHaving just entered Harvard with practically no high school mathematics, I knew calculus would be useful if I ever wanted to study any of the sciences. At the end of my freshman year, much to my surprise I was asked by the mathematics department to join the Harvard math team.\nMarston Morse\nwas our coach. We met with him on several occasions to prepare for the competition ...\nRobbins graduated with an A.B. from Harvard in\n1935\nand remained there undertaking graduate studies. He undertook research in topology, although he ended up studying this topic almost by accident\n[\n4\n]\nor\n[\n5\n]\n:-\nHassler Whitney\nhad come back from a topology conference in Moscow around\n1936\n, and in a talk at Harvard on some of the topics discussed at the conference, he mentioned an unsolved problem that seemed to be important. Since I was then a graduate student looking for a special field to work in - not particularly topology, since I hadn't even taken a course in the subject - I asked\nWhitney\nto let me work on it. That's how I got started.\nHis doctoral thesis, written with\nWhitney\nas his advisor, was entitled\nOn the Classification of the Maps of a\n2\n-Complex into a Space\n. He was awarded a Ph.D. in\n1938\nand published the main results of the thesis in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1941\n.\nWitold Hurewicz\ndescribes the paper as follows:-\nThe difficult problem of characterizing homotopy classes of mappings by combinatorial properties is solved in this paper for the case of the mappings of a\n2\n-complex into an arbitrary space T. The necessary and sufficient condition for the homotopy of two mappings involves the use of chains of K with coefficients from the fundamental group of T and the\n2\n-dimensional homotopy group of T.\nAfter the award of his doctorate he informed\nMarston Morse\n, who was then at the Institute for Advanced Study at Princeton, of his success. He immediately invited Robbins to be his assistant for the academic year\n1938\n-\n39\nwhich Robbins happily accepted. However, he badly needed a permanent position, particularly since he was financially supporting his mother and sister. During that year\nRichard Courant\ncontacted\nMorse\nasking if he could recommend someone for the position of Instructor in Mathematics at New York University\n(\nNYU\n)\n-\nMorse\nrecommended Robbins and he began work at NYU in\n1939\n[\n4\n]\nor\n[\n5\n]\n:-\nMy salary as an instructor at NYU remained fixed at $\n2\n,\n500\na year during\n1939\n-\n1942\n. That was my sole support; there were no NSF grants then. Some time during the beginning of my first year at NYU,\nCourant\nsaid to me: \"I've been given a little money to work up some old course material into a book on mathematics for the general public. Would you like to help me with it? I can pay you $\n700\n-$\n800\nfor your assistance.\" I was in no position to turn down extra money for a legitimate enterprise, and the idea of communicating my ideas about mathematics to the educated layman appealed to me.\nThe collaboration between\nCourant\nand Robbins on\nWhat is Mathematics?\nwas a close one, and at one stage Robbins moved near to\nCourant\n's home in New Rochelle so that they could work whenever Courant had some free time. However, Robbins had a nasty shock when the final page proofs came from the printers as his name did not appear as an author. Despite having done a large part of the writing, he had quite a battle to have his name included as a joint author and, even after he succeeded,\nCourant\nheld the copyright for the book and forwarded some money to Robbins each year as his share of the royalties although he never knew how many copies had sold and whether what he received was fair.\nWhat is Mathematics?\n, published in\n1941\n,  was a best-seller.\nDonald Spencer\nwrites:-\nThe book is an elementary approach to modern mathematics in which processes of thought, rather than mechanical routines, are emphasized, and is a model of lucid exposition. From a level approximately that of a sound high-school training, the development proceeds by direct paths to some of the best content of mathematics; and fundamental ideas are made strikingly clear by well-chosen, simple examples. The text is illustrated with nearly\n300\ndiagrams, and much of the clarity arises from a generous use of geometrical interpretation. ... Although it is inevitable in a work of this scope that there should be a few historical statements with which specialists may disagree, it is nevertheless a work of extraordinary perfection.\nGiven Robbins' initial interest in literature, this comment from a description of a new edition brought out in\n1996\n(\nand still in print\n)\nis interesting:-\nThe best mathematics is like literature - it brings a story to life before your eyes and involves you in it, intellectually and emotionally. 'What is Mathematics?' is like a fine piece of literature - it opens a window onto the world of mathematics for anyone interested to view.\nIt was during his time at NYU that Robbins first became involved in statistics.\nCourant\ninvited\nWilliam Feller\nto give a course on probability and statistics at NYU and, at the last minute, after the course was advertised,\nFeller\nwas unable to come.\nCourant\nasked Robbins to give the course\n[\n4\n]\nor\n[\n5\n]\n:-\nIt must have been a pretty terrible course because I knew nothing about either subject.\nIn December\n1941\n, following the Japanese attack on the U.S. fleet at Pearl Harbour, the United States entered World War II. Robbins joined the United States Naval Reserve in\n1942\n, not as a mathematician but \"as a reasonably able-bodied person.\" During this period of war service, he overheard\n[\n3\n]\n:-\n... a conversation between two senior naval officers concerning the effect of random scatter on bomb impacts. Because of his lack of appropriate security clearance, he was prevented from pursuing this problem ... Nevertheless, his work on the naval officers' problem led to the fundamental papers\n[\n'On the measure of a random set'\n(1944)\nand 'On the measure of a random set II'\n(1944)]\nin the field of geometric probability.\nRobbins married Mary Dimock in\n1943\n; they had two daughters Mary Susannah and Marcia. When he left the United States Naval Reserve in\n1946\nhe had no academic job and decided to leave mathematics and look for an alternative career. He bought a farm in Vermont with back pay he received from the Navy.  However, he received a phone call from\nHarold Hotelling\nwho had just been appointed Professor of Mathematical Statistics at the University of North Carolina, Chapel Hill and was building up a new Department of Mathematical Statistics\n[\n4\n]\nor\n[\n5\n]\n:-\nHotelling\noffered me an associate professorship in this newly created department. I thought he'd telephoned the wrong Robbins ...\nHotelling\ninsisted that there was no mistake, even though I told him that I knew nothing about statistics. He didn't need me as a statistician; he wanted me to teach\nmeasure theory\n,\nprobability\n, analytic methods, etc. to the department's graduate students. Having read my paper in the Annals of Mathematical Statistics,\nHotelling\nfelt that I was just the sort of person he was looking for.\nRobbins joined the new department, which also had appointed\nWilliam Cochran\nto develop the graduate programme in statistics\n[\n4\n]\nor\n[\n5\n]\n:-\nAt Chapel Hill, I attended seminars and got to know several very eminent statisticians. Soon I began to get some idea about what was going on in that subject and finally, at age thirty-two, I became really interested in statistics.\nRobbins was promoted to professor at the University of North Carolina, Chapel Hill in\n1950\n. During six years at Chapel Hill\n[\n3\n]\n:-\n... Robbins not only studied and developed an increasingly deep interest in statistics, but he also made a number of profound contributions to his new field: complete convergence, compound decision theory, stochastic approximation, and the sequential design of experiments, to name a few.\nHe spent the year\n1952\n-\n53\nas a Guggenheim Fellow at the Institute for Advanced Study at Princeton, then took up an appointment as Professor of Mathematical Statistics at Columbia University. In\n1955\nRobbins and his wife Mary were divorced. He married Carol Hallett in\n1966\n; they had two sons, Mark Hallett and David Herbert, and a daughter Emily Carol. Robbins spent two years\n1966\n-\n68\nas Professor of Mathematics at the University of Michigan, Ann Arbor, before returning to Columbia. He was again a Guggenheim Fellow in\n1975\n-\n76\nand he spent the year at Imperial College in London, England. He remained as Professor of Mathematical Statistics at Columbia until he retired in\n1985\n[\n3\n]\n:-\nDuring this period\n[\nat Columbia\n]\nhe published over\n100\npapers on a variety of topics in probability and statistics. His most notable contributions include the creation of the empirical\nBayes\nmethodology, the theory of power-one tests, and the development of sequential methods for estimation, hypothesis testing, and comparative clinical trials.\nSome further details are given in\n[\n8\n]\n:-\nIn his research on empirical\nBayes\nmethods he showed that certain problems, which usually were treated separately, could profitably be combined so that data concerning one problem provided information useful in solving the others. ... Robbins' paper with his student Sutton Monro on Stochastic Approximation provided an analogue of an iterative method due to Isaac Newton for finding the root of a function, even when the function's equation is unknown and the evaluation of the function involves experimental error. The process they introduced has become a prototype for many iterative algorithms for on-line control of engineering systems.\nHis work on empirical\nBayes\nmethods is discussed in detail in\n[\n2\n]\nwhere Bradley Efron writes:-\nHerbert Robbins ranks high on anyone's list of influential postwar statisticians. Among his many fruitful ideas, empirical\nBayes\n, which he named as well as developed, has had the biggest effect on statistical thinking. ... current scientific trends favor a greatly increased role for empirical\nBayes\nmethods in practical data analysis.\nDuring the\n1960\ns and for part of the\n1970\ns, Robbins main area of research was on sequential analysis. David Siegmund explains in\n[\n7\n]\nthat his contributions here were of a somewhat different nature to his earlier work:-\n... unlike stochastic approximation and empirical\nBayes\n, where his first articles were arguably unprecedented, sequential analysis was a rapidly developing subject when Robbins made his first contributions. Consequently, his recurrent contributions can be seen as a dialogue with his contemporaries that has influenced succeeding generations. ... Herbert Robbins' research in sequential analysis was a major intellectual achievement that has changed forever the way we think about a large class of challenging problems.\nWe mentioned above that Robbins retired from Columbia University in\n1985\n. He had reached the age of seventy and a collection of\n48\nof his\n133\npapers\n(\nup to\n1984)\nwere reprinted in the book\nHerbert Robbins: Selected Papers\n. A reviewer wrote:-\nSpecialists all over the world esteem Herbert Robbins as a mathematician and statistician of outstanding versatility, creativity and of daring originality.\nThis, however, was certainly not the end of his academic career for he had another twelve years as Professor of Mathematical Statistics at Rutgers University before finally retiring for the last time in\n1997\n. He died of esophageal cancer in\n2001\nat the Princeton Medical Center in Princeton, New Jersey.\nFinally, let us quote from\n[\n6\n]\nRobbins advice to future statisticians:-\n... for the future I recommend that we work on interesting problems, avoid dogmatism, contribute to general mathematical theory or concrete practical applications according to our abilities and interests and, most important, formulate for ourselves a canon of humanistic values that will inspire and justify our work on a higher level than that of the well-trained and useful technician.",
  "matematicos_citados_na_biografia": [
    "Marston Morse",
    "Hassler Whitney",
    "Whitney",
    "American Mathematical Society",
    "Witold Hurewicz",
    "Richard Courant",
    "Morse",
    "Courant",
    "Donald Spencer",
    "William Feller",
    "Feller",
    "Harold Hotelling",
    "Hotelling",
    "measure theory",
    "probability",
    "William Cochran",
    "Bayes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}