{
  "nome_completo": "Hermann Ludwig Schmid",
  "nome_curto": "Hermann Ludwig Schmid",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmid/",
  "data_nascimento": "26 June 1908",
  "local_nascimento": "Göggingen near Augsburg, Bavaria, Germany",
  "data_morte": "16 April 1956",
  "local_morte": "Würzburg, Germany",
  "summary": "Hermann Ludwig Schmid was a German mathematician who worked in algebra and algebraic number theory.",
  "biografia": "Hermann Ludwig Schmid\n's father, Josef Schmid\n(1867\n-\n1913)\n, was a builder in Göggingen but sadly died in World War I when Hermann was five years old. Hermann was brought up by his mother, Walburga Wechsler\n(1879\n-\n1961)\n. He entered the University of Munich in\n1927\nand, after studying for his degree in mathematics and physics, qualified to teach these subjects in a\nGymnasium\nin\n1932\n. He then taught as a high school teacher before entering the Philipps University of Marburg in\n1933\nto undertake work on his doctorate supervised by\nHelmut Hasse\n. His thesis\nÜber das Reziprozitätsgesetz in relativ-zyklischen algebraischen Funktionenkörpern mit endlichem Konstantenkörper\nⓉ\n(\nOn the reciprocity law in relatively-cyclical algebraic function fields with finite constant field\n)\nwas accepted on\n17\nDecember\n1934\n. In this work, which was published in\nMathematische Zeitschrift\nin\n1936\n, he studied the reciprocity law in algebraic function fields.\nWe have not mentioned the political situation in Germany through these years but we note that after the Nazis came to power in\n1933\ntheir policy to dismiss Jewish academics caused major problems. In particular, at the University of Göttingen eighteen mathematicians left or were forced out. In particular\nHermann Weyl\nleft his chair at Göttingen and accepted a position at Princeton in the United States.\nHelmut Hasse\nwas offered\nWeyl\n's chair in\n1934\nand he moved from Marburg to Göttingen. In\n1935\nSchmid followed his former supervisor to Göttingen where he spent the two years\n1935\n-\n37\nas\nHasse\n's assistant. He participated in\nHasse\n's seminar on congruence function fields and\np\np\np\n-adic numbers, along with\nErnst Witt\nand\nOswald Teichmüller\n. In fact Schmid and\nWitt\ncollaborated on developing what today is called the '\nWitt\nvector calculus'.\nLeaving Göttingen, Schmid moved to the University of Giessen where he became editorial secretary of the\nZentralblatt für Mathematik\nin\n1938\n. He\nhabilitated\nat Giessen in\n1939\nwith his dissertation\nZur Meromorphismentheorie der elliptischen Funktionenkörper\nⓉ\n(\nOn the homomorphism theory of elliptic function fields\n)\n. The start of World War II saw Schmid undertake a short spell of military service before moving to the University of Berlin in\n1940\nas an assistant to Harald Geppert. Soon he became a\nPrivatdozent\nat the University of Berlin and in\n1946\nhe was appointed as a full professor at what had become the Humboldt University in East Berlin. He worked hard to restore both the teaching and research side of mathematics which had been devastated by the war. In particular, he was able to make the Mathematical Institute function again. It was through Schmid's efforts that\nHelmut Hasse\nwas brought to Berlin in\n1946\nafter being dismissed from his position at Göttingen. Also on\n1\nOctober\n1946\n, together with\nHasse\nand\nErhard Schmidt\n, Schmid succeeded in founding the Forschungsinstitut für Mathematik\n(\nResearch Institute for Mathematics\n)\nas part of the newly founded Deutsche Akademie der Wissenschaften zu Berlin\n(\nGerman Academy of Sciences in Berlin\n)\n. The\nBerlin Academy of Sciences\nhad ceased to exist during World War II and this new Academy, founded in August\n1946\n, was intended both to continue the work of the\nBerlin Academy\nand also to establish research institutes.\nThe\nZentralblatt für Mathematik\nhad ceased publication during World War II but in\n1947\nSchmid succeeded in restarting publication and, at this time, he took over as editor. This became one of the projects of the Academy's new Research Institute for Mathematics. Another major achievement in bringing mathematical life back after the war was the founding of the journal\nMathematische Nachrichten\nin\n1947\n; it was the mathematical journal of the Research Institute for Mathematics with its editorial office in the Institute. Largely it was on Schmid's initiative that the journal was founded and he became its managing edito;\nErhard Schmidt\nwas appointed editor-in-chief of the journal. Schmid was also able to restart a major project editing the\nMathematisches Wörterbuch\n(\nDictionary of Mathematics\n)\n, again as a project in the new Research Institute. After publication in\n1961\n(\nfive years after Schmid's death with further editorial work carried by Josef Naas\n)\nit received many excellent reviews:-\nThese two volumes constitute an encyclopaedia of most of the terminology of modern mathematics, and give not only definitions\n(\nusually with expository accounts\n)\nof the terms listed, but also references to the basic literature, whenever needed. ... The 'Wörterbuch' is the result of an extensive collaboration of\n127\nmathematicians, and is a tour de force of editing.\nIt is worth noting that the\n127\nmathematicians involved in writing the articles were associated with the Institute for Mathematics which Schmid had set up as part of the\nGerman Academy of Sciences\nin Berlin. Kenneth May wrote in a review\n[\n5\n]\n:-\nThe coverage is extensive, intensive, and up to date. The level is from college undergraduate to post-doctoral. It is a mathematician's dictionary. ... There is no seriously competitive collection of mathematical information in any language.\nIn\n1950\nthe Research Institute for Mathematics was divided into two sections. One section was 'Mathematik und Editionen'\n(\nMathematics and Editing\n)\nwith Schmid as its director. The other section, 'Angemandte Mathematik'\n(\nApplied Mathematics\n)\nwas directed by Kurt Schröder who had been joined the Institute in\n1949\n.\nSchmid moved to Würzburg in\n1953\nand Josef Naas took over his role as director of the Mathematik und Editionen section of the Research Institute for Mathematics. The authors of\n[\n3\n]\nwrite:-\nIn\n1953\nH L Schmid was offered a chair at Würzburg University which he accepted. Preceding negotiations with the Bavarian administration had been concluded to his satisfaction, and many of his collaborators could follow him from Berlin to Würzburg ... Schmid immediately concentrated his efforts on the planning of the construction of a new building for the Mathematics department and on establishing a research section with numerous non-resident collaborators who continued his extensive mathematical work. ... Soon, Schmid became Dean of the Faculty of Science and finally Rector of the University.\nFollowing his move to Berlin, the direction of Schmid's research changed somewhat and he moved away from algebraic number theory, becoming interested in topics in algebraic geometry and\nLamé\ndifferential equations. He published papers such as\nZur algebraischen Theorie der Formen\nⓉ\n(\nOn the algebraic theory of forms\n)\n(1947)\n,\nStörungsrechnung bei dreigliedrigen Rekursionen\nⓉ\n(\nPerturbation theory in tripartite recursions\n)\n(\nPart\n1\nin\n1948\n, Part\n2\nin\n1949)\n, and\nÜber Polynomkettenbrüche\nⓉ\n(\nOn polynomial continued fractions\n)\n(1951)\n.\nHermann Schmid died following a sudden heart attack at the age of\n47\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Helmut Hasse",
    "Hermann Weyl",
    "Weyl",
    "Hasse",
    "Ernst Witt",
    "Oswald Teichmüller",
    "Witt",
    "habilitated",
    "Privatdozent",
    "Erhard Schmidt",
    "Berlin Academy of Sciences",
    "Berlin Academy",
    "German Academy of Sciences",
    "Lamé"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}