{
  "nome_completo": "Heron of Alexandria",
  "nome_curto": "Heron of Alexandria",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heron/",
  "data_nascimento": "about AD 10",
  "local_nascimento": "(possibly) Alexandria, Egypt",
  "data_morte": "about AD 75",
  "local_morte": null,
  "summary": "Heron or Hero of Alexandria was an important geometer and worker in mechanics who invented many machines including a steam turbine. His best known mathematical work is the formula for the area of a triangle in terms of the lengths of its sides.",
  "biografia": "Sometimes called Hero,\nHeron of Alexandria\nwas an important geometer and worker in mechanics. Perhaps the first comment worth making is how common the name Heron was around this time and it is a difficult problem in the history of mathematics to identify which references to Heron are to the mathematician described in this article and which are to others of the same name. There are additional problems of identification which we discuss below.\nA major difficulty regarding Heron was to establish the date at which he lived. There were two main schools of thought on this, one believing that he lived around\n150\nBC and the second believing that he lived around\n250\nAD. The first of these was based mainly on the fact that Heron does not quote from any work later than\nArchimedes\n. The second was based on an argument which purported to show that he lived later that\nPtolemy\n, and, since\nPappus\nrefers to Heron, before\nPappus\n.\nBoth of these arguments have been shown to be wrong. There was a third date proposed which was based on the belief that Heron was a contemporary of Columella. Columella was a Roman soldier and farmer who wrote extensively on agriculture and similar subjects, hoping to foster in people a love for farming and a liking for the simple life. Columella, in a text written in about\n62\nAD\n[\n5\n]\n:-\n... gave measurements of plane figures which agree with the formulas used by Heron, notably those for the equilateral triangle, the regular hexagon\n(\nin this case not only the formula but the actual figures agree with Heron's\n)\nand the segment of a circle which is less than a semicircle ...\nHowever, most historians believed that both Columella and Heron were using an earlier source and claimed that the similarity did not prove any dependence. We now know that those who believed that Heron lived around the time of Columella were in fact correct, for\nNeugebauer\nin\n1938\ndiscovered that Heron referred to a recent eclipse in one of his works which, from the information given by Heron, he was able to identify with one which took place in Alexandria at\n23\n.\n00\nhours on\n13\nMarch\n62\n.\nFrom Heron's writings it is reasonable to deduce that he taught at the Museum in Alexandria. His works look like lecture notes from courses he must have given there on mathematics, physics, pneumatics, and mechanics. Some are clearly textbooks while others are perhaps drafts of lecture notes not yet worked into final form for a student textbook.\nPappus\ndescribes the contribution of Heron in Book VIII of his\nMathematical Collection\n.\nPappus\nwrites\n(\nsee for example\n[\n8\n]\n)\n:-\nThe mechanicians of Heron's school say that mechanics can be divided into a theoretical and a manual part; the theoretical part is composed of geometry, arithmetic, astronomy and physics, the manual of work in metals, architecture, carpentering and painting and anything involving skill with the hands.\n... the ancients also describe as mechanicians the wonder-workers, of whom some work by means of pneumatics, as Heron in his Pneumatica, some by using strings and ropes, thinking to imitate the movements of living things, as Heron in his Automata and Balancings, ... or by using water to tell the time, as Heron in his Hydria, which appears to have affinities with the science of sundials.\nA large number of works by Heron have survived, although the authorship of some is disputed. We will discuss some of the disagreements in our list of Heron's works below. The works fall into several categories, technical works, mechanical works and mathematical works. The surviving works are:\nOn the dioptra\ndealing with\ntheodolites\nand surveying. It contains a chapter on astronomy giving a method to find the distance between Alexandria and Rome using the difference between local times at which an eclipse of the moon is observed at each cities. The fact that\nPtolemy\ndoes not appear to have known of this method led historians to mistakenly believe Heron lived after\nPtolemy\n;\nThe pneumatica\nin two books studying mechanical devices worked by air, steam or water pressure. It is described in more detail below;\nThe automaton theatre\ndescribing a puppet theatre worked by strings, drums and weights;\nBelopoeica\ndescribing how to construct engines of war. It has some similarities with work by\nPhilon\nand also work by\nVitruvius\nwho was a Roman architect and engineer who lived in the\n1\nst\ncentury BC;\nThe cheirobalistra\nabout catapults is thought to be part of a dictionary of catapults but was almost certainly not written by Heron;\nMechanica\nin three books written for architects and described in more detail below;\nMetrica\nwhich gives methods of measurement. We give more details below;\nDefinitiones\ncontains\n133\ndefinitions of geometrical terms beginning with points, lines etc. In\n[\n15\n]\nKnorr\nargues convincingly that this work is in fact due to\nDiophantus\n;\nGeometria\nseems to be a different version of the first chapter of the\nMetrica\nbased entirely on examples. Although based on Heron's work it is not thought to be written by him;\nStereometrica\nmeasures three-dimensional objects and is at least in part based on the second chapter of the\nMetrica\nagain based on examples. Again it is though to be based on Heron's work but greatly changed by many later editors;\nMensurae\nmeasures a whole variety of different objects and is connected with parts of\nStereometrica\nand\nMetrica\nalthough it must be mainly the work of a later author;\nCatoptrica\ndeals with mirrors and is attributed by some historians to\nPtolemy\nalthough most now seem to believe that this is a genuine work of Heron. In this work, Heron states that vision results from light rays emitted by the eyes. He believes that these rays travel with infinite velocity.\nLet us examine some of Heron's work in a little more depth. Book I of his treatise\nMetrica\ndeals with areas of triangles, quadrilaterals, regular polygons of between\n3\nand\n12\nsides, surfaces of cones, cylinders, prisms, pyramids, spheres etc. A method, known to the Babylonians\n2000\nyears before, is also given for approximating the square root of a number. Heron gives this in the following form\n(\nsee for example\n[\n5\n]\n)\n:-\nSince\n720\nhas not its side\nrational\n, we can obtain its side within a very small difference as follows. Since the next succeeding\nsquare number\nis\n729\n, which has\n27\nfor its side, divide\n720\nby\n27\n. This gives\n26\n2\n3\n26\\large\\frac{2}{3}\\normalsize\n2\n6\n3\n2\n​\n. Add\n27\nto this, making\n53\n2\n3\n53\\large\\frac{2}{3}\\normalsize\n5\n3\n3\n2\n​\n, and take half this or\n26\n5\n6\n26\\large\\frac{5}{6}\\normalsize\n2\n6\n6\n5\n​\n. The side of\n720\nwill therefore be very nearly\n26\n5\n6\n26\\large\\frac{5}{6}\\normalsize\n2\n6\n6\n5\n​\n. In fact, if we multiply\n26\n5\n6\n26\\large\\frac{5}{6}\\normalsize\n2\n6\n6\n5\n​\nby itself, the product is\n720\n1\n36\n720\\large\\frac{1}{36}\\normalsize\n7\n2\n0\n3\n6\n1\n​\n, so the difference in the square is\n1\n36\n\\large\\frac{1}{36}\\normalsize\n3\n6\n1\n​\n. If we desire to make the difference smaller still than\n1\n36\n\\large\\frac{1}{36}\\normalsize\n3\n6\n1\n​\n, we shall take\n720\n1\n36\n720\\large\\frac{1}{36}\\normalsize\n7\n2\n0\n3\n6\n1\n​\ninstead of\n729\n(\nor rather we should take\n26\n5\n6\n26\\large\\frac{5}{6}\\normalsize\n2\n6\n6\n5\n​\ninstead of\n27)\n, and by proceeding in the same way we shall find the resulting difference much less than\n1\n36\n\\large\\frac{1}{36}\\normalsize\n3\n6\n1\n​\n.\nHeron also proves his famous formula in Book I of the\nMetrica\n:-\nif A is the area of a triangle with sides a, b and c and\ns\n=\n1\n2\n(\na\n+\nb\n+\nc\n)\ns = \\large\\frac{1}{2}\\normalsize (a + b + c)\ns\n=\n2\n1\n​\n(\na\n+\nb\n+\nc\n)\nthen\nA\n2\n=\ns\n(\ns\n−\na\n)\n(\ns\n−\nb\n)\n(\ns\n−\nc\n)\nA^{2} = s (s - a)(s - b)(s - c)\nA\n2\n=\ns\n(\ns\n−\na\n)\n(\ns\n−\nb\n)\n(\ns\n−\nc\n)\n.\nIn Book II of\nMetrica\n, Heron considers the measurement of volumes of various three dimensional figures such as spheres, cylinders, cones, prisms, pyramids etc. His preface is interesting, partly because knowledge of the work of\nArchimedes\ndoes not seem to be as widely known as one might expect\n(\nsee for example\n[\n5\n]\n)\n:-\nAfter the measurement of surfaces, rectilinear or not, it is proper to proceed to solid bodies, the surfaces of which we have already measured in the preceding book, surfaces plane and spherical, conical and cylindrical, and irregular surfaces as well. The methods of dealing with these solids are, in view of their surprising character, referred to\nArchimedes\nby certain writers who give the traditional account of their origin. But whether they belong to\nArchimedes\nor another, it is necessary to give a sketch of these results as well.\nBook III of\nMetrica\ndeals with dividing areas and volumes according to a given ratio. This was a problem which\nEuclid\ninvestigated in his work\nOn divisions of figures\nand Heron's Book III has a lot in common with the work of\nEuclid\n. Also in Book III, Heron gives a method to find the cube root of a number. In particular Heron finds the cube root of\n100\nand the authors of\n[\n9\n]\ngive a general formula for the cube root of\nN\nN\nN\nwhich Heron seems to have used in his calculation:\na\n+\nb\nd\nb\nd\n+\na\nD\n(\nb\n−\na\n)\na + \\Large \\frac {b d}{b d + aD} \\normalsize(b - a)\na\n+\nb\nd\n+\na\nD\nb\nd\n​\n(\nb\n−\na\n)\n, where\na\n3\n<\nN\n<\nb\n3\n,\nd\n=\nN\n−\na\n3\n,\nD\n=\nb\n3\n−\nN\na^{3} < N < b^{3}, d = N - a^{3}, D = b^{3} - N\na\n3\n<\nN\n<\nb\n3\n,\nd\n=\nN\n−\na\n3\n,\nD\n=\nb\n3\n−\nN\n.\nIn\n[\n9\n]\nit is remarked that this is a very accurate formula, but, unless a Byzantine copyist is to be blamed for an error, they conclude that Heron might have borrowed this accurate formula without understanding how to use it in general.\nThe\nPneumatica\nis a strange work which is written in two books, the first with\n43\nchapters and the second with\n37\nchapters. Heron begins with a theoretical consideration of pressure in fluids. Some of this theory is right but, not surprisingly, some is quite wrong. Then there follows a description of a whole collection of what might best be described as mechanical toys for children\n[\n1\n]\n:-\nTrick jars that give out wine or water separately or in constant proportions, singing birds and sounding trumpets, puppets that move when a fire is lit on an altar, animals that drink when they are offered water ...\nAlthough all this seems very trivial for a scientist to be involved with, it would appear that Heron is using these toys as a vehicle for teaching physics to his students. It seems to be an attempt to make scientific theories relevant to everyday items that students of the time would be familiar with.\nThere is, rather remarkably, descriptions of over\n100\nmachines such as a fire engine, a wind organ, a coin-operated machine, and a steam-powered engine called an aeolipile. Heron's aeolipile, which has much in common with a jet engine, is described in\n[\n2\n]\nas follows:-\nThe aeolipile was a hollow sphere mounted so that it could turn on a pair of hollow tubes that provided steam to the sphere from a cauldron. The steam escaped from the sphere from one or more bent tubes projecting from its equator, causing the sphere to revolve. The aeolipile is the first known device to transform steam into rotary motion.\nHeron wrote a number of important treatises on mechanics. They give methods of lifting heavy weights and describe simple mechanical machines. In particular the\nMechanica\nis based quite closely on ideas due to\nArchimedes\n. Book I examines how to construct three dimensional shapes in a given proportion to a given shape. It also examines the theory of motion, certain statics problems, and the theory of the balance.\nIn Book II Heron discusses lifting heavy objects with a lever, a pulley, a wedge, or a screw. There is a discussion on centres of gravity of plane figures. Book III examines methods of transporting objects by such means as sledges, the use of cranes, and looks at wine presses.\nOther works have been attributed to Heron, and for some of these we have fragments, for others there are only references. The works for which fragments survive include one on\nWater clocks\nin four books, and\nCommentary on\nEuclid\n's Elements\nwhich must have covered at least the first eight books of the\nElements\n. Works by Heron which are referred to, but no trace survives, include\nCamarica\nor\nOn vaultings\nwhich is mentioned by\nEutocius\nand\nZygia\nor\nOn balancing\nmentioned by\nPappus\n. Also in the\nFihrist\n, a tenth century survey of Islamic culture, a work by Heron on how to use an\nastrolabe\nis mentioned.\nFinally it is interesting to look at the opinions that various writers have expressed as to the quality and importance of Heron.\nNeugebauer\nwrites\n[\n7\n]\n:-\nThe decipherment of the mathematical cuneiform texts made it clear that much of the \"Heronic\" type of Greek mathematics is simply the last phase of the Babylonian mathematical tradition which extends over\n1800\nyears.\nSome have considered Heron to be an ignorant artisan who copied the contents of his books without understanding what he wrote. This in particular has been levelled against the\nPneumatica\nbut Drachmann, writing in\n[\n1\n]\n, says:-\n... to me the free flowing, rather discursive style suggests a man well versed in his subject who is giving a quick summary to an audience that knows, or who might be expected to know, a good deal about it.\nSome scholars have approved of Heron's practical skills as a surveyor but claimed that his knowledge of science was negligible. However, Mahony writes in\n[\n1\n]\n:-\nIn the light of recent scholarship, he now appears as a well-educated and often ingenious applied mathematician, as well as a vital link in a continuous tradition of practical mathematics from the Babylonians, through the Arabs, to Renaissance Europe.\nFinally\nHeath\nwrites in\n[\n5\n]\n:-\nThe practical utility of Heron's manuals being so great, it was natural that they should have great vogue, and equally natural that the most popular of them at any rate should be re-edited, altered and added to by later writers; this was inevitable with books which, like the \"Elements\" of\nEuclid\n, were in regular use in Greek, Byzantine, Roman, and Arabian education for centuries.",
  "matematicos_citados_na_biografia": [
    "Archimedes",
    "Ptolemy",
    "Pappus",
    "Neugebauer",
    "theodolites",
    "Philon",
    "Vitruvius",
    "Knorr",
    "Diophantus",
    "rational",
    "square number",
    "Euclid",
    "Eutocius",
    "astrolabe",
    "Heath"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}