{
  "nome_completo": "Hideo Tanaka",
  "nome_curto": "Hideo Tanaka",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tanaka/",
  "data_nascimento": "28 September 1938",
  "local_nascimento": "Osaka, Japan",
  "data_morte": "16 May 2012",
  "local_morte": "Osaka, Japan",
  "summary": "Hideo Tanaka was a Japanese mathematician known for his work on fuzzy sets.",
  "biografia": "Hideo Tanaka\nstudied at Kobe University in the city of Kobe, a neighbouring city of Osaka, the city of his birth. He was awarded the degree BS in Instrumentation Engineering from Kobe University in March\n1962\n. In April\n1964\nhe enrolled in the Graduate School of Engineering at Osaka City University and was awarded an M.S. in Electrical Engineering in\n1966\n. During his graduate studies, Tanaka was advised by Kiyoji Asai\n(1923\n-\n2012)\n. Three years later he was awarded his Ph.D. degrees from Osaka City University, also in Electrical Engineering. His research topic was 'Sensitivity analysis in control theory' but it is not for his work in that area that we have included Tanaka in this mathematics archive, rather it is for his work on Fuzzy Operations Research. His interest in that area began while he was a graduate student and he read the paper\nFuzzy Sets\nby Lotfali Askar Zadeh.\nL A Zadeh was born in Baku, Azerbaijan, in\n1921\nand emigrated to the United States in\n1943\n. He was a professor at the University of California, Berkeley, from\n1959\nand published the paper\nFuzzy Sets\nin\n1965\n. The Abstract to Zadeh's paper, which inspired Tanaka, is as follows:-\nA fuzzy set is a class of objects with a continuum of grades of membership. Such a set is characterized by a membership\n(\ncharacteristic\n)\nfunction which assigns to each object a grade of membership ranging between zero and one. The notions of inclusion, union, intersection, complement, relation, convexity, etc., are extended to such sets, and various properties of these notions in the context of fuzzy sets are established. In particular, a separation theorem for convex fuzzy sets is proved without requiring that the fuzzy sets be disjoint.\nAfter graduating, Tanaka was appointed to the Department of Industrial Engineering at Osaka Prefecture University as a research associate in July\n1969\nand he worked there until he retired in March\n2000\n. He was promoted to a lecturer in June\n1977\n, an associate professor in April\n1983\nand a full professor in July\n1987\n[\n2\n]\n:-\nHe worked on fuzzy systems research with Professor Kiyoji Asai for many years until Professor Asai's retirement. His main research achievements were accomplished over\n30\nyears at Osaka Prefecture University.\nKiyoji Asai had become interested in fuzzy sets while Tanaka was studying with him. In March\n1967\nKiyoji Asai went to the University of California, Berkeley, to spend a year working in the Computer Science Division with Lotfi Zadeh. He moved from Osaka City University to take up a full professorship at Osaka Prefecture University in\n1969\nand at that time Tanaka was appointed as a research associate.\nWhile having a permanent position at Osaka Prefecture University, Tanaka held a number of other visiting positions during these years. From\n1972\nto\n1973\n, he was a Visiting Research Associate in the Computer Science Division of the University of California, Berkeley, where he was able to work with the Head of the Division, L A Zadeh, whose\n1965\npaper had inspired him to work on fuzzy theory. He was an Alexander Von Humboldt Foundation Fellow from\n1975\nto\n1977\n, working with Hans-Jürgen Zimmermann\n(1934\n-\n)\nat Rheinisch Westfälische Technische Hochschule in Aachen, Germany. Zimmermann, who worked in the Department for Operations Research, was pursuing research in fuzzy set theory and its applications and his interests were close to those of Tanaka. During\n1981\n-\n82\n, Tanaka was in the United States at Kansas State University. There he spent the year as a research associate working with Liang-tseng Fan\n(1929\n-\n)\nwho was a professor in the Department of Chemical Engineering. Fan's interests were in process systems engineering, chemical reaction engineering, and transport phenomena.\nAs an indication of the topics on which Tanaka undertook research, we quote the titles of some of his papers. Many are joint papers, but we choose not to record the other authors. For example there is:\nSynthesis of low-sensitivity closed-loop systems by iterative method\n(1969)\n;\nSynthesis of linear feedback control systems based on sensitivity considerations\n(1969)\n;\nEquivalence condition of optimal control problems\n(1971)\n;\nOn fuzzy-mathematical programming\n(1973)\n;\nDecision-making and information in fuzzy events\n(1974)\n;\nDecision-making and its goal in a fuzzy environment\n(1974)\n;\nApplications of fuzzy sets to decision making and control\n(1975)\n;\nA formulation of fuzzy decision problems and its application to an investment problem\n(1976)\n;\nFuzzy information and decision in statistical model\n(1979)\n; and\nFuzzy linear programming based on fuzzy functions\n(1980)\n.\nTanaka published a number of books in Japanese including:\nFuzzy modelling and its applications\n(1990)\n;\nFuzzy OR\n(1993)\n;\nData analysis software\n(1995)\n; and\nReasoning and knowledge acquisition from the data\n(2004)\n. He also published the English book\nPossibilistic data analysis for operations research\n(1999)\n. The publisher writes of the cover of the book:-\nThis unique monograph provides new theories and techniques of possibility theory for data analysis in operations research. In this book the basic concept of an exponential possibility distribution and its properties are introduced. Based on the exponential possibility distribution, identification methods are given to obtain the upper and lower possibility distributions to reflect the expert's knowledge. As applications of exponential possibility distributions, possibility regression, possibility discriminant and possibility portfolio selection problems and other related theories are presented. Possibility data analysis offers not only the general methodology to analyze and model the uncertainty in operations research but also the common and simple way to solve the problems. It integrates model building and model solving.\nThe Preface to the book outlines its contents:-\nThis book focuses on some new achievements in possibility theory and its applications. Chapter\n1\noutlines the content of this book. Chapter\n2\ncovers the fundamentals of possibility theory, such as possibility distributions and the associated operations, possibility and necessity measures and possibilistic linear systems. Chapter\n3\nfocuses on the theory of possibilistic systems based on exponential possibility distributions. As a basic algorithm Chapter\n4\nintroduces a detailed method for identifying the possibility distributions from the given data and the associated possibility grades, which are used to reflect expert knowledge in decision-making processes. Chapter\n5\nintroduces possibilistic regression analysis where the functional relationship between the input and output data is explained as a possibilistic one. It can be used as a powerful tool for decision-making. Chapter\n6\nproposes the completely new portfolio selection models based on possibility distributions rather than probability distributions in conventional portfolio selection models where expert knowledge can be reflected by the identified possibility distributions. Chapter\n7\naddresses discriminant analysis based on possibility distributions where the discriminant function separates the data into proper groups according to the possibility measure. Lastly, in Chapter\n8\nas a related technique rough set analysis is introduced.\nA month after Tanaka retired in March\n2000\n, he was appointed as a Professor in the Graduate School of Management and Information Science at Toyohashi-Sozo College. This was a private university in Toyohashi, Aichi, Japan, which had been founded in\n1983\nand became a four-year college in\n1998\n. He was also appointed as a Professor in the Department of Kansei Design in the Faculty of Psychological Science at Hiroshima International University, which had been founded two years earlier in\n1998\n. Kansei Design aims to improve products and services by studying the psychological feelings of the users. He held these positions for two years. Also in April\n2000\nhe had been made Professor Emeritus at Osaka Prefecture University. He was made an Honorary Professor of Chongqing University of Posts and Telecommunications on\n9\nOctober\n2003\n. This Chinese university specialised in information science and technology, with coordinated development in the fields of engineering, science, management, and liberal arts.\nFor his contributions to fuzzy theory, Tanaka received many awards. He received the Contribution Award from The Japanese Institute of Industrial Engineering\n(1991)\n, the Literary Award from the Japanese Society for Fuzzy Theory and Systems\n(1993)\n, the Achievement Award from Japanese Society for Fuzzy Theory and Systems\n(1999)\n, and the IEEE Fuzzy Systems Pioneer Award\n(2010)\n. He spoke about his approach to research in his acceptance speech for the IEEE Fuzzy Systems Pioneer Award:-\nI would like to talk about three things I have discovered in my research career. The first is that curiosity is necessary, that is what led me to the fuzzy title of the paper by Professor Zadeh. In several following years, it opened a new world for me. Second, achievement is very important but I learnt that the process is more important than achievement. I have enjoyed the process of studying fuzzy systems for a long time. Third, very good research works can only be attained with the collaboration with many researchers. My achievement is not very big but the process has been very enjoyable for me. Probably I think that my works will end up being a nice little tree of collaborations of my friends, my colleagues and many other researchers. So, I would like to share this award with all of you.\nTanaka's students, who wrote the article\n[\n2\n]\n, describe what is was like to be one of his students:-\nWe have fond memories of Professor Hideo Tanaka, Mrs Fuku Tanaka and their daughters. We will never forget our interactions with his family. He was kind, good and stubborn. When we read books and scientific papers with him, he sometimes persisted in clarifying certain points when he was not satisfied with the explanations he received from his students. He often could not move forward without clarifying these points. These discussions were difficult for students because this information is not easily explained; often, we engaged in discussions or arguments on unclear points for hours. These discussions helped us understand how to seek the logic and concepts behind the material we read. Prof Tanaka's students have happy memories of these experiences. Prof Tanaka invited his students to his home on many occasions. Mrs Fuku Tanaka was always very hospitable and provided a variety of succulent dishes. She acquired these recipes during the Tanakas' two visits to the US and during their one-time stay in Germany. Professor Tanaka generally preferred philosophical discussions with sociological implications. He offered explanations that provided easier comprehension of difficult subjects. Professor Tanaka was an exceptionally good and benevolent person who developed a personal friendship with many of his colleagues, in Japan and abroad. He behaved like a good father to his students and juniors, helping them in every way he could, both in physical and spiritual distress, and helping them towards the development of better personalities, in their academic and private lives.\nThe authors of\n[\n1\n]\n, also students of Tanaka, write:-\nProfessor Hideo Tanaka had a good aptitude and pioneering spirit but he always studied with us in a condescending attitude. He continued his study on Fuzzy Sets and Systems until his retirement. He was so friendly that we could talk and take advice from him without any hesitation. Therefore, we felt that he was like a father or a brother for us in one aspect and a friend in the other aspect. Finally, he was an eager Christian and he sometimes held a seminar for his neighbours to learn Christianity.\nTanaka suffered from interstitial pneumonia and he struggled for several years with the disease before it finally led to his death at the age of\n74\n.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "thumbnail.jpg"
  ]
}