{
  "nome_completo": "Hippocrates of Chios",
  "nome_curto": "Hippocrates",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hippocrates/",
  "data_nascimento": "about 470 BC",
  "local_nascimento": "Chios, Greece",
  "data_morte": "about 410 BC",
  "local_morte": null,
  "summary": "Hippocrates was a Greek mathematician who worked on the classical problems of squaring the circle and duplicating the cube.",
  "biografia": "Hippocrates of Chios\ntaught in Athens and worked on the classical problems of\nsquaring the circle\nand\nduplicating the cube\n. Little is known of his life but he is reported to have been an excellent geometer who, in other respects, was stupid and lacking in sense. Some claim that he was defrauded of a large sum of money because of his naiveté.\nIamblichus\n[\n4\n]\nwrites:-\nOne of the Pythagoreans\n[\nHippocrates\n]\nlost his property, and when this misfortune befell him he was allowed to make money by teaching geometry.\nHeath\n[\n6\n]\nrecounts two versions of this story:-\nOne version of the story is that\n[\nHippocrates\n]\nwas a merchant, but lost all his property through being captured by a pirate vessel. He then came to Athens to persecute the offenders and, during a long stay, attended lectures, finally attaining such proficiency in geometry that he tried to square the circle.\nHeath\nalso recounts a different version of the story as told by\nAristotle\n:-\n... he allowed himself to be defrauded of a large sum by custom-house officers at Byzantium, thereby proving, in\nAristotle\n's opinion, that, though a good geometer, he was stupid and incompetent in the business of ordinary life.\nThe suggestion is that this 'long stay' in Athens was between about\n450\nBC and\n430\nBC.\nIn his attempts to square the circle, Hippocrates was able to find the areas of\nlunes\n, certain crescent-shaped figures, using his theorem that the ratio of the areas of two circles is the same as the ratio of the squares of their radii. We describe this impressive achievement more fully below.\nHippocrates also showed that a cube can be doubled if two mean proportionals can be determined between a number and its double. This had a major influence on attempts to duplicate the cube, all efforts after this being directed towards the mean proportionals problem.\nHe was the first to write an\nElements of Geometry\nand although his work is now lost it must have contained much of what\nEuclid\nlater included in Books\n1\nand\n2\nof the\nElements\n.\nProclus\n, the last major Greek philosopher, who lived around\n450\nAD wrote:-\nHippocrates of Chios, the discoverer of the\nquadrature\nof the lune, ... was the first of whom it is recorded that he actually compiled \"Elements\".\nHippocrates' book also included geometrical solutions to\nquadratic equations\nand included early methods of integration.\nEudemus\nof Rhodes, who was a pupil of\nAristotle\n, wrote\nHistory of Geometry\nin which he described the contribution of Hippocrates on lunes. This work has not survived but\nSimplicius\nof Cilicia, writing in around\n530\n, had access to\nEudemus\n's work and he quoted the passage about the lunes of Hippocrates 'word for word except for a few additions' taken from\nEuclid\n's\nElements\nto make the description clearer.\nWe will first quote part of the passage of\nEudemus\nabout the lunes of Hippocrates, following the historians of mathematics who have disentangled the additions from\nEuclid\n's\nElements\nwhich\nSimplicius\nadded. See\n[\n6\n]\nboth for the translation which we give and for a discussion of which parts are due to\nEudemus\n:-\nThe quadratures of lunes, which were considered to belong to an uncommon class of propositions on account of the close relation of lunes to the circle, were first investigated by Hippocrates, and his exposition was thought to be correct; we will therefore deal with them at length and describe them. He started with, and laid down as the first of the theorems useful for the purpose, the proposition that similar segments of circles have the same ratio to one another as the squares on their bases. And this he proved by first showing that the squares on the diameters have the same ratio as the circles.\nBefore continuing with the quote we should note that Hippocrates is trying to 'square a lune' by which he means to construct a square equal in area to the lune. This is precisely what the problem of 'squaring the circle' means, namely to construct a square whose area is equal to the area of the circle. Again following\nHeath\n's translation in\n[\n6\n]\n:-\nAfter proving this, he proceeded to show in what way it was possible to square a lune the outer circumference of which is that of a semicircle. This he affected by circumscribing a semicircle about an isosceles right-angled triangle and a segment of a circle similar to those cut off by the sides. Then, since the segment about the base is equal to the sum of those about the sides, it follows that, when the part of the triangle above the segment about the base is added to both alike, the lune will be equal to the triangle. Therefore the lune, having been proved equal to the triangle, can be squared.\nTo follow Hippocrates' argument here, look at the diagram.\nA\nB\nC\nD\nABCD\nA\nB\nC\nD\nis a square and\nO\nO\nO\nis its centre. The two circles in the diagram are the circle with centre\nO\nO\nO\nthrough\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\nand\nD\nD\nD\n, and the circle with centre\nD\nD\nD\nthrough\nA\nA\nA\nand\nC\nC\nC\n.\nNotice first that the segment marked\n1\non\nA\nB\nAB\nA\nB\nsubtends a right angle at the centre of the circle\n(\nthe angle\nA\nO\nB\nAOB\nA\nO\nB\n)\nwhile the segment\n2\non\nA\nC\nAC\nA\nC\nalso subtends a right angle at the centre\n(\nthe angle\nA\nD\nC\nADC\nA\nD\nC\n)\n.\nTherefore the segment\n1\non\nA\nB\nAB\nA\nB\nand the segment\n2\non\nA\nC\nAC\nA\nC\nare similar. Now\nsegment 1\nsegment 2\n=\nA\nB\n2\nA\nC\n2\n=\n1\n2\n\\Large\\frac {\\text{segment 1}}{\\text{segment 2}} \\normalsize = \\Large\\frac {AB^{2}}{AC^{2}} \\normalsize = \\Large\\frac{1}{2}\nsegment 2\nsegment 1\n​\n=\nA\nC\n2\nA\nB\n2\n​\n=\n2\n1\n​\nsince\nA\nB\n2\n+\nB\nC\n2\n=\nA\nC\n2\nAB^{2}+ BC^{2}= AC^{2}\nA\nB\n2\n+\nB\nC\n2\n=\nA\nC\n2\nby\nPythagoras\n's theorem, and\nA\nB\n=\nB\nC\nAB = BC\nA\nB\n=\nB\nC\nso\nA\nC\n2\n=\n2\nA\nB\n2\nAC^{2}= 2AB^{2}\nA\nC\n2\n=\n2\nA\nB\n2\n.\nNow since segment\n2\nis twice segment\n1\n, the segment\n2\nis equal to the sum of the two segments marked\n1\n.\nThen Hippocrates argues that the semicircle\nA\nB\nC\nABC\nA\nB\nC\nwith the two segments\n1\nremoved is the triangle\nA\nB\nC\nABC\nA\nB\nC\nwhich can be squared\n(\nit was well known how to construct a square equal to a triangle\n)\n.\nHowever, if we subtract the segment\n2\nfrom the semicircle\nA\nB\nC\nABC\nA\nB\nC\nwe get the lune shown in the second diagram. Thus Hippocrates has proved that the lune can be squared.\nHowever, Hippocrates went further than this in studying lunes. The proof we have examined in detail is one where the outer circumference of the lune is the arc of a semicircle. He also studied the cases where the outer arc was less than that of a semicircle and also the case where the outer arc was greater than a semicircle, showing in each case that the lune could be squared. This was a remarkable achievement and a major step in attempts to square the circle. As\nHeath\nwrites in\n[\n6\n]\n:-\n... he wished to show that, if circles could not be squared by these methods, they could be employed to find the area of some figures bounded by arcs of circles, namely certain lunes, and even of the sum of a certain circle and a certain lune.\nThere is one further remarkable achievement which historians of mathematics believe that Hippocrates achieved, although we do not have a direct proof since his works have not survived. In Hippocrates' study of lunes, as described by\nEudemus\n, he uses the theorem that circles are to one another as the squares on their diameters. This theorem is proved by\nEuclid\nin the\nElements\nand it is proved there by the\nmethod of exhaustion\ndue to\nEudoxus\n. However,\nEudoxus\nwas born within a few years of the death of Hippocrates, and so there follows the intriguing question of how Hippocrates proved this theorem. Since\nEudemus\nseems entirely satisfied that Hippocrates does indeed have a correct proof, it seems almost certain from this circumstantial evidence that we can deduce that Hippocrates himself developed at least a variant of the method of exhaustion.",
  "matematicos_citados_na_biografia": [
    "squaring the circle",
    "duplicating the cube",
    "Iamblichus",
    "Heath",
    "Aristotle",
    "lunes",
    "Euclid",
    "Proclus",
    "quadrature",
    "quadratic equations",
    "Eudemus",
    "Simplicius",
    "Pythagoras",
    "method of exhaustion",
    "Eudoxus"
  ],
  "imagens": [
    "thumbnail.jpg",
    "../../Diagrams/Lune.gif"
  ]
}