{
  "nome_completo": "Clifford Hugh Dowker",
  "nome_curto": "Hugh Dowker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dowker/",
  "data_nascimento": "2 March 1912",
  "local_nascimento": "Parkhill, Western Ontario, Canada",
  "data_morte": "14 October 1982",
  "local_morte": "London, England",
  "summary": "Hugh Dowker was a Canadian-born mathematician known for his work on knot theory.",
  "biografia": "Hugh Dowker\n's parents owned a small farm in Western Ontario in Canada. His father's ancestors came from Yorkshire in England while his mother's came from Scotland. It was not a family with any previous record of academic achievement and, in fact, Hugh was the only one of his parent's three sons to have a university education. Hugh certainly did not have an easy time with his school education for in primary school he had to walk two miles every day to reach the school.\nWhen he progressed to secondary school in Parkhill things became even more difficult for he found himself with a mathematics teacher who appeared to have no understanding of the subject. Most of the great mathematicians in this archive were inspired to become mathematicians by fine teaching at school but in Dowker's case he received payment to stay behind after school to show the mathematics teacher how to do the problems!\nDespite these difficulties with his schooling Dowker won a scholarship to enable him to study at the University of Western Ontario. There he showed his outstanding ability in mathematics but he studied other subjects for his B.A. as well, such as physics and economics. The degree was awarded in\n1933\n. At this stage he had gone far further than someone from Dowker's background could ever expect to go in academic pursuits so it was natural for him to wish to end his education at this point. His aim had been to become a school teacher, after all he had shown at secondary school that he could teach the teacher mathematics, and he was now well on his way to achieving this. Others, realising that he had extraordinary talents for mathematics, worked hard to persuade him to continue. They were successful and in the following year he studied for his Master's degree at the University of Toronto.\nAgain Dowker was surprised to find that his lecturers at Toronto advised him to go to Princeton to study for a doctorate under\nLefschetz\n. Strauss writes in\n[\n4\n]\n(\nor see\n[\n3\n]\n)\n:-\nIt was at Princeton that Dowker became fully aware of the power and beauty of mathematics, and he became an active topologist, running one of\nLefschetz\n's seminars. He obtained his Ph.D. there in\n1938\n. Apart from\nLefschetz\n, the mathematicians who were to have an important influence on Dowker included\nAleksandrov\n,\nFox\n,\nHurewicz\nand\nSteenrod\n.\nDowker's doctoral thesis extended basic results in homotopy theory from compact metric spaces to normal and parametric spaces.\nAfter the award of his doctorate in\n1938\nDowker was appointed as an instructor to the University of Western Ontario for the year\n1938\n-\n39\n. Following this he was an assistant to\nvon Neumann\nat the Institute for Advanced Study at Princeton in\n1939\n-\n40\n. He then spent three years as an instructor at Johns Hopkins University in Baltimore. It was there that he met Yael Naim, a young mathematics student from Israel. They married in\n1944\nbut the year before this both began working at the Massachusetts Institute of Technology Radiation Laboratory. Dowker also did war work with the United States Air Force, working on the trajectory of projectiles. In carrying out this work he visited Libya and Egypt.\nWhen World war II ended, Dowker was appointed as an associate professor at Tufts. However both Dowker and his wife became increasingly tense as McCarthy's hunt for communists became ever more menacing. Senator Joseph R McCarthy whipped up strong feelings against communism in the United States and several of Dowker's friends began to come under suspicion from the authorities who saw imaginary problems everywhere. He decided that he disliked living in such an atmosphere and looked for positions in England for himself and his wife. He was appointed as Reader in Applied Mathematics at Birkbeck College in London while Yael was appointed to the University of Manchester. Although most of Dowker's work was in topology, his war work set him up well for the applied mathematics post where he continued his research on projectiles.\nDowker was appointed to a personal chair at Birkbeck College in\n1962\n, a post which he held until his retirement in\n1970\n.\nJames\nin\n[\n2\n]\nsummarises his topological work:-\nWhile he is best known for his work in point set topology, he also made contributions to category theory, sheaf theory and the theory of knots. He had a long-standing interest in homology theory for general spaces. Among many other important results he showed that the\nČech\nand\nVietoris\nhomology groups coincide, for general spaces, as do the\nČech\nand\nAlexander\ncohomology groups.\nIn\n1956\nDowker published\nLectures on sheaf theory\nwhich followed the approach which had been adopted by\nHenri Cartan\n. In his review of the work\nAtiyah\nwrites:-\nUnlike the Cartan seminars, however, the exposition does not aim at conciseness. Many parts of the theory are treated in much greater detail, most calculations are given in full, and much standard algebra is developed ab initio. In this respect the work may serve a very useful purpose. Perhaps the most characteristic feature of the lectures is the way each new notion is analysed very carefully, its peculiarities examined on \"bad spaces\", and counter-examples given whenever possible. For example, both fine and locally fine sheaves are defined, and it is shown that they coincide on paracompact normal spaces but not otherwise. There is also a very careful treatment of presheaves as opposed to sheaves. The lectures on coherent sheaves are dealt with in the same analytical spirit, and there is no attempt to go far into the applications to algebraic geometry or complex manifolds.\nIn\n1983\n, the year in which Dowker died after a long illness, he published a joint paper\nClassification of knot projections\nwith Morwen B Thistlethwaite. The authors describe their results as follows:-\nThe first step in tabulating the noncomposite knots with\nn\nn\nn\ncrossings is the tabulation of the nonsingular plane projections of such knots, where two\n(\npiecewise linear\n)\nprojections are regarded as equivalent, or in the same class, if they agree up to homeomorphism of the extended plane, i.e., the two-sphere. This first step is here reduced to a simple algorithm suitable for computer use.\nIn\n[\n4\n]\n(\nor see\n[\n3\n]\n)\nStrauss describes Dowker's character:-\nIn manner Dowker was reserved and gentle, with an innate dignity and a penetrating wit. He possessed a high degree of integrity and moral strength which enabled him to endure seven years of illness uncomplainingly. Although supremely tolerant towards others, he had only the highest standards of behaviour for himself. He was totally without ostentation or pretension and totally disinterested in wealth, honours or managerial power.\nIn\n[\n1\n]\nhe is described as follows:-\nHis mathematical power, combined with his personal modesty and gentle humour ensured him the respect and affection of a generation of students and of colleagues throughout the world.\nThere is another side to Dowker and his wife which we should mention before completing this biography. This is their work with children, particularly with gifted children who were having difficulties at school. They undertook this work for the National Association for Gifted Children. Dowker was able to give these children what any mathematician will recognise as an incredibly wonderful experience, namely the experience of discovering new mathematical results.",
  "matematicos_citados_na_biografia": [
    "Lefschetz",
    "Aleksandrov",
    "Fox",
    "Hurewicz",
    "Steenrod",
    "von Neumann",
    "James",
    "Čech",
    "Vietoris",
    "Alexander",
    "Henri Cartan",
    "Atiyah"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}