{
  "nome_completo": "Ida Rhodes",
  "nome_curto": "Ida Rhodes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rhodes/",
  "data_nascimento": "15 May 1900",
  "local_nascimento": "Kamianets-Podilskyi, Russian Empire (now Ukraine)",
  "data_morte": "1 February 1986",
  "local_morte": "Rockville, Maryland, USA",
  "summary": "Ida Rhodes was born in Ukraine but emigrated to the United States as a teenager. She studied mathematics and had a variety of jobs before joining the Mathematical Tables Project in New York City. She did important work on the development of computers.",
  "biografia": "Ida Rhodes\nwas given the name\nHadassah Itzkowitz\nwhen she was born into a Jewish family in Ukraine. Variations in the spelling of her name are common, as with all transliterations, and one version that Ida gives herself is\nIdasie Itzkowicz\n. Her parents were David Itzkowitz\n(\nborn about\n1876)\nand Bessie Sinkler\n(\nborn about\n1880)\n. She began her education in Ukraine and, despite the difficult environment, her young years were happy ones since she had a countess for a friend\n[\n6\n]\n:-\n[\nThe countess\n]\nwas a great naturalist and set up a school for the poor of the area. She was very kind and wanted to adopt me. I said that was impossible, that I already had a family. Nevertheless she often had me as a house guest and arranged for the finest of kosher food for me. She took me riding and showed me plants and explained what I could expect of the plants' development by the next time we visited. There was an island we visited in one of her parks where the swans nested. The lady was careful to instruct me never to touch the swan eggs or the mother would disown them.\nIda may have had some happy times but Ukraine was not a good place for those with a Jewish background, for gangs of men would patrol the streets looking for Jews to beat up.\nIn\n1913\nher parents emigrated to the United States and, on entering that country, she adopted the name Ida Itzkowitz. We note at this point that many details about Ida given in all the biographies we have seen are wrong. The facts we give below which contradict those given in the biographies in the references have been verified from official documents\n(\nDeclaration of Intention, Petition for Citizenship, World War II Draft Registration Card, Census records, etc.\n)\n. In her Petition for Citizenship, made on\n30\nMarch\n1932\n, she states that she sailed to the United States in December\n1913\n, leaving from Bremen, Germany, on the\nPrinz Friedrich Wilhelm\nand arriving in New York on\n9\nDecember. She gives her last place of residence before emigrating as Odessa, Russia. Her Declaration of Intention, made on\n17\nJune\n1924\n, states that her complexion is fair, she is\n5\nfeet\n2\ninches tall, weighs\n100\nlbs, with blond hair and blue eyes.\nCertainly her friend the countess had a difficult time following the\n1917\nRevolution and she was eventually murdered. Once in the United States, Rhodes attended school and, in\n1919\n, she was awarded the New York State Cash Scholarship and a Cornell University Scholarship to allow her to study mathematics at Cornell University. However, in addition to her undergraduate studies at Cornell, Rhodes also worked as a junior nurse in Ithaca City Hospital. Her standard routine was to attend university classes in the morning and, beginning at\n1\np.m., she would work a twelve hour shift at the Hospital. In other circumstances she may have taken classes in physics and chemistry but since these had afternoon laboratories, she concentrated almost entirely on mathematics which was taught in the mornings. Despite this extraordinarily demanding schedule, Ida\nItzkowitz married Solomon Alhadef Rhodes on\n20\nSeptember\n1922\nin Bronx, New York City. Let us relate a few facts about her husband.\nSolomon Alhadef was born on\n15\nApril\n1895\non the Island of Rhodes, at that time part of Turkey. He sailed from Le Havre, France, on\n5\nOctober\n1913\non the\nLa Savoie\narriving at New York on\n11\nOctober. By the time he left Rhodes the Island had become part of Italy. In the\n1915\nU.S. census he was still calling himself Solomon Alhadef as he was when he completed his World War I Registration Card on\n5\nJune\n1917\n. At this time he gave his address as\n523\nE Buffalo, Ithaca, New York, and gave his occupation as \"student of agriculture\". Answering the question of whether he had anyone solely dependent on him, he stated that he had a \"brother who is incompetent.\" By the time he graduated with a first degree in French and Spanish from Cornell University in\n1921\nhis name is given as Solomon Alhadef Rhodes. He was awarded a Master's Degree in\n1922\nand a Fellowship in Romance Languages at Cornell in\n1923\n. When Ida and Solomon married, he gave his name as Solomon A Rhodes and she gave her name as Ida Itzkowitz. Following her marriage, she took the name Ida Rhodes.\nIda graduated from Cornell with a B.A. with honours in mathematics in February\n1923\nand by autumn of that year, she was awarded a Master's Degree. In\n1923\nshe was living with her husband at\n317\nEddy Street, Ithaca, New York. On\n17\nJune\n1924\nIda and Solomon were living at\n1631\nWashington Avenue, Bronx, New York when each of them made a Declaration of Intention to become a citizen of the United States.\nFrom autumn\n1923\nuntil\n1940\nRhodes worked at a number of different jobs, only one of which required her training as a mathematician. For the first three years, up to\n1926\n, she simply continued working as a nurse. She then became a mathematics teacher in a High School in Houston, Texas, but left this to turn to merchandise control for R H Macy and Co., the famous New York department store. Rhodes then became a partner with her father of his David Itzkowitz Sportswear store undertaking accountancy tasks. While undertaking this work, she studied mathematics at the Graduate School of Columbia University in\n1931\n-\n32\n. One has to understand that this was a particularly difficult period in the United States with the Great Depression beginning in\n1929\nand lasting for around ten years. Unemployment reached\n20\n% in the United States at around the time Rhodes completed her year of graduate study of mathematics at Columbia. It would have been almost impossible for her to get a job as a mathematician at this time. She was friends with several other mathematicians and they would race in their cars to Princeton every weekend where they attended seminars.\nOn\n30\nMarch\n1932\nRhodes completed a Petition for Citizenship. In it she stated that her husband was naturalized on\n10\nFebruary\n1930\nin New York. At the time of her application her husband was living in Paris, France, and she was living with her parents at\n101\nBrightwater Court, Brooklyn, New York. In\n1938\nshe became registrar at the Alpha Business School then moved on to become a clerk at the New York State Labor Department where her work involved statistics. In the\n1940\nCensus, Rhodes was still living with her parents at\n101\nBrightwater Court, Brooklyn. By this time she was divorced and described herself as a Statistician worker in Government work. Only later in\n1940\ndid she join the Mathematical Tables Project in New York City and begin the work for which she became famous. Let us note at this point that Solomon Rhodes remarried, published the book\nGérard de Nerval,\n1808\n-\n1855\n: poet, traveler, dreamer\nin\n1951\n(\nwhich he dedicated to his second wife\n)\n, and died in Dade, Florida, United States, on\n28\nJune\n1978\n.\nThe Mathematical Tables Project began in\n1938\nas a project of the Works Progress Administration which had been set up to provide employment, undertaking public works projects, for the large number of people who were unemployed due to the Great Depression. The Mathematical Tables Project employed around\n450\npreviously unemployed clerks to tabulate higher mathematical functions, in particular exponential functions, logarithms, and trigonometric functions. A number of mathematicians were employed to lead the project, and Rhodes was one of those employed in\n1940\n. We note that three of the mathematicians employed in\n1940\nwere women. The mathematical leader of the project was\nGertude Blanch\nwhile the administrative leader was Arnold Noah Lowan\n(1898\n-\n1962)\nwho, after graduating from Columbia University in physics, had spent a year at the Institute for Advanced Study at Princeton before becoming unemployed. Although the mathematicians employed in\n1940\nto lead the Mathematical Tables Project were all highly trained, none had expertise in numerical analysis which was vital for the project. This training was carried out by\nGertude Blanch\nassisted by experts in numerical analysis from the\nBritish Association for the Advancement of Science\n. In fact the\nBritish Association for the Advancement of Science\nhad met in Edinburgh in\n1871\nand set up a Mathematical Tables Committee. The project published two volumes of mathematical tables prior to\n1928\nwhen a legacy funded the production of five further volumes. At the time that the Mathematical Tables Project was set up in the United States, the British tables were the most accurate in the world.\nThe workers on the Mathematical Tables Project came from the previously unemployed and many had problems caused by being unable to support their families for years while others were physically handicapped. Rhodes had worked as a nurse for many years so she was able to use her nursing skills to help the workers. This meant that Rhodes could not undertake much of her work of consistency checking and other tasks necessary for the project during the day so she worked during the evenings, often alongside\nGertude Blanch\n. Two quite different events had a major impact on the Mathematical Tables Project. The first of these was the result of the United States entering World War II on\n8\nDecember\n1941\n, the day after Japan attacked the U.S. fleet at Pearl Harbour. The result was that the Mathematical Tables Project was taken over by the National Defence Research Council and the workers were required to undertake calculations relating to the war effort. For example they acted as a general computing contractor for the Office of Scientific Research and Development and prepared navigation tables for the U.S. Navy. The Works Progress Administration ended in\n1943\nbut with its new war related role, the Mathematical Tables Project continued in New York until\n1948\n.\nThe second major impact on the Mathematical Tables Project was the development of electronic computers. The National Bureau of Standards sponsored the Mathematical Tables Project and they were involved with the UNIVAC I electronic digital computer. UNIVAC was designed by\nJ Presper Eckert\nand\nJohn Mauchly\nwho had set up the\nEckert\n-\nMauchly\nComputer Corporation and the National Bureau of Standards ordered one of their computers. In July\n1947\nthe National Bureau of Standards set up the National Applied Mathematics Laboratories in Washington. Arnold Lowan asked Rhodes to go to the National Applied Mathematics Laboratories in Washington and learn about the work that the National Bureau of Standards was doing in preparation for receiving the UNIVAC I electronic computer. She went to Washington and spent a week there. Then, feeling that she was not up to the job, she returned to New York and told Lowan that he should never have sent her. However, Logan had received a report from Washington praising Rhodes' first week there so Lowan told her to go back and try again. She returned and spent the rest of her career working for the National Bureau of Standards on programming the early electronic computers.\nThe National Applied Mathematics Laboratories had set up the Machine Development Laboratory and Rhodes spent some time working there, for a short period alongside\nGrace Hopper\n. Later, her skills were such that she was moved into the administration of the National Applied Mathematics Laboratories where she acted both as a consultant and also as an expert to help out in different projects. One of the first UNIVAC I computers was purchased by the Census Bureau and Rhodes used the language C-\n10\nto write the first programs to handle the census data. She also wrote the first programs for the computer used by the Social Security Administration. However, the task for which she is perhaps best remembered today is her pioneering work in developing computer programs to translates one language to another. One language which few Americans spoke was Russian and yet many important papers and articles were written in that language. This, of course, was Rhodes' native tongue so she was particularly well equipped to make the first important steps in computer language translation of Russian to English.\nYou can read two short extracts from Rhodes' papers on the\nAutomatic Translation of Languages\nat\nTHIS LINK\n.\nAnother important aspect of Rhodes' work was giving lectures to private firms and to government agencies on how best to made use of electronic computers in their work. She taught classes on computer programming and was in great demand to lecture on the applications of computers. There was another area of interest for Rhodes, namely using her nursing experience, and in particular this gave her the desire to help disabled people whom she brought into the area of computing. She saw that many people with physical disabilities could, with proper training, become extremely good computer programmers. She, therefore, gave special classes in programming for the deaf, the blind and those with other physical handicaps.\nIn\n1959\nthe U.S. Department of Commerce gave her their Gold Medal for Exceptional Service:-\n... for significant pioneering leadership and outstanding contribution to the scientific programs of the Nation in the functional design and the application of electronic digital computing equipment.\nShe retired from the National Bureau of Standards in\n1964\nbut continued to act as a consultant to the Applied Mathematics Division for seven further years until\n1971\n. In\n1965\n, a year after she retired from the National Bureau of Standards, but while she was still acting as a consultant for them, Ida Rhodes published\nThe Mighty Man-Computer Team;\nsee\nTHIS LINK\n.\nIn\n1976\nthe U.S. Department of Commerce gave her a second award on the\n25\nth anniversary of UNIVAC I going into service. This Certificate of Appreciation was given:-\n... on the occasion of the\n25\nth anniversary of the UNIVAC I in recognition of your services to the Information revolution.\nAfter she retired completely in\n1971\n, Rhodes continued with some of her favourite topics. For example, in collaboration with\nGertrude Blanch\n, she wrote the paper\nTable Making at National Bureau of Standards\n(1974)\n. She used her computational skills to write the paper\nComputation of the Dates of the Hebrew New Year and Passover\n(1977)\n. The content of this paper is precisely that given by its title.\nEric Weiss wrote about Rhodes' last years\n[\n6\n]\n:-\nAs she aged, her heart condition required that she conserve her energy, so she cut back on phone calls and correspondence, finally moving to a nursing home. As reading became more tiring, she comforted herself with the comment that the dimming of her eyes had a compensatory benefit: she couldn't see so many of the wrinkles on her face.",
  "matematicos_citados_na_biografia": [
    "Gertude Blanch",
    "British Association for the Advancement of Science",
    "J Presper Eckert",
    "John Mauchly",
    "Eckert",
    "Mauchly",
    "Grace Hopper",
    "THIS LINK",
    "Gertrude Blanch"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}