{
  "nome_completo": "Israel Gohberg",
  "nome_curto": "Israel Gohberg",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gohberg/",
  "data_nascimento": "23 August 1928",
  "local_nascimento": "Tarutino, Romania (now Tarutyne, Ukraine)",
  "data_morte": "12 October 2009",
  "local_morte": "Kfar Saba, Israel",
  "summary": "Israel Gohberg was a Bessarabian-born mathematician who worked in operator theory and functional analysis.",
  "biografia": "Israel Gohberg\ncame from a Jewish family. He attended school in the newly created Republic of Kirgiz. In\n1926\nthe status of the autonomous Kirgiz oblast had been changed into that of an autonomous republic, and in\n1936\na full union republic had been created, the Kirgiz Soviet Socialist Republic.\nGohberg then entered the College of Education in Frunze. Frunze was named Bishkek up to\n1926\nwhen it became the capital of the Kirgiz Autonomous Soviet Socialist Republic and was named after the revolutionary leader Mikhail Frunze. Today it has been renamed Bishkek. Gohberg's teachers at the College of Education were so impressed with his abilities that persuaded him to move to a university. Thus, after two years at the College in Frunze, he went to the University of Kishinyov, in Kishinyov the capital of Moldova, which had opened in\n1945\n. Today Kishinyov had reverted to its original name of Chisinau.\nAfter graduating from University of Kishinyov, Gohberg went to the University of Leningrad to study for his doctorate which he received in\n1954\n. Then he moved to Moscow University where he received his\nhabilitation\n.\nHe taught at the Teachers' College in Soroki and later at the teacher-training institute in Balti in northern Moldova. Gohberg was appointed to the Academy of Sciences in Kishinyov where, in\n1964\n, he became the Head of\nFunctional Analysis\n. He also held a chair of mathematics at the University of Kishinyov.\nIn\n[\n2\n]\nGohberg describes some of the difficulties encountered by Jews in the Soviet academic world, particularly those he suffered from\n1968\n. In\n[\n2\n]\nhe points out that there were no Jews in the Mathematics section of the\nUSSR Academy of Sciences\nbetween\n1968\nand\n1984\n. By\n1969\nGohberg had made the decision to try to emigrate to Israel but only after great difficulty, and a long wait, did Gohberg and his family obtain the visa necessary for them to leave. After obtaining the visa in\n1974\n, he emigrated to Israel. Once in Israel, he was appointed to a professorship at Tel Aviv University and he also was appointed to the Weizman Institute in Rehovot.\nIn\n1983\nhe was appointed to the Free University\n(\nVrije Universiteit\n)\nof Amsterdam. He has been a visiting professor at many universities such as the University of Calgary in Canada, and College Park Maryland in the United States.\nIn addition to Gohberg's outstanding work in analysis and in particular in operator theory and\nmatrix\nmethods, he founded the major international journal\nIntegral equations\nand operator theory\nin the late\n1980\ns. The journal:-\n... is devoted to the publication of current research in integral equations, operator theory and related topics with emphasis on the linear aspects of the theory.\nGohberg has an amazing publication record with over\n460\npapers listed in\nMathematical Reviews\n. Notice that this is around\n100\nmore than the list given in\n[\n4\n]\nwhich is consistent with his almost unequalled record of averaging\n10\npapers per year. He has supervised\n40\ndoctoral students and exercised an amazing influence on his area.\nIsrael Gohberg had been described as one of the exceptional mathematicians of our time, comparable in his manner perhaps only to\nPaul Erdős\n. Three qualities would appear to account for his unique influence: he is a charismatic and inspirational man who quickly pulls others into his orbit, keeping acolytes motivated for long periods of time; he possesses an uncanny instinct for what is mathematically possible and productive; and he has the talent and stamina to see that his ideas and those of his co-authors are realised, and then communicated through publications to the larger interested audience.\nGohberg has received many awards for his outstanding work including the Alexander von Humboldt Prize in\n1992\nand an honorary degree from the Institute of Technology in Darmstadt in June\n1997\n. His awards prior to\n1988\nare listed in\n[\n3\n]\n.",
  "matematicos_citados_na_biografia": [
    "habilitation",
    "Functional Analysis",
    "USSR Academy of Sciences",
    "matrix",
    "Integral equations",
    "Paul Erdős"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}