{
  "nome_completo": "István Hatvani",
  "nome_curto": "István Hatvani",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hatvani/",
  "data_nascimento": "21 November 1718",
  "local_nascimento": "Rimaszombat, Hungary (now Rimavská Sobota, Slovakia)",
  "data_morte": "16 November 1786",
  "local_morte": "Debrecen, Hungary",
  "summary": "István Hatvani was a Hungarian mathematician who wrote a pioneering work on probability and statistics.",
  "biografia": "István Hatvani\n's health was poor as a child. He was fortunate to make it through the first few years of life and it is interesting to remark at this point that he would later become the first Hungarian to undertake a statistical analysis of infant mortality and to make medical deductions from the data. Hatvani's parents wanted him to become a priest and his initial education was designed with this in mind.\nHatvani attended schools in Rimaszombat which today is named Rimavská Sobota and is in central Slovakia, Losonc which today is named Lucenec and is also in central Slovakia, Kecskemét which is the county town of Bács-Kiskun in central Hungary\n80\nkm southeast of Budapest, and Komárom which lies on the south bank of the Danube across from Komárno in present day Slovakia on the other side. He then went to Debrecen, one of the most important cities in eastern Hungary, to study at the Protestant College there. This College had an excellent reputation and was by Hatvani's time an ancient institution being founded in the middle of the\n16\nth\ncentury.\nIn late\n1738\nan epidemic of the plague swept through Transylvania and reached Debrecen. All who could afford to leave the town did so and most students at the College, including Hatvani, did just this. By the first months of\n1739\nonly thirty students remained at the College, and by this time Hatvani had moved back to Losonc\n(\nLucenec\n)\nwhere he had been at school and there he worked as a tutor. He remained there until\n1741\nwhen, the epidemic having passed, he returned to his studies at the Protestant College of Debrecen. He graduated from the College in\n1745\nand continued his studies abroad at Basel in Switzerland. He was able to undertake foreign studies since he was supported by a scholarship given to him by the town of Debrecen.\nIn Basel Hatvani studied theology and medicine and was awarded a doctorate in both these subjects. Most importantly for his future career, he attended lectures by\nJohann Bernoulli\nand\nDaniel Bernoulli\n. They lectured on mathematics, physics and medicine and under their guidance Hatvani soon gained a reputation as an outstanding scientist. Turning down offers of posts at the University of Heidelberg, at the University of Marburg, and at the University of Leiden, Hatvani returned to the Protestant College of Debrecen in\n1748\nand began his career as a lecturer there.\nIn\n1749\nhe gave his inaugural lecture at College of Debrecen\n[\n3\n]\n:-\nHatvani started his inaugural address by exposing the backwardness of mathematical culture in Hungary and went on to prove how important a role this science played in a whole range of exact sciences. He went so far as to declare that mathematics was the only science whose findings could surely be relied on and whose conclusions were beyond doubt.\nHatvani made his most significant contribution when he published\nIntroductio ad principia philosophicae solidioris\nⓉ\n(\nIntroduction to the principles of solid philosophy\n)\nin\n1757\n. In this work Hatvani described the\ntheory of probability\n, in particular basing his material on\nJacob Bernoulli\n's\nArs conjectandi\nⓉ\n(\nThe art of conjecture\n)\n. Here is a sample question he posed\n(\nsee for example\n[\n3\n]\nor\n[\n4\n]\n)\n:-\nLet us suppose that a commander despatches\n100\ntroops to defend a camp;\n12\nof them are German,\n4\nHungarian and\n84\nCroatian. One of them deserts. Now, I wish to know the probability of the deserter being Hungarian or Croatian.\nIn\n[\n1\n]\nHorváth looks at the\nIntroductio\nseeing that this work makes Hatvani the first Hungarian to present work on statistics. For example Hatvani presents tables for the number of births in Debrecen for the years\n1750\nto\n1753\ninclusive. He records the number of children who died within a year of being born and, finding a mortality rate of\n34\n.\n2\n% which was well above that in other European countries\n(\naround\n19\n%\n)\n, he seeks medical reasons to explain the findings.\nIn fact Hatvani used his medical skills not only in such investigations, but also in caring for the health of the students at the College of Debrecen. Outside the College he used his knowledge of religious matters to support the Protestant Church, and he also was appointed as a judge in the County Court in\n1783\n.",
  "matematicos_citados_na_biografia": [
    "Johann Bernoulli",
    "Daniel Bernoulli",
    "theory of probability",
    "Jacob Bernoulli"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}