{
  "nome_completo": "Ivo Lah",
  "nome_curto": "Ivo Lah",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lah/",
  "data_nascimento": "5 September 1896",
  "local_nascimento": "Strukljeva vas near Cerknica, Austrian Empire (now Slovenia)",
  "data_morte": "23 March 1979",
  "local_morte": "Ljubljana, Yugoslavia (now Slovenia)",
  "summary": "Ivo Lah was a Slovenian mathematician and actuary who worked in both mathematics and statistics.",
  "biografia": "Ivo Lah\nattended elementary school in St. Vid nad Cerknico and in Ljubljana. Later he enrolled in the Klasicna\ngymnasium\nin Ljubljana where he graduated with top marks on December\n12\n,\n1915\n. He spent one at the University of Vienna in\n1918\nand a further seven semesters at the University of Zagreb in the years\n1919\n-\n1922\n. He completed his studies of mathematics and physics in Zagreb on April\n28\n,\n1925\n. At the same time he was studying at the School of Commerce and Traffic in Zagreb with a state exam on March\n3\n,\n1923\n. Before finishing high school Ivo Lah volunteered for the Austro-Hungarian army to defend the western borders of Slovenia. In the years\n1915\n-\n1918\nhe was a Lieutenant in the Austrian army on the front against Italy.\nAfter the end of WWI he served as a volunteer in the Koroska Legion defending and shaping the Slovenian\n(\nand Yugoslav\n)\nnorthern border with Austria. From April\n1\n,\n1921\nuntil June\n31\n,\n1921\nhe was an Assistant for Mathematics at the Forestry Faculty of the University of Zagreb. From September\n26\n,\n1921\nuntil October\n1\n,\n1950\nhe was an employee of the Social Security Foundation in Ljubljana, Zagreb and Belgrade. After that he was employed by the Federal Statistical Office in Belgrade until his retirement on December\n31\n,\n1956\n.\nThe Adriatic Insurance Company\n(\nRiunione Adriatica di Sicurita\n)\nbased in Triest sent him to Vienna in the years\n1927\n-\n1928\nto study personal insurance. As a representative of the Society of Actuaries of the Kingdom of Yugoslavia Ivo Lah attended the International Congress of Actuaries in Rome\n(1934)\nand in Paris\n(1937)\n.\nIn\n1943\nhe was invited to Rome as an Assistant Dean of the Faculty of Statistical, Demographic and Actuarial Sciences where he stayed only a Month due to WWII. From\n1933\nuntil\n1941\nhe was an active member of the Society of Actuaries of Yugoslavia. In the years\n1937\n-\n1941\nhe was the founding editor of the Journal\nGlasnik udruzenja aktuarjev Kraljevine Jugoslavije\n. Due to his scientific publications Ivo Lah became a correspondent of member of several international institutions from Portugal, Switzerland, Belgium, Italy, Germany and France.\nSince\n1932\nwhen Ivo Lah became in charge of Statistics of Social Security in Slovenia he connected his work with studies at the University of Ljubljana. Students were able to prepare Seminars and other projects in Statistics. Based on the Statistics of Social Security several Doctoral Theses were written. Ivo Lah worked in practical Demographics and Statistics. Based on demographic tables he was able to prepare the so-called \"computational bases\" for personal life insurance and retirement insurance of employees.\nHis main work is a trilingual book\nRacunske osnovice zivotnog osiguranja\nⓉ\n(\nBasic life insurance calculation\n)\nwritten in Croatian, Russian and French and published in Zagreb in\n1947\n. Because of a quote in Latin:\nNatura non facit saltus\nⓉ\n(\nNature does not jump\n)\nthe book was proclaimed \"antimarxist\", taken out of circulation and later, in\n1951\n, was mostly destroyed. Ivo Lah was able to save some copies of the book. It is a tragic irony that he was later serving as a member of the Yugoslav delegation negotiating treaties with Italy, Hungary, Austria and West and East Germany. His book\nRacunske osnovice\nⓉ\n(\nBasic computation\n)\nwithstood the criticism of actuaries during the negotiations in Rome, Bonn and Vienna and he was able to get full Social Security compensation for Yugoslavia from these countries. Ivo Lah was a prolific writer and he published several hundred newspaper articles.\nHis scientific bibliography contains about\n120\nitems covering a wide spectrum of topics from Mathematics to Statistics, Demographics, etc. For instance one can find\n10\nitems in\nMaths Reviews\n, and\n19\nitems in\nZentralblatt für Mathematik\n. His most important mathematical result, published in\n1955\n, is the so-called \"Lah identity\" where he shows how the rising powers can be expressed in terms of falling powers. The reviewer of his paper was a leading combinatorialist of that time, John Riordan.\nThe binding coefficients\nL\n(\nn\n,\nk\n)\n=\nn\n!\n(\nn\n−\n1\n)\n!\nk\n!\n(\nk\n−\n1\n)\n!\n(\nn\n−\nk\n)\n!\nL(n, k) = \\Large\\frac{n! (n-1)!}{k!(k-1)!(n-k)!}\nL\n(\nn\n,\nk\n)\n=\nk\n!\n(\nk\n−\n1\n)\n!\n(\nn\n−\nk\n)\n!\nn\n!\n(\nn\n−\n1\n)\n!\n​\nwere called\nunsigned Lah numbers\nby J Riordan in his book\nAn Introduction to Combinatorial Analysis\n(1958)\n. The unsigned Lah numbers\nL\n(\nn\n,\nk\n)\nL(n, k)\nL\n(\nn\n,\nk\n)\nhave an interesting combinatorial interpretation. Namely they count the number of ways to partition a set of\nn\nn\nn\nelements into\nk\nk\nk\nnonempty linear queues.\nAcknowledgement.\nI would like to thank Prof. Marija Lah, the daughter of Ivo Lah for the material that is used in this presentation.",
  "matematicos_citados_na_biografia": [
    "gymnasium"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}