{
  "nome_completo": "Tadeusz Iwaniec",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iwaniec_Tadeusz/",
  "data_nascimento": "9 October 1947",
  "local_nascimento": "Elblag, Poland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Tadeusz Iwaniec is Polish born mathematician who has held positions in the United States since 1983 . He has made outstanding contributions to nonlinear analysis and geometric function theory including applications of the calculus of variations to mathematical models of elasticity theory. He has won many awards including the Wacław Sierpiński Medal in 2009 .",
  "biografia": "Tadeusz Iwaniec\nis a twin. He was born in the city of Elblag in Poland eight hours after his brother\nHenryk Iwaniec\n. Elblag is an industrial city in the north of Poland, near the Baltic coast about\n50\nkm east of Gdańsk. When Tadeusz and\nHenryk\nwere six years old they began their elementary education at a school in Elblag. There was no academic tradition in the family but their parents encouraged their boys to learn. Tadeusz spoke about his early interest in mathematics\n[\n9\n]\n:-\nEven as a child, I told myself that I didn't want to live like everyone else - from morning to afternoon at work, at the machine. I wanted something more.\nAlbert Einstein\ndied just then\n(\nin\n1955)\n, and I really wanted to understand what he actually discovered, how he came to it. The physics teacher told me that there was no chance of that, that I had to learn many things to understand it. I said to myself, why not? I started to be interested in physics and mathematics.\nThe boys continued to study at the Elblag elementary school completing the course there in\n1961\n. Their parents wanted them to have an education that would set them up to have good jobs so, later in\n1961\n, they both entered the Elblag Technical High School. At this school they were taught much about machines and technology but soon both developed a passion for mathematics. In many ways this was a result of mathematics competitions. At first they participated in school competitions, then in competitions at a higher level in Gdańsk. The Gdańsk University of Technology ran a mathematics club and both boys were sent by Aleksander Kociołkowski, director of the Elblag Technical High School, to take part in the Gdańsk club once a month.\nWhen the boys reached the Third Grade at the Elblag Technical High School they began to take part in the Mathematical Olympiad Competitions. They were immediately successful in the Olympiad, both taking part in the International Mathematical Olympiad in\n1965\nand\n1966\n. They both won silver medals in\n1966\n.  As a result of their successes in mathematical competitions they received special treatment from their High School mathematics teacher Andrzej Wendecker.\nHenryk Iwaniec\nsaid he was\n[\n10\n]\n:-\n... a wonderful man and pedagogue. He had a habit that when he took a student to answer, he would put their notebook on the table. When the student gave wrong answers or could not answer at all, he would gradually move the notebook towards the edge of the table until it fell on the floor. It looked quite colourful and dramatic. As far as I remember, my notebook never lay on the floor. After a while, the teacher did not demand anything from me or my brother, we did not even have to do homework. When there was a test, he asked us to leave the room and not to disturb our classmates. Everyone understood this after our successes in the Olympiads. Then we had time to do homework from another subject or prepare for the next lesson, for example Polish.\nThe Iwaniec twins graduated from the Elblag Technical High School in\n1966\nand by that time both knew that they wanted to study mathematics at university. The mathematics taught at the High School was only a small part of what they knew by this time since they had studied more advanced mathematics on their own. They stimulated each other by asking questions and working together trying to solve them. They never competed, but were always supportive of each other. The best university for the boys to study mathematics was Warsaw University but there was a problem. Government regulations required students to study at local universities and Warsaw was certainly far from Elblag. This problem was overcome, however, since winning Olympiads gave them the privilege of choosing where to study, also to enter without taking the entrance examinations. This was a relief since, although the mathematics entrance examination for Warsaw University would have posed no problem, the compulsory Russian language examination would have presented a problem. They were relieved to enter Warsaw University in\n1966\nwithout needing to take these examinations.\nAlthough\nHenryk\nand Tadeusz were equally enthusiastic about mathematics, as the twins had nearly identical interests, they decided that they should specialise in different areas of mathematics. Tadeusz explained\n[\n9\n]\n:-\nWhen we went to university, we promised ourselves that we wouldn't compete with each other, so each of us was to focus on a different field. First, we wanted to sort this out by drawing lots. We decided that each of us would write on a piece of paper what we wanted to be and then we'd see. Of course, it turned out that\nHenryk\nand I both wrote that we wanted to be mathematicians.\nHenryk\nwanted to work in number theory from the beginning, while I was more interested in the practical application of mathematics. Although at first I was interested in logic.\nThis early interest in logic came through his professor of set theory,\nAndrzej Mostowski\n, a student of\nAlfred Tarski\n.\nIn\n1971\nTadeusz Iwaniec graduated with a Master's Degree from the University of Warsaw; the degree was awarded \"with Distinction.\" He then continued to study at the University of Warsaw for his Ph.D. advised by\nBogdan Bojarski\nat the\nPolish Academy of Sciences\n.\nBogdan Bojarski\n(1931\n-\n2018)\nhad been born in Błaszki, Poland. At the age of\n20\n, he received his Master's Degree from the University of Lodz in Poland; then he was sent to study at Moscow State University, where\nKolmogorov\n,\nMenshov\nand\nSobolev\nprofoundly influenced him. He produced many outstanding results on singular integral equations, equations of mathematical physics and real analysis. In\n1974\nBogdan Bojarski\nand Tadeusz Iwaniec published the two joint papers,\nQuasiconformal mappings and non-linear elliptic equations in two variables\nI, II. The authors give the following summary\n[\n26\n]\n:-\nThe authors discuss geometric properties of systems of nonlinear elliptic equations that were introduced by\nM A Lavrentev\n. The main ideas are outlined. Detailed proofs will be published elsewhere. It is shown that one part of\nLavrentev\n's definition of strong ellipticity can be derived from the assumption that the system can be solved\n(\nglobally\n)\nfor two of the eight variables. A corollary of the main result is that strong ellipticity is invariant under smooth diffeomorphisms. The strongly elliptic system is shown to be essentially equivalent to a non-linear equation of\nBeltrami\ntype that induces a quasiconformal one-to-one mapping with uniformly bounded dilatation.\nA mapping theorem, the analogue of\nRiemann\n's conformal mapping theorem, for solutions of strongly elliptic systems was discussed by\nLavrentev\nunder the title \"the general problem of the theory of quasiconformal mappings\". The present authors extend this result under less restrictive assumptions. The nonlinear\nBeltrami\nsystem is transformed into a nonlinear integral equation. The methods indicated for the solution of the integral equation include the\nSchauder\nfixed point theorem, the\nCalderón\n-\nZygmund\ntheorem on singular integral operators and various a priori estimates of the theory of quasiconformal mappings\n.\nIwaniec continued to work at the University of Warsaw and, in\n1979\n, he was awarded his habilitation. In\n1980\nhe received the Award of the President of the\nPolish Academy of Sciences\nand, in the following year he became an Associate Professor in the\nPolish Academy of Sciences\n. In addition to his other duties, Iwaniec served as coach of the Polish team in the International Mathematical Olympiads.\nIn his work with\nBogdan Bojarski\nhe had produced important work which was described in the paper\nTopics in quasiconformal theory in several variables\nin the\nProceedings\nof the First Finnish-Polish Summer School in Complex Analysis at Podlesice in\n1977\n, and in the lecture\nSome new concepts in the analytical theory of QC-maps in\nR\nn\n,\nn\n≥\n3\n\\mathbb{R}^{n}, n ≥ 3\nR\nn\n,\nn\n≥\n3\n, and differential geometry\ngiven at the Conference on Global Analysis held in Garwitz, DDR in October\n1981\n. Their work on quasiconformal mappings was presented in the major paper\nAnalytical foundations of the theory of quasiconformal mappings in\nR\nn\n\\mathbb{R}^{n}\nR\nn\npublished in\nAnnales Academire Scientiarum Fennicae\nin\n1983\n.\nIn August\n1983\nthe International Congress of Mathematicians took place in Warsaw. In fact this conference had been scheduled for August\n1982\nbut after martial law was introduced in Poland when the government took action against the main opposition movement, the\n1982\nCongress was postponed to\n1983\n. Iwaniec was an invited speaker in the Partial Differential Equations Section of the Congress and delivered the lecture\nSome aspects of partial differential equations and quasiregular mappings\n. The lecture was published in the\nProceedings\nof the Congress and it begins as follows:-\nThis article grew out of my dual interest in partial differential equations and quasiconformal mappings. It can be considered as complementary to the lecture of Jussi Väisälä at the Helsinki Congress where direct geometric methods of quasiregular theory were stressed. As a whole, quasiconformal theory develops into a branch of geometric multidimensional analysis with rather broad connections.\nHe had already accepted an offer from Fred Gehring to spend the year\n1983\n-\n84\nin the United States as a Visiting Professor at the University of Michigan in Ann Arbor. He explained in the interview\n[\n9\n]\n:-\nThere is no point in hiding the fact that I went for the money. At that time, my salary as an assistant professor in Poland was\n12\ndollars a month.\nIt was mathematically productive, however, and he worked with University of Michigan professor Craig Nolder and they co-authored the paper\nHardy-Littlewood inequality for quasiregular mappings in certain domains in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n. The authors write:-\nWe express our gratitude to Professor F W Gehring for his constant guidance, insight, and encouragement while we were working on this paper.\nIwaniec later co-authored a paper with Frederick W Gehring.\nWhile Tadeusz Iwaniec was in Ann Arbor, in April\n1984\nhis brother\nHenryk\narrived there.\nHenryk Iwaniec\nhad also left Poland in\n1983\nand, after a visit to the Institute for Advanced Study in Princeton, he arrived in Ann Arbor to spend a semester at the University of Michigan. At this time, both brothers were planning to return to Poland after a short time in the United States and both certainly had no intention of emigrating to the United States. Tadeusz Iwaniec was tempted to stay longer than one year, however, when he received tempting offers. The first was from the University of Texas in Austin offering him the position of Visiting Professor for the year\n1984\n-\n85\n. He felt that a second year in the United States would be good and he contacted the\nPolish Academy of Sciences\nrequesting that his leave be extended to a second year; his request was granted.\nWhile he was at the University of Texas, he received an offer to spend the year\n1985\n-\n86\nat the\nCourant\nInstitute in New York. This was an exceptionally attractive offer since the\nCourant\nInstitute was famed as one of the top research establishments for the study of differential equations. The invitation had come from\nLouis Nirenberg\nwho had been at the\nCourant\nInstitute for his whole career and had been awarded the Crafoord Prize by the\nRoyal Swedish Academy of Sciences\nin\n1982\nfor his work on non-linear partial differential equations. Iwaniec made a request to the\nPolish Academy of Sciences\nthat he be allowed to stay for this further year at the\nCourant\nInstitute but his request was refused. He then had to make a choice, either resign his position in Poland and spend a year at the\nCourant\nInstitute or return to Poland and lose what he felt was a once-in-a-lifetime opportunity.\nLouis Nirenberg\nsaid to him, \"you have no choice, you have to stay here, because people who have a choice are unhappy.\" Iwaniec decided\nNirenberg\nwas right and he had no choice, so he took up the offer of a year at the\nCourant\nInstitute.\nIn\n1987\nIwaniec published the paper\nHilbert transform in the complex plane and area inequalities for certain quadratic differentials\nin which he gives the following acknowledgement:-\nI wish to express my sincere thanks to the members of the\nCourant\nInstitute, especially to Professor\nLouis Nirenberg\n, for generous hospitality during the time when this research was done.\nAfter his year at the\nCourant\nInstitute, in\n1986\nIwaniec was appointed as a Professor of Mathematics at Syracuse University in New York State. This was a full professorship, a tenured position. He has continued to work at Syracuse University but also has very strong connections with the University of Naples, Italy and with the University of Helsinki, Finland. Before looking at these connections in more detail, let us note that Iwaniec was made John Raymond French Distinguished Professor of Mathematics at Syracuse University in\n1996\n; a position he continued to hold.\nIn\n1990\nIwaniec was invited to Naples by Carlo Sbordone who was the Professor of Mathematical Analysis at the University of Naples. The University of Naples awarded Iwaniec an honorary degree in\n2017\nwhen it was noted\n[\n6\n]\n:-\nEvery year since\n1990\n, he has spent several weeks at the University of Naples conducting research; co-authoring articles; and mentoring junior faculty, postdoctoral scholars and graduate students.\nAs of March\n2025\n, he has co-authored\n15\nresearch papers with Carlo Sbordone, whom he first met at a conference in Rome in\n1974\n. For example, in\n1995\nthe four-author paper\nDegree formulas for maps with nonintegrable Jacobian\nwas published. The authors are Luigi Greco\n(\nNaples\n)\n, Tadeusz Iwaniec\n(\nSyracuse\n)\n, Carlo Sbordone\n(\nNaples\n)\nand Bianca Stroffolini\n(\nNaples\n)\nand they begin the paper by writing:-\nThis paper arose from a discussion sparked between the authors after the lecture of\nLouis Nirenberg\nat the Conference in Naples on\n1\nJune\n1995\n.\nBoth Greco and Stroffolini were students who were co-advised for their Ph.D. by Iwaniec, and were awarded their degrees in\n1993\nand\n1994\nrespectively. We should note that the link between Naples and Syracuse worked both ways. Carlo Sbordone was a Visiting Professor at the Department of Mathematics of Syracuse University in September\n1992\nand again in September\n1996\n. More than a dozen students from Naples went to Syracuse University to study supported by the National Science Foundation. For more details of this link between the two, see the report of Iwaniec's honorary degree from Naples at\nTHIS LINK\n.\nThe other major collaboration for Iwaniec was with colleagues and universities in Finland, especially with the University of Helsinki. In August\n1998\nhe gave the course\nNonlinear differential forms\nat an International Summer School in Jyväskylä, Finland. He began collaborating with Kari Astala, their first joint publication being in\n2000\n, and, by March\n2025\n, MathSciNet lists\n12\njoint Astala-Iwaniec publications all of which have additional co-authors. Astala, born in Helsinki in\n1953\n, had been awarded a Ph.D. by the University of Helsinki in\n1980\nfor his thesis\nOn measures of compactness and ideal variations in Banach spaces\nand held professorial positions at the University of Jyväskylä, the University of Helsinki, the\nFinnish Academy of Science and Letters\n, and Aalto University. Iwaniec's collaboration with Finnish researchers led to him being awarded the degree Philosophiae Doctor Honoris Causa from the University of Helsinki in\n2007\n. In\n2006\nthe\nFinnish Academy of Science and Letters\nand the Finnish Funding Agency for Innovation started FiDiPro, the Finland Distinguished Professor Programme, to provide funding to attract leading foreign researchers to work in Finland. In\n2009\nIwaniec was invited to participate in the FiDiPro Programme by the University of Helsinki and the\nFinnish Academy of Science and Letters\n. He spent the next six years dividing his time between the University of Helsinki and Syracuse University. Let us quote from\n[\n8\n]\nregarding some of Iwaniec's activities in the FiDiPro Programme:-\nIn Finland, Iwaniec worked on several different projects related to mathematical analysis. One of them involved Kari Astala, István Prause and Eero Saksman, all prominent professors at the University of Helsinki. Their studies revolved around an age-old problem concerning the\nBeurling\nTransform, an integral part of complex analysis and geometric function theory. Saksman, an expert in probabilistic methods in analysis, considers Iwaniec a fount of knowledge. \"Tadeusz is always coming up with new ideas, which he scrutinises for hours - sometimes in the middle of the night - before writing them down,\" he says, adding that Iwaniec leaves \"no stone unturned. This makes working with him a pleasure. Ph.D. students and postdocs, in particular, marvel at how nice and approachable he is.\" Prause echoes these sentiments, adding that Iwaniec, an avowed college basketball fan, is no shrinking violet. \"Tadeusz always brought a bit of March Madness to Finland,\" says Prause, who specialises in harmonic analysis. \"We'd often argue at lunch about crucial plays involving the Syracuse University\n[\nmen's basketball\n]\nteam. It was fun seeing that side of him.\"\nAnother project of Iwaniec's took place at the Finnish Centre of Excellence in Inverse Problems Research. It was there that he interacted with a team of experts on Electrical Impedance Tomography\n(\nEIT\n)\n, a non-invasive imaging technique that helps doctors visualise human organs and body parts, in hopes of better understanding their physiological and anatomical make-up. Iwaniec, who is fluent in the mathematics involving EIT, compares the technique to an electromagnetic wormhole - sort of an invisible tunnel between two points in space. \"EIT allows us to infer parts of the body, using surface electrical measurements,\" he says, drawing comparisons to the \"invisibility cloak\" and other metamaterial devices. \"EIT has major implications for the clinical diagnosis of illness and disease. It's very exciting.\"\nWe mentioned above Iwaniec's International Summer School Course in Jyväskylä. He wrote this up as a book with the title\nNonlinear differential forms.\nYou can see details of this book and three other books by Iwaniec, one of which is co-authored with Kari Astala, at\nTHIS LINK\n.\nTadeusz Iwaniec has been awarded many prizes for his outstanding contributions. We mentioned above the Award of the President of the\nPolish Academy of Sciences\nin\n1980\nand honorary degrees from the University of Helsinki in\n2007\nand from the University of Naples in\n2017\n. He had also received the Alfred Jurzykowski Award in\n1997\n, the Prix L'Institut\nHenri Poincaré\n/Gauthier-Villars in\n2001\n, the William Wasserstrom Prize for Outstanding Graduate Teaching in\n2002\n, the Polish Scholarship Fund's Pole of the Year in\n2003\n, the Syracuse\nUniversity Chancellor's Citation in\n2008\n, and the\nWacław Sierpiński\nMedal in\n2009\n. You can see more details of these awards at\nTHIS LINK\n.\nIwaniec has been a foreign member of the Accademia delle scienze fisiche e matematiche di Napoli\n(\nsince\n1998)\n, the\nPolish Academy of Sciences\n(\nsince\n2005)\n, and the\nFinnish Academy of Sciences\n(\nsince\n2012)\n. He also has the impressive record of holding National Science Foundation research grants continuously from\n1988\nto\n2006\n.\nIwaniec is married to Grazyna who has a Ph.D. in mathematics. Their daughter Krystyna Iwaniec attended Nottingham High School in Syracuse, graduating in\n1991\n.\nLet us end with two quotations by Iwaniec, the first from the\n2019\ninterview\n[\n16\n]\n:-\nToday I deal with the application of the calculus of variations to mathematical models of the theory of elasticity.\nStanisław Zaremba\n's method is the basis for proofs of the existence of so-called hyperelastic mappings or deformations, i.e. transformations with the lowest energy. Using the method of the calculus of variations we can predict where cracks will occur in elastic materials and how these cracks propagate in these materials. These phenomena are a strong motivation, not only in theoretical mathematics, but also in engineering research. In mathematics there is no end to new questions, which are in effect the key to progress in theoretical science and in applications ...\nThe second quotation is from\n[\n13\n]\n:-\nMathematicians, like me, have the privilege to enjoy the ingenious ideas and splendid theories imagined and brilliantly developed by previous mathematicians. Their beauty inspires us to ask questions to create our own little theory with grace and prospective applications. And there is never an end to new questions, which in effect is the key to advances in mathematics. But advances come after hours and hours of intense work, trapping and holding our attention for years. This can be a dream, sometimes immense pleasure, sometimes a breath-taking moment when we spot the underlying ideas that are actually relevant to our aspirations. Genuine mathematics does not abide in complexity but, contrary to what one might think, somewhere in the unlimited beauty of applications of sophisticated ideas.",
  "matematicos_citados_na_biografia": [
    "Henryk Iwaniec",
    "Henryk",
    "Albert Einstein",
    "Andrzej Mostowski",
    "Alfred Tarski",
    "Bogdan Bojarski",
    "Polish Academy of Sciences",
    "Kolmogorov",
    "Menshov",
    "Sobolev",
    "M A Lavrentev",
    "Lavrentev",
    "Beltrami",
    "Riemann",
    "Schauder",
    "Calderón",
    "Zygmund",
    "Courant",
    "Louis Nirenberg",
    "Royal Swedish Academy of Sciences",
    "Nirenberg",
    "THIS LINK",
    "Finnish Academy of Science and Letters",
    "Beurling",
    "Henri Poincaré",
    "Wacław Sierpiński",
    "Finnish Academy of Sciences",
    "Stanisław Zaremba"
  ],
  "imagens": [
    "iwaniec_tadeusz.jpg"
  ]
}