{
  "nome_completo": "James Alexander Green",
  "nome_curto": "J A Green",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Green_Sandy/",
  "data_nascimento": "26 February 1926",
  "local_nascimento": "Rochester, New York, USA",
  "data_morte": "7 April 2014",
  "local_morte": "Botley, Oxford, England",
  "summary": "Sandy Green was an American born British mathematician who worked in finite groups and representation theory.",
  "biografia": "J A Green\nis known as\nSandy Green\nto almost everyone in the world of mathematics. His father was Frederick Charles Green and his mother was Mary Balairdie Gilchrist. Frederick Green, only son of James Green and Jessie Isobel Mathieson, had been born in Aberdeen in Scotland in\n1891\nand, after being educated at Harris Academy in Dundee, obtained his MA from the University of St Andrews. He met Mary, from Dundee in Scotland, while studying at St Andrews; she was also an undergraduate and later went on to publish translations of French novels by authors such as Zola. Frederick continued his education in Paris and Cologne and married Mary in\n1916\n. Frederick and Mary Green lived in Canada from\n1921\nto\n1925\nwhen Frederick taught French literature at the University of Manitoba, then went to Rochester, New York, where Frederick worked at the University of Rochester. Sandy was born while the family lived in New York but, shortly afterwards, the family moved to Toronto when Frederick was appointed to the University there. They lived in Toronto, where Sandy began his schooling in\n1930\nat Bedford Park School, until\n1935\nwhen Frederick was appointed Drapers Professor of French at the University of Cambridge in England. Sandy was one of his parents' four children, having a younger brother Christopher\n(\nwho also went on to become a mathematician\n)\nand two sisters Dorothy and Isobel\n(\na fifth child, Francis, died when aged less than two\n)\n.\nIt was in Cambridge that Sandy's secondary schooling took place. After one year,\n1935\n-\n36\n, at Preparatory to Perse School in Cambridge, Sandy was a foundation scholar at Perse School from\n1936\nto\n1942\n. He wrote\n[\n5\n]\n:-\nThis school was very good, with a particularly strong science department.\nHe developed a great interest for science and, since his father was a professor, he\n[\n1\n]\n:-\n... always expected to have an academic career.\nHowever, his favourite subject at school was chemistry, so he applied to the University of St Andrews to study that subject. In choosing St Andrews for his undergraduate studies, he was following in his father's footsteps. However\n[\n1\n]\n:-\n... by the time I arrived at university I had decided that mathematics was my true vocation. Fortunately there was no difficulty in changing my course because the curriculum in the Scottish universities is quite flexible.\nWhen Green began his studies at St Andrews, supported by a prestigious Harkness scholarship, he was only sixteen years old so he was too young to serve in the armed forces although World War II had by this time been taking place for three years. His father, Frederick Green, had served in World War I so had been mobilised as a Captain in September\n1939\nat the beginning of the war. Frederick was released in\n1940\nbut reposted for special duty in\n1942\nwhen he served as a Major. Sandy spent two years as an undergraduate at St Andrews, taking courses on Mathematics, Physics, Chemistry, and Astronomy, graduating with a B.Sc. in\n1944\n. Then later that year, when he was eighteen years old, he put his university career on hold when he went to Bletchley Park to undertake war work\n[\n1\n]\n:-\n... I arrived in August\n1944\n, and the war in Europe was in its final phase. By that time\nM H A Newman\n's plan to use specially designed electronic computers to assist in the decipherment of the \"Fish\" series of coded messages was well advanced. I was one of a number of new recruits to\nNewman\n's section\n(\nwhich was called the Newmanry\"\n)\n, and our main task was to operate these \"Colossus\" computers, using well-established routines.\nIt was at Bletchley Park that Green first met Margaret Lord, daughter of Herbert and Elizabeth E Lord, whom he eventually married on\n2\nAugust\n1950\nat Girton, Cambridge. She was in the Women's branch of the Royal Navy and had been posted to Bletchley. Sandy and Margaret Green had three children: Jane Margaret Green\n(\nwho became an epidemiologist working at the Cancer Epidemiology Unit at Oxford University\n)\n, Sally Ann Green\n(\nwho became a senior administrator at the University of Sheffield\n)\n, and Alastair James Green\n(\nwho became a computer scientist working as Chief Technology Officer of a software company and later as a technology director in a bank in London\n)\n. Green spent the year\n1944\n-\n45\nat Bletchley Park, then spent the following year at the Royal Aircraft Establishment at Farnborough.\nIn\n1946\n, after doing some school teaching, Green returned to the University of St Andrews to complete his first degree. Among his lecturers at St Andrews were\nHerbert Turnbull\n,\nDan Rutherford\nand\nWalter Ledermann\n. After one year of study he graduated B.Sc. with First Class Honours in Mathematics in\n1947\nhaving taken the compulsory courses of Geometry, Algebra, Analysis, Statics, Dynamics and the optional courses of Special Functions, and Algebra in his final year of study. My\n[\nEFR\n]\nfather-in-law,\nT B Slebarski\n, who graduated with an M.A. in Mathematics and Astronomy from St Andrews, was in the same class as Sandy Green. He took the first three of these compulsory mathematics courses and the Special Functions optional mathematics course. He often told me what a brilliant undergraduate his fellow student Sandy Green was.\nGreen then went to St John's College, University of Cambridge, to undertake research. He wrote\n[\n5\n]\n:-\nAt Cambridge I was much impressed by lectures given by the algebraist\nPhilip Hall\n; and in a different way by\nD E Littlewood\n.\nHe had three Ph.D. thesis advisors in succession,\nDudley Ernest Littlewood\n,\nPhilip Hall\nand\nDavid Rees\n, and, after submitting his thesis\nAbstract Algebra and Semigroups\n, Green was awarded a Ph.D. in\n1951\n.\n[\nSandy's brother Christopher D Green graduated with a B.Sc. in Applied Mathematics from St Andrews in\n1951\n.\n]\nIn his thesis Green introduced fundamental relations in a semigroup when he defined what today are called \"Green's relations\". These five equivalence relations partition elements in terms of the principal ideals that they generate. He published a paper based on his thesis\nOn the structure of semigroups\nin the\nAnnals of Mathematics\nin\n1951\nwhere properties of Green's relations were developed. In\n1952\nhe published another fundamental paper on semigroups, this time jointly with\nDavid Rees\n(\nwhom he had first got to know at Bletchley Park\n)\n,\nOn semi-groups in which x\nr\n= x\n. In this paper the authors prove that\nn\nn\nn\n-generator semigroups in which every elements satisfies\nx\nr\n=\nx\nx^{r} = x\nx\nr\n=\nx\nare finite if and only if the corresponding\nBurnside\ngroups\nB\n(\nn\n,\nr\n−\n1\n)\nB(n, r - 1)\nB\n(\nn\n,\nr\n−\n1\n)\nare finite for all\nn\nn\nn\n. Green published two further papers in\n1952\n. One was\nA duality in abstract algebra\nin which he investigated universal algebras dual to free algebras\n(\nwhere dual means inverting the direction of each homomorphism, inverting the order of all products of homomorphisms and replacing onto homomorphisms by into isomorphisms\n)\n. The second was\nOn groups with odd prime-power exponent\nrelated to an investigation of\nBurnside\ngroups.\nGreen had already started his first job by the time he was awarded his doctorate, for in\n1950\nhe was appointed to the University of Manchester. At Manchester, Green's professor was\nMax Newman\nwhom he had worked under at Bletchley Park some eight years earlier. He also became a colleague of\nB H Neumann\nwho had similar algebraic interests as Green. It was Tim Wall, however, whose suggestion set Green off on a new line of research\n[\n1\n]\n:-\nMy first teaching appointment was at Manchester, and there I learnt from G E Wall\n(\nwhom I already knew as fellow-student at Cambridge\n)\nabout the work of\nRichard Brauer\non modular representations. Although I did not meet\nBrauer\nuntil\n1961\n, I have always regarded him as one of my teachers.\nIn\n1955\nGreen published\nThe characters of the finite general linear groups\nin the\nTransactions\nof the\nAmerican Mathematical Society\n. In the citation for the Senior Berwick Prize which Green was awarded by the\nLondon Mathematical Society\nin\n1984\nthe work of this paper is highlighted:-\nHis remarkable treatment of the irreducible characters of the general linear groups published in\n1955\nwas the guiding light to the subsequent development of the\nrepresentation theory\nof reductive algebraic groups over a finite field. In this paper, Green combined with great ingenuity the\nFrobenius\nmethod of inducing characters of subgroups and\nBrauer\n's theory of modular representations with deep combinatorics to construct the irreducible characters. He introduced certain polynomials, now called Green polynomials, which were crucial ingredients in the combinatorics and whose generalisation to algebraic groups has been of fundamental importance.\nIt is also highlighted in the citation for the\nDe Morgan\nMedal which Green received from the\nLondon Mathematical Society\nin\n2001\n:-\nIn a\n1955\npaper Green startled the world of representation theory by giving the complex character table of GL\n(\nn, q\n)\nin all generality. This was completely unexpected in view of the very partial information available prior to his work. It was not until almost twenty years after this seminal achievement that the work of\nDeligne\nand\nLusztig\nfully extended it to the general finite group of\nLie\ntype.\nIn\n1963\nGreen was appointed as a Reader at the University of Sussex. He was only there for two years but during this time he published perhaps his best-known work\nA transfer theorem for modular representations\n(1964)\npublished in the first volume of the\nJournal of Algebra\n. It made a major contribution to the modular representation theory of finite groups and established the now fundamental \"Green correspondence\". In contrast to Brauer's earlier character theoretic approach, Green placed the emphasis on the underlying modules which is the approach prevalent today\n[\n2\n]\n:-\nIn his work on the modular representations of finite groups he introduced a new point of view which emphasised the study of the modules in contrast with\nR Brauer\n's earlier development in terms of characters. He introduced the concepts of the vertex and the source of an indecomposable module which have been increasingly important in applications. A correspondence, called the Green correspondence, between indecomposable modules for a group and those of its subgroups, has also proved to be exceedingly useful.\nAgain this important paper is mentioned in\n[\n3\n]\n:-\nThis provided the platform on which Dade gave a complete determination of the structure of blocks with cyclic defect group, and led to Green's own development of an axiomatic representation theory and to the categorical representation theory that has been at the centre of much of the most recent activity in this area.\nThe reason why Green's stay at Sussex was a relatively short one was that, when the University of Warwick opened in\n1965\n, he was one of a number of outstanding mathematicians attracted there by\nChristopher Zeeman\n. I\n[\nEFR\n]\nwas fortunate enough to attend an M.Sc. course given by Sandy Green in\n1966\nat Warwick on 'Representations of groups'. It was an excellent course, one of several outstanding courses I took there including those by Roger Carter on \"Group Theory\" and David Epstein on \"Homological Algebra\". The first year Warwick operated there was a \"Topology year\" and during that year preparations were made for the next year which was a \"Group Theory year\". Sadly, however, Sandy Green saw little of that year since he suffered a major stroke and took quite a while to regain his health\n[\n4\n]\n:-\n... he realised he had to look after himself and rest when necessary, and he had immense support from his wife.\nOnce he had recovered sufficiently so that he could prepare to work again, he read\nNathan Jacobson\n's\nLie Algebras\nin order to get himself back up to pace. His research continued to produce results of great importance and also of great beauty. He changed direction somewhat in the mid\n1970\ns\n[\n3\n]\n:-\nAfter\n1975\nthe emphasis of his work changed to algebraic groups and his\n1981\nSpringer volume on polynomial representations of general linear groups where he exploited the\nSchur\nalgebra has been enormously influential. More recently, he has made substantial contributions to the study of representations of quantum groups via a relationship with the\nHall\nalgebras that he had studied earlier in his\n1955\npaper.\nGreen remained at the University of Warwick until\n1991\nwhen he retired and was made Professor Emeritus. In the\n1998\ninterview\n[\n1\n]\nhe spoke about retirement:-\nI remember being surprised that when\nPhilip Hall\nretired, he stopped doing mathematics - he said he wanted to pursue his interests in history. In my case I have had no doubts that I want to go on doing mathematics, and being a part of the international mathematical scene, as long as possible. Sometimes I am surprised that I am so busy in retirement. But I should not be surprised; this happens because I wish it to be so. It is important to me to keep in contact with other mathematicians, and so I go to more meetings now than I did when I was teaching. I am still very interested in the development of mathematics.\nWe have mentioned above the award of the Senior Berwick Prize\n(1984)\nand the\nDe Morgan\nMedal\n(2001)\nto Green. The award of the Medal is described as follows:-\nThe\nDe Morgan\nMedal for\n2001\nwas awarded to Professor J A\n(\nSandy\n)\nGreen, Emeritus Professor of the University of Warwick; however, owing to illness he was unable to receive the award at the Annual General Meeting on\n23\nNovember\n2001\n. With the active co-operation of the Mathematical Institute of the University of Oxford, it was arranged to present the award at a short LMS Meeting before the Institute's regular Colloquium on Friday,\n15\nNovember\n2002\n. Thus the President of the LMS made the presentation to Sandy Green after reading the citation for the award, which had appeared in the LMS Newsletter for July\n2001\n. Happily, several members of Sandy's family were present, including Mrs Margaret Green, one son, two daughters and one granddaughter; Sandy's son\n(\nAlistair\n)\nacted as family photographer!\nWhile mentioning the honours given to Green, we should record that he was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1968\n, and a fellow of the\nRoyal Society of London\nin\n1987\n. As another little personal note, let me\n[\nEFR\n]\nsay how delighted I was to be congratulated by Sandy when I myself was elected to the\nRoyal Society of Edinburgh\nin\n1997\n.\nLet us mention Sandy's little book\nSequences and series\n(1958)\nwhose aim is stated in the Preface:-\nThis book is intended primarily for students of science and engineering ... More emphasis is laid on the illustration of basic ideas by numerical examples, than on formal proofs.\nYou can see the whole of this preface at\nTHIS LINK\n.\nOne of Sandy Green's achievements was his outstanding role as a Ph.D. supervisor. Many of his students have done an impressive job been carrying on his legacy.\nWe list some of these students at\nTHIS LINK\n.\nWhen asked to give his views on educations, Green made the following response\n[\n5\n]\n:-\nI think that mathematical education in British universities, though generally very good, should contain more\n(\ncompulsory\n)\ntheoretical physics. Physics has stimulated the development of much pure mathematics in the past, and in recent years mathematics has again been closely involved in great advancements in theoretical physics. Some of the best recent research in these fields has been done by mathematicians from the former Soviet Union, where it seems that mathematicians learn much more theoretical physics in their undergraduate and postgraduate courses than they would here.\nWe also mention the lectures given by Sandy Green at Groups St Andrews\n1989\nwhen he was a main speaker giving a series of lectures on\nSchur algebras and general linear groups\n. The Proceedings contains a beautiful account of these lectures. Other published lectures include\nClassical invariants\nand\nClassical groups\nboth delivered at the University of Coimbra in\n1993\n, and\nHall algebras and quantum groups\ndelivered at the University of Coimbra in March\n1994\n. In\n[\n3\n]\nGreen's outstanding achievements are summarised as follows:-\nIt is internationally agreed that Green is one of those who have most shaped modern representation theory, and he enjoys widespread respect and affection.\nOutside mathematics and his family, Green had a number of interests such as gardening, but the most important was his passion for French literature of\n16\nth\nto the\n20\nth\ncenturies. The author of\n[\n4\n]\nwrites:-\nAbove all, Green should be described as a \"gentle man\". His voice was never raised; logic and clarity sufficed. His lectures were a model of elegance and precision, with a delivery reminiscent of\nBrauer\n's. But while he was a mathematician first, he was never aggressively so, and maintained a balance of interests, whether French literature, gardening or his family, and he brought the same degree of interest and care to all those whom he met professionally, whether faculty or students.",
  "matematicos_citados_na_biografia": [
    "M H A Newman",
    "Newman",
    "Herbert Turnbull",
    "Dan Rutherford",
    "Walter Ledermann",
    "T B Slebarski",
    "Philip Hall",
    "D E Littlewood",
    "Dudley Ernest Littlewood",
    "David Rees",
    "Burnside",
    "Max Newman",
    "B H Neumann",
    "Richard Brauer",
    "Brauer",
    "American Mathematical Society",
    "London Mathematical Society",
    "representation theory",
    "Frobenius",
    "De Morgan",
    "Deligne",
    "Lusztig",
    "Lie",
    "R Brauer",
    "Christopher Zeeman",
    "Nathan Jacobson",
    "Schur",
    "Hall",
    "Royal Society of Edinburgh",
    "Royal Society of London",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}