{
  "nome_completo": "Johan Jacob Seidel",
  "nome_curto": "Jaap Seidel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Seidel_Jaap/",
  "data_nascimento": "19 August 1919",
  "local_nascimento": "The Hague, The Netherlands",
  "data_morte": "8 May 2001",
  "local_morte": "Eindhoven, The Netherlands",
  "summary": "Jaap Seidel was a Dutch mathematician who who worked in geometry and graph theory.",
  "biografia": "Johan Jacob Seidel\nwas known to almost everyone as Jaap Seidel. His parents were both school teachers\n[\n5\n]\n:-\nAt birthday parties the young boy saw teachers all the time.\nHe attended Galvanistraat primary school then in\n1930\n-\n31\nparticipated in the Masterclass which took pupils from a number of schools and prepared them for attending the best quality secondary schools\n[\n5\n]\n:-\nI remember the hard problems in applied arithmetic, about rowing boats in a flowing river.\nHe entered the Municipal\nGymnasium\nin The Hague in\n1931\nand graduated from this high school in\n1937\n. Later that year he entered the University of Leiden to study mathematics and physics.\nDe Bruijn\nwrites\n[\n5\n]\n:-\nJaap at once became a member of the little club of Leiden mathematics students living in The Hague, gathering  weekly, usually at my home. ... Jaap was much more social than the others, certainly much more social than I was, and it always remained like that. At an early age already, Jaap had experience in what is now called Networking.\nIn his first year he took\nKloosterman\n's Linear Algebra course; it had a major impact and throughout his research career the influence of this course was evident. He passed his Candidates Examination in\n1940\n. This was a difficult period since the German forces quickly overwhelmed the Dutch armies in the spring of\n1940\n. Attempts were made to continue to run the country despite the German occupation but the University of Leiden was closed by the German occupational authorities in\n1941\n, because students protested against the dismissal of their Jewish professors. When it became clear that the closure was not going to be a short one, Seidel, who had continued his studies there up to that point, now transferred to the Free University of Amsterdam where he was strongly influenced by\nJohannes Haantjes\n. However, his studies were disrupted again when the German occupiers forced him to go to Berlin as a labourer in a factory. Soon Seidel found an opportunity to escape from the Germans and was able to return to the Netherlands where he remained in hiding for the rest of the war.\nFrom March to July\n1946\n, Seidel taught engineering at a secondary training school in Amsterdam, then from September\n1946\nto September\n1950\nhe taught at the prestigious Vossius Gymnasium in Amsterdam. While undertaking his duties as a teacher, he was also working on his doctoral dissertation.\nHaantjes\nhad moved from Amsterdam to Leiden, so it was natural for Seidel to submit his doctoral studied there. He was awarded his doctorate by the University of Leiden in\n1948\nfor his thesis\nDe congruentie-orde van het elliptische vlak\nⓉ\n(\nThe congruence order of the elliptic plane\n)\nwritten with\nJohannes Haantjes\nas his advisor.\nHaantjes\nand Seidel announced the results in the paper\nThe congruence order of the elliptic plane\n(1947)\n. Seidel published full proof in his\n71\npage thesis published in\n1948\n. L M Blumenthal writes in a review:-\nThis thesis contains the proofs promised in a recent note that the congruence order of the elliptic plane, with respect to the class of metric spaces, is seven\n(\nthat is, seven is the smallest number with the property that an arbitrary metric space is congruent with a subset of the elliptic plane whenever each seven of its points are\n)\n. Though the algebraic-geometric methods by which this result is established occasionally lead to proofs involving the examination of many cases and subcases\n(\nthe longest proof covers more than seven pages\n)\nand they could hardly be carried through in elliptic three-space, the arguments\n(\nelementary in character\n)\nare presented in a clear and orderly manner. The reader must be referred to this painstaking work itself for details.\nHe was appointed as an instructor at the University of Delft in\n1950\nand promoted in\n1955\n. Seidel had been put in charge of the Entertainment Committee for the International Congresses of Mathematicians held in Amsterdam in September\n1954\n. He had the\n[\n5\n]\n:-\n... idea to attach an\nEscher\nexhibition to the congress. It was a great success. A great thing for\nEscher\ntoo: having it in the prestigious Stedelijk Museum, it gave him a recognition that he did not have before. And it brought him into contact with scientists from all over the world. In particular with\nCoxeter\nand young\nPenrose\n.\nIn the spring of\n1955\nSeidel was given leave to study with Van der Ven in Rome, an unusual privilege for someone in his position.\nJohannes Haantjes\nbecame ill in\n1955\n(\nhe died in the following year\n)\nand Seidel was asked to give some of his courses at Leiden. This proved excellent experience for him.\nThe Technical University Eindhoven was established in\n1956\nas a Technische Hogeschool\n(\nTechnical College\n)\nand Seidel was appointed to run the mathematics department at the new university\n[\n5\n]\n:-\nJaap organized the mathematical department and the mathematical curricula all by himself. It was really a one-man-show. He was a wonderful organizer, knew to attract quite a good group of professors and instructors, and he let them do it the way he wanted it to do.\nVan Lint\nwrites about a new, and far more vigorous, period in Seidel's research career which started when he stopped being Head of Mathematics at Eindhoven\n[\n6\n]\n:-\nIt is remarkable, for a mathematician, that Seidel's third period, as a prominent scientist, started when he was already\n47\nyears old. The joint paper with\nVan Lint\nin\n1966\n(\nstill  cited\n)\nstarted a long sequence of important contributions to the theory of strongly regular graphs and design theory. He never ceased being a geometer, but algebraic methods and tools from algebra influenced his work increasingly. This algebraic trend and the fact that he is not a soloist, but the epitome of a collaborator, led to numerous joint papers with P J Cameron, Ph Delsarte, and J-M Goethals. A continued interest in very many other parts of mathematics was rewarded: a number of papers linked his own research to other areas such as group theory and the theory of integration.\nAs an indication of his work we look the titles of conference presentations by Seidel:\nStrongly regular graphs,\nThird Waterloo Conf. on Combinatorics,\n1968\n;\nQuasisymmetric block designs,\nCalgary Internat. Conf., Calgary,\n1969\n;\nConfigurations,\nColloquium on Discrete Mathematics, Amsterdam,\n1970\n;\nEutactic stars,\nFifth Hungarian Colloq., Keszthely,\n1976\n;\nGraphs related to exceptional root systems,\nFifth Hungarian Colloq., Keszthely,\n1976\n;\nThe pentagon,\nBicentennial Congress Wiskundig Genootschap, Amsterdam,\n1978\n;\nThe pentagon,\nSecond International Conference on Combinatorial Mathematics, New York,\n1978\n;\nSpherical designs,\nRelations between combinatorics and other parts of mathematics, Ohio State Univ., Columbus, Ohio,\n1978\n;\nTwo-graphs, a second survey,\nAlgebraic methods in graph theory, Szeged,\n1978\n;\nStrongly regular graphs,\nSeventh British Combinatorial Conf., Cambridge,\n1979\n;\nCubature formulae, polytopes, and spherical designs,\nThe geometric vein, Toronto,\n1979\n;\nGraphs and two-distance sets,\nCombinatorial mathematics, VIII, Geelong,\n1980\n;\nTables of two-graphs.\nCombinatorics and graph theory, Calcutta,\n1980\n;\nDelsarte's theory of association schemes.\nGraphs and other combinatorial topics, Prague,\n1982\n;\nHarmonics and combinatorics,\nCombinatorics and applications, Calcutta,\n1982\n;\nFew-distance sets in\nR\np\n,\nq\nR_{p,q}\nR\np\n,\nq\n​\n.\nSymposia Mathematica, Rome,\n1983\n;\nIntegral lattices, in particular those of Witt and of Leech.\nMathematical Structures in Field Theories, Amsterdam,\n1986\n-\n1987\n;\nGraphs and their spectra.\nCombinatorics and graph theory, Warsaw,\n1987\n;\nDesigns and approximation.\nFinite geometries and combinatorial designs, Lincoln, NE,\n1987\n;\nIntroduction to association schemes.\nSéminaire Lotharingien de Combinatoire, Thurnau,\n1991\n;\nMore about two-graphs.\nFourth Czechoslovakian Symposium on Combinatorics, Graphs and Complexity, Prachatice,\n1990\n;\nSpherical designs and tensors.\nProgress in algebraic combinatorics, Fukuoka,\n1993\n.\nAll these conferences published proceedings and Seidel's contribution was published in each. However he also spoke at many conferences where no proceedings were published, for example the\n1976\nBritish Mathematical Colloquium\nheld in Aberystwyth in Wales in April of that year. His plenary lecture was\nSpherical codes and designs\n.\nWe end this biography with two tributes to Seidel. The authors of\n[\n2\n]\nwrite:-\nJaap Seidel loved Mathematics. He wanted to learn it, to understand it, and most of all to teach it. In his courses and personal contacts he was very inspiring. Many mathematicians, especially young ones, were influenced by Jaap. Besides being a teacher, he was also very interested in what other researchers were doing. He always tried to find links to subjects he had been working on. Jaap's work makes connections with several branches in mathematics, and he had struck friendships with mathematicians all over the world. He has been called an ambassador of mathematics.\nThe authors of\n[\n1\n]\nwrite:-\nProfessor Seidel's love of mathematics and his enthusiasm as an expositor of mathematics have led to an international reputation as an ambassador of mathematics. He has been especially active in Eastern Europe and in Asia where he has contacted many mathematicians and introduced their work to the Western world. His encouragement and enthusiasm have been especially valuable to young mathematicians. Many of us have been warmly welcomed by Jaap and Ada into their home and into their family. Very quickly, mutual mathematical interests grew into a close personal friendship.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "De Bruijn",
    "Kloosterman",
    "Johannes Haantjes",
    "Haantjes",
    "Escher",
    "Coxeter",
    "Penrose",
    "Van Lint",
    "British Mathematical Colloquium"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}