{
  "nome_completo": "Jacobus Hendricus van Lint",
  "nome_curto": "Jack van Lint",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_Lint/",
  "data_nascimento": "1 September 1932",
  "local_nascimento": "Bandoeng, Netherlands East Indies, now Indonesia",
  "data_morte": "28 September 2004",
  "local_morte": "Eindhoven, The Netherlands",
  "summary": "Jack van Lint was an Indonesian-born Dutch mathematician who worked number theory and also in combinatorics and coding theory.",
  "biografia": "Jack van Lint\n's father was Hendrikus Jacobus van Lint who, at the time when Jack was born, was a mathematics teacher at a secondary school Bandoeng, Netherlands East Indies\n(\nnow Indonesia\n)\n. He was an excellent teacher and had a remarkable memory, two characteristics that his son Jack inherited. When Jack was five years old his father was given a year off and the family was able to return to the Netherlands. After a year the family returned to the Netherlands East Indies, but not to Bandoeng, rather they went to Batavia\n(\nnow named Jakarta and the capital of Indonesia\n)\n. The city was undergoing a period of modernisation and it was at the time that Jack began his education in an elementary school in Batavia.\nAfter France and the Netherlands fell to the Germans in the summer of\n1940\nnear the beginning of World War II, the Japanese decided to invade their colonies. By February\n1942\nonly Java remained to complete the Japanese programme of conquest. Jack's father undertook military duties and was given the job of training pilots. The Allies attempted to prevent the Japanese invasion by attacking the fleet as it sailed towards Java. However the Allies were defeated at the Battle of the Java Sea on\n27\nFebruary. The Japanese landed at three points on Java on\n28\nFebruary and rapidly expanded their beachheads. Realising that defeat was inevitable, the military personnel were told to board one of ten ships which would take them to Australia. Jack's family, despite heavy bombing, were able to board one of these ships at Cilacap, a port on the southern coast of Java, which left shortly before the Allied troops in Java surrendered on\n9\nMarch. Of the ten ships, only three made Australia, the other seven being torpedoed. The van Lint family was lucky to be on one of the three.\nThe van Lint family were only in Australia for a few months before they were once again aboard a ship, this time sailing to the United States. They settled in Jackson, Mississippi, and Jack continued his education at an elementary school in Jackson. He attended this school for session\n1942\n-\n43\nand his ability at languages is nicely illustrated by the fact the by the end of the year he came top of the class in English. His father was sent to Chicago in\n1943\nand Jack attended elementary school there from\n1943\nuntil\n1945\n. After World War II ended Jack's father, who had now trained as a meteorologist, was required to return to Indonesia to continue service in the Dutch army. However, it was not safe enough for women and children, so Jack, his brother Hans, and his mother spent a year in Bundaberg, Australia where Jack attended Intermediate school during session\n1945\n-\n1946\n.\nThe Dutch had assumed that they would be able to return to the pre-war situation in Indonesia, but an Independence movement made this impossible and a series of risings marked the beginning of a revolution. It was not safe for the Dutch to remain and Jack's father, together with the rest of the van Lint family, sailed back to the Netherlands, arriving in November\n1946\n. They went to live with family members in Arnhem and Jack began his secondary education in this city in\n1946\n. By this time he was fourteen and during the many moves around the world he had lost a year so was old to be starting his secondary education. It was at this school that he showed his mathematical abilities but he was not to be able to complete his secondary education at Arnhem for in the middle of session\n1948\n-\n49\nthe van Lint family moved to Zwolle where his father had been appointed as director of the Rijks HBS\n(\nhogere burgerschool\n)\nin Bagijnesingel. Jack's final year of secondary education was spent in the HBS in Zwolle and by the time he graduated in\n1950\nhe was ranked as the best student in the Netherlands, a remarkable achievement for someone who had been forced to attend schools in four continents.\nVan Lint entered Utrecht University in\n1950\nand there he was strongly influenced by\nHans Freudenthal\n,\nJan Popken\nand Frederik van der Blij. On\n31\nJanuary\n1955\nhe graduated M.Sc. with distinction\n)\nin mathematics and physics but he was already employed as an assistant to\nHans Freudenthal\nin the Mathematical Institute of Utrecht University. He held this post from September\n1952\nto September\n1956\n. Then he spent session\n1956\n-\n1957\nfirst at the University of Göttingen then at the University of Münster but during this period he was undertaking research for his doctorate with van der Blij as his thesis advisor. On\n28\nOctober\n1957\nhe was awarded his doctorate\n(\nwith distinction\n)\nfrom Utrecht University after submitting his thesis\nHecke Operators and Euler Products on modular functions\n. In the thesis, he developed a theory of generalized\nHecke\noperators, being automorphic forms of not necessarily integral dimension, as defined by Klaus Wohlfahrt in his\n1955\ndissertation at Münster University. This theory allowed him to derive, in a systematic way, many known results and some new ones. In the thesis van Lint also studied modular forms of non-integral dimensions that have an\nEuler\nproduct.\nFrom September\n1957\nto June\n1959\nhe was a research associate at the Netherlands Organisation for Pure Scientific Research. Then in June\n1959\nhe was appointed as professor of mathematics at Eindhoven University of Technology. He continued to hold this chair until he retired in\n1997\nafter being dean of the mathematics faculty from\n1989\nto\n1991\n, then rector of the university from\n1991\nto\n1996\n.\nWe will discuss his mathematical achievements below, but first let us note that van Lint was an excellent sportsman, particularly excelling as an outstanding swimmer. At the University he successfully campaigned for sports facilities for students, such as a private swimming pool. At Eindhoven the Van Lint Students Sports Week was instigated and also the International Professor van Lint Tournament. Let us also mention that van Lint married Elisabeth Barbara Janna Teunissen on\n15\nDecember\n1961\n; they had two children Barbara\n(\nborn\n26\nSeptember\n1962)\nand Jacobus Hendricus\n(\nborn\n15\nNovember\n1964)\n.\nVan Lint's research following the award of his doctorate continued on a number of distinct paths, one of which was a direct outcome of the work of his thesis. His papers included\nÜber einige Dirichletsche Reihen\nⓉ\n(\nOn some Dirichlet series\n)\n(1958)\n,\nOn some special theta functions\n(1958)\n,\nOn the multiplier system of the Riemann-Dedekind function eta\n(1958)\n,\nLinear relations for certain modular forms\n(1959)\n,\nOn the hermitean product of ordered point sets on the unit circle\n(1960)\n, and\nA problem in Hilbert space\n(1960)\n. He then became interested in number theory publishing papers in that topic such as\n(\njointly with\nN G de Bruijn\n)\nOn the number of integers ≥ x whose prime factors divide n\n(1962)\n,\n(\njointly with H E Richert\n)\nOn primes in arithmetic progressions\n(1965)\n, and\n(\nwith\nP Erdős\n)\nOn the number of positive integers ≤ x and free of prime factors > y\n(1966)\n. However, around this time,\nJaap Seidel\nencouraged him to take an interest in combinatorics and discrete mathematics. This was a significant move and resulted in works for which he is most famed.\nIn\n1971\nhe published the book\nCoding theory\n. G Solomon wrote in a review:-\nFor the student with a background in algebra, the author has written an elegant set of notes on algebraic coding. Written from the viewpoint of the mathematician, and with no intent to be all-inclusive, he has managed to give the reader some deep insights and directions into the major problems of the subject.\nIn\n1975\nhe published\nGraph theory, coding theory and block designs\nwritten jointly with Peter Cameron. Norman Biggs writes:-\nThis book is based on lectures given by the authors during\n1973\nat Westfield College, University of London. The material has been well adapted to the chosen format, and the result is a brisk and entertaining introduction to some areas of common ground between graph theory, coding theory and design theory. In several places the treatment compares favourably, in clarity and elegance, with previous accounts available in the literature.\nA revised edition appeared in\n1980\nwhich Vera Pless reviewed:-\nThe predecessor of this book was a welcome volume which gave the relevant concepts and theorems in these three areas and showed their interrelationships. ... The high level of presentation of the previous volume has been maintained. The present volume should be very useful in the fruitful areas of research which the relationships between these areas present.\nIn\n1982\nvan Lint published\nIntroduction to coding\ntheory. Giuseppe Longo writes:-\nThis is a concise, self-contained and neat introduction to the subject of coding theory suitable for students of mathematics. To some extent, it is an updated version of 'Coding theory', by the same author, but the scope is wider.\nVan Lint himself explained several years later that:-\n... this book was conceived in\n1981\nas an alternative to outdated, oversized, or overly specialized textbooks in this area of discrete mathematics.\nVan Lint continued to publish outstanding texts. The next, written jointly with Gerard van der Geer, was\nIntroduction to coding theory and algebraic geometry\n. The book was based on lectures given in the seminar on \"Coding Theory and Algebraic Geometry\" held at Schloss Mickeln, Düsseldorf,\n16\n-\n21\nNovember\n1987\n. It is described as 'elegant and useful'. Another book written jointly with Peter Cameron was\nDesigns, graphs, codes and their links\nwhich in many ways is a third revised edition of their earlier text:-\nThe format is very much the same: short, tightly reasoned chapters with an emphasis on the concrete and special rather than on general theories.\nIn\n1992\nvan Lint published his final text\n(\nalthough he went on to produce several later revised editions of his earlier books\n)\n. The\n1992\nbook, written with R M Wilson, was\nA course in combinatorics\n. The authors boldly suggest that:-\n... after a course like this, students who subsequently attend a conference on 'combinatorics' would hear no talks where they are completely lost because of unfamiliarity with the topic.\nIt may be a bold claim but most would agree that in the\n530\npages of the book they succeed admirably. The authors also explain in the Preface:-\nOf course, none of the chapters could possibly give a complete treatment of the subject indicated in their titles. Instead we cover some highlights - but we insist on doing something substantial or nontrivial with each topic. ... The material in every chapter has been presented in class, but we have never managed to do all the chapters in one year.\nIt was not only as a researcher and expositor that van Lint excelled. He made an outstanding contribution in many other areas. He acted as an editor for nine international journals:\nNieuw Archief voor Wiskunde, Managing editor\n(1983\n-\n1987)\n;\nJournal of Combinatorial Theory A\n(1976\n-\n2004)\n; Discrete Mathematics\n(1972\n-\n2004)\n;\nSIAM Journal of Applied Mathematics\n(1976\n-\n1979)\n;\nInternational Journal of Mathematical Education\n(1978\n-\n1988)\n;\nAnnals of Discrete Mathematics\n(1972\n-\n1980)\n; Geometriae Dedicata\n(1983\n-\n2004)\n;\nIEEE Transactions Information Theory\n(1986\n-\n1989)\n;\nCodes, Designs and Cryptography\n(1990\n-\n2004)\n.\nHe was an active member of various international committees:\nEuropean Science Foundation\n(1977\n-\n1978)\n, European Mathematical Council\n(1978\n-\n1990)\n,\nInternational Council of Scientific Unions / CTS\n(1986\n-\n1994)\n,\nInternational Committee on Mathematical Instruction\n(1986\n-\n1994)\n,\nNational Fund for Scientific Research\n(\nBelgium,\n1990\n-\n1997)\n,\nScientific Committee ECM\n2000\n(1997\n-\n1999)\n.\nA particular honour which few have matched is that he was invited to address the International Congress of Mathematicians on four separate occasions, in Warsaw in\n1983\n, in Berkeley in\n1986\n, in Kyoto in\n1990\n, and in Berlin in\n1998\n. He was also an invited speaker at the International Congress on Mathematical Education on three separate occasions, in Karlsruhe in\n1976\n, in Berkeley in\n1980\n, and in Adelaide in\n1984\n.\nAmong the other honours which van Lint received we mention: elected member of the\nRoyal Netherlands Academy of Arts and Sciences\n(1972)\n; appointed Knight in the Order of the Lion of the Netherlands\n(1993)\n; honorary professor Technical University of Bucharest, Romania\n(1995)\n; honorary doctorate from the University of Bergen, Norway\n(1996)\n; honorary doctorate from the Technical Unversity of Bucharest\n(1996)\n; honorary professor Xi'an Jiaotong University, China\n(1996)\n; Neways Award from Eindhoven\n(1997)\n;\nEuler\nMedal of the Institute of Combinatorics and Applications, Canada\n(1997)\n; honorary doctorate from the University of Gent, Belgium\n(2000)\n; and elected honorary member of the Koninklijk Wiskundig Genootschap\n(\nDutch Mathematical Society\n)\n(2004)\n.",
  "matematicos_citados_na_biografia": [
    "Hans Freudenthal",
    "Jan Popken",
    "Hecke",
    "Euler",
    "N G de Bruijn",
    "P Erdős",
    "Jaap Seidel",
    "Royal Netherlands Academy of Arts and Sciences",
    "Dutch Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}