{
  "nome_completo": "Jacov Il'ich Frenkel",
  "nome_curto": "Jacov Il'ich Frenkel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frenkel/",
  "data_nascimento": "10 February 1894",
  "local_nascimento": "Rostov-on-Don, Russia",
  "data_morte": "23 January 1952",
  "local_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "summary": "Jakov Il'ich Frenkel was a Russian physicist who worked in the field of condensed matter physics.",
  "biografia": "Jacov Il'ich Frenkel\n's father, Il'ya Abramovich Frenkel spent six years deported to Siberia because of his revolutionary views. Soon after his release in\n1890\nhe married Rosaliya Abramovna Batkina. Jacov Il'ich Frenkel was the eldest of their children. The family moved to Kazan in the early\n1900\ns and by this time there were four children.\nAfter one year in a\nGymnasium\n, Jacov Il'ich was sent to Switzerland in\n1905\nbecause of the situation in Russia. Of his childhood he wrote\n[\n1\n]\n:-\nAs a child I was very talented at music and painting. This impelled my parents to arrange for me to have lessons in playing the violin\n(\nat age\n8)\nand drawing\n(\nat age\n12)\n. Both these activities have remained my favourite hobbies ...\nIn\n1906\nthe family moved to Minsk, then in\n1909\nto St Petersburg. There Frenkel entered the K May Gymnasium. By this stage he was already interested in mathematics:-\nI first became interested in mathematics and physics at age\n14\n. By the end of the fifth grade I had learnt the whole mathematics course, and by the time I graduated from the Gymnasium, most of the university course in mathematics, mechanics and physics. Unfortunately, all along there was nobody to guide me, so I had to study on my own.\nBy\n1910\nFrenkel was discovering mathematics for himself and working extremely hard. he became ill with heart problems which his parents put down to overwork and tried to stop him working during the summer of\n1911\n, encouraging him to rest.\nHis work was shown to J V Uspenskii, a student of A A\nMarkov\n, who saw that Frenkel had discovered many results on finite differences for himself. By\n1912\nhe had completed a\n250\npage paper on mathematical physics in which he studied the Earth's magnetism. Frenkel graduated from the K May Gymnasium in\n1913\nwith distinction and was awarded the Gold Medal. After this he visited the United States, returning to St Petersburg to enter University in August\n1913\n. He graduated in\n1916\nfrom the Physics and Mathematics department, remaining at St Petersburg University to study for his doctorate. The political situation became very difficult, however, and he went to the Crimea where a new university had recently been set up. After graduating he began to teach at the University of Tavrichisky at Simferpol in November\n1918\n.\nFrenkel married Sarra Isaakovna Gordina in the Crimea in December\n1920\n. The couple went to St Petersburg\n(\nby this time called Petrograd\n)\nin early\n1921\n. There he continued his research on mathematical physics at the Polytechnic Institute. In November\n1925\nFrenkel set out on a European tour, spending a year visiting Germany, France, and England. Returning to St Petersburg in\n1926\n(\nby the called Leningrad\n)\nhe taught both at the Polytechnic Institute and at the University. He had already published a number of major books:\nThe structure of matter I\n(1922)\n,\nThe theory of relativity\n(1923)\n,\nThe structure of matter II\n(1924)\n,\nVector and tensor analysis\n(1925)\n,\nElectricity and matter\n(1925)\n, and Electrodynamics\n(1926)\n.\nAfter his return to Leningrad he worked on a second volume of\nElectrodynamics\n. He attended the Como Conference in Italy in September\n1927\npresenting his work on the electron theory of metals. He also participated in the Congress of Physicists in Moscow in the following year. In\n1930\nhe went to the United States for a year, returning to Leningrad to maintain his remarkable publication record. He published the first volume of\nWave mechanics\nin\n1932\nwith the second volume appearing in\n1934\n. If you think this means that a whole year went by without Frenkel publishing a book then you would be wrong for between the two volumes of\nWave mechanics\nhe published\nStatistical physics\nin\n1933\n. Other major books included\nAnalytical mechanics\n(1935)\nand\nTheoretical mechanics based on vector and tensor analysis\n(1940)\n. Of course this incredible productivity had its drawbacks. Kapitza once told him:-\nYou would be a genius if you published ten times less than you do.\nHis son writes in\n[\n1\n]\n:-\n... precision was not among his merits. he was always late - for a train, for a seminar, for a lecture.\nFrenkel knew his own weakness here and once joked:-\nIn reply to your enquiry I inform you that I was not late for my lecture since it did not start before I arrived.\nDuring World War II the Institute was evacuated in Leningrad and Frenkel left for Kazan in August\n1941\nto join the resited Institute. He only just made it for two days later the advancing German armies prevented further trains leaving Leningrad. In Kazan he worked on his book\nKinetic theory of liquids\nwhich was, in many ways, his best work. It was published in\n1945\n. He had become Head of Theoretical Physics at Kazan University in\n1942\nand from around this time his interests turned towards geophysics.\nHe returned to Leningrad in the spring of\n1944\nbut the remaining eight years of his life were very difficult ones. His work was criticised for not contributing to the construction of socialism. His book were seen to oppose the deterministic Socialist philosophy, particularly his work on quantum mechanics. He was forced into making various statements declaring that his views had been in error just to allow him to survive at all. There is no doubt that the worry of these years contributed to his early death.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Markov"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}