{
  "nome_completo": "Jacques de Billy",
  "nome_curto": "Jacques de Billy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Billy/",
  "data_nascimento": "18 March 1602",
  "local_nascimento": "Compiègne, France",
  "data_morte": "14 January 1679",
  "local_morte": "Dijon, France",
  "summary": "Jacques de Billy was a French Jesuit who corresponded with Fermat and produced a number of results in number theory which have been named after him.",
  "biografia": "Jacques de Billy\nentered the Jesuit order and studied theology at the Colleges of the Order. He was ordained a Jesuit. The Jesuit Order had been created about sixty years before de Billy was born and, from the very beginning, education and scholarship became the principal work of the Order. By the time Billy entered the Order it contained around\n15\n,\n000\nmen.\nBilly taught mathematics and theology at Jesuit colleges all his life, in particular those colleges which were in the administrative region of Champagne, a region which covered the present-day northeastern French districts of Marne and parts of Ardennes, Meuse, Haute-Marne, Aube, Yonne, Seine-et-Marne, and Aisne. From\n1629\nto\n1630\nhe taught mathematics at the Jesuit College at Pont à Mousson, during this time he was still studying theology.\nFrom\n1631\nto\n1633\nBilly taught mathematics at the Jesuit college at Rheims. He became a close friend of\nBachet\n, who was one of his pupils at Rheims. After this Billy taught in Grenoble and then was rector of a number of Jesuit Colleges in Chalons, Langres and in Sens. From\n1665\nto\n1668\nhe was professor of mathematics at the College of Dijon. One of his pupils in Dijon was\nOzanam\nbut this was before he was appointed to the chair of mathematics so, since there were no formal mathematics classes at the College, he taught\nOzanam\nprivately.\nBilly corresponded with\nFermat\nand produced a number of results in\nnumber theory\nwhich have been named after him. Billy had collected many problems from\nFermat\n's letters and, after the death of his father,\nFermat\n's son appended de Billy's collection under the title\nDoctrinae analyticae inventum novum\nⓉ\n(\nNew discovery in the art of analysis\n)\nas an annex to his edition of the\nArithmetica\nof Diophantus\n(1670)\n. Itard writes in\n[\n1\n]\n:-\nIt is an elaborate study of the techniques of indeterminate analysis used by\nFermat\nand, on the whole, it explains them correctly. From it one can guess at\nFermat\n's general line of activity in a field in which there are few pertinent documents.\nHe also published astronomical tables such as\nTabulae Lodoicaeae seu universa eclipseon doctrina tabulis, praeceptis ac demonstrationibus explicata. Adiectus est calculus, aliquot eclipseon solis & lunae, quae proxime per totam Europam videbuntur\nⓉ\n(\nTables of eclipses, the principles and explanations. In addition calculations for all solar and lunar eclipses which will be seen throughout the whole of Europe,\n)\n. This was a table of eclipses for the years\n1656\nto\n1693\nand included solar and lunar tables. Billy is also important in being one of the first to reject the role of astrology in science, along with superstitious notions about the malevolent influence of comets.\nAmong Billy's most important works are:\nAbrégé des préceptes d'algèbre\nⓉ\n(\nAbstract algebraic precepts\n)\n(1637)\n;\nNova geometricae clavis algebra\nⓉ\n(\nNew key geometrical algebra\n)\n(1643)\n;\nTractatus de proportione harmonicae\nⓉ\n(\nTreatise on the harmonic ratio\n)\n(1658)\n; and\nDiophantus geometria sive opus contextum ex arithmetica et geometria simul\nⓉ\n(\nThe work of Diophantus on geometry and arithmetic and geometry\n)\n(1660)\n.",
  "matematicos_citados_na_biografia": [
    "Bachet",
    "Ozanam",
    "Fermat",
    "number theory"
  ],
  "imagens": [
    "billy.jpg"
  ]
}