{
  "nome_completo": "Jacques Frédéric Français",
  "nome_curto": "Jacques Français",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Francais_Jacques/",
  "data_nascimento": "20 June 1775",
  "local_nascimento": "Saverne, Bas-Rhin, France",
  "data_morte": "9 March 1833",
  "local_morte": "Metz, France",
  "summary": "Jacques Français was a French mathematician who published a version of Argand's work on complex numbers.",
  "biografia": "Jacques Français\nwas the brother of\nFrançois Français\n. The brothers were the children of Jacques Frédéric Français, who was a grocer in Saverne, and Maria Barbara Steib. Jacques entered the College at Strasbourg and excelled in his studies there.\nHe volunteered for the army in\n1793\n. The reason why volunteers were needed in that year was that the French Revolution of\n1789\nhad not gained universal support and there were attempted counter-revolutions in parts of France. In the Vendée region in the west of France there was an uprising which was sparked off by the introduction of conscription in February\n1793\n. By the middle of March there was an alliance of Royalists and peasants with a fair size army. Jacques' brother\nFrançois Français\nalso joined the government army in\n1793\nwhich was being assembled to put down the rebellion.\nIn September\n1794\nJacques Français became an assistant in the engineering corps. In the autumn of\n1797\n, when\nFrançois Français\nleft the army, Jacques Français entered the École Polytechnique and in the spring of the next year he moved to the École du Génie. By\n1801\nhe had reached the rank of first lieutenant and he was sent by Napoleon to Egypt in January of that year. Once back in France he was stationed at Toulon and promoted to captain of the sappers. Further promotions followed, and in November\n1802\nhe became second in command at the staff headquarters of the engineering corps.\nHe went on to participate, under the command of Admiral Villeneuvre, in the naval battles of Cape Finisterre and Trafalgar. In\n1807\nhe was stationed at Strasbourg and his commander there was\nMalus\n. We discuss below the mathematics which Jacques Français produced at this time due mainly to the encouragement of\nMalus\n. By\n1810\nFrançais had reached the position of first in command at the staff headquarters of the École d'Application in Metz and, in\n1811\n, he was appointed professor of military art in Metz.\nThe first mathematics memoir which Jacques Français seems to have written was submitted in\n1800\n. It was a work on the integration of first order\npartial differential equations\n, but the memoir had been lost so there are few details as to its precise contents. He then appears to have lost interest in mathematics until, under the command of\nMalus\n, he was encouraged to prepare his work on analytic geometry for publication. During\n1807\n-\n08\nhe wrote works on the straight line and the plane in oblique coordinates, also considering transformations between systems of oblique coordinates. He applied his methods to the famous problem of finding a sphere tangent to four given spheres, publishing a number of notes on the topic between\n1808\nand\n1812\n, and giving a complete solution in the\n1812\npaper which appeared in\nGergonne's Journal\n.\nAlthough with encouragement from\nMalus\nJacques Français had begun to publish mathematics, a second boost to his mathematics occurred after the death of his brother\nFrançois Français\n. He worked on his brother's manuscripts after his death, and published a mixture of his own work and his brother's over the next few years. It is fair to say that he was inspired by studying his brother's manuscripts.\nIn September\n1813\nFrançais published a work in which he gave a geometric representation of complex numbers with interesting applications. This was based on\nArgand\n's paper which had been sent, without disclosing the name of the author, by\nLegendre\nto\nFrançois Français\n. Although\nWessel\nhad published an account of the geometric representation of complex numbers in\n1799\n, and then\nArgand\nhad done so again in\n1806\n, the idea was still little known among mathematicians. This changed after Français' paper since a vigorous discussion between Français,\nArgand\nand\nServois\ntook place in\nGergonne's Journal\n. In this argument Français and\nArgand\nbelieved in the validity of the geometric representation, while\nServois\nargued that complex numbers must be handled using pure algebra.\nAfter this burst of mathematical activity, Français appears to have given up mathematics at the end of\n1815\n. Taton, writes in\n[\n1\n]\n:-\nWhile not of the first rank, the mathematical activity of the Français brothers merits mention for its originality and diversity.",
  "matematicos_citados_na_biografia": [
    "François Français",
    "Malus",
    "partial differential equations",
    "Argand",
    "Legendre",
    "Wessel",
    "Servois"
  ],
  "imagens": []
}