{
  "nome_completo": "Jakob Hermann",
  "nome_curto": "Jakob Hermann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hermann/",
  "data_nascimento": "16 July 1678",
  "local_nascimento": "Basel, Switzerland",
  "data_morte": "11 July 1733",
  "local_morte": "Basel, Switzerland",
  "summary": "Jakob Hermann was a Swiss mathematician who made contributions to dynamics.",
  "biografia": "Jakob Hermann\n's father was German Hermann, the headmaster of a school in Basel and the author, with Balthasar Kisselbach, of\nAssertiones mathematicae ex universa mathesi desumptae\nⓉ\n(\nMathematical assertions drawn from the mathematics\n)\n(1664)\n. Jakob, who had a sister Salome born in\n1682\n, was a second cousin of\nLeonhard Euler\n's mother. He studied philosophy at the University of Basel but spent a large portion of his time studying mathematics. He received his first degree in\n1695\nand defended a dissertation on infinite series for a Master's Degree in the following year. Hermann was taught mathematics by\nJacob Bernoulli\nwho, at that time, was working on infinite series.\nJacob Bernoulli\nhad a number of pupils at the University of Basel, the first being Paul Euler\n(1670\n-\n1745)\nwho studied theology but also studied mathematics. Paul Euler became a pastor in the Reformed Church and was the father of\nLeonhard Euler\n.\nJacob Bernoulli\ndivided up his work on infinite series into a number of dissertations and these were defended by his students for their Master's Degrees. Four of these students were Johann Jacob Fritz, who defended his dissertation on series in\n1689\n, Hieronymus Beck who defended his thesis in\n1692\n, Jakob Hermann who, as we noted above, defended his dissertation in\n1696\n, and Nicolaus Harscher who defended his thesis on series in\n1698\n. Slightly later,\nNicolaus Bernoulli\n, a nephew of\nJacob Bernoulli\n, also studied with his uncle and defended a dissertation on infinite series in\n1704\n. It was Jakob Hermann, however, who\nJacob Bernoulli\nconsidered was the best of his students and he was assigned Theses\n36\n-\n46\nwhich he defended under the title\nPositiones arithmeticae  de seriebus infinitis earumque summa finita\nⓉ\n(\nArithmetical results on infinite series with finite sums\n)\n.\nLeibniz\nhad published his ideas on the differential calculus in\n1684\nand, two years later, his ideas on the integral calculus. Bernhardt Nieuwentijt\n(1654\n-\n1718)\nwas a Dutch philosopher and mathematician who was highly critical of\nLeibniz\n's differential and integral calculus and, in\n1696\n, he published\nConsiderationes secundae\nⓉ\n(\nSecond considerations\n)\nin which\n[\n16\n]\n:-\n... he argues that there are no gradations in the infinite. The rules of calculating with finite quantities cannot simply be applied to infinite quantities as well. The infinite is by definition the greatest quantity.\nBasically, Nieuwentijt argues that if a quantity becomes infinitely small, he cannot see that anything remains. Hermann answered Nieuwentijt's criticisms in\nResponsio ad clarissimi viri Beruh. Nieuwentiit considerationes secundas circa calculi differentialis princip\nⓉ\n(\nA response to the most eminent men in Bern. The beginning of the consideration of the second round of the calculation of the Newtonian differential\n)\n(1700)\n. In this work he answers each of Nieuwentijt's criticisms, in particular arguing that there are gradations in the infinite. In\n1701\nHermann became a member of the\nBerlin Academy of Science\n, his election being very much due to support from\nLeibniz\nwho was delighted to see the clarity with which he had defended the infinitesimal calculus. Despite all this mathematical activity, Hermann officially studied theology after taking his Master's degree and he took his final theology examinations in\n1701\n. It was through\nJacob Bernoulli\nthat Hermann had become friendly with\nLeibniz\nand, following the death of\nJacob Bernoulli\nin\n1705\n,\nLeibniz\nasked Hermann to write an obituary notice for\nActa Eruditorum\n.\nLeibniz\nwas in Italy in\n1689\n-\n90\nand had met Michelangelo Fardella in Venice. When the chair of mathematics in Padua became vacant,\nLeibniz\nwrote to Fardella, who taught in Padua from\n1693\nto\n1709\n, on\n7\nDecember\n1704\ngiving a high opinion of Hermann's abilities. Because of the strong recommendation, Hermann was appointed to the chair of mathematics at the University of Padua on\n28\nApril\n1707\n. He travelled to Veneto where he spent the summer, arriving in Padua at the beginning of August. As soon as he was in Italy he began to make contacts with other Italian scientists such as Bernardino Zendrini\n(1679\n-\n1747)\n[\n3\n]\n:-\nOne of the ways in which Hermann made the Leibnizian calculus known in Italy while he was in Padua was through frequent exchanges, by letter and in person, with Italian mathematicians, scientists, diplomats and scholars.\nIn fact he frequently corresponded with Zendrini until\n1716\n, and many others including\nGuido Grandi\nand\nJacopo Riccati\n. He lectured on mechanics in November\n1708\nand in December of that year he wrote to Grandi giving him a detailed explanation of how to use\nLeibniz\n's calculus to deduce the differential equation of the logarithm function. Hermann, who also kept in frequent contact with\nJohann Bernoulli\n, published five articles on the inverse problems of central forces between\n1710\nand\n1713\n[\n3\n]\n:-\nIn pursuit of his ambition to promote mathematical research in Italy while he was in Padua, Hermann decided to publish the results he had obtained on the central forces in Italian. This was one of the most topical subjects in the scientific literature of the time, with\nNewton\n, Bernoulli and\nVarignon\nall studying it, which is why Hermann gladly accepted the invitation of his friend and colleague Antonio Vallisneri, who, \"because of his ardent desire to see the deeper sciences promoted\", urged him to contribute to the Journal he had just founded with Scipione Maffei and Apostolo Zeno - the Giornale de' Letterati d'Italia.\nIn fact, while in Padua, Hermann lectured on the standard topics of the day, namely classical geometry, mechanics, optics, hydraulics, and gnomonics. However, his work with other scientists was almost entirely devoted to understanding, developing and applying methods in the infinitesimal calculus. It was while he was in Padua that Hermann did most of the work on his most famous book, the\nPhoronomia\nⓉ\n(\nPhoronomics\n(\nthe science of motion\n)\n)\n, which is a text on mechanics. Although he began writing the book in\n1709\n, it was not published until\n1716\n, three years after he left Italy, and we will delay a discussion of the contents of this important work until a little later in this biography.\nHermann held his post in Padua until his contract expired on\n28\nApril\n1713\n. While in Padua he had asked\nLeibniz\n's advice about moving to a university in another country and\nLeibniz\nhad suggested a position in Frankfurt-an-der-Oder, but advised Hermann to see out the six year contract he had signed with Padua. Although he had a very successful career in Italy, Hermann seems to have found the fact that he was a Protestant in a Roman Catholic country somewhat difficult and, of course, Germany presented a religious environment much more to his liking. After leaving Padua in April, he went to Vicenza where he lived at the home of Giovanni Checozzi\n(1691\n-\n1756)\nand Sebastiano Checozzi\n(1693\n-\n1719)\nuntil June, after which he went first to Basel and subsequently to Frankfurt-an-der-Oder to take up his new appointment. He spent eleven years in Frankfurt-an-der-Oder, again a position which, as we have explained, was largely due to\nLeibniz\n's recommendation. But in\n1724\nPeter the Great called him to Russia to found, together with a number of others, the\nSt Petersburg Scientific Academy\n. He went to Russia in\n1725\n, meeting\nChristian Goldbach\nin Königsberg while on the journey, and held a chair of higher mathematics in the\nSt Petersburg Academy\nuntil\n1731\n. He lived at the court of Peter the Great's successors, Catherine and Peter II. While in St Petersburg, Hermann gave tuition in mathematics to Peter the Great's grandson, Peter Aleksevevich who was crowned Peter II in\n1727\n. Hermann worked on trajectory problems, algebraically squarable curves, and attraction; results on all of these topics he published in papers while in St Petersburg. He also worked on the textbook\nAbrégé des mathématiques\nⓉ\n(\nAbstract Mathematics\n)\n(1728\n-\n1730)\n, writing the first volume,\nArithmetic and Geometry\n, and the third volume on\nMilitary Fortifications\n.\nIn\n1726\n, the\nSt Petersburg Academy\nbegan to publish a journal under the title\nCommentarii Academiae Petropolitanae\nⓉ\n(\nCommentaries of the St Petersburg Academy\n)\n. The journal was launched with an article by Hermann taking pride of place.\nLeonhard Euler\narrived at the Academy in\n1727\n. This was a difficult time since, following the death of Catherine, Peter II had become tsar at the age of twelve. There was political turmoil which had a serious affect on the work of the Academy which was close to collapse. Hermann worked at the Academy through these difficult years until, with the death of Peter II in\n1730\n, the political situation stabilised. He had wanted to return to Basel, however, and had been appointed to the chair of\nethic\nand natural law there in\n1727\n. He had a substitute carry out the duties involved until his contract in St Petersburg came to an end in\n1731\nat which time he returned to Basel to take up the chair he had formally held for four years. He had hoped that a chair of mathematics would become vacant in Basel before his contract at the\nSt Petersburg Academy\ncame to an end but this did not happen.\nHermann worked in mechanics and studied the 'inverse problem' where one has to determine the orbit from a knowledge of the law of force. He proposed the term 'phoronomia' in\n1716\nfor the topic which was sometimes called 'rational mechanics' and is now called 'theoretical mechanics'. This appears in the title of his important book\nPhoronomia, sive de viribus et motibus corporum solidorum et fluidorum libri duo\nⓉ\n(\nPhoronomia: commentaries on forces and motions of  solid bodies and fluids\n)\n(1716)\n. In\n[\n6\n]\nHermann's contribution to dynamics is described in these terms:-\nHe belonged to the Basel school headed by the Bernoullis and, sharing their methodology, made important contributions to the analytical treatment of dynamics. However, he also leaned towards\nNewton\nand, on many occasions, preferred to deal with dynamical problems in terms of geometry.\nThe\nPhoronomia\n[\n6\n]\n:-\n... is devoted to the dynamics of solid and fluid bodies and covers many problems dealt with by\nNewton\nin the first two books of the 'Principia'. In the preface, Hermann declares his intention of adhering to geometrical methods, since these seem to him more suitable for beginners. However, his knowledge of calculus is evident in the way in which he deals with infinitesimals. Hermann's 'Phoronomia' is indeed representative of the process of transition that transformed dynamics in the first decades of the\n18\nth\ncentury.\nAn example of Hermann's approach is illustrated by looking at how he proved\nKepler\n's area law. This had been proved by\nNewton\nin the\nPrincipia\nby using an intuitive limiting geometrical process. Hermann, however, gave a proof in the\nPhoronomia\nin terms of differentials. Although his notation was rather different from modern notation, and not particularly easy to understand, Hermann reworked the same ideas into a notation which is essentially that used today and sent his new version of the proof to\nJohn Keill\nwho published it in\nJournal litéraire\nin\n1717\n.\nIn\n[\n7\n]\nanother important innovation in\nPhoronomia\nis discussed:-\nThe beginning of the kinetic theory of gases is usually assigned to the year\n1738\n, when\nDaniel Bernoulli\n's 'Hydrodynamica' appeared at Strasbourg. The famous tenth section of this book pursued some of the consequences of the assumption that 'elastic fluids' consist of innumerable tiny particles in rapid motion.\n[\nHowever an\n]\nearlier attempt dates from\n1716\n, and is to be found in the 'Phoronomia' of Bernouilli's compatriot Jacob Hermann. .... For us the importance of Hermann's chapter XXIV is that it is, as far as I know, the first attempt to deal mathematically with the relations between heat and motion. The intuition that the speed of the particles must be squared is especially noteworthy, but perhaps not more so than the assumption that their speeds will not all be the same, so that an average must be taken.\nHermann's geometrical contributions are discussed in\n[\n9\n]\n:-\nHermann discussed such topics as finding the radius of curvature and normals to plane curves; the division of an angle or an arc of a circumference into\nn\nn\nn\nparts, by the use of an infinite series; orthogonal trajectories for a given family of curves, by the use of differential equations; and the use of polar coordinates in the analysis of plane curves other than spirals. In his work on curves in space, Hermann discusses the spherical epicycloid; the problem of finding the shortest distance between two points on a given surface; and the equations and properties of various surfaces from the point of view of analytic geometry of three dimensions.\nIn\n1708\nHermann was elected to the Academy at Bologna and,\n1733\n, to the\nAcadémie Royale des Sciences\nin Paris. As to his character, Fellmann writes in\n[\n1\n]\n:-\nHermann possessed a serious, calm disposition; and through his sympathetic character, objectivity, and learning he won not only the friendship of\nLeibniz\nand of\nJacob Bernoulli\nbut also the respect of all the leading mathematicians.",
  "matematicos_citados_na_biografia": [
    "Leonhard Euler",
    "Jacob Bernoulli",
    "Nicolaus Bernoulli",
    "Leibniz",
    "Berlin Academy of Science",
    "Guido Grandi",
    "Jacopo Riccati",
    "Johann Bernoulli",
    "Newton",
    "Varignon",
    "St Petersburg Scientific Academy",
    "Christian Goldbach",
    "St Petersburg Academy",
    "ethic",
    "Kepler",
    "John Keill",
    "Daniel Bernoulli",
    "Académie Royale des Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}