{
  "nome_completo": "Johann Jakob Rebstein",
  "nome_curto": "Jakob Rebstein",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rebstein/",
  "data_nascimento": "4 May 1840",
  "local_nascimento": "Töss, Zürich canton, Switzerland",
  "data_morte": "14 March 1907",
  "local_morte": "Zürich, Switzerland",
  "summary": "Jacob Rebstein was a Swiss mathematician primarily known for his pioneering work as a geometer and surveying expert.",
  "biografia": "Johann Jakob Rebstein\nwas the oldest son in a family of six children. His father was a baker and innkeeper; his mother's father had been a country doctor and surgeon. Rebstein grew up in his native village of Töss and attended primary school there. He was a very intelligent boy\n[\n6\n]\n:-\nSchaggi\n[\n= Jakob\n]\nRebstein was soon regarded as a sort of wonder boy in his village; in particular he was very good at mental arithmetic.\nAfterwards he attended first secondary school and then the Industrieschule in Winterthur. It is reported that he solved geometry problems in his free time. In\n1857\nhe matriculated at the Engineering Department of the Polytechnic. A year later he transferred to the Department for Mathematics and Physics Teachers, as he felt that he lacked technical drawing skills. He still kept an interest in engineering though: his favourite lectures at his new department were by Johannes Wild\n(1814\n-\n1894)\non topography. In his holidays he could apply his knowledge of geometry by surveying fields for the farmers in Töss; but he wanted to become a teacher, not a geometer.\nRebstein graduated from the Polytechnic in\n1860\n, and went to study at the Collège de France in Paris for a year. His original plan was to complete his education in Göttingen, but Kappeler, at the time president of the Polytechnic's School Board, recommended him to the Kantonsschule in Frauenfeld\n(\ncanton Thurgau\n)\n. Rebstein had hoped for an academic career at the Polytechnic, but Kappeler's persuasiveness and the fact that his father had just died, leaving his mother and siblings with only a small income, made him take up the post as mathematics and physics teacher\n[\n6\n]\n. He taught in Frauenfeld until\n1877\n. From\n1877\n-\n1898\nhe was professor of mathematics and physics at the Kantonsschule in Zürich. In addition he taught first mathematics, then geodesy at the Polytechnic's Elective Department as a\nPrivatdozent\n; he\nhabilitated\nin\n1873\n.\nIn\n1895\nhe was awarded a doctorate for his thesis\nBestimmung aller reellen Minimalflächen, die eine Schaar ebener Curven enthalten, denen auf der Gauss'schen Kugel die Meridiane entsprechen\nⓉ\n(\nDetermining All Real Minimal Surfaces That Contain a Family of Planar Curves, Which Correspond to the Meridians on the Gaussian Sphere\n)\n. A year later he became Titularprofessor at the Polytechnic and in\n1898\nhe was appointed to a full professorship for cadastral surveying, adjustment theory and actuarial mathematics. He seems to have held this post until a few weeks before his death.\nRebstein mainly taught at the Polytechnic's School of Cultural Engineering, but also at the Engineering and Elective Departments. For a number of years he was head of the School of Cultural Engineering. He was also heavily involved in creating the Polytechnic's Civil Fund for Widows and Orphans, together with Herzog and Geiser.\nToday Rebstein is primarily known for his pioneering work as a geometer and surveying expert. At the time when he moved to Frauenfeld, geometers in the Grand Duchy of Baden were experimenting with traverse, a new surveying technique. Rebstein first heard about this method when visiting relatives in Baden and was instrumental in introducing it in Switzerland. Indeed, traverse replaced the less accurate method of triangulation in Switzerland towards the end of the\n19\nth\ncentury.\nRebstein was an expert in using the method of least squares and the theory of errors and applying them to cadastral techniques. In\n1863\n, at the age of\n23\n, he was appointed surveying expert for canton Thurgau. He held this position until\n1881\n; later he was also a surveying expert for the cities of St. Gallen\n(1881\n-\n1894)\n, Zürich\n(1886\n-\n1892)\n, and Luzern\n(1894\n-\n1907)\n. He 'never conducted any major surveying project himself' though, but 'examined and revised those of others, among them experienced and proficient men'\n[\n6\n]\n. In fact, leading experts in geodesy such as Friedrich Gustav Gauss\n(1829\n-\n1915)\n, Friedrich Robert Helmert\n(1843\n-\n1917)\nand Wilhelm Jordan\n(1842\n-\n1899)\nregularly asked him to review their works.\nFor many years Rebstein was a member of the examining board of the Swiss Concordat of Geometers. In\n1868\nhe was elected into the board as a substitute\n(\nto replace Wild\n)\nand became a permanent member then. He served as the board's president from\n1887\nuntil his death. Moreover, he also chaired the commission of geometers who measured the perimeter, i.e. the surface area, of the Rhine in canton St. Gallen for a number of years. In\n1888\nhe joined the Swiss Committee of Geodesy; he remained a member until his death. The committee contributed to the Austro-German project of measuring and determining the shape of the Earth's surface.\nAmong Rebstein's publications his\nLehrbuch über praktische Geometrie mit besonderer Berücksichtigung der Theodolitmessung\nⓉ\n(\nTextbook on Practical Geometry With Special Consideration of Theodolite Surveying\n)\n(1868)\nstands out, as most of his publications are surveying and actuarial reports. Examples of his cadastral work are\nDie Kartographie der Schweiz, dargestellt in ihrer historischen Entwicklung\nⓉ\n(\nCartography in Switzerland, Presented in Its Historic Development\n)\n(1883)\n, a report for the Swiss National Exhibition, and\nMitteilungen über die Stadtvermessung von Zürich\nⓉ\n(\nNotice on Surveying the Town Zürich\n)\n(1892)\n.    His actuarial papers include expert opinions on the civil funds of Swiss railway companies\n(1904\nand\n1906\n, both with G Schärtlin\n)\nand reports on the civil funds at the Polytechnic and the University of Zürich. Rebstein conducted many studies in his capacity as auditor of the Swiss Life Insurance and Pensions Service. In fact, in\n1905\nthe University of Zürich awarded him an honorary doctorate 'in recognition of his outstanding contributions to actuarial sciences'\n[\n7\n]\n.\nRebstein was a very active member of the Polytechnic's alumni association, the\nGesellschaft Ehemaliger Polytechniker\n(\nGEP\n)\nthroughout his life and served as the association's president from\n1881\n-\n1885\n. Later on he was made an honorary member. Furthermore, he was a member of the Schweizerische Naturforschende Gesellschaft for most of his life\n(\nhe joined in\n1864)\nand chaired the\nThurgauische Naturforschende Gesellschaft\n(\nThurgau Society for Natural Scientists\n)\nfor a number of years.\nIn the minutes of the organising committee of the first International Congress of Mathematicians we find references to \"assistant Rebstein\", \"Dr Rebstein\" and \"Prof Rebstein\"\n[\n2\n]\nacross various meetings. It is possible that \"assistant\" and \"Dr\" refers to the same person. A \"Dr Rebstein\" joined the organising committee at the preliminary meeting in July\n1896\nas the German-speaking secretary\n[\n3\n]\n. His substitute was Amberg, who took over in late July\n1897\n, when Dr Rebstein stepped down from his post due to military service\n[\n5\n]\n. Whilst \"Dr\" suggests a more junior colleague it is not impossible that this could refer to the Rebstein we just met, as the Swiss army regularly calls back old recruits for training exercises. The minutes further inform us that a \"Prof Rebstein\" joined the finance committee whilst a \"Dr Rebstein\" joined the amusement committee\n[\n4\n]\n. This suggests that there were two Rebsteins. However, we know that Johann Jakob Rebstein attended the congress, not the other one, from the information given in\n[\n8\n]\n.\nLike many of his colleagues at the Polytechnic\n(\nand on the organising committee\n)\n, Rebstein was a keen hill walker and mountaineer. He seems to have been married and had children, but there are no records of their names.   For the last ten years of his life he suffered from a kidney disease.",
  "matematicos_citados_na_biografia": [
    "Privatdozent",
    "habilitated"
  ],
  "imagens": [
    "rebstein.jpg"
  ]
}