{
  "nome_completo": "James Moriarty",
  "nome_curto": "James Moriarty",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moriarty/",
  "data_nascimento": "1 April 1835",
  "local_nascimento": "England",
  "data_morte": "1891",
  "local_morte": "Reichenbach, Switzerland",
  "summary": "James Moriarty is best known as the criminal adversary of Sherlock Holmes.",
  "biografia": "James Moriarty\nwas a mathematical genius who had a great influence on many aspects of Victorian society. He is best known as the criminal adversary of Sherlock Holmes.\nHis biographical details are sketchy and the best account of his early life is\n[\n1\n]\n:-\nHis career has been an extraordinary one. He is a man of good birth and excellent education. Endowed by nature with a phenomenal mathematical faculty. At the age of twenty-one he wrote a treatise upon the binomial theorem, which has had a European vogue. On the strength of it he won the mathematical chair at one of our smaller universities, and had, to all appearances, a most brilliant career before him. But the man had hereditary tendencies of the most diabolical kind. A criminal strain ran in his blood, which, instead of being modified, was increased and rendered infinitely more dangerous by his extraordinary mental powers. Dark rumours gathered round him in the university town, and eventually he was compelled to resign his chair and to come down to London, where he set up as an army coach.\nHe is known\n[\n2\n]\nto have had an interest in the applications of Pure Mathematics also:-\nHe is the celebrated author of \"The Dynamics of an Asteroid\", a book which ascends to such rarefied heights of pure mathematics that it is said that there was no man in the scientific press capable of criticizing it.\nHe was also an early exponent of the subject of Game Theory, well in advance of\nNash\nand\nVon Neumann\n.\nOskar Morgenstern\nanalysed his contributions in\n[\n4\n]\n.",
  "matematicos_citados_na_biografia": [
    "Nash",
    "Von Neumann",
    "Oskar Morgenstern"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}