{
  "nome_completo": "James Mitchell",
  "nome_curto": "James Mitchell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mitchell_James/",
  "data_nascimento": "28 May 1871",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "14 September 1959",
  "local_morte": "Lochgilphead, Argyll, Scotland",
  "summary": "James Mitchell studied at Edinburgh and Berlin. He taught at Waid Academy, at Nairn Academy and Lochgilphead School Argyll where he became headmaster.",
  "biografia": "James Mitchell\n's father was  James Mitchell\n(\nborn in Edinburgh about\n1839)\nwho was a school board officer. His mother was  Thomasina A Mitchell\n(\nborn in England about\n1839)\n.\nJames Mitchell studied at George Watson's College, Edinburgh, where he had a highly successful career winning many prizes in a range of subjects. He entered the University of Edinburgh where he held the Welsh Mathematics Bursary, the Horslie-Scott Bursary and the Drummond Mathematics Scholarship. He won medals or prizes in a wide range of subjects: mathematics, natural philosophy, Latin, Greek, logic, and psychology.\nMitchell graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1893\n, then continued his studies, being awarded a B.Sc. in\n1895\n. He undertook postgraduate studies in Berlin under\nLazarus Fuchs\nand\nHermann Schwarz\n. After travels in Europe and the United States he was appointed to the University of Edinburgh, but quickly decided to make a career in school teaching. He taught at Waid Academy, Anstruther, Fife, from\n1896\n; The Academy, Nairn, from\n1900\n; The Academy, Kilmarnock, from\n1905\n; and Lochgilphead School, Argyll, from\n1912\nwhere he was Headmaster.\nIn March\n1894\n, after obtaining his first degree, Mitchell joined the\nEdinburgh Mathematical Society\n. He remained in the Society throughout his career. He was elected to the\nRoyal Society of Edinburgh\non\n2\nJuly\n1900\n, his proposers being A Crum Brown,\nCargill Gilston Knott\n,\nPeter Guthrie Tait\n,\nAlexander Buchan\n.\nMitchell married Margaret J Mitchell\n(\nborn in Port of Menteith, Perthshire about\n1874)\n. By the\n1901\ncensus they had one daughter Margaret A Mitchell. At this time he was living at\n7\na Bath Street, Nairn and was a mathematics teacher at Nairn Academy.\nAn obituary, written anonymously, appears in the\nRoyal Society of Edinburgh\nYear Book\n1959\n/\n1960\n, page\n93\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Lazarus Fuchs",
    "Hermann Schwarz",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "Cargill Gilston Knott",
    "Peter Guthrie Tait",
    "Alexander Buchan",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}