{
  "nome_completo": "James Alexander McBride",
  "nome_curto": "James McBride",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McBride/",
  "data_nascimento": "December 1868",
  "local_nascimento": "Broughshane, Co. Antrim, Ireland",
  "data_morte": "6 September 1949",
  "local_morte": "Edinburgh, Scotland",
  "summary": "James McBride studied at Queen's College Belfast and then taught at various Glasgow schools finishing as Rector of Queen's Park School. He published a number of papers in Geometry and was a founder member of the Euclidean Club.",
  "biografia": "James McBride\n's name also appears as M'Bride and it was this latter form that he used on his publications. His university education was at Queen's College, Belfast. He was awarded a B.A. from the Royal University of Ireland, then was awarded a B.Sc. in Experimental Physics from the University of London in\n1898\n. It appears that his studies for the B.Sc. degree were at Queen's College, Belfast, and he sat the examinations set by the University of London. At this time the University of London offered examinations for external degrees aimed at students trained in other establishments. McBride had already been teaching in Scotland for two years before the award of the B.Sc.\nIn\n1896\nMcBride had been appointed as Mathematics Master at Allan Glen's School in Glasgow. He held this position until\n1919\nwhen he was appointed Headmaster of North Kelvinside Higher Grade School in Oxford Drive, Glasgow. He spent six years in this position before moving to Queen's Park School, Glasgow, where he was rector from\n1925\nto\n1929\nwhen he retired at the age of sixty.\nMcBride was a Founding Member of Euclidian Society in\n1926\n, being elected as its president in\n1930\nand continuing in this role until he was made Honorary Vice-President in\n1947\n. He was also a member of the\nEdinburgh Mathematical Society\n, being proposed for membership at the meeting on\n9\nDecember\n1904\nand, following the standard procedure, he became a member at the following meeting on\n13\nJanuary\n1905\n. He gave a paper at the first meeting of the Society's\n1905\n-\n06\nsession on\n10\nNovember\n1905\nin Edinburgh, the title being\nA trigonometric dial: a teaching appliance\n. In session\n1907\n-\n08\nhe gave the paper\nSchool apparatus for determining g\n; this was at a meeting of the Society on\n13\nMarch\n1908\nat the Technical College in Glasgow. He served on the Committee of the\nEdinburgh Mathematical Society\nfrom\n1908\nfor five years until\n1913\n. In\n1909\nhe published\nTwo illustrations of Newton's Third Law\nin the\nEdinburgh Mathematical Society\n's\nEdinburgh Mathematical Notes\n. This paper describes two experiments suitable for pupils to perform in a physics class at school. The first is a static experiment and the second a dynamic one. The dynamic one gives an experimental solution to, what McBride calls the 'Climbing Monkey Problem'\n[\n3\n]\n:-\nA monkey\n(\nweight\n30\nlbs\n)\ntries to climb a rope which passes over a pulley and carries a weight of\n30\nlbs at the other end. Describe the motion.\nMcBride writes\n[\n3\n]\n:-\nThe opinions of a class of\n40\nboys will generally be equally divided in favour of five or six different solutions, all wrong but one.\nIn\n1913\n, McBride attended the Mathematical Colloquium which was held in the Mathematical Department of Edinburgh University during the week beginning Monday\n4\nAugust\n1913\n. Unfortunately no record exists of all the participants in the\n1914\nMathematical Colloquium also held in Edinburgh. After World War I, the Colloquium did not restart until\n1926\nand from then on it was held in St Andrews and was known as the St Andrews Colloquium. McBride is not in the\n1926\nphotograph, but he did attend the\n1930\nColloquium, the\n1934\nColloquium and the\n1938\nColloquium. No Colloquiums were held during World War II and by the time it restarted in\n1951\n, McBride had died. He was elected a fellow of the Royal Society of Edinburgh on\n8\nMarch\n1926\n, his proposers being\nDugald Black McQuistan\n,\nThomas Murray MacRobert\n,\nSir Edmund T Whittaker\n, and W King Gillies.\nAn obituary, written by R A Robb, appears in the\nRoyal Society of Edinburgh\nYear Book of\n1950\n, page\n27\n. We give a version of this obituary at\nTHIS LINK\n.\nIn this obituary, Robb gives a description of McBride's character\n[\n4\n]\n:-\nMcBride was a brilliant and stimulating teacher, and those who knew him intimately recall with pleasure his unfailing kindness, courtesy and genial wit which bound to him a wide circle of friends. He loved mountaineering and motoring.\nFrom\n1938\nMcBride gave his address as the Scottish Liberal Club,\n109\nPrinces Street, Edinburgh. In the\n1940\ns he also gave the address Serpentine Avenue, Ballsbridge, Dublin. We have been unable to find a record of McBride's death in either Scotland or in Ireland, although its date is certain.\nWe mentioned above that McBride was a founding member of the Euclidean Society which had the aim to:-\n... stimulate interest in the teaching of mathematics, with particular reference to logical order as found in the geometry of Euclid.\nMcBride's interest in Euclidian geometry is well illustrated by his paper\nThe equal internal bisectors theorem,\n1840\n-\n1940\n. ... Many solutions or none? A centenary account\npublished in the\nEdinburgh Mathematical Notes\nin\nJanuary\n1943\n. This paper studies the history of a particular geometrical problem, namely the equal internal bisectors theorem. McBride begins his paper by writing:-\nThis paper contains\n(\ni\n)\na short history of the geometrical theorem proposed in\n1840\nby Professor Daniel Christian Ludolph Lehmus\n(1780\n-\n1863)\nof Berlin to\nJacob Steiner\n- \"If BJY, CJZ are equal bisectors of the base angles of a triangle ABC, then AB equals AC,\"\n(\nii\n)\na selection of some half-dozen solutions from the\n50\nor\n60\nthat have been given,\n(\niii\n)\nsome discussion of the logical points raised, and\n(\niv\n)\na list of references to the extensive literature of the subject. Incidentally two widely current legends will be cleared up,\n(\ni\n)\nthat\nJ J Sylvester\nin\n1852\nproved that a solution was impossible,\n(\nii\n)\nthat nevertheless a valid proof, the first, was given in\n1874\nby a Girl of the Golden West, a contemporary of Bret Harte and Mark Twain. Both these stories are \"much exaggerated.\"\nWe give further extracts from this paper, in particular we have extracted the historical comments, at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Dugald Black McQuistan",
    "Thomas Murray MacRobert",
    "Sir Edmund T Whittaker",
    "Royal Society of Edinburgh",
    "THIS LINK",
    "Jacob Steiner",
    "J J Sylvester"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}