{
  "nome_completo": "Jan Jansz de Jonge Stampioen",
  "nome_curto": "Jan Stampioen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stampioen/",
  "data_nascimento": "1610",
  "local_nascimento": "Rotterdam, Netherlands",
  "data_morte": "1690",
  "local_morte": "The Hague, Netherlands",
  "summary": "Jan Stampioen was a Dutch mathematician who published a work on spherical trigonometry.",
  "biografia": "Jan Stampioen\n's father was also named Jan Jansz Stampioen, so the subject of this biography was known as \"de Jonge\" or Jr. Jan Stampioen senior was a surveyor who made astronomical instruments. We know relatively little about the life of Jan Stampioen Jr, and essentially nothing about his early life, but he appears to have been brought up and educated in Rotterdam.\nStampioen taught mathematics in Rotterdam where, in\n1632\n, he published his own treatment of spherical trigonometry appended to\nvan Schooten\n's sine tables. In\n1633\nhe challenged\nDescartes\nto a public competition by giving him a geometric problem whose solution involved the solution of a quartic equation.\nDescartes\npresented a solution but it was rejected by Stampioen as not being complete. In fact Stampioen's criticism was fair for although\nDescartes\nhad taken the geometric problem and derived the correct quartic equation, he left the problem there without solving the quartic. Fair though Stampioen's criticism was, it was definitely unwise for he made an enemy of\nDescartes\nwho was a very powerful figure.\nIn\n1638\nStampioen moved from Rotterdam to The Hague on being appointed tutor to the twelve year old Prince William. This was an important position since William was first in line to succeed to stadtholder and captain general of six provinces of the Netherlands. William was the son of Frederick Henry, Prince of Orange, and he arranged William's marriage to Mary Henrietta Stuart, the eldest daughter of the English king Charles I of England. Mary was ten years old and William fifteen when they were married in May\n1641\n. William later became Prince of Orange on the death of his father in March\n1647\n. How successful Stampioen was in tutoring William, and whether this had any bearing on his years as Prince of Orange, we can only leave to the imagination. The move to the Hague to become tutor to William, however, set Stampioen on a new career for, while in The Hague, he opened a printing shop in which he printed his own writings on mathematics.\nIn\n1639\nStampioen published\nAlgebra or the New Method\n, a work which he had written while still teaching in Rotterdam. The problem which Stampioen was interested in came as a consequence of using the\nCardan\n-\nTartaglia\nformula to solve\ncubic equations\n. This formula involved taking the cube root of expressions such as\na\n+\n√\nb\na + √b\na\n+\n√\nb\n, both in the case where\nb\nb\nb\nis positive and negative. Stampioen let this cube root be\nA\n+\n√\nB\nA + √B\nA\n+\n√\nB\n, where\na\n,\nb\n,\nA\na, b, A\na\n,\nb\n,\nA\nand\nB\nB\nB\nare all natural numbers. Then cubing both sides gives\na\n+\n√\nb\n=\nA\n3\n+\n3\nA\n2\n√\nB\n+\n3\nA\nB\n+\nB\n√\nB\na + √b = A^{3} + 3A^{2}√B + 3AB + B√B\na\n+\n√\nb\n=\nA\n3\n+\n3\nA\n2\n√\nB\n+\n3\nA\nB\n+\nB\n√\nB\nequating the natural numbers gives\na\n=\nA\n3\n+\n3\nA\nB\na = A^{3} + 3AB\na\n=\nA\n3\n+\n3\nA\nB\nand equating the surds gives\n√\nb\n=\n(\n3\nA\n2\n+\nB\n)\n√\nB\n√b = (3A^{2} + B)√B\n√\nb\n=\n(\n3\nA\n2\n+\nB\n)\n√\nB\n. We will return in a moment to the question of whether this is correct. He then went on to give a method of finding\nA\nA\nA\nand\nB\nB\nB\n.\nHe then posed two further public challenges under the alias of John Baptista of Antwerp involving the solution of cubics. One of these problems was to find the correct position to place a siege gun so seemed of particular practical importance.  Having posed the problems as if by John Baptista of Antwerp, he then proceeded to give solutions to the problems under his own name, using his methods for finding the cube root of\na\n+\n√\nb\na + √b\na\n+\n√\nb\n. Clearly it was a publicity stunt to publicise his book. If this sounds like a particularly modern approach to selling, then let us simple say that human nature does not seem to have changed much over the centuries!\nA young surveyor Waessenaer solved the first of John Baptista's\n(\nStampioen's\n)\nproblems, using a rule due to\nDescartes\n. Since we know that\nDescartes\ndescribed his rule in a letter to Waessenaer written on\n1\nFebruary\n1640\n, it looks as though\nDescartes\nwas probably out to discredit Stampioen and realised that it would be even more telling if it came from a relatively unknown mathematician. Stampioen rejected Waessenaer's solution which prompted Waessenaer to reply with a broadly based attack on the mathematics contained in Stampioen's\nAlgebra or the New Method\n. The argument was adjudicated by van\nSchooten\nwho favoured Waessenaer.\nDescartes\nalso became publicly involved in the argument, although it does look as though he was always behind Waessenaer.\nWas Stampioen correct? Well if we look at what he was trying to do, it was to do his arithmetic in the ring\nZ\n[\n√\nb\n]\n\\mathbb{Z}[√b]\nZ\n[\n√\nb\n]\n.\nDescartes\n(\nand Waessenaer's\n)\ncriticisms are valid - he needs\nb\nb\nb\nto be square free etc.\nDescartes\n' method also starts off with an observation which we now easily see is true in\nZ\n[\n√\nb\n]\n\\mathbb{Z}[√b]\nZ\n[\n√\nb\n]\n, namely\na\n+\n√\nb\na + √b\na\n+\n√\nb\nhas a cube root only if\na\n2\n−\nb\na^{2} - b\na\n2\n−\nb\nis a cube. This, again in modern terms, says that the norm of\na\n+\n√\nb\na + √b\na\n+\n√\nb\nmust be a cube, which is true since the norm is multiplicative.\nDescartes\nthen goes on to find approximate values and ends up taking integer parts. The paper\n[\n2\n]\ncontains interesting observations on this argument and contains a French translation of Stampioen's method of finding the cube roots of\na\n+\n√\nb\na + √b\na\n+\n√\nb\nas well as letters of\nDescartes\nto\nMersenne\non\n30\nSeptember\n1640\nin which he criticises Stampioen's method. In this paper the author describes the origin of\nDescartes\n' rule and explains why it works.\nIn\n1644\nStampioen was employed to tutor\nHuygens\nand his brother in mathematics. This may be seen as slightly surprising given that\nHuygens\n' father Constantijn Huygens had corresponded with Descartes and the two agreed that Stampioen's behaviour during the dispute had been bad. It may indicate that\nDescartes\nactually had a higher opinion of Stampioen than that which he showed in public.\nLittle else is known about Stampioen. He published a topographical map in\n1650\nand, were it not for the fact that he is mentioned as being a member of a panel set up to adjudicate a proposed solution to the longitude problem in\n1689\n, we might have wrongly supposed that he died  shortly after\n1650\n. As it is, given that he was\n79\nin\n1689\n, we have assumed that he did not live long after that - in other words the date of his death that we have given is a pure guess based on his age and the knowledge that he was certainly alive in\n1689\n.",
  "matematicos_citados_na_biografia": [
    "van Schooten",
    "Descartes",
    "Cardan",
    "Tartaglia",
    "cubic equations",
    "Schooten",
    "Mersenne",
    "Huygens"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}