{
  "nome_completo": "Jean Beaugrand",
  "nome_curto": "Jean Beaugrand",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beaugrand/",
  "data_nascimento": "about 1590",
  "local_nascimento": "Paris, France",
  "data_morte": "22 December 1640",
  "local_morte": "Paris, France",
  "summary": "Jean Beaugrand was a French mathematician who published works on Geostatics as well as mathematics.",
  "biografia": "Jean Beaugrand\nwas, it is believed, the son of Jean Beaugrand who was an author of the works\nLa paecilographie\nⓉ\n(\n?? Shorthand writing ??\n)\n(1602)\nand\nEscritures\nⓉ\n(\nWritings\n)\n(1604)\nand the calligraphy teacher to Louis XIII who was king of France from\n1610\nto\n1643\n. Very little is known about the life of Jean Beaugrand, the subject of this biography, and what we do know has been pieced together from references to him in the correspondence of\nDescartes\n,\nFermat\nand\nMersenne\n. It is said that he was a pupil of\nViète\nbut since\nViète\ndied in\n1603\nthis must have been at a very early stage in Beaugrand's education.\nThe beginning of the seventeenth century was a period when mathematicians began to see the benefits of knowing about the work of others and a network grew up in France of mathematicians meeting, corresponding, and generally motivating each other to make further discoveries. Beaugrand was certainly part of this network from a very early stage which, after\n1619\n, became centred around\nMersenne\nand he frequently attended meetings in\nMersenne\n's cell in Paris.\nIn Bordeaux there was a small circle of lovers of mathematics with men like d'Espagnet, Philon and Prades all being mentioned in\nFermat\n's correspondence. Étienne d'Espagnet was the son of Jean d'Espagnet, the president of the Bordeaux parliament, and was a friend of\nViète\n. Beaugrand, as a pupil of\nViète\n, would have known of d'Espagnet and the Bordeaux group, and afterwards he became friends with d'Espagnet.\nFermat\nprobably met Beaugrand for the first time in Orléans in August\n1626\n. It is thought that he advised\nFermat\nto settle in Bordeaux because of the mathematical life of the city. Beaugrand corresponded frequently with\nFermat\nafter he was in Bordeaux and it is through this correspondence that\nFermat\n's work became known in Paris. Certainly Beaugrand always acted as if he had discovered\nFermat\nand proudly reported his achievements to\nMersenne\nand he also reported on\nFermat\n's work when he travelled to Italy and met many Italian mathematicians. We know that at least five years before this Italian trip of\n1635\nBeaugrand had made a visit to England.\nIn\n1630\nBeaugrand became a Court Official, being named mathematician to Gaston duc d'Orleans. Gaston, the third son of King Henry IV, had been made Duke of Orleans in\n1626\nafter his marriage to Marie de Bourbon-Montpensier. However he soon came into conflict with Louis XIII and a military conflict resulted. He fled to Lorraine in\n1631\n, then to the Spanish Netherlands in\n1632\n. As with many mathematicians in this period Beaugrand's life was greatly affected by wars and the fate of his employer. Certainly he moved in high political circles in Paris, and was considered highly for his mathematical abilities. In\n1634\nhe was appointed to the committee which was set up by Cardinal Richelieu to evaluate\nJean-Baptiste Morin\n's solution to the longitude problem by measuring absolute time from the position of the Moon relative to the stars.\nÉtienne Pascal\n,\nMydorge\n,\nHérigone\n, J C Boulenger and L de la Porte served on the committee along with Beaugrand and they were in dispute with\nMorin\nfor the five years after he made his proposal.\nBeaugrand met\nHobbes\non a number of occasions, and\nDescartes\nrecords that the two met in\nMersenne\n's cell in Paris in\n1634\nand\n1637\n. Between these two dates, in\n1635\n, Beaugrand went to Italy along with the French ambassador Bellièvre and his party. At this time Beaugrand was holding the office of secretary to the king. As always when he was travelling, he made a special effort to meet with mathematicians. He visited\nCavalieri\nin Bologna,\nCastelli\nin Rome, and\nGalileo\nin his home at Arcetri near Florence. He corresponded with all three of these mathematicians after he returned to Paris in February\n1636\n.\nBeaugrand published\nGeostatique\nin\n1636\nand also published on mathematics. As well as mathematics, he was interested in astronomy. He observed eclipses and other astronomical events. By the time he published\nGeostatique\n, however, he was out of favour with most of the French mathematicians although the work was well received by the Italian mathematicians who seemed particularly impressed with him. There is little wonder that he was not in favour among the French mathematicians for he had attacked the work of\nDesargues\nand published a series of pamphlets attacking the work of\nDescartes\n. In fact earlier he had been a friend of\nDesargues\nbefore he had a dispute with him. By this time even his close friend\nFermat\nhad become rather distant.\nBeaugrand claimed that\nDescartes\n' work was copied from\nHarriot\n. It seems unlikely that this claim is true although many historians still argue over how much\nHarriot\ninfluenced the work of others. It was not the custom of the time to acknowledge sources of ideas as it is today so it is possible that Beaugrand's claim is at least in some small degree true. A letter from Beaugrand to\nDesargues\nwritten on\n25\nJuly\n1639\ndefended the classical methods.",
  "matematicos_citados_na_biografia": [
    "Descartes",
    "Fermat",
    "Mersenne",
    "Viète",
    "Jean-Baptiste Morin",
    "Étienne Pascal",
    "Mydorge",
    "Hérigone",
    "Morin",
    "Hobbes",
    "Cavalieri",
    "Castelli",
    "Galileo",
    "Desargues",
    "Harriot"
  ],
  "imagens": [
    "beaugrand.jpg"
  ]
}