{
  "nome_completo": "Jerzy Maria Michał Łoś",
  "nome_curto": "Jerzy Łoś",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Los/",
  "data_nascimento": "22 March 1920",
  "local_nascimento": "Lwów, Poland (now Lviv, Ukraine)",
  "data_morte": "1 June 1998",
  "local_morte": "Warsaw, Poland",
  "summary": "Jerzy Łoś was a Polish mathematician, logician, economist, and philosopher. He is especially known for his work in model theory.",
  "biografia": "Jerzy Łoś\n's parents were Zygmunt Łoś\n(5\nMarch\n1887\n-\n28\nDecember\n1936)\n, son of August Łoś and Maria Pietruska, and Zofia Augusta Rostworowska\n(19\nJune\n1900\n-\n4\nMarch\n1962)\n, daughter of Władysław Rostworowski and Zofia Siemiginowska. Zygmunt, who was a\n29\nyear old Doctor of Laws, and Zofia, who was\n16\nyears old, were married in\n1916\n. In\n1919\nZofia, who had studied plant science, inherited a large agricultural estate in Torskie, a small town near Zalishchyky. Torskie was, at this time, in the Podolia region of Poland but it is now in the west of Ukraine. Zygmunt and Zofia Łoś had two children, Jerzy Maria Michał Łoś, the subject of this biography, and Władysław Maria Michał Łoś. The family moved to Torskie where the production of fruit on the estate was changed to make it a major wine producer in the\n1930\ns. In addition to looking after the estates, Zofia Łoś was a local government councillor, president of the school council in Torskie, and held other roles in health insurance and agricultural organisations. In\n1925\n, she was co-founder of a publishing company which published agricultural material.\nJerzy Łoś completed his primary and secondary education in\n1937\nbut, one year before that, tragedy struck the family when his father was killed. On\n28\nDecember\n1936\nZygmunt Łoś died in a plane crash near Susiec, a village in eastern Poland. The LOT Polish Airlines Lockheed\n10\nA Electra had taken off from Lwów with ten passengers and two crew. In the crash, due to icing, Zygmunt Łoś, one other passenger Jósef Zimmermann and one of the two members of the crew Jósef Fronc, were killed.\nIn\n1937\nŁoś entered the Jan Kazimierz University of Lwów where he began studying medicine, then philosophy and chemistry. After two years of study at university, things changed very dramatically with the outbreak of World War II. On\n1\nSeptember\n1939\nGerman troops entered Poland and the German Luftwaffe began bombing all strategically important sites. By\n4\nSeptember they were within\n60\nkm of Warsaw. On\n22\nSeptember, Russian troops entered Poland occupying Lwów. Łoś and his mother moved to Trzebień, a small village, where they lived with one of their relatives. Władysław  Łoś, the brother of our mathematician, had fled on\n17\nSeptember\n1939\n, before the Russian invasion, and moved to France where he changed his name to Michel de Los.\nIn April\n1940\nŁoś and his mother moved from Trzebień to Tarnogóra, a village near Zamość, where they lived with another relative. After Poland surrendered in September\n1939\nit was partitioned between Germany and Russia. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union held until\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. Łoś had been in a region controlled by the Soviets but, after the German invasion, it was German troops that controlled the region Łoś was living in. He had to earn his living, and he did this by taking a position as a clerk at the sugar plant in Lublin in\n1942\n. He remained there until\n1943\nwhen he became a bookkeeper for an estate in Tarnogóra. By\n1944\nthe Soviet armies had driven the Germans out and the Yalta Conference in February\n1945\nsaw parts of Poland\n(\nsuch as Lwów\n)\nbecome part of the Ukraine while Lublin remained in Poland.\nIn\n1945\nŁoś married Maria Dux; they had two sons Zygmunt Łoś\n(\nborn\n10\nJune\n1946)\nand Władysław Łoś\n(\nborn\n21\nMarch\n1955)\n. With the end of World War II, he resumed his studies at the Maria Sklodowska-Curie University in Lublin in\n1945\nstudying mathematics and philosophy, and in\n1947\nhe was awarded a master's degree in philosophy after submitting his thesis\nThe foundations of a methodological analysis of Mill's method\n(\nPolish\n)\n. He had already published\nAn attempt to axiomatise traditional logic\n(\nPolish\n)\nin\n1946\nin which, following the general ideas of\nIvan Sleszyński\nin\nThe Theory of Proof\n(1925)\n, he analysed traditional logic, and especially laws of immediate inference, by means of relations between extensions of arguments.\nAfter the award of his Master's Degree, Łoś moved to Wrocław, where a very active group of mathematicians, including\nHugo Steinhaus\n,\nBronisław Knaster\nand\nEdward Marczewski\n, started to build a new department.\nSteinhaus\n, in particular, greatly influenced the direction that Łoś's research would take. Łoś was appointed first as an assistant in the Department of Physics at Wrocław and then as an assistant in the Department of Logic there. He undertook research for his Ph.D. with\nJerzy Słupecki\n(1904\n-\n1987)\nas his advisor.\nSłupecki\nhad been a student of\nJan Łukasiewicz\nand had completed his Ph.D. just before the outbreak of World War II. Łoś was awarded his Ph.D. in\n1949\nfor his thesis\nOn logical matrices\n(\nPolish\n)\n. This was published as a\n42\n-page monograph which was reviewed by Jan Kalicki\n[\n3\n]\n:-\nThe monograph is divided into four chapters: I. Introductory definitions and theorems. Theory of matrices of\nLindenbaum\n. II. Some consequences of the theory of\nLindenbaum\n's matrices. III. On definability of logical functors in terms of each other. Theory of functional matrices. IV. Algebraic matrices. .... It is not easy to give an adequate account of the results contained in Łoś's monograph in a short review. It seems impossible to give any account of the author's interesting methods. Even in the space of forty-two pages the author was compelled to give only a sketchy account of many of his remarkable results. This makes the reading of his work not easy. ...\n[\nIt\n]\nimpressed the reviewer as substantial progress in the study of logical and algebraic matrices. In the reviewer's opinion Łoś's work is of very real value.\nIn the same year,\n1949\n, Łoś joined the Real Functions group in the Mathematical Institute of the\nPolish Academy of Sciences\nand continued to hold various positions in the Institute, in parallel to his university posts, until he retired in\n1991\n. He remained at Wrocław until\n1952\nwhen he was sent to the\nNicolaus Copernicus\nUniversity in Toruń to create an algebra group there. In the same year he was appointed as Head of the Algebra group in the Mathematical Institute of the\nPolish Academy of Sciences\n. His main contributions to algebra are in the area of Abelian groups. While working at Toruń, he was awarded a doctorate\n(\nequivalent to a D.Sc. or\nhabilitation\nin standard\n)\nin\n1955\nfrom the Mathematical Institute of the\nPolish Academy of Sciences\n. For this degree he submitted two papers,\nThe algebraic treatment methodology of elementary deductive systems\n(1955)\nand\nOn the extending of models\n(1955)\n. One of the mathematical concepts which has proved extremely fruitful is that of an ultraproduct. This was introduced by Łoś in the first of these two papers in which\n[\n1\n]\n:-\n... the general reduced product construction is introduced and the fundamental theorem relating the theory of ultraproduct to the theories of factors is\n(\nimplicitly\n)\nstated.\nŁoś married his second wife, Maria Wycech\n(1929\n-\n2011)\n, the daughter of Czesław Wycech\n(1899\n-\n1977)\nand Anna Kasprzyk\n(1899\n-\n1989)\n. Czesław Wycech was a Member of the Polish Parliament from\n1947\nto\n1971\n. Maria, who used the name Wycech-Łoś after her marriage, was a writer and mathematician who wrote a number of joint papers with her husband:\nRemarks on the efficiency frontiers in von Neumann models\n(1976)\n,\nExtremal properties of equilibria in von Neumann models\n(1977)\n, and\nMany agents in a von Neumann model\n(1979)\n. They also co-edited conference proceedings:\nMathematical Methods in Economics\n(1974)\n,\nComputing Equilibria: How and Why?\n,\n(1976)\n, and\nWarsaw Fall Seminars in Mathematical Economics\n(1976)\n.\nIn\n1961\nŁoś moved from Toruń to Warsaw where he lectured at the University and worked at various Institutes of the\nPolish Academy of Sciences\n: the Institute of Philosophy; the Institute of Mathematics; and, towards the end of his career, the Institute of Computer Science. His move to Warsaw also saw a major change in his research interests. Up to that time he had worked on the foundations of mathematics and on algebra. However, the move to Warsaw saw him become interested in the applications of mathematics, particularly to economics. Let us look briefly at his contributions to these areas.\nHis first work was on the foundations of mathematics and he published papers such as:\nMany-valued logics and the formalization of intensional functions\n(\nPolish\n)\n(1948)\nwhich gives an example of a consistent intensional system of logic;\n(\nwith\nC Ryll-Nardzewski\n)\nOn the application of Tychonoff's theorem in mathematical proofs\n(1951)\nwhich uses the\nTychonoff\nproduct theorem\n(\nthe product of compact spaces is compact\n)\nas a substitute for the axiom of choice; and\nAn algebraic proof of completeness for two-valued propositional calculus\n(1951)\nwhich shows the completeness of the two-valued propositional calculus with an algebraic proof.\nFrom\n1954\nhis work on the foundations of mathematics took him towards algebra with papers such as\nSur le théorème de Gödel pour les théories indénombrables\nⓉ\n(\nOn Gödel's theorem for uncountable theories\n)\n(1954)\nwhich proves, without using the axiom of choice, the equivalence between the\nGödel\n-\nMalcev\ncompleteness theorem and the existence of prime ideals in Boolean algebra; and\n(\nwith\nC Ryll-Nardzewski\n)\nEffectiveness of the representation theory for Boolean algebras\n(1954)\nwhich examines when the existence of prime ideals in Boolean algebras is equivalent to the axiom of choice.\nBy\n1955\nŁoś was publishing work entirely within the area of algebra such as\nOn the complete direct sum of countable abelian groups\n(1955)\nwhich proves:-\nA complete direct sum of countable abelian torsion-free groups is decomposable into a discrete direct sum of countable groups if and only if every summand, with at most finitely many exceptions, is a divisible group.\nIn the same year of\n1955\nŁoś published\nOn the axiomatic treatment of probability\nwhich looks at the mathematical foundations of probability. However, he continued to work on the foundations of mathematics publishing in the same year the major\n62\n-page paper\nThe algebraic treatment of the methodology of elementary deductive systems\nwhich contains a careful look at\nGödel\n's completeness theorem as well as some related new results and new proofs of known results.\nAlthough Łoś worked in different areas, there were common threads to his approach\n[\n1\n]\n:-\nA characteristic feature of the entire Łoś's research activity is his ability to find very natural links between problems and methods of various domains of mathematics. This tendency can be seen clearly also in his later works devoted to mathematical methods of economy.\nOne of the areas of mathematical economics that Łoś studied was associated with\nvon Neumann\nmodels consisting of pairs of matrices containing production process data. For example he published\nA simple proof of the existence of equilibrium in a von Neumann model and some of its consequences\n(1971)\n,\nExtended von Neumann models and game theory\n(1976)\n, and\nMathematical theory of von Neumann economic models. Report on recent results\n(1978)\n.\nHe made long visits to several universities abroad including: the University of California at Berkeley\n(1959\n-\n60)\nwhen, in collaboration with\nAlfred Tarski\n, he ran a model theory seminar; again the University of California at Berkeley\n(1962\n-\n3)\nwhen, in collaboration with Bjarni Jónsson, he ran a universal algebra seminar; Aarhus University in Denmark\n(1967)\nwhen he lectured on mathematical methods in economics; the\nPoincaré\nInstitute in Paris\n(1969)\nwhen he lectured on the theory of economic models; Yale University\n(1973)\nwhen he lectured on applications of mathematics to economics; and the University of Wisconsin\n(1978\n-\n79)\nwhen again he lectured on applications of mathematics to economics.\nLeszek Pacholski tells us something of Łoś's character in\n[\n4\n]\n:-\nŁoś was a gifted mathematician with many original ideas, and a talented organizer. He was also a man of strong convictions, convictions that he was not willing to compromise for the sake of political expedience. He spoke out against decisions he felt were wrong, even when many others chose to keep quiet. When \"Solidarity\" started its fight for freedom and independence in Poland, he often provided workers with advice and ideas. With his passing Poland has lost a focal point of its scientific and intellectual life, and a forceful advocate for human rights.\nSimilar sentiments are recorded by the authors of\n[\n1\n]\n:-\nProfessor Łoś profoundly influenced his students, colleagues and all those who had the chance to meet him. His enthusiasm for scientific work turned out to be contagious, as can be seen with his numerous followers, many of them professors in mathematics or economics themselves by now. A  broadminded man, he was known by his independent and courageous standpoints, which brought him to actively support the \"Solidarity\" movement in the early\n1980\n's; his opinions and views were highly appreciated by many of those who met him, even if they differed from their own.\nŁoś received many honours during his career including the Cross of Merit, Polonia Restituta, the Award of the Secretary of the\nPolish Academy of Sciences\nfor achievements in mathematical economics,\nSierpinski\nMedal, and the Jurzykowski Award for activity in the Solidarity movement. In\n1995\nhe received an honorary doctorate from the University of Hagen in Germany. In\n1964\nhe was elected a corresponding member of the\nPolish Academy of Sciences\nand in\n1983\nhe became a full member.\nIn the spring of\n1996\nŁoś suffered a stroke which he survived but lived with a serious condition for the final two years of his life.",
  "matematicos_citados_na_biografia": [
    "Ivan Sleszyński",
    "Hugo Steinhaus",
    "Bronisław Knaster",
    "Edward Marczewski",
    "Steinhaus",
    "Jerzy Słupecki",
    "Słupecki",
    "Jan Łukasiewicz",
    "Lindenbaum",
    "Polish Academy of Sciences",
    "Nicolaus Copernicus",
    "habilitation",
    "C Ryll-Nardzewski",
    "Tychonoff",
    "Gödel",
    "Malcev",
    "von Neumann",
    "Alfred Tarski",
    "Poincaré",
    "Sierpinski"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}