{
  "nome_completo": "Joel Evans Hendricks",
  "nome_curto": "Joel E Hendricks",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hendricks/",
  "data_nascimento": "10 March 1818",
  "local_nascimento": "Hilltown, Bucks county, Pennsylvania, USA",
  "data_morte": "8 June 1893",
  "local_morte": "Des Moines, Iowa, USA",
  "summary": "Joel E Hendricks was an American mathematician important as the founder of The Analyst journal.",
  "biografia": "The first puzzle with\nJoel E Hendricks\nis his middle name. We note that some sources give Hendricks middle name as Emanuel but this must be an error since his middle name is given as Evans in the\n1892\nlist of members of the\nAmerican Mathematical Society\n[\n8\n]\n, as the author of Problem\n238\nin the\n1890\nvolume of the\nMathematical Visitor\n[\n9\n]\n, and in the autobiographical note in The\nMathematical Messenger\n[\n7\n]\n. He seems to have almost always given his name as Joel E Hendricks. It is also somewhat unclear exactly where he was born with most sources giving Bucks county which does not pin it down very precisely\n(\nsee for example\n[\n2\n]\n)\n. We assume that he was actually born on a farm so there may be no town or village to give as a birthplace. However, Hendricks himself in his autobiography\n[\n7\n]\ngives his place of birth as Berks County. We note that Bucks Co. and Berks Co. are both in Pennsylvania\n(\nand relatively close\n)\nbut we have been unable to determine which is correct. His parents were William King Hendricks\n(1791\n-\n1862)\n, the son of Henry Hendricks and Elizabeth Konig, and Catherine Moyer Detweiler. Joel, writing about is ancestors, states that \"his family immigrated from Holland to New Jersey\" so it appears that he was of Dutch ancestry. Joel had five siblings, Jacob, John, John F, Maria Anne \"Mary\", and Henry.\nHendricks gives more details of his early life in his autobiogrphy which you can read at\nTHIS LINK\n.\nWhen Joel was two years old, in\n1820\n, the family moved to Westmoreland County, Pennsylvania. Four years later, in\n1824\n, when Joel was six years old, the Hendricks family moved from Westmoreland County to Columbiana county, Ohio, where they farmed the land. Joel lived on the Columbiana county farm until the autumn of\n1836\n, by which time he was eighteen years old. During these years Joel and his brothers had worked alongside their father helping with the work on the farm. He had spent short periods of time at school but he reached the age of eighteen having received little more education than learning to read, write and count. Despite having little formal education, he showed himself quite expert in arithmetical calculations and developed a love of mathematics. In the autumn of\n1836\nhe became a teacher and taught for a year in Ohio. In\n1837\nhe obtained his father's permission to take on a two-year apprenticeship as a mill-wright in St Charles County, Missouri. However, he managed to agree a contract which allowed him not to work as an apprentice mill-wright during the winters so that he had time to be able to continue as a teacher.\nThe first winter of his apprenticeship, he was given time off as had been agreed to teach. It was on this occasion that luck played a part that led Hendricks to a different career. This luck was that, when teaching at this school, he came across two books that fascinated him. One was John Hamilton Moore's\nThe New Practical Navigator and Daily Assistant\nand the other was Tobias Ostrander's\nThe planetarium and astronomical calculator\n. John Hamilton Moore\n(1738\n-\n1807)\n, born in Edinburgh, Scotland and educated in Ireland, had established a Nautical Academy in Brentford, Middlesex, England in\n1770\nand published his\nPractical Navigator\ntwo years later. The book, which was also published in the United States in\n1799\n, ran to around\n20\neditions\n(\nthe\n20\nth\nbeing many years after Moore's death\n)\n. The book contained many minor errors in the tables that it presented but, in many ways, this did not distract from its usefulness. Tobias Ostrander writes in the Preface of his book:-\nIn presenting the following pages to the public, I will briefly mark that the people generally are grossly ignorant in the important and engaging science of Astronomy. Scarcely one in a county is found capable of calculating with exactness and accuracy the time of an eclipse, or conjunction and opposition of the Sun and Moon. Is it for lack of abilities? No. - There are no people in the world who possess better natural faculties for acquiring knowledge of every description than those who inhabit the United States of America. ... I now present to this enlightened community a volume within the means of almost every person; containing all the essential parts of Astronomy ...\nOne can just imagine how Hendricks reacted to reading these words. Here was a young man, thirsty for knowledge, being told that all he needed to do was to study Ostrander's book and he could learn all these things. He began to devote all his spare time to reading the two books. From them he learnt trigonometry and, as Ostrander had claimed, he soon became expert enough to calculate \"with exactness and accuracy the time of an eclipse, or conjunction and opposition of the Sun and Moon.\"\nAfter completing his apprenticeship in St Charles County, Missouri, he returned to Ohio in the summer of\n1839\n. He again taught during\n1839\n-\n40\nand again it was a book that he found which led him to further study of mathematics. This book was\nA treatise on the elements of algebra\nby Berwick Bridge. This book was first published in England, but an American edition\n(\ntaken from the\n6\nth\nLondon edition\n)\nwas published in\n1832\n. Bridge, who had studied at St Peter's College, Cambridge, writes:-\nIn this work the hitherto abstract and difficult science of Algebra is simplified and illustrated so as to be attainable by the younger class of learners, and by those who have not the aid of a teacher.\nAgain here was exactly the encouragement that Hendricks need to study the subject on his own. He devoted two hours each night for five weeks to reading this book and by the end of that time he had solved all the examples in the textbook.\nAbijah McLean\n(1800\n-\n1870)\nwas a Columbiana county official with responsibilities for surveying. McLean was interested in mathematics and had investigated the problem of finding all square numbers containing each of the nine digits\n1\n,\n2\n, ...,\n9\nexactly once in some order. For example,\n152843769\n=\n1236\n3\n2\n152843769 = 12363^{2}\n1\n5\n2\n8\n4\n3\n7\n6\n9\n=\n1\n2\n3\n6\n3\n2\n. McLean found\n27\nsuch numbers and believed he had found them all but, in fact, he missed three. Hendricks visited McLean in the spring of\n1840\nand the two soon became close friends. McLean taught Hendricks some interesting mathematics but more than that, he had an excellent mathematics library from which Hendricks was able to borrow and read books such as\nCharles Hutton\n's\nA Course of Mathematics\n, Isaac Newton's\nPrincipia Mathematica\n, and\nNathaniel Bowditch\n's translation of\nLaplace\n's\nMécanique Céleste\n.\nHendricks decided in\n1840\nthat he would train to become a medical doctor. He began reading medical books preparing to enter medical school but still taught each winter to earn enough money to support himself. In the spring of\n1843\nhe went to western Ohio where he intended to make money giving medical advice. His aim was to build up enough financial reserves so that he might begin his studies at a medical college. He married Leah Shelley Gish\n(1825\n-\n1915)\nin Williams County, Ohio, on\n28\nJanuary\n1843\n. Leah Gish was the daughter of Abraham Gish and Elizabeth Shelley. Leah and Joel Hendricks had nine children, one son and eight daughters\n)\n: Franklin Benjamin\n(1843\n-\n1862)\n, Francis Eliza\n(1845\n-\n)\n, Louisa Jane\n(1847\n-\n1919)\n, Elmira Celestia\n(1849\n-\n1938)\n, Cornelia Ann\n(1852\n-\n1938)\n, Alice Martha\n(1855\n-\n1938)\n, Rosa Marian\n(1857\n-\n1876)\n, Clara\n(1860\n-\n1948)\n, and Daisy\n(1867\n-\n1867)\n. Franklin Benjamin Hendricks was killed in the American Civil War. Following his marriage, Hendricks found that he neither had the time nor the financial means to attend medical college so he gave up on the idea. However, he did continue to give medical advice for several years. In the\n1850\ncensus he was living in Auburn in DeKalb County, Indiana and he gave his occupation as physician.\nAlong with a number of others, Hendricks founded Newville Academy in the town of Newville, DeKalb County. He was appointed as a teacher of mathematics at Newville Academy and he taught there for two years. We note that Hendricks was still in Auburn when his daughter Cornelia Ann was born on\n21\nFebruary\n1852\nbut by the time his daughter Alice Martha was born on\n4\nFebruary\n1855\nthe family had moved to Newville.\nFrancis M Case, was appointed the first Surveyor General of Colorado on\n5\nApril\n1861\n. The first survey contract granted by Case was to Hendricks, who was living in Newville, Indiana, at that time. Hendricks was appointed as Deputy Surveyor and given the 'First Standard Parallel South' survey, the 'Second Standard Parallel South' survey and the 'Third Standard Parallel South' survey in the state of Colorado which he completed in September\n1861\n. He completed the 'Exterior Boundaries' survey on\n23\nOctober\n1861\n. The American Civil War began in April\n1861\nand Hendricks became a surgeon of an Indiana regiment. After serving for about eight months he was wounded and discharged on account of his disability. In the autumn of\n1864\nthe Hendricks family left DeKalb County and moved to Des Moines, Polk County, Iowa. Again Hendricks became involved in surveying and until\n1873\nhe undertook such work. However, Hendricks had spent his whole life with a great love for mathematics and in\n1873\nhe founded a mathematics journal which he named\nThe Analyst\n.\nThe\n1\nst  part of the\n1\nst  volume of\nThe Analyst\nappeared in January\n1874\n. In his 'Introductory Remarks' which appeared in this first part Hendricks writes that:-\n... it is intended to afford a medium for the presentation and analysis of any and all questions of interest or importance in pure and applied Mathematics, embracing especially all new and interesting discoveries in theoretical and practical astronomy, mechanical philosophy, and engineering.\nFor a version of these 'Introductory Remarks' see\nTHIS LINK\n.\nThe first few papers in the first part were:\nOn the Relative Positions of the Asteroidal Orbits\n;\nThe Recurrence of Eclipses\n;\nOperations on Imaginary Quantities Considered Geometrically\n; and\nEquations of Differences\n. Among the papers in the second part of this first volume was\nTo Find the Area Common to Two Intersecting Circles\nby\nArtemas Martin\nwhile the third part contained the paper\nProblem Relating to the Determination of Circular Orbits\nby\nGeorge W Hill\n.\nHill\nbecame a frequent contributor to\nThe Analyst\nand published many papers in it. It is worth noting that\nChristine Ladd\ncontributed a paper to the March part of the second volume with the title\nCrelle\n's Journal\n. She ends a review of the contents of a recent part of\nAugust Crelle\n's\nJournal for pure and applied Mathematics\nby writing:-\nIt is not greatly to the credit of the mathematicians of the vicinity that '\nCrelle\n's Journal' lies on the shelves of the Boston Public Library with uncut leaves; unless, indeed, we are to suppose that all who give themselves to mathematics are so rich that they can afford to take the Journal for themselves. Certainly none who hope to extend the boundaries of the science can afford to do without their\nCrelle\n.\nHendricks continued to edit\nThe Analyst\nfor ten years but, due to declining health, he ended publication with the final part of Volume\n10\nin November\n1883\n. For his\nAnnouncement\nof the closing of the journal see\nTHIS LINK\n.\nThrough his hard, energetic work as the editor of\nThe Analyst,\nHendricks gained international fame. In his\nAnnouncement\nHendricks was unable to announce who would take over publication of the journal as negotiations were still not finalised. However, it was soon agreed that Ormond Stone of the University of Virginia would take over and the journal was renamed the\nAnnals of Mathematics\n. The first part of the\nAnnals of Mathematics\nappeared in March\n1884\nso there was no break in publication between\nThe Analyst\nand its replacement. In\n1899\nthe\nAnnals of Mathematics\nwas transferred to Harvard University, and in\n1911\nto Princeton University. In\n1933\nit was agreed that the\nAnnals of Mathematics\nbe edited jointly by Princeton University and the Institute for Advanced Study, an arrangement which continues to this day.\nIn\n1865\nHendricks received an honorary degree from Indiana State University. In\n1880\nhe was elected to the American Association for the Advancement of Science, becoming a fellow in\n1885\n. In\n1891\nhe was elected a member of the\nNew York Mathematical Society\n, a few years before that society had changed its name to the\nAmerican Mathematical Society\n.\nJohn Marvin Colaw\n(1860\n-\n1939)\nwrites in\n[\n2\n]\n:-\nAfter the discontinuance of 'The Analyst', Dr Hendricks continued to manifest his interest in mathematical subjects by frequent contributions to other periodicals, and his writing always commanded wide respect. Though gifted beyond the ordinary, Dr Hendricks was modest to a fault, and thought little of self or self interest. His life was characterized by candour, modesty, and devotion to the truth. Dr Hendricks had been in failing, health for some time, but was not considered dangerously ill, until a few hours before his death. He passed away surrounded by his family ...\nHendricks was buried in Woodland Cemetery, Des Moines, Polk County, Iowa.",
  "matematicos_citados_na_biografia": [
    "American Mathematical Society",
    "THIS LINK",
    "Charles Hutton",
    "Nathaniel Bowditch",
    "Laplace",
    "Artemas Martin",
    "George W Hill",
    "Hill",
    "Christine Ladd",
    "Crelle",
    "August Crelle",
    "New York Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}