{
  "nome_completo": "John Bonnycastle",
  "nome_curto": "John Bonnycastle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bonnycastle/",
  "data_nascimento": "29 December 1751",
  "local_nascimento": "Hardwick, Buckinghamshire, England",
  "data_morte": "15 May 1821",
  "local_morte": "Woolwich, Kent, England",
  "summary": "John Bonnycastle was an English teacher of mathematics and prolific writer. He wrote for the early volumes of Rees's Cyclopædia , about algebra, analysis and astronomy.",
  "biografia": "John Bonnycastle\n's parents were John Bonnycastle\n(1727\n-\n1781)\n, a yeoman working in Hardwick, and Mary Toogood\n(1725\n-\n1779)\n. John and Mary were married on\n23\nApril\n1750\nin Whitchurch, Buckinghamshire. They had four children: John, the subject of this biography, was the eldest, followed by Mary\n(1755\n-\n1826)\n, Robert\n(1757\n-\n1796)\nand Thomas\n(1761\n-\n1764)\n. We have given\n29\nDecember\n1751\nas John Bonnycastle's date of birth but this is actually the date on which he was baptised\n(\nno record of his birth exists\n)\n. John was brought up in Hardwick and there he attended the school in the hamlet of Weedon run by the Rev Dr John Bridle, the rector of Hardwick. Much of his learning, however, came though his own studies. He was familiar with the works of Horace, Virgil, Homer, and had read the classics of French, Italian and German literature although he did not speak these languages. He seems to have had a remarkable memory, and knew most of Shakespeare's plays by heart.\nAfter being educated in Hardwick, Bonnycastle went to London before he was eighteen years old and there he taught for two days a week at two different schools, one run by the Rev Dr James of Greenwich Academy and the other at Chiswick run by a Dr Crawford. By the time he married Elizabeth Rolt on\n21\nFebruary\n1772\nin Chesham, Buckinghamshire, he was living in Bromley, Middlesex. Elizabeth, who came from Chesham, could not have had an education since she signed the marriage record with an X. There is no record of Elizabeth's death but certainly she must have died within a fairly short time of their marriage.\nBonnycastle began contributions to the mathematical department of the\nLondon Magazine\nsoon after this department was founded in October\n1774\n. From the addresses he gave on his contributions we know that he was 'Master of the Academy at Hackney' in\n1776\n, and 'Teacher of the Mathematics, Leman Street, London' in the following year. Alexander Chalmers tells us that in\n1777\nBonnycastle noticed that there were mathematical contributions to the\nLondon Magazine\nfrom George Anderson, a young labourer from Buckinghamshire. He was\n[\n3\n]\n:-\n... not less pleased than surprised at this attempt of a young man from the same county with himself, of whom he had never heard. Mr Bonnycastle, accordingly, on his next visit in Buckinghamshire, procured an interview with the young genius, whom he found threshing in a barn, the walls of which were covered with triangles and parallelograms. Such was young Anderson's bashfulness, however, that Mr Bonnycastle could not draw him into conversation, until he won his heart by the loan of\nSimpson\n's 'Fluxions', and two or three other books.\nIn\n1782\nBonnycastle acted as a tutor to the two sons of the Second Earl of Pomfret, in Easton Neston, Northamptonshire. This position lasted about six months. In November of that year he applied to the Royal Military Academy, Woolwich, for the post of Mathematical Master in the Drawing Room in the Tower. He was appointed to the position, which paid a salary of £\n100\nper year, in December\n1782\n. The Royal Military Academy was a unique educational establishment at this time, teaching scientific and mathematical methods to students who were training for a career in the military. It particular, it prepared students to become military engineers with an expertise in fortifications, road building, construction of harbours and canals, as well as giving them map-making skills. Bonnycastle remained in this position in Woolwich for the rest of his career. In addition to his teaching at the Royal Military Academy, he also collaborated with Matthew Thomas Francis Hommey in running an Academy at Charlton, near Woolwich, which prepared young gentlemen for the army. In May\n1803\nthe following 'Notice' appeared in the\nLondon Gazette\n:-\nMilitary Instruction, Woolwich Common.\nMr Bonnycastle, Mathematical Master of the Royal Military Academy at Woolwich, and Mr Hommey, continue, with proper Assistants, to instruct young Gentlemen, designed for the army, in the various Branches of the Military Education.\nThe Plan of Studies consists of all such Parts of Mathematics and Natural Philosophy as are connected with a Military Profession; also Geography, Fortification, Artillery, Tactics, Plan Drawing, Surveying, Levelling, Reconnoitring, with the Method of Tracing Works on the Ground, and the Principles and Practice of the French and German Languages.\nN.B. Two Vacations in the Year of a Month each, one at Christmas and the other at Midsummer; during which Time, however, any young Gentlemen are allowed, if more convenient to their Friends, to remain in the House, where a Mathematical Master resides to attend them daily, and other Masters attending occasionally.\nThe partnership between Bonnycastle and Hommey was ended on\n3\nMarch\n1810\n, and Hommey continued to run the Academy without Bonnycastle.\nOn\n7\nOctober\n1786\n, Bonnycastle married for the second time; the marriage took place in St Martin Ludgate, London. His wife was Bridget Newell of Lewisham, the daughter of William Newell, master of the old Jerusalem Tavern in Clerkenwell, and Hephzibah Apletree. Six children are known from this marriage: Charlotte\n(\nborn\n1788)\n, Mary\n(\nborn\n1790)\n, Richard Henry\n(\nborn\n1791)\n, William Joseph\n(\nborn\n1793)\n, Humphrey\n(\nborn\n1795)\nand Charles\n(\nborn\n1796)\n. Richard Henry Bonnycastle studied at the Royal Military Academy and joined the Royal Engineers. He served in the Netherlands, Canada and France and is famed for writing numerous books. Charles Bonnycastle became a professor of natural philosophy and mathematics at the newly opened University of Virginia in the United States.\nLet us now look at what surely must be Bonnycastle's greatest mathematical contribution, namely the books which he has written. The first, written at an early stage in his career, was\nThe Scholar's Guide to Arithmetic\n(1780)\n. The popularity of the book is clearly seen from the fact that in\n1851\nthe\n18\nth\nedition was published. No less popular was\nIntroduction to Algebra\n(1782)\n. The\n13\nth\nedition of this work, with addenda by his son Charles Bonnycastle, was published in\n1824\n. The Preface to the first edition is interesting and we quote a few extracts:-\nThe powers of the mind, like those of the body, are increased by frequent exertion; application and industry supply the place of genius and invention; and even the creative faculty itself may be strengthened and improved by use and perseverance. ... Books of rudiments, therefore, concisely written, well digested, and methodically arranged, are treasures of inestimable value; and too many attempts cannot be made to render them perfect and complete. ... From these consideration, I have been induced to compose an introductory course of mathematical science; and from the kind of encouragement which I have hitherto received, am not without hopes of a continuance of the same candour and approbation. Considerable practice as a teacher, and a long attention to the difficulties and obstructions which retard the progress of learners in general, have enabled me to accommodate myself the more easily to their capacities and understandings.\nThis was not the only book Bonnycastle published in\n1782\nfor in the same years\nIntroduction to Mensuration and Practical Geometry\nappeared in print. This was another highly successful work with an\n18\nth\nedition published in\n1823\n. Again we give some extracts from the Preface which give a good indication of Bonnycastle's successful approach to writing textbooks:-\nThe art of measuring, like all other useful inventions, appears to have been the offspring of want and necessity; and to have had its origin in those remote ages of antiquity, which are far beyond the reach of credible and authentic history. ... To Dr\nHutton\nI am particularly obliged, and am so far from desiring to supersede the use of his performance by this publication, that I only wish it to be thought a useful introduction to it. In school-books, and those designed for the use of learners, it has always appeared to me, that plain and concise rules, with proper exercises, are entirely sufficient for the purpose. In science, as well as in morals, example will ever enforce and illustrate precept; for this reason, an operation, wrought out in length, will be found of more service to beginners than all the tedious directions and observations that can possibly be given them.\nHis next book\nIntroduction to Astronomy\n(1786)\nwas written for those without a mathematical background. It too was popular with an\n8\nth\nedition appearing  in\n1822\n:-\nAt a time when the sciences are generally cultivated, and a love of literature and useful information has pervaded every rank and order of society, an easy and familiar account of the most interesting parts of Astronomy, will, it is presumed, be found an acceptable performance. Many persons who have not acquired a sufficient stock of Mathematical knowledge to read, with satisfaction, the works of\nNewton\n, and other eminent writers upon this subject, are yet very desirous of obtaining such an idea of it as will enable them to comprehend the leading principles upon which it is founded ...\nBonnycastle's\nElements of geometry\n(1789)\ncontains the propositions from\nEuclid\n's\nElements\nbooks,\n1\n-\n6\n,\n11\nand\n12\nwith \"critical and explanatory notes\" by Bonnycastle. He believed that the approach to geometry exhibited by\nEuclid\nprovided an outstanding method for teaching young people logical and precise thinking. He therefore followed\nEuclid\n's presentation rather closely. The book ran to several edition, the\n5\nth\nedition being advertise in\n1811\n.\n(\nThere may be further editions of this, and other works, by Bonnycastle and we have simply given the last edition we could find for each book.\n)\nHe published another geometry book nearly\n20\nyears later,\nA Treatise on Plane and Spherical Geometry\n(1806)\n. We note that a\n3\nrd\nedition appeared in\n1818\n. Finally\nA Treatise on Algebra\n(2\nvolumes\n)\nwas published in\n1813\n. This book was a translation of \"\nEssai sur l'histoire générale des mathématique\n\" by\nCharles Bossut\n.\nWe should mention some of Bonnycastle's friends. One friend with whom he was particularly close was Henry Fuseli, a painter and writer on art. Through Fuseli he got to know Leigh Hunt, an essayist, poet and writer, who paints the following picture of Bonnycastle in\n[\n4\n]\n:-\nBonnycastle was a good fellow. He was a tall, gaunt, long-headed man, with large features and spectacles, and a deep internal voice, with a twang of rusticity in it; and he goggled over his plate, like a horse. I often thought that a bag of corn would have hung well on him. His laugh was equine, and showed his teeth upwards at the sides. ... Bonnycastle was passionately fond of quoting Shakespeare, and telling stories; and if the Edinburgh Review had just come out, would give us all the jokes in it. He had once an hypochondriacal disorder of long duration, but had entirely outlived it. ... Perhaps he thought more highly of his talents than the amount of them strictly warranted; a mistake to which scientific men appear to be more liable than others ... But the delusion was not only pardonable, but desirable, in a man so zealous in the performance of his duties, and so much of a human being to all about him, as Mr Bonnycastle was.\nLet us record that the 'hypochondriacal disorder' mentioned in the quote was depression. While suffering from this he lived in Bath and during this period he wrote\nIntroduction to Astronomy\n(1786)\n. We have mentioned some of Bonnycastle's influential friends; others include his publisher Joseph Johnson, Joseph Priestley, William Cowper, Erasmus Darwin and the mathematician\nCharles Hutton\n.\nBonnycastle was buried in St Luke's, Charlton, Kent, a week after his death. The inscription on his gravestone reads:-\nSacred to the memory of John Bonnycastle, Esq., late Professor of Mathematics at the Royal Military Academy, Woolwich, born January,\n1752\n, died May\n15\n,\n1821\n.\nAlso the body of Bridget, his wife, who departed this life Oct\n19\nth\n,\n1825\n, aged\n73\nyears.",
  "matematicos_citados_na_biografia": [
    "Simpson",
    "Hutton",
    "Newton",
    "Euclid",
    "Charles Bossut",
    "Charles Hutton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}