{
  "nome_completo": "John Henry Coates",
  "nome_curto": "John Coates",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coates/",
  "data_nascimento": "26 January 1945",
  "local_nascimento": "Possum Brush, Manning Valley, New South Wales, Australia",
  "data_morte": "9 May 2022",
  "local_morte": "Cambridge, England",
  "summary": "John Coates was an Australian mathematician who was the Sadleirian Professor at  Cambridge and worked in algebraic number theory.",
  "biografia": "John Coates\n' mother, Beryl L Lee, was from an Irish family that had emigrated to Australia following the Irish potato famine of\n1845\n-\n50\n. The family settled in Manning Valley as, sometime later, did John's paternal grandfather who was from Ilkley, Yorkshire, England. John's father, J R Coates, taught French at a high school but a series of mental breakdowns led to him retiring from teaching and managing the farm his father owned near the Manning River. John and his older brother were brought up on the farm:-\n... it was totally unspoilt bush ... with animals all around so tremendous for a little boy to grow up in.\nSadly his mother died when he was seven years old and after this he spent time living with his aunt at the nearby town of Cundletown also on the Manning River. By this time John was being educated at a very small school, with only one teacher, in a village about five miles away from the farm on which he lived. He remained at the school until he was eleven years old when his elder brother was sent to the High School in Taree, about fifteen miles from his home. John's father managed to arrange for John to go to Taree Primary School for his final primary year. He then joined his brother at Taree High School where he became interested in physics but also received excellent mathematics teaching from Jack Gibson. When John was thirteen years old his father collapsed again with similar health problems that had plagued him earlier in his life.\nAfter graduating from Taree High School, Coates hoped to continue his education at university but fully understood that his father was not in a financial position to pay his fees. He therefore realised that he would have to win a scholarship, but first he took a summer vacation job at BHP Billiton, a big mining company in Newcastle. There was the possibility of obtaining a university scholarship from the company for they funded two or three for those working on internships each year. However, John failed to win a scholarship but he had also applied to the Australian National University for a scholarship and was invited for an interview. He was interviewed by Howard Florey who offered him a scholarship. He began his studies in mathematics, physics and chemistry, still with the intention of taking a physics degree. However, during his first year of study at A.N.U. he found that the mathematics teaching was much better than the physics teaching and he soon decided that he would specialise in mathematics. It was an exciting time at A.N.U. since\nBernhard Neumann\nhad been appointed as head of the Department of Mathematics in the Institute of Advanced Studies in\n1963\n, while\nHanna Neumann\nheaded the undergraduate teaching.\nKurt Mahler\nhad also been appointed at A.N.U. and he taught Coates a course in elementary number theory during the second semester of his first year of study. Coates was fascinated by number theory and this course played a large role in his decision to move from physics to mathematics. In his final year as an undergraduate, Coates did an honours project supervised by\nMahler\nwhich involved reading one of\nMahler\n's unpublished papers. It was Coates' introduction to research.\nDuring his undergraduate studies, Coates met Julie Turner who was also an undergraduate at A.N.U. in the year below him. She was the daughter of a Member of Parliament and was studying politics. They married in\n1966\nand had three sons. After the award of a B.Sc., Coates was awarded an A.N.U. scholarship and was advised by\nKurt Mahler\nand\nHanna Neumann\nto go to study for his doctorate at the École Normale Supérieure in Paris. His wife joined him in Paris after completing her undergraduate degree. However, Coates was unhappy with the areas of research in Paris feeling that he did not have the mathematical background to cope with the abstraction. He wrote to\nCassels\nat Cambridge in England asking if he could move to Cambridge. He was accepted so, after spending a year in Paris, he went to Cambridge to complete his doctorate:-\nWe arrived in Cambridge in mid-summer and I was a student at Trinity College ... they gave us a nice flat above 'The Blue Boar' until October but then we had a delightful flat in Westminster College, above the Master's Lodge.\nCoates' thesis advisor at Cambridge was\nAlan Baker\nand, as soon as he arrived, he made the decision to start a new research project rather than continue the one he had begun in Paris. His doctoral dissertation was an outstanding piece of work on\np\np\np\n-adic analogues of\nBaker\n's method.\nContinuing to move round some of the leading centres for mathematical research, Coates obtained a position as assistant professor of mathematics at Harvard University in the United States in\n1969\n. From Harvard he moved to Stanford University in\n1972\n, where he was an associate professor, and, after a further three years he returned to England to take up a lectureship at the University of Cambridge in\n1975\n. He became a fellow of Emmanuel College during this period at Cambridge and it was during this time that\nAndrew Wiles\nwas his research student.\nAt this stage Coates had returned to work in one of the three universities that he had studied in and indeed he continued with this pattern in\n1977\nwhen he was appointed as professor at the Australian National University. However, he did not remain for long in his home country, moving back to France in\n1978\nto a professorship at the University of Paris XI at Orsay. In\n1985\nhe took up the positions of professor and director of mathematics at the École Normale Supérieure. In the same year he was elected to a fellow of the\nRoyal Society of London\n.\nIn\n1986\nCoates returned to Cambridge when he was appointed to the Sadleirian Chair of Mathematics and he was also elected a fellow of Emmanuel College in Cambridge for the second time. In\n1991\nhe became Head of the Department of Pure Mathematics and Mathematical Statistics at Cambridge.\nCoates's first major mathematical publications were in\n1966\n-\n67\nwhen he published four articles on the algebraic approximation of functions. Then, together with\nA Baker\n, he extended\nMahler\n's work on fractional parts of powers of\nrational\nnumbers. In other work he looked at problems relating properties of\nalgebraic number fields\nto algebraic K-theory.\nHe then proved certain special cases of\nWeil\n's conjecture on elliptic curves. He worked on\nIwasawa\n's theory and wrote a number of articles with\nAndrew Wiles\npublished around\n1977\n-\n78\nincluding\nKummer's criterion for\nHurwitz\nnumber, Explicit reciprocity laws\nand\nOn p-adic L-functions and elliptic units\n. As stated in\n[\n1\n]\n:-\nHis\n1977\narticle on the conjecture of Birch and Swinnerton-Dyer, written jointly with his research student Andrew\nWiles\n, was a landmark contribution to\nnumber theory\nwhich introduced a panoply of new methods into the field of elliptic curves.\nWiles\nhad studied for his doctorate under Coates at Cambridge from\n1974\nand this proved an important link in the various strands which led to\nWiles\n's proof of\nFermat's Last Theorem\n. During the\n1980\ns Coates's work was concerned with elliptic curves,\nIwasawa\ntheory and p-adic L-functions, all work closely related to the direction that would eventually yield the proof of Fermat's Last Theorem. From\n[\n1\n]\n:-\nCoates's insights into the\nIwasawa\ntheory of the symmetric square of an elliptic curve were instrumental in the recent proof by\nWiles\nof the\nShimura\n-\nTaniyama\nconjecture for semistable elliptic curves over\nQ\n\\mathbb{Q}\nQ\n.\nNot only was Coates an outstanding researcher but he also had a reputation as a teacher of the highest quality\n[\n1\n]\n:-\nJohn Coates is an inspired teacher and expositor who has made decisive contributions to the training of research students and junior colleagues, many of whom have gone on to fruitful research careers.\nAgain his contribution as an editor was singled out for praise in\n[\n1\n]\n:-\nHe was for many years an energetic and active editor of Inventiones Mathematicae, one of the premier journals of research mathematics, often making decisive stylistic improvements to articles which he deemed important but insufficiently well crafted.\nCoates served as president of the\nLondon Mathematical Society\nduring\n1988\n-\n90\nand as vice-president of the\nInternational Mathematical Union\nfrom\n1991\nto\n1995\n. During\n1992\n-\n94\nhe served as a member of the Council of the\nRoyal Society\n, then, in\n1996\n, he served on a group set up by the\nRoyal Society\nto examine the peer review system used for funding research. The\nLondon Mathematical Society\nawarded Coates their Senior\nWhitehead\nPrize in\n1997\n:-\n... for his fundamental research in number theory and for his many contributions to mathematical life both in the UK and internationally.",
  "matematicos_citados_na_biografia": [
    "Bernhard Neumann",
    "Hanna Neumann",
    "Kurt Mahler",
    "Mahler",
    "Cassels",
    "Alan Baker",
    "Baker",
    "Andrew Wiles",
    "Royal Society of London",
    "A Baker",
    "rational",
    "algebraic number fields",
    "Weil",
    "Iwasawa",
    "Hurwitz",
    "Wiles",
    "number theory",
    "Fermat's Last Theorem",
    "Shimura",
    "Taniyama",
    "London Mathematical Society",
    "International Mathematical Union",
    "Royal Society",
    "Whitehead"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}