{
  "nome_completo": "John von Neumann",
  "nome_curto": "John von Neumann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Von_Neumann/",
  "data_nascimento": "28 December 1903",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "8 February 1957",
  "local_morte": "Washington D.C., USA",
  "summary": "John Von Neumann built a solid framework for quantum mechanics. He also worked in game theory, studied what are now called von Neumann Algebras , and was one of the pioneers of computer science.",
  "biografia": "John von Neumann\nwas born János von Neumann. He was called Jancsi as a child, a diminutive form of János, then later he was called Johnny in the United States. His father, Max Neumann, was a top banker and he was brought up in a extended family, living in Budapest where as a child he learnt languages from the German and French governesses that were employed. Although the family were Jewish, Max Neumann did not observe the strict practices of that religion and the household seemed to mix Jewish and Christian traditions.\nIt is also worth explaining how Max Neumann's son acquired the \"von\" to become János von Neumann. Max Neumann was eligible to apply for a hereditary title because of his contribution to the then successful Hungarian economy and in\n1913\nhe paid a fee to acquire a title, but he did not change his name. His son, however, used the German form von Neumann where the \"von\" indicated the title.\nAs a child von Neumann showed he had an incredible memory. Poundstone, in\n[\n8\n]\n, writes:-\nAt the age of six, he was able to exchange jokes with his father in classical Greek. The Neumann family sometimes entertained guests with demonstrations of Johnny's ability to memorise phone books. A guest would select a page and column of the phone book at random. Young Johnny read the column over a few times, then handed the book back to the guest. He could answer any question put to him\n(\nwho has number such and such?\n)\nor recite names, addresses, and numbers in order.\nIn\n1911\nvon Neumann entered the Lutheran\nGymnasium\n. The school had a strong academic tradition which seemed to count for more than the religious affiliation both in the Neumann's eyes and in those of the school. His mathematics teacher quickly recognised von Neumann's genius and special tuition was put on for him. The school had another outstanding mathematician one year ahead of von Neumann, namely\nEugene Wigner\n.\nWorld War I had relatively little effect on von Neumann's education but, after the war ended, Béla Kun controlled Hungary for five months in\n1919\nwith a Communist government. The Neumann family fled to Austria as the affluent came under attack. However, after a month, they returned to face the problems of Budapest. When Kun's government failed, the fact that it had been largely composed of Jews meant that Jewish people were blamed. Such situations are devoid of logic and the fact that the Neumann's were opposed to Kun's government did not save them from persecution.\nIn\n1921\nvon Neumann completed his education at the Lutheran Gymnasium. His first mathematics paper, written jointly with\nFekete\nthe assistant at the University of Budapest who had been tutoring him, was published in\n1922\n. However Max Neumann did not want his son to take up a subject that would not bring him wealth. Max Neumann asked Theodore von\nKármán\nto speak to his son and persuade him to follow a career in business. Perhaps von\nKármán\nwas the wrong person to ask to undertake such a task but in the end all agreed on the compromise subject of chemistry for von Neumann's university studies.\nHungary was not an easy country for those of Jewish descent for many reasons and there was a strict limit on the number of Jewish students who could enter the University of Budapest. Of course, even with a strict quota, von Neumann's record easily won him a place to study mathematics in\n1921\nbut he did not attend lectures. Instead he also entered the University of Berlin in\n1921\nto study chemistry.\nVon Neumann studied chemistry at the University of Berlin until\n1923\nwhen he went to Zürich. He achieved outstanding results in the mathematics examinations at the University of Budapest despite not attending any courses. Von Neumann received his diploma in chemical engineering from the Technische Hochschule in Zürich in\n1926\n. While in Zürich he continued his interest in mathematics, despite studying chemistry, and interacted with\nWeyl\nand\nPólya\nwho were both at Zürich. He even took over one of\nWeyl\n's courses when he was absent from Zürich for a time.\nPólya\nsaid\n[\n18\n]\n:-\nJohnny was the only student I was ever afraid of. If in the course of a lecture I stated an unsolved problem, the chances were he'd come to me as soon as the lecture was over, with the complete solution in a few scribbles on a slip of paper.\nVon Neumann received his doctorate in mathematics from the University of Budapest, also in\n1926\n, with a thesis on set theory. He published a definition of ordinal numbers when he was\n20\n, the definition is the one used today.\nVon Neumann lectured at Berlin from\n1926\nto\n1929\nand at Hamburg from\n1929\nto\n1930\n. However he also held a Rockefeller Fellowship to enable him to undertake postdoctoral studies at the University of Göttingen. He studied under\nHilbert\nat Göttingen during\n1926\n-\n27\n. By this time von Neumann had achieved celebrity status\n[\n8\n]\n:-\nBy his mid-twenties, von Neumann's fame had spread worldwide in the mathematical community. At academic conferences, he would find himself pointed out as a young genius.\nVeblen\ninvited von Neumann to Princeton to lecture on\nquantum theory\nin\n1929\n. Replying to\nVeblen\nthat he would come after attending to some personal matters, von Neumann went to Budapest where he married his fiancée Marietta Kovesi before setting out for the United States. In\n1930\nvon Neumann became a visiting lecturer at Princeton University, being appointed professor there in\n1931\n.\nBetween\n1930\nand\n1933\nvon Neumann taught at Princeton but this was not one of his strong points\n[\n8\n]\n:-\nHis fluid line of thought was difficult for those less gifted to follow. He was notorious for dashing out equations on a small portion of the available blackboard and erasing expressions before students could copy them.\nIn contrast, however, he had an ability to explain complicated ideas in physics\n[\n3\n]\n:-\nFor a man to whom complicated mathematics presented no difficulty, he could explain his conclusions to the uninitiated with amazing lucidity. After a talk with him one always came away with a feeling that the problem was really simple and transparent.\nHe became one of the original six mathematics professors\n(\nJ W Alexander\n,\nA Einstein\n,\nM Morse\n,\nO Veblen\n, J von Neumann and\nH Weyl\n)\nin\n1933\nat the newly founded Institute for Advanced Study in Princeton, a position he kept for the remainder of his life.\nDuring the first years that he was in the United States, von Neumann continued to return to Europe during the summers. Until\n1933\nhe still held academic posts in Germany but resigned these when the Nazis came to power. Unlike many others, von Neumann was not a political refugee but rather he went to the United States mainly because he thought that the prospect of academic positions there was better than in Germany.\nIn\n1933\nvon Neumann became co-editor of the\nAnnals of Mathematics\nand, two years later, he became co-editor of\nCompositio Mathematica\n. He held both these editorships until his death.\nVon Neumann and Marietta had a daughter Marina in\n1935\nbut their marriage ended in divorce in\n1937\n. The following year he married Klára Dán, also from Budapest, whom he met on one of his European visits. After marrying, they sailed to the United States and made their home in Princeton. There von Neumann lived a rather unusual lifestyle for a top mathematician. He had always enjoyed parties\n[\n8\n]\n:-\nParties and nightlife held a special appeal for von Neumann. While teaching in Germany, von Neumann had been a denizen of the Cabaret-era Berlin nightlife circuit.\nNow married to Klára the parties continued\n[\n18\n]\n:-\nThe parties at the von Neumann's house were frequent, and famous, and long.\nUlam\nsummarises von Neumann's work in\n[\n35\n]\n. He writes:-\nIn his youthful work, he was concerned not only with mathematical logic and the axiomatics of set theory, but, simultaneously, with the substance of set theory itself, obtaining interesting results in\nmeasure theory\nand the theory of real variables. It was in this period also that he began his classical work on quantum theory, the mathematical foundation of the theory of measurement in quantum theory and the new\nstatistical mechanics\n.\nHis text\nMathematische Grundlagen der Quantenmechanik\nⓉ\n(\nMathematical foundations of quantum mechanics\n)\n(1932)\nbuilt a solid framework for the new quantum mechanics. Van Hove writes in\n[\n36\n]\n:-\nQuantum mechanics was very fortunate indeed to attract, in the very first years after its discovery in\n1925\n, the interest of a mathematical genius of von Neumann's stature. As a result, the mathematical framework of the theory was developed and the formal aspects of its entirely novel rules of interpretation were analysed by one single man in two years\n(1927\n-\n1929)\n.\nSelf-adjoint algebras of bounded linear operators on a Hilbert space, closed in the weak operator\ntopology\n, were introduced in\n1929\nby von Neumann in a paper in\nMathematische Annalen\n.\nKadison\nexplains in\n[\n22\n]\n:-\nHis interest in\nergodic theory\n,\ngroup representations\nand quantum mechanics contributed significantly to von Neumann's realisation that a theory of operator algebras was the next important stage in the development of this area of mathematics.\nSuch operator algebras were called \"rings of operators\" by von Neumann and later they were called\nW\n∗\nW^{*}\nW\n∗\n-algebras by some other mathematicians.\nJ Dixmier\n, in\n1957\n, called them \"von Neumann algebras\" in his monograph\nAlgebras of operators in\nHilbert space\n(\nvon Neumann algebras\n)\n. In the second half of the\n1930\n's and the early\n1940\ns von Neumann, working with his collaborator F J Murray, laid the foundations for the study of von Neumann algebras in a fundamental series of papers.\nHowever von Neumann is known for the wide variety of different scientific studies.\nUlam\nexplains\n[\n35\n]\nhow he was led towards\ngame theory\n:-\nVon Neumann's awareness of results obtained by other mathematicians and the inherent possibilities which they offer is astonishing. Early in his work, a paper by\nBorel\non the minimax property led him to develop ... ideas which culminated later in one of his most original creations, the theory of games.\nIn game theory von Neumann proved the minimax theorem. He gradually expanded his work in game theory, and with co-author\nOskar Morgenstern\n, he wrote the classic text\nTheory of Games and Economic Behaviour\n(1944)\n.\nUlam\ncontinues in\n[\n35\n]\n:-\nAn idea of Koopman on the possibilities of treating problems of classical mechanics by means of operators on a function space stimulated him to give the first mathematically rigorous proof of an ergodic theorem.\nHaar\n's construction of measure in groups provided the inspiration for his wonderful partial solution of\nHilbert\n's fifth problem, in which he proved the possibility of introducing analytical parameters in compact groups.\nIn\n1938\nthe\nAmerican Mathematical Society\nawarded the\nBôcher\nPrize to John von Neumann for his memoir\nAlmost periodic functions and groups\n. This was published in two parts in the\nTransactions of the American Mathematical Society\n, the first part in\n1934\nand the second part in the following year. Around this time von Neumann turned to applied mathematics\n[\n35\n]\n:-\nIn the middle\n30\n's, Johnny was fascinated by the problem of hydrodynamical turbulence. It was then that he became aware of the mysteries underlying the subject of non-linear\npartial differential equations\n. His work, from the beginnings of the Second World War, concerns a study of the equations of hydrodynamics and the theory of shocks. The phenomena described by these non-linear equations are baffling analytically and defy even qualitative insight by present methods. Numerical work seemed to him the most promising way to obtain a feeling for the behaviour of such systems. This impelled him to study new possibilities of computation on electronic machines ...\nVon Neumann was one of the pioneers of computer science making significant contributions to the development of logical design.\nShannon\nwrites in\n[\n29\n]\n:-\nVon Neumann spent a considerable part of the last few years of his life working in\n[\nautomata theory\n]\n. It represented for him a synthesis of his early interest in logic and proof theory and his later work, during World War II and after, on large scale electronic computers. Involving a mixture of pure and applied mathematics as well as other sciences, automata theory was an ideal field for von Neumann's wide-ranging intellect. He brought to it many new insights and opened up at least two new directions of research.\nHe advanced the theory of cellular automata, advocated the adoption of the bit as a measurement of computer memory, and solved problems in obtaining reliable answers from unreliable computer components.\nDuring and after World War II, von Neumann served as a consultant to the armed forces. His valuable contributions included a proposal of the implosion method for bringing nuclear fuel to explosion and his participation in the development of the hydrogen bomb. From\n1940\nhe was a member of the Scientific Advisory Committee at the Ballistic Research Laboratories at the Aberdeen Proving Ground in Maryland. He was a member of the Navy Bureau of Ordnance from\n1941\nto\n1955\n, and a consultant to the Los Alamos Scientific Laboratory from\n1943\nto\n1955\n. From\n1950\nto\n1955\nhe was a member of the Armed Forces Special Weapons Project in Washington, D.C. In\n1955\nPresident Eisenhower appointed him to the Atomic Energy Commission, and in\n1956\nhe received its\nEnrico Fermi\nAward, knowing that he was incurably ill with cancer.\nEugene Wigner\nwrote of von Neumann's death\n[\n18\n]\n:-\nWhen von Neumann realised he was incurably ill, his logic forced him to realise that he would cease to exist, and hence cease to have thoughts ... It was heartbreaking to watch the frustration of his mind, when all hope was gone, in its struggle with the fate which appeared to him unavoidable but unacceptable.\nIn\n[\n5\n]\nvon Neumann's death is described in these terms:-\n... his mind, the amulet on which he had always been able to rely, was becoming less dependable. Then came complete psychological breakdown; panic, screams of uncontrollable terror every night. His friend Edward Teller said, \"I think that von Neumann suffered more when his mind would no longer function, than I have ever seen any human being suffer.\"\nVon Neumann's sense of invulnerability, or simply the desire to live, was struggling with unalterable facts. He seemed to have a great fear of death until the last... No achievements and no amount of influence could save him now, as they always had in the past. Johnny von Neumann, who knew how to live so fully, did not know how to die.\nIt would be almost impossible to give even an idea of the range of honours which were given to von Neumann. He was Colloquium Lecturer of the\nAmerican Mathematical Society\nin\n1937\nand received the its\nBôcher\nPrize as mentioned above. He held the\nGibbs\nLectureship of the\nAmerican Mathematical Society\nin\n1947\nand was President of the Society in\n1951\n-\n53\n.\nHe was elected to many academies including the Academia Nacional de Ciencias Exactas\n(\nLima, Peru\n)\n,\nAcademia Nazionale dei Lincei\n(\nRome, Italy\n)\n,\nAmerican Academy of Arts and Sciences\n(\nUSA\n)\n, American Philosophical Society\n(\nUSA\n)\n, Instituto Lombardo di Scienze e Lettere\n(\nMilan, Italy\n)\n,\nNational Academy of Sciences\n(\nUSA\n)\nand\nRoyal Netherlands Academy of Sciences and Letters\n(\nAmsterdam, The Netherlands\n)\n.\nVon Neumann received two Presidential Awards, the Medal for Merit in\n1947\nand the Medal for Freedom in\n1956\n. Also in\n1956\nhe received the\nAlbert Einstein\nCommemorative Award and the\nEnrico Fermi\nAward mentioned above.\nPeierls writes\n[\n3\n]\n:-\nHe was the antithesis of the \"long-haired\" mathematics don. Always well groomed, he had as lively views on international politics and practical affairs as on mathematical problems.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Eugene Wigner",
    "Fekete",
    "Kármán",
    "Weyl",
    "Pólya",
    "Hilbert",
    "Veblen",
    "quantum theory",
    "J W Alexander",
    "A Einstein",
    "M Morse",
    "O Veblen",
    "H Weyl",
    "Ulam",
    "measure theory",
    "statistical mechanics",
    "topology",
    "Kadison",
    "ergodic theory",
    "group representations",
    "J Dixmier",
    "Hilbert space",
    "game theory",
    "Borel",
    "Oskar Morgenstern",
    "Haar",
    "American Mathematical Society",
    "Bôcher",
    "partial differential equations",
    "Shannon",
    "Enrico Fermi",
    "Gibbs",
    "Academia Nazionale dei Lincei",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Royal Netherlands Academy of Sciences and Letters",
    "Albert Einstein"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}