{
  "nome_completo": "John Cedric Shepherdson",
  "nome_curto": "John Shepherdson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shepherdson/",
  "data_nascimento": "7 June 1926",
  "local_nascimento": "Huddersfield, Yorkshire, England",
  "data_morte": "8 January 2015",
  "local_morte": "Bristol, England",
  "summary": "John Shepherdson was a English mathematician who worked in ring theory and mathematical logic.",
  "biografia": "John Shepherdson\n's parents were Arnold Shepherdson and Elsie Aspinall. After completing his schooling, he studied at the University of Cambridge and was awarded an M.A. in\n1946\n. He would have remained at Cambridge had he been awarded a fellowship to Trinity College but he was in competition with the outstanding mathematician Peter Swinnerton-Dyer who was awarded the Fellowship in preference to Shepherdson. He was appointed as an Assistant experimental officer at the National Physical Laboratory in London in\n1946\n.\nHans Heilbronn\nwas a German-Jew who had escaped from Germany to England after he was dismissed from his post at Göttingen in\n1933\n. He was given a temporary post at the University of Bristol, was at the University of Cambridge on a Bevan Scholarship, and was appointed as a Reader in Mathematics at the University of Bristol in\n1946\n.\nHeilbronn\n, who was a number theorist, had the opportunity of appointing an Assistant Lecturer and, despite the fact that Shepherdson had no doctorate, nevertheless his outstanding record at Cambridge led to\nHeilbronn\noffering the position to him. Shepherdson accepted and spent the rest of his career at the University of Bristol. He was promoted to Lecturer in Mathematics in\n1949\n, and Reader in\n1955\n.\nOn\n5\nJuly\n1957\nShepherdson married Margaret Smith; they had three children, David John Shepherdson, Jane Elizabeth Shepherdson, and Judith Shepherdson. Margaret had graduated in biochemistry from the University of Bristol in\n1956\n. She became a university lecturer and a research biochemist. David Shepherdson became a zoologist. He spoke about his childhood in an interview:-\nMy parents are both scientists. My mother in particular is a biologist and inspired me to wonder about the natural world. ...\n[\nAs a child\n]\nI kept pets, watched birds, constructed mechanical models, fixed cars and read about science especially biology and natural history.\nJane Shepherdson was educated at Clifton High School, and became a leading businesswoman with clothing firms. She is a Member of the Order of the British Empire\n(\nMBE\n)\nand recently she was appointed Commander of the Order of the British Empire\n(\nCBE\n)\nfor services to UK retail business in the\n2015\nNew Year Honours.\nLet us return to our account of Shepherdson's career. He was made a Professor in\n1964\n, then named Henry Overton Professor in\n1976\n, a chair he held until he retired in\n1991\n. He was awarded a D.Sc. by the University of Cambridge in\n1981\n.\nPhilip Welch writes\n[\n1\n]\n:-\nI asked him when he retired whether he had ever considered moving elsewhere, and he said that he had. And indeed, looking back, he said that if he were to live his career again, considering matters globally, he would have thought it better to move at some point, however at no individual particular moment in time was there any overwhelming reason to do so. Nevertheless he was much travelled as an academic, and built up many contacts abroad.\nWhen he retired in\n1991\nhe was made Professor Emeritus by the University of Bristol and made a visit to the Institute for Advanced Study in Princeton in the United States.\nShepherdson's first publications were\nOn the addition of elements of a sequence\n(1947)\nand\nInverses and zero divisors in matrix rings\n(1951)\n. In both of these papers he thanked\nHans Heilbronn\nfor suggesting the problems that he solved in the papers. In the first of these papers he generalised a result by\nHarold Davenport\nabout sums of elements in a sequence in an additive abelian group. In the second of the papers be answered the following question which had been posed by\nBartel van der Waerden\n:\nIf\nR\nR\nR\nis a ring with a unit element and\nA\nA\nA\nis an\nn\n×\nn\nn \\times  n\nn\n×\nn\nsquare matrix with elements in\nR\nR\nR\n, can\nA\nA\nA\n, regarded as an element of the ring of\nn\n×\nn\nn \\times  n\nn\n×\nn\nsquare matrices with elements in\nR\nR\nR\n, be both a left inverse and a left divisor of zero?\nShepherdson answered this question by giving an example in the case\nn\n=\n2\nn = 2\nn\n=\n2\n. He constructed a ring\nR\nR\nR\nsuch that there are\n2\n×\n2\nmatrices\nA\n,\nB\n,\nX\n≠\n0\nA, B, X ≠ 0\nA\n,\nB\n,\nX\n\n​\n=\n0\nsuch that\nA\nB\n=\nI\n,\nA\nX\n=\n0\nAB = I, AX = 0\nA\nB\n=\nI\n,\nA\nX\n=\n0\n.\nHis main work turned towards set theory and he published the paper\nWell-ordered sub-series of general series\n(1951)\n. Here is his abstract to this paper:-\nWe are concerned here with the investigation of the structure of ordered series by means of their well-ordered sub-series. ... Throughout the paper we allow ourselves all the freedom of the 'classical' set-theory of\nCantor\n,\nHausdorff\n,\nSierpiński\n, etc. In particular, we make free use of the theory of ordinals as expounded by\nSierpiński\n. Although many of these results would be difficult and some perhaps impossible to state and prove in a system of set-theory based on a theory of types, we feel that there would be no intrinsic difficulty in carrying out all the proofs in an axiomatic system of set-theory of the\nZermelo\n-\nFraenkel\ntype, such as that set out by\nGödel\n. We make free use of the\naxiom of choice\n.\nNext he published three papers with the title\nInner models for set theory\nbetween\n1951\nand\n1953\n. Again we give Shepherdson's abstract which appears in the first of the papers:-\nOne of the standard ways of proving the consistency of additional hypotheses with the basic axioms of an axiom system is by the construction of what may be described as 'inner models.' By starting with a domain of individuals assumed to satisfy the basic axioms an inner model is constructed whose domain of individuals is a certain subset of the original individual domain. If such an inner model can be constructed which satisfies not only the basic axioms but also the particular additional hypothesis under consideration, then this affords a proof that if the basic axiom system is consistent then so is the system obtained by adding to this system the new hypothesis. This method has been applied to axiom systems for set theory by many authors, including\nvon Neumann\n,\nMostowski\n, and more recently\nGödel\n, who has shown by this method that if the basic axioms of a certain axiomatic system of set theory are consistent then so is the system obtained by adding to these axioms a strong form of the axiom of choice and the generalised continuum hypothesis. Having been shown in this striking way the power of this method it is natural to inquire whether it has any limitations or whether by the construction of a sufficiently ingenious inner model one might hope to decide other outstanding consistency questions, such as the consistency of the negations of the axiom of choice and\ncontinuum hypothesis\n. In this and two following papers we prove some general theorems concerning inner models for a certain axiomatic system of set theory which lead to the result that as far as a fairly large family of inner models are concerned this method of proving consistency has been exhausted, that no essentially new consistency results can be obtained by the use of this kind of model.\nHe continued an interest in other areas too, for example publishing with\nAlbrecht Fröhlich\nthe joint paper\nOn the factorisation of polynomials in a finite number of steps\n(1955)\n. Also in\n1955\nhe published, jointly with John Myhill,\nEffective operations on partial recursive functions\n. His interest in recursive functions led to many other papers on the topic, in particular his joint paper with Howard Sturgis entitled\nComputability of recursive functions\n(1963)\n. This paper contained an idea similar to a\nTuring\nmachine, now known as the Shepherdson-Sturgis Register machine. In many ways this is easier to work with than a\nTuring\nmachine and has proved an important idea. Towards the end of his career his interests turned towards the computer language PROLOG and also to fuzzy logic. Three papers written nearly ten years after he retired were on the topic of fuzzy logic and were all written jointly with Petr Hájek. The papers published in\n2000\nalso have Jeff B Paris as a co-author. These three papers are\nThe Liar Paradox and Fuzzy Logic\n(2000)\n,\nRational Pavelka Predicate Logic Is A Conservative Extension of Lukasiewicz Predicate Logic\n(2000)\n, and\nA note on the notion of truth in fuzzy logic\n(2001)\n.\nShepherdson proposed the setting up of the British Logic Colloquium in\n1970\n, and then became a co-founder of the Colloquium with Robin Gandy. His idea in setting up this Colloquium was to carry on the tradition in British mathematical logic which had been so well served by the great names of\nBertrand Russell\n,\nFrank Ramsey\nand\nAlan Turing\n. He served on the Science Research Council from\n1968\nto\n1971\n, on the Association for Symbolic Logic being a Member of the Executive Committee for European Affairs\n1966\n-\n72\n. He was chairman of the Executive Committee from\n1966\nto\n1968\n. He also served on the Committee on Logic in East Asia from\n1967\nto\n1970\n. He was a Fellow Institute of Mathematics and Its Applications, a Fellow of the British Academy, a member of the\nLondon Mathematical Society\n(\nserving on the editorial board,\n1970\n-\n1977)\n, and a member of the\nAmerican Mathematical Society\n. He also served in the editorial boards of several major journals:\nZeitschrift für Math. Logik\n(1955\n-\n1975)\n,\nJournal Computer and Systems Sciences\n(1966\n-\n1991)\n, and the\nArchiv für Math. Logik\n(1972\n-\n1987)\n.\nPhilip Welch writes\n[\n1\n]\n:-\nJohn's service to the University was great\n[\nbut\n]\nto mathematical logic in the U.K. it was an order of magnitude greater: he trained a number of students who went on to be logicians, and he made Bristol a place for research in logic to which many young logicians were attracted; so much so that it now makes for a roll-call of those involved in the subject in the U.K. Over his\n40\nyears in the department, a tradition of logic in Bristol was established, again, for example through a long-running M.Sc. in Logic and the Theory of Computation.\nPhilip Welch also writes about Shepherdson's character in\n[\n1\n]\n:-\nJohn was a man of great kindness and modesty: the last person to push\n(\nor even volunteer\n)\nhis opinion in seminars, his attitude was the opposite of dogmatic. However, his conversation was bright and entertaining, with a still-waters-running-deep reservoir of dry wit which was of great amusement when it bubbled up. ... I felt that John had a particular sensitivity to people junior to him, that must have been unthreatening in his quiet manner: he had female collaborators in the\n1960\ns, including two from India and Japan, not countries noted for their support of women in mathematics back then\n(\nwas the UK?\n)\n, but who nevertheless came to Bristol to work with him successfully, and have fond memories of that time.\nOutside mathematics and his family, Shepherdson's interests were skiing, walking and cycling. Let us relate a little story that he told in February\n2011\n:-\nSome years ago we rented a car in Athens and noticed one day that the rear number plate was missing. We thought there had been one on the day before. When we checked with the rental company we found that we must have parked illegally - we had been surprised how easy it was to find a parking space in the main square. To get the number plate back we had to go to a police depot and pay a fine - there would probably have been a much bigger fine if we had been spotted driving without a rear number plate.\nShepherdson died of an inoperable sarcoma and, following his wishes, there was no funeral service but a Memorial Service celebrating his life was held at Goldney Hall in Bristol on Saturday\n21\nFebruary\n2015\n. As Shepherdson had requested, the service was led by an officiant from the British Humanist Society. As well as family members, Angus MacIntyre spoke about Shepherdson's mathematics. See\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Hans Heilbronn",
    "Heilbronn",
    "Harold Davenport",
    "Bartel van der Waerden",
    "Cantor",
    "Hausdorff",
    "Sierpiński",
    "Zermelo",
    "Fraenkel",
    "Gödel",
    "axiom of choice",
    "von Neumann",
    "Mostowski",
    "continuum hypothesis",
    "Albrecht Fröhlich",
    "Turing",
    "Bertrand Russell",
    "Frank Ramsey",
    "Alan Turing",
    "London Mathematical Society",
    "American Mathematical Society",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}