{
  "nome_completo": "Joseph Leonard Walsh",
  "nome_curto": "Joseph Walsh",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walsh_Joseph/",
  "data_nascimento": "21 September 1895",
  "local_nascimento": "Washington, D.C., USA",
  "data_morte": "6 December 1973",
  "local_morte": "College Park, Maryland, USA",
  "summary": "Joseph Leonard Walsh was an American mathematician who worked in the field of analysis.",
  "biografia": "Joseph Walsh\nwas known as Joe to his colleagues. His parents were John Leonard Walsh, who was a Methodist minister, and Sallie Ellicott Jones. He entered Baltimore Polytechnic Institute in\n1908\nand spent four years there preparing for university entry. In\n1912\nhe entered Columbia University but, after one year of study, transferred to Harvard University. He was awarded a Bachelor of Science degree with distinction in\n1916\n, and was then awarded a Sheldon Travelling Fellowship which financed him through the academic year\n1916\n-\n17\nspent partly at Chicago and partly at the University of Wisconsin at Madison.\nAfter being awarded a Master's degree by the University of Wisconsin in\n1917\nhe returned to Harvard where he was appointed as an instructor in mathematics. He registered for doctoral studies and began research under the supervision of\nMaxime Bôcher\n. By this time the United States had entered World War I and Walsh enlisted in the U.S. Navy. He served on troop transport vessels in the North Atlantic until he returned to his position in Harvard in\n1919\n. By this time\nBôcher\nhad died so Walsh had to begin working under a new research supervisor. He now worked with\nG D Birkhoff\nwho himself had been inspired by\nBôcher\n. Walsh was awarded his doctorate by Harvard in\n1920\nfor his thesis\nOn the location of the roots of a Jacobian of two binary forms, and of the derivative of a rational function\n. He had published a seven page paper with this title in the\nTransactions of the American Mathematical Society\nin\n1918\nbut even this was not his first publication for in\n1916\nhe had published\nNote on Cauchy's integral formula\nin the\nAnnals of Mathematics\n.\nA Sheldon Travelling Fellowship allowed Walsh to spend the academic year\n1920\n-\n21\nin Paris where he worked with\nMontel\n. He continued to publish a steady stream of papers with\nOn the location of the roots of the derivative of a polynomial\nappearing in\n1920\nand then two papers\nA generalization of the Fourier cosine series\nand\nA theorem on cross-ratios in the geometry of inversion\nin\n1921\n. Back at Harvard he was appointed as an instructor in\n1921\n, then three years later was promoted to assistant professor. One publication in\n1923\nwhich was not seen to be particularly significant at the time was on orthogonal expansions. Later the functions studied in this work were called\nWalsh functions\nand they proved an important tool in digital and signal processing. It is Walsh functions that have had the biggest impact of any of Walsh's work but nobody would have guessed this in\n1923\n, least of all Walsh. Rising steadily through the ranks at Harvard he was promoted to associate professor in\n1930\n, then full professor in\n1935\n. He was chairman of the Mathematics Department from\n1937\nto\n1942\n. During this\n1921\n-\n1942\nHarvard period, he had spent a year\n(1925\n-\n26)\nat the University of Munich where he worked with\nCarathéodory\n, and a year at the Institute for Advanced Study at Princeton\n(1934\n-\n35)\n. He married Aline Natalie Burgess on\n15\nJuly\n1931\nbut the marriage ended in divorce and he married for the second time on\n2\nApril\n1946\nto Elizabeth Cheney Strayhorn whom he met when she was an officer in the WAAC; he had two children with his second wife.\nWalsh had a remarkable publication record. The obituary\n[\n4\n]\nby Morris Marden\n(\na student of Walsh\n)\nlists\n279\narticles,\n7\nbooks and\n31\nPhD students. He studied the relative location of the zeros of pairs of\nrational functions\n, zeros and topology of extremal polynomials, the critical points and level lines of\nGreen\n's functions and other harmonic functions, conformal mappings,\nPadé\napproximation, and the interpolation and approximation of continuous, analytic or harmonic functions. Sewell writes in\n[\n6\n]\n:-\nPolynomial approximation was neither discovered nor invented by J L Walsh\n(\nwhich may come as a surprise to some mathematicians\n)\n. He is the one individual, however, who took a few scattered results on the subject and extended them, added mightily to them, and knit the whole together into a comprehensive, coherent theory.\nHis books include\nInterpolation and approximation by rational functions in the complex domain\n(1935)\n,\nApproximation to polynomials in the complex domain\n(1935)\n,\nA Bibliography on orthogonal polynomials\n(1940)\n,\nThe location of critical points of analytic and harmonic functions\n(1950)\n,\nApproximation by bounded analytic functions\n(1960)\n, and\nThe theory of splines and their applications\n(1967)\n.\nDuring World War II Walsh again took up his naval service. He was Lieutenant Commander from\n1942\nto\n1943\n, then Commander from\n1944\nto\n1946\n. After the war ended he retained his connection with the navy as a member of the Naval Reserve. He was a Captain for several years in the\n1950\ns before he retired from the service in\n1955\n. He returned to Harvard after his war service in\n1946\nwhen he was named Perkins Professor of Mathematics. He held this position for\n20\nyears until he retired in\n1966\n.\nAs a lecturer Walsh believed in teaching a wide variety of courses. The topics he taught, rotating them from year to year, included calculus, algebra, mechanics, differential equations, complex variable, probability, number theory, potential theory, approximation theory, and function theory.\nWalsh was honoured with election to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1936\nand served as vice president of the\nAmerican Mathematical Society\nin\n1937\nand president in\n1949\n-\n50\n. After retiring from Harvard he moved to the University of Maryland choosing his home in College Park which\n[\n7\n]\n:-\n... had to be at the right walking distance from the University.\nHe continued to work with research students and postdoctoral students at Maryland up to a few months before his death. He died at his home.\nSewell writes\n[\n6\n]\n:-\n... an outstanding ... characteristic of his professional career is his unselfish promotion of research. He has always encouraged others to attack problems which he has proposed ... Throughout his books and articles you will find open problems and he has worked with his students, former students, and colleagues frequently more to encourage them than to produce another paper under his own name.\nThis same sentiment is expressed by\nWidder\nin\n[\n7\n]\n:-\nSurely the outstanding attribute of this man, that would occur first to any of his colleagues, was his devotion to research. He neglected none of his duties connected with his job, but he always arranged that they left him time for his writing. Even as departmental chairman or as president of the\nAmerican Mathematical Society\nhe remained faithful first and foremost to research.",
  "matematicos_citados_na_biografia": [
    "Maxime Bôcher",
    "Bôcher",
    "G D Birkhoff",
    "Montel",
    "Carathéodory",
    "rational functions",
    "Green",
    "Padé",
    "National Academy of Sciences",
    "American Mathematical Society",
    "Widder"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}