{
  "nome_completo": "Joseph Marie de Tilly",
  "nome_curto": "Joseph Tilly",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tilly/",
  "data_nascimento": "16 August 1837",
  "local_nascimento": "Ypres, Belgium",
  "data_morte": "4 August 1906",
  "local_morte": "Munich, Germany",
  "summary": "Joseph Tilly was a Belgian soldier who published works on non-Euclidean geometry.",
  "biografia": "Joseph Tilly\nwas a military man and became a lieutenant in the artillery. Although he undertook deep mathematical research, he certainly did not do this as part of his military duties, although he did teach mathematics as part of these duties. In\n1858\nhe was assigned to teach a mathematics course at the regimental school and it was from this time on that he undertook research into geometry. Of course he was not in  position to have contacts with other mathematicians and for a long period he was completely out of touch with modern developments in geometry which were in fact highly relevant to the research he was undertaking.\nTilly studied the principles of geometry,\nEuclid\n's fifth postulate and\nnon-euclidean geometry\nwithout being aware that this had become a major topic of interest. In\n1860\nhe achieved results similar to those of\nLobachevsky\nin his paper\nRecherches sur les éléments de géométrie\nⓉ\n(\nResearch on the foundations of geometric\n)\nbut at this stage he had not heard about\nLobachevsky\n. It was only in\n1866\nthat he learnt about the work of the famous Russian mathematician on non-euclidean geometry, then in\n1870\nTilly published a work\nÉtudes de méchanique abstraite\non\nLobachevsky\nspace. In this work Tilly was the first to study non-euclidean mechanics, a topic he essentially invented\n(\nsee\n[\n2\n]\nfor details of his contributions to the link between geometry and \"physical theories\"\n)\n. He corresponded with\nJules Hoüel\n, the only French mathematician interested in these topics at that time, only after the publication of his\n1870\npaper which had led\nHoüel\nto realise that here was a mathematician producing results of great interest to him yet unknown by mathematicians working in the universities. Until this point Tilly had worked in isolation and it is certainly worth emphasising just how much harder this had made his research.\nIn\n[\n4\n]\nSemenets examines some aspects of the researches on the foundations of geometry in the second half of the nineteenth century, in particular looking at axiomatic systems proposed by Tilly in his\nEssai sur les principes fondamentaux de la géométrie et de la méchanique\nⓉ\n(\nEssay on the fundamentals of geometry and mechanics\n)\n(1878)\n[\n1\n]\n:-\nTilly established the Riemannian. Lobachevskian, and Euclidean geometries on the concept of the distance between two points. In his formulation these geometries were based, respectively, on one, two, and three necessary and sufficient, irreducible axioms.\nThe culmination of Tilly's work on geometries was the important\nEssai de géométrie analytique générale\nⓉ\n(\nEssay on general analytic geometry\n)\n(1892)\nin which he showed that\n[\n1\n]\n:-\n... geometry was the mathematical physics of distances.\nHe also wrote on military science and the history of mathematics in Belgium.  He made an important historical contribution by writing a history of the first hundred years of the\nRoyal Belgium Academy of Science\n(\nAcadémie Royale des Sciences, des Lettres et des Beaux Arts\n)\n. He undertook this during a period in his career during which he was under extreme pressure, being both director of the arsenal at Antwerp and director of studies at the École Militaire. It was also made more difficult by the fact that Tilly did not have easy access to library material which is so necessary in order to write an authoritative historical work.\nThere were complaints that Tilly had unduly emphasised the scientific education of future officers at the École Militaire. An inspector at the military school declared that Tilly was not allowed to use differentials, and that he must cease immediately from any mention of the infinitely small. Tilly must have carried on with his methods of teaching calculus despite these warnings and as a consequence he was dismissed from his post and forced into early retirement in August\n1900\n.\nIf the military were not well disposed towards his methods, the same could not be said for his fellow mathematicians who considered him one of the most profound Belgium mathematicians of all time. He was elected a corresponding member of the\nRoyal Belgium Academy of Science\nin\n1870\n, and a full member in\n1878\n. He was further honoured by being elected president of the\nBelgium Academy\nin the year\n1887\n.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "non-euclidean geometry",
    "Lobachevsky",
    "Jules Hoüel",
    "Hoüel",
    "Royal Belgium Academy of Science",
    "Belgium Academy"
  ],
  "imagens": [
    "tilly.jpg"
  ]
}