{
  "nome_completo": "Joseph Ludwig Raabe",
  "nome_curto": "Joseph Raabe",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Raabe/",
  "data_nascimento": "15 May 1801",
  "local_nascimento": "Brody, Galicia (now Ukraine)",
  "data_morte": "22 January 1859",
  "local_morte": "Zürich, Switzerland",
  "summary": "Joseph Raabe is mostly remembered for Raabe's Test for convergence of series.",
  "biografia": "Joseph Raabe\n's first name is often written as 'Josef' while his second name is sometimes written as 'Rabe'. Since his parents were poor, Raabe did not have the educational opportunities as a young boy so he had to learn mathematics largely working on his own. He was a very able young lad and was well able to earn a living as a private tutor of mathematics while he himself studied more advanced topics. By the age of nineteen, he had made enough from tutoring to travel to Vienna where he continued to fund himself by giving private tuition but, at the same time, he was able to study mathematics at the Polytechnikum.\nIn Vienna, Raabe was inspired by Johann von Littrow\n(1781\n-\n1840)\n, who encouraged him to submit his work for publication in\nAugust Crelle\n's\nJournal für die reine und angewandte Mathematik\nwhich began publication in\n1826\n. Von Littrow had studied at the Charles University of Prague, spent a period in Russia, and had been appointed professor of astronomy at the University of Vienna in\n1819\n, shortly before Raabe arrived in that city. He became director of the first university observatory in Vienna and is remembered today through a crater on the moon that is named after him, and for the Littrow map projection. He published a paper in Part\n3\nof Volume\n1\n(1826)\nof\nCrelle\n's\nJournal\nand Raabe's first paper in that journal, entitled\nAllgemeine Theorie der Epicykeln\nⓉ\n(\nThe general theory of epicycles\n)\n, appeared in Part\n4\nof Volume\n1\n. It is worth noting that his name appears both in the index and on the paper as \"L Rabe of Vienna\" but there is no doubt that this paper is by Joseph Raabe. In the second volume of the journal, published in\n1827\n, Raabe has five papers:\nÜber den Stillstand der Planeten\nⓉ\n(\nOn the stoppage of planets\n)\n;\nSphärische Polygonometrie\nⓉ\n(\nSpherical polygonometry\n)\n;\nEigenschaften der Curven, die sich auf bestimmten Oberflächen befinden; letztere zu beweisen\nⓉ\n(\nCharacteristics of curves that are located on certain surfaces and to prove the latter\n)\n;\nUntersuchung über die Directrixen der Curven\nⓉ\n(\nInvestigation into the directrixes of curves\n)\n; and\nGleichungen der zweiten Ordnung in der Geometrie\nⓉ\n(\nEquations of the second order in geometry\n)\n. He also has a a contribution in\nAufgaben und Lehrsätze, erstere aufzulösen\nⓉ\n(\nProblems and theorems, and solving the former\n)\n. Again we should note the different ways that his name appears in the volume. For example, for the paper\nSphärische Polygonometrie\nⓉ\n(\nSpherical polygonometry\n)\nhis name appears in the index as \"L Raabe\", but on the paper itself as \"Joseph L Rabe\". For the paper\nEigenschaften der Curven\nⓉ\n(\nProperties of curves\n)\nhis name appears in the index as \"J Raabe\", but on the paper itself as \"L Raabe\", while for the paper\nÜber den Stillstand der Planeten\nⓉ\n(\nAbout the standstill of the planets\n)\nhis name appears in the index as \"L Raabe\", but on the paper itself as \"Joseph L Raabe\".\nThe first cholera pandemic to hit Europe started in\n1829\nin Moscow and St Petersburg and, over the next couple of years, spread through Poland, Germany and Austria. The disease was a major killer and spread panic through the population of the cities that it reached. By the autumn of\n1831\nit had reached Vienna and Raabe had no option but to stop giving his private mathematics lessons. He wanted to go to Munich and\nhabilitate\nat the University there but he had a good friend in Vienna, the astronomer and geodesist Johannes Eschmann\n(1808\n-\n1852)\n, who persuaded him to go instead to Zürich. Eschmann was Swiss, growing up as orphan in Winterthur, and had studied mathematics, astronomy and geodesy in Zürich, Paris and Vienna. He was studying under Johann von Littrow in Vienna when he became friends with Raabe. Eschmann and Raabe went to Zürich and Raabe found a home there and a position teaching mathematics at the\nGymnasium\n. In\n1833\nthe University of Zürich was founded by J K Orelli, and Laurenz Oken was appointed as its first rector. They made two inspiring appointments as\nprivatdocent\nin mathematics,\nGräffe\nand Raabe. Johannes Eschmann, Raabe's friend, was appointed to a similar position in astronomy.\nToday Raabe's name is mostly remembered for Raabe's Test for convergence of series. This test appears in Raabe's paper\nNote zur Theorie der Convergenz und Divergenz der Reihen\nⓉ\n(\nNote on the theory of convergence and divergence of series\n)\nwhich was published in Volume\n11\n(1834)\nof\nCrelle\n's\nJournal\n. In fact Raabe did not publish any papers in\nCrelle\n's\nJournal\nafter those we mentioned above in the first two volumes until this\n1834\npaper. He had published another paper on series while still in Vienna, however, namely\nÜber Reihen, deren Differenzenreihen wiederkehren\nⓉ\n(\nAbout rows whose difference rows recur\n)\n(1829)\n. The\n1834\npaper contains the famous Raabe's Test:\nSuppose\n(\na\nn\n)\n(a_{n})\n(\na\nn\n​\n)\nis a sequence of positive terms and suppose that\na\nn\na\nn\n+\n1\n=\n1\n+\ns\nn\n+\no\n(\n1\nn\n2\n)\n\\Large\\frac{a_{n}}{a_{n+1}}\\normalsize  = 1 + \\Large\\frac{s}{n}\\normalsize  + o(\\Large\\frac{1}{n^{2}\\normalsize})\na\nn\n+\n1\n​\na\nn\n​\n​\n=\n1\n+\nn\ns\n​\n+\no\n(\nn\n2\n1\n​\n)\nwhere\ns\ns\ns\nis a constant.\nThen the series\na\n1\n+\na\n2\n+\na\n3\n+\na_{1} + a_{2} + a_{3} +\na\n1\n​\n+\na\n2\n​\n+\na\n3\n​\n+\n... converges if\ns\n>\n1\ns > 1\ns\n>\n1\nand diverges if\ns\n<\n1\ns < 1\ns\n<\n1\n. It is inconclusive if\ns\n=\n1\ns = 1\ns\n=\n1\n.\nThis test, which is an extension of\nd'Alembert\n's ratio test, often succeeds for series in which the terms contain factorials, where\nd'Alembert\n's simple ratio test is inconclusive.\nIn\n1836\nthe University of Zürich appointed a professor of mathematics but the chair was not given to Raabe but rather to Anton Müller, a somewhat undistinguished mathematician. Not only was Raabe passed over, but so was his fellow docent, the talented\nKarl Heinrich Gräffe\n. Over the following years, Müller published no research of any merit while both Raabe and\nGräffe\ncontinued to produce highly significant contributions. Raabe's work on the\nBernoulli\npolynomials deserves special mention. He wrote two major papers, a\n52\n-page one in\n1848\nentitled\nDie Jacob Bernoullische Function\nⓉ\n(\nThe Jacob Bernoulli function\n)\nand a\n30\n-page paper\nZuruckfuhrung Einig Summen und auf die bestimmten Integrale Jakob Bernoullische Function\nⓉ\n(\nRepeating sums and  the definite integrals  of the Jacob Bernoulli Function\n)\npublished in\n1851\n. The term \"Bernoulli polynomials\" was introduced by Raabe in this paper of\n1851\n. We should also mention the important\n3\n-volume treatise\nDifferential- und Integralrechnung\nⓉ\n(\nDifferential and integral calculus\n)\n(\nZürich,\n1839\n-\n47)\nwhich can still be purchased today, and the\n2\n-volume\nMathematischer Mittheilungen\nⓉ\n(\nMathematical communications\n)\n(1857\n-\n58)\n. He also published\nWas ist der Gegenstand der Mathematik?\nⓉ\n(\nWhat is the subject of mathematics?\n)\nin\n1853\n.\nIn\n1855\nthe Eidgenössische Polytechnische Schule was founded in Zürich\n(\nthis institution was, in\n1911\n, called the Eidgenössische Technische Hochschule or the Swiss Federal Institute of Technology\n)\n. Raabe was appointed as a professor at the Eidgenössische Polytechnische Schule in the year of its founding, but he did not hold this chair for long since he left his chair in\n1858\nand died in January of the following year at the age of\n57\nyears.\nRichard Dedekind\napplied for Raabe's chair and was appointed in the spring of\n1858\n, taking up the chair in the autumn of that year.",
  "matematicos_citados_na_biografia": [
    "August Crelle",
    "Crelle",
    "habilitate",
    "Gymnasium",
    "privatdocent",
    "Gräffe",
    "d'Alembert",
    "Karl Heinrich Gräffe",
    "Bernoulli",
    "Richard Dedekind"
  ],
  "imagens": [
    "raabe.jpg"
  ]
}