{
  "nome_completo": "Julius Ludwig Weisbach",
  "nome_curto": "Julius Weisbach",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weisbach/",
  "data_nascimento": "10 August 1806",
  "local_nascimento": "Mittelschmiedeberg (near Annaberg), Germany",
  "data_morte": "24 February 1871",
  "local_morte": "Freiberg, Germany",
  "summary": "Julius Weisbach was a German mathematician who wrote on mechanics, hydraulics and surveying as well as mathematics.",
  "biografia": "Julius Weisbach\n's father was Christian Gottlieb Weisbach and his mother was Christina Rebekka Stephan. Julius's father was the foreman at a mine, so the family were not well off, particularly since there were nine children. Of the children, Julius was the second youngest.\nWeisbach was educated at the lyceum in Annaberg near his home town, then at the Bergschule in Freiberg. Having completed the courses at these schools by\n1822\n, Weisbach wanted to continue his education. However, his parents could not afford to finance him so he borrowed money to enable him to attend the Bergakademie in Freiberg.\nIn\n1827\nWeisbach was advised by Friedrich Mohs to study at Göttingen. Mohs was the famous German mineralogist who, in\n1812\n, devised a scale, now known as the Mohs scale, to determine the hardness of a mineral by observing whether its surface is scratched by various substances of known hardness. Weisbach followed Mohs' advice and spent two years in Göttingen before moving to the University of Vienna. The reason for this move was that Mohs had gone to Vienna. In Vienna, Weisbach studied mathematics, physics and mechanics.\nDuring\n1830\nWeisbach travelled on foot for six months through Hungary, the Tyrol, Bavaria, and Bohemia. From\n1831\nhe taught mathematics at the Freiberg\nGymnasium\nand, starting in\n1832\n, he also taught mathematics at the Bergakademie in Freiberg. In this same year of\n1832\n, Weisbach married Marie Winkler and they would have a son who was to became the Professor of Mineralogy at the Bergakademie in Freiberg.\nIn\n1836\nWeisbach was promoted to professor, and his expertise was now such that in addition to mathematics he was professor of mine machinery and of surveying. He had, at this stage only one publication, but this would soon change. From around\n1839\nhe became interested in hydraulics and some of his most important work would be done on this topic. This interest in hydraulics seems to have been as a result of Weisbach visiting the Paris Industrial Exposition in\n1839\n.\nHis interests were always wide and this is reflected in the range of courses that Weisbach was teaching around this time: descriptive geometry, crystallography, optics, mechanics and machine design.\nIn\n1855\nZürich Polytechnikum opened, and in the year prior to that they made a serious attempt to appoint quality staff. For example they appointed\nClausius\nas professor of physics, but Weisbach was not tempted by the offer that was made to him and preferred to remain in Freiberg. In\n1855\nWeisbach was back in Paris, this time visiting the World Exposition which was held there.\nWe have indicated the range of Weisbach's interests and this can be seen from the topics of the fourteen books and\n59\npapers he wrote on mechanics, hydraulics, surveying, and mathematics. It is in hydraulics that his work was most influential, with his books on the topic continuing to be of importance well into the\n20\nth\ncentury.\nAmong the honours Weisbach received for his contributions to science were honorary degrees from Leipzig, and election to membership of various learned societies such as the\nSt Petersburg Academy of Sciences\n, the\nRoyal Swedish Academy of Sciences\nand the\nAccademia dei Lincei\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Clausius",
    "St Petersburg Academy of Sciences",
    "Royal Swedish Academy of Sciences",
    "Accademia dei Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}