{
  "nome_completo": "Karl Heinrich Weise",
  "nome_curto": "Karl Heinrich Weise",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weise/",
  "data_nascimento": "24 May 1909",
  "local_nascimento": "Gera, Thüringen, Germany",
  "data_morte": "15 April 1990",
  "local_morte": "Kiel, Germany",
  "summary": "Karl-Heinrich Weise was a German mathematician who worked on differential geometry and topology.",
  "biografia": "Karl Heinrich Weise\nwas born in Gera, a town in Thüringen, Germany, on the Weisse Elster River about\n55\nkm southwest of Leipzig. After completing his schooling at the\nGymnasium\n, he studied at the university in Leipzig and then in Jena with Robert König as his thesis supervisor. In\n1934\nhe was awarded his doctorate for his thesis\nBeiträge zum Klassenproblem der quadratischen Differentialformen\nⓉ\n(\nContributions to the class problem of quadratic differential forms\n)\n. He continued undertaking research at Jena and, in\n1937\n, he got the\nHabilitation\nand became an Assistant and\nPrivatdozent\nthere. As an example of his work from this period we mention three papers he published in\n1940\n:\n(\nwith Robert König\n)\nZur konformen Abbildung zweier Flächen mit beliebigen Parametern\nⓉ\n(\nOn conformal mapping of two surfaces with any parameters\n)\n;\nBemerkung zur Abbildung zweier Flächen\nⓉ\n(\nRemarks on the mappings of two surfaces\n)\n; and\nInvariante Charakterisierung von Kurvennetzen\nⓉ\n(\nInvariant characterization of curve networks\n)\n. On\n1\nNovember\n1942\nhe was appointed 'planmässiger ausserordentlicher Professor'\n(\nassociate professor with tenure\n)\nat the Christian Albrechts Universität in Kiel where he was promoted to a full professorship on\n1\nNovember\n1945\n, becoming the successor of Adolf Hammerstein\n(1888\n-\n1941)\n.\nDue to World War II, lecturing had stopped in Kiel in\n1943\nas bombing raids intensified. During the bombing, the rooms of the 'Mathematisches Seminar' had been completely destroyed and so it was Weise's task to make a new start under extremely difficult circumstances. In fact the first courses were given on a ship that had survived the bombing. Later the university moved to a new campus\n(\n'Neue Universität', a name that often has led to misunderstandings\n)\nthat was inherited from a military factory that, in contrast to the old main building of the university, also had survived the bombing. Together with\nFriedrich Bachmann\n, who was appointed to a second professorship of mathematics in\n1948\n, he had the main share in rebuilding mathematics in Kiel after the war. Not only did he give vivid and inspiring lectures on many topics, in particular on analysis, but also he soon showed a particular talent for organisational tasks: for the year\n1951\n-\n52\nhe was elected dean of the faculty of philosophy, and for the year\n1952\n-\n53\nrector of the university. One of his former students who went on to become a professor, Manfred Schimmler, commented on Weise's organisational skills\n[\n1\n]\n:-\nHe was the kind of manager who knew how to surround himself with the right people and from this the correct actions came about.\nWeise very early realized the potential of electronic computers for mathematics and in fact in\n1957\n-\n58\n, together with the nuclear physicist Erich Bagge, he founded the computer centre of the university. Hans Langmaack, a professorial colleague at Kiel, said\n[\n1\n]\n:-\nHe never taught computer science, but he was the visionary who saw how important this subject is.\nAlthough he had both experience and talent for numerical computations and lectured on many aspects of numerical mathematics, he also realized the possibility of doing non-numerical computations and so he insisted that Kiel would get flexible binary computers. Their first computer was a Z\n22\nof\nKonrad Zuse\n, and later came the X\n1\nand X\n8\nof Electrologica. Weise himself, with an assistant, did computations on knot theory, Bodo Schender, one of his former students who was to become the first professor of computer science at Kiel, developed formula manipulation methods for trigonometric functions, and also the first steps in what is now known as 'Computational Group Theory' were undertaken as early as\n1959\non the Z\n22\n. In\n1971\nWeise also founded a new 'Institut für Informatik und Praktische Mathematik' which became the nucleus of Computer Science at Kiel. He served as Director of the Institute from\n1971\nto\n1977\n.\nWeise also lent his insight and organisational talent to a wide range of organisations furthering science in Germany. In\n1955\n-\n56\nhe was elected chairman of the 'Deutsche Mathematiker-Vereinigung'\n(\nGerman mathematical society\n)\n, from\n1964\nto\n1970\nhe was a member of the 'Wissenschaftsrat', the central advisory body for the federal government on the development of science in Germany, and Chairman of the 'Wissenschaftliche Kommission'. He also served as 'Vertrauensdozent'\n(\nLocal representative\n)\nof the Deutsche Forschungsgemeinschaft, as a member of the advisory committee on Computer Science of the federal ministry for research, and last but not least supported in many ways the development of the Oberwolfach Institute. In recognition of his services he was awarded the 'Bundesverdienstkreuz'\n(\norder of merit of the Federal Republic\n)\n.\nWeise's mathematical work was mainly on questions from\ndifferential geometry\nand topology. In\n1951\n, jointly with Robert König, he published the book\nMathematische Grundlagen der Höheren Geodäsie und Kartographie\nⓉ\n(\nMathematical foundations of higher geodesy and cartography\n)\n. N A Hall writes in a review:-\nThe field of higher geodesy and cartography is one specialized branch of geometry and analysis which has been the subject of many particular investigations. Generalizations developed from it have usually resulted in advances in broader fields of pure mathematics. In this book the authors endeavour an elaborate generalization but successfully restrict themselves to the selected field. ... The major contribution is the introduction of general complex vector coordinates for the spheroid such that a direct cartographic transformation can be stated and such that methods of complex function theory can be applied. As a treatment of cartography there is an unexpected but beneficial lack of reference to specific map projections. The analysis rests on the properties of three basic complex vector surface coordinates for the spheroid.\nIn years soon after the war Weise published a small but concise book\nGewöhnliche Differentialgleichungen\nⓉ\n(\nOrdinary differential equations\n)\n(1948)\nin which he discusses\nLegendre\n,\nBessel\n, and\nSturm\n-\nLiouville\nequations. Also mentioned are existence theorems as well as solutions by iteration, power series, and numerical methods. In\n1951\n, he published his lecture notes on\nAnalytical Mechanics\n. In\n1966\nhe published, as volume XVII of\nStudia Mathematica\n, the monograph\nDifferentialgleichungen\nⓉ\n(\nDifferential equations\n)\n. A reviewer writes:-\nA student will actually learn everything about this theory which is essential. The treatment is elegant, the text is easy to understand, and carefully written.\nWeise acted as supervisor of PhD students from a wide range of mathematical fields, a dozen of them went on to become professors, among them Wolfgang Gaschütz\n(\nfinite groups\n)\n, Wolfgang Haken\n(\nknot theory and the solution of the four-colour-problem\n)\n,\nWilhelm Klingenberg\n(\ndifferential geometry\n)\nand Jens Mennicke\n(\ntopology\n)\n. Let us look in a little more detail at Weise's influence on one of these students, Wolfgang Haken, who studied mathematics, physics and philosophy at the University of Kiel. Haken attended Heinrich Heesch's talk on his contributions to the Four Colour Problem, but he was most enthused by Weise's lectures on topology. In these lectures, Weise described three long-standing unsolved problems - the\nPoincaré\nConjecture, the Four Colour Problem, and a problem on knot theory. Haken decided to attempt to solve all three problems and began this challenge while studying for a doctorate at Kiel with Weise as his thesis advisor. His thesis, submitted in\n1953\n, was\nEin topologischer Satz über die Einbettung\n(\nd-\n1)\n-dimensionaler Mannigfaltigkeiten in d-dimensionale Mannigfaltigkeiten\nⓉ\n(\nA topological theorem on the embedding of\n(\nd-\n1)\n-dimensional manifolds in d-dimensional manifolds\n)\n. He had solved the knot theory problem and this led to his appointment at the University of Illinois in the United States. Eventually, assisted by\nKenneth Appel\n, he solved the Four Colour Problem in\n1976\nwith the aid of computer techniques.\nWeise was retired on\n30\nSeptember\n1977\n, and in the following year the Christian Albrechts Universität conferred on him the title of 'Ehrensenator'\n(\nhonorary senator\n)\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Habilitation",
    "Privatdozent",
    "Friedrich Bachmann",
    "Konrad Zuse",
    "differential geometry",
    "Legendre",
    "Bessel",
    "Sturm",
    "Liouville",
    "Wilhelm Klingenberg",
    "Poincaré",
    "Kenneth Appel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}