{
  "nome_completo": "Kazimierz Zarankiewicz",
  "nome_curto": "Kazimierz Zarankiewicz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zarankiewicz/",
  "data_nascimento": "2 May 1902",
  "local_nascimento": "Częstochowa, Russian Empire (now Poland)",
  "data_morte": "5 September 1959",
  "local_morte": "London, England",
  "summary": "Kazimierz Zarankiewicz was a Polish mathematician who worked in topology.",
  "biografia": "Kazimierz Zarankiewicz\nwas born and brought up in Czestochowa in south-central Poland. He attended secondary school in Bedzin, which is near Czestochowa, and for much of his time at school Poland was going through the difficult events of World War I.\nWhen we say that Zarankiewicz was brought up in Poland, this must be seen in relation to the political circumstances of the time. Poland had been partitioned in\n1772\nwith the south, which was called Galicia, under Austrian control and Russia in control of much of the rest of the country. This situation, which was the position throughout the early years of Zarankiewicz's life, lasted until the outbreak of World War I in\n1914\n. At this time Russia tried to win Polish support, particularly in Galicia, by promising the Poles autonomy. By the end of\n1914\nRussian forces controlled almost all of Galicia.\nHowever, the Central Powers\n(\nGermany and Austria- Hungary\n)\nrecaptured Galicia and large parts of Congress Poland which had been under Russian control. A German governor general was installed in Warsaw and a new Kingdom of Poland was declared on\n5\nNovember\n1916\n. The University of Warsaw, which had been a Russian language university for many years, became Polish again in November\n1915\nfollowing the withdrawal of the Russian forces from Warsaw in August\n1915\n.\nZarankiewicz completed his secondary school education and entered the University of Warsaw in\n1919\n. From the time its reopening the university had rapidly become a leading world centre for\ntopology\n.\nJaniszewski\nand\nMazurkiewicz\nwere conducting a topology seminar there from\n1917\nonwards,\nSierpiński\narrived in\n1918\n, and in\n1919\n, the year Zarankiewicz arrived,\nKuratowski\nhad just graduated and was beginning his doctoral studies.\nSaks\nwas also studying for his doctorate at this time.\nWith such a concentration on topology, and the excitement of those studying this new discipline in their newly freed country, it is not surprising that this was the area which attracted Zarankiewicz. He wrote his doctoral dissertation on cut points in connected sets and, in\n1923\n, he was awarded a Ph.D. Although his thesis was published, this did not happen until\n1927\n.\nZarankiewicz was appointed to Warsaw University as an assistant in\n1924\nand continued with his research on topological properties of the plane for his\nhabilitation\nthesis. On acceptance of this thesis in\n1929\nZarankiewicz was appointed as a dozent at the University of Warsaw. During the year\n1930\n-\n31\nhe visited Vienna where he worked with\nMenger\n, and he also visited Berlin where he worked with von\nMises\n,\nBergman\nand others.\nOn his return to Warsaw, Zarankiewicz taught both at the Polytechnic and at the Agricultural College. There was no position for him at the university at this time so he was not able to teach his specialist research topics, but rather he had to teach mechanics, and statistics. However, he taught a course on\nconformal mappings\n, one of his current research interests, for a semester at Tomsk in\n1936\n. After he returned to Warsaw from Tomsk he substituted for the professor at Warsaw Polytechnic in\n1937\n. He was put forward for a professorship himself in\n1939\nbut the events of that year, namely the start of World War II, brought normal life to an end and his professorship would have to be put on hold to be considered again only at the end of the war.\nZarankiewicz risked his life during the war teaching in the underground university which had been set up by the Poles in German occupied Warsaw to try to keep the intellectual life going.\nKuratowski\nwrites in\n[\n2\n]\n:-\nAlmost all our professors of mathematics lectured at these clandestine universities, and quite a few of the students then are now professors or\ndocent\nthemselves. Due to that underground organisation, and in spite of extremely difficult conditions, scientific work and teaching continued, though on a considerably smaller scale of course. The importance of clandestine education consisted among others in keeping up the spirit of resistance, as well as optimism and confidence in the future, which was so necessary in the conditions of occupation. The conditions of a scientist's life at that time were truly tragic. Most painful were the human losses.\nZarankiewicz paid dearly for teaching in the underground university for in\n1944\nhe was sent to a labour camp in Germany. He survived this experience and returned to Warsaw at the end of the war in\n1945\n. He resumed his teaching duties in\n1946\nat Warsaw Polytechnic. The long delayed decision to promote him to professor at Warsaw Polytechnic eventually took effect and, in\n1948\n, he became a full professor. Also in\n1948\nhe went to the United States for several months and taught at a number of universities including Harvard.\nZarankiewicz did important work in topology and graph theory. He also wrote on complex functions and\nnumber theory\n. His work on\ntriangular numbers\ninspired\nSierpiński\nto further work on this topic while Zarankiewicz also worked jointly with\nKuratowski\non topology. Another of his favourite research topics was complex function theory and, in this topic, he proved results which\n[\n1\n]\n:-\n... played an important role in the development of the theory of the kernel and its generalisations to several variables, notably to pseudo-conformal transformations in space of more than three dimensions.\nZarankiewicz made several other important contributions to mathematics. From\n1949\nuntil\n1957\nhe coached the Polish Olympiad team of school pupils. He served as president of the Warsaw section of the\nPolish Mathematical Society\nfrom\n1948\ntill\n1951\n. His death in London in\n1959\ncame during the Tenth Congress of the International Astronautical Federation of which he was the President.",
  "matematicos_citados_na_biografia": [
    "topology",
    "Janiszewski",
    "Mazurkiewicz",
    "Sierpiński",
    "Kuratowski",
    "Saks",
    "habilitation",
    "Menger",
    "Mises",
    "Bergman",
    "conformal mappings",
    "docent",
    "number theory",
    "triangular numbers",
    "Polish Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}