{
  "nome_completo": "Kentaro Yano",
  "nome_curto": "Kentaro Yano",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yano/",
  "data_nascimento": "1 March 1912",
  "local_nascimento": "Tokyo, Japan",
  "data_morte": "25 December 1993",
  "local_morte": "Tokyo, Japan",
  "summary": "Kentaro Yano was a Japanese mathematician who worked on differential geometry.",
  "biografia": "Kentaro Yano\n's father was a sculptor. Kentaro explains in\n[\n4\n]\nthat the direction his research would take was actually a consequence of a visit by\nEinstein\nto Japan when he was ten years old, in the fifth class of primary school in Tokyo. Everyone in Japan was saying that the theory of relativity was so difficult that only twelve people in the world could understand it. However, Kentaro's father said to him:-\nI do not know how difficult the theory of relativity is to understand, but it was not created by God, it was created by a human being called\nAlbert Einstein\n. So Kentaro! I am sure that if you study hard you may someday understand what the theory of relativity is.\nThis stuck with Kentaro so when he was in secondary school and discovered that his physics textbook had an appendix on the theory of relativity, he tried to read it. Not finding it too difficult he spoke to his physics teacher who explained to him that what he had read was the special theory of relativity. To understand the general theory of relativity one had to study\ndifferential geometry\n. Kentaro immediately made the decision to study differential geometry at university.\nAfter completing his secondary education, Yano took the entrance examinations for the University of Tokyo in\n1931\n. He entered the university and, together with some fellow students who also were keen to learn about differential geometry and Riemannian geometry, he studied some of the major texts such as those by\nSchouten\n,\nWeyl\n,\nEisenhart\n,\nLevi-Civita\nand\nCartan\n. After completing his undergraduate studies in\n1934\n, Yano began to undertake research in differential geometry at the University of Tokyo. He read widely on the topic and decided that the ideas of\nÉlie Cartan\nattracted him most. He therefore decided to go to Paris to study with\nCartan\nand began to work for one of three science scholarships which were awarded for Japanese students each year to study for two years in France.\nHe set out from Tokyo on a journey to Paris which took around\n30\ndays by boat and train. He was in Paris for the start of the academic year\n1936\n.\nS S Chern\nhad also gone to Paris at the same time to work with\nCartan\n. He writes about Yano at this time in\n[\n3\n]\n:-\nOne could not fail to notice Yano's capacity for hard work. The library of the Institute was at that time a big room walled by bookshelves with tables in the middle. Yano's presence almost equalled that of the librarian. We were both working on \"projective connections\". he was writing his thesis ...\nYano returned to Tokyo in\n1938\nwhere he worked at the Tokyo Institute of Technology. He remained on the staff at the Institute for the whole of his career but made many trips abroad and spent long periods in other universities. We shall indicate below details of some of these visits.\nOf course World War II started in the year following Yano's return to Tokyo from Paris and during the war years of\n1939\n-\n45\nYano was isolated from most mathematicians. After the war, he wrote a book\nGeometry of Connections\nin Japanese which was published in\n1947\n. A Kawaguchi writes:-\nThe author says in the preface that the chief purpose of this book is to explain\nE Cartan\n's geometrical interpretation of the concept \"connection,\" as plainly as possible and to make clear its relations to other new differential geometries. The book is written very clearly and simply and avoids concepts that may be difficult for beginners to understand. It is not intended as a treatise for the expert, but the reviewer believes it to be one of the best for the beginner in the geometry of connections.\nIn\n1949\nYano published an English monograph\nGroups of Transformations in Generalized Spaces\nwhich described the work on\nLie\nderivatives and groups of transformations which he had studied during World War II. He soon learnt of the methods concerning curvature and\nBetti\nnumbers developed by\nBochner\nat Princeton during the war years. Yano wanted to learn of these methods so that he could study global differential geometry rather than the local version he had been studying up to that time. He was able to go to Princeton as\nVeblen\n's assistant and spent a very profitable time there. Not only was he able to attend the International Congress of Mathematicians in Harvard in\n1950\nbut he was also able to publish papers on curvature and\nBetti\nnumbers.\nBochner\nsuggested to Yano that he write up all the known results on this topic and this resulted in the joint publication of the monograph\nCurvature and Betti numbers\npublished by\nPrinceton University Press\nin\n1953\n.\nWhile in the United States, Yano received an invitation to teach at the University of Rome and to attend the International Congress on Differential Geometry in Italy in\n1953\n. He attended the Congress, then made visits to Paris, Durham, Leeds, Southampton, Amsterdam, Leiden and Marseilles before returning to Rome to give a lecture course at the Istituto nazionale di Alta Matematica. Although he lectured in French, his lectures were translated into Italian and published as\nGruppi di trasformazioni in spazi geometrici differenziali\nby the Istituto Matematico in Rome. In the following year Yano attended the International Congress of Mathematicians in Amsterdam in September\n1954\n, then spent six months as a visiting professor at the the Mathematical Centre in Amsterdam. Here he collaborated with\nJ A Schouten\nand they published four joint papers on almost complex manifolds and the Nijenhuis tensor.\nYano participated in the\nAmerican Mathematical Society\nmeeting on Differential Geometry at the University of Washington in the summer of\n1956\n. In the following year his book\nThe theory of Lie derivatives and its applications\nwas published. H C Wang writes:-\nThis is a comprehensive treatise of the theory of\nLie\nderivatives. Using a unified method, the author establishes most of the known results on groups of local automorphisms of spaces with geometrical objects. When the space is compact Riemannian or compact pseudo-Kählerian, global properties are also discussed. The proofs are given in detail, and the presentation is clear.\nHe then spent three months at the University of Southampton in\n1958\n. Being in the UK it was easy for him to attend the International Congress of Mathematicians in Edinburgh which was held in that year. In\n1960\nhe spent six months in Hong Kong as a visiting professor and his lectures there were later written up and published as\nDifferential geometry on complex and almost complex spaces\n(1965)\n. Although the book is self-contained it continues to develop the material treated in Yano's earlier books\nCurvature and Betti numbers\nand\nTheory of Lie derivatives and its applications\n.\nRegular visits abroad were the pattern of Yano's life. He was in Zürich in June\n1960\nfor the International Symposium on Differential Geometry and Topology, spent April, May and June of\n1961\nat the University of Washington, then spent a month at the University of Southampton followed by two months at the University of Liverpool in\n1962\n. From England he travelled to the International Congress of Mathematicians in Stockholm in\n1962\n. For six months of\n1963\nhe was at Brown University. During a visit to the University of Illinois in\n1968\n, Yano was able to complete work on\nIntegral formulas in Riemannian geometry\npublished in\n1970\n. In\n1969\n, as well as a week at a meeting on Differential Geometry at Oberwolfach, Germany, he spent time at Queen's University in Canada. In\n1970\nafter visiting the University of Durham, Yano went to Nice for the International Congress then visited Michigan State University for two months on his way back to Tokyo. He was then appointed as Dean of the Faculty of Science at the Tokyo Institute of Technology and he had to cancel a trip to Hong Kong so that he could carry out his duties.\nIn\n1972\nYano retired from the Tokyo Institute of Technology. The book\nDifferential geometry in honour of Kentaro Yano\nwas published for his retirement. Here is an extract from the Preface:-\nThis book is a collection of papers in differential geometry contributed by friends, colleagues and former students of Professor Kentaro Yano to celebrate his sixtieth birthday and in observance of his retirement from his position as Dean of Science at Tokyo Institute of Technology. To gauge the magnitude of his contribution to differential geometry, it suffices to recall his mathematical work, extending over the past four decades, which covers such diverse areas of geometry as affine, projective and conformal connections, geometry of Hermitian and Kählerian manifolds, holonomy groups, automorphism groups of geometric structures, harmonic integrals, tangent and cotangent bundles, submanifolds, and integral formulas in Riemannian geometry. His work has exercised great influence on geometers both in this country and abroad. Thus it is very fitting to dedicate this volume to Professor Yano as a token of our esteem and friendship.\nOf course Yano's research did not slacken when he retired, nor did his many trips abroad. For example in\n1973\nhe attended the\nAmerican Mathematical Society\nmeeting at Stanford University from\n30\nJuly to\n17\nAugust. He was in Korea for the Symposium on Differential Geometry at Seoul and Kyunpook Universities from\n14\nto\n18\nSeptember, then he was in Rome to celebrate the\n100\nth\nbirthday of\nLevi-Civita\nat the\nAccademia Nazionale dei Lincei\nin December. In\n1978\nhe was in Helsinki for the International Congress, then in the following year he was at the Symposium held at the University of California, Berkeley, to celebrate the retirement of\nS S Chern\n. Yano was back in Berkeley in\n1980\nfor the International Congress of Mathematical Education held in August of that year.\nYano's publication record is amazing. MathSciNet lists\n329\nitems that he has published. We make no attempt to give any details of his papers but let us list the books he has published since retiring. They are:\n(\nwith Shigeru Ishihara\n)\nTangent and cotangent bundles: differential geometry\n(1973)\n;\n(\nwith Masahiro Kon\n)\nAnti-invariant submanifolds\n(1976)\n;\n(\nwith Masahiro Kon\n)\nCR submanifolds of Kählerian and Sasakian manifolds\n(1983)\n; and\n(\nwith Masahiro Kon\n)\nStructures on manifolds\n(1984)\n. Let us quote from a review of this last mentioned book:-\nThe purpose of this book is to provide an introduction to the theory of various differential-geometric structures on manifolds and to gather and organize the results on submanifolds of Riemannian manifolds and of Kählerian manifolds with such structures.  ... the authors have done a very good job of organizing many important results in one place. The book is well written. It should be a very valuable addition to libraries.\nAlmost every review of one of Yano's books contains a variant on the statement:-\nThe book is well written and carefully organized.\nWe end our biography with these words which typify the remarkable contributions of an outstanding mathematician.",
  "matematicos_citados_na_biografia": [
    "Einstein",
    "Albert Einstein",
    "differential geometry",
    "Schouten",
    "Weyl",
    "Eisenhart",
    "Levi-Civita",
    "Cartan",
    "Élie Cartan",
    "S S Chern",
    "E Cartan",
    "Lie",
    "Betti",
    "Bochner",
    "Veblen",
    "J A Schouten",
    "American Mathematical Society",
    "Accademia Nazionale dei Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}