{
  "nome_completo": "Emil Klaus Julius Fuchs",
  "nome_curto": "Klaus Fuchs",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuchs_Klaus/",
  "data_nascimento": "29 December 1911",
  "local_nascimento": "Rüsselsheim, Germany",
  "data_morte": "28 January 1988",
  "local_morte": "Dresden, East Germany",
  "summary": "Klaus Fuchs was a German theoretical physicist best known as an atomic spy who supplied information to the Soviet Union.",
  "biografia": "Klaus Fuchs\n' parents were Emil Fuchs and Else Wagner. Emil Fuchs was a Lutheran minister who later became professor of theology at Leipzig University. He had a strong influence on his son\n[\n4\n]\n:-\nI had a very happy childhood. I think the one thing that most stands out is that my father always did what he believed to be the right thing to do and he always told us that we had to go our own way even if he disagreed. He himself had many fights because he did what his conscience decreed even if these were at variance with accepted conventions. For example he was the first parson to join the Social Democratic Party.\nIn discussions of this fundamental principle of child rearing that 'we had to go our own way even if he disagreed,' Fuchs usually added with a smile: \"But we always ended up doing what he wanted anyway.\"\nKlaus was the third of his parents four children, having one brother Gerhard and two sisters. Both his parents provided the home with a spiritual and ethical ethos. The family, however, were prone to mental disorders for, at least one source claims, eventually his grandmother, mother, and one sister all committed suicide. His other sister was later diagnosed as suffering from schizophrenia and Fuchs himself, by his own description, must have had similar problems.\nFuchs attended high school where his academic achievements were high. He had little interest in politics at this time\n[\n4\n]\n:-\nI didn't take much interest in politics during my school days except insofar as I was forced into it by the fact that of course all the other pupils knew who my father was ...\nIn fact his father's views made life difficult for him and his headmaster refused to present a high-school diploma publicly to the son of a Social Democrat academic. After high school, Fuchs entered Leipzig University in\n1930\nto study mathematics, and there he earned a reputation for being meticulous and conscientious. Fuchs became involved with student politics joining the Social Democratic Party and playing a role in the students' group of which he became the chairman\n[\n4\n]\n:-\nI found myself soon in opposition to the official policy of the Social Democratic Party for example on the question of naval rearmament ... I did have some discussions with Communists but I always found that I despised them because it was apparent that they accepted the official policy of their party even if they did not agree with it.\nAfter a year at Leipzig University, Fuchs moved to Kiel University in\n1931\nwhere he studied theoretical physics. At first he was active in the Social Democratic Party at Kiel, but when the group supported other parties in an attempt to form a united front against Hitler, he left the Party. This was not, of course, because he did not passionately oppose Hitler, rather\n[\n4\n]\n:-\nMy argument was that we could not stop Hitler by cooperating with other bourgeois parties but that only a united working class could stop him.\nAt this point, in the second half of\n1932\n, he joined the Communist Party. At the university of Kiel many of the students were Nazi supporters and Fuchs was taken by them and, after a mock trial, sentenced to death by being thrown into the Förde River. He escaped his captors and fled to Berlin where he enrolled at the Humboldt University where his brother Gerhard was also studying. He continued to support the Communist Party and vigorously oppose the Nazis. This opposition led to him and his brother both being expelled in\n1933\nand Fuchs fled to France; there he met Grete Keilson whom he later married. Conditions in France were difficult so he moved to England where he was accepted as a Ph.D. student by Nevill Mott at the University of Bristol. Much later Mott wrote\n[\n3\n]\n:-\n...that\n[\nFuchs\n]\nwas an extremely talented physicist-theoretician can be seen by his wonderful papers which are cited also in our times. If there had not been the war, and if he could have stayed in Great Britain, he certainly would have become ... a professor at a British university. I wouldn't have been able, of course, to forecast whether he might have received a Nobel prize, or whether he would have also become a Fellow of the\nRoyal Society\n. But for a man of his calibre I foresaw a great career in physics.\nDuring his years at Bristol, Fuchs published\nA Quantum Mechanical Investigation of Cohesive Forces of Metallic Copper\n(1935)\n,\nA Quantum Mechanical Calculation of the Elastic Contants of Monovalent Metals\n(1936)\n, and\nThe Elastic Contants and Specific Heats of the Alkali Metals\n(1936)\n. After the award of his doctorate, in\n1937\n, Fuchs was offered a lectureship in the Department of Natural Philosophy at the University of Edinburgh by\nMax Born\n.\nBorn\nhad been very impressed with Fuch's paper\nA Quantum Mechanical Calculation of the Elastic Contants of Monovalent\nMetals, and this made him keen to employ the brilliant young man. In January\n1938\nFuchs joined the\nEdinburgh Mathematical Society\n. In the summer of that year he attended the\nEdinburgh Mathematical Society\nColloquium held in University Hall, St Andrews. Also in\n1938\nFuchs' most famous paper\nThe Conductivity of Thin Metallic Films According to the Electron Theory of Metals\nappeared. In the introduction to the paper he explained the background:-\nThe conductivity of thin films of the alkali metals has recently been measured in the H W Wills Physical Laboratory, Bristol. It was found that as the thickness of the film is decreased to that of a few atomic layers the conductivity drops below that of the bulk metal. In the papers quoted the hypothesis was put forward that this effect is due to the shortening of the mean free paths of the conduction electrons of the metal by collisions with the boundaries of the film. The experimental results were compared with a formula derived on the basis of this hypothesis. This formula was, however, obtained subject to a number of simplifying assumptions, and it is the first purpose of this paper to obtain a more accurate formula. I also compare this formula with experiment, and make certain deductions about the surfaces of thin films.\nFuchs published his first joint paper with\nMax Born\nin\n1938\n,\nThe Statistical Mechanics of Condensing Systems\n. He also published\nOn the Invariance of Quantized Field Equations\n(1938\n/\n39)\n,\nOn the Stability of Nuclei Against β-Emission\n(1939)\nand\n(\nwith\nBorn\n)\nOn Fluctuations in Electromagnetic Radiation\n(1939)\n.\nIn September\n1939\nGerman troops attacked Poland and Britain declared was on Germany. Fuchs was a German citizen so he was interned, first at a camp on the Isle of Man then from June to December\n1940\nhe was held in Quebec, Canada. He said that the difficulty of being interned was that he was put in camps with Nazi detainees. High quality papers by Fuchs continued to be published through\n1940\n, one single author paper\nOn the Statistical Method in Nuclear Theory\n, and four papers written jointly with\nMax Born\n(1)\nThe Mass Centre in Relativity\n,\n(2)\nReciprocity, Part II: Scalar Wave Functions\n,\n(3)\nReciprocity, Part III: Reciprocal Wave Functions\n, and\n(4)\nReciprocity, Part IV: Spinor Wave Functions\n.\nBorn\nwas deeply impressed by Fuchs' abilities which he bracketed with those of his student\nWerner Heisenberg\n. He wanted Fuchs back to continue their collaboration and made requests for him to be released from internment. These requests were successful in December\n1940\nand Fuchs returned to Edinburgh.\nSoon after his return to Edinburgh he received a request from\nRudolf Peierls\nto go to Birmingham and work on the theoretical side of the British project to develop an atomic bomb.\nBorn\nwrites:-\nThough my recollections of these discussions with Fuchs are dim, I believe I had a strong feeling that an atomic super-bomb would be a devilish invention and I wanted nothing to do with it. For though I hated Hitler and the Nazis more than I can express, and though I despised the German people because they had brought him to power and fought for him like lunatics, I could never bring myself to consent to actions by which not only Nazis and Hitler's soldiers were killed but also innocent children and people who shared my feelings. But Fuchs thought otherwise. He hated Hitler and his gang so violently that he was willing to use any weapon to destroy them and to prevent the world from getting into their grip. So he accepted\nPeierls\n's offer and disappeared.\nFuchs made application for British citizenship and his application was signed by\nEdward Copson\n. This was quickly accepted, Fuchs signed the Official Secrets Act and began work with\nPeierls\nin Birmingham before the end of\n1941\n. As he wrote in his confession when later charged with spying for Russia\n[\n4\n]\n:-\nWhen I learned about the purpose of the work I decided to inform Russia and I established contact through another member of the Communist Party. Since that time I have had continuous contact with persons who were completely unknown to me, except that I knew that they would hand whatever information I gave them to the Russian authorities. At this time I had complete confidence in Russian policy and I believed that the Western Allies deliberately allowed Russia and Germany to fight each other to the death. I had therefore no hesitation in giving all the information I had, even though occasionally I tried to concentrate mainly on giving information about the results of my own work.\nAlthough Fuchs clearly breached the Official Secrets Act in passing information to the Russians, one should also note that Britain and Russia were allies with a treaty to require both sides to share military secrets with the other. In August\n1943\nthe Quebec Conference set up a formal collaboration between Britain and the United States on nuclear weapons research and, after a fact finding mission by\nPeierls\nin Washington, the key British researchers including Fuchs, joined the Manhattan Project. He worked at Los Alamos from\n1944\nto\n1946\nand he listed the issues he worked on as\n[\n5\n]\n:-\nThe occurrence of instabilities in an implosion, especially of 'jets,' problems of detonation by a neutron source, problems of the spreading and form of the explosive wave, e.g., in variable air pressures, problems of denatured fission material, neutron impulses of an impulse reactor, motion integral in hydrodynamics.\nIt is still somewhat difficult, because of the secrecy surrounding the project, to evaluate Fuchs' contribution precisely but there is no doubt that it was one of the most significant. In\n1946\nFuchs and\nvon Neumann\napplied for a patent for the trigger for the ignition of the bomb. During these years in the United States he continued to pass secrets about the project to the Russians\n[\n4\n]\n:-\n... at Los Alamos I did what I consider to be the worst I have done, namely to give information about the principle of the design of the plutonium bomb.\nHe returned to England in\n1946\nand was made head of the physics department at the Atomic Energy Research Establishment at Harwell. He continued to pass secrets:-\n... at Harwell, I began to be concerned about the information I was giving, and I began to sift it, but it is difficult to say exactly when and how I did it because it was a process which went up and down with my inner struggles. The last time when I handed over information was in February or March\n1949\n.\nIn January\n1950\nFuchs was interrogated by MI\n5\nofficer William Skardon. Although Skardon did not have sufficient evidence against Fuchs to convict him of an offence, nevertheless he persuaded Fuchs to make a full confession which he did on\n23\nJanuary. This he did believing that this may ease the hurt for his friends at Harwell. He was tried on\n1\nMarch\n1950\nin a trial at the Old Bailey in London lasting\n90\nminutes. He addressed the judge saying:-\nI have committed certain crimes for which I am charged, and I expect sentence. I have also committed some other crimes which are not crimes in eyes of the law - crimes against my friends and when I asked my counsel to put certain facts before you, I did not do it because I wanted to lighten my sentence. I did it in order to atone for those other crimes.\nHe was sentenced the next day to fourteen years in prison, the maximum sentence possible since Russia was an ally at the time the offences he was charged with were committed. A week later Russia issued a statement denying that Fuchs had spied for them - they certainly did not want any of the merit attached to their own achievements in developing nuclear weapons to be seen to be due to British or American expertise. He served nine years after which he was released on\n24\nJune\n1959\nfor good conduct. He was put on a flight to Schönefeld Airport in East Berlin. Klaus Fuchs-Kittowski writes\n[\n5\n]\n:-\nGrete Keilson and I had picked him up from Schönefeld Airport, and in a bizarre journey, with hordes of reporters chasing us, took him to his father's weekend cottage by Wandlitzsee.\nFuchs married Grete Keilson in\n1959\n. In the same year he was appointed deputy head of the Central Institute for Nuclear Research of the Academy of Sciences of the German Democratic Republic in Rossendorf, holding this position until\n1973\n. He was also appointed professor at Dresden Technical University and played a major role in the Academy of Sciences of the German Democratic Republic. He served on the committee of the Academy as well as taking a leading role in physics research.\nWe look briefly at some of the more mathematical papers published by Fuchs after he resumed his research in East Germany. In\n1961\nhe published\nÜber ein Bi-Orthogonalsystem der Symmetriecharaktere\nⓉ\n(\nOn a bi-orthogonal system of symmetry characters\n)\nwhich was reviewed by M Hamermesh:-\nFor the symmetric group on\nn\nn\nn\nsymbols, there is a procedure for constructing the simple matrix representation corresponding to a given partition of\nn\nn\nn\n[\ncf.\nLittlewood\n, The theory of group characters and matrix representations of groups\n]\n. This method uses the Young symmetrizers for the standard tableaus of the partition, augmenting them with factors in certain cases. The author presents an alternative method which requires the use of non-standard tableaus.\nIn the following year he published\nÜber einige Probleme in der Theorie der Symmetrie-charaktere\nⓉ\n(\nOn some problems in the theory of symmetry characters\n)\nwhich he summarised as follows:-\nA new approach to the problem of symmetry characters is discussed. The usual conditions of orthogonality of the eigenfunctions are dropped. Instead, eigenfunctions of maximum explicit symmetry are used. ... It is shown that for many purposes the utilisation of the explicit symmetry properties of the eigenfunctions is of greater value than the formal simplification obtained through the use of orthogonal systems of eigenfunctions.\nFurther papers on this topic appeared in\n1963\nincluding\nÜber einige Probleme in der Theorie der Symmetriecharaktere\n(\nErgänzung\n)\nⓉ\n(\nOn some problems in the theory of symmetric characters\n(\nsupplement\n)\n)\nand\n(\njointly with Kh Müller\n)\nZur Antisymmetrisierung der Wellenfunktionen von Nukleonensystemen\nⓉ\n(\nOn the antisymmetrization of the wave functions of nuclear systems\n)\n.\nFuchs seldom spoke of his spying activities during his years in East Germany. However, in an interview about a year before his death he said\n[\n5\n]\n:-\nI never considered myself as a spy. I could not see why it was in the West's interest not to share the bomb with Moscow. Something with this unimaginable destructive potential simply had to be held in common by the great powers. It was abhorrent to me that one side should be able to threaten the other with such great force. That would be like a giant treading on Lilliputians. I never thought that I was doing something culpable by passing the secrets to Moscow. It would have seemed an evil negligence for me not to have done it.",
  "matematicos_citados_na_biografia": [
    "Royal Society",
    "Max Born",
    "Born",
    "Edinburgh Mathematical Society",
    "Werner Heisenberg",
    "Rudolf Peierls",
    "Peierls",
    "Edward Copson",
    "von Neumann",
    "Littlewood"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}