{
  "nome_completo": "Kurt Mahler",
  "nome_curto": "Kurt Mahler",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mahler/",
  "data_nascimento": "26 July 1903",
  "local_nascimento": "Krefeld, Prussian Rhineland",
  "data_morte": "25 February 1988",
  "local_morte": "Canberra, Australia",
  "summary": "Kurt Mahler was a German mathematician who made important contributions to the theory of transcendental numbers.",
  "biografia": "Kurt Mahler\n's parents were Hermann Mahler\n(1858\n-\n1941)\nand Henriette Stern\n(1860\n-\n1942)\n. The Mahler family were Jewish and long established in the Prussian Rhineland. Hermann Mahler had become an apprentice bookbinder, working his way up to become the owner of a small printing and bookbinding firm. In this respect he was following the Mahler family tradition of working in the printing and bookbinding trade. Hermann and Henriette Mahler had eight children with Kurt and his twin sister Hilde being the youngest. Of the six older children, Lydia married a printer, Josef took over Hermann's printing firm but died in a Nazi concentration camp during World War II, while the other four children died young. Mahler recalled that when he was a child, their home was\n[\n1\n]\n:-\n... run on strictly orthodox Jewish lines and we were also good German patriots.\nAlthough there was no academic tradition in the family, the\n[\n1\n]\n:-\n... children acquired a love of reading from their father. \"When I was not playing as a child with some mechanical toy\", he recalled \"then I was certainly reading\". In particular, there was an elementary book on geometry which he would not then understand, but of which he liked to copy the figures.\nKurt contracted tuberculosis at the age of five years and, as a result, had severe problems with his right knee. He underwent several operations on this knee over the following years. Because of these health problems he attended school for only four years leaving at Easter\n1917\nat the age of\n13\n. His parents arranged some private tuition for him at home, but he also attended some technical schools to learn to become an instrument maker. Of course, this led to him being introduced to a certain amount of mathematics which he loved\n[\n3\n]\n:-\nHe very quickly decided that mathematics was what he really liked doing. Already, from the summer vacation of\n1917\n, he began teaching himself logarithms\n(\nthe arithmetic properties of which turned out to be one of his abiding interests in\ntranscendental number\ntheory\n)\nplane and spherical trigonometry, analytic geometry and calculus.\nIn\n1918\n, at the age of fifteen, he took a job as an apprentice in a machine factory in Krefeld. He worked there for almost three years, the first of which he spent in the drawing office, the rest of the time being spent working in the factory itself. He was self-taught in mathematics teaching himself while working in the factory. He read works by\nEdmund Landau\n,\nKonrad Knopp\n,\nFelix Klein\nand\nDavid Hilbert\namong others, a remarkable achievement for someone with little mathematical background and nobody to offer guidance. His father sent small articles his son had written to Josef Junker, the head of the local high school. Junker, who had a doctorate in\ninvariant theory\nwritten with\nElwin Christoffel\nas his advisor, was impressed by Mahler's articles and sent them to\nFelix Klein\nwho, in turn, passed them to his assistant\nCarl Siegel\n.\nSiegel\nsuggested that Mahler should attend University. However, before entering university, Mahler had to gain the necessary entrance qualifications. He left his apprenticeship at the machine factory and worked at home preparing to take the Abitur examination. He received some help from the local high school teachers for the papers on German, French, and English which he was required to take, continuing to study mathematics on his own. He passed the\nAbitur\nin\n1923\nbut he felt that he \"just scraped through\". The article\n[\n10\n]\nis an essay\nWhy I have a special liking for mathematics\nwritten in\n1923\n. It:-\n... is an enthusiastic and moving confession of the author's interest in mathematics. It is followed by a brief account of his\n(\nunusual and remarkable\n)\neducational experience up to the beginning of his university studies. The essay was written to demonstrate to Mahler's German teacher\n(\nat the Realschule in Krefeld\n)\nthat \"there was at least one subject in which I was truly interested\".\nBy the time that Mahler had passed his Abitur,\nCarl Siegel\nhad moved to the University of Frankfurt and he arranged for him to study there. At Frankfurt, supported financially by his parents and several members of the Krefeld Jewish community, he attended lectures by\nMax Dehn\non\ntopology\n,\nErnst Hellinger\non\nelliptic functions\n,\nCarl Siegel\non calculus and\nOtto Szász\n[\n2\n]\n:-\nMahler was clearly greatly influenced during this period by\nSiegel\n, who was the only person whom he recognized as his teacher in mathematical research.\nIn\n1925\nSiegel left Frankfurt for a period of overseas visits, and Mahler moved to Göttingen where he attended lectures by\nEmmy Noether\n,\nRichard Courant\n,\nEdmund Landau\n,\nMax Born\n,\nWerner Heisenberg\n,\nDavid Hilbert\nand\nAlexander Ostrowski\n, and acted as an unpaid assistant to\nNorbert Wiener\n. It was through lectures by\nEmmy Noether\nthat he learnt about\np\np\np\n-adic numbers which were to be one of the major topics of his research throughout his life. In\n1927\nhe submitted his doctoral dissertation\nÜber die Nullstellen der unvollständigen Gammafunktion\n,\nⓉ\n(\nOn the zeros of the incomplete gamma function,\n[\non zeros of the incomplete\ngamma function\n]\n)\n, to the University of Frankfurt. He remained at Göttingen where he was supported by a research fellowship from the Notgemeinschaft der Deutschen Wissenschaft. During his tenure of the fellowship\n[\n1\n]\n:-\n... he developed a new method in transcendental theory, found his celebrated classification of transcendental numbers and pioneered\ndiophantine approximation\nin p-adic fields.\nPapers he published during this period include:\nÜber einen Satz von Mellin\nⓉ\n(\nOn a theorem of Mellin\n)\n(1928)\n;\nArithmetische Eigenschaften der Lösungen einer Klasse von Funktionalgleichungen\nⓉ\n(\nArithmetic properties of the solutions of a class of functional equations\n)\n(1929)\n;\nÜber die Nullstellen der Abschnitte der hypergeometrischen Reihe\nⓉ\n(\nOn the zeros of the sections of the hypergeometric series\n)\n(1929)\n;\nZur Fortsetzbarkeit gewisser Dirichletscher Reihen\nⓉ\n(\nOn continuability of certain Dirichlet series\n)\n(1930)\n;\nArithmetische Eigenschaften der Lösungen einer Klasse von Funktionalgleichungen\nⓉ\n(\nArithmetic properties of the solutions of a class of functional equations\n)\n(1930)\n;\nEin Beweis des Thue-Siegelschen Satzes über die Approximation algebraischer Zahlen für binomische Gleichungen\nⓉ\n(\nA proof of Thue-Siegel's theorem on the approximation of algebraic numbers for binomial equations\n)\n(1931)\n,\nÜber das Mass der Menge aller S-Zahlen\nⓉ\n(\nOn the extent of the quantity of all S-numbers\n)\n(1932)\n; and\nZur Approximation algebraischer Zahlen\nⓉ\n(\nOn approximating algebraic numbers\n)\n(1933)\n.\nIn\n1933\nMahler was appointed to his first post at the University of Königsberg but, before he could take up the post, Hitler came to power. Mahler realised at once that, as he was Jewish, he had to leave Germany. After visiting van der Corput, and his two pupils\nKoksma\nand\nPopken\n, in Amsterdam during the summer of\n1933\n, he accepted an invitation from\nLouis Mordell\nto go to Manchester where he spent\n1933\n-\n34\nsupported by a Bishop Harvey Goodwin Fellowship. He spent\n1934\n-\n36\nin Groningen in the Netherlands supported by a fellowship from a Dutch Jewish group which van der Corput had arranged. He attended the International Congresses of Mathematicians at Oslo in July\n1936\nwhere he met\nPaul Erdős\nfor the first time.\nErdős\nwrites\n[\n4\n]\n:-\nI knew of his work many years earlier and was very glad to meet him. I almost immediately posed him the following problem: An integer is called powerful if\np\n∣\nm\np | m\np\n∣\nm\nimplies\np\n2\n∣\nm\np^{2} | m\np\n2\n∣\nm\n; Are there infinitely many consecutive powerful numbers? Mahler immediately answered: Trivially, yes!\nx\n2\n−\n8\ny\n2\n=\n1\nx^{2} - 8y^{2} = 1\nx\n2\n−\n8\ny\n2\n=\n1\nhas infinitely many solutions. I was a bit crestfallen since I felt that I should have thought of this myself.\nHowever, back in Groningen, Mahler was involved in a bicycle accident and his knee troubles returned. He underwent several operations on his knee back home in Krefeld, where eventually his kneecap was removed, and also spent some time in Switzerland during the summers of\n1937\nand\n1938\nwhere he was finally cured. However, despite being cured, he walked with a limp for the rest of his life. Mahler returned to Manchester in\n1937\n, where again he interacted with\nErdős\n[\n4\n]\n:-\nWe wrote two joint papers, had many mathematical and political discussions, walked a great deal\n(\ndespite his poor health, Mahler liked to walk very much\n)\nand we also played bridge.\nHowever, during\n1940\nhe was interned as \"an enemy alien\" for three months and spent some time in the same camp on the Isle of Man as\nKurt Hirsch\n. These three years had been highly productive on the mathematical side, but very difficult financially for, despite two short-term temporary assistant lectureships and some funds from a fellowship, he mainly had to support himself from his savings. He had learnt Chinese in\n1939\nin preparation for getting a post in China, but the onset of the war prevented this being realised. Returning to Manchester after his period of internment, he was appointed as an assistant lecturer in\n1941\n(\nhis first permanent post\n)\nand remained there until\n1962\n. His outstanding mathematical achievements led to steady promotion: Lecturer in\n1944\n, Senior Lecturer in\n1947\n, Reader in\n1949\n, and a personal professorship in\n1952\n. It is worth noting that his personal professorship was the first in Manchester, and was specially created to acknowledge his eminent status.\nPaul Cohn\narrived in Manchester as an assistant lecturer in\n1952\nand he, like Mahler, lived in Donner House.\nCohn\nwrites\n[\n1\n]\n:-\nThe only other mathematician I found there was Professor Mahler, so we saw a good deal of each other for the next six years. He was without any pretensions and one could discuss anything under the sun with him, though preferably mathematics, photography or Chinese\n(\nin that order\n)\n. For his holidays he always went to the island of Herm, saying that it suited him because he could not walk far. The island could be reached only by a small boat from Guernsey; it had no motor traffic and could be crossed in half an hour walking slowly. ... His attitude to mathematics was like his attitude to life: he liked things as simple as possible and usually eschewed abstraction, but with his direct methods was often able to go surprisingly far. ... He was generally very precise and punctual, rising and going to bed early. At his request seminars at Manchester were held at\n2\np.m. If a speaker was still on his feet at\n3\n.\n01\n, Mahler\n(\nwho always sat in the front row\n)\nwould open and shut his little attaché-case repeatedly with a loud click.\nIn\n1962\nhe went to Canberra for the last\n6\nyears of his career. This was a purely research appointment but Mahler agreed to give an undergraduate number theory course. One of the undergraduate students who took this course was\nJohn Coates\n. After officially retiring from Canberra in\n1968\n, Mahler accepted an invitation from Ohio State University where he worked until\n1972\nwhen he returned to Canberra\n[\n1\n]\n:-\nAs he grew older, deteriorating health made it more and more difficult for him to travel, but he remained mathematically active until the end.\nErdős\nwrites\n[\n4\n]\n:-\nI visited Australia fairly often and of course always visited Mahler in Canberra. We had many mathematical discussions but he could no longer walk a great deal. I was in Australia for over two months early in\n1988\nand in Canberra in February. I had dinner and lunch with Mahler at University House and met him in the Department of Mathematics of the Institute for Advanced Studies. He was clearly frail but I did not expect that the end was so near.\nMahler published around\n200\npapers. He worked on transcendence of numbers, showing in\n1946\nthat\n0\n.\n123456789101112131415161718192021\n...\nwas transcendental. In\n[\n13\n]\nit is noted that:-\n... Mahler regretted that, apart from his own work, little interest had been shown by\n20\nth\ncentury mathematicians in the study of arithmetical properties of decimal expansions.\nHe also classified real and complex numbers into classes which are algebraically independent. Other major themes of his work were rational approximations of algebraic numbers,\np\np\np\n-adic numbers,\np\np\np\n-adic Diophantine approximation, geometry of numbers\n(\na term coined by\nMinkowski\nto describe the mathematics of packings and coverings\n)\nand measure on polynomials. He proved important results about polar convex bodies, compound convex bodies and the very useful Mahler Compactness Theorem. He published a number of excellent books, but these were all based on lecture courses he had given, often using notes taken by someone who attended the course. For example\nLectures on diophantine approximations : g-adic numbers and Roth's theorem\n(1961)\nwas prepared from notes by R P Bambah of lectures given by Mahler at the University of Notre Dame in autumn\n1957\nand was described as an \"extremely valuable contribution\". In the Preface to\nIntroduction to p-adic numbers and their functions\n(1973)\nMahler writes:-\nThis set of notes contains an elementary introduction to the theory of p-adic numbers and their analysis. These numbers were introduced by K\nHensel\nsome eighty years ago and have slowly become of importance in more and more parts of mathematics. Nevertheless, while many recent books on algebra have short chapters or paragraphs on the subject, a really good introduction to p-adic numbers from the standpoint of elementary analysis does not seem to exist. ... We shall begin by studying the g-adic rings and p-adic fields, and then finally investigate continuous and differentiable functions of a p-adic variable. A course similar to this presentation was given repeatedly at the Ohio State University.\nA second, improved and expanded, edition of the book was published in\n1981\n:-\nThe text is written in complete detail, sometimes several proofs of a result are given and lots of concrete examples and special cases are calculated\n(\nthe results of which are also useful for the specialist\n)\n.\nMahler's\nLectures on transcendental numbers\n(1976)\nwas based on lectures given twenty years earlier.\nMahler received many awards. He was elected a Fellow of the\nRoyal Society\nin\n1948\n. The\nLondon Mathematical Society\nawarded him its Senior Berwick Prize in\n1950\nand its\nDe Morgan\nMedal in\n1971\n. He was elected a fellow of the\nAustralian Academy of Sciences\nin\n1965\nand awarded its Lyle Medal in\n1977\n. He was elected an honorary member of the\nDutch Mathematical Society\nin\n1957\nand the\nAustralian Mathematical Society\nelected him an honorary member in\n1986\n.",
  "matematicos_citados_na_biografia": [
    "transcendental number",
    "Edmund Landau",
    "Konrad Knopp",
    "Felix Klein",
    "David Hilbert",
    "invariant theory",
    "Elwin Christoffel",
    "Carl Siegel",
    "Siegel",
    "Abitur",
    "Max Dehn",
    "topology",
    "Ernst Hellinger",
    "elliptic functions",
    "Otto Szász",
    "Emmy Noether",
    "Richard Courant",
    "Max Born",
    "Werner Heisenberg",
    "Alexander Ostrowski",
    "Norbert Wiener",
    "gamma function",
    "diophantine approximation",
    "Koksma",
    "Popken",
    "Louis Mordell",
    "Paul Erdős",
    "Erdős",
    "Kurt Hirsch",
    "Paul Cohn",
    "Cohn",
    "John Coates",
    "Minkowski",
    "Hensel",
    "Royal Society",
    "London Mathematical Society",
    "De Morgan",
    "Australian Academy of Sciences",
    "Dutch Mathematical Society",
    "Australian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}