{
  "nome_completo": "Kurt Hirsch",
  "nome_curto": "Kurt Hirsch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hirsch/",
  "data_nascimento": "12 January 1906",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "4 November 1986",
  "local_morte": "London, England",
  "summary": "Kurt Hirsch worked in various areas of Group Theory.",
  "biografia": "Kurt Hirsch\ncame from a distinguished family but still had an extremely difficult start in life. His parents were Robert Hirsch and Anna Lehmann. Robert was a chemical engineer and the owner of a soap factory. His father, Kurt Hirsch's grandfather, was Aron Simon Hirsch who was a Jew. He was a distinguished academic who was a physician and medical historian. He published Handbook of historical and geographical pathology\n(2\nVolumes,\n1859\n,\n1864)\nand was appointed professor of the history of medicine at Berlin in\n1863\n. However, since a Jew was not allowed to hold a university chair, he was baptised a Christian and changed his name to August. His son Robert, Kurt's father, was brought up a Christian and, of course, gave his son the middle name of 'August' after his grandfather. August Hirsch was for a time rector of the University of Berlin, something which would prove helpful to his grandson many years later.\nKurt was the youngest of Robert and Anna Hirsch's five children, having four older sisters. In\n1913\n, when Kurt was seven years old, his father's soap factory failed. The family had been well off but now there was a sudden change in their fortunes. Unable to cope with the collapse of his business, Robert committed suicide. The blow of losing his father was too much for Kurt and his behaviour became extremely difficult. He was sent to a boarding school in Frankfurt-an-der-Oder - the Humanistischen Staatlichen Friedrich-\nGymnasium\n. He completed his education at the school in\n1924\nbut his family were in no position to support him while he took university studies. At this stage he benefited from having August Hirsch as his grandfather, for the University of Berlin were prepared to offer a scholarship to the grandson of a former distinguished rector of the university. Kurt Hirsch began his studies there in the autumn of\n1925\n, taking courses in both mathematics and philosophy.\nAt the University of Berlin he was taught mathematics by, among others,\nBieberbach\n,\nvon Mises\n,\nSchmidt\nand\nSchur\n. Although most influenced by\nSchur\n, his doctoral dissertation\nIntuition und logische Form. Zur gegenwärtigen Philosophie der Mathematik\nⓉ\n(\nIntuition and logical form. At the present philosophy of mathematics\n)\nwas on the philosophy of mathematics. The thesis examines the\n1920\ns dispute between\nHilbert\nand\nBrouwer\non the foundations of mathematics. Completed and examined on\n10\nJune\n1930\n(\nBieberbach\nwas an examiner\n)\n, it was not until\n1933\nthat Kurt could afford to get it printed, so he did not receive the degree until\n1933\n. Part of the reason for his poor financial position was his marriage in\n1928\nto Elsa Brühl. By the time he passed his oral examination they had one son Daniel\n(\nborn\n1929)\nand the scholarship he received was quite insufficient to support a wife and child let alone pay the extra expense of getting a thesis printed.\nIn order to be able to support his family, Kurt became a journalist in\n1928\n, writing a scientific column for the\nVossische Zeitung\n. This liberal newspaper, published in Berlin, was a highly respected one which had published since the early\n18\nth\ncentury. However he kept up his mathematics attending a study group where he studied\nEmmy Noether\n's work and read\nSchreier\n's paper on the\nJordan\n-\nHölder\ntheorem. Influenced by these ideas he decided to study soluble groups with the maximum condition on\nsubgroups\n. From the time he began working for\nVossische Zeitung\nuntil the Nazis came to power in\n1933\nhe established an increasingly significant role with the paper. He was given complete editorial control over his weekly column, and as well as articles which he wrote himself, he also was able to get top scientists such as\nHeisenberg\nand\nSchrödinger\nto contribute articles.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler came to power in Germany. On\n7\nth\nApril\n1933\n, Hitler introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. The Nazis could not accept the liberal\nVossische Zeitung\nand, after a difficult year of tension, they closed the paper down on\n31\nMarch\n1934\n, replacing it with their own paper the\nVölkischer Beobachter\n. Kurt's wife was Jewish and he had adopted the faith for her sake. Having lost his job and seeing the way that the Nazis were treating German Jews, he had little choice but to leave for England\n(\nwhere he had distant relatives\n)\n. By this time Kurt and Elsa had a second child, Sabine who was born in\n1932\n. He left his wife and family in Berlin and set out for England. On arriving in London in April\n1934\nhe was met by\nBernhard Neumann\nand Hanna von Caemmerer\n(\nlater to become\nHanna Neumann\nwho was visiting Bernhard\n)\n. He had known Bernhard as a fellow student in Berlin. Kurt was introduced to\nPhilip Hall\nwho strongly encouraged him to pursue his intention of working on\nsoluble groups\nwith the maximum condition on subgroups. Up to this stage Hirsch had been totally undecided whether to pursue mathematics or journalism as a career but his meeting with\nHall\nquickly led to him choosing mathematics.\nDespite having a doctorate, Hirsch decided that his prospects in Britain would be better if he had a British doctorate so he became a student of\nHall\n. He studied at King's College, Cambridge, obtaining financial support from the university. In September\n1934\n, Elsa, Daniel and Sabine left Berlin and joined Hirsch in Cambridge where he had rented a house close to where\nBernhard Neumann\nwas living. Hirsch published his first paper\nA note on non-commutative polynomials\nin\n1937\n. He completed his second doctoral thesis\nA Class of Infinite Soluble Groups\nin\n1937\nin which he studied soluble groups with the maximal condition on subgroups, now called polycyclic groups. In the final chapter of his thesis he studied skew-groups which are finitely generated torsion free groups with cyclic centre which contains the derived subgroup. He wrote up this part of his thesis as a paper and\nOn skew-groups\nwas published in the\nProceedings\nof the\nLondon Mathematical Society\nin\n1939\n. Two papers\nOn infinite soluble groups\nI and II which were related to his thesis had been published in the same journal in\n1938\n.\nAppointed to Leicester in\n1938\nhe was interned as \"an enemy alien\" in\n1940\n. In May\n1940\nWinston Churchill led a newly formed coalition government which decided that all enemy alien's were to be interned. Hirsch was sent to the Central internment camp in Douglas on the Isle of Man, where he lived in House\n7\n. He worked there as a cook\n(\nand retained an interest in recipes all his life\n)\nbut conditions were reasonable and he was able to take country walks supervised by an armed guard. The internees organised concerts. lecture courses and a camp university in which Hirsch was happy to participate. He was soon released, however, mainly due to strong pressure from the Vice-Chancellor of Leicester and returned to his position in the university in October\n1940\n. His position was only a temporary one and it remained so for four years until it was made permanent in\n1944\n. That he had interests outside mathematics is illustrated by the fact that he was Leicester County Chess Champion in\n1945\n-\n46\n. His third paper\nA Class of Infinite Soluble Groups\nwas published in\n1946\n. In\n1947\nboth Kurt and Elsa became British citizens.\nIn\n1948\nHirsch moved to King's College, Newcastle\n(\nfounded in\n1937\nas a part of the University of Durham and becoming the University of Newcastle in\n1963)\nwhere he worked under the newly appointed professor of Pure Mathematics, W W Rogosinki.\nAlfred Goldie\nwrote about Hirsch's time in Newcastle\n[\n1\n]\n:-\nIt was a wonderful atmosphere,\n[\nRogosinki and Hirsch\n]\nknew what a real university was about and set out to create a microcosm of it in pure mathematics.\nBonsall\nand I shared a room next to Kurt but the rooms had a common phone reached through a hatch.\n[\nKurt\n]\n, of course, used it almost exclusively, having all sorts of business to transact. His personality made an impact rather stronger than that of Rogosinki, though one could see that Kurt regarded Rogosinki as more important than himself on the only ground that mattered to Kurt, namely mathematical standing. He had a calm judgement in such matters.\nWhile at Newcastle he began translating\nKurosh\n's\nThe theory of groups\ninto English, a project he was to work on for a number of years. He was a leading reformer of the mathematics syllabus at Newcastle where again he found time to win the County Chess Championship in\n1950\n.\nThen in\n1951\nHirsch was appointed to Queen Mary College of the University of London where he was appointed professor in\n1958\n. He remained there for the rest of his career, building up a strong algebra school. He sought\nHall\n's advice in appointments of algebraists and attracted many research students to make a thriving group theory school. In\n[\n1\n]\nGruenberg\nwrites:-\nHirsch was a shrewd judge of people and managed to create at Queen Mary College an unusually friendly environment for students as well as staff. Everyone felt encouraged to be cooperative. Younger members of staff found him easy to work with and knew they could count on his help and protection. He gave them generously of his time with sound advice on teaching, on examining and on supervising research students.\nAll Hirsch's publications were in group theory, in addition to the work on polycyclic groups he published on locally\nnilpotent groups\nand automorphism groups of torsion free\nabelian groups\n. Some of his later publications are\n(\nwith Terry Hallett\n)\nGroups of exponent\n4\nas automorphism groups\n(1970)\n,and\nFinite groups of exponent\n12\nas automorphism groups\n(1977)\n. His translation of the first volume of\nKurosh\n's\nThe theory of groups\ninto English was published in\n1955\n, with the second volume in the following year. He had spent\n1954\n-\n55\nas visiting professor at the University of Colorado and given a course covering the whole of the first volume in two semesters lecturing at three lectures per week.  It was the first of many translations from Russian to English that he made. Other include: F R Gantmacher,\nThe theory of matrices\n. Vols.\n1\n,\n2\n(1959)\n;\nA G Kurosh\n,\nLectures on general algebra\n(1963)\n;\nI M Gelfand\n, M I Graev and I I Pyatetskii-Shapiro,\nRepresentation theory and automorphic functions\n(1969)\n;\nA D Aleksandrov\n,\nA N Kolmogorov\nand\nM A Lavrent'ev\n(\neds.\n)\n,\nMathematics: Its content, methods, and meaning\n. Vol. III\n(1969)\n; B I Plotkin,\nGroups of automorphisms of algebraic systems\n(1972)\n;\nI R Shafarevich\n,\nBasic algebraic geometry\n(1974)\n; D A Suprunenko,\nMatrix groups\n(1976)\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Bieberbach",
    "von Mises",
    "Schmidt",
    "Schur",
    "Hilbert",
    "Brouwer",
    "Emmy Noether",
    "Schreier",
    "Jordan",
    "Hölder",
    "subgroups",
    "Heisenberg",
    "Schrödinger",
    "Bernhard Neumann",
    "Hanna Neumann",
    "Philip Hall",
    "soluble groups",
    "Hall",
    "London Mathematical Society",
    "Alfred Goldie",
    "Bonsall",
    "Kurosh",
    "Gruenberg",
    "nilpotent groups",
    "abelian groups",
    "A G Kurosh",
    "I M Gelfand",
    "A D Aleksandrov",
    "A N Kolmogorov",
    "M A Lavrent'ev",
    "I R Shafarevich"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}