{
  "nome_completo": "Lazar Matveevich Gluskin",
  "nome_curto": "Lazar Matveevich Gluskin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gluskin/",
  "data_nascimento": "10 March 1922",
  "local_nascimento": "Artemovsk (now Bakhmut) Donetsk Province, Ukraine",
  "data_morte": "15 April 1985",
  "local_morte": "Kharkov, Ukraine",
  "summary": "Lazar Gluskin was a Ukranian mathematician who worked on semigroups of linear transformations.",
  "biografia": "Lazar Matveevich Gluskin\nwas born in the city of Bakhmut but in\n1924\n, two years after he was born, the town was renamed Artemovsk. It is now in Donetsk province, eastern Ukraine, on the Bakhmut River. However, Donetsk was formerly\n(\nuntil\n1924\n, so for the first two years of Gluskin's life\n)\nYuzovka, then\n(1924\n-\n61)\nStalino. Lazar Matveevich was born into a Jewish family. In\n1939\n, when he was seventeen years old, he entered the Physics and Mathematics Faculty of Kharkov University. He studied there unaffected by World War II until\n1941\nwhen German troops turned on their Soviet ally and invaded the Soviet Union on\n22\nJune.\nOperation Barbarossa, as the invasion of the Soviet Union was called by the Germans, was intended to achieve a rapid victory, and indeed the progress of the German armies across a broad front stretching from the Baltic to the Black Sea was at first remarkable. By September Kiev had fallen and large numbers of Soviet troops surrendered\n[\n5\n]\n:-\n... German troops occupied Kharkov. Walking, riding in railway freight cars, hitchhiking, Gluskin managed to escape. He continued his studies at Saratov University. His father died; his mother tried to support her two children taking low-paid menial jobs, so he had to look for odd jobs, mainly unloading railway freight cars and barges on the Volga. In\n1943\nhe was drafted into the Red Army and soon became a commander of an anti-aircraft battery fighting the German Luftwaffe and, after the war with Germany was over, fighting the Japanese Air Force in China. The war left him a veteran with numerous military decorations, but even his friends doubted he could ever resume his mathematical studies.\nBut Gluskin was determined to study mathematics and returned to Kharkov University. There his studies were supervised by Anton Kazimirovic Suschkevic, one of the first mathematicians to make major progress in the theory of semigroups, and in\n1949\nGluskin was awarded his Diploma in Mathematics. Although by now a great enthusiast for semigroups, Gluskin could not continue to undertake research at Kharkov University but was forced to take a teaching position at the Kharkov Pedagogical Institute. Despite a heavy teaching load, he undertook research in his own time, unofficially supervised by Suschkevic which was both a kind and brave act on his part. Life during these years was extremely hard\n[\n5\n]\n:-\n... Gluskin and his wife Tamara lived in a tiny cubicle in a student hostel, and when their first child Irina arrived he was finishing his dissertation using the only \"office space\" available: the staircase outside their room.\nGuskin was awarded his Candidates Degree\n(\nequivalent to a Ph.D.\n)\nin\n1952\nfrom Kharkov University. He continued to teach at the Kharkov Pedagogical Institute but things became even worse on the accommodation front in\n1956\nwhen his second daughter Valentina was born. However, Kharkov was an important cultural centre and Gluskin was able to mix with many leading mathematicians there. It was therefore a hard decision to leave the city in\n1958\nand accept the chair of mathematics at the Institute of Mining and Metallurgy in Voroschilovsk. This small town had only one plus for Gluskin, and that was the fact that he was offered an appartment to rent by his employer, so his family's living conditions were vastly improved by the move.\nThe first of Gluskin's papers\nAn associative system of square matrices\n(\nRussian\n)\nappeared in\n1954\n. This paper on matrix semigroups was one of a number that he published on this topic near the beginning of his career;\nAutomorphisms of multiplicative semigroups of matrix algebras\n(\nRussian\n)\n(1956)\nwas another on this topic. His other early papers included\nHomomorphisms of unilaterally simple semigroups on groups\n(\nRussian\n)\n(1955)\n,\nSimple semigroups with zero\n(\nRussian\n)\n(1955)\n, and\nElementary generalized groups\n(\nRussian\n)\n(1957)\n. He began to become interested in semigroups of continuous transformations of topological spaces publishing papers such as\nThe semi-group of homeomorphic mappings of an interval\n(\nRussian\n)\n(1959)\nand\nAutomorphisms of semigroups of topological mappings\n(\nRussian\n)\n(1960)\non this topic.\nIn\n1961\nGluskin's quality research was recognised when he was awarded a Doctor of Sciences degree from Moscow University. It was\nA G Kurosh\n, who held the Chair of Algebra at Moscow University, who organised that Gluskin defend his thesis there for the higher degree. The examiners, in addition to\nKurosh\n, were E S Lyapin\n(\nLeningrad\n)\nand\nV V Vagner\n(\nSaratov\n)\n. The award of the degree helped Gluskin to become a full professor at the Institute of Mining and Metallurgy in Voroschilovsk in\n1962\nand, three years later, to return to Kharkov to the chair of mathematics at the Kharkov Mining Institute. His health began to deteriorate and in\n1968\nS D Berman took over the chair while Gluskin continued to work as professor of mathematics relieved of the extra work and responsibilities of the chair.\nSchein writes in\n[\n4\n]\n:-\n... he published a series of brilliant results on semigroups of linear transformations. He showed that a good deal of the classical theory of rings of linear transformations could be carried over to semigroups, addition not being really needed. Later he considered semigroups of endomorphisms of modules over rings, thus generalising results on semigroups of linear transformations. From his point of view the semigroups of transformations formed the real core of the theory of semigroups, thus justifying the existence of the whole theory.\nFor many years Gluskin worked on dense extensions of commutative semigroups. He wrote to Schein four months before his death\n[\n5\n]\n:-\nFinally, I solved the problem on maximal dense normal extensions of commutative semigroups. I announced this result once before, but there was an error. In the last fifteen years I returned to it again and again without success: technical details eluded me. I must confess it was vexing, for twice during these years I was standing with one foot in the next world, and I would rather not leave behind a published theorem which was not true.\nIn fact he completed writing up the paper, solved another one of two further problems he wanted to include but died before he completed the last one. He died at home, just as he was about to leave to go and teach.\nIn\n[\n4\n]\nSchein describes Gluskin as a supervisor of doctoral students:-\nGluskin supervised about twenty Ph.D. dissertations in algebra. Many more young people are grateful to him for his unselfish advice and help. The times were complicated, and many people had difficulties in publishing their results and getting academic degrees or jobs for reasons which had nothing to do with the quality of their work. If Gluskin was sure that the mathematical substance of the results was sound, he was there to help - even if this could hurt his own career. He could not live any other way.\nHe was an enthusiast for attending conferences but restricted by the Soviet regime:-\nGluskin was very active at mathematical conferences. In thirty years he gave scores of talks at the conferences, colloquium lectures, and courses on invited lectures at universities. He had many invitations from foreign universities and mathematical conventions and wanted very much to attend, but he was never allowed to go abroad\n(\nif one does not count the visits he had to pay during the war\n)\n. The only exception was his short visit to a semigroup conference in Czechoslovakia in June\n1968\n.\nAs to his interests outside semigroup theory and mathematics, Schein paints the following picture:-\nGluskin's interest in and appreciation of the history of mathematics was a part of his general interest in history, ancient and new, in the development of human civilization and related moral questions. He loved books. If only he could find a good book, which could be a difficult if not impossible enterprise in the surrounding general atmosphere, he would read it and, if possible, recommend or lend it to his friends.",
  "matematicos_citados_na_biografia": [
    "A G Kurosh",
    "Kurosh",
    "V V Vagner"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}