{
  "nome_completo": "Lee Alexander Lorch",
  "nome_curto": "Lee Lorch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lorch/",
  "data_nascimento": "20 September 1915",
  "local_nascimento": "New York City, USA",
  "data_morte": "28 February 2014",
  "local_morte": "Toronto, Canada",
  "summary": "Lee  Lorch was an American mathematician who was an early civil rights activist, and communist.",
  "biografia": "Lee Lorch\n's parents were Adolph Lorch and Florence Mayer. Adolph born in Germany, emigrated to the United States in\n1887\n, and was naturalised\n1900\n. Florence's family emigrated from Alsace-Lorraine and she became a schoolteacher. Adolph Lorch was a butcher and later a textile manufacturer. Lee, one of his parents' four children, was born at their home on West\n149\nth\nStreet and Broadway in Manhattan. He had an older brother Arthur and two younger sisters Regina and Judith. He attended Townsend Harris High School in Manhattan, graduating in\n1932\n, and won a State Tuition Scholarship to study at Cornell University. At High School he had shown that he was an extremely able mathematician and so he majored in mathematics at Cornell. He graduated with a B.A. in\n1935\n.\nAfter graduating with his first degree, Lorch went to the University of Cincinnati where he studied for a Master's Degree. He was awarded an M.A. in\n1936\nfrom Cincinnati and continued to undertake research there for his doctorate. His thesis advisor was\nOtto Szász\nand he was awarded a Ph.D. in\n1941\nfor his thesis\nSome Problems on the Borel Summability of Fourier Series\n. The existence of a continuous function whose\nFourier series\ndiverges at a point follows from the unboundedness of the sequence of\nLebesgue\nconstants for many summability methods. The estimation of such constants for various summability methods was calculated by Lorch and his first published paper, following on from his thesis work, was\nThe Lebesgue constants for Borel summability\n(1944)\nwhich, as the title indicates made a study in the case of\nBorel\nsummability. In a second paper,\nOn Fejér's calculation of the Lebesgue constants\n(1945)\n, Lorch gives a representation for the\nLebesgue\nconstants which avoids the use of the gamma function. However, Lorch's mathematical career had been interrupted by World War II.\nAfter graduating with his doctorate, Lorch did mathematically related war work for the National Advisory Committee for Aeronautics which exempted him from military service. However he felt that the theoretical work being done there was not being translated into practical applications to help win the war, so he left this job and enlisted on\n19\nApril\n1943\n\"for the duration of the War or other emergency, plus six months, subject to the discretion of the President.\" On\n24\nDecember\n1943\n, shortly before he was posted overseas, he married Grace K Lonergan, the daughter of the railroad clerk William J Lonergan. She was a teacher in the city of Boston but was dismissed because she married. She contested that policy, but lost. Lorch served with the Army Air Corps in India and the South Pacific, ending his military service in the spring of\n1946\n. Returning to the United States, he was appointed to teach at the City College of New York\n[\n17\n]\n:-\nLike millions of veterans, he could not find a place to live. After a two-year search, having lived much of the time in a Quonset hut overlooking Jamaica Bay in Brooklyn, he, along with his wife, Grace, and young daughter, moved into Stuyvesant Town.\nBefore moving to Stuyvesant Town, Lorch had been made very aware of racism\n[\n14\n]\n:-\nI had become very aware of racism through the war; not just anti-Semitism, but the way the American army treated black soldiers. On the troop transport overseas, it was always the black company on board that had to clean the ship and do the dirty work, and I felt very uncomfortable with that.\nStuyvesant Town had been built on Manhattan's First Avenue to house those returning from the war. This development was owned by the Metropolitan Life Insurance Company who had a policy of refusing applications from non-whites. Lorch was aware of this but, nevertheless, decided to move to Stuyvesant Town and try to change the \"whites only\" policy from the inside. By this time Lorch and his wife had a baby daughter Alice and the family moved to Stuyvesant Town where Lorch became vice chair of the Tenants Committee to End Discrimination. His fight was both through the courts and through attempts to influence public opinion. The court case was pursued as far as the Supreme Court but failed. However, in influencing public opinion he was more successful\n[\n7\n]\n:-\nWe had one advantage - all the publicity about the Metropolitan Life Insurance Company's policies was affecting business. At the time, they wrote\n75\npercent of the life insurance policies held by blacks - of course, at discriminatory rates. But things went so bad for them that they had to close their Harlem office. So there was leverage.\nLorch, however, lost his position at the City College of New York because of his political activities. Early in\n1949\n, the Mathematics Department at the City College recommended that he be promoted to assistant professor. The College, however, decided to fire him. When the President of the College was asked why Lorch had been fired he said\n[\n7\n]\n:-\nSometimes you have to do things in this life which you don't care to explain.\nBeing an excellent mathematicians and teacher, Lorch soon found another position, this time as an assistant professor at Pennsylvania State University where he was appointed in September\n1949\n. After eight months in this position, he was recommended for promotion but, again, his contract was terminated. The reason given was that his attempts to end discrimination in Stuyvesant Town were:-\n... extreme, illegal, and immoral, and damaging to the public relations of the college.\nLorch's next move was to accept a position at Fisk University in Nashville in September\n1950\n. This university had, in\n1930\n, become the first African-American institution to he accredited by the Southern Association of Colleges and Schools. Similarly, it had been the first African-American institution to be approved by the Association of American Universities\n(1933)\nand the American Association of University Women\n(1948)\n.\nEvelyn Boyd Granville\nwas an associate professor of mathematics at Fisk when Lorch joined but, unable to accept the highly restrictive terms under which black women could hold academic posts, she left in\n1952\n. Lorch was made acting head of mathematics when he joined Fisk and, one year later, became the Head of Mathematics. Lorch's wife and daughter remained in their home in Stuyvesant Town until January\n1952\nwhen they were evicted by the Metropolitan Life Insurance Company. His research, however, went well and he published\nThe Lebesgue constants for\n(\nE,\n1)\nsummation of Fourier series\n(1952)\n,\nAsymptotic expressions for some integrals which include certain Lebesgue and Fejér constants\n(1953)\n,\nDerivatives of infinite order\n(1953)\n,\nThe principal term in the asymptotic expansion of the Lebesgue constants\n(1954)\n, and\nThe limit of a certain integral containing a parameter\n(1955)\n. The last two of these papers were published in the\nAmerican Mathematical Monthly\n. Among the undergraduates that Lorch taught at Fisk, we mention\nEtta Zuber Falconer\n. She wrote later in life:-\nLee Lorch inspired me to study mathematics and helped to mould me as a person because of his belief in the dignity of all people. He remains my mentor to this day.\nIn addition, Lorch was the thesis advisor to several students. Vivienne Mayes assisted Lorch with the Elementary Analysis class at Fisk in session\n1950\n-\n51\n. She writes\n[\n18\n]\n:-\nDr Lorch conducted\n[\nthe Elementary Analysis\n]\nclass as he did all of his other courses. He believed that the students could understand the material, not just learn to do it. He was interested in teaching them the why of mathematics in addition to the how. He also watched the reactions of his class intently, and always maintained good rapport. At the first sign that the class was lost, he would stop, repeat, and give more specific examples. He would motivate the students to participate in class discussions, and would often, through his questioning, draw out of the class the proof of some general result. The students saw that he expected them to learn the material, and they felt compelled to live up to his expectations.\nHowever, he continued to be involved in campaigns against discrimination. In a talk he gave in\n1994\n, Lorch described one incident\n(\nquoted in\n[\n21\n]\n)\n:-\nThis was first made a matter of record in\n1951\nwhen I was teaching at Fisk University in Nashville, Tennessee, a leading historically Black university. The Southeast regional meeting of the\nMathematical Association of America\ntook place with Vanderbilt University as host. There was an official banquet at which the national President of the\nMathematical Association of America\nwas the speaker. Using rather vulgar language, the chair of the local arrangements committee, a Vanderbilt professor, said that no tickets would be available to Negro members. I'm using the polite version of the word he employed. On April\n20\n,\n1951\n, my department sent a letter to the Board of Governors of the\nMathematical Association of America\nand\n(\nwell aware that the\nAmerican Mathematical Society\nbehaved no better\n)\nalso to the Council of the\nAmerican Mathematical Society\n, describing the situation and making certain suggestions. Then, with a covering note, I sent it to 'Science' there being no\nAmerican Mathematical Society\nor\nMathematical Association of America\noutlets for letters then ...\nAnother incident occurred at a\nMathematical Association of America\nmeeting in November\n1951\n. Lorch wrote to the Board of Governors of the\nMathematical Association of America\non\n17\nDecember\n1951\n(\nquoted in\n[\n8\n]\n)\n:-\nNo housing or dining facilities were provided by the host institution and the printed program listed only places that are restricted to white patrons. One Negro mathematician did attend. He had to eat by himself. Since he is a Professor at Tuskegee\n(\nless than twenty miles away\n)\nhe was able to return home to sleep. Had he come from a more distant institution and desired to remain over for the second day of the meeting there is no telling where he might have had to sleep. The program listed a Social Hour, details to be announced at the meeting. He asked at the registration desk for further information. A member of the Arrangements Committee told him that \"technically\" he could attend, but that he \"probably would not want to do so, as it was being held in one of the girls' dormitories\".\nLorch was dismissed from Fisk University in\n1955\n. We explain briefly how this came about. The United States Supreme Court, on\n17\nMay\n1954\n, declared that segregation in public education was unconstitutional. Lorch and his wife decided, in the light of that decision, to send their daughter to the school nearest to their home which was a \"Black school\". However, the Nashville School Board refused to allow their daughter to attend the school. Shortly after this, Lorch was summoned to appear before the House Committee on Un-American Activities. He came before them on\n7\nSeptember\n1954\nand was asked whether he was a member of the Communist Party. Although he felt that such questioning was not appropriate, nevertheless, wanting to continue to support Fisk University he said he was prepared to answer. He had not been a member of the Communist Party during his appointment at Fisk. He was then asked whether he had been a member of the Communist Party during\n1941\nwhen he was a graduate student at the University of Cincinnati. He refused to answer, invoking the First Amendment of the Constitution. The Trustees of Fisk College then reviewed Lorch's case and he appeared before them on\n28\nOctober. At first they voted to retain him but, by early\n1955\n, they changed their minds and voted to dismiss him. The American Association of University Professors censured Fisk University in a report of\n1958\n-\n59\n(\nsee\n[\n2\n]\n)\n:-\nThe Administration of Fisk University, in\n1954\n-\n55\n, was guilty of serious violations of academic freedom and due process in reaching its decision not to renew the appointment of Professor Lee Lorch. The initial, implicit basis for the Board's consideration of the case, that he had acted improperly when he invoked the First Amendment before a Congressional Committee, was dropped. The substituted, explicit basis for the Board's action, that his conduct subsequent to the hearing was detrimental to the educational program at Fisk University, was not framed as a specific charge against him. No hearing, in accordance with accepted standards, was held.\nEthel Payne, a Black journalist wrote in\nThe Chicago Defender\nin May\n1956\n:-\nBecause he believed in the principles of decency and justice, and the equality of men under God, Lee Lorch and his family have been hounded through four states from the North to the South like refugees in displaced camps. And in the process of punishing Lee Lorch for his views, three proud institutions of learning have been made to grovel in the dust and bow the knee to bigotry.\nOut of a job again, Lorch was appointed to Philander Smith College, in Little Rock, Arkansas. This small, privately supported, four-year liberal arts institution took only black students at the time. Founded in\n1877\n, it had been fully accredited by the North Central Association of Colleges and Schools in\n1949\n. Both Lorch and his wife continued to support the integration of all races. He worked\n[17\n:-\n... behind the scenes, accompanying the black students to school, then tutoring them as they awaited admission to the high school. Once more, whites abused the Lorches for their activities, evicting them from their apartment, harassing their young daughter, burning a cross on their lawn and placing dynamite in their garage.\nThe situation became so intolerable that Lorch resigned. Now by\n1959\nthere was no possibility that he could get a job at any American institution so the family moved to Canada where he was appointed to the University of Alberta in Edmonton. He stayed there for nine years before being persuaded by York University in Toronto to accept a position there in\n1968\n. He retired from his chair in\n1985\nbut continued to undertake research. His obituary from York University gives details of his life after retirement\n[\n22\n]\n:-\nAt\n91\n, he was still using an office at York University, an activity he continued until just a few short years ago. During his early\n90\ns, Lorch collaborated on a research paper about\nBessel functions\nwith Prof Martin Muldoon, a former grad student under Lorch in Edmonton, who was also retired from York's Mathematics Department. Lorch travelled to and from the campus frequently well into his\n90\ns. He could be spotted on campus participating in meetings and other activities. He was a regular patron of restaurants in York Lanes and enjoyed Middle Eastern cuisine in particular. During his later years, Lorch loved the freedom that e-mail and the Internet provided and while his physical mobility decreased, his online activity and activism increased. Up until he was hospitalized, Lorch devoured five newspapers a day, including the 'New York Times'. He would send flurries of e-mails daily about peace and justice issues to friends and acquaintances in and out of the mathematical community.\nThe latter part of Lorch's career saw him recognised by many organisations, including two institutions that had dismissed him. City University of New York and Fisk University both awarded him honorary degrees. He received many other honours including: election as a Fellow of the\nRoyal Society of Canada\n(1968)\n; a civil rights award from Howard University\n(1976)\n; and a civil rights award from the\nUS National Academy of Sciences\n(1990)\n. He was awarded an honorary from York University for mathematics and civil rights activism\n(1993)\nand he received honorary life membership of the International Society for Analysis, Applications and Computation\n(2003)\n(\nsee\n[\n15\n]\n)\n. In\n2007\nhe received the Yueh-Gin Gung and Charles Y Hu Award from the\nMathematical Association of America\n.\nThe citation is at\nTHIS LINK\n.\nLorch died in hospital in Toronto at the age of\n98\n. Finally let us quote Lorch's own summary of his paper\n[\n12\n]\nwritten in\n1996\n:-\nThis is a discussion of the domestic and international contexts within which the African American mathematical community has struggled and is struggling. The effect of general social forces on scientific opportunities is emphasized. Stress is laid upon the importance of supporting the civil rights movement so as to protect, hopefully to expand, minority opportunities in mathematics. These are the mass movements which have forced open some windows of opportunity, windows powerful forces are now seeking to close.",
  "matematicos_citados_na_biografia": [
    "Otto Szász",
    "Fourier series",
    "Lebesgue",
    "Borel",
    "Evelyn Boyd Granville",
    "Etta Zuber Falconer",
    "Mathematical Association of America",
    "American Mathematical Society",
    "Bessel functions",
    "Royal Society of Canada",
    "US National Academy of Sciences",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}