{
  "nome_completo": "Leonty Filippovich Magnitsky",
  "nome_curto": "Leonty Filippovich Magnitsky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Magnitsky/",
  "data_nascimento": "9 June 1669",
  "local_nascimento": "Ostashkov, Russia",
  "data_morte": "30 October 1739",
  "local_morte": "Moscow, Russia",
  "summary": "Leonty Magnitsky was a Russian teacher who wrote the first guide to mathematics published in Russia.",
  "biografia": "Leonty Filippovich Magnitsky\n(\nor\nLeontii Filippovich Magnitskii\n)\nwas the son of the peasant Filipp Telyatin. He was born on lands where his father worked near Tver which is situated in western Russia at the confluence of the upper Volga and Tvertsa rivers. Nothing is known for certain about Leontii Filippovich's childhood except that he had to work hard yet learned to read and write. He was sent to the Iosifo-Volokolamsky Monastery when he was\n15\nyears old and, when it was discovered that he already had the ability to read, he was given religious books to study. He went from there to the Simonov Monastery, a fortified monastery built as part of an outer fortification ring for the city of Moscow, where he trained to be a Russian Orthodox priest. He studied at the Slavo-Greco-Latin Academy in Moscow from\n1685\nuntil\n1694\nand there became fluent in Latin, Greek, German and Italian. At this stage he began to earn a living teaching the children of the important families in Moscow. He continued to do this until\n1701\n.\nPeter the Great, Tsar of Russia, founded the School of Mathematics and Navigation in Moscow in\n1701\n. Russia was a major power at this time but had no access to the sea. Peter decided that he would push north to try to dislodge the Swedes who controlled the Baltic coast and war had begun on this front in\n1700\n. The many reforms, including the start of secular education, which Peter introduced to modernise Russia aimed to ensure victory in his wars for access to the seas. The declaration setting up the Moscow School was dated\n14\nJanuary\n1701\n, but formal classes did not begin immediately. There was a delay since facilities were not properly in place to allow teaching to begin. Peter the Great then appointed Magnitskii to the School on\n2\nFebruary\n[\n9\n]\n:-\nIn February, Magnitskii was appointed to the school and simultaneously ordered to compile a book \"in the Slavonic dialect, selected from arithmetic, geometry and navigation.\" The 'Arithmetic' was therefore specifically commissioned to be the textbook of the Moscow School. Little is known about the classes in the school while the book was being prepared. It was sent to the publisher on\n2\nNovember\n1702\n, and appeared bearing the date\n11\nJanuary\n1703\n. With its appearance the success of the school was assured.\nThe 'Arithmetic' was the first mathematics textbook published in Russia by a Russian which was not a translation or adaptation of a foreign textbook. It was a textbook for the courses which Magnitskii himself taught at the school, essentially a published version of his lecture notes. It was in effect an encyclopaedia of the mathematical sciences of its day, based strongly on applications in navigational astronomy, geodesy and navigation. It used the methods of algebra, geometry, and trigonometry\n[\n9\n]\n:-\nIt was organised in the didactic question-and-answer format, in which each new topic was introduced by a question, which was followed by a reply which the student had to learn by heart. ... Theoretical questions of mathematics were almost entirely absent. Geometry and trigonometry were not abstract entities, but solution methods for navigational problems, just as contemporary English and American texts relied on examples of commercial transactions to induce students to do their calculations. \"Geography\" in the curriculum meant land surveying and map plotting. \"Astronomy\" meant celestial navigation. Magnitskii's book was the general text, and only its last section dealt specifically with navigation. A wide variety of students might use it, and in straightforward pragmatic terms, Magnitskii declared that the science of numbers was useful to merchants, for those in charge of financial matters, for the keepers of church funds, for property owners and stewards, for all manner of craftsmen whether they were constructing buildings, sailing ships, measuring granaries, levying taxes, or performing some military duty. In short, mathematics was a skill useful to both man and the polity. Nothing could be more practical than Magnitskii's reminder, \"Riches come to the hands of the man who loves wisdom and the sciences.\"\nOther features of the 'Arithmetic' worth mentioning are that it contained the geographical position of twenty-six well-chosen places in Russia and other countries, and in addition it contained astronomical tables. In\n[\n9\n]\nthere is interesting information on how students at this time studied:-\n[\nA\n]\nstudent took each of the \"sciences\" in sequence. Students might take any amount of time to master the various subjects. There was no statutory time limit for the completion of a subject or for the entire curriculum. The average duration of study was five to six years. A few students completed the full course in four years, and others required as long as eleven. The time varied greatly because of the various students' ability, but also because the 'Arithmetic' relied on the universal teaching method of the day, memorisation.\nOkenfuss notes in\n[\n9\n]\nthe fact that the book was hugely practical in its format, yet throughout the work Magnitskii praises the Liberal Arts:-\n... although the 'Arithmetic' was a practical text, it did not escape the tension, common in contemporary Western texts as well, between mathematics as a useful skill and as one of the Arts. Even in this practical manual, the ancient Liberal Art of Arithmetic, that is, mathematics as a form of logic and expression prevailed. It showed in versified passages throughout the book which expressed moral precepts, general conclusions and advice to the pupil. But nowhere was the tension more evident than in the Introduction, the first part of which consisted of an intricate argument concerning the superiority of man over beast and nature. Man's natural superiority stemmed from his God-given advanced senses and mind, which demanded the pursuit of the various arts and sciences for their full development. Man's powers could be expanded only in the cultivation of the Liberal Arts, Arithmetic among them. The book was an anomaly. Practical in its tone and purpose, it began with a versified preface which extolled the Liberal Arts. Designed for a technical training centre, it justified itself through philosophical discussion of the nature of man.\nMore information about the 'Arithmetic', which remained the basic Russian mathematics textbook for\n50\nyears, is given by Eremeeva in\n[\n7\n]\n. The book\n[\n4\n]\nis also worth looking at for it contains many entertaining problems taken from Magnitskii's 'Arithmetic'. Although this is the text for which Magnitskii is most famed, he did, however, also produce other works. For example he produced a Russian edition of\nAdriaan Vlacq\n's logarithm tables which, like the 'Arithmetic', appeared in\n1703\n. In collaboration with V Kipriyanov, Magnitskii prepared another book of arithmetical tables, this one being published in\n1705\n. He also edited\nTables for Navigation\nwhich was published in\n1722\n.\nPeter the Great was clearly well pleased with Magnitskii's work and his 'Arithmetic' book, and it claimed that it was he who called him Magnitskii, claiming he was the \"people's magnet\". He had a house built for Magnitskii's family in Moscow in\n1704\n. Peter the Great also made use of the skill which Magnitskii must have had in practical fortifications, since when Sweden invaded Russia in\n1707\nas part of the continuing war to the north, Peter had Magnitskii work on fortifications of the city of Tver. Magnitskii remained at the Moscow School of Mathematics and Navigation for the rest of his life. From\n1715\nuntil his death he was director of the School. We know a little more about his teaching at the School through letters he wrote. In particular, in February\n1719\n, he wrote to Admiral Apraksin that he was teaching:-\n... arithmetic, geometry, trigonometry, even as far as navigation, and having finished these sciences, the students are ordered to be sent to the other school, to the foreigner Henry Farquharson and his colleague Gwyn.\nNote that at this time he was Director of the School, yet clearly was still teaching. He told the Admiral that, at that time, twenty-six students had completed the core curriculum.",
  "matematicos_citados_na_biografia": [
    "Adriaan Vlacq"
  ],
  "imagens": [
    "magnitsky.jpg"
  ]
}