{
  "nome_completo": "Leonard Roth",
  "nome_curto": "Leonard Roth",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roth/",
  "data_nascimento": "29 August 1904",
  "local_nascimento": "Edmonton, London, England",
  "data_morte": "28 November 1968",
  "local_morte": "Pittsburgh, Pennsylvania, USA",
  "summary": "Leonard Roth was an English mathematician who worked on Algebraic Geometry.",
  "biografia": "Leonard Roth\n's parents were Morris Roth\n(1875\n-\n1953)\nand Jane\n(\nJenny\n)\nDavis\n(1876\n-\n1940)\n; they were Jewish. Leonard, the eldest child of the family, was born in Edmonton in the London Borough of Enfield. He had two sisters, Queenie Dorothy\n(1906\n-\n1981)\nand Ruby Caroline\n(1912\n-\n1940)\n. His father Morris was a draper with a shop in Silver Street, Edmonton, in the north east of London. The Roth family has been researched by Kate Varney, a daughter of Leonard Roth's sister Queenie, and she has discovered fascinating details about Leonard Roth's ancestors and his childhood.\nSee the\nTHIS LINK\nfor details.\nSilver Street, Edmonton, where the Roth family lived was then on the edge of the country with a farm at the end of the road. The Roth children would go out for long country walks, with\n6\nd to buy tea with a boiled egg from a farmer's wife. As a young boy, Leonard kept an arrangement of the dominoes set on a table in the parlour to represent trains and he devised a timetable for the children to push the \"trains\" under his instructions. In the scullery were brass taps and pipes; a game was to polish these pretending that they were the brass of railway engines. A Hebrew tutor came to the house to teach Leonard. Family holidays would, of course, have been quite unknown, but Leonard and his sister Queenie were sent on more than one occasion in the summer to lodgings at Winchelsea for the sea air.\nLeonard attended Latymer Elementary School, beginning in\n1914\nand, three years later, was admitted to Latymer Upper School. He showed great promise at the Latymer School, which was in Haselbury Road, Edmonton, but perhaps it is surprising that mathematics was not his first love, for he found himself attracted towards the humanities. Nevertheless his achievements in mathematics made him decide to try for a mathematics scholarship to study at Clare College, Cambridge. Latymer School realised that Leonard needed tuition at a level they could not give in order to gain a Mathematics Scholarship to Cambridge and it was with the headmaster's agreement that he went for a term in autumn\n1922\n, before the Cambridge scholarship examinations, to attend Dulwich College. He was a day boy, living nearby with his cousins the Horwoods in Upper Norwood. He was successful in the examinations, winning a £\n60\na year Foundation University Scholarship, and matriculated at Clare College, Cambridge in\n1923\n.\nHe graduated from Cambridge with a First Class degree in\n1926\n. Among his teachers were\nLeopold Pars\nwho taught him dynamics, and\nJ E Littlewood\nwho taught the foundations of function theory. However Roth had a very low opinion of the examinations set by Cambridge\n[\n3\n]\n:-\nHe left a witty and moving description of the agony involved in\n[\nthe Mathematical Tripos\n]\nexamination in a manuscript which appeared posthumously. Although he probably never intended this to be published, it is nevertheless a delightful and fascinating source of information about mathematical life in Cambridge ... with vivid anecdotes about the great men of the time such as\nForsyth\nand\nLittlewood\n.\nThis quote is intriguing enough that one must look at Roth's experiences as detailed in\n[\n1\n]\n. The Tripos examinations consisted of six papers for Schedule A, each of\n3\nhours, sat\n9\n.\n00\nto\n12\n.\n00\nand\n13\n.\n30\nto\n16\n.\n30\non each of Monday, Tuesday, Wednesday. Schedule B consisted again of six papers in exactly the same pattern on the following week. Roth writes\n[\n1\n]\n:-\nThe typical Schedule A question was a triple-decker: first the candidate would be asked to prove a theorem; then would come a problem based more or less on the theorem; and thirdly, another problem even less based than the first. In fact, despite all appearances to the contrary, this last might break fresh ground: that was the sting in the tail. Everybody knew that only complete answers to questions really counted, and that postscript mattered more than the rest. Hence a certain general foreboding. A candidate, even a well-prepared one, might go into the examination on the Monday morning and find himself unable to do a single complete question; if, unduly depressed by this failure, he had the same experience on the Monday afternoon, then it was all over save the post-mortem.\nAfter giving an example of a typical triple-decker question, Roth writes:-\nIn questions of this type one might polish off the first two parts in no time at all, only to waste up to an hour on the third. And that way madness lies.\nHe survived the Mathematical Tripos, obtaining a First Class degree. As he recalled\n[\n1\n]\n:-\nLuck certainly played a considerable part in the examination. I myself had some of each sort, though admittedly more good than bad.\nHe then undertook research gaining great inspiration from\nH F Baker\n's\nPrinciples of geometry\n. After this he was appointed as a Demonstrator in Imperial College of Science and Technology, London. Soon after arriving there he was awarded a Rockefeller Research Fellowship which enabled him to spend the academic year\n1930\n-\n31\nin Rome. The Fellowship was:-\n... to enable him to study the continuation of the study of loci in higher space under Professor\nSeveri\n.\nThe referees supporting his application for the Fellowship indicated the high regard in which he was held:-\n... an able student of\nalgebraic geometry\nof great industry and strength who is likely if the opportunity is afforded him, of doing very important work in the subject. ...\n... has devoted most of his leisure during these four years to geometrical studies and research. ... has produced a stream of valuable papers which have received publication in important journals in this country ... has worked largely by himself, without much personal contact with other geometers since leaving Cambridge. ... still very young ...\n... has shown himself to be an exceedingly capable mathematician of distinctive quality with a fine power for original research ... by temperament and outlook by no means a narrow specialist, he is widely read with a broad interest in affairs. ...\nThe year in Italy was an extremely profitable time for Roth, for there he met many of the great Italian mathematicians and he learnt a great deal from\nCastelnuovo\n,\nEnriques\n, and\nLevi-Civita\nin addition to\nSeveri\n. He was greatly influenced by the work of these mathematicians and his future research directions were very much laid down at this time.\nNot only did Roth benefit mathematically from his personal contact with the Italian geometers while he was in Rome, but also at that time he met Marcella Baldesi, the only daughter of the reformist socialist Member of Parliament Gino Baldesi who was Roth's Rome landlord. Soon Leonard and Marcella were married\n[\n3\n]\n:-\n[\nMarcella\n]\nwas a very lively and intelligent person with a passionate interest in music - she was an excellent pianist - and together they made a most wonderful couple.\nThe marriage seems to have resulted in Roth's estrangement from his parents. He had already become estranged from his sister Queenie, despite their hitherto very close relationship, when she married a non-Jew in\n1929\n: Leonard sided with his mother. There was no reconciliation following any of these family break-ups. After Roth returned to London from Rome in\n1931\n, he was appointed as an Assistant Lecturer in Mathematics at Imperial College. In\n1938\nhe was promoted to Lecturer in Mathematics, in\n1946\nhe was given a Senior Lectureship, and four years later he was promoted to Reader. He remained at Imperial College until\n1965\nwhen he went to Pittsburgh in the United States, first as a visiting professor, then from\n1967\nas Andrew Mellon Professor of Mathematics. Kenneth Agnew, who was a close friend of Roth's, wrote\n(\nsee\n[\n5\n]\n)\n:-\nLeonard was quiet and certainly very modest but, I think, avoided general purpose socialising at all costs on boredom grounds. He was not shy or 'un-sporty' and was accustomed to the public arena. He enjoyed Pittsburgh because he got much bigger audiences for his, then, rarefied field. He was very articulate and was a better speaker - and I think brighter - than his head of department at Imperial, Dr\nWhitrow\n. ... He was a great walker and took me with him. Marcella showed me a picture of him as a young man dressed either for cricket or tennis. She particularly liked it probably because it was from the time she first knew him and he still had quite a lot of curly hair.\nAlmost all his work was on geometry where he extended work begun in the Italian school. He therefore worked with classical methods and concepts but applied these to a wide range of problems in different areas. To succeed in this approach he required an intimate knowledge of the vast range of literature that existed, and also an ability to see connections in results on apparently distinct topics. In many ways it can be said that he knew the work of the Italian mathematicians better than they did themselves, partly since he was able to view the whole development from the outside. He also took an approach to geometry which produced large amounts of experimental material and this is highlighted in the review of his most famous book from which we quote below. Also highlighted in this review is the informality of Roth's approach, which again was typical of all his work.\nThe famous book we referred to is\nIntroduction to Algebraic Geometry\nwhich Roth wrote with\nJack Semple\n, and it was published in\n1949\n.\nOscar Zariski\n, reviewing the book, wrote:-\nThe ground covered in this book is very extensive: almost every topic of the classical algebro-geometric theory of algebraic curves, surfaces and varieties is discussed, or at least briefly mentioned, in the course of the exposition. Since it is obviously impossible to write a treatise in one volume on the whole of algebraic geometry\n(\neven if the transcendental and topological theories are excluded\n)\n, one would be tempted to conclude a priori that the present book must be something in the nature of an encyclopaedia article. This, however, is not the case. While the book is much less than a treatise in which the subject matter is not only presented but also developed step by step with complete rigor, it is also much more than a formal report of results. For one thing, the authors have included in the text a very large number of special but important examples\n(\nspecial curves, surfaces, special transformations\n)\n, and these examples are discussed in great detail. It is in these examples that the ideas and methods of the general theories are put to work on concrete situations. This wealth of experimental material will be welcome even by the specialist, but it will be really invaluable to the beginner who wishes to acquire a geometric insight and develop a geometric technique. In the second place, the theorems which belong to the general theoretical topics of the book are not merely stated. There is a definite attempt to prove them or at least to justify them to the reader.\nAnother text written by Roth is\nAlgebraic threefolds, with special regard to problems of rationality\n(1955)\n.\nJ A Todd\n, in a review of this book, writes:-\nThis book gives an account of the birational properties of algebraic threefolds. The emphasis is very much on the algebro-geometric treatment, though for a number of results reference is made to transcendental and topological methods and to theorems of\nLefschetz\n. ... Chapter VI is concerned with threefolds with infinite groups of birational self-transformations, a topic to which the author has contributed much of what is known.\nIn addition we should mention Roth's other books:\nElements of probability\n(1936)\n, written with\nHyman Levy\n, and\nModern elementary geometry\n(1948)\n. The obituary\n[\n3\n]\nlists about\n90\npapers in addition to the books we have mentioned.\nRoth and his wife both died tragically in a car accident in the United States. He was sixty-four and very active mathematically up to the time of his death, so much so that many interesting unpublished results were found among his papers and they were published posthumously. The articles\n[\n1\n]\nand\n[\n2\n]\n, among the unpublished papers found at that time, were almost certainly not intended for publication. It is, however, a joy to read them and\n[\n1\n]\nin particular is filled with Roth's humour. Kate Varney writes of the Memorial Service held in Pittsburgh\n[\n5\n]\n:-\nAt the Pittsburgh University's Memorial Service on\n8\nDecember\n1968\nfor the Roths the University Jewish Chaplain gave several the readings from the Psalms and the Old Testament, the tribute was by the Head of the Mathematics Department and several pieces of music by J S Bach and Ernst Bloch were played. This seems to confirm that Leonard had kept alive his feeling for his Jewish roots although those who knew him in the\n1950\ns confirm that he was no longer active or observant in Judaism. Marcella is presumed to have had a Roman Catholic family background, but there is no evidence that she followed religious practices.\nThe Roths had no children and their money was, largely, left to charities\n[\n5\n]\n:-\nHis Will left the bulk of his estate\n(\nabout £\n14\n,\n000)\nto be divided between Dr Barnardo's Homes and the Musicians' Benevolent Fund. Marcella's Will specified bequests of jewellery, valuables and sums of money to relatives and friends in Italy\n(\nmostly in Florence\n)\n, and likewise the residue of her estate to Dr Barnardo's and the Musicians' Benevolent Fund. They both stipulated cremation and burial of their ashes in the Trespiano Cemetery, Florence.\nMarcella Roth was an outstanding pianist, and Leonard too was very musical, with a vast collection of gramophone records, always being played. Their house was full of beautiful pictures and objects, so that the friends and Italian relatives of the Roths were greatly distressed when the solicitors acting as sole executors summarily disposed of the house and its contents.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Leopold Pars",
    "J E Littlewood",
    "Forsyth",
    "Littlewood",
    "H F Baker",
    "Severi",
    "algebraic geometry",
    "Castelnuovo",
    "Enriques",
    "Levi-Civita",
    "Whitrow",
    "Jack Semple",
    "Oscar Zariski",
    "J A Todd",
    "Lefschetz",
    "Hyman Levy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}