{
  "nome_completo": "Leonard Carlitz",
  "nome_curto": "Leonard Carlitz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carlitz/",
  "data_nascimento": "26 December 1907",
  "local_nascimento": "Philadelphia, Pennsylvania, USA",
  "data_morte": "17 September 1999",
  "local_morte": "Pittsburgh, Pennsylvania, USA",
  "summary": "Leonard Carlitz was an American mathematician who published more than 700 papers mainly in  finite field theory, number theory and combinatorics.",
  "biografia": "Leonard Carlitz\n's father, Michael Carlitz\n(\nborn about\n1877)\n, was a Jewish immigrant from Ukraine while his mother, Anna Schneyer\n(\nborn about\n1878)\n, was a Jewish immigrant from Latvia. Michael, whose original name was Mordechai Karelitz, and Anna had both emigrated to the United States with their parents, the Carlitz family in\n1891\nand the Schneyer family in\n1894\n. Michael Carlitz sold coffee in Philadelphia and, later, ran a tobacco store in the same city. Leonard, the middle child of is parents' three children, had two sisters, Roseline, born in Philadelphia around\n1911\n, and Ruth, born in Philadelphia around\n1903\n.\nLeonard attended school in Philadelphia and his remarkable academic talents were clear at this time. These talents led to him being awarded a scholarship to study mathematics at the University of Pennsylvania in Philadelphia. He graduated with a A.B. in mathematics in\n1927\n, completing his Master's degree in mathematics the following year. On completing his Master's degree, Carlitz remained at the University of Pennsylvania to study for his doctorate which was supervised by Howard H Mitchell\n(\na student of\nOswald Veblen\n)\n. He became interested in\nEmil Artin\n's early work which was on quadratic number fields, in particular the analytic and arithmetic theory. In\n1927\nArtin\nmade a major contribution to the theory of noncommutative rings, called hypercomplex numbers at this time. Inspired by\nArtin\n's work, Carlitz wrote his dissertation\nGalois fields of certain types\nwhich led to the award of a doctorate in\n1930\n[\n8\n]\n:-\nOn his oral examination for the Ph.D. he was asked to sketch\nGauss\n's proof of the law of quadratic reciprocity. Carlitz replied: \"During his lifetime\nGauss\ngave seven different proofs of this result. Which one would you like to see?\"\nThe main results of his doctoral dissertation were published in a\n21\n-page paper in the\nTransactions\nof the\nAmerican Mathematical Society\nin the year that his doctorate was awarded.\nImmediately after the award of his doctorate, Carlitz received a National Research Council Fellowship which let him spend a year at the California Institute of Technology working with\nE T Bell\n. Returning to Philadelphia in the summer of\n1931\n, he married Clara Skaler. They had two sons Michael Carlitz, born in\n1939\n, and Robert D Carlitz born in\n1945\n. Michael Carlitz became a IBM computer programmer while Robert became a University of Pittsburgh physics professor. After his marriage Carlitz and his wife headed for Cambridge in England where he spent the academic year\n1931\n-\n32\nas an International Research Fellow with\nG H Hardy\n[\n7\n]\n:-\nThis was the era when\nHardy\nand\nLittlewood\nled one of the great centres of research in number theory, and Carlitz found the mathematical atmosphere there exhilarating. His work in additive number theory derives from that period.\nWhen he returned to the United States he was offered a post at Duke University, in Durham, North Carolina, which he gladly accepted. In many ways he was fortunate to be offered this position since, although he had an outstanding record, this was the time of the Depression and jobs were extremely scarce. In a way he was lucky for two members of the Mathematics Department at Duke University, Joseph M Thomas and John H Roberts, both had connections to the University of Pennsylvania in Philadelphia and learnt first hand about Carlitz's talents. Roberts had been both an undergraduate and postgraduate student at the University of Pennsylvania and was awarded a Ph.D. in\n1923\n. Duke University had been founded in\n1924\nbut for the first years the Mathematics Department had been run by Robert Flowers, the University Vice-President, who had not been successful in appointing high quality researchers to the Department. This changed when Thomas and Roberts were appointed, in\n1930\nand\n1932\nrespectively, who were then able to add Carlitz in\n1932\n. Concerning Carlitz appointment to Duke University, Robert Durden writes in\n[\n1\n]\n:-\nCarlitz ... had done both his undergraduate and doctoral work\n[\nat Pennsylvania\n]\n. His supervising professor there reported that Carlitz \"so far excelled the other students here as to be literally in a class by himself.\" Only the \"serious financial situation\" at Pennsylvania, the professor explained, kept them from offering Carlitz a position there, and he was being considered at several major universities. From Oxford University, where Carlitz was doing postdoctoral work, came word that a paper published by him in the 'Oxford Quarterly Journal' had made an excellent impression and shown that he was \"fully master of the technique of his trade.\" The Oxford don opined that Carlitz was no doubt \"better equipped in the analytic theory of numbers than anyone else in America.\"\nThe appointment of John Jay Gergen, who had been a student of\nGriffith Conrad Evans\nand\nSzolem Mandelbrojt\n, in\n1936\nstrengthened the Duke Mathematics Department still further. Thomas, Roberts, Gergen and Carlitz taught almost all the mathematics graduate courses at Duke University until the\n1950\ns. Carlitz remained on the Faculty at Duke from his appointment in\n1932\nuntil he retired in\n1977\n. He was named James B Duke Professor of Mathematics in\n1964\n.\nOne of the important contributions that Duke University made to mathematics publishing was the founding of the\nDuke Mathematical Journal\nin\n1935\n. Carlitz was involved in the plans that were drawn up for the journal and he served on its editorial board from\n1938\nto\n1973\n. The editorial board of this journal was set up in such a way that new members were appointed as necessary by the existing board. Carlitz was Managing Editor of the\nDuke Mathematical Journal\nfrom\n1945\n. However, in\n1973\nthe administrators of the Duke mathematics department decided that they would decide on appointments to the board. Carlitz strongly opposed this and argued strongly that the board should keep its role in appointing new board members. When he was overruled, he resigned from the board. He also served on the editorial boards of other journals. these included\nActa Arithmetica\n,\nThe American Mathematical Monthly\n, and\nThe Fibonacci Quarterly\n.\nCarlitz published\n771\npapers, supervised\n45\ndoctoral students and\n51\nmaster's theses\n[\n8\n]\n:-\nCarlitz was a kind and gentle man who cared deeply about his students and was admired by students and colleagues alike. Indeed, Carlitz was a mentor not only to his students but to a number of younger mathematicians.\nYou can see a list of the\n45\ndoctoral students with the year of their doctorate and the title of their thesis at\nTHIS LINK\n.\nHis major mathematical contributions are to finite field theory, number theory, and combinatorics. But his publications extend beyond these areas to include algebraic geometry, commutative rings and algebras, finite differences, geometry, linear algebra, and special functions. David Hayes writes in\n[\n7\n]\n:-\nThe importance of some of Carlitz's most profound papers was not appreciated until many years after they appeared in print. This unfortunate circumstance is sometimes attributed to the large number of his research papers. However, his choice of non-descriptive titles for many of his papers is a more likely explanation.\nJoel Brawley writes in\n[\n3\n]\nabout his most remembered results\n(\nwe have modified this quote by inserting the titles of the papers\n)\n:-\nOf all of his research, Carlitz will perhaps best be remembered for three items which bear his name. These are:\n(\ni\n)\nhis development in\n[\nOn certain functions connected with polynomials in a Galois Field\n(1935)]\nand\n[\nA class of polynomials\n(1938)]\nof what is today called the Carlitz module\n(\nsee\n[\nD Goss, 'Basic Structures of Function Field Arithmetic'\n(\nSpringer-Verlag, Berlin/New York,\n1996)])\n,\n(\nii\n)\na conjecture he made in\n1966\nwhich came to be known as the Carlitz Conjecture\n(\nsee\n[\nD R Hayes, 'A geometric approach to permutation polynomials over a Finite Field', Duke Math. J.\n34\n(1967)\n,\n293\n-\n305\nand also J V Brawley, 'Dedicated to Leonard Carlitz: The Man and his Work', Finite Fields Appl.\n1\n(1995)\n,\n135\n-\n151])\n, and\n(\niii\n)\nan estimate for exponential sums\n[\n'Bounds for exponential sums'\n(1957)]\nthat he derived with S Uchiyama, now known as the Carlitz-Uchiyama bound.\nMathSciNet lists\n237\npapers with Carlitz's name in the title. Looking at the first few of these which occur in papers written in the last ten years we see: Carlitz's identity for the\nBernoulli\nnumbers; Al-Salam-Carlitz polynomials; Carlitz-type\nq\nq\nq\n-\nEuler\npolynomials; Carlitz's\nq\nq\nq\n-\nBernoulli\nnumbers; Carlitz inversions and identities; Carlitz module analogues of\nMersenne\nprimes; Carlitz cyclotomic polynomials;\nRademacher\n-Carlitz polynomials; Carlitz-Wan conjecture for permutation polynomials; Carlitz rank of permutations;\nTricomi\n-Carlitz polynomials;\nStieltjes\n-Carlitz polynomials; Carlitz's type q-tangent numbers; q-generating functions of the Carlitz; Carlitz-Srivastava polynomials; Carlitz's trilinear generating functions; Bernoulli-Carlitz numbers; Carlitz's q-operators;\nDedekind\n-Carlitz polynomials; Carlitz algebras; Carlitz logarithms; Carlitz-Goss gamma function; and Carlitz compositions.\nOne has to ask; how anyone could publish\n771\npapers? Perhaps David Hayes provides at least a hint in\n[\n7\n]\n:-\nIn\n1953\nhe published a record\n44\npapers. His most active decade was\n1960\n-\n69\n, when he averaged\n27\npapers per year. During the early\n1960\ns, when I was one of his graduate students, Carlitz had a National Science Foundation grant that paid for a half-time secretary. On more than one day I observed him reading a journal paper raising a question that he found of interest, that evening writing up a paper of his own answering the question, and having it typed and sent off to a journal the following day.\nAs Joel Brawley writes in\n[\n2\n]\n:-\nLeonard Carlitz is certainly one of the most prolific mathematical researchers of all time.\nJohn Brillhart, a co-author of\n[\n4\n]\nand\n[\n5\n]\n, is the editor-in-chief of\nCarlitz's Collected Works\nand, given Carlitz's remarkable publication record, few editors of such volumes will have to handle a larger number of papers and the final result should contain around\n6800\npages of research articles.\nHayes describes in\n[\n6\n]\na graduate course that Carlitz gave at Duke University:-\nWhile a graduate student at Duke University in the early\n1960\ns, I was privileged to take Leonard Carlitz course \"The arithmetic of polynomials.\" At the first class meeting, Leonard gave each student a detailed set of notes that served as a textbook for the course. These notes were neatly typed and reproduced by ditto machine, the leading-edge copying technique of that era. My own copy, still readable in faded ditto purple, occupies a special place on my office bookshelf. Of course the notes evolved over time. The version I have is\n277\npages long and divided into\n29\nchapters.\nOne chapter of these chapters, Chapter\n19\n, is published as an article in\nFinite Fields Appl\n.\n1\n(2)\n(1995)\n, a volume specially dedicated to Carlitz. G L Mullen, the editor-in-chief, writes in the introduction to the part:-\nWith his permission, this article was extracted from classroom notes Carlitz wrote some forty to fifty years ago and shows that there is significance even in his unpublished research.\nMullen, a doctoral student at the time, writes in\n[\n10\n]\nof meeting Carlitz:-\nDuring the\n1973\n-\n74\nacademic year, Professor Leonard Carlitz gave a colloquium in our department concerning permutation polynomials over finite fields. ... I vividly recall the tremendous enthusiasm that Professor Carlitz showed for various topics in finite field theory. In addition I recall how generous Professor Carlitz was with his ideas. Shortly after his return to Duke University, Professor Carlitz sent me a large package of reprints along with a number of very helpful comments and references.\nHis hobbies and interests outside mathematics are given in\n[\n3\n]\n:-\nThroughout his life Carlitz was an avid reader and a great fan of classical music. Up until about a year prior to his death he still subscribed to the 'New York Times', and he was always very much interested in reading - especially biographies of the great scientists and mathematicians. Even in the several months prior to his death, Carlitz could readily identify the composers of the classical music pieces to which he was listening. His main form of exercise was walking, and for most of the\n45\nyears he served as a member of the Duke faculty, twice a day he would walk the one-mile round trip between his university office and his home on the edge of the Duke campus. In his declining years he fell and broke his hip on three separate occasions, but each time with great determination relearned to walk - an indication of both his love for walking and his perseverance. He only stopped walking on doctor's orders about a year before his death.\nThroughout his years at Duke University, the Carlitz family lived near the edge of the university campus at\n1410\nMarkham Avenue, Durham. Clara Carlitz died in\n1990\nafter their marriage which had lasted\n57\nyears. Carlitz continued to live in his home on the edge of the campus until June\n1999\nwhen he was\n92\nyears of age and his health was failing. He went into a nursing home in Pittsburgh, Pennsylvania at this time. This meant that he was close to his son Robert and Robert's family. On\n15\nSeptember\n1999\nhe contracted pneumonia and was taken to hospital. He died peacefully two days later.\nCarlitz's contribution is summed up in\n[\n2\n]\n:-\nLeonard Carlitz, a kind and gentle man with deep mathematical insights, has left a truly remarkable research record ...",
  "matematicos_citados_na_biografia": [
    "Oswald Veblen",
    "Emil Artin",
    "Artin",
    "Gauss",
    "American Mathematical Society",
    "E T Bell",
    "G H Hardy",
    "Hardy",
    "Littlewood",
    "Griffith Conrad Evans",
    "Szolem Mandelbrojt",
    "THIS LINK",
    "Bernoulli",
    "Euler",
    "Mersenne",
    "Rademacher",
    "Tricomi",
    "Stieltjes",
    "Dedekind"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}