{
  "nome_completo": "Leopold Löwenheim",
  "nome_curto": "Leopold Löwenheim",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lowenheim/",
  "data_nascimento": "26 June 1878",
  "local_nascimento": "Krefeld, German",
  "data_morte": "5 May 1957",
  "local_morte": "Berlin, Germany",
  "summary": "Leopold Löwenheim was a German mathematician who worked on mathematical logic and is best-known for the Löwenheim-Skolem paradox.",
  "biografia": "Leopold Löwenheim\n's father, Detmold Ludwig Löwenheim, was a mathematics teacher at the Krefeld Polytechnic at the time that his son Leopold was born. However, he was of independent means and three years later, in\n1881\n, he gave up teaching so that he could concentrate on his research. Many years later Leopold revised and edited his father's unfinished work on\nDemocritus\n. Leopold's mother was Elise Röhn who was a writer. Löwenheim attended the Königliche Luisen\nGymnasium\nin Berlin, completing his secondary schooling there in\n1896\n. At school he had a wide variety of interests, being particularly fascinated by mathematics and natural sciences. He also developed a liking for philosophy and, in the year he graduated from high school, he joined the Deutsche Gesellschaft für Ethische Kultur. His father had also been a member of this same Society showing that both had strong concerns for social thought and culture.\nHaving obtained qualifications to study at university, Löwenheim entered the Friedrich-Wilhelm University of Berlin in\n1896\nand studied mathematics and natural sciences there, and also at the Technische Hochschule in Charlottenburg, during the next four years. At the time when Löwenheim studied at these two universities they were in separate cities but now expansion has meant that Charlottenburg has become part of Berlin. Löwenheim was intending to qualify to teach in Gymnasiums and he wished to teach across a range of topics. Therefore, in\n1901\n, he took the examinations to qualify to teach mathematics and physics at all high school grades, and the examinations to teach chemistry and mineralogy at middle school grades. He spent the next year doing postgraduate training, and the following year he taught as a probationary teacher, Then in\n1904\nhe was appointed as a teacher to the Jahn-realgymnasium in Berlin. He joined the Berlin Mathematical Society in\n1906\n, reading his first paper to the Society in the following year. He also became a reviewer for the\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\n.\nDespite war service in France, Hungary and Serbia between August\n1915\nand December\n1916\n, he published a series of important papers on mathematical logic during the eleven years from\n1908\nto\n1919\n, extending work by\nCharles Peirce\n,\nSchröder\n, and\nWhitehead\n. It was during this period, in fact in\n1914\n, that he completed and published his father's work on\nDemocritus\n. We will explain below some of the ideas he introduced into mathematical logic over this period, but at this point we will continue to sketch events in his life. He married Johanna Rassmussen in\n1931\nbut his busy life as a teacher came to an abrupt end a few years later.\nWhen Hitler became Chancellor of Germany in\n1933\n, he immediately announced legal actions against Germany's Jews. On\n7\nth\nApril\n1933\n, Hitler introduced a law for the \"Restoration of the civil service\". This meant that all non-Aryans and Jewish civil servants were dismissed from their positions with the exception of those who either had fought in the Great War or had been in office since August\n1914\n. The definition of non-Aryan included those with one grandparent of the Jewish religion and this was precisely the position that Löwenheim was in. However he should have escaped dismissal under the \"Restoration of the civil service\" law since he met both the other exemption clauses\n(\neither one of which should have allowed him to continue working\n)\n- he had fought in the Great War and he had been in office since August\n1914\n. In line with what happened to others in a similar position, Löwenheim escaped immediate dismissal in\n1933\nbut was forced to retire in\n1934\n.\nLöwenheim now somehow had to try to earn enough to support himself and his wife despite losing his job. He managed to get a post teaching eurythmy\n(\nharmony of bodily movement developed with the aid of music into an educational system\n)\nand geometry at the Anthroposophic School of Eurythmy in Berlin. The school had a philosophy based on the premise that the human intellect has the ability to contact spiritual worlds. Not only did Löwenheim have problems with Nazi discrimination, but he also almost lost his life in the British bombing raids on Berlin. On\n23\nAugust\n1943\nhis home suffered a direct hit by a bomb. In fact bombing raids on Berlin had not been uncommon, with the first daylight raid in January\n1943\n, but the hit on Löwenheim's home came before the major bombing assault on the capital began in November\n1943\n. Löwenheim survived, but he lost his mathematical manuscripts,\n1000\ndrawings, and his mathematical models. In fact he lost unpublished manuscripts on logic, geometry, music and the history of art.\nAlthough Löwenheim survived, top mathematical logicians such as\nBernays\n,\nTarski\nand Heinrich Scholtz\n(\nall of whom had visited Löwenheim during the\n1939\ns\n)\nhad no contact with him after\n1939\nand presumed that he had died in the war.\nQuine\ntranslated\nOn making indirect proofs direct\nfrom German into English and published it in\nScripta Mathematica\nin\n1946\n. Löwenheim, therefore, had a paper published that he was not aware of.\nHeyting\nreviewed the paper and wrote:-\nSimple devices, some of which may be useful in investigating the intuitionistic validity of propositions. As the author remarks, a satisfactory definition of the concept of direct proof has not yet been given.\nLet us now go back to look at his early work. The first significant publications by Löwenheim were the two papers,\nÜber das Auflösungsproblem im logischen Klassenkalkül\nⓉ\n(\nOn the resolution problem in the logical calculus class\n)\npublished in\n1908\nand\nÜber die Auflösung von Gleichungen im logischen Gebietekalkul\nⓉ\n(\nOn the dissolution of equations in logical area calculus\n)\nin\n1910\n. In these\n[\n1\n]\n:-\nLöwenheim analysed and improved upon the customary methods of solving equations in the calculus of classes or domains\n(\nthat is, set theory in its Peirce-Schröder\n[\nCharles Peirce\nand\nErnst Schröder\n]\nsetting\n)\nand proved what is now known as Löwenheim's general development theorem for functions of functions.\nIn\nÜber Transformationen im Gebietekalkül\nⓉ\n(\nOn transformations in areas calculus\n)\n(1913)\nLöwenheim studied matrices of domains and, in a similar way to a modern linear algebra course, showed that transformations can be represented by matrices.\nLet us now look at the result for which Löwenheim is most remembered, namely the Löwenheim-Skolem paradox\n(\nwhich\nSkolem\npointed out is not a paradox!\n)\n. This appears in the paper\nÜber Möglichkeiten im Relativkalkül\nⓉ\n(\nOn the possibility in relative calculus\n)\npublished in\n1915\n. In this paper Löwenheim proved the remarkable result that for any set of sentences of standard predicate logic, if there is an interpretation in which they are true in some domain, there is also an interpretation that makes them true in a countable subset of the original domain. The result was called a paradox since it was believed that certain sets of axioms characterised the real numbers, and now Löwenheim's result showed that the same axioms must hold in a countable subset of the real numbers. It also seemed to make attempts to axiomatise set theory somewhat of a problem. Although it seems to contradict common sense\n(\nas do other results which depend on the Axiom of Choice\n)\n, there is no paradox. The result implies that no uncountable mathematical system, such as those involved in analysis, geometry, and set theory, can be characterised up to isomorphism using only first-order sentences. If one examines the case of the real numbers more closely, then the axioms for an ordered field are all first-order sentences. Löwenheim's result then shows that the real numbers contain a countable ordered field which then cannot satisfy the least-upper-bound axiom which is a second-order sentence.\nAs we mentioned above, despite people believing that Löwenheim had died in the war, he had been able to begin teaching again in\n1946\n. He taught for three years up to\n1949\nat the Pestalozzi-Schule and the Franz-Mehring-Schule both in the Lichtenberg district of Berlin. Johannes Teichert, the son of Löwenheim's wife by a previous marriage, inherited what remained of Löwenheim's unpublished manuscripts. Löwenheim was known to have submitted three papers to\nFundamenta Mathematicae\nin\n1939\nand they were feared lost, but in\n1978\nThiel\n[\n5\n]\nannounced that one of the three papers had been found.",
  "matematicos_citados_na_biografia": [
    "Democritus",
    "Gymnasium",
    "Charles Peirce",
    "Schröder",
    "Whitehead",
    "Bernays",
    "Tarski",
    "Quine",
    "Heyting",
    "Ernst Schröder",
    "Skolem"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}