{
  "nome_completo": "Lois Wilfred Griffiths",
  "nome_curto": "Lois Griffiths",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Griffiths_Lois/",
  "data_nascimento": "27 June 1899",
  "local_nascimento": "Chagrin Falls, Ohio, USA",
  "data_morte": "9 November 1981",
  "local_morte": "Skokie, Illinois, USA",
  "summary": "Lois Wilfred Griffiths was an American mathematician best known for her work in polygonal numbers.",
  "biografia": "Lois Griffiths\n' parents were Frederick William Griffiths and Lena Jones. Lena had studied at Kansas State Normal School and had been a school teacher. Frederick Griffiths was born in Wales and had emigrated to the United States in\n1880\n. He was awarded a B.A. by Oberlin College in\n1893\nand a B.D. by Oberlin Theological Seminary in\n1896\n. He was ordained and married Lena Jones in\n1896\n. He was a minister in Michigan before moving to Ohio in\n1898\nwhere Lois and her brother Harold\n(\nborn\n1898)\nwere born. Soon after the birth of Lois, the family moved to Jennings, Oklahoma Territory, where they lived during\n1899\n-\n1900\n. After working for the Minneapolis Journal, Frederick Griffiths and his family moved to Seattle in\n1904\n.\nLois was educated at elementary and secondary schools in Washington State before entering the University of Washington. Her brother, Harold F Griffiths, also studied at the University of Washington where he was in the Naval Unit and was a member of the University of Washington \"Food Production Squad\". During her undergraduate years Lois was assistant to Comptroller Condon of the University of Washington. She graduated with bachelor's degree in\n1921\nand remained at the University to study for her Master's degree. She received her Master's degree in\n1923\nafter writing\nContact Curves of the Rational Cubic\nwhich was published in type-written form by the University of Washington. She published a paper based on this work entitled\nContact curves of the rational plane cubic\nin the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1925\n. She had been elected to membership of the\nAmerican Mathematical Society\nat the thirtieth summer meeting of the Society held in Vassar College, New York, in September\n1923\n. Entering the University of Chicago in October\n1925\n, Griffiths undertook research for a doctorate in mathematics working with her thesis supervisor\nLeonard Dickson\n. She received the degree in\n1927\nafter submitting her dissertation\nCertain quaternary quadratic forms and diophantine equations by generalized quaternion algebras\n.\nImmediately following the award of her doctorate, Griffiths was appointed as an Instructor in Mathematics at Northwestern University in Evanston, Illinois, where she spent the whole of her teaching career. She was promoted to an assistant professorship of mathematics in\n1930\nthen, after spending research leave in Cambridge, England, in\n1936\n-\n37\n, she was promoted to associate professor at Northwestern University in\n1938\n. She published papers such as\nGeneralized Quaternion Algebras and the Theory of Numbers\n(1928)\nand\nRepresentation of Integers in the Form\nx\n2\n+\n2\ny\n2\n+\n3\nz\n2\n+\n6\nw\n2\nx^{2} + 2y^{2} + 3z^{2} + 6w^{2}\nx\n2\n+\n2\ny\n2\n+\n3\nz\n2\n+\n6\nw\n2\n(1929)\n, both in the\nAmerican Journal of Mathematics,\nand\nA generalization of the Fermat theorem on polygonal numbers\n(1930)\nin the\nAnnals of Mathematics\n. She continued to publish papers on representing numbers in certain forms with work such as\nRepresentation by Extended Polygonal Numbers and by Generalized Polygonal Numbers\n(1933)\nand\nRepresentation as Sums of Multiples of Generalized Polygonal Numbers\n(1936)\n.\nIn\n1945\nGriffiths produced a typewritten set of notes\nDeterminants and systems of linear equations\n. She expanded the notes into a book which was published by John Wiley and Sons as\nIntroduction to the theory of equations\nin\n1945\n. In the Preface she states clearly that her aim is to guide students:-\n... slowly through the proofs of the important general theorems in the elementary theory of algebraic equations.\nThomas Arnold Brown\nin a review indicates the style of the book\n[\n2\n]\n:-\nA very slight background of mathematical knowledge is demanded from the reader. Nevertheless the volume deliberately represents an innovation in literary mathematical presentation. Even moderately elaborate theorems are resolved into simple elements; illustrative examples and particular cases are introduced to pave the way for the formal proofs which follow; and there is much restatement. While such methods are admirable for the classroom and will no doubt prove helpful to the lone worker of mediocre mathematical attainments, there remains a danger that the gifted student may find the going tedious and feel the waft of any stimulus to inspire him to further study.\nTwo later typewritten sets of notes by Griffiths\nOutline of the theory of groups\n(1948)\nand\nMatrices and linear dependence\n(1949)\nwere never published. Before writing her textbook, Griffiths had published a number of excellent reviews of important algebra texts. She reviewed\nIntroduction to the Theory of Groups of Finite Order\nby\nRobert D Carmichael\nin\n1939\n[\n5\n]\n,\nAn Introduction to Abstract Algebra\nby\nCyrus Colton MacDuffee\nin\n1941\n[\n4\n]\n, and\nA Survey of Modern Algebra\nby\nGarrett Birkhoff\nand\nSaunders Mac Lane\nin\n1942\n[\n3\n]\n. In addition she continued her work on polygonal numbers, publishing papers such as:\nUniversal functions of extended polygonal numbers\n(1941)\n;\nUniversal functions of polygonal numbers\n(1942)\n;\nA note on representation by polygonal numbers\n(1942)\n;\nUniversal functions of polygonal numbers. II\n(1944)\n;\nUniversal functions of polygonal numbers. III\n(1945)\n; and\nA note on linear homogeneous Diophantine equations\n(1946)\n.\nGriffiths attended meetings of both the\nAmerican Mathematical Society\nand the\nMathematical Association of America\n. For example, she attended the Fifteenth Summer Meeting of the\nMathematical Association\nin\n1931\nand she delivered the lecture\nUniversal functions of polygonal numbers\nat the meeting of the\nMathematical Association of America\nheld in Chicago on\n1\nSeptember\n1941\n. She attended the\nAmerican Mathematical Society\nmeeting in Chicago in April\n1947\nand delivered the lecture\nLinear homogeneous diophantine equations\non the afternoon of Friday\n26\nApril. She also attended the November meeting of the\nAmerican Mathematical Society\nin Evanston in\n1954\n.\nAs to her hobbies, Griffiths loved walking, gardening and cooking. She\n[\n1\n]\n:-\n... liked classical music and kept notes on what she listened to on the radio.\nShe was honoured with life membership of the Northwestern University Alumni Association in\n1954\n.\nLena Griffiths, Lois Griffiths' mother, came to live with her in Evanston in around\n1945\nand she continued to live with her daughter until her death in\n1956\n. Lois Griffiths retired from her position at Northwestern University in\n1964\nand at that time she was made professor emeritus.",
  "matematicos_citados_na_biografia": [
    "American Mathematical Society",
    "Leonard Dickson",
    "Thomas Arnold Brown",
    "Robert D Carmichael",
    "Cyrus Colton MacDuffee",
    "Garrett Birkhoff",
    "Saunders Mac Lane",
    "Mathematical Association of America",
    "Mathematical Association"
  ],
  "imagens": [
    "griffiths_lois.jpg"
  ]
}