{
  "nome_completo": "Louis Carré",
  "nome_curto": "Louis Carré",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carre/",
  "data_nascimento": "26 July 1663",
  "local_nascimento": "Colfontaine, near Nangis, Brie, France",
  "data_morte": "11 April 1711",
  "local_morte": "Paris, France",
  "summary": "Louis Carré was a French mathematician who published the first French book on the integral calculus.",
  "biografia": "Louis Carré\n's father was a prosperous farmer, and he wanted his son Louis to become a priest. Although we have no information about other members of Carré's family, it would seem that Louis could not have been the eldest son, for at this time the eldest son would be expected to take over running his parents' farm. Louis did not want to take holy orders but, out of respect for his father, he spent three years studying theology in Paris. At the end of this time he refused to take holy orders and this so angered his father that he cut off all financial support for his son.\nBernard de Fontenelle\nwrites\n[\n3\n]\n:-\nQuite often people become priests to escape poverty but Carré preferred to fall into indigence rather than become a priest.\nCarré could not remain at university without the financial support of his father so he was forced to leave and seek employment. However, he was fortunate for he managed to avoid poverty by becoming an amanuensis to the philosopher\nNicolas Malebranche\nwho was professor of mathematics at the Congregation of the Oratory in Paris. In particular, Carré now had a home, living with Malebranche who became his friend as well as his employer. The group which Malebranche had built up at the Oratory in Paris was the leading one in France at the time containing mathematicians such as\nPierre Varignon\n,\nGuillaume De l'Hôpital\nand\nCharles René Reyneau\n. It was in this remarkable atmosphere of learning and scholarship that Carré, who was in many ways a country lad lacking in the ways of sophisticated Paris, was taught mathematics and metaphysics by\nMalebranche\n. He spent seven years as\nMalebranche\n's secretary which gave Carré the equivalent of a university education. He then remained in Paris, becoming a popular teacher giving private lessons. However, he was rather unusual in that the majority of his pupils were women who, unable to obtain a university education, turned to private lessons. Many of his female pupils were nuns. Carré\n[\n1\n]\n:-\n... employed himself in teaching mathematics and philosophy at Paris. In this new employment he had several pupils of the fair sex, for whose talents he seems to have entertained a very uncommon, or rather an extravagant degree of respect, when he estimated female genius as higher than that or the other sex. The language of Carré being rather unpolished and ungrammatical, one of his fair pupils offered to give him lessons in French, in return for his philosophical instructions. Carré cheerfully accepted the offer, and often acknowledged himself greatly indebted to the instructions which he then received.\nAt this stage, Carré seems to have been interested mainly in philosophy and, other than teaching mathematics, did not take much interest in current mathematical research. However, on\n4\nFebruary\n1699\n,\nPierre Varignon\nadmitted him as one of his éleves in the\nAcademy of Sciences\n. This stimulated Carré's interest in mathematics and, from this time on, he began working hard on writing a calculus text. This book was, in particular, devoted to applications of the integral calculus. The book entitled\nUne methode pour Ia mesure des surfaces, la dimension des solides, leurs centres de pesanteur, de percussion et d'oscillation par l'application du calcul intégral\nⓉ\n(\nA method for measuring the area of surfaces, the volume of solids, their centres of gravity, percussion and oscillation by the application of the integral calculus\n)\n, was published in\n1700\n. His Preface to this work begins as follows:-\nNever has Science grown as in the century which we are in, and we can say that we have only made so much progress, especially in mathematics, that we have in all ages except through the studies of the most sublime minds. Also they have brought us to such a degree of perfection, it will require in the future a man of rare and extraordinary genius to make new discoveries. The greatest achievement we have made until now is probably the Differential Calculus, which consists as one knows in descending to quantities with infinitely small differences to discover their nature, and the nature of those variables of which they are differences.\nHowever, the book did contain errors\n(\nmost of which were corrected in a second edition\n)\nand one of these errors is discussed in detail in\n[\n2\n]\n. The formula for the centre of oscillation of a rigid compound pendulum, originally derived by\nHuygens\nin his\nHorologium oscillatorium\nⓉ\n(\nPendulum clocks\n)\n(1673)\n, requires certain integrations to be performed. Early authors of calculus texts discussed the problem and computed the value of the centre of oscillation for several solids. In\nUne methode pour Ia mesure des surfaces\nⓉ\n(\nA method for measuring the area of surfaces\n)\n, the first French textbook on the integral calculus, Carré made a mistake in calculating the integral for the moment of inertia of a cone suspended from its vertex, a mistake that led to an incorrect expression for the centre of oscillation of the cone. This error was only one of several which he made in this book. Although leading mathematicians such as\nJohann Bernoulli\nwere aware of weaknesses in Carré's book, his error was never publicly identified and indeed was carried over into the textbooks\nTreatise on Fluxions, or an Introduction to Mathematical Philosophy\n(1704)\nby Charles Hayes\n(1678\n-\n1760)\n, and\nThe Method of Fluxions, both Direct and Inverse\n(1730)\nby\nEdmund Stone\n. Lenore Feigenbaum explains that the story of Carré's mistake and the subsequent propagation of his error in eighteenth-century calculus textbooks\n[\n2\n]\n:-\n... is instructive in several regards: first, in showing how some of the methods of the calculus were interpreted and absorbed during the early\n18\nth\ncentury; second, in shedding light on the nature of the textbook industry of the time; and finally, in providing us with a modicum of historical sympathy when we find our own students making the same kind of mistakes\nGeorge Campbell translated Carré's book into English as\nMethod for finding the mensuration of surfaces, the dimension of solids, their centres of gravity, percussion and oscillation\nand the manuscript was owned by Robert Venables. It was later bought by\nJohn Thomas Graves\n, professor at University College London, and is now in the library of University College, being bequeathed with the rest of\nGraves\n's library in\n1870\n.\nBetween\n1701\nand\n1705\n, Carré published over a dozen papers on a variety of mathematical and physical subjects:\nMéthode pour la rectification des lignes courbes par les tangentes\nⓉ\n(\nMethod of measuring the lengths of curved lines using tangents\n)\n(1701)\n;\nSolution du problème proposé aux Géomètres dans les mémoires de Trévoux, des mois de Septembre et d'Octobre\nⓉ\n(\nSolution of the problem proposed to geometers in the memories of Trevoux in the months of September and October\n)\n(1701)\n;\nRéflexions ajoutées par M Carré à la Table des Equations\nⓉ\n(\nNotes added by M Carré to the  Table of Equations\n)\n(1701)\n;\nObservation sur la cause de la réfraction de la lumière\nⓉ\n(\nA comment on the cause of refraction of light\n)\n(1702)\n;\nPourquoi les marées vont toujours en augmentant depuis Brest jusqu'à Saint-Malo, et en diminuant le long des côtes de Normandie\nⓉ\n(\nWhy tides are always rising from Brest to Saint-Malo, and decreasing along the coast of Normandy\n)\n(1702)\n;\nNombre et noms des instruments de musique\nⓉ\n(\nThe number and names of musical instruments\n)\n(1702)\n;\nObservations sur la vinaigre qui fait rouler de petites pierres sur un plan incline\nⓉ\n(\nObservations on the forcce that makes small stones roll on an inclined plane\n)\n(1703)\n;\nObservation sur la rectification des caustiques par réflexions formées par le cercle, la cycloïde ordinaire, et la parabole, et de leurs développées, avec la mesure des espaces qu'elle renferment\nⓉ\n(\nAn observation on rectification by caustic reflections formed by the circle, the ordinary cycloid, and the parabola, and their developed, with the measure spaces that they contain\n)\n(1703)\n;\nMéthode pour la rectification des courbes\nⓉ\n(\nA method for the rectification of curves\n)\n(1704)\n;\nObservation sur ce qui produit le son\nⓉ\n(\nObservation of what produces sound\n)\n(1704)\n;\nExamen d'une courbe formée par le moyen du cercle\nⓉ\n(\nReview of a curve formed by means of the circle\n)\n(1705)\n;\nExpériences physiques sur la réfraction des balles de mousquet dans l'eau, et sur la résistance de ce fluide\nⓉ\n(\nPhysical experiments on the refraction of musket balls in the water and on the resistance of the fluid\n)\n(1705)\n; and\nProblème d'hydrodynamique sur la proportion des tuyaux pour avoir une quantité d'eau déterminée\nⓉ\n(\nHydrodynamic problem on the proportion of  pipes for a given amount of water\n)\n.\n(1705)\nThis level of activity led to him being admitted to the\nAcademy of Sciences\nas an Associate Mechanician on\n15\nFebruary\n1702\nand being promoted to Pensioner on\n18\nAugust\n1706\n. This provided him with an income which allowed him to devote himself entirely to his academic studies during the final five years of his life. At age\n46\nhe suffered an attack of dyspepsia from which he died in\n1711\n.",
  "matematicos_citados_na_biografia": [
    "Bernard de Fontenelle",
    "Nicolas Malebranche",
    "Pierre Varignon",
    "Guillaume De l'Hôpital",
    "Charles René Reyneau",
    "Malebranche",
    "Academy of Sciences",
    "Huygens",
    "Johann Bernoulli",
    "Edmund Stone",
    "John Thomas Graves",
    "Graves"
  ],
  "imagens": []
}