{
  "nome_completo": "Louis Bachelier",
  "nome_curto": "Louis Bachelier",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bachelier/",
  "data_nascimento": "11 March 1870",
  "local_nascimento": "Le Havre, France",
  "data_morte": "26 April 1946",
  "local_morte": "St-Servan-sur-Mer, France",
  "summary": "Louis Bachelier was a French mathematician who is credited with being the first person to model the stochastic process now called Brownian motion.",
  "biografia": "Nul n'est prophete en son pays ...\n.\nThe French mathematician,\nLouis Bachelier\nis now recognised internationally as the father of financial mathematics, but this fame, which he so justly deserved, was a long time coming. The Bachelier Society, named in his honour, is the world-wide financial mathematics society and mathematical finance is now a scientific discipline of its own. The Society held its first World Congress on\n2000\nin Paris on the hundredth anniversary of Bachelier's celebrated PhD Thesis\nThéorie de la Spéculation\nⓉ\n(\nTheory of speculation\n)\n[\n24\n]\n.\nFive years before\nEinstein\n's famous\n1905\npaper\n[\n4\n]\non\nBrownian Motion\n, in which\nEinstein\nderived the equation\n(\nthe partial differential heat/diffusion equation of\nFourier\n)\ngoverning Brownian motion and made an estimate for the size of molecules, Bachelier had worked out, for his Thesis, the distribution function for what is now known as the\nWiener\nstochastic process\n(\nthe stochastic process that underlies Brownian Motion\n)\nlinking it mathematically with the diffusion equation. The probabilist\nWilliam Feller\nhad originally called it the Bachelier-\nWiener\nProcess. It appears that\nEinstein\nin\n1905\nwas ignorant of the work of Bachelier.\nSeventy three years before Black and Scholes wrote their famous paper in\n1973\n[\n5\n]\n, Bachelier had derived the price of an option where the share price movement is modelled by a\nWiener\nprocess and derived the price of what is now called a barrier option\n(\nnamely the option which depends on whether the share price crosses a barrier\n)\n. Black and Scholes, following the ideas of Osborne and Samuelson, modelled the share price as a stochastic process known as a Geometric Brownian Motion\n(\nwith drift\n)\n.\nLouis Bachelier was born in Le Havre in\n1870\n. After education at secondary school in Caen he lost both his parents and had to enter the family business. It was during this period that he seems to have become familiar with the workings of financial markets.\nAt the age of\n22\n, Bachelier arrived in Paris at the Sorbonne where he followed the lectures of\nPaul Appell\n. Joseph Boussinesq and\nHenri Poincaré\n(\nthe latter being then aged\n38)\n. After some\n8\nyears, in\n1900\n, Bachelier defended his thesis\nThéorie de la Spéculation\nⓉ\n(\nTheory of speculation\n)\nbefore these three men, the favourable report being written by no less a figure than\nHenri Poincaré\n, one of the most eminent mathematicians in the world at the time.\nQuite what his employment was between\n1900\nand\n1914\n(\nwhen he was drafted into the French Army during the First World War\n)\nis not known. It is known, however, that he received occasional scholarships to continue his studies\n(\non the recommendation of\nÉmile Borel\n(1871\n-\n1956))\nand he gave lectures as a 'free professor' at the Sorbonne between\n1909\nand\n1914\n. One of his courses was\nProbability calculus with applications to financial operations and analogies with certain questions from physics\n. In this course he may have drawn out the similarities between the diffusion of probability\n(\nthe total probability of one being conserved\n)\nand the diffusion equation of Fourier\n(\nthe total heat-energy being conserved\n)\n. In\n1912\nhe wrote a book\nCalcul des Probabilités\nⓉ\n(\nProbability theory\n)\nand in\n1914\na book\nLe Jeu, la Chance et le Hazard\nⓉ\n(\nGames, luck and chance\n)\n. At the end of the War he obtained an academic position\n(\nlecturer\n)\nat Besançon then moved to Dijon\n(1922)\n, then to Rennes\n(1925)\n.\nIn\n1926\nhe tried to go back to Dijon by applying for the vacant chair but was turned down on account of a critical report from\nPaul Lévy\n(1886\n-\n1971)\n, then a professor aged\n40\nat the École Polytechnique.\nBachelier in his Thesis, in progressing from a 'drunkards' random walk with\nn\nn\nn\n(\ndiscrete\n)\nsteps in time\nt\nt\nt\n, each step being of length\nd\nd\nd\n, to a\n(\ncontinuous\n)\ndistribution for where the drunkard might be at time\nt\nt\nt\n, realised that there had to be a relationship between\nn\nn\nn\nand\nd\n−\nd\nd - d\nd\n−\nd\nequal to\n(\nt\nn\n)\n1\n/\n2\n(\\Large\\frac{t}{n}\\normalsize )^{1/2}\n(\nn\nt\n​\n)\n1\n/\n2\nfor the limit process to 'work'.\nIn a later paper\n[\n38\n]\nhe showed, effectively, that if a random walk on the\ny\ny\ny\n-axis is represented as a graph in time with the 'drunkard' making\nn\nn\nn\nsteps in time\nt\nt\nt\n, each step of length\nd\nd\nd\n, the path was such that the tangent of the path angle {i.e.\nd\nd\nd\ndivided by\nt\nn\n\\Large\\frac{t}{n}\\normalsize\nn\nt\n​\n} became increasingly large {in the ratio\n(\nn\nt\n)\n1\n/\n2\n(\\Large\\frac{n}{t}\\normalsize  )^{1/2}\n(\nt\nn\n​\n)\n1\n/\n2\n} as\nn\nn\nn\nincreased. The paths in the time-graph got more and more vertical\n(\nup or down\n)\nwith increasing\nn\nn\nn\nbut the resulting distribution of where the drunkard might be became increasingly regular.\nPaul Levy\nthought that Bachelier had made a mistake in his paper by making the tangent of the path\n(\nup or down\n)\nconstant and Bachelier failed to be appointed at Dijon. Bachelier was furious and wrote to\nLevy\n, who, apparently, was unrepentant over this calumny.\nThe algebraic sum of the upwards and downwards steps taken by the drunkard gives the height of the drunkard at time\nt\nt\nt\nabove the origin while the sum of the squares of the steps is equal to\nt\nt\nt\nand the algebraic and absolute sum of the cubes of the upward and downward steps\n(\nand higher powers\n)\nbecome closer and closer to zero. It is these properties of continuity, non-differentiability, infinite\n1\nst\norder variation, finite\n2\nnd\norder variation and zero\n3\nrd\nor higher order variation that gives the drunkard's walk and, in the limit, Brownian Motion some of its unique character and leads to\nItô\n's important Lemma.\nIt seems extraordinary that\nLevy\nwas, apparently, unfamiliar with Bachelier's work as Bachelier had by this time\n(1926)\npublished\n3\nbooks and some\n13\npapers on probability and regarded showing how a continuous distribution could be derived from a discrete distribution as his most important achievement.\nLevy\nonce told\nJ L Doob\nthat \"reading other writers' mathematics gave him physical pain\"\n(\nsee website below\n)\nso perhaps it was the case that\nLevy\nhad never read Bachelier.\nBorel\n, however, must have known Bachelier\n(\nhe had approved the scholarships to Bachelier\n)\n. It should be pointed out that\nPoincaré\n, who would not have made this mistake over the interpretation of Bachelier's work, had died some\n14\nyears earlier.\nIt seems that Bachelier, was regarded as being of lesser importance in the eyes of the French mathematical élite\n(\nHadamard\n,\nBorel\n,\nLebesgue\n,\nLévy\n,\nBaire\n)\n. His mathematics was not rigorous\n(\nit could not be as the mathematical techniques necessary to make it so had not been developed e.g. measure theory and axiomatic probability\n)\nalthough, his results were basically correct.\nHowever,\nLevy\n, a few years later, was apparently surprised to find\nKolmogorov\nreferring to Bachelier's work. In\n1931\n,\nLevy\nwrote a letter of apology to Bachelier and they were reconciled.\nBachelier moved back to Besançon\n(\nthis time as permanent professor\n)\nin\n1927\nand retired aged\n67\nin\n1937\n. His last publication was in\n1941\nand he died in\n1946\naged\n76\n.\nBachelier's work is remarkable for herein lie the theory of Brownian Motion\n(\none of the most important mathematical discoveries of the\n20\nth\ncentury\n)\n, the connection between random walks and diffusion, diffusion of probability, curves lacking tangents\n(\nnon-differentiable functions\n)\n, the distribution of the\nWiener\nprocess and of the maximum value attained in a given time by a\nWiener\nprocess, the reflection principle, the pricing of options including barrier options, the\nChapman\n-\nKolmogorov\nequations in the continuous case,\n(\nnamely\nf\n(\nx\nn\n∣\nx\ns\n)\n=\n∫\n−\n∞\n∞\nf\n(\nx\nn\n∣\nx\nr\n)\nf\n(\nx\nr\n∣\nx\ns\n)\nd\nx\nr\nf (x_{n} | x_{s}) = \\int _{-∞}^{∞} f (x_{n} | x_{r}) f (x_{r} | x_{s}) dx_{r}\nf\n(\nx\nn\n​\n∣\nx\ns\n​\n)\n=\n∫\n−\n∞\n∞\n​\nf\n(\nx\nn\n​\n∣\nx\nr\n​\n)\nf\n(\nx\nr\n​\n∣\nx\ns\n​\n)\nd\nx\nr\n​\nwhere\nn\n>\nr\n>\ns\nn > r > s\nn\n>\nr\n>\ns\nwhere\nf\nf\nf\nare the transition densities of a\nMarkov\nsequence of random variables\n)\nand the seeds of\nMarkov\nProcesses, weak convergence of random variables\n(\ni.e. convergence in distribution\n)\n,\nmartingales\nand\nItô\nstochastic calculus.\nBachelier's treatment and understanding of the theory of Brownian Motion\n(\noriginally called Brownian Movement\n)\nis more elegant and mathematical than in\nEinstein\n's\n1905\npaper. While\nEinstein\nhad an unsurpassed 'nose' for physics his nose for mathematics was, by his own admission, not so highly developed.\nThe work of Bachelier leads on to the work of\nWiener\n(1923)\n,\nKolmogorov\n(1931)\n,\nItô\n(1950)\n, and Black, Scholes and Merton\n(1973)\n.\nBachelier was ahead of his time and his work was not appreciated in his lifetime. In the light of the enormous importance of international derivative exchanges\n(\nwhere the pricing is determined by financial mathematics\n)\nthe remarkable pioneering work of Bachelier can now be appreciated in its proper context and Bachelier can now be given his proper place.",
  "matematicos_citados_na_biografia": [
    "Einstein",
    "Brownian Motion",
    "Fourier",
    "Wiener",
    "William Feller",
    "Paul Appell",
    "Henri Poincaré",
    "Émile Borel",
    "Paul Lévy",
    "Paul Levy",
    "Levy",
    "Itô",
    "J L Doob",
    "Borel",
    "Poincaré",
    "Hadamard",
    "Lebesgue",
    "Lévy",
    "Baire",
    "Kolmogorov",
    "Chapman",
    "Markov",
    "martingales"
  ],
  "imagens": [
    "bachelier.jpg"
  ]
}