{
  "nome_completo": "Luigi Fantappiè",
  "nome_curto": "Luigi Fantappiè",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fantappie/",
  "data_nascimento": "15 September 1901",
  "local_nascimento": "Viterbo, Italy",
  "data_morte": "28 July 1956",
  "local_morte": "Bagnaia, near Viterbo, Italy",
  "summary": "Luigi Fantappiè was an Italian mathematician who worked in mathematical analysis and created the theory of analytic functionals.",
  "biografia": "Luigi Fantappiè\nwas born in the town of Viterbo in central Italy, northwest of Rome. His parents were Liberto Fantappiè and Agrippina Gnazza. He studied at the Scuola Normale Superiore in Pisa, entering in\n1918\nafter sitting the competitive entrance examination. He became a friend of\nEnrico Fermi\nwho was almost exactly the same age\n(\nFantappiè was exactly two weeks older than\nFermi\n)\n. Fantappiè graduated with a doctorate on\n4\nJuly\n1922\nhaving attained full marks in the pure mathematics examinations. His dissertation, supervised by\nLuigi Bianchi\n, was\nLe forme decomponibili coordinate alle classi di ideali nei corpi algebrici\nⓉ\n(\nForm of decomposable coordinates in the classes of ideals in algebraic fields\n)\n. After spending the years\n1922\n-\n24\nstudying at various universities abroad, he was an assistant to\nFrancesco Severi\nin Rome before giving the analysis course at the University of Cagliari. He was\nappointed to the Chair of Algebraic Analysis in the University of Florence in\n1926\nthen, in the following year, he moved to Palermo when appointed to the Chair of Infinitesimal Analysis at the University there.\nHe published\nLe énième nombre premier comme valeur asymptotique d'une fonction déduite de la fonction ζ\n(\ns\n)\nde Riemann\nⓉ\n(\nThe nth prime number as asymptotic value of a function derived from Riemann's zeta function\n)\n(1925)\nand then in the\n1930\ns he published papers on analytic functionals of analytic functions of a single variable. This work was based on the idea of a functional which had been introduced by\nVito Volterra\n. What Fantappiè did was take the theory which had been developed for analytical functions and generalise this theory to the case of functionals. This led to what Fantappiè called analytic functionals, and he developed this theory over almost twenty years through the\n1920\ns and\n1930\ns. He published\nNuovi fondamenti della teoria dei funzionali analitici\nⓉ\n(\nNew foundations of the analytical functional theory\n)\nin\n1942\nwhich extended some of his earlier results on analytic functionals of analytic functions of a single variable to analytic functionals of analytic functions of\nn\nn\nn\nvariables. Then in\n1943\nhe published the monograph\nTeoría de los Funcionales Analíticos y sus Aplicaciones\nⓉ\n(\nAnalytical functional theory and applications\n)\nwhich was reviewed by F J Murray:-\nThis memoir presents a study of the functionals on a space of analytic functions, topologized by a\nHausdorff\ntopology in which neighborhoods are set up in terms of the maximum difference of functions on regions. ... Linear functionals are studied ... Bilinear functionals are also introduced. The next step is the consideration of nonlinear analytic functionals in general. For these the author establishes the usual concepts of the differential calculus such as the derivative, with the customary properties and rules and the series expansion of such a function. The corresponding questions for functions of more than one variable are also considered but the results are not as complete. However, these results contain a\nCauchy\nintegral formula for the many-variable case, which permits an operational calculus of a somewhat restricted sort. As an application the\nCauchy\ntheory of partial differential equations is considered. In certain cases, the\nCauchy\nproblem is solved. The geometrical significance in abstract spaces of such notions as characteristic strips and singular solutions is given. A similar discussion of the notions of hyperbolic, parabolic and elliptic partial differential equations which pertain to the case of two independent variables also appears.\nFantappiè's work on analytic functionals had led to him receiving a number of awards. For example the Italian Society for Sciences awarded him their Gold Medal in Mathematics in\n1929\n, while two years later he received the\nAccademia dei Lincei\n's Royal Prize in Mathematics and the Volta Prize from the\nNational Academy of Sciences of Italy\n. In\n1933\nFantappiè left Italy and went to the University of Sao Paulo in Brazil where he founded the Mathematics Department and was head of the new department from\n1933\nto\n1939\n. He returned to Italy at the outbreak of World War II in\n1939\nwhen he was offered the Chair of Higher Analysis in the University of Rome, a position he held for the rest of his life.\nAlthough Fantappiè continued to undertake research on analytic functionals, he began to study a new area in\n1941\n. Let us quote his own words regarding his new idea of syntropy which is dual to the concept of entropy\n[\n5\n]\n:-\nI have no doubts about the date when I discovered the law of syntropy. It was in the days just before Christmas\n1941\n, when, as a consequence of conversations with two colleagues, a physicist and a biologist, I was suddenly projected in a new panorama, which radically changed the vision of science and of the Universe which I had inherited from my teachers, and which I had always considered the strong and certain ground on which to base my scientific investigations. Suddenly I saw the possibility of interpreting a wide range of solutions\n(\nthe anticipated potentials\n)\nof the wave equation which can be considered the fundamental law of the Universe. These solutions had been always rejected as \"impossible\", but suddenly they appeared \"possible\", and they explained a new category of phenomena which I later named \"syntropic\", totally different from the entropic ones, of the mechanical, physical and chemical laws, which obey only the principle of classical causation and the law of entropy. Syntropic phenomena, which are instead represented by those strange solutions of the \"anticipated potentials\", should obey two opposite principles of finality\n(\nmoved by a final cause placed in the future, and not by a cause which is placed in the past\n)\n: differentiation and non-causable in a laboratory. This last characteristic explained why this type of phenomena had never been reproduced in a laboratory, and its finalistic properties justified the refusal among scientists, who accepted without any doubt the assumption that finalism is a \"metaphysical\" principle, outside Science and Nature. This assumption obstructed the way to a calm investigation of the real existence of this second type of phenomena; an investigation which I accepted to carry out, even though I felt as if I were falling in a abyss, with incredible consequences and conclusions. It suddenly seemed as if the sky were falling apart, or at least the certainties on which mechanical science had based its assumptions. It appeared to me clear that these \"syntropic\", finalistic phenomena which lead to differentiation and could not be reproduced in a laboratory, were real, and existed in nature, as I could recognize them in the living systems. The properties of this new law, opened consequences which were just incredible and which could deeply change the biological, medical, psychological, and social sciences.\nOn\n30\nOctober\n1942\nFantappiè presented his theory of syntropy to the Accademia d'Italia with a work entitled\nThe Unified Theory of the Physical and Biological World\n(\npublished in Spanish in\n1943)\n. His finding were that syntropic phenomena invert the second law of thermodynamics and\n[\n3\n]\n:-\na reduction in entropy and an increase in differentiation is observed\n;\nconverging waves attract in smaller places energy and matter\n;\nconcentration of matter and energy cannot be indefinite and entropic processes are needed to compensate syntropic concentration\n;\nin nature, syntropy and entropy interact constantly\n;\nscientific finalism, final causes, are introduced\n;\na new scientific methodology is needed since the experimental method can only study causes located in the past\n.\nFantappiè ended this work by stating how he believed syntropy was the essence of life\n[\n3\n]\n:-\nLet us conclude by looking at what we can say about life. What makes life different is the presence of syntropic qualities: finalities, goals, and attractors. Now as we consider causality the essence of the entropic world, it is natural to consider finality the essence of the syntropic world. It is therefore possible to say that the essence of life are final causes, syntropy. Living means tending to attractors ... the law of life is not the law of mechanical causes; this is the law of non-life, the law of death, the law of entropy; the law which dominates life is the law of finalities, the law of syntropy.\nThere was another major idea introduced by Fantappiè, namely a cosmological theory based on a geometry arising from a group which, in some sense, generalises the\nLorentz\ngroup. For example in\nDeduzione autonoma dell'equazione generalizzata di Schrödinger, nella teoria di relatività finale\nⓉ\n(\nAutonomous deductions from the generalized Schrödinger equation, in the final theory of relativity\n)\n(1955)\nFantappiè deduces the\nKlein\n-\nGordan\nequation in quantum mechanics as a limit, as the radius of the universe tends to infinity, of a classical\n(\nnon-quantized\n)\nequation in his extension of relativity based on a simple\n(\npseudo-orthogonal\n)\ngroup having the\nLorentz\ngroup as a type of limit. Fantappiè was still working on this theory at the time of his death in\n1956\nat the age of only\n54\nyears. The manuscript he left was edited by G Arcidiacono, M Carafa and D Del Pasqua and published as the sixty-page paper\nSui fondamentali gruppali della fisica\nⓉ\n(\nOn the fundamental groups of physics\n)\nin\n1959\n.\nFinally let us look briefly at some of the papers which Fantappiè published in the last seven years of his life:\nCostruzione effettiva di prodotti funzionali relativisticamente invarianti\nⓉ\n(\nConstruction of relativistic invariant products of functions\n)\n(1949)\nconstructs functional scalar products of two functions, as required in quantum mechanics, which are relativistically invariant;\nCaratterizzazione analitica delle grandezze della meccanica quantica\nⓉ\n(\nAnalytical characterization of the quantum mechanical magnitudes\n)\n(1952)\ngives conditions on an hermitian operator that he claims are necessary and sufficient for it to satisfy to represent a physically real observable;\nDeterminazione di tutte le grandezze fisiche possibili in un universo quantico\nⓉ\n(\nDetermination of all possible physical quantities in a quantum universe\n)\n(1952)\ndiscusses aspects of group invariance of wave equations;\nGli operatori funzionali vettoriali e tensoriali, covarianti rispetto a un gruppo qualunque\nⓉ\n(\nVector functional operators and tensor, covariant with respect to any group\n)\n(1953)\ndiscusses the role of operators and\nLie\ngroups in a quantum-mechanical universe;\nDeduzione della legge di gravitazione di Newton dalle proprietà del gruppo di Galilei\nⓉ\n(\nDeduction of Newton's law of gravitation from properties of the Galileo group\n)\n(1955)\nshows that the inverse square law is a necessary consequence if certain specific assumptions are made;\nLes nouvelles méthodes d'intégration, en termes finis, des équations aux dérivées partielles\nⓉ\n(\nNew integration methods, in finite terms of partial differential equations\n)\n(1955)\napplies analytic functionals to find explicit solutions of partial differential equations; and\nSur les méthodes nouvelles d'intégration des équations aux dérivées partielles au moyen des fonctionnelles analytiques\nⓉ\n(\nOn new methods of integration of partial differential equations using analytical functionals\n)\n(1956)\ngives a new method for the solution of\nCauchy\n's problem.\nTo honour Fantappiè, a congress entitled\nFrontiers of Biology and Contemporary Physics\nwas held in his home town of Viterbo from\n13\nto\n16\nAugust\n2009\n.",
  "matematicos_citados_na_biografia": [
    "Enrico Fermi",
    "Fermi",
    "Luigi Bianchi",
    "Francesco Severi",
    "Vito Volterra",
    "Hausdorff",
    "Cauchy",
    "Accademia dei Lincei",
    "National Academy of Sciences of Italy",
    "Lorentz",
    "Klein",
    "Gordan",
    "Lie"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}