{
  "nome_completo": "Magdalena Araceli Mouján Otaño",
  "nome_curto": "Magdalena Mouján",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moujan/",
  "data_nascimento": "26 March 1926",
  "local_nascimento": "Pehuajó, Argentina",
  "data_morte": "16 July 2005",
  "local_morte": "Mar del Plata, Argentina",
  "summary": "Magdalena Mouján was an Argentine mathematician who became famed as a writer of science fiction. She taught mathematics and statistics at various Argentine universities: Universidad Católica de la Plata, Universidad Nacional de Córdoba, Universidad Nacional del Comahue, and Universidad Nacional de Luján.",
  "biografia": "Magdalena Mouján\nwas the daughter of Armando Mouján and María Teresa Otaño Alberdi\n(1899\n-\n1989)\n. Teresa was the daughter of Pedro María Otaño Barriola\n(1857\n-\n1910)\nand his wife María Magdalena Alberdi Descarga\n(1863\n-\n1934)\n. Pedro María Otaño Barriola was a famous Basque poet whose four sons, Bernardo Otaño Alberdi\n(1892\n-\n1959)\n, Bernardo Otaño Alberdi\n(1892\n-\n1959)\n, Juan Miguel Otaño Alberdi\n(1894\n-\n1946)\nand José Ignacio Otaño Alberdi\n(1896\n-\n1982)\nwere all born in Spain before the family emigrated to Argentina in\n1898\n. María Teresa Otaño Alberdi, the mother of Magdalena, was born in Pehuajó, Argentina, on\n20\nSeptember\n1899\n. The town of Pehuajó was proud of its literary figures with the streets and squares name for poets and writers.\nMagdalena Mouján, the subject of this biography, was born in Pehuajó sixteen years after the death of her grandfather, but she would become very influenced by his poetry and his Basque roots.\nMagdalena was given the nicknamed \"beltxa\" at home. This is the Basque word for \"black\". In fact her mother taught her the Basque language when she was a child so she grew up being bilingual in Basque and Spanish. She attended primary and secondary school in Pehuajó which is a city in the province of Buenos Aires about\n470\nkm south west of the city of Buenos Aires. After graduating from High School, she entered the National University of La Plata. This university, in the town of La Plata which is on the coast south of Buenos Aires, began operating in\n1897\nbecoming a national university in\n1905\n.\nAt the National University of La Plata, Mouján was fortunate to be taught by\nManuel Sadosky\nand\nLuís Antoni Santaló\n.\nManuel Sadosky\nwas an Assistant in the Department of Mathematics in the Faculty of Physico-mathematical Sciences of the National University of La Plata and was in charge of the practical courses Higher Mathematics I and II\n(\ndifferential equations and analytical functions\n)\n.\nLuís Santaló\nwas a leading Spanish mathematician who had left Spain for political reasons due to the Spanish Civil War. After a short stay in France, he took the advice of\nJulio Rey Pastor\nand went to Argentina in\n1939\n. There he served as a professor in the National University of the Littoral, the National University of La Plata and the University of Buenos Aires. Mouján was also friendly with her talented fellow student\nRebeca Cherep\n(\nbetter known as\nRebeca Guber\nafter her marriage to José Guber who was an engineering student at the National University of La Plata while Mouján was studying there\n)\n. After her first degree Mouján continued to undertake research in mathematical physics for a Ph.D. and she was awarded the degree in\n1950\n. She then taught mathematics, did some research in mathematics, and wrote some popular articles for the magazine\nMundo Atómico\nⓉ\n(\nAtomic world\n)\nbetween the years\n1952\nand\n1955\n. This magazine, published between\n1950\nand\n1955\n, contained articles on scientific topics such as mathematics, astronomy, health, and physics. Here are examples of her papers in\nMundo Atómico\nⓉ\n(\nAtomic world\n)\n:\nElectrodinámica clásica según J Wheeler y R Feynman\nⓉ\n(\nClassical electrodynamics according to J Wheeler and R Feynman\n)\n(1952)\n,\nDetectores fabricados en el país\nⓉ\n(\nDetectors manufactured in the country\n)\n(1952)\n,\nLa teoría de grupos y sus aplicaciones en mecánica cuántica\nⓉ\n(\nGroup theory and its applications in quantum mechanics\n)\n(1952)\n,\nCausalidad y azar en Física, según Max Born\nⓉ\n(\nCausality and chance in physics, according to Max Born\n)\n(1953)\n,\nEl isomorfismo de Hermann Weyl\nⓉ\n(\nThe Hermann Weyl isomorphism\n)\n(1953)\n,\nIdeas sobre la realidad presentes en la física actual\nⓉ\n(\nIdeas about reality present in current physics\n)\n(1953)\n,\nLógica y física cuántica\nⓉ\n(\nLogic and quantum physics\n)\n(1955)\n,\nAlberto Einstein\n(1955)\n. We note that Luís Santaló was also a regular contributor to\nMundo Atómico\nⓉ\n(\nAtomic world\n)\n.\nJuan Perón had been elected president of Argentina in\n1946\n. He introduced reforms so that universities lost their autonomy and only his supporters could hold university posts. He supported\nMundo Atómico\nⓉ\n(\nAtomic world\n)\nand in fact contributed several articles to it himself. In\n1955\nthere was a coup that ousted Perón. He had begun to lose the support of the military and, after a failed coup in June\n1955\n, another in September\n1955\nsucceeded and Perón fled to exile in Spain. Although there was an unstable political situation over the following years, the universities regained their autonomy in\n1956\n. The new government saw\nMundo Atómico\nⓉ\n(\nAtomic world\n)\nas supported by Perón so it was closed down.\nAgustín Durañona y Vedia\n(1904\n-\n1980)\nwas an Argentine mathematician who had graduated from the National University of La Plata in\n1927\nand then undertaken post-doctoral work at the universities of Berlin and Göttingen. At this time he worked on pure mathematics and published papers in\n1926\nsuch as\nSobre producto de series sumables Borel\nⓉ\n(\nOn the product of Borel summable series\n)\nand\nUna demostración de un teorema de Lebesgue del cálculo integral\nⓉ\n(\nA proof of a Lebesgue theorem of integral calculus\n)\n. In\n1947\nhe was appointed a full member of the National Academy of Exact, Physical and Natural Sciences of Buenos Aires. Like Mouján, Durañona y Vedia published in\nMundo Atómico\nⓉ\n(\nAtomic world\n)\n. His articles include:\nDonde se trata de matemáticas y matemáticos\nⓉ\n(\nWhere it deals with mathematics and mathematicians\n)\n(1951)\n,\nCiencia y metafísica\nⓉ\n(\nScience and metaphysics\n)\n(1952)\n,\nLa lógica cuántica\nⓉ\n(\nQuantum logic\n)\n(1953)\n,\nHenri Poincaré - Centenario de su nacimiento\nⓉ\n(\nHenri Poincaré - centenary of his birth\n)\n(1955)\n.\nIt was around\n1957\nthat Durañona y Vedia became interested in applying mathematics to real life problems and he developed methods in operations research. He thought that his best route for support was through the armed forces and, beginning in\n1957\n, gave a course at the Higher Technical School of the Army. He made a proposal to the Board of Scientific Research and Experimentation of the Armed Forces to set up an \"Operations Research Group\", which he would lead himself, and he proposed that it be composed of three other members: Magdalena Mouján Otaño, Horacio C Reggini, a structural engineer, and Isidoro Marín, a civil engineer. The Operations Research Group began its activities on\n1\nDecember\n1957\n. Also in\n1957\nDurañona y Vedia and Mouján Otaño had produced a publication for the National Atomic Energy Commission entitled \"Operations Research\". They write that their aim is:-\n... to highlight the importance of the discipline in the management of companies of the most diverse nature.\nAfter Perón was ousted by a coup in\n1955\na freedom of education act was brought in which allowed the creation of private universities. In\n1956\n, the bishops of Argentina decided to create the Catholic University of Argentina and it was formally founded on\n7\nMarch\n1958\n. Mouján was involved in the establishment of the Faculty of Physical, Mathematical and Engineering Sciences in the Catholic University of Argentina and, at the end of\n1959\n, was appointed as a full professor in the Faculty. Agustín Durañona y Vedia became the first dean of that Faculty.\nIn\n1961\nMouján became a member of the Argentine Atomic Energy Commission. She then was able to use Clementina, the first computer to be installed in Argentina, to numerically solve two problems involving systems of differential equations. Clementina, a Ferranti Mercury computer so called because it had been programmed to play the song\nOh My Darling, Clementine\n, was installed in the Computational Institute of the University of Buenos Aires and began operating on\n15\nMay\n1961\n. Mouján knew most of the members of the team running Clementina which was headed by\nManuel Sadosky\n.\nRebeca Guber\nand\nCecilia Berdichevsky\n. The Argentine Atomic Energy Commission was working on the RA-\n1\nreactor, the first reactor to start up in all of Latin America and the southern hemisphere. Mouján was brought on to the team to strengthen it but before starting work on this project, she had to take courses on the theories of radiochemistry, electronics and reactors.\nArturo Illia had become President of Argentina following elections in June\n1963\n. He tried to split the Perónists, who controlled the unions, from their exiled leader Perón. The Perónists reacted by supporting a coup against President Arturo Illia in June\n1966\nand General Juan Carlos Onganía, the commander in chief of the army, took control of the country. Mouján did not support General Onganía and had to resign her university position. After a few years she returned to university teaching but from this time on she also became a science fiction writer. She wrote under the pseudonym Inge Matquim and soon achieved fame winning joint first prize at the major Argentine Science Fiction Convention Mardelcon held in Mar Del Plata. It was held between\n26\nand\n28\nJuly\n1968\nand Mouján was joint winner of the story contest with\nLos Huáqueros\nⓉ\n(\nThe grave robbers\n)\n.\nOne can see by looking at the references that we give for this biography of Mouján that she is better known as a writer of science fiction than she is as a mathematician. This probably would not be the case but for her article\nGu ta Gutarrak\nⓉ\n(\nUs and ours\n)\n. This is\n[\n12\n]\n:-\n... the story told of the origin of the Basque people as the result of a paradoxical travelling in time by a group including a present-day Basque scientist - among whom was the authoress, of course, resolving by chance the mystery that at present still veils this people and their language.\nMouján wrote the article in\n1968\n; it was inspired by a poem with the same name written by her grandfather Pedro María Otaño Barriola in\n1899\n. She submitted it to the Spanish magazine\nNueva Dimensión\nⓉ\n(\nNew dimension\n)\nand it was accepted in\n1970\n. Publication, however, was stopped by President Franco's regime with the Court of Public Order ordering the magazine be withdrawn from the market. They argued that the content of the story jeopardised the unity of Spain. Domingo Santo writes in\n[\n13\n]\n:-\nFrom there, pandemonium broke out. In the United States, Donald A Wollheim, owner of DAW Books and one of the most influential personalities in the field of science fiction in his country, as soon as he heard the news, mobilised all the science fiction fan clubs and mobilised the fandom to send strong letters of protest to the Spanish embassy in the United States for this \"unacceptable attack on freedom of expression.\" Harlan Ellison, who since the beginning of 'Nueva Dimensión' had given us his most enthusiastic support and collaboration, and who at that time collaborated assiduously with a series of national television networks, as soon as he knew what had happened he told us that he was going to prepare a whole series of special programmes on \"the oppression of intellectual freedom in that beloved country.\" The author herself sent to the Ministry of Information and Tourism an extensive curriculum vitae of hers in which she demonstrated without a doubt that her personal status, scientific and intellectual, was far beyond and far above separatism and attacks.\nLet us quote a little from\nGu ta Gutarrak\nⓉ\n(\nUs and ours\n)\n[\n11\n]\n:-\nThe Baskos\n(\nit is not an error, it is the correct spelling\n)\nwe have nothing racist. We are not a race, but a species. A species that, when mixed with the other, continues to result in pure baskos. ... It is known that when we do not like a government, we emigrate. In general, violence displeases us, we are peaceful people, enemies of killing, especially if it is not with a bare hand. Generally those of us who emigrate go to the Americas. That has been my case, and Jainkoa\n(\nor Jaungoikoa, the Lord who is up there\n)\nhas punished me for wanting to be so rich, since I have always been alone. Because you have to see that the Baskos born here are different. It must be the abundance of flat and fertile land, the Basko is from the mountains, that's why many Baskos here have degenerated into ranchers, and later into well-to-do children, people without the virtues of the race.\nMarta Macho Stadler, who has a doctorate in mathematics, tells us that Mouján puts quite a lot of science into her story\n[\n16\n]\n:-\nIn this funny story, one of the protagonist's sons - Xaviertxo, who is gifted - becomes a physicist to \"study the structure of the space-time continuum.\" His knowledge allows him to build a time machine - baptised as 'Pimpilimpausa'\n(\nbutterfly, in Basque\n)\n- with the help of his little sister - Malentxo - who invents a new logic, one necessary to avoid paradoxes produced by the jumps in time. This machine represents \"... the great revolution in physics, something much more important than relativity, and than quantum theory and than the atomic bomb ...\".\nGu ta Gutarrak\nⓉ\n(\nUs and ours\n)\nwas replaced in\nNueva Dimensión\nNo\n14\nby the comic 'Formicology' and the issue was reprinted. Although the Court of Public Order threatened to bring\nNueva Dimensión\nto trial over their attempt to publish, in fact no trial ever took place. Subsequently, Nueva Dimensión published two other stories by Mouján:\nBicho'e parra en orbit\nⓉ\n(\nBicho'e parra in orbit\n)\n(\nNueva Dimensión\nⓉ\n(\nNew dimension\n)\n18)\nand\nEl lagarto rojo\nⓉ\n(\nThe red lizard\n)\n(\nNueva Dimensión\nⓉ\n(\nNew dimension\n)\n101)\n. Following Franco's death in\n1975\nit was thought possible to publish\nGu ta Gutarrak\nⓉ\n(\nUs and ours\n)\nand it appeared in\nNueva Dimensión\nⓉ\n(\nNew dimension\n)\n114\nin\n1979\n. Note the choice to publish what should have been in No\n14\nappeared in No\n114\n.\nLet us return to Mouján's mathematical career. We quote from her colleague and collaborator Jorge E Sagula\n(\nsee\n[\n7\n]\n)\n:-\nIn the\n1970\ns, already based in the city of La Plata, she was on the staff at the Faculty of Applied Mathematics of the Catholic University of La Plata, particularly teaching subjects of higher years in the Bachelor of Applied Mathematics and in the Bachelor of Statistics.\nI met Dr Moujan Otaño in\n1980\n, while she was teaching Applied Mathematics at the Catholic University of La Plata. We worked together on many projects: research, articles, books\n(\nfor example: \"Fundamentals of Computational Mathematics\", published in the city of La Plata in\n1992)\n, stories, sharing learning languages, for example, Russian; sharing direction and co-direction of thesis students and research projects, among other major topics.\nThe last stage of teaching, as Full Professor in the Statistics and Systems Division, was carried out at the National University of Luján, particularly at the Chivilcoy Regional Center, responding to the proposal that I formulated in\n1989\n.\nWhen Magdalena left this world on\n16\nJuly\n2005\n, twenty-five years after we met, we were united by a superior relationship, a strong family and professional bond. It took me more than\n6\nmonths to accept her departure, but she is continually in my memory.\nMouján died at the age of\n79\nin a hospital in Mar del Plata. She asked to be buried next to his grandfather in the cemetery of Mar del Plata.",
  "matematicos_citados_na_biografia": [
    "Manuel Sadosky",
    "Luís Antoni Santaló",
    "Luís Santaló",
    "Julio Rey Pastor",
    "Rebeca Cherep",
    "Rebeca Guber",
    "Cecilia Berdichevsky"
  ],
  "imagens": [
    "moujan.jpg"
  ]
}