{
  "nome_completo": "Mahāvīra",
  "nome_curto": "Mahāvīra",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mahavira/",
  "data_nascimento": "about 800",
  "local_nascimento": "possibly Mysore, India",
  "data_morte": "about 870",
  "local_morte": "India",
  "summary": "Mahāvīra was an Indian mathematician who extended the mathematics of Brahmagupta.",
  "biografia": "Mahavira\n(\nor\nMahaviracharya\nmeaning Mahavira the Teacher\n)\nwas of the Jaina religion and was familiar with Jaina mathematics. He worked in Mysore in southern Indian where he was a member of a school of mathematics. If he was not born in Mysore then it is very likely that he was born close to this town in the same region of India. We have essentially no other biographical details although we can gain just a little of his personality from the acknowledgement he gives in the introduction to his only known work, see below. However Jain in\n[\n10\n]\nmentions six other works which he credits to Mahavira and he emphasises the need for further research into identifying the complete list of his works.\nThe only known book by Mahavira is\nGanita Sara Samgraha\nⓉ\n(\nThe entire collection of mathematics\n)\n, dated\n850\nAD, which was designed as an updating of\nBrahmagupta\n's book. Filliozat writes\n[\n6\n]\n:-\nThis book deals with the teaching of\nBrahmagupta\nbut contains both simplifications and additional information. ... Although like all Indian versified texts, it is extremely condensed, this work, from a pedagogical point of view, has a significant advantage over earlier texts.\nIt consisted of nine chapters and included all mathematical knowledge of mid-ninth century India. It provides us with the bulk of knowledge which we have of Jaina mathematics and it can be seen as in some sense providing an account of the work of those who developed this mathematics. There were many Indian mathematicians before the time of Mahavira but, perhaps surprisingly, their work on mathematics is always contained in texts which discuss other topics such as astronomy. The\nGanita Sara Samgraha\nⓉ\n(\nThe entire collection of mathematics\n)\nby Mahavira is the earliest Indian text which we possess which is devoted entirely to mathematics.\nIn the introduction to the work Mahavira paid tribute to the mathematicians whose work formed the basis of his book. These mathematicians included\nAryabhata I\n,\nBhaskara I\n, and\nBrahmagupta\n. Mahavira writes:-\nWith the help of the accomplished holy sages, who are worthy to be worshipped by the lords of the world ... I glean from the great ocean of the knowledge of numbers a little of its essence, in the manner in which gems are picked from the sea, gold from the stony rock and the pearl from the oyster shell; and I give out according to the power of my intelligence, the Sara Samgraha, a small work on arithmetic, which is however not small in importance.\nThe nine chapters of the\nGanita Sara Samgraha\nⓉ\n(\nThe entire collection of mathematics\n)\nare:\n1\n. Terminology\n2\n. Arithmetical operations\n3\n. Operations involving fractions\n4\n. Miscellaneous operations\n5\n. Operations involving the rule of three\n6\n. Mixed operations\n7\n. Operations relating to the calculations of areas\n8\n. Operations relating to excavations\n9\n. Operations relating to shadows\nThroughout the work a place-value system with nine numerals is used or sometimes Sanskrit numeral symbols are used. Of interest in Chapter\n1\nregarding the development of a place-value number system is Mahavira's description of the number\n12345654321\nwhich he obtains after a calculation. He describes the number as:-\n... beginning with one which then grows until it reaches six, then decreases in reverse order.\nNotice that this wording makes sense to us using a place-value system but would not make sense in other systems. It is a clear indication that Mahavira is at home with the place-value number system.\nAmong topics Mahavira discussed in his treatise was operations with fractions including methods to decompose integers and fractions into unit fractions. For example\n2\n17\n=\n1\n12\n+\n1\n51\n+\n1\n68\n\\large\\frac{2}{17}\\normalsize  = \\large\\frac{1}{12}\\normalsize  + \\large\\frac{1}{51}\\normalsize  + \\large\\frac{1}{68}\\normalsize\n1\n7\n2\n​\n=\n1\n2\n1\n​\n+\n5\n1\n1\n​\n+\n6\n8\n1\n​\n.\nHe examined methods of squaring numbers which, although a special case of multiplying two numbers, can be computed using special methods. He also discussed integer solutions of first degree indeterminate equation by a method called kuttaka. The kuttaka\n(\nor the \"pulveriser\"\n)\nmethod is based on the use of the Euclidean algorithm but the method of solution also resembles the\ncontinued fraction\nprocess of\nEuler\ngiven in\n1764\n. The work kuttaka, which occurs in many of the treatises of Indian mathematicians of the classical period, has taken on the more general meaning of \"algebra\".\nAn example of a problem given in the\nGanita Sara Samgraha\nⓉ\n(\nThe entire collection of mathematics\n)\nwhich leads to indeterminate linear equations is the following:-\nThree merchants find a purse lying in the road. One merchant says \"If I keep the purse, I shall have twice as much money as the two of you together\". \"Give me the purse and I shall have three times as much\" said the second merchant. The third merchant said \"I shall be much better off than either of you if I keep the purse, I shall have five times as much as the two of you together\". How much money is in the purse? How much money does each merchant have?\nIf the first merchant has\nx\nx\nx\n, the second\ny\ny\ny\n, the third\nz\nz\nz\nand\np\np\np\nis the amount in the purse then\np\n+\nx\n=\n2\n(\ny\n+\nz\n)\n,\np\n+\ny\n=\n3\n(\nx\n+\nz\n)\n,\np\n+\nz\n=\n5\n(\nx\n+\ny\n)\np + x = 2(y + z), p + y = 3(x + z), p + z = 5(x + y)\np\n+\nx\n=\n2\n(\ny\n+\nz\n)\n,\np\n+\ny\n=\n3\n(\nx\n+\nz\n)\n,\np\n+\nz\n=\n5\n(\nx\n+\ny\n)\n.\nThere is no unique solution but the smallest solution in positive integers is\np\n=\n15\n,\nx\n=\n1\n,\ny\n=\n3\n,\nz\n=\n5\np = 15, x = 1, y = 3, z = 5\np\n=\n1\n5\n,\nx\n=\n1\n,\ny\n=\n3\n,\nz\n=\n5\n. Any solution in positive integers is a multiple of this solution as Mahavira claims.\nMahavira gave special rules for the use of permutations and combinations which was a topic of special interest in Jaina mathematics. He also described a process for calculating the volume of a sphere and one for calculating the cube root of a number. He looked at some geometrical results including right-angled triangles with\nrational\nsides, see for example\n[\n4\n]\n.\nMahavira also attempts to solve certain mathematical problems which had not been studied by other Indian mathematicians. For example, he gave an approximate formula for the area and the perimeter of an ellipse. In\n[\n8\n]\nHayashi writes:-\nThe formulas for a conch-like figure have so far been found only in the works of Mahavira and Narayana.\nIt is reasonable to ask what a \"conch-like figure\" is. It is two unequal semicircles\n(\nwith diameters\nA\nB\nAB\nA\nB\nand\nB\nC\nBC\nB\nC\n)\nstuck together along their diameters. Although it might be reasonable to suppose that the perimeter might be obtained by considering the semicircles, Hayashi claims that the formulae obtained:-\n... were most probably obtained not from the two semicircles AB and BC.",
  "matematicos_citados_na_biografia": [
    "Brahmagupta",
    "Aryabhata I",
    "Bhaskara I",
    "continued fraction",
    "Euler",
    "rational"
  ],
  "imagens": []
}