{
  "nome_completo": "Abu Nasr Mansur ibn Ali ibn Iraq",
  "nome_curto": "Mansur",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mansur/",
  "data_nascimento": "970",
  "local_nascimento": "(possibly) Khwarazm (now Kara-Kalpakskaya, Uzbekistan)",
  "data_morte": "1036",
  "local_morte": "(probably) Ghazna (now Ghazni, Afganistan)",
  "summary": "Abu Nasr Mansur was an Islamic prince and mathematician who collaborated with al-Biruni on astronomy and mathematics. He discovered the sine rule for triangles.",
  "biografia": "Abu Nasr Mansur\nwas a native of Gilan which is mentioned in\nThe Regions of the World\n, a Persian geography book of\n982\n. His family, the Banu Iraq, were rulers of Khwarazm the region adjoining the Aral Sea, and it was in this region that Abu Nasr Mansur studied and became a disciple of\nAbu'l-Wafa\n. Abu Nasr Mansur was teaching in this area when he first began his association with\nal-Biruni\nwhom he taught from about\n990\n. This began an important collaboration which was to go on for many years.\nThe end of the\n10\nth\ncentury and beginning of the\n11\nth\ncentury was a period of great unrest in the Islamic world and there were civil wars in the region in which Abu Nasr Mansur was living. Khwarazm was at this time part of the Samanid Empire which ruled from Bukhara. Other states in the region were the Ziyarid state with its capital at Gurgan on the Caspian sea. Further west the Buwayhid dynasty ruled over the area between the Caspian sea and the Persian Gulf, and over Mesopotamia. Another kingdom which was rapidly rising in influence was the Ghaznavids whose capital was at Ghazna in Afganistan.\nIn\n995\nthe Banu Iraq, of which Abu Nasr Mansur was a prince, was overthrown in a coup. It is not clear what happened to Abu Nasr Mansur at this stage but certainly his pupil\nal-Biruni\nfled at the outbreak of the civil war. It seems that Abu Nasr Mansur was, some little time later, employed at the court of Ali ibn Ma'mun and remained at the court when his brother Abu'l Abbas Ma'mun succeeded him. Both these brother married sisters of the ruler Mahmud from the powerful state at Ghazna which would eventually take control of Ma'mun's kingdom.\nBoth Ali ibn Ma'mun and Abu'l Abbas Ma'mun were patrons of the sciences and supported a number of top scientists at their court. Not only did Abu Nasr Mansur work there but from about\n1004\nal-Biruni\nalso worked there, renewing the collaboration between him and his teacher. The wars in the region, however, were to disrupt the scientific work of Abu Nasr Mansur and eventually he and\nal-Biruni\nleft in about\n1017\n. Mahmud was extending his influence over the region from his base in Ghazna and made a demand of Abu'l Abbas Ma'mun in\n1014\nto have his name inserted into the Friday prayers. This was a signal that he wanted an end to Ma'mun's rule and for the region to come under his control. After Ma'mun had at least partially agreeded to Mahmud's demands, he was killed by his own army for what they considered to be an act of treachery. Following this Mahmud marched his army into the region and gained control. Both Abu Nasr Mansur and\nal-Biruni\nseem to have left with the victorious Mahmud. It seems that Abu Nasr Mansur spent most of the rest of his life at Mahmud's court in Ghazna.\nAbu Nasr Mansur is perhaps most famous for his collaboration with\nal-Biruni\n. Certainly Abu Nasr Mansur worked on many topics as a result of requests from\nal-Biruni\nand a total of twenty-five works are known to have been written by him. It is possible that in this list of twenty-five two names of works that have come down to us are different titles for the same work while another title may refer to a fragment of a larger work\n(\nin which case there are only twenty-three\n)\n. Seventeen works have survived and they show that Abu Nasr Mansur was an extremely able astronomer and mathematician. Of Abu Nasr Mansur's works seven are on mathematics, the rest are on astronomy. All the surviving works have been published, most have been translated into at least one European language, and this gives some indication of the importance attached to his work.\nMany of Abu Nasr Mansur's works were dedicated to his student\nal-Biruni\n. In fact\nal-Biruni\nhimself lists twelve works which he says Abu Nasr Mansur dedicated to him\n(\nalthough some historians read\nal-Biruni\n's words as meaning that he wrote the works himself, but this interpretation seems highly unlikely\n)\n. The first such work which Abu Nasr Mansur dedicated to\nal-Biruni\nwas written around\n997\n, soon after the civil war had disrupted their work. In his own writings\nal-Biruni\nsometimes quotes results due to Abu Nasr Mansur which he says he worked on at\nal-Biruni\n's request. Certainly both men seem keen to give full credit to the other's contributions.\nAbu Nasr Mansur's main achievements are his commentry on the\nSpherics\nof\nMenelaus\n, his role in the development of trigonometry from\nPtolemy\n's calculation with chords towards the trigonometric functions used today, and his development of a set of tables which give easy numerical solutions to typical problems of spherical astronomy.\nAbu Nasr Mansur's reworking of the\nSpherics\nof\nMenelaus\nis particularly important since the Greek original of\nMenelaus\nwork has been lost, although there are several Arabic versions.\nMenelaus\n's work formed the basis for\nPtolemy\n's numerical solutions of spherical astronomy problems in the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. The work is in three books: the first book studies properties of spherical triangles, the second book investigates properties of systems of parallel circles on a sphere as they intersect\ngreat circles\n, while the third book gives a proof of\nMenelaus\n's theorem.\nIn his work on trigonometry Abu Nasr Mansur discovered the sine law\na\ns\ni\nn\nA\n=\nb\ns\ni\nn\nB\n=\nc\ns\ni\nn\nC\n\\Large\\frac a {sin A}\\normalsize =\\Large\\frac b {sin B}\\normalsize =\\Large\\frac c {sin C}\ns\ni\nn\nA\na\n​\n=\ns\ni\nn\nB\nb\n​\n=\ns\ni\nn\nC\nc\n​\n.\nAbu'l-Wafa\nmay have discovered this law first and Abu Nasr Mansur may have learnt it from him. Certainly which of the two has priority is hard to determine and will almost certainly never be known with certainty. A third person who is sometimes credited with this same discovery is\nal-Khujandi\nbut it seems less likely that he was the discoverer since, as Samso writes in\n[\n1\n]\n:-\n... he was essentially a practical astronomer, unconcerned with theoretical problems.\nThe claims of\nal-Khujandi\nto be the discoverer of the sine law are further discussed in his biography.\nThe article\n[\n4\n]\nis a description and study of\nThe table of minutes\nof Abu Nasr Mansur. The author of\n[\n4\n]\ntraces the origins of the work to the\n10\nth\ncentury\nDamascene tables\nby Habash. Abu Nasr Mansur's treatise discusses the five trigonometric functions which are used to solve problems in spherical astronomy. The article shows the improvement achieved by Abu Nasr Mansur in using\n1\nas the value of the radius, instead of\n60\nas was done by most Arabic astronomers.\nOther work by Abu Nasr Mansur on astronomical topics included four works on the construction and application of the\nastrolabe\n. His proof of the sine law appears a number of times in his works, for example in\nAlmagest of the Shah, Book of the\nazimuth\n, Treatise on the determination of spherical arcs\n, and\nTreatise in which some geometrical questions addressed to him are answered\n. The questions referred to in the title of this last work were addressed to him by\nal-Biruni\n. Others works include\nTreatise in which a difficulty in the thirteenth book of the Elements is solved\nand\nA chapter from a book on the sphericity of the heavens\n.",
  "matematicos_citados_na_biografia": [
    "Abu'l-Wafa",
    "al-Biruni",
    "Menelaus",
    "Ptolemy",
    "great circles",
    "al-Khujandi",
    "astrolabe",
    "azimuth"
  ],
  "imagens": []
}