{
  "nome_completo": "Anna Marguerite Marie Lehr",
  "nome_curto": "Marguerite Lehr",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lehr/",
  "data_nascimento": "22 October 1898",
  "local_nascimento": "Baltimore, Maryland, USA",
  "data_morte": "14 December 1987",
  "local_morte": "Bryn Mawr, Pennsylvania, USA",
  "summary": "Marguerite Lehr was an outstanding lecturer and, as one of the first to present a course of mathematics on television in 1952 - 53 , she was in great demand both as a lecturer and as a consultant for presenting mathematics on film or TV.",
  "biografia": "Marguerite Lehr\nnever seems to have used the names \"Anna\" or \"Maria\" although she did write one article under the name \"A Marguerite Lehr\" and her full name appears on her passport application. She was the daughter of George Lehr\n(\nborn October\n1870)\nand Margaret Kreuder\n(\nborn August\n1871)\n. They had married in\n1897\nand had five children: Marguerite Lehr\n(1898\n-\n1987)\n, the subject of this biography; Elizabeth Lehr\n(1900\n-\n1985)\n, Charollete Lehr\n(1904\n-\n1967)\n, who was also known as Charlotte, Charles G K Lehr\n(1908\n-\n1993)\nand George Kreuder Lehr\n(1911\n-\n1996)\n. George Lehr was a grocer who had been born in König, Hesse, Darmstadt, Germany and emigrated to the United States in either\n1890\nor\n1892\n(\nboth dates appear on official forms\n)\n. His wife Margaret had been born in Maryland in the United States to German parents. Before giving details of Marguerite's biography, let us give some details of her siblings. Elizabeth became an instructor in a school, Charollete became a librarian in the Enoch Pratt Library, Charles became a draftsman working for telephone companies, and George Kreuder Lehr became a bookkeeper for a metal firm and married Jane Leigh Warner in\n1943\n. These occupations are as given in the\n1930\nUS census, when all five children are still living at home with their parents at\n255\nMallow Hill Road, Baltimore, Maryland.\nEven before beginning her school education, Marguerite was fluent in German\n[\n18\n]\n:-\nI knew German from the time I was four; I grew up in a German church. German wasn't talked at home because my father didn't want that.\nMarguerite was educated in Baltimore, attending both primary and secondary schools in that city. She recounted\n[\n18\n]\n:-\nThe first and only thing I ever failed in school was the first quarter of algebra. And I know why, now ... But I could be docile and learn roles, so I passed the second quarter with a\n95\n.\nShe graduated from Western High School, Baltimore in\n1915\n. This girls' high school had been founded in\n1844\nand still exists today, being now the oldest all-girls High School in the United States. After graduating, she began studying at Goucher College where she majored in mathematics. She was strongly influenced by\nClara Bacon\nwho taught many of the courses Lehr studied. Lehr graduated with a B.A. in\n1919\n. She is listed as a graduate in\n[\n1\n]\nwhere her address while at the College is given as\n241\nNorth Stricker Street, Baltimore, Maryland. It also notes:-\n\"Ability in a man is knowledge.\" Because she was one \"to strive, to seek, to find and not to yield,\" Marguerite received the first letter of the alphabet as a steady academic diet. The same principle inspired her work on Kalends\n[\nthe College student publication\n]\nand enabled her to take a vigorous part in class athletics.\nAfter graduating\n[\n8\n]\n... she had planned to continue her studies at Johns Hopkins University \"until an instance of Dr\nBacon\n's unceasing interest in the careers of all her students changed that plan more radically than she\n(\nI think!\n)\nor I foresaw\".\nBacon\nsuggested she apply for a position at Bryn Mawr College as an assistant to\nCharlotte Scott\n.\nBeing an assistant to\nCharlotte Scott\nwas a rather different experience for Lehr than that of a usual assistantship since, by this time,\nScott\nwas completely deaf. This meant that Lehr had to answer questions students asked during\nScott\n's lectures and she also had to hold office hours for\nScott\n. In fact, she had two roles, half time for each, during the two academic years\n1919\n-\n21\n, one being\nCharlotte Scott\n's assistant and the other being a graduate student studying for a Ph.D. advised by\nCharlotte Scott\n. She was awarded the M Carey Thomas European fellowship to fund her studies in Europe in\n1921\n-\n22\nbut she chose to postpone this, spending the two years\n1921\n-\n23\nat Bryn Mawr College, the first as a 'fellow in mathematics' and the second as a 'scholar in mathematics'. During these two years she completed all the requirements for a Ph.D. except completing writing her thesis. The M Carey Thomas European fellowship allowed her to spend\n1923\n-\n24\nin Rome and she sailed from New York on the\nSS President Arthur\non\n16\nJune\n1923\n. In Rome she studied with\nGuido Castelnuovo\n,\nFederigo Enriques\n, and\nVito Volterra\n.\nYou can read Lehr's own description of this year in Italy at\nTHIS LINK\n.\nBack at Bryn Mawr in\n1924\n, Lehr was appointed as an Instructor in Mathematics and, the next year she was awarded her Ph.D. by Bryn Mawr for her thesis\nThe plane quintic with five cusps\n. The Introduction begins as follows:-\nThe quintic with five cusps\n(\ncharacterised by the\nPlücker\nnumbers\nm\n=\nn\n=\nκ\n=\ni\n=\n5\n;\nν\n=\nτ\n=\n0\n;\nρ\n=\n1\nm = n =  \\kappa = i = 5; \\nu = \\tau = 0; \\rho = 1\nm\n=\nn\n=\nκ\n=\ni\n=\n5\n;\nν\n=\nτ\n=\n0\n;\nρ\n=\n1\n)\nhas been considered by del Pezzo, Field and\nBasset\n. Field gives a general descriptive account of the appearance of the curve under various conditions on the coefficients in its equation;\nBasset\nmentions it as the limiting case under quintics with five nodes; but neither paper gives a detailed study of the curve. In such a study the del Pezzo work is fundamental. Starting with the fact that a quintic with five cusps may be obtained by quadratic transformation from a quartic with two cusps, in- and circumscribed to the triangle of reference, he proves that the quintic is uniquely determined by its five cusps.\n...\nIn the present investigation, which takes as starting point the del Pezzo work, it is proved that if five points in the plane are given as cusps on a quintic, the curve thus uniquely determined is unipartite, with the five cusps and five inflexions occurring alternately. Moreover, it is shown that from the five given points the cuspidal tangents, the inflexions, the inflexional tangents, as well as a series of ordinary points on the quintic, may be obtained by linear constructions.\nIn\n1929\nshe was promoted to associate professor and spent\n1931\n-\n32\nas fellow-by-courtesy at Johns Hopkins University and attended lectures by\nOscar Zariski\n. Before returning to Bryn Mawr, she spent the summer in Europe\n[\n3\n]\n:-\nMarguerite Lehr and a friend motored through the centre of France down the Riviera to Rome, up through Sienna and Assisi to Switzerland, through Rothenburg, Heidelberg, etc., to Belgium and back to Havre.\nIn fact while in Switzerland she attended the International Congress of Mathematicians in Zurich in September\n1932\n. This was the second International Congress of Mathematicians that Lehr had attended, having been at the\n1928\nCongress in Bologna in September of that year.\nShe published two further paper:\n(\nwith\nVirgil Snyder\n)\nGenerating involutions of infinite discontinuous Cremona groups of\nS\n4\nS_{4}\nS\n4\n​\nwhich leave a general cubic variety invariant\n(1931)\nand\nRegular linear systems of curves with singularities of a given curve as base points\n(1932)\n. This second paper was the result of her efforts to generalise work presented by\nZariski\nin the lectures she had attended at Johns Hopkins University. In\n1935\nshe was promoted to assistant professor, then in\n1937\nto associate professor. She wrote about her career in\n1970\n(\nsee for example\n[\n8\n]\n)\n:-\nOnly at Bryn Mawr, with its full graduate school, would a woman of my generation, in mathematics, have had graduate level courses to give, from the first - regardless of rank. My engagement was with mathematics, not 'teaching,' consequently I refused any and all feelers in administration or editing in spite of slow promotion! But the choice was mine - I wanted the full range of thought, live, not text-book concerns.\nLehr became a member of the American Association of University Women and was the speaker at the annual meeting of the College Women's Club, Montclair, New Jersey, on\n14\nApril\n1939\n. She also gave talks in Boston, Detroit, and Virginia as she gained fame as an excellent speaker. During World War II she was involved in war work which she explained in a letter published in\n[\n5\n]\n:-\nI just found your post card of\n26\nMarch\n1942\nin my 'unanswered' clip, and am sending you a note about my latest experience - quite exciting and rather challenging. Under the Engineering, Science, and Management War Training program a course in maps from aerial photographs\n(\nproperly called photogrammetry, I gather!\n)\nwas established this summer, on the Bryn Mawr campus under the direction of three geologists and me ... and on my side I put in three incredibly packed weeks, teaching each of two sections three hours math a day, to cover a kind of minimum set of notions which underlie mapping problems. The class of\n40\nran from\n17\nto\n58\nin age; from high school youngsters whose pencils dripped trigonometry to Commercial artists who shivered at the thought of algebra - but did they work! And did I learn a lot!\nYou can read more about Lehr's work teaching photogrammetry in the extracts of\n[\n12\n]\nwe give at\nTHIS LINK\n.\nShe also taught in a V-\n12\nNavy College Training Program at Swarthmore College. It must have been a difficult decision by Swarthmore, as a Quaker institution traditionally against war, to become involved in this program.\nLet us take an example of Lehr's teaching commitments at Bryn Mawr by looking at\n1947\n-\n48\n(\nsee\n[\n2\n]\n)\n. She gave three lectures and three hours laboratory work each week for a 'Statistics' course delivered to Economics, Sociology and Social Economy. A brief syllabus is\n[\n2\n]\n:-\nDescriptive statistics; distributions; mean values; dispersion; elements of probability, of sampling, and of time series. The necessary mathematics is developed in the course.\nYou can see more of Lehr's ideas of statistics in\n[\n12\n]\n, extracts from which we present at\nTHIS LINK\n.\nFor Mathematics in session\n1947\n-\n48\nshe was involved in teaching 'Plane Analytic Geometry' to first year students, 'Differential Calculus' to first year students, 'Second Year Calculus' to second year students, 'Theory of Equations, Solid Analytical Geometry' to second year students, 'Theory of Probability and Statistics' to second year students, 'Advanced Geometry' to third year students, and 'Advanced Algebra' to third year students.\nPerhaps Lehr became best known for her pioneering work as one of the earliest presenters of mathematics on television in\n1952\n-\n53\n. WFIL, a broadcast radio station from Philadelphia, Pennsylvania, had joined with twenty-five different institutions in presenting\nUniversity of the Air\nover Philadelphia's Channel\n6\n. Bryn Mawr asked Lehr if she would present a course on mathematics, one of the courses with fifteen lectures. She described her course, called\nInvitation to Mathematics\n, in\n[\n16\n]\n:-\nThe syllabus contained a brief introduction and a two-hundred word section for each week, with abstract and three references selected to offer wide range of treatment, and as much further bibliography as possible in the strict text or treatise sense. Any one sending for the syllabus was already interested in at least one of the ten subjects; the abstracts were therefore intended to catch attention by questions raised, while the range of reference would\n(\nI hoped\n)\nreassure and serve a more informed reader. This was one device for coping with the unknown spread of mathematical sophistication in the potential audience.\nHer syllabus begins:-\nMost people associate mathematics with getting answers or giving proofs, and it is easy to see why. Mathematics does set up good rules for getting quick answers, and does accumulate good reasons for trusting those rules. But the life of the enterprise is inquiry; as we learn how to ask good questions, answers come, and often more powerfully than when we strain for them. So these talks are concerned with raising questions - questions of practical import or pure curiosity - questions about number, space, pattern, logic, which mathematicians know have paid off in increasing our comprehension of the world we live in. You are wrong if you think questions of this kind are special, technical, occurring only to a few gifted people. Almost every small child does things, and asks about things, which touch such mathematical sides of experience. He may be hoping for a rule\n(\nwhat to do\n)\n; he may be groping for a reason\n(\nwhy it works\n)\n; mathematics itself swings between rules and reasons. In these talks, children's casual remarks will often be used, for illumination or to surprise you into an attitude of observant curiosity. Even the dictionary, under \"mathematic - fr. Greek\" gives first mathematikos - disposed to learn, and only second mathemata - things learned.\nFor extracts from the Introduction to the paper\n[\n16\n]\n, see\nTHIS LINK\n.\nIn\n[\n14\n]\nthe following citation for Lehr receiving the Goucher Alumnae Achievement Award in\n1954\nis given:-\nAble scholar and inspiring teacher, cherishing the best in classical education but not afraid to explore and utilise new ideas and methods, you have made notable contributions to education not only by helping others to understand the nature of mathematics and its role in the modern world, but also by demonstrating and explaining the discipline of scholarship and its intrinsic values.\nHer success in the television course\nInvitation to Mathematics\nled to Lehr becoming a member of the\nMathematical Association of America\n's Committee on Film Project which produced a series of films aimed at both teachers and students. She was also hired in\n1957\nby NBC as a consultant for a television series they produced with presenters who included\nEmil Artin\n,\nH S M Coxeter\n,\nSaunders Mac Lane\n,\nWilliam Feller\n, and\nRichard Courant\n.\nIn\n1958\n-\n59\nLehr chaired the Philadelphia Section of the\nMathematical Association of America\n. She was also\nMathematical Association of America\nvisiting lecturer making a major lecture tour\n[\n6\n]\n:-\nMarguerite Lehr has added another to her long list of outstanding achievements. This time she was loaned by Bryn Mawr College to give short courses for advanced students of exceptional ability in other colleges. Last fall she was a visiting professor at New England colleges, and on March\n15\nshe started on a trip to some\n15\ncolleges in the mid-west.\nLehr retired from Bryn Mawr in\n1967\nand, on her retirement, received the Christine R and Mary F Lindback Award:-\n... in recognition of her brilliance as a teacher, for which generations of students will remember her.\nAs to her interests other than mathematics, she lists the following in\n1961\n(\nsee for example\n[\n8\n]\n)\n:-\n... attempts at translation from French, German, Italian ... upholstering and other house projects\n(\nsome of which do oddly have a math side, too\n)\n, I'm not a bad carpenter and\n[\nlove\n]\ngardening in Maine.\nWe should balance this, however, with her own description of her passion for mathematics\n[\n18\n]\n:-\nOnce a woman asked me, \"Are you a mathematician?\" The big words, I think, belong to the big things. So I said, \"No, but I spend most of my waking hours thinking about mathematics, and sometimes sleeping hours too.\" I didn't know\nPaul Levy\nwas at my shoulder. He said in his nice French, \"But you know very well what mathematics is ... You do the dance called 'thinking' in front of them. And they learn. They don't all learn the same thing, but that doesn't matter.\" He looked puzzled, and then he exclaimed, \"Ah, the little articles! All those little articles!\"\nThe years of her retirement are described in\n[\n8\n]\n:-\nIn\n1968\n, the year after she retired, Lehr was living in Salisbury, Maryland, where her sister Charlotte had been living until her death after a lengthy illness in August\n1967\n. In May\n1971\nLehr reported to Bryn Mawr from Baltimore that \"I am gone from Salisbury a great deal.\" Part of that time is likely to have been in Manset on Mount Desert Island in Maine, which she described for her\n1954\narticle in the Bryn Mawr Alumnae Bulletin, as \"next to Mathematics, her greatest obsession.\" In November\n1972\n, Marguerite Lehr moved from Salisbury back to Bryn Mawr, Pennsylvania.\nFollowing her death, a memorial service was held in the Episcopal Church of the Redeemer in Bryn Mawr, a church with which she had been actively involved for many years. Gifts from many former students led to the Marguerite Lehr Scholarship Fund being established in Bryn Mawr College in\n1988\n.",
  "matematicos_citados_na_biografia": [
    "Clara Bacon",
    "Bacon",
    "Charlotte Scott",
    "Scott",
    "Guido Castelnuovo",
    "Federigo Enriques",
    "Vito Volterra",
    "THIS LINK",
    "Plücker",
    "Basset",
    "Oscar Zariski",
    "Virgil Snyder",
    "Zariski",
    "Mathematical Association of America",
    "Emil Artin",
    "H S M Coxeter",
    "Saunders Mac Lane",
    "William Feller",
    "Richard Courant",
    "Paul Levy"
  ],
  "imagens": [
    "lehr.jpg"
  ]
}