{
  "nome_completo": "Marina Ratner",
  "nome_curto": "Marina Ratner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ratner/",
  "data_nascimento": "30 October 1938",
  "local_nascimento": "Moscow, USSR (now Russia)",
  "data_morte": "7 July 2017",
  "local_morte": "El Cerrito, California, USA",
  "summary": "Marina Ratner was a Russian mathematician who worked in Israel and America. She worked in ergodic theory.",
  "biografia": "Marina Ratner\n's father, Evsej I Ratner, was a plant physiologist, a professor, and head of the K A Timirjazev Institute of Plant Physiology in Moscow. Her mother was a chemist. The family was Jewish. Marina Ratner writes\n[\n1\n]\n:-\nIn the late\n1940\ns my mother was fired from her job for corresponding with her mother in Israel, which was considered by the Soviet regime as an enemy state. Those were dreadful years for Soviet Jews. In\n1952\nthe anti-Semitism in the Soviet Union was at its peak. One could be fired or get arrested at any moment. My father was about to be fired too, but Stalin's death in\n1953\nsaved him his job.\nMarina grew up in Moscow where she attended school. It was in the fifth grade that she fell in love with mathematics\n[\n1\n]\n:-\nTraditionally the level of education in the big cities in Russia was very high. The school programme in mathematics was rigorous and stimulating. I was fascinated with mathematical reasoning in algebra and geometry, which was beautiful and exciting. Mathematics came naturally to me and I felt unmatched satisfaction solving difficult problems.\nAfter leaving school, Ratner applied to study at Moscow State University. This was a particularly fortunate time since Khrushchev had addressed the Communist Party of the Soviet Union earlier that year denouncing Stalin and the atrocities that had occurred during his period in office. This produced a short period when Moscow State University accepted Jewish students on an equal basis and Ratner was invited to take an oral entrance examination\n[\n1\n]\n:-\nI was asked to solve eleven problems on the board. I solved only ten. I left the examination being convinced that I had failed and would not be admitted. But I was, and this was a turning point in my life.\nRatner graduated in\n1961\nhaving studied mathematics and physics as her main subjects. During her years as an undergraduate she had been greatly influenced by\nAndrei Nikolaevich Kolmogorov\nand became interested in probability theory, an area in which Kolmogorov had a strong research group. After graduating, Ratner worked for four years in\nKolmogorov\n's applied statistics group and in his special school for gifted high school students. Of course\nKolmogorov\nwas an important influence on her during these years but a perhaps even greater influence was\nYakov Grigorevich Sinai\nwho was only three years older than Ratner and had been one of\nKolmogorov\n's most outstanding students. During these years, Ratner's daughter was born. In\n1965\nshe returned to her studies at Moscow State University, undertaking research supervised by\nSinai\n[\n1\n]\n:-\nSinai had already made fundamental contributions to ergodic theory, an area of mathematics related to\nprobability theory\nthat originated from thermodynamics and statistical physics. Sinai demanded that his students have a broad mathematical education. This helped me a great deal in my future research.\nIn\n1969\n, after submitting her thesis\nGeodesic Flows on Unit Tangent Bundles of Compact Surfaces of Negative Curvature\n, Ratner graduated with a degree equivalent to a Ph.D. In this thesis she studied the\nergodic theory\nof geodesic flows on negatively curved surfaces,\ndynamical systems\nwith very random behaviour which arise geometrically. After receiving her degree, she was employed as an assistant at the High Technical Engineering School in Moscow. After applying for a visa to emigrate to Israel, Ratner was dismissed from her position at the Engineering School in\n1970\n. She was able to emigrate to Israel where she was employed as a lecturer at the Hebrew University of Jerusalem from\n1971\nto\n1974\n, then in the Pre-academic School of the Hebrew University of Jerusalem in\n1974\n-\n75\n. During her years in Jerusalem she continued to undertake research on geometrical dynamical systems, corresponding with\nRufus Bowen\nat the University of California at Berkeley who was producing innovative results on measures associated with dynamical systems. She received an invitation to join the faculty at Berkeley and, in\n1975\n, she moved to the United States and took up a position as acting assistant professor at Berkeley.\nAt Berkeley, Ratner was promoted steadily until she reached the rank of full professor in\n1982\n. Her research has been of the highest quality and she has received many awards for her outstanding contributions. We quote from\n[\n6\n]\nwhere a description of her contributions which led to the award of the John J Carty Award from the\nNational Academy of Sciences\nin\n1994\nis given:-\nMarina Ratner's main work has been in ergodic theory and, more importantly, the use of ideas and techniques from ergodic theory in other, more classical, contexts. Much of her best work has involved the discovery of various \"rigidity\" phenomena. In her surprising work on horocycle flows, done in the early\n1980\ns, the objects under discussion are algebraic or geometric\n(\ndepending on viewpoint\n)\n. This structure carries along with it some measure-theoretic structure, but on the surface it would seem that the measure-theoretic description of these horocycle flows contains little information about them. The surprise is that, in fact, the measure-theoretic description contains everything! ... Marina's much acclaimed work of the last few years - the Raghunathan conjecture - are a far-reaching generalisation and application of these ideas to an important situation. Briefly: There was an innocent looking question, sometimes called the \"\nOppenheim\nconjecture\", about values assumed by real quadratic forms in three integer variables. This question has proved remarkably recalcitrant. About\n1980\n, M S Raghunathan observed that the expected answer would follow if a certain natural conjecture about actions of\nLie\ngroups were true. The question about quadratic forms required only a special case of the Raghunathan conjecture and in\n1986\nG Margulis\nproved this case. However, his proof gave little insight into what was going on. Marina saw that her methods were appropriate ones for this type of question, and eventually she gave a complete proof of the Raghunathan conjecture. Furthermore, her proofs worked into a very general context and enabled her to answer related questions by\nMargulis\nand Raghunathan. This has led to further number-theoretic information about quadratic forms.\nIn\n1994\nthe International Congress of Mathematicians was held in Zürich. Ratner was an invited plenary speaker at the congress. She became only the third woman to give a plenary lecture at an International Congress of Mathematicians, the two previous being\nEmmy Noether\n(1932)\nand\nKaren Uhlenbeck\n(1990)\n.\nIngrid Daubechies\nwas also a plenary speaker at the\n1994\nInternational Congress of Mathematicians in Zürich. Ratner's lecture was entitled\nInteractions between ergodic theory, Lie groups and number theory\n. She gave the following abstract:-\nIn this lecture we shall discuss the use of dynamical and ergodic-theoretic ideas to solve some long-standing problems arising from\nLie\ngroups and number theory. These problems come from looking at actions of\nLie\ngroups on their homogeneous spaces, and, in particular, Ad-unipotent actions. The latter actions through random and chaotic from a dynamical point of view, seem to be rigidly linked to the algebraic structure of the underlying homogeneous space: their ergodic invariant measures and orbit closures have an algebraic nature. These results have some significant applications to number theory and ergodic theory.\nWe have used quotations from awards that were given to Ratner to illustrate the importance of her mathematical contributions. However, she received many other honours including prestigious fellowships: Alfred P Sloan Research Fellow\n(1977\n-\n79)\n, Miller Research Fellow at the University of California, Berkeley\n(1985\n-\n86)\n, John Simon Guggenheim Fellow\n(1987\n-\n88)\n. She was elected to the\nAmerican Academy of Arts and Sciences\nin\n1992\nand, in the following year, was elected to the\nNational Academy of Sciences\n. We have already mentioned the John J Carty Award from the\nNational Academy of Sciences\nwhich she received in an awards ceremony on\n25\nApril\n1994\n. In addition to the Medal, she received an illuminated scroll and $\n25\n,\n000\n. Later in the same year, on\n8\nJuly, she received the\nOstrowski\nPrize in Basel, Switzerland. The citation for the prize begins:-\nMarina Ratner created a deep and rather complete theory concerning the dynamics of actions of subgroups of open groups on homogeneous spaces of these groups and also discovered connections to ergodic theory. Based on her previous work on horocycle flows, she completely proved the \"topological Raghunathan conjecture\" through the \"measure-theoretic Raghunathan conjecture\". It was she who recognised the importance of the latter ...\nBen Green in an interview in\n2006\nsaid\n[\n4\n]\n:-\nI am particularly fond of instances in which it is possible to extract \"rigid\"  structure from rather soft information - in fact most of the questions I am working on right now have this kind of flavour. A theorem of this type that I very much admire\n(\nthough I don't quite know how to prove, I'm ashamed to say\n)\nis Marina Ratner's theorem on the closures of orbits of unipotent flows. She related these to exact subgroups - that is, she took soft information\n(\nin this case a dynamical system\n)\nand found algebraic structure in it.\nLet us end this biography by quoting Ratner's words from\n[\n1\n]\n:-\nFor me mathematics is a part of Nature's beauty and I am grateful for being able to see it. Whatever mathematics I happen to teach, I love to communicate its beauty to my students.",
  "matematicos_citados_na_biografia": [
    "Andrei Nikolaevich Kolmogorov",
    "Kolmogorov",
    "Yakov Grigorevich Sinai",
    "Sinai",
    "probability theory",
    "ergodic theory",
    "dynamical systems",
    "Rufus Bowen",
    "National Academy of Sciences",
    "Oppenheim",
    "Lie",
    "G Margulis",
    "Margulis",
    "Emmy Noether",
    "Karen Uhlenbeck",
    "Ingrid Daubechies",
    "American Academy of Arts and Sciences",
    "Ostrowski"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}