{
  "nome_completo": "Marian Țarină",
  "nome_curto": "Marian Țarină",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tarina/",
  "data_nascimento": "15 August 1932",
  "local_nascimento": "Turda, Romania",
  "data_morte": "31 May 1992",
  "local_morte": "Oradea, Romania",
  "summary": "Marian Țarină was a Romanian mathematician who worked in geometry and was also interested in the history of mathematics.",
  "biografia": "Marian Țarină\nwas born at Turda in August\n1932\n. Turda is in Transylvania which had been part of Austro-Hungary up to the end of World War I but, in\n1918\n, Transylvania had become part of Romania, and Turda with it. It was therefore part of Romania long before Țarină was born and the city of Turda was where he grew up. He attended the high school Regele Ferdinand\n(\nKing Ferdinand\n)\n, now named Mihai Viteazul\n(\nMichael the Brave\n)\nNational College, in Turda, graduating in\n1950\n. Then, he was admitted to the Faculty of Mathematics and Physics at the University of Cluj, being awarded a Magna Cum Laude Diploma in\n1954\n. Upon graduation he was appointed as an assistant to the Chair of Geometry at the University of Cluj. He continued in this position until\n1960\nwhen he was promoted as a lecturer at Cluj. At the time Țarină became an assistant, there were two universities in Cluj, the Romanian University of Cluj which had been the King Ferdinand I University, was renamed Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\nwhile the Hungarian University of Cluj was named the\nBolyai\nUniversity\n(\nafter the mathematician\nJános Bolyai\n)\n. The two universities combined to become the Babeș-Bolyai University in\n1959\nso, after serving as an assistant in the Babeș University, Țarină became a lecturer in the Babeș-Bolyai University in\n1960\n.\nUnder the guidance of academician\nGheorghe Vrănceanu\n, he obtained his Ph.D. In Mathematics in\n1964\nfrom the University of Bucharest with a thesis entitled\nPartial Projective Spaces with Maximal Group of Motion\n. He began publishing research articles, all written in Romanian, while working towards his doctorate. The first few of these articles are\nPlane pedal transformations and their application to non-euclidean geometry\n(1963)\n,\nEquiaffine subprojective spaces\n(1964)\nand\nSubprojective spaces of order\nn\n−\n3\nn - 3\nn\n−\n3\nwith maximum group of motions\n(1964)\n. The notion of a subprojective space had been introduced by\nBenjamin Fedorovich Kagan\nin\n1933\nand\nVrănceanu\nhad made a particular study of subprojective spaces of order\nn\n−\n2\nn - 2\nn\n−\n2\nin his book\nLectures on differential geometry\n(\nRomanian\n)\n(1951)\n. Țarină used methods developed by his thesis advisor\nVrănceanu\nto attack the case of subprojective spaces of order\nn\n−\n3\nn - 3\nn\n−\n3\nin his\n1964\npaper.\nThe entire didactical activity of Professor Marian Țarină was at the University of Cluj. He was promoted as \"conferentiar\", equivalent to a reader in the UK or associate professor in the US, in\n1970\n. He obtained a full professorship when he was named to the Chair of Differential Geometry in\n1990\n. Țarină taught many courses at Cluj on a variety of different topics such as: Differential Geometry, Fundamental\nAlgebraic Topology\n, Symmetric Spaces,\nLie Groups\n, Groups, and the History of Mathematics.\nThroughout his career, Țarină published more than\n50\nresearch papers and presented almost\n200\nscientific communications. His research interests changed throughout his career. Fundamentals of geometry and non-Euclidean geometry were topics that interested him particularly between\n1954\nand\n1957\n. From\n1957\nto\n1967\nhis main interest was on Motion Groups in\nRiemann\nSpaces. He made a particular study of Recurrent Spaces for the five years following\n1965\n, although he returned to the topic in\n1980\n-\n81\n. He studied\nG\nG\nG\n-structures on Differentiable Manifolds from around\n1971\nto\n1980\n. He studied Invariant Connections from\n1980\nto\n1984\nand\nFinsler\nSpaces and generalisations from\n1984\nto\n1992\n. Here are examples of papers, one on each of these topics, with a brief comment:\nMotion Groups in Riemann Spaces.\nPaper:\nOn the mobility of a space\nA\nn\nA_{n}\nA\nn\n​\nwithout torsion which admits fields of parallel vectors\n(1965)\n.\nComment:\nStarting from the fact that there are some general relations between conditions under which a space\nA\nn\nA_{n}\nA\nn\n​\nwith an affine connection without torsion possesses a group of motions or fields of parallel vectors, Țarină considers this problem for different kinds of spaces, known to have maximal groups of motions.\nRecurrent Spaces.\nPaper:\nSpaces\nV\nn\nV_{n}\nV\nn\n​\nwith recurrent projective curvature\n(1969)\n.\nComment:\nIn this note, Țarină discusses a generalisation of the projective and the conformal equivalence of connections on a manifold. The main result of the first section is a formula relating the curvature of two connections which are equivalent in the sense he defines in the paper. The second section discusses the notion of an admissible morphism, and the corresponding transformation of equivalent connections.\nG-structures on Differentiable Manifolds.\nPaper:\nEquivalent connections on G-structures of order\n2\n(1980)\n.\nComment:\nIn this note, Țarină discusses a generalisation of the projective and the conformal equivalence of connections on a manifold.\nInvariant Connections.\nPaper:\nInvariant connections\n(1981)\n.\nComment:\nIn this paper, Țarină gives a few ways of defining invariant connections in principal fibre bundles and establishes some properties about the order of invariant connections.\nFinsler Spaces and generalisations.\nPaper:\nFinsler connections and associated algebras\n(1982)\n.\nComment:\nȚarină writes, \"Many geometric objects in the theory of\nFinsler\nspaces present an obvious analogy with the case of linear connections. This is the case for the problems of algebras associated with some classes of\nFinsler\nconnexions, which we consider here.\"\nWe noted earlier his interest in the history of mathematics so let us mention three papers Țarină wrote on that topic, namely\nCarl Friedrich Gauss\n(1777\n-\n1855)\nas a precursor of the topology\n(1977)\n,\nDevelopment of geometry in the period of the French Revolution\n(1979)\nand\nThe ideas of the Appendix-the chief work of János Bolyai\n(1979)\n.\nȚarină unexpected died in May\n1992\nat Oradea in his sixtieth year. Andrica Dorin, the author of\n[\n1\n]\nand co-author of\n[\n3\n]\n, writes in\n[\n1\n]\n:-\nLectures by Professor Marian Țarină at the University of Cluj were always marked by their scientific rigour and clarity of exposition. He lectured on geometry, differential geometry, foundations of geometry, topology, algebraic topology, symmetric spaces,\nLie\ngroups, foundations of mathematics, history of mathematics, some of which were published and became relevant references to other courses or books in our country\n[\nRomania\n]\n. I had the wonderful opportunity to be a student of Professor Dr Marian Țarină, both during college and later when he directed my doctoral studies. My contacts with Marian Țarină showed me the special human qualities of that excellent mathematician: warmth, modesty, and humour. My memories of Professor Marian Țarină will remain alive throughout my life.\nA Symposium in Geometry was organized on the occasion of the\n190\nth\nanniversary of\nJanos Bolyai\nand of the\n60\nth\nanniversary of Marian Țarină at Babeș-Bolyai University in Cluj-Napoca in\n1993\n. The regional Romanian school mathematics and computer science competition is now named the 'Marian Țarină competition'.",
  "matematicos_citados_na_biografia": [
    "Bolyai",
    "János Bolyai",
    "Gheorghe Vrănceanu",
    "Benjamin Fedorovich Kagan",
    "Vrănceanu",
    "Algebraic Topology",
    "Lie Groups",
    "Riemann",
    "Finsler",
    "Lie",
    "Janos Bolyai"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}