{
  "nome_completo": "Marshall Hall Jr",
  "nome_curto": "Marshall Hall Jr",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hall_Marshall/",
  "data_nascimento": "17 September 1910",
  "local_nascimento": "St Louis, Missouri, USA",
  "data_morte": "4 July 1990",
  "local_morte": "London, England",
  "summary": "Marshall Hall, Jr was an American mathematician who made important contributions to group theory and combinatorics.",
  "biografia": "Marshall Hall Jr\n's parents were Marshall Hall and Inez Bethune. Marshall Hall Sr. was educated in private schools in Kentucky and was first employed by the Chesapeake & Ohio Railroad Company. He took up employment with the W L Green Commission Company, an old and prominent grain company of St Louis, in\n1894\nand he married Inez Bethune on\n27\nApril\n1897\nin St Louis. They had four children: Sydnor. Bethune, Marshall, Jr\n(\nthe subject of this biography\n)\n, and Inez. Marshall Hall Sr. worked his way up to become president of the W L Green Commission Company in\n1903\n. In\n1915\nthe company was renamed the Marshall Hall Grain Company, with Marshall Hall Sr. as its president. Marshall Hall Jr showed talent for mathematics at a young age for, at age eleven, he constructed a seven-place table of logarithms for the positive integers up to\n1000\n. A year later he felt that mathematics was his subject when\n[\n6\n]\n:-\n... my history teacher dismissed my ideas as erroneous while my mathematics teacher listened and even agreed.\nHis high school studies were at the St Louis Country Day School. This school, founded in\n1917\n, had only been open for a few years when he began studying there. The school was outside the city, in a rural setting, reached by electric streetcar. Marshall was taught mathematics by a good teacher although he was not a mathematician, being employed as a German teacher. While he was at this school Marshall's father died and, although the family had been very well off, the death of his father meant not only sadness at the loss, but also that the family were now in a poorer financial position.\nHe entered Yale as an undergraduate and there he took many advanced courses in topics such as calculus of variations and algebraic numbers. He did not study only science subjects at Yale, however, also taking classics courses. He graduated with a B.A. in\n1932\nhaving won a prize in ever one of his years at university. In his final year at Yale he applied to the Charles and Julia Henry Fund for a Henry Fellowship to enable him to undertake graduate studies abroad. This Fellowship was to fund one year of study at Oxford or Cambridge in England. He won the Fellowship and spent the year\n1932\n-\n33\nworking with\nG H Hardy\nat Trinity College, Cambridge.\nAt Cambridge he was taught by several mathematicians who were to have an important influence on him such as\nPhilip Hall\n,\nHarold Davenport\nand\nG H Hardy\n. He wrote his first paper\nQuadratic residues in factorization\nwhich he submitted to the\nBulletin\nof the\nAmerican Mathematical Society\nin March\n1932\n. While he was at Cambridge,\nG H Hardy\nhelped him edit the paper which was published in\n1933\n. Hall writes in the Introduction:-\nThe purpose of this paper is to establish a certain theorem which is useful in the factorization of large numbers.\nHall would have liked to continue to undertake graduate work at Cambridge but since the fellowship was only for one year and his family could not support him financially, he applied for actuarial positions back in the United States. He was offered a position with an insurance company in St Louis which he accepted and began to take actuarial examinations so that he might qualify as an actuary. In the spring of\n1934\nhe received two offers on consecutive days. One was for a position he had applied for at the Metropolitan Life Insurance Company while the other was the offer of a fellowship at Yale for graduate work, for which he had not applied. He accepted the offer of a fellowship at Yale and he was awarded his doctorate in\n1936\nfor his thesis\nAn Isomorphism Between Linear Recurring Sequences and Algebraic Rings\n. His official thesis advisor was\nØystein Ore\nbut he received a great deal of help and advice from Howard Theodore Engstrom\n(1902\n-\n1962)\n.\nAfter the award of his Ph.D., Hall spent the year\n1936\n-\n37\nat the Institute for Advanced Study at Princeton. he wrote in\n[\n6\n]\n:-\nFortunately\nG H Hardy\nalso spent the year\n1936\n-\n37\nat the Institute and I helped edit his 'Lectures on Ramanujan'. This was very inspiring and among other things got me into analytic number theory. I got to know\nJohn von Neumann\nvery well and attended his lectures on regular algebras and their associated geometric systems. He did not take well to my suggestion of calling them \"pointless algebras.\" I made the acquaintance of\nHermann Weyl\n,\nJ H M Wedderburn\n,\nMarston Morse\n,\nOswald Veblen\nand other luminaries. We shared space in Fine Hall with the Mathematics Department. I lived in the Graduate College within easy walking distance of everything that mattered.\nWhile at the Institute for Advanced Study, Hall received offers of an Instructorship in Mathematics from Columbia University and a similar offer from Yale University. He accepted Yale and began working there in the autumn of\n1937\n. He was made a fellow of Silliman College and lived in rooms in the College. Up to this time he had not been involved in research in\ngroup theory\nbut it was at this stage in his career that his interest in this topic began, prompted by\nØystein Ore\n. He also became interested in projective geometry and began a major study of projective planes. He presented his work to the\nAmerican Mathematical Society\nin September\n1940\n.\nAnother fellow of Silliman College was Judge Charles Edward Clark\n(1889\n-\n1963)\nwho had been Dean of the Yale Law School from\n1929\nto\n1939\n. He had married Dorothy E Gregory and Hall met their daughter Sally at a Silliman College picnic. They were married in June\n1942\n. However, the Japanese attack on Pearl Harbor in December meant that the United States entered World War II and, as a consequence, Hall's life over the next few years was very different. With the United States now at war, Hall joined Naval Intelligence and was involved, as were many other mathematicians, deciphering Japanese coded messages and deciphering German Enigma codes. This work was little known about at the time but it has since emerged how significant this work proved to be. Hall's work in this area remained covered by the Official Secrets Act and when I\n[\nEFR\n]\nwas in a group talking to him in\n1981\nabout such things, he made it clear how seriously he continued to take his signing of the Act. Hall spent six months at Bletchley Park, the centre for British Intelligence, during\n1944\n. At Bletchley\n[\n6\n]\n:-\n... there was a galaxy of mathematical talent including\nHugh Alexander\nthe chess champion and\nHenry Whitehead\nthe eminent topologist and Waynflete Professor at Magdalen College, Oxford.\nHall's\n48\n-page paper\nProjective planes\nwas published in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1943\n. In it he states:-\nThe author has made an attempt to investigate projective planes as systematically as possible. A considerable portion of these investigations is not included here either because of the incomplete and unsatisfactory nature of the results or because of lack of generality. War duties have forced the postponement of the completion of this work.\nAfter World War II, Hall returned to Yale where he taught until\n1946\n. However he discovered that the atmosphere at Yale was rather unpleasant and his association with\nØystein Ore\nwas making his position almost untenable\n[\n6\n]\n:-\n... there was a feud between\nØystein Ore\nand\nEinar Hille\n, who had married\nOre\n's sister.\nOre\nwas the Sterling Professor and nothing could be done to him. But his enemies took it out on me, saying that in no circumstances could I be promoted and given tenure. One of the enemies, Nelson Dunford, made the amazing statement that my 'Projective Planes' paper was so good that he doubted that I could write another good paper.\nHall, therefore, accepted an appointment as an associate professor at Ohio State University and began teaching there in the autumn of\n1946\n.\nSaunders Mac Lane\nhad recommended Hall to\nTibor Radó\n, the chairmen of the Ohio State Mathematics Department, who treated him very well. He was promoted to full professor at Ohio in\n1948\nand remained there until\n1959\n. While on the faculty at Ohio he was awarded a Guggenheim Fellowship which enabled him to spend the year\n1956\nat Trinity College, Cambridge. There he and his family\n(\nby this time Hall had two young sons\n)\nlived in\nLouis Mordell\n's home. Hall is best known as a group theorist, perhaps because of his famous book\nTheory of Groups\n(1959)\nfrom which several generations of group theorists have learnt the subject. He was writing this book during his year in Cambridge and\nPhilip Hall\nread his manuscript and made many helpful suggestions.\nYou can read short extracts from several reviews of this important book at\nTHIS LINK\nIn\n1959\nhe accepted a post at California Institute of Technology at Pasadena. He hosted a 'Conference on Group Theory' there in\n1960\n. In the following year, he was involved in a joint project with NASA's Jet Propulsion Laboratory to construct a special\nHadamard\nMatrix\n[\n4\n]\n:-\nIn\n1961\n, mathematicians from NASA's Jet Propulsion Laboratory and Caltech worked together to construct a\nHadamard\nMatrix containing\n92\nrows and columns, with combinations of positive and negative signs. In a\nHadamard\nMatrix, if you placed all the potential rows or columns next to each other, half of the adjacent cells would be the same sign, and half would be the opposite sign. This mathematical problem had been studied since about\n1893\n, but the solution to the\n92\nby\n92\nmatrix was unproven until\n1961\nbecause it required extensive computation.\nHall spent time at the University of Warwick Group Theory year in August\n1967\nand, while in England, visited\nPhilip Hall\nin Cambridge. It was at this time that he was able to confirm the existence of a simple group of order\n604\n,\n800\nwhich had been predicted by Zvoninir Janko. This group is now known as the Hall-Janko group. He published his findings in the paper\nA search for simple groups of order less than one million\npresented to the conference 'Computational Problems in Abstract Algebra' held in Oxford\n29\nAugust to\n2\nSeptember\n1967\n. He writes:-\nVery recently Z Janko announced that a simple group with certain properties would have order\n604\n,\n800\nand have a specific character table. The construction of a simple group of order\n604\n,\n800\nis given for the first time in this paper. ... The construction of the simple group of order\n604\n,\n800\nwas carried out in August\n1967\nat the University of Warwick and at Cambridge University. Mr Peter Swinnerton-Dyer was extremely helpful in writing on short notice a program for the Titan computer at Cambridge which finally confirmed the correctness of the construction.\nIt is worth noting that Janko's 'specific character table' for the group was shown to be in error by\nWalter Feit\n. The uniqueness of the simple group of this order was proved in Hall's paper, written jointly with David Wales,\nThe simple group of order\n604\n,\n800\n(1968)\n. We should go back a little at this point and look at some of Hall's other contributions to group theory. Perhaps his best known result in group theory is his solution of the\nBurnside problem\nfor groups of exponent\n6\n. He showed that a finitely generated group in which the order of every element divides\n6\nmust be finite. He outlined his proof in\nSolution of the Burnside problem of exponent\n6\n(1957)\nand gave full details in the\n22\n-page paper\nSolution of the Burnside problem of exponent six\n(1958)\n. Around this time he also was involved in advising\nJohn Thompson\n[\n6\n]\n:-\nJohn Thompson\n, then a graduate student at the University of Chicago, persuaded\nSaunders Mac Lane\nto invite me to talk on this subject\n[\nhis solution of the\nBurnside\nproblem for exponent\n6]\n. From then on\nJohn Thompson\ncame to Columbus to work with me on a Ph.D. topic. I gave him the problem to prove that a group with an automorphism of prime order p fixing only the identity was necessarily nilpotent. This he did in fairly short order. It was an all or nothing assignment and never again have I given such an assignment. John's genius was soon recognised ...\nIn collaboration with James Senior, Hall published\nThe Groups of Order\n2\nn\n(\nn\n≤\n6\n)\n2^{n} (n ≤ 6)\n2\nn\n(\nn\n≤\n6\n)\nin\n1964\n.\nOlga Taussky-Todd\nexplains the background to this work\n[\n12\n]\n:-\nThe work was originally started separately by Senior\n(\na chemist\n)\nand\nP Hall\n. Their later collaboration was interrupted by the war. When\nP Hall\nfound himself unable to return to the plan, M Hall, Jr used his wide experience in group theory to fill his place and to explain the theoretical background of the construction.\nYou can read short extracts from several reviews of this important book at\nTHIS LINK\nAs well as the results on finite projective planes, Hall did other work of fundamental importance in the area of combinatorics, in particular on block designs. He wrote another classic text\nCombinatorial Theory\nin\n1967\n. Giuseppe Pellegrino writes in a review that the book is:-\n... a reference point for those interested in combinatorics, both for the selection of the topics - fruit of a deep knowledge of the field - and for the clearness of exposition that makes the reading agreeable.\nYou can read short extracts from several reviews of this important book at\nTHIS LINK\nThis, and other contributions by Hall are mentioned by\nHans Zassenhaus\nin\n[\n14\n]\n:-\nThe group theoretic collection process of\nPhillip Hall\n(\nno relation\n)\ninspired Marshall Hall to the construction of a basis for free\nLie\nrings and higher commutators in free groups ... with great potential for further research ... The book on 'Combinatorial Theory'\n(1967\nand\n1986)\nsummarizes his research achievements in combinatorics, in particular his deep results on combinatorial designs, and provides a new chart for an ancient branch of mathematics.\nIn\n1973\nHall was named IBM Professor at CalTech but, in\n1977\n, he arranged for his appointment at CalTech to be half-time so that he could spend time in other institutions. He was a Visiting Fellow at Merton College, Oxford in\n1977\n, and at Technion, Haifa in\n1980\n. He retired from CalTech in\n1981\nand, in the following year, accepted a post as Visiting Professor at Emory University in Atlanta. He was also a Visiting Professor at the University at Santa Barbara in\n1984\n-\n85\n. Although up to this time he had kept his home in Pasadena, he moved to Atlanta in\n1985\n. By this time he was on his own, having been divorced in\n1981\n.\nAmong the honours Hall received were two Guggenheim Fellowships and membership of the\nAmerican Academy of Arts and Sciences\n. He also received honorary degrees from Emery and from Ohio. The Marshall Hall Conference was held at the University of Vermont, Burlington, Vermont, September\n13\n-\n18\n,\n1990\n. The Preface to the Proceedings explains how it honours Marshall Hall, Jr:-\nFrom September\n13\nthrough September\n18\n,\n1990\n, the 'Marshall Hall Conference on coding theory, design theory and group theory' was held on the campus of the University of Vermont. The multidisciplinary nature of this conference offered the\n190\nparticipants a unique opportunity to interact and discuss ideas with other researchers in these various areas. To our knowledge this is the only conference that has specifically focussed on these interrelated and very active topics of research. This book is not only the proceedings of this conference but is a tribute to one of the finest mathematicians of this century. The original impetus for the conference was to celebrate the\n80\nth\nbirthday of Marshall Hall. With his untimely death on July\n4\n,\n1990\n, the meeting became a memorial conference to honour the man and his lifetime contribution to mathematics.",
  "matematicos_citados_na_biografia": [
    "G H Hardy",
    "Philip Hall",
    "Harold Davenport",
    "American Mathematical Society",
    "Øystein Ore",
    "John von Neumann",
    "Hermann Weyl",
    "J H M Wedderburn",
    "Marston Morse",
    "Oswald Veblen",
    "group theory",
    "Hugh Alexander",
    "Henry Whitehead",
    "Einar Hille",
    "Ore",
    "Saunders Mac Lane",
    "Tibor Radó",
    "Louis Mordell",
    "THIS LINK",
    "Hadamard",
    "Walter Feit",
    "Burnside problem",
    "John Thompson",
    "Burnside",
    "Olga Taussky-Todd",
    "P Hall",
    "Hans Zassenhaus",
    "Phillip Hall",
    "Lie",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}