{
  "nome_completo": "Johann Christian Martin Bartels",
  "nome_curto": "Martin Bartels",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bartels/",
  "data_nascimento": "12 August 1769",
  "local_nascimento": "Brunswick, Brunswick-Lüneburg, Germany",
  "data_morte": "20 December 1836",
  "local_morte": "Dorpat, now Tartu, Estonia",
  "summary": "Martin Bartels was a German mathematician best known as the teacher of Gauss and Lobachevsky.",
  "biografia": "Martin Bartels\n' parents were Johanna Christine Margarethe Köhler and Heinrich Elias Friedrich Bartels whose family can be traced back in Brunswick into the late seventeenth century. Heinrich Bartels was a pewterer, making plates and vessels for household use from pewter, an alloy of tin with lead or copper. However, by the time his son Martin was born, the market for pewter had dropped markedly as earthenware and porcelain products took over. The Bartels lived in Brunswick, which today is the city of Braunschweig in Germany, and their home was on the Wendengraben\n(\ntoday Wilhelmstrasse\n)\nbeside a canal of the same name. Martin Bartels showed a considerable interest in mathematics as a young boy but, in\n1783\n, at the age of fourteen, he was employed as an elementary school teacher in the Katherinen-Volksschule which was close to his home. There he was an assistant to the teacher Büttner and soon Bartels began to teach a young boy who, like him, lived on the Wendengraben. That young boy was\nCarl Friedrich Gauss\nwho began to study at the Katherinenschule in\n1784\n.\nE T Bell\nwrites\n[\n3\n]\n:-\nBy lucky chance the schoolmaster\n[\nBüttner\n]\nhad an assistant, Johann Martin Bartels, a young man with a passion for mathematics, whose duty it was to help the beginners in writing and cut their quill pens for them. Between the assistant of seventeen and the pupil of ten\n[\nGauss\n]\nthere sprang up a warm friendship which lasted out Bartels' life. They studied together, helping one another over difficulties and amplifying proofs in their common textbook on algebra and the rudiments of analysis. Out of this early work developed one of the dominating interests of\nGauss\n's career\n[\nalgebra\n]\n. ... Bartels did more for\nGauss\nthan to induct him into the mysteries of algebra. The young teacher was acquainted with some of the influential men of Brunswick. He now made it his business to interest these men in his find\n[\nGauss\n]\n.\nIn particular Bartels informed Eberhard August Wilhelm Zimmermann\n(1743\n-\n1815)\nwho had been professor of mathematics, physics and natural history at the Collegium Carolinum in Brunswick since\n1766\n. This was extremely valuable for the young\nGauss\n, but this remarkable meeting of minds between\nGauss\nand his young teacher Bartels led to Bartels becoming determined to pursue his study of mathematics. We should note, however, that in\n[\n8\n]\nDick puts forward a view different from the accepted one which we have given above. He suggests that Bartels had higher tasks to do than to teach calculation at the school, that it is uncertain whether Bartels taught\nGauss\ncalculation, and that it is unclear whether Bartels used his influence to help\nGauss\nfurther his education in other establishments.\nBartels' association with the Collegium Carolinum was formal from\n23\nAugust\n1788\nwhen he became a visitor there. Then, on\n23\nOctober\n1791\n, he entered the University of Helmstedt where he studied under the professor of mathematics\nJohann Friedrich Pfaff\n. He then moved to the University of Göttingen where his teachers included\nAbraham Gotthelf Kästner\n, the professor of mathematics and physics. However, mathematics was not the only subject that Bartels studied, for in the winter semester of\n1793\n-\n4\nhe studied Experimental Physics, Astronomy, Meteorology and Geology.\nIn\n1800\n, Bartels was appointed to teach mathematics in Reichenau, a Swiss town close to the city of Chur. He met Anna Magdalena Saluz from Chur and they were married in\n1803\n; their daughter Johanna Henriette Francisca Bartels\n(\nborn\n1807)\nmarried the astronomer Wilhelm Struve in February\n1835\n. However, in\n1801\nBartels had moved to Aarau in the north of Switzerland where he taught at the cantonal school. From\n1803\nhe was back in Germany teaching at the University of Jena and while there, in\n1807\n, he received an invitation from Stepan Rumowski to be the Professor of Mathematics at the Kazan State University. This university had been founded in\n1804\n, the result of one of the many reforms of the Russian emperor Alexander I, and it opened in the following year. Rumowski was responsible for setting up the university and most of the professors he had invited to go there were from Germany. Bartels took up his post at professor of mathematics at Kazan in\n1808\nand, during the following twelve years, he lectured on the History of Mathematics, Higher Arithmetic, Differential and Integral Calculus, Analytical Geometry and Trigonometry, Spherical Trigonometry, Analytical Mechanics and Astronomy. Vinberg\n[\n15\n]\nwrites:-\nIn the first years the atmosphere in the Department was quite favourable. The students were full of enthusiasm. They studied day and night to compensate for lack of knowledge. The professors, mainly invited from Germany, turned out to be excellent teachers, which was not common.\nIn\n1808\nNikolai Ivanovich Lobachevsky\nhad the good fortune to study with Bartels at Kazan University not long after he took up his post there. Not only did Bartels assist\nLobachevsky\nwith his studies, but he also looked after his young student, supporting him when he got into trouble with the authorities\n(\nwhich happened quite often!\n)\nWhen\nLobachevsky\nwas due to graduate it was Bartels who spent three days lobbying the other professors to award him a Master's degree. The university authorities did not want to give\nLobachevsky\na degree at all because of his poor behaviour. Bartels won the argument and\nLobachevsky\nwas awarded a Master's Degree. After graduating in\n1811\n,\nLobachevsky\nremained in Kazan to study with Bartels who guided his reading of\nGauss\n's\nDisquisitiones Arithmeticae\nⓉ\n(\nInvestigations in arithmetic\n)\nand\nLaplace\n's\nMécanique Céleste\nⓉ\n(\nCelestial Mechanics\n)\n. In\n1814\nit was mainly due to Bartels that\nLobachevsky\nwas appointed as an assistant professor. We should note that\nLobachevsky\ntook Bartels' course on the History of Mathematics which, following\nMontucla\n, considered in detail\nEuclid\n's\nElements\nand his theory of parallel lines. It was this course which made\nLobachevsky\nthink about non-euclidean geometry.\nWhen Bartels was about to leave Kazan in\n1820\nhe wrote about his time there, giving a similar impression to that in Vinberg's quote above\n[\n2\n]\n:-\nI was very glad to find there\n[\nKazan\n]\n, in spite of the small number of students, a lot of enthusiasm for the study of the mathematical sciences. In my lectures on higher analysis I might have at least twenty listeners, so little by little a small mathematical school has arisen.\nIn\n1821\nBartels moved to the university in Dorpat\n(\nnow Tartu in Estonia\n)\n. Dorpat had been part of Poland, then of Sweden but in\n1704\nit was annexed to Russia by Peter the Great. The University of Dorpat had been founded in\n1632\nby Gustavus II Adolphus of Sweden in\n1632\n. However it closed in\n1710\nand remained empty for almost\n100\nyears before reopening in\n1802\nas the Kaiserliche Universität zu Dorpat. Bartels founded the Centre for\nDifferential Geometry\nat Dorpat, and remained there until his death in\n1836\n.\nBartels made most of his contributions to mathematical research after being appointed to the University of Kazan. However, he did not publish his discoveries until after he moved to Dorpat and even then he did not publish them all. Some we only know of because his students included the results in their own work acknowledging that Bartels had given them in his lecture courses. One such result is the famous\nFrenet\n-\nSerret\nformulas that were discovered first by Bartels. He introduced the method of moving trihedrons. To each point of a space curve Bartels associated a trihedron, which later became called the\nFrenet\ntrihedron, and Bartels obtained the formulas now known as the\nFrenet\n-\nSerret\nformulas. We only know of this since they were published in a prize work by his student Carl Eduard Senff in\nPrincipal theorems of the theory of curves and surfaces\nin\n1831\n, with due acknowledgement to Bartels.\nFrenet\ngave six of the formulas in\n1847\nand later\nSerret\ngave all nine.\nLet us note that Bartels corresponded with\nGauss\nfrom the time that he was working in Switzerland. The correspondence continued through the years that he worked in Kazan and during the first few years that he was in Dorpat. After\nGauss\nbecame famous, a joke went round that Bartels was the best mathematician in Germany because\nGauss\nwas the best mathematician in the world.\nA couple of years after Bartels moved to Dorpat, he became a Privy Councillor in\n1823\n. He was honoured with election to the\nSt Petersburg Academy of Sciences\n.",
  "matematicos_citados_na_biografia": [
    "Carl Friedrich Gauss",
    "E T Bell",
    "Gauss",
    "Johann Friedrich Pfaff",
    "Abraham Gotthelf Kästner",
    "Nikolai Ivanovich Lobachevsky",
    "Lobachevsky",
    "Laplace",
    "Montucla",
    "Euclid",
    "Differential Geometry",
    "Frenet",
    "Serret",
    "St Petersburg Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}