{
  "nome_completo": "Martin Gardner",
  "nome_curto": "Martin Gardner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gardner/",
  "data_nascimento": "21 October 1914",
  "local_nascimento": "Tulsa, Oklahoma, USA",
  "data_morte": "22 May 2010",
  "local_morte": "Norman, Oklahoma, USA",
  "summary": "Martin Gardner was an American popular mathematics and science writer who had a long-running column on mathematical recreations in Scientific American .",
  "biografia": "Martin Gardner\n's father was a geologist, with a Ph.D. in geology, who dug for fossils for the Smithsonian Institution before starting up his own very small oil company. While he was still working for the Smithsonian Institution, he often took his young son Martin on his digs. Martin's mother was a primary school teacher in Lexington before her marriage but, once the children were born, she stayed at home to look after them - she did, however, keep up her hobby of painting. Martin was the oldest of his parents' three children having a younger brother Jim and sister Judith. The family were well-off, the oil business being highly lucrative, and they even had their own tennis court by the time Martin was old enough to begin playing. Before he entered primary school, Martin had learnt to read\n[\n2\n]\n:-\nMy mother read 'The Wizard of Oz' to me when I was a little boy, and I looked over her shoulder as she read it. I learned how to read that way.\nToday Gardner is famed for mathematical puzzles, many would say that he is the most famous modern writer of mathematical puzzles in the world, and this interest in puzzles came early in his life when his father gave him a copy of\nSam Loyd\n's\nCyclopedia of Puzzles\n. One of his early interests was magic and this led to his first publication\nNew Color Divination\nin\nThe Sphinx\n, a magic magazine, in May\n1930\nwhen he was still a high school student. His achievements at high school were mixed\n[\n2\n]\n:-\nI was very good at math in high school. In fact, it and physics were the only subjects in which I got good grades. I was bored to death by the other classes. I flunked a class in Latin and had to take it over. I just don't have a good ear for languages.\nIn particular, his high school mathematics teacher, Pauline Baker, gave him a love for deductive reasoning while he thought that his physics teacher, M E Hurst, was most inspiring teacher in the school. After graduating from high school, Gardner wanted to study physics at the California Institute of Technology. However, the entrance requirements were two years at College so Gardner went to the University of Chicago with the intention of moving to Cal. Tech. after two years. However, he became fascinated with philosophy and stayed at Chicago to major in that subject. He graduated from Chicago with a B.A. in\n1936\nbut this was a difficult time to get a job since it was the height of the Depression\n[\n2\n]\n:-\nI had various jobs. I worked as a caseworker for the Chicago Relief Administration. I had to visit\n140\nfamilies regularly in what was called the Black Belt. I also had several odd jobs: waiter, soda jerk, etc.\nHe also worked for a while as a reporter for the\nTulsa Tribune\nbut his last job before the United States entered World War II in December\n1941\nwas as a public relations officer at the University of Chicago. He enlisted in the Navy and spent a year at Madison, Wisconsin, working at a radio training school before spending three years on the USS Pope, a destroyer escorting convoys across the Atlantic. When the war ended he returned to Chicago and sold his first short story to\nEsquire Magazine\n. Realising he could support himself by writing, he did not go back to his public relations job\n(\nalthough this would have been possible\n)\n. At this time, however, he was still greatly interested in philosophy and made use of the G.I. Bill to spend a year taking graduate courses at the University of Chicago, in particular one on the philosophy of science given by Rudolph Carnap. As well as writing for\nEsquire Magazine\nhe also wrote for the children's magazine\nHumpty Dumpty\n.\nGardner moved to New York in\n1947\nand continued to earn a living contributing articles and becoming an editor of\nHumpty Dumpty\n. He married Charlotte Greenwald in\n1952\n; they had two sons, Jim and Tom. In the same year of\n1952\nhe published his first book\nIn the Name of Science\nwhich was republished as a paperback in\n1956\nunder the title\nFads and Fallacies in the Name of Science\n. Another of his books\nMathematics, Magic and Mystery\nwas published in\n1956\n. Gardner writes in the Preface:-\nThe classic reference work of\nW W Rouse Ball\n, namely 'Mathematical Recreations and Essays', contains many early examples of mathematical conjuring. ... The present book represents the first attempt to survey the entire field of modern mathematical magic. ... Its principles can be grasped quickly, without training in higher mathematics.\nIn December\n1956\nhe had his first article, which was on hexaflexagons, published by\nScientific American\n. The publisher liked the article a lot and asked Gardner if he thought a regular column would be possible. Quickly Gradner agreed to produce 'Mathematical Games', resigned from his editorial role with\nHumpty Dumpty\nand had his first column in the January\n1957\nissue of\nScientific American\n. From that point on he produced the monthly 'Mathematical Games' column for twenty-five years.\nHis books have also had a huge impact on popularising mathematics. He has written over sixty hardback books as well as numerous pamphlets of around\n50\npages. We certainly do not want to even list the titles of over sixty works so we will give a selection:\nLogic Machines and Diagrams\n(1958)\n;\nThe Annotated Alice\n(1960)\n;\nRelativity for the Million\n(1962)\n;\nThe Ambidextrous Universe: Mirror Asymmetry and Time-Reversed Worlds\n(1964)\n;\nMathematical Carnival: A New Round-up of Tantalizers and Puzzles from \"Scientific American\"\n(1975)\n;\nThe Incredible Dr Matrix\n(1976)\n;\nAha! Insight\n(1978)\n;\nScience: Good, Bad, and Bogus\n(1981)\n;\nAha! Gotcha: Paradoxes to Puzzle and Delight\n(1982)\n;\nThe Whys of a Philosophical Scrivener\n(1983)\n;\nCodes, Ciphers and Secret Writing\n(1984)\n;\nEntertaining Mathematical Puzzles\n(1986)\n;\nTime Travel and Other Mathematical Bewilderments\n(1987)\n;\nPerplexing Puzzles and Tantalizing Teasers\n(1988)\n;\nFractal Music, Hypercards and More\n(1991)\n;\nMy Best Mathematical and Logic Puzzles\n(1994)\n;\nClassic Brainteasers\n(1995)\n;\nCalculus Made Easy\n(1998)\n;\nA Gardner's Workout: Training the Mind and Entertaining the Spirit\n(2001)\n;\nMathematical Puzzle Tales\n(2001)\n; and\nBamboozlers\n(2008)\n.\nIn\n1981\n, to celebrate Gardner's sixty-fifth birthday, the book\nThe Mathematical Gardner\nwas published. The editor, David A Klarner, writes in the Preface:-\nThis volume is dedicated to Martin Gardner for his\n65\nth\nbirthday,\n21\nOctober\n1979\n. His relationship to the mathematical community makes him unique: Gardner's monthly column in 'Scientific American' has been appearing for more than two decades. These columns together with some of his books\n(\nnot all of them limited to mathematics\n)\nhave presented a popular account of some of the recent developments in modern mathematics. More than just a reporter or popularizer, his correspondence with his readers makes him a 'mathematical Gardener'. This phrase describes his cultivation and propagation of ideas - an activity exemplified by Doris Schattschneider's article in this volume, 'In praise of amateurs'. Very few people in the general population who are capable of understanding and enjoying the beauty of mathematics actually get the opportunity to do so. Martin Gardner's writing has contributed enormously to improve the accessibility of the subject. The authors of this book together with a larger group of fans praise and thank him.\nFor many years the Gardner family lived on Euclid Avenue\n(\neveryone remarks on the apt address\n)\nin Hastings-on-Hudson, New York, but in\n1979\nthey moved to Hendersonville, North Carolina. At this time Gerdner was sixty-five years old and considered that it was time to retire. He continued to produce the 'Mathematical Games' column in\nScientific American\nuntil\n1981\nwhen he retired from that role. However, he remained extremely active in producing books, in fact his main motivation in giving up the column was to give him more time to devote to writing books. In\n2000\n, his wife Charlotte died and two years later he moved to Norman, Oklahoma to be near his son Jim who was Professor of Education at the University of Oklahoma.\nThe columns he wrote for\nScientific American\nhave been published as fifteen books. Let us quote Gardner's own words in the Preface to\nA Gardner's Workout: Training the Mind and Entertaining the Spirit\n(2001)\n:-\nFor\n25\nyears I had the honour and pleasure of writing the 'Mathematical Games' column in 'Scientific American'. All those columns have now been reprinted, with updating, in fifteen volumes, starting\n[\nin\n1959]\nand ending with\n[\nThe last recreations,\n1997]\n. Since I stopped writing the column I have from time to time contributed articles and book reviews about mathematics to both academic journals and popular magazines. Forty-one of these pieces are gathered here. The most controversial is the final review in which I criticize a current teaching fad known as the 'new new math'. By the time this book is published I would guess and hope that new new math is being abandoned almost as rapidly as the old new math faded. I could be wrong. In any case, it may be decades before our public education is able to attract competent teachers who have learned how to teach math to pre-college students without putting them to sleep. There are, of course, many teachers who deserve nothing but praise. It is to them I have dedicated this book.\nThe\nAmerican Mathematical Society\nawarded Gardner the Leroy P Steele prize at the summer meeting in Salt Lake City in\n1987\n[\n1\n]\n:-\n... for his many books and articles on mathematics and particularly for his column \"Mathematical Games\" in 'Scientific American'.\nThe citation continues\n[\n1\n]\n:-\nMartin Gardner has introduced generations of readers to the intellectual excitement, the wonder, the variety, and the sheer fun of mathematics and mathematical ways of thought. With Dr Matrix and his other friends, he has exposed spurious thinking and misuse of mathematics in areas from numerology to economics. Martin Gardner has captured the attention of his readers, obtained their active involvement, and stretched their minds to an extent which is the envy of all of us who teach.\nIn his response, Gardner said\n[\n1\n]\n:-\nHad I not developed a strong interest in philosophy when I was an undergraduate at the University of Chicago, I might have majored in mathematics, become a professional, and perhaps made some contributions to the field. As it happens, I had no formal training in mathematics, only an amateur's passion for its marvels, and admiration and awe for its leaders. I think of myself as like a person who loves classical music, but whose talents never advanced beyond playing simple tunes on a musical saw. There is no better way to teach oneself mathematics than to write about it. Every column I completed for 'Scientific American' was a learning experience that gave me intense pleasure. If I have been able to convey to others something of the fascination of mathematics, it is because I did not know enough to write about it on a technical level. ... To be given the Steele Prize is the greatest honour I can imagine myself receiving.\nLet us end by noting that Gardner has produced a number of mathematical papers, written with leading mathematicians. He said\n[\n3\n]\n:-\nI enjoy mathematics so much because it has a strange kind of unearthly beauty. There is a strong feeling of pleasure, hard to describe, in thinking through an elegant proof, and even greater pleasure in discovering a proof not previously known. On a low level I have experienced such a pleasure four times.\n(1)\nI discovered the minimum number of acute triangles into which a square can be dissected.\n(\nCoxeter\nincludes the dissection in his classic, 'Introduction to Geometry'.\n)\n(2)\nI found a minimal network of\nSteiner\ntrees that join all the corners of a chessboard.\n(3)\nI constructed a bicolour proof that every serial isogon of\n90\ndegrees - a polygon with all right angles, and sides in\n1\n,\n2\n,\n3\n... sequence - must have a number of sides that is a multiple of\n8\n.\n(4)\nI devised a novel way to diagram the propositional calculus.\nThe results Gardner mentions here under\n(2)\nappear in the paper \"\nFan Chung\n, Martin Gardner and\nRon Graham\n, Steiner trees on a checkerboard,\nMath. Mag\n.\n62\n(1989)\n\". Ding Zhu Du writes:-\nThis is a very interesting article. It tells us what kind of\nSteiner\nminimum tree a checkerboard should have. The proof is left to the reader as an open problem. The\nSteiner\nminimum tree is the shortest network interconnecting the given points. A checkerboard of order\nn\nn\nn\nis the set of\nn\n2\nn^{2}\nn\n2\npoints which form an\nn\n×\nn\nn \\times  n\nn\n×\nn\nrectangular array. The connection pattern of the\nSteiner\nminimum tree for a checkerboard is quite complicated. However, the authors describe it very clearly with many nice pictures. It is amazing that the proof seems so hard. Every case except\nn\n=\n2\nn = 2\nn\n=\n2\nor\n3\nis only conjectured. Hopefully, a sequence of efforts will result from this article.\nThe result Gardner mentions under\n(3)\nappears in \"Lee Sallows, Martin Gardner, Richard Guy and\nDonald Knuth\n, Serial isogons of\n90\ndegrees,\nMath. Mag\n.\n64\n(1991)\n\". The authors write:-\nIn\n1988\nSallows devised a computer program to search a unit-square grid for closed paths with the following properties. The path starts along a lattice line with a segment of unit length, turns\n90\ndegrees in either direction, continues for\n2\nunits, turns again in either direction, continues for\n3\nunits, and so on. In other words, the segments of the path are in serial order\n1\n,\n2\n,\n3\n,\n.\n.\nN\n1, 2, 3, .. N\n1\n,\n2\n,\n3\n,\n.\n.\nN\n, with a right angle turn at the end of each segment. A path of\nN\nN\nN\nsegments - the number is of course the same as the number of turns or corners - is said to be a path of order\nN\nN\nN\n. If the path returns to its starting point, making a right-angle with its first segment, we call it a serial isogon of\n90\ndegrees. We prove that, for any\n90\n-degree serial isogon,\nN\nN\nN\nmust be a multiple of\n8\n.\nThree papers by Gardner which appear in\nThe College Mathematical Journal\nare\nModeling mathematics with playing cards\n(2000)\n,\nSome new results on magic hexagrams\n(2000)\n, and\nL-tromino tiling of mutilated chessboards\n(2009)\n.\nGardner has received a number of honours for his remarkable contributions including an honorary doctorate from Bucknell University in\n1978\nand the American Institute of Physics science writer of the year award for\n1983\n.",
  "matematicos_citados_na_biografia": [
    "Sam Loyd",
    "W W Rouse Ball",
    "American Mathematical Society",
    "Coxeter",
    "Steiner",
    "Fan Chung",
    "Ron Graham",
    "Donald Knuth"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}