{
  "nome_completo": "Mary Fairfax Greig Somerville",
  "nome_curto": "Mary Somerville",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Somerville/",
  "data_nascimento": "26 December 1780",
  "local_nascimento": "Jedburgh, Roxburghshire, Scotland",
  "data_morte": "29 November 1872",
  "local_morte": "Naples, Italy",
  "summary": "Mary Somerville wrote many works which influenced Maxwell. Her discussion of a hypothetical planet perturbing Uranus led Adams to his investigation. Somerville College in Oxford was named after her.",
  "biografia": "Mary Somerville\nwas the daughter of William George Fairfax and his second wife Margaret Charters. Mary Fairfax was born in the church manse in Jedburgh, the home of her mother's sister Martha Charters and Martha's husband Thomas Somerville. Mary's father was a naval officer, later Vice-Admiral Sir William George Fairfax, who was at sea at the time of her birth. Mary's mother had visited London from where her husband embarked on a long sea voyage. Margaret Fairfax broke her journey north at Jedburgh where Mary was born. The family home was in Burntisland in the county of Fife, Scotland.\nYou can see pictures of the house in Burntisland at\nTHIS LINK\n.\nMary was the fifth of seven children but three died very young. Of the four remaining children, Mary was brought up with her brother who was three years older than she was. A sister was born when Mary was seven, and a second brother when she was ten. The two brothers were given a good education but, in keeping with the ideas of the time, little need was seen to educate girls so Mary's parents saw no need to provide an education for their daughter. As a young child what little education she did receive was from her mother who taught her to read but it was not considered necessary to teach her to write. When Mary was ten years old she was sent to Miss Primrose's boarding school for girls in Musselburgh\n(\na few miles east of Edinburgh on the Firth of Forth\n)\n. Burntisland and Musselburgh are on opposite sides of the Firth of Forth, Burntisland on the north, Musselburgh on the south.\nThe school in Musselburgh neither gave Mary a happy time nor a good education. Anyway she spent only one year there and, on leaving felt\n(\nin her own words\n)\n(\nsee\n[\n1\n]\nor\n[\n3\n]\n)\n:-\n... like a wild animal escaped out of a cage.\nAfter this Mary returned to her home in Burntisland but she began to educate herself by reading every book that she could find in her home. Far from being encouraged in reading, members of her family such as her aunt criticised her for spending time on this unladylike occupation. In order that she might learn the correct skills for a young lady, Mary was sent to a school in Burntisland where she was taught needlework.\nHowever, one member of Mary's family did encourage her with her educational ambitions. When visiting her uncle in Jedburgh Mary told him that she had been teaching herself Latin. Far from being cross, her uncle encouraged her and the two would read Latin before breakfast while Mary stayed in the Jedburgh manse.\nWhen Mary was about thirteen, the family rented a house in Edinburgh where they spent the winter months, the summers being spent in Burntisland. Mary balanced her life between the social life expected of a young lady at this time and her own private study. She did learn many skills that were seen appropriate for a young lady. In addition to the needlework mentioned above, she learnt to play the piano and was given lessons in painting from the artist Alexander Nasmyth.\nIn fact it was through Nasmyth that Mary first became interested in mathematics. She overheard him explaining to another pupil that\nEuclid\n's\nElements\nformed the basis for understanding perspective in painting, but much more, it was the basis for understanding astronomy and other sciences. This comment was enough to start Mary on the road to study\nEuclid\n's\nElements\nwhich she did with the help of her younger brother's tutor.\nThere was another quite different reason why Mary became interested in studying algebra. She read an article on the subject in a woman's magazine belonging to a friend. Her younger brother's tutor was able to provide Mary with algebra texts and help introduce her to the subject. Mary became so engrossed in mathematics that her parents worried that her health would suffer because of the long hours of study that she put in, usually during the night. Her father believed\n(\nas was common at the time\n)\nthat\n[\n1\n]\n:-\n... the strain of abstract thought would injure the tender female frame.\nSocial life in Edinburgh was strongly encouraged, however, where Mary enjoyed\n[\n1\n]\n:-\n... parties, visits, balls, theatres, concerts, and innocent flirtations ...\nMary married Samuel Greig in\n1804\nwhen she was\n24\nyears old. Her husband was a naval officer who was a distant relation on her mother's side of the family\n(\nSamuel Greig's father was a nephew of Mary's maternal grandfather\n)\n. However Samuel was in the Russian navy and Mary's parents did not allow the marriage to take place until Greig received an appointment in London, for they did not want Mary to go to Russia. Mary and Samuel Greig went to London but Mary found that her husband did not understand her desires to learn. She later wrote\n(\nsee\n[\n1\n]\nor\n[\n7\n]\n)\n:-\nHe had a very low opinion of the capacity of my sex, and had neither knowledge of, nor interest in, science of any kind.\nSamuel Greig died\n3\nyears after the marriage. By this time Mary had given birth to two sons and on the death of her husband she returned to Scotland with them. She now had a circle of friends who strongly encouraged her in her studies of mathematics and science. In particular\nJohn Playfair\n, then professor of natural philosophy at Edinburgh, encouraged her and through him she began a correspondence with\nWilliam Wallace\n(\nPlayfair\n's former pupil\n)\nwho was then professor of mathematics at the Royal Military College at Great Marlow. In this correspondence they discussed the mathematical problems set in the\nMathematical Repository\nand in\n1811\nMary received a silver medal for her solution to one of these problems. At this time Mary also read\nNewton\n's\nPrincipia\nand, at\nWallace\n's suggestion,\nLaplace\n's\nMécanique Céleste\nand many other mathematical and astronomical texts.\nIn\n1812\nMary Greig married William Somerville who was an inspector of hospitals. William was the son of her aunt Martha and her husband Thomas Somerville in whose manse she had been born. Unlike her first husband, William was interested in science and also supportive of his wife's desire to study. At this time William and Mary lived in Edinburgh and, advised by\nWallace\n, Mary read the most advanced French texts of the day. In addition she studied botany and improved her knowledge of Greek. With her husband she studied geology and they moved in a close circle of friends that included\nPlayfair\n,\nLeslie\n, Sir William Scott, and the physicist David Brewster.\nIn\n1814\nMary's oldest daughter from her first marriage died at the age of nine and, in the same year, the only son of her second marriage died as a baby.\nWhen William Somerville was appointed as Inspector to the Army Medical Board in\n1816\n, the family moved from Edinburgh to London. Mary's husband was elected to the\nRoyal Society\nand Mary and William moved in the leading scientific circles of the day. Their friends included\nGeorge Airy\n,\nJohn Herschel\n,\nWilliam Herschel\n,\nGeorge Peacock\n, and\nCharles Babbage\n. Mary wrote\n[\n3\n]\n:-\nWe frequently went to see Mr\nBabbage\nwhile he was making his calculating machines.\nIn addition they met with leading European scientists and mathematicians who visited London. In\n1817\nWilliam and Mary visited Paris and were introduced to the leading scientists there by\nBiot\nand\nArago\n(\nwhom they had met in London\n)\n. Mary met\nLaplace\n,\nPoisson\n,\nPoinsot\n,\nÉmile Mathieu\nand many others. Returning to London, Mary and William lived in central London which enabled them to continue close contact with their many scientific friends. In\n1824\nWilliam was appointed as a physician at the Royal Hospital in Chelsea, and the family moved to Chelsea, then on the edge of London.\nMary Somerville published her first paper\nThe magnetic properties of the violet rays of the solar spectrum\nin the\nProceedings of the Royal Society\nin\n1826\n. The paper\n[\n13\n]\n:-\n... showed ingenuity in original speculation, and attracted much interest at the time, although the theory it propounded was subsequently negatived ...\nIn\n1827\nLord Brougham made a request on behalf of the Society for the Diffusion of Useful Knowledge for Mary Somerville to translate\nLaplace\n's\nMécanique Céleste\n. However Mary went far beyond a translation, for she explained in detail the mathematics used by\nLaplace\nwhich was unfamiliar to most mathematicians in England at that time. When completed, the work with title\nThe Mechanism of the Heavens\nwas far too large to be published by the Society for the Diffusion of Useful Knowledge and\nJohn Herschel\nrecommended its publication to the publisher John Murray. The book appeared in\n1831\nand was an immediate success both in terms of the number of copies sold and the praise given to it. Also in\n1831\nJames David Forbes, later to become the Principal of the University of St Andrews, was in London and wrote in his notebook his impressions of Mary:-\nBelow middle size, fair, countenance not particularly expressive except eyes which are piercing. Short-sighted. Manners the simplest possible. Her conversation very simple and pleasing. Simplicity not showing itself in abstaining from scientific subjects with which she is so well acquainted, but in being ready to talk on them all with the naiveté of a child and the utmost apparent unconsciousness of the rarity of such knowledge as she possesses, so that it requires a moment's reflection to be aware that one is hearing something very extraordinary from the mouth of a woman.\nMary Somerville spent about a year abroad in\n1832\n-\n33\n. Most of the time was spent in Paris where she renewed old friendships with the mathematicians there, and where she worked on her next book\nThe connection of the physical sciences\nwhich was published in\n1834\n. Her discussion of a hypothetical planet perturbing Uranus in the sixth edition\n(1842)\nof this work led\nAdams\nto his investigation and subsequent discovery of Neptune. Somerville wrote:-\nThose\n[\nthe tables\n]\nof Uranus, however, are already defective, probably because the discovery of that planet in\n1781\nis too recent to admit of much precision in the determination of its motions, or that possibly it may be subject to disturbances from some unseen planet revolving about the sun beyond the present boundaries of our system. If, after a lapse of years, the tables formed from a combination of numerous observations should be still inadequate to represent the motions of Uranus, the discrepancies may reveal the existence, nay, even the mass and orbit, of a body placed for ever beyond the sphere of vision.\nIn the\n8\nth\nedition Somerville wrote:-\nThat prediction has been fulfilled ... .\nAnother friend of the family was Lady Byron, by this time estranged from her husband Lord Byron, and her daughter\nAda Lovelace\n. Back in London, Mary helped Ada in her study of mathematics and provided strong encouragement to her.\nHonours now come quickly to Mary Somerville. She was elected to the\nRoyal Astronomical Society\nin\n1835\n(\nat the same time as\nCaroline Herschel\n)\n. She was elected to honorary membership of the Société de Physique et d'Histoire Naturelle de Genève in\n1834\nand, in the same year, to the\nRoyal Irish Academy\n. Sir Robert Peel, British prime minister from\n1834\n-\n35\nand again from\n1841\n-\n46\n, awarded her a civil pension of £\n200\nper annum, during his first period of office. This was increased to £\n300\nin\n1837\nby William Lamb,\n2\nnd\nViscount Melbourne\n(\nBritish prime minister from\n1835\n-\n41)\n.\nA letter which Mary wrote to\nArago\ncontained information important enough for him to have an extract from the letter published as a paper in\nComptes Rendus\nin\n1836\n. In\n1838\nWilliam Somerville's health deteriorated and the family went to Italy.\n(\nWilliam survived for\n22\nfurther years there.\n)\nMost of the rest of Mary's life was spent in Italy where she wrote many works which influenced\nMaxwell\n. Most important of her later publications was\nPhysical geography\nwhich was published in\n1848\n. It was her most successful text and used until the beginning of the\n20\nth\ncentury in schools and universities.\nMany further honours were given to Mary as a result of this publication. She was elected to the American Geographical and Statistical Society in\n1857\nand the Italian Geographical Society in\n1870\n. Also in\n1870\nshe received the Victoria Gold Medal of the Royal Geographical Society.\nMary Somerville was a strong supporter of women's education and women's suffrage. When John Stuart Mill, the British philosopher and economist, organised a massive petition to parliament to give women the right to vote, he had Mary put her signature first on the petition. Somerville College in Oxford was named after her in\n1879\nbecause of her strong support for women's education.\nMany tributes to Mary Somerville sum up her contribution. From\n[\n13\n]\n:-\nHer grasp of scientific truth in all branches of knowledge, combined with an exceptional power of exposition, made her the most remarkable woman of her generation.\nSir David Brewster, inventor of the kaleidoscope, wrote in\n1829\n(\nnine years before becoming Principal of the University of St Andrews\n)\nthat Mary Somerville was:-\n... certainly the most extraordinary woman in Europe - a mathematician of the very first rank with all the gentleness of a woman ... She is also a great natural philosopher and mineralogist.\nLet us end this biography with Mary Somerville's own words, written late in her life\n[\n3\n]\n:-\nSometimes I find\n[\nmathematical problems\n]\ndifficult, but my old obstinacy remains, for if I do not succeed today, I attack them again on the morrow.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Euclid",
    "John Playfair",
    "William Wallace",
    "Playfair",
    "Newton",
    "Wallace",
    "Laplace",
    "Leslie",
    "Royal Society",
    "George Airy",
    "John Herschel",
    "William Herschel",
    "George Peacock",
    "Charles Babbage",
    "Babbage",
    "Biot",
    "Arago",
    "Poisson",
    "Poinsot",
    "Émile Mathieu",
    "Adams",
    "Ada Lovelace",
    "Royal Astronomical Society",
    "Caroline Herschel",
    "Royal Irish Academy",
    "Maxwell"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}