{
  "nome_completo": "Matteo Ricci",
  "nome_curto": "Matteo Ricci",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ricci_Matteo/",
  "data_nascimento": "6 October 1552",
  "local_nascimento": "Macerata, Papal States (now Italy)",
  "data_morte": "11 May 1610",
  "local_morte": "Peking, China",
  "summary": "Matteo Ricci was an Italian Jesuit who went to China as a missionary and introduced the Chinese to Western mathematics.",
  "biografia": "After being educated at home by his parents,\nMatteo Ricci\nentered the Jesuit School in Macerata in\n1561\n. He went to Rome in\n1568\nto study law but he was attracted to the Jesuit religious order which he joined in\n1571\n. He then continued his studies in Rome, studying mathematics and astronomy under\nClavius\n.\nRicci set out on his sea voyages in\n1577\n. He arrived first in Portugal where he studied at the University of Coimbra for a while. Then, in\n1578\n, he sailed to the Portuguese city of Goa on the west coast of India. In Goa Ricci studied for the priesthood, and he was ordained in\n1580\n. Two years later he sailed to China.\nRicci arrived at Macau on the east coast of China in\n1582\n. He settled in Chao-ch'ing, Kwangtung Province and began his study of Chinese. He also worked at acquiring understanding of Chinese culture. While there Ricci produced the first edition of his map of the world\nGreat Map of Ten Thousand Countries\nwhich is a remarkable achievement showing China's geographical position in the world.\nIn\n1589\nRicci moved to Shao-chou and began to teach Chinese scholars the mathematical ideas that he had learnt from his teacher\nClavius\n. This is perhaps the first time that European mathematics and Chinese mathematics had interacted and it must be seen as an important event. Ricci attempted to visit Peking in\n1595\nbut found the city closed to foreigners. He went instead to Nanking where he lived from\n1599\n, working on mathematics, astronomy and geography.\nRicci was well received in Nanking and this encouraged him to try again to visit Peking which he did in\n1601\n. This time he was allowed to live in the city and he made this his home from that time until his death nine years later.\nThere was at that time a problem with the European's understanding of whether the country which Marco Polo had visited by an overland route, and called Cathay, was the same country as China which had been visited by sea. Marco Polo, also an Italian, had travelled from Europe through Asia beginning his journey in\n1271\nand living in Cathay for\n17\nyears before returning to Italy. Ricci was convinced that these countries were the same but, until another overland journey was made, this could not be confirmed. Ricci's hypothesis was proved by another Jesuit by the name of De Goes, who set out from India in\n1602\n, and although he died in\n1607\nbefore reaching Peking, he had by that time made contact by letter with Ricci and proved that Marco Polo's Cathay was China.\nBy the time he was living in Peking, Ricci's skill at Chinese was sufficient to allow him to publish several books in Chinese. He wrote\nThe Secure Treatise on God\n(1603)\n,\nThe Twenty-five Words\n(1605)\n,\nThe First Six Books of\nEuclid\n(1607)\n, and\nThe Ten Paradoxes\n(1608)\n.\nThe First Six Books of Euclid\nwas based on\nClavius\n's Latin version of\nEuclid\n's\nElements\nwhich Ricci had studied under\nClavius\n's guidance while in Rome. The Chinese reaction to Ricci's book, which showed them the logical construction in\nEuclid\n's\nElements\nfor the first time, is discussed in\n[\n10\n]\n. Certainly the style of\nEuclid\nwas far from the style of Chinese mathematics and this mixing of mathematical cultures must have been a cultural shock to both sides.\nRicci of course had to dress in the style of a Chinese scholar and be known under a Chinese name, he used 'Li Matou', to become accepted by the Chinese. However he became famous in China for more than his mathematical skills, becoming known for his extraordinary memory and for his knowledge of astronomy. He even became known as a painter and a painting of a landscape around Peking has recently been attributed to him.\nMatteo Ricci was buried in the Jesuit Cemetery\n(\nZhalan\n)\nin Beijing. See\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Clavius",
    "Euclid",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}