{
  "nome_completo": "Mauro Picone",
  "nome_curto": "Mauro Picone",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Picone/",
  "data_nascimento": "2 May 1885",
  "local_nascimento": "Lercara Friddi, Palermo, Italy",
  "data_morte": "11 April 1977",
  "local_morte": "Rome, Italy",
  "summary": "Mauro Picone was an Italian mathematician who worked on ordinary and partial differential equations.",
  "biografia": "Mauro Picone\n's parents were Alfonso Picone and Anna Bongiovanni. Alfonso was a mining engineer in Sicily, employed in sulphur mining industry, living in Lercara Friddi in the Province of Palermo about\n45\nkm southeast of the city of Palermo, Sicily. There were three children in the family, Mauro having two sisters. The sulphur mining industry had an important role in Sicily, with most of the world's sulphur being mined there during the first part of the\n19\nth\ncentury. However, the industry declined towards the end of the century with the discovery of rich sulphur mines in America and, as a result, Alfonso's family were reduced to poverty. He left mining in\n1889\nand the family moved to Arezzo in Tuscany where Alfonso had won a competition for a professorship at the Technical Institute. Mauro began his elementary schooling in Arezzo and, since he showed great artistic skills and a great love of the paintings of\nPiero della Francesca\nin the Basilica of San Francesco, his father sent him to a studio to study drawing. He certainly had great talent for drawing for he won a prize in a local exhibition.\nOne might have expected that Picone would excel at school, but this seems not to have been the case. Because his progress at elementary school was poor, particularly in arithmetic, he was given extra tuition to bring him up to standard. However, in\n[\n15\n]\nPicone says that he did not profit from this. After elementary school, he enrolled in the Technical Institute in Arezzo where his father was teaching. Although when he entered the Institute his main interest was still in drawing, he became steadily more interested in mathematics but also began to like the lessons in Italian and geography. Of course, his skill in drawing was particularly useful in his study of geography where he excelled in drawing maps. In mathematics he used the books by Richard Baltzer,\nElements of mathematics\n, translated from German to Italian by\nLuigi Cremona\nand\n[\n15\n]\n:-\nI became fond of their study and, since then, I deeply loved mathematics, this queen of the sciences.\nIn his third year at the Institute he was taught mathematics by his father for a short while, but in his third and fourth year his main mathematics teacher was\nMichele de Franchis\n(1875\n-\n1946)\nwho taught him algebra and analytic geometry, taking him to the second year university level. Before he completed his studies, however, his father moved to the Technical Institute in Parma and Picone moved there to obtain his final school certificate. One of the professors there\n[\n15\n]\n:-\n... Abd el Kader Salza, a gentle and wise man who took a liking to me, advised me to compete for a internal student place at the Scuola Normale Superiore of Pisa.\nIn October\n1903\nhe was successful in the competition for admission to the Scuola Normale in Pisa. However, he became ill and his parents hurried to Pisa to take care of him. It was January\n1904\nbefore he was well enough to begin his studies, taking courses given by\nUlisse Dini\nand\nLuigi Bianchi\n. He was also\n[\n7\n]\n:-\n... particularly fascinated by the depth of the genius of the mathematician\nEugenio Elia Levi\n, just two years older than him, but already established as a researcher of exceptional calibre.\nAt first he enrolled to study for a degree in physics, but\nBianchi\nadvised him to change to a mathematics degree which he did in his third year of study. He graduated in\n1907\n, but remained at the Scuola Normale where he became Dini's assistant. He married Maria Jole Agonigi, from a wealthy family of merchants from Pisa, on\n30\nOctober\n1913\n[\n15\n]\n:-\nMy wife had a very beneficial influence on my life as a scholar.  ... being pleased to give me constant material, moral and spiritual assistance.\nOn the day he married, he left Pisa and moved to the Polytechnic of Turin as an assistant to\nGuido Fubini\nwho held the chair of Rational Mechanics and Infinitesimal Analysis. In this period he developed research on ordinary differential equations and partial derivatives. This is described in more detail by Silvio Cinquini in a review of\n[\n9\n]\n. In this early period of his career, Picone studied:-\n... three different topics:\n(\ni\n)\nboundary value problems for second order linear ordinary differential equations, for which Picone developed his well-known \"identity\", and the subsequent extension of these results to second order linear partial differential equations of elliptic and parabolic types;\n(\nii\n)\npartial differential equations of hyperbolic type\n(\nin two independent variables\n)\n, for which Picone studied problems generalizing\nGoursat\n's problem;\n(\niii\n)\nresearch on differential geometry in the direction set by\nL Bianchi\n, with particular attention to the characterization of the\nd\ns\n2\nds^{2}\nd\ns\n2\nof a ruling and to W congruences.\nPicone's quiet, hardworking, life in Turin was disrupted with the outbreak of World War I. Italy did not enter the war when it broke out in\n1914\nalthough at this stage most people in the country would have supported Germany but had a long-standing rivalry with Austria-Hungary. Only in April\n1915\ndid Italy enter the war, persuaded to come in on the side of the Allies, Russia, France and Britain. One year later, in April\n1916\n, Picone was called up and assigned to the\n6\nth\nArtillery Regiment where he was given the rank of second lieutenant. In July he was sent to the front near Trento where the Italians were fighting the Austrians. On learning that Picone was a mathematician, his commander, Colonel Federico Baistrocchi, set him the task of computing new gunnery tables for the artillery. He adapted the old tables produced by\nFrancesco Siacci\nto the particular geographic conditions they were fighting in around Trento. This work changed Picone's view of mathematics\n[\n15\n]\n:-\n.. you can imagine, after this success achieved with mathematics, the kind of new light in which it appeared to me. I thought: so mathematics is not only beautiful, it can be useful as well.\nPicone was promoted to captain of artillery in\n1917\nand, in the following year, was awarded the Military Cross by Italy and the Croix de Guerre with silver star by France.\nAfter the war ended and Picone was demobbed, he returned to his university teaching. In\n1919\nhe was appointed as Professor of Analysis at the University of Catania, in\n1920\nhe was briefly at the University of Cagliari, and then returned to Catania in\n1921\nas Head of Mathematics. While in Catania, he published two books:\nTeoria introduttiva delle equazioni differenziali ordinarie e calcolo delle variazioni\nⓉ\n(\nIntroductory theory of ordinary differential equations and calculus of variations\n)\n(1922)\nand\nLezioni di Analisi infinitesimale\nⓉ\n(\nLessons on infinitesimal analysis\n)\n(1923)\n. Then, after a short stay in Pisa in\n1924\n-\n1925\n, he moved to the University of Naples. There\nRenato Caccioppoli\n, who graduated from Naples in\n1925\nhaving been a student of Ernesto Pascal, became Picone's assistant.\nCarlo Miranda\nentered the University of Naples in\n1927\nand studied with Picone, graduating in\n1931\n. At this time\nMiranda\nalso became an assistant of Picone who by this time had four assistants, the other two being Gianfranco\nCimmino\nand Giuseppe Scorza Dragoni. These four assistants are referred to as \"Mauro Picone's four musketeers\" by Scorza Dragoni in his obituary of\nMiranda\n. They worked in the \"Institute for Calculus\" which had been founded by Picone in Naples in\n1927\nwith financial assistance from the Banco di Napoli. This Institute was perhaps the earliest Institute for computing in the world.\nPicone left Naples in\n1932\n, together with\nMiranda\n, when he moved his Institute to Rome on being appointed to the chair of Higher Analysis there. Mario Salvadori explained in his autobiography\nA Tangential Life\n(\nsee\n[\n18\n]\n)\nhow this move came about:-\nPicone, a vivacious, bright and aggressive Sicilian had been the first mathematician in Italy to recognize the importance of numerical analysis ... When Picone became interested in numerical analysis the electronic computer was twenty-five years into the future the pure mathematicians at the University of Rome despised the subject, although the Germans had already given it high status in some of their universities. With admirable single mindedness and great political skill Picone succeeded in getting appointed to a chair of mathematical analysis in Rome, left Naples University together with his brilliant assistant\nMiranda\nand, besides teaching the kind of mathematics acceptable to his illustrious colleagues, obtained a small grant from the newly established Italian National Research Council to start in a small apartment in Rome in a new section of town the high-sounding \"Institute for the Applications of the Calculus.\"\nPicone was the director of the Institute for the Applications of the Calculus in Rome from its founding until\n31\nJuly\n1960\nwhen he retired from his chair at the university and was made professor emeritus. The early days of the Institute are described by Salvadori\n(\nsee\n[\n18\n]\n)\n:-\nThe only calculators available to us then were mechanical and hand cranked. Later we were able to buy a few electrically powered mechanical calculators, which were a little faster and less noisy. Yet by\n1935\nPicone's vision and persistence had given the institute, by now the National Institute for the Applications of Calculus, the entire top floor of the new palace of the National Research Council and enough money to pay\n(\nmiserly\n)\na staff of thirty.\nSalvadori also describes a visit by Mussolini to the Institute\n(\nsee\n[\n18\n]\n)\n:-\nOn the morning of the inauguration of the new headquarters we were requested to be at our desks at\n8\na.m. When \"il Duce\" strutted along the corridor of the institute we cranked our machines by hand as fast as we could after setting all the levers of our calculators at the\n9\npositions, because in this configuration the calculators made the biggest racket. Il Duce could not miss the enormous significance to the future of the Fascist Empire of so many\n999\n,\n999\n,\n999\ns being so loudly multiplied by\n999\n,\n999\n,\n999\n. In a sense the bombast of these multiplifications was an honest representation of the empty racket of most Fascist activities. As I vigorously turned my crank I saw from the corner of my eye paunchy Mussolini in his black uniform followed by paunchy Picone in his black shirt. As soon as \"he\" left the racket stopped and we went back to our serious pioneering work.\nThe work undertaken by the Institute included\nfunctional analysis\n, partial differentiation,\nintegral equations\n, calculus of variations, special functions,\nprobability theory\n, rational mechanics and mathematical physics. As well as much theoretical work, practical work was undertaken for various government ministries, particularly the Ministries of Aviation and War, as Italy prepared for war. After Italy entered World War II in June\n1940\n, the Institute worked on military applications as part of the war effort, switching to work to aid Italy's economic reconstruction after the armistice agreement of September\n1943\n. In the above quote, Salvadori pokes fun at Fascism but, in the years running up to World War II, Picone seems to have enthusiastically embraced its ideas. For example, when Mussolini joined the Fascist party in\n1923\nPicone wrote to him:-\nIllustrious Excellency, let me express to you my deepest innermost satisfaction for you giving your support to the Fascist Party to which I belong. ... Your major support of the Fascist Party ... will overcome the hesitation of many of my colleagues and will bring more new pure blood into the strong veins of the Party which is rebuilding and reorganising our country.\nHowever, after World War II ended, Picone made critical comments about Fascism, writing in\n1948\n:-\nUnfortunately, ... university life was painfully interrupted for seven years, from\n1938\nto\n1945\n, because of those senseless racial measures which deprived Italy, in that long and difficult period, of the precious work of citizens of very high moral, spiritual and intellectual standing.\nLet us be kind and suggest that by this time Picone had seen the error of his earlier Fascist beliefs.\nAs to Picone's own mathematical contributions after setting up his Institutes, Silvio Cinquini writes in a review of\n[\n9\n]\n:-\n... one notes Picone's marked preference for the numerical direction of analysis which was more amply developed after the establishment of the Istituto Nazionale per le Applicazioni del Calcolo, since he knew that problems with an applied emphasis always give rise to new theoretical research. Resulting from this were Picone's results on a priori bounds for the solutions of ordinary differential equations, as well as for those of linear partial differential equations of elliptic type and parabolic type for which the bound is obtained by means of the boundary data and the known terms; these results are contained in his well-known 'Notes on higher analysis'\n(\nItalian\n)\na volume published in\n1940\nand which was, for its time, \"truly avant-garde\".\nGaetano Fichera\nhighlights Picone's\n1936\nmemoir which contains a characterization of a large class of linear partial differential equations whose solutions enjoy mean-value properties termed \"integral properties\" by Picone; using this theory Picone reconstructed M Nicolescu's theory of polyharmonic functions. However, the works which led to the broadest and most important research are those based on the translation of boundary value problems for linear partial differential equations into systems of\nFischer\n-\nRiesz\nintegral equations; this method, whose object is the numerical calculation of the solutions, is similar to that of subsequent authors, who considered weak solutions of the same problems.\nSome of his most important books which Picone published during his years in Rome are:\nAppunti di Analisi superiore\nⓉ\n(\nHigher analysis notes\n)\n(1940)\n, which studies harmonic functions,\nFourier\n,\nLaplace\nand\nLegendre\nseries and the equations of mathematical physics;\nLezioni di Analisi funzionale\nⓉ\n(\nLessons on functional analysis\n)\n(1946)\n, which concerns the calculus of variations;\nTeoria moderna dell'integrazione delle funzioni\nⓉ\n(\nmodern integration theory of functions\n)\n(1946)\n, containing a detailed discussion of the r-dimensional\nStieltjes\nintegrals;\n(\nwith Tullio Viola\n)\nLezioni sulla teoria moderna dell'integrazione\nⓉ\n(\nLectures on modern theories of integration\n)\n(1952)\n, which is basically the previous work by Picone with three extra chapters by Viola; and\n(\nwith\nGaetano Fichera\n)\nTrattato di Analisi matematica\nⓉ\n(\nTreatise on mathematical analysis\n)\n(\nVol\n1\n,\n1954\n, Vol\n2\n,\n1955)\n, which puts into a treatise Picone's way of teaching calculus particularly slanted towards the applications studied at the Institute for Applied Calculus. After Picone retired in\n1960\n, he was made professor emeritus. Over the last eight years in the chair he had concentrated his research on a classical approach to the integrals of the calculus of variations.\nPicone received many honours for his remarkable contributions to mathematics. He was awarded honorary doctorates by the University of Sao Paulo in Brazil and the University of Bucharest. He was elected to, among many Societies and Academies: the\nAccademia dei Lincei\n; the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of Forty\"\n)\n; the National Society of Science, Letters and the Arts; the\nTurin Academy of Sciences\n; the Accademia Gioenia di Catania; the Modena Academy of Science, Letters and the Arts; the Palermo Academy of Sciences, Humanities and Fine Arts; the Buenos Aires Academy of Sciences; the Warsaw Society of Arts and Sciences; the\nPolish Academy of Sciences\n; the Royal Academy of Exact Sciences in Madrid; and the\nAcademy of Sciences of the Socialist Republic of Romania\n. He received many prizes including: the Royal Prize for Mathematics from the\nAccademia dei Lincei\n(1938)\n; the Tenore Prize of the Royal Society of Naples; the\nSeveri\nPrize from the National Institute of Advanced Mathematics; the Gold Medal for merit of Culture and Art; the Gold Medal of the Faculty of Sciences of the University of Rome; the Gold Medal of the Italian National Research Council; the Gold Medal from the French Society for the Encouragement of Research and Invention; and the\nFermat\nMedal of the Academy of Sciences of Toulouse.",
  "matematicos_citados_na_biografia": [
    "Piero della Francesca",
    "Luigi Cremona",
    "Michele de Franchis",
    "Ulisse Dini",
    "Luigi Bianchi",
    "Eugenio Elia Levi",
    "Bianchi",
    "Guido Fubini",
    "Goursat",
    "L Bianchi",
    "Francesco Siacci",
    "Renato Caccioppoli",
    "Carlo Miranda",
    "Miranda",
    "Cimmino",
    "functional analysis",
    "integral equations",
    "probability theory",
    "Gaetano Fichera",
    "Fischer",
    "Riesz",
    "Fourier",
    "Laplace",
    "Legendre",
    "Stieltjes",
    "Accademia dei Lincei",
    "National Academy of Sciences of Italy",
    "Turin Academy of Sciences",
    "Polish Academy of Sciences",
    "Academy of Sciences of the Socialist Republic of Romania",
    "Severi",
    "Fermat"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}