{
  "nome_completo": "Philbert Maurice d'Ocagne",
  "nome_curto": "Maurice d'Ocagne",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/DOcagne/",
  "data_nascimento": "26 March 1862",
  "local_nascimento": "Paris, France",
  "data_morte": "23 September 1938",
  "local_morte": "Le Havre, France",
  "summary": "Maurice d'Ocagne was a French engineer and mathematician. He founded the field of nomography, the graphic computation of algebraic equations.",
  "biografia": "Maurice d'Ocagne\nbelonged to an old Normany family. His father, Mortimer d'Ocagne, was the author\nLes Grandes Écoles de France\nⓉ\n(\nThe Great Schools of France\n)\n, a work which discussed the organization of higher education in France. Maurice was educated at the Collège Chaptal, and the Lycée Fontanges. He then entered the École Polytechnique in\n1880\nand soon began to publish mathematical articles. For example he published in the\nBulletin\nof the\nFrench Mathematical Society\n:\nSur le centre de courbure des courbes de poursuite\nⓉ\n(\nOn the centre of curvature of pursuit curves\n)\n(1883)\n,\nSur l'évaluation graphique des moments et des moments d'inertie des aires planes\nⓉ\n(\nOn the graphical evaluation moments and moments of inertia of plane areas\n)\n(1884)\n,\nÉtude géométrique de la distribution des efforts autour d'un point dans une poutre rectangulaire et dans un massif de terre\nⓉ\n(\nGeometric study of the distribution of efforts around a point in a rectangular beam and a soil fill\n)\n(1884)\n,\nSur une série à loi alternée\nⓉ\n(\nOn an alternating series\n)\n(1884)\n,\nSur la droite moyenne d'un système de droites quelconques situées dans un plan\nⓉ\n(\nOn the average of an arbitrary system of lines in a plane\n)\n(1884)\n, and\nSur certaines figures minima\nⓉ\n(\nOn some minimum figures\n)\n(1884)\n.\nIn\n1885\nhe joined the Corps de Ponts et Chaussées, moving to Cherbourg where he worked for several years on the construction of waterworks. However, he continued to publish many articles on a variety of mathematical topics. As an example we mention\nIntégration d'une suite récurrente qui se présente dans une question de probabilité\nⓉ\n(\nIntegration of a recurring series that presents itself in a problem of probability\n)\n;\nSur une notation utile en algèbre et en analyse\nⓉ\n(\nOn a useful notation in algebra and analysis\n)\n; and\nSur Une Classe de Nombres Remarquables\nⓉ\n(\nOn a class of remakable numbers\n)\nwhich are just three of the papers he published in\n1887\n. In\n1893\nhe became répétiteur at the École Polytechnique, then in the following year he was appointed professor at the École Nationale des Ponts et Chaussées. In\n1891\nhe began publishing papers on nomography, the topic for which he is most remembered today. Itard explains in\n[\n1\n]\n:-\nNomography consists in the construction of graduated graphic tables, nomograms, or charts, representing formulas or equations to be solved, the solutions of which were provided by inspection of the tables.\nThese papers by d'Ocagne included\nNomographie\nⓉ\n(\nNomography\n)\n;\nles Calculs usuels effectués au moyen des abaques\nⓉ\n(\nThe usual calculations using an abacus\n)\n(1891)\n;\nLe Calcul simplifié par les procédés mécaniques et graphiques\nⓉ\n(\nSimplified calculation by mechanical and graphic processes\n)\n(1894)\n;\nSur la représentation monographique des équations du second degré à trois variables\nⓉ\n(\nOn the monographic representation of quadratic equations with three variables\n)\n(1896)\n;\nThéorie des équations représentables par trois systèmes linéaires de points cotés\nⓉ\n(\nTheory of equations represented by three linear systems of edge points\n)\n(1897)\n; and\nApplication de la méthode nomographique la plus générale, résultant de la superposition de deux plans, aux équations à trois et à quatre variables\nⓉ\n(\nApplication of the most general nomograph method resulting from the superposition of two planes to equations with three and four variables\n)\n(1898)\n.\nIn\n1899\nd'Ocagne published\nTraité de Nomographie\nⓉ\n(\nTreatise on nomography\n)\n. He writes in the Introduction:-\nThe purpose of Nomography is to reduce to simple readings on graphical charts, constructed once for all, the computations which necessarily intervene in the practice of various technical arts. If one makes a system of geometric elements\n(\npoints or lines\n)\ncorrespond to each of the variables connected by a certain equation, the elements of each system being numbered in terms of the values of the corresponding variable, and if the relationship between the variables established by the equation may be translated geometrically into terms of a certain relation of position, easy to set up between the corresponding geometric elements, then the set of elements constitutes a chart of the equation considered. This is the theory of charts, that is to say the graphical representation of mathematical laws defined by equations in any number of variables, which is understood today under the name Nomography.\nD'Ocagne published the book\nCours de Géométrie descriptive et de Géométrie infinitésimale\nⓉ\n(\nCourse of descriptive geometry and infinitesimal geometry\n)\nin\n1896\n. Edgar Odell Lovett begins a lengthy review of the book as follows:-\nThis work is an expansion of the course in pure geometry given by the author at the École des Ponts et Chaussées. It proposes to give an exposition of all the geometrical notions which are of interest to engineers, the material not required in the course appearing in small print. As the title indicates, the construction of the book is unique. The author deems it necessary to separate completely that which has to do with the representation of geometrical bodies from that which treats of their intrinsic properties. Accordingly his course is divided into two parts represented in the work by the two distinct divisions: Géométrie descriptive and Géométrie infinitésimale. The author believes also that the exposition of general doctrines should precede that of the details of a subject and prefaces each chapter with a body of essential principles before examining any particular case; thus for example, in the theory of surfaces he presents an ensemble of general properties before studying surfaces of a special nature, such as the surfaces gauches; this is contrary to the custom prevailing in similar courses.\nIn\n1901\nd'Ocagne was appointed director of the French mapping service. In\n1912\nhe was appointed professor of geometry at the École Polytechnique. Then in\n1920\nhe became the general inspector of roads and bridges in France. On\n30\nJanuary\n1922\nhe was elected to the\nAcadémie des Sciences\n, having twice been awarded prizes by the Academy, once in\n1892\n(\nthe Leconte prize\n)\nfor his work on nomography and another in\n1894\n(\nthe Dalmont prize\n)\n, for all of his mathematical work to that date.\nLet us mention that d'Ocagne also wrote literary works under the pseudonym Pierre Delix. His one-act comedy\nLa Candidate\nⓉ\n(\nThe Candidate\n)\nwas performed at the Theatre Cluny in Paris for over a hundred performances.\nThe\nEdinburgh Mathematical Society\nheld a Colloquium in\n1914\nfollowing a highly successful colloquium in the previous year. D'Ocagne was one of the three invited lecturers, giving two lectures on Nomography.  In\nThe Mathematical Gazette\nin May\n1914\n, an advertisement appeared for the colloquium and it gave the following description of d'Ocagne's course:-\nIt is now generally recognised that for most purposes the nomographic methods are superior to the older graphical methods of calculation. The introduction of some nomographic teaching in British Universities\n(\nand schools, for much of it is not too hard for schoolboys\n)\nis much to be desired.",
  "matematicos_citados_na_biografia": [
    "French Mathematical Society",
    "Académie des Sciences",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}