{
  "nome_completo": "Michael Artin",
  "nome_curto": "Michael Artin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Artin_Michael/",
  "data_nascimento": "28 June 1934",
  "local_nascimento": "Hamburg, Germany",
  "data_morte": null,
  "local_morte": null,
  "summary": "Michael Artin is an American mathematician known for his contributions to algebraic geometry. He has been awarded major prizes, including the Steele Prize and the Wolf Prize.",
  "biografia": "Michael Artin\n's parents were\nEmil Artin\n, a famous mathematician with a biography in this archive, and Natalie Naumovna Jasny. Natalie, known as Natascha, had been born in St Petersburg, Russia, but her family had fled because of the Bolsheviks and, after many adventures, arrived in Europe after taking a boat to Constantinople. She attended the gymnasium in Hamburg and then Hamburg University where she took classes taught by\nEmil Artin\n.\nEmil Artin\n, born in Vienna, was descended from an Armenian carpet merchant who moved to Vienna in the\n19\nth century. Emil and Natascha were married on\n15\nAugust\n1929\nand their first child, Karin, was born in January\n1933\n. Michael was their second child. He talks about his birth in\n[\n1\n]\n:-\nMy mother says that I was a big baby and it was a difficult birth, although I don't know what I weighed. The conversion from German to English pounds adds ten percent, and I suspect that my mother added another ten percent every few years. She denies this, of course. Anyway, I'm convinced that a birth injury caused my left-handedness and some seizures, which, fortunately, are under control.\nBecause Natascha's father, the agronomist Naum Jasny, was Jewish,\nEmil Artin\nwas in difficulties with the Nazi anti-Semitic legislation brought in in\n1933\n. When Michael was three years old, in\n1937\n, Emil lost his position at the University of Hamburg and decided to emigrate to the United States for the sake of his wife and children. They sailed on the steamship\nNew York\non\n21\nOctober\n1937\n, arriving in New York one week later where they were met by\nRichard Courant\n,\nHermann Weyl\nand Naum Jasny who had escaped from Germany earlier. The family were supported at first from a fund set up to support refugees but, after spending the academic year\n1937\n-\n38\nat Notre Dame University, Emil and his family settled in Bloomington where he had a permanent position at Indiana University. Michael's young brother Thomas was born in the United States in November\n1938\n.\nThe Artin home was always filled with music. Emil played the piano and the Hammond organ, while Karin played the cello and piano. Michael played the violin, and later at college played classical guitar and the lute. Although he gave up the lute after college, he has continued to enjoy playing the violin. Michael explained in\n[\n1\n]\nhow his father's love of learning and teaching came across when he was a child:-\nMy father loved teaching as much as I do, and he taught me many things: sometimes mathematics, but also the names of wild flowers. We played music and examined pond water. If there was a direction in which he pointed me, it was toward chemistry. He never suggested that I should follow in his footsteps, and I never made a conscious decision to become a mathematician.\nHe gave details as to why his father taught him chemistry in the interview\n[\n8\n]\n:-\nWhen I was a child my father spent a fair amount of time teaching me about things. It wasn't primarily mathematics but other sciences, chemistry especially because his father had wanted him to be a chemist and that hadn't worked out, and it didn't work for me. He outfitted me with fairly elaborate chemistry outfit which he had got partly through a student who had transferred into mathematics from chemistry - a graduate student who became a mathematician.\nThe family grew up to be bilingual. Michael's father used to read to him in German when he was a child and then later they had a rule that only German was spoken at the dinner table. At other times they alternated between English and German. In April\n1946\nEmil Artin\nwas appointed as a professor at Princeton and he was joined in Princeton by the rest of his family in the autumn of\n1946\n. Michael attended Princeton High School where he knew that science was the subject for him but still had no idea which of the sciences to specialise in. He graduated from the High School and became an undergraduate at Princeton University where, because his father was on the faculty, he received free education. He still had made no decision about which science to major in but he was able to at least make some negative decisions\n[\n8\n]\n:-\nI went to college and in college I couldn't stand physics after a year - there was an optic lab and I couldn't see anything. Then in chemistry that I started out with, I broke too many pieces of glass into my hands, then I guess I just lost interest. That left mathematics and biology and I never really made a decision. I decided to major in mathematics because I figured that it was at the theoretical end of the science spectrum so it would be easier to change out of - which is a stupid thing.\nHe spoke about his undergraduate studies of mathematics in\n[\n27\n]\n:-\nI originally thought I might do topology. When I was an undergraduate, my advisor was\nRalph Fox\n, who was a topologist, and he got me doing things. In Princeton - in those days, at least - you had to write a junior paper, and a senior paper. I did what was thought to be original research in my senior thesis, but I never published it. I think\nRalph\nmentions the result in one of his books, but I didn't think it was good enough. Biology was my other field when I was an undergraduate. But in those days, mathematical biology was zero. ... But now its a fascinating subject. Maybe I chose the wrong field.\nArtin was a member of Cloister Inn, one of the undergraduate eating clubs at Princeton University and he was active in the orchestra. In his senior year he roomed with T C Young, Jr at\n154\nWitherspoon Street. He graduated with an A.B. from Princeton in\n1955\nand, later that year, went to Harvard for graduate studies. His first year was not, by his own account, too successful although he was awarded a Master's Degree by Harvard in\n1956\n. It was in the following year that the passion for mathematics really gripped him when he became\nOscar Zariski\n's student\n[\n1\n]\n:-\nThose were exciting times for algebraic geometry. The crowning achievement of the Italian school, the classification of algebraic surfaces, was just entering the mainstream of mathematics. The sheaf theoretic methods introduced by\nJean-Pierre Serre\nwere being absorbed, and\nGrothendieck\n's language of schemes was being developed.\nZariski\n's dynamic personality, and the explosion of activity in the field, persuaded me to work there. I became his student along with Peter Falb,\nHeisuke Hironaka\n, and\nDavid Mumford\n.\nOn\n30\nJanuary\n1960\n, Artin married Jean Harper, the daughter of Mr and Mrs John Leslie Harper of Rochester, New York. Jean was a graduand of Radcliffe College\n[\n13\n]\n:-\nFor her marriage the bride chose a street-length gown of silk with a short veil, and carried freesias and roses. ... Best man was Thomas Artin\n[\nMichael Artin's younger brother\n]\n.\nThey have a daughter Wendy S Artin, a talented painter who has painted indoors and outdoors in Rome, Paris, Barcelona, Boston, New York, Mexico and Guatemala. She is the Fine Arts winner of the\n2023\nArthur Ross Award for Excellence in the Classical Tradition. A second daughter Caroline works as an editor.\nArtin was awarded a Ph.D. by Harvard in\n1960\nfor his thesis\nOn Enriques' Surfaces\n. He did not publish his thesis because he did not think it good enough for publication. As he often related, his parents had very high standards and he accepted these high standards as the norm. In fact his first paper was\nSome numerical criteria for contractability of curves on algebraic surfaces\n(1962)\n. After the award of his doctorate in\n1960\n, Artin was appointed as a\nBenjamin Peirce\nLecturer at Harvard. He held this position until\n1963\nwhen he was appointed to the Massachusetts Institute of Technology. However, he arranged leave for his first year at MIT to enable him to spend it in France at the Institut des Hautes Études Scientifiques\n(\nIHES\n)\n. At IHES, Artin attended\nAlexander Grothendieck\n's seminars which had a major influence on the direction of his research in algebraic geometry at this time. He made several other visits to IHES during the\n1960\ns. His contributions to algebraic geometry are beautifully summarised in the citation for the Lifetime Achievement Steele prize he received from the\nAmerican Mathematical Society\nin\n2002\n[\n1\n]\n:-\nMichael Artin has helped to weave the fabric of modern algebraic geometry. His notion of an algebraic space extends\nGrothendieck\n's notion of scheme. The point of the extension is that Artin's theorem on approximating formal power series solutions allows one to show that many moduli spaces are actually algebraic spaces and so can be studied by the methods of algebraic geometry. He showed also how to apply the same ideas to the algebraic stacks of\nDeligne\nand\nMumford\n. Algebraic stacks and algebraic spaces appear everywhere in modern algebraic geometry, and Artin's methods are used constantly in studying them. He has contributed spectacular results in classical algebraic geometry, such as his resolution\n(\nwith Swinnerton-Dyer in\n1973)\nof the\nShafarevich\n-\nTate\nconjecture for elliptic K\n3\nsurfaces. With\nMazur\n, he applied ideas from algebraic geometry\n(\nand the\nNash\napproximation theorem\n)\nto the study of diffeomorphisms of compact manifolds having periodic points of a specified behaviour.\nAt MIT, Artin was promoted to professor in\n1966\nand, in August of the same year, was given the honour of being a plenary speaker at the International Congress of Mathematicians held in Moscow. He gave the lecture\nThe Etale Topology of Schemes\n. He began his lecture with the following introduction\n[\n24\n]\n:-\nSince\nAndré Weil\npointed out the need for invariants, analogous to topological ones, of varieties over fields of characteristic p, several proposals to define such invariants have been made, notably by\nJean-Pierre Serre\n,\nAlexander Grothendieck\n, and Paul Monsky and Gerard Washnitzer. I would like to describe some of the recent work on one of these approaches, that of the 'etale cohomology' of\nGrothendieck\n.\nHe served as chairman of Pure Mathematics at MIT in\n1983\n-\n84\nand was named\nNorbert Wiener\nProfessor there in\n1988\n. His main research area changed from algebraic geometry to noncommutative ring theory as he explained in his response to receiving the Steele Prize\n[\n1\n]\n:-\nMy interest in noncommutative algebra began with a talk by Shimshon Amitsur and a visit to Chicago, where I met Claudio Procesi and Lance Small. They prompted my first foray into ring theory, and in subsequent years noncommutative algebra gradually attracted more of my attention. I changed fields for good in the mid-\n1980\ns, when Bill Schelter and I did experimental work on quantum planes using his algebra package, 'Affine'.\nArtin has written several outstanding books. These include the monograph\n(\nwith\nBarry Mazur\n)\nÉtale homotopy\n(1969)\nand\nAlgebraic spaces\n(1971)\nwhich is a printed version of the James K Whittemore Lecture in Mathematics given by Artin at Yale University in\n1969\n. His most famous book, however, is\nAlgebra\n(1991)\n. In\n[\n26\n]\nhe describes how this book developed from a year-long undergraduate course he taught for thirty years:-\nI didn't start out to write a textbook at all. I just wanted to teach a class, and to do some topics that weren't traditional. So I handed out notes for those, and eventually I started using them instead of the textbook. And then I revised them every year.\nGerald Janusz begins a review as follows\n[\n9\n]\n:-\nThis is a remarkable text designed for highly motivated undergraduates having some preparation in linear algebra and some other post-calculus mathematics. It is noteworthy for its contents and the style of presentation. In the preface, the author lists three principles that he followed\n(\nbriefly: examples should motivate definitions, technical points are presented only if needed later in the book, topics should be important for the average mathematician\n)\nand takes pains to point out that \"Do it the way you were taught'' is not one of them. The style throughout the text is to present basic concepts, give many nontrivial examples and present brief and understandable discussions of advanced material.\nIt is interesting to look at reviews by students who have used the book. They are sharply divided into those who find the book outstandingly good at teaching and making them think about algebra, and those who criticise it because it is not encyclopaedic. As one puts it:-\nI cannot imagine bothering to search a book so deliberately and thoroughly written to make the reader ask and answer their own questions.\nArtin acknowledges this problem himself in\n[\n27\n]\n:-\nIt's not easy for the traditional algebraists to use it as a textbook, because it has other stuff in it.\nArtin has been closely connected with the\nAmerican Mathematical Society\nover a long period. He was the first editor-in-chief of the\nJournal\nof the\nAmerican Mathematical Society\n, served on the Council, was elected Vice-President, and served as\n51\nst President of the Society during\n1991\n-\n92\n. He spoke in\n[\n27\n]\nof the range of activities that the President has to undertake:-\n... there's the volunteer side, the president and the council and committees; and the executive director's side, which runs the Providence and Washington offices and does things like arrange meetings and publish journals. They're both very complicated. And often at the council meeting, there are political issues brought up, which concern the Mathematical Society only very peripherally, and which are very divisive.\nThe authors of\n[\n6\n]\nwrite:-\nMike was president of the\nAmerican Mathematical Society\nin\n1991\nand\n1992\n. During his term, he established oversight committees for important AMS activities such as meetings and publications.\nWe have already mentioned above that Artin was awarded the\nAmerican Mathematical Society\n's Steele Prize for Lifetime Achievement in\n2002\n. In\n2005\nhe was awarded the Harvard Graduate School of Arts & Sciences Centennial Medal for being\n[\n14\n]\n:-\n... an architect of the modern approach to algebraic geometry.\nHe also received the Undergraduate Teaching Prize and the Educational and Graduate Advising Award from MIT University. His outstanding contributions have been recognised with election to the\nNational Academy of Sciences\nin\n1977\n, and to a fellowship of the\nAmerican Academy of Arts and Sciences\nin\n1969\n. He is a member of the American Association for the Advancement of Science, and of the\nSociety for Industrial and Applied Mathematics\n. He has also been honoured with election as a Foreign Member of the\nRoyal Netherlands Academy of Arts and Sciences\n, and as an Honorary Member of the\nMoscow Mathematical Society\n. He has received honorary doctorates from the University of Antwerp and from the University of Hamburg.\nIn\n2013\nArtin was awarded the Wolf Prize\n[\n11\n]\n:-\n... for his fundamental contributions to algebraic geometry, both commutative and noncommutative.\nHere is an extract from the citation\n[\n11\n]\n:-\nMichael Artin is one of the main architects of modern algebraic geometry. His fundamental contributions encompass a bewildering number of areas in this field. To begin with, the theory of étale cohomology was introduced by Michael Artin jointly with\nAlexander Grothendieck\n. ... He also collaborated with\nBarry Mazur\nto define étale homotopy, another important tool in algebraic geometry, and more generally to apply ideas from algebraic geometry to the study of diffeomorphisms of compact manifolds. We owe to Michael Artin, in large part, also the introduction of algebraic spaces and algebraic stacks. These objects form the correct category in which to perform most algebro-geometrical constructions, and this category is ubiquitous in the theory of moduli and in modern intersection theory. ... In yet another example of the sheer originality of his thinking, Artin broadened his reach to lay rigorous foundations to deformation theory. This is one of the main tools of classical algebraic geometry, which is the basis of the local theory of moduli of algebraic varieties. Finally, his contribution to noncommutative algebra has been enormous. The entire subject changed after Artin's introduction of algebro-geometrical methods in this field.\nFurther honours have been given to Artin. In\n2013\nhe received the National Medal of Science, the United States' highest honour for achievement in science\n[\n28\n]\n:-\nFor his leadership in modern algebraic geometry, including three major bodies of work: étale cohomology; algebraic approximation of formal solutions of equations; and non-commutative algebraic geometry.\nThe Medal was presented to Artin by President Barack H Obama in the East Room of the White House on\n19\nMay\n2016\n. The ceremony had initially been scheduled for\n23\nJanuary but was postponed due to a snowstorm. David Harbater of the University of Pennsylvania explained his achievements leading to this honour in\n[\n12\n]\n. He begins his description as follows:-\nMichael Artin is one of the founders of modern algebraic geometry, developing, together with\nGrothendieck\n, the notions of\nGrothendieck\ntopology and étale cohomology, which were later key to the proofs of the\nWeil\nconjectures and many other developments. By introducing the notions of algebraic spaces and algebraic stacks, he created a context that permitted algebraic geometers to go beyond the limitations of schemes. Combined with his approximation and algebraisation theorems, this led to representability results for algebraic spaces and to existence theorems for moduli spaces of algebraic and geometric objects. These developments provided foundations for a more modern deformation theory, including the important notion of versal deformation in the study of local moduli.\nArtin remains very active mathematically and in\n2022\npublished the book\nAlgebraic Geometry: Notes on a Course.\nThe Preface begins\n[\n3\n]\n:-\nThese are notes that have been used for an algebraic geometry course at MIT. I had thought about teaching such a course for quite a while, motivated partly by the fact that MIT didn't have very many courses suitable for students who had taken the standard theoretical math classes. I got around to thinking about this seriously twelve years ago and have now taught the subject seven times. I wanted to get to cohomology of\n-modules\n(\naka quasicoherent sheaves\n)\nin one semester, without presupposing a knowledge of sheaf theory or of much commutative algebra, so it has been a challenge. Fortunately, MIT has many outstanding students who are interested in mathematics. The students and I have made some progress, but much remains to be done. Ideally, one would like the development to be so natural as to seem obvious. Though I haven't tried to put in anything unusual, this has yet to be achieved. And there are too many pages for my taste. To paraphrase\nPascal\n, we haven't had the time to make it shorter.\nFinally, let us show something of Artin's character by quoting the Personal Comments from the six authors of\n[\n6\n]\n:-\nBefore describing some of Mike Artin's mathematical work we would like to say a few words about our experiences with Mike as students, collaborators, colleagues and friends. Mike has broad interests, a great sense of humour and no need to follow convention. These qualities are illustrated in the gorilla suit stories. On his\n40\nth birthday his wife, Jean, gave Mike a gift he had wanted, a gorilla suit. In experiments with the pets of family and friends, he found his wearing it did not disturb cats, but made dogs extremely agitated. Testing this theory on after-dinner walks, he found dogs crossed the street to avoid him. Experimenting once, Mike had gone ahead of his wife and friends to hide in a neighbour's bushes when a squad car stopped. As an officer got out of the car, Jean called out \"He's with me.\" After a closer look the officer turned back, telling his buddy \"It's OK - just a guy in a gorilla suit.\"\nOnce Mike wore the suit to class and, saying nothing, slowly and meticulously drew a very good likeness of a banana on the board. He then turned to the class, expecting some expression of appreciation, perhaps even applause, for a gorilla with such artistic talent, but was met with stunned silence.\nMike is a fine musician. As a youngster he played the lute and assembled a remarkable collection of Elizabethan lute music, but his principal instrument is the violin, which he practices and plays regularly. One of a group with whom he regularly plays quartets tells us, \"Mike is a wonderful violinist, just a notch below professional. He is so good that he can pull the rest of us through Ravel and Schoenberg.\"\nThe MIT undergraduates in Mike's year-long algebra classes adore him, in spite of it being a challenging course. Mike is both demanding and supportive, and his students respond to him with loyalty, gratitude, and dedication. Indeed, during a typical week one can find Mike in his office talking to his students for hours on end. Mike also takes a very personal approach with his graduate students. As a student, Eric Friedlander would knock on Mike's door, and Mike would boom out \"Who is it?\" On hearing a loud \"Eric Friedlander,\" Mike's response, still through the closed door, was almost invariably either \"Let's go swimming\" or \"Go Away.\" Actually, Mike's relationship with graduate students is kind and caring, and he is sensitive enough to work in different modes appropriate to different students. In a mixed gathering, Mike tends to seek out young people to talk with, as well as visiting with his peers.\nTo learn a new topic with Mike is to do research on that topic. For example, asking Mike for a mathematical reference is not always very effective - he'll often respond \"go and figure it out for yourself!\" For those unfamiliar with Mike's approach to mathematics, keep this in mind: Mike sometimes makes statements that are at first difficult to understand, almost as if he is evoking an image or an idea through poetry. It is a very beautiful thing to witness, albeit sometimes flabbergasting. One sure-fire way to get to the bottom of things is to whip out an example, and see the poem transformed into concrete reality.",
  "matematicos_citados_na_biografia": [
    "Emil Artin",
    "Richard Courant",
    "Hermann Weyl",
    "Ralph Fox",
    "Ralph",
    "Oscar Zariski",
    "Jean-Pierre Serre",
    "Grothendieck",
    "Zariski",
    "Heisuke Hironaka",
    "David Mumford",
    "Benjamin Peirce",
    "Alexander Grothendieck",
    "American Mathematical Society",
    "Deligne",
    "Mumford",
    "Shafarevich",
    "Tate",
    "Mazur",
    "Nash",
    "André Weil",
    "Norbert Wiener",
    "Barry Mazur",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Society for Industrial and Applied Mathematics",
    "Royal Netherlands Academy of Arts and Sciences",
    "Moscow Mathematical Society",
    "Weil",
    "Pascal"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}