{
  "nome_completo": "Moritz Abraham Stern",
  "nome_curto": "Moritz Abraham Stern",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stern/",
  "data_nascimento": "29 June 1807",
  "local_nascimento": "Frankfurt am Main, Germany",
  "data_morte": "30 January 1894",
  "local_morte": "Zürich, Switzerland",
  "summary": "Moritz Abraham Stern was a German mathematician who worked in number theory.",
  "biografia": "Moritz Abraham Stern\n's parents both came from old-established, well-off Jewish families in Frankfurt. His father Abraham Süsskind Stern, a merchant and bookseller, was a very scholarly man who\n[\n4\n]\n\"dedicated his life to studying the Talmud\"\n. Moritz's mother, Vögele Eva Reiss, owned a silk shop which, as a young woman, she opened in order to support her parents and siblings after the family had lost all of its possessions in\n1796\n, when a fire destroyed most of the Judengasse, the Jewish ghetto in Frankfurt. Moritz had two brothers, Jakob and Emanuel. Incidentally, Emanuel was the grandfather of Alice Frank\n(\nnée Stern\n)\n, Anne Frank's grandmother. Moritz's nephew Bernhard Stern recalls in\n[\n4\n]\nthat Moritz's parents were\n\"truly religious\"\n, and that they:-\n... took the raising of their sons very seriously, especially their son Moritz Abraham, who showed great intelligence from early on.\nMoritz did not attend school but was educated at home, first by his father and later by private teachers, among them Michael Creizenach, who taught him mathematics. He had a particular talent for languages, learning Hebrew, Yiddish, Latin and Greek to perfection, as well as ancient oriental languages such as Chaldean and Syriac. At the age of\n80\nhe began to learn Russian, which enabled him to read both Russian literature and Russian mathematical papers in the original.\nHis mother had hoped that he would become a Rabbi, but when Moritz began his studies at the University of Heidelberg in\n1826\n, he mainly attended lectures on mathematics by Ferdinand Schweins. Following the suggestion of his friend, the mathematician Michel Reiss, he moved to Göttingen half a year later. There he was primarily taught by\nCarl Friedrich Gauss\nand Bernhard Friedrich Thibaut, but he also studied chemistry and philology.\nGauss\nin particular had a big influence on Stern's mathematical taste as he introduced him to number theory, which became one of his main areas of interest.\nAlready in\n1829\nStern received a doctorate for his thesis\nObservationum in fractiones continuas specimen\nⓉ\n(\nSome observations on continued fractions\n)\non the theory of continued fractions. He was the first doctoral candidate examined by\nGauss\n, who is said to have joked later on that he was more afraid of the viva than the examinee\n[\n1\n]\n. He\nhabilitated\nat the University of Göttingen, becoming a\nPrivatdozent\nthere in\n1830\n. This was an unpaid position to begin with; it was only eight years later that the university paid him an annual salary, initially\n150\ntalers. For comparison purposes, we note that an ordinary professor earned more than ten times as much\n[\n2\n]\n.\nIn\n1848\nStern was finally appointed to an extraordinary professorship. This did not improve his financial situation, but it raised his profile in academia. The appointment was by no means a matter of course: while Jews were admitted to university studies, they were generally denied any academic positions in the German states of the\n19\nth\ncentury. Stern was not the first Jew to become an extraordinary professor, but even making a Jew a Privatdozent would have caused outrage at many other universities. At the time, professors at German universities were held in extraordinarily high esteem and enjoyed many privileges. Appointing a Jew to a professorship would have been considered tantamount to sacrilege. As a result, many Jewish academics decided to be baptised into the Christian faith or to take up posts at universities abroad.\nStern however stayed in Germany and was determined to become a professor. His son Alfred later wrote about his father's ambitions\n[\n2\n]\n:-\nBut my father had set himself the goal of trying his luck as an academic teacher at the Georgia Augusta. He knew that it would be a thorny path. Up until then there had not been a single ordinary professor in Germany who was Jewish. When his friend, the solicitor Goldschmidt from Frankfurt, heard of his intention, he said: \"You are as good as insane.\" But he felt bold and strong so as to chance what was unheard of.\nInterestingly, Stern was by no means a devout Jew, but belonged to Liberal or Reform Judaism. He believed that many traditional Jewish practices could and should be adapted to particular circumstances of everyday life. In a letter to a friend he even said that\n[\n4\n]\n:-\nWhat binds me to Judaism\n[\n...\n]\nis purely a filial sense of duty.\nNonetheless he saw himself as a protagonist of the Jewish emancipation, and believed that an appointment to a professorship would bring glory not only to himself but to the entire Jewish population\n[\n10\n]\n.\nHe reached his goal in\n1859\n, when he was appointed to an ordinary professorship. This made him the first non-baptised Jew ever to become a full professor at a German university. He was inaugurated at the same time as his former student\nBernhard Riemann\n, who succeeded\nLejeune Dirichlet\n. One reason for this appointment was the numerous petitions and recommendations that Stern's friends and colleagues, including the university's rector, had been sending to the government of the Kingdom of Hanover for the past\n20\nyears. Moreover, the university feared that it would lose one of its most experienced lecturers otherwise\n[\n10\n]\n.\nDuring his\n55\nyears at the University of Göttingen, Stern lectured on a wide variety of topics, including algebraic analysis, analytic geometry, differential and integral calculus, variational calculus, mechanics, popular astronomy and, of course,\nnumber theory\n. Stern is said to have been one of the most popular and also most gifted lecturers at the university\n[\n10\n]\n:-\nUnlike\nGauss\n, Stern was a very good teacher, even though he did not establish a mathematical school. He had thoroughly mastered the subjects he taught, and his lectures bore witness to that.\n[\n...\n]\nboth colleagues and students spoke most highly of Stern's pedagogical talent.\nHowever he could not compete with his former teacher\nGauss\nwhen it came to research, which is why his merits are not always recognised. Ullrich writes in his biography of\nRiemann\nthat\n[\n12\n]\n:-\nMoritz Abraham Stern,\nRiemann\n's second academic teacher at Göttingen, is often termed a second-rate mathematician, sometimes even without noting that one is comparing him to\nGauss\n. In any case,\nRiemann\nreceived a profound knowledge of the state of the art of analysis as taught in Germany at that time from Stern's lectures on calculus.\nStern married Bertha Simon\n(1823\n-\n1850)\nin\n1844\n. The wedding took place in the village of Bockenheim\n(\nnow part of Frankfurt\n)\ninstead of his hometown, as the by-laws regulating the lives of Frankfurt's Jewish population permitted a maximum of\n15\nJewish weddings per year. Bertha Stern died only six years later, after having given birth to their daughter Emma. When Emma died in\n1884\n, Stern retired from his teaching post and moved to Bern, where his son Alfred\n(1846\n-\n1936)\nwas a history professor at the university. Stern's chair at Göttingen was filled by\nFelix Klein\n.\nThree years later Alfred was appointed to a professorship in history at the Polytechnic in Zürich. Upon arrival in Zürich, Moritz Stern was made an honorary member of the local Society of Natural Scientists. He soon became well known and respected among the Zürich mathematicians. He also had very good contacts with German mathematicians, most notably with\nGotthold Eisenstein\n. Among his friends outside of mathematics, we mention the anatomist Jacob Henle, the author Berthold Auerbach, and the politician and judge Gabriel Riesser.\nStern remained extraordinarily healthy and engaged in mathematical and philological research until his death.\nNowadays Stern is primarily remembered for the fact that he was the first non-baptised Jewish university professor in Germany and not for his mathematical work. Even in his lifetime he was recognised more for his teaching than for his research. Nevertheless Stern published numerous papers in various German, French and Belgian journals, as well as in\nActa Mathematica\n. In\nCrelle's Journal\nalone,\n55\nof his papers appeared between\n1830\nand\n1890\n. His publications reflect his diverse mathematical interests, including work on number theory, the theory of\ncontinued fractions\n, the theory of series, the theory of\nBernoulli\n's and\nEuler\n's numbers, and the theory of functions. Further publications considered problems in mechanics and astronomy, such as his books\nDarstellung der populären Astronomie\nⓉ\n(\nA presentation of popular astronomy\n)\n(1834)\nand\nHimmelskunde\nⓉ\n(\nAstronomy\n)\n(1846)\n. Stern also translated\nPoisson\n's\nLehrbuch der Mechanik\n(1835\n-\n36)\nand wrote his own textbook\nLehrbuch der algebraischen Analysis\nⓉ\n(\nTextbook of algebraic Analysis\n)\n(1860)\n. In addition, he also published biographies of\nGauss\nand the Austrian mathematician Johannes von Gmunden, as well as several philological papers and articles on Reform Judaism.\nFor his paper\nÜber die Auflösung der transcendenten Gleichungen\nⓉ\n(\nOn the dissolution of transcendental equations\n)\n(\nCrelle\n,\n1841)\nhe received a prize from the\nDanish Academy of Sciences\n. In the same year the\nBelgian Academy of Sciences\nawarded him a prize for his paper on quadratic remainders,\nRecherches sur la théorie des résidus quadratiques\nⓉ\n(\nResearch on the theory of quadratic residues\n)\n(\nMémoires cournonnés par l'Academie des sciences de Belgique\n,\n1841)\n. Stern was made an honorary member of the Physics Society of Frankfurt in\n1855\n. Four years later he became a member of the Royal Bavarian Academy of Sciences, and in\n1862\nhe was elected a member of the\nRoyal Göttingen Academy of Sciences\n.\nOne of Stern's papers that is of particular interest is\nSur une assertion de Goldbach relative aux nombres impairs\nⓉ\n(\nOn Goldbach's assertion about odd numbers\n)\n(\nNouvelles annals de mathématiques\n,\n1854)\n.\nChristian Goldbach\nhad conjectured in\n1752\nthat every odd integer could be expressed in the form\np\n+\n2\na\n2\np + 2a^{2}\np\n+\n2\na\n2\n, where\np\np\np\nis prime and\na\n≥\n0\na ≥ 0\na\n≥\n0\nis an integer. Stern found two exceptions to this:\n5777\nand\n5993\n, called\nStern numbers\n(\nsee, for example,\n[\n7\n]\n)\n. He also showed that the only primes that cannot be written as\np\n+\n2\na\n2\np + 2a^{2}\np\n+\n2\na\n2\n, where\np\np\np\nis a smaller prime and\na\n>\n0\na > 0\na\n>\n0\nis an integer, are\n17\n,\n137\n,\n227\n,\n977\n,\n1187\n, and\n1493\n. These primes are known as\nStern primes\n. Since\n1\nwas considered a prime in Stern's lifetime, the list of Stern primes can be extended to include\n2\nand\n3\nas well.\nIn his paper\nÜber eine zahlentheoretische Funktion\nⓉ\n(\nOn a number theoretic function\n)\n(\nCrelle\n,\n1858)\nStern described the mathematics behind what is now called the\nStern-Brocot tree\n. Every entry in the tree is found by taking the mediant\nm\n1\n+\nn\n1\nm\n2\n+\nn\n2\n\\Large\\frac{m_1+n_1}{m_2+n_2}\nm\n2\n​\n+\nn\n2\n​\nm\n1\n​\n+\nn\n1\n​\n​\nof two adjacent fractions\nm\n1\nm\n2\n\\Large\\frac{m_1}{m_2}\nm\n2\n​\nm\n1\n​\n​\nand\nn\n1\nn\n2\n\\Large\\frac{n_1}{n_2}\nn\n2\n​\nn\n1\n​\n​\n, starting with the fractions\n0\n1\n\\Large\\frac{0}{1}\\normalsize\n1\n0\n​\nand\n1\n0\n\\Large\\frac{1}{0}\\normalsize\n0\n1\n​\nas the first parents. By applying the mediant function repeatedly, one obtains an infinite binary tree, in which every positive rational number appears exactly once and in its lowest terms. However Stern used continued fractions to describe the relations between the individual vertices of the tree rather than mediants, and he studied how mediants are related to the Euclidean algorithm.\nTaking all entries in the first\ni\ni\ni\nlevels of the tree together with the two initial parents\n0\n1\n\\Large\\frac{0}{1}\\normalsize\n1\n0\n​\nand\n1\n0\n\\Large\\frac{1}{0}\\normalsize\n0\n1\n​\ngives the Stern-Brocot sequence of order\ni\ni\ni\n. The algorithm used to construct these sequences is similar to that used to create Farey sequences; the differences being that for a Farey sequence of order\nn\nn\nn\nthe two initial fractions are\n0\n1\n\\Large\\frac{0}{1}\\normalsize\n1\n0\n​\nand\n1\n1\n\\Large\\frac{1}{1}\\normalsize\n1\n1\n​\n, and that for all fractions\na\nb\n\\Large\\frac{a}{b}\\normalsize\nb\na\n​\nin the sequence we need\nb\n≤\nn\nb ≤ n\nb\n≤\nn\n.\nIn\n1860\nthe French clockmaker Achille Brocot\n(1817\n-\n1878)\ndiscovered the tree independently of Stern. He had more practical applications in mind than Stern though, as he constructed the tree in order to choose the ratio of gears in watches.",
  "matematicos_citados_na_biografia": [
    "Carl Friedrich Gauss",
    "Gauss",
    "habilitated",
    "Privatdozent",
    "Bernhard Riemann",
    "Lejeune Dirichlet",
    "number theory",
    "Riemann",
    "Felix Klein",
    "Gotthold Eisenstein",
    "continued fractions",
    "Bernoulli",
    "Euler",
    "Poisson",
    "Danish Academy of Sciences",
    "Belgian Academy of Sciences",
    "Royal Göttingen Academy of Sciences",
    "Christian Goldbach"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}