{
  "nome_completo": "Nassim Nicholas Taleb",
  "nome_curto": "Nassim Taleb",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taleb/",
  "data_nascimento": "12 September 1960",
  "local_nascimento": "Amioun, Lebanon",
  "data_morte": null,
  "local_morte": null,
  "summary": "Nassim Taleb is a Lebanon-born American mathematician and statistician whose work concerns problems of randomness, probability and uncertainty.",
  "biografia": "Nassim Taleb\n's parents were Nagib Taleb, an oncologist and haematologist, and Minerva Ghosn, a anthropology researcher. Nagib and Minerva were Greek Orthodox Lebanese of the Greek Orthodox Church of Antioch but held French citizenship. Perhaps we should not use the label Lebanese since Nassim Taleb writes in\n[\n4\n]\n:-\nIt is remarkable how fast and how effectively you can construct a nationality with a flag, a few speeches, and a national anthem; to this day I avoid the label \"Lebanese,\" preferring the less restrictive \"Levantine\" designation.\nBoth families had produced leading citizens in Lebanon. Minerva Ghosn's father, Fouad Nicolas Ghosn, and her grandfather, Nicolas Mikhael Ghosn, both held high ranking positions in the Lebanese government. Fouad Nicolas Ghosn\n(1911\n-\n1984)\nwas elected MP representing Koura in\n1953\n,\n1960\n,\n1964\n,\n1968\nand\n1972\n. Elected Deputy Speaker of the House in\n1963\nand\n1972\n, he was also Deputy Prime Minister and Minister of Justice of Lebanon in\n1955\n, and Deputy Prime Minister and Minister of National Defence in\n1973\n. Nicolas Mikhael Ghosn\n(1883\n-\n1955)\nrepresented Koura in\n1913\n, was appointed by the French to the Administrative Council in\n1920\nand re-elected in\n1925\n,\n1929\n,\n1934\nand\n1937\n. He was Deputy Prime Minister and Minister of Post, Telephone, Commerce and Industry in\n1945\n. Nagib Taleb's father, Nassim Taleb, was a supreme court judge. This family background meant that the subject of this biography was born into a rich and high achieving family.\nNassim\nexplained why his father was known as \"Intelligent Student Student Intelligent\"\n[\n6\n]\n:-\nMy father was known in Lebanon as the \"Intelligent Student Student Intelligent\", after a play on words as intelligent student\n(\nor scholar\n)\nmeant \"Taleb Nagib\" and his name was Nagib Taleb, as the newspaper published his name for having the highest grade in the Lebanese baccalaureate, the high school exit exam.\nNagib Taleb had attended a Jesuit school which achieved exceptional results and it certainly did for Nagib since he achieved the highest grade in the Lebanese baccalaureate. Despite this achievement, Nagib did not like the education which produced results at the expense of students having any free time and being put though an extremely hard schedule. Nassim Taleb wrote\n[\n6\n]\n:-\n... observing my father made me realise what being a valedictorian meant, what being an 'Intelligent Student' meant. First, he had a systematic way of viewing things, so I immediately realised, when I was about ten, that school grades weren't as good outside school as they carried some side effect with them. They had to correspond to a sacrifice, an intellectual sacrifice of sorts.\nTaleb attended the Grand Lycée Franco-Libanais in Beirut. This school, founded in\n1909\n, was considered the leading French Lycée in the Lebanon. Taleb always passed his examinations without much effort but began to develop a critical approach to the type of education he was receiving\n[\n6\n]\n:-\nMy parents had an account with the large bookstore in Beirut and I would pick up books and not pay for them, in what seemed to me unlimited amounts. There was such a difference between the shelves of the library and the narrow school material; so I realised that school was a plot designed to deprive people of erudition by squeezing their knowledge into a narrow set of authors. So, when in high school, around the age of thirteen, I started keeping a log of the number of hours I read, shooting for sixty hours a week, a practice I've kept for a long time.\nIn\n1975\nthe Lebanese Civil War broke out which caused severe problems for the Grand Lycée Franco-Libanais was near the Green Line which separated the Muslim side of Beirut from the Christian side. The school buildings were badly damaged and access to the school was difficult. The Civil War had a disastrous effect on Taleb's family which lost much of its wealth and lost its political influence. When war broke out, he initially stayed in Beirut, then left, but after a while came back again. He recounted various events of his youth\n[\n6\n]\n:-\nOne summer I decided to read the twenty novels by Emile Zola in twenty days, one a day, and managed to do so at great expense. Perhaps joining a secret underground Trotskyist cell motivated me into Marxist studies, and picked up the most about Hegel indirectly ... my father gave me a complete break after I got published as a teenager in the local paper - play it safe at school and read on your own, have zero  expectation from school. Later, after I was jailed for assaulting a policeman in a student riot, he acted scared of me and let me do whatever I wanted.\nAfter he graduated from the Grand Lycée Franco-Libanais in Beirut, Taleb went to Paris for his university studies. He graduated with a Bachelor of Science degree with honours and a Master of Science degree. He said\n[\n6\n]\n:-\nI studied the exact minimum necessary to pass any exam, overshooting accidentally once in a while, and only getting in trouble in few times by undershooting.\nAt the age of nineteen he went to the United States where he studied at the Wharton School at the University of Pennsylvania. This business school was founded by Joseph Wharton in\n1881\nand from\n1921\noffered an MBA\n(\nMaster of Business Administration\n)\nprogramme. Great developments took place in the early\n1970\n, before Taleb enrolled, including the opening of Vance Hall to house the Graduate Division, the creation of the Wharton Entrepreneurial Center and the MBA Program for Executives. Taleb studied at Wharton for his MBA degree but it was during his studies there that he became fascinated by probability arguments\n[\n6\n]\n:-\n... at Wharton, I discovered that I wanted to specialise in a profession linked to probability and rare events, having a probability and randomness obsession forming in my mind. I also smelled some flaws with statistical stuff that the professor could not explain, brushing them away. At some point I realised that there was a fraud somewhere, that \"six sigma\" events\n(\nmeasures of rare events\n)\nwere miscomputed and we had no basis for their computation but I could not articulate it clearly, and was getting humiliated by people who started smoking me with complicated mathematics. So I went to the bookstore and ordered\n(\nthere was no web at the time\n)\nalmost every book with \"probability\" or \"stochastic\" in its title. I started reading them in bed, jumping from one to the other when stuck with something I did not get immediately or felt ever so slightly bored. And I kept ordering those books. It was effortless. That was my best investment as it turned out to be the topic I know the best.\nTaleb graduated from the Wharton School with an MBA in\n1983\n. From December\n1984\nhe became a Derivatives Trader\n[\n18\n]\n:-\n... he held senior positions with major financial institutions: Credit Suisse First Boston, UBS, BNP-Paribas, Indosuez\n(\nnow Calyon\n)\n, Bankers Trust\n(\nnow Deutsche Bank\n)\n. He also worked as an independent pit trader and ran his own derivatives firm for\n6\nyears.\nOn\n30\nJanuary\n1988\n, at St Anne's Episcopal Church in Atlanta, he married Cynthia Anne Shelton, the daughter of Joseph Marshall Shelton\n(1926\n-\n2003)\nof Atlanta. At the time of the marriage, Cynthia was studying for an MBA at New York University. She had graduated from the Woodward Academy in Atlanta and the University of Georgia before beginning the MBA course. Her father, a retired cinematographer, and her mother, Doris Haley Shelton, founded Shelton Productions, a film production company in Atlanta. Nassim and Cynthia Taleb had two children, Sarah Taleb and Alexander Taleb.\nIn the middle of the\n1990\ns Taleb changed the direction that his career had been taking. The following comes partly from the Preface to\n[\n2\n]\nand partly from\n[\n6\n]\n:-\nAfter closing about\n200\n,\n000\noption transactions\n(\nthat is separate option tickets\n)\nover\n12\nyears and studying about\n70\n,\n000\nrisk management reports, I felt that I needed to sit down and reflect on the thousands of mishedges I had committed. ... I quietly deposited my necktie in the trash can at the corner of Forty-fifth Street and Park Avenue in New York. I decided to take a few years off and locked myself in the attic, trying to express what was coming out of my guts, trying to frame what I called \"hidden nonlinearities\" and their effects. ... I clambered up to my attic where, during\n6\nentire months, I spent\n14\nhours a day,\n7\ndays a week, immersed in probability theory, numerical analysis, and mathematical statistics\n(\nat a Ph.D. level\n)\n. ... I fondly remember the two harsh New York winters in the near-complete silence of the attic, with the luminous effect of the sun shining on the snow warming up both the room and the project. I thought of nothing else for years. ... What I had wasn't quite an idea, rather, just a method, for the deeper central idea eluded me. But using this method, I produced close to a six-hundred-page-long discussion of managing nonlinear effects, with graphs and tables. ... \"nonlinearity\" means that the response is not a straight line. But I was going further and looking at the link with volatility, something that should be clear soon. And I went deep into the volatility of volatility, and such higher-order effects. The book that came out of this solitary investigation in the attic, finally called 'Dynamic Hedging', was about the \"techniques to manage and handle complicated nonlinear derivative exposures.\"\nThis first major work by Taleb was\nDynamic Hedging: Managing Vanilla and Exotic Options\n(1997)\n.\nHe worked for a Ph.D. at the University of Paris\n(\nDauphine\n)\nadvised by Hélyette Geman. His thesis,\nThe Microstructure of Dynamic Hedging\n, which focused on the mathematics of derivatives pricing, was examined by Hélyette Geman, Dilip Madan, Nicole El Karoui, Michel Lasry, and Marco Avellaneda. He was awarded his doctorate in\n1998\n.\nIn\n2001\nTaleb published\nFooled by Randomness: The Hidden Role of Chance in Life and in the Markets\n. Mark Rzepczynski, in the review\n[\n24\n]\nwrites:-\nFooled by Randomness is clearly not a how-to-do-it book. Some, throwing up their hands after reading Taleb's musings, may say that nothing he offers is helpful because everything is subject to chance and cannot be proven. Others may feel uncomfortable with his intellectual wandering. Yet, those who have experienced the unforeseen or improbable in the last two decades will be impressed by the book's dictum that the words \"it's not possible that ...\" should not be uttered. Rare events are not only possible; they occur more often than we think. Crises are always occurring. Beware or be fooled.\nAlex Kozinski, in the review\n[\n13\n]\nwrites:-\nMost of us would say you can't argue with success. If\n[\nan investment advisor\n]\nhas managed to make profits over a sustained period, he must have a knack for anticipating the market, and its a pretty good bet he'll keep it up. This, hedge fund operator Taleb tells us, is an example of being fooled by randomness. The investment adviser's long string of successes may be only a streak of good luck that will end once you hand him your money. Counterintuitively, even a long series of wins can be the result of chance; it all depends on how many attempts you make. ... While it is important to remember, as Taleb shows in his charming and colourful book, that randomness can fool us, ignoring the most obvious inference from the available evidence can lead to errors as well. In the end, we cannot escape making judgments - and hoping for a little luck to help us along.\nTaleb was appointed as a Fellow in the Mathematics Finance Program and an Adjunct Professor of Mathematics at Courant Institute of Mathematical Sciences of New York University in December\n1999\nand he continued in this post until December\n2005\n. He served as Dean's Professor of Decision Sciences at the University of Massachusetts, Amherst, from January\n2005\nto January\n2006\n. Throughout this time he continued working as a derivatives trader but, after spending\n21\nyears doing this and, after closing\n650\n,\n000\noption transactions and examining\n200\n,\n000\nrisk reports, Taleb changed his career in\n2006\nto become a scholar, mathematical researcher and philosophical essayist.\nIn\n2007\nTaleb published\nThe Black Swan: The Impact of the Highly Improbable.\nThis book has sold over\n3\nmillion copies, been translated into over\n30\nlanguages, and been named by\nThe Sunday Times\nas one of the twelve most influential books since the Second World War.\nYou can read the beginning of the Prologue to the book at\nTHIS LINK\n.\nYou can read some reviews of this\n2007\nedition and also of the second edition at\nTHIS LINK\n.\nIn\n[\n30\n]\nTaleb summarises his theories as follows:-\nI am exposing the fragility of knowledge about the tails of the distributions in domains where errors can be consequential. I discuss my operational reasons to select scalable laws, that is, \"true fat tails\" as default distributions and as tools to minimize exposure to such consequential errors. It is only in these cases of lessened tail dependence that statistics are safe -  and that is where its strength lies. Finally I would like to thank the discussants and 'The American Statistician'  for their open-mindedness and for giving me the opportunity to explain myself. This makes me extremely proud to be an applied statistician.\nTaleb has written three further books:\nThe Bed of Procrustes: Philosophical and Practical Aphorisms\n(2010)\n,\nAntifragile: Things That Gain From Disorder\n(2012)\nand\nSkin in the Game: Hidden Asymmetries in Daily Life\n(2018)\n. He has also written many papers and we list here some of those with a high mathematical/statistical content:\n(\nwith Emanuel Derman\n)\nThe illusions of dynamic replication\n(2005)\n;\nBlack swans and the domains of statistics\n(2007)\n;\nFiniteness of variance is irrelevant in the practice of quantitative finance\n(2009)\n;\n(\nwith Charles S Tapiero\n)\nRisk externalities and too big to fail\n(2010)\n;\n(\nwith Raphael Douady\n)\nMathematical definition, mapping, and detection of\n(\nanti\n)\nfragility\n(2013)\n;\n(\nwith Raphael Douady\n)\nOn the super-additivity and estimation biases of quantile contributions\n(2015)\n;\n(\nwith Donald Geman and Hélyette Geman\n)\nTail risk constraints and maximum entropy\n(2015)\n;\n(\nwith Pasquale Cirillo\n)\nOn the statistical properties and tail risk of violent conflicts\n(2016)\n;\n(\nwith Pasquale Cirillo\n)\nExpected shortfall estimation for apparently infinite-mean models of operational risk\n(2016)\n;\nElection predictions as martingales: an arbitrage approach\n(2018)\n; and\n(\nwith Andrea Fontanari and Pasquale Cirillo\n)\nGini estimation under infinite variance\n(2018)\n.\nTaleb was a Visiting Research Professor at the London Business School, London from\n2007\nto\n2009\n, then a Distinguished Research Scholar at the Said Business School BT Center, Oxford University from\n2009\nto\n2013\n. He has been the Distinguished Professor of Risk Engineering at the Tandon School of Engineering, New York University since\n2008\n.\nLet us end with giving a quote from Taleb's interview\n[\n10\n]\n:-\nI no longer care about the financial system. I gave them my roadmap. OK? Thanks, bye. I've no idea what's going on. I'm disconnected. I'm totally disengaged. People read\n3\nmillion copies of 'The Black Swan'. The bulk of them before the crisis. And people love it. They agree with it. They invite me to dinner. And they don't do anything about it. You have to pull back and let the system destroy itself, and then come back. That's Seneca's recommendation. He's the one who says that the sage should let the republic destroy itself.\n[\nIt used to frustrate me.\n]\nNow it doesn't.",
  "matematicos_citados_na_biografia": [
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}