{
  "nome_completo": "Nathan Joseph Harry Divinsky",
  "nome_curto": "Nathan Divinsky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Divinsky/",
  "data_nascimento": "29 October 1925",
  "local_nascimento": "Winnipeg, Manitoba, Canada",
  "data_morte": "17 June 2012",
  "local_morte": "Vancouver, Canada",
  "summary": "Nathan Divinsky was a Canadian mathematician who worked in ring theory. He is best known as a chess master.",
  "biografia": "Nathan Divinsky\n, who was widely known as 'Tuzie', was the son of Jewish Russian immigrants to Canada. His love of chess and mathematics both began at an early age. He said\n[\n3\n]\n:-\nMy father used to play chess with an uncle. I used to watch them when I was three or four. It was fascinating. I could create, instantly. I didn't have to learn a lot of details and facts and formulas. I could start moving pieces and geometric beauties began to multiply on the board and I loved beating people, especially older people and when you're five, most people are older.\nHe studied mathematics at the University of Manitoba but played chess at a high level while he was an undergraduate. He was runner-up in the Manitoba Chess Championship in\n1945\nand, in the same year, tied for third place in the Closed Canadian Chess Championship, held at Saskatoon. However, he had decided long before this that chess had to be for him a hobby rather than a profession\n[\n3\n]\n:-\n... in the\n1930\n's when we were young, it was drummed into our heads that nobody made a living from chess, and in those days nobody did. Lasker died penniless, Steinitz died penniless. These are the world champions. It was not a happy time. And the second level grandmasters starved to death. And I wasn't even in that category. So I was taught and accepted the idea that I had to do something for a living, apart from chess.\nHe graduated with a B.Sc. from the University of Manitoba in\n1946\nand continued to study for his Master's Degree in algebra at the University of Chicago at Illinois. Clearly Chicago was an excellent place to undertake research in algebra.\nAdrian Albert\nwas Acting Chairman of the Mathematics Department in the summer of\n1946\nbefore\nMarshall Stone\ncame from Harvard to take on the role of Chairman.\nSaunders Mac Lane\nand\nAndré Weil\nwere appointed to Chicago in\n1947\njoining\nAdrian Albert\n,\nIrving Kaplansky\nand Otto Schilling who were already on the staff.\nDivinsky won the Manitoba Chess Championship in\n1946\nand was awarded an M.S. from Chicago in\n1947\nafter submitting a thesis\nBurnside's problem\n. He continued to study at Chicago for his doctorate advised by\nA A Albert\nwho had returned from South America where he had spent most of the year\n1947\n.\nAlbert\n, like Divinsky, had Russian parents, and was one of the leading experts on algebras. It is not surprising, therefore, that Divinsky would write a thesis on algebras: he submitted his thesis\nPower-Associativity and Crossed Extension Algebras\nto the University of Chicago and was awarded his Ph.D. in\n1950\n. He was awarded a post-doctoral scholarship by the\nRoyal Society of Canada\nto study mathematics at Queen Mary College, University of London. He would make many visits to the UK during his career. He had been appointed to the University of British Columbia in\n1949\nand remained on the Faculty there for the rest of his career. However, he continued to take part in chess championships: he was fifth equal in the\n1951\nClosed Canadian Chess Championship and won the Manitoba Chess Championship in\n1952\n. By this time he had married his first wife; they had three daughters, Pamela, Judy, and Miriam. In\n1959\nDivinsky took over the magazine\nCanadian Chess Chat\n. He became the editor, a task he continued to undertake until\n1972\nwhen the magazine hit problems due to the printing plant being closed.\nDuring the\n1950\ns and\n1960\ns Divinsky published papers on ring theory. For example, he published\nOn commuting automorphisms of rings\n(1955)\n,\nCommutative subdirectly irreducible rings\n(1957)\n,\nOn simple, semi-radical and radical algebras\n(1959)\nand\nGeneral radicals that coincide with the classical radical on rings with D.C.C\n.\n(1961)\n. In\n1965\nhe published the book\nRings and radicals\n. I\n[\nEFR\n]\nbegan my research career in\n1965\nand found Divinsky's book very inspiring. In fact, although my topic of research was group theory, I did produce one or two papers on ring theory as a result of Divinsky's book. However, the book received mixed reviews. For example E-A Behrens liked the book, writing:-\nThe book is very readable, and is well suited for beginners in the theory of rings; it will also be of interest to research workers in the field.\nBut Jim Roseblade\n(\nwho was the external examiner for my\n[\nEFR\n]\nPh.D. in\n1968)\nwas much less enthusiastic\n[\n6\n]\n:-\nProfessor Divinsky's book, which is written for first year graduate students, aims to give the reader some of the general theory of radicals and a lot of particular radical theory. On the whole the sections devoted to the discussion of particular radical classes are successful, those devoted to the general theory rather unsuccessful.\nIn\n1964\n, Divinsky was professor of mathematics at the University of British Columbia when he met Kim Campbell who was awarded a bachelor's degree in political science from the university in that year. She wrote\n[\n1\n]\n:-\nNathan Divinsky was a professor of mathematics at UBC, and I first met him at the Frosh retreat in\n1964\n. He participated in the programme and was well liked by the students for his sense of humour.\nDivinsky was still playing chess at the highest level at this time and represented Canada in the\n1966\nChess Olympiad in Havana. He had represented Canada in the Chess Olympiad in Amsterdam in\n1954\n. After the award of her bachelor's degree, Campbell continued to study at the University of British Columbia for a Master's degree\n[\n2\n]\n:-\nCampbell started dating Divinsky, who is often described as displaying avuncular charm, in\n1967\n. He introduced her to a life of dinner parties and the politics of upper-middle class Vancouver society at a time when the campus she was studying on was in the throes of left-wing student movements and anti-Viet Nam war demonstrations. ... Divinsky ... loved to entertain in a grand manner. Even his friends describe him as outrageously right-wing, and he delighted in defending Britain's rigid class system and flaunting his political views. One friend, Fritz Bowers, says of Divinsky, \"Tuzie's very reactionary and elitist. He thinks the important thing is to look after the interests of the intelligentsia, the people who lead society.\"\nRather than rely on quotes from friends, let us quote from Divinsky himself from the interview\n[\n3\n]\n. He was asked about the work of the Vancouver School Board on which he served:-\nI tried to get more programs for gifted children. When I became chairman, we did in fact introduce programs. Administrators and teachers seem to think that democracy is such a wonderful thing that it should be introduced everywhere. In education, democracy is irrelevant. Although people should be given equal opportunity, they are not equal in abilities. To teach a midget to play basketball, is not in the best interest of society. If they want to do that, let them do that but to finance it and to spend the limited energy you have on some idiot Divinsky to get into grade\n7\ninstead of quitting at grade\n6\ninstead of doing something for a kid who has enormous talent and can contribute something to the world ... a lot of these kids suffer in school - they're bored! Teachers often resent them. ... The old adage that bright kids always land on their feet is nonsense. I have seen so many bright kids ruin their lives and collapse for factors beyond their control. You can't even the playing field. If I'm tone deaf, you can't teach me music!\nCampbell studied for a doctorate at the London School of Economics in\n1972\n-\n73\nand Divinsky spent a sabbatical year with her in London. They were married in the Hampstead Registry Office on\n15\nSeptember\n1972\n. They spent the year in London with two of Divinsky's daughters from his first marriage, namely Pamela, thirteen years old at that time, and Mimi who was nineteen. After returning to Canada in\n1973\n, Divinsky then spent a year in Oregon. In\n1975\nhe was back at the University of British Columbia and, in that year, published two books;\nLinear Algebr\na was an undergraduate mathematics textbook while\nAround the Chess World in\n80\nYears\nwas his first book on chess.\nIn\n1979\n, in partnership with three others, Divinsky began the reconstruction of the Arrow Transfer warehouse on Granville Island, Vancouver, as the Bridges Restaurant. The restaurant opened in\n1980\nas a top Vancouver attraction. In that same year Divinsky left the Vancouver School Board, which he had served on since\n1974\nhaving chairman from\n1978\nto\n1980\n. The reason he left was so that he could run for the Vancouver City Council. He was elected in\n1981\n, his wife Kim Campbell being elected to fill the position left vacant on the Vancouver School Board by his resignation. Divinsky and his wife were divorced in\n1983\nbut Kim Campbell went on the have a highly successful political career becoming the first woman prime minister of Canada in\n1993\n.\nAlthough Divinsky continued to publish the occasional mathematics paper during the\n1970\ns and\n1980\ns, he began to apply mathematical techniques to a study of the strength of various chess champions. In collaboration with the English grandmaster Raymond Keene, he published\nWarriors of the Mind: A Quest for the Supreme Genius of the Chess Board\nin\n1989\n:-\nThis book sets out to offer an objective assessment of the\n64\nstrongest chess players in history, based on statistical analyses of their performances. The book is based on a sophisticated computer analysis undertaken at the University of British Columbia.\nDivinsky explained in\n[\n3\n]\n:-\nYou use a lot of differential equations and what is called the maximum likelihood function. We have a professor who wrote several research papers in connection with Warriors of the Mind ... this is hot stuff.\nBefore this book was published, however, Divinsky had become a celebrity on British television. This came about because he came to England to be a spectator at the Kasparov v Karpov world championship match held in London in\n1986\n. BBC television enlisted him to commentate on the matches\n[\n4\n]\n:-\nDivinsky made such an impact on the specialist chess show that \"I love Divinsky\" badges swiftly proliferated among the thousands of fans thronging the venue, the Park Lane Hotel, and Terry Wogan twice invited him to pontificate on chess on his prime-time TV show. It was the most television exposure that chess had ever received in the UK.\nHe continued to play a major role in the Canadian chess scene\n[\n4\n]\n:-\nHe first became Canada's representative to the World Chess Federation in\n1987\n, acted again in this post in the mid-\n2000\ns, was president of the Canadian Chess Federation as well as the first member of the Canadian Chess Hall of Fame.\nFurther chess books followed:\nThe Batsford Chess Encyclopedia\n(1990)\n;\nLifemaps of the Great Chess Masters\n(1994)\n;\n(\nwith Felix Berkovich\n)\nJewish Chess Masters on Stamps\n(2000)\n; and\n(\nwith Raymond Keene and Jeff Sonas\n)\nWho Was The Strongest - Warriors of The Mind II\n(2002)\n. These books received mixed reviews. For example\nChess Monthly\nreviewed\nLifemaps of the Great Chess Masters\nwriting:-\nA beautifully produced large size book which will be a joy for those interested in chess facts and figures.\nHowever, chess historian Edward Winter in a review of\nThe Batsford Chess Encyclopedia\ncalled it \"A Catastrophic Encyclopedia\".\nThe obituary\n[\n4\n]\ngave this summary of Divinsky:-\nDivinsky lived his life with great passion and conviction. He was proud of his Jewish heritage and was a \"life master\" in all aspects of his existence: as a mathematics professor at UBC, a bridge and chess master, elected official on Vancouver City Council, host of mathematics quizzes on the Discovery Channel, and as a pianist. He also hosted Gilbert and Sullivan operettas, performed with his friends and family, and played the part of a chess Grandmaster in the\n1992\nfilm 'Knight Moves'.\nLet us end with a personal memory by EFR. In the early\n1980\ns, Divinsky visited the University of St Andrews, Scotland, and addressed our Pure Mathematics Seminar. I, and my colleague Colin Campbell, entertained Divinsky taking him for a meal to the Grange Inn, a nice restaurant with spectacular views over St Andrews and the bay. It was a memorable event and one which I vividly remember thirty years later. The conversation was mostly about chess - at that time Bobby Fischer, who had been World Chess Champion but had then refused to play the challenger, was living is seclusion. Divinsky, however, seemed to have frequent contact with Fischer and described his mental state in detail. What I did not know at the time was that Divinsky was a restaurant owner and extremely knowledgeable about food. He had a half melon as a starter and complained bitterly that it was the smallest melon he had ever seen. It was a memorable, but somewhat embarrassing, occasion for me.\nFinally, let us record that Divinsky married for a third time; he was survived by his wife Marilyn Goldstone.",
  "matematicos_citados_na_biografia": [
    "Adrian Albert",
    "Marshall Stone",
    "Saunders Mac Lane",
    "André Weil",
    "Irving Kaplansky",
    "A A Albert",
    "Albert",
    "Royal Society of Canada"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}