{
  "nome_completo": "Nicola Fergola",
  "nome_curto": "Nicola Fergola",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fergola/",
  "data_nascimento": "29 October 1753",
  "local_nascimento": "Naples, Kingdom of Naples (now Italy)",
  "data_morte": "21 June 1824",
  "local_morte": "Naples, Kingdom of the Two Sicilies (now Italy)",
  "summary": "Nicola Fergola was an Italian mathematician with a interest in developing geometry by classical methods.",
  "biografia": "Nicola Fergola\n's parents were Luca Fergola and Candida Starace. Luca worked as a clerk for the government. Nicola showed unusual talents at a young age and his father thought he should study law so that he might get a job leading to good pay and be held in high esteem. Fergola studied Latin literature at the Dominican school of Thomas Aquinas and here, for the first time, he came across geometry taught by an excellent teacher. He became a skilled fencer, expert in music and singing, and learnt to live simply with the religious values of the Dominicans. In fact Fergola would be a deeply religious man throughout his life and the ascetic values he learnt as a young man also remained with him.\nHe entered the University of Naples where he studied literature and philosophy. At this time there was relatively little study of advanced mathematics in Italy. The University of Naples taught some courses on geometry and arithmetic but the topics that were at the forefront were medicine and law. He did learn some mathematics from Giuseppe Marzucco\n(1713\n-\n1800)\nbut this was only up to quadratic equations. He had to study mathematics on his own, learning about the work of\nArchimedes\n,\nNewton\n,\nEuler\nand the Bernoullis. He went on to teach himself advanced mathematics by using a private library that kept copies of the proceedings of the leading European academies. In particular he read the memoirs of\nd'Alembert\nand\nLagrange\n. His interests were broad and he studied in depth the developments in the differential and integral calculus and their application to physical problems. He also took a particular interest in a whole range of geometry topics, being interested in both the synthetic and the analytic approach to the subject.\nIn\n1767\nthe Jesuits\n(\nthe Society of Jesus\n)\nwas suppressed in the Kingdom of the Two Sicilies\n(\nand in many other countries\n)\n. The Jesuit school in Naples was closed at this time and, in\n1768\n, King Ferdinand IV of Naples founded a new Institute, the Casa del Salvatore, in the premises left vacant by the Jesuits. Fergola began teaching philosophy at this school, which was later called the Liceo del Salvatore, in around\n1770\n. He also founded his own private school in Naples in\n1771\n. This school quickly acquired a high reputation and many of the brightest boys were sent to be educated at Fergola's boarding school. He taught advanced mathematics at his school and he also undertook research producing works on applications of calculus such as\nRisoluzione di alcuni problemi ottici\nⓉ\n(\nResolution of some optical problems\n)\n(1780)\nand\nLa ver misura delle volte a spira\nⓉ\n(\nThe true measure of the time to turn\n)\n(1783)\n. However, his interests turned towards the study of ancient Greek geometry and he wrote\nNuovo metodo da risolvere alcuni problemi di sito e di posizione\nⓉ\n(\nNew method to solve some problems of site and Position\n)\nin\n1786\n. Massimo Mazzotti writes\n[\n5\n]\n:-\nAround\n1786\n, Fergola began to show a particular interest in the \"forgotten methods of the ancients\". In the following years, his interest was to be directed almost exclusively towards pure geometry and synthetic methods. His main concern became to solve geometrical problems according to \"the way of the ancients,\" which he characterised as \"elegant,\" \"intuitive,\" and \"certain,\" as opposed to the unreliable procedures of an analysis that still lacked secure logical foundations.\nFergola was appointed to his first chair of mathematics on\n2\nNovember\n1789\n, namely the chair of mathematics at the Liceo del Salvatore in Naples. His appointment was a royal one, made by the King of Naples himself. The King chose Fergola for the post because he had been\n(\nsee for example\n[\n5\n]\n)\n:-\n... persuaded that the virtue and the good behaviour of the citizens are made natural through teaching.\nOne of the requirements in this post was that Fergola published the lessons that he taught. This led him to publish the two-volume text\nPrelezioni sui Principi matematici della filosofia naturale del cavalier Isacco Newton\nⓉ\n(\nLessonsi on 'Mathematical Principles of Natural Philosophy' of Sir Isaac Newton\n)\n(1792)\n. One of the interesting aspects of this work is that it presents mechanics through its historical development and Fergola gives profuse historical notes throughout the text. However, this is far more than a description of\nNewton\n's contributions, for Fergola also looked at the more recent contributions of\nEuler\n,\nd'Alembert\nand\nLagrange\n. His approach is highly dependent of the nature of force which he sees in essentially a religious form. To understand why Fergola's contributions so often are based on his religious beliefs we need to look at this aspect of his life.\nFergola was a deeply religious man who particularly venerated the Virgin Mary. He took part in the religious life of Naples and was often to be seen in the many religious processions which took place in the city. In particular he would take part in the procession to commemorate the Virgin of the Seven Sorrows, on the Friday before Palm Sunday, and in the ceremony of the liquefaction of the blood of St Januarius, Bishop of Benevento, patron of Naples which take place on\n19\nJanuary. Fergola lived essentially the life of an ascetic monk, eating only vegetarian meals and having none of the usual home comforts but living in a home with only the bare necessities for living. As a teacher, he believed that his duties went well beyond teaching his subject, and he tried to educate his students to be both good Christians and also good citizens of Naples. His mathematical lessons, therefore, included religious teaching as well as moral teaching. Of course, being a good citizen of Naples required, as well as moral teaching, also an understanding of the politics of the day and this again formed part of Fergola's teaching. One might stop and think how he could square this teaching with his brief as a professor of mathematics. In fact he saw mathematics as underlying the structure of the world and, therefore, a study of mathematics brought one closer to the mind of God. In fact Fergola wrote religious as well as mathematical memoirs. For example in\n1804\nhe wrote\nDiscorso-apologetico sul miracolo di San Gennaro\nⓉ\n(\nAn apology on the miracle of San Gennaro\n)\nwhich argued strongly for the existence of miracles in general and in particular the miracle of the liquefaction of the blood of St Januarius.\nThe French Revolution followed by Napoleon Bonaparte's military campaigns saw the fall of the French monarchy which worried King Ferdinand IV of Naples. In October\n1798\nFerdinand sent an army to Rome to retake the city and restore the rule of the pope. They entered Rome but were heavily defeated in a French counterattack. Ferdinand returned to Naples but the news of his defeat encouraged republicans in Naples to rise up against the monarchy. They took the Castel Sant'Elmo on\n20\nJanuary\n1799\nand two days later French troops entered Naples which became the Parthenopean Republic. Fergola, who was a staunch royalist, fled from Naples and lived quietly in the countryside. In June, Royalists supported by Russian and Turkish ships, entered Naples and fighting took place for several weeks. Ferdinand returned to Naples on\n8\nJuly and the Republicans were defeated. Fergola returned to take up his position again and, in recognition for his loyal support for the King, he and his pupils were given the leading chairs at the University of Naples as well as in the military and naval academies. One of these pupils,\nVicenzo Flauti\n, would be particularly important in carrying on Fergola's work.\nLet us now examine Fergola's mathematical contributions, the most important of which were written to support synthetic geometrical methods which he saw as \"the way of the ancients\". In\n1811\nhe published\nOpuscoli Matematici della Scuola del Sig. N. Fergola\nⓉ\n(\nBrochures of the Mathematical School of Mr N. Fergola\n)\n. He published his treatise on conic sections\nTrattato analitico delle sezioni coniche del signor Nicola Fergola\nⓉ\n(\nAnalytical treatise on conic sections by Mr. Nicholas Fergola\n)\nin\n1814\n. He writes in the Preface\n(\nsee for example\n[\n6\n]\n)\n:-\nFor each of the three conics I propose in orderly fashion that organic origin that was adopted by the Marquis\nde L'Hôpital\n, and many other precise geometers. In addition to purely algebraic means, and with the rules of Cartesian geometry, I propose to develop the most useful and notable properties, relative to the diameters of these curves, the tangents, the secants, the foci and their dimensions. At this juncture of the pleasantries I solve problems, some of which are extremely difficult and sublime, and we compose the results. And they should be found by elementary analytical methods and with elegant constructions, so that the young might learn these truths and become accustomed to think rigidly and with elegance in both these methods ...\nHis two methods are the synthetic method and the analytic method. Fergola favoured the synthetic approach. Massimo Mazzotti writes\n[\n5\n]\n:-\nAccording to the examples presented by Fergola, the synthetic method consists of the following steps:\n1\n. Imagine that we have done what the problem asks.\n2\n. Develop the correct consequences of this supposition.\n3\n. Reduce the problem to another well-known problem, or solve it directly.\nAt this point\n(\nafter the geometrical analysis, which is \"an ontological principle of reduction\"\n)\n, we must proceed to the \"geometrical composition\" of the problem, that is, the construction of the solution, where the order of the analysis is reversed. This last step is crucial: \"the construction is the essential condition for the proper solution of a geometrical problem.\" Both geometrical analysis and composition must he accomplished according to the ancient criteria of elegance ...\nA vigorous argument between supporters of the synthetic method and those of the analytic method broke out in\n1810\nwhen Ottavio Colecchi\n(1773\n-\n1847)\n, who taught differential and integral calculus at the Scuola di Applicazione in Naples, criticised Fergola for putting too much emphasis on pure geometry and not enough emphasis on the new methods of analysis. This argument became even more heated after Fergola's death when his supporters attacked the views of those supporting the analytic method. These attacks went further than merely being technical mathematical arguments for they accused their opponents of \"moral depravity\" and corrupting the minds of young students. Gioacchino Ventura's elegy for Fergola\n[\n2\n]\n(\nsee also the discussion in\n[\n3\n]\n)\n:-\n... said that the sciences formed a vast conspiracy against religion and public order, mathematics being the most extreme; he suggests at one point that the mathematicians' use of ruler-and-compass constructions evokes Masonic symbolism.\nIn September\n1821\nFergola's health took a turn for the worse. While at his usual daily prayers in the church of the Archdiocese, he had a slight stroke which left him with some paralysis. His condition did not improve and over the next couple of years it became progressively worse. He was buried in the San Gaetano church in Naples with much ceremony and a marble bust was erected over his grave.",
  "matematicos_citados_na_biografia": [
    "Archimedes",
    "Newton",
    "Euler",
    "d'Alembert",
    "Lagrange",
    "Vicenzo Flauti",
    "de L'Hôpital"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}