{
  "nome_completo": "Nikolai Nikolaevich Krasovskii",
  "nome_curto": "Nikolai Nikolaevich Krasovskii",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krasovskii/",
  "data_nascimento": "7 September 1924",
  "local_nascimento": "Sverdlovsk, now Yekaterinburg, Russia",
  "data_morte": "4 April 2012",
  "local_morte": "Yekaterinburg, Russia",
  "summary": "Nikolay Krasovsky was a Russian mathematician who worked in control theory, dynamical systems and differential games.",
  "biografia": "Nikolai Nikolaevich Krasovskii\n's father, Nikolai Arsenevich Krasovskii, was a graduate of Kazan University and was a medical doctor in Yekaterinburg.  Around the time Nikolai Nikolaevich was born, Yekaterinburg was renamed Sverdlovsk and it had this name from\n1924\nto\n1991\n. However, throughout this biography, we shall refer to the city as Yekaterinburg. At the time Nikolai Nikolaevich was born, his father was the head of the Clinic for Internal Diseases in Yekaterinburg and also taught in the Medical Faculty of the Ural State University where he was a professor. Nikolai Nikolaevich's mother, Mariya Fedorovna, had studied at the Bestuzhev Courses in St Petersburg. This was the best higher education institution for women at this time. She had then become a school teacher. Nikolai Nikolaevich was a late child for his parents.\nIn\n1932\nKrasovskii entered Sverdlovsk School No\n1\nin Yekaterinburg. The school motto was \"The first should be first\". He showed considerable talents in a whole range of subjects particularly the sciences where he excelled at mathematics, drawing and modelling. He also enjoyed arts subjects, particularly poetry, and as he got older he became very interested in the theatre. He was also an athletic lad being an outstanding sprinter and city sprinting champion. World War II began while he was still at school and although the fighting was far from Yekaterinburg, it was still a difficult period. Of course, since Yekaterinburg was very far from the fighting, many scientists were evacuated there during the war. In fact the USSR Academy of Sciences met in Yekaterinburg at this time. Krasovskii graduated from the School No\n1\nin\n1941\nand, because of the war, he worked as an electrician at the Ordzhonikidze Plant between\n1941\nand\n1943\n. Only in\n1943\nwas he able to continue his education and, in that year, he entered the S M Kirov Urals Polytechnic Institute. Originally this had been part of the Ural University in Yekaterinburg but had become independent of the university in\n1924\nand split into various Institutes in\n1930\n. Although it specialised in applied sciences, there was a very strong Department of Higher Mathematics which, from\n1946\n, was headed by the algebraist\nSergei Nikolaevich Chernikov\n. This meant that Krasovskii, as well as taking many courses on applied mathematics and mechanics, was able to take courses on group theory, the theory of continuous groups, and linear inequalities given by\nChernikov\n. He also studied in the Department of Metal Forming and there learnt how to use a variational approach to solve problems of metal deformation. He graduated as a plastic and thermal metalworking engineer in January\n1949\n.\nAfter graduating, Krasovskii was appointed as an assistant to the Ural Polytechnical Institute in\n1949\n. The authors of\n[\n7\n]\nwrite:-\nAt the beginning of his academic career he taught at the Ural Polytechnical Institute. He gave a great number of lecture courses during that period. His lectures were distinguished by the depth of content, high scientific level, and clarity of presentation. It is well known that he gave lectures and practical classes on a wide range of mathematical disciplines to students of the \"golden class,\" who graduated from the Faculty of Physics and Technology in\n1954\n(\nthat class gathered the best students from all the faculties of the Ural Polytechnical Institute when the Faculty of Physics and Technology was first opened\n)\n. We should note that the curriculum of the Faculty of Physics and Technology, as concerns mathematical disciplines, was at that time as comprehensive as the university curriculum of the Faculty of Mathematics and Mechanics.\nOne of the scientists who was a strong influence on him at that time was Evgenii Alekseevich Barbashin who had held the Chair of Advanced Mathematics at the Ural Polytechnical Institute since\n1943\n. Barbashin had been awarded a doctorate\n(\nequivalent to the\nhabilitation\n)\nin\n1951\nfor his thesis\nThe method of cross-sections in the theory of dynamic systems\n. Barbashin organized a seminar on qualitative methods in the theory of differential equations gathering round him an excellent team working on mathematics and mechanics. Barbashin influenced Krasovskii to work on the stability theory of motion and Krasovskii published his first papers\nTheorems on the stability of motions governed by a system of two equations\nand\n(\nwith Evgenii Alekseevich Barbashin\n)\nThe stability of motion as a whole\nin\n1952\n. Krasovskii was awarded a Master's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1953\nfor his thesis\nOn Stability of Motion under Large Initial Perturbations\nand in that year published six papers. In\n1954\nhe published nine papers and from\n1955\nhe worked towards his doctorate\n(\nequivalent to the habilitation\n)\nat the Institute of Mechanics of the USSR Academy of Sciences in Moscow advised by Nikolai Gurevich Chetaev. He was awarded the degree in\n1957\nfor his thesis\nCertain Problems of Stability Theory of Nonlinear Systems\n. In\n1959\nhe published the monograph\nStability of motion\n(\nRussian\n)\n.\nSolomon Lefschetz\nbegins a review of the Russian text as follows:-\nThis is one more highly interesting and valuable monograph on stability, and more strictly on Lyapunov's direct method, its inversion, extensions and applications. The author is indeed one of the major and most original contributors to this general theory. The problems are constantly elucidated with clarity, the definitions are given in full and most proofs are dealt with completely unless they are standard and readily accessible - at least in the Russian literature. Not only is ordinary stability dealt with but also stability over a finite time interval - practical stability. Furthermore, constant attention is paid to the size of the domain of asymptotic stability - another practical consideration. For it stands to reason that if this domain is minute what takes place is practical instability. An extensive bibliography of\n141\ntitles\n(11\nnon-Soviet titles\n)\nterminates the monograph.\nThis important book was translated into English under the title\nStability of motion. Applications of Lyapunov's second method to differential systems and equations with delay\nand published in\n1963\n. In\n1959\n, the year Krasovskii published the Russian version of this work, he was appointed to the Gorkii Ural State University in Yekaterinburg. He became chairman of the Department of Theoretical Mechanics and later, of the Department of Numerical Mathematics and then the Department of Applied Mathematics. At the Gorkii Ural State University he set up a school of control theory and differential equations.\nIn\n1968\nKrasovskii published the monograph\nTheory of control of motion: Linear systems\n(\nRussian\n)\n. Janislaw M Skowronski begins a review by writing:-\nThis monograph is concerned with the modern development of optimal control theory and deals particularly with the case of linear and quasilinear systems, presently the most popular in practical applications. The author is himself a distinguished contributor to the theory of optimal control on the basis of his previous valuable results in the qualitative theory of differential equations and\nLyapunov\nstability theory. The book presents a clear and exhaustive study of two fundamental problems:\n(1)\nto define the control parameters of a\ndynamical system\nwith minimal \"intensity'' and able to generate a prescribed motion;\n(2)\nto calculate the current variables of a moving dynamical system in view of an admissible change of a function of these variables along a motion. The problems are formulated in terms of linear and quasilinear ordinary differential equations.\nIn\n1970\nKrasovskii was appointed as head of the Institute of Mathematics and Mechanics of the\nUSSR Academy of Sciences\nin Yekaterinburg. This later became the Ural Division of the\nRussian Academy of Sciences\nwith research centres in Yekaterinburg, Perm, Cheliabinsk, Izhevsk, Prenburg, Ufa and Syktyvkar. In this role he\n[\n10\n]\n:-\n... he initiated and encouraged applied studies and the development of the computer section of the Urals Scientific Centre\n(\nthen the Urals Branch of the USSR Academy of Sciences, and later the\nUSSR Academy of Sciences\n)\n.\nKrasovskii continued to publish monographs collecting together his own research and that of his co-workers. For example\nThe Rendezvous Game Problems\n(\nRussian\n)\n(1970)\n,\n(\nwith Andrei Izmailovich Subbotin\n)\nPositional differential games\n(1974)\n, and\nControl of a dynamic system. The problem of minimum guaranteed result\n(\nRussian\n)\n(1985)\n. In\n[\n10\n]\nthe authors describe the ideas in his\n1974\nmonograph:-\nA more general concept of the positional differential game was then developed, theorems of the existence of the value of a game and of a saddle point were proved and constructive methods were proposed for generating optimal strategies. The key element was the so-called extremal shift of the real controlled object towards the ideal model, abstract or generated on a computer. The concept was extended to control problems under conditions of conflict and uncertainty of hereditary and stochastic systems, and also systems with degenerate higher derivatives.\nIt was not only high level mathematics that interested Krasovskii, for he also contributed to the improvement in school level mathematical education\n[\n10\n]\n:-\nMuch of his time and energy is given to reporting on the progress of fundamental science to applied scientists, engineers, teachers, students and schoolchildren. In the\n1980\ns he headed a campaign aiming to computerize schools and colleges in the Yekaterinburg region. This gave impetus to the subsequent raising of standards of schools in Yekaterinburg and the whole region to an adequate level of state-of-the-art information technology.\nThis aspect is also noted in\n[\n8\n]\n:-\nIn his last years he was very anxious in preserving and improving the quality of higher and secondary education in his homeland. His daily activities in this sphere were of impressive variety and effectiveness, especially his lectures to school teachers and to high school students.\nHis character is described in\n[\n8\n]\n:-\nHe was a fabulous lecturer and was very active and thorough in educational issues. ... Nikolai was a highly cultured man, whose interests ranged from literature, arts, and theatre to events in medicine and sports. His deep devotion to science, modesty and selflessness, with fairness and honesty definitely above personal interest are an everlasting example for our turbulent times.\nKrasovskii received many honours for his contributions. He was elected a corresponding member of the\nUSSR Academy of Sciences\nin\n1964\nand became a full member in\n1968\n. He was awarded the M V Lomonosov Gold Medal of the\nRussian Academy of Sciences\n, the\nA M Lyapunov\nGold Medal, the Demidov Prize in physics and mathematics, and the 'Triumph' Prize which is awarded to the leading scientists for their contribution to Russian and world science as a whole. He also received an award from the International Association of Electrical and Electronic Engineers in\n2003\nfor:-\n... his pioneering ideas, which had been received by both theorists and practical engineers.\nHe also received an 'Eminent Scholars' award from the Foundation for the Promotion of Russian Science. He was awarded an honorary degree by the\nHungarian Academy of Sciences\n, and received state prizes such as Hero of Socialist Labour, laureate of the Lenin Prize and State Prize, and knight of Soviet and Russian orders.",
  "matematicos_citados_na_biografia": [
    "Sergei Nikolaevich Chernikov",
    "Chernikov",
    "habilitation",
    "Solomon Lefschetz",
    "Lyapunov",
    "dynamical system",
    "USSR Academy of Sciences",
    "Russian Academy of Sciences",
    "A M Lyapunov",
    "Hungarian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}