{
  "nome_completo": "Oene Bottema",
  "nome_curto": "Oene Bottema",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bottema/",
  "data_nascimento": "25 December 1901",
  "local_nascimento": "Groningen, Netherlands",
  "data_morte": "30 November 1992",
  "local_morte": "Delft, Netherlands",
  "summary": "Oene Bottema was a Dutch mathematician who studied geometry and mechanics, specifically kinematics .",
  "biografia": "Oene Bottema\nwas the son of Rinze Wiltje Bottema\n(1872\n-\n1946)\nand Wijtske Hoekstra\n(1872\n-\n1951)\n. Rinze Bottema had a position with the railways and was subsequently station manager at a few village stations in the north of the country. Rinze and Wijtske were married on\n13\nAugust\n1898\nat Leeuwarderadeel, The Netherlands. Their son was given the name Oene since this was his grandfather's name, Oene Wiltjes Bottema\n(1834\n-\n1897)\n.\nAfter attending elementary school, Bottema entered the Rijks Hogere Burgerschool in Groningen. This school had been founded in\n1868\nas a five year school to train pupils for business and industry. Up to\n1917\nthe certificate earned by pupils from such schools did not allow for university entry, which was only possible for those attending a\nGymnasium\n, but in\n1917\nthe parliament passed a law allowing pupils with Hogere Burgerschool certificates to enter university to study sciences. Bottema was one of the first to benefit from this change, and in\n1918\nhe entered the Department of Mathematics and Physics of the University of Groningen.\nOne of Bottema's professors at Groningen was Julius Wolff\n(1882\n-\n1945)\nwho, after studying for a doctorate advised by\nDiederik Korteweg\n, had spent ten years as a school teacher, then was appointed professor of differential calculus, theory of functions and higher algebra at Groningen in\n1917\n. Bottema was also taught by Johan Antony Barrau\n(1873\n-\n1953)\nwho had also been advised by\nKorteweg\nfor his doctorate. Barrau had taught at the University of Delft before being appointed professor of synthetic, analytical and descriptive differential geometry at Groningen in\n1913\n. Another of Bottema's teachers, who only arrived in Groningen in\n1923\n, was the number theorist Johannes Gaultherus van der Corput\n(1890\n-\n1975)\n. Bottema was taught theoretical physics by Frits Zernike\n(1888\n-\n1966)\n, an outstanding scientist who was awarded a Nobel Prize for physics in\n1953\n. Bottema graduated from the University of Groningen in\n1924\nand began a career as a secondary school mathematics teacher.\nAfter the award of his degree in mathematics, Bottema was appointed as a teacher at the Hogere Burgerschool in Hengelo. During his teaching at Hengelo, Bottema came into contact with Willem Van der Woude\n(1876\n-\n1974)\nfrom Leiden, who acted as a commissioner at his school. Van der Woude had studied for his doctorate at Groningen advised by\nPieter Hendrik Schoute\nand, from\n1916\n, was professor of mathematics and mechanics at the University of Leiden. Bottema had published a paper while still an undergraduate, namely\nOpmerking aangaande het artikel van N. R. Pekelharing-Azn: \"Een toepassing van het lineair complex\"\nⓉ\n(\nNote on the article by N. R. Pekelharing-Azn: 'An application of the linear complex'\n)\nin which he showed that a geometrical theorem 'proved' by Pekelharing was untrue in certain cases. Bottema was keen to work towards his doctorate and, advised by Van der Woude, he undertook research while continuing to work full time as a mathematics teacher. He published three articles in Dutch in\n1925\n, namely\nOver Brachistochronen\nⓉ\n(\nOn Brachistochrones\n)\n,\nOver het osculatievlak\nⓉ\n(\nOn the oscillation surface\n)\n, and\nOver de toevallige verdeeling van een lijnsegment\nⓉ\n(\nOn the random division of a line segment\n)\n.\nIn\n1927\nBottema was awarded a doctorate for his thesis\nDe figuur van vier kruisende rechte lijnen\nⓉ\n(\nThe figure consisting of four mutually skew lines\n)\n. He gives the following acknowledgements in the thesis:-\nUpon completing my dissertation I would like to thank you, dear teachers and dear former teachers of the Faculty of Physics at the University of Groningen, my warmest thanks for your teaching.\nI am thinking in particular of you, Professor Barrau, whose lessons were of great importance to me and provided guidance for further study.\nI owe a lot to you, Professors Wolff, Zernike and van der Corput.\nProfessor van der Woude, Dear Promoter, it is impossible to describe in a short sentence the thanks I owe to you. You have met me, who was never your pupil in a narrow sense, with an interest and helpfulness, which have forever obliged me to you.\nTeun Koetsier writes\n[\n6\n]\n:-\nIn the thesis Bottema deals with the projective properties of four mutually skew lines.\nGrassmann\nhad discovered that the projective properties of such a figure are characterized by the so-called\nGrassmann\nharmonic ratio, a projective invariant for four mutually skew lines analogous to the harmonic ratio for four points on a line. In\n1878\nVoss had discovered that although a calculation by means of degrees of freedom suggests otherwise, in general there does not exist a third degree curve of double curvature that touches four given straight lines. And if there is such a curve there exist infinitely many of them. In this case the four lines form a Voss-quadruple. In the thesis Bottema studies such Voss-quadruples and other special quadruples of skew lines. In his thesis Bottema's elegant style in mathematics is already present.\nThe award of a doctorate did not mean that Bottema gave up being a school teacher. He remained active in secondary education for many years since from Hengelo he went to Groningen, and in\n1933\nhe became headmaster of the Rijks Hogere Burgerschool in Sappemeer near Groningen; then he became director of the Rijks Hogere Burgerschool in Deventer in\n1935\ncontinuing in that role until\n1941\n. At that time schools were much smaller than they are today and each headmaster also taught, so he remained a mathematics teacher.\nAlthough Bottema taught in schools from\n1924\nto\n1941\n, he also taught some university courses as a docent. In\n1930\nhe was employed as a docent at the University of Groningen to teach the course 'Special chapters in geometry.\" On\n20\nOctober\n1931\nhe delivered a public lecture\nDe meetkunde als invariantentheorie\nⓉ\n(\nGeometry as the invariant theory\n)\nheld at his acceptance of the position of docent at the University of Groningen. You can read our English version of this lecture at\nTHIS LINK\n.\nIn\n1930\nBottema married Femmina Catharina Johanna Berendsen on\n21\nAugust\n1930\nat Hengelo, Overijssel. Femmina, known as Femmy, was more than one year younger than Oene Bottema. She was the daughter of Jan Willem Berendsen, an office clerk born about\n1876\nin Enschede, Overijssel, and Willemina Luijerink, born about\n1874\nin Hengelo, Overijssel. Oene and Femmy Bottema had a daughter Willemina Wytske Bottema, born in Groningen, and a son born in Deventer.\nIn\n1938\nBottema published his first book,\nDe elementaire meetkunde van het platte vlak\nⓉ\n(\nThe elementary geometry of the plane\n)\n. His aim was to write a book on plane geometry which was completely rigorous yet looked at interesting applications as well. The\n328\n-page book looked at projective geometry as well as plane geometry and included a study of the theorems of\nDesargues\n,\nPappus\n,\nPascal\nand\nGauss\n.\nIn\n1941\nBottema left his position as director of the Rijks Hogere Burgerschool in Deventer when he was appointed as professor at the Technical University in Delft. The appointment was difficult since the vacancy occurred due to the German occupiers having dismissed the Jewish\nDavid van Dantzig\n. To avoid any bad feeling that might arise, the university decided to appoint Bottema to the chair which W A Versluys had held until\n1935\nbut which had never been filled.\nN G de Bruijn\nwrites in\n[\n2\n]\n(\nwe have added full names and dates\n)\n:-\nWhen Bottema took office in\n1941\nhe thought it was just one boring job in the mathematics department, located in the emergency wooden buildings on Jaffalaan. His colleagues didn't go out much. One of the first things what he said to his assistant was: \"I'm\n40\n, Charles Hendrik van Os\n(1891\n-\n1969)\nis\n50\n, and the rest are\n60\n.\" The rest consisted of Johannes George Rutgers\n(1880\n-\n1956)\n, Hendrik Johan van Veen\n(1879\n-\n1962)\n, Hendrik Bremekamp\n(1880\n-\n1963)\n,\nJan Arnoldus Schouten\nand Frederik Schuh\n(1875\n-\n1966)\n. ... in\n1941\nSchouten\nwas half-time being half on sick leave; he gradually disappeared from the scene. Schuh was still very active in writing textbooks but did not concern anyone.\nTeun Koetsier writes\n[\n6\n]\n:-\nAt the age of forty the name Bottema had become very well known among Dutch mathematicians. His scientific qualities were generally recognized and in\n1941\nhe became full professor for pure and applied mathematics at the Technological University in Delft. From\n1951\nto\n1959\nhe was rector magnificus\n(\npresident or vice chancellor\n)\nof the university. He was a born manager, honest and hard working. As a rector he was admired and feared. He was, moreover, a gifted orator. The speeches that he gave as rector were works of art. It is also amazing that while rector he still managed to write\n45\npapers.\nN G de Bruijn\nwrites\n[\n2\n]\n:-\nHis style was what we call today \"No nonsense, zero tolerance\". The assistants and the serving staff were scared of him. He could say things mockingly, but everyone knew that he meant it. Nothing escaped him and his memory was phenomenal.\nIn\n1944\nhe published\nHoofdstukken uit de Elementaire Meetkunde\nⓉ\n(\nChapters from elementary geometry\n)\n. A second edition was published in\n1987\nand this edition was translated into English and published as\nTopics in Elementary Geometry\nin\n2008\n. The publisher,\nSpringer\n, gives the following information about the reprint:-\nOene Bottema\n(1901\n-\n1992)\nmay not be so well known abroad, but in his own country he is \"the great geometer\". He graduated from the University of Groningen in\n1924\nand obtained his doctor's degree from Leiden University in\n1927\n. He spent his early years as a high school teacher and administrator. He published extensively, and as his ability became known, he was made professor at the Technical University of Delft in\n1941\n, and later rector of that university\n(1951\n-\n1959)\n. With his encyclopaedic knowledge of\n19\nth-century geometry and his training in\n20\nth-century rigour, he was able to make many contributions to elementary geometry, even as that subject was eclipsed by the modern emphasis on abstract mathematical structures. He also had a fruitful collaboration with engineers and made substantial contributions to kinematics, culminating in the book Theoretical Kinematics, with Bernard Roth, in\n1979\n. Throughout his life he was inspired by geometry and poetry, and favoured elegant succinct proofs. This little book, first published in\n1944\n, then in a second expanded edition in\n1987\n, gives us a glimpse into his way of thinking. It is a series of vignettes, each crafted with elegance and economy. See, for example, his proof of the Pythagorean theorem\n(1\n.\n2)\n, which requires only one additional line to be drawn. And who can imagine a simpler proof of the nine-point circle\n(4\n.\n1)\n? There is ample coverage of the modern geometry of the triangle: the\nSimson\nline,\nMorley\n's theorem, isogonal conjugates, the symmedian point, and so forth.\nBottema published around\n200\npapers during his career, but he also made contributions to high school mathematics. M C van Hoorn writes in\n[\n9\n]\n:-\nDuring the entire existence of the Hogere Burgerschool, commissioners were active during the final examinations, usually doctoral students with a PhD, who co-assessed the written work and took the oral examinations together with the examiner. In this way, Bottema, while still a teacher, came into contact with Van der Woude. A smaller group of experts took care of the examination assignments. It is the latter in which Bottema was involved, possibly since the\n1940\ns. Nowhere is this activity written. When I visited him in\n1975\n, he casually told me that he had prepared examination papers. I might have had to ask about it, although Bottema was not someone who let go more than he intended. At the time, little was known about the way in which the examination assignments were made. The assignments were there and who drafted them was irrelevant. Bottema was perfect for this work and thus certainly exerted his influence on secondary education.\nIn October\n1950\nthe Board of the Koninklijke Wiskundig Genootschap\n(\nDutch Mathematical Society\n)\nappointed a small committee with the task of drawing up a report on the structure and regulations for the International Congress of Mathematicians to be held in Amsterdam in\n1954\n.\nH D Kloosterman\nwas chair of this committee with\nHaantjes\nas its secretary and Bottema as one of the three other members.\nBottema retired in\n1971\nat the age of\n70\n. His wife Femmy had begun to suffer from multiple sclerosis in around\n1950\nand her health deteriorated so that she was confined to a wheelchair. She became totally dependent on Bottema who took care of her in the most loving way. Femmy died in\n1981\n. After retiring, Bottema continued to produce research papers, the last appearing in\n2001\nnearly\n10\nyears after his death. This last paper,\nThe Malfatti problem\n, has the following summary:-\nA solution is given of\nSteiner\n's variation of the classical\nMalfatti\nproblem in which the triangle is replaced by three circles mutually tangent to each other externally. The two circles tangent to the three given ones, presently known as Soddy's circles, are encountered as well.\nBottema received many honours for his contributions. He was elected to the\nParis Academy of Sciences\nin\n1954\n. In\n1958\nhe was honoured by his country when he was made Knight of the Order of the Nederlandsche Leeuw and, in\n1959\n, he became Commander of the Order of Orange Nassau. He received an honorary doctorate from the University of Leeds, England, in\n1958\n. He was also made an honorary member of the\nDutch Mathematical Society\nand the International Federation for the Theory of Machines and Mechanisms. When he retired in\n1971\nhe was presented with the Gold Medal of the city of Delft.\nLet us end this biography with T Koetsier's description of Bottema's character and interests\n[\n6\n]\n:-\nBottema was an erudite man, the opposite of a man only occupied with mathematics. He had a vast knowledge of history and literature, which is obvious from his public lectures and articles in literary journals. On his seventieth birthday his friends gave him a book, which he had in fact written himself. It contains a selection of his best public addresses and literary articles. The title of the book 'Steen en Schelp'\n(\nStone and Shell\n)\nwas taken from an address with the same title. Bottema admired Wordsworth, who in Book V of 'The Prelude' uses the stone and the shell to represent respectively geometrical truth and poetry. For Bottema the unshakable argument of geometry and the inspiration of poetry were the two indispensable guides in life. He disdained belaboured and messy solutions in his mathematics and in all other aspects of his life. As a mathematician, an administrator and a human being, Bottema always attempted to create a good balance between content and form. That is how we remember him; mathematics, poetry and, of course, the presence of his inseparable pipe.\nOne final amusing story from\n[\n2\n]\n. Bottema attended\nN G de Bruijn\n's public defence of his thesis at the University of Amsterdam in\n1943\n:-\nIt was a public promotion and Bottema would ask a question from the audience. However, because he did not understand the thesis\n(\n\"It is still tied up in my cupboard,\" he said\n)\n,\nde Bruijn\nhad written the question for him. And because he did not want to look as if he was reading from notes, he had learned the text that\nde Bruijn\nhad given him before. So nothing could go wrong. But what was revealed by\nde Bruijn\n's acceptance speech? Bottema had learned his lesson too well and in addition to the question he gave the answer\n(\nthat\nde Bruijn\nhad written for the sake of completeness\n)\n. A nice directing error.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Diederik Korteweg",
    "Korteweg",
    "Pieter Hendrik Schoute",
    "Grassmann",
    "THIS LINK",
    "Desargues",
    "Pappus",
    "Pascal",
    "Gauss",
    "David van Dantzig",
    "N G de Bruijn",
    "Jan Arnoldus Schouten",
    "Schouten",
    "Simson",
    "Morley",
    "Dutch Mathematical Society",
    "H D Kloosterman",
    "Haantjes",
    "Steiner",
    "Malfatti",
    "Paris Academy of Sciences",
    "de Bruijn"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}