{
  "nome_completo": "Oskar Bolza",
  "nome_curto": "Oskar Bolza",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bolza/",
  "data_nascimento": "12 May 1857",
  "local_nascimento": "Bergzabern, Rhenish Palatinate (now Germany)",
  "data_morte": "5 July 1942",
  "local_morte": "Freiburg im Breisgau, Germany",
  "summary": "Oskar Bolza worked on function theory, integral equations and the calculus of variations.",
  "biografia": "Oskar Bolza\n's parents were Luise Koenig and Moritz Bolza. The family moved around in southern Germany until\n1873\nwhen they settled in Freiburg im Breisgau. Oskar's father manufactured printing presses and it was the family's intention that Oskar should follow in his father's trade. Oskar began his secondary schooling in Neuchâtel but when the family moved to Freiburg he continued his secondary schooling there. He took his university entrance examinations in the summer of\n1875\nentering the University of Berlin in the October of that year. Initially he was interested in languages and physics so he took two courses, a liberal education course at the university and at the same time a technical course at the Berlin Gewerbeakademie. This proved to be too demanding for Bolza so he decided to concentrate on physics at the University. He studied under two leading physicist, namely\nHelmholtz\nand\nKirchhoff\n, from\n1876\nto\n1878\n. This went well but when he spent the summer of\n1878\nworking in August Kundt's physics laboratory in Strassburg he found that the experimental work was not to his liking. He changed to study pure mathematics from the autumn of\n1878\nand worked with on this topic for two years. From\n1878\nuntil\n1881\nBolza studied mathematics under\nChristoffel\nand\nReye\nat Strasbourg, under\nSchwarz\nat Göttingen and under\nWeierstrass\nat Berlin. He attended\nWeierstrass\n's\n1879\nlecture course on the\ncalculus of variations\nwhich was to have a lasting effect on the direction that Bolza's mathematical interests would take.\nDespite working under such an eminent collection of mathematicians, Bolza did not find a research topic. Deciding that he did not have the talent to do original mathematics, he took the examinations to qualify to become a secondary school teacher in\n1882\n. After teaching at a\ngymnasium\nin Freiburg for a year to qualify as a teacher, he found that he could not give up the idea of research so easily and he began working on\nhyperelliptic functions\n. He was well on his way to a doctorate when he learnt that\nGoursat\nhad discovered the results he had obtained before him, and even worse was the fact that\nGoursat\n's methods were more elegant than Bolza's. Given his earlier doubts one might think that this would be the final straw which would make Bolza give up completely the notion of research. However, it had the opposite effect for he now realised that he did have the necessary talent so he was able to press ahead. He returned to the University of Berlin where he worked with\nKronecker\nand\nFuchs\nbut, after corresponding with\nKlein\nabout the results he was obtaining, he decided to make one final change in his long route to a doctorate and went to Göttingen to be supervised by\nKlein\n. He completed his doctoral studies after eight years of study and many changes of direction, and received his doctorate in\n1886\nfrom the Georg- August- Universität Göttingen for his thesis\nÜber die Reduction hyperelliptischer Integrale erster Ordnung und erster Gattung auf elliptische, insbesondere über die Reduction durch eine Transformation vierten Grades\nⓉ\n(\nOn the reduction of hyperelliptic integrals of the first order and the first kind of elliptical, in particular through the reduction by a transformation of the fourth degree\n)\n.\nBolza had become a close friend of\nMaschke\n's while the two studied together at Berlin. They were now together again at Göttingen where they both worked with\nKlein\nas postdoctoral research assistants.\nMaschke\nfound working with\nKlein\nin his home in the evenings very rewarding, but once again Bolza suffered self doubts, feeling that he was not good enough to get an academic post in Germany. Bolza wrote that he felt:-\n... an immense distance between\nKlein\n's brilliant genius, supported by a wonderful capacity for geometric visualisation ...\n[\nand my\n]\n... purely analytic gifts, deficient of all fantasy and lying in an entirely different direction.\nWhen one of his friends moved to the United States, Bolza was tempted to follow his example. He spent the winter of\n1887\n-\n88\nin England improving his English, then emigrated to the United State in\n1888\n. He travelled to Baltimore hoping to get an appointment at Johns Hopkins University, carrying with him a strong recommendation from\nKlein\n. There he met Newcomb who told Bolza that had he known that he was intending to emigrate to the United States he would have strongly advised against it. Newcomb then wrote to\nKlein\non\n23\nApril\n1888\nin an attempt to stop further German mathematicians coming to the United States:-\nI never advise a foreign scientific investigator to come to this country, but always tell him that the difficulties in the way of immediate success are the same that a foreigner would encounter in any country. ... We have indeed several hundred so-called colleges but I doubt that if one half of the professors of mathematics in them could tell what a\ndeterminant\nis. All they want in their professors is an elementary knowledge of the branches they teach and the practical ability to manage a class of boys, among whom many will be unruly. Considerations of religion, personal influence, and former connection with the college also come into play.\nDuring\n1889\nBolza worked at Johns Hopkins University where Newcomb gave him a temporary short-term appointment, then he obtained a position at Clark University. Clark University, which opened in Worcester, Massachusetts, in\n1887\n, was established by Jonas Gilman Clark, a Worcester native and successful merchant, and G Stanley Hall, a psychologist and first president of the university. Clark University started as a graduate institution, the first undergraduates entering only in\n1902\n. The University hired some excellent mathematicians, and there Bolza became a colleague of\nWhite\nand\nStory\n. While at Clark, Bolza published the important paper\nOn the theory of substitution groups and its application to algebraic equations\nin the\nAmerican Journal of Mathematics\n. However a serious political situation arose at Clark University and a vote of no confidence was passed in the president G Stanley Hall. Nine of the eleven members of faculty left Clark including both\nWhite\nand Bolza, who decided to return to Germany.\nIn\n1892\nthe University of Chicago opened and the head of the mathematics department,\nEliakim Moore\n, began building up a strong unit. He persuaded Bolza not to return to Germany but instead to come to work at Chicago. Bolza joined the University of Chicago in\n1892\nand then he persuaded\nEliakim Moore\nto bring his friend\nMaschke\nto Chicago. The three were highly influential in building up a strong mathematics research school in Chicago. R C Archibald writes:-\nThese three men supplemented one another remarkably. Moore was a fiery enthusiast, brilliant, and keenly interested in the popular mathematical research movements of the day; Bolza, a product of the meticulous German school of analysis led by\nWeierstrass\n, was an able, and widely read research scholar;\nMaschke\nwas more deliberate than the other two, sagacious, brilliant in research, and a most delightful lecturer in geometry. During the period\n1892\n-\n1908\nthe University of Chicago was unsurpassed in America as an institution for the study of higher mathematics.\nBetween\n1892\nand\n1910\nthe mathematics department was outstandingly successful with thirty-nine students graduating with doctorates\n(\nnine of them students of Bolza\n)\n. These included Leonard\nDickson\n, who was the first to be awarded a Ph.D. in mathematics by the University of Chicago,\nGilbert Bliss\n,\nOswald Veblen\n,\nRobert Moore\n,\nGeorge D Birkhoff\nand T H Hildebrandt.\nBolza published\nThe elliptic s-functions considered as a special case of the hyperelliptic s-functions\nin\n1900\nwhich related to work he had been studying for his doctorate under\nKlein\n. However, he worked on the calculus of variations from\n1901\n. Papers which appeared in the\nTransactions of the American Mathematical Society\nover the next few years were:\nNew proof of a theorem of Osgood's in the calculus of variations\n(1901)\n;\nProof of the sufficiency of Jacobi's condition for a permanent sign of the second variation in the so-called isoperimetric problems\n(1902)\n;\nWeierstrass' theorem and Kneser's theorem on transversals for the most general case of an extremum of a simple definite integral\n(1906)\n; and\nExistence proof for a field of extremals tangent to a given curve\n(1907)\n. His text\nLectures on the Calculus of Variations\npublished by the University of Chicago Press in\n1904\n, became a classic in its field and was republished in\n1961\n. After the death of his friend\nMaschke\nin\n1908\n, Bolza became unhappy in the United States and, in\n1910\n, he and his wife returned to Freiburg in Germany where he was appointed as an honorary professor. Chicago gave him the title of 'non-resident professor of mathematics\" which he retained for the rest of his life.\nImmediately after his return to Germany Bolza continued teaching and research, in particular on function theory,\nintegral equations\nand the calculus of variations. Two papers of\n1913\nand\n1914\nare particularly important. The first\nProblem mit gemischten Bedingungen und variablen Endpunkten\nⓉ\n(\nProblem with mixed conditions and variable end-points\n)\nformulated a new type of variational problem now called 'the problem of Bolza' and the second studied variations for an integral problem involving inequalities. This latter work was to become important in\ncontrol theory\n. Bolza returned to Chicago for part of\n1913\ngiving lecturers during the summer on function theory and integral equations.\nWorld War I greatly affected Bolza and, after\n1914\n, he undertook no further research in mathematics. He became interested in religious psychology, languages\n(\nparticularly Sanskrit\n)\n, and Indian religions. He published\nGlaubenlose Religion\nⓉ\n(\nReligion without belief\n)\nin\n1930\nalthough it did not appear under his own name, rather under the pseudonym F H Marneck. He returned to mathematics, however, lecturing at Freiburg from\n1929\nto\n1933\nwhen he retired.",
  "matematicos_citados_na_biografia": [
    "Helmholtz",
    "Kirchhoff",
    "Christoffel",
    "Reye",
    "Schwarz",
    "Weierstrass",
    "calculus of variations",
    "gymnasium",
    "hyperelliptic functions",
    "Goursat",
    "Kronecker",
    "Fuchs",
    "Klein",
    "Maschke",
    "determinant",
    "White",
    "Story",
    "Eliakim Moore",
    "Dickson",
    "Gilbert Bliss",
    "Oswald Veblen",
    "Robert Moore",
    "George D Birkhoff",
    "integral equations",
    "control theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}