{
  "nome_completo": "Ottó Varga",
  "nome_curto": "Ottó Varga",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varga_Otto/",
  "data_nascimento": "22 November 1909",
  "local_nascimento": "Szepetnek, Hungary",
  "data_morte": "14 June 1969",
  "local_morte": "Budapest, Hungary",
  "summary": "Ottó Varga was a Hungarian mathematician who worked in differential geometry.",
  "biografia": "Ottó Varga\n's parents were Imre Varga, who was a Lutheran minister, and Margit Henning. Ottó had an elder brother whom he was brought up with and shared the same schooling but the brother died while a young man. At the time of Ottó's birth, his father, Imre Varga, was a Lutheran minister in the small village of Szepetnek. Imre Varga took his family to several different towns as he served at various Lutheran churches. In\n1910\n, when Ottó was a baby, the family moved to the city of Zagreb which, at that time, was in the Austro-Hungarian Empire. However, after a short time the family moved again, this time to Poprád in Szepes County, again part of the Austro-Hungarian Empire at that time. Although part of the Austro-Hungarian Empire, about a quarter of the population was German speaking, about twelve per cent Hungarian speaking, and nearly sixty per cent was Slovak speaking. Poprád was at this time growing strongly due to the railway which had been established in the\n1870\ns. At first Imre Varga was a Lutheran minister in a church in Poprád but later became archdeacon of Szepes County.\nOttó began his schooling in Poprád where he attended the local Hungarian primary school. Despite it being an Hungarian school, his teacher was German. In\n1919\nhe began his secondary schooling at the Lutheran High School in Késmárk, which is an attractive historic town at the foot of the Tatra mountains about\n15\nkm north east of Poprád. Teaching at this school was in German and quickly Ottó spoke both Czech and German as a native speaker. Now Ottó began his secondary education after World War I had ended and at that time Szepes County had become part of Slovakia within Czechoslovakia. This was confirmed in the international Treaty of Trianon in\n1920\nwhich set the borders of Hungary. We should note that the town of Késmárk is now known as Kezmarok in Slovakia.\nThe director of the Lutheran High School in Késmárk was Károly Bruckner\n(\nborn\n1875)\n. Now Bruckner was a Cipszerek, a German-speaking ethnic group in Szepes. He had taken part in the Szepes Republic which was formed in\n1918\nbefore the region was taken over by the Czechs and Slovaks. In addition to being the director of the school, Bruckner taught mathematics and it was his teaching that inspired Varga. Tünde Kántor writes that at the\ngymnasium\nVarga was a good student in all subjects but\n[\n2\n]\n:-\n... loved descriptive geometry as well. For a long time he did not understand why the teacher explained so much, why he kept repeating and illustrating details, whereas he found everything clear from the first moment, and he saw lines and planes in space exactly. Later he also made a good use of his extraordinary stereoscopic vision in his world-famous studies in\ndifferential geometry\n.\nHis abilities meant that, while at the Gymnasium, Varga's teacher asked him to help by teaching the less able students. However, when he was sixteen years old he began to read the third edition of Adam Ritter von Burg's\nCompendium der höhern Mathematik\nⓉ\n(\nCompendium of higher mathematics\n)\n. Adam von Burg\n(1797\n-\n1882)\nhad originally published the book in Vienna in\n1836\nand this third edition appeared in\n1859\n. When Varga began to study this book he realised that, although he had been doing well in mathematics at school, he actually knew very little mathematics. He graduated from the Lutheran High School in Kezmarok in\n1927\nand began his studies at university.\nNow although Varga was primarily interested in mathematics, his father was keen that he should train for a useful profession and certainly Imre didn't see mathematics as falling into this category. Varga, therefore, entered the Faculty of Architecture at the Technical University of Vienna in\n1927\n. Choosing architecture was basically a compromise between Varga's wish to study mathematics and his father's wish that he train for a useful profession. Certainly there was some descriptive geometry taught in the architecture course, which Varga loved, but there was not nearly enough mathematics to keep him happy. After one year in Vienna, he moved to Prague where he enrolled as a student in the Faculty of Sciences at the German University of Prague and also registered for courses at the Czech Technical University of Prague. This technical university had been the Prague Polytechnical Institute before the Austro-Hungarian Empire was dissolved and had only become the Czech Technical University of Prague in\n1920\n. We also note that the Charles University of Prague had been the Charles-Ferdinand University of Prague in the time of the Austro-Hungarian Empire. This university had been split into the Czech Charles-Ferdinand University and the German Charles-Ferdinand University since the middle of the\n19\nth\ncentury but after the end of the Austro-Hungarian Empire the German Charles-Ferdinand University became the German University of Prague while the Czech Charles-Ferdinand University became the Charles University of Prague.\nLudwig Berwald\nbecame a full professor at the German University of Prague in\n1924\nand, after\nGeorg Pick\nretired in\n1929\n, he became head of the Department of Mathematics.\nBerwald\nwas an expert in differential geometry and considered by many as the founder of\nFinsler\ngeometry. He soon realised that Varga had a special talent for geometry and began to advise him on topics in differential geometry; Varga began to undertake research. In\n1933\nhe graduated with a degree which qualified him to teach mathematics and descriptive geometry at high school level. He continued research, advised by\nBerwald\n, and was awarded a Ph.D. in\n1934\nfor his thesis\nOn Finsler spaces.\nBerwald\nthen advised Varga to continue his studies in Hamburg where\nWilhelm Blaschke\nheaded a world-famous school of geometry. Varga spent the academic year\n1934\n-\n35\nat Hamburg. While in Hamburg in March\n1935\nhe submitted the paper\nIntegralgeometrie\n3\n. Croftons Formeln für den Raum\nⓉ\n(\nIntegral Geometry\n3\n. Crofton type  formulas for area\n)\nto\nMathematische Zeitschrift\n. This paper was the third in a series of papers on integral geometry, the first two being written by\nBlaschke\nand both being published in\n1935\n. Varga published a joint paper with\nBlaschke\n, namely\nIntegralgeometrie\n9\n. Über Mittelwerte an Eikörpern\nⓉ\n(\nIntegral geometry\n9\n. Means for solids\n)\nwhich appeared in\n1936\n. In July\n1936\nhe submitted the paper\nIntegralgeometrie\n19\n. Mittelwerte an dem Durchschnitt bewegter Flächen\nⓉ\n(\nIntegral geometry\n19\n. Means for the average moving surfaces\n)\nto\nMathematische Zeitschrift\n. He gives both Hamburg and Prague as his address on this paper since he was appointed to the Institute of Mathematics at the University of Prague in\n1936\n. He writes in this paper:-\nI wish to express my thanks to Herr\nBlaschke\nfor his suggestion concerning this work, as well as his valuable advice.\nIn February\n1937\n, now working as\nBerwald\n's assistant in Prague, Varga and\nBerwald\nsubmitted the joint paper\nIntegralgeometrie\n24\n. Über die Schiebungen im Raum\nⓉ\n(\nIntegral Geometry\n24\n. On shifts in space\n)\nto\nMathematische Zeitschrift\n. They give the following acknowledgement to\nBlaschke\n:-\nWe would like to take this opportunity to express our thanks to Herr\nBlaschke\n, who sent us copies of his available work, for his kindness.\nIn\n1938\nVarga spoke at the meeting of the meeting of the Deutscher Physiker und Mathematikertag in Baden-Baden. In\n[\n1\n]\nan interesting episode is related\n(\nwe have no independent collaboration of this story\n)\n. It begins with a letter sent by Gerhard Kowalewski\n(1876\n-\n1950)\nto\nLudwig Bieberbach\n. In\n1940\nKowalewski was a member of the Nazi Party, an editor of\nDeutsche Mathematik\nand a professor of mathematics at the German University of Prague. He wrote to\nBieberbach\nfrom Prague in December\n1940\nto complain about\nBlaschke\n's treatment of Varga\n[\n1\n]\n:-\nAccording to Kowalewski, Varga gave a quite original talk in integral geometry at Baden-Baden and, naturally enough, apparently sent\nBlaschke\na manuscript of his talk.\nBlaschke\nasked him for a manuscript publishable in the Hamburger 'Abhandlungen'. Varga replied that he had already sent it elsewhere. Many weeks later Varga received his manuscript back \"with the dry remark\" that in Hamburg similar results were already known. Then\nBlaschke\npublished the same result, even using Varga's notation. Varga's paper appeared in an obscure journal published in Pressburg\n(\nmodern Bratislava\n)\nwith a footnote referring to his Baden-Baden lecture. Not only did\nBlaschke\nnot cite Varga, but the two publications are said to be virtually identical. Varga naturally complained - but this only earned him\nBlaschke\n's dislike\n(\nand, after all he was only a Prague\nPrivatdocent\n, whereas\nBlaschke\nwas an internationally known Hamburg professor\n)\n. In fact, when Kowalewski enthusiastically recommended Varga for a position in Braunschweig, and Kowalewski heard of it, he apparently remarked to the Braunschweig authorities that \"he did not know whether Varga stood\n100\n% in agreement with the new state\" - enough to prevent Varga from getting the position.\nBlaschke\ntried\n(\nunsuccessfully\n)\nto prevent Varga from advancing academically within Germany itself, as he pressured Varga to accept a job in Pressburg, a suggestion Kowalewski called \"rather shabby.\" It was after this last, in early December\n1940\n, that Kowalewski wrote to\nBieberbach\n- writing earlier seems to have been delayed by illness.\nBy the time Kowalewski wrote this letter, German troops were in Prague. In fact they occupied Prague from\n15\nMarch\n1939\nand, on the following day Hitler went to Prague Castle and declared Bohemia and Moravia to be a German protectorate. Now this German invasion had given Varga a severe problem. He was\nBerwald\n's assistant in Prague, but\nBerwald\nwas Jewish. In October\n1941\nBerwald\nwas deported by the Nazis to the Ghetto in Lódz, Poland, where he died a few months later. With his position in Prague falling apart, Varga decided to return to Hungary in\n1941\n. He was offered a position at the university in Kolozsvár\n(\ntoday Cluj, Romania\n)\nand also a position at the university in Debrecen. He accepted the invitation from Kolozsvár where he again\nhabilitated\nand became a lecturer. However, after a year he moved to Debrecen\n[\n6\n]\n:-\nAt that time he was the single mathematician at Debrecen University. This was not an exceptional phenomenon. Between the two world wars a chair usually meant a single professor and not more. Only the chairs with laboratories, as the chairs for physics or chemistry were exceptions, where one could find a first\n(\nsenior\n)\nassistant.\nVarga was promoted to extraordinary professor at Debrecen in\n1947\nand an ordinary professor in the following year. Varga had met Jolán Pukánszky in Debrecen in\n1945\n. Jolán, who worked with\nBéla Gyires\nat the Mathematical Institute, was the sister of Lajos Pukánszky\n(1928\n-\n1996)\n. Lajos Pukánszky later studied mathematics at the University of Szeged, went to the United States in\n1956\nand spent the greatest part of his career at the University of Pennsylvania. He is known for his outstanding work on the\nrepresentation theory\nof soluble Lie groups. Varga married Jolán Pukánszky in\n1947\nand they had one child, a daughter Borbála. At Debrecen Varga was dean of Faculty of Science\n(1949\n-\n1950)\nand then Head of the Department of Mathematics\n(1950\n-\n1959)\n.\nLajos Tamássy give an excellent account of Varga's mathematical contributions in\n[\n6\n]\n. Below we give his introduction to these contributions given under the headings 'Invariant differential', 'Flag curvature', 'Invariant basis', 'Angular metric', and 'Spaces of constant curvature':-\nIf somebody wants to develop\nFinsler\ngeometry on the analogy with Riemannian geometry, the existence of a linear metrical connection is indispensable. A connection of this kind was created by\nElie Cartan\n. First it was published in his short 'Comptes Rendus' article\n(1933)\n, and then in his booklet 'Les espaces de Finsler'\nⓉ\n(\nFinsler spaces\n)\n(1934)\n. Varga finished his first work at the time of the publication of the 'Comptes Rendus' article. Varga introduced and studied in his work the concept of an affine connection and its curvatures in the line element manifold of a\nFinsler\nspace. His work had a considerable overlapping with\nCartan\n's article and booklet. Therefore it was published only in a local journal in\n1936\n. A few years later Varga resumed the theme, and gave an elegant, geometrical construction for the metrical parallel translation, and thus for the metrical linear connection in\nFinsler\nspaces. These ideas were applicable also for the introduction of the\nCartan\nconnection and of the flag curvature.\nTünde Kántor writes about Varga's approach to research in\n[\n2\n]\n:-\nHe was not a scientist of quick, sparkling wits. He kept saying that he would hardly do very well in a competition for students. But what he conceived and thought over carefully in his silent loneliness always contributed substantially to the development of differential geometry and it was always free from flaws and errors. ... In Hungary Ottó Varga was the leading scientist in differential geometry and he became the founder of the Debrecen School of Differential Geometry.\nHowever Varga did not spend the rest of his career in Debrecen. Although he liked the country atmosphere there, he always longed for the big city life of Budapest. He applied for a position at\nLórand Eötvös\nUniversity in Budapest in\n1946\nbut was not successful. He became a corresponding member of the\nHungarian Academy of Sciences\nin\n1950\nand advised a number of students taking Ph.D. degrees. For example he supervised Gyula Soós' thesis\nTransformation groups of line element manifolds\n(1955)\n, Miklós Farkas's thesis\nPeriodic Perturbations of Autonomous Systems\n(1957)\n, Arthur Moór's thesis\nGeometrische Untersuchungen in allgemeinen metrischen Linienelementräumen\nⓉ\n(\nGeometrical investigations in general metric line-element spaces\n)\n, and János Szenthe's thesis\nOn the metric characterization of symmetric spaces\n(1967)\n. Kántor writes\n[\n2\n]\n:-\nHe did not like examining students, and he asked them only questions which helped them. He was always very patient. He loved instructing talented young people.\nVarga was made head of the differential geometry research group in the\nHungarian Academy of Sciences\nin\n1958\n, an ordinary member of the Academy in\n1965\nand, in\n1967\n, he was made a senior researcher at the Academy's Mathematical Institute.\nIn\n1954\nthe University of Szeged tried to persuade him to take a position there but he refused. Then in\n1959\nhe was invited to become a professor in the Department of Mathematics of the Faculty of Architecture of the Technical University of Budapest. He retired in\n1967\nfrom his chair at the Technical University and, two years later, from his position as senior researcher at the\nHungarian Academy of Sciences\n' Mathematical Institute.\nAmong the honours Varga received, we mention the Gyula König Medal in\n1944\nfrom the Mathematical and Physical Society\n(\nsince\n1947\nthe\nJános Bolyai Mathematical Society\n)\n, and the Kossuth Prize from the\nHungarian Academy of Sciences\n(1952)\n.\nFinally, Tünde Kántor writes about Varga's personality and hobbies in\n[\n2\n]\n:-\nHe always complained about his health. ... He was very sociable, and he always dressed elegantly. ... He was an enthusiastic linguist, and he wanted to discuss the problems of Slavonic languages from a mathematical point of view. His hobby was reading novels whose plots take place in Upper Hungary. In Debrecen he used to play tennis ... and he sometimes went to Tóth\n(\nPálma\n)\nCafé in Simonyi street with\nBéla Gyires\nand\nAndrás Rapcsák\nto have a chat. In Budapest he used to walk with Lásló Fejes Tóth to Hármashatárhegy, or he went to Lukács Café in Andrássy street with Gyula Stommer.\nHe had a minor heart attack in\n1961\nand a more serious one in\n1962\n. A disease of heart muscle meant that from that time on he easily became tired. He died from heart disease at the relatively young age of\n59\n.",
  "matematicos_citados_na_biografia": [
    "gymnasium",
    "differential geometry",
    "Ludwig Berwald",
    "Georg Pick",
    "Berwald",
    "Finsler",
    "Wilhelm Blaschke",
    "Blaschke",
    "Ludwig Bieberbach",
    "Bieberbach",
    "Privatdocent",
    "habilitated",
    "Béla Gyires",
    "representation theory",
    "Elie Cartan",
    "Cartan",
    "Lórand Eötvös",
    "Hungarian Academy of Sciences",
    "János Bolyai Mathematical Society",
    "András Rapcsák"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}