{
  "nome_completo": "Paul Emile Appell",
  "nome_curto": "Paul Appell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Appell/",
  "data_nascimento": "27 September 1855",
  "local_nascimento": "Strasbourg, France",
  "data_morte": "24 October 1930",
  "local_morte": "Paris, France",
  "summary": "Paul Appell was a French mathematician who worked in analysis, geometry and mechanics.",
  "biografia": "Paul Appell\n's parents Jean-Pierre Appell and Elizabeth Müller were Catholics from Alsace. They were loyal to France, living in a disputed area which had been a German territory until the Peace of Westphalia in\n1648\ngave control of Alsace-Lorraine to France. Appell's father was a dyer at Ritterhus and the whole family, including two half-brothers, worked in the business.\nIn\n1866\nAppell's family were forced to leave Ritterhus and his father died the following year. Appell rejected the Catholic views of his parents but he retained their strong patriotic French views. He insisted, in\n1869\n, on leaving the Catholic school which he was attending and studying instead at a lycée.\nOn\n14\nJuly\n1870\nBismarck provoked France and they declared war five days later. The German offensive was efficient, the French mobilisation was not. Appell's youngest half-brother Charles, who Appell was very close to, joined the French forces. Within four weeks the Germans had surrounded a French field army at Metz. The main French army attempted to lift the siege but was itself surrounded and trapped by the Germans at Sedan. On\n2\nSeptember\n83\n,\n000\nFrench troops surrendered. The Germans captured Strasbourg after a\n50\n-day siege in which Appell suffered greatly.\nFrench resistance was carried on by a new French government. On\n19\nSeptember the Germans began to besiege Paris. New French armies engaged but could not defeat the German forces. Metz surrendered on\n27\nOctober and Paris surrendered on\n28\nJanuary\n1871\n. Germany annexed Alsace and half of Lorraine with Metz. Strasbourg was annexed by the Germans and Appell moved to Nancy to become a French citizen and prepare himself to study at university in Paris.\nAppell became a life-long friend of\nPoincaré\nwhile at Nancy. He entered the École Normale Supérieure in Paris in\n1873\nand graduated in first place in\n1876\nwith a doctorate in mathematics. K O May writes in\n[\n1\n]\n:-\nFrom this time on, Appell maintained an amazing level of activity in teaching, research, editing and public service.\nIn\n1881\nAppell married Amelie, niece of\nBertrand\nand of\nHermite\nand a cousin of\nÉmile Picard\n. One of his three daughters was to marry\nBorel\n. In\n1885\nhe was appointed to the Chair of Mechanics at the Sorbonne.\nAppell now worked in Paris but returned for each vacation to German held Alsace. There he was given information by his half-brother Charles, which he would report to the French War Office on his return to Paris. Basically Appell and his brother Charles were acting as spies and informants for France against Germany. Charles was to pay a price for this when, in\n1889\n, he was imprisoned for anti-German activities.\nIn\n1892\nAppell was elected to the\nAcadémie des Sciences\n. He served as Dean of the Faculty of Science of the University of Paris from\n1903\nto\n1920\nand, at the end of his deanship, he was appointed Rector of the University of Paris. He was rector from\n1920\nto\n1925\n. However he also served in many other roles and his activity in these is described in\n[\n1\n]\n:-\nIn various government posts, including membership in the Conseil Supérieure d'Instruction Publique, he was an exponent of educational reform and initiator of numerous large-scale projects ...\nOne of the major political events which gripped France during much of the time that Appell held top posts was the Dreyfus Affair. Dreyfus, like Appell, came from Alsace. Born into a Jewish family, Dreyfus embarked on a military career. In\n1894\n, when he was in the War Ministry, he was accused of selling military secrets to the Germans and he was sentenced to life imprisonment. Although his trial had been highly irregular the anti-Semitic views of many people made the verdict popular. Forged documents and cover-ups soon showed that the legal process had been suspect. In\n1898\nthe novelist Émile Zola wrote an open letter accusing the army of covering up its mistaken conviction of Dreyfus.\nThe case split France into two opposing camps leading to issues far beyond the guilt or innocence of Dreyfus. There were demands to bring Zola to justice, anti-Semitic riots broke out, and there was a petition demanding that Dreyfus be retried. Zola was sentenced to a year in prison and fined\n3\n,\n000\nfrancs. By\n1899\nthere had been a confession to the forgeries, followed by a suicide, and Dreyfus was retried, again found guilty, but pardoned.\nAppell was very much involved with the case. He himself was from a similar background and had suffered through the Franco-Prussian war of\n1870\n-\n71\n, so much centred on Alsace. When Dreyfus was granted a retrial in\n1904\n, Appell served as an expert on the commission that, by July\n1906\n, had cleared Dreyfus and reversed all previous convictions.\nHadamard\nalso played a major role in clearing Dreyfus's name.\nDuring World War I Appell founded the Secours National, a semi-official organisation involving all political and religious groups, which gave help to civilian victims of the war. After the war Appell had the ambition of his life fulfilled when his homeland of Alsace was returned to France. Also following the war the League of Nations was set up by the Allies at the Paris Peace Conference in\n1919\n, and Appell served as secretary-general for the French Association during the\n1920\ns when the League had its headquarters at Geneva.\nAppell's first paper in\n1876\nwas based on\nprojective geometry\ncontinuing work of\nChasles\n. He then wrote on algebraic functions,\ndifferential equations\nand complex analysis. In\n1878\nhe noted the physical significance of the imaginary period of\nelliptic functions\nin the solution of the pendulum which had been though to be purely a mathematical curiosity. He showed that the double periodicity follows from physical considerations.\nIn\n1880\nAppell defined a series of functions satisfying the condition that the derivative of the\nn\nn\nn\nth function is\nn\nn\nn\ntimes the\n(\nn\n−\n1\n)\n(n - 1)\n(\nn\n−\n1\n)\nth function. These are now called the Appell polynomials. In\n1885\nhe was awarded half of the Bordin Prize for solving\nMonge\n's problem:-\nTo move a given region into another of equal volume so as to minimise the integral of the element of volume times the distance between its old and new positions.\nWhen another prize was offered in\n1889\nto solve the problem:-\nTo find an effective method of calculating the Fourier coefficients in the expansion of quadruply periodic functions of two complex variables\nAppell submitted a solution which won second place. The winner of this prize was\nPoincaré\n.\nThe article\n[\n2\n]\n, written by Appell himself, lists\n140\nworks in analysis,\n30\nworks in geometry,\n87\nworks in mechanics as well as many textbooks, addresses, lectures on the history of mathematics and lectures on mathematical education. This is not even the complete list of Appell's publications since he published further works after\n[\n2\n]\nwas written.\nThere is an obvious question that we must ask ourselves about Appell. How is it that a mathematician who was so successful in every area of his subject and made significant contributions to many areas outside mathematics is not better known today? Perhaps a clue come from\n[\n2\n]\nwhere Appell himself writes:-\nI always had little taste for developing general theories and preferred to study limited and precise questions that might open new paths.\nThis is a pretty accurate assessment: Appell was one of the finest problem solvers there has been in mathematics. However he solved these problems using existing techniques and therefore his work had little lasting impact other than that the problem itself had been solved.\nMay, writing in\n[\n1\n]\n, emphasises this point:-\n... his scientific work consists of a series of brilliant solutions of particular problems, some of the greatest difficulty. He was a technician who used the classical methods of his time to answer open questions, work out details, and make natural extensions in the mainstream of the late nineteenth century; but his work did not open new doors as he hoped. On the contrary, he does not seem to have looked down any of the new paths that were leading to a period of unbridled abstraction and generalisation. During the last half of his career he was a pillar of a backward looking establishment that was to give way to\nNicolas Bourbaki\n, a namesake of a general who was one of his boyhood heroes.",
  "matematicos_citados_na_biografia": [
    "Poincaré",
    "Bertrand",
    "Hermite",
    "Émile Picard",
    "Borel",
    "Académie des Sciences",
    "Hadamard",
    "projective geometry",
    "Chasles",
    "differential equations",
    "elliptic functions",
    "Monge",
    "Nicolas Bourbaki"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}