{
  "nome_completo": "Pedro Abellanas Cebollero",
  "nome_curto": "Pedro Abellanas",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abellanas/",
  "data_nascimento": "20 November 1914",
  "local_nascimento": "Zaragoza, Spain",
  "data_morte": "29 July 1999",
  "local_morte": "Madrid, Spain",
  "summary": "Pedro Abellanas was a Spanish mathematician who worked in algebraic geometry and wrote many important text-books.",
  "biografia": "Pedro Abellanas\nwas the son of the stonemason Cornelio Abellanas from Nocito, a locality in the Hoya de Huesca region in the municipality of Nueno in the Province of Huesca, and his wife Francisca Cebollero. He was born into a large family. His first interest was in architecture but this involved a study of mathematics and quickly he became enthusiastic about making mathematics the main subject of his degree. He studied at the University of Zaragoza and graduated with a first degree in Exact Sciences in\n1935\n. He was awarded the Extraordinary Prize for an outstanding performance. His aim was to carry on studying, undertake research for a doctorate and then join the academic profession. However events surrounding the Spanish Civil War caused him to delay these plans.\nThe war began with an uprising in July\n1936\nwhich was essentially a military plot. The uprising failed but then it developed a more religious aspect with the Nationalists taking the role of the church against secularists. But it also had aspects of a class war of industrialists and bankers against urban workers and of centralists against liberal regionalists. It was more than a civil war, however, for Germany and Italy gave military support to the Nationalists led by the Fascist Francisco Franco whereas the Republicans were supported by Russia.\nAbellanas joined the Nationalist army led by Franco in which he reached the rank of provisional lieutenant. He was wounded and taken prisoner. Shortly after the war ended, in September\n1939\n, he obtained the position of auxiliary professor in the Faculty of Sciences of the Complutense University of Madrid. At this point he had not obtained a doctorate so he undertook research advised by\nTomás Rodríguez Bachiller\nwho had managed to return to his chair in December\n1939\n. Abellanas quickly discovered the work of\nvan der Waerden\n, and over the following two years devoured the two volumes of his \"Algebra,\" and his eighteen memoirs on Algebraic Geometry. Abellanas was awarded his doctorate, with distinction, on\n3\nNovember\n1941\nfor his thesis\nEl problema de la curvatura íntegra en el caso de una variedad geométrica diferencial, de Hopf-Rinow, de dimensión par, completa y admitiendo una descomposición poliédrica que sea una pseudo-variedad cerrada\nⓉ\n(\nThe problem of the integral curvature in the case of a differential geometrical variety, of Hopf-Rinow, of even dimension, complete and admitting a polyhedral decomposition that is a closed pseudo-manifold.\n)\n.\nFollowing this, he published\nDimension of an algebraic variety\n(\nSpanish\n)\n(1942)\nand\nOn the geometrical theory of algebraic surfaces for a perfect coefficient field of characteristic p\n(\nSpanish\n)\n(1942)\n. A review of the first of these explained:-\nThe algebraic varieties of points associated with the ideals of polynomials in\nn\nn\nn\nunknowns over a field are the elements of a structure in the sense of\nOre\n(1935)\n. A unique dimension is assigned to each variety by means of a descending principal chain.\nA review of the second of these stated:-\nSome results of\nZariski\n's in the theory of algebraic surfaces over ground fields of characteristic zero are extended to perfect ground fields of characteristic p. In particular, it is shown that the geometric definition of a simple point of a surface\n(\nin terms of the multiplicity of the intersection with two generic primes\n)\nis equivalent to the arithmetic definition\n[\nO Zariski\n,\n(1939)]\n. It is further pointed out that, with\nZariski\n's definition of normality, it is still true that the singular locus of a normal surface is of dimension less than or equal to\n0\n.\nFollowing the award of his doctorate, in November\n1941\n, Abellanas applied to the Conde de Cartagena Foundation for a scholarship to enable him to spend ten months working with\nvan der Waerden\nat the University of Leipzig in Germany. Although this was a very natural request given the very high regard in which he held\nvan der Waerden\n's work, nevertheless one has to wonder why anyone would want to travel to Germany in the middle of World War II. Although this might appear strange at first sight, one has to realise that Abellanas had fought in the Spanish Civil War on the side of Franco, supported by Germany. Also, in November\n1941\nit looked as if Hitler would have the same military success as Franco since Germany occupied much of mainland Europe and the German armies were threatening to take Moscow. Abellanas requested permission from the rector of Madrid University to take this period of \"extension of studies\", as he called it, and his request was granted.\nAbellanas spent a few months at Leipzig in\n1942\nbut was unable to spend the full ten months having to return to Madrid due to a family misfortune. However, he was full of praise both for\nvan der Waerden\nhimself, but also for the austere but eager organization of the German university system at this time, describing it as undoubtedly the best in the world. He told his colleagues on his return, for example, how he had been assigned a chair and a table in the library at Leipzig, together with a key to the door to study at any time of day or night. His admiration for the system in Leipzig must reflect to some extent on the Spanish university system at this time. It is also interesting to contrast Abellanas's admiration with the views of\nRey Pastor\nwho had complained bitterly about German geometry, for example that of\nvon Staudt\n, as being old fashioned. The contrast here must surely be simply the contrast between the ideas of\nvon Staudt\nwith those of\nvan der Waerden\n. Abellanas said he learnt two lessons from\nvan der Waerden\n[\n4\n]\n:-\n... first, that the ideas of\nZariski\nwere the ideas of the moment; secondly, that one has to be aware, throughout one's professional career, of what are the ideas of the moment, and to direct outstanding students towards them, those students who can later form a school, rather than keep them working on the techniques that one developed but that are no longer the future.\nIn\n1942\nAbellanas was appointed to the chair of Analytical Geometry and Topology at the University of Zaragoza. He held this position for seven years during which time he was highly regarded as a teacher. José Javier Etayo was a student at Zaragoza during this time and wrote about his professor Abellanas\n(\nsee\n[\n3\n]\n)\n:-\nI started as a student in Zaragoza. None of us who went through his classrooms will forget his lessons in geometry. It was the opening of a new universe, the first lesson of how mathematics is constructed; perhaps today it may seem to be common place but at that time it produced a fascination and a total dazzle.\nA similar report came from J Fernández Biarge who was Abellanas's doctoral student at Zaragoza\n(\nsee\n[\n3\n]\n)\n:-\nCertainly his entrance into that Faculty of Mathematics at Zaragoza caused a great sensation. ... It did not take us a week to realize that his classes broke all the moulds of what we had experienced. ... What today seems the normal development of a subject, was then an almost revolutionary novelty, which had not yet passed into the textbooks.\nTo get a good idea of Abellanas's views on teaching mathematics at school level, see his \"Didactics of Mathematics\" at\nTHIS LINK\n.\nWhile in Zaragoza he developed several new innovative courses and published papers such as\nThe formulae of Schubert for the determination of the fundamental numbers of surfaces of second order\n(\nSpanish\n)\n(1943)\n,\nFormulas for the Cremona characteristics of complete quadrics\n(\nSpanish\n)\n(1944)\n,\nNormal algebraic surfaces over a perfect coefficient field of arbitrary characteristic\n(\nSpanish\n)\n(1945)\n, and three papers in\n1946\n, all in Spanish,\nAnalytic structure of the open segment defined by Hilbert's postulates of incidence and order\n,\nOn the postulates of order in the projective space of Steinitz-Rademacher\n, and\nDecompositions produced by a collineation in\nP\nk\nn\nP_{k}^{n}\nP\nk\nn\n​\n.\nAbellanas married Carmen Oar on\n16\nSeptember\n1944\n. They had twelve children: Francisca, Cornelio, Maximo, Pedro, Carmen, Pilar, Beatriz, Blanca, Manuel, Pablo, Begona, and Teresa.\nAfter seven years in Zaragoza, in\n1949\n, he won a competition for Professor of Projective Geometry at the Universidad Complutense de Madrid and was appointed on\n30\nMay\n1949\ntaking up the position on\n12\nJune. He was appointed Secretary of the Faculty of Sciences at the Universidad Complutense in\n1952\n. He collaborated with colleagues at the Jorge Juan Institute of Mathematics at the Consejo Superior de Investigaciones Científicas where he was awarded a research contract. In\n1958\nhe succeeded\nBachiller\nas director of the Jorge Juan Institute of Mathematics.\nAbellanas attended the International Congress of Mathematicians held at Harvard in early September\n1950\n, where he presented the paper\nVarietes fondamentales par rapport d'une correspondance algebrique\nⓉ\n(\nFundamental varieties in relation to an algebraic correspondance\n)\n. He also attended the International Congress of Mathematicians held at Edinburgh, Scotland, in August\n1958\n.\nLet us now look at the books that Abellanas published. In\n1958\nhe published the\n376\n-page book\nElementos de matematica\nⓉ\n(\nElements of mathematics\n)\n. This book gave an introduction to real and complex numbers, matrices, vectors, euclidean geometry, sequences and series, real and complex functions, and differential and integral calculus. It led to several editions over the years, most involving major changes. The second edition, published in\n1961\n, had\n539\npages. By the time the\n4\nth edition appeared in\n1965\nit was in two volumes of\n735\nand\n241\npages. A review by A A Armendáriz of this edition states:-\nIn the first volume the author gives an orderly and rigorous presentation of some basic mathematical concepts. It is divided into two parts. The first of these is concerned with linear algebra, the second with analysis. In the first part the author discusses the basic algebraic structures: groupids, semigroups, groups, rings, fields and vector spaces. This section ends with a chapter on quadratic forms. In Part\n2\nthe author discusses limits, derivatives, and series. Applications are made to implicit functions and to maxima and minima with side conditions. There is a chapter on numerical analysis and one on differential geometry. The book ends with a chapter on the Riemann integral. The exposition is clear, if somewhat condensed. The discussion is always rigorous and the approach modern. New concepts and definitions are followed by exercises. There is a total of\n1\n,\n150\nexercises in the text, the solutions of which are collected in a second volume.\nIn\n1961\nAbellanas published the geometry textbook\nGeometría básica\nⓉ\n(\nBasic geometry\n)\n. A review by Miguel L Laplaza of the\n2\nnd edition of this book, published in\n1969\n, begins:-\nAccording to the author's preface, this book is devoted to the study of the basic spaces\n(\nvectorial, affine, euclidean and projective\n)\nand the maps among them, especially the linear ones and also the differential functions in simple cases. This second edition is so revised and enlarged that it is really a new book. The author has assembled a large amount of material in this textbook, requiring only a background of some general calculus and a basic course of algebra and set theory, and has made considerable effort to use systematically some concepts very seldom used at the level of the book: the theory of categories is introduced to prove the\nJordan\n-\nHölder\ntheorem, the exterior product to study the ruled projective space and the theorems of\nWitt\nto classify the quadratic forms. In the part on differential geometry the author uses systematically the concept of the differential of a map defined by means of an adequate criterion of \"proximity\" of two maps in a point.\nThe other major textbook by Abellanas is\nMatemática para físicos e ingenieros\nⓉ\n(\nMathematics for physicists and engineers\n)\n(1963)\n. A review by A A Armendáriz of this book states:-\nThe author of this textbook for engineers has set himself the task of covering, in a modern and rigorous fashion, the topics in the official syllabus for technical schools in Spain. In this he has amply succeeded. The book is divided into two parts, of which the first covers algebra and analysis, while the second is devoted to projective and differential geometry. It is evident from the length of the book and the variety of topics covered that it is intended to be used throughout the student's university career. An engineering student who mastered the material here presented would be unusually well grounded in the fundamentals of modern mathematics.\nTo understand Abellanas's ideas about mathematics, we have produced an English version of the talk he delivered on the opening of the\n1979\n-\n80\nsession of the Universidad Complutense de Madrid, see\nTHIS LINK\n.\nThere are many other contributions that Abellanas made to mathematics in general and, in particular, to the progress of mathematics in Spain. For example, he was the creator and promoter, along with\nSixto Ríos\n, of the Reuniones Anuales de Matemáticos Españoles\n(\nAnnual Meetings of Spanish Mathematicians\n)\n, the most important meeting between Spanish mathematicians during the second half of the\n20\nth century. Another notable contribution by Abellanas was the organization of the Mathematical Olympiads of the Real Sociedad Matemática Española\n(\nThe\nRoyal Spanish Mathematical Society\n)\n.\nThe remarkable quantity and quality of Abellanas's mathematical contributions have to be seen against the background of his family life where he had the responsibilities of being the father to twelve children. In\n[\n4\n]\nIgnacio Sols Lucia describes how Abellanas retained this energy throughout his career:-\nIf the active life of a university professor extends from the twentieth to the seventieth year, and if we think that the first fifteen can be considered as youth and that the next twenty are full maturity, it is obvious that, for the most part, the last ten or fifteen may be considered a few years of decline, although this word does not have to carry a pejorative charge. But one can hardly speak of a decline in a man like Abellanas, who retained an extraordinary energy throughout his academic career, who directed a dozen theses and maintained the direction of the Department of Algebra of the Universidad Complutense and of the Instituto Jorge Juan the during those years, which we should usually consider as declining.\nAs he approached retirement, he often said:-\nAfter so many years, I still do not award myself the title of 'mathematician', but the title of 'student of mathematics'.\nHe retired in\n1984\nand, rather remarkably, one of his last Ph.D. students was his own son Manuel Abellanas who was awarded his doctorate by the Universidad Complutense de Madrid in\n1984\nfor his thesis\nEstudio de los modelos canónicos de codimensión uno de las variedades algebraicas\nⓉ\n(\nStudy of the canonical models of codimension one of the algebraic varieties\n)\n. Manuel Abellanas has published many papers on enumerative geometry and combinatorics and teaches at the Universidad Politécnica de Madrid.\nPedro Abellanas died in Madrid in July\n1999\nand his funeral took place on\n17\nSeptember at the church of Santa Rita, Gaztambide Street, Madrid. His wife Carmen died on\n3\nMarch of the following year and her funeral was held in the same church on\n14\nApril\n2000\n.",
  "matematicos_citados_na_biografia": [
    "Tomás Rodríguez Bachiller",
    "van der Waerden",
    "Ore",
    "Zariski",
    "O Zariski",
    "Rey Pastor",
    "von Staudt",
    "THIS LINK",
    "Bachiller",
    "Jordan",
    "Hölder",
    "Witt",
    "Sixto Ríos",
    "Royal Spanish Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}