{
  "nome_completo": "Percy John Daniell",
  "nome_curto": "Percy Daniell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Daniell/",
  "data_nascimento": "9 January 1889",
  "local_nascimento": "Valparaiso, Chile",
  "data_morte": "25 May 1946",
  "local_morte": "Sheffield, England",
  "summary": "Percy Daniell was a Chilean-born English mathematician who worked in both  pure and applied mathematics. He is best known for his work on integration.",
  "biografia": "Percy Daniell\n's parents, William and Florence Daniell, were from Birmingham, England. William Daniell worked as an export merchant's buyer and the family were living and working in Valparaiso, Chile when Percy, the subject of this biography, was born. In fact Percy spent the first six years of his life in Chile, only returning to live in Birmingham in\n1895\nwhen his parents settled back in England. The family were Baptists and were much involved in the Baptist Church in Birmingham. In fact Percy's younger brother Eric became a Baptist minister in the same Birmingham church where the family had worshiped as the children were growing up.\nAs part of his primary school education, Percy spent a couple of years at a private school at Fladbury, Worcestershire. In January\n1900\n, he entered King Edward's School, Birmingham, a famous school founded by King Edward VI in\n1552\nand having an outstanding academic reputation. When Percy began his education there, the school was in New Street in the centre of the city. The school had an especially fine reputation for mathematics teaching and when Percy began his studies there the head mathematics teacher was the remarkable Rawdon Levett described in quotes given in\n[\n2\n]\nas:-\n... 'a schoolmaster of genius' and as 'probably the best schoolmaster I ever knew'.\nHis teaching was described by Charles Godfrey\n(\nquoted in\n[\n2\n]\n)\n:-\nAs a teacher he must have been rather unique: he made us think for ourselves and had wonderful discretion in leaving us to fight out our own battles. The one thing he abhorred was cramming ...\nIn\n1903\n, halfway through Daniell's time at King Edward's School, Levett retired but his approach was very successfully carried on by his successor Charles Davison. Daniell excelled academically and also participated fully in school life being a school prefect and a member of the school Rugby XV. He was very successful in winning a scholarship to enter Trinity College Cambridge in\n1907\nto study mathematics. Both Levett and Davison were highly successful in having their pupils win scholarships yet they\n[\n2\n]\n:-\n... never let a boy sit down to a scholarship paper. If ever a boy ventured to ask whether the work in hand was of any help for his scholarship examination, Levett's invariable reply would be: \"It is not my business to win scholarships for you, I have to make you love beautiful series.\"\nMatriculating at Cambridge in\n1907\n, he was Senior\nWrangler\nin the Mathematical Sciences Tripos in\n1909\n. This means that he was ranked first among the students achieving First Class marks. In fact Daniell has the distinction of being the last ever Senior Wrangler since Cambridge did away with publishing the ranked list of Wranglers from\n1910\nonwards, see\n[\n3\n]\n. We do not understand why Daniell chose to change from the Mathematical Sciences Tripos to study for Part II of the Natural Sciences Tripos. His interests were always in mathematics, applied mathematics and physics, and strong students interested in these topics usually took Part II of the Mathematical Sciences Tripos. However, Daniell seems to have flourished and was a Wrangler\n(\nnow the list was not ranked\n)\nin Part II of the Natural Sciences Tripos in\n1911\n. He was awarded the Rayleigh Prize for his essay\nDiffraction of light for the case of a hole in a plane of perfectly reflecting screen\n. After graduating from Cambridge he was appointed as an assistant lecturer in mathematics at the University of Liverpool where he worked during the academic year\n1911\n-\n12\n.\nAt this time president, Edgar Odell Lovett, of the Rice Institute\n(\nrenamed Rice University from\n1960)\nin Houston, USA, was looking to recruit top people to the faculty and, rather than have people apply, Lovett was actively approaching those he hoped to appoint. Lovett, himself a mathematician, wrote to J J Thomson at Cambridge asking for advice on who to appoint and Thomson recommended Daniell as an assistant professor of applied mathematics. Lovett approached Daniell who was very interested in the position but, since he was inexperienced in research, it was arranged that he would spend a year studying in Germany. Daniell was awarded a travelling fellowship and spent the period from July\n1912\nto October\n1913\nat Göttingen. There he attended courses by\nDavid Hilbert\nand\nMax Born\non theoretical physics. Among the courses that\nHilbert\nwas giving at this time were Partial Differential Equations, Mathematical Foundations of Physics, and Theory of the Electron. It is highly likely that Daniell attended these\n(\nand other courses\n)\nand certainly he undertook research on a problem in the theory of relativity which\nHilbert\ndiscussed in his course Theory of the Electron.\nIn\n1914\n, before leaving for the United States, Daniell married Nancy Hartshorne who, like Daniell, had been brought up in Birmingham. Nancy and Percy Daniell, who went on to have two sons and two daughters, sailed from Liverpool on\n18\nAugust\n1914\n. Two weeks later, Britain was at war with Germany, but this had no direct effect on Daniell although the disruption in communications and the draft after the United States entered the war in\n1917\ncertainly affected him, at least indirectly. The department that Daniell joined at Rice was small. Lovett was both head of mathematics and president of the university but had little time to devote to his mathematical duties. Daniell was, as we noted, an assistant professor of applied mathematics and had as his only colleague\nGriffith Evans\nwho was assistant professor of pure mathematics. We have little information about interaction between these two fine mathematicians, yet the topics they worked on suggest that they interacted very positively.\nUp to the time he moved to the United States Daniell had not published a single paper. However, this soon changed and over the next few years he published some remarkable work in incredibly diverse areas of mathematics. His\n1915\npublications were in applied mathematics: there was a two-part paper\nThe coefficient of end-correction\nin which he improved on an\n1894\nestimate by Rayleigh relating to the resistance of an electrical current. Daniell writes in the paper:-\nIf an electrical current passes through a long cylindrical tube of conducting material, and then out into a large hemispherical volume of the same, the total resistance is proportional to the total length of the tube plus a certain multiple of the radius. This multiple is the coefficient of end-correction which we require to find.\nHis other\n1915\npaper was\nThe rotation of elastic bodies and the principle of relativity\nand it followed the theme of research he had conducted while studying at Göttingen. He then became interested in pure mathematical problems relating to integration and, following a number of publications, published\nA general form of integral\nin\n1918\n. The paper gives an abstract definition of integration now known as the Daniell integral. Let us quote from the paper:-\nThe idea of an integral has been extended by\nRadon\n,\nYoung\n,\nRiesz\nand others so as to include integration with respect to a function of bounded variation. These theories are based on the fundamental properties of sets of points in a space of a finite number of dimensions. ... In this paper a theory is developed which is independent of the nature of the elements. They may be points in a space of a denumerable number of dimensions or curves in general or classes of events so far as the theory is concerned.\nIn\n[\n4\n]\nStewart looks at the direction his work on the Daniell integral took following the publication of his fundamental paper:-\nThe importance of the Daniell integral was recognised by other writers in this field who showed its applicability to a large number of cases and to functionals in particular. The application to functionals was also considered by Daniell who showed\n[\n'The derivative of a functional'\n(1919)]\nhow\nVolterra\n's definition of a functional derivative can be extended to the case when it is expressible as a\nStieltjes\nintegral. Later\n[\n'Stieltjes-Volterra products'\n(1920)]\nhe extended the\nVolterra\nintegral products in a similar way. A further application of the Daniell integral was made\n[\n'Functions of limited variation in an infinite number of dimensions'\n(1919)]\nto functions of limited variation in an infinite number of dimensions; and later\n[\n'Two generalisations of the Stieltjes integral'\n(1921)]\nhe made other generalisations to integrals with respect to functions not of limited variation and also to integrals of set-functions over a set. The more difficult problem of defining appropriately the derivatives that correspond to the generalised integrals was also considered.\nThis work represents a remarkable achievement but, amazingly, Daniell also made a highly innovative contribution to a totally different area of mathematics at the same time as he was working on the Daniell integral. Stephen Stigler writes\n[\n5\n]\n:-\nIn\n1920\n, a remarkable paper appeared in the 'American Journal of Mathematics' ... by the English mathematician P J Daniell. This paper, 'Observations Weighted According to Order', has been all but totally overlooked since its publication. It could in fact be claimed that Daniell was at least thirty years ahead of his time, for it took that long for his major results to be rediscovered. ... his paper itself is a model of clarity and rigour ...\nThis paper, Daniell's only contribution to statistics, contained some major breakthroughs\n[\n5\n]\n:-\nPercy Daniell should be credited with the first mathematical analysis of the class of estimators which are linear functions of order statistics, including the derivation of the optimal weighting functions for estimating scale and location parameters\n(\nthe so-called 'ideal' linear estimators\n)\nand the first mathematical treatment of the trimmed mean.\nAlthough this paper was his only contribution to statistics, Daniell also produced a major contribution to probability\n(\nwhich was, like his statistics paper, overlooked for many years\n)\n[\n5\n]\n:-\n... another important paper of Daniell's, 'Integral Products and Probability'\n(1921)\n, ... presents one of the earliest mathematical treatments of continuous time\nMarkov\nprocesses, including the\nChapman\n-\nKolmogorov\nequation\n(\nten years before\nKolmogorov\n)\nand a short treatment of the\nWiener\nprocess\n(\ntwo years before\nWiener\n)\n.\nAfter this remarkable period, Daniell was promoted to full professor at the Rice Institute in\n1920\n. His contributions, although not fully appreciated at the time, were recognised by the University of Cambridge for they awarded him a D.Sc. in\n1922\n. He returned to England in\n1923\nwhen he was appointed as Town Trust Professor of Mathematics at the University of Sheffield. He was much less active in research during the next few years publishing only a few papers that looked to be end products of his research while at Rice. He did, however, take a full part in mathematical life, in particular being active in the\nLondon Mathematical Society\n. He was on the Council of the\nLondon Mathematical Society\nfrom\n1927\nto\n1932\nand was Vice-President during\n1929\n-\n31\n.\nAt Sheffield he played a full part in the academic and administrative life, serving on the Faculty boards, the Senate and the Council. He also became interested in the training of school teachers and examining high school pupils. Although his research output after being appointed to Sheffield was relatively small, nevertheless he returned to his applied roots\n[\n4\n]\n:-\nThe various investigations conducted by Daniell into problems of a practical and numerical character were in strong contrast to his earlier research into fundamental theory. In much of this work, carried on principally from\n1930\nand right through the war years, he acted often as an adviser to other workers rather than as an independent investigator, and it is natural that the permanent records of all his contributions should be few in number. He assisted, for example, in heat-conduction problems arising in the manufacture of steel, in questions relating to the safety of mines, in the clarification of difficulties encountered in the interpretation of statistics and, during the war, in oscillation problems connected with the automatic control of instruments, His paper to the\nRoyal Society\nin\n1930\non the 'Theory of Flame Motion' was directly related to experimental work carried out by the Safety in Mines Research Board in Sheffield.\nEven before the outbreak of World War II in\n1939\n, Daniell's health had shown signs of problems yet he was determined to play a full role in the war effort and, of course, he had talents which were highly valuable. Stewart gives details in\n[\n4\n]\nof his contributions:-\nThe part that Daniell played during and after the war in research organised under the Ministry of Supply was significant and effective; and it is remarkable that, in spite of the deterioration of his health, he should have been so actively engaged in this work even up to the time of his death. He investigated problems that arose from the control of instruments which were designed to pick up and follow targets such as aeroplanes and ships and which required a high degree of accuracy, rapidity and sensitiveness. The problem of automatically tracking a target by radar methods is complicated by the fact that the reflected signals are disturbed by unwanted fluctuations. The problem of determining and overcoming these fluctuations was approached by the study of the frequency spectra of the radar information and a study of the various types of' band pass filters' with their effect on the operation of the automatic control.\nBy the time the war ended, Daniell was seriously ill and he died at the age of fifty-seven. Let us end this biography by looking at his interests outside mathematics\n[\n4\n]\n:-\nHe delighted in good music, in books, in friendly discussion, in country walks and in the quiet pleasures of a happy family life.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "David Hilbert",
    "Max Born",
    "Hilbert",
    "Griffith Evans",
    "Radon",
    "Young",
    "Riesz",
    "Volterra",
    "Stieltjes",
    "Markov",
    "Chapman",
    "Kolmogorov",
    "Wiener",
    "London Mathematical Society",
    "Royal Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}