{
  "nome_completo": "Peter K Henrici",
  "nome_curto": "Peter Henrici",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Henrici_Peter/",
  "data_nascimento": "13 September 1923",
  "local_nascimento": "Basel, Switzerland",
  "data_morte": "13 March 1987",
  "local_morte": "Zürich, Switzerland",
  "summary": "Peter Henrici was a Swiss mathematician best known for his work in the field of numerical analysis.",
  "biografia": "Peter Henrici\nwas educated at the high school in Basel, then entered the University of Basel in\n1942\nto study law. He spent two years at the University of Basel, then after World War II ended he began studies at the Swiss Federal Institute of Technology, Eidgenössische Technische Hochschule Zürich. He received a Diploma in electrical engineering there in\n1948\n, and also a Diploma in mathematics. He was awarded a doctorate in mathematics in\n1952\n, having written the thesis\nZur Funktionentheorie der Wellengleichung : mit Anwendungen auf spezielle Reihen und Integrale mit Besselschen, Whittakerschen und Mathieuschen Funktionen\nⓉ\n(\nOn the complex analysis of wave equation with applications to specific series and integrals with Bessel, Whittaker's and Mathieu functions\n)\nunder the direction of Eduard Stiefel. It is worth recording that he liked to stress that he got his Dr. sc. math. \"only formally\" under Stiefel\n(\nsuggesting that he received no advice from his thesis supervisor\n)\n.\nHe began publishing papers before submitting his doctoral thesis, four papers appearing in print before the publication of his doctoral thesis in\n1953\nin\nCommentarii Mathematici Helvetici\n. His first paper\nZur Berechnung der Eigenwerte von Matrizen durch Lochkartenmaschinen\nⓉ\n(\nCalculating the eigenvalues of matrices by punch card machines\n)\n(1950)\nexamined the problem of calculating the partial derivatives of the dominant eigenvalue of a matrix with respect to the elements of the matrix. His next contribution\nBergmans Integraloperator erster Art und Riemannsche Funktion\nⓉ\n(\nBergmans integral operators of the first kind and the Riemann function\n)\n(1952)\nis an elegant study of the representation of solutions of an elliptic partial differential equation in terms of analytic functions. The first paper he published in English was\nA Neumann series for the product of two Whittaker functions\nwhich appeared in the\nProceedings\nof the\nAmerican Mathematical Society\nin\n1953\n. By this time Henrici was working in the United States.\nIn\n1951\nHenrici had gone to the United States where he obtained a position at the American University in Washington, D.C, and also was a visitor at the National Bureau of Standards. In fact there was a Contract between the National Bureau of Standards  and the American University on which he worked. In\n1956\nhe went to the University of California at Los Angeles where he was appointed as an associate professor. Later he was promoted to Professor of Mathematics as the University of California at Los Angeles, where he remained until\n1962\nwhen he returned to the Swiss Federal Institute of Technology. He continued to hold this post for the rest of his life but, in\n1985\n, he took on an additional part-time appointment as the William Kenan Distinguished Professor of Mathematics at the University of North Carolina at Chapel Hill, North Carolina. In addition, throughout his career, he held a number of visiting professorships at Harvard, Stanford and several other universities in the United States.\nGarrett Birkhoff\n, in\nSalutation to Peter Henrici on his\n60\nth\nBirthday\npublished in the\nSIAM Journal on Numerical\nAnalysis, writes about Henrici's\n[\n2\n]\n:-\n... major contributions to preserving and enriching our mathematical heritage. His books and papers have helped greatly in maintaining numerical analysis as a subject with beauty, order, and structure, in the spirit of the great pioneers of the past. He keeps reminding us to ask what\nGauss\nwould have done with a parallel computer - or with a pocket calculator\n.\nGene H Golub\nand\nRichard S Varga\nwrite in\n[\n3\n]\n:-\nPeter Henrici was truly an internationally recognized numerical analyst, having written\n11\nbooks and over\n80\nresearch papers. A very cultured person who was also a gifted pianist, he was an outstanding teacher particularly interested in helping younger mathematicians. His lectures showed great polish and inspired many. His guidance and unselfish contributions as an editor have helped make Numerische Mathematik the respected journal it is. For this alone, we owe him a great debt of gratitude.\nLet us look briefly at some of the classic texts that Henrici published. His first book\nDiscrete variable methods in ordinary differential equations\n, published by John Wiley & Sons in\n1962\n, quickly won international acclaim and became a classic standard text on the topic. T E Hull reviewed the text. We give a few extracts from this review:-\nThis book contains a comprehensive and up-to-date treatment of methods for the numerical integration of ordinary differential equations, especially those associated with initial-value problems. The emphasis is mainly on a study of error propagation. The motivation is clearly practical and realistic, but the treatment is nevertheless completely rigorous. ... Many of the author's original contributions to the subject now appear for the first time in this book. Mention should be made particularly of his extensive work on the propagation of round-off error, for which he gives a thorough theoretical treatment, supported by substantial experimental evidence. His concept of a \"magnified error function\" is also of considerable help in developing reasonable estimates of propagated errors. ... There is no doubt that this book is a valuable contribution to numerical analysis, and it will certainly have an important influence on future developments in the numerical integration of ordinary differential equations. The author has done an excellent job of presenting a systematic account of the subject, and much of what appears in this volume is now appearing for the first time.\nIn\n1963\nhe published the short book\nError propagation for difference method\nwhich a sequel to the text published in the previous year. Another impressive text by Henrici\nElements of numerical analysis\nappeared in\n1964\n. An excellent comprehensive review by J R Rice begins as follows:-\nThis book marks a new level of excellence for introductory texts in numerical analysis. One reason for this is that the author does not try to squeeze in a large number of techniques, but rather takes a few selected topics and studies them with care and in some depth and detail. One may perhaps quibble with the particular selection, but this approach is especially sound in numerical analysis. More fundamental, however, is that the development is placed on scientific and mathematical foundations. Thus a clear distinction is made between algorithms and things we know about them and, more generally, between things we can prove and things we suspect are true.\nThese texts were rightly praise as remarkable achievements, but the high point of Henrici's writings must he the three volume work\nApplied and computational complex analysis\n. The first volume\nPower series - integration - conformal mapping - location of zeros\nfirst appeared in\n1974\n, the second volume\nSpecial functions - integral transforms - asymptotics - continued fractions\nfirst appeared in\n1977\n, and the third and final volume\nDiscrete Fourier analysis - Cauchy integrals - construction of conformal maps - univalent functions\nfirst appeared in\n1986\n. Writing this masterpiece did not fully occupy his textbook writing time, however, for between the publication of the second and third volumes he published\nEssentials of numerical analysis with pocket calculator demonstrations\n(1982)\n.\nIn\n1964\nHenrici was an invited plenary speaker at the sixteenth\nBritish Mathematical Colloquium\nheld in Leicester and he lectured to the Colloquium on\nSome applications of the quotient-difference algorithm in classical analysis\n. In\n1978\nhe was the\nSociety of Industrial and Applied Mathematics\nJohn von Neumann\nlecturer. He was elected President of the Gesellschaft für Angewandte Mathematik und Mechanik\n(\nGerman Society for Applied Mathematics and Mechanics\n)\nfrom\n1977\nto\n1980\nwhen he became Vice-President, serving in this role until\n1983\n. He was an editor of\nZeitschrift für angewandte Mathematik und Physik\n(\nJournal of Applied Mathematics and Physics\n)\nand he was an associate editor of twelve other journals.\nIn\n[\n1\n]\nMcKenna and Temam give an indication of Henrici's life and achievements, then they write:-\nThis brief summary provides only an incomplete picture of Peter Henrici the scientist, of his energy and his immense diligence. Peter Henrici the man - his personality, his warmth and humour and modesty - will remain in our memories, as will for some of us his passion for music, the experience of listening to or playing with an extraordinarily gifted pianist. He is no longer among us but his work is here to stay.\nA Prize has been established to honour Henrici. The notice for the prize states:-\nThe Peter Henrici Prize is awarded jointly by Eidgenössische Technische Hochschule-Zürich and the Society for Industrial and Applied Mathematics. The prize is awarded for original contributions to applied analysis and numerical analysis and/or for exposition appropriate for applied mathematics and scientific computing. The award is intended to recognize broad and extended contributions to these subjects, more than a single outstanding work. This Prize is given to honour Peter Henrici who was such an eminent figure in Applied Mathematics and Numerical Analysis. In addition to all his scientific achievements, he wrote numerous books and papers in an elegant manner, communicating ideas coherently and logically.\nIt is awarded every four years, the first award being made in\n1999\n.",
  "matematicos_citados_na_biografia": [
    "American Mathematical Society",
    "Garrett Birkhoff",
    "Gauss",
    "Gene H Golub",
    "Richard S Varga",
    "British Mathematical Colloquium",
    "Society of Industrial and Applied Mathematics",
    "John von Neumann",
    "German Society for Applied Mathematics and Mechanics"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}