{
  "nome_completo": "Petre Sergescu",
  "nome_curto": "Petre Sergescu",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sergescu/",
  "data_nascimento": "17 December 1893",
  "local_nascimento": "Turnu-Severin, Oltenia, Kingdom of Romania (now Romania)",
  "data_morte": "21 December 1954",
  "local_morte": "Paris, France",
  "summary": "Petre Sergescu was a Romanian mathematician important in the development of sciences in Romania.",
  "biografia": "Petre Sergescu\nwas born at Turnu-Severin in December\n1893\n. Turnu-Severin is now known as Drobeta-Turnu Severin and is in Romania. We note that he is also known as\nPierre Sergescu\n. His father, Constantin Sergescu, was born in Curtea de Arges in\n1861\nand studied at the Veterinary School of Medicine, graduating in\n1889\n. Constantin married Angela Popescu in Craiova in\n1892\n. Angela\n(\nknown as Ana\n)\nhad been born in Craiova in\n1871\nand was studying at the University of Bucharest, graduating in May\n1893\n. Petre was the eldest of his parents' three children having a younger brother and a sister. He suffered a freak accident as a child when he lost an eye in a snowball fight. Petre's mother put much effort into helping him with reading so that he could overcome the problems with his sight.\nPetre attended primary and secondary schools in Turnu-Severin. He attended the famous Traian High School, a College that had been founded in\n1883\nand had an excellent reputation. At this school, Sergescu showed himself to be a talented pupil with particular skills in mathematics, philosophy and music. He graduated with a baccalaureate in science and a second baccalaureate in Latin. While a high school student, he had avidly read the\nGazeta Matematica\n(\nThe Mathematical Gazette\n)\nand made contributions to this publication. In\n1912\nhe won one of the competitions run by the\nGazeta Matematica\nand this led to\nGheorghe Țițeica\nrealising that Sergescu was a young man with great potential in mathematics.\nPetre Sergescu began his studies in the Mathematics section of the University of Bucharest in\n1912\n. There he was attended lectures by\nGheorghe Țițeica\n,\nDimitrie Pompeiu\n, Anton Davidoglu\n(1876\n-\n1958)\nan expert on differential equations, Traian Lalescu\n(1882\n-\n1929)\nwho contributed to many areas particularly integral equations, Nicolae Coculescu\n(1866\n-\n1952)\nthe professor of astronomy and celestial mechanics, and David Emmanuel\n(1854\n-\n1941)\nthe professor of Higher Algebra and Function Theory. However, Sergescu had interests outside mathematics and he kept these active by attending, in the same period, courses in the Faculty of Philosophy and in the Conservatory of Music of Bucharest. As a musician Sergescu played the violin to a very high standard and had a very fine tenor voice. In fact he attended the Singing Department of the Conservatory. As if this wide range of studies was not enough for the energetic young man, he was also involved in student activities and was elected President of the Bucharest Student Union from\n1914\nto\n1916\n.\nHe graduated from the University of Bucharest in\n1916\nand was appointed as a mathematics teacher at the Traian High School in Turnu-Severin where he himself had been a pupil. However he had not been in the post for very long before the events of World War I caused his career to be interrupted in a dramatic fashion. Romania entered World War I in August\n1916\nwhen they declared war on Austria-Hungary. Their aim in this was to bring Transylvania, which was under the control of Austria-Hungary, back as part of Romania. Sergescu enlisted as a cadet in the engineering corps. However, Germany declared war on Romania and soon the Romanian army was suffering defeats. In early\n1917\nSergescu was taken prisoner by the Germans and, after being held in a number of different camps, was sent to a prisoner-of-war camp at Plovdiv in Bulgaria where he was held for\n18\nmonths. He was liberated following the armistice on\n11\nNovember\n1918\n, and returned to his duties as a teacher and to mathematics research.\nSergescu was awarded a fellowship to study in Paris and, in\n1919\n, he left Romania and travelled to France. His aim was to obtain a doctorate but first he took courses at the Faculté des Sciences and at the École Normale Supérieure to prepare to take the examinations for the 'licence'. He also attended lectures by\nPierre Léon Boutroux\non the history of mathematics and the philosophy of mathematics at the Collège de France. On\n20\nJuly\n1922\nhe married the Polish girl Marya Kasterska in Paris. Marya had been born in Warsaw in February\n1893\ninto a family of landowners who were going through hard times. She had emigrated to France in\n1914\nand, in\n1918\n, she had been awarded a doctorate by the University of Paris for her thesis\nLes poètes latins-polonais\n(\njusqu'en\n1589)\nⓉ\n(\nThe Latin-Polish poets\n(\nas far as\n1589)\n)\n. She met Sergescu after he arrived in Paris to study for his doctorate. In\n1923\nTraian Lalescu asked Sergescu to return to Romania and to submit this doctoral thesis to the University of Bucharest.\nOn\n28\nNovember\n1923\nPetre Seregescu's\n47\n-page doctoral thesis\nSur les noyaux symétrisables\nⓉ\n(\nOn symmetrizable cores\n)\nwas examined at the University of Bucharest by a committee consisting of\nGheorghe Țițeica\n, Traian Lalescu and David Emmanuel. The chairman of the committee was Emmanuel. Following the award of his doctorate, Sergescu started his teaching career in\n1924\n, as assistant professor at the University of Bucharest and he also taught at the Polytechnic School. In\n1926\n, he was appointed associate professor of Analytical Geometry at the University of Cluj and then, on\n1\nApril\n1931\n, full professor at Cluj in the Chair of Analytical Geometry in the Faculty of Sciences. During this period he taught courses on Algebra,\nIntegral Equations\n,\nNumber Theory\n, Function Theory, and the History of Mathematics. In February\n1938\nhe was appointed professor of Differential and Integral Calculus in the Faculty of Sciences of the University of Cluj.\nSergescu was one of the founders of the journal\nMathematica\n(\nCluj\n)\nmodelled on the Polish journal\nFundamenta Mathematicae\n. The journal began publication in\n1929\nand Sergescu was secretary of the editorial staff until\n1948\n. He did far more than just his secretarial duties, however, for he did editing, proofreading, shipping of the journal and kept the financial accounts. What is even more remarkable is that he covered around half the total costs of the journal from his own salary. Another important part of his work during these years was his involvement in the organisation of the first two Congresses of the Romanian Mathematicians. The first was held in Cluj in May\n1929\nwith David Emmanuel as honorary president and the organising committee being\nGheorghe Țițeica\n,\nDimitrie Pompeiu\n, Dumitru Ionescu with Sergescu as the general secretary. The conference was highly successful with\n158\nparticipants including\nVito Volterra\n,\nPaul Montel\n, and\nWacław Sierpiński\n. The second congress, held at Turnu-Severin in May\n1932\n, again attracted many mathematicians including\nArnaud Denjoy\n,\nPaul Montel\nand\nWacław Sierpiński\n. We should note that Sergescu generously supported these two conferences with large donations of money from his own pocket. In addition to his duties as professor of mathematics, he also took part in politics as a member of Nicolae Iorga's Democratic Nationalist Party. In\n1930\nhe was local councillor in Cluj, and in the period\n1931\n-\n1932\nhe was deputy for Sălaj County. His aim always, however, was to further the cause of mathematics both in schools and in higher education.\nCluj had, with the rest of Transylvania, been incorporated into Romania with the Treaty of Trianon in\n1919\n. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n. The university in Cluj was, during these years between the two World Wars, named King Ferdinand I University. In August\n1940\n, after the start of World War II, the north-west part of Romania\n(\nincluding Cluj\n)\nwas surrendered to Hungary in the Vienna Dictate. This was a decision taken in Vienna under severe pressure from the German Third Reich. The Romanian university in Cluj moved to Alba-Iulia, Turda, Sibiu and Timisoara. In fact the Faculty of Sciences was moved to Timisoara, where Sergescu became an active member of the Mathematical Seminar. However, he made frequent trips to Cluj and to Paris where he had many friends. He was a devout Roman Catholic who, at Easter and at Christmas, would always visit his younger sister who lived next door to his mother.\nIn\n1943\nSergescu moved to the Technical University of Bucharest where he served as rector of the university in\n1945\n-\n46\n. Because of the Communist regime, he was forced to leave Romania and from August\n1948\n, Sergescu and his wife Marya Kasterska lived in Paris. Ordered by the Romanian government to return to his country, he refused and his Romanian nationality was withdrawn. However, he refused to apply for citizenship of another country saying that he would never lose hope that better times would come to Romania. In Paris the family lived in a house on Rue Daubenton where a plaque now records that Pierre Sergesco and Marya Kasterska-Sergesco lived there. Here they hosted a cultural evening every Saturday which because of the extremely warm ambiance was a popular place attracting many French, Polish, Romanian and other nationalities.\nSergescu published more than\n160\nscientific papers and took part to numerous international congresses and conferences.\nWe have listed over half his works at\nTHIS LINK\n.\nSome of his early papers are:\nApplication de la théorie des résidus à la démonstration d'un théorème d'Hermite sur l'indece d'une fraction rationnelle\nⓉ\n(\nApplication of the theory of residues to the proof of a theorem of Hermite on the index of a rational fraction\n)\n(1922)\n;\nQuelques inégalités de MM Landau et Lindelöf concernant les fonctions monogènes\nⓉ\n(\nSome inequalities of  Landau and Lindelöf on monogenic functions\n)\n(1922)\n; and\nModule des zéros des dérivées des fonctions bornées\nⓉ\n(\nModule of zeros of derivatives of bounded functions.\n)\n. He continued to publish on a variety of different mathematical topics but around\n1930\nhe was influenced by the Italian historian of science, Aldo Mieli\n(1879\n-\n1950)\n, to take an interest in research in the history of mathematics. The two met in Paris where Mieli was creating wide interest in the history of science. Sergescu began to publish papers on the topic such as\nThe history of the numerical calculus\n(\nRomanian\n)\n(1933)\n,\nLes sciences mathématiques en France\nⓉ\n(\nMathematical sciences in France\n)\n(1933)\nand\nHistoire des sciences mathématiques et physiques en Roumaine\nⓉ\n(\nHistory of Mathematics and Physical Sciences in Romania\n)\n(1934)\n. For a while, in addition to history papers, he continued to publish papers on the roots of equations, a topic that he had been interested in for several years. For example he published\nOn the roots of equations in which the coefficient of x\np\nhas the highest absolute value\n(\nRomanian\n)\n(1935)\n.\nAfter moving to Paris he soon established himself as a leading historian of mathematics with an international reputation. At the Fifth International Congress held at Lausanne in September-October\n1947\n, Sergescu was appointed general secretary of the International Academy of the History of Sciences and of the International Union for the History of Sciences. The International Academy of the History of Sciences had been founded by Aldo Mieli in\n1929\n. Mieli, who had been the person to persuade Sergescu to undertake research on the history of mathematics, had been the first general secretary but he had retired from the post. George Sarton writes\n[\n11\n]\n:-\nFrom then on, all of his time was given to them and to the history of science in general. For example, he was one of those who helped to create the mathematical section in the Palais de la decouverte. He helped to arrange the first hall, devoted to the history of numbers, a series of lectures on the history of science, and special exhibitions devoted to\nPascal\nand\nLeonardo da Vinci\n. Many of the lectures were given by himself; the last one was to be devoted to Three Historians of Science,\nPaul Tannery\n,\nPierre Duhem\n, and George Sarton.\nSarton also writes about seeing Sergescu become steadily more ill in his last years\n[\n11\n]\n:-\nAt the Seventh International Congress in Jerusalem\n(\nAugust\n1953)\n... his resilient energy and courage were marvelous; in spite of fatigue and pain, he did his duty and managed to be cheerful. At the end of the congress, he fell so ill that one wondered whether it would be possible for him to sail back from Haifa to Marseille. After his return, his illness became gradually more ominous, and he suffered a stroke at the beginning of\n1954\n; he was obliged to spend three months in hospital and after his return home was slowly recovering his strength. In the night of\n20\n-\n21\nDecember\n1954\nhe passed away during his sleep.\nIn fact on the evening of\n20\nDecember Sergescu had been reading an obituary of his friend and colleague\nDimitrie Pompeiu\nwho had died a couple of months earlier on the\n8\nOctober. He put the article down saying that he would finish reading it the next day but died in his sleep that night. He was buried in the cemetery Montmorency. His wife had \"J'ai ce que j'ai donné\" inscribed on his tombstone.\nSarton paid this tribute to his friend Sergescu\n[\n11\n]\n:-\nSergescu was a very generous man, generous to the core, and his good wife helped him to be more generous. They were faithful Catholics, and their religion made it easier for them to weather many calamities. As all their belongings were lost when they refused to acknowledge the new communistic regime in Romania, they were very poor but were never ashamed of their poverty. They were exceedingly hospitable to friends, and it was my privilege to enjoy their simple but gallant welcome when I visited them in their little home in the rue Daubenton no.\n7\n, close to Saint Medard, a famous old church, at one end and to the mosque and Muslim institute on the other, close also to the Jardin des Plantes where they could stroll in lovely surroundings whenever they needed a rest. Sergescu was very modest and kind, always eager to be of service to others. We all know people who try to puff themselves up by speaking contemptuously of others; he was the opposite of that and was genuinely great in his simplicity and poverty.\nRené Taton wrote\n[\n13\n]\nthat Sergescu had:-\n... boundless generosity, a scrupulous respect for the personality of others, selfless love of science. Anyone who had the privilege of meeting Pierre Sergescu knows what rich qualities of the heart he combined with those of a genuine scientist.\nSergescu received many honours. He was a member of the\nSociété Mathématique de France\n(1920)\n, the\nRomanian Academy\n(1937)\n, the Masaryk Academy, Prague, an honorary member of the\nBelgian Mathematical Society\n, a member of the\nPolish Mathematical Society\n, elected to the Academy of Lima\n(1938)\n, a member of the Académie Internationale pour les Sciences de Paris Mathématiques, an honorary member of the Society of Naturalists of Luxembourg\n(1952)\n, and a member of the\nGerman Mathematical Society\n.",
  "matematicos_citados_na_biografia": [
    "Gheorghe Țițeica",
    "Dimitrie Pompeiu",
    "Pierre Léon Boutroux",
    "Integral Equations",
    "Number Theory",
    "Vito Volterra",
    "Paul Montel",
    "Wacław Sierpiński",
    "Arnaud Denjoy",
    "THIS LINK",
    "Pascal",
    "Leonardo da Vinci",
    "Paul Tannery",
    "Pierre Duhem",
    "Société Mathématique de France",
    "Romanian Academy",
    "Belgian Mathematical Society",
    "Polish Mathematical Society",
    "German Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}