{
  "nome_completo": "Pierre Bouguer",
  "nome_curto": "Pierre Bouguer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bouguer/",
  "data_nascimento": "16 February 1698",
  "local_nascimento": "Le Croisic, France",
  "data_morte": "15 August 1758",
  "local_morte": "Paris, France",
  "summary": "Pierre Bouguer was a French surveyor who took part in an expedition to South America to calculate the size of a degree of latitude.",
  "biografia": "Pierre Bouguer\n's father, Jean Bouguer, was Royal Professor of Hydrography. Jean Bouguer taught his son Pierre both mathematics and hydrography, and Pierre turned out to be an outstanding pupil. A real child prodigy, he had a deep understanding of mathematics and science by the age of fifteen years.\nThen a remarkable thing happened. Jean Boutroux died when Pierre was fifteen years old and so his professorship of hydrography became vacant. Pierre applied for his father's professorship and he was such a remarkable young man, both brilliant and knowledgeable, that he was appointed.\nOne might think that such early brilliance and achievement would lead to him leading an unexciting life. However, this is far from the truth for his achievements became still more impressive. In\n1727\nhe won the Grand Prix of the\nAcadémie Royale des Sciences\nfor his submission on masts of ships. Two years later he again won the grand prize, this time with an essay on observing the altitudes of stars at sea then, in\n1731\n, he won his third Grand Prix from the\nAcadémie\nfor his work on the observation of the\nmagnetic declination\nat sea.\nThe\nAcadémie Royale des Sciences\nfurther honoured Bouguer when he was elected as an associate in the mathematics section in\n1731\nand then, in\n1735\n, he was elected to full membership. In\n1732\nBouguer studied pursuit curves writing a paper on them which\n[\n1\n]\n:-\n... was one of several that display his considerable mathematical ability.\nIn April\n1735\nBouguer set out on an expedition, organised by the\nAcadémie Royale des Sciences\n, to Peru to measure the length of a degree of meridian at the equator.\nLa Condamine\nwas a member of the same expedition and its third scientific member was the leader of the expedition Louis Godin. The three finished their journey to their destination by different routes, Bouguer and Godin sailing to Quito, while La Condamine went overland from Manta. The three scientists met up at Quito.\nThe three were soon involved in disagreements. Godin began to work on his own while Bouguer worked with\nLa Condamine\n. Bouguer was the first to attempt to measure the density of the Earth using the deflection of a plumb line due to the attraction of a mountain. Together with\nLa Condamine\n, he made measurements in Peru in\n1740\npublishing his results in\nLa Figure de la terre\nⓉ\n(\nThe shape of the earth\n)\n(1749)\n. A more successful use of the same method was made by the astronomer\nMaskelyne\nin\n1774\n, placing the density between\n4\n.\n5\nand\n5\n.\nIn\n1741\nBouguer discovered a small error in the joint measurements made with\nLa Condamine\nto determine the length of a degree of meridian. These two now fell out over whether they should recheck their results. All three made independent measurements, the work being completed in\n1743\n. The three returned by different routes.\nBouguer wrote on naval manoeuvres and navigation and, in ship design, derived a formula for calculating the metacentric radius\n(\na measure of ship stability\n)\n. However, he made an outstanding contribution to an area of science which he treated as a hobby for many years. This was his work on photometry which has earned for him the title of \"father of photometry\".\nStarting in\n1721\nhe made some of the earliest measurements in astronomical photometry. He compared the apparent brightness of the moon to that of a standard candle flame on\n23\nNovember\n1725\n. His idea was that although the human eye was poor as a light meter it was very good at telling whether two objects were the same brightness. By moving the candle and using\nKepler\n's inverse square law he was able to measure brightness. He published this method in\nEssai d'optique sur la gradation de la lumière\nin\n1729\n. This work contains Bouguer's second great discovery relating to light, namely Bouguer's law. This law expresses the relationship between the absorption of radiant energy and the absorbing medium\n[\n1\n]\n:-\nIn a medium of uniform transparency the light remaining in a collimated beam is an exponential function of the length of the path in the medium.",
  "matematicos_citados_na_biografia": [
    "Académie Royale des Sciences",
    "Académie",
    "magnetic declination",
    "La Condamine",
    "Maskelyne",
    "Kepler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}