{
  "nome_completo": "Pieter Hendrik Schoute",
  "nome_curto": "Pieter Hendrik Schoute",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schoute/",
  "data_nascimento": "21 January 1846",
  "local_nascimento": "Wormerveer, Netherlands",
  "data_morte": "18 April 1913",
  "local_morte": "Groningen, Netherlands",
  "summary": "Pieter Hendrik Schoute was a Dutch mathematician known for his work on regular polytopes and Euclidean geometry.",
  "biografia": "Pieter Hendrik Schoute\nwas the son of Dirk Schoute\n(1791\n-\n1861)\nand Cornelia Oosterhuijs\n(1802\n-\n1875)\n, both from Wormerveer, who had married in Wormerveer on\n26\nOctober\n1823\n. The Schoute family were industrialists who had a business near Amsterdam. Dirk Schoute's parents were Cornelis Schoute and Grietje Baars, while Cornelia Oosterhuijs's parents were Hendrik Oosterhuijs and Aagje Langewis. At the time of Dirk and Cornelia's marriage, Dirk was described as a clerk, but the family fortunes changed in\n1843\nwhen Dirk Schoute began processing cocoa. The business flourished and the Wormerveer factory began making chocolate products which were exported to various European countries. Pieter Hendrik was the youngest of his parents' three sons, the older two being Cornelis\n(1835\n-\n1911)\nand Dirk\n(1838\n-\n1899)\n.\nHe studied at the Polytechnic in Delft, graduating as a civil engineer in\n1867\n. After graduating, Schoute went to Leiden to undertake research in mathematics. His doctorate was awarded by Leiden in\n1870\nfor a dissertation\nHomography applied to the theory of\nquadric\nsurfaces\n. After being awarded his doctorate, Schoute taught mathematics in a secondary school in Nijmegen from\n1871\nuntil\n1874\n. While teaching in Nijmegen he married Mathilde Pekelharing\n(1846\n-\n1930)\n; they had six children, Dirk\n(1873\n-\n1953)\n, Cornelis\n(1874\n-\n1960)\n, Anna Cornelia\n(1875\n-\n1976)\n, Johannes Cornelis\n(1877\n-\n1942)\n, Agatha Cornelia\n(1879\n-\n1968)\n, and Baltus Hendrik who was born in\n1884\nbut did not reach adulthood dying at the age of five. The family moved to The Hague in\n1874\nwhere again Schoute taught mathematics in a secondary school. From\n1881\nuntil his death he was professor of mathematics at the University of Groningen.\nJohann Bernoulli\nwas professor of mathematics at Groningen from\n1695\nuntil\n1705\nwhen he left the University disillusioned. Sierksma in\n[\n3\n]\nexplains that after Bernoulli left Groningen there were a number of professors of mathematics who were to some extent involved in mathematics but none of them was really interested in it. The situation changed markedly for the better with the appointment of Schoute in\n1881\nand from that time the fortunes of mathematics at Groningen improved greatly. In particular there was the second excellent appointment of Floris de Boer as professor of mathematics to Groningen to join Schoute three years after he was appointed.\nSchoute studied various topics in geometry such as quadrics and algebraic curves.\nDirk Struik\nwrites in\n[\n1\n]\n:-\nSchoute was a typical geometer. In his early work he investigated quadrics, algebraic curves, complexes, and congruences in the spirit of nineteenth-century projective, metrical, and enumerative geometry.\nFrom\n1891\nSchoute studied Euclidean geometry of more than\n3\ndimensions, writing\n28\npapers, some jointly with\nAlica Boole Stott\n, the daughter of\nGeorge Boole\n, such as\nOn the sections of a block of eightcells by a space rotating about a plane\n. It was his research on regular polytopes, which generalise the concept of regular polyhedra, that led to the collaboration between Schoute and\nStott\n. J S Joel, reviewing\nCoxeter\n's article\n[\n3\n]\n, writes:-\nSchläfli\n's work of the\n1850\n's was brought to the Netherlands by Pieter Hendrik Schoute\n(1846\n-\n1913)\nwho, in three papers beginning in\n1893\nand in his elegant two-volume textbook on many-dimensional geometry 'Mehrdimensionale Geometrie'\n(2\nvolumes\n1902\n,\n1905)\n, studied the sections and projections of regular polytopes and compound polyhedra. ...\nAlicia Boole Stott\n(1870\n-\n1940)\n,\nGeorge Boole\n's third daughter\n(\nof five\n)\n, ... studied sections of four- and higher-dimensional polytopes after her husband showed her Schoute's\n1893\npaper, and Schoute later\n(\nin his last papers\n)\ngave an analytic treatment of her constructions.\nAmong his most important papers we mention\nDeux théorèmes relatifs aux centres des courbes algébriques\nⓉ\n(\nTwo theorems on the centres of algebraic curves\n)\n(1882)\n,\nRegelmässige Schnitte und Projektionen des Achtzelles und des Sechszehnzelles im vierdimensionalen Räume\nⓉ\n(\nRegular cuts and projections of eight Ellezelles and sixteen Ellezelles in four-dimensional space\n)\n(1894)\n,\nRegelmässige Schnitte und Projektionen des Vierundzwanzigzelles im vierdimensionalen Räume\nⓉ\n(\nRegular cuts and projections of the Twenty-Four Ellezelles in four-dimensional space\n)\n(1894)\nand\nRegelmässige Schnitte und Projektionen des Hundertzwanzigzelles und Sechshundertzelles im vierdimensionalen Räume\nⓉ\n(\nRegular cuts and projections of the hundred and twenty and six hundred cells in four-dimensional space\n)\n(1894)\n.\nThomas Bromwich\nreviews his important two volume monograph\nMehrdimensionale Geometrie\nⓉ\n(\nMultidimensional Geometry\n)\nin\n[\n2\n]\n. He writes:-\nAccording to the preface, the author was forced, for lack of space, to compress his manuscript into about three-fourths of the original number of pages; and this accounts for the occasionally rather too compact form of the argument. The subject-matter corresponds roughly to the work given, for ordinary space, in such books as Nixon's 'Geometry in Space'. The book contains extensions of\nEuler\n's theorem, of the theory of regular polyhedra, of spherical geometry, and so on; the work is well illustrated by numerous carefully drawn figures. We may mention specially the figures, for ordinary space, of the regular and semi-regular solids.\nIn\n1909\nSchoute published\nOn the Angles of the Regular Polytopes of Four-Dimensional Space\nand, four years later, the continuation\nOn the Four-Dimensional Angles of the Semiregular Polytopes of\nS\n4\nS^{4}\nS\n4\n. He writes in the introduction to the\n1913\npaper:-\nThis paper may be regarded as a continuation of\n[\nOn the Angles of the Regular Polytopes of Four-Dimensional Space\n]\n; it is concerned with polytopes of\nS\n4\nS^{4}\nS\n4\ncharacterized by the property of admitting one kind of vertex and one length of edge, which polytopes will be called \"semiregular.\" These polytopes, corresponding to the Archimedian semiregular polyhedra of ordinary space, have been deduced from the regular ones by very simple geometrical operations called \"expansions\" and \"contractions\" in a masterly memoir of\nA Boole Stott\n;  they will be indicated here by the symbols introduced in that memoir. It follows immediately from the property of admitting one kind of vertex and one length of edge that the portion of four-dimensional space occupied by a semiregular polytope at any vertex is the same for all the vertices of that polytope.\nThe articles\n[\n3\n]\nand\n[\n5\n]\nare published in the journal\nNieuw Archief Wiskunde\n. Schoute was an editor of this journal from\n1898\nuntil his death in\n1913\n. He was also a founding editor of\nRevue semestrielle des publications mathématiques\nfrom\n1893\n, when the journal was founded, again until his death in\n1913\n.\nGeorge Bruce Halsted\n, writing about the Caen Congress of August\n1894\n, remarks:-\nWe are happy to mention the decided advancement of the 'Repertoire bibliographique des Sciences mathématique', and in this connection, to applaud the interesting publication, due to a group of mathematicians in Holland, especially P H Schoute, which is entitled 'Revue Semestrielle des Publications Mathématique'.\nFinally we should note another publication by Schoute on a totally different topic, namely the reclamation of the Zuiderzee. His article, published in the\nGeographical Journal\nin\n1893\n. He writes:-\nThe question of the reclamation of land now covered by the Zuiderzee is no new one, but it is only recently that a thoroughly practicable scheme has been matured for the accomplishment of this great engineering feat. In\n1886\na Committee was appointed to consider and report upon the question ...\nAfter giving details of the scheme, which he strongly supported, Schoute ends his article with the report:-\nRecently\n(8\nSeptember\n1892)\nthe Dutch Government has appointed a new Committee to report upon the scheme worked out by the Committee of\n1886\n...\nIn fact the scheme was put into effect, but only after a serious flood in\n1916\nconcentrated people's minds. Work began in\n1927\n, fourteen years after Schoute's death.\nSchoute was elected to the\nRoyal Netherlands Academy of Sciences\nin\n1886\n.",
  "matematicos_citados_na_biografia": [
    "quadric",
    "Johann Bernoulli",
    "Dirk Struik",
    "Alica Boole Stott",
    "George Boole",
    "Stott",
    "Coxeter",
    "Schläfli",
    "Alicia Boole Stott",
    "Thomas Bromwich",
    "Euler",
    "A Boole Stott",
    "George Bruce Halsted",
    "Royal Netherlands Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}