{
  "nome_completo": "Platon Sergeevich Poretsky",
  "nome_curto": "Platon Sergeevich Poretsky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Poretsky/",
  "data_nascimento": "15 October 1846",
  "local_nascimento": "Elisavetgrad (now Kropyvnytskyi), Ukraine",
  "data_morte": "22 August 1907",
  "local_morte": "Joved, Chernigov guberniya, Russia",
  "summary": "Platon Sergeevich Poretsky was a Russian astronomer, mathematician, and logician.",
  "biografia": "Platon Sergeevich Poretsky\n's father, Sergei M Poretsky was born in\n1815\nin Lokhvytsya, Ukraine, a town about\n125\nkm east of Kiev. He was a military physician and, in particular, he participated in the defence of Sevastopol when it was besieged by British and French troops in\n1854\nduring the Crimean War. Although the main events of P S Poretsky's life and work have been known through obituaries such as\n[\n6\n]\n, it is only recently that further material on his life and work has come to light and this is described in\n[\n4\n]\nand in more detail in\n[\n5\n]\n. V A Bazhanov, the author of these papers, states in his summary of\n[\n4\n]\n:-\nIn February\n1992\n, T Ivanovic, working with the author in the archives at Kazan University, discovered new material relating to the life and work of the logician P S Poretsky\n(1846\n-\n1907)\n. These include: various documents related to Poretsky's lectures on mathematical logic for mathematics department students at Kazan University which were intended to be given for three semesters in the autumn of\n1887\nand all of\n1888\nbut were delivered only during the\n1888\nSpring semester, a complete mathematical logic program compiled by Poretsky, materials related to Poretsky's father and family, Poretsky's Magister's\n(\nmaster's\n)\ndissertation and the decision of the physics-mathematics faculty council to award him the doctorate in astronomy rather than the Magister, a complete list of the sources he used\n(\nincluding\nBoole\n,\nJevons\n,\nSchröder\n, and\nPeano\n)\n, biographical data and materials regarding his illness and subsequent dismissal from Kazan University.\nWe incorporate some information discovered by Bazhanov in the biographical details of Poretsky that we give below.\nPlaton Sergeevich Poretsky attended Poltava\nGymnasium\nand, after graduating, he entered the Physical-Mathematical Faculty of Kharkov University. He graduated in\n1870\nwith a Candidates Degree and, at the suggestion of Ivan Ivanovich Fedorenko\n(1827\n-\n1888)\nthe Professor of Astronomy, he worked as an astronomer and observer at Kharkov Observatory from\n1871\nto\n1874\n. Then he worked at the observatories in Astrakhan, Pulkovo, and, finally, from May\n1876\nat Kazan Observatory where\n[\n1\n]\n:-\n... he conducted observations of stars in the Kazan zone according to the program of the International Astronomical Society.\nOn\n25\nMay\n1886\nPoretsky defended his thesis for a master's degree in astronomy, entitled \"On the solution of some of the normal systems occurring in spherical astronomy, with an application to identify errors in the division of the Kazan Observatory meridian circle\" which he had submitted to the Physical-Mathematical Faculty of Kazan University\n[\n1\n]\n:-\n... the theoretical portion of\n[\nPoretsky's thesis\n]\ndealt with reducing the number of unknowns and equations for certain systems of cyclic equations that occur in practical astronomy.\nDmitry Ivanovich Dubyago\n(1849\n-\n1918)\nhad been appointed full professor and Director of the Observatory in Kazan in\n1884\n. He reviewed Poretsky's thesis, giving it the highest grade. The members of the examining panel also noted that the thesis was of the highest level. As a consequence, the Board of the Faculty \"because of its outstanding merit\" decided to recommend the award of the degree of Doctor of Astronomy instead of the Master's Degree for which the thesis had been submitted. On\n31\nMay\n1886\nthe decision of the Board was approved by the Council of Kazan University and on\n31\nDecember\n1886\nPoretsky was promoted to a\nPrivatdozent\n. However, the award of the doctorate was not made until Poretsky, because of ill health, filed his resignation on\n4\nMarch\n1889\n. This seems to have prompted action from the University for on\n12\nMarch\n1889\nthe University issued the doctoral diploma, signed by the University President, the Dean and the Secretary the Physical-Mathematical Faculty. Poretsky received his doctorate on\n5\nApril. During his years at Kazan, Poretsky took a full part in the Kazan Physical-Mathematical Society\n[\n1\n]\n:-\nFrom\n1882\nto\n1888\nPoretsky was secretary and treasurer of the Physical-Mathematical Section of the Kazan Society of Natural Science, supervising the publication of its Proceedings; for several years he edited a liberal newspaper, 'Kazansky telegraf', sometimes publishing in it his translations of Pierre Béranger's poems.\nPoretsky became interested in logic through Alexander V Vasiliev soon after arriving in Kazan in\n1876\n. Vasiliev was a prominent mathematician, the founder of the Kazan Physical-Mathematical Society and its first Chairman. He spent his life writing about\nNikolai Ivanovich Lobachevsky\nwho had been a friend of Vasiliev's grandfather. In session\n1887\n-\n1888\n, Poretsky lectured on mathematical logic, the first time that such a course had been given in Russia. Vasiliev, reporting on Poretsky's course, wrote\n(\nsee\n[\n5\n]\n)\n:-\nI think teaching mathematical logic is very useful ... Mathematical logic is a branch of the general science of operations, and in this respect deserves attention from mathematicians. This is the reason that this branch of knowledge was developed by mathematicians such as\nGeorge Boole\n,\nErnst Schröder\n,\nHermann Grassmann\n,\nCharles S Peirce\nand others ... The basic concepts of mathematical logic to a great extent clarifies the fundamental theorems of mathematical theory.\nPoretsky worked on mathematical logic for the rest of his life, extending and augmenting results of\nGeorge Boole\n,\nStanley Jevons\n,\nErnst Schröder\nand\nJohn Venn\n[\n1\n]\n:-\nIn papers published from\n1880\nto\n1908\n, Poretsky systematically studied and solved many problems of the logic of classes and of propositions. He developed an original system of axioms of logical calculus and proposed a very convenient mode of determining all the conclusions that are deducible from a given logical premise, and of determining all possible logical hypotheses from which given conclusions may be deduced.\nHe published major works on methods of solution of logical equations, and on the reverse mode of mathematical logic. He applied his logic calculus to the theory of\nprobability\n. Although he retired from his teaching role at Kazan in\n1889\ndue to ill health, this did not mean that he stopped his research. He continued to undertake research into mathematical logic for the remaining eighteen years of his life.\nWe end this short biography by quoting from\n[\n5\n]\n:-\nScientists in Russia and the Soviet Union made a significant contribution to the development of mathematical logic - both its classical and non-classical areas. It is worth remembering, for example, the names of:\nA N Kolmogorov\n, I I Zhegalkin, M I Sheynfinkelya, V I Shestakova,\nP S Novikov\n,\nA I Malcev\n,\nV Matiyasevich\netc. all contributors to the classical areas of the subject; N A Vasilyeva, I E Orlov, V I Glivenko,\nA A Markov\n, D A Bochvara, etc. all contributors to the non-classical areas of the subject. Of course, the separation of logic into \"classical\" and \"non-classical\" is quite arbitrary. Thus,\nA N Kolmogorov\nleft outstanding results in both the classical and the non-classical areas of modern logic. But who in Russia was the pioneer of mathematical logic? ... In the annals of history his name is clearly spelled out - Platon Sergeevich Poretsky. He was the first in Russia not only to be engaged in research on mathematical logic, and the first to deliver a course on mathematical logic\n(\nthe Kazan University\n)\n, but also achieved - thanks to his understanding of the subject and his development of original methods - word-wide visibility and recognition.",
  "matematicos_citados_na_biografia": [
    "Boole",
    "Jevons",
    "Schröder",
    "Peano",
    "Gymnasium",
    "Privatdozent",
    "Nikolai Ivanovich Lobachevsky",
    "George Boole",
    "Ernst Schröder",
    "Hermann Grassmann",
    "Charles S Peirce",
    "Stanley Jevons",
    "John Venn",
    "probability",
    "A N Kolmogorov",
    "P S Novikov",
    "A I Malcev",
    "V Matiyasevich",
    "A A Markov"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}