{
  "nome_completo": "Plato",
  "nome_curto": "Plato",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plato/",
  "data_nascimento": "427 BC",
  "local_nascimento": "Athens, Greece",
  "data_morte": "347 BC",
  "local_morte": "Athens, Greece",
  "summary": "Plato is one of the most important Greek philosophers. He founded the Academy in Athens. His works on philosophy, politics and mathematics were very influential and laid the foundations for Euclid's systematic approach to mathematics.",
  "biografia": "Before giving details of\nPlato\n's life we will take a few moments to discuss how definite the details are which we give below. The details are mostly given by Plato himself in letters which seem, on the face of it, to make them certain. However, it is disputed whether Plato did indeed write the letters so there are three possible interpretations. Firstly that Plato wrote the letters and therefore the details are accurate. Secondly that although not written by Plato, the letters were written by someone who knew him or at least had access to accurate information on his life. The third possibility, which unfortunately cannot be ruled out, is that they were written by someone as pure fiction.\nNext we should comment on the name 'Plato'. In\n[\n13\n]\nRowe writes:-\nIt was claimed that Plato's real name was Aristocles, and that 'Plato' was a nickname\n(\nroughly 'the broad'\n)\nderived either from the width of his shoulders, the results of training for wrestling, or from the breadth of his style, or from the size of his forehead.\nPlato was the youngest son of Ariston and Perictione who both came from famous wealthy families who had lived in Athens for generations. While Plato was a young man his father died and his mother remarried, her second husband being Pyrilampes. It was mostly in Pyrilampes' house that Plato was brought up.\nAristotle\nwrites that when Plato was a young man he studied under Cratylus who was a student of\nHeracleitus\n, famed for his\ncosmology\nwhich is based on fire being the basic material of the universe. It almost certain that Plato became friends with\nSocrates\nwhen he was young, for Plato's mother's brother Charmides was a close friend of Socrates.\nThe\nPeloponnesian War\nwas fought between Athens and Sparta between\n431\nBC and\n404\nBC. Plato was in military service from\n409\nBC to\n404\nBC but at this time he wanted a political career rather than a military one. At the end of the war he joined the oligarchy of the Thirty Tyrants in Athens set up in\n404\nBC, one of whose leaders being his mother's brother Charmides, but their violent acts meant that Plato quickly left.\nIn\n403\nBC there was a restoration of democracy at Athens and Plato had great hopes that he would be able to enter politics again. However, the excesses of Athenian political life seem to have persuaded him to give up political ambitions. In particular, the execution of Socrates in\n399\nBC had a profound effect on him and he decided that he would have nothing further to do with politics in Athens.\nPlato left Athens after Socrates had been executed and travelled in Egypt, Sicily and Italy. In Egypt he learnt of a water clock and later introduced it into Greece. In Italy he learned of the work of\nPythagoras\nand came to appreciate the value of mathematics. This was an event of great importance since from the ideas Plato gained from the disciples of\nPythagoras\n, he formed his idea\n[\n6\n]\n:-\n... that the reality which scientific thought is seeking must be expressible in mathematical terms, mathematics being the most precise and definite kind of thinking of which we are capable. The significance of this idea for the development of science from the first beginnings to the present day has been immense.\nAgain there was a period of war and again Plato entered military service. It was claimed by later writers on Plato's life that he was decorated for bravery in battle during this period of his life. It is also thought that he began to write his dialogues at this time.\nPlato returned to Athens and founded his\nAcademy\nin Athens, in about\n387\nBC. It was on land which had belonged to a man called Academos, and this is where the name \"Academy\" came from. The\nAcademy\nwas an institution devoted to research and instruction in philosophy and the sciences, and Plato presided over it from\n387\nBC until his death in\n347\nBC.\nHis reasons for setting up the\nAcademy\nwere connected with his earlier ventures into politics. He had been bitterly disappointed with the standards displayed by those in public office and he hoped to train young men who would become statesmen. However, having given them the values that Plato believed in, Plato thought that these men would be able to improve the political leadership of the cities of Greece.\nOnly two further episodes in Plato's life are recorded. He went to Syracuse in\n367\nBC following the death of\nDionysius I\nwho had ruled the city. Dion, the brother-in-law of Dionysius I, persuaded Plato to come to Syracuse to tutor\nDionysius II\n, the new ruler. Plato did not expect the plan to succeed but because both Dion and\nArchytas\nof Tarentum believed in the plan then Plato agreed. Their plan was that if Dionysius II was trained in science and philosophy he would be able to prevent Carthage invading Sicily. However, Dionysius II was jealous of Dion whom he forced out of Syracuse and the plan, as Plato had expected, fell apart.\nPlato returned to Athens, but visited Syracuse again in\n361\nBC hoping to be able to bring the rivals together. He remained in Syracuse for part of\n360\nBC but did not achieve a political solution to the rivalry. Dion attacked Syracuse in a coup in\n357\n, gained control, but was murdered in\n354\n.\nField writes in\n[\n6\n]\nthat Plato's life:-\n... makes it clear that the popular conception of Plato as an aloof unworldly scholar, spinning theories in his study remote from practical life, is singularly wide of the mark. On the contrary, he was a man of the world, an experienced soldier, widely travelled, with close contacts with many of the leading men of affairs, both in his own city and elsewhere.\nPlato's main contributions are in philosophy, mathematics and science. However, it is not as easy as one might expect to discover Plato's philosophical views. The reason for this is that Plato wrote no systematic treatise giving his views, rather he wrote a number of dialogues\n(\nabout\n30)\nwhich are written in the form of conversations. Firstly we should comment on what superb pieces of literature these dialogues are\n[\n6\n]\n:-\nThey show the mastery of language, the power of indicating character, the sense of a situation, and the keen eye for both its tragic and its comic aspects, which set Plato among the greatest writers of the world. He uses these gifts to the full in inculcating the lessons he wants to teach.\nIn letters written by Plato he makes it clear that he understands that it will be difficult to work out his philosophical theory from the dialogues but he claims that the reader will only understand it after long thought, discussion and questioning. The dialogues do not contain Plato as a character so he does not declare that anything asserted in them are his own views. The characters are historic with Socrates usually the protagonist so it is not clear how much these characters express views with which they themselves would have put forward. It is thought that, at least in the early dialogues, the character of Socrates expresses views that Socrates actually held.\nThrough these dialogues, Plato contributed to the theory of art, in particular dance, music, poetry, architecture, and drama. He discussed a whole range of philosophical topics including\nethics\n,\nmetaphysics\nwhere topics such as immortality, man, mind, and Realism are discussed.\nHe discussed the philosophy of mathematics, political philosophy where topics such as censorship are discussed, and religious philosophy where topics such as atheism, dualism and pantheism are considered. In discussing epistemology he looked at ideas such as a priori knowledge and Rationalism. In his theory of Forms, Plato rejected the changeable, deceptive world that we are aware of through our senses proposing instead his world of ideas which were constant and true.\nLet us illustrate Plato's theory of Forms with one of his mathematical examples. Plato considers mathematical objects as perfect forms. For example a line is an object having length but no breadth. No matter how thin we make a line in the world of our senses, it will not be this perfect mathematical form, for it will always have breadth. In the\nPhaedo\nPlato talks of objects in the real world trying to be like their perfect forms. By this he is thinking of thinner and thinner lines which are tending in the limit to the mathematical concept of a line but, of course, never reaching it. Another example from the\nPhaedo\nis given in\n[\n6\n]\n:-\nThe instance taken there is the mathemtical relation of equality, and the contrast is drawn between the absolute equality we think of in mathematics and the rough, approximate equality which is what we have to be content with in dealing with objects with our senses.\nAgain in the\nRepublic\nPlato talks of geometrical diagrams as imperfect imitations of the perfect mathematical objects which they represent.\nPlato's contributions to the theories of education are shown by the way that he ran the\nAcademy\nand his idea of what constitutes an educated person. He also contributed to logic and legal philosophy, including\nrhetoric\n.\nAlthough Plato made no important mathematical discoveries himself, his belief that mathematics provides the finest training for the mind was extremely important in the development of the subject. Over the door of the\nAcademy\nwas written:-\nLet no one unversed in geometry enter here.\nPlato concentrated on the idea of 'proof' and insisted on accurate definitions and clear hypotheses. This laid the foundations for\nEuclid\n's systematic approach to mathematics. In\n[\n2\n]\nhis contributions to mathematics through his students are summarised:-\nAll of the most important mathematical work of the\n4\nth\ncentury was done by friends or pupils of Plato. The first students of\nconic sections\n, and possibly\nTheaetetus\n, the creator of solid geometry, were members of the Academy.\nEudoxus of Cnidus\n- author of the doctrine of proportion expounded in\nEuclid\n's \"Elements\", inventor of the method of finding the areas and volumes of curvilinear figures by\nexhaustion\n, and propounder of the astronomical scheme of\nconcentric spheres\nadopted and altered by\nAristotle\n- removed his school from Cyzicus to Athens for the purpose of cooperating with Plato; and during one of Plato's absences he seems to have acted as the head of the Academy.\nArchytas\n, the inventor of mechanical science, was a friend and correspondent of Plato.\nIn mathematics Plato's name is attached to the Platonic solids. In the\nTimaeus\nthere is a mathematical construction of the elements\n(\nearth, fire, air, and water\n)\n, in which the cube, tetrahedron,\noctahedron\n, and\nicosahedron\nare given as the shapes of the atoms of earth, fire, air, and water. The fifth Platonic solid, the\ndodecahedron\n, is Plato's model for the whole universe.\nPlato's beliefs as regards the universe were that the stars, planets, Sun and Moon move round the Earth in crystalline spheres. The sphere of the Moon was closest to the Earth, then the sphere of the Sun, then Mercury, Venus, Mars, Jupiter, Saturn and furthest away was the sphere of the stars. He believed that the Moon shines by reflected sunlight.\nPerhaps the best overview of Plato's views can be gained from examining what he thought that a proper course of education should consist. Here is his course of study\n[\n2\n]\n:-\n... the exact sciences - arithmetic, plane and solid geometry, astronomy, and harmonics - would first be studied for ten years to familiarise the mind with relations that can only be apprehended by thought. Five years would then be given to the still severer study of '\ndialectic\n'. Dialectic is the art of conversation, of question and answer; and according to Plato, dialectical skill is the ability to pose and answer questions about the essences of things. The dialectician replaces hypotheses with secure knowledge, and his aim is to ground all science, all knowledge, on some 'unhypothetical first principle'.\nPlato's Academy\nflourished until\n529\nAD when it was closed down by the Christian Emperor Justinian who claimed it was a pagan establishment. Having survived for\n900\nyears it is the longest surviving university known.",
  "matematicos_citados_na_biografia": [
    "Aristotle",
    "Heracleitus",
    "cosmology",
    "Socrates",
    "Peloponnesian War",
    "Pythagoras",
    "Academy",
    "Dionysius I",
    "Dionysius II",
    "Archytas",
    "ethics",
    "metaphysics",
    "rhetoric",
    "Euclid",
    "conic sections",
    "Theaetetus",
    "Eudoxus of Cnidus",
    "exhaustion",
    "concentric spheres",
    "octahedron",
    "icosahedron",
    "dodecahedron",
    "dialectic",
    "Plato's Academy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}