{
  "nome_completo": "Poul Heegaard",
  "nome_curto": "Poul Heegaard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heegaard/",
  "data_nascimento": "2 November 1871",
  "local_nascimento": "Copenhagen, Denmark",
  "data_morte": "7 February 1948",
  "local_morte": "Oslo, Norway",
  "summary": "Poul Heegaard was a Danish mathematician who ( with Max Dehn ) was the first to classify compact surfaces.",
  "biografia": "Poul Heegaard\n's name occurs frequently\n(\nquite often misspelled as Heegard or even Hegard\n)\nin the area of three-\nmanifolds\nwhere 'Heegaard decompositions' and the associated 'Heegaard diagrams' remain important tools\n100\nyears after they first occurred in Heegaard's\n1898\nCopenhagen University dissertation. His father, Sophus Heegaard\n(1835\n-\n1884)\n, first studied theology, but after taking a degree in that subject he changed to study philosophy. He was a\ndozent\nin philosophy at the University of Copenhagen when his son Poul was born, being promoted to full professor in\n1875\n. Poul's mother was Louise Henriette Laurenze Fensmark\n(1839\n-\n1929)\nand he was the second of his parent's two children, having an older sister Henny. Sophus, who had an interest in astronomy and mathematics, strongly influenced his young son. Sadly, however, before Poul began his high school studies his father had a stroke and, around the same time, his sister Henny died. Poul entered the Metropolitanskolen in Copenhagen in\n1883\nbut he was still not skilled in numeracy\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\nI really only learned the addition table in\n[\nmy first year at the Metropolitanskolen\n]\nwhen the use of logarithms forced me to take it up on my own. I still remember that the occasion for this was my discovery that I had consistently believed seven plus eight to be seventeen. ... I never learned any mental arithmetic, a fact that has later been a great nuisance for me. By the way, this matter deteriorated even further towards the end of elementary school\n[\naround the age of\n10\nor\n11]\nwhen our teacher of arithmetic, a young student ... discovered that I had a flair for algebra. Apparently it amused him to replace the dry teaching of basic arithmetic by such abstract teaching of mathematics. This proved fateful to me in two ways. For one thing, it further weakened my basic arithmetic skills. For another, it developed my mathematical abilities at an early stage - and thus led my surroundings to drive me towards an occupation with mathematics for which I did have a talent, but for which I do not have the burning interest that I have met in others. I feel so particularly, when I compare with my interest in astronomy....\n[\nThe interest in\n]\nastronomy grew during the dark, starry nights. I would often sit astride the ridge of the roof and compare a star atlas with the firmament itself. Later, during starry nights, I have often felt the well-known constellations to be faithful friends.\nHowever, he progressed well in mathematics at the high school, being taught by Eigil Schmidt who was an excellent teacher. He graduated from the school in\n1889\nand entered the University of Copenhagen to study mathematics. After his father died when he was only one year into his high school education, the family were in financial difficulties. This meant that while he was at university he had to make some extra money by tutoring students and marking examination papers for the Copenhagen Polytechnic Institute. At the University of Copenhagen, he was taught by a number of leading mathematicians such as\nHieronymus Georg Zeuthen\nand\nJulius Petersen\n. He also took courses in astronomy taught by\nThorvald Thiele\n. He studied physics on his own but took courses in chemistry which he found boring. He graduated with a Master's Degree in\n1893\nhaving written a thesis on\nMichel Chasles\n' description of algebraic curves in a surface of second order.\nAt this stage Heegaard decided that he would benefit for international experience and received a stipend to support a year's study abroad. Following\nZeuthen\n's advice, he went to Paris in August\n1883\n. He was disappointed with this visit - he made few contacts with the mathematicians and the lectures he attended from\nÉmile Picard\nwere uninspiring\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\nHe covered his book 'Leçons d'Analyse' word for word. When he came into the room, met by applause, a caretaker ... would precede him at a light trot. He would pour water into a glass and place small bits of sugar beside it. Some of the students kept an account of the number of sugar bits consumed by\nPicard\nduring each lecture, and intended to expand the results in spherical harmonics after the semester. ... I also heard lectures by\nCamille Jordan\nat the College de France. Nor from him did I get exciting expositions. He went through the proof sheets of his 'Cours d'Analyse'. Occasionally, he would pause and pencil in a correction.\nIt has often been assumed that Heegaard's interest in\nPoincaré\n's work started in Paris. However, in\n[\n5\n]\n, Heegaard indicates that he never met\nPoincaré\nand he laments that his visit to Paris was mathematically very disappointing. Therefore, after one semester he moved to Göttingen where his contact with\nFelix Klein\nbecame very influential for his future work. In particular, his interest in\ntopology\ncame from an attempt to study algebraic functions of two complex variables by means of generalized\n(\nfour-dimensional\n)\nRiemann\nsurfaces. The study of three-dimensional manifolds mentioned above really is there because he had to give up on the four-dimensional case\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\nKlein\nhad me give two lectures in the 'Mathematische Gesellschaft' with a summary of\nZeuthen\n's work on enumerative geometry. He also discussed with me the idea that would later form the basis for my dissertation. Altogether, there was a scientific atmosphere which stimulated me very much - stronger than anything I have ever met again. ... When the semester ended, early October\n[1894]\n, I returned to Copenhagen, very satisfied with the result of my study visit. In particular, I had the idea for my dissertation. Now, the object was to get a secure occupation so that I could marry.\nIn order to support himself while working on his dissertation, Heegaard took a number of jobs teaching in high schools as well as undertaking some tutoring at the Polytechnic Institute. By\n1896\nhis income was sufficient to let him marry Magdalene. Johanne Magdalene Johansen\n(\nborn in\n1866)\nwas the daughter of the furniture manufacturer Andreas Lorenz Johansen\n(1830\n-\n1916)\nand his wife Grethe Sørensen\n(1834\n-\n1901)\n. The Heegaard's first child was born a year after their marriage and was named Lorenz after Magdalene's father. Heegaard submitted his dissertation\nForstudier til en topologisk Teori for de algebraiske Fladers Sammenhaeng\nⓉ\n(\nPreliminary studies towards the topological theory of connectivity of algebraic surfaces\n)\nand successfully defended it in\n1898\n. Even though the dissertation is in Danish\n(\npublished as a book of\n97\npages\n)\n, it quickly became internationally well-known, mainly because it also contains a counter-example to the version of\nPoincaré\nduality published by\nPoincaré\nshortly before. This counter-example sent\nPoincaré\nback to the drawing board and thereby contributed to a clarification of some basic notions of\nalgebraic topology\n. However, Heegaard's reputation in Denmark did not come up to the one he was achieving internationally\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\nI had sent my dissertation to\nPicard\nand\nPoincaré\n. The latter asked me about different things that he had not understood in the Danish text. Thus I wrote a summary of the dissertation in French for him. This led him to write a paper supplementing his original treatise, and thus my dissertation became known abroad even if it was written in Danish. In Denmark public opinion held it worthless and completely ridiculous. One of my foreign friends noted this in a conversation with one of the older mathematicians who had to admit at the same time that he had not read it.\nHeegaard had been interested in astronomy since he was a child and in\n1901\nhe began publishing a series of popular article on the topic. These were put together to make a book\nPopulaer Astronomi\nⓉ\n(\nPopular astronomy\n)\nwhich was published in\n1902\n. In fact throughout his university years he had from time to time thought of changing to make astronomy his main topic. After his dissertation of\n1898\nhe went as far as to give lectures on astronomy at the University of Copenhagen, but having never had the opportunity to learn observational skills, his interest in astronomy never took him to seek employment in this area. His friends encouraged him to apply for\nThiele\n's chair of astronomy following his retiral in\n1906\nbut Heegaard knew he lacked the necessary experience as an astronomer so did not apply.\nAnother important mathematical contribution by Heegaard is his\n1907\nsurvey article\n(\nwith\nMax Dehn\n)\nAnalysis Situs\nwhere the authors set out the foundations of combinatorial topology. This enabled them to give the first rigorous proof of the classification of compact surfaces. After his dissertation, Heegaard taught at various military schools in the Copenhagen area for more than\n10\nyears. Before\nZeuthen\nretired on\n1\nFebruary\n1910\na process was set up to find a successor. Many of Heegaard's friends encouraged him to apply but he was reluctant since he had little in the way of publications and he could not see how he could survive financially if appointed since the salary was only a fifth of the income he had at the time from his various posts. By this time he had a wife and six children to support, so a reasonable salary was necessary\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\nWhen all the calls to apply were lost on me for a period of six months, my friends ... turned to a different angle. They began to work on my mother. ... At last, the pressure was so great that I poured out my troubles to\nZeuthen\n. He completely concurred that I felt unqualified, but said that I ought to submit an application anyway. He would then see to it that I would not be appointed. Thus I submitted a very short application.\nIn\n1910\n, he accepted the chair at Copenhagen University following\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\n... a succession of dramatic events which I shall not report on here since I had nothing to do with them and stood by quite powerlessly.\nHe did not resign all his teaching positions when he took up the chair, keeping his position at the Polytechnic Institute which meant that although he still took a big cut in salary, he was able support his family. He was a successful lecturer, teaching Geometry, Rational Mechanics, Elementary Mathematics, History of Mathematics and General Mathematics for Actuaries, but he found many difficulties dealing with his colleagues. After holding the chair for seven years he resigned, quoting a heavy workload and disagreements with colleagues as his reasons. Although he claimed that he did not have time for mathematical research, nevertheless he did find time to write popular astronomy articles and also articles on high school teaching of mathematics. Perhaps the real reason was, as he himself once wrote, that for mathematics\n(\n[\n5\n]\n,\n[\n8\n]\ntranslated in\n[\n7\n]\n)\n:-\n... I did have a talent, but for I do not have the burning interest that I have met in others.\nReports in the Danish Press at the time suggest that Heegaard's resignation may have had something to do with\nHarald Bohr\n, who was a professor at the Polytechnic Institute and wanted a position at the more prestigious University of Copenhagen. Strangely, two pages are missing from Heegaard's autobiographical notes\n[\n5\n]\njust at the point where he is about to write about his resignation and it has been conjectured that he may have put his real reasons in writing, then decided himself to destroy the pages.\nShortly after his resignation, Heegaard received an offer from the University of Kristiania\n(\nnow Oslo\n)\nin Norway. Here, he became a cofounder of the\nNorwegian Mathematical Society\nin\n1918\n, was its chairman from\n1929\nto\n1934\nand, with the teacher Anton Alexander, edited its journal from its beginning in\n1919\n. He a very popular teacher until he retired in\n1941\nand did inspired work forming links between the university, schools and the general public. He reformed the teaching of geometry and gave lectures on Mathematical Education. He also published another popular astronomy book\nStjerneverdenen. Verdensbilledet gennom Tiderne\nⓉ\n(\nStar world. World image through the ages\n)\nin\n1921\n.\nOne of the major projects he undertook while at Oslo was editing the works of\nSophus Lie\n.\nLie\n's papers appeared in six volumes, edited by Heegaard and\nFriedrich Engel\n, with extensive annotations by the editors.\nEngel\ndid most of the editorial work on Volumes\n3\nto\n6\nwhile most of the work on Volumes\n1\nand\n2\n, covering\nLie\n's geometric work, was done by Heegaard. Often Heegaard's annotations are twice the length of\nLie\n's original articles. This work led Heegaard to publish three papers generalising ideas in\nLie\n's papers.\nLet us now mention the International Congress of Mathematicians held in Oslo on\n14\n-\n18\nJuly\n1936\n. At this time Heegaard was dean of the faculty of mathematics and natural science and he played a large role in the Congress. Heegaard represented the rector of the university at a reception held in the Aula for the participants and their families on the evening of Monday\n13\nJuly. He\n[\n4\n]\n:-\n... spoke warm words of welcome in French, German, and English.\nOn Wednesday\n15\nJuly a bust of\nSophus Lie\nby the Norwegian sculptor Dyre Vaa was unveiled. It was a gift to the University from a committee of private donors\n[\n4\n]\n:-\nDean Poul Heegaard accepted the gift in the name of the University. He expressed the hope that the mathematical work in the University of Oslo would always be worthy of this great model, now embodied and symbolized by the bust. He felt it a good omen that this hope may be fulfilled by the fact that Professor\nCartan\nwas present to give the historical lecture\n(\ninterspersed with personal reminiscences\n)\nentitled: \"The role of Sophus Lie's theory of groups in the development of modern geometry\". ... Dean Heegaard said: \"I am glad to be able to state on this occasion that the printing of\nLie\n's Collected Works, with the exception of a fascicle of notes, is now completed. For this we are grateful to all institutions and persons who have helped us; especially to the Norwegian Mathematicians Association and above all to the untiring efforts of Professor\nFriedrich Engel\n(\nUniversity of Giessen\n)\n. The Works have become not only a monument to\nSophus Lie\n, but also to him.\"\nAn extensive bibliography for Poul Heegaard is contained in\n[\n6\n]\n.",
  "matematicos_citados_na_biografia": [
    "manifolds",
    "dozent",
    "Hieronymus Georg Zeuthen",
    "Julius Petersen",
    "Thorvald Thiele",
    "Michel Chasles",
    "Zeuthen",
    "Émile Picard",
    "Picard",
    "Camille Jordan",
    "Poincaré",
    "Felix Klein",
    "topology",
    "Riemann",
    "Klein",
    "algebraic topology",
    "Thiele",
    "Max Dehn",
    "Harald Bohr",
    "Norwegian Mathematical Society",
    "Sophus Lie",
    "Lie",
    "Friedrich Engel",
    "Engel",
    "Cartan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}