{
  "nome_completo": "Rafael Georg Artzy",
  "nome_curto": "Rafael Artzy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Artzy/",
  "data_nascimento": "23 July 1912",
  "local_nascimento": "Königsberg, Germany (now Kaliningrad, Russia)",
  "data_morte": "22 August 2006",
  "local_morte": "Haifa, Israel",
  "summary": "Rafael Artzy was an Israeli mathematician, born in what was then Germany and is now Russia. He worked in geometry.",
  "biografia": "Rafael Artzy\n's parents were Eduard Deutschländer and Ida Freudenheim. Eduard Deutschlander, the son of Moses and Angelika Deutschländer, was born in Hamburg on\n27\nAugust\n1880\nwhile Ida Freudenheim, the daughter of Julius and Fanny Freudenheim, was born in Königsberg on\n5\nOctober\n1878\n. They were married in Königsberg on\n3\nMarch\n1901\n. 'Artzy' is a name which Rafael took later in life, for he was given his father's name of Deutschländer and so while growing up he was known by the name\nRafael Deutschländer\n. Let us refer to him, however, as Artzy throughout this biography.\nArtzy attended schools in Königsberg, graduating in\n1930\n. Later that year, before the age of eighteen, he began his studies at the University of Königsberg. Among the staff at Königsberg were two professors,\nKurt Reidemeister\n, appointed to the chair at Königsberg in\n1925\n, and\nGábor Szegö\n, appointed in\n1926\nto succeed\nKonrad Knopp\n. Also lecturing at the University of Königsberg at this time were\nRichard Brauer\nand\nWerner Rogosinski\n. Before relating the events which followed we need to point out that Artzy came from a Jewish family and he was a strong believer in Zionist ideology.\nArtzy wrote\n(\nsee\n[\n1\n]\n)\n:-\nDuring my sixth semester, namely in\n1932\n,\nReidemeister\ninformed me it was a good idea to give me a topic for a doctoral dissertation because \"nobody knows what could happen to the Jews\". Thus I began to work on the topic of webs. Then immediately after Hitler's seizure of power,\nReidemeister\nwas dismissed. Since I had been very active in the Zionist movement a while back, I had decided to go to Palestine as soon as possible anyway; I also had a good knowledge of Hebrew.\nLet us look a little more at the details concerning these events. In January\n1933\n, shortly before Hitler came to power, National Socialist students at Königsberg organised a disturbance directed against the rector of the university.\nReidemeister\ndevoted a whole mathematics lecture to explaining to his students why the behaviour of these students was totally unacceptable and not compatible with rational thinking. He only learnt that he had been dismissed when he read it in the local newspaper. On\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course removing those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired.\nReidemeister\nhad been dismissed by the Nazis in\n1933\nbecause he was considered \"politically unsound\", and in fact he was dismissed even before Jewish colleagues. Although he was preparing to leave, Artzy still had to get permission to emigrate to Palestine\n(\nsee\n[\n1\n]\n)\n:-\nI was fortunate to have a cousin in Jerusalem who acted as guarantor. So I only had to wait for the immigration \"certificate\", which arrived already towards the end of the summer semester of\n1933\n. At the same time I received a questionnaire from the university about my race, I scribbled \"Jew\" on it with big letters and threw it on the table in the Rector's office.\nArtzy married Elly Iwiansky\n(23\nApril\n1915\n-\n17\nNovember\n2010)\non\n12\nOctober\n1933\n. They had three children: a son Ehud Artzy born\n1\nAugust\n1939\n, a daughter Michal Artzy born\n28\nJuly\n1943\n, and a son Barak Artzy born\n5\nOctober\n1949\n.\nAfter arriving in Jerusalem, Artzy began studying at the Hebrew University in Jerusalem and he was awarded the degree of Master of Arts in\n1934\n. Three factors, however, made his subsequent research towards his Ph.D. at the Hebrew University difficult. His first problem was that he had to write his\n(\nsee\n[\n1\n]\n)\n:-\n... dissertation without any guidance because there was no geometer in Jerusalem.\nHis second difficulty was that he had to earn a living to support himself and he did this by becoming a school teacher. He taught mathematics at various high schools in Palestine\n(\nwhich became Israel after the State of Israel was declared in\n1948)\nbeginning in\n1935\nand continuing until\n1951\n. The third difficulty was that he became very active in the Haganah movement which occupied much of his time. The Haganah movement was a Jewish paramilitary organisation which, by the time Artzy arrived in Jerusalem, had begun to acquire foreign arms and also to create their own in workshops. During the revolt by the Arabs in Palestine in\n1936\n-\n39\n, Haganah unofficially supported the efforts of the British to end the revolt. Despite these hindrances to Artzy's research efforts, he was awarded his doctorate in\n1945\nfrom the Hebrew University in Jerusalem for his thesis\nMinimum nets in abstract webs\nwritten in Hebrew with an English summary. The topic was the one suggested by\nReidemeister\nin\n1932\nwhile he was in Königsberg but his official advisor at the Hebrew University had been\nTheodore Motzkin\n. Peter Scherk, reviewing Artzy's English summary of his thesis, put the work in context:-\nAccording to\nBlaschke\n, an abstract\nn\nn\nn\n-web consists of two sets of elements, \"points\" and \"curves.\" The set of the curves is subdivided into\nn\nn\nn\nfamilies so that each curve belongs to exactly one of them. An \"incidence\" between the points and the curves satisfies the following axioms. Each point lies on exactly one curve of each family. Two curves of different families have exactly one point in common\n[\ncf.\nBlaschke\nand Bol, 'Geometrie der Gewebe'\nⓉ\n(\nGeometry of webs\n)\n(1938)]\n. Given two different points on the same curve of an\nn\nn\nn\n-web, a \"minimum\nn\nn\nn\n-web\" is the intersection of all the sub-\nn\nn\nn\n-webs that contain the two points; a \"minimum net\" is the set of the points of a minimum\nn\nn\nn\n-web. The purpose of this thesis is \"the construction and investigation of minimal nets in some of the most important types of webs.\" A\n(\nconcrete\n)\n\"parallel\nn\nn\nn\n-web\" consists of\nn\nn\nn\nfamilies of parallel straight lines in a plane and their intersections\n(\nn ≥\n3)\n. It is \"hexagonal,\" i.e., all the \"\nBrianchon\nhexagons\" formed by any sub-\n3\n-web are closed\n[\ncf.\nBlaschke\nand Bol\n]\n. On the other hand, all the hexagonal\nn\nn\nn\n-webs, with one exception, can be mapped topologically on parallel\nn\nn\nn\n-webs\n[\ncf. Blaschke and Bol\n]\n. The author seems to study some kind of abstractly defined parallel\nn\nn\nn\n-webs. In the case\nn\n=\n3\nn = 3\nn\n=\n3\n, \"the minimum net is a lattice. Its points are in correspondence to all pairs of integers. To secure all incidences, the closure of Brianchon's hexagon suffices.\" This sounds like an abstract analogue of the special case\nn\n=\n3\nn = 3\nn\n=\n3\nof the quoted theorem. Similar results seem to have been obtained for\nn\n>\n3\nn > 3\nn\n>\n3\n. A\n4\n-web consisting of a parallel\n3\n-web and a pencil of straight lines is also discussed. \"All these results are obtained by means of a suitable algebraization which leads to isomorphisms with nets in corresponding webs of straight lines in a plane. By adding axioms of continuity, we may show these isomorphisms to be, in a sense, topological representations.\"\nThe award of his doctorate did not lead to Artzy getting a university position and for several years he continued teaching at High Schools, now as a Principal Teacher of Mathematics. In\n1951\nArtzy was appointed to an assistantship at Technion, the Israel Institute of Technology in Haifa. We note that up to\n1955\nhis papers are written in Hebrew\n(\nexcept one in German\n)\nbut from then on all his paper were written in English except a couple in German.\nIn\n1956\nhe went to the United States to take up an appointment as a research associate and lecturer at the University of Wisconsin-Madison. Artzy sailed from Haifa on\n2\nAugust\n1956\non the ship 'Israel' arriving in New York on\n16\nAugust. His wife and family did not travel with him but they\n(\nElly and Michal and Barak\n)\nsailed from Haifa in January\n1957\non the\nIsrael\narriving in New York on\n1\nFebruary. Their eldest son Ehud was seventeen years old at the time and remained in Israel. They lived at\n2237\nCommonwealth Avenue, Madison, Wisconsin, USA, and were still in residence there in\n1958\n. In September\n1958\n, on their return to Israel, the family spent two weeks in England, sailing from New York to Plymouth on the 'Flandre', arriving on\n8\nSeptember. They give their address in England as\n39\nEngel Park, Mill Hill, London.\nArtzy returned to his position at Technion but in\n1960\nhe left and took up an assistant professorship in the United States\n(\nsee\n[\n1\n]\n)\n:-\nIn\n1960\nI accepted an assistant professorship at the University of North Carolina. Why? Somehow the provincialism at that time in Haifa, in Israel in general, had become too boring to me, and I felt an urge to travel, also with regard to mathematics.\nArtzy flew on an El Al flight on\n8\nSeptember\n1960\ntogether with his daughter Michal. He gave his permanent address in Israel as\n82\nHatikhon, Haifa, Israel and his new address in the United States as\n603\nAirport Road, Chapel Hill, North Carolina. His wife followed by ship with their son Barak, sailing from Haifa on the 'Israel' arriving in New York on\n10\nOctober\n1960\n. Artzy only held the position at the University of North Carolina for a year before moving to Rutgers University, New Brunswick, New Jersey where he was appointed as a full professor holding that position from\n1961\nto\n1965\n. During this period, he spent the semester September\n1964\nto December\n1964\nat the Institute for Advanced Study at Princeton. He was a professor at the State University of New York, Buffalo, from\n1965\nto\n1967\n. He moved again, this time to Temple University, Philadelphia, where he worked for the years\n1967\n-\n1973\n. In\n1973\nhe returned to Israel. Joseph Zaks writes\n[\n9\n]\n:-\n[\nArtzy\n]\ncame to the University of Haifa in\n1973\n. His arrival here was one of the main reasons that a Department of Mathematics started to function here in\n1972\n. Professor Artzy was the department's second chairman, and later became a dean of the Faculty of Social Sciences. After his retirement he served as the Students' Ombudsman. ... In the early\n1970\n's, Professor Artzy organized the first International Geometry Conference in Haifa, and kept the tradition of holding a conference once every four years, until the late\n1990\n's, a task which he taught me how to efficiently organize, sometimes in a rather unconventional way. All of our conferences had a usual feature: we started by welcoming the participants in the airport, and at the end we were looking at the bus of the participants leaving for the airport, cheerfully waving their hands. In each one of these conferences we had a day for sightseeing, that usually included a lunch in Kibbutz Amiad ...\nThe\n1979\nconference\nGeometry and Differential Geometry\nwas held at the University of Haifa, Israel,\n18\n-\n23\nMarch,\n1979\nand the Proceeding published in the following year. Artzy, as well as an organiser of the conference, was an editor of the Proceedings along with Izu Vaisman. The Preface begins:-\nGeometry, under its various aspects, has been a fascinating intellectual activity during the whole history of civilised mankind. It is an old and always new science which undoubtedly, has provided us with an important part of knowledge about the world and with many applications. The present volume included the text of most of the lectures presented at a Conference on Geometry and Differential Geometry, which was held at the University of Haifa, Israel, on March\n18\n-\n23\n,\n1979\n. The Conference was attended by some\n70\nmathematicians from all over the world. The subject matters covered a broad range, and many aspects of modern research in the field were discussed. This is why we decided to publish the Proceedings of the Conference and it is our hope that they will be of interest to the mathematical community.\nArtzy wrote two important books, namely\nLinear Geometry\n(1965)\nand\nGeometry. An algebraic approach\n(1992)\n. For extracts from reviews of these two books see\nTHIS LINK\n.\nArtzy was buried in Amiad cemetery near Safed, Israel, where his sons Ehud and Barak had been buried earlier having both predeceased their father. Ehud had been a member of the Amiad Kibbutz and had been an author of several papers while affiliated with the University of Buffalo, including\nNote on the uniquely colorable graphs\n(1973)\n,\nDisplay of three-dimensional information in computed tomography\n(1979)\n, and\nThe Theory, Design, Implementation and Evaluation of a Three-Dimensional Surface Detection Algorithm\n(1980)\n. Barak had died in June\n1975\nas the following newspaper report from the\nJewish Post\nof Indianapolis of\n20\nJune\n1975\nstates:-\nBarak Artzy returned in\n1971\nto Israel where he had been born, to serve in the army, but escaped unharmed despite the fact that he was in the thick of the fighting in the Yom Kippur war. Two weeks ago he was thrown from a horse here and when he was taken to Abington Memorial Hospital was pronounced dead.\nElly Artzy died in\n2010\n.",
  "matematicos_citados_na_biografia": [
    "Kurt Reidemeister",
    "Gábor Szegö",
    "Konrad Knopp",
    "Richard Brauer",
    "Werner Rogosinski",
    "Reidemeister",
    "Theodore Motzkin",
    "Blaschke",
    "Brianchon",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}