{
  "nome_completo": "Ralph Allen Sampson",
  "nome_curto": "Ralph Sampson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sampson/",
  "data_nascimento": "25 June 1866",
  "local_nascimento": "Schull, Co Cork, Ireland",
  "data_morte": "7 November 1939",
  "local_morte": "Bath, England",
  "summary": "Ralph  Sampson was an Irish astronomer who worked on the theory of the motions of Jupiter's four Galilean satellites.",
  "biografia": "Ralph Sampson\n's father was James Sampson, a metallurgical chemist from Cornwall, and his mother was Sarah Anne Macdermott, from Ireland. Ralph was the fourth of his parents' five children and was born in Schull, County Cork, Ireland, where his father was working at the time. When he was five years old the family moved to Liverpool but his father became ill, perhaps brought on by financial worries when his investments in Cornish tin mines failed and he could not afford to educate his children. After two years of illness James Sampson died and his family continued to struggle financially.\nOnly at age fourteen did Ralph's formal education begin when he entered the Liverpool Institute. He showed remarkable abilities and was awarded a scholarship to St John's College, Cambridge to study mathematics. Entering Cambridge in June\n1884\n, he studied the Mathematical Tripos, was tutored by\nJohn Couch Adams\n, and was third\nWrangler\nin the Tripos of\n1888\n. Following this he was appointed as a lecturer in mathematics at King's College, London. In\n1889\nhe was awarded the first Smith's prize by Cambridge and elected a fellow of St John's College in November\n1890\n. After two years as a lecturer in mathematics in London, Sampson returned to Cambridge in\n1891\nwhen he became the first holder of the\nIsaac Newton\nStudentship in Astronomy and Physical Optics. During his time in London he had published\nOn Stokes' Current-Function\n[\n2\n]\n:-\nThis is a hydrodynamical investigation relating to irrotational motion, symmetric about an axis, in a liquid, the velocity-potential being expressible as a sum of solid zonal harmonics.\nHe worked for the two years\n1891\n-\n93\nin Cambridge on astronomical spectroscopy and published a major paper\nOn the rotation and mechanical state of the Sun\n[\n2\n]\n:-\nIn addition to the usual assumption that the angular velocity increases inwards along all radii, he laid down postulates for a new theory of the distribution of the sun's internal temperature; being somewhat dissatisfied with the theory of convective equilibrium, he laid stress on the effects of radiation and absorption.\nIn\n1893\nhe was appointed as Professor of Mathematics at Durham College in Newcastle-upon-Tyne. He married Ida Binney, daughter of H A Binney of St Helens, in\n1894\n; they had three daughters and a son. Although Sampson had been brought up as an Anglican, his wife belonged to the Society of Friends. He joined and soon became a prominent member in the Durham area. In\n1895\nhe was appointed Professor of Mathematics at Durham. He also became Director of the Durham Observatory\n[\n1\n]\n:-\nIt was in Durham that Sampson undertook his greatest work, the dynamical theory of the four largest satellites of Jupiter. At that time, there were serious discrepancies between the theoretical predictions and actual observations of the four satellites. Sampson used a series of accurate observations from Harvard College Observatory to amend the existing theory of the satellite orbits, but the disagreement between theory and observation persisted. He worked out a new dynamical theory and published in\n1910\nTables of the Four Great Satellites of Jupiter, giving positions of the satellites from\n1850\nto\n2000\n. His 'Theory of the Four Great Satellites of Jupiter' appeared in\n1921\nand earned him the Gold Medal of the\nRoyal Astronomical Society\n. He did pioneering work in measuring the colour temperature of stars.\nSampson also did a superb job editing one volume of the papers of his former tutor,\nJohn Couch Adams\n. The whole work was published in several volumes between\n1896\nand\n1900\n, with Sampson's volume appearing in\n1900\n. This was the hardest of the volumes to edit since it consisted of\nAdams\nunpublished manuscripts. To study the manuscripts, he lived at Cambridge for a time while he undertook the difficult task. He explained:-\nThe papers as they reached me, and indeed as\nAdams\nleft them, were almost devoid of arrangement, except that they were folded in parcels of a few pages each, the product of a day's or a few days' sitting: each parcel was generally very clear in itself, but carried no indication of its purpose or relations to others.\nHis election as a Fellow of the\nRoyal Society\nin\n1903\nwas partly as a result of editing\nAdams\n's papers.\nIn\n1910\nSampson was appointed to a professorship at the University of Edinburgh and also as Astronomer Royal for Scotland.\nWhittaker\nwrites\n[\n2\n]\n:-\nAs Director of the Royal Observatory on the Blackford Hill he devoted much attention to the determination and recording of time, especially as regards the behaviour of observatory clocks ... He was elected as the first President of the \"Commission de I'Heure\" but resigned from this later owing to differences with the French astronomer\nBigourdan\n. He also published many papers on the geometrical optics of telescopes and the methods of removing optical defects ...\nIn\n1915\nhe was awarded the\nHopkins\nPrize of the Cambridge Philosophical Society, and was elected President of the\nRoyal Astronomical Society\n. He served as President until\n1917\n, having\nArthur Eddington\nas Secretary of the Society during these two years. Of course, his period of office fell exactly in the middle of World War I and this produced some difficulties since many fellows were on military service and unable to pay their subscriptions. An additional bye-law was passed excusing those on military service from paying subscriptions until the end of the year following that in which peace was declared. More significant was that during Sampson's presidency, women were admitted as fellows on equal terms to men. The necessary action was taken at the Annual General Meeting of\n1915\n, and the first women fellows were elected at the meeting in January\n1916\n.\nSampson received many honours for his contributions. We have mentioned several of these above, but let us also mention that he was elected a fellow of the\nRoyal Society of Edinburgh\non\n4\nDecember\n1911\nbeing proposed by Sir Frank Watson Dyson, Sir James Walker, Arthur Robinson, and James Gordon MacGregor. He served the Society as Councillor\n1912\n-\n15\nand\n1919\n-\n21\n, as Vice-President\n1915\n-\n18\nand\n1933\n-\n36\n, as Secretary to Ordinary Meetings\n1922\n-\n23\n, and as General Secretary\n1923\n-\n33\n. The Society also honoured him with the award of their Keith Prize\n1919\n-\n21\n. The University of Durham conferred on him the honorary degree of D.Sc., and the University of Glasgow that of LL.D.\nSampson retired from his positions at Edinburgh University at age\n71\nin\n1937\ndue to failing health. He moved with his wife to Bath where he spent the last two years of his life.",
  "matematicos_citados_na_biografia": [
    "John Couch Adams",
    "Wrangler",
    "Isaac Newton",
    "Royal Astronomical Society",
    "Adams",
    "Royal Society",
    "Whittaker",
    "Bigourdan",
    "Hopkins",
    "Arthur Eddington",
    "Royal Society of Edinburgh"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}