{
  "nome_completo": "Ramon Llull",
  "nome_curto": "Ramon Llull",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Llull/",
  "data_nascimento": "1235",
  "local_nascimento": "Majorca (now Spain)",
  "data_morte": "1316",
  "local_morte": "(probably) Tunis, Tunisia",
  "summary": "Ramon Llull was a Majorcan philosopher whose logical methods influenced Leibniz.",
  "biografia": "Ramon Llull\nwas brought up at the royal court of Majorca. There he learnt Arabic from the Moorish population. Llull left Majorca in about\n1265\nafter he experienced mystical visions of Christ on the Cross. He then undertook missionary work in North Africa and Asia Minor where he taught the pacifist doctrines on St Francis of Assisi.\nLlull's main work is the\nArs magna\n(1305\n-\n08)\n, comprising of a number of treatises including\nThe Tree of Knowledge\nand The\nBook of the Ascent and Descent of the Intellect\n. This work was inspired by another mystical experience related in\n[\n1\n]\n:-\nAbout\n1272\n, after another mystical experience on Majorca's Mount Randa in which Llull related seeing the whole universe reflecting the divine attributes, he conceived of reducing all knowledge to first principles and determining their convergent point of unity.\nLlull used logic and mechanical methods involving symbolic notation and combinatorial diagrams to relate all forms of knowledge. This work makes him a precursor of combinatorics and this aspect is fully discussed in\n[\n3\n]\n.\nIt is unclear exactly how Llull died. In\n[\n1\n]\nit is related that:-\n... according to legend, Llull was stoned in North Africa at Bejaia\n(\nBougie\n)\nor Tunis and died a martyr at sea before reaching Majorca, where he was buried.\nLlull's reduction of Christianity to rational discussion, in which he attempted to prove the dogmas of the Church by logical argument, did not find favour after his death. In\n1376\nPope Gregory XI charged Llull with confusing faith with reason and condemned his teachings. The Roman Catholic Church did however pardon Llull more quickly than\nGalileo\n, since he was venerated in the\n19\nth\ncentury.\nLlull's work is important for a number of reasons, one certainly being the great influence it had on\nLeibniz\n. One of Llull's early works on chivalry was translated into English and thought important enough by the early printer William Caxton that he edited and printed the work. Llull's mystical writings such as\nThe Book of the Lover and the Beloved\nare still popular and his work has an important role in Catalan culture.",
  "matematicos_citados_na_biografia": [
    "Galileo",
    "Leibniz"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}