{
  "nome_completo": "James Ray Vanstone",
  "nome_curto": "Ray Vanstone",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vanstone/",
  "data_nascimento": "12 August 1933",
  "local_nascimento": "Owen Sound, Ontario, Canada",
  "data_morte": "9 April 2001",
  "local_morte": "Florida, USA",
  "summary": "James Vanstone was a Canadian mathematician who dealt with differential geometry and multilinear algebra, especially in connection with the theory of relativity.",
  "biografia": "Ray Vanstone\nwas the son of H V Vanstone. He attended the University of Toronto where he studied mathematics and was awarded a Bachelor's degree after which he studied for a Master's degree. While an undergraduate at University College, University of Toronto, he lived in the residence at\n73\nSt George Street.\nHanno Rund\nhad been appointed as an Assistant Professor of Applied Mathematics at the University of Toronto in\n1954\nand Vanstone attended courses that Rund taught. Vanstone also attended courses on geometry given by\nDonald Coxeter\n.\nVanstone married Ann Laurel Hutt, daughter of Donald George Hutt of Ottawa, on\n8\nOctober\n1955\nin Hart House Chapel, the University of Toronto\n[\n5\n]\n:-\nFollowing a reception at the Park Plaza Hotel, the couple left on a honeymoon trip to the Muskoka district. On their return they will reside at\n9\nHarbord Street in Toronto, where Mr Vanstone is studying for a postgraduate degree in mathematics.\nFor The Ottawa Journal report of their wedding, see\nTHIS LINK\n.\nRund\nreturned to South Africa in May\n1956\nwhere he had been appointed Professor and Head of the Department of Mathematics at the University of Natal in Durban. After completing his Master's Degree, Vanstone travelled to South Africa with his wife so that he could study for a Ph.D. supervised by\nRund\n. He was awarded a Ph.D. in\n1959\nfor his thesis\nGeneralized Metric Differential Geometry\n. While in South Africa, his first child was born:-\nTo Dr and Mrs James Ray Vanstone\n(\nnee Ann Laurel Hutt\n)\nat Parklands Nursing Home, Durban, South Africa, a son, Jonathan Victor, on Saturday\n6\nJune\n1959\n.\nA few months later, Vanstone, his wife and their baby son returned to Canada. They sailed on the\nSouth African Merchant\nfrom Cape Town to Baltimore, Maryland arriving on\n28\nSeptember\n1959\n. Travelling to Toronto, Vanstone took up an appointment as a lecturer in mathematics in October\n1959\n. He submitted two papers for publication in June\n1960\n. The first, submitted on\n17\nJune to the\nCanadian Mathematical Bulletin\nwas\nAutoparallel deviation in the geometry of Lyra\n. It was published in\n1960\nand has the following Abstract:-\nOne of the fruitful tools for examining the properties of a Riemannian manifold is the study of \"geodesic deviation\". The manner in which a vector, representing the displacement between points on two neighbouring geodesies, behaves gives an indication of the difference between the manifold and an Euclidean space. The study is essentially a geometrical approach to the second variation of the length integral in the calculus of variations. Similar considerations apply in the geometry of Lyra but as we shall see, appropriate analytical modifications must be made. The approach given here is modelled after that of\nRund\nwhich was originally designed to deal with a\nFinsler\nmanifold but which applies equally well to the present case.\nThe second paper, submitted to the\nCanadian Journal of Mathematics\non\n24\nJune, was\nA generalization of Finsler geometry\n. Vanstone writes:-\nThis paper comprises a portion of a doctoral thesis submitted to the University of Natal.\nHe gives an Introduction which begins as follows:-\nModern differential geometry may be said to date from\nRiemann\n's famous lecture of\n1854\n, in which a\n[\ncertain\n]\ndistance function ... was proposed. The applications of the consequent geometry were many and varied. Examples are\nSynge\n's geometrization of mechanics,\nRiesz\n' approach to linear elliptic partial differential equations, and the well-known general theory of relativity of\nEinstein\n. Meanwhile the results of\nCaratheodory\nin the calculus of variations led\nFinsler\nin\n1918\nto introduce a generalization of the Riemannian metric function. The geometry which arose was more fully developed by\nBerwald\nand\nSynge\nabout\n1925\nand later by\nCartan\n, Busemann, and\nRund\n. It was then possible to extend the applications of Riemannian geometry.\nHe ends the paper with the following acknowledgement:-\nTo conclude, I wish to express my deep gratitude to Professor\nH Rund\n, who supervised this thesis work and to whom I am indebted for many constructive suggestions and criticisms.\nAlso in\n1962\nhis paper\nThe general static spherically symmetric solution of the \"weak'' unified field equations\nwas published and, in\n1964\n, his paper\nThe Hamilton-Jacobi equations for a relativistic charged particle\nappeared. This last mentioned paper has the following Abstract:-\nIn the problem of finding the motion of a classical particle one has the choice of dealing with a system of second order ordinary differential equations\n(\nLagrange\n's equations\n)\nor a single first order partial differential equation\n(\nthe\nHamilton\n-\nJacobi\nequation, henceforth referred to as the H-J equation\n)\n. In practice the latter method is less frequently used because of the difficulty in finding complete integrals. When these are obtainable, however, the method leads rapidly to the equations of the trajectories. Furthermore it is of fundamental theoretical importance and it provides a basis for quantum mechanical analogues.\nHe give the following acknowledgement:-\nThe author would like to acknowledge his indebtedness to Professor D K Sen for several helpful discussions in connection with the above work.\nWe note that Dipak K Sen was a colleague of Vanstone's at the University of Toronto with interests in relativity and gravitation, and mathematical physics.\nIn\n1961\nVanstone was promoted to Assistant Professor and then, in\n1965\n, was promoted to Associate Professor with tenure. Vanstone's second child was born in\n1961\n:-\nDr and Mrs James Ray Vanstone\n(\nnee Ann Laurel Hutt\n)\nannounce the birth of Jonathan's sister, Brenda Jayne, cousin for Laurie and Jill McLean, Regina, at Toronto General Hospital on Thursday\n4\nMay\n1961\n, weight\n9\nlbs.\nRay and Ann Vanstone had two further children; Roderick, born at Toronto General Hospital on\n5\nOctober\n1962\n, and Kirsten.\nVanstone was on the programme committee of the Thirteenth Biennial Seminar of the Canadian Mathematical Congress which was devoted to differential topology, differential geometry and applications. It was held at Dalhousie University, Halifax, Nova Scotia, Canada, from\n16\nAugust to\n3\nSeptember\n1971\n. He was the editor of the\n2\n-volume Proceedings and wrote the Preface explaining the planning for the meeting:-\nPlanning for the thirteenth biennial seminar of the Canadian Mathematical Congress began in February\n1969\nwhen the theme was chosen and the programme committee was appointed. The topics \"differential geometry, differential topology and applications\" are ones in which almost every mathematical discipline has a role to play. Specialists in these topics must be generalists in mathematics. Perhaps for this reason, there has been a surge of interest in these subjects in recent years. Its impact has made itself felt in modern undergraduate curricula\n(\nwitness, for example, the increased emphasis on multilinear algebra and calculus on manifolds\n)\n. Since the area has not been particularly strongly represented in Canada, it was  felt that such a seminar would be both useful and timely. The programme committee, consisting of A E Fekete, W H Greub, Ngo Van Que,\nH Rund\n, U Suter and J R Vanstone was supplemented by A J Tingley the chairman of the mathematics department of Dalhousie University, the host institution. Its membership represented a wide range of topics within the seminar theme and Canadian universities from coast to coast. It met in Toronto on March\n7\n,\n1970\nand planned the general structure of the seminar. A list of possible speakers was drawn up and the chairman was asked to issue invitations. At its next meeting, on November\n28\n,\n1970\n, the principal speakers were confirmed, a tentative budget was prepared, and the application and selection procedures for participants were discussed. The final meeting before the Seminar was held on June\n5\n,\n1970\n, and the crucial task of distributing support money to applicants was carried out. The following paragraph summarizes the structure of the seminar. It was held in Halifax from August\n16\nto September\n3\n,\n1971\n. There were seven sequences of invited addresses, about forty one-hour lectures and about one hundred and fifty participants.\nVanstone's most famous work was the\n3\n-volume, three author monograph\nConnections, curvature, and cohomology\n. The three volumes were subtitled\nDe Rham cohomology of manifolds and vector bundles\n(1972)\n,\nLie groups, principal bundles, and characteristic classes\n(1973)\nand\nCohomology of principal bundles and homogeneous spaces\n(1976)\n. Vanstone's co-authors were Werner H Greub and Stephen Halperin. The Preface to the book explains how they came to write it:-\nThis monograph developed out of the 'Ahendseminar' of\n1958\n-\n1959\nat the University of Zürich. It was originally a joint enterprise of the first author\n[\nWerner H Greub\n]\nand H H Keller, who planned a brief treatise on connections in smooth fibre bundles. Then, in\n1960\n, the first author took a position in the United States and geographic considerations forced the cancellation of this arrangement. The collaboration between the first and third authors\n[\nVanstone\n]\nbegan with the former's move to Toronto in\n1962\n; they were joined by the second author\n[\nStephen Halperin\n]\nin\n1965\n. During this time the purpose and scope of the book grew to its present form: a three-volume study, ab initio, of the de Rham cohomology of smooth bundles. In particular, the material in volume I has been used at the University of Toronto as the syllabus for an introductory graduate course on differentiable manifolds.\nAlthough he remained on the Faculty at the University of Toronto throughout his career, where he was a full professor from\n1973\n,Vanstone did spend time in other institutions as a visiting professor. These were to Flinders University of South Australia, the University of Arizona, the Eidgenössische Technische Hochschule in Zurich, Switzerland, the University of Western Australia in Perth and the University of Mannheim in Germany.\nVanstone served the\nCanadian Mathematical Society\nin several different capacities over many years. He was a member of the Board in\n1969\n-\n72\nand\n1981\n-\n83\n, he served as editor of the\nBulletin\nof the\nCanadian Mathematical Society\nfrom\n1965\nto\n1967\nand editor of the\nJournal\nof the\nCanadian Mathematical Society\nfrom\n1983\nto\n1988\n.\nFor the\nCanadian Mathematical Society\nobituary of Vanstone, which includes reminiscences from his colleagues, see\nTHIS LINK\n.\nVanstone retired in\n1995\n. He died suddenly from a heart attack at his winter home in Florida. A memorial service and celebration of his life was held in University College, East Hall, University of Toronto, on\n15\nMay\n2001\n.",
  "matematicos_citados_na_biografia": [
    "Hanno Rund",
    "Donald Coxeter",
    "THIS LINK",
    "Rund",
    "Finsler",
    "Riemann",
    "Synge",
    "Riesz",
    "Einstein",
    "Caratheodory",
    "Berwald",
    "Cartan",
    "H Rund",
    "Lagrange",
    "Hamilton",
    "Jacobi",
    "Canadian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}