{
  "nome_completo": "Raymond Keiller Butchart",
  "nome_curto": "Raymond Butchart",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Butchart/",
  "data_nascimento": "4 May 1888",
  "local_nascimento": "Dundee, Scotland",
  "data_morte": "30 March 1930",
  "local_morte": "At sea, 65 miles south-east of Colombo",
  "summary": "Raymond Butchart was a Scottish mathematician who was badly wounded in World War I and afterwards returned to Dundee as a lecturer. He was appointed Professor of Mathematics at Raffles College Singapore but died of malaria on his way home on his first leave.",
  "biografia": "Raymond Butchart\n's father was Robert K Butchart\n(\nborn in Dundee, Angus, Scotland in about\n1852)\nwho was a Jute Spinning mill manager. His mother was  Margaret R Butchart\n(\nborn in Dundee about\n1853)\n.\nRaymond Butchart was educated at Morgan Academy in Dundee and Dundee High School before matriculating at the University of St Andrews. In fact Butchart did not even travel the\n12\nmiles to St Andrews, for his studies were in University College, Dundee, at that time part of the University of St Andrews. There he was taught by\nJ E A Steggall\n.\nAfter graduating with a B.Sc. in\n1913\n, Butchart began undertaking research in mathematics at Dundee and at the same time working as a mathematics tutor in the Department. By the end of\n1914\nWorld War I had started and Butchart found himself in a difficult position for he was offered an appointment at Wilson College, Bombay, but he was also about to receive a Commission as Lieutenant in the\n14\nth\nRoyal Scots.\nSteggall\nwrites\n[\n1\n]\n:-\nHe consulted me, and all that I could do, without urging him in any direction, was to say, as I had already said to others, that in the country's need every not incapacitated man should offer himself to some branch of the services for national defence; and that no such man, if he were spared, would be neglected by his fellow-countrymen when he returned to his native land.\nButchart took the Commission and acted as Brigade Signalling Officer. Later he became Captain but was severely wounded near the end of the war and he lost a leg.\nSteggall\nfound himself in a position to offer him a post as an assistant in the department of Mathematics at Dundee. In\n1921\nButchart was awarded his doctorate from the University of St Andrews, married Jean Ainslie Broome, and was promoted to Lecturer in Mathematics in University College, Dundee.\nIn\n1928\nhe accepted the appointment as Professor of Mathematics in Raffles College, Singapore. He and his wife sailed for Scotland early in\n1930\nto spend their first leave in their home country. It was not to be, for Butchart died of malaria while on the voyage and he was buried at sea,\n65\nmiles South East of Colombo.\nRaymond Butchart was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1914\n. He was elected to the\nRoyal Society of Edinburgh\non\n1\nFebruary\n1915\n, his proposers being\nWilliam Peddie\n,\nSir D'Arcy Wentworth Thompson\n,\nPeter Comrie\n, Sir Ernest M Wedderburn.\nAn obituary, written by\nJ E A Steggall\n, appears in the\nProceedings\nof the\nRoyal Society of Edinburgh\n, Volume\n51\n(1930\n-\n31)\n,\n200\n-\n201\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "J E A Steggall",
    "Steggall",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "William Peddie",
    "Sir D'Arcy Wentworth Thompson",
    "Peter Comrie",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}