{
  "nome_completo": "Reinher of Paderborn",
  "nome_curto": "Reinher of Paderborn",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reinher/",
  "data_nascimento": "about 1140",
  "local_nascimento": "Paderborn, Roman Empire, now Germany",
  "data_morte": "about 1190",
  "local_morte": "Paderborn, Roman Empire, now Germany",
  "summary": "Reinher of Paderborn was a German mathematician who worked on the mathematics of the calendar and in particular on the calculation of Easter.",
  "biografia": "Reinher of Paderborn\nwas master and principal of the Paderborn cathedral school, and canon and dean of the Paderborn cathedral. This is supported by fifteen documents testified by him and by copies of his treatise\nComputus emendatus\nⓉ\n(\nCalculation improved\n)\n.\nIn\n1171\nReinher published his treatise\nComputus emendatus\nⓉ\n(\nCalculation improved\n)\n, an improved calculation method for calculating the date of Easter. In the\n12\nth\ncentury, it was obvious that the new moon in the sky appeared several days earlier than it was recorded in the calendar, represented by the church. The church followed the Easter calendar tables, developed for the years\n532\n-\n626\nby the abbot Dionysius Exiguus\n(\ndied c.\n540)\non instruction by Pope John I\n(523\n-\n526)\n. As Easter and the movable feasts stand in a special relation to the spring full moon, there existed a particular difficulty in calculating the date of Easter to match the solar year of about\n365\ndays and the lunar year of about\n354\ndays. There is no simple relation between the length of these two types of years hence they were to be calculated as exactly as possible.\nReinher was very interested in raising the prestige of the church in the field of calendrical calculations.\nQui fidem catholicam impugnant, gaudent, quod errorem inveniunt in compoto, quem tenet ecclesia. Putant enim et affirmant etiam in aliis nos errare.\n(\nThe fighters against the Catholic faith are pleased that they find an error in Computus, which the church represents. They believe and assure that we are also wrong in other respects.\n)\nBecause of his theological interest he looked at the evident error of the calendar caused by a misunderstood lunar cycle; the error in the solar cycle he had set aside. An innovation for this period was his introduction to the Jewish calendar knowledge, based on this knowledge he analyzed the mistakes of the previous calculation of the lunar year and he described in detail the steps for a correct approach. Reinher compared the lunar cycles of the Hebrews and of Dionysius Exiguus. Both assumed that\n235\nlunar cycles amounted to\n19\nyears. Reinher used a lunar orbit of the Hebrews consisting of\n29\ndays,\n12\nhours and\n793\nparts, each hour corresponds to\n1080\nparts. He calculated the lunar orbit of Dionysius by dividing every\n19\nyears by\n235\n; and he obtained\n29\ndays,\n12\nhours and\n174\nparts, each hour corresponds to\n235\nparts. Consequently, in\n315\nyears the two calculations differed by more than one day.\nIn the western world Reinher was the first who has used the Indian number system instead of the Roman numeral system for mathematical and astronomical work - because of the advantage of writing and arithmetic.\nIn designatione numerorum, figuris plerumque utimur aliis quam latinis, propter scribendi et computandi compendium.\n(\nWhen naming the numbers we use mostly of the other characters than Latin because of the advantage of writing and arithmetic.\n)\nThe scientific achievements of Reinher were extremely advanced for his time. Other western sources reported the Indian numerals and the Algorismus, such as the\nSalzburger Computus\n(1143)\n, the note-book of Hugo von Lerchenfeld or the annals of Regensburg\n(1174\n-\n1197)\n, the\nComputus\nof Master Chonrad\n(1200\n, in a revision of\n1396)\n, manuscripts\n(\nlate\n12\nth\ncentury\n)\nof the monastery Prüfening and the monastery Salem\n(\nliber algorizmi\n)\n, the\nMassa compoti\nof Alexandre de Villedieu\n(\nc.\n1200)\nor the arithmetic book\nLiber abaci\nof\nLeonardo Fibonacci\n(1202)\n. But no one before Reinher used the new number system in a scientific treatise.\nReinher did not use the Indian numerals as new typefaces for the Roman numerals, such as\nGerbert of Aurillac\n, later Pope Sylvester II, had done with the apices. He understood the new idea of the Indian number system, and earlier than many others of his time he recognized how the use of Indian numerals simplified the arithmetic. Reinher made his calculations with our familiar decimal system. But his mathematical vocabulary was that of\nBoethius\n(480\n-\n524)\nand not that of Plato Tiburtinus\n(\nc.\n1134)\n, as van Wijk\n[1\n, p.\n73]\n(\nhe used coacervare for 'to add'\n)\nand Honselmann\n[2\n, p.\n123]\n(\nhe used coacervare and aufferre for 'to add' and 'to subtract'\n)\nclaimed. Since both were not yet able to scan a text, they were unaware that Reinher had used more than once addere and subtrahere, e.g. addiderimus\n(\nlib.\n2\n.\n4)\nand subtraxerimus\n(\nlib.\n2\n.\n15)\n.\nReinher reported\n(\nlib.\n1\n.\n19)\nabout the special planetary alignment in the night of\n13\nSeptember\n1170\n, when Mars and Jupiter for a time appeared as only one star, a conjunction in the zodiac sign of Gemini, which is proved by the tables of Schoch\n(1873\n-\n1929)\nfor the\n13\n./\n14\n.\n9\n.\n1170\n. Incidentally, the same sample year\n(4930)\nalso is used by Moses Maimonides\n(1138\n-\n1204)\nin his book of recognition\n(\nMishneh Torah\n)\n.\nThe calendar was adapted to the solar year and to the lunar year by the Gregorian calendar reform\n(1582)\n. With regard to the lunar year the mistake was that\n235\nsynodic months by\n1\nh\n28\nm\n15\ns were shorter than\n19\nJulian years. This caused an error of\n1\nday in\n310\n.\n028329\nyears. How exactly the\n19\n-year lunar cycle was calculated by Reinher, shows a comparison with the values determined by him. Reinher calculated the\n19\n-year lunar cycle - according to the Hebrew calendar - with\n6939\n.\n68962\ndays. According to him, the mistake of Dionysius Exiguus is\n1\nday in\n314\n.\n683706\nyears.\nBy comparing the tables of Reinher with his own\nNew Tables for the Reduction of Jewish Dates\n, Van Wijk found a deviation of\n6\nhours, but he said approvingly\n[\n12\n]\n:-\nUnder this restriction it must be said that the tables of Reinher are admirably designed and calculated with a lot of care.\nThe script\nComputus emendatus\nⓉ\n(\nCalculation improved\n)\nof Reinher of Paderborn is preserved in five manuscripts. They are named according to their storage locations short HANN\n(\nNiedersächsische Landesbibliothek Hannover, IV,\n373\n,\n3\nv-\n10\nv,\n12\nth\ncentury\n)\n, LEID\n(\nLeiden, B. der Rijksuniversiteit, BPL\n191\nE,\n129\nr-\n140\nr,\n12\nth\ncentury\n)\n, PRAG\n(\nPraha, Státni knihovna, XIII.F.\n8\n(2346)\n,\n105\nr-\n127\n,\n13\n/\n14\nth\ncentury\n)\n, VATI\n(\nVatican City, B. Apostolica Vaticana, Vatlat.\n3124\n,\n33\nra-\n43\nra,\n13\n/\n14\nth\ncentury\n)\n, ADMO\n(\nStiftsbibliothek Admont, Austria, Cod.\n442\n[\nHMML Pr. No.\n9503]\n- Bl.\n38\nra-\n51\nva.,\n14\nth\ncentury\n)\n. LEID, ADMO, PRAG have been known for some time, HANN and VATI were rediscovered by Herold\n[\n5\n]\n. The copies HANN and LEID begin with a praise for Reinher.\nIncipit praefatio magistri Reinheri decani Patherbornensis, perspicacissimi calculatoris, in compotum emendatum.\n(\nPreface of Master Reinher, dean of Paderborn, the most ingenious mathematician, for improved Computus.\n)\nFor the former esteem of the manuscripts of Reinher it is worth mentioning that the enthusiasts - of broader collections of manuscripts - apparently had an interest to have Reinher's text bound together with other valuable texts, such as\nMassa compoti\nof Alexandre de Villedieu and\nDe anni ratione\nof\nJohannes de Sacrobosco\n.\nIn the\n15\nth\ncentury the manuscript of Reinher is proven to have been known, although we do not know the handwriting used. At the Council of Basel\n1431\n-\n1449\n, the treatise of Reinher was in many ways helpful.\nCusanus\nand the Cistercian monk Hermann Zoestius of the convent of Marienfeld belonged to the calendar committee and pushed for a calendar reform. Both quoted in their tracts from the work of Reinher. Zoestius described Reinher as author, but\nCusanus\nmade\nAlbertus Magnus\nthe author.\n... quae, cum obvient praeceptis legalibus, intentioni patrum et scandalum in fide parant, quia dicit\nAlbertus\n, quod inimici fidei et de hoc gloriantur, quoniam ex illo errore nos  in aliis pariformiter errare subsannant.\n(\n... since this is contrary to the law and to the intent of the fathers, it also served as a nuisance in the faith, because\nAlbertus\nsays that the enemies of faith also rejoice themselves about it, because they mock on the basis of this error that we would be in the same way being wrong in other things.\n)\nIn\n1951\nvan Wijk\n[12\n, p.\n5]\nrediscovered up the work of Reinher:-\nIt not only possesses irresistible charm, which is for all time the nature of a well-planned and well written scientific treatise, rather it is the first work about calendar knowledge that uses modern figures and it is the first Western source, which gives information about the modern computus of the Jews.\nHonselmann\n[9\n, p.\n126]\nremarked that:-\n...  the former Cathedral School in Paderborn may be regarded as one of the most advanced of its time with respect to the mathematical teaching because no other can make it probable that there has been already calculated with Arabic numerals previously.\nIncidentally, the later mathematician\nKarl Theodor Wilhelm Weierstrass\n(1815\n-\n1897)\nwas a student of the Akademisches\nGymnasium\n(\nnow Theodorianum\n)\n, which in its tradition goes back to the cathedral school of\n799\n.\nBorst\n[2\n, p.\n83]\ngave the\nComputus emendatus\nⓉ\n(\nCalculation improved\n)\nof Reinher the rating:-\n... of an equally moving as forgotten brilliant achievement of medieval science.",
  "matematicos_citados_na_biografia": [
    "Leonardo Fibonacci",
    "Gerbert of Aurillac",
    "Boethius",
    "Johannes de Sacrobosco",
    "Cusanus",
    "Albertus Magnus",
    "Albertus",
    "Karl Theodor Wilhelm Weierstrass",
    "Gymnasium"
  ],
  "imagens": []
}