{
  "nome_completo": "Renato Caccioppoli",
  "nome_curto": "Renato Caccioppoli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Caccioppoli/",
  "data_nascimento": "20 January 1904",
  "local_nascimento": "Naples, Italy",
  "data_morte": "8 May 1959",
  "local_morte": "Naples, Italy",
  "summary": "Renato Caccioppoli was an Italian mathematician, known for his contributions to mathematical analysis.",
  "biografia": "Renato Caccioppoli\nwas one of the most interesting and charming mathematical figures of the\n20\nth\ncentury. Grandson of Michail Bakunin, he lived his youth in a refined cultural environment. Following his father's wishes, he initially took Engineering studies. He later changed to Mathematics and was awarded his degree from the University of Naples in\n1925\n, having studied under the guidance of Ernesto Pascal but having been substantially influenced by Mauro Picone.\nIn the same year, Caccioppoli became Picone's assistant. In\n1931\nhe was appointed to the Chair of Algebraic Analysis in Padua and eventually returned to Naples in\n1934\n. From then, he taught\ngroup theory\nuntil\n1943\nand Mathematical Analysis until his death in\n1959\n.\nHis first publication dates back to\n1926\n. In this work Caccioppoli began to investigate how to generalise\nRiesz\n's theorem on the representation of linear functionals by extending the initial definition set. In the same year Caccioppoli considered the extension of the definition of linear functionals from the set of continuous functions to the set of\nBaire\nfunctions, anticipating a special case of the\nHahn\n-\nBanach\ntheorem. This approach was later taken up again by Caccioppoli, and it is one of the threads running throughout his work.\nIn\n1927\nCaccioppoli published an important work on integration on\nk\nk\nk\n-dimensional varieties in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n, where he wanted to establish:-\n... the principles of a theory of measure of plane and curved surfaces, and more generally of two or more dimensional varieties embedded in a linear space.\nThis topic has now found its proper place within the theory of so-called \"homological integration\" pioneered by\nH Federer\nin the\n1940\ns.\nOnce again Caccioppoli wanted to apply his \"classical\" method, that is to say, to extend a functional beyond its initial definition set. According to Caccioppoli, this functional should retain its property of lower semicontinuity, as is:-\n... imperatively suggested by geometric intuition.\nThe most successful approach to measure was, at this time, that proposed by\nLebesgue\n. The Neapolitan mathematician started from\nLebesgue\n's method considering a polyhedral surface\nS\nS\nS\nparametrically described by a pair of functions\nX\n=\nf\n(\nx\n,\ny\n)\nX = f (x, y)\nX\n=\nf\n(\nx\n,\ny\n)\nand\nY\n=\ng\n(\nx\n,\ny\n)\nY = g(x, y)\nY\n=\ng\n(\nx\n,\ny\n)\non a domain\nD\nD\nD\n. The image of a net triangulating\nD\nD\nD\nis a polyhedral plane surface, and by considering the lower limit of total variation of the pair\n(\nf\n,\ng\n)\n(f, g)\n(\nf\n,\ng\n)\na measure for\nS\nS\nS\ncan be defined. Caccioppoli did not follow\nLebesgue\nbeyond this point, i.e. in passing to the case in which\nS\nS\nS\nis a curved surface, as he considered the problem:-\n... to build, in its most general case, a sequence of polyhedral approximating surfaces, whose areas tend to the area of the curved surface whether finite or infinite.\nCaccioppoli then defined the area of a curved surface as the\nStieltjes\n' integral of the area element built with the area elements of the projections of the surface S on coordinate planes. He did not, however, immediately demonstrate the equivalence of his own definition to that of\nLebesgue\n, and this later led to some controversy with other mathematicians. Reviews by\nL C Young\ninitially suggested that Caccioppoli's theory was insufficient in general and only worked in some cases. Later work by\nEnnio de Giorgi\n, who explicitly followed  Caccioppoli's approach\n[\n7\n]\n, led to a reconsideration by\nYoung\nof Caccioppoli's ideas. He eventually admitted\n[\n15\n]\nto be able to \"judge more clearly the precise scope\" of Caccioppoli's work.\nAfter\n1930\nCaccioppoli devoted himself to the study of\ndifferential equations\nand he provided existence theorems for both linear and non-linear problems. His idea was to use a\ntopological\n- functional approach to the study of differential equations. For the linear case he considered a linear transformation acting on the vectors of a linear space\n(\nin which the solution is to be found\n)\n. Its elements are transformed into vectors of another linear space, in which data is assigned.\nIf the image set entirely covers the second linear space then solutions exist independently on the given data. If this is not the case\n(\ni.e. the image set is a linear, closed subspace in the second linear space\n)\nthen necessary and sufficient conditions are placed on the data set so that the problem has solutions.\nCarrying on in this way Caccioppoli, in\n1931\n, extended in some cases Brouwer's fixed point theorem, and applied his results to existence problems of both\npartial differential equations\nand ordinary differential equations. To decide on both existence and uniqueness\n(\nand not only on existence, as\nBrouwer\n's theorem does\n)\nhe provided the general concept of functional correspondence inversion, stating, in\n1932\n, that a transformation between two Banach spaces is invertible only if it is locally invertible and if the compact sequences are the only ones to be transformed into convergent sequences.\nIn the period between\n1933\nand\n1938\nCaccioppoli applied his method to elliptic equations, providing the a priori upper bound for their solutions, in a more general way than Bernstein did for the two-dimensional case. In that period he successfully studied branches of functions defined on\nC\nn\n\\mathbb{C}^{n}\nC\nn\n, and in\n1933\nfound the basic theorem on normal families of functions of complex variables, namely that if a family is normal to each complex variable, it is also normal to the whole set of variables. Coming back to his main interest in\nfunctional analysis\nhe deduced\n(\nin\nSui teoremi di esistenza di Riemann\nⓉ\n(\nOn the existence theorems of Riemann\n)\n. Rend.Acc.Sc.Fis. e Mat. Napoli, s.IV, v.\n4\n(1934)\n)\nthe theorem on harmonicity of orthogonal functions to any Laplacian, best known as \"\nWeyl\n's lemma\". Again in\n1938\nCaccioppoli resumed the study of\nRiemann\n's existence theorems, dealing with the existence of\nabelian integrals\non a closed\nRiemann\nsurface.\nIn\n1935\nhe dealt with the question introduced in\n1900\nby\nHilbert\nduring the International Congress of Mathematicians, namely whether or not the solutions of analytical elliptic equations are analytic. Caccioppoli proved the analyticity of\nC\n2\nC^{2}\nC\n2\n-class solutions.\nIn May\n1938\nHitler was visiting Naples with Mussolini: Caccioppoli, who had already shown his opposition to fascism, convinced an open-air restaurant orchestra to play La Marseillaise, and made a speech against Italian and German dictators.\nHe was arrested and he should have been tried by a special political court instituted by the fascists against their opponents , but he managed -- with the help of his aunt Maria Bakunin who was a chemistry teacher at the University of Naples -- to be declared mad and was eventually sent to an asylum.\nThere he worked with Carlo Miranda on the problem of existence of closed convex surfaces of a given Riemaniann metric, using his general inversion principle.\nGianfranco Cimmino\n, in\n[\n3\n]\n, remembers:-\nI went to see him every day. He showed that he accepted serenely his life together with madmen, as a peculiar life experience. But his friends and relatives were really sad and worried about it. They managed to obtain a less strict surveillance, and he was allowed to go out with me. I took him away from that nursing home in my car, to let him take a breath of air.\nTo avoid any contact with official academic institutions, which were strictly controlled by the fascist dictatorship, he published\n(1940)\nhis results in \"Commentationes Pontificiae Academiae Scientiarum\", a scientific review published in the Vatican State. His political opposition to fascism led him to organise a strike in Naples in\n1943\n.\nAfter the Second World War Renato Caccioppoli resumed his scientific activity. He was elected a corresponding Fellow of the\nAccademia dei Lincei\n, later becoming a National Fellow\n(1958)\n. He was also member of various Academic Institutions. During these years he joined the Italian Communist Party, although he did not entirely share the party's policy nor did he agree with the official Soviet vision of science. He joined the \"peace partisans\", a left-wing organisation supporting disarmament. He also founded a cultural association, the \"Circolo del cinema\", a film club.\nIn\n1952\nCaccioppoli sketched a revised vrsion of his early work on surface area and related topics, with the article\nMisura e integrazione degli insiemi dimensionalmente orientati\nⓉ\n(\nMeasurement and integration of dimensionally oriented sets\n)\n,\n(\nRend. Acc. Naz. Lincei, s. VIII, v.\n12)\n. In this work he focused his attention on the theory of \"dimensionally oriented sets\", namely surfaces of \"nice\" subsets of Euclidean space. These finite perimeter sets which were introduced by Caccioppoli are now known as \"Caccioppoli sets\".\nHis last work dates back to\n1952\n-\n1953\nand deals with pseudoanalytic functions - an original concept introduced by Caccioppoli - extending some properties of analytic functions.\nThe last years of his life were sad ones: Caccioppoli saw his political hopes disappointed, probably felt that his mathematical inspiration had run out, and his wife, Sara Mancuso, eventually left him. He took to drink and he became more and more isolated. He shot himself on\n8\nMay\n1959\n.\nGiuseppe Scorza Dragoni, quoted in\n[\n3\n]\n, wrote:-\n... I knew that the previous day he was seen in the Via Chiaia between midday and one o'clock\n(\nin the hour I usually came to Naples and saw him\n)\n; and they told me he killed himself in the late afternoon\n(\nwhen I certainly would not have come after that\n)\n. And since then I wonder if he was waiting for me; and I curse the misfortune that kept me in Rome and prevented me from joining the finest , the best, the most beloved of my friends, the most intelligent one. Unforgettable for anyone who had known him.\nIn\n1992\n, a film\nMorte di un matematica napoletono\nⓉ\n(\nDeath of a Naples mathematician\n)\nwas made by the Italian Director Mario Martone about the events leading to Caccioppoli's suicide.\nThe Mathematics Department at the University of Naples is named after Renato Caccioppoli.",
  "matematicos_citados_na_biografia": [
    "group theory",
    "Riesz",
    "Baire",
    "Hahn",
    "Banach",
    "H Federer",
    "Lebesgue",
    "Stieltjes",
    "L C Young",
    "Ennio de Giorgi",
    "Young",
    "differential equations",
    "topological",
    "partial differential equations",
    "Brouwer",
    "functional analysis",
    "Weyl",
    "Riemann",
    "abelian integrals",
    "Hilbert",
    "Gianfranco Cimmino",
    "Accademia dei Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}