{
  "nome_completo": "Richard Lloyd Gwilt",
  "nome_curto": "Richard Gwilt",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gwilt/",
  "data_nascimento": "25 July 1901",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "21 August 1972",
  "local_morte": "Edinburgh, Scotland",
  "summary": "Richard Gwilt was an actuary who worked for various Edinburgh insurance companies. He was a Fellow of the Faculty of Actuaries and of the Institute of Actuaries.",
  "biografia": "Richard Gwilt\n's father was  William Gwilt.\nRichard Gwilt attended George Watson's College, Edinburgh where he was an excellent pupil. In July\n1913\nhe was awarded a George Watson's College Bursary entitling him to free tuition in session\n1913\n-\n14\n. In\n1917\n, at the age of sixteen, he was appointed to the Edinburgh Life Assurance Company. Then in\n1922\nhe joined the Scottish Widows' Fund and Life Assurance Society, remaining with them for the rest of his career.\nIn\n1947\nGwilt was appointed General Manager and Actuary at Scottish Widows who then made the following announcement:-\nThe directors\n[\nof the Scottish Widows' Fund and Life Assurance Society\n]\nappointed, with the title of Secretary, Mr Richard Lloyd Gwilt, F.F.A., F.I.A., who joined the Society's service in\n1922\nand had been deputy secretary since November\n1934\n. From our knowledge and experience of Mr Gwilt's ability and capacity we are confident that he is well fitted to discharge the important duties of this responsible post.\nGwilt was a fellow of the Faculty of Actuaries, elected in\n1922\n, and of the Institute of Actuaries, elected in\n1923\n. He served as President of the Faculty from\n1952\nto\n1954\n. He was a member of the\nEdinburgh Mathematical Society\n, joining the Society in June\n1925\n. He was elected to the\nRoyal Society of Edinburgh\non\n3\nMarch\n1941\n, his proposers being Sir Ernest M Wedderburn,\nSir Edmund T Whittaker\n, A Graham Donald, James P Kendall.\nAn obituary, written by J M Ross, appears in the\nRoyal Society of Edinburgh\nYear Book\n1973\n, pages\n34\n-\n35\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nIn\n1926\nhe married Marjory Mair; they had three sons and a daughter. The birth of one of their sons was announced as follows:-\nAt\n18\nWalker Street, Edinburgh, on Thursday\n3\nNovember, to Marjory\n(\nnée Mair\n)\n, wife of Richard Lloyd Gwilt, a son.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "Sir Edmund T Whittaker",
    "THIS LINK"
  ],
  "imagens": []
}