{
  "nome_completo": "Robert McCredie May",
  "nome_curto": "Robert May",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/May_Robert/",
  "data_nascimento": "8 January 1936",
  "local_nascimento": "Sydney, Australia",
  "data_morte": "28 April 2020",
  "local_morte": "Oxford, England",
  "summary": "Robert May was an Australian mathematical biologist whose work played a key role in the development of theoretical ecology.",
  "biografia": "Robert May\n's parents were Henry W May and Kathleen McCredie. They were living in Alison Road, Randwick, a suburb of Sydney, when their son Robert, the subject of this biography, was born. Robert's younger brother was born on\n29\nOctober\n1939\nat War Memorial Hospital, Waverley. At this time his parents were living at Kowarra, Pitt Street, Randwick. Henry May's family were from Northern Ireland but his father, Robert's paternal grandfather, was a politically active Protestant who was threatened by the IRA and, one week later, was on a ship emigrating to Australia. Henry went from a well-off middle class upbringing in Northern Ireland to poverty in Newcastle, Australia. He made a name for himself as a bright lawyer but became addicted to alcohol. Kathleen McCredie's family were originally from Scotland. Her father was an engineer. Henry May's alcohol problem led to a divorce in\n1943\nwhen Robert was seven and he only ever saw his father again a couple of times when he was in his teens. Robert was brought up by his mother and his maternal grandparents.\nMay attended Woollahra Primary School and from a young age developed a fascination with mathematical puzzles\n[\n1\n]\n:-\nI was a fairly solitary child. I really did enjoy mathematical puzzles and puzzles of other kinds from when I was fairly young.\nLeaving Woollahra Primary School in\n1948\n, he began his secondary education at Sydney Boys High School. His maternal grandfather had attended this school, his mother had attended the girls' partner school, Sydney Girls High School, and one of his uncles had been an architect for these schools. This excellent school\n[\n1\n]\n:-\n... had a lot of really bright people and it had superb teachers. The teachers I had in high school were uniformly excellent. One of the really formative influences on my life was the chemistry teacher, a chap called Lenny Basser.\nOther than his academic subjects, his main activity at school was debating. He excelled at this and represented the school which had a outstanding reputation in the debating competitions. He completed his studies at Sydney Boys High School in\n1952\ncoming top in every subject he took. This all round ability made the decision on which subject he should study at university a difficult one. The careers advisors at the school were unanimous in saying that he should study law. He knew that if he took that route it would distress his mother to see him follow the same route as his father. It was not something which attracted his anyway, since he felt that law is about humanity's imperfections. Did he really want to spend his life doing that? His mother wanted him to study medicine since a few close members of her family were doctors. May did not feel that was the right course for him either. His chemistry teacher Lenny Basser suggested that he should study chemistry at the University of Sydney and so May decided to investigate chemical engineering. After talking to Rolf Prince, the Professor of Chemical Engineering at the University of Sydney, and having him arrange for May to visit the Colonial Sugar Refinery, he decided this was right for him and, in\n1953\n, entered the University of Sydney.\nIn his first year he took chemistry, mathematics and physics. The first two were at the honours level, but physics was only at the pass level. Despite having only taken the pass level course, he took the honours level physics examination at the end of the year, in part because his friends were taking it, in part because it was the last examination, and in part because he found examinations easy even if, as in this case, he had not prepared for it. He ended up winning a prize for chemistry and physics which was worth quite a lot of money. His family were poor so he could not turn down the money and accepting it required him to continue to study physics. Although advised against taking both chemical engineering and physics in his second year, he insisted on taking on the heavy load.\nAll this makes May sound like a student working very hard on his academic subjects but this was not quite the way it was\n[\n1\n]\n:-\nI had a wonderful time\n[\nat university\n]\n. I had lived at home and had been a relatively solitary younger child. Very luckily, going to university, I had a cohort of friends who had many of my own characteristics - very oddly, in retrospect. Essentially none of us drank and most of us didn't go out with girls - we hadn't worked out how you did it, as it were. We were a very close-knit set of people who did things together. I spent roughly half my university years playing chess or snooker in the union and just having a good time. I did not do my second-year laboratory chemistry very conscientiously, because it was too time consuming. I used various tricks and devices to abbreviate the time, which I think required more scientific insight than actually doing it honestly.\nThe standard route to honours chemical engineering was to take your third year completing an honours science degree then completing two further years of chemical engineering. He could major in one of pure mathematics, applied mathematics or physics but May wanted to major in all three. Although strongly advised not to take on such a heavy load, he did all three subjects and came top in each of them. He graduated with a B.Sc. in\n1956\nand, after much thought, decided not to continue with chemical engineering but instead to undertake research for his doctorate in theoretical physics. He was awarded a Ph.D. from the University of Sydney in\n1959\nfor his thesis\nInvestigations towards an understanding of superconductivity\n.\nMax Robert Schafroth\n(1923\n-\n59)\n, known as Robbie, was May's thesis advisor. He had been a student of and then assistant to\nWolfgang Pauli\nin Zurich before taking up the appointment in Sydney in\n1954\n. When May was in the third year of his research, Schafroth was appointed to the foundation chair in theoretical physics in Geneva, Switzerland and was due to begin on\n1\nSeptember\n1959\n. It had been May's intention to go to Geneva to undertake postdoctoral work with him after completing his Ph.D. but tragically Schafroth and his wife were killed in a small plane accident on\n29\nMay\n1959\nwhile making a farewell tour of Australia. May was now keen to leave Australia.\nAfter completing his Ph.D., May went to the United States to undertake postdoctoral work as Gordon MacKay Lecturer in Applied Mathematics in the Division of Engineering and Applied Physics at Harvard University. In his second year at Harvard he met Judith Feiner who grew up in Manhattan and, at the time they met, was an undergraduate at Brandeis University. She was born in\n1943\nto Jewish parents and had attended the New York High School of Music and Art. They saw each other for six months before May's time at Harvard came to an end in\n1961\nand by the end of that time decided to marry, which they did on\n3\nAugust\n1962\n. They have one daughter Naomi Felicity.\nAfter two years at Harvard, May returned to Sydney in\n1962\nand was appointed as a Senior Lecturer in Theoretical Physics. He was steadily promoted in the Physics Department, becoming a reader in\n1964\nand then given a personal chair in\n1969\n. Let us give a few examples of papers he published\n(\nsome as joint publications\n)\n:\nSusceptibility of superconducting spheres\n(1959)\n;\nMeissner-Ochsenfeld effect in the Bogolyubov theory\n(1959)\n;\nGauge invariance in the theory of superconductivity\n(1959)\n;\nSuperconductivity of a charged ideal\n2\n-dimensional Bose gas\n(1959)\n;\nQuantum statistics of ideal gases in two dimensions\n(1964)\n;\nRelaxation of a fast ion in a plasma\n(1964)\n;\nMagnetic properties of charged ideal quantum gases in n dimensions\n(1965)\n;\nExact equation of state for a\n2\n-dimensional plasma\n(1967)\n;\nElectron scattering and tests of cosmological models\n(1968)\n;\nThe rate of the proton-proton reaction and some related reactions\n(1969)\n.\nIn\n[\n1\n]\nMay says:-\nBut I would never have got elected to the\nRoyal Society\nfor what I did in physics. A few years after I returned from Harvard to Sydney, I accidentally got interested in problems in ecology. This was very much encouraged by Harry Messel\n[\nthe head of physics at Sydney\n]\n. He said, 'If you want to do that, by all means stay in the physics department. If you want to go somewhere else, you should do it'.\nMay proved a wonderful theorem on mathematical models for predator-prey problems which was a generalisation of a physics theorem due to\nEugene Wigner\n. He showed his result to Charles Birch, the head of ecology at the University of Sydney, who said, \"You know that I think mathematics doesn't have much to say about ecology, but who knows who's right?\" Although now keen to do more work on mathematical models in ecology, he had already arranged a sabbatical at the Plasma Physics Research Laboratories at Culham, England. He went to Culham for around nine months but spent most of his time there reading up on ecology. He then went, as already planned, to Princeton University in the United States. There he was offered a chair in biology but turned it down saying that he was happy in Australia.\nReturning to Australia he wrote the article\nWill a large complex system be stable?\n, which was published in\nNature\nin\n1972\n. His major monograph\nStability and Complexity in Model Ecosystems\nwas published in\n1973\n. A new edition which was published in\n2001\nstated the following:-\nWhat makes populations stabilise? What makes them fluctuate? Are populations in complex ecosystems more stable than populations in simple ecosystems? In\n1973\n, Robert May addressed these questions in this classic book. May investigated the mathematical roots of population dynamics and argued - counter to most current biological thinking - that complex ecosystems in themselves do not lead to population stability. 'Stability and Complexity in Model Ecosystems' played a key role in introducing nonlinear mathematical models and the study of deterministic chaos into ecology. ... In the quarter century since its first publication, the book's message has grown in power. Nonlinear models are now at the centre of ecological thinking, and current threats to biodiversity have made the questions about the role of ecosystem complexity more crucial than ever.\nAfter a while his wife encouraged him to see if the Princeton appointment was still on offer. He found that it was and in\n1973\nhe became Professor of Biology at Princeton University. He held this position until\n1988\nbut he was also Class of\n1877\nProfessor of Zoology from\n1975\nto\n1988\nand Chairman of the University Research Board from\n1977\nuntil\n1988\n. He said\n[\n1\n]\n:-\nIt was a wonderful place. The ecology group was very small but consistently ranked as one of the top six in ecology in the country, and still is today. But at that time it was one or two orders of magnitude smaller than anywhere else. There were only four faculty members. ... During the\n16\nyears that I was there, it was very small. We had a total of\n48\ngraduate students and they were nearly all rather good.\nHe edited the books\nTheoretical Ecology: Principles and Applications\n(1976)\nand\nPopulation Biology of Infectious Diseases\n(1982)\n. He published highly significant papers such as\nBiological populations with nonoverlapping generations: stable points, stable cycles, and chaos\n(1974)\n,\nSimple mathematical models with very complicated dynamics\n(1976)\n,\nBifurcations and dynamic complexity in simple ecological models\n(1976)\n, and\nThresholds and breakpoints in ecosystems with a multiplicity of stable states\n(1977)\n.\nThe 'Simple mathematical models' paper has been cited an incredible number of times. Here is the Abstract of the paper:-\nFirst-order difference equations arise in many contexts in biological, economic and social sciences. Such equations, even though simple and deterministic, can exhibit a surprising array of dynamical behaviour, from stable points, to bifurcating hierarchy of stable cycles, to apparently random fluctuations. There are consequently many fascinating problems, some concerned with delicate mathematical aspects of the fine structure of the trajectories and some concerned with the practical implications and applications. This is an interpretive review of them.\nThis highly mathematical work leads naturally to the question, \"Does May think of himself as a mathematician?\" Let us record some of his thoughts on this question\n[\n1\n]\n:-\nMathematics is ultimately no more but no less than thinking very clearly about something. I like puzzles, so I am a mathematician. I am not a pure mathematician's mathematician because I don't like abstract, formal problems. I like tricks and devices. I am essentially a mathematician but in the sense that I like thinking about complicated things, asking what are potential simplicities hidden in them and expressing that tentative thought in mathematical terms and seeing where it leads me in testable ways.\nAfter sixteen years at Princeton, despite feeling that this was the best place to be a faculty member, nevertheless he felt that he would like a change. Britain was a possibility for he had held a Visiting Professorship at Imperial College, London, since\n1975\nand had visited the College's Ecological Research Laboratories at Silwood Park every summer for four to six weeks every year. Another possibility was returning to Australia which May and his wife thought hard about as they also did the possibility of a move to Berkeley. In the end they decided that Britain was the most different.\nIn\n1979\nMay had been elected a fellow of the\nRoyal Society of London\nand, in\n1988\nhe accepted the position as\nRoyal Society\nResearch Professor in the Department of Zoology of Oxford University. At the same time he became a fellow of Merton College, Oxford. In addition to his academic appointments, May became a civil servant when he was appointed as Chief Scientific Adviser to the UK Government and head of its Office of Science and Technology between\n1995\nand\n2000\n. He was President of the\nRoyal Society\n,\n2000\n-\n2005\n.\nMay has received many honours. First we list the honours given by the Queen.\nOn\n30\nDecember\n1995\nit was announced that \"The Queen has been graciously pleased to signify her intention of conferring the honour of Knighthood upon Professor Robert McCredie May, F.R.S., Chief Scientific Adviser and lately Royal Society Research Professor, University of Oxford and Imperial College, London. For services to science.\"\nOn\n18\nJuly\n2001\nit was announced that \"The Queen has been pleased by Letters patent under the Great Seal of the Realm dated\n18\nJuly\n2001\nto confer the dignity of a Barony of the United Kingdom for life upon Sir Robert McCredie May, Knight, by the name style and the title of Baron May of Oxford, of Oxford in the County of Oxfordshire.\"\nOn\n8\nNovember\n2002\nit was announced that \"The Queen has been graciously pleased to make the following appointment to the Order of Merit: The Right Honourable Robert McCredie, Baron May of Oxford, AC, FRS.\nLet us now list a selection of further honours that May has received. He was elected a Corresponding Member of the\nAustralian Academy of Science\n(1991)\n, a Foreign Member of the\nUnited States National Academy of Sciences\n(1992)\n, an honorary Fellow of the American Society for Biochemistry\n(1993)\n, a member of the Academia Europaea\n(1994)\n, an honorary Fellow of the British Ecological Society\n(1995)\n, an honorary Fellow of the Australian Academy of Technology Sciences and Engineering,\n(2001)\n, a Fellow of the\nRoyal Society of Edinburgh\n(2006)\n, an honorary Fellow of the Linnean Society of London\n(2008)\n, an honorary Fellow of the Australian Institute of Building\n(2009)\n, and a Fellow of the Royal Society of New South Wales\n(2010)\n. He has received honorary degrees from Uppsala University\n(1990)\n, Yale University\n(1993)\n, the University of Sydney\n(1995)\n, Princeton University\n(1996)\n, the University of Glasgow\n(2001)\n, ETH Zürich\n(2003)\n, Queen's University Belfast\n(2003)\n, the University of Oxford\n(2004)\n, the University of York\n(2004)\n, the University of Sheffield\n(2005)\n, the University of East Anglia\n(2007)\n, and Harvard University\n(2013)\n. The citation for his Harvard degree states:-\nA prodigious polymath and peerless peer whose mind conceives models that sustain life and whose voice resounds in support of enlightened inquiry.\nBy\n2018\nhe had received at least\n28\nhonorary degrees. His awards and prizes include the Weldon Memorial Prize by the University of Oxford\n(1980)\n, the American Ecological Society MacArthur Award\n(1984)\n, the Medal of the Linnean Society of London\n(1991)\n, the Frink Medal of the Zoological Society of London\n(1995)\n, the\nRoyal Swedish Academy\n's Crafoord Prize\n(1996)\n, the Swiss-Italian Balzan Prize\n(1998)\n, the Japanese Blue Planet Prize\n(2001)\n, the\nRoyal Society\n's Copley Medal\n(2007)\n, the Royal Society of Chemistry's Lord Lewis Prize\n(2008)\n, the Charles P Nash Prize\n(2013)\n.\nYou can read his profile given by the Asahi Glass Foundation, Tokyo, Japan, when they awarded him the Blue Planet Prize in\n2001\nat\nTHIS LINK\n.\nHe received the IEEM Medal from the Institute of Ecology and Environmental Management on\n28\nJune\n2012\nfor \"Outstanding Commitment of Biodiversity and the Natural Environment.\"",
  "matematicos_citados_na_biografia": [
    "Wolfgang Pauli",
    "Royal Society",
    "Eugene Wigner",
    "Royal Society of London",
    "Australian Academy of Science",
    "United States National Academy of Sciences",
    "Royal Society of Edinburgh",
    "Royal Swedish Academy",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}