{
  "nome_completo": "Robert Forsyth Scott",
  "nome_curto": "Robert Scott",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scott_Robert/",
  "data_nascimento": "28 July 1849",
  "local_nascimento": "Leith, near Edinburgh, Scotland",
  "data_morte": "18 November 1933",
  "local_morte": "Cambridge, England",
  "summary": "Robert Scott spent most of his career as Bursar and Master of St John's College Cambridge. He published a book on Determinants.",
  "biografia": "Robert Scott\n's father was the Reverend George Scott, who for many years was Minister in the church at Dairsie, a village about\n10\nkm from St Andrews. Robert's mother was Mary Forsyth, son of the Edinburgh advocate Robert Forsyth. He was his parents' eldest son. Robert Scott was educated at the High School, Edinburgh, then in Stuttgart before becoming a student at University College, London. In\n1870\n, while a student at University College, London, he was awarded a Whitworth Exhibition.\nFrom London, Scott entered St John's College, Cambridge where he studied the Mathematical Tripos. He was fourth\nWrangler\nin the Tripos in\n1875\nand, two years later, was elected to a fellowship at St John's College. He was an Assistant Master at Christ's Hospital from\n1877\nto\n1879\nduring which time he wrote his only mathematics book\nThe theory of determinants and their applications\nwhich was published in February\n1880\n. Scott's Preface reads:-\nIn the present treatise I have attempted to give an exposition of the Theory of\nDeterminants\nand their more important applications. In every case where it was possible I have consulted the original works and memoirs on the subject; a list of those I have been able to see is appended as it may be useful to others pursuing the same line of study. At one time I hoped to make this list exhaustive, supplementing my own researches from the literary notices in foreign mathematical journals, but even with this aid I found that it would be necessarily incomplete. In consequence of this the list has been restricted to those memoirs which I have seen, the leading results of which are incorporated either in the body of the text or in the examples.\nThe principal novelty of the treatise lies in the systematic use of\nGrassmann\n's alternate units, by means of which the study of determinants is, I believe, much simplified.\nI have to thank my friend Mr James Barnard, M.A. of St John's College and Mathematical Master at the Proprietary School, Blackheath, for the care he has bestowed on correcting the proofs and for many valuable suggestions.\nScott then studied law, becoming a Barrister in\n1880\n, and a Bencher of Lincoln's Inn in\n1922\n. He was Senior Bursar of St John's College from\n1883\nto\n1908\nwhen he was appointed as Master of St. John's College, Cambridge. Scott held this post for the rest of his life. He was also Vice-Chancellor of the University of Cambridge for the years\n1910\n-\n12\n.\nOn\n1\nJanuary\n1904\na second paperback edition of Scott's book\nThe theory of determinants and their applications\nwas published. The book was revised for this second edition by\nG B Mathews\nand on the title page Scott is described as Robert Forsyth Scott, M.A., of Lincoln's Inn, Fellow of St John's College Cambridge. He also published\nHistory of St John's College\n(1907)\nand wrote many papers on College History. Scott's entry in\nWho's Who\nlists his recreations as: formerly rowing; antiquarian and biographical pursuits. It also list his club as the Athenaeum, and gives his address as The Master's Lodge, St John's College, Cambridge.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Determinants",
    "Grassmann",
    "G B Mathews"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}