{
  "nome_completo": "Robert Haldane",
  "nome_curto": "Robert Haldane",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haldane/",
  "data_nascimento": "27 January 1772",
  "local_nascimento": "Overton, Lecropt, Perthshire, Scotland",
  "data_morte": "9 March 1854",
  "local_morte": "St Andrews, Scotland",
  "summary": "Robert Haldane was a Scottish clergyman who was appointed Regius Professor of Mathematics at St Andrews, even though he did little mathematics.",
  "biografia": "Robert Haldane\n's father, also called Robert Haldane, was a farmer and his mother was Margaret Kinross. Robert, their eldest son, was born in Overton\n(\nor Overtown\n)\nwhich is near the border between Perthshire and Stirlingshire and lies between Stirling and Dunblane. Robert attended school in Dunblane before matriculating at Glasgow University in\n1787\nat the age of fifteen. Although this sounds a very young age compared with when students attend university today, at this time the universities in Scotland competed with the schools to provide an education for the more able pupils.\nAt the University of Glasgow, Haldane took the standard course for at this time all university students basically studied the same subjects. He then went to the University of Edinburgh where he studied divinity. After this he acted as a tutor to the Robinson family of Leddriegreen House, Strathblane, and then to the Moray family of Abercairney, Perthshire. On\n5\nDecember\n1797\nhe was licensed by the presbytery of Auchterarder. He then was appointed minister at Drumelzier in Peeblesshire and was ordained on\n9\nMarch\n1807\n. Thirty months later he resigned this position when appointed as Regius Professor of Mathematics at the University of St Andrews. The chair had fallen vacant on the death of\nNicholas Vilant\non\n25\nMay\n1807\nand had remained vacant until Haldane was appointed.\nWe have not included Haldane in this collection of biographies of mathematicians because of his expertise in mathematics. Sadly around this time appointments to the Regius Chair of Mathematics at St Andrews were not made on the strength of mathematical abilities. Rather the Church dominated appointments to the University, so that it could control the scientific views taught there, and standing in Church politics was a far more important factor than was scientific ability. In fact Haldane was appointed to the Regius Chair in preference to several other candidates who were in a different class to him as a mathematician. The two most mathematically talented of the candidates who were rejected in favour of Haldane were\nWallace\nand\nIvory\n. Despite this Haldane appears to have made a good teacher for Conolly writes\n[\n2\n]\nthat:-\n... it was well known that his mathematical drilling was the most successful ever exhibited in any of our Scottish colleges.\nIn\n1819\nLeslie\n, who had been the professor of mathematics at Edinburgh since\n1805\n, resigned the chair when appointed to the more prestigious post of professor of natural philosophy. Haldane applied for the Edinburgh Chair of Mathematics which was at that time considered the most prestigious mathematics chair in Scotland.\nWallace\nand\nBabbage\nwere also applicants but\nBabbage\nstood little chance since he was an Englishman. In the end it came down to a straight contest between Haldane and\nWallace\n;\nWallace\nwas appointed by\n18\nvotes to\n10\n. Another position opened up, however. When Professor George Hill, principal of St Mary's College in St Andrews\n(\nthe divinity College of the University\n)\n, died it was Haldane who succeeded him as principal of St Mary's College and professor of theology on\n21\nSeptember\n1820\n. Earlier that year, on\n24\nJanuary, he had been elected a Fellow of the\nRoyal Society of Edinburgh\n.\nThe positions of principal of St Mary's College and professor of theology were not well paid and it was the custom that the holder of these positions was also minister at the Holy Trinity Church in South Street, St Andrews. Haldane followed the custom and was appointed to the parish church. As principal of St Mary's College, Haldane came into conflict with Sir David Brewster, principal of the United College of St Salvator and St Leonard\n[\n1\n]\n:-\nBrewster\n[\nconducted a\n]\nvendetta against Haldane,\n[\nwho put up a\n]\nsturdy defence of his administration and financial management of his college.\nHaldane did not publish a single item on mathematics. Indeed he only published one work which was a pamphlet on poverty in St Andrews\n(1841)\n.  As to his character, Conolly writes\n[\n2\n]\nthat he was:-\n... of unceasing charity ..., his heart was entirely in the well-being of his students.\nHaldane never married. He died in St Mary's College and was buried six days later in the cathedral cemetery.",
  "matematicos_citados_na_biografia": [
    "Nicholas Vilant",
    "Wallace",
    "Ivory",
    "Leslie",
    "Babbage",
    "Royal Society of Edinburgh"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}