{
  "nome_completo": "Robert Phelan Langlands",
  "nome_curto": "Robert P Langlands",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Langlands/",
  "data_nascimento": "6 October 1936",
  "local_nascimento": "New Westminster, British Columbia, Canada",
  "data_morte": null,
  "local_morte": null,
  "summary": "Robert P Langlands is a Canadian mathematician who works in representation theory and number theory. He has been awarded all the major mathematical prizes including the Shaw Prize, the Wolf Prize and the Abel Prize.",
  "biografia": "Robert P Langlands\n' father was Robert Langlands and his mother was Kathleen Johanna Phelan. He has two younger sisters, one of whom, Mary Fran Langlands is now Mary McArthur. Although born in New Westminster, a little south of Vancouver, he spent about five years further north in a small hamlet on the coast between Lang Bay and Myrtle Point. His father worked at lumberyards and had moved to the hamlet because of his work. When it was time for Robert to begin elementary school, the family returned to New Westminster where Robert began his schooling at St Ann's Academy. This religious school had been established by the Sisters of Saint Ann in\n1865\nand the teachers were nuns; the school closed in\n1968\n. After three years at this school, during which time he covered the work of four years, he went to St Peter's School to complete his elementary schooling. The move took place since at this time St Ann's became a girls' school and St Peter's became the corresponding boys' school. Robert had enjoyed St Ann's, but was not happy at St Peter's. In\n1946\nthe family moved again, this time to White Rock on the coast, this time south of New Westminster.\nIn White Rock, Robert's family ran the Langlands Millwork and Builders' Supplies and this made them somewhat better off than many in the town. He attended the Semiahmoo High School in South Surrey. This school, founded in\n1940\n, had many teachers who\n[\n13\n]\n:-\n... were just former members of the army in World War II, who were given positions as teachers more as a gratitude for their service in the army.\nLanglands did various jobs to earn money while at school, for example he collected empty beer bottles for which he was paid a small fee per dozen, he had a newspaper round spending\n1\n1\n2\n1\\large\\frac{1}{2}\\normalsize\n1\n2\n1\n​\nhours a day collecting and delivering them six days a week, and he worked at weekends and in the summer vacations at Langlands Millwork and Builders' Supplies. Certainly through much of his time at school, he did not even consider going to a university, but in his final year, the\n12\nth grade, he received much attention from his English literature teacher Crawford Vogler. Vogler told him it \"would be a betrayal of God-given talents for you not to attend university.\" He had also met Charlotte Lorraine Cheverie whose father, Lorenzo Francis Cheverie, gave him a book about famous scientists. The book gave him an interest in science and Charlotte, like Vogler, encouraged him to apply to the University of British Columbia. He said\n[\n2\n]\n:-\nI was flattered by the comments, my ambition was aroused, and I decided then and there to write the entrance examinations. I worked hard and was successful, even winning a small fellowship from the University.\nFor more details of Langlands' family and education, see\nTHIS LINK\n.\nLanglands graduated from Semiahmoo High School in\n1953\nand later that year began his studies at the University of British Columbia. At this stage he did not have any idea which subjects he should study. He discussed this with a university counsellor who had him take aptitude tests. His background in all subjects was relatively poor but, of course, in mathematics someone with ability can do extremely well without great background knowledge. The results of the aptitude tests made the counsellor suggest that he might want to become an accountant, but he did not like this idea. The next suggestion of mathematics or physics was more to Langlands liking so he decided that mathematics would be the topic to specialise in. For his first year courses he took French, English, physics, chemistry and mathematics. Towards the end of his first year he spoke with his mathematics professor, Stephen Arthur Jennings\n(1915\n-\n1979)\nwho told him that to become a mathematician one had to learn French, German and Russian. Langlands, who knew basic French, taught himself German from books over the summer vacation. He took a course in Russian in his second year at university as well as courses in English literature, mathematics, physics and logic.\nThe honours courses Langlands took in his third year were differential calculus, integral calculus, linear algebra and algebra. His lecturers included Robert Christian,\nEugene Leimanis\nand Frederick Goodspeed. Before beginning his fourth year, he married Charlotte Lorraine Cheverie on\n13\nAugust\n1956\n; they have four children, William, Sarah, Robert and Thomasin.\nIn the final year of his undergraduate course, Langlands took a course on\nGalois\ntheory given by\nRimhak Ree\n, a course on convexity given by Douglas Derry, a course on function theory given by Robert Christian and a course on applied mathematics given by Thomas Hull. He also participated in two seminars, one by Harry Davis was on modern functional analysis and the other by David Murdoch on Noetherian rings. Langlands was awarded his B.A. in\n1957\nand continued to study at the University of British Columbia for his master's degree which was awarded in\n1958\n. He applied to study for a Ph.D. at Harvard, Wisconsin and Yale. All three accepted him but only Yale offered financial support so he had no difficulty in deciding to accept Yale.\nLanglands then studied at Yale University for his doctorate. His formal thesis advisor was Cassius Ionescu Tulcea\n(1923\n-\n2021)\n, a Romanian born mathematician who specialised in probability theory, statistics and mathematical analysis. Tulcea, however, did not suggest the topic of his thesis which Langlands found for himself. Although he was at Yale for two years, he completed the work for his thesis in his first year there. During these two years he attended a variety of courses, including: Nelson Dunford on functional analysis;\nEinar Hille\non functional analysis and semigroups; Cassius Ionescu Tulcea on\nLie\nsemi-groups and their representations;\nFelix Browder\non partial differential equations; and Stephen Gaal on analytic number theory.\nHe submitted his thesis\nSemi-groups and representations of Lie groups\nto Yale in\n1960\nand received the degree of Ph.D. Langlands wrote\n[\n57\n]\n:-\nThere are two, related parts to this thesis: one on representations of\nLie\nsemi-groups and one on operators associated to representations of\nLie\ngroups. The first part was published in the 'Canadian Journal of Mathematics', but the second was published only as an announcement in the Proceedings of the\nNational Academy of Sciences\nof the USA. It nevertheless had the good fortune to be taken seriously by Derek Robinson, who incorporated some of the results into his book on Elliptic Operators and Lie Groups.\nAlso writing about his doctoral thesis Langlands regretted that it remains\n[\n57\n]\n:-\n... my only active encounter with partial differential equations, a subject to which I had always hoped to return but in a different vein.\nHe now had to find an academic position. He said in the interview\n[\n2\n]\n:-\nWhat I really hoped to do when I completed my Ph.D. was to stay at Yale. I had fallen in love with the atmosphere there: I had a freedom to study and think that I had never had elsewhere. Several of the faculty encouraged me to stay, but my appointment was blocked, probably by\nKakutani\n. So I accepted the offer from Princeton, where I had the great good fortune to meet\nSalomon Bochner\n, whose encouragement had decisive, concrete consequences. I am not sure that\nBochner\never understood how much he had done for me. I was a timid young man and he was a genuinely timid old man, so that there were some feelings that were never expressed.\nAppointed to Princeton as an instructor after completing his doctoral studies, Langlands taught there for seven years. In\n1961\nhe was promoted to Lecturer then to Assistant Professor - Associate Professor in\n1962\n. At one week's notice, he was asked to give a course on class field theory since\nEmil Artin\n, who had been teaching this course, had left Princeton in\n1958\nto return to Germany. Feeling he did not know enough about class field theory to give the course, he went to\nBochner\nsaying there was no way he could learn enough in a week to give the course\n[\n13\n]\n:-\nBut he insisted so I gave a course on class field theory from\nChevalley\n's paper, which is the more modern view, and I got through it. There were three or four students, who said they learned something from it. So, with that, I began to think about the fact that there was no non-abelian class field theory yet. Some people, like\nArtin\n, didn't expect there to be any. So, I was just aware of it, that's all.\nFrom August\n1962\nto June\n1963\nhe was a member of the School of Mathematics of the Institute for Advanced Study at Princeton. He spent\n1964\n-\n65\nat the University of California, Berkeley as a Miller Foundation Fellow and an Alfred P Sloan Fellow. Then in\n1967\nhe returned to Yale University as a full professor. However Langlands spent\n1967\n-\n68\nvisiting in Ankara, Turkey having an office next to that of\nCahit Arf\n. After five years at Yale he returned again to Princeton in July\n1972\n, this time as professor of mathematics at the Institute for Advanced Study. He remained at the Institute for Advanced Study until he retired in June\n2007\n. He was made Emeritus at the Institute for Advanced Study in July\n2007\n.\nThe first papers that Langlands published from\n1960\nwere:\nOn Lie semi-groups\n(1960)\n;\nSome holomorphic semi-groups\n(1960)\n;\nThe dimension of spaces of automorphic forms\n(1963)\n;\nDimension of spaces of automorphic forms\n(1966)\n;\nThe volume of the fundamental domain for some arithmetical subgroups of Chevalley groups\n(1966)\n; and\nEisenstein series\n(1966)\n.\nIn\n1988\nLanglands received the\nNational Academy of Sciences\nAward in Mathematics. He was the first recipient of this award which was established by the National Academy of Sciences; it was renamed the\nMaryam Mirzakhani\nPrize in Mathematics in\n2012\n. The citation for the award to Langlands recognises his:-\n... extraordinary vision that has brought the theory of group representations into a revolutionary new relationship with the theory of automorphic forms and number theory.\nLet us explain a little about Langlands' work which led to this award. As soon as he had completed his doctoral work, Langlands began to work on automorphic forms. In a remarkable paper he applied recent results by\nHarish-Chandra\nto obtain a formula for the dimension of certain spaces of automorphic forms. Then, over the next couple of years, he produced deep results on\nEisenstein\nseries and went on to apply\nEisenstein\nseries to prove a number theory conjecture due to\nWeil\n.\nIn\n1967\nhe wrote a letter to\nWeil\nwhich contains profound mathematical ideas which continue to drive a whole area of mathematical research. The letter was\n17\npages hand-written and sent in January\n1967\n. It sketched what soon became known as \"the Langlands conjectures\".\nWeil\nhad the letter typed and this typed version circulated widely among mathematicians interested in the topics. Casselman writes in\n[\n44\n]\nthat the letter contained:-\n... a collection of far-reaching and uncannily accurate conjectures relating number theory, automorphic forms, and representation theory. These have formed the core of a program still being carried out, and have come to play a central role in all three subjects.\nOther letters of Langlands also proved remarkably important. While he was in Ankara in\n1967\n-\n68\nhe wrote to\nSerre\nwith ideas which would eventually be formulated as the\nDeligne\n-Langlands conjecture; this was proved eventually by Kazhdan and\nLusztig\n.\nIn\n[\n38\n]\n, Judy Mendaglio attempted to give an idea of the Langlands' Program using elementary ideas:-\nThe \"theory of everything\" in mathematics, the Langlands Program, is a set of conjectures that seek to unify knowledge from different branches of mathematics. The idea is that a problem in one area of mathematics may be very difficult to analyse using the tools available in that area. However, if the structures within the problem can be related to similar structures in a different field, where there are better analytical tools available, then the analysis may be conducted with less difficulty and the results related back to the original problem. In this way, even deeper structures in the original area of mathematics are revealed.\nFor example, consider a somewhat elementary problem such as finding the properties of solids in four or more dimensions. That is a geometry problem. However, since we have difficulty imagining objects in four or more dimensions, we find analysing their properties difficult; however, we can relate their geometric structures to algebraic structures that are well understood. We muck about in the world of algebra, have an insight or two, and then relate those insights back to the geometry problem.\n...\nOf course, the mathematics of the Langlands Program is of a more advanced level than even most mathematicians understand, but, fundamentally, the idea is the same. In the Langlands Program, the branches of mathematics that are being related are those connecting our understanding of numbers and our understanding of change. Think arithmetic meets geometry, and they meet calculus, and then take it up a few dozen notches. The main branches of mathematics that are involved are number theory\n(\nthe study of properties and relationships of numbers\n)\n, algebraic geometry\n(\na cousin of analytic geometry\n)\n, representation theory\n(\nwhich concerns sets and mappings\n)\n, and mathematical physics. Mathematician and author of 'Love and Math', Edward Frenkel, has called Langlands' theories \"the source code of all mathematics.\"\nThe\nNational Academy of Sciences\nAward in Mathematics which we referred to above was certainly not the first award which Langlands received for his work. In\n1975\nhe had been awarded the Wilbur Cross Medal from Yale University. He received the Jeffery-\nWilliams\nPrize from the\nCanadian Mathematical Society\nin\n1980\nfor outstanding contributions to mathematical research, and the\nCole\nPrize in Number Theory from the\nAmerican Mathematical Society\nin\n1982\nfor his pioneering work on automorphic forms,\nEisenstein\nseries and product formulae. He continued to win major awards, for example he shared the\n1995\n-\n96\nWolf Prize in Mathematics with\nAndrew Wiles\n. The Prize was awarded to Langlands for his:-\n... path-blazing work and extraordinary insights in the fields of number theory, automorphic forms, and group representation.\nElected a Fellow of the\nRoyal Society of Canada\nin\n1972\n, he was elected a Fellow of the\nRoyal Society of London\nin\n1981\n, a member of the\nNational Academy of Sciences\nin\n1993\n, a member of the American Philosophical Society in\n2004\n, and a fellow of the\nAmerican Mathematical Society\nin\n2012\n. He has received over thirty honorary doctorates from intitutions including the University of British Columbia, McMaster University, The City University of New York, the University of Waterloo, the University of Paris VII, McGill University, the University of Toronto, and the University of Chicago.\nLanglands was awarded the Grande Médaille d'Or by the\nFrench Academy of Sciences\nin\n2000\n. In\n2005\nhe was awarded the Leroy P Steele Prize for Seminal Contribution to Research by the\nAmerican Mathematical Society\nfor his paper\nProblems in the theory of automorphic forms\n(1970)\n. This is the paper that introduced what are now known as the Langlands conjectures. In\n2006\nhe received the Frederic Esser Nemmers Prize in Mathematics for his\n[\n67\n]\n:-\n... fundamental vision connecting representation theory, automorphic forms and number theory.\nThe citation contains quotes from Kari Vilonen, professor of mathematics at Northwestern University\n[\n67\n]\n:-\nThe Langlands program postulates a deep relationship between two different areas of mathematics, number theory and automorphic forms, via a study of their symmetries. Since its initiation about\n40\nyears ago, the Langlands program has served as a unifying principle in mathematics and has guided research in number theory, automorphic forms and representation theory. Recently, it also had entered mathematical physics. It remains a research program for the future in all these areas.\nRobert Langlands and\nRichard Taylor\njointly received the Shaw Prize in\n2007\n[\n59\n]\n:-\nRobert Langlands initiated a unifying vision of mathematics that has greatly extended the legacy of the mathematics of previous centuries, connecting prime numbers with symmetry. This unification, which grew out of the Reciprocity Theory of\nGauss\nand\nHilbert\n, is now referred to as the Langlands program. It provides a direction of research which has guided mathematicians over the past forty years and will continue to do so for years to come.\nAfter winning the prize, Langlands gave the lecture\nReflections on receiving the Shaw prize\n(\nsee\n[\n31\n]\n)\n. Balasubramanian Sury wrote in a review of this paper\n[\n63\n]\n:-\nThis is the text of a lecture delivered in Hong Kong on the occasion of the author receiving the Shaw Prize. It makes for absolutely fascinating reading. The contents of the masterly exposition are so riveting that it is scarcely possible to put the article down without finishing it. Therefore, instead of giving a detailed description of the contents, the reviewer encourages the interested reader to peruse the text himself by just quoting the following text from the article: \"a number of mathematicians have a perception of the development of the theory of automorphic forms over the last four decades that differs from mine if not in a radical, certainly in an essential way. Some of the differences are a result of misapprehensions that are a natural consequence of the variety of the theory's relations to fields practiced by mathematicians with many different temperaments and training. With a little explanation these misapprehensions can be dissipated. The prize is an opportunity to do so. Others are the result of conflicting methodological stances, mostly unrecognised and certainly unresolved. Their resolution will certainly demand a deeper understanding of the subject than is yet available. In this lecture I attempt to describe the current, unresolved situation. My emphasis will be on my own stance, although my purpose here is not to advocate but to explain it.\" For anyone interested in the historical development of, and the motivating ideas behind, the functoriality conjecture\n(\ns\n)\n, this is a must-read.\nIn\n2015\nLanglands was elected to Honorary Membership of the\nLondon Mathematical Society\nin its\n150\nth Anniversary year. The short citation reads:-\nProfessor Langlands secured his place in history of mathematics as the proposer\n(\nin\n1967)\nand first developer of the eponymous research programme. The deep results and visionary conjectures of the Langlands Programme relate the core themes in number theory and representation theory.\nThe full citation begins\n[\n55\n]\n:-\nRobert Langlands is one of the giants of modern mathematics. By combining great technical power with extraordinary imagination and vision, he has shown how to unify major areas of mathematics that were previously believed to be quite distinct. More precisely, Langlands has transformed the traditional area of automorphic forms, originally a part of the theory of complex variables, into a very different theory whose classical roots are now almost unrecognisable. In Langlands' hands, the theory of automorphic forms has become a grand force for unification, representing what seem to be the fundamental laws of mathematical symmetry. These laws govern the internal structure of many diverse parts of mathematics, most notably from number theory and arithmetic algebraic geometry.\nThe\nAbel\nPrize is recognised as the highest possible award to a mathematician. It was presented to Langlands in\n2018\n[\n51\n]\n:-\n... for his visionary program connecting representation theory to number theory.\nHere is a quote from the Press Release\n[\n50\n]\n:-\nRobert P Langlands has been awarded the\nAbel\nPrize for his work dating back to January\n1967\n. He was then a\n30\n-year-old associate professor at Princeton, working during the Christmas break. He wrote a\n17\n-page letter to the great French mathematician\nAndré Weil\n, aged\n60\n, outlining some of his new mathematical insights.\n\"If you are willing to read it as pure speculation I would appreciate that,\" he wrote. \"If not - I am sure you have a waste basket handy.\"\nFortunately, the letter did not end up in a waste basket. His letter introduced a theory that created a completely new way of thinking about mathematics: it suggested deep links between two areas, number theory and harmonic analysis, which had previously been considered as unrelated.\n...\nLanglands' insights were so radical and so rich that the mechanisms he suggested to bridge these mathematical fields led to a project named the Langlands program. The program has enlisted hundreds of the world's best mathematicians over the last fifty years. No other project in modern mathematics has as wide a scope, has produced so many deep results, and has so many people working on it. Its depth and breadth have grown and the Langlands program is now frequently described as a grand unified theory of mathematics.\nFor the more technical Citation for the\nAbel\nPrize\n2018\n, see\nTHIS LINK\n.\nHe continued to receive honours, for example he was appointed Companion of the Order of Canada in\n2019\nand on\n10\nJanuary\n2020\nSemiahmoo High School installed a mural celebrating his contributions to mathematics.\nSee\nTHIS LINK\n.\nCasselman, in\n[\n44\n]\n, ends with the following summary:-\n[\nLanglands'\n]\nastounding insight has provided a whole generation of mathematicians working in automorphic forms and representation theory with a seemingly unlimited expanse of deep, interesting, and above all approachable problems to work away on.\nIn the interview\n[\n13\n]\nthe final question was whether Langlands had non-mathematical passions or interests of some sort. He replied:-\nPassions? I don't have any passions. But, you know, it is true that you want to take a look at other things, you know. History is fascinating: modern history, ancient history, the Earth's history, the Universe's history - these things are all fascinating. It is a shame to go through life and not have spent some time contemplating on that - certainly not everything of course but just to think about it a little bit.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Eugene Leimanis",
    "Galois",
    "Rimhak Ree",
    "Einar Hille",
    "Lie",
    "Felix Browder",
    "National Academy of Sciences",
    "Kakutani",
    "Salomon Bochner",
    "Bochner",
    "Emil Artin",
    "Chevalley",
    "Artin",
    "Cahit Arf",
    "Maryam Mirzakhani",
    "Harish-Chandra",
    "Eisenstein",
    "Weil",
    "Serre",
    "Deligne",
    "Lusztig",
    "Williams",
    "Canadian Mathematical Society",
    "Cole",
    "American Mathematical Society",
    "Andrew Wiles",
    "Royal Society of Canada",
    "Royal Society of London",
    "French Academy of Sciences",
    "Richard Taylor",
    "Gauss",
    "Hilbert",
    "London Mathematical Society",
    "Abel",
    "André Weil"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}