{
  "nome_completo": "Robert Karl Emanuel Fricke",
  "nome_curto": "Robert Fricke",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fricke/",
  "data_nascimento": "24 September 1861",
  "local_nascimento": "Helmstedt, Germany",
  "data_morte": "18 July 1930",
  "local_morte": "Bad Harzburg, Germany",
  "summary": "Robert Fricke was a German mathematician who worked in complex analysis, especially on elliptic, modular and automorphic functions.",
  "biografia": "Robert Fricke\n's father was a civil servant. Robert was the second of his parent's four children. He was brought up in Brunswick\n(\nnow Braunschweig\n)\nwhere he attended the\nGymnasium\n, graduating in\n1880\n. Mathematics was the topic he enjoyed as high school so he entered university with the intention of becoming a mathematics teacher. It was standard practice at the latter part of the nineteen century\n(\nand at the beginning of the twentieth\n)\nfor students at German universities to move between institutions to gain a broader experience. Fricke carried out this practice more enthusiastically than most, attending the universities in Göttingen, Zürich, Berlin, and Strassburg between\n1880\nand\n1883\n. For the winter semester of\n1883\nhe went to the University of Leipzig\n(\nhis fifth university in three years\n)\nwhere he attended lectures by\nFelix Klein\n. Fricke was immediately attracted to Klein's style of mathematics and undertook research for a doctorate under\nKlein\n's supervision.\nIn\n1885\nFricke took the examinations at Leipzig to qualify him to teach mathematics in German gymnasiums and, in the same year, he submitted his doctoral thesis\nÜber Systeme elliptischer Modulfunktionen von niederer Stufenzahl\nⓉ\n(\nOn systems of elliptic modular functions of lower-level number\n)\n. He then returned to Braunschweig, the city in which he was brought up, taking up an appointment as a mathematics teacher at a Gymnasium there. Over the next six years, Fricke taught at two different gymnasiums in Braunschweig but was also given leave of absence to act as tutor to the sons of Albrecht, the Prince Regent of the Duchy of Braunschweig. The boys he taught were Friedrich Heinrich Albrecht\n(\nborn\n1874)\nand Joachim Albrecht\n(\nborn\n1876)\n.\nIn fact Fricke's appointment as a tutor proved significant for his future career, for it gave him lots of free time to devote to mathematics. He had kept in touch with\nKlein\n, who had moved to a chair in Göttingen in\n1886\n, and they began a collaboration writing the treatise\nVorlesungen über die Theorie der elliptischen Modulfunctionen\nⓉ\n(\nLectures on the theory of elliptic modular functions\n)\n. The first volume of this two-volume work appeared in\n1890\npublished by B G Teubner of Leipzig. The second volume was published in\n1892\n. A study of the theory of elliptic modular functions began with\nEisenstein\n's memoir of\n1847\n, and was further developed in the lectures given by\nWeierstrass\non\nelliptic functions\n.\nKlein\n's school had made major advances in the theory to which\nSchläfli\n(1870)\n,\nKlein\nhimself,\nvon Dyck\n, Fricke and\nHurwitz\nall contributed.\nKlein\nand Fricke set out this theory in their two-volume text which became a classic.\nBetween the publication of the two volumes, in\n1891\n, Fricke decided to give up his teaching career and seek an academic post. He\nhabilitated\nat the University of Kiel, becoming a\nPrivatdozent\nthere in\n1891\n. After a year in Kiel, Fricke decided that in order to further his research career he needed to be nearer to\nKlein\nso he moved to Göttingen becoming a Privatdozent there in\n1892\n. In\n1894\nhe was appointed to a chair at the Brunswick Polytechnikum in Braunschweig. In fact he succeeded to the chair which had been held for the previous\n32\nyears by\nRichard Dedekind\nwho had retired on\n1\nApril\n1894\n. Many years later, Fricke, along with\nEmmy Noether\nand\nØystein Ore\n, were joint editors of the\nCollected Works of Richard Dedekind\nwhich were published in three volumes in\n1930\n-\n32\n. Returning to the year\n1894\n, we note that in that year Fricke married Eleonora Flender, a niece of\nFelix Klein\n.\nLet us look at the titles of some of Fricke's papers:\nArithmetische Entwicklungen zur Theorie der linearen Differentialgleichungen zweiter Ordnung\nⓉ\n(\nArithmetic developments in the theory of linear differential equations of second order\n)\n(1891)\n;\nÜber die Moduln der algebraischen Gebilde\nⓉ\n(\nOn the moduli of algebraic structures\n)\n(1892)\n;\nDie Discontinuitätsbereiche der Gruppen reeller linearer Substitutionen einer complexen Veränderlichen\nⓉ\n(\nThe Discontinuity areas of groups of real linear substitutions of a complex variable\n)\n(1894)\n;\nÜber eine einfache Gruppe von\n360\nOperationen\nⓉ\n(\nOn a simple group of\n360\noperations\n)\n(1896)\n;\nÜber die Beziehungen zwischen der Zahlentheorie und der Theorie der automorphen Functionen\nⓉ\n(\nOn the relationship between number theory and the theory of automorphic functions\n)\n(1897)\n;\nÜber eine einfache Gruppe von\n504\nOperationen\nⓉ\n(\nOn a simple group of\n504\noperations\n)\n(1898)\n; and\nZur Theorie der Poincaréschen Reihen\nⓉ\n(\nOn the theory of Poincare series\n)\n(1900)\n. The authors of\n[\n2\n]\nwrite:-\nFricke was highly respected both as a mathematician and personally, working closely with\nKlein\nto develop much of the theory of what are now called Kleinian groups .... He played a leading role in the University administration, being Rektor from\n1904\n-\n6\nand again from\n1921\n-\n3\n. His activity extended to state educational affairs where his experience as a school teacher was valued and he held several official posts. These many duties account for the long delay between the appearance of the first and second volumes\n(\nin\n1897\nand\n1912\nrespectively\n)\nof the second opus 'Vorlesungenuber die Theorie der automorphen Funktionen'\nⓉ\n(\nLectures on the theory of automorphic functions\n)\n, of which Fricke was really the author, although with much input from\nKlein\n. In the final volume, Fricke took the opportunity to use new developments like\nCantor\n's set theory and\nBrouwer\n's theory of dimension to solve a number of problems which had been unresolved in the past.\nLet us look a little more closely at some of the books which Fricke published.\nKurzgefasste Vorlesungen über verschiedene Gebiete der höheren Mathematik, mit Berüchsichtigung der Anwendungen\nⓉ\n(\nConcise lectures on various areas of higher mathematics, with applications\n)\nwas published in\n1900\nand was reviewed by\nHenry White\n[\n10\n]\nin the following year:-\nTwo objects are sought in Dr Fricke's timely book: first, to supply a defect in German mathematical literature, a handbook for students who have mastered the elements of analysis and are not yet qualified to read profitably the highly specialized treatises; second, to smooth the way for technical students who discover a taste for the more abstract branches of mathematics. The present volume is confined to analysis and theory of functions, a second is announced as in preparation, to treat of advanced portions of algebra and geometry. ... Most teachers to whom the purpose indicated by Dr Fricke appeals as eminently desirable will find this book full of helpful suggestions, and will moreover find their own interest in the successive topics vigorously stimulated by the occasional reading of a chapter. The second volume will be awaited with not a little of curiosity.\nIn\n1915\nFricke published the first volume of\nDie elliptischen funktionen und ihre anwendungen\n.\nⓉ\n(\nThe elliptic functions and their applications.\n)\nHe writes in the Introduction:-\nThat I should adhere in the main to the methods of presentation, the use of the invariant theory, geometric representation, and so forth, which more than thirty years of close scientific companionship with my teacher and friend\nF Klein\nhave made my own, I may regard as self-evident.\nL Wayland Dowling\nreviews this text in\n[\n9\n]\n:-\nThe present volume is the first of a series of three which Dr Fricke proposes to write on the elliptic functions and their applications. It appeared in October,\n1915\n, and is devoted to the function theoretic and analytic bases of the theory of elliptic functions. One would naturally expect that a treatise on elliptic functions from the pen of Dr Fricke would follow the lines of thought developed by\nKlein\nand his students thirty-odd years ago. Consequently, on turning the pages of the present volume, one is not surprised to be reminded again and again of modes of thought, of formulas, and of geometric diagrams made familiar through the\nKlein\n-Fricke Modulfunktionen.\nThe second volume of this work was published in\n1922\nbut the third volume, although planned by Fricke from the beginning of the project, was never published.\nHeinrich Weber\nhad published his three-volume\nLehrbuch der Algebra\nⓉ\n(\nA Textbook of Algebra\n)\nin\n1895\n.\nWeber\ndied in\n1913\nand, after the last edition of his famous work went out of print, the publisher, F Vieweg & Sohn, invited Fricke to write a treatise on algebra to replace that of\nWeber\n. The first volume of Fricke's\nLehrbuch der Algebra\n, subtitled\nVerfasst mit Benutzung von Heinrich Webers gleichnamigem Buche\nⓉ\n(\nTextbook of algebra written using Heinrich Weber's  book of the same name\n)\n, was published in\n1924\n.\nL E Dickson\n, in the review\n[\n6\n]\n, writes:-\nProfessor Fricke is an experienced writer of unusual clearness. In addition to his recent book on elliptic functions, he was joint author with\nKlein\nof extended treatises on elliptic modular functions and automorphic functions. These earlier books show that the author has long been familiar with the field covered by the new algebra. The latter will be somewhat simpler to read than\nWeber\n's \"Algebra\".\nThe second volume, subtitled\nAusführungen über Gleichungen niederen Grades\nⓉ\n(\nRemarks on  lower rank equations\n)\n, was published in\n1926\nand was also reviewed by\nL E Dickson\n[\n5\n]\n:-\nFricke's \"Algebra\" is a worthy successor to\nWeber\n's \"Algebra\", which it henceforth displaces. The present volume is a very attractive exposition of the modern theory of equations of degrees\n5\n,\n6\n,\n7\n. The approach is quite different from that by\nWeber\nand more attractive since extensive use is made of the geometric and function-theoretic methods developed by\nKlein\nin his 'Ikosaeder' and books on elliptic modular functions. Fricke's long experience with the latter subject made it easy for him to give a simple authoritative exposition of those portions of it which suffice for the transcendental solutions of equations of low degrees.\nThe third volume subtitled\nAIgebraische Zahlen\nwas published in\n1928\n.\nWe mentioned above that Fricke was one of the editor's of\nDedekind\n's\nComplete Works\npublished in\n1930\n. In fact this was not the first Complete Works he had edited, for he had been one of the editors of\nFelix Klein\n's\nComplete Works\npublished in\n1921\n-\n23\n.\nThe authors of\n[\n3\n]\ngive the following view of Fricke's contributions:-\nRobert Fricke ... who was held in high esteem by his contemporaries, was for the most part considered no more than a faithful disciple of his academic teacher,\nFelix Klein\n. Thus Fricke's achievements were not only mostly overshadowed by the reputation of\nKlein\n, but large parts of his work were regarded as old-fashioned even by the end of his life.\nLet us give one example of why Fricke's approach could be considered old-fashioned\n(\nsee\n[\n1\n]\nfor further details\n)\n. In his book\nLehrbuch der Algebra\nFricke, of course, studies fields. However, even though\nHeinrich Weber\nhad given an abstract definition of a field as early as\n1893\n, Fricke chose not to do so in his book, looking only at number fields.\nEmmy Noether\npointed out to Fricke that one could define a field in an abstract way as a set with two operations defined on it satisfying certain laws. Fricke said he knew of such a definition but did not consider that it had produced significant changes regarding the relevance attached to the concept of a field. He simply chose to acknowledge\nEmmy Noether\n's point by putting a footnote to his definition of a field in the first volume of\nLehrbuch der Algebra\nⓉ\n(\nTextbook of Algebra\n)\n:-\nE Steinitz\napproached the problem in detail in the years\n1908\n-\n1910\nin his work \"Algebraic theory of fields\"\n(1910)\nand showed that it involves a fruitful extension of the original concept of a field of numbers.\nFricke made many important contributions to mathematics in addition to his research papers and books. For many years he was involved with the\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\n. For example at the meeting in Cassel in September\n1903\n, chaired by\nFelix Klein\n, Fricke presented the paper\nOn new methods and new text-books in England\n. In this talk he \"outlined what Professor Perry is endeavoring to do in England and compared the Perry movement in England with a parallel movement in the German universities. He also exhibited copies of English text-books of elementary mathematics.\" In\n1920\nFricke was President of the\nDeutsche Mathematiker-Vereinigung\n.\nFricke continued to hold the chair in Braunschweig until his death.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Felix Klein",
    "Klein",
    "Eisenstein",
    "Weierstrass",
    "elliptic functions",
    "Schläfli",
    "von Dyck",
    "Hurwitz",
    "habilitated",
    "Privatdozent",
    "Richard Dedekind",
    "Emmy Noether",
    "Øystein Ore",
    "Cantor",
    "Brouwer",
    "Henry White",
    "F Klein",
    "L Wayland Dowling",
    "Heinrich Weber",
    "Weber",
    "L E Dickson",
    "Dedekind",
    "E Steinitz",
    "German Mathematical Society",
    "Deutsche Mathematiker-Vereinigung"
  ],
  "imagens": []
}