{
  "nome_completo": "Samuel Molyneux",
  "nome_curto": "Samuel Molyneux",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Molyneux_Samuel/",
  "data_nascimento": "18 July 1689",
  "local_nascimento": "Chester, Cheshire, England",
  "data_morte": "13 April 1728",
  "local_morte": "Kew, Surrey, England",
  "summary": "Samuel Molyneux was an English astronomer who produced some new telescope designs.",
  "biografia": "Samuel Molyneux\n's father was\nWilliam Molyneux\n, a notable Irish astronomer and politician, and his mother was Lucy Domville, the youngest daughter of Sir William Domville, the attorney-general for Ireland. William and Lucy had married on\n19\nSeptember\n1678\nbut Lucy had been struck down by an illness two months after the marriage and she became blind living in pain for the rest of her life. Samuel was born in Chester in England since his parents had left Dublin in January\n1689\nanticipating the political problems which arose in Ireland after the Roman Catholic James II, King of the United Kingdom, was deposed. The Molyneux family were Protestants and they remained in Chester until James, who had led an army in Ireland, was defeated at the Battle of the Boyne in\n1690\n. Samuel never knew his mother for, after she returned to Dublin with him in January\n1691\n, she only lived until May of that year.\nSamuel's father,\nWilliam Molyneux\n, began to correspond with the English philosopher John Locke beginning in\n1692\n. Locke had written\nSome thought concerning education\n(1693)\nwhich was based on a series of letters he had written to Edward Clarke from Holland\n(\nwhere he had been in exile\n)\nadvising him on how to bring up his son. This, of course, was now a topic of great interest to\nWilliam Molyneux\nand he enthusiastically followed Locke's ideas in bringing up Samuel. However, William died in\n1698\nwhen Samuel was only nine years old, and from that time on he was brought up by his uncle Thomas Molyneux. When he was sixteen years old, Samuel Molyneux matriculated at Trinity College, Dublin and there he became friendly with\nGeorge Berkeley\nwho was four years his elder.\nBerkeley\nclearly had great respect for Molyneux, both as a man and as a scientist, and dedicated\nMiscellanea mathematica\n(1707)\nto his friend who was still an undergraduate at this time. He graduated with a B.A. in\n1708\nand, two years later, received his M.A. from Trinity College.\nOn the death of his father, Molyneux had inherited an estate at Castle Dillon in County Armagh in Ireland which brought in a good income and, after leaving Trinity College, he spent two years making improvements to the estate. In\n1712\nhe visited England and in that year was elected to the\nRoyal Society of London\n. He continued his travels going next to Antwerp where he spent the winter of\n1712\n-\n13\n. There he met the Duke and Duchess of Marlborough who asked him to undertake a diplomatic mission to the court of Hanover. He carried out this mission and was at the court of Hanover when the Electress Sophia died on\n8\nJune\n1714\nmaking her son Georg Ludwig, elector of Hanover, heir to the throne of the United Kingdom. Queen Anne died on\n1\nAugust\n1714\nand Georg Ludwig became King George I of the United Kingdom. Molyneux accompanied the new king and his family back to London where he was made secretary to George's son, the Prince of Wales. This was a position which Molyneux retained until the Prince became King George II, on the death of George I, on\n11\nJune\n1727\n.\nThe position of secretary to the Prince of Wales was only one of Molyneux's many roles. He was elected to the London Parliament, representing Bossiney and St Mawes, in\n1715\nthen, in\n1717\n, he married Lady Elizabeth Diana Capel, the eldest daughter of the Earl of Essex; they had no children. Before this Molyneux had a comfortable financial position, but now he was wealthy. He had always had an interest in science following in the footsteps of his father and uncle. Now he became active in astronomy and optics, particularly after he got to know\nJames Bradley\n.\nBradley\nwas, like Molyneux, a fellow of the\nRoyal Society\nand, after being appointed to the Savilian chair of astronomy at Oxford in\n1721\n, moved from being an amateur astronomer to a professional one. Also in\n1721\n, on the death of Lady Capel of Tewkesbury, a relation of Molyneux's wife, the Molyneuxs inherited Kew House. Molyneux and\nBradley\ncollaborated in innovative designs for reflecting telescopes from\n1723\nto\n1725\nand Molyneux set up an observatory at his home in Kew House. The main aim, as far as Molyneux was concerned, was to produce a design of telescope which could be made relatively cheaply and so allow a far wider range of people to become astronomical observers. He was not particularly successful in this aim for the telescopes they designed still were quite expensive to manufacture. After this the two scientists set about trying to measure the parallax of a star, the one final step which was required to prove that the earth orbited the sun and was also a necessary step in deducing a scale for the universe.\nHooke\nhad claimed to have measured the parallax of the star Gamma Draconis and their aim was to verify\nHooke\n's result. Abrahams writes\n[\n3\n]\n:-\nThey purchased a George Graham zenith sector, strongly built of soldered tin plate, with a radius of twenty-four feet, an arc of\n25\narc minutes, and a vernier scale that showed arc seconds. It was mounted in November\n1725\nat Molyneux's home on Kew Green, by boring holes through the ceiling and roof. A zenith sector swivels at the objective end, and an iron frame was attached to the chimney to mount the objective and suspend the tube. The eyepiece was\n3\n1\n2\n3\\large\\frac{1}{2}\\normalsize\n3\n2\n1\n​\nfeet above the floor. The position of Gamma Draconis was observed over four nights between December\n3\nand\n12\n, without any measurable change in position.\nIn fact they showed that\nHooke\nwas wrong and, having failed to measure the parallax of Gamma Draconis, they at least had shown that\nHooke\n's value for the parallax was incorrect. In fact it would be more than\n100\nyears later before\nWilhelm Bessel\nmade the first successful measurement of the parallax of a star.\nBradley\nwent on to use the method developed by him and Molyneux to discover the aberration of starlight which he announced in\n1728\n. By this time, however, Molyneux had ceased to work with him for he was on the Privy Council having been appointed as one of the lords of the Admiralty on\n29\nJuly\n1727\n. Molyneux had been returned as a member of the London parliament in\n1726\nand again in\n1727\n, and also to the Irish parliament in\n1727\nas representing the University of Dublin. Sadly, Molyneux had inherited the disease which had killed his mother and he was struck down by a fit while in the House of Commons in April\n1728\n. He died a few days later. Robert Smith had been given access to Molyneux's papers and instruments a short time before Molyneux died and he took over the publication of a partially written book by Molyneux on optics. This was published as\nA Compleat System of Opticks\n(1738)\n, and had chapters written by Molyneux on the grinding and polishing of telescope lenses and mirrors. In these chapters he explained the theories of\nHuygens\nwho had visited the\nRoyal Society\nin\n1685\n, Molyneux being his host on this occasion.\nHuygens\nhad kept in contact with Molyneux and had sent him his experimental results on lens before his death in\n1695\n. Another chapter which was essentially due to Molyneux was entitled\nSir Isaac Newton's Reflecting Telescope Made and Described by the Honourable Samuel Molyneux Esquire, and Presented by Him to His Majesty John V King of Portugal: with Other Kinds of Mechanisms for This and for Mr Gregory's Reflecting Telescope\n.\nOn his death Molyneux had around\n700\ninstruments, mostly for astronomical use. Some of these had been inherited from his father\nWilliam Molyneux\n.",
  "matematicos_citados_na_biografia": [
    "William Molyneux",
    "George Berkeley",
    "Berkeley",
    "Royal Society of London",
    "James Bradley",
    "Bradley",
    "Royal Society",
    "Hooke",
    "Wilhelm Bessel",
    "Huygens"
  ],
  "imagens": []
}