{
  "nome_completo": "Sergei Natanovich Bernstein",
  "nome_curto": "Sergei Bernstein",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernstein_Sergi/",
  "data_nascimento": "5 March 1880",
  "local_nascimento": "Odessa, Ukraine",
  "data_morte": "26 October 1968",
  "local_morte": "Moscow, USSR",
  "summary": "Sergei Bernstein was a Ukranian mathematician who made important contributions to partial differential equations, differential geometry, probability theory and approximation theory.",
  "biografia": "Sergei Bernstein\n's name is often transliterated as Bernshtein and, just occasionally, as Bernshteyn. His father was Natan Osipovich Bernstein\n(1836\n-\n1891)\n, a medical doctor and also an extraordinary professor at the University of Odessa. The family was Jewish, and Natan Bernstein had been an editor of the Odessa magazine\nZion: Organ of Russian Jews\nwhich had only been published for a year around\n1861\nbefore being closed down. It is worth noting that the magazine championed emancipation and assimilation of Jews into Russian society. Natan Osipovich held important positions in Odessa being an alderman of the City Council, the Director of the Talmud Torah, the Director of the city hospital, and an honorary justice of the peace. Sergei was brought up in Odessa but his father died on\n4\nFebruary\n1891\njust before he was eleven years old. He graduated from high school in\n1898\n. After this, following his mother's wishes, he went with his elder sister to Paris. Bernstein's sister studied biology in Paris and did not return to Ukraine but worked at the Pasteur Institute. After one year studying mathematics at the Sorbonne, Bernstein decided that he would rather become an engineer and entered the École d'Electrotechnique Supérieure. However, he continued to be interested in mathematics and spent three terms at Göttingen, beginning in the autumn of\n1902\n, where his studies were supervised by\nDavid Hilbert\n.\nBernstein returned to Paris and submitted his doctoral dissertation\nSur la nature analytique des solutions des équations aux dérivées partielles du second ordre\nⓉ\n(\nOn the analytical solutions of partial differential equations of second order\n)\nto the Sorbonne in the spring of\n1904\n. Since he could write French considerably better than German, submitting his thesis in France made sense. The thesis begins with the bold words:-\nToday all mathematicians and physicists agree that the field of applications for mathematics knows no limits except those of knowledge itself.\nÉmile Picard\n,\nHenri Poincaré\nand\nJacques Hadamard\nexamined this brilliant piece of work and\nPicard\n, as chairman of the examiners, wrote the report. The thesis was a fine piece of work solving\nHilbert\n's Nineteenth Problem. This problem, posed by\nHilbert\nat the International Congress of Mathematicians in Paris in\n1900\n, was on analytic solutions of elliptic\ndifferential equations\nand asked for a proof that all solutions of regular analytical variational problems are analytic. Bernstein received his doctorate from the Sorbonne in\n1904\nand left Paris to attend the International Congress of Mathematicians in Heidelberg later that year. The Congress lasted\n8\nAugust to\n13\nAugust\n1904\nbut Bernstein remained at Heidelberg until the spring of\n1905\nwhen he went to St Petersburg. His thesis was published in\n1904\nand in the following year the papers\nSur l'interpolation\nⓉ\n(\nOn interpolation\n)\nand\nSur la déformation des surfaces\nⓉ\n(\nOn the deformation of surfaces\n)\nwere published.\nDespite this excellent work, and the fact that he had already received his doctorate, when Bernstein returned to Russia in\n1905\nhe had to start his doctoral programme again since Russia did not recognise foreign qualifications for university posts. In\n1906\nhe passed his Master's examination at St Petersburg but only with difficulty since\nAleksandr Nikolayevich Korkin\n, who examined him on differential equations, expected him to use classical methods of solution\n(\nsome sources say that Bernstein only passed the examination at the second attempt\n)\n. He could not find employment in a university and had to settle for teaching at the recently founded Women's Polytechnic College. He taught there for the year\n1907\nbut, although he was very interested in teaching, he felt he deserved a post in a university where both teaching and research were valued.\nSome of Bernstein's opinions on teaching are at\nTHIS LINK\nHe moved to Kharkov in\n1908\nwhere he submitted a thesis\nInvestigation and Solution of Elliptic Partial Differential Equations of Second Degree\nfor yet another Master's degree. As well as describing his approach to solving\nHilbert\n's\n19\nth\nProblem, it also solved\nHilbert\n's\n20\nth\nProblem on the analytic solution of\nDirichlet\n's problem for a wide class of non-linear elliptic equations.\nDmitrii Matveevich Sintsov\nand Antoni-Bonifatsi Pavlovich Psheborski examined his thesis and from that time Bernstein was able to lecture at Kharkov University as a\ndozent\n.\nHowever, life was not what Bernstein hoped for, and he wrote to\nHilbert\nsaying that his situation was \"hopeless\". Whether\nHilbert\nsought to help is unclear, but Bernstein received an offer of a position at Harvard University from\nWilliam Osgood\n. In the spring of\n1910\nBernstein went to Göttingen to talk to\nDunham Jackson\nwho was visiting Göttingen from Harvard. It is unclear what happened but Bernstein gave up the chance of going to Harvard and, after his Göttingen visit, returned to Kharkov. In\n1913\nhe received his second doctorate, this time from Kharkov University for his thesis\nAbout the Best Approximation of Continuous Functions by Polynomials of Given Degree\n. The thesis had been completed a year earlier and the results of the thesis had earned Bernstein a prize from the\nBelgium Academy of Science\nin\n1911\n. This had come about in the following way.\nCharles-Jean de La Vallée Poussin\nhad asked in\n1908\n: is it possible to approximate the ordinate of a polygonal line by means of a polynomial of degree\nn\nn\nn\nwith error less than\n1\nn\n\\Large\\frac{1}{n}\\normalsize\nn\n1\n​\n? Both\nde La Vallée Poussin\nand Bernstein made some progress in the following years and then the\nBelgium Academy of Science\noffered a prize for a solution. Bernstein gave a complete solution in\n1911\n, introducing what are now called the Bernstein polynomials and giving a constructive proof of\nWeierstrass\n's theorem\n(1885)\nthat a continuous function on a finite subinterval of the real line can be uniformly approximated as closely as we wish by a polynomial. He sent his proof to the\nBelgium Academy of Science\nand was awarded the prize. He wrote:-\nThe example of the problem of the best approximation of the function\n∣\nx\n∣\n|x|\n∣\nx\n∣\n, posed by\nde la Vallée-Poussin\nreaffirms, once again, the fact that a well-posed specific question leads to theories of a much more general significance.\nHe defended his doctoral thesis on\n19\nMay\n1913\nbefore a committee chaired by Psheborski. Here is an extract from the speech he made at the defence of the thesis\n[\n7\n]\n:-\nMathematicians for a long time have confined themselves to the finite or algebraic integration of differential equations, but after the solution of many interesting problems the equations that can be solved by these methods have to all intents and purposes been exhausted, and one must either give up all further progress or abandon the formal point of view and start on a new analytic path. The analytic trend in the theory of differential equations has only recently become established; and only seven years ago the late Professor\nKorkin\nin a conversation with me spoke scornfully of the \"decadence\" of\nPoincaré\n's work.\nHe taught at Kharkov University for\n25\nyears beginning in\n1907\n. He also gave lectures at the Women's College until\n1918\n(\nwhen women were admitted to universities\n)\nand, from\n1912\nto\n1918\n, he also lectured at Kharkov Commercial University. He was made an ordinary professor at Kharkov University in\n1920\n. Around this time he regularly went from Kharkov to Ekaterinoslav to lecture at the 'new' Polytechnic Institute there. In\n1924\nhe was elected as a corresponding member of the\nRussian Academy of Sciences\nand, in the following year, became an ordinary member of the\nUkrainian Academy of Sciences\n. In\n1927\nGösta Mittag-Leffler\ndied and Bernstein was elected as a corresponding member of the\nAcadémie des Sciences\nin Paris to replace him. He became Director of the Kharkov Mathematical institute in\n1928\n. The\nRussian Academy of Sciences\nhad been renamed the\nUSSR Academy of Sciences\nin\n1925\nand, in\n1929\n, Bernstein - already a corresponding member since\n1924\n- was elected a full member. Beginning in\n1930\nthe government made academic teaching and research into a political issue and Bernstein made his opposition known in a published response. Almost immediately he was removed as Director of the Kharkov Mathematical institute but, although he was strongly attacked for his views, he continued to hold his chair until\n1932\n. Beginning in\n1933\nmany lecturers and students at Kharkov were arrested and some were shot but, fortunately for Bernstein, he had left just prior to these events.\nIn\n1932\nBernstein left Kharkov to become head of the Department of\nProbability Theory\nand Mathematical Statistics of the Mathematical Institute of the\nUSSR Academy of Sciences\nin Leningrad. He also lectured at Leningrad University from\n1934\n. At the beginning of\n1939\nhe took up a lecturing post at Moscow University but continued to live in Leningrad. He lost his position as Head of the Mathematical Institute in Leningrad but, in\n1940\n, became an honorary member of the\nMoscow Mathematical Society\n. However in June\n1941\nHitler attacked Russia with the German armies moving rapidly towards Leningrad. Bernstein left Leningrad and went to the town of Borovoe between Astana and Kokshetau in the north of Kazakhstan. His son, German Sergeevich, did not leave the family home in Leningrad and was trapped by the siege of the city which began in September\n1941\n. German Sergeevich died in an attempt to flee from the besieged city and, following the death of his son, Bernstein decided that he would give up the family home in Leningrad and move his residence to Moscow. Bernstein began teaching at the University of Moscow and over the next seven years he worked on editing\nPafnuty Chebyshev\n's complete works. However, in\n1947\nhe was dismissed from the University and became Head of the Department of Constructive Function Theory at the Steklov Institute. He retired in\n1957\n.\nAt the International Congress of Mathematicians at Cambridge in\n1912\n, Bernstein talked about his work on constructive function theory, which today is called approximation theory. He also talked about 'constructive function theory' in a lecture to the Academy in\n1945\n:-\nAs constructive function theory we want to call the direction of function theory which follows the aim to give the simplest and most pleasant basis for the quantitative investigation and calculation both of empirical and of all other functions occurring as solutions of naturally posed problems of mathematical analysis\n(\nfor instance, as solutions of differential or functional equations\n)\n. In its spirit this direction is very near to the mathematical work of\nChebyshev\n; therefore no wonder that modern constructive function theory uses and develops the ideas of our deceased famous member.\nBernstein continued to develop these ideas, solving problems in interpolation theory, giving methods of mechanical integration and, in\n1914\n, introduced a new class of quasi-analytic functions. Heinrich Begehr writes:-\nSome of his main contributions are about the best approximation of continuous functions by polynomials of prescribed degrees, an example of a continuous function the trigonometric interpolation sequence of which is divergent, an estimation of a certain weighted maximum of the derivative of a polynomial on the segment\n[\n-\n1\n,\n1]\nby the one of the polynomial itself, the Bernstein polynomials which turn out not to be interpolation polynomials for the approximated continuous function itself but for a certain smoothed-out function. His later research in this area is devoted to weight functions in connection with the approximation through entire transcendental functions of exponential type.\nSome of Bernstein's most important work was in the theory of probability and he wrote an important text\nProbability theory\n(1911)\n(4\nth\nedition\n1946)\neven before the award of his Russian doctorate. He attempted an axiomatisation of probability theory in\n1917\nand in\n1922\n-\n4\ngave lectures on probability theory at the Sorbonne. This course of lectures was written up as the book\nLeçons sur les propriétés extrémale et la meilleure approximation des fonctions analytique d'une variable réele\nⓉ\n(\nLessons on extremal properties and the best approximation of analytic functions of one real variable\n)\n(1926)\n. For this brilliant book, Bernstein was awarded a prize by the\nAcadémie des Sciences\nin Paris. During the two years\n1922\n-\n24\n, as well as visiting Paris, he visited Germany. As to his many other contributions to probability theory, he generalised\nLyapunov\n's conditions for the central limit theorem, studied generalisations of the law of large numbers, and worked on Markov processes and stochastic processes.\nYuri Linnik\ngives the following summary of Bernstein's contributions to probability in\n[\n18\n]\n:-\nThe theory of probability is indebted to S N Bernstein for fundamental contributions on a number of topics; the axiomatic theory of probability, the foundations of normal correlation using limit theorems and the development of the general theory of correlation, the extension of the central limit theorem to sums of stochastically dependent variables, especially to heterogeneous Markov chains, and stochastic differential equations; the application of the theory of probability to biology and economics and applications of the methods of the theory of probability to the constructive theory of functions.\nN D Kazarinoff writes about\nLinnik\n's overview of of probability theory\n[\n17\n]\n:-\n[\nLinnik\n]\nnotes that Bernstein's paper \"An attempt at axiomatizing the foundations of the theory of probability\"\n(1917)\nis perhaps the first paper directly on this subject. The approach is from the point of view of algebraic structure.\nBernstein also studied applications of probability, in particular to genetics. An important paper he wrote on this topic is\nMathematical problems in modern biology\n(1922)\nwhich contains what became known as the Bernstein problem. He proved a special case of his own problem in\nSolution of a mathematical problem related to the theory of inheritance\n(1924)\n.\nBernstein's\nCollected Works\nappeared as a four-volume work between\n1952\nand\n1964\n. The volumes were edited by Bernstein himself\n[\n25\n]\n:-\nFrom\n1950\nall Bernshtein's scientific activities have been bound up with the preparation of his works for publication. It is difficult even to imagine how much intricate work he has done in editing and annotating his papers. Many of the annotations differ considerably from the usual kind of footnote; they contain a series of valuable ideas and observations and are to be regarded as new scientific work.\nWe have mentioned above a number of honours awarded to Berstein but we now list a few others. He was awarded an honorary doctorate by Algiers University in\n1944\n, and one by the Sorbonne in the following year. He was elected a full member of the\nAcadémie des Sciences\nin Paris in\n1955\n. In\n1942\nhe was given a 'State Award: First Class' and in the same year received the Stalin Prize for his three papers:\nOn the sums of dependent variables with almost zero correlation\n;\nOn the approximation of continuous functions by the linear differential operator from a polynomial\n; and\nOn Fisher's provable probabilities\n. In addition he received two Orders of Lenin and an Order of the Red Banner of Labour. As a final thought, one has to ponder the way that Bernstein was both honoured by the government and also badly treated by the government because he did not fall into line with the official political line.",
  "matematicos_citados_na_biografia": [
    "David Hilbert",
    "Émile Picard",
    "Henri Poincaré",
    "Jacques Hadamard",
    "Picard",
    "Hilbert",
    "differential equations",
    "Aleksandr Nikolayevich Korkin",
    "THIS LINK",
    "Dirichlet",
    "Dmitrii Matveevich Sintsov",
    "dozent",
    "William Osgood",
    "Dunham Jackson",
    "Belgium Academy of Science",
    "Charles-Jean de La Vallée Poussin",
    "de La Vallée Poussin",
    "Weierstrass",
    "de la Vallée-Poussin",
    "Korkin",
    "Poincaré",
    "Russian Academy of Sciences",
    "Ukrainian Academy of Sciences",
    "Gösta Mittag-Leffler",
    "Académie des Sciences",
    "USSR Academy of Sciences",
    "Probability Theory",
    "Moscow Mathematical Society",
    "Pafnuty Chebyshev",
    "Chebyshev",
    "Lyapunov",
    "Yuri Linnik",
    "Linnik"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}