{
  "nome_completo": "Shiing-shen Chern",
  "nome_curto": "Shiing-shen Chern",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chern/",
  "data_nascimento": "26 October 1911",
  "local_nascimento": "Chia-hsing (or Jiaxing), Chekiang province (now Zhejiang), China",
  "data_morte": "3 December 2004",
  "local_morte": "Tianjin, Tianjin Municipality, China",
  "summary": "Shiing-shen Chern was a Chinese mathematician who made important contributions to geometry and algebraic topology.",
  "biografia": "Shiing-shen Chern\n's father, Baozhen Chern, was a classically trained Confucian scholar who later became a lawyer working for the government. Baozhen Chern had married Mei Han and they had two sons and two daughters. Shiing-shen Chern, whose name can also be written as Chen Xingshen, was educated at home as well as occasionally attending Chia-hsing elementary school from the winter of\n1917\nuntil\n1920\n.\n[\nSchooling in China at this time was just beginning to get organised following the revolution in the country around the time Chern was born.\n]\nHe was taught Chinese by his aunt and mathematics by his father. Chern's daughter writes in\n[\n32\n]\n:-\n... he didn't have a very strict father and mother who forced him to study all the time. He did things on his own and spent a lot of time in his younger days with his grandmother who probably spoiled him as much as she could.\nHe entered the Xiushui Middle School in\n1920\nbut, in\n1922\n, his father moved to Tianjin and Chern spent the next four years at the Fulun High School in Tianjin, northern China. There Chern came to love mathematics and avidly solved the problems in\nHigher Algebra\nby H S Hall and S R Knight, and in geometry and trigonometry books by George Albert Wentworth and\nDavid Eugene Smith\n. He graduated from the high school in\n1926\nand then studied at Nankai University in Tianjin, beginning his studies in September\n1930\n. This small university had about\n300\nstudents in total and Chern was one of a mathematics class of four students. He was particularly inspired by a geometry course given by Lifu Jiang, the only professor of mathematics at the university, who had studied at Harvard under\nJulian Coolidge\n. Lifu Jiang\n[\n65\n]\n:-\n... trained his pupils in a very strict way, which built a solid foundation for their future careers.\nAfter four years of study at Nankai University Chern was awarded a diploma and a B.Sc. in mathematics in\n1930\n. There were few opportunities for mathematical research in China at this time but someone who was undertaking research in geometry, the topic that Chern had become interested in, was Dan Sun who worked in Peking. Dan Sun had obtained a doctorate from the University of Chicago in\n1928\n, advised by Ernest Preston Lane, with his thesis\nProjective Differential Geometry of Quadruples of Surfaces with Points in Correspondence\n. After taking the entrance examination for the Graduate School at Tsing Hua University, Peking, Chern was appointed as an assistant in the Department of Mathematics at that university in August\n1930\n. He held this position for a year and during this time he undertook research. In August\n1931\nhe continued to undertake research in the Graduate School of Tsing Hua University. He was the only graduate student in mathematics to enter the university in\n1930\nbut during his four years there he not only studied widely in projective\ndifferential geometry\nbut he also began to publish his own papers on the topic. Chern wrote\n[\n25\n]\n:-\nIn the spring of\n1932\nBlaschke\nvisited Peking and gave a series on topological questions in differential geometry. It was really local differential geometry where he took, instead of a\nLie\ngroup as in the case of classical differential geometries, the pseudo-group of all diffeomorphisms and studied the local invariants. I was able to follow his lectures and to read many papers under the same general title published in the 'Hamburger Abhandlungen' and other journals. The subject is now known as web geometry.\nThis was not his only introduction to new ideas\n(\nquoted in\n[\n60\n]\n)\n:-\nIn Peking in\n1933\nI attended\nSperner\n's lectures on elementary topology. It was my first introduction to modern mathematics and it opened my eyes ...\nHe received a scholarship from Tsing Hua University in\n1934\nto study in the United States, but he made a special request that he be allowed to go to the University of Hamburg. His reason was that he believed the mathematics he was interested in was being done in Europe and not, at that time, in the United States. His meeting with\nWilhelm Blaschke\nwhen he visited Peking had convinced him that Hamburg would be better for him than the other big European mathematics centres such as Paris, Göttingen or Berlin. He wrote\n(\nquoted in\n[\n60\n]\n)\n:-\nIt was professor\nBlaschke\nwhose influence on me cannot be overstated. In\n1932\nhe visited Peking as part of his world tour. I was a young college student in his audience. I was immediately impressed by his fresh ideas and his insistence on mathematics being a lively and intelligible subject. This contact with him was instrumental in making me to decide to come to Hamburg as a student.\nWhen Chern arrived in Hamburg he was told that\nErich Kähler\n, a\nPrivatdozent\nat Hamburg, had just written a book describing\nÉlie Cartan\n's mathematics and was about to run a seminar on the topic. Chern described the seminar\n[\n47\n]\n:-\nThe classroom was filled, and the book had just come out.\nKähler\ncame in with a pile of the books and gave everybody a copy. But the subject was difficult, so after a number of times, people didn't come anymore. I think I was essentially the only one who stayed till the end. I think I stayed till the end because I followed the subject. Not only that, I was writing a thesis applying the methods to another problem, so the seminar was of great importance to me.\nAfter working under\nBlaschke\nand having many useful discussions with\nKähler\n, Chern received his doctorate from Hamburg in\n1936\nhaving studied for less than two years. His scholarship was for three years so he had still another year of financial support. At this stage he was forced to choose between two attractive options, namely to stay in Hamburg and work on algebra under\nEmil Artin\nor to go to Paris and study under\nÉlie Cartan\n. Although Chern knew\nArtin\nwell and would have liked to have worked with him, the desire to continue working on differential geometry was the deciding factor and he went to Paris in September\n1936\n. Before leaving for Paris he had gone to Berlin to watch the Olympic games there in August. His time in Paris was a very productive one and he learnt to approach mathematics, in the same way that\nCartan\ndid, see\n[\n28\n]\n:-\nCartan\n's writings were generally regarded as very difficult, but Chern quickly accustomed himself to\nCartan\n's way of thinking. In retrospect, Chern feels that it was like learning a new language. There is a tendency in mathematics to be abstract and have everything defined, whereas\nCartan\napproached mathematics more intuitively. That is, he approached mathematics from evidence and the phenomena which arise from special cases rather than from a general and abstract viewpoint.\nSpeaking of\nCartan\n's ideas, Chern said in the interview\n[\n47\n]\n:-\nWithout the notation and terminology of fibre bundles, it was difficult to explain these concepts in a satisfactory way.\nWorking with\nÉlie Cartan\nwas challenging but rewarding for Chern\n[\n47\n]\n:-\nUsually the day after meeting with\nCartan\nI would get a letter from him. He would say, \"After you left, I thought more about your questions ...\" - he had some results, and some more questions, and so on. He knew all these papers on simple\nLie\ngroups,\nLie\nalgebras, all by heart. When you saw him on the street, when a certain issue would come up, he would pull out some old envelope and write something and give you the answer. And sometimes it took me hours or even days to get the same answer. I saw him about once every two weeks, and clearly I had to work very hard.\nHe attended\nGaston Julia\n's Seminar which, in that year, was devoted to discussing\nCartan\n's ideas. He met\nAndré Weil\n,\nHenri Cartan\nand many other leading mathematicians. In\n1937\nChern left Paris to become professor of mathematics at Tsing Hua University. His journey took him across the Atlantic Ocean, across the United States and then across the Pacific Ocean. However the Chinese-Japanese war began in July\n1937\nwhile he was on the journey and the university moved twice to avoid the war. He worked at what was then named Southwest Associated University\n(\nconsisting of the former Tsing Hua University, Peking University and Nankai University\n)\nfrom\n1938\nuntil\n1943\n. This university operated from the city of Kunming in south west China. While there he married Shih-ning Cheng in Kunming in\n1939\n. They had two children: a daughter Pu\n(\nknown as May\n)\nwho became a physicist and married the physicist Ching-wu Chu, and a son Bolong\n(\nknown as Paul\n)\n. He received an invitation to Princeton in\n1942\nbut, he said:-\n... the trip from Kunming to Princeton looked formidable. At that time China and the US were allies in the war against Japan and the US was sending support to China with returning planes almost empty. So the Chinese government arranged for me a seat on an US Air Force plane from Calcutta, India to Miami, US. The trip took a week, through Africa and South America.\nHe spent\n1943\n-\n1945\nat Princeton where he impressed both\nHermann Weyl\nand\nOswald Veblen\n, and met\nClaude Chevalley\nand\nSolomon Lefschetz\n. He became friendly with\nLefschetz\nwho persuaded him to become an editor of the\nAnnals of Mathematics\n. He also renewed his contacts with\nAndré Weil\nwhom he had met in Paris seven years earlier.\nWeil\nwas working at Lehigh University in Bethlehem, Pennsylvania, only about\n70\nkm from Princeton. In\n[\n67\n]\n,\nWeil\nwrote about talking about\nCartan\n's mathematics to Chern at this time:-\n... we seemed to share a common attitude towards such subjects, or towards mathematics in general; we were both striving to strike at the root of each question while freeing our minds from preconceived notions about what others might have regarded as the right or the wrong way of dealing with it.\nThese talks between\nWeil\nand Chern were very influential for Chern and led to some of his most important work on characteristic classes. At the end of World War II, Chern returned to China reaching Shanghai in March\n1946\n. He was asked to set up the Institute of Mathematics of the\nAcademia Sinica\nin Nanking which he did very successfully. However at this time a civil war in China began to make life difficult and he was pleased to accept an invitation in\n1948\nfrom\nWeyl\nand\nVeblen\nto return to Princeton as a visiting professor.\nAndré Weil\n, who by this time was at the University of Chicago, arranged for Chern to be offered a full professorship at University of Chicago. Chern returned to the United States arriving on\n1\nJanuary\n1949\n, this time bringing his family with him.\nFrom\n1949\nChern worked in the United States accepting the chair of geometry at the University of Chicago after first making a short visit to Princeton. He was an invited one-hour plenary speaker at the International Congress of Mathematicians held in Cambridge, Massachusetts, from\n30\nAugust to\n6\nSeptember\n1950\n. He gave the address\nDifferential Geometry of Fibre Bundles\n.\nHans Samelson\nwrites:-\nThe starting point of this lecture is the definition of a connection in a principal fibre bundle\n(\nall spaces are differentiable manifolds, the structure group is a\nLie\ngroup ...\n)\ngeneralizing the well-known\nLevi-Civita\nparallelism. Geometrically the connection is a field of contact elements in the bundle, transversal to the fibres, and invariant under the action of the group.\nChern remained at Chicago until\n1960\nwhen he went to the University of California, Berkeley. It was at this time that he became an American citizen. He explained the circumstances:-\nMy election to the US National Academy of Sciences was a prime factor for my US citizenship. In\n1960\nI was tipped about the possibility of an academy membership. Realizing that a citizenship was necessary, I applied for it. The process was slowed because of my association to Oppenheimer. As a consequence I became a US citizen about a month before my election to academy membership.\nIn\n1970\nhe was an invited one-hour plenary speaker at the International Congress of Mathematicians held in Nice, France, from\n1\nSeptember to\n10\nSeptember\n1970\n. This was a great honour since very few mathematicians have been asked to be one-hour plenary speaker at two International Congresses of Mathematicians. On this second occasion Chern gave the address\nDifferential Geometry: Its Past and Its Future\n.\nHe continued working at Berkeley, retiring officially in\n1979\nbut remaining highly mathematically active there for six of seven more years. He continued to live in Berkeley until\n1999\nwhen, at the age of\n88\n, he returned to China where he made his home in Tianjin, where the Chern Institute of Mathematics of Nankai University had been set up in\n1985\n. The initiative for this Institute had been by Chern who proposed that the Institute should he:-\n... based at Nankai, facing the whole country, and viewing the world.\nChern's wife died in January\n2000\nin Tianjin. In the paper\nA summary of my scientific life and works\nwhich Chern wrote in\n1978\n(\nand is included in the volumes of his selected papers\n)\nChern wrote about the contribution of his wife:-\nI would not conclude this account without mentioning my wife's role in my life and work. Through war and peace and through bad and good times we have shared a life for forty years, which is both simple and rich. If there is credit for my mathematical works, it will be hers as well as mine.\nHe died at his home in Tianjin at the age of\n93\nfrom heart failure following a heart attack.\nAs we have already seen, his area of research was differential geometry where he studied the\n(\nnow named\n)\nChern characteristic classes in fibre spaces. These are important not only in mathematics but also in mathematical physics. He worked on characteristic classes during his\n1943\n-\n45\nvisit to Princeton and, also at this time, he gave a now famous proof of the\nGauss\n-\nBonnet\nformula. His work is summed up in\n[\n78\n]\nas follows:-\nWhen Chern was working on differential geometry in the\n1940\ns, this area of mathematics was at a low point. Global differential geometry was only beginning, even\nMorse\ntheory was understood and used by a very small number of people. Today, differential geometry is a major subject in mathematics and a large share of the credit for this transformation goes to Professor Chern.\nRichard Palais and Chuu-Lian Terng give an excellent overview of Chern's mathematics in\n[\n56\n]\n:-\nChern's mathematical interests have been unusually wide and far-ranging and he has made significant contributions to many areas of geometry, both classical and modern. Principal among these are: Geometric structures and their equivalence problems; Integral geometry; Euclidean differential geometry; Minimal surfaces and minimal submanifolds;\nHolomorphic\nmaps; Webs; Exterior Differential Systems and Partial Differential Equations; The\nGauss\n-\nBonnet\nTheorem; and Characteristic classes. ... we would like to point out a unifying theme that runs through all of it: his absolute mastery of the techniques of differential forms and his artful application of these techniques in solving geometric problems. This was a magic mantle, handed down to him by his great teacher,\nÉlie Cartan\n. It permitted him to explore in depth new mathematical territory where others could not enter. What makes differential forms such an ideal tool for studying local and global geometric properties\n(\nand for relating them to each other\n)\nis their two complementary aspects. They admit, on the one hand, the local operation of exterior differentiation, and on the other the global operation of integration over cochains, and these are related via\nStokes\n's Theorem.\nHe was awarded the Chauvenet Prize from the\nMathematical Association of American\n1970\n, the National Medal of Science in\n1975\n, the Humboldt Prize in\n1982\n, the Leroy F Steele Prize from the\nAmerican Mathematical Society\nin\n1983\n, the Wolf Prize in\n1984\n, the\nLobachevsky\nMedal in\n2002\nand the first Shaw Prize in Mathematics from Hong Kong in\n2004\n:-\n... for his initiation of the field of global differential geometry and his continued leadership of the field, resulting in beautiful developments that are at the centre of contemporary mathematics, with deep connections to topology, algebra and analysis, in short, to all major branches of mathematics of the last sixty years.\nIn\n1985\nhe was elected a Fellow of the\nRoyal Society of London\nand the following year he was made an honorary member of the\nLondon Mathematical Society\n. He has also been made an honorary member of the\nIndian Mathematical Society\n(1950)\n, the\nNew York Academy of Sciences\n(1987)\n. He was elected to the\nAcademia Sinica\n(1948)\n, the\nUnited States National Academy of Sciences\n(1961)\n, the\nAmerican Academy of Arts and Sciences\n(1963)\n, the\nBrazilian Academy of Sciences\n(1971)\n, the Academia Peloritana, Messina, Sicily\n(1986)\n, the\nAccademia dei Lincei\n(1989)\n, the\nAcadémie des Sciences\n, Paris\n(1989)\n, the American Philosophical Society\n(1989)\nthe\nChinese Academy of Sciences\n(1994)\n, and the\nRussian Academy of Sciences\n(2001)\n. He was awarded honorary degrees by the University of Chicago\n(1969)\n, the Chinese University of Hong Kong\n(1969)\n, Eidgenössische Technische Hochschule Zürich\n(1982)\n, the State University of New York Stony Brook\n(1985)\n, University of Hamburg\n(1971)\n, Nankai University\n(1985)\n, University of Notre Dame\n(1994)\n, Technische Universität Berlin\n(2001)\n, and Hong Kong University of Science and Technology\n(2003)\n.\nWe end this biography with the \"Chern song\". In\n1979\na Chern Symposium held in his honour offered him this tribute in song:-\nHail to Chern! Mathematics Greatest!\nHe made Gauss-Bonnet a household word,\nIntrinsic proofs he found,\nThroughout the World his truths abound,\nChern classes he gave us,\nand Secondary Invariants,\nFibre Bundles and Sheaves,\nDistributions and Foliated Leaves!\nAll Hail All Hail to CHERN.",
  "matematicos_citados_na_biografia": [
    "David Eugene Smith",
    "Julian Coolidge",
    "differential geometry",
    "Blaschke",
    "Lie",
    "Sperner",
    "Wilhelm Blaschke",
    "Erich Kähler",
    "Privatdozent",
    "Élie Cartan",
    "Kähler",
    "Emil Artin",
    "Artin",
    "Cartan",
    "Gaston Julia",
    "André Weil",
    "Henri Cartan",
    "Hermann Weyl",
    "Oswald Veblen",
    "Claude Chevalley",
    "Solomon Lefschetz",
    "Lefschetz",
    "Weil",
    "Academia Sinica",
    "Weyl",
    "Veblen",
    "Hans Samelson",
    "Levi-Civita",
    "Gauss",
    "Bonnet",
    "Morse",
    "Holomorphic",
    "Stokes",
    "Mathematical Association of American",
    "American Mathematical Society",
    "Lobachevsky",
    "Royal Society of London",
    "London Mathematical Society",
    "Indian Mathematical Society",
    "New York Academy of Sciences",
    "United States National Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Brazilian Academy of Sciences",
    "Accademia dei Lincei",
    "Académie des Sciences",
    "Chinese Academy of Sciences",
    "Russian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}