{
  "nome_completo": "Sigekatu Kuroda",
  "nome_curto": "Sigekatu Kuroda",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuroda/",
  "data_nascimento": "11 November 1905",
  "local_nascimento": "Tokyo, Japan",
  "data_morte": "3 November 1972",
  "local_morte": "Baltimore, Maryland, USA",
  "summary": "Sigekatu Kuroda was a Japanese mathematician who worked in number theory and mathematical logic.",
  "biografia": "Sigekatu Kuroda\nstudied mathematics at Tokyo Imperial University and was awarded his Rigakushi\n(\nBachelor of Science\n)\nin\n1928\n. His professor at Tokyo Imperial University was\nTeiji Takagi\n, who was a leading researcher in algebraic number theory, and he gave Kuroda a lasting interest in that topic. However, Kuroda decided to specialise in the foundations of mathematics and, for that reason,\nTakagi\nis said to have called his student a \"lazybones\". Kuroda's first three papers were all entitled\nZur Algebra der Logik\nⓉ\n(\nOn the algebra of logic\n)\npublished in the\nProceedings\nof the Imperial Academy of Tokyo. The first two appeared in\n1930\nand the third in the following year.\nTeiji Takagi\nhad married Toshi Tani in\n1902\n; they had three sons and five daughters. Kuroda married Yaeko, the third of Takagi's daughters; they had three sons who became mathematicians including Sige-Yuki Kuroda\n(1934\n-\n2009)\n. Sigekatu Kuroda served as an Assistant at Tokyo Imperial University in\n1932\n-\n33\nbefore being appointed as a Professor at Ochyanomizu University, Tokyo, in\n1933\n. In the same year he published the monograph\nSugaku Kisoron\nⓉ\n(\nFoundations of Mathematics\n)\nand, in\n1938\n, the book\nShugoron\nⓉ\n(\nSet Theory\n)\n.\nThere followed\n[\n2\n]\n:-\n... long periods of service to his country away from his field of studies.\nIn many ways Kuroda's work on the foundations of mathematics and mathematical logic had made it difficult for him to become a central figure in Japanese mathematics. However, as his repertoire grew much broader and greater he put himself in a position to be appointed to more prestigious positions. In\n1942\nKuroda was appointed as Professor at the newly founded Imperial University of Nagoya, Chikusa-ku, Nagoya, Japan, where he worked for over\n20\nyears building up a strong Department of Mathematics. He was awarded his Rigakuhakushi\n(\nDoctor of Science\n)\nby Tokyo Imperial University in\n1945\n. Over the following years he published papers such as\nIntuition and consistency in mathematics\n(\nJapanese\n)\n(1947)\n,\nOn the logic of Aristotle and the logic of Brouwer\n(\nJapanese\n)\n(1948)\n, and\nIntuitionistische Untersuchungen der formalistischen Logik\nⓉ\n(\nIntuitionistic investigations of formal logic\n)\n(1951)\n. The third of these papers is a summary\n(\nin German\n)\nof the previous two. In these papers he\n[\n3\n]\n:-\n... illustrates intuitionistic points of view towards mathematics, and investigates intuitionistic logic as formalized by\nHeyting\n-\nGentzen\n.\nIn fact he makes it clear in the\n1951\npaper that he shares\nL E J Brouwer\n's view that mathematics is an activity of thought that is independent of logic and based on immediate evidence that is intuitively clear.\nIn the same period, he published\nAn examination of the foundations of analysis\n(\nJapanese\n)\n(1949)\nin which he examined consequences of a non-intuitionistic assumption which leads to two non-equivalent real number systems. In this paper, he then examines order relations, the operations of arithmetic, rational and irrational reals, and also considers how convergence works.\nIn\n1953\n-\n1954\nhe served Nagoya University as Dean of the Faculty of Science following which he attended the International Congress of Mathematicians in Amsterdam in September\n1954\nwhere he gave the lecture\nOn the intuitionistic and formalistic theory of real numbers\n. He spent the academic year\n1955\n-\n1956\nas a visitor at the Institute of Advanced Study at Princeton where he met\nGödel\n.\nLeopoldt\nwrites\n[\n2\n]\n:-\nPerhaps there and then the idea was born whose realization dominated the following years: he introduced a new system, suitable for the logical foundation, which may be regarded in some sense as a modified and drastically simplified\nGentzen\nsystem. It has been published in a series of thirteen papers under the common title \"An investigation of the logical structure of mathematics.\"\nThe subtitles of these papers are:\nA logical system\n(1958)\n;\nTransformation of proof\n(1959)\n;\nFundamental deductions\n(1958)\n;\nCompendium for deductions\n(1958)\n;\nContradictions of Russell's type\n(1958)\n;\nConsistent V-system\nT\n(\nV\n)\nT(V)\nT\n(\nV\n)\n(1959)\n;\nSet-theoretical contradictions\n(1959)\n;\nConsistency of the natural number theory\nT\n1\n(\nN\n)\nT_{1}(N)\nT\n1\n​\n(\nN\n)\n(1959)\n;\nDeductions in the natural number theory\nT\n1\n(\nN\n)\nT_{1}(N)\nT\n1\n​\n(\nN\n)\n(1959)\n;\nConcepts and sets\n(1959)\n;\nThe principle of extensionality and of choice\n(1958)\n; and\nA method of programming of proofs in mathematics for electronic computing machine\n(1960)\n. In the first of these he sets up his new logical system. He writes:-\nSince the discovery of set theoretical paradoxes the investigation on the foundations of mathematics from the formalistic and logistic point of view has moved to the direction to avoid the existing contradictions. For this purpose, many logical or mathematical systems have been presented, which are so formulated that we can have, at the best of our present knowledge, the confidence that neither existing nor new contradiction can be deduced in these systems. Therefore, in formulating these systems, some special conditions to restrict the free application of logic are needed, for instance, simple or ramified type theory, introduced to logic first by\nRussell\n, or the restriction of the comprehension axiom of set theory. Some of these conditions seem very natural. However, at least in some cases, we have no essential clarification of the reason why those logical systems should be restricted by those conditions, except that if these conditions were taken off then we would fall into contradiction. So we try to reverse the direction of our investigation. Instead of seeking the conditions to avoid contradictions from the beginning, we observe a logical system which includes any contradiction, existing or unknown ...\nA visit to the United States in\n1960\ngave Kuroda another chance to meet with\nGödel\nbut it does not appear that the two had a very lengthy discussion for, after the visit, he wrote to\nGödel\non\n16\nJune of that year\n[\n7\n]\n:-\nIt was my great pleasure also that I heard from you that you are studying Husserl and you admired his philosophy, which was the unique philosophy that I devoted rather long period and effort in my youth. I hope I have a chance some day to speak with you about Husserl. As you are doing now, I would like to recollect Husserl's philosophy after returning to my country.\nDespite his many deep works on mathematical logic and the foundations of mathematics, Kuroda had a lifelong interest in\nalgebraic number theory\n. Examples of his publications in this area are the papers\nÜber den Dirichletschen Körper\nⓉ\n(\nOn the Dirichlet field\n)\n(1943)\n,\nÜber die Pellsche Gleichung\nⓉ\n(\nOn Pell's equation\n)\n(1943)\n,\nÜber die Klassenzahlen algebraischer Zahlkörper\nⓉ\n(\nOn the class numbers of algebraic number fields\n)\n(1950)\n,\nÜber die Zerlegung rationaler Primzahlen in gewissen nicht-abelschen galoisschen Körpern\nⓉ\n(\nOn the decomposition of rational primes in certain non-Abelian Galois fields\n)\n(1951)\n, and the book\n(\nwith Tomio Kubota\n)\nNumber Theory - Fundamentals of Algebraic Number Theory\n(\nJapanese\n)\n(1963)\n. In the\n1950\npaper he generalised results of\nDirichlet\n,\nHerglotz\nand others, when he studied the general shape of the class number relations\n(\nmultiplicative relations between the zeta-functions of subfields\n)\nof an abelian extension of a field. The\n1951\npaper gives one of the earliest examples of a nonabelian decomposition law.\nIn\n1962\nKuroda went to the United States when he spent a year as a Visiting Professor at the University of Maryland. While there, he was offered a permanent position at the University of Maryland where he held a chair of mathematics from\n1963\nuntil he retired in\n1972\n. He developed an interest in using computers to investigate questions in algebraic number theory. He deposited copies of computer output for\nTable of Class Numbers\n,\nh\n(\np\n)\nh(p)\nh\n(\np\n)\nGreater than\n1\n, for Fields\nQ\n(\n√\np\n)\n,\np\n=\n1\n(\nm\no\nd\n4\n)\n≤\n2776817\n\\mathbb{Q}(√p), p = 1 (mod 4) ≤ 2776817\nQ\n(\n√\np\n)\n,\np\n=\n1\n(\nm\no\nd\n4\n)\n≤\n2\n7\n7\n6\n8\n1\n7\n(1965)\nand\n(\nwith Richard B Lakein\n)\nTables of Class Numbers\nh\n(\n−\np\n)\nh(-p)\nh\n(\n−\np\n)\nfor Fields\nQ\n(\n√\n−\np\n)\n,\np\n≤\n465071\n\\mathbb{Q}(√-p), p ≤ 465071\nQ\n(\n√\n−\np\n)\n,\np\n≤\n4\n6\n5\n0\n7\n1\n(1965)\n.\nLeopoldt\nwrites\n[\n2\n]\n:-\nBeginning in the early sixties he became very interested in the use of computers in number theory. He did a considerable amount of work in this area himself; unfortunately only a small part of it has appeared in print so far. But he also tried to establish a system of communication and cooperation for the various groups working in this area, thereby giving invaluable advice and practical help to anybody asking for it.\nHe became Professor Emeritus at both the University of Maryland and at Nagoya University after he retired in\n1972\n, but he was to hold these roles for a very short time since he died in November\n1972\n.\nLeopoldt\nwrites of his final days in\n[\n2\n]\n:-\nProfessor Sigekatu Kuroda died in\n1972\nat the age of\n67\n. He was a mathematician whose role in the mathematical community and whose influence on its development cannot fully be measured by the amount of his published work done. Deeply devoted to our science, he was constantly prepared to serve his cause, the promotion of mathematics. A long and painful illness overshadowed his last years, but for him, who was then deeply engaged in the editorial preparation of the collected works of\nTakagi\n, the illness seemed to exist only as a reminder of the shortness of time left to complete the task.\nThe collected papers of\nTeiji Takagi\n, edited by Sigekatu Kuroda, was published in\n1973\n, with a preface by\nS Iyanaga\n. We should also mention the important contribution Kuroda made to publishing, being one of the founders of the\nNagoya Mathematical Journal\nand serving on the editorial board until his death. He was also an editor of the\nJournal of Number Theory\n. Let us end this biography with\nLeopoldt\n's tribute\n[\n2\n]\n:-\nHis devotion to mathematics together with his extraordinary patience made him a successful and even inspiring teacher, highly respected by his students as well as by his colleagues and friends.",
  "matematicos_citados_na_biografia": [
    "Teiji Takagi",
    "Takagi",
    "Heyting",
    "Gentzen",
    "L E J Brouwer",
    "Gödel",
    "Leopoldt",
    "Russell",
    "algebraic number theory",
    "Dirichlet",
    "Herglotz",
    "S Iyanaga"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}