{
  "nome_completo": "Simon Newcomb",
  "nome_curto": "Simon Newcomb",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Newcomb/",
  "data_nascimento": "12 March 1835",
  "local_nascimento": "Wallace, Nova Scotia, Canada",
  "data_morte": "11 July 1909",
  "local_morte": "Washington, D.C., USA",
  "summary": "Simon Newcomb was a Canadian-born mathematician whose work on mathematical astronomy was very important. He also wrote on economics.",
  "biografia": "Simon Newcomb\n's mother was Emily Prince, the daughter of a New Brunswick magistrate. His father, John Burton Newcomb, was a school master in Canada. John moved around teaching in different parts of the country, particularly in different villages in Nova Scotia and Prince Edward Island, and Simon received no formal education other than from his father. Nevertheless his father provided him with an excellent foundation for his future studies. When he was sixteen years old Simon took a job with a herbalist, called Dr Foshay, in New Brunswick. They entered an agreement that Newcomb would serve a five year apprenticeship during which time Foshay would train him in using herbs to treat illnesses. For two years he was an apprentice but became increasingly unhappy about Foshay's unscientific approach, realising that the man was a charlatan. He made the decision to walk out on Foshay and break their agreement.\nIndeed he did literally walk out, for Newcomb walked about\n120\nmiles to the port of Calais in Maine where he met the captain of a ship who agreed to take him to Salem in Massachusetts if he was prepared to work as a sailor on board ship. In about\n1854\nhe joined his father in Salem\n(\nJohn Newcomb had moved earlier to the United States\n)\n, and the two journeyed together to Maryland.\nAfter arriving in Maryland, Newcomb taught for two years from\n1854\nto\n1856\n; for the first year in a country school in Massey's Cross Roads, Kent County, then for a year at a school not far south in Sudlersville. In his spare time he studied a variety of subjects such as political economy and religion, but his deepest studies were made in mathematics and astronomy. In particular he read\nNewton\n's\nPrincipia\nat this time. In\n1856\nhe took up a position as a private tutor close to Washington and he often travelled to that city to study mathematics in the libraries there. He was able to borrow a copy of\nBowditch\n's translation of\nLaplace\n's\nMécanique céleste\nfrom the library of the Smithsonian Institution but found that the mathematics which the book contained was rather beyond his current knowledge.\nIn\n1857\n, at the suggestion of the director to the Smithsonian Institution, he obtained a position in the American Nautical Almanac Office\n(\nsituated in Cambridge, Massachusetts, at that time\n)\n. The task which he had to undertake was producing new astronomical tables to be used for navigation at sea. While working there, he studied at the Lawrence Scientific School of Harvard University, working under\nBenjamin Peirce\n, and graduated in\n1858\n. At this stage he divided his time between Harvard, where although not formally enrolled he began to undertake research, and the Almanac Office where he continued his computational work. One of his first research topics was to examine the orbits of the asteroids in an attempt to learn something of their origin.\nNewcomb had arrived in the United States at a very difficult time with tensions rising between the southern and northern states. When Lincoln was elected president in\n1860\n, the southern states began to leave the Union. Fighting began in April\n1861\nand several professors of mathematics in the United States Navy felt they could no longer serve in these military posts and resigned. In\n1861\nNewcomb was appointed as professor of mathematics and astronomer at the Naval Observatory at Washington to fill a vacancy created by one of these resignations. Two years later he married Mary Caroline Hassler.\nHe spent the years from\n1861\nto\n1871\ndetermining the positions of celestial objects using various telescopes but in particular a\n26\n-inch refractor telescope, the largest such telescope in the United States, which had been built under his supervision. He became particularly interested in the theory behind the orbits of the planets and the moon, and looked to improve their predicted positions by calculating the perturbations in their orbits caused by the gravitational attraction of other bodies.\nThe tables for the moon which existed at this time had been compiled by Hansen, and it had become clear that the moon was deviating from the position predicted for it in the tables. Hansen had used observations dating back to\n1750\nin order to compile the tables but Newcomb felt that using older observations would be valuable. When he was in Paris to observe a solar eclipse in\n1870\n, he discovered they had made high quality observations since\n1672\nand still held the data from those observations. In fact Newcomb was in Paris at a very difficult period for, following humiliation by the Prussians in the previous year, the victorious German armies marched through Paris. The French capital moved to Versailles but on\n26\nMarch\n1871\nthe Parisians elected a council called the Commune. The Government forces were sent in on\n21\nMay and street fighting lasted for a week. The Observatory was caught in the midst of the fighting but, fortunately for Newcomb, he had been able to leave the city three weeks earlier in the midst of the mounting crisis.\nOnce Newcomb was able to study the pre-\n1750\nobservational data, he discovered that Hansen's tables were badly in error for the period before\n1750\n. For his work during this period on the moon's motion, and also on the positions of Uranus and Neptune, he was awarded the Gold Medal of the\nRoyal Astronomical Society\nin\n1874\n. By now he had a very high reputation as an astronomer and, as a consequence, he was offered the post of Director of the Harvard College Observatory in\n1875\n. He declined, however, since despite his achievements in observational astronomy his real love was in computation and developing mathematical theories to explain the observational data.\nIn\n1877\nNewcomb became director of the American Nautical Almanac Office\n(\nby this time in Washington\n)\nand this did indeed give him a position where the emphasis was on computation rather than observation. He then started his most important work which, in his own words, gave\n[\n3\n]\n:-\n... a systematic determination of the constants of astronomy from the best existing data, a reinvestigation of the theories of the celestial motions, and the preparation of tables, formulae, and precepts for the construction of ephemerides, and for other applications of the same results.\nThe reason he undertook this work was because of the:-\n... confusion which pervaded the whole system of exact astronomy, arising from the diversity of the fundamental data made use of by the astronomers of foreign countries and various institutions in their work.\nHe also explained in\n[\n3\n]\nhow he went about achieving these aims:-\nThe programme of work which I mapped out involved, as one branch of it, a discussion of all the observations of value on the positions of the sun, moon, and planets, and incidentally on the bright fixed stars, made by the leading observatories of the world since\n1750\n. One might almost say it involved repeating, in a space of ten or fifteen years, an important part of the world's work in astronomy for more than a century past. ... The other branches of the work were ... the computation of the formulae for the perturbation of the various planets by each other.\nNewcomb was appointed professor of mathematics and astronomy at Johns Hopkins University in\n1884\n, holding this position until\n1893\n. He was an editor of the\nAmerican Journal of Mathematics\nfor most of the period from\n1885\nto\n1900\n. He was also a founding member and first president\n(1899\n-\n1905)\nof the American Astronomical Society. He served as president of the\nAmerican Mathematical Society\nfrom\n1897\nto\n1898\n.\nAlthough most of Newcomb's work was in mathematical astronomy, some of his papers were purely theoretical. He wrote a paper showing how the coordinates of a planet might be represented by trigonometric series.\nLaplace\nhad devised a method involving cosine series for computing the perturbing force on a planet caused by other planets. The coefficients in the series were known as '\nLaplace\ncoefficients' but the drawback of the method was that it only worked for circular orbits. Newcomb showed how to extend\nLaplace\n's series to give a perturbing function in the case of elliptical orbits by introducing differential operators which act on the\nLaplace\ncoefficients. These differential operators became known as 'Newcomb operators'. He also wrote on\nnon-euclidean geometry\nand\nCayley\ncommented on one of his theorems saying:-\n... from the boldness of the conception and beauty of the result a very remarkable one, and constitutes an important addition to theoretical dynamics\n.\nNewcomb, helped by his assistant\nHill\n, computed values for the astronomical constants which were all major improvements on the previous accepted values. In a rather remarkable international agreement in Paris in\n1896\n, it was decided that the ephemerides of every country in the world should use Newcomb's values for these constants. The Paris conference at which the agreement was reached also gave Newcomb the task of completing a catalogue of the positions and motions of the bright stars and also with computing a new value for precession. This task was made rather more difficult since Newcomb reached compulsory retiring age one year later, but arrangements were made to allow for the work to be completed, and he was given a consulting role. The Carnegie Institution provided financial support for him to continue working on his theory of the moon's orbit.\nIt was not only in mathematics and astronomy, however, that Newcomb made major contributions. He had been interested in political economy since he began his studies in the United States and he wrote articles and books on the topic. His major work on this topic is the textbook\nPrinciples of political economy\n(1885)\n.\nKeynes\ndescribed this work as:-\n... one of those original works which a fresh scientific mind, not perverted by having read too much of the orthodox stuff, is able to produce from time to time in a half-formed subject like economics.\nIn\n[\n5\n]\nNewcomb's interests outside academic topics are described:-\nHe spoke French and German fluently and knew sufficient of the languages of Italy and Sweden to be able to travel in these countries with comfort. Accustomed from childhood to long walks he continued this form of exercise throughout his life, walking daily several miles between the close of office hours and dinner. On Sundays the walks were much longer. Nothing delighted him more than his walking trips to Switzerland while he was abroad. Even when he was seventy years old he climbed to the chalet high up the side of the Matterhorn, a feat almost unprecedented for a man of his age. He was a lover of travel. .. he was full of fun and loved to romp with his children, when they were young. He read history and other literature extensively and could recite page after page of poetry. He delighted in art... he was an expert chess player...\nWe should add to this that he was a writer of popular astronomy books such as\nPopular astronomy\n(1878)\n,\nAstronomy for schools and colleges\n(1880)\n,\nElements of astronomy\n(1890)\n,\nThe stars\n(1901)\n,\nAstronomy for everyone\n(1903)\n, and\nSpherical astronomy\n(1906)\n. He also wrote a science fiction novel\nHis wisdom the defender\npublished in\n1900\n.\nNewcomb received many honours, in fact it requires almost two pages in\n[\n5\n]\nto list them. Among these honours, he was elected a Fellow of the\nRoyal Society\nin\n1877\nand he received its Copley Medal in\n1890\n. He was elected an honorary member of most of the major scientific societies of the world and received many awards and prizes for his work. These included the Gold Medal from the\nRoyal Astronomical Society\nin\n1874\nas mentioned above, and the\nHuygens\nMedal from the Haarlem Academy of Sciences in\n1878\n. France made him chevalier of the Légion d'Honneur in\n1893\n. The Astronomy Society of the Pacific awarded him the Bruce Medal in\n1898\n(\nthe first time the Medal was awarded\n)\n. The citation records:-\n... the undoubted fact, that he has done more than any other American since\nFranklin\nto make American science respected and honoured throughout the entire world.\nIn September\n1908\nhis health began to deteriorate and he was diagnosed with cancer of the bladder. Realising that he had not long to live he devoted his last months to completing his major work on\nThe Motion of the Moon\nwhich he completed shortly before his death\n[\n1\n]\n:-\nNewcomb was buried with military honours in Arlington National Cemetery; President Taft and the representatives of several foreign governments attended the funeral.",
  "matematicos_citados_na_biografia": [
    "Newton",
    "Bowditch",
    "Laplace",
    "Benjamin Peirce",
    "Royal Astronomical Society",
    "American Mathematical Society",
    "non-euclidean geometry",
    "Cayley",
    "Hill",
    "Keynes",
    "Royal Society",
    "Huygens",
    "Franklin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}