{
  "nome_completo": "Siobhán O'Shea Vernon",
  "nome_curto": "Siobhán Vernon",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vernon/",
  "data_nascimento": "24 February 1932",
  "local_nascimento": "Macroom, County Cork, Ireland",
  "data_morte": "18 September 2002",
  "local_morte": "Cork, Ireland",
  "summary": "Siobhán Vernon was the first Irish-born woman to get a PhD in pure mathematics in Ireland.",
  "biografia": "Siobhán Vernon\nwas given the name\nSiobhán O'Shea\nand only after her marriage did she take her husband's name and became known as Siobhán Vernon. She was the daughter of Joseph J O'Shea and his wife M O'Shea, and the family lived in Main Street, Macroom. The\n1921\nPostal Directory County Cork lists Joseph J O'Shea as living in Main Street and gives his occupation as auctioneer.\nHer primary education was at the Convent of Mercy in Macroom. There she studied and took her Primary Leaving Certificate examination at the end of the seventh grade which gave her entry to secondary education. She continued to study at the  Convent of Mercy but she also attended the De La Salle, Macroom, a Catholic Voluntary secondary school for boys, for the higher level mathematics classes required for the Leaving Certificate.\nShe entered University College, Cork in\n1949\nand, after taking the examinations at the end of her first year of study in the summer of\n1950\n, she was awarded a scholarship. She graduated in\n1952\nwith First Class Honours in Mathematics and Mathematical Physics. Following the award of the B.Sc. she was appointed as a Demonstrator at University College, Cork, while she continued to study for higher degrees. The\nSouthern Star from Cork\nreported on\n29\nNovember\n1952\n[\n4\n]\n:-\nMiss Siobhan O'Shea, B.Sc., daughter of Mr Joseph J O'Shea and Mrs O'Shea, Main Street, Macroom, was recently appointed a Demonstrator at University College, Cork.\nO'Shea's role as Demonstrator was part of a support scheme for post-graduate students. At this time the professor of mathematics was Henry St John Atkins and the professor of statics was Tadhg O Ciardha. O'Shea was awarded the degree of M.Sc. in Mathematics and Mathematical Statistics in\n1954\nand, following the award of the degree, she became a Senior Demonstrator. Henry St John Atkins\n(1896\n-\n1987)\nwas professor of mathematics at Cork from\n1936\nto\n1954\nand, in addition, registrar while Alfred O'Rahilly was President of University College, Cork, from\n1943\nto\n1954\n. Henry St John Atkins was appointed President in\n1954\nand, since this left mathematics short staffed,\nPatrick Brendan Kennedy\nwas appointed as a lecturer in mathematics.\nAt Cork,\nKennedy\nencouraged O'Shea to undertake research in mathematics. On\n17\nDecember\n1956\nshe submitted her paper\nNote on an integrability theorem for sine series\nto the\nQuarterly Journal of Mathematics, Oxford\n, and it was published in the following year. In the paper she writes:-\nI wish to thank Professor\nP B Kennedy\nfor suggesting the problem treated in this note.\nShe was appointed to the new full-time post of Assistant in Mathematics at University College, Cork, in\n1957\nand submitted her second paper\nOn a divergent trigonometrical series given by Steinhaus\nto the\nProceedings\nof the\nAmerican Mathematical Society\non\n28\nMay\n1958\n. She acknowledged financial support:-\nResearch sponsored by the Research and Development Command, United States Air Force, through its European Office.\nShe again thanks\nKennedy\n:-\nI wish to thank Professor\nP B Kennedy\nfor suggesting this problem to me.\nHer third paper\nThe absolute convergence of certain lacunary Fourier series\nwas published in the\nProceedings\nof the\nRoyal Irish Academy\nin\n1960\n-\n61\n.\nKennedy\nsuggested to O'Shea that she might benefit from taking study leave and supported her application for leave of absence in session\n1962\n-\n63\n. She spent this session at Royal Holloway College, University of London, where she was a Visiting Lecturer for the year. Returning to Cork, she submitted her published papers for a Ph.D. and, in\n1964\n, was awarded the degree by the National University of Ireland. Her thesis was entitled\nSome results in classical analysis\nand it appears under the name Johanna\n(\nSiobhan\n)\nO'Shea. The\nSouthern Star from Cork\nreported on\n7\nNovember\n1964\n[\n5\n]\n:-\nAt the recent conferring of degrees at U.C.C., Miss Siobhán O'Shea M.Sc, daughter of Mrs M O'Shea and the late Mr J O'Shea, Main St., Macroom, received her Ph.D. degree in Mathematics. Dr O'Shea has been on the staff in the mathematics department at U.C.C. since she graduated some years ago.\nAlthough we have been unable to determine the precise date on which her father, Joseph O'Shea, died, it is evident from\n[\n4\n]\nand\n[\n5\n]\nthat he died between\n1952\nand\n1964\n. O'Shea was appointed as a lecturer at Cork in\n1965\n. She continued to be encouraged by\nKennedy\nand acknowledged this in her next paper\nOn power series with non-negative coefficients\n(1966)\n. This paper, sent in June\n1964\nand revised in March\n1965\n, contains the note:-\nI wish to thank Professor\nP B Kennedy\nfor suggesting the problem treated in this note and also the referee for his helpful comments.\nKennedy\nhad left Cork in\n1963\nto take up an appointment at the University of York in England but died at the age of\n36\nin\n1966\n.\nO'Shea's next two publications were\nNote on power series of a certain type\n(1968)\nand\nA class of power series with no real zeros\n(1971)\n. We quote from her obituary written by Paddy Barry concerning her teaching\n[\n1\n]\n:-\nHer publications were generally in the field of infinite series, in particular trigonometric series, which is mathematical analysis but in her teaching she had an inclination to algebra. For many years she taught the First Arts course and part of the Third Arts one, and gave supplementary lectures through the medium of Irish. Students, at various levels, profited greatly by her lectures; she was well known to the many who went into the teaching profession. If memory serves, she was one of just two women in this country at university level in pure or applied mathematics in the early days.\nPeter Vernon was a geologist, famed for his paper\nDrumlins and Pleistocene ice flow over the Ards Peninsula/Strangford Lough area, County Down, Ireland\n(1966)\n. When he wrote this paper he was on the staff of The Queen's University of Belfast, but he was later appointed to the Geology Department of the University of Cork. There he met O'Shea and later the two married; they had four children. For ten years while she was bringing up the children, Siobhán Vernon reduced her teaching to half-time but after this she returned to full-time teaching. She retired in\n1988\n.\nUnder her married name of Siobhán Vernon, she published the three papers\nOn power series with non-negative coefficients. II\n(1975)\n,\nOn the critical points of polynomials\n(1978)\nand\nOn commutativity in certain classes of rings\n(1983)\n. The\n1978\npaper was reviewed by Wolfgang Luh who writes:-\nLet\nP\n(\nn\n)\nP(n)\nP\n(\nn\n)\ndenote the class of polynomials of degree\nn\n≥\n2\nn ≥ 2\nn\n≥\n2\nwhich have all their zeros in the unit disk. The author proves that there exists a number\nD\n=\nD\n(\nn\n)\n>\n0\nD = D(n) > 0\nD\n=\nD\n(\nn\n)\n>\n0\nsuch that the derivative of any polynomial\np\np\np\nin\nP\n(\nn\n)\nP(n)\nP\n(\nn\n)\nwith\np\n(\na\n)\n=\n0\n,\n0\n≤\na\n≤\nD\np(a) = 0, 0 ≤ a ≤ D\np\n(\na\n)\n=\n0\n,\n0\n≤\na\n≤\nD\n, has a zero in\n∣\nz\n−\na\n2\n∣\n≤\n1\n−\na\n2\n.\n| z - \\Large\\frac{a}{2}\\normalsize  | ≤ 1 - \\Large\\frac{a }{2}\\normalsize  .\n∣\nz\n−\n2\na\n​\n∣\n≤\n1\n−\n2\na\n​\n.\nAn estimate for D is given.\nHer\n1983\npaper is the only one she published on algebra, although as noted above, she liked teaching algebra. This paper gives theorems which generalise results of Des MacHale, one of her colleagues in Cork, which he had published in\n1980\n. Her final publication was a chapter of the book\nCreators of Mathematics: The Irish Connection\nwhich she was invited to contribute by its editor Ken Houston. This chapter was a biography of\nPatrick Brendan Kennedy\nand Maebh Long writes in the review of the book\n[\n3\n]\n:-\nSiobhán Vernon's account of\nPatrick Brendan Kennedy\nis well written and engaging, her personal acquaintance with the Professor of Mathematics in Cork and York leads to a moving portrayal of a warm and humorous yet tragic figure.\nIn\n1995\nthe Convent of Mercy in Macroom, the school she had attended when young, honoured her with the Catherine McAuley award, given to a \"distinguished past pupil\".\nA Christmas Lunch for retired members of University College Cork staff was held in the Aula Maxima on\n12\nDecember\n2001\n. Both Siobhán Vernon and her husband Peter Vernon attended. In the autumn of\n2000\nher daughter Maude Vernon graduated from Cork with a Bachelor of Business Studies.",
  "matematicos_citados_na_biografia": [
    "Patrick Brendan Kennedy",
    "Kennedy",
    "P B Kennedy",
    "American Mathematical Society",
    "Royal Irish Academy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}