{
  "nome_completo": "Sergei Borisovich Stechkin",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stechkin/",
  "data_nascimento": "6 September 1920",
  "local_nascimento": "Moscow, USSR",
  "data_morte": "22 November 1995",
  "local_morte": "Moscow, Russia",
  "summary": "Sergei Stechkin was a Russian mathematician who obtained deep results in the theory of trigonometric series, the theory of approximations for functions and operators, in the study of approximation properties of sets in Banach spaces, and in number theory.",
  "biografia": "Sergei Borisovich Stechkin\nwas the son of Boris Sergeevich Stechkin\n(1891\n-\n1969)\nand Irina Nikolaevna Shilova\n(1898\n-\n1958)\n. Boris Sergeevich was born on\n20\nJuly\n1891\n(\nnew calendar\n5\nAugust\n)\nin Trufanovo, Tula, Russia. His father Sergei Yakovlevich Stechkin\n(1864\n-\n1913)\nwas a journalist and science fiction writer who wrote under the name Sergei Solomin. Boris Sergeevich's uncle was the famous scientist\nNikolai Egorovich Zhukovsky\nwho did pioneering work on aerodynamics.\nBoris Sergeevich was brought up by his mother and, after studying at the Oryol Bakhtin Cadet Corps\n(1901\n-\n1908)\n, he entered the Moscow Higher Technical School where he attended lectures by his uncle\nZhukovsky\n. In\n1918\nhe received a diploma in mechanical engineering and was appointed as head of the propeller-engine department at the Central Aerohydrodynamic Institute. This newly created Institute was headed by\nZhukovsky\n. He worked at the\nZhukovsky\nInstitute of Engineers and the Lomonosov Institute. He quickly gained an international reputation publishing articles on the theory of aircraft engines. In\n1926\nhis study of the\nBiot\n-\nSavart\ntheorem was published by the\nParis Academy of Sciences\n. Boris Sergeevich married Irina Nikolaevna Shilova whose father Nikolai Aleksandrovich Shilov\n(1872\n-\n1930)\n, was a professor of chemistry at Moscow University who studied reactions, catalysis, and induction and was the founder of physical chemistry in Russia. Irina Nikolaevna was also a chemist and taught in the chemistry department of Moscow State University.\nSergei Borisovich, born in Moscow on\n6\nSeptember\n1920\n, received his primary education in the family and with home tutors, and then went straight into the third grade of the\n59\nth Moscow school. This school had been founded in\n1902\nas the Medvednikovskaya gymnasium and had an excellent reputation. The family suffered a shock in\n1930\n, however, when Boris Sergeevich Stechkin was arrested in the \"Prompartiya\" case. This was a show trial in which several Soviet scientists and economists were accused and convicted of plotting a coup against the government of the Soviet Union. He was sentenced to three years in prison but, after\nSergei Alekseevich Chaplygin\n, who also worked in work in hydrodynamics and aerodynamics, bravely supported him arguing that Boris Sergeevich had not been involved in a coup against the government, he was released in\n1931\n. In December\n1937\n, when Sergei Borisovich was in his final year at the\n59\nth Moscow school, his father was arrested again. The Moscow trials were a series of show trials held by the Soviet Union between\n1936\nand\n1938\nat the instigation of Joseph Stalin. They were nominally directed against \"Trotskyists\". Sergei Borisovich's father was imprisoned and was not released until\n1943\n. This created problems for his son's education.\nDuring his first few years at the\n59\nth Moscow school Sergei Borisovich Stechkin's main passion had been for chess. By the age of fourteen he had become interested in mathematics and during his final year at the school,\n1937\n-\n38\n, he took all his chess books to a second-hand bookseller and exchanged them for mathematics books. He graduated from the\n59\nth Moscow school in\n1938\nhaving been awarded a gold certificate. This certificate meant that he could enrol in any Soviet university without sitting entrance examinations. He wanted to study mathematics at Moscow State University which had world class mathematics professors and was recognised as providing the best courses on this topic. He was refused entry to Moscow State University, however, officially \"due to lack of space and health reasons\", but the real reason was that his father was in prison. Stechkin went to Gorky in\n1938\nwhere he completed the first year course in mathematics and physics at the university.\nSergei Alekseevich Chaplygin\n, who worked in Moscow State University, knew the Stechkin family well and understood Sergei Borisovich Stechkin's potential to become a leading mathematician. He appealed to the authorities of Moscow State University to allow Stechkin to study there and in\n1939\nhe was permitted to enter the second year of the mathematics and physics course. Although World War II started in September\n1939\nwith the German and Russian invasion of Poland, this had little effect on Moscow State University. However, on\n22\nJune\n1941\nthe German armies invaded their former ally pushing rapidly east into Soviet lands. They advanced along a broad front from the Baltic to the Black Sea bringing hardship to everyone. In July\n1941\nStechkin became a fire fighter in the university fire brigade and on the night of\n23\n-\n24\nJuly he took part in extinguishing incendiary bombs that fell on the P K Sternberg Institute. This Astronomical Institute was named after astronomer Pavel Karlovich Sternberg. It was founded in\n1931\nas an Institute of Moscow State University.\nAt Moscow State University, Stechkin took lecture courses from several leading mathematicians but the lecturer who made the greatest impression on him was\nAleksandr Yakovlevich Khinchin\n. When in the fourth year of the course, in October\n1941\nhe was sent to the\nSteklov\nMathematical Institute to undertake computational work. In\n1943\nStechkin was overjoyed when his father was released from prison. This came about when the aircraft engine designer Aleksandr Aleksandrovich Mikulin\n(1895\n-\n1985)\ndeveloped a ramjet engine and wanted to create a plant to produce prototypes.  He met with Joseph Stalin who approved the idea. Mikulin convinced Stalin that he needed Boris Sergeevich Stechkin as his deputy and, in March\n1943\n, Sergei Borisovich's father was released from prison.\nThe Stalin Military Order of Lenin Academy of Armoured and Mechanised Troops\n(\nlater renamed the Malinovsky Military Armoured Forces Academy\n)\nwas a prestigious military academy in the Soviet Union. The academy had been established in\n1932\nin Moscow to train commanders, staff officers, and engineers. In\n1943\n, while still a student, Stechkin began lecturing at the Military Order of Lenin Academy. This was a demanding task since Stechkin, a young student, was lecturing to leading military men, many of whom had been honoured for their war service. Despite the difficulties, he achieved good results and was asked to continue even when senior scientists returned from the front to take up the teaching positions they had held at the Military Order of Lenin Academy before their active service.\nIn\n1944\nStechkin began graduate studies aiming at obtaining a Candidate of Science degree\n(\nequivalent to a Ph.D.\n)\n. He participated in the seminars of\nAndrey Nikolaevich Kolmogorov\n,\nDmitrii Evgenevich Menshov\n,\nNina Karlovna Bari\nand\nSergi Natanovich Bernstein\n. The seminar participants were rather different due to the war. There were other students like Stechkin who had just graduated from the Faculty of Mechanics and Mathematics but there were older men who had been forced to disrupt their studies with military service and now returned to continue their studies after a break of several years. Stechkin undertook research advised by\nMenshov\nand\nBernstein\nand, in\n1947\n, was elected to the\nMoscow Mathematical Society\n, where he presented papers that formed his first publications.\nStechkin now undertook a variety of different jobs. In the autumn semester of the academic year\n1947\n-\n48\nhe taught in the Physics and Technology Faculty of Moscow State University. Beginning on\n27\nOctober\n1947\nhe undertook applied research at Research Institute-\n4\nof the Academy of Artillery Sciences and, from the beginning of\n1948\n, he was a part-time junior fellow at the\nV A Steklov\nMathematical Institute of the\nUSSR Academy of Sciences\n. Also in\n1948\nhe submitted his thesis\nOn the order of best approximations of continuous functions\n(\nRussian\n)\nfor his Candidate of Science degree. It was examined by\nAleksandr Osipovich Gelfond\nand\nSerge Mikhalovich Nikolskii\n. His first papers began to be published:\nA generalisation of some inequalities of S B Bernstein\n(\nRussian\n)\n(1948)\n;\nOn positive bilinear forms\n(\nRussian\n)\n(1949)\n; and\nOn the order of best approximations of continuous functions\n(\nRussian\n)\n(1949)\n. This last mentioned paper was a short\n3\n-page paper stating results from his thesis without proofs. The proofs were given in a\n24\n-page paper with the same title in\n1951\n. By\n1951\nStechkin had nine papers in print.\nIn addition to this excellent work in pure mathematics, Stechkin was also producing important applied results and, over the course of two years, at the Research Institute\n4\nof the Academy of Artillery Sciences he analysed issues of external ballistics of anti-aircraft guided missiles. In April\n1949\nhe completed reports on his work\n[\n5\n]\n:-\nThe \"method equations\" proposed by S B Stechkin turned out to be a fundamentally new method of modelling and resolving issues of the kinematics of a guided missile, i.e., along with the existing specific methods of calculation and control, a general approach to the entire class of kinematic problems was developed for the first time. The art of using this approach consists in selecting such a \"method equation\" in which the transformed system of kinematic equations turns out to be implemented as an aggregate, i.e. allows for an engineering control system.\nBecause of his impressive contributions Stechkin was nominated for the rank of engineer major in the Academy of Artillery Sciences. He continued to work both there and at the\nV A Steklov\nMathematical Institute but in\n1952\nended his work for the Academy of Artillery Sciences.\nOn\n14\nMay\n1949\nStechkin married Ekaterina Ivanovna Trifonova\n(1927\n-\n1987)\n. She was a student in the Mechanics and Mathematics Department of Moscow State University at the time and was described as \"tall, stately, brown-eyed, with a long braid.\"  She played chess to a high standard and often enjoyed close matches with her husband. Sergei Borisovich and Ekaterina Ivanovna had a son Boris Sergeevich Stechkin who was born in\n1950\n.\nFrom\n1952\nStechkin worked for the\nV A Steklov\nMathematical Institute but in\n1953\nhe taught the mathematical analysis course in the Faculty of Mechanics and Mathematics of Moscow State University. He took over teaching this course from\nAleksandr Yakovlevich Khinchin\nwho had taken ill. Teaching was for Stechkin the favourite aspect of his work and he had an outstanding reputation as a lecturer\n[\n6\n]\n:-\nStechkin gave distinctly original courses on mathematical analysis, as well as numerous and diverse special courses. His lectures were rigorous, clear and bright, and infallibly proved a success with the students. The undergraduate students who attended Stechkin's lectures often went on the candidate's degrees advised by Stechkin. Under the supervision of Sergei Borisovich about\n30\nPh.D. theses were written altogether, and\n16\nof his students have become doctors of science. There were scientists from Hungary, China and Yugoslavia among Stechkin's students.\nWe have seen the title of some of his first papers above. The\n70\nth birthday paper\n[\n22\n]\ngives more details of his early work:-\nThe first phase of Stechkin's writings was concerned with the approximation of functions by trigonometric polynomials. He generalised the direct and inverse theorems of the theory of approximations to moduli of continuity of arbitrary order, compared the precise orders of descent of best approximations of functions and their moduli of continuity, and investigated the connection between the best approximations of functions and their derivatives.\nIn\n1936\none of\nKolmogorov\n's essays was published, in which he introduced the concept of the width of a class of functions and found the widths of certain classes for approximations in the metric\nL\n2\nL_{2}\nL\n2\n​\n. The next publication on width was the article by Stechkin which came out in\n1954\n. In this article certain results known at the time were interpreted as theorems on widths and it was shown that the order of descent of the widths of classes of differential functions\nW\nr\n,\nr\n=\n1\n,\n2\n,\n.\n.\n.\nW^{r}, r = 1, 2, ...\nW\nr\n,\nr\n=\n1\n,\n2\n,\n.\n.\n.\n, for approximations in the metric\nC\nC\nC\nis reached by trigonometric polynomials\n(\nit was later shown that the subspace of trigonometric polynomials is extremal in this case\n)\n.\nMost of Stechkin's career was spent in Moscow working at the\nV A Steklov\nMathematical Institute and lecturing at Moscow State University. He did spend one lengthy period away from Moscow and this came about in the following way. Stechkin's father rented a dacha in Abramtsevo, north of Moscow, from the spring of\n1954\n. The whole Stechkin family would spend time at the dacha which was close to a dacha rented by\nIvan Matveevich Vinogradov\nand his sister Nadezhda Matveyevna. The Stechkin and\nVinogradov\nfamilies spent time together, in particular they played vint together. Vint is a Russian card game similar to both bridge and whist and sometimes called Russian whist. These informal meetings between the families was an excellent opportunity to share ideas and Stechkin told\nVinogradov\nthat he thought the\nUSSR Academy of Sciences\nshould create a new institute where fundamental research could be carried out supported by the most powerful computers available.\nVinogradov\nliked the idea and, always being an advocate for the development of mathematics in the provinces, he suggested Stechkin travel the country looking for a suitable site.\nStechkin's travels took him to Lake Baikal, Novosibirsk, Kazan, Kungur, Saratov, Kuibyshev and Sverdlovsk. He eventually chose Sverdlovsk, partly because it was an important industrial centre and partly because it had two universities, the Ural State University and the Ural Polytechnic Institute, both of which had strong mathematics departments.\nVinogradov\nliked Stechkin's proposal and sought support from other members of the\nUSSR Academy of Sciences\n. By\n1956\nthe proposal to organise the Sverdlovsk branch of the\nSteklov\nMathematical Institute was accepted and for the ten years,\n1957\n-\n1967\n, Stechkin worked as deputy director of the\nSteklov\nMathematical Institute for the Sverdlovsk branch. He was involved in the construction of the building, recruiting staff, obtaining the most powerful computers and building up the library.\nThe\nSteklov\nMathematical Institute for the Sverdlovsk branch became the Institute of Mathematics and Mechanics of the Ural Branch of the\nRussian Academy of Sciences\n. In\n1964\n, Stechkin organised and became the head of the Department of the Theory of Approximation of Functions. Even after he left Sverdlovsk in\n1967\nand returned to Moscow he retained his role of head of the Department of the Theory of Approximation of Functions and made occasional visits to Sverdlovsk to support staff and students and to give lectures. He organised summer schools, the first in\n1971\nheld near Sverdlovsk. In fact he organised twenty such summer schools, the last being in\n1995\n, always in different locations but predominately in the Urals. Each lasted between ten and fourteen days and were attended by professors, graduate students and even final year undergraduates. These were friendly events, everyone had the opportunity to speak, and Stechkin set the tone of the meetings.\nBack in Moscow in\n1967\nStechkin launched a new journal\nMatematicheskie Zametki\n, also known as\nMathematical Notes\n. Volume\n1\nappeared in\n1967\nwith\n83\npapers in the volume, three of which were by Stechkin himself. These three papers were:\nDistribution of zeros of polynomials\n(\nRussian\n)\n;\nBest approximation of linear operators\n(\nRussian\n)\n; and\nInequalities between upper bounds of the derivatives of an arbitrary function on the half-line\n(\nRussian\n)\n. Volume\n2\nalso appeared in\n1967\nwith\n80\npapers and, each year between\n1967\nand\n1991\ntwo volumes each of six issues, were published.\nStechkin was editor-in-chief for the first twenty years of publication. His aim was to publish short but interesting papers. He set himself a list of principles to which he rigidly adhered. Papers had to be original works with complete proofs. All employees and members of the editorial board had the responsibility of ensuring continuous publication. The level of acceptance for papers had to be at least up to \"world\" standard or better. Young mathematicians had to be be helped with their first publications, not by lowering standards, but by giving them assistance to reach the required standard. The language of the journal should be simple, clear, and distinct.\nTo see Stechkin's advice to young mathematicians on how to write a mathematics paper, see\nTHIS LINK\n.\nLet us quote from\n[\n5\n]\nto give a flavour of Stechkin's published research:-\nStechkin's scientific interests related to the problems of mathematical analysis, geometry of\nBanach\nspaces and number theory. Let us briefly note the issues that he studied.\nStechkin's works on mathematical analysis are devoted to the theory of approximation of functions, trigonometric and orthogonal series, and extremal properties of functions. He established the now classical direct and inverse theorems of approximation theory in terms of moduli of continuity of arbitrary order, obtained the first results on\nKolmogorov\nwidths in the uniform metric, and the most complete results on the asymptotics of approximations of classes of differentiable functions by\nFourier\nsums. Stechkin proved a criterion for the absolute convergence of\nFourier\nseries of individual functions. Here, the main difficulty was in finding the terms in which this criterion is formulated.\nSergei Borisovich, his students, and followers constructed a theory of best approximations of unbounded operators by bounded ones, which has direct connections with the theory of ill-posed problems. Together with\nNikolai Vladimirovich Efimov\n, Stechkin developed a geometric theory of approximations in\nBanach\nspaces. At the same time, a number of new approximative concepts were introduced, which turned out to be useful in other issues. He established a new logarithmic estimate for the zeros of the\nRiemann\nzeta function, obtained a strengthening of\nIvan Matveevich Vinogradov\n's mean value theorem and unimprovable estimates for complete rational trigonometric sums.\nTogether with Yurii Nikolaevich Subbotin\n(1936\n-\n2021)\n, Stechkin wrote the first monograph in Russian on the approximation of functions by splines, which contributed to the development of spline research in the USSR and their introduction into the practice of computational mathematics.\nThe book with Subbotin was\nSplines in numerical mathematics\n(\nRussian\n)\n(1976)\n. Subbotin had been a student in Sverdlovsk who was recruited into the postgraduate programme by Stechkin. He had worked as an assistant at the Department of Function Theory of Ural State University from\n1961\nto\n1964\n[\n24\n]\n:-\nThe first monograph in Russian on spline theory was published in\n1972\n. It was \"The Theory of Splines and Their Applications\" by J H Ahlberg, E N Nilson and\nJ L Walsh\n. The translation from English was made by Subbotin and edited by Stechkin, and the monograph was supplemented with additional sections written by them. After the publication of this book, the term \"spline\" became firmly established in the Russian mathematical literature. Starting from the\n1960\ns, splines gained popularity in computational practice as a means of an approximate representation of functions, curves, and surfaces as well as a tool for smoothing experimental data. The successful development of splines and their applications in various studies were promoted by the publication in\n1976\nof Stechkin and Subbotin's monograph \"Splines in Computational Mathematics\", which focused on the specific properties of splines important for their application in numerical analysis.\nCarl R de Boor, reviewing this book writes\n[\n8\n]\n:-\nThe book is intended as a supplement and complement to the book by J H Ahlberg, E N Nilson and\nJ L Walsh\nand stresses the contributions of Soviet mathematicians. Thus, much room is given to a detailed analysis of parabolic spline interpolation\n(\nalso in several variables\n)\nwith special emphasis on sharp error estimates, and the analysis of spline interpolation at the integers\n(\ncardinal splines\n)\nfollows Subbotin's\n(\nrather than\nSchoenberg\n's\n)\ntreatment. Splines of degree higher than cubic appear only with uniformly spaced knots and B-splines appear only with simple knots\n(\nand their recurrence relation appears not at all\n)\n.\nStechkin's wife, Irina Nikolaevna Stechkina, made translations of French mathematical texts into Russian starting around\n1964\n. From the early\n1970\ns she worked at the \"Soviet Encyclopaedia\", and then at the publisher \"Nauka\" while continuing to translate French mathematical books into Russian. The couple divorced and, in\n1978\n, Stechkin married the mathematician Tatyana Vasilievna Radoslavova who worked at Moscow State University. They had two daughters, Alexandra and Valeria\n[\n5\n]\n:-\nThe years of his second marriage were a time of special warmth and care with which Sergei Borisovich was surrounded. The\nSteklov\nMathematical Institute gave him a new apartment, where the academic husband and loving father could live and work in peace. He loved to travel with his children. He always took his daughters to summer schools in the Urals, and in recent years he repeatedly went on business trips abroad with his son Sergei Borisovich Stechkin.\nIn\n1993\nStechkin was awarded the\nChebyshev\nPrize of the\nRussian Academy of Sciences\nfor his work on the theory of approximations. In July\n1995\nhe was diagnosed with cancer. After an operation and a course of radiotherapy he tried to return to his work and held a summer school in Moscow State University in August\n1995\n. In September the Steklov Institute of Mathematics celebrated his\n75\nth birthday. Although determined to carry on his mathematical work, his illness grew steadily worse and he was taken to hospital. He died on the morning of\n22\nNovember\n1995\n.",
  "matematicos_citados_na_biografia": [
    "Nikolai Egorovich Zhukovsky",
    "Zhukovsky",
    "Biot",
    "Savart",
    "Paris Academy of Sciences",
    "Sergei Alekseevich Chaplygin",
    "Aleksandr Yakovlevich Khinchin",
    "Steklov",
    "Andrey Nikolaevich Kolmogorov",
    "Dmitrii Evgenevich Menshov",
    "Nina Karlovna Bari",
    "Sergi Natanovich Bernstein",
    "Menshov",
    "Bernstein",
    "Moscow Mathematical Society",
    "V A Steklov",
    "USSR Academy of Sciences",
    "Aleksandr Osipovich Gelfond",
    "Serge Mikhalovich Nikolskii",
    "Kolmogorov",
    "Ivan Matveevich Vinogradov",
    "Vinogradov",
    "Russian Academy of Sciences",
    "THIS LINK",
    "Banach",
    "Fourier",
    "Nikolai Vladimirovich Efimov",
    "Riemann",
    "J L Walsh",
    "Schoenberg",
    "Chebyshev"
  ],
  "imagens": [
    "stechkin.jpg"
  ]
}