{
  "nome_completo": "Lancelot Stephen Bosanquet",
  "nome_curto": "Stephen Bosanquet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bosanquet/",
  "data_nascimento": "26 December 1903",
  "local_nascimento": "St. Stephen's-by-Saltash, Cornwall, England",
  "data_morte": "10 January 1984",
  "local_morte": "Cambridge, England",
  "summary": "Stephen Bosanquet was an English mathematician who worked in analysis, especially Fourier series.",
  "biografia": "Stephen Bosanquet\n's father was  Claude Charles Courthope Bosanquet\n(\nborn in St Osyth, Essex about\n1863)\na clergyman living at the Vicarage, Linkinhorne, Callington, Cornwall in\n1911\n, and his mother was Millicent Percy Bosanquet\n(\nborn in Weymouth, Dorset about\n1869)\n. The parents were married in\n1892\n.\nBosanquet was educated at Balliol College, Oxford, and his doctorate, which was supervised by\nHardy\n, was awarded in\n1929\n. As well as his D.Phil. from Oxford, he was awarded a D.Sc. in\n1935\n. Bosanquet's early\n1930\ns papers were on series and integration, a\n1930\npaper being on fractional integration, a topic he would return to many times.\nBosanquet married Isabel Mary Linfoot\n(\nborn in Sheffield\n25\nSeptember\n1906)\nin\n1936\n. Isabel was the daughter of George Edward Linfoot, a mathematics and music master in a secondary school, and Laura Edith Linfoot. Isabel died in Cambridge in November\n1992\n.\nBosanquet's first and only appointment was to University College, London. He was appointed in\n1929\nas a Lecturer, becoming a Reader in\n1936\n, and finally a Professor in\n1966\n. He retired in\n1971\nand some time later moved from London to Cambridge. He spent a few periods away from London, however, during his career. For example he was a visiting professor at the University of Utah during\n1964\n-\n65\nwhere he gave a major lecture series on\nThe history and development of the theory of divergent series and integrals\n. During\n1969\n-\n70\nhe visited the University of Western Ontario and gave another major lecture series, this time on\nMatrix\ntransformations and sequence spaces with applications to summability\n.\nA strong supporter of the\nLondon Mathematical Society\n, Bosanquet was secretary to the Society from\n1947\nto\n1951\n. He was Vice-President from\n1950\nto\n1954\nand, over the similar period\n1951\n-\n55\n, he was editor of the\nJournal of the London Mathematical Society\n.\nBosanquet wrote many papers on the convergence and summability of\nFourier series\n. He also wrote on the convergence and summability of\nDirichlet\nseries and studied specific kinds of summability such as summability factors for\nCesàro\nmeans. His later work on integrals include two major papers on the\nLaplace\n-\nStieltjes\nintegral published in\n1953\nand\n1961\n. Other topics he studied included inequalities, mean-value theorems, Tauberian theorems, and convexity theorems. He repaid\nHardy\nfor starting him out on his mathematical career\n[\n1\n]\n:-\nHe saw\nHardy\n's great book 'Divergent Series' through the press during\nHardy\n's last illness and he later edited the volume on 'Series' in\nHardy\n's Collected Works; he was chief editor for the last two of the seven volumes.\nOver a period of\n30\nyears, Bosanquet supervised\n19\nstudents for their doctorate. He had a reputation for being a excellent supervisor who was always ready to offer help and advice to his students but still encouraged them to find directions of their own.\nC A Rogers\n, one of his students, writes in\n[\n1\n]\n:-\nHe was an extremely generous mathematician, always striving to help and encourage his students to sharpen their ideas.\nIn\n[\n2\n]\nRussell talks about Bosanquet's writing and lecturing skills saying:-\nBut if his papers show a meticulous observance to accuracy down to the last comma, he often cast caution aside in his letters and his lectures, and one could obtain from these the flavour of heuristic which showed his mind at work. He drew his audience along with him, inviting them to contradict him or suggest a different direction.\nIn\n[\n1\n]\nhis mathematical generosity is emphasised:-\nHe was an extremely generous mathematician always striving to help and encourage his students to develop and sharpen their ideas. Indeed, he would help anyone who sent him a mathematical manuscript in this way.",
  "matematicos_citados_na_biografia": [
    "Hardy",
    "Matrix",
    "London Mathematical Society",
    "Fourier series",
    "Dirichlet",
    "Cesàro",
    "Laplace",
    "Stieltjes",
    "C A Rogers"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}