{
  "nome_completo": "Stephen Parkinson",
  "nome_curto": "Stephen Parkinson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Parkinson/",
  "data_nascimento": "1 August 1823",
  "local_nascimento": "Keighley, Yorkshire, England",
  "data_morte": "2 January 1889",
  "local_morte": "Newnham, Cambridge, England",
  "summary": "Stephen Parkinson became famous when he was Senior Wrangler, pushing William Thomson into second place. He had a highly successful career at a lecturer and tutor at St John's College Cambridge.",
  "biografia": "Stephen Parkinson\nwas the son of the land agent Stephen Parkinson\n(1781\n-\n1832)\nand Malley Ogden\n(1785\n-\n1859)\n.\n(\nWe note that several sources give Stephen's mother's name incorrectly as Mary.\n)\nHe was baptised on\n7\nSeptember\n1823\n. Stephen Parkinson Sr died in December\n1832\nwhen his son was nine years old and Stephen was brought up by his mother Malley and older sisters, Elizabeth, Sarah and Mary. In fact Stephen, the subject of this biography, was the seventh of his parents' eight children\n[\n1\n]\n:-\nFrom boyhood he formed habits of regular and hard work; to these as he grew older he added great rapidity, but a rapidity combined with marvellous clearness and accuracy.\nHe attended Keighley Grammar School and was then prepared to sit the University of Cambridge entrance examinations by Rev James Cheadle, the vicar of All Souls, Bingley. Parkinson sat the examinations for a\nSizarship\nat St John's College, Cambridge in\n1841\n.\nEdward Routh\nwrites\n[\n11\n]\n:-\nOne of his competitors, who sat just in front of him at this examination, still remembers with wonder how he finished his papers long before the others, and how he sat at his ease with his back against the wall for a long time. The success with which he thus began his college life was due to his own energy and talent, for as a boy he had but limited opportunities for study, and the same energy carried him on successfully throughout his life.\nBowling writes in\n[\n1\n]\n:-\nIn after years he used often to tell with much merriment, as an instance of the fatherly manner with which Dr\nHymers\ntreated his pupils, that after the examination the Doctor said to him, \"Parkinson, I'm so pleased with your Algebra paper that I'm going to make you a present of thirty shillings.\"\nParkinson was admitted to St John's College on\n25\nFebruary\n1841\nand matriculated in the Michaelmas tern\n(\nOctober\n1841)\n. He studied the Mathematical Tripos with\nJohn Hymers\nas his tutor. He soon showed himself to be exceedingly able and diligent, and his Sizarship was changed to a Foundation Scholarship. There was another quite outstanding student who had matriculated at the same time as Parkinson at Peterhouse, namely\nWilliam Thomson\n. As the Tripos examinations approached in\n1845\n, Parkinson saw\nWilliam Thomson\nas his greatest rival but it is unlikely that\nThomson\nconsidered Parkinson any threat to his being Senior\nWrangler\n.\nCharles Astor Bristed, the author of\n[\n2\n]\n, was an American who studied at Cambridge at the same time as Stephen Parkinson and\nWilliam Thomson\n. While at Cambridge, Bristed sat the Mathematical Tripos examinations in the same year as Stephen Parkinson and\nWilliam Thomson\nand, in the book\n[\n2\n]\n, describes the surprising outcome of Parkinson being Senior Wrangler. Parkinson:-\n... suddenly came up with a rush like a dark horse, and having been spoken of before the Examination only as likely to be among the first six, now appeared as a candidate for the highest honours. Samuel Earnshaw was one of the first that had a suspicion of this, from noticing on the second day that he wrote with the regularity and velocity of a machine, and seemed to clear everything before him. And on examining the work he could scarcely believe that the man could have covered so much paper with ink in the time\n(\nto say nothing of the accuracy of the performance\n)\n, even though he had seen it written out under his own eyes. By-and-by it was reported that the Johnian\n[\nParkinson\n]\nhad done an inordinate amount of problems, and then his fellow-collegians began to bet odds on him for Senior Wrangler.\nFor a longer extract from\n[\n2\n]\ndescribing the contest between Parkinson and\nThomson\nto be Senior Wrangler, see\nTHIS LINK\n.\nThe Tripos examinations ran from\n1\nJanuary to\n7\nJanuary\n1845\n. The examiners were Samuel Blackall\n(1816\n-\n1899)\nof St John's College, Harvey Goodwin\n(1818\n-\n1891)\nof Caius College,\nRobert Leslie Ellis\nof Trinity College and John Sykes of Pembroke College. There were twelve papers, two and a half hour papers each morning and three hour papers each afternoon. There was considerable variation on the number of questions on the papers, in fact between eight and twenty-four questions. The first two papers had a rubric stating that the differential calculus must not be used in solving the problems, but the differential and integral calculus could be used on the other ten. Of the twelve papers, the first ten had large amounts of bookwork with attached problems, while the final two papers, designed to separate the few top Wranglers, were headed \"Problems.\" Parkinson was well ahead of\nThomson\non the first ten papers and, although\nThomson\ndid slightly better than Parkinson on the two \"Problem\" papers, it was nowhere near enough to overturn Parkinson's lead. Parkinson was Senior Wrangler with\nThomson\nSecond Wrangler.\nThe examinations for the Smith's Prize were held a week after the Tripos results were announced. This examination was much more demanding of research ability than the Tripos and speed, so essential in the Tripos, was hardly a factor. There were four papers, each having a high proportion of applied mathematics problems on statics, dynamics, elasticity, the wave theory of light, astronomy and the steam engine. Again\nThomson\nand Parkinson competed for the prizes, this time\nThomson\ncoming out on top but Parkinson, who was\n2\nnd Smith's Prizeman, was well ahead of any of the other competitors.\nWe have gone into quite a lot of detail concerning Parkinson's undergraduate career, but this really was, in many ways, the highlight of his whole career. It is certainly the thing for which he is best known today and there are a great many books and papers which describe this event, almost all based on Bristed's account. He did, however, go on to make important contributions to teaching at St John's College and many students benefitted from his conscientious approach. He became highly respected by both his fellow staff members and by his students. He began taking private pupils even before he sat the Tripos examinations and he became a highly successful coach.\nIn March\n1845\nhe was made a Fellow of St John's College. He was appointed as Assistant Tutor\n(\ni.e. Lecturer\n)\nin\n1849\n, and Tutor in\n1864\n. During the nineteen years between\n1845\nand\n1864\n, as a private tutor he looked after\n990\npupils who matriculated under him. Among these were William Henry Besant, Senior Wrangler in\n1850\n,\nThomas Bond Sprague\n, Senior Wrangler in\n1853\n,  Leonard Courtney, Second Wrangler in\n1855\n, and Gerard Brown Finch, Senior Wrangler in\n1857\n.\nParkinson was a great hoarder and he saved a huge bank of Examinations Papers sat by his students. St John's College Library contains nineteen notebooks containing mathematical notes and examples, almost certainly used by Parkinson for coaching students. Topics covered include:\nNewton\n, dynamics, hydrostatics, tides, statics, instruments, undulatory theory, mechanics, and planetary theory.\nHe was Examiner for the Mathematical Tripos in\n1849\n, and Moderator of the Mathematical Tripos in\n1852\n. In\n1864\nhe was appointed as a College Tutor, succeeding the Rev Joseph B Mayor.\nRouth\nwrites\n[\n11\n]\n:-\nHe looked after his pupils in a business-like way, with mingled firmness and kindness, and they reciprocated by giving him their confidence. Some of them afterwards described how kindly he had assisted them with their means, and by his influence started them successfully on their journey through life. His remembrance of his pupils did not come to an end when they passed from his care, but he and they remained mutual friends. In this way he became well known outside the University, his name and influence attracting many students to the College.\nIt was common practice in these times for Fellows to become ordained. For many, this provided for a future when they could marry\n(\nwhich they could not do as Fellows\n)\n. Parkinson began following this route being ordained at Ely in\n1845\nand then being appointed as a curate in the neighbouring village of Bottisham. He found, however, that his duties in the College meant that he could not devote much time to his clerical career. He did take further divinity degrees, with the award of a B.D. in\n1855\nand he became a Doctor of Divinity in\n1869\n. The Rev Edward W Bowling writes\n[\n1\n]\n:-\nThough a Doctor of Divinity, and true to the doctrines and ordinances of the Church of England, he rarely appeared as a preacher. Those who knew his inner life knew that this was not the result of inertness, much less of any doubts, or want of reverence for the teaching of his Church. He was an unfaltering believer, but he felt the truths of religion so deeply, and found it so hard to hide his emotion when handling them, that he shrank from preaching them. This may be regretted; we could have wished that his clear brain and logical powers had been more often employed in maintaining the faith which he held so firmly, but it is due to his memory that the real cause of his so seldom preaching should now be known. That he at one time intended to fit himself for parochial work is shown by the fact, not widely known, that soon after his ordination he held for a year the Curacy of Bottisham.\nParkinson wrote two books,\nAn Elementary Treatise on Mechanics\n(1\nst edition\n1855\n,\n6\nth edition\n1881)\nand\nA treatise on Optics\n(1\nst edition\n1859\n,\n4\nth edition\n1884)\n. The mechanics book was subtitled, \"For the use of the Junior Classes at the University and the Higher Classes in Schools, with A Collection of Examples.\" He writes in the Preface to sixth edition to this mechanics book, published in\n1881\n:-\nIn preparing a new edition of this work I have kept the same object in view as I had in the former editions, - namely, to include in it such portions of Theoretical Mechanics as can be conveniently investigated without the use of the Differential Calculus and so render it suitable as a manual for the Junior Classes in the University and the Higher Classes in Schools. With one or two short exceptions, the Student is not presumed to require a knowledge of Mathematics beyond the elements of Algebra, Geometry and Trigonometry.\nMotion on a Curve, which is treated of in the last Chapter of the Dynamics, does not seem to admit of any complete discussion without the aid of the Differential Calculus; but in consequence of the present requirements of the Senate-House Examinations, I have put together those theorems respecting cycloidal oscillations and curvilinear motion which admit of a tolerably simple Geometrical exposition.\nThe Preface to the optics book begins:-\nThe present work may be regarded as a new edition of the Treatise on Optics by the Rev W H Griffin, which being some time ago out of print, was very kindly and liberally placed at my disposal by the Author. I have freely used the liberty accorded to me, and have rearranged the matter with considerable alterations and additions - especially in those parts which required more copious explanation and illustration to render the work suitable for the present course of reading in the university. The numerous diagrams which the subject requires have been inserted in the body of the work, instead of being collected in plates at the end, and are thus rendered more convenient for reference.\nI have appended a collection of examples and problems - distributed under the heads of the several chapters, as well as a miscellaneous set, - which are sufficiently numerous and varied in character to afford a useful exercise for the student: for the greater part of them I have had recourse to the Examination papers set in the University and the several Colleges during the last twenty years.\nRouth\nwrites the following about these books in\n[\n11\n]\n:-\nDr Parkinson was not a writer of many books. His treatises on Elementary Mechanics and on Optics were published while engaged in tuition. They do not contain any novelties, but were written because experience had shown him that students had found difficulties in these subjects, which he thought he could remove. Their commercial success is therefore a good test of their excellence, and of this there can be no doubt. They came into general use in the University, and for several years they were very generally read. They each passed through several editions.\nHe was elected a Fellow of the\nRoyal Astronomical Society\nat the meeting held on\n11\nMarch\n1853\nwith\nG B Airy\n, the President, in the Chair. He was elected to the\nRoyal Society of London\non\n2\nJune\n1870\n. He was elected President of St John's College in\n1865\nand he was elected a Member of the Council of the Senate of the University in\n1866\n.\nA new chapel for St John's College was consecrated on\n12\nMay\n1869\n[\n12\n]\n:-\nPainted glass has been provided for a side window by Rev S Parkinson, D.D., Senior Fellow, President and Tutor. ... At the service of consecration Dr Parkinson, Senior Fellow and President, read the Gospel. ... Dr Parkinson supported the Master at the Collation in the hall after the Consecration.\nIn\n1872\nThe Eagle\nreported that \"a new stained glass window has been fixed in the Chapel, on the south side, the gift of Dr Parkinson,\" and in\n[\n13\n]\nthere is further details of his gift:-\nLast of all, up to the present time, comes Dr Parkinson's gift, and perhaps this is the best of the series. The subjects are, The Council at Jerusalem\n(\nActs xv.\n6\n; Gal. ii.\n9)\n; and Peter and John at Samaria\n(\nActs viii.\n14)\n. Compared with some of the others, this is a very fine piece. The lights are well placed, and the eye led up to the points. There is a breadth of colour and brilliancy, and grandeur of effect in a simple way that are enchanting. This is a work of art, the genius displayed in it amply excuses the free use of shadow and consequent opacity that has been necessary, and ranks this work very high among modern windows. The window bears the following inscription: \"In Piam Memoriam Fratris Dilectissimi P.C. Stephanus Parkinson S.T.P. Coll. Soc. A.S. MDCCCLXXI.\"\nIn\nThe Eagle\n7\n(\nMichaelmas\n1871)\n, it was reported:-\nDr Parkinson no longer President and no longer a Fellow since he has married.\nHe had married Elizabeth Lucy Whateley, the daughter of the solicitor John Welchman Whateley and his wife Lucy Spooner of Edgbaston Hall on\n15\nAugust\n1871\n[\n1\n]\n:-\n... to which marriage he was indebted for many happy years and for the constant care and devotion which softened the sufferings of the later period of his life. Though ready to resign his Tutorship, he was not a man whom a College mindful of its own interests could part with, and, yielding to the strong wish expressed by the governing body of the College, he continued to be Tutor till\n1882\n.\nIt is interesting that the record of the marriage gives Parkinson's occupation as \"Clergyman.\" In the\n1881\ncensus he gives his \"Rank, Profession, or Occupations\" as \"Doctor of Divinity.\" The census records that Stephen and Elizabeth Lucy Parkinson have four servants, a cook, a lady's maid, a house maid and a kitchen maid.\nIt is recorded in\nThe Eagle\nin\n1863\n[\n7\n]\n:-\nDr Parkinson resigned his Tutorship at the end of the last academical year. ... Dr Parkinson's life since coming up as a freshman has been passed in connexion with the college, and we are glad to say that he now retires from tutorial work in good health, and with continued interest in the College and University affairs. Early this year Dr Parkinson was elected to the Fellowship vacant by the death of Professor Palmer, and at once placed himself under Statute XXV, according to which, under certain conditions, and fellow may become a Supernumerary Fellow \"enjoying all benefits and advantages, save and except that of being entitled to dividend.\" It may be noticed, that this makes our number of actual Fellows fifty-seven, though there are still for some purposes only fifty-six Fellowships. Besides thus continuing a member of the Governing Body of this College, Dr Parkinson takes a part in University matters as a member of several of the University Boards. A large number of pupils have just presented to Dr Parkinson a handsome and costly gift as a token of goodwill and kindly remembrance. These will be valued\n(\nas Dr Parkinson has written to his old pupils\n)\n\"as long as I shall be able to value anything in this life.\" The present consists of a dessert-set of six handsome silver dishes, together with a neat silver inkstand for Mrs Parkinson.\nParkinson continued to take part in University committees:\nThe Eagle\nreported in\n1886\nand\n1887\n:-\nDr Parkinson and Professor Liveing have been elected Members of the Financial Board. ... Dr Parkinson and Mr Scott have been appointed members of the Watch Committee.\nSoon after his, however, his health deteriorated and stopped him from undertaking duties he would have wanted to take part in. In\n1888\nthe following was reported in\nThe Eagle\n[\n14\n]\n:-\nOn June\n18\n, the foundation-stone for a new church in Chatham Street, Rodney road, Walworth by the Master. ... Later in the afternoon the Master presided at a cold collation at the Cannon Street Hotel. ... Professor J F B Mayor prefaced his remarks by reading a letter from Dr Parkinson who, while regretting that through ill health he had been unable to be present that day, showed his great interest in the new church by making a contribution of £\n500\ntowards the building fund. ... Already several handsome presents have been received towards furnishing the church ... Mrs Parkinson the communion table ...\nThe end of his life is described in\n[\n1\n]\n:-\nFor the last year of his life the state of his health had caused grave anxiety to his friends; but on his return to Cambridge in October last, after a visit of some months to Eastbourne, he seemed to have regained much strength. Towards the end of the year the serious illness of one very dear to him was a shock too heavy for his weakened powers. On the afternoon of Sunday, December\n30\n, he attended as usual the service in St Botolph's, his parish church; the next day he complained of feeling not quite well; on Tuesday he kept his bed; and on Wednesday about eleven in the forenoon he passed away with scarcely a sigh. His wish had been to be buried in Grantchester churchyard, but that being impossible he found a fit resting-place by the side of his friend Dr Bateson in the quiet churchyard of Madingley. The first part of the burial service was conducted in the College Chapel, and those who were present will long remember the sweet pathos of the music and the solemnity of the service; the rendering of his favourite hymn, Rock of Ages, especially touched the mourners, as he whom they mourned had repeated it on the last night of his earthly life.\nFinally, let us quote from\n[\n1\n]\nregarding Parkinson's character:-\nThe qualities which in private life endeared him to so many friends were to no small extent the same which won him success in his College and his University. .. The Doctor's\" opinion was on many points regarded as almost infallible by those who consulted him. \"I consider him the ablest man all round that I have ever known; the man whose opinion on nearly every subject I valued more than that of anyone else\" - was the verdict of one of his friends, who, having been himself one of the most successful of Cambridge Tutors, was no mean judge of men. Nor is this verdict to be wondered at. The same accuracy of thought and expression which distinguished him as a student and a teacher followed him into private life. Few things disturbed his usually genial and tolerant mind more than any looseness of expression. Inaccuracy of thought and unsoundness of argument were to him as a red rag to a bull. ... Few men worked harder than he or better .... He enjoyed work while he was working, and he worked thoroughly; but few men enjoyed better the quiet and repose of social life. It may be that, in an age which is somewhat disposed to deify the mere love of work for its own sake, those deserve the most praise who work hard from a sense of duty, and not from the restless craving for employment which almost amounts to gluttony. ... Some points of Dr Parkinson's character will be best brought out by reference to some of the letters written after his death by those who knew him well. One states the case of a pupil who, in consequence of pecuniary losses, would have been unable to finish his University course if Dr Parkinson had not supplied his need, and enabled him to stay in College till he had taken his degree. ... While he encouraged to the utmost his more promising pupils, the blunders and ignorance of those who did their best never provoked him to impatience. But it was a dangerous thing to presume upon this courtesy; the kindest of men, he held the reins lightly but firmly, and those who by wilful misconduct provoked him to use the lash seldom forgot the punishment, or cared to have it repeated. His loss will be deeply felt in his College and University, though ill-health had for some time prevented him from taking an active part in public affairs; and he will be missed also in the town, in which he had done good service as a magistrate. The grief of his friends will be lasting. The veil of domestic sorrow is too sacred to be lifted; but no memoir of Parkinson could omit all mention of the unselfish and loving nature which made him the most devoted of husbands and brothers, and as true as steel to all whom he called his friends.",
  "matematicos_citados_na_biografia": [
    "Sizarship",
    "Edward Routh",
    "Hymers",
    "John Hymers",
    "William Thomson",
    "Thomson",
    "Wrangler",
    "THIS LINK",
    "Robert Leslie Ellis",
    "Thomas Bond Sprague",
    "Newton",
    "Routh",
    "Royal Astronomical Society",
    "G B Airy",
    "Royal Society of London"
  ],
  "imagens": []
}