{
  "nome_completo": "Steven Alan Orszag",
  "nome_curto": "Steven Orszag",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Orszag/",
  "data_nascimento": "27 February 1943",
  "local_nascimento": "Manhattan, New York City, New York, USA",
  "data_morte": "1 May 2011",
  "local_morte": "New Haven, Connecticut, USA",
  "summary": "Steven Orszag was an American mathematician who specialised in the areas of computational fluid dynamics, turbulence theory and numerical analysis.",
  "biografia": "Steven Orszag\n's father, Joseph Orszag was a lawyer. The family were Jewish and originally from Hungary with Steven's paternal grandparents Alex and Regina Orszag both being born in Hungary. Alex\n(\nborn\n1876)\nand Regina\n(\nborn\n1886)\nemigrated to the United States in\n1903\nand settled in Manhattan, New York City. Joseph, born in New York on\n4\nFebruary\n1910\n, was the third of Alex and Regina's children. Joseph married Rose\n(\nborn\n26\nJuly\n1909)\nand their son Steven was born in Manhattan. However, he was brought up in Forest Hills, a residential area of Queens, New York City, where he attended Forest Hills High School. In\n1959\nhe was one of the nine prize winners in the Society of Actuaries' Preliminary Actuarial Examination. When he took the examination, Orszag was still at Forest Hills High School but the other eight winners were all much older and university undergraduates.\nBeginning his studies at the Massachusetts Institute of Technology in\n1959\n, when only sixteen years old, he graduated with a B.S. in\n1962\n. Still only nineteen years of age, he set sail for England where he spent the academic year\n1962\n-\n63\nstudying at St John's College, Cambridge University. Returning to the United States, he began his graduate studies in\n1963\nat Princeton University. His thesis advisor was\nMartin David Kruskal\nwho was Professor of Astronomy at Princeton but, when Orszag began his graduate studies,\nKruskal\nwas also a member of Project Matterhorn, which today is known as the Princeton Plasma Physics laboratory. Orszag completed his doctoral thesis\nTheory of Turbulence\nwithin three years and was awarded a Ph.D. in\n1966\n. Orszag, in collaboration with his thesis advisor, published a paper in\n1966\nwith the same title as his thesis. Even before he began undertaking research at Princeton he had become engaged to Reba Karp, the announcement of the engagement appearing in the New York Times on\n25\nAugust\n1963\n. Reba, the sister of Joel Karp, was the daughter of Gertrude Herskowitz and Jack Karp. Steven and Reba were married on\n21\nJune\n1964\n; they had three sons J Michael Orszag, Peter Richard Orszag and Jonathan Marc Orszag. Peter Orszag became an economist and served as an advisor to President Clinton, then as budget director for President Obama.\nIn\n1967\nOrszag was appointed as a professor of applied mathematics at the Massachusetts Institute of Technology. At MIT he was a colleague of Carl M Bender and together they collaborated on a graduate level mathematics course for seven years. Bender said\n[\n3\n]\n:-\n[\nThe course\n]\nwas so popular that a lot of students from Harvard came to take it as well. A course that good really wasn't offered at Harvard.\nThe lecture notes from the course were published as the textbook\nAdvanced mathematical methods for scientists and engineers\n:\nAsymptotic Methods and Perturbation Theory\n(1978)\n. Vadim Komkov writes in a review:-\nThis book is not the usual \"mathematical methods for engineers\" text, which could contain, according to the taste of its author, almost any elementary, or intermediate level topic in analysis, linear algebra, numerical analysis, game theory, systems theory, functional analysis, probability, statistics, or even logic, generally with little cohesion among the different parts of such a mixture. Here the authors intend to introduce the engineering or physics student to asymptotic and perturbation analysis, specifically concentrating on obtaining answers to problems which arise in physics. ... This book contains a wealth of solved problems and of techniques for approximating the exact solutions. It is a suitable text for a \"topics\" course, but it is a valuable addition to the library of any applied mathematician who is practicing his art by trying to solve physical problems.\nChambers writes in a review in\nThe Mathematical Gazette\n[\n1\n]\n:-\nThe title of this volume is somewhat misleading in that the subjects discussed are approximate analytic solutions of ordinary differential and difference equations, and no other topics are considered. ... This is a very good book. The text reads well and, as the blurb states, \"this book stresses care rather than rigor\". There are many examples and exercises, and a welcome feature is the large number of diagrams which compare the approximate solutions with the known solutions of some of the problems discussed. The reader will be amused by the quotation at the beginning of every chapter from Sherlock Holmes, although the exact relevance is not always obvious. The book is well produced, and it will surely be of great use to those interested in these matters. It is not only the authors who hope for a similar book on approximate solutions of partial differential equations.\nOver twenty years after it was first published the book was reprinted in\n1999\n. A D Wood, reviewing the reprint, writes:-\nThis is a book that has stood the test of time and I cannot but endorse the remarks of the original reviewer. It is written in a fresh and lively style and the many graphs and tables, comparing the results of exact and approximate methods, were in advance of its time. I have owned a copy of the original for over twenty years, using it on a regular basis, and, after the original had gone out of print, lending it to my research students. Springer-Verlag has done a great service to users of, and researchers in, asymptotics and perturbation theory by reprinting this classic.\nCarl Bender spoke about his former colleague at MIT\n[\n3\n]\n:-\nOrszag engaged with students of varying levels of mathematical talent. He was fast-paced. You had to run to keep up with him. But he was also warm and patient and humble at unexpected times.\nIn\n1984\nhe returned to Princeton University when he was appointed Forrest E Hamrick Professor of Engineering. He remained there for fourteen years before moving to Yale where he was appointed in\n1998\n. He was Percey F Smith Professor of Mathematics at Yale from\n2000\nuntil his death in\n2011\n. Before looking briefly at Orszag's contributions, let us look at his own description of the field in which he worked\n[\n4\n]\n:-\nUnderstanding turbulent flows is a \"grand challenge\" comparable to other prominent scientific problems such as the large-scale structure of the universe and the nature of subatomic particles. In contrast to many of the other grand challenges, progress on the basic theory of turbulence translates nearly immediately into a wide range of engineering applications and technological advances that affect many aspects of everyday life. Numerical prediction of fluid flows is at the heart of understanding and modelling turbulence. However, such computational fluid dynamics simulations challenge the capabilities of both algorithms and the fastest available supercomputers.\nWhen appointed to the Percey F Smith Professorship, his research achievements were described as follows\n[\n7\n]\n:-\nSteven A Orszag, the new Percey F Smith Professor of Mathematics, specializes in the areas of computational fluid dynamics, turbulence theory and numerical analysis. He is also noted for his work in applied mathematics, and his research has had an impact on aeronautics, weather forecasting and the electronic chip manufacturing industry. In the areas of computational fluid dynamics, he achieved the first successful computer simulations of three-dimensional turbulent flows. He also developed methods that provide a fundamental theory of turbulence. Another primary research interest has been the development of techniques for the simulation of electronic chip manufacturing processes, some of which have been applied extensively throughout the industry.\nWe have already given details of his book\nAdvanced Mathematical Methods for Scientists and Engineers\n(1978)\nbut around the same time he also published, in collaboration with David Gottlieb,\nNumerical Analysis of Spectral Methods: Theory and applications\n(1977)\n. In this the authors presented:-\n... a unified discussion of the formulation and analysis of special methods of mixed initial boundary-value problems. The focus is on the development of a new mathematical theory that explains why and how well spectral methods work. Included are interesting extensions of the classical numerical analysis.\nOrszag's contributions to this area are put into perspective in\n[\n5\n]\n:-\n\"Spectral methods are great fun,\" observes Michel Deville, a professor at l'École Polytechnique Fédérale de Lausanne, Switzerland. \"It's always a numerical nirvana when - for the first time - one observes that adding one or two polynomials to a basis makes the error for smooth problems drop by a factor of\n50\nor even\n100\n.\" Spectral methods have not always come in for such high praise. Although originating in early-\n20\nth\n-century work of\nGalerkin\nand\nLanczos\n, and put to limited use by meteorologists in the\n1950\ns, spectral methods came into their own as a powerful tool for scientific computing only with the advent of the fast\nFourier\ntransform. In the early\n1970\ns, in a series of landmark papers, Steven Orszag showed that spectral methods, and the closely related pseudospectral methods, could be used to simulate incompressible turbulence with\nN\n3\nN^{3}\nN\n3\nFourier\nmodes at a cost of only O\n(\nN\n3\nlog\n⁡\nN\nN^{3} \\log N\nN\n3\nlo\ng\nN\n)\noperations per timestep with zero numerical dispersion and dissipation. In a historic computation, Orszag and his colleague G S Patterson undertook the first calculation of homogeneous isotropic turbulence at laboratory\nReynolds\nnumbers with a\n3\n2\n3\n32^{3}\n3\n2\n3\npseudospectral discretization. ... In the\n1977\nSIAM monograph 'Numerical Analysis of Spectral Methods: Theory and Applications', Gottlieb and Orszag presented the first unified description of the field, with an emphasis on numerical analysis and algorithmic considerations.\nIn addition to these books, Orszag was an editor of a number of books:\n(\neditor with K Kuwahara and Raul Mendez\n)\nSupercomputers and Fluid Dynamics\n(1986)\n;\n(\neditor with Raul H Mendez\n)\nJapanese Supercomputing: Architecture, Algorithms, and Applications\n(1988)\n; and\n(\neditor with Boris Galperin\n)\nLarge Eddy Simulation of Complex Engineering and Geophysical Flows\n(1993)\n. The publisher, Cambridge University Press, describes this last work as follows:-\n... this book was the first to offer a comprehensive review of large eddy simulations\n(\nLES\n)\n- the history, state of the art, and promising directions for research. Among topics covered are fundamentals of LES; LES of incompressible, compressible, and reacting flows; LES of atmospheric, oceanic, and environmental flows; and LES and massively parallel computing. The book grew out of an international workshop that, for the first time, brought together leading researchers in engineering and geophysics to discuss developments and applications of LES models in their respective fields. It will be of value to anyone with an interest in turbulence modelling.\nOrszag published over\n400\npapers in his career as well as making six successful patent applications. Among the honours he received for his contributions we mention the American Institute of Aeronautics and Astronautics Fluids and Plasmadynamics Prize he received in\n1986\n. He was a John Simon Guggenheim Fellow in\n1989\nand received the Otto Laporte Award from the American Physical Society in\n1991\n. The Society of Engineering Science awarded him their\nG I Taylor\nMedal in\n1995\n. He was named an ISI Highly Cited Author by the ISI Web of Knowledge.\nHe died of chronic lymphomic leukaemia at the age of sixty-eight. His colleague at Yale, John Wettlaufer, paid him this tribute\n[\n2\n]\n:-\nSteve was a pioneer in applied and computational mathematics high-performance computing and more recently novel approaches to mathematics education. Vast areas of the landscape of thought have lost a brilliant thinker and a wise adviser.\nWettlaufer also paid this tribute to Orszag\n[\n3\n]\n:-\nHe was an incredibly talented mathematician. But he was simultaneously probably one of the most generous people I've ever worked with.",
  "matematicos_citados_na_biografia": [
    "Martin David Kruskal",
    "Kruskal",
    "Galerkin",
    "Lanczos",
    "Fourier",
    "Reynolds",
    "G I Taylor"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}