{
  "nome_completo": "Susan Jane Cunningham",
  "nome_curto": "Susan Cunningham",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cunningham_Susan/",
  "data_nascimento": "23 March 1842",
  "local_nascimento": "Baltimore, Maryland, USA",
  "data_morte": "24 January 1921",
  "local_morte": "Swarthmore, Pennsylvania, USA",
  "summary": "Susan Jane Cunningham was a mathematician and astronomer who founded the Mathematics and Astronomy Departments at Swarthmore College. She was one of the first seven women to join the New York Mathematical Society in 1891 .",
  "biografia": "Susan Jane Cunningham\nwas the daughter of Edward Lloyd Cunningham and Elizabeth H Hollingsworth. Elizabeth was a Quaker from a large Quaker family of farmers. Edward and Elizabeth were married on\n5\nSeptember\n1838\nat Harford, Maryland, USA. They had three children: Elizabeth Caroline Cunningham\n(\nborn\n17\nNovember\n1839)\n, Susan Jane Cunningham\n(\nborn\n23\nMarch\n1842\n, the subject of this biography\n)\n, and Robert Hollingsworth Cunningham\n(\nborn\n23\nMay\n1844)\n. We have not been able to determine exactly what happened around\n1845\nbut certainly tragedy struck the family soon after Robert was born. The biographical sketch of Susan Cunningham written in\n1893\n, when she was about\n50\nyears old, states\n[\n22\n]\n:-\nHer mother died in\n1845\n, and Susan was left to the care of her grandparents.\nIn\n[\n7\n]\n, however, it states that Elizabeth H Cunningham died on\n12\nMarch\n1861\n. The picture of her tombstone on\n[\n7\n]\ndoes not allow one to confirm this date since the stone is too covered with moss. We can find no record of either Edward Lloyd Cunningham or Elizabeth H Cunningham in either the\n1850\nor\n1860\nUS census. The three children certainly moved from Baltimore to Harford, Maryland, being registered at the Little Falls Meeting House in Fallston, Harford. Elizabeth Caroline Cunningham and Susan Jane Cunningham are both recorded as \"From Baltimore\n7\nDecember\n1847\n. Minor,\" while Robert Hollingsworth Cunningham is recorded as \"From Baltimore\n4\nJanuary\n1848\n. Minor.\"\nThe\n1850\nUS Census, records Susan Jane Cunningham and her two siblings as living with their maternal grandparents Robert Taylor and Elizabeth Hollingsworth in Harford, Maryland in one of four adjacent houses each with a farmer Hollingsworth as the head. These four heads are John Hollingsworth, Ely Hollingsworth, Nathaniel Hollingsworth and Robert Taylor Hollingsworth. We will explain how they are related. Susan Jane's mother Elizabeth H Hollingsworth was the daughter of Robert Taylor Hollingsworth\n(1784\n-\n1863)\nand his wife Elizabeth West\n(1792\n-\n1861)\n. Robert Taylor Hollingsworth was the son of Nathaniel C Hollingsworth\n(1755\n-\n1834)\nand Abigail Green\n(1759\n-\n1846)\n. Robert Taylor Hollingsworth's siblings included John Hollingsworth\n(1805\n-\n1874)\n, Ely Hollingsworth\n(1793\n-\n1879)\nand Nathaniel Hollingsworth\n(1801\n-\n1851)\n. The three Cunningham children, Caroline, Susan and Robert, are living with Robert Taylor and Elizabeth Hollingsworth. The two youngest of Robert Taylor and Elizabeth Hollingsworth's children, Rebecca Hollingsworth\n(\naged\n18)\nand Charles Hollingsworth\n(\naged\n17\n, already working as a farmer\n)\n, are also living in the house.\nThe Hollingsworth families were very involved with the Quakers, also known as the Religious Society of Friends. The Little Falls Friends Meeting House, where the three Cunningham children were registered, had been constructed in\n1843\non the east side of the Old Fallston Road in Fallston, Harford County, Maryland. It replaced an earlier smaller Meeting House built in\n1773\n. Also on the site was the Friends Cemetery, where Susan's mother Elizabeth H Cunningham is buried, and a Friends School. It was at the Friends School that Susan Cunningham began her education. When she was fifteen years old, her grandparents thought that she should train to be a teacher and she was sent to a Friends' Boarding School in Montgomery county. This Friends' Boarding School, called Woodlawn, had been established by Samuel and Anna Thomas in\n1816\n. After a year at the boarding school, however, her grandparents needed her to return to Harford to help them, so Susan returned and completed her schooling at the Friends School there.\nWhen the\n1860\nUS Census was held on\n1\nJune, Susan was eighteen years old. There were still four houses in the farming community with a farmer member of the Hollingsworth family at its head. Susan was living with her grandparents Robert and Elizabeth Hollingsworth, aged\n76\nand\n68\nrespectively. The only other person in the house was Susan's younger brother Robert H Cunningham aged sixteen. Two of grandparents' children, Jane Hollingsworth and Rebecca Hollingsworth, had died in\n1842\nand\n1859\nrespectively. Susan's grandfather died in\n1863\nand her grandmother in\n1868\n. At the time of the\n1860\nUS Census, Susan was not working but, in the following year, when she was nineteen years old, she began teaching at the local Friends School.\nCunningham spent the year\n1866\n-\n67\nstudying at Vassar College in Poughkeepsie, New York. This women's college had opened in\n1865\nand the first faculty appointment had been the astronomer\nMaria Mitchell\n.\nMitchell\nhad never had a college education but had become famous by discovering a comet in\n1847\n. Two years later she had accepted a research position as a computer with the U.S. Coast Survey. At Vassar College she was appointed as director of the Vassar College Observatory and taught mathematics and astronomy. She was an inspirational teacher and Cunningham became one of the first of many women to be encouraged by\nMitchell\nto have a career in mathematics and astronomy. Cunningham did not matriculate at Vassar College but rather spent the year there as a \"special student\" which provided the opportunity for students to expand their experiences and advance their career.\nAfter the year at Vassar College, Cunningham returned to teaching mathematics at a Friends School. Two years later, however, she was appointed as an Instructor in Mathematics at Swarthmore College in the year the College opened and teaching began there. This College had been founded by the Society of Friends in\n1864\nand Cunningham was initially given a one year contract to teach mathematics to the first class which began studies in\n1869\n. In fact she spent the whole of her career at Swarthmore College teaching mathematics and astronomy until she retired in\n1906\n. We have seen that she had only one year of studies of higher education but during her time on the faculty at Swarthmore she spent many summers studying in the leading observatories.\nThe Harvard College Observatory had been established in\n1839\nwith William Cranch Bond\n(1789\n-\n1859)\nas its first Director. His son George Phillips Bond\n(1825\n-\n1865)\nwas the second Director, who was awarded the\nRoyal Astronomical Society\n's Gold Medal in\n1865\n, and\nJoseph Winlock\nwas appointed in\n1866\nfollowing George Bond's early death.\nWinlock\nmade many advances and the Observatory was undertaking outstanding work when Cunningham spent the summer of\n1874\nstudying at the Harvard College Observatory.\nJoseph Winlock\ndied in\n1875\nand when Cunningham spent her second summer at the Harvard College Observatory in\n1876\n, Arthur Searle was the temporary director. In fact the first women had joined the Observatory staff in\n1875\nso when Cunningham made her second summer visit there were three female computers reducing the data produced by the male observers.\nAfter these summer Harvard visits, Cunningham spent the summers of\n1877\n,\n1878\n, and\n1879\nat the University of Cambridge in England. Of course this required voyages and she made them from Philadelphia, Pennsylvania, to Liverpool, England as soon as teaching had finished for the summer and returned from Liverpool to Philadelphia in time for the start of teaching at Swarthmore College. For example in\n1877\nshe made this return journey on the ship\nOhio\narriving in Philadelphia on\n10\nSeptember. The\n1879\nreturn trip was also made on the ship\nOhio\narriving in Philadelphia on\n10\nSeptember. An interesting aside is the comment that she must have given her age as younger than she actually was since her age is incorrectly recorded on both records. In Cambridge, Cunningham undertook studies at Newnham College, a University of Cambridge women's college, working with a private tutor.\nFor the summer of\n1881\nCunningham remained in the United States, spending time at the Princeton observatory. The summer of\n1882\nsaw her again making the voyage to England where once again she studied at Newnham College, Cambridge with a private tutor. She returned to the United States via the same route as on her earlier trips, sailing from Liverpool to Philadelphia. This time she was on the ship 'Pennsylvania', arriving in Philadelphia on\n13\nSeptember. The following two summers,\n1883\nand\n1884\n, she spent at Williamstown with Truman Henry Safford\n(1836\n-\n1901)\n, the Professor of Astronomy at Williams College. Safford was very involved in teaching astronomy, and had studied teaching methods. This was particularly interesting for Cunningham whose work at Swarthmore College largely involved teaching. Safford's research interest at this time was in accuracy in the determinations of the positions of fixed stars.\nContinuing her summer studies, Cunningham was back in Cambridge, England, in\n1887\nbut this time it was not to study at Newnham College but rather it was to spend time at the Cambridge Observatory where\nJohn Couch Adams\nwas the director. There she met Anne Walker who had been employed as a computer in\n1882\nbut was also assisting Andrew Graham in making observations. In the summer of\n1891\nCunningham was again in England, this time at the Royal Observatory in Greenwich. She used her usual route across the Atlantic Ocean, sailing from Philadelphia to Liverpool on the ship\nLord Gough\narriving in Liverpool on\n22\nJune. At this time William Christie was the Astronomer Royal, he had succeeded\nGeorge Airy\nin\n1881\n. Christie was skilled in obtaining funds for large astronomical instruments, which certainly interested Cunningham, but Christie is known to have been less skilled in putting these instruments to good use. Cunningham returned to the United States sailing from Liverpool to Philadelphia on the ship the\nBritish Prince\narriving on\n8\nSeptember.\nWe have looked at the many ways Cunningham used her summers to learn more about her subject. This together with her great talents as a teacher meant that she proved a very positive asset to Swarthmore College. She taught both mathematics and astronomy, being Swarthmore's first Professor of Astronomy. She founded the Department of Mathematics at Swarthmore College and was promoted to Professor of Mathematics in\n1871\n. Her life, and that of many others, was disrupted when Parrish Hall caught fire in\n1881\n[\n6\n]\n:-\nIn the fire which destroyed Parrish Hall in\n1881\n, she forgot herself and her belongings and thought only of aiding the students to get to safety. In that fire she lost a valuable library.\nAt first Swarthmore did not have an observatory but in\n1888\nCunningham was given permission by the Board of Managers to plan and equip the Observatory of Swarthmore College. By\n1891\nshe had brought in the funds and the Observatory was operating as a teaching facility but was not being used for research.\nYou can read Cunningham's own description of the Observatory in\n1891\nat\nTHIS LINK\n.\nOnce the Observatory was constructed, Cunningham lived in the building until she retired in\n1906\n. It was named the Cunningham Observatory and the building is still on the Swarthmore College campus although it is no longer used as an observatory. It has been renamed the Cunningham Building. When Cunningham retired, John Anthony Miller\n(1859\n-\n1946)\nwas appointed as Chair of Mathematics and Astronomy at Swarthmore. He wrote in\n1913\n[\n13\n]\n:-\nSwarthmore College is a small college founded by the Religious Society of Friends. The traditions of the college are, and always have been, that it is and shall remain a small college, and that its teaching energies shall be directed almost exclusively along undergraduate lines. It is the ambition of the present administration, however, to equip all departments of the college, so that first of all the teaching of the undergraduate shall be just as effective as it can be anywhere. and in addition to provide so far as possible library facilities and laboratory equipment so that the faculty of each department may engage in some line of research, with the hope of doing it effectively and producing creditable results. In almost every department, there are a few graduate students, but unless the student's interest and ability naturally lead him in the direction in which the professor is working, he is advised to pursue work in institutions that give their chief energies to graduate work. In accordance with this plan this equipment supplements, for purposes of research, a well equipped students' observatory which was placed on the College Campus about twenty years ago for instructional purposes. The funds for this observatory were secured through the efforts of Dr Susan J Cunningham, for thirty-five years Professor of Mathematics and Astronomy at the college, and since\n1906\nProfessor Emeritus of Mathematics and Astronomy. This observatory is only one of the expressions of the marked influence this great woman and great teacher has had, and in fact is having. upon the college, for she still contributes not only from her material resources, but gives her entire strength and influence to the upbuilding of the college.\nIn the same year that Cunningham began planning for the new observatory,\n1888\n, Swarthmore College awarded her an honorary degree, the first such degree that the College awarded. In\n1891\nCunningham mentioned the honorary degree when making application for membership of the\nNew York Mathematical Society\nwhich, six years later, changed its name to the\nAmerican Mathematical Society\n. The\nNew York Mathematical Society\nwas founded on\n24\nNovember\n1888\nat a meeting attended by only six people and a year later it was still very small with only eleven members. All these eleven were men but\nCharlotte Angas Scott\nbegan attending meetings of the Society soon after it was founded but could not join as membership was only open to those from New York. She was the first of seven women to join the Society, all seven becoming members in\n1891\n. It was in\n1891\nthat membership became open to those living outside New York.The other six women were\nCharlotte Angas Scott\n,\nAchsah Ely\n,\nMary Emma Byrd\n,\nMary Watson Whitney\n,\nEllen Amanda Hayes\nand\nAmy Rayson\n. On learning that the\nNew York Mathematical Society\nhad made her a member, Cunningham wrote to the secretary\nThomas Scott Fiske\n, saying\n[\n21\n]\n:-\nIt gives me great pleasure to accept the honour you have done me, in electing me a member to the\nNew York Mathematical Society\n. It will not be possible for me to attend many meetings. I would therefore ask that I might receive the cards of announcements regularly.\nIn\n1901\nCunningham was elected a Fellow in the Mathematics/Astronomy Section of the American Association for the Advancement of Science.\nOn Thursday\n11\nDecember\n1919\n, the Shirer Building was destroyed by fire. All the tenants were safely evacuated but seven firemen, including four from Swarthmore, were injured when the roof and third floor collapsed. The reconstruction of the Shirer Building was completed in March\n1920\n. Whether Cunningham was living in the building when it went on fire is unclear, but she was certainly living in the reconstructed Shirer Building at the time of her death in\n1921\n. Her death was announced in\nThe Morning News, Wilmington, Delaware,\nas follows\n[\n6\n]\n:-\nDr Susan J Cunningham,\n79\nyears old, a member of the first faculty of Swarthmore College and an active worker since the founding of the college, was found dead in her apartment in the Shirer Building, Swarthmore, Pa, yesterday. It is believed her death was caused by heart disease.\nOn Sunday while Miss Cunningham was visiting Mr and Mrs Arthur Scott, in Moylan, she spoke of her good health and at\n10\no'clock that night she was seen reading in her apartment. But when her light was seen still burning yesterday he neighbours feared that all was not well and so entered her room. The teacher, still in street attire, lay on a couch. She is survived by one sister, Mrs J W Branson, of Winchester, Va.\n...\nThe funeral will be at\n3\n.\n30\np.m. tomorrow in the Swarthmore Meeting House, Swarthmore.\nAt the funeral many tributes were paid to Cunningham. We quote from the report of the funeral in\nThe Phoenix\n, the student newspaper of Swarthmore College\n[\n8\n]\n:-\nThe services were most impressive and the Meeting House was filled with alumni, students and friends. Doctor John A Miller was in charge, and read the Scriptures. He then made a very beautiful speech paying great tribute to the life and great work of Miss Cunningham. Speaking of her unbounded love and tireless energy for the student body, Doctor Miller said, \"A number of Swarthmore's most prominent alumni owe their present positions to the help and thoughtfulness of this devoted woman.\" He declared that we might all well adopt the rule of Miss Cunningham: \"Give without stint the best that you have to that which seems the best of all.\"\nGovernor William C Sproul,\n(\ngraduated Swarthmore\n1891)\n, who had great, affection for his favourite teacher, sent the following telegram - \"l am deeply grieved to hear of Miss Cunningham's passing. She was a splendid woman and one of Swarthmore's outstanding figures. Her life, covering the whole history of the college, represents the spirit of devotion and courage which has made it strong and successful. My respect and affection for her make her loss a personal one, and my sorrow very real. I regret deeply that official matters here make it necessary for me to remain in Harrisburg today.\" Doctor Edward Martin,\n(\ngraduated Swarthmore\n1878)\n, State Commissioner of Health, also communicated his feelings. He wrote, \"A word of grateful appreciation for Susan J Cunningham, that fearless, clear-minded, strong, and when needed tenderly helpful woman, who so largely guided my life and that of many hundred others. Of such is the lasting wealth of Swarthmore. She is enshrined in my memory. Her spirit is as lasting as Swarthmore itself.\"\nFaculty Members Speak: Many words, of tribute and regret were expressed by members of the faculty, former students, and intimate friends of Miss Cunningham. Professor Spencer Trotter, who is the oldest faculty member in point of service at Swarthmore, spoke of his feeling that \"death does not destroy friendship.\" Professor Holmes praised her life as being that of a pioneer. Dean Bond spoke very tenderly concerning Miss Cunningham's love for Swarthmore which exceeded her love for her own life. Miss Brewster paid high tribute to Doctor Cunningham, as did Morris L Clothier, on behalf of the Class of\n1890\n. J Russell Hayes read a touching poem which also dealt with her love for Swarthmore.\nHow fitting that her sunset days were passed\nBeside a Swarthmore window looking west.\nWhere with fond reminiscent gaze she watched\nThe well-loved College to which she gave her best!\nBesides these speakers mentioned, there were a number of others who added words to the memory of Miss Cunningham. A great number of telegrams and letters were also received, expressing sincere regret over her death.\nAlso in the same edition of\nThe Phoenix\n, the resolution adopted by the Faculty is printed\n[\n8\n]\n:-\nThe Faculty records, with deep regret, the passing of Professor Emeritus Susan J Cunningham, who occupied the chair of Mathematics and Astronomy at Swarthmore College for a period of thirty-seven years. Professor Cunningham was well known for her learning, her ability as a teacher, her decisive character, and for her great interest in everything which pertained to Swarthmore College. She employed her splendid attainments of mind and her energetic personality for the betterment of this institution to which she was devoted. Her actions commanded the respect of all who knew her. Her memory will be cherished and her influence will not be forgotten.\nSusan Jane Cunningham was buried in the Friends Cemetery at Fallston, Harford County, Maryland where now\n43\nmembers of the Hollinsworth family are buried.",
  "matematicos_citados_na_biografia": [
    "Maria Mitchell",
    "Mitchell",
    "Royal Astronomical Society",
    "Joseph Winlock",
    "Winlock",
    "John Couch Adams",
    "George Airy",
    "THIS LINK",
    "New York Mathematical Society",
    "American Mathematical Society",
    "Charlotte Angas Scott",
    "Achsah Ely",
    "Mary Emma Byrd",
    "Mary Watson Whitney",
    "Ellen Amanda Hayes",
    "Amy Rayson",
    "Thomas Scott Fiske"
  ],
  "imagens": [
    "cunningham_susan.jpg"
  ]
}