{
  "nome_completo": "Takebe Katahiro",
  "nome_curto": "Takebe Katahiro",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Takebe/",
  "data_nascimento": "1664",
  "local_nascimento": "Edo (now Tokyo), Japan",
  "data_morte": "24 August 1739",
  "local_morte": "Edo (now Tokyo), Japan",
  "summary": "Takebe was a Japanese mathematician who wrote most of Seki's Encyclopaedia .",
  "biografia": "Takebe Katahiro\n's name is given in several different forms including Takebe Kenko and Tatebe Kenko. He had an older brother Takebe Kataaki\n(1661\n-\n1716)\nwho was also a mathematician and the two brothers were both pupils of\nTakakazu Seki\n. Let us note now that when we speak of Takebe in this article, we are referring to Takebe Katahiro and if we refer to his brother we shall use his full name Takebe Kataaki. Takebe was only thirteen years of age when he became\nSeki\n's pupil and both brothers remained with their teacher until his death in\n1708\n. Not only did the brothers gain much from\nSeki\n's teaching but they also had access to his extensive library of Japanese and Chinese books on mathematics. Annick Horiuchi writes\n[\n1\n]\n:-\nThe brothers did their utmost to spread\nSeki\n's work, to make it easier to understand, and to defend it against detractors. They were the main craftsmen of\nSeki\n's project\n(\nlaunched\n1683)\nto record mathematical knowledge in an encyclopaedia. The 'Taisei sankei'\n(\nComprehensive Classic of Mathematics\n)\n, in\n20\nvolumes, was finally completed by Takebe Kataaki in\n1710\n. It gives a good picture of Seki's skill at reformulating problems, as well as Takebe Katahiro's ability to correct, perfect, and extend his master's intuitions.\nSeki\ncame from the samurai class and this meant that he became a public servant. He held the position of examiner of accounts to Tokugawa Ienobu, the Lord of Kofu. When his lord became heir to the Shogun, the hereditary military dictator of Japan,\nSeki\nbecame Shogunate samurai and in\n1704\nwas given a position of honour as master of ceremonies in the Shogun's household. This brought Takebe into contact with the leading members of the Tokugawa family. He was an officer to Tokugawa Bakuhu, and then he was close to Tokugawa Ienobu, the Lord of Kofu, as he rose to become Shogun in\n1709\n. Takebe served Tokugawa Ienobu during his three years as Shogun, and then served Tokugawa Ietsugu who was Shogun from\n1712\nto\n1716\n. From\n1695\nwhen he began his close association with members of the Tokugawa family, Takebe spent less time on his study of mathematics. However he next served Tokugawa Yoshimune, who became the eighth Tokugawa Shogun in\n1716\n. Yoshimune was significantly different from the earlier Tokugawa rulers, having an inquiring mind. Takebe's enthusiasm for the study of mathematics and astronomy was invigorated again from\n1716\n. Encouraged by Takebe, Yoshimune relaxed the edict forbidding the introduction of foreign books, including scientific books, which led to the growth of interest in Western science in Japan. Yoshimune was fascinated by astronomy and had a large globe made. He also had a telescope which had been in the Netherlands. Later in this biography we will describe work undertaken by Takebe specifically at Yoshimune's request.\nTatebe was only nineteen years old when he published his first mathematics book the\nKenki Sanpo\nⓉ\n(\nTiny algorithm\n)\n(1683)\n. He followed this in\n1685\nwith the book\nHatsubi Sanpo Endan Genkai\nⓉ\n(\nSmall segment algorithm\n)\n. These early works were based on the methods\nSeki\nhad developed for handling polynomials. These methods were extended to handle polynomials in a single variable but with variable coefficients. Tatebe improved and extended the methods of his teacher and applied them to a wide range of problems in these books. Takebe had made a careful study of\nZhu Shijie\n's Chinese text\nSuanxue qimeng\nⓉ\n(\nIntroduction to mathematical studies\n)\npublished in\n1299\nand the work had been a great help to him in developing his theory of polynomials. In\n1690\nTakebe published an annotated Japanese translation of the\nSuanxue qimeng\nⓉ\n(\nIntroduction to mathematical studies\n)\nwhich he intended as a text for students of mathematics.\nIn\n1683\nSeki\nstarted a project to compile an encyclopaedia of mathematics. This\n20\nvolume work appeared in\n1710\nwith the title\nTaisei sankei\n(\nComprehensive Classic of Mathematics\n)\n. None of the work was written by\nSeki\nhimself and it is clear that the first twelve volumes were written by Takebe. Takebe Kataaki also played a major role in compiling the\nTaisei sankei\nand the final eight volumes are due to him. One of the most significant ideas introduced in Takebe's part of the text is the method of Enri, which is definite integration. For many years historians believed that this idea was due to Seki and only the writing was due to Takebe. However, modern research leads most historians to claim that the method of Enri was in fact due to Takebe.\nThe most important of Takebe's work is\nTetsujutsu Sankei\nⓉ\n(\nArt of assembling\n)\n. Morimoto writes in\n[\n10\n]\n:-\nIn\n1722\n, Takebe wrote the 'Tetsujutsu Sankei'\n(\nMathematical Treatise on the Technique of Linkage\n)\nto explain how mathematical research could be done in accordance of one's inclination, based on\n12\nexamples of mathematical investigation.\nIn Chapter\n2\nof this work, Takebe explains the \"method of celestial element\" which\nZhu Shijie\nhad introduced in\nSuanxue qimeng\nⓉ\n(\nIntroduction to mathematical studies\n)\nas a method of representing a polynomial in one variable on a counting board. The extension of this method to polynomials with variable coefficients, due to\nSeki\nand Takebe, was presented in Chapter\n6\nof the\nTetsujutsu Sankei\nⓉ\n(\nIntroduction to mathematical studies\n)\n. This effectively allowed Takebe to handle polynomials in several variables. Although Takebe did not explicitly have the operation of differentiation, nevertheless, he stated a result in Chapter\n6\nwhich is equivalent to the statement that if a cubic polynomial takes an extreme value at a point the derivative vanishes at that point. We should note, however, that Ogawa writes in\n[\n22\n]\n:-\nThe purpose of this paper is to consider the essence of mathematics of Takebe Katahiro\n(1664\n-\n1739)\nby investigating his method of finding the maximum in 'Tetsujutsu Sankei'\n(1722)\n. It has been said that he had first done a calculation of a derivation for finding the maximum in Chapter\n6\nof the treatise, but that is not strictly true. A close look at the chapter will reveal that his method has nothing to do with the theory of differential.\nPerhaps Takebe's greatest achievement was to devise a method to calculate a series expansion of a function. Ancient Greek mathematicians had been perplexed by the problem of squaring the circle and in the\n17\nth\ncentury Japanese mathematicians looked at a similar problem, namely the problem of finding a polynomial which expressed the length\ns\ns\ns\nof an arc of a circle subtended by a chord with sagitta\nk\nk\nk\n. The\nsagitta\nis the line from the midpoint of the chord to the midpoint of the arc of the circle it subtends. Now we know that no such polynomial exists but Takebe found an infinite series expressing\ns\ns\ns\nin terms of\nk\nk\nk\n, namely\n(\n1\n2\ns\n)\n2\n=\nk\n+\n1\n3\nk\n2\n+\n1.8\n3.15\nk\n3\n+\n1.8.9\n3.15.14\nk\n4\n+\n1.8.9.32\n3.15.14.45\nk\n5\n+\n1.8.9.32.25\n3.15.14.45.33\nk\n6\n+\n.\n.\n.\n(\\large\\frac{1}{2}\\normalsize s)^{2} = k + \\large\\frac{1}{3}\\normalsize k^{2} + \\large\\frac{1.8}{3.15}\\normalsize k^{3} + \\large\\frac{1.8.9}{3.15.14}\\normalsize k^{4} + \\large\\frac{1.8.9.32}{3.15.14.45}\\normalsize k^{5} + \\large\\frac{1.8.9.32.25}{3.15.14.45.33}\\normalsize k^{6} + ...\n(\n2\n1\n​\ns\n)\n2\n=\nk\n+\n3\n1\n​\nk\n2\n+\n3\n.\n1\n5\n1\n.\n8\n​\nk\n3\n+\n3\n.\n1\n5\n.\n1\n4\n1\n.\n8\n.\n9\n​\nk\n4\n+\n3\n.\n1\n5\n.\n1\n4\n.\n4\n5\n1\n.\n8\n.\n9\n.\n3\n2\n​\nk\n5\n+\n3\n.\n1\n5\n.\n1\n4\n.\n4\n5\n.\n3\n3\n1\n.\n8\n.\n9\n.\n3\n2\n.\n2\n5\n​\nk\n6\n+\n.\n.\n.\nIn fact, looked at in modern terms, what Takebe was calculating was the\nTaylor series\nexpansion of\narcsin\n⁡\n2\nk\n\\arcsin^2\\sqrt k\narcsin\n2\nk\n​\nabout\nk\n=\n0\nk = 0\nk\n=\n0\n.\nWe have not yet mentioned the result for which many know Takebe's name, namely his calculation of π. He describes in Chapter\n9\nof the\nTetsujutsu Sankei\nⓉ\n(\nIntroduction to mathematical studies\n)\nthe right way to proceed if one wants to calculate the circumference of a circle of a given diameter. He writes\n(\nin Morimoto's translation from\n[\n10\n]\n)\n:-\nIf he who decomposes the circumference of a circle cuts the diameter equally and horizontally into thin slices, seeks the\n[\nlength of the\n]\nright and left oblique chords cut by the horizontal lines and adds the oblique chords to seek the\n[\napproximate\n]\ncircular circumference, then the parts of circumference are not equal even if he cuts the diameter equally. Therefore, if he seeks the circumference doubling the sections of the diameter, these numbers being disobedient to the attribute, he stagnates in determining the extreme number and never obtain a basis to understand the attribute of circle. On the other hand, when he cuts the circumference into the four angular forms\n[\ni.e., by an inscribed square\n]\nand further doubling angles\n[\ni.e., forming an inscribed octagon, etc.\n]\n, the circumference is cut into equal length and the numbers are obedient to the attribute of circumference. Therefore, doubling the number of angles and seeking the angular circumferences at each step, by the repeated application of the procedure of incremental divisor he can determine the extreme number rapidly and obtain a basis to understand the attribute of a circle.\nNow of course this gives a method to approximate π but the method converges very slowly. Takebe invented a method for the acceleration of convergence using a technique for the successive removal of various powers of the argument, in this case the error term. This idea is essentially equivalent to the\nRomberg\nalgorithm. It allowed Takebe to find  correct to\n40\ndecimal places. See\n[\n28\n]\nfor further details.\nThe\nTetsujutsu sankei\nⓉ\n(\nIntroduction to mathematical studies\n)\ndoes more than describe Takebe's mathematical contributions, for in the work he also expounds his mathematical methodology. Let us give two quotations dealing with this part of his thought; first the description by Annick Horiuchi in\n[\n1\n]\n:-\nHe distinguished two ways of solving a mathematical problem\n(\nand two corresponding types of mathematicians\n)\n: an \"investigation based on numbers,\" an inductive approach that involves scrutinizing and manipulating data until one finds a general law; and an \"investigation based on principle,\" a reasoned approach that involves directly utilizing rules and procedures, as in algebra. The two approaches are often complementary, as he demonstrated by showing that an infinite series that he had obtained inductively could also be derived algebraically. His procedure for calculating the infinite series played a key role in the development of analysis in Japan in the following decades.\nThe article\n[\n32\n]\nby Chang Zhou and Jian Ke Zhang on Takebe's mathematical thought and methodology is summarised by the authors as follows:-\nIn view of mathematical methodology and the Neo-Confucianism of the Song and Yuan dynasties, this paper discusses the essential character of 'Tetsujutsu' which runs through 'Tetsujutsu Sankei', and Takebe's mathematical thought and methodology reflected from the 'Jishitsu Setsu' at the end of the book. The paper comes to the conclusion that Takebe's 'Tetsujutsu' is, actually, the colligation of the methods of deduction and induction, in which Takebe pays more attention to the method of induction, but he ignores the proof of precisely relying on the method of deduction. Based on our analysis, we conclude that the mathematical thought behind the author's preface and the 'Jishitsu Setsu' of the 'Tetsujutsu Sankei' is connected to the mainstream philosophy of Zhu Xi\n(1130\n-\n1200)\nand Wang Shouren\n(1472\n-\n1528)\nof the time, rather than having nothing to do with the philosophical thought, which is the view of some scholars. Furthermore, the origin of Takebe's mathematical thought may be traced back to the Neo-Confucianism of the Song and Yuan dynasties in China.\nWe promised earlier in this article to return to the work which Takebe undertook at Shogun Yoshimune's request. This is studied in detail in\n[\n8\n]\n, which is reviewed by Brunetto Piochi who explains that\n[\n8\n]\n:-\n... presents the contribution in astronomy and calendar science of Japanese mathematician Takebe, who worked around\n1720\n-\n1730\non those subjects. The author explains in particular the work of Takebe on two topics:\n(\ni\n)\nthe variation of the tropic year, i.e. the time between two consecutive winter\nsolstices\n;\n(\nii\n)\nthe way of calculating the position of the polar star in the sky. By this study, the author draws the conclusion that Takebe\n(\nwhose work is still unpublished, and partly lost\n)\nhad a role in the history of scientific thought, as his aim was to improve, by the assistance of geometry and mathematics, calculation techniques so that astronomy and calendar science could become, in Japan too, exact sciences.",
  "matematicos_citados_na_biografia": [
    "Takakazu Seki",
    "Seki",
    "Zhu Shijie",
    "Taylor series",
    "Romberg",
    "solstices"
  ],
  "imagens": []
}