{
  "nome_completo": "Taro Morishima",
  "nome_curto": "Taro Morishima",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morishima/",
  "data_nascimento": "22 April 1903",
  "local_nascimento": "Wakayama, Japan",
  "data_morte": "8 August 1989",
  "local_morte": "Tokyo, Japan",
  "summary": "Taro Morishima was a Japanese mathematician who worked in algebra and number theory.",
  "biografia": "Taro Morishima\nwas born in a rural area of Wakayama prefecture, south-central Honshu, Japan. It occupies the Kii Peninsula, which faces the Kii Strait to the west and the Pacific Ocean to the south. He was brought up by a nurse. In\n1921\nhe was sent to The Sixth National Senior High School in Okayama, following the practice in Japan at this time to send exceptionally talented boys to one of a small number of senior high schools before entering university. He graduated from The Sixth National Senior High School in\n1924\nand entered Tokyo Imperial University.\nTokyo Imperial University was founded in\n1877\nand named in the Tokyo Imperial University in\n1886\n. There was a major earthquake and fire in\n1923\nand when Morishima entered the Department of Mathematics of the College of Science of the university it had been reconstructed. This University has, from\n1947\n, been named the University of Tokyo. Morishima married Ei Miyamoto in\n1927\nwhile he was studying at university; they had three sons. He graduated in\n1928\nand accepted an appointment as a professor at the Shizuoka Senior High School in central Honshu. After teaching mathematics there for two years he returned to Tokyo taking up an appointment as a professor at the Metropolitan Senior High School. Being in Tokyo he was able to undertake research for his doctorate with\nTeiji Takagi\nas his supervisor. He was awarded his doctorate in\n1935\n.\nMorishima had been very active in mathematical research from the time he graduated in\n1928\n. His passion was\nalgebraic number theory\nand he had a particular love of\nFermat's Last Theorem\n. His first paper on Fermat's Last Theorem was published in the\nProceedings of the Imperial Academy of Japan\nin\n1928\n. It was the first of\n12\npapers written in German with the title\nÜber die Fermatsche Vermutung\n, with\n10\nof these papers being in the\nProceedings of the Imperial Academy of Japan\nbetween the years\n1928\nand\n1935\n. By\n1935\nhe had published a total of\n16\npapers, the other\n6\nbeing:\nÜber den Fermatschen Quotienten\n(1931)\n;\nOn recent results about Fermat's last Theorem\n(\nJapanese\n)\n(1932)\n;\nÜber die Einheiten und Idealklassen des Galoisschen Zahlkörpers und die Theorie der Kreiskörper der l-ten Einheitswurzein\nⓉ\n(\nOn the units and ideal classes of the Galois number field and the theory of circular body of the i-th roots of unity\n)\n(1933)\n; and\nÜber die Theorie der Kreiskörper der l-ten Einheitswurzein\nⓉ\n(\nOn the theory of the circular field of the i-th roots of unity\n)\n(1935)\n. He also published a monograph\nFermat's Problem\n(1934)\nin Japanese. All his papers are full of good ideas but they are extremely difficult to read since Morishima did not present enough detail.\nMorishima's high research activity seems to have greatly lessened after\n1935\n. Although difficulties relating to World War II and the difficult years in Japan following the war were partly responsible, nevertheless it does appear that he had already reduced his research activities. He did publish the book\nHigher Algebra\nin\n1940\n(\nin Japanese\n)\nbut this and one further paper on\nFermat\n's Last Theorem\n(\nin\n1952)\nwas all in published in the\n30\nyears between\n1935\nand\n1965\n. In\n1942\nMorishima was appointed as professor at the Army Military Academy. He became a professor at the University of Tsudajiku in\n1948\n, the at the Science University of Tokyo in\n1951\n. He remained in this last post until he retired in\n1973\nwhen he was given the title Professor Emeritus.\nWe mentioned above that Morishima published one paper on\nFermat\n's Last Theorem in\n1952\n. This was\nOn Fermat's last theorem\n(\nthirteenth paper\n)\npublished in English in the Transactions of the American Mathematical Society. In this paper he continued his investigations of the first case of Fermat's last theorem. He published a further paper on this first case in\n1965\n, this time jointly with Takeo Miyoshi. This paper\nOn the Diophantine equation\nx\np\n+\ny\np\n=\nc\nz\np\nx^{p} + y^{p} = cz^{p}\nx\np\n+\ny\np\n=\nc\nz\np\npublished in the\nProceedings of the American Mathematical Society\nwas, as all of Morishima's work, subject to the criticism that he did not give full enough explanations. Birch, in a review, wrote:-\nThe authors obtain elegant criteria generalising the classical Wieferich and Mirimanoff criteria for the first case of\nFermat\n's equation. ... Unfortunately, the authors' indications of proofs are brief and sometimes misleading, though the reviewer believes that the arguments are correct in essentials. It would be hard to read this paper without\nHasse\n's \"Klassenkörpertheorie\"\nⓉ\n(\nClass field theory\n)\nhandy.\nFinally let us mention Morishima's\n1966\npaper\nOn the second factor of the class number of the cyclotomic field\n.",
  "matematicos_citados_na_biografia": [
    "Teiji Takagi",
    "algebraic number theory",
    "Fermat's Last Theorem",
    "Fermat",
    "Hasse"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}