{
  "nome_completo": "Teiji Takagi",
  "nome_curto": "Teiji Takagi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Takagi/",
  "data_nascimento": "21 April 1875",
  "local_nascimento": "Kazuya Village (near Gifu), Japan",
  "data_morte": "29 February 1960",
  "local_morte": "Tokyo, Japan",
  "summary": "Takagi worked on class field theory, building on Heinrich Weber's work.",
  "biografia": "Teiji Takagi\nwas born in a rural area of Gifu Prefecture in central Japan. His father was an accountant on a farm in this mountainous region and Teiji was brought up on the farm on which his father worked. His mother was a devoted Buddhist and she took Teiji, when he was a young child, with her when she went to the temple. Teiji soon showed himself to be a childhood prodigy by quickly learning to recite the prayers. He attended primary school in Kazuya Village before going to middle school in Gifu entering this second stage of his education in\n1886\n. At that time there were no mathematics texts written in Japanese so the pupils studying mathematics had to use English texts. Takagi studied\nAlgebra for beginners\nby\nTodhunter\nand\nGeometry\nby Wilson.\nIn\n1891\nTakagi began the third stage of his schooling which he took at the Third High School in Kyoto. There were, at that time, eight academies and the brightest pupils went to the one corresponding to the area in which they lived in order to prepare for a university education. Takagi therefore, after showing great talents at middle school, made the natural progression to Kyoto where he studied for three years. In\n1894\nhe graduated for the Third High School and entered Tokyo University, the only university in Japan at that time.\nAt Tokyo University Takagi took courses on calculus and analytic geometry. However he learnt more advanced mathematics by reading books rather than from lecture courses which he attended. He learnt about algebraic curves from\nGeorge Salmon\n's book and he also studied\nSerret\n's\nAlgèbre Supérieure\nⓉ\n(\nHigher algebra\n)\n. He eagerly read\nHeinrich Weber\n's\nAlgebra\ntext when it arrived in Japan and by\n1898\nTakagi had published his first paper. The paper shows a remarkably modern approach to algebra, very surprising for someone who had learnt most of his mathematics from textbooks. The paper begins:-\nIn looking back at the history of branches of mathematics, we see that they start with special and concrete beginnings and proceed by generalisation as they advance. This is manifested, for instance, in the theory of groups, which is one of the most important fields of present day mathematics, and is related to various other branches. It started as the theory of permutation groups, but now the general theory of groups does not suppose that elements of groups should be permutations. As\nCayley\nhas remarked, one has only to suppose that composition of elements satisfies certain laws ... We ... hope that the reader has understood that the essential point in algebra does not lie in the nature of the elements\n(\nwhich are not necessarily numbers\n)\nbut in the way elements are composed.\nThe paper also in noteworthy for containing an abstract definition of a field.\nTakagi graduated from Tokyo University in\n1897\n, and in the following year he was chosen as one of twelve students from Japan to study abroad. He sailed to Germany where he studied courses given by\nFuchs\n,\nFrobenius\nand\nSchwarz\nat Berlin University. However, to his surprise, he discovered that he already knew most of the mathematics in these courses from the books that he had read back in Japan. He then read\nHilbert\n's\nZahlbericht\nⓉ\n(\nReport on number theory\n)\n, a report on\nalgebraic number theory\nwhich had been published in\n1897\n. Takagi wrote to\nHilbert\nwho arranged accommodation for him in Göttingen in a house in which he himself had previously lived. In\n[\n8\n]\nTakagi wrote:-\nAt the time when I studied in Germany, Göttingen was perhaps the only place in the world where research in algebraic number theory was going on. Thus, when I told\nHilbert\nthat I wanted to study this theory, he did not seem to believe me immediately ...\nIf Takagi expected\nHilbert\nto be actively engaged in algebraic number theory then he would have been disappointed.\nHilbert\nhad left this topic immediately after writing the\nZahlbericht\nand by the time Takagi reached Göttingen he was engaged in studying the foundations of geometry and then\nintegral equations\n. Although\nHilbert\nwas not directly involved with Takagi's research, the topic he worked on was certainly one that Hilbert considered of the utmost importance for it was a special case of what became\nHilbert\n's\n12\nth\nproblem in his Paris lecture of\n1900\n. In\n1901\nTakagi left Göttingen and returned to Japan where he was appointed as Assistant Professor in Algebra in the Department of Mathematics at Tokyo University. He married Toshi Tani in\n1902\nand they had three sons and five daughters. He completed a doctorate in Tokyo in\n1903\npresenting a thesis based on work he had undertaken in Göttingen. He was promoted to full professor in Tokyo University in\n1904\n; he held this post until he retired in\n1936\n.\nOn his return to Tokyo in\n1903\nTakagi proved a conjecture on abelian extensions of imaginary number fields made by\nKronecker\n.\nKronecker\ndescribed this conjecture as:-\n... the dearest dream of youth.\nAlthough Takagi was enthusiastic about research he did not continue to develop the work that he had begun in his thesis. He began to write textbooks, which of course were important for the development of Japanese mathematics both at school and university level. The first of these texts was\nA new course of arithmetic\npublished in\n1904\n. The\n500\npage work developed real numbers via\nDedekind\ncuts. it was the first of many texts that Takagi wrote: between\n1904\nand\n1911\nhe wrote\n13\ntexts, but many were multi-volume works so the total number of volumes amounted to\n20\n.\nIn\n[\n8\n]\nTakagi describes how he was led to begin research again:-\nI am by nature someone who needs stimulus in order to work. there are now quite a number of Japanese mathematicians, but in those days, we had few colleagues. I did not have a heavy workload so you might imagine that I did research on class field theory in those carefree days, but it was not so.\nThe First World war started in\n1914\nand this gave me a stimulus, rather a negative stimulus. No scientific information reached Europe for four years. some said this would be the end of Japanese science while newspaper articles wrote of their sympathy for Japanese professors losing their jobs. This made me realise the obvious truth that every researcher had to be independent. Possibly I would have done no research for myself had it not been for World War I.\nTakagi then went on in\n[\n8\n]\nto describe the ideas that relaunched his research career:-\nConcerning class field theory, I confess that I was misled by\nHilbert\n.\nHilbert\nconsidered only unramified class fields. from the standpoint of the theory of algebraic functions which are defined by\nRiemann\nsurfaces, it is natural to limit consideration to the unramified case ... after the end of scientific exchange between Japan and Europe ... I was freed from that idea and suspected that every abelian extension might be a class field if the latter is not limited to the unramified case. I thought at first that this could not be true. were it false the idea should contain an error and I tried my best to find this error. At that time I almost suffered from a nervous breakdown. I dreamt often that I had resolved the question. I woke up and tried to remember my reasoning but in vain. I tried my utmost to find a counterexample to the conjecture which seemed all too perfect. finally I made my theory confirming this conjecture, but I could not rid myself of the doubt that it might contain an error which would invalidate the whole theory. I badly lacked colleagues who could check my work.\nTakagi spoke of his work on class field theory, building on\nHeinrich Weber\n's work, at the International Congress of Mathematicians in Strasbourg in\n1920\n. While in Europe he visited\nHecke\nand\nBlaschke\nin Hamburg. He wrote his most important paper in\n1920\nwhich introduced the Takagi class-field theory generalising\nHilbert\n's class field. In\n1922\nSiegel\npersuaded\nArtin\nto read this paper and its significance was realised. It became the framework of algebraic number theory.\nHasse\nincluded Takagi's theory in his treatise on class field theory a few years later. In\n1925\nHilbert\nwrote to Takagi in Japan asking if his paper could be published in\nMathematische Annalen\n.\nAround this time other mathematicians working in the same area as Takagi started to be appointed to Tokyo University and at last he had the mathematical colleagues he had longed for.\nIyanaga\n, the author of\n[\n6\n]\n, became Takagi's student in\n1926\n. He describes his teaching style\n[\n6\n]\n:-\n[\nTakagi gave\n]\nhis lectures without prepared papers, showing however, traits of spirit from time to time with sharp critical remarks, sometimes mixed with jokes. He spoke rather slowly in a low voice and almost never repeated the same thing; he wrote very neatly on the blackboard but the colour of his chalk was rather light; the speed of flow of his lecture was quite rapid and the students had to listen with great attention.\nSoon honours began to be given to Takagi for his outstanding work. He was honoured by Czechoslovakia, the university of Oslo, and the National Research Council of Japan. Fueter was President of the International Congress of Mathematicians at Zürich in\n1932\nand Takagi was appointed Vice-President. He served on the committee to award the first\nFields\nMedals for the\n1936\nCongress.\nIn\n1936\nTakagi retired but continued publishing books and papers. His two most important books from this time are\nIntroduction to analysis\n(1938)\n,\nAlgebraic number theory\n(1948)\nand an important work on the history of mathematics in the\n19\nth\ncentury. Takagi continued to live in Tokyo after he retired until\n1945\nwhen his house was destroyed by bombing near the end of World War II. He returned to the village of his birth, coming back to Tokyo in\n1947\nto live with his eldest son. His wife died of cancer in\n1952\nand Takagi himself died at the age of\n88\nin the hospital of Tokyo university.",
  "matematicos_citados_na_biografia": [
    "Todhunter",
    "George Salmon",
    "Serret",
    "Heinrich Weber",
    "Cayley",
    "Fuchs",
    "Frobenius",
    "Schwarz",
    "Hilbert",
    "algebraic number theory",
    "integral equations",
    "Kronecker",
    "Dedekind",
    "Riemann",
    "Hecke",
    "Blaschke",
    "Siegel",
    "Artin",
    "Hasse",
    "Iyanaga",
    "Fields"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}