{
  "nome_completo": "Theodoros A Varopoulos",
  "nome_curto": "Theodoros Varopoulos",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varopoulos/",
  "data_nascimento": "30 January 1894",
  "local_nascimento": "Astakos, Aetolia-Acarnania, Greece",
  "data_morte": "14 June 1957",
  "local_morte": "Thessaloniki, Greece",
  "summary": "Theodoros Varopoulos was a Greek mathematician known for his research in multivariable complex equations.",
  "biografia": "Theodoros Varopoulos\nwas born on\n30\nJanuary\n1894\ninto an impoverished family in the town of Astakos in Aetolia-Acarnania. His date of birth coincided with the day of celebration known as Greek Letters Day, the day on which Greeks celebrate the Three Hierarchs of the Orthodox Church who developed Greek literature and education. Spyridon Sarantopoulos, another great mathematician and university lecturer, was coincidentally born in Sparta in the same year. Let us note at this point that this biography is based closely on\n[\n2\n]\n, Melissa Iacovidou's translation of various Greek documents relating to Theodoros Varopoulos.\nVaropoulos was born three days before the death of his father. As his family was poor, his upbringing was taken over by his uncle, Nikolaos Tzanios, who was a teacher. He attended elementary school in Zervada, where his uncle worked as a primary school teacher. There was no secondary school in Zervada, so his uncle transferred to a school in Lefkada in order that Varopoulos and his brother could continue their education. Varopoulos loved his uncle dearly, and adored him the same way he adored his mother.\nA letter, dated\n2\nAugust\n1936\n, written by Varopoulos to\nPanagiotis Zervos\n, a professor at the University of Athens, gives us some further insight into his childhood. The letter reads:\n\"My dearest Professor,\nI am back in Lefkada, where I spent my earlier years\n(1905\n-\n1913)\n, and I am writing this letter, under the ancient olive groves of the island, to send you my best regards. I came here, before heading off to Paris on the\n16\nth August, to visit my old Uncle, who raised me, after my father died at the age of\n40\n. I was just\n3\ndays old then, and my uncle took on my father's role. I came to see him as he is now\n75\nyears old and is getting weaker. Here, I see again after\n23\nyears, the land which embraces my past. I observe with melancholy and I am moved by the harsh reality that the land has not changed, but the people around me have carried the burden of time, and are preparing to enter the 'Avenue of the Deceased' sooner or later. It is hard to ascertain this but it is, however, always sweet to return to the place where I was raised, and where I met hardship and, as a consequence, real life. It is sweet to return after\n23\nyears of wear and experience and look, even in vain, for the shadow I left in my land.\nWith love and respect, T Varopoulos.\"\nThis letter indirectly refers to his years in secondary school, and it is suggested that the\nGymnasium\nin Lefkada was where his inclination for mathematics and his brilliant academic performance was noticed.\nAfter finishing secondary school in Lefkada, Varopoulos, despite his financial difficulties, took the decision to continue his studies at Graduate School. He departed from his homeland with only\n135\ndrachmas in his pocket leaving his widowed mother who was determined to let him study at all costs, yet relying mainly on his personal support. Arriving in Athens, he passed the entrance examination and gained admission at the Military School. He was unable to pay the amount of money required when he enrolled, however, and after dropping out and wrote to the Mathematics Department of the Physics and Mathematics Faculty of the University of Athens. He enrolled in University in\n1914\n. During the day he attended lectures and at night worked at the Athens Telegraph, along with Nicholas Michalopoulos, who later became President of the\nHellenic Mathematical Society\n.\nDuring the years of his youth, life was quite hard. He worked as a clerk at the University of Athens and, as he was a calligrapher, he prepared all the degree certificates for the graduates of the University on parchment. As a student of the University of Athens, he was lucky to have professors such as Kyparissos Stephanos, whom he always admired,\nGeorgios Remoundos\n, whose work he continued as the successor of his research, and\nNikolaos Hatzidakis\n.\nThe well-qualified and outstanding mathematician, Kyparissos Stephanos, inspired Varopoulos' love of mathematical \"forms\". Although as a researcher Varopoulos always worked analytically, the nature of his lecturing and his writing always distinguished itself with the same conscious love of intellectual quality. In many ways he modelled his style on his teacher Stephanos.\nAs a researcher, Varopoulos was greatly influenced by\nRemoundos\n. Impetuous and imaginative in research,\nRemoundos\n, with his fascinating lectures and distinguished presence, produced a stream of research in multivariable complex equations, which influenced the great centre of mathematical analysis in Paris. As was common practice at this time, there was a tendency for fast publications of new results, but also revisiting and analysing known results. In the methods of research there was both the positive element of the way that ideas were being developed and also how the overall structure was moving forward. The way that progress was being made was in a climate of criticism which was important to the approach.\nAs a student of the University of Athens, Varopoulos, even though he also had to work to earn money during this time, managed to stand out among his fellow students. He graduated with the highest honours in mathematics from the University of Athens on\n5\nJune\n1918\n, and was awarded a Doctorate of Mathematics at the same University on\n30\nApril\n1919\n. Having heard of his outstanding performance, the famous professor Emmanuel Benakis, offered to fund his graduate studies in Paris.\nAt the beginning of April\n1920\n, with his studies in Paris funded by Emmanuel Benakis, he was admitted to École Normale Supérieure in Paris, thanks to strong references from\nGeorgios Remoundos\n, the Professor of Mathematical Analysis at Athens.\nRemoundos\nwas well known and well respected by the Paris mathematicians having studied there under\nHenri Poincaré\n,\nÉmile Picard\n,\nPaul Painlevé\nand\nPaul Appel\n.\nWhile he was a student of École Normale Supérieure and at the Sorbonne, Varopoulos was influenced by the ideas of\nRemoundos\n, his teacher in Athens, and began publishing papers in\nComptes Rendus\nof the French\nAcademy of Sciences\nof Paris. Varopoulos's paper\nSur quelque théoréms de M Remoundos\nⓉ\n(\nOn some theorems of M Remoundos\n)\n(1920)\nrefines theorems, postulated by\nRemoundos\nin a series of lectures at the University of Athens in\n1918\n-\n1919\n, about the theory of functions. It was presented to the\nAcademy of Sciences\nby\nJacques Hadamard\n. This was one of four papers Varopoulos published in the\nComptes Rendus\nof the French\nAcademy of Sciences\nin\n1920\n, the others being\nSur les fonctions algébroïdes et les fonctions croissantes\nⓉ\n(\nOn algebraic functions and increasing functions\n)\n,\nSur une classe de fonctions á un nombre infini de branches\nⓉ\n(\nOn a class of functions with an infinite number of branches\n)\n, and\nSur les zéros et les intégrales d'une class d'équations différentielles\nⓉ\n(\nOn zeros and integrals of a class of differential equations\n)\n. Also in\n1920\nhe published\nSur le module maximum des fonctions algébroïdes\nⓉ\n(\nOn the maximum module of the algebraic functions\n)\nin the Proceedings of the International Congress of Mathematicians held in Strasbourg in September of that year.\nThese publications helped him to obtain permission from the Mathematical Faculty of the University of Paris to obtain a doctorate based solely on a thesis without taking written examinations. Three years after entering the École Normale Supérieure, Varopoulous defended his thesis\nSur la croissance et les zéros á une classe de fonctions transcendantes\nⓉ\n(\nOn growth and zeros of a class of transcendent functions\n)\nbefore a committee, which was composed of professors from Sorbonne,\nErnest Vessiot\n,\nPaul Montel\n, and\nGaston Julia\n. On\n11\nMay\n1923\nbecame a doctor of the University of Paris with an honourable mention. He was allowed to continue working at the École where he remained until the end of\n1925\n.\nVaropoulos continued to publish in various journals such as:\n(1)\nComptes Rendus of the\nAcadémie des Sciences\nof Paris,\n(2)\nBulletin de la\nSocieté Mathématique de France\n,\n(3)\nBulletin des Sciences Mathématiques,\n(4)\nActa Mathematica,\n(5)\nProceedings of the\nAthens Academy\n,\n(6)\nProceedings of the International Congress of Mathematicians in Strasbourg,\n1920\n, and\n(7)\nProceedings of the International Congress of Mathematicians in Toronto,\n1924\n.\nFor a list of papers written by Varopoulos, all of which are either in French or Greek, see\nTHIS LINK\n.\nAs he was especially close with the great French mathematician\nPaul Montel\nand with several other members of the mathematical community of Paris, he travelled to Paris almost every year before the outbreak of World War II in\n1939\n. He was also respected by other great French mathematicians such as\nHenri Lebesgue\nand\nErnest Vessiot\n.\nReturning to Greece after his studies in Paris, he worked first as a secondary school teacher at the Athens College. In\n1927\nhe was appointed Professor of Mathematics at the Secondary School of Teaching and in\n1929\nhe was appointed as a temporary Assistant Professor of Advanced Analysis at the University of Athens. In\n1931\nhe was appointed as a Professor of Mathematics at the University of Thessaloniki, where he served until his death on\n14\nJune\n1957\nafter a long-term illness.\nVaropoulos married Aliki Stini on\n21\nSeptember\n1939\n. Aliki was a graduate of Natural Sciences, and they had one child, a son Nicholas Theodore Varopoulos. Born on\n16\nJune\n1940\n, Nicholas went on to study mathematics and became a professor at the Université Paris VI, the Université Pierre et Marie Curie. He is Varopoulos's only child. We give more details near the end of this article about Nicholas Varopoulos.\nTheodoros Varopoulos had a passion for mathematics which he cultivated, and in which he saw harmony and beauty. He said in his lectures \"a mathematical formula is true if it is elegant.\" In his spare time, he read poetry, especially French poetry, which he admired. He knew many French poets, especially Paul Verlaine, and he would often recite his poems by heart. He was also an excellent amateur photographer. His humour was playful but his words would sting when he wanted, and this was the source of many anecdotes, which are found in various of his letters. He adored his mother, who influenced him all his life. He wanted to see her well dressed in traditional Greek attire and not \"modernised\". He took care of her without any help, until her death. After she died he devoted entire Sundays to visiting her grave and paying his respect. The life of Varopoulos is split into two distinct periods, namely\n(\na\n)\nthe Hellenic-French period, which lasts approximately until the beginning of World War II; and\n(\nb\n)\nthe Greek period, which begins with World War II and continues until his death.\nAs a teacher he was lively. When teaching he used literary language coupled with humour. He was distinguished for culture. He tried to ensure that the conclusions of the mathematical arguments, which he developed on the board, would have an \"elegant\" form. He was a philosophical man, so during his lectures he would not only focus on exhibiting mathematical theories and formulae, but also developed the philosophical foundations of mathematical science.\nIn his dealings with his students, in terms of their scientific training, he was strict and unyielding, but showed interest in all their problems. He gave up his entire salary many times, to support students who were in need. Since he was one of the first professors in the Mathematics Department at the University of Thessaloniki, he worked extensively on its organisation and development. He was also very interested in hiring competent teachers who were talented lecturers of mathematics.\nVaropoulos even taught students who so excelled in mathematics that they have brought honour to Greece in the global mathematical community. Nicolas Baganas, professor at the University of Bordeaux and Nikos Artemiadis, Professor at the American University, were students of Varopoulos, whom he led in the direction of the research work undertaken by himself and by\nRemoundos\n. These two Greek mathematical researchers, and many others that Varopoulos directed towards mathematics, the science of harmony and symmetry, proves that, irrespective of any whims, Varopoulos inspired and aided worthy young mathematicians to go down the path of true research. This is due to the breadth with which he taught, although by nature he was not a teacher having great patience or persistence. But he had a tendency to push postgraduate students towards true understanding with his teaching of courses.\nThe identification of real roots of ordinary differential equations with real coefficients began in Greece with\nPanagiotis Zervos\n. The corresponding work for the complex roots of equations with complex coefficients appears in work by\nG Remoundos\nand was continued by his student Spyridon Sarantopoulos, but wis mainly developed by Varopoulos and\nPaul Montel\n.\nTopics that required little knowledge, but a lot of intuition and imagination were best suited to Varopoulos. He influenced his students and colleagues in this direction, in order to create a relative stream in the Greek scientific community.\nOften, Varopoulos would recommended his PhD students to complete their work with\nPanagiotis Zervos\n, a professor at the University of Athens, with whom he worked closely. The surviving correspondence between them demonstrates their cooperation, in which\nPaul Montel\nalso sometimes took part.\nVaropoulos published several articles in the mathematical journals of France and Sweden. This is where a significant portion of the work done by his son Nicholas, who studied mathematics in the United Kingdom after the death of his father, has been published. He obtained doctoral degrees in mathematics in England from the University of Cambridge, and in Paris from Paris-Sud Orsay. He worked as a researcher at CNRS, the National Centre for Scientific Research, and taught at the University of Cambridge in\n1965\n. He was a member of the Institute for Advanced Study at Princeton in\n1966\n-\n67\n, and at the\nMittag-Leffler\nInstitute in Stockholm. He also served as a visiting professor at UCLA. He then settled in France, where he holds a mathematics degree from the Paris-Sud Orsay University, and from\n1981\nonwards he worked in Paris. He has been a member of Institut de France since\n1995\n. He has been awarded the prestigious Prix Salem in\n1968\nand the Prix Osiris by the\nAcademy of Sciences\nin Paris as well as the title of Honorary Doctor from the University of Athens. He is highly distinguished in the field of harmonic analysis, a branch of modern mathematics which has a close connection to the field of classical mathematics in which his father was interested. We note that he was an invited speaker at the International Congress of Mathematicians in Nice in\n1970\nand again at Kyoto in\n1990\n.\nTheodoros Varopoulos was a member of the Editorial Committee of the journal \"Bulletin de Sciences Mathématiques\" from September\n1927\nto October\n1928\n. For his above-mentioned service there is also a letter of thanks sent to him by the great French mathematician\nÉmile Picard\n. Varopoulos was also a close associate of the journal\nEuclid\nof the\nHellenic Mathematical Society\n, when the editorial responsibility was held by the president of the Society, Aristides Pallas, with whom he was a close friend. He published a very interesting short article in\nEuclid\nentitled\nThe curve of intelligent people\n.\nVaropoulos died from stomach cancer at the age of\n63\n. For announcements of his death from various sources see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Panagiotis Zervos",
    "Gymnasium",
    "Hellenic Mathematical Society",
    "Georgios Remoundos",
    "Nikolaos Hatzidakis",
    "Remoundos",
    "Henri Poincaré",
    "Émile Picard",
    "Paul Painlevé",
    "Paul Appel",
    "Academy of Sciences",
    "Jacques Hadamard",
    "Ernest Vessiot",
    "Paul Montel",
    "Gaston Julia",
    "Académie des Sciences",
    "Societé Mathématique de France",
    "Athens Academy",
    "THIS LINK",
    "Henri Lebesgue",
    "G Remoundos",
    "Mittag-Leffler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}