{
  "nome_completo": "Thomas Little Heath",
  "nome_curto": "Thomas Heath",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heath/",
  "data_nascimento": "5 October 1861",
  "local_nascimento": "Barnetby le Wold, Lincoln, England",
  "data_morte": "16 March 1940",
  "local_morte": "Ashtead, Surrey, England",
  "summary": "Thomas Heath wrote important works on the History of Mathematics: in particular on the mathematics of the ancient Greeks.",
  "biografia": "Thomas Heath\n's parents were Mary Little, from Hibaldstowe, Lincolnshire, and Samuel Heath who was a farmer from Thornton Cutris, Ulceby, Lincolnshire. Mary and Samuel had six children, three sons and three daughters. Thomas was the youngest of the three boys and he, like all the children, was musical and academically gifted. Thomas Little Heath was named after his grandfather on his mother's side, who was Thomas Little. He received a love of the classics from his father who had classics as his hobby.\nAfter attending Caistor Grammar School and Clifton College, he went up to Trinity College Cambridge in\n1879\nholding a foundation scholarship. He was awarded a first class degree in both mathematics and classics. He took Part I and Part II of the Classical Tripos in\n1881\nand\n1883\n, being twelfth\nwrangler\nin the Mathematical Tripos of\n1882\n.\nHe took the Civil Service examination in\n1884\nand obtained the top mark. He became a clerk in the Treasury and was quickly promoted. He was private secretary to Sir Reginald Earle, later becoming permanent secretary. Heath was then private secretary to various financial secretaries at the Treasury up to\n1907\nwhen he was appointed Assistant secretary to the Treasury. In\n1913\nhe was appointed as permanent secretary to the Treasury, taking control of the administrative side of the Treasury. He left the Treasury in\n1919\nfor the National Debt Office, holding a post there until he retired in\n1926\n. He was honoured for his work in the Civil Service by being appointed C.B. in\n1903\n, K.C.B. in\n1909\n, and K.C.V.O. in\n1916\n.\nHeath was\n[\n2\n]\n:-\n... an admirable example of the older type of Civil servant. His courage and honesty were beyond question; his technique was perfect; but his mind was not, perhaps, sufficiently pliable or fertile in ideas to adapt itself readily to the conditions which between\n1914\nand\n1918\nhad upset every kind of preconceived ideas of the desk and paper man, such as he really was.\nHowever Heath had two separate careers, one as a civil servant, the other as one of the leading world experts on the history of mathematics. He was a specialist in the history of Greek mathematics, writing articles on '\nPappus\n' and 'Porisms' for\nEncyclopaedia Britannica\nwhile still an undergraduate. In his first year at the Treasury he wrote an essay on\nDiophantus\nand this won him a Cambridge Fellowship.\nCayley\nrecommended its publication by Cambridge University Press and\nDiophantus of Alexandria: a study in the history of Greek algebra\nappeared in\n1885\n.\nIn\n1896\nhe published\nApollonius of Perga\nwhich presented the important text on conic sections using modern notation, and it contained an important preface giving details of previous Greek work on conic sections.\nArchimedes\nwas published in\n1897\nbut at this stage the important work called\nThe Method\nhad not been discovered, so Heath added a translation of this in an edition he brought out in\n1912\n. In\n1908\nHeath's three volume work on\nEuclid\nappeared. The second edition of his translation of\nEuclid\n, brought out in\n1926\n, has since become the standard English version of the text. Between these two editions, in\n1920\n, he published his version of Book I of the\nElements\nwritten in Greek. This was intended to encourage schools to teach directly from Book I, but it does make us realise how things have changed in British schools today - how many of today's schoolchildren could use a book written in Greek as their mathematics textbook!\nGreek astronomical work also attracted Heath's attention and in\n1913\nhe published a translation of\nAristarchus\n's\nOn the sizes and distances of the sun and moon\nagain with an important preface, this time giving a thorough account of Greek astronomy. Perhaps his most famous work, however, is\nHistory of Greek Mathematics\nwhich appeared in\n1921\n. It is a two volume work, cleverly written by partly following a chronological path, partly grouping subject areas together. A single volume version on Greek mathematics, condensing the material from his earlier work, appeared in\n1931\nunder the title\nA manual of Greek mathematics\nand the following year he produced a companion volume\nGreek astronomy\n.\nHeath was elected a Fellow of the\nRoyal Society\nin\n1912\nand served for two terms on its council. Following the publication of\nHistory of Greek Mathematics\nhe was elected president of the\nMathematical Association\nfor\n1922\n-\n23\n. In\n1932\nhe was elected a fellow of the British Academy.\nOne might think that having a career in the Civil Service and yet being a leading historian of mathematics would leave Heath little time for other hobbies but in fact this was not so. He was always interested in music and he had married Ada Mary Thomas in\n1914\n, who was a professional musician, reinforcing his interest. Heath also spent time mountaineering\n[\n2\n]\n:-\n... and he made most of the principal ascents in the Dolomites.\nHe died at Merry Hall in Ashtead, Surrey.",
  "matematicos_citados_na_biografia": [
    "wrangler",
    "Pappus",
    "Diophantus",
    "Cayley",
    "Euclid",
    "Aristarchus",
    "Royal Society",
    "Mathematical Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}