{
  "nome_completo": "Timothy John Pedley",
  "nome_curto": "Timothy Pedley",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pedley/",
  "data_nascimento": "23 March 1942",
  "local_nascimento": "Leicester, England",
  "data_morte": null,
  "local_morte": null,
  "summary": "Tim Pedley is an English mathematician whose principal research interest is the application of fluid mechanics to biology and medicine.",
  "biografia": "Timothy Pedley\nis known as\nTim Pedley\nto all his friends and colleagues. He is the son of Richard Rodman Pedley\n(1912\n-\n1973)\nand Jean Mary Mudie Evans. Richard Pedley was educated at Foster's School, Sherborne, and Downing College, Cambridge, before becoming an Assistant Master at the City of Leicester Boys' School in\n1934\n. He married Jean M M Evans\n(\nknown as Jeanie\n)\nin\n1938\n. World War II broke out in\n1939\nand in\n1940\nRichard Pedley left the City of Leicester Boys' School to serve in the forces. Tim was born in\n1942\n, in the midst of World War II, while his father was serving in the army.\nPedley's early years were spent in different cities as his father changed jobs. After his war service ended in\n1946\n, Richard Pedley returned briefly to Leicester where his family had remained during the war, and then took up a position in St Olave's School in York. He remained at this junior school from\n1946\nto\n1950\nwhen he returned to the City of Leicester Boys' School as the Headmaster. After four years in Leicester he became Headmaster of the Chislehurst and Sidcup Grammar School. Tim Pedley became a boarder at Rugby School, where he excelled in all subjects, especially science and mathematics. After graduating, he entered Trinity College, University of Cambridge. He graduated with a first degree from Cambridge and then, supported by a Research Studentship from the Science Research Council of Great Britain, he undertook research on fluid mechanics. He had been awarded the Mayhew Prize in\n1963\n, a prize awarded annually by the Department of Mathematics at Cambridge to the best student in applied mathematics. After three years of research, he was awarded a doctorate in\n1966\nfor his dissertation\nPlumes, bubbles, and vortices\n. His thesis advisor at Cambridge was\nGeorge Batchelor\n. After graduating he went to Johns Hopkins University in the United States in\n1966\nto work with Owen Phillips as a post-doctoral fellow supported by the U.S. Office of Naval Research.\nWhile he had been undertaking research for his doctorate, Pedley had married Avril Jennifer Martin Uden in\n1965\n. Avril is the younger daughter of Bernard Gilbert Uden\n(1910\n-\n1990)\nand Joyce Evelyn Bridgewater\n(1999\n-\n2000)\n. Bernard Uden took the additional Christian name of Grant after his Grandmother's surname and from then on was known as Grant Uden. He was a collector of weird and wonderful facts, mostly concerning the literary world, and wrote books such as\nHigh Horses\n(1976)\n,\nAnecdotes from History\n(1968)\n, and\nUnderstanding Book Collecting\n(1982)\n. Tim and Avril Pedley have two sons, Jonathan Richard Pedley and Simon Grant Pedley.\nTim Pedley published\nThe stability of rotating flows with a cylindrical free surface\n(1967)\n. The first few sentences of the Abstract gives a good impression of the topic studied:-\nThe stability to small inviscid disturbances of a rotating flow is investigated when one boundary of the flow is a free surface under the action of surface tension, and the other is either at infinity, or a rigid cylinder, or at the axis. The free surface may be the inner or the outer boundary.\nPedley gave the following acknowledgement in the paper:-\nThe author would like to record his thanks to Professor\nG K Batchelor\nof the Department of Applied Mathematics and Theoretical Physics, Cambridge University, for his help and encouragement throughout the course of this research, which was performed while the author was in receipt of a Research Studentship from the Science Research Council of Great Britain. Final preparation and revision of the manuscript took place with the support of the U.S. Office of Naval Research ...\nHis next paper\nThe toroidal bubble\n(1968)\nwas again reporting on research undertaken at Cambridge but written up while at Johns Hopkins University. The Abstract begins:-\nIt has been observed by Walters & Davidson\n(1963)\nthat release of a mass of gas in water sometimes produces a rising toroidal bubble. This paper is concerned with the history of such a bubble, given that at the initial instant the motion is irrotational everywhere in the water. The variation of its overall radius a with time may be predicted from the vertical impulse equation, and it should be possible to make the same prediction by equating the rate of loss of combined kinetic and potential energy to the rate of viscous dissipation. This is indeed seen to be the case, but not before it is recognized that in a viscous fluid vorticity will continually diffuse out from the bubble surface, destroying the irrotationality of the motion, and necessitating an examination of the distribution of vorticity.\nThe acknowledgement states:-\nI should like to express my thanks to Prof\nG K Batchelor\nand Dr F P Bretherton of the Department of Applied Mathematics and Theoretical Physics, Cambridge University, for several stimulating discussions during the course of this work, which was performed while I was in receipt of a Research Studentship from the Science Research Council of Great Britain. Final preparation and revision of the manuscript was carried out at the Johns Hopkins University with the partial support of the U.S. Office of Naval Research ...\nTwo further papers which appeared in the same year were\nOn the instability of rapidly rotating shear flows to non-axisymmetric disturbances\n(1968)\nand\nSimilarity solutions for turbulent jets and plumes in a rotating fluid\n(1968)\n.\nIn\n1968\nPedley returned to England when he was appointed as a Lecturer in the Physiological Flow Studies Unit and the Department of Mathematics of Imperial College, London\n[\n7\n]\n:-\nThe pioneering Physiological Flow Studies Unit was established in\n1966\nunder the leadership of the medically trained Professor Colin Caro and mentored by his long term friend and research collaborator Professor\n(\nlater Sir\n)\nJames Lighthill\n, then the\nRoyal Society\nresearch Professor at Imperial College. It was shortly after this in\n1968\n, through the encouragement of\nJames Lighthill\n, that Tim joined the Physiological Flow Studies Unit, with a concurrent appointment in the Mathematics Department at Imperial. ... Five influential years of research followed within the Physiological Flow Studies Unit that helped further to shape his future academic direction.\nFrom the time of this appointment he became interested in Biological Fluid Dynamics and began collaborating with Robert C Schroter and M F Sudlow. Robert Schroter has a Ph.D. in chemical engineering and had become a member of the new Physiological Flow Studies Unit at Imperial College in\n1966\n. M F Sudlow was also a member of the Physiological Flow Studies Unit at Imperial College. These three authors published\nThe prediction of pressure drop and variation of resistance within the human bronchial airways\n(1970)\n,\nEnergy losses and pressure drop in models of human airways\n(1970)\n, and\nFlow and pressure drop in systems of repeatedly branching tubes\n(1971)\n. As an example of the content of these papers we give the Abstract of the\n1971\npaper:-\nThe airways of the lung form a rapidly diverging system of branched tubes, and any discussion of their mechanics requires an understanding of the effects of the bifurcations on the flow downstream of them. Experiments have been carried out in models containing up to two generations of symmetrical junctions with fixed branching angle and diameter ratio, typical of the human lung. Flow visualization studies and velocity measurements in the daughter tubes of the first junction verified that secondary motions are set up, with peak axial velocities just outside the boundary layer on the inner wall of the junction, and that they decay slowly downstream. Axial velocity profiles were measured downstream of all junctions at a range of\nReynolds\nnumbers for which the flow was laminar.\nPedley left Imperial College, London, in\n1973\nwhen he was appointed as a lecturer in the Department of Applied Mathematics and Theoretical Physics at the University of Cambridge. At the same time he was elected a Fellow of Gonville & Caius College of the University of Cambridge. In\n1976\nthe University of Cambridge had \"Applications of Mathematics to Biology\" as the subject of their\nAdams\nPrize. This prize, named for\nJohn Couch Adams\n, was endowed by members of St John's College and first awarded in\n1850\n. Pedley was awarded the\n1976\nAdams\nPrize for \"The fluid mechanics of large blood vessels and of bronchial airways\".\nPedley edited the book\nScale Effects in Animal Locomotion\n(1977)\nand was a co-author of the book\nThe Mechanics of Circulatio\nn\n(1978)\n. We give some extracts from reviews at\nTHIS LINK\n.\nIn\n1980\nhe attended the Fifteenth International Congress on Theoretical and Applied Mechanics held at the University of Toronto in Canada. He gave the lecture\nPhysiological fluid mechanics\n, and published a paper on that topic in the\nProceedings\nof the Conference. The contents of this lecture give a good indication of the areas of research which Pedley was working on at this time. Here is the author's summary:-\nAfter a brief survey of the whole field, three problems are selected for more detailed consideration: the flow of blood near the mouth of an arterial side branch, in an attempt to predict the wall shear stress in the parent artery; fluid flow in collapsible tubes such as veins; coupled salt and water transport of pumping epithelia. It is concluded that the problems of greatest biological importance are generally of microscopic scale, and fluid mechanics research must proceed in close conjunction with physiological experiment.\nIn\n1984\nhe published the survey\nWave phenomena in physiological flows\nand again the author's summary gives a good guide to Pedley's thinking at this time:-\nMost of this survey is concerned with wave phenomena in elastic tubes through which an incompressible fluid is flowing. This is applicable to many physiological phenomena, of which the most obvious concern blood flow in arteries and veins. Section\n2\noutlines the simple one-dimensional theory of pulse propagation in distended vessels, based on a 'tube law' to describe the elastic properties, and points out that there are a number of features\n(\ninvolving\n(\na\n)\nwave attenuation and\n(\nb\n)\nlocalized constraints\n)\nthat the simple theory still cannot explain. In Section\n3\nthe analysis of wave reflection is illustrated with a recent nonlinear model of reflection at a severe constriction. Section\n4\nconsiders flow in collapsible tubes, showing that steady flow must in many cases break down, and summarizing a new model for the large amplitude oscillations that are observed in laboratory experiments. Section\n5\npresents experiments and theory that demonstrate the existence of waves in a channel that is rigid apart from an oscillatory indentation in one wall.\nIn\n1989\nPedley was promoted to Reader at Cambridge but soon after that left to take up the position of Professor of Applied Mathematics at Leeds University in\n1990\n. The research we have given details of above is concerned with internal physiological fluid mechanics, namely the study of fluid flow inside living organisms. His later research involved external fluid mechanics, namely the interaction of living organisms with their fluid environment. Particular examples he studied are fish swimming and, especially, the collective behaviour of swimming micro-organisms. An example of his work in this latter area is reported in his paper\nThe growth of bioconvection patterns in a uniform suspension of gyrotactic micro-organisms\n(1988)\nwritten jointly with Nick A Hill and John O Kessler. Both Nick Hill and John Kessler worked with Pedley in Department of Applied Mathematics and Theoretical Physics, University of Cambridge in the second half of the\n1980\ns but Hill and Pedley came together again in Leeds where Hill was appointed as a lecturer in November\n1989\n.\nPedley was elected a Fellow of the Royal Society of London in\n1995\nand, in the following year, he returned to Cambridge when he was appointed as\nG I Taylor\nProfessor of Fluid Mechanics in the Department of Applied Mathematics and Theoretical Physics, University of Cambridge. He was Head of the Department of Applied Mathematics and Theoretical Physics at Cambridge from\n2000\nto\n2005\n. He retired in\n2009\nand was made Emeritus Professor of the University of Cambridge.\nLet us now record Pedley's research interests, as given on his website\n[\n6\n]\n.\nBlood flow and wall shear stress in arteries: time-dependent flow in tubes of complex three dimensional geometry. Medical application of blood flow on atherosclerosis; the failure of femoral bypass grafts. Mechanics of individual endothelial cells.\nGas flow and mixing in pulmonary airways: energy loss during oscillatory flow; shear-augmented dispersion of gases. Medical application: high-frequency ventilation of premature infants; delivery of anaesthetic or polluting gases; drug supply by aerosol.\nFlow and self-excited oscillations in collapsible tubes. Biological and medical applications: blood-flow in the\n(\ngiraffe\n)\njugular vein, flow limitation and wheezing on forced expiration, hydrodynamics in the presence of prostatic hypertrophy.\nPeristaltic pumping in the ureter: the coupling of hydrodynamics to\n(\nsmooth\n)\nmuscle mechanics.\nModelling salt and water transport across cell membranes and pumping epithelia.\nFish swimming: the coupling of hydrodynamics to\n(\nskeletal\n)\nmuscle mechanics and tissue solid mechanics.\nInsect aerodynamics:\n(\ncf. recent experiments by C P Ellington Zoology\n)\n.\nAquatic filter feeding.\nBioconvective pattern formation in suspensions of swimming micro-organisms\n(\na\n)\ngyrotatic algae,\n(\nb\n)\nchemotactic bacteria.\nDevelopment of macroscopic or continuum models of populations of biological organisms whose individual, microscopic behaviour is random and whose environment may also be random. Examples: plankton interaction in a turbulent ocean; chemotactic bacteria in moving fluids; uptake or production of chemicals by cells in a bioreactor.\nWe have already given some details above of honours given to Pedley for his outstanding research contributions. Let us here give details of some further honours he has received. He was elected Foreign Associate of the US National Academy of Engineering in\n1999\n, a Fellow of the American Institute for Medical and Biological Engineering in\n2001\n, a Fellow of the American Physical Society in\n2005\n, a Fellow of the National Academy of Sciences, India in\n2007\n, and a Member of the Physics and Engineering Sciences Section of the Academia Europaea. He was invited to deliver the\nG I Taylor\nLecture at the University of Cambridge in\n1998\n. He was invited to give the Clifford Lecture at Tulane University in\n2003\n. In the same year he delivered the\nRoyal Society of London\n's Rutherford Lecture. This lecture was set up in\n1950\nand is given in various Commonwealth countries. Pedley gave the Rutherford Lecture in New Zealand. In\n2004\nhe was invited to give the\nTalbot\nLecture at the University of Illinois. In\n2008\nPedley and\nJ D Murray\n, were jointly awarded the Gold Medal of the\nInstitute of Mathematics and its Applications\nin recognition of their:-\n... outstanding contributions to mathematics and its applications over a period of years.\nLet us end this biography by recording that Pedley's hobbies include birdwatching, running and reading.",
  "matematicos_citados_na_biografia": [
    "George Batchelor",
    "G K Batchelor",
    "James Lighthill",
    "Royal Society",
    "Reynolds",
    "Adams",
    "John Couch Adams",
    "THIS LINK",
    "G I Taylor",
    "Royal Society of London",
    "Talbot",
    "J D Murray",
    "Institute of Mathematics and its Applications"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}