{
  "nome_completo": "Thomas Scott Blyth",
  "nome_curto": "Tom Blyth",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Blyth/",
  "data_nascimento": "3 July 1938",
  "local_nascimento": "Newburgh, Fife, Scotland",
  "data_morte": "18 May 2024",
  "local_morte": "Strathkinness, Fife, Scotland",
  "summary": "Tom Blyth published around 150 works, mainly on ordered algebraic structures and on semigroups. He wrote a number of important monographs and undergraduate textbooks.",
  "biografia": "Thomas Scott Blyth\n(\nknown as TSB or Tom Blyth\n)\nwas the son of Robert Duncan Blyth\n(1909\n-\n1969)\nand Alice Wallace Scott\n(1911\n-\n1970)\n. Robert Blyth was born in Newburgh, Fife, and became a linoleum factory worker. Alice Scott was born in Lochgelly, Fife and became a hospital seamstress. Robert and Alice Blyth were married in Newburgh in\n1934\nand lived at\n45\nHigh Street, Newburgh. They had three children, all born in Newburgh: David Blyth\n(\nborn\n1936)\n; Thomas S Blyth\n(\nborn\n1938)\n, the subject of this biography; and Elizabeth A Blyth\n(1949\n-\n2019)\n.\nTom attended Newburgh Primary School but his mother Alice, who was very musical, was keen that he should also have musical training so she sent Tom to Perth for violin lessons. In\n1950\nTom began his secondary education at Bell Baxter High School in Cupar, Fife. Tom is in the\nClass\n1\nA\n1\nphotograph\nand, we note, so is Elizabeth Mary Farmer. Six years later, Tom would be the Dux of Science, while Elizabeth would be the Dux of Arts. Elizabeth Farmer later married\nAlex Craik\nwho was in the same undergraduate mathematics class as Tom at the University of St Andrews.\nLet us return to Tom's time at Bell Baxter High School. When he moved up to Bell Baxter in Cupar, he continued with the violin, eventually becoming leader of the school orchestra which led to his lifelong love of classical music. He was taught mathematics by Ken Nicol who had joined the staff at Bell Baxter in\n1949\n. Tom was always grateful to Ken Nicol for giving him a solid start in mathematics. He did, however, teach himself some advanced calculus since he believed the curriculum was moving far too slowly for him. Barbara Miller related the following in\n[\n21\n]\n:-\nTom knew that not all his fellow pupils shared his passion for mathematics and science so one day, when he was unexpectantly put in charge of a chemistry class as the teacher was absent, he decided to encourage the youngsters to melt down their protractors, which he believed they would have no further need for, to create nail varnish. There is no record of what the head teacher thought of this particular venture.\nIn\n1955\n-\n56\nTom was a prefect at Bell Baxter and, as we noted above, was Dux in Science in\n1956\n. Later that year, in October, he began his studies at the University of St Andrews. Having sat the University of St Andrews Bursary Competition, he had been awarded an entrance bursary. He went straight into Special Mathematics, the second year mathematics course, but took first year courses in applied mathematics and physics. Four other outstanding students began their university studies in the same Special Mathematics class, namely Patrick D L Constable,\nAlex D D Craik\n, Michael Moss and Grant Walker. One further outstanding student Bruce L R Shawyer was also in this Special Mathematics class, but he had started his university studies one year earlier and had won the Class Medal for the General Mathematics course in\n1955\n-\n56\n. This was a remarkable year with the six we have mentioned all going on to become outstanding mathematics teachers in universities.\nA picture of the Senior  Honours Class of\n1959\n/\n60\nis at\nTHIS LINK\n.\nBefore continuing to describe Tom Blyth's career, let us record at this point a few details of the careers of Tom's five fellow students.\nBruce Shawyer\n(1937\n-\n2021)\n, was influenced by\nDavid Borwein\nto become an analyst and, with\nDavid Borwein\nas his thesis advisor, was awarded a Ph.D. from the University of St Andrews in\n1963\n. After teaching at the University of Nottingham he went to Canada in\n1966\nwhere he spent the rest of his career, first at the University of Western Ontario\n(1966\n-\n1985)\nand then at Memorial University\n(1985\n-\n2002)\n. Patrick D L Constable joined the statistics staff at the University of St Andrews teaching there until\n1969\n. He later joined the Department of Statistics at the University of Leeds.\nAlex D D Craik\nstudied for a Ph.D. at the University of Cambridge, and then was appointed as a lecturer in the Department of Applied Mathematics at the University of St Andrews in\n1963\n. He became a leading expert on fluid mechanics and, towards the end of his career, an outstanding historian of mathematics. Michael Moss and Grant Walker both studied for a Ph.D. in topology at the University of Cambridge, advised by\nFrank Adams\n. Michael Moss taught at the University of Stirling, while Grant Walker taught at the University of Manchester.\nWe have given details of Tom Blyth's five fellow students who went on to academic careers to show what a talented group of mathematicians he joined in\n1956\n. They were taught by excellent lecturers who included\nEdward Copson\n, who was the Regius Professor of Mathematics,\nDan Rutherford\n,\nDavid Borwein\n,\nArthur Hinton Read\nand\nRonald Mitchell\n. Blyth studied the Junior Honours course in\n1957\n-\n58\nthen spent two years taking Senior Honours courses, both in\n1958\n-\n59\nand\n1959\n-\n60\n. In\n1959\nhe was awarded the Duncan Prize in Applied Mathematics. As was customary at this time, he sat all the honours examinations papers at the end of his final year. He sat the papers: Geometry and Algebra; Algebra and Foundations; General Analysis; Statics; Dynamics; Fluid Dynamics; and Abstract Algebra. He was awarded a First Class honours degree in Mathematics and graduated in July\n1960\n.\nAn outstanding undergraduate performance led to Blyth being awarded a NATO research scholarship to study in Paris at Sorbonne University. It was\nDan Rutherford\nwho had encouraged Blyth to go abroad for his doctoral studies and it was certainly advice that Blyth appreciated since the experience would define the style and topics that Blyth would spend rest of his life studying. He wrote about his experiences in\n[\n5\n]\n:-\nIt was\nDan Rutherford\nwho suggested that I should follow the old Scottish tradition of doing research on the Continent.\n(\nI discovered somewhat later that he, who had a doctorate from Amsterdam, was the only example of this old tradition that I could find!\n)\nThus he arranged for me to go to Paris with a NATO scholarship, to be supervised by Madame\nDubreil-Jacotin\n. This was my first trip out of the UK and it was arranged that I meet her at the Institut\nHenri Poincaré\nat\n5\npm on the day after I arrived in Paris. Equipped with only high school French\n(\nmost of which I had forgotten during my undergraduate years\n)\n, and feeling as hopeless as an illegal immigrant, I managed to find my way there with the aid of a borrowed map of the Métro. The meeting was memorable. Naturally the first thing I asked was if she spoke English, to which she replied simply 'En France, on parle Français'. After an hour or so, during which my French improved dramatically, she told me to accompany her in her car since she had to go to the Place Vendôme to meet her husband. On reaching the ground floor of the Institut\nPoincaré\nwe encountered a throng of students which parted for her as did the sea for Moses. Scurrying along in her wake, I realised that this was no ordinary Professor. On arriving at the Place Vendôme she told me to see her again in two weeks, after I had enjoyed discovering some of the niceties of Paris. A handshake and an au revoir left me to find my own way back to the Collège Franco-Britannique where I was staying. Luckily I had that Métro map!\nSupervision by her was a joy. She claimed that she could not easily read my writing\n(\nin truth it was the other way round\n)\nand gave me a portable typewriter to prepare the material for her inspection. We met every two or three weeks in the late afternoon, either in her office or at her house in the\n16\nth arrondissement. This was invariably followed by dinner, often in restaurants that I could never hope to afford.\nI last met her in\n1970\n. At the International Congress in Nice there was a splinter group on Semigroups, chaired by her husband\nPaul Dubreil\n. At the beginning of one of the sessions he called the rabble audience to order. In our thus interrupted conversation she wryly commented to me 'il y a des professeurs qui sont les dictateurs' to which I could not resist the reply 'oui, et il y en a qui sont les dictatrices!' Her jovial acceptance of this will always remain with me.\nI owe her, and her husband\nPaul Dubreil\n, my entire subsequent career and memories of them stir great affection.\nAs we have learnt from this quote, in Paris he studied at the Institut\nHenri Poincaré\n, part of the Sorbonne University, advised by\nMarie-Louise Dubreil-Jacotin\n. He quickly learnt to speak French, acquired a lifelong appreciation for red wine and made several good friends including James Galway now known as \"The Man with the Golden Flute\". Blyth undertook research on ordered algebraic structures. He quickly obtained new results and published the two-part paper\nLa forme générale des structures algébriques résiduées\nⓉ\n(\nThe general form of residuated algebraic structures\n)\nwhich appeared in the Academy of Sciences'\nComptes Rendus\nin\n1962\n. He was awarded a Docteur en Science 'Très Honourable' for his thesis\nContribution à la théorie de la résiduation dans les structures algébriques ordonnées\nⓉ\n(\nContribution to the theory of residue in ordered algebraic structures\n)\n(1963)\n. Details are available in the review\n[\n7\n]\n.\nBlyth returned to St Andrews to take up an appointment as a Lecturer in Mathematics in October\n1963\n. In session\n1964\n-\n65\nhe delivered the Special Topic course\nOrdered Algebraic Structures\n. I\n[\nEFR\n]\ntook this course which was given in the style of\nBourbaki\n. The lectures were carefully prepared and Blyth presented much material which had evolved from his own research. The class was quite small and the lectures were delivered in the Mathematics Class Library. For me the course was exciting, introducing me for the first time to the cutting edge of research in an algebraic topic.\nAs was common at that time, many newly appointed lecturers were appointed as a subwarden in a university residence. Blyth became a subwarden in St Regulus Hall of residence and became friendly with the cook Jane Pairman\n[\n21\n]\n:-\nTom Blyth married Jane Ellen C Pairman\n(\nborn\n1942\nin St Andrews\n)\nwhose parents ran the tavern in Strathkinness and whose grandparents had run the Whey Pat Tavern in St Andrews. Jane was working as a Head Cook at the St Regulus Hall of residence in St Andrews and Tom was a subwarden there at the same time. They were married at the University Chapel in\n1967\nand moved into a house built by Jane's father, next to the Tavern in Strathkinness, where they spent their entire married life. On Saturday nights Tom would invariable be roped in to help out behind the busy tavern bar where he could pull a perfect pint.\nThe Blyths spent the year\n1968\nin Canada where Tom Blyth was based at the University of London Ontario for a sabbatical year. Tom and Jane Blyth had one child, Abigail, born in\n1970\n. Also in\n1970\n, in September of that year, Blyth attended the International Congress of Mathematicians in Nice, France. He was very happy to be back in France and meeting up with\nMarie-Louise Dubreil-Jacotin\n,\nPaul Dubreil\n, and many of his French friends.\nIn\n1972\nBlyth was promoted to Senior Lecturer and, in the following year, to Reader. By\n1972\nhe had\n23\nworks in print including his first monograph\nResiduation theory\nwhich he co-authored with Melvin F Janowitz from the University of Massachusetts. Blyth and Janowitz write in the Preface:-\nThis text has grown out of courses given by T.S.B. at the Universities of St Andrews, Western Australia and Western Ontario and by M.F.J. at the Universities of Massachusetts, New Mexico and Western Michigan. In this\n(\nhopefully happy\n)\nmarriage of our efforts, the choice of text material has, quite frankly, been selfish and more or less motivated by our own research interests. It was never our intention to write an encyclopaedia on the subject\n(\nwe leave that happy task to someone else!\n)\nbut rather to produce a self-contained and unified introduction to the subject which may be used either as a textbook or as a reference book in this area.\nFor more information about this book and other books by Tom Blyth, see\nTHIS LINK\n.\nThe first time I\n[\nEFR\n]\nwas asked to teach the first year mathematics course, I took over from Tom who had taught the course in the previous year. He offered me his lecture notes which I gratefully accepted. They were beautifully written notes in such a polished form that one felt they could be sent straight to a publisher. Although I gave the course a personal flavour, I relied heavily on Tom's notes which I found very helpful since they were so well thought out.\nBlyth became Professor of Pure Mathematics in\n1977\nand was promoted to Senior Professor in\n1979\n. Between\n1982\nand\n1987\nhe was Chair of the Department of Pure Mathematics and in\n1982\n-\n1987\nhe was Dean of the Faculty of Science\n[\n20\n]\n:-\nA vital member of the University community, Tom undertook many different roles during his career at St Andrews. He was a member of the Library Committee, the University Printing Committee, and indeed the Senate's Advisory Committee on Committees! Perhaps one of his favourite roles was as convener of the Graduation Ceremonial Committee. He had a reputation in his administrative work for his down to earth, no-nonsense approach, with the promotion of academic excellence always the motivating force. As Senior Professor he played a major role at the installation ceremony of Dr Brian Lang as Principal in\n2001\n.\nWhen his daughter Abigail was in her final year at school at Madras College in\n1987\n/\n88\n, Tom decided to ensure she did well in the Sixth Year Studies Mathematics examinations\n[\n21\n]\n:-\nAbigail remembers when she was studying mathematics in her final year at school she was having a bit of a struggle with algebra and calculus. To help her, Tom took down all the adolescent posters of pop stars and bands on one of the walls of her room and put up a plastic sheet to create a huge makeshift whiteboard. Every night he would put up a new algebra problem and a calculus problem on the whiteboard and Abigail would be expected to solve both before supper. When Abigail received her Sixth Year Studies results, she opened the envelope, turned to her Dad, and said, \"We've got an A.\"\nIn\n2003\nBlyth retired and was made Emeritus Professor. After retiring he presented his splendid Parisian doctoral robes to the University museum.\nWe gave details of his first monograph\nResiduation theory\n(1972)\nabove. He wrote four further monographs:\nModule theory. An approach to linear algebra\n(1977)\n;\nCategories\n(1986)\n;\n(\nwith J C Varlet\n)\nOckham algebras\n(1994)\n; and\nLattices and Ordered Algebraic Structures\n(2005)\n. For information about these books, see\nTHIS LINK\n.\nI\n[\nEFR\n]\nco-authored quite a number of books with Tom. Both Tom and I had been teaching algebra courses at various undergraduate levels. I had produced tutorials with many questions attempting to improve student's understanding of concepts rather than testing their problem-solving skills. Tom liked the tutorials I was giving students and thought they complemented the style of questions he was setting. He had a notion to produce a series of small books on various algebra topics which he felt were more appropriate for students than large textbooks covering vast amounts of material. We collaborated on producing six problem-solver books,\nEssential Student Algebra.\nThe books were:\nSets, relations and mappings\n;\nMatrices and vector spaces\n;\nGroups, rings and fields\n;\nLinear algebra\n;\nGroups\n; and\nRings, fields and modules\n. They were published by Cambridge University Press in\n1984\nand, one year later, the Press published two larger books, putting Books\n1\n,\n2\nand\n3\nin one volume and Books\n4\n,\n5\nand\n6\ninto a second volume. Tom and I then produced five companion texts:\nSets and Mappings\n;\nMatrices and Vector Spaces\n;\nAbstract Algebra\n; and\nGroups\nwhich were published in\n1986\n.\nSpringer then asked Tom and me to write a Linear Algebra text for SUMS\n(\nSpringer Undergraduate Mathematics Series\n)\n. We co-authored\nBasic Linear Algebra\nwhich was published in\n1998\n. It became, in Springer's own words, \"one of SUMS' best-selling titles\" and we were asked to produce a second edition and also to write a follow-on textbook suitable for a second course in linear algebra. For the Second Edition of\nBasic Linear Algebra\n(2002)\nwe added a chapter on computer applications to linear algebra and we published the second volume\nFurther Linear Algebra\nin the same year. Rabe von Randow writes in the review\n[\n29\n]\n:-\nThis text is a sequel to the authors' earlier Springer Undergraduate Mathematics series volume entitled 'Basic linear algebra', which is an introductory text for mathematics students. This book continues in a similar style and presents more advanced properties of vector spaces and linear mappings. As before, it embodies a beautiful, concise and precise treatment of the subject, with succinct numerical and algebraic worked examples at the right points, and many exercises.\nThis is an excellent textbook which, together with the earlier book, comprises a very nearly complete introduction to linear algebra which not only the undergraduate but also the advanced reader will enjoy studying.\nFor further details on Blyth's career, we quote from\n[\n20\n]\n:-\nTom contributed in many ways to the wider mathematical community; he was Editor of the\nRoyal Society of Edinburgh\nMathematical Proceedings for\n10\nyears, elected as a Corresponding Member of the Royal Society of Liège in\n1973\n, made a Fellow of the\nRoyal Society of Edinburgh\nin\n1974\n, and was President of the\nEdinburgh Mathematical Society\nin\n1979\nand\n1980\n. He organised the four-yearly St Andrews Colloquium and was Chair of the British Mathematical Colloquium when it came to St Andrews in\n1987\n.\nLiving locally in Strathkinness, Tom remained committed to his mathematical research long after his retirement, continuing his\n30\n-year collaboration on semigroups with Maria Helena Almeida Santos from the New University of Lisbon; their last paper was published in\n2021\n. Tom undertook research with Herberto J Silva, also from the New University of Lisbon, publishing research together covering a\n20\n-year period dating from the late\n1990\ns up to\n2017\n.\nTom continued to be in good health during his retirement and his death was very sudden. Sitting at home in his favourite armchair, watching television and sipping gin and tonic, he suddenly passed away.\nLet us end with looking at an example of Tom's mathematical humour. He sent the article \"L-plate instructions\" to\nThe Mathematical Gazette\nwhen still a research student. He notes that the Instructions for a person holding a Provisional Driving Licence displays a diagram of the L-plate to be attached to a car which it says is \"half actual size\". He wondered\n[\n3\n]\n:-\n... what interpretation would\n[\npeople\n]\nput on the word \"size\" - did it mean that the dimensions of the scale drawing were half those of the plate to be displayed, or that the area of the figure given was half that to be displayed? A simple mensuration exercise with a reliable ruler\n(\nat room temperature\n)\nproved the first of these to be wrong. As for the second, I found that most of my non-mathematical friends took this interpretation; I wonder if they know how to solve this problem.\nHe then considers the instructions \"The corners of the white ground may be rounded off\" showing that by following this instruction one could have an L-plate which resembles a red sausage on a white plate.",
  "matematicos_citados_na_biografia": [
    "Class1A1photograph",
    "Alex Craik",
    "Alex D D Craik",
    "THIS LINK",
    "David Borwein",
    "Frank Adams",
    "Edward Copson",
    "Dan Rutherford",
    "Arthur Hinton Read",
    "Ronald Mitchell",
    "Dubreil-Jacotin",
    "Henri Poincaré",
    "Poincaré",
    "Paul Dubreil",
    "Marie-Louise Dubreil-Jacotin",
    "Bourbaki",
    "Royal Society of Edinburgh",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "blyth.jpg",
    "../../Diagrams/tsb_lplate.jpg"
  ]
}