{
  "nome_completo": "Uriel George Rothblum",
  "nome_curto": "Uriel Rothblum",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rothblum/",
  "data_nascimento": "16 March 1947",
  "local_nascimento": "Tel Aviv, British Mandate for Palestine (now Israel)",
  "data_morte": "26 March 2012",
  "local_morte": "Haifa, Israel",
  "summary": "Uri Rothblum was an Israeli mathematician who made important contributions to operations research.",
  "biografia": "Uriel Rothblum\nwas known to his friends and colleagues as Uri. His parents were Austrian Jews who were living in Vienna in the\n1930\ns. The Nazi party had come to power in Germany in\n1933\nand their anti-Semitic policies together with a clear desire to take control of Austria made Rothblum's parents realise that they were not safe in Vienna. They escaped to Israel before the German invasion of Austria in\n1938\nand set up home in Tel Aviv. It was in that city that Uri was born, a couple of years after World War II ended. He was brought up in Tel Aviv and in Ramat Gan in Israel in the\n[\n1\n]\n:-\nEuropean tradition that emphasizes education, music, performing arts, poetry, good manners.\nHe was also brought up in the Zionist tradition. Rothblum's family had been Zionists before moving to Palestine. The main aim of the Zionist movement at this time was the creation of the state of Israel. This took place in\n1948\n, when Rothblum was only one year old, and at that time many Zionist institutions became Israeli government institutions. In particular three Zionist militias combined to become the Israel Defence Forces. The Zionists continued to exist after the creation of the state of Israel, however, and the Rothblum family were involved with them, by that time working to assist Jews who were persecuted in their own countries to emigrate to Israel.\nAt school, Rothblum showed great abilities and he was particularly passionate about chemistry. After graduating from high school, he did his compulsory military service in the Israel Defence Forces. He began his undergraduate studies at Tel Aviv University where he studied science and applied mathematics. He graduated with a B.Sc. in Applied Mathematics \"Magna Cum Laude\" in\n1969\nand remained at Tel Aviv University to study for an M.Sc. degree. He was advised by Robert John Aumann who was born into a Jewish family in Germany that had fled to the United States after the Nazis came to power. Aumann had been awarded a doctorate by the Massachusetts Institute of Technology in\n1955\nfor a thesis on knot theory but had become interested in game theory after meeting with\nJohn Nash\n. He worked in Israel from\n1956\nonwards and was awarded the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel in\n2005\n:-\n... for having enhanced our understanding of conflict and cooperation through game-theory analysis.\nAumann, not surprisingly, gave Rothblum a Master's thesis topic from game theory and he wrote the thesis\nValues of Games with a Continuum of Players\n. He was awarded an M.Sc. in Mathematics \"Summa Cum Laude\" in\n1971\nby Tel Aviv University. It was working with Aumann that led to Rothblum's first mathematical paper, namely\nOn orderable set functions and continuity\npublished in the\nIsrael Journal of Mathematics\nin\n1973\n. Konrad Jacobs, reviewing the paper, writes:-\nThe theory of coalition games with a continuum of players has made new demands on the theory of set functions throughout the last decade. The present paper is motivated by the demands of the theory of the Shapley value and follows a pattern set by R J Aumann and L S Shapley\n[\nValues of non-atomic games, Princeton Univ. Press, Princeton, N.J.,\n1973]\n.\nAfter the award of his Master's degree, Rothblum moved to the United States to undertake research for his doctorate funded by a Fulbright Fellowship. He was advised by Arthur F \"Pete\" Veinott Jr who was an expert in operations research. Rothblum was awarded a Ph.D. for his thesis\nMultiplicative Markov Decision Chains\nin\n1974\n. In a paper based on his thesis, Rothblum acknowledges his debt to his thesis advisor:-\nMy deepest thanks are given to my teacher and advisor, Professor Arthur F Veinott Jr, for his guidance and advice, for his insight and perspective during the preparation of this work. Starting with the suggestion of the research topic through the careful reading of the final version, his contributions, improvements and suggestions to this work are too numerous to be listed.\nVeinott wrote in\n[\n4\n]\nabout supervising Rothblum when he was a postgraduate student:-\nI met Uri in the autumn of\n1971\n. He took a Ph.D. course in dynamic programming from me in the spring of\n1972\n. ... I served as the advisor of his\n1974\ndissertation ... He was a good friend, and a brilliant prolific scholar. He had a quick and creative mind with the ingenuity, energy and background to make beautiful fundamental contributions to many fields.\nThree papers by Rothblum appeared in\n1975\n, namely:\nMultivariate constant risk posture\n;\nNormalized Markov decision chains. I. Sensitive discount optimality\n; and\nAlgebraic eigenspaces of nonnegative matrices\n. Rothblum's own summary of the third of these papers, which formed a part of his thesis, is as follows:-\nThe\nPerron\n-\nFrobenius\ntheory for square, irreducible, nonnegative matrices is generalized by studying the structure of the algebraic eigenspace of an arbitrary square nonnegative matrix corresponding to its spectral radius. We give a constructive proof that this subspace is spanned by a set of semipositive vectors and give a combinatorial characterization of both the index of the spectral radius and dimension of the algebraic eigenspace corresponding to the spectral radius. This involves a detailed study of the standard block triangular representation of nonnegative matrices by giving special attention to those blocks on the diagonal having the same spectral radius as the original matrix. We also show that the algebraic eigenspace corresponding to the spectral radius contains a semipositive vector having the largest set of positive coordinates among all vectors in this subspace.\nThe terms 'Rothblum bases' and the 'Rothblum index theorem' which are used today refer to results from this paper\n(\nand also, of course, from his thesis\n)\n. Hans Schneider writes in\n[\n4\n]\nthat this paper:-\n... had an immediate and a long term major impact on me. It led to\n12\njoint papers\n[\nwith Rothblum\n]\nand a friendship that lasted until his untimely death.\nIn the summer of\n1974\n, Rothblum worked as a consultant at the Rand Corporation in Santa Monica, California, before taking up the position of Postdoctoral Fellow and Adjunct Assistant Professor of Computer Sciences at the Courant Institute of Mathematical Sciences in New York. After this one-year post, he was appointed as an Assistant Professor in the School of Organization and Management of Yale University in\n1975\n. He was promoted to Associate Professor in\n1978\n, continuing to work at Yale University until\n1984\n. During much of this time he spent the summers at the Department of Operations Research, Stanford University, where he held various roles such as Research Associate or Visiting Associate Professor. Moshe Haviv did a Ph.D. at Yale supervised by Rothblum. Haviv, who was awarded his Ph.D. for his thesis\nApproximation of Markov Chains and Markov Decision Models\nin\n1983\n, writes in\n[\n4\n]\n:-\nUri was not only a great scholar from whom I learned much. He was also a person who cared. He took me under his umbrella and taught me much of what I know today on academic research and education, how to write a paper, and much on academic life in general. He taught me what hard work and dedication entail. When he gave me a paper to read one afternoon, he commenced the discussion next morning from this paper. The idea that I might have done something else in the evening but read the paper, did not cross his mind. It was a pleasure to play tennis with him\n(\nhe was slightly better\n)\nbut again no relief: In break times he was worried if the results we derived for real matrices can be generalized to complex matrices.\nIn\n1984\nRothblum returned to Israel to take up the position of Professor in the Faculty of Industrial Engineering and Management at Technion, the Israel Institute of Technology in Haifa. He was named Alexander Goldberg Professor of Management Science in\n1992\n, a position he retained until his death. Boaz Golany writes\n[\n1\n]\n:-\nDuring his\n28\nyears of service at the Technion, Uri was a member of numerous academic committees, and he was regarded as a leading authority on all the academic issues faced by the university.\nFor example, he held roles at Technion such as: Associate Dean of the Faculty of Industrial Engineering and Management\n(1986\n-\n1989)\n; Dean of the Faculty of Industrial Engineering and Management\n(1992\n-\n1995)\n; Deputy Provost\n(1998\n-\n2000)\n; and Executive Vice President for Academic Affairs\n(2000\n-\n2002)\n.\nIn addition to these positions at Technion, Rothblum was pleased to be able to make frequent visits to the United States. He was a Visiting Professor at the State University of New York at Stony Brook during the summers of\n1987\nand\n1988\n. He was also a Visiting Professor at Rutgers Center for Operations Research, Rutgers University, New Brunswick during visits between\n1988\nand\n1999\n, and was a Visiting Professor in the Department of Industrial Engineering and Operations Research, Columbia University, New York in\n2005\nand\n2009\n.\nShmuel Onn explained in\n[\n4\n]\nsome of Rothblum's mathematical contributions while at Technion as well as his support for others:-\nTo many members of the Technion Operations Research group, Uri was the mentor and supporter of entering faculty life. Collaborating with Uri on research was a very enjoyable and fruitful experience. He was always very enthusiastic and the driving force behind whatever topic we were working on, and always brought in his insight and broad perspective of Operations Research on all its subareas.\nRothblum served on the editorial board of several journals:\nLetters in Linear Algebra and Its Application\n(1980\n-\n81)\n;\nSIAM Journal on Algebraic and Discrete Methods\n(1983\n-\n87)\n;\nSIAM Journal on Matrix Analysis and Applications\n(1988\n-\n93)\n;\nOperations Research\n(1996\n-\n99)\n;\nJournal on Combinatorial Optimization\n(2005\n-\n2012)\n;\nWorld Scientific Series on applied mathematics\n(2006\n-\n2012)\n;\nLinear Algebra and Its Applications\n(1982\n-\n2012)\n; and\nMathematics of Operations Research\n(1979\n-\n2012)\n.\nFor his outstanding contributions to operations research, Rothblum received awards such as: the New England Academic Excellence Award,\n1989\n; the Operations Research Meritorious Service Award,\n1997\n; the Operations Research Meritorious Service Award,\n1999\n; the Institute for Operations Research and the Management Sciences Fellow Award,\n2003\n; and the Israeli Operational Research Society Prize for Excellence in Research in Operations Research,\n2005\n. This last award was made for his paper\nConvex Combinatorial Optimization\n(2004)\nwhich he published jointly with Shmuel Onn. The authors give this description of their paper:-\nWe introduce the convex combinatorial optimization problem, a far-reaching generalization of the standard linear combinatorial optimization problem. We show that it is strongly polynomial time solvable over any edge-guaranteed family, and discuss several applications.\nThe applications they discuss include the bounded rank positive semi-definite quadratic assignment problem and the convex matroid optimisation problem.\nIn collaboration with Frank K Hwang, Rothblum published the\n2\n-volume text\nPartitions: Optimality and Clustering\n(2012)\n. The first volume dealt with the single-parameter case while the second volume dealt with the multi-parameter case. The following is from the publishers information about the book:-\nThe need for optimal partition arises from many real-world problems involving the distribution of limited resources to many users. The \"clustering\" problem, which has recently received a lot of attention, is a special case of optimal partitioning. This book is the first attempt to collect all theoretical developments of optimal partitions, many of them derived by the authors, in an accessible place for easy reference. Much more than simply collecting the results, the book provides a general framework to unify these results and present them in an organized fashion. Many well-known practical problems of optimal partitions are dealt with. The authors show how they can be solved using the theory - or why they cannot be.\nJean Mailfert writes in a review:-\nThis book deals with optimal partition problems. ...\n[\nIt\n]\ncontains a lot of theoretical developments and new statements on the topic of optimal clustering. Reading it is, however, difficult and it may best serve upper-level graduate students or engineers.\nUri Rothblum was married to Naomi; they had three children, Maydan, Guy and Ron. Raphael Loewy writes\n[\n4\n]\n:-\nFirst and foremost Uri was a family man. He was devoted to his wife and their children. He was a kind, generous and unique man. His interests included travelling, which he did extensively and enthusiastically, and the arts - especially the theatre and ballet. Those who knew him remember his grace, his nobility of spirit, his boundless energy, and his capacity for living every moment to its fullest.\nThe webpage\n[\n3\n]\ncontains many tributes to Rothblum from his friends, colleagues and former students. We end this biography by quoting from some of the contributors. Ariela Sofer, George Mason University, writes:-\nUri was not only an exceptional researcher but also an exceptional teacher. I had the privilege of take a course on recent advances in optimization from Uri while I was a Masters' student at the Technion - some time in the late\n70\n's. Uri was absolutely masterful in his exposition, presenting each topic as a riveting mystery, that we\n(\nthe students\n)\nwere unravelling, step by logical step. The students were in awe and wonder. Math had rarely been so exciting! Later when I read the papers that Uri described I sometimes wondered whether he had more insight into the topic than the authors of the ideas. He was a brilliant scientist and a brilliant teacher!\nAmitabh Trehan, Technion, writes\n[\n3\n]\n:-\nI will always remember his singing and whistling in the corridor and the jovial and kind energy he used to bring.\nDimitris Bertsimas, Massachusetts Institute of Technology, writes\n[\n3\n]\n:-\nUri was a remarkable person: generous, considerate, brilliant, full of life and ideas.\nAlan Hoffman, IBM Research, writes\n[\n3\n]\n:-\nUri was one of the nicest people I knew: warm, witty, generous, forgiving, enthusiastic. Collaborating with Uri was like going to a party. And he was interested in Everything: perhaps the most versatile scholar in the mathematics of operations research.\nCurtis Eaves, Stanford University, writes\n[\n3\n]\n:-\nWe had such fun writing papers together. ... I was always amused by your definition of a vacation, namely, \"the freedom to work unobstructed\"; indeed, this is the way you lived. You could do and did many things very well, but nobody, like nobody, could push nasty equations around like you could ...",
  "matematicos_citados_na_biografia": [
    "John Nash",
    "Perron",
    "Frobenius"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}