{
  "nome_completo": "Vernon Charles Morton",
  "nome_curto": "Vernon Morton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morton_Vernon/",
  "data_nascimento": "26 June 1896",
  "local_nascimento": "Sheffield, England",
  "data_morte": "26 March 1978",
  "local_morte": "Oxford, England",
  "summary": "Vernon Morton was an English mathematician who  was head of Pure Mathematics at Aberystwyth for many years.",
  "biografia": "Vernon Morton\nwas the son of Charles Morton and Florence Cadman\n[\n7\n]\n:-\nHe always said that both his mother and his maternal grandmother could beat him at mental arithmetic.\nVernon attended the King Edward VII School in Sheffield. This school, which only took day pupils, was founded in\n1905\nwhen Wesley College and Sheffield Royal Grammar School merged. When Morton attended, the school included both a junior and a secondary school. However, the junior school no longer exists. A fellow pupil at King Edward VII School was\nEdward Titchmarsh\nwho was three years younger than Morton. The headmaster during Morton's time at the school was James Harvey Hichens\n(1859\n-\n1938)\n, who had an Oxford degree in chemistry, and he had done a remarkable job in raising the standards of the school with many pupils being successful in the Oxford and Cambridge Scholarship Examinations. In part the pupils' success was achieved by expecting them to do exceptionally large amounts of homework.\nMorton followed the King Edward VII School tradition and sat the Oxford Scholarship Examinations winning an open scholarship to Merton College in\n1915\n. Now, of course, World War I was already in progress at this time and, in\n1916\n, he joined the Gloucestershire Regiment, nicknamed \"The Glorious Glosters\", of the British Army. He was sent to the front-line trenches near Armentières where he suffered a mustard gas attack. He was badly affected by the gas and was transferred to the Royal Engineers Signal Service which provided communications throughout the war. However, Morton never fully recovered from the gas attack and suffered the consequences for the rest of his life. After the end of World War I, Morton returned to his studies at Merton College, Oxford, in\n1919\n.\nIn\n1920\nMorton won a Junior Mathematical Scholarship and when he graduated in\n1921\nhe won a Senior Mathematical Scholarship. During\n1921\n-\n22\nhe continued to study at Oxford where his tutor at Merton College was\nArthur Lee Dixon\nwho held a fellowship there.\nDixon\nwas particularly interested in applications of algebra to geometry and Morton was inspired by him to undertake research in this area. While at Oxford, Morton advised his fellow student\nMary Cartwright\n.\nCartwright\nhad failed to get a first class and was seriously considering giving up mathematics altogether and returning to her first love of history. It was a painful decision, over which she agonised for some time, but Morton gave her very sensible advice. He told her to read\nWhittaker\nand\nWatson\n's 'Modern analysis' and to attend\nG H Hardy\n's evening sessions. This advice set\nCartwright\non the path to a stunning career in mathematics.\nAfter leaving Oxford, Morton was appointed as a lecturer at Brighton Technical College.\n(\nThis College was later named Brighton College of Technology and now is known as City College Brighton & Hove.\n)\nMorton taught there for a year which, he later said, gave him very valuable teaching experience. In\n1923\nhe was appointed as a lecturer in Pure Mathematics at the University College of Wales, Aberystwyth.\nThe Department in Aberystwyth had suffered a blow when\nWilliam Henry Young\nhad resigned at the end of session\n1922\n-\n23\n.\nW H Young\nhad been in post as Head of Pure Mathematics since\n1919\nbut when he resigned all his assistants also left at the end of session\n1922\n-\n23\n. George Adolphus Schott, Professor of Applied Mathematics, acted as head of Pure Mathematics after\nW H Young\nleft and wrote in his report for\n1923\n-\n24\n[\n1\n]\n:-\nOwing to the resignation of Professor\nW H Young\n, and the departure for various reasons of all his assistants at the end of session\n1922\n-\n23\n, a very difficult situation arose in the Department of Pure Mathematics. This was rendered still worse by a reduction in the number of the staff, necessitated by the prevailing financial stringency, coupled with an increase of more than one-third in the number of students in the department, due to an unexpectedly large influx of mathematical students of the First Year. Under these conditions it became impossible to continue the Honours courses on the very ambitious scale projected by\nProfessor Young\n, which was far beyond anything attempted in any other modern English University. ... The reorganisation of the higher courses, and especially the establishment of a very desirable combined Honours course in Pure and Applied Mathematics, was carried out, thanks to the invaluable assistance afforded by Messrs V C Morton and W J Webber ... Great credit is due to these gentlemen for their efforts during a very critical period in the history of the department ...\nIn\n1925\nMorton married Olive Norris, the daughter of George and Olive Norris of Oxford. She is described by Dorothy Meyler in\n[\n7\n]\nas \"witty and beautiful\". Vernon and Olive Morton lived at Eryl Mor, Brynymor Road, Aberystwyth and they had one son, David Charles Morton. Morton was promoted to Independent Lecturer and Head of the Pure Mathematics Department in\n1926\nand to Professor in\n1933\n.\nSee\nTHIS LINK\nfor the annual reports that Morton wrote as head of Pure Mathematics at Aberystwyth. From these reports you can follow the progress of the Department of Pure Mathematics under Morton's leadership over a period of\n25\nyears.\nDorothy Meyler writes in\n[\n7\n]\nA gifted teacher and a stimulating lecturer, clear, cogent and logical, the elegance of Morton's presentation and his enthusiasm inspired his students with his own love of mathematics and aroused their appreciation of its beauty. His influence on the teaching of mathematics in the schools and colleges of Wales was profound and is still felt ... and Professor T V Davies, Principal C W L Bevan and former Vice-Chancellor E J Richards bear witness to the effectiveness of his teaching in training students for wider spheres. Morton's services in many capacities were frequently sought and highly valued by the University of Wales and by the College. He was an outstanding Dean of the Faculty of Arts and of the Faculty of Science\n(\non two occasions\n)\n. His most notable service to the College was as Vice-Principal and particularly as Acting Principal in\n1957\n-\n58\nat a time when his wisdom and charity were of inestimable value. Wise in counsel and disinterested in judgment, his integrity and magnanimity, kindness and humour will long be remembered with gratitude by his colleagues and students.\nWe refer the reader to\n[\n7\n]\nfor details of the seven mathematics papers that Morton published.\nWhen he reached the age of\n65\n, Morton retired from his chair at Aberystwyth in\n1961\n. However, this was not the end of his career for he was appointed Head of the Mathematics Department at St David's College, Lampeter, where he held this position from\n1961\nto\n1966\n. We note that William Barry Pennington\n(1923\n-\n1968)\nwas appointed to fill Morton's chair at Aberystwyth when he retired in\n1961\n.\nAberystwyth University now awards the V C Morton Prize for outstanding performance by any Mathematics undergraduate.",
  "matematicos_citados_na_biografia": [
    "Edward Titchmarsh",
    "Arthur Lee Dixon",
    "Dixon",
    "Mary Cartwright",
    "Cartwright",
    "Whittaker",
    "Watson",
    "G H Hardy",
    "William Henry Young",
    "W H Young",
    "Professor Young",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}