{
  "nome_completo": "Victoria Ruth Neale",
  "nome_curto": "Vicky Neale",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neale/",
  "data_nascimento": "March 1984",
  "local_nascimento": "Worcester, England",
  "data_morte": "3 May 2023",
  "local_morte": "Oxford, England",
  "summary": "Vicky Neale was an exceptional university teacher and had the ability to bring many people to mathematics through her outreach work. She tragically died from cancer aged 39 .",
  "biografia": "Vicky Neale\nwas born in Worcester but the family moved to a little village just outside Winchester when she was five years old. Her mother was a secondary school teacher who taught various subjects including mathematics. Her father had studied electronic engineering so also had a background in mathematics. As she was growing up, mathematics would be discussed in the home, not as a subject in its own right, but rather as something which was a part of everyday life.\nVicky attended the Henry Beaufort School in Winchester, her local comprehensive school. She said in the interview\n[\n9\n]\n:-\nI think I was lucky in the teachers that I had who were always very supportive. I enjoyed the mathematics that I did at school. I think I was probably the annoying kid who kept wanting to be fed more.\nShe would finish the mathematics problems the teacher had given the class and then ask for something more challenging. Doing many examples which were all basically the same bored her so she gave her teachers quite a lot of extra work. Mathematics was her main love but she also loved music\n[\n9\n]\n:-\nI spent a lot of time playing music. I learned the piano and the oboe when I was at school and I spent quite a lot of my secondary school time playing in orchestras. I loved playing in orchestras. So, I didn't do that much mathematics outside of school. I had a few opportunities come up through Royal Institution Masterclasses when I was thirteen or fourteen ... but I spent a lot of time sitting in the middle of an orchestra playing an oboe.\nThe Henry Beaufort School only took pupils to the age of sixteen so, when Vicky was fifteen she had to make decisions about applying for entry to a Sixth Form College. She said\n[\n9\n]\n:-\nI remember it being completely clear that I wanted to do mathematics and further mathematics and I figured I should do physics because it seemed that was what you should do and what I kind of wanted to do was French and German but I sort of had this idea that mathematics, further mathematics, physics and chemistry was a thing. I'd somehow got that impression and I remember having a conversation with my mathematics teacher who was very wise and very helpful and said if you want to do French and German, do those. So I loved doing the languages alongside that. … I joined the physics A level but there was really never any doubt at all in my mind I think that I would be applying to do mathematics at university.\nShe applied to the Peter Symonds College in Winchester and was accepted. While at the school, she was involved with the UK Mathematics Trust and took part in various training events for the Mathematical Olympiad. She very much enjoyed solving problems but the competitive side of the Olympiad was not to her liking\n[\n9\n]\n:-\nI wasn't very interested in the competition part of the competitions, but I loved the fact that they gave me interesting mathematics to think about and I loved that when I got to go to a couple of these events I met other young people who were also super excited about mathematics and we could talk about mathematics but also talk about things other than mathematics. I mean it's not like we talked about mathematics the whole time but it was great just interacting with other people who didn't think I was a bit odd for enjoying mathematics.\nWhile at Peter Symonds College, Vicky submitted correct solutions to Student Problems\n2002\n.\n1\nand\n2002\n.\n2\nposed in the\nMathematical Gazette\n. Here are the problems:\nProblem\n2002\n.\n1\n.\nFor each three-digit positive integer\nN\nN\nN\n, define\nf\n(\nN\n)\nf(N)\nf\n(\nN\n)\nto be the sum of the hundreds digit, the square of the tens digit, and the cube of the units digit, of\nN\nN\nN\n. Determine, with proof, all such\nN\nN\nN\nfor which\nf\n(\nN\n)\n=\nN\nf(N) = N\nf\n(\nN\n)\n=\nN\n.\n[\nAnswer: There are four solutions,\n135\n,\n175\n,\n518\nand\n519\n.\n]\nProblem\n2002\n.\n2\n.\nIn triangle\nA\nB\nC\nABC\nA\nB\nC\n, the midpoint of\nB\nC\nBC\nB\nC\nis\nD\nD\nD\n. Given that angle\nA\nD\nB\n=\n45\nº\nADB = 45º\nA\nD\nB\n=\n4\n5\nº\nand angle\nA\nC\nB\n=\n30\nº\nACB = 30º\nA\nC\nB\n=\n3\n0\nº\n, determine angle\nB\nA\nD\nBAD\nB\nA\nD\n.\n[\nAnswer:\n30\nº\n]\nVicky Neale graduated from Peter Symonds College in\n2002\nwith five A-grades in the A-level examinations and was delighted that she would be able to take up her place at Cambridge to read mathematics. She studied the Mathematical Tripos at Trinity College and was awarded a BA in\n2005\n, continuing at Trinity College to Part III, a fourth year course in which she studied Combinatorics, Number Theory and Algebra. While still an undergraduate, Neale had played a major role in the Archimedeans, the Cambridge University Mathematical Society. She was the editor of\nEureka\n, the journal of the Archimedeans, for the March\n2004\nissue. In fact, surprisingly, she was both the editor and the assistant editor! She wrote in the Editorial:-\nThis is the point at which, it seems, the Editor of 'Eureka' has traditionally had an opportunity to justify the existence of a student journal for recreational mathematics. Personally, I consider the existence of the journal to be a justification in itself; despite a fairly large gap since 'Eureka\n55\n' was published, I have been very pleasantly surprised to discover how forthcoming contributions have been. In October\n2003\n, when I became Editor, I was handed some of the material that appears on later pages, including a letter from an individual who has been reading 'Eureka' for longer than I have been alive, but who still reads it as avidly as ever ... It only remains for me to add that I hope very much that I too shall be reading 'Eureka' seventy years after I matriculated, and to hope that you enjoy what follows!\nShe was also an active member of the Trinity Mathematical Society. This Society beat the Adams Society of St John's College in the\n2004\ncricket match held on Friday,\n18\nJune. Vicky Neale is the only girl in the team photograph.\nNeale worked in each of the summer vacations. In the first summer vacation in\n2003\nshe worked for a teddy bear company doing administration and packing teddy bears in cardboard boxes. During the next two summers she worked for NRICH. NRICH is an initiative from Cambridge University which provides thousands of free online mathematics resources designed to challenge, inspire and engage those aged\n3\nto\n19\n, including support for their teachers and parents. She produced\nAn Introduction to Number Theory\nwhich was published in October\n2005\nand, with Katherine Körner,\nAn Introduction to Proof by Contradiction\nalso published in\n2005\n. Madeleine Cule writes\n[\n16\n]\n:-\nI worked alongside Vicky for the NRICH program in Cambridge for a summer before we started our respective PhDs - at the dawn of our professional lives. She stood out then for her brilliance, passion, and clarity of purpose.\nAfter completing Part III of the Mathematical Tripos, she was awarded an MMath degree in\n2006\nand began working for her Ph.D. advised by Ben Green. Her research work aimed to generalise\nWaring\n's problem which she describes in\n[\n21\n]\n:-\nOne of the classical problems of additive number theory, known as\nWaring\n's problem, is to show that the kth powers form a basis for the integers. That is, for any k there is some s = s\n(\nk\n)\nsuch that every positive integer is a sum of s kth powers.\nLagrange\n's theorem, which says that every positive integer is a sum of four squares, is a special case of this.\nWaring\n's problem was first solved by\nHilbert\n, and then a few years later\nHardy\nand\nLittlewood\nsupplied a new proof, using what is now known as their circle method.\nWhile working on her thesis, Neale applied unsuccessfully for a number of academic positions. One day she saw an advertisement for the position of Director of Studies of Mathematics at Murray Edwards College. This women's college was part of the University of Cambridge. It had been founded in\n1954\nas New College but renamed Murray Edwards College in\n2005\nafter receiving a very large donation from Ros Edwards and her husband Steve Edwards. It was a one year appointment which could be done in parallel with finishing her Ph.D. and Neale was appointed. She very much enjoyed being a mentor, advisor, support and teacher for the mathematics students in the College. She was awarded her Ph.D. in\n2011\nfor her thesis\nBracket quadratics as asymptotic bases for the natural numbers\nand after this her position at Murray Edwards College became a full time position for a couple of years. She also gave lecture courses in the Department of Pure Mathematics and Mathematical Statistics at the University of Cambridge. In the Michaelmas Term\n2011\n, she gave the Part II Number Theory course, in the Easter Term\n2012\n, she gave a non-examinable course on\nWaring\n's Problem, in the Lent Term\n2013\n, she gave the  Analysis I course in Part IA and in the Michaelmas Term\n2013\n, she gave the Part II Number Theory course.\nIn addition to working at Murray Edwards College and lecturing at the Department of Pure Mathematics and Mathematical Statistics, Neale became involved in a number of other projects. She writes\n[\n24\n]\n:-\nI was one of the academic programme coordinators for the Cambridge Mathematics Sutton Trust summer school in August\n2011\n, and gave several lectures and supervisions at the\n2012\nand\n2013\nCambridge Mathematics Sutton Trust summer schools. I contributed to various other activities organised by the Cambridge Admissions Office and by Murray Edwards College, Cambridge. ... I spent almost two years working on Underground Mathematics, which was then called the Cambridge Mathematics Education Project, creating a website with free online resources for teachers and students of A-level Mathematics.\nNeale was becoming well known for her exceptional talent in explaining mathematical concepts. In October\n2012\nshe was a guest on Melvyn Bragg's BBC Radio\n4\nprogramme \"In our time\" discussing\nFermat's Last Theorem\n. The other two guests on this programme were Marcus du Sautoy and Samir Siksek. I\n[\nEFR\n]\nlistened to this programme; it was the first time I had heard about Vicky Neale and quickly recognised her talents as an expositor.\nIn\n2014\nNeale was appointed as the\nWhitehead\nLecturer at the Mathematical Institute of the University of Oxford and as a Supernumerary Fellow at Balliol College, Oxford. Her position did not involve research but was focussed on teaching, both lecturing and tutoring students, and on outreach. Over the following years she was a frequent guest or presenter on programmes on radio and television. For example in September\n2014\nshe was again a guest on \"In Our Time\", this time talking about the number\ne\ne\ne\n; in December\n2016\nshe was a guest on 'Free Thinking' on BBC Radio\n3\ntaking part in a discussion about attitudes to mathematics; in January\n2018\nshe was a guest on \"More or Less\", talking about prime numbers; in October\n2018\nshe was a guest on \"Magic Numbers: Hannah Fry's Mysterious World of Maths\", shown on BBC Four; and in February\n2020\nshe presented \"A Mathematician's Guide to Beauty\" for BBC Radio\n4\n.\nKeven Houston writes in\n[\n10\n]\n:-\nEver energetic, Vicky was involved many other organisations. She dedicated much of her time to those that encouraged young people, particularly girls, to enjoy and experience mathematics. She was Executive Director of PROMYS Europe, a scheme to bring secondary school students from around Europe to sample mathematics at Oxford. She was a volunteer for the United Kingdom Mathematics Trust\n(\nUKMT\n)\nand served on its council for many years; was a trustee of the recently founded Mathematics Education for Social Mobility and Excellence\n(\nMESME\n)\nand, perhaps most poignantly of all, was to be President of the\nMathematical Association\nin\n2024\n-\n2025\n.\nNeale received several awards recognising her outstanding contributions to teaching and outreach. For example in\n2015\nshe won the award \"Most Acclaimed Lecturer in Mathematical, Physical and Life Sciences Division\" from the University of Oxford Students' Union; and in\n2016\nshe received a Teaching Award from the University of Oxford Mathematical, Physical and Life Sciences Division. In\n2020\nshe passed with distinction the Oxford Postgraduate Certificate in Teaching and Learning in Higher Education. She received a PGCert Portfolio Prize, for the portfolio with the highest grade in her cohort in\n2018\n-\n19\n; one of the Vice Chancellor's Education Awards. On receiving the award she said:-\nI'm really glad I had the opportunity to do the PGCert programme. I enjoyed the chance to exchange ideas during the workshops with colleagues from other subjects, and it has given me a welcome opportunity to reflect on my own teaching practice, and to think about how best I can support the learning of students in the Maths Institute and at Balliol.\nAn active member of the\nLondon Mathematical Society\n, Neale had ben elected on\n9\nJune\n2008\n[\n10\n]\n:-\nVicky was very active in the LMS. She was a member of the Newsletter Editorial Board and was a regular contributor to the LMS Newsletter. She served on the Education Committee for\n6\nyears, where she could be relied upon to produce sensible and workable solutions to the problems faced. She was a Holgate Session Leader from\n2015\nto\n2017\n, and in\n2013\nwas an LMS Popular Lecturer. Her talk, 'Addictive Number Theory', which was, of course, on her love of prime numbers, is the\n4\nth most popular video on the LMS's YouTube channel. Another of her talks, an introductory lecture on complex numbers for Oxford University, currently has over\n2\n.\n3\nmillion views.\nIn\n2017\nNeale published the book\nClosing the Gap: The Quest to Understand Prime Numbers.\nThis book received much attention and many reviews. You can read extracts from the Introduction as well as extracts from a selection of reviews at\nTHIS LINK\n.\nI\n[\nEFR\n]\nmet Vicky Neale in\n2017\nwhen she came to St Andrews to deliver the\nCopson\nlecture. The\nCopson\nLectures are a series of public lectures in memory of\nEdward T Copson\n, who was the Regius Professor of Mathematics at the University of St Andrews from\n1950\nto\n1969\n. She gave the lecture\nClosing the Gap: the quest to understand prime numbers\nto a large audience in the Booth Lecture Theatre, Medical Sciences Building, University of St Andrews on Friday,\n22\nSeptember\n2017\n. The talk was advertised with the following Abstract:-\nPrime numbers have intrigued, inspired and infuriated mathematicians for millennia, and yet mathematicians' difficulty with answering simple questions about them reveals their depth and subtlety. Join Vicky to learn about recent progress towards proving the famous Twin Primes Conjecture, and to hear the very different ways in which these breakthroughs have been made - a solo mathematician working in isolation, a young mathematician displaying creativity at the start of a career, a large collaboration that reveals much about how mathematicians go about their work.\nNeale published a second book in\n2020\n, namely\nWhy Study Mathematics?\nWe present information such as extracts from the Introduction, extracts from a selection of reviews, and give her own description of why she wrote it, at\nTHIS LINK\n.\nOne of Neale's hobbies combined mathematics and crafting\n[\n10\n]\n:-\nHer mathematical interests went beyond such abstract topics to include arts and crafts. She was keen on crafting, particularly knitting and crocheting, and created mathematically patterned Christmas cards.\nExamples of her crafting are: crochet versions of multiplication tables in modular arithmetic; a knitted visualisation of the\nEuclid\n's algorithm; and  knitted scarves illustrating the distribution of prime numbers.\nIn\n2021\nNeale was diagnosed with a rare type of cancer. This led to her hosting a podcast on mathematics and cancer\n[\n15\n]\n:-\nThis podcast series was both a personal and professional endeavour for Vicky. In March\n2021\n, she began receiving treatment for a rare form of cancer, prompting her to discover more about how her colleagues in the mathematical community contribute to cancer research - from prevention, through to diagnosis and treatment. Throughout the series she talked to a range of experts to find out more about the role of mathematics and statistics in cancer research, as well as to discover more about the people behind the work.\nVicky Neale died from cancer on\n3\nMay\n2023\n. She had written on her website\n[\n24\n]\n:-\nI will be the President of the\nMathematical Association\nin\n2024\n-\n2025\n. I am deeply honoured to be following in the footsteps of so many eminent people.\nWhen she wrote these words, however, she knew that her chances of surviving long enough to become President were extremely slim, but she was always optimistic. Her exceptional ability as a teacher can been seen from the comments by her students in\n[\n16\n]\n. We end by quoting from a few of these.\nRory Bramley\n[\n16\n]\n:-\nShe was an absolutely excellent lecturer who taught me Groups and Group Actions in\n2015\n. Vicky brought the subject alive with her enthusiasm and passion.\nSean Cuddihy\n[\n16\n]\n:-\nI was taught by Vicky as my lecturer for first year Group Theory, and then in third year when I was in her Graph Theory class. She was a first class teacher, producing immaculate lecture notes and solutions, and always going the extra mile to explain something another way when we were confused. I will always remember her entertaining style, as well as her colourful trousers!\nJosie Smith\n[\n16\n]\n:-\nThank you Vicky. You were my Director of Studies at Cambridge, and have taught me so much. Your patience and enthusiasm helped me through many difficult problem sheets, and helped drive my love for mathematics. It is difficult to imagine what my time at university would have been like without you, and I will forever have a little virtual Vicky pop up in my head whenever I am doing maths, correcting and encouraging me.\nSam Field\n[\n16\n]\n:-\nI've known many people with a love of mathematics, but none with the same passion Vicky had for sharing this love with others. I was lucky enough to be tutored by Vicky at Balliol College. She had an incredible understanding of the way mathematics is learned, and always had ways of explaining the most complex concepts that not only made them seem simple, but also revealed the beauty and fascination in each theorem and proof. I had uncountable \"Oh, I get it now!\" moments in her tutorials and lectures. Her skill, empathy and sense of humour made learning mathematics a joy.\nAdam Cutts\n[\n16\n]\n:-\nVicky was someone who really cared about making other people understand and enjoy maths. In our tutorials, she was always passionate about getting to the very root of what we didn't understand. She really did have a psychic ability to work out when you didn't understand a tricky idea, but were just nodding along, hoping to get away from the scary abstract algebra as quickly as possible. There was nowhere to hide! But she undid the fear of the hard maths, by showing everyone that with enough patience, every detail could be worked out. She gave you confidence in your own ability.\nAuri Guarino\n[\n16\n]\n:-\nVicky was a brilliant tutor - the benchmark for what an educator should be. She made every problem clear and accessible, and had a remarkable knack for figuring out what exactly is the core of my confusion and clearing it up. She was always on hand to receive questions outside of tutorials\n(\nwhether through emails or office hours\n)\nand went far out of her way to answer them\n(\nincluding giving extra problems, hints, and offering one-on-one calls to clear things up if needed\n)\n. I must add that Vicky was also an incredibly kind and thoughtful person who really cared about her students. Vicky's enthusiasm, love for maths and education, and her calm and kind nature continue to inspire me today.\nMore tributes to Vicky Neale are at\nTHIS LINK\n.\nPerhaps it is fitting to end with a quote from Vicky Neale\n[\n19\n]\n:-\nOne of the challenges of mathematics is that tackling more sophisticated problems often means first tackling more sophisticated terminology and notation. I cannot find a piece of mathematics beautiful unless I first understand it properly - and that means it can take a while for me to appreciate the aesthetic qualities. I don't think this is unique to mathematics. There are pieces of music, buildings, pieces of visual art where I have not at first appreciated their beauty or elegance - and it is only by persevering, by grappling with the ideas, that I have come to perceive the beauty.",
  "matematicos_citados_na_biografia": [
    "Waring",
    "Lagrange",
    "Hilbert",
    "Hardy",
    "Littlewood",
    "Fermat's Last Theorem",
    "Whitehead",
    "Mathematical Association",
    "London Mathematical Society",
    "THIS LINK",
    "Copson",
    "Edward T Copson",
    "Euclid"
  ],
  "imagens": [
    "neale.jpg"
  ]
}