{
  "nome_completo": "Walter Gröbli",
  "nome_curto": "Walter Gröbli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grobli/",
  "data_nascimento": "23 September 1852",
  "local_nascimento": "Oberuzwil, St Gallen Canton, Switzerland",
  "data_morte": "26 June 1903",
  "local_morte": "Piz Blas, Grisons Canton, Switzerland",
  "summary": "Walter Gröbli was a Swiss school teacher who helped organise the first Internatonal Congress of Mathematicians.",
  "biografia": "Walter Gröbli\n(\noriginally Walther Gröbli\n)\nspent his childhood and attended primary school in his native village of Oberuzwil. Later the family moved to Töss\n(\nnow part of the town Winterthur\n)\nin canton Zürich, where Walter attended the Industrieschule. His parents were Isaak and Elisabetha Gröbli, née Grob. Walter had two older brothers, Joseph Arnold and Hermann, and a younger sister. His four younger brothers all died in their infancy.\nIsaak Gröbli\n(1822\n-\n1917)\nwas a jacquard weaver who invented the \"Schifflistickmaschine\", a shuttle embroidery machine, in\n1863\n. Soon the machine worked\n10\ntimes faster than a hand embroidery machine and became widely used, but it brought Isaak Gröbli only modest wealth. At the age of\n64\nhe moved to Gossau\n(\ncanton St. Gallen\n)\nto set up his own small embroidery business, supported by his son Hermann. The oldest son Arnold emigrated to the United States in\n1876\n, where he refined his father's invention. Letters preserved in Gröbli's scientific estate\n[\n2\n]\nshow that Arnold took an interest in his younger brother's career.\nWalter, however, was not interested in weaving, but in mathematics. He completed his school education at the Kantonsschule in St. Gallen. Encouraged and supported by his father, he studied mathematics at the Polytechnic from\n1871\n-\n1875\n, at the Department for Mathematics and Physics Teachers. His lecturers included\nHeinrich Weber\nand\nSchwarz\n, 'both of whom had great influence on his further scientific career'\n[\n5\n]\n.\nWeber\nin particular got Gröbli, whom he referred to as the 'best student he had ever had'\n[\n6\n]\n, interested in vortex theory and hydrodynamics. Probably encouraged by\nWeber\nand\nSchwarz\n, Gröbli went to Berlin to hear\nKirchhoff\n,\nHelmholtz\n,\nKummer\nand\nWeierstrass\nin\n1875\n. In Berlin he caused a stir by solving the prize problem on vortex motion posed by\nKirchhoff\n.\nIn\n1876\nGröbli obtained his doctorate from the University of Göttingen for his thesis\nSpezielle Probleme über die Bewegung gradliniger, paralleler Wirbelflächen\nⓉ\n(\nSpecial problems on rectilinear movement, parallel vortex sheets\n)\n. His supervisor was\nSchwarz\n(\nor possibly\nHeinrich Weber\n)\n; his oral examiners were\nSchwarz\nfor mathematics and\nJohann Benedict Listing\nfor physics. Upon his return to Zürich in\n1877\nhe\nhabilitated\nas\nPrivatdozent\nat the Polytechnic. Along with the request he had to submit at least two papers and three references; his referees were\nWilhelm Fiedler\n,\nFrobenius\n, and\nGeiser\n. The whole process, from application to appointment, took a remarkable two weeks\n[\n2\n]\n. Gröbli also became\nFrobenius\n's assistant for the following six years. He held his teaching post until\n1894\n; he mainly lectured on hydrodynamics.\nIn\n1883\nhe was appointed professor of mathematics at the\nGymnasium\nin Zürich. By all accounts he was a very demanding\n(\nschool\n)\nteacher, but impressed his pupils with 'his phenomenal proficiency in mental arithmetic, which is not widely spread among higher mathematicians and of which astounding stories were told'\n[\n6\n]\n. Despite his mathematical talent and encouragement from his former professors and his colleagues, Gröbli did not pursue a career as a research mathematician; he was content with being a schoolteacher.\nGröbli married Emma Bodmer in\n1899\nand they had a son, Walter\n(1900\n-\n1975)\n[\n2\n]\n.\nEven after he had stepped down from his post at the Polytechnic, Gröbli continued to take great interest in the latest mathematical research. He was also very interested in languages, reading English and German literature, and learning Italian in his forties.\nHis main passion\n(\nbesides mathematics\n)\nthough was mountaineering. He climbed most of the more major peaks in the Alps; in many cases he was the first person to do so. Examples are climbing Piz Ela\n(3339\nm\n)\nin\n1880\nand traversing the north route of the Tödi\n(3614\nm\n)\n. In addition, he was a keen hiker. Gröbli was a very active member of the Swiss Alpine Club: he led many mountaineering trips and served on the executive committee of the Club's local branch for many years. He also wrote several reports on his excursions for the Club's journal. A letter from the Federal Topographic Bureau\n[\n3\n]\nsuggests that Gröbli combined his two passions in measuring the heights of mountains and mountain passes.\nOn\n26\nJune\n1903\n, he led a group of\n16\nof his pupils on a hike on Piz Blas\n(3019\nm, canton Grisons\n)\n. Due to bad weather conditions, the group had to choose a different route, but they were still caught in an avalanche. Walter Gröbli and two pupils, Ernst Hofmann and Adolf Odermatt, perished on the mountain; another pupil, Richard Liebmann, died of his injuries later on.\nIt is hard to say whether Gröbli would have written any mathematical papers had he not died so early. But as it stands his only publication was his doctoral thesis. The basic model that he investigated had been discovered by his former professor Helmholtz\n(\nCrelle's Journal,\n1858)\n, but\n[\n5\n]\n:-\nThe subject matter\n[\nof Gröbli's thesis\n]\nwas the motion of three vortices, the motion of four vortices assuming the existence of an axis of symmetry, and the motion of\n2\nn\n2n\n2\nn\nvortices assuming the existence of\nn\nn\nn\nsymmetry axes.\nHe had already worked on a similar topic for his dissertation at the Polytechnic. The thesis was cited a number of times in the late\n19\nth\ncentury, by\nG R Kirchhoff\n, D N Goryachev and\nH Lamb\nfor example. People then forgot about it until\n1949\n, when\nJ L Synge\npublished a paper on the converse of the problem that Gröbli investigated. The thesis is still cited today, in fact, 'few will write a thesis that will be the subject of attention a century later'\n[\n5\n]\n.\nAt the time of the first International Congress of Mathematicians Gröbli had already given up his teaching post at the Polytechnic. He joined the enlarged organising committee in December\n1896\n. At the meeting on\n08\nDecember he was elected president of the finance committee\n(\none of the four sub-committees\n)\n. As such he was responsible for creating the committee's budget and asking individuals\n(\nmerchants, manufacturers etc.\n)\nfor donations.",
  "matematicos_citados_na_biografia": [
    "Heinrich Weber",
    "Schwarz",
    "Weber",
    "Kirchhoff",
    "Helmholtz",
    "Kummer",
    "Weierstrass",
    "Johann Benedict Listing",
    "habilitated",
    "Privatdozent",
    "Wilhelm Fiedler",
    "Frobenius",
    "Geiser",
    "Gymnasium",
    "G R Kirchhoff",
    "H Lamb",
    "J L Synge"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}