{
  "nome_completo": "William Barron Coutts",
  "nome_curto": "William B Coutts",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coutts/",
  "data_nascimento": "26 May 1885",
  "local_nascimento": "Kinghorn, Fife, Scotland",
  "data_morte": "16 December 1946",
  "local_morte": "Radcliffe Infirmary, Oxford",
  "summary": "William Coutts graduated from Edinburgh University and after a period in the Army in World War I he became interested in the mathematical theory of artillery. He became a Professor at the Military College of Science at Shrivenham.",
  "biografia": "William B Coutts\n' father was  Robert Alexander Coutts\n(\nborn in Kinghorn, Fife about\n1857)\nwho was a Bank Accountant. His mother was  Elizabeth Martin Barron\n(\nborn in St Cuthberts, Edinburgh about\n1857)\n. He had two younger brothers, Alexander\n(\nborn about\n1888)\nand Robert\n(\nborn about\n1888)\n.\nWilliam B Coutts' home was at Green Croft, Kinghorn. He spent eight years studying at Kirkcaldy High School, sitting the Leaving Certificate examinations in\n1903\nand\n1904\n. He passed Higher English in June\n1903\n, then Higher Latin, Mathematics, and French in June of the following year.\nHe first matriculated at Edinburgh University in October\n1904\n. In his first year he took Latin and Mathematics, failing both subjects in April\n1905\n, but passing them in the October resits. His second year was slightly more successful since he passed Natural Philosophy and English at the first attempt in April\n1906\nbut failed Logic and Metaphysics. He sat the examination in Logic and Metaphysics at the resit in October\n1906\nbut, despite improving his performance from\n25\n% to\n40\n%, he failed again. He passed Logic and Metaphysics at the third attempt in April\n1907\n, achieving a comfortable pass at\n58\n%. He also took three attempts to pass Chemistry, failing in July\n1907\nand April\n1908\n, but passing in July\n1908\n. He took Honours courses in Mathematics, Analytical Dynamics, Thermodynamics, and Advanced Experimental Physics between summer\n1906\nand\n1909\n, but graduated M.A. without Honours in\n1909\n. He was awarded a B.Sc.\n(\nPure\n)\nby the University of Edinburgh in\n1912\n.\nAfter graduating, Coutts taught at George Heriot's School, Edinburgh. However, after World War I began in\n1914\n, Coutts left his teaching position for military service. He was commissioned in\n1915\nto the Royal Garrison Artillery and served at Gibraltar. The Royal Garrison Artillery dealt with coastal defence, mountain, siege and heavy batteries, and was responsible for ammunition storage and supply.\nIt was during this period that Coutts became interested in mathematical questions relating to firing. After he left the Royal Garrison Artillery in\n1917\n, he continued in war service until\n1918\n. He then decided not to return to teaching and instead he was a Senior Lecturer, Range-finding and Optics, at the Artillery College, Woolwich. He joined the Staff of the Military College of Science as a Professor in\n1919\nand worked there until his death in\n1946\n.\nHe married Isabella Muirhead Allan\n(\nChorlton, Lancashire,\n1884\n-\n1973)\n.\nWilliam Baron Coutts was elected a fellow of the\nRoyal Society of Edinburgh\non\n1\nDecember\n1913\n. He was proposed for the fellowship by Ralph Allan Sampson,\nJohn Brown Clark\n,\nCargill Gilston Knott\n, and James Robert Milne. His obituary, written by J R H Whiston, appeared in the\nRoyal Society of Edinburgh Year Book\n(1948\n-\n1949)\n, page\n12\n. We give a version below:\nW B Coutts, M.A., B.Sc., F.Inst.P., p.a.c.\nWe regret to record the death on December\n16\n,\n1946\n, at the Radcliffe Infirmary, Oxford, following an operation, of Professor W B Coutts, who served on the Staff of the Military College of Science from\n1919\nto the date of his death. Born at Kinghorn, Fifeshire, on May\n26\n,\n1885\n, he was educated at Edinburgh University and after a period as a schoolmaster was commissioned in\n1915\nto the R.G.A.\n(\nS.R.\n)\n. He served at Gibraltar, and it was his work on the Rock which created his lifelong interest in the problems of fire direction and control. In\n1917\nhe was recalled to join the\n35\nth\nAdvanced Class and after completing the course and obtaining the p.a.c. - a distinction of which he was very proud - he was appointed first Instructor and then Senior Lecturer in Range Finding at the College. In\n1938\nhe was promoted to be Assistant Professor of Fire Control Instruments, a position which he held until his death. He was also a member of the Council of the Optical Society and for a period of five years was one of its Honorary Secretaries. He was for many years a regular contributor on Optical Instruments in the Journal of Scientific Instruments.\nHe was beloved alike by his colleagues and students, to whom he was universally known as \"Willie\", and his gift of dry Scotch humour enlivened many otherwise dreary conferences and lectures. His specialised knowledge of optical and fire control instruments, and his ability to teach the subjects to technical officers will be a great loss.\nJ R H Whiston\nCoutts joined the\nEdinburgh Mathematical Society\nin November\n1913\n. He is one of quite a number who attended the\n1913\nEdinburgh Mathematical Colloquium held in Edinburgh during the week beginning Monday\n4\nth\nAugust\n1913\n, then applied for membership of the Society. After he became a Professor at the Military College of Science, he left the\nEdinburgh Mathematical Society\n.",
  "matematicos_citados_na_biografia": [
    "Royal Society of Edinburgh",
    "John Brown Clark",
    "Cargill Gilston Knott",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}