{
  "nome_completo": "William Watson",
  "nome_curto": "William Watson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Watson_William/",
  "data_nascimento": "15 June 1884",
  "local_nascimento": "Musselburgh, East Lothian, Scotland",
  "data_morte": "28 June 1952",
  "local_morte": "Edinburgh, Scotland",
  "summary": "William Watson graduated in Mathematics and Physics from Edinburgh University. He became head of the Physics department at Heriot Watt College in Edinburgh.",
  "biografia": "William Watson\n's father was  William Watson\n(\nborn in Fossoway, Kinross about\n1843)\nwho was the Headmaster of Musselburgh Grammar School. His mother was  Jane Watson\n(\nborn in Tranent, East Lothian about\n1859)\n. He the eldest of his parents children having younger siblings: John\n(\nborn about\n1887)\n, James\n(\nborn about\n1890)\n, Jane\n(\nborn about\n1892)\n, George\n(\nborn about\n1894)\n, Alexander\n(\nborn about\n1896)\nand Margaret\n(\nborn about\n1899)\n.\nWilliam Watson attended his father's school from\n1891\nto\n1898\nand then proceeded to the Royal High School, Edinburgh. He excelled at the school and, after coming top in Latin, Greek and Mathematics in every class he took, he completed his school education in\n1902\nbeing the dux and gold medallist. He passed the Leaving Certificate examinations in Higher French in June\n1901\n, then in Higher Latin, Greek, Mathematics, English, and Dynamics in June\n1902\n. After having passed the Preliminary Examination, he first matriculated at Edinburgh University in October\n1902\n.\nAt first Watson decided to study classics at Edinburgh University and it was only part way through his studies that he changed topics to mathematics and natural philosophy. In his first year he took the Ordinary classes in Latin and Greek but he certainly did not change course because of poor results since he achieved\n75\n% in both coures. In his second session,\n1903\n-\n04\n, he took the Ordinary classes in Mathematics, Education, and Natural Philosophy. His performance in Mathematics was outstanding with a score of\n105\n%\n[\nit was possible to get more than\n100\n% since candidates were not limited in the number of questions they could attempt\n]\n. Between October\n1904\nand April\n1906\nhe took Honours courses in Mathematics and Natural Philosophy. The topics in the Natural Philosophy part of the course included Heat, Light, Electrostatics, and Wave theory.\nHe graduated with an M.A. with First Class honours in Mathematics and Natural Philosophy in\n1907\n, followed by a B.Sc. with distinction in physics in\n1908\n. Before taking the B.Sc. Watson was already employed as assistant in the Physical laboratory in Edinburgh. After two years in this position he went to the University of Leipzig where he undertook research in physics. Family circumstances led to him returning to Edinburgh and he completed further research there.\nHe decided to make a career in school teaching and took his Schoolmaster's General Diploma at the Provincial Training College. He was appointed as Head of the Physics Department at Heriot-Watt College in\n1912\n. He continued to hold this post until he retired in\n1944\n.\nWilliam Watson joined the\nEdinburgh Mathematical Society\nin December\n1913\n, in the year after he took up his post at Heriot-Watt College. He was elected to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1923\n, his proposers being Francis Gibson Baily, Henry Briggs, Alfred Archibald Boon, Arthur Pillans Laurie.\nAn obituary, written by J Cameron Smail, appears in the\nRoyal Society of Edinburgh\nYear Book\n1953\n, pages\n50\n-\n52\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}