{
  "nome_completo": "William Davidson Niven",
  "nome_curto": "William Niven",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Niven/",
  "data_nascimento": "24 March 1842",
  "local_nascimento": "Peterhead, Scotland",
  "data_morte": "29 May 1917",
  "local_morte": "Sidcup, Kent, England",
  "summary": "William Niven was a Scottish mathematician who was a friend of Maxwell and worked on electricity, magnetism and harmonic functions.",
  "biografia": "William Niven\n's parents were Charles Niven\n(\nborn around\n1802)\n, a ginger beer brewer and spirit dealer, and Barbara Davidson\n(\nborn\n1810\nor\n1811)\nof Monquhitter, Aberdeenshire. Charles and Barbara married on\n28\nNovember\n1833\nand had nine children: John Gibb Niven\n(\nborn\n1834)\n; Thomas Niven\n(\nborn\n1836)\n; William Davidson Niven\n(\nborn\n1842)\n;\nCharles Niven\n(\nborn\n1845)\n; Barbara Niven\n(\nborn\n1848)\n; James Niven\n(\nborn\n1851)\n; Alexander Niven\n(\nborn\n1854)\n; Thomas Niven\n(\nborn\n1855)\n; and George Niven\n(\nborn\n1859)\n. William was one of three distinguished mathematical brothers,\nCharles\nand James also being Cambridge\nWranglers\n.\nCharles Niven\n, who was Professor of Natural Philosophy at Aberdeen University for\n41\nyears, has a biography in this archive. James Niven studied mathematics at Queens' College, Cambridge and was bracketed eighth wrangler in the mathematical tripos of\n1874\n. He went on to study medicine and became medical officer of health for Manchester.\nWilliam Niven's secondary schooling was at the Grammar School, Aberdeen, from where he entered King's College of the University of Aberdeen. In\n1861\nhe graduated with an M.A. from the University of Aberdeen which, of course, was his local university as Peterhead is not far from Aberdeen in Scotland. From there, as was the tradition of the Scottish Universities at that time, Niven went to study at the University of Cambridge matriculating in\n1862\n.\nAt Cambridge Niven studied mathematics at Trinity College, where he graduated as third Wrangler in the mathematical tripos of\n1866\n(\nthe means that he was ranked third among the First Class students\n)\n. The following year he was elected to a fellowship at Trinity College but after holding the fellowship for some time he left Cambridge to take up an appointment as Professor of Mathematics at the Royal Indian Engineering College, Cooper's Hill, Surrey. This College, explicitly set up to train engineers for work in India, was opened on\n5\nAugust\n1872\nand Niven became its first mathematics professor.\nSoon, however, Niven left the Engineering College to take up an appointment as professor at the Royal Arsenal in Woolwich. There he undertook research on gunnery and ballistics, and we quote below from his paper\nOn the Calculation of the Trajectories of Shot\nwhich describes important work he undertook at this time. However the attraction of Cambridge was great and he returned to Trinity College as a College Lecturer in\n1874\n. He soon became a firm friend of\nJames Clerk Maxwell\nbut this friendship was tragically cut short when\nMaxwell\ndied in\n1879\n. After\nMaxwell\n's death, Niven looked after\nMaxwell\n's affairs and, most importantly, helped to edit the second edition of\nMaxwell\n's\nElectricity and Magnetism\nand began the task of editing\nMaxwell\n's scientific papers. Inspired by\nMaxwell\nand his mathematics, Niven's research interests turned increasingly towards the study of spherical and ellipsoidal harmonics\n[\n2\n]\n:-\nMaxwell\n's new developments in the theory of electricity excited keen interest; Niven's public lectures on the subject were attended by a great many Cambridge mathematicians of the day. From\n1877\nhe devoted sustained attention to the development of\nMaxwell\n's method of defining the general spherical harmonic in terms of its poles. In\n1879\nhe wrote a memoir exhibiting the scope of this method by various applications, especially to the evaluation of integrals over a sphere of products of three or more harmonics. A further memoir in\n1890\non elliptical harmonics extended and generalised his earlier work. His work in the later\n1890\ns was on electrostatics.\nWe note the titles of some of the papers referred to in the above quote:\nOn the Theory of Electric Images, and its application to the case of two Charged Spherical Conductors\n(1876)\n;\nOn the Electrical Capacity of a Conductor bounded by Two Spherical Surfaces cutting at any angle\n(1880)\n;\nOn the Harmonics of a Ring\n(1892)\n; and\nNote on the Electric Capacity of a Conductor in the form of Two Intersecting Spheres\n(1896)\n. These four papers were all published in the\nProceedings\nof the\nLondon Mathematical Society\n. He also published\nOn Certain Definite Integrals Occurring in Spherical Harmonic Analysis, and on the Expansion in Series of the Potentials of the Ellipsoid and of the Ellipse\n(1879)\n,\nOn Ellipsoidal Harmonics\n(1891)\n,\nOn the Calculation of the Trajectories of Shot\n(1877)\n, and\nThe Calculation of Ellipsoidal Harmonics\n(1906)\nin the\nPhilosophical Transactions\nor the\nProceedings\nof the\nRoyal Society\n. As we mentioned above, he edited\nThe scientific papers of James Clerk Maxwell\n(2\nvolumes\n)\n(1890)\npublished by\nCambridge University Press\n.\nThe paper\nOn the Calculation of the Trajectories of Shot\n(1877)\n, already mentioned as illustrating work he did at the Royal Arsenal, was communicated to the\nRoyal Society\nby\nMaxwell\n. We quote from Niven's Introduction to explain the nature of the work:-\nIn the present state of our knowledge of the resistance of the air to shot, the problem of integrating the equations of motion of the shot and of plotting-out a representation of the curve described by it is peculiar, because, according to the best experiments we possess, the law of the retardation cannot be expressed by a single exact formula which is available for the solution. We are therefore compelled to give a solution adapted to Tables, the magnitudes of the retardation being set down in those Tables for velocities which are common in practice. ... The amount of labour, however, in calculating all the quantities for a single component arc, even with the aid of copious tables, is so great that I was led to examine whether any thing could be done towards simplifying the solution and reducing the amount of calculation. It will appear in the sequel that rules of comparatively easy application can be employed, and that the tables necessary for their use are already existing or can be easily formed.\nIn\n1882\nNiven was appointed as Director of Studies of the Royal Naval College in Greenwich. He was able to encourage some of the best Cambridge mathematicians such as\nWilliam Burnside\nto accept posts at Greenwich greatly enhancing its reputation\n[\n1\n]\n:-\nHis talent for friendship and quiet social amenities made his beautiful residence, on the river front of the Palace of Greenwich, a centre of the life of the staff; and here also he won and retained through life the friendship of successive admirals who came for a term of office as Governors of the College. He induced some of his Cambridge friends of high mathematical eminence to undertake posts on the staff: by his hospitality he made the position of external examiner so attractive that he could command the services of the best qualified men of the time.\nIn the same year of\n1882\nthat he was appointed to Greenwich, on\n8\nJune, he was honoured by being elected a fellow of the\nRoyal Society\n. He served on the Council of the Society in\n1892\n-\n94\nand, after he retired from Greenwich in\n1903\n, he served as vice-president of the\nRoyal Society\nin\n1904\n-\n06\n. On his retirement in\n1903\nhe was honoured for his services by being made KCB - at this point he became Sir William Davidson Niven.\nNiven was an active member and staunch supporter of the\nLondon Mathematical Society\nfrom his election to the Society on\n8\nMay\n1873\n. He served on the Council of the Society from the year of his election to the Society, continuing to serve for fourteen years. He served as its President from\n1908\nuntil\n1910\n. His Presidential address was \"The relations of mathematics to experimental science\" but\n[\n1\n]\n:-\n... with characteristic modesty he seems to have withdrawn it from publication.\nShortly before his death, his professional friends and colleagues from Cambridge, London and Aberdeen put up money to have his portrait painted. It was presented to the University of Aberdeen and it was hung in King's Buildings.",
  "matematicos_citados_na_biografia": [
    "Charles Niven",
    "Charles",
    "Wranglers",
    "James Clerk Maxwell",
    "Maxwell",
    "London Mathematical Society",
    "Royal Society",
    "William Burnside"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}