{
  "nome_completo": "William Fogg Osgood",
  "nome_curto": "William Osgood",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Osgood/",
  "data_nascimento": "10 March 1864",
  "local_nascimento": "Boston, Massachusetts, USA",
  "data_morte": "22 July 1943",
  "local_morte": "Belmont, Massachusetts, USA",
  "summary": "William Osgood was important in bringing the latest ideas of mathematical research to the United States.",
  "biografia": "William Osgood\n's mother was Mary Rogers Gannett and his father was William Osgood who was a medical doctor. He studied at the Boston Latin School where\nBenjamin Osgood Peirce\ntaught mathematics for the year\n1880\n-\n81\nbut at this stage Osgood was interested in studying the classics. He entered Harvard College in\n1882\n, still intent on studying classics, and for two years he pursued this aim. However\nF N Cole\nand\nB O Peirce\n, who had begun teaching at Harvard the year before Osgood entered, persuaded him to study mathematics. He was also influenced by two other mathematics lecturers at Harvard, namely James Mills Peirce, the son of\nBenjamin Peirce\n, and William Elwood Byerly who was renowned as an excellent teacher. Osgood graduated with a A.B. in\n1886\n, coming second out of\n286\nstudents, then undertook graduate work at Harvard for a year, graduating with a Master's Degree in\n1887\n. Osgood wrote of\nCole\n(\nsee for example\n[\n2\n]\npage\n196)\n:-\n[\nJames Mills Peirce's lectures\n]\nstood as the Old over and against the New, and of the latter\nCole\nwas the apostle. The students felt that he had seen a great light. Nearly all the members of the Department attended his lectures. It was the beginning of a new era in graduate education at Harvard ...\nCole\nhad attended\nKlein\n's lectures at Harvard in\n1885\n-\n87\non function theory and he persuaded Osgood to go to Göttingen in\n1887\nand study with\nKlein\n. Osgood was awarded a Parker Fellowship and set off for Germany in the autumn of\n1887\nhaving already an excellent command of the German language and a deep respect for German learning. After working with\nKlein\nfor two years, Osgood wondered if he might not benefit by spending some time at another German University before the end of his three year fellowship. He wrote to Harry Tyler, an American student of mathematics who was studying at Erlangen, asking for his advice. Tyler replied\n[\n2\n]\n:-\nI think in the first place that it is much better for you or anyone else who has three years abroad not to spend the whole time in Göttingen unless for special reasons of great importance. I do not think the incidental loss comparable with the gain in broader knowledge of mathematics and mathematicians. So I wouldn't stay at Göttingen even if it were somewhat better than any other university ...\nTyler also described to Osgood the two mathematicians at Erlangen who might act as his supervisor, namely\nMax Noether\nand\nPaul Gordan\n:-\nBoth men are so peculiar and so irreconcilable that ...\n[\npersonal relations\n]\nmust be cultivated with some tact ... As far as I know\n[\nMax Noether\n]\nlike\n[\nGordan\n]\nconfines himself to pure mathematics ... and both I think run to depth rather than breadth, as compared with\nKlein\n. If they have so much in common, that's about all.\n[\nGordan\n]\nis outspoken, irascible, exasperating, violent.\n[\nMax Noether\n]\nis taciturn, serious, equable, patient.\nOsgood took Tyler's advice and undertook graduate work with\nMax Noether\nat Erlangen in\n1889\n. He did this despite having met Theresa Anna Amalie Elise Ruprecht in Göttingen and the two already were thinking of marriage. Theresa's family owned the local publishing firm of Vandenhoeck & Ruprecht. His thesis, written while at Erlangen, was based on work suggested by\nKlein\non\nabelian functions\nand this fitted particularly well with\nMax Noether\n's interests at that time. After being awarded a doctorate by Erlangen in\n1890\nfor his thesis\nZur Theorie der zum algebraischen Gebilde\ny\nm\n=\nR\n(\nx\n)\ny^{m} = R(x)\ny\nm\n=\nR\n(\nx\n)\ngehörigen Ableschen Functionen\nⓉ\n(\nOn the theory of the algebraic structure y\nm\n= R\n(\nx\n)\nassociated with Abel's functions\n)\n, he married Theresa Ruprecht and they returned to Harvard. Walsh writes\n[\n7\n]\nor\n[\n8\n]\n:-\nAt about this time a large number of Americans were returning from graduate work in Germany with the ambition to raise the scientific level of mathematics in this country. There was no spirit of research at Harvard then, except what Osgood himself brought, but a year later\nMaxime Bôcher\njoined him there, also a student greatly influenced by\nFelix Klein\n, and a man of mathematical background and ideals similar to those of Osgood. They were very close friends both personally and in scientific work until\nBôcher\n's death in\n1918\n.\nAt Harvard Osgood was an instructor in mathematics from\n1890\nto\n1893\nwhen he was promoted to assistant professor. He held this post until\n1903\nwhen he was promoted to full professor, being named Perkin Professor of Mathematics in\n1913\non the death of the holder of the chair William Elwood Byerly who had taught Osgood as an undergraduate and had then been his colleague for\n23\nyears. He must have been a slightly odd character, however\n[\n2\n]\n:-\nIt is safe to say that no American mathematician during this period\n(\nand certainly none since\n)\nbore the mark of German academic training as visibly and as permanently as Osgood. ... He even sympathized with the German cause during World War I. Later in life,\nNorbert Wiener\nthought he cut a rather ridiculous figure, self-consciously emulating even the mannerisms of a German professor.\nOsgood's main work was on the convergence of sequences of continuous functions, solutions of\ndifferential equations\n, the\ncalculus of variations\nand space filling curves. Some of his early work is described in\n[\n7\n]\nor\n[\n8\n]\n:-\nIn\n1897\nhe published a deep investigation into the subject of uniform convergence of sequences of real continuous functions ... In\n1898\nOsgood published an important paper on the solutions of the differential equation\nd\ny\nd\nx\n=\nf\n(\nx\n,\ny\n)\n\\Large\\frac{dy}{dx}\\normalsize  = f (x, y)\nd\nx\nd\ny\n​\n=\nf\n(\nx\n,\ny\n)\nsatisfying the prescribed initial conditions\ny\n(\na\n)\n=\nb\ny(a) = b\ny\n(\na\n)\n=\nb\n. ... Osgood showed that if\nf\n(\nx\n,\ny\n)\nf (x, y)\nf\n(\nx\n,\ny\n)\nis merely continuous there exists at least one solution ... In\n1900\nOsgood established, by methods due to\nH Poincaré\n, the\nRiemann\nmapping theorem, namely that an arbitrary simply connected region of the plane with at least two boundary points, can be mapped uniformly and conformally onto the interior of a circle. ... This theorem remains as Osgood's outstanding single result.\nSome papers over the next few years included:\nSufficient conditions in the calculus of variations\n(1900)\n,\nOn a fundamental property of a minimum in the calculus of variations and the proof of a theorem of Weierstrass's\n(1901)\n,\nA Jordan curve of positive area\n(1903)\n,\nOn Cantor's theorem concerning the coefficients of a convergent trigonometric series, with generalizations\n(1909)\n,\nOn the gyroscope\n(1922)\n, and\nOn normal forms of differential equations\n(1925)\n.\nHis\nLehrbuch der Funktionentheorie\n(\nVolume I,\n1907)\nbecame a classic. The complete work occupied three volumes: Volume I, Volume II, Part I, and Volume II, Part II. The second volume\n(\nVolume II, Part I\n)\nappeared in\n1924\nand the final volume\n(\nVolume II, Part II\n)\nwas first published in\n1932\n. Other classic texts included\nIntroduction to Infinite Series\n(1897)\n,\nA First Course in the Differential and Integral Calculus\n(1909)\n,\nTopics in the theory of functions of several complex variables\npublished by the\nAmerican Mathematical Society\nin\n1914\n,\nPlane and Solid Analytic Geometry\n(\nwith W C Graustein,\n1921)\n,\nAdvanced Calculus\n(1925)\n, and\nMechanics\n(1937)\n.\nOsgood's marriage to Teresa produced three children, William Ruprecht, Frieda Bertha Ruprecht\n(\nwho married Walter Silz\n)\n, and Rudolf Ruprecht. However the marriage ended in divorce and Osgood married Celeste Phelps Morse, the former wife of\nMarston Morse\n, in August\n1932\n.\nMorse\n, also a professor of mathematics at Harvard, had divorced Celeste in\n1930\n. When Celeste married Osgood, who was\n28\nyears older than\nMorse\nand\n68\nyears old at the time of the marriage, not only did\nMorse\nreceive a great shock, but there was a scandal which led to Osgood retiring. After he retired from Harvard in\n1933\n, Osgood taught for two years at the National University of Peking. At this time he had two texts published based on the lectures he gave in Peking:\nFunctions of real variables\n(1936)\n, and\nFunctions of a complex variable\n(1936)\n.\nOsgood is important in bringing the latest ideas of mathematical research to the United States. He received many honours for these contributions. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1904\nand had the honour of being president of the\nAmerican Mathematical Society\nduring\n1905\n-\n06\n. He was twice\nAmerican Mathematical Society\nColloquium Lecturer, first in\n1898\nand again in\n1913\n.\nA kindly but reserved man, he liked to travel by car, playing tennis and golf, and smoking cigars\n[\n8\n]\n:-\n... he smoked until little of the cigar was left, then inserted the small blade of a penknife in the stub so as to have a convenient way to continue.\nAfter returning from China he lived in Belmont, Massachusetts, and after his death there he was buried in Forest Hills Cemetery, Boston.",
  "matematicos_citados_na_biografia": [
    "Benjamin Osgood Peirce",
    "F N Cole",
    "B O Peirce",
    "Benjamin Peirce",
    "Cole",
    "Klein",
    "Max Noether",
    "Paul Gordan",
    "Gordan",
    "abelian functions",
    "Maxime Bôcher",
    "Felix Klein",
    "Bôcher",
    "Norbert Wiener",
    "differential equations",
    "calculus of variations",
    "H Poincaré",
    "Riemann",
    "American Mathematical Society",
    "Marston Morse",
    "Morse",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}