{
  "nome_completo": "William Thomson (Lord Kelvin)",
  "nome_curto": "William Thomson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thomson/",
  "data_nascimento": "26 June 1824",
  "local_nascimento": "Belfast, Ireland",
  "data_morte": "17 December 1907",
  "local_morte": "Netherhall (near Largs), Ayrshire, Scotland",
  "summary": "William Thomson ( Lord Kelvin ) became Professor of Natural Philosophy at Glasgow at a very young age. He made important contributions to many areas of Physics including electricity, magnetism and thermodynamics. His work on the first trans-Atlantic telegraph cable made his fortune.",
  "biografia": "William Thomson\n's father,\nJames Thomson\n, had originally intended to become a minister of the Presbyterian Church but had opted for an academic career as a mathematician. William's mother died when he was six years old and from that time he was brought up by his father.\nJames Thomson\nwas the professor of engineering in Belfast at the time of William's birth and, when William was eight years old, his father\nJames\nwas appointed to the chair of mathematics at the University of Glasgow.\nJames Thomson\nwas a dominant father who brought his family up in a strict Presbyterian fashion. William's sister wrote of this childhood\n[\n5\n]\n:-\nOur father read to us regularly every Sunday morning some chapters in the Old Testament, and in the evening some in the New.\nHowever, despite his father being very strict he had a very close relationship with William. It was from his father that William learnt mathematics and at a very young age he became an accomplished mathematician with knowledge of the latest developments in the subject.\nWilliam attended Glasgow University from the age of\n10\n. This early age is not quite as unusual as one would think, for at that time the universities in Scotland to some extent competed with the schools for the most able junior pupils. Thomson began what we would consider university level work in\n1838\nwhen he was\n14\nyears old. In the session\n1838\n-\n39\nhe studied astronomy and chemistry. The following year he took natural philosophy courses\n(\ntoday called physics\n)\nwhich included a study of heat, electricity and magnetism. His\nEssay on the Figure of the Earth\nwon him a gold medal from the University of Glasgow when he was\n15\nyears old and it was a truly remarkable work containing important ideas which Thomson returned to throughout his life.\nAt the end of session\n1839\n-\n40\nThomson read\nFourier\n's\nThe Analytical Theory of Heat\na work on the application of abstract mathematics to heat flow. He later wrote\n[\n10\n]\n:-\nI took\nFourier\nout of the University Library; and in a fortnight I had mastered it - gone right through it.\nIn fact there was a strong interest among the lecturers in Glasgow at that time in the French mathematical approach to physical science. In particular the works of\nLagrange\n,\nLaplace\n,\nLegendre\n,\nFresnel\nand\nFourier\nwere treated with \"reverence\" to use a word which Thomson himself would later use to describe the attitude that his lecturers had towards these French mathematicians. In fact Thomson also read\nLaplace\n's\nMécanique céleste\nin session\n1839\n-\n40\nand visited Paris during this session. Wilson, writing in\n[\n11\n]\n, describes Thomson's undergraduate years in Glasgow as follows:-\n... from\n1838\nto\n1841\n, William appears to have become thoroughly familiar with the phenomena of heat, electricity, and magnetism. Meikleham\n[\nthe professor of natural philosophy\n]\nevidently encouraged something of a unified view of these branches of natural philosophy. Not only did his professors put him in touch with much modern experimental and mathematical research, but they also articulated the ideal of mathematising physical theory, even though none of them was himself a master of that craft.\nIn\n1841\nThomson entered Cambridge and in the same year his first paper was published. This paper\nFourier's expansions of functions in trigonometrical series\nwas written to defend\nFourier\n's mathematics against criticism from the professor of mathematics at the university of Edinburgh. A more important paper\nOn the uniform motion of heat and its connection with the mathematical theory of electricity\nwas published in\n1842\nwhile Thomson was studying for the mathematical tripos examinations at Cambridge.\nAt Cambridge Thomson was coached by\nWilliam Hopkins\n, a famous Cambridge coach who played a more important role than the lecturers. Despite the efforts of\nBabbage\n,\nPeacock\nand\nHerschel\nto introduce the new French mathematics into Cambridge, the style of the Mathematical Tripos taken by Thomson still left much to be desired.\nHerschel\nand\nBabbage\nhad conducted some experiments on magnetism in\n1825\n, developing methods introduced by\nArago\n, but nothing on heat, electricity or magnetism had entered the syllabus of the Tripos.\nThomson took the final part of the Mathematical Tripos examinations in\n1845\n. He graduated with a BA and he was Second\nWrangler\n(\nranked second in the list of those obtaining a First Class degree\n)\n. Further examinations saw him become first Smith's prizeman and he was elected a fellow of Peterhouse. Also in\n1845\nThomson read\nGeorge Green\n's work which was to have a major influence on the direction of his research. His interest in the French approach, and advice from his father, meant that after taking his degree Thomson went to Paris. There he worked in the physical laboratory of Henri-Victor Regnault and he was soon taking part in deep discussions with\nBiot\n,\nCauchy\n,\nLiouville\n, Dumas, and\nSturm\n.\nPerhaps the most profitable discussions that Thomson had in Paris were with\nLiouville\n. It was at\nLiouville\n's request that Thomson began to try to bring together the ideas of\nFaraday\n,\nCoulomb\nand\nPoisson\non electrical theory. Ideas of 'action at a distance' or properties of the 'ether', and ideas of an 'electrical fluid' were difficult to unify. There were problems of whether or not an 'electrical fluid' was an actual physical entity with the properties of a fluid. Thomson was led to study the whole methodology of a physical science, distinguishing 'physical' parts of a theory from 'mathematical' parts.\nIn\n1846\nthe chair of natural philosophy at Glasgow became vacant. Thomson's father used his influence in the University to help his son become the leading candidate for the post. Thomson returned from Paris to Glasgow and, in\n1846\n, was unanimously elected professor of natural philosophy at the University. In\n1847\n-\n49\nhe collaborated with\nStokes\non hydrodynamical studies, which Thomson applied to electrical and\natomic theory\n. This collaboration with\nStokes\nwas to last for over fifty years with frequent letters on scientific matters being exchanged. Many of these letters have survived, for example copies of\n407\nletters from Thomson to\nStokes\nand\n249\nletters from\nStokes\nto Thomson have been published. Many of these letters discuss the mathematical similarities in the theory of heat and the theory of fluids. For example\nStokes\nwrote to Thomson in\n1847\n(\nsee for example\n[\n11\n]\n)\n:-\nWhat an intimate relation there is between the mathematical considerations which are applicable to heat, fluid motion, and attraction.\nThe thermodynamical studies of Thomson led him to propose an absolute scale of temperature in\n1848\n. The absolute scale that he proposed was based on his studies of the theory of heat, in particular the theory proposed by\nSadi Carnot\nand later developed by\nClapeyron\n. The Kelvin absolute temperature scale, as it is now known, was precisely defined much later after conservation of energy had become better understood. It derives its name from the title, Baron Kelvin of Largs, that Thomson received from the British government in\n1892\n, and named after Thomson because of his proposal in this\n1848\npaper.\nThomson's work on heat, and its shortcomings, is described fully in\n[\n16\n]\n. The author summarises his conclusions:-\n... Thomson published between\n1849\nand\n1852\nthree influential papers on the theory of heat. However, historians of science have already called attention to Thomson's difficulties in reconciling a principle formulated by James Prescott Joule with another principle formulated by\nNicolas Leonard Sadi Carnot\n, and to errors Thomson made in his calculations. In the meantime,\nRudolf Julius Emmanuel Clausius\nreconciled the two principles, and in\n1854\nhe derived an expression for Carnot's principle. ... it was fundamental to\nClausius\n's reasoning that he took to its ultimate consequence the meaning of Carnot's principle as a 'recovery' condition. Thomson somehow let the meaning of 'recovery' escape him. Therefrom came his troubles. He seems to have been so obsessed by his initial difficulties that he put the emphasis on irreversibility and on conservation of energy, missing 'all the rest'.\nIn\n1852\nThomson observed what is now called the Joule-Thomson effect, namely the decrease in temperature of a gas when it expands in a vacuum. Joule's ideas on heat were to change Thomson's views over the years. Thomson came to believe in a dynamical theory of heat and, in\n1872\n, he wrote about how his views were led towards that approach\n(\nsee for example\n[\n1\n]\n)\n:-\n...\n[\nbefore\n1847]\nI did not ... know that motion is the very essence of what has hitherto been called matter. At the\n1847\nmeeting of the\nBritish Association\nin Oxford, I learned from Joule the dynamical theory of heat, and was forced to abandon at once many, and gradually from year to year all other, statical preconceptions regarding the ultimate causes of apparently statical phenomena.\nThe dynamical theory of heat led Thomson to also think of a dynamical theory for electricity and magnetism. In\n1856\nhe sent a paper on this subject to the\nRoyal Society of London\nentitled\nDynamical illustrations of the magnetic and helicoidal rotary effects of transparent bodies on polarised light\n. He explained his notion of electricity in these words a few years later\n(\nsee\n[\n1\n]\n)\n:-\n... we can conceive that electricity itself is to be understood as not an accident, but an essence of matter. Whatever electricity is, it seems quite certain that electricity in motion is heat; and that a certain alignment of axes of revolution in this motion is magnetism...\nThis work by Thomson in\n1856\non electricity and magnetism is important for it was these ideas which led\nMaxwell\nto develop his remarkable new theory of electromagnetism. One might think that Thomson would have eagerly supported\nMaxwell\n's theory which his own work had helped to create, but this was not so. Thomson had ideas of his own which he hoped would lead to a unifying theory, and his ideas took him further and further from accepting those of\nMaxwell\n.\nOn vortex motion\nwhich Thomson published in\n1867\n, set out his ideas. The paper begins:-\nThe mathematical work of the present paper has been performed to illustrate the hypothesis that space is continuously occupied by an incompressible frictionless fluid acted on by no force, and that material phenomena of every kind depend solely on motions created in the fluid.\nHowever, Thomson's initial hope that his theory could explain electromagnetism, light, gravity, and chemical processes slowly faded. In\n[\n25\n]\nthe author argues for the importance of Thomson's electromagnetic work despite its eventual failure:-\nWe wish to stress Thomson's often under-estimated merits in the theory of the electromagnetic field. W Thomson was the first who tried to treat mathematically\nFaraday\n's conception of lines of force, and he introduced\nJ C Maxwell\nto the problems of the electromagnetic field not only by his works, but also by his personal initiative.\nThe author of the biography of Thomson\n[\n30\n]\n, puts forward the view that during the first half of Thomson's career he seemed incapable of being wrong while during the second half of his career he seemed incapable of being right. This seems too extreme a view, but Thomson's refusal to accept atoms, his opposition to Darwin's theories, his incorrect speculations as to the age of the Earth and the Sun, and his opposition to Rutherford's ideas of radioactivity, certainly put him on the losing side of many arguments later in his career.\nHaving studied some of Thomson's research contributions, let us comment on the innovations he introduced into teaching at the University of Glasgow. He introduced laboratory work into the degree courses, keeping this part of the work distinct from the mathematical side. He encouraged the best students by offering prizes. Some prizes were awarded to the best student, a vote being organised among the students to determine the recipient. There were also prizes which Thomson gave to the student that he considered most deserving.\nNot only did Thomson take a unified view of the physical world in his research, but he carried this into his teaching. One of his students, who attended Thomson's\n1859\n-\n60\nlectures, wrote\n(\nsee\n[\n11\n]\n)\n:-\nHis impulse was to correlate phenomena and arrive at the principle underlying them, and this gave him a certain impatience with branches of science which were still in the observational stage, and not yet come under mechanical laws. Hence the most brilliant and weighty part of his course was at the end, when he summed up his teaching and generalised energy, and the correlation of the physical forces...\nAnother of Thomson's famous pieces of work was his joint project with\nTait\nto produce their famous text\nTreatise on Natural Philosophy\nwhich they began working on in the early\n1860\ns. They worked by posting a notebook back and forward to each other on this huge project which Thomson envisaged as covering all physical theories. Many volumes were intended, but only the first two were ever written which cover kinematics and dynamics. These were remarkable volumes which became the standard texts for many generations of scientists.\nThomson achieved his greatest fame through an event that we have still to discuss. He was always greatly interested in the improvement of physical instrumentation, and Thomson designed and implemented many new devices, including the mirror-galvanometer that was used in the first successful sustained telegraph transmissions in transatlantic submarine cable. Thomson had joined a group of industrialists in the mid\n1850\ns on a project to lay a submarine cable between Ireland and Newfoundland. He played several roles in this project, being on the board of directors and also being an advisor on theoretical electrical matters.\nThe electrician who was in charge of the practical side of the operation was E O W Whitehouse, who insisted on using his own system against Thomson's advice. The cable was successfully laid in\n1858\n, an attempt having failed the previous year when the cable broke. After initial difficulties with transmitting a signal, there was a sudden marked improvement and Whitehouse claimed success for his system. However it was soon discovered that he had substituted Thomson's mirror-galvanometer for his own instruments and there was a furious row between Whitehouse, Thomson and the other directors. Thomson's instruments were fully used for the third attempt at laying a cable in\n1865\nand this proved highly successful with rapid transmission of signals possible.\nFor his work on the transatlantic cable Thomson was knighted in\n1866\nand made Baron Kelvin of Largs in\n1892\n. The Kelvin is the river which runs through the grounds of Glasgow University and Largs is the town on the Scottish coast where Thomson built his house. As well as fame, his participation in the telegraph cable project led to a large personal fortune brought about by his cable patents and consulting. He was able to buy a\n126\n-ton yacht\n(\nthe Lalla Rookh\n)\nas well as a fine house with surrounding estate. The\nGlasgow Herald\nproudly claimed the success of the cable\n[\n10\n]\n:-\nIs Professor Thomson, the distinguished electrician, without whose inspiring genius this great business had not been so easily achieved, not a Glasgow man? And were the principal electrical instruments employed in testing and working the cable not manufactured by Mr White, the optician of this city, though under Professor Thomson's directions?\nThomson published more than\n600\npapers. He was elected to the\nRoyal Society\nin\n1851\n, received its Royal Medal in\n1856\n, received its Copley Medal in\n1883\nand served as its president from\n1890\nto\n1895\n. In addition to his activities with the\nRoyal Society\n, as one would expect of such an eminent Scottish professor, he served the\nRoyal Society of Edinburgh\nover many years. He served three terms as president of this Society, first from\n1873\nto\n1878\n, for the second time from\n1886\nto\n1890\n, and for the third time from\n1895\nuntil his death in\n1907\n. Thomson served as president of yet a third society when he was elected as president of the\nBritish Association for the Advancement of Science\nin\n1871\n.\nThomson's ability as a lecturer was less impressive\n[\n3\n]\n:-\nAs a lecturer he was rather prone to let his subject run away with him. When this happened, limits of time became of small account, and his audience, understanding but little of what he was saying, were feign to content themselves with admiring the restless vivacity of his manner\n(\nwhich was rather emphasized than otherwise by the slight lameness from which he suffered\n)\nand the keen zest with which he revelled in the intricacies of the matter in hand.",
  "matematicos_citados_na_biografia": [
    "James Thomson",
    "James",
    "Fourier",
    "Lagrange",
    "Laplace",
    "Legendre",
    "Fresnel",
    "William Hopkins",
    "Babbage",
    "Peacock",
    "Herschel",
    "Arago",
    "Wrangler",
    "George Green",
    "Biot",
    "Cauchy",
    "Liouville",
    "Sturm",
    "Faraday",
    "Coulomb",
    "Poisson",
    "Stokes",
    "atomic theory",
    "Sadi Carnot",
    "Clapeyron",
    "Nicolas Leonard Sadi Carnot",
    "Rudolf Julius Emmanuel Clausius",
    "Clausius",
    "British Association",
    "Royal Society of London",
    "Maxwell",
    "J C Maxwell",
    "Tait",
    "Royal Society",
    "Royal Society of Edinburgh",
    "British Association for the Advancement of Science"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}