{
  "nome_completo": "Willebrord van Royen Snell",
  "nome_curto": "Willebrord Snell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Snell/",
  "data_nascimento": "13 June 1580",
  "local_nascimento": "Leiden, Netherlands",
  "data_morte": "30 October 1626",
  "local_morte": "Leiden, Netherlands",
  "summary": "Willebrord Snell was a Dutch mathematician who is best known for the law of refraction, a basis of modern geometric optics; but this only become known after his death when Huygens published it.",
  "biografia": "Willebrord Snell\n's name appears as Snel or Snel van Royen. It is also commonly given as\nWillebrordus Snellius\n, the Latin version of Willebrord Snell, which he used for all his publications. His father was Rudolph Snell\n(1546\n-\n1613)\n, the professor of mathematics at Leiden, and his mother was Machteld Cornelisdochter from an leading family from Oudewater. Willebrord, the eldest of his parents' three children, was named after his paternal grandfather. His two younger brothers were Jacob\n(\nwho died in\n1599\naged\n16)\nand Hendrik\n(\nwho died in childhood\n)\n. Let us make a comment on Willebrord's date of birth. Some biographies of Snell give\n1591\nas the year of his birth but this is simply an error copied from an old biography. Others give the year as\n1580\nor\n1581\nbut claim that his date of birth is unknown. In fact no record of his birth exists but his date of birth can be deduced with a fair degree of certainty from a letter his father wrote on his son's birthday. See\n[\n3\n]\nfor further details.\nRudolph Snell\n(1546\n-\n1613)\n, although appointed as an extraordinary professor of mathematics at the University of Leiden in\n1581\n, was a broad scholar who did not have a great deal of mathematical skill. His teaching was based mainly on the work of\nPeter Ramus\nalthough the university authorities tried to persuade him to teach more\nEuclid\nand less\nRamus\n. He had taught Greek, Latin, Hebrew and the liberal arts in a high school earlier in his career and he had studied medicine and\nAristotle\n's works. In addition to his university work, Rudolphus ran his own private school and, in his house near the university, he boarded a large number of students. It is in this house, filled with students, in which Willebrord grew up. His schooling was from his father who taught him Latin, Greek and philosophy. He had no other education before entering university but since his father ran a school this is not remarkable. Rudolphus would have liked his son to study law at university but Willebrord was keen to study mathematics and, continuing to live at home, he became a private pupil of\nLudolph Van Ceulen\n. By\n1600\nSnell was studying law and teaching mathematics at the university on days when the professor was not teaching.\nFrom\n1600\nhe travelled to various European countries, mostly discussing astronomy. He visited\nAdriaan van Roomen\nin Würzburg where he was professor of medicine and \"Mathematician to the Chapter\". After spending a while in Würzburg, the two mathematicians went to Prague where Snell was introduced to\nTycho Brahe\nby\nvan Roomen\n. Several years earlier Snell's father had arranged for him to be educated in Prague in an exchange with\nBrahe\n's son who would have been educated in Leiden but the arrangement was never put into practice. Snell spent some time with\nBrahe\nassisting him in making observations and clearly learnt much during this visit. The valuable experience came to an end in October\n1601\n, however, when\nBrahe\ndied. During this visit he got to know\nJohannes Kepler\nwho was\nBrahe\n's assistant at the time. Snell, still in the company of\nvan Roomen\n, continued visits to mathematicians in various German towns such as Joannes Praetorius in Altdorf,\nMichael Mästlin\nin Tübingen, and Wilhelm Hatzfeld and Christophorus Vulteius in Hersfeld. He returned to his father's home in Leiden in the spring of\n1602\nand began preparing manuscripts for publication. In\n1603\nhe went to Paris where his studies of law continued but he also had many contacts with mathematicians. After this visit he gave up the study of law and spent most of the rest of his life in his hometown of Leiden.\nAlthough Snell had no official position at the University of Leiden at this time he began teaching there to assist his father whose health was beginning to fail. For several years the two formed a good team teaching mathematics in Leiden. Slowly Snell's position at Leiden became more official. In\n1609\nhe was assigned teaching at\n8\no'clock every Saturday morning. In July of the following year daily afternoon teaching was added and by\n1612\nhe was receiving additional payment for his work. At this stage he was promised the chair of mathematics when his father retired and Snell took the opportunity created by having a low teaching load to publish translations, commentaries and editions of several works. These included commentaries on, and editions of, works by\nRamus\nas well as translations of works by\nStevin\nand\nVan Ceulen\n. It will not have escaped the reader's notice that Snell, like his father, was keen on\nRamus\n. This was undoubtedly due to his father's influence as seen by a letter Snell wrote to his father in\n1607\n(\nsee for example\n[\n3\n]\n)\n:-\nBecause you had stimulated me from my youth onwards to apply myself truly and fully to scholarship, and spurred me on when I hesitated, nothing was more important to me than to examine more attentively the exactness, clearness and brevity in the proofs of the ancients by means of your precepts, as rules and norms, because your Apollo\n[\nRamus\n]\nresolutely urged to do so in his 'Prooemium Mathematicum'.\nOther major contributions he made around this time, showing vastly more mathematical skills than his father, involve the restoration of books by\nApollonius\non plane loci which had been lost but an outline of their contents had been preserved by\nPappus\n. He published two of these under a Greek title which may be translated as\nThe Revived Geometry of Cutting off of a Ratio and Cutting off of an Area\n(1607)\n. He also published\nApollonius Batavus\nⓉ\n(\nWorks of Apollonius\n)\n(1608)\ncontaining a reconstruction of a third work by\nApollonius\n. Further work on\nApollonius\nwhich Snell produced at this time was never published and has been lost.\nSnell received the degree for Master of Arts from Leiden on\n12\nJuly\n1608\nafter defending theses on artes liberales: grammatica, rhetorica, logica, arithmetica, geometria, analysis/algebra, physica, optica, astronomia, geographia, gnonomica, statica and ethica. He married Maria de Langhe, the daughter of Janneke Symons and Laurens Adriaens de Langhe, a burgomaster of Schoonhoven, in August\n1608\n. The couple had at least seven children\n(\nthe statement in his funeral oration that he had\n18\nchildren seems unlikely\n)\n, only three of whom survived to adulthood. On\n8\nFebruary\n1613\nhe succeeded his father as professor of mathematics at the University of Leiden. The arrangement was that he should take over the teaching duties since his father was too ill to continue but, should his father recover, he had to stand down. Since Rudolph died a month later, Snell was required to continue teaching but he struggled to get proper recognition from the University of Leiden. He received a higher salary in February\n1614\nbut was still getting between\n1\n3\n\\large\\frac{1}{3}\\normalsize\n3\n1\n​\nand\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\nof the salary of other professors. He was made a full professor of mathematics in February\n1615\nbut his salary was not increased. Slowly he received increases but only in\n1618\ndid he receive what he considered the proper amount for his position.\nIn\n1626\n, at the age of\n46\n, Snell died from colic which caused a fever and paralysis of his arms and legs. His illness lasted two weeks\n[\n3\n]\n:-\nWhen Snell had fallen ill, the medical doctors ... had been consulted, but they had not been able to prevent the deterioration of his situation. In the evening of\n30\nOctober,\n[\nthe doctors\n]\nwent to visit Snell to see the effects of a new medicine. This had not helped at all and after giving him a suppository for some relief, they left. Snell had dinner with his wife. Because he was not able to walk, his servants had to lift him up. He then suddenly lost consciousness and died,\n46\nyears old. He was buried on\n4\nNovember in the Pieterskerk in Leiden. Twenty students carried his coffin.\nLet us now look briefly at the contributions he made after being appointed as a professor at Leiden. In\n1617\nhe published\nEratosthenes Batavus\nⓉ\n(\nWorks of Eratosthenes\n)\n, which contains his methods for measuring the Earth. He proposed the method of triangulation and this work is the foundation of geodesy. Bowie writes\n[\n6\n]\n:-\nWillebrord Snell ... made a great advance over the methods used by his predecessors by introducing trigonometrical methods in the measurement of distances across country. He was really the originator of triangulation, which is now the universally employed method in surveying and mapping large areas. He published a book in Leiden describing his work in\n1617\n. In observing the angles of the triangles of his arc he used a quadrant of a circle of about two feet in radius. This was graduated to two minutes and readings were estimated to single minutes.\nIn this work Snell attempted to measure the circumference of the earth and so required a considerable number of measurements. To make these he had to travel quite widely in the Netherlands but leaving his family in Leiden caused him unhappiness. He used as a baseline the distance from his house to the local church spire, then built a system of triangles which allowed him to determine the distance between the towns of Alkmaar and Bergen-op-Zoom which is around\n130\nkm. He chose these towns since they were approximately on the same meridian\n(\nmodern data gives Alkmaar\n4\n°\n45\n'\n0\n\" East and Bergen-op-Zoom\n4\n°\n18\n'\n0\n\" East\n)\n. His measurements were surprising accurate allowing him to deduce a good value for the radius of the earth. He dedicated\nEratosthenes Batavus\nⓉ\n(\nWorks of Eratosthenes\n)\nto the States General which was a good move financially since in return they awarded him a sum amounting to almost half his annual salary.\nThroughout his career Snell was interested in astronomy and published several works on that topic some, but not all, of which contained data from his own observations. For example his\nObservationes Hassiacae\nⓉ\n(\nObservations from Hesse\n)\n(1618)\nwas a work which he wrote using data from the observations of other astronomers including\nTycho Brahe\nand\nJoost Bürgi\n, while\nDescriptio Cometae\nⓉ\n(\nDescription of comets\n)\n(1619)\ncontains his own observations of the comet which appeared in November\n1618\n. In this latter work Snell strongly criticised\nAristotle\nand stressed how harmful to the development of science it was to continue to treat his views with such reverence. Of course, in so doing Snell was following the teaching of\nRamus\nand of his own father. Despite his attack on\nAristotle\n, Snell did not accept\nCopernicus\n's heliocentric system but firmly believed in an Earth centred system.\nSnell also improved the classical method of calculating approximate values of\nπ\n\\pi\nπ\nby polygons which he published in\nCyclometricus\nⓉ\n(\nMeasuring the circle\n)\n(1621)\n. Using his method\n96\nsided polygons gives\nπ\n\\pi\nπ\ncorrect to\n7\nplaces while the classical method yields only\n2\nplaces.\nVan Ceulen\n's\n35\nplaces could be found with polygons of\n2\n30\n2^{30}\n2\n3\n0\nsides rather than\n2\n62\n2^{62}\n2\n6\n2\n. In fact\nVan Ceulen\n's\n35\nplaces of\nπ\n\\pi\nπ\nappear in print for the first time in this book by Snell.\nAlthough he discovered the law of\nrefraction\nnow known as \"Snell's law\" in\n1621\n, a basis of modern geometric optics, he did not publish it and only in\n1703\ndid it become known when\nChristiaan Huygens\npublished Snell's result in\nDioptrica\n. There is a manuscript by Snell's which is an outline of a treatise he intended to write on optics. It is now in the library of the University of Amsterdam and known as the 'Amsterdam manuscript'. Klaus Hentschel in\n[\n10\n]\ntries to construct the path which led Snell to discover Snell's law:-\nBecause of his geodetic work in which he pioneered the method of triangulation, Snell already had considerable experience with trigonometric functions; indicative of this are the two allusions to geodesics in the Amsterdam manuscript, one of them directly before the law of refraction .... Other remarks in the manuscript reveal that Snell had studied the existing literature on optics, particularly on refraction; various passages in the manuscript are analogous in formulation and sequence to other treatises as shown by his marginal notes and occasional references to other texts interspersed throughout the manuscript. Snell showed special interest in\nIbn al-Haytham\n's experimentum elegans .... He sought a geometrical description of the refractaria .... This search led him to find the law of refraction in the secant form ....\nSnell studied the\nloxodrome\n, the path on the sphere that makes constant angle with the meridians. This appears in\nTiphys batavus\nⓉ\n(\nWorks of Tiphys\n(\nTyphus was the helmsman of the Argonauts\n)\n)\npublished in\n1624\n, a work in which he studied navigation. The work was in two parts, one a theoretical piece of mathematics, the other devoted to practical applications.\nVollgraff puts Snell into his historical context in\n[\n16\n]\n:-\nWillebrord Snellius ... is a striking example of the early seventeenth century man. There is in his mind no overwhelming desire to break with the past. He is thinking his own thoughts neither as an oppositionist nor as a blind admirer, but as an intelligent and critical disciple. Like his father Rudolph he is, it is true, a follower of\nRamus\nwho was, especially in his youth, in sharp opposition to\nAristotle\nor rather to the professors at Paris who taught Aristotelian logics; but there is no evidence of his having been much troubled with logics himself, so he shows nowhere any animosity against\nAristotle\n. With\nRamus\n[\nand\nBrahe\n]\nhe takes the earth to be the centre of the universe. In his notes on optics he quotes indiscriminately\nPlato\n,\nAristotle\n, Cicero, Lucretius, etc. In Snellius's work we see modern physics proceed from ancient physics with continuity.",
  "matematicos_citados_na_biografia": [
    "Peter Ramus",
    "Euclid",
    "Ramus",
    "Aristotle",
    "Ludolph Van Ceulen",
    "Adriaan van Roomen",
    "Tycho Brahe",
    "van Roomen",
    "Brahe",
    "Johannes Kepler",
    "Michael Mästlin",
    "Stevin",
    "Van Ceulen",
    "Apollonius",
    "Pappus",
    "Joost Bürgi",
    "Copernicus",
    "refraction",
    "Christiaan Huygens",
    "Ibn al-Haytham",
    "loxodrome",
    "Plato"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}