{
  "nome_completo": "William Brash",
  "nome_curto": "William Brash",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brash/",
  "data_nascimento": "7 April 1888",
  "local_nascimento": "West Calder, Scotland",
  "data_morte": "25 February 1962",
  "local_morte": "Dunfermline, Scotland",
  "summary": "William Brash graduated from Edinburgh University and went on to teaching posts at Stirling, Aberdeen and Inverness.",
  "biografia": "William Brash\n's father was Robert Brash\n(\nborn in West Calder, Edinburgh about\n1852)\nwho was a vanman and later a stableman. His mother was  Catherine McFarlane Rankine\n(\nborn in Glasgow about\n1856)\n. He had six siblings: Thomas\n(\nborn about\n1876)\n, Eliza\n(\nborn about\n1879)\n, Joseph\n(\nborn about\n1881)\n, Robert\n(\nborn about\n1884)\n, Ellen\n(\nborn about\n1891)\nand James\n(\nborn about\n1894)\n.\nWilliam was living at Dickson's Building, West Calder in\n1891\nand by\n1901\nhad moved to\n12\nSociety Place, West Calder. At the age of seven he entered West Calder Higher Grade School, spending seven years at the school. To prepare for his university studies, Brash then went to George Watson's Boys' College, Edinburgh, when he spent two years. He was able to benefit from this high quality education since he won a Bursary from George Watson's College for Boys in\n1904\nwhich provided free education under sixteen for\n1904\n-\n05\n. In July\n1905\nBrash won the Medal for Mathematics from George Watson's and in October of the same year he first matriculated at the University of Edinburgh. He had been awarded the following Highers in the Leaving Certificate Examination: Mathematics\n(1903)\n, Latin\n(1904)\n, and English, German, Dynamics in\n1905\n.\nNot only did Brash win bursaries at George Watson's, but he also won a Edinburgh University bursary. The university announced the award as follows:-\nEdinburgh University bursaries: October\n1905\nJohn Welsh Mathematical Bursary\n(\nsubject of examination - mathematics, especially pure geometry\n)\nWilliam Brash, George Watson's College.\nAt University, Brash studied Mathematics, Natural Philosophy and Latin in session\n1905\n-\n06\n. The mathematics course was taught by\nCharles Tweedie\nand Brash obtained a First Class pass. In the Natural Philosophy class he obtained a Second Class pass. In session\n1906\n-\n07\nhe studied Chemistry, Political Economy, German, and Logic and Metaphysics. He graduated with an M.A. in\n1910\nwith Third Class Honours in Mathematics and Natural Philosophy. He was also awarded a B.Sc.\n(\nPure\n)\nin\n1912\n.\nBrash returned to West Calder after studying in Edinburgh, then in\n1915\nhe moved to Stirling when he was appointed to Stirling High School. In\n1918\nhe moved to Aberdeen where he taught for a year at Robert Gordon's College before he went to Inverness to take up a post at the High School.\nWilliam Brash married Marjory Byres and had two sons, Robert\n(\nborn in\n1924)\nand Thomas\n(\nborn in\n1926)\n.\nAs many Edinburgh mathematics graduates did, Brash joined the\nEdinburgh Mathematical Society\nafter graduating. In Brash's case he joined in December\n1912\nalthough while his application for membership was being processed he had read a paper to the Society entitled\nTwo general results in the differential calculus\nat the meeting on Friday\n14\nJune\n1912\n. He remained a member of the Society until around\n1932\n.",
  "matematicos_citados_na_biografia": [
    "Charles Tweedie",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}