{
  "nome_completo": "William Browder",
  "nome_curto": "William Browder",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Browder_William/",
  "data_nascimento": "6 January 1934",
  "local_nascimento": "New York City, New York, USA",
  "data_morte": "4 February 2025",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "William Browder is an American mathematician, specialising in algebraic topology, differential topology and differential geometry.",
  "biografia": "William Browder\n's parents were Earl Browder and Raissa Berkmann. William was the youngest of his parents' three children; the two older are\nFelix Browder\n(\nwho has a biography in this archive\n)\nand Andrew Browder. All three boys have become leading mathematicians and so we should begin by giving some details of their parents Earl and Raissa Browder.\nEarl Browder\n(1891\n-\n1973)\n, the eighth of ten children, was educated at home in Wichita by his unemployed schoolteacher father William Browder and from him received his first Socialist teachings. Earl, who joined the Socialist party at age\n16\n, worked as an accountant and took a correspondence school law course. He opposed World War I and was jailed twice between\n1917\nand\n1920\n. The first time was for conspiring to defeat the operation of the draft law\n(\na two year conviction\n)\nand for non-registration\n(\na one-year conviction\n)\n, and the second time for conspiracy. In the\n1920\ns he often visited Russia as a representative of the Communist Trade Unions in the United States. He met Raissa Berkmann at a Soviet social function in Moscow on one of these visits.\nRaissa Berkmann, born in St Petersburg in\n1897\n, graduated with a law degree from the University of St Petersburg in\n1917\n. Since she was Jewish, being admitted to university had not proved easy and it was difficult for anyone Jewish to practise law in Russia. After the Russian Revolution she taught at Moscow University and at the Lenin Institute. Earl Browder had married in\n1911\nbut was separated from his wife. They were divorced in April\n1926\nand Earl and Raissa were married on\n15\nSeptember\n1926\n. The first two of their three children were born in Moscow; Felix in\n1928\nand Andrew in\n1932\n. Earl Browder returned to the United States in\n1929\nbut Raissa remained in Moscow until\n1933\n. She joined her husband in the United States, crossing the Canadian border without a visa. The two boys, having an American father, did not require a visa, but\n[8]\n:-\nAlthough\n[\nRaissa\n]\njoined her husband and lived in New York permanently thereafter, federal officials did not proceed against her until\n1939\n. For the next sixteen years the Browders waged a legal battle to prevent her deportation.\nIn\n1934\ntheir third son, William Browder\n(\nthe subject of this biography\n)\n, was born in New York City. Earl became General Secretary of the Communist Party of the United States in the year that William was born, holding that position for the next eleven years\n[\n7\n]\n:-\n... he provided for his second family \"an urban home of\n[\nculturally\n]\nsuperior circumstances.\" His relationship with his three sons was \"very close.\" Ironically, the children were always fond of the sciences. Although they experienced some discrimination because of their father's beliefs, they all became mathematics professors at major American universities.\nDuring his time at elementary school, William Browder thought about what he wanted to be when he grew up\n[\n1\n]\n:-\nI progressed through architect\n(\nbased on Lincoln Logs and Tinkertoys\n)\n, mechanical engineer\n(\nErector sets\n)\n, chemist, and finally physicist, after the excitement of the atomic bomb. It was in the pages of the 'New York Times' in August\n1945\nthat I first read the description of the atom and nuclear fission and learned the atomic number and weight of the isotopes of uranium. I had read some wild science fiction before that, but this was a wilder reality.\nHigh school only served to strengthen his idea that he wanted to become a physicist. He enjoyed both physics and chemistry courses but he was bored in the mathematics classes. The mathematics he was taught convinced him that it was a boring computational subject devoid of beauty, with the one exception that he saw Euclidean geometry as beautiful. He graduated from the high school and entered the Massachusetts Institute of Technology intent on majoring in physics.\nHis first year at MIT was not quite what he had expected. First there was the realisation that, unlike at school, he was not necessarily the best student in every class. More significantly, he realised that he did not have the manual dexterity of many of the other students when it came to performing experiments in the physics and chemistry laboratories. However, he continued with his science based courses in his second year of study and made another discovery about himself in a mathematical physics course\n[\n1\n]\n:-\nSome of the students had something called \"physical intuition,\" which enabled them to give strange and wonderful answers to questions, which were greeted by the professor with delight but made no sense to me at all. At the same time the professor was making a computational hash of some mathematics that was explained in a very beautiful and motivated way in a mathematics course I was taking.\nThis convinced Browder that his talents were in mathematics rather than physics so, after graduating with a B.S. from MIT in\n1954\n, he began graduate studies in mathematics at Princeton University. He was soon enthralled with\nalgebraic topology\nand worked towards a Ph.D. with John Coleman Moore as his advisor. Browder was appointed as an Instructor in Mathematics at the University of Rochester in\n1957\n. By this time he was still quite a long way from completing work on this thesis. John Moore had given him a problem to work on but he had not made much progress\n[\n1\n]\n:-\nI went off to Rochester with only one small result towards a thesis, to a department where I would have no one in my field to talk to. This in retrospect was a blessing of great proportions. After six months of depression and buoyed by the possibility of a much more interesting job at Cornell, I decided to simply sit down and try and write the simplest things I could deduce about the problem. Suddenly I saw a whole new aspect of the situation and, with energy and enthusiasm, slashed away at a thesis.\nBrowder received a Ph.D. from Princeton in\n1958\nfor his thesis\nHomology of Loop Spaces\n. He was appointed as an Instructor at Cornell University in\n1958\nand, a year later, was promoted to Assistant Professor. He spent the academic year\n1959\n-\n60\nas an NSF Postdoctoral Fellow at the University of Chicago, and at the University of Oxford. His first papers were\nThe cohomology of covering spaces of H-spaces\n(1959)\n,\nHomology operations and loop spaces\n(1960)\n,\nLoop spaces of H-spaces\n(1960)\nand\nHomology and homotopy of H-spaces\n(1960)\n.\nFrank Adams\ncalls this last mentioned paper \"a remarkable study in the homology of H-spaces.\" Browder was promoted from Assistant Professor to Associate Professor at Cornell University in\n1961\n. After spending the academic year\n1963\n-\n64\nas a member of the Institute for Advanced Study at Princeton, he was appointed as a Professor in the Mathematics Department of Princeton University in\n1964\n. He was an invited speaker at the International Congress of Mathematicians in Moscow in\n1966\n, giving the\n30\nminute address\nEmbedding smooth manifolds\n. He was a plenary speaker at the next International Congress of Mathematicians in Nice in\n1970\ngiving the lecture\nManifolds and Homotopy Theory\n.\nBrowder was one of the inventors of surgery theory, which unifies methods and techniques from several branches of topology and applies them to the classification of high-dimensional manifolds. Peter Kahn writes:-\nThis procedure has wide-ranging, deep applications in every area of the topology of smooth manifolds, including transformation groups, classification of manifolds, and imbedding and immersion theory. Analogous techniques and applications hold for PL and topological manifolds.\nOthers who made independent contributions to this important method are\nSergi Novikov\n,\nDennis Sullivan\nand\nTerry Wall\n. Browder published the book\nSurgery on simply-connected manifolds\nin\n1972\n. Peter Kahn writes in a review that the:-\n... book gives a comprehensive introduction to the theory of\n1\n-connected surgery as well as some of the most important applications. It has a number of features that make it especially useful for anyone wishing to learn surgery theory. First, the author takes special pains with the basic algebraic topology and algebra involved in\n1\n-connected surgery ... . Secondly, the book collects a great deal of diverse background information from the literature, giving relatively complete expositions ... . Finally, and perhaps most important, is the way in which the author has organized the theory. After a chapter on preliminaries, he lists seven basic results of surgery theory and then proceeds to derive many important applications of the theory from these. The remainder of the book is devoted to a proof of the seven basic results. This procedure allows the student to arrive at interesting applications before becoming engulfed in the many technical details of the main proofs. It also focuses attention properly on the most significant tools provided by the theory for the study of\n1\n-connected manifolds.\nHis outstanding mathematical achievements and important contributions to the mathematical community naturally led to attempts to persuade him to leave Princeton and chair departments looking to raise their profile. In a letter he wrote in\n1995\n, he gives some details of one such attempt:-\nI was offered the chairmanship of\n[\nthe University of Rochester Mathematics Department\n]\nin\n1986\n, and I had many interesting and impressive conversations about it with many people at Rochester. Though I decided in the end not to leave Princeton, I found the attitudes of the Rochester administration and the Mathematics Department very laudable, and I tried to use my influence in the mathematical community to help in the building effort. I expended considerable effort in influencing people toward going there ...\nBrowder has given remarkable service to the\nAmerican Mathematical Society\nover many years. He was a Member at Large of the Council during\n1967\n-\n69\nand\n1972\n-\n74\n. He was the\nAmerican Mathematical Society\nColloquium lecturer in\n1977\ngiving the lectures\nDifferential topology of higher dimensional manifolds\nat St Louis in January of that year. He was elected Vice President of the Society in\n1977\n-\n78\nhaving served on many of the Society's committees starting with the Proceedings Editorial Committee in\n1963\n. He was President of the Society in\n1989\n-\n91\n. Allyn Jackson, in\n[\n4\n]\n, recalled one difficult debate which took place during his time as President:-\nThe AMS membership was not unanimously against military funding for mathematics. Many thought the Society had no business telling mathematicians whom they should and should not take funding from. I remember a heated Council debate in which William Browder, then AMS president, expressed his strong opposition to blanket condemnations of research grants from the military. He likened such condemnations to a \"witch hunt\" against those who opted to take such grants.\n(\nBrowder, whose father Earl was persecuted because of his leadership of the American Communist Party, is not one to use the term \"witch hunt\" lightly.\n)\nAfter his term as President, Browder gave his retiring presidential address\nIn search of symmetry\nat the AMS meeting in Baltimore, Maryland, in January\n1992\n. In the lecture he\n[\n3\n]\n:-\n... combined short remarks about his presidency with a mathematical lecture - preceded by an informal interview in which he discussed a range of topics, including public awareness of mathematics and his interest in music. The lecture discussed the action of finite groups on manifolds, exploring the question of how large a finite group can effectively act on a given manifold\n(\nhere, \"effectively\" means that there is no subgroup that fixes everything\n)\n. A related question is, what kind of spaces have the given manifold as a covering space? Beginning with the historical roots of these questions, Browder concentrated on familiar examples such as the sphere, the\nn\nn\nn\n-sphere, or a product of spheres of different dimensions.\nIn addition to his work for the\nAmerican Mathematical Society\n, Browder has contributed to the mathematical scene in many other ways. For example he was editor of the\nAnnals of Mathematics\nfrom\n1969\nto\n1980\nand he was chair of the Office of Mathematical Sciences, National Research Council, from\n1979\nto\n1983\n.\nBrowder has received\n(\nand continues to receive\n)\nhonours for his outstanding contributions. He was elected to the\nNational Academy of Sciences\n(1980)\n, the\nAmerican Academy of Arts and Sciences\n(1984)\n, and the\nFinnish Academy of Science and Letters\n(1990)\n. He was a plenary speaker at the British Mathematical Colloquium in\n1979\n, giving the lecture\nTopologies of varieties\n. The\nAmerican Mathematical Society\nheld a Special Session on Homotopy Theory at their Spring Meeting in Lawrenceville in April\n2004\nin honour of Browder's\n70\nth\nbirthday. Let us end this biography by quoting Browder's Statement when standing for the Nominating Committee of the\nAmerican Mathematical Society\nin\n1998\n. It gives a clear picture of how he feels mathematicians should contribute:-\nI would look for candidates who, while having a strong research orientation, have the political skills to contribute to both the smooth running of the organization and to the ongoing efforts to communicate the importance of mathematics to policymakers and to the general public. The building of such a group of people is important to the long-term health of our subject. They should be representative of the diverse interests of the membership, both in mathematical questions and in political and social viewpoints relevant to our community.\nLet us note that he was elected to the Nominating Committee.",
  "matematicos_citados_na_biografia": [
    "Felix Browder",
    "algebraic topology",
    "Frank Adams",
    "Sergi Novikov",
    "Dennis Sullivan",
    "Terry Wall",
    "American Mathematical Society",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Finnish Academy of Science and Letters"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}