{
  "nome_completo": "William Briggs",
  "nome_curto": "William Briggs",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Briggs_William/",
  "data_nascimento": "21 September 1861",
  "local_nascimento": "Leeds, England",
  "data_morte": "19 June 1932",
  "local_morte": "At sea off Arousa Bay, Spain",
  "summary": "William Briggs was the founder and first Principal of the University Correspondence College and the University Tutorial College in London. He set up the University Tutorial Press with printing and book-binding works. He co-authored many mathematics texts designed for private study published by his Press.",
  "biografia": "William Briggs\nwas the son of Edwin Briggs\n(1836\n-\n1921)\nand Mary Ann Barron\n(1837\n-\n1907)\n. Edwin Briggs was a marble and stone mason. William attended the Yorkshire College of Science in Leeds which had been established in\n1874\n. This College, after being a college of Victoria University, became the University of Leeds in\n1904\n. Briggs became an undergraduate at the University of London in\n1881\n. After his studies in London, in\n1883\nhe was appointed to St Benedict's College, Fort Augustus, Scotland. This College opened in October\n1878\nas part of St Benedict's Monastery and College. The monastery became an Abbey directly under the authority of the Pope, breaking away from the English Benedictine Congregation in January\n1883\n. At St Benedict's College, Briggs inaugurated a system of correspondence teaching which he would develop later in London.\nIn\n1887\nBriggs left St Benedict's College, Fort Augustus, and in that year he matriculated at the University of Cambridge as a non-collegiate student. This category of non-collegiate student had been discussed for two decades before it was accepted in\n1869\n. It provided a cheaper route for students who saved the expenses of the Colleges by finding cheap accommodation in the town. Briggs was admitted as a pensioner at Jesus College in October\n1889\n. A pensioner paid their own tuition fees and for their food. He studied the Mathematical Tripos and graduated with a B.A. in\n1890\n. He then studied the Law Tripos and was awarded an LL.B. in\n1891\nand an LL.M. in\n1895\n.\nBriggs married Ada Eliza Wright\n(1865\n-\n1896)\non\n29\nApril\n1882\nin Leeds. They had nine children, four of whom died as babies: Lilian Ada Marie Briggs\n(1882\n-\n1884)\n; William Frank Burrell Briggs\n(1884\n-\n1884)\n; William Robertson Briggs\n(1885\n-\n1968)\n; Frank Clive Briggs\n(1887\n-\n1887)\n; Elsie Baron Briggs\n(1889\n-\n1982)\n; Constance Marie Briggs\n(1891\n-\n1958)\n; Wilfrid Baron Briggs\n(1893\n-\n1893)\n; Winifred Baron Briggs\n(1894\n-\n1977)\n; Cecil Baron Briggs\n(1896\n-\n1969)\n.\nHaving gained some experience on setting up a correspondence system at St Benedict's, Briggs founded the University Correspondence College in London in\n1887\n. Alan Tait writes in\n[\n17\n]\nthat the:-\n... University of London in\n1858\n[\nopened up\n]\na range of programmes for external study: that is to say that students could follow the University of London curriculum for a range of degrees and sit the examinations without ever setting foot in London. ... The University of London has been termed the first 'Open University' because of this move, and students all round the world, but principally within the British Empire and its dominions, were soon looking for tutorial support to supplement the bare syllabus they received on registration wherever they lived. The history of the University Correspondence College and its founder William Briggs provides an insight into the pioneering work, which began in\n1887\nin providing support to those studying with the University of London at a distance. Briggs' college provided a correspondence tuition scheme by post, along with face to face day and evening teaching in London and Cambridge, short residential schools, and the production and sale of specially written texts to help students. Briggs thus prefigured the range of services taken up in modern distance education ..., and his system was very effective. It provided, first of all, support for a crucial opening for women to study for degrees wherever they lived, at a time when they were still excluded from the ancient universities in England.\nAn important part of the University Correspondence College was producing a large range of books that would be suitable for students to study on their own. Briggs, who became the Principal of the University Correspondence College, set up his own publishing company, the University Tutorial Press, in London. But he went further than just a publishing company by also having a printing and bookbinding works at Foxton, near Cambridge. The Correspondence College soon expanded to provide tutorial teaching both in London and in Cambridge. In London the College had premises at\n27\nRed Lion Square.\nHaving a publishing company was only useful if he could get authors to write books. Briggs, himself, co-authored many of the texts producing a whole range of mathematics books with\nG H Bryan\n. The books were very popular and ran to many editions. Of the\n23\nbooks of\nBryan\nwhich we list,\n15\nare joint Briggs-\nBryan\nworks; see\nTHIS LINK\n.\nTo see a little of the ideas that went into Briggs' books, we give a brief extract from the Preface to Briggs and\nBryan\n's\nThe elements of coordinate geometry\n:-\nThis book is written with the conviction that the subject is not too difficult for the ordinary undergraduate who does not aspire to mathematical honours, if the course is carefully graded, and divided into cosy stages. We have tried to realise the position of the average learner, and have constantly borne in mind the needs of the private student: each time, after providing sufficient material for a new set of ideas, we have given illustrative examples, which, in addition to their ordinary use, may be taken as a reminder to review the whole of the ground covered since the last set. It is not sufficient to understand; it is necessary to fix the fresh facts in the mind, and to note their relation to previous ones as they occur. The reader will, we are sure, appreciate the pains we have taken in beginning and ending on a page each important piece of bookwork, and the clearness gained by spacing out the lines of bookwork to be learnt for reproduction.\nIt was not only the UK market that Briggs aimed at, for he sought to enter the American market as well. The American arm was run by W B Clive who writes about\nThe elements of coordinate geometry\nin\nThe Bookseller\n, Volume\n1894\n:-\nThe practical value of Messrs Briggs and\nBryan\n's text-book is raised by its appearance in a further reprint. The clearness with which the subject is stated and typographically arranged, renders the work an invaluable assistant to the private student.\nThe review of\nText-Book of Dynamics\n, another Briggs-\nBryan\nbook, in\n[\n2\n]\nreads:-\nThe University Correspondence College, represented in this country\n[\nUSA\n]\nby W B Clive,\n65\nFifth Avenue, New York, began this school year\n[\n1894]\nwith an enrolment of\n740\n. This is one of the most helpful of the schemes for home culture of a high order. There are studentships and prizes amounting to $\n1\n,\n000\n. The staff of tutors comprise fifteen graduates who took first-class honours at the university examinations, and six honour men. The text-books, of which this on dynamics is one of the best, are all reliable, complete, and adapted to home study under correspondence direction.\nBriggs wrote books with other co-authors, and in\nThe Bookseller\n, Volume\n1894\nwe also see listed his chemistry book\nElementary qualitative analysis\n, co-authored with R W Stewart. In\n1897\nhe edited the book\nGeneral Elementary Science\n. Briggs writes in the Preface to the First Edition:-\nStrange as the new subject may appear at first, we think the University of London has acted wisely in including General Elementary Science as a compulsory subject for the Matriculation Examination. For whether intended as a preliminary course which may form a systematic, though elementary, basis for future scientific study, or as a general encouragement for candidates, who do not mean to pursue the Science curriculum of the University, to regard the working of Nature in everyday life, and to provide them with the means of recording observations with some degree of exactness, it is alike to be commended.\nTo gain that exactness - which is the very essence of Science - it has been deemed desirable to enlist the services of specialists in each of the three sections of the new subject; but for this striving after accuracy, it might appear ridiculous to consider the co-operation of the following well-known authors desirable in so elementary a text-book:-\nIn Section I., Professor\nBryan\n, D.Sc., F.R.S., and A G Cracknell, M.A.\nIn Section II., John Don, M.A., B.Sc., who has had the works of R W Stewart, D.Sc., in the \"University Tutorial Series\" placed at his disposal.\nIn Section III., G H Bailey, D.Sc., Ph.D., and Fred Beddow, D.Sc., Ph.D.\nBriggs writes in the Preface to the Second Edition of\n1898\n:-\nThe fact that a first edition of six thousand copies has been exhausted within five months of publication shows that this work has met the want created by the new London Matriculation syllabus. Advantage has been taken of this to effect certain alterations in the text, all of which the General Editor hopes will increase the value of the work.\nIn\n1890\nhe published the\n134\npage book\nIntermediate mathematics. A guide to the mathematics of the intermediate examinations in arts and science of the University of London. By the principal of University correspondence college\n.\nAs well as the large amount of effort that Briggs was putting into the University Correspondence College, he continued to work for a doctorate and a treatise on the law of international copyright\nThe law of international copyright: with special sections on the colonies and the United states of America\nled to him being awarded an LL.D. in\n1902\n.\nOf course, Briggs' University Correspondence College and Tutorial College taught a wide range of topics, not just mathematics. Realising that biology was becoming important as a subject, he looked for someone to employ as a tutor and found H G Wells\n(\nwho of course is today very well-known as a science-fiction writer\n)\n. Wells wanted to be a teacher but had failed his final examinations at the Normal School of Science\n(\nlater Imperial College, London\n)\n. He had studied with T H Huxley and Briggs saw that he had the talent to become a good teacher. Briggs employed Wells as a tutor, both teaching students by correspondence and giving evening classes for students at the Tutorial College. Briggs encouraged Wells to write a textbook for his University Tutorial Press and he wrote\nText-book of Biology\npublished in\n1893\n. The first edition had diagrams drawn by Wells which reviewers criticised, so a second edition was published with diagrams drawn by Amy Catherine Robbins, one of the students studying at the University Tutorial College. This edition was well received and, we note, Wells later married Amy Catherine Robbins.\nBriggs' University Correspondence College and Tutorial College moved briefly to Booksellers' Row in the Strand, but by\n1909\nwas back in Red Lion Square, now at\n32\n. In\n1911\n, at this Red Lion Square base, it had large science laboratories which were used for teaching all year round. In\n1939\n, Cecil Baron Briggs, Briggs' youngest son, took over as Principal of the Correspondence College and Tutorial College. There are advertisements in\nThe Times\n(13\nJanuary\n1941)\nadvertising its courses in preparation for the University of London and other professional entrance examinations.\nLet us return for a moment to Briggs' family life. We have seen the tragedy of the deaths of four babies, but, on\n18\nSeptember\n1896\n, his wife Ada Eliza Briggs died aged\n33\nyears. From\n1905\nBriggs lived at Owlbrigg, Chaucer Road, Trumpington\n(\nalthough at the\n1911\ncensus the house is listed as: Occupier, Dr Briggs, Uninhabited\n)\nand we certainly know that from\n1920\nMargaret Briggs, William Briggs' second wife, also lived at this address. We have no information as to when he married Margaret, but she attended the two memorial services held after his death. Let us first note that Briggs died at sea in Arousa Bay, off the coast of Spain. The two memorial services are described in\n[\n18\n]\nand\n[\n19\n]\n. One was on\n27\nJune\n1932\nat St John's Church, Red Lion Square, London. We note that this church was destroyed in the bombing during World War II in\n1941\n. The second memorial service was held in Jesus College Chapel, Cambridge. The Dean of the College officiated and the Master of the College read the lessons. Twelve tutors from the University Correspondence College attended as did W Beckit Burnie\n(\nDeputy Principal, University Correspondence College\n)\n, Arnold Saxelbye\n(\nVice-Principal, University Correspondence College\n)\n, and B A Foyle\n(\nUniversity Tutorial Press\n)\n.\nFinally we quote from\n[\n12\n]\n:-\n[\nBriggs\n]\nwas  generous benefactor to Jesus College and founded a Trust for helping undergraduates of the College who required financial help to continue their education. He was a prominent Freemason and was a past Grand Treasurer of England. Direct connections with astronomy that may be mentioned are that he was a member of the large party that made the voyage to Vadsö, Norway, to see the eclipse of the sun in\n1896\n, and an excellent treatise on Mathematical Astronomy by Barlow and\nBryan\nwas written at his instigation.\nThey may have gone \"to see the eclipse of the sun\" but they did not see it since there was total cloud cover.",
  "matematicos_citados_na_biografia": [
    "G H Bryan",
    "Bryan",
    "THIS LINK"
  ],
  "imagens": [
    "briggs_william.jpg"
  ]
}