{
  "nome_completo": "Winifred Margaret Deans",
  "nome_curto": "Winifred Deans",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Deans/",
  "data_nascimento": "9 October 1901",
  "local_nascimento": "New Milton, Hampshire, England",
  "data_morte": "7 Jun 1990",
  "local_morte": "Milltimber, Peterculter, Aberdeenshire, Scotland",
  "summary": "Winifred Deans graduated from Aberdeen and Cambridge. After a period in teaching she joined a Scottish publishing company and translated many important German scientific texts for them. After World War II she worked at the Commonwealth Bureau of Animal Nutrition in Aberdeen.",
  "biografia": "Winifred Deans\n' parents were Duncan Deans, a hosiery buyer from Aberdeenshire, and Mary Ann Sharp from Aberdeen. They were married on\n18\nNovember\n1897\nin Aberdeen and had two children, Winifred and her brother Maxwell born in\n1907\n. Winifred studied at the University of Aberdeen, graduating with an MA with First Class Honours in Mathematics in\n1922\n. In the following year she was awarded a B.Sc. also from Aberdeen. She then followed the route followed by many in earlier years and, after taking a Scottish degree, went to Cambridge. Deans studied at Newnham College, Cambridge, and took Part I of the Mathematical Tripos in\n1925\n, being awarded a BA ranked in the First Class.\nDeans was then appointed Assistant Mathematics and Physics Mistress at the County Secondary School for Girls, in Harrow, but after two years returned to Aberdeen where she was awarded a Diploma in Education in\n1927\n. However, Deans decided to leave teaching and, in\n1927\n, took a position as an Assistant Science Editor with Messrs Blackie and Sons, Ltd., who were well-known publishers based in Glasgow.\nWith Blackie and Son, Deans used both her knowledge of mathematics and physics, together with her language skills, to become a leading translator of German texts. For example she translated\nSelected Papers on Wave Mechanics by L de Broglie and L Brillouin\nand her translation was published by Blackie and Sons in\n1928\n. Her translation of Richard Gans'\nVector analysis and applications to physics\nwas published in\n1931\nand, in the following year, her translation of Pohl Robert Wichard's\nPhysical Principles of Mechanics and Acoustics\n. Other translations by Deans include\nThe structure of molecules\n, written by Peter J W Debye, Perhaps her most famous translations from German to English, however, are\nMax Born\n's The restless universe which was published by Blackie and Sons in\n1935\nand the\n1939\npublication\nGreenland journey, the story of Wegener's German expedition to Greenland in\n1930\n-\n31\nas told by members of the expedition and the leader's diary\nedited by Else Wegener, with the assistance of Dr Fritz Loewe, translated from the\n7\nth\nGerman edition by Winifred M Deans.\nIn\n1945\n, after World War II, Deans was appointed to the Commonwealth Bureau of Animal Nutrition at Aberdeen's Rowett Institute. She remained working there until she reached retirement age in\n1966\n. Her papers are now held by the Library of the University of Aberdeen:-\nAfter considerable sorting and some weeding, Winifred's library was distributed amongst the University's Special Collections and the general library stock. Eleven boxes of personal papers belonging to her and her brother, Maxwell\n(1907\n-\n83)\n, were deposited in the University Archives. These personal papers include University lecture notes taken whilst studying in Aberdeen and subsequently,\n1919\n-\n31\n;\n29\nissues of 'My Magazine', dating from the early\n20\nth\nCentury; albums of family photographs and postcards, late\n19\nC- c\n1940\n; together with miscellaneous notes on Swedish history and other topics.\nThe latest acquisition comprises an 'Official Guide: Empire Exhibition Scotland\n1938\n', a season ticket issued to Winifred Deans, and official Exhibition lettercards and postcards showing images of the exhibition sites and buildings, in both sepia and colour views. The most appealing of these is a booklet of Valentine's Snapshots, containing\n12\nbeautiful photographs of the night-time illuminations of the Exhibition lake and fountains.",
  "matematicos_citados_na_biografia": [
    "Max Born"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}